[{"ingredients": ["1 maracuyá, reducido a la mitad", "50ml / 2fl oz de vino blanco", "2 cucharadas de azúcar", "1 cucharada de harina de maíz", "1 cucharadita de agua fría", "2 huevos de gallinas camperas, solo blancos", "1 maracuyá, reducido a la mitad", "1 naranja, solo jugo", "1 cucharada de azúcar glas", "1 cucharada de harina de maíz", "1 cucharadita de agua fría", "100ml / 3½ fl oz crema doble", "1 cucharada de yogur al estilo griego", "1 lima, ralladura solamente"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los soufflés, saque la carne de la fruta de la pasión y colóquela en una cacerola. Reserve las conchas.", "Agregue el vino blanco y el azúcar a la sartén y caliente a fuego lento. En un tazón pequeño, mezcle la harina de maíz y el agua y vierta en la mezcla de maracuyá, revolviendo hasta que el líquido comience a espesarse. Retirar del fuego y dejar enfriar ligeramente.", "Para la salsa, saque la carne de las mitades de la fruta de la pasión y coloque en otra cacerola a fuego medio, reservando las cáscaras. Agregue el jugo de naranja y el azúcar glasé. Mezcle la harina de maíz y el agua fría para hacer una pasta suave y luego agregue a la sartén. Reduzca el líquido a fuego alto hasta que espese.", "Para la crema de lima, bata la crema hasta que espese y dobla en el yogur y la ralladura de limón. Dejar de lado.", "Para los soufflés En un tazón grande, bata las claras de huevo hasta que se formen picos suaves cuando se quita el batidor del tazón. Doble suavemente la mezcla de fruta de la pasión, luego divida la mezcla por igual entre las cuatro mitades de cáscara de maracuyá. Coloque en una bandeja para hornear y hornee en el horno durante 2-3 minutos, o hasta que estén dorados y se hayan levantado.", "Para servir, transfiera cuidadosamente los soufflés de fruta de la pasión a un plato y rocíe alrededor de la salsa. Agregue una cucharada de crema de lima a un lado, espolvoree con azúcar glas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_passionfruitsouffles_88944", "title": "Fruta de la pasión soplada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Leche 400ml / 14fl oz", "8 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "400 ml / 14 fl oz crema doble", "8 maracuyá, semillas recogidas", "200 g / 7 oz de azúcar en polvo", "200 ml / 7 fl oz de agua", "6 maracuyá, semillas recogidas", "6 hojas de gelatina, empapadas en agua fría hasta que se ablanden", "25g / 1oz de mantequilla, ablandada", "4 cucharadas de azúcar en polvo", "4 claras de huevo de gallinas camperas", "175ml / 6fl oz de crema de vainilla lista para usar", "4 maracuyá, semillas recogidas", "1 barra de panal recubierta de chocolate, desmenuzada"], "method": ["Para el helado, lleve la leche a ebullición en una sartén de base pesada. Retire del fuego de inmediato.", "Coloque las yemas de huevo y el azúcar en un tazón y bata hasta que estén pálidos y esponjosos. Vierta la leche tibia sobre las yemas de huevo, batiendo bien hasta que esté suave y bien combinado. Vierta la mezcla de nuevo en la sartén y vuelva a calentar a fuego lento.", "Batir las semillas de crema y maracuyá. Cocine durante 3-4 minutos más, revolviendo ocasionalmente, hasta que la mezcla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara de madera. (No permita que la mezcla hierva)", "Retirar del fuego y reservar para enfriar. Una vez que se haya enfriado, vierta la mezcla en una máquina para hacer helados y batir según las instrucciones del fabricante. Transfiera el helado batido a un recipiente a prueba de congelación y enfríelo en el congelador hasta que lo necesite. Saque el helado del congelador unos 10 minutos antes de servirlo para ablandarlo ligeramente.", "Para la gelatina, coloque el azúcar y el agua en una cacerola y lleve a ebullición, revolviendo hasta que el azúcar se haya disuelto. Reduzca el fuego a fuego lento y cocine por 2-3 minutos, o hasta que la mezcla se espese, luego agregue las semillas de maracuyá. Retire del fuego.", "Exprima el exceso de humedad de la gelatina empapada y mezcle con la mezcla de azúcar tibia hasta que se disuelva. Vierta la mezcla de gelatina en la bandeja de horneado preparada y enfríe en la nevera durante al menos 1 hora, o hasta que la gelatina se haya solidificado. Usando un cortador redondo de 7.5cm / 3in, corte cuatro círculos de gelatina. Coloque en una bandeja forrada con película adhesiva y coloque de nuevo en la nevera hasta que se necesite.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el soufflé engrase ligeramente 4 moldes grandes con la mantequilla, luego espolvoree con la mitad del azúcar impalpable.", "Batir las claras de huevo en un tazón limpio grande hasta que se formen picos suaves. Agregue el azúcar impalpable restante y mezcle hasta que se formen picos fuertes.", "Doble suavemente las semillas de vainilla y fruta de la pasión hasta que se combinen. Coloque la mezcla con cuidado en los moldes preparados y coloque en una bandeja para hornear.", "Hornee los soufflés en el horno durante 10 minutos, o hasta que estén dorados y se hayan levantado.", "Mientras tanto, comienza a plaquear el postre. Coloque una ronda de gelatina en un lado de cada plato de servir. Cubra la gelatina con un poco de la barra de chocolate desmenuzada en forma de panal, luego coloque una bola de helado encima del crumble. Retire los soufflés del horno y colóquelos junto a la gelatina. Polvo con azúcar glas y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_passionfruitsoufflew_93715", "title": "Soufflé de maracuyá con maracuyá y helado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "75g / 3oz de mantequilla fría sin sal, cortada en cubos", "pizca de sal", "100g / 3½ oz de azúcar glas, tamizada", "50ml / 2fl oz de leche entera", "2 yemas de huevo de gallinas camperas", "1 huevo, batido, para lavar huevos", "Azúcar en polvo de 550 g / 1 libra 3½ oz", "150ml / 5fl oz de agua", "12 maracuyá, cribada para recolectar pulpa y jugo solamente", "9 huevos de gallinas camperas", "300ml / 10½ fl oz crema doble", "azúcar glas, para servir"], "method": ["Para hacer la masa, coloque la harina, la mantequilla, la sal y el azúcar glas en un procesador de alimentos y pulse hasta que empiece a parecer pan rallado.", "Agregue la leche y las yemas de huevo y pulse de nuevo hasta que se junte como una masa.", "Convierta la masa en una superficie de trabajo enharinada y extiéndala a un diámetro de 5 cm / 2 pulgadas más grande que una caja de tarta de 28 cm / 11 pulgadas. Empuje la masa en la base de la caja de tarta, dejando el exceso colgando sobre los lados, y transfiera a la nevera para enfriar por al menos 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Cubra la caja de repostería fría con papel de aluminio y cubra con arroz o frijoles para hornear. Transfiera al horno para hornear por 20 minutos, luego quite el arroz o frijoles y papel de aluminio. Cepille la masa con el lavado de huevos y vuelva al horno para hornear durante otros diez minutos, hasta que estén dorados. Retire del horno y recorte el exceso de masa con un cuchillo afilado. Deja enfriar.", "Reduzca el calor del horno a 170C / 340F / Gas 3.", "Para el relleno, coloque 200 g / 7 oz del azúcar y el agua en una olla y caliéntelo suavemente hasta que el azúcar se disuelva.", "Agregue el jugo de fruta de la pasión, revuelva bien, luego retírelo del fuego y déjelo enfriar.", "En un tazón, bata los huevos con el azúcar restante, hasta que estén pálidos y claros, luego agrega la crema.", "Con una cuchara ranurada, retire tres cuartas partes de la pulpa de la fruta de la pasión del jarabe y agregue a la mezcla de crema junto con una cucharada de la mezcla de jugo de fruta de la pasión enfriada. Reserve algunos de los jugos restantes para usar como salsa extra.", "Vierta la mezcla de huevo y crema en la caja de tarta cocida, luego transfiera al horno en el estante del medio para hornear durante aproximadamente 40 minutos, o hasta que el relleno esté casi listo. Todavía debe estar un poco tambaleante, pero continuará cocinando después de que se retire del horno y se establecerá.", "Para servir, espolvorear la tarta con azúcar glas y rociar con una cucharada de la salsa restante."], "url": "www_bbc_co_uk_food_recipes_passionfruittart_85085", "title": "Tarta de fruta de la pasión", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de linguine seco", "2 cucharadas de aceite de oliva virgen extra", "200g de tomates cortados en lata", "1 diente de ajo", "2 anchoas saladas, enjuagadas y deshuesadas, o 4 filetes de anchoa", "2 pizcas de copos de chile seco", "1 cucharada de alcaparras, enjuagadas", "12 aceitunas negras, piedras removidas si lo desea", "puñado de hojas de albahaca", "sal marina"], "method": ["Agregue 2 cucharadas de sal a 2 litros de agua y lleve a ebullición en una cacerola grande. Agregue el linguine y vuelva a hervir rápidamente. Cocine hasta que el linguine esté al dente.", "Mientras tanto, caliente el aceite en una sartén. Agregue los tomates y una pizca de sal y cocine a fuego alto durante 2-3 minutos, revolviendo con frecuencia.", "Amasar el ajo y las anchoas con los trozos de chile y agregarlos a los tomates, bajar el fuego a fuego lento y cocinar por 2-3 minutos, machacar las anchoas en una pasta con una cuchara de madera o un tenedor.", "Agregue las alcaparras y las aceitunas y cocine por un minuto más. Mientras tanto, rápidamente drene el linguini, luego agréguelo a la salsa y caliente.", "Divida la pasta puttanesca entre dos platos y raspe las hojas de albahaca antes de servir."], "url": "www_bbc_co_uk_food_recipes_pasta_puttanesca_81206", "title": "Linguine alla puttanesca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_puttanesca_81206_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 200g / 7oz '00'", "1 huevo de gallinas camperas y 6 yemas de huevo", "50 g / 1¾oz de harina de sémola fina", "2 cucharadas de aceite de oliva", "1 cebolla roja pequeña, picada", "2 palitos de apio picados", "1 diente de ajo, finamente picado", "1 cucharadita de Romero fresco picado", "Filete de res 150 g / 5½ oz, cortado en tiras", "150ml / 5fl oz de vino tinto", "1 x 400 g de tomate picado", "50 g / 1¾oz de mantequilla sin sal", "125 g / 4½ oz de ricotta", "nuez moscada recién rallada, al gusto", "½ limón, solo ralladura", "1 yema de huevo, batida", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 dientes de ajo, en rodajas finas", "1 ramita de tomillo, hojas recogidas", "1-2 calabacines grandes, rallados o cortados en tiras con un pelador de verduras", "75g / 2½oz de mantequilla sin sal", "75g / 2½oz de mantequilla sin sal", "150g / 5½oz de parmesano recién rallado"], "method": ["Para la pasta, coloque la harina, el huevo y las yemas de huevo en un procesador de alimentos y pulse hasta que estén bien combinados y la mezcla se una como masa. Coloque la masa en un recipiente, cúbrala con una película adhesiva y colóquela en el refrigerador para que descanse durante 30 minutos.", "Cortar la masa de pasta por la mitad y alimentar a una de las piezas a través de una máquina de pasta de acuerdo con las instrucciones de la máquina, terminando en la configuración más delgada. Pase a través de un cortador de tallarines. Aparte la otra mitad para los tortellini.", "Para los boloñeses, caliente una cacerola grande a fuego pesado a fuego medio. Cuando esté caliente, agregue el aceite de oliva, la cebolla, el apio, el ajo y el romero y cocine hasta que esté suave. Suba el fuego, agregue la carne y cocine hasta que se dore por todas partes. Agregue el vino y los tomates picados y cocine a fuego lento. Cocine suavemente durante 20-25 minutos, o hasta que la salsa sea rica y reducida. Condimentar con sal y pimienta.", "Para los ricotta tortellini, ponga la ricota en un tazón y sazone con sal y pimienta negra recién molida, un poco de nuez moscada rallada y la ralladura de limón. Mezcle hasta que esté bien combinado. Dejar de lado hasta que sea necesario.", "Aplane la masa de pasta reservada ligeramente con un rodillo, luego comience con la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa a través de la máquina con la otra.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes. Repita este proceso, enharinando la máquina y cambiando la configuración cada vez, hasta llegar a la configuración más delgada. Puede cortar la pasta en láminas individuales más pequeñas y trabajarlas individualmente, manteniendo la masa restante sin usar cubierta debajo de una película adhesiva para evitar que se sequen.", "Recorta los círculos de las hojas de pasta con un cortador de pasteles de 4-5 cm / 1,5-2 pulgadas, luego cepilla cada círculo con el huevo batido. Coloque una cucharadita colmada del relleno de ricotta en la mitad del círculo, luego doble la otra mitad de la pasta y presione para sellar. Traiga las dos esquinas inferiores de la media luna juntas para crear un círculo y pellizque para sellar. Repita con la pasta restante y la mezcla de relleno, colocando cada tortellini terminado en una bandeja forrada con papel resistente a la grasa. Dejar de lado.", "Cocine los tortellini, en tandas, en una sartén con agua salada hirviendo durante 2 o 3 minutos, o hasta que floten en la superficie y estén al dente. Eliminar con una cuchara ranurada. Reserve un poco de agua de cocción para la salsa.", "Para el calabacín y la salsa de ajo, caliente una sartén grande hasta que esté caliente, agregue el aceite y el ajo y fría por 1-2 minutos. Agregue el tomillo y el calabacín y un poco de la pasta de agua de cocción. Agregue la mantequilla y sazone con sal y pimienta.", "Para servir, cocinar los tallarines por 2-3 minutos, o hasta que estén al dente, luego escurrir bien y mezclar con el boloñesa y la mantequilla. Mezcle todo junto. Coloque los tortellini en la salsa de calabacín y mezcle justo antes de servir. Sirve la pasta a la boloñesa y los tortellini en tazones separados, adornado con queso parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_pasta_bolognese_and_93159", "title": "Pasta a la boloñesa y ricotta tortellini con salsa de calabacín y ajo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["130 g / 4½ oz de sémola", "130 g / 4½ oz harina 00", "120 g / 4 oz de yema de huevo (alrededor de 6 yemas grandes)", "1.5 litros / 2½ pintas de caldo de pollo", "20g / ¾oz 'nduja, picado o use pancetta", "½ cebolla, finamente picada", "2 tallos de apio, incluidas las hojas, finamente picadas", "1 zanahoria pequeña, rallada en un microplano fino", "pequeños pizcas de chile seco", "1 diente de ajo, aplastado", "1 x 400 g de judías borlotti", "100-125 g / 4-4½ oz de tomates en conserva de buena calidad, sin piel y sin semillas", "1 cucharadita de puré de tomate", "2-4 cucharadas de aceite de oliva virgen extra", "sal y pimienta", "1 cucharada de berro de micro albahaca", "1 cucharada de micro bebé acedera de vena roja"], "method": ["Para los cavatelli, junte todos los ingredientes en un tazón grande o procesador de alimentos y forme una masa. Permita que la masa descanse durante al menos una hora en la nevera antes de darle forma a la pasta.", "Para hacer los cavatelli, corta la pasta en pedazos y rueda en bastones largos. Cortar en pedazos de 1cm / ½. Usando un cuchillo afilado, enrolle el cuchillo a lo largo de la pasta para crear envolturas pequeñas enrolladas.", "Para la pasta fazool, hierva el caldo de pollo en una cacerola.", "En una sartén por separado, a fuego medio a bajo, agregue el nduja y deje que salga algo de grasa. Agregue la cebolla finamente picada y cocine brevemente durante 2-3 minutos, hasta que el n'duja se haya derretido y la cebolla esté suave y translúcida. Agregue el apio y la zanahoria y cocine durante 5 minutos. Agregue el chile y el ajo. Cocine por 5 minutos sin dejar que el ajo se dore.", "Agregue los frijoles y suficiente caldo de pollo hirviendo para cubrir la mezcla. Deje que todo esto se cocine durante 10 minutos y luego quite aproximadamente un tercio de los granos. Mash o mezclarlos y luego ponerlos en la sartén.", "Agregue los tomates y revuelva, agregue el puré de tomate, cocine por un par de minutos y sazone con sal y pimienta, al gusto.", "Agregue 150 g / 5½ oz de la pasta al caldo de pollo y cocine durante 8-10 minutos. Luego drene y agregue la pasta a los frijoles con algo del caldo - la consistencia no debe ser demasiado espesa, pero no muy seca. Termine con la albahaca, la acedera de vena bebé roja y un poco de aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_pasta_fazool_04131", "title": "Pasta fazool", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de harina blanca fuerte, más extra para espolvorear", "2 cucharaditas de sal", "425ml / 15fl oz de agua tibia", "7 g de levadura seca", "4 cucharadas de aceite de oliva, más extra para engrasar", "4 dientes de ajo, muy finamente picados", "1 cebolla roja, finamente rebanada", "puñado de aceitunas negras deshuesadas", "3 cucharadas de aceite de oliva", "3 dientes de ajo, aplastados", "3 filetes de anchoa", "2 x 400 g de tomates de ciruela, escurridos", "60g / 2¼ oz de aceitunas negras, preferiblemente curadas al aceite, sin hueso", "2 cucharadas de alcaparras", "pellizcar copos de chile rojo seco", "450 g / 1lb de linguine", "pequeño puñado de perejil fresco o albahaca, toscamente picado, para adornar", "sal y pimienta negra recién molida"], "method": ["Para la focaccia, ponga la harina y la sal en un tazón grande y haga un pozo en el medio. Mezcle el agua tibia con la levadura y 2 cucharadas de aceite en otro recipiente. Deje reposar por 10 minutos, luego lentamente combine el líquido con la harina hasta que se forme la masa. Convierta la masa en una superficie enharinada y amasar durante 4-5 minutos, hasta que quede suave y elástica. Engrase ligeramente un tazón de mezcla limpio y coloque la masa en él. Cubra y deje probar durante 45 minutos-1 hora, o hasta que duplique su tamaño. Golpee la masa y amasar durante 2-3 minutos más.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Corta a la mitad la masa y dale forma a cada mitad en un rectángulo plano, luego ponlos en dos bandejas para hornear ligeramente engrasadas. En un tazón, mezcle el ajo con las 2 cucharadas restantes de aceite y reparta sobre la masa. Haga incrustaciones en toda la masa con el pulgar, luego presione las cebollas y las aceitunas. Hornee durante 15-20 minutos, o hasta que estén dorados y firmes.", "Mientras tanto, haz la pasta puttanesca. Caliente 2 cucharadas de aceite en una sartén a fuego medio-bajo. Agregue el ajo y las anchoas y fría hasta que el ajo esté ligeramente dorado. Aplasta los tomates con un tenedor o con las manos y agrégalos a la sartén. Agregue una pizca de pimienta negra y cocine a fuego medio-alto durante 10 minutos, o hasta que los tomates se rompan y creen una salsa. Agregue las aceitunas, las alcaparras y las hojuelas de chile y cocine a fuego lento durante 10 minutos.", "Ponga a hervir una olla grande de agua con sal y cocine la pasta de acuerdo con las instrucciones del paquete. Escurra rápidamente, retenga un poco del agua de cocción, y mezcle la pasta y el agua retenida con la salsa y el restante 1 cucharada de aceite. Condimentar con sal y pimienta.", "Para servir, coloque la pasta en el centro de un recipiente poco profundo y adorne con perejil o albahaca. Disfruta con la focaccia."], "url": "www_bbc_co_uk_food_recipes_pasta_puttanesca_with_53471", "title": "Pasta puttanesca con ajo y focaccia de cebolla roja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["275g / 9¾oz 00 harina de pasta", "2 huevos enteros de gallinas camperas", "3 yemas de huevo de gallinas camperas", "aceite de oliva, para freír", "500 g / 1 libra de paleta de cerdo cocida de 2 onzas, cortada en cubos", "1 bulbo de hinojo, raíz y corte en cubos, hojas frondosas reservadas, la cabeza finamente rebanada y colocada en agua helada para la guarnición", "2 palitos de apio, en rodajas finas", "1 zanahoria mediana, finamente rebanada", "2 dientes de ajo, en rodajas finas", "pequeño racimo de perejil fresco, solo hojas", "pizca de copos de chile", "150ml / 5fl oz de aceite de oliva, más extra para freír", "50 g / 1¾oz de pan rallado seco", "2 limones, cáscara de 2, jugo de ½", "sal marina, al gusto", "2 achicoria grande", "aceite de oliva virgen extra", "100 ml / 3½ fl oz de caldo de pollo", "100ml / 3½ fl oz crema doble", "1 limón, solo jugo (al gusto)", "1 cucharada de cebollines finamente picados"], "method": ["Para la pasta, coloque la harina en un procesador de alimentos y pulse. Agregue los huevos enteros y las yemas de huevo y siga batiendo hasta que la mezcla se asemeje a pan rallado fino (no debe ser polvoriento ni debe ser una bola grande y pegajosa). Esto toma 2-3 minutos.", "Incline la masa y amasar para formar una bola. Amasarlo enérgicamente por un minuto - debe ser bastante rígido y difícil de amasar. Envuelva la película adhesiva y déjela reposar en la nevera durante 30 minutos antes de usarla.", "Divida la masa en dos y mantenga una de las piezas envuelta en una película adhesiva. Doble la masa y páselo a través de la máquina de pasta en su posición más ancha, doblándola y enrollándola siete veces (sin cambiar la configuración) hasta que tenga una forma rectangular. Es importante trabajar la masa hasta que esté agradable y brillante, ya que esto le da la textura \"al dente\".", "Continúe colocando la pasta a través de la máquina de pasta, disminuyendo la inclinación del rodillo grado por grado con cada pase. Estire cada mitad en una hoja tan ancha como la máquina de pasta permita el ajuste de espesor número uno. Repita con la segunda pieza de masa.", "Cocine la pasta en una sartén con agua salada hirviendo durante un minuto, escurra y luego revierta en agua helada. Escurrir y secar en una toalla de té.", "Coloque varias capas de película adherente (verticalmente) superpuestas en una superficie de trabajo y coloque la primera hoja de pasta horizontalmente hacia la parte inferior de la película adherente y luego superponga la segunda hoja de pasta sobre la primera aproximadamente 3 cm / 1¼ pulgadas para crear una gran hoja de pasta", "Coloque una toalla de té húmeda sobre la pasta para evitar que se seque mientras realiza el llenado.", "Para el llenado, precaliente el horno a 160 C / 325 F / Gas 3.", "Calentar un chorrito de aceite de oliva en una sartén y freír el cerdo cortado en cubitos hasta que se dore. Agregue las tapas de hinojo en rodajas y la raíz, el apio, la zanahoria, el ajo, el perejil y las hojuelas de chile y cocine por dos minutos, o hasta que estén suaves.", "Agregue el aceite de oliva y las migas de pan. Agregue el jugo de limón y la ralladura de limón y sazone con sal al gusto.", "Quite el fuego, transfiéralo a un procesador de alimentos y mezcle hasta lograr una pasta suave.", "Extienda la mezcla de cerdo sobre la lámina de pasta dejando un espacio libre de 3-4cm / 1¼-1½ en la parte superior e inferior. Para obtener el relleno uniformemente extendido, coloque una película adhesiva sobre la parte superior y use un rodillo para extender.", "Cuando esté bien distribuido, arrángalo como un rollo suizo, usando la película adhesiva para ayudarlo, manteniéndolo agradable y apretado. Envuelva el exceso de película adhesiva alrededor del rotolo y, si tiene tiempo, refrigere hasta que esté firme.", "Cortar en rodajas de 2-3cm / ¾-1¼in, enharinar ligeramente a cada lado del rotolo y freír en más aceite de oliva hasta que estén ligeramente doradas en cada lado. Transfiera a una bandeja para hornear y hornee durante dos minutos.", "Para la achicoria batida, corte la achicoria por la mitad. Recorte la raíz y corte finamente longitudinalmente.", "Fría por un minuto en un chorrito de aceite de oliva. Agregue el caldo y cocine hasta que el líquido se haya reducido hasta que esté casi agotado, luego agregue la crema y reduzca el líquido en tres cuartas partes.", "Agregue unas gotas de jugo de limón para cortar la riqueza de la crema y agregue sal, al gusto.", "Para servir, escurra el hinojo raspado, que ahora está crujiente, del agua helada y séquelo con un hilandero para ensaladas o un paño de cocina.", "Vístase con sal marina finamente molida, jugo de limón recién exprimido, hojas de hinojo finamente picadas y aceite de oliva virgen extra. Sirve el rotolo con la crema de achicoria y el hinojo."], "url": "www_bbc_co_uk_food_recipes_pasta_rotolo_with_82739", "title": "Pasta rotolo con crema de escarola", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de almendras en sus pieles", "gran puñado de albahaca (alrededor de 30 g / 1 oz), rasgado (reservar algunas hojas para la decoración)", "4 dientes de ajo, picados", "300g / 10½oz de tomates cherry, cortados a la mitad", "50 g / 1¾oz de queso pecorino (o queso duro vegetariano), rallado, más extra para servir", "6 cucharadas de aceite de oliva", "8 vueltas de peppermill negro", "½ cucharadita de sal, más extra para cocinar", "Espaguetis, linguine o bucatini de 500 g / 1lb 2oz, para servir"], "method": ["Poner a hervir una olla de agua y blanquear las almendras durante unos minutos. Drene y reserve para enfriar, luego pellizque las pieles.", "Tueste las almendras en una sartén seca a fuego medio-alto. Mantenlos en movimiento para evitar quemaduras; deberían ser un color dorado claro.", "En un procesador de alimentos, pulse las almendras hasta que se asemejen a pan rallado. Agregue la albahaca y el ajo y pulse un par de veces. Sugerencia en un tazón.", "Mezcle los tomates, el pecorino y el aceite. Sazonar con sal y pimienta.", "Poner a hervir un sartén con agua con sal y cocinar la pasta hasta que esté al dente. Escurrir y revolver el pesto. Servir, adornado con albahaca, con abundante pecorino."], "url": "www_bbc_co_uk_food_recipes_pasta_with_almond_basil_68146", "title": "Pasta con pesto de almendras, albahaca y pecorino (Pesto Trapanese)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_with_almond_basil_68146_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["130g / 5oz de guanciale (carrilleras de cerdo curadas), cortadas en pequeños cubos", "1 cebolla pequeña, finamente picada", "3-4 cucharadas de aceite de oliva virgen extra", "1 chile rojo seco y caliente, finamente picado", "2 cucharadas de vino blanco seco", "500g / 1lb 2oz de tomates San Marzano, cortados en cuartos", "Pasta bucatini 400 g / 14 oz", "80g / 3oz de pecorino, recién rallado"], "method": ["Para la salsa, coloca la guanciale y la cebolla en una sartén con el aceite y el chile, y freír suavemente durante unos 4-5 minutos. Agregue el vino blanco y los tomates y cocine durante 15-20 minutos más, revolviendo ocasionalmente.", "Mientras tanto, ponga a hervir una cacerola grande de agua ligeramente salada y cocine la pasta hasta que esté al dente. Cuele los bucatini y mezcle con la salsa. Servir espolvoreado generosamente con el pecorino recién rallado."], "url": "www_bbc_co_uk_food_recipes_pasta_with_chilli_bacon_13839", "title": "Pasta con chile, tocino y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_with_chilli_bacon_13839_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz rigatoni o penne pasta", "2 cucharadas de aceite de oliva virgen extra", "1 cebolla blanca, finamente picada", "2 dientes de ajo, ligeramente triturados pero dejados enteros", "sal y pimienta negra recién molida", "Vodka con sabor a chile 100 ml / 3½ fl oz", "300g / 10½oz de salmón ahumado en caliente (ver 'Punta de la receta superior' a continuación)", "Crema doble 600ml / 20fl oz", "2 cucharadas de perejil fresco picado, para servir"], "method": ["Ponga la pasta en una olla grande llena de agua hirviendo con sal y hierva de acuerdo con las instrucciones del paquete.", "Mientras tanto, caliente el aceite de oliva en una sartén grande y fríe la cebolla y el ajo a fuego medio hasta que estén suaves, pero no coloreados, unos cinco minutos.", "Agregue una pizca de sal, teniendo en cuenta que el salmón ya estará salado y una generosa pizca de pimienta negra.", "Vierta el vodka de chile y enciéndalo si lo desea (tenga cuidado de retroceder hasta que las llamas se hayan calmado) o simplemente déjelo por un par de minutos para quemar el alcohol.", "Coloca el salmón en la sartén y vierte la crema. Cocine a fuego lento hasta que la salsa se espese y la pasta esté al dente.", "Escurrir la pasta a través de un colador y agregarla a la sartén con el salmón y la crema. Mezcle suavemente para no romper aún más el salmón y servir con una pizca de perejil fresco."], "url": "www_bbc_co_uk_food_recipes_pasta_with_hot_smoked_93788", "title": "Pasta con salmón ahumado en caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "250g / 9oz de pasta tagliolini fresca, blanqueada y escurrida", "1 cucharada de cada perejil fresco picado finamente, albahaca, cebollín, cilantro y eneldo", "sal y pimienta negra recién molida", "55 g / 2 oz de mantequilla"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Rompe los huevos en un tazón grande y bate bien. Agregue la pasta y las hierbas, sazone bien con sal y pimienta negra recién molida y mezcle bien.", "Caliente la mantequilla en una sartén pequeña a prueba de horno, vierta el huevo y la mezcla de pasta y cocínelos durante 3-4 minutos, hasta que queden dorados y ligeramente dorados en el fondo.", "Coloque en el horno y cocine durante 3-4 minutos, o hasta que estén cocidos.", "Para servir, deslízate sobre un plato y córtalo en rebanadas."], "url": "www_bbc_co_uk_food_recipes_pastaandherbfrittata_87227", "title": "Tortilla de pasta y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de mantequilla sin sal, picada", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "½ cucharadita de hojuelas de chile seco", "50ml / 2fl oz de vino blanco", "2 tomates, desollados y picados", "1 cucharadita de perejil picado", "sal y pimienta negra recién molida", "150g/5½oz pasta, cooked al dente"], "method": ["Derrita la mantequilla con el aceite de oliva en una sartén y fría la cebolla, el ajo y el chile hasta que estén suaves.", "Agregue el vino blanco y cocine para reducir a la mitad.", "Agregue los tomates picados y cocine a fuego lento durante cinco minutos.", "Agregue el perejil y sazone bien con sal y pimienta negra recién molida.", "Mezcle la pasta con la salsa y sirva en un recipiente tibio."], "url": "www_bbc_co_uk_food_recipes_pastaarabiatta_83363", "title": "Pasta arrabiata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 cucharadas de aceite de oliva virgen extra", "1 bulbo grande de hinojo, cortado, finamente cortado, hojas reservadas y finamente picadas", "2 cebollas pequeñas, finamente picadas", "1 cucharada colmada de semillas de hinojo, trituradas", "2-3 pequeños chiles rojos frescos, finamente picados", "600 g / llb 6oz de sardinas, escaladas, evisceradas y fileteadas (puedes pedirle a tu pescadero que haga esto por ti)", "75 g / 3oz de pasas", "50g / 2oz de piñones", "175ml / 6fl oz de vino blanco", "175ml / 6fl oz de agua", "sal y pimienta negra recién molida", "450 g / llb de linguine seco", "1-2 limones, cáscara y jugo"], "method": ["Caliente seis cucharadas de aceite en una sartén grande a fuego medio. Agregue el hinojo, la cebolla, las semillas de hinojo y los chiles, luego cubra a medias la sartén con una tapa. Freír suavemente durante 18-20 minutos o hasta que las verduras se ablanden pero no se coloreen.", "Agregue la mitad de las sardinas y todas las pasas y los piñones y revuelva hasta que estén bien combinados. Retire la tapa de la sartén, luego continúe cocinando a fuego lento durante 8-10 minutos más, revolviendo y triturando los ingredientes con una cuchara de madera de vez en cuando, hasta que las sardinas se hayan desprendido y la mezcla esté bien combinada.", "Aumentar el fuego, agregar el vino blanco y el agua y llevar la mezcla a fuego lento, revolviendo bien. Continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad, luego regrese la temperatura a fuego lento y cocine a fuego lento la salsa muy lentamente durante otros 4-5 minutos o hasta que se espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque los filetes de sardina restantes, con la piel hacia arriba, encima de la salsa sarde, uno al lado del otro, y luego rocíe sobre dos cucharadas de aceite de oliva virgen extra.", "Cubra la sartén otra vez con la tapa y cocine las sardinas y la salsa a fuego lento durante 7-10 minutos, o hasta que los filetes de sardina estén cocidos. (NB: No hay necesidad de remover la mezcla en esta etapa).", "Mientras tanto, cocine el linguini de acuerdo con las instrucciones del paquete en una olla grande de agua hirviendo con sal. Cuando la pasta esté al dente, escurra bien.", "Agregue la salsa sarde, los filetes de sardina entera cocidos y las dos cucharadas restantes de aceite de oliva a la sartén con la pasta cocida y mezcle bien hasta que el linguini esté cubierto con la salsa.", "Para servir, divida la pasta con sarde por igual entre cuatro platos para servir. Exprime un poco de jugo de limón, al gusto, sobre cada porción. Adorne con la ralladura de limón y las hojas de hinojo reservadas."], "url": "www_bbc_co_uk_food_recipes_pastaconsarde_91609", "title": "Pasta con sardinas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "55g / 2oz de guisantes frescos", "3 tomates cherry rojos", "3 tomates cherry amarillos", "2 cucharadas de vino blanco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "Pasta penne 150 g / 5½ oz, cocida de acuerdo con las instrucciones del paquete", "2 rebanadas de jamón, cortadas en tiras", "85 g / 3 oz de mozzarella, en rodajas", "algunas virutas de trufa blanca fresca para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite en una sartén y fría ligeramente los guisantes y los tomates durante 3-4 minutos. Agregue el vino a la sartén, reduzca, luego vierta la crema y sazone, al gusto, con sal y pimienta negra recién molida.", "Llevar la salsa a fuego lento y cocinar por 4-5 minutos, luego revuelva a través de la pasta de penne cocida. Transfiera a un plato gratinado, espolvoree las tiras de jamón y coloque las rodajas de mozzarella encima antes de transferirlas al horno. Hornee por 4-5 minutos, o hasta que la mozzarella se derrita y burbujee.", "Sirva con virutas de trufa fresca para adornar."], "url": "www_bbc_co_uk_food_recipes_pastabakewithcherryt_88844", "title": "Pasta horneada con tomates cherry y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["90ml / 3¼fl oz de aceite de oliva virgen extra, más extra para servir", "1 cebolla, pelada, picada", "2 dientes de ajo, pelados, picados", "½ cucharadita de hojuelas de chile seco", "600g / 1lb 5oz de vegetales mixtos (como calabacín, hinojo, colinabo, papa, batata, puerro, apio, zanahoria o guisantes), cortados en cubos de 1cm / ½ en cubitos", "3-4 pizcas de hierbas secas mezcladas (como romero, orégano y tomillo)", "sal y pimienta negra recién molida", "1 litro / 1¾ pintas de caldo de pollo o vegetal, de preferencia hecho en casa", "80 g / 2¾oz de pasta seca, como penne", "1 x 400 g / 14 oz pueden frijoles (como cannellini, borlotti, judías o garbanzos), drenados y enjuagados", "2 hojas frescas de laurel", "50g / 2oz de parmesano recién rallado", "1 gran o 2 pequeños tomates muy maduros, finamente picados"], "method": ["Caliente 60ml / 2¼fl oz del aceite en una sartén de base pesada a fuego medio. Agregue la cebolla, el ajo y las hojuelas de chile y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue todas las verduras mixtas (excepto los guisantes, si se usan) y las hierbas secas mezcladas a la sartén. Sazonar, al gusto, con sal y pimienta negra recién molida. Freír por 2-3 minutos, o hasta que las verduras se hayan suavizado.", "Reduzca el fuego a medio, cubra la olla con una tapa y continúe freír durante 10-15 minutos, revolviendo regularmente, o hasta que las verduras se hayan suavizado y estén doradas.", "Agregue el caldo, la pasta, los frijoles, las hojas de laurel y los guisantes (si está usando), luego lleve la mezcla a ebullición. Regrese la mezcla a fuego lento y continúe cocinando a fuego lento, tapada, durante 20-25 minutos, o hasta que los vegetales estén tiernos y la pasta haya absorbido algo del líquido y esté tierna. Retirar del fuego y reservar para enfriar un poco antes de servir.", "Mientras tanto, en un tazón, mezcle el parmesano, los tomates picados y los restantes 30 ml / 1 onza de aceite de oliva hasta que estén bien combinados.", "Para servir, coloca la pasta e fagioli en cuatro tazones para servir. Cuchara sobre la mezcla de parmesano y tomate. Sazonar, al gusto, con pimienta negra recién molida. Rocíe un chorrito de aceite de oliva sobre cada porción."], "url": "www_bbc_co_uk_food_recipes_pastaefagioli_92269", "title": "Sopa de pasta y frijoles (Pasta y frijoles)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastaefagioli_92269_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas, golpeados", "3 cucharadas de crema doble", "Parmesano 75 g / 3 oz, rallado (1 cucharada reservada)", "sal y pimienta negra recién molida", "Espagueti fresco de 250 g / 9 oz, cocinado durante 2 minutos y escurrido", "2 rebanadas de jamón", "aceite de oliva, a llovizna"], "method": ["Coloque los huevos, la crema doble, el parmesano, la sal y la pimienta negra recién molida en una cacerola pequeña, revuelva bien y cocine durante dos minutos a fuego lento.", "Coloque los espaguetis cocidos en un pequeño plato gratinado, vierta sobre la salsa, espolvoree con queso parmesano y póngalo bajo la parrilla hasta que burbujee.", "Calienta una parrilla a fuego alto. Coloque las rodajas de prosciutto en una bandeja para hornear debajo de la parrilla durante 3 minutos hasta que estén crujientes.", "Para servir, coloque el jamón sobre el gratinado y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pastagratinwithprosc_82110", "title": "Pasta gratinada con patatas fritas de jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal", "1 diente de ajo, aplastado", "200g / 7oz de espárragos, blanqueados, cortados en pedazos del tamaño de un bocado", "150 g / 5 oz de guisantes frescos, envasadas", "100g / 3½oz de frijoles de soja congelados, descongelados", "100 g / 3½ oz de espinaca baby", "Tagliolini o tagliatelle cocidos a 450 g / 1 libra (se reservan algunas cucharadas de agua de cocción)", "1 limón, jugo y ralladura", "gran puñado de hierbas frescas de primavera, incluyendo menta, albahaca, eneldo y perejil, picadas", "sal y pimienta negra recién molida", "Avellanas de 25 g / 1 oz, tostadas y ligeramente trituradas", "virutas de parmesano, o virutas de queso duro vegetariano similares", "aceite de oliva, para lloviznar"], "method": ["Calentar la mantequilla en una sartén, agregar el ajo y freír durante un minuto.", "Agregue los espárragos, los guisantes, las habas de soja y las espinacas y saltee durante 1-2 minutos, hasta que la espinaca se haya marchitado ligeramente.", "Agregue la pasta y un poco del agua de cocción a la sartén y revuelva para combinar.", "Agregue el jugo de limón y la ralladura y las hierbas y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la pasta entre cuatro tazones, espolvoree las avellanas y las virutas de queso parmesano y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pastaprimavera_86310", "title": "Pasta primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastaprimavera_86310_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de farfelle", "1 diente de ajo", "pequeñas hojas de albahaca fresca", "1 cucharada de aceite de oliva, y más para lloviznar", "Aceitunas 50g / 2oz, piedras quitadas, más o menos picadas", "1 mozzarella de bolas, desgarrada en piezas del tamaño de un bocado", "2 pimientos rojos de un tarro, cortados en rodajas"], "method": ["Llevar a ebullición una sartén grande con agua con sal. Cocine los arcos de pasta en el agua, siguiendo las instrucciones en el paquete para el tiempo.", "Mezcle el ajo, la albahaca y el aceite de oliva en un recipiente con una batidora para hacer un pesto.", "Cuando la pasta esté cocida, escurra y deje que se enfríe un poco.", "Para servir, ponga la pasta en un recipiente, agregue todos los demás ingredientes y mezcle. Rocíe con aceite de oliva y sirva."], "url": "www_bbc_co_uk_food_recipes_pastasalad_92362", "title": "Pasta con arcos de aceitunas, mozzarella y pimientos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, en rodajas", "½ cucharadita de copos de chile", "3 tomates baby ciruela, descuartizados", "2 cucharadas de hojas de perejil fresco picado", "Pasta de concha 150 g / 5½ oz, cocida de acuerdo con las instrucciones del paquete", "1 puñado de perifollo fresco, para adornar"], "method": ["Caliente el aceite en una sartén y fría la cebolla durante 3-4 minutos, o hasta que se ablande. Agregue los copos de chile y los tomates de ciruela y cocine durante 3-4 minutos más.", "Agregue el perejil picado, luego agregue la pasta cocida a la salsa y revuelva suavemente para combinar.", "Para servir, amontone la pasta en un plato y adorne con el perifollo fresco."], "url": "www_bbc_co_uk_food_recipes_pastatossedwithonion_88931", "title": "Pasta con cebolla, tomate, chile y aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]