[{"ingredients": ["Hojaldre de pasta brisa de 900g / 2lb", "450 g / 1 libra de cebollas, peladas y en rodajas", "450 g / 1 libra de queso cheddar maduro, rallado", "2 cucharadas de aceite vegetal", "sal y pimienta", "huevo batido para glasear"], "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Estirar los pasteles y cortar círculos de 20cm / 8in de diámetro.", "Calentar el aceite y cocinar las cebollas hasta que comience a ablandarse.", "Quítate el calor y enfríe. Agregue el queso rallado y sazone bien.", "Divida la mezcla entre los 6 círculos y junte los bordes. Cepille con un poco del huevo batido.", "Ponga una bandeja para hornear y hornee en el horno durante 20-30 minutos hasta que la masa esté dorada. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_cheeseandonionpastie_13551", "title": "Pasteles de queso y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 empanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "120 g / 4½ oz de mantequilla sin sal, más extra para engrasar", "1 yema de huevo de gallinas camperas", "50 g / 2 oz de queso parmesano (o un queso duro vegetariano similar), rallado", "120ml / 4fl oz de agua", "1 huevo de gallinas camperas, batido, para glasear", "1 patata mediana, pelada y cortada en cubos", "2 cebollas, finamente cortadas", "1 cucharada de harina normal", "50ml / 2oz de leche entera", "Crema doble 50ml / 2oz", "150g / 5½oz de queso cheddar maduro, rallado", "½ cucharadita de mostaza inglesa", "½ cucharadita de pimienta de cayena", "sal y pimienta negra recién molida"], "method": ["Para la masa, pulse la harina, el polvo de hornear, la sal, la mantequilla y la yema de huevo en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado. Agregue el parmesano rallado y revuelva hasta que esté bien combinado.", "Poco a poco agregue el agua, una cucharada a la vez, mezclando continuamente hasta que la mezcla se una como una masa. (Puede que no necesite usar toda el agua.) Haga rodar la masa en forma de bola, luego envuélvala en una película adhesiva y déjela enfriar en la nevera durante una hora.", "Mientras tanto, para el relleno, ponga a hervir un cazo de agua con sal. Agregue las papas a la sartén y cocínelas durante 10-15 minutos, o hasta que estén tiernas, luego escurra bien y déjelas a un lado.", "Ponga a hervir una cacerola grande separada de agua, agregue las cebollas en rodajas y cocine por 2-3 minutos, o hasta que se ablanden. Escurra bien y devuelva las cebollas cocidas a la cacerola.", "Espolvoree las cebollas con la harina y mezcle bien para cubrir. Agregue la leche y la crema y caliente la mezcla a fuego medio durante 3-4 minutos, revolviendo continuamente, hasta que el líquido esté suave y se haya espesado ligeramente. Agregue los trozos de papa cocidos, el queso rallado, la mostaza y la pimienta de cayena y mezcle bien. Sazone al gusto con sal y pimienta negra recién molida, revuelva bien, luego coloque la mezcla de relleno a un lado.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pastel profunda de 20 cm con mantequilla. Agregue una pequeña cantidad de harina, gire la lata para cubrir la base y los lados de la lata, luego sacuda el exceso.", "Cuando la pastelería se haya enfriado, extienda dos tercios de ella sobre una superficie de trabajo enharinada limpia, hasta que tenga casi el doble de ancho que el diámetro del molde para pastel. Usando el rodillo, levante la masa y colóquela sobre el molde para rellenar la base y los lados. Presione suavemente la masa en las esquinas de la lata, recortando cualquier exceso, luego pinche la base de la caja de pastelería varias veces con un tenedor.", "Cubra la masa con una hoja de papel resistente a la grasa y llénela con arroz o frijoles secos. Hornee en el horno durante 10-15 minutos o hasta que la masa esté dorada. Retire del horno, deseche los frijoles y el papel resistente a las grasas y deje la masa a un lado para que se enfríe. Cuando esté frío, vierta el relleno de pastel en la caja de pastelería.", "Pase el tercio restante de la masa sobre una superficie de trabajo enharinada limpia hasta que sea un poco más grande que el diámetro del molde para pastel. Cepille el borde de la caja de pastelería cocida con un poco del huevo batido y coloque la tapa de la pastelería encima del pastel. Recorte cualquier exceso de pastelería. Selle la tapa de la pastelería en la caja de pastelería doblando los bordes de la tapa de la pastelería con un tenedor.", "Con un cuchillo, haga dos pequeños orificios en el centro de la tapa de la pastelería para permitir que salga el vapor. Cepille la tapa de la pastelería con el huevo batido restante, luego transfiéralo al horno y hornee durante 25-30 minutos, o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_cheeseandonionpie_89625", "title": "Pastel de queso y cebolla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandonionpie_89625_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "100 g / 3½ oz de mantequilla", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida", "Nueces 80g / 3oz, aplastadas finamente", "leche, para unir (si es necesario)", "400g / 14oz de papas nuevas, cortadas en cubos y hervidas hasta que estén tiernas", "400 g / 14 oz de queso ahumado, cortado en cubos", "puñado de espinacas", "2 cebollas rojas, cortadas en rodajas, asadas durante 30 minutos", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, batido, para lavar huevos", "1 cucharada de aceite de oliva", "1 cebolla, en rodajas", "1 diente de ajo, finamente cortado", "1 chile, finamente picado", "pieza del tamaño del pulgar jengibre fresco, cortado en palitos de fósforos", "450 g / 1 libra de zanahorias ralladas", "salpicar el vino de jengibre verde", "150g / 5oz demerara azúcar", "Vinagre de vino blanco 150ml / 5fl oz", "1 cucharadita de clavo de olor molido", "1 cucharadita de canela molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la repostería coloque la harina común, la mantequilla, el huevo, el aderezo y las nueces en un procesador de alimentos y pulse hasta que se combinen en una masa. Agregue un chorrito o dos de leche si es necesario para juntar la masa. Retire y enrolle la masa en forma de bola, luego cúbrala con una película adhesiva y colóquela en la nevera para que se enfríe durante dos horas.", "Retire la masa del refrigerador y adhiera la película. Extienda sobre una superficie limpia enharinada a un grosor de 2 cm / 1 pulgada y corte una ronda con una placa de 15 cm / 6 pulgadas como guía.", "Para el relleno, coloque las papas nuevas, el queso, las espinacas y las cebollas rojas en un bol. Sazonar con sal y pimienta negra recién molida y mezclar bien.", "Ahora coloque la mezcla de papa en la mitad de la masa. Doblar sobre la otra mitad para cubrir, doblar los bordes para sellar y cepillar con el lavado de huevos. Coloque en una bandeja para hornear y coloque en el horno para hornear durante 20 minutos, o hasta que estén crujientes y doradas.", "Para la salsa picante, caliente el aceite en una sartén a fuego medio. Agregue la cebolla, el ajo, el chile y el jengibre y fría hasta que estén suaves.", "Agregue la zanahoria y cocine por diez minutos.", "Agregue el vino de jengibre y hierva para reducir, hasta que casi todo el líquido se haya evaporado.", "Agregue el azúcar, el vinagre, el clavo y la canela y cocine a fuego lento durante 15-25 minutos, o hasta que el líquido se haya reducido y la mezcla se espese.", "Para servir, coloque la pasta en un plato con la salsa picante al lado."], "url": "www_bbc_co_uk_food_recipes_cheeseandpotatopasty_84404", "title": "Pastel de queso y patatas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de puré de papa listo para usar", "Queso gruyere 100 g / 3½ oz, rallado", "50g / 2oz de harina autogeneradora", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 tomate de ternera, semillas eliminadas, picadas", "1 lima, jugo y ralladura", "1 cucharada de aceite de oliva", "2 cucharadas de cilantro fresco picado", "sal y pimienta negra recién molida", "3 rebanadas de jamón de Parma, fritas hasta que estén crujientes", "1 huevo de gallina, escalfado"], "method": ["Para las tortas de papa, coloca el puré de papa en un tazón con el queso, la harina y el huevo y mezcla bien. Sazone con sal y pimienta negra recién molida, luego forme la mezcla en tres hamburguesas.", "Caliente el aceite y la mantequilla en una sartén y fríe los pasteles de patata durante 3-4 minutos por cada lado, o hasta que estén dorados.", "Para la salsa de tomate, coloque todos los ingredientes de la salsa en un tazón y revuelva para combinar.", "Para servir, coloque los pasteles de papa en un plato para servir con el crujiente jamón de Parma y el huevo escalfado en la parte superior y la salsa con una cuchara alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_cheeseandpotatocakes_85966", "title": "Pasteles de queso y patatas con crujiente jamón de parma, huevo escalfado y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 puñados de espinacas frescas", "2 dientes de ajo picados", "200g / 7oz de puré de papa listo para usar"], "method": ["Calentar el aceite en una sartén y agregar la espinaca y el ajo. Cocine por 2-3 minutos, o hasta que la espinaca se haya marchitado.", "Agregue el puré de papas cocido y cocine por 3-4 minutos más, o hasta que esté bien caliente. Servir."], "url": "www_bbc_co_uk_food_recipes_cheeseandspinachmash_90409", "title": "Puré de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "Harina normal de 25g / 1oz", "150ml / 5fl de leche en oz", "100 g / 1¾oz Edam, rallado", "100 g / 3½ oz de espinaca", "3 yemas de huevo de gallinas camperas", "3 claras de huevo de gallinas camperas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla en una cacerola a fuego medio. Agregue la harina y cocine por 30 segundos. Retire del fuego y bata gradualmente en la leche.", "Llevar a ebullición e incorporar la espinaca y la mayor parte del queso.", "Deje que se enfríe un poco. Batir las yemas de huevo y sazonar bien.", "En un tazón grande bata las claras de huevo a un pico medio.", "Mezcle dos cucharadas grandes de huevo con la mezcla de leche para aflojar. Doble las claras de huevo restantes y espolvoree con el Edam.", "Transfiera a una sartén a prueba de horno. Coloque en el horno y cocine por 10 minutos.", "Sirve el soufflé en la sartén."], "url": "www_bbc_co_uk_food_recipes_cheeseandspinachsouf_78027", "title": "Soufflé de queso y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla derretida, para engrasar", "4 cucharadas de queso parmesano finamente rallado", "300 ml / 10 fl oz de leche", "1 hoja de laurel", "50 g / 2 oz de mantequilla", "50g / 2 oz de harina común", "5 huevos de gallinas camperas, separados", "1 cucharadita de mostaza Dijon", "2 cucharadas de hojas de estragón fresco picado", "Queso Gruyère 100g / 3½oz, rallado"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Cepille el interior de un plato de soufflé grande con la mantequilla derretida y el polvo con el parmesano rallado, sacudiendo el exceso de queso.", "Ponga la leche a hervir en una cacerola con la hoja de laurel, luego retírela del fuego y déjela a un lado.", "Derrita la mantequilla en una cacerola de base pesada y agregue la harina. Cocine por 2-3 minutos, hasta que la mezcla tome un color marfil profundo y espese. Vierta la leche tibia, revuelva o bate hasta que tenga una salsa suave que no tenga grumos. Cocine a fuego lento, revolviendo de vez en cuando, durante unos diez minutos.", "Retire la salsa del fuego y retire la hoja de laurel. Agregue las yemas de huevo, una a la vez, y agregue las hojas de mostaza y estragón. Sazonar con sal y pimienta negra recién molida. Revuelva suavemente en el Gruyère, hasta que se derrita y se combine bien.", "Batir las claras de huevo hasta que se formen picos suaves cuando se quite el batidor del tazón. Doble suavemente las claras de huevo en la salsa de queso con una cuchara grande de metal, hasta que se combinen.", "Con cuidado, vierta la mezcla en el plato de soufflé con mantequilla y hornéelos en el horno durante 25-30 minutos, hasta que el soufflé se haya levantado y esté dorado en la parte superior.", "Retirar del horno y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cheeseandtarragonsou_89196", "title": "Soufflé de queso y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla derretida", "¼ de cebolla roja picada", "1 cucharada de cebollín fresco, picado", "1 cucharada de perejil fresco, picado", "3 cucharadas de mantequilla", "1 cucharada de harina de maíz", "Harina simple 2 cucharadas", "100ml / 3 ½ oz de leche", "35g / 1¼oz de queso Stilton", "3 yemas de huevo de gallinas camperas", "3 claras de huevo de gallinas camperas"], "method": ["Precalentar el horno 200C / 400F / Gas 6.", "Para la mezcla de soufflé, coloque la mantequilla derretida en una sartén con la cebolla roja y cocine durante dos minutos.", "Retirar del fuego y agregar las hierbas picadas y dejar enfriar durante tres minutos.", "Para la salsa blanca, derrita la mantequilla y agregue la harina de maíz, la harina común, la leche, el queso, la sal y la pimienta y las yemas de huevo.", "Quite el fuego y permita que se enfríe durante dos minutos.", "Para las claras de huevo, bata las claras de huevo en un tazón grande hasta que formen picos rígidos.", "Dobla la salsa blanca en las claras de huevo y agrega la mezcla de cebolla. No haga sobre mezcla.", "Engrase dos platos de ramekin y mezcle la mezcla con estos.", "Coloque en una bandeja en el horno precalentado durante ocho minutos.", "Sirva los suflés en los platos enseguida."], "url": "www_bbc_co_uk_food_recipes_cheeseandtomatosouff_75726", "title": "Soufflé de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina 100g / 3½ oz de levante automático, más extra para quitar el polvo", "100g / 3½oz de mantequilla sin sal", "1 huevo de gallinas camperas", "2 cucharadas de agua", "1 cucharada de aceite de oliva", "½ cebolla, finamente rebanada", "1 cucharadita de azúcar moreno", "50g / 1½oz de queso cheddar rallado", "1 manzana, sin corazón y en rodajas", "4 hojas frescas de salvia"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo y el pulso de nuevo para combinar. Agregue suficiente agua para hacer que la mezcla se una en una masa.", "Convierta la masa en una superficie enharinada y amase ligeramente. Haga rodar la masa hasta ½ cm / ¼ de grosor y corte dos círculos de 18cm / 7 pulgadas.", "Para el relleno, caliente el aceite en una sartén y fríe con cuidado la cebolla con el azúcar hasta que esté blando y ligeramente caramelizado.", "Espolvorea la mezcla de cebolla sobre las bases de tarta, junto con el queso rallado y las rodajas de manzana. Arriba con las hojas de salvia.", "Coloque las tartas en una bandeja para hornear y hornee en el horno durante diez minutos, o hasta que estén doradas.", "Para servir, coloque las tartas calientes sobre los platos."], "url": "www_bbc_co_uk_food_recipes_cheeseappleandsageta_85559", "title": "Tartas de queso, manzana y salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, pelada, picada", "4 berenjenas tiernas, finamente picadas", "100 g / 3½ oz de frijoles en conserva, escurridos", "150g / 5½oz de tomates cherry enlatados", "Aceitunas kalamata 75g / 2½oz, picadas, picadas", "1 tortilla de harina, calentada", "50g / 1¾oz de queso cheddar, rallado"], "method": ["Calentar el aceite de oliva en una sartén, agregar la cebolla y la berenjena y freír suavemente durante dos minutos. Agregue los frijoles, los tomates y las aceitunas y cocine por tres minutos.", "Coloque un envoltorio de tortilla plano, llénelo con la mezcla de frijoles y enrolle. Espolvoree con queso rallado y use un mini soplete para \"asar\" el queso hasta que se haya derretido. (Alternativamente, coloque la tortilla envuelta en una bandeja para hornear y colóquela debajo de una parrilla calentada, hasta que el queso se haya derretido."], "url": "www_bbc_co_uk_food_recipes_cheeseaubergineandol_85280", "title": "Enchiladas de queso, berenjena y aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 queso en una caja (como Pont l'Evêque)", "1 cucharada de hojas frescas de tomillo", "½ cucharada de aceite de oliva", "sal y pimienta negra recién molida", "½ pimienta roja romero, semillas retiradas y picadas", "pan blanco rústico, roto, para servir"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque el queso en una caja en una bandeja para hornear y espolvoree con las hojas de tomillo.", "Rocíe con aceite de oliva y espolvoree con sal y pimienta negra recién molida.", "Coloque en el horno y hornee durante 10-12 minutos, o hasta que comience a derretirse.", "Retire del horno y sirva en un plato con las piezas de pimiento picado y pedazos de pan rústico al lado."], "url": "www_bbc_co_uk_food_recipes_cheesebakedwiththyme_79269", "title": "Queso al horno con tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco, sin costras", "1 pequeño puñado de hojas frescas de albahaca", "55g / 2oz de queso cheddar maduro, rallado", "sal y pimienta negra recién molida", "1 escalope de pavo", "2 cucharadas de harina normal", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "150g / 5½oz de papas nuevas, cocidas, en rodajas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 pimiento rojo, finamente picado", "1 diente de ajo, picado", "1 cucharada de miel", "25g / 1oz de mantequilla", "salpicar agua", "1 cucharada de perejil fresco picado, para decorar"], "method": ["Para el pavo empanizado, coloque el pan, la albahaca, el queso cheddar, la sal y la pimienta negra recién molida en un mini procesador de alimentos y mézclelo con finas migas de pan.", "Separar el escalope de pavo en la harina común y sacudir el exceso, luego sumergir en el huevo batido y finalmente en la mezcla de migas de pan. Pat suavemente para asegurar el pan rallado al escalope, luego sacuda el exceso.", "Calentar el aceite de oliva y la mantequilla en una sartén, agregar el escalope de pavo y freír durante 3-4 minutos en ambos lados, o hasta que estén dorados por todos lados y cocidos.", "Para las papas fritas nuevas, derrita la mantequilla y el aceite en una sartén, agregue las papas y sazone con sal y pimienta negra recién molida. Freír por 2-3 minutos en ambos lados, o hasta que estén doradas por todos lados.", "Para la salsa de pimiento dulce, caliente el aceite de oliva en una cacerola, agregue la pimienta y el ajo y fría ligeramente durante 3-4 minutos, o hasta que la pimienta se haya ablandado. Agregue la miel, la mantequilla y un poco de agua, luego transfiera a un mini procesador de alimentos y mezcle hasta que quede suave.", "Para servir, amontone las patatas fritas en un plato de servir, cubra con el escalope de pavo empanizado y rocíe alrededor de la salsa de pimiento dulce. Adorne con perejil fresco picado y sirva."], "url": "www_bbc_co_uk_food_recipes_cheesebreadedturkeye_89182", "title": "Escalope de pavo empanizado con papas fritas y salsa de pimiento", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de filete de carne de vaca 2 oz", "2 cucharadas de aceite vegetal", "25g / 1 oz de mostaza de cerveza", "Mayonesa 100 g / 3½ oz", "8 pepinillos en rodajas", "4 tomates de carne en rodajas", "½ ronda de lechuga, hojas separadas", "1 cebolla roja, en rodajas", "200 g / 7 oz de queso Monterey Jack, rallado o en rodajas", "4 rollos de brioche", "500g / 1lb 2oz astillando papas", "aceite vegetal, para freír en grasa", "1 vaina de vainilla, semillas retiradas", "500ml / 18fl oz de leche entera", "200 g / 7 oz de helado de vainilla"], "method": ["Para la hamburguesa con queso, ponga la carne picada en un tazón grande y sazone con sal y pimienta. Use sus manos para dar forma a la carne picada en cuatro hamburguesas en forma de hamburguesa. Envuelva las empanadas en film transparente y colóquelas en la nevera durante una hora.", "Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue las hamburguesas y cocine cada lado durante 2-3 minutos. Cuando esté cocido, reserve para descansar.", "En un tazón pequeño, mezcle la mostaza con la mayonesa.", "Para las papas fritas, precaliente una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las patatas fritas durante 3-4 minutos, luego escurrir sobre papel de cocina y sazonar con sal.", "Para el batido de vainilla, coloque todos los ingredientes en una licuadora y mezcle hasta que quede suave.", "Justo antes de servir, vierta el batido en vasos.", "Para armar la hamburguesa, coloque cada empanada en un rollo de brioche cubierto con los pepinillos, tomate en rodajas, lechuga, unas rebanadas de cebolla, queso y mayonesa de mostaza de cerveza.", "Coloque las hamburguesas en los platos para servir y asegúrelas con un pincho de madera. Coloque las papas fritas al costado y sirva con los batidos."], "url": "www_bbc_co_uk_food_recipes_cheeseburger_and_fries_06202", "title": "Hamburguesa con queso y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de queso mascarpone", "125ml / 4fl oz de crema doble", "125 ml / 4 fl oz oz yogur", "1 limón, ralladura y jugo", "100 g / 3½ oz zarzamoras", "1 huevo grande de gallinas camperas", "1 limón, ralladura y jugo", "1 cucharada de azúcar en polvo", "50g / 1¾oz de mantequilla", "35g de mantequilla sin sal", "1 cucharada de azúcar morena suave", "35g / 1¼ oz de harina común", "½ cucharadita de polvo de hornear", "1 cucharadita de jengibre molido", "¾ tbsp jarabe de oro", "1 bola de tallo de jengibre en almíbar, finamente picado", "50 g / 1 oz de azúcar en polvo", "10g / 1 / 3oz de mantequilla sin sal", "½ cucharadita de sal marina", "½ cucharadita de extracto de vainilla", "botón de mantequilla", "dejar caer aceite de colza", "1 cucharada de granos de palomitas de maíz"], "method": ["Para hacer la tarta de queso, mezcle el mascarpone, la crema, el yogur, la mitad del jugo de limón y toda la ralladura. Extiéndalo en un plato y colóquelo en la nevera.", "Mientras tanto, para hacer la cuajada de moras, machaque las moras en un tazón con un tenedor, y empuje a través de un colador en una olla grande. Agregue el huevo, la ralladura de limón, el jugo, el azúcar y la mantequilla. Coloque la sartén a fuego medio. Revuelva hasta que espese y luego retírelo del fuego. Transfiera a un tazón limpio y colóquelo en el refrigerador.", "Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee una bandeja de hornear con papel resistente a la grasa.", "Para hacer crujir la nuez de jengibre, unte la mantequilla y el azúcar en un tazón grande. Agregue los ingredientes restantes y mezcle bien. Coloque 12 cucharaditas colmadas de la mezcla en la bandeja para hornear forrada, dejando espacio para que se extiendan. Hornea por 10 minutos y luego deja que se enfríe. Rompe las migas en un tazón.", "Para hacer el caramelo salado, coloca el azúcar y 100 ml / 3½ fl oz en una olla colocada a fuego alto. Llevar a una temperatura de 185 ° C sin agitar. (Puede hacerlo a simple vista: cuando el caramelo haya alcanzado un precioso color dorado, está listo). Retire del fuego y añada con cuidado la mantequilla, la sal y el extracto de vainilla (el azúcar caliente salpicaría y podría quemarlo) . Siga revolviendo hasta que el caramelo deje de burbujear y escupir.", "Para hacer las palomitas de maíz, caliente la perilla de mantequilla y la gota de aceite en una sartén grande a fuego medio, agregue los granos de las palomitas de maíz, cubra con una tapa y deje que se ablande. Cuando las palomitas hayan terminado de reventar; agregue el caramelo salado.", "Coloque la mezcla de pastel de queso en vasos para servir con la cuajada de mora en la parte superior. Decorar con la nuez de jengibre desmenuzado y palomitas de maíz y servir."], "url": "www_bbc_co_uk_food_recipes_cheesecake_with_salted_18348", "title": "Tarta de queso con palomitas de caramelo salado, cuajada de mora y crumble de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz% 20dark% 20chocolate% 20 (% mínimo 2070 %% 20cocoa% 20solids)", "150g / 5½oz de mantequilla sin sal", "3 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "100 ml / 3½ fl oz de espresso fuerte", "Harina normal de 100 g / 3½ oz", "150g / 5½oz de queso crema con alto contenido de grasa", "50 g / 1 oz de azúcar en polvo", "1 huevo de gallinas camperas", "½ naranja, solo ralladura"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase y forme una lata cuadrada de 8 pulgadas / 20 cm.", "Para los brownies, derrita el chocolate y la mantequilla en un tazón sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque el agua.) Retire el recipiente de la olla y déjelo a un lado para que se enfríe un poco.", "Batir los huevos, el azúcar impalpable y el café en un bol hasta que estén bien combinados. Tamice la mezcla de harina y chocolate y mezcle hasta que esté bien combinado.", "Para la tarta de queso, bata el queso crema, el azúcar impalpable, el huevo y la ralladura de naranja hasta que quede suave.", "Con una cuchara, coloque la mezcla de brownie en la lata de la torta, luego coloque la mezcla de la torta de queso encima y use un cuchillo para cortar las líneas en la mezcla y crear un efecto de mármol.", "Hornee en el horno por 25-30 minutos, o hasta que esté listo. Retire la lata del horno, deje enfriar por completo, luego corte en cuadrados"], "url": "www_bbc_co_uk_food_recipes_cheesecake_brownies_01372", "title": "Brownies de pastel de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 brownies", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesecake_brownies_01372_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz de mantequilla", "1 cucharada de hojas frescas de tomillo y limón", "2 puerros, finamente picados, guarniciones reservadas", "2 bulbos de hinojo, finamente picados, guarniciones reservadas", "1 chile rojo, finamente picado", "3 dientes de ajo, ligeramente triturados", "300 ml / 10½ fl oz de vino blanco", "1 kg / 2 lb 2 oz almejas de afeitar frescas, lavadas y escurridas", "Pan rallado de masa fermentada fresca de 110 g / 4 oz", "20g / ¾oz de queso Pecorino", "cuñas de lima, para servir"], "method": ["Precalentar la parrilla a su configuración más alta.", "Caliente una sartén de base pesada hasta que esté caliente. Agregue 75 g / 2½ oz de la mantequilla, el tomillo de limón, los puerros, el hinojo, el chile y el ajo y fría a fuego lento hasta que las verduras estén blandas, pero no doradas.", "Caliente una sartén de lados profundos con una tapa y agregue los 75 g / 2½ oz restantes de mantequilla y los restos de puerro e hinojo y fríe durante 2-3 minutos.", "Agregue el vino blanco, hierva y cocine para reducir a la mitad el volumen original.", "Agregue las almejas de afeitar. Cubra con la tapa y cocine durante 4-5 minutos, o hasta que las almejas estén abiertas y recién cocidas (deseche las almejas que no se hayan abierto). Vierta el contenido de la sartén en un colador sobre un tazón resistente al calor. Reserve las almejas de navajas cocidas y deseche el contenido restante del tamiz.", "Agregue 200 ml / 7 fl oz de los jugos de cocción al hinojo ablandado, puerro y la mezcla de chile y hervir para reducir el líquido a la mitad.", "Mientras tanto, retire la carne de almeja de las conchas. Corte la carne de almeja en un ángulo de 1 cm / ½ en trozos, luego agregue a la sartén de la mezcla vegetal reducida.", "Lave las cáscaras de la almeja de afeitar y colóquelas en una bandeja para hornear, luego coloque la mezcla de almejas y vegetales en las cáscaras.", "Coloque las migas de pan de masa fermentada y Pecorino en un procesador de alimentos y mezcle para combinar.", "Espolvoree la mezcla de migas de pan y queso sobre las conchas rellenas, colóquela debajo de la parrilla y cocine hasta que la cobertura esté dorada.", "Sirva en platos con trozos de limón."], "url": "www_bbc_co_uk_food_recipes_cheesecrustedrazorcl_87656", "title": "Almejas navajas con corteza de queso con ajo, ají y tomillo de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "½ cebolla, picada", "½ patata, pelada, cortada en cubos de 1cm / ½ en", "1 bulbo de hinojo, finamente cortado", "150ml / ¼ pinta de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "pequeño puñado de perejil fresco, picado", "1 yema de huevo de gallinas camperas", "4 cucharadas de crema doble", "Queso Lancashire 55 g / 2 oz, rallado"], "method": ["Caliente la mantequilla en una cacerola y fríela suavemente hasta que esté blanda pero no coloreada.", "Agregue el caldo de papa, hinojo y pollo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10-12 minutos, o hasta que la papa y el hinojo estén tiernos. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la sopa en una licuadora junto con el perejil, la yema de huevo, la crema y el queso y mezcle hasta que quede suave. Si es necesario, devuelve la sopa a la cacerola y caliéntala suavemente.", "Para servir, vierta la sopa en tazones."], "url": "www_bbc_co_uk_food_recipes_cheesefennelandherbs_85354", "title": "Sopa de queso, hinojo y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 300g / 10oz", "2 cucharaditas de polvo de hornear", "2 cucharadas de aceite de oliva", "½ pinta de leche entera", "150g / 5½oz de queso azul", "2 cucharadas de vino blanco", "100 ml / 3½ fl oz de vino tinto", "55ml / 2fl oz de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la harina, el polvo de hornear y el aceite en un procesador de alimentos y mezcle.", "Agregue la leche y mezcle para formar una masa suave.", "Usando un rodillo en una superficie enharinada, enrolle los pasteles a 2,5 cm / 1 pulgada de grosor. Usando una placa como guía, recorte un círculo de 20 cm / 8 pulgadas y colóquelo en una bandeja para hornear antiadherente. Reserve algo de la masa para más tarde.", "Usando el exceso de masa, enrolle ocho bolas pequeñas y colóquelas uniformemente alrededor del círculo de masa para decorarlas.", "Desmenuce el queso azul en el círculo y rocíe con el vino blanco.", "Coloque en el horno precalentado durante 15 minutos, o hasta que esté dorado y cocido. Retire del horno y coloque en un plato grande y tibio.", "Mientras tanto, para la salsa balsámica, coloque el vino tinto y el vinagre balsámico en una cacerola a fuego medio. Llevar a ebullición a fuego lento hasta que la salsa se vuelva espesa y brillante.", "Para servir, vierta la salsa balsámica alrededor de la galette de queso."], "url": "www_bbc_co_uk_food_recipes_cheesegallettewithba_78830", "title": "Galette de queso con salsa balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo, en rodajas finas", "100g / 3½oz de queso azul", "100ml / 3½fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "1 cucharadita de mostaza Dijon", "1 cucharadita de hojas frescas de tomillo", "12 tomates cherry", "1 cucharada de aceite de oliva"], "method": ["Coloque el ajo, el queso azul, el vino blanco y la crema doble en una sartén a fuego medio. Caliente durante cuatro minutos, hasta que el queso se haya derretido, luego agregue la mostaza de Dijon y el tomillo.", "Caliente una sartén hasta que fume.", "Para los cucharones de tomate, ensarte cuatro tomates cherry en un pincho y cepille con aceite de oliva. Repita con dos brochetas más y luego colóquelas en la sartén de la plancha para dorar a presión durante dos minutos en cada lado.", "Para servir, coloque la fondue de queso en un tazón con los cucharones de tomate en el lado."], "url": "www_bbc_co_uk_food_recipes_cheesefonduewithtoma_80850", "title": "Fondue de queso con cucharones de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 x 100 g / 3½ oz de filete de res", "2 cucharadas de aceite de oliva", "1 diente de ajo", "ramita de tomillo fresco", "2 hojas de laurel", "3 ramitas de chevril fresco", "2 ramitas de perejil fresco de hoja plana", "sal y pimienta negra recién molida", "2 hongos Portobello", "pellizcar el comino molido", "sal y pimienta blanca agrietada", "1 cucharada de aceite de oliva", "160g / 5½oz de hojas de espinaca baby", "3 cucharadas de caldo de verduras", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 tomates frescos de ciruela, sin semilla y finamente picados", "1 diente de ajo, finamente picado", "Queso gruyere 100 g / 3½ oz, rallado"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Enrolle los filetes de carne para formar dos cilindros, luego envuélvalos firmemente en una película adhesiva para mantener la forma. Coloque en el refrigerador durante 1-2 horas.", "Retire la carne del refrigerador y quite la película adhesiva, teniendo cuidado de mantener la carne en un cilindro.", "Caliente una sartén a prueba de horno y agregue dos cucharadas de aceite de oliva y agregue el ajo y las hierbas.", "Sazone la carne con sal y pimienta negra recién molida, luego colóquela en la fuente caliente de ajo y hierbas y frótelas en la parte superior e inferior, hasta que estén coloreadas.", "Transfiera la sartén al horno y cocine de 6 a 8 minutos, o hasta que esté cocida a su gusto. Retire del horno y deje reposar, conservando los jugos de la bandeja para más adelante.", "Mientras tanto, para los champiñones, pele las setas portobello y colóquelas en una lata pequeña para asar. Sazone con el comino, la sal y la pimienta blanca rajada, luego coloque en el horno para cocinar durante diez minutos.", "Mientras tanto, para la espinaca, caliente otra sartén y agregue una cucharada de aceite de oliva, la espinaca y el caldo de verduras, y cocine hasta que la espinaca se haya marchitado. Sazonar con sal y pimienta negra recién molida.", "Para los tomates, caliente una sartén con el resto de una cucharada de aceite de oliva. Agregue los tomates de ciruela y el ajo y cocine durante 1-2 minutos. Sazonar con sal y pimienta negra recién molida.", "Precalentar la parrilla a alto.", "Para servir, coloque un hongo en cada uno de los dos platos, cubierto con filete de res, espinaca, tomate y terminando con el gruyere. Coloque debajo de la parrilla por 30 segundos hasta que el queso se derrita. Rocíe los jugos del filete alrededor."], "url": "www_bbc_co_uk_food_recipes_cheeseglazedbeeffill_79565", "title": "Filete de ternera glaseado con queso provenzal", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]