[{"ingredients": ["2 clementinas grandes (aproximadamente 200 g / 7 oz), limpiadas", "4 huevos grandes de gallinas camperas", "1 limón grande, solo cáscara", "160g / 5¾oz de azúcar en polvo de oro", "100ml / 3½fl oz de aceite de oliva", "175gr / 6 oz de almendras molidas", "2 cucharaditas de polvo de hornear", "15 g / ½ oz de azúcar en polvo", "1 limón grande, solo jugo", "glaseado o azúcar en polvo, para quitar el polvo", "Crema batida 250ml / 9fl oz (opcional)", "2-3 naranjas segmentadas"], "method": ["Coloque las clementinas en una olla y cúbralas con agua. Llevar a ebullición y cocine a fuego lento durante 20-30 minutos hasta que estén tiernos. Retire y reserve hasta que esté lo suficientemente frío para manipularlo. Corta las clementinas por la mitad y descarta las pepitas.", "Coloque las clementinas, incluida la piel, en un procesador de alimentos y mezcle hasta formar una pasta.", "Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4, engrase una lata de torta en forma de resorte de 20 cm / 8 pulgadas y forre la parte inferior con papel de hornear.", "Batir los huevos, la ralladura de limón y el azúcar impalpable en un tazón. Agregue el aceite de oliva y bata hasta que esté suave y bien combinado. Agregue la pasta de clementina y doble las almendras molidas y el polvo de hornear.", "Coloque la mezcla en la lata y hornee por 50 minutos o hasta que esté bien dorado. La torta debe haberse encogido ligeramente por los lados y ser elástica al tacto. Deje que se enfríe en la lata en una rejilla de alambre.", "Mientras tanto, para hacer el almíbar, caliente el azúcar y el jugo de limón en una sartén pequeña a fuego lento hasta que el azúcar se haya disuelto. Haz muchos agujeros pequeños por todo el pastel con un pedazo de espagueti sin cocinar o un palillo de cóctel, y rocía sobre el jarabe de limón. Deje que la torta se enfríe completamente en la lata, colóquela en un plato para servir, espolvoree con azúcar glas y sirva con crema batida y segmentos de naranja."], "url": "www_bbc_co_uk_food_recipes_clementine_and_almond_72249", "title": "Pastel de clementina y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_and_almond_72249_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos grandes de gallinas camperas, separados", "190g / 6¾oz de azúcar en polvo", "300g / 10½oz de crema de grasa completa", "2 limones no encerados, solo ralladura", "½ cucharadita de flores de Sicilia o arome de panetona (ambas disponibles en línea)", "Harina de castaña 190g / 6¾oz (disponible en línea)", "3 cucharaditas de polvo de hornear", "3 cucharadas de azúcar en polvo", "10 clementinas, segmentadas", "2 limones", "1 naranja", "2 limas", "hojas de verbena para decoración (opcional)", "1 huevo de gallinas camperas, solo blanco", "2 cucharadas de azúcar en polvo", "1 x 250g / 9oz de lata de una variedad de castañas con sabor a vainilla (como la crema de castaña de L'Ardeche)", "Mantequilla de 325g / 11½oz, ablandada, más extra para engrasar las latas del pastel", "450 g / 1 libra de azúcar glas", "190g / 6¾oz de queso crema, con toda su grasa", "2 cucharaditas de extracto de aceite de limón"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase dos moldes para pasteles redondos de 23 cm / 9 pulg. Y forre los lados y la parte inferior con papel pergamino.", "Para la torta, en un tazón batir las yemas de huevo y el azúcar impalpable hasta que estén suaves y esponjosos. Agregue la crème fraîche, la ralladura de limón y el fiori di Sicilia o arome di panettone. Mezcle y tamice la harina y el polvo de hornear (es esencial tamizar la harina de castaña, ya que se amontona fácilmente). En un tazón limpio, bata las claras de huevo en picos rígidos. En tres lotes doblar los huevos blancos en la mezcla usando una cuchara de metal. Vierta la mezcla en las latas preparadas, alise las tapas y hornee en el horno durante 23-30 minutos.", "Para el aderezo, cocine a fuego lento 250 ml / 9 fl oz de agua con el azúcar en polvo en una sartén durante dos minutos hasta que se forme un jarabe. Retire la cáscara de los limones, naranja y limas y corte en tiras finas (juliana). Segmenta las naranjas. Agregue las tiras de corteza al almíbar, cocine a fuego lento durante tres minutos, retire del fuego y deje enfriar.", "Retire la torta del horno y deje enfriar en las latas durante cinco minutos antes de encenderla en una rejilla de enfriamiento para que se enfríe completamente.", "Pinta ligeramente cada hoja de verbena con un poco de clara de huevo, sumérgete en azúcar impalpable y colócalo en una bandeja revestida. Seque las hojas de verbena en el horno a la temperatura más baja posible del horno durante aproximadamente 20 minutos, hasta que estén crujientes. Aparta para endurecer.", "Para el glaseado de queso con limón, bata la mantequilla ablandada durante dos minutos. Agregue el azúcar glas y el extracto de aceite de limón. Mezcle bien antes de agregar el queso crema, luego bata durante 5-6 minutos hasta que esté suave y cremoso. Cubra y transfiera a la nevera hasta que sea necesario.", "Para ensamblar la torta, extienda la extensión de castaño en ambas capas superiores. Extienda una capa de glaseado de limón sobre la pasta de castañas en ambas tortas, dejando un espacio de 1 cm / ½ pulgada en el borde.", "En la capa inferior de la torta, coloque los segmentos de clementina alrededor del borde de la torta con sus \"espaldas\" hacia afuera y 1 cm / ½ en el espacio entre cada una.", "Llene una manga pastelera con el glaseado de limón restante y coloque una roseta en los huecos entre las clementinas. Coloque dos anillos concéntricos de segmentos anaranjados y pinte un poco de hielo entre los anillos (para evitar agujeros).", "Coloque la segunda capa de torte en la parte superior, con el glaseado de limón hacia arriba. Rellene el borde de 1 cm / ½ pulgada con rosetas de glaseado de limón.", "Escurrir las cáscaras de cítricos y secar con una toalla de cocina. En cada roseta de glaseado de limón aplique una pequeña cantidad de cáscaras de cítricos. Coloque los segmentos de naranja restantes en el centro del pastel. Pipeta pequeñas rosetas de crema en cualquier espacio, y esparce un poco de la ralladura mezclada. Coloque hojas de verbena cristalizadas en la parte superior en un patrón de radiación."], "url": "www_bbc_co_uk_food_recipes_clementine_and_chestnut_64080", "title": "Pastel de clementina y castaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 dientes de ajo, aplastados", "1 cebolla pequeña, picada", "2 chiles verdes, divididos longitudinalmente", "1 cucharada de puré de tomate", "1 cucharadita de cúrcuma", "½ cucharadita de chile en polvo", "½ cucharadita de curry en polvo", "3 clementinas, solo peel", "Filete de bacalao a 400 g / 14 oz, cortado en trozos pequeños", "gran puñado de hojas frescas de cilantro", "buena sal marina", "Espinaca 180g / 6oz, enjuagada", "2 dientes de ajo molido"], "method": ["Para el curry, coloque una sartén grande con tapa a fuego medio y agregue el aceite. Agregue el ajo y la cebolla y cocine hasta que se ablanden. Agregue 1 cucharadita de sal y si las cebollas se adhieren a la sartén, agregue salpicaduras de agua.", "Agregue los chiles y el puré de tomate y cocine durante 2 minutos. Agregue la cúrcuma, el chile en polvo y el polvo de curry. Agregue un poco de agua y cocine por 5-7 minutos, o hasta que el aceite salga a la superficie.", "Mientras tanto, corte finamente la cáscara de clementina y agréguela a la sartén con 200 ml / 7 fl oz de agua (o jugo de clementina). Cocine por 10 minutos o hasta que la cáscara se haya derretido.", "Agregue el bacalao, revuelva y ponga la tapa. Cocine por unos minutos, o hasta que esté firme, blanco y cocido. Retire del fuego y agregue el cilantro.", "Pon la espinaca en una olla grande con el ajo y una pizca de sal. Seque el vapor a fuego lento durante 3 minutos, hasta que se marchite; debe mantener su color verde brillante. El cocido al vapor seco se cocina sin aceite; La espinaca enjuagada tiene suficiente humedad para cocer al vapor y cocinar el ajo.", "Sirva el pescado al curry con las espinacas en el lado."], "url": "www_bbc_co_uk_food_recipes_clementine_and_cod_curry_32911", "title": "Clementina y bacalao al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_and_cod_curry_32911_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal, derretida", "Galletas digestivas 250g / 9oz, aplastadas", "4 clementinas, jugo y ralladura finamente rallada", "225 g / 8oz de mantequilla sin sal, picada", "Azúcar en polvo 350g / 12oz", "4 huevos medianos de granja, golpeados", "600ml / 1 pinta de leche entera", "600 ml / 1 pinta de crema doble", "1 vaina de vainilla, semillas retiradas", "150 g / 5½ oz de azúcar en polvo", "100 g / 3½ oz de harina de maíz", "3 huevos medianos de granja y 3 yemas", "50 g / 13 / 4oz de mantequilla sin sal, en cubos", "175g / 6oz de chocolate blanco, finamente picado", "2 yemas de huevo de rango medio", "2 cucharadas de azúcar en polvo", "Crema doble 320ml / 11fl oz"], "method": ["Para la base, mezcle los bizcochos y la mantequilla derretida en un tazón, luego presione en una lata agria de fondo suelto de 20 cm / 8 pulgadas. Cubra y enfríe en el refrigerador por 20 minutos, o hasta que esté firme.", "Para la cuajada de clementina, ponga el jugo y la ralladura de clementina, la mantequilla y la mitad del azúcar en una cacerola y lleve a fuego lento a fuego lento para disolver el azúcar y derretir la mantequilla, luego retire del fuego. Deje que se enfríe un poco. Ponga el azúcar restante y los huevos batidos en un tazón grande y vierta lentamente en la mezcla de jugo tibia, batiendo constantemente con una batidora eléctrica de mano. Regrese la sartén al fuego y cocine a fuego lento, revolviendo constantemente, durante 5 minutos, o hasta que espese. Colar a través de un colador en un recipiente, cubrir y enfriar en la nevera hasta que sea necesario.", "Para la crème pâtissèrie, coloque la leche, la crema, las semillas de vainilla y la vaina en una olla grande de base pesada y deje que hierva. Ponga el azúcar y la harina de maíz en un tazón grande a prueba de calor y bata los huevos y las yemas. Vierta la mezcla de leche tibia sobre los huevos, batiendo constantemente. Vierta la mezcla de nuevo en la cacerola y cocine a fuego lento, revolviendo constantemente, hasta que espese. Pasar a través de un tamiz y reservar.", "Para la mousse, coloque el chocolate blanco en un tazón grande y déjelo a un lado. Batir las yemas de huevo y el azúcar en un tazón por separado hasta que el color sea pálido. Poner 50 ml / 2 fl oz de la crema en una sartén y llevar a fuego lento a fuego lento. Vierta lentamente la crema caliente en la mezcla de yema de huevo, revolviendo constantemente. Vierta la mezcla de nuevo en la sartén y cocine muy suavemente hasta que cubra la parte posterior de una cuchara de madera. Colar a través de un tamiz de malla fina sobre el chocolate blanco. Revuelva hasta que quede suave.", "En otro tazón, bate la crema restante hasta obtener picos casi rígidos. Dobla la mitad de la crema batida en la mezcla de chocolate blanco, luego dobla el resto.", "Para ensamblar, combine la cuajada de clementina y la crema pastelera y apile en la base de la galleta. Coloque la mousse de chocolate blanco sobre la tapa, cubra y deje enfriar en la nevera durante al menos 2 horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_clementine_curd_tart_94470", "title": "Tarta de cuajada Clementina con una mousse de chocolate blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "Ron oscuro de 100ml / 3½fl oz", "Segmentos de clementina 300-400g / 10½ -14oz", "100g / 3½oz de azúcar morena suave", "300g / 10½oz de mantequilla sin sal, ablandada", "4 clementinas, peladas y partidas por la mitad", "200 g / 7 oz de azúcar en polvo", "Harina de auto crianza de 200g / 7oz", "1 vaina de vainilla, semillas eliminadas o 1 cucharadita de extracto de vainilla", "4 huevos de gallinas camperas", "helado de vainilla"], "method": ["Traiga 150ml / 5 fl oz de agua y el azúcar a ebullición en una cacerola hasta que el azúcar se haya disuelto. Retire del fuego y deje enfriar el almíbar.", "Vierta el almíbar en un tazón grande. Agregue el ron y las clementinas al almíbar. Tape y guarde en la nevera durante una semana antes de usar.", "Para la torta invertida, precaliente el horno a 180 ° C / 160 ° C. Ventilador / Gas. 4. Cubra una lata de pastel de 23 cm con papel de hornear.", "En un tazón grande, bata el azúcar moreno y 100 g / 3½ oz de la mantequilla hasta que quede suave. Extiéndalo en la base de la lata forrada. Arregle las mitades de clementina en la parte superior. Batir la mantequilla restante junto con el resto de los ingredientes de la torta. Vierta la mezcla sobre las clementinas y hornee durante 35-40 minutos. Retire del horno y deje enfriar por 10-15 minutos.", "Coloque las clementinas marinadas en tazones y sirva con helado y una rebanada de pastel al revés."], "url": "www_bbc_co_uk_food_recipes_clementine_rumtopf_35771", "title": "Clementine rumtopf", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de mascarpone", "1 cucharada colmada de azúcar glas, tamizada", "400 ml / 14 fl oz crema doble", "2 clementinas, 1 en jugo, 1 en rodajas", "200 g / 7 oz de cuajada de naranja o maracuyá lista para usar", "2 ramitas de menta fresca", "125g / 4½oz de harina natural", "1 huevo de gallinas camperas", "300ml / 10½ fl oz de leche", "25g / 1oz de mantequilla", "75g / 2¾oz de azúcar en polvo", "50ml / 2fl oz de brandy", "4 clementinas", "1 limón, solo jugo", "25 g / 1oz de mantequilla sin sal"], "method": ["Para el syllabub, mezcle el mascarpone y el azúcar glas juntos en un tazón grande hasta que quede suave. Poco a poco vierta la crema doble, batiendo continuamente hasta que la mezcla esté pálida y espesa.", "Incorpore el jugo de clementina y la cuajada de naranja o maracuyá para crear un efecto dominó.", "Coloque la mezcla de syllabub en una manga pastelera y póngala en platos de cristal para servir. Cubra cada uno con una rodaja de clementina y una ramita de menta. Enfríe en la nevera hasta que esté listo para servir - los syllabubs se mantendrán en la nevera durante 3-4 días, cubiertos.", "Para los crêpes, mezcle la harina y el huevo en un tazón grande. Poco a poco agregue la leche para formar una mezcla suave con la consistencia de crema doble.", "Calentar un poco de la mantequilla en una sartén a fuego medio. Agregue un cucharón de la pasta de crespón a la sartén y agite para cubrir la parte inferior de manera uniforme. Freír durante 1-2 minutos, luego voltear el panqueque y cocinar por un minuto más, o hasta que se dore por ambos lados. Retire la crepe de la sartén y colóquela en una hoja de papel resistente a la grasa. Mantener caliente", "Repita el proceso con la mantequilla restante y la masa de crep, apilando las creppes entre las capas de papel antigrasa.", "Para la salsa, caliente el azúcar en una sartén a fuego medio hasta que el azúcar se derrita y caramelice. Agregue el brandy y enciéndalo con un fósforo. Permita que las llamas se enciendan y se apaguen. (Precaución: Mantenga las llamas lejos de sus ojos y cara y asegúrese de que el extractor no esté encendido). Agregue el jugo de 2 de las clementinas, el jugo de limón y la ralladura de 1 clementina, luego segmente las 2 últimas clementinas y agréguelas a la sartén. Finalmente, agregue la mantequilla hasta que se haya derretido y la salsa se haya espesado.", "Para servir, doble los crêpes en cuartos y organice en platos para servir. Cuchara sobre la salsa de naranja tibia. Sirve el syllabub al costado."], "url": "www_bbc_co_uk_food_recipes_clementine_syllabub_and_53372", "title": "Clementine syllabub y crêpes Suzette", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_syllabub_and_53372_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g (8 onzas) de harina normal, más 25 g (1 onza) para rociar", "1 cucharadita de bicarbonato de soda", "1 cucharadita de especias mixtas", "1 cucharadita de canela molida", "1 cucharadita de jengibre molido", "¼tsp de sal marina", "175g / 6oz de azúcar en polvo, más 1 cucharada para rociar", "100g / 4oz de sebo triturado", "100g / 4oz sultanas", "75g / 3oz pasas de Corinto", "75g / 3oz de fechas de lapidación", "50g / 2oz de pasas Moscatel", "1 manzana o zanahoria rallada gruesa", "1 cucharada de melaza negra", "1 huevo mediano fresco de granja", "150ml / 5fl oz de suero de leche", "225g / 8oz de crema coagulada"], "method": ["Tamiza la harina, el bicarbonato de soda, las especias y la sal en un tazón y agrega el azúcar, el sebo, las frutas secas y la zanahoria o manzana rallada.", "Mezcle la melaza negra con el huevo y un poco de suero de leche y mezcle con los ingredientes secos para dar una mezcla suave con una consistencia de caída similar a una torta.", "Sumerja una pieza grande de muselina, una vieja funda de almohada, un paño de budín o un paño de cocina en agua hirviendo, quítelo y exprima el exceso de agua. Colóquelo en una superficie y espolvoree un círculo de 30 cm en el centro con 25 g / 1 oz de harina y 1 cucharada de azúcar en polvo. Coloque la mezcla de budín en la parte superior y átelo firmemente con una cuerda, dejando un pequeño espacio para que el budín se expanda.", "Descanse un trébede o recipiente grande a prueba de calor en la base de una sartén grande para que el pudín no esté en contacto directo con el calor. Coloque el budín en el trébedes / recipiente, con el lado anudado hacia arriba. Vierta suficiente agua casi para cubrir el pudin, cubra con una tapa hermética y cocine a fuego lento durante 3-4 horas. Eche un vistazo de vez en cuando y luego revise el nivel del agua y agréguelo si es necesario.", "Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Levanta el budín de la sartén y sumérgelo brevemente en un tazón con agua fría (para asegurarte de que la parte exterior del pudin no se adhiera a una placa de horno). A continuación, quite la tela y coloque el pudín en un plato / placa a prueba de horno. Deslícela dentro del horno y déjela por 15 minutos hasta que la parte exterior del pudín se haya secado.", "Servir en trozos gruesos con bolas de crema coagulada y tal vez un vaso pequeño de whisky."], "url": "www_bbc_co_uk_food_recipes_clootiepudding_9528", "title": "Pudín de Clootie", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clootiepudding_9528_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de gallinas camperas", "300ml / 10fl oz / ½ leche pizca", "Harina común 115g / 4oz", "pizca de sal", "pequeña perilla de mantequilla", "azúcar glas para decorar", "3 claras de huevo grandes de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "100g / 3½oz de queso de cabra desmenuzado", "1 clementina, pelada y segmentada"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la mezcla de crep, combine las yemas de huevo, la harina, la leche y la sal. Batir vigorosamente para formar una masa.", "Coloque una sartén a fuego medio, agregue un poco de mantequilla para derretir. Agregue un cucharón de la mezcla de crepe y agite para cubrir la sartén. Cocine por un minuto, voltee y cocine por un minuto más.", "Para el soufflé, bate las claras de huevo en un tazón grande hasta que estén firmes.", "Poco a poco agregue el azúcar y continúe batiendo hasta que esté suave y esponjoso. Deténgase cuando la mezcla sea lo suficientemente espesa como para dejar un rastro de cinta cuando se levante la batidora.", "Doble los segmentos de queso y clementina de las cabras asegurándose de mantener el volumen.", "Vierta la mezcla de soufflé sobre la mitad del crespón y doble para contener la mezcla.", "Coloque en el horno y cocine por diez minutos.", "Para servir, desliza el soufflé de crepe sobre un plato caliente y espolvorea con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_clementinegoatschees_77965", "title": "Panqueques rellenos de soufflé de queso de cabra y clementina", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "200g / 7oz de arroz con leche", "125 g / 4½ oz de azúcar en polvo", "600ml / 20fl oz de leche entera", "Crema doble 500ml / 18fl oz", "1 vaina de vainilla, semillas retiradas", "110g / 4oz de crema coagulada", "2 piñas bebé, peladas, sin núcleo, en rodajas finas", "1 limón, solo jugo", "75g / 3oz de azúcar en polvo", "55 g / 2 oz de mantequilla"], "method": ["Para el arroz con leche, derrita la mantequilla en una cacerola hasta que forme espuma y fríe el arroz por un minuto. Agregue 50g / 2oz del azúcar, 500ml / 16floz de la leche, la crema doble y la vaina de vainilla y lleve la mezcla a ebullición.", "Reduzca el fuego a fuego lento y cocine durante 30-40 minutos hasta que esté tierno y todo el líquido se absorba. (Si está cocinando el arroz con leche por adelantado, distribuya el arroz en una bandeja y póngalo a un lado para que se enfríe, y déjelo enfriar en la nevera hasta que lo necesite).", "Regrese el arroz a una cacerola, agregue la leche restante y deje que hierva lentamente. Agregue la crema coagulada hasta que esté bien combinada.", "Vierta la mezcla en una fuente para hornear, espolvoree el azúcar restante y caramelice con una linterna de cocina o debajo de una parrilla caliente.", "Mientras tanto, para la piña caramelizada, caliente una sartén hasta que esté caliente, agregue la piña y cocine durante 1-2 minutos en cada lado. Agregue el jugo de limón, el azúcar y la mantequilla y cocine durante 1-2 minutos o hasta que la salsa burbujee y espese.", "Para servir, espolvorea unas rebanadas de piña en platos para servir, coloca el pudín de arroz al lado y termina con un chorrito de caramelo de piña."], "url": "www_bbc_co_uk_food_recipes_clotted_cream_rice_03146", "title": "Pudín de arroz crema coagulada con piña caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz con leche", "600ml / 21fl oz de leche entera", "Crema doble 500ml / 18fl oz", "1 vaina de vainilla, dividida", "125 g / 4½ oz de azúcar en polvo", "nuez moscada recién rallada", "30g / 1oz de mantequilla, más extra para engrasar", "110g / 4oz de crema coagulada", "Frambuesas 125g / 4½ oz", "125 g / 4½ oz de fresas", "2 cucharadas de azúcar glas", "250g / 9oz de harina blanca fuerte", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla, ablandada", "7g de levadura instantánea", "aceite vegetal, para freír", "50g / 1¾oz de azúcar en polvo, para quitar el polvo"], "method": ["Para el pudín de arroz con leche coagulada, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Engrase ligeramente un recipiente para budín de 1 litro / 1¾ de pinta o un plato resistente al horno.", "Lavar el arroz con agua fría y escurrir.", "Coloque la leche y la crema en una olla con la vaina de vainilla y deje que hierva lentamente.", "Agregue el arroz y el azúcar y mezcle bien.", "Vierta la mezcla en el recipiente para pudin o en el plato y ralle sobre un poco de nuez moscada.", "Cortar la mantequilla en trozos pequeños y colocar sobre la mezcla de arroz.", "Transfiera el plato al horno y hornee durante aproximadamente 15 minutos, agregue la crema coagulada y mezcle y luego baje la temperatura a 150C / 300F / Gas 2.", "Hornea por otra hora, o hasta que esté dorado por encima y cremoso por debajo.", "Para la salsa de bayas, coloque todos los ingredientes en una olla con 50 ml / 2 fl oz de agua y cocine durante 3-4 minutos.", "Para las mini donas, combine la harina, la sal y el azúcar en polvo en un tazón grande.", "Mezcle la mantequilla, 150ml / 5½fl oz de agua y la levadura hasta que la mezcla se una para formar una masa suave. Cubra con clingfilm y déjelo a un lado en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño.", "Divida la masa en 12 porciones iguales y enrolle cada una en una bola.", "Alinee una bandeja para hornear con pergamino para hornear y coloque las bolas de masa sobre ella, dejando espacio suficiente entre cada bola. Cubra y reserve en un lugar cálido para probar durante otros 20 minutos.", "Cuando la masa haya demostrado, caliente el aceite en una freidora a 150 ° C / 300 ° F. Alternativamente, caliente el aceite en una olla profunda de base pesada. (Precaución: El aceite caliente puede ser peligroso. No lo deje desatendido).", "Con cuidado, baje las rosquillas en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Cuando el exceso de aceite haya drenado las rosquillas, colóquelas en un plato y espolvoree con el azúcar impalpable hasta que esté completamente cubierto.", "Para servir, coloque una cucharada de budín de arroz en tazones para servir poco profundos con la salsa de bayas y mini rosquillas."], "url": "www_bbc_co_uk_food_recipes_clotted_cream_rice_37046", "title": "Pudín de arroz crema coagulada con salsa de bayas y mini donas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "200g / 7oz de arroz con leche", "50 g / 2 oz de azúcar en polvo", "600 ml / 1 pinta 2 fl oz de leche", "Crema doble 500ml / 18fl oz", "1 vaina de vainilla, semillas raspadas", "110g / 4oz de crema coagulada", "50 g / 2 oz de azúcar en polvo", "Frambuesas 300 g / 10 oz", "75g / 3oz de azúcar en polvo", "1 naranja, solo jugo"], "method": ["Para el arroz con leche, caliente una cacerola hasta que esté caliente. Agregue la mantequilla y el arroz y cocine durante un minuto, revolviendo para cubrir el arroz con la mantequilla derretida.", "Agregue el azúcar, la leche, la crema doble, la vaina de vainilla y las semillas. Remover bien y llevar a ebullición.", "Reduzca el fuego a fuego lento y cocine a fuego lento durante 30-40 minutos hasta que el arroz esté tierno y todo el líquido haya sido absorbido por el arroz. Retire la vaina de vainilla y deseche (o enjuague y seque a fondo para usar en otra receta de su elección).", "Mientras tanto, para las frambuesas, caliente una sartén hasta que esté caliente y agregue el azúcar y las frambuesas. Cocine por 2-3 minutos hasta que las frambuesas estén blandas y el azúcar se haya derretido. Dejar enfriar un poco.", "Para el caramelo de naranja, caliente una sartén hasta que esté caliente. Agregue el azúcar y caliente hasta que el azúcar se derrita y comience a caramelizar. Agregue el jugo de naranja (tenga cuidado ya que el caramelo puede escupir) y bata para combinar.", "Cuando esté listo para servir, mezcle la crema coagulada en el budín de arroz y caliente. Coloque las frambuesas en el fondo de un plato para servir, cubra con el budín de arroz con leche y vierta el caramelo naranja sobre la parte superior. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_clottedcreamricepudd_89100", "title": "Pudín de arroz con crema coagulada con frambuesas y caramelo de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte", "5g de sal", "7 g de levadura de acción rápida", "30 g / 1 oz de azúcar en polvo", "1 naranja, ralladura fina solamente", "120ml / 4fl oz de leche entera", "50 g / 1¾oz de mantequilla sin sal", "6 vainas de cardamomo, semillas retiradas y trituradas", "1 huevo mediano de granja, golpeado", "120 g / 4¼ oz de chocolate negro, dividido en 24 piezas iguales", "250g / 9oz de harina blanca fuerte", "15 g / ½ oz de cacao en polvo", "5g de sal", "7 g de levadura de acción rápida", "30 g / 1 oz de azúcar en polvo", "120ml / 4fl oz de leche entera", "50 g / 1¾oz de mantequilla sin sal", "1 cucharadita de extracto de vainilla", "1 huevo mediano de gallinas camperas", "120g / 4¼ oz de chocolate blanco, dividido en 24 piezas iguales", "2 cucharadas de sémola fina", "aceite vegetal, para engrasar", "50 g / 1 oz de azúcar en polvo", "2 tiras anchas de cáscara de naranja", "2 vainas de cardamomo, aplastadas"], "method": ["Para la masa de naranja, coloque la harina en el cuenco de un mezclador independiente equipado con un gancho de masa. Agregue la sal, la levadura, el azúcar y la ralladura. Mezcle a baja velocidad. Alternativamente, ponga estos ingredientes en un tazón grande y mezcle bien para combinar.", "Suavemente caliente la leche, la mantequilla y el cardamomo hasta que la mantequilla se derrita, luego agregue a la mezcla seca. Poco a poco agregue el huevo, mezclándolo durante aproximadamente 5 minutos hasta que la masa esté suave y lisa. Siga amasando la masa hasta que esté suave y elástica. Alternativamente, amasar la masa a mano dentro de un tazón grande durante 5-10 minutos, hasta que esté suave y elástica, la masa estará bastante húmeda. Incline la masa en un recipiente ligeramente engrasado y cubra con una película adhesiva. Coloque en un lugar cálido durante 1 hora, o hasta que la masa se haya duplicado en tamaño y salte cuando lo presione.", "Para el chocolate y la masa de vainilla, ponga la harina y el cacao en polvo en el cuenco de un mezclador independiente equipado con un gancho de masa. Agregue la sal, la levadura y el azúcar. Mezcle a baja velocidad. Alternativamente, ponga estos ingredientes en un tazón grande y mezcle bien para combinar.", "Suavemente caliente la leche, la mantequilla y la vainilla hasta que la mantequilla se derrita, luego agregue a la mezcla seca. Poco a poco agregue el huevo, mezclándolo durante aproximadamente 5 minutos hasta que la masa esté suave y lisa. Siga amasando la masa hasta que esté suave y elástica. Alternativamente, amasar la masa a mano dentro de un tazón grande durante 5-10 minutos, hasta que quede suave y elástica. Incline la masa en un recipiente ligeramente engrasado y cubra con una película adhesiva. Coloque en un lugar cálido durante 1 hora, o hasta que la masa se haya duplicado en tamaño y salte cuando lo presione.", "Engrase una lata de resorte de 25 cm / 10 pulg. De lados profundos y redondee el interior con sémola.", "Divida cada tipo de masa en 12 porciones iguales. Aplane cada porción en un disco de aproximadamente 8 cm / 3¼ pulgadas de diámetro y coloque dos trozos de chocolate uno encima del otro en el medio. Recoge los bordes de la masa para formar un saco y pellizca para sellar. Gire suavemente la bola en sus manos y luego colóquela en la lata con el borde sellado hacia abajo. Ruede la masa restante de la misma manera, alternando bolas de naranja y masa de chocolate en la lata. Comience desde el exterior de la lata, donde habrá 14 bolas, luego 8 en el centro y 2 en el interior. Cubra la lata con film transparente y demuestre durante 30-40 minutos en un lugar cálido.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mientras tanto, por el jarabe. Ponga el azúcar en polvo, 50 ml / 2 fl oz de agua, cáscara de naranja y las vainas de cardamomo en una sartén pequeña. Calentar suavemente hasta que el azúcar se disuelva y llevar a ebullición durante 1 minuto. Sáquelo del fuego y apártelo.", "Hornee el pan durante 20 minutos, o hasta que la parte superior se haya dorado. Retire de la lata y coloque boca abajo sobre una bandeja para hornear forrada con papel de hornear. Regrese al horno por otros 10-12 minutos hasta que esté bien cocido. Coloque el pan con el lado derecho sobre una rejilla de alambre y deje que se enfríe un poco antes de cepillar con el jarabe. Sirva el pan tibio mientras el relleno de chocolate todavía esté caliente."], "url": "www_bbc_co_uk_food_recipes_cobbled_loaf_02891", "title": "Pan cocido", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan dulce grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cobbled_loaf_02891_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mejillones de 500 g / 1 libra y 2 onzas, sin barba y limpiados con agua corriente fría", "Berberechos de 400g / 14oz (lavados y filtrados de la arena y la hendidura)", "300 ml / ½ pinta buena sidra del país del oeste seco", "3 chalotes de plátano, pelados y cortados en cubitos", "6 palitos de apio, pelados y cortados en cubitos", "100g / 3½oz de crema cuajada", "1 limón, solo jugo", "2 cucharadas de perifollo fresco picado", "sal y pimienta negra recién molida", "pan, para servir"], "method": ["Si hay mejillones abiertos, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos. Haga lo mismo con los berberechos que permanecen abiertos cuando se golpea.", "Agregue los berberechos y los mejillones a una cacerola grande con tapa, agregue la sidra, ponga la tapa y cocine a fuego medio-alto hasta que los mariscos se abren - deseche los que no se abran.", "Retire los mejillones y los berberechos de la sartén. Drene el líquido y coloque el caldo de sidra a un lado. Vuelva a poner la sartén sobre el fuego y cocine la chalota y el apio hasta que estén blandos.", "Vierta el caldo de sidra en las verduras y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema coagulada.", "Agregue los berberechos y los mejillones a la sartén y vuelva a calentarlos. Termine con jugo de limón, perifollo, pimienta negra y sal.", "Sirva los berberechos y los mejillones en tazones poco profundos con un pan grueso y sano como un bloomer de amapola y linaza."], "url": "www_bbc_co_uk_food_recipes_cockles_and_mussels_81006", "title": "Berberechos y mejillones cocinados en sidra West Country y crema coagulada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla, finamente rebanada", "2 ramitas de tomillo fresco", "150 g / 5 oz mezcla de setas silvestres, en rodajas", "50g / 2oz sin cáscara de cobnuts frescos", "Castañas de 150g / 5oz, asadas, peladas", "sal y pimienta negra recién molida", "1 pollo asado"], "method": ["Coloque una sartén a fuego alto. Agregue la mantequilla y, cuando esté derretida y espumante, agregue las cebollas. Freír durante 2-3 minutos, hasta que se ablanden, luego agregue el tomillo y las setas. Saltear durante otros 2-3 minutos, hasta que estén tiernos.", "Agregue los cocos y las castañas y fría durante 1-2 minutos hasta que se caliente, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Sirva una cucharada con un plato de pollo asado."], "url": "www_bbc_co_uk_food_recipes_cobnutwildmushrooman_84174", "title": "Salteado de castañas, champiñones y castañas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1,5 kg / 3 lb 5 oz de pollo listo para cocinar", "2 litros / 3½ pintas de caldo de pollo (o agua)", "3 hojas de laurel", "4 puerros, cortados a la mitad longitudinalmente, finamente triturados", "2 zanahorias, peladas, cortadas a la mitad longitudinalmente, en rodajas finas", "2 palitos de apio, cortados a la mitad longitudinalmente, en rodajas", "12 ciruelas secas listas para comer, desmenuzadas", "sal y pimienta negra recién molida"], "method": ["Siente el pollo en una olla grande para que quede bien ajustado y agregue el caldo; necesitas suficiente para cubrir el pollo.", "Agregue la bahía y sazone con sal y pimienta. Llevar a ebullición a fuego alto. Cubra y cocine a fuego lento durante 1-1¼ horas, o hasta que esté cocido. Retire el pollo del líquido y verifique que los jugos se vean claros sin ningún rastro de color rosa cuando la parte más gruesa de la pierna, entre el muslo y el muslo, se perfora con un pincho (si no, cocine por un poco más). Separe ligeramente para que se enfríe rápidamente.", "Agregue los puerros, las zanahorias, el apio y las ciruelas pasas al líquido de cocción (si usó agua, agregue un par de cubos de caldo de pollo en esta etapa).", "Llevar a ebullición, luego cubrir y cocinar durante 20 minutos, o hasta que las verduras estén tiernas.", "Tire la carne de la carcasa del pollo en trozos del tamaño de un bocado, descartando cualquier piel y hueso. Retire las hojas de laurel de la sartén, agregue un poco de sal y pimienta si es necesario, devuelva el pollo a la sartén y revuelva. Caliente hasta que esté caliente. Sirva en tazones o tazas calientes."], "url": "www_bbc_co_uk_food_recipes_cock-a-leekie_soup_03663", "title": "Sopa de Cock-a-leekie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cock-a-leekie_soup_03663_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo mediano", "1 zanahoria, pelada y cortada en cubitos", "1 cebolla, pelada y cortada en cubitos", "2 palitos de apio, cortados en cubitos", "1 puerro, lavado y cortado en cubitos", "1 bouquet garni", "Para aclarar:", "Pollo de 150g / 6oz, picado", "2 claras de huevo", "Para el acabado:", "1 puerro grande, cortado en longitudes de 10-12.5cm / 4-5in alrededor de 1cm / ½ en ancho", "15 ciruelas pasas, en juliana", "sal y pimienta"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el pollo en un estante colocado sobre una bandeja de asar y tápelo durante 15-20 minutos hasta que esté dorado.", "Transfiera el pollo a una sartén grande de base pesada, reservando la grasa atrapada en la bandeja de asar. Esparza las verduras en cubitos y vierta suficiente agua fría para cubrir. Agregue el bouquet garni y la temporada. Llevar a ebullición y cocine a fuego lento durante 40-45 minutos hasta que estén tiernos.", "Retire el pollo del caldo y déjelo reposar y enfríelo ligeramente. Retire toda la carne del cadáver y triture el pollo en trozos pequeños.", "Mientras tanto, cuele el caldo a través de un colador fino, descartando las verduras. Devuelva el material pasado a una bandeja limpia. Mezcle el pollo picado y las claras de huevo para combinar y mezcle rápidamente la mezcla en el caldo. Muy lentamente, lleve el caldo a fuego lento. Evite remover, pero mezcle una vez que la reserva esté a la temperatura adecuada. La mezcla de pollo y clara de huevo se solidificará y se elevará a la parte superior del caldo. A medida que el caldo hierva a fuego lento, las impurezas subirán a la parte superior y, por lo tanto, se aclararán las existencias. Pase el caldo a través de un tamiz fino una vez más.", "Poner a hervir una olla de agua con sal y escaldar las tiras de puerro durante 1-2 minutos hasta que se ablanden. Escurrir y refrescar en agua helada. Drenar de nuevo.", "Para servir, coloque algunos trozos de pollo en el centro de cada tazón para servir. Siéntate los puerros y las ciruelas en la parte superior. Ladel el caldo caliente (que calentará los demás ingredientes). Rocíe un poco de la grasa de pollo reservada y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_cockaleekie_9506", "title": "Sopa de Cock-a-leekie", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Laverbread listo para preparar 225 g / 8 oz (disponible en latas de tiendas en línea)", "50 g / 2 oz de harina de avena", "Pimienta blanca recién molida, al gusto", "225g / 8oz recogido carne de berberecho, cocinado", "25g / 1oz de mantequilla", "1 puerro, finamente picado", "50 g / 2 oz de grasa de tocino", "8 lonchas de tocino ahumado, fritas hasta que estén crujientes, para servir"], "method": ["En un tazón, mezcle el laverbread y la avena hasta que estén bien combinados. Sazonar, al gusto, con pimienta blanca recién molida y reservar durante 20 minutos.", "Derrita la mantequilla en una sartén hasta que forme espuma, luego agregue el puerro y fría por 3-4 minutos, o hasta que se ablanden. Agregue la carne de berberecho recogido y cocine durante 1-2 minutos más, o hasta que se caliente por completo.", "Con las manos húmedas, pellizque los pedazos de la mezcla de laverbread y ruede en bolas del tamaño de una pelota de golf. Aplanar las bolas ligeramente para hacer pequeñas empanadas.", "En una sartén por separado, caliente la grasa del tocino a fuego medio. Freír las hamburguesas de laverbread, en pequeños lotes, durante 2-3 minutos en ambos lados o hasta que estén doradas por todas partes.", "Para servir, divida las hamburguesas de laverbread entre cuatro platos para servir y espolvoree los berberechos y los puerros. Cubra cada porción con dos lonchas de tocino crujiente."], "url": "www_bbc_co_uk_food_recipes_cockleslaverbreadand_92241", "title": "Berberechos, laverbread y tocino galés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "200g / 7oz berberechos", "100ml / 3½fl oz de vino blanco", "30g / 1oz de mantequilla", "1 diente de ajo, picado", "3 rebanadas de pan de granja, tostadas"], "method": ["Calentar el aceite de oliva en una sartén, agregar la cebolla y freír suavemente durante cuatro minutos.", "Agregue los berberechos y el vino blanco, cúbralos con una tapa y déjelos durante 3-4 minutos o hasta que se hayan abierto todas las conchas del berberecho.", "Deseche cualquier que no se haya abierto o las cubiertas que estén dañadas.", "Agregue la mantequilla y el ajo a la sartén y cocine por un minuto.", "Para servir, coloque el pan tostado en un plato de servir. Vierta los berberechos y la salsa sobre el pan."], "url": "www_bbc_co_uk_food_recipes_cocklesmariniereserv_87151", "title": "Berberechos marinière sobre pan tostado con ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "2 cucharadas de azúcar glas", "100g / 3½oz de mantequilla sin sal, refrigerada, cortada en cubos de 1cm / ½ en cubitos", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de jugo de limón", "Fechas de 200g / 7oz, piedras removidas, más o menos picadas", "150ml / 5½fl oz de leche entera", "3 peras medianas maduras (aproximadamente 500g / 1lb 2oz), peladas, descuartizadas y sin corazón", "50 g / 1¾oz de mantequilla sin sal, ablandada", "1 cucharadita de extracto de vainilla", "Harina normal de 100 g / 3½ oz", "1 cucharadita de bicarbonato de soda", "50 g / 1¾oz de almendras molidas", "2 huevos grandes de gallinas camperas", "100g / 3½oz de azúcar mascabado ligero", "2 cucharadas de melaza", "100g / 3½oz de copos de avellanas o avellanas, toscamente picados", "200g / 7oz de azúcar mascabado ligero", "50 g / 1¾oz de mantequilla sin sal", "Crema doble 250ml / 9fl oz"], "method": ["Para hacer la masa, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos y luego transfiéralo a un tazón.", "En un recipiente aparte, mezcle el huevo con el jugo de limón y dos cucharadas de agua. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Para el relleno, ponga las fechas picadas y la leche en una sartén. Llevar a ebullición, y luego reservar durante 30 minutos para remojar.", "Para la salsa de caramelo, caliente el azúcar, la mantequilla y la crema juntos en una sartén a fuego lento hasta que se derrita y suavice, luego hierva a fuego lento y deje que burbujee durante cinco minutos para que espese. Deja enfriar.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y coloque una bandeja para hornear en el estante del medio para calentar.", "Extienda la masa en una superficie de trabajo ligeramente enharinada y úsela para revestir la lata de tarta. Pincha la base con un tenedor. Rebana cada cuarto de pera en dos. Arregle en un patrón de abanico circular en la caja de tarta. Rocíe cuatro cucharadas de la salsa de caramelo y coloque la tarta en la nevera mientras prepara el resto del relleno.", "Para el relleno, mezcle la mezcla de la fecha con un puré grueso con un triturador de patatas. Inclínala en un tazón con la mantequilla ablandada, la vainilla, la harina, el bicarbonato de soda, las almendras molidas, los huevos, el azúcar y la melaza. Batir con un batidor eléctrico hasta que se combinen. Agregue las nueces picadas.", "Vierta la mezcla sobre las peras en la caja de repostería, extendiéndola de manera uniforme. Hornea la tarta en la bandeja para hornear caliente durante 40-45 minutos, o hasta que el relleno esté bien levantado y dorado. Déjelo reposar por 10 minutos antes de sacarlo de la lata.", "Sirva la tarta caliente, con crema o helado coagulado y el resto de la salsa de caramelo."], "url": "www_bbc_co_uk_food_recipes_cobnut_pear_and_sticky_68333", "title": "Tarta de caramelo, pera y caramelo toffee", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cobnut_pear_and_sticky_68333_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½ oz de aceite de oliva", "½ cebolla roja picada", "4 dientes de ajo", "1 chile habanero seco y ahumado, picado", "Berberechos frescos de 900g / 2lb, limpios y drenados (deseche cualquier berberecho que permanezca abierto después de la limpieza)", "250ml / 9fl oz de vino blanco", "150ml / 5fl oz pasados", "sal y pimienta negra recién molida", "manojo de perejil fresco, picado", "pan crujiente, para servir"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por 5-6 minutos, o hasta que se ablanden y comiencen a dorarse.", "Agregue el chile seco, los berberechos, el vino blanco, la passata y la sazón, al gusto, con sal y pimienta negra recién molida.", "Cubra la olla con una tapa y cocine al vapor los berberechos durante 4-5 minutos, sacudiendo la olla de vez en cuando, hasta que se hayan abierto todos los berberechos. Deseche cualquier berberecho que no se haya abierto después de cinco minutos.", "Para servir, agrega el perejil fresco y la cuchara en los tazones. Sirve con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_cockleswithsmokedchi_90043", "title": "Berberechos con caldo de chile ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]