[{"isVegetarian": true, "title": "Summer sundaes", "url": "www_bbc_co_uk_food_recipes_summer_sundaes_84021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz rolled oats", "50ml/2fl oz orange juice", "1 tsp sunflower seeds", "1 tsp pumpkin seeds", "1 small banana, sliced", "60g/2¼oz Greek-style yoghurt", "60g/2¼oz mixed berries"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the oats, orange juice, sunflower seeds and pumpkin seeds together in a bowl and set aside for 15 minutes, or until the oats have soaked up all the juice.", "Divide the oat mixture between two small glasses, then add a layer of banana. Spoon in the yoghurt, then top with the berries."]}, {"isVegetarian": false, "title": "Summer tomato salad served with tomato consommé and tapenade", "url": "www_bbc_co_uk_food_recipes_summer_tomato_salad_22698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 ripe tomatoes, chopped", "¼ cucumber, chopped", "splash Worcestershire sauce", "splash red wine vinegar", "salt", "2 garlic cloves", "handful basil leaves", "1 garlic clove", "4 tbsp capers", "200g/7oz black olives", "splash sherry vinegar", "extra virgin olive oil", "salt and freshly ground black pepper ", "5 tomatoes, preferably mixed colours", "3 asparagus spears, tips only", "5 radishes", "½ bulb fennel", "100g/3½oz broad beans", "small bunch baby basil"], "serves": "Serves 2-3", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["For the vegetable consommé, season the tomatoes and cucumbers and with Worcestershire sauce and red wine vinegar.", "Blend all the ingredients together in a food processor.  ", "Place a sieve lined with a muslin cloth on top of a bowl, then pour in the vegetable consommé mixture. ", "Bring the edges of the muslin together, tie with a piece of string and hang over the bowl. Leave for six hours to drain. Reserve the liquid consommé collected in the bowl.", "For the tapenade, blend all of the ingredients in a food processor, adding just enough olive oil until it forms a paste, seasoning to taste with salt and pepper.", "For the salad, slice the tomatoes into different sized pieces.", "Slice the asparagus, radish and fennel and place them in a bowl of cold, iced water to chill. When ready to serve, drain.", "To serve, divide the tomatoes, broad beans and chilled vegetables between four small serving bowls and garnish with the tapenade and baby basil. Pour over the consommé. "]}, {"isVegetarian": false, "title": "Spring truffle pithiviers with a Maderia reduction", "url": "www_bbc_co_uk_food_recipes_summer_truffle_60302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "250g/9oz butter, chilled and cut into pieces", "½ tsp salt", "125ml/4½fl oz ice-cold water", "4 spring truffles", "75ml/2½fl oz Madeira", "400g/14oz good-quality beef or veal stock", "2 boneless chicken breasts", "1 free-range egg, separated and yolk lightly beaten", "200ml/7fl oz double cream", "25g/1oz butter", "50g/1¾oz baby spinach", "puff pastry (from above)", "75g/2½oz butter", "1 shallot, finely chopped", "400g/14oz mixed wild mushrooms", "1 tbsp chopped fresh chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, place the flour in a mound on a clean work surface and make a well in the centre (alternatively use a large mixing bowl). Place the butter and salt in the well and rub them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated (don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly). Bring the mixture into a ball, wrap in cling film and refrigerate for 20 minutes.", "Flour a clean work surface and roll out the pastry to a 40x20cm/16x8in rectangle. (It doesn’t matter if the pastry isn’t exactly the right size - the important thing is that the corners are tidy and square.) Starting with a narrow edge of the rectangle, fold the top third down to the centre, then the bottom third up and over that. ", "Turn the pastry 90 degrees and again roll into a 40x20cm/16x8in rectangle. Fold it as before, then wrap the pastry in cling film and refrigerate for 30 minutes.", "Remove the chilled pastry and repeat the process (rolling and folding another two times). Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.", "For the spring truffle pithivier, preheat the oven to 200C/400F/Gas 6.", "Place the truffle in a saucepan with the jus and Madeira and poach for 10 minutes. Remove from the liquid and pat dry. Keep the liquid for the sauce. ", "Place the chicken in a food processor and blend. Add the egg white and blend again. Add the cream and blend to a smooth mousse. Place in a piping bag with a plain nozzle attached and set aside.", "Heat a large frying pan and, once hot, add the butter. When the butter has melted, add the spinach and cook for a couple of minutes, or until the spinach has wilted. Turn out onto kitchen paper to drain.", "Roll out the chilled pastry onto a floured surface and cut out eight circles using a saucer as a guide.", "Take four circles of pastry and lay the spinach in a circle on top of each one – leaving a 1cm/½in gap around the edge.  Place a truffle on top of each.", "Pipe the chicken mousse around the truffles and place another circle of pastry on top. Using a fork, crimp the edges to seal (if desired, you can also use a knife to draw a design on the top at this stage).", "Brush the top of the pithiviers with lightly beaten egg yolk and place in the oven for 10-15 minutes, or until golden-brown.", "Meanwhile to make the Madeira reduction, heat a pan and add one third of the butter. When melted, add the shallot and cook for a couple of minutes, then add the Madeira and stock used to cook the truffle and cook until the volume of liquid has reduced by half.", "In a separate pan, heat the remaining butter. Once hot, add the mushrooms and cook for three minutes. Set aside until ready to serve.", "To serve, place a pithivier in the centre of each plate. Add the mushrooms and drizzle the reduction around the edge. Garnish with chervil."]}, {"isVegetarian": false, "title": "Summer vegetable soup", "url": "www_bbc_co_uk_food_recipes_summer_vegetable_soup_10343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz bunch fresh basil", "100ml/3½fl oz olive oil (not extra virgin)", "4 large ripe vine tomatoes, skinned, quartered, seeds removed", "1 tbsp olive oil (not extra virgin)", "1 small onion, finely chopped", "1 stick celery, trimmed and finely sliced", "2 garlic cloves, finely sliced", "1 slender, young leek, trimmed and finely sliced", "3 small courgettes, trimmed and cut into 1cm/½in dice", "1.5 litres/2½ pints chicken stock, fresh or made with 1 chicken stock cube", "50g/1¾oz dried spaghetti", "1 tbsp tomato purée", "200g/7oz fresh peas (or frozen out of season)", "200g/7oz freshly podded baby broad beans (or frozen out of season)", "200g/7oz green beans, trimmed and cut into 1cm/½in lengths", "flaked sea salt and freshly ground black pepper", "40g/1½oz parmesan "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the basil oil, strip the basil leaves from the stalks and place in a large heatproof bowl. Half fill a large bowl with cold water and add a few ice cubes. Boil a kettle full of fresh water and pour over the basil. Immediately drain in a colander and plunge into the bowl of iced water. This will help set the vibrant green colour. Leave for five minutes.", "Drain the cooled basil leaves in a colander and tip out onto a clean tea towel. Pat gently until as dry as possible then tip into a jug. Add the oil and blend to a purée using a stick blender. (You can also do this in a small food processor.) Season with salt and freshly ground black pepper. Pour into a small bowl and set aside for at least 30 minutes. (You can then press the basil and oil through a fine sieve if you like, or leave it just as it is.)", "To prepare the soup, heat the oil in a large non-stick saucepan or frying pan and fry the onion and celery very gently for five minutes, or until softened but not coloured, stirring often. While the onion is cooking, Cut the tomato flesh into roughly 1cm/½in pieces.", "Add the garlic, leek and courgettes to the pan with the onion. Stir over a low heat for a minute or two, then stir in the freshly chopped tomatoes. Pour over the chicken stock and bring to the boil.", "Break the spaghetti into 2-3cm/1in short lengths and drop into the pan. Add the tomato purée and return to the boil. Cook for eight minutes, stirring occasionally.  Add the peas, broad and green beans and cook for a further five minutes, or until the pasta is just tender.", "Season the soup with salt and lots of freshly ground black pepper. Serve in deep bowls. ", "Drizzle with the basil oil and either grate or shave the parmesan with a vegetable peeler over the top. (Any leftover basil oil can be covered and kept in the fridge for three days. Allow stand at room temperature before using.)"]}, {"isVegetarian": false, "title": "Summer berries and red wine jelly", "url": "www_bbc_co_uk_food_recipes_summerberriesandredw_68025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz strawberries", "110g/4oz blackberries", "110g/4oz raspberries", "110g/4oz blue berries", "110g/4oz loganberries", "2 oranges, juice only", "110g/4oz sugar", "1 vanilla pod, split lengthways", "1 cinnamon stick", "500ml/17fl oz red wine (something light, for example pinot noir)", "300ml/10fl oz red port", "8 sheets gelatine"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a hot pan place the sugar with the vanilla and cinnamon.", "Start adding the berries, firmest first and softest last and then the orange juice.", "Cook the berries for approximately 5 minutes and remove from the heat. Chill them in the fridge.", "Warm the wine and port in a pan. Soften the gelatine in a little cold water and slowly add to the wine. Once it is all incorporated place it in a flat container and chill it.", "Once the jelly has set, place it on a clean cloth and chop the jelly into small crystals, then put it back in the container. ", "Spoon the jelly into the centre of the plate and drizzle the berries around it to serve."]}, {"isVegetarian": false, "title": "Summer vegetable soup with mussels", "url": "www_bbc_co_uk_food_recipes_summer_vegetable_soup_45439", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_vegetable_soup_45439_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "1 banana shallot, finely chopped", "150g/5oz courgettes, trimmed, cut into 1cm/½in cubes", "1 fennel bulb, cut into 1cm/½in cubes, leafy fronds reserved", "150g/5oz carrots, peeled, cut into 1cm/½in cubes", "100g/3½oz celery stems, trimmed, cut into 1cm/½in cubes", "8 radishes, trimmed, cut in half from top to base", "500g/1lb 2oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when firmly tapped)", "150ml/5fl oz white wine", "750ml/1¼ pints vegetable stock", "2 tbsp chopped fresh mint leaves, stalks reserved", "2 tbsp chopped fresh dill fronds, stalks reserved", "2 tbsp chopped fresh tarragon leaves, stalks reserved", "2 tbsp chopped fresh flatleaf parsley leaves, stalks reserved", "2 tbsp chopped fresh watercress leaves, stalks reserved", "2 tbsp chopped fresh basil leaves", "1 large shallot, roughly chopped", "6 anchovies, drained, roughly chopped", "2 tbsp capers, drained and rinsed", "½ lemon, juice only", "1 tsp Dijon mustard", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt the butter in a heavy-based, lidded saucepan over a low to medium heat. Add all of the vegetables and fry gently for 4-5 minutes, or until just softened.", "Add the mussels, wine and stock and bring the mixture to the boil. Cover the pan with the lid and reduce the heat until the mixture is simmering. Simmer for 2-3 minutes, or until the mussels have opened. (Discard any mussels that do not open during cooking.)", "For the salsa verde, put all the herbs in a food processor and pulse until roughly chopped. Add the shallot, anchovies, capers, lemon juice, mustard and oil and blend to a rough purée. Season, to taste, with salt and freshly ground black pepper.", "Remove the soup from the heat and stir in 2-3 tablespoons of the salsa verde.", "Serve immediately, with an extra dollop of salsa verde on top of each portion. (Any remaining salsa verde can be decanted into an airtight container and covered with a thin layer of olive oil. It can be kept in the fridge for up to four days.)"]}, {"isVegetarian": false, "title": "Summer berry trifle", "url": "www_bbc_co_uk_food_recipes_summerberrytrifle_93217", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 135g/4¾oz packet raspberry or strawberry jelly ", "170g/6oz ready-made jam-filled Swiss roll", "5 tbsp cream sherry", "75g/2½oz blueberries", "100g/3½oz raspberries", "150g/5oz strawberries, hulled and halved ", "300ml/10½fl oz milk", "300ml/10½fl oz double cream", "1 vanilla pod, split, seeds scraped out", "2 tbsp cornflour", "2 tbsp cold water", "4 large free-range egg yolks", "75g/2½oz caster sugar", "10g/½oz flaked almonds", "300ml/10½fl oz double cream"], "serves": "6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Prepare the jelly according to packet instructions, but do not place it into the fridge to set. ", "Cut the Swiss roll into 12 equal slices and arrange them over the base and a short way up the sides of a glass trifle bowl. Put any remaining slices in the middle of the bowl. ", "Spoon the sherry over the Swiss roll slices and allow to soak into the sponge for a few minutes. Scatter the fruit on top of the soaked sponge. Pour the prepared jelly over the fruit. Cover the dish with cling film and leave to set in the fridge for about two hours. ", "Meanwhile, for the custard, pour the milk and cream into a medium heavy-based pan. Add the vanilla pod and seeds, then slowly bring to the boil. Once the mixture comes to the boil, remove from the heat and set aside to infuse for 15 minutes. Remove and discard the vanilla pod. ", "Mix the cornflour with the water in a small bowl until smooth and well combined, then set aside. ", "Whisk the egg yolks and sugar in a large bowl until pale and fluffy. Gradually stir the warm milk and cream mixture into the egg and sugar mixture until smooth. Return the mixture to the saucepan and heat over a low heat. ", "Cook for around 8-10 minutes, stirring continuously, until the custard has thickened enough to coat the back of a wooden spoon. ", "Give the cornflour mixture a stir, then mix quickly into the custard. Cook for 1-2 minutes more, or until the custard is very thick and smooth, stirring continuously.", "Remove the pan from the heat and pour the custard into a bowl placed over a second bowl filled with iced water. Cover the surface of the custard with cling film to prevent a skin from forming. Set aside until the custard has cooled. ", "When the custard has cooled, remove and discard the cling film. Stir the custard a few times, then gently pour onto the set jelly. ", "Cover with cling film and return the trifle dish to the fridge for a further 30 minutes, or until the custard is lightly set. ", "For the topping, lightly toast the almonds in a dry frying pan over a low heat for 2-3 minutes, or until golden-brown (keep the almonds moving around the pan frequently to prevent them from burning). Set aside to cool. ", "Whip the cream in a bowl until soft peaks form when the whisk is removed. Spoon the whipped cream over the custard, starting at the sides of the bowl before working your way into the middle. Scatter over the almonds, cover and return to the fridge until ready to serve. ", "To serve, spoon the trifle into serving bowls and eat immediately."]}, {"isVegetarian": false, "title": "Summer fruits gâteau", "url": "www_bbc_co_uk_food_recipes_summerfruitsgateau_72273", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g/9oz sponge flan cases", "600ml/1 pint double cream", "25g/1oz caster sugar", "2 tbsp brandy", "1 packet ladyfinger biscuits", "1 jar fruit compote", "1 large punnet raspberries", "55g/2oz icing sugar", "mixed fresh fruits, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Line a 18cm/7in baking tin or springform tin with a little oil and cling film.", "Cut out the centre of both flans using a 20-25cm/8-10in springform tin base as a guide. ", "Line the bottom of the tin with one of the circles, and reserve the other.", "Whip the double cream with the sugar and brandy until thick, and put in the fridge.", "Cut the ladyfinger biscuits in half. Line the ring with the ladyfinger halves so that they form an attractive exterior.", "Spoon the fruit compote in the bottom of the flan in an even layer.", "Spoon the chilled, whipped cream into the ring and gently press to the edges, ensuring that you keep the biscuits in place.", "Scatter over the raspberries.", "Add the other sponge disc and press it down gently. ", "Put a plate over the bottom of the tin and, carefully, turn the tin over. ", "Gently remove the springform tin but keep the cling film in place. Put the cake into the fridge and let it set for at least one hour.", "Remove from the fridge and take off the cling film. Dust with icing sugar, garnish with fresh fruits and serve."]}, {"isVegetarian": true, "title": "Summer pickle", "url": "www_bbc_co_uk_food_recipes_summerpickle_74851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 apples, chopped", "1 onion, chopped", "150g/5¼oz raisins ", "1 banana", "6 tomatoes", "1 garlic clove, crushed", "1 red chilli, de-seeded and chopped", "white wine vinegar, to taste", "caster sugar, to taste", "25g/1oz butter ", "1 cauliflower, chopped into florets", "4 Granny Smith apples, cored and chopped", "400g/14¼ oz onions, chopped", "150g/5¼ oz golden raisins", "100ml/3½fl oz white wine vinegar", "50g/1¾oz muscovado sugar", "50g/1¾oz molasses"], "serves": "1.5kg", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the fruit compote by placing all the ingredients, except the vinegar and sugar, in a large saucepan. Heat gently until the fruit is soft and stewed.  Taste and adjust the seasoning - adding sugar if it's too savoury, vinegar if it's too sweet.  Set aside.", "For the pickle, heat the butter in a heavy pan. ", "Add the fruit, vegetables, vinegar, sugar and molasses and bring to the boil, stirring occasionally to dissolve the sugar.  ", "Tip in the fruit compote and simmer gently for 20 minutes.  ", "Leave to cool then decant into sterilised preserving jars. The flavour will improve over time. ", "For non-vegetarians it is a good accompaniment to slices of roast beef and chicken liver parfait."]}, {"isVegetarian": true, "title": "Summer pudding", "url": "www_bbc_co_uk_food_recipes_summerpudding_90295", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summerpudding_90295_16x9.jpg", "ingredients": ["750g/1lb 14oz mixed summer fruit (such as raspberries, red, white and blackcurrants, tayberries, loganberries, blackberries, cherries and blueberries", "185g/6½oz caster sugar", "1 medium loaf good-quality white bread, slightly stale", "2 tbsp cassis or blackcurrant cordial"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the fruit in a pan. Remove the stems from the redcurrants (if using) with a fork, pour the sugar over the fruit and stir gently to mix together.", "If you have time, cover the pan with a tea towel or cling film and leave for 3-5 hours (or overnight) to get the juices running. Place the pan over a moderate heat and bring gently up to the boil.", "While the fruit is simmering, cut the bread into thin slices and remove the crusts.", "When the juices are beginning to flow, raise the heat slightly and simmer for about 2-3 minutes. Then turn off the heat and stir in the cassis or blackcurrant cordial.", "Cut a round out of one slice of bread to fit the bottom of the bowl, then cut the remaining slices into triangular wedges.", "Dip one side of the bread circle into the juices in the pan containing the fruit, then place the circle in the bottom of the pudding basin, juice-side down. Do the same with the bread triangles, dipping one side of the bread into the juices before placing them around the edge of the bowl, with the dipped side facing outwards. The tips of the bread triangles will be sticking up from the top of the bowl at this stage.", "Once the bowl is completely lined with the juice-soaked bread (be sure to plug any gaps with small pieces of bread if necessary), spoon all of the fruit and its juices into the pudding basin. Trim the tips of bread from around the edge. Cover the top of the fruit with more wedges of bread. Place the pudding basin on a plate to collect any juices.", "Find a saucer that fits neatly inside the bowl. Place it on top to cover the upper layer of bread, then weigh the saucer down with weights - bags of rice, tins of baked beans, or whatever comes to hand. Let it cool, then place in the fridge overnight.", "The next day, remove the weights and the saucer. Run a thin blade around the edges, then invert the basin onto a shallow serving plate.", "Turn the pudding out, cut into thick slices and serve the summer pudding with cream."]}, {"isVegetarian": false, "title": "Individual summer puddings", "url": "www_bbc_co_uk_food_recipes_summerpudding_91739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz sugar", "100ml/3½fl oz water", "1 vanilla pod, seeds scraped out", "100g/3½oz blueberries", "100g/3½oz strawberries, hulls removed, quartered", "100g/3½oz raspberries", "2 tbsp orange liqueur", "12 slices white bread, crusts removed, sliced in half", "3 tbsp finely chopped rose-flavoured Turkish delight ", "icing sugar", "clotted cream", "3 tbsp finely chopped rose-flavoured Turkish delight"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the sugar, water and vanilla pod and seeds into a pan and bring to the boil. Reduce the heat and simmer for 7-8 minutes, then add the berries and orange liqueur. Remove the pan from the heat and set aside to cool. ", "When cooled, strain the berries through a sieve, reserving both the liquid and the fruit in separate bowls. Discard the vanilla pod. ", "Dip the bread slices in the fruit juice, then use a third of the soaked bread slices to line four small dariole moulds. Spoon some of the berries into the bottoms of each mould, then divide half of the chopped Turkish delight among them. Top with half of the remaining soaked bread, then spoon over the remaining berries and top with the remaining soaked bread. Press down to pack the bread and berries into the moulds. ", "Cover the moulds with cling film and chill in the fridge overnight. ", "To serve, turn the puddings out onto serving plates, dust with icing sugar and top with a dollop of clotted cream. Sprinkle over the chopped Turkish delight and serve."]}, {"isVegetarian": true, "title": "Summer pudding", "url": "www_bbc_co_uk_food_recipes_summerpudding_91969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz fresh raspberries", "800g/1¾lb fresh strawberries, hulls removed, cut in half", "600g/1lb 5oz fresh blackcurrants or redcurrants", "300g/10½oz caster sugar", "½ lemon, juice only", "150ml/5fl oz white wine", "300ml/10½fl oz water", "12 slices thick-cut white bread, crusts removed", "fresh Jersey double cream, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Bring half of the fruit and all of the sugar, lemon juice, wine and water to a simmer in a pan. Continue to simmer for 4-5 minutes, stirring regularly, until the berries have softened and the sugar has dissolved. ", "Transfer the cooked fruit to a sieve using a slotted spoon and strain any liquid back into the pan. Set the drained fruit aside. ", "Bring the fruit juice mixture to the boil and cook for 20-25 minutes, or until the volume of liquid has reduced to a syrup.", "Strain the syrup mixture into a clean pan, reserving 200ml/7fl oz of the strained syrup in a separate bowl. ", "Return the cooked fruit to the pan containing the fruit syrup. Set aside to cool.", "When the syrup and cooked fruit are completely cool, add the remaining (uncooked) fruit and stir well to combine. ", "Line a 1.8 litre/3 pint pudding basin with 2 large sheets of clingfilm (the edges of the clingfilm should hang over the top of the basin so that they can be used to cover the base of the pudding). ", "Cut 10 of the bread slices into two equal-sized rectangles. Thoroughly paint one side of each bread rectangle with the reserved 200ml/7fl oz of fruit syrup. ", "Using the open end of the pudding basin as a template, cut a disc from one of the remaining whole slices of bread and paint one side of it with the fruit syrup. ", "Using the base of the pudding basin as a template, cut a disc from the remaining whole slice of bread and paint one side of it with the fruit syrup. (Reserve any remaining fruit syrup.)", "Put the small bread disc, painted-side down, into the base of the pudding basin. Arrange the bread rectangles, painted-sides down, around the insides of the basin, overlapping the slices slightly where they join.", "Fill the pudding basin with the mixed fruit and top with the remaining large bread disc. ", "Draw the excess cling film layers over the base of the pudding until it is completely sealed. Place a small plate on top of the pudding basin and weigh down with a heavy weight.  ", "Chill the summer pudding in the fridge overnight. ", "To serve, unwrap the clingfilm from the base of the summer pudding. Invert the summer pudding onto a serving plate and remove the remaining cling film. Cut the summer pudding into wedges and serve with cream (if using) and any remaining fruit syrup."]}, {"isVegetarian": true, "title": "Summer red fruits in beer batter", "url": "www_bbc_co_uk_food_recipes_summerredfruitsinbee_12294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 punnet of strawberries", "1 punnet of raspberries", "30g/1oz yeast", "250ml/9fl oz beer or lager", "180g/6oz plain flour", "1 tsp white wine vinegar", "a pinch of salt", "a pinch of sugar", "oil for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dissolve the yeast in the beer and add in the salt, sugar and vinegar together into a large mixing bowl. ", "Sieve the flour into the liquid and beat till smooth and creamy. Place in the fridge for at least 20 minutes before use. ", "Heat the oil in a frying pan to 180C/350F/Gas 4.", "Hull the strawberries and cut in half. Dip the strawberries and raspberries in some flour shaking off the excess.", "Add the fruit to the batter, remove and drain off any excess and place directly into the hot oil and fry until golden and puffed up.", "Drain on kitchen paper and dust them  with caster sugar (a little finely ground black pepper added to the sugar is a nice twist).", "Make a coulis from both fruits pureéd together with caster sugar and lemon juice, using a hand blender. Pass the coulis through a sieve to remove the seeds.", "Serve the fruits with the coulis and either a dollop of clotted cream or crème fraîche"]}, {"isVegetarian": false, "title": "Summer roast lamb with crunched spiced potatoes, goats' cheese and spinach", "url": "www_bbc_co_uk_food_recipes_summerroastlambwithc_74877", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shoulder lamb, boned and butterflied", "4 tsp olive oil", "2 sprigs rosemary, finely chopped ", "½ tsp rock salt", "1 small tin anchovy fillets, finely chopped ", "1 lemon, zest and juice only", "½ tsp demerara sugar", "500g/17oz new potatoes, quartered", "200g/7oz semolina ", "1 tbsp chilli powder", "½ tbsp garlic salt ", "½ tbsp cumin ", "½ tbsp dried oregano ", "freshly ground black pepper", "2 bags pre-packed baby spinach, washed and drained ", "1 bunch fresh mint, finely chopped", "300g/10½oz goats' cheese, crumbled into pieces ", "1 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven 170C/338F/Gas 3.", "Rub the lamb with the olive oil and place on a roasting tray.", "Sprinkle over the chopped rosemary, salt, chopped anchovy fillets, lemon juice and zest and sugar. Turn the lamb, massaging the ingredients into the meat.", "Place in the oven, skin side up, and roast for one-and-a-half hours.", "Meanwhile, for the crunched, spiced potatoes, blanch the new potatoes for five minutes in boiling salted water.", "Combine the semolina in a large bowl with all the remaining ingredients.", "When cooked, strain the potatoes and, while still hot, transfer them into the bowl with the semolina. Toss well and shake off any excess through a colander.", "Transfer the potatoes to a well-oiled tray for the last half an hour of the lamb's cooking time. If you have a large enough oven and a large enough roasting tray, you can arrange the potatoes around the lamb to cook.", "Meanwhile, mix together the spinach, mint and pieces of goats' cheese in a large bowl.", "Remove the lamb from the oven when it's cooked and allow to rest for a few minutes before carving into slices.", "Add the potatoes to the spinach and goats' cheese. Add the red wine vinegar and toss thoroughly.  ", "Transfer the potato and spinach mixture onto a large platter and place slices of lamb over the top. Spoon over the cooking juices from the lamb and serve."]}, {"isVegetarian": true, "title": "Summer salad", "url": "www_bbc_co_uk_food_recipes_summersalad_91685", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summersalad_91685_16x9.jpg", "ingredients": ["250g/9oz baby broad beans, pods removed", "300g/10½oz baby carrots, scrubbed, green bases left on", "1 bunch radishes, trimmed, cut in half", "100g/3½oz fresh peas, pods removed ", "Small handful fresh mint leaves, torn", "6 lemon balm leaves, torn (optional) ", "Small bunch fresh chives ", "Large handful fresh, young curly-leaved parsley leaves, chopped", "1 Little Gem lettuce, or similar crisp lettuce, core removed, leaves separated", "2 tbsp white wine vinegar", "2 tsp Dijon mustard", "1 heaped tsp caster sugar", "Pinch sea salt flakes ", "3½ tbsp sunflower oil", "3½ tbsp olive oil", "Salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a pan of salted, boiling water for 2-3 minutes, or until tender. Drain well, then refresh in cold water and peel away the outer membranes. ", "Cook the carrots in a pan of boiling water for 3-4 minutes, or until just tender. Drain well, then refresh in cold water.", "Place the cooked beans and carrots, the radishes, peas, mint leaves, lemon balm leaves (if using), chives, chopped parsley and lettuce leaves, into a bowl and mix well to combine. Set aside.", "For the vinaigrette, whisk together the white wine vinegar, mustard, sugar and salt in a bowl until smooth and well combined. Gradually whisk in the sunflower oil and olive oil until the mixture has thickened and is glossy. Season, to taste, with salt and freshly ground black pepper.", "To serve, drizzle the vinaigrette over the summer salad and mix well to coat the leaves. Divide equally among four serving plates."]}, {"isVegetarian": true, "title": "Summer turnips", "url": "www_bbc_co_uk_food_recipes_summerturnips_12916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 baby turnips", "2 sticks celery, sliced on an angle into 4 or 5 pieces ", "100g/4oz butter", "water"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the celery and turnips in 100g/4oz of butter and 50ml/2fl oz water until soft but not overdone."]}, {"isVegetarian": true, "title": "Summer vegetable salad", "url": "www_bbc_co_uk_food_recipes_summervegetablesalad_12153", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large aubergine", "olive oil, for coating", "sea salt, to taste", "1 large red capsicum, deseeded and cut into six pieces", "1 large green capsicum, deseeded and cut into six pieces", "1 tomato, cored and halved crosswise", "1 Spanish onion, cut into wedges", "2 cloves of garlic, crushed", "1 tsp dijon mustard", "1 tbsp capers, drained", "1 tbsp red wine vinegar", "1 tsp sherry vinegar", "sea salt", "50ml/2fl oz extra virgin olive oil", "½ bunch flatleaf parsley, leaves roughly torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Thinly slice the aubergine lengthwise and toss with olive oil and sea salt, then cook on a hot barbecue or chargrill until charred and tender.", "Toss the remaining vegetables in olive oil and sea salt and cook on a hot chargrill or barbecue until charred and tender.", "Place all the cooked vegetables in a large bowl.", "For the dressing, combine the garlic, mustard, capers and vinegars in a bowl, season with sea salt to taste and stir in the olive oil. Add the parsley leaves and mix well to combine.", "Pour the dressing over the vegetables and toss well to coat them."]}, {"isVegetarian": true, "title": "Summer vegetable casserole with smoked ricotta dumplings", "url": "www_bbc_co_uk_food_recipes_summervegetablecasse_89315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz smoked ricotta (available from delicatessens and specialist cheese shops)", "350g/12oz cooked mashed potato", "1 free-range egg", "450g/1lb plain flour", "salt and freshly ground black pepper", "2 tbsp butter, for frying", "2 tbsp olive oil", "1 onion, sliced", "1 garlic clove, finely chopped ", "1 carrot, finely chopped", "1 celery stick, finely chopped", "1 red pepper, finely chopped", "1 green pepper, finely chopped", "50ml/2fl oz white wine", "2 lemons, juice and zest only", "330g/12oz Puy lentils, washed", "400ml/14fl oz vegetable stock", "1 tbsp chopped fresh parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheese dumplings, place the smoked ricotta, mashed potato and egg into a bowl and mix well to combine.", "Add the flour and mix to form a dough. Season well with salt and freshly ground black pepper.", "Roll the cheese mixture into 3cm-4cm/2in-2½in balls.", "Place the cheese dumplings into a pan of boiling water and cook until they rise to the surface of the water. ", "Remove the cheese dumplings with a slotted spoon and drain on kitchen paper.", "For the casserole, heat the oil in a pan over a medium heat, then fry the onion, garlic, carrot, celery, red and green pepper until just soft.", "Add the wine and the lemon juice and zest and bring to the boil. Cook until the liquid has almost completely reduced.", "Add the lentils and stock and bring to the boil. Reduce the heat and simmer for 20-25 minutes, or until the lentils are cooked through but still a little al dente.", "Add the parsley and season, to taste, with salt and freshly ground black pepper. ", "To finish the cheese dumplings, melt the two tablespoons of butter in a frying pan over a medium heat. ", "Add the cheese dumplings and fry until crisp and golden-brown all over.", "To serve, place three cheese dumplings into each bowl and spoon equal amounts of the casserole around each set of dumplings."]}, {"isVegetarian": true, "title": "Summery green coleslaw", "url": "www_bbc_co_uk_food_recipes_summery_green_coleslaw_23859", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summery_green_coleslaw_23859_16x9.jpg", "ingredients": ["100g/3½oz  peas or broad beans", "1 small green cabbage, shredded", "1 large courgette, grated or cut into matchsticks", "1 large fennel bulb, finely sliced into matchsticks", "1 bunch spring onions, finely sliced", "2 celery sticks, finely chopped", "1 green apple, grated", "½ lime, juice only", "1–2 tbsp chopped fresh herbs including basil, mint", "2 tbsp plain yoghurt", "2 tbsp low-fat mayonnaise", "1 lemon, zest and juice", "1 tbsp fresh herbs", "pinch sugar "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the coleslaw, bring a pan of water to the boil, add the peas or beans, bring the water back to the boil and cook for 2 minutes, then refresh in cold water, drain and set aside. ", "Place the peas or beans, cabbage, courgette, fennel, spring onions, celery and apple into a large bowl and mix. Finish with the lime juice and fresh herbs.", "To make the dressing, mix all the ingredients together in a small bowl. Dress the coleslaw just before serving. "]}, {"isVegetarian": false, "title": "Sun-blushed tomato and feta salad", "url": "www_bbc_co_uk_food_recipes_sun-blushed_tomato_and_23591", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-blushed_tomato_and_23591_16x9.jpg", "ingredients": ["150g/5½oz sun-blushed tomatoes (see tip), quartered ", "75g/2¾oz pitted black olives in oil, drained and halved", "2 tbsp olive oil or oil drained from the sun-blushed tomatoes", "150g/5½oz good-quality feta cheese, crumbled into small chunks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the tomatoes, olives and oil in a bowl and stir together, then gently mix in the feta. "]}, {"isVegetarian": false, "title": "Sun and sea kebabs", "url": "www_bbc_co_uk_food_recipes_sun_and_sea_kebabs_62733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cherry tomatoes", "1 satsuma, peeled, segmented", "70g/2½oz white fish, cut into 6 pieces", "6 small fresh sage leaves", "2 tsp olive oil", "pinch paprika"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Soak two wooden skewers in water for 10 minutes.", "Thread a tomato onto one of the  wooden skewers and then add a piece of fish, followed by a sage leaf. Then add some satsuma segments. Repeat the process, then thread the remaining ingredients onto another wooden skewer.", "Put the kebabs on a baking tray and drizzle with the oil, then sprinkle over the paprika.", "Bake in the oven for 15-20 minutes, or until the kebabs are cooked through."]}, {"isVegetarian": false, "title": "Sun-dried tomato, emmental cheese and pesto puff pastry tarts", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_04502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice cold water", "60g/2¼oz fresh basil leaves", "50g/2oz pine nuts, toasted", "50g/2oz Parmesan, grated", "2 cloves garlic, peeled", "125-175ml/4-6fl oz extra virgin olive oil", "275g/10oz puff pastry (from above)", "2 tbsp wholegrain mustard", "200g/7oz emmental cheese, grated", "100g/4oz fresh tomatoes, sliced", "75g/2¾oz sun-dried tomatoes, diced", "2 tbsp olive oil", "1 egg yolk, beaten", "handful rocket leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound on a clean work surface and make a deep well in the centre using your fingers. Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand. Work in the flour until the mixture is loosely but well combined and still with lumps of butter visible.", "Gradually add the iced water and mix until you have a rough dough. (You may not need all of the water. Take care not to overwork the mixture.) Roll the dough into a ball, wrap in cling film and chill for 20 minutes in the fridge.", "When the dough has chilled, roll it out on a lightly-floured work surface into a 40x20cm/16x8in rectangle. Fold the rectangle into three and give it a quarter turn. Repeat the process, giving the folded pastry another quarter turn. Wrap the pastry in cling film and chill for a further 30 minutes. Once chilled, repeat the process of rolling, folding and turning two more times, making a total of four turns. Wrap the pastry in cling film and place in the fridge for at least 30 minutes.", "For the pesto, place the basil, pine nuts, Parmesan and garlic in a pestle and mortar and grind, while gradually adding the extra virgin olive oil until a paste is formed. ", "For the tarts, preheat the oven to 200C/180C Fan/Gas 6. ", "Roll the pastry out on a lightly-floured surface to a 2mm/1/8in thickness. Cut out six discs using a 12cm/5in pastry cutter. Score around the edge of the circle about 2cm from the edge. Line a baking tray with baking parchment and brush with a little cold water. Transfer each of the pastry discs onto the tray using a palette knife.", "Brush the inside ring of the tarts with the mustard, sprinkle over the cheese and top with the two types of tomatoes. Drizzle with olive oil and brush the pastry with egg yolk around the edges.", "Bake in the oven for 12-15 minutes, or until the pastry is golden-brown. ", "To serve, garnish the tarts with the pesto and some fresh rocket."]}, {"isVegetarian": true, "title": "Sun-dried tomato and poppy seed savoury biscuits", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_86934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_86934_16x9.jpg", "ingredients": ["375g/13oz plain flour, plus extra for dusting", "1 tsp salt", "125g/4½oz unsalted butter, softened", "2 medium free-range eggs", "2 tbsp poppy seeds", "40g/1½oz parmesan, grated (or a similar vegetarian hard cheese)", "1 tbsp sun-dried tomato paste ", "1 tbsp sesame seeds"], "serves": "Makes 36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour, salt, butter, one of the eggs and 40ml/1½fl oz water into a bowl and mix well for five minutes until you have a smooth dough. Divide the dough in half.", "On a lightly floured work surface, knead the poppy seeds in to one half of the dough and the parmesan and sun-dried tomato paste to the other.", "Using a rolling pin, roll out each piece of dough on a lightly floured work surface to about 3mm thick. Place each piece of dough on a baking tray, cover with cling film and refrigerate for 30 minutes.", "Preheat the oven to 200C/180C(fan)/Gas 6.  Dust two large baking trays with flour. ", "Using a 7cm/2¾cm round cutter cut out 18 rounds from each half of the dough, re-rolling as necessary. Place the rounds on the baking tray. ", "Brush the biscuits with beaten egg and sprinkle the parmesan and tomato ones with sesame seeds.", "Bake for 10-15 minutes until golden-brown. Remove from the oven and transfer to a wire rack to cool. Serve warm or cold. "]}, {"isVegetarian": true, "title": "Sun-dried tomato and rosemary palmiers", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_97049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_97049_16x9.jpg", "ingredients": ["500g/1lb 2oz ready-made puff pastry", "plain flour, for dusting", "1 x 280g/10oz jar sun-dried tomatoes, drained and finely chopped", "few sprigs fresh rosemary, leaves only, finely chopped", "1 free-range egg, lightly beaten"], "serves": "Makes 25-30 palmiers", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the puff pastry on a well-floured surface and bash it with a rolling pin. Usually you need to be quite delicate with puff pastry as it needs to puff up a lot, but for palmiers it only needs to puff up a little. Roll the pastry out into a rectangle about 30 x 35cm/12 x 14in and the thickness of a £1 coin. Spread the tomatoes over the puff pastry and sprinkle over the rosemary.", "With the shortest end facing you, take both long edges of the pastry and roll them towards each other to meet in the middle. Brush a little egg down the centre to stick the two halves together. Carefully lift into a large baking tray (making sure it will fit in your fridge first) and put in the fridge for at least 30 minutes to chill and harden.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the roll from the fridge and, using a very sharp knife, slice it into 1cm/½in thick pieces. Lay each piece on the baking tray, cut-side up, and brush well with the beaten egg, then bake in the oven for 10–15 minutes until puffed up, crisp and golden-brown.", "Remove the palmiers from the oven and leave to cool on the baking tray.", "To serve, pile them high on a plate. These are great little canapés for waiting guests."]}, {"isVegetarian": true, "title": "Sun-blushed tomato and shallot spaghetti", "url": "www_bbc_co_uk_food_recipes_sunblushedtomatoands_85986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ shallot, finely chopped", "1 garlic clove, finely chopped", "125g/4½oz sun-blushed tomatoes, chopped", "splash white wine", "handful each fresh chives, parsley, basil, chopped", "½ lemon, juice only", "250g/9oz fresh spaghetti, cooked", "1 lemon, cut into wedges, to garnish"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large frying pan, add the shallot and fry gently for two minutes. Add the garlic and cook for one minute. Add the tomatoes and wine and cook for four minutes, or until softened. Stir in the herbs, lemon juice and the cooked spaghetti. ", "Mix well to coat pasta and spoon into a serving bowl.", "To serve, garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Sun-blushed tomato, black olive and shaved Manchego salad", "url": "www_bbc_co_uk_food_recipes_sunblushedtomatoblac_86246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large handful flatleaf parsley, leaves only", "¼ red onion, finely sliced", "50g/2oz Manchego cheese, shaved with a vegetable peeler", "50g/2oz sun-blushed tomatoes", "30g/1oz black olives, stones removed", "2 tbsp olive oil", "2 tsp balsamic vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a large bowl and stir well to combine.", "To serve, place into a serving dish."]}, {"isVegetarian": true, "title": "Sun-blushed tomato, mozzarella and truffle salad with onion rings", "url": "www_bbc_co_uk_food_recipes_sunblushedtomatomozz_85983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ ball buffalo mozzarella, sliced", "8 sun-blushed tomatoes", "handful fresh basil, roughly torn", "1-2 tbsp olive oil", "½ truffle, thinly shaved (available from specialist greengrocers and some delicatessens)", "300ml/½ pint vegetable oil, for deep frying", "2 banana shallots, skin removed, cut into rings", "85g/3oz plain flour, seasoned with salt and freshly ground black pepper", "150g/5½oz self-raising flour", "75ml/2½fl oz sparkling water", "pinch salt"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place all the salad ingredients into a bowl and mix well. Place the salad onto a serving plate. ", "For the onion rings, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dredge the onion rings in the seasoned plain flour. ", "Place the self-raising flour into a large bowl, add the sparkling water and salt and whisk to make a thick batter. Add more sparkling water if necessary. ", "Dip the floured onion rings into the batter, then carefully place into the hot oil. Deep-fry for 3-4 minutes, or until golden and crisp. ", "Remove the onion rings with a slotted spoon, drain on kitchen paper and sprinkle with salt.", "To serve, top the salad with the onion rings."]}, {"isVegetarian": true, "title": "Sun-dried tomato and olive bread", "url": "www_bbc_co_uk_food_recipes_sundriedtomatoandoli_66043", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sundriedtomatoandoli_66043_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "15g/½oz salt", "55ml/2fl oz olive oil", "20g/¾oz fresh yeast", "275ml/9fl oz water", "170g/6oz black Greek olives, pitted and chopped   ", "55g/2oz sun-dried tomatoes"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all ingredients, apart from the olives and tomatoes, in a large bowl. Take care not to put the yeast in direct contact with the salt when they are first added to the bowl.", "Knead well with your hands and knuckles until the dough is elastic, smooth and shiny. Cover with a piece of cling film and leave to rise for one hour.", "Divide the dough into two and add half of the olives and sun-dried tomatoes into each.", "Mould both the doughs into rough round shapes and press firmly down. Sprinkle white flour lightly over the top and mark them with a cross.", "Place them on a baking sheet lined with baking paper (silicone paper) and prove for one hour in a warm place.", "Bake at 220C/425F/Gas 7 for 30 minutes until golden-brown. Remove from the oven and cool on a wire rack."]}, {"isVegetarian": true, "title": "Sunken chocolate amaretto cake with crumbled amaretti cream", "url": "www_bbc_co_uk_food_recipes_sunken_chocolate_42872", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sunken_chocolate_42872_16x9.jpg", "ingredients": ["100g/3½oz dark chocolate, 70% cocoa solids, roughly chopped", "100g/3½oz unsalted butter, softened and cut into cubes, plus extra for greasing", "4 large free-range eggs, at room temperature ", "125g/4½oz caster sugar ", "75g/2½oz ground almonds ", "2 tbsp cocoa powder, plus 1 tsp for dusting ", "3 tbsp amaretto liqueur ", "250ml/9fl oz double cream ", "1 tbsp amaretto liqueur ", "4 amaretti biscuits, crumbled "], "serves": "Makes 10–12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and lightly grease the sides and line the base of your springform cake tin with baking paper. ", "Melt the chocolate and butter in a heatproof bowl, either over a pan of boiling water, making sure the bowl doesn’t touch the water, or in a microwave. Pour into a jug and leave to cool a little. ", "Whisk the eggs and sugar until thick, moussy and doubled, if not tripled, in volume. This will take 2–3 minutes, using a freestanding mixer, or 4–5 minutes with an electric hand whisk. ", "Mix the almonds and cocoa together in a small bowl. Turn the mixer speed to low and gently whisk into the eggs and sugar, tablespoon by tablespoon. ", "Stir the amaretto liqueur into the slightly cooled, melted chocolate and butter, then pour this glossy mixture in a slow, steady stream into the cake batter, whisking all the time; it will look like a fabulous chocolate mousse. Give a final fold by hand to make sure everything is combined. ", "Pour and scrape the batter into the prepared tin. Bake for 20–25 minutes until the cake is beginning to come away at the edges, the top has formed a slightly cracked and bubbled thin crust the colour of pale milk chocolate – the cake will be dark and tender underneath – and a cake tester comes out with just a few damp crumbs cleaving to it. ", "Remove to a wire rack, drape a clean tea towel over the tin and leave to cool. As it cools, the top of the cake will crack a little more, and it will sink slightly, leaving a frilly edge. Once the cake is cold, unclip the tin, and gently lift the cake out – remove the base only if you are very brave – onto a cake stand or plate. Dust the teaspoon of cocoa through a tea strainer over the top, rather like the coating on a chocolate truffle. ", "Just before serving, whip the cream and amaretto together, until ripples start showing on the surface and it’s thickened but still soft enough to dollop alongside the cake. Very gently fold most of the crumbled amaretti biscuits into the cream, which will thicken it slightly more. Decant into a small serving bowl and sprinkle the rest of the amaretti crumbles on top. "]}, {"isVegetarian": true, "title": "Sunny carrot cake", "url": "www_bbc_co_uk_food_recipes_sunny_carrot_cake_34344", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil, plus some for greasing", "1 egg ", "60g/2oz self-raising flour ", "60g/2oz caster sugar ", "40g/1½oz carrot ", "30g/1oz tinned crushed pineapple (drained) ", "20g/1oz chopped walnuts (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 200C/400F/Gas 5.", "Brush some oil inside a small (500g) loaf tin. Line the bottom of the tin with some baking paper (parchment). ", "Break the egg into a mixing bowl.  Add the oil and whisk lightly with the fork until well combined.", "Put the flour and sugar into another bowl.  Stir with the fork. This is the ‘dry’ bowl.", "Grate the carrot and stir into the egg mixture. Next add the pineapple and walnuts.  This is the ‘wet’ bowl. ", "Pour the contents of the wet bowl into the dry bowl and mix well with the wooden spoon.", "You’ll need to ask a grown-up to help with this part. Pour the mixture into the loaf tin, place on a baking tray and ask a grown-up to put it in the oven for 25-30 minutes. ", "Leave the cake to cool before tipping out and serving in slices."]}, {"isVegetarian": true, "title": "Sunny vegetable patties", "url": "www_bbc_co_uk_food_recipes_sunnyvegetablepattie_91709", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sunnyvegetablepattie_91709_16x9.jpg", "ingredients": ["1 yellow pepper, seeds removed, cut into 1cm/½in pieces", "150g/5½oz carrots, trimmed, cut into 1cm/½in pieces ", "300g/10oz butternut squash, peeled, seeds removed, flesh cut into 1cm/½in pieces", "5cm/2in piece fresh root ginger, peeled, grated", "4 tbsp chopped fresh coriander leaves", "4 spring onions, trimmed, finely chopped", "200g/7oz canned sweetcorn kernels, drained and rinsed", "100g/3½oz Double Gloucester cheese, grated", "2-4 tsp salt", "225g/8oz plain flour, plus extra for dusting", "1½ tsp ground turmeric ", "pinch salt ", "115g/4oz cold butter, cut into small cubes ", "4-5 tbsp cold water ", "1 free-range egg, lightly beaten"], "serves": "Makes 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the filling, place the pieces of pepper, carrots and butternut squash into a deep-sided, lidded pan. Add enough boiling water to just cover the vegetables. Cover the pan with the lid and return to the boil. Boil for four minutes, or until the vegetables are tender, then drain well.", "Transfer the drained vegetables to a large bowl and add the remaining filling ingredients. Mix together until well combined, then set aside until completely cool.", "For the patties, in a bowl, mix together the flour, ground turmeric and salt in a bowl until well combined.", "Add the butter cubes and rub them into the flour using your fingertips until the mixture resembles breadcrumbs.  ", "Add the water, a tablespoon at a time, stirring the mixture with a spoon, until it comes together as a dough. (NB: You may not need to use all of the water.) Roll the dough into a ball, wrap in cling film and chill in the fridge for 30 minutes. ", "When the pastry has chilled, roll it out onto a lightly floured work surface to a 0.5cm/¼in thickness. Cut six to eight 7.5cm/3in discs from the pastry using a cookie cutter or upturned mug. ", "Divide the filling mixture equally among the pastry discs, covering only one half of each disc and leaving a 1cm/½in border at the edge of each. ", "Brush the edges of the pastry discs lightly with some of the beaten egg, then fold the free half of each disc over the filled half and press down the edges to seal using a fork. ", "Brush the tops of the patties with the remaining beaten egg. Line a baking tray with greaseproof paper and place the patties onto it. Bake the patties in the oven for 20-25 minutes, or until the pastry is golden-brown."]}, {"isVegetarian": true, "title": "Sunshine muffins", "url": "www_bbc_co_uk_food_recipes_sunshine_muffins_52272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "125ml/4fl oz natural yoghurt", "2 tbsp vegetable oil", "150g/5oz plain wholemeal flour", "2 tbsp porridge oats", "1 tbsp dark soft brown sugar", "1½ tsp mixed spice", "2 tsp baking powder", "200g/7oz mango, chopped into small pieces", "2 tbsp pumpkin seeds"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Line six holes of a muffin tray with paper muffin cases.", "Beat the egg in a jug, then beat in the yoghurt and vegetable oil.", "Stir the flour, oats, sugar, mixed spice and baking powder together in a bowl.  Add the mango and the egg mixture and mix together until just combined.", "Divide the mixture between the six muffin cases and sprinkle over the pumpkin seeds, pushing them in slightly.", "Bake in the oven for 20-25 minutes, or until risen and golden-brown and a cake tester inserted into the middle comes out clean."]}, {"isVegetarian": true, "title": "Super green dream drink", "url": "www_bbc_co_uk_food_recipes_super_green_dream_drink_87254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cucumber", "1 tsp grated root ginger", "400ml/14fl oz apple juice", "½ lime, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the cucumber into a bowl, making sure you catch all the juice.", "Stir in the ginger, apple juice and lime juice.", "Seive the mixture into a jug, pressing down on the pulp to extract as much juice as possible. ", "Pour into two tall glasses."]}, {"isVegetarian": false, "title": "Super satay chicken", "url": "www_bbc_co_uk_food_recipes_super_satay_chicken_06986", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/super_satay_chicken_06986_16x9.jpg", "ingredients": ["1 tbsp ground turmeric", "1 tbsp ground cumin", "1 large free-range chicken (about 1.8kg/4lb)", "250g/9oz unsalted peanuts, roasted ", "2 stalks lemongrass, finely chopped", "5cm/2in piece of galangal, grated", "3 garlic cloves, grated", "400ml/14fl oz coconut milk", "4 tbsp ketjap manis (sweet Indonesian soy sauce available from most Chinese supermarkets)", "2 tbsp dried chilli flakes", "1 lime, zest only", "2 red peppers, chopped", "4 red chillies, chopped", "3 garlic cloves, grated", "75g/2½oz caster sugar", "100ml/3½fl oz white wine vinegar", "1 tbsp cornflour, mixed with 2 tsp water", "2 limes, juice only", "large pinch of salt", "1 tsp chilli flakes ", "2 bunches spring onions, cut into 2cm/¾in pieces", "150g/5½oz unsalted peanuts, roasted and roughly chopped", "1-2 green chillies, thinly sliced", "½ cucumber, sliced", "1 bunch coriander, leaves picked and stalks finely chopped", "2 tbsp clear honey", "4 tbsp soy sauce", "3 tbsp sesame oil", "2 limes, juice only"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mix together the turmeric and cumin, add some cold water to make a paste and rub it all over the chicken.  Cover the chicken with cling film, place it in the fridge and leave overnight. ", "Pulse the peanuts in a food processor (they should be a mixture of fine and coarse pieces) and set aside. Place the lemongrass, galangal and garlic into the food processor and blend to a fine paste. Transfer to a bowl, add the coconut milk, ketjap manis, dried chilli flakes, lime zest and chopped peanuts. Cover and set aside overnight.", "The next day, preheat the oven to 120C/250F/Gas ½. ", "Place the chicken in a roasting tray and pour the marinade over. Roast very slowly for two hours, basting with the sauce half way through. After this time turn the oven up to 200C/400F/Gas 6 and continue to cook for a further 20 minutes. Be careful not to burn the chicken, if needs be, you can add a splash or two of water while cooking.  Remove from the oven, baste and leave to rest for 20 minutes.  ", "Meanwhile, to make the chilli dip, place the red peppers, chillies, garlic, sugar and white wine vinegar into a food processor and blend to a rough purée. Pour the mixture into a saucepan and bring to the boil. Cook for around three minutes then whisk in the cornflour mixture and cook until the sauce thickens. Finish with the lime juice, salt and chilli flakes. Set aside to cool.", "For the salad, place the spring onions, peanuts, green chillies and cucumber and coriander into a bowl. Mix the honey, soy sauce, sesame oil and lime juice together, pour over the salad and mix thoroughly. Serve with the chicken and chilli dip."]}, {"isVegetarian": true, "title": "Super spring salad", "url": "www_bbc_co_uk_food_recipes_super_spring_salad_91355", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/super_spring_salad_91355_16x9.jpg", "ingredients": ["12 Jersey Royal potatoes", "10 green asparagus spears, sliced on an angle", "150g/5½oz young broad beans, podded ", "150g/5½oz peas, podded", "150g/5½oz fresh or frozen soy beans", "3 spring onions, sliced on an angle", "drizzle of olive oil ", "4 purple asparagus spears, sliced using a peeler ", "1 lemon, juice only", "2 shallots, cut into rings", "15 mint leaves, 10 torn, 5 shredded", "small bunch of chervil ", "handful watercress", "punnet of pea shoots", "sea salt and freshly ground black pepper ", "1 tbsp Dijon mustard", "5 tbsp red wine vinegar", "1 tsp walnut oil", "300ml/10½oz extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pot of water to the boil and blanch the potatoes, drain and carefully slice in half. ", "Bring a large pot of salted water to the boil. Drop in the green asparagus, broad beans, peas, soy beans and spring onions and cook for a couple of minutes. Drain and run under cold water to stop them cooking but not to cool them.", "Spread on a tray with the potatoes. Sprinkle with a little olive oil and season with salt and pepper.  ", "Put the purple asparagus in a bowl and sprinkle with lemon juice and salt to cure and soften. ", "For the dressing, whisk together the mustard and vinegar in a bowl, slowly adding the oils. It should have a thick consistency, like a sauce. Season with a good amount of salt and black pepper.  ", "Mix all of the vegetables with the shallots, mint, chervil, watercress and pea shoots and pour over the dressing. ", "Divide between four plates and dig in. "]}, {"isVegetarian": false, "title": "Superfood salad with a piri-piri dressing", "url": "www_bbc_co_uk_food_recipes_superfood_salad_with_a_40560", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz quinoa, rinsed", "300–350 ml/18fl oz chicken stock", "2 x 250–300g/7–10½oz pork shoulder steaks, ideally Secreto Ibérico", "olive oil, for brushing", "50g/1¾oz kale, shredded ", "100g/3½oz tinned chickpeas, drained ", "75g/2½oz blanched hazelnuts ", "75g/2½oz blanched almonds ", "3 tbsp olive oil", "3 garlic cloves, finely chopped", "2 tbsp fresh oregano, leaves removed and finely chopped", "¼ tsp English mustard powder", "pinch ground coriander ", "200g piri-piri sauce", "1 tbsp sherry or red wine vinegar ", "40g/1½oz sunflower seeds", "20g/¾oz sesame seeds", "40g/1½oz pumpkin seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the quinoa and stock in a large saucepan and cook according to the packet instructions. Drain and leave to cool.", "Heat a griddle pan over a medium heat. Brush the pork steaks with the oil and griddle in the hot pan for 8–10 minutes on each side, depending on thickness, or until cooked through. Leave to cool before slicing.", "Add the kale, chickpeas and nuts to the cooked quinoa and mix well.", "To make the dressing, heat the oil in a medium saucepan and cook the garlic for 1–2 minutes. Add the oregano, mustard powder, coriander, piri-piri sauce and sherry and cook for a further minute.", "To serve, toast the seeds in a hot, dry frying pan for 2–3 minutes, stirring continuously. ", "Put the quinoa on a serving plate and top with the sliced pork. Drizzle with the dressing and sprinkle with the seeds."]}, {"isVegetarian": true, "title": "Super-posh chewy cookies", "url": "www_bbc_co_uk_food_recipes_superposhchewycookie_89623", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/superposhchewycookie_89623_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened, plus extra for greasing", "100g/3½oz caster sugar", "2 tbsp sunflower oil", "100g/3½oz soft dark brown sugar", "1 free-range egg, beaten", "½ tsp vanilla essence", "200g/7oz plain flour, plus extra for dusting", "½ tsp salt", "½ tsp baking powder", "100g/3½oz dried sour cherries, soaked in water", "2 tbsp cherry brandy", "40g/1½oz flaked almonds", "75g/2½oz roasted hazelnuts, chopped", "100g/3½oz white chocolate, broken into small pieces", "100g/3½oz dark chocolate, broken into small pieces"], "serves": "Makes 6-12 cookies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Place the butter and the caster sugar into a bowl and beat together until light and creamy. Add the sunflower oil and brown sugar and fold through to combine. Add the egg and vanilla essence and mix well.", "In a separate bowl, mix together the flour, salt and baking powder.", "Add the flour to the butter and sugar mixture and mix well to form a dough. Fold in the drained cherries, brandy, almonds, hazelnuts and the white and dark chocolate pieces. .", "On a floured work surface, carefully roll out the dough to 1cm/½in thick. Using the cookie cutter of your choice, cut out 8–16 cookies (depending on the size of the cutter).", "Place the cookies onto a greased baking tray (not too close together as they will spread). Place into the oven to bake for 15 minutes, or until golden-brown and cooked through.", "Remove from the oven and leave to cool on the trays for 8–10 minutes, then transfer to a wire cooling rack to cool completely."]}, {"isVegetarian": true, "title": "Super-rich chocolate ice cream", "url": "www_bbc_co_uk_food_recipes_superrichchocolateic_14295", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/superrichchocolateic_14295_16x9.jpg", "ingredients": ["250g/9oz strong plain chocolate ", "100g/3½oz unsalted butter ", "150g/5oz caster sugar ", "150ml/5fl oz water ", "4 large eggs, yolks only", "500ml/17fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Break up the chocolate and place with the unsalted butter in a warm-ish oven for about 15 minutes. Remove and stir until melted and blended together. ", "Over a low heat dissolve the sugar in the water then turn up the heat and boil rapidly for a few minutes to get a light syrup. It's ready before the syrup takes any colour, when a little dropped on to a cold plate forms a thread when stretched between finger and thumb. Leave the mixture to cool for just a minute. ", "Place the egg yolks in a basin and begin whisking (ideally with an electric whisk), trickling in the hot syrup as you go. Continue whisking until the mixture is thick and mousse-like. Whisk in the cream. Then fold in the melted chocolate and butter until thoroughly blended. Then pour the mixture into an ice cream machine and churn until frozen."]}, {"isVegetarian": false, "title": "Surf and turf with wilted spinach, watercress and a mustard sauce", "url": "www_bbc_co_uk_food_recipes_surf_and_turf_with_46844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 500g/1lbs 2oz cooked lobsters", "4 x 175g/6oz fillet steaks", "75g/3oz butter", "2 tbsp olive oil", "1 lemon, juice only", "250g/9oz spinach", "250g/9oz watercress, leaves picked", "50g/2oz butter", "2 shallots, finely diced", "150ml/5fl oz white wine", "300ml/10fl oz double cream", "2 tbsp grain mustard", "2 tomatoes, skinned, deseeded, chopped", "2 tbsp chives, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Crack the lobster claws, extracting the meat in one whole piece if possible. Cut the tail in half lengthways, lift the meat out, and reserve both the meat and shell.", "Season the steak with salt and freshly ground black pepper. Heat a frying pan until hot, add a little of the butter and the oil and fry the steak on each side for 2-3 minutes (for medium), basting with the butter as it cooks.", "Remove the pan from the heat and set aside to rest for 2-3 minutes, turn the meat over and rest for a further 2-3 minutes.", "Meanwhile heat some of the butter in a second pan and warm the lobster meat through, basting with the pan juices. Season with salt, freshly ground black pepper and lemon juice.", "Heat a frying pan until hot, add the remaining butter and oil and fry the spinach and watercress until just wilted.", "For the sauce, melt the butter in a saucepan and fry the shallot for 2-3 minutes, or until just softened. Add the wine and cook until the volume of the liquid has reduced by half. Add the cream and reduce by half again.", "Stir in the grain mustard, tomatoes and chives and warm through. Season to taste with salt and freshly ground black pepper.", "To serve, arrange the lobster shells on a plate and place the lobster meat inside the shells. Place the fillet steak alongside and the lobster claw on top. Finally, add some spinach and watercress and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Suriani home-style chicken curry (‘ishtu’)", "url": "www_bbc_co_uk_food_recipes_suriani_home-style_57083", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/suriani_home-style_57083_16x9.jpg", "ingredients": ["3 tbsp coconut oil or sunflower oil", "5cm/2in cinnamon stick", "6 cloves", "4 green cardamom pods", "4 garlic cloves, thinly sliced", "5cm/2in piece fresh root ginger, peeled and cut into small matchsticks", "2 red onions, thinly sliced ", "8 green chillies, slit lengthways", "15 curry leaves", "1kg–1.3kg/2lb 4oz–2lb 14oz chicken, jointed into 8 pieces, or 8 chicken pieces, skin removed", "2 tsp salt", "1 tbsp black peppercorns, coarsely crushed ", "590ml/19fl oz coconut milk", "5 tbsp toddy (palm) vinegar (or sherry vinegar or sweet white wine vinegar), to serve", "1 tsp ground garam masala, to serve", "240g/8½oz basmati rice, rinsed under running water", "4 tbsp vegetable oil", "2 star anise", "4 green cardamom pods", "2 bay leaves", "1 onion, thinly sliced ", "10 curry leaves ", "1½ tsp salt", "1½ tsp caster sugar", "4 tbsp white wine vinegar", "160ml/5½fl oz coconut milk"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken stew, heat the oil in a large, lidded frying pan or sauté pan. Add the cinnamon, cloves and cardamom, followed by the garlic, ginger, onions, chillies and curry leaves. Cook over medium heat until the onions are soft. ", "Add the chicken, salt and pepper and stir for a minute. Pour in the coconut milk and 125ml/4fl oz water. Reduce the heat to low and simmer, covered, for 45 minutes, or until the chicken is cooked through. ", "Meanwhile, soak the rice in cold water for 20 minutes, then drain well. Heat the oil in a large, lidded saucepan. Add the star anise, cardamom and bay and cook, stirring, for 30 seconds. Add the onion, curry leaves, salt and sugar and cook until the onion is soft and translucent. Add the vinegar, coconut milk, 300ml/10fl oz water and then the rice. Mix well, then simmer, stirring, for 5 minutes. Reduce the heat to medium, cover with a tight-fitting lid and cook for 7–8 minutes. All the liquid should be absorbed. ", "Take off the heat and stir. Cover with the lid again and set aside for 10 minutes to let the rice finish cooking in its steam.", "To serve, add the vinegar to the stew, sprinkle over the garam masala and mix well. Remove from the heat and serve with the sweet and sour rice."]}, {"isVegetarian": false, "title": "Sushi", "url": "www_bbc_co_uk_food_recipes_sushi_39966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz rice wine vinegar", "4 tbsp sugar", "4 tsp salt", "3cm/1¼in piece of kombu seaweed (optional)", "750g/1lb 9oz sushi rice ", "selection of fish, such as tuna, salmon, white fish such as brill or sea bass", "raw king prawns, shell on", "2 tbsp sake", "wasabi paste, to taste", "nori seaweed", "cucumber", "avocado", "pickled ginger", "wasabi ", "soy sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["First make your sushi vinegar - you can buy this ready-made, but it is easy to make your own. Warm the vinegar in a pan, then add the sugar and salt and let it dissolve. Leave to cool and you have the wonderful sweet savoury dressing for the rice. Set aside.", "Wash the rice three times, then drain and leave to stand for 15 minutes.  Bring one litre/1¾ pints of cold water to the boil and add the kombu (if using) and the rice. Simmer with the lid on for ten minutes, then leave to stand without taking the lid off for another 20 minutes.", "Tip into a large wooden bowl, sprinkle on the sushi vinegar and cut through into the rice with a slicing motion with a wooden spatula.", "Fan to cool, with a wooden paddle (or an old tablemat), for ten minutes. Turn the rice over, fan for two minutes. Repeat this four times and the rice should be at room temperature and just sticky enough. ", "Use the rice immediately as it is past its best after a few hours.", "For the nigiri sushi, cut your chosen fish carefully into strips. Always try to get sushi-grade fish, and always use top-notch fresh fish - some sushi fish has been deliberately frozen to kill any bacteria.", "Take the prawns, peel them leaving the tails intact and butterfly them carefully taking the dark strip out from underneath. Impale them on a skewer lengthways to take out the bend. ", "Place 500ml/18fl oz water in a pan with the sake and bring to the boil. Simmer the prawns until pink - this should take about two minutes. Leave to cool and remove the skewer. You will have straight prawns which will be easy to place on the rice. ", "Take a ball of rice about the size of a walnut, roll it in your hands to polish the outside, but don’t compress the rice too much.", "Place a dot of wasabi on the top. Place a prawn or a fish strip onto this. Press into place with a tapping motion between your thumb and middle finger. Repeat to use up as much of the fish as you wish to turn into nigiri.", "For the maki rolls, take a bamboo-rolling mat, cover it liberally with cling film. Take a half sheet of nori seaweed. (The ones made with half a sheet are smaller and have more filling to the rice ratio, and are a better eat.)", "Cover with rice all over except for the edge facing you, where you need to leave an empty border of about 2cm/¾in. - this will give you a join. Press the rice down firmly but gently to give you a thin but even coating. Down the middle, line up your strips of filling – choose from salmon, cucumber, avocado and wasabi.  Roll the mat away from you, catching the filling into the roll. Firm up with the mat.", "Unroll and using a knife with a damp blade cut into bite-sized pieces. ", "Serve the nigiri and maki rolls with pickled ginger, wasabi and soy sauce."]}, {"isVegetarian": false, "title": "Sushi salmon rolls", "url": "www_bbc_co_uk_food_recipes_sushisalmonrolls_85941", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet nori squares (the kind used to wrap sushi); available from some supermarkets and Asian markets", "400g/14oz short-grain sushi rice, cooked according to packet instructions, cooled", "wasabi paste", "450g/1lb top quality, very fresh salmon fillet", "1 cucumber, thinly sliced into strips", "1 bunch spring onions, finely chopped", "soy sauce"], "serves": "4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Place each square of nori flat onto a sushi rolling mat. (Sushi rolling mats are available from Asian supermarkets and larger supermarkets.)", "Place a layer of cooled sushi rice onto the seaweed wrap and gently press flat. (NB: don't add too much rice or you will end up with very fat sushi rolls.)", "Place a dab of wasabi paste along the rice, according to taste. Wasabi is quite strong, so be sparing!", "Place a thin slice of salmon onto the rice.", "Spread the strips of cucumber onto the salmon and add a sprinkling of spring onion.", "Carefully roll the sushi up into a sausage shape and slice it into 3cm/1in long pieces, trimming the ends.", "Serve with bowls of soy sauce and extra wasabi."]}, {"isVegetarian": false, "title": "Sussex pond pudding with cream and ice cream", "url": "www_bbc_co_uk_food_recipes_sussex_pond_pudding_with_32660", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["335g/11oz self-raising flour", "130g/5oz shredded suet", "100ml/3½fl oz milk", "200g/7oz slightly salted butter, cubed, plus extra for greasing", "200g/7oz soft light brown sugar", "3 large unwaxed lemons", "200ml/7fl oz double cream, to serve", "ice cream, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the Sussex pond pudding, grease a 1.5 litre/2¾ pint heatproof basin or bowl.", "Mix the flour and suet together in a bowl. In a jug combine the milk with 100ml/3½fl oz water. Mix in enough of the milk and water to the flour and suet mixture to make a dough that is soft, but firm enough to roll.", "On a lightly floured work surface roll the dough into a large circle. Cut out a quarter of the circle and set aside (this will be used later to form the lid of the pudding).", "Place the circle of pastry into the bowl and join the cut sides together, pressing well.", "Place half of the butter cubes and half of the sugar in the bottom of the lined bowl.", "Prick the lemons all over with a larding needle or skewer, so the juices can escape, and then place the lemons on top of the butter and sugar. Cover with the remaining butter and sugar to fill the bowl.", "Roll out the reserved pastry into a round and place on top of the basin filling. Press the edges together to seal the pudding.", "Fold a pleat down the centre of a large piece of aluminium foil and cover the basin with the pleat positioned in the middle. Tie the foil in place with cooks’ string and create a handle by wrapping the string under and over the bowl (so the pudding can be easily moved when hot).", "Bring a large pan of water to the boil and lower the pudding into it. The water should come halfway up the sides of the bowl.", "Cover the pan with a lid and leave to simmer for 3-4 hours. Top up the pan with more water if it starts to dry out.", "To serve, carefully remove the pudding from the pan and remove the foil lid. Put a deep dish over the basin and turn the pudding out onto the dish. Serve immediately with the cream and ice cream."]}, {"isVegetarian": true, "title": "Swede mash", "url": "www_bbc_co_uk_food_recipes_swedemash_78187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 swede, peeled and diced", "1 tsp salt", "50g/2oz butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the swede in a pan of cold water and sprinkle in 1 tsp of salt.", "Bring to the boil and reduce the heat to a slow simmer.", "Cook for 10 to 15 minutes or until tender. Drain the swede and return to the pan.", "Mash with a potato masher, stir in the butter, salt and freshly ground black pepper, to taste, and serve."]}, {"isVegetarian": false, "title": "Swahili chicken and papaya salad", "url": "www_bbc_co_uk_food_recipes_swahilichickenandpap_71266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, each cut into three long strips", "1 tsp crushed black peppercorns", "pinch of cayenne pepper", "1 tsp ground cinnamon", "1 tsp ground ginger", "1 tsp chilli", "1 tsp turmeric", "1 tsp coriander seeds", "1 tsp ground cumin", "1 lime, juice only", "2 tbsp olive oil", "1 lemon grass stalk ", "2.5cm/1in fresh ginger, chopped", "2 large garlic cloves, crushed", "2 shallots, finely chopped", "2 red chillies, chopped", "1 tsp garam masala", "1 tsp ground turmeric", "400ml/14fl oz coconut milk", "1 tin of chopped tomatoes ", "1 tbsp of coriander leaves", "1 papaya, peeled and sliced lengthways", "1 red onion, peeled and sliced", "1 lime, juice only ", "olive oil", "dash of sweet chilli sauce.", "rice to serve"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the chicken breasts into long strips, squeeze on some lime juice and leave to marinate for a few minutes. ", "Then grind together the dry ingredients and rub into the chicken strips. ", "Griddle on both sides for five minutes until scorched and golden. ", "To make the Swahili sauce, place the lemon grass, ginger, garlic, shallots, chillies, garam masala and turmeric in a heavy-based saucepan and fry until the shallots soften. Next, add the coconut milk and plum tomatoes, season and leave to simmer for five minutes.", "Next toss together the raw papaya and red onion slices and whisk together the lime juice, olive oil and sweet chilli sauce to make a dressing. ", "Serve the griddled chicken in a mound, with the Swahili sauce drizzled over the top, and your papaya and red onion salad on the side. Garnish with coriander leaves."]}, {"isVegetarian": false, "title": "Sussex pond pudding", "url": "www_bbc_co_uk_food_recipes_sussexpondpudding_85713", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour", "110g/4oz shredded suet", "75ml/3fl oz milk", "75ml/3fl oz water", "200g/7oz slightly salted butter, cut into cubes, plus extra to grease", "200g/7oz soft light brown sugar", "2 large lemons"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the flour and suet together in a bowl.", "Combine the milk and water together in a jug or separate bowl.", "Mix in enough of the milk and water to the flour and suet mixture to make a dough that is soft, but not too soft to roll.", "Roll the dough out on a floured surface, to make a large circle. Cut out a quarter of the circle (to be used later as the lid of the pudding).", "Grease a 1.5 litre/2¾ pint heatproof basin or bowl. Place the larger circle of pastry into the bowl and join the cut sides together, pressing well.", "Place half of the butter cubes and half of the sugar into the bottom of the lined bowl.", "Prick the lemons all over with a larding needle or skewer, so the juices can escape, then place the lemons on top of the butter and sugar.", "Place the remaining butter and sugar over the lemons to fill the bowl.", "Roll out the reserved pastry quarter into a round and place on top of the basin filling. Press the edges together to seal the pudding.", "Place a piece of foil over the basin, creating a pleat in the middle. Tie the foil in place with string and tie around carefully to create a string handle over the top, so the pudding can be easily moved when hot.", "Bring a large pan of water to the boil and lower the pudding into it. The water should come halfway up the sides of the bowl.", "Cover the pan with a lid and leave to simmer for 3-4 hours. If the water level falls too low, replenish it with more boiling water.", "To serve, carefully remove the basin from the pan and remove the foil lid. Put a deep dish over the basin and turn the pudding out onto the dish. Place on the table and serve immediately."]}, {"isVegetarian": true, "title": "Swede soup with Stilton croûtons", "url": "www_bbc_co_uk_food_recipes_swedesoupwithstilton_78887", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz swede, peeled and chopped", "570ml/1pt chicken stock (vegetarians may substitute with vegetable stock)", "55g/2oz Stilton", "salt and freshly ground black pepper", "2 slices ciabatta, griddled", "55g/2oz Stilton", "1tbsp olive oil, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Bring a pan of water to the boil and cook the swede for 10-15 minutes, or until very tender.", "Drain the swede and return to the heat. Add the hot chicken stock to the pan and bring to the boil. Reduce the heat to a simmer.", "Add the Stilton and season, to taste, with salt and black pepper.", "Use a hand blender to blend the mixture until smooth and place into a bowl.", "For the croutons, crumble the Stilton onto the toasted ciabatta and place on top of the soup. Place under the grill for three minutes or until the Stilton has melted.", "Remove from the grill and drizzle with olive oil, to serve."]}, {"isVegetarian": false, "title": "Sussex pond pudding with apples", "url": "www_bbc_co_uk_food_recipes_sussex_pond_pudding_with_23049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sussex_pond_pudding_with_23049_16x9.jpg", "ingredients": ["225g/8oz self-raising flour, plus extra for dusting", "100g/3½oz shredded suet", "75ml/2½fl oz milk", "3 Cox’s apples", "150g/5½oz butter, cut into cubes, plus extra for greasing ", "175g/6oz light muscovado sugar ", "1 large lemon", "cream or custard"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the suet crust, put the flour and suet into a bowl. Measure the milk in a jug and then add 75ml/2½fl oz cold water to make 150ml/5½oz of total liquid. Add this to the suet and mix to make a soft dough.", "Lightly dust the work surface with flour and then roll out the dough to a 30cm/12in circle. Cut one-quarter out of the circle and set aside for the lid. Thickly butter the pudding basin and then line with the pastry, pressing the join together. ", "For the filling, peel and core the apples, then cut them into cubes and mix together in a mixing bowl with the butter and sugar.  Place a little of this mixture in the pudding basin on top of the suet pastry. Prick the lemon all over with a cocktail stick and then place it in with the apples so that it sits upright. Pack the remaining apples and butter mixture around the lemon.", "Roll out the reserved suet pastry to a circle to fit on top of the pudding, trim any excess pastry and pinch the edges to seal.", "Cut a square of foil and make a pleat in the centre. Tie the foil around the basin with string, then loop the string over the basin and back under the string a couple of times to make a handle. Tie securely. ", "If you don’t have any string, fold a long strip of tin foil horizontally in half – and then half again. Place the foil around the bottom of the basin, and wrap the sides up and around to act as support as the basin is lowered into the pan.", "Place the lid of a jam jar in the large saucepan to stop the basin touching the bottom of the pan.", "Add the pudding basin to the pan and then pour boiling water around it so that it comes three-quarters of the way up the side of the basin. Cover with a tight-fitting lid, and simmer for 3½ hours. Check occasionally and top up with more boiling water as necessary. ", "To serve, remove the foil and invert the basin onto a large serving plate. Remove the basin and serve in slices with cream or custard. "]}, {"isVegetarian": false, "title": "Swedish meatballs with dill mash", "url": "www_bbc_co_uk_food_recipes_swedish_meatballs_with_13822", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Maris Piper potatoes, peeled and cut into chunks", "1 free-range egg, beaten", "2 tbsp butter", "1 small red onion, finely chopped", "250g/9oz beef mince", "250g/9oz pork mince", "½ tsp ground allspice", "small bunch flatleaf parsley, finely chopped", "2 tbsp single cream", "salt and freshly ground black pepper", "3 tbsp unsalted butter", "1 small red onion, finely chopped", "1 carrot, peeled and finely chopped", "400ml/14fl oz beef stock", "1 tbsp plain flour", "pinch ground allspice", "150ml/5fl oz single cream", "1 tbsp soy sauce", "2 tsp redcurrant jelly", "700g/1lb 9oz Maris Piper potatoes, peeled and cut into chunks", "25g/1oz butter", "50ml/2fl oz whole milk", "2 tbsp freshly chopped dill, plus a few sprigs to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "To make the meatballs, bring a large saucepan of salted water to the boil and cook the potatoes until tender. Drain and mash with a potato masher. Tip into a large bowl and mix in the egg.", "Melt 1 tablespoon of the butter in a heavy-bottomed saucepan over a medium heat. Fry the onion for 5 minutes, or until soft, and add to the potato mixture.", "Set aside 1 tablespoon of the beef mince for the sauce. Add the remaining beef mince and all the pork mince to the potato mixture, along with the allspice, half the parsley, the cream, a teaspoon of salt and a good pinch of pepper. Mix well. Roll the meatballs into 3cm/1¼in balls, cover with cling film and put in the fridge.", "To make the sauce, melt 2 tablespoons of the butter in a saucepan over a medium heat. Add the onion and carrot and cook for 5 minutes. Add the reserved beef mince and the beef stock and simmer for 15 minutes, then strain into a jug.", "Using the same saucepan, melt the remaining butter with the flour and allspice. Slowly pour the sauce back into the pan, whisking all the time, and allow to thicken. Stir in the cream, soy sauce and redcurrant jelly. Bring to a simmer and season to taste. Set aside.", "Grease a large baking sheet with the remaining butter and put in the oven for 3 minutes. When hot, place all the meatballs on the sheet and return to the oven. Roast for 10 minutes, turning halfway, until the meatballs are browned and cooked through. Transfer to an ovenproof serving dish. Turn off the oven and return the meatballs to the oven to keep warm.", "To make the mashed potato, bring a large saucepan of salted water to the boil and cook the potatoes for 15 minutes, or until tender. Drain and pass through a potato ricer back into the pan. Add the butter and milk and mash well using a potato masher. Season to taste and stir in the dill.", "Reheat the sauce and pour over the meatballs. Sprinkle with the remaining parsley and dill and serve with the mash."]}, {"isVegetarian": false, "title": "Swedish pickled herring", "url": "www_bbc_co_uk_food_recipes_swedish_pickled_herring_57381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz white wine vinegar", "200g/7oz caster sugar ", "2 bay leaves ", "1 carrot, peeled and roughly chopped", "1 onion, thinly sliced", "2 tsp whole black peppercorns", "1 tsp yellow mustard seeds", "10 salted herring fillets (about 1.3kg/3lb) rinsed, soaked in water overnight, drained", "red onion, finely chopped, to garnish ", "handful chives, finely chopped chives, to garnish ", "110g/4oz unsalted butter", "handful capers", "1 tbsp finely chopped dill", "½ lemon, juice only", "salt and freshly ground black pepper", "8 slice rye bread, buttered"], "serves": "Serves 6–8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the vinegar, sugar, bay, carrot, onion, peppercorns and mustard seeds in a saucepan and bring to the boil over a medium–high heat. Reduce the heat and simmer for 5 minutes, or until the sugar has dissolved. Remove from the heat and leave to cool to room temperature. ", "Put the herring fillets in a non-reactive bowl. Pour over the cooled pickling liquid and stir. Cover and marinate in the fridge for 2 days.", "To make the caper butter sauce, melt the butter in a frying pan. When it is turning brown, add the capers and cook for 2 minutes. Add the dill and lemon juice. Season with salt and pepper.", "To serve, remove fillets from the pickling liquid and pat dry using kitchen paper. Cut them into 7.5cm/3in pieces and transfer to the buttered rye bread slices. Pour over the caper butter sauce and garnish with the red onion and chives."]}]