[{"ingredients": ["350g / 12oz% 20dark% 20chocolate% 20 (55-60 %% 20cocoa% 20solids)", "250g / 9oz de mantequilla sin sal", "3 huevos de gallinas camperas", "250g / 9oz de azúcar mascabado oscuro", "Harina de castaña 75g / 3oz, tamizada", "25 g / 1 oz de cacao en polvo", "1 cucharadita de polvo de hornear", "pizca de sal", "Fudge de 110g / 4oz, más o menos picado", "4 plátanos, pelados, cortados en trozos y congelados en una bolsa de congelador o en una bandeja", "¼ cucharadita de esencia de vainilla", "3-4 cucharadas de azúcar en polvo", "200ml / 5floz de suero de leche", "110g / 4 oz de azúcar morena oscura", "110g / 4oz de mantequilla", "Crema doble 175ml / 6floz"], "method": ["Para el brownie, precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase una lata de torta cuadrada de 23 cm / 9 in.", "Derretir el chocolate y la mantequilla en una cacerola a fuego lento. Retire la sartén del fuego y deje a un lado para que se enfríe un poco.", "Batir los huevos hasta que estén gruesos, luego gradualmente batir en el azúcar hasta que estén brillantes.", "Batir la mezcla derretida de chocolate, luego doblar suavemente la harina de castaña, el cacao, el polvo de hornear y la sal.", "Dobla las piezas de dulce de azúcar y luego vierte la mezcla en la lata de la torta.", "Hornee en el horno precalentado durante 30-40 minutos o hasta que la superficie esté lista: se cocinará cuando salga una brocheta en el centro con solo una pequeña mezcla adherida.", "Retire el brownie del horno, déjelo a un lado sobre una rejilla de alambre durante aproximadamente 20 minutos. Corta el brownie en aproximadamente 16 cuadrados.", "Mientras tanto, para el helado de plátano, retire los plátanos congelados del congelador y déjelos descongelar ligeramente durante unos minutos. Mezcle los plátanos congelados, la vainilla, el azúcar y la mitad del suero de leche en un procesador de alimentos hasta que quede suave. Mientras el motor está funcionando, agregue lentamente el suero restante y continúe mezclándolo hasta que quede suave y cremoso.", "Para la salsa de caramelo, coloque el azúcar y la mantequilla en una olla pequeña y cocine hasta que se derrita y se combinen bien. Vierta la crema doble y cocine a fuego lento durante 3-5 minutos o hasta que la mezcla se espese un poco.", "Para servir, coloque un brownie en platos para servir, cubra con una cucharada de helado de plátano y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_chocolate_fudge_brownie_29323", "title": "Helado de brownie de dulce de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de almendras en copos", "200 g / 7 oz de azúcar en polvo", "20 g / ½ oz de cacao en polvo", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "100 g / 3½ oz de mantequilla sin sal, más mantequilla extra derretida para engrasar", "2 huevos grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 100 g / 3½ oz", "crema doble, para servir"], "method": ["Para que la almendra se vuelva quebradiza, precaliente el horno a 200C / 180C Fan / Gas 200. Extienda uniformemente las almendras copos en una bandeja para hornear forrada con papel de hornear y tueste en el horno durante 5 minutos, hasta que estén doradas. Revíselos regularmente y revuelva si es necesario. Dejar de lado.", "Caliente el azúcar en una sartén a fuego lento sin remover hasta que se haya derretido. Cuando el caramelo se haya dorado, vierte cuidadosamente sobre las almendras para cubrirlas y deja que se enfríen. (PRECAUCIÓN: el caramelo está muy, muy caliente, manipúlelo con cuidado). Una vez que esté frío, divida el caramelo en fragmentos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer los fondant de chocolate, cepille los moldes dariole con mantequilla derretida hacia arriba. Polvo de cada molde con cacao en polvo, para cubrir.", "Derrita el chocolate y la mantequilla juntos en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Revuelva hasta que la mezcla se derrita y se combine a fondo. Retire el recipiente del fuego y déjelo enfriar durante aproximadamente 10 minutos.", "En un tazón grande separado, bata los huevos y el azúcar con un batidor de mano eléctrico hasta que esté pálido y espeso. Vierta el chocolate derretido en la mezcla de huevo y doble para combinar. Tamizar la harina y doblarla.", "Divida la mezcla por igual entre los moldes. Coloque los fondants en una bandeja para hornear y cueza al horno por 8 minutos, o hasta que las partes superiores hayan formado una costra y estén empezando a salir de los lados de sus moldes. Deja reposar durante 2 minutos antes de apagarlo.", "Decore cada fondant con unos fragmentos de almendra quebradiza y sirva con crema doble espesa."], "url": "www_bbc_co_uk_food_recipes_chocolate_fondants_with_27862", "title": "Fondant de chocolate con almendras quebradizas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fondants_with_27862_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate de buena calidad, picado", "200 g / 7 oz de mantequilla, en cubos, más extra para engrasar", "100 ml / 3½ fl oz de agua", "125g / 4½ oz de harina de auto crianza", "125g / 4½oz de harina natural", "25 g / 1 oz de cacao en polvo", "200g / 7oz de azúcar mascabado ligero", "200 g / 7 oz de azúcar en polvo de oro", "3 huevos de gallinas camperas", "75 ml / 2½ fl oz crema fresca", "50g / 1% C2% BEoz% 20buena calidad% 20plain% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "100g / 3½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glasé", "1 cucharadita de extracto de vainilla", "leche, para aflojar", "150ml / 5¼ oz crema doble", "1 cucharadita de extracto de vainilla", "1 cucharadita de mantequilla sin sal", "150 g / 5¼ oz de chocolate blanco, además de virutas de chocolate extra, para decorar"], "method": ["Precaliente el horno a 170 ° C / 335 ° F / Gas 3. Engrase y alinee dos latas de emparedado de 20 cm / 8 in.", "Derretir el chocolate, la mantequilla y el agua juntos en una cacerola a fuego lento, revolviendo de vez en cuando, hasta que quede suave. Dejar enfriar un poco.", "Mientras tanto, tamiza las harinas y el polvo de cacao en un bol y mezcla el mascabado y el azúcar impalpable.", "Batir los huevos y la crème fraîche juntos en un recipiente aparte, luego batir en la mezcla de chocolate. Dobla la mezcla de harina hasta que quede suave.", "Divida la masa de la torta entre las latas y hornee durante 35-40 minutos, o hasta que la parte superior esté firme al tacto.", "Retire los pasteles del horno y déjelos a un lado para que se enfríen completamente.", "Mientras tanto, para el glaseado de mantequilla de chocolate, derrita el chocolate en un tazón sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque la superficie del agua).", "Batir la mantequilla en un bol hasta que esté suave, luego gradualmente batir en el azúcar glas. Agregue el extracto de vainilla y doble el chocolate derretido hasta que quede suave (agregue unas gotas de leche si la mezcla está un poco tieso).", "Para la ganache de chocolate, caliente la crema, el extracto de vainilla, la mantequilla y el chocolate en una sartén de base pesada. Retire la sartén del fuego y bata la mezcla hasta que quede suave y espesa.", "Para armar el pastel, coloca un cuchillo redondo en el interior de las latas para aflojar el pastel. Retire con cuidado los pasteles de las latas.", "Extienda la crema de chocolate sobre la parte superior de uno de los pasteles de chocolate, luego cuélela cuidadosamente con la otra torta.", "Transfiera la torta a un plato para servir y coloque la ganache de chocolate sobre la parte superior de la torta, dejándola rociar sobre el borde. Adorne con virutas de chocolate y sirva en rebanadas."], "url": "www_bbc_co_uk_food_recipes_chocolate_fudge_cake_03213", "title": "Pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_fudge_cake_03213_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "Avellanas sin cáscara de 125 g / 4½ oz, molidas aproximadamente en un procesador de alimentos", "Harina normal de 200g / 7oz", "125 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids)", "125g / 4½oz de mantequilla sin sal", "2 huevos de gallinas camperas, 1 entero, 1 yema solamente", "100 g / 3½ oz de azúcar en polvo", "50g / 1¾oz de azúcar morena suave", "pizca de sal", "Harina normal de 30g / 1oz, tamizada", "½ cucharadita de polvo de hornear", "30g / 1 oz de cacao en polvo", "240g / 8½oz de chocolate con leche de buena calidad", "300 g / 10% C2% BDoz% 20dark% 20chocolate% 20 (75-80 %% 20cocoa% 20solids)"], "method": ["Para la base de galletas, precaliente el horno a 150 ° C / 300 ° F / Gas 2 y engrase una lata para hornear de 30 x 20 cm / 12 x 8 pulgadas.", "Mezcle la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Agregue las avellanas y la harina y amasar ligeramente para combinar.", "Empuje la masa en la lata preparada para formar una capa uniforme. Hornee por aproximadamente 30 minutos, o hasta que se dore por los lados. Retire de la lata de inmediato y corte la galleta en 12 x 2½ cm / 1 en cuadrados con un cuchillo afilado. Dejar de lado para enfriar.", "Para la capa de brownie, encienda el horno a 180 ° C / 350 ° F / Gas 4 y engrase una lata para hornear de 30 x 20 cm / 12 x 8 pulgadas.", "En una sartén a fuego lento, derrita el chocolate y la mantequilla. En un recipiente aparte, bata el huevo y la yema de huevo juntos antes de batir los azúcares. Cuando el chocolate se haya derretido, viértalo en la mezcla de huevo. Agregue la sal, la harina, el polvo de hornear y el cacao, luego vierta la mezcla en la lata de hornear preparada.", "Hornee por 35 minutos, o hasta que la superficie se haya solidificado. Reserve para enfriar completamente antes de cortar en cuadrados de 2½ cm.", "Para el chocolate Chantilly, llena un tazón grande con agua helada y siéntate en un tazón más pequeño. Derrita el chocolate y 200 ml / 7 fl oz de agua juntas en una sartén a fuego lento. Cuando el chocolate se haya derretido, viértalo en un recipiente pequeño y bata con una batidora eléctrica portátil hasta que tenga la textura de la crema batida. Transferir a la nevera para enfriar.", "Para la parte superior de chocolate, derretir lentamente 275 g / 9¾ oz del chocolate negro en un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento. Rallar los restantes 25 g / ¾oz de chocolate, y revuelva en el chocolate derretido hasta que estén bien combinados. Retire el chocolate del fuego y viértalo en una lata para hornear de 30x20cm / 12x8 pulgadas. Dejar enfriar y luego colocar en la nevera para enfriar.", "Hierva una tetera y vierta el agua hirviendo en una taza o vaso resistente al calor. Coloca un cuchillo pequeño y filoso en el agua caliente y, usando el cuchillo caliente, corta el chocolate frío en cuadrados de 2½ cm.", "Ensamble los petits fours con una capa de galleta en la parte inferior, unte con chocolate Chantilly y cubra con chocolate negro y finalmente brownie."], "url": "www_bbc_co_uk_food_recipes_chocolate_indulgence_50181", "title": "Dulces de chocolate indulgencia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 96", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, más extra para engrasar", "200 g / 7 oz de chocolate negro, picado", "3 huevos grandes de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "Harina normal de 30g / 1oz", "40 g / 1½ oz de mantequilla", "75g / 2¾oz de pan rallado", "4 plátanos, picados y congelados", "3 cucharadas de mantequilla de maní suave"], "method": ["Precaliente el horno 180 ° C / 160 ° Ventilador / Gas 4. Engrase un plato para hornear de 20-25 cm / 8-10 pulgadas con un poco de mantequilla.", "Para la torta, derrita la mantequilla en una cacerola. Retire del fuego y revuelva suavemente la mitad del chocolate hasta que se derrita.", "En un tazón para mezclar, bata los huevos y el azúcar hasta que se pongan pálidos y espesos. Vierta la mezcla de chocolate, luego tamice la harina. Agregue el chocolate restante y con una espátula, doble la mezcla hasta que esté uniformemente combinada. Vierta en el plato preparado.", "Hornea por 20 minutos. Cuando se cocina, el pudin debe ser ligeramente firme alrededor de los lados, pero el centro debe estar tambaleante.", "Mientras tanto, para el helado. Derrita la mantequilla en una sartén, agregue las migas de pan y cocine hasta que estén doradas. Dejar de lado para enfriar.", "Coloque las bananas y la mantequilla de maní en un procesador de alimentos y mezcle hasta que quede suave y cremoso. Poner en un bol con las migas de pan y doblar.", "Sirve el budín de lava inmediatamente con el helado."], "url": "www_bbc_co_uk_food_recipes_chocolate_lava_cake_79464", "title": "Tarta de lava de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_lava_cake_79464_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 g / 2% de C2% de BDoz% 20 de azúcares en polvo% 20 de chocolate,% 20idealmente% 20100% de 20cocoa% 20sólidos", "185g / 6½oz de azúcar glas, cernida", "Almendras molidas 185 g / 6½ oz", "2 claras de huevo de rango medio", "2 claras de huevo de rango medio", "1 gota de jugo de limón - no se sienta tentado a usar más de esto o las claras de huevo se vuelvan demasiado rígidas", "185g / 6½ oz de azúcar en polvo", "3 cucharadas de agua", "100 ml / 4 fl oz de crema batida", "100g / 4 oz de chocolate negro o chocolate blanco si lo desea"], "method": ["Caliente el horno a 170 ° C / 325 ° F / Gas 3 y coloque dos bandejas para hornear sin forro en los estantes del medio.", "Para el pâté à macaron, derrita el chocolate en un recipiente suspendido sobre una fuente de agua hirviendo a fuego lento - no permita que el fondo del recipiente toque el agua.", "En un tazón grande, mezcle el azúcar glas, las almendras molidas y las claras de huevo para formar una pasta.", "Dobla el chocolate derretido y reserva.", "Para el merengue italiano, bata las claras de huevo y el jugo de limón en una batidora de cocina a velocidad media.", "Mientras tanto, coloque el azúcar y el agua en una olla pequeña y cocine a fuego alto hasta que alcance los 117 ° C / 242 ° F o la etapa de \"bola blanda\".", "Reduzca la velocidad en el mezclador a su configuración más baja y vierta el jarabe de azúcar sobre las claras de huevo batidas firmemente. Tenga mucho cuidado cuando haga esto, ya que el almíbar estará muy caliente y le quemará la piel si salpica.", "Aumente la velocidad a alta y continúe batiendo durante 2-3 minutos.", "Dobla la mezcla de merengue italiano en el paté à macaron hasta que llegue a la etapa de cinta - esto es cuando una cucharada de la mezcla vertida en el recipiente se sienta como una cinta en la superficie. No mezcle demasiado o el macarrón se agrietará cuando esté cocido.", "Coloque la mezcla en una manga pastelera equipada con una boquilla de 8 mm / ¼ in.", "Alinee dos bandejas para hornear con papel y tubo a prueba de grasa en discos de 3 cm / 1 pulgadas, separados por lo menos 2 cm / ¾ pulg.", "Retire las hojas para hornear calentadas del horno y deslice con cuidado el papel a prueba de grasa con los macarrones vertidos sobre ellas (precalentar las bandejas para hornear pone en marcha la cocción y forma el distintivo 'collarette' en la base de los macarrones).", "Hornee en el horno durante ocho minutos y luego déjelo en una rejilla para enfriar hasta que esté completamente frío.", "Para el ganache, coloque la crema en una sartén pequeña y déjela hervir.", "Retire la sartén del fuego y bata en el chocolate hasta que la mezcla esté suave, luego coloque la bolsa en una manga con una boquilla de 8 mm / ¼ in.", "Vierte aproximadamente una cucharadita de ganache en el lado plano de un macarrón enfriado y remata con otro macarrón para hacer un sándwich.", "Repita con el ganache y los macarrones restantes y guárdelos en una sola capa en un recipiente hermético en la nevera."], "url": "www_bbc_co_uk_food_recipes_chocolate_macaroons_19613", "title": "Macarrones de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 30 macarrones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_macaroons_19613_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate puro", "200g / 7oz de chocolate blanco", "Crema doble 225ml / 8fl oz", "450g / 1lb de mantequilla sin sal ablandada", "450 g / 1lb de azúcar en polvo", "8 huevos de gallinas camperas", "Harina de auto aumento de 450g / 1lb", "200 g / 7 oz% 20plain% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids),% 20melted", "225 g / 8oz de mantequilla sin sal, ablandada", "450 g / 1 libra de azúcar glas", "200g / 7oz de chocolate puro, derretido", "2 cucharadas de leche", "450 ml / 16 fl oz de crema batida", "Chocolate normal 175g / 6oz, derretido, más rizos de chocolate extra", "Chocolate blanco de 225g / 8oz, derretido, más rizos de chocolate extra"], "method": ["Para las trufas, derrita 115g / 4oz del chocolate puro y 115g / 4oz del chocolate blanco en recipientes separados.", "Mientras tanto, caliente la crema hasta que hierva. Divida la crema entre el chocolate normal y el chocolate blanco y bata cada mezcla hasta que quede espesa y brillante.", "Dejar enfriar en la nevera durante 2-3 horas.", "Para hacer las trufas, derrita el chocolate blanco y el chocolate blanco restantes en recipientes separados. Cubra una bandeja para hornear con papel resistente a la grasa.", "Saca dos cucharaditas de la mezcla de trufa de chocolate blanco, rueda hasta formar una bola, sumerge cuidadosamente el chocolate puro derretido y déjalo a un lado en la bandeja para hornear. Repita con la mezcla restante de trufa de chocolate blanco.", "Repita el paso 5 con la mezcla de trufa de chocolate y sumerja las trufas en el chocolate blanco derretido.", "Mientras tanto, para la torta de mármol, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y enharine dos latas de bocadillo de 15 cm / 6 pulgadas y dos latas de 20 cm / 8 pulgadas.", "Batir la mantequilla, el azúcar y los huevos juntos en un tazón grande hasta que estén bien combinados. Dobla la harina.", "Divida la mezcla entre las cuatro latas, luego vierta un poco de chocolate derretido en cada lata. Agite la mezcla de pastel con un pincho para crear un efecto marmoleado.", "Hornee los pasteles de 15cm / 6in por 30-40 minutos y los pasteles de 20cm / 8in por 40-50 minutos, o hasta que un pincho insertado en el centro de cada pastel salga limpio. Retire los pasteles del horno y déjelos a un lado para que se enfríen completamente.", "Mientras tanto, para la crema de mantequilla, bata la mantequilla y el azúcar glas juntos en un bol hasta que estén suaves y esponjosos. Batir el chocolate derretido y la leche. Dejar de lado.", "Para la ganache de chocolate, bata 175ml / 6fl oz de la crema batida en el chocolate liso derretido hasta que quede suave y brillante.", "Batir la crema batida restante en el chocolate blanco hasta que quede suave y brillante.", "Para armar las tortas, corte cada pastel de 15cm / 6 pulgadas por la mitad horizontalmente y llénelas con crema de mantequilla para hacer una torta de cuatro capas. Extienda un poco de crema de mantequilla en el tablón de 15cm / 6 pulgadas y coloque los pasteles sobre ellos.", "Repite el paso 14 con el pastel de 20 cm / 8 pulgadas.", "Hiele la torta de 15cm / 6in con la ganache de chocolate normal y la torta de 20cm / 8in con la ganache de chocolate blanco. Enfriar en la nevera durante 1-2 horas, o hasta que el ganache se haya endurecido.", "Para apilar las tortas, sostenga una varilla de sujeción al costado de la torta de 20 cm / 8 pulgadas y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulg. De distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta y la parte superior con la torta de 15 cm / 6 pulgadas.", "Decora con trufas de chocolate y virutas de chocolate."], "url": "www_bbc_co_uk_food_recipes_chocolate_marble_cake_83846", "title": "Pastel de chocolate y chocolate con trufa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "70 g / 2½ oz de mantequilla", "300g / 10½oz de azúcar moreno claro y suave", "125 g / 4½ oz de leche evaporada", "Marshmallows 225g / 8oz", "300g / 10½oz de chocolate con leche, picado", "75g / 3oz% 20dark% 20chocolate% 20 (at% 20least% 2060 %% 20cocoa% 20solids),% 20chopped"], "method": ["Engrase una lata de torta cuadrada de 20 cm / 8 in con aceite vegetal, luego cubra con papel antigrasa.", "Coloque la mantequilla, el azúcar y la leche evaporada en una sartén a fuego lento y derrita suavemente. Una vez que el azúcar se haya disuelto, agregue los malvaviscos y suba el fuego. Hervir el dulce de azúcar durante 5-6 minutos.", "Retire la sartén del fuego y agregue el chocolate picado. Deje actuar durante un minuto, luego mezcle la mezcla hasta que todo se derrita.", "Vierta la mezcla en la lata preparada y deje reposar por un par de horas. Una vez que esté listo, quítelo de la lata y corte en 25 cuadrados."], "url": "www_bbc_co_uk_food_recipes_chocolate_marshmallow_14263", "title": "Fudge de azúcar moreno de chocolate y malvavisco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 25 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_marshmallow_14263_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de mantequilla sin sal, ablandada, más extra para engrasar", "250 g / 9 oz de azúcar en polvo", "4 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de extracto de vainilla", "½ cucharadita de color negro para alimentos en gel (opcional)", "50 g / 2 oz de cacao en polvo", "Harina de auto crianza de 200g / 7oz", "200g / 7oz% 20dark% 20chocolate% 20 (at% 20least% 2070 %% 20cocoa% 20solids),% 20chopped% 20into% 20small% 20pieces", "Crema doble de 200 ml / 7 fl oz", "10 malvaviscos blancos", "ojos dulces comestibles"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para hacer la torta, engrase y forme una lata rectangular de 20x30cm / 8x12 pulgadas con papel de hornear.", "Batir la mantequilla y el azúcar con una batidora manual hasta que esté pálida y esponjosa. Agregue los huevos, poco a poco, batiendo bien entre cada adición. Agregue el extracto de vainilla y el colorante alimenticio de gel negro, si se usa, con el último del huevo.", "Tamiza el cacao en polvo y la harina en un bol. Dobla la harina en la mezcla de mantequilla hasta que esté completamente combinada. Coloque la mezcla en la lata preparada y alise la superficie con el dorso de una cuchara.", "Hornee durante 30 minutos, o hasta que estén suaves al tacto (una brocheta insertada en el centro del pastel debe salir limpia). Deje que se enfríe durante 10 minutos en la lata antes de pasar a una rejilla para que se enfríe por completo.", "Para hacer el glaseado de ganache de chocolate, pon la crema en una cacerola y llévala a ebullición. Vierta en un recipiente resistente al calor. Agregue el chocolate picado, poco a poco, y revuelva hasta que se derrita por completo y el ganache es suave y brillante. Deje que se enfríe durante unos minutos hasta que se sienta tibio al tacto.", "Coloque la torta (en la rejilla para enfriar) en una hoja grande de periódico o papel para hornear. Vierta la mitad de la ganache en el centro de la torta y extiéndala uniformemente para cubrir la parte superior y los lados, agregando más, según sea necesario, para hacer una bonita capa uniforme. Permita que se enfríe y fragüe.", "Mientras tanto, ligeramente mantequilla una sartén antiadherente, agregue\r\n los malvaviscos y derrita a fuego lento, revolviendo con frecuencia (o coloque en un tazón a prueba de calor ligeramente mantequilla y el microondas en ráfagas de 10 segundos hasta que se derrita, agitando con frecuencia). Los malvaviscos no necesitan derretirse por completo antes de quitarlos del fuego, continuarán fundiéndose por sí solos, pero no quemes ni recalientes el malvavisco.", "Verifique que el malvavisco no esté demasiado caliente antes de tomar una pizca entre los dedos y tirar de ella para formar hebras delgadas. Coloque los hilos en todo el pastel de forma irregular en zig zag. Cuando el malvavisco en los dedos se enfríe demasiado para tirar, enjuague los dedos en agua tibia y comience nuevamente con otra pizca. Coloque los ojos comestibles en pares en los huecos entre la telaraña de malvavisco."], "url": "www_bbc_co_uk_food_recipes_chocolate_marshmallow_51574", "title": "Pastel de tela de araña de Halloween de malvavisco de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_marshmallow_51574_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz% 20dark% 20chocolate% 20con% 20around% 2040 %% 20cocoa% 20solids% 20 (tales% 20as% 20Bournville)% 20", "50g / 1¾oz de harina integral", "50g / 1¾oz de harina natural", "pizca de sal", "½ cucharadita de polvo de hornear", "25 g / 1 oz de azúcar en polvo", "25g / 1oz de mantequilla", "1 cucharada de leche", "3 huevos de gallinas camperas, solo para blancos", "150 g / 5½ oz de azúcar en polvo", "6 cucharaditas de jarabe de oro", "½ cucharadita de sal", "½ vaina de vainilla, solo semillas"], "method": ["Derretir 300 g / 10½ oz del chocolate negro en un recipiente colocado sobre una olla de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua). Derretir el chocolate sobre un calor suave evita que el chocolate se decolore más tarde. Déjalo a un lado para que se enfríe un poco; no puedes alinear los moldes si el chocolate está demasiado líquido.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Para hacer los bizcochos, ponga las harinas, la sal, el polvo de hornear y el azúcar impalpable en un tazón y frote la mantequilla con las puntas de los dedos. Agregue la leche y mezcle todo para formar una bola suave.", "En una superficie enharinada, extender la masa a aproximadamente 5 mm / ¼ de grosor. Recortar seis rondas con un cortador redondo recto de 7,5 cm / 3 in.", "Coloque las rondas en un plato o placa plana y enfríe en la nevera durante 10 minutos. Asegúrese de que los bizcochos estén perfectamente redondos y bien fríos, de lo contrario, podrían extenderse o contraerse al hornear.", "Hornea los bizcochos por 10-12 minutos. Deben ser duros, no suaves, ya que forman la base de la torta de té.", "Retire las galletas del horno y enfríe en una rejilla de alambre.", "Cubra el interior de los moldes con el chocolate derretido. El grosor del chocolate debería ser suficiente para que sean fuertes pero no demasiado espesos. Esto se hace mejor con una cuchara, usando la parte posterior para hacer pasar el chocolate por los moldes. Si el chocolate es demasiado líquido, significará que la parte superior del domo es demasiado gruesa y que el lado demasiado delgado.", "Reservar para establecer. No coloque las cúpulas en el refrigerador ya que el chocolate perderá su brillo.", "Mientras tanto sumerge los bizcochos enfriados en el chocolate derretido restante, cubriéndolos por completo (es posible que necesites derretir más chocolate). Puede sumergir los bizcochos en el chocolate o extender el chocolate en los bizcochos con una espátula. Coloque las galletas recubiertas en papel pergamino.", "Para el malvavisco, coloque todos los ingredientes en un tazón grande sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua) y bata con un batidor de mano eléctrico durante 6-8 minutos, asegurándose es suave, sedoso y duplicado en volumen. Asegúrate de que sea muy rígido, la consistencia de la crema batida, para que se mantenga cuando se canaliza, no lo quieres mojado.", "Coloque la mezcla de malvaviscos en una manga pastelera.", "Derrita el chocolate restante y colóquelo en una manga pastelera desechable con un extremo sellado. Dejar de lado para enfriar y endurecer un poco, pero no endurecer.", "Retire las galletas del pergamino y colóquelas en un pergamino limpio, con el lado plano hacia abajo.", "Pase el malvavisco por cada molde recubierto de chocolate hasta la parte superior.", "Recorte un extremo de 2 cm / ¾ pulg de la manga pastelera con el chocolate en ella.", "Con cuidado, vierta un poco de chocolate en el malvavisco y un borde de chocolate alrededor de la base de la galleta y rápidamente coloque la galleta en la parte superior de la cúpula llena de malvavisco. Alise la unión con un cuchillo.", "Deje las tortas de té para ponerlas hasta que estén completamente frías y selladas juntas.", "Retire con mucho cuidado las tortas de té del molde, tenga cuidado con las huellas dactilares en el domo brillante.", "Coloque en un plato y manténgalo fresco, pero no lo refrigere, para asegurarse de que el chocolate mantenga su brillo brillante."], "url": "www_bbc_co_uk_food_recipes_chocolate_marshmallow_60410", "title": "Tortitas de chocolate con malvavisco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_marshmallow_60410_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["170 g / 6oz de mantequilla sin sal, suavizada, más extra para engrasar", "115g / 4¼ oz de manteca vegetal", "300g / 10½ oz de azúcar granulada", "250g / 8¾oz de azúcar moreno oscuro", "3 huevos de gallinas camperas", "1 cucharada de extracto de vainilla", "70 g / 2½ oz de cacao en polvo", "300ml / 10½fl oz de agua caliente", "150ml / 5fl oz de crema agria", "Harina común de 370g / 13oz", "2 cucharaditas de polvo de hornear", "1 cucharadita de bicarbonato de soda", "½ cucharadita de sal", "125g / 4½ oz de azúcar", "80ml / 2¾fl oz de agua", "3 claras de huevo de gallinas camperas, a temperatura ambiente", "½ cucharadita de crema de tártaro", "150g / 5fl oz de mantequilla sin sal, suavizada", "½ cucharadita de extracto de menta", "225g / 8oz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "175ml / 6¼fl oz de crema batida", "25 g / 1 oz de mantequilla sin sal, cortada en cubos", "2 racimos grandes hojas de menta fresca", "75g / 3oz de chocolate blanco, derretido", "75g / 3oz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20melted"], "method": ["Precaliente el horno a 170C / 325F / Gas 3. Engrase y alinee tres latas de emparedado de 20cm / 8in.", "Usando un batidor eléctrico, bata la manteca y los manteca juntos hasta que estén suaves y esponjosos. Agregue los dos azúcares y bata durante aproximadamente 5 minutos. Batir lentamente los huevos (uno a la vez) y el extracto de vainilla hasta que estén bien combinados.", "Mezcle el cacao en polvo, el agua caliente y la crema agria en un tazón. Tamice la harina, el polvo de hornear, el bicarbonato de soda y la sal en un tazón aparte.", "Dobla la mitad de la mezcla de harina en la masa de la torta y dobla en la mitad de la mezcla de cacao. Dobla la mezcla de harina restante y la mezcla de cacao restante hasta que estén bien combinados.", "Divida la mezcla de la torta en partes iguales entre las tres latas de sándwich y hornee por 40-45 minutos, o hasta que el contacto sea elástico. Retire los pasteles del horno y deje enfriar en las latas durante 20 minutos, luego retírelos de las latas y déjelos a un lado para que se enfríen completamente en una rejilla.", "Mientras tanto, para la crema de mantequilla de merengue de menta, bata las claras de huevo en un tazón con un batidor eléctrico hasta que estén espumosas. Agregue la crema de tártaro y bata hasta que se formen picos rígidos cuando se quite la batidora.", "Caliente el agua y el azúcar en una cacerola hasta que la temperatura alcance los 115 ° C (238 ° F) (use un termómetro de azúcar para verificar esto).", "Vierta el jarabe caliente por el lado del tazón de claras de huevo y continúe batiendo durante aproximadamente 3 minutos. Deja la mezcla a un lado durante 10 minutos para que se enfríe, luego bate lentamente en la mantequilla hasta que quede espeso y suave. Agregue el extracto de menta, al gusto.", "Para la ganache de chocolate, caliente el chocolate y la crema a fuego lento durante 1-2 minutos o hasta que el chocolate se derrita. Batir la mantequilla hasta que quede espesa y brillante. Cubra el recipiente, déjelo enfriar, luego enfríelo en el refrigerador hasta que comience a espesarse ligeramente. Batir la mezcla espesada hasta que esté suave y esponjosa.", "Para las hojas de chocolate, pinta la mitad de las hojas de menta con chocolate blanco y la otra mitad con chocolate negro con un pincel de pastelería. Apoye las hojas pintadas contra algo (como el mango de una cuchara de madera) para crear hojas ligeramente curvadas. Enfríe en la nevera durante 10 minutos o hasta que esté listo. Use unas pinzas para pelar la hoja de chocolate de la hoja de menta y deseche la hoja de menta.", "Para enfriar la torta, coloque una torta en un plato para servir y cubra con la mitad del relleno de menta. Agregue la segunda torta y la parte superior con el relleno restante; terminar con la torta final. Hiele la parte superior y los lados del pastel con la ganache de chocolate y decore con las hojas de chocolate."], "url": "www_bbc_co_uk_food_recipes_chocolate_mint_cake_53708", "title": "Pastel de menta chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 280 g / 10 oz, tamizada", "125g / 4½oz de azúcar glas, cernida", "50 g / 2 oz de cacao en polvo, tamizado", "pizca de sal", "200g / 7oz de mantequilla fría, cortada en cubitos", "2 yemas de huevo de gallinas camperas", "500 g / 1 libra de carne picada preparada de 2oz", "2 clementinas, ralladura y jugo", "2 cucharadas de leche", "1 huevo de gallinas camperas, golpeado"], "method": ["Mezcle la harina, el azúcar glas, el cacao en polvo y la sal en un tazón. Mezcle la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo hasta que la mezcla se mezcle en grupos (es posible que necesite un poco de agua fría). Amasar la masa brevemente hasta que quede suave, envolver en film transparente y dejar enfriar en la nevera durante una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle la carne picada, la ralladura de clementina y el jugo en un tazón.", "Retire la masa de la nevera y extiéndala a un grosor de 0.5cm / ¼in. Con un cortador acanalado de 7,5 cm / 3 in, estampar 12 discos de la masa y utilizarlos para revestir una lata de 12 hoyos. Llene cada hoyo con dos cucharaditas de la mezcla de carne picada y cepille los bordes con un poco de leche.", "Con un cortador acanalado de 6 cm / 2½, corte 12 círculos y úselos para cubrir los pasteles de carne picada, presionando los bordes con las puntas de los dedos. Vuelva a enrollar los pasteles restantes y corte nuestros copos de nieve o formas de estrellas para decorar la parte superior. Cepille la parte superior de cada pastel de carne picada con huevo batido y coloque suavemente las decoraciones en la parte superior, luego vuelva a cepillar con huevo.", "Hornee en el horno durante 20-25 minutos, o hasta que la masa esté bien cocida."], "url": "www_bbc_co_uk_food_recipes_chocolate_mince_pies_51441", "title": "Pasteles de carne picada de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_mince_pies_51441_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 yemas de huevo medianas de campo abierto", "20g / ¾oz de azúcar glasé", "250 g / 9 oz de chocolate negro, derretido", "2 g de gelatina", "5 cucharadas de aguardiente", "400 ml / 14 fl oz de crema batida", "3 claras de huevo de rango medio", "90g / 3¼ oz de azúcar en polvo", "Harina suave 220g / 8oz", "150 g / 5½ oz de mantequilla", "Azúcar demerara 75 g / 2½ oz", "30 g / 1 oz de avena", "1 cucharada de leche entera", "Harina normal de 75 g / 2½ oz", "200g / 7oz de caramelo duro", "30g / 1oz de avellanas trituradas", "100 g / 3½ oz de chocolate negro", "100ml / 3½ fl oz crema doble", "50ml / 2fl de leche en oz", "10 g de mantequilla"], "method": ["Para la mousse de chocolate, en un tazón grande bata las yemas de huevo y el azúcar glas hasta que estén muy pálidos con un batidor eléctrico.", "Derretir el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento. Una vez derretido, mezcle la gelatina y el brandy en el chocolate. Dejar de lado hasta que la gelatina se disuelva.", "Mientras tanto, batir la crema hasta que se formen picos suaves cuando se quite la batidora.", "Agregue la mezcla de chocolate a las yemas de huevo y luego doblar en crema batida.", "En otro recipiente, bata las claras de huevo y el azúcar hasta que se formen picos firmes cuando se quite el batidor. Agregue la mezcla de chocolate y crema con una cuchara grande de metal, teniendo cuidado de no eliminar el aire. Coloque en el refrigerador por 4 horas o hasta que se asienten.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el crumble, en un tazón, frote todos los ingredientes hasta que se asemejen a pan rallado. Alinee una bandeja para hornear con papel de hornear. Extiende la mezcla de crumble en una capa uniforme y hornea 15 minutos. Rompe y deja de lado.", "Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para las galletas de praliné, en un procesador de alimentos rompa el caramelo hasta que forme un polvo grueso. Espolvoree sobre una estera de silicona en ocho discos redondos y hornee durante 4 minutos. Espolvorear con avellanas y dejar enfriar.", "Para la salsa de chocolate, derrita el chocolate en un tazón resistente al calor sobre una olla de agua hirviendo a fuego lento. Caliente la crema, la leche y la mantequilla en una cacerola de base pesada. Agregue el chocolate derretido y manténgalo caliente.", "Para servir, esparza la migaja sobre cuatro platos para servir. Pon dos quenelles de mousse en el centro de cada plato. Coloque una galleta de praliné en cada quenelle de mousse y luego vierta sobre la salsa de chocolate caliente."], "url": "www_bbc_co_uk_food_recipes_chocolate_mousse_78634", "title": "Mousse de chocolate con praliné, crumble y salsa de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10 oz de chocolate negro", "150g / 5oz de mantequilla", "6 huevos, separados", "50 g / 2 oz de azúcar en polvo", "Ruibarbo 300g / 11oz, cortado en trozos de 7.5cm / 3in", "50 g / 2 oz de azúcar en polvo", "75ml / 3fl oz Pimms u otra bebida de taza de fruta", "Helado de vainilla de 500g / 18oz, para servir"], "method": ["Para la torta, precaliente el horno a 180C / 350F / Gas 4.", "Alinee una lata de pastel en forma de resorte de 24cm / 9½ en forma suelta con pergamino para hornear.", "Coloque el chocolate y la mantequilla en un recipiente y coloque encima de una olla con agua hirviendo.", "Caliente el chocolate y la mantequilla hasta que se derrita, y revuelva para combinar.", "Coloque las yemas de huevo en un recipiente con dos cucharadas de azúcar y bata ligeramente.", "Coloque las claras de huevo en un recipiente aparte y bata hasta que se formen picos suaves. Poco a poco agregue el azúcar restante, batiendo continuamente hasta que se formen picos firmes.", "Vierte el chocolate derretido sobre las yemas de huevo y golpéalo.", "Agregue un tercio de las claras de huevo a la mezcla de chocolate y bata para aclarar la mezcla.", "Doble suavemente las claras de huevo restantes en la mezcla, asegurándose de que estén todas incorporadas.", "Vierta la mezcla en la lata de la torta y luego colóquela en el horno durante 20 minutos, hasta que se haya puesto. Dejar de lado para enfriar.", "Para el ruibarbo asado Pimms, coloque el ruibarbo en una bandeja y esparza el azúcar sobre la parte superior.", "Vierta los Pimms y luego mezcle para cubrir y coloque en el horno durante 15 minutos hasta que estén tiernos y esmaltados en los Pimms.", "Para servir, corte el pastel y colóquelo en el plato junto con un poco de ruibarbo y una bola de helado."], "url": "www_bbc_co_uk_food_recipes_chocolate_mousse_cake_20460", "title": "Pastel de mousse de chocolate con ruibarbo asado Pimms y helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas, solo yemas", "50 g / 2 oz de azúcar en polvo", "20g / 1 oz de harina de maíz", "250ml / 9fl oz de leche entera", "1 cucharada colmada de polvo de cacao sin azúcar", "3 huevos de gallinas camperas, solo para blancos", "50g / 2oz de azúcar glasé", "par gotas jugo de limón", "pizca de sal", "150 g / 5½ oz de chocolate negro, finamente picado", "200ml / 7fl oz crema batida", "2 cucharadas de mantequilla suave", "50 g / 2 oz de semillas de cacao"], "method": ["Para la crème pâtissière, bata las yemas de huevo con el azúcar hasta que estén pálidas y gruesas, luego bate en el aciano.", "Agregue el cacao en polvo a la leche y hierva, luego apague el fuego.", "Verter la leche en una corriente lenta sobre la mezcla de huevo, batiendo vigorosamente todo el tiempo. (Vierta lentamente para evitar revolver el huevo).", "Regrese la mezcla a una olla limpia a fuego medio y bata continuamente. Asegúrese de raspar los lados y la parte inferior, de lo contrario, se quemará.", "La crema comenzará a espesar. Una vez que libera una burbuja o dos, quítalo del fuego.", "Vierta en un recipiente poco profundo. Cubra con película adhesiva (toque la película adhesiva para que se adhiera directamente a la crema) y refrigere durante al menos una hora antes de usarla.", "Para el merengue, ponga la mitad de las claras de huevo en un recipiente limpio de vidrio o metal. Agregue el azúcar, el jugo de limón y la sal y bata hasta que estén blancos.", "Agregue el resto de las claras de huevo y continúe batiendo hasta que el merengue forme picos rígidos cuando se quite el batidor.", "Derrita el chocolate en un baño maría (un tazón resistente al calor colocado sobre una olla de agua hirviendo) o en el microondas en un entorno bajo.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora.", "Para hacer la mousse, bata la crème pâtissière fría para eliminar los grumos antes de remover el chocolate derretido. Mezcle un tercio del merengue, luego doble suavemente el resto seguido de la crema batida.", "Para servir, cepille 4-6 vasos o moldes con mantequilla suave. Agregue algunas semillas de cacao y enrósquelas por los lados y la parte inferior de las copas hasta que estén bien recubiertas.", "Divida la mousse entre los vasos y deje enfriar durante al menos una hora, pero idealmente cuatro horas. Servir frío, espolvoreado con semillas de cacao. La mousse se come mejor el mismo día y no se debe guardar por más de dos días (debido a las claras de huevo crudas)."], "url": "www_bbc_co_uk_food_recipes_chocolate_mousse_with_19253", "title": "Mousse de chocolate con semillas de cacao", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo grande de gallinas camperas (preferiblemente orgánico)", "150 g / 5½ oz de chocolate negro, derretido", "2-3 cucharadas de chartreuse", "Crema doble de 250 ml / 9 fl oz, batida a picos suaves"], "method": ["Coloque el huevo en un recipiente y coloque el recipiente sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Batir continuamente sobre el calor suave hasta que se espese. Doble en el chocolate derretido.", "Agregue el chartreuse hasta que se combine completamente. Deje que se enfríe un poco.", "Doble la crema batida hasta que esté bien mezclada y no queden rayas blancas. Vierta en vasos para servir y deje enfriar en la nevera hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_mousse_with_92313", "title": "Mousse de chocolate con chartreuse", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de azúcar glas (azúcar glas dorada si está disponible)", "Harina normal de 200g / 7oz", "45 g / 1⅔oz de cacao en polvo", "40g / 1½ oz de avena molida", "2 pizca de sal de mesa", "150 g / 5½ oz de mantequilla sin sal, refrigerada, más extra para engrasar", "50g / 1¾oz de huevo de corral batido", "1 huevo mediano de gallinas de corral, para lavar huevos", "140g / 5oz de mantequilla sin sal", "210 g / 7% C2% BDoz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20chopped", "Azúcar en polvo blanco 140g / 5oz", "110g / 4oz de azúcar mascabado ligero", "50g / 1¾oz de jarabe dorado", "¾ cucharadita de sal marina fina", "Crema agria con 100 g de grasa y 125 g / 4½ oz", "45 g / 1⅔oz de cacao en polvo", "6 yemas de huevo grandes de gallinas camperas", "Frambuesas 420 g / 15 oz (para hacer un puré de 300 g / 10½ oz después del tamizado)", "75g / 2½ oz de azúcar granulada", "2 cucharadas de pectina de manzana", "Nueces de pacana 150 g / 5½ oz", "200 g / 7 oz de azúcar en polvo blanco"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase una lata agria de 25cm / 10in de fondo suelto.", "Para la masa de chocolate, agregue los ingredientes secos a un procesador de alimentos y pulse brevemente para mezclar. Agregue la mantequilla y el pulso hasta que la mezcla se asemeje a pan rallado. Agregue el huevo batido y el pulso hasta que la masa se una (no procesen en exceso).", "Amasar brevemente la masa, luego envolver con una película adhesiva y colocarla en un plato en el congelador durante unos minutos.", "Extienda la masa hasta 3 mm de grosor y úsela para revestir la lata de tarta. Pinchar todo con un tenedor y colocar en el congelador durante 10 minutos.", "Alinee la caja de repostería con un pergamino para hornear y llénela con alubias para hornear. Hornee por 12 minutos, luego quite los frijoles y el pergamino, cepille con la colada de huevo y vuelva al horno por 5 minutos. Dejar de lado para enfriar en la lata.", "Para el relleno, caliente la mantequilla en una cacerola a fuego lento. Cuando se derrita agregue el chocolate negro y revuelva para combinar. Agregue los azúcares, el jarabe y la sal. Agregue la crema agria, el cacao en polvo y las yemas de huevo y mezcle hasta que estén bien combinados.", "Vierta en la caja de repostería y hornee por 12 minutos, luego gire la tarta y hornee por otros 10 minutos. Déjelo enfriar en una rejilla de alambre durante unos minutos y luego transfiéralo a la nevera para que se enfríe.", "Para el coulis de frambuesa, divide las frambuesas en un procesador de alimentos y pasa a través de un colador para eliminar las semillas. Caliente el puré, el azúcar y la pectina en una cacerola a fuego medio hasta que alcance 104C en un termómetro de azúcar. Dejar enfriar y espesar un poco antes de verter sobre el relleno de la tarta helada. Enfríe en el refrigerador hasta que esté listo para servir.", "Para el praliné de nuez, coloque las pacanas en una bandeja para hornear y tueste durante aproximadamente 8 minutos. Dejar de lado para enfriar. Mientras tanto, alinee una bandeja para hornear con papel de hornear antiadherente o una estera de silicona.", "En una olla mediana, disuelva el azúcar en polvo en 50 ml / 2 fl oz de agua y caliente a 160 ° C en un termómetro de azúcar. Agregue las pacanas y el abrigo en el caramelo, luego colóquelas en la bandeja para hornear forrada para que se enfríen por completo.", "Una vez frío, picar el praliné y colocar encima de la tarta. Servir frío."], "url": "www_bbc_co_uk_food_recipes_chocolate_new_york_pie_55792", "title": "Pastel de chocolate Nueva York", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 tarta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5% C2% BDoz% 20dark% 20chocolate,% 2070 %% 20cocoa% 20solids,% 20roughly% 20chopped", "100ml / 3½fl oz de aceite de oliva virgen extra", "4 huevos grandes de gallinas camperas, a temperatura ambiente, separados", "¼ cucharadita de copos de sal marina, más una pizca", "50 g / 1 oz de azúcar en polvo"], "method": ["Derrita el chocolate en el microondas o en un recipiente grande a prueba de calor suspendido sobre una olla de agua hirviendo (sin tocar el agua), asegurándose de que de cualquier manera lo retire del fuego antes de que se derrita completamente, luego revuelva suavemente para que los últimos pedacitos de chocolate se disuelvan. Deja enfriar por 10 minutos. Agregue el aceite y reserve.", "Batir las claras de huevo con una pizca de escamas de sal marina en un recipiente sin grasa hasta que tenga los picos firmes. Dejar de lado.", "Batir las yemas, el azúcar y ¼ de cucharadita de copos de sal marina en un tazón grande por separado hasta que estén pálidos, gruesos y aproximadamente el doble de volumen.", "Poco a poco vierta la mezcla de chocolate y aceite en las yemas batidas y doblar para mezclar por completo. Agregue un tercio de las claras de huevo batidas y dóblelas vigorosamente para aclarar la mezcla; no es necesario ser delicado en esta etapa. Ahora dobla suavemente otro tercio de las claras de huevo y, cuando se incorpore ese segundo lote, dobla en el último tercio dejando atrás cualquier líquido en el fondo del plato de claras. No deben verse rayas blancas.", "Con cuidado, coloca la mousse en tus moldes o tazas. Para obtener la textura correcta, suave y satinada, en lugar de establecerla como una mousse más tradicional, puedes refrigerarla durante 20 minutos y luego comer directamente, o durante una hora y luego sacarla hasta que alcance la temperatura ambiente durante 40 minutos antes de comer."], "url": "www_bbc_co_uk_food_recipes_chocolate_olive_oil_60450", "title": "Mousse de aceite de oliva y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_olive_oil_60450_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de aceite de oliva regular, más extra para engrasar", "50 g / 2 oz de cacao en polvo, tamizado", "125ml / 4fl oz de agua hirviendo", "2 cucharaditas de extracto de vainilla", "150 g / 5½ oz de almendras molidas o 125 g / 4½ oz de harina común", "½ cucharadita de bicarbonato de soda", "pizca de sal", "200 g / 7 oz de azúcar en polvo", "3 huevos de gallinas camperas"], "method": ["Precalienta el horno a 170 ° C / 325 ° F / Gas 3. Engrasa una lata de pastel con forma de resorte de 23 cm / 9 in con un poco de aceite y cubre la base con papel para hornear.", "Mida y tamice el cacao en polvo en un tazón o jarra y bata con agua hirviendo hasta que tenga una pasta suave, achocolatada y aún líquida (pero solo justa). Agregue el extracto de vainilla, luego póngalo a un lado para que se enfríe un poco.", "En otro tazón pequeño, combine las almendras molidas (o harina) con el bicarbonato de soda y una pizca de sal.", "Ponga el azúcar, el aceite de oliva y los huevos en el tazón de un mezclador independiente con el accesorio de paleta (u otro tazón y batidor de su elección) y bata vigorosamente durante unos tres minutos hasta que tenga una crema pálida, aireada y espesada de pálida .", "Baje la velocidad un poco y vierta la mezcla de cacao, batiendo mientras avanza, y cuando todo esté raspado, puede inclinar lentamente la mezcla de almendras molidas (o harina).", "Raspe y revuelva un poco con una espátula, luego vierta esta mezcla oscura y líquida en la lata preparada. Hornee por 40-45 minutos o hasta que los lados estén puestos y el mismo centro, en la parte superior, parezca ligeramente húmedo. Un probador de pasteles debería aparecer principalmente limpio, pero con algunas migas de chocolate pegajosas adheridas a él.", "Deje que se enfríe durante 10 minutos en una rejilla de alambre, todavía en su lata, y luego alivie los lados de la torta con una pequeña espátula de metal y bríquelo de la lata. Deje que se enfríe por completo o coma mientras esté caliente con un poco de helado, como un pudín."], "url": "www_bbc_co_uk_food_recipes_chocolate_olive_oil_cake_44817", "title": "Tarta de chocolate con aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_olive_oil_cake_44817_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 120g / 4oz", "Azúcar en polvo 140g / 5oz", "1 cucharadita de polvo de hornear", "40 g / 1½ oz de mantequilla sin sal", "50g / 2oz de chocolate negro, derretido y enfriado ligeramente", "1 huevo de gallinas camperas", "125ml / 4fl de leche en oz", "1 naranja, solo jugo", "3 cucharadas de azúcar granulada", "125g / 4½oz de mantequilla sin sal, ablandada", "250 g / 9 oz de azúcar glas", "2-3 cucharadas de leche", "50g / 1¾oz de chocolate blanco, derretido", "1 naranja, solo ralladura", "100g / 3½ oz de chocolate naranja"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Cubra una lata de muffin de 12 hoyos con cajas de papel.", "Mezcle la harina, el azúcar y el polvo de hornear en un procesador de alimentos. Agregue la mantequilla y el pulso hasta que se combinen.", "Batir el chocolate derretido, el huevo y la leche juntos en una jarra.", "Revuelva la mezcla de chocolate en la mezcla de harina hasta que se combine.", "Coloca la mezcla en las cajas y hornea por 15-20 minutos, o hasta que se levante y dore, y una brocheta insertada en el centro salga limpia. Retire del horno y deje enfriar por 10 minutos.", "Mientras tanto, mezcle el jugo de naranja y el azúcar granulado en un tazón. Con cuidado, vierta la mezcla de jugo de naranja sobre los pasteles calientes y déjelo enfriar por completo.", "Para el chocolate blanco y la crema de mantequilla de naranja, bata la mantequilla en un bol hasta que esté suave y esponjosa. Con cuidado agregue el azúcar glas y continúe batiendo durante cinco minutos. Batir la leche, el chocolate derretido y la ralladura de naranja.", "Decora los cupcakes con la crema de mantequilla", "Usa un cuchillo afilado para hacer virutas de chocolate del chocolate anaranjado y úsalos para decorar los cupcakes."], "url": "www_bbc_co_uk_food_recipes_chocolate_orange_69109", "title": "Magdalenas de chocolate y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 pequeños pasteles de hadas u 8 cupcakes grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_69109_16x9.jpg", "isVegetarian": true, "recommendations": 0}]