[{"ingredients": ["500ml / 18fl oz de aceite vegetal, para freír", "55g / 2oz de mantequilla sin sal ablandada", "½ chile rojo, picado", "1 cucharada de perejil fresco, picado", "1 cucharada de albahaca fresca picada", "1 pechuga de pollo, cortada por la mitad (bolsillos cortados en el costado de cada uno con un cuchillo afilado)", "50g / 1¾oz de harina, sazonado con sal y pimienta negra recién molida", "2 huevos enteros de granja, golpeados", "100g / 3½oz de pan rallado blanco", "2 cucharadas de tomate picado", "1 cucharada de cebolla picada", "1 cucharadita de chile picado", "1 cucharada de cilantro fresco, picado", "1 cucharada de aceite de oliva", "½ lima, solo jugo", "½ batata, pelada, picada y hervida hasta que esté tierna", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una cacerola profunda de fondo grueso, hasta que esté muy caliente o hasta que se rompa un pan rallado. (PRECAUCIÓN: El aceite caliente es muy peligroso. No lo deje sin supervisión).", "Para hacer la mantequilla herby, coloca la mantequilla, el chile, el perejil y la albahaca en un moño y aplasta junto con un tenedor.", "Para el pollo, divida la mantequilla herby en dos pedazos y coloque en cada uno de los bolsillos de pollo.", "Coloque la harina en un bol y drague el pollo en la harina. Sumerja el pollo en el huevo para cubrir, luego sumerja en las migas de pan para cubrir. Repita la inmersión y el recubrimiento con el huevo y el pan rallado.", "Con cuidado, baje los bolsillos de pollo en el aceite caliente y fría hasta que estén crujientes y dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Coloque el pollo en una bandeja para hornear y transfiéralo al horno para cocinar durante 5-6 minutos, o hasta que esté completamente cocido.", "Para la salsa, coloque el tomate, la cebolla, el chile, el cilantro, el aceite y el jugo de lima en un tazón, mezcle y sazone, al gusto, con sal y pimienta recién molida.", "Para las papas, agregue la mantequilla y el aceite de oliva a las batatas cocidas, sazone al gusto, con sal y pimienta negra recién molida y aplaste a su consistencia preferida.", "Para servir, espolvorea el puré en un plato con el pollo al costado y luego espolvorea un poco de salsa."], "url": "www_bbc_co_uk_food_recipes_chillistuffedchicken_84289", "title": "Pollo relleno de chili con salsa de tomate y papas molidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bola de hielo", "¼ de lima, solo jugo", "35ml/1¼floz tequila reposado", "15 ml / ½ fl oz crema de cassis", "100ml / 3½fl oz de sidra", "1 rebanada de manzana", "1 ramita de menta fresca"], "method": ["Coloque el hielo en un vaso hondo y exprima el jugo de limón.", "Para el tequila, la crème de cassis y la sidra. Revuelva la onza.", "Para servir, enganche la rebanada de manzana sobre el lado del vaso. Adorne con la ramita de menta."], "url": "www_bbc_co_uk_food_recipes_chimayo_91323", "title": "Chimayo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal", "1 cucharada de aceite de oliva", "2 dientes de ajo picados", "½ cucharadita de hojuelas de chile seco", "Pechuga de pollo 100 g / 3½ oz, picada", "6 pimientos Peppadew picados", "6 judías verdes, picadas", "gran cilantro puñado, picado", "1 lima, solo jugo", "2 envolturas de tortilla listas para usar", "2 puñados de perejil fresco", "2 limas, cortadas en cuartos, para adornar", "½ cucharadita de pimentón, para adornar"], "method": ["Calentar el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente el aceite de oliva en una sartén y saltee el ajo, el chile y el pollo.", "Agregue los pimientos, los frijoles y el cilantro y mezcle durante un minuto más.", "Agregue el jugo de lima y retire del fuego.", "Divida la mezcla entre las dos envolturas de tortilla, luego enrolle como un rollo de primavera y asegure con palillos de dientes.", "Freír las tortillas durante dos minutos hasta que estén doradas, luego retirar cuidadosamente con una espumadera y escurrir sobre los paños de cocina. Cortar en la diagonal.", "Para servir, coloca el perejil en un plato grande, agrega las tortillas y decora con las rodajas de lima y una pizca de pimentón."], "url": "www_bbc_co_uk_food_recipes_chimichanga_83401", "title": "Chimichanga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paquete de 1 x 270 g de pasta de filo confeccionada (6 hojas)", "gran perilla de mantequilla sin sal, derretida", "1 cucharada de aceite de sésamo, para freír", "½ diente de ajo, finamente picado", "1½ cebollas de primavera, en rodajas", "Jengibre fresco de raíz de 2.5cm / 1in, pelado y finamente picado", "½ zanahoria, cortada en bastones pequeños", "150g / 5½oz de langostinos pelados crudos, cortados en trozos pequeños", "pizca de polvo chino de cinco especias", "Mangetout 35g / 1¼ oz, finamente picado", "40g / 1½oz de pak choi, en rodajas finas", "30g / 1oz de brotes de soja", "½ cucharada de salsa de soja ligera", "puñado de hojas frescas de cilantro, para adornar"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la masa, use un cortador de pizza para cortar la masa en cuadrados de 24 x 5 cm. Cepille ligeramente un lado de todos los cuadrados con mantequilla derretida. Coloque un cuadrado encima de otro en un ángulo, con la mantequilla hacia arriba, para hacer una forma de estrella, luego empuje en el orificio de una bandeja para muffins con la mantequilla hacia abajo. Repita hasta que todos los cuadrados estén agotados.", "Hornee por 6-8 minutos, o hasta que estén dorados y crujientes. Retirar del estaño y dejar enfriar en una rejilla de alambre.", "Mientras tanto, para el relleno de gambas, caliente el aceite de sésamo en una sartén grande o wok. Agregue el ajo, la cebolleta y el jengibre, y mezcle. Agregue la zanahoria y saltee durante 2 minutos. Agregue las gambas y saltee hasta que se pongan rosadas. Agregue las cinco especias chinas.", "Agregue el mangetout, pak choi y brotes de soja y sofría por 2-3 minutos, o hasta que todas las verduras estén tiernas. Agregue la salsa de soja, luego retírela del fuego.", "Para armar las tartas, coloque las tartaletas en la tabla de servir y coloque el relleno de gambas en las cajas de los pasteles. Adorne con cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_chinese-style_prawn_filo_45695", "title": "Tartaletas de filo de gambas al estilo chino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 12 mini tartaletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chinese-style_prawn_filo_45695_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "4 zanahorias, peladas, cada una cortada en cuatro a lo largo", "½ cucharadita de comino molido", "½ lima, solo jugo", "sal y pimienta negra recién molida", "1 chuleta de cordero, hueso extraído, cortado en cubos de 2cm / 1in", "1 cucharada de aceite de oliva", "½ cucharadita de pimentón", "½ cucharadita de chile en polvo"], "method": ["Remoje dos brochetas de madera en agua durante 10 minutos, luego sacuda el exceso.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para las zanahorias, caliente el aceite de oliva en una sartén a prueba de horno y agregue las zanahorias. Espolvorea sobre el comino y freír durante 3-4 minutos, o hasta que se dore. Transfiera al horno y tueste durante 10-12 minutos, o hasta que estén tiernos. Retire del horno, mezcle el jugo de limón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para los kebabs, mezcle todos los ingredientes del kebab en un bol hasta que estén bien combinados. Ensarte el cordero en los pinchos, colóquelo en una bandeja para hornear y tueste en el horno durante 8-10 minutos (a fuego medio), o hasta que esté cocido a su gusto. Gire los kebabs de vez en cuando para asegurarse de que estén dorados por todos lados.", "Sirva los kebabs de cordero en un plato con zanahorias asadas al lado."], "url": "www_bbc_co_uk_food_recipes_chillilambkebabswith_92847", "title": "Brochetas de cordero con zanahorias asadas con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz pato huesos y adornos, picados", "1 zanahoria, picada", "1 tallo de apio, picado", "1 cebolla picada", "1 puerro, picado", "Anís de 2 estrellas", "1 cucharada de pimienta negra", "600ml / 21fl oz de caldo de pollo", "2 x coronas de pato (o 4 pechos de pato)", "2 cucharaditas de cinco especias chinas", "2 patas de pato, huesos retirados", "4 cebolletas, partes blancas picadas, partes verdes reservadas para guarnición", "2 cucharaditas de salsa de soja oscura", "2 cucharaditas de aceite de sésamo", "20 envolturas redondas de dim sum (gyoza)", "1 pieza de jengibre de raíz, sin pelar, en rodajas", "2 chiles rojos", "6 raíces de cilantro", "4 cebollas enteras de primavera", "3 cucharadas de salsa de pescado", "Anís de 4 estrellas", "Fideos de huevo frescos de 300g / 10oz", "pequeñas hojas de cilantro puñado", "2 chiles rojos, semillas eliminadas, en rodajas"], "method": ["Para hacer un caldo de pato, caliente una cazuela grande o una cacerola de base pesada y agregue los huesos de pato y cualquier guarnición de pato. Dorarlos y procesar cualquier grasa y jugos.", "Agregue las verduras a la sartén con el anís estrellado y los granos de pimienta negra. Vierta el caldo de pollo y cúbralo con 600 ml / 21 fl oz de agua. Llevar a ebullición y cocinar durante unos 30 minutos.", "Mientras tanto, quita las pechugas de pato de las coronas y puntúalas. Sazone con cinco especias chinas y déjelas en el refrigerador hasta que estén listas para cocinar.", "Precalentar el horno a 200C / 400F / Gas 6", "Para las albóndigas. cortar la carne de pierna de pato y colocar en un bol. Mezcle con los blancos picados de cebolleta, salsa de soja y aceite de sésamo. Toma las envolturas y humedece con un poco de agua fría, coloca una cucharadita pequeña de la mezcla en el centro de cada envoltura y dóblalas para formar una bola de masa. Haz 20 albóndigas.", "Coloque las pechugas de pato en una sartén fría, a prueba de horno y gradualmente caliente hasta que la grasa comience a rendir. Dé vuelta y cocine en el horno por seis minutos. Retire después de este tiempo y deje reposar mientras termina la sopa.", "Para terminar el caldo, coloque la raíz de jengibre, chile, raíz de cilantro, cebollas enteras y el resto de anís estrellado en una sartén limpia. Cuele el caldo y pase a través de un tamiz fino, luego añádalo a la sartén. Sabor con la salsa de pescado. Deje que hierva a fuego lento y elimine el exceso de grasa que sale a la superficie. Agregue las albóndigas y cocine por 2-3 minutos. Pase el caldo por un tamiz nuevamente y reserve para servir.", "Cocine los fideos de huevo de acuerdo con las instrucciones del paquete.", "Para servir, coloque fideos de huevo en cada tazón junto con cinco albóndigas y una pechuga de pato en rodajas. Vierta alrededor de una cuarta parte del caldo, adorne con los verdes de las cebolletas, las hojas de cilantro y el chile rebanado."], "url": "www_bbc_co_uk_food_recipes_chinese_duck_noodle_soup_76266", "title": "Sopa de fideos chinos y wontons", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas, en rodajas finas", "3 dientes de ajo, finamente picados", "10 ciruelas, descuartizadas y apedreadas", "4cm / 1½ en jengibre fresco, pelado y finamente picado", "8 muslos de pollo deshuesados, sin piel", "2 cucharadas de salsa de soja", "gran azúcar impalpable", "150g / 5½oz de arroz blanco de grano largo", "1 brócoli grande de cabeza, cortado en florecillas", "puñado de hojas de cilantro, más o menos picadas, para adornar"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente el aceite en una cazuela a fuego medio. Agregue las cebollas y el ajo y cocine hasta que se ablanden, revolviendo ocasionalmente.", "Agregue las ciruelas, jengibre, pollo, salsa de soja, azúcar y 100 ml de agua. Cubra con una tapa y deje que hierva.", "Transfiera el plato al horno y hornee durante 30-40 minutos, o hasta que el pollo esté cocido y las ciruelas se hayan derretido en una salsa. Pruebe y sazone con más salsa de soya si es necesario.", "Mientras tanto, cocina el arroz a las instrucciones del paquete. Déjelo con la tapa puesta hasta que esté listo para servir.", "Mientras tanto, coloca el brócoli en un colador de metal sobre una fuente de agua hirviendo a fuego lento. Cubra con una tapa y vapor hasta que esté tierno. Alternativamente, cocine usando un vaporizador.", "Sirva el arroz con la ciruela de pollo y el brócoli. Dispersión sobre el cilantro."], "url": "www_bbc_co_uk_food_recipes_chinese_plum_chicken_26015", "title": "Pollo chino de ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chinese_plum_chicken_26015_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de solomillo de 100g / 3½oz", "pimienta negra recién molida", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 chile rojo, finamente cortado", "½ lima, solo jugo", "Fideos de arroz 100 g / 3½ oz, cocidos de acuerdo con las instrucciones del paquete"], "method": ["Frote el aceite de oliva en el bistec y sazone con la pimienta negra recién molida.", "Calentar una sartén a fuego alto. Agregue el bistec y fría por 3-4 minutos en cada lado, o hasta que esté cocido a su gusto. Retire y reserve en un lugar cálido para descansar.", "Agregue la salsa de soja, la miel, el chile y la lima a la sartén donde se cocinó el bistec y mezcle completamente. Cocine a fuego medio durante 2-3 minutos hasta que la salsa se reduzca a un glaseado pegajoso.", "Para servir, corte el bistec a la mitad. Coloque los fideos de arroz cocidos en un plato de servir, coloque las rebanadas de carne en la parte superior y vierta los jugos de la cacerola por todas partes."], "url": "www_bbc_co_uk_food_recipes_chinesebeefwithcashe_89448", "title": "Carne de res china con anacardos y aderezo de chile de soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 costillas grandes, cortadas en costillas individuales", "2 cucharadas de vino de arroz Shaoxing", "1 cucharada de salsa de soja ligera", "1 cucharada de aceite de sésamo", "1 cucharada de harina de maíz", "aceite vegetal, para freír", "3 cucharadas de vino de arroz Shaoxing", "3 cucharadas de salsa de ciruela", "2 cucharadas de salsa hoi sin", "3 cucharadas de miel", "2 cucharadas de salsa de soja ligera", "75ml / 3fl oz de vinagre de sidra", "150ml / 5fl oz de caldo de pollo", "1 cucharada de polvo chino de cinco especias", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz 5cm / 2in, rallado", "1 cucharada de aceite vegetal", "2 dientes de ajo, en rodajas finas", "Jengibre fresco de raíz de 5 cm / 2 pulgadas, finamente picado", "1 chili rojo largo, finamente cortado", "½ repollo chino, finamente rallado", "2 cucharadas de salsa de soja ligera"], "method": ["Para las costillas, coloque todos los ingredientes de las costillas en un tazón y revuelva para combinar. Cubra el recipiente con film transparente y colóquelo en el refrigerador para marinar durante cuatro horas.", "Caliente una freidora de grasa a 190 ° C o coloque el aceite en una sartén profunda de base pesada para que llene a medias la sartén. Caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Retire las costillas de la nevera y drene el exceso de adobo. Con cuidado, coloque el aceite caliente en lotes de 2-3 costillas a la vez y cocine hasta que esté dorado. Retire las costillas con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la salsa, coloque todos los ingredientes de la salsa en una sartén grande y poco profunda con tapa y revuelva para combinar. Coloque la sartén a fuego medio y cocine a fuego lento.", "Agregue las costillas fritas y traiga la salsa a fuego lento. Cubra y cocine durante 40-50 minutos hasta que las costillas estén tiernas, girando las costillas varias veces durante el tiempo de cocción. Retire la tapa durante los últimos cinco minutos de cocción.", "Para el repollo, caliente una sartén hasta que esté caliente, luego agregue el aceite, el ajo, el jengibre y el chile y saltee por 30 segundos.", "Agregue el repollo y saltee por otros 2-3 minutos, o hasta que el repollo esté solo marchito.", "Agregue la salsa de soja y revuelva para combinar.", "Para servir, vierta un poco de repollo en cada plato. Coloque dos costillas en cada plato y sirva con salsa extra en una jarra de servir al costado."], "url": "www_bbc_co_uk_food_recipes_chinesespareribswith_88340", "title": "Costillas de cerdo al estilo chino con repollo salteado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1oz / 25g camarones chinos secos", "¼oz / 5g de setas secas chinas", "1½ cucharada de maní u otro aceite sin sabor", "1 cebolla pequeña, pelada y finamente picada", "4 lonchas de tocino rayado, cortadas en trozos de ¼ de pulgada / 5 mm", "Guisantes de 2 oz / 50 g, frescos si es posible, descongelados si están congelados", "2 huevos grandes, ligeramente batidos", "2 cebollas de primavera, divididas longitudinalmente y finamente picadas", "1 cucharada de salsa de soja japonesa", "arroz blanco basmati medido hasta 8 fl oz nivel / 225 ml en una jarra medidora", "1½ cucharadita de cucharaditas de maní u otro aceite sin sabor", "1 cebolla pequeña, pelada y finamente picada", "1 cucharadita de sal redondeada"], "method": ["Comience preparando el arroz: Caliente la sartén tapada a fuego medio, luego agregue el aceite y las cebollas y déjelas cocer durante 3-4 minutos, hasta que estén ligeramente teñidas de marrón. Luego agregue el arroz - no hay necesidad de lavarlo - y voltee los granos en la sartén para que se cubran ligeramente y brillen con aceite. Luego agregue 16fl oz / 450ml de agua hirviendo y la sal, revuelva una sola vez, luego cubra con la tapa. Ajuste la temperatura a su nivel más bajo y deje que el arroz se cocine suavemente durante exactamente 15 minutos. No quite la tapa y no agite el arroz durante la cocción, porque esto es lo que romperá los granos y liberará su almidón, lo que hace que el arroz se vuelva pegajoso.", "Después de 15 minutos, incline la bandeja para verificar que no quede líquido; si lo hay, vuelva a colocarlo en el fuego por otro minuto. Cuando no quede agua en la sartén, retire la sartén del fuego, quite la tapa y cubra con un paño limpio durante 5-10 minutos y luego deje que se enfríe completamente antes de usarla.", "Coloque las gambas y los champiñones en un recipiente pequeño, vierta más de 16 fl oz / 450 ml de agua hirviendo y déjelos en remojo durante 30 minutos. Luego exprime el líquido de ellos, descarta los tallos de los champiñones y córtelos finamente. Luego caliente la mitad del aceite en un wok o sartén y, cuando esté realmente caliente, fría rápidamente las cebollas y el tocino durante 3 minutos, moviéndolos en la sartén hasta que el tocino esté crujiente. A continuación, agregue los camarones, los guisantes y los champiñones y saltee estos durante aproximadamente 1 minuto. Ahora agregue el aceite restante a la sartén y, cuando esté humeando, agregue el arroz y saltee, esta vez durante unos 30 segundos. Ahora separa los ingredientes en la sartén y vierte los huevos batidos. No se verá muy bien ahora, pero sigue revolviendo, volteando la mezcla, y los huevos pronto se cocinarán en pequeños trozos que se mezclarán con los otros ingredientes. Finalmente, agregue las cebollas tiernas y la salsa de soya, dele otra buena cocción y sirva."], "url": "www_bbc_co_uk_food_recipes_chinesestirfriedrice_68033", "title": "Arroz chino salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "125g / 4½ oz de harina de maíz", "1 cucharadita de polvo de hornear", "250ml / 9fl oz de agua con gas", "1 cucharadita de aceite de sésamo", "4 plátanos, pelados, cortados en trozos", "aceite vegetal, para freír", "250 g / 9 oz de azúcar en polvo", "4 cucharadas de agua", "3 cucharadas de semillas de sésamo", "helado de vainilla"], "method": ["Para los buñuelos, tamice la harina, la harina de maíz y el polvo de hornear juntos en un tazón, luego agregue el agua y el aceite de sésamo hasta que se forme una mezcla suave.", "Agregue las piezas de plátano y mezcle suavemente hasta que esté completamente cubierto en la mezcla.", "Llene a la mitad una olla profunda de fondo grueso con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque con cuidado los plátanos en el aceite y fríalos hasta que estén dorados. Retire con cuidado con una cuchara ranurada y drene en toallas de papel.", "Para el caramelo, coloque el azúcar, el agua y las semillas de sésamo en una cacerola a fuego lento y cocine hasta que todo el azúcar se haya derretido. Aumente el fuego para llevarlo a ebullición y continúe cocinando, sin remover, hasta que la mezcla se vuelva de color caramelo claro.", "Retire el caramelo del fuego y, uno por uno, sumerja los buñuelos de plátano en el caramelo caliente. Dé vuelta a cada buñuelo con un tenedor para cubrir todo, luego retírelo de inmediato y sumérjalo en un recipiente con agua helada. Retire el buñuelo del agua y déjelo escurrir sobre una rejilla de alambre mientras sumerge los buñuelos restantes.", "Para servir, coloque los buñuelos en platos y coloque una bola de helado de vainilla al lado."], "url": "www_bbc_co_uk_food_recipes_chinesestylebananfri_85342", "title": "Buñuelos de plátano estilo chino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite para freír", "50g / 1¾oz de harina natural", "50g / 1¾oz de harina de maíz", "½ cucharadita de pimentón", "½ cucharadita de comino", "½ cucharadita de chile en polvo", "½ filete de cerdo cortado en tiras", "½ cebolla, cortada en anillos", "50 g / 1¾ fl oz de leche"], "method": ["Caliente el aceite listo para freír. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Mezcle las harinas y las especias y cubra el cerdo.", "Remoja la cebolla en la leche y luego revuelve la mezcla de harina.", "Freír a fuego lento tanto el cerdo como la cebolla durante 2-3 minutos o hasta que estén crujientes y dorados. Servir."], "url": "www_bbc_co_uk_food_recipes_chinesestylecrispypo_76405", "title": "Cerdo crujiente de estilo chino con cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo deshuesada y sin piel, toscamente picada", "2 limas, solo jugo", "1 cucharadita de polvo chino de cinco especias", "1 cucharada de salsa de soja ligera", "400 g / 14 oz de carne picada de cerdo", "1 chile verde, finamente picado", "4 cucharadas de hojas frescas de cilantro picado", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "2 chiles rojos largos, finamente picados", "100 g / 3½ oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "50ml / 2fl oz de vinagre de vino blanco", "1 lima, solo jugo", "3 cucharadas de aceite de sésamo", "1 cucharadita de salsa de soja ligera", "4 cebolletas, cortadas en finas tiras", "½ pepino, cortado en finas tiras", "2 cucharadas de hojas frescas de cilantro"], "method": ["Precalentar el horno a 190C / 385F / Gas 5.", "Coloque el pollo, el jugo de lima, el polvo de cinco especias y la salsa de soja en un procesador de alimentos y pulse hasta que se combinen.", "Agregue la carne de cerdo picada, chile verde y cilantro fresco y pulse de nuevo para combinar bien como una pasta áspera. Sazonar con sal y pimienta negra recién molida.", "Forme la mezcla de carne picada en bolas del tamaño de una pelota de golf y aplaste ligeramente en hamburguesas.", "Caliente una sartén a prueba de horno hasta que esté caliente y agregue el aceite vegetal y las hamburguesas picadas y fría durante 1-2 minutos por cada lado, o hasta que estén doradas, luego transfiera al horno para cocinar durante 4-5 minutos, o hasta que estén completamente cocidos. .", "Para la inmersión, coloque los chiles, el azúcar, el agua y el vinagre en una cacerola a fuego medio y deje que hierva. Cocine durante 4-5 minutos, hasta que comience a espesarse, luego retírelo del fuego y deje que se enfríe un poco.", "Mientras tanto, para la ensalada, mezcle el jugo de lima, el aceite de sésamo y la salsa de soja en un tazón. Agregue las cebolletas, el pepino y las hojas de cilantro y mezcle para cubrir bien.", "Para servir, coloque la mezcla de ensalada en un plato, cubra con una pila de empanadas de cerdo y rocíe con un poco de salsa de chile. Coloque el resto en un tazón pequeño y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_chinesestyleporkpatt_84653", "title": "Hamburguesas de cerdo al estilo chino con salsa de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de harina de pan blanco fuerte", "10g / ¼ oz de levadura de acción rápida", "1½ cucharada de azúcar en polvo", "1 cucharadita de pimienta de cayena", "½ cucharada de orégano seco", "310ml / 10fl oz de agua tibia", "3 cucharaditas de sal", "2 cucharaditas de aceite vegetal", "60 g / 2¼ oz de queso cheddar ahumado, finamente rallado", "2-4 chiles chipotle, picados", "1 huevo de gallinas camperas, ligeramente batido, para glasear", "pimentón ahumado y orégano extra, para espolvorear en la parte superior", "1½ cucharada de azúcar moreno claro para cazar furtivamente agua"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4, engrase ligeramente un tazón grande y engrase dos bandejas grandes para hornear.", "En un tazón limpio grande, mezcle la harina, la levadura, el azúcar impalpable, la pimienta de cayena y el orégano seco juntos. En un recipiente aparte, mezcle el agua tibia, la sal y el aceite, luego combine lentamente con los ingredientes secos.", "En una superficie enharinada, amasar la masa hasta que quede suave y elástica. Transfiera al tazón engrasado, cubra con un paño húmedo y déjelo durante 10 minutos. Amasar brevemente la masa de nuevo por un minuto, cubrir nuevamente y dejar probar durante otros 10 minutos.", "Agregue el queso y los chiles a la masa y amasar hasta que estén distribuidos uniformemente. Cubra y reserve para probar durante 30 minutos.", "Divida la masa en 12 piezas iguales y enrolle cada pieza en una bola ordenada. Cubra con una toalla de té húmeda y déjela a un lado para comprobar durante 20 minutos.", "Forma las bolas de masa en anillos insertando una cuchara de madera en el centro y usando los dedos para estirar suavemente la masa.", "Para preparar el agua furtiva, llene dos ollas grandes con agua, agregue el azúcar morena y deje que hierva. Cueza los bagels dos o tres a la vez durante 30 segundos en cada lado. Sácalos con una espumadera, sacuda el exceso de agua y colócalos en las bandejas de hornear preparadas.", "Cepíllese ligeramente con huevo, espolvoree sobre el orégano y el pimentón ahumado y luego transfiéralo al horno durante 20-25 minutos hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_chipotle_chilli_and_75319", "title": "Chiles chipotle y bagels de queso cheddar ahumado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "125 g / 4½ oz de solomillo de ternera, finamente cortado", "1 cucharadita de polvo chino de cinco especias", "sal y pimienta negra recién molida", "½ pimiento verde, finamente cortado", "2 cebollas tiernas, finamente cortadas", "Jengibre fresco de 5 cm / 2 pulgadas, en rodajas finas", "3 cucharadas de salsa de soja", "2 cucharaditas de aceite de sésamo", "salpicar agua hirviendo", "1 cucharada de semillas de sésamo, tostadas", "pequeño cilantro fresco puñado, picado", "1 cucharada de cebolletas frescas picadas"], "method": ["Calentar el aceite vegetal en un wok hasta que esté muy caliente. Sazonar la carne en rodajas con el polvo chino de cinco especias, sal y pimienta negra recién molida. Agregue la carne al wok caliente y fría a fuego muy alto durante 30 segundos.", "Agregue el pimiento en rodajas, las cebollas tiernas y el jengibre y fría por 1-2 minutos. Agregue la salsa de soja y el aceite de sésamo y revuelva para cubrir. Agregue un poco de agua hirviendo, revuelva bien y la cuchara en un recipiente.", "Para servir, decore con semillas de sésamo tostadas, cilantro y cebollino picado."], "url": "www_bbc_co_uk_food_recipes_chinesestylestirfrie_87959", "title": "Carne de res frita al estilo chino con cebollas tiernas y pimientos verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2½oz de cebollín fresco", "4 rebanadas finas, cuadradas de centeno oscuro o pan de centeno", "50g / 2oz de queso crema claro", "200 g / 7 oz de salmón ahumado o curado, en rodajas finas", "Huevas de salmón 50g / 2oz", "1 limón, descuartizado"], "method": ["Con un par de tijeras, muy finamente cortar el cebollino, y organizar en un plato plano.", "Extiende el pan con el queso crema hasta los bordes.", "Coloque el pan con el lado del queso hacia abajo sobre la cebolleta, presionando ligeramente, hasta que cada rodaja esté completamente cubierta con una fina capa de cebollín, de un extremo a otro.", "Corta cada rebanada en cuatro cuadrados. Corta el salmón y dóblalo encima de cada pan.", "Cubra con un poco de huevas de salmón y algunas cebolletas cortadas y sirva con las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_chivebreadwithsalmon_73332", "title": "Pan de cebollín con salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 16 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7 huevos de gallinas camperas, solo blancos (las yemas se reservaron para la crema de mantequilla)", "50 g / 1 oz de azúcar en polvo", "Almendras molidas 260 g / 9½ oz", "260g / 9½oz de azúcar glasé", "7 huevos de gallinas camperas", "Harina normal de 85g / 3oz", "55g / 2oz de mantequilla sin sal, derretida y enfriada, más extra para engrasar", "1-2 cucharaditas de extracto de vainilla", "Azúcar en polvo de 700 g / 1 lb 9 oz", "200 g / 7oz de almendras en copos, tostadas", "8 yemas de huevo de gallinas camperas (en parte desde arriba)", "300 g / 10½ oz de mantequilla, a temperatura ambiente", "Crema doble 230ml / 8fl oz", "pellizcar hilos de azafrán", "140g / 5oz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20broken% 20into% 20small% 20pieces% 20", "Chocolate con leche 140g / 5oz, roto en trozos pequeños", "1 cucharada de mantequilla suave", "150 g / 5½ oz de azúcar en polvo", "1 cucharadita de esencia de café", "3-4 cucharadas de licor de amaretto", "pellizcar hilos de azafrán", "50g / 1¾oz de chocolate negro", "300 g / 10½ oz de chocolate blanco", "pellizcar hilos de azafrán", "240ml / 8½fl oz de crema", "225 g / 8 oz de chocolate negro, finamente picado", "1 cucharada de glucosa líquida (o mantequilla)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6. Engrasar y tender 3 latas de rollo suizo 23x31cm / 9x12.5in.", "Para el bizcocho, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor. Agregue el azúcar impalpable y bata a los picos rígidos. Dejar de lado.", "En un recipiente aparte, bata las almendras, el azúcar glas y los huevos hasta duplicar su volumen. Dobla la harina y agrega la mantequilla derretida y el extracto de vainilla.", "Doble las claras de huevo hasta incorporarlas y luego divida rápidamente la mezcla entre las latas preparadas (aproximadamente 275 g / 9¾ oz por lata).", "Hornee en el horno precalentado durante cinco minutos, o hasta que quede elástico y ligeramente dorado.", "Cuando el pastel esté cocido, déjelo a un lado para que se enfríe.", "Para la crema de praliné, haz un caramelo. Derrite 400 g / 14 oz del azúcar en polvo en una sartén de base pesada hasta que tenga un color marrón dorado profundo (PRECAUCIÓN: no lo deje sin vigilancia). Agregue las almendras en copos y luego se extendió en una capa delgada sobre una estera de silicona. Dejar de lado para enfriar. Cuando el praliné esté frío y duro, divídalo en trozos y colóquelo en un procesador de alimentos. Mezcle el praliné con un polvo.", "Agregue el azúcar impalpable restante y 80 ml / 2½ fl oz de agua a una sartén y caliente lentamente a 113 ° C / 235 ° F (use un termómetro de azúcar para esto).", "Mientras tanto, bata las yemas de huevo en una batidora independiente hasta que estén suaves y esponjosas.", "Cuando el jarabe de azúcar alcanza los 113 ° C / 235 ° F, agréguelo a las yemas de huevo en un tazón grande en un flujo lento, batiendo todo el tiempo. Siga batiendo hasta que la mezcla se haya enfriado.", "Batir la mantequilla hasta que esté suave y luego agregarla gradualmente a la mezcla de yema. Agregue el praliné triturado y reserve.", "Para la ganache, caliente la crema a fuego lento, luego agregue el azafrán y deje reposar para infundir durante unos minutos.", "Calienta la crema hasta el punto de ebullición, luego retírala del fuego y agrega el chocolate. Reserve a un lado durante cinco minutos para que el chocolate se derrita.", "Revuelva la crema para incorporar el chocolate derretido. Mezcle la mantequilla suave y déjela enfriar.", "Mientras tanto, para el almíbar, calienta suavemente 150 ml / 5½ fl oz de agua y el azúcar en una sartén para hacer un jarabe. Cuando todo el azúcar se haya disuelto, hierva el almíbar por unos minutos. Retire del fuego y agregue la esencia de café, amaretto y azafrán. Dejar de lado.", "Para la decoración, derrita el chocolate negro y viértalo en una manga pastelera equipada con una boquilla simple. Pase una 'O' por ópera sobre una pieza rectangular de papel de acetato / grasa (aproximadamente 7x5cm / 2¾x2in) y colóquela en el congelador para colocarla.", "Mientras tanto, derrita la mitad del chocolate blanco en un recipiente a prueba de calor colocado sobre una fuente de agua hirviendo a fuego lento. Cuando el chocolate alcance los 45 ° C / 113 ° F agrega el azafrán. Agregue 50g / 1¾oz del chocolate blanco restante y permita que se derrita antes de remover para combinar.", "Cuando la 'O' de chocolate negro esté endurecida, alise rápidamente el chocolate blanco derretido y vuelva al congelador para colocarlo.", "Cuando el chocolate blanco esté casi listo, retire el papel de acetato / grasa y coloque el rectángulo de chocolate sobre una tabla de cortar (verá la \"O\" oscura sobre el fondo de chocolate blanco). Ordene los bordes con un cuchillo afilado, si es necesario, luego regrese al congelador para configurar completamente.", "Para construir el pastel, coloque uno de los pasteles en un plato de servir. Rocíe más de un tercio del almíbar, extienda la mitad de la crema de mantequilla y cubra con la mitad del ganache. Coloque otra capa de pastel encima y repita el proceso, usando la misma cantidad de jarabe, la mitad de la crema de mantequilla restante y todo el ganache. Coloque la última capa de pastel encima y rocíe con el resto del jarabe. Cubra la parte superior con una capa fina y suave de crema de mantequilla (una capa de migajas) y coloque toda la torta en el congelador para preparar la crema de mantequilla (para que no se derrita cuando agregue el glaseado de chocolate negro).", "Para el glaseado de chocolate negro, caliente la crema hasta escaldarla. Vierta la crema sobre el chocolate y deje reposar por un minuto. Revuelva suavemente hasta que el chocolate esté completamente derretido y suave, luego agregue la glucosa líquida.", "Para la decoración de chocolate, derrita el chocolate blanco restante y vierta en una manga pastelera con una boquilla pequeña y lisa adjunta.", "Cuando la crema de mantequilla esté fría, vierta una capa lisa del glaseado de chocolate negro encima de la torta, teniendo cuidado de no dejarla correr por los bordes. Coloque la decoración de chocolate en el medio y pinte el chocolate blanco derretido en formas para decorar."], "url": "www_bbc_co_uk_food_recipes_chocolate_almond_praline_58078", "title": "Tarta de ópera de chocolate, almendra praliné y azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 torta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pollo de 1,8 kg / 4 lb", "50g / 1¾oz de arroz de grano largo", "Pasta blanca de miso 150 g / 5½ oz", "150g / 5½oz de chipotle en salsa de adobo", "125ml / 4fl oz de crema agria", "1 lechuga romana, hojas separadas", "1 radicchio, hojas separadas", "1 cucharada de semillas de sésamo", "1 chile verde, en rodajas finas", "3 tallos de menta fresca", "5 tallos de cilantro fresco", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 140C / 120C Ventilador / Gas 1. Abra la cavidad del pollo, separe las piernas tanto como sea posible para permitir que el calor cocine el ave de manera uniforme, colóquelo en una lata para asar y sazone con sal. Ase el pollo durante 3 horas, rociando la piel con los jugos hasta la mitad. Con un termómetro para carne, verifique que la temperatura interna alcance 75C. Para verificar que el pollo esté bien cocido, asegúrese de que los jugos salgan limpios sin ningún rastro de color rosado cuando la parte más gruesa de la pierna, entre el muslo y el muslo, se perfora con un pincho.", "Precalentar la parrilla o la barbacoa a muy caliente.", "Tueste el arroz en una sartén seca a fuego medio hasta que esté coloreado. Incline en un procesador de alimentos y mezcle con un polvo grueso. Incline en un recipiente y reserve.", "Mezcle el miso y el chipotle en un procesador de alimentos hasta que quede suave.", "Junta el pollo en seis u ocho piezas. Ase las piezas bajo la parrilla o en la barbacoa caliente durante 5-6 minutos para colorear la piel.", "Revuelva una pizca de agua en la crema agria.", "Para servir, coloque las hojas de ensalada en un plato de servir y coloque el pollo encima. Sazonar bien con sal y pimienta. Cubra el pollo con la pasta de miso-chipotle, rocíe sobre la crema agria, espolvoree sobre las semillas de sésamo, el chile, el polvo de arroz y los tallos de hierbas y sírvalos."], "url": "www_bbc_co_uk_food_recipes_chipotle_miso_chicken_36830", "title": "Chipotle miso pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20cut% 20into% 20pieces", "200g / 7oz de mantequilla sin sal, ablandada, cortada en trozos pequeños", "200 g / 7 oz de azúcar en polvo de oro", "5 huevos de gallinas camperas, separados", "200 g / 7 oz de almendras molidas"], "method": ["Precaliente el horno a 180 ° C / 160 Ventilador / Gas 4. Engrase una lata de torta circular de fondo suelto de 23 cm / 9 pulg. Y forre con papel antigrasa.", "Derrita el chocolate en un tazón pequeño a prueba de calor colocado sobre una olla de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua.", "Coloque la mantequilla y el azúcar en un tazón grande y bata hasta que quede suave y cremoso. Agregue las yemas de huevo. Mezcle las almendras, luego doble ligeramente el chocolate derretido.", "Con un batidor de mano eléctrico, batir las claras de huevo en un recipiente de vidrio grande y limpio hasta que se formen picos fuertes. Incorporar a la mezcla de almendras. Cuchara en la lata preparada y nivelar la parte superior.", "Hornee durante 30-40 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio. Deje que se enfríe un poco en la lata, luego transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_chocolate_almond_caprese_27893", "title": "Torta Caprese de almendras y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_almond_caprese_27893_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "Azúcar en polvo de 55 g / 2 oz", "115g / 4oz de mantequilla sin sal, cortada en cubitos", "8 huevos de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "4 cucharadas de agua tibia", "Harina normal de 250 g / 9 oz, tamizada", "115gr / 4 oz de almendras molidas", "4 huevos de gallinas camperas, separados, más 2 yemas de huevo de gallinas camperas", "85g / 3oz de azúcar en polvo", "Chocolate claro de buena calidad 280g / 10oz, derretido", "Crema doble de 300 ml / ½ pinta, batida hasta que se formen picos rígidos cuando se retira la batidora", "Crema doble de 300 ml / ½ pinta", "licor de almendras", "Galletas amaretti duras 225g / 8oz, desmenuzadas", "violetas cristalizadas"], "method": ["Precalienta el horno a 170 ° C / 325 ° F / Gas 3. Engrasa y enharina tres latas para pasteles de 23 cm / 9 in.", "Para la base de galletas de mantequilla, tamice la harina en un bol, agregue el azúcar y frote la mantequilla. Presione la mezcla en la base de una de las latas de torta y hornéela en el horno durante 25-30 minutos o hasta que se dore.", "Para la esponja, aumente el horno a 190 ° C / 375 ° F / Gas 5. Batir los huevos y el azúcar hasta que estén pálidos y esponjosos, luego agregue el agua tibia. Mezcle la harina y las almendras molidas en un recipiente aparte y dóblelas en la mezcla de huevo, un tercio a la vez, con una cuchara grande de metal.", "Divida la mezcla entre las dos latas de pastel restantes y hornee durante 12-15 minutos o hasta que estén doradas, pero aún ligeramente elásticas en el medio. Convierte los pasteles en una rejilla para enfriar.", "Para la mousse, bata las seis yemas de huevo con el azúcar impalpable hasta que estén pálidas y esponjosas. (Reserve una cucharada de azúcar en polvo).", "Batir las cuatro claras de huevo en un recipiente limpio y luego doblar el azúcar impalpable restante.", "Dobla el chocolate derretido en la mezcla de yema de huevo, luego dobla la crema y finalmente las claras de huevo. Coloque la mezcla en el refrigerador para enfriar.", "Batir la crema en un recipiente hasta que se formen picos rígidos cuando se quite la batidora. Agregue el licor de almendras, al gusto.", "Para armar la torta, retire la base de torta dulce de la lata y colóquela en un plato para servir. Corta los bizcochos por la mitad horizontalmente y espolvoréalos con un poco de licor de almendras. Pipe o unte un poco de la mousse en el shortbread, agregue una capa de esponja, extienda sobre un mousse y esparza más de un cuarto de las galletas amaretti trituradas. Repita estas capas de esponja, mousse y amaretti y luego decore la torta con remolinos de crema batida. Encima de cada remolino con una violeta cristalizada."], "url": "www_bbc_co_uk_food_recipes_chocolate_amaretto_21084", "title": "Torta de mousse de amaretto y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]