[{"isVegetarian": false, "title": "Grilled mackerel with potato and onion mustard", "url": "www_bbc_co_uk_food_recipes_grilledmackerelwithp_73663", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fresh mackerel", "1 lemon, zest and juice only", "olive oil", "600g/1lb 5oz new potatoes", "1 tsp wholegrain mustard", "1 tbsp white wine vinegar", "1 big bulb of fennel, finely sliced", "1 red onion, finely sliced", "small bunch of flatleaf parsley, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a grill to a medium-high heat.", "Fillet the mackerel and remove all the rib bones. You can ask your fishmonger to do this for you.", "Season the mackerel well, squeeze a few drops of lemon juice and a sprinkling of zest over each fillet, and drizzle them with olive oil. ", "Place under the grill, skin side up, for five minutes. After five minutes turn them over to brown the meat which will be nearly cooked by now and should only need a minute or two. Set aside to rest. ", "To make the salad, boil the potatoes until firm but cooked, and cut them in half. Put them in a mixing bowl with a splash of olive oil, the rest of the lemon juice and zest, and the mustard and vinegar. ", "Mix together well, then add the finely sliced onion and fennel. Add a good amount of the parsley and season well. ", "Divide the salad between four serving plates to form a mound. Lay the mackerel fillets on top, and pour over the juices from the fish and the bottom of the salad bowl."]}, {"isVegetarian": true, "title": "Grilled mushrooms with goats' cheese and beetroot and walnut salsa", "url": "www_bbc_co_uk_food_recipes_grilledmushroomswith_85581", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledmushroomswith_85581_16x9.jpg", "ingredients": ["1 tbsp olive oil", "2 Portobello mushrooms", "100g/3½oz soft goats' cheese", "1 sprig thyme, leaves only", "2 tsp honey", "freshly ground black pepper", "½ garlic clove, finely sliced", "30g/1oz walnut halves", "4 small cooked beetroots, chopped", "¼ onion, finely chopped", "handful fresh parsley, chopped", "2 tsp balsamic vinegar", "2 tbsp olive oil", "30g/1oz walnut halves, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "For the grilled mushrooms, heat the olive oil in an ovenproof frying pan and fry the mushrooms on both sides for 2-3 minutes.", "Divide the goats' cheese equally among the mushrooms and sprinkle over the thyme, honey, black pepper, garlic and walnuts. Place under the grill and cook for 2-3 minutes, or until the cheese is melted and bubbling.", "For the beetroot and walnut salsa, place all the salsa ingredients in a large bowl and mix well.", "To serve, place the grilled mushrooms onto serving plates with a dollop of salsa."]}, {"isVegetarian": true, "title": "Grilled pear and spinach salad with halloumi", "url": "www_bbc_co_uk_food_recipes_grilledpearandspinac_83606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pear, cored and cut into 3 thick slices", "150g/5½oz halloumi, cut into 3 thick slices", "1 tbsp olive oil", "salt and freshly ground black pepper ", "½ lemon, juice only", "100g/3½oz spinach leaves", "1 tbsp red onion, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Add the pear slices and chargrill for one minute on each side, then remove and set aside.", "Rub the halloumi with some of the olive oil, then season both sides with salt and freshly ground black pepper. Place the halloumi onto the hot griddle pan and chargrill for 1-2 minutes on each side, until golden-brown grill lines have formed on the cheese, then remove and set aside.", "In a large bowl place the spinach and onion. Add the remaining oil and the lemon juice and toss to coat, then season with salt and freshly ground black pepper.", "To serve, place the salad in the middle of a large plate and serve the pear on the halloumi slices in three piles around."]}, {"isVegetarian": true, "title": "Grilled pear, watercress and walnut salad", "url": "www_bbc_co_uk_food_recipes_grilledpearwatercres_14534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 comice pears ", "150g/5½oz watercress ", "110g/4oz stilton ", "30g/1oz walnut halves ", "½ baguette", "15g/½oz chopped parsley ", "½ lemon, juice only ", "1½ tbsp walnut oil ", "1½ tbsp olive oil ", "½ tsp mustard ", "1 tbsp white wine vinegar ", "pinch of sugar ", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 190C/375F/Gas 5. ", "First heat a non-stick griddle pan until very hot. Cut the pear in half and remove the core. Brush the pear flesh with lemon juice. When the pan is hot place the pear on to the griddle pan and cook for 2-3 minutes. Turn over and cook the other side. When the pear is cooked and nicely marked remove from the pan. ", "Slice the bread into long strips and place on to an oven tray. Drizzle with a little olive oil, season with salt. Bake for 5 minutes until crisp and dry but not too brown. ", "Place the watercress on the serving plate and dot the pears around. Break the cheese into pieces and place over the top. Sprinkle over the walnuts and parsley. ", "Mix all the dressing together in a bowl and season. Add the strips of bread to the salad. Drizzle over the dressing and serve."]}, {"isVegetarian": false, "title": "Grilled marinated poussin with pickle salad", "url": "www_bbc_co_uk_food_recipes_grilledpoussinmarina_88732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white wine vinegar", "90ml/3½fl oz mirin (available from Asian supermarkets)", "50g/2oz caster sugar", "pinch salt", "12 Thai shallots, thinly sliced (available from Asian supermarkets)", "75g/3oz edamame beans, blanched (available from Asian supermarkets)", "6 tbsp chopped fresh coriander leaves ", "3 tbsp chopped fresh mint leaves ", "2 green chillies, finely sliced", "2 x 500g/1lb 2oz poussin", "1 tbsp grated fresh ginger ", "2 garlic cloves, chopped", "1 tbsp finely chopped shallot", "1 spring onion, roughly chopped", "2 tbsp plum wine (available from Asian supermarkets)", "110ml/4fl oz yaki niku barbecue sauce (available from Asian supermarkets)", "2 tsp teriyaki sauce (available from Asian supermarkets)", "½ tsp ao nori (available from Asian supermarkets)", "25ml/1fl oz olive oil", "75g/3oz mugi miso (available from Asian supermarkets)", "4 ume shu plums, from the plum wine (available from Asian supermarkets)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pickle salad, place the vinegar, mirin and sugar into a pan over a medium heat and bring to the boil. Reduce the heat and simmer for 2-3 minutes, or until the sugar is dissolved.", "Add the Thai shallots and remove from the heat. Leave to pickle for two hours at room temperature.", "Drain the shallots from the liquid, reserving the pickle solution for the dressing.", "Place the pickled Thai shallots, edamame beans, coriander, mint, and sliced green chilli into a clean bowl. Add two tablespoons of the pickle solution and mix well.", "For the poussin, using meat scissors or a sharp, heavy knife, cut each poussin into four pieces and place into a large bowl.", "Place all of the remaining poussin ingredients, except the plums, into a food processor and blend to a smooth paste.", "Roughly chop the plums and add to the marinade paste.", "Pour the marinade over the chicken and place in the fridge to marinate for one hour.", "Remove the poussins from the fridge and heat the grill to its highest setting.", "Heat a large griddle pan until hot, then add the poussin pieces, skin-side down, and cook for 3-4 minutes. Turn the poussin pieces over and cook for another 3-4 minutes.", "Transfer the poussin pieces to a grill tray lined with aluminium foil and baste with any remaining marinade.", "Place under the grill and cook for 12-15 minutes, basting 2 or 3 times with the marinade during cooking, until cooked through and caramelised. Test the meat by piercing with a skewer in the thickest part of the thigh. If the juices run clear the poussin is cooked. Leave to rest in a warm place for 4-5 minutes.", "To serve, place the poussin onto a large serving dish. Spoon the pickled salad over the poussin and serve."]}, {"isVegetarian": false, "title": "Grilled prawns with yoghurt and mint", "url": "www_bbc_co_uk_food_recipes_grilledprawnswithyog_92524", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red chillies, deseeded if you want less heat, roughly chopped", "2-3 large, juicy garlic cloves, roughly chopped", "fresh root ginger, peeled and cut into about 8 coin-shaped pieces", "sprinkling of whole black peppercorns", "good shake each of cumin seeds and coriander seeds", "good sprinkling of ground turmeric", "handful fresh coriander ", "handful fresh mint", "sachet of creamed coconut, or half a block of creamed coconut, grated ", "couple of handfuls of raw peeled tiger prawns", "handful each of fresh mint and coriander, roughly chopped (reserve a few extra mint leaves for  garnish)", "1 lime, zest only", "good dollop or two plain yoghurt"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the spice paste, place the chillies, garlic, ginger, peppercorns, cumin and coriander seeds and turmeric into a food processor and blend until roughly chopped. Add the fresh coriander and mint along with the creamed coconut and blend again to form a smooth paste that still has a little texture. ", "The paste will be quite thick at this point, so add just enough water so that it will coat the prawns. Toss the spice paste and prawns together in a bowl. You can leave to marinate overnight, covered with cling film in the fridge, if you wish.", "Heat a griddle pan until searingly hot. Meanwhile, making the dressing. Add the mint and coriander to a bowl with the lime zest (alternatively you could try using the zest of a lemon for the citrus note), then stir through the yoghurt. ", "Place the prawns onto the hot griddle pan and cook for 2-3 minutes on each side,  until opaque and pink in colour.", "Serve these immediately with the dressing and the reserved mint leaves. This spice paste is very versatile and can be used with chicken or fish."]}, {"isVegetarian": false, "title": "Grilled rack of lamb with mango salad and mint chutney", "url": "www_bbc_co_uk_food_recipes_grilledrackoflambwit_86209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp finely chopped raw papaya", "1 tbsp finely chopped garlic", "1 tsp finely chopped green chilli", "1 tsp ground fennel seeds", "1 tsp freshly ground black pepper", "1 tsp sweet paprika", "3 tbsp vegetable oil", "100ml/3½fl oz single cream", "55ml/2fl oz double cream", "2 tbsp gram flour (also called chickpea flour, available from some supermarkets and Asian grocers)", "2 tbsp pastis", "½ nutmeg, grated", "pinch salt", "2 x 8-bone racks of lamb, excess fat removed", "50g/2oz butter, melted", "200g/7oz fresh mint leaves", "2 tbsp finely chopped red onion", "2 tbsp lemon juice", "1 green chilli, seeds removed, chopped", "½ tsp salt", "½ tbsp vegetable oil", "4 tbsp Greek-style yoghurt", "2 green mangoes, finely sliced", "small handful fresh coriander", "handful watercress", "2.5cm/1in piece root ginger, grated", "1 tsp toasted cumin seeds, crushed", "1 tbsp lime juice", "1 tbsp olive oil", "½ tsp sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, place all of the lamb ingredients except for the lamb and the butter into a bowl and mix well. Rub the marinade onto the lamb to coat all over, then place into a large dish and set aside to marinate for two hours.", "Preheat the oven to 200C/400F/Gas 6.", "Shake off the excess marinade from the lamb and place into a roasting tin. Transfer to the oven and cook for ten minutes, then baste with the remaining marinade. Return to the oven for a further five minutes, or until the lamb is cooked to your liking. Drizzle over the melted butter and set aside in a warm place.", "For the mint chutney, bring a small pan of water to the boil. Add the mint leaves and return to the boil.", "Drain the mint leaves and place into a bowlful of iced water to refresh them, then drain again.", "Place the mint leaves into a food processor with the remaining mint chutney ingredients and blend until smooth.", "For the mango salad, place all the mango salad ingredients into a bowl and stir.", "To serve, carve the lamb into portions and place onto serving plates with a spoonful of the mango salad and a dollop of mint chutney."]}, {"isVegetarian": false, "title": "Grilled red mullet with squid, flatleaf parsley and capers", "url": "www_bbc_co_uk_food_recipes_grilledredmulletwith_83924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch flatleaf parsley, leaves picked", "2 shallots, thinly sliced", "25g/1oz black olives", "25g/1oz piquillo peppers, peeled and cut in strips", "10g/½oz fine capers", "1 lemon, cut into segments", "20g/¾oz orzo pasta, cooked in saffron stock, cooled", "50ml/2fl oz extra virgin oil", "salt and freshly ground black pepper", "8 red mullet fillets, scaled and pin-boned", "1 tbsp extra virgin olive oil", "200g/7oz baby squid, cleaned", "3 cloves garlic, peeled, sliced and blanched", "1 tbsp extra virgin olive oil", "175ml/6fl oz 3-year-old Banyuls wine, reduced to 1 tbsp"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill.", "Mix the parsley, shallots, olives, peppers, capers and lemon in a bowl. Combine with the orzo.", "Drizzle in a little olive oil and season with salt and black pepper to taste. Mix thoroughly.", "Place the red mullet fillets on a baking tray brushed with a little of the olive oil. ", "Brush the top of the fillet with a little more oil and season with salt and pepper.", "Place under the grill and cook for one to two minutes.", "Heat a heavy pan with a little olive oil in it until smoking. Quickly sear the squid and garlic slices.", "Season with salt and black pepper and remove from the heat then place on kitchen paper to drain.", "Add the squid to the parsley salad and divide among the four plates. ", "Place two fillets on each plate resting on the parsley salad.", "Pour a little extra virgin oil around the plate and finally a drizzle of reduced wine. Serve at once."]}, {"isVegetarian": false, "title": "Grilled salmon, braised cabbage with bacon and onions", "url": "www_bbc_co_uk_food_recipes_grilledsalmonbraised_14513", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsalmonbraised_14513_16x9.jpg", "ingredients": ["15g/1oz unsalted butter ", "2 small red onions, sliced ", "2 rashers back bacon, sliced thinly ", "olive oil ", "4 x 170g/6oz salmon steaks ", "salt and freshly ground black pepper ", "1 small savoy cabbage , core removed and shredded", "2 tbsp grainy mustard ", "½ lemon, juice only ", "1 tsp chopped parsley ", "1 tbsp white wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a large pan, add the onion and fry gently for five minutes. ", "Brush each side of the salmon with olive oil. Heat a non-stick frying pan, when hot add the salmon and leave to seal in the pan. Turn over halfway through cooking. ", "Add the shredded cabbage to the bacon and onions and stir. Cover with a tight fitting lid and continue to cook for 10 minutes, stirring occasionally. This will ensure the cabbage will absorb the butter and retain moisture. ", "Combine all the dressing ingredients together in a jar with a tight-fitting lid and shake to combine thoroughly. (You can also do this in a bowl with a fork.)", "At the end of cooking, season, then serve in a large bowl placing the salmon on top. Spoon the dressing around the edge. "]}, {"isVegetarian": false, "title": "Grilled salmon Niçoise", "url": "www_bbc_co_uk_food_recipes_grilledsalmonnicoise_67919", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsalmonnicoise_67919_16x9.jpg", "ingredients": ["900g/2lb very fresh salmon fillet", "1 tbsp cracked black peppercorns", "salt", "2 tbsp light olive oil", "1 yellow pepper", "½ tbsp vegetable oil", "8-12 cooked new potatoes", "2 plum tomatoes", "175g/6 oz green beans, cooked", "20 olives", "salt and pepper", "2 tbsp virgin olive oil", "2 tbsp chopped parsley", "flat leaf parsley, to garnish", "½ tsp salt", "1 ½ tbsp Dijon mustard", "4 tsp lemon juice", "1 garlic clove, crushed", "5 drops Tabasco sauce", "4 anchovy filets", "110ml4fl oz light olive oil", "1 egg, yolk only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Discard the skin of the salmon, and cut it into 4 equal steaks.  Sprinkle each steak with salt and black pepper, pressing it firmly into the steaks with your hand.  Coat lightly in oil, and refrigerate until ready to cook.", "Rub the yellow pepper with a little vegetable oil, and grill or roast until the skin is well blistered.  Allow to cool, and then peel off the charred skin, remove the seeds, slice into 8 pieces, and place in a bowl. Cut the tomatoes into 6 wedges each, and slice the new potatoes if they seem very large.  ", "Combine all the vegetables, season lightly with salt and pepper, and toss with the olive oil, and parsley.  Leave to come to room temperature.", "To make the dressing, combine all the dressing ingredients in a blender, and pulse until smooth and emulsified.", "To cook the salmon, heat a large grill pan, (preferably cast iron) over high heat until almost smoking.  Add the salmon, and sear for 1-3 minutes on each side. ", "To serve, divide the vegetables among the plates, and place a salmon steak in the centre of each.  Surround with a generous drizzle of the dressing, and serve at once."]}, {"isVegetarian": false, "title": "Grilled salmon with mushy peas", "url": "www_bbc_co_uk_food_recipes_grilledsalmonwithmus_84945", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "100g/3½oz salmon fillet, skin on", "salt and freshly ground black pepper", "30g/1oz butter", "100g/3½oz fresh or frozen peas", "1 tbsp white wine vinegar", "splash extra virgin olive oil", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan. Season the salmon with salt and black pepper and add to the hot frying pan, skin-side down. Cook for 2-3 minutes on one side, before turning over and frying for 1-2 minutes on the other side.", "To make the mushy peas, melt the butter in a saucepan. Add the peas, vinegar and a splash of hot water and cook for 3-4 minutes, or until the peas are soft. ", "Add the extra virgin olive oil and salt and freshly ground black pepper to taste and mash roughly.", "To serve, put the mushy peas on a plate and top with the salmon, skin-side up. Garnish with lemon wedges and  serve straightaway."]}, {"isVegetarian": false, "title": "Grilled sardines with sauce vierge, pan-fried Jersey Royals and salad", "url": "www_bbc_co_uk_food_recipes_grilledsardineswiths_86471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 sardines, cleaned and gutted", "salt and freshly ground  black pepper", "200g/8oz Jersey Royal potatoes, scrubbed and parboiled", "1 tbsp olive oil", "salt and freshly ground black pepper", "100ml/3½fl oz extra virgin olive oil", "1 lemon, juice only", "2 tomatoes, skins and seeds removed, finely chopped", "1 shallot, finely chopped ", "1 small garlic clove, finely chopped ", "2 tbsp roughly chopped fresh tarragon ", "2 tbsp roughly chopped fresh basil ", "2 tbsp roughly chopped fresh dill", "salt and freshly ground black pepper", "110g/4oz mixed salad leaves", "3 tbsp extra virgin olive oil", "1 tbsp balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "For the sardines, remove the head from the sardines, then cut open along the belly from the head end to the tail and open out, flesh-side down. Press down along the body with the heel of your hand, then turn the fish over and lift out the bones. Make a slit next to the gills and tuck the tail into the slit, forming a circle.", "Place the sardines onto a grill tray and season with salt and freshly ground black pepper. Place under the grill for 3-4 minutes, or until completely cooked through.", "Meanwhile, for the pan-fried Jersey Royals, heat a frying pan until hot and add the potatoes and olive oil. Fry for 3-4 minutes until golden and crisp, then season with salt and freshly ground black pepper.", "For the sauce vierge, place the extra virgin olive oil into a pan and whisk in the lemon juice. Add the tomatoes, shallot and garlic and place on the heat to just warm through. Remove from the heat, add the herbs and season with salt and freshly ground black pepper.", "For the salad, place the salad leaves into a bowl, drizzle over the balsamic vinegar and the olive oil and stir.", "To serve, divide the pan-fried potatoes among four plates and top each with three grilled sardines. Spoon over the warm sauce vierge and place the dressed salad leaves alongside."]}, {"isVegetarian": false, "title": "Grilled scallops", "url": "www_bbc_co_uk_food_recipes_grilledscallops_79884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 scallops, cleaned, shells retained", "cayenne pepper, to sprinkle", "1 tbsp polenta", "3 lime slices", "1 tbsp chopped fresh mint ", "splash Tabasco sauce", "squeeze lime, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to the highest setting.", "Place the scallops in their shells. Sprinkle the scallops with the cayenne pepper and polenta and place a lime slice on top of each.", "Place the scallops under the grill for 3-4 minutes, until cooked through.", "Sprinkle with the mint and Tabasco sauce, to taste. Drizzle with a squeeze of lime and serve immediately."]}, {"isVegetarian": false, "title": "Grilled scallops with fresh black truffle brown butter vinaigrette", "url": "www_bbc_co_uk_food_recipes_grilledscallopswithf_10372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 fresh scallops, cleaned, corals removed", "20g/1oz fresh black truffle, cleaned, sliced into 20 thin slices, plus extra, finely chopped", "1tbsp oil", "250g/9oz butter", "400g/14oz mixed green salad leaves, washed", "1 tbsp olive oil", "1 tsp balsamic vinegar", "salt and freshly ground black pepper", "1 tsp sherry vinegar", "Note: This recipe originally uses Australian measurements. Equivalent measurements are as accurate as possible."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Make a slit in the side of  each scallop and insert one slice of truffle. ", "Heat the oil  in a frying pan over a high heat, add the scallops and fry for 1-2 minutes on one side, or until golden-brown", "Heat the butter in a separate frying pan over a low heat until brown. Strain through a fine sieve.", "Add the sherry vinegar and a little finely chopped truffle to the sieved brown butter and mix well with a whisk.", "Meanwhile, place the salad leaves into a bowl. Add the olive oil and  balsamic vinegar. Stir well and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the salad leaves between four serving plates. Arrange the scallops around the salad on each plate and spoon around some of the brown butter."]}, {"isVegetarian": false, "title": "Grilled sesame prawns with red pepper and garlic dressing", "url": "www_bbc_co_uk_food_recipes_grilledsesameprawnsw_88888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "1 red pepper, chopped", "100ml/3½fl oz white wine", "½ tsp sea salt", "2 king prawns, shells removed, de-veined", "1 tbsp sesame seeds", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the red pepper and garlic dressing, heat the oil in a frying pan over a medium and fry the onion and garlic for 4-5 minutes, until soft but not coloured.", "Add the red pepper and stir well, then pour in the wine and add the salt. Boil for 5-7 minutes, until the dressing is beginning to reduce and the red pepper is tender.", "For the prawns, roll the prawns in the sesame seeds to completely coat.", "Heat a griddle pan and drizzle with the oil. Add the prawns and cook for two minutes on each side, until completely cooked through .", "To serve, spoon the red pepper and garlic dressing onto a plate and place the sesame prawns on top."]}, {"isVegetarian": false, "title": "Grilled sirloin with roast garlic, pancetta, thyme butter and sweet garlic kale", "url": "www_bbc_co_uk_food_recipes_grilledsirloinwithro_89046", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cloves garlic", "olive oil", "2 sprigs fresh thyme, leaves only", "75g/2½oz butter, softened", "salt and freshly ground black pepper", "2 pancetta rashers, chopped", "1 tbsp olive oil", "200g/7oz sirloin steak", "15g/½oz butter", "1 clove garlic, finely chopped", "large handful fresh kale, chopped", "salt and freshly ground black pepper ", "dash olive oil", "4 cherry tomatoes, halved", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the garlic butter, place the garlic, olive oil, thyme, salt and freshly ground black pepper onto a small square of aluminium foil and fold up to make a parcel. Place into the oven and roast for 15 minutes, or until the garlic is soft. ", "Squeeze the garlic flesh from the skins into a bowl with the thyme leaves, softened butter, salt and freshly ground black pepper and mix until well combined.", "Fry the pancetta in a frying pan until crisp, then add to the butter and mix well. Shape the butter mixture into a thick log and wrap in baking paper and cling film. Place into the freezer for ten minutes, or until firm. Once firm, cut into thick slices.", "For the sirloin, rub the sirloin with the olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until smoking, add the steak and fry for 3-4 minutes on each side (for rare), or until cooked to your liking. Remove the steak from the pan and leave to rest for five minutes on a warm plate.", "For the kale, melt the butter in a saucepan, add the garlic and fry for one minute, then add the kale and fry for 2-3 minutes, or until wilted. Season with salt and freshly ground black pepper. ", "For the garnish, heat a dash of olive oil in a frying pan, season the tomato halves with salt and freshly ground black pepper and then fry for 2-3 minutes, or until just softened.", "To serve, pile the kale onto a serving plate and top with the steak. Place a slice of garlic butter on top of the steak and spoon the cherry tomatoes onto the side of the plate."]}, {"isVegetarian": false, "title": "Grilled snapper with crisp noodle cake with roast peppers and garlic", "url": "www_bbc_co_uk_food_recipes_grilledsnapperwithcr_92401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red snapper, filleted, skin of one fillet scored several times with a sharp knife (the second fillet can be used in another recipe) ", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 whole fresh chives, to serve", "1 handful egg noodles, cooked according to packet instructions, drained", "1 tbsp sesame oil", "1 tbsp soy sauce", "2 tbsp olive oil", "½ red pepper", "2 garlic cloves, peeled, chopped", "1 tbsp extra virgin olive oil", "1 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the grilled snapper, season the flesh, to taste, with salt and freshly ground pepper. Heat the oil in a griddle pan over a high heat. When the oil is smoking, cook the fish, skin-side down, for 2-3 minutes. Turn over the fish, turn off the heat and let the fish finish cooking in the residual heat of the pan.", "For the crisp noodle cake, mix the noodles with the sesame oil and soy sauce in a bowl. Transfer the noodles to a small frying pan and press down with the back of a wooden spoon into a 'cake'. Fry for 8-10 minutes, turning the cake over halfway through cooking.", "For the roast peppers and garlic, drizzle the olive oil over the pepper half and scatter over the chopped garlic.  Roast the pepper in the preheated oven for 8-10 minutes. ", "Remove the pepper from the oven, chop into pieces and mix with the extra virgin olive oil and balsamic vinegar.", "To serve, place the noodle cake onto a plate and top with the pepper and then the fish. Garnish with the whole chives."]}, {"isVegetarian": false, "title": "Grilled squid with lime and thyme", "url": "www_bbc_co_uk_food_recipes_grilledsquidwithlime_88966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large garlic clove", "small handful fresh thyme leaves", "2 tbsp olive oil", "450g/1lb cleaned squid bodies and tentacles", "2 limes, juice only", "2 tbsp olive oil", "2 sprigs thyme, leaves only", "sea salt, to taste"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the squid, peel the garlic and place it in a pestle and mortar. Crushto a paste, add the thyme and crush again. Add the olive oil and mix together.", "Rinse the squid thoroughly and shake dry. Cut each squid body down one side so that it opens out flat. Use a small, very sharp knife to score the flesh on one side in a criss-cross pattern, taking care not to cut all the way through.", "Place the scored squid bodies and the tentacles into a bowl. Add the garlic, thyme and olive oil mixture, mix well and set aside to marinate for at least half an hour.", "For the dressing, place the lime juice, olive oil and thyme leaves into a clean screw-top jar. Screw the lid on tightly then shake the jar vigorously to mix the dressing.", "Heat a griddle pan over a high heat until smoking. Add the squid and griddle for 30 seconds on both sides (the squid bodies will probably curl up during cooking) or until just cooked through and lightly charred in places. Take care not to overcook the squid.", "To serve, divide the squid between two serving plates, pour over the dressing and season, to taste, with flakes of sea salt. Serve at once."]}, {"isVegetarian": false, "title": "Teriyaki chicken with leek and pepper stir-fry", "url": "www_bbc_co_uk_food_recipes_grilledteriakichicke_80048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledteriakichicke_80048_16x9.jpg", "ingredients": ["1 tbsp sesame oil", "1 tbsp honey", "1 tbsp soy sauce", "100g/3½oz chicken thigh meat, scored with a sharp knife", "1 tbsp olive oil", "1 garlic clove, thinly sliced", "¼ leek, sliced into long thin strips", "¼ red pepper, sliced into long thin strips"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the chicken, mix the sesame oil, honey and soy sauce together in a large bowl. Cover the chicken in the marinade and leave for 5 minutes.", "Heat a frying pan until hot. Remove the chicken from the marinade, reserve the marinade mixture. Fry the chicken for 2-3 minutes on each side. Transfer the chicken to the oven and roast for 5 minutes, or until cooked through. ", "To make the stir-fry, heat the oil in a small frying pan. Add the garlic, leeks and pepper and cook until soft. Pour in the marinade mixture and bring to a simmer, continue to cook until the mixture is thick. ", "Spoon the stir fried vegetables into the centre of a plate, put the chicken on top and serve. "]}, {"isVegetarian": false, "title": "Grilled spiced trout with lemon soy vinaigrette and herbed couscous", "url": "www_bbc_co_uk_food_recipes_grilledspicedtroutwi_90403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lemon, zest only", "1 trout fillet, skin removed", "½ tsp cumin seeds", "salt and freshly ground black pepper", "2 tbsp olive oil", "3 spring onions, trimmed and halved lengthwise", "½ tomato", "2 tbsp soy sauce", "½ lemon, zest and juice only", "150g/5½oz couscous", "300ml/10fl oz vegetable stock", "2 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh dill ", "½ tomato, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the trout, rub the lemon zest into the flesh of the trout. Place the cumin seeds, salt and freshly ground black pepper into a pestle and mortar and grind together until well combined. Reserve half a teaspoon for the vinaigrette and sprinkle the rest over the fish. ", "Heat the olive oil in a griddle pan and add the trout, spring onions and tomato half. Griddle the trout for 2-3 minutes on both sides, or until golden-brown and cooked through. ", "For the vinaigrette, place the soy sauce, lemon zest and juice and the reserved cumin mixture into a small bowl and whisk well to combine. ", "For the couscous, pour the stock over the couscous in a bowl and allow to soak for 5-7 minutes, or until all of the liquid is absorbed. Fluff the grains up with a fork and stir in the rest of the couscous ingredients.", "To serve, spoon the couscous onto a serving plate and arrange the trout on top. Place the grilled spring onions and tomato half to the side, drizzle over the vinaigrette and serve."]}, {"isVegetarian": false, "title": "Grilled tiger prawns and spinach salad with red pepper dressing", "url": "www_bbc_co_uk_food_recipes_grilledtigerprawnsan_90111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 lemon, juice only", "2 tbsp chopped fresh parsley", "2 tbsp chopped fresh basil", "2 tbsp chopped fresh chives", "3 tiger prawns, peeled and de-veined, heads and tails left on", "1 handful baby spinach", "1 red pepper", "3 tbsp olive oil", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak a wooden skewer in cold water for ten minutes. ", "For the prawns, mix the olive oil, lemon juice and herbs together in a bowl and add the prawns. Toss to coat, then leave to marinate for 5-10 minutes. ", "Thread the prawns onto the skewer and cook on a hot chargrill pan for 1-2 minutes on both sides, or until the prawns are pink and cooked through.", "For the salad, place the spinach in the centre of a serving plate. ", "For the red pepper dressing, place the red pepper under a grill unit's highest setting. Turn occasionally, until blackened all over. Allow to cool before peeling off the skin, then chop the flesh and place into a food processor along with the remaining dressing ingredients. Blend until smooth. ", "To serve, place the prawn skewer on top of the spinach and spoon the dressing around the edges of the plate."]}, {"isVegetarian": true, "title": "Grilled vegetable and halloumi skewers with warm salsa verde", "url": "www_bbc_co_uk_food_recipes_grilledvegetableswit_91417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14¼oz halloumi cheese, cut into chunks", "1 red pepper, seeds removed, cut into chunks", "1 green pepper, seeds removed, cut into chunks ", "1 yellow pepper, seeds removed, cut into chunks ", "1 red onion, cut into wedges", "1 courgette, cut into chunks", "2 tbsp olive oil", "½ bunch fresh parsley", "½ bunch fresh tarragon", "½ bunch fresh chervil", "2 tbsp capers, drained", "2 garlic cloves, roughly chopped", "150ml/5¼fl oz olive oil", "mixed salad leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the skewers, thread alternating pieces of halloumi, pepper, onion and courgette onto eight wooden skewers. Brush with olive oil and heat a griddle pan until smoking. Cook the skewers on the hot griddle for about two minutes on each side.", "For the salsa verde, place the parsley, tarragon, chervil, capers, garlic and olive oil into a small food processor. Blend until smooth.", "Place two skewers per person onto each of four plates. Drizzle some of the salsa verde onto each and serve with mixed salad leaves."]}, {"isVegetarian": false, "title": "Grouse with roasted pumpkin, Jerusalem artichoke and beetroot", "url": "www_bbc_co_uk_food_recipes_grouse_with_roasted_45527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 grouse, prepared and wrapped in bacon ", "1 tbsp vegetable oil", "50g/2oz celeriac, chopped into 1cm/½in dice", "50g/2oz carrots, chopped into 1cm/½in dice", "50g/2oz celery, chopped into 1cm/½in dice", "10 baby onions", "2 sprigs fresh thyme", "1 tbsp brandy ", "250ml/9fl oz chicken stock", "sea salt and freshly ground black pepper", "2 beetroot, peeled and quartered", "sea salt and freshly ground black pepper", "4 Jerusalem artichokes", "½ lemon, juice only", "1kg/2lb 2oz pumpkin, peeled, seeds removed", "olive oil, for frying", "50g/2oz hazelnuts, roughly chopped", "2 shallots, finely chopped", "1 tbsp chopped chives", "50ml/2fl oz hazelnut oil", "1 tsp sherry vinegar, or to taste", "handful watercress sprigs"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Take the grouse out of the fridge so that they can come to room temperature before you start cooking. ", "Preheat the oven to 200C/400F/Gas 6. ", "Heat the vegetable oil in a large heavy-bottomed roasting tin. Season the grouse well, inside and out, then sear them in the tin until golden brown all over. ", "Add the diced vegetables, baby onions and thyme sprigs to the tin. ", "Place the grouse on one breast and roast in the hot oven for 3-4 minutes.", "Flip the birds onto the other breast and roast for another three minutes. ", "Pour brandy into the cavity of both birds and place them on their back to finish roasting – another five minutes. ", "Remove the tin from the oven and leave the grouse to rest for 10 minutes, out of the tin, breast upwards so the juices are evenly distributed. Remove the vegetables with a slotted spoon for later use, and set aside all the pan juices.", "Put the roasting tin back on the heat on top of the stove and begin to reduce the cooking juices. ", "Add the chicken stock, bring to the boil and let the sauce reduce and thicken. ", "Take off the heat and pass through a fine sieve - keep warm until ready to serve.", "For the roasted vegetables, heat the oven to 180C/350F/Gas 4. ", "Place the beetroot quarters into a saucepan and pour in enough water to cover. Add salt and bring to the boil. ", "Simmer for 30 minutes or until the beetroot is nearly cooked. Drain and set aside. ", "Meanwhile, peel the Jerusalem artichokes, cut them in half and immerse in a bowl of cold water with the lemon juice added to stop them discolouring. ", "Cut the pumpkin into thick moon-shaped slices. ", "Heat a large non-stick ovenproof frying pan (or a cast-iron roasting pan) over a medium-high heat and add a drizzle of olive oil. ", "Place the pumpkin and Jerusalem artichokes into the pan, season with salt and cook for 3-4 minutes, until they start to colour. ", "Transfer the whole pan to the oven and roast for 15 minutes. ", "Cut the par-cooked beetroot into wedges, add to the pan and cook in the oven for a further five minutes. ", "Meanwhile, make the dressing. Combine the chopped hazelnuts, shallots, chives and hazelnut oil in a bowl. Add a splash of sherry vinegar and season with salt and pepper to taste. ", "To serve, once the grouse have rested, carve the legs and breast meat onto a plate and spoon over the pan juices. ", "Serve the roasted vegetables alongside with the dressing and watercress on top."]}, {"isVegetarian": true, "title": "Gruyère dauphinoise", "url": "www_bbc_co_uk_food_recipes_gruyeredauphinoise_83967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large potato, very finely sliced", "1 garlic clove, very finely sliced", "200ml/7fl oz double cream", "50ml/2fl oz milk", "55g/2oz Gruyère cheese, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the potato, garlic, cream and milk into a saucepan and heat gently for five minutes.", "Pour into a gratin dish and sprinkle over the Gruyère. Place into the oven and bake for 12 minutes, remove from the oven, then let it sit for five to ten minutes before serving."]}, {"isVegetarian": false, "title": "Gruyère and bacon soufflé", "url": "www_bbc_co_uk_food_recipes_gruyre_and_bacon_souffl_24627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz milk ", "2 sprigs fresh thyme", "1 bay leaf ", "1 pinch ground nutmeg", "1 tbsp olive oil", "150g/5oz heavily cured bacon, finely chopped", "65g/2½oz butter, plus extra for greasing", "55g/2oz plain flour ", "pinch English mustard powder", "5 free-range eggs, separated", "salt and freshly ground black pepper ", "2 tbsp fresh chopped chives", "300ml/11oz double cream", "110g/4oz gruyère cheese, very finely grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 (convection mode) and generously grease six ramekins of 7cm x 4cm/2¾in x 1½in.", "Place the milk in a saucepan, add the thyme, bay leaf and nutmeg, and bring to a simmer.", "Turn off the heat and leave to infuse for a few minutes.", "Heat a frying pan until hot, add the olive oil and bacon and cook until crisp. Remove and place on a plate lined with kitchen paper.", "Melt the butter in a saucepan and add the flour and mustard. Cook for a couple of minutes until a nutty aroma is released.", "Strain the milk and add it to the saucepan containing the flour and mustard. Whisk continuously until thick, then beat in the egg yolks and season with salt and freshly ground black pepper. Allow to cool slightly.", "Whisk the egg whites in a clean bowl until firm, adding a pinch of salt.", "Add one-third of the egg white to the soufflé base mix and beat in. Stir in the chives and then carefully fold in the remaining egg whites. Spoon the mixture into the buttered ramekins and bake for 5-7 minutes, or until the tops begin to brown.", "To serve, preheat the grill to high.", "Warm the cream in a saucepan and season with salt and freshly ground black pepper. Increase the temperature and cook until the volume of liquid has reduced by one-third.  ", "Add the crispy bacon and mix well, then add salt and pepper, to taste. Pour the cream into six serving bowls and turn the soufflés out onto the cream.  ", "Cover the soufflés with the grated gruyère cheese and place under the grill. Once golden-brown and bubbling, remove from the grill and serve immediately."]}]