[{"ingredients": ["250g / 9oz de harina blanca fuerte, más extra para enharinar", "5g / ¼ oz de sal", "30ml / 1fl oz de aceite de oliva", "Levadura de acción rápida de 5 g / ¼ oz", "180ml / 6fl oz de agua", "sémola, para quitar el polvo (opcional)", "1 cebolla pequeña, cortada finamente y ligeramente frita en aceite hasta que esté caramelizada", "75-100 g / 2½ oz-3½ oz de gorgonzola (o un queso azul vegetariano similar)", "4 rebanadas de jamón", "2 higos maduros, cortados en cuartos", "pequeño pecorino rallado", "rociar aceite de oliva", "pizca de vinagre balsámico de buena calidad", "sal y pimienta negra recién molida", "puñado de cohetes"], "method": ["Para la masa de pizza, mezcle la harina, la sal, el aceite de oliva, la levadura y el agua en un tazón.", "Convierta la masa en una superficie de trabajo engrasada y amase durante 5-10 minutos, o hasta que la masa esté suave y elástica. Corta un trozo pequeño de la masa y estira la parte lo más finamente que puedas. Si puede ver la sombra de sus dedos a través de la masa, la luz debe brillar a través de la masa como un cristal de ventana, sin que la masa se rompa, está lista para probar.", "Forme la masa en forma de bola y colóquela en un tazón.", "Cubra con una toalla de té húmeda y deje que se levante durante una hora.", "Divida la mezcla en tres bolas. Estirar en una superficie enharinada en círculos. Coloque cada círculo en una bandeja de horno plana o una tabla de cortar de plástico espolvoreada con sémola (para que la pizza pueda transferirse fácilmente al horno más adelante).", "Coloque una piedra para pizza o una bandeja para hornear boca arriba en el horno y caliente el horno a 220C / 425F / Gas 7 (en un horno sin ventilador).", "Para el relleno, cubrir las bases con las rodajas de cebolla y espolvorear sobre el gorgonzola desmenuzado. Coloque los cuartos de jamón y de higos encima y espolvoree con el pecorino.", "Rocíe un poco de aceite de oliva y una pizca de vinagre balsámico. Sazonar con sal y pimienta negra recién molida.", "Cuando esté listo para hornear, deslice la pizza directamente sobre la piedra para pizza caliente o la bandeja para hornear y hornéela en el horno durante 8-10 minutos, o hasta que la base esté dorada y la cubierta burbujee.", "Servir con hojas de cohete en la parte superior."], "url": "www_bbc_co_uk_food_recipes_fig_prosciutto_and_90004", "title": "Higo, prosciutto y pizza gorgonzola", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15g de sal de mesa por kilo de patas de pato", "2 cucharaditas de hojas de tomillo", "2 cucharaditas de romero, finamente picado", "2 dientes de ajo, pelados y finamente picados", "4 patas de pato", "600ml / 20fl oz de grasa de pato", "2 hojas de laurel", "Harina normal de 250g / 9oz", "½ cucharadita de sal", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "125ml / 4fl oz de agua helada", "Azúcar en polvo de 110 g / 4 oz", "110g / 4oz de mantequilla", "4 higos, pelados, sin núcleo, cortados por la mitad", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "Tocino de tocino 150 g / 5½ oz", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado", "1 zanahoria pequeña, finamente picada", "1 apio en barra, finamente picado", "¼ de puerro, finamente picado", "300 g / 10½ oz de lentejas Puy secas", "175ml / 6fl oz de vino tinto", "450ml / 16fl oz de caldo de carne", "2 cucharadas de buen vinagre de Jerez", "2 cucharadas de cilantro fresco", "50g / 1¾oz de mantequilla", "4 cucharadas de miel clara", "Jus de ternera 200 ml / 7 fl oz, o carne de vacuno reducida"], "method": ["Para el confit de pato, precalentar el horno a 140C / 120C Fan / Gas 1.", "Mezcle la sal, las hierbas y el ajo en un tazón. Agregue las patas de pato, cúbralas en la mezcla. Cubra el recipiente y déjelo en la nevera durante 24 horas.", "Enjuague la mezcla de sal de las patas de pato. Ponlos en una olla a prueba de horno con la grasa de pato y las hojas de laurel. Ponga la sartén a fuego lento, tape y coloque en el horno durante 2 horas y media. Retire del horno, levante las patas de pato de la grasa y déjelas a un lado.", "Para la pasta de hojaldre áspera, coloque la harina y la sal en un tazón grande. Agregue la mantequilla y use sus manos para frotar la mantequilla en la harina.", "Cuando la mezcla de harina y mantequilla se asemeje a pan rallado, agregue el agua fría. Mézclalo con un cuchillo de punta redonda para mantener la mezcla fresca. Cuando la mezcla se una para formar una masa, colóquela en una superficie de trabajo enharinada limpia y amasar brevemente hasta que quede suave.", "Forme la masa en un bloque rectangular (esto facilitará el despliegue más adelante), envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enrolle la masa sobre una superficie de trabajo enharinada limpia en un rectángulo de aproximadamente 40x20cm / 16x8 pulgadas.", "Tome uno de los bordes cortos de la masa y doble un tercio de la masa en el centro, luego doble el otro tercio sobre eso. Gire la pastelería 90 grados y repita la laminación y el plegado.", "Envuelva la masa en una película adhesiva, refrigere por 20 minutos, y luego repita el laminado y doblado.", "Envuelva el bloque de repostería en una película adhesiva y refrigere por 30 minutos más antes de usar.", "Para la tarta de higos, precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente el azúcar en una sartén a prueba de horno de 24 cm / 9½ pulgadas a fuego lento hasta que se haya caramelizado. Agregue la mantequilla y caliente suavemente hasta que la mezcla forme un caramelo suave. Apague el fuego y coloque cuidadosamente los higos en el caramelo caliente, con el lado cortado hacia arriba.", "Pase el pastel frío sobre una superficie de trabajo enharinada a un grosor de 5 mm / ¼. Corta la masa en un círculo ligeramente más grande que la sartén.", "Coloque el círculo de repostería sobre los higos. Meta los bordes de la masa dentro de la sartén para rodear los higos.", "Transfiéralo al horno y hornea por 20-25 minutos, o hasta que la masa se levante, dorada y cocida. Retire del horno y deje enfriar por 5-10 minutos.", "Para las lentejas, caliente una sartén y agregue la mantequilla y el aceite. Una vez caliente, agregue los lardons de tocino y cocine hasta que estén ligeramente dorados, luego agregue la cebolla y cocínelos por 2 minutos, agregue el ajo, la zanahoria, el apio y el puerro y cocínelos por otros 2 minutos.", "Agregue las lentejas y el vino tinto y deje que hierva. Cocine hasta que el vino haya reducido el volumen a la mitad, luego agregue el caldo y cocínelo por 25-30 minutos. Termine con el vinagre de Jerez y el cilantro fresco.", "Cuando esté listo para servir, caliente una sartén mediana y agregue la mantequilla, una vez caliente agregue el pato y el color en ambos lados y agregue la miel y el glaseado.", "Afloje los bordes de la tarta y coloque un plato grande o tablero en la parte superior de la sartén. Con mucho cuidado, pero rápidamente, voltéelo, usando una toalla de té doblada para ayudarlo a sostenerlo, y permita que la tarta tatin caiga suavemente sobre el plato de servir.", "Coloque las lentejas cocidas en un tazón para servir y coloque el pato encima. Termine con el jus o stock."], "url": "www_bbc_co_uk_food_recipes_fig_tart_tatin_with_10491", "title": "Tatin de tarta de higo con pato confitado glaseado con miel y lentejas de Puy", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110 g / 4 oz de mantequilla sin sal, más extra para engrasar", "Harina normal de 225 g / 8oz, más extra para hacer harina", "pizca de sal", "2 cucharadas de azúcar en polvo", "2 cucharadas de almendras molidas", "1 huevo de gallinas camperas, ligeramente golpeado", "2-3 cucharaditas de agua fría", "275g / 10oz% 20dark% 20chocolate,% 20min% 2070 %% 20cocoa% 20solids", "3 huevos medianos de granja", "40 g / 1½ oz de azúcar en polvo", "Crema doble de 60 ml / 2½ fl oz", "8 higos frescos", "Frambuesas 250 g / 9 oz", "2 cucharadas de azúcar glas", "1 cucharada de jugo de limón", "helado de chocolate blanco confeccionado", "ramitas de menta fresca, para adornar"], "method": ["Para la masa, coloque la mantequilla, la harina, la sal, el azúcar impalpable y las almendras molidas en un procesador de alimentos y mezcle hasta que la mezcla se asemeje a finas migas de pan.", "Agregue el huevo batido y 2-3 cucharaditas de agua fría y mezcle hasta que se forme una masa.", "Con las manos enharinadas, saque la masa del procesador de alimentos y amasar muy suavemente para unir. Aplane la masa ligeramente, cubra con una película adhesiva y colóquela en el refrigerador para que descanse durante al menos 30 minutos, preferiblemente de 1 a 2 horas.", "Precalentar el horno a 190C / 375F / Gas 5.", "Engrase ligeramente las cajas agrietadas de 4 x 10 cm / 4 pulg con mantequilla.", "Enharina ligeramente la superficie de trabajo y divida la masa en cuatro. Estirar cada pieza de masa para que sea un poco más grande que las cajas de tartas.", "Coloque la masa en cada caja de tarta y empuje en los bordes, dejando el exceso de pastelería colgando sobre la parte superior. Coloque una hoja de papel para hornear en cada caja y llénela con alubias o arroz.", "Coloque las cajas de tarta en una bandeja para hornear, transfiéralas al horno y hornee durante 15 minutos, o hasta que estén doradas. Retire del horno, retire el pergamino para hornear y los frijoles y vuelva al horno por otros cinco minutos.", "Retire del horno, recorte el exceso de masa de la parte superior de la tarta para darle un borde limpio y déjelo a un lado.", "Para el relleno, coloque el chocolate en un tazón sobre una olla de agua hirviendo a fuego lento y caliente hasta que se derrita.", "Coloque los huevos y el azúcar en un tazón limpio y mezcle hasta que estén pálidos.", "Vierta el chocolate derretido en los huevos junto con la crema y mezcle bien para combinar.", "Saque la carne de cuatro de los higos y agregue a la mezcla de chocolate, revolviendo con cuidado.", "Coloque la mezcla de chocolate en cada una de las cuatro cajas de repostería. Corta los higos restantes y coloca tres rebanadas encima de cada una de las tartas de chocolate.", "Coloque las tartas en una bandeja para hornear, transfiéralas al horno y hornee durante 10 a 15 minutos, o hasta que se acaben de preparar.", "Mientras tanto, para la salsa de frambuesa, coloque las frambuesas, el azúcar y el jugo de limón en un procesador de alimentos y mezcle hasta que quede suave, luego pase la mezcla a través de un colador para eliminar las pepitas de frambuesa.", "Para servir, coloca una cucharada de salsa de frambuesa en el centro de los cuatro platos para servir. Coloque una tarta caliente de higo y chocolate encima de la salsa con una bola de helado de chocolate blanco y una ramita de menta para decorar."], "url": "www_bbc_co_uk_food_recipes_figandchocolatetarts_84848", "title": "Tartas de higos frescos y chocolate negro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte", "85g / 3 oz de azúcar", "30 g / 1 oz de levadura en polvo", "85g / 3oz de mantequilla", "2 huevos", "225ml / 8 fl oz de leche", "Fechas de 55g / 2oz", "55g / 2oz de higos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ponga todos los ingredientes en un tazón, excepto las fechas y los higos, suavemente junte la mezcla hasta que tenga una textura suave como la masa.", "Agregue las fechas y los higos y ruede la masa con un rodillo a unos 4 cm / 1½ \"de profundidad.", "Recorte las formas de bollos con un cortador redondo y colóquelos en una bandeja para hornear.", "Cepille con un lavado de huevo y hornee durante 20 minutos hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_figanddatescones_66042", "title": "Bollos de higos y fechas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10-12 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pastel de hojaldre de 110g / 4oz", "8 higos maduros frescos, descuartizados", "Queso dolcelatte 140g / 5oz, cortado en cubitos", "6 finas rebanadas de panceta", "sal y pimienta recién molida", "1 cucharada de aceite de oliva", "huevo batido, para glasear", "Crema doble 110ml / 4fl oz", "medio puñado de hojas de cilantro", "1 cucharadita de ramitas de cilantro fresco", "1 cucharadita de ramitas de menta fresca", "110 g / 4 oz espinaca bebé", "aceite de oliva virgen extra", "vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Estirar la masa de hojaldre en una ronda o cuadrado, de unos 25 cm / 10 pulgadas de ancho, y colocar en una bandeja para hornear engrasada.", "Coloque los higos en la masa, dejando un espacio de 1 cm / ½ pulgadas alrededor del borde de la tarta.", "Coloque la dolcelatte sobre los higos, luego cubra con la panceta. Sazonar con sal y pimienta recién molida. Rocíe sobre el aceite de oliva.", "Cepille los bordes de la tarta con un poco del huevo batido.", "Hornea la tarta durante 10 minutos.", "Retire la tarta del horno y vierta sobre la crema doble. Espolvorea con las hojas de cilantro.", "Regrese la tarta al horno y hornee durante 6-8 minutos más.", "Mientras tanto, prepara la ensalada. Mezcle el cilantro, la menta y la espinaca baby. Vístase con un poco de aceite de oliva y vinagre balsámico.", "Sirva la tarta caliente del horno con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_figandpancettatartwi_68030", "title": "Higo y panceta tarta con dolcelatte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina normal de 50g / 2oz", "50g / 2 oz de harina de maíz", "pizca de sal", "75-110ml / 3-4fl oz de ginger ale", "4 higos, cortados a la mitad longitudinalmente", "75-110ml / 3-4fl oz de agua con gas", "12 fresas", "125ml / 4½ fl oz de leche", "3 ramitas de hierba fresca de verbena", "5 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "375 ml / 13 fl oz crema doble", "25g / 1 oz de azúcar demerara", "Fresas de 250g / 9oz, descascaradas y picadas", "1-2 cucharadas de azúcar glas"], "method": ["Para la tempura, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la mitad de la harina, la harina de maíz y la sal en un bol y agregue gradualmente suficiente ginger ale para hacer una mezcla. No mezcle en exceso; no importa si quedan algunos grumos.", "Sumerja los higos en la mezcla para cubrir completamente. Coloque en el aceite caliente y fría hasta que estén doradas y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Coloque la harina restante, la harina de maíz y la sal en otro recipiente y mezcle gradualmente suficiente agua con gas para formar una masa.", "Sumerja las fresas en la masa para cubrir completamente. Coloque en el aceite caliente y fría hasta que estén doradas y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Precalentar el horno a 150C / 300F / Gas 2.", "Para la crème brûlée, coloque la leche en una cacerola, agregue la hierba luisa y deje que hierva. Retirar del fuego y dejar enfriar e infundir durante unos minutos.", "Coloque las yemas de huevo en un tazón grande con el azúcar y bata hasta que se combinen.", "Vierta la mezcla de leche en el recipiente junto con la crema y mezcle bien.", "Coloque cuatro moldes en una lata de tueste y pase la mezcla de crema a través de un colador en los moldes. Vierta suficiente agua hirviendo para llegar hasta la mitad de los lados de los moldes.", "Transfiera al horno y hornee durante una hora, o hasta que esté listo. Retire los moldes de la lata y deje enfriar.", "Una vez que se haya enfriado, coloque los moldes en el congelador hasta que las natillas estén sólidas.", "Use un cuchillo para aflojar los bordes de los moldes y cuidadosamente incline las natillas de sus moldes en un tablero. Usando un cortador de pasteles, recorte un círculo de cada flan para hacer cilindros ligeramente más pequeños que los moldes. Coloque en platos para servir y deje que se ablanden durante cinco minutos.", "Para la salsa de fresa, coloque las fresas y el azúcar glas en un procesador de alimentos pequeño y mezcle hasta que quede suave. Pasar la mezcla a través de un colador en un recipiente para eliminar las semillas. Prueba a controlar la dulzura y agrega más azúcar si es necesario.", "Para servir, espolvorear el azúcar demerara sobre la crema de leche y caramelizar con un mini soplete. Coloque dos mitades de higos y tres fresas en cada plato y rocíe sobre la salsa de fresa."], "url": "www_bbc_co_uk_food_recipes_figandstrawberrytemp_87458", "title": "Tempura de higo y fresa con crema de verbena de limón y salsa de fresa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de vinagre de vino blanco", "400ml / 14fl oz de agua", "1 pequeña ramita de canela", "2 dientes", "4 vainas de cardamomo, aplastadas", "1 chile rojo, en rodajas", "1 pulgar de jengibre, pelado y más o menos picado", "Azúcar en polvo 140g / 5oz", "1 cucharadita de sal marina", "20 higos secos"], "method": ["Coloque todo en una olla y hierva suavemente, sin tapa, durante 5 minutos.", "Dejar enfriar antes de refrigerar"], "url": "www_bbc_co_uk_food_recipes_figcompote_11593", "title": "Compota de higo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina normal", "2 cucharadas de harina de maíz", "agua fría gaseosa", "aceite vegetal, para freír", "8 higos", "helado de vainilla, para servir"], "method": ["Prepare la mezcla tamizando la harina común y la harina de maíz en un tazón grande. Agregue suficiente agua fría con gas para que la masa conserve la crema doble.", "Calentar el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja cada higo en la masa y luego colóquela cuidadosamente en el aceite caliente. Freír a fuego lento durante 2-3 minutos hasta que estén crujientes y doradas. Retire con una espumadera y escurra sobre la toalla de cocina.", "Sirva inmediatamente con bolas de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_figfritterswithvanil_81001", "title": "Buñuelos de higo con helado de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["115 g / 4oz de pasas", "115g / 4oz sultanas", "5 cucharadas de ron", "1 cucharadita de jengibre molido", "½ cucharadita de especias mixtas", "Harina simple de 450g / 1lb", "115g / 4oz de sebo triturado", "115 g / 4 oz de azúcar en polvo", "4 huevos de gallinas camperas, solo yemas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble"], "method": ["Para el pudín, coloque las pasas y las pasas en un recipiente con ron y 200 ml / 7 fl oz de agua y mezcle para combinar. Reserve a un lado durante al menos cuatro horas, preferiblemente durante la noche.", "Coloque los ingredientes restantes en un recipiente y mezcle para combinar. Agregue la fruta empapada y cualquier líquido residual y mezcle para hacer una masa suave.", "Coloque un trozo grande de papel de aluminio sobre una superficie de trabajo y luego, póngalo en forma de tronco. Enrolla la masa en la lámina, girando los extremos para asegurarla. Envuelva el rollo en una pieza de muselina o, como era tradicional, en una manga de camisa, y ate los extremos con hilo de cocina.", "Coloque el rollo en una placa resistente al calor en una sartén grande, luego vierta suficiente agua para cubrir la placa. Cubra la olla con una tapa y coloque a fuego medio sobre la placa. Llevar a ebullición, luego reduzca el fuego a fuego lento y cocine durante dos horas o hasta que esté cocido. Reponga el agua según sea necesario mientras el pudín cocina.", "Retire de la sartén y deje reposar durante cinco minutos, luego retire la manga de muselina o camisa y la lámina.", "Mientras tanto, prepara la crema pastelera. Coloque las yemas de huevo y el azúcar en un tazón y mezcle hasta que espese y pálido.", "Coloque la leche y la crema en una cacerola y deje que hierva. Verter sobre la mezcla de huevo, batir bien y luego devolver la mezcla a la sartén y calentar lentamente, hasta que la crema se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara.", "Para servir, corta el pudín en rodajas gruesas y coloca la crema en la parte superior."], "url": "www_bbc_co_uk_food_recipes_figgy_dowdy_pudding_with_81941", "title": "Figgy pudín con flan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "200g / 7oz sin cáscara, nueces picadas", "397g / 14oz puede leche condensada", "50g / 1¾oz de miel de tomillo", "50 g / 1¾oz de queso de cabra suave y suave (sin corteza)", "Crema doble 600ml / 20fl oz", "1 x 250 g / 9 oz paquete de higos secos, tapas cortadas", "1 limón, jugo y ralladura solamente", "40g / 1½ oz de miel de tomillo", "1 cucharada de tomillo de limón", "Harina de 175g / 6oz de auto aumento, más extra para quitar el polvo", "pizca de sal", "100g / 3½oz de sebo triturado", "75g / 2½ oz de almendras molidas", "1 limón, ralladura solamente", "100 g / 3½ oz de leche entera, más extra para cepillar", "2 yemas de huevo de gallinas camperas, más 1 huevo de gallinas camperas, batido, para esmaltar", "50g / 1¾oz de miel de tomillo", "1 cucharadita de extracto de vainilla", "azúcar infundido con vainilla para rociar, para saborear", "aproximadamente 2 cucharadas de miel de tomillo, al gusto", "3 higos frescos (opcional)", "1 rodaja de limón (opcional)", "tomillo fresco de limón (opcional)", "vainas de vainilla, desechadas (opcional)"], "method": ["Para la nuez caramelizada y el helado de miel, comience con las nueces caramelizadas. Coloque el azúcar en polvo en una olla pequeña de base pesada y caliéntelo a fuego medio hasta que todos los gránulos se hayan derretido y se forme un caramelo. Coloque las nueces en una hoja de papel de aluminio y vierta el caramelo sobre las nueces. Deje que se solidifique y se enfríe.", "Batir la leche condensada, la miel y el queso de cabra en un bol hasta que quede suave. Batir la crema en un recipiente aparte hasta que se formen picos suaves cuando se retire la batidora del cuenco y doblar a través de la leche condensada, la miel y el queso de cabra. Divide la mitad de las nueces caramelizadas y revuélvelas a través de la mezcla. Ponga a un lado las nueces caramelizadas restantes.", "Transfiera la mezcla a un recipiente a prueba de congelación y colóquela en el congelador; alternativamente, colóquela en una máquina para hacer helados y congélela de acuerdo con las instrucciones del fabricante.", "Para el relleno de higo, combine todos los ingredientes en una cacerola mediana de base pesada con una cucharada de agua. Coloque a fuego lento, revolviendo bien hasta que todo esté bien combinado. Cocine a fuego lento y revuelva de vez en cuando durante unos 10 minutos, o hasta que la mezcla esté espesa y el líquido se haya evaporado. Retire la sartén del fuego y mezcle con una licuadora de mano. Reserve a un lado durante 10 minutos para que se enfríe un poco.", "Para la masa de sémola, precaliente el horno a 180 ° C / horno de ventilador 160 ° C / 350 ° F / Gas 4.", "Coloque la harina, la sal, el sebo, las almendras molidas y la ralladura de limón en un tazón grande y mezcle hasta que estén bien combinados. Mida la leche en una jarra y bata las yemas de huevo, la miel y el extracto de vainilla. Agregue lentamente la mezcla húmeda al recipiente con los ingredientes secos y mezcle con una masa suave, pero no pegajosa. Incline la masa sobre una superficie enharinada y extiéndala en un rectángulo de 20 x 30 cm / 8 x 12 pulg.", "Extienda el relleno de higo en la masa, dejando un borde de 1 cm / ½ pulgada alrededor. Suavemente enrolle la masa desde el extremo corto, cepillándola con leche y transfiérala a una bandeja para hornear forrada con papel y con grasa, con la costura hacia abajo. Cepille con un poco de huevo batido y espolvoree con azúcar de vainilla.", "Hornee durante aproximadamente 40 minutos, o hasta que estén dorados, cubriendo con una hoja de papel de aluminio si la parte superior y los lados parecen dorarse demasiado.", "Retire del horno y deje enfriar un poco. Rocíe la miel de tomillo al gusto y coloque las nueces caramelizadas restantes sobre la parte superior del rollo. Sirve con el helado.", "También podría decorar con higos frescos (un corte por la mitad, los otros dos con una cruz en la parte superior y la carne ligeramente abierta), además de una rodaja de limón, tomillo fresco y vainas de vainilla raspadas alrededor del pudín para hacer referencia a los ingredientes que contiene."], "url": "www_bbc_co_uk_food_recipes_figgy_roly_poly_pudding_92371", "title": "Fig roly poly pudding", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Rectángulo de 5cm x 12cm / 2in x 5in", "hojaldre, más rectángulo extra cortado en un patrón de celosía", "2 higos enteros, cortados en rodajas de 0.5cm / ¼", "2 cucharadas de azúcar en polvo", "½ cucharadita de extracto de vainilla", "2 cucharadas de avellanas picadas", "1 huevo entero de granja, batido para usar como glaseado", "100 ml / 3½ fl oz de vino tinto", "1 cucharadita de especias mixtas", "50 g / 1 oz de azúcar en polvo", "1 vaina de vainilla, solo semillas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la tarta, coloque el rectángulo de repostería en una bandeja para hornear.", "Coloque los higos en rodajas en la masa y espolvoree sobre el azúcar, el extracto de vainilla y las avellanas.", "Coloque con cuidado el enrejado de repostería sobre los higos y luego cepille con el huevo.", "Transfiera al horno por 10 minutos hasta que estén dorados.", "Retire del horno y corte la tarta de higos en rodajas.", "Para el jarabe de vino picante, caliente todos los ingredientes en una cacerola a fuego medio y cocine suavemente para disolver el azúcar.", "Cuando el azúcar se haya disuelto, suba el fuego a alta temperatura y hierva rápidamente el líquido para reducirlo hasta que espese y sirva.", "Para servir, coloque las rodajas de tarta de higo una encima de la otra y rocíe sobre el jarabe."], "url": "www_bbc_co_uk_food_recipes_fighazelnuttartwiths_84357", "title": "Higo y tarta de avellana con jarabe de vino picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 higos frescos", "2 cucharadas de miel clara", "30 g / 1 oz de mantequilla, en cubos", "2 ramitas de tomillo fresco", "2 yemas de huevo de gallinas camperas", "30 g / 1 oz de azúcar en polvo", "75ml / 2½fl oz de vino de Sauternes", "1 ramita de tomillo fresco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los higos horneados, corte una cruz en la parte superior de cada higo y apriete ligeramente la parte inferior para abrirla. Coloque en un plato gratinado, rocíe la miel, la mantequilla y el tomillo y hornee por 6-7 minutos. Retire del horno y deje a un lado para que se enfríe un poco.", "Para el sabayon, coloque las yemas de huevo, el azúcar y los auternes en un recipiente que se ajuste cómodamente sobre una cacerola de agua hirviendo a fuego lento y bata constantemente hasta que la mezcla se espese. Retire del fuego y continúe batiendo durante unos minutos o hasta que se enfríe un poco.", "Para servir, coloque los higos en un plato de servir. Vierta el sabayon sobre los higos. Con un soplete, caramelice cuidadosamente la parte superior de los higos. (Alternativamente, puede colocar debajo de la parrilla hasta que esté caramelizado.) Adorne con la ramita de tomillo."], "url": "www_bbc_co_uk_food_recipes_fighoneyandthymegrat_87363", "title": "Higos horneados con miel y tomillo y Sauternes sabayon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 higos frescos, cortados a la mitad", "6 rebanadas de tocino", "2 cucharadas de vinagre balsámico", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "½ manojo de berros, solo hojas"], "method": ["Para los higos, envuelva cada mitad de higo en una rebanada de panceta. Calentar una sartén, agregar los higos y freír a fuego medio durante 2-3 minutos por cada lado, o hasta que la panceta se haya dorado y crujiente.", "Para la ensalada, mezcle el vinagre balsámico y el aceite de oliva en un bol y combine. Sazone al gusto con sal y pimienta negra recién molida.", "Vierta el aderezo sobre el berro y mezcle suavemente para cubrir las hojas.", "Para servir, coloque la ensalada en el centro de un plato para servir con los higos dispuestos alrededor del borde, y rocíe sobre el aderezo restante."], "url": "www_bbc_co_uk_food_recipes_figswrappedinpancett_89373", "title": "Higos envueltos en panceta con ensalada de berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de higos secos, finamente picados", "1 cucharada de aguardiente", "1 cucharada de agua de rosas", "300ml / 10½fl oz de agua", "75g / 2¾oz de harina integral", "75g / 2¾oz de harina natural, más extra para espolvorear", "75g / 2¾oz de mantequilla, más extra para engrasar", "50 g / 2 oz de azúcar en polvo", "pizca de sal", "30-50ml / 1-2fl oz de agua"], "method": ["Para el relleno, hierva los higos, el aguardiente, el agua de rosas y el agua a fuego lento en una sartén, revolviendo bien hasta que se combinen. Continúe cocinando a fuego lento durante 15-20 minutos, o hasta que la fruta se haya ablandado y la mayoría del líquido se haya evaporado (la mezcla debe parecerse a la mermelada).", "Retire la sartén del fuego y déjela reposar durante 10 minutos para que se enfríe un poco. Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una bandeja para hornear con mantequilla.", "Para la masa, mezcle la harina integral, la harina común, la mantequilla, el azúcar y la sal en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Con el motor todavía en funcionamiento, agregue gradualmente el agua en una corriente delgada hasta que la mezcla se una como masa (puede que no necesite usar toda el agua).", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y envuélvala en una película adhesiva. Enfriar en la nevera durante 20 minutos.", "Cuando la masa se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada hasta obtener un rectángulo de 40cm x 12cm / 16in x 5in.", "Extiende la mezcla de llenado longitudinalmente por el centro del rectángulo de repostería. Doble uno de los bordes de la masa sobre la mezcla de relleno, luego cubra con el otro borde de la masa.", "Cortar la masa rellena en 12-15 rebanadas de 7,5 cm / 3 pulgadas y colocar cada rebanada en la bandeja de hornear preparada, con el borde doblado hacia abajo. Presione el plano de un tenedor húmedo en la parte superior de cada rollo de higo para crear un efecto de surcos. Hornee en el horno durante 18-20 minutos, o hasta que estén crujientes y doradas. Retire del horno y transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_figrolls_92754", "title": "Rollos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12-15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 higos", "Camembert de 50 g / 3½ oz, cortado en 3 piezas", "sal y pimienta negra recién molida", "1 cucharadita de mantequilla", "3 lonchas de tocino rayado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Haz un entrecruzamiento en la parte superior de cada higo, pellizca la base para expandir la abertura en la parte superior y rellena cada una con una pieza de Camembert. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente la mantequilla en una sartén pequeña a prueba de horno y fría los higos por un minuto. Coloque la sartén en el horno y tueste durante seis minutos, o hasta que el queso se derrita y se dore.", "En una sartén por separado, freír el tocino en ambos lados durante 4-5 minutos, o hasta que estén crujientes. Retire los higos del horno y envuelva cada uno con una loncha de tocino.", "Para servir, coloque los higos envueltos en tocino en un plato."], "url": "www_bbc_co_uk_food_recipes_figswrappedwithcrisp_84211", "title": "Higos envueltos con tocino crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ paquete de hojaldre listo para enrollar", "2 higos, cortados por la mitad", "25g / 1oz de mantequilla", "2 cucharadas de azúcar en polvo", "2 cucharadas de yogurt griego"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Con una sartén pequeña y a prueba de horno como guía, corte una ronda de una hoja de hojaldre laminado, dejando un ancho de pulgada adicional.", "Coloque la sartén pequeña a prueba de horno a fuego medio y agregue la mantequilla y el azúcar.", "Agregue los higos cortados hacia abajo y cocínelos durante cuatro minutos, permitiendo que el azúcar se caramelice.", "Coloque la masa sobre la sartén y corte un pequeño agujero de aire en el centro. Transfiera al horno y hornee durante diez minutos, o hasta que la masa esté dorada.", "Para servir, coloque el tatin en un plato de servicio y sirva con dos cucharadas de yogur griego."], "url": "www_bbc_co_uk_food_recipes_figtatin_78667", "title": "Fig tatin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "1 cebolla, en rodajas", "1 diente de ajo, finamente picado", "2 zanahorias, cortadas en cubitos", "2 tallos de apio, en rodajas finas", "1kg / 2lb filete de carne de vacuno 4 oz, recortado", "Paté de hígado de pato 75g / 3oz (perfecto)", "sal marina y pimienta negra recién molida", "½ cucharadita de aceite de trufa (opcional)", "6-8 lonchas de tocino rayado sin corteza", "3-4 hojas frescas de laurel", "100ml / 3½ fl oz de coñac", "200ml / 7fl oz Madeira", "150ml / 5fl oz de caldo de res fresco", "puñado de perejil fresco picado", "papas a la crema", "judías verdes"], "method": ["Calienta dos cucharadas de aceite en una sartén. Freír la cebolla, el ajo, las zanahorias y el apio durante 10-12 minutos o hasta que estén suaves y dorados. (Es posible que necesite aumentar el calor hacia el final del tiempo de cocción para alentar a que las verduras se doren.) Coloque las verduras cocidas en una cazuela.", "Coloque el filete de carne en una tabla de cortar. Corte un bolsillo en el costado del filete, dejando un espacio de 2 cm en cada extremo. (Asegúrese de hacer una incisión solo hasta la mitad de la carne y de que no corte la carne en dos partes).", "Corta el paté en tiras de 1.5cm / ½ en toda la casa, colócalas dentro del bolsillo y rocía con el aceite de trufa, si lo estás usando. Cierre el bolsillo para cubrir el relleno. Sazone la carne con sal marina y mucha pimienta negra recién molida.", "Envuelva la carne en las lonchas de tocino y asegúrela con un cordón de cocina. Coloque una hoja de laurel entre el tocino y la cadena de cada otra lonja. Dejar de lado.", "Precalentar el horno a 180C / 350F / Gas 4.", "Calentar la sartén y agregar el aceite restante y dorar el filete de res en la sartén durante 10-12 minutos, o hasta que el tocino esté crujiente y dorado. Coloque el filete de carne en la parte superior de las verduras.", "Saque todo menos dos cucharadas de grasa de la sartén y agregue la harina. Poco a poco agregue el coñac, revolviendo constantemente. Una vez que la mezcla esté hirviendo, agregue el Madeira, seguido del caldo de carne. Deje que el líquido hierva a fuego lento y luego vierta inmediatamente alrededor de la carne. Cocine la carne en el horno durante 30-35 minutos para la carne de vacuno rara, o 40 minutos para el medio raro.", "Con cuidado, retire la carne de res en una tabla de cortar, cubra con un trozo de papel de aluminio y dos toallas de té. Regrese la cazuela a la cocina y cocine a fuego lento durante 2 o 3 minutos, o hasta que el líquido se espese un poco. Colar a través de un tamiz fino en una jarra calentada. Talla la carne en trozos gruesos.", "Vierta un poco de la salsa en seis platos profundos. Coloque la carne de res encima y adorne con perejil fresco y sirva con papas con crema y judías verdes."], "url": "www_bbc_co_uk_food_recipes_fillet_of_beef_prince_42045", "title": "Filete de ternera Prince Albert", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fillet_of_beef_prince_42045_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "4 x 200 g / 7 oz de filete de ternera de corte medio", "180g / 6½oz de mantequilla sin sal", "200 g / 7 oz de salsifí, pelado y cortado en bastones de 2 cm / 1 in (mantener en un recipiente con agua cítrica para evitar el pardeamiento)", "1 chalota de plátano, en rodajas finas", "100 ml / 3½ fl oz en Madeira", "175ml / 6fl oz ternera jus o caldo (alternativamente puede usar caldo de carne)", "2 cucharadas de perifollo fresco finamente picado", "sal y pimienta negra recién molida", "4 papas grandes de Maris Piper, fregadas, sin pelar, ralladas gruesas", "2 remolachas, peladas, ralladas", "Crema de 75g / 2½ oz", "1 huevo de gallinas camperas, solo yema", "1 cucharada de perejil fresco finamente picado", "70 g / 2½ oz de mantequilla", "1 manojo de remolachas para bebés", "1 manojo de herencia o remolacha confitada"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Calentar el aceite en una sartén mediana. Una vez caliente, agregue la carne y cocine en cada lado durante 2-3 minutos.", "Agregue 75g / 2¾oz de mantequilla a la sartén y colóquelo en el horno durante 4-5 minutos, dependiendo del peso de su filete. Déjalo descansar.", "Agregue 75g / 2¾oz de mantequilla a una sartén caliente. Agregue el salsifí y y saltee durante 3-4 minutos, o hasta que estén tiernos y dorados.", "En una sartén limpia, caliente la mantequilla restante hasta que forme espuma y luego agregue la chalota. Freír durante 3-4 minutos, o hasta que estén doradas.", "Agregue el Madeira y cuidadosamente incline la sartén hacia la llama de la placa, para que el alcohol se prenda. Cocine hasta que el líquido haya reducido su volumen en tres cuartas partes. Agregue el caldo de ternera, revuelva bien y cocine durante 3-4 minutos, o hasta que se reduzca el volumen a la mitad. Sazonar, al gusto, con sal y pimienta negra. Revuelva en el perifollo.", "Para el rosti, ponga las papas en una toalla de té limpia dentro de un recipiente y exprima el exceso de agua. Transfiera la papa y la remolacha a un tazón limpio junto con la crème fraîche, el huevo, el perejil, la sal y la pimienta. Revuelva hasta que esté bien combinado.", "Calienta 35g / 1¼ oz de mantequilla en una sartén a prueba de horno a fuego medio y coloca 2 x 7.5cm / 3in anillos de chefs en la sartén. Coloque la mezcla de papa dentro de los anillos, presione bien con una cuchara y cocine de 3 a 4 minutos o hasta que se dore. Retire los anillos, gire el rosti, presione la mezcla hacia abajo y cocine durante 3-4 minutos más. Transfiera la sartén al horno durante 5-10 minutos o hasta que esté tierna y cocida.", "Mientras tanto, hervir las remolachas baby en sus pieles durante 10-15 minutos. Corre bajo agua fría y quita las pieles. Caliente una sartén mediana y agregue la mantequilla restante, agregue las remolachas para bebés y cocine durante 1-2 minutos. Pele las remolachas del patrimonio y corte usando una mandolina.", "Para servir, coloca el rosti en el centro del plato y coloca la carne en la parte superior. Coloque el salsifí y la remolacha alrededor del rosti y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_fillet_of_beef_with_14742", "title": "Solomillo de ternera con patata y remolacha rosti, remolacha y salsa de Madeira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["John Dory cabezas (desde abajo), branquias y globos oculares eliminados", "8 muslos de pollo", "50ml / 1¾fl oz de aceite de semilla de uva", "25 g / 1oz de mantequilla sin sal", "2 chalotes, en rodajas", "10 champiñones, descuartizados", "1 hoja de laurel", "tomillo de ramita", "50ml / 1¾fl oz de vinagre de jerez", "200 ml / 7 fl oz de vino de Madeira", "1 litro / 1¾ pinta de caldo de pollo marrón", "100ml / 4fl oz de caldo de pollo blanco", "50ml / 1¾fl oz de caldo de ternera", "100g / 3½oz de mantequilla sin sal", "500 g / 1 libra de chalotes de 2oz, finamente rebanados", "sal", "250ml / 9fl oz de crema batida", "250g / 9oz de arroz negro", "800ml / 1⅓ pinta de caldo de pollo", "sal y pimienta negra recién molida", "1 maíz en la mazorca", "25 g / 1oz de mantequilla sin sal", "1 cebolla blanca pequeña, cortada en cubitos", "2 hongos de campo, pelados y cortados en cubitos", "8 garras de langostinos grandes (o 8 colas de gambas peladas y crudas), carne extraída del caparazón", "Harina normal de 75 g / 2½ oz", "1 huevo de gallinas camperas, golpeado", "Pan rallado de 100 g / 3½ oz panko", "20 g / ¾oz de mantequilla sin sal", "125g / 4½oz de carne de garra de langostino cocida, picada (alternativamente, use carne de cangrejo blanca cocida)", "1 cucharada de estragón picado", "1 litro / 1¾ pinta de aceite vegetal, para freír", "2 rodajas de limón", "Licor de cocción de arroz negro 230ml / 8fl oz (reservado desde arriba)", "sal y pimienta negra recién molida", "3 g de lecitina en polvo", "4 x 550g / 1lb 4oz de pescado John Dory, fileteado y cortado en 8 porciones de 110 g / 4oz (pídale a su pescadero que haga esto y que le den las cabezas)", "4 cucharadas de aceite de semilla de uva", "sal y pimienta negra recién molida", "40 g / 1½ oz de mantequilla"], "method": ["Para la salsa, usando una cuchilla de carne, corte las cabezas de John Dory por la mitad y los muslos de pollo en tres pedazos.", "Coloque una sartén grande de base pesada a fuego alto y déjela durante dos minutos. Agregue el aceite de semilla de uva, seguido rápidamente por las cabezas de pescado y las baquetas, y deje que se coloreen durante 1-2 minutos. Cuando esté dorado, sazone ligeramente con sal, voltee y coloree el otro lado.", "Agregue la mantequilla, revuelva y continúe cocinando hasta que todas las piezas estén doradas, deberá raspar en el fondo de la sartén para lograr esto. Agregue los chalotes, los champiñones, la hoja de laurel y el tomillo.", "Agregue el vinagre y cocine hasta que se haya evaporado por completo. Agregue el Madeira y cocine hasta que se haya evaporado casi una cucharadita.", "Agregue las cepas, deje que hierva y cocine a fuego lento durante 30 minutos. Retire del fuego y deje reposar por 10 minutos.", "Escurrir a través de un colador y luego pasar la salsa a través de un colador fino en una olla mediana.", "Regrese la salsa al fuego, hierva y cocine a fuego lento hasta que se haya reducido lo suficiente como para cubrir la parte posterior de una cuchara. Controle el condimento y reserve para enfriar. (Debe ser una mezcla rica, agridulce de caldo y grasa en la proporción aproximada de 2 a 1. Elimine cualquier exceso de grasa). Transfiera a la nevera.", "Para el puré de chalota, precaliente el horno a 170 C / 325 F / Gas 3.", "Coloque una cacerola a fuego medio y déjela reposar por un minuto. Agregue la mantequilla, permita que se derrita, luego agregue los chalotes y una generosa pizca de sal. Cocine por cinco minutos, revolviendo con frecuencia.", "Reduzca el fuego y continúe cocinando a fuego lento durante 15-20 minutos, aún revolviendo con frecuencia, hasta que los chalotes estén completamente suaves y tengan un color dorado claro.", "Agregue la crema, lleve a ebullición, luego cubra la cazuela y transfiéralo al horno por diez minutos.", "Retire del horno, transfiera a un procesador de alimentos y mezcle hasta lograr un puré suave. Pase a través de un colador fino en un recipiente, revise el condimento y déjelo enfriar un poco antes de transferirlo al refrigerador.", "Para el arroz negro, enjuague el arroz con agua fría. Coloque en una cacerola de base pesada, cubra con el caldo de pollo, sazone con una pizca de sal y coloque a fuego medio. Llevar a ebullición y cocine a fuego lento durante 20 minutos o hasta que estén tiernos.", "Retire del fuego, deje reposar durante cinco minutos, luego escurra, reservando 230 ml / 8 fl oz del licor de cocción. Coloque el arroz y el licor de cocina reservado a un lado para enfriar a temperatura ambiente.", "Coloque el maíz en una olla, cúbralo con agua, lleve a ebullición y cocine a fuego lento durante unos 15 minutos o hasta que esté tierno.", "Escurrir y refrescar con agua fría durante cinco minutos. Sostenga el maíz en posición vertical sobre una tabla y use un cuchillo afilado para cortar los granos.", "Coloque una cacerola de base pesada a fuego medio y déjela por un minuto. Agregue la mantequilla, seguido de la cebolla y una pizca de sal. Cocine por cinco minutos, revolviendo frecuentemente, hasta que esté suave y translúcido. Agregue los champiñones y cocine durante 2-3 minutos más. Agregue los granos de maíz y mezcle bien. Sazone al gusto con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Para el beignet de garra de langostinos, cubra la carne de garra (o gambas) sumergiéndolas primero en la harina, luego el huevo y finalmente las migas de pan, asegurándose de obtener una capa delgada y uniforme de migas. Cubra y transfiera a la nevera.", "Para servir, recalentar el puré de chalota y dejar de lado.", "Derrita 20 g / ½ oz de la mantequilla en una sartén, agregue el arroz y la mezcla de maíz dulce y caliente. Agregue la carne cocida de garra de langostino (o carne de cangrejo) y el estragón y fríalos durante dos minutos. Retirar del fuego y mantener caliente.", "Vuelva a calentar la salsa y reserve.", "Para John Dory, precaliente el horno a 170 C / 325 F / Gas 3.", "Coloque dos sartenes antiadherentes grandes, de base pesada a fuego alto y déjelas por un minuto. Divida el aceite de semilla de uva entre las sartenes. Sazonar los filetes de John Dory con sal y pimienta negra recién molida. Agregue los filetes a las sartenes con la piel hacia abajo y cocínelos durante 1-2 minutos, o hasta que estén dorados.", "Divida la mantequilla entre las bandejas, voltee el pescado y cocine durante 30 segundos. Transfiera el pescado a una bandeja de asar, incline el aceite y la mantequilla sobre la parte superior y colóquelo en el horno precalentado durante cinco minutos. Retire y reserve para descansar por dos minutos.", "Para servir, transfiera una cucharada de los jugos de la bandeja de tostado a la salsa y revuelva brevemente.", "Llene una freidora (o una olla profunda) con aceite vegetal y caliente a 180 ° C / 350 ° F.", "Freír los beignets de garra de langostinos hasta que estén dorados. Retire y escurra en un plato forrado con papel de cocina. Luego, aprieta las rodajas de limón sobre ellas.", "Vuelva a calentar 230 ml / 8 fl oz del licor de cocina de arroz negro reservado. Sazone con sal y pimienta negra recién molida, agregue la lecitina y mezcle con una batidora de mano; debe espumara pero solo hará esto si el líquido está caliente pero no hirviendo.", "Coloque cuatro cucharadas pequeñas de puré de chalota en cada plato. En el centro de cada plato, ponga un pequeño montón de mezcla de arroz negro y coloque un filete de John Dory encima. Coloque una generosa cucharada de salsa sobre el pescado y cúbralo con espuma de arroz negro. Adorne con beignet y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fillet_of_john_dory_with_47202", "title": "Filete de John Dory con arroz negro, garras de langostinos, maíz dulce y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chalotes, en rodajas finas", "1 cucharada de vinagre de vino blanco", "4 cucharadas de vino blanco", "225g / 8oz de mantequilla, cortada en cubos", "sal y pimienta negra recién molida", "100 g / 3½ oz de carne de cangrejo blanca", "2 tomates, pelados, sin semillas y cortados en dados pequeños", "4 cucharadas de cebollino picado", "1 limón, solo jugo", "Col rizada de 300 g / 10oz", "50 g / 1¾oz de mantequilla sin sal", "1 limón, solo jugo", "2 suela de limón, fileteada y sin piel", "50 g / 1¾oz de mantequilla sin sal"], "method": ["Para la salsa de mantequilla de cangrejo, en una sartén, ponga a hervir los chalotes finamente rebanados, el vinagre de vino blanco y el vino blanco (no use una olla de aluminio ya que podría reaccionar con el ácido). Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que solo queden dos cucharadas de líquido en la sartén.", "Agregue una cucharada de agua fría y continúe cocinando a fuego lento hasta que el volumen de líquido restante en la sartén sea de aproximadamente una cucharada.", "Reduzca el fuego a bajo, luego bata gradualmente en la mantequilla, 25 g / 1 oz a la vez, esperando hasta que toda la mantequilla se haya derretido e incorporado a la mezcla antes de agregar más.", "Una vez que toda la mantequilla se ha agregado a la reducción, retire la mezcla del fuego y cuele en una olla limpia. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar el cangrejo, los tomates, el cebollín y terminar con el jugo de limón. Reserve a temperatura ambiente hasta que sea necesario.", "Para la col rizada, caliente una olla grande de agua hirviendo y sumérjala en la col rizada. Cocine por un par de minutos, luego escurra. Sumerja la col rizada en agua helada, luego drene nuevamente y seque en el rollo de cocina.", "Derrita la mantequilla en una sartén grande, luego agregue la col rizada, revolviendo durante unos minutos hasta que se marchite.", "Termine la col rizada con el jugo de limón y sazone con sal y pimienta.", "Para el filete de lenguado de limón, sazone la lengua con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar la mantequilla a la sartén. Una vez derretido, cocine el pescado durante dos minutos por cada lado.", "Para servir, coloque la col rizada en el centro del plato y ponga dos filetes en la parte superior, vierta la salsa de mantequilla de cangrejo sobre y alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_fillet_of_lemon_sole_29298", "title": "Filete de lenguado con salsa de col rizada y mantequilla de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]