[{"isVegetarian": true, "title": "A creamy, crunchy fruit sundae", "url": "www_bbc_co_uk_food_recipes_acreamycrunchyfruits_92490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pot double cream (about 250ml/7fl oz)", "1 or 2 large meringues", "1 good handful blackberries, or any soft fruit works well ", "1 small handful shelled unsalted pistachio nuts", "vanilla ice cream, to serve", "icing sugar, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the double cream in a bowl. I like to do this by hand as I have complete control over it and I beat the cream until it just starts to feel heavy on my whisk - but don't over-whisk it. ", "Break the meringues into the cream - rough chunks are good. Scatter in the blackberries (they work perfectly with the meringue as they cut through the sweetness). To break up the smoothness of this sundae I add some pistachio nuts. Gently fold together so that the fruits burst through the cream. ", "Place a large scoop of vanilla ice cream in the bottom of two sundae glasses and top with spoonfuls of the blackberry cream and dust with icing sugar. This dessert has something soft, something crisp, something sweet and something sharp, which makes it perfection."]}, {"isVegetarian": false, "title": "Adhraki gosht (lamb masala in a tomato and ginger sauce)", "url": "www_bbc_co_uk_food_recipes_adhrakigoshtlambmasa_77225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 tsp oil", "1 onion, sliced", "500g/1 lb boneless leg of lamb, diced", "2 tbsp ginger paste", "2 tbsp garlic paste", "salt to taste", "white pepper to taste", "pinch chilli powder", "½ tsp garam masala", "500g/1 lb plum tomatoes", "1 tsp tomato purée", "50g/2oz yoghurt", "root ginger cut into strips, to garnish"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based saucepan.", "Add the onions and cook until golden-brown.", "Add the diced lamb and cook for about 10 minutes.", "Add the ginger paste and garlic paste and cook for about five minutes.", "Add all the spices, the tomatoes paste and yoghurt and stir.", "Add 250ml (9fl oz) of water and cook on a low heat until the lamb is tender, about 40-45 minutes. ", "Skim off any excess oil from the surface.", "Serve garnished with strips of ginger."]}, {"isVegetarian": false, "title": "Aged sirloin steak with Thai salad and toasted hazelnuts", "url": "www_bbc_co_uk_food_recipes_aged_sirloin_steak_with_62354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 300g/10½oz aged sirloin steaks ", "4 tbsp olive oil", "salt and freshly ground black pepper", "¼ red cabbage, thinly sliced", "1 small red onion, thinly sliced", "1 Asian pear, peeled and finely chopped", "½ coconut, ¼ shaved, ¼ grated", "2 tbsp fresh coriander leaves", "2 tbsp fresh mint leaves", "4 tbsp sesame seeds", "2 limes, juice only", "4 garlic cloves, crushed", "2 tbsp finely grated ginger", "2 tbsp palm sugar", "4 tbsp fish sauce", "6 tbsp soy sauce", "2 red chillies, 1 finely chopped, 1 sliced", "2 tbsp chopped fresh mint leaves", "2 tbsp chopped fresh coriander leaves", "2 tbsp toasted hazelnuts, roughly chopped", "1 lime, halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the steaks with salt and pepper and rub the oil all over. Heat a griddle pan and cook the steaks to your liking. Remove from the heat, and leave to rest for around the same time you cooked it for.", "To make the salad, put all the ingredients into a bowl and mix well.", "Put all the ingredients for the dressing into a pestle and mortar and pound to a rough paste. Just before serving, add the dressing to the salad and mix well.", "To serve, cut the steak into slices and lay on a serving dish. Add the salad over the slices of steak, and garnish with the chopped nuts and the lime on the side."]}, {"isVegetarian": true, "title": "Aglio e peperoncino", "url": "www_bbc_co_uk_food_recipes_aglioepeperoncino_90110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 garlic cloves, finely chopped", "1 red chilli, chopped", "200g/7oz dried linguine, cooked according to packet instructions", "6 fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the garlic and chilli for 1-2 minutes, or until softened. Add the cooked linguine to the pan and toss to coat, then stir in the basil leaves.", "To serve, place the linguine onto a serving plate."]}, {"isVegetarian": true, "title": "Aïoli", "url": "www_bbc_co_uk_food_recipes_aioli_81090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg yolks", "4 cloves garlic", "½ lemon, juice only", "salt and freshly ground black pepper", "150ml/5fl oz extra virgin olive oil", "mustard powder, optional", "saffron, optional"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all ingredients, except the olive oil, in a food processor. Pour the oil into the blender in a steady stream, until it forms a thick sauce. The mixture, once blended, should be vibrant and yellow in colour. To vary the flavour, add a little mustard or some saffron. If you'd like your mayonnaise runnier, add a couple of tablespoons of hot water. ", "Serve with baguette slices and/or a selection of raw vegetables, such as celery, carrot sticks, cucumber sticks, radishes, strips of fennel, strips of pepper, cherry tomatoes."]}, {"isVegetarian": false, "title": "Agnello alla menta con insalata calda (Italian lamb casserole with warm salad)", "url": "www_bbc_co_uk_food_recipes_agnelloallamentaconi_76385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb steaks weighing about 400g/14oz in total, cut into 2cm/1in cubes", "4 tbsp finely chopped fresh rosemary ", "4 tbsp finely chopped fresh mint ", "3 tbsp white wine vinegar ", "3 tbsp honey ", "salt and freshly ground black pepper", "5 tbsp Italian olive oil", "2 large onions, cut into 2cm/1in cubes", "100g/3oz button mushrooms ", "3 celery sticks, cut into 2cm/1in cubes", "2 large white potatoes, peeled and cut into 2cm/1in cubes", "1 glass dry red wine", "1 glass water", "3 courgettes, finely sliced", "2 carrots, peeled and finely sliced", "2 leeks, finely sliced ", "5 tbsp Italian olive oil", "6 tbsp toasted pine kernels"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, marinate the lamb steaks with the rosemary, mint, vinegar, honey, salt and freshly ground black pepper. Leave to marinate in the fridge for approximately four hours.", "Heat the olive oil in a large pot and fry the onions, mushrooms, celery and potatoes for about five minutes.", "Add the marinated lamb with any juices from the marinade, mix well and cook for further two minutes. Add the wine and the water, allowing the wine to evaporate for 2-3 minutes. Season with salt and pepper.  ", "Cover the pot with the lid and leave to cook on a low heat for about one and a half hours, stirring occasionally.", "While the casserole is cooking, make the warm salad. Heat the olive oil in a pan and fry the courgettes, carrots and leeks for 2-3 minutes. Add the pine kernels and season with salt and freshly ground black pepper.", "To serve, divide the warm salad between plates, creating a nest in the centre. Serve the lamb in the centre of the vegetables."]}, {"isVegetarian": false, "title": "Aji de gallina", "url": "www_bbc_co_uk_food_recipes_aji_de_gallina_78858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts", "50g fresh white breadcrumbs", "200ml whole milk", "2-3 tbsp olive oil or vegetable oil", "1 large onion, chopped", "3 cloves garlic, chopped", "1 large mild green chilli, seeds removed, finely chopped", "1 tsp paprika", "¼ tsp turmeric", "salt and freshly ground black pepper", "35g ground walnuts", "20g grated parmesan"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken in a saucepan, add just enough boiling water to cover, then bring to the boil and simmer for 8-10 minutes, or until opaque and cooked through. Remove from the water and set aside on a plate to cool, reserve the cooking liquor. When cool enough to handle, shred the chicken.", "Meanwhile, soak the breadcrumbs in the milk.", "Heat the oil in a large frying pan over a medium-high heat and fry the onion for 7-8 minutes, or until softened and golden. Add the garlic and chilli and fry for a further minute until fragrant. Stir in the paprika, turmeric and seasoning and fry for a minute, adding a little more oil if the mixture looks dry.", "Add the shredded chicken and stir to coat in the spices for a minute, then pour in the soaked breadcrumbs and milk. Add 200ml of the reserved stock, bring to a boil then lower the heat and simmer gently for five minutes. Stir in the nuts and simmer for a further 5 minutes, or until the sauce is rich and creamy, adding a little more stock if it gets too thick.", "Stir in the parmesan, season to taste with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Ajitsuke tamago (Japanese pickled eggs)", "url": "www_bbc_co_uk_food_recipes_ajitsuke_tamago_japanese_65686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs ", "100ml/3½fl oz light soy sauce       ", "100ml/3½fl oz mirin ", "100ml/3½fl oz sake", "6 tbsp caster sugar "], "serves": "Makes 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Three-quarters fill a medium saucepan with water and bring to the boil. Once boiling, carefully add the eggs to the pan and boil for exactly six minutes. Use a timer as the eggs want to be just perfect with a lovely runny yolk.", "Once cooked, transfer to a bowl of iced-cold water and carefully peel. Be aware that the eggs are still runny and that you need to handle with care. Add the remaining ingredients, including 100ml/3½fl oz water to another saucepan, gently bring to a simmer and cook until the sugar is dissolved. Remove from the heat and leave to cool.", "Place the eggs in a small container that will fit neatly as you want the liquid to nearly cover the eggs. Pour in the cold marinade and place a small piece of muslin or a jay cloth over the eggs - this helps to make sure the eggs get an even coating of the marinade as the liquid will soak in to the material as well as weighing the eggs down in the liquid.        ", "Marinate for at least 12 hours, but ideally 24."]}, {"isVegetarian": false, "title": "Albondigas (spicy Mexican meatballs with red rice)", "url": "www_bbc_co_uk_food_recipes_albondigasspicymexic_83672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 onions, finely chopped", "250g/9oz pork mince", "250g/9oz beef mince", "1 tsp dried oregano", "60g/2oz fresh breadcrumbs", "1 tsp ground cumin", "1 free-range egg, beaten", "salt and freshly ground black pepper ", "8 tbsp vegetable oil", "3 tbsp olive oil", "800g/1lb 12oz canned chopped tomatoes", "4 medium-hot red chillies, seeds removed and finely chopped", "2 garlic cloves, finely chopped", "100ml/3½fl oz beef stock", "salt and freshly ground black pepper ", "3 large plum tomatoes, cut into quarters", "500g/1lb 2½oz long grain rice", "2 cloves garlic ", "10 tbsp olive oil", "2 tsp paprika", "1 tbsp brown sugar", "2 limes, juice only", "2 spring onions, finely chopped", "1 tsp dried oregano", "3 tbsp tomato purée", "500ml/18fl oz vegetable stock (if you need more liquid use hot water)", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the meatballs, place half of the onions, the pork and beef mince, oregano, breadcrumbs, cumin and egg into a large bowl. Mix together well, then season with salt and freshly ground black pepper.", "Using your hands, roll the mince mixture into 4cm/1½in meatballs.", "Heat the vegetable oil in a large frying pan over a medium heat. Add the meatballs and fry for 5-6 minutes, turning occasionally, until browned all over. Drain from the oil with a slotted spoon and set aside on a plate.", "Heat the olive oil in a clean pan over a medium heat. Add the remaining onions, the garlic and chillies and fry until soft and golden.", "Add in the chopped tomatoes, season with salt and freshly ground black pepper and cook for 5-6 minutes.", "Add the beef stock to the sauce and stir well, then the meatballs and simmer for 20 minutes, or until the sauce has thickened and the meatballs are cooked through.", "For the red rice, place the plum tomatoes on a baking tray with the garlic, drizzle over two tablespoons of the olive oil and place into the oven to roast for 20 minutes. Remove from the oven and allow to cool.", "Once cool enough to handle safely, remove the skin from the tomatoes and peel the garlic.", "Place the garlic, tomatoes, paprika, sugar, lime juice, spring onions and oregano in a food processor and blend until smooth.", "Soak the rice in a fine sieve for ten minutes. Drain thoroughly.", "Heat the remaining eight tablespoons of olive oil a large saucepan over a medium heat. Add the rice and fry, stirring to coat the rice in the oil, for 5-6 minutes, add the blended tomato mixture and the tomato purée and stir well, allowing the rice to absorb the liquid.", "Slowly add ladlefuls of vegetable stock, stirring constantly, as you would with a risotto, allowing each ladleful to be absorbed by the rice before adding the next. ", "Cook until the rice is al dente, or to your liking and season with salt.", "Serve hot in bowls."]}, {"isVegetarian": false, "title": "Albanian baked lamb with rice (Tavë kosi)", "url": "www_bbc_co_uk_food_recipes_albanian_baked_lamb_with_92485", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/albanian_baked_lamb_with_92485_16x9.jpg", "ingredients": ["70g/2½oz butter", "1 tbsp olive oil", "1.2kg/2lb 12oz boned lamb shoulder, cut into 5cm/2in cubes", "4 garlic cloves, grated", "1 tsp dried oregano", "60g/2¼oz long-grain rice, rinsed", "50g/1¾oz plain flour", "600ml/20fl oz Greek-style yoghurt", "4 free-range eggs, beaten", "freshly grated nutmeg, to finish", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Heat 20g/¾oz of the butter and the olive oil in a large lidded pan over a high heat. Brown the lamb in batches.", "Return all the lamb to the pan. Add the garlic, oregano and 200ml/7fl oz water. Bring to a simmer and cook, covered with a lid, for about 45–60 minutes until the lamb is tender.", "Stir in the rice, and season with salt and pepper. Transfer to a 3 litre/5¼ pint earthenware or other ovenproof dish.", "Melt the remaining butter in a small saucepan, add the flour and make a roux, cook for 2 minutes, then take off the heat. Add the yoghurt and mix well, then return to the heat and cook gently for a couple of minutes. Take off the heat, add the beaten eggs and season with salt and pepper.", "Pour the sauce over the lamb and rice mixture, grate fresh nutmeg on top and bake for 40–45 minutes until starting to turn golden-brown.", "Remove from the oven and allow to sit for 5 minutes before serving. Serve with a simple lettuce salad. "]}, {"isVegetarian": true, "title": "Ajo blanco", "url": "www_bbc_co_uk_food_recipes_ajo_blanco_29893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz whole blanched almonds", "75g/2½oz white bread, crusts removed", "600ml/20fl oz iced water", "2 fat garlic cloves, finely chopped", "½ cucumber, peeled, deseeded and roughly chopped", "75ml/2½fl oz olive oil", "1-2 tbsp sherry vinegar or white wine vinegar", "salt and white pepper", "1 tbsp flaked almonds", "24 seedless green grapes, peeled and halved", "2 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put the almonds in a dry frying pan and fry over a medium heat. Shake regularly and watch very closely. Remove from the heat as soon as you can smell the almonds and they are just starting to take on some colour. ", "Repeat with the flaked almonds and reserve them for the garnish.", "Cover the bread with the water and soak for 10 minutes until softened. Drain and squeeze out the water.", "Put the whole almonds into a food processor or blender. Add the bread and process until the almonds are fairly finely ground. Add the garlic and cucumber and continue to blitz, then drizzle in the rest of the water, the olive oil and half the vinegar. ", "Taste. Season with salt and white pepper, then drizzle in a little more vinegar if you think it needs it. The soup should be very smooth – if it seems grainy, push it through a fine sieve.", "Transfer to a bowl or jug, cover and chill for two hours. ", "To serve, ladle into bowls and top with the flaked almonds, peeled grapes and a drizzle of olive oil. "]}, {"isVegetarian": true, "title": "Saturday Kitchen Sling", "url": "www_bbc_co_uk_food_recipes_alcoholic_pink_lemonade_50276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 parts gin", "2 parts sweet red vermouth", "2 parts orange liqueur", "1 part Campari", "2 parts pink grapefruit juice", "10 parts cloudy lemonade", "strawberries, quartered", "mint sprigs", "1 grapefruit, peel only", "ice"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the alcoholic components together with the pink grapefruit juice in a large jug. Pour in the cloudy lemonade and stir. ", "Fill serving glasses with ice and pour over the cocktail. ", "Garnish with two quarters of a strawberry and a mint sprig per drink. Top with a twist of grapefruit peel. "]}, {"isVegetarian": false, "title": "Prawns al cremat with a Little Gem, dandelion and watercress salad served with aioli", "url": "www_bbc_co_uk_food_recipes_alcrematwithalittleg_94027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 shallot, peeled, finely chopped", "1 anchovy fillet, chopped", "½ tsp finely chopped red chilli", "1 garlic, peeled, finely chopped", "5 king prawns, peeled, heads and tails left on", "100ml/3½fl oz dry white wine", "200ml/7¼fl oz fish soup ", "1 tbsp chopped fresh flatleaf parsley", "1 tbsp persillade (equal quantities of finely chopped garlic and parsley)", "1 tbsp breadcrumbs", "6 garlic cloves, cut in half", "1 tbsp Dijon mustard", "125ml/4½fl oz extra virgin olive oil", "pinch ground espelette pepper (or pinch paprika and cayenne pepper)", "1 lemon, juice only", "50ml/1¾fl oz sherry vinegar", "200ml/7¼fl oz olive oil", "1 tsp Dijon mustard", "1 shallot, peeled, finely diced", "2 Little Gem lettuces, leaves separated", "25g/1oz dandelion leaves", "1 bunch watercress", "1 tbsp chopped fresh tarragon", "1 tbsp chopped fresh chervil", "1 tbsp chopped fresh mint", "4 slices toasted sourdough bread"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the al cremat, heat the oil in a lidded frying pan and fry the shallot, anchovy, chilli and garlic for 30 seconds. Stir in the prawns.", "Add the wine and stir well. Continue to cook until the volume of the liquid has reduced by three-quarters. Add the fish soup, cover with a lid and cook for three minutes.", "Remove the lid and add the parsley and persillade; cover and cook for a further 30 seconds. Set aside.", "For the aioli, crush the garlic and salt in a pestle and mortar to a paste. Transfer the mixture to a bowl and whisk in the Dijon mustard. Gradually whisk in the olive oil, a little at a time, until the mixture resembles mayonnaise. Set aside.", "For the Little Gem, dandelion and watercress salad, whisk the sherry vinegar, olive oil, Dijon mustard, shallot and salt and freshly ground black pepper in a small bowl. Place the Little Gem lettuce, dandelion, watercress and herbs into a large bowl, pour over the dressing and mix until well combined.", "To serve, add the espelette pepper and lemon juice to the aioli and mix until well combined. Spoon into a small bowl.", "Spoon the al cremat onto each of two serving plates. Serve the the Little Gem, dandelion and watercress salad, aioli and toast alongside."]}, {"isVegetarian": true, "title": "Ale fruit loaf", "url": "www_bbc_co_uk_food_recipes_alefruitloaf_83744", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1Ib 2oz small currants", "140g/5oz raisins", "140g/5oz mixed peel", "500ml/17fl oz bottle strong bottled beer, such as Black Sheep Brewery Riggwelter Strong Ale", "180g/7oz soft dark brown sugar", "150g/5½oz self-raising flour", "180g/7oz wholemeal self-raising flour", "3 tsp mixed spice", "3 free-range eggs"], "serves": "Makes 2 loaves", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the dried fruit into a large pan and cover with the bottled beer.", "Gently heat the fruit until the beer is hot, but not boiling. Remove from the heat, cover and leave overnight.", "When you are ready to cook the loaf, preheat the oven to 140C/275F/Gas 1.", "Add the sugar, flours, mixed spice and eggs to the fruit mixture. Stir well until all the ingredients are combined.", "Divide the mixture between two greased 500g/1Ib 2oz loaf tins. ", "Bake for 1¼ hours until risen, pale brown and firm to the touch.", "Cover with a tea towel and leave on a wire rack to cool.", "Wrap the loaves tightly in cling film and keep in a cool, dry place for up to 6 weeks. This loaf is delicious buttered with raspberry jam or served with a piece of Wensleydale cheese."]}, {"isVegetarian": false, "title": "All-day breakfast frittata", "url": "www_bbc_co_uk_food_recipes_all-day_breakfast_12416", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-day_breakfast_12416_16x9.jpg", "ingredients": ["2 rashers back bacon, all visible fat removed", "spray oil, for frying", "125g/4½oz mushrooms, thinly sliced", "75g/2½oz spinach", "100g/3½oz boiled potatoes (or leftover baked potatoes) cut into rough chunks", "100g/3½oz cherry tomatoes, halved", "4 medium free-range eggs, beaten", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium-high. Grill the bacon until it is browned on both sides. Remove from the grill and set aside. ", "Spray a small non-stick frying pan with spray oil and place on a medium-high heat. When the pan is hot, fry the mushrooms for 5 minutes, stirring frequently, until they are browned and softened. Set aside.", "Rinse the spinach under cold water and drain it in a sieve. Add it to the frying pan and cook for 1-2 minutes, stirring all the time, so that the leaves steam in the residual water. When the spinach is cooked, but still bright green, transfer back to the sieve and press with the back of a spoon to squeeze any remaining water from the leaves. Set aside.", "Wipe the frying pan clean, spray with oil and return to a medium heat. Fry the potatoes and tomatoes without stirring too much, so that the vegetables take on some colour but don’t fall apart – about 5 minutes.", "Meanwhile, beat the eggs in a fairly large bowl. Chop the cooked bacon and the spinach. Add to the eggs along with the cooked mushrooms. Season the eggs with salt and freshly ground black pepper. ", "When the tomatoes and potatoes are golden-brown in places, spoon them into the eggs with the other vegetables. Give the egg mixture a brief stir, then pour it back into the frying pan and place it back over the heat. Cook gently over a medium heat for 10 minutes, until the egg looks set around the edges (it may be a little runny on the top). ", "Place the pan under the grill for 2 minutes to finish cooking the frittata on top. Turn out the frittata onto a plate and let it cool slightly before cutting into wedges. Serve with a crunchy salad for maximum veggies."]}, {"isVegetarian": false, "title": "All-in-one rib roast with horseradish glaze", "url": "www_bbc_co_uk_food_recipes_all-in-one_rib_roast_75464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-in-one_rib_roast_75464_16x9.jpg", "ingredients": ["2kg/4lb 8oz Maris Piper potatoes, sliced into thirds ", "600g/1lb 5oz beef dripping", "3 tbsp grated fresh horseradish", "2 tbsp black peppercorns", "2 tbsp sea salt", "3.5kg/7lb 11oz rib of beef", "8 large carrots, chopped into 3", "8 large parsnips, sliced into thirds lengthways"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Boil the peeled and sliced potatoes in a large pan of salted water until soft to the point of a knife. ", "Drain the potatoes and shake in a colander so that the edges fluff up.", "In a saucepan, melt the dripping with the horseradish, salt and pepper.", "Score the beef all over with a sharp knife.", "Layer all the chopped vegetables in a large oven tray and place the beef on top. Tip the potatoes into another tray.", "Ladle most of the horseradish glaze over the top of the vegetables and meat (reserving some for the potatoes). Roast the meat in the oven for 20 minutes then reduce the temperature to 160C/325F/Gas 3 and baste the meat with the dripping.", "Pour the remaining horseradish glaze over the potatoes and place them in the oven to cook for the duration of the beef cooking time.", "Roast the meat for two hours,basting it with the dripping every half hour.", "Allow the meat to rest under foil for 30 minutes before serving.  If necessary, you could turn up the oven to crisp the potatoes while the meat is resting."]}, {"isVegetarian": true, "title": "All-purpose easy butter cake", "url": "www_bbc_co_uk_food_recipes_all-purpose_easy_butter_03274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-purpose_easy_butter_03274_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter", "250g/9oz caster or brown sugar", "50ml/2fl oz sunflower oil", "25g/1oz arrowroot, cornflour or cocoa", "2 tsp vanilla extract", "4 medium free-range eggs", "80ml/2½fl oz milk", "100ml/3½fl oz double cream", "300g/10½oz plain flour", "3 tsp baking powder"], "serves": "Makes about 12 large cupcakes or one 22cm/9in round birthday cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Line the base of a deep 20cm/9in square cake tin with non-stick paper and preheat the oven to180C/350F/Gas 4.", "Melt the butter over a low heat in a small pan, pour it into a bowl with the sugar, oil, cornflour (or arrowroot or cocoa) and vanilla. Beat well until smooth, then whisk in the eggs followed by the milk and cream.", "Sift and beat the flour and baking powder into the butter mixture in batches until smooth, then spoon into the prepared tin and bake for 50-60 minutes (for a large cake). Keep a careful eye toward the end of the cooking time, and cover with foil if the cake is getting too dark. For cupcakes, fill the papers about three-quarters full then bake for about 20-25 minutes."]}, {"isVegetarian": true, "title": "All-in-one white sauce", "url": "www_bbc_co_uk_food_recipes_allinonewhitesauce_66114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["425ml/15fl oz milk - this can be infused but must be cold", "20g/¾oz plain flour", "40g/1½oz butter", "salt and freshly milled black pepper"], "serves": "Makes 425ml/15fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["When you're ready to make the sauce, put the milk in a saucepan, then simply add the flour and butter and bring everything gradually up to simmering point, whisking continuously with a balloon whisk, until the sauce has thickened and becomes smooth and glossy.", "Then turn the heat down to its lowest possible setting and let the sauce cook very gently forminutes, stirring from time to time. Meanwhile, taste and add seasoning."]}, {"isVegetarian": true, "title": "Almond and lemon polenta cake with orange mascarpone", "url": "www_bbc_co_uk_food_recipes_almond_and_lemon_polenta_21317", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_and_lemon_polenta_21317_16x9.jpg", "ingredients": ["225g/8oz unsalted butter", "225g/8oz caster sugar", "3 free-range eggs, beaten", "225g/8oz ground almonds", "115g/4oz instant polenta", "1 tsp baking powder (gluten-free if necessary)", "3 lemons, zest and juice only", "icing sugar, for dusting", "2 lemons, juice only", "3 tbsp caster sugar", "250g/9oz mascarpone", "2 oranges, zest only, plus splash of juice", "50-75g/1¾-2½oz icing sugar, sieved ", "75-100g/3-4oz caster sugar, for dusting", "100ml/3½fl oz orange juice ", "4 satsumas, peeled and cut in half horizontally"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Grease and line a 25cm/10in cake tin with parchment paper. ", "Place the butter and sugar in a large mixing bowl and beat with an electric whisk until pale and light. Gradually add the eggs, whisking all the time. Using a large metal spoon, stir in the ground almonds, then fold in the polenta, baking powder, lemon zest and juice and mix to combine.", "Spoon the mixture into the prepared cake tin and bake for about 1 hour 15 minutes, or until just set and golden-brown.", "Meanwhile, to make the lemon glaze, put the lemon juice and sugar into a bowl and mix well. When the cake is cooked, prick the surface and pour over the lemon mixture. Let it cool in the tin for 15 minutes.", "To make the orange mascarpone, gently beat the mascarpone, orange zest, splash of orange juice and icing sugar together until smooth. Set aside. ", "For the caramelised satsumas, heat a large frying pan over a medium heat and add the sugar and orange juice. Reduce until thickened and syrupy, add the satsuma halves and cook gently for a few minutes on each side until softened and caramelised. Reserve the syrup to serve. ", "Remove the cake from the tin and cut into wedges to serve. Transfer to a plate, dust with icing sugar and serve with a quenelle of orange mascarpone cream, the caramelised satsuma halves and drizzle the orange syrup over to serve."]}, {"isVegetarian": false, "title": "Almond cake with pears poached in red wine", "url": "www_bbc_co_uk_food_recipes_almond_cake_and_pears_45958", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_cake_and_pears_45958_16x9.jpg", "ingredients": ["110g/3½oz butter, softened, plus extra for greasing", "280g/9½oz caster sugar", "3 free-range eggs, beaten", "2–3 drops almond extract", "110g/3½oz ground almonds", "40g/1½oz plain flour", "2 oranges, rind only, cut into thin strips, to decorate", "50g/1¾oz flaked almonds, to decorate", "50g/1¾oz mixed nuts, to decorate", "crème fraîche, to serve", "300ml/10fl oz red wine ", "130g/4½oz caster sugar", "pared rind of 1 unwaxed lemon ", "1 cinnamon stick", "4 dessert pears"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Lightly butter and line a 20cm/8in loose-bottomed sandwich tin.", "Beat the butter with a wooden spoon or in a food processor to soften. Add 130g/4½oz sugar gradually, beating constantly, until soft and light. Add the eggs and almond extract and beat well. Fold in the ground almonds and flour.", "Tip the cake mixture into the prepared tin and bake for 35 minutes. Test if the cake is cooked by inserting a skewer into the centre; if it comes out clean the cake is ready. Leave the cake to cool in the tin for 10 minutes, then turn out onto a wire rack. ", "Turn the oven temperature up to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.", "Meanwhile, for the poached pears, place a large saucepan over a medium heat. Pour in the wine and 300ml/10fl oz water. Stir in the sugar, lemon rind and cinnamon stick. Bring to the boil and allow to bubble for 1 minute.", "Keeping the stalks on the pears, peel and remove the eye from the base of each pear. Place the pears in the wine syrup and poach for 30 minutes, or until tender to the point of a knife.", "To make the cake decoration, put the orange rind in a saucepan of water over a high heat. Bring to the boil, change the water and bring back to the boil. Meanwhile, make a sugar syrup by heating 50g/1¾oz sugar and 100ml/3½fl oz water in a saucepan. Place the rind in the sugar syrup and boil for 20 minutes. Transfer to the prepared baking tray and bake for 15 minutes.", "To make the nut brittle for the cake, put the remaining 100g/3½oz sugar in a saucepan over a low heat and slowly melt until it caramelises. Stir in the nuts, then pour the mixture onto baking paper to cool. Chop up into brittle. ", "Decorate the cake with the orange strips and nut brittle and serve with the poached pears and crème fraîche."]}, {"isVegetarian": true, "title": "Almond, cranberry and orange biscotti", "url": "www_bbc_co_uk_food_recipes_almond_cranberry_and_36170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "½ tsp salt", "2 tsp baking powder", "120g/4½oz skin-on almonds, roughly chopped", "50g/1¾oz dried cranberries, chopped", "3 large free-range eggs, lightly beaten", "200g/7oz caster sugar", "1 tsp aniseed extract (optional) or ¼ tsp almond extract", "1 large orange, zest only", "200g/7oz plain chocolate", "200g/7oz white chocolate", "100g/3½oz toasted flaked almonds, crushed", "100g/3½oz chopped pistachios", "edible glitter (optional)"], "serves": "Makes about 45-50 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160F Fan/Gas 4 and line two baking trays with baking parchment. ", "For the biscotti, sift the flour, salt and baking powder into a large mixing bowl. Add the rest of the biscotti ingredients and mix well.  ", "Divide the mixture into four and roll into logs around 20cm/8in long. Place two logs on each of the prepared baking trays, allowing plenty of room for them to spread. Bake for 25 minutes – they should be very pale.", "Remove from the oven and allow to cool for 10 minutes. Reduce the oven temperature to 140C/120C Fan/Gas 1.", "Cut the logs into slices about 5mm/¼in thick and place back on the baking trays cut-side down. Bake for 15 minutes and then carefully turn over and bake for a further 15 minutes. Place on wire rack to cool.", "For the decoration, melt the chocolates in two separate bowls and put the almonds and pistachios on separate plates. ", "Dip the ends of the biscotti in either the plain or white chocolate and then coat with chopped nuts or leave with just a chocolate covering. You can also add a little edible glitter for a real Christmas sparkle.", "Pack into pretty jars or cellophane bags and add a ribbon and a label if desired."]}, {"isVegetarian": true, "title": "Almond lentil stew", "url": "www_bbc_co_uk_food_recipes_almond_lentil_stew_69086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_lentil_stew_69086_16x9.jpg", "ingredients": ["2 tbsp olive oil, plus extra for frying the almonds", "1 carrot, chopped", "1 stalk celery, chopped", "1 onion, chopped", "1 turnip, chopped", "2 garlic cloves, chopped", "150g/5½oz baby button mushrooms, halved", "250g/9oz green lentils", "1.2 litres/2 pints vegetable stock", "1 bay leaf", "1 sprig rosemary", "4 sprigs thyme", "handful almonds", "1 tbsp ground cinnamon ", "10 cherry tomatoes, quartered"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan and fry the carrot, celery, onion and turnip until softened – about five minutes.", "Add the garlic and mushrooms. Fry for a further five minutes.", "Add the lentils to the pan. Pour over the stock and add the herbs. Bring to the boil, then reduce the heat and simmer for 45 minutes.", "Just before the end of the cooking time for the stew, in another pan, fry the almonds in a splash of olive oil with the cinnamon for two minutes.", "Add the cherry tomatoes and warm through.", "Serve the lentil stew with the almonds and tomatoes."]}, {"isVegetarian": true, "title": "Almond puddings with Christmas pudding ice cream", "url": "www_bbc_co_uk_food_recipes_almond_puddings_with_37419", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Christmas pudding ", "2 tbsp brandy", "50g/1¾oz marzipan, chopped into small pieces", "400g/14oz vanilla ice cream ", "150g/5½oz unsalted butter, softened, plus extra for greasing ", "150g/5½oz caster sugar ", "2 tsp almond essence", "3 medium free-range eggs ", "150g/5½oz self-raising flour ", "1 tbsp full-fat milk ", "4 x 10cm/4in discs marzipan", "300ml/10fl oz milk", "100g/3½oz caster sugar", "100ml/3½fl oz brandy ", "1 tbsp cornflour or arrowroot ", "20g/¾oz butter"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Christmas pudding ice cream, mash up the Christmas pudding, then add the brandy, chopped marzipan and mix. Stir in the ice cream and return to the freezer to set. ", "Preheat the oven to 170C/150C Fan/Gas 3.", "For the almond puddings, cream the butter and sugar together in a mixing bowl until pale and fluffy. Add the almond essence, then stir in the eggs one by one (add a little flour if the mixture starts to curdle). When the eggs are combined stir in the rest of the flour. Stir in the milk, if necessary, to make a soft dropping consistency. ", "Grease 4 individual pudding moulds and place a circle of baking paper in the bottom of each. Press a disc of marzipan into the bottom of each mould. Spoon or pipe the pudding mixture into the moulds, leaving room for them to rise. Tap to remove any air pockets.  ", "Place the moulds in a deep roasting dish and add enough boiling water to come half way up the sides of the moulds. Bake for 25 minutes, or until springy to the touch. Leave to cool a little in the moulds.", "Meanwhile, make the brandy butter sauce. Put the milk and the sugar in a heavy-based saucepan. Bring to the boil and stir in the brandy. ", "Mix the cornflour or arrowroot with 50ml/2fl oz cold water to make a milky solution free of lumps. Pour the mixture into the hot milk. Whisking all the time, simmer for 5 minutes to cook out the cornflour (do not boil or it will break down the cornflour, though arrowroot will be fine).", "Remove the pan from the heat and continue to stir. If any lumps have appeared, strain the sauce. Whisk in the butter and keep warm until ready to serve. ", "To serve, turn the puddings out onto serving plates. Add a scoop or two of ice cream and finish with the sauce. "]}, {"isVegetarian": true, "title": "Almond rice pudding and cherry compôte", "url": "www_bbc_co_uk_food_recipes_almond_rice_pudding_and_42007", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_rice_pudding_and_42007_16x9.jpg", "ingredients": ["1½ litres/2½ pints whole milk", "300g/10½oz short grain or pudding rice ", "15g/½oz butter", "3 tbsp caster sugar", "1 vanilla pod, split", "100g/3½oz blanched almonds, finely chopped", "500g/1lb 2oz cherries, pitted", "100g/3½oz caster sugar", "1 lemon, juice only", "2 tsp arrowroot", "kirsch, to taste (optional)", "100ml/3½fl oz double cream, whipped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the milk, rice, butter, caster sugar and vanilla pod into a large saucepan. Heat it very slowly, until almost at boiling point, then turn it down. Cook for around 30 minutes on a very low heat, stirring frequently to make sure it does not stick to the bottom.", "Meanwhile, make the cherry compôte. Put the cherries in a saucepan with the caster sugar, lemon juice and 300ml/10 fl oz water. Heat slowly, stirring constantly, until the sugar has dissolved, then simmer for around 10 minutes until the cherries are slightly softened. Mix the arrowroot with a little water and stir until smooth. Add to the cherries as they are simmering and stir until the sauce has slightly thickened. Add the kirsch, if using. ", "Stir the almonds into the pudding. Serve the pudding with a dollop of whipped cream and a large spoonful of the cherry compôte. "]}, {"isVegetarian": true, "title": "Almond tart", "url": "www_bbc_co_uk_food_recipes_almond_tart_40368", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_tart_40368_16x9.jpg", "ingredients": ["150g/5½oz plain flour, sifted, plus extra for dusting", "75g/2¾oz butter, chilled", "60g/2¼oz caster sugar", "1 free-range egg yolk", "225g/8oz flaked almonds", "120g/4¼oz butter", "120g/4¼oz caster sugar", "4 tbsp milk"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. For the pastry, put the flour, butter and sugar together in a food processor and blitz until they resemble breadcrumbs. Add the egg yolk and 2 tsp cold water and mix until the dough comes together. Roll out on a floured worktop to a thickness of 5mm, a little bit bigger than the base of a 24cm/9½in fluted tart tin.", "Use your fingers to press the pastry into the corners of the tin and about 1cm/½in up the sides to create a small lip around the edge. Cover with cling film and leave in the fridge for at least 30 minutes.", "Remove the cling film and prick the pastry base all over lightly with a fork. Line with baking paper and tip in baking beans or lentils. Bake for 15 minutes. Remove the baking beans and paper and return to the oven for 3–4 minutes to dry out the base without colouring.", "To make the filling, toast the almonds in a dry frying pan over medium-high heat for 2–3 minutes, until light golden-brown, keeping a close eye on them. Tip them into a bowl.", "Put the butter, sugar and milk in the frying pan over medium heat. When the sugar has dissolved and the butter melted, bring to the boil and boil for 1 minute. Add the almonds and mix well before turning into the pastry case.", "Bake for 15–20 minutes, until rich golden-brown. Remove from the oven and leave to cool. Serve warm or cold."]}]