[{"isVegetarian": true, "title": "Summer sundaes", "url": "www_bbc_co_uk_food_recipes_summer_sundaes_84021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz rolled oats", "50ml/2fl oz orange juice", "1 tsp sunflower seeds", "1 tsp pumpkin seeds", "1 small banana, sliced", "60g/2¼oz Greek-style yoghurt", "60g/2¼oz mixed berries"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the oats, orange juice, sunflower seeds and pumpkin seeds together in a bowl and set aside for 15 minutes, or until the oats have soaked up all the juice.", "Divide the oat mixture between two small glasses, then add a layer of banana. Spoon in the yoghurt, then top with the berries."]}, {"isVegetarian": false, "title": "Summer tomato salad served with tomato consommé and tapenade", "url": "www_bbc_co_uk_food_recipes_summer_tomato_salad_22698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 ripe tomatoes, chopped", "¼ cucumber, chopped", "splash Worcestershire sauce", "splash red wine vinegar", "salt", "2 garlic cloves", "handful basil leaves", "1 garlic clove", "4 tbsp capers", "200g/7oz black olives", "splash sherry vinegar", "extra virgin olive oil", "salt and freshly ground black pepper ", "5 tomatoes, preferably mixed colours", "3 asparagus spears, tips only", "5 radishes", "½ bulb fennel", "100g/3½oz broad beans", "small bunch baby basil"], "serves": "Serves 2-3", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["For the vegetable consommé, season the tomatoes and cucumbers and with Worcestershire sauce and red wine vinegar.", "Blend all the ingredients together in a food processor.  ", "Place a sieve lined with a muslin cloth on top of a bowl, then pour in the vegetable consommé mixture. ", "Bring the edges of the muslin together, tie with a piece of string and hang over the bowl. Leave for six hours to drain. Reserve the liquid consommé collected in the bowl.", "For the tapenade, blend all of the ingredients in a food processor, adding just enough olive oil until it forms a paste, seasoning to taste with salt and pepper.", "For the salad, slice the tomatoes into different sized pieces.", "Slice the asparagus, radish and fennel and place them in a bowl of cold, iced water to chill. When ready to serve, drain.", "To serve, divide the tomatoes, broad beans and chilled vegetables between four small serving bowls and garnish with the tapenade and baby basil. Pour over the consommé. "]}, {"isVegetarian": false, "title": "Spring truffle pithiviers with a Maderia reduction", "url": "www_bbc_co_uk_food_recipes_summer_truffle_60302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "250g/9oz butter, chilled and cut into pieces", "½ tsp salt", "125ml/4½fl oz ice-cold water", "4 spring truffles", "75ml/2½fl oz Madeira", "400g/14oz good-quality beef or veal stock", "2 boneless chicken breasts", "1 free-range egg, separated and yolk lightly beaten", "200ml/7fl oz double cream", "25g/1oz butter", "50g/1¾oz baby spinach", "puff pastry (from above)", "75g/2½oz butter", "1 shallot, finely chopped", "400g/14oz mixed wild mushrooms", "1 tbsp chopped fresh chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, place the flour in a mound on a clean work surface and make a well in the centre (alternatively use a large mixing bowl). Place the butter and salt in the well and rub them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated (don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly). Bring the mixture into a ball, wrap in cling film and refrigerate for 20 minutes.", "Flour a clean work surface and roll out the pastry to a 40x20cm/16x8in rectangle. (It doesn’t matter if the pastry isn’t exactly the right size - the important thing is that the corners are tidy and square.) Starting with a narrow edge of the rectangle, fold the top third down to the centre, then the bottom third up and over that. ", "Turn the pastry 90 degrees and again roll into a 40x20cm/16x8in rectangle. Fold it as before, then wrap the pastry in cling film and refrigerate for 30 minutes.", "Remove the chilled pastry and repeat the process (rolling and folding another two times). Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.", "For the spring truffle pithivier, preheat the oven to 200C/400F/Gas 6.", "Place the truffle in a saucepan with the jus and Madeira and poach for 10 minutes. Remove from the liquid and pat dry. Keep the liquid for the sauce. ", "Place the chicken in a food processor and blend. Add the egg white and blend again. Add the cream and blend to a smooth mousse. Place in a piping bag with a plain nozzle attached and set aside.", "Heat a large frying pan and, once hot, add the butter. When the butter has melted, add the spinach and cook for a couple of minutes, or until the spinach has wilted. Turn out onto kitchen paper to drain.", "Roll out the chilled pastry onto a floured surface and cut out eight circles using a saucer as a guide.", "Take four circles of pastry and lay the spinach in a circle on top of each one – leaving a 1cm/½in gap around the edge.  Place a truffle on top of each.", "Pipe the chicken mousse around the truffles and place another circle of pastry on top. Using a fork, crimp the edges to seal (if desired, you can also use a knife to draw a design on the top at this stage).", "Brush the top of the pithiviers with lightly beaten egg yolk and place in the oven for 10-15 minutes, or until golden-brown.", "Meanwhile to make the Madeira reduction, heat a pan and add one third of the butter. When melted, add the shallot and cook for a couple of minutes, then add the Madeira and stock used to cook the truffle and cook until the volume of liquid has reduced by half.", "In a separate pan, heat the remaining butter. Once hot, add the mushrooms and cook for three minutes. Set aside until ready to serve.", "To serve, place a pithivier in the centre of each plate. Add the mushrooms and drizzle the reduction around the edge. Garnish with chervil."]}, {"isVegetarian": false, "title": "Summer vegetable soup", "url": "www_bbc_co_uk_food_recipes_summer_vegetable_soup_10343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz bunch fresh basil", "100ml/3½fl oz olive oil (not extra virgin)", "4 large ripe vine tomatoes, skinned, quartered, seeds removed", "1 tbsp olive oil (not extra virgin)", "1 small onion, finely chopped", "1 stick celery, trimmed and finely sliced", "2 garlic cloves, finely sliced", "1 slender, young leek, trimmed and finely sliced", "3 small courgettes, trimmed and cut into 1cm/½in dice", "1.5 litres/2½ pints chicken stock, fresh or made with 1 chicken stock cube", "50g/1¾oz dried spaghetti", "1 tbsp tomato purée", "200g/7oz fresh peas (or frozen out of season)", "200g/7oz freshly podded baby broad beans (or frozen out of season)", "200g/7oz green beans, trimmed and cut into 1cm/½in lengths", "flaked sea salt and freshly ground black pepper", "40g/1½oz parmesan "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the basil oil, strip the basil leaves from the stalks and place in a large heatproof bowl. Half fill a large bowl with cold water and add a few ice cubes. Boil a kettle full of fresh water and pour over the basil. Immediately drain in a colander and plunge into the bowl of iced water. This will help set the vibrant green colour. Leave for five minutes.", "Drain the cooled basil leaves in a colander and tip out onto a clean tea towel. Pat gently until as dry as possible then tip into a jug. Add the oil and blend to a purée using a stick blender. (You can also do this in a small food processor.) Season with salt and freshly ground black pepper. Pour into a small bowl and set aside for at least 30 minutes. (You can then press the basil and oil through a fine sieve if you like, or leave it just as it is.)", "To prepare the soup, heat the oil in a large non-stick saucepan or frying pan and fry the onion and celery very gently for five minutes, or until softened but not coloured, stirring often. While the onion is cooking, Cut the tomato flesh into roughly 1cm/½in pieces.", "Add the garlic, leek and courgettes to the pan with the onion. Stir over a low heat for a minute or two, then stir in the freshly chopped tomatoes. Pour over the chicken stock and bring to the boil.", "Break the spaghetti into 2-3cm/1in short lengths and drop into the pan. Add the tomato purée and return to the boil. Cook for eight minutes, stirring occasionally.  Add the peas, broad and green beans and cook for a further five minutes, or until the pasta is just tender.", "Season the soup with salt and lots of freshly ground black pepper. Serve in deep bowls. ", "Drizzle with the basil oil and either grate or shave the parmesan with a vegetable peeler over the top. (Any leftover basil oil can be covered and kept in the fridge for three days. Allow stand at room temperature before using.)"]}, {"isVegetarian": false, "title": "Summer berries and red wine jelly", "url": "www_bbc_co_uk_food_recipes_summerberriesandredw_68025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz strawberries", "110g/4oz blackberries", "110g/4oz raspberries", "110g/4oz blue berries", "110g/4oz loganberries", "2 oranges, juice only", "110g/4oz sugar", "1 vanilla pod, split lengthways", "1 cinnamon stick", "500ml/17fl oz red wine (something light, for example pinot noir)", "300ml/10fl oz red port", "8 sheets gelatine"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a hot pan place the sugar with the vanilla and cinnamon.", "Start adding the berries, firmest first and softest last and then the orange juice.", "Cook the berries for approximately 5 minutes and remove from the heat. Chill them in the fridge.", "Warm the wine and port in a pan. Soften the gelatine in a little cold water and slowly add to the wine. Once it is all incorporated place it in a flat container and chill it.", "Once the jelly has set, place it on a clean cloth and chop the jelly into small crystals, then put it back in the container. ", "Spoon the jelly into the centre of the plate and drizzle the berries around it to serve."]}, {"isVegetarian": false, "title": "Summer vegetable soup with mussels", "url": "www_bbc_co_uk_food_recipes_summer_vegetable_soup_45439", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_vegetable_soup_45439_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "1 banana shallot, finely chopped", "150g/5oz courgettes, trimmed, cut into 1cm/½in cubes", "1 fennel bulb, cut into 1cm/½in cubes, leafy fronds reserved", "150g/5oz carrots, peeled, cut into 1cm/½in cubes", "100g/3½oz celery stems, trimmed, cut into 1cm/½in cubes", "8 radishes, trimmed, cut in half from top to base", "500g/1lb 2oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when firmly tapped)", "150ml/5fl oz white wine", "750ml/1¼ pints vegetable stock", "2 tbsp chopped fresh mint leaves, stalks reserved", "2 tbsp chopped fresh dill fronds, stalks reserved", "2 tbsp chopped fresh tarragon leaves, stalks reserved", "2 tbsp chopped fresh flatleaf parsley leaves, stalks reserved", "2 tbsp chopped fresh watercress leaves, stalks reserved", "2 tbsp chopped fresh basil leaves", "1 large shallot, roughly chopped", "6 anchovies, drained, roughly chopped", "2 tbsp capers, drained and rinsed", "½ lemon, juice only", "1 tsp Dijon mustard", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt the butter in a heavy-based, lidded saucepan over a low to medium heat. Add all of the vegetables and fry gently for 4-5 minutes, or until just softened.", "Add the mussels, wine and stock and bring the mixture to the boil. Cover the pan with the lid and reduce the heat until the mixture is simmering. Simmer for 2-3 minutes, or until the mussels have opened. (Discard any mussels that do not open during cooking.)", "For the salsa verde, put all the herbs in a food processor and pulse until roughly chopped. Add the shallot, anchovies, capers, lemon juice, mustard and oil and blend to a rough purée. Season, to taste, with salt and freshly ground black pepper.", "Remove the soup from the heat and stir in 2-3 tablespoons of the salsa verde.", "Serve immediately, with an extra dollop of salsa verde on top of each portion. (Any remaining salsa verde can be decanted into an airtight container and covered with a thin layer of olive oil. It can be kept in the fridge for up to four days.)"]}, {"isVegetarian": false, "title": "Summer berry trifle", "url": "www_bbc_co_uk_food_recipes_summerberrytrifle_93217", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 135g/4¾oz packet raspberry or strawberry jelly ", "170g/6oz ready-made jam-filled Swiss roll", "5 tbsp cream sherry", "75g/2½oz blueberries", "100g/3½oz raspberries", "150g/5oz strawberries, hulled and halved ", "300ml/10½fl oz milk", "300ml/10½fl oz double cream", "1 vanilla pod, split, seeds scraped out", "2 tbsp cornflour", "2 tbsp cold water", "4 large free-range egg yolks", "75g/2½oz caster sugar", "10g/½oz flaked almonds", "300ml/10½fl oz double cream"], "serves": "6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Prepare the jelly according to packet instructions, but do not place it into the fridge to set. ", "Cut the Swiss roll into 12 equal slices and arrange them over the base and a short way up the sides of a glass trifle bowl. Put any remaining slices in the middle of the bowl. ", "Spoon the sherry over the Swiss roll slices and allow to soak into the sponge for a few minutes. Scatter the fruit on top of the soaked sponge. Pour the prepared jelly over the fruit. Cover the dish with cling film and leave to set in the fridge for about two hours. ", "Meanwhile, for the custard, pour the milk and cream into a medium heavy-based pan. Add the vanilla pod and seeds, then slowly bring to the boil. Once the mixture comes to the boil, remove from the heat and set aside to infuse for 15 minutes. Remove and discard the vanilla pod. ", "Mix the cornflour with the water in a small bowl until smooth and well combined, then set aside. ", "Whisk the egg yolks and sugar in a large bowl until pale and fluffy. Gradually stir the warm milk and cream mixture into the egg and sugar mixture until smooth. Return the mixture to the saucepan and heat over a low heat. ", "Cook for around 8-10 minutes, stirring continuously, until the custard has thickened enough to coat the back of a wooden spoon. ", "Give the cornflour mixture a stir, then mix quickly into the custard. Cook for 1-2 minutes more, or until the custard is very thick and smooth, stirring continuously.", "Remove the pan from the heat and pour the custard into a bowl placed over a second bowl filled with iced water. Cover the surface of the custard with cling film to prevent a skin from forming. Set aside until the custard has cooled. ", "When the custard has cooled, remove and discard the cling film. Stir the custard a few times, then gently pour onto the set jelly. ", "Cover with cling film and return the trifle dish to the fridge for a further 30 minutes, or until the custard is lightly set. ", "For the topping, lightly toast the almonds in a dry frying pan over a low heat for 2-3 minutes, or until golden-brown (keep the almonds moving around the pan frequently to prevent them from burning). Set aside to cool. ", "Whip the cream in a bowl until soft peaks form when the whisk is removed. Spoon the whipped cream over the custard, starting at the sides of the bowl before working your way into the middle. Scatter over the almonds, cover and return to the fridge until ready to serve. ", "To serve, spoon the trifle into serving bowls and eat immediately."]}, {"isVegetarian": false, "title": "Summer fruits gâteau", "url": "www_bbc_co_uk_food_recipes_summerfruitsgateau_72273", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g/9oz sponge flan cases", "600ml/1 pint double cream", "25g/1oz caster sugar", "2 tbsp brandy", "1 packet ladyfinger biscuits", "1 jar fruit compote", "1 large punnet raspberries", "55g/2oz icing sugar", "mixed fresh fruits, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Line a 18cm/7in baking tin or springform tin with a little oil and cling film.", "Cut out the centre of both flans using a 20-25cm/8-10in springform tin base as a guide. ", "Line the bottom of the tin with one of the circles, and reserve the other.", "Whip the double cream with the sugar and brandy until thick, and put in the fridge.", "Cut the ladyfinger biscuits in half. Line the ring with the ladyfinger halves so that they form an attractive exterior.", "Spoon the fruit compote in the bottom of the flan in an even layer.", "Spoon the chilled, whipped cream into the ring and gently press to the edges, ensuring that you keep the biscuits in place.", "Scatter over the raspberries.", "Add the other sponge disc and press it down gently. ", "Put a plate over the bottom of the tin and, carefully, turn the tin over. ", "Gently remove the springform tin but keep the cling film in place. Put the cake into the fridge and let it set for at least one hour.", "Remove from the fridge and take off the cling film. Dust with icing sugar, garnish with fresh fruits and serve."]}, {"isVegetarian": true, "title": "Summer pickle", "url": "www_bbc_co_uk_food_recipes_summerpickle_74851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 apples, chopped", "1 onion, chopped", "150g/5¼oz raisins ", "1 banana", "6 tomatoes", "1 garlic clove, crushed", "1 red chilli, de-seeded and chopped", "white wine vinegar, to taste", "caster sugar, to taste", "25g/1oz butter ", "1 cauliflower, chopped into florets", "4 Granny Smith apples, cored and chopped", "400g/14¼ oz onions, chopped", "150g/5¼ oz golden raisins", "100ml/3½fl oz white wine vinegar", "50g/1¾oz muscovado sugar", "50g/1¾oz molasses"], "serves": "1.5kg", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the fruit compote by placing all the ingredients, except the vinegar and sugar, in a large saucepan. Heat gently until the fruit is soft and stewed.  Taste and adjust the seasoning - adding sugar if it's too savoury, vinegar if it's too sweet.  Set aside.", "For the pickle, heat the butter in a heavy pan. ", "Add the fruit, vegetables, vinegar, sugar and molasses and bring to the boil, stirring occasionally to dissolve the sugar.  ", "Tip in the fruit compote and simmer gently for 20 minutes.  ", "Leave to cool then decant into sterilised preserving jars. The flavour will improve over time. ", "For non-vegetarians it is a good accompaniment to slices of roast beef and chicken liver parfait."]}, {"isVegetarian": true, "title": "Summer pudding", "url": "www_bbc_co_uk_food_recipes_summerpudding_90295", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summerpudding_90295_16x9.jpg", "ingredients": ["750g/1lb 14oz mixed summer fruit (such as raspberries, red, white and blackcurrants, tayberries, loganberries, blackberries, cherries and blueberries", "185g/6½oz caster sugar", "1 medium loaf good-quality white bread, slightly stale", "2 tbsp cassis or blackcurrant cordial"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the fruit in a pan. Remove the stems from the redcurrants (if using) with a fork, pour the sugar over the fruit and stir gently to mix together.", "If you have time, cover the pan with a tea towel or cling film and leave for 3-5 hours (or overnight) to get the juices running. Place the pan over a moderate heat and bring gently up to the boil.", "While the fruit is simmering, cut the bread into thin slices and remove the crusts.", "When the juices are beginning to flow, raise the heat slightly and simmer for about 2-3 minutes. Then turn off the heat and stir in the cassis or blackcurrant cordial.", "Cut a round out of one slice of bread to fit the bottom of the bowl, then cut the remaining slices into triangular wedges.", "Dip one side of the bread circle into the juices in the pan containing the fruit, then place the circle in the bottom of the pudding basin, juice-side down. Do the same with the bread triangles, dipping one side of the bread into the juices before placing them around the edge of the bowl, with the dipped side facing outwards. The tips of the bread triangles will be sticking up from the top of the bowl at this stage.", "Once the bowl is completely lined with the juice-soaked bread (be sure to plug any gaps with small pieces of bread if necessary), spoon all of the fruit and its juices into the pudding basin. Trim the tips of bread from around the edge. Cover the top of the fruit with more wedges of bread. Place the pudding basin on a plate to collect any juices.", "Find a saucer that fits neatly inside the bowl. Place it on top to cover the upper layer of bread, then weigh the saucer down with weights - bags of rice, tins of baked beans, or whatever comes to hand. Let it cool, then place in the fridge overnight.", "The next day, remove the weights and the saucer. Run a thin blade around the edges, then invert the basin onto a shallow serving plate.", "Turn the pudding out, cut into thick slices and serve the summer pudding with cream."]}, {"isVegetarian": false, "title": "Individual summer puddings", "url": "www_bbc_co_uk_food_recipes_summerpudding_91739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz sugar", "100ml/3½fl oz water", "1 vanilla pod, seeds scraped out", "100g/3½oz blueberries", "100g/3½oz strawberries, hulls removed, quartered", "100g/3½oz raspberries", "2 tbsp orange liqueur", "12 slices white bread, crusts removed, sliced in half", "3 tbsp finely chopped rose-flavoured Turkish delight ", "icing sugar", "clotted cream", "3 tbsp finely chopped rose-flavoured Turkish delight"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the sugar, water and vanilla pod and seeds into a pan and bring to the boil. Reduce the heat and simmer for 7-8 minutes, then add the berries and orange liqueur. Remove the pan from the heat and set aside to cool. ", "When cooled, strain the berries through a sieve, reserving both the liquid and the fruit in separate bowls. Discard the vanilla pod. ", "Dip the bread slices in the fruit juice, then use a third of the soaked bread slices to line four small dariole moulds. Spoon some of the berries into the bottoms of each mould, then divide half of the chopped Turkish delight among them. Top with half of the remaining soaked bread, then spoon over the remaining berries and top with the remaining soaked bread. Press down to pack the bread and berries into the moulds. ", "Cover the moulds with cling film and chill in the fridge overnight. ", "To serve, turn the puddings out onto serving plates, dust with icing sugar and top with a dollop of clotted cream. Sprinkle over the chopped Turkish delight and serve."]}, {"isVegetarian": true, "title": "Summer pudding", "url": "www_bbc_co_uk_food_recipes_summerpudding_91969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz fresh raspberries", "800g/1¾lb fresh strawberries, hulls removed, cut in half", "600g/1lb 5oz fresh blackcurrants or redcurrants", "300g/10½oz caster sugar", "½ lemon, juice only", "150ml/5fl oz white wine", "300ml/10½fl oz water", "12 slices thick-cut white bread, crusts removed", "fresh Jersey double cream, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Bring half of the fruit and all of the sugar, lemon juice, wine and water to a simmer in a pan. Continue to simmer for 4-5 minutes, stirring regularly, until the berries have softened and the sugar has dissolved. ", "Transfer the cooked fruit to a sieve using a slotted spoon and strain any liquid back into the pan. Set the drained fruit aside. ", "Bring the fruit juice mixture to the boil and cook for 20-25 minutes, or until the volume of liquid has reduced to a syrup.", "Strain the syrup mixture into a clean pan, reserving 200ml/7fl oz of the strained syrup in a separate bowl. ", "Return the cooked fruit to the pan containing the fruit syrup. Set aside to cool.", "When the syrup and cooked fruit are completely cool, add the remaining (uncooked) fruit and stir well to combine. ", "Line a 1.8 litre/3 pint pudding basin with 2 large sheets of clingfilm (the edges of the clingfilm should hang over the top of the basin so that they can be used to cover the base of the pudding). ", "Cut 10 of the bread slices into two equal-sized rectangles. Thoroughly paint one side of each bread rectangle with the reserved 200ml/7fl oz of fruit syrup. ", "Using the open end of the pudding basin as a template, cut a disc from one of the remaining whole slices of bread and paint one side of it with the fruit syrup. ", "Using the base of the pudding basin as a template, cut a disc from the remaining whole slice of bread and paint one side of it with the fruit syrup. (Reserve any remaining fruit syrup.)", "Put the small bread disc, painted-side down, into the base of the pudding basin. Arrange the bread rectangles, painted-sides down, around the insides of the basin, overlapping the slices slightly where they join.", "Fill the pudding basin with the mixed fruit and top with the remaining large bread disc. ", "Draw the excess cling film layers over the base of the pudding until it is completely sealed. Place a small plate on top of the pudding basin and weigh down with a heavy weight.  ", "Chill the summer pudding in the fridge overnight. ", "To serve, unwrap the clingfilm from the base of the summer pudding. Invert the summer pudding onto a serving plate and remove the remaining cling film. Cut the summer pudding into wedges and serve with cream (if using) and any remaining fruit syrup."]}, {"isVegetarian": true, "title": "Summer red fruits in beer batter", "url": "www_bbc_co_uk_food_recipes_summerredfruitsinbee_12294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 punnet of strawberries", "1 punnet of raspberries", "30g/1oz yeast", "250ml/9fl oz beer or lager", "180g/6oz plain flour", "1 tsp white wine vinegar", "a pinch of salt", "a pinch of sugar", "oil for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dissolve the yeast in the beer and add in the salt, sugar and vinegar together into a large mixing bowl. ", "Sieve the flour into the liquid and beat till smooth and creamy. Place in the fridge for at least 20 minutes before use. ", "Heat the oil in a frying pan to 180C/350F/Gas 4.", "Hull the strawberries and cut in half. Dip the strawberries and raspberries in some flour shaking off the excess.", "Add the fruit to the batter, remove and drain off any excess and place directly into the hot oil and fry until golden and puffed up.", "Drain on kitchen paper and dust them  with caster sugar (a little finely ground black pepper added to the sugar is a nice twist).", "Make a coulis from both fruits pureéd together with caster sugar and lemon juice, using a hand blender. Pass the coulis through a sieve to remove the seeds.", "Serve the fruits with the coulis and either a dollop of clotted cream or crème fraîche"]}, {"isVegetarian": false, "title": "Summer roast lamb with crunched spiced potatoes, goats' cheese and spinach", "url": "www_bbc_co_uk_food_recipes_summerroastlambwithc_74877", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shoulder lamb, boned and butterflied", "4 tsp olive oil", "2 sprigs rosemary, finely chopped ", "½ tsp rock salt", "1 small tin anchovy fillets, finely chopped ", "1 lemon, zest and juice only", "½ tsp demerara sugar", "500g/17oz new potatoes, quartered", "200g/7oz semolina ", "1 tbsp chilli powder", "½ tbsp garlic salt ", "½ tbsp cumin ", "½ tbsp dried oregano ", "freshly ground black pepper", "2 bags pre-packed baby spinach, washed and drained ", "1 bunch fresh mint, finely chopped", "300g/10½oz goats' cheese, crumbled into pieces ", "1 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven 170C/338F/Gas 3.", "Rub the lamb with the olive oil and place on a roasting tray.", "Sprinkle over the chopped rosemary, salt, chopped anchovy fillets, lemon juice and zest and sugar. Turn the lamb, massaging the ingredients into the meat.", "Place in the oven, skin side up, and roast for one-and-a-half hours.", "Meanwhile, for the crunched, spiced potatoes, blanch the new potatoes for five minutes in boiling salted water.", "Combine the semolina in a large bowl with all the remaining ingredients.", "When cooked, strain the potatoes and, while still hot, transfer them into the bowl with the semolina. Toss well and shake off any excess through a colander.", "Transfer the potatoes to a well-oiled tray for the last half an hour of the lamb's cooking time. If you have a large enough oven and a large enough roasting tray, you can arrange the potatoes around the lamb to cook.", "Meanwhile, mix together the spinach, mint and pieces of goats' cheese in a large bowl.", "Remove the lamb from the oven when it's cooked and allow to rest for a few minutes before carving into slices.", "Add the potatoes to the spinach and goats' cheese. Add the red wine vinegar and toss thoroughly.  ", "Transfer the potato and spinach mixture onto a large platter and place slices of lamb over the top. Spoon over the cooking juices from the lamb and serve."]}, {"isVegetarian": true, "title": "Summer salad", "url": "www_bbc_co_uk_food_recipes_summersalad_91685", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summersalad_91685_16x9.jpg", "ingredients": ["250g/9oz baby broad beans, pods removed", "300g/10½oz baby carrots, scrubbed, green bases left on", "1 bunch radishes, trimmed, cut in half", "100g/3½oz fresh peas, pods removed ", "Small handful fresh mint leaves, torn", "6 lemon balm leaves, torn (optional) ", "Small bunch fresh chives ", "Large handful fresh, young curly-leaved parsley leaves, chopped", "1 Little Gem lettuce, or similar crisp lettuce, core removed, leaves separated", "2 tbsp white wine vinegar", "2 tsp Dijon mustard", "1 heaped tsp caster sugar", "Pinch sea salt flakes ", "3½ tbsp sunflower oil", "3½ tbsp olive oil", "Salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a pan of salted, boiling water for 2-3 minutes, or until tender. Drain well, then refresh in cold water and peel away the outer membranes. ", "Cook the carrots in a pan of boiling water for 3-4 minutes, or until just tender. Drain well, then refresh in cold water.", "Place the cooked beans and carrots, the radishes, peas, mint leaves, lemon balm leaves (if using), chives, chopped parsley and lettuce leaves, into a bowl and mix well to combine. Set aside.", "For the vinaigrette, whisk together the white wine vinegar, mustard, sugar and salt in a bowl until smooth and well combined. Gradually whisk in the sunflower oil and olive oil until the mixture has thickened and is glossy. Season, to taste, with salt and freshly ground black pepper.", "To serve, drizzle the vinaigrette over the summer salad and mix well to coat the leaves. Divide equally among four serving plates."]}, {"isVegetarian": true, "title": "Summer turnips", "url": "www_bbc_co_uk_food_recipes_summerturnips_12916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 baby turnips", "2 sticks celery, sliced on an angle into 4 or 5 pieces ", "100g/4oz butter", "water"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the celery and turnips in 100g/4oz of butter and 50ml/2fl oz water until soft but not overdone."]}, {"isVegetarian": true, "title": "Summer vegetable salad", "url": "www_bbc_co_uk_food_recipes_summervegetablesalad_12153", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large aubergine", "olive oil, for coating", "sea salt, to taste", "1 large red capsicum, deseeded and cut into six pieces", "1 large green capsicum, deseeded and cut into six pieces", "1 tomato, cored and halved crosswise", "1 Spanish onion, cut into wedges", "2 cloves of garlic, crushed", "1 tsp dijon mustard", "1 tbsp capers, drained", "1 tbsp red wine vinegar", "1 tsp sherry vinegar", "sea salt", "50ml/2fl oz extra virgin olive oil", "½ bunch flatleaf parsley, leaves roughly torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Thinly slice the aubergine lengthwise and toss with olive oil and sea salt, then cook on a hot barbecue or chargrill until charred and tender.", "Toss the remaining vegetables in olive oil and sea salt and cook on a hot chargrill or barbecue until charred and tender.", "Place all the cooked vegetables in a large bowl.", "For the dressing, combine the garlic, mustard, capers and vinegars in a bowl, season with sea salt to taste and stir in the olive oil. Add the parsley leaves and mix well to combine.", "Pour the dressing over the vegetables and toss well to coat them."]}, {"isVegetarian": true, "title": "Summer vegetable casserole with smoked ricotta dumplings", "url": "www_bbc_co_uk_food_recipes_summervegetablecasse_89315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz smoked ricotta (available from delicatessens and specialist cheese shops)", "350g/12oz cooked mashed potato", "1 free-range egg", "450g/1lb plain flour", "salt and freshly ground black pepper", "2 tbsp butter, for frying", "2 tbsp olive oil", "1 onion, sliced", "1 garlic clove, finely chopped ", "1 carrot, finely chopped", "1 celery stick, finely chopped", "1 red pepper, finely chopped", "1 green pepper, finely chopped", "50ml/2fl oz white wine", "2 lemons, juice and zest only", "330g/12oz Puy lentils, washed", "400ml/14fl oz vegetable stock", "1 tbsp chopped fresh parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheese dumplings, place the smoked ricotta, mashed potato and egg into a bowl and mix well to combine.", "Add the flour and mix to form a dough. Season well with salt and freshly ground black pepper.", "Roll the cheese mixture into 3cm-4cm/2in-2½in balls.", "Place the cheese dumplings into a pan of boiling water and cook until they rise to the surface of the water. ", "Remove the cheese dumplings with a slotted spoon and drain on kitchen paper.", "For the casserole, heat the oil in a pan over a medium heat, then fry the onion, garlic, carrot, celery, red and green pepper until just soft.", "Add the wine and the lemon juice and zest and bring to the boil. Cook until the liquid has almost completely reduced.", "Add the lentils and stock and bring to the boil. Reduce the heat and simmer for 20-25 minutes, or until the lentils are cooked through but still a little al dente.", "Add the parsley and season, to taste, with salt and freshly ground black pepper. ", "To finish the cheese dumplings, melt the two tablespoons of butter in a frying pan over a medium heat. ", "Add the cheese dumplings and fry until crisp and golden-brown all over.", "To serve, place three cheese dumplings into each bowl and spoon equal amounts of the casserole around each set of dumplings."]}, {"isVegetarian": true, "title": "Summery green coleslaw", "url": "www_bbc_co_uk_food_recipes_summery_green_coleslaw_23859", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summery_green_coleslaw_23859_16x9.jpg", "ingredients": ["100g/3½oz  peas or broad beans", "1 small green cabbage, shredded", "1 large courgette, grated or cut into matchsticks", "1 large fennel bulb, finely sliced into matchsticks", "1 bunch spring onions, finely sliced", "2 celery sticks, finely chopped", "1 green apple, grated", "½ lime, juice only", "1–2 tbsp chopped fresh herbs including basil, mint", "2 tbsp plain yoghurt", "2 tbsp low-fat mayonnaise", "1 lemon, zest and juice", "1 tbsp fresh herbs", "pinch sugar "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the coleslaw, bring a pan of water to the boil, add the peas or beans, bring the water back to the boil and cook for 2 minutes, then refresh in cold water, drain and set aside. ", "Place the peas or beans, cabbage, courgette, fennel, spring onions, celery and apple into a large bowl and mix. Finish with the lime juice and fresh herbs.", "To make the dressing, mix all the ingredients together in a small bowl. Dress the coleslaw just before serving. "]}, {"isVegetarian": false, "title": "Sun-blushed tomato and feta salad", "url": "www_bbc_co_uk_food_recipes_sun-blushed_tomato_and_23591", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-blushed_tomato_and_23591_16x9.jpg", "ingredients": ["150g/5½oz sun-blushed tomatoes (see tip), quartered ", "75g/2¾oz pitted black olives in oil, drained and halved", "2 tbsp olive oil or oil drained from the sun-blushed tomatoes", "150g/5½oz good-quality feta cheese, crumbled into small chunks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the tomatoes, olives and oil in a bowl and stir together, then gently mix in the feta. "]}, {"isVegetarian": false, "title": "Sun and sea kebabs", "url": "www_bbc_co_uk_food_recipes_sun_and_sea_kebabs_62733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cherry tomatoes", "1 satsuma, peeled, segmented", "70g/2½oz white fish, cut into 6 pieces", "6 small fresh sage leaves", "2 tsp olive oil", "pinch paprika"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Soak two wooden skewers in water for 10 minutes.", "Thread a tomato onto one of the  wooden skewers and then add a piece of fish, followed by a sage leaf. Then add some satsuma segments. Repeat the process, then thread the remaining ingredients onto another wooden skewer.", "Put the kebabs on a baking tray and drizzle with the oil, then sprinkle over the paprika.", "Bake in the oven for 15-20 minutes, or until the kebabs are cooked through."]}, {"isVegetarian": false, "title": "Sun-dried tomato, emmental cheese and pesto puff pastry tarts", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_04502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice cold water", "60g/2¼oz fresh basil leaves", "50g/2oz pine nuts, toasted", "50g/2oz Parmesan, grated", "2 cloves garlic, peeled", "125-175ml/4-6fl oz extra virgin olive oil", "275g/10oz puff pastry (from above)", "2 tbsp wholegrain mustard", "200g/7oz emmental cheese, grated", "100g/4oz fresh tomatoes, sliced", "75g/2¾oz sun-dried tomatoes, diced", "2 tbsp olive oil", "1 egg yolk, beaten", "handful rocket leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound on a clean work surface and make a deep well in the centre using your fingers. Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand. Work in the flour until the mixture is loosely but well combined and still with lumps of butter visible.", "Gradually add the iced water and mix until you have a rough dough. (You may not need all of the water. Take care not to overwork the mixture.) Roll the dough into a ball, wrap in cling film and chill for 20 minutes in the fridge.", "When the dough has chilled, roll it out on a lightly-floured work surface into a 40x20cm/16x8in rectangle. Fold the rectangle into three and give it a quarter turn. Repeat the process, giving the folded pastry another quarter turn. Wrap the pastry in cling film and chill for a further 30 minutes. Once chilled, repeat the process of rolling, folding and turning two more times, making a total of four turns. Wrap the pastry in cling film and place in the fridge for at least 30 minutes.", "For the pesto, place the basil, pine nuts, Parmesan and garlic in a pestle and mortar and grind, while gradually adding the extra virgin olive oil until a paste is formed. ", "For the tarts, preheat the oven to 200C/180C Fan/Gas 6. ", "Roll the pastry out on a lightly-floured surface to a 2mm/1/8in thickness. Cut out six discs using a 12cm/5in pastry cutter. Score around the edge of the circle about 2cm from the edge. Line a baking tray with baking parchment and brush with a little cold water. Transfer each of the pastry discs onto the tray using a palette knife.", "Brush the inside ring of the tarts with the mustard, sprinkle over the cheese and top with the two types of tomatoes. Drizzle with olive oil and brush the pastry with egg yolk around the edges.", "Bake in the oven for 12-15 minutes, or until the pastry is golden-brown. ", "To serve, garnish the tarts with the pesto and some fresh rocket."]}, {"isVegetarian": true, "title": "Sun-dried tomato and poppy seed savoury biscuits", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_86934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_86934_16x9.jpg", "ingredients": ["375g/13oz plain flour, plus extra for dusting", "1 tsp salt", "125g/4½oz unsalted butter, softened", "2 medium free-range eggs", "2 tbsp poppy seeds", "40g/1½oz parmesan, grated (or a similar vegetarian hard cheese)", "1 tbsp sun-dried tomato paste ", "1 tbsp sesame seeds"], "serves": "Makes 36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour, salt, butter, one of the eggs and 40ml/1½fl oz water into a bowl and mix well for five minutes until you have a smooth dough. Divide the dough in half.", "On a lightly floured work surface, knead the poppy seeds in to one half of the dough and the parmesan and sun-dried tomato paste to the other.", "Using a rolling pin, roll out each piece of dough on a lightly floured work surface to about 3mm thick. Place each piece of dough on a baking tray, cover with cling film and refrigerate for 30 minutes.", "Preheat the oven to 200C/180C(fan)/Gas 6.  Dust two large baking trays with flour. ", "Using a 7cm/2¾cm round cutter cut out 18 rounds from each half of the dough, re-rolling as necessary. Place the rounds on the baking tray. ", "Brush the biscuits with beaten egg and sprinkle the parmesan and tomato ones with sesame seeds.", "Bake for 10-15 minutes until golden-brown. Remove from the oven and transfer to a wire rack to cool. Serve warm or cold. "]}, {"isVegetarian": true, "title": "Sun-dried tomato and rosemary palmiers", "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_97049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_97049_16x9.jpg", "ingredients": ["500g/1lb 2oz ready-made puff pastry", "plain flour, for dusting", "1 x 280g/10oz jar sun-dried tomatoes, drained and finely chopped", "few sprigs fresh rosemary, leaves only, finely chopped", "1 free-range egg, lightly beaten"], "serves": "Makes 25-30 palmiers", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the puff pastry on a well-floured surface and bash it with a rolling pin. Usually you need to be quite delicate with puff pastry as it needs to puff up a lot, but for palmiers it only needs to puff up a little. Roll the pastry out into a rectangle about 30 x 35cm/12 x 14in and the thickness of a £1 coin. Spread the tomatoes over the puff pastry and sprinkle over the rosemary.", "With the shortest end facing you, take both long edges of the pastry and roll them towards each other to meet in the middle. Brush a little egg down the centre to stick the two halves together. Carefully lift into a large baking tray (making sure it will fit in your fridge first) and put in the fridge for at least 30 minutes to chill and harden.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the roll from the fridge and, using a very sharp knife, slice it into 1cm/½in thick pieces. Lay each piece on the baking tray, cut-side up, and brush well with the beaten egg, then bake in the oven for 10–15 minutes until puffed up, crisp and golden-brown.", "Remove the palmiers from the oven and leave to cool on the baking tray.", "To serve, pile them high on a plate. These are great little canapés for waiting guests."]}, {"isVegetarian": true, "title": "Sun-blushed tomato and shallot spaghetti", "url": "www_bbc_co_uk_food_recipes_sunblushedtomatoands_85986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ shallot, finely chopped", "1 garlic clove, finely chopped", "125g/4½oz sun-blushed tomatoes, chopped", "splash white wine", "handful each fresh chives, parsley, basil, chopped", "½ lemon, juice only", "250g/9oz fresh spaghetti, cooked", "1 lemon, cut into wedges, to garnish"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large frying pan, add the shallot and fry gently for two minutes. Add the garlic and cook for one minute. Add the tomatoes and wine and cook for four minutes, or until softened. Stir in the herbs, lemon juice and the cooked spaghetti. ", "Mix well to coat pasta and spoon into a serving bowl.", "To serve, garnish with lemon wedges."]}]