[{"ingredients": ["1 cucharada de levadura seca de acción rápida", "600ml / 20fl oz de agua tibia, más extra para la levadura", "1 cucharadita de azúcar en polvo", "1kg / 2lb 4oz de harina de pan fuerte", "30 g / 1 oz de sal", "aceite de oliva, para engrasar", "botón de mantequilla, para engrasar", "60ml / 2fl oz de aceite de oliva virgen extra", "350 g / 12 oz de queso feta, desmenuzado", "pizca de pimienta negra recién molida", "puñado de menta fresca, picada", "1 huevo de gallinas camperas, golpeado", "75g / 2¾oz de mantequilla sin sal", "100 g / 3½ oz de miel", "Fechas medjool 250 g / 9 oz", "1 cucharada de pistachos sin cáscara"], "method": ["Disuelva la levadura en un poco de agua tibia. Agregue el azúcar y mezcle suavemente.", "Mezcle la harina y la sal, luego coloque en una pila sobre una superficie de trabajo limpia. Haz un pozo en el centro de la harina.", "Agregue el agua restante y la mezcla de levadura al pozo en la harina y mezcle, desde el centro hacia afuera, para formar una masa.", "Amasar la masa durante 7-8 minutos, hasta que deje de ser pegajosa. (La masa está lista cuando se estira entre las manos sin romperse).", "Engrase un recipiente con el aceite de oliva y coloque la masa en él. Cubra con un paño húmedo y déjelo durante al menos dos horas. La mezcla debe duplicar su tamaño durante este tiempo.", "Extienda la masa sobre una superficie de trabajo limpia y, con sus manos, retírela para reducir el tamaño de la masa.", "Agregue el aceite, el queso feta, la pimienta negra recién molida y la menta y amasar en la masa hasta que estén completamente combinados.", "Divida la masa en cuatro porciones del mismo tamaño, luego déle forma a los panes.", "Coloque los panes en una bandeja de horno enharinada. Cubra con un paño húmedo y deje que se levante a temperatura ambiente durante 40-60 minutos.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Cepille los panes con el huevo batido.", "Coloque en el horno para hornear durante 20-30 minutos, o hasta que esté cocido y dorado. Retirar y dejar enfriar.", "Para las fechas con miel, coloca la mantequilla y la miel en una sartén a fuego medio. Llevar a ebullición y agregar las fechas y los pistachos y cocinar por dos minutos.", "Para servir, corta los panes y sirve las fechas melosas en un tazón al lado."], "url": "www_bbc_co_uk_food_recipes_fetacheesebread_90173", "title": "Pan de queso feta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5¾oz chuleta de cordero", "½ cucharada de aceite de oliva", "1 limón, solo jugo", "55 g / 2 oz de queso feta, desmenuzado", "sal y pimienta negra recién molida", "150g / 5oz de cuscús", "200ml / 7fl oz de caldo de verduras calientes", "1 limón, solo jugo", "5 cucharadas de aceite de oliva", "100g / 3½oz de uva", "puñado de cilantro fresco, picado"], "method": ["Precalentar la parrilla a la configuración más alta.", "Frote el cordero con aceite de oliva y fría en una sartén caliente durante tres minutos a cada lado.", "Exprima el jugo de limón sobre el cordero y cubra con el queso feta. Sazonar con sal y pimienta negra recién molida.", "Coloque debajo de la parrilla caliente durante dos minutos o hasta que el queso se ponga dorado. Retire de la parrilla y deje reposar durante cinco minutos.", "Para el cuscús, coloque el cuscús en un recipiente resistente al calor y vierta sobre el caldo caliente. Cubra con un plato y déjelo reposar durante cinco minutos.", "Retire la placa y esponje el cuscús con un tenedor.", "Agregue el jugo de limón y el aceite y sazone bien.", "Revuelva a través de las pasas y el cilantro y apile en un plato para servir. Coloque el cordero sobre la cama de cuscús y sirva."], "url": "www_bbc_co_uk_food_recipes_fetacrustedlambwithc_86808", "title": "Cordero con corteza de feta con cuscús y cuscús con pasas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de queso feta, en cubos pequeños", "10 aceitunas negras, deshuesadas y picadas", "50g / 2oz de tomates secados al sol, escurridos de aceite y picado (reserve 1 cucharada de aceite)", "Harina de 175g / 6oz de auto crianza", "50 g / 2 oz de harina de trigo integral", "¼ cucharada de polvo de hornear", "¼ nivel de cucharadita de pimienta de cayena", "¼ nivel de polvo de mostaza en cucharadita", "2 cucharadas de aceite de oliva virgen extra", "1½ nivel de cucharadita de tomillo fresco, picado", "1 huevo", "2 cucharadas de leche", "leche, para cepillar", "50g / 2oz de feta, desmenuzado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Tamiza las harinas y el polvo de hornear en un tazón grande y espacioso, inserta cualquier salvado que quede", "en el colador, a continuación, agregue la cayena y la mostaza en polvo y, con un cuchillo, trabaje en las 2 cucharadas de aceite de oliva, más la cucharada reservada de aceite de los tomates secados al sol.", "Cuando la mezcla se vea como migas de pan grumosas, mezcle el tomillo picado, el queso feta en cubos, las aceitunas y los tomates secados al sol.", "Ahora en un recipiente aparte, bata el huevo con las 2 cucharadas de leche y agrega la mitad de esta mezcla a los demás ingredientes. Con las manos, junte la mezcla para formar una masa, agregue más huevo y leche a medida que lo necesite, con lo que debe terminar una masa blanda pero no pegajosa.", "Ahora en una tabla enharinada, saque la masa a una profundidad de 2.5 cm / 1 in. A continuación, elimine los bollos con un cortador de 5 cm / 2 pulgadas, ya sea liso o estriado. Coloque las piezas recortadas en una bandeja para hornear y cepíllelas con la leche.", "Finalmente cubra cada bollo con el queso feta desmenuzado, y coloque la bandeja en el estante más alto del horno para hornear durante 12-15 minutos o hasta que se hayan vuelto dorados. Luego quítelos a una rejilla de alambre hasta que estén lo suficientemente fríos como para comer."], "url": "www_bbc_co_uk_food_recipes_fetaoliveandsundried_67260", "title": "Scones de tomate feta, oliva y secados al sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de pasta fettuccine seca", "300ml / 10½ fl oz crema doble", "30g / 1oz de mantequilla", "nuez moscada recién rallada, al gusto", "200 g / 7oz de queso parmesano recién rallado", "pimienta negra recién molida"], "method": ["Cocine la pasta en una olla grande de agua hirviendo con sal durante 10-12 minutos, hasta que esté al dente. Mientras tanto, ponga la crema en una cacerola con la mantequilla y un poco de nuez moscada rallada y caliente suavemente. Agregue el parmesano.", "Escurrir la pasta, reservar aproximadamente tres cucharadas de agua de cocción, luego inclinar directamente en la salsa de crema. Agregue tanta agua reservada como sea necesario para aflojar la consistencia de la salsa a su gusto. Mezcle suavemente, agregando mucha pimienta negra recién molida. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fettuccine_alfredo_47554", "title": "Fettuccine Alfredo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fettuccine_alfredo_47554_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo grande de gallinas camperas", "50g / 1¾oz de harina natural", "pizca de sal", "100ml / 3½ fl oz de leche", "botón de mantequilla, para freír", "puñado de cohetes hojas", "30g / 1oz de pimiento rojo asado de una jarra, escurrido y cortado en tiras", "½ cebolla roja pequeña, finamente cortada", "50g / 1¾oz de queso feta, desmenuzado", "30 g / 1 oz de piñones, tostados", "puñado de perejil, toscamente picado", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para hacer la masa de panqueque, coloque los huevos, la harina y la sal en un bol y bata con un batidor. Vierta la leche y bata de nuevo hasta que quede suave.", "Derrita la mantequilla en una sartén a fuego medio. Vierta en un cucharón de masa de panqueque y cocine durante 1-2 minutos. Voltee y cocine durante otros 1-2 minutos. Repita para cocinar el segundo panqueque.", "Para el relleno, esparza unas cuantas hojas de rúcula sobre cada panqueque. Cubra con el pimiento rojo, cebolla, queso feta y piñones, luego el perejil.", "Sazonar bien con sal y pimienta negra recién molida y exprimir el jugo de limón. Roll up para servir."], "url": "www_bbc_co_uk_food_recipes_feta_roasted_red_pepper_90674", "title": "Feta, pimientos rojos asados ​​y panqueques de piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/feta_roasted_red_pepper_90674_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "1 diente de ajo orgánico, finamente picado", "4 filetes de anchoa, finamente picados", "2 cucharaditas de alcaparras, enjuagadas y picadas", "1 cucharadita de hojas de romero", "1 cucharadita de perejil plano de hojas picadas", "4 cucharaditas de aceite de oliva virgen extra", "285g / 10oz brócoli brotación púrpura", "450g / 1lb de fettuccine fresco", "½ limón, solo jugo", "sal y pimienta negra recién molida", "virutas de parmesano, para servir"], "method": ["Para hacer el aderezo caliente, caliente el aceite de oliva en una sartén y cuando esté caliente agregue las cebollas, el ajo, las anchoas, las alcaparras, el romero y el perejil. Freír suavemente hasta que las cebollas se hayan suavizado, sin colorearlas. Mantenga caliente hasta que esté listo para servir.", "Mientras tanto, cocine el brócoli en abundante agua hirviendo con un poco de sal durante dos minutos, luego agregue el fettuccine y mezcle y cocine por otros tres minutos. Escurra cuando la pasta esté cocida (el brócoli se habrá roto ligeramente).", "Para servir, coloca la pasta y el brócoli en un tazón y combínalos con el aderezo caliente. Agregue el jugo de limón y sazone al gusto con sal y pimienta. Servir con virutas de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_fettuccinewithpurple_67561", "title": "Fettuccine con brócoli que brota púrpura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más extra para engrasar", "½ cebolla grande, picada", "½ pimiento rojo, picado", "1 diente de ajo, picado", "Nueces 50g / 1¾oz, sin cáscara, picadas", "75g / 2¾oz de alubias rojas enlatadas, enjuagadas y escurridas", "Arroz basmati de 200g / 7oz, cocido en caldo de verduras o según las instrucciones del paquete", "sal y pimienta negra recién molida", "1 gran perifollo fresco, picado"], "method": ["Calentar el aceite en una sartén grande y freír la cebolla, el pimiento rojo y el ajo hasta que estén suaves.", "Agregue las nueces y los frijoles a la sartén y cocine durante 2-3 minutos más.", "Agregue el arroz a la sartén, caliente y sazone con sal y pimienta negra recién molida.", "Retire la sartén del fuego y agregue el perifollo picado.", "Engrase ligeramente un tazón grande y empaquete la mezcla de arroz en el tazón.", "Para servir, convierte el arroz en un plato para hacer una forma de domo."], "url": "www_bbc_co_uk_food_recipes_festivepilaurice_84852", "title": "Festivo arroz pilaf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre de 1 hoja listo para usar, laminado a ½cm / ¼ de grosor", "1 huevo de gallinas camperas, ligeramente batido, para esmaltar", "½ mango, piedra eliminada", "Crema doble de 100 ml / 3½ fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "1 vaina de vainilla, semillas raspadas", "1 cucharada de azúcar glas, más extra para quitar el polvo", "6-8 hojas de menta fresca, finamente picadas", "ramita de menta fresca, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar una forma de diamante de la masa y poner en una bandeja de horno engrasada.", "Utilice un cuchillo afilado para marcar un diamante más pequeño de 1 cm / ½ pulg. Dentro del borde de la masa, asegurándose de que el corte no se realice en toda la masa.", "Cepille la masa con el huevo batido y colóquela en el horno para hornear por 10 minutos o hasta que la masa esté dorada. Retirar del horno y dejar enfriar.", "Para la mousse de mango, coloque el mango en un procesador de alimentos y mezcle hasta que quede suave. Cuchara una pequeña cantidad de este puré de mango alrededor del borde de un plato.", "En un recipiente, doble el puré de mango restante en la crema doble batida.", "Agregue las semillas de vainilla, el azúcar glasé y la menta fresca picada y doble en la mezcla de crema para combinar.", "Con un cuchillo afilado, corte con cuidado la parte inferior de la caja de pastelería y use un poco de la mousse para asegurarla en el centro de un plato para servir.", "Ponga una cantidad generosa de la mousse de mango sobre la base de la repostería, luego coloque la tapa de la repostería encima.", "Para servir, espolvorear con azúcar glas y decorar con una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_feuilleteofmangomous_84505", "title": "Feuillete de mousse de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Setas planas de 1kg / 2lb 2oz de tapa ancha", "3 cucharadas de aceite de oliva", "3 chalotes grandes, picados", "2 dientes de ajo, en rodajas", "sal y pimienta negra recién molida", "½ limón, solo jugo", "1 litro / 1¾ pintas de vegetales calientes o caldo de pollo", "Crema doble 250ml / 9fl oz", "150 g / 5oz de mantequilla sin sal, en cubos (opcional)", "6 cucharadas de aceite de oliva", "100 g / 3½ oz de hongos silvestres mezclados", "sal y pimienta negra recién molida", "4 filetes pequeños de salmonete fresco, desgranado y deshuesado", "75 ml / 2½ fl oz crema fresca", "2 chalotes, finamente picados", "1 ramita perifollo fresco, picado", "1 ramita de estragón fresco, picado", "1 ramita de cilantro fresco, picado", "algunas cebolletas picadas", "sal y pimienta negra recién molida", "algunas gotas de jugo de limón", "rociar aceite de oliva virgen extra"], "method": ["Para la sopa, retire las agallas oscuras de los champiñones y deséchelos. Lave y seque los champiñones, luego córtelos en rodajas de 2 mm.", "Caliente el aceite de oliva en una sartén grande de base pesada, agregue los chalotes y cocine hasta que estén coloreados. Agregue el ajo y cocine hasta que esté suave, luego agregue los champiñones.", "Sazonar con sal y pimienta negra recién molida al gusto, y cocinar por 5-8 minutos o hasta que los champiñones estén dorados.", "Agregue el jugo de limón y el caldo. Lleve a fuego lento a fuego lento y luego baje a fuego lento para hervir a fuego lento durante 15 minutos.", "Revisa el condimento de nuevo, agregando más sal y pimienta negra recién molida, al gusto, si es necesario.", "Vierte la sopa en una licuadora o procesador de alimentos y déjala enfriar durante dos minutos. Licúe hasta que quede suave, luego cuele a través de un tamiz fino de nuevo en una sartén limpia.", "Para finalizar, agrega la crema y revuélvela a fuego medio; también puedes mezclar la mantequilla en cubos para obtener un acabado más sedoso. Mantener caliente", "Para el salmonete y los champiñones, caliente una sartén hasta que esté caliente, luego agregue tres cucharadas de aceite de oliva, las setas y una pizca de sal.", "Sofríe los champiñones hasta que estén cocidos, luego retíralos con una espumadera y transfiéralos a un plato forrado con papel de cocina.", "Sazonar ambos lados del salmonete con sal y pimienta negra recién molida.", "Calienta una segunda sartén hasta que esté caliente, luego agrega el aceite de oliva restante y el salmonete con la piel hacia abajo.", "Dale un poco de batido a la sartén para asegurarte de que el pescado no se pegue. El pez puede acurrucarse, pero no lo presione, ya que esto cerrará la piel: deje el pez y los filetes se aplanarán de forma natural.", "Cocine por 1½ minutos en el lado de la piel, luego voltee y cocine por un minuto más, o hasta que esté completamente cocido.", "Retire el pescado de la sartén y transfiéralo a un plato forrado con papel de cocina.", "Para la chalota y la hierba crème fraîche, coloque la crème fraîche en un recipiente pequeño y agregue los chalotes y las hierbas picadas. Agregue la sal, el jugo recién molido de negro y limón al gusto y revuelva para combinar.", "Para servir, coloca un pequeño montículo de hongos cocidos en el medio de cuatro cuencos de sopa de bordes anchos. Coloque un filete de salmonete encima de cada porción y vierta la sopa. Coloque la mezcla crème fraîche encima del pescado, para que se derrita en la sopa. Rocíe aceite de oliva virgen extra al gusto."], "url": "www_bbc_co_uk_food_recipes_fieldmushroomsoupwit_86160", "title": "Sopa de hongos de campo con salmonetes crujientes y crema de hierbas chalote fraîche", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450g / 1lb de arroz rojo Camargue", "1 cucharadita de sal", "6 zanahorias", "8 cebollas de primavera", "hojas pequeñas de cilantro racimo, picadas", "4 limas, ralladura fina y jugo solamente", "4 cucharaditas de miel", "2 chiles rojos, finamente picados", "4 cucharadas de aceite de oliva ligero", "2 cucharadas de vinagre de sidra", "sal y pimienta"], "method": ["Mida el arroz en una jarra, luego colóquelo en una sartén con el doble de agua hirviendo. Agrega la sal Llevar a ebullición, luego cubrir y reducir el fuego a fuego lento y cocinar durante 20-30 minutos, o hasta que los granos estén tiernos, pero todavía tienen un pequeño mordisco.", "Mientras tanto, ralle groseramente las zanahorias (use la hoja de rejilla gruesa de un procesador de alimentos, si tiene una) y corte ligeramente las cebollas de primavera. Incline en un recipiente y agregue la mitad del cilantro picado.", "Para el aderezo, prepare el aderezo mezclando todos los ingredientes en un frasco de mermelada y agite.", "Escurra el arroz si es necesario y agréguelo al tazón con las verduras. Agregue el aderezo, el sabor y sazone con más sal y pimienta si es necesario. Sirva con el cilantro restante esparcido en la parte superior."], "url": "www_bbc_co_uk_food_recipes_fiery_red_rice_salad_91889", "title": "Ensalada de arroz rojo ardiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de pulpo bebé (fresco o congelado, si se descongeló completamente)", "½ cucharada de aceite vegetal", "½ cebolla pequeña, en rodajas", "5 hongos shiitake, tallos eliminados, en rodajas finas", "2 cebolletas, cortadas a la mitad", "1 guindilla roja pequeña, finamente cortada en una inclinación", "1 cucharadita de aceite de sésamo", "espolvorear de semillas de sésamo", "10 g de jengibre fresco (aproximadamente del tamaño de una moneda de £ 2)", "3 dientes de ajo, rallados o picados", "2 cucharaditas de gochujang (pasta de chile rojo coreano)", "1 cucharadita de salsa de soja", "2 cucharaditas de gochugaru (chile rojo en polvo coreano)", "½ cucharadita de jarabe de oro", "1 cucharadita muere"], "method": ["Limpie y enjuague el pulpo en agua fría y retire el pico (puede conseguir que su pescadero lo prepare).", "Para la pasta de especias, pele y ralle el jengibre y póngalo en un tazón mediano con el ajo, la pasta de chile, la salsa de soja, el chile en polvo, el sirope dorado y el mirin. Mezcle bien y luego reserve.", "Caliente una olla mediana de agua hirviendo, agregue el pulpo al agua hirviendo y blanquee durante 1 ½ minutos, luego drene. Coloque el pulpo en un recipiente con agua helada y vuelva a vaciarlo una vez que esté frío. Retire la piel del pulpo. Cortar en cuartos o simplemente eliminar los tentáculos si es muy pequeño. Cortar en trozos del tamaño de un bocado.", "Calentar una sartén o un wok, agregar el aceite y freír la cebolla durante unos minutos. Agregue el pulpo y péguelo a las cebollas y cocine por un minuto. Agregue los champiñones, cocine por un minuto y luego agregue las cebolletas, los chiles y el aceite de sésamo. Espolvoree las semillas de sésamo una y otra vez y sirva."], "url": "www_bbc_co_uk_food_recipes_fiery_octopus_ojingeo_90139", "title": "Pulpo ardiente (Ojingeo bokkeum)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "700 g / 1 libra de filete de rape de 9 oz, en cubos", "2 cebollas rojas, finamente picadas", "4 dientes de ajo, aplastados", "Puré de tomate 50 g / 2 oz", "3 chiles rojos pequeños, picados", "2 x 400 g / 14 onzas de latas de tomates picados", "1 cucharadita de cilantro molido", "pellizcar el comino molido", "pellizcar canela molida", "1 hoja de laurel", "450 g / 1 libra de frijoles negros enlatados", "sal y pimienta negra recién molida", "30g / 1oz de chocolate negro de alta calidad, rallado", "4 pimientos verdes grandes", "175g / 6oz cheddar, rallado", "arroz, cocinado de acuerdo con las instrucciones del paquete, para servir"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Caliente el aceite en una sartén profunda de base pesada a fuego medio.", "Agregue el bistec y fría en lotes durante 3-4 minutos, o hasta que se dore por todas partes. Coloque el bistec en un colador sobre un tazón para drenar el exceso de grasa. Deseche la grasa recolectada.", "Agregue la cebolla y el ajo en la misma sartén y fría hasta que estén suaves.", "Agregue el puré de tomate y cocine durante seis minutos.", "Agregue los chiles y cocine por un minuto.", "Agregue los tomates enlatados, el cilantro, el comino, la canela y la hoja de laurel.", "Regrese la carne a la sartén y mezcle bien. Cocine a fuego lento durante 5-6 minutos.", "Agregue los frijoles y cocine por 15 minutos.", "Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el chocolate.", "Corta la parte superior de los pimientos verdes y raspa las semillas.", "Nivele la parte inferior de cada pimiento con un cuchillo para que puedan pararse en una bandeja para hornear.", "Coloque los pimientos en una olla de agua hirviendo para blanquear durante tres minutos. Retirar con una cuchara ranurada y sumergir en un recipiente con agua fría para detener el proceso de cocción, luego escurrir.", "Deja la mitad del queso cheddar a un lado. Divida la otra mitad del queso cheddar por igual entre los pimientos.", "Coloque la mezcla de carne de chile en cada pimiento para llenar hasta el borde.", "Cubra con la misma cantidad de cheddar rallado reservado y acomódelo, de pie, en una bandeja para hornear.", "Transfiera al horno y cocine por 15 minutos.", "Retire del horno y coloque sobre los platos con una cucharada de arroz al lado."], "url": "www_bbc_co_uk_food_recipes_fieryfilledpeppers_89169", "title": "Pimientos rellenos de fuego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Salchicha de cerdo a 400 g / 14 oz, retirada de su envoltura", "3 cebolletas, finamente picadas", "2 dientes de ajo, finamente picados", "1 chile rojo, finamente picado", "2 cucharadas de salsa de soja ligera", "1 cucharadita de aceite de sésamo", "1 cucharadita de azúcar en polvo", "½ cucharadita de harina de maíz", "Cilantro de 2 cucharadas, picado", "pizca de sal", "Harina sasonada", "aceite vegetal para freír", "½ pepino, reducido a la mitad, sin semillas y en rodajas finas", "1 cucharada de semillas de sésamo, tostadas", "4 cucharadas de vinagre de vino blanco", "2 cucharadas de azúcar en polvo", "sal al gusto", "cilantro de racimo pequeño, picado"], "method": ["Para hacer las empanadas, simplemente incline todos los ingredientes (excepto la harina sazonada y el aceite vegetal) en un tazón grande y mezcle bien con las manos limpias.", "Con las manos ligeramente húmedas, divida la mezcla en seis a ocho hamburguesas redondas pequeñas.", "Sumerja las hamburguesas en la harina sazonada hasta cubrirlas uniformemente, sacudiendo cualquier exceso.", "Coloque en una bandeja para hornear y refrigere durante aproximadamente 30 minutos o hasta que esté listo para usar.", "Justo antes de cocinar las empanadas, prepare el pepinillo encurtido simplemente mezclando todos los ingredientes. Establecer a un lado.", "Caliente el aceite vegetal en una sartén grande y fría las hamburguesas por lotes de cuatro a cinco minutos, volteándolas una vez, hasta que estén cocidas y doradas. Escurrir sobre papel de cocina.", "Para servir, coloque el pepino encurtido drenado en el centro del plato y cubra con las empanadas. Adorne con cilantro."], "url": "www_bbc_co_uk_food_recipes_fieryporkpattieswith_10413", "title": "Empanadas de cerdo ardiente con pepino en vinagre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4 como entrante", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de harina común", "40g / 1¾oz de mantequilla, ablandada", "1 higo seco listo para comer", "20 g / 1 oz de azúcar en polvo", "1 cucharada de chocolate picado"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 180 C / 350 / Gas 4. Coloque una hoja de papel de hornear en una bandeja para hornear.", "Coloque la harina y la mantequilla en un tazón y frótelos para hacer una mezcla quebradiza.", "Corta el tallo del higo seco y corta la fruta en trozos pequeños con las tijeras (pregúntale a un adulto que te ayude). Agregue al tazón con el azúcar y las piezas de chocolate.", "Use sus manos para comenzar a apretarlo todo: puede empujar hacia abajo con los nudillos hacia el tazón. A medida que comienza a formar una masa, gire la taza hacia la superficie de trabajo y continúe apretando para formar una salchicha larga y grasa.", "Desgarra la mezcla por la mitad. Tire de cada pieza a la mitad de nuevo, luego cada pieza más pequeña en dos, tratando de mantenerlos del mismo tamaño. Esto hace ocho piezas de masa de galletas.", "Enrolle cada pieza en una bola redonda, luego colóquela en la bandeja forrada y aplaste un poco con la mano, repita con las otras siete galletas.", "Pida a un adulto que ponga la bandeja de horno en un horno precalentado durante 12-15 minutos o hasta que los bizcochos estén ligeramente dorados. Deje enfriar en el papel. Servir con algunas uvas rojas o más higos secos."], "url": "www_bbc_co_uk_food_recipes_fig_and_fudge_biscuits_75339", "title": "Galletas de higo y dulce de azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 8 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "1 cucharadita de sal fina", "1 x 7 g bolsita de levadura de acción rápida", "180ml / 6fl oz de leche caliente", "4 cucharadas de agua tibia", "1 cucharadita de miel", "4 cucharadas de yogurt natural", "2 cucharadas de aceite de girasol, más extra para engrasar", "225g / 8oz de higos secos, toscamente picados", "1 cucharada de pimienta negra agrietada"], "method": ["Mezcle la harina y la sal en un tazón. Agregue la levadura de acción rápida y mezcle bien.", "En una jarra, mezcle la leche, el agua y la miel.", "Vierta el contenido de la jarra en los ingredientes secos. Agregue el yogur y el aceite y junte con las manos para formar una masa suave. Dé vuelta a una superficie de trabajo ligeramente enharinada y amase durante aproximadamente cinco minutos, o hasta que la masa esté suave y elástica.", "Coloque la masa en un tazón engrasado, cubra y deje probar en un lugar cálido durante 1 hora y media. Después de probar, amasar la masa de nuevo para derribarla.", "Empuja los higos secos y la pimienta negra en la masa y amasa firmemente para incorporarla a la masa.", "Divida la masa en ocho porciones iguales y extienda sobre una superficie enharinada a aproximadamente 1 cm / ½ pulgada de espesor.", "Polvore ligeramente dos bandejas para hornear con harina y coloque los panes planos uno al lado del otro en las bandejas, dejando suficiente espacio entre cada una. Cubra con un paño limpio y deje probar durante otros 15-20 minutos.", "Precalienta la parrilla a un nivel medio y ase los panecillos planos durante unos 2-3 minutos por cada lado, o hasta que estén ligeramente dorados. ¡No se aleje de la parrilla mientras están cocinando o podría terminar con panes chamuscados!"], "url": "www_bbc_co_uk_food_recipes_fig_and_black_pepper_74560", "title": "Panecillos de higo y pimienta negra", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de espagueti seco o linguini", "150g / 5½oz de brócoli, cortado en pequeños floretes", "100g / 3½oz de tomates cherry, cortados por la mitad", "Gambas grandes de agua fría de 150 g / 5½ onzas, como el Atlántico norte o el canadiense, completamente descongeladas y drenadas", "1 cucharada de aceite de oliva extra virgen", "½ cucharadita de hojuelas de chile seco, al gusto", "sal marina y pimienta negra recién molida", "cuñas de limón, para exprimir (opcional)"], "method": ["Llene a la mitad una cacerola grande y antiadherente con agua y llévela a ebullición. Agregue la pasta al agua hirviendo, vuelva a hervir y cocine por 8 minutos, revolviendo ocasionalmente. Agregue el brócoli a la sartén y cocínelo durante 2 minutos más.", "Escurre la pasta y el brócoli. Regrese a la sartén y agregue los tomates, gambas, aceite, hojuelas de chile y sazone bien. Cocine por 2-3 minutos, revolviendo con dos cucharas de madera hasta que los espaguetis estén uniformemente cubiertos con las especias de la sartén y las gambas y los tomates estén calientes.", "Exprime un poco de jugo de limón, si lo estás usando, y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fiery_prawn_and_tomato_46263", "title": "Fiery gambas y pasta de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fiery_prawn_and_tomato_46263_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½ oz de almendras molidas", "50g / 1¾oz de azúcar en polvo, más 2 cucharadas para rociar", "Harina normal de 30g / 1oz", "1 cucharadita de polvo de hornear", "½ cucharadita de canela molida", "pizca de sal", "3 huevos de gallinas camperas, ligeramente golpeados", "4 cucharadas de mantequilla, derretida y enfriada, más extra para engrasar", "½ cucharadita de extracto de almendra", "8 higos frescos, tallos eliminados, cortados por la mitad", "1 cucharada de aceite vegetal", "2 chalotes, finamente cortados en cubitos", "1 cucharadita de romero fresco finamente picado", "100 g / 3½ oz de sultanas", "50 g / 1oz de pasas", "50g / 1¾oz de azúcar moreno oscuro", "200ml / 7fl oz de vinagre de sidra", "50g / 1¾oz de jengibre cristalizado, finamente cortado", "Higos secos de 310g / 11oz cortados por la mitad", "1 cucharadita de pimienta de Jamaica molida", "Queso cheddar de 400g / 14oz, rebanado"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5 y engrase ligeramente una lata de flan flato de 23 cm / 9 pulg. O una lata de torta de 4 cm / 1½ pulgadas de profundidad.", "En un tazón, mezcle las almendras molidas, el azúcar, la harina común, el polvo de hornear, la canela y la sal.", "En otro recipiente, mezcle los huevos, la mantequilla y el extracto de almendras.", "Revuelva los ingredientes secos en la mojado y bata hasta mezclarlos.", "Vierta la mezcla en la lata preparada.", "Coloque los higos con el lado cortado hacia arriba sobre la pasta, empujando los higos suavemente en la masa.", "Espolvorea las dos cucharadas restantes de azúcar sobre los higos, luego hornea por unos 30 minutos, o hasta que el pastel esté en el centro.", "Deje que la torta se enfríe durante diez minutos y luego sáquela de la lata sobre una rejilla de alambre. Deje que se enfríe a temperatura ambiente antes de servir.", "Para el chutney de higos secos, caliente el aceite en una cacerola. Una vez caliente, agregue las chalotas y fríelas suavemente durante 2-3 minutos. Agregue el romero, las pasas, las pasas y el azúcar y fría hasta que la fruta comience a caramelizarse. Agregue el resto de los ingredientes, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante 5-10 minutos.", "Sirva una porción del pastel en un plato con la salsa picante y las rebanadas de queso cheddar."], "url": "www_bbc_co_uk_food_recipes_fig_cake_with_a_dried_24786", "title": "Pastel de higos con chutney de higos secos y queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "125g / 4½oz de mantequilla fría, en cubos", "2 yemas de huevo de gallinas camperas", "gran pizca de sal", "1-4 cucharadas de agua, si es necesario", "harina común, para quitar el polvo", "260ml / 9½fl oz de crema batida", "165g / 5½oz de queso crema", "3 grandes puentes de miel", "1 cucharada de Marsala (opcional)", "12-16 higos, cada uno cortado en 6 pedazos", "puñado de pistachos con cáscara verde, nueces o nueces, reducido a la mitad", "1 manojo de menta fresca, rasgado o desgarrado"], "method": ["Coloque la harina y la mantequilla en un procesador de alimentos y pulse para hacer migas de pan.", "Alternativamente, use sus manos y frote la mantequilla y la harina juntas en un bol hasta que la mezcla se asemeje a finas migas de pan.", "Agregue las yemas de huevo y una pizca de sal, y mezcle con un cuchillo. Presione la mezcla en una bola. Si la masa se siente muy seca, agregue un poco de agua, pero trate de evitar agregar agua si puede.", "Una vez que todos los pasteles estén juntos, envuelva la película adhesiva y déjela caer en la nevera para que descanse durante 30 minutos.", "Después de 30 minutos, retire la masa del refrigerador y déjela a un lado para calentar un poco (si la usa directamente del refrigerador e intenta estirarla, la masa será un desastre sin esperanza).", "Precalentar el horno a 180C / 350F / Gas 4.", "Haga rodar la masa sobre una superficie de trabajo enharinada con el grosor de la mitad de una moneda de 1 £ y úsela para revestir con cuidado una lata acanalada rectangular de 20 x 30 cm / 8 x 12 pulg. La repostería casera a menudo es bastante desmenuzable. No se alarme por esto, siempre puede arreglarlo en la lata.", "Tome una bolita de la masa (del tamaño de una moneda de £ 1) y utilícela para facilitar la masa dentro de la lata. Presione el mango de una cuchara de madera contra la masa alrededor de los bordes para introducirla en las ranuras estriadas. Recorte el exceso alrededor de la parte superior y pase un cuchillo delgado entre la masa y el borde de la lata para aflojarlo. Ponlo en la nevera durante unos 15 minutos o hasta que esté firme.", "Retire la tarta de la nevera. Tome un pedazo de papel para hornear un poco más grande que la lata y frótelo, luego déjelo sin coser y forre la lata con él. Rellene con frijoles para hornear o frijoles secos y 'hornear ciega' en el horno durante 20-25 minutos, o hasta que la masa se sienta arenosa al tacto. Retire del horno y reserve.", "Pon la crema en un tazón y bate hasta que empiece a espesar. Coloque el queso crema en un recipiente aparte y doble la crema en el queso crema. Mezcle con la miel y Marsala, si está usando. Coloque el relleno en la caja de tarta, luego coloque los higos en la parte superior y esparza sobre los frutos secos y la menta."], "url": "www_bbc_co_uk_food_recipes_fig_cream_cheese_and_65349", "title": "Higo, queso crema y tarta de menta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fig_cream_cheese_and_65349_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Almendras molidas 250 g / 9 oz", "1 huevo blanco de corral", "120 g / 4½ oz de azúcar en polvo", "1 naranja, ralladura y jugo", "125 g / 4½ oz de harina", "125ml / 4fl de leche en oz", "3 huevos de gallinas camperas", "Pizca de canela", "pizca de sal", "30g / 1oz de mantequilla", "25g / 1oz de mantequilla salada", "pizca de azúcar en polvo", "6-8 higos", "algunas ramitas de tomillo, hojas recogidas", "100 ml / 3½ fl oz de vino marsala", "100g / 3½ oz de mascarpone", "50g / 1¾oz de almendras en copos", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para hacer la mantequilla de almendras, mezcle las almendras molidas, la clara de huevo, el azúcar impalpable y la ralladura de naranja en un tazón. Coloque sobre una película adhesiva y ruede en un registro. Envuelva bien y coloque en la nevera.", "Para hacer la mezcla, mezcle la harina, la leche, los huevos, la canela y la sal en un tazón.", "Caliente la mantequilla en una sartén de hierro fundido de 25 cm / 10 pulgadas o en una bandeja de asar 28x21x4cm / 11x8x2. Verter en la mezcla y hornear durante 20-25 minutos o hasta que se levante y dorado en los bordes.", "Mientras tanto, para hacer los higos caramelizados, derrita la mantequilla en una sartén grande a fuego medio. Agregue el azúcar y mezcle para hacer un caramelo. Agregue los higos y la carameliza durante 5 minutos. Agregue el masala y el jugo de naranja y cocine a fuego lento hasta que el volumen del líquido se reduzca a la mitad. Retirar del fuego y mezclar a través de unas hojas de tomillo. Dejar de lado.", "Para servir, rellene la masa con los higos caramelizados y el punto con la mantequilla de almendras. Servir con mascarpone, almendras en hojuelas y una pizca de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_fig_dutch_baby_01111", "title": "Fig Dutch baby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de mantequilla", "100 g / 3½ oz de azúcar en polvo de oro", "175ml / 6fl oz de jarabe de arce, más extra para lloviznar", "200g / 7oz de avena", "100 g / 3½ oz de sultanas", "10 albaricoques secos, picados", "2 cucharadas de almendras molidas", "5 higos"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una sartén grande derretir la mantequilla, el azúcar y el jarabe de arce. Cuando esté derretido agregue la avena, sultanas y albaricoques picados. Espolvorea sobre las almendras molidas. Revuelva bien.", "Incline el contenido de la bandeja en una bandeja de horno revestida. Presione hacia abajo para que la mezcla se distribuya uniformemente. Cortar finamente los higos y esparcir sobre la parte superior de la mezcla.", "Escurrir un poco de jarabe de arce en la parte superior y hornear durante 25-30 minutos."], "url": "www_bbc_co_uk_food_recipes_fig_flapjacks_60233", "title": "Flapjacks de higo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8 flapjacks", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fig_flapjacks_60233_16x9.jpg", "isVegetarian": false, "recommendations": 0}]