[{"ingredients": ["3 pimientos rojos asados ​​de una jarra, escurridos", "2 dientes de ajo picados", "pizca de copos de chile seco", "1 cucharada de puré de tomate", "2-3 cucharadas de aceite de oliva", "pellizcar el orégano seco", "dash salsa Tabasco", "sal y pimienta negra recién molida", "125g / 4½oz de pasta fresca de penne", "pecorino rallado, para servir", "hojas de albahaca fresca, para adornar"], "method": ["Coloque los pimientos rojos asados, el ajo, los copos de chile, puré de tomate, aceite de oliva, orégano, tabasco, sal y pimienta negra recién molida en una mini licuadora y mezcle hasta que estén casi suaves. Dejar de lado.", "Cocine la pasta de acuerdo con las instrucciones del paquete y escurra, dejando un poco del líquido de cocción en el fondo de la sartén. Agregue la salsa de pimiento asado a la pasta caliente y mezcle bien.", "Para servir, espolvorear en un tazón para servir, esparcir con pecorino rallado y decorar con hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_pennewithroastedpepp_88288", "title": "Penne con salsa picante de pimienta asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta penne 450g / 1lb", "25g / 1oz de mantequilla", "1 cucharadita de romero finamente picado", "700g / 1½ lb de tomates frescos maduros, pelados, sin semillas y cortados en cubitos", "sal y pimienta recién molida", "azúcar, pizca de", "175 - 225 g / 6 - 8 z zomba arroz caballa", "pizca de chiles molidos", "125-175 ml / 4-6 fl oz crema", "3 cucharadas de perejil de flatillo finamente picado", "4 cucharadas de parmesano recién rallado"], "method": ["Derrita la mantequilla en una cacerola, agregue el romero picado y los tomates cortados en cubitos.", "Sazone con sal y pimienta y azúcar.", "Cocine hasta que los tomates acaban de comenzar a ablandarse en una salsa, que tarda unos 5 minutos.", "Cortar la salchicha en rondas de 5 mm / ¼ y agregar a la sartén con los chiles molidos.", "Agregue la crema y dos cucharadas de perejil de hojaldre picado, y deje burbujear durante 3-4 minutos, revolviendo con frecuencia hasta que la crema se haya reducido a la mitad. Retire la sartén del fuego y reserve.", "Cocine la pasta hasta que esté 'al dente', escurra y mezcle en la salsa con el parmesano rallado.", "Espolvoree con el perejil restante de flatleaf y sirva."], "url": "www_bbc_co_uk_food_recipes_pennewithtomatoesspi_73926", "title": "Penne con tomate, chorizo ​​y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithtomatoesspi_73926_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de espagueti seco", "1 diente de ajo graso", "puñado de hojas frescas de perejil", "3 cucharadas de aceite de oliva virgen extra", "2 pizcas de hojuelas de chile seco, al gusto", "sal marina"], "method": ["Agregue 2 cucharadas de sal a 2 litros de agua y lleve a ebullición en una cacerola grande. Agregue los espaguetis y vuelva a hervir rápidamente, luego cocínelos hasta que estén al dente.", "Pica finamente el ajo y el perejil juntos.", "Caliente el aceite en una sartén a fuego lento. Agregue el ajo y el perejil y fría por 1 minuto, o hasta que el ajo se ablande pero no se coloree. Agregue los copos de chile y cocine por 1 minuto más.", "Escurre los espaguetis ligeramente, luego agregue a la sartén con el agua todavía aferrada a ella. Mezcle para cubrir con el aceite. Agregue un poco de agua de cocción extra si es necesario. Espolvoree los espaguetis con el perejil, mezcle, sazone con sal y sirva."], "url": "www_bbc_co_uk_food_recipes_peperoncino_99009", "title": "Espagueti con ajo y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peperoncino_99009_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo", "4 tomates cherry", "1 cucharada de aceite de oliva", "1 cucharada de piñones", "4 hojas de albahaca", "30g / 1½oz de queso de cabra suave", "pizca de pimienta negra molida"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Precalentar el horno a 200C / 400F / Gas 6.", "Haga estallar la pimienta presionando hacia abajo sobre el tallo con los pulgares hasta que lo empuje hacia adentro; luego rasgue la pimienta cuidadosamente para hacer dos mitades de tamaño uniforme. Estos son tus barcos Golpea las mitades de pimienta boca abajo para sacudir todas las semillas y quita todas las partes blandas y pálidas.", "Agregue los tomates en el tazón, luego péguelos con tijeras. Agregue el aceite de oliva y una pizca de pimienta y mezcle bien.", "Espolvoree los piñones y raspe las hojas de albahaca, luego revuelva bien la mezcla.", "Vierta la mitad del relleno en cada pimentero. Finalmente, desmenuce el queso de cabra encima de la mezcla de tomate.", "Hornee durante 20-25 minutos o hasta que la cubierta de queso esté dorada. Sirve con pan francés crujiente."], "url": "www_bbc_co_uk_food_recipes_pepper_boats_77216", "title": "Barcos de pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 pimientos, rojo, amarillo o naranja", "puñado de tomates cherry", "2 dientes de ajo, pelados", "2 cucharadas de aceite de oliva", "albahaca grande", "Formas de pasta 400 g / 14 oz (orecchiette es bueno)", "sal y pimienta"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Corta a la mitad los pimientos, corta las semillas y la membrana. Colóquelos en una lata de tostado bastante grande hacia arriba. Reducir a la mitad los tomates cherry y colocarlos dentro de los pimientos. Corta finamente el ajo y mételos con los tomates. Rocíe los pimientos con aceite de oliva, sazone, sazone, con sal y pimienta fresca. Hornee en el horno mientras se lleva el aceite de albahaca.", "Aparte unas ramitas de albahaca y mezcle el resto en un procesador de alimentos con 3 cucharadas de aceite de oliva y un poco de sal hasta que tenga un aceite de albahaca verde brillante.", "Cuando hayan pasado 30 minutos o más y los pimientos y los tomates comiencen a ablandarse, vierta sobre el aderezo de albahaca. Vuelva al horno por otros 20 minutos o hasta que las verduras estén ligeramente carbonizadas alrededor de los bordes. Levante los pimientos y los tomates de la bandeja con una espumadera y déjelos a un lado.", "Cocine la pasta en agua hirviendo con sal según las instrucciones del paquete. Desagüe.", "Incline la pasta cocida y escurrida en la lata de asar, y mezcle bien para retirar los pimientos caramelizados pegados a la sartén.", "Sirva la pasta en tazones, desgarrando la albahaca restante. Coloque los pimientos asados ​​y los tomates en la parte superior."], "url": "www_bbc_co_uk_food_recipes_pepper_tomato_and_basil_74401", "title": "Pimienta, tomate y pasta de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pepper_tomato_and_basil_74401_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite de oliva", "½ pimiento rojo, en rodajas", "85g / 3oz de tomates enrojecidos por el sol", "½ de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "puñado de hojas de albahaca fresca", "sal y pimienta negra recién molida", "llovizna de aceite de oliva"], "method": ["Calentar el aceite en una cacerola mediana y saltear las rodajas de pimiento durante 3-4 minutos, para suavizar. Agregue los tomates y caliente por unos minutos más.", "Agregue el caldo de pollo, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 8-10 minutos.", "Agregue la albahaca y sazone bien con sal y pimienta negra recién molida.", "Transfiera a un tazón para servir y rocíe con un poco de aceite de oliva, para servir."], "url": "www_bbc_co_uk_food_recipes_pepperandsunblushedt_82614", "title": "Pimienta y sopa de tomate enrojecida por el sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 200g / 7oz", "1 huevo pequeño de gallinas camperas, ligeramente golpeado", "2 cucharaditas de pimienta negra molida", "1 cucharada de aceite de oliva", "ensalada verde, para servir"], "method": ["Sumerja el bistec en el huevo batido y espolvoree con la pimienta para cubrir.", "Caliente el aceite de oliva en una sartén antiadherente y fría el bistec durante cuatro minutos por cada lado, o hasta que esté cocido a su gusto.", "Deje reposar el bistec durante 5 minutos antes de servirlo con la ensalada."], "url": "www_bbc_co_uk_food_recipes_peppercrustedbeefste_87038", "title": "Bistec de ternera para uno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppercrustedbeefste_87038_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de venado 150 g / 5½ oz", "dash aceite de oliva", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "2 dientes de ajo, pelados y triturados", "4 ramitas de tomillo fresco, solo hojas", "55g / 2oz de pan rallado fresco", "pequeño puñado de perejil fresco, picado", "sal al gusto", "1 cucharadita de pimienta negra, aplastada", "2 cucharaditas de vinagre de vino tinto", "150g / 5½oz de tomates cherry frescos, descuartizados", "1 cucharadita de azúcar en polvo", "2 cucharaditas de puré de tomate", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "gran puñado de col rizada fresca, picada", "sal y pimienta negra recién molida", "salpicar agua caliente"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de venado, ate el venado con hilo de cocina, esto le ayudará a conservar su forma. Frotar con aceite de oliva y sazonar con sal y pimienta negra recién molida.", "Calentar una sartén y dorar la carne de venado hasta que se dore por todos lados. Agregue un poco de mantequilla, reserve el resto para la corteza y cepille la carne con la mantequilla derretida. Baje el fuego y agregue el ajo y la mitad del tomillo. Freír suavemente durante unos diez minutos. Retire de la sartén y deje reposar durante cinco minutos, luego retire la cuerda y corte a la mitad.", "Coloque las migas de pan, el perejil, la sal, los granos de pimienta triturados y el tomillo y la mantequilla restante en una mini licuadora y procese hasta que se combinen.", "Extienda la mezcla de la corteza encima de las mitades del filete de venado y colóquela en una bandeja para hornear. Coloque en el horno y hornee por 2-3 minutos, o hasta que estén doradas en la parte superior.", "Para el chutney casero de tomate, coloque todos los ingredientes en una olla pequeña no reactiva y cocine a fuego lento durante cinco minutos, o hasta que los tomates se hayan suavizado. Batir con una cuchara de madera hasta que quede suave y bien combinado.", "Para la col rizada con mantequilla, caliente la mantequilla en una cacerola grande y agregue la col rizada, la sal y la pimienta negra recién molida y un chorro de agua hirviendo. Revuelva a fuego lento hasta que se marchite.", "Para servir, coloque el chutney de tomate en un plato de servir. Coloque el venado en la parte superior y sirva con la col rizada untada con mantequilla."], "url": "www_bbc_co_uk_food_recipes_peppercornandherbcru_88332", "title": "Ciervo de pimienta y carne de venado con costra de hierbas con salsa picante de tomate casera y col rizada a la mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para lloviznar", "1 pechuga de pollo, piel anotada", "1 cucharadita de pimienta negra molida", "1 cucharada de aceite de oliva, más extra para lloviznar", "½ pimiento rojo, sin semillas", "1 diente de ajo, en rodajas", "100g / 3½ oz azucarados arvejas, en rodajas", "1 cucharada de salsa de soja", "2 cucharadas de jugo de limón", "1 lima, cortada en cuñas, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, caliente el aceite de oliva en una sartén. Frote la pechuga de pollo con un poco de aceite extra de oliva, luego frote la piel con los granos de pimienta triturados.", "Coloque el pollo en la sartén con la piel hacia abajo y cocine durante 5-10 minutos. Voltee y cocine durante 4-5 minutos en el otro lado, o hasta que esté completamente cocido.", "Para los guisantes de azúcar y el pimiento rojo, rocíe la mitad de pimiento rojo con aceite de oliva y coloque en una bandeja para hornear. Transfiera al horno y tueste durante 8-10 minutos, o hasta que se ablanden.", "Retire la pimienta del horno, coloque en un recipiente y cubra el recipiente con film transparente. Después de 3-4 minutos, retire la película adhesiva, retire la piel del pimiento y córtela en rodajas.", "Calentar el aceite en una sartén y freír las rodajas de pimiento asado con el ajo en rodajas durante 1-2 minutos. Agregue los guisantes de azúcar en rebanadas, la salsa de soja y el jugo de limón y cocine durante 1-2 minutos más.", "Para servir, coloque la ensalada de guisantes y pimiento rojo sobre un plato de servir y cubra con el pollo con costra de pimienta. Adorne con rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_peppercrustedchicken_87088", "title": "Pollo con costra de pimienta con guisantes y pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rape de rape, aproximadamente 500 g / 1 libra 2 onzas, fileteado y despellejado", "2 cucharadas de aceite de oliva, para freír", "3 cucharadas de pimienta negra agrietada", "sal marina y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 chalote, picado", "1 diente de ajo, picado", "3 cucharadas de vino blanco", "Crema doble 110ml / 4fl oz", "3 cucharadas de mostaza de grano grueso", "2 cucharadas de eneldo fresco picado"], "method": ["Corte el rape, luego corte en medallones de aproximadamente 2.5 cm / 1 pulgada de grosor. Sazonar con un poco de sal y presionar cada medallón ligeramente en el pimiento agrietado para cubrir. Coloque en el refrigerador.", "Para hacer la salsa, caliente el aceite en una sartén, agregue la chalota y el ajo y saltee durante 3 minutos. Agregue el vino y cocine hasta que se evapore. Agregue la crema y hierva, luego agregue la mostaza, el eneldo y el condimento. Reduzca el calor y mantenga caliente.", "Limpie la sartén con papel de cocina. Caliente el aceite para freír hasta que esté muy caliente, agregue los medallones de rape y cocine por unos 2 minutos en cada lado hasta que se dore y firme cuando lo presione. Retire y escurra sobre papel de cocina.", "Coloque los medallones en 4 platos para servir calentados y ponga la salsa alrededor de la cuchara", "Sirva con tortas de burbujas y squeak y una ensalada de crujientes hojas mezcladas."], "url": "www_bbc_co_uk_food_recipes_peppercrustedmonkfis_68035", "title": "Rape en costra de pimiento con salsa de eneldo con mostaza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Polenta de 110 g / 4oz", "40 g / 1½ oz de mantequilla sin sal", "75 g / 2½ oz de queso parmesano, finamente rallado", "1 cucharadita de sal marina", "aceite vegetal o de girasol, para freír", "Filetes de solomillo 4 x 150-200g / 5½-7oz", "½ cucharadita de granos de pimienta Kampot", "½ cucharadita de granos de pimienta blanca", "½ cucharadita de pimienta negra", "½ cucharadita de granos de pimienta verde", "½ cucharadita de granos de pimienta rosa", "75g / 2½oz de mantequilla sin sal", "2 chalotes, finamente picados", "150ml / 5fl oz de aguardiente", "150ml / 5fl oz crema fresca", "selección de hojas estacionales", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto"], "method": ["Para la polenta y las chips de Parmesano, forra una bandeja para hornear con papel para hornear.", "Traiga 570 ml / 1 pinta de agua a ebullición en una olla grande. Poco a poco mezcle la polenta y luego la mantequilla. Termina con el queso y la sal. Vierta en la bandeja de horno forrada y deje reposar en la nevera durante al menos una hora.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Corta la polenta en formas de chips. Freír a fuego lento durante 3-5 minutos o hasta que estén dorados y crujientes. Coloque en un plato con papel de cocina para drenar el exceso de grasa.", "Para la carne, triture todos los granos de pimienta en un mortero. Presione la pimienta en los filetes. Caliente una sartén, agregue la mantequilla y cocine los filetes a su gusto. Retire los filetes de la sartén y déjelos reposar.", "En la misma sartén, prepara la salsa. Cocine los chalotes por 2 minutos. Vierta el brandy y raspe los trozos cocidos. Cocine hasta que el brandy haya reducido su volumen por lo menos a la mitad. Termina con la crème fraîche.", "Para la ensalada, mezcle las hojas en un tazón. Batir el aceite y el vinagre juntos en un tazón pequeño. Justo antes de servir vierte el aderezo sobre las hojas y mezcle.", "Sirva los filetes con la salsa derramada, con las hojuelas de polenta y ensalada aderezada."], "url": "www_bbc_co_uk_food_recipes_peppered_beef_fillet_61512", "title": "Filete de ternera sazonado con chips de polenta y ensalada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de solomillo gruesos, aproximadamente 175 g / 6 oz en total, con guarnición de grasa", "1 cucharadita de granos de pimienta coloreados, aplastados", "copos de sal gruesa", "60g / 2¼ oz de yogur natural", "½ cucharadita de salsa de rábano picante (al gusto)", "½ diente de ajo, aplastado", "50g / 2oz de hojas de ensalada verde mixta", "30g / 1¼ oz de champiñones, en rodajas", "½ cebolla roja, finamente rebanada", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Frote los filetes con los granos de pimienta triturados y escamas de sal.", "Mezcle el yogur, la salsa de rábano picante y el ajo y sazone al gusto con sal y pimienta negra recién molida. Agregue las hojas de ensalada, los champiñones y la mayor parte de la cebolla roja y revuelva suavemente.", "Caliente el aceite en una sartén, agregue los filetes y cocine a fuego alto durante 2 minutos o hasta que se doren. Voltee y cocine durante 2 minutos más por medio raro, 3-4 minutos por medio o 5 minutos por bien hecho. Coloque el bistec en un plato caliente y déjelo reposar durante unos minutos.", "Coloque las hojas de ensalada en el centro de 2 platos para servir. Corta finamente los filetes y coloca las piezas encima. Adorne con la cebolla roja restante."], "url": "www_bbc_co_uk_food_recipes_peppered_beef_with_salad_27535", "title": "Carne picada con hojas de ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppered_beef_with_salad_27535_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 mini filetes de pollo", "1 cucharada de pimienta negra finamente triturada", "1 cucharada de aceite de oliva", "4 lonchas de tocino", "1 aguacate, toscamente picado", "½ cebolla roja, finamente picada", "½ limón, solo jugo", "1 chile rojo, finamente picado", "½ cucharadita de comino molido", "2 cucharadas de cilantro fresco tostado", "sal y pimienta negra recién molida", "4 rebanadas de soja y pan de linaza", "2 cucharadas de mayonesa lista para usar", "1 bola de mozzarella de búfalo, espesamente en rodajas", "4 remolachas cocidas o 2 tomates frescos, rebanados"], "method": ["Aplane los mini filetes de pechuga con un mazo de carne o rodillo, hasta ½ cm de grosor.", "Espolvoree el pollo con granos de pimienta triturados para cubrir ligeramente.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite y el pollo. Freír por 2-3 minutos en cada lado, hasta que estén tiernos dorados y completamente cocidos.", "Calentar una segunda sartén hasta que esté caliente, luego agregar el tocino y freír hasta que esté dorado.", "Mientras tanto, coloca el aguacate en un tazón y machaca con un tenedor.", "Agregue la cebolla roja, el limón, el chile, el comino y el cilantro, sazone con sal y pimienta negra recién molida y mezcle bien.", "Para armar los sándwiches, unte la mayonesa en dos rebanadas del pan. Cubra con el tocino, luego el pollo, luego las rodajas de mozzarella. Extienda el guacamole en dos rebanadas más del pan. Cubra cada sándwich con muchas rodajas de tomate o remolacha y cierre con la rebanada de pan cubierto de guacamole."], "url": "www_bbc_co_uk_food_recipes_pepperedchickenbacon_83637", "title": "Pollo a la pimienta, tocino, mozzarella y guacamole en pan de soja y linaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechos de pato de Berbería hembra", "2-3 cucharadas de pimienta negra, agrietada", "50ml / 2fl oz de coñac", "Salsa ligera de 100 ml / 3½ fl oz (o pollo reducido y engrosado con arrurruz)", "100ml / 3½ fl oz crema doble", "110 g / 4 oz de hongos shiitake", "110g / 4oz de setas de ostra", "30g / 1oz de setas de trompeta negras secas, empapadas y escurridas", "25ml / 1fl oz de aceite de oliva ligero", "2 cucharadas de mantequilla", "110 g / 4 oz de espinaca fresca", "8 ramitas de flatleaf perejil para adornar"], "method": ["Recorte los pechos de pato y anote ligeramente el lado de la piel con un cuchillo afilado.", "Extienda los granos de pimienta agrietados en los pechos de pato, presionando la pimienta en los senos. Sazonar con sal.", "Caliente una sartén grande a fuego moderado y coloque las pechugas de pato con la piel hacia abajo. Déjelos cocinar por 5 minutos o hasta que la piel esté dorada y crujiente.", "Voltee los senos y cocine por aproximadamente 4 minutos más.", "Retire los pechugas de pato de la sartén y manténgalos calientes.", "Vierte la grasa y desglasa la sartén con el coñac.", "Agregue la salsa (o caldo), revolviendo bien para raspar los jugos caramelizados.", "Agregue la crema y cocine a fuego lento para reducir la consistencia de la salsa.", "Freír los champiñones en el aceite de oliva y la mitad de la mantequilla.", "Freír las espinacas en la mantequilla restante.", "Mezcla los dos juntos.", "Para servir, espolvoree la mezcla de espinacas y champiñones en platos calientes. Corta los pechugas de pato y coloca encima de la mezcla de espinacas. Rodear con la salsa."], "url": "www_bbc_co_uk_food_recipes_pepperedduckbreastwi_70257", "title": "Pechuga de pato con setas y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechos de pato", "4 cucharaditas de pimienta negra", "1 cucharada de aceite vegetal", "125g / 5oz de cerezas, piedras removidas", "50ml / 2fl oz de flor de saúco cordial", "50ml / 2fl oz de vinagre de sidra", "100ml / 4fl oz de aceite de colza", "sal al gusto", "75g / 3oz de lechuga de Bull's Blood u otra variedad de hojas rojas de lechuga", "Hojas de apio de 25g / 1oz o hojas de apio", "25 g / 1 oz de pétalos de saúco frescos", "½ cetrería de mostaza"], "method": ["Recorte la pechuga de pato y elimine cualquier exceso de tendones. Marca la piel ligeramente con un cuchillo afilado.", "Pon los granos de pimienta en un almirez, machaca y aplasta.", "Enrolle cada pechuga de pato en los granos de pimienta y sazone al gusto con sal.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite vegetal y las pechugas de pato, con la piel hacia abajo.", "Cocine durante aproximadamente un minuto, luego reduzca el fuego y cocine durante unos cinco minutos por cada lado, o hasta que se cocinen a su gusto. (Esta cantidad de tiempo le dará carne medio rara).", "Retire el pato de la sartén y descanse sobre una rejilla sobre un plato.", "Para hacer el aderezo, coloque las cerezas y el cordial de flor de saúco en una olla y cocine a fuego lento. No hierva, solo deje que las cerezas se calienten y purgue su color en el cordial hasta que tome un color rosado.", "Retire la cacerola del fuego y deje que la mezcla se enfríe.", "Retire las cerezas de la mezcla y déjelas a un lado.", "Agregue el vinagre de sidra y el aceite de colza. Agregue una pizca de sal al gusto y devuelva las cerezas a la sartén.", "Para servir, coloque las hojas de lechuga, el apio y el berro en un recipiente y agregue un poco del aderezo.", "Corta los pechugas de pato en rodajas finas. Coloque la ensalada y el pato en un plato. Vierta un poco más de aderezo en la parte exterior de la ensalada y termine con una pizca de pétalos de flor de saúco."], "url": "www_bbc_co_uk_food_recipes_pepperedduckwithcher_86500", "title": "Pato a la pimienta con cerezas, apio y aderezo de flor de saúco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de queso de cabra suave, cortado en rondas", "1 cucharadita de pimienta negra molida", "1 cucharada de aceite de oliva", "2 chalotes, toscamente picados", "1 cucharada de vinagre balsámico", "75g / 2¾oz de arándanos", "½ cucharadita de pimienta negra recién molida", "100 g / 3½ oz de hierbas frescas mezcladas picadas (perejil, perifollo, eneldo, cilantro, albahaca, cebollín)"], "method": ["Para la ensalada de queso de las cabras, coloque una sartén a fuego alto hasta que comience a humear.", "Enrolle el queso de cabra en la pimienta negra molida y póngalo en la sartén de la plancha para que se cocine durante dos minutos por cada lado.", "Para hacer la salsa, caliente el aceite de oliva en una sartén pequeña a fuego medio. Agregue la chalota y fría hasta que esté suave.", "Agregue el vinagre balsámico, los arándanos y la pimienta negra recién molida, luego hierva y reduzca el volumen del líquido a la mitad.", "Para servir, coloque la ensalada de hierbas mixtas en el centro del plato. Coloque el queso de cabra a la parrilla encima y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheeses_80867", "title": "Ensalada de queso de cabra con salsa de arándanos balsámicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de granos de pimienta negra agrietados", "4 x 75 g / 3 oz rebanadas redondas de queso de cabra", "4 rebanadas de pan granero o de nuez, cortadas en círculos más grandes que las rondas de queso de cabra, tostadas", "botón de mantequilla", "2 chalotes, en rodajas finas", "pulgar tamaño jengibre fresco, rallado", "Puerto de 75 ml / 3 fl oz", "150ml / 5fl oz de caldo de pollo", "Gelatina de grosella negra 250 g / 9 oz", "1 cucharadita de pimienta verde en salmuera, enjuagada y escurrida", "Nueces en escabeche de un frasco, para servir"], "method": ["Precalentar la parrilla a su configuración más alta.", "Vierta los granos de pimienta negra agrietados en un plato. Presione un lado de cada una de las rondas de queso de las cabras en los granos de pimienta.", "Coloque las rondas de queso de las cabras en las rondas de pan, con la pimienta hacia arriba y coloque debajo de la parrilla durante cuatro minutos, o hasta que el queso esté suave y derretido.", "Para la salsa Cumberland, derrita la mantequilla en una sartén a fuego medio. Agregue los chalotes y el jengibre y fría por 2-3 minutos, hasta que estén blandos.", "Agregue el puerto y hierva hasta que el líquido se reduzca a un jarabe muy espeso, luego agregue el caldo.", "Ponga a hervir el caldo, luego agregue la jalea de grosella roja y los granos de pimienta verde y reduzca el fuego a fuego lento durante 2 a 3 minutos, o hasta que la jalea se haya disuelto por completo.", "Para servir, coloque el queso sobre la tostada en un plato calentado. Rocíe la salsa sobre el queso y espolvoree con nueces encurtidas."], "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_84776", "title": "Queso de cabra con salsa de Cumberland y nueces encurtidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de granos de pimienta negra, más o menos triturados", "150g / 5½oz de queso de cabra, cortado en tres piezas", "1 melocotón maduro, pelado y picado", "exprimir jugo de limón", "1 cucharada de perejil fresco picado"], "method": ["Para el queso de cabra con pimientos, coloque los granos de pimienta triturados en un plato poco profundo. Presione un lado de cada pedazo de queso de cabra en los granos de pimienta triturados.", "Calentar una sartén pequeña a fuego medio y freír el queso durante tres minutos por cada lado.", "Para la salsa de durazno, coloque las piezas de melocotón, el jugo de limón y el perejil en un bol y mezcle bien.", "Para servir, coloque las piezas de queso de cabra en un plato pequeño y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85128", "title": "Queso de cabra con salsa de melocotón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ queso de cabra firme, cortado en cubos", "2 cucharaditas de pimienta negra, ligeramente trituradas", "1 cucharadita de aceite de oliva", "1 pequeño manojo de cohetes, toscamente picado", "1 cucharadita de aceite de oliva", "½ cucharadita de vinagre balsámico", "sal y pimienta negra recién molida", "1 remolacha cocida, cortada en cubos, para servir"], "method": ["Para el queso de cabra con pepitas, enrolle los cubos de queso en pimienta negra para cubrir por todos lados.", "Calentar el aceite de oliva en una sartén pequeña y freír el queso hasta que esté dorado y crujiente por todos lados.", "Para la ensalada de cohetes, coloque el cohete en un recipiente y rocíe sobre el aceite y el vinagre. Sazonar con sal y pimienta negra recién molida y remover bien para cubrir las hojas.", "Para servir, coloque la ensalada de cohetes en un plato y cubra con queso de remolacha y remolacha."], "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85493", "title": "Queso de cabra con queso y ensalada de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan crujiente blanco", "4 cucharadas de aceite de oliva", "100g / 3½oz de queso de cabra redondo", "1 cucharada de granos de pimienta molidos", "½ tomate de ternera, cortado en cubitos", "½ cucharadita de copos de chile", "1 cucharada de vinagre balsámico", "pequeño puñado cada albahaca fresca y hojas de cilantro"], "method": ["Cepille el pan con la mitad del aceite. Tueste el pan en una sartén caliente.", "Cortar el queso de cabra por la mitad para hacer dos discos y cubrir los granos de pimienta triturados. Planche en la sartén durante aproximadamente un minuto por cada lado hasta que se derrita y se dore.", "Coloque el tomate, los copos de chile, el aceite restante y el vinagre juntos en una cacerola pequeña y caliente, revolviendo bien. Apague el fuego y déjelo a un lado.", "Arregle la albahaca y el cilantro en dos platos. Coloque una rodaja de bruschetta en un lado y coloque el queso de cabra en la parte superior. Vierta sobre el aderezo de tomate caliente y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_87296", "title": "Queso de cabra picante con aderezo de tomate caliente en bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]