[{"ingredients": ["450 g / 1 lb de carne de res magra", "1 cucharadita de ajo machacado", "1 cebolla grande, finamente picada", "½ cucharadita de pimienta negra, molida gruesa", "1 cucharadita de sal masala", "1 huevo de gallinas camperas", "1 cucharadita de aceite de colza", "1 cucharadita de semillas de comino", "1 cucharadita de jengibre de raíz finamente picado", "1 x 400 g / 14 oz pueden cortar tomates", "1 cucharadita de puré de tomate", "½ cucharadita de cúrcuma molida", "60-90ml / 2-3fl oz de agua (opcional)", "arroz basmati marrón cocido, para servir"], "method": ["Mezcle la carne molida, el ajo, la mitad de la cebolla, la pimienta, el garam masala y el huevo en un bol. Usando sus manos, dé forma a la mezcla de carne en 24 bolas.", "Precalentar la parrilla a caliente. Alinee la parte inferior de una bandeja de parrilla con papel de aluminio y coloque las albóndigas en la bandeja de la parrilla. (Esto permitirá que la grasa se drene en la bandeja revestida, lo que ahorrará el lavado.) Ase las albóndigas a fuego medio durante 10-15 minutos, volteándolas de vez en cuando o hasta que estén doradas.", "Caliente el aceite de colza en una sartén y agregue las semillas de comino y la cebolla restante. Cocine por 4-5 minutos, o hasta que se ablanden, luego agregue el jengibre.", "Agregue los tomates picados, puré de tomate y cúrcuma y cocine durante 10 minutos o hasta que la salsa se espese.", "Agregue las albóndigas cocidas, reduzca el fuego y cocine a fuego lento durante 20 minutos. Agregue 60-90 ml / 2-3 fl oz de agua si el curry está un poco seco. Sirve con arroz."], "url": "www_bbc_co_uk_food_recipes_meatball_curry_51206", "title": "Albóndiga al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatball_curry_51206_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de carne magra picada", "Carne picada de cerdo 250 g / 9 oz", "1 cebolla pequeña, muy finamente picada", "1 diente de ajo, finamente picado", "25g / 1oz de pan blanco fresco", "2 cucharaditas de hierbas secas mezcladas", "sal marina y pimienta negra recién molida", "2 cucharaditas de aceite de girasol", "1 cucharada de aceite de girasol", "1 cebolla mediana, finamente rebanada", "1 cucharada de harina normal", "150ml / 5fl oz de vino tinto", "300 ml / 10 fl oz de caldo de carne hecho con 1 cubo de carne de vacuno", "1 cucharada de puré de tomate"], "method": ["Coloque la carne de res y la carne de cerdo en un tazón grande y agregue la cebolla, el ajo, el pan rallado y las hierbas secas. Sazonar con sal y pimienta negra recién molida y mezclar bien con las manos limpias. Divida la mezcla en 20 porciones y enrolle en bolitas pequeñas y ordenadas.", "Caliente el aceite de girasol en una sartén grande antiadherente y fríe las albóndigas durante 6-8 minutos, o hasta que estén doradas por todos lados. Enrolle las albóndigas en la sartén mientras se doran para evitar que se aplasten en un lado. (Puede necesitar hacer esto en lotes). Transfiera las albóndigas a una olla grande con tapa.", "Para hacer la salsa, caliente el aceite de girasol en la sartén y fría la cebolla a fuego lento durante cinco minutos, o hasta que se ablande, revolviendo regularmente.", "Espolvorea la harina en la sartén y revuelve bien. Agregue lentamente el puré de vino tinto, caldo y tomate, revolviendo constantemente.", "Vierta la salsa sobre las albóndigas y deje que hierva. Reduzca el fuego, cubra la olla con una tapa y deje hervir a fuego lento a fuego lento durante 30 minutos, revolviendo ocasionalmente.", "Retire la tapa y aumente el calor. Hierva la salsa por otros 3-5 minutos o hasta que espese. Sazonar, al gusto, con sal y pimienta negra recién molida y servir."], "url": "www_bbc_co_uk_food_recipes_meatballs_in_gravy_04987", "title": "Albóndigas en salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de carne picada 2 oz", "2 dientes de ajo, finamente picados o rallados", "1 huevo de gallinas camperas, golpeado", "½ cucharadita de comino molido", "½ cucharadita de orégano seco", "2 rebanadas de pan blanco rancio (aproximadamente 100 g / 3½ oz), empapado en vino tinto, exprimido seco y desgarrado en trozos pequeños", "½ cucharadita de sal", "12 vueltas de peppermill negro", "3 cucharadas de aceite de oliva", "3 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "5cm / 2in canela en rama", "1 cucharadita de comino molido", "1 cucharadita de azúcar", "150ml / 5fl oz de vino tinto", "1 cucharada de puré de tomate", "Pase de 500ml / 18fl oz", "½ cucharadita de sal", "12 vueltas de peppermill negro", "arroz cocido", "12 aceitunas verdes"], "method": ["Para hacer las albóndigas, coloque todos los ingredientes, excepto el aceite de oliva, en un tazón grande y mezcle. Con las manos mojadas, dé forma a la mezcla en 20 a 24 formas de pelota de rugby.", "Calentar el aceite en una sartén a fuego alto y freír las albóndigas hasta que estén doradas por todos lados, o asar a la parrilla en una sartén si le gustan las líneas de la parrilla en las hamburguesas.", "Para hacer la salsa de tomate, caliente el aceite en una cacerola con tapa a fuego medio. Sudor la cebolla y el ajo con la rajita de canela, el comino y el azúcar hasta que estén blandos, unos 10 minutos. Agregue el vino tinto y lleve a ebullición, luego reduzca el fuego a medio. Agregue el puré de tomate, passata, sal y pimienta y cocine hasta que espese un poco, aproximadamente 20 minutos.", "Agregue las albóndigas y cocine a fuego lento durante 20-30 minutos cubiertos hasta que estén cocidas, agregando un poco de agua si la salsa es demasiado espesa. Sirve con arroz y aceitunas verdes."], "url": "www_bbc_co_uk_food_recipes_meatballs_in_tomato_95724", "title": "Albóndigas en salsa de tomate con canela y comino (Soutzoukakia)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_in_tomato_95724_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de carne picada", "½ cucharadita de tomillo", "2 cebollas tiernas, finamente picadas", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva, para freír", "1 cucharada de aceite de oliva extra virgen", "2 dientes de ajo, en rodajas finas", "pellizque hojuelas de chile seco (o más si le gusta la comida picante)", "400 g de tomates cherry de hojalata o tomates picados", "5 hojas de albahaca, trituradas (opcional)", "Tagliatelle fresco de 200g / 7oz, cocido según las instrucciones del paquete", "parmesano recién rallado"], "method": ["Para las albóndigas, coloque todos los ingredientes de la albóndiga, aparte del aceite, en un bol. Sazone con sal y pimienta, luego use sus manos para mezclar completamente todo. Divida la mezcla en 10 pedazos de tamaño uniforme y enrolle cada pieza en una bola, luego aplaste ligeramente para que se cocinen más rápido.", "Caliente el aceite de oliva en una sartén grande a fuego medio, luego agregue las albóndigas y fría por 5-6 minutos, volteándolas una o dos veces, o hasta que estén doradas por ambos lados y cocidas.", "Para la salsa, caliente el aceite de oliva en una cacerola a fuego medio, agregue el ajo y el chile y fría por 1 minuto. Incline los tomates, aumente el fuego a fuego alto y cocine a fuego lento durante 5 minutos para reducirlos ligeramente, luego sazone con sal y pimienta. Agregue las hojas de albahaca, reservando un poco para adornar.", "Para servir, coloca el tagliatelle caliente en un tazón grande, coloca las albóndigas encima, vierte sobre la salsa de tomate, espolvoréalo con parmesano y adorna con un poco de albahaca."], "url": "www_bbc_co_uk_food_recipes_meatballs_with_cherry_34105", "title": "Albóndigas con salsa de tomate cherry y tagliatelle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_cherry_34105_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite", "1 cebolla picada", "1 filete de anchoa, picado", "200 ml / 7 fl oz de caldo de ternera reducido (o caldo de pollo)", "Crema doble de 200 ml / 7 fl oz", "1 cucharada de harina de maíz", "sal y pimienta negra recién molida", "½ cebolla, finamente picada", "150ml / 5fl oz de crema doble", "100ml / 3½ fl oz de leche", "1 cucharada de sal", "1 cucharadita de pimienta de Jamaica molida", "100g / 3½ oz de pan rallado fresco", "Carne picada de carne 250 g / 9 oz", "Carne picada de cerdo 250 g / 9 oz", "4 cucharadas de aceite vegetal, para freír, más extra para engrasar", "75g / 2½oz de mantequilla sin sal", "¼ repollo blanco, afeitado fino en una mandolina", "1 cabeza de hinojo, afeitado fino en una mandolina", "sal", "2 manzanas, rasuradas finamente en una mandolina", "2 cucharadas de aceite de oliva", "3 cucharadas de crema agria", "sal y pimienta", "1 cucharada de vinagre de vino blanco", "500g / 1lb 2oz de papas nuevas cocidas"], "method": ["Para la salsa de crema, caliente el aceite en una sartén grande y fría las cebollas hasta que estén suaves y translúcidas. Agregue la anchoa y el caldo. Llevar a ebullición y cocinar hasta que el volumen de líquido se haya reducido en un tercio. Agregue la crema y cocine a fuego lento durante otros 6-8 minutos.", "Mezcle la harina de maíz con un poco de agua para formar una pasta y luego revuelva en la salsa. Condimentar con sal y pimienta. Mantenga caliente hasta que esté listo para servir.", "Precalentar el horno a 220C / 200C Fan / Gas 6.", "Para las albóndigas, freír la cebolla en un poco de mantequilla hasta que esté suave y luego transferirla a un tazón grande. Mezcle la crema, la leche, la sal, las especias y el pan rallado. Agregue la carne picada de cerdo y carne y mezcle completamente a mano. Enrolle la mezcla en bolitas y colóquelas en una bandeja para hornear ligeramente engrasada.", "Agregue un poco de agua a otra lata de hornear y colóquela en el fondo del horno para crear vapor. Tueste las albóndigas durante 10 minutos o hasta que estén firmes.", "Para la ensalada, coloque el repollo y el hinojo en un tamiz grande. Espolvorea con sal y deja de lado durante 5-10 minutos. A continuación, exprime el líquido de la col con las manos. Coloque en un tazón y mezcle los ingredientes restantes de la ensalada. Condimentar con sal y pimienta.", "Para terminar las albóndigas, caliente el aceite y la mantequilla restante en una sartén grande y fría hasta que se dore (haga esto en tandas, si es necesario, no amontone la sartén).", "Para servir, ponga las albóndigas en un tazón para servir y vierta sobre la salsa de crema. Sirva la ensalada al lado en tazones para servir por separado. Una pequeña mermelada de arándano rojo también sería tradicional."], "url": "www_bbc_co_uk_food_recipes_meatballs_with_cream_52301", "title": "Albóndigas suecas con salsa de crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 carcasa de pollo", "½ cebolla", "½ barra de apio", "½ parecía", "1 hoja de laurel", "5 granos de pimienta negra", "1 ramita pequeña de tomillo fresco", "50ml / 2fl oz de aceite de oliva", "2 cebollas grandes, en rodajas finas", "1 hoja de laurel", "2 litros / 3½ pintas de leche entera", "Una pizca de sal marina", "2 limones, solo jugo", "100 g / 3½ oz de mantequilla", "50g / 1¾oz de pan rallado fresco", "500 g / 1lb 2 oz de carne picada de cerdo", "100 g / 3½ oz de salami de finocchiona (salami con hinojo), finamente picado", "1 huevo de gallinas camperas", "pellizcar las semillas de hinojo", "1 ramita de romero fresco, solo hojas, finamente picado", "1 ramita de orégano fresco, solo hojas, finamente picado", "1 cucharada de aceite de oliva, más extra para lloviznar", "1 cabeza de hinojo, en rodajas muy finas (use una mandolina, si está disponible)", "50g / 1¾oz de queso parmesano, rallado", "2 cucharadas de piñones, tostados", "sal marina y pimienta negra recién molida"], "method": ["Para el caldo de pollo, coloque todos los ingredientes en una olla grande. Cúbralo con agua fría y lentamente hágalo hervir. Reduzca el fuego y cocine a fuego lento durante 3 horas. Elimine cualquier grasa de la superficie, cuanto más grasa elimine, más clara y, por lo tanto, más pura será su reserva.", "Cuele el caldo a través de un colador forrado con un paño fino. Lentamente vierta a través de - no presione o se nublará. Vierta el caldo colado en una olla limpia y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Cúbrase de nuevo y relájese.", "Para la mermelada de cebolla, caliente el aceite de oliva en una cacerola. Agregue las cebollas y la hoja de laurel y cocine suavemente hasta que estén suaves. Cocine a fuego lento durante aproximadamente una hora, o hasta que las cebollas estén doraditas y sus azúcares naturales se hayan caramelizado. Retire del fuego. Cuando esté frío, colóquelo en un recipiente hermético y transfiéralo a la nevera.", "Para hacer la ricota, caliente la leche hasta que esté por debajo de la ebullición, luego agregue la sal y el jugo de limón. Retirar del fuego y reservar por 10 minutos. Después de este tiempo, la leche debe cuajarse. Cuele a través de un trapo de muselina y déjelo reposar durante 30 minutos (deje por más tiempo si prefiere un ricotta más seco). Almacene en un recipiente hermético y en la nevera.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para las albóndigas, derrita 50g / 1¾oz de mantequilla en una sartén a fuego medio. Agregue las migas de pan y pan tostado hasta que estén doradas, revolviendo con frecuencia. Si comienzan a colorear demasiado rápido, baje el calor. Dejar de lado para enfriar.", "Mezcle la carne picada, el salami, el huevo, las semillas de hinojo y las hierbas en un tazón. Enróllate en pelotas de golf usando tus manos. Calentar un chorrito de aceite de oliva en una sartén, luego agregar las albóndigas y freírlas para sellarlas. Transfiera a un plato refractario.", "Ponga el hinojo y una cucharada de aceite de oliva en la sartén y cocine suavemente durante unos 10 minutos. Agregue 2 cucharadas de mermelada de cebolla y todo el caldo de pollo. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que el volumen del líquido se haya reducido en tres cuartas partes. Agregue la mantequilla restante y agítelo para que emulsione y combine en una salsa. Sazonar con sal y pimienta y verter la mezcla sobre las albóndigas.", "Hornee las albóndigas durante 10 minutos, luego retírelas, espolvoree queso parmesano y espolvoree unas pocas cucharadas de ricotta. Regrese al horno por 5 minutos o hasta que el parmesano se haya dorado. Espolvoree las migas de pan reservadas y los piñones uniformemente sobre la parte superior y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_meatballs_with_fennel_10756", "title": "Albóndigas con hinojo y ricotta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_fennel_10756_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 vainas de cardamomo", "2 cucharaditas de semillas de cilantro", "4 dientes grandes de ajo", "gran pizca de sal", "Carne picada de carne magra 300g / 11oz", "200 g / 7 oz de carne picada de cerdo", "½ cucharadita de cúrcuma", "chile en polvo, al gusto", "1 huevo de gallinas camperas; vencido", "1-2 cucharadas de aceite de cacahuete", "115g / 4oz de queso crema", "200g / 7oz de tomates baby ciruela, cortados por la mitad a lo largo", "1 cucharada de yogur natural", "2-3 cucharadas de hojas de cilantro picado", "2 cucharadas de almendras en copos, tostadas", "4 chalotes, finamente rebanados y fritos", "150g / 5½oz de hojas de ensalada mixtas", "2 cucharadas de hojas de menta finamente picadas", "2 cucharadas de cebollines finamente picados", "2 cucharadas de perejil de hoja plana finamente picado", "2 cucharadas de orégano finamente picado", "1 cucharadita de vinagre de vino blanco", "1 cucharadita de mostaza inglesa", "3 cucharadas de aceite de oliva"], "method": ["Para las albóndigas, saque las semillas de cardamomo, coloque en un molinillo de café o mortero con el cilantro y muela hasta obtener un polvo fino. Pique el ajo con la sal hasta que se forme una pasta, o agréguelo al mortero.", "Coloque la carne de res y cerdo en un recipiente y mezcle vigorosamente para suavizar la textura, esto ayudará a evitar que el queso se escape.", "Agregue las especias molidas, la cúrcuma, el chile en polvo y el ajo, luego mezcle bien con las manos y agregue el huevo batido.", "Moja tus manos, toma pedazos de la mezcla y forma albóndigas del tamaño de pelotas de ping-pong. Deberías tener alrededor de 12 albóndigas.", "Engrase ligeramente una superficie de trabajo limpia con un poco del aceite de cacahuete y presione suavemente las bolas en círculos aplanados", "Ponga una cucharadita de queso crema en el centro de cada círculo de carne y cuidadosamente traiga la carne alrededor para encerrar completamente el queso, haciendo albóndigas más grandes. Ruede suavemente y asegúrese de que no haya agujeros.", "Calentar una sartén hasta que esté caliente, agregar el aceite restante y freír las albóndigas durante 10 minutos a fuego medio alto, girando con regularidad. Coloque las albóndigas en un plato de servir y manténgase caliente.", "Encienda la fuente de calor, luego agregue los tomates a la sartén, freírlos rápidamente, luego retire la sartén del fuego y agregue el yogur.", "Para la ensalada, mezcle las hojas y las hierbas en un tazón grande. Batir el vinagre, la mostaza y el aceite de oliva juntos y sazonar con sal y pimienta negra, luego mezcle con las hojas de ensalada.", "Para servir, coloque la ensalada alrededor del borde de una fuente y coloque las albóndigas en el centro. Vierta los tomates sobre las albóndigas y decore con el cilantro picado, almendras y chalotes fritos."], "url": "www_bbc_co_uk_food_recipes_meatballs_with_herb_94389", "title": "Albóndigas con ensalada de hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_herb_94389_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de carne picada", "1 huevo mediano de gallinas camperas", "2 cucharadas de pan rallado fresco o seco", "1 cucharadita de hierbas mezcladas secas", "1 diente de ajo", "1 cucharada de aceite vegetal", "sal y pimienta", "400g de tomates cortados en lata", "1 cucharadita de hierbas mezcladas secas", "1 cucharadita de azúcar en polvo", "1 diente de ajo", "Espagueti 150 g / 5½ oz"], "method": ["Coloque la carne, el huevo, las migas de pan y las hierbas en un tazón grande. Pele y ralle finamente el ajo y luego agregue al tazón. Trabaja la mezcla con tus manos hasta que esté bien mezclada. Condimentar con sal y pimienta. Enrolla la mezcla en 12 bolas del mismo tamaño.", "Caliente el aceite en una sartén grande a fuego medio-alto. Freír las albóndigas en lotes durante 8 minutos hasta que estén doradas por todas partes. Regrese todas las albóndigas a la sartén y vierta sobre los tomates picados, las hierbas mezcladas y el azúcar. Pele y ralle el ajo, agregue a la sartén y luego cocine a fuego medio durante 8-10 minutos.", "Mientras las albóndigas se cocinan, ponga a hervir una sartén grande de agua con sal. Agregue los espaguetis y cocine durante 10-12 minutos o de acuerdo con las instrucciones del paquete. Justo antes de que los espaguetis estén listos, agregue un cucharón de agua de pasta a la salsa de tomate para adelgazar, si es necesario.", "Escurra los espaguetis y agregue a la sartén con las albóndigas. Mezcle para combinar y luego divida entre dos tazones de servir."], "url": "www_bbc_co_uk_food_recipes_meatballs_with_tomato_70221", "title": "Albóndigas con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_tomato_70221_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de carne picada", "1 diente de ajo pequeño, finamente picado", "4 cucharaditas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "3 tomates, picados", "1 cucharada de ketchup de tomate", "2 cucharadas de perejil fresco picado (opcional)", "sal y pimienta negra recién molida", "1 baguette pequeño o bastón, cortado por la mitad", "simple ensalada verde"], "method": ["Para las albóndigas, ponga la carne picada y el ajo en un tazón y mezcle bien para combinar. Forme pequeñas albóndigas con las manos mojadas.", "Calentar el aceite de oliva en una sartén y freír las albóndigas durante 5-6 minutos, volteándolas frecuentemente, hasta que se doren por completo y se cuezan bien. Retire las albóndigas de la sartén, déjelas a un lado y manténgalas calientes.", "Para la salsa, freír la cebolla y el ajo en la sartén, las albóndigas se cocinaron durante 2-3 minutos, o hasta que se ablanden. Agregue los tomates y el ketchup. Condimentar con sal y pimienta. Cocine a fuego lento durante 3-4 minutos, o hasta que los tomates estén tiernos, luego agregue el perejil picado (si lo usa).", "Regrese las albóndigas a la sartén para calentarlas en la salsa. Coloque la baguette y sirva con una ensalada verde al lado."], "url": "www_bbc_co_uk_food_recipes_meatballsandtomatosa_90717", "title": "Sandwich de albóndiga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballsandtomatosa_90717_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["rebanada de panceta, picada en cubos", "½ cebolla, picada", "1 cucharada de azúcar moreno", "1 cucharada de vinagre balsámico", "55g / 2oz de lentejas en lata, escurridas", "100g / 3½oz de tomates cherry enlatados, escurridos", "pequeñas hojas de albahaca fresca, rasgada", "1 rebanada de pan, sin costras", "1 diente de ajo, picado", "2 salchichas, pieles eliminadas", "1 yema de huevo de gallinas camperas", "2 cucharaditas de aceite de oliva"], "method": ["Coloque la panceta en una cacerola a fuego alto y freír hasta que estén crujientes y doradas.", "Baje el fuego a medio y agregue la cebolla y suavice.", "Agregue el azúcar y el vinagre y cocine durante dos minutos.", "Agregue las lentejas y los tomates y cocine a fuego lento durante cinco minutos.", "Para las albóndigas, coloque todos los ingredientes de la albóndiga en un procesador de alimentos y mezcle hasta que se combinen.", "Transfiera la mezcla de albóndiga a una superficie de trabajo limpia y con sus manos, forme albóndigas.", "Calentar el aceite de oliva en una cacerola a fuego alto y freír las albóndigas hasta que estén doradas y cocidas.", "Agregue la albahaca a la salsa y mezcle, luego transfiera a un recipiente para servir poco profundo.", "Para servir, coloca las albóndigas encima de la salsa."], "url": "www_bbc_co_uk_food_recipes_meatballsinatomatoan_84354", "title": "Albóndigas en salsa de tomate y lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700 g / 1 libra de carne de vacuno de 8 oz", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cebolla, pelada y finamente picada", "2 cucharadas de aceite de oliva", "3 cucharadas de aceite de oliva", "1 cebolla grande, pelada y finamente picada", "3 dientes de ajo, pelados y finamente picados", "1 cucharadita de semillas de comino", "1 cucharadita de granos de pimienta negra, todo entero", "1 cucharadita de clavo de olor", "1 ramita de canela", "1 hoja de laurel", "4 vainas de cardamomo verde, ligeramente trituradas", "1 cucharada de sal masala", "1 cucharada de chile en polvo suave", "1 cucharada de cúrcuma molida", "4 x 400g / 14oz latas de tomates", "arroz llano cocinado, para servir"], "method": ["Para las albóndigas, mezcle la carne picada, el huevo batido y la cebolla picada en un tazón grande, con las manos, hasta que estén bien combinados.", "Con las manos mojadas, enrolle la mezcla en bolas del tamaño de una nuez.", "Calentar el aceite en una sartén a fuego medio. Agregue las albóndigas en lotes y fría por 4-5 minutos volteándolas regularmente, o hasta que estén doradas por completo y completamente cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para la salsa de tomate picante, caliente el aceite en una sartén grande a fuego medio o bajo. Agregue la cebolla y el ajo y fría por 6-8 minutos, o hasta que estén suaves pero no coloreados.", "Agregue las semillas de comino, pimienta negra, clavo de olor, canela, laurel y las vainas de cardamomo y continúe freír durante 3-4 minutos, o hasta que las especias sean fragantes.", "Agregue el garam masala, el chile en polvo y la cúrcuma molida y fría por otros 2-3 minutos, o hasta que estén fragantes.", "Agregue los tomates enlatados y traiga la mezcla a fuego lento. Cocine a fuego lento durante 18-20 minutos, o hasta que la mezcla se espese.", "Revuelva las albóndigas en la salsa de tomate picante hasta que estén cubiertas y continúe cocinando a fuego lento durante 4-5 minutos, o hasta que estén calientes.", "Para servir, vierta el arroz en el centro de cuatro platos para servir. Coloque las albóndigas y la salsa de tomate picante en la parte superior."], "url": "www_bbc_co_uk_food_recipes_meatballsinspicytoma_91271", "title": "Albóndigas en salsa de tomate picante servido con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de buena calidad, carne de salchicha", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "½ cucharadita de hojuelas de chile seco", "2 dientes de ajo picados", "50g / 1¾oz de tomates baby vine", "½ cucharadita de vinagre balsámico", "1 cucharada de hojas de albahaca fresca, más o menos picadas", "1 cucharada de hojas frescas de salvia picadas", "sal y pimienta negra recién molida"], "method": ["Para hacer las albóndigas, con las manos enharinadas, dé forma a la carne de salchicha en bolas del tamaño de una nuez.", "Calentar el aceite y en una sartén a fuego medio. Agregue las albóndigas y fría por 6-8 minutos, hasta que se doren por completo y completamente cocidas.", "Para hacer la salsa de tomate, caliente el aceite, las hojuelas de chile y el ajo en una sartén por dos minutos.", "Agregue los tomates y cocínelos durante 5-6 minutos, revolviendo hasta que se conviertan en una salsa espesa.", "Agregue el vinagre balsámico y las hierbas frescas y revuelva.", "Agregue las albóndigas, mezcle y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta en un tazón grande y cálido."], "url": "www_bbc_co_uk_food_recipes_meatballsintomatosau_81631", "title": "Albóndigas en salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Cebolla 150g / 5oz, finamente picada", "1 diente de ajo, aplastado", "900 g / 2lb de carne de res recién picada", "2 cucharadas de hierbas recién picadas, como mejorana o 1 cucharada de romero", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "3 cucharadas de aceite de oliva", "Cebolla 110g / 4oz, en rodajas", "1 diente de ajo, aplastado", "150 g / 5¼ oz de mozzarella fresca, rallada", "1 cucharadita de azúcar", "sal y pimienta negra recién molida", "2 x 400g / 14oz latas de tomates"], "method": ["Caliente dos cucharadas de aceite de oliva en una cacerola pesada de acero inoxidable a fuego lento y agregue la cebolla y el ajo. Cubre y suda durante cuatro minutos, hasta que estén suaves y un poco dorados. Dejar enfriar.", "En un tazón, mezcle la carne picada con la cebolla y el ajo fríos y sudados. Agregue las hierbas y el huevo batido. Sazona la mezcla son sal y pimienta.", "Freír un poco para verificar el condimento y ajustar si es necesario. Divida la mezcla en aproximadamente 24 bolas redondas. Cubra las albóndigas y refrigere hasta que se requiera.", "Mientras tanto, prepara la salsa de tomate. Calentar el aceite en una olla de acero inoxidable.", "Agregue la cebolla en rodajas y el ajo picado, mezcle hasta cubrir, cubra y sude en un suave calor hasta que esté suave y dorado.", "Cortar los tomates enlatados y agregar, con todo el jugo, a la mezcla de cebolla.", "Sazone el contenido con azúcar, sal y pimienta recién molida.", "Cocine los tomates sin tapar durante aproximadamente 30 minutos o hasta que el tomate se ablande (mientras está cocinando, haga las albóndigas).", "Calentar una sartén y cocinar las albóndigas durante unos 10 minutos en aproximadamente tres cucharadas de aceite de oliva.", "Cuando estén cocidos, colóquelos en un plato resistente al horno con la salsa de tomate y cubra con la mozzarella rallada. Coloque debajo de una parrilla precalentada hasta que el queso se haya derretido.", "Sirve con espagueti."], "url": "www_bbc_co_uk_food_recipes_meatballswithtomatos_74759", "title": "Albóndigas con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballswithtomatos_74759_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina fuerte y llana, más extra para quitar el polvo", "90ml / 3fl oz de leche, calentada a la temperatura corporal", "50ml / 2fl oz de agua, calentada a la temperatura corporal", "1 cucharadita de levadura seca", "25ml / 1fl oz de aceite de oliva", "pizca de sal", "150g / 5oz de tomates cherry, cortados a la mitad", "Mozzarella de búfala 200g / 7oz, aproximadamente picada", "200 g / 7oz de fiambres italianos variados (por ejemplo: salami, prosciutto, mota)", "1 cucharada de alcaparras, enjuagadas y escurridas", "30g / 1oz de queso parmesano rallado"], "method": ["Para la masa, tamiza la harina en un tazón.", "Mezcle la leche, el agua y la levadura en un recipiente aparte.", "Agregue la mezcla de levadura a la harina y mezcle para formar una masa. Amasar la masa durante cinco minutos en un servicio enharinado y uniforme.", "Agregue el aceite de oliva y amasar nuevamente para combinar. Cubra el recipiente con film transparente y déjelo en un lugar cálido durante dos horas.", "Precaliente el horno a 230C / 450F / Gas 8. Coloque una bandeja para hornear en el horno para precalentar.", "Agregue la sal a la masa y amasar nuevamente, luego divida la masa en cuatro porciones iguales y enrolle en bolas.", "Coloque cada bola sobre una superficie de trabajo enharinada y extiéndala en círculos de 20cm / 8 pulgadas.", "Para el relleno, coloque todos los ingredientes de relleno en un recipiente y mezcle bien.", "Coloque un cuarto de la mezcla de relleno en la mitad de cada círculo de masa, dejando un espacio de 2 cm en el borde.", "Cepille los bordes limpios con agua y doble los otros lados para cubrir el relleno y pellizque los bordes para sellar las cuatro parcelas.", "Coloque los calzones en la bandeja para hornear precalentada y transfiéralos al horno para hornear durante ocho minutos, o hasta que la masa esté bien cocida y caliente."], "url": "www_bbc_co_uk_food_recipes_meatfeastcalzone_86391", "title": "Festín de carne calzone", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de carne picada magra", "Carne de salchicha de cerdo 175g / 6oz", "1 huevo, golpeado", "1 cebolla mediana, finamente picada", "1 diente de ajo, aplastado", "1 cucharada de hojas de salvia picadas", "1 cucharada de mostaza", "1 cucharada de puré de tomate", "110g / 4oz de pan rallado fresco", "½ cucharadita de pimentón", "sal y pimienta negra recién molida"], "method": ["Caliente el horno a 180C / 350F / Gas4.", "Coloque todos los ingredientes en un tazón grande y mezcle bien; es mejor usar las manos aquí.", "Transfiera la mezcla a una lata de hogaza de 900g / 2lb y acaricie hasta nivel. Cubra la parte superior de la mezcla con un trozo de papel engrasado engrasado.", "Hornee en el horno durante 1 hora 30 minutos o hasta que el pastel de carne esté bien cocido. (Retire el papel 15 minutos antes del final de la cocción)."], "url": "www_bbc_co_uk_food_recipes_meatloaf_12471", "title": "pastel de carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatloaf_12471_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas, golpeado", "150ml / 5fl de leche en oz", "Pan blanco suave 300g / 10½oz, cortado en cubos", "1 cucharada de mostaza Dijon", "pizca de tomillo seco", "pizca de nuez moscada recién rallada", "pizca de albahaca seca", "puñado de perejil fresco, finamente picado", "1 cebolla, finamente picada", "100g / 3½oz de apio, finamente picado", "225 g / 8 oz de tocino lardons, fritos hasta que estén dorados por todas partes", "sal y pimienta negra recién molida", "700 g / 1 libra de carne picada de 5 oz", "200 g / 7 oz de carne de cerdo picada", "1 cucharada de salsa Worcestershire", "3 rebanadas de tocino rayado", "Papas de 450g / 1lb, peladas y hervidas", "75 g / 2½ oz de mantequilla", "sal y pimienta negra recién molida", "salsa"], "method": ["Para el pastel de carne, coloque el huevo y la leche en un tazón grande y mezcle.", "Agregue los cubos de pan y deje reposar durante 15 minutos.", "Mash la leche y el pan empapado en huevo con un tenedor.", "Agregue la mostaza, el tomillo, la nuez moscada, la albahaca, la cebolla, el apio y el tocino, sazone con sal y pimienta negra recién molida y mezcle bien.", "Agregue la carne picada de ternera y cerdo y la salsa Worcestershire. Mezcle bien para combinarlo completamente.", "Cúbralo con una película adhesiva y colóquelo en la nevera para que se enfríe (si es posible durante la noche, pero durante al menos dos horas).", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Transfiera la mezcla de albondigas a una lata de pan de 30cm x 11cm / 12in x 4in.", "Cubra con las rebanadas de tocino rayado para cubrir.", "Transfiera al horno y hornee por 55 minutos, o hasta que esté completamente cocido.", "Retire del horno y deje reposar la albondiga durante 5-6 minutos antes de cortar.", "Para el puré de papa, machaque las papas recién cocinadas. Coloque en una sartén a fuego lento y mezcle la mantequilla. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, cortar el pan de carne. Coloque una rebanada en cada plato con una cucharada de puré de patatas al lado. Vierta un poco de salsa y disfrute."], "url": "www_bbc_co_uk_food_recipes_meatloafandmashedpot_88604", "title": "Pan con carne y puré de papa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de carne picada 2 oz (preferiblemente orgánica)", "3 cucharadas de queso parmesano rallado", "3 cucharadas de pan rallado o avena de avena (no instantánea)", "3 cucharadas de perejil fresco picado", "2 huevos de gallinas camperas, ligeramente golpeados", "1 diente de ajo, aplastado", "Sal y pimienta negra recién molida, al gusto", "Mantequilla, para engrasar", "1x400g / 14oz pueden picar tomates, escurridos", "1 cucharadita de aceite de ajo", "1 cucharadita de orégano", "1 x 125 g / 4½ oz de mozzarella en bola (no búfalo), reducido a la mitad, luego en rodajas", "Pocas hojas de albahaca fresca"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "En un tazón grande, con las manos, combine la carne picada, parmesano, pan rallado o avena, perejil, huevos, ajo y agregue un poco de sal y pimienta. No trabaje demasiado, simplemente mezcle ligeramente o la carne se compactará y se volverá espesa.", "Unte con mantequilla una lata de hornear redonda de unos 28 cm de diámetro y coloque la carne en ella, presionando la mezcla ligeramente con los dedos para cubrir el fondo como si la carne picada condimentada fuera la masa de la pizza.", "Asegúrate de haber extraído la mayor cantidad posible de líquido líquido de tu lata de tomates picados, luego mezcla el tomate con el aceite de ajo, el orégano y un poco de sal y pimienta, y úntalo con una espátula de goma sobre la base de carne . Coloque las rodajas de mozzarella en la parte superior y luego colóquelas en el horno de 20 a 25 minutos, momento en el que la carne se debe cocinar completamente y la mozzarella se derritió.", "Retire del horno y deje reposar durante cinco minutos, luego adornar con algunas hojas de albahaca y llevarlo a la mesa antes de cortar en trozos, como una pizza."], "url": "www_bbc_co_uk_food_recipes_meatzza_60080", "title": "Meatzza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatzza_60080_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de cordero 150 g / 5 oz, cortado en tres medallones", "50g / 1¾oz de pan rallado", "½ cucharadita de mostaza Dijon", "1 cucharada de perejil fresco picado", "1 cucharada de aceite de oliva", "½ cebolla, picada", "½ puerro, solo parte blanca, picado", "1 diente de ajo, picado", "150ml / 5fl oz de crema doble", "50g / 2oz Stilton", "50ml / 1¾ fl oz de vino blanco", "150ml / 5fl oz de caldo de carne", "2 cucharadas de puerto", "50g / 2oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén a prueba de horno. Agregue el cordero y cocine durante 1-2 minutos en cada lado.", "En un tazón mezcle las migas de pan, la mostaza de Dijon y el perejil. Coloque la mezcla de migas de pan en cada trozo de cordero, luego transfiera al horno para hornear durante 4-5 minutos, o hasta que esté cocido. Retire del horno y deje reposar durante 3-4 minutos.", "Para los puerros cremosos, caliente el aceite en una sartén, agregue la cebolla, el puerro y el ajo y fría por cuatro minutos.", "Agregue la crema, Stilton y el vino blanco y cocine por cinco minutos, o hasta que el Stilton se haya derretido y la salsa de crema esté espesa.", "Para la salsa del puerto, caliente el caldo de carne y el puerto juntos en una cacerola pequeña. Llevar a ebullición y cocinar durante cinco minutos, luego agregue la mantequilla y revuelva para derretir.", "Para servir, coloca los puerros cremosos en el medio de un plato. Cubra con el cordero y rocíe la salsa del puerto por todas partes."], "url": "www_bbc_co_uk_food_recipes_medallionsoflambwith_84926", "title": "Medallones de cordero con puerros cremosos y salsa de oporto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pequeño paquete de hilos de azafrán", "400ml / 14fl oz de vino blanco", "1 pollo asado", "1 cucharadita de pimienta negra recién molida", "1 cucharadita de canela molida", "5 pequeños bulbos de ajo", "Jengibre fresco de 5cm / 2in en pieza, pelado y finamente picado", "aceite de oliva", "sal marina"], "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Remoje el azafrán en un poco del vino. Frota el pollo con la pimienta y la canela y coloca el pollo en un plato resistente al horno.", "Corta la parte superior de los bulbos de ajo para que puedas ver los dientes y acomodarlos alrededor del pollo con jengibre. Vierta un poco de aceite de oliva en los bulbos de ajo y vierta el azafrán y el vino restante alrededor del pollo. Sazonar el pollo con sal y colocar en el horno.", "Asar durante 20 minutos, luego baje la temperatura del horno a 170 ° C / 325 ° F / Gas 3 y cocine durante otros 40 minutos, o hasta que los jugos salgan limpios y el pollo esté bien cocido. Hilvane el pollo y el ajo regularmente durante la cocción."], "url": "www_bbc_co_uk_food_recipes_medieval_chicken_with_04370", "title": "Pollo medieval con dientes de ajo enteros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4 a 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva virgen extra, más extra para servir", "2 cebollas rojas cortadas en rodajas", "2 calabacines, picados en 1cm / ½ en bastones", "150 g / 5½ oz de apio nabo, cortado en cubos", "1 diente de ajo, finamente picado", "2 cucharadas de puré de tomate", "1 cucharada de pimentón ahumado", "1 x 440 g / 1 libra de tomate picado en lata", "200ml / 7fl oz de caldo de verduras", "1 x 400 g / 14 oz de mantequilla de estaño o frijoles mezclados, escurridos", "puñado de albahaca fresca", "1 limón, ralladura solamente", "100 g / 3½oz de habas cocidas", "250g / 9oz de puré de papas", "1 cucharadita de polvo de hornear", "Harina normal de 100 g / 3½ oz", "sal y pimienta negra recién molida", "1 cucharada de tomillo fresco", "2 cucharadas de aceite vegetal"], "method": ["Para el estofado, caliente dos cucharadas de aceite en una cazuela y fría las cebollas, los calabacines, el apionabo y el ajo durante 4-5 minutos.", "Agregue el puré de tomate y el pimentón ahumado y cocine durante 4-5 minutos más. Agregue los tomates picados y el caldo, lleve a ebullición, luego reduzca a fuego lento durante 20-25 minutos.", "Agregue los frijoles, la albahaca y la ralladura de limón y cocine por otros 10 minutos, luego agregue las habas. Termine el guiso con un buen glug de aceite de oliva virgen extra.", "Mientras tanto, para las tortas de patata a la plancha, mezcle los ingredientes en un bol hasta que estén bien combinados, luego déle forma a la mezcla de patata en seis hamburguesas.", "Caliente el aceite en una sartén y fríe las hamburguesas durante 3-4 minutos por cada lado, o hasta que estén crujientes y doradas por ambos lados.", "Para servir, ponga el estofado en un recipiente y sirva las tortas de papa al costado."], "url": "www_bbc_co_uk_food_recipes_mediterranean_bean_stew_56916", "title": "Guiso de frijoles mediterráneos con tortas de patata a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_bean_stew_56916_16x9.jpg", "isVegetarian": true, "recommendations": 0}]