[{"isVegetarian": true, "title": "Toffee apple muffins", "url": "www_bbc_co_uk_food_recipes_appleandtoffeemuffin_86119", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appleandtoffeemuffin_86119_16x9.jpg", "ingredients": ["2 free-range eggs, lightly beaten", "80g/2¾oz caster sugar", "240ml/8½fl oz milk", "100g/3½oz butter, melted", "300g/10½oz plain flour", "2 tsp baking powder", "½ tsp salt", "pinch cinnamon", "2 eating apples, peeled, cored, finely chopped", "200g/7oz shop-bought toffee pieces"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/380F/Gas 5 and line a 12-hole muffin tin with paper cases.", "Mix the eggs, sugar, milk and melted butter in a large bowl. Sift the flour, baking powder, salt and cinnamon into the bowl. Stir well to combine.", "Add the chopped apple and lightly mix.", "Using half of the mixture, quarter-fill each of the muffin cases with the mixture and top with a few pieces of toffee. Cover with the remaining filling so the cases are half full.", "Bake for 30-35 minutes until well risen and golden. Transfer to a wire rack to cool. Serve warm or cold."]}, {"isVegetarian": true, "title": "Apple cake", "url": "www_bbc_co_uk_food_recipes_applecake_90046", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecake_90046_16x9.jpg", "ingredients": ["330ml/11½fl oz French cider", "300g/10½oz plain flour", "2 tsp bicarbonate of soda", "1 tsp mixed spice powder", "1 tsp ground cinnamon", "pinch freshly grated nutmeg", "4 apples, peeled, core removed, grated", "150g/5oz soft dark brown sugar", "150g/5oz melted butter", "2 free-range eggs", "200g/7 oz golden sultanas", "100g/3½oz pecans, chopped ", "250g/9oz mascarpone", "splash double cream ", "1 tsp ground cinnamon"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Place the cider into a pan over a high heat. Bring to the boil and cook until reduced by two thirds.", "Sift the plain flour, bicarbonate of soda, mixed spice powder, cinnamon and nutmeg into a bowl.", "In a separate bowl, mix the apples with the sugar and butter.", "Add the eggs and reduced cider to the apple mixture and stir well.", "Add the spiced flour mixture to the apple mixture and mix well.", "Add the sultanas and pecans and fold together to combine.", "Spoon the cake mixture into a 20cm/8in spring-form cake tin and bake in the oven for 45-60 minutes, or until a skewer comes out clean when pushed into the centre of the cake. Turn out the cake onto a wire rack and leave to cool.", "For the mascarpone cream, whisk together the mascarpone, cream and cinnamon in a bowl.", "To serve, place slices of cake onto plates and spoon the mascarpone cream alongside."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_applecharlotte_81084", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecharlotte_81084_16x9.jpg", "ingredients": ["175g/6oz butter", "120g/4½oz caster sugar", "1kg/2¼lb cooking apples, peeled, cored and chopped", "4 tbsp smooth apricot jam", "12 slices white bread, crusts removed and discarded", "custard, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a large pan, melt 25g/1oz of the butter. Add the sugar and apples, then put the lid on and cook over a gentle heat for about 10 minutes, stirring occasionally.", "Remove the lid and cook for a further 5-10 minutes until the apples are broken down, but still with a few chunks for texture. Add the apricot jam and allow to cool.", "Meanwhile, melt the remaining butter in a saucepan. Cut the slices of bread in half, and then in half again into strips. Dip each piece of bread into the melted butter and line a large mould (use a round cutter for the bottom of the mould - you can use individual moulds or one large one).", "Once the mould is fully lined, spoon in the apple purée and top with another round of bread that has been dipped in melted butter. Place in the oven for 30 minutes, or until golden brown on top.", "Remove from the oven and allow to cool slightly. Carefully turn out and serve immediately with custard."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_applecharlotte_88965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼ lb cooking apples, peeled, cored and sliced", "1 lemon, zest and juice only", "2-3 tbsp light brown soft sugar", "½ tsp ground cinnamon", "8-10 slices good quality brown bread, crusts removed", "50g/2oz butter, melted, plus extra for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the apples, lemon zest and juice, sugar and cinnamon into a heavy-based saucepan over a medium heat. Cover and bring to a simmer. Simmer, stirring  frequently, until the apples break down and become soft. ", "Remove the lid, increase the heat to high and beat the apples vigorously until all the liquid has evaporated and the apples have formed a smooth purée.", "Brush the slices of bread on both sides with the melted butter.", "Lightly butter a 15cm/6in-diameter round cake tin and line the base and sides with three-quarters of the bread, overlapping the slices so that there are  no gaps and making sure the bread comes slightly higher than the rim of the tin.", "Spoon the apple purée into the tin and cover with the remaining slices of bread, overlapping the slices so that there are no gaps. Fold down the  bread lining the sides of the tin and press down onto the bread lid to seal.", "Transfer to the oven and bake for 30 minutes or until golden-brown. Remove from the oven and leave to cool slightly. Serve."]}, {"isVegetarian": true, "title": "Apple charlottes with thyme custard", "url": "www_bbc_co_uk_food_recipes_applecharlottes_84742", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz Cox apples, peeled, cored, roughly chopped", "60g/2½oz caster sugar", "½ lemon, juice only", "2 tbsp apricot jam", "3 tbsp water", "75g/3oz butter", "10 slices white bread, crusts removed", "200ml/7fl oz double cream", "200ml/7fl oz milk", "2 sprigs fresh thyme", "6 free-range egg yolks", "75g/3oz caster sugar", "double cream, lightly whipped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Place the apples, sugar, lemon juice, apricot jam and water into a saucepan along with 25g/1oz of the butter. Bring to the boil, then reduce the heat to simmer, until the apple is tender and lightly caramelised.", "Meanwhile, melt the remaining 50g/2oz butter in a saucepan over a medium heat.", "Cut the slices of bread in half, then cut each half into four slices to make small fingers. Dip each finger of bread into the melted butter and place into four ovenproof ramekins to line the inside edge and base, reserving a few bread fingers for the lid.", "Once each ramekin is lined, spoon in the apple mixture and top with more bread fingers dipped in the melted butter. ", "Place the ramekins onto a baking sheet and transfer to the oven to bake for 25-30 minutes, or until golden-brown on top.", "Meanwhile, for the custard, place the cream, milk and thyme into a saucepan over a low heat and bring to scalding point, then simmer very gently for 5-6 minutes to infuse the flavours.", "Place the egg yolks and sugar into a clean bowl and whisk together.", "Pour the thyme-infused milk and cream mixture onto the eggs and stir vigorously, then return to the saucepan and place over a gentle heat to simmer, stirring continuously, until the custard has thickened. Strain into a clean bowl to remove the thyme.", "Remove the charlottes from the oven and allow to cool slightly, then carefully turn them out onto plates.", "To serve, top the charlottes with whipped cream and place a spoonful of custard around the plate."]}, {"isVegetarian": true, "title": "Apple crêpes with calvados", "url": "www_bbc_co_uk_food_recipes_applecrepeswithcalva_66224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz plain flour", "25g/1oz buckwheat flour", "1 level tsp ground cinnamon", "2 eggs", "1x200ml tub crème fraîche", "1 large Granny Smith apple", "2 tbsp calvados", "50g/2oz melted butter", "caster sugar", "2 tbsp calvados", "double cream, well chilled"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Begin by peeling and coring the apple then cut it into quarters and grate it on the coarse side of the grater into a bowl. Then toss the grated apple around in 2 tbsp calvados and leave it aside for 10 minutes. ", "Meanwhile, sift the flour, buckwheat flour and cinnamon into a bowl. Then in a separate bowl or jug, whisk the eggs and crème fraîche together, then gradually whisk this into the flour mixture using an electric hand whisk until you have a smooth, lump-free batter. Then stir in the apple and calvados.", "Before you make the pancakes put a large plate in a warm oven or a warming-drawer so that as you make them they can be kept warm, covered with some foil.", "To make the pancakes, melt the butter in the frying pan, then tip it into a cup. To make your first pancake, heat the pan over a medium heat until it is really hot then use 1 tbsp of the batter to make each pancake, cook until it becomes crisp at the edges and is a lovely golden colour underneath, then, using a palette knife or spatula, turn the crêpe over and cook the other side until crisp and golden (this should take about 45 seconds on each side.)", "Remove the crêpe to a warm plate. Use a wodge of kitchen paper to lubricate the pan again with melted butter, then continue cooking the pancakes until the batter is all used up. When you are ready to serve the pancakes, transfer them to warmed serving plates, giving each person three or four, lightly dusted with caster sugar. Then combine the cream and calvados, put a little on each serving and hand the rest round separately. For a special occasion you could flame these by leaving them piled on a large plate, dusting with caster sugar, then warming 3 tbsp of calvados in a small pan - light it with a match and pour the flaming calvados over the pancakes. When the flame has died down serve each person three or four pancakes with pouring cream, served separately."]}, {"isVegetarian": true, "title": "Apple cider cake with mascarpone", "url": "www_bbc_co_uk_food_recipes_applecidercakewithma_84141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["330ml/11½fl oz good-quality cider", "300g/10½ oz plain flour", "2 tsp baking soda", "1 tsp mixed spice", "1 tsp cinnamon", "pinch grated nutmeg", "150g/5oz soft dark brown sugar", "150g/5oz melted butter", "4 apples (Cox or Russet), peeled and grated", "2 free-range eggs", "200g/7oz golden sultanas", "100g/3½oz chopped pecans", "250g/9oz mascarpone", "splash cream ", "1 tsp ground cinnamon"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "In a saucepan, boil the cider until it has reduced in volume by two-thirds. Leave to cool.", "Sift the flour, baking soda, mixed spice, cinnamon and nutmeg into a mixing bowl.", "In a separate bowl, cream together the sugar and butter and add the grated apple. Stir in the egg and reduced cider and mix well.", "Pour the wet mixture into the dry ingredients and fold in the sultanas and pecans.", "Spoon into a greased 20cm/8in spring-form cake tin and bake for 45-60 minutes until springy to the touch and a skewer inserted into the cake comes out clean. Cool before carefully turning out onto a plate.", "For the mascarpone cream, whisk together the mascarpone, the cream and the ground cinnamon. ", "Serve a slice of the cake with a spoonful of the cinnamon cream."]}, {"isVegetarian": true, "title": "Nigel Slater's apple crumble", "url": "www_bbc_co_uk_food_recipes_applecrumble_89166", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecrumble_89166_16x9.jpg", "ingredients": ["1kg/2lb 3½oz Bramley apples", "pinch sugar, to taste", "1 tbsp water or apple juice", "100g/3½oz plain flour", "75g/2½oz butter", "50g/2oz rolled oats", "100g/3½oz demerara sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Wipe the apples and cut them into quarters, then remove the cores and slice each piece in two. Put them into a pan, taste a slice for sweetness and add a sprinkling of sugar accordingly. Add a tablespoon of water or apple juice and cook over a medium heat for about five minutes, until the apples start to soften.", "Transfer the apple mixture to a shallow ovenproof pie dish.", "Blend the flour and butter in a food processor for a few seconds, until the mixture looks like breadcrumbs.", "Stir in the oats and the brown sugar and sprinkle over the cooked apples in the pie dish. Transfer to the oven to bake for 30 minutes or until crisp and golden-brown on top."]}, {"isVegetarian": true, "title": "Apple crumble", "url": "www_bbc_co_uk_food_recipes_applecrumble_2971", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecrumble_2971_16x9.jpg", "ingredients": ["300g/10½oz plain flour, sieved pinch of salt ", "175g/6oz unrefined brown sugar ", "200g/7oz unsalted butter, cubed at room temperature ", "Knob of butter for greasing ", "450g/1lb apples, peeled, cored and cut into 1cm/½in pieces ", "50g/2oz unrefined brown sugar ", "1 tbsp plain flour ", "1 pinch of ground cinnamon"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the flour and sugar in a large bowl and mix well. Taking a few cubes of butter at a time rub into the flour mixture. Keep rubbing until the mixture resembles breadcrumbs. ", "Place the fruit in a large bowl and sprinkle over the sugar, flour and cinnamon. Stir well being careful not to break up the fruit. ", "Butter a 24cm/9in ovenproof dish. Spoon the fruit mixture into the bottom, then sprinkle the crumble mixture on top. ", "Bake in the oven for 40-45 minutes until the crumble is browned and the fruit mixture bubbling. ", "Serve with thick cream or custard."]}, {"isVegetarian": true, "title": "Apple, date and ginger chutney", "url": "www_bbc_co_uk_food_recipes_appledateandgingerch_67595", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb Bramley apples", "2 garlic cloves, very finely sliced", "250ml/8fl oz cider vinegar ", "750g/1½lb granulated sugar", "250g/9oz stoned dates, finely chopped", "100g/4oz sultanas", "50g/2oz fresh ginger, peeled and grated ", "½ tsp salt", "½ tsp ground allspice ", "pinch of cayenne pepper"], "serves": "Makes 1.5 litres/2½ pint", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Peel, core and thinly slice the apples. Place in a large pan with the garlic and vinegar. Cook gently until the apples have broken down into a thick purée. Stir in the sugar, dates, sultanas, ginger, salt and spices. Cook for 20-25 minutes, stirring occasionally. ", "Spoon into hot, sterilised, glass preserving jars with clip tops. To enjoy the chutney at its best, store in a cool, dark, dry place for about 2-3 weeks before eating. This allows time for the flavours to mature. Once a jar has been opened, store in the fridge and eat within 1 month."]}, {"isVegetarian": true, "title": "Apple fritters with crème anglaise", "url": "www_bbc_co_uk_food_recipes_applefritterswithcre_84896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz hot vegetable oil ", "2 free-range eggs, beaten", "150g/5½oz self-raising flour", "water, to mix", "2 tbsp chopped fresh mint ", "1 apple, cut into segments", "3 free-range egg yolks", "4 tbsp caster sugar", "1 vanilla pod, split in half, seeds scraped out", "1 tbsp cornflour ", "½ pint whole milk", "cinnamon, for dusting", "icing sugar, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple fritters, heat the vegetable oil in a deep heavy-bottomed saucepan, until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.)", "Place the eggs, flour and water into a bowl and mix together to create a smooth batter. Add the chopped mint and stir well.", "Dip the apple into the batter mixture and carefully add to the hot oil. Deep-fry the fritters until golden and crisp, then carefully remove with a slotted spoon and drain on kitchen paper.", "For the crème anglaise, place the egg yolks and sugar into a bowl and beat together until light. Add the cornflour and vanilla seeds and mix well.", "Place the milk into a saucepan and heat to scalding point - do not boil.", "Add the warmed milk to the egg mixture, then return the milk mixture to the saucepan and place back onto the heat. Simmer the mixture for three minutes, stirring constantly, until it coats the back of a spoon.", "To serve, place the crème anglaise into a bowl with the apple fritters placed on top. Dust with cinnamon and icing sugar."]}, {"isVegetarian": true, "title": "Apple onion salad with blue cheese dressing", "url": "www_bbc_co_uk_food_recipes_appleonionsaladwithb_78290", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oi", "l½ red onion, diced", "1 apple, cored and sliced", "25g/1oz Dolcelatte cheese", "3 tbsp white wine vinegar", "1 tbsp wholegrain mustard", "50ml olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan, add the onion and cook for 3-4 minutes over a low heat until softened. Transfer to a bowl with the apple.", "In a separate bowl, mix the blue cheese with the vinegar and the wholegrain mustard. ", "Gradually add the oil, whisking constantly. Pour the mix onto the apple and red onion and serve."]}, {"isVegetarian": true, "title": "Apple parcels with crème anglaise", "url": "www_bbc_co_uk_food_recipes_appleparcelswithcrem_76458", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter", "1 apple, sliced", "5 dates, chopped", "2 tbsp maple syrup", "1 sheet ready-made filo pastry", "1 free-range egg, beaten", "icing sugar, to dust", "30g/1oz caster sugar", "4 free-range egg yolks", "150ml/5fl oz milk", "150ml/5fl oz double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Gently melt the butter in a pan and sauté the apple with the dates and maple syrup for a few minutes.", "Lay the ready-made filo pastry sheet flat on a clean surface. Place the mixture on top and fold over to make a triangle. Seal the edges with the beaten egg and dust generously with icing sugar. ", "Place on a non-stick baking tray and bake in the oven for 5-6 minutes, or until golden.", "To make the crème anglaise, whisk the sugar and egg yolks in a bowl until pale and fluffy.", "Gently heat the milk and cream in a pan until nearly boiling. Pour the hot milk mixture onto the egg mixture, and keep whisking constantly to avoid curdling. Return to the pan and stir until thickened.", "Remove the apple parcel from the oven and transfer to a serving plate. ", "Drizzle the crème anglaise over to serve."]}, {"isVegetarian": true, "title": "Apple pie", "url": "www_bbc_co_uk_food_recipes_applepie_89624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["425g/15oz plain flour, plus extra for dusting", "½ tsp salt", "100g/3½oz caster sugar", "250g/9oz unsalted butter, plus extra for greasing", "1 free-range egg, beaten", "2 free-range egg yolks", "100g/3½oz sultanas", "½ orange, juice only", "1 tbsp semolina flour", "8 large cooking apples, peeled, core removed, flesh finely sliced", "100g/3½oz golden caster sugar, plus extra for dusting", "1 tbsp ground cinnamon", "1 free-range egg, beaten", "clotted cream, to serve"], "serves": "4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, blend the flour, salt, sugar and butter in a food processor until the mixture resembles breadcrumbs. Gradually add the beaten egg and the egg yolks and blend until smooth and well combined. Bring the dough mixture together with your hands, wrap it in cling film and transfer to the fridge to chill for 30-45 minutes.", "Meanwhile, grease a high-sided 20cm/8in spring form cake tin with butter. Add a small amount of flour and turn the tin to coat the sides and bottom, shaking out any excess. Preheat the oven to 180C/350F/Gas 4.", "Roll out two thirds of the chilled pastry onto a clean, floured work surface, until it is almost twice as wide as the diameter of the cake tin. Using the rolling pin, lift the pastry and lay it over the cake tin to line the base and sides. Gently press the pastry into the corners of the tin, trimming off any excess pastry, then prick the base of the pastry case several times with a fork.", "Cover the pastry with a sheet of greaseproof paper and fill it with rice or dried beans. Bake in the oven for 12-15 minutes, or until the pastry is pale golden-brown. Remove from the oven, discard the beans and greaseproof paper and leave the pastry to cool. Reduce the oven temperature to 170C/325F/Gas 3.", "For the filling, place the sultanas and the orange juice into a bowl and leave for 30-40 minutes, or until the sultanas are plump.", "Sprinkle the semolina flour over the base of the cooled pastry case. Arrange half of the apple slices in a single layer on the base of the pastry case. Scatter the apple layer with the soaked sultanas, then sprinkle over half of the caster sugar and half of the cinnamon. Repeat the process with the remaining apple slices, sugar and cinnamon. ", "For the pastry lid, roll out the remaining one third of pastry onto a clean, floured work surface, until it is large enough to cover the cake tin. Brush the rim of the pastry case with some of the beaten egg and place the pastry lid on top of the pie. Trim off any excess pastry. Seal the pastry lid to the pastry case by crimping the edges of the pastry lid with a fork.", "With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry lid with the remaining beaten egg, then transfer to the oven and bake for 35-40 mins, or until golden-brown.", "To serve, place a slice of the apple pie onto a serving plate and spoon a portion of clotted cream alongside."]}, {"isVegetarian": true, "title": "Apple, pear and apricot chutney", "url": "www_bbc_co_uk_food_recipes_applepearandapricotc_13703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2.2lb bramley apples, peeled, cored and diced", "1kg/2.2lb conference pears, peeled, cored and diced", "2 large onions,  finely chopped ", "2 cloves garlic, crushed", "2 limes, grated zest and juice", "1 tbsp mustard seeds", "1 litre/1¾ pint white wine vinegar", "225g/8oz each raisins and chopped dried apricots", "7.5cm/3in piece root ginger, peeled and grated", "2 tsp ground ginger", "1 tbsp sea salt", "1kg/2lb2oz dark muscovado sugar", "Warm sterilised jam jars and jam pot covers - prepare jars by washing in hot soapy water and leaving to dry and warm in a cool oven - 130C/250F/Gas ½ for 10-15 minutes."], "serves": "Makes 3-4 x 450g/1 lb jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the apples, pears, onions, garlic, lime zest and juice, mustard seeds and half the vinegar into a large saucepan, bring to the boil and simmer until the fruit is nearly cooked.", "Add the remaining vinegar along with the rest of the ingredients, bring to the boil and simmer for 20-25 minutes or until thick and pulpy.", "Leave the chutney to cool for 15-20 minutes then pack into the jam jars, cover with a wax disc and a screw top lid. Store in a cool dark place for 3-4 weeks before enjoying."]}, {"isVegetarian": false, "title": "Apple, pork and cheddar burger with chips", "url": "www_bbc_co_uk_food_recipes_appleporkandcheddarb_86803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5½oz potato (about 1 large potato), peeled and cut lengthways into thin chips", "2 sausages, skins removed", "30g/1oz cheddar, crumbled ", "½ onion, finely chopped", "1 tbsp wholegrain mustard", "3 sage leaves, finely chopped", "¼ apple, grated ", "¼ tsp Worcestershire sauce", "1 tbsp olive oil", "30g/1oz cheddar, sliced ", "small bunch chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chips, heat the oil in a non-stick frying pan and fry the chips for 15 minutes or until golden and cooked through.", "For the burger, combine the sausage meat, crumbled cheddar, onion, mustard, sage leaves, apple and Worcestershire sauce and mix well. Shape into a patty.", "Heat the oil in a non-stick frying pan and fry for 4-5 minutes on each side or until cooked through.", "To serve, top the burger with the sliced cheddar. Serve on a plate with the chips and garnish with the chives."]}, {"isVegetarian": true, "title": "Apple, raisin and coconut porridge with spiced sugar", "url": "www_bbc_co_uk_food_recipes_appleraisinandcoconu_88089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ Bramley apple, peeled and chopped ", "2 tsp caster sugar", "30g/1oz raisins", "70g/2½oz porridge oats", "200ml/7fl oz coconut milk", "1 tbsp caster sugar", "1 tbsp soft brown sugar", "½ tsp mixed spice", "½ tsp ground cinnamon"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the porridge, melt the butter in a saucepan, add the apple and fry gently for three minutes. Add the caster sugar and cook for one minute.", "Add the raisins, oats and coconut milk and simmer for five minutes, stirring continuously. Add more coconut milk if the porridge is too thick. Spoon into a bowl.", "For the spiced sugar, mix together the caster sugar, soft brown sugar, mixed spice and ground cinnamon until combined.", "To serve, sprinkle the spiced sugar over the porridge."]}, {"isVegetarian": true, "title": "Apple snow", "url": "www_bbc_co_uk_food_recipes_applesnow_66346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 apples, thinly sliced", "1 tsp cinnamon", "sugar to taste", "120ml/4fl oz double cream", "3 egg whites"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the apples, cinnamon and a pinch of sugar into a pan and cook until the apples soften, then pass through a sieve and allow to cool.", "Whip the cream into soft peaks and whisk the egg whites along with a little sugar until it forms stiff peaks.  Fold in the cream and egg whites to the apple mixture and serve in a bowl."]}, {"isVegetarian": true, "title": "Apple sauce", "url": "www_bbc_co_uk_food_recipes_applesauce_1310", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applesauce_1310_16x9.jpg", "ingredients": ["225g/8oz cooking apples, peeled, cored and chopped", "½ lemon, zest only", "2 tbsp water", "15g/½oz butter", "1 tsp caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the apples in a saucepan with the lemon zest and water. Cover and cook over a low heat until they are soft and mushy.", "Take off the heat and beat in the butter and the sugar. Cool."]}, {"isVegetarian": true, "title": "Apple sorbet", "url": "www_bbc_co_uk_food_recipes_applesorbet_14293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint freshly pressed apple juice", "a little icing sugar", "lemon juice ", "calvados or apple brandy"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Whisk a little icing sugar and lemon juice into your apple juice to get the right balance of sweetness and acid, remembering that when frozen the power of both sweetness and acidity are diminished.", "Then either churn in an ice cream maker or pour into plastic dishes to a depth of no more than 2cm/¾in. If you're using plastic dishes, then remove them from the freezer when the mixture is just frozen (but not rock hard) and scratch up into a soft sorbet using a fork - if you've never tried this method you'll soon get the hang of it.", "Either serve straightaway or pack into tubs and freeze. Defrost for 30-60 minutes at room temperature before serving.", "Serve with a  couple of tsps of calvados over the sorbet."]}, {"isVegetarian": true, "title": "Apple compôte", "url": "www_bbc_co_uk_food_recipes_applecompote_11371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "750g/1lb 10oz Granny Smith apples, peeled, cored and chopped", "100g/3½oz caster sugar", "1 vanilla pod split"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butter in a stainless steel saucepan and start to melt. ", "Add the apples, sugar and vanilla pod. ", "Cook out the apple to a compote, stirring from time to time for approximately 30 minutes on a moderate heat. ", "If the texture is too runny then leave to reduce until you have a  thick texture.", "Remove the vanilla pod, and reserve for use later.", "Place the apple compote into a blender, blend to a fine pulp and pass through a fine sieve.  Serve."]}, {"isVegetarian": true, "title": "Apple charlotte with caramel sauce", "url": "www_bbc_co_uk_food_recipes_applecharlottewithca_89888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "225g/8oz Bramley apples (or similar cooking apples), peeled, sliced", "225g/8oz Cox's, Pippins or any other English eating apple, peeled, sliced", "30g/1oz caster sugar", "1 vanilla pod, split, seeds scraped out", "1 free-range egg yolk", "75g/2¾ oz melted butter for the bread", "8 slices white bread, crusts removed", "100g/3½oz butter", "100g/3½oz soft dark brown sugar", "100ml/3½fl oz double cream", "clotted cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a large pan over a medium heat. Add all of the apples, the sugar and vanilla seeds. Cook until the apples become soft enough to break down into a purée. Remove from the heat and allow to cool.", "Once the apple mixture is cool, add the egg yolk and mix well to combine.", "Butter the bread slices and line a 600ml/1 pint pudding basin with some of the bread slices, overlapping the slices to ensure there are no gaps.", "Spoon in the apple mixture and cover the top with the remaining bread.", "Place a plate on top of the pudding and weigh it down with a can of beans (or similar weight) for one hour.", "Remove the plate and cover the pudding with kitchen foil. Bake in the oven for 30 minutes.", "Remove the foil and bake for ten more minutes, or until the top is light golden-brown.", "For the sauce, place the butter, sugar and cream into a separate pan over a medium heat. Bring to the boil and cook for 5-6 minutes, until combined as a smooth sauce.", "To serve, cut out a wedge of apple Charlotte and place onto each plate. Add a generous spoonful of the sauce and a spoonful of clotted cream alongside."]}, {"isVegetarian": true, "title": "Apple strudel", "url": "www_bbc_co_uk_food_recipes_applestrudel_85975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["680g/1½lbs eating apples, peeled, cored and chopped", "½ orange, juice and zest only", "100g/3½oz caster sugar", "freshly grated nutmeg, to taste", "55g/2oz sultanas", "6-8 sheets ready-made filo pastry", "55g/2oz butter, melted and cooled, plus extra for greasing", "2 tbsp dried breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the apple, orange juice and zest, sugar, nutmeg and sultanas into a large bowl and mix well.", "Brush each sheet of filo pastry with melted butter, then place the sheets of pastry on top of each other onto a large sheet of greaseproof paper.", "Sprinkle the top sheet of filo with some dried breadcrumbs, then spoon the apple mixture down the middle of the filo sheet.", "Carefully roll the pastry up around the filling like a cigar, using the greaseproof paper to help.", "Place the filo roll onto a greased baking tray, brush with any remaining melted butter and cook for 30-40 minutes, until lightly browned and the filling is hot."]}, {"isVegetarian": true, "title": "Apple tart with blackberry sorbet", "url": "www_bbc_co_uk_food_recipes_appletartwithblackbe_89565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz caster sugar", "300ml/10½fl oz water ", "half lemon, juice only", "4 tsp liquid glucose", "400g/14oz blackberries", "75g/2½oz caster sugar", "1 tbsp water", "400g/14oz ready-rolled puff pastry", "250g/9oz apples, peeled and sliced into wedges", "125g/4oz demerera sugar", "fresh mint leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sorbet, place the sugar, water, lemon juice and liquid glucose into a pan over a low heat.", "Stir the mixture and slowly bring to the boil. Boil the mixture for five minutes, then remove from the heat and allow to cool. Place into the fridge to chill.", "Meanwhile, for the blackberries, place the blackberries, sugar and water into a clean pan over a low heat. Cook gently to soften the fruit.", "Pass the blackberry mixture through a sieve into a bowl.", "Add the blackberry mixture to the chilled syrup and churn in an ice cream maker according to manufacturer's instructions.", "Transfer to a freezer-proof container and freeze until needed.", "For the tart, preheat the oven to 180C/365F/Gas 4.", "Cut out the pastry into four equal squares of approx 15cm/6in and place onto a baking tray.", "Lay the apples in straight lines across each piece of pastry, overlapping each other, to cover each piece of pastry.", "Sprinkle with sugar, then place into the oven to bake for 12-15 minutes, or until golden-brown and cooked through. ", "To serve, transfer each apple tart to a plate while still warm and place a scoop of blackberry sorbet on top. Garnish with a mint sprig."]}, {"isVegetarian": false, "title": "Apple tart 'Maman Blanc'", "url": "www_bbc_co_uk_food_recipes_appletartmamanblanc_93268", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appletartmamanblanc_93268_16x9.jpg", "ingredients": ["250g/9oz plain flour", "pinch sea salt", "125g/4oz unsalted butter, diced, at room temperature", "1 tsp cold water", "1 medium free-range egg", "15g/½oz unsalted butter ", "½ tbsp lemon juice", "65g/2½oz caster sugar", "½ tbsp calvados", "3-4 Cox's Orange Pippin, Worcester, Russet or Braeburn apples, peeled, cores removed, each cut into 10 segments", "100ml/3½fl oz double cream", "1 medium free-range egg", "1-2 tbsp icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, pulse together the flour, butter and salt in a food processor until you reach a sandy texture. Add the egg, water and pulse again. If you over mix the dough at this stage it will lose its flakiness.", "Transfer the dough onto a lightly floured work surface and knead with the palms of your hands for 30 seconds, or until the dough is smooth and well combined. ", "With the palm of your hand flatten the dough slightly to 1cm/½in thickness, then sandwich it between two large sheets of cling film. Chill in the fridge for 30 minutes.", "Preheat the oven to 220C/440F/Gas 7. Place a baking tray into the oven to preheat.", "Roll the chilled dough, still sandwiched in cling film, to a 2mm thickness. Place a 22cm/9in diameter, 2cm/¾in deep tart ring on a greaseproof lined wooden peel or baking tray. Remove the top layer of clingfilm and carefully pick up the dough, place it into the tart ring with the second layer of clingfilm facing up. Lift and tuck the dough into the edges of the ring and discard the clingfilm. By tucking in the base you will minimise the shrinking of the dough during cooking. Trim off any excess with a rolling pin. ", "Using your index finger and thumb, pinch and press the dough until it's 2mm above the tart ring all around the edge. With a fork, prick the bottom of the tart. Chill in the fridge for 20 minutes.", "Meanwhile, for the filling, heat the butter, lemon juice and 15g/1oz of the sugar in a small saucepan until the butter has melted and the sugar has dissolved. Remove from the heat and stir in the Calvados. Set aside.", "When the tart case has chilled, arrange the apple segments in concentric circles, overlapping the apple slices as you go. Brush the apples all over with the Calvados mixture. Slide the tart ring onto the pre-heated baking tray and bake for 10 minutes.", "Reduce the oven temperature to 200C/400F/Gas 6, then continue to cook for a further 20 minutes, until the pastry is pale golden-brown and the apples have caramelised. ", "Whisk together the double cream, egg and the remaining 50g/2oz caster sugar until well combined. When the pastry is pale golden-brown and the apples have caramelised, sprinkle the tart with a tablespoon of sugar and pour the custard mixture into the tart, bake for a further 10 minutes, until the filling mixture has just set.", "To serve, remove the tart from the oven and set aside for 1 hour to cool slightly, then carefully remove the tart ring. Dust all over with icing sugar. Serve immediately."]}, {"isVegetarian": true, "title": "Apple tart with honey cream and butterscotch sauce", "url": "www_bbc_co_uk_food_recipes_appletartwithhoneyed_84107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter", "sprig fresh rosemary", "1 tbsp caster sugar", "1 apple peeled, cored and finely sliced", "ready-made puff pastry, cut into a 20cm/8in circle ", "honey, to drizzle", "30g/1oz caster sugar", "30g/1oz butter", "110ml/4fl oz double cream", "sprig fresh mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat the butter, sugar and rosemary in a saucepan until the sugar has melted and it is a golden brown colour. Add the apple slices, stir well and cook for five minutes, or until the apple is softened.", "Remove the apple mixture from the heat and mash to a purée.", "Line a baking sheet with parchment paper and lay out the puff pastry. Spread the pastry with the mashed apple mixture. Drizzle with honey and place in the oven to bake for 8-10 minutes, or until risen and golden.", "For the sauce, melt the sugar and butter together in a clean saucepan. Once melted, turn up the heat and add the cream. Bring to the boil and cook until thickened.", "To serve, pour the sauce over the tart and garnish with a mint sprig."]}, {"isVegetarian": true, "title": "Apricot almond cake with rosewater and cardamom", "url": "www_bbc_co_uk_food_recipes_apricot_almond_cake_with_90181", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_almond_cake_with_90181_16x9.jpg", "ingredients": ["150g/5½oz ready-to-eat dried apricots", "2 cardamom pods, cracked", "200g/7oz ground almonds", "50g/1¾oz fine polenta (not instant)", "1 tsp baking powder (gluten-free if required)", "150g/5½oz caster sugar", "6 large free-range eggs", "2 tsp lemon juice", "1 tsp rosewater", "non-stick cooking spray or sunflower oil for greasing", "2 tsp rose petal or apricot jam", "1 tsp lemon juice", "2½ tsp very finely chopped pistachios"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the dried apricots into a small saucepan, cover them with 250ml/9fl oz cold water, and drop in the cracked cardamom pods with their fragrant seeds. Put on the heat, then bring to the boil and let it bubble for 10 minutes – don’t stray too far away from the pan, as by the end of the 10 minutes the pan will be just about out of water and you want to make sure it doesn’t actually run dry as the apricots will absorb more water as they cool. Take the pan off the heat, place on a cold, heatproof surface and let the apricots cool.", "Preheat the oven to 180C/160C Fan/Gas 4. Grease the sides of the springform cake tin and line the bottom with baking parchment.", "Remove 5 of the dried apricots and tear each in half, then set aside. Discard the cardamom husks, leaving the seeds in the pan. ", "Pour and scrape out the sticky contents of the pan into the bowl of a food processor. Add the ground almonds, polenta, baking powder, caster sugar and eggs, and give a good long blitz to combine.", "Open the top of the processor, scrape down the batter, add 2 teaspoons of lemon juice and the rosewater, and blitz again. Scrape into the prepared tin and smooth with a spatula. Arrange the apricot halves around the circumference of the tin.", "Bake for 40 minutes, though if the cake is browning up a lot before it’s actually ready, you may want to cover loosely with foil at the 30-minute mark. When it’s ready, the cake will be coming away from the edges of the tin, the top will feel firm, and a cake tester will come out with just one or two damp crumbs on it.", "Remove the cake to a wire rack. If you’re using apricot jam to decorate, you may want to warm it a little first so that it’s easier to spread; rose petal jam is so lusciously soft-set, it shouldn’t need any help. Stir a teaspoon of lemon juice into the jam and brush over the top of the cake, then sprinkle with the chopped pistachios and leave the cake to cool in its tin before removing to a plate."]}, {"isVegetarian": true, "title": "Apricot and chocolate flapjacks", "url": "www_bbc_co_uk_food_recipes_apricot_and_chocolate_17370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_and_chocolate_17370_16x9.jpg", "ingredients": ["200g/7oz unsalted butter, plus extra for greasing", "300g/10½oz golden syrup ", "450g/1lb jumbo rolled porridge oats ", "pinch of plain flour", "pinch salt", "200g/7oz dried, ready-to-eat apricots, roughly chopped ", "100g/3½oz plain chocolate, broken into pieces"], "serves": "Makes 9-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease a 20cm/8in square cake tin with butter, then line the base and sides with baking parchment.", "Slowly bring the butter and syrup to the boil in a saucepan, stirring. Remove from the heat and stir in the oats and salt, then the dried apricots, until well combined.", "Scrape the mixture into the prepared tin, then press it into an even layer using the back of a wooden spoon. Bake for 45-50 minutes, or until golden-brown. Set aside to cool slightly in the tin, then run a round-bladed knife around the inside edges of the tin and cut the flapjack into squares. Set them aside to cool completely in the tin.", "Meanwhile, suspend a heatproof glass bowl over a saucepan of gently simmering water, making sure that the base of the bowl does not touch the water. Add the chocolate and stir until melted. ", "Turn the cooled flapjacks out onto a wire rack and drizzle them with the melted chocolate. Set aside for a further 25-30 minutes, or until the chocolate has set. Enjoy! "]}, {"isVegetarian": false, "title": "Apricot couronne", "url": "www_bbc_co_uk_food_recipes_apricot_couronne_12975", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_couronne_12975_16x9.jpg", "ingredients": ["250g/9oz strong white bread flour, plus extra for dusting", "5g salt", "7g/⅓oz instant yeast", "50g/1¾oz unsalted butter, softened, plus extra for greasing", "105ml/3½fl oz milk", "1 free-range egg, lightly beaten", "90g/3¼oz unsalted butter, softened", "70g/2½oz light muscovado sugar", "120g/4½oz ready-to-eat dried apricots, chopped and soaked in orange juice", "35g/1¼oz plain flour", "60g/2¼oz raisins", "65g/2¼oz chopped walnuts", "1 orange, zest only", "50g/1¾oz apricot jam", "200g/7oz icing sugar", "25g/1oz flaked almonds"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the flour into a large mixing bowl and add the salt to one side of the bowl and the yeast to the other. Add the butter, milk and egg and mix to combine, using your hands. Continue to mix until you’ve picked up all the flour from the sides of the bowl. Use the dough to clean the inside of the bowl and keep going until you have a soft dough.", "Tip the dough onto a lightly floured work surface and begin to knead. Keep kneading for 10-12 minutes. Work through the initial wet stage until the dough starts to form a soft, smooth skin.", "When the dough feels smooth and silky, put it into a lightly oiled bowl. Cover the bowl with a tea towel and leave to rise for one hour, or until doubled in size.", "While the dough is rising, make the filling. Beat the butter and muscovado sugar together until smooth. Drain the apricots and add to the butter mixture along with the flour, raisins, walnuts and orange zest. Mix to combine.", "Line a baking tray with baking parchment or silicone paper. ", "Turn the risen dough onto a lightly floured surface. Taking care not to knock the air out of it, roll out the dough into a rectangle, approximately 33x25cm/13x10in. Turn the dough 90 degrees if necessary, so you have a long edge nearest you. Spread the apricot mixture evenly over the dough. Roll up the dough tightly (like a Swiss roll). Roll it slightly to seal, then cut it in half lengthways (you can leave one end joined to help you twist the dough and form the circular crown).", "Twist the two dough lengths together to make a rope, then join the ends of the rope to form a circular ‘crown’. Transfer to the baking tray.", "Put the tray inside a clean plastic bag and leave to prove for 30-45 minutes, or until the dough springs back quickly if you prod it lightly with your finger. Meanwhile, heat the oven to 200C/400F/Gas 6.", "Bake the couronne for 25-35 minutes, or until risen and golden-brown. Set aside to cool on a wire rack. ", "Gently heat the apricot jam with a splash of water, then sieve it and brush it over the warm loaf to glaze. Mix the icing sugar with enough water to make a thin icing, drizzle over the loaf and sprinkle with the flaked almonds. Leave to cool before serving."]}, {"isVegetarian": true, "title": "Apricot tarte tatin", "url": "www_bbc_co_uk_food_recipes_apricot_tarte_tatin_49907", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_tarte_tatin_49907_16x9.jpg", "ingredients": ["75g/2¾oz caster sugar", "40g/1½oz unsalted butter, cubed", "300g/10½oz fresh apricots, halved and stoned (about 7 or 8 apricots)", "375g/13oz sheet of ready-rolled puff pastry, plain flour for dusting", "crème fraiche or ice cream, for serving"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For caramelising the apricots, you need a small ovenproof frying pan with a base that measures about 20cm/8in in diameter. Put the sugar in the pan and set it over a medium heat. Cook until the sugar first melts and then caramelises and turns golden brown. Don’t stir the sugar but swirl it around the pan every now and then.", "Remove the caramel from the heat and stir in the butter with a wooden spoon. The caramel will be extremely hot so watch out for splashes and don’t dream of tasting it.", "Continue stirring for 2–3 minutes as the caramel cools and thickens. It will look oily and separated to begin with, but will become smooth and toffee-like as you continue stirring. When the caramel is smooth, carefully arrange the apricots on top, cut-side down. Leave to cool for 20 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "Unroll the puff pastry sheet on a lightly floured surface and use a rolling pin to roll it out until it is 2cm/1in wider. Place a dinner plate or 25cm/10in cake tin on the pastry and cut around it.", "Gently slide the pastry on top of the apricots and push down the sides with a round-bladed knife. Prick the surface to allow steam to escape.", "Bake the tarte tatin for 25 minutes until the pastry is golden-brown and the apricots are cooked. Remove the pan from the oven using an oven cloth to hold the handle of the pan – don’t forget - it will be very hot.", "Leave the tart to stand for a couple of minutes to allow it to settle, then loosen the edges and place a large serving plate or board on top of the frying pan. Very carefully, but quickly,  turn it over, using a folded dry tea towel to help you hold it, and allow the tarte tatin to drop gently on to the serving plate. ", "Serve warm with crème fraiche or ice cream."]}, {"isVegetarian": true, "title": "Apricot frangipane tart", "url": "www_bbc_co_uk_food_recipes_apricot_frangipane_tart_19845", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_frangipane_tart_19845_16x9.jpg", "ingredients": ["225g/8oz plain flour", "100g/3½oz butter, cubed", "50g/1¾oz caster sugar", "1 free-range egg", "175g/6oz butter", "175g/6oz caster sugar", "4 free-range eggs", "175g/6oz ground almonds", "1 tsp almond extract", "200g/7oz apricot jam", "8 ripe apricots, halved and stoned ", "4 tbsp apricot jam", "15g/½oz flaked almonds, toasted"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Heat a heavy, flat baking tray. ", "To make the pastry, either rub the flour and butter together using your fingertips until it resembles breadcrumbs or measure the flour and butter into a food processor and briefly process until just rubbed in. Add the sugar and mix, then add the egg and a tablespoon of water. Process until the mixture just holds together (do not over work as it will make the pastry tough). Wrap in cling film and chill for 20 minutes. ", "Roll the pastry out on a floured surface and use it to line a 28cm/11in flan tin. Prick the base of the pastry using a fork then chill the pastry for 10 minutes. ", "Line the pastry case with parchment paper and fill with ceramic baking beans or uncooked rice. Place on the preheated baking tray and bake blind for about 15 minutes, or until the pastry is set and pale brown. Remove the beans and paper and return to the oven for about 10-12 minutes until the base is cooked. ", "For the filling, put the butter and sugar in a food processor and pulse until creamy (if you used a food processor for the pastry, there’s no need to wash it up). Add the eggs and blend, then mix in the ground almonds and almond extract. ", "Spread a thin layer of apricot jam over the base of the pastry and spoon the almond mixture on top. Bake for 30-40 minutes, until the filling is set. Remove from the oven and leave to cool.", "For the decoration, gently poach the apricot halves in water until tender. Set aside to cool slightly.", "Arrange the apricot halves in circles over the top of the tart. Warm the apricot jam over a low heat then pass through a fine sieve. Brush the warm apricot jam over the top of the fruit to glaze. Scatter over the flaked almonds. Serve the tart warm or cold."]}, {"isVegetarian": true, "title": "Apricot, carrot and almond jam", "url": "www_bbc_co_uk_food_recipes_apricot_carrot_and_60812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_carrot_and_60812_16x9.jpg", "ingredients": ["100g/3½oz carrot, grated, peeled", "600g/1lb 5oz fresh apricots", "5cm/2in piece fresh ginger, peeled, grated", "400g/14oz granulated or caster sugar", "1 small lemon, juice only", "50g/2oz chopped almonds"], "serves": "Makes about 600ml/20fl oz (about 2 jam jars)", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the grated carrot into a lidded saucepan with about 300ml/½ pint water, bring to the boil and then cook until the carrot threads are falling apart and the water has mostly evaporated.", "Meanwhile, halve the apricots, remove the stones and place the flesh in the pan with the carrots. Cover with a lid and cook for five minutes, stirring occasionally, until the fruit starts to break down and fall apart.", "Add the ginger to the pan and cook with the lid off until most of the remaining moisture has evaporated.", "Add the sugar and lemon juice, bring to the boil and cook until the mixture reaches 105C/220F on a sugar thermometer. Stir the jam as it’s cooking, especially around the edges, as it sometimes catches and burns on the bottom.", "Stir in the almonds. ", "Leave the apricot jam for a few minutes to cool; then ladle into hot, clean jars and seal immediately."]}, {"isVegetarian": true, "title": "Apricot, chestnut and aduki balls with roasted vegetables and white wine miso gravy", "url": "www_bbc_co_uk_food_recipes_apricot_chestnut_and_76988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_chestnut_and_76988_16x9.jpg", "ingredients": ["18-20 Brussels sprouts, trimmed (any larger sprouts cut in half through the root)", "4 large carrots, peeled, trimmed, chopped", "2 red onions, chopped   ", "4 large parsnips, peeled, trimmed, chopped", "3-4 heaped tbsp coconut oil", "handul chopped fresh herbs, such as rosemary or thyme", "salt and freshly ground black pepper", "1 tbsp coconut oil, plus extra for basting", "2 tsp ground cumin", "1½ tsp ground turmeric", "1½ tsp ground cinnamon", "1 large onion, finely chopped", "3 garlic cloves, crushed                                                          ", "400g tin aduki beans, drained                                ", "50g/1¾oz chestnut flour", "60g/2¼oz dried, ready-to-eat apricots,preferably organic, roughly chopped  ", "handful chopped fresh flatleaf parsley  ", "¼ tsp cayenne pepper (or 1 tsp  chopped fresh chilli)", "1 tsp salt", "¼ tsp freshly ground black pepper", "2 small white onions, quartered", "250ml/9fl oz white wine                                                          ", "1 tbsp tamari                                                    ", "1 tbsp unpasteurised miso paste, to taste  ", "small handul chopped fresh mixed herbs (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking parchment.", "Mix the vegetables together with the coconut oil in an ovenproof dish. Season with salt and black pepper. Sprinkle over the herbs. Roast in the oven for 18-20 minutes", "Meanwhile, for the aduki balls, heat the coconut oil in a frying pan over a medium heat until melted. Add the cumin, turmeric and cinnamon and fry for 1-2 minutes, or until fragrant. ", "Add the onion and fry for 4-5 minutes, or until softened but not coloured, stirring well to coat it in the spices. Stir in the garlic and aduki beans and continue to fry for 2-3 minutes, squashing the beans with the back of a wooden spoon so that any excess moisture is released and evaporates.", "Turn off the heat, then gently fold in the remaining aduki ball ingredients until well combined. Season with salt and pepper.", "Roll 1½ tablespoonful portions of the mixture into balls and place the balls on the prepared baking tray. Melt coconut oil and baste the aduki balls all over with it. Bake for 12-15 minutes, turning halfway through cooking, until crisp on the outside and heated through. Remove from the oven and keep warm.", "Remove the roasted vegetables from the oven and stir. Continue to roast for a further 25-35 minutes, or until the vegetables are just tender.", "Meanwhile, for the miso gravy, put the onions in a small saucepan. Add the wine and 250ml/9fl oz of water and bring to the boil. Reduce the heat and simmer for 20-25 minutes, or until the onion has softened.", "Stir in the tamari, miso and all of the herbs. Blend until smooth using a hand-held blender. Add a dash more water if necessary to loosen the gravy. Season with salt and pepper, adding a little more miso or tamari if desired. ", "To serve, divide the aduki balls equally among 4 serving plates. Spoon some of the roasted vegetables alongside. Serve the miso gravy in a jug to pass around the table."]}, {"isVegetarian": true, "title": "Apricot and almond biscotti with limoncello", "url": "www_bbc_co_uk_food_recipes_apricotandalmondbisc_86401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700ml/1 pint 5fl oz fruit alcohol, 40-80 per cent proof, or vodka", "200g/7oz caster sugar", "8 unwaxed lemons, zest and juice", "250g/9oz plain flour", "250g/9oz caster sugar", "1½ tsp baking powder", "3 medium free-range eggs, lightly beaten", "50g/2oz dried sweetened strawberries, chopped ", "100g/3½oz dried apricots, chopped", "50g/2oz medjool dates, stones removed, chopped", "75g/2½oz pistachio nuts, shells removed", "50g/2oz whole blanched almonds", "50g/2oz hazelnuts, shells removed", "1 lemon, zest only"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the limoncello, pour a little of the alcohol into a pan, add the sugar and heat gently, stirring occasionally, until the sugar has dissolved.", "Remove from the heat and add the lemon juice and zest. Stir in the remaining alcohol and allow to cool. Pour into a clean bottle, then place into the fridge or freezer to chill thoroughly.", "For the biscotti, preheat the oven to 180C/350F/Gas 4. Line a baking sheet with baking parchment.", "Mix the flour, sugar and baking powder together in a large bowl. Add half the beaten eggs and mix well, then add half of what's left and mix again. Add the last quarter a little at a time until the dough takes shape but isn't too wet (you may not need to use all of the eggs). Add the fruit, nuts and lemon zest and mix well.", "Divide the dough into six pieces. With wet hands, roll each piece into a sausage shape about 5cm/2in wide and place well apart on the baking sheet. Lightly flatten the 'sausages' and bake for about 20 minutes, or until golden-brown. Remove from the oven and leave to cool and harden for ten minutes.", "With a serrated knife, cut the 'sausages' on an angle into 0.5cm/¼in slices and lay these on the baking sheet. Return to the oven and bake for eight minutes, then turn the slices over and cook for a further 10-15 minutes, or until they are a pale golden colour. Remove from the oven and cool on wire racks. When completely cold, the biscotti can be stored in airtight jars for a week or more.", "To serve, pour the limoncello into a chilled shot glass and serve with the biscotti."]}, {"isVegetarian": true, "title": "Apricot and brandy Christmas cake", "url": "www_bbc_co_uk_food_recipes_apricotandbrandychri_77766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricotandbrandychri_77766_16x9.jpg", "ingredients": ["300g/9oz dried apricots, chopped", "225g/8oz currants", "255g/8oz sultanas", "225g/8oz raisins", "90ml/3½fl oz brandy", "225g/8oz butter, at room temperature", "225g/8oz light muscovado sugar", "225g/8oz plain flour", "4 large free-range eggs", "350g/12oz glacé cherries, halved, rinsed and dried", "2 oranges, grated zest only", "4 tbsp apricot jam, for glazing"], "serves": "Makes 20cm/8in cake", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the chopped apricots and dried fruit except the cherries in the brandy in a bowl overnight - leave out in the kitchen and by the morning the fruit will have absorbed the brandy.", "Grease and line a 20cm/8in-deep round cake tin with a double layer of greased greaseproof paper or parchment paper. Pre-heat the oven to 140C/275F/Gas 1.", "Cream the butter and sugar together in a very large mixing bowl, add the remaining ingredients, including the dried fruit mixture, and continue to mix until well blended.", "Spoon the mixture into the prepared tin and spread out evenly with the back of a spoon. Cover the top of the cake loosely with a double layer of greaseproof paper. ", "Bake in the preheated oven for about 3½ hours or until the cake is a pale golden colour, feels firm to the touch and a skewer inserted into the centre comes out clean. Keep an eye on the cake and if it is getting too brown, cover it loosely with foil. Allow the cake to cool in the tin, then turn it out.", "The day before serving, heat the jam in a pan until melted and strain through a sieve. Brush the cake all over with the sieved apricot jam for a shiny finish. "]}, {"isVegetarian": true, "title": "Apricot brioche tart", "url": "www_bbc_co_uk_food_recipes_apricotbriochetart_70816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 egg", "2 tbsp caster sugar", "250g/9oz tub mascarpone cheese", "225g/8oz brioche slices, 1cm/½in thick, taken from a shop-bought brioche loaf", "2 400g/14oz cans apricot halves, drained", "4 tbsp demerara sugar", "créme fraïche to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly grease a shallow ovenproof, sided dish (about 28cm/11in diameter). Pre-heat the oven to 180C/350F/Gas 4.", "Lightly whisk the egg and caster sugar together in a bowl.", "Add the mascarpone and whisk again until smooth and there are no lumps.", "Arrange the brioche slices as neatly as possible in a single layer on the greased tart plate to completely cover the plate. ", "Trim the brioche slices as necessary to fit. Spread the mascarpone mixture over the brioche slices to about 1cm/½in away from the edge. You don't have to be accurate about this!", "Arrange the apricot halves neatly in a spiral over the mascarpone right to the edge of the brioche. Sprinkle the demerara sugar over the apricots. ", "Bake in the pre-heated oven for 30-35 minutes until  the custard is set and golden.", "Serve immediately with créme fraïche and dust with icing sugar."]}, {"isVegetarian": true, "title": "Apricot mousse", "url": "www_bbc_co_uk_food_recipes_apricotmousse_79984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz tinned apricot halves", "50ml/2fl oz tinned apricot juice", "½ lemon, juice only", "50ml maple syrup", "200ml/7fl oz double cream, whipped", "50g/1¾oz Greek yoghurt", "sprig of fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the apricot halves and apricot juice into a food processor and blend to a purée.", "Add the lemon juice and maple syrup and blend together.", "Place the cream and Greek yoghurt into a large bowl and mix together.", "Add the apricot purée mixture to the cream mixture and mix together well.", "To serve, pour the apricot mousse into a dessert glass and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Apricot upside-down tart", "url": "www_bbc_co_uk_food_recipes_apricotupsidedowntar_91748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["235g/8½oz plain flour", "pinch salt", "170g/6oz chilled unsalted butter, cut into cubes", "50g/2oz caster sugar", "1 large free-range egg, beaten with 1 tbsp water", "100g/3½oz caster sugar, plus 1 tsp for dusting", "50ml/2fl oz water", "55g/2oz butter", "8 medium-sized fresh apricots, cut in half, stones removed", "cream or ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the pastry, blend the flour and salt in a food processor until combined. Add the butter cubes and sugar and blend again until the mixture resembles fine breadcrumbs. ", "With the motor running, gradually add just enough beaten egg and water mixture until the mixture comes together as a dough. (NB: You may not need to use all of the egg and water mixture.)", "Turn out the pastry onto a work surface covered with a large sheet of baking paper. Cover the pastry with a second sheet of baking paper, then roll it out until the pastry forms a circle 25cm/10in in diameter. Trim off any excess to form a neat circle. Set aside.", "For the butterscotch, heat the sugar and water in a small, ovenproof frying pan over a low heat for 2-3 minutes, or until the sugar has dissolved and the mixture resembles syrup. ", "Increase the heat until the syrup mixture is simmering. Simmer for 4-5 minutes, or until the syrup mixture caramelises. Do not stir the mixture at this stage - swirl the pan to move the contents if you need to. (CAUTION: Hot sugar is dangerous. Do not leave unattended.)", "When the syrup mixture has caramelised, remove the pan from the heat and stir in 40g/1½oz of the butter, until the butter has melted and the mixture is smooth and thick. Set aside for five minutes.", "Place the apricots, cut-sides down, into the warm butterscotch in the pan.", "Gently cover the pan with the pastry circle, tucking the edges of the pastry loosely inside the pan using a round-bladed knife. Prick all over using a fork and dot with the remaining butter. Sprinkle over the teaspoon of caster sugar.", "Transfer the pan to the oven and bake for 25-30 minutes, or until the pastry is golden-brown and cooked through and the apricots and butterscotch are bubbling. Remove the pan from the oven and set aside to cool for five minutes. ", "When the tart has cooled slightly, loosen the edges of the pastry using a knife. Place a large serving plate over the pan and invert it so that the tart is turned out onto the plate. (NB: Cover the pan handle with a tea towel before handling as it will still be hot.)", "Serve wedges of the apricot upside-down tart, warm or cold, with cream or ice cream."]}, {"isVegetarian": true, "title": "Arabian night tart", "url": "www_bbc_co_uk_food_recipes_arabian_night_tart_07930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "1 medium free-range egg", "250g/9oz plain flour", "125g/4½oz salted butter, chilled and diced ", "1 free-range egg, white only", "100g/3½oz unsalted pistachio nuts, shelled", "30g/1oz ground almonds", "100g/3½oz salted butter, softened ", "80g/3oz caster sugar", "2 large free-range eggs", "20g/¾oz runny honey ", "80g/3oz sugar", "4 large free-range eggs, yolks only", "50g/1¾oz cornflour ", "500ml/18fl oz whole milk", "20g/¾oz honey ", "1 cardamom pod  ", "30g/1oz unsalted butter", "175g/6oz blueberries", "1 large pomegranate, kernels only", "200g/7oz seedless white grapes, sliced in half along the width ", "1 pink dragon fruit, flesh only, sliced ", "5 tbsp smooth apricot jam", "handful unsalted pistachio nuts, shelled and crushed", "handful flaked almonds"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry case, add a little ice-cold water to a large mixing bowl. Place a smaller metal bowl on top, and place the egg and sugar into the smaller bowl. Whisk the egg and sugar together until the sugar has dissolved.", "Add the flour and combine until the mixture resembles breadcrumbs. Add the cubes of cold butter, and using a butter knife, cut into the floury mixture. When the mixture begins to come together, turn out onto a lightly-floured worktop and knead quickly for a few seconds. Cover the pastry with cling film, flatten into a disc and put in the fridge for about 30 minutes. ", "For the pistachio frangipane, blend the pistachios and almonds to a paste in a food processor. In a bowl beat the butter and sugar together then add the eggs and honey. Continue to beat a little, then add the nuts and mix until completely combined.", "For the crème pâtissière, combine the sugar, egg yolks and cornflour in a mixing bowl. Place a small saucepan over a high heat bring the milk, honey and cardamom pod to the boil. Slowly pour the boiled milk onto the egg yolks, whisking constantly. When combined return the mixture to the pan. Over a medium heat whisk the crème pâtissière until very thick.  Remove from the heat and mix in the butter. Cover with cling film and chill in the fridge. ", "Preheat the oven to 190C/375F/Gas 5. Put a baking sheet on the top shelf to heat up. ", "Remove the pastry from the fridge, unwrap it and sandwich it between two large pieces of cling film.  Roll out the pastry until it is 2-3mm/1/8in thick and place into a 23cm/9in tart tin (the best way is to keep the rolled out pastry attached to the cling film on one side, flip it over, cling film side up, and lay the pastry into the tin). Press down into the grooves of the tin, remove the cling film and leave the surplus hanging over the sides. Chill the pastry case in the freezer for 15 minutes.", "Cut a piece of baking paper large enough to cover the tart case. Scrunch it up slightly, sit it in the pastry tin and fill with baking beans. Bake in the oven for seven minutes. Remove the baking paper and beans then bake for a further seven minutes. ", "Brush the bottom of the pastry case with egg white and bake for a final two minutes. Set aside until completely cooled.", "Spread the frangipane onto the base of the pastry case, and cover the pastry edges with doubled foil so they don’t burn when cooking again. Bake in the oven for 15-20 minutes, or until the frangipane is cooked and lightly browned. Remove the foil and set aside to cool.", "For the topping, pipe on the crème pâtissière and arrange the fruit on top in concentric circles. Make a glaze by heating the apricot jam with one tablespoon of water in a small saucepan. Sieve to remove any lumps. Then gently brush the glaze over the fruit. Finish by sprinkling over the pistachios and flaked almonds."]}, {"isVegetarian": false, "title": "Arancini with deep-fried courgette flowers", "url": "www_bbc_co_uk_food_recipes_arancini_with_deep-fried_05270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "50g/1¾oz serrano or Parma ham, chopped", "4 tbsp grated parmesan", "approximately 300g/10½oz leftover chilled cooked risotto", "90g/3¼oz plain flour", "2 free-range eggs, lightly beaten", "75g/2½oz fresh breadcrumbs", "50g/1¾oz cornflour", "125ml/4½fl oz sparkling water", "8 courgette flowers", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Mix the chopped ham and parmesan into the cold risotto, then roll the risotto into small balls, each about the size of a golf ball. ", "Sprinkle 40g/1½oz of the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto a separate plate. Dust each risotto ball in the flour, then dip into the beaten egg, then roll in the  breadcrumbs until completely coated. ", "Carefully lower the arancini into the hot oil in batches and fry for 2-3 minutes, or until golden-brown and heated through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm.", "Meanwhile, in a bowl, whisk together the cornflour, the remaining flour and the sparkling water until smooth and well combined. Dip the courgette flowers into this batter.", "Fry the courgette flowers in batches for 1-2 minutes, or until the batter is crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Serve the arancini with the courgette flowers and lemon wedges alongside."]}, {"isVegetarian": false, "title": "Arancini with taleggio", "url": "www_bbc_co_uk_food_recipes_arancini_with_taleggio_15859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz chicken or vegetable stock", "1½ tbsp coconut oil or olive oil", "1½ onions, finely chopped", "4 garlic cloves, finely chopped", "250g/9oz risotto rice, preferably Arborio or carnaroli", "200ml/7fl oz white wine", "handful fresh flat-leaf parsley, roughly chopped", "1 bunch fresh chives, finely chopped", "1 bunch fresh mint, finely chopped", "55g/2oz Parmesan, finely grated, plus extra for serving", "100g/3½oz Taleggio, cut into 1cm/½in pieces", "100g/3½oz coconut flour or plain flour", "2 free-range eggs,  beaten", "125g/4½oz dried breadcrumbs", "coconut oil or vegetable oil for deep fat frying", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the stock to the boil in a large saucepan then maintain it at a gentle simmer.", "Meanwhile, heat the oil in a saucepan on a medium to low heat, add the onions and garlic and cook till soft and translucent in colour.", "Add the rice to the onions and cook for 2 minutes mixing well and coating all the rice, then add the wine and simmer until evaporated. Add the hot stock to the rice mixture one ladle at a time, stirring continuously and allowing the rice to absorb the stock before adding the next ladle. Keep repeating the process until all the stock has been used up, the rice mixture should be almost cooked and thick. Stir the herbs and parmesan into the mixture. Spread the risotto onto a tray, allow to cool, then refrigerate until completely cold.", "To shape the arancini, roll tablespoons of the risotto into balls, then press a piece of Taleggio into the centre of each ball and enclose the cheese in the rice completely.", "Place the flour, egg and breadcrumbs into 3 separate bowls. Lightly dust each arancini in the flour, then dip into the egg and roll in the breadcrumbs until evenly coated. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Deep fry the arancini in batches, for 3 minutes at a time, turning constantly, until heated through and golden brown. Drain on a plate lined with kitchen paper.", "Serve with grated parmesan and the lemon wedges and some baby leaves drizzled with balsamic vinegar."]}, {"isVegetarian": true, "title": "Arancini with tomato and olive tapenade", "url": "www_bbc_co_uk_food_recipes_arancini_with_tomato_and_49993", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arancini_with_tomato_and_49993_16x9.jpg", "ingredients": ["100g/3½oz pitted black olives", "100g/3½oz sun-blush tomatoes, chopped", "2 garlic cloves", "1 lemon, zest and juice", "1 tbsp chopped fresh parsley", "100g/3½oz mayonnaise", "50g/2oz unsalted butter", "450g/1lb arborio rice", "splash white wine", "2 litres/3½pints warm vegetable stock", "100g/3½oz sun-dried tomatoes, chopped", "5 spring onions, finely chopped", "salt and freshly ground black pepper ", "1 free-range egg, beaten", "plain flour, for dusting", "1 litre/1¾ pints vegetable oil, for deep-frying  "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tapenade, blend all of the ingredients except for the mayonnaise together until smooth. Stir in the mayonnaise. ", "For the arancini, melt the butter in a large heavy-bottomed saucepan. Add the rice and cook for 2-3 minutes on a low heat. When the rice starts to become a little translucent around the edges, add the wine and cook for another minute.", "Add a ladleful of warm stock and stir well. When the stock has almost been absorbed,  add another ladleful. Continue adding more stock until it has all been added and the rice is cooked. ", "Fold in the sun-dried tomatoes and spring onion and season with salt and freshly ground black pepper. Set aside to cool.", "Beat the egg in a bowl, sprinkle the flour onto a plate.", "Roll the rice into small balls, then dip into the beaten egg and dredge in the flour. ", "Half-fill a deep, heavy-based saucepan with vegetable oil and heat to 170C/325F (check using a digital thermometer). (CAUTION: Hot oil can be dangerous. Do not leave unattended).", "Deep-fry the arancini for 3-4 minutes, or until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. ", "Serve the arancini with the tapenade. "]}, {"isVegetarian": false, "title": "Arbroath smoked paté with green bean and roasted beetroot compôte", "url": "www_bbc_co_uk_food_recipes_arbroath_smoked_pat_with_76550", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Arbroath smoked haddock", "20g/¾oz baby gherkins, drained", "20g/¾oz capers, drained", "2 tsp wholegrain mustard", "150g/5½oz unsalted butter, softened", "1 tbsp finely chopped flat-leaf parsley", "1 lemon, juice only", "walnut bread, frozen and thinly sliced", "200g/7oz salt", "1 bunch beetroot, leaves removed, cut into quarters", "250ml/9fl oz red wine vinegar", "125g/4½oz caster sugar", "1 tsp cumin seeds", "1 tsp ground coriander", "100g/3½oz green beans, cut into 1cm/½in", "100g/3½oz cherry tomatoes on the vine", "250g/9oz crème fraîche", "2 tbsp creamed horseradish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the Arbroath smoked pâté, preheat the oven to 200C/400F/Gas 6. ", "Line a terrine mould with clingfilm.", "Place the smoked haddock, gherkins, capers and wholegrain mustard in a food processor and blend. ", "Gradually add the softened butter, blending with each addition and finally add the parsley and lemon juice.", "Spoon the pâté in the terrine mould and place in the fridge to set.", "For the compôte, place the salt on a baking tray, put the beetroot on top and roast in the oven for 40 minutes. ", "Once cooked and cooled enough to handle, peel and dice the beetroot and set aside.", "Put the red wine vinegar, sugar, cumin seeds, coriander, green beans and chopped beetroot in a large saucepan and cook for 30-40 minutes on a low heat. Set the compôte aside to cool.", "Preheat the grill to high.", "Place the cherry tomatoes on a baking tray and roast in the oven for five minutes, or until slightly burst.", "Toast the walnut bread for one minute on each side under the hot grill.", "For the horseradish cream, put the crème fraîche and horseradish in a small bowl and mix.", "To serve, place a slice of the pâté on each of four rectangle plates with a spoonful of the compôte alongside. Top with a roast tomato. Spoon the horseradish cream in a line on one side of the plate and the toast next to the paste. "]}, {"isVegetarian": false, "title": "Arbroath smokie fish cakes with chive sauce", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_88572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Arbroath smokies, or other smoked fish", "400ml/14fl oz full-fat milk", "450g/1lb floury potatoes (such as King Edward or Maris Piper), peeled and cut into chunks", "2 tbsp chopped fresh flatleaf parsley", "1 tbsp chopped fresh chives", "1 free-range egg yolk", "salt and freshly ground black pepper", "75g/3oz plain flour", "2 free-range eggs, beaten", "110g/4oz Japanese panko breadcrumbs", "2 tbsp olive oil", "50g/2oz butter", "1 shallot, finely chopped", "110ml/4fl oz white wine", "110ml/4fl oz hot chicken stock", "200ml/7fl oz double cream", "salt and freshly ground black pepper", "2 limes, juice and zest", "3 tbsp finely chopped fresh chives", "2 handfuls mizuna leaves or other micro salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Arbroath smokie fishcakes, place the Arbroath smokies (or smoked fish) into a large frying pan and pour over the milk. Bring the milk to the boil, then remove the pan from the heat. ", "Take the smokies out of the milk and set aside to cool. When cool enough to handle, remove as many bones from the fish as possible, flaking and reserving the flesh as you go. Set aside.", "Meanwhile, cook the potatoes in a pan of boiling, salted water for 15-20 minutes, or until tender. Drain well and return the potatoes to the pan, then return the pan to the heat for a further minute or two to dry the potatoes out.", "Mash the potatoes until smooth using a potato masher or ricer, then mix them in a bowl with the parsley, chives, egg yolk and flaked fish until well combined. Season, to taste, with salt and freshly ground black pepper. ", "Roll small amounts of the fishcake mixture into balls using your hands, then flatten each slightly to form patties. Chill in the fridge until firm so that they don’t collapse when you fry them.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto another plate. Dredge each fishcake in the flour, then dip it into the egg, then roll it in the flour until coated. ", "Heat the olive oil in a large frying over a medium heat. Add the fishcakes for 3-4 minutes on each side, or until crisp and golden-brown on both sides and completely warmed through.", "For the sauce, heat a small frying pan until hot, add a knob of the butter and, when melted, fry the shallots for 1-2 minutes, or until softened.", "Add the white wine, chicken stock and cream and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer until the volume of liquid has reduced by half and thickened.", "Strain the mixture through a fine sieve into a clean pan, then whisk in the remaining butter, the lime juice and zest and the chives. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the mizuna leaves among four serving plates. Place the fishcakes on top and spoon some of the sauce over each portion."]}, {"isVegetarian": false, "title": "Arbroath-smokie cakes with chilli jam", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_cakes_32036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arbroath_smokie_cakes_32036_16x9.jpg", "ingredients": ["75g/3oz caster sugar", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 lime leaves", "2 lemongrass stems, tough outer leaves removed, finely chopped", "25g/1oz roughly chopped fresh ginger", "2 garlic cloves, peeled, left whole", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce (nam pla)", "40ml/1½fl oz sesame oil", "50ml/2fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest", "110g/4oz crème fraîche", "110g/4oz Arbroath smokie, skinned, boned and flaked into small pieces", "110g/4oz mashed potato", "1 red chilli, finely chopped", "1 tsp medium curry powder", "salt and freshly ground black pepper", "1 lime, juice only", "75g/3oz plain flour ", "2 free-range eggs, beaten", "90g/3½oz Panko breadcrumbs", "vegetable oil, for deep frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli jam, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel. (Do not stir and keep an eye on it so that it doesn’t burn.)", "Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée.", "Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool.", "Once the chilli jam mixture has cooled, stir in the crème fraîche until well combined.", "For the fish cakes, mix the Arbroath smokie, mashed potato, chilli and curry powder in a bowl until well combined. Season with salt and freshly ground black pepper and lime juice, to taste.", "Shape the mixture into 2cm/¾in diameter balls.", "Sprinkle the flour onto one plate, beat the egg in a bowl then place the breadcrumbs on another plate.", "Dredge each ball in the flour, then dip it in the beaten egg and roll in the breadcrumb until completely coated.", "Heat the oil in a deep-fat fryer to 190C/375F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the fish cakes into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm until needed.", "Thread the cakes onto small skewers and arrange on a serving plate. Spoon the chilli jam into a bowl and serve alongside the cakes."]}, {"isVegetarian": false, "title": "Arbroath smokie pâté with soft quails’ eggs and beetroot", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_pt_with_67959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Arbroath smokies", "2 lemons, juice only", "150ml/5fl oz double cream", "25g/1oz fresh chives, finely chopped", "sea salt and freshly ground black pepper", "50ml/2fl oz sherry vinegar", "50ml/2fl oz red wine vinegar", "300ml/10fl oz extra virgin olive oil", "mixed leaves (baby red chard, lamb’s tongue, watercress, little gem)", "2 quails’ eggs, soft-boiled and peeled", "300g/10½oz cooked beetroot, sliced", "fresh chervil leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["For the pâté, remove the flesh from the fish, discarding all the skin and bones, and place into a blender. Add the lemon juice and blend quickly with the cream to a slightly coarse pâté. Transfer the pâté from the blender to a bowl, add the chives and season to taste with sea salt and freshly ground black pepper. Spoon the pâté into a pot, smooth over the surface and place in the fridge.", "To make the dressing, place both the vinegars in a bowl. Whisk in 225ml/8fl oz of the olive oil then check the flavour for balance of oil and acidity, adding more oil if needed. ", "Shape the pâté into quenelles. Dress the salad leaves with a little of the vinaigrette and cut the eggs in half. Place the beetroot in overlapping circles on a plate, place the salad leaves on top of the beetroot, top with the pâté and the egg and garnish with a few chervil leaves. Serve with slices of warm Melba toast."]}, {"isVegetarian": false, "title": "Arbroath smokie fishcakes with tomato salsa", "url": "www_bbc_co_uk_food_recipes_arbroathsmokiefishca_88565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ Arbroath smokie, skinned, boned and flaked into small pieces", "4 small oatcakes, broken into crumbs with a rolling pin", "1 free-range egg, beaten", "1 tbsp chopped fresh chives", "3 tbsp plain flour", "1 tbsp olive oil", "25g/1oz butter", "100ml/3½fl oz double cream", "1 tsp wholegrain mustard", "1 ripe tomato, chopped", "handful fresh basil leaves, torn", "1 lime, juice only ", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fishcakes, mix together the fish, oatcake crumbs, beaten egg and chopped chives in a bowl. Shape into patties with your hands and roll in flour.", "Heat the oil and butter in a frying pan and fry the fishcakes until golden-brown on both sides, about three minutes per side.", "For the mustard sauce, heat the cream in a small pan to simmering point and stir in the mustard.", "For the tomato salsa, mix together all the ingredients, except the chives, in a bowl.", "To serve, make a bed of the salsa on a serving plate and arrange the fishcakes on top. Pour the mustard cream sauce around the sides and garnish with chopped fresh chives."]}, {"isVegetarian": true, "title": "Arctic roll", "url": "www_bbc_co_uk_food_recipes_arcticroll_93744", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arcticroll_93744_16x9.jpg", "ingredients": ["750ml/1pint 7fl oz good quality vanilla ice cream, softened", "4 free-range eggs", "110g/4oz caster sugar, plus extra to dust", "110g/4oz self-raising flour", "150g/5oz caster sugar", "½ lemon, zest and juice", "350g/13oz strawberries, quartered"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the sponge, beat the ice cream until softened then spoon into a 5cmx30cm/2inx12in long clean plastic or metal pipe. Place into the freezer and freeze for 3-4 hours, or until solid. Alternatively, soften slightly and place onto a sheet of baking parchment, then roll up and mould into a sausage 5cmx30cm/2inx12in long and freeze until solid.", "Preheat the oven to 190C/375F/Gas 5 and line a 23cmx33cm/9inx13in Swiss roll tin with baking parchment.", "Place the eggs and sugar into a bowl and whisk until very light, fluffy and thickened.", "Sift the flour over the mixture and fold in carefully.", "Pour into the lined tin and smooth with a spatula until evenly spread out.", "Bake the sponge for 10-12 minutes, or until just firm to the touch.", "Place a sheet of baking parchment that is slightly bigger than the tray onto the work surface and dust with some caster sugar.", "Turn the sponge out onto the parchment paper, then peel off the parchment on the bottom of the sponge. Set aside to cool slightly.", "For the strawberry jam, heat a frying pan until hot, then add the sugar, lemon zest and juice and cook for 3-4 minutes until the sugar has dissolved and slightly thickened. ", "Meanwhile place the strawberries into a food processor and pulse until very roughly chopped.", "Add to the pan, mix well and cook the jam for a further 3-5 minutes until thick. Remove from the heat and set aside to cool.", "To assemble the roll, spread the strawberry jam over the cooled sponge, leaving a 2cm/1in gap around the edge.", "If the pipe used to set the ice cream is metal, run a blow torch over the pipe to release the ice cream or if plastic, dip in hot water to release the ice cream from the pipe.", "Place the ice cream cylinder along the long side of the sponge, then using the parchment paper underneath, roll up the sponge so the ice cream is encased in sponge.", "Roll the sponge off the parchment and cut into slices to serve."]}, {"isVegetarian": true, "title": "Arlettes", "url": "www_bbc_co_uk_food_recipes_arlettes_17164", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arlettes_17164_16x9.jpg", "ingredients": ["60g/2¼oz strong white bread flour, plus extra for dusting", "60g/2¼oz plain flour", "1 tsp salt", "40g/1½oz unsalted butter, melted", "125g/4½oz unsalted butter, at room temperature", "25g/1oz strong white bread flour", "25g/1oz plain flour", "50g/1¾oz granulated sugar", "2 tsp ground cinnamon", "icing sugar, for dusting"], "serves": "Makes 8 biscuits", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flours, salt, butter and 50ml/2fl oz cold water in a bowl and gently mix to form a dough. ", "Transfer the dough to a lightly floured work surface and knead for 5 minutes until smooth. Shape the dough into a square, wrap in cling film and chill for an hour (or freeze for 20-30 minutes).  ", "For the butter layer, cream the butter and flours together using an electric mixer. Sandwich the mixture between two sheets of cling film and roll out to a rectangle the same width as the square of dough, but twice as long. Chill in the fridge for 25 minutes. ", "Unwrap the chilled dough and butter layer. Place the chilled butter layer, short end facing towards you on a lightly floured surface and place the square of dough in the centre of the butter sheet. Make sure it is positioned neatly and covers almost to the edges. Lift the exposed butter sheet at the top and fold it down over the dough, then fold the exposed butter sheet at the bottom up over the top, so the dough is completely enclosed in the butter sheet. ", "Place the dough on a lightly floured surface, short end towards you. Roll out to a rectangle, keeping the edges as even as possible. Fold the top quarter down and the bottom quarter up so they meet neatly in the centre. Then fold the dough in half along the centre line. This is called a book turn. Wrap the dough in cling film and chill for 25 minutes. ", "Remove the dough from the fridge and make another book turn. Wrap the dough in cling film and chill for 25 minutes. ", "For the filling, mix the granulated sugar and the cinnamon together in a bowl. On a lightly floured surface roll out the pastry to a rectangle as before and sprinkle over the sugar. ", "Make another book turn to incorporate the sugar, then roll out the pastry 1cm/½in thick, to a rectangle 12x20cm/4½x8in. Roll up the pastry from the short end like a Swiss roll. Wrap in cling film and chill for 25 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 6. Line 2 baking trays lines with silicon sheets or non-stick baking paper.", " Trim the ends of the roll and cut into 8 x 1cm/½in thick slices.  Dust the work surface heavily with icing sugar and roll each piece of dough out very thinly, turning to coat in the sugar and to prevent sticking. Place the biscuits on the prepared trays and bake for 5 minutes. Remove from the oven, carefully turn the biscuits and cook for a further 3-4 minutes, or until golden-brown. Transfer to a wire rack to cool.  "]}, {"isVegetarian": false, "title": "Arnold Bennett omelette with radish and fennel salad", "url": "www_bbc_co_uk_food_recipes_arnold_bennett_omelette_71002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz whole milk", "100g/3½oz smoked haddock, preferably Arbroath Smokie haddock", "100g/3½oz smoked salmon", "1 bay leaf", "10 black peppercorns", "40g/1½oz butter", "4 free-range eggs, beaten", "15g/½oz plain flour", "50g/1¾oz mature cheddar cheese, grated", "salt and freshly ground black pepper", "½ butterhead lettuce, leaves removed and washed", "½ head fennel, thinly sliced lengthways on a mandolin", "5 radishes, sliced", "20ml/¾fl oz French dressing", "30g/1oz honey", "2 tbsp white balsamic vinegar", "50ml/2fl oz vegetable oil", "1 shallot, finely chopped", "½ garlic clove, thinly sliced", "1 tsp chopped fresh basil", "1 tsp chopped fresh thyme leaves", "1 tsp chopped chives", "1 tsp chopped fresh parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the omelette, pour the milk into a large shallow pan. Add the smoked haddock, smoked salmon, bay leaf and peppercorns. Bring to a simmer. Cook for five minutes, or until the fish has just cooked through and flakes when pushed gently. Lift the fish out of the pan and set aside to cool slightly before gently flaking, discarding the skin. Strain the milk into a clean pan.", "Heat a frying pan until medium-hot, add 1 tablespoon of the butter and the eggs. Cook gently, stirring with a fork until they just hold together.", "Add half the flaked fish to the top of the omelette. Roll out of the pan onto an ovenproof serving dish and top with the remaining fish.", "Preheat the grill to hot. ", "Clean the omelette pan with kitchen paper, return to the heat and melt the remaining butter. Add the flour and cook stirring well for two minutes. Gradually add the reserved milk, whisking all the time until it forms a smooth sauce. Season with salt and pepper. Pour the sauce over the top of the omelette and scatter with the cheese. Place under the grill for 3-5 minutes, or until golden-brown and bubbling.", "Meanwhile for the salad, mix all of the salad ingredients together in a large salad bowl. ", "For the dressing, combine all of the dressing ingredients in a blender until smooth. Just before serving, pour some of the dressing over the salad and toss. Any leftover dressing can be kept in the fridge for a few days.", "To serve, put the omelette in the centre of the table and place the dressed salad alongside. "]}]