[{"ingredients": ["Vinagre de vino de arroz de 200ml / 7fl oz", "4 cucharadas de azúcar", "4 cucharaditas de sal", "3 cm / 1¼ en pieza de alga kombu (opcional)", "750g / 1lb 9oz de arroz de sushi", "selección de pescado, como atún, salmón, pescado blanco como el róbalo o la lubina", "Langostinos crudos, con cáscara", "2 cucharadas de sake", "pasta de wasabi, al gusto", "algas nori", "Pepino", "aguacate", "jengibre en escabeche", "Wasabi", "salsa de soja"], "method": ["Primero prepare su vinagre de sushi; puede comprarlo ya hecho, pero es fácil hacer el suyo propio. Caliente el vinagre en una sartén, luego agregue el azúcar y la sal y deje que se disuelva. Deje que se enfríe y tiene el maravilloso y sabroso aderezo salado para el arroz. Dejar de lado.", "Lave el arroz tres veces, luego drene y deje reposar durante 15 minutos. Ponga a hervir un litro / 1¾ pintas de agua fría y agregue el kombu (si se usa) y el arroz. Cocine a fuego lento con la tapa encendida por diez minutos, luego déjelo reposar sin quitar la tapa por otros 20 minutos.", "Incline en un tazón de madera grande, espolvoree el vinagre de sushi y corte en el arroz con un movimiento de corte con una espátula de madera.", "Ventilador para enfriar, con una paleta de madera (o un tapete viejo), durante diez minutos. Voltee el arroz, ventilador por dos minutos. Repita esto cuatro veces y el arroz debe estar a temperatura ambiente y lo suficientemente pegajoso.", "Use el arroz inmediatamente ya que es mejor después de unas horas.", "Para el sushi nigiri, corte los peces elegidos cuidadosamente en tiras. Siempre trate de obtener pescado de calidad para sushi y siempre use pescado fresco de primera clase; algunos pescados de sushi se congelaron deliberadamente para matar cualquier bacteria.", "Coge las gambas, pélelas dejando las colas intactas y mariposas cuidadosamente quitándolas por debajo. Empapalos en un pincho a lo largo para sacar la curva.", "Coloque 500ml / 18fl oz de agua en una sartén con el sake y lleve a ebullición. Cocine a fuego lento las gambas hasta que estén rosadas; esto debería demorar unos dos minutos. Deje enfriar y retire el pincho. Tendrás langostinos rectos que serán fáciles de colocar en el arroz.", "Tome una bola de arroz del tamaño de una nuez, gírela en sus manos para pulir el exterior, pero no comprima demasiado el arroz.", "Coloque un punto de wasabi en la parte superior. Coloque una gamba o una tira de pescado sobre esto. Presione en su lugar con un movimiento de golpeteo entre su pulgar y su dedo medio. Repita para usar la mayor cantidad de pescado que desee para convertirse en nigiri.", "Para los rollos de maki, toma una estera de bambú, cúbrela generosamente con film transparente. Toma una media hoja de alga nori. (Los que están hechos con media lámina son más pequeños y tienen más relleno a la proporción de arroz, y son mejores para comer).", "Cubra con arroz por todas partes, excepto por el borde hacia usted, donde debe dejar un borde vacío de unos 2 cm / ¾ pulg. - Esto te dará una unión. Presione el arroz hacia abajo con firmeza pero suavemente para darle un revestimiento delgado pero uniforme. En el medio, alinee sus tiras de relleno; elija entre salmón, pepino, aguacate y wasabi. Rueda la alfombra lejos de ti, atrapando el relleno en el rollo. Firme con la estera.", "Desenrolle y use un cuchillo con una hoja húmeda cortada en trozos del tamaño de un bocado.", "Sirve los rollos de nigiri y maki con jengibre encurtido, wasabi y salsa de soja."], "url": "www_bbc_co_uk_food_recipes_sushi_39966", "title": "Sushi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 paquete de cuadrados nori (del tipo utilizado para envolver el sushi); disponible en algunos supermercados y mercados asiáticos", "400 g / 14 oz de arroz de sushi de grano corto, cocinado de acuerdo con las instrucciones del paquete, refrigerado", "pasta de wasabi", "450 g / 1 libra de filete de salmón muy fresco y de alta calidad", "1 pepino, finamente cortado en tiras", "1 manojo de cebolletas, finamente picado", "salsa de soja"], "method": ["Coloque cada cuadrado de nori en una estera de sushi. (Las esteras de sushi están disponibles en los supermercados asiáticos y en los supermercados más grandes).", "Coloque una capa de arroz de sushi enfriado sobre la envoltura de algas marinas y presione suavemente. (NB: no agregue demasiado arroz o terminará con rollos de sushi muy gordos).", "Coloque un poco de pasta de wasabi a lo largo del arroz, según el gusto. Wasabi es bastante fuerte, ¡así que sé amable!", "Coloque una fina rodaja de salmón en el arroz.", "Extienda las tiras de pepino sobre el salmón y agregue una pizca de cebolleta.", "Con cuidado, enrolle el sushi en forma de salchicha y córtelo en trozos de 3cm / 1 pulgadas de largo, recortando los extremos.", "Sirva con tazones de salsa de soja y wasabi extra."], "url": "www_bbc_co_uk_food_recipes_sushisalmonrolls_85941", "title": "Rollos de salmón sushi", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina autorreflectante de 335g / 11oz", "130 g / 5oz de sebo triturado", "100ml / 3½ fl oz de leche", "200g / 7oz de mantequilla ligeramente salada, en cubos, más extra para engrasar", "200 g / 7 oz de azúcar morena clara", "3 limones grandes no encerados", "200 ml / 7 fl oz crema doble, para servir", "helado, para servir"], "method": ["Para el pudín de estanque de Sussex, engrase un lavabo a prueba de calor de 1,5 litros / 2¾ pinta.", "Mezcle la harina y el sebo en un bol. En una jarra, combine la leche con 100 ml / 3½ fl oz de agua. Mezcle suficiente leche y agua con la harina y la mezcla de sebo para hacer una masa blanda, pero lo suficientemente firme como para rodar.", "En una superficie de trabajo ligeramente enharinada, enrolle la masa en un círculo grande. Recorte un cuarto del círculo y déjelo a un lado (este se usará más adelante para formar la tapa del budín).", "Coloque el círculo de masa en el tazón y junte los lados cortados, presionando bien.", "Coloque la mitad de los cubitos de mantequilla y la mitad del azúcar en la parte inferior del tazón revestido.", "Pinche los limones por todas partes con una aguja de fibra o brocheta, para que los jugos puedan escapar, y luego coloque los limones sobre la mantequilla y el azúcar. Cubra con la mantequilla restante y el azúcar para llenar el recipiente.", "Extienda la masa reservada en una ronda y colóquela sobre el relleno del lavabo. Presione los bordes para sellar el budín.", "Dobla un pliegue en el centro de un trozo grande de papel de aluminio y cubre el lavabo con el pliegue colocado en el medio. Ate la lámina en su lugar con la cuerda de los cocineros y cree una manija envolviendo la cuerda debajo y sobre el recipiente (para que el pudín pueda moverse fácilmente cuando esté caliente).", "Ponga a hervir una olla grande de agua y baje el pudin. El agua debe llegar hasta la mitad de los lados del cuenco.", "Cubra la olla con una tapa y deje hervir a fuego lento durante 3-4 horas. Rellene la sartén con más agua si comienza a secarse.", "Para servir, retire con cuidado el pudin de la sartén y retire la tapa de aluminio. Pon un plato hondo sobre el lavabo y coloca el pudin en el plato. Sirva inmediatamente con la crema y el helado."], "url": "www_bbc_co_uk_food_recipes_sussex_pond_pudding_with_32660", "title": "Pudín del estanque de Sussex con crema y helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 colinabo, pelado y cortado en cubitos", "1 cucharadita de sal", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Coloque el colinabo en una fuente de agua fría y espolvoree 1 cucharadita de sal.", "Llevar a ebullición y reducir el fuego a fuego lento lento.", "Cocine de 10 a 15 minutos o hasta que estén tiernos. Escurre el colinabo y regrese a la sartén.", "Mash con un triturador de patata, agregue la mantequilla, sal y pimienta negra recién molida, al gusto, y sirva."], "url": "www_bbc_co_uk_food_recipes_swedemash_78187", "title": "Puré sueco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, cada una cortada en tres tiras largas", "1 cucharadita de pimienta negra molida", "pizca de pimienta de cayena", "1 cucharadita de canela molida", "1 cucharadita de jengibre molido", "1 cucharadita de chile", "1 cucharadita de cúrcuma", "1 cucharadita de semillas de cilantro", "1 cucharadita de comino molido", "1 lima, solo jugo", "2 cucharadas de aceite de oliva", "1 tallo de hierba de limón", "2.5cm / 1 en jengibre fresco, picado", "2 dientes de ajo grandes, aplastados", "2 chalotes, finamente picados", "2 chiles rojos picados", "1 cucharadita de sal masala", "1 cucharadita de cúrcuma molida", "Leche de coco 400ml / 14fl oz", "1 lata de tomates picados", "1 cucharada de hojas de cilantro", "1 papaya, pelada y cortada longitudinalmente", "1 cebolla roja, pelada y rebanada", "1 lima, solo jugo", "aceite de oliva", "pizca de salsa de chile dulce.", "arroz para servir"], "method": ["Cortar las pechugas de pollo en tiras largas, exprimir un poco de jugo de limón y dejar macerar durante unos minutos.", "Luego triture los ingredientes secos y frote en las tiras de pollo.", "Planche en ambos lados durante cinco minutos hasta que queden dorados y chamuscados.", "Para hacer la salsa Swahili, coloca la hierba de limón, el jengibre, el ajo, los chalotes, los chiles, el garam masala y la cúrcuma en una cacerola de base pesada y freír hasta que los chalotes se ablanden. A continuación, agregue la leche de coco y los tomates de ciruela, sazone y deje hervir a fuego lento durante cinco minutos.", "Luego mezcle las rodajas de papaya y cebolla roja crudas y mezcle el jugo de lima, el aceite de oliva y la salsa de chile dulce para hacer un aderezo.", "Sirva el pollo a la parrilla en un montículo, con la salsa Swahili rociada en la parte superior, y la ensalada de papaya y cebolla roja en el lateral. Adorne con hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_swahilichickenandpap_71266", "title": "Ensalada de pollo y papaya swahili", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "110 g / 4oz de sebo triturado", "75ml / 3fl de leche en oz", "75ml / 3fl oz de agua", "200g / 7oz de mantequilla ligeramente salada, cortada en cubos, más grasa adicional", "200 g / 7 oz de azúcar morena clara", "2 limones grandes"], "method": ["Mezcle la harina y el sebo en un bol.", "Combine la leche y el agua en una jarra o en un recipiente aparte.", "Mezcle suficiente leche y agua con la harina y la mezcla de sebo para hacer una masa blanda, pero no demasiado suave para rodar.", "Ruede la masa sobre una superficie enharinada, para hacer un círculo grande. Recorta un cuarto del círculo (para ser usado más tarde como la tapa del budín).", "Engrase un recipiente o cuenco a prueba de calor de 1,5 litros / 2¾ pinta. Coloque el círculo más grande de masa en el tazón y junte los lados cortados, presionando bien.", "Coloque la mitad de los cubos de mantequilla y la mitad del azúcar en el fondo del recipiente forrado.", "Pinche los limones por todas partes con una aguja de fibra o brocheta, para que los jugos puedan escapar, luego coloque los limones encima de la mantequilla y el azúcar.", "Coloque la mantequilla y el azúcar restante sobre los limones para llenar el recipiente.", "Estire el cuarto de repostería reservado en una ronda y colóquelo sobre el relleno del lavabo. Presione los bordes para sellar el budín.", "Coloque un pedazo de papel de aluminio sobre el lavabo, creando un pliegue en el medio. Ate la lámina en su lugar con una cuerda y átela cuidadosamente para crear un mango de cuerda sobre la parte superior, de modo que el pudín se pueda mover fácilmente cuando esté caliente.", "Ponga a hervir una olla grande de agua y baje el pudin. El agua debe llegar hasta la mitad de los lados del cuenco.", "Cubra la olla con una tapa y deje hervir a fuego lento durante 3-4 horas. Si el nivel del agua es demasiado bajo, rellénelo con más agua hirviendo.", "Para servir, retire con cuidado el recipiente de la olla y retire la tapa de aluminio. Pon un plato hondo sobre el lavabo y coloca el pudin en el plato. Coloque sobre la mesa y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sussexpondpudding_85713", "title": "Pudín del estanque de Sussex", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Colinabo 140g / 5oz, pelado y picado", "Stock de pollo de 570 ml / 1 pt (los vegetarianos pueden sustituirlo por caldo de verduras)", "55g / 2oz Stilton", "sal y pimienta negra recién molida", "2 rebanadas de chapata, a la plancha", "55g / 2oz Stilton", "1 cucharada de aceite de oliva, para servir"], "method": ["Precalentar la parrilla a su configuración más alta.", "Ponga a hervir un recipiente con agua y cocine el colinabo durante 10-15 minutos o hasta que esté muy tierno.", "Escurre el sueco y regrese al calor. Agregue el caldo de pollo caliente a la sartén y deje que hierva. Reduzca el fuego a fuego lento.", "Agregue el Stilton y sazone, al gusto, con sal y pimienta negra.", "Use una batidora para mezclar la mezcla hasta que quede suave y colóquela en un bol.", "Para los crotones, desmenuce el Stilton en la chapata tostada y coloque encima de la sopa. Coloque debajo de la parrilla por tres minutos o hasta que el Stilton se haya derretido.", "Retire de la parrilla y rocíe con aceite de oliva, para servir."], "url": "www_bbc_co_uk_food_recipes_swedesoupwithstilton_78887", "title": "Sopa sueca con crutones Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina autoacabada, más extra para quitar el polvo", "100g / 3½oz de sebo triturado", "75ml / 2½ fl oz de leche", "3 manzanas de Cox", "150 g / 5½ oz de mantequilla, cortada en cubos, más extra para engrasar", "175g / 6oz de azúcar mascabado ligero", "1 limón grande", "crema o crema"], "method": ["Para la corteza de sebo, coloca la harina y el sebo en un bol. Mida la leche en una jarra y luego agregue 75ml / 2½fl oz de agua fría para hacer 150ml / 5½ oz de líquido total. Agregue esto al sebo y mezcle para hacer una masa suave.", "Polvore ligeramente la superficie de trabajo con harina y luego extienda la masa a un círculo de 30cm / 12 pulgadas. Corta una cuarta parte del círculo y reserva para la tapa. Mantega gruesamente el cuenco del pudín y luego recubre con la masa, presionando la unión.", "Para el relleno, pele y base las manzanas, luego córtelas en cubos y mezcle en un tazón con la mantequilla y el azúcar. Coloque un poco de esta mezcla en el recipiente de budín en la parte superior de la pasta de sebo. Pinche el limón por todas partes con un palillo de cóctel y luego colóquelo con las manzanas para que quede en posición vertical. Empaque el resto de las manzanas y la mezcla de mantequilla alrededor del limón.", "Estirar la masa de sebo reservada a un círculo para que quepa en la parte superior del postre, recortar el exceso de masa y pellizcar los bordes para sellar.", "Corta un cuadrado de papel de aluminio y haz un pliegue en el centro. Ate la lámina alrededor del lavabo con cuerda, luego pase la cuerda sobre el lavabo y vuelva a colocarla debajo de la cuerda un par de veces para hacer una manija. Ate con seguridad.", "Si no tiene ninguna cuerda, doble una tira larga de papel de aluminio horizontalmente por la mitad, y luego por la mitad otra vez. Coloque la lámina alrededor de la parte inferior de la cubeta, y envuelva los lados hacia arriba y alrededor para actuar como soporte a medida que la cubeta se baja a la bandeja.", "Coloque la tapa de un tarro de mermelada en la olla grande para que el recipiente toque el fondo de la sartén.", "Agregue el recipiente de budín a la sartén y luego vierta agua hirviendo a su alrededor para que llegue a tres cuartas partes del borde del lavabo. Cubra con una tapa hermética y cocine a fuego lento durante 3 horas y media. Controle ocasionalmente y rellénelo con más agua hirviendo según sea necesario.", "Para servir, retire la lámina e inviértala en un plato grande. Retire el recipiente y sirva en rodajas con crema o crema pastelera."], "url": "www_bbc_co_uk_food_recipes_sussex_pond_pudding_with_23049", "title": "Pudín de estanque de Sussex con manzanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sussex_pond_pudding_with_23049_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de patatas Maris Piper, peladas y cortadas en trozos", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de mantequilla", "1 cebolla roja pequeña, finamente picada", "Carne picada de carne 250 g / 9 oz", "Carne picada de cerdo 250 g / 9 oz", "½ cucharadita de pimienta de Jamaica molida", "Perejil pequeño de hojaldre, finamente picado", "2 cucharadas de crema individual", "sal y pimienta negra recién molida", "3 cucharadas de mantequilla sin sal", "1 cebolla roja pequeña, finamente picada", "1 zanahoria, pelada y finamente picada", "400ml / 14fl oz de caldo de carne", "1 cucharada de harina normal", "pizca de pimienta molida", "150ml / 5fl oz de crema individual", "1 cucharada de salsa de soja", "2 cucharaditas de jalea de grosella", "700g / 1lb 9oz de patatas Maris Piper, peladas y cortadas en trozos", "25g / 1oz de mantequilla", "50ml / 2fl oz de leche entera", "2 cucharadas de eneldo recién picado, más unas ramitas para servir"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para hacer las albóndigas, ponga a hervir una cacerola grande de agua con sal y cocine las papas hasta que estén tiernas. Escurrir y macerar con un triturador de papas. Incline en un tazón grande y mezcle el huevo.", "Derrita 1 cucharada de mantequilla en una cacerola de fondo grueso a fuego medio. Freír la cebolla durante 5 minutos, o hasta que esté suave, y agregar a la mezcla de papa.", "Guarde 1 cucharada de carne picada de la salsa. Agregue la carne picada restante y toda la carne picada de cerdo a la mezcla de papa, junto con la pimienta de Jamaica, la mitad del perejil, la crema, una cucharadita de sal y una buena pizca de pimienta. Mezclar bien. Enrolle las albóndigas en bolas de 3cm / 1¼in, cubra con una película adhesiva y colóquela en la nevera.", "Para hacer la salsa, derrita 2 cucharadas de mantequilla en una cacerola a fuego medio. Agregue la cebolla y la zanahoria y cocine por 5 minutos. Agregue la carne molida de res reservado y el caldo de carne y cocine a fuego lento durante 15 minutos, luego cuele en una jarra.", "Usando la misma olla, derrita la mantequilla restante con la harina y la pimienta. Vierta lentamente la salsa en la sartén, batiendo todo el tiempo, y espere a espesar. Agregue la crema, la salsa de soya y la jalea de grosella. Traiga a fuego lento y sazone al gusto. Dejar de lado.", "Engrase una bandeja para hornear grande con la mantequilla restante y colóquela en el horno por 3 minutos. Cuando esté caliente, coloque todas las albóndigas en la hoja y vuelva al horno. Asar durante 10 minutos, doblando hasta la mitad, hasta que las albóndigas estén doradas y cocidas. Transfiera a un plato de servir para horno. Apague el horno y devuelva las albóndigas al horno para mantener el calor.", "Para hacer el puré de papa, ponga a hervir una olla grande de agua con sal y cocine las papas durante 15 minutos o hasta que estén tiernas. Escurrir y pasar a través de un ricer de patata en la sartén. Agregue la mantequilla y la leche y mezcle bien con un triturador de papa. Sazonar al gusto y agregar el eneldo.", "Vuelva a calentar la salsa y vierta sobre las albóndigas. Espolvoree con el perejil y el eneldo restantes y sirva con el puré."], "url": "www_bbc_co_uk_food_recipes_swedish_meatballs_with_13822", "title": "Albóndigas suecas con puré de eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vinagre de vino blanco 500ml / 18fl oz", "200 g / 7 oz de azúcar en polvo", "2 hojas de laurel", "1 zanahoria, pelada y picada", "1 cebolla, finamente rebanada", "2 cucharaditas de pimienta negra entera", "1 cucharadita de semillas de mostaza amarilla", "10 filetes de arenque salados (aproximadamente 1.3kg / 3lb) enjuagados, remojados en agua durante la noche, escurridos", "cebolla roja, finamente picada, para adornar", "puñado de cebolletas, cebollines finamente picados, para adornar", "110g / 4oz de mantequilla sin sal", "puñado de alcaparras", "1 cucharada de eneldo finamente picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "8 rebanadas de pan de centeno, con mantequilla"], "method": ["Ponga el vinagre, el azúcar, el laurel, la zanahoria, la cebolla, los granos de pimienta y las semillas de mostaza en una cacerola y deje hervir a fuego medio-alto. Reduzca el fuego y cocine a fuego lento durante 5 minutos, o hasta que el azúcar se haya disuelto. Retirar del fuego y dejar enfriar a temperatura ambiente.", "Coloque los filetes de arenque en un recipiente no reactivo. Vierta sobre el líquido decapado enfriado y revuelva. Cubra y marine en el refrigerador por 2 días.", "Para hacer la salsa de mantequilla de alcaparras, derrita la mantequilla en una sartén. Cuando se ponga marrón, agregue las alcaparras y cocine durante 2 minutos. Agregue el eneldo y el jugo de limón. Condimentar con sal y pimienta.", "Para servir, quite los filetes del líquido decapante y séquelos con papel de cocina. Córtelos en trozos de 7,5 cm / 3 in y transfiéralos a las rebanadas de pan de centeno con mantequilla. Verter sobre la salsa de mantequilla de alcaparra y adornar con la cebolla roja y el cebollino."], "url": "www_bbc_co_uk_food_recipes_swedish_pickled_herring_57381", "title": "Arenque en escabeche sueco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "600g / 1lb 5 oz jabalí o cerdo, picado", "4 filetes de anchoa, finamente picados", "100g / 3½oz de pan rallado", "1 huevo de gallinas camperas", "50ml / 2fl oz de leche o crema individual", "½ cucharadita de pimienta de Jamaica", "¼ cucharadita de nuez moscada", "sal y pimienta recién molida", "25g / 1oz de mantequilla", "25 g / 1 oz de harina", "100ml / 3½fl oz de vino blanco", "500ml / 18fl oz de caldo de carne", "2 cucharadas de crema individual", "1 cucharada de mermelada de arándanos rojos o jalea de grosella", "algunas ramitas de eneldo, finamente picadas"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para las albóndigas, caliente el aceite en una sartén y saltee la cebolla hasta que quede suave y translúcida. Agregue el ajo y saltee por un minuto más. Retirar del fuego y dejar enfriar.", "Coloque todos los ingredientes de la albóndiga, incluida la cebolla cocida y el ajo, en un tazón grande y mezcle bien con las manos. Forme la mezcla en bolas en algún lugar entre el tamaño de una nuez y una pelota de golf, deben tener un peso de alrededor de 40 g / 1½ oz. Deberías terminar con alrededor de 24 albóndigas. Coloque las bolas en una bandeja para hornear y hornee por 12-15 minutos hasta que estén cocidas.", "Para hacer la salsa, derrita la mantequilla en una olla lo suficientemente grande como para sostener las albóndigas. Agregue la harina y revuelva durante 5-10 minutos hasta que la harina y la mantequilla se combinen en un roux y se tornen doradas. Agregue el vino blanco y revuelva vigorosamente hasta que esté bien incorporado, luego agregue gradualmente todo el caldo de carne, revolviendo a fondo entre cada adición para evitar grumos, hasta que tenga una salsa ligeramente espesa. Agregue la crema y el atasco, y mezcle para combinar. Condimentar con sal y pimienta.", "Retire las albóndigas del horno y coloque en la bandeja de la salsa. Cocine a fuego lento durante 5-10 minutos para permitir que los sabores se combinen. Sirva con una pizca de eneldo, más mermelada en el lado y un montón de puré de patatas."], "url": "www_bbc_co_uk_food_recipes_swedish_meatballs_with_84586", "title": "Albóndigas suecas con salsa de crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedish_meatballs_with_84586_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de hilos de azafrán", "250ml / 9fl oz de leche tibia", "500g / 1lb 2oz de harina blanca fuerte", "Bolsa de 7g / ¼ oz de levadura seca de acción rápida", "1 cucharadita de sal", "50g / 1¾oz de azúcar en polvo de oro", "50 g / 1¾oz de mantequilla sin sal, derretida", "Queso Quark 100g / 3½oz", "1 yema de huevo de gallinas camperas", "puñado de pasas"], "method": ["Engrase una bandeja para hornear. Remoje el azafrán en la leche durante 5-10 minutos.", "Combina la harina, la levadura, la sal y el azúcar en un recipiente para mezclar y haz un pozo en el centro. Revuelva la mantequilla derretida en la mezcla de leche y azafrán y vierta en el pozo. Agregue el queso Quark.", "Revuelva juntos brevemente, luego junte como una masa. Amasar sobre una superficie enharinada durante 10 minutos, o hasta que quede suave. Coloque en un tazón engrasado, cubra con film transparente engrasado y deje en un lugar cálido durante 1½-2 horas hasta que esté bien levantado.", "Precalentar el horno a 220C / 425F / Gas 7.", "Rechace la masa y divídala en 12 pedazos. Ruede cada uno en un rectángulo de aproximadamente 20 cm / 8 pulgadas de largo. Gire cada una en forma de \"S\" lo más apretado posible. Coloque en la bandeja para hornear preparada y cúbrala sin apretar. Deja durante 30-45 minutos o hasta que se hinche.", "Cepille los rollos con la yema de huevo, luego coloque una pasa en el centro de cada círculo (dos pasas por rollo).", "Hornee los rollos por 15 minutos, luego retírelos del horno y déjelos a un lado para que se enfríen en una rejilla."], "url": "www_bbc_co_uk_food_recipes_swedishluciarollsors_73214", "title": "Rollos suecos de Lucia", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 rollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedishluciarollsors_73214_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla española, finamente picada", "½ cucharadita de orégano seco", "¼ cucharadita de sal de apio", "pizca de comino", "500 g / 1lb 2 oz de carne picada de cerdo", "1 yema de huevo de gallinas camperas", "1 cucharada de harina normal, más extra para quitar el polvo", "1 cucharadita de mostaza", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo fresco, triturado hasta formar una pasta en una mano de mortero", "Passata de 250 ml / 9 fl oz (tomates prensados ​​y picados)", "sal y pimienta negra recién molida", "queso duro (como gruyère, emmental o cheddar), rallado"], "method": ["Para las albóndigas, coloque una cucharada de aceite en una sartén a fuego medio. Agregue las cebollas y fría por 2-3 minutos, hasta que estén suaves.", "Agregue el orégano, la sal de apio y el comino y mezcle bien. Retirar del fuego y dejar enfriar.", "Coloque la carne en un tazón grande. Agregue las cebollas condimentadas cocidas, la yema de huevo, la harina y la mostaza. Mezcle bien con las manos enharinadas y sazone con sal y pimienta negra recién molida.", "Polvo una tabla de cortar con harina. Enrolla la mezcla de carne picada en pequeñas bolas del tamaño de una nuez.", "Calentar otra cucharada de aceite en una sartén grande. Agregue las albóndigas y fría a fuego moderado durante cinco minutos, doblándolas para que se doren uniformemente.", "Con cuidado, corte una albóndiga para verificar que estén bien cocidas: la carne debe ser de color marrón, no rosada, hasta el medio.", "Retire las albóndigas de la sartén, colóquelas en un plato para servir y manténgase caliente.", "Para hacer la salsa de tomate, caliente el aceite de oliva en una cacerola a fuego lento. Agregue el ajo machacado y fría por 1 minuto para ablandarlo.", "Agregue la passata en la cacerola, aumente el fuego y hierva. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca la salsa sobre las albóndigas y termina con el queso rallado de tu elección."], "url": "www_bbc_co_uk_food_recipes_swedishstyleminimeat_83684", "title": "Mini albóndigas al estilo sueco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedishstyleminimeat_83684_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de jerez seco", "1 cucharada de salsa de soja ligera", "1 cucharada de aceite de sésamo", "pizca de sal", "Pavo sobrante cocido de 450g / 1lb, cortado en cubos de 2cm / ¾in", "aceite vegetal, para freír", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de harina de maíz, más extra para quitar el polvo", "150ml / ¼ pinta de caldo de pollo", "1 cucharada de salsa de soja oscura", "1 cucharada de aceite de sésamo", "1 cucharada de vinagre de sidra", "2 cucharadas de ketchup de tomate", "2 pimientos verdes, tallo y semillas retirados, cortados en piezas de 2cm / ¾in", "4 cebolletas, recortadas, cortadas en longitudes de 2cm / ¾in", "1 cucharada de jugo de un satsuma", "1 cucharada de harina de maíz", "2 cucharadas de aceite vegetal", "300g / 10½oz de arroz basmati cocido, enfriado a temperatura ambiente", "2 huevos de gallinas camperas, golpeados", "4 cebolletas, cortadas, picadas", "4 cucharadas de salsa de soja"], "method": ["Para el pavo, en un tazón, mezcle el jerez, la salsa de soja, el aceite de sésamo y la sal hasta que estén bien combinados. Agregue el pavo cocido al adobo, revuelva bien para cubrirlo, luego cubra el recipiente y déjelo a un lado para que se mate durante al menos 20 minutos.", "Caliente la freidora a 180 ° C. Alternativamente, caliente el aceite en una cacerola profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Mientras tanto, en un bol, bata el huevo con la harina de maíz para formar una mezcla suave y reservar. Espolvorea un poco de harina de maíz en un plato.", "Retire el pavo de su adobo, sacudiendo cualquier exceso. Polvo el pavo marinado con la harina de maíz, sacudiendo cualquier exceso.", "Sumerja el pavo marinado en la mezcla, luego cuidadosamente en el aceite caliente, en lotes si es necesario, y fría durante 2-3 minutos, o hasta que la masa esté crujiente y dorada. Retire el pavo del aceite usando y déjelo a un lado para drenar en papel de cocina. Mantener caliente", "Para la salsa, hierva el caldo, la salsa de soja, el aceite de sésamo, el vinagre y el ketchup en una olla no reactiva. Agregue los pimientos y las cebollas tiernas y cocine a fuego lento durante 2 o 3 minutos, o hasta que las verduras se hayan suavizado un poco pero aún conserven su sabor crujiente.", "Mezcle el jugo de satsuma con la harina de maíz para formar una pasta suave. Verter en la salsa y llevar a ebullición. Luego reduzca y cocine a fuego lento durante 1-2 minutos, revolviendo bien, hasta que la salsa se espese.", "Mientras tanto, para el arroz frito con huevo, caliente el aceite en un wok a fuego alto. Agregue el arroz y saltee por 2-3 minutos. Agregue el huevo, la cebolleta y la salsa de soja y saltee durante 2-3 minutos más.", "Justo antes de servir, mezcle el pavo con la salsa agridulce.", "Para servir, cuchara el arroz frito con huevo en tazones para servir y cubra con el pavo agridulce."], "url": "www_bbc_co_uk_food_recipes_sweet-and-sour_turkey_59017", "title": "Pavo agridulce con arroz frito con huevo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 maracuyá", "2 limas", "1 naranja", "1 vaina de vainilla", "4 filetes de lubina", "1 chile rojo", "1 chile amarillo", "cebollino pequeño puñado", "pequeño cilantro puñado"], "method": ["Exprime el jugo de la fruta de la pasión, las semillas y todo, las limas y la naranja en un tazón. Raspe las semillas de una vaina de vainilla y mezcle bien.", "Cortar la lubina en finas astillas y disponer ordenadamente en un plato grande. Vierta sobre el jugo, casi sumergiendo el pescado. Esparce sobre rebanadas de chiles rojos y amarillos y cubre el plato con un trozo de película de cocina. La lubina en realidad va a ser 'cocida' por la acidez del aderezo, así que déjela en la nevera durante al menos una hora o incluso durante la noche.", "Cuando esté listo para servir, agregue cebollines finamente picados y recoja algunas hojas de cilantro para terminar."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sharp_sea_bass_02350", "title": "Lubina dulce y aguda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sharp_sea_bass_02350_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ piña pequeña", "2 pechugas de pollo deshuesadas y sin piel", "2 cucharadas de aceite de girasol", "1 cebolla, cortada en cuñas", "1 pimiento rojo, sin semillas y picado", "1 pimiento verde, sin semillas y picado", "1 cucharada de harina de maíz", "4 cebolletas, cortadas y cortadas en diagonal", "1 cucharada de harina de maíz", "300ml / 10fl oz de jugo de piña fresca", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz de 25g / 1oz, pelado y rallado fino", "1 cucharada de salsa de soja oscura", "2 cucharadas de vinagre de vino blanco", "2 cucharadas de azúcar moreno claro", "3 cucharadas de ketchup de tomate", "1 pizca de hojuelas de chile seco", "pimienta negra recién molida"], "method": ["Para hacer la salsa, ponga la harina de maíz en un tazón pequeño y agregue dos cucharadas de jugo de piña hasta que quede suave. Ponga el jugo de piña restante en un recipiente aparte y agregue el ajo, el jengibre, la soja, el vinagre, el azúcar, el ketchup y las hojuelas de chile hasta que estén bien combinados. Dejar de lado.", "Pon la piña en una tabla y corta la piel. Cuarto a lo largo y eliminar el núcleo central resistente. Cortar la piña en rodajas gruesas y reservar. Corte cada pechuga de pollo en 7-9 piezas iguales (según el tamaño).", "Caliente el aceite en una sartén antiadherente grande o wok y saltee la cebolla y los pimientos durante tres minutos a fuego alto. Cubra el pollo en la harina de maíz y agregue a la sartén. Revuelva-fríe durante cuatro minutos hasta que esté ligeramente coloreado por todos lados.", "Agregue la piña y la salsa agridulce a la sartén con el pollo y deje hervir a fuego medio. Cocine durante 4-5 minutos, revolviendo regularmente hasta que el pollo esté cocido y la piña esté caliente.", "Agregue la mezcla de harina de maíz y piña y cocine por 30-60 segundos hasta que la salsa esté espesa y brillante, volteando el pollo y las verduras hasta que estén bien cubiertas. Espolvorear con cebolletas en rodajas y servir caliente."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_00397", "title": "Pollo agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_chicken_00397_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 425 g / 15 oz pueden trocear piña en jugo natural", "2 cucharadas de harina de maíz", "2 cucharadas de salsa de soja oscura", "2 cucharadas de vinagre de vino blanco", "2 cucharadas de azúcar moreno claro", "2 cucharadas de ketchup de tomate", "½ cucharadita de hojuelas de chile seco", "2 pechugas de pollo deshuesadas y sin piel", "2 cucharadas de aceite de girasol", "1 cebolla mediana, cortada en 12 cuñas", "2 pimientos, rojo, verde, naranja o amarillo, sin semillas y cortados en trozos de aproximadamente 3 cm / 1¼ pulgadas", "1 x 225 g / 8oz puede castañas de agua", "2 dientes de ajo, pelados y triturados", "Jengibre fresco de la raíz de 25g / 1oz, pelado y rallado fino", "pimienta negra recién molida"], "method": ["Para hacer la salsa, escurra la piña en un colador sobre un tazón y guarde todo el jugo; debe tener aproximadamente 150 ml / 5 fl oz. Ponga la harina de maíz en un tazón grande y agregue tres cucharadas de jugo de piña para hacer una pasta suave. Agregue el jugo restante y 150ml / 5fl de agua, agregue la salsa de soya, el vinagre, el azúcar, el ketchup y las hojuelas de chile hasta que estén bien combinados. Dejar de lado.", "Corta cada pechuga de pollo en ocho o nueve piezas iguales. Caliente una cucharada de aceite en una sartén antiadherente grande o wok y saltee la cebolla y los pimientos durante dos minutos a fuego alto. Escurrir las castañas de agua y cortarlas por la mitad horizontalmente.", "Agregue el aceite restante y el pollo a la sartén y saltee durante dos minutos hasta que se coloreen por todos lados. Agregue el ajo, el jengibre, los trozos de piña y las castañas de agua y saltee durante 30-60 segundos.", "Mezcle bien la mezcla de harina de maíz y piña y agréguela a la sartén con el pollo y las verduras. Revuelva bien, sazone con un poco de pimienta negra molida y cocine a fuego lento. Cocine por 4-6 minutos hasta que la salsa esté espesa y brillante y el pollo esté tierno y cocinado por completo, volteando el pollo y las verduras unas cuantas veces. Sirve con una pequeña porción de arroz."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_52908", "title": "Pollo agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_chicken_52908_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800 g / 1 libra de pechuga de pollo de 12 oz, sin piel", "aceite de girasol, para freír", "1 cucharadita de sal", "1½ cucharadita de pimienta blanca molida", "1-2 cucharadas de jugo de jengibre fresco", "1-2 cucharadas de vinagre de sidra o vino de arroz", "2-3 cucharadas de harina de maíz", "2-3 cucharadas de fécula de patata", "2 huevos de gallinas camperas, dependiendo de la mezcla, es posible que necesite más", "2 cucharadas de aceite", "2-3 cebollas de primavera, cortadas diagonalmente", "1-2 pimientos verdes, cortados en cuadrados pequeños", "1 zanahoria pequeña, en rodajas finas en diagonal", "1 cucharada de jengibre fresco de raíz picado", "½ pepino, sin corazón, cortado a la mitad y rebanado diagonalmente", "2 rodajas de piña en conserva, cortadas en trozos", "400ml / 14fl oz de caldo de pollo", "3 cucharadas de harina de maíz", "2-3 cucharadas de azúcar en polvo", "100ml / 3½fl oz de sidra o vinagre de arroz", "2 cucharadas de puré de tomate", "1-2 cebollas, cortadas en cuadrados pequeños", "1-2 tomates firmes, pulpa extraída y carne cortada en pequeños cuadrados", "puñado de hojas frescas de cilantro (opcional)", "sal y pimienta negra recién molida", "2 cucharadas de aceite", "400g / 14oz de arroz basmati cocido y enfriado", "3 huevos de gallinas camperas, golpeados", "2 cucharadas de salsa de soja ligera", "4 cebolletas, picadas"], "method": ["Primero prepare el pollo, tritúrelo ligeramente en trozos de 3-4 mm de grosor y colóquelo en un recipiente (esto es más fácil si semi-congela primero la pechuga de pollo). Alternativamente, corte el pollo en cubos de 1cm / ½.", "Calentar el aceite en un wok grande. Mezcle el resto de los ingredientes de pollo con el pollo hasta que el pollo esté bien cubierto con la mezcla. Cuando el aceite esté caliente, fría el pollo a fuego muy alto en lotes para evitar que las piezas se agrupen. Esto solo tomará un minuto aproximadamente si se usan cubos de pollo, incluso menos si se usa triturado. Coloque el pollo cocido en un plato forrado con papel de cocina y déjelo a un lado.", "Para hacer la salsa, caliente el aceite en una olla. Cuando esté caliente, agregue las cebolletas, los pimientos, la zanahoria y el jengibre, manteniendo el fuego alto y revolviendo lentamente. Cuando los pimientos comiencen a dorarse, mezcle el pepino y la piña, luego agregue el caldo.", "Mezcle la harina de maíz con un poco de agua para hacer una pasta. Cuando el caldo hierva, agregue el azúcar, el vinagre, el puré de tomate, la cebolla y el tomate. Una vez que el líquido hierva, vierta suavemente la pasta de harina de maíz y revuelva continuamente hasta que el líquido se espese. Verifique el condimento nuevamente y retírelo del fuego. Agregue las hojas de cilantro, si las usa.", "Para el arroz, caliente un wok y una vez caliente agregue el aceite. Agregue el arroz y cocine durante 1-2 minutos. Agregue los huevos y la salsa de soja y cocine durante 3-4 minutos o hasta que el arroz esté bien caliente. Termine con sal y pimienta, pero recuerde que no mucha sal ya que la salsa de soya sazonará el plato.", "Para servir, mezcle el pollo en la salsa. Agregue el arroz en un tazón pequeño y colóquelo en cada plato para hacer una buena cantidad de arroz. Arregle el curry alrededor del exterior y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_54545", "title": "Pollo agridulce con arroz frito con huevo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina de maíz", "1 cola de rape, carne extraída y cortada en trozos de 2cm / 1in", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "Trozos de piña 125g / 4½oz, en jugo (escurrido)", "125ml / 4fl oz de jugo de piña", "2 cucharadas de salsa de soja ligera", "3 limas, solo jugo", "25ml / 1fl oz vino de arroz Shaoxing", "1 chile rojo, picado", "2 cm / 1 en pieza de jengibre fresco, rallado", "4 cebolletas, picadas", "6 hojas exteriores Col de Saboya", "½ cucharadita de azúcar moreno", "½ cucharadita de sal marina", "8 huevas de vieira secas, para adornar"], "method": ["Para el rape agridulce, coloque la harina de maíz en un recipiente, agregue el rape y sazone con sal y pimienta.", "Caliente un wok y agregue una cucharada de aceite. Una vez caliente, agregue el rape y cocine hasta que esté crujiente por todos lados. Retire y coloque en papel de cocina.", "Coloque los trozos de piña, el jugo, la soja, el jugo de lima y el vino de arroz en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Agregue el resto del aceite al wok con el jengibre y casi todos los ajíes y las cebolletas y cocine por 1-2 minutos.", "Agregue la mezcla de piña mezclada al wok y cocine durante dos minutos.", "Agregue el rape de vuelta a la sartén y revuelva.", "Para la col frita, caliente una freidora a 160C / 320F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Retire los tallos de las hojas de repollo y triture finamente las hojas.", "Freír el repollo rallado en la freidora por un minuto, sacar con una espumadera y escurrir sobre papel de cocina. Sazonar con el azúcar y la sal.", "Para servir, coloque el rape agridulce en un recipiente para servir poco profundo y la col frita en la parte superior. Afeite las huevas de vieiras secas en la parte superior de la col con cebolletas y chile."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_monkfish_38590", "title": "Rape agridulce con repollo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo de 450g / 1lb, cortado en cubos de 2cm / ¾in", "1 cucharada de jerez seco", "1 cucharada de salsa de soja ligera", "1 cucharada de aceite de sésamo", "pizca de cinco especias china", "aceite vegetal, para freír", "1 huevo, golpeado", "4 cucharadas de harina de maíz", "150ml / 5fl oz de caldo de pollo", "1 cucharada de salsa de soja oscura", "1 cucharada de aceite de semilla de sésamo", "1 cucharada de vinagre de sidra", "2 cucharadas de ketchup de tomate", "1 pimiento rojo, cortado en cubos de 2cm / ¾in", "1 pimiento verde, cortado en cubos de 2cm / ¾in", "4 cebolletas, cortadas en palitos de 2cm / ¾in", "1 cucharada de harina de maíz", "1 cucharada de jugo de naranja", "sal y pimienta recién molida", "2 bok choi, tallos eliminados, hojas finamente trituradas", "1 cucharadita de azúcar", "1 cucharadita de sal", "arroz basmati cocido, para servir"], "method": ["En un tazón, mezcle el cerdo con el jerez seco, salsa de soja, aceite de sésamo, cinco especias y una pizca de sal. Deje marinar en la nevera durante 20 minutos.", "Llene una freidora o una sartén grande, profunda y de fondo grueso medio llena de aceite vegetal. Caliéntelo a 180 ° C (hasta que la miga de pan chisporrotee y se ponga marrón cuando se deja caer en el aceite). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un plato poco profundo, mezcle el huevo con 2 cucharadas de harina de maíz. Pon el resto de la harina de maíz en un plato aparte. Sumerja la carne de cerdo en la harina de maíz seca, sacuda el exceso, luego cubra con la mezcla de huevo.", "Baje cuidadosamente en el aceite caliente. Tenga cuidado de no freír demasiados a la vez. Cuando esté dorado, quítelo y escurra sobre papel de cocina.", "Para la salsa, ponga el caldo, la salsa de soja, el aceite de sésamo, el vinagre y el ketchup en una sartén y deje que hierva. Agregue los pimientos y las cebolletas, cocine a fuego lento durante 2 minutos.", "Mezcle la harina de maíz con el jugo de naranja y agregue a la sartén para espesar la salsa. Llevar a ebullición y luego cocine a fuego lento hasta que espese.", "Agregue el cerdo, mezcle bien por un minuto.", "Para las algas marinas, freír las hojas picadas durante 1-2 minutos hasta que estén verdes y crujientes. Escurrir en un plato con el rollo de cocina y sazonar con azúcar y sal.", "Para servir, coloca el cerdo agridulce en un plato para servir poco profundo con las algas crujientes en la parte superior y el arroz en un tazón para servir por separado."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_17770", "title": "Cerdo agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]