[{"ingredients": ["4 calamares medianos, limpios y cortados en anillos gruesos de 5 mm / ¼", "Harina normal de 75g / 3oz", "sal y pimienta negra recién molida", "2 huevos, golpeados", "Panco de 75g / 3oz o pan rallado japonés", "1 lima, segmentada", "3 cucharadas de berro de coriandro", "2 cucharadas de berro de amaranto rojo", "2 huevos, solo yemas", "½ cucharadita de sal marina", "1 pizca de pimienta blanca", "2 cucharaditas de vinagre de vino de arroz", "4 cucharaditas de salsa de chile picante", "2 cucharaditas Yuzuji", "200ml / 7fl oz de aceite vegetal", "Hoja china de 200g / 7oz, finamente triturada", "½ cebolla roja, muy finamente rebanada", "2 cucharadas de menta muy finamente triturada", "2 cucharadas de vinagre de vino de arroz", "1 cucharada de aceite de sésamo tostado", "2 cucharadas de aceite vegetal", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para el calamar, caliente una freidora a 190C / 375F. Alternativamente, caliente el aceite vegetal en una sartén de fondo grueso y pesada, hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sazone la harina con sal y pimienta negra.", "Dragar los anillos de calamar con la harina sazonada, cubriéndola completamente.", "Sumerja los anillos de calamar enharinados en los huevos batidos y luego directamente en las migas de pan para cubrir.", "Baje unos cuantos aros de calamar a la freidora o aceite caliente, y cocine por dos minutos hasta que estén dorados y crujientes.", "Retire los anillos de calamar del aceite caliente con una cuchara ranurada y escurrir sobre papel de cocina.", "Para el aderezo Ponzu cremoso, coloque todos los ingredientes, excepto el aceite vegetal, en un pequeño procesador de alimentos y mezcle hasta obtener un puré.", "Agregue gradualmente el aceite vegetal hasta que se forme una mayonesa fina.", "Controle el condimento y agregue más jugo de yuzu si lo desea.", "Para la ensalada de hojas china, mezcle la hoja china, la cebolla roja y la menta en un tazón.", "Batir el vinagre de vino de arroz, el sésamo y los aceites vegetales junto con el zumo de lima y sazonar al gusto.", "Vierta el aderezo sobre las hojas y mezcle bien.", "Para servir, apile el calamar en un plato y rocíe sobre el cremoso aderezo ponzu y luego apile la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_crisp_breadcrumbed_squid_24534", "title": "Calamares crujientes con migas de pan con aderezo ponzu cremoso y ensalada de hojas chinas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de pan rallado fino, seco", "80 g / 2 oz", "20g / ¾oz de sumaz", "1 cucharada de semillas de sésamo, ligeramente tostado", "piel de pollo, de 1 pollo", "sal marina escamosa, al gusto", "50g / 1¾oz de sal fina", "1 cucharadita de pimentón dulce ahumado", "1 pollo mediano, articulado", "1-2 cucharadas de aceite de oliva extra virgen", "330g / 11½ oz de azúcar de palma (azúcar moreno)", "15 dientes de ajo, finamente picados", "3 chiles rojos, finamente picados", "Pasta de pimiento picante 50 g / 1¾ oz, disponible en tiendas especializadas y de Oriente Medio (opcional)", "165ml / 5½fl oz de vinagre de sidra", "2 yemas de huevo grandes de gallinas camperas", "½ cucharadita de mostaza Dijon", "25ml / ¾fl oz de vinagre de sidra", "300 ml / 10 fl oz de aceite de girasol", "exprimir jugo de lima", "1 pepino de lima tbsp colmado", "1 lima, cortada en cuñas"], "method": ["Quita toda la piel de las piezas de pollo, excepto las alas. Poner en una bandeja para hornear y cocinar por aproximadamente 40-50 minutos o hasta que esté dorado y crujiente. Incline la grasa fuera de la bandeja unas cuantas veces mientras cocina. Una vez que la piel se haya enfriado, picar finamente en trozos pequeños. Encienda el horno a 200C / 180C Fan / Gas 6.", "Para hacer la salmuera, hierva 200 ml / 7 fl oz de agua con el pimentón y la sal. Incline en un recipiente y agregue 800 ml / 1¼ de agua fría. Una vez que la salmuera esté a temperatura ambiente, colóquese sobre las piezas de pollo y colóquelas en la nevera durante 3 horas. Después de 3 horas, enjuague el pollo con agua fría y seque.", "Para el glaseado, coloque los chiles y el ajo en un procesador de alimentos y mezcle hasta obtener un puré grueso. Coloque el azúcar en una sartén a fuego medio hasta que comience a caramelizar (PRECAUCIÓN: el azúcar hirviendo está extremadamente caliente). Agregue el puré y la pasta de chile picante y cocine durante 10-20 minutos. Luego agregue el vinagre de sidra - tenga cuidado de que escupirá un poco. Cocine por 10-20 minutos o hasta que el glaseado tenga consistencia de jarabe.", "Mientras tanto, prepara la mayonesa. Mezcle las yemas de huevo en un procesador pequeño junto con la mostaza y el vinagre. Mientras el motor está funcionando muy lentamente, rocíe el aceite para formar una mayonesa. Finalmente, mezcle la salmuera y el jugo de lima y ajuste el condimento si es necesario.", "Coloque las piezas de pollo en una bandeja grande para hornear bien separadas y rocíe con un poco de aceite de oliva. Cocine en el horno por aproximadamente 30 minutos, estamos buscando cocinar el pollo dos tercios del camino a través.", "Retire el pollo del horno y cuele generosamente el glaseado sobre todas las piezas, use aproximadamente la mitad del glaseado. Vuelva a colocar en el horno durante 5 minutos. Saca y repite el proceso.", "Mientras tanto, haga la migaja, combine todos los ingredientes y colóquelos en una bandeja.", "Una vez que el pollo esté bien cocido y bien glaseado, salga del horno. Cubra el pollo en la miga. Sirva con la mayonesa de lima en un lado y las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_crisp_chilli_chicken_67804", "title": "Pollo picante crujiente", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "500g / 1lb 2 oz de carne de conejo, cortada en cubos de 2cm / ¾in", "500ml / 18fl oz de suero de leche", "Harina normal de 200g / 7oz", "100 g / 3½ oz de harina de arroz", "pizca de tomillo seco", "pellizcar el orégano seco", "4 cucharadas de harina de maíz", "1 cucharadita de pimienta de cayena", "½ cucharadita de ajo en polvo", "½ cucharadita de cebolla en polvo", "1 cucharada de sal marina", "1 cucharadita de pimentón", "1 cucharadita de polvo de hornear", "2 chiles rojos, más o menos picados", "8 hojas de lima", "2 tallos de limoncillo, hojas exteriores duras retiradas, finamente picadas", "25 g / 1 oz de raíz de jengibre fresco, toscamente picado", "2 dientes de ajo, pelados, dejados enteros", "2 chalotes pequeños, toscamente picados", "4 cucharadas de salsa de pescado tailandés", "3 cucharadas de aceite de sésamo", "50ml / 2fl oz de salsa de soja", "2 limas, jugo y ralladura solamente", "150 g / 5½ oz de azúcar en polvo", "150g / 5½oz de maíz en conserva, peso escurrido", "2 yemas de huevo", "2 cucharaditas de vinagre de vino blanco", "1½ cucharada de mostaza Dijon", "sal y pimienta negra recién molida", "300ml / 10fl oz de aceite vegetal", "¼ de col roja, finamente rebanada", "1 zanahoria pequeña, rallada", "1 cebolla pequeña, finamente rebanada", "2 cucharadas de perejil fresco, picado"], "method": ["Para el conejo crujiente cubierto, en un recipiente de plástico o tazón, cubra las piezas de conejo con el suero de leche. Enfriar en la nevera durante 24 horas.", "Al día siguiente, coloque todos los ingredientes secos en una bolsa grande de plástico para alimentos y mezcle. Retire el conejo del suero de leche, póngalo en la bolsa con la harina sazonada y agite para cubrir.", "Caliente una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 165 ° C, o hasta que un trozo de pan se ponga dorado cuando se deja caer en el aceite. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír el conejo hasta que esté dorado y cocido. Retire con una cuchara ranurada y colóquelo en papel de cocina para drenar.", "Para la salsa de maíz dulce, mezcle todos los ingredientes, excepto el azúcar impalpable y el maíz dulce, hasta obtener un puré suave en un procesador de alimentos.", "Caliente el azúcar en una cacerola de base pesada a fuego medio bajo hasta que se derrita y forme un caramelo dorado. No revuelva y vigílelo para que no se queme.", "Una vez que el azúcar se haya caramelizado, vierta la mezcla en puré y mezcle bien. Llevar la mezcla a ebullición y agregar el maíz dulce. Reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que esté pegajoso y atascado. Retirar del fuego y reservar para enfriar un poco.", "Para la ensalada de mostaza, primero haga una mayonesa. Coloque las yemas de huevo, el vinagre de vino blanco y una cucharadita de mostaza en un procesador de alimentos y mezcle hasta que estén pálidas y cremosas.", "Con el motor en marcha, agregue el aceite, en un flujo constante y delgado, hasta que la mayonesa esté espesa (es posible que no necesite todo el aceite). Agregue la mostaza restante y revuelva.", "Coloque el repollo, la zanahoria y la cebolla en un tazón grande y agregue la mayonesa. Justo antes de servir agregue el perejil y mezcle.", "Para servir, coloque el conejo frito en platos para servir al lado del repollo. Sirva la salsa de maíz dulce en una olla pequeña al lado."], "url": "www_bbc_co_uk_food_recipes_crisp_coated_rabbit_with_61935", "title": "Conejo crujiente con salsa de maíz dulce y ensalada de mostaza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 600ml / 20fl oz", "40 g / 1½ oz de chiles anchos secos (ají mexicano suave, disponible en los supermercados más grandes), dejó todo", "1 limón, solo cáscara pelada entera", "½ cebolla, piel en", "4 dientes", "150g / 5oz de linguine", "200 g / 7 oz de parmesano, rallado", "4 dientes de ajo ahumados (disponibles en grandes supermercados), finamente picados", "2 cucharaditas de pimienta negra agrietada", "6 cucharadas de aceite de oliva", "25g / 1oz de hojas frescas de albahaca"], "method": ["Caliente la crema doble en una cacerola tapada sobre un calor suave. Agregue los chiles anchos y la cáscara de limón entera. Stud la mitad de cebolla con los clavos de olor y agregarlo a la sartén.", "Llevar la mezcla a fuego lento a fuego lento. Justo cuando comienza a burbujear, apague el fuego, cubra la olla con la tapa y déjela sobre la placa para infundir durante 30 minutos.", "Mientras tanto, cocine el linguini en una sartén de agua hirviendo con sal, según las instrucciones del paquete. Escurrir bien en un colador y reservar durante 10 minutos, hasta que la pasta cocida esté seca y pegajosa.", "En un tazón grande, mezcle el parmesano rallado, el ajo ahumado y la pimienta negra rajada hasta que estén bien combinados. Agregue el linguini, mezcle bien.", "Caliente la mitad del aceite en una sartén pequeña y antiadherente a fuego medio. Recoja la pasta y la mezcla de queso en una bola con las manos, luego presione hacia abajo en la sartén y fríe durante 3-4 minutos en cada lado, o hasta que estén crujientes y doradas por ambos lados, pero suaves en el medio.", "Cuando la salsa se haya infundido, mezcle en un procesador de alimentos con el aceite restante hasta que quede suave. Cuele a través de un colador fino, luego mezcle la albahaca con la salsa colada.", "Para servir, corta la torta de fideos en 8 porciones. Sirva en tazones con la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_crisp_noodle_cake_with_73371", "title": "Tarta de fideos crujiente con crema de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 zanahoria, más o menos picada", "1 cebolla blanca, más o menos picada", "1 hoja de laurel", "4 granos de pimienta", "1 cucharada de sal de roca", "1 pulpo (aproximadamente 2kg / 4lb 8oz), con las vísceras y el pico retirados, limpiado", "½ apio nabo, cortado en trozos grandes", "1 bulbo de hinojo (o 4 bulbos de hinojo bebé), cortado en trozos grandes, hojas reservadas en agua para la guarnición", "1 diente de ajo, aplastado", "2 cucharadas de aceite de oliva, más extra para freír", "1 ramita de tomillo", "1 manzana, pelada, partida a la mitad y sin corazón", "6-8 tentáculos de pulpo", "2 cucharadas de aceite de oliva", "1 cucharada de jugos de cocina, reservados de la guarnición (arriba)", "1 cucharada de vinagre balsámico", "2 cucharadas de aceite de oliva", "2 cucharaditas de polvo fino de regaliz, más una pizca para servir", "hojas frescas de estragón, para adornar", "sal y pimienta negra recién molida"], "method": ["Para el pulpo, ponga todos los ingredientes excepto el pulpo en una olla grande. Cubra con agua y deje que hierva antes de agregar el pulpo. Cocine a fuego lento durante aproximadamente 1 hora y media hasta que el pulpo esté tierno. Controle regularmente con la punta de un cuchillo; una vez que pueda cortar fácilmente la carne, escurra el pulpo y déjelo toda la noche en la nevera. Deseche la cabeza y el líquido.", "Para la guarnición de frutas y verduras, precaliente el horno a 180 C / 160 C Fan / Gas 4.", "Coloque el apionabo y el hinojo en una hoja de papel de cocina y sazone con sal y pimienta. Agregue el diente de ajo, el aceite de oliva y el tomillo. Envuelva en papel de aluminio y selle herméticamente. Hornee durante 20-30 minutos (dependiendo del tamaño de los trozos) o hasta que estén tiernos.", "Mientras tanto, corta cada mitad de manzana en tres porciones iguales. Calentar un chorrito de aceite en una sartén y freír las rodajas de manzana en cada lado hasta que estén doradas, pero no cocidas. Ponga a un lado hasta que esté listo para servir.", "Cuando las verduras estén cocidas, quítelas de la lámina y reserve los jugos de cocción (para usar en el aderezo).", "Para los tentáculos de pulpo, corte los tentáculos en trozos. Caliente el aceite de oliva en una sartén grande a fuego alto. Una vez que la sartén esté caliente, freír los tentáculos hasta que estén crujientes. Condimentar con sal y pimienta.", "Para el aderezo de regaliz, coloque todos los ingredientes en un tazón y agítelos para crear una vinagreta partida. Vístase con hojas de estragón y una pizca extra de polvo de regaliz.", "Para servir, divida las verduras asadas entre los platos para servir, cubra con el pulpo y termine con el aderezo y las hojas de hinojo."], "url": "www_bbc_co_uk_food_recipes_crisp_octopus_roasted_87261", "title": "Pulpo crujiente, hinojo asado y manzana con aderezo de regaliz", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5 kg / 3lb 5oz vientre de cerdo sin hueso, con corteza", "4 cucharadas de sal marina gruesa", "2 cucharadas de pimienta asada de Sichuan", "2 cucharaditas de pimienta blanca recién molida", "2 cucharadas de polvo chino de cinco especias", "1 cucharada de azúcar en polvo", "2 cucharadas de aceite vegetal", "4 cebolletas, finamente cortadas", "Mangetout de 150 g / 5½ oz, finamente cortado", "4 cabezas de bok choi, raíces removidas, hojas separadas", "1 chile rojo, sin grano y en juliana", "2 cucharadas de salsa de soja", "1 cucharada de aceite de sésamo"], "method": ["Para la barriga de cerdo crujiente, perforar el lado de la carne de cerdo con un tenedor o cuchillo afilado hasta que la piel esté cubierta con finos orificios. Inserta un gancho de carne en la carne para asegurarlo.", "Haga hervir una olla grande de agua y, usando un cucharón grande, vierta el agua caliente sobre el lado de la carne de cerdo varias veces. Esto se hace mejor suspendiendo el cerdo sobre el fregadero. Coloque el vientre de cerdo a un lado.", "Caliente un wok hasta que esté caliente, luego agregue la sal, los pimientos, el polvo de cinco especias y el azúcar y saltee la mezcla por tres minutos. Permita que la mezcla se enfríe un poco.", "Cuando la mezcla esté lo suficientemente fría como para manipularla, frótela en el lado de carne del cerdo. Cuelgue la carne para que se seque durante ocho horas o durante la noche en un lugar fresco o frente a un ventilador. Alternativamente, coloque la carne en una rejilla de alambre colocada encima de una lata de asar.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque la carne de cerdo en una rejilla de alambre, con la corteza hacia arriba, sobre una fuente de asar honda, llena aproximadamente un tercio con agua y tueste durante 20 minutos.", "Reduzca el calor a 180 ° C / 350 ° F / Gas 4 y continúe asando durante dos horas. Vuelva a encender el horno hasta 230C / 450F / Gas 8 y cocine por 15 minutos. Retire la carne del horno y permita que la carne de cerdo se enfríe.", "Para los verdes chinos, caliente un wok y agregue el aceite. Una vez caliente, agregue las cebollas de primavera cocinar durante 1-2 minutos. Agregue el mangetout, bok choi, chile y tres cucharadas de agua y cocine durante 2-3 minutos más.", "Agregue la salsa de soja y el aceite de sésamo y mezcle para cubrir las verduras.", "Para servir, esculpe la carne de cerdo en trozos del tamaño de un bocado, colóquela en un plato y sirva con los verdes chinos."], "url": "www_bbc_co_uk_food_recipes_crisp_pork_belly_with_95763", "title": "Vientre de cerdo crujiente con verduras chinas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ col roja", "1 bulbo de hinojo", "1 palo de apio", "1 manzana (afilada)", "1 limón, jugo", "8 nueces", "1 cucharada de vinagre de vino tinto", "pizca de sal", "1 cucharada de mostaza Dijon", "1 cucharada de aceite de maní", "1 cucharada de aceite de nuez", "100g / 3½oz Stilton"], "method": ["Cortar finamente la col lombarda, el hinojo y el apio y combinar en una ensaladera grande. Cortar la manzana en discos, colocar en un plato y exprimir un limón para evitar que se decolore.", "Tueste las nueces en una sartén seca durante dos minutos y déjelas a un lado.", "Para el aderezo, tomar un recipiente aparte y agregar el vinagre de vino tinto, un poco de sal, un poco de mostaza de Dijon y aceite de nuez y maní. Batirlos juntos.", "Ahora mezcle todos los componentes en una ensaladera. Revuelva sobre trozos grandes de Stilton, gotee el aderezo y sirva con algunas de las hojas verdes de la bombilla de hinojo."], "url": "www_bbc_co_uk_food_recipes_crisp_winter_slaw_58247", "title": "Ensalada de invierno crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisp_winter_slaw_58247_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "3 cucharadas de harina de auto crianza", "1 cucharadita de polvo de hornear", "50 ml / 2 fl oz de agua fría y brillante", "3 cubitos de hielo", "1 filete de lubina", "150g / 5½oz de papas nuevas, cortadas a la mitad", "4 dientes de ajo sin pelar", "1 limón, solo jugo", "2 cucharadas de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida", "cuñas de limón, para servir"], "method": ["Para el bajo, caliente el aceite en una olla grande hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: el aceite caliente es peligroso. No lo deje sin supervisión).", "Combine la harina y el polvo de hornear en un tazón y mezcle con suficiente agua para crear una mezcla del grosor de la crema doble. Agregue los cubitos de hielo y revuelva. Sumerja el filete de lubina en la mezcla y, cuando el aceite esté lo suficientemente caliente, baje cuidadosamente el pescado en el aceite y fríalo durante aproximadamente 3-4 minutos o hasta que se dore. Retire con una espumadera y escurra sobre papel de cocina.", "Para las papas nuevas, llevar las papas y los dientes de ajo a ebullición en una olla grande de agua con sal. Cocine durante aproximadamente 10-12 minutos, o hasta que las papas estén tiernas. Escurra, retire el ajo, pele y pique los dientes aproximadamente.", "En la sartén, triture suavemente las papas con un tenedor y devuelva el ajo picado a la sartén junto con el jugo de limón, el perejil picado, la sal y la pimienta negra recién molida. Revuelve para combinar.", "Para servir, coloque una cucharada de las papas en un plato para servir y coloque el pescado encima. Adorne con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_crispbatteredseabass_88163", "title": "Lubina machacada y crujiente sobre patatas nuevas finamente picadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 solla", "aceite vegetal, para freír", "cuñas de limón, para servir", "4 cucharadas de harina normal", "4 cucharadas de harina de maíz", "sal y pimienta negra recién molida", "1 botella pequeña (330 ml / 11½ fl oz) de agua mineral con gas, fría"], "method": ["Recorte, parta a la mitad y deshuese la solla (o pídale a su pescadero que la prepare para usted).", "Para la mezcla, mezcle la harina y la harina de maíz en un tazón grande. Sazonar, al gusto, con sal y pimienta negra recién molida. Poco a poco agregue suficiente agua para darle una mezcla con la consistencia de crema doble (es posible que no necesite usar toda el agua).", "Caliente el aceite en una sartén profunda y de base pesada hasta que la superficie del aceite comience a brillar. Para probar si está lo suficientemente caliente, driblee parte de la mezcla en el aceite caliente. Debería chisporrotear y dorarse. (NB: el aceite caliente puede ser muy peligroso. No lo deje desatendido).", "Cuando el aceite esté caliente, dale un batido final a la mezcla. Sumerja la solla en la mezcla, luego coloque el pescado en la sartén de aceite caliente. El pescado tardará de 3-4 minutos en crujir, dependiendo del tamaño.", "Cuando el pescado esté crujiente y dorado, retire con cuidado el pescado con una espumadera y escurra sobre papel de cocina.", "Servir caliente, con trozos de limón."], "url": "www_bbc_co_uk_food_recipes_crispfriedplaice_90189", "title": "Solla frita crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispfriedplaice_90189_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ racimo de cilantro, finamente picado", "3 cucharadas de aceite de oliva", "16 gambas cocidas, peladas pero con las colas a la izquierda", "Pastelería kadaifi de 200g / 7oz (también llamada 'kataifi', disponible en algunos delicatessen continentales y especialistas en línea)", "aceite vegetal, para freír", "1 cebolla roja pequeña, finamente picada", "2 tomates, pelados, sin semillas, finamente picados", "2 limones en conserva, solo piel, escurridos y finamente picados", "1 cucharada de pasta harissa", "½ limón, solo jugo", "½ manojo de cilantro fresco, finamente picado", "Cohete para servir"], "method": ["Para los langostinos, machaque el cilantro y el aceite de oliva juntos en un almirez y mortero hasta que la mezcla tenga la consistencia del pesto. Sumerja las gambas en el cilantro para cubrir.", "Desenreda la masa en una superficie de trabajo plana y limpia. Corta la masa en 12 piezas iguales de unos 10 cm / 4 pulgadas (mantén las piezas de repostería cubiertas después de cortarlas para evitar que se sequen). Envuelva las piezas de pastelería alrededor de las gambas.", "Caliente una freidora a 170C / 325F / Gas 3, o hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las gambas por lotes hasta que estén doradas. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y mantener en un lugar cálido hasta que esté listo para servir.", "Para la salsa, combine todos los ingredientes de la salsa. Deje reposar durante aproximadamente 15 minutos para dejar que los sabores se infundan antes de servir.", "Sirve los langostinos con la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_crispfriedprawnsinka_91391", "title": "Gambas fritas crujientes en pasta kataifi con harissa y salsa de limón en conserva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ litro de aceite vegetal caliente, para freír", "Cola de rape 150g / 5½ oz, membrana eliminada, cortada en tiras", "Harina 100g / 3½ oz de levante automático, más extra para quitar el polvo", "Una pizca de sal marina", "200 ml / 7 fl oz de agua con gas refrigerada", "2 cucharadas de semillas de sésamo", "100 g / 3½ oz de tomates frescos de ciruela, picados", "¼ de cebolla, finamente picada", "1 lima, solo jugo", "½ chile rojo fresco, picado", "2 cucharadas de cilantro fresco picado", "2 cucharadas de aceite de oliva", "1 cucharada de aceite vegetal", "55 g / 2 oz okra, en rodajas", "2 cucharaditas de aceite de sésamo", "sal y pimienta negra recién molida", "puñado de cebolletas frescas, picadas, para adornar"], "method": ["Para el rape frito crujiente, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un tazón, mezcle la harina y la sal que se levante con suficiente agua fría para hacer una masa espesa. Agregue las semillas de sésamo.", "Espolvoree que el rape se pele con un poco de harina y sacuda el exceso, luego sumérjalo en la masa. Coloque con cuidado el rape en el aceite caliente y fríalo durante 3-4 minutos, o hasta que esté crujiente y dorado. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa, mezcle todos los ingredientes de la salsa en un tazón pequeño.", "Para la okra, caliente el aceite vegetal en una sartén, agregue la okra y fría por 1-2 minutos. Agregue el aceite de sésamo y la sal y la pimienta negra recién molida, al gusto, y fría por un minuto.", "Para servir, amontone la salsa de tomate en un plato de servir. Cubra con el rape frito crujiente y coloque el quimbombó en el lado. Adorne con cebollino y sirva."], "url": "www_bbc_co_uk_food_recipes_crispfriedmonkfishwi_88087", "title": "Rape frito crujiente con chile salsa de tomate y okra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de queso de cabra, cortado en cuatro rondas", "½ cebolla, finamente rebanada", "1 tomate, picado", "1 cilantro fresco pequeño puñado, picado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta. Cuando esté caliente, coloque las rodajas de queso en una bandeja para hornear y ase a la parrilla durante 1-2 minutos en cada lado, o hasta que estén doradas y crujientes en ambos lados.", "Mezcle la cebolla, el tomate y el cilantro en un tazón, rocíe el aceite de oliva y sazone con sal y pimienta negra recién molida. Mezcle bien para cubrir el aceite.", "Para servir, coloque la ensalada en el medio de un plato de servir y organice las crujientes rondas de queso de cabra en la parte superior."], "url": "www_bbc_co_uk_food_recipes_crispgoatscheeseherb_90709", "title": "Ensalada de queso, hierba y tomate de cabra crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal, para freír", "Fideos 125g / 4½ oz", "gran puñado mezclado de hierbas frescas, incluyendo perejil, albahaca, cilantro, perifollo, picado", "2 cucharadas de vinagre balsámico", "pizca de sal", "1 guindilla, sin semillas, picada", "2 cucharadas de semillas de sésamo, tostadas"], "method": ["Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los tallarines en una olla grande de agua salada hirviendo y cocínelos hasta que estén al dente. Escurrir bien y dejar enfriar durante cinco minutos.", "Con cuidado, coloque la pasta en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina. Repita hasta que toda la pasta se haya frito.", "Coloque la pasta frita en un tazón. Agregue las hierbas, el vinagre balsámico, la sal, el chile y las semillas de sésamo al bol y mezcle bien.", "Para servir, coloca la ensalada en un plato grande."], "url": "www_bbc_co_uk_food_recipes_crispnoodlesaladwith_85288", "title": "Ensalada de fideos crujiente con hierbas, ají y semillas de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 suela de limón", "aceite vegetal, para freír", "50-75 g / 2-3 oz de fécula de patata", "1 cucharadita de chile verde, picado", "1 cucharadita de chile rojo, picado", "1 cucharadita de jengibre, picado", "½ cucharadita de ajo, picado", "2 cucharaditas de cilantro fresco tostado", "1 cucharadita de semillas de sésamo negro", "1 cucharadita de mostaza Dijon", "1 cucharadita de aceite de sésamo", "50ml / 2fl oz de salsa de soja", "½ limón, solo jugo", "5 cucharadas de aceite vegetal", "2 limones, solo cáscara", "2 tsp yukari seasoning (disponible en tiendas especializadas japonesas)", "2 chiles verdes, rebanados en anillos", "4 ramitas de cilantro, solo hojas"], "method": ["Para el pescado, escale, limpie y filetee la suela (o puede pedirle a su pescadero que haga esto por usted). Limpie el esqueleto, luego corte por la mitad a lo largo, manteniendo la columna vertebral intacta en la mitad. Deseche la mitad del esqueleto sin la espina dorsal. Usando un cuchillo afilado, cubra los filetes de la suela y corte cada filete en pedazos del tamaño de un bocado. Dejar de lado.", "Caliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Para el adobo y la salsa de inmersión, coloque el chile verde, chile rojo, jengibre, ajo, cilantro, semillas de sésamo, mostaza, aceite de sésamo, soja y jugo de limón en un tazón y bata para combinar.", "Caliente el aceite vegetal a fuego alto hasta que fume. Vierta el aceite caliente en el tazón y revuelva: la salsa debe salpicar un poco cuando se agrega el aceite, así que tenga cuidado.", "Vierta la mitad de la salsa en un plato poco reactivo y deje el resto a un lado. Coloque las únicas piezas con la salsa en el plato y deje macerar durante 15 minutos.", "Mientras tanto, espolvorea el único esqueleto con un poco del almidón de papa.", "Presione el único esqueleto entre un cucharón y un recipiente de metal o un segundo cucharón para doblarlo, y colóquelo cuidadosamente en el aceite caliente para cocinar durante 2 a 3 minutos. A medida que se cocina y se endurece, debe formar una forma de tazón áspero. Retire la suela del aceite caliente con una cuchara grande ranurada. Escurrir sobre papel de cocina.", "Levante la planta del adobo y cubra las piezas de manera uniforme con el almidón de papa restante. Agite para eliminar el exceso de harina, luego colóquelo en la freidora y fríalo por 2-3 minutos, o hasta que esté ligeramente dorado. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, acomode las piezas de pescado en el esqueleto de la suela curva y utilícelas como un tazón para servir. Espolvorear con ralladura de limón fresco, aderezo yukari, rodajas de chile verde fresco y hojas de cilantro. Sirve con el pequeño tazón de salsa."], "url": "www_bbc_co_uk_food_recipes_crisplemonsolewithch_91060", "title": "Suela de limón crujiente con chile, sésamo y soja", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cohete 55g / 2oz", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "½ cebolla roja, finamente rebanada", "1 cucharadita de azúcar moreno"], "method": ["Coloque las hojas del cohete en un recipiente con media cucharada de aceite de oliva y el jugo de limón y mezcle bien.", "Caliente el aceite de oliva restante en una sartén pequeña y fría la cebolla con el azúcar hasta que quede crujiente y caramelizado.", "Para servir, coloque el cohete vestido en un plato de servir y cubra con la cebolla."], "url": "www_bbc_co_uk_food_recipes_crisponionandrockets_87238", "title": "Cebolla crujiente y ensalada de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "50g-150g / 2oz-5½oz Chinese five spice powder, para dragado", "sal y pimienta negra recién molida", "400g / 14oz de champiñones frescos de ostra, limpiados y enjuagados a fondo, secados, rasgados", "aceite vegetal, para freír", "1 chile rojo, sin semillas, finamente picado", "1 estrella de anís", "1 cucharadita de jengibre molido", "100ml / 3½fl oz de vinagre de arroz", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½fl oz de aceite de oliva", "Ciruelas frescas de 200 g / 7 oz, sin piedras, finamente picadas", "Hojas de berro de 250g / 9oz", "1 pepino, cortado por la mitad a lo largo, semillas recogidas con una cuchara, picadas en porras de aproximadamente 7.5cm / 3pulgadas de largo", "1 cucharada de jengibre rosado encurtido (disponible en algunos supermercados asiáticos), para servir"], "method": ["Para los champiñones, mezcle la harina y el polvo chino de cinco especias en un recipiente hasta que estén bien combinados. Sazone con una pizca de sal, o al gusto.", "Seca las setas de ostra en la mezcla de especias hasta que estén completamente cubiertas.", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Con cuidado, baje los champiñones cubiertos en el aceite y fríalos durante 4-5 minutos, o hasta que estén crujientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Mantener caliente", "Para el aderezo, caliente el chile, el anís estrellado, el jengibre, el vinagre de arroz y el azúcar en una sartén hasta que estén hirviendo a fuego lento. Continúe cocinando durante 4-5 minutos o hasta que la mezcla se parezca al jarabe.", "Retire la sartén del fuego y déjela a un lado hasta que se enfríe, luego bata el aceite hasta que esté bien incorporado en la mezcla. Agregue las ciruelas picadas hasta que estén cubiertas con la mezcla.", "Revuelva el berro y el pepino en la mezcla de aderezo hasta que se cubra con el aderezo.", "Para servir, divida la ensalada vestida por igual entre cuatro platos para servir. Espolvorea sobre el jengibre en escabeche. Cuchara sobre los champiñones crujientes. Rocíe sobre el aderezo restante."], "url": "www_bbc_co_uk_food_recipes_crispoystermushrooms_92752", "title": "Ensalada de hongos ostra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de arroz basmati", "200ml / 7fl oz de caldo de pollo", "2 cucharadas de aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, finamente picado", "½ salchichón pequeño de chorizo, finamente picado", "1 muslo de pollo, hueso retirado", "sal y pimienta negra recién molida", "pimentón ahumado, al polvo", "1 naranja, jugo y ralladura solamente", "1 ramita de tomillo fresco, picado", "albahaca fresca, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una sartén grande, cocine a fuego lento el arroz en el caldo de pollo hasta que esté cocido. Drene cualquier exceso de líquido.", "Calentar una cucharada de aceite en una sartén y freír la cebolla y el ajo hasta que se ablanden. Agregue el chorizo ​​picado y freír suavemente durante 3-4 minutos más.", "Agregue el arroz cocido a la sartén y revuelva para cubrir los jugos.", "Mientras tanto, caliente el aceite restante en una sartén a prueba de horno, sazone bien el muslo de pollo con sal y pimienta negra recién molida y polvo con pimentón ahumado. Abra el muslo de pollo para que quede plano, luego fría hasta que se dore por todos lados. Transfiera al horno y tueste durante 7-10 minutos, o hasta que esté completamente cocido.", "Retire del horno, coloque el pollo a un lado y coloque la sartén en el fuego. Agregue el jugo de naranja y la ralladura y el tomillo fresco picado y cocine a fuego lento durante 3-4 minutos, o hasta que estén pegajosos. Regrese el pollo cocido a la sartén para cubrir la salsa. Rebana en tres o cuatro piezas en diagonal.", "Para servir, apile el arroz en el centro de un plato para servir y coloque el pollo encima. Adorne con albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_crisppaprikachickeno_88445", "title": "Paprika crujiente de pollo sobre arroz al chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisppaprikachickeno_88445_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 lonchas de panceta, picadas", "gran cantidad de hierbas frescas, como perejil, albahaca, menta, cilantro", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Calienta la mitad del aceite de oliva en una sartén y freír los pedazos de panceta hasta que estén crujientes y dorados. Retire de la sartén y escurra sobre papel de cocina.", "Coloque las hierbas en un recipiente y rocíe sobre el vinagre y el aceite de oliva restante. Sazonar con sal y pimienta negra recién molida y revuelva para cubrir las hierbas.", "Para servir, espolvorea la panceta crujiente sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_crisppancettaandherb_85535", "title": "Ensalada pancetta y hierba crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "3 poddadoms crudos", "dash aceite de oliva", "½ cebolla, pelada, finamente picada", "1 diente de ajo, finamente picado", "1 tomate fresco, picado", "1 cucharadita de azúcar morena suave", "pizca de copos de chile", "2 cucharaditas de vinagre de vino tinto", "1 cucharada de cada albahaca fresca picada, menta y cilantro", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "150 g / 5½ oz de espinaca para bebés", "sal y pimienta negra recién molida"], "method": ["Para los poppadom crujientes, vierta el aceite en una olla grande o freidora y caliente hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje los poppadums en el aceite caliente y fría por 30 segundos o hasta que estén crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa picante de tomate, caliente el aceite de oliva en una cacerola pequeña, agregue la cebolla y fríasela suavemente durante cuatro minutos o hasta que se ablande. Agregue el ajo y fría por un minuto. Agregue el tomate picado, el azúcar moreno, el chile y el vinagre de vino tinto y cocine a fuego lento durante 4-5 minutos. Agregue las hierbas y sazone bien con sal y pimienta negra recién molida.", "Para las espinacas salteadas, derrita la mantequilla en una cacerola grande, agregue las espinacas y revuelva en la mantequilla caliente. Sazonar bien con sal y pimienta negra recién molida. Drene cualquier exceso de agua.", "Para servir, coloque un poppadum en un plato de servir, cubra con la mitad de la chutney de tomate y las espinacas salteadas y luego cubra con el resto de los crujientes poppadoms, chutney y espinacas para hacer una torre. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crisppoppadumswithto_88155", "title": "Poppadoms crujientes con salsa picante de tomate y espinacas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "125 g / 4½ oz de filete de salmón, piel en", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 pimiento rojo, semillas eliminadas, picadas", "1 pimiento amarillo, sin semillas, picado", "2 cucharadas de vinagre de vino tinto", "pizca de azúcar en polvo", "puñado de hojas de ensalada mixtas", "vinagre balsámico, para lloviznar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el salmón asado, frote el aceite de oliva en el salmón y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno a fuego alto. Agregue el salmón, con la piel hacia abajo primero, y fría durante 1-2 minutos, o hasta que la piel esté crujiente. Voltea el salmón y freír durante 30 segundos a un minuto para dorar el pescado. Vuélvala a dar vuelta de modo que quede con el lado de la piel hacia abajo y transfiera la sartén al horno durante 7-8 minutos para asar el salmón.", "Para los pimientos agridulces, caliente el aceite en una sartén no reactiva por separado a fuego medio. Agregue las piezas de pimienta y fría por 2-3 minutos, o hasta que comiencen a ablandarse.", "Agregue el vinagre de vino tinto y el azúcar y continúe cocinando por 5-6 minutos, o hasta que los pimientos estén suaves y el vinagre se haya reducido.", "Para servir, esparza las hojas mezcladas en un plato para servir, y coloque el salmón tostado crujiente encima. Coloque los pimientos alrededor del borde del plato. Rocíe el plato con vinagre balsámico."], "url": "www_bbc_co_uk_food_recipes_crisproastedsalmonwi_89455", "title": "Salmón asado crujiente con pimientos agridulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]