[{"ingredients": ["50 g / 1¾oz de alga wakame seca, empapada en agua fría durante 20 minutos, luego escurrida y enjuagada", "20 g / ¾oz de setas de madera secas, empapadas en agua tibia durante 20 minutos, luego escurridas, enjuagadas y finamente trituradas", "½ manzana Granny Smith, sin corazón y cortada en cerillas", "1 zanahoria pequeña, cortada en fósforos", "1 pequeño puñado de raíces de cilantro, en rodajas finas", "1 puñado de hojas de cilantro, para adornar", "1 cucharada de semillas de sésamo blanco", "½ cucharadita de pasta de miso rojo", "3 cucharadas de mirin", "1 cucharada de vinagre de sidra de manzana", "Una pizca de sal marina", "pellizcar azúcar morena suave"], "method": ["Mezcle todos los ingredientes de la ensalada en un tazón.", "Para hacer el aderezo, muele las semillas de sésamo en un almirez y mortero. Agregue la pasta de miso y mezcle bien. Coloque en un tazón pequeño y agregue los ingredientes restantes del aderezo. Batir bien para combinar.", "Agregue el aderezo a la ensalada justo antes de servir, y revuelva para combinar. Adorne con el cilantro y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_wakame_seeweed_salad_26514", "title": "Ensalada de algas Wakame con aderezo de miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 yemas de huevo", "sal marina, para curar", "2 tendones de talón de ternera estofados y secos", "1litre / 1¾ pintas de aceite vegetal sin sabor, para freír", "100g / 3½oz Wagyu solomillo", "1 cucharadita de chalote de plátano finamente picado", "10 hojas de perejil de flatleaf, finamente triturado", "1 cucharada de aceite vegetal, para freír", "Cebollas de 200g / 7oz, aproximadamente picadas", "1kg / 2lb 4oz Wagyu falda", "250ml / 9fl oz light bitter ale", "500ml / 18fl oz de caldo de pollo marrón", "50g / 1¾oz de miel clara", "vinagre de cabernet sauvignon, al gusto", "6 dientes de ajo ahumados", "100ml / 3½fl oz de vinagre de vino blanco", "50 g / 1 oz de azúcar en polvo", "50ml / 2fl oz de aceite de perejil", "1 cucharada de aceite vegetal, para freír", "200g / 7oz Wagyu solomillo", "50g / 1¾oz de mantequilla", "200 g / 7 oz de brócoli en brotación, recortado, floretes, hojas y tallos separados", "50g / 1¾oz de mantequilla"], "method": ["Para el tartar, primero cura las yemas de huevo. Coloque una capa de sal en el fondo de un recipiente pequeño, ponga las yemas de huevo encima y cúbralas con más sal. Cubra y ponga en el refrigerador por 12 horas.", "Lave suavemente las yemas de huevo en agua fría y colóquelas en un deshidratador a 40 ° C durante 24 horas.", "Hervir los tendones del talón de ternera durante 4 horas hasta que estén muy suaves. Coloque en una bandeja y deje enfriar y firme. Cortar en rodajas finas y deshidratar hasta que esté duro.", "Llene una freidora con aceite y caliente a 180C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Agregue los tendones de tacón de ternera y fría hasta que estén suaves y esponjosos. Retire la carne con una espumadera y escurra sobre papel de cocina. Sazonar con sal marina y reservar.", "Picar el solomillo Wagyu en cuadrados de 5 mm / ¼. Mezcle con la chalota y el perejil y sazone con sal marina. Dejar de lado hasta que sea necesario.", "Para la pechuga, precaliente el horno a 140C / 120C Ventilador / Gas 1. Caliente el aceite en una cazuela grande. Agregue las cebollas y la falda y fría por unos minutos, hasta que la carne esté dorada y las cebollas estén suaves. Vierta la cerveza, el caldo y la miel. Cubra con una tapa y hornee por 2-3 horas, o hasta que la carne esté tierna. Retire con cuidado la pechuga de la cazuela y manténgala caliente.", "Pase el líquido de cocción a través de un colador fino en una olla. Cocine a fuego medio hasta que se reduzca a un glaseado. Sazonar, al gusto, con sal marina y vinagre de cabernet sauvignon.", "Para el aderezo, freír el ajo ahumado en una sartén caliente con un chorrito de aceite hasta que se dore, luego reducir el fuego y cocinar hasta que esté suave. Agregue el vinagre y el azúcar y deje que hierva. Retire del fuego.", "Transfiera el ajo a una licuadora, agregue la mayor parte del líquido de cocción y mezcle hasta que quede suave. Agregue un poco más de líquido de cocción si es necesario para lograr un aderezo suave (debe ser bastante espeso ya que agregará el aceite de perejil en el último minuto). Dejar de lado hasta que sea necesario.", "Para el solomillo Wagyu, caliente el aceite en una sartén de base pesada. Cuando esté caliente, agregue el solomillo Wagyu y fría por 15-20 segundos. Gire y fría el otro lado durante 15-20 segundos. Repite este proceso durante 2-3 minutos, agregando la mantequilla durante el último minuto. (Esto mantendrá el calor en la sartén y acumulará una corteza agradable al tiempo que mantendrá el centro húmedo y rosado.) Déjelo a un lado sobre una rejilla para que descanse durante 5 minutos.", "Para el brócoli que brota, blanquee los tallos durante 2 minutos, los floretes durante 1 minuto y las hojas durante 30 segundos. Vístase con mantequilla y sazone con sal marina.", "Para servir, esmaltar la falda en el licor de cocción reducido. Tallar el bistec Wagyu y sazonar con sal.", "Divida la pechuga, el bistec y el brócoli entre cuatro platos para servir. Mezcle el aceite de perejil con el aderezo de ajo ahumado y rocíe sobre el bistec.", "Coloque el tartare en el tendón de talón de ternera inflado, ralle las yemas de huevo curadas y sirva a un lado."], "url": "www_bbc_co_uk_food_recipes_wagyu_sirloin_and_slow_80459", "title": "Solomillo de Wagyu y falda cocida a fuego lento, brócoli que brota, wagyu tartare en tendón de talón hinchado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de champiñones shiitake, en rodajas", "150ml / 5fl oz de salsa de soja", "150ml / 5fl oz de vinagre de jerez", "50g / 1¾oz de jengibre fresco, finamente picado", "100 g / 3½ oz de azúcar en polvo", "5 ostras frescas, conchas descartadas", "100ml / 3½fl oz de aceite de colza", "exprimir jugo de limón", "sal al gusto", "2 cucharadas de aceite sin sabor", "Filete de carne wagyu 300 g / 10½ oz, cortado en rodajas de 1 cm de espesor", "100ml / 3½fl oz de salsa XO", "2 bollos de leche de sésamo al vapor", "¼ lechuga iceberg, hojas separadas", "puñado de hojas de menta", "algunas hojas de albahaca", "pocas hojas de ostra", "algunas flores comestibles"], "method": ["Para los champiñones en escabeche, coloque los champiñones en un recipiente resistente al calor. Ponga a hervir los demás ingredientes y vierta sobre los champiñones rebanados.", "Para la emulsión de ostras, ponga las ostras en una licuadora y mezcle hasta que quede suave, agregando lentamente el aceite. Sazone con jugo de limón y sal.", "Para la carne, caliente la sartén hasta que esté caliente y agregue el aceite. Una vez caliente, selle la carne en cada lado durante 1 minuto. Transfiere a un plato y deja reposar. Agregue la salsa XO a la sartén y desgálelo, raspando las partes cocinadas de la sartén con la salsa.", "Para servir, corte o parta el panecillo por la mitad y monte el panecillo con el bistec, la salsa, los champiñones, la emulsión, la lechuga, la menta y la albahaca con la tapa en la parte superior. Adorne con hojas de ostra y flores comestibles."], "url": "www_bbc_co_uk_food_recipes_wagyu_beef_in_xo_sauce_06331", "title": "Carne Wagyu en salsa XO con ostras, setas encurtidas, albahaca y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de gallinas camperas", "1 cucharada de vinagre de vino blanco", "2 cucharaditas de mostaza Dijon", "½ cucharadita de azúcar en polvo", "¼ cucharadita de sal marina en copos", "pimienta negra recién molida", "150ml / 5fl oz de aceite de girasol", "100 ml / 3½ fl oz crema fresca", "65g / 2¼oz de mitades de nueces sin cáscara", "3 palos grandes de apio, más hojas de apio", "2 comiendo manzanas, descuartizado y finamente cortado", "250 g / 9 oz de uvas rojas sin semillas, cortadas a la mitad", "alrededor de 2 cucharaditas de jugo de limón fresco", "8 filetes de caballa fresca", "4 cucharaditas de aceite de oliva", "4 cucharaditas de jugo de limón", "2 cucharadas de perejil de flatillo, finamente picado", "sal marina escamada y pimienta negra recién molida"], "method": ["Para hacer que la mayonesa ponga las yemas de huevo, el vinagre, la mostaza y el azúcar en el tazón pequeño de un procesador de alimentos, o si no tiene un procesador de alimentos con un tazón pequeño, puede usar una licuadora de varillas. Sazonar con sal y un poco de pimienta negra molida.", "Licúe hasta que quede suave, luego con el motor en marcha, agregue gradualmente el aceite y mezcle hasta que quede suave y espeso. Agregue la crème fraîche y 1-2 cucharadas de agua fría. Mezcle durante unos segundos más hasta que la salsa tenga una consistencia suave. Transfiera a un tazón, cubra y enfríe en el refrigerador.", "Para la ensalada, coloque las mitades de nueces en una sartén antiadherente pequeña a fuego medio-alto durante 3-4 minutos, o hasta que estén tostadas por todos lados. Deja enfriar. Corta finamente el apio, manteniendo las hojas para después. Agregue el apio en rodajas a un tazón grande junto con las manzanas en rodajas y las uvas a la mitad. Vierta el jugo de limón y mezcle bien. Esto evitará que las manzanas se pongan marrones. Mezcle la mayonesa, mitades de nueces tostadas y hojas de apio.", "Precaliente la parrilla a la temperatura más alta. Agregue los filetes de caballa a un tazón grande y vierta sobre el aceite de oliva y el jugo de limón. Espolvorear sobre el perejil y sazonar con sal marina en escamas y pimienta negra recién molida. Mezcle bien, asegurándose de que los filetes estén bien cubiertos. Transfiera la caballa a una bandeja para hornear, con la piel hacia arriba, y ase a la parrilla durante 2 o 3 minutos, o hasta que la piel esté crujiente. Sirva los filetes de caballa inmediatamente, con la ensalada Waldorf y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_waldorf_salad_with_19251", "title": "Ensalada Waldorf con caballa a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/waldorf_salad_with_19251_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ manzana roja, rebanada", "½ tallo de apio, picado", "100g / 3½oz de pollo cocido, picado", "50g / 1¾oz nueces", "puñado de cohete fresco", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "290ml / 10¼ fl oz de aceite vegetal", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, coloque todos los ingredientes de la ensalada en un tazón grande y mezcle bien.", "Para el aderezo de mayonesa, ponga las yemas de huevo y la mostaza en un tazón y mezcle.", "Poco a poco agregue el aceite vegetal, batiendo continuamente hasta que todo el aceite se mezcle.", "Batir el jugo de limón en la mezcla y sazonar con sal y pimienta negra recién molida.", "Para servir, mezcle la mayonesa con la ensalada y la cuchara en un tazón para servir."], "url": "www_bbc_co_uk_food_recipes_waldorfsalad_85781", "title": "Ensalada Waldorf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 chuletas de cerdo grandes y gruesas", "1 cucharadita de canela molida", "1 cucharadita de nuez moscada recién rallada", "100 g / 3½ oz de nueces, finamente picadas", "2 cucharadas de aceite de oliva", "70 g / 2½ oz de mantequilla, suavizado", "125ml / 4fl oz de vino blanco", "16 higos secos, finamente picados", "125ml / 4fl oz de caldo de pollo", "1 cucharada de perejil de flatleaf tostado", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Sazonar las chuletas de cerdo con sal y pimienta y marcar la carne con un cuchillo afilado.", "En una lata para asar poco profunda, mezcle la canela, la nuez moscada y las nueces. Agregue el aceite de oliva para hacer una pasta. Tira las chuletas en las nueces, empujando la miga en la carne.", "Derretir 40 g / 1½ oz de la mantequilla en una sartén grande con tapa antiadherente y dorar las chuletas de dos en dos, teniendo cuidado de no quemar las nueces. Esto llevará unos minutos en cada lado.", "Vuelva a colocar todas las chuletas en la sartén, cubra con una tapa y cocine durante 10 minutos a fuego medio, o hasta que estén bien cocidas. Transfiera las chuletas de cerdo a un plato calentado y cubra con papel de aluminio para mantener el calor.", "Desglaze la sartén con el vino blanco, continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad. Agregue los higos picados y el caldo de pollo, sazone al gusto. Agregue la mantequilla restante, el perejil y el jugo de limón.", "Sirve las chuletas de cerdo con la salsa encima."], "url": "www_bbc_co_uk_food_recipes_walnut-crusted_pork_79537", "title": "Chuletas de cerdo con nueces y costra de higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/walnut-crusted_pork_79537_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de queso Stilton", "Nueces sin cáscara 75 g / 2½ oz, más o menos picadas", "50g / 1¾oz sultanas", "300 g / 10½ oz de harina blanca, más extra para quitar el polvo", "200g / 7oz de harina integral", "1 cucharadita de bicarbonato de soda", "1 cucharada de sal de mesa", "400ml / 14fl oz de suero de leche"], "method": ["Para los aromatizantes, desmenuce el Stilton en un bol y agregue las nueces. Agregue las sultanas y reserve.", "Para el pan de soda, precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel pergamino.", "Incline las harinas, el bicarbonato de sodio y la sal en un tazón. Agregue los aromatizantes.", "Vierta el suero de leche y mezcle con una masa suave. Inclina sobre una superficie enharinada y haz una bola. Corta ranuras profundas en el pan para marcar cuartos y polvo con harina.", "Coloque el pan en la bandeja de hornear y hornee durante 30 minutos, o hasta que estén dorados y cocidos. El pan debe sonar hueco cuando se toca en la base.", "Retire del horno y deje enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_walnut_and_stilton_soda_33324", "title": "Pan de soda Walnut y Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pan de grano malteado 400g / 14oz", "200g / 7oz de harina blanca fuerte; más extra para amasar y dar forma a la masa en la superficie de trabajo de la cocina", "2 cucharaditas de sal", "2 x 7 g / oz de sachets de levadura seca de acción rápida", "30ml / 1fl oz de aceite de nuez", "2 cucharadas de melaza negra", "150g / 5½oz de nueces picadas", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Combine los ingredientes secos en el cuenco de un mezclador eléctrico independiente equipado con un gancho de masa.", "Agregue todos los ingredientes restantes, aparte del huevo, con 250ml / 9fl oz de agua tibia y comience a amasar a baja velocidad. Agregue hasta 100 ml / 3½ fl oz más de agua, poco a poco para hacer una masa suave, pero no mojada.", "Amasar a velocidad lenta durante aproximadamente dos minutos, luego aumentar la velocidad y amasar durante cuatro minutos a velocidad media.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar a mano, rompiendo las piezas grandes de nuez que quedan, hasta que la masa esté suave y flexible. Poner a un lado en un tazón grande, ligeramente engrasado, cubierto con un paño de cocina para probar durante aproximadamente una hora, o hasta que la masa se haya duplicado en volumen.", "Rechace la masa y separe 200 g / 7 oz del resto. Ponga a un lado, cubierto mientras da forma al pan.", "Forme la porción más grande de la masa en una mazorca lisa ligeramente aplastada en un círculo de aproximadamente 30 cm / 12 pulgadas de diámetro y coloque en la bandeja de horno revestida.", "Coloque un cortador redondo de 7,5 cm en el centro de la masa. Cortar la masa alrededor de la periferia con un cuchillo para crear 16 segmentos (pétalos).", "Gire cada pétalo 90 grados. Recorta el círculo de masa desde el centro y forma una bola. Dejar de lado, cubierto con un paño de cocina.", "Divida los 200g / 7oz reservados de la masa de pan en dos bolas. Extiéndalos finamente en círculos. Divide cada círculo en ocho triángulos. Coloque los extremos cortos de cada triángulo dentro del orificio central y doble los puntos hacia el centro para crear los pétalos internos de la flor.", "Coloque la bola reservada de masa en el centro de la flor. Cubra con película adhesiva engrasada y vuelva a probar hasta que la masa se haya duplicado.", "Precalentar el horno a 210 ° C / horno de ventilador 190 ° C / Gas 7 y alinear una bandeja de horno con pergamino para hornear", "Cepille los pétalos internos con el huevo batido y espolvoree los pétalos externos con un poco de harina blanca", "Con la punta de un cuchillo afilado, corte la bola central para imitar la apariencia del centro de una flor.", "Hornee durante 30-35 minutos hasta que el pan suene hueco cuando se toca la base."], "url": "www_bbc_co_uk_food_recipes_walnut_fleur_loaf_84772", "title": "Pan de la nuez de la flor", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nueces de 150g / 5oz, conchas eliminadas, más o menos picadas", "2 manzanas verdes, picadas", "2 ramitas de tomillo fresco, toscamente picadas", "200g / 7oz de mantequilla, suavizada", "sal y pimienta negra recién molida", "1kg / 2¼lb de lomo sin hueso de cerdo", "1-2 cucharadas de aceite vegetal", "6 chirivías, peladas, descuartizadas", "3 cucharadas de aceite de oliva", "4 cucharadas de miel clara", "sal y pimienta negra recién molida", "2 ramitas de tomillo fresco", "Mitades de nueces de 100 g / 3½ oz, conchas eliminadas", "salsa preparada, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de cerdo, coloque las nueces, las manzanas, el tomillo y dos tercios de la mantequilla en un bol, sazone con sal y pimienta negra recién molida y mezcle para hacer una pasta gruesa.", "Coloque la carne de cerdo, con la carne hacia arriba, en una tabla de cortar con la tapa del vientre mirando hacia usted. Con un cuchillo afilado, haga una incisión en la mitad de la carne hacia abajo, paralela a la tabla, cortando casi todo el cuerpo. Abra el lomo, rellene con la mezcla de mantequilla y sazone con sal y pimienta negra recién molida.", "Engrasar generosamente un pedazo de papel de aluminio lo suficientemente grande como para envolver el cerdo y colocar el cerdo en la parte superior. Frote la mantequilla restante sobre la carne de cerdo, luego enrolle en la lámina. Gire los extremos de la lámina para que el paquete quede bien apretado y ate con una cuerda.", "Caliente una lata grande para asar sobre la placa hasta que esté caliente y agregue el aceite vegetal. Coloque el paquete de papel aluminio en la lata y cocínelo, volteándolo cada 2-3 minutos, hasta que todas las partes del paquete hayan estado en contacto con el calor, esto colorizará la capa externa de la carne.", "Transfiera la carne de cerdo al horno y tueste durante 1-1½ horas, o hasta que esté dorada y completamente cocida.", "Mientras tanto, para las pastinacas, coloque las chirivías en una lata de asar. Rocíe el aceite de oliva y la miel y revuelva bien para cubrir las chirivías. Sazonar con sal y pimienta negra recién molida, agregar las ramitas de tomillo y mezclar bien.", "Coloque en el horno y tueste durante 35-40 minutos, o hasta que estén tiernos y dorados.", "Agregue las mitades de nueces y vuelva al horno durante cinco minutos, hasta que estén ligeramente tostadas.", "Para servir, desenvuelva el paquete de carne de cerdo, descarte la lámina y corte la carne de cerdo en rodajas gruesas. Coloque las rebanadas en seis platos con las chirivías y una llovizna de salsa."], "url": "www_bbc_co_uk_food_recipes_walnutandapplestuffe_85163", "title": "Lomo y lomo de cerdo relleno de nuez y manzana con miel asada y nabos de nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de mantequilla, derretida", "200g / 7oz de masa filo", "Nueces 110g / 4oz, finamente picadas", "110 g / 4 oz de pistachos, finamente picados", "250 g / 9 oz de azúcar en polvo", "200 ml / 7 fl oz de agua", "½ limón, solo jugo", "½ cucharadita de jengibre molido", "Crema doble 250ml / 9fl oz", "50ml / 2fl oz de jarabe de un frasco de tallo de jengibre", "¼ cucharadita de jengibre molido", "2 cucharadas de miel", "50 g / 2 oz de almendras, más o menos picadas", "50 g / 2 oz de tallo de jengibre, finamente picado"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para el baklava, cepille una bandeja para hornear de 25cm / 10in x 18cm / 7in con un poco de mantequilla derretida.", "Recorte la masa de filo para que se ajuste a la bandeja de hornear si es necesario.", "Coloque una de las hojas de filo en la bandeja. Cepíllese con mantequilla y coloque otra hoja de filo encima y cepille con mantequilla. Repita para usar hasta la mitad de las hojas de filo de esta manera.", "Mientras tanto, mezcle bien las nueces y los pistachos en un tazón.", "Vierta la mezcla de nueces en la pila de pasta filo con mantequilla y distribuya uniformemente.", "Cepille una hoja de filo con mantequilla y colóquela con la mantequilla hacia abajo sobre la capa de nueces. Cepille la hoja con mantequilla, luego repita el proceso de estratificación con las hojas de filo restantes, untando nuevamente cada hoja antes de agregar la siguiente.", "Con un cuchillo grande y afilado, marca la parte superior de la pila en capas en un patrón de diamante.", "Coloque en el horno y hornee durante 20-25 minutos, hasta que estén dorados y cocidos.", "Mientras tanto, coloque el azúcar impalpable, el agua, el jugo de limón y el jengibre molido en una sartén a fuego medio y deje que hierva. Hervir durante 5-6 minutos, hasta que espese a un jarabe.", "Cuando el baklava salga del horno, vierta el almíbar tibio y déjelo enfriar.", "Para el helado, coloque la crema, el jarabe de jengibre, el jengibre molido y la miel en un recipiente apto para el congelador y bata hasta que se formen picos suaves cuando se quite el batidor.", "Agregue las almendras picadas y el jengibre y dóblelas suavemente.", "Coloque en el congelador de dos a cuatro horas, o hasta que se solidifique. Retire el helado del congelador diez minutos antes de servir.", "Para servir, separe los diamantes baklava y coloque dos en cada plato. Cubra con una bola de helado y sirva."], "url": "www_bbc_co_uk_food_recipes_walnutandpistachioba_88634", "title": "Baklava de nuez y pistacho con helado de almendra y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40g / 1½oz de berro", "30g / 1oz Stilton", "2 cucharadas de nueces sin cáscara", "2 cucharadas de aceite de oliva", "pimienta negra recién molida", "2 rebanadas de baguette, tostadas"], "method": ["Coloque el berro, Stilton, nueces, aceite de oliva y pimienta negra en un mini procesador de alimentos y mezcle hasta que quede suave.", "Coloque las rebanadas de baguette en un plato de servir. Extienda sobre la mezcla de nueces y Stilton y sirva."], "url": "www_bbc_co_uk_food_recipes_walnutandstiltoncros_88009", "title": "Crostini de nueces y Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de harina integral fuerte", "110g / 4oz de harina blanca fuerte", "30 g / 1 oz de levadura fresca", "15g / ½ oz de sal", "255ml / 9oz de agua", "85g / 3oz sultanas", "Nueces 85g / 3oz", "almendras copos puñado", "Stilton, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Mezcle la harina, la levadura, la sal y el agua en un recipiente con sus manos hasta que se convierta en una masa blanda y flexible.", "Coloque la masa sobre una superficie lisa ligeramente enharinada y amase durante cinco minutos. Vuelva a poner la masa en el recipiente y deje que se levante durante una hora.", "Saca la masa y mezcla las pasas y nueces en ella.", "Forme la masa en un pan y enrolle el pan en almendras en copos.", "Con un cuchillo afilado, corta una línea en el centro del pan.", "Hornee por 30 minutos o hasta que estén doradas. Enfriar sobre una rejilla de alambre, servir tostado o con Stilton en el lado."], "url": "www_bbc_co_uk_food_recipes_walnutandsultanabrea_67847", "title": "Pan de nuez y sultana con almendras", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pastinaca", "6 zanahorias bebé", "2 remolachas cocidas (no en vinagre)", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "1 diente de ajo, finamente picado", "1 ramita de tomillo", "1 cucharada de miel clara", "1 cucharada de vinagre de vino tinto", "manojo de berros", "100g / 3½oz de nueces sin cáscara", "1 diente de ajo, finamente picado", "50ml / 1¾fl oz de aceite de oliva", "sal y pimienta negra recién molida", "exprimir jugo de limón, al gusto", "4 cucharadas de crema fresca", "1 cucharadita de mostaza Dijon", "1 cucharada de raíz de rábano picante fresco rallado", "½ limón, solo jugo"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para las verduras de invierno, pele la chirivía y corte cada una en seis a lo largo. Recorta el núcleo con un cuchillo afilado.", "Pelar las zanahorias y cortar cada una en seis a lo largo. Pele la remolacha y corte en cuartos.", "En una sartén grande, caliente el aceite de oliva, luego agregue las chirivías y las zanahorias y freír durante dos minutos hasta que las verduras comiencen a colorear.", "Agregue sal y pimienta negra recién molida, al gusto, junto con la mantequilla, el ajo y el tomillo. Freír durante otros 5-6 minutos, o hasta que las verduras estén tiernas hasta el final. Agregue la remolacha, la miel y el vinagre a la sartén y caliente la remolacha. Ponga a un lado, manteniendo las verduras calientes.", "Para la pasta de nueces, coloque las nueces en una bandeja de horno y tueste en el horno durante cinco minutos. Retire las nueces del horno y frótelas con un paño limpio para quitar las pieles. En una maja y mortero, muela las nueces peladas junto con el ajo y el aceite de oliva. Sazonar, al gusto, con sal, pimienta negra recién molida y jugo de limón.", "Para el aderezo de rábano picante, mezcle la crème fraîche, la mostaza, el rábano picante rallado y el zumo de limón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, distribuya la pasta de nueces en dos platos y coloque las verduras en la parte superior. Adorne con berros y rocíe el aderezo de rábano picante."], "url": "www_bbc_co_uk_food_recipes_walnutandwinterveget_87826", "title": "Ensalada de verduras de nuez y de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 paquete de pastelería dulce hecha brisa, laminada a 0.5cm / ¼ de grosor", "175g / 6oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas", "Nueces de tierra 175g / 6oz", "Pan rallado de 110 g / 4 oz", "Mermelada de damson 300g / 11oz", "12 mitades de nuez", "Crema doble 250ml / 9fl oz", "50g / 2oz de mantequilla", "Niveles de 400g / 14oz", "75g / 3oz de azúcar en polvo", "1 ramita de canela"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para la tarta, forra una lata de tarta profunda de 23cm / 9in con la masa dulce de pasta corta. Coloque una hoja de papel para hornear o papel de aluminio sobre la masa y pese con frijoles para hornear o arroz.", "Coloque la lata de tarta en una bandeja para hornear, transfiera al horno y hornee durante 15 minutos.", "Retire el papel o papel de aluminio y hornear los frijoles de la lata de tarta, luego vuelva al horno por otros diez minutos hasta que la masa esté ligeramente dorada. Retirar del horno y dejar enfriar un poco.", "Coloque la mantequilla y el azúcar en un bol y bata juntos hasta que estén suaves y esponjosos.", "Agriete los huevos, uno a la vez, mezclando bien entre cada adición.", "Agregue las nueces molidas y las migas de pan y dóblese juntas hasta que estén bien combinadas.", "Extienda dos tercios de la mermelada de damson sobre la base de la caja de pastelería. Cubra con la mezcla de relleno de nuez y alise la parte superior con una espátula húmeda. Coloque las mitades de nuez alrededor del borde del relleno.", "Transfiera al horno y hornee por 25-30 minutos, o hasta que se levante y dore. Retirar del horno y dejar enfriar un poco.", "Mientras tanto, en un recipiente, bate la crema hasta que se formen picos suaves cuando se quite el batidor. Doble el atasco de damson restante.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para los nísperos asados, caliente la mantequilla en una sartén a prueba de horno y fría los nísperos durante 1-2 minutos.", "Agregue el azúcar y la varilla de canela, luego transfiera la sartén al horno y tueste durante 10-15 minutos, o hasta que los nísperos estén suaves y las pieles se hayan partido.", "Para servir, corte la tarta en rodajas y colóquela en platos para servir con una cucharada de crema de damson y algunos nísperos tostados."], "url": "www_bbc_co_uk_food_recipes_walnutbakewelltartwi_87482", "title": "Tarta Walke Bakewell con nísperos asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pera, pelada y picada en cubos de 1cm / ½ en", "Nueces de 55g / 2oz, conchas eliminadas, más o menos picadas", "55g / 2oz de queso de cabra, desmenuzado", "puñado de perejil fresco", "puñado de cilantro fresco", "puñado de perifollo fresco", "2 cucharaditas de aceite de oliva virgen extra", "1 cucharadita de vinagre balsámico", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, coloque las piezas de pera, nueces, queso y hierbas en un tazón grande y mezcle bien.", "Para el aderezo, coloque el aceite, el vinagre y el jugo de limón en un tazón. Sazonar con sal y pimienta negra recién molida y mezclar bien.", "Para servir, vierta el aderezo sobre la ensalada y mezcle bien para cubrir los ingredientes de la ensalada. Coloque la ensalada en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_walnutpearandgoatsch_85246", "title": "Ensalada de queso de nuez, pera y cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nueces de 110 g / 4 oz, más o menos picadas", "2 cucharadas de mostaza Dijon", "2 pechugas de pollo deshuesadas y sin piel, cortadas en rodajas gruesas", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 apio de cabeza", "2 cucharadas de aceite de oliva", "1 cucharada de hojas frescas de tomillo", "Mitades de nogal 110g / 4oz", "2 manzanas verdes, cortadas en cuñas", "2 manzanas rojas, cortadas en cuñas", "1 limón, cáscara y jugo solamente", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "1-2 cucharadas de vinagre de vino blanco", "150ml / 5fl oz de aceite de girasol", "150ml / 5fl oz de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Coloque las nueces en un procesador de alimentos y mezcle con migajas finas.", "Cepille la mostaza de Dijon en las rodajas de filete de pollo y sazone con sal y pimienta negra recién molida.", "Coloque las nueces molidas en un tazón grande. Agregue las rodajas de pollo y revuelva en las nueces para cubrir completamente.", "Calentar una sartén hasta que esté caliente y luego agregar el aceite de oliva. Coloque el pollo en la sartén y fría durante 3-4 minutos por cada lado, o hasta que esté dorado y completamente cocido. Retire de la sartén y escurra sobre papel de cocina.", "Para la ensalada, corta la mitad del apio en trozos pequeños, y corta el resto en tiras largas de 5cm / 2 pulgadas.", "Coloque el aceite de oliva y las hojas de tomillo en un recipiente, luego agregue las tiras de apio. Mezcle el apio para cubrir con aceite de tomillo y sazone, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén hasta que fume. Coloque las tiras de apio en la plancha y deje actuar durante 1-2 minutos, hasta que se marque con la plancha y se caliente.", "Coloque los trozos de apio y los ingredientes restantes de la ensalada en un bol y mezcle bien.", "Para la mayonesa, coloque las yemas de huevo, la mostaza y el vinagre de vino blanco en un procesador de alimentos y mezcle.", "Con el procesador todavía funcionando, vierta lentamente el aceite de girasol y el aceite de oliva, gota a gota al principio, luego más rápido a medida que la mezcla se espesa, alternando entre los dos aceites a medida que avanza. Continúe mezclando hasta que se incorpore todo el aceite y se forme una mayonesa espesa. Transfiera la mayonesa a un recipiente limpio y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, agregue la mayonesa al tazón de ensalada y mezcle bien. Coloque la mezcla de ensalada en el centro de cada uno de los cuatro platos, cubra cada uno con trozos del pollo de nuez y trozos de apio a la plancha."], "url": "www_bbc_co_uk_food_recipes_walnutchickenandwald_84654", "title": "Pollo de nuez y ensalada Waldorf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bulbo de ajo", "2 cucharadas de vino blanco", "1 cucharada de vinagre Chardonnay", "1 cucharadita de mostaza Dijon", "1 huevo, solo yema", "¼ cucharadita de salsa Worcestershire", "Anchoas marinadas en aceite de 50g / 2oz", "35 g / 1 g de queso parmesano, rallado", "75ml / 2¾fl oz de aceite de colza", "1 rebanada de pan de campo grueso, cortado en cubos de 5 mm / ¼ in", "2 cucharadas de aceite de oliva virgen extra", "1 ramita de romero, hojas recogidas y finamente picadas", "2 pequeñas lechugas de gema, hojas separadas", "50ml / 2fl oz de aceite de oliva virgen extra", "4 dientes de ajo, toscamente picados", "2 chalotes, toscamente picados", "110ml / 4fl oz de vino blanco", "60 g / 2¼ oz de filetes de anchoa marinados en aceite, picados", "1 huevo, solo yema", "Crema doble 110ml / 4fl oz", "pimienta negra recién molida", "2 manojos de rábanos ingleses, lavados y recortados", "aceite vegetal, para freír en grasa", "Anchoas frescas enteras de 200 g / 7oz", "300 ml / ½ litro de leche", "Harina normal de 75g / 3oz", "1 cucharadita de pimienta de cayena, más extra para condimentar", "sal marina", "1 limón, solo jugo"], "method": ["Para ensalada César, precaliente el horno a 180 ° C / 360 ° F / Gas 4½.", "Corte la parte superior de la bombilla de ajo y deséchela. Envuelva el bulbo de ajo en papel de aluminio y hornee por unos 20 minutos hasta que el ajo esté muy suave.", "Retire del horno y deje a un lado hasta que esté lo suficientemente frío como para manejarlo. Exprime el ajo tostado en un procesador de alimentos pequeño.", "Agregue el vino blanco, el vinagre de Chardonnay, la mostaza, la yema de huevo, la mitad de las anchoas marinadas, la salsa Worcestershire y el parmesano y mezcle hasta obtener un puré fino.", "Con la licuadora en funcionamiento, vierta gradualmente en el aceite de colza hasta que la mezcla se espese y se emulsione. Sazonar con sal y pimienta negra recién molida.", "Coloque los cubos de pan en un tazón con aceite de oliva, romero, sal y pimienta negra y mezcle bien para combinar.", "Caliente una sartén hasta que esté caliente, agregue los crutones en lotes y cocínelos durante 2-3 minutos, volteándolos con frecuencia, hasta que estén dorados y crujientes.", "Mezcle la gema de bebé hojas de lechuga con los crotones calientes, las anchoas marinado restantes y un chorrito de aderezo.", "Para la anchova, caliente una sartén a fuego medio hasta que esté tibia, luego agregue el aceite de oliva, el ajo, las chalotas y el vino blanco y cocine durante 1-2 minutos.", "Agregue las anchoas a la sartén y cocine durante 1-2 minutos más hasta que las anchoas se ablanden.", "Retire del fuego y mezcle la mezcla de anchoas con la yema de huevo y la crema en un procesador de alimentos hasta que se convierta en un puré. Sazonar con pimienta negra.", "Para las anchoas deformes, caliente una freidora a 190 ° C o 375 ° F o, alternativamente, caliente un poco de aceite vegetal en una sartén profunda de fondo grueso, hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Enjuague las anchoas y luego seque con papel de cocina.", "Remoje las anchoas en la leche durante unos minutos y luego drene.", "Mezcle la harina, la cayena y la sal juntas en un tazón y luego mezcle las anchoas, unas cuantas a la vez, en la harina.", "Coloque en la freidora de grasa en lotes y fría durante 1-2 minutos hasta que estén crujientes y doradas.", "Retire de la grasa caliente con una cuchara ranurada y escurrir sobre papel de cocina. Sazonar con sal, un poco de pimienta de cayena y un chorrito de limón.", "Para servir, amontona las anchoas en una tabla. Vierta la anchovade caliente en un tazón pequeño y coloque junto a las anchoas, con los rábanos. Termine con una pequeña pila de ensalada César en el mismo tablero."], "url": "www_bbc_co_uk_food_recipes_warm_anchovade_with_47400", "title": "Anchovade caliente con rábanos, ensalada César y diablillo bagre frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["900 g / 2lb de cerezas, apedreado, la mitad de las piedras reservadas", "200 ml / 7 fl oz de agua", "200ml / 7fl oz de vino tinto", "50ml / 2fl oz puerto", "1 ramita de canela", "1 tira de cáscara de limón", "2 cucharadas de azúcar en polvo", "2 cucharadas de confitura de cerezas", "sal marina y pimienta negra recién molida, para sazonar", "jugo de limón, para condimentar"], "method": ["Aplasta las piedras de cereza reservadas con un martillo o rodillo y envuélvelas en una bolsa de muselina. Coloque todos los ingredientes aparte de los condimentos en una sartén con la bolsa de piedras de cereza, lleve a ebullición y cocine a fuego lento durante 5-6 minutos.", "Retire la sartén del fuego y déjela a un lado hasta que esté tibia, luego retire la bolsa de piedras de cereza.", "Coloque la mezcla de cereza en un procesador de alimentos y pulse hasta que quede suave. Pase la sopa a través de un colador fino en un recipiente. Sazone con sal marina, pimienta negra recién molida y jugo de limón. La sopa se come mejor simplemente caliente con un remolino de crema agria en la parte superior y una rebanada de pan de nuez al lado."], "url": "www_bbc_co_uk_food_recipes_warm_cherry_soup_15890", "title": "Sopa de cereza caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, deshuesadas, peladas y cortadas por la mitad", "aerosol de aceite de cocina controlado en calorías", "1 pimiento naranja o rojo grande, sin semillas y cortado en trozos", "1 pequeña joya de lechuga, hojas separadas", "50g / 1¾oz de berros, tallos resistentes eliminados", "2 tomates medianos maduros, cortados en pequeños trozos", "⅓ pepino, en rodajas", "1 cucharadita de vinagre balsámico grueso", "½ limón pequeño, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Sazone las piezas de pollo en ambos lados con sal y pimienta. Rocíe una sartén grande antiadherente con aceite y coloque a fuego alto. Cocine las piezas de pollo durante tres minutos en cada lado o hasta que estén ligeramente doradas y cocidas. Transfiere a un plato.", "Rocíe la sartén con un poco más de aceite y cocine la pimienta durante tres minutos por cada lado o hasta que esté ligeramente carbonizada y comience a ablandarse.", "Coloque las hojas de lechuga, el berro, los tomates, el pepino y la pimienta en dos platos.", "Cortar las pechugas de pollo y esparcir encima de la ensalada. Rocíe con el vinagre balsámico y exprima el jugo de limón. Sazonar con pimienta negra y servir."], "url": "www_bbc_co_uk_food_recipes_warm_chicken_salad_03629", "title": "Ensalada de pollo caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_chicken_salad_03629_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 rebanada de pan blanco", "7 rebanadas de tocino rayado curado en seco", "Hígados de pollo a 400g / 14oz, tendones recortados", "50ml / 2fl oz de brandy", "Crema doble 50ml / 2fl oz", "50g / 1¾oz mangetout, rebanado", "1 cucharada de vinagre de Jerez", "2 puñados de hojas de cohetes", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén a fuego alto. Rocíe el aceite por todo el pan y tueste en la plancha hasta que se dore por ambos lados.", "Calentar una sartén a fuego medio. Agregue el tocino y la fritura hasta que estén dorados y crujientes. Retire de la sartén con pinzas y déjelo a un lado en un plato caliente.", "Use la tostada para absorber la grasa de tocino en la sartén. Deja la tostada a un lado.", "Regrese la sartén a fuego medio, agregue los hígados de pollo y fría por 2-3 minutos, o hasta que se dore y se caramelice.", "Aumente el fuego y vierta el brandy sobre los hígados, raspando los trozos quemados de la base y los lados de la sartén con una cuchara de madera para desglasar (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Reduzca el fuego hasta que el brandy hierva a fuego lento. Agregue la crema, el mangetout y el vinagre de jerez. Revuelva bien y cocine a fuego lento durante 1-2 minutos, o hasta que los hígados estén cocidos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, amontone el cohete en tazones para servir, luego corte la tostada en croûtons y espárzalos sobre el cohete. Pica el tocino y espolvoréalo encima. Cuchara sobre los hígados de pollo y su salsa. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_warm_chicken_liver_salad_76381", "title": "Ensalada de hígado de pollo flameado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]