[{"isVegetarian": false, "title": "Chicken kiev with herb mash", "url": "www_bbc_co_uk_food_recipes_chickenkievwithherbm_79447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/17fl oz vegetable oil, for deep frying", "50g/1¾oz unsalted butter", "½red chilli, finely chopped", "½ garlic clove, crushed", "1 tsp fresh parsley, chopped ", "1 tsp lemon juice", "1 chicken breast", "50g/1¾oz white breadcrumbs", "50g/1¾oz flour, seasoned with salt and freshly ground black pepper", "1 free-range egg, beaten", "1 large potato, peeled and chopped ", "50g/1¾oz unsalted butter", "2 tbsp cream", "1 tsp fresh chives, chopped ", "50g/1¾oz grated cheddar cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the kiev, heat a deep, heavy-bottomed pan, one-third filled with vegetable oil, until a breadcrumb will sizzle gently in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.) ", "In a bowl, mix the butter with the chilli, garlic, parsley, and lemon juice.", "Use a sharp knife to split the breast almost in half horizontally.", "Open the breast out and place between two sheets of greaseproof paper. Bash the chicken with a meat mallet (or a rolling pin) to flatten the meat.", "Place the butter mixture in the middle of the chicken. Fold over the meat so the butter is completely wrapped.", "Dredge the chicken kiev in the seasoned flour, then dip into the beaten egg and then roll the kiev carefully in breadcrumbs. Repeat the egg and breadcrumbs process.", "Carefully add the kiev to the hot oil and deep-fry for ten minutes. Remove from the oil and drain on kitchen towels.", "Meanwhile, for the herby mash, boil the potato until tender, drain and return to the warm pan.", "Add the butter, cream, chives and cheese to the pan and mash together well. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the kiev on a warmed plate. Slice open to release the melted butter and place a spoonful of herb mash beside."]}, {"isVegetarian": false, "title": "Chicken kiev with mashed potato and green beans", "url": "www_bbc_co_uk_food_recipes_chickenkievwithmashe_83483", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenkievwithmashe_83483_16x9.jpg", "ingredients": ["4 x 225g/8oz chicken breasts, wing bone left in but skin removed ", "handful fresh parsley, chopped ", "120g/4oz butter, at room temperature ", "2 garlic cloves, peeled and crushed", "salt and freshly ground black pepper", "1 tsp Dijon mustard", "60g/2½oz plain flour", "1 egg, lightly beaten", "1 tbsp milk ", "100g/3½oz white bread, crusts removed, dried and processed into breadcrumbs", "120ml/4fl oz olive oil", "mashed potato ", "green beans ", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/370F/Gas 5.", "For the chicken, remove the mini-fillet at the back of the chicken breasts and set aside. Using a sharp knife, slice open the breasts so that they can be opened up like a book from the top to the bottom. Gently bash the breasts out with a meat mallet or rolling pin so they are flat.", "Repeat the flattening process with the mini-fillets. These little fillets will be used as sticking plasters to stop the butter from oozing during cooking. ", "For the herb butter, place the parsley, butter, garlic, Dijon mustard and the salt and pepper into a bowl and mix together well. Divide the butter mixture into four thumb-sized pieces and place into the fridge to chill and set. ", "Turn each flattened chicken breast over and put a roll of herb butter in the centre of each and then roll up like a cigar.  Cover any holes with the flattened fillet pieces.", "Dredge the breasts in flour and place into the freezer for 2-3 minutes to cool.", "Meanwhile beat the egg and milk together in a bowl.", "Remove the floured chicken from the freezer and dip in the egg mixture to coat thoroughly. ", "Roll the breasts in the breadcrumbs, making sure that they are well coated, then place in the fridge for 30 minutes.", "Heat 120ml oil in a pan over a medium heat. Add the chicken breasts and fry for two minutes, until golden brown. Turn the breasts and transfer to the oven to cook for 12-14 minutes, until golden and completely cooked through.", "Remove from the oven and drain onto kitchen towels.", "Serve with mashed potato and green beans, with lemon wedges to garnish."]}, {"isVegetarian": false, "title": "Chicken kiev with sweet pepper sauce and fondant potatoes", "url": "www_bbc_co_uk_food_recipes_chickenkievwithsweet_85842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz gorgonzola", "1 chicken breast, cut in half, a pocket cut into the side of each piece", "50g/1¾oz seasoned plain flour", "2 free-range eggs, beaten", "50g/1¾oz white breadcrumbs", "500ml/17½fl oz vegetable oil", "50g/1¾oz unsalted butter", "1 tbsp olive oil", "2 thick slices of potato, blanched in boiling chicken stock", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ red pepper, chopped", "50g/1¾oz caster sugar", "1 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the kiev, divide the gorgonzola into two flat rounds and stuff inside the chicken breast pockets. Close over the chicken to seal the cheese within.", "Place the flour onto a plate and dredge the chicken breasts in flour, then dip them in the beaten egg and coat with the breadcrumbs. Repeat this again to ensure the chicken is completely cooked.", "Heat the oil in a deep pan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.). Deep-fry the chicken breasts for four minutes until crisp and golden, then remove with a slotted spoon.", "Drain the chicken breasts on kitchen paper and place them on a baking tray. Bake for five minutes, or until the chicken is completely cooked through.", "For the fondant potatoes, melt the butter with the olive oil in a frying pan. Add the potato slices and sauté for two minutes on each side until golden. Season with salt and freshly ground black pepper.", "For the sauce, heat the olive oil in a frying pan and fry the red pepper. ", "Add the sugar and balsamic vinegar and boil to reduce until the sauce is thickened.", "To serve, place the chicken kiev onto the fondant potatoes on a plate and spoon around the sweet pepper sauce."]}, {"isVegetarian": false, "title": "Chicken koftas with yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_chickenkoftaswithyog_86636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, crushed", "450g/1lb chicken mince", "1 bird's eye chilli, chopped", "½ tsp ground cinnamon", "freshly grated nutmeg, to taste", "½ tsp paprika", "½ tsp ground cumin", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper", "butter, melted, to baste", "lemon juice, to baste", "200g/7fl oz Greek-style yoghurt", "2 tbsp chopped fresh mint", "½ cucumber, seeds removed, grated", "½ lime, juice only", "flatbread", "rice, cooked according to packet instructions", "1 tbsp chopped fresh parsley", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until softened. Remove from the heat and allow to cool.", "Place the chicken mince into a large bowl. Add the fried onion and garlic mixture.", "Add the chilli, cinnamon, nutmeg, paprika, cumin and parsley. Season with salt and freshly ground black pepper and mix together well.", "Shape small handfuls of the chicken mixture into walnut-sized balls.", "Thread three chicken balls onto a wooden skewer that has been soaked in water for ten minutes (to prevent burning). Repeat with the remaining mixture onto separate skewers, three balls to a skewer.", "Place the koftas under the grill to cook for 8-10 minutes. Turn regularly until golden-brown all over.", "Once golden-brown and crisp, baste all over with melted butter and lemon juice, and continue to grill until completely cooked through.", "For the yoghurt dressing, place all of the yoghurt dressing ingredients into a bowl and mix well.", "To serve, place a flatbread onto each plate. Add a couple of spoonfuls of cooked rice to each flatbread, then top with a kofta.", "Drizzle with the yoghurt dressing, sprinkle with chopped parsley and garnish with lemon wedges."]}, {"isVegetarian": false, "title": "Chicken korma", "url": "www_bbc_co_uk_food_recipes_chickenkorma_72074", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.4kg/3lb whole chicken, cut into pieces", "150g/5¼oz ghee or clarified butter", "2 large onions, peeled and sliced", "1 tsp chilli powder", "4 tsp onion powder", "1 tsp coriander seeds", "2 tbsp cinnamon powder", "½ tsp dried ground ginger", "10 black peppercorns", "5 cloves", "6 cardamom pods, ground", "2 garlic cloves, peeled and crushed", "1 tsp salt", "300ml/10½fl oz natural yoghurt", "3 bay leaves", "300ml/10½fl oz chicken stock or water", "1 lemon, juice only"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the ghee or clarified butter in a large pan and fry the onions until golden brown.  ", "Remove from the pan with a slotted spoon and put to one side.  ", "Add all the spices and the garlic to the pan and fry until brown, then throw in the chicken and salt and cook until browned.  ", "Add the yoghurt, bay leaves and stock or water and return the fried onions to the pan.  ", "Bring to the boil, reduce the heat, cover with a tight-fitting lid and simmer for one and a half to two hours, until the chicken is tender.", "Remove the pan from the heat, pour in the lemon juice and mix well.  ", "Remove the bay leaves and serve with plain boiled rice."]}, {"isVegetarian": false, "title": "Chicken korma with cashew nuts", "url": "www_bbc_co_uk_food_recipes_chickenkormawithcash_89032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "2 large onions, peeled and chopped", "4cm/2in piece fresh root ginger, peeled and chopped", "½ tsp cumin seeds", "2 tbsp ground coriander", "1 tbsp ground cumin", "1 tsp chilli powder (optional)", "4 cloves garlic, peeled and chopped", "1.5kg/3lbs chicken breast, skin removed, chopped", "115g/4oz cashew nuts", "1 bay leaf", "salt and freshly ground black pepper", "4 tbsp double cream", "handful fresh coriander, leaves only", "white basmati rice, cooked, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan, add the chopped onions and ginger and fry for 3-4 minutes, or until softened but not coloured. Add cumin seeds, ground coriander, ground cumin and chilli powder, if using, and lightly fry until aromatic. Stir in the chopped garlic and fry for one more minute. ", "Add the chicken pieces, cashew nuts and bay leaf, and allow the chicken to brown slightly over a medium heat. Season with salt and freshly ground black pepper, cover with boiling water, and bring to the boil. Reduce the heat to a simmer and cook gently for 15 minutes.", "Stir in the double cream, turn up the heat and allow to bubble for 4-5 minutes, or until the sauce has thickened. ", "Sprinkle over the chopped fresh coriander and serve with white basmati rice."]}, {"isVegetarian": false, "title": "Chicken korma with grilled flatbread", "url": "www_bbc_co_uk_food_recipes_chickenkormawithgril_74655", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole chicken, skinned and cut into 10 pieces: 2 drumsticks, 2 wings, 2 thighs and 4 breast portions", "150g/6oz yoghurt", "100ml/3½fl oz double cream", "1 tbsp caster sugar", "1 tsp salt", "6 cloves", "1 pinch saffron", "1 cinnamon stick", "8 green cardamom pods", "1 tsp fennel seeds", "1 tsp coriander seeds", "½ tsp cayenne pepper", "1 tbsp vegetable oil", "2 tsp cumin seeds", "4 cloves garlic", "3cm/1¼in piece fresh ginger", "3 onions, finely chopped", "50g/2oz flaked almonds, lightly crushed", "100ml/3½oz water", "2 tsp garam masala", "1 tbsp chopped coriander ", "50g/2oz fresh yeast", "2-3 tbsp lukewarm water", "500g/1lb 1½oz self-raising flour", "½ tsp caster sugar", "10 tbsp water (plus extra if needed)", "½ tsp salt", "1 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken korma, place all the marinade ingredients together in a large bowl and mix to combine. ", "Add the chicken pieces and stir well to coat evenly. ", "Cover and place in the fridge, ideally for 24 hours, but at least overnight. ", "Preheat the oven to 180C/360F/Gas 4. ", "For the onions, heat a frying pan until hot, then add the vegetable oil. ", "Add the cumin seeds, garlic and ginger and stir fry for 30 seconds. ", "Add the onions and almonds and fry for a further 2-3 minutes. ", "Place the marinated chicken into a large casserole. ", "Add the onion mixture and water and stir well to combine. ", "Cover and place in the oven for 1-1¼ hours until the chicken is tender. ", "Just before serving, stir in the garam masala and chopped coriander. ", "For the flatbread, crumble the yeast into a small bowl, then whisk in 2-3 tablespoons of lukewarm water. ", "Sift the flour, salt and sugar into another bowl. ", "Pour the yeast water onto the flour and add 10 tablespoons of water. Mix to form a dough. Add another tablespoon or more of water if necessary to achieve a pliable dough.", "Knead the dough until it is soft and pliable. ", "Place in a bowl, cover loosely and leave to prove in a warm place for two hours. ", "Remove the dough from the bowl and knead lightly to knock out the excess air. ", "Divide into golf-ball-sized balls, then allow to prove for a further 15 minutes. ", "Roll out to a thin, 14cm/7in disc. ", "Heat the vegetable oil in a griddle pan until hot, then add the disc and grill for three minutes on each side. ", "Serve with the chicken korma."]}, {"isVegetarian": false, "title": "Chicken, leek and mozzarella ravioli with creamy leek sauce", "url": "www_bbc_co_uk_food_recipes_chickenleekandmozzar_80765", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "salt and freshly ground black pepper", "1 small chicken breast, finely chopped", "15g/½oz mozzarella, finely chopped", "1 tbsp chopped basil", "1 clove garlic, finely chopped", "1 sheet of fresh lasagne, cut into six 7cm/3-inch strips, blanched", "2 free-range egg yolks, beaten", "olive oil, to drizzle", "½ leek, finely chopped", "50ml/2fl oz white wine", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "1 tbsp chopped parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a small frying pan, melt the butter. Season the chicken, then add to the pan to brown on all sides.", "In a bowl, mix together the mozzarella, basil and garlic. Lay out the lasagne strips and fill with the chicken and mozzarella mixture. Fold over and use the egg yolks to seal.", "Place on a baking tray, drizzle with olive oil and bake in the oven for 10-12 minutes, or until cooked through.", "Meanwhile for the sauce, simmer the leek in a pan with the wine for 5 minutes.", "Stir in the cream and season with salt and freshly ground black pepper.", "Finish with the parsley, then spoon over the ravioli to serve."]}, {"isVegetarian": false, "title": "Chicken, lime and cashew nut stir-fry", "url": "www_bbc_co_uk_food_recipes_chickenlimeandcashew_4133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz chicken breast, cut into thin strips ", "180g/6oz straight-to-wok fine egg noodles", "2 tbsp/30ml/1fl oz clear honey ", "4 tbsp vegetable oil ", "1 tbsp chopped fresh ginger ", "1 clove garlic, crushed", "3 spring onions, chopped", "½ red chilli, finely chopped ", "1 small carrot, sliced", "1 red pepper, cut into strips", "1 head of pak choi, chopped ", "2 tbsp dark soy sauce", "2 tbsp toasted sesame oil ", "1 lime, zest and juice ", "small bunch fresh coriander, roughly chopped", "50g/2oz unsalted, toasted cashew nuts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Firstly, prepare all the ingredients. ", "Heat a large wok to a high heat. Add a little of the oil and the chicken. Stir fry the chicken for one minute, then add the honey and continue cooking until the chicken is fully cooked and a rich golden colour. Remove from the wok and set to one side.", "Add the remaining oil to the re-heated wok and fry the garlic, ginger and chilli for about 20 seconds. Add the rest of the vegetables, keeping the heat high, stir-fry until they are just tender, but still retain some bite.", "Add the pre-cooked noodles and saute for a minute or so before returning the chicken to the pan. ", "Mix well, add the chopped coriander, adjust the seasoning - adding soy sauce sesame oil and the lime zest and juice. ", "Serve with a scattering of cashews over the top. "]}, {"isVegetarian": false, "title": "Chicken liver and almond pilaf", "url": "www_bbc_co_uk_food_recipes_chickenliverandalmon_81501", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "4 cloves garlic, finely chopped", "1 onion, chopped", "2 tbsp pine nuts", "2 tbsp flaked almonds", "1 tbsp currants", "½ tsp allspice", "1 tsp dried basil", "450g/1lb chicken livers, cleaned and finely chopped", "salt and freshly ground black pepper ", "bunch flatleaf parsley, chopped", "bunch dill, chopped", "340g/12oz long grain rice", "850ml/1½ pints chicken stock", "saffron and flatleaf parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan, then add the garlic and onion and sweat for a few minutes. Stir in the pine nuts and currants and cook for 2 minutes. Add the allspice, basil and the chicken livers and brown lightly.", "Season with salt and freshly ground black pepper and add the fresh herbs. Remove from the pan and set aside. ", "For the rice, toss the rice in the buttery residue in the pan for a couple of minutes, pour over the stock and bring to the boil. Simmer gently until the rice has absorbed some of the stock. Carefully fold in the liver mixture. Cover with a lid and leave to stand for 15 minutes. ", "Fluff up with a fork and serve, garnished with saffron and parsley."]}, {"isVegetarian": false, "title": "Chicken chow mein", "url": "www_bbc_co_uk_food_recipes_chickenchowmein_92064", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless skinless chicken breasts, sliced into thin strips", "salt, to taste", "Chinese five-spice powder, to taste", "1 red chilli, finely chopped", "1in/2.5cm piece fresh root ginger, peeled and grated ", "4 cloves garlic, peeled and finely chopped", "1 tbsp groundnut oil", "1 tbsp sesame oil", "2 carrots, peeled and cut into matchstick pieces", "1 spring cabbage, core removed, leaves finely shredded", "½ head broccoli, cut into small florets ", "2 heads bok choi, chopped", "4 spring onions, chopped", "400g/14oz egg noodles, cooked according to packet instructions", "1 small bunch fresh coriander, leaves only, chopped", "60ml/2fl oz sake, plus 1 tbsp ", "3 tbsp Shaoxing rice wine (available in some supermarkets or Asian grocers; substitute dry sherry if unavailable)", "3 tbsp sweet chilli sauce", "1½tsp nam pla (Thai fish sauce)", "1 tsp light soy sauce", "1 tsp cornflour", "1 handful beansprouts", "freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken strips into a bowl and season with the salt and Chinese five-spice powder. ", "In a small bowl, mix together the chopped chilli, grated ginger and chopped garlic. Add about a fifth of this mixture to the chicken and mix well, then set the chicken aside to marinate for a few minutes.", "Heat the groundnut oil in a wok until starting to smoke, then add the chicken and fry for 2-3 minutes, turning the chicken over once, until golden-brown all over. Transfer the seared chicken, along with any juices, from the wok into a bowl and set aside. ", "Return the wok to the heat and add the sesame oil. Fry the remaining chilli, ginger and garlic mixture for about 30 seconds, or until fragrant, then add the carrots, cabbage and broccoli and stir fry for 1-2 minutes. ", "Add the chicken back into the wok (reserving the juices). ", "In a small bowl, mix together the sake, Shaoxing rice wine, one teaspoon of the nam pla and the sweet chilli sauce, then add to the wok and stir well. ", "Add the chopped bok choi and spring onions to the wok along with the cooked egg noodles. Stir fry for 1-2 minutes to heat through, then add the beansprouts. ", "Add the light soy sauce, one tablespoon of sake, the remaining nam pla and the cornflour. Mix well to combine, then add to the wok and cook for one minute, or until the liquid has thickened slightly.", "To serve, season the chow mein with freshly ground black pepper and divide among four serving plates. Garnish with the fresh coriander leaves."]}, {"isVegetarian": false, "title": "Chicken liver parfait with brandy", "url": "www_bbc_co_uk_food_recipes_chickenliverparfaitw_90184", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenliverparfaitw_90184_16x9.jpg", "ingredients": ["200g/7oz butter, melted", "1kg/2lb 3oz chicken livers", "salt and freshly ground black pepper", "1 tbsp brandy", "4 tbsp double cream", "To decorate", "A few crushed black peppercorns"], "serves": "Serves 6-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the chicken livers, removing and discarding any greenish or sinewy bits.", "Heat two tablespoons of the melted butter in a heavy-based frying pan. When the butter begins to foam, add the chicken livers to the hot pan.", "Cook the livers gently for 3-4 minutes, carefully moving them around, but don't allow them to brown. (You may need to do this in batches, depending on the size of your pan.) Season with salt and freshly ground black pepper.", "Add the brandy to the pan and carefully flame the brandy for a few seconds to burn off the alcohol. Allow the livers to cool slightly.", "Spoon the livers (not including the cooking juices) into the bowl of a food processor and blend. With the motor running, add most of the remaining butter (reserving two tablespoons for the top) in a steady stream. Don't add the milk solids that will have sunk to the bottom of the pan.", "With the motor still running, add the double cream and blend for a few more seconds. The liver mixture should be fairly smooth.", "Pass the liver mixture through a sieve, pushing the mixture through with a wooden spoon into a bowl, discarding any hard bits that remain in the sieve (this will take about 10-15 minutes). This will make an ultra-smooth parfait.", "Spoon the parfait into a terrine dish and smooth the surface with a knife, if necessary. Sprinkle a few crushed peppercorns on top and pour over the reserved melted butter. Place in the fridge to cool and set firm for at least two hours.", "Using a spoon heated in hot water, scoop the parfait out onto a serving plate. Serve with toasted brioche and some mixed baby salad leaves."]}, {"isVegetarian": false, "title": "Chicken liver parfait with spiced apple chutney and Melba toast", "url": "www_bbc_co_uk_food_recipes_chickenliverparfaitw_90441", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, softened", "500g/1lb 2oz chicken livers, trimmed", "1 garlic clove, chopped", "2 sprigs thyme", "2 basil leaves", "3 tbsp dry sherry", "2 tbsp vegetable oil", "½ red onion, finely chopped", "2 Granny Smith apples (or similar crunchy apples), chopped", "½ tsp cinnamon", "½ tsp ground ginger", "3 tbsp alegar (vinegar made with ale) or balsamic vinegar", "2 tbsp soft brown sugar", "8 slices white bread, crusts removed"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken liver parfait, line a loaf tin with cling film.", "Heat one tablespoon of the butter in a frying pan over a medium heat. When the butter is foaming, add the chicken livers. Fry for 1-2 minutes, or until just golden-brown.", "Add the garlic, thyme, basil and sherry, then set the sherry alight with a match. Allow the flames to flare up and die down. (CAUTION: make sure the extractor fan is switched off and keep the pan away from the eyes, face and other objects.) Fry the chicken livers in the mixture for a further 1-2 minutes.", "Transfer the mixture to a food processor, add the remaining butter and blend to a smooth paste. Season, to taste, with salt and freshly ground black pepper.", "Spoon the parfait mixture into the lined loaf tin and chill in the fridge for at least three hours, or until set.", "For the spiced apple chutney, heat the oil in a separate frying pan over a medium heat. When the oil is hot, add the onion and fry for 1-2 minutes, or until softened.", "Add the apples, cinnamon and ground ginger, stir well and fry for a further 2-3 minutes, or until the apples have softened.", "Add the alegar (or balsamic vinegar) and the sugar and simmer for 2-3 minutes until the mixture has just thickened.", "Transfer half of the chutney mixture into a food processor and blend to a purée.", "Return the puréed chutney to the pan with the chunky chutney and stir until well combined. Season, to taste, with salt and freshly ground black pepper.", "For the Melba toast, preheat the grill to its highest setting. Place four of the slices of bread onto a baking tray and toast for 1-2 minutes on each side, or until crisp and golden-brown on both sides. ", "Slice the toast horizontally and return the toast to the baking tray, soft sides facing upwards. Grill for 1-2 minutes, or until crisp and golden-brown.", "Repeat the process with the remaining four slices of bread. Cut each slice of Melba toast into four triangles.", "To serve, place eight triangles of Melba toast into the centre of each serving plate. Place a thick slice of the chilled chicken liver parfait on either side of the toast. Spoon a little spiced apple chutney alongside."]}, {"isVegetarian": false, "title": "Chicken liver pâté", "url": "www_bbc_co_uk_food_recipes_chickenliverpate_85880", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenliverpate_85880_16x9.jpg", "ingredients": ["1 tbsp olive oil", "2 shallots, finely chopped", "3 sprigs thyme, leaves only", "1 garlic clove, crushed", "pinch freshly grated nutmeg", "½ tsp ground allspice", "1 orange, zest only", "sea salt and freshly ground black pepper", "400g/14oz chicken livers, trimmed of any membrane and gristle, roughly chopped", "50ml/2fl oz brandy", "100ml/3½fl oz double cream", "120g/4½oz unsalted butter, cubed", "80g/3oz unsalted butter", "pinch ground mace", "½ orange, zest only", "2 sprigs thyme, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the shallots and thyme and cook gently for five minutes, or until soft. Add the garlic, spices, orange zest and a good pinch of salt and pepper and cook for a further two minutes, or until fragrant.", "Add the chicken livers to the pan and fry for 6-8 minutes, or until just cooked through. To test, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). Remove from the heat and spoon everything into a food processor. Blend until smooth.", "Add the brandy to the pan to deglaze, then add the cream and bring to a simmer. Cook for two minutes, stirring up any of the residue from the pan. Pour into the food processor and blend again until smooth. With the motor running, gradually add the cubed butter and blend until smooth.", "Pass the mixture through a fine sieve into a bowl and then divide between four ramekins. Smooth the tops down by banging the bottom of the ramekins against the work surface, then place in the fridge while you prepare the butter finish.", "Melt the butter in a saucepan with the ground mace and spoon over the pâtés. Sprinkle over the orange zest and thyme leaves to decorate. Refrigerate for two hours before serving with slices of toasted sourdough bread and cornichon pickles."]}, {"isVegetarian": false, "title": "Chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_chickennoodlesoup_91328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp vegetable oil", "5 large spring onions, trimmed, roughly sliced on the diagonal", "1 onion, chopped", "2 garlic cloves, roughly chopped", "2cm/¾in piece ginger, finely chopped", "1 red chilli, seeds removed, sliced into thin strips", "1 head pak choi, white and green parts separated, finely chopped", "pinch salt", "2 chicken thighs, skin and bones removed, flesh chopped into strips", "1 pinch ground allspice", "1 litre/1¾ pints hot chicken stock", "1 dash soy sauce", "150g/5½oz egg noodles", "1 stalk lemongrass, lightly crushed with the edge of a knife", "2 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the spring onion, onion, garlic, ginger and chilli and fry for 2-3 minutes, or until the onions have softened slightly. ", "Add the white shreds of pak choi and the salt. Continue to fry for 3-4 minutes, or until the pak choi has wilted and the other vegetables have softened.", "Add the chicken strips and ground allspice and stir until the ingredients are well combined and coated in the allspice. Continue to fry for 2-3 minutes, or until the spices are fragrant. ", "Add the chicken stock and soy sauce to the pan. Bring to the boil and cook for 3-4 minutes. ", "Add the green shreds of pak choi, the egg noodles and lemongrass stalk and stir well. Continue to boil the mixture for 4-5 minutes, or until the noodles are tender and the chicken is completely cooked through. Just before serving, stir in the chopped coriander.", "Serve in bowls at once."]}, {"isVegetarian": false, "title": "Chicken meatballs with coconut curry", "url": "www_bbc_co_uk_food_recipes_chickenmeatballswith_79686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, cut into thin strips", "½ bell pepper chilli, chopped", "2 tbsp fresh chives, chopped", "2 tbsp fresh parsley, chopped", "2 tbsp olive oil", "50g/1¾oz grated fresh coconut flesh", "liquid from one fresh coconut", "½ lime, juice only", "1 garlic clove, finely chopped", "½ scotch bonnet chilli, chopped ", "1 tbsp fresh coriander, chopped ", "100ml/3½fl oz double cream", "fresh coriander leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the meatballs, place the chicken, chilli, chives and parsley in a food processor and blend into a mince mixture.", "Roll equal portions of the mince mixture into golf ball-size meatballs. ", "Heat the oil in a medium frying pan. Add the meatballs and fry for two minutes to brown all over.", "Transfer the meatballs to a baking sheet and place in the oven to bake for five minutes.", "Meanwhile, to make the coconut curry sauce, place the grated coconut, coconut liquid, lime juice, garlic, chilli, coriander and cream into a medium saucepan over a medium heat. Cook until reduced to a thick sauce, then pour into a warm bowl.", "To serve, place the meatballs into the bowl of coconut curry sauce and garnish with a few coriander leaves."]}, {"isVegetarian": false, "title": "Chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_chickennoodlesoup_93136", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickennoodlesoup_93136_16x9.jpg", "ingredients": ["3 chicken carcasses, plus 6 chicken legs", "2.5 litres/4 pints 8fl oz water", "3 carrots, peeled, chopped", "2 celery stalks, trimmed, chopped", "1 large leek, trimmed, sliced", "2 large onions, peeled, chopped", "2 fresh bay leaves", "1 small bunch fresh thyme", "1 tsp black peppercorns", "1 tsp salt flakes", "150g/5oz rice noodles", "1 tbsp chopped fresh parsley", "1-2 tbsp chopped fresh chives, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken carcasses and drumsticks into a large deep pan and cover with the water. Add the carrots, celery, leek and onions. ", "Make a bouquet garni with the bay leaves and the thyme by tying the herbs together with kitchen string. Add the bouquet garni to the pan along with the peppercorns and salt. ", "Cover the pan with the lid and bring the mixture to the boil, then reduce the heat until it is simmering. Simmer for about two hours, skimming off any scum that rises to the surface of the liquid from time to time. Set aside to cool slightly, then strain the stock into a smaller pan. Pick the meat from the chicken drumsticks and add it to the strained broth. ", "When ready to serve the broth, bring it to a gentle simmer, then add the noodles. Cook the noodles according to packet instructions until tender, then stir in the chopped parsley.", "Serve the chicken noodle soup in bowls with the chopped chives sprinkled over."]}, {"isVegetarian": false, "title": "Chicken on crispy noodles", "url": "www_bbc_co_uk_food_recipes_chickenoncrispynoodl_93614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz boneless, skinless chicken breasts, cut into thin strips", "1 free-range egg white ", "2 tsp cornflour", "1 tsp salt", "½ tsp freshly ground white pepper", "225g/8oz fresh thin egg noodles (substitute dried egg noodles if unavailable)", "300ml/10fl oz groundnut or vegetable oil ", "175g/6oz fresh beansprouts", "2 tbsp Shaoxing rice wine or dry sherry", "2 tbsp oyster sauce", "1 tbsp light soy sauce", "300ml/10½fl oz chicken stock ", "1 tsp salt", "½ tsp freshly ground black pepper", "1 tbsp cornflour, mixed with 1½ tbsp water", "3 tbsp finely chopped spring onions, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the chicken strips into a bowl and add the egg white, cornflour, salt and freshly ground white pepper. Mix well until the chicken is evenly coated, then cover the bowl with cling film and chill in the fridge for at least 20 minutes. ", "For the noodles, blanch the fresh egg noodles for 2-3 minutes in a large pan of boiling salted water, or until just tender. (If using dried egg noodles, cook according to packet instructions, reducing the cooking time by about 1-2 minutes.) Drain well and spread on a baking tray to cool.", "Heat a wok until very hot and add the oil (CAUTION: hot oil can be dangerous. Do not leave unattended.).  When the oil is very hot, deep-fry the noodles in batches until very crispy. Drain on kitchen paper. ", "When all the noodles are done remove the wok from the heat, and immediately add the chicken shreds, stirring vigorously to keep them from sticking.  When the chicken pieces turn white, about 2 minutes, remove with a slotted spoon and drain. ", "Clean the wok and place back over a high heat. Add the beansprouts, rice wine, oyster sauce, soy sauce, chicken stock, salt, and the black pepper. Bring the mixture to the boil, reduce the heat, stir in the cornflour mixture and bring to a simmer. Return the chicken pieces to the wok and stir to coat in the sauce. ", "To serve, place the crispy noodles on a serving plate and spoon over the chicken and sauce. Garnish with chopped spring onions."]}, {"isVegetarian": false, "title": "Chicken paprika", "url": "www_bbc_co_uk_food_recipes_chickenpaprikawithle_80341", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenpaprikawithle_80341_16x9.jpg", "ingredients": ["1 large chicken, jointed (or use 2 large chicken legs and 2 breasts, halved)", "salt", "2 tbsp olive oil", "knob butter", "1 onion, chopped", "2-3 cloves garlic, chopped", "2  tbsp sweet paprika, or 1 tbsp each sweet and hot paprika ", "1 tbsp flour", "285ml/½pint chicken stock ", "3 tbsp chopped fresh flatleaf parsley ", "2 red peppers, seeds removed and cut into 1cm/0.5in strips ", "4 large ripe tomatoes, roughly chopped", "250ml/8fl oz soured cream"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the chicken pieces with salt. Heat the oil and butter in a large heavy-bottomed pan and brown the chicken all over for a few minutes. Remove the chicken from the pan and set to one side.", "To the same pan, add the onions and garlic and sweat for about 5 minutes. Add the paprika, then the flour, and stir until combined - take care not to burn it.", "Add the stock and stir. Return the chicken pieces to the pan, adding a bit more stock if the mixtures seems too dry. Add half of the parsley and bring to the boil. Add the red pepper strips, reduce the heat and simmer for 10 minutes. Stir in the tomatoes and simmer gently for about 1 hour.", "When the chicken is cooked, remove the pan from the heat. Stir in the sour cream and the remaining parsley. Check the seasoning and serve."]}, {"isVegetarian": false, "title": "Chicken pie", "url": "www_bbc_co_uk_food_recipes_chickenpie_80250", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenpie_80250_16x9.jpg", "ingredients": ["2 tbsp butter, plus extra for frying", "1 heaped tbsp flour", "200ml/7fl oz chicken stock", "3 tbsp double cream", "squeeze of lemon juice", "sprig of fresh tarragon (optional)", "1 medium green pepper, sliced", "handful button mushrooms, wiped and quartered", "400g/14oz cooked chicken, shredded", "225g/8oz ready-made puff pastry", "1 medium free-range egg, beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C (fan)/Gas 6.", "For the sauce, melt the butter in a heavy-bottomed saucepan, add the flour and cook slowly over a low heat for 3 minutes, or until the mixture smells toasty. Pour in the chicken stock, turn up the heat and stir constantly until simmering. Add the cream and gently simmer until the sauce until it has a syrupy consistency. Add the lemon juice and tarragon. Turn off the heat.", "In another pan, gently fry the chicken, peppers and mushrooms in a knob of butter for 5 minutes, then add to the sauce.", "Butter an ovenproof dish large enough to hold the chicken pie mixture with room to spare. Add the chicken mixture to the dish. ", "Roll out the pastry on a floured work surface, to a thickness of about ¼in/1cm. Place the pastry over the filling and carefully trim the edges. Use the trimmings to make cut-out shapes to decorate the surface of the pie. Cut a couple of air holes with a knife to allow the steam to escape. Brush the pastry with the beaten egg. ", "Bake the pie in the preheated oven for about 25-35 minutes. The top should be nicely browned and the filling piping hot. Remove, allow to cool slightly and serve."]}, {"isVegetarian": false, "title": "Chicken poached in mead with glazed Chantenay carrots", "url": "www_bbc_co_uk_food_recipes_chickenpoachedinmead_91505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2kg/4lb 7oz whole chicken", "1.5 litres/2 pints 12½fl oz honey mead", "1 sprig fresh thyme", "50g/2oz butter", "1 tbsp olive oil", "500g/1lb 2oz Chantenay carrots (or other similar sweet carrots)", "75ml/3fl oz water", "50g/2oz butter", "3 tbsp honey", "½ tsp ground cumin", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken, remove the wings, legs and thighs from the chicken. Place all of the chicken pieces, including the crown, into a large pan with the honey mead and thyme sprig. Cover with a lid and bring to the boil, then reduce the heat and simmer for 25-30 minutes, or until the chicken is cooked through. Remove the chicken from the pan and pat dry, then carve the chicken breasts away from the crown. (You can reserve the chicken carcass for making stock in another recipe.)", "Return the pan with the honey mead to the heat and bring to the boil, then simmer for 6-8 minutes, or until reduced slightly. Add half of the butter and season, to taste, with salt and freshly ground black pepper. Set aside.", "Heat the remaining butter and olive oil in a frying pan until foaming, then fry the chicken pieces, skin-side down, for 2-3 minutes, or until golden-brown and crisp. Set aside and keep warm. ", "For the glazed carrots, cook the carrots in a pan of boiling salted water for 2-3 minutes, or until just tender. Drain and place into a clean pan along with the water, butter, honey and cumin, stirring well. ", "Bring to the boil, then cook for 4-5 minutes, or until the liquid in the pan thickens to a syrupy consistency and the carrots are glazed and tender. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the chicken among four serving plates and spoon some glazed carrots alongside. Drizzle over the reduced honey mead and serve."]}, {"isVegetarian": false, "title": "Chicken, potato and chickpea curry with basmati rice", "url": "www_bbc_co_uk_food_recipes_chickenpotatoandchic_91415", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, chopped into 2cm/1in pieces", "2cm/1in fresh root ginger, finely chopped", "5 garlic cloves, finely chopped ", "2 tbsp vegetable oil, plus extra for frying the chicken", "400g/14¼oz basmati rice, washed and soaked in cold water for at least 30 minutes", "600ml/1 pint 1½fl oz water", "2 tbsp vegetable oil", "1 large onion, finely sliced", "4 garlic cloves, finely chopped", "5cm/2in fresh root ginger, finely chopped", "2 tbsp mild Madras curry powder", "200ml/7¼fl oz coconut milk", "200ml/7¼fl oz chicken stock", "1 x 400g/14¼oz can chopped tomatoes", "2 large potatoes, peeled and roughly chopped into large chunks", "1 x 400g/14¼oz can chickpeas, drained and rinsed", "handful fresh coriander, finely chopped"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, combine the chicken, ginger, garlic and vegetable oil in a shallow non-reactive dish. Cover and leave in the fridge to marinate for at least one hour.", "For the basmati rice, place the rice into a pan with a lid. Add the water and bring to the boil over a medium heat with the lid on. Once boiling, reduce to a simmer and cook for 8-10 minutes. Remove from the heat and leave to stand for at least 10 minutes before serving.", "Meanwhile, for the curry, heat the oil in a large pan over a medium heat. Add the onion and cook for 10 minutes, or until the onion has softened and has taken on some colour. Add the garlic and ginger and cook for a further five minutes. Add the curry powder and cook for two minutes.", "Stir in the coconut milk, chicken stock and tomatoes. Bring to the boil and add the potatoes. Simmer for about 10 minutes, or until the potatoes are just tender.  Add the chickpeas and bring back to the boil. Simmer for two minutes.", "To cook the chicken, heat a splash of oil in a frying pan over a high heat. Cook the chicken on all sides until golden-brown and cooked through. Reserve the chicken, covered, in a warm place until ready to serve.", "To serve, place generous amounts of the curry and chicken onto the rice on plates. Garnish with the chopped coriander."]}, {"isVegetarian": false, "title": "Chickens' feet with garlic, tomatoes and spaghetti", "url": "www_bbc_co_uk_food_recipes_chickens_feet_with_11790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 chickens' feet, boiled for 40-45 minutes then scrubbed to remove the skin and any calluses  ", "4 tbsp olive oil", "2 garlic cloves, finely chopped", "1 red chilli, finely chopped ", "5 tbsp white wine", "10 datterini tomatoes (or baby plum tomatoes), halved ", "200g/7oz spaghetti", "4 tbsp freshly chopped parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan and add the oil. Once hot, add the garlic and chilli into pan. ", "Add the chicken’s feet, wine and 5 tablespoons water. Bring to the boil then add the tomatoes and cook for 5-10 minutes.", "In the meantime heat a saucepan of boiling salted water and cook the spaghetti according to the packet instructions.", "Toss the drained spaghetti in the sauce and garnish with parsley."]}, {"isVegetarian": false, "title": "Chicken salad with couscous and oranges", "url": "www_bbc_co_uk_food_recipes_chickensaladwithcous_92275", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickensaladwithcous_92275_16x9.jpg", "ingredients": ["2 large handfuls couscous", "1 lemon, juice only", "3 oranges, 2 juice only, 1 left whole", "couple glugs fruity olive oil ", "salt and freshly ground black pepper ", "handful chicken meat from a leftover organic roast chicken", "handful chopped fresh chives ", "handful fresh basil leaves, more if you fancy ", "handful pea shoots"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the couscous in a bowl and pour over some boiling water (it should cover the grains by a couple of centimetres or so). Leave for about 15 minutes, until the couscous has absorbed the liquid.", "In a separate mixing bowl, whisk together the lemon juice and the orange juice with the olive oil and season well with salt and freshly ground black pepper, adding more olive oil if desired. Pour the dressing over the cooked couscous and let it soak the dressing up for about 10 minutes.", "Meanwhile, peel the remaining orange by cutting the ends off, placing it on a chopping board and cutting down the sides with a sharp knife to remove the skin and pith. Cut the orange into good-sized chunks. Add the orange chunks, chicken and herbs to the couscous and mix gently. Don't over-mix; it's about a lightness of touch. ", "Divide the pea shoots between two plates or shallow dishes and then gently top each with the chicken couscous salad."]}, {"isVegetarian": false, "title": "Chicken salad with Thai basil and coconut dressing", "url": "www_bbc_co_uk_food_recipes_chickensaladwiththai_91766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz palm sugar", "50ml/2fl oz fish sauce", "2 x 400ml/14fl oz cans coconut milk", "8 boneless skinless chicken thighs", "ice cubes (optional)", "8 lime leaves, very finely sliced", "4 red Thai shallots, peeled, thinly sliced", "1 red pepper, seeds removed, finely sliced", "3 small red chillies, finely sliced ", "1 cucumber, cut in half lengthways, seeds scooped out with a teaspoon, flesh julienned", "1 large bunch coriander, leaves only", "1 small bunch mint, leaves only", "1 small bunch Thai basil, leaves only", "1 tsp vegetable oil", "1 tsp cold water", "4 square pieces banana leaf, 15cm x 15cm/6in x 6in (available from some Asian grocers)", "50g/2oz roasted salted peanuts, lightly crushed", "1 coconut, shell removed, flesh thinly sliced (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the palm sugar, fish sauce and coconut milk to the boil in a pan.", "Reduce the heat until the mixture is simmering. Add the chicken thighs and poach in the liquid for 4-5 minutes, or until the chicken is just cooked through. (NB: The chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part.) Remove the chicken thighs from the cooking liquid using a slotted spoon and pat dry with kitchen paper. Reserve the cooking liquid.", "Heat a griddle pan over a high heat. Add the poached chicken and cook for 3-4 minutes, turning regularly, until golden-brown griddle marks appear on all sides. Set aside. ", "Meanwhile, return the cooking liquid to the heat and bring to the boil. Continue to boil for 1-2 minutes, then transfer the cooking liquid to a bowl and place the bowl into a sink or large dish filled with ice, if using, or filled with cold water. ", "Add the sliced lime leaves to the hot coconut milk and whisk until the liquid has cooled and the lime leaves are fragrant.", "In a separate bowl, mix together the shallots, pepper, chillies and cucumber until well combined.", "Add one tablespoon of the coconut and lime mixture to the salad and mix to coat the ingredients in the dressing.", "When the chicken thighs are cool enough to handle, slice the meat into strips and add to the salad. Mix to combine. ", "Add the herbs and mix well to combine. ", "To serve, mix the teaspoon of vegetable oil with one teaspoon of water. Brush the squares of banana leaf with this mixture. Place one square of banana leaf into the centre of each of four serving plates. Divide the chicken salad equally among the squares of banana leaf. Drizzle over a little of the remaining coconut and lime dressing. Sprinkle over the peanuts and the coconut, if using."]}]