[{"ingredients": ["4 cucharadas de aceite vegetal", "4 corderos", "20g / ¾oz semillas de cilantro", "½ cucharadita de semillas de comino", "½ cucharadita de polvo de cúrcuma", "1 ramita de canela", "3 vainas de cardamomo, aplastadas y sin semillas", "1 estrella de anís", "1 cebolla grande, en rodajas", "3 dientes de ajo picados", "3 chiles rojos, semillas retiradas y picadas", "1 pedazo de raíz de jengibre fresco, pelado y picado", "1 tallos de limoncillo, machacados", "1 hoja de laurel", "50g / 1¾oz de pasta de tamarindo", "1 x 400 g / 14 oz de leche de coco de estaño", "250ml / 9 oz de caldo de carne caliente", "200g / 7oz de arroz basmati", "1 cucharada de hojas de cilantro", "1 lima, solo jugo"], "method": ["Para el rendang de cordero, caliente una cazuela grande o una sartén a prueba de horno y agregue dos cucharadas de aceite. Freír las patas de cordero para sellarlas y reservarlas.", "En una sartén seca, tueste suavemente las semillas de cilantro, las semillas de comino, la cúrcuma, la ramita de canela, las semillas de cardamomo y el anís estrellado hasta que estén fragantes. Incline en un molinillo de especias y muele a un polvo (alternativamente coloque en un mortero y machaque con un mortero hasta que las especias estén lo más finas posible).", "En una sartén grande caliente el aceite restante y, una vez caliente, agregue la cebolla, el ajo, los chiles, el jengibre y el limoncillo machacado. Cocine suavemente hasta que las cebollas se hayan suavizado y la mezcla empiece a oler fragante.", "Agregue las especias molidas y la hoja de laurel y fría por unos minutos más hasta que la mezcla esté realmente llena de aroma.", "Agregue las patas de cordero, aumente el fuego y revuelva para dorar la carne y cúbrala completamente con las especias; esto llevará unos minutos.", "Agregue la pasta de tamarindo y la leche de coco, deje que hierva y luego agregue el caldo tibio.", "Aumente el fuego a alto y continúe cocinando para reducir el volumen de líquido en la sartén. Revuelva de vez en cuando hasta que la salsa se reduzca a una pasta espesa, luego reduzca el fuego a bajo y siga cocinando y revolviendo hasta que la salsa sea realmente espesa y cubra la carne, aproximadamente 2½ horas.", "Para el arroz de cilantro, coloque el arroz en una sartén con 365 ml / 12 fl oz de agua salada. Cocine a fuego lento hasta que el agua se haya evaporado, luego retírela del fuego, cúbrala con una tapa y déjela que hierva durante 10 minutos.", "Cuando el arroz esté cocido, revuelva a través de las hojas de cilantro y el jugo de limón.", "Para servir, apile el arroz en platos para servir y coloque una pierna de cordero en la parte superior y cuchara sobre la salsa Rendang."], "url": "www_bbc_co_uk_food_recipes_lamb_rendang_with_83481", "title": "Rendang de cordero con cilantro y arroz con lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de cilantro fresco, tallos y hojas separados", "1 chile rojo, sin semillas y más o menos picado", "2 cucharaditas de semillas de cilantro, tostadas y molidas", "2 cucharaditas de semillas de comino, tostadas y molidas", "1 cucharadita de granos de pimienta negra, aproximadamente molidos", "2 cucharaditas de pimentón", "1 cucharadita de cúrcuma", "2 cucharaditas de sal masala", "pizca de sal", "2 cucharadas de puré de tomate", "1 cucharada de aceite de maní", "5cm / 2in canela en rama", "5 vainas de cardamomo, ligeramente trituradas", "3 hojas secas de laurel", "4 dientes", "1 cebolla, más o menos picada", "Filete de cordero de 600 g / 1lb y 5 onzas, sin grasa visible, cortado en trozos de 3 cm.", "2 dientes de ajo, pelados y triturados", "1 pedazo de jengibre fresco de raíz, pelado y finamente rallado", "100g / 3½oz de yogur natural sin grasa"], "method": ["Para hacer la pasta, en una batidora, mezcle los tallos de cilantro, el chile rojo, las especias molidas y la sal. Mezcle el puré de tomate.", "Para cocinar el cordero, caliente el aceite en una cazuela grande de base pesada. Freír la ramita de canela, las vainas de cardamomo, las hojas de laurel y los clavos durante 2 minutos. Agregue la cebolla y el cordero y fría por 4-5 minutos, revolviendo. Agregue el ajo y el jengibre y fría por 2 minutos.", "Agregue la pasta de especias y fría por otros 2 minutos, revolviendo", "Agregue 400 ml / 14 fl oz de agua, luego cubra con una tapa y cocine a fuego lento durante 40-50 minutos, hasta que esté cocido. Agregue el yogur y cocine durante 10 minutos. Servido con las hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_lamb_rogan_josh_04376", "title": "Cordero Rogan Josh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_rogan_josh_04376_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 limones, solo jugo", "75ml / 3fl oz de aceite de oliva", "6 dientes de ajo, dejados enteros", "2 cucharadas de romero fresco picado", "4 grupas de cordero, con grasa en", "sal y pimienta negra recién molida", "50g / 2oz de hojas frescas de perejil de flatleaf", "Hojas de cohete de 25g / 1oz", "15 g / ½ oz de hojas de menta fresca", "15g / ½ oz de mejorana fresca", "4-6 cucharadas de aceite de oliva (para cubrir las hierbas)", "¼ diente de ajo", "1½ cucharadas de alcaparras", "6 filetes de anchoa", "1 cucharada de mostaza Dijon, o al gusto", "sal y pimienta negra recién molida", "4 calabazas de cebolla (u otra calabaza pequeña de otoño), peladas y cortadas a la mitad, sin semillas, carne cortada en cubos de 3cm / 1¼ en cubitos", "35ml / 1¼fl oz de aceite de oliva, más extra para lloviznar", "1 cucharadita de hojas frescas de tomillo", "1 diente de ajo, finamente picado", "800 g / 1 libra de espinaca fresca de 12 oz", "sal y pimienta negra recién molida"], "method": ["Para el cordero, precaliente el horno a 190C / 375F / Gas 5.", "Vierta el jugo de limón y el aceite de oliva en un tazón. Agregue los seis dientes de ajo enteros y todo el romero y mezcle.", "Agregue la rabadilla de cordero y frótelo todo con el adobo. Dejar de lado por lo menos una hora.", "Mientras tanto, para la salsa verde, pique finamente las hierbas y cúbralas con aceite inmediatamente para que no se vuelvan marrones.", "Vierte el ajo, las alcaparras y las anchoas hasta obtener una pasta en un mortero (o en un procesador de alimentos).", "Mezcle las hierbas en la pasta, luego mezcle la mostaza Dijon, al gusto.", "Sazonar, al gusto, con sal y pimienta negra recién molida (recuerde que las anchoas y las alcaparras son bastante saladas).", "Para la calabaza asada, coloque los cubos de calabaza en un plato resistente al horno. Mezcle con el aceite de oliva, el tomillo y el ajo picado.", "Cubra el plato con papel de aluminio y cocínelo durante 30 minutos, o hasta que se ablande.", "Retire el papel de aluminio y vuelva a colocar la calabaza en el horno durante otros 5-10 minutos, o hasta que se dore. Mantener caliente", "Retire el cordero del adobo y seque. Sazonar todo con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno a fuego muy alto. Cuando la sartén esté caliente, agrega la rabadilla de cordero marinada y fríe por todos lados, o hasta que se dore por todos lados.", "Transfiera el cordero al horno y tueste durante 10-12 minutos (para mediano, dependiendo del tamaño de la grupa).", "Retire el cordero del horno y déjelo a un lado para que descanse durante un par de minutos.", "Mientras el cordero descansa, ponga a hervir un sartén de agua con sal. Agregue la espinaca y hierva por un minuto, o hasta que se marchite. Escurrir en un colador y presionar ligeramente con el dorso de una cuchara de madera para eliminar el exceso de agua. Sazonar, al gusto, con sal y pimienta negra recién molida y rociar un poco de aceite de oliva.", "Para servir, espolvorea un poco de la calabaza asada en el centro de cada uno de los cuatro platos para servir. Apila un poco de espinaca encima de cada porción de calabaza. Tallar cada grupa de cordero longitudinalmente en tres rebanadas y apoyarlas contra la espinaca y la calabaza. Cuchara de salsa verde encima del cordero."], "url": "www_bbc_co_uk_food_recipes_lamb_rump_with_roasted_47021", "title": "Ramillete de cordero con calabaza asada y salsa verde", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "500g / 1lb 1oz de carne de cordero", "1 cucharada de cilantro molido", "2 cucharadas de comino molido", "½ cebolla roja, finamente picada", "3 cucharadas de perejil de flatleaf fresco finamente picado", "1 chile rojo, sin semillas, finamente picado", "4 cucharadas de pan rallado fresco", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "12 rodajas de prosciutto", "150 g / 5¼ oz de guisantes frescos (peso sin cáscara)", "150 g / 5¼ oz de habas frescas (peso envasadas)", "6 lonjas de tocino ahumado, cortadas en tiras", "pequeño puñado de cohetes", "Pequeño puñado de espinacas baby", "6 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino blanco", "1 cucharadita de mostaza integral", "2 cucharadas de crema", "200g / 7¼ oz de yogur natural", "¼ de pepino, pelado, cortado en cubitos", "2 cucharadas de menta fresca picada", "sal y pimienta negra recién molida."], "method": ["Para las salchichas de cordero, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Engrase ligeramente una bandeja de horno", "Coloque la carne de cordero en un tazón grande y divídalo con un tenedor. Agregue el cilantro molido, el comino, la cebolla, el perejil, el chile y las migas de pan y revuelva. Agregue el huevo, la sazón, al gusto, con sal y pimienta negra recién molida y mezcle hasta que estén bien combinados.", "Divida la mezcla en 12 porciones, moldee cada porción en una salchicha con sus manos, luego envuelva en una rebanada de jamón. Coloque las salchichas en la bandeja de hornear preparada y hornee durante 20-25 minutos, o hasta que estén doradas y cocidas.", "Mientras tanto, para la salsa de yogur y pepino, mezcle todos los ingredientes en un tazón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada verde fresca con tocino, cocine al vapor los guisantes y las habas por tres minutos, o hasta que estén tiernos. Refresque los guisantes y las habas en un recipiente con agua helada, luego escurra y seque con papel de cocina.", "Freír el tocino en una sartén durante 1-2 minutos en cada lado, o hasta que estén crujientes. Poner a un lado para drenar en papel de cocina.", "Para la cremosa vinagreta de mostaza, mezcle todos los ingredientes en un tazón pequeño. Coloque el cohete, la espinaca, los guisantes, las habas y el tocino en un tazón grande, vierta sobre el aderezo y mezcle hasta que estén bien combinados.", "Para servir, coloque las salchichas en cada uno de los cuatro platos y sirva la ensalada al lado. Sirva el yogur y el dip de pepino en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_lamb_sausages_in_82136", "title": "Salchichas de cordero en jamón con ensalada verde fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de colza", "12 salchichas de cordero", "1 repollo verde, rallado", "2 cucharadas de sal", "55 g / 2 oz de mantequilla", "6 lonchas de tocino, cortadas en tiras pequeñas", "1 chalote, finamente picado", "1 cucharada de vinagre de vino blanco", "sal pimienta negra recién molida", "12-16 papas nuevas, hervidas", "perejil rizado fresco, picado, para adornar"], "method": ["Caliente el aceite en una sartén grande y cocine las salchichas, volteándolas regularmente, durante 15-20 minutos, o hasta que estén bien cocidas.", "Mientras tanto, en un tazón, mezcle el repollo con la sal. Ponga a hervir una olla grande de agua, luego sumerja la col en el agua por 30 segundos. Escurra el repollo, luego póngalo en un tazón grande de agua fría. Escurrir de nuevo y dejar de lado.", "Derrita la mantequilla en una sartén grande y fría el tocino hasta que esté ligeramente dorado. Baje el fuego y agregue la chalota. Agregue la col y el vinagre escurridos y cocine por tres minutos, o hasta que se haga a su gusto. Sazone al gusto con sal y pimienta.", "Sirva las salchichas con la col y las patatas nuevas, adornadas con el perejil picado."], "url": "www_bbc_co_uk_food_recipes_lamb_sausages_on_lightly_66276", "title": "Salchichas de cordero en repollo ligeramente encurtido y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "4 corderos", "2 cebollas, rebanadas gruesas", "4 dientes de ajo, finamente picados", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "½ cucharadita de pimienta de cayena", "½ cucharadita de canela molida", "½ cucharadita de cardamomo molido", "½ cucharadita de jengibre molido", "600ml / 20fl oz de caldo de pollo", "Azafrán de pellizco grande, empapado en agua tibia", "sal y pimienta negra recién molida", "1 cucharada de miel", "12 higos secos", "1 cucharada de limón en conserva, finamente picado", "1 cucharada de jugo de limón", "pocas hojas de perejil", "algunas hojas de menta"], "method": ["Caliente el aceite de oliva en una cazuela grande. Agregue las espigas, dos a la vez, y dore bien en todos los lados. Retire las espigas de la cazuela y agregue las cebollas. Freír durante varios minutos hasta que comience a tomar un poco de color, luego agregue el ajo y las especias. Cocine por un par de minutos más.", "Vierta el caldo de pollo, el azafrán y el agua empapada. Regrese las espigas a la cacerola y sazone bien con sal y pimienta. Llevar a ebullición, luego baje y cubra.", "Cocine por alrededor de dos horas, o hasta que los dientes estén tiernos. Retire las espigas de la cazuela y quite el exceso de grasa. Regrese las espigas a la cazuela y agregue la miel, los higos y el limón en conserva.", "Continúe cocinando a fuego medio, sin tapa, durante media hora más, para ablandar los higos y reducir el volumen de líquido. Revuelva a través del jugo de limón y pruebe el condimento. Añadir sal y pimienta al gusto.", "Sirva el tagine adornado con perejil y hojas de menta."], "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_18307", "title": "Tagine de cordero con higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles verdes, tallo eliminado, roto", "2 cucharadas de cilantro fresco picado (tallo, tallo y hojas)", "3 dientes de ajo, pelados", "1 cm / ½ en pieza de raíz fresca de jengibre, pelada", "50 g / 1¾oz de grasa de cordero (preferiblemente alrededor del riñón)", "½ cucharada de chile rojo de Cachemira en polvo", "1 cucharadita de semillas de comino, ligeramente tostadas", "1 cucharadita de sal masala", "1 cucharadita de sal", "450 g / 1 libra de carne de cordero (o cordero deshuesado en cubitos)", "2 cebollas rojas, 1 pelada y muy finamente picada, 1 rebanada en rodajas de 3-5 mm de espesor", "1 pimiento rojo, sin semillas, muy finamente picado", "1 tomate grande, cortado en rodajas de 3-4 mm de espesor", "1 cucharada de cilantro fresco picado (tallo, tallo y hojas)", "100 g / 3½ oz de hojas y tallos de cilantro, lavados a fondo para eliminar la arena", "Hojas de menta de 20g / 1oz, tallos eliminados (opcional)", "3 dientes de ajo, pelados", "3 chiles verdes tailandeses, tallos eliminados", "3 cucharadas de aceite vegetal", "1 cucharadita de sal", "½ cucharadita de azúcar", "1 limón, solo jugo", "verdes de ensalada, para servir", "1 granada, semillas retiradas", "panes naan, para servir (opcional)"], "method": ["Para el kebab, coloque todos los ingredientes excepto la carne picada en un procesador de alimentos. Mezcle hasta que esté completamente combinado, luego agregue la carne picada y el pulso brevemente, esto mantendrá la textura de la carne. Alternativamente, mezcle todos los ingredientes en un bol y páselos a través de una picadora.", "Enfriar la carne picada con especias en la nevera durante una hora para disfrutar de los sabores y reafirmar.", "Para el abrigo vegetal, mezcle todos los ingredientes y sazone con sal, al gusto. Dejar de lado.", "Para el kebab, precaliente una barbacoa o parrilla a caliente.", "Divide la carne picada en dos partes iguales. Toma la mitad y divídelo en seis bolas del mismo tamaño. Moje sus manos y use sus dedos, extienda lentamente la carne picada en los pinchos para hacer kebabs de 8-10cm / 3¼-4 pulgadas de largo. Para evitar que la mezcla se pegue, mantén las manos húmedas e intermitentemente echa agua sobre los kebabs a medida que los haces. Esto suavizará la textura exterior del kebab. Asegúrese de que los kebabs sean bastante gruesos, ya que esto ayudará a retener los sabores y los jugos.", "Cubra los kebabs con la mitad de las verduras picadas y presione ligeramente para que las verduras coloridas se adhieran a la carne picada. Dejar de lado hasta que esté listo para cocinar.", "Divida la mezcla picada restante en seis bolas. Extienda las verduras picadas restantes en una tabla de cortar, luego presione las bolas de carne picada en las verduras para que se peguen a un lado. Dejar de lado.", "Para el chutney de cilantro verde, en un procesador de alimentos mezcle las hierbas, el ajo y los chiles hasta obtener una consistencia suave y con cuchara. Transfiera a un tazón pequeño y cubra con el aceite. (Esto se mantendrá en la nevera durante 2-3 días, pero una vez que se hayan agregado la sal y el limón, es mejor usarlo de inmediato).", "Cuando esté listo para usar, mezcle la sal, el azúcar y el jugo de limón. Prueba para verificar el condimento.", "Cocine los kebabs en la barbacoa o debajo de una parrilla durante 6-8 minutos, volteándolos regularmente para asegurarse de que la carne esté bien cocinada.", "Cocine las empanadas de carne en una parrilla o parrilla caliente durante 3-4 minutos, primero con el lado de vegetales, luego voltéelas y cocine durante otros 2-3 minutos.", "Descanse los kebabs durante unos minutos y luego sirva con la salsa picante de cilantro verde, las hojas de ensalada y las semillas de granada. O sirva en panes naan para hacer envolturas."], "url": "www_bbc_co_uk_food_recipes_lamb_seekh_kebab_07913", "title": "Long learning kebab", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 Dirígete al messenger", "½ cucharadita de canela molida", "½ cucharadita de jengibre molido", "½ cucharadita de pimentón dulce ahumado", "½ cucharadita de comino molido", "¼ cucharadita de pimienta negra recién molida", "¼ cucharadita de cúrcuma molida", "4 corderos", "3 cucharadas de aceite de oliva", "1 cebolla, rebanada gruesa", "2 dientes de ajo, pelados, finamente picados", "1 x 400g / 14oz de tomates picados en lata", "1 cucharada de miel líquida", "2 cucharadas de melaza de granada (disponible en supermercados de Oriente Medio y algunos supermercados)", "½ cucharadita de azafrán", "350ml / 12fl oz de caldo de pollo", "Albaricoques secos sin hueso 125g / 4½oz, partidos por la mitad", "Aceitunas verdes 110 g / 4 oz, piedras quitadas", "75g / 2½oz de almendras enteras", "sal y pimienta negra recién molida", "2 limones en conserva, sólo corteza, picada", "175g / 6oz de trigo bulgur", "350ml / 12fl oz de caldo de pollo", "1 cebolla roja pequeña, finamente picada", "100 g / 3½ oz de pistachos, picados", "1 limón, solo jugo", "1 granada, solo semillas", "3 cucharadas de aceite de oliva virgen extra", "racimo pequeño de perejil fresco de hoja plana, cilantro y menta, picado", "sal y pimienta negra recién molida"], "method": ["Para tagine del cordero, precalentar el horno a 160 ° C / 315 ° F / Gas 3.", "Mezcle el ras-el-hanout, canela molida, jengibre molido, pimentón dulce ahumado, comino molido, pimienta negra recién molida y cúrcuma molida en un bol. Agregue los dientes de cordero y entregue la mezcla para cubrirlos uniformemente.", "Caliente una sartén grande hasta que esté humeante, luego agregue una cucharada de aceite de oliva y dore las patas de cordero por todos lados durante 2-3 minutos, o hasta que se doren por todas partes. Retire las espigas de cordero de la sartén y déjelas a un lado.", "Agregue el aceite de oliva restante a la misma sartén y fría la cebolla y el ajo durante 2 a 3 minutos, o hasta que se ablanden. Agregue las espigas de cordero a la sartén y revuelva bien, luego agregue todos los ingredientes restantes del tajine - a excepción del cilantro y la sal y la pimienta negra recién molida - y cocine a fuego lento.", "Reduzca el fuego, cubra la olla con una tapa y colóquela en el horno durante dos horas, o hasta que el cordero esté tierno.", "Retire la tapa y cocine por otros 30 minutos, o hasta que la tagine esté ligeramente espesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el tabbouleh, coloque el trigo bulgur en una sartén con el caldo de pollo. Llevar a ebullición, luego reduzca el fuego a fuego lento. Cubra la olla con una tapa y cocine durante 8-10 minutos a fuego lento. Verifique que el trigo bulgur sea tierno. Si no cocine por un poco más de tiempo. Cuando esté cocido escurra el exceso de caldo.", "Retire del fuego y deje enfriar un poco, y luego transfiera el trigo bulgur a un recipiente. Agregue la cebolla roja, los pistachos, el jugo de limón, la granada, el aceite de oliva y las hierbas y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el tabbouleh entre cuatro platos para servir, y luego espolvoree el tajine de cordero al lado y espolvoree el cilantro y limones en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_28848", "title": "Tagine de cordero con tabbouleh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 corderos", "3 cucharadas de aceite de oliva", "1 cebolla, rebanada gruesa", "2 dientes de ajo, pelados, finamente picados", "1 Dirígete al messenger", "2 cucharadas de pasta harissa", "2 palitos de canela", "½ cucharadita de jengibre molido", "½ cucharadita de pimentón dulce ahumado", "1 cucharadita de comino molido", "¼ cucharadita de pimienta negra recién molida", "½ cucharadita de cúrcuma molida", "1 x 400g / 14oz de tomates picados en lata", "1 cucharada de miel clara", "½ cucharadita de azafrán", "350ml / 12fl oz de caldo de pollo", "Albaricoques secos sin hueso 125g / 4½oz, partidos por la mitad", "Aceitunas verdes 110g / 3¾oz, piedras quitadas", "100g / 3½oz de almendras en copos, deja algunos para decorar", "sal y pimienta negra recién molida", "175g / 6oz de trigo bulgur", "350ml / 12fl oz de caldo de pollo", "1 cebolla roja pequeña, finamente picada", "Pistachos 350g / 12oz, conchas eliminadas, más o menos picadas", "1 limón, jugo y ralladura", "1 granada, solo semillas", "3 cucharadas de aceite de oliva virgen extra", "3 cucharadas de perejil fresco de hoja plana picado", "3 cucharadas de hojas de cilantro fresco picado", "3 cucharadas de menta fresca picada", "3 cucharadas de estragón fresco picado", "2 cucharadas de berro de coriandro"], "method": ["Para el tagine del cordero, precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Caliente una sartén tagine grande o un plato grande a prueba de horno. Sazonar las patas de cordero con sal y pimienta. Vierte el aceite de oliva y, una vez caliente, fríe las espigas de cordero por todas partes hasta que estén doradas. Sácalos de la sartén y ponlos a un lado.", "En la misma sartén que solía freír las espigas, agrega la cebolla y el ajo y freír durante 2-3 minutos.", "Agregue el ras-el-hanout, harissa, canela, jengibre molido, pimentón dulce ahumado, comino molido, pimienta negra recién molida y cúrcuma molida y cocine por otros dos minutos.", "Agregue las espigas de cordero a la sartén y revuelva bien, luego agregue todos los ingredientes tagine restantes, excepto algunas almendras en copos para adornar.", "Reduzca el fuego, cubra la olla con una tapa y cocine en el horno durante dos horas, o hasta que el cordero esté tierno.", "Retire la tapa y cocine por otros 30 minutos, o hasta que la tagine esté ligeramente espesa.", "Para el tabbouleh, coloque el trigo bulgur en una sartén con el caldo de pollo. Llevar a ebullición, luego reduzca el fuego a fuego lento. Cubra la olla con una tapa y cocine durante 15-20 minutos a fuego lento. Cuando el trigo bulgur esté tierno, escurra el exceso de caldo.", "Retire del fuego y deje enfriar un poco, y luego transfiera el trigo bulgur a un recipiente. Agregue la cebolla roja, los pistachos, el jugo de limón y la ralladura, la granada, el aceite de oliva y las hierbas, y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el tabbouleh entre cuatro platos para servir, y luego coloque el tagine de pierna de cordero al costado. Picar el berro de cilantro y espolvorear sobre el tagine junto con las almendras en copos."], "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_41954", "title": "Tagine de cordero con tabbouleh de hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x pierna de cordero", "pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cebollas, más o menos picadas", "1 diente de ajo, en rodajas", "4 filetes de anchoa, picados", "2 ramitas de romero", "2 hojas de laurel", "250ml / 8fl oz de pollo o caldo de carne", "250ml / 8fl oz de vino tinto", "puñado de perejil fresco, picado"], "method": ["Precalentar el horno a 160 ° C / 300 ° F / Gas 4.", "Sazone las espigas de cordero con la pimienta. Dorarlos en una cazuela con un poco de aceite de oliva.", "Cuando las espigas estén ligeramente doradas, agregue las cebollas y el ajo picados. Cortar dos filetes de anchoa y agregar a la cazuela. Rasgue en el romero y las hojas de laurel. Luego agregue el caldo y el vino y cocine a fuego lento.", "Cuando hierva a fuego lento, ponga la tapa y hornee en el horno durante dos horas, con un pequeño giro de las espigas a la mitad.", "Retire las espigas a un plato de servir y deje reposar en un horno tibia.", "Mientras tanto, tiende a la salsa agregando dos más anchoas picadas y un puñado de perejil picado. Llevar la salsa a ebullición, revisar el condimento y luego verter sobre las patas de cordero en reposo y servir."], "url": "www_bbc_co_uk_food_recipes_lamb_shanks_with_anchovy_36460", "title": "Caña de cordero con anchoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_shanks_with_anchovy_36460_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 corderos", "1 cucharada de aceite de colza", "2 cebollas, más o menos picadas", "4 dientes de ajo, aplastados", "2 cucharadas de harina natural, más extra para quitar el polvo", "250ml / 9fl oz de vino blanco", "750ml / 1¼ pintas de caldo de pollo", "Papas de 600 g / 1 lb 5 oz, peladas y cortadas en piezas de 2.5 cm / 1 in", "3 zanahorias grandes, cortadas en piezas de 2.5cm / 1in", "4 tallos de apio, cortados en piezas de 2.5cm / 1in", "2 hojas de laurel", "2 ramitas de romero fresco", "4 ramitas de tomillo fresco", "1 x 400 g de alubias de estaño, escurridas", "1 huevo de gallinas camperas y 1 yema de huevo de gallinas camperas, ligeramente machacadas", "400 g / 14oz de hojaldre listo para usar", "Guisantes 300 g / 10½ oz", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Sazonar las patas de cordero con sal y pimienta negra recién molida.", "Caliente el aceite en una cazuela grande e ignífuga a fuego alto. Agregue las espigas de cordero y fría por unos segundos por todos lados, o hasta que se dore por todas partes. Retire de la cazuela y reserve.", "Reduzca el fuego a medio, agregue las cebollas y fría por 2-3 minutos, o hasta que se ablanden. Agregue el ajo y fría por otros 1-2 minutos. Agregue la harina para que se forme una pasta con los jugos de la sartén. Continúe cocinando por un minuto, luego vierta lentamente el vino y el caldo, revolviendo bien para combinarlo con la pasta de harina.", "Agregue las papas, las zanahorias, el apio, las hojas de laurel, el romero y el tomillo y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Agregue los frijoles escurridos, luego devuelva los trozos de cordero a la cazuela y lleve la mezcla al punto de cocción lenta. Cubra la cazuela con la tapa y transfiérala al horno por 2 horas. Alternativamente, cocine a fuego lento sobre la placa.", "Cuando la carne en las patas de cordero se separa fácilmente del hueso pero no se cae, retire la cazuela del horno (o placa).", "Transfiera el contenido de la cazuela a un plato grande para pastel, colocando las patas de cordero en posición vertical. Dejar de lado para enfriar por completo. (El cordero debe estar completamente frío antes de cubrirlo con la masa).", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cepille el interior y el exterior del borde del plato para pastel con un poco de huevo batido y yema de huevo.", "Extienda la masa en una superficie de trabajo ligeramente enharinada hasta que esté a 5 cm / 2 pulgadas más grande que el diámetro del molde para pasteles y tenga alrededor de 0.5 cm / ¼ de grosor.", "Cuidadosamente coloque la masa sobre las patas de cordero en el plato para pastel. Con un cuchillo afilado, haga cuatro pequeñas ranuras en la masa donde están los huesos del cordero, luego empuje suavemente la masa alrededor de los huesos para que se peguen.", "Engarce la masa alrededor del borde del plato para sellarlo en el borde exterior. Cepille la masa con el huevo batido restante y salpique la parte superior con sal.", "Hornee el pastel en el horno durante 45-60 minutos, o hasta que la masa se haya levantado y esté dorada por completo y el relleno esté caliente.", "Justo antes de servir, cocine los guisantes en una sartén con agua salada y hirviendo durante 3-4 minutos o hasta que estén tiernos. Escurrir y servir con el pastel."], "url": "www_bbc_co_uk_food_recipes_lamb_shanks_pie_83534", "title": "Empanadas de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar demerara 50 g / 2 oz", "150g / 5oz de sal fina", "1 ramita de tomillo", "1 ramita de romero", "1 hoja de laurel", "1 estrella de anís", "2 dientes de ajo, aplastados", "1 limón, solo cáscara", "1kg / 2lb 4oz hombro de cordero deshuesado", "1.5kg / 3lb 5oz de grasa de pato", "3 ramitas grandes de tomillo", "3 ramitas grandes romero", "1 hoja de laurel", "½ cabeza de ajo", "200ml / 7fl oz de jerez", "4 remolachas frescas pequeñas, peladas", "sal de roca y pimienta blanca agrietada", "aceite de oliva", "10g / ¼ oz de hojas frescas de tomillo", "10g / ¼ oz de romero picado", "175g / 6oz de menta escogida", "110g / 4oz escogido perejil de hoja plana", "75g / 3oz recogido albahaca", "1 chalote finamente picado", "1 diente de ajo, muy finamente cortado", "pizca de sal", "2 cucharaditas de mostaza inglesa", "6 filetes de anchoas marinados en salmuera", "300ml / 10fl oz de aceite de oliva virgen extra", "10g / ½ oz de alcaparras, escurridas", "vinagre de jerez", "100 g / 4 oz de leche de oveja cuajada, a temperatura ambiente", "jugo de limón, al gusto", "pizca de pimienta negra agrietada", "sal al gusto", "50g / 2oz de menta picada", "Salsa de cordero reducida de 250ml / 9floz", "sal y pimienta negra recién molida", "el vinagre de jerez, al gusto", "25g / 1oz salsa verde (desde arriba)", "2 patatas grandes para asar (como Maris piper o amantes), peladas", "250g / 9 oz de mantequilla clarificada", "8 hojas de pasta filo", "aceite vegetal, para freír", "pellizcar el comino molido", "rociar aceite de oliva", "1 brotes de guisantes"], "method": ["Para la salmuera de cordero, mezcle todos los ingredientes, excepto el cordero, en una cacerola con 2 litros / 3½ litros de agua y cocine a fuego lento, para disolver el azúcar y la sal.", "Deja enfriar, luego sumerge el cordero en la salmuera, cúbrelo y colócalo en la nevera durante 24 horas.", "Para el confitado de cordero, derretir la grasa con las hierbas y el ajo en una lata de asar sobre la cocina a 85C / 185F (usando un termómetro de alimentos para comprobar). Saca el cordero de la salmuera, sécalo y colócalo cuidadosamente en la grasa caliente.", "Cubra con papel de aluminio y cocine por cuatro horas en la cocina, o en el horno a 100C / 225F / Gas ¼, revisando y girando el cordero cada hora.", "El cordero se cocina cuando puedes empujar un tenedor para asar o pinchar la carne como un bloque de mantequilla.", "Deje que el cordero se enfríe completamente en la grasa y descanse.", "Para la remolacha al horno, precaliente el horno a 180C / 350F / Gas 4.", "Corta cuatro cuadrados de papel de horno y papel de aluminio del mismo tamaño, lo suficientemente grande como para envolver la remolacha y tener un pequeño exceso en la parte superior.", "Caliente el jerez en una sartén y cocine hasta que se haya reducido a la mitad de su volumen.", "Corte las remolachas en la parte superior con una cruz casi hasta el final, sazone con el aceite de oliva, sal y pimienta por todos lados, asegurándose de que se lo lleve dentro de la remolacha.", "Rocíe un poco del jerez reducido en las remolachas y termine con unas rodajas del tomillo y el romero recogidos.", "Tire de los lados de la lámina y papel de hornear y luego agregue un chorrito de agua a cada remolacha. Esto ayudará a hervirlos durante la cocción.", "Ahora envuélvalos, juntando el papel de hornear y la hoja para sellar el paquete.", "Hornee en el horno por una hora.", "Saque las remolachas del horno y manténgase caliente. No lo abras hasta que estés listo para servir.", "Para la salsa verde, caliente una olla grande y profunda de agua hasta que hierva. Tenga un recipiente con agua helada listo para enfriar las hierbas.", "Agregue todas las hierbas frescas a la olla de agua hirviendo y asegúrese de que estén completamente sumergidas durante 10 segundos.", "Saca las hierbas, sacudiéndolas y luego sumérgelas en el agua helada.", "Freír la chalota y el ajo en una sartén con un poco de aceite durante tres minutos con una pizca de sal.", "Cuando la chalota esté suave, agregue la mostaza y las anchoas. Mezcle bien, quite el fuego para enfriar y agregue 200ml / 7fl oz del aceite de oliva.", "Escurra las hierbas y revuelva en la mezcla de chalote. Agrega las alcaparras. Coloque la mezcla en un procesador de alimentos y comience a mezclar, agregando gradualmente los restantes 100 ml / 4 fl oz de aceite de oliva. No mezcles por mucho tiempo, deja la mezcla con algo de textura.", "Sazone al gusto con sal y vinagre de jerez.", "Mantenga la salsa verde a temperatura ambiente en un recipiente cubierto con película adhesiva.", "Para la cuajada de leche de las ovejas, sazone la cuajada con el jugo de limón y la pimienta negra rajada al gusto. Agregue un poco de sal al gusto, dependiendo de cuán salada esté la cuajada. Dejar de lado.", "Para la pastilla, recoja la carne del cordero confitado suave en un recipiente para eliminar cualquier gran trozo de grasa o cartílago (pero no elimine toda la grasa, ya que es genial para el sabor).", "Agregue la menta picada, la salsa de cordero reducida, el condimento y el vinagre de Jerez al gusto.", "Agregue un poco de salsa verde, solo para cubrir, sin mojar demasiado la mezcla. Dejar de lado.", "Caliente la mantequilla clarificada en una sartén hasta que esté tibia, pero no caliente. Coloque la papa sobre una mandolina y enrolle alrededor para hacer una sarta de papas.", "Coloque la cadena de papa en la mantequilla clarificada asegurándose de que la mantequilla cubra toda la papa.", "Coloque dos hojas de hojaldre de filo de aproximadamente 20 cm / 8 pulgadas de ancho y 20 cm / 8 pulgadas de largo una encima de la otra. Divida la mezcla de carne en cuatro porciones y déle forma aproximadamente a cada porción de la mano como una salchicha.", "Coloque una forma de salchicha de la mezcla en el filo y enrolle como un rollo de primavera, doblando los lados y cepillando con la mantequilla clarificada para ayudar a que se pegue.", "Finalmente enrolle la patata alrededor del paquete de filo. Repita con el filo restante y la mezcla y colóquelo en una bandeja para dejar reposar en la nevera durante 30 minutos.", "Caliente una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Agregue las pastillas a la freidora y fríe hasta que estén doradas y crujientes, aproximadamente tres minutos.", "Retire con una espumadera y escurra sobre papel de cocina. Sazone ligeramente con sal y comino y talle como desee.", "Para servir, coloque las remolachas tibias en el paquete de aluminio en cada una de las cuatro placas y abra la parte superior de la lámina y el papel de hornear.", "Coloque una cucharada de la cuajada de las ovejas encima de la remolacha. Termine con un poco de aceite de oliva y brotes frescos de guisantes.", "Coloque una cucharada de la salsa verde en el plato.", "Coloque la pastilla en el plato, rocíe con un poco más de aceite de oliva y sirva."], "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_pastilla_74296", "title": "Pastilla de cordero, remolacha asada, salsa verde, leche de oveja", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1.5kg / 3lb 5oz hombro de cordero, deshuesado por el carnicero, no enrollado y atado", "2 cucharadas de aceite de oliva virgen extra", "6 dientes de ajo, pelados", "8 filetes de anchoa en aceite", "4 ramitas de romero fresco", "50 g / 1¾oz de aceitunas negras sin hueso, preferiblemente Taggiasche", "250ml / 9fl oz de vino blanco", "Brócoli brotación púrpura brotes de 500g / 1lb 2oz, tallos resistentes eliminados", "2 cucharadas de aceite de oliva virgen extra de buena calidad", "sal y pimienta"], "method": ["Para el hombro de cordero, precaliente el horno a 180C / 350F / Gas 4.", "Recorte el exceso de grasa del hombro del cordero. Calentar una cazuela resistente al fuego y agregar el aceite. Agregue el hombro de cordero y fría a fuego alto para dorarlo por todos lados. Sáquelo de la sartén y vierta el exceso de grasa.", "Agregue los dientes de ajo, las anchoas, el romero, las aceitunas y el vino blanco a la cazuela y coloque el hombro encima. Cúbralo bien con una tapa o papel de aluminio y colóquelo en el horno para cocinar durante 1-1½ horas o hasta que la carne esté tierna.", "De vez en cuando hilvana la carne con los jugos. Retire la tapa y cocine el cordero al descubierto durante los últimos 10 minutos, para reducir los jugos de cocción a la mitad.", "Para el brócoli de brotación púrpura, hacia el final del tiempo de cocción del cordero, cocine el brócoli en una sartén con agua salada hirviendo hasta que esté tierno. Escurrir y vestir con aceite de oliva. Sazonar con sal y pimienta, al gusto.", "Sirva el hombro de cordero en rodajas con sus jugos de cocina y el brócoli."], "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_with_40153", "title": "Paletilla de cordero con brócoli de brotación púrpura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "3 cucharaditas de semillas de cilantro", "6 cucharaditas de semillas de comino", "1-2 cucharadas de miel", "1 limón, solo jugo", "200g / 7oz de pasta harissa", "1 hombro de cordero (aproximadamente 2.5kg / 5lb 8oz)", "3 cucharadas de aceite de colza", "1 cabeza de ajo entera, cortada por la mitad", "3 cebollas cortadas por la mitad", "algunas ramitas de romero", "algunas ramitas de tomillo", "sal y pimienta negra recién molida", "250g / 9oz de mantequilla sin sal", "600 g / 1 libra de cebolla de 5 oz, finamente picada (alrededor de 4-6 cebollas)", "50g / 1¾oz de puré de ajo", "6 hojas de laurel", "100g / 3½oz de ramitas de tomillo", "1 kg / 2lb 4 oz vientre de cordero (también conocido como mama), pelado y cortado en dados de 2 cm / 1 in", "Patatas harinosas de 2 kg / 4 libras y 8 onzas, peladas y cortadas en dados de 0.5 cm / ¼ in", "300 ml / 10 fl oz de cordero fuerte", "20g / ¾oz de perejil rizado", "10g de hojas de estragón recogidas", "20g / ¾oz de cebollín finamente picado", "sal y pimienta blanca"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6.", "Para la pasta de especias, tueste todas las especias en una sartén seca y caliente durante unos minutos hasta que quede aromático. Muela a un polvo fino en un molinillo de especias o una mano de mortero. Mezcle las especias molidas, la miel y el jugo de limón con la pasta harrisa y transfiera a una manga pastelera.", "Prepara el cordero haciendo cortes profundos en la carne tanto o tan poco como quieras dependiendo de la cantidad de calor que desees del harrissa, ya que los llenaremos con la pasta.", "Unte aceite sobre la carne y sazone con sal y pimienta. Coloque la cabeza de ajo, cebolla, romero y tomillo en el fondo de un plato grande y profundo. Coloque el cordero en la parte superior y vierta la pasta de especias en las barras. Cubra con papel de aluminio y selle los bordes.", "Asar en el horno durante 15 minutos, luego reducir la temperatura a 160 C / 140 C Fan / Gas 3 y dejar asar durante 4 horas. No abrir para controlar la carne durante la cocción. Retirar del horno, cubrir con papel de aluminio y dejar reposar durante 20 minutos antes de servir.", "Para los fanáticos, tome una sartén tapada de base gruesa que sea lo suficientemente grande como para caber todo el ingrediente. Caliente la mantequilla en la sartén y fría las cebollas para ablandarlas sin colorear. Agregue el puré de ajo y fría hasta que las cebollas sean translúcidas", "Ate las hojas de laurel y las ramitas de tomillo con una cuerda de cocina. Agrégalos a la sartén.", "Agregue el cordero cortado en cubitos y las papas y sazone con sal y pimienta blanca. Cubra con la tapa y cocine a fuego medio a lento hasta que la carne comience a emitir sus jugos. Esto tomará 1-2 horas.", "Agregue el caldo y lleve a ebullición, luego cocine a fuego lento con la tapa hasta que las papas se descompongan en el líquido y estén cocidas.", "Quite el fuego, agregue las hierbas picadas y sazone, al gusto, con sal y pimienta. Para servir, coloque el hombro en una tabla de servir con un tazón de las alitas en el lateral."], "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_with_90539", "title": "Paletilla de cordero con harissa y cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["740 g / 1 libra de filete de cordero de 10 onzas, cortado y en cubos", "1 cucharadita de aceite de oliva", "1 cucharadita de orégano seco", "1 limón, corteza finamente rallada solamente", "½ cucharadita de pimentón molido", "4 panes pitta integrales", "sal y pimienta negra recién molida", "1 pepino pequeño, sin semillas y picado", "4 tomates firmes, maduros, sin semillas y picados", "1 pimiento verde, sin corazón, sin semillas y picado", "1 cebolla roja pequeña, picada", "1 pequeño manojo de menta, finamente picado", "1 cucharada de colza virgen extra o aceite de oliva", "100 g / 3½ oz de queso feta bajo en grasa, cortado en cubitos", "2 cucharadas de perejil picado", "1 limón, solo jugo"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Frote el cordero con el aceite de oliva, orégano seco, cáscara de limón, pimentón, un poco de sal y pimienta negra recién molida. Enrosque 4 pinchos de metal largos u 8 cortos y déjelos marinar durante al menos 10 minutos. Precalentar la parrilla a un ajuste caliente.", "Para la ensalada, mezcle el pepino, los tomates, la pimienta, la cebolla, la menta y el aceite en un tazón grande y espolvoree sobre el queso feta y el perejil. Agregue el jugo de limón y sazone bien con sal y pimienta negra recién molida. Dejar de lado.", "Cocine los pinchos de cordero debajo de la parrilla durante 5-10 minutos, o hasta que estén cocidos al color rosado deseado, volteándolos ocasionalmente. Retire de la parrilla y deje reposar durante 2 a 3 minutos.", "Mientras tanto, envuelva los panes pitta en papel de aluminio y colóquelos en el horno de 5 a 8 minutos o hasta que estén tibios.", "Coloque los pinchos de cordero en los panes pitta con la ensalada turca y sirva."], "url": "www_bbc_co_uk_food_recipes_lamb_skewers_with_26099", "title": "Pinchos de cordero con ensalada turca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_skewers_with_26099_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de cordero (aproximadamente 150 g / 5½ oz cada uno)", "2 cucharaditas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "2 cucharaditas de menta fresca picada", "½ cucharadita de melaza de granada", "1 cucharadita de comino molido", "500g / 1lb 2oz de vaina de habas frescas", "2 cucharaditas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "½ limón, ralladura y jugo", "1 cucharadita de comino molido", "Pizca de canela", "1 cucharadita de orégano fresco tostado (o tomillo)", "200ml / 7fl oz de caldo de pollo", "Tomates pequeños de 150g / 5½oz, reducidos a la mitad", "1 cucharadita de melaza de granada", "1 cucharada de perejil de flatleaf picado, para servir"], "method": ["Coloque los filetes de cordero en un tazón grande. Agregue los ingredientes restantes de cordero y frote en la carne. Cubra y deje marinar durante 10 minutos.", "Mientras tanto, coloque los frijoles brad en un recipiente grande y cubra con agua hirviendo. Deje a un lado el agua es lo suficientemente fría como para manejar. Escurra los frijoles y deslícelos de sus pieles externas.", "Caliente el aceite de oliva en una olla colocada a fuego medio. Agregue la cebolla y cocine hasta que esté suave. Agregue el ajo, la ralladura de limón, especias, orégano, frijoles y caldo. Cocine por 5 minutos y revise el condimento. Agregue los tomates, el jugo de limón y la melaza de granada.", "Caliente una barbacoa o parrilla a una temperatura alta y cocine el cordero durante 2-3 minutos por cada lado o hasta que esté bien cocido. Deje reposar de 2 a 3 minutos.", "Divida los frijoles entre cuatro platos y cubra con los filetes de cordero. Espolvorear con perejil fresco y servir."], "url": "www_bbc_co_uk_food_recipes_lamb_steak_with_minty_38336", "title": "Filete de cordero con habas de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_steak_with_minty_38336_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo de gallinas camperas", "sal y pimienta blanca recién molida", "175ml / 6fl oz de aceite de oliva virgen extra", "175ml / 6fl oz de aceite de girasol", "jugo de limón, al gusto", "2 dientes de ajo, triturados hasta formar una pasta", "4 rebanadas de pechuga de cordero cocida y fría (ver la punta de la receta superior)", "sal y pimienta negra recién molida", "harina común, para dragado", "1 huevo de gallinas camperas, golpeado", "pan rallado, para recubrimiento", "1 cucharada de aceite", "berros, para servir"], "method": ["Para la mayonesa de ajo, coloque las yemas de huevo en un bol con la sal y pimienta blanca recién molida. Poco a poco mezcle mientras se filtra gradualmente en el aceite de girasol, seguido por el aceite de oliva. Una vez que la mezcla se vuelva espesa, agregue un poco de jugo de limón.", "Continúa batiendo, agregando el aceite un poco más rápido y acelerando la velocidad de batido. Agregue más jugo de limón, sal y pimienta negra recién molida al gusto. Dejar de lado en la nevera.", "Sazonar el cordero con sal y pimienta negra recién molida. Coloque la harina, el huevo batido y las migas de pan secas en tres cuencos poco profundos. Dragar las rodajas de cordero en la harina, sumergir en el huevo batido y rodar en las migas de pan.", "Calentar el aceite en una sartén de base pesada y freír las rodajas de cordero hasta que estén doradas. Con cuidado, voltee el cordero y cocínelo del otro lado. Retire el cordero de la sartén y escurra sobre papel de cocina.", "Revuelva el ajo triturado en la mayonesa. Coloque las rebanadas en platos calientes y sirva la mayonesa de ajo en un tazón en el lado. Exprime un poco de jugo de limón sobre la carne si te gusta."], "url": "www_bbc_co_uk_food_recipes_lamb_slice_with_garlic_01679", "title": "Loncha de cordero con mayonesa de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_slice_with_garlic_01679_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz hombro de cordero sin hueso o pierna de cordero, bien limpiado de toda la piel, tendones, grasa, cartílago y cortado en cubos de 1cm / ½ en cubitos", "4 x 2.5cm / 1in piezas de canela en rama, descarta las piezas pequeñas que se desprenden", "10 dientes", "1 cucharadita de granos de pimienta negra, o más al gusto", "2 cucharadas de aceite de colza o aceite vegetal", "2 cebollas rojas, cortadas en cuartos y rebanadas", "1½ cucharada de harina común", "1 x 400 ml / 14 fl oz de leche de coco estaño", "sal", "3 papas grandes, peladas, cortadas en cubos grandes y hervidas hasta que estén blandas"], "method": ["Coloque el cordero o el cordero preparado en una cazuela que tenga una tapa ajustada. Agregue la canela, los clavos de olor y pimienta, y suficiente agua fría para cubrir la carne. Cubra la sartén con fuerza (alinee el borde de la tapa en papel de aluminio para aumentar la hermeticidad si es necesario). Llevar a ebullición, luego reduzca el fuego a bajo y cocine a fuego lento durante 30 minutos.", "Descubra en parte la bandeja, permitiendo que salga el vapor y que el líquido se reduzca, y continúe cocinando a fuego lento durante una hora más.", "En una sartén por separado, caliente el aceite y cocine las cebollas suavemente hasta que estén suaves, dándoles un buen aderezo de sal. Agregue la harina a las cebollas y revuelva durante 3-4 minutos, o hasta que la harina se absorba en el aceite y esté cocida.", "Agregue la mezcla de cebolla a la bandeja de carne y mezcle bien. Llevar a ebullición, luego reduzca el fuego a bajo y cocine a fuego lento durante 10-15 minutos, revolviendo, hasta que esté bien combinado y espesado. Agregue la leche de coco y cocine a fuego lento durante otros 30 minutos, revolviendo con frecuencia. Comprueba la textura del cordero o del cordero: pasará de ser bastante duro a muy tierno bastante repentinamente; este es el punto en el que el estofado está listo.", "Cuando la carne esté tierna, agregue las papas cocidas y cocine a fuego lento durante un minuto hasta que las papas estén calientes. Pruebe y ajuste el aderezo si es necesario. Sirva con pan crujiente y algunas verduras."], "url": "www_bbc_co_uk_food_recipes_lamb_stew_with_black_83254", "title": "Guiso de cordero con pimienta negra, coco y clavo de olor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_stew_with_black_83254_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite vegetal", "75g / 2¾oz de mantequilla sin sal", "Cuello de cordero de 900g / 2lb, cortado en cubos de 2cm / ¾in", "200 g / 7 oz de tocino lardons (preferiblemente ahumado de roble)", "1 manojo de cebollas picadas (parte blanca y verde)", "2 dientes de ajo picados", "5 hojas de salvia frescas, picadas", "500g / 1lb 2 oz de calabaza preparada en tienda y mezcla de camote", "25g / 1oz de tomates secados al sol, picados", "4 cucharadas de harina normal", "50g / 1¾oz de hongos porcini secos, picados", "2 cucharadas de mermelada de ciruela o cereza", "1 hoja de laurel", "algunos batidos de salsa Worcestershire", "250ml / 9fl oz puerto", "500ml / 18fl oz de caldo de carne", "1 cucharada de mostaza inglesa en polvo", "4 cucharadas de perejil recién cortado de flatleaf, para servir", "sal y pimienta negra", "150g / 5½ oz de harina de auto crianza", "75g / 2¾oz de carne de res desmenuzada o sebo vegetal", "pequeñas hojas de tomillo fresco", "1 huevo mediano de gallinas camperas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente una cazuela con tapa y agregue el aceite y la mantequilla. Una vez derretido, agregue el cordero en lotes y fría hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue los lardons de tocino a la sartén y cocine durante 1-2 minutos o hasta que estén crujientes. Agregue las cebollas tiernas, el ajo y la salvia y cocine durante 2-3 minutos más. Agregue la calabaza y la mezcla de camote y revuelva. Agregue los tomates secados al sol, la harina, los champiñones, la mermelada y la hoja de laurel y cocine durante 1-2 minutos más.", "Devuelva el cordero sellado a la sartén junto con la salsa Worcestershire y el puerto. Cocine hasta que el puerto se haya reducido a la mitad. Agregue el caldo, la mostaza en polvo y sazone con sal y pimienta. Revuelva. Cubra con la tapa y transfiéralo al horno por 20 minutos.", "Para las albóndigas, coloque las hojas de harina, sebo y tomillo en un tazón de vidrio grande y mezcle para combinar. Agregue el huevo y 50 ml / 2 fl oz de agua, mezcle y añada a la masa. Enrolla la mezcla en 12 albóndigas de tamaño uniforme.", "Retire el guiso del horno y agregue la mayor parte del perejil.", "Coloque las albóndigas encima del estofado y vuelva a colocarlas en el horno con la tapa puesta durante 10 minutos. Retire la tapa y cocine por otros 15-20 minutos, o hasta que las albóndigas estén doradas.", "Para servir, espolvorea un poco del guiso y las albóndigas en tazones poco profundos y decora con el perejil restante."], "url": "www_bbc_co_uk_food_recipes_lamb_stew_with_port_00129", "title": "Estofado de cordero con albóndigas port, porcini y herby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "1 kg / 2 libras 4 oz de cordero hombro, cortado en cubitos", "2 cebollas, cortadas en semicírculos gruesos", "6-8 dientes de ajo, pelados y dejados enteros", "2 berenjenas pequeñas, cortadas en cubitos", "pellizcar el azafrán", "2 cucharaditas de semillas de cilantro, aplastadas", "2 cucharaditas de semillas de comino, trituradas", "pocas vainas de cardamomo", "algunos granos de pimienta negra", "pizca de cúrcuma", "300ml / 10fl oz de vino blanco seco", "1 cucharada de puré de tomate", "1 x 400 g de tomate picado", "1 x 400 g de garbanzos de lata, escurridos", "gran puñado de albaricoques secos, cortados por la mitad", "500ml / 18fl oz de cordero o caldo de pollo", "1 cucharada de menta fresca picada", "1 cucharada de cilantro fresco picado", "Cuscús 250 g / 9 oz", "pizca de azafrán", "300ml / 10fl oz de caldo de pollo caliente", "100g / 3½oz de almendras en copos, tostadas", "100 g / 3½ oz de pasas, remojadas en agua", "4 cucharadas de aceite de oliva", "4 cucharadas de hierbas picadas mezcladas, como la menta, el cilantro y el perejil"], "method": ["Para el tagine de cordero, en una sartén o cacerola con tapa grande, a prueba de horno, calienta el aceite de oliva. Sazonar el cordero con sal y pimienta. Una vez que el aceite esté caliente, dore el cordero por todos lados durante aproximadamente 10 minutos. Agregue las cebollas y el ajo. Cocine por unos minutos para ablandar, luego mezcle las berenjenas y las especias y cocine por otros 2 minutos.", "Vierta el vino blanco y cocine a fuego lento hasta que el volumen del líquido se reduzca en volumen a la mitad. Agregue el puré de tomate, los tomates en lata y los garbanzos y cocine durante unos minutos para reducir aún más.", "Agregue los albaricoques y el caldo. Cubra la olla con una tapa y cocine suavemente durante 1½-2 horas, o hasta que la carne esté tierna.", "Justo antes de servir, retire la tapa y reduzca la salsa un poco hasta que espese, si es necesario.", "Mientras tanto, coloca el cuscús en un tazón grande y resistente al calor. Mezcle el azafrán en el caldo caliente y luego viértalo sobre el cuscús. Cubra con una película adhesiva y déjela durante 5 minutos.", "Una vez que el caldo haya sido remojado, mezcle las almendras copos, las pasas, el aceite de oliva y las hierbas picadas.", "Sirva el tagine de cordero en tazones con el cuscús al lado. Adorne con la menta picada y el cilantro."], "url": "www_bbc_co_uk_food_recipes_lamb_tagine_13748", "title": "Tagine de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]