[{"ingredients": ["3 naranjas, peladas y segmentadas", "¼ cucharadita de canela molida", "3 claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "azúcar glas, al polvo", "ramitas de menta fresca, para adornar"], "method": ["Divida las naranjas entre dos vasos de postre grandes y espolvoree sobre la canela.", "En un tazón limpio grande, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Poco a poco agregue el azúcar en polvo, batiendo continuamente hasta que la mezcla esté espesa y brillante.", "Pipe o cuchara la mezcla de merengue en las gafas para cubrir las naranjas. Use un mini soplete para dorar el merengue por todas partes.", "Para servir, espolvorear con azúcar glas y decorar con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_cinnamonorangeswithb_87126", "title": "Naranjas canela con merengue horneado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de hojaldre listo para enrollar", "1 cucharadita de canela molida", "2½ cucharadas de azúcar en polvo", "Crema doble 150ml / ¼pt", "exprimir jugo de naranja", "2 cucharaditas de azúcar glas", "½ vaina de vainilla, semillas raspadas", "1 naranja, pelada y segmentada"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta un triángulo de 6 pulgadas de la masa de hojaldre preparada. Coloque en una bandeja para hornear y espolvoree con la canela y media cucharada de azúcar en polvo. Coloque en el horno para cocinar durante diez minutos.", "Coloque la crema, el jugo de naranja, el azúcar glas y las semillas de vainilla en un bol, y bata hasta que la mezcla forme picos suaves cuando se quite la batidora.", "Coloque los segmentos de naranja en una bandeja para hornear, espolvoree con el resto del azúcar y use una mini soplete, caramelice el azúcar durante dos minutos o hasta que se dore.", "Para servir, coloque las naranjas en un plato de servir, coloque un poco de crema encima y luego la masa de canela cocida."], "url": "www_bbc_co_uk_food_recipes_cinnamonpuffwithcara_84454", "title": "Canela de canela con naranjas caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de sal", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "125ml / 4½fl oz de agua helada", "4 peras, peladas, sin núcleo, cortadas a la mitad", "Azúcar en polvo de 110 g / 4 oz", "1 limón, ralladura solamente", "2 vainas de vainilla, partidas, semillas raspadas (solo semillas)", "110g / 4oz de mantequilla", "150ml / 5fl oz de crema doble", "Anís de 2 estrellas", "½ cucharadita de canela molida", "Helado de vainilla 500ml / 18fl oz, para servir"], "method": ["Para la pasta de hojaldre áspera, coloque la harina y la sal en un tazón grande. Agregue la mantequilla y use sus manos para frotar la mantequilla en la harina.", "Cuando la mezcla de harina y mantequilla se asemeje a pan rallado, agregue el agua fría. Mézclalo con una espátula para mantener la mezcla fresca. Cuando la mezcla se una para formar una masa, colócala sobre una superficie limpia y enharinada y amasar brevemente hasta que quede suave.", "Forme la masa en un bloque rectangular (esto facilitará el despliegue más adelante), envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enrolle la masa fría sobre una superficie limpia y enharinada en un rectángulo de aproximadamente 40x20cm / 16inx8in. Dobla un tercio de la masa en el centro, luego dobla el otro tercio sobre eso.", "Dale a la pastelería un cuarto de vuelta y repite el paso 4.", "Envuelva el bloque de repostería en film transparente, refrigere durante 20 minutos y luego repita los pasos 4 y 5.", "Envuelva el bloque de repostería en una película adhesiva y refrigere durante 30 minutos antes de usar.", "Mientras tanto, para la tatin de pera, precalentar el horno a 200C / 400F / Gas 6.", "Coloque las peras, 25 g / 1 oz del azúcar y todas las semillas de cáscara de limón y vainilla en una olla. Llene la cacerola con suficiente agua para cubrir las peras. Calienta las peras a fuego lento hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 15 minutos, o hasta que las peras estén tiernas. Escurra las peras y séquelas.", "Caliente los restantes 85 g / 3 oz de azúcar en una sartén a prueba de horno de 24 cm / 9½ pulgadas a fuego lento hasta que se haya caramelizado. Agregue la mantequilla, la crema, el anís estrellado y la canela a la sartén y caliente suavemente hasta que la mezcla forme un caramelo suave. Deseche el anís estrellado.", "Coloque las peras en el caramelo, con el lado cortado hacia arriba.", "Enrolle la masa refrigerada sobre una superficie enharinada a un espesor de 0.5cm / ¼ in. Corta la masa en un círculo ligeramente más grande que la sartén.", "Coloque el círculo de repostería sobre las peras, metiendo los bordes de la masa dentro de la sartén para rodear las peras.", "Transfiera al horno para hornear durante 20-25 minutos, o hasta que la masa se haya levantado y dorada y cocida. Una vez cocido, retire la tatin de pera del horno y déjela enfriar durante 5-10 minutos.", "Para servir, invierta la tarta tatin en un plato para servir. Cortar el tatin en trozos y colocar una rebanada en cada uno de los 4 platos. Cubra cada rebanada con una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_cinnamonspicedpearta_93210", "title": "Tatin de pera con especias de canela", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mantequilla 110g / 4oz, ablandada, más extra para engrasar", "Azúcar en polvo de 110 g / 4 oz", "2 huevos grandes de gallinas camperas, golpeados", "Harina de auto crianza 110g / 4oz", "3 cucharadas de leche", "sal", "1 cucharadita de canela molida", "3 cucharadas de jarabe de oro", "250ml / 8¾fl de leche en oz", "250ml / 8¾ fl oz crema doble", "100ml / 3½fl oz perry", "1 vaina de vainilla, dividida", "8 yemas de huevo de gallinas camperas", "75 g / 2½ oz de azúcar en polvo"], "method": ["En un tazón limpio, unte la mantequilla y el azúcar hasta que estén pálidos y esponjosos, luego gradualmente golpee los huevos uno por uno.", "Tamizar la harina y doblar en la mezcla de crema con la leche, la sal y la canela.", "Engrase un cuenco con leche de 1 litro / 1¾ de pinta y una cuchara en el almíbar dorado.", "Vierta la mezcla de rebozado sobre el almíbar y cúbralo con untable a prueba de grasa y papel de aluminio y átelo con una cuerda. Coloque en un salvamanteles en una olla grande con agua para cocer al vapor. Steam por 1 hora y media.", "Mientras esto es humeante, haz la crema de perry.", "Calentar la leche con la crema, el perry y la vaina de vainilla y llevar lentamente a ebullición. Retire del fuego.", "Batir las yemas en un tazón limpio por separado con la mezcla de crema caliente y agregar el azúcar hasta que esté bien mezclado. A medida que las yemas de huevo se calienten, la crema se espesará para crear natillas. Siga revolviendo hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Una vez que el budín de esponja se haya cocido al vapor, ponlo boca abajo en un plato y agita suavemente. Sirve con la crema pastelera."], "url": "www_bbc_co_uk_food_recipes_cinnamonspongepuddin_81026", "title": "Pudín de esponja de canela con crema de perry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla, derretida, más extra para engrasar", "300 g / 10½ oz galletas de jengibre", "3 hojas de gelatina de hoja", "500g / 1lb 2oz mascarpone", "1 limón, ralladura y jugo", "200ml / 7fl oz de crema doble, ligeramente azotada", "175g / 6oz de azúcar en polvo de oro", "2 cucharadas de agua fría", "4 cucharadas de cuajada de limón lista para usar", "Bayas de verano de 450 g / 1 lb", "algunas ramitas de menta", "azúcar en polvo, para quitar el polvo"], "method": ["Engrase la base y los lados de una lata de torta en forma de resorte de 23 cm / 9 pulgadas con un poco de mantequilla derretida y cubra con papel antigrasa.", "Picar las nueces de jengibre en un procesador de alimentos hasta que se asemejen a migas de pan (alternativamente, colóquelas en una bolsa de congelación con cierre y golpee con un rodillo).", "Transfiera las migas de galletas a un recipiente y agregue la mantequilla derretida hasta que estén bien combinadas. Coloque la mezcla en la lata de torta preparada y presione hacia abajo en una capa uniforme con el dorso de una cuchara de madera. Enfriar en la nevera hasta que sea necesario.", "Mientras tanto, remoje las hojas de gelatina en un recipiente con agua fría hasta que estén flexibles, aproximadamente 10 minutos.", "Doble el mascarpone, la ralladura de limón, la crema doble ligeramente batida y el azúcar impalpable en un tazón para mezclar hasta que se combinen.", "Caliente el jugo de limón y dos cucharadas de agua en una olla no reactiva a fuego lento. Una vez flexible, exprima el exceso de agua de las hojas de gelatina y agréguelas al jugo tibio de limón, revolviéndolo para que se disuelva.", "Dobla la mezcla de limón y gelatina en la mezcla de mascarpone hasta que esté bien combinada. Mármol a través de la cuajada de limón, una cucharada a la vez.", "Vierta la mezcla sobre la base de la tarta de queso, alisando la parte superior con una espátula. Cubra con una película adhesiva y deje enfriar en la nevera hasta que se seque, preferiblemente durante la noche.", "Para servir, retire con cuidado la película adhesiva y el borde en forma de resorte de la tarta de queso y colóquela en un plato para servir o en un soporte para pasteles. Cubra con algunas bayas de verano, adornar con ramitas de menta y polvo ligeramente con azúcar glas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_citrus_and_ginger_58132", "title": "Tarta de queso de verano baya", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrus_and_ginger_58132_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "50 g / 1¾oz de cacao en polvo", "50g / 1¾oz de azúcar glas", "150 g / 5½ oz de mantequilla, refrigerada y cortada en cubitos", "1 yema de huevo de gallinas camperas", "pizca de sal", "agua helada", "3 naranjas grandes, ralladura y jugo", "1 pomelo rosado, ralladura y jugo", "75g / 2½ oz de harina de maíz", "500 ml / 18 fl oz de agua recién hervida", "4 yemas de huevo de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "5 claras de huevo de gallinas camperas", "225 g / 7 oz de azúcar en polvo", "½ cucharadita de crema de tártaro", "100g / 3½oz de avellanas sin cáscara, tostadas y ligeramente trituradas o rotas"], "method": ["Para la caja de pastelería, precaliente el horno a 190C / 170C Fan / Gas 5. Mezcle la harina, el cacao, el azúcar glas y la mantequilla en un procesador de alimentos o frótelos a mano hasta que la mezcla se asemeje a migajas de pan finas.", "Agregue la yema de huevo y una pizca de sal. Es posible que encuentre que la mezcla ya se amontona, de ser así, no necesitará agregar agua. Si todavía parece un poco seco al apretar algo entre los dedos, agregue hasta una cucharada de agua. Forme una pelota, envuélvala en una película adhesiva y relájese durante al menos media hora.", "Para hacer el relleno, ralladura una de las naranjas y la toronja. Poner en un tazón, luego agregar todo el jugo de las naranjas y pomelo, junto con la harina de maíz. Batir la harina de maíz en el jugo hasta que tenga una pasta muy fina. Deje que el agua vuelva a hervir en una cacerola, luego mezcle la mezcla de cítricos y harina de maíz.", "Revuelva a fuego medio hasta que tenga la consistencia de una crema espesa. Retirar del fuego y enfriar un poco. Batir las yemas de huevo y el azúcar juntos, luego agregar esto a la mezcla de cítricos. Revuelva para combinar, luego cúbralo con film transparente, asegurándose de que la película adhesiva toque la crema pastelera para detener la formación de la piel, luego enfríe en la nevera.", "Estirar la masa y usar para revestir una caja de tarta de 23-24 cm / 8½-9½. Pinchar todo con un tenedor, luego forrar con pergamino para hornear y llenar con alubias. Hornee en el horno precalentado durante 15 minutos, luego quite los frijoles y hornee por otros 5 minutos. Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cuando el relleno esté completamente frío, raspe en la caja de pastelería. Batir las claras de huevo hasta que comiencen a formar picos rígidos, luego continuar batiendo, agregando el azúcar una cucharada a la vez. Cuando esté tieso y brillante, agregue el azúcar restante y la crema de tártaro. Finalmente, dobla las avellanas tostadas. Pipe o amontone el merengue sobre el relleno.", "Hornee en el horno por unos 20 minutos, o hasta que el merengue esté dorado. Enfriar antes de comer"], "url": "www_bbc_co_uk_food_recipes_citrus_meringue_11337", "title": "Pastel de merengue de cítricos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas, finamente picadas", "6 dientes de ajo, aplastados", "Jengibre fresco de 5cm / 2in, pelado y rallado", "puñado de perejil fresco, finamente picado", "puñado de cilantro fresco finamente picado", "2 limas, solo jugo", "2 limones, solo jugo", "2 naranjas, solo jugo", "1 pimiento picante Scotch, finamente picado", "4 cucharadas de salsa de soja o tamari", "1 cucharadita de nuez moscada molida", "puñado de tomillo fresco, hojas recogidas y finamente picadas", "1 cucharada de mostaza inglesa", "1 cucharadita de pimienta de Jamaica molida", "5 cucharadas de ron", "1 cucharada de pimienta negra recién molida", "1 cucharada de sal marina molida", "2 cucharadas de aceite de oliva", "10 piezas de pollo, muslos y baquetas", "150g / 5½ oz de moquea miel", "2 cucharadas de levadura en polvo", "1 cucharada de vinagre", "500g / 1lb 2 oz de harina común", "500g / 1lb 2 oz de harina de maíz finamente molida", "6 cucharaditas de azúcar", "3 huevos de gallinas camperas, golpeados", "500ml / 18fl oz de leche entera", "puñado de lechuga de cordero", "1 naranja, pelada y segmentada"], "method": ["Para hacer el pollo cítrico, coloque todos los ingredientes, excepto las piezas de pollo, en un tazón grande y mezcle bien. Coloque las piezas de pollo en el adobo y cubra con una película adhesiva. Dejar marinar en la nevera durante al menos una hora, preferiblemente durante la noche.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Transfiera el pollo a una bandeja grande para hornear y siéntese boca arriba. Ase el pollo en el medio del horno por alrededor de 30-40 minutos; revísalo después de 15-20 minutos y gira las piezas para asegurarte de que estén cocinando uniformemente. Cuando el pollo esté dorado y los jugos estén limpios, se cocinará. Rocíe la miel sobre las piezas de pollo y tueste por otros 10 minutos.", "Para hacer los waffles de harina de maíz, precaliente un waflera y mezcle el polvo de hornear y el vinagre hasta obtener una pasta homogénea.", "Mezcle la harina, la harina de maíz, el azúcar, los huevos y la leche en un bol y añada la mezcla de vinagre y polvo de hornear. Vierta la mezcla en la máquina de hacer gofres caliente y cocínela durante unos 6 minutos o hasta que se dore. Alternativamente, caliente una sartén de fondo grueso a fuego medio, agregue un poco de aceite y fríe la mezcla en tandas, como panqueques.", "Para servir, divida el pollo entre cuatro platos y sirva un waffle con cada uno. Adorne con lechuga de cordero y segmentos de naranja."], "url": "www_bbc_co_uk_food_recipes_citrus_jerk_chicken_with_93427", "title": "Pollo de cítrico con waffles de harina de maíz", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón, cáscara pelada y carne finamente cortada", "1 naranja, ralladura pelada y carne finamente cortada", "Azúcar en polvo de 110 g / 4 oz", "Harina de auto crianza 110g / 4oz", "125g / 4½oz de mantequilla suave, más extra para la grasa", "1 huevo de gallinas camperas", "2 cucharadas de miel, más 1 cucharada extra"], "method": ["Coloque las ralladuras de naranja y limón, azúcar, harina, mantequilla, huevo y miel en un procesador de alimentos y mezcle hasta que se forme una masa de esponja suave.", "Engrase un recipiente pequeño a prueba de horno con mantequilla y cepille con la miel adicional. Alinee el tazón con las rodajas de naranja y limón.", "Vierta la mezcla de esponja en el recipiente forrado y cubra con una película adhesiva.", "Coloque el recipiente en un microondas y cocine a máxima potencia durante cinco minutos o hasta que la esponja esté bien cocida."], "url": "www_bbc_co_uk_food_recipes_citrusandhoneysponge_84015", "title": "Esponja de microondas de cítricos y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de pétalos de rosa comestibles secos, finamente molidos", "2 tsc sumac", "1 cucharadita de polvo de lima seca", "1 cucharadita de comino molido", "½ cucharadita de canela molida", "1 naranja, solo ralladura", "1 lima, ralladura solamente", "3-6 cucharadas de aceite de oliva", "4 x 150 g / 5oz filetes de salmón sin piel", "sal marina y pimienta negra recién molida", "1 limón cortado en 6 cuñas, para servir"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel de hornear.", "Combine los pétalos de rosa molidos, las especias, la ralladura de naranja y la ralladura de lima en un tazón pequeño. Agregue el aceite de oliva y mezcle bien para formar un adobo húmedo para el salmón.", "Frote cada filete de salmón con el adobo y colóquelo en la bandeja. (En esta etapa puede cubrirse con film transparente y dejarlo toda la noche en el refrigerador para marinar, si lo desea). Una vez que todos los filetes estén bien cubiertos en el adobo, sazone generosamente con sal marina y pimienta negra.", "Hornee durante 10-12 minutos o hasta que el pescado esté bien cocido. Sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_citrus_spiced_salmon_69209", "title": "Salmón cítrico con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrus_spiced_salmon_69209_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón, ralladura y jugo solamente, más la ralladura de 1 lima extra", "2 cucharaditas de pimienta negra agrietada", "2 dientes de ajo, aplastados hasta formar una pasta con el filo de un cuchillo", "1 cucharadita de copos de sal marina", "2 cucharaditas de hojas de tomillo", "6 cucharadas de aceite de oliva", "Tocino rayado ahumado de 100g / 3½oz, picado", "6 pechugas de pollo, piel marcada de tres a cuatro veces", "1 kg / 2 libras 3 oz patatas harinosas, como King Edward o Maris Piper, peladas", "2 cebollas, peladas, picadas", "2 huevos grandes de gallinas camperas, golpeados", "2 cucharaditas de sal", "1 cucharadita de pimienta negra recién molida", "1-2 cucharadas de aceite vegetal, para freír poco", "ensalada verde"], "method": ["Para las pechugas de pollo con costra de cítricos, coloque la ralladura de lima, la pimienta negra, el ajo, la sal marina y el tomillo en un mortero y machaque hasta obtener una pasta con un mortero. Agregue cuatro cucharadas de aceite de oliva y todo el jugo de lima. Mezcle bien y deje reposar.", "Caliente las dos cucharadas restantes de aceite de oliva en una sartén a fuego medio. Agregue el tocino picado y fría hasta que se libere la grasa.", "Agregue las pechugas de pollo y fría por 2-3 minutos en cada lado, o hasta que se doren por ambos lados. (Cuando el pollo esté dorado, deseche el tocino cocido o recupérelo para otra receta. En esta receta, solo se utiliza como grasa para cocinar, para dar sabor).", "Transfiere las pechugas de pollo doradas a una bandeja para hornear, con la piel hacia arriba, luego cúbrelas con la pasta de cítricos.", "Ase las pechugas de pollo en el horno durante 18-20 minutos, hilvanando con frecuencia con los jugos de cocina y cualquier resto de pasta de cítricos, hasta que esté cocido. (NB: El pollo se cuece cuando los jugos se hacen transparentes cuando las pechugas de pollo se perforan en la parte más gruesa con un pincho).", "Retire las pechugas de pollo con costra de cítricos del horno y déjelas reposar durante 10 minutos antes de servirlas.", "Mientras tanto, para los latkes de papa, ralle las papas y las cebollas en una toalla de té limpia. Recoja los bordes de la toalla de té y exprima el exceso de humedad de las papas y las cebollas.", "Coloque la mezcla de patata y cebolla en un bol y agregue los huevos batidos, la sal y la pimienta negra recién molida. Mezclar bien.", "Calentar el aceite vegetal en una sartén a fuego medio. Coloque una cucharada grande de la mezcla de patata y cebolla en la sartén y extiéndala en una ronda de aproximadamente 6 cm de diámetro. Cocine por 4-5 minutos en cada lado, o hasta que estén dorados y crujientes por todos lados.", "Para servir, coloque una pechuga de pollo con costra de cítricos en cada uno de los seis platos de servir y póngala al lado de los latkes de papa. Sirva con una ensalada verde ligeramente vestida."], "url": "www_bbc_co_uk_food_recipes_citruscrustedchicken_93143", "title": "Pechugas de pollo con costra de cítricos y latkes de patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharaditas de vinagre de vino blanco", "4 cucharaditas de miel clara", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva virgen extra", "1 chile rojo pequeño, cortado por la mitad, sin semillas, finamente picado", "4 naranjas pequeñas, peladas, médula quitadas, segmentadas", "2 pomelos de rubí, pelados, médula eliminada, segmentados", "1 pomelo simple, pelado, médula eliminado, segmentado", "1 cebolla roja pequeña, pelada, muy finamente cortada", "manojo de hojas de menta fresca, rasgado", "1 granada, solo semillas, para servir"], "method": ["Para el aderezo de chile y miel, mezcle el vinagre y la miel en un recipiente para servir de poca profundidad hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida. Poco a poco bata el aceite, usando un tenedor, luego agregue el chile y bata de nuevo. Agregue más vinagre o aceite, al gusto.", "Para la ensalada, acomode la fruta segmentada en un tazón grande y poco profundo.", "Espolvoree sobre la cebolla y la menta, luego vierta sobre el aderezo de chile y miel y mezcle bien hasta que cubra la ensalada.", "Justo antes de servir, espolvorea las semillas de granada sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_citrusandpomegranate_92667", "title": "Ensalada de cítricos y granadas con aderezo de chile y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrusandpomegranate_92667_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 hojas de lechuga rizadas", "2.5cm / 1 en pieza de pepino, en rodajas", "4-5 segmentos de naranja", "mayonesa (compruebe que utiliza huevos de gallinas camperas o que no contenga huevos) o una llovizna de", "aceite de sésamo"], "method": ["Mezcle los ingredientes de la ensalada y llene el rollo.", "Añadir aderezo."], "url": "www_bbc_co_uk_food_recipes_citrussizzlerfrissel_6546", "title": "Citrus sizzler frisée - segmentos de lechuga, berro, pepino y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de mantequilla, más extra para engrasar", "150g / 5½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "3 huevos de gallinas camperas", "1 limón, ralladura solamente", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½fl oz de vino blanco", "4 vainas de cardamomo, ligeramente trituradas", "1 vaina de vainilla, dividida", "Albaricoques secos de 55 g / 3 oz"], "method": ["Para la esponja de cítricos, coloque el azúcar y la mantequilla en un procesador de alimentos y mezcle hasta que se combinen.", "Agregue la harina y el polvo de hornear y mezcle de nuevo.", "Agregue los huevos y la ralladura de limón y mezcle hasta que quede suave.", "Coloque las cantidades iguales de la mezcla de torta en dos moldes engrasados ​​aptos para microondas (a medio llenar) y cubra con una película adhesiva antes de calentar en el microondas a máxima potencia durante 3½ minutos, o hasta que se haya levantado y cocinado.", "Para el jarabe, coloque el azúcar y el vino en una sartén pequeña a fuego medio y deje que hierva.", "Agregue el cardamomo, la vaina de vainilla y los albaricoques y reduzca el fuego a fuego lento durante 5-6 minutos, o hasta que el líquido se haya reducido y esté ligeramente almibarado.", "Para servir, voltea las esponjas en platos para servir. Coloque los albaricoques y el jarabe sobre las esponjas."], "url": "www_bbc_co_uk_food_recipes_citrusspongewithapri_88901", "title": "Esponja de cítricos con albaricoques escalfados en jarabe de cardamomo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ pechuga de pato", "sal y pimienta negra recién molida", "1 naranja, solo jugo", "1 lima, solo jugo", "1 cucharada de salsa de soja", "2 cucharadas de jarabe de oro", "85g / 3oz de arroz de grano largo", "400ml / 14fl oz de caldo de verduras", "25 g / 1 oz de judías verdes, recortadas y picadas", "¼ de pimiento rojo, picado", "sal y pimienta negra recién molida", "hojas frescas de cilantro", "1 rodaja de naranja"], "method": ["Para el pato, corte los bordes de la grasa y marque la piel con la punta de un cuchillo afilado. Sazonar bien con sal y pimienta negra recién molida. Caliente una sartén hasta que esté humeando, luego agregue el pato, con la piel hacia abajo, y fríalo durante 3-4 minutos para procesar parte de la grasa. Dale la vuelta al pato.", "En un tazón, mezcle los ingredientes restantes del pato y vierta sobre el pato. Cocine por 2-3 minutos, o hasta que el líquido esté espeso y brillante.", "Para el arroz, coloque el arroz en una sartén con el caldo, las judías verdes y el pimiento rojo. Llevar a ebullición y cocinar durante 10-12 minutos, o hasta que el arroz esté tierno. Escurra, sazone con sal y pimienta negra recién molida y empaquételo en un bol pequeño de vidrio engrasado, luego coloque en un plato para servir.", "Cortar el pato, colocar al lado del arroz y rociar sobre los jugos de la sartén. Adorne con cilantro fresco y naranja para servir."], "url": "www_bbc_co_uk_food_recipes_citrussyrupglazedduc_90447", "title": "Pechuga de pato glaseada con jarabe de cítricos con ensalada de arroz fragante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "2-3 cucharadas de agua fría", "Harina normal de 225 g / 8oz, más extra para hacer harina", "110g / 4oz de mantequilla fría sin sal, cortada en cubitos", "pizca de sal", "4 huevos grandes de gallinas camperas", "1 yema de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "2 limones (preferiblemente sin encerar), ralladura y jugo", "1 lima (preferiblemente sin encerar), ralladura y jugo", "Crema doble de 200 ml / 7 fl oz", "azúcar en polvo, para quitar el polvo", "frambuesas frescas", "crema espesa"], "method": ["Para la masa, separe los huevos. Agregue 2-3 cucharadas de agua fría a las yemas de huevo y revuelva con un tenedor. (Puede usar las claras de huevo para otro plato o congelarlas).", "Coloque la harina en el recipiente de un procesador de alimentos, seguido de la mantequilla fría y la sal.", "Encienda el procesador y pulse varias veces hasta que la mezcla se asemeje a pan rallado fino.", "Agregue dos tercios de la mezcla de yema de huevo / agua y vuelva a pulsar. Si la mezcla aún está demasiado seca, agregue la mezcla restante de huevo y agua (es posible que no necesite usarla por completo). Tenga cuidado de no trabajar demasiado en la masa. Deje de pulsar cuando la mezcla tenga la consistencia de pan rallado grueso.", "Coloque la masa en una superficie de trabajo limpia y enharinada y, con las manos enharinadas, júntela para hacer una masa suave, pero no la amase.", "Forma una bola aplanada, envuélvela en una película adhesiva y refrigérala por unos 10-15 minutos. Puedes guardar la masa en esta etapa durante 2-3 días si no la usas inmediatamente.", "Retire la masa de la nevera. Sobre una superficie de trabajo limpia y enharinada, extiéndalo con un rodillo enharinado hasta que sea un poco más grande que el anillo de flan. Usando el rodillo, levante la masa y colóquela sobre el anillo de flan.", "Con los dedos, presione levemente la masa en los lados del anillo. Pase un rodillo sobre la parte superior del anillo y retire el exceso de masa en los bordes. Con los dedos, presione suavemente la masa hacia arriba para aumentar ligeramente la altura de la masa en los bordes. Pinche la base de la masa con un tenedor.", "Haga una cartouche (un círculo de papel resistente a la grasa) ligeramente más grande que la base de la lata de flan y forre la caja de pastelería con ella. Coloque algunos granos de cerámica para hornear adentro para pesar la masa. Coloque en la nevera para relajarse durante unos 20 minutos.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque los pasteles en el horno y hornee a ciegas por unos 20 minutos. Retire el cartucho de papel y los frijoles para hornear durante los últimos cinco minutos para que queden crujientes.", "Realice el llenado batiendo los huevos, la yema de huevo y el azúcar hasta que quede suave y espumoso, con un batidor manual o con un batidor eléctrico. Esto llevará de 5 a 10 minutos.", "Zest y jugo los limones y la lima. Coloque el jugo y la ralladura en un bol y mezcle bien. Bata la crema en la mezcla de huevo y azúcar, luego vierte el limón y el jugo de limón y la ralladura en la mezcla de crema. La acidez en los cítricos espesará la crema. Mezcle suavemente.", "Usando una jarra, vierta la mezcla de relleno en la caja de repostería preparada, mientras todavía está en la rejilla del horno. Reduzca la temperatura a 150 ° C / 300 ° F / Gas 2 y hornee durante aproximadamente 50 minutos, o hasta que se haya establecido.", "Retire la tarta del horno y deje que se enfríe completamente antes de enfriarla en el refrigerador. Retire con cuidado el anillo de flan. Polvo con azúcar glas antes de servir.", "Servir con frambuesas frescas y crema espesa."], "url": "www_bbc_co_uk_food_recipes_citrustartwithrichsh_90187", "title": "Tarta de cítricos con rico pastel de brisa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrustartwithrichsh_90187_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de harina natural o harina blanca fuerte", "pizca de sal", "75 g / 2½ oz de mantequilla", "4 huevos de gallinas camperas", "200g / 7oz de azúcar glasé", "25 g / 1 oz de cacao en polvo", "50g / 1¾oz de azúcar glas, tamizado", "1 cucharadita de extracto de vainilla", "400ml / 14fl oz de crema batida, volumen batido (aproximadamente 200ml / 7fl oz crema doble sin usar)"], "method": ["Para la masa, tamice la harina y una pizca de sal en un tazón grande y déjelo a un lado.", "Ponga 150ml / 5½ fl oz de agua y la mantequilla en una cacerola a fuego medio-alto y revuelva hasta que la mantequilla se derrita. Deje que la mezcla hierva y luego retire inmediatamente la sartén del fuego.", "Agregue la harina y la sal y bata muy bien con una cuchara de madera hasta que la mezcla se una.", "Reduzca el fuego a medio y reemplace la cacerola sobre el fuego. Revuelva por un minuto hasta que la mezcla comience a pegarse ligeramente a la base de la sartén. Retirar del fuego y dejar enfriar por un minuto.", "Batir tres huevos juntos y verter aproximadamente una cuarta parte del huevo batido en la sartén. Usando la cuchara de madera, bata muy bien hasta que se incorpore. Agregue un poco más de huevo y bata bien nuevamente hasta que la mezcla vuelva a estar junta. Continúe agregando el huevo, batiendo vigorosamente todo el tiempo, hasta que la mezcla se haya suavizado, sea agradable y brillante y tenga una consistencia decreciente. Es posible que no necesite agregar todo el huevo o puede necesitar un poco más. Si la mezcla es demasiado dura (no hay suficiente huevo), la pasta choux será demasiado pesada, pero si la mezcla está demasiado húmeda (demasiado huevo), no mantendrán su forma cuando se la coloque sobre papel para hornear.", "Precaliente el horno a 220 ° C / 425 ° F / Gas 7. Cubra una bandeja para hornear con papel pergamino (no papel a prueba de grasa, ya que los éclairs pueden pegarse al cocinarlos).", "Coloque la masa en una manga pastelera equipada con la boquilla de 5-8 mm / ¼ - 3 / 8in y pinte en longitudes de aproximadamente 10 cm / 4 pulgadas de largo en la bandeja de horneado preparada, con una separación de aproximadamente 4 cm / 1 ½ pulgadas para permitir la expansión. Use un pequeño cuchillo mojado para detener la salida de la masa cuando haya terminado de pasar cada éclair.", "Batir el huevo restante y cepillarlo suavemente sobre los éclairs. Hornee en el horno por diez minutos, luego reduzca la temperatura del horno a 200C / 400F / Gas 6 y continúe cocinando por otros 15-20 minutos, o hasta que los éclairs estén hinchados, dorados y crujientes.", "Retire los éclairs del horno y, con un pincho o la punta de un cuchillo pequeño y afilado, haga un agujero en el costado o en la base de cada éclair. Vuelve al horno y hornea por otros cinco minutos para permitir que escape el vapor. Transfiera los éclairs a una rejilla de alambre para enfriar.", "Para el glaseado de glaseado de chocolate, tamice el azúcar glas y el polvo de cacao en un bol. Agregue 1-2 cucharadas de agua hirviendo y revuelva para mezclar, agregando un poco más de agua hirviendo si es necesario hasta que el glaseado se pueda untar pero no esté demasiado líquido.", "Para el relleno de crème Chantilly, doble el azúcar glas tamizado y el extracto de vainilla en la crema batida. Enfríe en el refrigerador hasta que esté listo para usarlo.", "Cuando los éclairs estén fríos, ponga la crema chantilly en una bolsa de plástico limpia con una boquilla pequeña y lisa y vierta la crema en los éclairs a través del orificio hecho durante la cocción hasta que estén bien llenos.", "Con una espátula pequeña o un cuchillo de mesa que haya estado en una jarra de agua caliente (para facilitar la distribución del glaseado), extienda el glaseado sobre la parte superior de cada éclair, sumergiendo el cuchillo en el agua caliente entre cada éclair. Servir."], "url": "www_bbc_co_uk_food_recipes_clairs_18413", "title": "relámpago", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 25 relámpagos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 panecillos de masa fermentada o rollos crujientes (aproximadamente 12 cm / 4½ pulgadas de diámetro), tapas removidas, masa recortada y descartada", "1kg / 2lb 4 oz de almejas frescas, restregado", "Papas cerosas 225g / 8oz, peladas y cortadas en dados en cubos de 1.5cm / ⅝in", "40 g / 1½ oz de mantequilla sin sal", "75g / 2¾oz de tocino rayado ahumado, finamente picado", "1 cebolla pequeña o chalote de plátano, finamente picado", "1 puerro, limpio, reducido a la mitad longitudinalmente y finamente picado", "2 palitos de apio, más o menos picados", "Harina normal de 30g / 1oz", "500ml / 18fl oz de leche entera", "Crema doble de 200 ml / 7 fl oz", "1 hoja de laurel", "Filete de bacalao a 200g / 7oz (u otro pescado blanco), sin piel, cortada en piezas de 2cm / ¾in", "1 cucharadita de sal", "10 vueltas de peppermill negro", "pizca de nuez moscada recién rallada", "pequeño puñado de perejil de hoja plana o cebollín, más o menos picado, para servir"], "method": ["Ponga a hervir 250 ml / 9 fl oz de agua en una sartén grande y poco profunda. Agregue las almejas, coloque una tapa y deje que el vapor entre 3 y 4 minutos hasta que se abran. Coloque un colador sobre un tazón grande y drene las almejas, reservando el licor de cocción. Cuando las almejas estén lo suficientemente frías como para manipularlas, retire la carne de las conchas y déjela a un lado.", "Ponga a hervir una cacerola de agua con sal y cocine las papas durante 5-10 minutos hasta que estén tiernas. Escurrir y apartar.", "Derrita la mantequilla en una cacerola grande a fuego medio y fría el tocino, la cebolla o la chalota, el puerro y el apio hasta que estén suaves. Agregue la harina común y cocine durante 1 minuto. Agregue el licor de cocción de almejas y revuelva hasta que espese. Agregue la leche, la crema, la hoja de laurel, las papas y el bacalao. Llevar a ebullición, luego baje la temperatura y cocine a fuego lento durante 5 minutos hasta que el bacalao esté cocido. Agregue la carne de almeja y sazone con la sal, la pimienta y la nuez moscada.", "Coloque la sopa de pescado en los panecillos ahuecados y decore con perejil picado o cebollino."], "url": "www_bbc_co_uk_food_recipes_clam_chowder_in_26359", "title": "Sopa de almejas en tazones de masa fermentada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Algas kombu de 1 hoja (alrededor de 100 g / 3½ oz de peso)", "10g de setas shiitake secas", "Tocino ahumado 250 g / 9 oz, como panceta, piel en", "3 cucharadas de mirin, o al gusto", "2 cucharadas de sake, o al gusto", "2 cucharadas de salsa de soja, o al gusto", "10g de copos de bonito (disponibles en línea)", "sal", "100ml / 3½fl oz de vinagre de arroz", "50 g / 1 oz de azúcar en polvo", "1 cucharadita de semillas de cilantro", "50g / 1¾oz de samphire", "50g / 1¾oz aster de mar", "500g / 1lb 2oz palourde almejas, lavado", "1 cucharada de aceite vegetal", "1 diente de ajo, finamente cortado en cubitos", "2 chalotes de plátano, finamente cortados en cubitos", "125ml / 4fl oz de vino blanco seco", "1 cucharada de mantequilla sin sal", "2 paquetes (aproximadamente 600g / 1lb 5oz) fideos udon frescos", "500g / 1lb 2oz palourde almejas, lavado", "1 cucharada de aceite vegetal", "1 diente de ajo, finamente cortado en cubitos", "2 chalotes de plátano, finamente cortados en cubitos", "125ml / 4fl oz de vino blanco seco", "1 cucharada de mantequilla sin sal", "2 paquetes (aproximadamente 600g / 1lb 5oz) fideos udon frescos", "flores comestibles"], "method": ["Para hacer el dashi, coloca los hongos kombu y shiitake en una olla mediana con aproximadamente 800 ml / 1⅓ de agua fría. Llevar a fuego lento a fuego lento durante 30 minutos. Retire el kombu y agregue el tocino y cocine a fuego lento durante 30 minutos. Sazone el dashi con mirin, sake, salsa de soya y sal al gusto. Poner a un lado, mantener caliente y agregar los copos de bonito justo antes de servir.", "Para las verduras encurtidas, ponga el vinagre, el azúcar, las semillas de cilantro y 200 ml / 7 onzas de agua en una cacerola y deje que hierva. Cocine hasta que el azúcar se haya disuelto y luego enfríe. Coloque las verduras marinas en un frasco esterilizado, vierta el licor de escabeche y déjelas a un lado hasta que las recoja, alrededor de 5 a 10 minutos.", "Para las almejas, descarte las conchas abiertas que no se cierren después de un buen golpecito.", "Calentar el aceite en una cacerola a fuego medio, sudar el ajo y los chalotes hasta que se vuelvan translúcidos. Aumente el fuego y agregue rápidamente las almejas. Agregue el vino y cubra. Dale un par de batidos para extender las almejas y ayúdalas a abrir. Una vez que las almejas se hayan abierto, unos 2-3 minutos, sáquelas con una cuchara ranurada y déjelas a un lado. Continúe cocinando hasta que el líquido se haya reducido a la mitad. Agregue la mantequilla y mezcle.", "Agregue el udon a la salsa y cocine por 2-3 minutos, agregue las almejas y mezcle. Sazonar con sal.", "Divida el udon y las almejas entre los cuencos, espolvoree sobre el togarashi y cubra con las verduras marinas en vinagre. Vierta el dashi suavemente sobre el Udon, adorne con flores comestibles y sirva."], "url": "www_bbc_co_uk_food_recipes_clam_udon_with_dashi_35620", "title": "Clam udon con dashi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 libras 8 oz frescas almejas vivas", "2 cucharadas de cebolla picada", "2 cucharadas de puerro, picado", "2 cucharadas de zanahoria picada", "ramita de perejil fresco", "ramita de tomillo fresco", "180ml / 6fl oz de vino blanco", "1 cebolla mediana, finamente picada", "2 cucharadas de mantequilla sin sal", "2 patatas grandes peladas y cortadas en dados", "250 ml / 9 fl oz de agua, caldo de pescado o caldo de pollo liviano", "Crema doble de 200 ml / 7 fl oz", "crema, batida", "1 cucharada de perejil fresco, picado"], "method": ["Lave las almejas con agua corriente fría.", "Coloque los aromáticos - cebolla picada, puerro, zanahoria, perejil y tomillo en una olla grande, agregue 400 ml / 14 fl oz de agua y cocine a fuego lento durante 10 minutos para infundir el sabor. Añadir el vino y llevar a ebullición.", "Agregue las almejas, tape y cocine, hirviendo rápidamente hasta que las almejas se abran, esto solo toma uno o dos minutos. Escurrirlos en un colador, asegurándose de recoger el líquido de cocción en un recipiente debajo. Esto se usará en la sopa de pescado.", "Aparta mientras jalas las almejas de sus caparazones. Deseche las cáscaras y las ramitas de perejil y tomillo. Guarde las almejas y las verduras picadas, los aromáticos, y colóquelos en el caldo reservado.", "Para hacer la sopa de pescado, saltee la cebolla en dos cucharadas de mantequilla sin sal, a fuego medio en una olla grande hasta que esté suave y transparente. Agregue el agua o el caldo y cocine a fuego lento.", "Agregue las papas a la olla y cocine a fuego lento hasta que las papas estén cocidas.", "Tome la mitad de esta mezcla de papa y mezcle en una licuadora de alimentos o procesador de alimentos. Esto le dará una sopa espesa y cremosa que engrosará toda la sopa de pescado.", "Combine las dos mezclas de papa, las almejas en sus jugos y caldo de cocina, y la crema, y ​​cocine a fuego lento.", "Pruebe el condimento y sirva inmediatamente adornando con el perejil picado y, si lo desea, una cucharada de crema batida."], "url": "www_bbc_co_uk_food_recipes_clamchowderandpotato_75308", "title": "Sopa de almejas y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz almejas", "75ml / 3fl oz de agua", "25g / 1oz de mantequilla", "Tocino grueso rebanado 50g / 2oz, picado", "Cebollas 110g / 4oz, picadas", "Papas 225g / 8oz, picadas", "300 ml / 10 fl oz de leche", "Crema doble 125ml / 4½fl oz", "1 hoja de laurel", "pizca de nuez moscada rallada", "sal y pimienta blanca recién molida", "1 cucharada de perejil fresco de flatleaf", "pan de masa fermentada, en rodajas"], "method": ["Limpie las almejas y deseche las que no se cierren al tocarlas.", "Calentar una sartén con tapa grande hasta que esté caliente, agregar las almejas y el agua y llevar a ebullición. Cubra con una tapa y cocine por 2-3 minutos, o hasta que todas las almejas se hayan abierto, deseche las que permanezcan cerradas.", "Cuele las almejas, reservando el licor de cocina. Retire todas las almejas de sus conchas y déjelas a un lado, descartando las conchas.", "Caliente la mantequilla en otra sartén honda, agregue el tocino y fría por 2-3 minutos, o hasta que se dore.", "Agregue las cebollas y cocine por otros 2-3 minutos hasta que se ablanden.", "Agregue las papas junto con la leche, la crema, la hoja de laurel, la nuez moscada y el licor de las almejas. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que las papas estén cocidas pero firmes.", "Agregue las almejas y condimente, al gusto, con sal y pimienta blanca recién molida.", "Para servir, divida la sopa entre cuatro tazones para servir, espolvoree sobre el perejil y sirva con pan de masa fermentada."], "url": "www_bbc_co_uk_food_recipes_clamchowder_87459", "title": "Sopa de almejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]