[{"ingredients": ["2 galletas de estilo digestivo de avena", "20 g / oz de mantequilla, derretida", "½ limón, solo jugo", "½ lima, solo jugo", "1 cucharada de azúcar glas", "125g / 4½ oz de mascarpone"], "method": ["Coloque los bizcochos en una bolsa de sándwich y use un rodillo para golpearlos suavemente hasta que queden pequeñas migas.", "Incline las galletas trituradas en un recipiente y vierta la mantequilla derretida. Revuelva juntos hasta que estén bien combinados, luego coloque las migajas en la parte inferior de dos vasos pequeños y presione firmemente hacia abajo.", "Mezcle el jugo de limón y lima, el mascarpone y el azúcar glas juntos en un bol hasta que estén bien combinados.", "Divida la mezcla entre los dos vasos y enfríe en la nevera durante dos horas."], "url": "www_bbc_co_uk_food_recipes_lemon_and_lime_02564", "title": "Tarta de queso limón y lima", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo sin piel", "2 cucharadas de aceite de sésamo", "2 cucharaditas de aceite vegetal", "2 cucharadas de salsa de soja", "2 dientes de ajo, finamente picados", "½ limón, ralladura de ralladura y jugo", "sal y pimienta negra recién molida", "1 cucharada de miel clara", "2 cucharadas de aceite de cacahuete", "2-3 cucharaditas de aceite de sésamo", "2 huevos de gallinas camperas, ligeramente golpeados", "splash salsa de soja", "2 cebollas tiernas, finamente picadas", "50g / 2oz de guisantes frescos o guisantes congelados descongelados", "Arroz de grano largo de 150 g / 5 oz, cocido de acuerdo con las instrucciones del paquete", "sal y pimienta negra recién molida", "3-4 cucharadas de cilantro picado", "cuñas de lima, para servir"], "method": ["Para peinar las pechugas de pollo, colóquelas en un tablero y use un cuchillo afilado para hacer un corte paralelo a la tabla de cortar tres cuartos del camino a través de cada pecho. Abra cada pechuga de pollo para que tenga dos pechugas de pollo grandes y delgadas.", "Colóquelos en un tazón con una cucharada de aceite de sésamo, aceite vegetal, salsa de soja, ajo y ralladura de limón y jugo. Sazonar con sal y pimienta negra recién molida y mezclar para combinar. En un recipiente aparte, mezcle la miel con el aceite de sésamo restante.", "Caliente una sartén a fuego medio-alto hasta que esté humeante, coloque el pollo sobre la plancha y cocínelo durante 2-3 minutos por cada lado, cepillándolo una o dos veces con la mezcla de miel y sésamo. Cuando esté listo, el pollo debe ser a la parrilla en el exterior y completamente cocido (los jugos deben quedar limpios cuando se inserta un pincho en la parte más gruesa del pollo). Déjalo reposar por 2-3 minutos.", "Mientras tanto, para el arroz, caliente un wok a fuego alto y luego agregue el maní y una cucharadita de aceite de sésamo. Cuando el aceite empiece a brillar, agregue los huevos y cocine, revolviendo todo el tiempo, durante 1-2 minutos o hasta que estén revueltos.", "Empuje los huevos al lado de la sartén y agregue un poco más de aceite de sésamo, la salsa de soja, cebollas y guisantes y cocine por un minuto, luego agregue el arroz y sazone con sal y pimienta negra recién molida. Cocine, revolviendo continuamente, durante 3-4 minutos, o hasta que se caliente. Revuelva a través del cilantro.", "Para servir, cuchara el arroz en platos. Corta el pollo en diagonal en tiras finas y colócalo encima del arroz. Cubra con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_and_lime_chicken_27815", "title": "Pollo de limón y lima con arroz frito con cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lime_chicken_27815_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "5 claras de huevo de gallinas camperas", "400 g / 14 oz de azúcar en polvo", "2 ramitas de hierba luisa, solo hojas, más ramitas adicionales para servir", "8 ciruelas maduras, piedras removidas, cortadas en cuartos", "Crema doble 500ml / 18fl oz", "225g / 8 oz de cuajada de limón lista de buena calidad"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Engrase una lata de rollo suizo de 35x25cm / 14x10in con mantequilla y cubra con silicona o papel para hornear.", "Batir las claras de huevo en un tazón grande y limpio con un batidor eléctrico, o en el tazón de un mezclador de alimentos de pie. Coloque el batidor a una velocidad alta y bata hasta que se formen picos suaves cuando se quite el batidor.", "Gradualmente agregue 275g / 9¾oz del azúcar en polvo, batiendo hasta que se haya incorporado todo el azúcar y la mezcla esté suave y brillante. Debería escuchar que la máquina deja caer un engranaje cuando la mezcla alcanza la consistencia correcta, y debería parecerse a la espuma de afeitar.", "Coloque el merengue en la lata preparada y alise en una capa uniforme con una espátula. Espolvorea sobre las hojas de verbena de limón.", "Hornee durante 7-8 minutos, o hasta que estén dorados en la parte superior, luego reduzca la temperatura del horno a 170C / 150C Fan / Gas 3 y hornee por otros 8-10 minutos, o hasta que estén crujientes.", "Retire el merengue del horno y sáquelo de la lata en una toalla de té limpia. Pele el papel de la base del merengue y déjelo enfriar.", "Mientras tanto, coloca las ciruelas, 100 g / 3½ oz del azúcar y 100 ml / 3 ½ oz de agua en una olla y lleva la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 8-10 minutos, o hasta que las ciruelas se hayan ablandado pero aún conserven su forma.", "Batir la crema doble en un tazón grande hasta que se formen picos muy suaves cuando se quita la batidora. Suavemente agregue el azúcar restante, luego doble la crema de limón.", "Extienda la mezcla de crema de limón en la parte superior del merengue refrigerado hasta los bordes, dejando un espacio de 1 cm / ½ pulgadas a lo largo de uno de los bordes largos. Coloque tres cuartos de las ciruelas cocidas en la parte superior.", "Comenzando en el extremo largo con el borde, enrolle el merengue con el paño de cocina para ayudarlo.", "Con cuidado, saque el rollo de la toalla y colóquelo en un plato para servir. Coloque las ciruelas restantes alrededor del pastel y adorne con las ramitas de verbena de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_and_plum_meringue_51269", "title": "Rollo de merengue de ciruela y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 25cm / 10in cáscara de tarta pastelería cocción dulce, ciega al horno (puede usar pastelería ya hecha)", "300 g / 10½ oz de mascarpone", "300 g / 10½ oz de azúcar en polvo", "6 limones, jugo y ralladura", "6 huevos de gallinas camperas, más 6 yemas de huevo de gallinas camperas", "175g / 6oz de azúcar en polvo", "150ml / 5½fl oz de champán", "200g / 7oz de frambuesas frescas", "azúcar en polvo", "frambuesas", "crema batida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Batir el mascarpone, el azúcar impalpable, el jugo de limón y la ralladura en un bol hasta que esté muy suave.", "Batir los huevos y las yemas de huevo hasta que estén bien combinados.", "Vierta la mezcla en la cáscara de tarta y hornee en el horno durante 45-60 minutos, o hasta que se endurezca. Retire la tarta del horno y déjela enfriar, luego déjela enfriar en la nevera.", "Para la salsa, hierva el azúcar y el champán en una cacerola, luego reduzca el fuego y cocine a fuego lento durante 10 minutos. Retirar del fuego, luego agregar las frambuesas y reservar para enfriar por completo.", "Licúa la salsa en una licuadora hasta que quede suave, luego pasa a través de un colador.", "Para servir, corte una rebanada de tarta, espolvoree un poco de azúcar glas y caramelice con un soplete de cocina (opcional).", "Coloque la rebanada en un plato de servir y rocíe sobre una salsa pequeña. Cubra con las frambuesas y la crema batida."], "url": "www_bbc_co_uk_food_recipes_lemon_and_mascarpone_29573", "title": "Tarta de limón y mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_mascarpone_29573_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 granada grande o 2 pequeñas", "200g / 7oz de cuscús", "250ml / 9fl oz pintas de caldo de pollo hirviendo o agua", "sal marina y pimienta negra recién molida", "2 limones, solo jugo", "6 cucharadas de aceite de oliva", "4 cucharadas de menta fresca picada o cilantro"], "method": ["Corta las granadas por la mitad y quita las semillas con una cucharilla y quita la membrana blanca alrededor de las semillas.", "Coloque el cuscús en un tazón. Vierta el caldo hirviendo o agua sobre el cuscús y mezcle el aceite de oliva y el jugo de limón. Sazonar con sal marina y pimienta negra recién molida.", "Cúbralo con film transparente y deje que el cuscús se siente en un lugar cálido durante 5-10 minutos o hasta que el líquido haya sido absorbido. Retire la película adhesiva y pelusa los granos con un tenedor. Deje que el cuscús se enfríe por completo.", "Mezcle las hierbas picadas y las semillas de granada en el cuscús. Agregue más aceite de oliva, sal, pimienta y hierbas al gusto."], "url": "www_bbc_co_uk_food_recipes_lemon_and_pomegranate_48177", "title": "Cuscús de limón y granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_pomegranate_48177_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal o spray de liberación de torta, para engrasar la lata", "Harina de auto aumento 250g / 9 oz", "2 cucharaditas de polvo de hornear", "Mantequilla 250g / 9oz, ablandada", "250 g / 9 oz de azúcar en polvo", "50 g / 1¾oz de almendras molidas", "4 huevos grandes de gallinas camperas", "4 limones no encerados, solo ralladura (jugo reservado para la llovizna)", "3 cucharadas de semillas de amapola", "un poco de agua hirviendo, aflojar la mezcla si es necesario", "8 cucharadas de jugo de limón (desde arriba)", "8 cucharadas de azúcar en polvo", "2 cucharadas de limoncello (alternativamente, use jugo de limón)", "1 limón no encerado, cortado en rodajas finas y sin pepitas", "4-5 cucharadas de azúcar en polvo", "4 cucharadas de almendras en copos", "1 cucharada de semillas de amapola", "125g / 4½oz de azúcar glasé", "1 cucharada de limoncello (alternativamente use jugo de limón)", "1 limón sin cera, solo jugo"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase una lata para torta anillada antiadherente de 25 cm / 10 in con spray antiadherente o aceite vegetal.", "Tamiza la harina y el polvo de hornear en un tazón grande. Agregue el resto de los ingredientes (excepto el agua) y bata hasta obtener una mezcla homogénea con una batidora eléctrica. Agregue aproximadamente 100 ml / 3½ fl oz de agua caliente del hervidor para aflojar la mezcla hasta obtener una consistencia suave, si es necesario. Verter en la lata preparada y hornear durante unos 35 minutos, o hasta que la torta comience a desprenderse de los lados. Para comprobar si el pastel está listo, inserte un pincho, si sale limpio, el pastel está cocido.", "Mientras tanto, haz la llovizna. Pon el jugo de limón y el azúcar en una olla pequeña y calienta suavemente hasta que el azúcar se disuelva. Aumente el fuego un poco y déjelo hervir durante aproximadamente un minuto, o hasta que espese y sirope. Agregue el limoncello, hierva por un minuto y reserve.", "Para la decoración, agregue las rodajas de limón al sirope de llovizna. Vuelva a calentar el almíbar y cocine a fuego lento durante 1-2 minutos o hasta que las rodajas de limón se hayan suavizado. Apague el fuego y, utilizando pinzas, transfiera con cuidado las rodajas de limón a un plato forrado con papel resistente a la grasa. Dejar enfriar y reservar cualquier jarabe sobrante.", "Cuando esté lo suficientemente frío como para manipularlo, haga un corte desde el centro de las rodajas de limón hasta la piel y gire los extremos en la dirección opuesta (para que se asemejen a un arco). Repita con todas las rebanadas, espolvoree con azúcar en polvo y colóquelo en una bandeja para hornear forrada con papel antiadherente.", "Cuando la torta esté cocida, reduzca la temperatura del horno a 100C / 80C Fan / Gas ¼.", "Deja la torta en la lata mientras aplicas la llovizna. Haga agujeros con un pincho y cepille o cuchara alrededor de un tercio de la llovizna sobre la torta. Deje que se enfríe durante 5 minutos y luego coloque la torta en una rejilla de alambre. Haga algunos agujeros más en la parte superior de la torta (estos se cubrirán con glaseado más tarde) y cepille o espolvoree el resto del almíbar sobre la torta entera. Deje que se enfríe completamente. Cuando el pastel esté frío, transfiéralo a un plato de servir o a un pastel.", "Mientras tanto, ponga los giros de limón en el horno para que se sequen durante 30 minutos a 1 hora, hasta que estén masticables (en lugar de crujientes).", "Tueste las almendras en copos en una sartén seca hasta que estén doradas, luego déjelas enfriar.", "Para la guinda, mezcle el azúcar glas, el limoncello y un poco de jugo de limón hasta que tenga un glaseado espeso. Rocíe sobre la parte superior de la torta, alentándola a correr por los lados un poco. Decorar con los giros de limón, almendras en copos y semillas de amapola."], "url": "www_bbc_co_uk_food_recipes_lemon_and_poppy_seed_63235", "title": "Tarta de llovizna y semilla de amapola", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 x 25cm / 10 en forma de anillo pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppy_seed_63235_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 400g / 14oz de hojaldre listo para usar", "harina común, para quitar el polvo", "1 limón, ralladura finamente rallada solamente", "300g / 10½oz de queso ricotta", "200 g / 7 oz de queso mascarpone", "Cáscara confitada de 200g / 7oz, más o menos picada", "125 g / 4½ oz de azúcar en polvo", "6 huevos de gallinas camperas, separados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Ruede los pasteles sobre una superficie de trabajo ligeramente enharinada hasta un grosor de 3 mm / ⅛ pulgadas. Use la masa para forrar una caja de pastelería de 25cm / 10in. Cubra con un paño húmedo mientras realiza el llenado.", "En un tazón grande, mezcle la ricota, el mascarpone y la cáscara confitada con 100 g / 3½ oz del azúcar y cinco de las yemas de huevo hasta que estén suaves y bien combinados.", "Batir las claras de huevo en otro recipiente grande y limpio hasta que estén esponjosas. Agregue el azúcar restante y continúe batiendo hasta que se formen picos rígidos cuando se quite la batidora.", "Con una cuchara grande de metal, dobla los blancos en la mezcla de ricotta, y luego vierte en la lata de tarta aglomerada.", "Batir la yema de huevo reservada en un tazón. Dobla la masa sobresaliente y cepilla con la yema de huevo. Hornee en el horno durante 30 minutos, hasta que la masa esté bien cocida y el relleno tenga una ligera oscilación en el centro.", "Déjelo enfriar por dos horas, luego espolvoree con ralladura de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_and_ricotta_tart_44080", "title": "Tarta de ricotta y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_ricotta_tart_44080_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas de jengibre de 175 g / 6 oz, aplastadas", "150g / 5oz de mantequilla, derretida", "1,2 Kg / 2½ lb de grasa completa de ricotta", "150 g / 5 oz de azúcar en polvo", "6 huevos de gallinas camperas", "1 cucharadita de extracto de vainilla", "250g / 9 oz de cuajada de limón", "1 cucharada de semillas de amapola", "200 g / 7 oz de azúcar en polvo", "150ml / 5fl oz de vino blanco", "Frambuesas 250 g / 9 oz frescas o congeladas", "1 cucharada de agua de rosas", "crema doble, para servir"], "method": ["Precalentar el horno a 175C / 350F / Gas 4.", "Mezcle las galletas de jengibre y la mantequilla derretida en un recipiente hasta que estén bien combinadas. Presiona en una lata de pastel con forma de resorte 22cm / 9in y enfría en la nevera durante 30 minutos.", "Para el relleno, mezcle el ricotta, el azúcar, los huevos y el extracto de vainilla en un procesador de alimentos hasta que quede suave.", "Coloque la mezcla en un cuenco y luego doble suavemente la cuajada de limón y las semillas de amapola. Con una cuchara, coloque esta mezcla en la lata de la torta sobre la base de la galleta refrigerada.", "Cocine la tarta de queso en el horno durante una hora, dependiendo de su horno. La tarta de queso se cocina cuando es elástica al tacto y simplemente se coloca en el medio.", "Para el jarabe, coloque el azúcar, 100 ml / 3½ fl oz de agua y vino en una olla y cocine a fuego lento hasta que todo el azúcar se disuelva. Deje hervir durante cinco minutos, o hasta que espese.", "Agregue las frambuesas y el agua de rosas al almíbar, retire la sartén del fuego y reserve. Una vez que se haya enfriado, mezcle la salsa en un procesador de alimentos hasta que quede suave y luego pase a través de un colador fino.", "Sirve la tarta de queso con la salsa y un poco de crema doble."], "url": "www_bbc_co_uk_food_recipes_lemon_and_poppyseed_09377", "title": "Tarta de queso de limón y poppyseed", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppyseed_09377_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla salada, fría, picada aproximadamente", "Harina normal de 200g / 7oz", "80g / 2¾oz de azúcar glas", "3 huevos de gallinas camperas, 2 yemas solo, 1 entero para lavar huevos", "50g / 1¾oz de ruibarbo", "4 limones, ralladura y jugo", "Crema doble de 320 g / 11¼ oz", "Azúcar en polvo 350g / 12oz", "10 huevos de gallinas camperas, 9 enteros, 1 yema solamente", "Ruibarbo de 200g / 7oz, aproximadamente picado", "100 g / 3½ oz de azúcar en polvo", "1 x 8 g de pectina de bolsita"], "method": ["Para la masa, frote la mantequilla en la harina con las manos hasta que se asemeje a pan rallado. Mezcle el azúcar glas, luego agregue las dos yemas de huevo y junte la mezcla en una masa. Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 10 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Retire la masa de la nevera y extiéndala a 2-3 mm / 1/8 pulgadas de grosor. Alinee las latas de tarta y ribetee los bordes. Arruga trozos de papel de pergamino un poco más grandes que las latas de tarta, y colócalos en la parte superior de la masa. Rellene con frijoles para hornear.", "Hornee las cajas de tartas durante cinco minutos, luego retírelas del horno, quite el pergamino y hornee los frijoles. Batir ligeramente un huevo en un bol para el lavado de huevos. Cepille las tartas con huevo lavado. Hornee de nuevo por otros minutos hasta que estén cocidos y dorados. Retire del horno y deje a un lado para que se enfríe completamente.", "Apague el horno a 120C / 250F / ½ Gas.", "Para el relleno, mezcle el ruibarbo 50g / 1¾oz en un procesador de alimentos y exprima el jugo. Combine este jugo con todos los demás ingredientes de relleno y colóquelo en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento, y caliente a 60 ° C / 140 ° F (use un termómetro para medir esto).", "Retirar del fuego y verter el relleno en las cajas de tartas refrigeradas y luego hornear hasta que el relleno alcance 70C / 158F en el termómetro (aproximadamente 10 minutos).", "Retire las tartas del horno y deje a un lado para que se enfríen.", "Haga la mermelada de ruibarbo combinando el ruibarbo, el azúcar y la pectina en una sartén y hasta que hierva. Caliéntelo a 107 ° C / 225 ° F y luego retírelo del fuego. Cuele la mermelada a través de un tamiz y déjela enfriar un poco.", "Coloque una pequeña cantidad del atasco en la parte superior de cada tartaleta y sirva."], "url": "www_bbc_co_uk_food_recipes_lemon_and_rhubarb_94455", "title": "Tartaletas de limón y ruibarbo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla sin sal", "2 cebollas, finamente cortadas en cubitos", "200 g / 7 oz de carne picada de cerdo", "1 manojo de salvia fresca, finamente picada", "175g / 6oz de pan blanco fresco", "100g / 3½oz Estacio", "1 limón, ralladura", "1,5kg / 3lb 5 oz de lomo de cerdo sin hueso, butterflied", "sal y pimienta negra recién molida", "500g / 1lb 2oz de patatas Maris Piper", "125ml / 4fl oz de crema doble", "125g / 4½oz de mantequilla sin sal", "50 g / 1¾oz de mantequilla sin sal", "Verdes de primavera de la cabeza, núcleo eliminado y en rodajas", "Jus de cerdo 200ml / 7fl oz o salsa"], "method": ["Para el lomo de cerdo relleno, precaliente el horno a 150C / 300F / Gas 2.", "Caliente una sartén y agregue 25 g / 10z de mantequilla. Una vez caliente, agregue la cebolla y cocine por un par de minutos. Permita que la cebolla se enfríe.", "En un tazón grande, mezcle la cebolla fría, la carne picada de cerdo, la salvia, el pan rallado, el sebo y la ralladura de limón.", "Coloque el lomo de cerdo, con la carne hacia arriba, en una tabla de cortar.", "Con un cuchillo filoso, haga una incisión en el ojo del lomo a la mitad hacia abajo, paralela a la tabla, cortando casi todo el cuerpo. Abra el lomo y repita varias veces, cortando para que el lomo se abra y quede tan plano como la parte del vientre del cerdo.", "Sazone con sal y pimienta negra, luego coloque el relleno en el lomo y extiéndalo a lo largo del lomo, luego enrolle en una salchicha grande.", "Asegure con una cuerda de cocina a 5-6 puntos a lo largo del lomo y luego transfiera a una lata de asar.", "Frote el resto de la mantequilla sobre la parte superior de la carne de cerdo y sazone con abundante sal marina.", "Asar en el horno durante cinco horas. El crujiente debe ser crujiente y el cerdo muy tierno.", "Para el puré de papa, cocine las papas en una sartén de agua hirviendo con sal durante 12-15 minutos, o hasta que estén tiernas. Desagüe.", "Presione la papa a través de un ricer de papa en una cacerola. Regrese al fuego, luego agregue la mantequilla y la crema y bata hasta obtener un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para las verduras de primavera, caliente la mantequilla en una cacerola limpia y agregue las verduras de primavera con un poco de agua y cocine hasta que se marchite.", "Para servir, esculpe el lomo de cerdo y colóquelo en un plato para servir. Coloque la papa al lado del lomo y las verduras marchitas al lado de eso. Vierta sobre el jus de cerdo o la salsa."], "url": "www_bbc_co_uk_food_recipes_lemon_and_sage_stuffed_91825", "title": "Limón y salvia relleno de lomo de cerdo con verduras de primavera marchitas y puré de patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos medianos de granja", "120 g / 4 oz de azúcar en polvo", "Harina simple 100 g / 3½ oz, tamizada", "20 g / ¾oz de mantequilla sin sal, derretida, más extra para engrasar", "190 g / 6½ oz de azúcar en polvo", "4 limones sin cera, ralladura fina y jugo", "130g / 4⅔oz de mantequilla sin sal", "1-2 cucharadas de harina de maíz", "3 huevos grandes de gallinas camperas y 1 yema grande de gallinas camperas, golpeadas", "Crema doble 600ml / 20fl oz", "30g / 1oz de azúcar glas, más extra para quitar el polvo", "Fresas de 150g / 5½oz, 3 reservadas para decoración, resto rebanado", "50g / 1¾oz de chocolate blanco, refrigerado y rallado", "50 g / 1¾oz de pistachos sin cáscara, pulsados ​​en un procesador de alimentos para migas finas"], "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Engrase y forre una lata de rollo suizo de 30x24cm / 12x9½ pulgadas con papel de hornear.", "Para el rollo, coloque un tazón grande a prueba de calor sobre una olla de agua hirviendo a fuego lento. Agregue los huevos y el azúcar al tazón y, usando una batidora eléctrica, bata durante 3-4 minutos, o hasta que duplique su tamaño. Quite el fuego y continúe latiendo por otros 4-5 minutos a una velocidad de media a alta.", "Con una cuchara grande de metal, doble la harina en tres lotes y asegúrese de que esté todo incorporado. Dobla la mantequilla derretida de la misma manera.", "Verter suavemente la mezcla en la lata preparada y extender uniformemente con una espátula. Hornea durante 10 minutos o hasta que esté firme y ligeramente dorado.", "Espolvoree una bandeja para hornear grande con azúcar glas y cuidadosamente cierre el rollo. Con cuidado, retire el papel de hornear utilizado para revestir la lata. Comenzando en un extremo corto, dobla el borde del papel sobre el pastel. Ruede la torta en el papel. Permita que el enredo se enfríe completamente mientras se lamina.", "Para el llenado, primero haga una cuajada. En una cacerola, caliente el azúcar, el jugo de limón, la ralladura de limón y la mantequilla a fuego medio. Revuelva cuando la mantequilla se derrita y cuando se mezcle, mezcle la harina de maíz. Continúe removiendo, usando un batidor manual, por otros 2-3 minutos. Quite el fuego y agregue los huevos batidos. Regrese a fuego lento y siga revolviendo hasta que la cuajada se espese y deje un rastro en la superficie cuando se quite la batidora (aproximadamente 15-20 minutos). Dejar enfriar y establecer.", "Para la crema, bata la crema y el azúcar glas juntos hasta que se formen picos suaves cuando se quita la batidora. Transferir a la nevera para enfriar.", "Una vez que el rollo esté frío, desenrósquelo y extiéndalo con una generosa capa de crema batida (conserve la crema restante para la decoración). Cubra con una capa de cuajada y fresas en rodajas. Vuelva a enrollar el rollo y colóquelo en un plato para servir.", "Extienda la crema restante sobre el trineo y anote con un tenedor. Esparza con ralladura de chocolate blanco y migas de pistacho y cubra con las fresas."], "url": "www_bbc_co_uk_food_recipes_lemon_and_strawberry_26775", "title": "Matambre de limón y fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_strawberry_26775_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de sal", "150g / 5½ oz de azúcar Demerara", "2 hojas frescas de laurel", "3-4 ramitas de tomillo", "Anís de 4 estrellas", "2 limones, cáscara pelada y solo jugo", "1 hombro de cerdo deshuesado y sin piel", "aceite vegetal, para cocinar", "100ml / 3½fl oz de vinagre de vino blanco", "300ml / 10½fl oz de caldo de pollo", "150g / 5½ oz de azúcar moreno", "180ml / 6fl oz de vino blanco", "2 dientes de ajo rallados", "100 ml / 3½ fl oz miel", "4 hojas frescas de laurel, finamente picadas", "4 cucharadas de estragón fresco picado", "2 yemas de huevo grandes de gallinas camperas", "2 cucharadas de mostaza Dijon", "2 cucharadas de vinagre de vino blanco", "250ml / 9fl oz de aceite vegetal", "5 cucharadas de aceite de nuez", "sal y pimienta de cayena, al gusto", "jugo de limón, al gusto", "100g / 3½oz de nueces tostadas, picadas", "1 zanahoria, rallada", "¼ de col blanca, finamente rebanada", "1 cebolla, finamente rebanada", "panes pitta integrales, ligeramente tostados", "lechuga (opcional)"], "method": ["Para el limón y el estragón se extrae la carne de cerdo, en una cacerola se calienta 1 litro / 1¾ pintas de agua, la sal, el azúcar Demerara, las hojas de laurel, el tomillo, el anís estrellado y la cáscara de limón. Hierva hasta que la sal y el azúcar se hayan disuelto, luego retírelos del fuego y déjelos enfriar.", "Cuando la salmuera esté fría, coloque el hombro de cerdo en un recipiente y vierta sobre la salmuera fría. Cubra y coloque en la nevera durante 24 horas.", "Cuando esté listo para cocinar el cerdo, precaliente el horno a 140C / 275F / Gas 1.", "Retire la carne de cerdo del adobo, seque y coloque sobre una hoja de papel de aluminio. Rocíe con el aceite y envuelva la carne en papel de aluminio, sellando los bordes para formar un paquete. Coloque en una lata de asar y transfiéralo al horno para cocinar lentamente durante al menos cuatro horas, o hasta que el cerdo esté bien hecho y tierno.", "Retire del horno y deje enfriar, aún envuelto, durante 25-30 minutos.", "Mientras tanto, en una sartén grande, combine el vinagre de vino blanco, caldo de pollo, azúcar morena, vino blanco, ajo rallado, miel y hojas de laurel y deje que hierva. Baja el fuego a fuego lento.", "Abra la carne de cerdo envuelta y, con dos tenedores, separe la carne de cerdo y triture todo. Coloque la mezcla de cerdo en el caldo hirviendo a fuego lento y cocine durante 35-40 minutos, dejando que el caldo se reduzca a un esmalte pegajoso.", "Mientras tanto, para la mayonesa de nueces, coloque las yemas de huevo, la mostaza y el vinagre de vino blanco en un procesador de alimentos y mezcle hasta que quede suave. Agregue lentamente el aceite vegetal en una corriente fina y constante mientras el motor todavía está funcionando.", "Cuando todo el aceite vegetal se combine, agregue el aceite de nuez con el motor en funcionamiento. Licuar hasta que la mayonesa se haya emulsionado y luego sazonar con sal, pimienta de cayena y jugo de limón. Agregue las nueces.", "Para la ensalada de col, mezcle la zanahoria, el repollo y la cebolla con un poco de mayonesa.", "Cuando esté listo para servir, sazone la carne de cerdo con el jugo de limón, estragón, sal y pimienta.", "Para servir, separe el pan de pita, coloque una gran cantidad de ensalada de col, agregue el cerdo desmenuzado y la lechuga (si se usa)."], "url": "www_bbc_co_uk_food_recipes_lemon_and_tarragon_51274", "title": "Limón y estragón tiraron de cerdo con pan pitta y mayonesa de nuez", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla", "200 g / 7 oz de azúcar en polvo de oro", "Harina normal de 100 g / 3½ oz", "1 cucharadita de polvo de hornear", "100 g / 3½ oz de almendras molidas", "4 huevos de gallinas camperas", "1 limón, ralladura solamente", "1 cucharadita de hojas de tomillo", "4 cucharadas de azúcar", "2 limones grandes, solo jugo", "½ cucharadita de hojas de tomillo"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Cubra una lata de hogaza de 900 g / 2 lbs con papel para hornear.", "Bata la mantequilla con el azúcar en una batidora hasta que quede pálida y esponjosa. En un tazón separado tamizar juntos la harina y el polvo de hornear y luego mezclar con las almendras.", "Batir ligeramente los huevos y luego doblarlos en la mezcla de mantequilla en dos o tres sesiones, batiéndolos a fondo cada vez. Si la mezcla parece estar a punto de cuajar, agregue un poco de harina.", "Rallar la ralladura del limón y mezclarlo con las hojas de tomillo. Machaca los dos juntos con un mortero, o algún otro peso pesado, y revuelve en la mezcla de pastel.", "Mezcle gradualmente la harina, el polvo de hornear y las almendras.", "Coloque la mezcla de torta en la lata forrada y hornee por 45 minutos (si divide la mezcla en latas más pequeñas, reduzca el tiempo en consecuencia).", "Para el relleno, disuelva el azúcar en el jugo de los limones a fuego moderado y agregue las hojas de tomillo (algunas flores también serían buenas aquí). A medida que la tarta sale del horno, espiga la superficie con un pincho y una cuchara sobre el almíbar.", "Dejar enfriar y servir en rodajas con yogurt espeso."], "url": "www_bbc_co_uk_food_recipes_lemon_and_thyme_cake_15394", "title": "Tarta de limón y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_cake_15394_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de patatas nuevas, fregadas", "3 cucharadas de mayonesa", "1 cucharada de crema fresca", "2 cucharadas de alcaparras para bebés, escurridas", "50 g / 2 oz de pepinillos para bebés, escurridos y en rodajas", "1 limón, cáscara y 2 cucharaditas de jugo", "sal y pimienta negra recién molida", "1 cucharada de perejil de flatleaf fresco picado", "2 filetes de lomo de cerdo x 180g / 6oz, con guarnición de grasa", "sal y pimienta negra recién molida", "1 huevo grande de gallinas camperas", "2 cucharadas de harina normal", "Pan rallado blanco seco grueso de 75g / 2½oz, preferiblemente pan rallado panko japonés", "½ limón, ralladura solamente, finamente rallado", "15g / ½ oz de parmesano, finamente rallado", "1 cucharada colmada de hojas de tomillo fresco picado", "300ml / 10½ fl oz de aceite de girasol", "2 puñados de berros frescos", "1-2 cucharaditas de aceite de oliva virgen extra"], "method": ["Para la ensalada de papas, medio lleno una sartén con agua con sal y llevar a ebullición. Agregue las papas y vuelva a hervir. Cocine por 15-18 minutos, o hasta que esté tierno. Escurrir en un colador y luego enjuagar con agua corriente hasta que esté frío.", "Mezcle la mayonesa, la crema fresca, las alcaparras, los pepinillos y el jugo de limón en un tazón grande hasta que estén bien combinados.", "Corte cada una de las papas en cuatro trozos y agregue el aderezo de mayonesa con la ralladura de limón. Sazonar, al gusto, con sal y pimienta negra recién molida. Espolvorea sobre el perejil.", "Para los escalopes de cerdo, sándwich uno de los filetes de lomo de cerdo entre dos hojas de película adhesiva. Aplanar la carne con un rodillo o mazo de carne con un grosor uniforme de 1 cm / ½ pulg. Retire la película adhesiva y corte la carne aplanada por la mitad a lo largo. Sazonar a ambos lados con sal y pimienta negra recién molida. Repite el proceso con los filetes restantes de lomo de cerdo.", "Batir el huevo en un tazón. Espolvorea la harina en un plato. Mezcle las migas de pan, la ralladura de limón, el parmesano, el tomillo y una buena pizca de sal en un recipiente poco profundo hasta que estén bien combinados.", "Separe cada trozo de carne de cerdo primero en la harina, luego sumérjalo en el huevo batido, luego drague en la mezcla de pan rallado hasta que esté completamente cubierto. Repita el proceso con las piezas restantes de carne de cerdo.", "Caliente el aceite de girasol en una sartén grande hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Agregue dos de los escalopes a la sartén y freír durante 2-3 minutos en cada lado, o hasta que la carne de cerdo esté bien cocida y el revestimiento esté crujiente y dorado. Retire de la sartén con unas pinzas y déjela a un lado para drenar en un plato calentado y forrado con papel de cocina. Mantener caliente Repita el proceso con los otros dos escalopes de cerdo.", "Para servir, divida la ensalada de papas entre cuatro platos para servir. Coloque unas pocas hojas de berros junto a cada porción y rocíe con un poco de aceite de oliva. Coloque un escalope de cerdo al costado."], "url": "www_bbc_co_uk_food_recipes_lemon_and_thyme_pork_15402", "title": "Schnitzel de cerdo con limón y tomillo con ensalada de patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_pork_15402_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 huevos de gallinas camperas", "300 g / 11 oz de azúcar en polvo", "Crema doble 140ml / 5fl oz", "3 limones, solo cáscara", "1½ cucharada de ron oscuro", "1 pizca de sal", "80g / 3oz de mantequilla sin sal, derretida", "240g / 8½oz de harina natural", "½ cucharadita de polvo de hornear", "3 cucharadas de mermelada de albaricoque, calentado en una cacerola pequeña", "1 limón, ralladura y jugo", "150g / 5oz de azúcar glasé"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase ligeramente una lata de pan de 26cm x 9cm x 8cm / 10in x 3½in x 3in y cúbralo con papel antigrasa.", "En un tazón grande, mezcle los huevos, el azúcar, la crema, la ralladura de limón, el ron, la sal y la mantequilla.", "Tamiza la harina y el polvo de hornear en un recipiente aparte y luego bátelo en la mezcla de huevo hasta que tengas un batido suave.", "Vierta la mezcla en la lata preparada y hornee en el horno durante 50-60 minutos, volteando hasta la mitad de la cocción. La torta se cocina cuando una hoja de cuchillo insertada en el centro sale limpia.", "Retire la torta de la lata, coloque en una rejilla de enfriamiento y deje enfriar durante 10 minutos. Esto permitirá que el vapor escape antes de glasear la torta. Deja el horno encendido.", "Cepille la torta con el glaseado de albaricoque calentado y déjela durante cinco minutos mientras prepara el glaseado de limón.", "Para el glaseado de limón, mezcle el jugo de limón, la ralladura y el azúcar glas.", "Caliente la mezcla en una sartén pequeña, o en el microondas, hasta que el azúcar se haya disuelto y tenga un jarabe.", "Cepille el glaseado de limón sobre el pastel y déjelo reposar durante unos minutos.", "Coloque la torta glaseada en el horno sobre una bandeja para hornear, apague el fuego y déjela durante 3-5 minutos para secar el glaseado y volverlo transparente.", "Retire la torta del horno y deje enfriar a temperatura ambiente antes de servir."], "url": "www_bbc_co_uk_food_recipes_lemon_cake_29430", "title": "Bizcocho de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_cake_29430_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla sin sal, más extra para engrasar", "3 huevos de rango medio libres", "2 limones, cáscara y jugo solamente", "200 g / 7 oz de azúcar en polvo", "Crema de 75g / 2½ oz", "Harina normal 150g / 5½ oz", "1 cucharadita de polvo de hornear", "75g / 2½ oz de azúcar glas", "1 limón, solo jugo", "Ruibarbo 300g / 10½oz, cortado en piezas de 2cm / ¾in", "1 cucharada de azúcar en polvo", "1 naranja, solo jugo", "4 limones, ralladura y jugo", "110g / 4oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas, golpeados", "Queso de cabra suave suave 110g / 4oz", "Crema doble 50ml / 2fl oz", "2 cucharadas de azúcar glas", "100g / 3½oz de almendras confitadas", "4 cucharadas de hojas de bálsamo de limón o hojas de albahaca bebé"], "method": ["Para la tarta de limón, precaliente el horno a 180 ° C / 170 ° Fan / Gas 3. Engrase y forre una lata cuadrada de 20 cm / 8 pulgadas.", "Derretir la mantequilla y reservar para enfriar un poco. Coloque los huevos, el jugo de limón y el azúcar en un tazón. Usando un batidor eléctrico, bata hasta que el azúcar se disuelva. Agregue la mantequilla y la crema fresca. Tamice la harina y el polvo de hornear por la parte superior y dóblelos suavemente. Agregue la ralladura de limón y la cuchara en la lata preparada.", "Hornee durante 45-60 minutos, o hasta que estén dorados y se hayan levantado (la torta se dividirá en la parte superior). Coloque el pastel en una rejilla de alambre para que se enfríe durante 10 minutos antes de sacarlo de la lata. Coloque una bandeja o un trozo de papel para hornear debajo del estante.", "Para el glaseado, mezcle el azúcar glas y el jugo de limón en un tazón y luego vierta sobre la torta aún caliente. Retire la bandeja o el papel de debajo de la torta y vierta el exceso sobre la torta. Dejar que se enfríe antes de servir.", "Para el ruibarbo tostado, precaliente el horno a 200C / 180C Fan / Gas 6.", "Coloque el ruibarbo en una sola capa en una lata de asar. Espolvorea sobre el azúcar y rocía sobre el jugo de naranja. Asar durante 8-12 minutos, o hasta que estén tiernas.", "Para la cuajada de limón, coloque un recipiente a prueba de calor sobre una sartén con agua hirviendo a fuego lento (no permita que el recipiente toque el agua). Ponga la ralladura de limón, el jugo, la mantequilla y el azúcar en el bol y bata de vez en cuando hasta que el azúcar se disuelva por completo. Batir los huevos y batir hasta que estén espesos y cocidos. Retirar del fuego y dejar enfriar por completo.", "Para las almendras azucaradas, precaliente el horno a 130 ° C / 110 ° Ventilador / Gas 1 y alinee una bandeja para hornear con papel de hornear.", "Para la crema de queso de cabra, ponga todos los ingredientes en un tazón y mezcle bien.", "Para servir, corte el pastel en cubos o rebanadas pequeñas y acomódelo en platos para servir. Viste el plato con cuajada de limón, ruibarbo asado, crema de queso de cabra, almendras azucaradas y bálsamo de limón o hojas de albahaca bebé."], "url": "www_bbc_co_uk_food_recipes_lemon_cake_served_with_a_72886", "title": "Pastel de limón servido con crema de queso de cabra, cuajada de limón, almendras azucaradas y ruibarbo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechuga de pollo deshuesada y sin hueso de 400 g / 14 oz, cortada en tiras", "2 cucharadas de salsa de soja ligera", "1 cucharada de miel", "2 cucharadas de harina de maíz", "2 limones, cáscara y jugo solamente", "75ml / 2½fl oz de caldo de pollo", "1 cucharadita de aceite de maní", "1 cucharada de jerez seco", "1 chile rojo, finamente picado", "3 dientes de ajo, en rodajas finas", "Jengibre fresco de 2cm / ¾in de la pieza, pelado y rallado fino", "3 cebollas de primavera, en rodajas finas", "Calamares de 300g / 10½ oz, limpiados y cortados en tiras", "1 cucharadita de aceite de sésamo", "1 cucharada de salsa de soja", "1 cucharada de mirin", "2 cucharadas de aceite de cacahuete", "3cm / 1½ en pieza de jengibre fresco, pelado y finamente picado", "2 dientes de ajo, finamente picados", "2 chiles rojos, finamente picados", "Frijoles negros de 40g / 1½ oz, enjuagados, escurridos y toscamente picados", "50-75ml / 2-2½fl oz de caldo de pollo", "2 cucharadas de jerez seco o vino de arroz Shaoxing", "3 cebollas de primavera, en rodajas finas", "2-3 cucharadas de cilantro fresco, aproximadamente picado", "1 cucharada de aceite de maní", "300g / 10½oz de arroz basmati cocido y enfriado", "2 cebollas de primavera, en rodajas", "2 cucharadas de hojas de cilantro, picadas", "2 cucharadas de salsa de soja", "1 cucharadita de aceite de sésamo"], "method": ["Pon el pollo en un bol. Mezcle la salsa de soya, la miel y la harina de maíz juntas en un recipiente aparte y vierta sobre el pollo. Mezcle para cubrir, luego reserve.", "Mezcle la ralladura de limón, el jugo y el caldo de pollo juntos.", "Caliente un wok o sartén hasta que esté caliente y luego agregue el aceite de cacahuete. Agregue el jerez al pollo y revuelva, luego agregue al wok caliente y saltee por 2 minutos hasta que esté sellado. Agregue el chile, el ajo y el jengibre y el caldo de limón y pollo. Llevar a ebullición, revolviendo bien. Reduzca el fuego a fuego lento y cocine por 4-5 minutos hasta que el pollo esté bien cocido y la salsa espesada.", "Para el calamar, mezcle el calamar, el aceite de sésamo, la soja y el mirin en un bol y déjelo a un lado durante 5 minutos.", "Caliente una sartén o wok hasta que esté caliente, agregue el aceite de cacahuete y cuando esté brillante, agregue el jengibre, el ajo y el chile. Revuelva freír durante 2 minutos o hasta que se suavice. Agregue el calamar y los frijoles negros y saltee durante 2-3 minutos a fuego alto. Agregue el caldo de pollo, el jerez, la cebolleta y el cilantro. Revuelva bien y luego cocine a fuego lento durante otros minutos hasta que el calamar esté cocido. Cuchara en un tazón para servir.", "Para el arroz, caliente una sartén o wok hasta que esté caliente. Agregue el aceite de cacahuete y cuando esté brillante, agregue el arroz y saltee durante 1 minuto antes de agregar las cebolletas, el cilantro, la soja y el aceite de sésamo. Revuelva freír durante 2 o 3 minutos, o hasta que esté bien caliente, luego hágalo en un tazón para servir.", "Para servir, agregue las cebolletas al pollo con limón y mezcle bien. Sirve con el calamar y el arroz."], "url": "www_bbc_co_uk_food_recipes_lemon_chicken_and_81996", "title": "Calamar de pollo al limón y frijol negro con arroz salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 claras de huevo", "250 g / 9 oz de azúcar en polvo", "2 limones, en rodajas finas y rebanadas cortadas en cuartos", "350g / 12oz de mantequilla, ablandada, más extra para engrasar", "Azúcar en polvo 350g / 12oz", "4 limones, zested, más jugo de 2 limones", "6 huevos de gallinas camperas", "3 cucharaditas de polvo de hornear", "300g / 10½ oz de harina de auto crianza", "4 limones, ralladura y jugo", "110g / 4oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas, golpeados", "150 g / 5½ oz de mascarpone", "Crema doble de 200 ml / 7 fl oz", "30g / 1oz de azúcar glasé", "½ limón, solo jugo"], "method": ["Para los merengues, precaliente el horno a 65C / 150F / Gas ¼ (o al ajuste más bajo en su horno) y forre una bandeja para hornear con una estera de silicona.", "Coloque las claras de huevo en un procesador de alimentos grande con un accesorio batidor y bata hasta que se formen picos rígidos cuando se quite el batidor.", "Con el motor en marcha, agregue gradualmente el azúcar hasta que tenga un merengue brillante.", "Extiende el merengue muy finamente sobre la bandeja para hornear forrada de silicona con una espátula.", "Hornee en el horno por 3-4 horas, o hasta que se seque completamente (esto tomará menos tiempo si la temperatura de su horno es más alta que la recomendada).", "Retire los fragmentos del merengue cocido de la estera de silicona con una espátula y déjelos a un lado.", "Para las rodajas de limón, precaliente el horno a 65C / 150F / Gas ¼ (o hasta el ajuste más bajo en su horno) y forre una bandeja para hornear con una estera de silicona o pergamino para hornear.", "Coloque las rodajas de limón en las bandejas y colóquelas en el horno durante aproximadamente tres horas o hasta que se sequen.", "Para la tarta de limón, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata cuadrada de 20 cm / 8 pulgadas.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Agregue la ralladura de limón y el jugo.", "Lentamente golpee los huevos, uno a la vez, hasta que la mezcla esté bien combinada.", "Tamiza el polvo de hornear y la harina para untar en un tazón y dóblala en la mezcla para pastel.", "Vierta la masa de la torta en la lata y hornee durante 25-30 minutos o hasta que se levante y se dore. Retire del horno y deje enfriar por 10 minutos. Pase un cuchillo de hoja redonda alrededor del borde interior de la lata para aflojar la torta. Retire la torta de la lata y déjela enfriar por completo en una rejilla.", "Para la cuajada de limón, coloque la ralladura de limón, el jugo, la mantequilla y el azúcar en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. (No permita que el recipiente toque el agua).", "Batir de vez en cuando hasta que el azúcar esté completamente disuelto, luego batir en los huevos y batir hasta que espese y se cueza a través.", "Retirar del fuego y dejar enfriar por completo.", "Para la crema de limón, coloca el mascarpone en un bol y bate para suavizar.", "Vierta la crema doble, el azúcar glas y el jugo de limón.", "Batir hasta que la mezcla forme picos suaves cuando se quite la batidora.", "Doble la crema de limón en la crema de limón.", "Sirva rebanadas del pastel con una cucharada de crema de limón y decore con fragmentos de merengue y un par de rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_cake_with_lemon_56875", "title": "Tarta de limón con crema de limón, merengue y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 450ml / 16fl oz", "50ml / 2fl oz de jugo de limón", "1 limón, ralladura solamente", "5 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "2 higos, descuartizados", "1 cucharadita de azúcar en polvo", "2 cucharadas de agua de rosas", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de pistachos"], "method": ["Para la crème brûlée, precalentar el horno a 150C / 300F / Gas 2.", "Mezcle la crema, el jugo de limón y la ralladura de limón en una cacerola y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10 minutos, batiendo continuamente. Sáquelo del fuego y apártelo.", "En un recipiente resistente al calor, mezcle los huevos y el azúcar hasta que estén livianos y espumosos.", "Agregue la crema hervida a los huevos y mezcle bien.", "Vierta la mezcla en moldes individuales colocados en una lata de asar. Cubra la base de la lata con agua para hacer un baño María. Coloque en el horno durante aproximadamente 30 minutos, o hasta que estén colocados en los bordes, pero aún tambaleantes en el centro. Retirar del horno y reservar para enfriar.", "Para los higos, precaliente el horno a 160 ° C / 325 ° F / Gas 3. Coloque los higos en una bandeja para hornear y espolvoréelos con azúcar y agua de rosas. Hornea los higos por seis minutos.", "Para los quebradizos, forre una bandeja para hornear con papel resistente a la grasa. Coloque el azúcar en una cacerola a fuego lento. Una vez que el azúcar se haya derretido por completo, agregue las nueces. Vierta la mezcla en la bandeja preparada y deje enfriar.", "Cuando se establece, romper los quebradizos en fragmentos.", "Para la crème brûlée, cubra las partes superiores con una capa uniforme de azúcar impalpable y caramelice utilizando un soplete de chef.", "Sirve la crème brûlée con los higos y quebradiza."], "url": "www_bbc_co_uk_food_recipes_lemon_crme_brle_21806", "title": "Lemon crème brûlée, higos marinados y pistacho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 limones, zumos y jugos no encerados", "200 g / 7 oz de azúcar en polvo sin refinar", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos", "3 huevos de gallinas camperas, más 1 yema de huevo de gallinas camperas"], "method": ["Coloque la ralladura de limón y el jugo, el azúcar y la mantequilla en un recipiente resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del recipiente. Revuelva la mezcla de vez en cuando hasta que toda la mantequilla se haya derretido.", "Batir ligeramente los huevos y la yema de huevo y mezclarlos en la mezcla de limón. Batir hasta que todos los ingredientes estén bien combinados, luego dejar cocinar durante 10-13 minutos, revolviendo de vez en cuando, hasta que la mezcla esté cremosa y lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Retire la cuajada de limón del fuego y déjela enfriar, revolviendo ocasionalmente a medida que se enfría. Una vez que se haya enfriado, vierta la crema de limón en frascos esterilizados y selle. Guarde en el refrigerador hasta que esté listo para usar."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_68499", "title": "Cuajada de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace un frasco de 500 g / 1 lb 2 oz (grande) o dos frascos de 250 g / 9 oz (pequeños)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_68499_16x9.jpg", "isVegetarian": true, "recommendations": 0}]