[{"ingredients": ["Papas de 300g / 10½oz, cocidas y cortadas en cubos", "300g / 10½oz de queso fresco cuajado", "150g / 5oz de queso Lancashire maduro", "1 cebolla, finamente picada y frita con un poco de aceite hasta que esté suave", "sal y pimienta negra recién molida", "3 paquetes (6 hojas grandes) de hojaldre listo para usar", "1 huevo de gallinas camperas, batido, para lavar huevos", "mantequilla, para engrasar", "200g / 7oz de mantequilla sin sal", "2 cucharadas de albahaca fresca picada", "variedad de verduras de temporada (zanahoria, espárragos, guisantes de nieve, espinacas)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Combine la papa, el queso cuajado, el queso Lancashire y la cebolla frita en un tazón, y sazone bien con sal y pimienta negra recién molida.", "Recorta 12 círculos de 15 cm en la masa de hojaldre.", "Divida la mezcla de queso, patata y cebolla por igual entre los centros de seis de los círculos de repostería, dejando un borde limpio alrededor de cada círculo.", "Cepille alrededor del borde de cada círculo de repostería con la colada de huevo y coloque otro círculo de repostería en la parte superior.", "Presione hacia abajo alrededor de los bordes para crear un sello prensado y cepille todo con un lavado de huevos.", "Coloque en una bandeja para hornear engrasada y transfiera al horno para hornear por 20 minutos, hasta que esté crujiente y dorado.", "Para las verduras con mantequilla y albahaca, coloque la mantequilla y la albahaca en un procesador de alimentos y mezcle para combinar.", "Hierva o hierva las verduras hasta que estén tiernas, luego coloque en un recipiente.", "Agregue la mantequilla de albahaca y mezcle para derretir y cubrir las verduras.", "Para servir, coloque una pastosa en cada uno de los seis platos y sirva una cucharada de verduras al lado."], "url": "www_bbc_co_uk_food_recipes_cheeseonionandpotato_86543", "title": "Pasteles de queso, cebolla y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "10g / ½oz de mantequilla sin sal", "30g / 1oz de queso cheddar, preferiblemente queso Montgomery", "1 jamón rebanado grueso, finamente picado", "sal y pimienta negra recién molida"], "method": ["Batir suavemente los huevos juntos en un tazón y condimentar, al gusto, con sal y pimienta.", "Calentar la mantequilla en una sartén hasta espumar. Vierta los huevos y cocine por unos segundos, hasta que la parte inferior de la tortilla esté ligeramente colocada. Empuje las partes establecidas de la tortilla en el centro crudo de la tortilla. Cocine de nuevo, hasta que la tortilla se haya establecido más, luego empuje esas partes en el centro de la tortilla de nuevo. Repite el proceso hasta que los huevos se hayan puesto pero la tortilla todavía está suave en el centro.", "Coloque el queso y las tres cuartas partes del jamón en el centro de la tortilla y cocine hasta que el queso se haya derretido.", "Aumente el fuego a alto y cocine la tortilla por otros 30 segundos o hasta que se dore en la parte inferior.", "Dobla la tortilla a la mitad, luego retira la sartén del fuego e inclínala ligeramente para mover la tortilla hasta el borde de la sartén. Deslice la tortilla en un plato para servir, luego déle forma a un rollo limpio. Espolvorea sobre el jamón restante."], "url": "www_bbc_co_uk_food_recipes_cheeseomelette_80621", "title": "Tortilla de queso y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseomelette_80621_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ limón, solo jugo", "2 cucharadas de perejil fresco finamente picado", "1 cucharada de mostaza integral", "4 rábanos rallados", "1 cabeza de achicoria, triturada", "3 rebanadas de pan blanco cortado grueso, tostado", "Queso emmental 75g / 2¾oz, rallado", "3 rebanadas de pastrami", "3 rebanadas de encurtidos", "sal y pimienta negra recién molida"], "method": ["Para hacer la ensalada, coloque el aceite, el jugo de limón, el perejil fresco, la mostaza y el rábano rallado en un tazón grande y mezcle.", "Agregue la achicoria, mezcle para cubrir y sazone, al gusto, con sal y pimienta negra recién molida.", "Para hacer el queso sobre la tostada, coloque las tostadas en una bandeja pequeña para hornear. Coloque una capa de queso emmental, una capa de pastrami y una capa de cornichons en las tostadas, sazone con sal y pimienta negra recién molida y colóquela debajo de la parrilla. Cocine por tres minutos, hasta que el emmental se haya derretido.", "Para servir, coloque los tostados en un plato grande con la ensalada junto a la cuchara."], "url": "www_bbc_co_uk_food_recipes_cheeseontoastwithchi_81595", "title": "Queso en pan tostado con ensalada de achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, picada", "2 ciruelas, piedras removidas, toscamente picadas", "1 naranja, jugo y ralladura", "1 x 190g / 7oz jar de salsa de arándano listo para usar", "1 limón, solo jugo", "Queso azul Shropshire 100 g / 3½ oz, rallado", "1 cucharada de mostaza integral", "1 yema de huevo de gallinas camperas", "2 rebanadas gruesas de pan casero"], "method": ["Para la salsa picante, caliente el aceite en una sartén. Agregue la cebolla y fría por unos minutos hasta que se suavice, pero no se coloree.", "Agregue los ingredientes restantes de chutney y cocine a fuego lento durante 5-6 minutos hasta que las ciruelas estén suaves y la salsa picante se haya reducido a una consistencia espesa.", "Deje que se enfríe mientras prepara el queso sobre la tostada.", "Para el queso sobre pan tostado, precaliente la parrilla a caliente. Mezcle el queso, la mostaza y la yema de huevo en un tazón pequeño. Extiende la mezcla sobre las rebanadas de pan.", "Coloque en una bandeja para hornear y cocine debajo de la parrilla durante 4-5 minutos hasta que el queso se haya derretido y esté dorado.", "Cortar la tostada por la mitad y colocar en un plato. Sirva con la salsa picante de arándano y ciruela."], "url": "www_bbc_co_uk_food_recipes_cheeseontoastwithcra_87770", "title": "Queso en pan tostado con salsa picante de arándano y ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de crema doble", "1 yema de huevo de gallinas camperas", "Cheddar de 55 g / 2 oz, rallado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo, picado", "6 tomates cherry, cortados a la mitad, más uno adicional para decorar", "4-5 nueces en vinagre, escurridas y picadas", "1 cucharada de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "ramita de tomillo fresco, solo hojas", "2 rebanadas de pan rústico", "1 cucharada de aceite de oliva", "ramita perifollo fresco, para servir"], "method": ["Para la salsa de queso, coloque la crema en una sartén pequeña y deje que hierva. Retire del fuego, agregue la yema de huevo y el queso cheddar rallado y revuelva bien para combinar y derretir el queso. Sazonar con sal y pimienta negra recién molida, reservar y mantener caliente.", "Para la salsa picante, caliente el aceite de oliva en una sartén pequeña, agregue todos los ingredientes restantes de chutney y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 3-4 minutos.", "Mientras tanto, para la tostada, caliente una sartén de plancha. Cepille el pan con aceite de oliva y tostadas en ambos lados.", "Coloque una tostada en un plato para servir y vierta la mitad de la salsa de queso. Cubra con la segunda tostada y vierta sobre la salsa restante.", "Para servir, decore con un tomate cherry y una ramita de perifollo y sirva la salsa picante al lado."], "url": "www_bbc_co_uk_food_recipes_cheeseontoastwithtom_85506", "title": "Queso en pan tostado con tomate y nuez chutney", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla picada", "1 cucharada de aceite de oliva", "1 pimiento rojo, picado", "1 diente de ajo, aplastado", "2 cucharaditas de azúcar moreno", "botón de mantequilla", "salpicaduras de vinagre balsámico", "1 cucharada de mostaza integral", "4 cucharadas de yogur griego", "2 rebanadas de pan de ciabatta, tostadas", "Queso Edam de 55 g / 2 oz, rallado"], "method": ["Precalentar la parrilla a su configuración más alta.", "Para la salsa picante, caliente el aceite en una cacerola a fuego medio, coloque la cebolla, el pimiento rojo y el ajo en ella y fríalos durante cinco minutos para que se ablanden.", "Agregue el azúcar moreno a la cacerola y cocine por otros diez minutos, revolviendo regularmente.", "Agregue la mantequilla y el vinagre a la cacerola y cubra, permitiendo que se cocine suavemente durante 5-10 minutos.", "Mientras tanto, para el queso sobre pan tostado, mezcle la mostaza y el yogur griego en un bol, luego extiéndalos sobre las rebanadas de pan ciabatta tostado.", "Espolvoree el queso en la parte superior y colóquelo debajo de la parrilla para cocinar por 2-3 minutos, o hasta que el queso se haya derretido y esté burbujeando.", "Retire el queso sobre la tostada de la parrilla y colóquelo en un plato para servir, con una cucharada de chutney."], "url": "www_bbc_co_uk_food_recipes_cheeseontoastwithred_84011", "title": "Queso en pan tostado con salsa picante de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "400-500ml / 14-18fl oz de leche", "sal y pimienta blanca", "Queso de 80 g / 3 oz, rallado (por ejemplo, queso cheddar maduro, Gouda, gruyère)"], "method": ["Derretir la mantequilla en una olla.", "Agregue la harina y cocine durante 1-2 minutos.", "Retire la sartén del fuego y mezcle gradualmente la leche para obtener una salsa suave. Regrese al fuego y, revolviendo todo el tiempo, lleve a ebullición.", "Cocine a fuego lento durante 8-10 minutos y sazone con sal y pimienta blanca.", "Agregue el queso y permita que se derrita. No vuelva a hervir la salsa o se volverá fibrosa."], "url": "www_bbc_co_uk_food_recipes_cheesesauce_1299", "title": "Salsa de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesesauce_1299_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de harina de levante", "pizca de sal", "55 g / 2 oz de mantequilla", "25 g / 1 oz de queso cheddar maduro, rallado", "150ml / 5fl de leche en oz"], "method": ["Caliente el horno a 220C / 425F / Gas 7. Engrase ligeramente una bandeja para hornear.", "Mezcle la harina y la sal y frote la mantequilla.", "Agregue el queso y luego la leche para obtener una masa suave.", "Encienda una superficie de trabajo enharinada y amasar muy ligeramente. Pat a una ronda de 2 cm / ¾ de espesor. Use un cortador de 5 cm / 2 in para sellar rondas y colocar en la bandeja para hornear. Amasar ligeramente el resto de la masa y sellar más bollos para usarlo todo.", "Cepille la parte superior de los bollos con un poco de leche. Hornea de 12 a 15 minutos hasta que esté bien dorado. Dejar enfriar sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_cheesescones_1287", "title": "Bollos de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8-12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesescones_1287_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla", "55 g / 2 oz de harina", "¼ litro de leche", "Leicester rojo de 55 g / 2 oz", "2 huevos de gallinas camperas, separados", "salpicaduras doble crema"], "method": ["Caliente el horno a 220C / 425F / Gas 7.", "En una sartén pequeña, derrita la mantequilla y la harina para hacer un roux y cocínelos durante un minuto.", "Agregue la leche, el queso, las yemas de huevo y la crema doble. Cocine hasta que quede suave, revolviendo continuamente. Dejar enfriar un poco.", "Batir las claras de huevo a los picos rígidos y doblar suavemente en la mezcla de queso.", "Verter en una sartén pequeña y hornear en el horno durante 8-10 minutos.", "Servir en la sartén"], "url": "www_bbc_co_uk_food_recipes_cheesesouffle_75766", "title": "Soufflé de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80g / 3oz de pan blanco seco", "125 / 4oz de mantequilla", "125g / 4oz de harina común", "600 ml / 1 litro de leche", "6 huevos, yemas y blancos separados", "Cheddar maduro 180g / 6oz, rallado", "1 cucharadita de mostaza de grano", "2,5 ml / ½ cucharadita de pimienta de cayena", "sal y pimienta"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase ligeramente seis moldes y cubra el interior con las migas de pan secas.", "Derrita la mantequilla en una cacerola y agregue la harina. Cocine por 2 minutos.", "Fuera del fuego, agregue la leche para obtener una salsa espesa y suave. Regrese al fuego y hierva, revolviendo todo el tiempo. Cocine a fuego lento durante 10 minutos y luego retire del fuego.", "Batir las yemas de huevo, el queso, la mostaza y la pimienta de cayena y sazonar bien.", "Batir las claras de huevo hasta que estén en la etapa de pico suave y doblar en la mezcla de queso con una cuchara de metal grande.", "Divida la mezcla de manera uniforme entre los seis moldes y colóquelos en una bandeja para hornear. Hornee durante 15 minutos hasta que estén bien dorados. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_cheesesouffl_1326", "title": "Soufflé de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Queso cheddar 100 g / 3½ oz, rallado", "Crema doble 50ml / 2fl oz", "2 yemas de huevo de gallinas camperas, batidas", "sal y pimienta negra recién molida", "2 claras de huevo de gallinas camperas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el queso y la crema en una cacerola a fuego medio y revuelva hasta que se derritan. Retire del fuego y deje enfriar por un minuto, luego mezcle las yemas de huevo y sazone con sal y pimienta.", "En un batidor, las claras de huevo hasta formar picos rígidos cuando se quita el batidor.", "Agregue una cucharada de la clara de huevo a la mezcla de queso y revuelva.", "Doble la clara de huevo restante a través de la mezcla de queso, asegurándose de mantener el volumen en los blancos.", "Caliente una sartén pequeña a prueba de horno a fuego medio y vierta la mezcla de soufflé. Transfiera al horno y hornee por ocho minutos, o hasta que se haya levantado y cocinado completamente.", "Sirve el soufflé en la sartén."], "url": "www_bbc_co_uk_food_recipes_cheesesouffle_84291", "title": "Soufflé de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de alforfón 85g / 3oz", "1 cucharadita de levadura en polvo (sin gluten, si es necesario)", "sal y pimienta negra recién molida", "150ml / 5fl oz de leche entera", "1 cucharadita de mostaza en polvo", "Queso cheddar de 70 g / 2½ oz, rallado", "pequeño puñado de cebolletas frescas picadas", "2 claras de huevo de gallinas camperas, preferiblemente orgánicas", "pizca de sal", "botón de mantequilla sin sal", "4 huevos orgánicos o de rango libre (más 2 yemas de huevo de gallinas camperas)", "sal marina y pimienta negra recién molida", "botón de mantequilla sin sal", "2 cucharadas de cebolletas frescas picadas", "Salmón ahumado 250 g / 9 oz", "1 limón, cortado en cuñas"], "method": ["Para los blinis, mezcle la harina de trigo sarraceno, el polvo de hornear, una pizca de sal y pimienta negra recién molida y la leche para hacer un batido suave.", "Agregue la mostaza en polvo, el queso cheddar y el cebollino y mezcle hasta que estén bien combinados.", "En un recipiente aparte, bata las claras de huevo con una pizca de sal hasta que se formen picos suaves cuando se quite el batidor.", "Pliega gradualmente las claras de huevo batidas en la mezcla de la mezcla con una cuchara de metal.", "Derrita la mantequilla en una sartén a fuego medio-alto, y cuchara cucharadas grandes de la mezcla en la sartén para hacer tortitas de tamaño mediano, de unos 10 cm de diámetro.", "Freír los blinis, en tandas, durante 2-3 minutos hasta que aparezcan pequeñas burbujas en la superficie y la parte inferior se vea cocida. Voltee el blinis y cocine en el otro lado durante 1-2 minutos o hasta que se dore. Mantener caliente", "Repita hasta que toda la mezcla se haya agotado.", "Para los huevos revueltos, bata los huevos en un tazón y condimenta al gusto con sal y pimienta negra recién molida.", "Derrita la mantequilla en una cacerola pequeña a fuego medio, luego vierta los huevos y revuelva un poco para que los huevos se levanten un poco mientras se ponen. Cocine por 1-2 minutos, luego retire la sartén del fuego y ponga los huevos a un lado para terminar de cocinar durante 1-2 minutos más.", "Para servir, coloque dos blinis en cada uno de los cuatro platos para servir, espolvoree los huevos revueltos y espolvoree sobre el cebollino picado. Coloque el salmón ahumado en un lado y termine con las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_cheesesoufflebuckwhe_93524", "title": "Blinis de trigo sarraceno con huevos revueltos y salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesesoufflebuckwhe_93524_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 150 g / 5½ oz", "1 cucharadita de aceite de oliva, para freír", "sal y pimienta negra recién molida", "½ cebolla, finamente rebanada", "4 champiñones, en rodajas finas", "½ pimiento verde, en rodajas finas", "25g / 1oz de queso semiblando (como salut de puerto, taleggio o brie)", "1 panini roll o demi-baguette, ligeramente tostado"], "method": ["Frote la carne con un poco de aceite, sal y pimienta negra. Caliente una sartén hasta que esté humeante, luego fría el bistec hasta que esté dorado por ambos lados. Reduzca el fuego y cocine, voltee con frecuencia, hasta que esté cocido a su gusto. Deja el bistec a un lado para descansar.", "En la misma sartén, a fuego medio, freír las cebollas rebanadas en un poco más de aceite con una pizca de sal. Revuelva con frecuencia y cocine durante 5 minutos hasta que estén suaves y dorados. Agregue los champiñones y el pimiento verde y fría por otros 5 minutos. El pimiento verde aún debe tener un pequeño mordisco.", "Cortar el filete fino en tiras y amontonar en el rollo o baguette. Cubra con las rodajas de queso y las verduras fritas. Servir con algunas hojas de ensalada o incluso algunas patatas fritas de la vuelta de la esquina."], "url": "www_bbc_co_uk_food_recipes_cheesesteak_sandwich_96445", "title": "Sándwich de queso cheesesteak con cebollas a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesesteak_sandwich_96445_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pechuga de pollo", "55g / 2oz de queso cheddar suave", "1 cucharadita de romero fresco finamente picado", "5 rebanadas de tocino rayado", "25g / 1oz de mantequilla", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "½ cebolla, finamente picada", "1 puerro, finamente cortado", "100ml / 3½ fl oz crema doble", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para el pollo, use un cuchillo afilado para cortar un bolsillo longitudinalmente en la pechuga de pollo. Mezcle el queso y el romero en un tazón, luego coloque la mezcla en el bolsillo de la pechuga de pollo. Envuelva el pollo en las rebanadas de tocino para cubrir y sellar el bolsillo.", "Caliente la mantequilla en una sartén a prueba de horno a fuego alto. Agregue el pollo y fría por 1-2 minutos en cada lado, hasta que el tocino esté dorado.", "Coloque la sartén en el horno y tueste durante 15 minutos o hasta que el pollo esté completamente cocido.", "Mientras tanto, para los puerros, caliente la mantequilla y el aceite en una sartén a fuego medio. Agregue el ajo, la cebolla y el puerro, y saltee durante 2-3 minutos, hasta que estén suaves.", "Agregue la crema doble a la sartén y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque los puerros en un plato para servir y cubra con la pechuga de pollo."], "url": "www_bbc_co_uk_food_recipes_cheesestuffedchicken_84003", "title": "Pollo relleno de queso envuelto en tocino sobre puerros con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "30g / 1oz de queso Emmental rallado", "ramita de tomillo fresco", "sal y pimienta negra recién molida", "1 diente de ajo, aplastado", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "pequeño manojo de hojas de albahaca fresca", "½ aguacate, pelado y piedra removida", "½ chile rojo, sin semillas, finamente picado", "1 lima, solo jugo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Con un cuchillo afilado, corte un bolsillo longitudinalmente en la parte más gruesa del seno. Rellene el bolsillo con el queso y el tomillo fresco y sazone el pecho con sal y pimienta negra recién molida.", "Calentar el aceite de oliva en una sartén a prueba de horno a fuego medio y agregar el ajo picado. Freír por un minuto y luego agregar la pechuga de pollo y freír hasta que estén doradas. Voltee la pechuga y transfiérala al horno para asar durante 10-12 minutos, o hasta que esté cocida.", "Para el aceite de albahaca, coloque el aceite de oliva y las hojas de albahaca fresca en un procesador de alimentos y mezcle hasta que quede suave.", "Para la salsa, corta finamente el aguacate en cubos pequeños y colócalos en un tazón. Espolvorea sobre el chile picado y exprime el jugo de limón.", "Para servir, coloca el pollo en un plato calentado. Agregue una cucharada de la salsa y rocíe el aceite de albahaca fresca alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_cheesestuffedchicken_84252", "title": "Pechuga de pollo rellena de queso con salsa de aguacate y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de lomo de cerdo, aplanado con un mazo de carne o un rodillo", "1 cucharada de aceite de oliva", "50g / 1¾oz de queso Dolcelatte", "1 hoja de puerro larga y ancha, blanqueada", "50g / 1¾oz de queso Dolcelatte", "1 cucharada de aceite de oliva", "100 g / 3½ oz de calabaza, peladas, picadas y hervidas hasta que estén tiernas", "sal y pimienta negra recién molida", "1 cucharadita de cebollín fresco, picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de cerdo, frote la carne de cerdo con el aceite de oliva y sazone con sal y pimienta negra recién molida en ambos lados.", "Extienda el queso a lo largo del lomo de cerdo y enrollelo.", "Envuelva el lomo de cerdo enrollado en la hoja de puerro y coloque en una bandeja para hornear. Transfiera al horno, y tueste por 15 minutos, o hasta que el cerdo esté completamente cocido.", "Para el puré de calabaza, coloque el queso, el aceite y el butternut cocido en un bol. Sazonar con sal y pimienta negra recién molida, luego mezclar.", "Para servir la masa en el centro de un plato de servir, ponga la carne de cerdo encima y espolvoree sobre el cebollino picado."], "url": "www_bbc_co_uk_food_recipes_cheesestuffedporkwit_84314", "title": "Cerdo relleno de queso con puré de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["patata grande, cortada en trozos gruesos y sancochada", "sal marina y pimienta negra recién molida", "5 cucharadas de aceite de oliva", "100ml / 3½fl oz de vino blanco", "ramita de tomillo fresco", "Crema doble 142ml / 5fl oz", "Queso cheddar de 55 g / 2 oz, rallado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para las patatas fritas, coloque las papitas sancochadas en una bandeja para hornear, sazone al gusto, con sal y pimienta negra recién molida y rocíe con el aceite.", "Coloque en el horno y tueste durante 15 minutos, o hasta que estén bien cocidos y dorados.", "Para la salsa, verter el vino en una cacerola a fuego alto y hervir para reducir a la mitad. Agregue el tomillo, la crema y el queso y cocine a fuego lento, revolviendo continuamente, hasta que el queso se haya derretido.", "Para servir, coloque las papas fritas en un recipiente para servir y vierta sobre la salsa de queso."], "url": "www_bbc_co_uk_food_recipes_cheeseychips_84010", "title": "Chips de Queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1 pimiento rojo, tallo y semillas retirados, cortados por la mitad", "50g / 2oz de pollo sobrante cocinado", "2 tomates cherry, picados", "2 hojas de albahaca, desgarradas", "pizca de pimienta negra recién molida", "25 g / 1 oz de mozzarella, picada", "1 cucharada de queso cheddar rallado o parmesano", "guisantes, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja para hornear con papel para hornear. Cepilla todo el pergamino con un poco de aceite.", "Coloque las mitades de pimiento en la bandeja de hornear, corte los lados hacia arriba.", "Divida el pollo cocido por igual entre las mitades de pimiento.", "En un tazón, mezcle los tomates cherry y la albahaca. Sazonar, al gusto, con un poco de pimienta negra recién molida. Vierta la mezcla en las mitades de pimiento.", "Divida la mozzarella por igual entre las dos mitades de pimiento, luego espolvoree sobre el queso cheddar rallado o el parmesano y sazone al gusto con pimienta negra recién molida.", "Hornee los pimientos rellenos en el horno durante 18-20 minutos o hasta que la carne esté completamente cocida. Sirva con guisantes recién hechos."], "url": "www_bbc_co_uk_food_recipes_cheesy_chicken_37685", "title": "Pollo cursi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 rebanadas de pan de ajo con queso congeladas listas para usar", "100g / 3½oz de cebolla picada congelada (o 1 cebolla mediana, finamente picada)", "500 g / 1lb 2 oz de carne picada congelada", "2 cucharadas de harina normal", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "100 ml / 3½ fl oz de vino tinto o agua", "100ml / 3½fl oz de agua recién hervida", "1 cucharadita de hierbas mezcladas secas", "1 hoja de laurel", "1 cubo de caldo de carne", "250 g / 9 oz de calabacines en rodajas congeladas (o 2 calabacines medianos, cortados, rebanados)", "200 g / 7 oz de champiñones en rodajas congeladas (o 200 g / 7 oz de champiñones frescos con copa cerrada, en rodajas)", "sal y pimienta negra recién molida"], "method": ["Desenvuelva las rebanadas de pan de ajo con queso congelado y sepárelas. Póngalos en una tabla de cortar para comenzar a descongelar mientras prepara la mezcla de boloñesa.", "Caliente una cacerola grande, de base pesada y antiadherente a fuego medio. Agregue la cebolla y la carne de vacuno y fría por 6-8 minutos, revolviendo regularmente para romper la carne picada a medida que avanza. Continúe cocinando hasta que la carne ya no esté rosada, luego espolvoree sobre la harina y revuelva bien.", "Agregue los tomates enlatados, el puré de tomate y el vino a la sartén y mezcle bien. Vierta el agua recién hervida y agregue las hierbas mixtas y la hoja de laurel.", "Revuelva en el cubo común, revuelva otra vez, y sazone la mezcla con sal y pimienta. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 8-10 minutos, revolviendo regularmente, hasta que la salsa se espese.", "Agregue el calabacín y los champiñones a la salsa boloñesa, regrese la mezcla a fuego lento y cocine por otros 5 minutos o hasta que se caliente.", "Mientras tanto, precalentar la parrilla a su temperatura más alta.", "Llene a la mitad un plato refractario de 2,5 litros / 4½ pinta para horno con agua caliente y déjelo a un lado durante 5 minutos para calentarlo. Vacía cuidadosamente el agua del plato y luego llénala con la mezcla de salsa boloñesa.", "Corta las rebanadas de pan de ajo descongelado por la mitad horizontalmente para crear dos rebanadas de cada una. Coloque las rebanadas encima de la salsa boloñesa, para cubrir.", "Coloque la tarta de boloñesa de res debajo de la parrilla y a la parrilla hasta que el pan de ajo se haya crujido y tenga un color marrón dorado pálido (aproximadamente 5 minutos). Sirva inmediatamente con judías verdes o una ensalada mixta."], "url": "www_bbc_co_uk_food_recipes_cheesy_garlic_bolognese_35170", "title": "Pastel de carne a la boloñesa de ajo y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesy_garlic_bolognese_35170_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite para engrasar", "100g / 4oz de tomates picados en lata", "pellizcar los copos de chile seco (opcional)", "Queso ricotta 100 g / 4 oz", "pizca de pimienta negra molida", "pequeño puñado de menta fresca", "gran puñado de hojas de espinaca", "1 hoja fresca de lasaña (17 x 22 cm)", "15g / 1oz de queso cheddar rallado"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 210C / 415F / Gas 7. Engrase un plato resistente al horno.", "Coloque los tomates en una taza y agregue una pizca de hojuelas de chile si le gustan las cosas picantes. Revuelva con un tenedor y déjelo a un lado para usarlo más tarde.", "En un tazón, mezcle la ricota y la pimienta negra con un tenedor. Usando tijeras (pregúntele a un adulto que lo ayude), corte las hojas de menta y espinaca en trozos más pequeños y agréguelos al queso en el tazón. Mezcle hasta que esté bien combinado.", "Doble la hoja de lasaña por la mitad, haciendo coincidir los lados cortos. Pase suavemente los dedos sobre el pliegue para ayudar a que la pasta se rompa en dos partes. Extienda la mezcla de queso encima de las dos piezas de lasaña, luego enrolle en tubos, comenzando en el borde corto.", "Vierta suficiente cantidad de la mezcla de tomate y chile picado en la fuente del horno para cubrir el fondo. Coloque los tubos enrollados de lasaña en el plato y vierta sobre el resto de los tomates picados. Cubra con una pizca de queso rallado. Coloque el plato en la bandeja de hornear y pida a un adulto que lo cocine durante 15-20 minutos. Sirve con una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_cheesy_pasta_rolls_35552", "title": "Rollos de pasta caseosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]