[{"ingredients": ["225g / 8oz de mantequilla, ablandada", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "Harina de levante 225g / 8oz", "2 cucharadas de jugo de limón", "1 mora de cilantro", "1 cucharada de azúcar en polvo", "1 cucharada de licor de mora, como crème de mure (opcional)", "250ml / 9fl oz doble o crema batida", "2 cucharadas de azúcar glas", "½ cucharadita de cardamomo molido", "¼ cucharadita de pimienta de Jamaica molida", "¼ cucharadita de canela molida", "¼ cucharadita de maceta de tierra"], "method": ["Precaliente el horno a 180 ° C / 160 ° Fan / Gas 4. Mantequilla y línea 2 x 20 cm / 8 pulgadas emparedados. Con un batidor eléctrico de mano o una batidora de pie, unte la mantequilla y el azúcar hasta que quede muy ligero y esponjoso, debe ser casi mousse. Esto debería tomar unos buenos 5 minutos.", "Agregue los huevos, uno a la vez, con una cucharada de harina, mezcle ligeramente entre cada adición, luego agregue la harina restante. Agregue tanto jugo de limón como sea necesario para darle una consistencia de caída, luego divida la mezcla entre las dos latas.", "Hornee en el horno por entre 20-25 minutos, o hasta que la esponja se haya encogido un poco, ligeramente floja al tacto y ligeramente dorada. Deje que se enfríe en las latas durante al menos 10 minutos, luego colóquelo en una rejilla para enfriar.", "Para el relleno, coloque las moras en un tazón y espolvoree el azúcar impalpable y el licor de mora, si lo está usando. Deje macerar por un tiempo corto; le darán algunos jugos.", "Para la crema especiada, bate la crema en un tazón, luego agrega el azúcar glas y las especias: la crema debe estar justo más allá del pico suave.", "Para ensamblar, apile la crema especiada en una de las esponjas. Cubra con las moras y vierta sobre los jugos. Coloque la esponja restante en la parte superior. Polvo con azúcar glas o azúcar impalpable y servir."], "url": "www_bbc_co_uk_food_recipes_victoria_sponge_36175", "title": "Esponja Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 10-12 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de mantequilla, a temperatura ambiente, más extra para engrasar", "250 g / 9 oz de azúcar en polvo", "pizca de sal", "5 huevos de gallinas camperas", "Harina de 250g / 9oz de aumento automático, más extra para quitar el polvo", "500g / 1lb 2oz de fresas, mondadas y cortadas por la mitad si son grandes", "500g / 1lb de azúcar de mermelada 2 oz", "½ limón, solo jugo", "100g / 3½ oz de azúcar", "Fresas de 150g / 5½oz, tallos dejados en", "400ml / 14fl oz de crema doble, batida", "azúcar en polvo, para quitar el polvo"], "method": ["Para la esponja Victoria, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Engrase y enharme ligeramente dos latas de esponja de fondo suelto de 20 cm / 8 pulgadas, de al menos 4 cm / 1½ pulgadas de profundidad, y forre las bases con pergamino para hornear.", "Batir la mantequilla, el azúcar y una pizca de sal hasta que esté pálida y bien batida. Batir suavemente los huevos en un tazón pequeño y luego agregarlos, poco a poco, a la mezcla de mantequilla con mantequilla. Doble la harina y divida la mezcla entre las dos latas revestidas.", "Hornee durante 25-30 minutos o hasta que estén bien dorados y dorados en la parte superior. Retire del horno y voltee los pasteles en una rejilla de enfriamiento para cables. Despegue el pergamino para hornear y deje que se enfríe por completo.", "Para la compota de fresa, incline las fresas, el azúcar y el jugo de limón en una sartén grande y revuelva a fuego moderado durante 2-3 minutos, o hasta que el azúcar se haya disuelto. Suba el fuego y hiérvalo durante cinco minutos; esto es un \"atasco instantáneo\", por lo que no tiene que verificar el punto de ajuste. Retirar del fuego, verter en una bandeja y reservar para enfriar.", "Para las fresas bañadas en caramelo, caliente el azúcar en una sartén pequeña a fuego moderado hasta que empiece a dar un color caramelo pálido. Retire del fuego y, sosteniendo los tallos, sumerja cuidadosamente las fresas en el caramelo. (PRECAUCIÓN: el azúcar se calienta mucho. Tenga cuidado de no quemarse). Deje enfriar sobre una estera antiadherente o papel resistente a la grasa.", "Para servir, ponga la crema batida en una manga pastelera. Coloque una de las esponjas en un plato o base para pastel y extienda con el mermelada y pinte la crema sobre la mermelada de fresa. Coloque la segunda esponja encima y espolvoree con azúcar glasé. Termina arreglando las fresas bañadas en caramelo encima del pastel."], "url": "www_bbc_co_uk_food_recipes_victoria_sponge_cake_11622", "title": "Bizcocho Victoria con compota de fresa, crema fresca y fresas bañadas en caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de mantequilla, más extra para engrasar", "Azúcar en polvo 350g / 12oz", "4 huevos grandes de gallinas camperas", "½ cucharadita de pasta de vainilla", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "375g / 13oz de fresas maduras, sin cáscara y cortadas en cuartos", "Frambuesas frescas de 300g / 10½ oz", "300 g / 10½ oz de moras frescas", "150 g / 5½ oz de grosellas frescas, tallos eliminados", "Crema doble de 500 ml / 18 fl oz, muy ligeramente batida", "1-2 cucharaditas de azúcar glas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase 2 x 20 cm / 8 pulg. En moldes para pasteles con mantequilla y polvo con harina.", "En un tazón, bata la mantequilla y 200 g / 7 oz del azúcar con un batidor eléctrico hasta que esté pálida y esponjosa.", "Batir los huevos uno a la vez, asegurándose de que cada uno esté completamente incorporado a la mezcla antes de agregar el siguiente. Agregue un poco de harina a la mezcla si comienza a cuajarse.", "Batir la pasta de frijoles de vainilla, luego doblar la harina hasta que se combine.", "Divida la mezcla en partes iguales entre las latas de pastel preparadas y alise las partes superiores.", "Hornee los pasteles en el horno durante 20-25 minutos, o hasta que estén dorados y se hayan levantado. Una brocheta insertada en el centro de los pasteles debe salir limpia; si no lo hace, devuélvalos al horno por otros 5 minutos y vuelva a verificar.", "Coloque los pasteles en una rejilla forrada con una toalla de té y déjelos enfriar.", "Mientras tanto, disuelva el 150g / 5½oz de azúcar en polvo restante en 150 ml / 5 fl oz de agua en una cacerola. Llevar la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 5 minutos, o hasta que se asemeje a un jarabe liviano.", "Mezcle las bayas y las grosellas rojas en un tazón, luego mezcle todo excepto un puñado en el almíbar, hasta que se hayan ablandado pero no se hayan descompuesto y la mezcla se asemeje a una compota. Retirar del fuego y reservar para enfriar.", "Cuando la torta y la compota se hayan enfriado, coloque una torta en un plato para servir. Extienda la compota encima, seguida de la crema batida, luego espolvoree un poco más de compota encima.", "Coloque suavemente la segunda torta sobre el relleno y empolva la superficie con azúcar glas. Adorna el pastel con las bayas restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_victoria_sponge_with_18011", "title": "Esponja Victoria con bayas mezcladas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos grandes de gallinas camperas, separados", "300 g / 10½ oz de azúcar en polvo de oro", "3 cucharaditas de pasta de vainilla", "Harina común de 270g / 9¾oz", "50g / 1¾oz de azúcar glas", "Ruibarbo 400g / 14oz, cortado y toscamente picado", "4 piezas de tallo de jengibre en almíbar, finamente picado", "120 g / 4 oz de azúcar en polvo", "5 hojas de gelatina de hoja", "Ruibarbo 400g / 14oz, cortado y toscamente picado", "250 g / 9 oz de azúcar en polvo", "270ml / 9½fl oz de leche entera", "5 cucharaditas de pasta de vainilla", "800ml / 1⅓ pinta de crema doble", "10 yemas de huevo grandes", "15 hojas de gelatina", "jugo reservado de ruibarbo asado", "colorante de comida roja", "1 bolsa de hielo", "110 g / 4 oz de jengibre fresco, en rodajas finas", "160g / 5¾oz de azúcar granulada dorada", "4-5 hojas de verbena de limón", "5 hojas de gelatina", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de azúcar glasé glaseado", "espray de oro comestible", "bolas de plata comestibles", "2 grandes diamantes comestibles claros, 2cm / ¾in de diámetro (opcional)", "24 diamantes comestibles claros, 1cm / ½ pulgada de diámetro (opcional)"], "method": ["Línea 4 bandejas grandes para hornear y una lata para pasteles con forma de resorte de 23 cm / 9 pulg. Con pergamino para hornear. En una bandeja dibuje un círculo de 15 cm / 6 pulgadas y 2 semicírculos coincidentes, 1 con una cruz unida a la parte superior. Dibuja 4 círculos del trimestre coincidentes. En 2 bandejas para hornear dibuje 35-40 9cm / 3½ en líneas largas espaciadas. Finalmente dibuja un círculo de 23cm / 9in en la bandeja restante.", "Para el savoiardi, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco agregue 200g / 7oz de azúcar en polvo, batiendo todo el tiempo. Batir durante un par de minutos hasta que esté espeso y bien combinado.", "En otro recipiente, bata las yemas de huevo con el azúcar impalpable restante y la pasta de vainilla hasta que esté pálida y se duplique su volumen. Con cuidado dobla la mezcla de yema en las claras de huevo. Tamizar la harina y doblar cuidadosamente.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque la mezcla en una bolsa grande con una boquilla plana de 12 mm / ½ in. Comience a canalizar las formas en las plantillas. Para el tubo circular de 23 cm / 9 pulg, una espiral que comienza desde el exterior hacia el centro por lo que está completamente cubierto de pasta (esto hará que la base). Tipee el contorno de las otras formas y luego canalice al menos 35 dedos, haciendo que algunos de ellos sean un poco más delgados que la mayoría.", "Espolvorea todos los dedos y las formas con azúcar glas y hornea por aproximadamente 20 minutos. Una vez que estén cocidos, retírelos con cuidado de las bandejas y déjelos a un lado para que se enfríen en los bastidores.", "Para la compota, mezcle el ruibarbo, el tallo de jengibre y el azúcar impalpable en una bandeja para hornear.", "Para la crema bavarois, coloca el ruibarbo en una bandeja para hornear y cúbrelo con 150g / 5½ oz de azúcar en polvo. Ase las dos bandejas de ruibarbo durante 15 minutos.", "Coloque la leche, la pasta de vainilla, el azúcar impalpable restante de 100 g / 3½ oz y la mitad de la crema en una cacerola grande y cocine a fuego lento. Mientras tanto, ponga las yemas de huevo en un tazón y bata hasta que duplique su volumen y se ponga pálido. Remoje la gelatina en un plato de agua.", "Vierta la mitad de la mezcla de leche caliente en las yemas de huevo, batiendo todo el tiempo. Regrese toda la mezcla a la sartén y caliéntela suavemente hasta que esté lo suficientemente espesa para cubrir la parte posterior de una cuchara de madera.", "Exprima el exceso de agua de la gelatina, luego agréguela a la crema pastelera y mezcle bien hasta que se disuelva.", "Transfiera el ruibarbo tostado para el bavarois a una licuadora y pulse hasta que quede suave. Coloque el puré en un colador y empuje dentro de la crema pastelera. Revuelva bien y agregue unas gotas de colorante rojo para que se vuelva de un color rosa pálido.", "Batir la crema doble restante de 400 ml / 14 fl oz hasta que se formen picos suaves cuando se quite la batidora. Revuelva suavemente en la crema pastelera. Pon el hielo en un tazón grande de agua fría. Coloque la cacerola en agua helada para reducir la temperatura lo más rápido posible. Una vez que esté frío, póngalo en la nevera hasta que esté casi listo.", "Para la compota, remoje la gelatina en agua fría. Ponga el ruibarbo asado en una cacerola y caliéntelo suavemente. Exprima el exceso de agua de la gelatina y luego agréguela a la sartén. Revuelva hasta que la gelatina se disuelva y luego déjela enfriar.", "Para ensamblar el russe, forre el collar de una lata de resorte de 23cm / 9pulg con pergamino para hornear. Coloque el círculo grande de savoiardi en un plato de servir y coloque el collar en la parte superior. Recorta un extremo de los dedos savoiardi para que tengan la misma longitud.", "Haga un almíbar calentando suavemente el azúcar impalpable en 50 ml / 2 fl oz de agua. Mantenga el calentamiento hasta que el azúcar se disuelva.", "Sumerja cada lado de los dedos savoiardi en el jarabe. Coloque los dedos de corte hacia abajo alrededor del borde de la lata springform. Deben estar bien apretados para que permanezcan erguidos sin apoyo. Vierta la mitad de la compota en el fondo de la lata y colóquela en la nevera hasta que la coloque (alternativamente, congélela durante 30 minutos para acelerar el proceso).", "Para ensamblar la corona que se encuentra encima del russe terminado. Mezcle el azúcar glas de azúcar con un chorrito de agua para hacer una pasta espesa. Usa esta pasta para 'pegar' el savoiardi restante. Primero, junte los cuartos de los círculos, espalda con espalda, luego pegue los dos semicírculos juntos de la misma manera (con la cruz en la parte superior). Permitir establecer", "Cuando esté listo, use el círculo como la base de la corona y balancee el semicírculo en la parte superior con los dos cuartos de círculo apuntalados hacia arriba: recorte las partes superior e inferior de los semicírculos y cuartos de circunferencia si es necesario. Use la formación de hielo para \"pegar\" las piezas en su lugar y deje que se asienten. Cubra la pasta con film transparente.", "Cuando esté listo, rocíe la corona con spray de oro comestible. Pase una línea delgada de fondant a lo largo de las costuras, los semicírculos y cuartos de círculos y la parte superior con bolas de plata.", "Cuando la crema bavarois esté casi lista, vierta la mitad encima de la compota (en el anillo savoiardi los dedos) y colóquela en el refrigerador o congelador hasta que esté completamente preparada.", "Para la gelatina de jengibre, coloque el jengibre en una sartén con 400 ml / 14 fl oz de agua y el azúcar. Hierva durante aproximadamente 5 minutos, luego retire del fuego y agregue la hierba luisa. Dejar enfriar un poco.", "Remoje la gelatina en un recipiente con agua fría durante aproximadamente 5 minutos. Pasa el jarabe de jengibre por un colador fino. Exprima el exceso de humedad de la gelatina y luego agregue al jarabe de jengibre. Enfríe hasta que sea necesario.", "Una vez que la capa de natillas se establece, coloque la compota restante en la parte superior y enfríe de nuevo hasta que se establezca.", "Cuando se haya preparado la compota, ponga dos tercios de la crema bavarois restante en la parte superior y deje enfriar para que se asiente.", "Tome la crema de bavarois reservada y agregue una pequeña cantidad de colorante rojo para alimentos. Póngalo en una manga pastelera equipada con una boquilla estrella pequeña y pinte un patrón en la parte superior de la crema pastelera. Relajarse para establecer", "Cuando la gelatina de jengibre esté semi fijada, viértala sobre la capa de crema pastelera. Suavemente alisa la superficie.", "Para decorar la corona, pegue los 2 \"diamantes\" grandes en el centro de cada lado de la cruz usando la formación de hielo real para pegarlos en su lugar. Luego usa pequeños diamantes para decorar aún más. Coloque el russe en un plato para servir y quite el collar de muelles. Coloque la corona en la parte superior.", "Ponga la crema bavarois restante en una manga pastelera con boquilla estrella y estrellas de tubo alrededor de la base de los dedos savoiardi."], "url": "www_bbc_co_uk_food_recipes_victorias_crown_99544", "title": "Corona de Victoria", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de mantequilla sin sal, más extra para engrasar", "250 g / 9 oz de azúcar en polvo de oro", "4 huevos de gallinas camperas", "1 cucharadita de extracto de vainilla", "Harina de auto aumento 250g / 9 oz", "250 g / 9 oz de azúcar glas", "125g / 4oz de mantequilla sin sal ablandada", "2 cucharaditas de agua caliente", "1 cucharadita de canela molida", "250 g / 9 oz de buena mermelada de frambuesa", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para la torta, engrase dos moldes para pasteles en forma de resorte de 23cm / 9 pulgadas y alinee con el pergamino para hornear.", "Batir la mantequilla y el azúcar en un recipiente, con un batidor eléctrico, hasta que esté suave y cremoso durante unos cinco minutos (la mezcla debe ser casi de color blanco).", "Agregue los huevos, uno a la vez, batiendo constantemente hasta que estén completamente combinados antes de agregar el próximo huevo. Si la mezcla comienza a cuajar, puedes rescatarla rociando una cucharada más o menos de la harina.", "Agregue el extracto de vainilla y doble la harina.", "Divida la mezcla entre las dos latas de pastel y coloque en el horno para hornear durante 25-30 minutos, o hasta que esté completamente cocido. Pruebe que la torta esté cocinada insertando un pincho de metal en el centro de la torta. Si sale limpio, el pastel está cocido.", "Retire del horno y deje enfriar durante cinco minutos, luego retire los pasteles de las latas y déjelos enfriar en una rejilla de alambre.", "Mientras tanto, para la crema de mantequilla, coloque el azúcar glas, la mantequilla ablandada y el agua caliente en un tazón limpio. Mezcle bien hasta que esté completamente mezclado y cremoso.", "Agregue la canela y mezcle bien.", "Para servir, recorte la parte superior de uno de los pasteles para hacer una superficie nivelada.", "Extiende la mermelada de frambuesa sobre la superficie nivelada de la torta y luego cubre el atasco con una capa de crema de mantequilla.", "Coloque la segunda torta en la parte superior y presione ligeramente hacia abajo.", "Espolvorea la parte superior del pastel con azúcar glas y sirve en rebanadas generosas."], "url": "www_bbc_co_uk_food_recipes_victoriasandwich_89617", "title": "Esponja Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla o margarina, ablandadas a temperatura ambiente", "225 g / 8 oz de azúcar en polvo", "4 huevos medianos de granja", "2 cucharaditas de extracto de vainilla", "225 g / 8 oz de harina de levante", "leche, para aflojar", "Crema doble de 200 ml / 7 fl oz", "250 g / 9oz de bayas mezcladas", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase y alinee 2 latas de pastel de 18cm / 7 pulgadas con papel de hornear.", "Bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos y esponjosos.", "Agregue los huevos, poco a poco, e incorpore el extracto de vainilla.", "Doble la harina con una cuchara grande de metal, agregue un poco de leche adicional si es necesario, para crear una masa con una consistencia suave.", "Divida la mezcla entre las latas de la torta y extiéndala suavemente con una espátula.", "Hornee durante 20-25 minutos, o hasta que estén doradas en la parte superior y un pincho insertado en el centro salga limpio.", "Retire del horno y deje a un lado durante 5 minutos, luego retire de la lata y retire el papel. Coloque sobre una rejilla de alambre.", "Batir la crema con un batidor o batidora eléctrica de mano hasta que forme picos suaves cuando se quite la batidora.", "Sandwich los pasteles juntos la crema batida y las bayas. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_victoriasponge_13555", "title": "Esponja Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriasponge_13555_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["220 g / 8 oz de azúcar en polvo", "220g / 8oz de mantequilla, más extra para engrasar", "4 huevos de gallinas camperas, golpeados", "Harina self-raising de 220g / 8oz", "1 cucharadita de extracto de vainilla", "4 cucharadas de mermelada de fresa o frambuesa", "600ml / 1 pinta 2 fl oz crema doble, batida", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Engrase y forme dos moldes para pasteles de 23cm / 9 pulgadas.", "Batir el azúcar y la mantequilla juntos en un bol hasta que estén pálidos y cremosos, luego agregar los huevos, alternando con una cucharada de harina. Doble suavemente el resto de la harina y el extracto de vainilla, luego divídalo en partes iguales entre las dos latas de pastel.", "Hornee en el horno durante 25-30 minutos, o hasta que esté cocido y ligeramente dorado. Retirar del horno y colocar en una rejilla para enfriar.", "Cuando esté frío, unte un pastel con mermelada y crema batida doble, luego coloque el otro pastel encima. Polvo con azúcar glas y servir en rodajas."], "url": "www_bbc_co_uk_food_recipes_victoriaspongewithfr_89029", "title": "Esponja Victoria con crema fresca y mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["botón de mantequilla, derretido", "225g / 8oz de mantequilla, ablandada", "225 g / 8 oz de azúcar en polvo", "4 huevos grandes de gallinas camperas", "225g / 8oz de harina de auto crianza, tamizada (es posible que necesite un poco más)", "6 cucharadas de mermelada de fresa de buena calidad", "300ml / 10½ fl oz crema doble, ligeramente azotada", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calienta suavemente la perilla de mantequilla en una sartén y cepilla dos moldes para pasteles de 6in-7in / 15cm-17.5cm con la mantequilla derretida. Alinee la parte inferior de las dos latas con un círculo de papel resistente a la grasa.", "En un tazón grande, unte la mantequilla y el azúcar hasta que estén pálidos y cremosos, usando un batidor eléctrico o una cuchara de madera. Batir bien para obtener gran cantidad de aire en la mezcla (esto debería tomar un par de minutos).", "Golpe en los huevos uno a la vez. Agregue una cucharada de harina si la mezcla se cuaja.", "Doble la harina con una cuchara grande de metal. Tenga cuidado de no mezclarlo en exceso.", "Vierta la mezcla por igual entre las dos latas de pastel y nivele la parte superior con una espátula. Haga una ligera inmersión en el centro con la punta de la espátula si no quiere que estén apuntando en el medio.", "Coloque en el horno y hornee por unos 20 minutos, o hasta que las tortas vuelvan hacia atrás cuando se presionan suavemente con un dedo y son de color dorado pálido.", "Retirar del horno y sacarlos de las latas después de unos 5-10 minutos. Colóquelos en una rejilla de alambre para que se enfríen por completo (durante aproximadamente media hora).", "Extienda la esponja con el mermelada y la crema batida, luego siéntelos cuidadosamente.", "Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_victoriaspongewithst_90309", "title": "Esponja Victoria con mermelada de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriaspongewithst_90309_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de tocino", "1.25kg / 2lb 12oz cebollas, en rodajas", "2 dientes de ajo, rallados o finamente picados", "1 cucharada de puré de tomate", "2 cucharadas de pimentón dulce", "1½ cucharada de pimentón picante, al gusto", "½ cucharadita de semillas de alcaravea, trituradas en mortero", "1 cucharadita de azúcar moreno", "1½ cucharadita de sal", "12 vueltas del molino de pimienta negro", "2 cucharaditas de vinagre de sidra", "1.5kg / 3lb 5 oz espinilla de carne de res cortada en trozos de 3cm / 1in", "1 cucharada de perejil plano de hojas picadas"], "method": ["Caliente la manteca de cerdo en una olla grande y fría las cebollas hasta que estén doradas. Agregue el ajo, cocine por un minuto, luego agregue el puré de tomate, paprikas, semillas de alcaravea trituradas, azúcar, sal, pimienta y vinagre y cubra con 1 litro / 1¾ pintas de agua.", "Llevar a ebullición, luego agregue la carne. Baje a fuego lento y cocine durante 2 horas y media. Compruebe la sartén con bastante frecuencia y revuelva, agregando más agua para cubrir la carne si es necesario. Compruebe la ternura de la carne, si no es tierna agregue un poco más de agua y cocine por un poco más de tiempo. Retire la carne cuando haya terminado y, si es necesario, continúe cocinando el líquido para espesar la salsa.", "Servir espolvoreado con un poco de perejil picado con papas nuevas, spatzle o pan de centeno oscuro."], "url": "www_bbc_co_uk_food_recipes_viennese_gulasch_96419", "title": "Goulash de Viena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_gulasch_96419_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla muy suave", "50g / 2oz de azúcar glasé, más extra para decorar", "Harina normal de 250g / 9oz", "50g / 2 oz de harina de maíz", "½ cucharadita de extracto puro de vainilla", "100 g / 3½ oz de mantequilla suave", "200g / 7oz de azúcar glasé, más ½ cucharadita de polvo", "½ cucharadita de extracto puro de vainilla", "75 g / 3 oz de mermelada de frambuesa sin semillas"], "method": ["Precaliente el horno a 190 ° C / 170 ° C (ventilador) / Gas 5. Cubra una bandeja para hornear con papel antigrasa.", "Coloque la mantequilla, el azúcar glas, la harina común, la harina de maíz y el extracto de vainilla en un procesador de alimentos y mezcle hasta que quede suave. Es posible que necesite raspar la mezcla un par de veces con una espátula de goma.", "Coloque la masa en una bolsa de plástico equipada con una boquilla de estrella grande. Pipetee 16-18 x 6 cm / 2½ en rosetas de la masa, espaciadas bien separadas.", "Hornee en el centro del horno durante 13-15 minutos o hasta que estén pálidas doradas y firmes. Enfríe en la bandeja de hornear durante cinco minutos y luego transfiéralo a un estante de enfriamiento. Repita con la masa restante para hacer 32-36 galletas.", "Para el relleno, coloque la mantequilla en un recipiente y tamice el azúcar glas en la parte superior. Agregue el extracto de vainilla y bata con una cuchara de madera o un batidor eléctrico hasta que quede muy liviano y suave. Ponga la cuchara en una bolsa de plástico limpia con una boquilla de estrella grande. Coloque la mermelada en un recipiente y revuelva hasta que quede suave.", "Coloque un poco de mermelada en el lado plano de 16 de los bizcochos y colóquelo boca abajo sobre la rejilla para enfriar. Pase el glaseado de crema de mantequilla sobre los bizcochos restantes y sándwich con el atasco. Ponga un plato de servir y polvo con azúcar glas tamizada. Servir."], "url": "www_bbc_co_uk_food_recipes_viennese_whirls_78348", "title": "Galletas torbellino vienesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 32-36 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_whirls_78348_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 filetes de grupa o filetes de flanco, alrededor de 200 g cada uno, recortado de cualquier grasa", "1 chile rojo, en rodajas", "2 palitos de limoncillo, magullados y finamente picados", "2 dientes de ajo, finamente picados", "2 cucharadas de salsa de soja oscura", "1 cucharadita de azúcar en polvo", "2 cebollas tiernas, finamente picadas", "1-1½ cucharadita de aceite de sésamo tostado, al gusto", "50-75ml / 2-2½fl oz de vinagre de arroz, al gusto", "25g-50g / 1-2oz de azúcar en polvo, al gusto", "1 palo de limón, cortado y muy finamente picado", "1 diente de ajo, finamente picado", "1 lima, solo jugo", "1 zanahoria, cortada en finas tiras de juliana", "150g / 5½oz de brotes de soja", "1 chile rojo, finamente picado", "50ml / 2fl oz de vinagre de arroz", "aceite sin sabor (como el maní o el aceite de girasol)", "3 ramitas de menta, hojas recogidas y picadas", "½ racimo de cilantro pequeño, hojas y tallos toscamente picados", "2 cabezas de lechuga Little Gem, hojas separadas", "cuñas de lima, para servir"], "method": ["Para el adobo, ponga el bistec en un tazón grande, agregue los ingredientes restantes y mezcle hasta que se cubra uniformemente. Cubra el tazón con película adhesiva y déjelo marinar en la nevera durante al menos dos horas, o durante la noche si es posible.", "Cuando esté listo para preparar la comida, agregue los ingredientes de la salsa de inmersión a una sartén pequeña a fuego medio. Revolver hasta que el azúcar se disuelva. Pruebe y ajuste los sabores según sea necesario, agregue un poco más de azúcar si está demasiado agrio, o más vinagre de arroz o jugo de lima si es demasiado dulce. Dejar de lado.", "Para las envolturas, mezcle las zanahorias, los brotes de soja y el chile en un bol. Vierta sobre el vinagre de arroz, mezcle bien y deje de lado mientras cocina los filetes.", "En una sartén grande de base pesada, caliente una pizca de aceite. Sacude el exceso de adobo de los filetes y cocínalo durante 2-3 minutos en cada lado, dependiendo de su grosor y qué tan raro te gusta tu bistec. Retire y descanse en un plato durante cinco minutos.", "Agregue la menta y el cilantro a la mezcla de zanahoria y mezcle para combinar.", "Para servir, acomode las hojas de Little Gem en un plato de servir. Cortar el filete descansado, vertiendo los jugos de reposo sobre la mezcla de zanahoria. Rellene las hojas de lechuga con cucharadas de la mezcla de zanahoria. Cubra cada hoja con una rebanada de carne y sirva con la salsa para mojar y las rodajas de lima en el costado."], "url": "www_bbc_co_uk_food_recipes_vietnamese_beef_and_57283", "title": "Envolturas vietnamita de carne y lechuga", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vietnamese_beef_and_57283_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal o de coco (es posible que necesite un poco más)", "600g / 1lb 5 oz de vientre de cerdo, piel y grasa eliminado, cortado en trozos bastante pequeños", "4 chalotes, finamente picados", "3 dientes de ajo, finamente picados", "2 tallos de limoncillo, solo tallo interno blanco, finamente picado", "75g / 2¾oz de azúcar de palma o azúcar morena suave y ligera", "Anís de 3 estrellas", "1 cucharadita de polvo chino de cinco especias", "1 cucharada de salsa de pescado", "arroz jazmín al vapor", "3-4 cebollas de primavera, cortadas a la mitad y desmenuzadas longitudinalmente, para adornar", "algunas ramitas de cilantro, para adornar"], "method": ["Caliente el aceite en un wok si el suyo tiene tapa, de lo contrario use una cazuela grande. Agregue la mitad del estofado de cerdo y fríalos durante varios minutos hasta que estén dorados. Retire del wok y agregue el resto de la panceta de cerdo y repita. Retire la carne de cerdo y reserve.", "Si es necesario, agregue un poco más de aceite y luego agregue los chalotes. Freír a fuego medio durante unos minutos hasta que estén ligeramente dorados, luego agregue el ajo y el limoncillo. Sofreir durante otro minuto o dos, luego agregar el azúcar de palma (o azúcar moreno), el anís estrellado y el polvo chino de cinco especias junto con 200 ml / 7 fl oz de agua y la salsa de pescado. Regrese la carne de cerdo al wok.", "Llevar a ebullición, luego baje a fuego lento y cúbralo. Cocine por alrededor de 1,5 horas o hasta que el cerdo esté tierno. Destape, suba ligeramente el fuego y cocine durante 10-15 minutos más para reducir la salsa.", "Servir con arroz jazmín al vapor, adornado con cebolletas y cilantro."], "url": "www_bbc_co_uk_food_recipes_vietnamese_pork_05148", "title": "Cerdo vietnamita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de espinaca fresca", "Filete de filete magro de 175g / 6oz, cortado en rodajas finas de aproximadamente 5 cm (2 in) de largo", "2 chalotes, en rodajas finas", "2 cucharadas de ajo finamente picado", "1 cucharada de salsa de pescado", "pimienta negra recién molida", "1.2 litros / 2 pintas de caldo de pollo casero o buena calidad de compra de acciones", "2 cucharadas de salsa de pescado", "1 cucharada de jugo de limón", "1 cucharadita de azúcar", "1 chile rojo pequeño, fresco, sin semillas y picado"], "method": ["Retire los tallos de la espinaca y lávelos bien.", "Escalde las hojas por unos segundos en una olla grande de agua hirviendo hasta que se marchiten, luego drene bien y revierta en agua fría para evitar cocciones adicionales. Drene nuevamente, exprimiendo el exceso de agua.", "Combine el bistec con las chalotas, el ajo, una cucharada de salsa de pescado y un poco de pimienta negra recién molida, luego reserve. (La sopa se puede preparar de antemano hasta este punto).", "Justo antes de que esté listo para comer, traiga el caldo de pollo a fuego lento en una cacerola y sazone con la salsa de pescado restante, el jugo de limón, el azúcar y el chile.", "Agregue la espinaca blanqueada y agregue la carne y el adobo. Traiga la sopa al punto de cocción lenta, agregue unas pocas moliendas de pimienta negra recién molida al gusto y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_vietnamesebeefandspi_71363", "title": "Sopa vietnamita de ternera y espinaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de azúcar", "Salsa de pescado 50ml / 2oz (nam pla)", "50ml / 2fl oz de jugo de limón", "1-2 chiles pequeños, sin semillas, en rodajas finas", "2 dientes de ajo, triturados hasta formar una pasta con una pizca de sal en un mortero", "2 cucharaditas de jengibre fresco finamente rallado", "Fideos de arroz listos para usar de 125g / 4oz, suavizados colocándolos en un recipiente con agua hirviendo durante cinco minutos, luego enjuagando y escurriendo", "300g / 10½oz de carne de cangrejo cocida (carne marrón y blanca si es posible)", "300g / 10½oz de pepino, sin semillas, picadas", "150g / 5oz de rábanos, rebanados", "75g / 3oz de cacahuetes sin sal, tostados bajo una parrilla caliente hasta que estén dorados, luego cualquier piel frotada, toscamente picada", "2 cucharadas de cilantro fresco picado"], "method": ["Coloque todos los ingredientes para el aderezo en un recipiente y mezcle bien.", "Coloque los fideos escurridos en un tazón limpio grande y agregue el aderezo. Mezcle para cubrir, luego agregue la carne de cangrejo marrón (si se usa), el pepino y los rábanos y mezcle para mezclar de nuevo.", "Para servir, coloque en un plato o tazón de fuente y espolvoree sobre la carne de cangrejo blanca, los cacahuetes tostados y el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_vietnamesecrabsaladw_83679", "title": "Ensalada de cangrejo vietnamita con fideos de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 alitas de pollo", "3 tallos de limoncillo, finamente picados", "60ml / 2fl oz de salsa de ostras", "60ml / 2fl oz de salsa de chile", "2 cucharadas de agua", "2 cucharaditas de miel", "1 pepino, cortado en cintas con un pelador de patatas", "3 zanahorias, cortadas en cintas con un pelador de patatas"], "method": ["Coloque las alitas de pollo en un bol con el lemongrass. Cubra con film transparente y déjelo marinar durante tres horas.", "Batir las salsas de ostras y chile junto con el agua y la miel, y reservarlas.", "Coloque las alitas de pollo en una barbacoa y ase a la parrilla durante cinco minutos por cada lado hasta que estén cocidas.", "Marque las alas con un cuchillo, luego cepille con un poco de la mezcla de salsa de ostras. NB: Es importante no poner la salsa al principio ya que el contenido de azúcar es alto y quemarás las alas.", "Coloque las cintas de pepino y zanahoria en un plato y cubra con las alitas de pollo.", "Sirva con una llovizna de la salsa restante."], "url": "www_bbc_co_uk_food_recipes_vietnamesegrilledchi_74809", "title": "Alas de pollo a la vieira vietnamita", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 5", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papaya verde 110g / 4oz, pelada, sin semillas, en juliana", "4 cebolletas, cortadas, cortadas en juliana", "2 pomelos, pelados, segmentados, toscamente picados", "2 cucharadas de hojas de menta fresca, ralladas", "2 cucharadas de hojas de cilantro fresco picado", "2 cucharadas de hojas de albahaca fresca picada (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "1 cucharada de azúcar de palma", "½ lima, solo jugo", "½ diente de ajo, aplastado hasta formar una pasta con el filo de un cuchillo", "1 cucharadita de jengibre rallado fino", "1 cucharada de nuoc nam (salsa de pescado vietnamita)", "1 chile rojo, finamente picado", "12 vieiras, limpiadas", "1 cucharada de aceite vegetal", "1 cucharada de arroz basmati crudo, tostado en una sartén seca hasta que esté pálido dorado, aplastado", "1 x 20 g / ¾ oz de cucurucho"], "method": ["Para la ensalada de papaya, en un tazón, mezcle la papaya verde, cebollas tiernas, pomelos, menta, cilantro y albahaca santa hasta que estén bien combinados.", "Para el aderezo, muele la palma de azúcar, el jugo de lima, el ajo y el jengibre en un almirez y mortero hasta que formen una pasta suave. Agregue el nuoc nam (salsa de pescado vietnamita) y el chile y revuelva bien para combinar.", "Para las vieiras vietnamitas, cepille las vieiras con aceite vegetal.", "Caliente una sartén a fuego alto hasta que fume, luego agregue las vieiras y cocine sin moverlas durante 20-30 segundos, o hasta que la mitad inferior de cada festón se haya vuelto opaca.", "Gire las vieiras y repita el proceso hasta que las vieiras estén completamente opacas (no cocine en exceso las vieiras o serán masticables). Retire de la sartén y reserve.", "Para servir, agregue el arroz molido tostado a la ensalada, luego rocíe más de la mitad del aderezo. Mezcle hasta que estén bien combinados, luego apile en el centro de tres platos para servir. Coloque cuatro de las vieiras en la parte superior de cada ensalada y adorne con el berro. Cuchara sobre el aderezo restante."], "url": "www_bbc_co_uk_food_recipes_vietnamesescallopswi_91368", "title": "Vieiras de estilo vietnamita con ensalada de papaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz langostinos crudos, pelados y limpios", "50 g / 2 oz de grasa de cerdo (o use tocino rayado)", "100 g / 3½ oz de camarón seco, empapado durante una hora en agua caliente", "Chalote 50g / 2oz, finamente picado", "1 cucharada de salsa de pescado, más extra por inmersión", "½ guindilla, finamente picado, al gusto", "½ cucharadita de pimienta negra recién molida", "10 bastones de caña de azúcar (disponible en algunas tiendas especializadas de Asia y el Caribe)", "semillas de sésamo blanco y negro, para recubrimiento", "aceite de maní, para freír", "hojas de ensalada, para servir"], "method": ["Coloque las gambas y la grasa de cerdo en un procesador de alimentos y mezcle hasta que se pegue.", "Agregue el camarón seco, el chalote, la salsa de pescado, el chile y la pimienta negra a la mezcla y vuelva a mezclar.", "Cortar la caña de azúcar en palos del tamaño de palos de polo. Moje sus manos y moldee una bola de la mezcla alrededor del extremo ancho del bastón. Alisarlo, por lo que parece un polo en forma de huevo. Enrolla la mezcla aproximadamente en las semillas de sésamo.", "Calentar el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír a fuego lento las langostinos en aceite durante unos 5 minutos o hasta que estén coloreados. Si es posible, termínelos sobre un fuego de carbón o una parrilla para que se cocinen bien.", "Sirva en una cama de hojas crujientes de ensalada usando más salsa de pescado como salsa. La caña de azúcar se puede masticar al final para extraer el jugo."], "url": "www_bbc_co_uk_food_recipes_vietnameseprawnsonsu_81503", "title": "Gambas vietnamitas en la caña de azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 x 150 g / 5½ oz de filete de cerdo, cortado en tiras finas", "sal y pimienta negra recién molida", "1 cucharada de semillas de sésamo", "½ cebolla roja picada", "1 cucharada de miel clara", "2 cucharadas de aceite de oliva", "1 cucharada de sidra", "1 cucharada de semillas de sésamo", "1 cucharada de vinagre balsámico", "pizca de chile en polvo", "sal y pimienta negra recién molida", "Queso cheddar 100 g / 3½ oz, rallado", "½ cebolla roja, finamente rebanada", "1 naranja, pelada y segmentada", "puñado de hierbas mezcladas frescas (como perejil, eneldo, cebollín)", "1 lima, cortada en rodajas, para adornar", "2 rebanadas de chapata tostada"], "method": ["Para el cerdo crujiente, caliente el aceite en una sartén a fuego medio-alto. Sazonar las tiras de cerdo en ambos lados con sal y pimienta negra recién molida y freír durante 8-10 minutos.", "Agregue las semillas de sésamo y la cebolla roja y fría por otros cinco minutos. Agregue la miel, revuelva bien y cocine por un minuto, o hasta que el cerdo esté completamente cocido.", "Mientras tanto, para el aderezo, coloque todos los ingredientes del aderezo en un tazón y mezcle bien.", "Para la ensalada, coloque el queso, la cebolla, la naranja y las hierbas en un tazón y mezcle bien. Vierta sobre el aderezo y revuelva para cubrir.", "Para servir, coloque la ensalada en un plato y cubra con la carne de cerdo crujiente. Servir con rodajas de lima y pan ciabatta tostado."], "url": "www_bbc_co_uk_food_recipes_vietnamesestylecrisp_85517", "title": "Ensalada de cítricos y cerdo crujiente de estilo vietnamita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "2 costillas de cerdo", "sal y pimienta negra recién molida", "½ chile rojo, picado", "1 diente de ajo, picado", "150ml / ¼ pinta de caldo de carne caliente", "100g / 3½oz de fideos de huevo secos, cocidos de acuerdo con las instrucciones del paquete", "2 cucharaditas de aceite de sésamo", "puñado de cilantro fresco, picado, para servir"], "method": ["Calienta el aceite en el sarten. Sazonar las costillas de cerdo con sal y pimienta negra recién molida y freír durante 2-3 minutos en cada lado, o hasta que estén ligeramente doradas.", "Agregue el chile y el ajo y sofría por un minuto.", "Agregue el caldo de carne y déjelo hervir. Reduzca el fuego y cocine a fuego lento durante diez minutos, o hasta que el cerdo esté completamente cocido.", "Agregue los fideos cocidos y el aceite de sésamo y revuelva.", "Para servir, vierta la sopa en un recipiente y espolvoree sobre el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_vietnamesestyleporka_86050", "title": "Sopa de fideos y cerdo de estilo vietnamita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal o de maní", "75g / 3oz de cacahuetes crudos", "Hojas de repollo chino de 300g / 10½oz, en rodajas finas", "1 zanahoria, pelada y en juliana", "½ cebolla española, en rodajas finas", "8 tomates cherry grandes, en rodajas", "12 langostinos, pelados, sin nervaduras y cortados a la mitad longitudinalmente", "1 taza de hierbas frescas mezcladas, como hojas de cilantro, hojas de menta, hojas de albahaca tailandesa o hojas de menta vietnamita", "Vinagre de vino de arroz 150ml / ¼pt", "1 cucharada de azúcar en polvo, o al gusto", "1 cucharadita de hojuelas de chile seco, o al gusto"], "method": ["Caliente un poco de aceite vegetal o de maní en una sartén, agregue los cacahuetes y tueste a fuego medio, revolviendo regularmente hasta que estén dorados. Escurrir sobre papel absorbente y enfriar.", "Mueva firmemente las hojas de col juntas, luego corte en rodajas finas y colóquelas en un tazón grande.", "Con una mandolina, si es posible, corta la zanahoria a lo largo, luego con un cuchillo afilado, corta la zanahoria longitudinalmente en juliana.", "Agregue la zanahoria, la cebolla, los tomates, las gambas y las hierbas al repollo.", "Triture groseramente los cacahuetes en un mortero y añada a la ensalada.", "Combina el vinagre, el azúcar y las hojuelas de chile en una olla pequeña, lleva a ebullición y revuelve hasta que el azúcar se disuelva, luego retíralo del fuego y enfríalo a temperatura ambiente.", "Agregue suficiente aderezo para cubrir generosamente la ensalada y mezcle bien para combinar. Sazone al gusto.", "Coloque la ensalada en una fuente y sirva como acompañamiento para el pescado salteado y el arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_vietnamesestyleprawn_12154", "title": "Ensalada de col de gambas al estilo vietnamita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]