[{"ingredients": ["125g / 4½oz de harina natural", "1 huevo de gallinas camperas", "1 cucharadita de mantequilla derretida", "300ml / 10½ fl oz de leche", "mantequilla, para freír", "50 g / 1¾oz de mantequilla sin sal", "1 naranja, ralladura y jugo", "2 naranjas, solo jugo", "1 limón, ralladura y jugo", "3 cucharadas de azúcar en polvo", "2 cucharadas de licor de naranja", "2 cucharadas de aguardiente"], "method": ["Para los crêpes, coloque la harina en un tazón. Agregue el huevo, la mantequilla derretida y la leche y mezcle con una batidora suave. Dejar de lado por lo menos una hora, preferiblemente durante la noche.", "Caliente una sartén hasta que esté medianamente caliente, derrita un poco de mantequilla en la sartén, luego agregue un cucharón de masa y agite para cubrir el fondo de la sartén. Cocine por 1-2 minutos, luego voltee y cocine por un minuto más.", "Deslice el crespón de la sartén y colóquelo en papel resistente a las grasas. Repita con la masa restante, colocando capas de creppes con papel antigrasa sobre la marcha. Los crêpes pueden enfriarse o congelarse en este punto y usarse más tarde.", "Para la salsa, caliente una sartén hasta que esté caliente, agregue la mantequilla, la ralladura de naranja y el jugo, la ralladura de limón y el jugo y el azúcar impalpable.", "Cocine por unos minutos hasta que espese y burbujee, luego retire la sartén del fuego.", "Dobla los crêpes en cuartos y coloca cuidadosamente en la salsa picante. Regrese la sartén al fuego y luego agregue el licor de naranja y el brandy y la llama para quemar el alcohol. (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No deje la bandeja desatendida).", "Cocine por un par de minutos hasta que los crêpes se calienten.", "Para servir, coloca los crêpes en los platos para servir y coloca la salsa sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_crpes_suzette_27204", "title": "Crepes suzette", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de patatas nuevas, cocidas calientes", "1 cucharadita de mostaza integral", "pequeño racimo de perifollo fresco, picado", "55 g / 2 oz de salmón ahumado", "15 g / ¼ onza de mantequilla", "100g / 3½oz de hojas de espinaca baby", "1 huevo de gallina, para cazar furtivamente", "1 cucharada de vinagre de vino blanco", "2 yemas de huevo de gallinas camperas", "3 cucharadas de vinagre de vino blanco", "Mantequilla 110g / 4oz, derretida", "sal y pimienta negra recién molida", "2 cucharaditas de huevas de lumpo"], "method": ["En un tazón limpio, triture las papas con el dorso de una cuchara de madera hasta que se hagan puré.", "Agregue la mostaza y el perifollo y sazone al gusto con sal y pimienta negra recién molida.", "Coloca anillos de 10cm / 4in en un plato y cubre la papa con el salmón ahumado.", "Para la espinaca, derrita suavemente la mantequilla en una sartén a fuego medio, agregue las espinacas y cocine durante 1-2 minutos o hasta que la espinaca se haya marchitado.", "Para el huevo escalfado, ponga a hervir una olla grande de agua y agregue el vinagre de vino blanco. Batir el centro del agua para crear un remolino. Rompe el huevo en el remolino y déjalo reposar suavemente durante cuatro minutos, o hasta que se asiente. Retire con cuidado con una cuchara ranurada.", "Para la salsa holandesa, coloque las yemas de huevo en un procesador de alimentos. Coloque el vinagre en una cacerola a fuego alto y reduzca a una cucharada.", "Agregue el vinagre a las yemas de huevo en el procesador de alimentos y mezcle, mientras vierte gradualmente en la mantequilla derretida con el motor en marcha, para formar una salsa espesa.", "Sazonar con sal y pimienta negra recién molida. Agregue las huevas de lumpo y revuelva.", "Coloque la espinaca en el centro de un plato para servir. Coloque el anillo de los chefs con papa y espinaca en la parte superior, luego retire con cuidado el anillo. Coloque el huevo escalfado en la parte superior y cuchara sobre el hollandaise lummpfish.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crushedpotatoeswithh_84388", "title": "Patatas trituradas con salmón ahumado en caliente, huevo escalfado y holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de patatas nuevas", "sal y pimienta negra recién molida", "½ cucharada de aceite de oliva", "1 cucharada de mantequilla", "½ cucharadita de trufa picada (de un tarro)", "ramita de albahaca fresca, para adornar"], "method": ["Hervir las papas en agua con sal durante 12-15 minutos, o hasta que estén tiernas. Escurrir y sazonar con sal y pimienta negra recién molida.", "Agregue el aceite de oliva y la mantequilla y aplaste ligeramente con un tenedor o un triturador de papas. Agregue la trufa picada.", "Para servir, coloque en un plato de servir con una ramita de albahaca, para adornar."], "url": "www_bbc_co_uk_food_recipes_crushedtrufflepotato_86931", "title": "Patatas trufadas trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de pan blanco fresco", "sal y pimienta negra recién molida", "4 chuletas de cordero", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 cucharada de hojas de menta fresca picadas", "½ limón, solo jugo", "250g / 9oz de papas nuevas, cocinadas, aún calientes", "55 g / 2oz de queso Roquefort, desmenuzado", "pequeño puñado de hojas de menta fresca, picada", "sal y pimienta negra recién molida", "Crema doble 50ml / 2fl oz"], "method": ["Para las chuletas de cordero en costra, coloque las migas de pan, la sal y la pimienta negra recién molida en una mini licuadora y procese hasta que estén bien combinados. Sumerja las chuletas de cordero en el huevo batido y luego revuelva en las migas de pan.", "Calentar el aceite de oliva en una sartén, agregar las chuletas y freír en ambos lados hasta que estén doradas y cocidas. Retire las chuletas de cordero de la sartén y déjelas a un lado para descansar en un lugar cálido.", "Agregue la mantequilla, la menta y el jugo de limón a la sartén y cocine a fuego lento.", "Para las patatas trituradas de Roquefort, coloque las papas calientes cocidas en una cacerola, agregue el Roquefort, la menta, la sal, la pimienta negra recién molida y la crema y aplaste aproximadamente con el dorso de un tenedor.", "Para servir, divida las papas trituradas entre dos platos para servir y cubra con las chuletas de cordero. Vierta la salsa de menta y mantequilla de la sartén y sirva."], "url": "www_bbc_co_uk_food_recipes_crustedlambcutletswi_88338", "title": "Chuletas de cordero en costra con patatas Roquefort trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo, cortada a la mitad para hacer 2 escalopes delgados", "dash aceite de oliva", "55 g / 2 oz de pistachos, conchas eliminadas, picadas", "sal y pimienta negra recién molida", "150 g / 5½oz de guisantes congelados, descongelados", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "½ bulbo de hinojo, finamente cortado", "¼ de pimiento rojo, finamente cortado", "1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco picado"], "method": ["Para el pollo con pistacho con costra, frote el pollo en aceite de oliva, revuelva los pistachos picados y sazone con sal y pimienta negra recién molida. Rocíe con un poco más de aceite de oliva, caliente una sartén a la plancha y cocine el pollo por 3-4 minutos en cada lado, o hasta que esté completamente cocido.", "Para el puré de guisantes, cocine los guisantes en una sartén de agua hirviendo con sal durante 2-3 minutos. Escurrir y volver a la sartén con la mantequilla, sal y pimienta negra recién molida. Procese con una batidora de mano hasta que quede suave, agregando un poco de agua si la mezcla es demasiado espesa.", "Para la ensalada de hinojo, coloque todos los ingredientes de la ensalada en un tazón grande y revuelva bien.", "Para servir, coloque el puré de guisantes en un plato de servir, cubra con el pollo con especias y coloque la ensalada en un lado."], "url": "www_bbc_co_uk_food_recipes_crustedpistachiochic_88352", "title": "Pollo de pistacho con costra de puré de guisantes, ensalada de hinojo y vinagreta de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 4 chuletas de cordero", "sal y pimienta negra recién molida", "55g / 2oz de pan rallado blanco", "2 cucharadas de cebolletas frescas picadas", "2 cucharadas de perejil fresco picado", "85g / 3oz de piñones, tostados", "2 cucharadas de aceite de oliva", "250ml / 9fl oz de vino tinto", "½ cubo de caldo de carne", "1 cucharada de puré de tomate", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "4 zanahorias baby, enteras con tapas", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero, sazone el cordero con sal y pimienta negra recién molida. Caliente una sartén seca a prueba de horno y luego agregue la parrilla de cordero, con la piel hacia abajo. Dorar la carne por todos lados y luego transferirla al horno para cocinar durante 8-10 minutos.", "Mientras tanto, coloque el pan rallado, el cebollín, el perejil, los piñones y el aceite en un procesador de alimentos y pulse hasta que quede suave.", "Retire el cordero del horno y presione la mezcla de la corteza en el exterior de la parrilla. Vuelva al horno por 3-5 minutos, o hasta que la corteza esté dorada y el cordero esté cocido a su gusto.", "Para el jus del vino tinto, caliente el vino en una sartén pequeña a fuego medio. Mezcle en el cubo de caldo de carne y agregue el puré de tomate. Llevar a ebullición y reducir durante 4-5 minutos.", "Retire del fuego, agregue la mantequilla y revuelva para crear una salsa brillante.", "Para las zanahorias a la brasa, caliente una sartén hasta que esté caliente, luego agregue las zanahorias y el aceite y cocínelas durante 8-10 minutos, volteándolas ocasionalmente, hasta que las zanahorias estén tiernas y cocidas.", "Para servir, corte el cordero en chuletas separadas y colóquelas en un plato. Coloca las zanahorias al lado y coloca el jus del vino tinto alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_crustedrackoflambwit_88898", "title": "Rack de cordero con costra de jus de vino tinto y zanahorias baby a la brasa", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Costilla de carne de res de 1,8 kg / 4 lb", "300 g / 10½ onzas de mantequilla", "4 papas grandes, peladas y cortadas en chips de 1cm / ½ pulgadas", "goteo o aceite vegetal, para freír", "3 cucharadas de vinagre de estragón", "½ cucharadita de granos de pimienta entera", "1 chalote de plátano pequeño, finamente picado", "2 yemas de huevo de gallinas camperas", "sal marina y pimienta negra recién molida", "1 manojo pequeño de estragón fresco, solo hojas, finamente picado", "1 manojo de berros frescos, solo hojas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque la côte de boeuf en una bandeja de asar y tueste durante 30-40 minutos, hasta que esté cocido a su gusto.", "Mientras la carne se cocina, prepare las papas fritas.", "Caliente el aceite en una freidora a 140C / 285F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón dorado muy pálido cuando se deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Con cuidado, baje las astillas en el aceite caliente, en tandas, y fría durante 4-5 minutos, o hasta que estén pálidas doradas pero tiernas. Retire del aceite caliente con una espumadera y déjelo a un lado para escurrir sobre papel de cocina.", "Retire la bandeja de aceite del fuego, pero no deseche el aceite.", "Cuando la côte de boeuf esté cocida a su gusto, retírela del horno y déjela reposar durante 5-10 minutos.", "Caliente 50 g / 1¾ oz de la mantequilla en una sartén grande a fuego alto. Cuando la mantequilla esté espumante, agregue la carne y fría por 1 minuto en cada lado, o hasta que se dore por todos lados, cuchareando la mantequilla derretida sobre la carne mientras fríe. Reserve para descansar nuevamente.", "Para la bearnesa, derrita la mantequilla restante en una cacerola a fuego medio. Elimine los sólidos lácteos que se elevan a la superficie, para aclarar la mantequilla.", "Llevar el vinagre a ebullición en una olla separada, no reactiva con los granos de pimienta y chalotas. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 3-4 minutos, o hasta que la mayoría del líquido se haya evaporado, dejando solo aproximadamente 1 cucharada en la sartén.", "Batir las yemas de huevo en un recipiente, luego agregar gradualmente la mantequilla derretida un poco a la vez, batiendo después de cada adición - el objetivo es que la mezcla se emulsione y se espese un poco. Deseche cualquier sólidos lácteos en el fondo de la sartén.", "Cuando toda la mantequilla se haya incorporado a los huevos, espolvoree los chalotes y el líquido que quede en la sartén, mezcle el estragón picado y sazone al gusto con sal y pimienta negra recién molida. Mantener caliente", "Justo antes de servir, devuelva la olla de aceite al calor y al calor a 190 ° C / 375 ° F (una miga de pan chisporroteará y se pondrá marrón oscuro en 1 minuto). Baje las astillas cocidas en el aceite caliente y cocine durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire de la sartén con una cuchara ranurada, déjela a un lado para escurrir sobre papel de cocina, y espolvoree con sal.", "Para servir, esculpe la côte de boeuf en rodajas y divídalas entre los platos de servir. Acumula las patatas al lado, luego termina con una cucharada de bearnesa y decora con las hojas de berros."], "url": "www_bbc_co_uk_food_recipes_cte_de_boeuf_with_93932", "title": "Costilla de ternera con salsa bearnesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 clara de huevo grande", "1 cucharada de agua", "pensamientos frescos, violas o pétalos de rosa", "Azúcar en polvo superfino de 55 g / 2 oz"], "method": ["En un tazón pequeño, mezcle la clara de huevo y el agua. Sujete los pétalos con unas pinzas y cepille cuidadosamente la mezcla de huevos sobre los pétalos, cubriendo ligeramente ambos lados.", "En otro tazón, mezcle los pétalos con el azúcar y transfiéralo a un estante. Permita que los pétalos se sequen al menos 6 horas, más tiempo si es necesario."], "url": "www_bbc_co_uk_food_recipes_crystallisedflowers_4785", "title": "Flores cristalizadas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace flores para 4 porciones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["puñado de hielo", "Ron blanco 50ml / 2fl oz", "1 lima, cortada en cuartos", "cola, para recargar", "cuña de lima, para adornar"], "method": ["Coloque el hielo en un vaso alto y vierta sobre el ron.", "Aprieta las rodajas de lima y agrega las cuñas al vaso.", "Rellene con la cola, decore con una rodaja de lima y sirva."], "url": "www_bbc_co_uk_food_recipes_cubalibre_85336", "title": "Cuba libre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Ron blanco cubano 250ml / 10½fl oz", "700ml / 1 pinta 5fl oz de jugo de manzana", "50ml / 2fl oz de flor de saúco cordial", "2 limones, cortados a la mitad", "1 lima, cortada en cuñas", "limonada nublada, para recargar"], "method": ["Vierta el ron, el jugo de manzana y el cordial de flor de saúco en una jarra grande.", "Exprima el jugo de los dos limones y luego agregue los trozos de limón y las rodajas de lima. Mezcle con una cuchara de madera.", "Llene a la mitad un vaso de plástico lleno de hielo con la mezcla de ron, luego rellene con limonada nublada."], "url": "www_bbc_co_uk_food_recipes_cubansummer_86600", "title": "Verano cubano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 8fl oz de yogur natural", "½ pepino, rallado o finamente picado", "grandes hojas de menta picadas, picadas", "gran pizca de sal", "½-1 guindilla verde, sin semillas y finamente picado (opcional)"], "method": ["Envuelva el pepino rallado en un paño de cocina y exprima el exceso de agua.", "Mezcle todos los ingredientes y sirva frío como acompañamiento de cualquier curry o como salsa para poppadoms."], "url": "www_bbc_co_uk_food_recipes_cucumberandmintraita_67787", "title": "Raita de pepino y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cucumberandmintraita_67787_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pepino de 2,5 cm / 1 en pieza, pelado, sin semillas, cortado en cubitos, más un pepino rebanado, para adornar", "20ml / ¾fl oz de zumo de lima recién exprimido", "2 cucharaditas de flor de saúco cordial", "50ml / 2fl oz de tequila plateado", "15 ml / ½ fl oz triple sec", "1 bola de hielo"], "method": ["Coloque el pepino cortado en cubitos en una coctelera y mezcle con el extremo de un rodillo limpio.", "Agregue el jugo de lima, el cordial de flor de saúco, el tequila de plata, el triple sec y una bola de hielo. Agitar bien.", "Para servir, cuele la mezcla en un vaso coupette. Adorne con la rodaja de pepino fresco."], "url": "www_bbc_co_uk_food_recipes_cucumbermargarita_91324", "title": "Pepino Margarita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pimientos rojos de un frasco", "1 cucharada de aceitunas negras", "2 cucharadas de alcaparras, escurridas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "½ limón, solo jugo", "2 cucharadas de perejil fresco picado", "½ pepino, sin semillas y cortado en cintas con un pelador"], "method": ["Coloque todos los ingredientes, excepto el pepino en un procesador de alimentos y pulse hasta que quede suave.", "Coloque las cintas de pepino en un recipiente y rocíe sobre el aderezo. Revuelva bien para cubrir y luego transfiéralo a un plato para servir."], "url": "www_bbc_co_uk_food_recipes_cucumberribbonsaladw_90358", "title": "Ensalada de cinta de pepino con aderezo de aceitunas y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pepino, cortado en cintas con un pelador de patatas", "2 cucharadas de aceite de sésamo", "½ lima, solo jugo", "1 cucharadita de semillas de sésamo", "sal y pimienta negra recién molida"], "method": ["Combine el pepino, el aceite de sésamo, el jugo de lima y las semillas de sésamo en un bol. Sazonar con sal y pimienta negra recién molida y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cucumberribbonsaladw_93048", "title": "Ensalada de cinta de pepino con limón y sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ pepino", "150 g / 5½ oz de yogur griego", "1 cucharada de menta fresca picada", "pequeño puñado de hielo picado", "sal y pimienta negra recién molida", "hoja de menta, para adornar"], "method": ["Coloque el pepino, el yogur, la menta y el hielo en un procesador de alimentos y mezcle. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta en un tazón y adorne con una hoja de menta."], "url": "www_bbc_co_uk_food_recipes_cucumbersoup_80931", "title": "Sopa de pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "100g / 4oz de verduras blancas picadas, como el blanco de puerro, hinojo y cebolla", "100 ml / 3½ fl oz de vino blanco seco", "2 Arbroath smokies, más o menos picados", "20 g / ¾oz de mantequilla sin sal", "2 chalotes de plátano, finamente picados", "100 g / 4 oz de puerro, solo blanco, finamente picado", "2 dientes de ajo medianos, triturados y luego picados finamente", "200g / 7oz de papas Ratte (o papas cerosas similares), hervidas hasta que estén tiernas y luego peladas", "2 Arbroath smokies, piel y huesos eliminados", "100ml / 3½fl oz de leche entera", "100ml / 3½ fl oz crema doble", "pimienta negra recién molida", "1 Smokie de Arbroath, piel y huesos eliminados", "cebollino picado"], "method": ["Para el caldo de pescado, ponga el aceite en una olla pesada y caliente; luego agrega las verduras y revuelve bien para cubrir con el aceite. Cubra y transpire a fuego lento durante aproximadamente diez minutos; no les permitas colorear. Retire la tapa de la sartén y vierta el vino blanco. Hervir por un minuto. Ahora agregue 1.2 litros / 2 pintas de agua y los smokies. Llevar casi a ebullición; luego desnata bien. Reduzca el fuego y cocine a fuego lento muy suavemente durante 20 minutos. Dejar enfriar. Una vez frío, cuele el caldo a través de un tamiz muy fino, preferiblemente forrado con una doble capa de muselina. (Las existencias se pueden hacer con dos días de anticipación y se mantienen refrigeradas hasta que se necesiten).", "Para hacer la sopa, ponga una cacerola grande a fuego medio. Agregue la mantequilla y, cuando esté derretida, agregue los chalotes, el puerro y el ajo. Cubra y sudé durante 5-10 minutos, pero no permita que las verduras se coloreen.", "Agregue las papas cocidas. Escama los smokies y agrega a la sartén. Cubra y suda por otros dos minutos, luego agregue 1 litro / 1¾ pintas de la reserva reservada y sazone con pimienta negra recién molida. Llevar a ebullición y cocine a fuego lento durante 8-10 minutos.", "Retire la bandeja del fuego y deje que se enfríe un poco. Con cuidado, vierta la mezcla en una licuadora y coloque la tapa. Saque el tapón del orificio de la tapa y cubra el orificio con un paño de cocina para evitar que la mezcla caliente salpique. Mezcle durante unos segundos; luego agregue gradualmente la leche y la crema a través del orificio. Cuando se haya agregado la leche y la crema y la mezcla esté suave, pase a través de un tamiz fino para obtener una textura fina y aterciopelada.", "Para servir, vierte la sopa en una sartén limpia y calienta suavemente. Escama el smokie restante y divídelo entre cuatro cuencos poco profundos y calientes. Cucharee en la sopa y adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_cullenskink_86087", "title": "Estero cullen tradicional", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "1 cucharada de aceite vegetal", "2 puerros, más o menos picados", "2 cebollas, peladas, más o menos picadas", "2 bulbos de hinojo, toscamente picados", "250ml / 9fl oz de vino blanco", "Abadejo ahumado de 500 g / 17½ oz", "750ml / 1 pinta 7fl oz de agua", "75 g / 2½ oz de mantequilla", "1 cucharada de aceite vegetal", "2 puerros, finamente picados", "2 chalotes, pelados, finamente picados", "2 dientes de ajo, pelados, aplastados", "Papas 300g / 10½oz, peladas, picadas", "Crema doble de 500ml / 17½ fl oz", "1 cucharada de perejil fresco finamente picado", "pizca de nuez moscada recién rallada"], "method": ["Para el caldo, caliente la mantequilla y el aceite vegetal en una sartén grande y fría los puerros, las cebollas y el hinojo durante 3-4 minutos, o hasta que se ablanden.", "Agregue el vino blanco a la sartén y deje que hierva. Agregue el abadejo ahumado, vierta en el agua y vuelva a hervir. Reduzca el fuego y cocine a fuego lento durante 30 minutos, eliminando cualquier espuma que salga a la superficie, hasta que el eglefino esté bien cocido.", "Cuele el eglefino, reservando el caldo de cocción. Pique el eglefino en trozos del tamaño de un bocado.", "Para la sopa, caliente la mantequilla con el aceite vegetal y fría los puerros, los chalotes y el ajo durante 3-4 minutos, o hasta que estén blandos. Agregue las papas y el eglefino ahumado picado a la sartén.", "Agregue el caldo de cocción reservado y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que las papas estén tiernas. Agregue la crema y mezcle brevemente la sopa con una batidora.", "Sirva la sopa con pan crujiente y espolvoree con el perejil fresco picado y una pizca de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_cullenskink_92467", "title": "Skink Cullen", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cullenskink_92467_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla", "Azúcar en polvo de 55 g / 2 oz", "2 huevos, preferiblemente rango libre", "Harina blanca 340g / 12oz, preferiblemente sin blanquear", "Ruibarbo rojo 750g / 1½lb, en rodajas de aproximadamente 1 cm / ½ pulgada de grosor", "250 g / 9 oz - azúcar 400 g / 14 oz", "azúcar en polvo para rociar", "crema batida", "azúcar de Barbados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Primero haz la masa. Bata la mantequilla y el azúcar juntos a mano o en un mezclador de alimentos (no es necesario exceder la crema).", "Agregue los huevos y bata durante varios minutos. Reduzca la velocidad y mezcle la harina.", "Dale vuelta a un trozo de papel enharinado enharinado, aplástalo en una envoltura redonda y relájate. Este pastel debe enfriarse durante al menos 1 hora, de lo contrario, es difícil de manejar.", "Para hacer la tarta, extienda la masa de 3 mm / 1/8 pulg. De grosor aproximadamente y use aproximadamente 2 / 3rds de ella para alinear un cuadrado de 21.5cm / 8¾in x 2.5cm / 1in de profundidad con una lata de borde acanalado.", "Coloque el ruibarbo en la base de la repostería y espolvoree con el azúcar.", "Cubra con una tapa de hojaldre, selle los bordes, decore con hojas de hojaldre, cepille con el huevo y hornee en el horno precalentado hasta que el ruibarbo esté tierno, aproximadamente 45 minutos a 1 hora (pero siga revisando algunos hornos puede variar el tiempo de cocción) .", "Cuando esté cocido, corte en cuadrados, espolvorear ligeramente con azúcar en polvo y servir con crema batida y azúcar de Barbados."], "url": "www_bbc_co_uk_food_recipes_cullohillrhubarbpie_11635", "title": "Pastel de ruibarbo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cullohillrhubarbpie_11635_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fechas de 225g / 8oz, picado grueso", "100 g / 3½ oz de albaricoques secos, picado grueso", "50 g / 2 oz de tallo de jengibre en almíbar, escurrido y finamente picado", "Ron oscuro de 50 ml / 2 fl oz", "50g / 1¾oz de azúcar morena oscura", "50g / 1¾oz de mantequilla sin sal, cortada en cubos de 1-2cm / ½in", "Harina normal de 200g / 7oz", "2 cucharadas de azúcar glas", "100 g / 3½ oz de mantequilla sin sal, enfriada y cortada en cubos de 1 cm / ½ in", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de jugo de limón", "100g / 3½oz de mantequilla sin sal, ablandada", "225g / 8oz de azúcar moreno claro y suave", "Ron oscuro de 75 ml / 2½ fl oz"], "method": ["Comience por mezclar todos los ingredientes de relleno, excepto la mantequilla, en un bol. Déjalo a un lado para remojar mientras preparas la masa.", "Para la masa dulce de pasta corta, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla en cubos y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Mezcle el huevo con el jugo de limón y dos cucharadas de agua fría. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Una vez que la masa ha descansado, córtela en dos pedazos, aproximadamente un tercio y dos tercios. Estirar la pieza más grande en una superficie de trabajo ligeramente enharinada. Alinee un plato para pastel de 20 cm / 8 in con la masa, dejando cualquier exceso de pastel colgando sobre el borde. Extienda el relleno en la caja de pastelería y salpique con la mantequilla.", "Estire los pasteles restantes y córtelos en ocho tiras largas, de aproximadamente 1 cm de ancho. En una hoja de pergamino para hornear, use las tiras de pastelería para crear un enrejado con cuatro tiras en cada sentido, pasándolas una debajo de la otra.", "Humedece el borde de la masa en la lata con agua, luego invierte el enrejado del papel sobre la tarta. Presione los extremos de las tiras a la base de pastelería para asegurar.", "Hornee por 15 minutos, luego baje el horno a 160C / 325F / Gas 3 y cocine por otros 20 minutos.", "Mientras tanto, para la mantequilla de ron, bata la mantequilla y el azúcar, luego gradualmente bata el ron. Refrigere hasta que sea necesario.", "Sirva la tarta caliente o fría, con una cucharada de mantequilla de ron."], "url": "www_bbc_co_uk_food_recipes_cumberland_rum_nicky_17799", "title": "Ron Cumberland Nicky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cumberland_rum_nicky_17799_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 muslos de pollo, piel, hueso", "4-6 salchichas de cerdo con carne", "500g / 1lb 2 oz calabaza o calabaza, cortado en cuñas", "2 cebollas cortadas en rodajas", "algunas ramitas de tomillo, o 1 cucharadita de tomillo seco", "2 cucharadas de aceite de oliva", "50ml / 2fl oz de vino tinto", "1 cucharada de jarabe de arce", "1 cucharadita de vinagre de vino tinto", "½ cucharadita de hojuelas de chile (opcional)", "200 g / 7 oz de champiñones castaños, reducido a la mitad", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Coloque los muslos de pollo (con la piel hacia arriba), las salchichas, la calabaza (o calabaza) y las cebollas en un molde para asar y sazone con sal y pimienta. Espolvorea sobre el tomillo y rocía con 1 cucharada de aceite de oliva.", "Mezcle el vino tinto con 100 ml / 3½ fl oz de agua y viértalo. Asar durante 30 minutos. Gire las salchichas a la mitad de la cocción para ayudarlas a dorarse.", "Mezcle el jarabe de arce con el vinagre de vino tinto y luego rocíe sobre el contenido de la lata de asar. Espolvorea sobre los copos de chile, si se usa. Agregue los champiñones a la lata y rocíe con otra cucharada de aceite de oliva.", "Asar durante otros 25-30 minutos, o hasta que todo esté cocido y bien dorado. Servir con cualquier zumo de sartén con una cuchara."], "url": "www_bbc_co_uk_food_recipes_cumberland_sausage_59571", "title": "Bandeja de salchicha, pollo y calabaza Cumberland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cumberland_sausage_59571_16x9.jpg", "isVegetarian": false, "recommendations": 0}]