[{"isVegetarian": false, "title": "Peppered beef fillet with polenta chips and salad", "url": "www_bbc_co_uk_food_recipes_peppered_beef_fillet_61512", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz polenta", "40g/1½oz unsalted butter", "75g/2½oz Parmesan cheese, finely grated", "1 tsp sea salt", "vegetable or sunflower oil, for deep frying", "4 x 150–200g/5½–7oz fillet steaks", "½ tsp Kampot peppercorns", "½ tsp white peppercorns", "½ tsp black peppercorns", "½ tsp green peppercorns", "½ tsp pink peppercorns", "75g/2½oz unsalted butter", "2 shallots, finely chopped", "150ml/5fl oz brandy", "150ml/5fl oz crème fraîche", "selection of seasonal leaves", "3 tbsp olive oil", "1 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the polenta and Parmesan chips, line a baking tray with baking parchment.", "Bring 570ml/1 pint of water to the boil in a large saucepan. Gradually whisk in the polenta and then the butter. Finish with the cheese and salt. Pour into the lined baking tray and leave to set in the fridge for at least an hour.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. ", "Cut the polenta into chip shapes. Deep-fry for 3–5 minutes or until golden and crisp. Place on a plate with kitchen roll to drain off the excess fat.", "For the beef, crush all the peppercorns in a pestle and mortar. Press the pepper into the steaks. Heat a frying pan, add the butter and cook the steaks to your liking. Remove the steaks from the pan and leave to rest.", "In the same pan, make the sauce. Cook the shallots for 2 minutes. Pour in the brandy and scrape off the cooked on bits. Cook until the brandy has reduced in volume by at least a half. Finish with the crème fraîche.", "For the salad, mix the leaves in a bowl. Whisk the oil and the vinegar together in a small bowl. Just before serving pour the dressing over the leaves and toss together.", "Serve the steaks with the sauce poured over, with the polenta chips and dressed salad."]}, {"isVegetarian": false, "title": "Peppered beef with salad leaves", "url": "www_bbc_co_uk_food_recipes_peppered_beef_with_salad_27535", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppered_beef_with_salad_27535_16x9.jpg", "ingredients": ["2 thick-cut sirloin steaks, about 175g/6oz in total, fat trimmed", "1 tsp coloured peppercorns, coarsely crushed", "coarse salt flakes", "60g/2¼oz natural yoghurt", "½ tsp horseradish sauce (to taste)", "½ garlic clove, crushed", "50g/2oz mixed green salad leaves", "30g/1¼oz button mushrooms, sliced", "½ red onion, thinly sliced", "1 tsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the steaks with the crushed peppercorns and salt flakes.", "Mix together the yoghurt, horseradish sauce and garlic and season to taste with salt and freshly ground black pepper. Add the salad leaves, mushrooms and most of the red onion and toss gently.", "Heat the oil in a frying pan, add the steaks and cook over a high heat for 2 minutes, or until browned. Turn over and cook for a further 2 minutes for medium rare, 3-4 minutes for medium or 5 minutes for well done. Place the steak on a warm plate and allow to rest for a few minutes. ", "Spoon the salad leaves into the centre of 2 serving plates. Thinly slice the steaks and arrange the pieces on top. Garnish with the remaining red onion."]}, {"isVegetarian": false, "title": "Peppered chicken, bacon, mozzarella and guacamole in soy and linseed bread", "url": "www_bbc_co_uk_food_recipes_pepperedchickenbacon_83637", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 mini chicken fillets ", "1 tbsp finely crushed black peppercorns", "1 tbsp olive oil", "4 rashers back bacon ", "1 avocado, roughly chopped ", "½ red onion, finely chopped", "½ lemon, juice only", "1 red chilli, finely chopped", "½ tsp ground cumin", "2 tbsp roughly chopped fresh coriander", "salt and freshly ground black pepper", "4 slices soy and linseed bread", "2 tbsp ready-made mayonnaise ", "1 ball buffalo mozzarella, thickly sliced", "4 cooked beetroot or 2 fresh tomatoes, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Flatten the mini breast fillets with a meat mallet or rolling pin, until ½cm thick.", "Sprinkle the chicken with crushed peppercorns to lightly coat.", "Heat a frying pan until hot, then add the oil and the chicken. Fry for 2-3 minutes on each side, until tender golden and completely cooked through.", "Heat a second frying pan until hot, then add the bacon and fry until golden.", "Meanwhile, place the avocado into a bowl and mash with a fork.", "Add the red onion, lemon, chilli, cumin and coriander, season with salt and freshly ground black pepper and mix well.", "To assemble the sandwiches, spread the mayonnaise onto two slices of the bread. Top with the bacon, then the chicken, then the mozzarella slices. Spread the guacamole onto two more slices of the bread. Top each sandwich with lots of tomato or beetroot slices and close with the slice of guacamole-covered bread."]}, {"isVegetarian": false, "title": "Peppered duck breast with wild mushrooms and cream", "url": "www_bbc_co_uk_food_recipes_pepperedduckbreastwi_70257", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 female Barbary duck breasts", "2-3 tbsp black peppercorns, cracked", "50ml/2fl oz cognac", "100ml/3½fl oz light gravy (or chicken stock reduced and thickened with arrowroot)", "100ml/3½fl oz double cream", "110g/4oz shiitake mushrooms", "110g/4oz oyster mushrooms", "30g/1oz dried black trumpet mushrooms, soaked and drained", "25ml/1fl oz light olive oil", "2 tbsp butter", "110g/4oz fresh spinach", "8 sprigs flatleaf parsley to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the duck breasts and lightly score the skin side with a sharp knife. ", "Spread the cracked peppercorns on to the duck breasts, pressing down the pepper into the breasts. Season with salt. ", "Heat a large pan over a moderate heat, and place the duck breasts in, skin-side down. Let them cook for 5 minutes or until the skin is nicely golden and crisp. ", "Turn the breasts over, and cook for approximately 4 minutes more. ", "Remove the duck breasts from the pan, and keep warm. ", "Pour off the fat, and deglaze the pan with the cognac. ", "Add the gravy (or stock), stirring well to scrape up the caramelised juices.", "Add the cream and simmer to reduce to sauce consistency.", "Fry the mushrooms in the olive oil, and half of the butter. ", "Fry off the spinach in the remaining butter. ", "Mix the two together. ", "To serve, spoon the spinach and mushroom mixture on to warmed plates. Slice the duck breasts, and arrange on top of the spinach mixture. Surround with the sauce."]}, {"isVegetarian": false, "title": "Peppered duck with cherries, lovage and elderflower dressing", "url": "www_bbc_co_uk_food_recipes_pepperedduckwithcher_86500", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts", "4tsp black peppercorns", "1 tbsp vegetable oil", "125g/5oz cherries, stones removed", "50ml/2fl oz elderflower cordial", "50ml/2fl oz cider vinegar", "100ml/4fl oz rapeseed oil", "salt, to taste", "75g/3oz Bull's Blood lettuce, or other red-leafed variety of lettuce", "25g/1oz lovage leaves or celery leaves", "25g/1oz fresh elderflower petals", "½ punnet mustard cress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the duck breast and remove any excess sinew. Score the skin lightly with a sharp knife.", "Put the peppercorns in a pestle and mortar and crush.", "Roll each duck breast in the peppercorns then season to taste with salt.  ", "Heat a frying pan until hot then add the vegetable oil and the duck breasts, skin-side down.", "Cook for about one minute then reduce the heat and cook for about five minutes on each side, or until cooked to your own liking. (This amount of time will give you medium-rare meat.)", "Remove the duck from the pan and rest on a wire rack over a plate.", "To make the dressing, place the cherries and elderflower cordial into a saucepan and bring to a gentle simmer. Do not boil - just let the cherries warm through and bleed their colour into the cordial until it takes on a pink colour.", "Remove the saucepan from the heat and allow the mixture to cool.", "Remove the cherries from the mixture and set them aside.", "Whisk in the cider vinegar and rapeseed oil. Add a pinch of salt to taste and return the cherries to the pan.", "To serve, place the lettuce leaves, lovage and cress into a bowl and add  a little of the dressing.", "Cut the duck breasts into thin slices. Layer the salad and duck onto a plate. Spoon some more dressing around the outside of the salad and finish off with a sprinkling of the elderflower petals."]}, {"isVegetarian": true, "title": "Peppered goats' cheese salad with balsamic blueberry sauce", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheeses_80867", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz soft goats cheese, cut into rounds", "1 tsp coarsely ground black pepper", "1 tbsp olive oil", "2 shallots, roughly chopped", "1 tbsp balsamic vinegar", "75g/2¾oz blueberries", "½ tsp freshly ground black pepper", "100g/3½oz chopped mixed fresh herbs (flatleaf parsley, chervil, dill, coriander, basil, chives)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the goats' cheese salad, place a griddle pan over a high heat until it begins to smoke.", "Roll the goats' cheese in the coarsely ground black pepper and place onto the griddle pan to cook for two minutes on each side.", "To make the sauce, heat the olive oil in a small frying pan over a medium heat. Add the shallot and fry until soft.", "Add the balsamic vinegar, blueberries and freshly ground black pepper, then bring to the boil and reduce the liquid volume by half.", "To serve, place the mixed herb salad in the centre of the plate. Place the grilled goats' cheese on top and pour over the sauce."]}, {"isVegetarian": false, "title": "Peppered goats' cheese with Cumberland sauce and pickled walnuts", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_84776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz cracked black peppercorns", "4 x 75g/3oz round slices goats' cheese", "4 slices granary or walnut bread, cut into circles larger than the goats' cheese rounds, toasted", "knob of butter", "2 shallots, finely sliced", "thumb-sized piece fresh ginger, grated", "75ml/3fl oz port", "150ml/5fl oz chicken stock", "250g/9oz redcurrant jelly", "1 tsp green peppercorns in brine, rinsed and drained", "pickled walnuts from a jar, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Pour the cracked black peppercorns onto a plate. Press one side of each of the goats' cheese rounds into the peppercorns.", "Place the goats' cheese rounds onto the bread rounds, peppered-side up and place under the grill for four minutes, or until the cheese is soft and melted.", "For the Cumberland sauce, melt the butter in a frying pan over a medium heat. Add the shallots and the ginger and fry for 2-3 minutes, until soft.", "Add the port and boil until the liquid reduces to a very thick syrup, then add the stock.", "Bring the stock to the boil, then add the redcurrant jelly and the green peppercorns and reduce the heat to simmer for 2-3 minutes, or until the jelly has completely dissolved.", "To serve, place the cheese on toast onto a warmed plate. Drizzle the sauce over the cheese and sprinkle with pickled walnuts."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with peach salsa", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp black peppercorns, roughly crushed", "150g/5½oz goats' cheese, cut into three pieces", "1 ripe peach, peeled and chopped ", "squeeze lemon juice", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered goats' cheese, place the crushed peppercorns into a shallow dish. Press one side of each piece of goats' cheese in the crushed peppercorns. ", "Heat a small frying pan over a medium heat and fry the cheese for three minutes on each side.", "For the peach salsa, place the peach pieces, lemon juice and parsley into a bowl and mix well.", "To serve, place the goats' cheese pieces onto a small plate and spoon over the salsa."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with rocket salad", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85493", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ firm goats' cheese, cut into cubes", "2 tsp black peppercorns, lightly crushed ", "1 tsp olive oil", "1 small bunch rocket, roughly chopped", "1 tsp olive oil", "½ tsp balsamic vinegar", "salt and freshly ground black pepper ", "1 cooked beetroot, cut into cubes, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered goats' cheese, roll the cubes of cheese in black pepper to coat on all sides.", "Heat the olive oil in a small frying pan and fry the cheese until golden-brown and crisp on all sides.", "For the rocket salad,  place the rocket in a bowl and drizzle over the oil and vinegar. Season with salt and freshly ground black pepper and stir well to coat the leaves.", "To serve, place the rocket salad onto a plate and top with the peppered goats' cheese and beetroot."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with hot tomato dressing on bruschetta", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_87296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white crusty bread", "4 tbsp olive oil", "100g/3½oz round goats' cheese", "1 tbsp crushed peppercorns", "½ beef tomato, diced", "½ tsp chilli flakes", "1 tbsp balsamic vinegar", "small handful each fresh basil and coriander leaves"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the bread with half of the oil. Toast the bread on a hot griddle pan.", "Slice the goats' cheese in half to make two discs and coat in the crushed peppercorns. Griddle in the pan for about one minute on each side until just melted and golden-brown. ", "Place the tomato, chilli flakes, remaining oil and vinegar together in a small saucepan and heat through, stirring well. Turn off the heat and leave to one side.", "Arrange the basil and coriander on two plates. Place a slice of bruschetta on the side and place the goats' cheese on top. Pour over the hot tomato dressing and serve immediately."]}, {"isVegetarian": true, "title": "Peppered, griddled goats' cheese", "url": "www_bbc_co_uk_food_recipes_pepperedgriddledgoat_78709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz goats' cheese, with rind", "1 tsp olive oil", "freshly ground black pepper", "mixed herb salad (coriander, basil, flatleaf parsley)", "olive oil, to dress salad"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and drizzle with the oil.", "Grind fresh black pepper generously all over the goats' cheese and place onto the griddle for 3-4 minutes, turning once.", "Place on the herb salad and dress with olive oil."]}, {"isVegetarian": false, "title": "Peppered monkfish with sweet potato fondant", "url": "www_bbc_co_uk_food_recipes_pepperedmonkfishwith_76069", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter", "1 garlic clove, peeled and crushed", "½ sweet potato, peeled and sliced", "1 tsp fresh thyme leaves", "70ml/2½fl oz chicken or vegetable stock", "200g/7oz monkfish, cut into chunks", "1 tbsp fresh ground black pepper", "1 tsp ginger, grated ", "1 tbsp olive oil", "splash double cream", "1 tsp soy sauce", "4 slices pancetta", "chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the fondant, gently melt the butter in a pan. Add the garlic and sweet potato slices. Sprinkle in the thyme and then pour in the chicken or vegetable stock. Transfer to the oven and cook for 10-15 minutes, or until the potato is tender.", "For the monkfish, sprinkle the pepper and ginger over the fish. Heat the oil in a pan and cook the fish for 4-6 minutes. Add the cream and soy sauce to the pan and reduce for a further few minutes.", "Heat a non-stick frying pan until hot. Cook the pancetta for two minutes on each side, until crispy.", "To serve, remove the sweet potato from the oven and transfer to a serving plate. Top with the peppered monkfish and serve the crispy pancetta on top. Garnish with chives."]}, {"isVegetarian": false, "title": "Peppered pork tenderloin with chips and rocket salad", "url": "www_bbc_co_uk_food_recipes_pepperedporktenderlo_90711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz pork tenderloin, sliced into three medallions", "salt and freshly ground black pepper", "1 tbsp olive oil", "6 Anya potatoes, cut into thick chips", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 handful rocket leaves", "1 tomato, chopped", "½ lemon, juice only", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the pork medallions between two sheets of cling film and flatten out to the thickness of a pound coin, using a meat mallet or rolling pin. Remove the cling film and season with salt and freshly ground black pepper.", "Heat the oil in a frying pan and fry the medallions for 3-4 minutes on both sides, or until golden-brown all over and cooked through. Set aside on a warm plate to rest. ", "For the chips, place the potato pieces into a roasting tin, drizzle with the olive oil and season with salt and freshly ground black pepper. Transfer to the oven to roast for 12-15 minutes, turning the potatoes occasionally to ensure they brown evenly. ", "For the salad, combine all of the salad ingredients together in a bowl.", "To serve, place the pork medallions on a serving plate with the chips and salad alongside."]}, {"isVegetarian": false, "title": "Peppered pork with citrus garlic sauce and potato and bean mash", "url": "www_bbc_co_uk_food_recipes_pepperedporkwithcitr_85557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 150g/5½oz pork chops, bones removed and fat trimmed off ", "1 tbsp black peppercorns", "1 tbsp coriander seeds ", "1 tbsp sea salt", "2 tbsp chopped fresh parsley", "1 tbsp olive oil", "1 tbsp olive oil", "½ onion, finely sliced", "200g/9oz new potatoes, boiled until tender and drained", "50g/1½oz broad beans, blanched, skins removed", "50g/1½oz unsalted butter", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper ", "50g/1½oz unsalted butter", "1 tbsp olive oil", "2 garlic cloves, finely chopped", "50ml/2fl oz white wine", "1 orange, juice only", "1 tbsp olive oil", "2 orange slices"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered pork, place the pork chops between two sheets of cling film and flatten with a meat mallet or rolling pin.", "Place the peppercorns, coriander seeds and salt into a pestle and mortar. Grind together, then place the spice mixture into a bowl. Add the parsley and stir well. Rub the spice mixture all over the pork.", "Heat the oil in a frying pan and cook the pork for 3-4 minutes on each side, or until completely cooked through. Remove from the pan and leave to rest.", "For the potato and bean mash, heat the oil in a pan and gently fry the onion until softened.", "Place the cooked potatoes into a large bowl with the broad beans and butter and mash together using a potato masher. Add the chives, season with salt and freshly ground black pepper and mix well.", "For the citrus garlic sauce, heat the butter and oil in a pan and gently fry the garlic for one minute.", "Add the wine and orange juice and simmer until reduced by half.", "For the caramelised oranges, heat the oil in a frying pan and cook the orange slices for a minute on each side, until caramelised.", "To serve, place the potato and bean mash onto plates and top with the peppered pork. Drizzle over the sauce and top with the caramelised orange slices."]}, {"isVegetarian": false, "title": "Peppered steak with roasted carrots, red onion relish and mustard mash", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_85345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz rump steak", "1 tbsp olive oil", "1 tbsp whole peppercorns, crushed", "1 carrot, peeled, roughly chopped and blanched", "1 tbsp olive oil", "salt and freshly ground black pepper ", "25g/1oz unsalted butter", "1 tbsp olive oil", "½ red onion, chopped", "1 tbsp brown sugar", "50ml/2fl oz red wine", "1 tbsp red wine vinegar", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "1 tbsp olive oil", "50ml/2fl oz whole milk", "1 tbsp wholegrain mustard", "1 potato, peeled, cut into cubes and boiled until tender", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a non-stick baking sheet in the oven at 200C/400F/Gas 6.", "For the steak, rub the steak all over with oil and press into the peppercorns to coat the steak.", "Heat a griddle pan until very hot and chargrill the steak for 2-3 minutes on each side. Place the steak onto the preheated baking sheet.", "Place the carrots onto the baking sheet with the steak, drizzle with oil, season with salt and freshly ground black pepper and place into the oven to roast for 4-5 minutes. Remove the beef from the oven when cooked to your liking and leave to rest. Leave the carrots to continue roasting until beginning to turn golden-brown.", "For the red onion relish, heat the butter and oil in a saucepan over a medium heat and cook the onion until softened but not coloured.", "Add the brown sugar, stir well to coat the onions and cook until caramelised. Add the red wine and vinegar, bring to the boil and simmer until thickened. Season with salt and freshly ground black pepper.", "For the mustard mash, place the butter, oil, milk and mustard into a large bowl with the potato. Season with salt and freshly ground black pepper and mash with a potato masher until smooth.", "To serve, place the steak onto a plate with the carrots and mash and a spoonful of relish."]}, {"isVegetarian": false, "title": "Peppered steak with roasted asparagus, 'drunken' potatoes, roasted tomatoes and mustard sauce", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_88528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz sirloin steak", "1 tbsp olive oil", "1 garlic clove, finely chopped", "1 tsp black peppercorns, cracked in a pestle and mortar", "1 bunch asparagus, trimmed", "2 tomatoes, halved", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 tsp caster sugar", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz Anya potatoes, sliced into 1cm/½in thick slices", "75ml/2½fl oz white wine", "salt and freshly ground black pepper", "75ml/2½fl oz white wine", "1 tsp Dijon mustard", "75ml/2½fl oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the peppered steak, rub the steak with the oil and press the chopped garlic and cracked pepper onto one side. Heat a griddle pan until smoking hot and sear the beef on both sides, then transfer the pan to the oven to continue cooking for about five minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place.", "For the roasted asparagus and tomatoes, place the asparagus and tomatoes onto a baking sheet and drizzle over the olive oil. Season with salt and freshly ground black pepper. Sprinkle the sugar over the tomatoes. Place in the oven to roast for about 6-7 minutes, or until tender.", "For the 'drunken' potatoes, heat the oil and butter in an ovenproof frying pan and fry the potato slices until they start to colour. Add the wine and season, to taste, with salt and freshly ground black pepper. Transfer the pan to the oven for about 5-7 minutes, or until the potatoes are tender.", "For the mustard sauce, heat the wine in a small pan and simmer until reduced by half. Stir in the mustard and cream and bring to a simmer.", "To serve, place the 'drunken' potatoes onto a serving plate. Slice the beef and arrange on top, followed by the asparagus and tomatoes. Drizzle over the mustard sauce."]}, {"isVegetarian": false, "title": "Peppered steak with wild mushroom sauce and sweet potato chips", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithwil_86269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 250g/9oz sirloin steak", "1 garlic clove, halved", "olive oil, for drizzling", "2 tsp black peppercorns, crushed", "1 tbsp olive oil", "25g/1oz butter", "½ onion, sliced", "1 garlic clove, chopped", "70g/2½oz mixed wild mushrooms, chopped", "splash white wine", "3 tbsp double cream", "salt and freshly ground black pepper ", "1 medium sweet potato, peeled, cut into chips", "2 tbsp olive oil", "sea salt, for sprinkling", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the peppered steak, rub the steak with the cut side of the garlic, rub with olive oil and roll in the peppercorns to coat all over.", "Heat a frying pan and fry the steak for 3-4 minutes on each side, or until cooked to your liking. Remove from the heat and leave to rest in a warm place.", "For the wild mushroom sauce, heat the olive oil and butter in a pan, add the onion and sauté for 3-4 minutes.", "Add the garlic and fry for one minute.", "Add the mushrooms and cook for 3-4 minutes. Add the wine and simmer for 2-3 minutes, then stir in the cream and season well with salt and freshly ground black pepper.", "For the chips, place the sweet potato chips onto a baking sheet, drizzle with oil and sprinkle with sea salt.", "Transfer to the oven and bake for 15-20 minutes, or until crisp.", "To serve, place the chips onto a serving plate, top with the steak and pour over the wild mushroom sauce. Garnish with parsley."]}, {"isVegetarian": false, "title": "Peppered venison with roasted tomatoes and red wine vinaigrette", "url": "www_bbc_co_uk_food_recipes_pepperedvenisonwithr_84746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz venison fillet", "1 tsp black peppercorns, crushed", "pinch salt", "1 tbsp olive oil, plus extra for rubbing", "150ml/¼ pint red wine", "½ large banana shallot, peeled, chopped", "2 tbsp red wine vinegar", "pinch caster sugar", "handful each fresh coriander, parsley and chives, chopped", "200g/7oz vine cherry tomatoes", "3 garlic cloves, unpeeled", "2 tbsp olive oil", "1 tbsp cobnuts, shelled, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub a little olive oil over the venison fillet. Place the crushed black peppercorns onto a plate and roll the venison over the peppercorns to coat it, then sprinkle with salt. ", "Heat the 1 tbsp olive oil in a frying pan and place the venison into the pan to fry for 2-3 minutes on each side, or until cooked to your liking. Set aside to rest in a warm place.", "For the red wine vinaigrette, place the red wine, chopped shallot, vinegar and sugar into a small saucepan and simmer over a high heat for 8-10 minutes, or until reduced by half. Remove the pan from the heat, add the herbs to the vinaigrette and set aside in a warm place.", "For the roasted tomatoes, place the tomatoes, garlic, olive oil and cobnuts into a small roasting tin, season well with salt and freshly ground black pepper and stir to mix.", "Transfer the tomatoes to the oven to roast for 10-12 minutes, or until softened and slightly charred at the edges. Remove the garlic cloves and discard.", "To serve, slice the venison fillet into thick slices and place onto a serving plate with the roasted tomatoes on top and the vinaigrette poured over."]}, {"isVegetarian": true, "title": "Peppermint creams", "url": "www_bbc_co_uk_food_recipes_peppermint_creams_00124", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppermint_creams_00124_16x9.jpg", "ingredients": ["1 free-range egg white", "½ lemon, juice only", "1 tsp peppermint flavouring", "425g/15 oz icing sugar, plus extra for dusting", "175g/6¼oz dark chocolate"], "serves": "Makes 15-20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg white in a bowl until stiff peaks form when the whisk is removed. Slowly whisk in the lemon juice, peppermint and icing sugar to a stiff paste.", "Tip the peppermint mixture onto a work surface dusted liberally with icing sugar and roll out thinly.", "Use a 5cm/2in cutter to cut out circles and place them onto a baking tray. Chill in the fridge for 1-2 hours, or until the mixture has set.", "Meanwhile, melt the chocolate in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.)", "Dip each peppermint cream into the melted chocolate and set aside on a baking tray. Chill the peppermint creams until set."]}, {"isVegetarian": false, "title": "Pepperoni pizza", "url": "www_bbc_co_uk_food_recipes_pepperoni_pizza_46786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz strong white flour, plus extra for dusting", "1x 7g sachet fast-action yeast", "1½ tsp salt", "175ml/6fl oz warm water", "3 tbsp extra virgin olive oil, plus extra for greasing", "100ml/3½fl oz passata", "1 roasted red pepper, skin removed, sliced (or 200g/7oz jar small, piquant roasted peppers, available from delicatessens and online)", "200g/7oz pepperoni, sliced into rounds", "200g/7oz mozzarella, broken into pieces or sliced", "drizzle extra virgin olive oil", "few sprigs fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/220 Fan/Gas 9. ", "For the pizza dough, place the flour, yeast and salt into a large mixing bowl and stir to combine. Make a well in the centre of the dry ingredients and pour in the warm water and oil. Mix the wet ingredients into the dry ingredients using first a wooden spoon, then your hands, until the mixture comes together as a soft ball of dough. ", "Turn out the dough onto a lightly floured work surface and knead it thoroughly for 8-10 minutes, or until the dough has become smooth and springy to the touch and is no longer sticky. Use a floured finger to make an indent in the surface of the dough; it should spring back when the dough is ready.", "Dust the work surface again with a little more flour, then roll out the pizza dough, moving it around on the work surface as you roll to keep the shape circular and prevent the dough from sticking, until you have a large, thin disc. Press your fingertips down into the dough all over the pizza base. This prevents it from rising too much during cooking.", "For the topping, spread the passata over the pizza base, leaving a 2cm/1in gap around the edge. Season, to taste, with salt and freshly ground black pepper. Scatter over the roasted pepper slices, pepperoni slices and pieces of mozzarella. ", "Bake the pizza in the oven for 10-15 mins, or until the base is crisp and starting to char around the edges. Before serving, drizzle over a little olive oil, garnish with the basil sprigs, and season again with a grinding of black pepper."]}, {"isVegetarian": false, "title": "Pepperpot stew with spillers dumplings", "url": "www_bbc_co_uk_food_recipes_pepperpotstewwithspi_91703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz stewing beef, such as shin, fat and sinew trimmed, cut into small pieces", "4 sprigs fresh thyme, leaves only", "6 allspice berries", "1 bay leaf", "1 garlic clove, peeled, finely chopped", "10cm/4in piece root ginger, peeled, very finely sliced", "1 onion, peeled, chopped", "1.2 litres/2 pints beef stock or water, mixed with 2 tsp yeast extract", "salt and freshly ground black pepper", "450g/1lb yam or potato, peeled, cut into 3cm/1¼in pieces", "400g/14oz sweet potato, peeled, cut into 4cm/1¾in pieces", "450g/1lb pumpkin or butternut squash, peeled, cut into 4cm/1¾in pieces", "4 large spring onions, trimmed, lightly crushed with the edge of a knife", "2-4 Scotch bonnet chillies, finely chopped", "1 x 400ml/14fl oz can coconut milk", "1 x 400g/14oz can butter beans, drained and rinsed", "150g/5½oz spinach or callaloo, leaves only, washed, shredded", "150g/5½oz plain flour", "pinch salt", "4-5 tbsp cold water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pepperpot stew, place the stewing beef, thyme leaves, allspice, bay leaf, garlic, ginger, onion and stock into large, heavy-based, lidded saucepan. Season, to taste, with salt and freshly ground black pepper. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Cover and simmer for 20-25 minutes.", "Add the vegetables, Scotch bonnet chillies, coconut milk and butter beans to the pan and stir well to combine. Return the mixture to a simmer and continue to cook, covered, for a further 15-20 minutes.", "Meanwhile, for the spillers dumplings, in a large bowl, mix together the flour and salt. Add the water, little by little, stirring until the mixture comes together as a smooth dough. Set aside.", "After the stew has cooked for 20 minutes, add the callaloo or spinach, stir well, and continue to simmer the mixture for 4-5 minutes.", "Meanwhile, pinch 20-24 small pieces from the dough and roll each into a ball, using up all of the dough. Add each dumpling to the pot immediately after rolling it and replace the lid. Continue to simmer the stew and dumplings for 8-10 minutes, or until the meat and vegetables are tender, the sauce has thickened and the dumplings are cooked through."]}, {"isVegetarian": true, "title": "Peppers with chickpeas and harissa", "url": "www_bbc_co_uk_food_recipes_peppers_with_chickpeas_85763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppers_with_chickpeas_85763_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 red pepper, seeded and sliced into eight strips", "1 yellow pepper, seeded and sliced into eight strips", "10 cherry tomatoes, halved", "2 tsp harissa paste", "450g/1lb jar of cooked chickpeas in water", "salt", "½ lemon, juice only", "handful fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the olive oil into a large frying pan over a medium heat.", "Add the sliced red and yellow pepper to the pan and allow to soften for 2-3 minutes.", "Add the cherry tomatoes to the pan and cook for a further two minutes, gently squashing the tomatoes with a wooden spoon to release their juices.", "Mix in the harissa paste.", "Carefully pour the chickpeas, and the water in which they were stored, into the pan.  Stir, then allow them to heat through thoroughly for 3-4 minutes.", "Season with salt and the juice of half a lemon.", "Add a handful of fresh basil leaves right at the end of cooking, so they wilt under the residual heat. Serve immediately."]}, {"isVegetarian": true, "title": "Pepper sauce", "url": "www_bbc_co_uk_food_recipes_peppersauce_1301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.5ml/½tbsp vegetable oil", "1 small onion, peeled and finely chopped", "150ml/5fl oz dry white wine", "150ml/5fl oz crème fraîche or double cream", "2 tbsp green peppercorns, rinsed ", "salt and freshly ground black pepper to season"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan and gently cook the onion until soft.", "Add the wine and reduce by half.", "Stir in the crème fraîche and the peppercorns.", "Season with salt and plenty of freshly ground black pepper."]}, {"isVegetarian": false, "title": "Pepper steak with roasted baby tomatoes and summer purée", "url": "www_bbc_co_uk_food_recipes_peppersteakwithroast_74816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp mixed whole peppercorns", "Maldon sea salt and freshly ground black pepper", "4 x 175-225g/6-8oz sirloin steaks, at least 2.5cm/1in thick", "12 baby tomatoes on the vine", "3 tbsp extra virgin olive oil", "200g/7oz green beans, topped and halved diagonally ", "200g/7oz fresh peas (or good quality frozen ones)", "200g/7oz medium English asparagus, trimmed", "200g/7oz fresh broad beans, or frozen, de-frosted", "2 tbsp chopped fresh mint ", "2 tbsp snipped fresh chives", "150g/5½oz ricotta", "2 tbsp freshly grated parmesan", "1 tbsp light olive oil", "knob of butter"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the whole peppercorns in a pestle and mortar and lightly crush down, then add a teaspoon of the Maldon sea salt and gently combine, ensuring you leave some texture. ", "Tip onto a flat plate. Pat the steaks dry with kitchen roll and press the mixed peppercorn mixture onto both sides of the steaks, using your hands. ", "If you have time, cover with cling film and leave at room temperature for 2-3 hours to allow the flavours to infuse.", "Snip the baby tomatoes into four portions of three and arrange in a small roasting tin. ", "Drizzle over a tablespoon of the extra virgin olive oil and season to taste.", "Roast for 12-15 minutes until they are lightly roasted and just beginning to soften. Remove.", "To make the summer purée, bring a large pan of salted water to the boil. ", "Add the green beans and fresh peas (if using frozen don't add these until about a minute before the end of the cooking time). A minute later add the asparagus and cook for a further five minutes, then drain and cool under cold running water. ", "Remove the skins from the broad beans. Cut the tips frm the asparagus, then set them aside with about a quarter of the other vegetables. ", "Tip the remaining vegetables, including the asparagus spears, into a food processor or liquidiser with the mint, chives, ricotta and remaining two tablespoons of extra virgin olive oil. ", "Season generously with salt and freshly ground black pepper. Blend to a rough purée and then tip into a heavy-based pan. ", "Fold in the parmesan and the reserved blanched vegetables. ", "Set aside until you are ready to use.", "To cook the steaks, heat the light olive oil in a large heavy-based frying pan over a high heat. Add the steaks and cook for two minutes on each side, then reduce the heat, add a knob of butter and cook the steaks for 4-6 minutes, turning once, depending on how rare or well-done you like your meat. ", "Transfer the steaks to a plate. Set aside in a warm place to rest.", "While the steaks are resting gently heat the purée. To serve, divide the purée among four plates. Add a steak to each and finish with a pile of tomatoes and a drizzle of olive oil."]}, {"isVegetarian": true, "title": "Peppery hot cabbage salad", "url": "www_bbc_co_uk_food_recipes_pepperyhotcabbagesal_86575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "small pinch asafoetida (available in Asian stores and some supermarkets)", "¾ tsp brown mustard seeds", "¾ nigella seeds (available in Asian stores and some supermarkets)", "2 small dried red chillies, whole", "1 tsp black gram lentils (urad dal), skinned, split and washed ", "1 tbsp chopped peanuts", "10 curry leaves (available fresh or dried from Asian grocers)", "½ large cabbage head, finely shredded", "salt, to taste"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large wok or non-stick saucepan, heat the oil until it is smoking (NB - Do not leave hot oil unattended). Remove the pan from the heat and allow the oil to cool for ten seconds. Return the pan to the hob, turn the heat down and fry the asafoetida and mustard and nigella seeds for 30 seconds. Add the chillies, lentils and peanuts and fry for a further minute or until the lentils have started to colour. ", "Once cooked, stir in the curry leaves, cabbage and salt, to taste. Stir-fry for ten minutes making sure that the cabbage retains some firmness.", "To serve, distribute the cabbage between 2-3 serving plates."]}, {"isVegetarian": false, "title": "Perch with tomato and capers", "url": "www_bbc_co_uk_food_recipes_perchwithtomatoandca_82386", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "1 onion, finely chopped", "salt and freshly ground black pepper", "4 x 250g/9oz perch fillets", "plain flour, for coating ", "900ml/1½ pints tomato passata", "100g/3½oz salted capers, rinsed", "2 cloves garlic, crushed", "200ml/7fl oz fish stock", "chopped fresh parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the olive oil in a frying pan and fry the chopped onion with some black pepper until golden.", "Season the perch with salt and freshly ground black pepper and give the fillets a light coating of flour. ", "Heat the remaining oil in a separate frying pan and fry the fish until golden.", "Add the passata, capers, garlic and fish stock to the onions, then place the fish in the sauce and cook, uncovered, over a low heat for 15 minutes. Add a little more stock if it starts to dry out.", "Season with salt and freshly ground black pepper to taste, garnish with fresh parsley and serve."]}, {"isVegetarian": true, "title": "Perfect apple pie", "url": "www_bbc_co_uk_food_recipes_perfect_apple_pie_73735", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_apple_pie_73735_16x9.jpg", "ingredients": ["5oz golden caster sugar, plus 1 tbsp for sprinkling", "1 tsp ground cinnamon", "2 tbsp cornflour", "600g/1lb 5oz Bramley cooking apples, peeled, cored, sliced", "400g/14oz plain flour, plus extra rolling", "2 tbsp caster sugar", "1 lemon, zest only", "250g/10oz cold butter, cut into cubes", "1 free-range egg, beaten with 2 tbsp cold water, plus 1 free-range egg, beaten, to glaze"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, place the flour, sugar and lemon zest into a bowl and rub in the butter until the mixture resembles breadcrumbs. Add the beaten egg and stir with a round-bladed knife until the mixture forms a dough.", "Set aside one-third of the pastry for the lid. ", "Roll out the remaining pastry on a lightly floured surface until the thickness of a pound coin and 5-7cm/2-3in larger than the pie dish. Lift the pastry over the rolling pin and lower it gently into the pie dish.", "Press the pastry firmly into the dish and up the sides, making sure there are no air bubbles. Chill the fridge for a few minutes.", "Preheat the oven to 200C/180 (fan)/Gas 6. Place a baking tray into the oven to preheat.", "For the filling, mix the sugar, cinnamon and cornflour in a large bowl. Stir in the apples.", "Place the apple filling into the pie dish, making sure that it rises above the edge. Brush the rim of the dish with beaten egg.", "Roll out the reserved ball of pastry. Cover the pie with the pastry and press the edges together firmly to seal. Using a sharp knife, trim off the excess pastry, then gently crimp all around the edge. Make a few small holes in the centre of the pie with the tip of a knife. Glaze the top with beaten egg.", "Lightly knead the pastry trimmings and re-roll. Cut into leaf shapes place all around the edge of the pie, slightly overlapping each other, and glaze with more egg. Sprinkle the pie with sugar and bake in the centre of the oven for 45–55 minutes or golden-brown all over and the apples are tender."]}, {"isVegetarian": false, "title": "Perfect cauliflower cheese with bacon and mushrooms", "url": "www_bbc_co_uk_food_recipes_perfect_cauliflower_27405", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_cauliflower_27405_16x9.jpg", "ingredients": ["1 head cauliflower, trimmed and broken into florets", "250g/9oz smoked streaky bacon, cut into 1cm/½in strips ", "250g/9oz chestnut mushrooms, finely sliced", "25g/1oz butter", "50g/2oz plain flour", "250ml/9fl oz full-fat milk", "pinch English mustard powder", "200g/7oz gruyère cheese, grated", "55ml/2fl oz double cream", "salt and freshly ground black pepper", "pinch ground nutmeg", "50g/2oz ciabatta breadcrumbs", "50g/2oz parmesan cheese, finely grated", "green salad", "crusty bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cauliflower, cook the florets in a large pan of boiling water for about 10 minutes, or until just tender. Drain and set aside. ", "Meanwhile for the béchamel sauce, fry the bacon strips in a dry frying pan until coloured but not crisp. Remove the bacon with a slotted spoon and set aside, keeping the bacon fat in the pan. ", "Add the mushrooms to the pan of bacon fat and fry for 2-3 minutes, or until golden-brown. Remove from the pan and set aside. ", "Melt the butter in a clean saucepan and beat in the flour until smooth. Slowly whisk in the milk until smooth, then stir in the mustard powder, grated cheese and double cream. Keep stirring until the cheese has melted and the mixture is thick and creamy. Season to taste with salt and freshly ground black pepper, then fold in the bacon and mushrooms. ", "Preheat the oven to 180C/350F/Gas 4. ", "Place the cauliflower florets into an ovenproof casserole dish and pour over the cheesy sauce. Sprinkle over a pinch of freshly grounded nutmeg. ", "For the topping, mix the ciabatta breadcrumbs with the parmesan cheese, then sprinkle the mixture over the cauliflower. Place into the oven for 15 minutes, or until the topping is golden-brown and bubbling. ", "Spoon the cauliflower cheese onto plates and serve with a crisp green salad and crusty bread. "]}, {"isVegetarian": false, "title": "Perfect cottage pie", "url": "www_bbc_co_uk_food_recipes_perfect_cottage_pie_78408", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium baking potatoes", "1 tbsp vegetable oil", "600g/1lb 5oz beef mince", "2 onions, finely chopped", "3 garlic cloves, finely chopped", "4 sprigs thyme, leaves picked and finely chopped", "1 celery stick, finely diced", "2 tbsp tomato purée", "dash Worcestershire sauce, to taste", "9 carrots, unpeeled, trimmed (1 finely chopped, 8 left whole)", "100ml/3½fl oz red wine", "500ml/18fl oz beef stock", "50g/1¾oz caster sugar", "125g/4½oz butter", "150ml/5fl oz milk", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "Prick the potatoes all over with a fork, then rub with a little oil and bake for 1-1½ hours, or until tender.", "Heat a large pan until hot, add the vegetable oil and fry the beef in batches until just browned. Add the onions, garlic, thyme and celery and fry for a couple of minutes until softened. ", "Add the tomato purée and cook for 1-2 minutes then add the Worcestershire sauce and the finely chopped carrot. Add the red wine and cook until reduced in volume by a third, then add the beef stock and bring to a simmer, stirring occasionally. Simmer for 30 minutes until the beef is tender and the sauce has thickened.", "Meanwhile, put the remaining carrots in a pan of water, add a pinch of salt, the sugar and a knob of butter. Bring to the boil, then reduce to a gentle simmer and cook for 30-40 minutes until soft.", "Once cooked, tip the mince into a bowl. Season to taste with salt and black pepper and as much Worcestershire sauce as you like. ", "Set aside to cool while you make the mash.", "When the potatoes are cooked, take them out of the oven to cool. Turn the oven up to 220C/200C Fan/Gas 7.", "When the potatoes are just cool enough to handle, slice them in half, scoop out the flesh and pass through a potato ricer into a bowl, or mash them with a fork.", "Add half the remaining butter to the potatoes and warm the milk in a saucepan until just simmering. Pour onto the potatoes and beat until the mash is smooth and creamy. Season to taste with salt and black pepper.", "Pour the cooled mince into a baking dish and spoon the hot mash over the top, fluffing the top with a fork. Scatter a few dots of butter over the top then place in the oven for 10-15 minutes until golden brown and piping hot through.", "Serve with the cooked carrots."]}, {"isVegetarian": false, "title": "Perfect roast pork belly with cabbage and bacon", "url": "www_bbc_co_uk_food_recipes_perfect_roast_pork_belly_18860", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_pork_belly_18860_16x9.jpg", "ingredients": ["2kg/4lb 4oz boneless pork belly, skin scored", "1 onion, cut into chunks", "1 carrot, cut into chunks", "1 celery stick, cut into four pieces", "4 sprigs flatleaf parsley", "2 sprigs thyme", "3 star anise", "1 cinnamon stick, broken in half", "110g/4oz butter", "2 tbsp honey", "110ml/4fl oz red wine", "250ml/9fl oz beef stock", "salt and freshly ground black pepper", "50g/2oz  butter", "4 slices smoked streaky bacon, finely sliced", "1 green cabbage, preferably Hispie, finely shredded", "150g/5oz Brussels sprouts, finely sliced", "75ml/3fl oz water", "2 tbsp chopped fresh chervil", "25g/1oz butter", "1 large Bramley apple, peeled, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork belly, place the pork belly, onion, carrot, celery, parsley, thyme, star anise and cinnamon sticks into a large saucepan. Cover with cold water until the pork is just covered.", "Bring the mixture to the boil, then reduce the heat and simmer for two hours.", "Remove the pork belly from the mixture and place between two heavy baking trays. Chill in the fridge for at least two hours.", "Preheat the oven to 225C/450F/Gas 8.", "Remove the pork from the fridge and cut into four squares.", "Heat an ovenproof frying pan until hot, add half of the butter and the pork belly pieces, skin-side down. Fry for 2-3 minutes.", "Carefully turn the pork belly pieces over and pour over the honey. Roast the pork belly in the oven for 10-12 minutes, or until the pork skin is crisp.", "Meanwhile, bring the red wine and beef stock to the boil in a saucepan and cook until the volume of the liquid has reduced by half. Whisk in the remaining butter and season with salt and freshly ground black pepper.", "Meanwhile for the sautéed cabbage and bacon, heat the butter in a frying pan until foaming and fry the bacon until crisp and golden-brown. Add the cabbage and Brussels sprouts and stir-fry for a further minute. Add the water and cook for a further 4-5 minutes, or until the cabbage is just tender.", "Stir in the chervil and season with salt and freshly ground black pepper.", "For the apple sauce, heat the butter and Bramley apples in a lidded saucepan over a gentle heat. Cover and cook for 2-4 minutes, or until the apples have collapsed and are soft and fluffy. Stir the mixture to form a smooth purée.", "To serve, spoon the sautéed cabbage onto serving plates and top with a piece of pork belly.", "Spoon over the red wine sauce and serve the apple sauce alongside."]}, {"isVegetarian": false, "title": "Perfect roast duck with bread sauce", "url": "www_bbc_co_uk_food_recipes_perfect_roast_duck_with_50051", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_duck_with_50051_16x9.jpg", "ingredients": ["1x 2.8kg/6lb 2oz whole duck, giblets removed", "salt and freshly ground black pepper", "few sprigs fresh thyme", "few sprigs fresh rosemary", "2 tbsp vinegar", "2 onions, skins on, cut in half", "6 rashers smoked streaky bacon", "500ml/17fl oz milk ", "1 medium onion, peeled, cut in half ", "2 whole cloves \t", "6 whole black peppercorns ", "small blade mace (or pinch ground nutmeg) ", "large pinch sea salt flakes", "120g/4oz fresh white breadcrumbs   ", "30g/1¼oz butter "], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Three hours before you want to cook the duck, rinse it under cold running water and pat dry, inside and out, with kitchen paper.", "Season the duck inside and out with salt and freshly ground black pepper. Add the thyme and rosemary sprigs to the cavity, then pour in 125ml/4fl oz of cold water, angling the duck so that the water does not spill out.  Seal the cavity by tucking in the neck of the duck.", "Chill the duck in the fridge for three hours. (Return to room temperature before cooking.)", "When ready to cook the duck, preheat the oven to 220C/450F/Gas 8.", "Suspend a wire rack over a roasting tray and place the duck onto it. Pour 375ml/12½fl oz of boiling water over the duck and into the roasting tray. Then sprinkle the whole duck with vinegar (this will make the skin crispy when cooked).\r\n\r\n", "Place the onion halves on either side of the duck and lay the bacon rashers over the breast. Wipe off any excess vinegar using kitchen paper. Season the duck again with salt and freshly ground black pepper, then cover the tray with aluminium foil, sealing well at the edges.", "Roast the duck in the oven for 30 minutes, then remove the foil and bacon rashers. Reserve the bacon rashers and the roasted onion halves. Set aside the duck in its roasting tray ready to roast again later.", "Reduce the oven temperature to 180C/350F/Gas 5. ", "At this point, start the bread sauce. Pour the milk into a medium-sized saucepan, add the onion halves, cloves, peppercorns, mace (or nutmeg) and salt and heat over a medium heat, stirring well, until the milk starts to simmer. (NB: Do not allow the milk to boil.) ", "Continue to simmer the milk, without boiling, for 4-5 minutes, then remove the pan from the heat and set aside, covered, for one hour to allow the flavours to infuse.", "When the oven temperature has reduced, return the duck to the oven and roast, uncovered, for a further hour, basting all over at 30 minute intervals with the juices from the roasting tray. ", "Remove the bird from the oven and set aside to rest, loosely covered, for 40 minutes. Drain the cooking juices from the roasting tray and reserve in a jug. (After a few minutes, the fat should separate from the meat juices. The duck fat can be poured or skimmed from the jug of roasting juices and used to make roast potatoes to accompany this dish – alternatively, it will keep in a sealed container for up to four weeks.)", "Meanwhile, when the milk for the bread sauce has infused, add the breadcrumbs to a clean saucepan and strain the infused milk over the breadcrumbs through a fine sieve to collect the onion and spices. Stir once and set aside to soak for five minutes.", "Heat the bread mixture over a medium heat, stirring regularly, for 8-10 minutes, or until the bread has absorbed most of the liquid and the mixture has thickened, then remove the pan from the heat and stir in the butter until the butter has melted and the bread sauce resembles porridge. (If the sauce is too thick add a little more milk to loosen it.)", "To cook the reserved roasted onions, heat the roasting tray used to roast the duck over a medium heat, then add the onions, cut-sides down, and cook gently in the residue of the cooking juices for 2-3 minutes so that they soak up the flavours. Keep warm until ready to serve.", "When the duck has rested, open the neck of the roasted duck and carefully pour any liquid inside it into the jug of meat juices.  Stir until well combined and reheat just before serving (this will be the gravy).", "Return the roast duck to the roasting tray and lay the bacon rashers on top of it again. Cook in the oven for a further 15 minutes, or until the skin of the duck is crisp. ", "To serve, carve the roast duck into thin slices and arrange on four serving plates. Place one onion half alongside each portion of duck. Crumble the bacon rashers into pieces and pile a few pieces next to the onions. Pour over the gravy. Serve with roast potatoes and steamed green vegetables."]}, {"isVegetarian": false, "title": "Perfect roast turkey and stuffing", "url": "www_bbc_co_uk_food_recipes_perfect_roast_turkey_72482", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_turkey_72482_16x9.jpg", "ingredients": ["4.5-5.5kg/10-12lb whole turkey, gizzard, heart, wing tips and wishbone removed and reserved", "1 onion, halved", "1 carrot", "2 celery sticks", "2 sprigs of fresh parsley", "2 sprigs of fresh thyme", "175g/6oz salted butter", "flaked sea salt and freshly ground black pepper", "85g/3oz salted butter", "175g/6oz onions, finely chopped", "225g/8oz fresh white breadcrumbs", "2½ tbsp chopped mixed fresh herbs (parsley, chives, thyme, lemon balm, marjoram and sage)", "1.2 litres/2 pints stock (see above, or chicken stock)", "1 tbsp softened butter", "1-2 tbsp plain flour"], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the stock, put the gizzard, heart, wing tips, wishbone, onion, carrot, celery and herbs in a saucepan and season. Cover well with about 2 litres/3½ pints cold water and bring to the boil, then reduce the heat and simmer for 2 hours, or until you have a flavoursome stock. Strain and set aside for making the gravy. (The stock can be made a day or two in advance; cover and store in the fridge, then de-grease if any fat floats to the top.)", "Preheat the oven to 200C/180C Fan/Gas 6. For the stuffing, melt the butter in a saucepan over a medium heat. When it is foaming, add the chopped onions and season. Cover with greaseproof paper and a lid, turn the heat to low and cook for 8-10 minutes, or until completely softened. Set aside to cool.", "Put the cooled onions in a mixing bowl. Mix in the breadcrumbs and mixed herbs and season to taste. Weigh the stuffing to assist with calculating the cooking time. ", "Season the turkey cavity at both ends. Stuff some of the stuffing into the main cavity, but be careful not to pack it in - there must be enough space between the stuffing and breastbone to fit the handle of a wooden spoon. Stuff the smaller cavity at the neck end, again leaving a little space (you may not need all the stuffing, depending on the size of your turkey).", "To assist with calculating the cooking time, add the weight of the turkey, stuffing and 175g/6oz butter together or weigh the stuffed turkey and add the weight of the 175g/6oz butter. ", "Put the turkey in a large roasting tray. Melt the 175g/6oz butter, then soak the muslin in the butter and wrap it over the turkey. Roast for 15 minutes, then turn the oven down to 180C/160C Fan/Gas 4 and roast for a further 15 minutes per 450g/1lb total turkey/stuffing/butter weight. Baste every 30 minutes; it is important to do this quickly so as to not let the turkey cool down, as this could alter the cooking time. Remove the muslin 15 minutes before the end of roasting and baste again. ", "To test the turkey is cooked, insert a small fruit or vegetable knife into the thicktest part of the meat, between the leg and breast; the juices that run should be clear, with no sign of pink; if there is any pink, return the turkey to the oven for another 15-20 minutes, or until cooked through. Tranfer the turkey to a carving dish. Cover it with parchment paper, then place a clean tea-towel over it to keep it nice and snug. Leave it to rest for at least 30 minutes, or up to 1½ hours. ", "Meanwhile, for the gravy, remove the surplus fat from the roasting tray with a spoon. Place the tray on a medium heat and deglaze it by pouring in the stock. Using a whisk, scrape free all the caramelised bits on the bottom of the tray. Bring the mixture to the boil, then carefully pour it into a saucepan through a sieve and season. To thicken the gravy, mix together the butter and flour, then whisk it into the gravy. Bring the mixture to a simmer, then remove from the heat. ", "Carve the turkey and serve on warm plates with the stuffing and hot gravy. "]}, {"isVegetarian": false, "title": "Perfect steak and chips", "url": "www_bbc_co_uk_food_recipes_perfect_steak_and_chips_14714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 litres/3½ pints vegetable oil", "1kg/2lb 4oz floury potatoes, such as Maris Piper, cut into chips", "4 x 275g/10oz sirloin or rib-eye steaks, at room temperature ", "splash groundnut oil, or similar flavourless oil ", "salt and freshly ground black pepper ", "large knob of butter", "watercress, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chips, heat the oil in a deep-fat fryer set to 160C. Alternatively, heat the oil in a deep-sided, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Rinse the chips under cold water in a colander for 1-2 minutes to remove excess starch. (You may need to do this in batches.) ", "Transfer the chips to a large pan of salted water. Bring the water to the boil, then reduce the heat slightly and simmer the chips until just tender. Drain well and set aside to cool and dry further.", "When the chips have cooled and dried, carefully lower batches of them into the hot oil. Cook for 6-8 minutes, or until pale golden-brown. Remove the chips from the hot oil using a slotted spoon and transfer to a bowl. ", "Increase the temperature of the oil to 190C.", "Carefully lower batches of the chips into the hot oil once more, frying for 2-3 minutes, or until dark golden-brown, before removing and setting aside to drain on kitchen paper. Keep warm.", "Meanwhile, for the steak, preheat the oven to 200C/180 Fan/Gas 6.", "Heat the oil in a heavy-based, ovenproof frying pan over a high heat until it is smoking hot. Season the steaks with salt.", "When the pan is hot, add the steaks and fry for 2-3 minutes on each side, or until the meat is dark golden-brown on both sides (you may need to do this in batches).", "Add the butter to the pan and transfer to the oven, Roast the meat for 8 minutes or until cooked to your liking.", "Remove the pan from the oven and baste the steaks with the melted butter. Remove the meat from the pan and set aside to rest for a minimum of 10 minutes.", "To serve, place the steaks on serving plates. Pile the chips alongside. Serve with a handful of fresh watercress."]}, {"isVegetarian": true, "title": "Perfect vegetable spring rolls", "url": "www_bbc_co_uk_food_recipes_perfect_vegetable_spring_12478", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_vegetable_spring_12478_16x9.jpg", "ingredients": ["1 tbsp groundnut oil", "1 tsp grated, peeled fresh root ginger", "100g/3½oz fresh shiitake mushrooms or soaked porcini mushrooms, sliced, stalks removed", "100g/3½oz tinned bamboo shoots, drained and cut into matchsticks", "50g/1¾oz tinned water chestnuts, drained, sliced into small strips", "2 tbsp low-sodium, light soy sauce", "1 tbsp Chinese five-spice powder", "75g/2¾oz beansprouts, must be very fresh", "2 leaves of cavolo nero, washed, shredded", "2 large spring onions, sliced lengthways", "1 small carrot, peeled, cut into matchsticks", "1 tbsp of oyster sauce or vegetarian oyster sauce", "1 tsp toasted sesame oil", "pinch sea salt", "pinch ground white pepper", "25-30 large spring roll wrappers (15x15cm/6x6in square), frozen variety, defrosted (see tip)", "1 medium free-range egg, lightly beaten ", "peanut oil, for deep-frying ", " Thai sweet chilli sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Heat a wok over a high heat until it starts to smoke. Add the groundnut oil. Add the ginger and stir-fry for a few seconds.", "Tip in the mushrooms, bamboo shoots and water chestnuts. Stir-fry for 1–2 minutes, season with 1 tablespoon of the soy sauce and the five-spice powder. Add a small splash of water around the edges of the wok to help create some steam. Remove from the wok and set aside to cool, this should take about 30 minutes to 1 hour. ", "Put the beansprouts, cavolo nero, spring onions and carrot in a bowl. Add the remaining 1 tablespoon of soy sauce, oyster sauce, toasted sesame oil, salt and pepper. Stir together to mix. ", "Once cooled add in the mushroom mixture and stir well to combine. ", "Arrange one spring roll wrapper so that the corners are pointing upwards, downwards and to the sides.", "Spoon 2 teaspoons of the filling starting at the bottom corner about 2cm/¾in from the edge. (Make sure the filling is cool but not too wet – otherwise the spring roll will be soggy and you will break the spring roll wrapper.)", "Roll over the filling, squeezing any air out as you roll away from you. As you reach the middle bring the two corners that are pointing to the side to the middle making sure they overlap. Continue to roll  and tuck the top edge in and seal it with a little of the beaten egg. Repeat with the remaining spring roll wrappers and filling.", "Half-fill a large saucepan or deep-fat fryer with the oil. Heat the oil to 180C/350F. (A 2cm/1in cube of bread should go brown and crisp in 1 minute when dropped into the oil.). Deep-fry the spring rolls for 5-6 minutes swishing them in the fryer until golden-brown crisp. Remove with a slotted spoon and drain on kitchen paper. Serve with Thai sweet chilli sauce. "]}, {"isVegetarian": true, "title": "Perfect mash", "url": "www_bbc_co_uk_food_recipes_perfectmash_13799", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["potatoes", "milk", "butter", "salt and black pepper", "pinch nutmeg"], "serves": "Makes 1 serving", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potaotes in their skins in very well-salted water. (Choose roughly similar-sized potatoes so they cook at the same rate.)", "When they are thoroughly cooked, drain them in a colander and leave them to steam until just cook enough to handle. Then the skins are easilly peeled off with your fingers.", "Break up the potatoes roughly with a fork to allow more moisture to steam off.", "Add the milk and butter to a saucepan and heat. Infuse some fresh ground black pepper and a pinch of nutmeg.", "After a couple of minutes more steaming, the potatoes can then be sieved into the pan of bubbling hot milk and butter, or even cream and butter and whisk until smooth.", "Taste and carefully adjust the seasoning again before serving."]}, {"isVegetarian": true, "title": "Perfect pizza", "url": "www_bbc_co_uk_food_recipes_perfectpizzadough_72456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250-350ml/8¾-12¾fl oz lukewarm water", "1 tbsp active dried yeast", "550g/1lb 3½oz strong white flour, plus extra for dusting", "1 tsp salt", "½ tsp ground black pepper", "2 tsp clear honey", "2 tbsp extra virgin olive oil, plus extra for brushing"], "serves": "5 x 20cm/8in pizza bases", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Pour 150ml/5¼fl oz of the water into a bowl and sprinkle over the yeast. Stir to dissolve, then leave to rest in a warm place for ten minutes. ", "Sift the flour, salt and pepper into a large bowl. Stir the honey and olive oil into the yeast mixture until well combined.", "Make a well in the centre of the dry ingredients and pour in the yeast mixture, mixing to form a soft and slightly sticky dough. Add enough of the remaining water, little by little, until you have achieved the correct consistency.", "Transfer the dough to a lightly floured work surface and lightly flour your hands. Knead the dough for ten minutes until it is smooth and pliable. ", "Lightly oil a large bowl - it should be big enough to allow the dough to double in size. Put the dough inside and cover with cling film. Set aside in a warm place for 1-2 hours.", "When the dough has doubled in size, remove the cling film and punch the dough down. Remove from the bowl and knead again until smooth. Divide into five round balls and let the dough rest before shaping.", "To shape the dough, lift a ball of dough on to a lightly floured work surface and lightly flour the top. Flatten the dough with your fingers before picking it up and slapping it onto your work surface. Repeat this a couple of times. Now drape the dough over your clenched fist and stretch it gently from the outside rim.", "Place the dough in well-floured pizza tins or baking sheets, top with your choice of toppings and bake in a hot oven until the topping is melted and the edges are crispy."]}, {"isVegetarian": true, "title": "Perfect roast potatoes", "url": "www_bbc_co_uk_food_recipes_perfectroastpotatoes_13801", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["floury potatoes, such as Cara or King Edward, cut fairly small - roughly egg size", "sunflower or groundnut oil"], "serves": "Makes 1 serving", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Par-boil the potatoes in gently boiling salted water for about 8 minutes. Stop cooking before they're cooked right through. ", "Leave to cool completely, then scratch roughly with a fork and season with a little fine salt. ", "Only roast around the joint if there is plenty of fat - at least ½cm/¾in in the tin - and plenty of room. It's better to preheat the oil in a separate pan, adding any beef fat from the roasting tin just before the potatoes go in. Don't add the potatoes until the oil is sizzling hot. Baste or turn the potatoes (carefully) as soon as they go into the pan so they have a light coating of oil from the start. ", "Roast for the last 45 minutes of your joint's cooking time, turning at least once. If they look like they could use a bit more browning/crisping, leave them in after the joint has come out to rest, while you increase the heat for the Yorkshire pudding.", "Then, when the preheated pudding tin is ready you'll have to decide whether the potatoes come out, or stay in for the full 15 minutes of pudding time. ", "Drain well and keep in a warm oven, uncovered and not too piled on top of each other. Season again with salt and pepper before serving."]}, {"isVegetarian": false, "title": "Perfect roast turkey", "url": "www_bbc_co_uk_food_recipes_perfectroastturkey_78908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, softened ", "2 tsp sea salt ", "2 tsp freshly ground black pepper ", "4.5kg/10lb turkey, with giblets removed and cavity wiped clean", "3 large onions, halved"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["The bird should be prepared the night before. Mix the butter with the salt and freshly ground black pepper, then season the cavity of the bird.  ", "Rub the butter mix all over the turkey. Fold a large piece of greaseproof paper to double thickness and lay over the breast to protect it during the cooking.  Leave it in the fridge overnight.", "On the day you wish to serve the bird heat the oven to 220C/430F/Gas 7. Take the turkey out of the fridge and allow it to come to room temperature while the oven is heating up.", "Put the onions in a large roasting tray. Put the turkey on a trivet or wire rack in the tray. Pour one cup of boiling water into the cavity of the bird and seal with a skewer. Pour two cups of boiling water into the bottom of the tin, then cover the whole thing with two layers of foil, making sure it is well sealed around the edges.", "Cook for 20 minutes, then reduce the temperature to 200C/400F/Gas 6. After 1½ hours, remove the foil and greaseproof paper. Cook for a further 40 minutes and don't open the oven door until the cooking time is up.  ", "To test whether the turkey is cooked, insert a skewer or knife blade into the point where the thigh joins the breast - the juice should run clear.", "If it is pink, cook it for another 20 minutes and test again.  Leave the turkey to rest in a warm place for at least 15 minutes before carving.", "Strain the juice from the bottom of the tin into a large jug - the fat will rise to the top, leaving the aromatic turkey stock  beneath. Skim off the fat use the juices to make a gravy or serve as it is."]}, {"isVegetarian": false, "title": "Perfect Welsh rarebit", "url": "www_bbc_co_uk_food_recipes_perfectwelshrarebit_13772", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfectwelshrarebit_13772_16x9.jpg", "ingredients": ["50g/2oz flour", "50g/2oz butter", "250ml/9oz strong beer, warmed", "250g/9oz strong cheddar, grated", "2tsp English mustard", "2 tbsp Worcestershire sauce", "black pepper", "4 large slices granary bread"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a small saucepan melt the butter and make a roux with the flour. Cook for a couple of minutes, stirring to prevent the roux from burning. Stir in the warm beer by degrees, until you have a thick but smooth sauce. Add the grated cheese and stir until melted. You should now have a thick paste. Mix in the mustard and Worcestershire sauce and season well with black pepper. ", "Lightly toast and butter the bread, then pile up the cheesy mixture on each slice. Cook under a hot grill for a few minutes, until browned and bubbling. "]}, {"isVegetarian": false, "title": "Piri-piri roast chicken", "url": "www_bbc_co_uk_food_recipes_peri_peri_roast_chicken_75450", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peri_peri_roast_chicken_75450_16x9.jpg", "ingredients": ["2kg/4½lb whole chicken (preferably free-range or organic) ", "salt and freshly ground black pepper", "150ml/5fl oz water, chicken stock or red wine", "5 garlic cloves", "1-5 red chillies (as hot as you dare!)", "2cm/1in piece of ginger, grated", "50ml/2fl oz vegetable oil", "25ml/1 fl oz white or red wine vinegar", "3 tbsp soy sauce", "1-2 tbsp Tabasco (again as hot as you dare!)", "2 tbsp smoked paprika", "3 tsp dried oregano ", "1 tsp caster sugar (optional)", "1 lime, zest and juice", "3 red onions ", "500g/1lb 2oz baby new potatoes", "1 lime, juice only", "1 tsp caster sugar (or a squidge of honey)", "3 tbsp extra virgin olive oil", "130g/4½oz crispy salad leaves"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.  Sit the chicken in a large roasting tin and season well with salt and pepper and a drizzle of oil. Place in the oven and cook for about an hour. ", "For the peri peri sauce, peel and roughly chop the garlic, halve, deseed and finely chop the chillies and place both in a small bowl. Add the rest of the peri peri sauce ingredients and stir to combine.", "Remove the chicken from the oven and tip three-quarters of the peri peri sauce over the chicken and spread it all over with the back of a spoon. Peel and quarter the onions, leaving the roots intact, and toss them in around the chicken along with the potatoes. Season them with salt and pepper and then return to the oven to cook for the final 40-50 minutes. At the end of the cooking time the chicken will most likely look burnt, but worry not, this is the peri peri style.", "To check the chicken is cooked, pierce the thickest part of a thigh with the point of a sharp knife and the juices should run clear (without any pinkness). Once cooked, carefully lift the chicken from the roasting tin onto a plate and cover it loosely with foil so it can rest and become juicier. Using a slotted spoon remove the vegetables from the tin also, transferring them to a medium ovenproof dish. Then, put them back in the oven (with the oven now turned off) to keep warm. ", "Carefully pour the oil out from the roasting tin, leaving the juice and sticky bits behind. Put it on a medium heat and add the remaining sauce and the water, stock or red wine. Allow to simmer for a few minutes, scraping up all the sticky bits from the bottom. ", "Meanwhile, prepare the salad. Squeeze the lime juice into a mug or small bowl and add the sugar (or honey), extra virgin olive oil and a little salt and pepper. Give it a good whisk up. Tip the salad leaves into a large salad serving bowl, pour the dressing over and toss the leaves about. ", "Returning to the chicken, pour any juices on the plate into the sauce before carving the meat. Arrange on serving plates with the roasted onions and potatoes. Serve with the dressed salad and the sauce in a small jug."]}, {"isVegetarian": false, "title": "Peri-peri prawns", "url": "www_bbc_co_uk_food_recipes_periperiprawns_83898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp paprika", "2 tbsp mild chilli powder", "250ml/9fl oz lemon juice", "1½ tsp chopped ginger", "3 garlic cloves, crushed", "1 tsp salt", "12 raw prawns", "1 tbsp olive oil"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the paprika, chilli powder, lemon juice, ginger, garlic and salt.", "Add the prawns to the mixture. For maximum flavour, leave them to marinate for an hour or so.", "Heat a griddle pan and add a little olive oil.", "Add the prawns to the pan and griddle for a few minutes, turning occasionally until they are cooked through. Serve straightaway, with finger bowls."]}, {"isVegetarian": false, "title": "Perry jelly and summer fruits with elderflower ice cream", "url": "www_bbc_co_uk_food_recipes_perryjellyandsummerf_86328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint whole milk, preferably Channel Island ", "6 medium free-range egg yolks ", "100g/4oz caster sugar", "300ml/½ pint Jersey or clotted cream, or a mixture of the two", "200ml/7fl oz elderflower cordial", "4 gelatine leaves ", "500ml/18fl oz perry (sparkling pear cider)", "75g/2¾oz caster sugar ", "125g/5oz mixed berries, such as blueberries, raspberries and wild strawberries"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the elderflower ice cream, bring the milk to the boil in a heavy-based saucepan, then remove from the heat. Whisk the egg yolks and sugar together in a bowl, pour in the milk and whisk well. Return to the pan and cook over a low heat for about five minutes, stirring constantly with a whisk. Do not boil. Remove from the heat and whisk in the cream and elderflower cordial. Leave to cool, then churn in an ice cream machine (according to manufacturer's instructions) until thickened. Decant into a clean container and place in the freezer.", "For the perry jelly and summer fruits, immerse the gelatine leaves one at a time in a shallow bowl of cold water and leave for a minute or so until soft. Bring 100ml/3½fl oz of the perry to the boil in a medium saucepan, add the sugar and stir until dissolved. Drain and squeeze the gelatine leaves, then add to the hot perry and stir until melted. Remove from the heat, add the rest of the perry and stir well. Put the pan of jelly somewhere cool, but do not let it set. ", "Divide half the berries among four individual jelly moulds, or use one large mould. Pour in half of the cooled jelly. Chill for an hour or so to set, then top up with the rest of the berries and unset jelly. (This ensures the berries stay suspended and don't float to the top.) Return to the fridge to chill until set. ", "To serve, turn the jellies out onto plates and place a scoop of the elderflower ice cream in the middle of each one."]}, {"isVegetarian": false, "title": "Perky turkey", "url": "www_bbc_co_uk_food_recipes_perky_turkey_62741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-6 good handfuls leftover turkey meat", "3 garlic cloves", "salt", "2 tablespoons honey", "2 tablespoons soy sauce", "a tablespoon chilli sauce", "a tablespoon tomato ketchup", "a tablespoon grain mustard", "black pepper", "groundnut oil", "2 oranges", "a grapefruit", "4 handfuls watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Strip the cooked meat from the turkey, keeping the pieces as large as you can. They will stay juicier that way. ", "Peel the garlic and add to a pestle and mortar along with a generous pinch of salt. Grind to a paste and transfer to a bowl. Stir in the honey, soy sauce, chilli sauce, ketchup, mustard and a drizzle of groundnut oil. Season with a little black pepper, then add the turkey meat. Toss gently then tip everything into a baking dish. Bake for 20 minutes, or until the meat is glistening.", "Meanwhile make the salad. Peel the oranges and grapefruit with a sharp knife, then slice thinly. Toss with the watercress.  ", "To serve, pile the hot turkey onto the salad and serve. "]}, {"isVegetarian": false, "title": "Persian-style oxtail stew", "url": "www_bbc_co_uk_food_recipes_persian-style_oxtail_79571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz–1.3kg/3lb oxtail (ask your butcher to cut it into sections between the vertebrae)", "2½ tbsp Persian stew spice mix or 2 tsp each ground turmeric, ground cumin and ground coriander seeds, mixed ", "3 tbsp rapeseed oil", "2 onions, finely chopped", "1 bunch Swiss chard, white stalks finely chopped, leafy greens roughly chopped", "4 celery sticks, cut into 2cm/1in chunks", "4 garlic cloves, thinly sliced", "3 handfuls fresh parsley, 2 roughly chopped, 1 finely chopped", "2 handfuls fresh coriander, 1 roughly chopped, 1 finely chopped", "1 handful fresh mint, roughly chopped", "1 handful fresh dill, roughly chopped ", "2 handfuls celery leaves, roughly chopped", "2 litres/3½ pints vegetable stock or water", "4 tbsp pomegranate molasses", "2 dried limes, pricked", "150g/5½oz pearl barley", "50g/1¾oz butter, cut into cubes", "100ml/3½fl oz freshly squeezed lemon juice ", "salt and freshly ground black pepper", "8–10 baby turnips, trimmed, or 2–3 regular turnips, cut into 3cm/1½in chunks", "40g/1½oz butter", "1 tbsp caster sugar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the oxtail in a bowl. Add 1 tablespoon of the spices and a pinch of salt and pepper and rub them into the meat. ", "Heat 1 tablespoon oil in a large heavy-based casserole and sear the oxtail in batches, turning it to make sure it browns on all sides. Transfer the oxtail to a plate and set aside.", "Heat the rest of the oil in the same pan and fry the onions, Swiss chard stalks and celery over a medium heat. Season with salt and pepper, add the rest of the spice mix and cook for 10 minutes, until the onions are soft. Add the garlic and cook for 3 minutes. Add the roughly chopped herbs and celery leaves and half the Swiss chard greens. ", "Turn the heat up, return the oxtail to the pan and cook, stirring occasionally, for 10 minutes, or until the greens have lost their liquid. Add the stock and pomegranate molasses and bring to the boil. Reduce the heat to very low, add the dried limes, cover and cook for 5 hours. Alternatively, transfer to a lidded ovenproof dish and cook in a preheated oven at 140C/120C Fan/Gas 1.", "Remove the lid, strain off 150ml/5fl oz of the cooking liquid and set aside. Add the barley to the pot and simmer for another hour with the lid off, stirring occasionally. ", "For the baby turnips, blanch the turnips in a large saucepan of boiling water for 3 minutes then drain well. Heat half the butter in a large frying pan and add the sugar and turnips. Once the sugar has dissolved, add the reserved oxtail cooking liquid  and boil until almost all the liquid has reduced and the turnips have coloured. Add the rest of the butter and shake the pan until the turnips are nicely glazed all over. Season to taste with salt and pepper and set aside. ", "By now the oxtail stew liquid should have reduced by more than half. If not, simmer for a further 30 minutes. When it is thick and concentrated, add the butter, lemon juice, finely chopped herbs and remaining Swiss chard and check the seasoning.", "To serve, divide the stew between serving plates or place the pan in the middle of the table and top with the glazed turnips. "]}, {"isVegetarian": true, "title": "Persian cucumber and yoghurt dip", "url": "www_bbc_co_uk_food_recipes_persian_cucumber_and_81162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large cucumber, coarsely grated or finely diced ", "500ml/18fl oz Greek yoghurt", "1 large garlic clove, crushed", "20g/¾oz dill, stalks and leaves finely chopped", "sea salt and freshly ground black pepper", "extra virgin olive oli, for drizzling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully squeeze out and discard the excess water from the grated cucumber – you can do this by hand or in a sieve. Place the grated cucumber in a mixing bowl and mix in the yogurt.", "Add the garlic and dill, mix well and season to taste with sea salt and black pepper. Serve with a drizzle of extra virgin olive oil."]}, {"isVegetarian": true, "title": "Persian herb rice", "url": "www_bbc_co_uk_food_recipes_persian_herb_rice_21636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz basmati rice", "sea salt", "100g/3½oz fresh coriander, leaves picked", "100g/3½oz fresh flatleaf parsley, leaves picked", "40g/1½oz fresh chives", "40g/1½oz dill, leaves picked", "125g/4½oz spring onions", "3 tbsp vegetables oil ", "150g/5½oz unsalted butter"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Wash the rice in cold water in a large bowl, then rinse and drain it. Repeat the process with more cold water until the water runs clear. Cover the rice with cold water, add a generous fistful of sea salt to the water and allow the rice to soak for 2-3 hours. (Soaking isn’t essential, but even 30 minutes soaking time will help elongate the grains, making for a more elegant rice dish.) ", "Finely chop the herbs and spring onions, or alternatively pulse them in a food processor in two batches until finely chopped. Set aside the herbs then add the spring onions to the food processor and chop as before. Add to the herbs and set aside.", "Place a large saucepan or stockpot over a medium heat. Fill the pan with boiling water, drain the rice and add to the pan along with another generous fistful of sea salt, the chopped herbs and spring onions. Stir well and allow to boil for 6-8 minutes, or until the rice is parboiled (when the grains turn from the normal whitish opaque to a more brilliant white, although they will not have become fluffy yet). Drain the rice and herbs in a colander and set aside (do not rinse). ", "Return your pan to the heat and add the oil, a few generous knobs of butter and a tablespoon of sea salt. Scatter the rice into the pan. Ensure you scatter it – don’t pack it - because you want the lightness of the falling rice to allow for steam to rise up. Add the remaining butter. Wrap the pan lid in a tea towel (to lock in the steam and make a secure, tight seal), cover the pan and cook for 8 minutes on a medium-high heat. Then reduce the heat to low-medium and cook for a further 25-30 minutes. ", "Once the rice is cooked, remove it from the pan (I like to place a large serving dish over the pan and flip the rice on to the dish), then scrape out the tasty tahdig (meaning ‘bottom of the pan’ – this is the crust bit every Persian fights over) and serve this on top of the rice. "]}, {"isVegetarian": true, "title": "Persian noodle soup", "url": "www_bbc_co_uk_food_recipes_persian_noodle_soup_76589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/persian_noodle_soup_76589_16x9.jpg", "ingredients": ["3 tbsp olive oil", "4 onions, 2 roughly chopped, 2 thinly sliced", "2 tsp ground turmeric", "3 garlic cloves, finely chopped", "400g tin chickpeas, drained", "100g/3½oz small brown lentils ", "400g haricot beans, drained", "1 litre/1¾ pint vegetable stock", "40g/1½oz butter", "100g/3½oz linguine or Iranian reshtey noodles", "200g/7oz spinach", "30g/1oz fresh parsley", "20g/¾oz fresh coriander", "15g/½oz fresh mint", "2 x 250ml/9fl oz tubs soured cream "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan over a medium heat, and fry the onions for 5 minutes, or until soft and pale golden in colour. Add the turmeric and garlic and cook for a further 4 minutes.", "Add the chickpeas, lentils and haricot beans to the onions and pour in the stock. Simmer for 30 minutes, stirring occasionally.", "Melt the butter in a non-stick frying pan over a low heat. Fry the sliced onions for 20 minutes, stirring occasionally, until they are deeply caramelised.", "When the beans have simmered for 30 minutes, add the noodles to the pot and cook for a further 10 minutes.", "Wilt the spinach in a pan with a little water for 2 minutes, drain and squeeze as much liquid out as you can. Roughly chop the spinach on a board, along with the parsley, coriander and mint.", "Stir the spinach and herbs into the noodles and beans. Fold in the soured cream and serve with the caramelised onions on top."]}, {"isVegetarian": false, "title": "Peruvian-style suckling pig", "url": "www_bbc_co_uk_food_recipes_peruvian-style_suckling_45466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 5-7kg/11-15½lb suckling pig", "120ml/4fl oz orange juice", "120ml/4fl oz Peruvian-style chilli sauce (available from online specialists)", "120ml/4fl oz pisco (brandy), preferably Peruvian", "120ml/4fl oz purple maize juice (called chicha morada, available from online specialists)", "8 garlic cloves, crushed", "1 tbsp ground cumin", "salt and freshly ground black pepper", "quinoa, stir-fried vegetables, fried cassava and roasted sweet potatoes, to serve (serving suggestions only)"], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, mix together all of the marinade ingredients in a large bowl until well combined.", "Using a sharp, thin-bladed knife, pierce holes all over the skin of the suckling pig, about 5cm/2in apart.", "Place one bin-bag-sized food bag inside another, then place the suckling pig into the bags and pour in the marinade. Shake the bag to cover the pig in the marinade. Squeeze out as much air from the bags as possible, secure tightly, then set aside in the fridge to marinate for 24 hours, turning the suckling pig after 12 hours.", "Once the suckling pig has marinated, remove it from the fridge and set aside at room temperature for 6 hours.", "When the suckling pig has returned to room temperature, preheat the oven to 190C/170C Fan/Gas 5.", "Remove the suckling pig from the bags and transfer it to a large roasting tray. Wrap the head, trotters and tail in aluminium foil, then roast in the oven for 15 minutes, or until the skin is golden-brown.", "Reduce the oven temperature to 150C/130C Fan/Gas 2 and continue to roast the suckling pig for 3 hours (for a 5kg/11lb pig) and 4 hours (for an 8kg/15½lb pig). Check the suckling pig every 30 minutes or so to make sure that the skin is not burning, basting it with the roasting juices each time. (If the skin is browning too quickly, reduce the oven temperature by 10 degrees or so.) For the last 30 minutes of cooking time, remove the foil from the pig to brown the head, trotters and tail.", "Remove the suckling pig from the oven and pour the roasting juices into a saucepan. Set the pig aside to rest for at least 15 minutes.", "Meanwhile, heat the roasting juices over a medium heat. In a small bowl, whisk together 1 tablespoon of cornflour and enough water to form a thick paste with the consistency of double cream. Add the mixture to the roasting juices to thicken them. If they thicken too much, thin with more boiling water if necessary. Stir the ingredients together for 10 minutes, or until the gravy is smooth and has thickened.", "To serve, carve the suckling pig at the table, and place the slices onto serving plates. Drizzle over the gravy. Serve with Peruvian-style vegetables and grains, such as quinoa, stir-fried vegetables, fried cassava or roast sweet potato."]}, {"isVegetarian": true, "title": "Peshwari naan", "url": "www_bbc_co_uk_food_recipes_peshwarinaan_86757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/8¾oz plain flour, plus extra for dusting", "2 tsp sugar", "½ tsp salt", "½ tsp baking powder", "110-130ml/4½fl oz milk", "2 tbsp vegetable oil", "30g/1oz flaked almonds", "1 tbsp butter, melted, for serving", "70g/2½oz pistachios, shells removed", "35g/1¼oz raisins", "1½ tsp caster sugar"], "serves": "Makes 5 breads", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Sift together the flour, sugar, salt and baking powder in a bowl. Mix the milk and oil together in a separate bowl. Make a well in the centre of the dry ingredients and pour in the liquid ingredients.", "Slowly mix together the dough by working from the centre and incorporating the flour from the edges of the well until you have a smooth, soft dough. Knead for 8-10 minutes, adding a little flour if the dough is too sticky. ", "Place in an oiled bowl, cover with a damp tea-towel and leave in a warm place for at least an hour, until the dough has doubled in size. Then knock back and form into five equal-sized balls.", "For the filling, pulse together the pistachios, raisins and sugar in a food processor until the mixture forms a coarse powder. Divide into five equal portions.", "Preheat the grill to its highest setting and place a heavy baking sheet on the top shelf to heat.", "Roll out each of the five portions of dough balls into thick circles. Fill half of each circle with one portion of the filling leaving about a one-inch margin around the edge. Wet the dough around the edges with a little water and fold each circle in half to enclose the filling. Pinch the dough around the edges to close. ", "Gently roll out each naan into a teardrop or oval shape. Sprinkle over the flaked almonds. Place the naan on the hot baking sheet and grill for about 1-2 minutes until there are nice brown spots on the surface. Brush with the melted butter and serve hot."]}, {"isVegetarian": true, "title": "Pesto", "url": "www_bbc_co_uk_food_recipes_pesto_2281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz basil", "30g/1oz pine nuts, toasted", "30g/1oz parmesan, or similar vegetarian hard cheese, freshly grated", "1 clove garlic, crushed", "85ml/3fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the basil, parmesan, garlic and pine nuts into a food processor and season well. ", "Whiz together and with the motor still running, pour the oil in until the pesto thickens.", "Store in a clean jar in the fridge covered with a slick of oil to prevent it drying out."]}]