[{"ingredients": ["225ml / 8fl oz de arroz carnaroli (u otro arroz risotto)", "125g / 4½oz cubos de tocino o tocino picado", "25g / 1oz de mantequilla", "1 cebolla mediana, pelada y finamente picada", "725 ml / 1¼ pintas de pollo o verdura", "75g / 3oz de pecorino finamente rallado, más algunos adicionales para rociar", "1 huevo grande", "2 yemas de huevo grandes", "1 cucharada de crema fresca apilada", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 150C / 300F / Gas 2.", "Antes que nada, en una sartén grande y caliente a fuego medio, fríe la panceta o tocino en su propia grasa durante 4-5 minutos, hasta que esté crujiente y dorada, luego retírela a un plato. A continuación, agregue la mantequilla a la sartén, luego la cebolla, baje el fuego a suave y deje que la cebolla se reblandezca en la mantequilla durante unos 5 minutos. Mientras tanto, caliente el caldo en una olla pequeña. Luego devuelva la panceta o tocino a la sartén y, después de eso, mezcle el arroz y muévalo hasta que todos los granos obtengan una buena cobertura de los jugos mantecosos. Ahora agregue el caldo caliente al arroz, junto con un poco de sal y pimienta negra recién molida. Deje que todo se cocine a fuego lento, luego transfiera todo al plato calentado, revuelva una vez y luego hornee, sin cubrir, en el estante central del horno y configure un temporizador durante 20 minutos.", "Cuando se acabe el tiempo, mezcle suavemente el Pecorino, doblando y girando los granos de arroz, luego ajuste el temporizador por otros 15 minutos. Mientras tanto, mezcle el huevo, las yemas de huevo y la crème fraîche, luego retire el risotto del horno y mezcle suavemente esta mezcla, asegurándose de que esté bien mezclada. Deje el risotto durante unos 2 minutos, momento en el que los huevos y la crème fraîche se habrán espesado, pero no más, ya que se volverá demasiado espeso. Sirva en platos calientes con un poco más de Pecorino Romano espolvoreado."], "url": "www_bbc_co_uk_food_recipes_ovenbakedrisottocarb_68036", "title": "Risotto carbonara al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenbakedrisottocarb_68036_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 suela de limón, pelada, fileteada", "Nueces 50g / 2oz, finamente picadas", "puñado de perejil fresco, perifollo, albahaca, eneldo", "2 cucharadas de aceite de oliva", "exprimir jugo de limón", "sal y pimienta negra recién molida", "1 limón, cortado en cuñas", "1 cucharada de eneldo fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite en una sartén a prueba de horno, agregar los filetes de lenguado y freír en un lado durante dos minutos. Voltee los filetes, espolvoree con nueces picadas y transfiéralos al horno por cinco minutos.", "Para la ensalada de hierbas, ponga todas las hierbas en un tazón grande. Agregue el aceite de oliva, el jugo de limón y el condimento y mezcle bien.", "Para servir, apile la ensalada de hierbas en un plato y cubra con los filetes de lenguado. Sumerja un lado de las rodajas de limón en el eneldo picado para decorar."], "url": "www_bbc_co_uk_food_recipes_ovenbakedsolewithawa_86131", "title": "Suela horneada con una corteza de nuez servida en una ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de salmón, cada uno con un peso de 110 g / 4 oz", "Fideos soba 300 g / 10½ oz", "Pasta de miso blanca 225g / 8oz", "200g / 7 oz de azúcar", "115ml / 4fl oz sake", "115ml / 4fl oz mirin", "brócoli cocido al vapor brotación púrpura", "rodajas de limón"], "method": ["En un tazón, mezcle todos los ingredientes para el adobo de miso. Coloque los trozos de salmón en el adobo y déjelos toda la noche (no marque el pescado más de dos noches, de lo contrario se volverán duros y muy salados).", "Precaliente el horno a 170C / 325F / Gas 3 (para acelerar el tiempo de cocción, el horno puede precalentarse a 200C / 390F / Gas 6).", "Limpie los filetes de salmón y colóquelos en una bandeja de horno engrasada. Hornee por 5-7 minutos en cada lado, o hasta que estén cocidos.", "Para cocinar los fideos soba, hierva una olla grande de agua y agregue los fideos lo más rápido posible. Revuelva para evitar que los fideos se peguen.", "Haga una pausa con una taza de agua fría y cuando el agua vuelva a hervir y comience a formar espuma, agregue el agua. Deje que el agua vuelva a hervir y drene. Enjuague los fideos con agua fría y drene nuevamente.", "Sirva con brócoli cocido al vapor púrpura y adorne con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_ovenbakedsweetmisoma_73596", "title": "Salmón miso-marinado dulce con fideos soba", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenbakedsweetmisoma_73596_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pomo grande de jengibre fresco, pelado y más o menos picado", "2-3 dientes de ajo, pelados y finamente picados", "2-4 chiles verdes, cortados por la mitad con el tallo, semillas y membranas removidas", "1 cucharadita de sal, o al gusto", "1 cucharadita de sal masala", "1 cucharada de jugo de limón", "2 cucharadas de aceite", "800 g / 1 libra de trozos de pollo de 12 onzas, despellejados y pinchados con un tenedor", "3 cucharadas de aceite vegetal", "¼ cucharadita de sal", "¼ cucharadita de pimienta negra recién molida", "½ cucharadita de comino molido", "4 rebanadas de pan blanco, procesadas para migas en un procesador de alimentos", "1-2 huevos grandes de gallinas camperas, golpeados", "1 limón, para servir"], "method": ["Para el adobo, combine todos los ingredientes del marinado en un mortero y mezcle bien para hacer una pasta. Agregue el pollo y cubra bien cada pieza en la pasta. Cubra con una película adhesiva y déjela durante un par de horas o toda la noche en la nevera. Regrese a la temperatura ambiente antes de continuar.", "Precalentar el horno a 225 C / 435 F / Gas 7.", "Vierta el aceite en una bandeja para asar lo suficientemente grande como para contener todas las piezas de pollo en una sola capa. Coloque la bandeja en un estante alto en el horno durante 15 minutos para calentar.", "Mezcle la sal, la pimienta negra y el comino en las migas de pan. Saque el pollo del adobo, deje que el exceso gotee y enrolle cada pieza en las migas, asegurando un recubrimiento uniforme en todos los lados.", "Sumerja las piezas de pollo en el huevo batido y agregue una segunda capa de migas. Colóquelos en la bandeja para hornear y cocine durante 20 minutos. Luego baje el horno a 200C / 400F / Gas 6, gire el pollo y cocine por otros 15-25 minutos (dependiendo del tamaño de las piezas de pollo), o hasta que esté cocido.", "Coloque en un plato para servir, corte el limón en trozos y sirva."], "url": "www_bbc_co_uk_food_recipes_ovenfriedchillichick_86437", "title": "Pollo frito al horno", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenfriedchillichick_86437_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de pasta yuzu koshou (disponible en algunos supermercados asiáticos y minoristas especializados)", "1 cucharadita de pasta fresca de ajo (mezcla 1 diente de ajo con ½ cucharadita de agua)", "1 cucharadita de pasta de jengibre fresca (mezcla 1cm / ½ en jengibre fresco con ½ cucharadita de agua)", "1 cucharadita de cilantro fresco picado", "1 cucharada de cáscara de yuzu recién rallado (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "1½ cucharadita de chile listo y salsa de ajo", "1 cucharada de mirin (vino de arroz japonés, disponible en algunos supermercados y tiendas de comestibles asiáticos) o agua", "4 cucharadas de aceite vegetal", "4 cucharadas de papa cocida", "4 cucharadas de saikyo white miso (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "1 diente de ajo, pelado", "1 huevo escalfado", "250ml / 9fl oz de aceite vegetal", "1 cucharada de jugo de jengibre fresco (hecho rallando y exprimiendo jengibre fresco y recogiendo el jugo)", "1 limón, solo jugo", "2 gambas grandes de tigre, preferiblemente de Madagascar, o langostinos, conchas en, izquierda entera", "1 daikon (mool), en juliana", "20g / ¾oz de semillas de sésamo negro", "10 hojas de bálsamo de limón"], "method": ["Precaliente el horno y la parrilla a 180C / 350F / Gas 4.", "Para la pasta de chile yuzu, mezcle todos los ingredientes de la pasta de chile yuzu, excepto el mirin y el aceite vegetal en un procesador de alimentos, hasta obtener una pasta.", "Poco a poco agregue el mirin (o agua) y el aceite vegetal y vuelva a mezclar hasta que todo el líquido se haya incorporado por completo a la mezcla. Dejar de lado.", "Para el miso aioli blanco, mezcle la papa cocida, el miso blanco, el ajo y el huevo escalfado en un procesador de alimentos hasta que esté suave y bien combinado.", "Con el motor todavía en funcionamiento, agregue gradualmente el aceite vegetal en una corriente delgada hasta que esté completamente incorporado en la mezcla.", "Agregue el zumo de jengibre y el zumo de limón y vuelva a mezclar hasta que estén bien combinados.", "Para las gambas, ponga cada gamba sobre su espalda. Corte la carne de la cola y las cáscaras por la mitad con un cuchillo afilado o unas tijeras. Retire la carne de la cola de las conchas y pique aproximadamente.", "Revuelva la carne picada de la cola en la pasta de chile yuzu.", "Regrese la mezcla de gambas y chile yuzu a las conchas (debe haber dos conchas llenas por persona). Coloque las cuatro mitades de gambas en una bandeja para hornear y cocine durante 1-2 minutos.", "Retire las mitades de gambas del horno. Con cuidado revuelva la mezcla de gambas y chiles yuzu, en las conchas. Regrese las gambas al horno y cocine durante 1-2 minutos más o hasta que la carne esté rosada y cocida.", "Para servir, exprime el daikon en juliana en dos formas de cono. Coloque un cono de daikon en el extremo de cada una de las dos placas de servir rectangulares. Espolvorea sobre las semillas de sésamo negro. Coloque dos mitades de gambas llenas en el centro de cada plato. Coloque las hojas de bálsamo de limón en la parte superior. Divida el alioli entre dos cuencos de inmersión. Colóquelos en el otro extremo de los platos."], "url": "www_bbc_co_uk_food_recipes_ovengrilledtigerpraw_92738", "title": "Gambas de tigre asadas a la parrilla con chile yuzu y alioli de miso blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de puré de tomate", "1 cucharada de mostaza Dijon", "1 cucharadita de comino molido", "1 cucharadita de sal masala", "1 cucharada de jugo de limón", "½ cucharadita de sal", "¼ cucharadita de chile en polvo", "100 ml / 3½ fl oz de crema individual", "4 pechugas de pollo peladas y deshuesadas (que pesan aproximadamente 560 g / 1 lb 4 oz en total)", "sal y pimienta negra recién molida, al gusto", "4 cucharadas de aceite vegetal", "Palo de canela de 5cm / 2in", "6 vainas de cardamomo, agrietadas abiertas", "6 dientes", "Cebollas de 140g / 5oz cortadas en finas medias medias", "Jengibre fresco de raíz de 2.5cm / 1in en pieza, pelado y cortado en rodajas finas, luego en tiras finas", "1-3 chiles verdes calientes, cortados en diagonal en finas tiras", "½ cucharadita de semillas de mostaza negra o amarilla", "1 diente de ajo, finamente picado", "arroz basmati cocido, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque el puré de tomate en un recipiente y mezcle con una cucharada de agua.", "Agregue todos los ingredientes restantes de la salsa, en el orden indicado, mezclándolos sobre la marcha.", "Extienda las pechugas de pollo y sazone generosamente en ambos lados con sal y pimienta negra recién molida.", "Ponga tres cucharadas de aceite en una sartén antiadherente y colóquelo a fuego alto.", "Cuando esté caliente, agregue la canela, las vainas y los dientes de cardamomo agrietados.", "Después de diez segundos, agregue las pechugas de pollo en una sola capa y dórelas ligeramente a ambos lados.", "Retirar con una cuchara ranurada y colocar en una sola capa en un plato resistente al horno.", "Agregue las cebollas, el jengibre y los chiles verdes a la misma sartén y fríalos en el aceite residual hasta que estén dorados.", "Retirar con una cuchara ranurada y extender uniformemente sobre las pechugas de pollo.", "Agregue la cucharada restante de aceite a la sartén. Cuando esté caliente, agregue las semillas de mostaza. Tan pronto como exploten, esto será solo unos segundos, agregue el ajo y revuelva.", "Tan pronto como el ajo comience a dorarse, vierta la salsa.", "Tan pronto como la salsa se calienta y comienza a burbujear, viértala sobre y alrededor del pollo sin desplazar la mezcla de cebolla.", "Coloque el plato a prueba de horno, descubierto, en el horno y hornee durante 25 minutos.", "Sirva inmediatamente con arroz basmati."], "url": "www_bbc_co_uk_food_recipes_ovenkimurghichickenb_76546", "title": "Horno ki murghi (pollo al horno con chiles verdes y cebollas)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenkimurghichickenb_76546_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["18 tomates maduros", "sal marina", "6 dientes de ajo, aplastados con un poco de sal", "8 cucharadas de orégano picado", "pimienta negra recién molida", "aceite de oliva virgen extra"], "method": ["Precalentar el horno a la temperatura más baja. Cortar los tomates por la mitad horizontalmente y sacar la mayoría de las semillas. Saque el interior y gire el lado cortado hacia abajo en una bandeja de torta de alambre - déjelo durante media hora, luego enjuague y seque.", "Mezcle el ajo triturado con el orégano y la pimienta negra. Extiende esta mezcla sobre el lado cortado de los tomates. Coloque los tomates cortados hacia arriba en una bandeja de asar y gotee sobre aceite de oliva en la bandeja. Cocine en un horno bajo a 100C / 200F / Gas 1 durante tres horas o déjelo al sol hasta por dos días, tomándolos por la noche.", "Coloque los tomates en un frasco kilner esterilizado y cubra con aceite virgen extra. Use en cualquier receta que requiera tomates secados al sol."], "url": "www_bbc_co_uk_food_recipes_ovendriedtomatoes_72380", "title": "tomates secados al horno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 litro", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 patata grande, pelada y cortada en chips largos", "4 ramitas de tomillo fresco, solo hojas", "2 dientes de ajo, en rodajas", "3 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Coloque las papas fritas planas en una bandeja para hornear. Espolvorear con las hojas de tomillo y el ajo y sazonar.", "Rocíe con el aceite de oliva y cocine en el horno durante 15 minutos, o hasta que estén crujientes y doradas.", "Servir."], "url": "www_bbc_co_uk_food_recipes_ovenroastedchips_76872", "title": "Fichas asadas al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite extra virgen", "Ciruela madura 750g / 1½lb", "tomates", "1 cucharadita de hojas frescas de tomillo", "1½ cucharadita de copos de sal marina", "pimienta negra recién molida", "Queso feta griego de buena calidad 450g / 1lb"], "method": ["Precalentar el horno a 240 ° C / 475 ° F / Gas 9. Aceite una lata para asar poco profunda con 2 cucharadas de aceite.", "Cortar los tomates por la mitad a lo largo y colocarlos con el lado cortado hacia arriba en la lata.", "Espolvoree sobre el tomillo y un poco de sal y pimienta y tueste durante 15 minutos.", "Reduzca la temperatura del horno a 150 ° C / 300 ° F / Gas 2 y ase durante otras 1½ horas hasta que se hayan encogido a aproximadamente la mitad de su tamaño original y se hayan concentrado en el sabor. Deja enfriar.", "Coloque los tomates y el queso feta en cuatro platos y rocíe sobre el aceite de oliva restante.", "Espolvorea con un poco más de sal marina y un poco de pimienta negra para servir."], "url": "www_bbc_co_uk_food_recipes_ovenroastedtomatoesw_588", "title": "Tomates asados ​​al horno con queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1lb de papa", "450 pastillas de pastillas", "450 g / 1 libra de zanahorias", "1 limón", "225g / ½ libra de cebollas rojas", "aceite de oliva virgen", "5 cucharadas de miel clara", "tomillo", "sal y pimienta negra recién molida"], "method": ["En primer lugar, lave todas las verduras de raíz pero no las pele. A continuación, corta en trozos grandes y gruesos. Cortar el limón por la mitad y cortar las cebollas rojas en cuartos.", "Coloque todas las verduras en la bandeja del horno y rocíe con aceite de oliva y miel. Agregue algunas ramitas de tomillo fresco y sazone bien. Coloque en un horno precalentado 180C / 350F / Gas 4 por 30-40 minutos para cocinar todas las verduras. Retire del horno de vez en cuando para cubrir todas las verduras en el glaseado y sirva."], "url": "www_bbc_co_uk_food_recipes_ovenroastedvegetable_7597", "title": "Horno asado de verduras con tomillo y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Avena de avena 50g / 1¾oz", "2 manzanas ralladas gruesas", "20g / ¾oz de avellanas blanqueadas, más o menos picadas", "¼ cucharadita de canela molida", "¼ cucharadita de nuez moscada molida", "200% 20 %% 20% de grasa 20% de Greake 20% de yogur", "100ml / 3½ fl oz de leche desnatada", "100 g / 3½ oz de arándanos", "Almendras en copos de 10 g / ¼ oz, tostadas"], "method": ["En un tazón mezcle la avena, las manzanas, las avellanas, la canela y la nuez moscada. Agregue el yogur y la leche, cubra el recipiente y enfríe en la nevera durante varias horas o durante la noche.", "Ponga la cuchara en dos tazones y cubra con los arándanos y las almendras."], "url": "www_bbc_co_uk_food_recipes_overnight_muesli_with_57876", "title": "Durante la noche muesli con manzana y nueces", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/overnight_muesli_with_57876_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "2 mejillas de buey, recortadas", "1 cebolla, cortada en cubitos", "2 zanahorias, cortadas en cubitos", "4 palitos de apio, cortados en cubitos", "2 cucharadas de puré de tomate", "Botella de 750 ml de vino tinto", "2 bulbos de ajo, cortados a la mitad", "2 hojas de laurel", "pequeño racimo de tomillo fresco", "Anís de 2 estrellas", "3-4 dientes", "500ml / 18fl oz de caldo oscuro de pollo o ternera", "sal y pimienta negra recién molida", "1 manojo de berros", "2 cucharadas de aceite de oliva ligero, más más si es necesario", "4 lanzas de espárragos, tallos toscamente picados, puntas aún intactas", "10 g / oz de mantequilla", "1 lengua de buey estofada, cortada en cubitos", "splash Madeira", "puré de patatas, muy suave con mucha mantequilla y crema doble.", "berro micro, para adornar"], "method": ["Caliente el aceite vegetal en una cazuela grande a prueba de fuego a fuego medio. Dorar la mejilla del buey por todos lados, quitar y dejar de lado.", "Agregue las verduras con el ajo, las hierbas y las especias y fría por 10 minutos, hasta que estén doradas. Agregue el puré de tomate y agregue el vino. Cocine a fuego lento hasta que el volumen del líquido se reduzca a la mitad.", "Regrese la mejilla al sartén, agregue el caldo, hierva a fuego lento, tape y cueza durante 2-3 horas o hasta que la mejilla esté tierna.", "Retire la mejilla y manténgase caliente. Cuele la salsa en una sartén limpia y reduzca a una consistencia de recubrimiento brillante. Sazone al gusto.", "Para hacer el aceite de berros, blanquear el berro por unos minutos y refrescar con agua fría. Retire los tallos y colóquelos en una licuadora con aceite de oliva y sal. Blitz bien y pasar por un tamiz.", "Para hacer la lengua y los espárragos, blanquear los espárragos durante 2 minutos y refrescar con agua fría. Caliente la mantequilla en una sartén, agregue los espárragos y la lengua estofada y saltee durante 2-3 minutos. Agregue el Madeira al glaseado.", "Para servir, divida el puré de papa entre dos cuencos poco profundos y cubra con las mejillas cocidas. Vierta la salsa sobre la salsa, adorne con la lengua y los espárragos, rocíe con el aceite de berros y decore con el micro berros."], "url": "www_bbc_co_uk_food_recipes_ox_cheeks_braised_in_red_60794", "title": "Mejillas de buey estofadas en vino tinto con puré cremoso y espárragos salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Goteo de carne de vaca de 20g / ¾oz", "2kg / 4lb 8oz costillas cortas, cortadas en porciones de 500g / 1lb 2oz", "1 cebolla picada", "1 zanahoria, pelada y picada", "1 palito de apio, picado", "2 dientes de ajo, finamente picados", "250ml / 9fl oz de vino tinto", "2 litros / 3½ pintas de caldo de carne", "4 cucharadas de aceite de oliva", "2kg / 4lb 8oz rabo de toro", "Papas harinas de 250g / 9oz, como Maris Piper, cortadas en chips de 2cm / ¾ de grueso", "Goteo de carne de vacuno de 500 g / 1 lb", "75g / 2½oz de cuajada de queso", "2 filetes con hueso de x 550 g / 1 lb 4 oz, como T-bone o prime rib", "Goteo de carne 100 g / 3½ oz", "250g / 9oz de mantequilla sin sal", "4 ramitas de tomillo fresco", "1 ramita fresca de romero", "2 cabezas de ajo, peladas, clavos separados", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 160 C / 140 C Fan / Gas 3", "Para hacer la salsa de rabo de toro, caliente el goteo en una cazuela grande a fuego medio. Agregue las costillas en lotes y selle hasta que se doren por completo. Agregue la cebolla, la zanahoria, el apio y el ajo y cocínelos durante 5-6 minutos. Agregue el vino tinto y cocine a fuego lento hasta que el volumen se haya reducido a la mitad. Agregue el caldo, devuelva las costillas a la sartén, tape y coloque en el horno durante una hora.", "Mientras tanto, tuesta el rabo de toro en una sartén y agréguelo a la cazuela y continúe cocinando por otras 3 horas. Retire del horno y desmenuce cuidadosamente la carne con un tenedor y revuelva. Debería ser un poco abultado.", "Enjuague las papas cortadas en abundante agua fría para eliminar el almidón y colóquelas en una cacerola con agua salada hirviendo y cocínelas durante 7 minutos. Escurrir en un colador y dejar secar.", "Ponga la carne goteando en una freidora o en una olla grande, profunda y de fondo grueso. Calor a 140C. (PRECAUCIÓN: la grasa caliente puede ser peligrosa. No la deje desatendida). Freír las virutas durante 4-5 minutos, asegurándose de que estén sumergidas. Retire de la freidora y drene. Agite las virutas para picar los bordes y permita que se enfríe completamente en la cesta.", "Mientras tanto, sazone los filetes con sal y pimienta. Caliente el goteo en una sartén grande de hierro fundido a fuego alto. Una vez que esté espumante, agregue los filetes y cocine durante 5 minutos, o hasta que estén crujientes en la parte inferior. Gire los filetes y agregue la mitad de la mantequilla, el tomillo, el romero y el ajo. Cocine a fuego alto, rociando los filetes con la mantequilla espumosa, el ajo y las hierbas, durante 5-7 minutos, o hasta que sea medio raro. Transfiera los filetes a un plato y déjelos reposar durante 10 minutos. Mientras tanto, retire las hierbas de la sartén y siga friendo el ajo hasta que esté suave y dorado, agregando la mantequilla restante.", "Vuelva a calentar la freidora o la olla de fondo grueso a 190 ° C. (PRECAUCIÓN: la grasa caliente puede ser peligrosa. No la deje desatendida). Freír las virutas nuevamente durante 4-5 minutos o hasta que estén doradas.", "Cuele 2 cucharadas de salsa de rabo de buey en una sartén a fuego medio y cocine a fuego lento hasta que espese y se caliente.", "Corta los filetes del hueso y corta la carne a través del grano. Servir con el ajo frito y los jugos de carne en reposo. Mezcle las fichas cocidas con la cuajada de queso y colóquelas en un plato para servir, vierta sobre la salsa y sirva con los filetes."], "url": "www_bbc_co_uk_food_recipes_oxtail_poutine_and_07033", "title": "Poutine de rabo de buey y bistec a la mantequilla con ajo dorado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1.25kg / 2lb 12oz rabo de buey, cortado de grasa y cortado en pedazos", "1 cebolla, más o menos picada", "1 tallo de apio, aproximadamente picado", "1 zanahoria grande, más o menos picada", "1 hoja de laurel", "3 ramitas de tomillo", "10 granos de pimienta negra", "2 cucharaditas de puré de tomate", "300ml / 10½fl oz de vino tinto", "1,5 litros / 2 litros de litros de carne de vacuno", "1 cucharada de harina normal"], "method": ["Caliente el aceite en una cazuela grande a prueba de llamas. Agregue las piezas de rabo de buey y fría a fuego alto hasta que se dore por todas partes, puede que tenga que hacer esto en tandas. Saca el rabo del plato y ponlo en un plato.", "Agregue todas las verduras a la cazuela y cocínelas durante 4-5 minutos, revolviendo ocasionalmente. Agregue las hierbas, los granos de pimienta y el puré de tomate y cocine por un minuto más. Vierta el vino y deje que burbujee durante unos minutos.", "Regrese el rabo de toro a la sartén y vierta el caldo. Llevar a ebullición, luego baje el fuego a fuego lento a fuego lento. Cubra y cocine durante 2½-3 horas, hasta que el rabo de toro esté realmente tierno y caiga del hueso. Usando pinzas o una cuchara ranurada, transfiera las piezas de rabo de buey a un plato y déjelas enfriar.", "Cuele el licor de cocción a través de un colador en un recipiente y deje enfriar. Triture la carne de rabo de buey y deseche los huesos. Coloque en un recipiente y cúbralo. Cubra el tazón de licor de cocción y déjelo en la nevera, junto con la carne de rabo de buey, durante la noche.", "Al día siguiente, raspe y deseche la capa de grasa en la parte superior del líquido de cocción. Vierta la sopa restante en una sartén y caliente hasta que hierva a fuego lento. En un tazón pequeño, mezcle la harina y las tres cucharadas de sopa caliente hasta que quede suave. Bata en la sopa y cocine a fuego lento durante dos minutos. Agregue la carne de rabo de buey a la sartén y caliente durante un minuto o dos antes de servir."], "url": "www_bbc_co_uk_food_recipes_oxtail_soup_71917", "title": "Sopa de rabo de buey", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_soup_71917_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rabo de toro entero (alrededor de 1,3 kg / 3 lb), cortado en trozos gruesos", "3 cucharadas de harina común", "sal marina escamada y pimienta negra recién molida", "3-4 cucharadas de aceite de girasol", "2 cebollas, cortadas a la mitad y en rodajas", "2 dientes de ajo, finamente picados", "3 zanahorias, peladas y cortadas en cubitos", "2 palitos de apio, cortados y cortados en cubitos", "1 cucharadita de tomillo seco", "2 hojas de laurel", "300ml / 10fl oz de vino tinto", "2 litros / 3½ pintas de caldo de carne, hecho con 2 cubos de carne de vacuno", "2 cucharadas de puré de tomate", "2 cucharadas de crema de jerez", "2 cucharadas de extracto de levadura, como Marmite", "Harina de auto crianza de 200g / 7oz", "100g / 3½oz de sebo triturado", "3 cucharadas de perejil finamente picado", "½ cucharadita de sal marina en copos", "150ml / 5fl oz de agua fría"], "method": ["Precalentar el horno a 170 ° C / 3140 ° F / Gas 3-4.", "Lave los trozos de rabo de buey y seque con papel de cocina. Recorte tanto exceso de grasa como sea posible. Ponga la harina en una bolsa de plástico resistente y sazone bien con sal y pimienta negra recién molida. Coloque la mitad de las piezas de rabo de buey en la harina sazonada y agite para cubrir. Transfiere a un plato. Repita con las piezas restantes de rabo de toro.", "Caliente dos cucharadas de aceite en una sartén antiadherente grande. Dorar los trozos de rabo de buey a fuego medio durante aproximadamente 10 minutos, o hasta que estén coloreados, girando de vez en cuando. Es posible que necesite agregar aceite extra o cocinar la carne en tandas dependiendo del tamaño de su sartén. Coloque las piezas de rabo de buey en una cazuela grande a prueba de llamas.", "Regrese la sartén al fogón y agregue las cebollas, el ajo, las zanahorias y el apio, con un poco de aceite extra si es necesario. Cocine suavemente durante 10 minutos, o hasta que estén suaves y ligeramente dorados, revolviendo ocasionalmente.", "Incline las verduras encima de la carne y agregue el tomillo y las hojas de laurel. Agregue el vino, el caldo de carne y el puré de tomate. Sazone con sal y pimienta y cocine a fuego lento. Cubra la cacerola con una tapa y cocine en el centro del horno durante tres horas, revolviendo y girando las piezas de rabo de buey a la mitad del tiempo de cocción hasta que la carne se caiga de los huesos.", "Retire la cazuela del horno y transfiera las piezas de rabo de buey a una tabla. Dejar enfriar un poco. Elimine la grasa de la sopa que se habrá acumulado en la superficie y deséchela. Saca la carne de los huesos y descarta cualquier trozo de carne. Cortar la carne en trozos pequeños y volver a la cazuela. Agregue el jerez y el extracto de levadura.", "Para hacer las albóndigas, mezcle la harina, el sebo, el perejil y la sal en un tazón grande. Agregue suficiente agua para mezclarla con una masa suave y esponjosa.", "Enrolla la masa en 18 bolas pequeñas y ponla a un lado. Pon la sopa a fuego lento, revolviendo ocasionalmente. Agregue un montón de condimentos y deje caer las albóndigas suavemente encima de la sopa. Cúbralo bien con una tapa y cocine a fuego lento durante 15-18 minutos, o hasta que las albóndigas estén bien alisadas y esponjosas. Vierte la sopa en los tazones profundos para servir."], "url": "www_bbc_co_uk_food_recipes_oxtail_soup_with_mini_37306", "title": "Sopa de rabo de buey con mini albóndigas de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Rabo de buey de 1.3kg / 3lb, cortado en trozos gruesos (pídale a su carnicero que lo haga por usted)", "3 cucharadas de harina común", "sal y pimienta negra recién molida", "3-4 cucharadas de aceite de girasol", "2 cebollas medianas, en rodajas", "2 dientes de ajo, finamente picados", "2 zanahorias medianas, cortadas en cubitos", "2 tallos de apio, cortados en cubitos", "4-5 ramitas de tomillo fresco (o ½ cucharadita de tomillo seco)", "2 hojas de laurel", "300 ml / ½ de vino tinto", "500ml / 18fl oz de caldo de carne", "2 cucharadas de puré de tomate", "1 cucharada de perejil fresco picado, para servir (opcional)"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Lave los trozos de rabo de buey y seque con papel de cocina. Recorte tanto exceso de grasa como sea posible. Ponga la harina en una bolsa de congelador y sazone bien con sal y pimienta. Pon la mitad de los trozos de rabo de buey en la harina sazonada, revuélvela bien y cúbrela en un plato. Repita con las piezas restantes de rabo de toro.", "Caliente dos cucharadas de aceite en una sartén antiadherente grande. Dorar el rabo de toro a fuego medio durante unos 10 minutos, volteándolo de vez en cuando, hasta que se torne castaño oscuro. Es posible que necesite agregar aceite extra si la bandeja se ve seca en algún momento durante el proceso de dorado. Ponga el rabo de toro dorado en una cazuela a prueba de llamas. (Puede necesitar hacer esto en lotes).", "Regrese la sartén a fuego lento y agregue las cebollas, el ajo, las zanahorias y el apio. Agregue un poco de aceite extra si es necesario. Cocine suavemente durante 10 minutos, o hasta que estén suaves y ligeramente dorados, revolviendo ocasionalmente.", "Incline las verduras encima de la carne y agregue el tomillo y las hojas de laurel. Agregue el vino, el caldo de carne y el puré de tomate. Sazone con sal y pimienta, ponga la cazuela al fuego y cocine a fuego lento. Cubra la cazuela con una tapa y cocine en el centro del horno durante 3 horas. Revuelva después de 1 hora y media, girando el rabo de buey en la salsa.", "Después de 3 horas, la carne debe caerse de los huesos y la salsa debe ser espesa. Retire la cazuela del horno y transfiera las piezas de rabo de buey a un plato, déjelo a un lado y manténgalo caliente.", "Elimine cualquier grasa que haya acumulado en la superficie de la salsa.", "Divida las piezas de rabo de buey entre seis platos calentados y una cuchara sobre la salsa. Espolvorear con el perejil picado (si se usa) y servir con puré de patatas y verduras frescas."], "url": "www_bbc_co_uk_food_recipes_oxtail_stew_91956", "title": "Guiso de rabo de buey", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 5-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_stew_91956_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz rabo de toro, cortado en 2.5cm / 1 en pedazos gruesos, recortado de cualquier exceso de grasa", "sal y pimienta negra recién molida", "50 g / 2 oz de harina, más extra para espolvorear el rabo de toro", "60 g / 2½ oz de mantequilla, más extra para las zanahorias", "1 cebolla, finamente picada", "2 dientes de ajo, aplastados", "1 cucharadita de hojas frescas de tomillo", "2 cucharaditas de puré de tomate", "100 ml / 3½ fl oz de vino tinto", "2 litros / 3½ litros de caldo de carne (o 2 cubos de caldo de carne de buena calidad, disueltos en 2 litros / 3½ litros de agua caliente", "1 cucharada de vinagre de sidra", "½ cucharadita de mostaza inglesa", "3 cucharadas de aceite de colza virgen extra", "puñado de brotes de guisantes", "pequeñas ensaladas y hojas de hierba (por ejemplo, acedera plateada, bittercress, amaranto, ensalada de maíz o espinaca baby)", "60 g / 2½ oz (peso desgranado) guisantes frescos, hervidos", "80-100g / 3-4oz (peso desgranado) habas frescas, hervidas"], "method": ["Precalentar el horno a 220C / 400F / Gas 7.", "Para el rabo de toro, sazonar los rabos de rabo de buey con sal y pimienta negra recién molida y espolvorearlos ligeramente con un poco de harina.", "Coloque el rabo de toro en una lata de asar y tueste en el horno durante 30 minutos, girando los trozos de rabo de buey después de 15 minutos para asegurarse de que estén bien coloreados en ambos lados.", "Mientras tanto, derrita la mantequilla en una sartén a fuego lento y cocine suavemente la cebolla, el ajo y el tomillo durante 3-4 minutos hasta que esté suave, revolviendo ocasionalmente.", "Agregue la harina y el puré de tomate y mezcle bien.", "Poco a poco vierta el vino tinto y el caldo, revolviendo bien entre las adiciones para evitar la formación de grumos, luego llevar la mezcla a ebullición.", "Agregue los trozos de rabo de toro tostado a la sartén, cubra y cocine a fuego lento a fuego lento durante aproximadamente dos horas. Comprueba los trozos de rabo de buey: la carne debe ser tierna y eliminarse fácilmente del hueso. De lo contrario, vuelva a colocar la tapa y cocine durante otros 15 minutos y vuelva a probar.", "Escurra el rabo de toro en un colador sobre un recipiente para reservar la salsa.", "Cuando el rabo de toro esté lo suficientemente frío para manipularse, retire los trozos de carne del hueso y colóquelos en una cacerola limpia y cúbralos con la salsa reservada. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que la salsa se haya reducido lo suficiente como para simplemente cubrir la carne.", "Mientras tanto, para el aderezo, mezcle todos los ingredientes del aderezo en un tazón limpio y sazone, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada, coloque los brotes de guisantes, las hojas de ensalada y hierbas, los guisantes y las habas en un recipiente y cubra con la mayor parte del aderezo. Mezcle bien para cubrir y organizar una pequeña ensalada en el centro de cada plato de servir.", "Para servir, espolvorea un poco de la carne de rabo de buey caliente alrededor de la ensalada con una pequeña cantidad de salsa simplemente cubriendo la carne, luego coloca un poco del aderezo restante sobre el rabo de toro."], "url": "www_bbc_co_uk_food_recipes_oxtailsaladwithsumme_86396", "title": "Ensalada de rabo de buey con verduras de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 panes o brioches caseros en miniatura", "110g / 4oz de mantequilla", "12 ostras frescas", "sal y pimienta recién molida", "pizca de nuez moscada rallada", "150ml / 5fl oz de crema doble", "1 cucharadita de jugo de limón fresco"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Corte las tapas de los rollos o brioches y saque la mayor parte del pan adentro. Derretir 55 g / 2 oz de la mantequilla. Cepille la parte inferior de los párpados y los huecos de los rollos dentro y fuera generosamente con la mantequilla derretida.", "Coloque los panes en una bandeja para hornear. Hornee por unos 10 minutos o hasta que esté ligeramente dorado. Mientras tanto, limpie y abra las ostras, escurra el licor y reserve a un lado.", "Mientras los panes se doran, caliente la mantequilla restante en una sartén grande. Saltee las ostras en la sartén aproximadamente 1 minuto.", "Retire las ostras de la sartén con una cuchara para escurrir, córtelas en 3 pedazos y déjelas a un lado. Agregue el licor de ostras reservado a la sartén con la crema. Condimentar con sal, pimienta y nuez moscada. Hierva constantemente, revolviendo constantemente, para formar una salsa muy espesa, agregando el jugo de limón.", "Regrese las ostras picadas a la sartén y vuelva a calentar suavemente. Coloque las ostras y la salsa en los panecillos calientes. Cubra con las tapas y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_oysterloaves_67845", "title": "Panes de ostras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["18 ostras recién desconchadas, o más si lo desea", "aceite de semilla de uva o aceite vegetal, para freír", "1 mayonesa con frasco pequeño o haz tu propia", "1 cucharada de estragón fresco picado", "1 cucharada de alcaparras", "1 cucharada de chalotes finamente picados", "1 cucharadita de mostaza francesa", "dash Tabasco", "1 cucharada de puré de tomate", "2 cucharadas de jugo de limón", "1 cucharadita de vinagre de vino tinto", "½ cucharadita de pimienta de cayena", "1 cucharada de salsa de rábano picante", "Harina de maíz 225 g / 8 oz", "1 cucharada de comino molido", "1 cucharadita de hinojo molido", "1 cucharadita de pimienta de cayena", "sal y pimienta negra recién molida", "2 huevos", "285 ml / ½ de leche pizca", "Palo francés, calentado", "mantequilla", "lechuga fresca, como cos, rasgada"], "method": ["Para hacer que Remoulade mezcle todos los ingredientes. Pruebe y ajuste cualquiera de los ingredientes que considere necesarios.", "Para la corteza de harina de maíz, combine todos los ingredientes en un tazón. Agregue sal y pimienta negra recién molida al gusto.", "En un recipiente aparte, combine el huevo y la leche en un recipiente para el lavado de huevos.", "Seque las ostras recién cortadas con un paño de cocina y luego sumérjalas en la colada de huevo y luego en la mezcla de la harina de maíz, revolviéndolas generosamente.", "Caliente la semilla de uva o el aceite vegetal en una sartén grande para freír hasta que la miga de pan chisporrotee suavemente en ella (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Freír las ostras recubiertas hasta que estén doradas, unos 2-3 minutos. Retire con una espumadera y escurra sobre la toalla de cocina.", "Tome un palo francés recién calentado, parta por la mitad y mantequilla. Cubra con una capa de lechuga y luego rocíe sobre la salsa Remoulade. Agregue las ostras fritas y cubra con la otra mitad del pan francés.", "Come de una vez"], "url": "www_bbc_co_uk_food_recipes_oysterpoboys_80061", "title": "Oyster po'boys", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["24 ostras nativas en sus caparazones", "55 g / 2 oz de mantequilla", "1 chalote, finamente picado", "1 cucharada de vermut", "140ml / 4½fl oz de caldo de pollo", "140ml / 4½fl oz de caldo de pescado", "Crema doble 140ml / 4½fl oz", "1 cucharada de mostaza Dijon, al gusto", "2 yemas de huevo", "1 cucharada de perejil fresco picado", "55 g / 2 oz de queso parmesano, finamente rallado", "200 g / 7 oz de samphire"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Abra las ostras con cuidado, conservando el jugo. Cubra las ostras con un paño limpio, pero no refrigere.", "Derrita la mantequilla en una sartén y agregue la chalota. Cocine suavemente sin colorear.", "Agregue el vermut, el jugo de ostra y las cepas. Cocine hasta que el volumen de líquido se haya reducido en dos tercios.", "Agregue la crema y cocine hasta que el volumen se haya reducido a la mitad.", "Esconda las ostras, retíralas de las conchas y reserva. Limpie las conchas más profundas y colóquelas en una bandeja, luego ponga un poco de la salsa en la base de cada caparazón. Coloque una ostra en cada caparazón y transfiérala al horno por dos minutos. Precalentar la parrilla a caliente.", "Revuelva la mostaza en la salsa restante. Retire la salsa del fuego y agregue las yemas de huevo, seguido del perejil y la mitad del parmesano.", "Saca las ostras del horno y vierte un poco de salsa sobre cada una. Espolvoree el parmesano restante sobre la parte superior.", "Cocine la salmonete en una sartén con agua salada hirviendo durante 1-2 minutos o hasta que esté tierna. Escurrir bien.", "Mientras tanto, asa a la parrilla las ostras para glasearlas. Sirve con el samphire."], "url": "www_bbc_co_uk_food_recipes_oysters_thermidor_69288", "title": "Termidor de ostras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]