[{"ingredients": ["600 g / 1 lb 5 oz de cordero o carne de cerdo picada", "2 dientes de ajo, aplastados", "1 cucharada de cilantro molido", "2 cucharadas de comino molido", "1 cucharadita de pimentón dulce", "½ cucharadita de canela molida", "1 cucharadita de cardamomo molido", "perejil pequeño, finamente picado", "1 limón, ralladura solamente", "100g / 3½ oz de pan rallado fresco", "Crema doble 50ml / 2fl oz", "1 huevo de gallinas camperas", "3-4 cucharadas de aceite de oliva, para freír", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "½ cucharadita de canela molida", "½ cucharadita de pimienta de cayena", "½ cucharadita de comino molido", "½ cucharadita de cúrcuma molida", "2 hojas de laurel", "400g de tomates de hojalata", "1 cucharadita de miel", "100 ml / 3½ fl oz oz yogur natural (opcional)", "3 cucharadas de hojas de perejil finamente picadas, para servir", "800g / 1lb 12 oz de papas harinosas, peladas y cortadas en trozos de 3-4cm", "200ml / 7fl oz de aceite de oliva", "2 dientes de ajo, finamente picados", "1 cucharada de vinagre de Jerez", "½ cucharadita de azúcar o miel", "1 cucharada de pimentón dulce", "1 cucharadita de pimentón picante", "2 cucharadas de perejil picado fino, para adornar (opcional)"], "method": ["Para las albóndigas, ponga todos los ingredientes en un tazón grande, sazone con una cantidad generosa de sal y pimienta y mezcle bien con las manos. Para comenzar, la mezcla se sentirá húmeda, pero si la doblas sobre sí misma como si la amases, se pondrá rígida. Forme la mezcla en bolas de alrededor de 50 g / 1¾oz cada una, debe terminar con alrededor de 16.", "Para cocinar, caliente el aceite de oliva en una sartén grande y fría las albóndigas en dos tandas, hasta que se doren bien por todos lados, o precaliente el horno a 200C / 180C Fan / Gas 6, coloque las albóndigas en una bandeja para hornear engrasada, y cocine por alrededor de 15 minutos, o hasta que esté bien dorado y recién cocido. Mantener caliente", "Mientras tanto, para hacer las patata bravas, ponga las papas en una cacerola y cúbralas con agua fría. Llevar a ebullición y agregar mucha sal. Cocine a fuego lento durante 3-4 minutos hasta que las papas estén comenzando a ablandarse.", "Mientras cocina las albóndigas, prepare la salsa: caliente el aceite de oliva en una olla. Agregue la cebolla y fría por 10 minutos o hasta que esté suave y translúcida.", "Agregue el ajo, las especias y las hojas de laurel y cocine por un par de minutos, revolviendo constantemente, luego agregue los tomates y la miel. Vierta más de 200 ml / 7 fl oz de agua, luego llevar a ebullición. Reduzca el fuego y deje hervir a fuego lento, cubra, por 15 minutos, luego destapado por otros 5 minutos. Agregue el yogur, si lo está usando.", "Escurra las papas y caliente el aceite de oliva en una sartén grande. Agregue las papas en una sola capa (puede que tenga que cocinarlas en tandas si no las puede colocar) y fríelas por 15-20 minutos o hasta que estén crujientes y doradas por todos lados.", "Para hacer la salsa de patatas bravas, caliente el aceite de oliva en una olla pequeña y agregue el ajo. Cocine por 2-3 minutos hasta que comience a ablandarse sin tomar ningún color. Agregue el vinagre y el azúcar y revuelva hasta que el azúcar se haya disuelto. Agregue el pimentón dulce y caliente.", "Vierta la salsa sobre las patatas crujientes y espolvoree un poco más de pimentón dulce y caliente.", "Para terminar el plato, coloca las albóndigas en una sartén grande y profunda y cúbrelas con la salsa. Cocine a fuego lento durante 5 minutos o hasta que las albóndigas se hayan calentado y la salsa se haya reducido un poco.", "Servir espolvoreado con un poco de perejil, si se usa .."], "url": "www_bbc_co_uk_food_recipes_moorish_meatballs_94958", "title": "Albóndigas árabes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moorish_meatballs_94958_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Camarones marrones 250 g / 9 oz", "75g / 3oz de soja, picado", "1 palo de limón, triturado y finamente picado", "Galangal de 2 cm / 1 en pieza finamente picado (se puede usar jengibre de raíz si el galangal no está disponible)", "½ cucharadita de pasta de tamarindo", "1 cucharada de salsa de soja oscura", "1 cucharada de sake", "1 chile picante, sin semillas, finamente picado", "1 cucharada de cilantro fresco finamente picado", "½ cucharadita de pimienta blanca recién molida", "azúcar de palma (se puede usar azúcar moreno si el azúcar de palma no está disponible), al gusto", "Envases de 1 paquete con rollos de primavera", "1 huevo de gallinas camperas, golpeado", "aceite de maní, para freír", "2 dientes de ajo, aplastados", "1 x 2cm / 1 en pieza de jengibre fresco, pelado, finamente picado", "2 chiles, sin semillas, finamente picados", "1 cucharadita de azúcar de palma (se puede usar azúcar moreno si el azúcar de palma no está disponible)", "5 cucharadas de jugo de lima", "3 cucharadas de salsa de pescado (nam pla)", "125ml / 4½fl oz de jugo de limón", "40g / 1½ oz de azúcar moreno", "1 cucharada de salsa de pescado (nam pla)", "½ cucharadita de aceite de chile", "2 cucharadas de menta fresca, picada", "2 cucharadas de cilantro fresco, toscamente picado", "Cacahuetes tostados triturados de 40g / 1½oz, cortados aproximadamente", "110g / 4oz de berros"], "method": ["Para los rollitos de primavera, coloque las gambas, los brotes de soja, el limoncillo y el galangal en un bol y mezcle bien.", "Coloque la pasta de tamarindo, la salsa de soja y el sake en un tazón limpio y bata para combinar. Agregue a la mezcla de camarones y revuelva para combinar.", "Agregue el chile, el cilantro y la pimienta blanca a la mezcla de camarón y mezcle bien. Comprueba el equilibrio de sabores, tienes control sobre qué tan afilado sabe este plato: si la mezcla sabe demasiado fuerte agrega un poco de azúcar de palma.", "Cepille una envoltura de rollito de primavera con el huevo batido. Coloque una cantidad de la mezcla de camarones en el medio de la envoltura y enrolle como un cigarro, metiendo los extremos, asegurándose de que esté totalmente sellado. Repita este proceso con las envolturas restantes del rollo de primavera y la mezcla de camarones.", "Llene una sartén profunda de fondo grueso con aceite de cacahuete y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Con cuidado, agregue los rollitos de primavera en grupos de tres o cuatro y fríalos hasta que estén dorados y calientes por dentro.", "Para la salsa de lima, coloque el ajo, el jengibre, los chiles y el azúcar de palma en un almirez y mortero, y triture hasta obtener una pasta. Agregue el jugo de lima y la salsa de pescado, luego transfiera a un recipiente limpio y mezcle bien.", "Para la vinagreta de maní y lima, coloque todos los ingredientes en un bol y mezcle bien.", "Para servir, coloque un puñado pequeño de berros en los platos. Coloque tres o cuatro rollitos de primavera en la parte superior y sirva las salsas de inmersión al lado."], "url": "www_bbc_co_uk_food_recipes_morecombebayshrimpan_85714", "title": "Rollitos de primavera de camarón y tamarindo de la bahía de Morecambe", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ mooli, pelado y rallado", "1 tomate, sin semillas, finamente picado", "½ limón, solo jugo", "1 lima, solo jugo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 gambas grandes, peladas, desvenadas y butterflied"], "method": ["Coloque el mooli y el tomate en un tazón y agregue el limón y el jugo de lima y una cucharada de aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar bien.", "Rocíe las gambas con el aceite de oliva restante. Calentar una sartén y freír las gambas durante 2-3 minutos, o hasta que estén doradas y completamente cocidas.", "Para servir, coloque la ensalada en un plato y cubra con las gambas."], "url": "www_bbc_co_uk_food_recipes_moolisaladwithbutter_87245", "title": "Ensalada mooli con langostinos con mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de hinojo", "3 cucharaditas de semillas de cilantro", "3 dientes de ajo", "pellizcar el azafrán", "2 chiles rojos secos, finamente picados", "2 cucharadas de cilantro fresco finamente picado", "5 cucharadas de aceite de oliva", "2 rebanadas de hombro de cerdo, alrededor de 7.5cm / 3in de espesor", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 cabeza de ajo, separada en clavos enteros pelados", "750ml / 1¼ pintas de caldo de pollo o cordero", "1 hoja de laurel", "10-15 albaricoques secos", "300g / 10½oz de cuscús", "1 ramita de canela", "1 cucharada de vinagre de vino tinto", "1 cucharadita de azúcar en polvo", "3 cucharadas de aceite de oliva", "1 cucharada de menta fresca finamente picada", "1 cucharada de cilantro fresco finamente picado", "1 cucharada de perejil de flatleaf fresco finamente picado", "1 naranja sin cebar, solo ralladura", "1 limón sin cebar, solo cáscara", "2 cucharadas de pasas", "2 cucharadas de almendras en copos, tostadas", "2 cucharadas de pistachos, tostados y picados", "sal y pimienta negra recién molida"], "method": ["Para el adobo, coloque todos los ingredientes en una licuadora y rellene hasta formar una pasta. Frote el adobo en las rodajas de cerdo, tapar y poner en la nevera durante 24 horas.", "Después de 24 horas, caliente el aceite en una sartén grande, agregue la cebolla y los dientes de ajo y sude unos 2-3 minutos. Agregue la carne de cerdo y su adobo, caldo, laurel y albaricoques y cuece muy suavemente a fuego lento durante 2-3 horas, o hasta que estén tiernas.", "Para el cuscús, coloca el cuscús en un tazón grande con la rama de canela. Cubra con agua hirviendo, coloque un plato sobre el recipiente y déjelo durante 10 minutos. Mientras tanto, mezcle el vinagre, el azúcar y el aceite en un tazón pequeño. Bifurque la mezcla de vinagre a través del cuscús cocido. Agregue las hierbas picadas, las zests de naranja y limón, las pasas, las almendras y los pistachos y sazone con sal y pimienta.", "Corte las rebanadas de carne de cerdo en cuatro porciones y colóquelas en platos calientes. Ponga un poco de adobo con la cebolla, los dientes de ajo y los albaricoques sobre la carne de cerdo. Servir inmediatamente, con el cuscús al lado."], "url": "www_bbc_co_uk_food_recipes_moroccan-style_braised_72033", "title": "Cerdo estofado de estilo marroquí con cuscús", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla grande, picada", "3 dientes de ajo, aplastados", "275ml / 10fl oz de caldo de pollo", "sal marina y pimienta negra recién molida", "4 pechugas de pollo", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharaditas de canela molida", "1 cucharadita de jengibre molido", "puñado de albaricoques secos o ciruelas pasas (o ambos), picados", "2 cucharadas de miel clara", "manojo de cilantro fresco, picado", "cuscús, para servir", "yogur natural, opcional, para servir"], "method": ["Coloque la cebolla, el ajo y el caldo de pollo en una cacerola a fuego medio y deje que hierva. Sazonar con sal y pimienta negra recién molida y hervir durante cinco minutos, o hasta que se reduzca el volumen a la mitad.", "Agregue el pollo, los tomates, la canela molida, el jengibre molido y los albaricoques secos o las ciruelas pasas. Regrese la mezcla a ebullición, luego reduzca el fuego a bajo, cubra con una tapa y cocine a fuego lento con cuidado, revolviendo ocasionalmente, durante aproximadamente una hora.", "Haga el consciente de acuerdo con las instrucciones del paquete.", "Justo antes de servir, revuelva la miel y el cilantro en el pollo y cocine por otros cinco minutos. Servir con cuscús y yogur."], "url": "www_bbc_co_uk_food_recipes_moroccan-style_chicken_47173", "title": "Pollo de estilo marroquí con cuscús y yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan-style_chicken_47173_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, en rodajas", "T tsp ras-el-hanout", "pellizcar canela molida", "½ cucharadita de cilantro molido", "400g / 14oz de tomates cherry, picados", "2 cucharadas de cilantro picado", "2 huevos de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Caliente el aceite en una sartén, agregue la cebolla y el ajo y cocínelos durante 6-7 minutos, o hasta que estén suaves. Agregue las especias y cocine, revolviendo, por un minuto más.", "Agregue los tomates y sazone bien con sal y pimienta, luego cocine a fuego lento durante 8-10 minutos.", "Esparza más de 1 cucharada de cilantro, luego divida la mezcla de tomate entre 2 platos individuales a prueba de horno. Rompa un huevo en cada plato.", "Hornee por 8-10 minutos hasta que las claras de huevo estén listas pero las yemas todavía estén ligeramente líquidas. Cocine por otros 2-3 minutos si prefiere que los huevos se cocinen.", "Dispersar sobre el cilantro restante y servir."], "url": "www_bbc_co_uk_food_recipes_moroccan_baked_eggs_12048", "title": "Huevos al horno marroquíes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan_baked_eggs_12048_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de jengibre molido", "1 cucharadita de pimienta negra recién molida", "1 cucharadita de cúrcuma molida", "½ cucharadita de pimienta de cayena", "680 g / 1½ lb de hombro de cabrito o cabra, recortado y cortado en trozos grandes", "50g / 1¾oz de albaricoques secos, finamente rebanados", "50g / 1¾oz sultanas", "1 cucharada de aceite de colza", "2 cebollas, más o menos picadas", "8 dientes de ajo, finamente picados", "1 cucharada de miel", "2 x 400 g de tomates picados", "½ cucharada de caldo de verduras en polvo", "puñado de cilantro fresco, toscamente picado, para adornar", "Cuscús 250 g / 9 oz", "500ml / 18fl oz de caldo de pollo caliente", "400 g de garbanzos de lata, escurridos y enjuagados", "1 cebolla roja pequeña, muy finamente picada", "1 granada, semillas retiradas", "1 apio en barra, finamente picado", "1 cucharada de menta fresca rallada", "2 cucharadas de perejil de flatillo finamente picado", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida"], "method": ["Para hacer el tagine, mezcle todas las especias en un tazón pequeño.", "Coloque las piezas de cabra en un tazón grande, agregue la mitad de la mezcla de especias y mezcle hasta que las piezas de cabra estén bien cubiertas.", "Cubra y coloque en la nevera durante 1-2 horas para permitir que las especias impregnen la carne.", "Mientras tanto, para hacer la ensalada, remoje el cuscús en el caldo de pollo hasta que esté suave y tierno.", "Coloque los garbanzos en un recipiente y revuelva aproximadamente con un tenedor. Doble el cuscús con la cebolla roja, las semillas de granada, el apio, la menta y el perejil.", "Batir el jugo de limón y el aceite de oliva en un tazón pequeño y sazonar con sal y pimienta.", "Dobla el aderezo en la ensalada y déjalo a temperatura ambiente para permitir que se desarrollen los sabores.", "Una vez que la carne de cabra se haya marinado, coloque los albaricoques y las pasas en un recipiente y cubra con agua hirviendo.", "Caliente el aceite en una sartén grande y de lados altos a fuego alto, agregue las piezas de cabra y fría hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue las cebollas y el ajo a la sartén y fría por un minuto a fuego lento, luego agregue la mezcla de especias restante y fría hasta que las cebollas estén blandas. Agregue los albaricoques y las sultaninas y el líquido de remojo, junto con la miel, los tomates y el caldo en polvo.", "Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos hasta que la salsa se haya espesado y reducido.", "Agregue las piezas de cabra y mezcle hasta cubrir la salsa, luego la mitad cubra con una tapa.", "Cocine muy suavemente durante una hora y media si utiliza carne de cabrito, y dos horas y 45 minutos, si usa cabra, hasta que la carne esté bien cocida y tierna, pero manteniendo su forma.", "Dejar reposar durante 10 minutos, luego esparcir sobre el cilantro y servir en platos con la ensalada de cuscús."], "url": "www_bbc_co_uk_food_recipes_moroccan_goat_tagine_09469", "title": "Tagine marroquí de cabra con ensalada de cuscús", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz harina de pan blanco muy fuerte, más extra para espolvorear", "4 cucharaditas de levadura seca de acción rápida", "2 cucharaditas de sal de mesa", "3 cucharadas de aceite de oliva, más extra para engrasar", "aceite de oliva, para freír", "1 cebolla blanca grande, finamente picada", "100g / 3½oz de puré de tomate", "1 cucharadita de pasta harissa", "10 hebras de azafrán", "Aceitunas negras sin hueso de 150 g / 5½ oz, picadas", "125g / 4½oz de queso de cabra suave con toda su grasa", "200g / 7oz de habas enlatadas, escurridas", "1 limón, solo jugo", "4 cucharadas de aceite de oliva", "1 cucharadita de sal marina en copos", "1 cucharadita de comino molido", "1 cucharadita de pimentón", "1 huevo de gallina, batido con un chorrito de leche para lavar huevos", "menta pequeña, finamente picada"], "method": ["Para el pan, en un tazón grande mezcle la mitad de la harina y la mitad de la levadura y 475 ml / 17 fl oz de agua tibia para formar una masa. Reserve en una habitación cálida durante 30 minutos.", "Cuando el iniciador se haya levantado y burbujee, agregue la harina restante, la levadura, la sal y el aceite. Mezcle hasta que se hayan incorporado todos los ingredientes secos.", "Extienda la masa sobre una superficie de trabajo engrasada y amasar durante 10 minutos o hasta que la masa esté suave y elástica.", "Engrase un tazón grande y agregue la masa. Cubra con una película adhesiva y déjela a un lado en un lugar cálido durante una hora para probar, debe aproximadamente duplicar su tamaño.", "Mientras tanto, haz el relleno para el pan. Calentar un poco de aceite de oliva en una sartén. Cuando esté caliente, agregue la cebolla y cocínela hasta que empiece a dorarse. Retire del fuego y agregue el puré de tomate, harissa, azafrán y cuatro cucharadas de agua. Revuelva para hacer una pasta, luego reserve para enfriar.", "Para el pan, cuando la masa ha doblado su tamaño, ligeramente harina una superficie de trabajo. Voltee la masa probada y divídala en cuatro porciones iguales (use un raspador de masa o un cuchillo de pan serrado para ayudarlo).", "Estirar la masa en forma de rectángulo largo, aproximadamente 10x50 cm / 4x20 pulgadas y aproximadamente 5 mm / ¼ de grosor.", "Extienda el relleno sobre la masa, dejando un borde de 2 cm / ¾ pulg alrededor del borde. Cubra con las aceitunas y el queso de cabra.", "Enrolle bien las porciones de masa longitudinalmente para formar formas de salchicha de unos 50 cm de largo. Usando los dedos, pellizque a lo largo de la unión para asegurarse de que el relleno permanezca adentro.", "Ahora se pueden alargar los rollos de masa dibujando la masa hasta que tenga unos 80 cm de largo.", "Para formar la trenza, coloque las cuatro piezas de masa en forma sobre una superficie de trabajo ligeramente enharinada adyacente a la otra. Únete a los hilos de masa en un extremo. Ahora estás listo para trenzar la masa.", "Numerar los hilos de la masa 1-4 de izquierda a derecha. Ponga el hilo cuatro en la posición dos, luego mueva el hilo uno a la posición tres, finalmente coloque el hilo dos sobre tres. Repita hasta que la trenza haya terminado.", "Engrasar y ligeramente una bandeja grande para hornear plana. Coloque un anillo de chefs, de unos 15 cm de diámetro, en el centro y unte un poco de grasa en el exterior (si no tiene un anillo de cocinero, puede usar un plato pequeño a prueba de horno).", "Coloque la masa en la bandeja de hornear y envuélvala alrededor del anillo de metal. Une los extremos para formar un anillo. Cúbralo con holgura y déjelo a un lado para probar nuevamente por aproximadamente 45 minutos, o hasta que la masa haya aumentado de tamaño.", "Mientras tanto, haz la inmersión bessara. Coloque todos los ingredientes y cuatro cucharadas de agua en un procesador de alimentos y mezcle hasta que quede suave (la consistencia debe ser bastante acuosa). Vierta la salsa en una cacerola y reserve.", "Precalentar el horno a 220C / 425F / Gas 7.", "Cuando la trenza haya probado, cepíllala con el huevo batido y hornea por 20 minutos, luego reduce la temperatura a 200C / 400F / Gas 6 y hornea por otros 25 minutos.", "Retire del horno y deje enfriar en una rejilla de alambre.", "Mientras el pan se está enfriando, caliente la salsa en la cacerola.", "Para servir, coloque el pan en una tabla con un tazón pequeño (o tagine) en el centro. Vierta la inmersión caliente en el recipiente. Decore el pan y sumerja con un poco de menta picada."], "url": "www_bbc_co_uk_food_recipes_moroccan_plaited_loaf_51517", "title": "Pan trenzado marroquí con una salsa Bessara", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan grande trenzado", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 berenjenas pequeñas", "aerosol de aceite de cocina controlado en calorías", "½ cebolla mediana, finamente picada", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "¼ cucharadita de chile en polvo", "pellizcar canela molida", "227g / 8oz de tomates picados en lata", "½ pimiento rojo, sin semillas y cortado en cubitos", "1 calabacín mediano, cortado en trozos de 1.5cm / ½ en", "Garbanzos de hojalata de 400g / 14oz, escurridos y enjuagados", "2 cucharadas colmadas de cilantro fresco toscamente picado, más extra para decorar", "400ml / 14fl oz de caldo de verduras, hecho con ½ cubo de reserva", "½ limón pequeño, solo jugo", "15 g / ½ oz de pistachos toscamente picados (alternativamente usar almendras copos tostados)", "100g / 3½oz de yogur natural sin grasa, para servir", "½ cubo de caldo de verduras", "80g / 2¾oz de cuscús integral", "½ limón pequeño, ralladura fina únicamente", "2 cucharadas colmadas de cilantro fresco toscamente picado", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Corta las berenjenas por la mitad de arriba hacia abajo y marca en un patrón cruzado a través de la carne. Coloque en una bandeja pequeña para hornear y rocíe con aceite. Sazonar con un poco de pimienta negra y hornear durante 30-40 minutos o hasta que esté muy tierno y ligeramente dorado.", "Mientras tanto, rocíe una sartén grande antiadherente con aceite y coloque a fuego medio. Agregue la cebolla y cocine por cinco minutos, revolviendo regularmente hasta que esté suave y ligeramente dorado. Agregue el comino, el cilantro, el chile y la canela y cocine por unos segundos, revolviendo constantemente.", "Vierta los tomates en la sartén. Agregue la pimienta, el calabacín, los garbanzos, el cilantro y el caldo. Sazone con un poco de sal y mucha pimienta negra molida y cocine a fuego lento. Cocine por alrededor de 20 minutos, revolviendo ocasionalmente hasta que los vegetales estén tiernos y la salsa espesa.", "Justo antes de que la salsa esté lista, prepare el cuscús. Disuelva el cubo de reserva en 100 ml / 3½ fl oz de agua recién hervida en un tazón mediano. Agregue el cuscús, cúbralo y descanse durante tres minutos. Agregue la ralladura de limón, el cilantro y la sazón al gusto. Mezcle bien juntos, usando un tenedor para romper los cúmulos de cuscús.", "Divida las berenjenas entre cuatro platos. Revuelva el jugo de limón en los garbanzos y sazone al gusto. Con una cuchara los garbanzos especiados sobre las berenjenas. Agregue el cuscús y espolvoree con nueces picadas. Adorne con cilantro y yogur."], "url": "www_bbc_co_uk_food_recipes_moroccan_vegetables_with_52330", "title": "Vegetales marroquíes con cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan_vegetables_with_52330_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1x1.5-2kg / 3½-4lb de pollo, unidas en 8 piezas (o puedes usar un paquete de 8 muslos y muslos)", "110g / 4oz de garbanzos secos", "175g / 6oz de arroz basmati marrón", "2 chiles frescos, cortados a la mitad, sin semillas y finamente picados", "1 semillas de comino de tsp redondeadas", "1 cucharada de semillas de cilantro", "½ cucharadita de estambres de azafrán", "Paquetes de 2x15g o cilantro fresco de 30g / 1oz", "2 limones pequeños de piel fina", "2 pimientos amarillos grandes", "2 cebollas grandes", "3 dientes de ajo picados", "275ml / 10fl oz carton good stock de pollo", "150ml / 5fl oz de vino blanco seco", "50g / 2oz de aceitunas negras sin hueso", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Hay dos formas de lidiar con los garbanzos. Lo más fácil es meterlos en un tazón, cubrirlos con agua fría y dejarlos durante la noche o durante un mínimo de 8 horas. Pero, si se te escapa la mente, lo que puedes hacer es colocarlos en una olla, cubrirlos con agua fría y llevarlos a ebullición durante 10 minutos. Luego apague el fuego y déjelos remojar durante 3 horas. De cualquier manera, cuando quiera comenzar a preparar esta receta, los garbanzos deben hervir a fuego lento durante 20 minutos o hasta que estén tiernos.", "Mientras están hirviendo a fuego lento, coloque una sartén pequeña a fuego medio directo, agregue las semillas de comino y cilantro y revuelva en una sartén caliente durante unos 2-3 minutos o hasta que comiencen a bailar y cambiar de color. Luego remueva las semillas a una mano de almirez y mortero y aplastelas groseramente y transfiéralas a un plato. A continuación, triture los estambres de azafrán en polvo con la mano y el mortero, luego exprima el jugo de uno de los limones y añádalo al azafrán, revolviendo bien.", "Luego prepare el pollo al aderezar las juntas con sal y pimienta. Corta los pimientos por la mitad, quita las semillas y la médula y corta cada mitad en pedazos grandes. Las cebollas se deben cortar aproximadamente del mismo tamaño que los pimientos. Ahora caliente 1 cucharada de aceite de oliva en la cazuela a prueba de llamas y, cuando esté muy caliente, dore las piezas de pollo en todos los lados - no sobrecargue la sartén; lo mejor es hacerlo en dos lotes, cuatro piezas a la vez.", "Después de eso, retire las piezas de pollo a un plato, luego agregue la segunda cucharada de aceite y coloque el fuego en su posición más alta. Cuando el aceite esté muy caliente, agregue los pimientos y las cebollas y cocínelos con aceite caliente, moviéndolos hasta que sus bordes queden levemente ennegrecidos, esto demorará unos 5 minutos, luego baje la temperatura. Quita las hojas de cilantro de los tallos, envuélvelas en un pedazo de film transparente y guárdalas en la nevera. A continuación, corta los tallos de cilantro finamente y agrégalos a los pimientos y las cebollas, junto con el ajo, los chiles, las especias trituradas, los garbanzos y el arroz, luego dale un buen revolcón para distribuir todos los ingredientes.", "Sazonar bien con sal y pimienta, luego combinar la mezcla de limón y azafrán con el caldo y el vino, verter todo en la cazuela y remover bien. Corte el limón restante en rodajas finas y empuje bien en el líquido. Ahora esparce las aceitunas y, finalmente, coloca los trozos de pollo encima de todo. Cubra con una tapa hermética y coloque en el horno precalentado durante una hora o hasta que el arroz y los garbanzos estén tiernos. Luego, justo antes de servir, esparza las hojas de cilantro en la parte superior y sirva directamente sobre los platos calentados."], "url": "www_bbc_co_uk_food_recipes_moroccanbakedchicken_66018", "title": "Pollo al horno marroquí con garbanzos y arroz", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla grande, finamente rebanada", "1 diente de ajo, aplastado", "2 cucharaditas de jengibre fresco rallado", "1 cucharadita de comino molido", "1 cucharadita de cúrcuma", "1 ramita de canela", "pizca de cayena", "400 g / 14 oz pueden cortar los tomates de ciruela", "pizca de sal", "Filetes de pescado blancos firmes de 500 g / 1 lb 2 oz (bacalao, pargo o lenguado) cortados en trozos", "400 g / 14 oz pueden garbanzos, enjuagados y escurridos", "2 cucharaditas de miel", "sal y pimienta negra recién molida", "hojas frescas de cilantro", "almendras copos, ligeramente tostados"], "method": ["Caliente el aceite de oliva en una sartén grande de base pesada a fuego medio. Agregue la cebolla y cocine, revolviendo ocasionalmente, durante cinco minutos, o hasta que la cebolla esté transparente.", "Agregue el ajo, el jengibre, el comino, la cúrcuma y la ramita de canela y cocínelos durante dos minutos, revolviendo regularmente.", "Agregue la pimienta de cayena, los tomates, la sal y 250 ml / 9 onzas de agua y cocine, revolviendo con frecuencia, durante diez minutos.", "Agregue el pescado y cocine a fuego lento durante cinco minutos, o hasta que el pescado esté casi cocido y tierno.", "Agregue los garbanzos y la miel y cocine durante 2-3 minutos más, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, saque la tagine en tazones y decore con hojas de cilantro frescas y almendras en copos."], "url": "www_bbc_co_uk_food_recipes_moroccanfishstew_84341", "title": "Guiso de pescado marroquí", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanfishstew_84341_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja, finamente picada", "2 dientes de ajo, finamente picados", "2 cucharadas de aceite de cacahuete", "1 cucharadita de semillas de comino entero", "1 cucharadita de jengibre", "1 ramita de canela", "1 limón en conserva o limón normal, picado", "12 aceitunas verdes, apedreado y toscamente picadas", "1 cucharada de harissa casera (ver abajo)", "125ml / 4fl oz de vino blanco", "200ml / 7fl oz de caldo de pescado", "1 pizca de azafrán", "500g / 1lb 2oz de pescado firme mezclado, como rape, perlón, caballa", "Mejillones 200g / 7oz", "100g / 3½oz de tomates cherry", "cuscús y cilantro para servir", "3 chiles rojos frescos, toscamente picados", "3 dientes de ajo, finamente picados", "1-2 limones, solo jugo", "4 cucharadas de aceite de oliva", "sal", "pimienta negra recién molida"], "method": ["Caliente el aceite de nuez molido en un tagine y cocine suavemente la cebolla y el ajo hasta que estén blandos.", "Agregue el comino, el jengibre, la ramita de canela, el limón en conserva y las aceitunas verdes y cocine durante dos minutos.", "Para hacer que el harrissa ponga los chiles, el ajo, el jugo de limón y el aceite de oliva en un procesador de alimentos y mezcle en una pasta áspera.", "Agregue la harissa y cocine por un minuto.", "Agregue el caldo de vino y pescado y el azafrán y cocine a fuego lento.", "Agregue el pescado y cocine por un par de minutos, luego agregue los mejillones y los tomates cherry, sazone con sal y pimienta y cubra. Cocine suavemente durante 6-7 minutos.", "Servir en una cama de cuscús cocido al vapor y espolvorear con cilantro recién picado."], "url": "www_bbc_co_uk_food_recipes_moroccanfishtaginewi_71274", "title": "Tagine de pescado marroquí con cuscús de cilantro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7¼ oz de harina común", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de canela molida", "agua, para unir", "pizca de sal", "1 diente de ajo, finamente picado", "2 cucharaditas de comino molido", "2 cucharaditas de tomillo, picado", "75ml / 2½fl oz de aceite de oliva", "1 filete de pierna de cordero", "1 berenjena, en rodajas", "1 calabacín en rodajas", "1 pimiento asado de un tarro", "50g / 1¾oz de tomates secados al sol", "100 g de aceitunas herbadas herby, empedradas", "1 limón, solo jugo", "Cohete de 100g / 3½ oz", "4 chiles rojos grandes", "6 dientes de ajo", "25g / 1oz de cilantro fresco", "1 limón, jugo y ralladura solamente", "aceite de oliva"], "method": ["Para hacer el pan plano, mezcle los ingredientes secos y agregue agua hasta que se forme una masa firme.", "Divida la masa en seis y extienda los panes planos finamente.", "Cocine en un recipiente muy caliente, seco y antiadherente durante un minuto en cada lado o hasta que aparezcan manchas marrones en ambos lados.", "Ahora haz el relleno. Coloque el ajo, el comino, el tomillo y una cucharada de aceite de oliva en un tazón y cubra bien el filete de cordero. Déjalo marinar durante una hora.", "Mientras tanto, cepille los calabacines y las berenjenas con aceite de oliva. Planche en una sartén caliente hasta que las verduras estén blandas y doradas. Dejar de lado.", "A continuación, coloque el filete de cordero en la plancha caliente y cocine por unos minutos a cada lado. Retirar del fuego y dejar enfriar un poco, luego cortar en rodajas finas.", "Mezcle las verduras a la parrilla, la pimienta asada y los tomates secados al sol en otro recipiente con las aceitunas y vierta el aceite de oliva restante y el jugo de limón sobre ellos.", "Ahora haz la harissa. Con una batidora de mano, licúa los chiles, el ajo y el cilantro con el jugo de limón y aceite de oliva suficiente para obtener una consistencia de mayonesa. Sazone al gusto.", "Coloque dos panes planos en un plato y agregue un par de cucharadas de verduras asadas a cada uno. Agregue el cordero en rodajas, luego un poco de cohete y luego una cucharada de salsa Harissa. Repita con los panes planos restantes.", "Enrolle los panes planos y córtelos a la mitad. Sirva las mitades alrededor de una pila de cohetes rociados con el aderezo harissa."], "url": "www_bbc_co_uk_food_recipes_moroccanflatbreadwra_72278", "title": "Rollos de pan plano marroquí con harissa", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanflatbreadwra_72278_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo pequeño, unido en pedazos", "2 cucharadas de aceite de oliva", "1 limón en conserva, lavado y picado, solo piel y médula", "1 diente de ajo, aplastado", "1 cucharadita de comino molido", "1 cucharadita de cúrcuma", "1 cucharada de pimentón", "1 cucharadita de hojuelas de chile molido", "4 cucharadas de cilantro picado", "4 cucharadas de perejil picado", "3 cebolletas, finamente picadas", "3-4 cucharadas de conservas de salmuera de limón"], "method": ["Recorte las piezas de pollo con cuidado y combine con el resto de los ingredientes del adobo en un recipiente espacioso. Cúbralo sin apretar y déjelo en un lugar fresco por unas horas, de la noche a la mañana si es posible.", "Precalentar la parrilla o la barbacoa. Debe ser moderadamente caliente. Sacuda el exceso de humedad de las uniones de pollo y la parrilla hasta que los jugos salgan limpios, pruebe a través de la parte más gruesa con un pincho. Mientras tanto, combine los ingredientes para la salsa de inmersión y déjelos en infusión.", "Sirva el pollo a la parrilla con la salsa para mojar en el lado."], "url": "www_bbc_co_uk_food_recipes_moroccangrilledchick_7323", "title": "Pollo marroquí a la parrilla con limón en conserva", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccangrilledchick_7323_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de cúrcuma", "1 cucharadita de comino", "½ cucharadita de canela molida", "1 filete de pierna de cordero, cortado en 2 piezas", "aceite de oliva, para lloviznar", "¼ de cebolla roja picada", "½ pimiento rojo, picado", "1 diente de ajo, finamente picado", "1 lima, solo jugo", "20 g / 1 oz de cebollín fresco, cortado en 2 en piezas", "sal y pimienta negra recién molida", "2 hojas de vid al vacío en salmuera, trituradas, para decorar"], "method": ["Mezcle las especias y enrolle los filetes de cordero en las especias y rocíe con el aceite de oliva.", "Caliente una sartén hasta que esté caliente, agregue el cordero y cocínelo durante 3-4 minutos por cada lado. Retire el cordero y manténgalo caliente.", "Agregue a la sartén la cebolla roja, el pimiento rojo y el ajo, y cocínelos durante dos minutos.", "Agregue el jugo de lima y el cebollín y cocine por otros dos minutos. Agregue el cordero y caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la salsa en un plato, cubra con el cordero y adorne con las hojas de vid cortadas."], "url": "www_bbc_co_uk_food_recipes_moroccanlambsteakswi_82141", "title": "Filetes de cordero marroquí con salsa picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de pimienta de cayena", "2 cucharaditas de pimienta negra molida", "1½ cucharada de pimentón", "1½ cucharada de jengibre molido", "1 cucharada de cúrcuma", "2 cucharaditas de canela molida", "1 x hombro de cordero, cortado y cortado en trozos de 5cm / 2in (alrededor de 1.1kg / 2½lb de carne en total)", "2 cebollas grandes, ralladas", "2 cucharadas de aceite de oliva", "2 cucharadas de aceite de argán", "3 dientes de ajo, aplastados", "570ml / 1 pinta de jugo de tomate", "2 x 400 g de tomates picados en lata", "Albaricoques secos de 115 g / 4 oz, cortados por la mitad", "Fechas de 55g / 2oz, cortadas a la mitad", "55g / 2oz sultanas o pasas", "Almendras en copos de 85g / 3oz", "1 cucharadita de estafados de azafrán, empapados en agua fría", "600 ml / 1 pinta de caldo de cordero", "1 cucharada de miel clara", "2 cucharadas de cilantro, más o menos picadas", "2 cucharadas de perejil de hoja plana, más o menos picado", ""], "method": ["Coloque la pimienta de Cayena, pimienta negra, pimentón, jengibre, cúrcuma y canela en un tazón pequeño y mezcle para combinar. Coloque el cordero en un tazón grande y mezcle con la mitad de la mezcla de especias. Cúbralo y déjelo toda la noche en la nevera.", "Precalentar el horno a 150C / 300F / Gas2.", "Caliente 1 cucharada de aceite de oliva y 1 cucharada de aceite de argán en una cazuela grande. Agregue la cebolla rallada y la mezcla de especias restante y cocine a fuego lento durante 10 minutos para que las cebollas estén suaves pero no coloreadas. Agregue el ajo picado durante los últimos 3 minutos.", "En una sartén separada, caliente el aceite restante y dore los cubos de cordero en todos los lados, luego agregue la carne dorada a la cazuela. De glasear la sartén con ¼ de litro de jugo de tomate y agregar estos jugos a la sartén.", "Agregue el jugo de tomate restante, tomates picados, albaricoques, dátiles, pasas o sultaninas, almendras en copos, azafrán, caldo de cordero y miel a la cacerola. Llevar a ebullición, cubrir con una tapa ajustada, colocar en el horno y cocinar durante 2-2 ½ horas o hasta que la carne esté tierna y tierna.", "Coloque el cordero en un tagine o plato grande y espolvoree sobre las hierbas picadas. Servir."], "url": "www_bbc_co_uk_food_recipes_moroccanlambtagine_6696", "title": "Marroquí cordero tagine", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanlambtagine_6696_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "8 dientes de ajo, pelados y aplastados", "4 cebollas, peladas y picadas", "4 cucharaditas de jengibre fresco rallado", "1½ cucharadas de semillas de cilantro, trituradas", "3 cucharaditas de canela molida", "sal marina y pimienta negra recién molida", "Paletilla de cordero de 3kg / 7lb, deshuesada, sin grasa y cortada en cubos de 4cm / 1½ pulgadas", "2 cucharadas de puré de tomate", "Tomates maduros de 2kg / 4½lb o tomates de 4 X 400g / 14oz, cortados en trozos gruesos", "4-5 cucharadas de miel", "1 granada grande o 2 pequeñas", "800g / 1¾lb de cuscús", "6 cucharadas de aceite de oliva", "2 limones, solo jugo", "1 litro / 1¾ pintas de caldo de pollo hirviendo o agua", "sal marina y pimienta negra recién molida", "4 cucharadas de menta fresca picada o cilantro", "1 lima, cortada en cuñas", "tazón de yogur griego"], "method": ["Precalentar el horno a 160C / 325F / Gas 2.", "Para el tagine de cordero, caliente una cazuela grande a prueba de horno o una cacerola pesada a fuego medio a alto.", "Agregue el aceite de oliva, el ajo, la cebolla, el jengibre y las especias y sazone con sal marina y pimienta negra recién molida. Revuelva, luego cocine, cubierto, a fuego lento durante unos diez minutos, hasta que las cebollas estén suaves.", "Agregue el cordero, el puré de tomate, los tomates picados y la miel en la cacerola, revuelva bien.", "Llevar a fuego lento y colocar en el horno durante 1 hora y media, hasta que el cordero esté tierno.", "Retire la tapa de la olla a la mitad del tiempo de cocción para que el líquido se reduzca y espese.", "Si la salsa aún es un poco delgada, coloque la cacerola en la placa a fuego medio y sin la tapa. Revuelva de vez en cuando y deje que el líquido se reduzca hasta que comience a aparecer una salsa espesa.", "Mientras tanto, para el cuscús, corte las granadas a la mitad y retire las semillas con una cucharilla y retire la membrana blanca alrededor de las semillas.", "Coloque el cuscús en un recipiente y mezcle el aceite de oliva y el jugo de limón.", "Vierta el caldo hirviendo o agua en el cuscús y sazone con sal marina y pimienta negra recién molida.", "Permita que el cuscús se siente en un lugar cálido durante 5-10 minutos hasta que el líquido haya sido absorbido.", "Mezcle las hierbas picadas y las semillas de granada en el cuscús.", "Para servir, coloque el tagine en platos para servir con cuscús y una rodaja de limón. Sirva junto a un tazón de yogurt griego grueso."], "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_84062", "title": "Tagine de cordero marroquí con cuscús de limón y granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12-14", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanlambtaginewi_84062_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "½ pimiento rojo, picado", "1 diente de ajo, finamente picado", "1 filete de cordero, cortado en trozos del tamaño de un bocado", "Pizca de canela", "1 cucharada de pasta de tomate", "½ cucharadita de comino molido", "pellizcar jengibre molido", "½ cucharada de miel", "1 cubo de carne de res, desmenuzado", "110 g / 4 oz de frijoles mezclados de una lata, escurridos y enjuagados", "4 cucharadas de cilantro fresco, aproximadamente picado", "sal y pimienta negra recién molida", "250g / 9oz de cuscús, cocinado según las instrucciones del paquete", "2 limones, solo jugo", "pequeño racimo de cilantro fresco, toscamente picado", "menta fresca de manojo pequeño, toscamente picada", "2 limones, pinchados con un tenedor", "6 cucharadas de sal de roca", "250ml / 10 fl oz de agua"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue el cordero y fría por 2-3 minutos, o hasta que se dore por todos lados.", "Agregue la cebolla y el pimiento a la sartén y cocine a fuego medio durante tres minutos, asegurándose de que las verduras no se doren.", "Suba a un fuego más alto y agregue los ingredientes restantes, a excepción de los frijoles y el cilantro, y cocine a fuego lento durante 10 minutos, o hasta que la carne esté bien cocida.", "Agregue los frijoles y el cilantro, revuelva, apague el fuego y sazone, al gusto, con sal marina y pimienta negra recién molida.", "Mientras tanto, para el cuscús, coloque todos los ingredientes en un tazón y cuézalos bien, condimente, al gusto, con sal marina y pimienta negra recién molida.", "Para los limones, caliente el agua hasta que hierva. Agregue la sal y los limones pinchados y cocine a fuego lento durante 15 minutos, luego drene y deje enfriar antes de cortar cada uno en cuartos y servir con el tagine."], "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_84105", "title": "Tagine de cordero marroquí con limones en vinagre y cuscús con hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mantequilla de 25g / ¾oz", "2 cucharadas de azúcar en polvo", "1 plátano, cortado en trozos grandes", "110 g / 4oz de pasta de filo lista para usar", "Mantequilla 110g / 4oz, derretida", "2 cucharaditas de canela molida", "4 cucharaditas de azúcar en polvo", "Albaricoques secos 125 g / 4½ oz", "40 g / 1½ oz de almendras enteras, picadas", "2 cucharadas de miel", "1 naranja, solo ralladura", "2 cucharaditas de azúcar glas", "helado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén hasta que esté caliente, luego agregue la mantequilla y el azúcar en polvo.", "Agregue los plátanos y fría hasta que estén dorados, luego déjelos a un lado y déjelos enfriar.", "Coloque una hoja de hojaldre en una bandeja para hornear y cepille generosamente con un poco de mantequilla derretida. Polvo con media cucharadita de canela molida y una cucharadita de azúcar impalpable.", "Repita esta capa y espolvoree con una segunda, tercera y cuarta capa de pasta filo, mantequilla, canela y azúcar.", "Coloque los plátanos a lo largo de la mitad de la hoja de filo superior.", "Coloque los albaricoques, las almendras, la miel y la ralladura de naranja en un tazón y mezcle bien. Vierta la mezcla de albaricoque sobre la parte superior de los plátanos.", "Doble los lados de la masa de filo sobre el relleno y gírelo, de modo que la unión quede debajo.", "Unta con más mantequilla derretida y polvo con azúcar glas.", "Coloque en el horno y hornee por 15 minutos, o hasta que el filo esté crujiente y dorado.", "Para servir, corte el paquete de filo en trozos y sirva con una cucharada de helado."], "url": "www_bbc_co_uk_food_recipes_moroccanstylebananaa_84657", "title": "Paquete filo de plátano, albaricoque y canela de estilo marroquí", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla picada", "Pierna magra de cordero 900g / 2lb, cortada en cubitos", "sal y pimienta negra recién molida", "½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "1 ramita de canela", "½ cucharadita de comino molido", "1 cucharadita de jengibre", "pellizque los hilos de azafrán, empapados en 1 cucharada de agua", "12 ciruelas pasas, empapadas en agua tibia", "4 cucharadas de miel clara", "1 cucharadita de agua de flor de naranja (o al gusto)"], "method": ["Calienta dos cucharadas de aceite de oliva en una sartén grande con tapa. Agregue la cebolla picada y el cordero cortado en cubitos y cocine hasta que la carne esté coloreada por todos lados.", "Vierta suficiente agua sobre la carne para cubrir.", "Agregue otras dos cucharadas de aceite de oliva, la sal, pimienta negra recién molida, cilantro molido, canela molida, canela, comino molido, jengibre, azafrán y agua con azafrán a la carne en la sartén y deje que hierva.", "Baje la temperatura, ponga la tapa y deje que la carne hierva a fuego lento durante aproximadamente dos horas.", "Agregue las ciruelas pasas remojadas y deje hervir a fuego lento por otros 20 minutos.", "Agregue la miel y espolvoree el tagine con agua de naranja y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_85679", "title": "Tagine de cordero marroquí con ciruelas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]