[{"isVegetarian": true, "title": "Christmas popcorn", "url": "www_bbc_co_uk_food_recipes_christmas_popcorn_55253", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_popcorn_55253_16x9.jpg", "ingredients": ["1 tsp vegetable oil", "50g/1¾oz popcorn", "2 tbsp cocoa", "1 tsp ground ginger", "3 oranges, zest only", "3 tbsp runny honey"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil for 20-30 seconds over a medium heat in a large lidded saucepan. Add the popcorn, cover with a lid and cook for a few minutes, until it has all popped, giving it a shake halfway through. ", "Tip the popcorn into a bowl. While it is still hot, sieve over the cocoa and ginger, then sprinkle over the orange zest and drizzle on the honey. Mix well and serve."]}, {"isVegetarian": false, "title": "Christmas porchetta", "url": "www_bbc_co_uk_food_recipes_christmas_porchetta_19448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3kg/6lb 8oz pork loin, boned and butterflied (alternatively use pork belly or shoulder)", "salt and freshly ground black pepper", "2 lemons, zest only", "15g/½oz parmesan, grated", "175g/6oz pork mince", "175g/6oz chicken livers, roughly chopped", "150g/5½oz onions, finely chopped", "5g fresh sage, leaves picked and chopped", "8g fresh rosemary, leaves picked and chopped", "8g fresh thyme, leaves picked", "350g/12oz bread, soaked in 200ml/7fl oz water and broken into small pieces", "15g/½oz pine nuts", "30g/1oz sultanas", "6 slices mortadella with pistachios (about 200g/7oz)", "dash olive oil", "4 carrots", "1 onion", "250ml/9fl oz white wine", "70ml/2¼fl oz Vin Santo", "3 tbsp olive oil ", "1kg/2lb 4oz potatoes, peeled and cut into quarters, par-boiled", "4 sprigs fresh rosemary", "6 garlic cloves, skin on, smashed"], "serves": "Serves 8-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Season the pork with salt and pepper and rub it into the pork, along with the lemon zest.", "Place the parmesan, pork mince, chicken livers, onions, sage, rosemary, thyme, bread, pine nuts and sultanas, in a large bowl and mix.", "Spread the filling on top of the loin and roll onto one side. Cover with two slices of mortadella and then roll halfway along.", "Pull in the other side of the lion, add the rest of the filling, then press down and put on four slices of mortadella. Roll  to secure and tie with kitchen string. Rub with olive oil and season with salt and pepper.", "Place the whole carrots and onion, the wine, Vin Santo and 125ml/4fl oz of water in the bottom of baking tray and place the pork on top.", "Cook in the oven for 30 minutes and then turn the oven down to 150C/300F/Gas 3 for three hours.", "For the rosemary and garlic sautéed potatoes, heat a large frying pan and add the oil. Once hot, add the potatoes and cook for a couple of minutes. Add the rosemary and garlic and cook until the potatoes are crisp and cooked through.", "To serve, place the pork and potatoes in the centre of the table and let people help themselves."]}, {"isVegetarian": true, "title": "Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_41498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_41498_16x9.jpg", "ingredients": ["350g/12oz mixed dried fruit (raisins, currants, sultanas)", "100g/3½oz pitted ready-to-eat prunes, chopped or left whole", "100g/3½oz dark muscovado sugar", "4 tbsp dark rum", "100ml/3½fl oz stout ", "100g/3½oz chopped walnuts", "100g/3½oz blanched almonds", "100g/3½oz ground almonds", "100g/3½oz fresh white breadcrumbs", "50g/1¾oz plain flour", "100g/3½oz frozen butter, grated, plus a little extra for greasing", "½ tsp freshly grated nutmeg", "1 tsp ground cinnamon", "2 tsp mixed spice", "100g/3½oz chopped glacé cherries (or left whole if you prefer)", "3 large free-range eggs, beaten"], "serves": "Makes 1 x 1.2 litre/2 pint pudding", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the mixed fruit, prunes, muscovado sugar, rum and stout in a mixing bowl. Stir well to mix, cover and leave for 24 hours to soak.", "After 24 hours, mix the walnuts, almonds, ground almonds, breadcrumbs, flour, butter, spices, cherries and eggs along with the soaked fruit mixture in a large mixing bowl, making sure you include all the soaking liquor from the soaked fruit. Mix well until completely combined (let all the members of the family have a stir and make a wish). ", "Cover with cling film and leave to stand in a cool place for 24 hours.", "After 24 hours, grease a 1.2 litre/2 pint pudding basin with butter. Cut a circle of baking paper and place into the bottom of the pudding basin and then grease it with a little more butter. Pack the pudding mixture into the pudding basin, pressing as you add it. Fold a pleat into the middle of a large piece of baking paper and place over the pudding. Cover with a large piece of pleated foil, ensuring the pleats are on top of one another. Secure tightly with kitchen string tied under the lip of the pudding basin.", "Place an upturned saucer into a large saucepan one-quarter full of water. Fold a long piece of foil into quarters lengthways to create a long strip and place the pudding basin in the middle of the strip. Bring the sides of the strip up the sides of the pudding basin and lower into the saucepan. Ensure the water in the saucepan comes one-third of the way up the side of the pudding basin, but nowhere near the top of the basin. Leave the ends of the foil strip hanging over the side to make it easy to remove the pudding later.", "Bring the water to the boil and then reduce the heat to a gentle simmer. Simmer gently for 5-6 hours, topping up the water level as necessary throughout cooking (do not allow the pan to dry out).", "Once the pudding is cooked, remove from the pan and set aside to cool. The pudding can be stored for up to two years in a cool, dry place. To serve, reheat the pudding by steaming again (in the same way) for two hours, or until hot all the way through. Alternatively, remove the foil and reheat in the microwave."]}, {"isVegetarian": true, "title": "Christmas pudding and sherry trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_and_px_59638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz leftover Christmas pudding", "8 fresh black figs, cut into quarters", "250ml/9fl oz Pedro Ximénez sherry ", "250g/9oz mascarpone", "250ml/9fl oz double cream", "icing sugar, to taste ", "150g/5½oz mixed crumbled pecans and toasted flaked almonds", "pinch ground cinnamon ", "100g/3½oz chocolate shavings, to decorate", "500ml/18fl oz full-fat milk ", "100ml/3½fl oz double cream", "1 vanilla pod, split in half lengthways", "6 egg yolks", "2 tsp cornflour", "50g/1¾oz brown sugar"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the trifle, break up the pudding into the bottom of a large serving dish or individual serving glasses. Top with the quartered figs and splash over the sherry.", "For the custard, heat the milk, cream and vanilla in a saucepan until just boiling. Remove from the heat and set aside to cool a little. In a bowl, whisk together the yolks, cornflour and sugar and then pour the warm milk mixture over (if the milk is too hot the eggs will scramble). Tip back into the pan and whisk over a low heat until thickened. Remove from the heat and strain. Cover the surface of the custard with baking paper to prevent a skin forming and set aside to cool.", "Beat the mascarpone and double cream with the icing sugar, to taste.", "Spoon the cooled custard over the soaked pudding and then top with the mascarpone cream. Decorate with crumbled pecans, almonds, cinnamon and chocolate shavings. Chill until ready to serve. "]}, {"isVegetarian": false, "title": "Christmas pudding fridge cake", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_fridge_58372", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_fridge_58372_16x9.jpg", "ingredients": ["250g/8oz digestive biscuits", "150g/5oz milk chocolate", "150g/5oz dark chocolate", "100g/3½oz unsalted butter", "150g/5oz golden syrup", "100g/3½oz dried apricots, chopped", "75g/2½oz raisins", "60g/2oz pecans, chopped ", "200g/7oz marshmallows, chopped into small pieces", "100g/3½oz white chocolate, broken into pieces", "2 glacé cherries", "sprig holly leaves"], "serves": "Makes 1 x 1.2 litre/2 pint pudding", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Use cling film to line a 1.2 litre/2 pint pudding bowl, leaving extra cling film hanging over the sides.", "Bash the biscuits into pieces using a rolling pin. (Put them in a plastic bag first so they don't go everywhere!)", "Melt chocolate, butter and golden syrup in a heatproof bowl set over a pan of simmering water. Stir occasionally.", "Remove the bowl from the heat and stir in the broken biscuits, apricots, raisins, pecans and marshmallows.", "Spoon the mixture into the bowl, pushing down well to minimise air pockets. ", "Leave to cool, then put in the fridge overnight to set.", "The next day, place the pudding bowl in a dish of hot water for a few seconds to loosen it from the pudding bowl. Place upside down on a serving plate. ", "Melt the white chocolate in a heatproof bowl set over a pan of simmering water. Allow to cool and thicken slightly before pouring some on the top of the pudding and gently pushing down to form a custard shape. ", "Top with the glacé cherries and holly and serve. "]}, {"isVegetarian": true, "title": "Christmas pudding ice cream with sautéd pineapple and a spiced caramel", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_ice_86469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg yolks", "120g/4½oz caster sugar", "250ml/9fl oz milk", "250ml/9fl oz double cream", "2 vanilla pods, split open and seeds scraped out", "200g/7oz cooked Christmas pudding, crumbled", "110g/4oz caster sugar", "1 star anise", "1 cinnamon stick", "pinch fresh nutmeg", "110g/4oz unsalted butter", "175ml/6fl oz double cream", "50g/1¾oz unsalted butter", "1 pineapple, peeled, cored and sliced into rounds"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Christmas pudding ice cream, whisk the egg yolks with 60g/2¼oz caster sugar until thick and creamy.", "Place the remaining caster sugar, milk, cream and vanilla seeds and pods in a pan and bring to the boil. Pour the hot milk into the whisked yolks and stir well.", "Return the mixture to the pan and cook over a very low heat, stirring constantly with a spatula, until the mixture is thick enough to coat the back of a spoon.", "Cool the vanilla mixture, then refrigerate for at least one hour. Strain the mixture into an ice cream maker and churn according to manufacturer's instructions. Just as the ice cream is soft enough to mix, stir in the Christmas pudding and freeze.", "For the spiced caramel, place the sugar, star anise, cinnamon and nutmeg into a frying pan and cook, without stirring, until the sugar is melted and just golden-brown.", "Whisk in the butter and double cream and bring to a simmer. Cook for 3-5 minutes, or until just thickened then pass through a fine sieve into a clean pan.", "For the sautéd pineapple, heat a large frying pan and add the butter. Once hot and melted, add the pineapple and cook for a couple of minutes on each side.", "To serve, place the cooked pineapple on serving plates with a spoonful of ice cream. Drizzle the caramel sauce over. "]}, {"isVegetarian": true, "title": "Christmas pudding soufflé", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_souffl_48184", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "500g/1lb 2oz cooked Christmas pudding", "400ml/14oz full-fat milk", "6 large free-range egg yolks", "8 large free-range egg whites", "icing sugar, for dusting", "brandy butter ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Melt half the butter and use it to grease a 2 litre/3½ pint soufflé dish.", "Put the Christmas pudding into a food processor and pulse to break it all up. Leave it in the food processor.  ", "Bring the milk to the boil in a small saucepan. Add to the Christmas pudding, blending it until it is well combined. Add the yolks to the mixture one at a time, blending between each addition.", "Beat the egg whites with a pinch of salt in a bowl until stiff peaks form when the whisk is removed from the bowl.", "Fold the beaten egg whites carefully into the Christmas pudding mixture. ", "Spoon the mixture into the dish and bake for 40 minutes. Take care not to burn the top. ", "Remove from the oven, dust with icing sugar and serve with brandy butter ice cream."]}, {"isVegetarian": false, "title": "Christmas pudding tart", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_tart_59676", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["270g/9½oz plain flour", "150g/5½oz unsalted butter, cold", "50g/1¾oz ground almonds", "1 lemon or orange, grated zest only", "1 vanilla pod, seeds only", "100g/3½oz icing sugar", "1 free-range egg", "1 free-range egg yolk", "175ml/6fl oz milk", "75g/2½oz double cream", "½ vanilla pod, seeds removed", "90g/3¼oz caster sugar", "75g/2½oz free-range egg yolks (about 4-5 yolks)", "15g/½oz cornflour", "15g/½oz plain flour ", "15g/½oz butter, melted", "150g/5½oz ground almonds", "115g/4oz demerara sugar", "175g/6oz unsalted butter", "85g/3oz plain flour", "1 lemon, zest only", "100g/3½oz blanched almonds ", "25g/1oz pine nuts", "125g/4½oz icing sugar", "30ml/1fl oz orange liqueur", "250g/9oz cranberry sauce", "25g/1oz caster sugar", "125g/4½oz mascarpone cheese", "100ml/3½fl oz double cream", "25g/1oz icing sugar", "2 tbsp almond-flavoured Italian liqueur, such as Amaretto", "pinch freshly grated nutmeg", "250g/9oz Christmas pudding", "30g/1oz sliced almonds", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, put all the pastry ingredients apart from the eggs in a food processor and pulse until the pastry has a texture like breadcrumbs. ", "Add the eggs and pulse until mixture starts to form a ball. Turn out onto a floured surface and work as little as possible until it is smooth. Form into a ball and flatten. Wrap in cling film and chill for at least three hours.", "For the pastry cream, place the milk, cream, vanilla pod and 60g/2¼oz of the sugar in a pan and bring to the boil.", "In a clean bowl whisk the yolks with the remaining sugar until pale.", "Mix the cornflour and flour into the yolk mix. Pour half of the milk onto the yolk mix and whisk well.", "Add the remaining milk, place back in the saucepan and cook until it thickens.", "Add the butter and mix it in. Pass through a fine sieve and cool. Cover with cling film and pierce with a fork to let out steam. Set aside in the fridge.", "For the crumble topping, in a bowl, rub together all the ingredients with your hands until it resembles breadcrumbs. Place to one side.", "For the crystallised almonds and pine nuts, place all the ingredients in a heavy-bottomed saucepan.", "Place on a moderate heat and stir until the sugar crystallises and coats all the almonds and pine kernels. You will notice a whitish powder forming on the sides of the pan. Stir this back into the pan as this starts the crystallising process. Stir until all the nuts are coated.", "Scatter onto a plate or baking tray and leave until cold. Store in an airtight container until needed.", "For the cranberry sauce purée, place all the ingredients with 75ml/2½fl oz water into a saucepan and bring to the boil. Taste, make sure it is sweet enough and then liquidise using a blender. Pass through a fine sieve and leave to cool, then store in a squeezy bottle until ready to use.", "For the mascarpone and amaretto cream, place all the ingredients in a mixing bowl and stir until the sugar is dissolved.", "Whisk until medium stiff peaks form when the whisk is removed from the bowl. Cover and store in the fridge until needed.", "To make the tart case, preheat the oven to 180C/350F/Gas 4.", "Grease four 12cm/4½in loose-bottomed tart tins. Use the pastry dough to line the tin and prick the base all over with a fork and leave to rest in the fridge for about 30 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Line the pastry with parchment paper and weigh down with uncooked rice or ceramic baking beans. Bake the pastry blind for 15 minutes, remove the paper and rice or beans and return the pastry cases to the oven for a few minutes more, until light golden-brown. ", "To make the filling, warm the Christmas pudding and add to the cool pastry cream with the almonds. Pipe the mixture into the tarts.", "Sprinkle with the almond crumble. Return to the oven and cook for 15 minutes, or until the crumble is golden-brown.", "Allow to cool a little, remove from the tins and dust with icing sugar", "To serve, place on the plate, dress with a little cranberry sauce purée, crystallised nuts and a scoop of mascarpone cream."]}, {"isVegetarian": true, "title": "Christmas pudding trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_47025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz madeira cake, sliced", "100–150ml/3½–5fl oz ginger wine or sherry", "250g/9oz Christmas pudding, cut into chunks.", "1 ripe mango, peeled and thinly sliced", "½ small pineapple, or 227g tin pineapple in own juice, diced", "500ml/18fl oz quality custard", "1 tbsp icing sugar", "300ml/10fl oz double cream", "50g/1¾oz flaked almonds", "1 orange, pared zest only"], "serves": "Serves 4–6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Arrange the madeira cake around the base of a trifle bowl. Pour over half the ginger wine, then press the Christmas pudding on top into any gaps. Add the remaining wine, but make sure the trifle doesn’t get too wet. Arrange the mango over the top, then the pineapple. ", "Pour over the custard and smooth using the back of a spoon. Refrigerate for 2 hours to allow the custard to set. ", "Meanwhile, sieve the icing sugar into the double cream and whisk until soft peaks. Pour over the trifle and smooth over.", "Lightly toast the almonds in a dry frying pan and set aside to cool. Decorate the trifle with the almonds and pared orange zest."]}, {"isVegetarian": true, "title": "Christmas pudding trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_58574", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_trifle_58574_16x9.jpg", "ingredients": ["400g/14oz leftover Christmas pudding (about half a large pudding)", "2 tbsp dry sherry", "400g tin pear halves in juice", "500g/1lb 2oz ready-made custard", "150g/5½oz mascarpone", "300ml/10fl oz whipping or double cream", "1 square of dark chocolate", "handful of flaked almonds (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Break the Christmas pudding into chunks and place it in the bottom of a trifle bowl in an even layer. Sprinkle over the sherry and 1 tablespoon of the pear juice. ", "Drain the pears and cut each one in half, then layer them on top of the cake. ", "Beat together the custard and mascarpone and spoon on top of the pears. ", "Whisk the cream until soft peaks form, then spoon it onto the custard. Finely grate over the chocolate and sprinkle over the flaked almonds, if using."]}, {"isVegetarian": true, "title": "Christmas pudding vodka", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_vodka_45343", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_vodka_45343_16x9.jpg", "ingredients": ["300g/10½oz mixed dried fruit (sultanas, currants, raisins)", "75g/3oz caster sugar", "2 cinnamon sticks", "2 tsp ground mixed spice", "6 cloves", "½ whole nutmeg, finely grated", "1 orange, zest only, finely grated ", "1 unwaxed lemon, zest only, finely grated", "750ml/1 pint 5fl oz bottle good quality vodka"], "serves": "Makes 500ml/18fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the dried fruit with the sugar, cinnamon sticks, mixed spice, cloves, grated nutmeg and citrus zest in a large bowl. ", "Pour over the vodka, and cover tightly with cling film. ", "Place in the fridge and leave for 3 days, stirring once each day.", "Line a sieve with a double layer of fine muslin and place over a large, clean jug.  ", "Pour the dried fruit and vodka mixture into the sieve and allow to drip through into the jug.", "Pour into a sterilized bottle."]}, {"isVegetarian": false, "title": "Christmas quackers", "url": "www_bbc_co_uk_food_recipes_christmas_quackers_23472", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_quackers_23472_16x9.jpg", "ingredients": ["6 rashers smoked streaky bacon", "3 tbsp olive oil", "3 medium to large Maris Piper potatoes", "2 onions", "salt and freshly ground black pepper", "handful thyme", "1 x 2.5kg/5lb 8oz duck", "6 bay leaves", "a wineglass Madeira "], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut the bacon into postage stamp size pieces and fry directly in the roasting tin with a little oil. Add thinly sliced discs of the potatoes, scatter over the sliced onion and tear in the thyme. Fry altogether till the bacon crisps up and the potatoes start to warm through. ", "Onto this base lay the duck, stuff it with the bay leaves and roast for 60-90 minutes. Check the duck for doneness. Its juices should be clear without any trace of blood. Remove the tin from the oven, turn the heat up to 220C/425F/Gas 8, and place the duck and potatoes into a new tin or onto a heatproof serving plate, then return it to the oven whilst you make the gravy. ", "Put the original roasting tin on the heat and pour in the Madeira. With a wooden spoon dislodge all the crisp caramelised sediments and stir them in to make the gravy. Serve the duck and potatoes with the gravy. "]}, {"isVegetarian": false, "title": "Christmas roast duck", "url": "www_bbc_co_uk_food_recipes_christmas_roast_duck_83066", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_roast_duck_83066_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz potatoes, peeled and thinly sliced", "2 onions, thinly sliced", "500ml/18fl oz chicken stock", "1 x 2kg/4lb 8oz whole duck, giblets removed", "1 clementine, cut in half", "1 cinnamon stick", "½ tsp Chinese five-spice powder", "75g/2½oz butter", "1 head Savoy cabbage, leaves shredded", "50g/1¾oz dried cranberries ", "sea salt and freshly ground black pepper", "2 Bramley apples, peeled, cores removed, roughly chopped", "200g/7oz fresh cranberries", "5 tbsp cider", "2-3 tbsp caster sugar, to taste"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Arrange the shelves of your oven so that there is space for the duck at the top and the potatoes on the shelf immediately underneath. Preheat the oven to 180C/160C Fan/Gas 4.", "Layer the potatoes and onions in an large roasting dish, seasoning each layer with salt and freshly ground black pepper. Pour over the stock, flattening the top layer down.", "Place the potatoes onto the lower shelf in the oven.", "Pierce the duck skin all over with a fork and stuff the neck end of the cavity with the satsuma halves and cinnamon stick. Rub the five-spice powder all over the skin and season with salt and freshly ground black pepper.", "Place the duck directly onto the oven rack above the potatoes, so that the juices from the duck will drip onto the potatoes as they cook. If your dish with the potatoes is on the small side, it may be useful to put a very large empty tray on the bottom of the oven to catch any drips of fat.", "Roast for 1½-2 hours, or until the duck is cooked through and the potatoes are tender and golden-brown.", "Meanwhile, for the spiced cranberry apple sauce, bring the apples, cranberries and cider to the boil in a frying pan. Reduce the heat until simmering and simmer for 10 minutes, stirring occasionally, until the cranberries have burst and the mixture has thickened. Season, to taste, with sugar, if too tart, then pour the sauce into a serving bowl and set aside.", "When the duck is cooked, remove it from the oven and set aside to rest for 10 minutes on a serving platter while you cook the cabbage. ", "Pour enough water into the bottom of a large frying pan to reach 1cm/½in up the sides of the pan. Add half of the butter and bring to the boil. When the butter has melted, add the cabbage and boil until it has just wilted, stirring occasionally. Add the dried cranberries and cook for another 1-2 minutes, or until most of the water has evaporated, then season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the wilted cabbage (drained, if necessary) onto a serving platter and lay the roast duck on top. Serve the potatoes and sauce alongside."]}, {"isVegetarian": false, "title": "Christmas seafood platter", "url": "www_bbc_co_uk_food_recipes_christmas_seafood_89090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz smoked salmon trimmings", "100g/3½ oz cream cheese", "75g/2½ oz soured cream or crème fraîche", "½ lemon, juice and grated zest ", "freshly ground black pepper", "cucumber slices", "small bunch fresh dill (optional)", "24 crostini or mini Melba toasts", "½ bulb of garlic, unpeeled", "150g/5½ oz good-quality mayonnaise", "250g/9oz cooked, peeled, jumbo king prawns", "1 lemon, juice only", "small bunch flatleaf parsley, chopped", "36 canapé blinis", "100g/3½ oz smoked salmon trimmings", "75ml/2½fl oz soured cream", "1 x 50g jar lumpfish caviar", "½ lemon, for squeezing"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the smoked salmon pâté, put the salmon, cream cheese, soured cream, lemon juice and black pepper in a food processor and blend until you have a rough paste. Transfer to a serving bowl, or a small terrine lined with cling film if you want to turn it out later. Refrigerate for at least 1 hour or up to 1 week. ", "For the mayonnaise, preheat the oven to 180C/160C Fan/Gas 4. Wrap the garlic in a piece of foil and scrunch up to seal. Roast for 20-30 minutes until the garlic is softened and brown. Set aside to cool.", "Put the mayonnaise into a mixing bowl and squeeze each clove of garlic out of its papery skin like squeezing out a toothpaste tube. Mix together with a fork to mash up the garlic. Season with salt and pepper. Cover with cling film and set aside in the fridge for up to 3 days.", "Shortly before serving, put the prawns into a bowl and squeeze over the lemon juice, tossing to combine. Arrange the lemony prawns in a serving bowl, sprinkle with parsley and season with salt and pepper. Serve the garlic mayonnaise alongside for dipping.", "Immediately before serving, heat the oven to 200C/180C Fan/Gas 6. Place the blinis on a tray and heat in the oven for 5 minutes. Meanwhile warm a serving plate (the trick with these blinis is to serve them just warm - cold blinis are doughy).", "Make sure that the salmon trimmings are cut into manageable pieces ready to top the blinis.  Remove the blinis from the oven and transfer to the warmed serving plate. Working quickly, spoon a half a teaspoon of soured cream on each blini. Add a little smoked salmon to the top of 18 of the blinis and a quarter of a teaspoon of caviar onto the remaining 18.  Squeeze lemon over the salmon blinis and grind over some black pepper. Serve immediately.", "To serve the smoked salmon pâté, turn out and remove the cling film if shaped in the terrine. Garnish with the cucumber slices, fresh dill and serve spread on mini toasts."]}, {"isVegetarian": true, "title": "Christmas tree pavlova", "url": "www_bbc_co_uk_food_recipes_christmas_tree_pavlova_36017", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_tree_pavlova_36017_16x9.jpg", "ingredients": ["6 free-range egg whites", "450g/1lb caster sugar", "1 tbsp cornflour", "1 tbsp white wine vinegar", "¼ tsp ground cloves", "½ tsp ground ginger", "1 cinnamon stick", "1 lemon, peeled", "1 orange, peeled", "400g/14oz fresh blackberries", "600ml/20fl oz double cream", "1 tbsp vanilla bean paste", "50ml/2fl oz crème de cassis"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/90C Fan/Gas ½. Line a large baking tray with silicone or baking paper. ", "Whisk the egg whites in a clean bowl using an electric whisk, or in the bowl of a freestanding mixer, until soft peaks form when the whisk is removed. ", "Add 300g/10½oz of the caster sugar and continue to whisk until the mixture is smooth and glossy and stiff peaks form when the whisk is removed. You should hear the machine dropping down a gear as the meringue mixture reaches the correct consistency. Reduce the speed of the whisks and add the cornflour and vinegar. Whisk until very stiff.", "Transfer the meringue mixture to a piping bag. Pipe an outline of a Christmas tree shape onto the prepared baking tray. Pipe a rectangular trunk at the bottom. Fill the outline with the remaining meringue mixture, then smooth the top using a palette knife. With the last of the meringue mixture, pipe around the edge of the Christmas tree shape to form a raised edge. Pipe little balls on each of the points to resemble baubles.", "Bake the Christmas tree in the oven for 1½-2 hours, or until firm, then remove from the oven and set aside to cool.", "Meanwhile, make the filling. Bring the remaining caster sugar and 150ml/5fl oz water to the boil in a saucepan. Stir in the ground cloves, ground ginger, cinnamon stick, and lemon and orange peel and boil for a further 4-5 minutes, or until thickened and syrupy. Stir in the blackberries, then remove the pan from the heat and set aside until completely cool.", "When the meringue and fruit syrup have cooled, whisk the cream and vanilla bean paste in a bowl until soft peaks form when the whisk is removed, then stir in the crème de cassis.", "To assemble, transfer the meringue to a serving platter and spread the cream on top. Spoon over the fruit syrup. Serve immediately."]}, {"isVegetarian": true, "title": "Christmas trifle", "url": "www_bbc_co_uk_food_recipes_christmas_trifle_17719", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_trifle_17719_16x9.jpg", "ingredients": ["1 lemon, finely grated zest only", "250g/9oz ready-to-eat dried apricots", "150g/5½oz dried, sweet cranberries", "150g/5½oz dried pineapple", "3 large free-range egg yolks", "35g/1¼oz cornflour", "50g/1¾oz caster sugar", "600ml/20fl oz milk", "300ml/10fl oz single cream", "16 trifle sponges", "½ jar apricot jam", "20 ratafia biscuits (or amaretti biscuits)", "250ml/9fl oz medium-dry sherry", "600ml/20fl oz double cream", "50g/1¾oz flaked almonds, toasted"], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["First, make the fruit compôte. Pour 600ml/20fl oz water into a large pan, add the lemon zest and bring to the boil. Add the apricots, cranberries and pineapple, reserving 2 apricots and 5 cranberries for decoration. Bring to the boil, lower the heat and simmer for 40 minutes. Remove from the heat and leave to cool for at least 4 hours, or preferably overnight. Once cool, strain the fruit, reserving the syrup.  ", "For the custard, put the egg yolks, cornflour and sugar into a large bowl and stir together with a whisk. Heat the milk and cream together in a pan until hot but not boiling. Gradually whisk into the yolks, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat, cover and allow to cool.", "For the fillings, split the trifle sponges and spread generously with the apricot jam. Sandwich together and arrange in the base of a 3 litre/5¾ pint trifle dish, close together, cutting to fit if necessary. Crumble the ratafias over the top. ", "Combine 250ml/9fl oz of the reserved fruit syrup with the sherry and sprinkle over the sponge and crumbled biscuits. Level the surface by pressing down with a spoon.", "Scatter the plump fruit over the sponge, then spread the cooled custard over the fruit. Cover and leave until completely cold before transferring to the fridge to chill and set.", "To decorate, beat the cream until just stiff enough to hold a soft, floppy shape. Spoon half into a piping bag fitted with a plain nozzle and gently spread the remaining half over the surface of the set custard and scatter with the almonds. Pipe blobs of cream around the edge of the trifle bowl. Halve the reserved apricots, then slice thinly. Cut each cranberry into three small pieces. Put a piece of apricot and a piece of cranberry on each blob of cream to decorate. Cover and chill until ready to serve. "]}, {"isVegetarian": true, "title": "Christmas wreath biscuits", "url": "www_bbc_co_uk_food_recipes_christmas_wreath_66081", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_wreath_66081_16x9.jpg", "ingredients": ["115g/4oz unsalted butter", "100g/3½oz caster sugar", "2 oranges, finely grated zest only", "1 small free-range egg, beaten", "150g/5½oz plain flour, plus extra for dusting", "50g/1¾oz cornflour", "50g/1¾oz ground almonds", "40g/1½oz slivered pistachios or pistachios ", "150g/5½oz white chocolate, cut into chunks", "25g/1oz dried cranberries ", "40g/1½oz dried barberries"], "serves": "Makes 18 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Cream together the butter and sugar. Add the orange zest and two-thirds of the egg. Add the flours and almonds and mix to form a dough, adding a little extra flour if you need it to make a rollable dough.", "Lightly flour a work surface and roll out the dough to 8mm. Place on a baking tray and chill in the freezer for 15 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Cut 18 biscuits out with a ring template 5cm/2in in diameter and cut out a smaller circle in the middle so it looks like a wreath, re-rolling the dough if you need to. ", "Bake for 12–15 minutes. Remove and set aside to cool. ", "If you have bought whole pistachios, soak them in boiling water for 2–3 minutes, then skin them and cut them into slivers. ", "Melt the white chocolate in a heatproof bowl set over a pan of simmering water, making sure the bowl doesn’t touch the water. Use a small palette knife to drizzle and spread over the biscuits.", "Decorate with the pistachios, barberries and cranberries. Leave to set."]}, {"isVegetarian": true, "title": "Christmas apricot and chestnut stuffing", "url": "www_bbc_co_uk_food_recipes_christmasapricotandc_73428", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasapricotandc_73428_16x9.jpg", "ingredients": ["1 large onion, coarsely chopped", "225g/8oz dried apricots, snipped into small pieces", "225g/9oz fresh white breadcrumbs", "75g/3oz butter", "225g/8oz frozen chestnuts, thawed, roughly chopped", "generous bunch fresh parsley, chopped", "salt", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven 200C/400F/Gas 6.  Butter a shallow ovenproof dish.", "Add 600ml/1 pint water into a pan with the onion and apricots. Bring to the boil, then reduce the heat and simmer for about five minutes. Drain. ", "Put the breadcrumbs into a large bowl.  Melt the butter in a frying pan and pour half of this onto the breadcrumbs.  ", "In the remaining butter, fry the chestnuts over a high heat until lightly browned.  Tip into the bowl with the breadcrumbs. Add the apricots, onion and parsley to the bowl. Season with salt and pepper.", "Turn into a buttered, shallow ovenproof dish and bake in a preheated oven for about 25-30 minutes until crisp and hot right through."]}, {"isVegetarian": true, "title": "Christmas biscuits", "url": "www_bbc_co_uk_food_recipes_christmasbiscuits_93733", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasbiscuits_93733_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened at room temperature", "100g/3½oz caster sugar", "1 free-range egg, lightly beaten", "1 tsp vanilla extract", "275g/10oz plain flour", "To decorate", "400g/14oz icing sugar", "3-4 tbsp water", "2-3 drops food colourings", "Edible glitter"], "serves": "Makes 36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until pale, light and fluffy.", "Beat in the egg and vanilla extract, a little at a time, until well combined.", "Stir in the flour until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using biscuit cutters or a glass, cut biscuits out of the dough and carefully place onto the baking tray. To make into Christmas tree decorations, carefully make a hole in the top of the biscuit using a straw.", "Bake the biscuits for 8-10 minutes, or until pale golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring.", "Carefully spread the icing onto the biscuits using a knife and sprinkle over the glitter. Set aside until the icing hardens."]}, {"isVegetarian": false, "title": "Christmas broth with cheesy croûtons", "url": "www_bbc_co_uk_food_recipes_christmasbrothwithch_84924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, chopped", "1 garlic clove, chopped", "100g/3½oz lamb trimmings", "½ sweet potato, finely chopped", "2 tbsp port", "150ml/5fl oz vegetable stock", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley", "100g/3½oz bread, cut onto cubes", "1 tbsp olive oil", "80g/3oz Stilton"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat the oil in a frying pan and add the onion and garlic. Fry for two minutes until softened.", "Add the lamb trimmings and fry until browned all over.", "Add the sweet potato, port and stock, bring to the boil and cook for ten minutes, or until the sweet potato is soft. Season, to taste, with salt and freshly ground black pepper and add the parsley.", "Meanwhile, for the croûtons, place the bread onto a baking tray and drizzle with the olive oil. Place under the grill to lightly toast.", "Sprinkle the toast with the cheese and return to the grill until the cheese has melted.", "Serve the soup in a bowl with the cheesy croûtons sprinkled over."]}, {"isVegetarian": true, "title": "Christmas cake", "url": "www_bbc_co_uk_food_recipes_christmascake_2359", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_2359_16x9.jpg", "ingredients": ["225g/8oz plain flour", "¼ tsp salt", "½ tsp mixed spice", "½ tsp ground cinnamon", "200g/7oz butter", "200g/7oz dark brown sugar", "2 tbsp black treacle", "1 tbsp marmalade", "¼ tsp vanilla essence", "4 free-range eggs, lightly beaten", "800g/1¾lb mixed dried fruits", "100g/3½oz chopped mixed peel", "150g/5oz glacé cherries, halved", "100g/3½oz blanched almonds, chopped", "brandy", "200g/7oz marzipan", "1-2 tbsp apricot jam, warmed", "3 free-range egg whites", "600g/1lb 5oz icing sugar, sieved", "1½ tsp liquid glycerine - optional", "1 tbsp lemon juice"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oven to 150C/300F/Gas2. Grease a 20cm/8inch round or an 18cm/7inch square cake tin and line the bottom and sides with baking parchment.", "Sieve the flour, salt, mixed spice and cinnamon into a bowl. ", "Cream the butter and the sugar in a large mixing bowl and then mix in the sugar, treacle, marmalade and vanilla essence until light and fluffy.", "Mix the eggs a little at a time into the mixture adding a tablespoon of flour mixture with the last amount.", "Fold in the remaining flour mixture until well mixed and then mix in the dried fruit, mixed peel, glace cherries and the almonds.", "Turn the mixture into the prepared tin and make a slight hollow in the centre.", "Bake in the oven for 3 hours and then test with a skewer. If not ready bake for up to another hour testing every 20 minutes until the skewer comes out clean. You may need to cover the top with a piece of foil if it begins to look too dark.", "Remove from the oven and leave to cool in the tin for 15 minutes. Turn out on to a wire rack and leave to cool.", "Once cool, make a few holes in the cake with a skewer and pour over 3-4 tbsp of brandy. Let the brandy soak into the cake. Store the cake wrapped in foil and in an airtight tin or plastic container, holes side up. For a rich and moist cake, spoon over a few tablespoons of brandy every week until you are ready to ice and decorate your cake.", "To decorate the cake, place the cake on a foil board or cake plate. Dust your hands and the work surface with a little icing sugar and knead the marzipan until soft. Roll out half the marzipan to fit the top of the cake and roll out the rest in strips to fit around the sides of the cake.", "Brush the cake all over with the warmed apricot jam and then place the marzipan on top and around the cake. Cover the cake with a clean tea towel and then leave in a cool place to dry for at least one day.", "To make the icing, lightly whisk the egg whites adding the sugar at intervals. Beat well until the icing reaches soft peaks. Add the glycerine if using and the lemon juice. Spread icing all over cake either flat iced using a clean ruler or by forming soft peaks. Decorate with Christmas ornaments."]}, {"isVegetarian": true, "title": "Christmas cake icing", "url": "www_bbc_co_uk_food_recipes_christmascakeicing_2360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz marzipan", "1-2 tbsp apricot jam, warmed ", "3 egg whites", "600g/1lb 5oz icing sugar, sieved", "1½ tsp liquid glycerine - optional", "1 tbsp lemon juice"], "serves": "1 cake", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the cake on a foil board or cake plate.", "Dust your hands and the work surface with a little icing sugar and knead the marzipan until soft.", "Roll out half the marzipan to fit the top of the cake and roll out the rest in strips to fit around the sides of the cake.", "Brush the cake all over with the warmed apricot jam and then place the marzipan on top and around the cake.", "Cover the cake with a clean tea towel and then leave in a cool place for at least one day.", "To make the icing, lightly whisk the egg whites adding the sugar at intervals. Beat well until the icing reaches soft peaks. Add the glycerine if using and the lemon juice.", "Spread icing all over cake either flat iced using a clean ruler or by forming soft peaks. Decorate with Christmas ornaments."]}, {"isVegetarian": true, "title": "Gluten-free Christmas cake", "url": "www_bbc_co_uk_food_recipes_christmascake_77307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_77307_16x9.jpg", "ingredients": ["100g/3½oz soya margarine (or whatever kind of butter you like)", "1 large ripe banana", "2 large lemons, finely grated rind and juice only", "100g/3½oz soft prunes, stoned and halved", "75g/3oz raisins", "75g/3oz sultanas", "75g/3oz currants", "150g/5oz soft dried apricots, chopped in fairly large pieces", "50g/2oz mixed peel", "75g/2½oz walnuts, halved and 25g/¾oz hazelnuts, chopped OR 75g/3oz large pumpkin seeds and 25g/¾oz sunflower seeds", "2 eggs (or 2 level tsp gluten-free baking powder to make an egg-free cake) ", "75g/2½oz coarse polenta and 75g/2½oz rice flour and 1 level tsp xanthan gum OR 150g gluten-free flour that already includes xanthan gum ", "2 heaped tsp ground nutmeg", "1 heaped tsp ground cinnamon", "1 heaped tsp ground ginger", "½ teaspoon ground cloves", "2 tbsp brandy (optional)"], "serves": "Makes 20cm/8 in cake", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 160C/300F/Gas 3.", "In a food processor beat the butter/margarine with the banana and the lemon juice and rind. Pour into a bowl.", "Mix in the dried fruit and nuts or seeds. ", "Beat the eggs if you are using them. ", "Sieve which ever flours you are using with the baking powder (if you are substituting it for the eggs) and the spices. ", "Fold the eggs (if you are using them) into the fruit mixture alternately with the flours. Add some brandy if you like.", "Line a 20cm/8in cake tin with greased greaseproof paper. Spoon the mixture in and level off the top. ", "Bake for about two hours or until a skewer inserted in the middle comes out clean.", "Remove from the tin and cool on a rack. ", "Eat as it is or store to be iced for Christmas. You can also decorate this cake with whole nuts such as almonds."]}, {"isVegetarian": true, "title": "Christmas chutney", "url": "www_bbc_co_uk_food_recipes_christmaschutney_2803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb onions, peeled and chopped", "5 tbsp water", "900g/2lb cooking apples, peeled, cored and chopped", "700g/1½ pears, peeled, cored and chopped", "85g/3oz dates, stoned and chopped", "570ml/1 pint cider vinegar", "1 tsp salt", "1 tsp ground cinnamon", "1 tsp cayenne powder", "225g/8oz sugar"], "serves": "Makes 1.8kg/4lb", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put the onions and the water in a large heavy-based pan. Bring to the boil and simmer until soft.", "Add the apples and pears and continue cooking gently for 15-20 minutes. Add the dates, salt, spices and half the vinegar. Cook, stirring occasionally until the mixture thickens. ", "Add the sugar and the rest of the vinegar, stirring until the sugar dissolves. Continue to simmer until the chutney becomes really thick. Stir occasionally.", "When ready, pot and seal in sterilised jars and leave to mature for a week or longer."]}, {"isVegetarian": false, "title": "Christmas crumble with vanilla custard", "url": "www_bbc_co_uk_food_recipes_christmascrumblewith_87717", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 rhubarb stems ", "2 tbsp light muscovado sugar", "1 orange, juice only", "pinch ground cinnamon", "55g/2oz plain flour", "pinch ground mixed spice", "2 tbsp finely chopped butter", "1 tbsp caster sugar", "100ml/3½fl oz ready-made fresh vanilla custard"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Trim and peel the rhubarb. Cut the rhubarb into chunks and place into a pan over a medium heat.", "Add the light muscovado sugar, orange juice and cinnamon. Bring to the boil, then reduce the heat to simmer for 8-10 minutes, until the rhubarb is tender but still holding its shape.", "Meanwhile, sieve the flour and mixed spice into a bowl.", "Add the butter and rub into the flour mixture with your fingers until the mixture resembles fine breadcrumbs.", "Add the caster sugar and stir to combine.", "Transfer the stewed rhubarb to an ovenproof dish and sprinkle over a thin, even layer of the crumble topping.", "Transfer the crumble to the oven to bake for 10-12 minutes, or until the topping is cooked through and lightly golden-brown.", "Heat the vanilla custard in a small pan, then transfer to a serving jug.", "Serve the crumble in its dish at the table (place a thick heatproof board underneath), with a jug of the custard so that guests can help themselves."]}, {"isVegetarian": true, "title": "Christmas mini-muffins", "url": "www_bbc_co_uk_food_recipes_christmasminimuffins_73210", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasminimuffins_73210_16x9.jpg", "ingredients": ["200g/7oz self-raising flour, sifted", "100g/3½oz golden caster sugar", "100ml/3½fl oz sunflower oil", "75ml/2½fl oz milk", "1 large free-range egg", "50g/1¾oz qood quality dark chocolate, chopped", "1 heaped tbsp high quality mincemeat", "50g/1 ¾oz good quality white chocolate, chopped", "50g/1¾oz dried (or fresh) cranberries"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5 and put 24 mini-muffin cases inside a mini-muffin tin.", "Mix the flour and sugar in a bowl, then make a well in the centre. Whisk together the oil, milk and egg and slowly pour into the bowl, stirring gently. Divide this mixture between two bowls. In one bowl add the dark chocolate and mincemeat. Add the white chocolate and cranberries to the other bowl. Stir very gently.", "Divide the two mixtures among the 24 muffin cases and bake for 20 minutes or until golden brown and risen.", "Remove the muffins to a wire rack and eat warm."]}, {"isVegetarian": false, "title": "Christmas panna cotta", "url": "www_bbc_co_uk_food_recipes_christmaspannacotta_93082", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspannacotta_93082_16x9.jpg", "ingredients": ["4 tbsp raisins", "4 tbsp dark rum", "6 gelatine sheets", "1 litre/1¾ pints double cream", "120g/4½oz caster sugar", "1 tsp ground ginger", "1 tsp ground allspice", "¼ tsp nutmeg, to taste", "1 tsp ground cinnamon", "1 handful berries, such as redcurrants, to serve"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Place the raisins into a small bowl and cover with the rum. Set aside to soak for at least 30 minutes. ", "Meanwhile, soak the gelatine sheets in a bowl of cold water until softened. Drain and squeeze out any excess liquid using your hands.", "In a heavy-based pan, heat the double cream, sugar and ground spices. Bring to the boil, then reduce the heat until the mixture is simmering and simmer for 2-3 minutes, whisking until the sugar has dissolved.", "Remove the cream mixture from the heat and whisk in the drained gelatine until dissolved. Drain the raisins and stir into the cream mixture (discard the soaking liquid). ", "Pour the mixture into ten 200ml/7fl oz moulds or ramekins, filling them to three-quarters full. Set aside to cool completely, then cover with cling film and chill in the fridge for at least two hours, or until set. ", "To serve, dip the ramekins briefly into hot water to loosen each panna cotta and turn out onto serving plates. Scatter over some redcurrants to garnish."]}, {"isVegetarian": false, "title": "Perfect Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmaspudding_71054", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_71054_16x9.jpg", "ingredients": ["350g/12¼oz sultanas", "350g/12¼oz raisins or currants", "150g/5¼oz dried figs, chopped", "125g/4½oz candied peel", "100g/3½oz dried apricots", "75g/2½oz dark glacé cherries, halved", "150ml/5fl oz brandy", "100g/3½oz ginger in syrup, chopped, plus 2 tbsp of the syrup", "2 apples or quinces, grated", "2 oranges, juice and zest", "6 eggs, beaten", "250g/8¾oz shredded suet", "350g/12¼oz soft muscovado sugar", "250g/8¾oz fresh breadcrumbs", "175g/6¼oz self-raising flour", "1 tsp mixed spice", "2 old sixpences or coins (optional)"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For this recipe you will need two 1.5 litre(2½ pint) plastic pudding basins with lids.", "Soak the sultanas, raisins, currants, figs, peel, apricots and cherries in the brandy overnight, giving it a good stir now and again.", "The following day, in a large bowl mix the ginger, syrup, apples or quinces, orange juice and zest with the eggs, suet, sugar, crumbs and flour.", "Stir in the soaked fruit and spice.", "Grease the two pudding basins and divide the mix between them. Add coins now if using.", "Cut two circles of greaseproof paper to cover the top of the pudding and fold a pleat down the centre to allow pudding to expand.", "Put lids on the basins and steam puddings for 3½ hours.", "Let puddings cool before removing greaseproof paper and covering tightly with cling film and lid. The puddings can now be stored in a cool, dry place until Christmas.", "To reheat, steam pudding for a further 3½ hours, turn out and flame with brandy."]}, {"isVegetarian": true, "title": "Gluten-free Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmaspudding_77292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz raisins", "100g/3½oz currants", "50g/2oz sultanas", "50g/2oz prunes, chopped", "50g/2oz apricots or figs, chopped", "25g/¾oz fresh or dried mixed peel", "50g/2oz flaked almonds or, if you cannot eat nuts, sunflower seeds ", "150g/5oz fresh pear, puréed in a food processor, with the skin on", "1 level teaspoon each of ground ginger and cinnamon", "½ level teaspoon ground mace", "25g/1oz gluten-free vegetable suet ", "2 eggs OR if you cannot eat eggs, 2 heaped tsp of wheat-free and gluten-free baking powder", "150ml/5fl oz of apple or pear juice OR 100ml/3½oz apple or pear juice and 50ml/2fl oz brandy", "100g/3½oz gluten-free and wheat-free flour OR 50g/2oz each of gram flour and 50g/2oz of rice flour"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the dry ingredients together in a large bowl. ", "Beat the eggs (if you are using them) with the juice and brandy if you are using it and stir it into the dry mixture. ", "Sieve the flours together with the baking powder (if you are using it instead of the eggs). ", "Fold the flour very thoroughly into the fruit.", "Spoon the mixture into a pudding basin, cover with doubled greaseproof paper and tie with a string or rubber bands. ", "Put the basin in a deep pan, pour in water to halfway up the bowl, cover the pan tightly and simmer for 4-5 hours, checking the water level periodically.", "Remove basin from the pot, discard the greaseproof paper and cover it with new. Allow to cool, then store in a cool larder.", "To serve, re-steam for 1-2 hours or reheat in a microwave for 3-5 minutes."]}, {"isVegetarian": false, "title": "Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmaspudding_87598", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_87598_16x9.jpg", "ingredients": ["275g/10oz soft brown or white breadcrumbs", "100g/4oz dried apricots, chopped (to about the same size as the raisins)", "100g/4oz dried figs, chopped (to about the same size as the raisins)", "225g/8oz currants", "225g/8oz seedless raisins", "225g/8oz sultanas", "75g/3oz high quality candied peel, finely chopped", "50g/2oz almonds, finely chopped", "225g/8oz light or dark muscovado sugar", "225g/8oz shredded suet", "½ tsp salt", "1 tsp ground mixed spice", "1 tsp ground cinnamon", "½ tsp freshly grated nutmeg", "1 orange, zest and juice", "1 lemon, zest and juice", "1 eating apple, cored and grated", "3 free-range eggs, lightly beaten", "150ml/5fl oz stout or similar dark beer", "150ml/5fl oz milk", "4 tbsp brandy", "butter, for greasing pudding bowls"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place all the dry ingredients into a large bowl and mix together thoroughly. ", "Add the wet ingredients and mix together well with your hands (a spoon doesn't do the job half as well). ", "Divide the mixture between two greased 1½ litre/2½ pint heatproof pudding bowls, filling almost to the rim, then smooth down the surface.", "Cover each bowl with a large square of greaseproof paper, then cover that with a large square of aluminium foil. Tie the two sheets tightly into place under the rim with string, leaving long ends of excess string to make a handle. Loop one of the excess string lengths over the pudding basin and slide underneath the taut string holding the sheets in place on the other side. Bring up the string and firmly knot with the other piece of excess string, to form a secure handle to lift the pudding in and out of the water. ", "Leave the puddings somewhere cool overnight before cooking.", "To cook, stand both puddings on a trivet in a large, deep, heavy-based pan (or each pudding in a separate pan). Pour boiling water into the pan(s), enough to come about halfway up the sides of the bowls.", "Cover the pan(s) with a lid or a dome of foil and boil for seven hours. Check the water level regularly, topping it up with more boiling water as necessary to keep the bowls half submerged.", "After seven hours, remove the bowls from the pan and leave to cool. Untie and remove the foil and greaseproof sheets and replace with clean, dry sheets of both greaseproof paper and foil.", "Store in a cool, dry place (or freeze if you prefer, though they will keep perfectly well for a year or more unfrozen). To reheat at Christmas-time, return to a pan containing a few inches of boiling water, cover and steam for two hours, checking the water levels now and then, until completely heated through."]}, {"isVegetarian": true, "title": "Last minute Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmaspudding_90194", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_90194_16x9.jpg", "ingredients": ["900g/2lb mixed dried fruit (such as figs, apricots, sour cherries, raisins, dates, cranberries or sultanas)", "150ml/5fl oz brandy or whisky", "1 large orange, grated zest and juice", "225g/8oz butter, softened, plus extra, melted, for greasing", "225g/8oz dark brown sugar", "4 large free-range eggs, beaten", "110g/4oz self-raising flour", "110g/4oz fresh breadcrumbs", "85g/3oz chopped nuts (almonds, hazelnuts or pecans)", "1 tsp freshly grated nutmeg", "1 heaped tsp cinnamon", "brandy, for flaming", "fresh cherries", "custard, thick cream or ice cream"], "serves": "Makes 2 x 1.2 litre puddings", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the dried fruit into a large bowl (cut up any large pieces of apricot or fig so that all the fruit pieces are roughly the same size). Pour over the brandy or whisky.", "Add the grated orange zest to the fruit, then pour over the orange juice. ", "Mix all of the bowl contents together until well combined. Cover the bowl with cling film and set aside in a cool place overnight.", "The next day, lightly grease two 1.2 litre/2 pint pudding basins with the melted butter and place a disc of greaseproof paper into the base of each.", "In a very large mixing bowl, cream together the softened butter and sugar until pale and fluffy using an electric whisk (this will take about five minutes).", "Whisk in the beaten eggs, a little at a time, incorporating each addition into the batter before adding the next. (NB: If the mixture starts to curdle, just whisk in a spoonful of flour.)", "When all of the eggs have been incorporated into the mixture, add the soaked fruit and soaking juices and stir well to combine.", "Add the flour and the breadcrumbs to the mixture and stir to combine.", "Add the nuts and spices and mix gently until well combined. (NB: The mixture should be of dropping consistency.)", "Spoon the mixture into the prepared pudding basins and cover with a double layer of greaseproof paper and a single sheet of aluminium foil. Tie with string.", "Prepare a steamer and steam the puddings for four hours. You can eat the puddings at this stage, or you can cool them completely and store them, in their basins, for 2-3 months, in a cool dark place, re-steaming them for two hours before serving.", "To serve, carefully remove the puddings from the basins and turn each out onto a serving plate.", "Garnish the top of the puddings with the cherries. Carefully set the brandy alight using a match. Allow the flames to flare up, then pour the brandy over the puddings. (CAUTION: Keep the flame well away from the eyes, hair and face.)", "Garnish each serving with a few extra cherries and serve with custard, thick cream or ice cream."]}, {"isVegetarian": true, "title": "Christmas pudding ice cream", "url": "www_bbc_co_uk_food_recipes_christmaspuddingicec_77305", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ tsp ground cinnamon", "generous pinch ground cloves", "5 tbsp brandy or dark rum", "350g/12oz assorted dried fruits - sultanas, raisins, currants, cherries, crystallised ginger (chopped), mixed peel, prunes (chopped), apricots (chopped), figs (chopped) or anything else that you fancy", "200ml/7fl oz plain cows', sheep's, goats' yoghurt OR soya yoghurt", "100ml/3½fl oz cows', goats' or soya cream OR 300ml/10fl oz oat cream", "2 tbsp honey"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the spices into the brandy or rum and leave to infuse for 30 minutes.", "Pour the liquid over the mixed fruits and leave to soak for a couple of hours.", "Mix the yoghurt with the cream and honey, then mix in with the soaked fruits. ", "Spoon the mixture into an ice cream maker and churn at the 'freeze' setting for 15-20 minutes. ", "Remove it from the freezer and put into a smallish pudding basin, and either put the lid on the basin, or cover with cling film. Freeze.", "To serve, wrap the basin in a hot cloth to loosen it and turn the pudding out onto a dish. Place some holly in the top and, if you want, pour some warmed brandy round the bottom and light it, to serve."]}, {"isVegetarian": false, "title": "Christmas rocky road", "url": "www_bbc_co_uk_food_recipes_christmasrockyroad_90624", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasrockyroad_90624_16x9.jpg", "ingredients": ["250g/9oz dark chocolate, chopped", "150g/5oz milk chocolate, chopped", "175g/6oz butter, softened, plus extra for greasing", "4 tbsp golden syrup", "200g/7oz amaretti biscuits", "150g/5oz shelled Brazil nuts", "150g/5oz red glacé cherries", "125g/4oz mini marshmallows", "1 tbsp icing sugar", "edible glitter, to decorate (optional)"], "serves": "Makes 24 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the dark and milk chocolate pieces into a heavy-based pan. Add the butter and golden syrup and cook over a low heat to melt and combine.", "Place the amaretti biscuits into a freezer bag and bash with a rolling pin to make crumbs of various sizes.", "Place the Brazil nuts into another freezer bag and bash in the same way. ", "Take the pan of melted chocolate mixture off the heat and add the crushed biscuits and nuts.", "Add the glacé cherries and mini marshmallows. Fold the mixture carefully to coat all of the solid ingredients with the syrupy chocolate mixture.", "Pour the mixture into a 25cm/10in x 30cm/12in greased and lined baking tray and smooth the surface as much as possible (although it will look bumpy).", "Refrigerate for two hours, or until firm enough to cut. Dust with icing sugar, then sprinkle with edible glitter if you wish.", "Remove the block of rocky road from the tray and cut into 24 rectangles."]}, {"isVegetarian": true, "title": "Christmas-style zuccotto", "url": "www_bbc_co_uk_food_recipes_christmasstylezucott_84677", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp brandy", "2 tbsp orange liqueur", "5 tbsp fresh orange juice", "2 ready-made madeira cakes, trimmed and cut into slices", "100g/3½oz icing sugar", "100g/3½oz ready-made Christmas pudding, cooked and broken up into pieces", "1 vanilla pod, split, seeds scraped out", "450ml/16fl oz double cream, whipped until stiff peaks form when the whisk is removed", "85g/3oz dark chocolate (70 per cent cocoa solids), grated", "85g/3oz dark chocolate (70 per cent cocoa solids), melted, plus extra to serve", "double cream, to serve"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Line a 1½ litre/2½ pint capacity round-bottomed bowl or basin with cling film. ", "Place the brandy, orange liqueur and orange juice into a clean bowl and dip the madeira cake slices into it to lightly soak.", "Place three-quarters of the soaked cake slices into the cling film-lined bowl to cover the inside of the bowl.", "In a separate bowl, place the icing sugar, cream and vanilla seeds and fold together gently.", "Place the grated chocolate, Christmas pudding pieces and three-quarters of the cream mixture into a clean bowl and mix together well. Spread this cream and Christmas cake mixture over the cake slices, moulding a hollow in the middle of the cream and Christmas cake mixture.", "Add the melted chocolate to the remaining cream mixture and pour this into the hollow. Smooth over.", "Place the remaining moist cake slices over the filling to completely enclose the filling, then cover with a clean tea towel and place into the fridge to chill for 24 hours.", "To serve, remove from the fridge, remove the covering and turn the cake out onto a plate. Remove the cling film if it has stuck to the cake, then pour over some melted chocolate. Cut generous slices and serve with cream."]}, {"isVegetarian": true, "title": "Christmas veggie Wellington", "url": "www_bbc_co_uk_food_recipes_christmasveggiewelli_90569", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasveggiewelli_90569_16x9.jpg", "ingredients": ["60g/2oz basmati rice, cooked according to the packet instructions", "pinch turmeric", "1 lemon, zest only", "1 onion, finely chopped", "600g/1lb 5oz brown cap mushrooms, sliced", "50g/2oz butter, melted", "1 tbsp chopped fresh parsley ", "1 tbsp chopped fresh tarragon", "1 tbsp dried cranberries", "2 free-range eggs, hard-boiled, chopped ", "salt and freshly ground black pepper", "250g/9oz ready-rolled puff pastry", "1 free-range egg, beaten", "1 tsp sesame seeds", "vegetarian gravy, to serve"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Combine the cooked rice, turmeric and lemon zest and set aside, covered,  in the refrigerator.", "Heat the butter in a frying pan over a medium heat, add the onion and mushroom and fry for 3-4 minutes, or until softened. Set aside to cool.", "Stir in the cooked rice, herbs, cranberries and hard-boiled eggs until well combined. Season, to taste, with salt and freshly ground black pepper.", "For the pastry, cut a 40cm x 20cm/15in x 8in rectangle from the puff pastry. ", "Spoon the rice mixture down the centre of the pastry. Bring the sides of the pastry together and seal. Brush all over with beaten egg and chill for 30 minutes.", "Sprinkle the pastry parcel with sesame seeds and bake in the oven for 30 minutes, or until crisp and golden-brown.", "To serve, place one slice of the Wellington onto each of six serving plates. Pour over vegetarian gravy."]}, {"isVegetarian": true, "title": "Chunky apple crumble", "url": "www_bbc_co_uk_food_recipes_chunkyapplecrumble_90202", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chunkyapplecrumble_90202_16x9.jpg", "ingredients": ["4 large Bramley cooking apples (weighing about 900g/2lb)", "1 large orange, zest and juice only", "2 sprigs rosemary", "225g/8oz blackberries", "splash of water", "30g/1½ oz caster sugar", "55g/2oz ground almonds", "140g/5oz plain flour", "85g/3oz polenta (not quick-cook)", "140g/5oz butter, cold", "110g/4oz light muscovado sugar", "splash of water", "thick cream or custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the filling, peel, quarter and core the apples and cut into large chunks. Place in a shallow ovenproof dish.", "Zest and juice the orange, adding the zest and juice to the apples. Mix together with your hands.", "Bruise the rosemary sprigs and scatter over the apples. Toss over the blackberries, add a splash of water and scatter over the sugar.", "For the crumble topping, place the almonds, flour, polenta, butter and sugar in a food processor and pulse briefly several times, just to mix. The mixture should look like coarse breadcrumbs.", "Tip out into a bowl and add a splash of water. Use a spoon to mix briefly - it should be quite clumpy.", "Sprinkle the crumble mixture over the fruit.", "Place in the oven and bake for 20 minutes.", "Turn down the heat to 180C/350F/Gas 4 and cook for a further 20-25 minutes, until the top is nicely browned and bubbling.", "Serve with pouring cream or custard."]}, {"isVegetarian": true, "title": "Chunky cheese loaf", "url": "www_bbc_co_uk_food_recipes_chunky_cheese_loaf_74948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing ", "160g/6½oz plain flour ", "1 tsp baking powder ", "20g/1oz butter, softened", "1 medium dessert apple, peeled ", "60g/2oz mature cheddar cheese, grated, plus a bit extra for sprinkling ", "1 egg ", "50ml/1fl oz apple juice"], "serves": "Serves 5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven at 180C/350F/Gas 4. Brush the inside of a 500g loaf tin with a little oil and place it on a baking tray.", "Place the flour, baking powder and butter into a bowl.  Rub them together using your fingertips (as if you are tickling the mixture) until you get a fine crumbly mixture.  ", "Ask a grown-up to help you cut up the apple into small bite-sized pieces. Add these to the bowl with the grated cheese.", "Now break the egg in the cup and beat it with the fork.  Then add it to the flour mixture.  Add a bit of apple juice to moisten the mixture. It should be a thick batter, so you may not need all the apple juice.", "Spoon the batter into the loaf tin and sprinkle the top with the extra cheese. Ask a grown-up to put it in the oven for about 20-25 minutes, or until it is golden brown and has risen well. Serve the loaf with fresh apple chunks."]}, {"isVegetarian": true, "title": "Chunky celeriac soup", "url": "www_bbc_co_uk_food_recipes_chunkyceleriacsoup_80861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 clove garlic, finely chopped", "½ red onion, roughly chopped", "150g/5½oz celeriac, peeled and cut to 2½cm/1in cubes", "1 tbsp tomato purée", "pinch dried chilli flakes", "100g/3½oz puy lentils", "200ml/7fl oz hot chicken stock (vegetarians may substitute vegetable stock)", "salt and freshly ground black pepper", "fresh basil leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive oil into a saucepan over a medium heat. Add the garlic, onion and celeriac and fry for two minutes, stirring occasionally.", "Add the tomato purée and chilli flakes and cook for a further minute.", "Add the lentils and stock and bring to the boil. Reduce the heat to simmer for 15 minutes, stirring occasionally.", "Season, to taste, with salt and freshly ground black pepper and pour into a warm bowl. Garnish with a basil leaf and serve."]}, {"isVegetarian": false, "title": "Chunky bacon and cucumber salad", "url": "www_bbc_co_uk_food_recipes_chunkybaconandcucumb_89286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp groundnut oil", "6 long dried chillies ", "2 tsp Sichuan peppercorns ", "1 whole star anise (optional)", "100g/3½oz smoked lardons, cut into 1cm/½in thick pieces", "1 red chilli, de-seeded, finely chopped", "1-2 tbsp Shaoxing rice wine or dry sherry", "2 tbsp clear rice vinegar or cider vinegar", "2 tbsp toasted sesame oil", "200g/7oz cucumber, halved lengthways, de-seeded and sliced into 1cm/½in thick wedges", "pinch sea salt", "1-2 pinches dried chilli flakes", "1 tbsp lime juice", "1 tbsp chilli oil ", "1 small handful fresh coriander leaves, roughly chopped", "dry-roasted peanuts (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add the groundnut oil, then add the dried chillies and Sichuan peppercorns. Stir fry for a few seconds, or until fragrant. ", "Add the star anise (if using), bacon lardons and chilli and stir fry for 2-3 minutes, or until the lardons have turned golden-brown at the edges.", "Add the rice wine or sherry, vinegar and sesame oil and stir-fry for a few seconds, then add the cucumber and stir-fry for a few more seconds.", "Season with sea salt, dried chilli flakes and lime juice, stirring well.", "Pile the stir-fry onto a serving plate, drizzle over the chilli oil, garnish with the chopped coriander, sprinkle over some peanuts, if using, and serve immediately."]}, {"isVegetarian": true, "title": "Chunky yellow pepper and rocket soup", "url": "www_bbc_co_uk_food_recipes_chunkyyellowpepperan_87239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ red onion, finely chopped", "1 garlic clove, finely chopped", "½ yellow pepper, chopped", "150ml/¼ pint chicken stock (vegetarians can substitute vegetable stock)", "salt and freshly ground black pepper ", "handful rocket, finely chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small saucepan and gently fry the onion until softened but not coloured.", "Add the garlic and fry for one minute.", "Add the pepper and stock and bring to the boil. Reduce the heat and simmer for 6-8 minutes.", "Add the rocket and simmer for a further 2-3 minutes, or until the pepper is tender. Season, to taste, with salt and freshly ground black pepper.", "To serve, pour the soup into a serving bowl."]}, {"isVegetarian": true, "title": "Chunky banana bread", "url": "www_bbc_co_uk_food_recipes_chunky_banana_bread_27126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil, plus extra for greasing", "1 ripe banana", "1 free-range egg, beaten", "3 tbsp raisins", "1 tsp vanilla extract", "50g/2oz golden caster sugar", "110g/4oz plain flour", "1 tsp baking powder"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a loaf tin with a little sunflower oil.", "In a large bowl, mix the mashed banana with the sunflower oil until well combined. Beat in the egg, then stir in the raisins and vanilla extract.", "In a separate bowl, mix together the sugar, flour and baking powder.", "Stir the dry ingredients into the wet ingredients until well combined.", "Pour the cake mixture into the prepared loaf tin and bake in the oven for 30-40 minutes, or until a skewer inserted into the centre of the cake comes out clean. Set aside to cool on a wire rack, then cut into slices and serve."]}, {"isVegetarian": true, "title": "Churros with peaches and custard", "url": "www_bbc_co_uk_food_recipes_churros_with_peaches_and_16379", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 free-range egg yolks", "100g/3½oz caster sugar", "250ml/9fl oz milk", "250ml/9fl oz double cream", "1 vanilla pod, split in half, seeds scraped out using the tip of a sharp knife", "75g/2¾oz butter", "25g/1oz sugar", "4 ripe peaches, stones removed and roughly chopped", "2 large sprigs fresh basil, leaves only, torn", "vegetable oil, for deep frying", "50g/2oz caster sugar, plus extra for dusting", "75g/2¾oz butter", "200g/7oz plain flour", "¼ tsp baking powder", "1 free-range egg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the custard, whisk the egg yolks and half of the sugar in a bowl until pale and thick.", "Bring the milk and cream slowly to the boil with the remaining sugar and vanilla seeds, stirring well. ", "When the milk is just boiling and the sugar has dissolved, pour the mixture over the egg mixture, whisking continuously until well combined.", "Return the mixture to the same pan and cook over a gentle heat, whisking occasionally, until the custard thick enough to coat the back of a wooden spoon. Strain into a bowl and set aside. ", "For the peaches, heat 50ml/2fl oz water with the butter and sugar in a lidded frying pan over a medium heat, until the butter has melted and the sugar has dissolved. Add the peaches and basil, then cover and cook for 5-10 minutes, or until tender but still intact and caramelised on the bottom. Transfer to a serving dish, arranging them with the caramelised sides facing upwards.", "For the churros, heat the oil in a deep-fat fryer to 150C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "In a separate saucepan, bring 250ml/9fl oz water to the boil with the sugar and butter. When the mixture is boiling, remove the pan from the heat, add the flour and baking powder all in one go and immediately start beating until the mixture comes together as a smooth batter. Beat in the egg until the batter is smooth and shiny.", "Fit a piping bag with a large, star-shaped nozzle. Fill the piping bag with half of the batter and pipe short lines of it directly into the hot oil, taking care to keep your face as far away from the pan as possible. To cut the batter, carefully dip a metal pair of scissors into the hot oil, then snip through the batter as you pipe it. ", "Cook the churros, in batches, for 5-6 minutes, or until golden-brown and crisp, then remove and drain on kitchen paper. Repeat the process with the remaining batter, then dust all of the churros with caster sugar.", "To serve, spoon the custard over and around the peaches, with the churros piled alongside on a plate. "]}, {"isVegetarian": true, "title": "Ciabatta", "url": "www_bbc_co_uk_food_recipes_ciabatta_05418", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ciabatta_05418_16x9.jpg", "ingredients": ["400g/14oz strong white flour, plus extra for flouring", "7g instant yeast", "30ml/1fl oz olive oil, plus extra for oiling", "7g salt", "semolina flour, for flouring"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine half of the flour and 4g of the yeast with 150ml/5fl oz water in a bowl.  Bring it together into a soft dough.", "Oil a clean work surface and knead the dough for five minutes. ", "Place the dough into a clean, oiled bowl and cover with cling film or a damp tea towel. Leave to rise for at 3–6 hours, depending on room temperature. (See tip for more details). The dough is ready once it has doubled in size. ", "Tip the mixture into a food mixer. Add the remaining flour, oil, yeast and 75ml/2½fl oz water and mix using a dough hook attachment. ", "Dissolve the salt in 75ml/2½fl oz water and gradually add this to the mixture, mixing for 6–10 minutes, or until the dough is stringy and soft. ", "Oil a large square, plastic container, tip in the dough and put the lid on. Leave the dough to prove at room temperature until it has doubled in size.", "Dust a clean work surface with flour and semolina. Tip the dough out onto the surface (it will be very wet) and cover with more of the flours, trying to keep a square shape and being careful not to knock out any air. Cut the dough into two and stretch the pieces lengthways into the classic ciabatta shape.  ", "Preheat the oven to 220C/200C Fan/Gas 7 and sprinkle the flours lightly over a baking tray. ", "Carefully place the dough onto the baking tray and allow to prove again for another 30 minutes. Bake for 30 minutes or until the loaves are golden-brown and make a hollow sound when tapped on the base. Leave cool on a wire rack and serve."]}, {"isVegetarian": true, "title": "Ciabatta", "url": "www_bbc_co_uk_food_recipes_ciabatta_85453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz Italian type '00' bread flour", "190ml/7fl oz water", "15g/½oz yeast", "250g/9oz Italian type '00' bread flour", "10g/¼oz yeast", "190ml/7fl oz water", "12g/½oz salt"], "serves": "3 loaves", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the overnight preparation, mix the flour with the water in a large bowl and add the yeast. Whisk for three minutes and leave to rise overnight (or at least eight hours).", "To finish the bread, add the remaining flour and yeast to the bread mixture and mix well.", "Gradually add the rest of the water to the bread mixture. When nearly all of the water has been added, add the salt to the remaining water and mix together for a further five minutes, until a sticky dough is formed.", "Transfer the dough into a large oiled bowl and leave to rise for one hour.", "Transfer the dough to a heavily floured work surface and leave to rest for a further 30 minutes.", "Preheat the oven to 240C/465F/Gas 8.", "Cut the dough into three strips and stretch them out to make long, flat ciabatta loaf shapes.", "Place onto a baking sheet lined with baking paper and leave for ten minutes. ", "Transfer the dough to the oven to bake for 25 minutes, or until risen and golden-brown.", "Remove from the oven and transfer to a wire rack to cool."]}, {"isVegetarian": true, "title": "Cialledda salad", "url": "www_bbc_co_uk_food_recipes_cialledda_salad_60889", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 stale ciabatta, or decent sourdough type bread (around 250g/9oz)", "1 small red onion, very finely sliced", "500g/1lb 2oz very ripe tomatoes", "1 garlic clove, crushed", "½ tsp dried oregano", "2 tbsp olive oil", "handful black olives", "small bunch basil, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Tear or cut the bread into chunks of around 3–4cm/1¼–1½in. Sprinkle with a little water, just to help moisten the surface. Add the water gradually – you don’t want it sodden, as it will also soak up some of the tomato juices. ", "Sprinkle the red onions with a pinch of salt and put in a bowl of cold water for half an hour, then drain and set aside.", "Roughly chop the tomatoes and put in a bowl, along with any juices which may have escaped. Add the garlic and oregano and season well with salt and pepper. ", "Drizzle over the olive oil, then add the bread, onions, olives and basil leaves. Leave to stand for half an hour at room temperature before serving."]}, {"isVegetarian": true, "title": "Ciambellone", "url": "www_bbc_co_uk_food_recipes_ciambellone_82364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, softened, plus extra for greasing", "300g/10½oz sugar", "4 free-range eggs, separated", "300g/10½oz plain flour", "100g/3½oz potato flour or cornflour", "1 lemon, zest only", "4-6 tbsp milk", "1 sachet pane di angeli, or use 1 tsp baking powder mixed with 2 to 3 drops vanilla essence"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Lightly grease a baking ring mould.", "Cream together the butter and sugar in a bowl until the mixture is pale and creamy.", "Stir in the egg yolks, plain flour, potato flour or cornflour and lemon zest together with four tablespoons of milk. Stir in 1-2 more tablespoons of milk if the mixture is very thick. It should be creamy, light and stand in soft peaks in the bowl. ", "Stir in the pane di angeli, or the baking powder and vanilla essence mix.", "Whisk the egg whites until soft peaks form. Then fold the egg whites into the mixture.", "Pour the mixture into the greased baking ring mould and bake in the oven for 20 minutes or until golden brown and springy to the touch. Serve."]}, {"isVegetarian": true, "title": "Cider and 5-spice bundt cake", "url": "www_bbc_co_uk_food_recipes_cider_and_5-spice_bundt_05085", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cider_and_5-spice_bundt_05085_16x9.jpg", "ingredients": ["250ml/9fl oz cider, preferably dry or at least not sweet", "175ml/6fl oz sunflower oil, plus extra for greasing", "100g/3½oz  soft dark brown sugar", "300g/10½oz black treacle (use an oiled 1-cup measure for ease)", "3 large free-range eggs", "3cm/1¼in piece (15g/½oz) fresh root ginger, peeled and finely grated", "300g/10½oz plain flour", "2 tsp baking powder", "¼ tsp bicarbonate of soda", "½ tsp freshly grated nutmeg", "2½ tsp Chinese five-spice powder", "1½ tsp ground cinnamon", "75g/2½oz unsalted butter", "50g/1¾oz soft light brown sugar", "50g/1¾oz caster sugar", "50g/1¾oz golden syrup", "125ml/4fl oz double cream", "2 teaspoons smoked sea salt flakes, or to taste"], "serves": "Makes 1 bundt cake or 20cm/8in square cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Open the cider so that it loses its fizz. Preheat the oven to 170C/150C Fan/Gas 3. Grease your bundt tin with non-stick cooking spray, or simply oil it, and leave the tin upside down on a piece of newspaper or baking parchment while you get on with the batter.", "Measure the oil, brown sugar and (whether you’re weighing it or going for volume and using a cup measure, always lightly oil the receptacle for the treacle first and it will slide out easily) black treacle into a bowl.", "Pour in the cider and crack in the eggs, add the ginger and beat till smooth. While I use a freestanding mixer to make this cake, it’s simple enough by hand: in which case, beat the eggs together first before adding to the other ingredients.", "In another bowl measure out the flour, baking powder, bicarb, nutmeg, five-spice and cinnamon, and fork through to combine.", "Gently tip the dry ingredients into the wet treacly mixture, beating as you go to make a smooth batter. Scrape the sides and the bottom of the bowl well to make sure there aren’t any pockets of flour.", "Pour the dark and aromatic batter into the prepared tin: it will be very runny, but don’t be alarmed. Place in the oven to bake for 45–50 minutes, but start checking after 40. When the cake’s ready, it will start to come away from the sides of the tin and a cake tester should come out clean; that’s to say, not wet, but with some crumbs adhering to it. Transfer the bundt to a wire rack for about 30 minutes, then use your fingers to help prise the cake away from the edges of the tin, most particularly around the funnel, and turn out. Leave to cool completely before wrapping, first in parchment and then foil, as it tastes best if eaten the next day. I don’t always manage this.", "For the sauce, melt the butter, sugars and syrup in a small, heavy-based pan and let it simmer for 3 minutes, swirling the pan every now and then.", "Add the cream and the smoked salt and swirl again, then give it a stir with a wooden spoon, and taste. Go cautiously so that you don’t burn your tongue, and see if you want to add more salt, before letting it cook for another minute. Let it cool a little then drizzle over the cake and pour any remaining sauce into a jug to serve."]}, {"isVegetarian": true, "title": "Cider and apple cake", "url": "www_bbc_co_uk_food_recipes_cider_and_apple_cake_80542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1½oz sultanas", "150ml/5fl oz medium dry cider", "125g/4½oz softened butter", "125g/4½oz light soft brown sugar", "2 free-range eggs, beaten", "175g/6oz white self-raising flour", "50g/1½oz brown spelt flour", "½ tsp baking powder", "1 tsp ground coriander", "pinch salt", "1 crisp dessert apple, peel on, cut into cubes", "100ml/3½fl oz of medium dry cider", "75g/2½oz granulated sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the sultanas in 50ml/2fl oz of the cider until plump (about an hour, or you can do it overnight).", "Preheat the oven at 180C/350F/Gas 4   ", "Lightly grease an 18cm/7in diameter baking tin and dust it with flour.", "In a bowl or food processor mix the butter and sugar. Next, add the beaten eggs, flours, baking powder, coriander and salt. Mix well. ", "Add the apple, the sultanas and their cider they soaked in, plus the remaining amount of cider to the cake mix, and stir to combine but do not beat.", "Pour mixture into the cake tin and bake in the oven for 20-25 minutes till golden-brown and firm to touch.  Remove from the oven and leave to cool.", "For the cider syrup, in a saucepan bring the cider and granulated sugar to the boil, and when all the sugar has dissolved leave the syrup to cool.", "Remove the cake from the tin and place on serving dish.  Using a skewer prick the cake all over evenly.  Slowly pour the cider syrup over the cake, then serve."]}, {"isVegetarian": true, "title": "Pimms punch", "url": "www_bbc_co_uk_food_recipes_cidercup_86223", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidercup_86223_16x9.jpg", "ingredients": ["dry cider", "3 handfuls mixed fruit pieces (such as orange, lemon, lime, strawberries)", "250ml/9fl oz Pimms"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the cider into large jug or punch bowl", "Add a couple of straws and the mixed fresh fruit pieces, then gently pour the Pimms on top of the cider to create a separate layer."]}, {"isVegetarian": true, "title": "Cider, rum and cinnamon punch", "url": "www_bbc_co_uk_food_recipes_ciderrumandcinnamonp_70704", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large apples, diced ", "1 litre/1 pint 15fl oz cider", "250ml/8¾fl oz dark rum", "3 cinnamon sticks", "3 star anise", "1 litre/1 pint 15fl oz water", "100g/3½oz sugar"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients in a pan, except the rum. Cook slowly for one hour 15 minutes, then add the rum. Serve warm or cold."]}]