[{"isVegetarian": false, "title": "Turkey and courgette burgers with mozzarella", "url": "www_bbc_co_uk_food_recipes_turkey_and_courgette_65781", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_and_courgette_65781_16x9.jpg", "ingredients": ["500g/1lb 2oz turkey mince ", "500g/1lb 2oz grated courgette ", "2 tsp dried Italian herbs ", "2 tsp bicarbonate of soda ", "½ tsp dried chilli flakes ", "2 tbsp drained capers, roughly chopped  ", "olive oil spray ", "sea salt and freshly ground black pepper ", "100g/3½oz red cabbage, finely shredded ", "200g/7oz white cabbage, finely shredded ", "1 tsp salt ", "1 large carrot, peeled and grated ", "1 tsp toasted fennel seeds, ground ", "1 tbsp white wine vinegar ", "60g/2¼oz 0% fat Greek-style yoghurt  ", "2 tbsp half-fat mayonnaise ", "4 slices half-fat mozzarella (30g/1oz each) ", "4 large wholemeal burger buns, toasted (optional) ", "4 thick slices beef tomato ", "50g/1¾oz rocket leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the turkey mince into a large bowl. Take the grated courgette in handfuls and squeeze well to remove excess water, before adding to the bowl. Toss in the dried herbs, bicarbonate of soda, chilli flakes and capers, season with salt and pepper and mix well. ", "Divide the mixture into four equal portions and shape into burgers. Place on a baking tray lined with baking parchment, cover and refrigerate while you make the slaw. ", "Put all the cabbage into a bowl, sprinkle with the salt and mix well. Leave to stand for 20 minutes, then rinse thoroughly and drain well. Mix in the other coleslaw ingredients. ", "Preheat the oven to 240C/220C Fan/Gas 7 Fan. Remove the burgers from the fridge and spray each one with a couple of sprays of oil. Cook on the top shelf of the oven for about 12 minutes, or until golden-brown and cooked through. ", "Lay a slice of mozzarella on each burger and cook for a further 4–5 minutes, or until the cheese has melted. ", "Place a turkey burger inside each bun, if serving. Top with a slice of tomato and a handful of rocket leaves, then close the bun lids. Serve with the coleslaw on the side."]}, {"isVegetarian": false, "title": "Turkey and spinach soup with sweetcorn dumplings", "url": "www_bbc_co_uk_food_recipes_turkey_and_spinach_soup_88388", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 corn on the cob", "200g/7oz self-raising flour", "60g/2¼oz butter", "1 tbsp finely chopped chives ", "salt and freshly ground black pepper", "8 turkey oysters or 1 large turkey breast", "1 carrot, peeled and roughly chopped", "1 onion, roughly chopped", "1 garlic clove, roughly chopped", "1 thyme sprig", "1 bay leaf", "225g/8oz baby spinach", "nutmeg, for grating", "salt and freshly ground black pepper", "pinch smoked paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Brush the corn on the cobs with oil and roast for 20 minutes until soft. Once cool enough to handle, cut off the kernels and set aside.", "To make the dumplings, mix the flour with the butter, chives and half the corn kernels. Season with salt and pepper and add enough water to make a dough. Divide the dough into 12 and shape into dumplings. Set aside. ", "To make the soup, the carrot, onion, garlic, thyme, bay and a pinch of salt in a pan. Cover with cold water and bring to the boil. Remove from the heat and set aside to cool.  ", "Strain the stock and discard the vegetables. Pass the stock through a sieve. Add 200ml/7fl oz of the stock to a clean pan, bring to a simmer and poach the dumplings until cooked through and fluffy. ", "Cook the spinach in the remaining stock until just wilted. Check the seasoning and then blend until smooth, adding a little water if necessary.", "Preheat the grill to medium and cook the turkey for 10 minutes on each side, until cooked through. Thinly slice. ", "Pour the soup into deep bowls and top with the turkey, dumplings and the remaining corn. Add a grating of nutmeg and a sprinkling of paprika and serve. "]}, {"isVegetarian": false, "title": "Turkey and vegetable stew", "url": "www_bbc_co_uk_food_recipes_turkey_and_vegetable_58284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 turkey leg (about 700-800g/1lb 9oz-1lb 12oz) ", "salt and pepper ", "2 onions, sliced ", "2 garlic cloves, bashed", "2 carrots, diced ", "1 litre/1¾ pints chicken stock, made from stock cube ", "500g/1lb 2oz potatoes, peeled and cut into bite-sized pieces ", "1 bunch parsley, roughly chopped "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a high heat. Add the oil, season the turkey leg on all sides and brown in the hot pan for 7-8 minutes, turning now and again to ensure that all sides are coloured.", "Turn the heat down to medium and add the onions, garlic and carrots and stir.  ", "Pour in the stock, mixing well to combine. Reduce the heat so that the stock is simmering gently. Cover with a lid and cook for one hour, stirring occasionally.", "Once the turkey leg is cooked, remove it from the stew and leave to one side to cool slightly. Add the potatoes to the stew, cover again and continue to cook for 20 minutes, or until the potatoes are tender.", "Meanwhile once cool enough to handle, remove the skin from the turkey and use a fork to help shred the meat, discarding any bones or sinew. Add the meat back to the pan with the cooked potatoes and stew mixture. Mix well, taste and adjust the seasoning as necessary.", "Once ready to serve, stir through the chopped parsley and serve hot."]}, {"isVegetarian": false, "title": "Turkey braised in red wine", "url": "www_bbc_co_uk_food_recipes_turkey_braised_in_red_26688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey legs, cut into thighs and drumsticks", "2 turkey wings", "1 bottle red wine, preferably Pinot Noir or Burgundy", "2 small onions, roughly chopped", "2 celery sticks, roughly chopped", "2 medium carrots, roughly chopped", "4 garlic cloves, roughly chopped", "thyme leaves", "black peppercorns", "1 bay leaf", "butter, for frying", "150g/5½oz pancetta, cut into thick dice", "15 button mushrooms", "15 baby onions, peeled", "100g/3½oz plain flour, seasoned with sea salt and freshly ground black pepper", "1 carrot, sliced", "1 celery stick, sliced", "sprigs of thyme", "1 bay leaf", "flat-leaf parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place all the marinade ingredients in a bowl, add the turkey pieces and leave to marinade for at least six hours or, preferably, overnight.", "Heat a large pan or flameproof casserole and add a knob of butter. Add the pancetta and lightly brown then remove it from the pan and set aside. In the same pan, cook the mushrooms and onions for a few minutes until they colour then remove them from the pan and set the pan aside.", "Remove the turkey from the marinade, strain the liquid over a bowl and discard the vegetables. Dip the turkey into the seasoned flour, shaking off the excess. Return the pan to the hob on a high heat and brown the turkey pieces on all sides. Turn down the heat and add the mushrooms, onions, carrot and celery along with the thyme and bay leaf. Pour in the strained marinade and simmer for one hour. Let the casserole rest for about 15 minutes then add the parsley and serve. "]}, {"isVegetarian": false, "title": "Turkey breast stuffed with Italian sausage and Marsala-steeped cranberries", "url": "www_bbc_co_uk_food_recipes_turkey_breast_stuffed_43707", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_breast_stuffed_43707_16x9.jpg", "ingredients": ["100g/3½oz dried cranberries", "100ml/3½fl oz Marsala", "2 tbsp olive oil", "2 banana shallots, finely chopped", "¼ tsp ground cloves", "½ tsp ground allspice", "2 tsp chopped fresh sage", "1kg/2lb 4oz Italian sausages", "2 free-range eggs, beaten", "50g/2oz parmesan, grated", "60g/2¼oz breadcrumbs", "5kg/11lb double breast turkey joint, boned, butterflied, with skin left on", "4 tbsp duck or goose fat"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the cranberries and Marsala into a small saucepan and bring to a boil, then take off the heat and leave to one side. ", "Put the oil into a large frying pan or similar heavy-based pan, and fry the shallots for a minute or so, then add the spices and shredded sage, turning them in the soft shallots.", "Squeeze the sausagemeat out of its skins, add to the pan and break it up – using a wooden fork and spatula for ease – turning it in the hot pan until it loses its pinkness. This will take about five minutes.", "Take the frying pan off the heat and turn the contents into a large bowl, mixing in the steeped cranberries and any Marsala clinging to them, and leave to cool. You can cover with cling film and put in the fridge for up to two days at this stage.", "When you are ready to stuff the turkey breast, take the bowl of sausagement out of the fridge.", "Preheat the oven to 200C/400F/Gas 6.", "Uncover the bowl of sausagemeat, add the eggs, parmesan and breadcrumbs and – I use my hands for this – mix well.", "Lay the butterflied turkey joint out in front of you. It really does look like a butterfly though admittedly a fleshy one. Spread the stuffing out first in the slight cavity in the centre of the butterfly and then outwards onto the wings though not going right up to the edge (or it will squodge out when cooking) but as evenly as possible over the whole joint.", "Carefully, in one swift but steady movement, fold one ‘wing’ over the other to close the joint, and then sit the turkey on a large roasting tin, breast bone (or where the breast bone would be) uppermost as it would look were it the whole bird, with the pointier bit furthest away from you. Thread two skewers through the base – i.e., the widest part that is nearer you – to keep it closed and smear it all over with the duck or goose fat.", "Roast the turkey breast for 2-2½ hours, then check it is cooked with a turkey or meat thermometer. When cooked, it should read 75C. (If you’re leaving it to rest, as you should or to cool, you could take it out at 73C – it wil retain heat and continue to cook for a short while once out of the oven.)", "Flex your muscles, then lift out onto a carving board, and leave to rest for at least 20 minutes. Or leave to get cold if you are eating it as part of a buffet.", "Cut through the whole joint in wide slices right across; they will need to be quite thick, at least 1-2cm/½-1in, to keep the stuffing intact within the slice.", "As you place it on table or sideboard, dot around it the condiments of your choice: I revert to Christmas in Italy here by putting a lusciously extravagant pot or two of Italian mostarda di Cremona on the table alongside: this is a hot and sweet preserve of mustardy candied fruits that gleam beautifully and taste both festive and fabulous."]}, {"isVegetarian": false, "title": "Turkey crown and legs with chestnut stuffing", "url": "www_bbc_co_uk_food_recipes_turkey_crown_and_legs_32901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 5.5kg/12lb turkey, split into crown and boned legs, fully thawed if frozen", "100g/3½oz softened butter", "salt and freshly ground black pepper", "15g/½oz butter", "1 onion, finely chopped", "600g/1lb 5oz sausagemeat", "200g/7oz chestnuts, crumbled", "1 pear, peeled, cored and finely chopped", "2 apricots, stones removed, finely chopped", "1 tsp allspice berries, ground", "pinch freshly grated nutmeg", "2 large sprigs fresh thyme, leaves picked and chopped", "1 unwaxed lemon, finely grated zest only", "2 tbsp plain flour", "600ml/20fl oz turkey stock", "100ml/3½fl oz dry white wine"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["The day before you want to cook the turkey, put it on a plate and sprinkle with salt. Refrigerate it overnight, covered, ensuring the juices don't drip onto other foods in your fridge. ", "The day you want to cook the turkey, pat it dry with kitchen paper. Leave it to stand for an hour to return to room temperature. Preheat the oven to 190C/170C Fan/Gas 5. ", "Meanwhile, to make the stuffing, heat the butter in a frying pan, add the onion and fry until soft and translucent. Leave it to cool to room temperature. ", "Put the sausagemeat and all the remaining stuffing ingredients in a bowl and season with salt and pepper. Add the onion and stir well. ", "Lay out the boned legs, skin-side down. Put a handful of the stuffing in the centre of the thickest part of each leg, then wrap the sides around it. When placed cut-side down it will look like a short, fat drumstick. Stuff the turkey crown with the rest of the stuffing, being careful not to pack it in. ", "Weigh the stuffed crown and make a note of the weight. Place the crown in a roasting tray. Smear most of the butter over the breasts, reserving a little for the legs. Cover the tray with kitchen foil.", "Work out the cooking time; it will be 15 minutes per kg/2lb 4oz, plus 90 minutes (for example for a 3kg/6lb 8oz crown including the stuffing it will be 2¼ hours). Smear the butter over the legs and add them 45 minutes before the end of the cooking time, removing the foil at the same time so the skin can brown and crisp.", "To check whether the turkey is cooked, use a meat or probe thermometer – the thickest part of the meat and the stuffing should register 71C/160F. The juices should also run clear when the thickest part of the turkey is pierced with a skewer.", "Put the crown and legs on a warmed platter to rest.", "Meanwhile, to make the gravy, strain off all the liquid from the roasting tin. Sprinkle the tin with the flour and set over a medium heat. Stir until the flour has picked up most of the sediment from the bottom of the tin. Add some of the stock and stir until you have deglazed the tin. ", "Transfer the gravy to a saucepan. Stir in any remaining stock and the wine. Bring to the boil, then turn down the heat and simmer for a few minutes. Check for seasoning and adjust if necessary.", "Carve the crown and legs into slices and serve with the gravy."]}, {"isVegetarian": false, "title": "Turkey curry", "url": "www_bbc_co_uk_food_recipes_turkey_curry_45626", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_curry_45626_16x9.jpg", "ingredients": ["1 onion, chopped", "4 fresh birds eye chillies, seeds removed, chopped", "1 tsp coriander seeds", "2 tsp tamarind paste", "1 tbsp caster sugar", "2 garlic cloves, bruised", "1 small knob root ginger, peeled and chopped", "1 tbsp sunflower oil, for frying", "500g/1lb 2oz turkey breast, sliced", "3 sprigs thyme, leaves only", "400ml/14fl oz coconut milk", "150ml/5fl oz chicken or turkey stock", "2 large waxy potatoes, peeled and diced", "250g/9oz fresh spinach, chopped", "1 bunch fresh coriander, chopped", "50g/1¾oz whole peeled almonds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chopped onion, chillies, coriander seeds, tamarind, sugar and one clove of garlic into a blender or food processor with the ginger. Pulse until blended into a paste.", "Heat the oil in a large frying pan and brown the turkey, in batches if necessary, with the remaining garlic clove and thyme. Remove the turkey from the pan and discard the garlic. In the same pan, cook the blended paste for a few minutes then return the turkey to the pan and add the coconut milk, stock and potatoes.", "Cook gently for 20 minutes until the turkey has cooked through and the sauce has thickened. Finally, stir in the spinach, fresh coriander and almonds and warm through. Remove from the heat and serve."]}, {"isVegetarian": false, "title": "Turkey crown with orange", "url": "www_bbc_co_uk_food_recipes_turkey_crown_with_orange_47645", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_crown_with_orange_47645_16x9.jpg", "ingredients": ["2.2kg/4lb 14oz turkey crown ", "2 tsp chopped thyme leaves", "50g/1¾oz butter, softened ", "2 small oranges, one thinly sliced, one cut in half", "1-2 tbsp vegetable oil", "3 tbsp plain flour", "6 tbsp port ", "450ml/¾ pint hot turkey or chicken stock", "splash Worcestershire sauce ", "2 tbsp soy sauce ", "salt and freshly ground black pepper"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Loosen the skin on the turkey crown by pushing your fingers (or rubber spatula) between the skin and the meat, moving it around to get to the tricky places and taking care not to tear the skin.", "Mix the thyme leaves with the softened butter until well combined, then smear the mixture underneath the skin of the bird. Arrange the orange slices in two neat rows under the skin, on top of the herb butter. ", "Place one of the orange halves under the skin at the neck end of the bird, and any orange trimmings in the neck cavity. ", "Transfer the turkey crown to a small roasting tray. Rub all over with the oil and season with salt and freshly ground black pepper. Roast in the oven for about 1½-2 hours, or until the juices run clear when the turkey is pierced in the thickest part with a skewer and no traces of pink remain. During cooking, check the turkey every 30 minutes, baste occasionally and cover with aluminium foil if it is browning too quickly.", "About 15 minutes before the end of cooking, squeeze the juice from the remaining half-orange over the turkey. Return the turkey to the oven, uncovered, to allow the skin to crisp up. ", "Transfer the turkey crown to a serving platter and set aside to rest, covered in foil, for 30 minutes. Reserve the meat juices left in the roasting tray.", "For the gravy, pour the juices from the roasting tray into a jug and allow to settle. Skim all but 4 tablespoons of the fat from the top, then tip the remaining gravy into a saucepan and heat over a medium heat until the gravy is just simmering. ", "Whisk in the flour until the mixture is smooth and well combined, then pour in the port and stock and whisk again until smooth. Continue to simmer the gravy until it starts to thicken, then add a few drops of Worcestershire sauce and the soy sauce. ", "Bring the gravy to the boil, adding any remaining turkey juices released while the meat was resting.  Season, to taste, with salt and freshly ground black pepper, then decant into a warmed serving jug and serve with the turkey. "]}, {"isVegetarian": false, "title": "Turkey ‘en croute’ with tomatoes and cucumber salsa", "url": "www_bbc_co_uk_food_recipes_turkey_en_croute_with_78858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tomatoes, deseeded, chopped", "½ cucumber, skinned, deseeded, chopped", "1 large red onion, finely chopped", "1 green chilli, deseeded, finely chopped", "1 tbsp chopped marjoram", "2 tbsp chopped parsley", "3 tbsp olive oil", "1 lemon, juice only", "salt and pepper", "1 turkey breast (approximately 2kg/4lb 8oz), skin removed", "1 tbsp oil, plus extra for frying the pancakes", "25g/1oz butter", "salt and pepper", "2 free-range eggs", "170g/6oz plain flour", "425ml/¾ pint milk", "1 tbsp chopped fresh parsley", "50g/2oz butter, melted", "1 shallot, finely chopped", "340g/11¾oz button mushrooms, very finely chopped", "450g/1lb puff pastry", "2 free-range eggs, beaten, for egg wash"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa, mix all the ingredients together and leave to stand for two hours.", "For the turkey en croute, fold the thin part of the turkey breast under and tie with cook’s string to make an even shape.", "Heat one tablespoon of oil and butter in a large frying pan. When hot, add the turkey and fry to seal and colour the meat on all sides. ", "Season with salt and pepper and leave to cool. When cool, remove the string.", "Make pancakes by mixing the eggs and flour together in a bowl. Slowly add the milk, beating all the time until smooth. Add the chopped parsley and half of the melted butter. Season with salt and pepper.", "Heat a little oil in a large frying pan (approximately 25cm/10in). When hot, add a ladle of pancake batter and immediately start swirling it round the pan to get a nice even layer. Cook the pancake for approximately 30-40 seconds. Use a palette knife to lift the pancake carefully to look at the underside to check it is golden-brown before turning over. Cook the other side for approximately 30-40 seconds and transfer to a plate. Repeat until all the batter has been used.", "Add the remaining melted butter to a pan. Gently fry the chopped shallots without colouring. Add the mushrooms and cook slowly until all the moisture from them has evaporated. Season and set aside to cool.", "On a lightly floured work surface roll out the puff pastry into a rectangle, at least three times as wide as the turkey and 15cm/6in longer. The pastry should be about 3mm thick.", "Brush the egg wash around the edges of the pastry. ", "Lay the pancakes on a work surface so they overlap to form a sheet. Smear some of the the shallot and mushroom mixture down the middle and lay the turkey breast on top. Smear the turkey with the remaining shallot and mushroom mixture.", "Draw the pancakes over the turkey to wrap like a parcel. Lay the turkey parcel on the puff pastry, then pull the pastry over and seal using egg wash. Turn over onto a roasting tray (so the pastry seams are hidden) and make a small incision in the pastry to allow steam to escape.", "Brush with egg wash and rest for 30 minutes in the fridge. Then remove from the fridge and bring to room temperature before cooking. Preheat the oven to 220C/425F/Gas 7.", "Brush the pastry again with egg wash and bake for 10 minutes.", "Reduce the oven temperature to 180C/350F/Gas 4 and cook for a further 50 minutes, or until the pastry is crisp and golden-brown.", "Leave to rest for 15 minutes, then slice and serve with the salsa."]}, {"isVegetarian": false, "title": "Turkey meatballs with cabbage", "url": "www_bbc_co_uk_food_recipes_turkey_dumplings_with_21880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shallot, chopped", "4 spring onions, chopped", "2 garlic cloves, crushed", "½ tsp chopped root ginger", "1 red chilli, deseeded and chopped", "6 button mushrooms, chopped", "350g/12oz minced turkey", "2 tbsp Worcestershire sauce", "1 lemon, finely grated zest only", "salt and pepper", "2 tbsp vegetable oil", "3 tbsp soy sauce", "½ glass dry white wine", "150ml/¼ pint chicken stock", "2 tsp cornflour", "dash vegetable oil", "1 red chilli, seeds removed, finely chopped", "1 garlic clove, crushed", "½ small green cabbage, shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a blender combine the shallot, spring onion, garlic, ginger, chilli and mushrooms. Pulse to form a smooth purée, then transfer to a bowl. Add the turkey, Worcestershire sauce and lemon zest, and mix well. Season with salt and pepper.", "Heat a little vegetable oil in a large frying pan or wok and cook a small amount of the turkey mixture. Taste to check the seasoning and adjust as necessary.", "Roll the remaining mixture into 28 evenly sized balls and fry in more vegetable oil until golden-brown all over. Cook for another 2-3 minutes, then remove from the pan and keep warm.", "For the cabbage, mix the soy sauce, white wine, stock and cornflour together until smooth. ", "Add the chilli and garlic to a pan with a dash of vegetable oil and quickly fry over a high heat. Add the cabbage and cook for two minutes. Add the turkey balls and cook for 30 seconds.", "Pour in the cornflour mixture, bring to the boil and cook for two minutes. Serve immediately."]}, {"isVegetarian": false, "title": "Turkey jambalaya", "url": "www_bbc_co_uk_food_recipes_turkey_jambalaya_96737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_jambalaya_96737_16x9.jpg", "ingredients": ["12 large prawns, peeled and deveined", "2 tbsp cajun seasoning", "2 tbsp olive oil", "400g/14oz leftover turkey, pulled into chunks", "200g/7oz chorizo, or leftover chipolatas, skinned and cut into rounds", "2 onions, finely chopped", "2 green peppers, roughly diced", "2 celery sticks, diced", "4 garlic cloves, finely chopped", "2 bay leaves", "4 fresh tomatoes, peeled and chopped, or 200g/7oz chopped tomatoes", "400g/14oz long grain rice, well-rinsed of starch (not easy or quick cook)", "1 litre/1¾ pint turkey stock", "salt and freshly ground black pepper", "lemon wedges", "hot sauce, to taste", "2 tbsp finely chopped parsley", "1 tbsp finely chopped celery leaf (optional), found in the centre of a celery heart"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the prawns in a bowl and sprinkle over one tablespoon of the Cajun seasoning. Rub it in well so they are completely coated. Heat one tablespoon of olive oil in a pan and add the turkey. Sprinkle over the remaining Cajun seasoning and fry briefly. Remove from the heat and set aside.", "Heat another tablespoon of the olive oil in a large casserole. Add the sausage and fry until crisp and brown. Remove from the casserole and add the onions, peppers and celery. Cook over a medium heat until they soften and start to caramelise around the edges, then add the garlic and cook for another minute. ", "Add the bay leaf and the tomatoes. Sprinkle over the rice, then pour over the stock. Return the sausage to the casserole and season with salt and pepper. Cover and simmer over a gentle heat for 15 minutes.", "Lightly stir in the cooked turkey, then place the prawns on top. Cover again and cook on a low heat for a further five minutes so that the prawns can steam. If you think the rice is already cooked, turn off the heat and leave to stand – the prawns will still cook in the residual steam.", "Serve with lemon wedges, hot sauce and a good sprinkling of parsley and celery leaf if liked."]}, {"isVegetarian": false, "title": "Turkey, leek and ham pie", "url": "www_bbc_co_uk_food_recipes_turkey_leek_and_ham_pie_79037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_leek_and_ham_pie_79037_16x9.jpg", "ingredients": ["butter, for frying", "1 large onion, chopped", "2 large carrots, sliced into lozenges", "2 large leeks, sliced into 2cm/¾in pieces, washed ", "200ml/7fl oz double cream", "200ml/7fl oz chicken or turkey stock", "500g/1lb 2oz cooked turkey, cut into bite-size pieces", "200g/7oz cooked ham, cut into bite-size pieces", "10 button mushrooms", "pinch cayenne pepper", "2 tbsp chopped tarragon", "thyme leaves", "sea salt and freshly ground black pepper", "225g/8oz frozen puff pastry, defrosted", "1 free-range egg, beaten", "2 tbsp parmesan, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Heat a large pan over a medium heat. Add a knob of butter and gently cook the onion until soft but not brown. Add the carrots and leek and continue cooking for five minutes until the carrots begin to soften. Cover with the cream and stock and simmer until the sauce starts to thicken. Add the turkey, ham, mushrooms, cayenne and herbs then season to taste with salt and freshly ground black pepper and remove the pan from the heat.", "Pour the filling into a ceramic pie dish. Roll out the pastry to make a lid for the pie and strips to line the rim of the dish. Press the strips onto the rim, moistening them with a little water, then press down the lid firmly and brush with the beaten egg. Sprinkle with the parmesan and cook in the oven for 20 minutes until the pastry is golden-brown."]}, {"isVegetarian": false, "title": "Turkey, ham and stuffing pie", "url": "www_bbc_co_uk_food_recipes_turkey_ham_and_stuffing_59799", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour", "125g/4½oz butter, chilled and diced", "75g/2½oz lard, chilled and diced", "pinch salt", "iced water", "1 free-range egg, beaten", "15g/½oz butter", "3 leeks, thickly sliced", "salt and freshly ground black pepper", "100ml/3½fl oz white wine", "500g/1lb 2oz cooked turkey meat, diced", "200g/7oz cooked ham, diced", "200g/7oz stuffing, broken up", "50g/1¾oz butter", "50g/1¾oz plain flour", "400ml/14fl oz turkey or chicken stock", "200ml/7fl oz full-fat milk", "100ml/3½fl oz single cream", "few tarragon leaves, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["First make the pastry. Rub the flour, butter and lard together until it resembles fine breadcrumbs and add a good pinch of salt. ", "Add just enough iced water to bind the pastry together without it being too crumbly, then form into a ball, wrap in cling film and chill in the fridge.", "To make the filling, heat the butter in a casserole and add the leeks. Season with salt and pepper then add the wine. Cover and leave on a low heat until the leeks are just tender, then remove the leeks with a slotted spoon and reserve any liquid.", "For the sauce, melt the butter in a separate saucepan and add the flour. Stir until you have a thick roux, then gradually add the stock, milk and cream, stirring thoroughly with each addition to make a creamy béchamel. Add the reserved liquid from cooking the leeks.", "Add the turkey, ham, stuffing and leeks to the béchamel and stir very gently to combine – be careful as you don’t want the meat or leeks to break up. Leave to cool down completely.", "Preheat the oven to 200C/180C Fan/Gas 6 and put a baking tray in the oven to heat up.", "To assemble the pie, take two-thirds of the pastry. Roll it out to line a large pie dish – around 25cm/10in in diameter. Add the filling – you should find that it will more than fill the pie dish and give you a slightly domed top. ", "Roll out the remaining pastry. Brush the edges of the bottom piece of pastry with beaten egg, then place over the top piece. Trim the edges and crimp together. Use the trimmings to make any decorations you like, then brush the whole thing with egg wash. Cut two small holes in the centre of the crust.", "Bake in the oven for 35-40 minutes, or until the pie is a rich golden-brown colour and the filling is piping hot."]}, {"isVegetarian": false, "title": "Turkey meatballs", "url": "www_bbc_co_uk_food_recipes_turkey_meatballs_26601", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_meatballs_26601_16x9.jpg", "ingredients": ["4 tsp olive oil or sunflower oil", "1 onion, finely chopped", "sea salt and freshly ground black pepper", "2 garlic cloves, finely chopped", "1 tsp smoked paprika (sweet or hot variety, to taste)", "2 tsp ground cumin", "2 tsp ground coriander", "400g/14oz turkey mince", "½ bunch fresh coriander, leaves only, finely chopped", "2 ripe tomatoes, seeds removed, chopped", "2 spring onions, finely sliced diagonally", "1 avocado, peeled, stone removed, chopped", "1 lime, juice and zest only", "½ bunch fresh coriander, leaves only, finely chopped", "1 green chilli, finely chopped", "drizzle olive oil", "lime wedges", "lettuce leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat half the oil in a small frying pan over a medium heat. Add the onion and a pinch of salt and cook for five minutes, or until softened. Add the garlic and spices and cook for a further two minutes. Remove from the heat, tip into a bowl and leave to cool. ", "Meanwhile, for the salsa, combine the tomatoes, spring onions, avocado, lime and coriander in a bowl. Mix in half the chilli, taste and stir in more chilli if required. Add a drizzle of olive oil and season to taste with pepper, then set aside. ", "Once the onion mixture has cooled, add the turkey and coriander and mix thoroughly. Using wet hands, shape the mixture into 16 golf-ball sized balls and then transfer to a baking tray and cover with cling film. ", "Refrigerate for 15-30 minutes; this will help the meatballs to firm and will stop them from falling apart during cooking.", "Preheat the oven to 200C/400F/Gas 6. Heat the remaining oil in a large, non-stick frying pan and fry the meatballs for 2-3 minutes, turning occasionally, until golden-brown on all sides. You may need to do this in batches to avoid overcrowding the pan.", "Transfer the meatballs to a clean baking tray and cook in the oven for 10-12 minutes, or until cooked through. Leave to rest for a few minutes before serving with the salsa, lime wedges and lettuce leaves."]}, {"isVegetarian": false, "title": "Turkey meatballs in tomato sauce", "url": "www_bbc_co_uk_food_recipes_turkey_meatballs_in_16570", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_meatballs_in_16570_16x9.jpg", "ingredients": ["1 onion, peeled", "1 stick celery", "2 tbsp garlic oil", "1 tsp dried thyme", "2 x 400g/14oz cans chopped plum tomatoes, plus approximately 2 full cans of water", "1 tsp sugar", "1 tsp sea salt flakes or ½ tsp pouring salt", "black pepper, to taste", "500g/1lb 2oz turkey mince", "1 free-range egg", "3 tbsp breadcrumbs", "3 tbsp grated parmesan", "1 tsp Worcestershire sauce", "½ tsp dried thyme"], "serves": "Serves 4-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, put the onion and celery into a food processor and blitz to a mush. (Or you can chop as finely as humanly possible by hand.) Reserve 2 tablespoons of the mixture for the meatballs.", "Warm the garlic oil in a large, heavy-based saucepan or casserole, add the onion and celery mixture, along with the thyme, and cook at a moderate to low heat, stirring every now and again, for about 10 minutes.", "Add the cans of plum tomatoes, filling up each empty can with water to add to the pan. Season with the sugar, salt and pepper, stir well and let the mixture come to a bubble, then turn the heat down and simmer the sauce gently while you get on with the meatballs.", "For the meatballs, put all the ingredients for the meatballs, including the reserved chopped onion and celery, and salt according to preference, into a large bowl and gently mix together with your hands. Don’t overmix, as that will make the meatballs dense-textured and heavy.", "When all the meatball ingredients are not too officiously amalgamated, start rolling them into balls. The easiest way is to pinch out an amount about the size of a generously heaped teaspoon and roll it into a ball between the palms of your hands. Put each meatball onto a baking tray lined with baking parchment or greaseproof paper. You should get about 50 little meatballs.", "Drop the meatballs gently into the simmering sauce; I try to let these fall in concentric circles working round the pan from the outside edge inwards, in the vaguest of fashions.", "Let the meatballs simmer in the sauce for 30 minutes, or until cooked through. Serve with rice, pasta, couscous or however you so please. "]}, {"isVegetarian": false, "title": "Turkey Holstein", "url": "www_bbc_co_uk_food_recipes_turkey_holstein_14324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 turkey escalopes", "4 tbsp plain flour", "1 tsp ground paprika", "1 tsp English mustard", "6 medium free-range eggs", "250g/9oz white breadcrumbs", "2 tbsp olive oil", "vegetable oil, for frying", "16 tinned anchovy fillets ", "2 tbsp sherry vinegar", "170g/6oz unsalted butter", "2 tbsp nonpareille capers", "1 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the turkey escalope and flatten using a meat hammer (alternatively place between two pieces of cling film and pound with a rolling pin).", "In a shallow bowl, mix the flour, paprika, mustard powder, salt and pepper together.  In a separate bowl, beat two of the eggs.", "Pass the turkey escalopes through the flour mixture, dredge in beaten egg and coat in breadcrumbs, shaking off any excess at each stage.", "Heat a little olive oil in a large frying pan. Fry the turkey presentation-side down first until golden-brown (you may need to do this in batches). Turn over and fry the other side until cooked through. Remove from the pan and drain on kitchen paper.", "Heat a separate frying pan and fry the remaining eggs in vegetable oil until cooked to your liking.", "Put the escalopes on serving plates, with the fried eggs on top. Arrange the anchovies around the plate. ", "Discard any excess fat from the frying pan and add the vinegar. Simmer until the volume of liquid has reduced by half.  Shake in the butter and strain through a fine sieve into a clean pan. Add the capers and parsley. Pour the sauce over the eggs and serve immediately."]}, {"isVegetarian": false, "title": "Turkey osso bucco with salsa verde", "url": "www_bbc_co_uk_food_recipes_turkey_osso_bucco_with_47340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 tbsp flour", "salt and freshly ground black pepper", "4 turkey thighs, skin on", "1 onion, chopped", "2 carrots, chopped", "2 celery sticks, chopped", "2 garlic cloves, crushed", "2 sprigs thyme, tied together", "2 bay leaves", "6 tomatoes, cut into quarters", "1 tsp sugar", "300ml/½ pint chicken stock", "125ml/4fl oz dry white wine", "1 orange, zest only, grated", "1 tbsp chopped parsley", "big bunch parsley", "2 tbsp baby capers", "2 tbsp chopped cornichons", "12 anchovy fillets", "3 garlic cloves, peeled and finely chopped", "3 tbsp red wine vinegar", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/340F/Gas 3½.", "Heat the olive oil in an ovenproof casserole. Put the flour in a bowl, season with salt and pepper.", "Coat the thighs with flour and shake off the excess. Fry in the casserole skin-side down first, and then turn to colour all over. Remove the meat from the pan and set aside.", "Put the onion, carrot and celery into the casserole dish and fry until golden-brown, then add the garlic, thyme and bay leaves.", "Add the tomatoes and sugar to the casserole and put the thighs on top of vegetables in a single layer.", "Cover with stock and white wine and bring to the boil. Cover with a circle of greaseproof paper and a lid.", "Cook in the oven for about two hours, or until well cooked.", "Carefully lift the turkey from the casserole and set aside somewhere warm. To thicken the sauce (if necessary) bring the cooking liquor to a boil and cook until the volume of liquid has reduced . ", "For the salsa verde, place all the ingredients in a bowl and mix together.", "Mix the orange zest and parsley.", "To serve, put a thigh in each serving dish and pour over the sauce. Sprinkle with the zest and parsley and serve with the salsa verde."]}, {"isVegetarian": false, "title": "Turkey pot pie", "url": "www_bbc_co_uk_food_recipes_turkey_pot_pie_09104", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_pot_pie_09104_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "100g/3½oz smoked bacon lardons", "1 onion, sliced", "1 garlic clove, crushed", "2 carrots, chopped", "200g/7oz leftover turkey, shredded", "1 red chili, chopped", "1 tbsp tomato purée", "200ml/7fl oz red wine", "100ml/3½oz chicken stock", "1 free range egg, beaten for egg wash", "250g/10oz shortcrust pastry"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Fry the bacon lardons until crisp. Remove the lardons using a slotted spoon and set aside.", "In same pan, fry the onions and garlic for 5-6 minutes, or until golden-brown and softened.", "Add the remaining ingredients, except the egg and pastry. Bring the mixture to the boil and simmer for 25 minutes. Set aside to cool.", "Preheat the oven to 180C/350F/Gas 5. ", "Divide the mixture between four individual pie dishes. Cut the pastry into four pieces, each big enough to cover the pie dish. Brush the edge of each dish with egg wash and cover with the pastry. Trim any excess pastry and brush the lid with the remaining egg wash.", "Cook for 20-25 minutes until the lid is crisp and golden-brown. "]}, {"isVegetarian": false, "title": "Turkey saltimbocca", "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_78349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 turkey medallions, steaks or escalopes, around 150g/5½oz each (may be a little smaller)", "1 tbsp plain flour", "salt and freshly ground black pepper", "8 sage leaves", "8 slices Parma ham", "2-3 tbsp olive oil", "15-30g/½-1oz butter", "1 lemon, zest only", "1 tsp dried sage", "250ml/9fl oz Marsala wine", "100ml/3½fl oz chicken stock", "1 large potato, peeled", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First prepare the turkey. Put each steak between two large pieces of cling film. Lay it on a work surface, then beat it with a meat mallet or a rolling pin until it is as thin as you can get it without it breaking up. Repeat with the remaining turkey. Cut each escalope in half.", "Season the flour with salt and pepper then use to dust the flattened turkey. Pat off any excess. Place a sage leaf in the centre of each piece of turkey, then wrap a slice of Parma ham round it. ", "Heat the olive oil and butter in a large frying pan. Fry 2-3 of the escalopes (depending on the size of your pan) on each side for 3-4 minutes, or until the meat is completely cooked through and the ham has crisped up. Remove from the pan and keep warm. Add more oil and butter and continue as before. ", "When you have cooked all the escalopes, turn up the heat. Add the lemon zest, dried sage and Marsala to the pan. Leave to simmer for a couple of minutes until the Marsala looks syrupy, then add the chicken stock. Continue to cook until the sauce again looks syrupy.", "For the game chips, cut the potato into very thin rounds, preferably with a mandoline. Cover with cold water in a bowl for 10-15 minutes to help remove some of the starch. Drain and pat dry as thoroughly as possible with a tea towel or kitchen towel.", "Half fill a saucepan or deep fat fryer with vegetable oil. Heat to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) If you don’t have a thermometer gauge, test the heat of the oil by dropping in a cube of bread – it should crisp up and brown in 30 seconds. ", "Fry the chips a few at a time in the oil – they are done when they have floated to the surface and have turned a light golden-brown. Remove from the oil and continue with the remaining potato slices. Sprinkle with salt and serve immediately.", "Serve the turkey saltimbocca with the sauce poured over and the game chips on the side."]}, {"isVegetarian": false, "title": "Turkey saltimbocca", "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_34007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey breast medallions", "12 small slices prosciutto", "12 small sage leaves", "1 tbsp olive oil", "115g/4oz unsalted butter", "salt and pepper", "2 tbsp chicken stock", "2 tbsp dry white wine", "squeeze fresh lemon juice", "2 tbsp chopped parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place each turkey medallion between sheets of cling film and use a rolling pin to flatten them.  ", "Discard the cling film and lay a sage leaf and a slice of prosciutto on each piece of turkey. Secure in place with cocktail sticks.", "Heat the olive oil in a pan and then add 25g/1oz of the butter. Cook the medallions, prosciutto side up, then turn over and cook the other side. Remove from the pan and place on kitchen paper. Season with salt and pepper. ", "Remove any excess fat from the pan and add the chicken stock and white wine. Bring to the boil and then simmer until the volume of liquid is reduced by half. Strain into a clean pan and add a squeeze of lemon juice.", "Add the rest of the butter, taste and check the seasoning is to your liking.  ", "Add the parsley and serve with the turkey."]}, {"isVegetarian": false, "title": "Turkey saltimbocca with parsley beurre noisette, beans and cavolo nero", "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_with_13526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 turkey breast, skinless and boneless, cut into four thin slices", "4 large slices Gruyère, about 3mm thick ", "4 large slices cooked ham ", "4 sage leaves", "4 long sprigs rosemary, needles removed from the bottom third and the end sharpened to make a skewer", "150g/5½oz butter ", "2 tbsp olive oil ", "110ml/4fl oz Marsala wine", "½ lemon, juice only", "2 tbsp chopped parsley", "salt and freshly ground black pepper ", "200g/7oz green beans, trimmed", "50g/1¾oz butter", "200g/7oz cavolo nero", "freshly grated nutmeg", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the turkey, place the turkey slices between two pieces of cling film then use a rolling pin or meat hammer to press to about 5mm/¼in thick.", "Remove the cling film and place the cheese on top of one half of the turkey slices, top with the ham and sage then season with salt and freshly ground black pepper.", "Fold the other half of the turkey over the top and press down lightly. Secure the edge with the rosemary skewer. ", "Heat 50g/1¾oz of the butter and the olive oil in a frying pan. Add the turkey parcel and fry on each side for 2–3 minutes until the turkey is cooked through and the cheese is just starting to ooze out.", "Add the Marsala and deglaze by scraping any caramelised juices from the base of the pan. Cook until the liquid has reduced enough to just coat the turkey.", "Remove the turkey from the pan and place on a plate to rest. ", "Return the frying pan to the heat, add the remaining butter and heat until nut-brown (to make a beurre noisette). Add the lemon juice and parsley and stir through. Season to taste with a little salt and freshly ground black pepper.", "For the garnish, bring a pan of salted water to the boil, add the beans and simmer for 3–4 minutes, or until just tender.", "Drain, toss with a little of the butter and season to taste with salt and freshly ground black pepper.", "Heat a frying pan until medium hot, add the remaining butter, cavolo nero and 50ml/1¾fl oz water. Cook gently until the cabbage is tender. Season to taste with salt, black pepper and a little freshly grated nutmeg.", "To serve, place a turkey parcel on each plate and pile the beans and cavolo nero alongside. Spoon the beurre noisette over the top and finish with a squeeze of lemon."]}, {"isVegetarian": false, "title": "Turkey saltimbocca with mushrooms and butternut squash", "url": "www_bbc_co_uk_food_recipes_turkey_saltimbocca_with_78094", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 garlic clove, crushed", "1 shallot, finely chopped", "100g/3½oz chestnut mushrooms, finely chopped", "100g/3½oz button mushrooms, finely chopped", "2 tbsp chopped fresh tarragon", "1 turkey breast, skinless and boneless, cut into 4 thin slices", "4 slices Parma ham ", "salt and freshly ground black pepper", "100g/3½oz plain white flour", "2 free-range eggs, beaten", "100g/3½oz Japanese panko breadcrumbs", "150g/5½oz butter ", "2 tbsp olive oil ", "squeeze lemon juice", "1 tbsp parsley, chopped", "2 tbsp olive oil", "1 garlic clove, chopped", "1 shallot, chopped", "1 butternut squash, peeled and cut into small cubes", "2 star anise"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the saltimbocca, preheat the oven to 200C/400F/Gas 6.", "Heat a pan and, once hot, add the butter. Add the garlic and shallot and cook for 2-3 minutes. Add the chopped mushrooms and cook for a further 2-3 minutes, then add the tarragon.", "Place the turkey slices between two pieces of cling film, then use a rolling pin or meat hammer to press to about 5mm/¼in thick. Discard the cling film.", "Place the ham and cooked mushrooms on one half of each turkey slice. Season with salt and freshly ground black pepper. Fold the other half of the turkey slice over the top and press down lightly. ", "Put the flour, egg and breadcrumbs into three shallow bowls. Taking care not to allow the filling to escape, pass the turkey first through the flour, then egg and then coat it in breadcrumbs.", "Heat the butter and the olive oil in a frying pan. Add the turkey parcels and fry on each side for 2-3 minutes until browned.", "Transfer to the oven for 5-10 minutes, or until cooked through.", "For the roasted butternut squash, heat a large frying pan and add the oil. Once hot, add the garlic and shallot and cook for 2-3 minutes. Add the squash and star anise and cook for five minutes or until the squash has cooked through. Remove the star anise.", "Serve the squash with the turkey saltimbocca. Finish with a squeeze of lemon juice and sprinkle with parsley."]}, {"isVegetarian": false, "title": "Turkey skewers and bulgur salad", "url": "www_bbc_co_uk_food_recipes_turkey_skewers_and_58075", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_skewers_and_58075_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "2 tbsp lemon juice", "1 tsp paprika", "3 tbsp chopped flat leaf parsley, plus extra to garnish", "400g/14oz turkey breast, diced", "salt and freshly ground black pepper", "400ml/14fl oz chicken stock", "250g/9oz bulgur wheat", "400g/14oz tin green lentils, rinsed and drained", "½ cucumber, diced", "10 cherry tomatoes", "25g/1oz mint, chopped", "lemon wedges, to garnish", "4 tbsp hummus", "1 tbsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put 8 wooden skewers in warm water and let them soak while you prepare the turkey. ", "Mix together the oil, lemon juice, paprika and parsley in a bowl, and season to taste with salt and freshly ground black pepper. Add the turkey and turn to coat thoroughly. Set aside in the fridge for at least 20 minutes.", "Preheat the grill to a hot setting.", "Remove the turkey from the bowl (discard any marinade) and thread the pieces on the skewers. Cook under the grill, turning once or twice, for 10 minutes, or until cooked through.", "Meanwhile, bring the stock to the boil. Place the bulgur wheat in a medium sized lidded pot and cover with the stock. Cover with the lid and simmer over a medium heat for 12-15 minutes, or until the bulgur wheat is tender and has absorbed the stock.", "When the bulgur is cooked, drain and spread out to cool. Stir in the green lentils, cucumber, tomatoes and mint.", "For the dressing, combine the hummus with the lemon juice and 1 tablespoon of water.", "Place the turkey skewers on the bulgur wheat salad and spoon over the dressing. Garnish with lemon wedges and flat leaf parsley and serve. "]}, {"isVegetarian": false, "title": "Turkey, stuffing and cranberry Chelsea buns", "url": "www_bbc_co_uk_food_recipes_turkey_stuffing_and_77957", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_stuffing_and_77957_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "50g/2oz caster sugar", "10g/¼oz salt", "40g/1½oz unsalted butter cut into small pieces, plus extra for greasing the tin", "2 free-range eggs", "2 x 7g sachets fast-acting dried yeast", "150ml/5fl oz lukewarm milk", "90ml/6 tbsp lukewarm water ", "280g/10oz cranberry sauce", "300g/10½oz leftover turkey, shredded", "200g/7oz leftover sage and onion stuffing"], "serves": "Makes 10-12 buns", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, caster sugar and salt into a large mixing bowl and stir to combine. Add the butter, eggs, yeast, milk and warm water. ", "Mix the ingredients with your hands until a rough dough is formed. ", "Tip the dough onto a well-floured surface and knead well for ten minutes, or until the dough is smooth and elastic.", "Place the dough into a clean, oiled bowl , cover with a damp tea towel and leave to rise for one hour. ", "Tip the dough out onto a very lightly floured surface.", "Roll out the dough into a rectangle about 50x28cm/20x11in. Turn the dough so that the longer edge is closest to you and “tack” the dough to the work surface by pressing it down firmly with your finger.", "Spread cranberry sauce onto the surface of the dough with the back of a spoon. Sprinkle the shredded turkey and stuffing on top.", "Roll the long side of the dough towards you quite tightly, forming a spiral inside. When rolled up, release the tacked edge and place it onto a floured part of the surface. With a sharp knife cut the sausage shape into 5cm/2in rounds.", "Place all spiral rounds, swirly side up, into a large, deep roasting tin or baking tray greased thoroughly with butter, leaving a 1cm/½in space between each one. You want them to be close enough so that they will bake with their sides touching.", "Cover with a damp tea towel and set aside in a warm place to rise for an hour. They should have expanded and be touching each other.", "Preheat the oven to 200C/400F/Gas 6.", "When the buns are ready, put them in the oven and bake for 15-20 minutes.", "After removing the buns from the oven, let them cool slightly before removing them from the tin and placing on a cooling rack.", "When ready to eat, pull the buns apart to reveal the soft edges."]}, {"isVegetarian": false, "title": "Turkey and wild mushroom sauté with cream and stuffing dumplings", "url": "www_bbc_co_uk_food_recipes_turkeyandwildmushroo_87803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "55g/2oz wild mushrooms, sliced", "pinch medium curry powder", "225g/8oz ready-cooked turkey meat, sliced", "300ml/½ pint double cream", "150g/5oz ready-cooked stuffing, shaped into 1cm/½in balls", "salt and freshly ground black pepper", "1 tbsp chopped fresh flatleaf parsley, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan. Add the onion and garlic and fry gently until softened but not coloured.", "Add the mushrooms and fry for another minute or so. Sprinkle over the curry powder.", "Add the turkey to the pan and stir until heated through, then pour in the cream. Allow to reduce slightly, then add the stuffing balls and simmer gently until heated through. Season, to taste, with salt and freshly ground black pepper.", "To serve, pour into a bowl and sprinkle with parsley."]}]