[{"isVegetarian": false, "title": "Tomato consommé", "url": "www_bbc_co_uk_food_recipes_tomato_consomm_86259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz ripe red tomatoes, chopped", "2 shallots, roughly chopped", "½ tsp Tabasco sauce", "1 tbsp Worcestershire sauce", "small handful fresh basil leaves, plus extra smaller leaves, to serve", "sea salt flakes", "dash extra virgin olive oil", "12 mixed heritage tomatoes, cut into halves or quarters"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Blend the chopped red tomatoes, shallots, Tabasco sauce, Worcestershire sauce and basil leaves in a food processor for 8-10 seconds until just broken up but not puréed – it should resemble gazpacho. Season, to taste, with salt flakes, then pulse again.", "Line a colander with a large piece of muslin cloth, then suspend it over a large bowl. Strain the tomato mixture into the muslin and seal with pegs or string, then place the whole bowl into the fridge to drip away for at least 4 hours or overnight, without pressing or squeezing it at all.", "Remove the bowl from the fridge and lift the colander and muslin bag from it. Add a little olive oil to the strained liquid, then simmer in a saucepan for 12-15 minutes. Season, to taste, with salt, extra Worcestershire sauce and extra Tabasco sauce, then cover and set aside until cold. Chill in the fridge until ready to serve. ", "To serve, ladle the tomato consommé into bowls and garnish with a few pieces of the heritage tomatoes and small basil leaves. "]}, {"isVegetarian": false, "title": "Tomato eggy bread", "url": "www_bbc_co_uk_food_recipes_tomato_eggy_bread_36998", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_eggy_bread_36998_16x9.jpg", "ingredients": ["2 large free-range eggs ", "1 tbsp finely chopped flat leaf parsley or chives (optional)", "2 x 70g/2½oz slices wholewheat bread ", "1 tsp tomato purée", "½ tsp Worcestershire sauce", "1 tsp olive oil ", "2 tomatoes, each cut into four thick slices", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Crack the eggs into a wide, shallow bowl, season and add the herbs, if using. Whisk with a fork.", "Spread one side of each slice of bread with the tomato purée and sprinkle over the Worcestershire sauce. ", "Place the bread slices into the egg mixture and soak for 5 minutes, turning three times.", "Heat the oil in a frying pan over a medium heat. Fry the tomatoes and egg-soaked bread for 3–4 minutes, turning halfway through, or until lightly browned on both sides. Serve immediately."]}, {"isVegetarian": true, "title": "Tomato rubbed toast", "url": "www_bbc_co_uk_food_recipes_tomato_rubbed_toast_65992", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_rubbed_toast_65992_16x9.jpg", "ingredients": ["1 ripe tomato", "1 tbsp olive oil", "salt and freshly cracked black pepper", "1 slice sourdough, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the tomato in half and rub the flesh side into the toast. Season with salt and pepper and drizzle with olive oil. "]}, {"isVegetarian": true, "title": "Tomato soup", "url": "www_bbc_co_uk_food_recipes_tomato_soup_56817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 4oz mixed ripe tomatoes, roughly chopped", "3 garlic cloves, roughly chopped", "1 handful fresh basil leaves, plus extra to serve", "1 tbsp tomato purée", "4 tbsp olive oil, plus extra to serve", "1 litre/1¾ pints hot vegetable stock", "salt and freshly ground black pepper", "2-3 tbsp caster sugar, to taste", "150ml/5fl oz double cream, plus extra to serve", "1 ciabatta loaf, thickly sliced, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large, heavy-based saucepan over a medium to high heat. When the pan is hot, add the tomatoes and fry for 4-5 minutes, or until they have started to break down.", "Add the garlic, basil, tomato purée and two tablespoons of olive oil. Continue to cook for a further 1-2 minutes.", "Pour in the vegetable stock, bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer for 3-4 minutes.", "Transfer the soup mixture to a food processor and blend to a purée.", "Return the blended soup to the pan and season, to taste, with salt, freshly ground black pepper and sugar.", "Pour in the cream and return the mixture to a simmer. Continue to simmer for a further 1-2 minutes.", "Meanwhile, brush the ciabatta slices with the remaining two tablespoons of olive oil.", "Heat a griddle pan until hot, add the ciabatta slices, in batches if necessary, and cook for 1-2 minutes on each side, or until golden brown griddle marks appear on both sides of the ciabatta.", "To serve, ladle the soup into four serving bowls. Drizzle a swirl of double cream into each bowl, then a swirl of olive oil, to garnish. Sprinkle over a few basil leaves."]}, {"isVegetarian": true, "title": "Tomato spirals", "url": "www_bbc_co_uk_food_recipes_tomato_spirals_39679", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz ready-made puff pastry", "4 tsp tomato puree", "30g/1oz cheddar, grated", "4 fresh basil leaves, shredded"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper. ", "Roll the dough out on a floured worked surface to a 3mm/⅛in thickness.", "Spread the tomato puree all ove the pastry. Sprinkle over the cheddar and basil.", "Roll the pastry up tightly, then cut it into 12 slices. Place the slices, cut-side up onto the baking tray and bake for 12-15 minutes or until golden-brown."]}, {"isVegetarian": true, "title": "Tomato salsa", "url": "www_bbc_co_uk_food_recipes_tomato_salsa_58260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tomatoes (300g/10½oz), roughly chopped", "1 tsp olive oil", "½ onion (50g/1¾oz peeled weight), finely chopped", "pinch chilli flakes or finely chopped fresh red chilli", "pinch salt and freshly ground black pepper", "15g/½oz fresh coriander, chopped (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together. Serve or store for up to three days."]}, {"isVegetarian": false, "title": "Tomato tart with herb oil, tapenade and watercress and tarragon salad", "url": "www_bbc_co_uk_food_recipes_tomato_tart_with_herb_32067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 banana shallots, chopped", "1 large garlic clove, crushed", "1 tsp black pepper", "1 tsp salt", "2 heaped tsp ground cumin", "1 tbsp white wine vinegar", "5 really ripe tomatoes, halved", "2 sheets ready-rolled puff pastry", "8 plum tomatoes, thickly sliced", "1 free-range egg, beaten with a pinch of salt", "2 garlic cloves, crushed", "100ml/3½fl oz olive oil", "small bunch fresh basil, leaves picked, stalks reserved ", "small bunch fresh tarragon, leaves picked, stalks reserved", "2 handfuls fresh watercress, leaves picked", "salt and black pepper", "200g/7oz pitted Kalamata olives", "3 tbsp capers, rinsed", "15g/½oz anchovies in oil (drained weight)", "2 tbsp finely chopped flatleaf parsley", "25ml/1oz brandy", "salt and black pepper", "drizzle of olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the relish, heat the olive oil in a saucepan and gently fry the shallot and garlic. Season with black pepper, salt and ground cumin. Add the white wine vinegar and simmer until the volume of liquid has reduced a little. Add the tomatoes, cover with a lid and simmer for 45-50 minutes, or until you have a thick relish consistency.", "For the tart, line a flat baking sheet with baking parchment.", "Cut out four 16cm/6¼in rounds from the puff pastry sheets (use a 1 litre/1¾ pint pudding bowl as a guide). Mark a 15mm/¾in border in the pastry circles (use a 500ml/18fl oz bowl as a guide).  Place the pastry on the prepared baking sheet and prick the centres with a fork.", "Spoon some of the cooked relish into the centre of the pastry circles. Arrange the slices of plum tomato on top and brush the border with beaten egg - making sure you don’t brush the cut edge as this will prevent the pastry rising. Bake in the oven for 20 minutes, until the pastry is risen and golden-brown.", "Meanwhile make the herb oil. In a pan, gently heat the garlic in the olive oil with the basil stalks and tarragon stalks. Remove from the heat after 10 minutes and season with salt and pepper.", "Place a small handful of the basil leaves, tarragon leaves and watercress leaves in a small food processor (reserve the rest for the salad). Pour over some boiling water to wilt the leaves. Drain the water from the food processor and blend the leaves to a paste. Pour in the herb-infused oil and blend again until smooth.", "Make a salad with the remaining watercress, basil and tarragon leaves. Season with salt.", "To make the tapenade, blend the olives, capers, anchovies, parsley, brandy and black pepper together in a small food processor. Loosen with a little olive oil and blend to make a paste.", "Serve the cooked tarts topped with a small quenelle of tapenade and some herb salad. Drizzle with the herb oil."]}, {"isVegetarian": false, "title": "Tomato and anchovy pizza", "url": "www_bbc_co_uk_food_recipes_tomatoandanchovypizz_91866", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz tepid water", "1 tsp caster sugar", "1 x 7g/¼oz sachet easy blend dried yeast", "300g/10½oz strong white bread flour, plus extra for dusting", "1 heaped tsp salt", "1-2 tbsp olive oil, for greasing", "425g/15oz ripe tomatoes, stalks cut out, cross cut into the bottom of each", "3 tbsp olive oil", "1 hot red chilli, seeds removed, finely chopped", "4 garlic cloves, peeled, finely chopped", "½ tsp flaked sea salt", "½ tsp caster sugar", "10-12 anchovy fillets, in oil, drained", "2 large pinches dried oregano", "extra virgin olive oil, for drizzling"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza dough, pour the water into a large bowl and gently stir in the sugar and yeast. Set aside for 10 minutes, or until the water has a thick beige foam floating on top.", "Add half of the flour and stir gently with a wooden spoon until incorporated into the water. ", "Gradually add half the remaining flour, stirring continuously, until it has been incorporated into the water. ", "Add the remaining flour and the salt and, using clean hands, mix together until the mixture comes together as a soft, spongey dough. ", "Immediately turn the dough out onto a lightly floured work surface and knead for 10 minutes, or until smooth and elastic.", "Grease a large bowl with oil and place the dough into the bowl. Brush a sheet of cling film lightly with oil and cover the dough with it. Set aside in a warm place for 45-60 minutes, or until the dough has doubled in size (proved).", "Preheat the oven to 240C/475F/Gas 9.", "When the dough has proved, turn it out onto a lightly floured work surface and knock back for 1-2 minutes.", "Divide the dough into two pieces and roll out until they are both 25cm/10in in diameter. ", "Place each pizza base onto a lightly oiled baking tray. Brush the pizza bases with a little more oil and cover loosely with another piece of lightly oiled cling film. Set aside in a warm place for 20 minutes, or until it has doubled in size again.", "Transfer the pizza bases to the oven and bake for 12-15 minutes or until risen and golden-brown. ", "Meanwhile, for the pizza topping, place the tomatoes into a bowl and cover with boiling water. Set aside for 30 seconds, then drain the tomatoes and peel away the skins. ", "Cut the peeled tomatoes into quarters, setting the seeds aside in a separate bowl. Chop the tomato flesh roughly.", "Heat the oil in a pan over a medium heat. Add the chilli and fry until it has softened.", "Add the garlic and continue to fry for no more than 30 seconds.", "Add the tomato flesh, salt and sugar and stir well to combine. ", "Transfer the reserved tomato seeds to a sieve and, using a wooden spoon, push the juice from the seeds through the sieve into the pan. Reduce the heat until the mixture is simmering. ", "Continue to simmer the sauce for 15-20 minutes, or until the tomatoes have broken down and the sauce has thickened. Remove from the heat and set aside to cool slightly. ", "When the sauce has cooled, spread a thin layer over the pizza bases (the remaining sauce can be frozen and cooked with pasta). Arrange the anchovy fillets in a clock formation on top of the pizza. Sprinkle over the dried oregano and drizzle over the olive oil. Serve immediately."]}, {"isVegetarian": true, "title": "Tomato and asparagus salad with caper vinaigrette", "url": "www_bbc_co_uk_food_recipes_tomatoandasparagussa_84479", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bunch asparagus, ends trimmed off", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp chopped capers", "150g/5½oz tomatoes, halved", "2 tbsp chopped parsley", "2 tbsp chopped basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil. Lower the asparagus into the boiling water to boil for 2-3 minutes, then immerse in a bowl of cold water for one minute.  Drain.", "Place the balsamic vinegar and olive oil in a bowl and whish together. Season with salt and freshly ground black pepper, then add the capers.", "To serve, place the asparagus and tomatoes together into a serving bowl, pour over the vinaigrette and sprinkle over herbs."]}, {"isVegetarian": true, "title": "Tomato and apple chutney", "url": "www_bbc_co_uk_food_recipes_tomatoandapplechutne_83979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["570ml/1 pint malt vinegar", "450g/1lb soft brown sugar", "300g/11oz sultanas", "2kg/4lb 4oz ripe red tomatoes, cut into 6 or 8 pieces", "500g/1lb 2oz green apples, peeled and chopped", "400g/14oz shallots, peeled and roughly chopped", "4 red chillies, chopped", "1 tbsp root ginger, finely chopped", "sea salt and freshly ground black pepper"], "serves": "Makes 3-4 jam jars full", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar and sugar in a large saucepan and bring to the boil. Cook for three to four minutes until the sugar has melted.", "Add the sultanas and cook until just reduced.", "Add all the other ingredients, bring to the boil and cook for about 20 to 30 minutes, stirring frequently.", "Leave the chutney with a chunky texture and not too cooked as that will cause it to be a purée. ", "Cool the chutney, place into sterilised jars and store for two to three weeks in the fridge."]}, {"isVegetarian": true, "title": "Tomato and basil croquettes with oozing mozzarella and rocket pesto vinaigrette", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilcroque_90977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 sun-blushed tomato pieces, roughly chopped", "50g/2oz rocket leaves, plus extra to garnish", "1 tbsp pine nuts", "½ garlic clove ", "3 piquillo peppers, roughly chopped (available from Spanish delicatessens and some supermarkets)", "1 tbsp grated parmesan", "5-6 tbsp olive oil", "4 tbsp Cabernet Sauvignon vinegar", "vegetable oil, for deep fat frying", "500g/1lb 2oz potatoes, peeled and cut into large dice", "110g/4oz parmesan cheese, freshly grated", "1 tbsp red pesto (from recipe above)", "10 sun-blushed tomato pieces, roughly chopped", "10 basil leaves, roughly chopped", "salt and freshly ground black pepper", "50g/2oz plain flour plus up to 2 tbsp extra (if too dry)", "1 small ball fresh mozzarella cheese, cut into small pieces", "110g/4oz breadcrumbs", "2 free-range eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, place all the pesto ingredients, except the Cabernet Sauvignon vinegar, into a food processor and blend to a fine purée. Set aside.", "For the croquettes, preheat the oven to 160C/320F/Gas 2.", "Preheat the oil in a deep fat fryer to 160C. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Place the potatoes into a saucepan of salted water and bring to the boil. Cook for 12-18 minutes, or until tender, then drain and return to the pan.", "Place the pan of potatoes back over the heat until all the moisture has evaporated. Mash with a potato masher or ricer until smooth.", "Add the parmesan cheese, one tablespoon of the red pesto, and all the sun-blushed tomatoes and basil to the mash and mix well. Add salt and freshly ground black pepper, to taste. (Add a little flour if the mixture is too wet to form into shapes with your hands.)", "Divide the mixture into 12 equal-sized pieces and shape into cylinder croquettes, using your hands. Push a small piece of mozzarella into the centre of each croquette, closing up the potato to completely cover the mozzarella.", "Place the remaining flour and the breadcrumbs onto two separate plates. Place the eggs in a bowl. Dredge the croquettes in the flour, then dip them into the beaten eggs and finally roll them in the breadcrumbs, to cover, retaining the shape.", "Carefully lower a few croquettes at a time into the preheated deep fat fryer and cook for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Transfer the croquettes to a roasting tray and place in the preheated oven to keep warm.", "To serve, add the Cabernet Sauvignon vinegar to the remaining pesto and place a spoonful onto each of four plates. Place three croquettes on top of each dollop of pesto and garnish with rocket."]}, {"isVegetarian": false, "title": "Tomato and basil poached fish", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilpoache_83682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "2 onions, sliced", "2 garlic cloves, finely chopped", "2 x 400g/14oz cans of chopped tomatoes", "125ml/4fl oz vegetable or fish stock ", "salt and freshly ground black pepper", "4 x 200g/7oz firm white fish fillets", "2 handfuls baby spinach leaves", "1 tbsp chopped fresh basil", "12 new potatoes, diced and boiled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a deep frying pan over a medium heat.", "Add the oil, onions and garlic and cook for eight minutes, until the onion is soft.", "Add the tomatoes, stock and seasoning, and stir to combine.", "Cook uncovered until the mixture has reduced and thickened slightly, which should be about ten minutes.", "Place the fish in a baking dish, top with the tomato mixture and cook in the preheated oven for 12 minutes.", "To serve, remove the fish from the sauce, and keep warm.", "Stir the spinach and basil into the sauce, and cook until the spinach has wilted.", "Spoon the sauce over the fish and serve immediately with the boiled new potatoes."]}, {"isVegetarian": false, "title": "Tomato and basil salad with prosciutto", "url": "www_bbc_co_uk_food_recipes_tomatoandbasilsaladw_84313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 slices prosciutto ", "2 tbsp olive oil", "frac12; onion", "1 clove garlic", "4 cherry tomatoes, chopped", "1 tbsp fresh chives, chopped", "salt and freshly ground black pepper ", "handful fresh basil leaves", "4 cherry tomatoes, cut in half", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prosciutto, heat the oil in a pan over a high heat. Add the prosciutto and fry for one minute on each side, or until crisp and golden. Drain on kitchen paper.", "For the dressing, heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until soft.", "Add the tomatoes and fry for 3-4 minutes, or until soft.", "Add the chives and season, to taste, with salt and freshly ground black pepper.", "For the salad, arrange the basil leaves onto a serving plate in a circle. Place half a cherry tomato cut-side up onto each basil leaf. Spoon a little of the dressing over each cherry tomato. ", "To serve, arrange the proscuitto in the middle of the plate and season with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Tomato and basil tart", "url": "www_bbc_co_uk_food_recipes_tomatoandbasiltart_72416", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz puff pastry", "plain flour, to dust", "1 beef tomato, cut into slices", "handful of fresh basil leaves", "55-85g/2-3 oz gruyère cheese, grated", "freshly ground black pepper, to season", "1 egg, beaten"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Roll the pastry out thinly on a floured surface. Cut a large circle out and place on a non-stick baking tray. Crumple the edges of the pastry roughly using your fingers.", "Place the tomato slices in the middle of the pastry circle and then top with the basil. Sprinkle the cheese over and season with black pepper.", "Brush the edges of the tart using the egg wash and then bake in the oven for 8-10 minutes, or until crisp and golden. ", "Serve."]}, {"isVegetarian": true, "title": "Tomato and bean stew", "url": "www_bbc_co_uk_food_recipes_tomatoandbeanstew_84184", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter", "bunch spring onions, tips only, chopped", "½ 400g/14 oz can flageolet beans, rinsed and drained", "400g/14oz can of plum tomatoes and juice", "1 garlic clove, finely chopped", "½ 326g/11½ oz can sweetcorn, drained and rinsed", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan over a medium heat. Add the spring onions, and saué for one minute. ", "Add the beans, tomatoes, garlic and sweetcorn, bring to the boil, and reduce then simmer for 5-6 minutes to reduce. Season, to taste, with salt and freshly ground black pepper.", "To serve, add the parsley to the stew and pour into a warmed bowl."]}, {"isVegetarian": false, "title": "Tomato and chilli jam", "url": "www_bbc_co_uk_food_recipes_tomatoandchillijam_89081", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz can plum tomatoes", "4 red chillies, chopped", "4 garlic cloves, peeled", "7cm/3in piece fresh ginger, peeled, chopped", "3 tbsp fish sauce (nam pla)", "120ml/4fl oz red wine vinegar", "375g/13oz soft light brown sugar", "1 tsp cardamom pods, lightly crushed", "70g/2½oz raisins", "400g/14oz fresh tomatoes, chopped"], "serves": "1-2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the canned tomatoes, chilli, garlic, ginger and fish sauce into a food processor and blend until smooth.", "Place the tomato sauce into a non-reactive pan over a medium heat and add the vinegar, sugar, cardamom pods and raisins. Bring to the boil then add the chopped fresh tomatoes. Reduce the heat and simmer for 45-55 minutes, or until the sauce has thickened to a chutney or jam-like consistency.", "Transfer to sterilised jars and seal until ready to use. The jam should keep for 2-3 weeks in the fridge."]}, {"isVegetarian": true, "title": "Tomato and chilli penne", "url": "www_bbc_co_uk_food_recipes_tomatoandchillipenne_92089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz cherry tomatoes", "3 cloves garlic, peeled, sliced", "1 tsp chilli flakes", "150ml/5½fl oz extra virgin olive oil", "125g/4½oz fresh breadcrumbs", "100g/3½oz finely grated pecorino cheese", "1 tsp chopped fresh thyme", "salt and freshly ground black pepper", "450g/1lb freshly-cooked penne pasta", "1 tbsp torn fresh basil leaves", "garlic bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Place the tomatoes, garlic and chilli flakes into a baking dish and drizzle over the olive oil. Roast in the oven for 25 minutes, or until the tomatoes are softened.", "Meanwhile in a bowl, mix together the breadcrumbs, pecorino cheese and thyme and season with salt and freshly ground black pepper. Spoon the mixture over the tomatoes and place back into the oven for 4-5 minutes, or until the top is golden-brown and crisp. ", "Spoon the tomato mixture over the penne pasta in a bowl and mix well. Spoon the penne into serving bowls, then garnish with the torn basil and serve with garlic bread."]}, {"isVegetarian": true, "title": "Tomato and goats' cheese tarte tatin with basil oil", "url": "www_bbc_co_uk_food_recipes_tomatoandgoatscheese_86055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "5 cherry tomatoes, halved", "pinch caster sugar", "85g/3oz ready-rolled puff pastry", "30g/1oz goats' cheese, halved", "50g/2oz spinach", "water, to cover", "4 tbsp olive oil", "handful fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tarte tatin, heat the olive oil in a small ovenproof frying pan, add the tomatoes cut-side down and sprinkle over the sugar. Fry gently for 3-4 minutes until slightly softened.", "Cut a circle of puff pastry large enough to fit over the top of the frying pan and place the pastry over the tomatoes. Push the pastry down around the edges to seal in the tomatoes.", "Transfer to the oven and bake for 8-10 minutes, or until the pastry is golden-brown. Remove from the oven and allow to cool slightly, then place a plate over the top of the frying pan and carefully turn the tarte tatin out onto the plate.", "Heat another small frying pan and fry the goats' cheese on both sides until lightly browned. Place the goats' cheese on top of the tarte tatin.", "For the basil oil, place the spinach into a bowl and cover with boiling water to wilt the spinach. Drain the spinach and squeeze out any excess liquid.", "Place the spinach, oil and basil into a small food processor. Season, to taste, with salt and freshly ground black pepper and blend until smooth.", "To serve, drizzle the basil oil over the tarte tatin."]}, {"isVegetarian": false, "title": "Tomato and Parma ham spaghetti", "url": "www_bbc_co_uk_food_recipes_tomatoandparmahamspa_83243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fresh spaghetti", "2 tomatoes, blanched, peeled and chopped", "3 slices Parma ham, roughly chopped", "2 tbsp olive oil", "black pepper, to taste", "1 tbsp chopped fresh basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the spaghetti in salted boiling water according to packet instructions.", "Drain the spaghetti and stir in the chopped tomatoes, Parma ham, olive oil and black pepper.", "To serve, spoon into a bowl and sprinkle with fresh basil."]}, {"isVegetarian": true, "title": "Tomato and red pepper soup", "url": "www_bbc_co_uk_food_recipes_tomatoandredpepperso_10654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ onion, chopped", "2 cloves garlic, chopped", "2 tins tomatoes", "1 jar red peppers", "250ml/9fl oz chicken or vegetable stock", "sea salt and black pepper", "handful fresh parsley, chopped ", "double cream (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Firstly, sauté the onion and garlic and then add the tinned tomatoes and red peppers. ", "Bring to a simmer and add the stock. Bring to the boil and then gently simmer for four to five minutes, before placing in the blender. ", "Blend to a smooth soup. Season with salt and pepper. Return to the pan to warm through and serve immediately scattered with the parsley and a swirl of double cream, if using."]}, {"isVegetarian": true, "title": "Tomato and spinach soup", "url": "www_bbc_co_uk_food_recipes_tomatoandspinachsoup_88274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "¼ onion, finely chopped", "75ml/2½fl oz tomato passata (sieved tomatoes)", "300ml/½ pint hot vegetable stock", "125g/4½oz fresh spinach leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry until softened.", "Add the passata, stock, spinach, salt and freshly ground black pepper and simmer for 3-4 minutes. Blend with a hand blender until smooth.", "To serve, pour into a serving bowl."]}, {"isVegetarian": true, "title": "Tomato and squash pizza", "url": "www_bbc_co_uk_food_recipes_tomatoandsquashpizza_85259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "pinch salt", "1 tbsp olive oil", "warm water", "100g/3½oz tinned tomatoes, drained and chopped", "1 tbsp olive oil", "pinch dried chilli flakes", "pinch sugar", "handful fresh parsley, chopped", "handful fresh basil, chopped", "salt and freshly ground black pepper ", "1 tbsp olive oil", "100g/3½oz butternut squash, peeled, cut into 1cm/½in cubes", "1 garlic clove, crushed", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "For the pizza dough, place the flour, salt and olive oil into a large bowl and mix well. Add enough warm water to make a soft but not sticky dough.", "Turn the dough out onto a lightly floured surface and knead briefly. Roll the dough out to make a circle 0.5cm/¼in thick and place onto a non-stick baking sheet.", "For the tomato sauce, place all the sauce ingredients into a bowl, season with salt and freshly ground black pepper and mix well. Spread the sauce evenly over the dough circle, leaving a thin border around the edge.", "For the topping, heat the olive oil in a frying pan and cook the butternut squash pieces, garlic and thyme for 5-6 minutes, or until just tender.  Season with salt and freshly ground black pepper, then sprinkle the topping over the pizza base.", "Transfer the pizza to the oven and bake for 10-12 minutes, or until the base is crisp and cooked through.", "To serve, place the pizza onto a serving plate."]}, {"isVegetarian": true, "title": "Tomato and sweetcorn soup", "url": "www_bbc_co_uk_food_recipes_tomatoandsweetcornso_7921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cloves garlic, crushed ", "1 large onion, finely chopped ", "olive oil ", "1 tsp powdered cumin ", "2 tins(400g/14oz) chopped tomatoes ", "340g/12oz sweetcorn kernels, tinned or frozen ", "1L/1 ¾pt vegetable or chicken stock ", "2 tbsp tomato purée ", "fresh basil or coriander leaves ", "salt and black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat the garlic and onion in olive oil until soft and translucent. Add the cumin and cook for a minute or so before adding the tomatoes, sweetcorn, stock and tomato purée. Bring to the boil, then turn down the heat and allow to simmer for 15-20 minutes.", "The soup is good just as it is, rustic and chunky. If you prefer a smoother soup, just blend half of the mixture. Scatter with fresh herbs and serve with a drizzle of olive oil. Season well."]}, {"isVegetarian": true, "title": "Tomato and walnut stew", "url": "www_bbc_co_uk_food_recipes_tomatoandwalnutstew_76876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ tsp chilli flakes", "½ tsp ground coriander", "1 x 400g/14oz tin cherry tomatoes", "2 tbsp brown sugar", "25g/1oz walnuts, chopped", "3 tbsp fresh coriander, chopped", "2 tbsp butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan over a medium heat.", "Add the chilli flakes and ground coriander and cook for one minute. Add the cherry tomatoes and brown sugar and cook for a further 8-10 minutes.", "Stir in the chopped walnuts and coriander.", "Stir in the butter and serve."]}, {"isVegetarian": true, "title": "Tomato, apple and soft duck egg salad", "url": "www_bbc_co_uk_food_recipes_tomatoappleandsoftdu_88789", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomato, sliced", "1 spring onion, sliced", "1 apple, sliced", "1 tbsp balsamic vinegar", "3 tbsp olive oil", "salt and freshly ground black pepper ", "large handful fresh coriander", "1 duck egg, poached, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the tomato, spring onion, apple, balsamic vinegar, and olive oil together in a large bowl and season to taste with salt and freshly ground black pepper.", "Spoon into a serving bowl and top with the poached duck egg."]}]