[{"ingredients": ["8 langostinos medianos", "1 suela de Dover completa, aproximadamente 600 g / 1 lb 5 oz", "sal y pimienta negra recién molida", "200ml / 7fl oz de caldo de pescado", "100ml / 3½l oz de vino blanco", "1 ramo pequeño garni", "1 chalote, finamente picado", "8 espárragos pequeños y medianos", "50g / 1¾oz de hinojo o alga marina \"lechuga de mar\"", "50 g / 1¾oz de mantequilla sin sal", "½ limón, solo jugo", "2 cucharadas de cebollines cortados"], "method": ["Cueza al vapor los langostinos durante 5-6 minutos en un barco a vapor. Retire las langostinos del vaporizador y retire cuidadosamente la cáscara del cuerpo tan pronto como esté cocido, teniendo cuidado, ya que estará caliente.", "Separar las cabezas del cuerpo. Aplastarlos con la parte posterior de una cuchara de madera o un rodillo y reservar. Retire las colas de sus conchas. Reserve las colas para servir, y deseche el caparazón restante.", "Filete y pele la lengua de Dover y luego sazone ligeramente los filetes con sal. Coloque los filetes planos en una bandeja para hornear poco profunda ligeramente untada con manteca con el caldo de pescado y el vino blanco, luego cocine por 3-4 minutos hasta que hierva a fuego lento. Rápidamente voltee cada filete en el licor. Retire inmediatamente del fuego.", "Retire con cuidado los filetes del licor de cocción y déjelos a un lado en un lugar cálido. Vierta el licor de cocina en una sartén.", "Agregue la cabeza triturada de langostino a la sartén de licor único para cocinar con bouquet garni y chalote picado.", "Cocine a fuego lento a fuego medio hasta que el volumen de este líquido se haya reducido en dos tercios. Mientras tanto, prepara los espárragos: los espárragos con tallos más gruesos se romperán naturalmente en la parte más arbórea de la lanza. Las lanzas de espárragos jóvenes son más tiernas y no es necesario romperlas antes de cocinarlas.", "Cueza al vapor los espárragos durante unos cinco minutos, agregue el hinojo (o alga marina) a los espárragos y cocínelos durante un minuto. Dejar de lado.", "Pase el líquido reducido a través de un fino tamiz de metal, presionando firmemente con la parte posterior de un cucharón. Reduce un poco más si es necesario.", "Agregue la mantequilla al líquido reducido para hacer una salsa, ya sea batiendo suavemente o girando suavemente la sartén. Sazone al gusto con sal y pimienta.", "Para servir, coloque los espárragos y el hinojo en dos platos.", "Coloque la planta en las verduras. Arregle la cola de langostino para enrollarse alrededor de la planta del pie. Rocíe generosamente la salsa sobre la lengua y la langostinos. Vierta sobre el jugo de limón y espolvoree con el cebollino cortado."], "url": "www_bbc_co_uk_food_recipes_dover_sole_and_08196", "title": "Cola de lenguado y cola de caballo con espárragos y samphire rociados con salsa de vino blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 500 g / 1 libra de suelas de Dover (8 filetes), desolladas y fileteadas", "1 cucharada de aceite vegetal", "Papas Royal Jersey de 250g / 9oz", "250g / 9oz de carne de cangrejo blanca fresca, escogida", "3 limones, solo jugo", "sal y pimienta negra recién molida", "200g / 7oz de mantequilla", "110 g / 4 oz de caperberries", "110 g / 4 oz de pepinillos, finamente cortados en cubitos", "2 cucharadas de cebolletas frescas picadas", "1 manojo de espárragos Jersey", "1 cilantro chícharos", "1 cestita de albahaca", "1 puñado de crotones"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque los filetes de lenguado uno encima del otro, con el primer filete mirando hacia un lado y luego hacia el otro (como construir una única pared) para que tenga una pared alta de ocho filetes.", "Ensarte los filetes de lenguado con seis palitos de cóctel y corte los extremos, luego corte los filetes apilados cuidadosamente por la mitad.", "Caliente una sartén antiadherente hasta que esté caliente, agregue el aceite vegetal y luego los solos filetes; cocine hasta que esté coloreado en un lado.", "Una vez que un lado esté dorado, voltee los filetes de lenguado y luego colóquelos en una bandeja en el horno durante 15 minutos.", "Mientras tanto, coloque las papas en una olla de agua hirviendo con sal y hierva durante unos 5-10 minutos, o hasta que estén cocidas (el tiempo de cocción depende del tamaño de las papas).", "Escurra y devuelva las papas a la sartén y triture ligeramente con un tenedor, luego agregue la carne de cangrejo y un chorrito del jugo de limón y mezcle bien.", "Agregue sal y pimienta negra recién molida al gusto. Mantenga la mezcla caliente.", "Regrese la sartén utilizada para el pescado al fuego, luego agregue la mantequilla y cocínela hasta que tenga un color marrón; agregue los caperberries y los pepinillos y caliente.", "Agregue el cebollino picado y el jugo de dos de los limones (reserve otra porción de jugo de limón para el pescado).", "Retire la suela del horno y gire suavemente las barras de cóctel. Exprime el jugo de limón restante.", "Poner a hervir una olla de agua con sal, agregar los espárragos y hervir durante 10 segundos. Escurrir y mantener caliente.", "Para servir, coloque una cucharada de patata en un anillo de metal en el centro de cada una de las dos placas y cubra con una pila de suela de Dover.", "Coloque la manteca de caperberry y pepinillo sobre y alrededor del pescado, luego esparza el berro y los cröutons alrededor del plato.", "Cubra la planta del pie con algunos espárragos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_53504", "title": "Lenguado de Dover con Jersey Royals machacados en cangrejo y salsa grenoble", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de puré de papa seco", "1 huevo de gallinas camperas", "3 cucharadas de cebollín, finamente picado", "125g / 4½oz harina de pasta \"00\"", "sal y pimienta negra recién molida", "4 x 700 g / 1 libra 9oz Dover suelas, piel y fileteado", "50g / 1¾oz de mantequilla", "4 cucharadas de aceite de oliva", "400 g / 14 oz de chorizo, preferiblemente de pata negra, en rodajas", "12 alcachofas púrpuras bebé, recortadas y cortadas a la mitad", "3 cucharadas de jerez seco", "250ml / 9fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "2 tomates, sin piel, sin semillas, cortados en cubitos", "2 cucharadas de cebollines frescos finamente picados", "2 cucharadas de perifollo fresco picado", "1 limón, solo jugo"], "method": ["Para los gnocchi, coloque el puré de papa seco, el huevo y el cebollín en un bol y mezcle bien.", "Poco a poco agregue la harina, batiendo bien entre cada adición y sazone con sal y pimienta negra recién molida.", "Coloque la masa sobre una superficie de trabajo enharinada y extiéndala hasta un grosor de 2 cm / ¾ pulg.", "Corte los gnocchi en pedazos de aproximadamente 2 cm de largo, luego presione ligeramente la parte superior de cada uno con un tenedor.", "Ponga a hervir una olla de agua con sal, luego vierta los ñoquis y vuelva a hervir el agua. Cuando los gnocchi suban a la superficie, cocine por otros tres minutos, luego escurra bien y revuelva en agua helada. Retire los ñoquis del agua helada con una espumadera y déjelos a un lado.", "Para el estofado, sazone los filetes de pescado con un poco de sal. Calentar una sartén hasta que esté medio caliente, agregar la mantequilla y una cucharada de aceite de oliva y calentar hasta que se forme espuma.", "Agregue el pescado y fría los filetes en cada lado durante dos minutos hasta que estén recién cocidos. Retire el pescado de la sartén y déjelo a un lado en un lugar cálido.", "Calentar una sartén hasta que esté caliente, agregar el aceite de oliva restante y el chorizo ​​y freír durante 2-3 minutos, o hasta que el aceite del chorizo ​​comience a correr y el chorizo ​​esté crujiente.", "Agregue las alcachofas a la sartén, fría por un minuto, luego agregue el caldo de jerez y pollo y cocine a fuego lento.", "Cocine por dos minutos o hasta que las alcachofas estén tiernas, luego agregue los gnocchi y agite suavemente a través de la salsa.", "Agregue la crema, cocine a fuego lento durante un par de minutos, luego agregue los tomates y la mayoría de las cebolletas y el perifollo. Sazone con sal y pimienta negra recién molida, luego agregue el jugo de limón al gusto.", "Para servir, coloque el pescado en un lado del plato, espolvoree el chorizo, el gnocchi y el estofado de alcachofa al lado y espolvoree sobre el resto del cebollín."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_chorizo_77345", "title": "Lenguado de Dover con chorizo, gnocchi y guiso de alcachofas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 suela Dover, fileteada", "160 g / 5⅔oz de almejas", "Papas cerosas 800 g / 1lb 12 oz como Desirée, cortadas en rodajas de 7 mm de espesor", "1 cebolla roja grande, en rodajas", "1 cebolla blanca española grande, en rodajas", "3 dientes de ajo, en rodajas", "2 hojas de laurel", "5 cucharadas de aceite de oliva", "sal marina y pimienta", "3 cucharadas de aceite de oliva", "2 dientes de ajo", "1 rebanada de pan, cortezas eliminadas, cortadas en cubos de 1cm / ½ en cubitos", "20 almendras blanqueadas", "1 puñado de hojas de perejil de flatleaf", "200ml / 7fl oz de caldo de pescado, caliente", "sal y pimienta", "aceite vegetal, para freír", "1 manojo de tomates cherry en la vid", "2 cucharadas de perejil fresco picado", "rociar aceite de oliva"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para las papas, ponga a hervir una sartén grande de agua salada. Agregue las papas en rodajas, vuelva a hervir y cocine durante dos minutos. Escurrir bien.", "En una lata grande para asar, mezcle las papas, las cebollas, el ajo, las hojas de laurel y el aceite de oliva. Condimentar con sal y pimienta. Asar durante 15 minutos, luego voltee todas las verduras y colóquelas en el horno por otros 15 minutos o hasta que las verduras estén cocidas y caramelizadas.", "Mientras tanto, para la salsa, caliente el aceite de oliva en una sartén. Cuando esté caliente, agregue el ajo, los cubitos de pan y las almendras y fría hasta que los cubitos de pan estén dorados y crujientes. Agregue el perejil y luego drene inmediatamente la mezcla y reserve el exceso de aceite. Coloque la mezcla en un procesador de alimentos y pulse. Poco a poco agregue el aceite reservado y el caldo de pescado caliente, mezclándolo todo el tiempo, hasta que tenga una salsa suave.", "Sazonar con sal y pimienta, al gusto. Transfiera la salsa a una olla limpia. Justo antes de servir, vuelva a calentar la salsa.", "Para la lengua de Dover, sazone los filetes con sal y pimienta y ruede individualmente. Colóquelos en una bandeja de horno y hornee en el horno durante 6-8 minutos (a 220C / 425F / Gas 7).", "Limpie las almejas con agua corriente fría. Descarta cualquiera con conchas rotas. Deseche cualquier almeja abierta que no se cierre cuando se le da un golpecito fuerte.", "Caliente una olla con tapa y coloque las almejas en la sartén con un poco de agua. Cocine por 2-3 minutos hasta que se abran. Deseche cualquier almeja que permanezca cerrada.", "Para los tomates cherry, caliente el aceite en una freidora de grasa profunda o llene una bandeja grande, profunda, de base pesada, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C / 350 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los tomates por 1-2 minutos.", "Para servir, divida las papas entre cuatro platos calentados, coloque el pescado encima y termine con la salsa y las almejas. Termine con un poco de perejil picado, tomates y un poco de aceite de oliva fresco."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_clams_50002", "title": "Lenguado de Dover con almejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de harina normal", "½-1 cucharadita de chile en polvo", "sal y pimienta negra recién molida", "2 suela de Dover, escalada, limpiada y recortada (se puede quitar la piel oscura si puedes, de lo contrario podrías cortarla en varios lugares con un cuchillo afilado) u otro pez de tu elección", "1-2 cucharadas de aceite vegetal o de colza", "12 lanzas de espárragos", "140g / 5oz de mantequilla sin sal", "50g / 2oz de jengibre fresco picado", "4 cucharadas de jugo de lima (aproximadamente 3 limas)", "30 g / 1¼ oz de semillas de granada fresca", "2 cucharadas de cilantro fresco picado"], "method": ["Para preparar el pescado, caliente el horno a 200C / 400F / Gas 6. Mezcle la harina, el chile en polvo y un poco de sal y pimienta, y el pescado en polvo, luego sacuda el exceso. Caliente una sartén grande, antiadherente, a prueba de horno a fuego medio-alto; use dos sartenes si los pescados son demasiado grandes para caber en una sola sartén. (Si no tiene bandejas resistentes al horno, precaliente una bandeja para hornear ligeramente engrasada.)", "Agregue el aceite y caliéntelo hasta que se empape. Agregue la suela (con la piel hacia abajo si los ha desollado) y fría, sin moverlos, durante 3-4 minutos, o hasta que formen una costra dorada. Voltee y transfiera la sartén a la parte superior del horno caliente (o transfiera el pescado a la bandeja de horno calentada y colóquelo en el horno), y cocínelo por otros 8-10 minutos, o hasta que esté cocido y la carne esté opaca. .", "Mientras tanto, ponga a hervir un sartén grande de agua salada, deje caer los espárragos y cocine a fuego lento durante tres minutos, o hasta que estén tiernos. Retirar del agua, escurrir y reservar.", "Para la salsa, derrita la mantequilla en una sartén a fuego medio y déjela burbujear durante 2 o 3 minutos, o hasta que se vuelva marrón. Reduzca el fuego a bajo, agregue el jengibre, el jugo de lima, las semillas de granada y el cilantro picado y caliente; no lo sobrecaliente o se separará. Sazone al gusto. Sirve la planta del pie con los espárragos y coloca la salsa sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_lime_and_52911", "title": "Lenguado de Dover con limón y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 chalote, finamente picado", "1 cucharadita de cuchilla picada de macis", "½ cucharadita de pimienta de cayena", "½ limón, solo jugo", "10g alcaparras", "5 g de cebollín fresco, picado", "5g de perejil fresco, picado", "50g / 1¾oz de camarones marrones", "sal y pimienta negra", "1 lenguado dover, fileteado", "25g / 1oz de harina natural, condimentada con sal y pimienta", "2 cucharadas de aceite de oliva", "1 manojo de espárragos, recortado", "2 cucharadas de mantequilla sin sal"], "method": ["Para los camarones, derrita la mantequilla en una sartén. Agregue la chalota y cocine hasta que esté suave y translúcido y la mantequilla tenga un color marrón nuez. Agregue la maza y la pimienta cayena. Cocine por un par de minutos y luego drene a través de un tamiz fino o muselina. Regrese el líquido a la sartén y agregue el jugo de limón (tenga cuidado ya que la grasa escupirá).", "Mezcle las alcaparras, el cebollín, el perejil y los camarones con la mantequilla saborizada y sazone con sal y pimienta al gusto. Apartar y mantener caliente.", "Para la lengua dover, espolvorea la planta en la harina sazonada. Calentar una sartén grande hasta que esté caliente, agregar el aceite y freír la suela en ambos lados durante 2-3 minutos.", "Para los espárragos al vapor, caliente una olla con un poco de agua en el fondo y coloque un vaporizador de bambú en la parte superior. Una vez que el agua esté hirviendo a fuego lento, agregue los espárragos al vaporizador y deje que hierva durante 3-4 minutos.", "Calentar una sartén mediana y agregar la mantequilla, una vez derretida, agregar los espárragos al vapor y sazonar con sal y pimienta. Mezcle para cubrir los espárragos en la mantequilla.", "Para servir, coloca la salsa sobre la suela y coloca los espárragos a un lado."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_shrimps_19440", "title": "Lenguado de Dover con gambas y espárragos al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 suelas enteras de Dover, fileteadas y deshuesadas", "25g / 1oz de harina natural, condimentada con sal y pimienta", "25ml / 1fl oz de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "1 limón, solo jugo", "2 cucharadas de perejil finamente picado", "100g / 3½oz de marrón camarones de la Bahía de Morecambe", "600g / 1lb 5oz de patatas nuevas, limpias y peladas", "4 cucharadas de mantequilla sin sal", "2 cucharadas de perejil de flatleaf, picado", "400g / 14oz de frijoles franceses", "2 cucharadas de mantequilla sin sal", "200g / 7oz de almendras en copos"], "method": ["Para la lengua de Dover, espolvorea el pescado en la harina sazonada. Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el pescado con la piel hacia abajo y cocine durante unos minutos. Dé vuelta y cocine por un minuto más.", "Retire el pescado de la sartén y déjelo a un lado para que descanse.", "Calentar la mantequilla en una sartén por separado, agregar la chalota y freír durante unos minutos. Una vez que ha alcanzado la etapa de castaño (o beurre noisette), agregue el jugo de limón, el perejil y los camarones y cocine durante unos minutos.", "Para los frijoles y las papas, coloque las papas en un vapor encima de una olla grande de agua con sal. Cocine por 15-20 minutos, hasta que esté listo.", "Justo antes de servir agregue la mantequilla, el perejil y sazone con sal y pimienta.", "Cocine los frijoles en una sartén aparte de agua hirviendo con sal durante 4-5 minutos. Escurra y justo antes de servir agregue la mantequilla y sazone con sal y pimienta.", "Calentar una sartén pequeña y agregar las almendras, tostadas a fuego lento durante 2-3 minutos o hasta que estén doradas.", "Para servir, coloque la lengua dover en un plato para servir, junto con las papas nuevas y las judías verdes. Cubra los frijoles con las almendras tostadas."], "url": "www_bbc_co_uk_food_recipes_dover_sole_with_shrimps_42943", "title": "Lenguado de Dover con gambas, judías verdes y patatas nuevas al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["650 g / 1 libra 6 oz langosta viva", "2 cucharadas de aceite de cacahuete", "5 dientes de ajo, aplastados", "Jengibre fresco de raíz de 2.5cm / 1in, pelado, finamente picado", "4 cucharadas de salsa de frijoles amarillos (disponible en supermercados asiáticos)", "4 cucharadas de salsa de soja ligera", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "Fideos de trigo integral shi amarillo de 350g / 12oz o fideos de huevo medianos, cocinados según las instrucciones del paquete", "4 cebolletas, cortadas longitudinalmente", "guisar aceite de sésamo tostado (opcional)"], "method": ["Congele la langosta por 30 minutos. Caliente una olla grande de agua hirviendo, luego sumerja rápidamente la langosta en el agua y cocínela durante 7-8 minutos, o hasta que esté rosa y cocida.", "Levante la langosta con pinzas y reserve el líquido de cocción. Usando una cuchilla grande o un cuchillo, corte la cola y corte en tres secciones. Corta las garras. Divide el cuerpo por la mitad a lo largo. Pica cada mitad en dos pedazos. Usando la parte trasera de la cuchilla, rompa la concha de las pinzas y todas las otras piezas, esto ayuda a que la salsa se filtre y sazone la carne mientras la langosta se cocina. Deseche el resto de la langosta.", "Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue el ajo y el jengibre y fría por unos segundos. Agregue la salsa de frijol amarillo, la salsa de soja y el vino de arroz o jerez y cocine por 30 segundos.", "Agregue las piezas de langosta y revuelva bien para cubrir la langosta en la salsa. Agregue los fideos cocidos y mezcle bien. Agregue 3-4 cucharadas de líquido de cocción reservado (mantenga el resto para hacer un buen caldo de mariscos). Finalmente, agregue las cebollas de primavera, mezcle bien y sirva inmediatamente en un plato grande."], "url": "www_bbc_co_uk_food_recipes_dragonprawnnoodles_89298", "title": "Fideos de \"gambas dragón\"", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dragonprawnnoodles_89298_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 huevos ecológicos, separados", "120 g / 4½ oz de azúcar en polvo", "Azúcar glas de 120g / 4½oz", "1 cucharada de harina de maíz", "Una pizca de sal marina", "Crema doble de 200 ml / 7 fl oz", "1 cucharada de azúcar en polvo", "200ml / 7fl oz yogur natural sin grasa", "1 vaina de vainilla, semillas retiradas", "2 frutas de dragón, en rodajas", "400 g / 14 oz de lichis frescos", "hojas de menta fresca", "azúcar en polvo, para quitar el polvo", "1 lima, ralladura solamente"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½.", "Línea dos bandejas para hornear con papel de hornear.", "Para hacer los merengues Incline las claras en un tazón limpio y sazone con una pizca de sal marina.", "Batir los huevos con un batidor de mano eléctrico a los picos rígidos.", "Aumente la velocidad y agregue el azúcar impalpable, una cucharada a la vez, batiendo entre cada cucharada, durante 7 a 8 minutos hasta que esté brillante y espeso.", "Tamizar el azúcar glas y la harina de maíz y doblar en un tercio a la vez hasta que la mezcla esté suave.", "Use una cucharada para extraer suavemente la mezcla en espiral.", "Hornea por 1 hora y 15 minutos. Apague el horno y permita que se enfríe por completo.", "Batir la crema con el azúcar impalpable hasta que forme picos suaves. Agregue el yogur y mezcle las semillas de vainilla.", "Coloque la mezcla de crema sobre el merengue refrigerado, decore con fruta de dragón y lichis. Rallar la ralladura de lima, espolvorear con hojas de menta fresca y una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_dragon_fruit_and_lychees_83501", "title": "Dragon fruta y lichis pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["130g / 4½oz de mantequilla, ablandada", "Azúcar en polvo de 60 g / 2½ oz, más extra para rociar", "Harina normal 130 g / 4½ oz", "60 g / 2½ oz de harina de arroz", "pizca de sal"], "method": ["Bata la mantequilla y el azúcar juntos en un tazón grande hasta que estén pálidos y esponjosos. Agregue la harina común, la harina de arroz y la sal, y mezcle bien hasta que la mezcla esté suave y uniforme. (Me parece más fácil seguir presionando la mezcla contra el costado del tazón para mezclarla).", "Junta la mezcla y presiona en una lata para pastel de fondo suelto de 20 cm / 8 pulgadas, alisándola con el dorso de una cuchara. Prensar los bordes presionando con la punta de dos dedos, luego anotar en ocho piezas con un cuchillo y pinchar cada triángulo tres veces con un tenedor. Ponlo en la nevera durante 30 minutos para reafirmarlo.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Retire la torta de la nevera y hornéela en el horno durante 30-35 minutos, o hasta que esté pálida dorada.", "Retire las galletas dulces del horno y espolvoree un poco de azúcar en polvo. Dejar enfriar en la lata durante unos minutos antes de sacarlo de la lata y enfriarlo sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_dreamlike_shortbread_99343", "title": "Torta dulce de ensueño", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 8 piezas delicadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dreamlike_shortbread_99343_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cangrejo grande cocinado, con un peso aproximado de 1kg-1.5kg / 2lb-3lb o un cangrejo vivo del mismo peso", "rebanadas de pan integral", "mayonesa de buena calidad", "Rodajas de limón", "perejil fresco, para adornar (opcional)"], "method": ["Si está cocinando un cangrejo vivo, primero hierva una olla grande de agua bien salada. (Si usa un cangrejo fresco listo para cocinar, continúe con el próximo paso). Agregue el cangrejo a la sartén y hiérvalo durante 20-30 minutos. Retire del agua y párese sobre su nariz para permitir que el agua se drene a medida que el cangrejo se enfría.", "Para preparar el cangrejo cocido y enfriado, primero quite las patas retirándolas del lugar donde se encuentran con el cuerpo.", "Retire las garras sacándolas del cuerpo.", "Separe el cuerpo de cangrejo de la parte central del cangrejo colocando el cangrejo sobre su parte posterior (con el lado duro hacia abajo). Coloque sus manos debajo del borde del cangrejo y empuje hacia arriba hasta que escuche que se rompe. Es posible que necesite usar un cuchillo pesado para ayudarlo a alejar el cangrejo.", "Retire los diez dedos esponjosos de los \"hombres muertos\" y deséchelos.", "Escurra el exceso de agua del caparazón del cangrejo y retire el saco estomacal y las membranas duras dentro del caparazón.", "Usa una cuchara para quitar la carne marrón del caparazón y cualquier caparazón blando que se haya formado. Colóquelo en un recipiente limpio y mastique con un tenedor.", "Presiona los bordes del caparazón de cangrejo, separando los bordes externos para formar un \"plato\" para servir.", "Rompe cada garra por la mitad. Use la manija de una cucharilla para sacar la carne blanca del extremo grueso de la uña. Coloque en un tazón limpio por separado.", "Use la parte posterior de un cuchillo de hoja gruesa para abrir la pieza restante de la garra y las pinzas. Retire toda la carne blanca y copos en el recipiente. Retire la pieza de cartílago dentro de cada una de las garras, retire la carne y deseche el cartílago.", "Para quitar la carne del cuerpo del cangrejo, toma un cuchillo afilado y corta el cuerpo de cangrejo por la mitad y luego por la mitad otra vez. Elija la carne con los dedos.", "Si las piernas son lo suficientemente grandes, vale la pena sacarles la carne. Ajústelos por la mitad y deseche el extremo delgado de la pierna. Usando la parte posterior de un cuchillo de hoja gruesa, rompe el caparazón en la parte más gruesa de la pierna. Saca la carne y agrega a tu tazón.", "Pase los dedos por la carne blanca en el tazón para separar la carne y extraer los restos de concha.", "Regrese la carne blanca y marrón preparada a las mitades separadas del caparazón de cangrejo preparado.", "Servir en un plato con mayonesa de buena calidad, un poco de pan moreno y una rodaja de limón. Adorne con perejil fresco, si lo desea."], "url": "www_bbc_co_uk_food_recipes_dressedcrab_90206", "title": "Cómo vestir un cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dressedcrab_90206_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de carne de cangrejo blanco", "sal al gusto", "pizca de pimentón ahumado", "Mayonesa 50 g / 2 oz", "50 g / 2 oz de yogur natural vivo", "pequeño cilantro fresco puñado, picado", "½ limón, solo jugo", "5 huevos de gallinas camperas", "Alcaparras de 75g / 2¾oz", "½ limón, solo ralladura", "pequeño puñado de perejil fresco de flatleaf, picado grueso", "50g / 2oz de crema de ensalada", "sal y pimienta negra recién molida", "Cohete 50g / 2oz", "pan crujiente, en rodajas, rociado con aceite de oliva y tostado"], "method": ["Para el cangrejo vestido, coloque la carne de cangrejo en un recipiente, sazone con sal y pimentón ahumado. Mezcle la mayonesa, el yogur, el cilantro y el jugo de limón al gusto.", "Coloque cuatro anillos de cocinero de metal en una bandeja forrada con película adhesiva y coloque la mezcla en la cuchara. Enfriar en la nevera hasta que sea necesario.", "Para la ensalada de alcaparras y huevos, coloque los huevos en agua hirviendo y cocine durante seis minutos, o hasta que estén hervidos. Retire los huevos del agua y revuelva en agua fría. Pelar y picar groseramente.", "En un tazón, mezcle los huevos picados, las alcaparras, la ralladura de limón y el perejil. Une la mezcla con la crema de ensalada y sazone con sal y pimienta negra recién molida.", "Para servir, coloque los anillos de metal con el cangrejo vestido en platos para servir y luego retire cuidadosamente los anillos. Adorne con el huevo y la ensalada de alcaparras y el cohete y sirva con el pan tostado."], "url": "www_bbc_co_uk_food_recipes_dressedcrabwithfresh_86531", "title": "Cangrejo cubierto con yogur fresco y cilantro", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de miel", "4 cucharadas de salsa de soja", "1 cucharada de semillas de sésamo", "4 cucharaditas de aceite de sésamo", "2 cucharaditas de cilantro fresco, picado"], "method": ["Mezcle todos los ingredientes y sirva."], "url": "www_bbc_co_uk_food_recipes_dressing_76414", "title": "Aderezo de miel y soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Albaricoques secos de 25g / 1oz, aproximadamente picados", "15g / ½ oz de manzana seca, más o menos picada", "Ciruelas pasas 15g / ½oz, más o menos picadas", "pellizcar la canela molida (opcional)", "100ml / 3½fl oz de agua hirviendo", "100ml / 3½fl oz de jugo de naranja", "100g / 3½oz de yogur sin grasa al estilo griego"], "method": ["Coloque la fruta seca y la canela, si está usando, en un recipiente resistente al calor.", "Vierta sobre el agua hirviendo y el jugo de naranja. Cubra y refrigere toda la noche.", "Cuando esté listo para comer, sirva con el yogur."], "url": "www_bbc_co_uk_food_recipes_dried_fruit_compote_with_78675", "title": "Compota de frutos secos con yogur", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de harina común", "50g / 2oz de mantequilla", "2 cucharaditas de sal", "Azúcar en polvo de 65 g / 2½ oz", "75g / 3oz de almendra molida", "1 x 7 g / ¼ onza de levadura seca de acción rápida", "300ml / 10fl oz de leche, calentada", "aceite vegetal, para engrasar", "125g / 4oz de almendras en copos", "150 g / 5oz de bayas secas mezcladas", "75g / 3oz de albaricoques secos, toscamente picados"], "method": ["Coloque la harina en un recipiente para mezclar y, con las puntas de los dedos, frote la mantequilla hasta que la mezcla se asemeje a migas de pan finas. Agregue la sal, el azúcar, las almendras molidas y la levadura y revuelva hasta que estén bien combinados.", "Agregue la leche y mezcle con un tenedor hasta que la mezcla se una como una masa pegajosa.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante cinco minutos, o hasta que la masa esté suave y elástica.", "Engrase ligeramente un recipiente con un poco de aceite vegetal. Coloque la masa en el recipiente y gírela hasta cubrirla con aceite. Cubra el recipiente con film transparente y déjelo a un lado en un lugar cálido durante una hora, o hasta que la masa se haya duplicado.", "Engrase ligeramente dos bandejas para hornear.", "Deje que la masa vuelva a su tamaño original y termine en una superficie de trabajo ligeramente enharinada. Amasar en la mitad de las almendras copos y toda la fruta seca.", "Espolvoree las almendras copos restantes en un plato.", "Divide la masa en 12 porciones y dales forma de rondas. Ruede cada ronda en las almendras en copos y colóquelas en las bandejas para hornear, con el lado cortado hacia arriba, asegurándose de que los rollos estén bien espaciados. Cubra con un paño de cocina y reserve para probar durante una hora.", "Precalentar el horno a 220C / 425F / Gas 7.", "Hornee los bollos de almendras durante 15-20 minutos o hasta que estén dorados y dorados. Retire los bollos del horno y déjelos a un lado para que se enfríen en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_dried_fruit_and_almond_47710", "title": "Frutos secos y bollos de almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12 rollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5 oz de mantequilla, en cubos", "80g / 3oz azúcar marrón claro suave", "80ml / 3fl oz de miel clara", "250 g / 9 oz de avena cocida", "80g / 3oz de cerezas secas", "80g / 3oz de arándanos secos", "1 cucharada de coco desecado", "Avellanas 50g / 2oz, conchas eliminadas, picadas", "100ml / 3½ fl oz crema doble", "100g / 3½oz de chocolate blanco, roto en pedazos", "Brandy de cereza de 25ml / 1fl oz"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Derrita la mantequilla, el azúcar y la miel en una sartén a fuego medio.", "Agregue la avena arrollada, las cerezas secas, los arándanos secos, el coco desecado y las avellanas y mezcle bien.", "Vierta la mezcla de flapjack en una lata de hornear cuadrada engrasada de 30cm / 12in x 20cm / 8in. Presione la mezcla en las esquinas y alise la parte superior.", "Coloque en el horno para hornear durante 20 minutos, o hasta que estén doradas y burbujeantes.", "Retirar del horno y dejar enfriar. Sal de la lata y corta en cuadrados del mismo tamaño.", "Para la salsa de chocolate, caliente la crema en una sartén hasta que se caliente. Agregue los trozos de chocolate hasta que estén derretidos y suaves, luego agregue el brandy.", "Sirva los flapjacks con la salsa en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_driedcherryandcranbe_88993", "title": "Flapjacks secos de cereza y arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/driedcherryandcranbe_88993_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 175g / 6oz de auto crianza", "1 cucharadita de polvo de hornear", "40 g / 1½ oz de azúcar en polvo", "1 naranja pequeña, solo ralladura", "1 huevo de gallinas camperas", "200ml / 7fl de leche en oz", "poco aceite de girasol, para greasig", "mantequilla o jarabe de arce o miel", "Yogur de estilo griego", "arándanos frescos y frambuesas"], "method": ["Mida la harina, el polvo de hornear, el azúcar y la ralladura de naranja en un tazón. Haga un pozo en el centro y luego agregue el huevo y la mitad de la leche. Batir bien, con un batidor, hasta que tenga una masa suave y espesa. Agregue suficiente leche para que la mezcla tenga la consistencia de una crema espesa, ya que es posible que no necesite toda la leche.", "Caliente una sartén grande antiadherente y unte con un poco de aceite. Ponga la mezcla en cucharadas sobre la sartén caliente, separando bien la mezcla para que se separen. Cuando aparezcan burbujas en la superficie, voltee los bollos con una espátula o espátula y cocine en el otro lado durante 30 segundos a 1 minuto o hasta que estén ligeramente dorados.", "Levante los panqueques en una rejilla de alambre y cubra con una toalla de té limpia para mantenerlos suaves. Continúa cocinando la mezcla de la misma manera.", "Sirva inmediatamente con mantequilla, jarabe o miel, yogur y arándanos, frambuesas u otras frutas de temporada."], "url": "www_bbc_co_uk_food_recipes_drop_scones_38257", "title": "Scones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/drop_scones_38257_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Habas de 150 g / 5½oz, envasadas", "2 cucharadas de aceite de oliva", "2 x 150 g / 5½ oz de tocino chuletas", "30ml / 1fl oz de vinagre de malta", "50g / 1¾oz de mantequilla", "2 cucharadas de vinagre de vino blanco", "sal y pimienta", "1 cucharadita de hojas frescas de mejorana", "10 flores de frijol"], "method": ["Ponga a hervir una cacerola mediana de agua y agregue las habas. Cocine por 2-3 minutos, luego sumérjalos en un tazón de agua fría.", "Calentar una sartén y agregar el aceite. Una vez caliente, agregue las chuletas de tocino. Cepíllalos con un poco de aceite mientras cocinas (usando un cepillo de silicona).", "Cocine por cuatro minutos y luego voltee y cocine por otros tres minutos.", "Desglasar la sartén con el vinagre y un poco de mantequilla. Cocine hasta que el volumen de líquido se reduzca a un glaseado espeso. Cepilla la salsa en la tajada.", "Retire la sartén del fuego y luego descanse durante dos minutos. Limpie la sartén del vinagre.", "En la misma sartén, caliente la mantequilla restante con un poco de agua tibia. Agregue las habas y sazone con sal y pimienta. Agregue las hojas de mejorana y retire del fuego.", "Para servir, ponga cada chuleta en el medio de un plato, vierta las habas y cubra con las flores de haba."], "url": "www_bbc_co_uk_food_recipes_dry_cured_smoked_bacon_38129", "title": "Chuleta de tocino ahumado curada en seco, habas y hojas de mejorana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de coco o aceite vegetal", "2 cucharaditas de semillas de mostaza negra", "2 cucharadas de hojas de curry fresco picado", "1 cucharadita de semillas de comino", "2 chiles secos de Cachemira, cada uno dividido en 3 o 4 piezas", "Jengibre fresco de raíz de 30g / 1oz (o 6cm / 2½in), finamente rallado en una pasta", "½ cucharadita de cúrcuma molida", "1 cucharadita de sal", "½ cucharadita de pimienta negra molida", "250g / 9oz hispi o repollo de primavera puntiagudo (o verdes de primavera), triturado en trozos de 5 mm", "2 zanahorias, cortadas en cubitos", "2 chiles verdes frescos, cortados en rodajas finas, con semillas", "100g / 3½oz de carne fresca o congelada de coco, mezclado en un procesador de alimentos o rallado", "arroz basmati hervido", "poppadoms"], "method": ["Caliente el aceite en una cacerola o karahi de base pesada a fuego medio y, cuando esté caliente, agregue las semillas de mostaza seguidas de las hojas de curry, las semillas de comino y los chiles secos. Revuelva durante unos 30 segundos, luego agregue la pasta de jengibre, la cúrcuma, la sal y la pimienta negra y fría por 30 segundos.", "Agregue el repollo y las zanahorias y cocine, tapado, a fuego medio durante 5-7 minutos, o hasta que las verduras estén tiernas, agregando un chorrito de agua si empiezan a pegarse a la sartén.", "Agregue los chiles verdes y el coco, caliente durante un minuto y sirva. Sirve con arroz y poppadoms."], "url": "www_bbc_co_uk_food_recipes_dry_curry_of_cabbage_71527", "title": "Curry seco de repollo, zanahoria y coco (Thoran)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dry_curry_of_cabbage_71527_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz anacardos", "½ cucharadita de cúrcuma molida", "1 cucharadita de semillas de cilantro", "1 cucharadita de curry en polvo", "1 cucharadita de semillas de comino", "½ chile rojo, picado", "Filete de abadejo de 85g / 3oz, desollado y picado", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de aceite vegetal", "½ limón, solo jugo", "1 espinaca bebé puñado", "2 cucharadas de cilantro fresco, picado", "1 camote, finamente cortado en una mandolina", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "½ cucharadita de curry en polvo"], "method": ["Para el curry de pescado, coloque los anacardos, las especias y el chile en un procesador de alimentos y mezcle hasta que quede suave. Transfiera a un plato poco profundo y reserve una cucharada de la mezcla para la ensalada de espinacas.", "Cubra el pescado en el huevo batido y luego revuelva en la mezcla de especias. Calentar el aceite vegetal en una sartén y freír el pescado durante 5-6 minutos, o hasta que esté dorado por completo y cocido.", "Para la ensalada de espinacas, mezcle la mezcla de especias reservada con el jugo de limón. Coloque el bebé espinaca y cilantro en un recipiente y vierta sobre la mezcla de limón y especias, luego mezcle bien para combinar.", "Para las batatas, coloque las rodajas de boniato en una sartén con aceite, jugo de limón y polvo de curry, y suficiente agua hirviendo para cubrir. Cocine a fuego lento con una tapa durante 7-8 minutos, o hasta que la batata esté tierna.", "Para servir, coloque las rodajas de boniato en un plato y coloque la ensalada de espinacas al lado. Cuchara de pescado al curry en la parte superior de las rodajas de camote."], "url": "www_bbc_co_uk_food_recipes_dryfishcurrywithspin_89978", "title": "Pescado al curry con ensalada de espinacas y boniato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]