[{"ingredients": ["500 g / 1 lb 2 oz de manzanas de cangrejo, peladas y partidas por la mitad", "Azúcar 250 g / 9 oz", "Agua para cubrir", "hojas de gelatina, empapadas", "100g / 3½oz de arroz blanco", "Azúcar demerara 100 g / 3½ oz", "25 g / 1 oz de hojas de té de su elección", "8 filetes de caballa", "sal y pimienta negra recién molida", "aceite, para engrasar"], "method": ["Para la gelatina, ponga las manzanas y el azúcar en una sartén y vierta suficiente agua para cubrir. Llevar a ebullición y cocinar hasta que las manzanas estén suaves y se caigan.", "Cuele las manzanas cocidas a través de un colador y vierta el líquido filtrado en una jarra medidora. Por cada 500ml / 18fl oz de líquido necesitará dos hojas de gelatina. Agregue la gelatina al líquido mientras aún está caliente, revuelva para disolver, cuele nuevamente y luego enfríe la gelatina en el refrigerador.", "Para la mezcla para fumar, mezcle el arroz, el azúcar demerara y las hojas de té en un tazón. Cubra una sartén profunda o wok con papel de aluminio, coloque a fuego alto y agregue la mezcla para fumar.", "Sazonar la caballa con sal y pimienta negra recién molida. Engrase una rejilla para enfriar con un poco de aceite y coloque la caballa en la rejilla, con la piel hacia abajo. Cuando la mezcla comience a humear, coloque la parrilla sobre la sartén o el wok y cubra con papel de aluminio. Apague el fuego y deje que la caballa se cocine lentamente a medida que se enfría.", "Cuando estén cocidos, coloque los filetes de caballa en los platos y sirva con la jalea de manzana de cangrejo."], "url": "www_bbc_co_uk_food_recipes_tea-smoked_mackerel_with_32050", "title": "Caballa ahumada con jalea de manzana de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de patatas nuevas, divididas a la mitad o en cuartos, dependiendo del tamaño", "2 cucharadas de eneldo fresco, finamente picado", "1 pequeño racimo de berros", "4 cebollas de primavera", "sal y pimienta negra recién molida", "2 bolsitas de té Earl gris, hojas reservadas, bolsas descartadas", "2 filetes de caballa", "3 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "1 cucharada de vinagre de sidra", "1 cucharadita de mostaza integral"], "method": ["Para hacer la ensalada de papa, coloque las papas nuevas en una cacerola, cubra con agua fría y sazone con sal y pimienta. Llevar a ebullición y cocinar durante 15-20 minutos, o hasta que estén tiernos. Escurrir y dejar enfriar.", "Mientras tanto, prepara un fumador con las hojas de té y las astillas de madera colocadas en el fondo. (PRECAUCIÓN: fumar en el té genera mucho humo. Cocine en un área bien ventilada, y abra el wok afuera si es posible). Coloque los filetes de caballa encima, cúbralos con la tapa y fume durante 2-3 minutos.", "En un tazón grande, mezcle el eneldo, el berro, la cebolleta y las patatas enfriadas.", "Para hacer el aderezo, mezcle los ingredientes en un tazón pequeño.", "Vierta el aderezo sobre la ensalada de papa y mezcle bien. Rompe los filetes de pescado y remueve la ensalada. Servir."], "url": "www_bbc_co_uk_food_recipes_tea-smoked_mackerel_with_54880", "title": "Caballa ahumada con una nueva ensalada de patata y aderezo de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de pan espesas", "2 filetes de caballa ahumada", "5 cucharadas de crema doble", "60 g / 2¼ oz de queso parmesano", "pimienta negra recién molida", "1 cucharada de cebollino picado", "rábano picante fresco, al gusto"], "method": ["Haga que tostan cuatro rebanadas de su pan favorito debajo de la parrilla.", "Pele la piel de la caballa y vierta en un cuenco. Agregue cuatro cucharadas de crema doble, ralle en 50 g / 2 oz de parmesano, agregue una pizca de pimienta negra y mezcle con un tenedor. Agregue una cucharada de cebolletas picadas y un poco de rábano picante rallado, y mezcle de nuevo.", "Apila la mezcla sobre la tostada. Agregue una llovizna final de crema y una dispersión de queso parmesano rallado y póngalos debajo de la parrilla durante 3-4 minutos. Sirve cuando comiencen a burbujear y dorar."], "url": "www_bbc_co_uk_food_recipes_tea-time_mackerel_16856", "title": "Caballa a la hora del té", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 4 tostadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea-time_mackerel_16856_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de 400 g / 14 oz, fregadas y finamente cortadas", "4 cucharadas de aceite de oliva", "1 diente de ajo, pelado y picado", "1 cebolla, pelada y rebanada", "1 bulbo de hinojo, cortado y rebanado", "1 cucharadita de semillas de hinojo", "4 filetes medianos u 8 pequeños de trucha, pinboned", "285ml / ½ pinta de crema individual", "2 puñados de queso parmesano recién rallado, más extra para rociar", "2 filetes de anchoa", "sal marina y pimienta negra recién molida", "2 puñados de migas de pan frescas", "2 limones, cortados a la mitad"], "method": ["Precalentar el horno a 200 ° C / 400 ° F / Gas 6. Precalentar las papas en rodajas en agua hirviendo con sal durante unos minutos hasta que se ablanden, luego drenar en un colador.", "Coloque una sartén estilo cacerola de 20 cm / 8 in a fuego lento, y agregue las semillas de aceite, ajo, cebolla, hinojo y hinojo. Cocine lentamente durante 10 minutos con la tapa puesta, revolviendo cada cierto tiempo.", "Saca la sartén del fuego. Coloque los filetes de trucha con la piel hacia arriba sobre la cebolla y el hinojo.", "Mezcle la crema, el parmesano y las anchoas, sazone con sal y pimienta negra recién molida, y vierta sobre los pescados. Mezcle las rodajas de patata con un poco de aceite de oliva, sazone con sal y pimienta y cubra con ellas por la parte superior.", "Coloque en el horno durante 20 minutos, rocíe con el pan rallado y un poco de queso parmesano rallado cinco minutos antes del final. ¡Sirve con mitades de limón, ensalada verde y cervezas frías!"], "url": "www_bbc_co_uk_food_recipes_tastyfishbake_73312", "title": "Sabroso pescado hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ limón, solo jugo", "1 manzana, sin núcleo, cortado en trozos pequeños", "¼ de pepino, finamente cortado", "200g / 7oz de queso crema", "½ manojo de menta, picado", "¼ de manojo de perejil de hojaldre, picado", "1 baguette delgado, reducido a la mitad horizontalmente y ligeramente untado con mantequilla", "150g / 5½oz de queso crema", "½ cebolla roja, finamente picada", "1 cucharada de alcaparras, escurridas, finamente picadas", "8 rebanadas de pan integral, ligeramente untadas con mantequilla", "8 rebanadas de salmón ahumado", "4 huevos de gallinas camperas, hervidos, pelados, picados", "3-4 cucharadas de mayonesa", "1 cucharada de alcaparras, escurridas, finamente picadas", "sal y pimienta negra recién molida", "8 rebanadas de pan, ligeramente untadas con mantequilla", "berro pequeño"], "method": ["Para los sándwiches de manzana y pepino, mezcle la manzana con el jugo de limón.", "Coloque el queso crema en un tazón y agregue las hierbas. Agregue los trozos de manzana y un poco del jugo de limón.", "Coloque las rodajas de pepino a lo largo de la mitad inferior de la barra de pan, superponiendo ligeramente cada rebanada. Vierta la mezcla de queso crema y manzana y agregue la mitad superior de la barra de pan. Cortar en sándwiches de 5cm / 2in.", "Para los sándwiches de salmón ahumado, alcaparras y queso crema, mezcle el queso crema, la cebolla roja y las alcaparras en un tazón.", "Extiende esta mezcla en cuatro rebanadas del pan. Cubra con el salmón ahumado y cierre los sándwiches con las rebanadas de pan restantes.", "Retire las cortezas y corte los sándwiches en cuartos.", "Para los sándwiches de mayonesa de huevo y alcaparra, mezcle los huevos, la mayonesa y las alcaparras en un tazón. Sazonar, probar con sal y pimienta negra recién molida.", "Extienda la mayonesa de huevo en cuatro rebanadas del pan. Espolvorea sobre el berro y cierra los sándwiches con las rebanadas de pan restantes.", "Retire las cortezas y corte los sándwiches en los dedos."], "url": "www_bbc_co_uk_food_recipes_tea_sandwiches_59195", "title": "Sandwiches de té", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_sandwiches_59195_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pan fuerte de 400g / 14oz, más extra para quitar el polvo", "1½ cucharadita de sal", "40 g / 1½ oz de azúcar en polvo", "Mantequilla de 40g / 1½oz, ablandada, más extra para engrasar", "10g / ¼ oz de levadura seca de acción rápida", "120ml / 4fl de leche en oz", "50g / 1¾oz sultanas", "60 g / 2¼ oz de cerezas heladas", "1 cucharadita de canela molida", "3 naranjas, solo cáscara", "200g / 7oz de azúcar glasé", "mantequilla, al gusto"], "method": ["Coloque la harina, la sal, el azúcar, la mantequilla, la levadura, la leche y 120 ml / 4 onzas de agua en un bol y mezcle con las manos.", "Cuando se haya incorporado toda la harina, incline la masa sobre una superficie de trabajo ligeramente enharinada y amasar hasta que quede suave y flexible.", "Regrese la masa al recipiente, cúbrala con una película adhesiva y déjela reposar durante una hora.", "Agregue las pasas, las cerezas, la canela y la ralladura de naranja a la masa y, usando un mezclador eléctrico o sus manos, trabaje bien.", "Forme la masa en forma de salchicha aplanándola y enrollándola.", "Pon la masa en una bandeja de horno engrasada. Deslice la bandeja de horno dentro de una bolsa de plástico para proteger la masa de corrientes de aire, teniendo cuidado de no dejar que la bolsa de plástico toque la parte superior del pan. Deja crecer durante una hora.", "Precalentar el horno a 220C / 425F / Gas 7.", "Hornee la masa durante 25-30 minutos, luego transfiera a una rejilla para que se enfríe.", "Mientras el pan se está enfriando, haga que el agua se congele. Incline el azúcar glas en un bol, agregue un poco de agua y mezcle bien para formar una pasta. Poco a poco agregue más agua hasta que la formación de hielo sea lo suficientemente gruesa como para cubrir la parte posterior de una cuchara.", "Rocíe o extienda la guinda sobre la parte superior del pan de té. Cortar en rodajas y comer con látigos de mantequilla."], "url": "www_bbc_co_uk_food_recipes_tea_loaf_75867", "title": "Pan de té", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_loaf_75867_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 450g / 1lb", "Polvo de hornear 2 cucharaditas de nivel", "50 g / 1 oz de azúcar en polvo", "100 g / 3½ onzas de mantequilla, ablandadas, cortadas en trozos", "2 huevos de gallinas camperas", "un poco de leche", "puñados sultanas (opcional)", "Mermelada de fresa", "nata"], "method": ["Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Engrase ligeramente dos bandejas para hornear.", "Coloque la harina, el polvo de hornear y el azúcar en un tazón grande. Agregue la mantequilla y frote con la punta de los dedos hasta que la mezcla se asemeje a migas de pan finas.", "Agriete los huevos en una jarra de medir, luego agregue suficiente leche para que el líquido total 300 ml / 10 fl oz. Revuelva el huevo y la leche en la harina, puede que no lo necesite todo, y mezcle con una masa suave y pegajosa.", "Dé vuelta a una superficie de trabajo ligeramente enharinada, amasar ligeramente y trabajar en las sultanas, si se usa. Estirar a un rectángulo de aproximadamente 2 cm / ¾ de grueso.", "Corte en tantas rondas como sea posible con un cortador acanalado de 5cm / 2in y colóquelos en las bandejas de hornear preparadas. Cepille la parte superior de los bollos con un poco de leche extra, o cualquier huevo y leche que quede en la jarra.", "Hornea de 12 a 15 minutos o hasta que los bollos estén bien aliñados y tengan un color marrón pálido. Levante sobre una rejilla para enfriar. Come lo más fresco posible.", "Para servir, divida los bollos y sirva con mermelada de fresa en los bollos, junto con una buena cucharada de crema coagulada."], "url": "www_bbc_co_uk_food_recipes_tea_time_scones_77839", "title": "Bollos clásicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 bollos pequeños", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_time_scones_77839_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 tomates, cortados a la mitad y sin semillas", "3 ramitas de tomillo, solo hojas", "2 cucharadas de aceite de oliva", "Mantequilla 250g / 9oz, ablandada", "sal y pimienta negra recién molida", "4 filetes de T-bone", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "3 papas para hornear grandes, peladas y cortadas en chips de 1.5cm / ½ in de espesor", "aceite vegetal, para freír", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "250 g / 9 oz hojas de espinaca bebé", "sal y pimienta negra recién molida", "pellizcar la nuez moscada recién rallada, al gusto"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Para la mantequilla de tomate asada, coloque los tomates en una bandeja para hornear, con el lado cortado hacia arriba y sazone con sal y pimienta negra recién molida. Espolvorea sobre las hojas de tomillo y rocía con el aceite de oliva.", "Coloque en el horno y tueste durante 20 minutos. Apague el horno y deje los tomates en el horno durante 4-5 horas, o durante la noche, hasta que estén semisecos pero aún suaves.", "Coloque la mantequilla en un procesador de alimentos y mezcle para suavizar. Agregue los tomates tostados y el pulso hasta que se combinen. Compruebe el condimento y agregue más sal y pimienta negra recién molida, si es necesario.", "Coloque la mantequilla de tomate en un trozo de película adhesiva. Envuelva la película adhesiva alrededor de la mantequilla y enrolle con fuerza para formar una forma de salchicha, girando en ambos extremos para sellar. Coloque en la nevera durante al menos una hora, hasta que estén fríos y firmes.", "Para los filetes, sazone los filetes con sal y pimienta negra recién molida. Caliente una sartén grande hasta que esté caliente, agregue el aceite, la mantequilla y los filetes.", "Freír los filetes durante 4-5 minutos en ambos lados, dependiendo del grosor de los filetes, o hasta que se cocinen a su gusto. Retire de la sartén y deje reposar en un plato caliente durante 5-10 minutos.", "Mientras tanto, para las papas fritas, caliente una freidora a 150C. Cocine las papas en lotes durante 2-3 minutos, hasta que estén suaves pero no coloreadas. Retire con una espumadera y escurra sobre papel de cocina.", "Aumente la temperatura de la freidora a 190C. Regrese las papas fritas a la freidora, en tandas, y cocine hasta que estén doradas y cocidas. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar generosamente con sal y pimienta negra recién molida.", "Para las espinacas, caliente una sartén hasta que esté caliente. Agregue la mantequilla, el aceite y las espinacas y cocine hasta que la espinaca se haya marchitado. Sazonar, al gusto, con sal, pimienta negra recién molida y nuez moscada recién rallada.", "Para servir, divida las fichas entre cada una de las cuatro placas de servir. Coloque la espinaca al lado y cubra con un bistec. Desenvuelva la mantequilla de tomate y corte en rodajas gruesas. Coloque una rebanada en la parte superior de cada filete y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tbonesteakwithroaste_89101", "title": "T-bone steak con mantequilla de tomate asada, espinacas marchitas y chips de grasa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz de harina blanca fuerte, más extra para espolvorear", "1 cucharada de sal", "15 g bolsitas de levadura de acción rápida", "Leche 400ml / 14fl oz", "60 g / 2¼ oz de mantequilla sin sal, más extra para engrasar", "2 huevos de gallinas camperas", "1 x 411 g de carne picada de jarra", "1 manzana, sin corazón y finamente picada", "1 pera, sin corazón y finamente picada", "1 naranja, ralladura fina solamente", "75 g / 2½ oz de pistachos pelados, picados", "100g / 3½oz de cáscara confitada", "1 cucharada de canela molida", "25 g / 1oz de mantequilla sin sal, derretida", "3 cucharadas de mermelada de albaricoque", "200g / 7oz de azúcar glas, tamizado", "1 naranja, ralladura fina solamente", "15 cerezas heladas", "40 g / 1½ oz de cáscara confitada", "25 g / 1 oz de pistachos picados"], "method": ["Coloque la harina en un tazón grande para mezclar, agregue la sal a un lado y la levadura al otro lado.", "Caliente la leche y la mantequilla en una olla pequeña hasta que la mantequilla se derrita y la mezcla esté tibia. Viértalo en la mezcla de harina, agregue los huevos y revuelva bien hasta que el contenido del recipiente se una como una masa blanda (la masa estará pegajosa).", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase bien durante 5 minutos o hasta que la masa esté suave y elástica. Alternativamente, esto se puede hacer en un mezclador independiente usando un gancho de masa.", "Coloque la masa en un recipiente engrasado y deje que se levante, cubierto con una toalla de té húmeda, durante 1 hora o hasta que duplique su tamaño. Esto se hace mejor en una habitación cálida.", "Para el relleno, mezcle la carne picada con la manzana, la pera, la ralladura de naranja, los pistachos, la cáscara confitada y la canela.", "Cuando se haya levantado, incline la masa sobre una superficie de trabajo ligeramente enharinada. Estirar en un rectángulo de aproximadamente 50x45cm / 20x18in. Tapa el lado largo del rectángulo de masa más cercano presionando hacia abajo sobre la superficie de trabajo con el pulgar. Cepille todo con la mantequilla derretida. A continuación, extienda la mezcla de carne picada sobre la masa dejando un borde de 2 cm / ¾ pulgada.", "Ruede el lado opuesto de la masa hacia usted bastante bien, hasta que el rollo esté completo y apretado. Recorte los extremos para limpiar. Con un cuchillo afilado, córtelo en 15 rondas de aproximadamente 4 cm / 1½ pulgadas de grosor.", "Alinee una bandeja para hornear muy grande (o use la bandeja de la parrilla de su horno) con un pergamino para hornear. Coloque los rollos en la bandeja preparada, con el lado cortado hacia arriba, en forma de árbol de Navidad, con 1 en la parte superior, 2 en la parte inferior, 3 en la tercera fila, 4 en la cuarta fila y 5 en la quinta fila. Use algunos de los adornos para hacer un tronco. Desea que estén lo suficientemente cerca para que sus lados se toquen cuando la masa haya subido. Luego pueden separarse y obtienes una ventaja suave encantadora.", "Cúbralo con una toalla de té limpia y deje que la masa se levante durante 30-45 minutos.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Cuando los panecillos hayan subido, colóquelos en el horno y hornee por 20-25 minutos o hasta que estén dorados. Luego de 15 minutos, revise y cubra los panecillos con papel de aluminio si se doran demasiado rápido.", "Retire los panecillos del horno y déjelos enfriar un poco antes de transferirlos a un estante de enfriamiento.", "Para terminar, derrita el atasco en una olla pequeña con un chorrito de agua hasta que quede suave. Cepille la mermelada sobre los panecillos para glasear y deje que se enfríe por completo.", "Mezcle el azúcar glas, la ralladura de naranja y 2 cucharadas de agua juntas. Transfiera a una manga pastelera descartable y corte una pequeña punta. Pinte las guirnaldas en los bollos para que se parezcan a un árbol de Navidad decorado. Adorne con cerezas glaseadas, cáscara confitada y puntas de pistacho picadas."], "url": "www_bbc_co_uk_food_recipes_tear_and_share_christmas_58564", "title": "Rasga y comparte los bollos Chelsea de Navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tear_and_share_christmas_58564_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 ml / 3½ flf oz mirin (vino de arroz)", "75ml / 2½fl oz de salsa de soja oscura", "1 cucharada de vinagre de arroz", "1 x 13cm / 5in strip kombu (algas secas)", "2 cucharadas de ponzu (salsa japonesa basada en cítricos), si no está disponible, use jugo de limón fresco, más 1-2 cucharaditas extra de sabor", "cuñas de limón, para adornar", "1 cebolla tierna (parte verde solamente), finamente rebanada", "pellizcar los copos de chile seco (opcional)", "Lanzas de espárragos de 240 g / 9 oz, recortadas", "Escalopes de reina sin huevas de 200-250 g / 7-9 onzas (o 18 vieiras sin orujo medio), descongelados si están congelados", "aceite de girasol, para freír (aproximadamente 1 litro / 1¾ pintas)", "100 g / 3½ oz de harina de maíz", "100g / 3½ oz de harina de auto crianza", "1 cucharada de semillas de sésamo", "1 huevo grande de gallinas camperas, solo yema de huevo", "200 ml / 7 fl oz de agua con gas refrigerada"], "method": ["Para el aderezo Ponzu, vierta el mirin, la salsa de soja, el vinagre y el kombu en una olla pequeña y déjelos hervir a fuego lento. Cocine por tres minutos, o hasta que se reduzca a casi la mitad, revolviendo ocasionalmente.", "Retire la sartén del fuego y deje enfriar. Cuando el líquido se haya enfriado, retire el kombu y mezcle el ponzu o jugo de limón. (Agregue un poco de jugo de limón adicional si es necesario justo antes de servirlo; desea que el aderezo tenga un sabor muy chispeante.) Vierta en recipientes individuales para inmersión y colóquelos en platos para servir con finas rodajas de limón. (Alternativamente, ponga en un tazón pequeño y colóquelo en un plato para servir). Agregue la cebolla tierna y el chile en escamas seco (si lo desea, no es estrictamente auténtico, pero sí un buen toque).", "Llene una olla grande con suficiente agua para recorrer un tercio de los lados. Llevar a ebullición a fuego alto. Agregue las lanzas de espárragos, cortando las lanzas particularmente largas o gruesas en diagonal por la mitad primero. Vuelva a hervir y cocine durante 1 ½ minutos, o hasta que esté tierno. Escurrir en un colador bajo agua corriente hasta que esté frío. Séquelo con papel de cocina y déjelo a un lado.", "Pat las vieiras secas en papel de cocina. Vierta 4 cm / 1½ pulgada de aceite en una olla grande de base amplia. Coloque a fuego medio y caliente a 180 ° C / 350 ° F usando un termómetro de cocción para verificar la temperatura en todo momento. Alternativamente, use una freidora eléctrica de grasa (PRECAUCIÓN: No permita que el aceite se recaliente. No deje el aceite caliente desatendido).", "Para hacer la mezcla, coloque la harina de maíz, la harina autoacabada y las semillas de sésamo en un tazón grande y mezcle hasta que estén bien combinados. Haz un bien en el centro. Batir la yema de huevo con la mitad del agua en un recipiente aparte y agregar gradualmente a la mezcla de harina, usando un batidor para introducir los ingredientes secos en el líquido. Cuando la masa esté espesa, mezcle lentamente el resto del líquido hasta que la masa esté mezclada. No sobre-batir o hacer la masa demasiado suave.", "Si usa vieiras medianas o de rey, córtalo por la mitad horizontalmente por el medio. Deja pequeñas vieiras reina enteras. Coloque 10-12 de las vieiras o pedazos de vieiras en la masa y gírelos hasta que queden ligeramente cubiertos.", "Trabajando rápidamente, tome uno a la vez con pinzas o un par de tenedores y sumérjalos suavemente en el aceite caliente. Mantenga el recipiente cerca de su cacerola o freidora, ya que la masa es delgada y goteará con bastante rapidez. Coloque las vieiras en diferentes áreas de la sartén para que no tengan la oportunidad de mantenerse juntas.", "Una vez que todas las piezas de vieiras maltratadas estén en el aceite, freír durante 2-2 ½ minutos, o hasta que estén pálidas doradas y muy crujientes. Vigile la temperatura del aceite para que no se recaliente o enfríe demasiado. Use una cuchara con ranura a prueba de calor para recoger los trozos de la mezcla que se separan de las vieiras y para empujar las escalopas que se adhieren al fondo de la sartén. Todos deberían flotar mientras fríen.", "Retire las vieiras tempura con la cuchara ranurada y escurrir sobre papel de cocina. Continúe friendo las vieiras restantes en lotes como los de arriba hasta que estén cocidos. Agregue los espárragos a la mezcla, en lotes si es necesario, y cocínelos como se indica arriba durante 1½-2 minutos o hasta que estén crujientes. Escurrir sobre papel de cocina.", "Disponga las vieiras y los espárragos en los platos de servir con el aderezo Ponzu y las rodajas de limón para decorar. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tempura_scallops_and_24441", "title": "Vieiras tempura y espárragos con aderezo Ponzu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tempura_scallops_and_24441_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 bolsitas de té, divididas, té retirado, bolsas descartadas", "55g / 2oz de azúcar morena suave", "55g / 2oz de arroz de grano largo", "300g / 11oz de eglefino sin teñir", "75g / 3oz de mantequilla", "75ml / 3fl oz de agua", "Harina común 110g / 4oz", "Frijoles de 55 g / 2 oz, escaldados y cortados muy finamente", "2 huevos de gallinas camperas", "1 cucharada de albahaca fresca picada", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas", "150ml / 6fl oz de caldo de pescado", "Crema doble 75ml / 3fl oz", "55 g / 2 oz de judías verdes, escaldadas y picadas", "1 tomate, finamente picado", "sal marina y pimienta negra recién molida"], "method": ["Para el eglefino, mezcle el té, el azúcar y el arroz en un tazón.", "Cubra una cacerola grande, ancha y profunda con papel de aluminio y agregue la mezcla de arroz.", "Coloque otra hoja de papel de aluminio sobre la mezcla de té y coloque el pescado encima. Ponle una tapa a la olla. Coloque a fuego alto y cocine durante diez minutos, hasta que estén cocidos. NB: fumar en el té gnera mucho humo. Asegúrese de abrir las ventanas y obtener la mayor ventilación posible.", "Para los gnocchi, coloca la mantequilla y el agua en una cacerola y lleva a ebullición, luego agrega la harina, bate con una cuchara de madera hasta que quede suave, luego retira del fuego.", "Transfiera la mezcla de gnocchi a un tazón limpio y agregue los huevos, las hierbas y los frijoles, agréguelos para combinarlos.", "Coloque la mezcla de gnocchi en una manga pastelera y póngala sobre una superficie limpia y enharinada en una salchicha larga. Luego corte en pedazos de 5cm / 2in ..", "Llene una olla con agua hirviendo y agregue un poco de sal. Una vez que el agua esté hirviendo, agregue los gnocchi y cocínelos durante cinco minutos, o hasta que estén flotando en la superficie, luego retírelos con una espumadera y escurra sobre papel de cocina.", "Mientras tanto, para la salsa, mezcle el caldo y la crema en una cacerola y cocine a fuego lento hasta que el líquido se haya reducido a la mitad. Agregue los frijoles picados y el tomate cortado en cubitos a la salsa, al gusto, y sazone con sal y pimienta negra recién molida.", "Para servir, agregue los ñoquis a la salsa y vierta en un plato para servir. Retire con cuidado el eglefino y colóquelo encima."], "url": "www_bbc_co_uk_food_recipes_teasmokedhaddockwith_84034", "title": "Abadejo ahumado con té y gnocchi de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para freír en grasa", "Calamar de 500g / 1lb 2oz, limpiado, cortado en tiras", "500g / 1lb 2 oz de langostinos crudos, sin cáscara", "2 cucharadas de salsa de soja ligera", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de aceite de sésamo", "2 limas", "100 g / 3½ oz de harina de maíz", "3 cebollas tiernas, en rodajas finas", "1 guindilla roja larga, más o menos picada", "1 pequeño puñado de hojas de cilantro, más o menos picadas", "1 pequeño puñado de hojas de menta, más o menos picadas", "1 diente de ajo, en rodajas", "1 guindilla roja larga, en rodajas", "2 cucharadas de azúcar de palma", "1 cucharada de salsa de pescado", "1 cucharada de salsa de soja", "1 cucharada de aceite de sésamo", "1 cucharada de vino de arroz Shaoxing o jerez seco", "1 lima, solo jugo"], "method": ["Caliente el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. Alternativamente, use una freidora y caliente a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque el calamar y las gambas en un bol y mézclelas bien con la salsa de soja, el vino de arroz Shaoxing (o jerez seco), el aceite de sésamo y el jugo de una lima, luego déjelos a un lado mientras prepara la salsa.", "Para la salsa, ponga la mitad de las hierbas y todos los demás ingredientes para la salsa en un procesador de alimentos pequeño y mezcle hasta obtener un puré fino.", "Para hacer la masa de tempura, agregue la harina de maíz al calamar y las gambas y mezcle bien para cubrir, será muy pegajoso.", "Con cuidado, coloque los mariscos en la grasa en lotes y fríelos durante dos minutos, o hasta que estén recién hechos y crujientes. Retirar con una espumadera y escurrir sobre un plato forrado con papel de cocina.", "Para servir, ponga la tempura frita en un plato, luego vierta sobre el aderezo, espolvoree las hierbas reservadas y termine con las cebolletas y el chile picado.", "Corte la lima restante en trozos y colóquela al lado."], "url": "www_bbc_co_uk_food_recipes_tempura_squid_and_prawns_97646", "title": "Calamar tempura y gambas con salsa de cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "2 zanahorias picadas", "1 puerro, picado", "2 palitos de apio, picados", "1 chile rojo, en rodajas", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y rebanado", "2 cucharadas de puré de tomate", "algunas ramitas de tomillo fresco", "2 hojas de laurel", "algunas ramitas de estragón fresco", "cáscaras y cabezas de gambas (reservado a partir de los camarones se enumeran a continuación)", "1kg / 2lb 4oz espinas de pescado, limpiadas", "salpicaduras de coñac", "400ml / 14fl oz de vino blanco", "400-600ml / 14-20fl oz de crema (al gusto)", "sal y pimienta negra recién molida", "Harina normal de 100 g / 3½ oz", "50g / 1¾oz de harina de maíz", "pizca de sal", "agua con gas", "pequeño puñado de hielo", "8 gambas de tigre entero (peladas, conchas y cabeza reservada para la sopa de mariscos, luego butterflied)", "aceite vegetal, para freír en grasa", "puñado de cebolleta en rodajas, colocado en un recipiente con agua helada para enrollar", "cilantro picado"], "method": ["Para hacer la sopa, caliente dos cucharadas de aceite vegetal en una sartén grande y fría las zanahorias, el puerro y el apio durante unos minutos para que se ablanden.", "Agregue el chile y el jengibre y mezcle el puré de tomate, el tomillo, la bahía y el estragón y continúe cocinando durante 1-2 minutos.", "Agregue las cáscaras de gambas y las cabezas y cocine en la sartén hasta que estén doradas. Agregue los huesos de pescado y luego vierta el coñac y el vino blanco y revuelva para desglasar.", "Vierta suficiente agua para cubrir los huesos, hierva y luego reduzca el fuego y deje hervir a fuego lento durante una hora.", "Deje que la sopa se enfríe un poco, luego mezcle con una batidora de mano. Colar en una sartén limpia. Cocine para reducir el volumen de líquido por otros 30 minutos, o hasta que se reduzca en un tercio.", "Agregue la crema al gusto y sazone al gusto con sal y pimienta negra recién molida.", "Para hacer la tempura, mezcle la harina, la harina de maíz y la sal en un tazón grande. Poco a poco mezcle el agua con gas para formar una masa suave. Dejar de lado durante 20-30 minutos.", "Caliente una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las gambas en la mezcla y luego fría en aceite caliente durante 1-2 minutos, o hasta que estén doradas y cocidas.", "Para servir, coloque las gambas en platos para servir y decore con rebanadas de cebolleta. Coloque la sopa en un plato para servir al costado y sirva espolvoreado con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_tempura_tiger_prawns_73225", "title": "Gambas tigre Tempura con chile aterciopelado y sopa de infusión de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾ harina lisa", "50g / 1¾ harina de maíz", "pizca de sal", "150ml / 5fl oz de agua con gas", "1 calabacín, cortado en 8cm / 3¾ en bastones", "Brócoli brotación púrpura de 100g / 3½oz, cortado en florecillas", "1 cebolla roja, pelada y cortada en pétalos", "Mangetout 100g / 3½ oz", "1 zanahoria, cortada en trozos y blanqueada", "4 yemas de huevo de gallinas camperas", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "500ml / 18fl oz de colza o aceite de oliva ligero", "1 - 2 cucharaditas yuzuji, tú", "2 cucharadas de salsa picante", "sal y pimienta negra recién molida", "4 cebollas de primavera, en rodajas finas", "1 chile rojo, cortado en juliana", "2 cucharadas de berro de coriandro"], "method": ["Para las verduras tempura, caliente una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso, no lo deje desatendido).", "Mezcle la harina, la harina de maíz y la sal en un tazón. Agregue suficiente agua con gas para formar una masa suave (puede que no necesite toda el agua).", "Sumerja las verduras en la mezcla y cuidadosamente baje en el aceite caliente. Fría durante 1-2 minutos en cada lado, o hasta que estén crujientes y doradas en ambos lados. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre un plato forrado con papel de cocina.", "Para el aderezo yuzu, coloca las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos. Mezcle para combinar luego, con el motor todavía en funcionamiento, agregue gradualmente el aceite.", "Continúe licuando hasta que se haya agregado todo el aceite y la mayonesa se haya espesado. Sazonar con el jugo de yuzu, salsa de chile, sal y pimienta negra recién molida, al gusto.", "Para servir, coloque las verduras en un plato con el aderezo yuzu en un recipiente hondo. Adorne las verduras con cebollas de primavera, chile y berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_tempura_vegetables_with_43426", "title": "Vegetales tempura con aderezo yuzu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 cubitos de hielo", "150g / 5½ oz de harina de auto crianza", "200 ml / 7 fl oz de agua fría y brillante", "sal y pimienta negra recién molida", "300ml / 10½fl oz de aceite vegetal, para freír", "½ pechuga de pollo, sin piel, en rodajas finas", "1 calabacín, cortado en bastones", "200ml / 7fl oz pasados", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de azúcar en polvo", "1 cucharada de jugo de lima", "pequeño puñado de albahaca fresca, picada", "sal y pimienta negra recién molida"], "method": ["Para la tempura, coloque los cubitos de hielo y la harina en un tazón grande y luego bata suavemente en suficiente agua para hacer una masa espesa con la consistencia de crema doble. (Puede que no necesite toda el agua.) Sazone con sal y pimienta negra recién molida.", "Vierta el aceite vegetal en una cacerola grande o freidora y caliente hasta que un pequeño cubo de pan caiga en chisporroteos y se vuelva dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los trozos de pollo y los bastones de calabacín en la mezcla, luego cuidadosamente baje el aceite caliente en pequeños lotes. Freír a fuego lento durante 3-4 minutos, o hasta que estén doradas y el pollo esté bien cocido. Retire con una espumadera y escurra sobre papel de cocina.", "Para la inmersión, coloque todos los ingredientes de inmersión en una olla pequeña y cocine a fuego lento durante 4-5 minutos, revolviendo ocasionalmente, o hasta que espese un poco. Vierta en un tazón pequeño para mojar.", "Para servir, amontone la tempura en un plato para servir y sirva con salsa de chile de tomate en un lado."], "url": "www_bbc_co_uk_food_recipes_tempurachickenandcou_89136", "title": "Pollo Tempura y calabacines con salsa de chile de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina normal de 25g / 1oz", "25g / 1 oz de harina de maíz", "azúcar pizca", "75-110ml / 3-4fl oz de agua con gas", "4 plátanos, pelados y divididos a lo largo", "200 g / 7 oz de chocolate negro, toscamente picados", "Chocolate blanco de 400g / 14oz, más o menos picado", "570ml / 1 pinta de crema doble", "4 cucharadas de avellanas, sin cáscara, finamente picadas", "4 cucharadas de Space Dust o confitería similar"], "method": ["Para los plátanos tempura, vierta suficiente aceite vegetal para llegar a dos tercios de los lados de una sartén profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina, la harina de maíz y el azúcar en un bol y bata suavemente con suficiente agua con gas para hacer una masa espesa, no importa si no es completamente suave.", "Sumerja los plátanos en la mezcla para cubrir completamente, sacudiendo cualquier exceso, luego coloque en el aceite caliente. Freír los plátanos hasta que estén dorados y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Para la mousse, coloque el chocolate negro y el chocolate blanco en recipientes separados a prueba de calor colocados sobre recipientes con agua y calor a fuego lento, revolviendo ocasionalmente, hasta que estén suaves y derretidos.", "Mientras tanto, batir ligeramente la crema hasta que se formen picos suaves cuando se quite la batidora.", "Doble suavemente dos tercios de la crema en el chocolate negro derretido hasta que estén bien combinados, luego coloque la cuchara en una manga pastelera y déjelo a un lado.", "Repita con la crema restante y el chocolate blanco y la cuchara en otra manga pastelera.", "Coloque cuatro anillos de chefs de 5 cm en un plato grande forrado con papel resistente a la grasa. Pase una capa de la mezcla de chocolate negro, seguido de la mezcla de chocolate blanco en cada anillo. Repita hasta que los anillos estén llenos, luego alise las partes superiores con una espátula. Coloque en la nevera para establecer durante 1-2 horas.", "Para servir, retire las mousses del refrigerador y retire el papel resistente a la grasa. Presione la base de cada anillo en las avellanas picadas para cubrir, luego coloque en platos de servir. Levante con cuidado los anillos de los chefs y coloque dos pedazos de plátano en cada plato. Espolvorea el polvo espacial sobre la parte superior de cada mousse."], "url": "www_bbc_co_uk_food_recipes_tempurabananaswithwh_86294", "title": "Plátanos Tempura con mousse de chocolate blanco y negro y Space Dust", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina común 115g / 4oz", "125ml / 4fl oz de cerveza", "4 cubitos de hielo", "4 langostinos, cáscaras retiradas, desvendadas", "½ mango, finamente picado", "½ pimiento rojo, finamente picado", "4 cebolletas, finamente picadas", "1 lima, solo jugo", "1 cucharadita de azúcar en polvo", "½ cucharadita de copos de chile", "2 cucharadas de menta fresca picada", "2 cucharadas de cilantro fresco picado", "cilantro fresco picado", "rodajas de limón"], "method": ["Para las gambas tempura, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina y la cerveza en un bol y bata bien hasta que la mezcla tenga la consistencia de una crema individual, agregando más o menos cerveza según sea necesario. Agregue los cubitos de hielo y mezcle bien.", "Sumerja las gambas en la mezcla y luego colóquelas cuidadosamente en el aceite caliente. Freír hasta que estén dorados y cocidos. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa de mango, coloque todos los ingredientes de la salsa en un tazón y mezcle bien.", "Sirva las gambas en un plato con un tazón de salsa de mango al lado. Adorne con cilantro fresco y rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_tempuraprawnswithman_88647", "title": "Langostinos tempura con salsa de mango, pimiento y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates secados al sol en aceite", "2 dientes de ajo, aplastados", "3 x 400 g de tomates cortados en lata", "500ml / 18fl oz de caldo de pollo o vegetal", "1 cucharada de azúcar en polvo", "150ml / 5fl oz de leche entera", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "3-4 cucharaditas de pesto de albahaca, para servir"], "method": ["Coloque una sartén grande y profunda a fuego medio y agregue 1 cucharada de aceite de los tomates secados al sol. Agregue el ajo y saltee por unos segundos, o hasta que comience a colorear.", "Agregue los tomates secados al sol y enlatados, el caldo y el azúcar y deje que hierva, revolviendo constantemente. Sazone con sal y pimienta negra recién molida, luego cubra con una tapa, reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Retire del fuego y, usando una batidora, mezcle la sopa en la sartén. Agregue la leche y la crema y sazone con sal y pimienta negra recién molida antes de calentar en la placa.", "Sirva caliente con ½ cucharadita de pesto de albahaca arremolinado en la parte superior de cada plato de sopa."], "url": "www_bbc_co_uk_food_recipes_ten-minute_tomato_soup_10252", "title": "Sopa de tomate de diez minutos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ten-minute_tomato_soup_10252_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 chiles verdes suaves o picantes", "3 cucharadas de tequila de plata", "1 cucharada de crema doble", "350g / 12oz de chocolate blanco, picado", "½ lima, ralladura y un chorrito de jugo solamente", "25 g / 1 oz de mantequilla sin sal, picada", "1 cucharadita de sal marina en copos"], "method": ["Corta una hendidura longitudinalmente por la mitad de cada guindilla y quita cuidadosamente las semillas. (Es posible que desee usar guantes de goma para esto).", "Coloque los chiles en un recipiente sellable y agregue dos cucharadas de tequila. Déjalo en remojo durante 48 horas. El remojo quita el aguijón de los chiles.", "Caliente 5cm / 2in de agua en una sartén. Coloque un recipiente resistente al calor sobre la bandeja, asegurándose de que el fondo del recipiente no toque el agua. Coloque la crema y 50g / 1¾oz de chocolate blanco en el tazón. Coloque sobre un calor suave para permitir que el chocolate se derrita.", "Retire el recipiente del fuego y agregue la cucharada restante de tequila, la ralladura de limón, el jugo y la mantequilla. Batir todo hasta que se convierta en un ganache suave, verter en un recipiente sellable, luego enfriar durante la noche para establecer.", "Cuando esté listo para llenar los chiles, tome una cucharilla y recoja aproximadamente media cucharadita de ganache y póngalo en los chiles. Póngalos en la nevera para enfriar.", "Para atemperar el chocolate blanco restante, coloque el chocolate en un recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que la base del recipiente no toque el agua o el chocolate se quemará. Tenga cuidado también de no dejar que entre agua en el chocolate o el chocolate se apoderará. Con un termómetro de chocolate, suba a 42 ° C / 107 ° F, luego retire el recipiente del fuego y déjelo enfriar a 27 ° C / 81 ° F.", "Sumerja cada chile en el chocolate para cubrir, luego espolvoree cada uno con un poco de sal marina. Déjelos a un costado en una bandeja para hornear cubierta con un pergamino para hornear, y déjelos en la nevera para prepararlos. Servirlos enteros o cortados en rodajas."], "url": "www_bbc_co_uk_food_recipes_tequila_chillies_40712", "title": "Chiles tequila", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Rinde 8 chiles rellenos de chocolate", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tequila_chillies_40712_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 ml / 2 fl oz de tequila", "jugo de naranja fresco, para recargar", "1 cucharada de granadina", "rodaja de naranja", "1 cereza al marrasquino"], "method": ["Vierta el tequila en un vaso alto lleno de hielo y reponga con jugo de naranja fresco. Vierta la granadina en el lado del vidrio para que se hunda hasta el fondo.", "Para servir, decorar con una rodaja de naranja y una cereza marrasquino."], "url": "www_bbc_co_uk_food_recipes_tequilasunrise_86526", "title": "Amanecer tequila", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]