[{"ingredients": ["4 cucharadas de aceite de oliva", "½ pechuga de pollo, sin piel, cortada en tiras", "½ cebolla roja, cortada en rodajas finas", "2 cucharadas de miel clara", "1 cucharada de mostaza Dijon", "Hojas de cohete fresco de 85 g / 3½ oz.", "vinagre balsámico, para lloviznar"], "method": ["Calentar dos cucharadas de aceite de oliva en una sartén. Freír el pollo durante 5-6 minutos, hasta que esté dorado y cocido, y luego transferirlo a un plato.", "Freír la cebolla en la sartén hasta que esté suave.", "Mezcle la miel y la mostaza en un tazón grande. Agregue el cohete al tazón junto con el pollo y la cebolla. Mezcle y rocíe con un poco de vinagre balsámico.", "Coloque en un plato grande y sirva."], "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_87339", "title": "Ensalada de pollo con miel y mostaza glaseada con aceite de oliva y aderezo balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 150 g / 5½ oz, cortado en tiras de 1cm / ¼ in", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "palillos de madera", "1 cucharada de miel clara", "2 cucharaditas de semillas de sésamo", "1 achicoria de cabeza, reducido a la mitad", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "ramita perifollo fresco, para adornar"], "method": ["Para los pinchos de carne, coloque el bistec en un tazón pequeño, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Pase las tiras de carne en los pinchos.", "Caliente una sartén antiadherente y fríe las tiras de carne durante dos minutos.", "Rocíe la miel y espolvoree las semillas de sésamo sobre los pinchos y fría por otros dos minutos hasta que estén glaseadas y cocidas.", "Para la achicoria glaseada, caliente una sartén hasta que esté caliente. Rocíe las mitades de achicoria con el aceite de oliva y coloque, con el lado del corte hacia abajo, en la sartén durante dos minutos por cada lado.", "Agregue el vinagre balsámico a la sartén y cocine por otros dos minutos por cada lado, o hasta que se marchite.", "Para servir, coloque la achicoria junto a los pinchos de carne en un plato de servir y adorne con el perifollo."], "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefsk_87036", "title": "Pinchos de miel y sésamo con achicoria vidriada balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de filete 150 g / 5½ oz cortado en trozos", "2 cucharadas de semillas de sésamo", "1 lima, jugo y ralladura solamente", "2 dientes de ajo, finamente picados", "2 cucharadas de miel", "½ chili Scotch Bonnet amarillo, finamente cortado", "1 cucharada de aceite vegetal", "85g / 3oz de fideos de arroz, cocidos", "1 lima, jugo y ralladura solamente", "2 cucharadas de salsa de soja", "2 cucharadas de menta fresca picada", "2 cucharadas de cilantro fresco picado", "4 lanzas de espárragos", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la miel y la carne de sésamo, coloque todos los ingredientes, excepto el aceite, en un recipiente y revuelva bien para cubrir la carne. Déjelo marinar durante 5-10 minutos, o más si es posible.", "Calentar el aceite vegetal en un wok o sartén y sofreír la carne marinada durante 3-4 minutos, o hasta que esté bien cocida.", "Para la ensalada de fideos, cocinar los fideos de arroz de acuerdo con las instrucciones del paquete y refrescar con agua fría. Escurrir, luego colocar en un recipiente. Agregue los ingredientes restantes de la ensalada al recipiente y revuelva bien.", "Para los espárragos asados, coloque los espárragos en una bandeja para hornear, rocíe sobre el aceite y sazone, al gusto, con sal y pimienta negra recién molida. Coloque en el horno y tueste durante 8-10 minutos, hasta que esté ligeramente chamuscado y tierno.", "Para servir, coloca los fideos en el centro de un plato para servir y coloca la carne en la parte superior. Adorne con las espárragos asados."], "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefwi_88638", "title": "Miel y carne de sésamo con ensalada de fideos de cilantro, menta y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo, despellejada y cortada en cubos de 1 in", "sal y pimienta negra recién molida", "1 cucharada de miel", "1½ cucharadas de semillas de sésamo", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "½ calabaza, hervida por 5 minutos y escurrida", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "3 cebolletas, finamente picadas", "125g / 4½oz de col rizada, picado", "3 cucharadas de vino blanco", "1 cucharada de hojuelas de chile seco", "sal y pimienta negra recién molida"], "method": ["Para hacer los pinchos de pollo, condimente los trozos de pollo con sal y pimienta recién molida. Pase las piezas de pollo en dos o tres pinchos. Rocíe con miel, espolvoree semillas de sésamo y finalmente rocíe con aceite de oliva.", "Caliente una sartén hasta que esté caliente y agregue los pinchos de pollo. Cocine por 4-5 minutos, volteando con frecuencia hasta que estén doradas por todos lados y el pollo esté bien cocido.", "Para hacer la calabaza a la plancha, corte la calabaza en cubos, cepille la calabaza con aceite de oliva y sazone bien con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y cocínela durante 3 minutos por cada lado, hasta que esté tierna.", "Para hacer la col rizada picante, caliente el aceite de oliva en una sartén y agregue las cebolletas. Cocine suavemente hasta que se suavice un poco, agregue la col rizada y cocine por otro minuto, revolviendo con frecuencia.", "Agregue el vino blanco, los copos de chile, la sal y la pimienta negra recién molida y deje cocer durante cinco minutos o hasta que todo el líquido haya sido absorbido.", "Para servir, coloque una gran pila de col rizada picante en un plato grande, cubra con los pinchos de pollo y coloque la calabaza a la sartén a un lado."], "url": "www_bbc_co_uk_food_recipes_honeyandsesamechicke_82108", "title": "Pinchos de miel y sésamo con calabaza a la plancha y col rizada picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de queso Wensleydale rallado", "2 cucharadas de salsa de soja", "2 cucharadas de miel clara", "300g / 10½oz Quorn 'chicken' pieces", "dash aceite de oliva", "½ pimiento amarillo, en rodajas", "1 tomate, picado", "pequeña espinaca", "sal y pimienta negra recién molida"], "method": ["Para el queso crujiente, espolvoree el queso rallado en una sartén pequeña antiadherente y fría hasta que se derrita y se ponga ligeramente crujiente. Retire con cuidado de la sartén y moldee alrededor de un rodillo para crear una forma curvada. Deja enfriar.", "Para el Quorn, coloque la salsa de soja, la miel y Quorn en un tazón pequeño, revuelva bien y deje macerar durante diez minutos. Drene, reservando el líquido de marinado.", "Calentar el aceite de oliva en un wok y freír el Quorn durante 2-3 minutos, o hasta que se dore. Agregue la pimienta y el tomate y cocine por 2-3 minutos, luego agregue el líquido de marinar y las espinacas. Sazonar, al gusto, con sal y pimienta negra recién molida. Cocine por otros 1-2 minutos, luego ponga la cuchara en un tazón para servir.", "Para servir, cubra el Quorn glaseado con el crujiente cursi."], "url": "www_bbc_co_uk_food_recipes_honeyandsoyglazedquo_88852", "title": "Quorn esmaltado con miel y soja con espinacas y pimientos y queso crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de solomillo de cerdo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 diente de ajo, ligeramente triturado", "1 cucharada de salsa de soja", "1 cucharada de miel", "85g / 3oz anacardos, aplastados", "300ml / 10fl oz de aceite vegetal, para freír", "¼ repollo savoy, muy finamente cortado", "½ piña, pelada y muy finamente cortada", "1 naranja, cortada en cuñas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la miel y el cerdo asado con soya, sazone la carne de cerdo con sal y pimienta negra recién molida. Caliente el aceite en una sartén a prueba de horno, agregue el cerdo y el ajo y fría el cerdo, volteándolo con frecuencia, hasta que se dore por todos lados. Transfiera la sartén al horno y cocine la carne de cerdo durante cinco minutos, o hasta que esté casi cocida.", "Retire la sartén del horno y vuelva a colocarla sobre el fuego. Agregue la salsa de soja y la miel a la sartén y fría por un minuto. Retire la carne de cerdo de la sartén y enrolle los anacardos triturados para cubrir por todos lados. Regrese a la sartén y fría por un minuto en cada lado, luego déjelo a un lado para que descanse en un lugar cálido.", "Para obtener el repollo crujiente, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque con cuidado el repollo en rodajas en el aceite y fríalo durante 2-3 minutos, o hasta que esté dorado y crujiente. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, coloque las rodajas de piña en un plato de servir. Corta el cerdo y colócalo encima del \"carpaccio\" de piña. Cubra con repollo crujiente y decore con trozos de naranja."], "url": "www_bbc_co_uk_food_recipes_honeyandsoyroastedpo_85573", "title": "Miel y cerdo asado con corteza de nuez de anacardo en carpaccio de piña y col crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de crema doble", "25g / 1oz de nueces picadas", "3 cucharadas de miel clara", "450 g / 1 libra de hojaldre hecho", "50g / 2oz de mantequilla derretida", "Gelatina de membrillo de 110 g / 4 oz", "6 manzanas deliciosas doradas, peladas, sin corazón y cortadas en rodajas finas", "25 g / 1 oz de azúcar en polvo", "4 ramitas de menta, para adornar"], "method": ["En un tazón grande, batir la crema con un batidor eléctrico hasta que espese. Dobla las nueces y la miel, y colócalas en la nevera.", "Precalentar el horno a 200C / 400F / Gas 6.", "Estirar la masa de hojaldre finamente y pinchar la superficie con un tenedor.", "Recorta cuatro rectángulos del tamaño de 10 cm / 4 pulgadas por 20 cm / 8 pulgadas.", "Coloque los rectángulos en una bandeja para hornear engrasada antiadherente.", "Ligeramente cepille los bordes de las tartas con un poco de la mantequilla derretida y esparza la jalea de membrillo en el medio.", "Capa en las rodajas de manzana.", "Rocíe la parte superior con la mayor parte de la mantequilla derretida restante y espolvoree con el azúcar.", "Coloque en el horno durante 5-6 minutos hasta que estén doradas.", "Retire las rebanadas del horno y glasee con un poco de la mantequilla restante.", "Coloque en los platos y sirva con una cucharada de miel y crema de nuez."], "url": "www_bbc_co_uk_food_recipes_honeyandwalnutcreamw_83885", "title": "Crema de miel y nuez con manzana y rodaja de membrillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Avena de avena 150 g / 5½ oz", "3 cucharadas de crema doble, más extra para servir", "Leche 250ml / 9fl oz", "1 cucharada de azúcar morena suave", "dash whisky", "1 cucharada de miel clara, para servir"], "method": ["Coloque la avena, crema, leche, azúcar y whisky en una olla pequeña y cocine a fuego lento durante 6-7 minutos, hasta que espese y suavice.", "Para servir, vierta la papilla en un bol y rocíe con miel y crema."], "url": "www_bbc_co_uk_food_recipes_honeyandwhiskyporrid_85195", "title": "Gachas de miel y whisky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo deshuesadas y sin piel", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cucharadas de mantequilla", "1 plátano, pelado y rebanado longitudinalmente", "1 cucharada de canela molida", "40 g / 1½ oz hoi sin salsa de un tarro", "110 g / 4 oz de tallo de ajos silvestres o cebolletas al ajo, escaldado durante 15 segundos y luego refrescado", "20 g / oz de miel"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazone la pechuga de pollo con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno hasta que esté caliente, luego agregue el aceite de oliva y la mitad de la mantequilla.", "Cuando la mantequilla esté espumante, agregue el pollo y fría, volteándolo una vez, hasta que se dore por ambos lados.", "Transfiera al horno para asar durante 10-12 minutos, o hasta que esté completamente cocido. Retire del horno y deje reposar en un lugar cálido durante cinco minutos.", "Para el plátano, caliente una sartén hasta que esté caliente, luego agregue la mantequilla restante.", "Espolvoree el plátano con canela y póngalo en la sartén para freír durante 1-2 minutos por cada lado, hasta que esté dorado y tierno.", "Para servir, coloque el tallo de ajo marchito en un lado del plato. Coloque el plátano en el centro del plato. Rocíe con hoi sin salsa.", "Corta el pollo en tres trozos en diagonal y colócalo sobre el plátano. Termine rociando la miel sobre el pollo."], "url": "www_bbc_co_uk_food_recipes_honeybakedchickenwit_83880", "title": "Pollo al horno de miel con plátano hoisin y tallos de ajo marchitos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de hojas secas de tomillo", "2 cucharaditas de orégano seco", "zumaque de tierra pizca (disponible en tiendas de Oriente Medio)", "½ cucharadita de semillas de sésamo tostadas", "pizca de escamas de chile rojo", "Una pizca de sal marina", "1 cucharadita de comino molido", "2 cucharadas de jengibre fresco de raíz finamente rallado", "3 cucharadas de miel clara", "Solomillo de cordero de primavera 4 x 125 g / 4½ oz, recortado", "4 cucharadas de mantequilla", "Salsifí 300g / 11oz, pelado y picado (mantener en un tazón de agua acidulada para evitar el pardeamiento)", "110 ml / 4 fl oz de agua", "200ml / 7fl de leche en oz", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "2 cucharadas de crema doble de espesor", "1 cucharada de aceite de oliva", "4-5 cucharadas de hojas de ajo silvestre, picadas"], "method": ["Para el za'atar, mezcle todos los ingredientes za'atar en un tazón pequeño hasta que estén bien combinados.", "Para el cordero, agregue el comino, el jengibre y la miel a la mezcla de za'atar y mezcle hasta que esté bien combinado. Frote la mezcla por todo el lomo de cordero.", "Calentar la mantequilla en una sartén a fuego medio. Agregue el cordero y fría por 6-8 minutos en cada lado (para el medio), o hasta que esté cocido a su gusto. Retire el cordero de la sartén y déjelo a un lado para descansar sobre un plato caliente. Reserve cualquier zumo de cocina que quede en la sartén.", "Para el puré de salsifí y ajo silvestre, escurra el salsifí y coloque en una sartén. Verter sobre el agua y la leche y sazonar con sal y pimienta negra recién molida. Llevar a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine durante 20 minutos, o hasta que el salsifí esté tierno. Escurra, luego coloque el salsifí en un procesador de alimentos con la mantequilla y la crema y mezcle hasta que quede suave.", "Calentar el aceite en una sartén hasta que esté humeante, agregar las hojas de ajo silvestre y freír durante 1-2 minutos, o hasta que se marchite. Revuelva el ajo silvestre en el puré de salsifí y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, espolvoree el puré de salsifí y ajo silvestre en cuatro platos para servir. Corte el cordero en rodajas gruesas y acomódelo junto con el puré, rociándolo sobre algunos de los zumos reservados."], "url": "www_bbc_co_uk_food_recipes_honeyandzaatarglazed_91314", "title": "Miel y zapallo de cordero glaseado con salsifí y puré de ajo silvestre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 higos frescos, tallos eliminados", "2 cucharadas de vinagre balsámico", "1 cucharada de miel clara", "2 cucharaditas de hojas de tomillo fresco picado", "sal y pimienta negra recién molida", "Queso manchego 30 g / 1 oz, rallado"], "method": ["Con un cuchillo afilado, corte una cruz en la parte superior de cada higo. Presione la flecha hacia abajo en una tabla de cortar para abrirla ligeramente, luego colóquela en un cuadrado de 25 x 25 cm / 10 x 10 pulgadas. Cuchara sobre el vinagre, la miel y el tomillo y sazone con sal y pimienta negra recién molida. Dobla la lámina para hacer un paquete y sellar los bordes.", "Coloque el paquete en una sartén pequeña a fuego medio y cocine por 8-10 o hasta que los higos se ablanden. Abra el paquete y espolvoree con el queso para servir."], "url": "www_bbc_co_uk_food_recipes_honeybakedfigswithma_87282", "title": "Higos horneados con miel y queso manchego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["170g / 6oz de miel clara", "140g / 5oz de mantequilla", "85g / 3oz de azúcar mascabado ligero", "2 huevos, golpeados", "200 g / 7 oz de harina de crianza, tamizada", "agua", "55g / 2oz de azúcar glasé", "1 cucharada de miel clara", "agua caliente"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 3 y unte mantequilla y forme la parte inferior de una lata para pasteles de 7 pulgadas / 18 cm.", "Mida la miel, la mantequilla y el azúcar en una sartén grande. Agregue una cucharada de agua y caliente suavemente hasta que se derrita.", "Retirar del fuego y mezclar los huevos y la harina.", "Con una cuchara, lade la torta y hornee por 40-45 minutos hasta que la torta esté elástica al tacto y se encoja ligeramente desde los lados de la lata.", "Enfriar ligeramente en la lata antes de girar sobre una rejilla de alambre.", "Mientras la torta esté todavía tibia, prepare la guinda mezclando el azúcar y la miel con 2-3 cucharaditas de agua caliente. Trickle sobre el pastel en cualquier diseño que te apetezca."], "url": "www_bbc_co_uk_food_recipes_honeycake_67599", "title": "Pastel de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycake_67599_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 dedos de esponja ya hechos", "50 g / 2 oz de yogur griego", "100g / 3½ oz de mascarpone", "2 cucharadas de miel líquida"], "method": ["Alinee la base de un anillo de metal de tamaño medio con los dedos de la esponja cortados a la medida.", "En un tazón, mezcle el yogur griego con el mascarpone y la miel.", "Coloque esta mezcla sobre los dedos de la esponja y alise con una espátula o cuchara.", "Usando un soplete para calentar los lados, libere la tarta de queso del molde. Servir."], "url": "www_bbc_co_uk_food_recipes_honeycheesecake_80809", "title": "Tarta de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo sin piel, cortada en trozos", "1 calabacín, cortado en trozos", "1 cucharada de aceite de oliva", "1 cucharada de miel clara", "sal y pimienta negra recién molida", "puñado de hojas frescas de perejil de flatleaf", "dash vinagre balsámico"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Caliente una sartén a prueba de horno hasta que esté muy caliente. Remoje dos brochetas de bambú en agua durante unos minutos.", "Pase el pollo y el calabacín por los pinchos de bambú. Cepille la bandeja de la plancha con un poco de aceite y coloque los pinchos de pollo en la sartén.", "Rocíe sobre la mayor parte del aceite restante. Sazonar bien con sal y pimienta negra recién molida y la plancha durante unos minutos, volteando con frecuencia hasta que esté ligeramente carbonizado por todas partes.", "Rocíe la miel sobre los pinchos y transfiera al horno durante 6-8 minutos, o hasta que los pinchos de pollo estén cocidos y ligeramente caramelizados.", "Coloque las hojas de perejil en un recipiente y rocíe con el aceite restante y el vinagre balsámico.", "Para servir, coloque los pinchos de pollo en un plato calentado y esparza sobre las hierbas vestidas."], "url": "www_bbc_co_uk_food_recipes_honeychickenskewers_87807", "title": "Pinchos de pollo con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal, para engrasar bandeja de horno", "80g / 3oz de mantequilla", "160 g / 5½ oz de azúcar en polvo", "Jarabe dorado de 80g / 3oz", "2 cucharaditas de bicarbonato de soda"], "method": ["Engrase una lata para hornear cuadrada de 20 cm / 8 pulgadas con aceite vegetal.", "Calienta suavemente la mantequilla, el azúcar y el jarabe dorado en una sartén grande de base pesada hasta que el azúcar se haya disuelto. Suba el fuego y hierva rápidamente, sin remover. Si la mezcla se oscurece en un lado de la mezcla, agite suavemente la sartén para mezclarla. Mantenga la ebullición hasta que la mezcla tome un color marrón dorado, esto tomará aproximadamente 5 minutos.", "Agregue el bicarbonato de soda y revuelva durante unos segundos, lo que hará que la mezcla se expanda y burbujee (tenga cuidado, la mezcla se expandirá mucho). Incline el panal en la bandeja de horno engrasada y deje hasta que esté frío y listo.", "Para servir, corte el panal en pedazos y revuelva en helados o decore los postres. Puedes poner el panal en un procesador de alimentos y espolvorearlo sobre los postres."], "url": "www_bbc_co_uk_food_recipes_honeycomb_80005", "title": "Panal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_80005_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de azúcar en polvo", "50ml / 2fl oz de miel clara", "1 cucharada de glucosa líquida", "¾ cucharadita de bicarbonato de soda", "aceite, para engrasar", "300 g / 11 oz de chocolate negro, más o menos picados", "3 huevos de gallinas camperas, separados", "150 g / 5½ oz de azúcar en polvo", "Crema doble 450ml / 16fl oz", "2 vainas de vainilla, sin semillas"], "method": ["Para el panal, forrar una bandeja para hornear con un poco de aceite y pergamino para hornear.", "Coloque el azúcar, la miel, la glucosa y 50 ml / 2 fl oz en una cacerola y deje hervir. Continúe cocinando hasta que la temperatura alcance 160C / 320F en un termómetro de azúcar.", "Retirar del fuego y rápidamente batir en el bicarbonato de soda, revolviendo constantemente. Vierta la mezcla en la bandeja de horno forrada.", "Dejar de lado hasta que esté completamente frío y luego romper en trozos grandes.", "Derrita el chocolate en un recipiente suspendido sobre una fuente de agua hirviendo (no permita que el fondo del recipiente toque el agua) ni en el microondas.", "Cubra una bandeja para hornear con papel resistente a la grasa.", "Sumerja cada pedazo de panal en el chocolate derretido y luego colóquelo en la bandeja revestida. Deja durante una hora hasta que el chocolate esté firme y duro.", "Para el parfait, engrase una lata de pan con un poco de aceite vegetal y luego forre con dos capas de película adhesiva.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor. Poco a poco mezcle con la mitad del azúcar y continúe batiendo hasta que se formen picos firmes.", "Batir las yemas de huevo y el azúcar restante en un recipiente sobre una olla de agua a fuego lento durante unos 5-6 minutos, o hasta que la mezcla se espese.", "Coloque la crema y las semillas de vainilla raspadas en un recipiente aparte y bata hasta que se formen picos suaves cuando retire el batidor del recipiente.", "Doble suavemente el merengue, las yemas de huevo y la crema en un bol suavemente hasta que se mezclen.", "Cortar aproximadamente el panal de chocolate y luego doblar en la mezcla, asegurándose de que se distribuye de manera uniforme.", "Vierta la mezcla en la lata de pan revestida y colóquela en el congelador durante al menos durante horas, o hasta que esté firme.", "Para servir, quite el parfait del congelador y déjelo durante una hora para ablandarlo un poco antes de cortarlo y servirlo."], "url": "www_bbc_co_uk_food_recipes_honeycomb_parfait_95221", "title": "Perfecto panal", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de bicarbonato de soda", "75 g / 2½ oz de azúcar en polvo", "2 cucharadas de jarabe de oro", "aceite sin sabor (como aceite vegetal), para engrasar", "250 g / 9 oz oscuro o chocolate con leche, o una mezcla", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos de 1 cm", "2 cucharadas de jarabe de oro", "Galletas digestivas 150 g / 5½ oz"], "method": ["Haz el panal primero. Haga que se mida el bicarbonato de soda y esté listo para cuando lo necesite, además de un batidor de alambre y una bandeja de horno engrasada. Ponga el azúcar y el sirope dorado en una olla y colóquelo a fuego muy bajo. Calentar suavemente durante 10 minutos hasta que todo el azúcar se haya derretido, revolviendo ocasionalmente con la cuchara de madera.", "Cuando el azúcar esté completamente derretido, suba el fuego a medio. Una vez que la mezcla ha comenzado a hervir, deje que burbujee sin remover hasta que se ponga dorado.", "Apague el fuego debajo de la sartén. Cúbrase una de sus manos con una toalla de té seca o un guante de horno para protegerse, luego tome la manija de la bandeja. Agregue el bicarbonato de soda y agítelo rápidamente por solo un par de segundos. La mezcla se esponjará masivamente y debe tener mucho cuidado ya que es extremadamente caliente.", "Viértala rápidamente en el medio de la bandeja de horno engrasada. No lo extienda ni lo toque ni a la bandeja. Déjalo enfriar y endurecer, lo que tomará aproximadamente 30 minutos. Alinee una lata cuadrada de 20.5cm / 8in con papel de hornear.", "Use un rodillo para romper o golpear el chocolate en pedazos pequeños. Póngalos en un recipiente resistente al calor y agregue la mantequilla y el jarabe dorado. Derrita suavemente, sobre una olla de agua caliente, revolviéndolo de vez en cuando. Cuando la mezcla de chocolate esté suave, levante con cuidado el recipiente de la sartén y colóquelo en una superficie resistente al calor.", "Coloque los bizcochos en una bolsa plástica para alimentos y use el rodillo para dividirlos en pedazos del tamaño de su miniatura. Coloca el panal en trozos más o menos del mismo tamaño. Agregue los bizcochos y el panal al chocolate derretido y mezcle bien para que todos los trozos estén cubiertos.", "Recoge todo el lote en la lata forrada y extiéndelo de manera uniforme, justo en las esquinas. Cubra con película adhesiva, luego enfríe en la nevera durante aproximadamente dos horas, o hasta que esté firme y listo. Cortar en 16 cuadrados con un cuchillo afilado. Tienda, bien tapada, en la nevera y comer dentro de dos días."], "url": "www_bbc_co_uk_food_recipes_honeycomb_crunchies_45484", "title": "Crujientes de panal", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12-16 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_crunchies_45484_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 140g / 5oz", "algunas gotas de esencia de vainilla", "2 cucharadas de azúcar en polvo", "110g / 4oz de queso crema", "Toffee de ceniza 55g / 2oz (también llamado nido de abeja), roto en pedazos"], "method": ["Batir la crema con la esencia de vainilla y el azúcar en un tazón grande, para espesar.", "Dobla el queso crema para combinar, y luego agrega el toffee de ceniza.", "Con una cuchara, coloque la mezcla en un anillo de chefs, alinee en un plato para servir y alise la parte superior con una espátula.", "Transfiera al refrigerador, y permita establecerlo.", "Una vez que esté frío, retírelo de la nevera y quítelo. Servir."], "url": "www_bbc_co_uk_food_recipes_honeycombcheesecake_76812", "title": "Tarta de queso de panal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de crema doble", "100g / 3½oz de queso crema", "gota de esencia de vainilla", "2 cucharadas de azúcar en polvo", "Toffee de ceniza 55g / 2oz (también llamado nido de abeja), aplastado", "¼ de mango, pelado y cortado en cubitos", "Toffee de ceniza 30g / 1oz (también llamado nido de abeja), aplastado y tostado"], "method": ["Ligeramente batir la crema en un tazón grande, para espesar. Agregue el queso crema con esencia de vainilla y azúcar.", "Cuidadosamente dobla el panal y el mango.", "Vierta la mezcla en dos cuencos o vasos.", "Espolvorea el panal tostado, para servir."], "url": "www_bbc_co_uk_food_recipes_honeycombfool_76811", "title": "Nido de panal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechos de pato", "2 cucharaditas de miel", "sal y pimienta negra recién molida"], "method": ["Precalentar una sartén lo suficientemente grande como para freír los pechos de pato uno al lado del otro.", "Agregue la miel y permita que burbujee suavemente.", "Sazonar ambos lados de la pechuga de pato. Coloque en la sartén con la piel hacia abajo y cocine suavemente hasta que esté crujiente.", "Precalentar el horno 180C / 350F / Gas 4.", "Coloque las pechugas de pato en una fuente para hornear, con la piel hacia arriba. Hornee por 8-10 minutos (más si lo quiere bien hecho).", "Retirar del horno y dejar reposar durante unos minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_honeyedcrispyduck_67600", "title": "Pato crujiente de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]