[{"ingredients": ["125g / 4oz de mantequilla sin sal ablandada", "125g / 4oz de azúcar en polvo", "2 huevos de gallinas camperas", "125g / 4oz de harina de auto crianza", "Frambuesas 150g / 5oz", "6 maracuyá, solo pulpa tamizada", "un poco de leche, para aflojar la mezcla según sea necesario", "500g / 1lb 1½ oz de azúcar glas", "160g / 5½oz de mantequilla", "1 vaina de vainilla, solo semillas", "2-3 gotas de colorante líquido rosa", "50ml / 1¾oz de leche", "cientos y miles"], "method": ["Para las tortas, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque 12 cajas de papel en una bandeja para muffins.", "Batir la mantequilla y el azúcar en un bol hasta que estén pálidos y cremosos. Agregue los huevos, uno a la vez, y bata hasta que estén bien combinados.", "Dobla la harina, las frambuesas y la pulpa de la fruta de la pasión en la mezcla hasta que esté casi lisa. Si la mezcla se ve muy rígida, agregue un poco de leche, según sea necesario.", "Divida la mezcla entre las cajas de papel y hornee durante 20 minutos. Retire del horno y deje enfriar en la lata durante 10 minutos. Coloque las tortas en una rejilla de alambre y déjelas a un lado hasta que estén completamente frías.", "Para la formación de hielo, con un batidor eléctrico, unte el azúcar glas y la mantequilla hasta que estén suaves y esponjosos. Agregue las semillas de vainilla y el colorante para alimentos. Poco a poco agregue suficiente leche para formar una pasta suave.", "Coloca el glaseado en una manga pastelera con una gran boquilla en forma de estrella y coloca la guinda sobre el pastel. Espolvorea cientos y miles."], "url": "www_bbc_co_uk_food_recipes_valentinecupcake_93564", "title": "Cupcakes de San Valentín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/valentinecupcake_93564_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Base de esponja de 25 cm / 10 pulg. De diámetro (cortada de una gran caja de flan comprado)", "200 g / 7 oz de azúcar en polvo", "3 limones, ralladura fina solamente", "4 cucharadas de harina de maíz", "3 cucharadas de sultanas, empapado en un poco de bourbon", "850g / 1lb 14oz de queso crema con mucha grasa", "3 huevos medianos de granja", "1½ cucharadita de esencia de vainilla", "1 vaina de vainilla, cortada longitudinalmente, sin semillas", "whisky o bourbon, al gusto (opcional)", "375ml / 13fl oz crema", "10 plátanos pequeños", "25g / 1oz de mantequilla", "2 cucharadas de azúcar", "Crema doble 500ml / 18fl oz", "175g / 6oz de mantequilla sin sal", "175g / 6oz demerara azúcar", "1 cucharada de jarabe de oro", "1 cucharada de melaza negra", "175g / 6oz de chocolate puro, roto en pedazos", "50 g / 1 oz de azúcar en polvo", "ramitas de menta fresca"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Unte con mantequilla una lata de torta suelta de 25 cm / 10 pulgadas.", "Corta la esponja horizontalmente en 2 discos. Use 1 disco para alinear la lata de torta preparada.", "En un tazón mezcle el azúcar, la ralladura de limón, la harina de maíz y las pasas sultanas con una cuchara de madera, luego bata en el queso crema. Agregue los huevos uno por uno, luego agregue la esencia de vainilla, batiendo constantemente hasta que todos los huevos estén bien incorporados.", "Agregue las semillas de vainilla y una generosa salpicadura de whisky o bourbon (aproximadamente 4 cucharadas), si se usa. Agregue la crema y bata bien hasta que la mezcla esté suave. Vierta suavemente sobre la base de esponja en la lata de la torta.", "Siente la lata en una bandeja honda llena de 2-3 mm de agua tibia para ayudar a crear vapor durante la cocción. Hornee durante 50 minutos hasta que la parte superior esté dorada. Retírelo y déjelo enfriar y ajústelo completamente antes de sacarlo de la lata.", "Para los plátanos, justo antes de servir, pele los plátanos y fríe en la mantequilla y el azúcar hasta que estén dorados y ligeramente caramelizados.", "Para la salsa toffee, en una sartén a fuego lento, combine la crema, la mantequilla y el azúcar. Cuando la mantequilla y el azúcar se hayan derretido, mezcle el jarabe y la melaza.", "Para la salsa de chocolate, derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua).", "Caliente el azúcar en una sartén con 100 ml / 3½ fl oz de agua, revolviendo hasta que el azúcar se disuelva. Llevar a ebullición. Mezcle el jarabe de azúcar en el chocolate derretido hasta que quede suave y brillante.", "Cortar la tarta de queso en trozos y servir con los plátanos y la salsa de caramelo y chocolate. Adorne con menta fresca."], "url": "www_bbc_co_uk_food_recipes_vanilla_and_bourbon_20548", "title": "Tarta de queso de vainilla y bourbon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de azúcar glas, tamizado", "150 g / 5½ oz de almendras molidas", "3 huevos de gallinas camperas", "90 g / 3¼ oz de yema de huevo (unas 5 yemas de huevo grandes)", "275g / 9¾oz de clara de huevo (aproximadamente 9 claras de huevo grandes)", "Azúcar en polvo de 110 g / 4 oz", "120g / 4¼oz de harina común, tamizada", "200 g / 7 oz de azúcar en polvo", "2 vainas de vainilla, solo semillas", "1 limón, ralladura solamente", "1 naranja, solo ralladura", "4 cucharadas de harina de maíz", "845g / 1lb 14oz de queso crema", "3 huevos de gallinas camperas", "375ml / 12½ fl oz crema doble", "10 naranjas, en jugo (para hacer aproximadamente 400ml / 14fl oz de jugo de naranja)", "400 g / 14 oz de azúcar en polvo", "4 vainas de vainilla vacías", "8 vainas de cardamomo, agrietadas", "1 naranja, pelada, cortada en trozos pequeños", "½ semillas de granada", "1-2 cucharadas de menta fresca rallada"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la esponja de almendra, mezcle el azúcar glas y las almendras molidas en un tazón.", "En un recipiente aparte, bata los huevos y las yemas enteros, luego bata el azúcar glas y las almendras y continúa batiendo hasta que estén pálidas y gruesas.", "En otro recipiente, bata las claras de huevo hasta que se formen picos suaves cuando se retire el batidor del recipiente.", "Agregue el azúcar, poco a poco, batiendo a medida que avanza, hasta que la mezcla forme picos rígidos cuando retire el batidor del tazón.", "Doble el azúcar en la mezcla de huevo y almendras y luego doble suavemente la harina tamizada.", "Divida la mezcla entre dos bandejas forradas con una estera de silicona antiadherente y alise con una espátula. Hornee en el horno durante 12-14 minutos, o hasta que estén pálidas doradas.", "Retire la esponja del horno y deje que se enfríe un poco en las bandejas antes de retirarla cuidadosamente a una rejilla para que se enfríe por completo.", "Corte la esponja en la línea dos anillos de 28cm x 7cm / 11in x 2¾ en profundos chefs.", "Reduzca la temperatura del horno a 150C / 300F / Gas 2,", "Para la tarta de queso, bata el azúcar impalpable, las semillas de vainilla, la ralladura de limón y naranja, la harina de maíz y el queso crema en un bol hasta que estén pálidos y esponjosos.", "Batir los huevos, uno por uno, y luego agregar la crema a la mezcla. Batir para combinar.", "Vierta la mezcla de pastel de queso en los anillos de los chefs alineados y hornee las tartas de queso en el horno durante 35-40 minutos, o hasta que se asienten. Retire del horno y deje en los anillos para enfriar.", "Para hacer el jarabe de naranja, caliente el jugo de naranja, el azúcar, las vainas de vainilla y el cardamomo en una sartén y cocínelos hasta que la mezcla se haya reducido y esté espesa y almibarada. Colar en una sartén limpia y calentar suavemente.", "Para servir, corte la tarta de queso en trozos y coloque los platos para servir. Esparza las semillas picadas de naranja y granada en la parte superior y rocíe con naranja y jarabe de cardamomo. Termine con menta rallada para servir."], "url": "www_bbc_co_uk_food_recipes_vanilla_and_orange_64396", "title": "Tarta de queso de vainilla y naranja con esponja de almendra, naranja y jarabe de cardamomo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 2 tartas de queso", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 hojas de gelatina", "100ml / 3½ fl oz crema doble", "100ml / 3½fl oz de leche entera", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, solo semillas", "300 g / 10½ oz de yogur griego", "Jalea de frambuesa, paquete de 135g / 4¾oz, cortada en cubos", "300ml / 10fl oz de jugo de granada", "½ granada, solo semillas"], "method": ["Para la panna cotta, ponga la gelatina en un recipiente con agua fría y déjela remojar durante cinco minutos.", "Coloque la crema doble, la leche, el azúcar y las semillas de vainilla en una sartén pequeña y caliente con cuidado, lo suficiente para que el azúcar se disuelva, revolviendo de vez en cuando.", "Mientras tanto, coloca el yogur en una jarra grande, revolviéndolo para aflojarlo y reservarlo. Retire la mezcla cremosa del fuego una vez listo.", "La gelatina debería estar suave por ahora, entonces sáquela del agua y exprima el exceso de agua. Coloque la gelatina en la mezcla cremosa y revuelva hasta que se disuelva. Dejar enfriar a la temperatura corporal durante aproximadamente 10-15 minutos.", "Mientras tanto, prepara tus gafas. Necesitará unos vasos bonitos de 6 x 200 ml / 7 onzas líquidas para servir, pero como las capas están dispuestas de forma inclinada, las gafas necesitarán estar apoyadas hacia un lado. Dependiendo de la forma o el tipo de vidrio, puede encontrar cartones de huevos o incluso paños de cocina arrugados perfectos para ayudar a sostener las gafas. También podrían inclinarse perfectamente sentados en moldes individuales. Lo que sea que use, colóquelos en una bandeja grande o en bandejas que se ajusten fácilmente en la nevera.", "Una vez frío, vierte la mezcla cremosa sobre el yogur y luego bate suavemente todo junto.", "Vierta cuidadosamente la mezcla en los seis vasos, dividiéndolos uniformemente, sin permitir que se derrame ninguno. Coloque con cuidado la bandeja en el refrigerador y déjela reposar durante 1 o 2 horas, o hasta que esté agradable y firme. Para comenzar el proceso de configuración rápidamente, siempre puede ponerlos en el congelador durante 20 minutos más o menos antes de colocarlos en el refrigerador para finalizar la configuración.", "Mientras tanto, para la capa de gelatina, coloca la gelatina de frambuesa en una jarra medidora. Vierta más de 200ml / 7fl oz de agua recién hervida y revuelva hasta que la jalea se disuelva. Agregue el jugo de granada, luego deje que el líquido se enfríe a temperatura ambiente; asegúrese de que esté bien frío para no derretir la panna cotta al impactar.", "Retire el conjunto panna cottas de la nevera y coloque las copas en posición vertical, quitando cualquier accesorio. Vierta la gelatina fría sobre cada una, dividiéndola de manera uniforme. Devuelva los vasos a la nevera durante aproximadamente dos horas, o hasta que la gelatina esté firme.", "Cuando esté listo para servir, cubra cada panna cotta con semillas de granada y siéntese en un plato para servir con una cuchara pequeña. Estos se mantendrán durante unos días en la nevera."], "url": "www_bbc_co_uk_food_recipes_vanilla_and_yogurt_panna_76284", "title": "Panna cotta de vainilla y yogur con gelatina de granada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanilla_and_yogurt_panna_76284_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["23cm / 9en base de esponja lista para usar", "200 g / 7 oz de azúcar en polvo", "1 limón, cáscara y jugo solamente", "4 cucharadas de harina de maíz", "850g / 1lb 14oz de queso crema con toda su grasa", "3 huevos de gallinas camperas", "1 vaina de vainilla, semillas raspadas", "375 ml / 13 fl oz crema doble", "Fresas de 250g / 9oz cortadas en cuartos", "150g / 5oz de chocolate blanco, más o menos picado", "Fresas de 250g / 9oz", "1 limón, solo jugo", "2 cucharadas de azúcar glas, o al gusto", "100 g / 3½ oz de fresas"], "method": ["Para la tarta de queso, precaliente el horno a 180C / 350F / Gas 4.", "Coloque la base de la esponja en el fondo de un springform de 23cm / 9in, estaño de torta suelta.", "Coloque el azúcar, el jugo de limón, la ralladura y la harina de maíz en un bol y mezcle.", "Agregue el queso crema y bata bien. Agriete los huevos, uno a la vez, latiendo bien entre cada adición. Agregue las semillas de vainilla y mezcle bien, luego vierta la crema doble y bata hasta que la mezcla esté suave. Doble las fresas y el chocolate blanco.", "Vierte la mezcla en el molde de la torta y dale a la lata un ligero batido para distribuir la mezcla de forma pareja.", "Envuelva la lata de la torta en una hoja de papel de aluminio para que sea resistente al agua, luego colóquela en una lata de asar llena a una profundidad de aproximadamente 0.5 cm / ¼ in con agua. Transfiere al horno y hornea por 50 minutos, o hasta que la parte superior esté ligeramente dorada y la tarta de queso esté lista. Retirar del horno y dejar enfriar en la lata, luego mantener en el refrigerador hasta que esté listo para servir.", "Para la salsa de fresa, caliente una sartén hasta que esté caliente y coloque 250 g / 8 oz de las fresas en la sartén. Revuelva-fríe por un minuto.", "Agregue el jugo de limón y el azúcar glas, al gusto.", "Vierta la mezcla en una licuadora y mezcle hasta que quede suave, luego pase a través de un colador, presionando con el dorso de una cuchara, para eliminar todas las semillas.", "Para servir, retire la tarta de queso de la nevera, retire de la lata y coloque una rebanada en un plato de servir. Cubra con la salsa y algunas fresas."], "url": "www_bbc_co_uk_food_recipes_vanilla_and_strawberry_46714", "title": "Tarta de queso al horno de vainilla y fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas digestivas 200 g / 7 oz", "100 g / 3½ oz de mantequilla, derretida", "125 g / 4 ½ oz moras", "2 cucharaditas de azúcar en polvo", "1 vaina de vainilla, dividida", "500g / 1lb 2oz de queso crema con toda su grasa", "3 huevos de gallinas camperas", "½ limón, solo jugo", "75ml / 2½ fl oz crema doble", "Harina normal de 56g / 2oz", "Azúcar en polvo de 196 g / 7 oz", "35g / 1 oz de miel", "70g / 2oz de glucosa líquida", "200 g / 7 oz de azúcar en polvo", "20 g / 1 oz de bicarbonato de soda", "pimienta negra recién molida (opcional)"], "method": ["Precalentar el horno a 130 ° C / 250 ° F / Gas 1/2. Alinee una lata de torta en forma de resorte de 20cm / 8in.", "Para la base de pastel de queso, coloque las galletas digestivas en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Mezcle con la mantequilla derretida, luego presione la mezcla en el fondo de la lata forrada. Use la parte inferior de un vaso para emparejar la mezcla de galletas. Coloque en la nevera.", "Para el puré de moras, coloque las bayas y el azúcar en una sartén junto con un chorrito de agua y cocine a fuego lento a fuego medio hasta que las bayas se rompan y se vuelvan tiernas. Mezclar hasta obtener un puré suave en un procesador de alimentos, luego pasar a través de un tamiz fino en un recipiente. Dejar de lado para enfriar.", "Para el relleno de la tarta de queso, raspe las semillas de vainilla de las vainas y bata en el queso crema hasta que estén bien combinados. En una jarra, mezcle los huevos, el jugo de limón y la crema.", "Agregue la mitad de la mezcla de huevo al queso crema y mezcle hasta que esté suave y bien combinado. Agregue la harina y el azúcar a la mezcla de queso crema, luego mezcle la mezcla de huevo restante hasta que quede suave.", "Vierta la mezcla de pastel de queso en la lata preparada, luego rocíe sobre el puré de moras. Hornee la tarta de queso durante 40 minutos, o hasta que la tarta de queso esté colocada y ligeramente dorada en la parte superior. Dejar de lado para enfriar.", "Para el panal de pimienta negra, coloque una estera de silicona en una bandeja grande para hornear.", "Coloque la miel, la glucosa líquida, el azúcar impalpable y el agua en un recipiente grande y profundo, y caliente hasta que la mezcla alcance los 150 ° C / 300 ° F en un termómetro de azúcar.", "Mezcle rápidamente el bicarbonato de soda (tenga cuidado ya que la mezcla se expandirá rápidamente y burbujeará), luego vierta sobre la estera de silicona. Ligeramente extender sobre la estera con un espátula y espolvorear sobre un poco de pimienta negra recién molida. Dejar de lado hasta que se enfríe y se endurezca.", "Antes de servir, rompe el panal en pedazos. Cortar la tarta de queso en rodajas y decorar la parte superior con fragmentos de panal de pimienta negro."], "url": "www_bbc_co_uk_food_recipes_vanilla_baked_cheesecake_59336", "title": "Tarta de vainilla al horno con moras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanilla_baked_cheesecake_59336_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 vainas de vainilla", "200 g / 7 oz de azúcar en polvo", "200g / 7oz de sal marina", "Filete de salmón de 1.5kg / 3lb y 5 oz, con piel, hueso deshuesado, lavado y secado con palmaditas", "1 manojo de rábanos para el desayuno, cortado a la mitad, para adornar", "1 cestón de berros mostaza, para adornar", "berro, para adornar", "2 pepinos", "100ml / 3½fl oz de vinagre de vino de arroz", "1 cucharadita de azúcar en polvo", "1 cucharadita de sal marina", "2-3 cucharaditas de goma de xantano", "aceite de colza, para planchar", "100ml / 3½fl oz de vinagre de vino de arroz", "1 pizca de azúcar en polvo", "1 pizca de sal marina", "50g / 1¾oz de jengibre fresco de raíz, pelado y finamente cortado en tiras finas"], "method": ["Para el salmón, ponga las vainas de vainilla y el azúcar en un procesador de alimentos, mezcle hasta lograr un puré fino y luego agregue la sal marina.", "Coloque una película adhesiva sobre una superficie de trabajo limpia, luego coloque la mitad de la mezcla de azúcar en una línea en el centro.", "Coloque el filete de salmón encima, con la piel hacia abajo y luego espolvoree el resto de la mezcla sobre la parte superior para cubrir el salmón.", "Envuelva el salmón ligeramente con la película adhesiva, luego colóquelo en una bandeja en la nevera durante 24 horas.", "Retire el salmón de la película adhesiva, cepille la mezcla de sal y enjuague bien con agua fría, luego seque y envuelva la película adhesiva limpia hasta que esté lista para servir.", "Para el ketchup de pepino, corte el borde exterior de los pepinos para que quede con dos bastones largos de 2cm / ¾in. Dejar de lado.", "Cortar aproximadamente las partes externas del pepino antes de poner en un procesador de alimentos con el vinagre de vino de arroz, el azúcar y la sal.", "Mezclar hasta obtener un puré fino, luego agregar la goma de xantano una cucharadita a la vez hasta que se espese.", "Caliente una sartén hasta que esté caliente, rocíe los bastones de pepino con un poco de aceite de colza y luego cocine a cada lado hasta que esté cocido y caliente. Retirar del fuego y cortar en cubos pequeños.", "Para el jengibre en escabeche, coloque el vinagre, el azúcar y la sal en una cacerola mediana y caliente hasta que el azúcar se haya disuelto.", "Agregue el jengibre y cocine a fuego lento durante 1-2 minutos, o hasta que el jengibre se haya marchitado.", "Retirar del fuego y dejar enfriar.", "Para servir, corte el salmón finamente y coloque la capa sobre cada plato, cubra con trozos de pepino chamuscado, gotas del ketchup del tamaño de una cucharadita y rábanos partidos a la mitad. Esparce el jengibre encurtido, el berro de mostaza y el berro sobre la parte superior para terminar."], "url": "www_bbc_co_uk_food_recipes_vanilla_cured_salmon_21998", "title": "Salmón curado a la vainilla con salsa de tomate de pepino, pepino carbonizado y jengibre en escabeche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7 yemas de huevo de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz", "2 vainas de vainilla, solo semillas", "250ml / 9fl oz de leche entera", "750ml / 1¼ pinta de crema doble", "55g / 1¾oz demerara azúcar", "Fresas frescas de 250 g / 9 oz, sin cáscara"], "method": ["Precalentar el horno a 120C / 250F / Gas ½.", "Para la crème brûlées, coloque las yemas de huevo en un tazón, agregue el azúcar impalpable y la vainilla y mezcle hasta que estén pálidos y esponjosos y bien combinados.", "Agregue la leche y la crema y bata hasta que estén bien combinados.", "Vierte la mezcla en moldes y coloca los moldes en una lata honda.", "Coloque la lata en el horno y vierta suficiente agua hirviendo para llegar hasta la mitad de los lados de los moldes. Hornea por una hora, o hasta que esté listo.", "Retirar de la lata de asar y dejar enfriar. Cuando esté frío, refrigere las crème brûlées durante al menos dos horas, o hasta que estén completamente frías y firmes.", "Para la salsa de fresa, coloque la mitad de las fresas en un procesador de alimentos y mezcle con un puré. Colar por un colador fino.", "Corte a la mitad el resto de las fresas y revuelva a través de la salsa pasada.", "Cuando esté listo para comer, espolvoree el azúcar demerara sobre la parte superior de los brûlées y caramelice con un soplete de chef o colóquelos bajo una parrilla caliente hasta que el azúcar comience a burbujear y caramelizar. Coloque cada plato en un plato y sirva con la salsa de fresa en un plato pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_vanilla_crme_brle_with_58708", "title": "Crema de vainilla con salsa de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 1 litro / 1¾ pinta", "500ml / 18fl de leche en oz", "100g / 3½ oz de azúcar", "2 vainas de vainilla, partidas y semillas raspadas", "15 g / ½ oz de hojas de gelatina", "500ml / 18fl oz de vino tinto", "Crema de grosella negra 200 g / 7 oz", "100g / 3½ oz de azúcar", "½ manojo de romero", "1 estrella de anís", "1 ramita de canela", "4 ciruelas, apedreado y cortado en cuartos", "4 higos, cortados en cuartos", "100 g / 3½ oz zarzamoras"], "method": ["Coloque la crema, la leche, el azúcar y la vaina de vainilla y las semillas en una sartén, y lentamente llévela a ebullición.", "Remoje las hojas de gelatina en agua fría hasta que estén blandas y luego exprima el exceso de agua. Una vez que la mezcla de crema ha llegado a ebullición, agregue la gelatina hasta que se disuelva. Colar a través de un tamiz fino en una jarra y desechar la vaina de vainilla.", "Vierta la mezcla en moldes o vasos, y deje enfriar antes de transferirla a la nevera para prepararla.", "Ponga el vino tinto, la crema de cassis, el azúcar, el romero y las especias en una sartén y deje que hierva. Reduzca el fuego y deje hervir a fuego lento durante media hora para infundir las especias.", "Agregue las ciruelas y los higos al vino tinto, y continúe cocinando durante 2-3 minutos. Retire del fuego, deje que se enfríe un poco, luego agregue las moras. Dejar de lado para enfriar por completo.", "Sirva las frutas cocidas con el conjunto panna cotta."], "url": "www_bbc_co_uk_food_recipes_vanilla_panna_cotta_with_75584", "title": "Panna cotta de vainilla con higos escalfados y ciruelas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ de crema doble", "135g / 4¾oz de azúcar en polvo", "7 vainas de vainilla", "3 hojas de gelatina (empapadas en un recipiente con agua fría para ablandar)", "1 sandía, cortada en 3cm / 1¼ en cubos (guarda cualquier exceso, deforme, sandía para la sopa)", "sandía reservada", "100 g / 3½ oz de azúcar en polvo", "1 cucharada de menta fresca picada", "1 cucharada de jengibre molido"], "method": ["Para la vainilla panna cotta, ponga la crema y el azúcar en una cacerola.", "Dividir las vainas de vainilla, utilizando un cuchillo afilado raspar las semillas en la crema y agregar las vainas. Llevar a ebullición.", "Exprima el exceso de agua de la gelatina empapada. Agrégalo a la crema caliente y bate para disolverlo. Vierta la mezcla en seis moldes dariole individuales.", "Coloque en el refrigerador y déjelo listo.", "Para la sandía \"tostada\", freír la sandía en una sartén hasta que esté coloreada.", "Para la sopa, mezcle todo el exceso de sandía en una licuadora o procesador de alimentos.", "En una sartén, caliente el azúcar y 100 ml / 3½ fl oz de agua hasta que el azúcar se disuelva. Deje que se enfríe. Agregue la menta, el jengibre molido y la sandía mezclada y colóquelo en la nevera para enfriar.", "Una vez que la panna cotta se haya puesto, convierte cada una en un plato.", "Sirva con la sopa fría y trozos de sandía caramelizada."], "url": "www_bbc_co_uk_food_recipes_vanilla_panna_cotta_20752", "title": "Panna cotta de vainilla, sandía tostada, sopa de jengibre, menta y melón helado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de pan de jengibre preparado, en rodajas", "450 g / 1 libra de queso crema", "250 g / 9 oz de azúcar en polvo", "250 g / 9 oz de crema fresca", "Crema doble 475 ml / 17 fl oz", "2 vainas de vainilla, semillas raspadas", "Fresas de 200g / 7oz", "2 cucharaditas de azúcar en polvo", "2 cucharaditas de vinagre balsámico"], "method": ["Coloque el pan de jengibre en una bandeja y déjelo reposar durante la noche para que se seque.", "Cuando esté seco y duro, coloque en un procesador de alimentos y pulse hasta que se formen migas finas. Establecer a un lado.", "Coloque el queso crema, el azúcar impalpable, la crème fraîche, la crema doble y las semillas de vainilla en un tazón grande. Batir hasta que quede suave.", "Coloque la mezcla de crema en una manga pastelera de plástico y con cuidado pinte en 4.5cm / 2in de profundidad por 5.5cm / 2½ en anchos anillos de cocinero.", "Alise la parte superior con la parte posterior de una cuchilla plana y colóquelo en la nevera durante dos horas para que se asiente.", "Cuando esté listo, retírelo de la nevera y déjelo a temperatura ambiente durante cinco minutos.", "Coloque las migas de jengibre en un plato y cuidadosamente levante los anillos de los chefs y sumerja cada extremo de la tarta de queso en las migas de jengibre.", "Agite ligeramente cada pastel de queso en un plato, quitando el anillo.", "Mientras tanto, para las fresas, caliente una sartén a una temperatura alta. Agregue las fresas y el azúcar a la sartén y fríe brevemente durante un minuto, luego vierta sobre el balsámico y cocine por unos 30 segundos.", "Para servir, coloque algunas fresas en el plato junto con la tarta de queso."], "url": "www_bbc_co_uk_food_recipes_vanillaandgingerbrea_84059", "title": "Tarta de queso de vainilla y pan de jengibre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina de centeno fuerte", "125g / 4½oz de harina natural", "4 cucharaditas de polvo de hornear", "2 cucharaditas de especias mixtas molidas", "2 cucharaditas de jengibre molido", "125ml / 4fl oz de leche entera", "250g / 9 oz de miel clara perfumada", "3 huevos medianos de granja", "50g / 2oz de azúcar mascabado ligero", "1 limón pequeño, ralladura rallada solamente", "1 naranja pequeña ralladura rallada solamente", "semillas raspadas de media vaina de vainilla", "1 rodaja gruesa de limón", "300 g / 10 oz de azúcar en polvo", "15 g / ½ onza de glucosa líquida (disponible por especialistas en pasteles y en línea)", "Frambuesas inglesas de 500g / 1lb 2oz", "azúcar en polvo para rociar", "¼ de cucharadita de glucosa líquida", "½ limón, solo jugo", "250g / 9oz de queso blando con toda su grasa", "Crema doble 250ml / 9fl oz", "125 g / 4½ oz de crema", "125 g / 4½ oz de azúcar en polvo", "semillas raspadas de 1 vaina de vainilla dividida", "Frambuesas inglesas 300g / 10oz"], "method": ["Para pan de jengibre, precaliente el horno a 160 ° C / 320 ° F / Gas 3 y engrase y forre una lata de pan de 900 g / 2 lb.", "Tamiza los ingredientes secos en un tazón grande. Mezcle la leche, la miel, los huevos y el azúcar en otro recipiente con la ralladura de cítricos y las semillas de vainilla, luego agregue los ingredientes secos y mezcle bien hasta que estén bien combinados. Vierta la mezcla en la lata preparada. Hornee durante 45 minutos o hasta que un pincho insertado en el centro salga limpio. Enfríe en la lata durante aproximadamente 30 minutos, luego retírelo y déjelo enfriar sobre una rejilla de alambre.", "Para hacer migas de pan de jengibre (necesita 100 g / 4 oz), corte el pan de jengibre en rodajas de 5 mm / ¼ de grosor y deje secar en una bandeja durante la noche. Al día siguiente, muele las rebanadas en migas finas en un procesador de alimentos. Almacene en un recipiente de plástico hasta que esté listo para usar. (El resto del pan de jengibre se puede comer como un pastel, envuelto en papel de aluminio que se mantendrá durante una semana o más).", "Para el sirope común, coloque la rodaja de limón en una sartén con el azúcar, la glucosa líquida y 300 ml / ½ pinta de agua. Calentar suavemente, revolviendo ocasionalmente, hasta que el azúcar se haya disuelto, luego llevar a ebullición y hervir durante cinco minutos. Guay. Retire la rodaja de limón, luego pase el jarabe a través de un colador fino. Enfríe en un recipiente tapado en la nevera.", "Para el sorbete de frambuesa, coloque las frambuesas en una sartén grande, espolvoree ligeramente con azúcar en polvo y dos cucharadas de agua, y cocine a fuego lento durante unos cinco minutos o hasta que las frambuesas se ablanden. Incline en un tamiz fino colocado sobre un recipiente y empuje el puré para eliminar las semillas. Cubra y enfríe en la nevera.", "Coloque 100ml / 3½fl oz de puré de frambuesa a un lado en la nevera para más adelante. Combine el puré restante con 250ml / 9fl oz del sirope frío, la glucosa líquida y el jugo de limón. Revuelva en una máquina de helados hasta que se espese, de acuerdo con las instrucciones del fabricante, luego vierta en un recipiente limpio y guárdelo en el congelador hasta que esté listo para usar.", "Para las tartas de queso, coloque ocho anillos de metal para cocineros, cada uno de los cuales mide 5.5cm / 2¼ pulgadas de alto y 4.5cm / 1¾ pulgadas de ancho, sobre una estera antiadherente o una bandeja para hornear forrada con film transparente. Combine el queso blando, la crema, la crema fresca, el azúcar y las semillas de vainilla en un tazón grande. Batir bien hasta que estén gruesos, luego poner la mezcla en una bolsa plástica y pegar cuidadosamente en los anillos. Asegúrese de que no haya espacios ni bolsas de aire y tubería hasta la parte superior, luego alise la parte superior con la parte posterior de una cuchilla plana. Refrigere por dos horas o hasta que esté firme.", "Mientras tanto, haz bolas de sorbete y transfiérelas a una bandeja llena de pergamino para hornear. Coloque en el congelador. Coloque las frambuesas en un tazón con el puré de frambuesa 100ml / 3½fl oz reservado y mezcle ligeramente con un tenedor. Dejar de lado a temperatura ambiente.", "Unos cinco minutos antes de servir, retire las tortas de queso de la nevera. Uno a la vez, levante cada tarta de queso de la alfombra y sumerja ambos extremos en las migas de pan de jengibre, luego caliente el anillo en sus manos durante 30 segundos (o destelle rápidamente alrededor del anillo con un soplete). Ahora sostenga el anillo sobre un plato y levante con cuidado para que la tarta de queso se caiga en el plato.", "Para finalizar, coloca una cucharada de frambuesas al lado de cada plato y espolvorea una línea de migas de pan de jengibre entre la tarta de queso y las frambuesas. Cubra cada tarta de queso con una cucharada de sorbete y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_vanillaandgingerbrea_86247", "title": "Tartas de queso de vainilla y pan de jengibre con frambuesas frescas y sorbete de frambuesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "cacao en polvo, para quitar el polvo", "3 claras de huevo de gallinas camperas", "55g / 2oz de crema de vainilla fresca lista para usar", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Engrase un molde con mantequilla y espolvoree ligeramente con cacao en polvo.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite la batidora, luego doblar suavemente en la crema pastelera.", "Pase la uña o el extremo de una cucharilla por el borde interior del molde para aflojar el suflé por un lado. Coloque en una bandeja para hornear y transfiera al horno para hornear por 8-10 minutos, hasta que se levante y dore.", "Para servir, transfiera el soufflé a un plato y espolvoree con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_vanillaandchocolates_87716", "title": "Soufflé de vainilla y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9 oz de galletas de mantequilla precocinadas", "125g / 4½oz de mantequilla, derretida", "600g / 1lb 5oz de queso crema con toda su grasa", "600g / 1lb 5oz de ricotta", "6 huevos de gallinas camperas", "150 g / 5¼ oz de azúcar en polvo", "2 vainas de vainilla, semillas raspadas", "150g / 5¼ oz blanco", "chocolate, más extra para lloviznar", "bayas frescas mezcladas", "crema doble, para servir"], "method": ["Precalentar el horno a 175C / 350F / Gas 4.", "Coloque los bizcochos en una bolsa de plástico estándar de alimentos y aplaste con un rodillo u objeto pesado similar. Incline las migas en un tazón para mezclar.", "Agregue la mantequilla derretida y mezcle bien. Presione la mezcla de migas de pan en la base de una lata de torta en forma de resorte de 25cm / 10in.", "Coloque el queso crema, ricotta, huevos, azúcar en polvo y semillas de vainilla en un procesador de alimentos y pulse hasta que quede suave.", "Mientras tanto, coloque el chocolate en un recipiente resistente al calor colocado sobre una olla de agua a fuego lento (no permita que el recipiente toque el agua) y déjelo derretir. Tenga cuidado de no remover, ya que esto puede arruinar el chocolate. Una vez que todo se haya derretido, retire el recipiente del fuego y deje que se enfríe un poco.", "Doble suavemente el chocolate derretido en la mezcla de queso, luego coloque la mezcla de queso y chocolate en la lata, alise la parte superior con una espátula y transfiérala al horno. Cocine durante 50 minutos a una hora, hasta que la superficie esté clara y elástica al tacto. Sacar del horno y dejar enfriar.", "Para servir, libere con cuidado los lados del resorte de la lata y retírelos. Para servir, corta una rebanada de pastel de queso. Coloque en un plato, rocíe el chocolate derretido y servir con un puñado de bayas y una cucharada de crema."], "url": "www_bbc_co_uk_food_recipes_vanillaandwhitechoco_84134", "title": "Tarta de queso de vainilla y chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla", "Harina normal de 85g / 3oz, más extra para espolvorear", "1 huevo de gallinas camperas, golpeado", "30g / 1oz de mantequilla", "3 cucharadas de miel", "3 albaricoques, cortados a la mitad, piedras quitadas", "1 vaina de vainilla, partido, semillas raspadas", "Crema doble de 100 ml / 3½ fl oz, batida, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la mantequilla y la harina en el procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue el huevo y mezcle hasta que se una como una bola de hojaldre.", "Dar la vuelta a una superficie enharinada, amasar durante un minuto y luego rodar hasta el grosor de una moneda de una libra. Córtelo al tamaño de una sartén de tamaño mediano, resistente al horno, y déjelo a un lado.", "Para el relleno, caliente la mantequilla y la miel en la sartén, agregue los albaricoques, el lado del corte hacia abajo y las semillas de vainilla y saltee durante 2-3 minutos.", "Voltee los albaricoques, cubra con la masa preparada y presione los bordes para sellar la masa alrededor de los albaricoques. Hornee en el horno por 15 minutos.", "Retire del horno, coloque un plato de servir sobre la parte superior de la sartén, y voltee la sartén para sacar el tatin, con la fruta hacia arriba.", "Para servir, corte en rebanadas y cubra con montones de crema batida."], "url": "www_bbc_co_uk_food_recipes_vanillahoneyandapric_86208", "title": "Tarta tatin de vainilla, miel y albaricoque con crema batida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 vainas de vainilla", "Crema doble 500ml / 16fl oz (ver consejo)", "Azúcar 70 g / 3 oz", "3 yemas de huevo"], "method": ["Corta a la mitad las vainas de vainilla y raspa las semillas. Agregue las vainas a la crema y lleve a ebullición, luego agregue el azúcar y revuelva hasta que el azúcar se haya disuelto.", "Mientras tanto, bata las yemas de huevo en un tazón grande y luego bate lentamente la mezcla de crema caliente.", "Vierta la mezcla a través de un colador fino en otro recipiente y bata las semillas de vainilla. Vierta la mezcla en un recipiente a prueba de congelación y congélela durante 2-3 horas, o hasta que se endurezca."], "url": "www_bbc_co_uk_food_recipes_vanillaicecream_4616", "title": "Helado de vainilla", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanillaicecream_4616_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 hojas de gelatina", "Leche 250ml / 9fl oz", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida longitudinalmente, semillas raspadas", "25 g / 1 oz de azúcar", "175g / 6 oz de azúcar", "175ml / 6fl oz de agua", "licor de cerezas", "Frambuesas de 350g / 12oz", "4 ramitas de menta fresca", "azúcar glas, al polvo"], "method": ["Para la panna cotta, remoje las hojas de gelatina en un poco de agua fría hasta que estén suaves.", "Coloque la leche, la crema, la vaina de vainilla y las semillas y el azúcar en una sartén y deje hervir a fuego lento. Retire la vaina de vainilla y deséchela.", "Exprima el agua de las hojas de gelatina, luego agregue a la sartén y quite el fuego. Revuelva hasta que la gelatina se haya disuelto.", "Divida la mezcla entre cuatro moldes y déjelo enfriar. Coloque en la nevera durante al menos una hora, hasta que se endurezca.", "Para la salsa, coloque el licor de azúcar, agua y cereza en una sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el azúcar se haya disuelto.", "Retire la sartén del fuego y agregue la mitad de las frambuesas. Usando una batidora, mezcle la salsa hasta que quede suave.", "Pase la salsa a través de un colador en un recipiente y agregue la fruta restante.", "Para servir, coloca cada panna cotta en un plato para servir. Cuchara sobre la salsa y decorar con una ramita de menta. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_vanillapannacotta_87907", "title": "Panna cotta de vainilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanillapannacotta_87907_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 x 150g / 5½oz filete de ternera, cortado, sazonado", "Riñones de ternera de 300g / 10½oz, limpios y en rodajas", "75g / 2½oz de mantequilla sin sal", "100 ml / 3½ fl oz de madeira", "2 ramitas de tomillo fresco", "1 diente de ajo, aplastado", "100g / 3½oz de hojas grandes de espinaca", "50 g / 1¾oz de mantequilla sin sal", "1 papa grande, pelada y cortada en pedacitos", "aceite vegetal para freír", "100ml / 3½fl oz de vinagre balsámico", "150ml / 5fl oz de carne de ternera", "75g / 2½oz de mantequilla sin sal", "sal y pimienta negra recién molida", "1 chalote, cortado en cubitos", "2 dientes de ajo picados", "4-6 cucharadas de perejil picado"], "method": ["Para la ternera y los riñones, caliente la mitad del aceite en una sartén y una vez caliente cocine la ternera durante 3-4 minutos, o hasta que se haga a su gusto. Reservar para descansar", "Caliente una sartén limpia y agregue el aceite restante y cocine los riñones durante 2-3 minutos, luego termine con un poco de mantequilla. Reservar para descansar\r\nPonga la madeira, el tomillo y el ajo en una sartén limpia y caliente para reducir el volumen a la mitad.", "Caliente la mantequilla en una sartén grande, agregue las espinacas y un poco de agua y cocine hasta que se marchite.", "Calienta la freidora a 180 ° C, o llena a medias una sartén honda con aceite y caliente a 180 ° C o hasta que un pedazo de pan caído en el aceite se vuelva dorado en 15 segundos (Precaución: el aceite caliente puede ser peligroso. )", "Freír las patatas fritas durante 3-4 minutos. Escurrir y sazonar con sal.", "Para la reducción de ternera, caliente una cacerola y agregue el vinagre y cocine hasta que se reduzca a la mitad del volumen. Agregue el papel y reduzca nuevamente a la mitad del volumen. Termine con la mantequilla y sazone con sal y pimienta.", "Para el aderezo, coloque todos los ingredientes en un tazón mediano y mezcle.", "Para servir, corte el filete de ternera y los riñones. Coloque la espinaca cocida en el centro del plato y salpique con rodajas de filete y riñones. Cubra con algo del aderezo, la reducción de ternera y la reducción de madeira. Mezcle el resto del aderezo con las virutas saladas calientes y apile encima."], "url": "www_bbc_co_uk_food_recipes_veal_and_kidneys_with_11906", "title": "Ternera y riñones con espinacas, papas fritas y reducción de ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de cebada miso", "3 cucharadas de jengibre fresco de raíz finamente picado", "3 cucharadas de ralladura de yuzu finamente picada (disponible de proveedores especializados)", "2 cucharadas de chalote finamente picado", "1 cucharadita de ajo machacado", "1 pizca de pimiento shichimi (disponible de proveedores japoneses)", "2 cucharaditas de salsa de soja", "2 cucharaditas de sake", "2 cucharaditas", "4 cucharadas de aceite de salvado de arroz (disponible en línea)", "Chuleta de ternera a 280 g / 10 oz, con hueso", "1 chile rojo", "1 calabacín amarillo, reducido a la mitad longitudinalmente", "1 calabacín verde, reducido a la mitad longitudinalmente", "1 pizca de sal marina", "3 cucharadas de vinagre de sushi", "½ rubí de pomelo, cortado en segmentos", "5-6 ramitas de cilantro fresco", "jugo de jengibre fresco, al gusto"], "method": ["Combine el miso, jengibre, cáscara de yuzu, chalota, ajo, pimienta shichimi, salsa de soja, sake, mirin y aceite en un plato poco profundo.", "Batir el adobo juntos hasta que estén bien combinados, luego agregar la chuleta de ternera al plato y frotar el adobo por todos lados. Adobo por 24 horas.", "Para el pepinillo encurtido de pepino picante, ennegrezca el chile directamente sobre una llama directa (ya sea con un mini soplete o simplemente sobre la encimera de gas).", "Corta bastante el chile, incluida la piel ennegrecida y las semillas.", "Corta el calabacín en diagonal, luego haz tres cortes, siguiendo la diagonal, a una distancia de 2-3 mm, pero sin llegar al final. Haz un corte final en todo el recorrido; tendrás un pequeño abanico de calabacín. Repita con los calabacines restantes.", "Sazonar el calabacín en rodajas con sal marina y dejar reposar durante unos minutos, lo suficiente como para suavizar. Vierta sobre el vinagre de sushi.", "Combine el chile rojo, el calabacín, los segmentos de pomelo rubí y el cilantro en un tazón pequeño.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y precaliente una plancha en caliente.", "Planche las chuletas de ternera a cada lado hasta que se doren. Transfiera a una bandeja de asar y tueste durante aproximadamente seis minutos, volteando una vez en el horno.", "Permita que las chuletas de ternera descansen por un par de minutos.", "Exprime un poco de jugo de jengibre sobre la chuleta de reposo y sírvelo con el pepinillo de pepino quemado."], "url": "www_bbc_co_uk_food_recipes_veal_cutlet_marinated_in_10646", "title": "Chuleta de ternera marinada en cebada miso, jengibre y yuzu con pepinillo de pepino quemado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 4 oz hombro de ternera rosa, cortado en trozos de 4 cm / 1½ pulgadas", "1 cucharada de harina normal", "3 cucharadas de aceite de oliva", "100g / 3½ oz de panceta, tocino de tocino o similar", "2 cebollas, finamente picadas", "2 palitos de apio, finamente picado", "3 zanahorias, en rodajas finas", "4 dientes de ajo, finamente picados", "500ml / 18fl oz de vino blanco", "100 ml / 3½ fl oz de caldo de pollo", "1 pieza de ralladura de limón", "2 hojas de laurel", "1 tomillo de ramita grande", "2 ramitas de romero", "Tomates frescos de 200g / 7oz, pelados y finamente picados o puré", "150g / 5½oz de aceitunas verdes", "sal y pimienta negra recién molida"], "method": ["Espolvoree las piezas de ternera en la harina y sazone con sal y pimienta. Calentar una cucharada de aceite de oliva en una sartén grande y freír la ternera en ambos lados. Haga esto en dos tandas, usando otra cucharada de aceite de oliva para el segundo lote. Deja la ternera a un lado.", "Caliente la cucharada restante de aceite de oliva en una cazuela grande. Agregue la panceta y freír a fuego medio-alto hasta que esté crujiente y dorado y la grasa debería haber comenzado a rendirse.", "Agregue las cebollas, el apio y la zanahoria y reduzca el fuego. Freír hasta que las verduras hayan adquirido un poco de color y se hayan suavizado un poco, alrededor de 10 minutos.", "Agregue el ajo y cocine por un par de minutos, luego agregue la ternera a la cazuela. Desglasar la sartén con un poco de vino blanco y verter sobre la ternera, luego agregar el resto del vino a la cazuela, junto con el caldo de pollo.", "Agregue la ralladura de limón y las hierbas y sazone con sal y pimienta. Llevar a ebullición, luego baje y cubra. Cocine a fuego lento durante 45 minutos.", "Agregue los tomates y las aceitunas y cocine durante media hora más, sin tapar, para permitir que la salsa se reduzca un poco. Servir."], "url": "www_bbc_co_uk_food_recipes_veal_and_olive_stew_67582", "title": "Guiso de ternera y aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]