[{"isVegetarian": true, "title": "Crumble de sésamo de manzana y zanahoria", "url": "www_bbc_co_uk_food_recipes_appleandcarrotsesame_85051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25 g / 1oz de mantequilla sin sal", "2 manzanas, peladas, sin corazón y en rodajas finas", "1 zanahoria, pelada y rallada", "50g / 1½ oz de azúcar moreno", "50ml / 2fl oz de vino blanco", "Harina normal de 100 g / 3½ oz", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos, más extra para engrasar", "100g / 3½oz de azúcar moreno", "2 cucharaditas de canela molida", "2 cucharadas de semillas de sésamo", "100 g / 3½ oz de yogur griego, para servir", "ramita de menta, para adornar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, derrita la mantequilla en una sartén y cocine la manzana y la zanahoria hasta que estén suaves.", "Agregue el azúcar moreno y cocine hasta que esté caramelizado.", "Agregue el vino blanco y cocine a fuego lento hasta que la mezcla se espese.", "Engrase ligeramente un plato pequeño a prueba de horno y vierta la mezcla en el plato.", "Para el relleno, coloque la harina y la mantequilla en un tazón grande y frote hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar moreno, la canela y las semillas de sésamo y mezcle bien.", "Espolvorea la migaja sobre el relleno y hornea en el horno durante 12-14 minutos, hasta que se dore.", "Para servir, cuchara sobre el yogur y decorar con menta."]}, {"isVegetarian": true, "title": "Tarta de manzana y queso Cheshire", "url": "www_bbc_co_uk_food_recipes_appleandcheshirechee_84731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manzana", "30g / 1oz de mantequilla", "1 cucharada de azúcar moreno", "2 claras de huevo de gallinas camperas, batidas hasta que estén tiesas", "50g / 1¾oz queso Cheshire, rallado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta la parte superior de la manzana, corta la carne de esta parte y colócala en un recipiente, descartando el resto de la parte superior. Luego corte la mayor cantidad de carne posible de la parte principal de la manzana, dejando intacta la capa externa. Deseche el núcleo, corte la carne y agregue esto al recipiente.", "Derrita la mitad de la mantequilla en una sartén pequeña a prueba de horno, coloque la carne de manzana en la sartén y cocine suavemente durante 4-5 minutos, o hasta que se ablande hasta obtener un puré.", "Transfiera el puré de manzana a un tazón y déjelo enfriar durante cinco minutos.", "Derretir la mantequilla restante en la sartén. Coloque la cáscara de manzana en la sartén, espolvoree azúcar morena sobre ella y transfiérala al horno para hornear durante 5-6 minutos, hasta que comience a ablandarse y se ponga dorada.", "Mientras tanto, coloca las claras de huevo batidas en el tazón con el puré de manzana y dóblalas, luego dobla el queso Cheshire.", "Retire la manzana del horno, vierta la mezcla de puré dentro y vuelva al horno de 5 a 6 minutos o hasta que se hinche y se dore.", "Para servir, transfiera la manzana horneada a un plato para servir."]}, {"isVegetarian": false, "title": "Tarta de manzana y filo con vieiras y ensalada de tocino", "url": "www_bbc_co_uk_food_recipes_appleandfilotartwith_92952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manzana Bramley, pelada, sin núcleo, en cubitos", "2 cucharaditas de agua", "1 cucharadita de hojas frescas de tomillo", "15g / ½ oz de mantequilla", "sal y pimienta negra recién molida", "Pasteles filo de 8 hojas, cortados en círculos de 8 x 17 cm / 6½ pulgadas", "50g / 2oz de mantequilla, derretida", "12 vieiras grandes y cortadas a mano, limpias, huevas retiradas", "1 cucharadita de aceite de oliva", "8 rebanadas gruesas tocino rayado ahumado, hervido durante 1 minuto, cortado en trozos pequeños", "2 cucharaditas de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "75g / 3oz de berro, solo hojas", "Hojas de espinaca bebé 40 g / 1½ oz", "Hojas de remolacha para bebé de 40g / 1½oz", "20g / ¾oz de hojas rojas de amaranto", "20g / ¾oz coriandro bebé berro"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la tarta de manzana y filo, coloque las manzanas, el agua y las hojas de tomillo en una olla con tapa, cubra la olla con la tapa y caliente a fuego medio durante 3-4 minutos, o hasta que las manzanas se hayan descompuesto en un puré. Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Coloque cuatro de los círculos de hojaldre en una bandeja para hornear. Cepille cada círculo con un poco de mantequilla derretida y coloque otro círculo de pasta filo en la parte superior.", "Cepille la parte superior con un poco más de mantequilla y espolvoree el puré de manzana en la parte superior, asegurándose de que todos los pasteles estén cubiertos.", "Transfiera al horno y cocine durante 5-6 minutos, o hasta que estén crujientes y doradas.", "Mientras tanto, cepille las vieiras con el aceite de oliva y sazone, al gusto, con sal.", "Calentar una sartén hasta que esté caliente. Agregue las vieiras y freír en cada lado, durante 45 segundos en cada lado, o hasta que estén doradas en cada lado y cocidas. (NB: No mueva las vieiras durante la cocción.) Retire las vieiras de la sartén y déjelas a un lado para que descansen.", "Para la ensalada de tocino, caliente una sartén a fuego alto hasta que esté caliente, agregue las piezas de tocino y fría durante 2-3 minutos, o hasta que estén doradas y crujientes.", "Batir la mostaza, el vinagre y el aceite de oliva juntos en un tazón y sazonar, a gusto con un poco de sal y pimienta negra.", "Mezcle las hojas de ensalada y el tocino frito en un bol, luego rocíe sobre el aderezo de ensalada y mezcle hasta que estén bien combinados.", "Para servir, coloque una tarta de manzana y filo en cada una de las cuatro placas para servir. Coloque tres vieiras en cada tarta y cubra con un puñado de ensalada de tocino."]}, {"isVegetarian": true, "title": "Crumble de manzana y ciruela con crema de brandy", "url": "www_bbc_co_uk_food_recipes_appleandprunecrumble_84550", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g / ½ oz de mantequilla", "15g / ½ oz de azúcar moreno", "½ cucharadita de canela", "6-8 ciruelas pasas picadas", "½ manzana Bramley, pelada, sin corazón y picada en cubos", "2 cucharadas de mantequilla", "2 cucharadas de azúcar moreno", "4 cucharadas de harina normal", "1 cucharada de nueces de pistacho, conchas eliminadas", "5 cucharadas de crema doble, batida", "2 cucharadas de aguardiente"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla en una cacerola a fuego medio. Agregue el azúcar moreno y cocínelo hasta que se derrita y combine.", "Agregue la canela, las ciruelas pasas y las manzanas y cocine hasta que las manzanas se vuelvan muy suaves.", "Transfiera la mezcla de frutas a un plato para horno poco profundo.", "Para la migaja, coloque todos los ingredientes de la migaja juntos en un procesador de alimentos y mezcle hasta que se combinen. Espolvorea la mezcla de crumble encima de la fruta y transfiérela al horno para hornear durante 10-15 minutos, o hasta que la cobertura de crumble esté crujiente y dorada.", "Para la crema de brandy, agregue el brandy a la crema batida en un bol y dóblelos.", "Sirva el crumble en el plato de cocina con la crema de brandy en un tazón al lado."]}, {"isVegetarian": true, "title": "Tartaletas de manzana y maracuyá", "url": "www_bbc_co_uk_food_recipes_appleandpassionfruit_89981", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appleandpassionfruit_89981_16x9.jpg", "ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4½fl oz de agua helada", "3 yemas de huevo de gallinas camperas", "Azúcar en polvo 120g / 5oz", "Harina normal de 20g / ¾oz", "Leche 250ml / 9fl oz", "½ vaina de vainilla, dividida longitudinalmente", "1 cucharada de azúcar glas", "3 manzanas Cox medianas, peladas y en rodajas finas", "3 maracuyá, pulpa y semillas raspadas, para servir"], "serves": "Rinde 6", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la pasta de hojaldre basta, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo profundo en el centro con los dedos.", "Coloque los cubos de mantequilla y la sal en el pocillo y, con los dedos de una mano, mezcle los ingredientes, extrayendo gradualmente más harina en el pocillo con la otra mano y revolviéndolo hasta que la mezcla esté suelta pero bien combinada y quieta con grumos de mantequilla visible.", "Poco a poco agregue el agua helada y mezcle hasta que esté completamente incorporado en la mezcla. (Es posible que no necesite toda el agua. Tenga cuidado de no trabajar en exceso la mezcla).", "Haga rodar la masa en forma de bola, envuélvala en una película adhesiva y déjela enfriar por 20 minutos.", "Cuando la masa se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada en un rectángulo de 40cm x 20cm / 16in x 8in. Dobla el rectángulo en tres y dale un cuarto de vuelta.", "Repita el proceso, dando la masa doblada otro cuarto de vuelta.", "Envuelva la masa en una película adhesiva y déjela enfriar por otros 30 minutos.", "Cuando la masa se haya enfriado, extiéndala, como antes, sobre una superficie de trabajo ligeramente enharinada en un rectángulo de 40cm x 20cm / 16in x 8in. Dobla el rectángulo en tres y dale un cuarto de vuelta.", "Repita el proceso, como antes, dando la masa doblada otro cuarto de vuelta (haciendo un total de cuatro vueltas).", "Envuelva la masa en una película adhesiva y refrigere durante al menos 30 minutos.", "Para la crème pâtissière, en un tazón, bata las yemas de huevo y 20 g / ¾oz del azúcar impalpable hasta obtener una consistencia de cinta. Es posible que desee utilizar un batidor eléctrico para hacer esto.", "Poco a poco bata la harina hasta que esté suave y bien combinada.", "En una sartén, hierva la leche, 40 g / 1½ oz del azúcar y la vaina de vainilla. Tan pronto como la mezcla comience a hervir, vierta gradualmente la mezcla de leche caliente sobre la mezcla de yema de huevo, revolviendo continuamente.", "Regrese la mezcla a la sartén y vuelva a hervir, batiendo continuamente. Cocine a fuego lento durante 1-2 minutos, luego retire del fuego y transfiera la mezcla a un recipiente.", "Espolvorea la crème pâtissière con una capa de azúcar glas para evitar que se forme una piel a medida que se enfría. (Una vez que esté frío, la mezcla puede guardarse en el refrigerador hasta por tres días. Retire la cápsula de vainilla antes de usarla).", "Precalentar el horno a 180C / 350F / Gas 4.", "Ruede la masa de hojaldre en una superficie ligeramente enharinada hasta obtener un grosor de 2 mm / octavo de pulgada. Recorte seis discos con un cortador de pasteles de 12 cm / 5 pulgadas.", "Cubra una bandeja para hornear con un pergamino para hornear y cepille con un poco de agua fría. Transfiera cada uno de los discos de pastelería con una espátula. Enfríe los pasteles en la nevera durante 20 minutos. Pinche los discos de repostería varias veces con un tenedor.", "Extienda cantidades iguales de la mezcla de crème pâtissière uniformemente en cada uno de los discos de repostería, dejando un margen estrecho libre en el borde de cada disco de repostería.", "Coloque las rebanadas de manzana en un ventilador sobre la mezcla de crème pâtissière, comenzando en el centro de cada disco y trabajando hacia afuera hasta los bordes.", "Transfiera las tartaletas al horno y hornee durante 15-18 minutos, o hasta que la masa se haya levantado y tenga un color marrón dorado pálido. Espolvoree generosamente con los 60 g / 2½ oz restantes de azúcar en polvo, luego regrese al horno y cocine por otros 4-5 minutos, o hasta que el azúcar se haya caramelizado.", "Retire las tartaletas del horno e inmediatamente transfiéralas a una rejilla de alambre, usando una espátula. Dejar de lado para enfriar.", "Para servir, coloque una de las tartaletas enfriadas en cada uno de los seis platos para servir y espolvoree cantidades iguales de pulpa de maracuyá."]}, {"isVegetarian": true, "title": "Tarta de manzana y carne picada con nueces machacadas y crema de menta", "url": "www_bbc_co_uk_food_recipes_appleandmincemeattar_84971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 7½cm / 3in cuadrado de hojaldre hecho a mano", "Carne picada 150 g / 5½ oz", "1 manzana para cocinar (como Bramley apple), sin corazón, pelada y rebanada", "2 cucharadas de azúcar moreno", "1 cucharada de leche", "1 cucharada de menta fresca picada", "2 cucharadas de azúcar glas", "Crema doble de 100 ml / 3½ fl oz, batida a picos suaves", "1 cucharada de nueces trituradas", "3 cucharadas de miel clara", "azúcar en polvo, para quitar el polvo"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Mark 6.", "Para la tarta, coloque la masa en una bandeja para hornear y extender la carne picada sobre la masa, dejando un borde de 1 cm / ½ pulgada. Coloque las manzanas y el azúcar encima de la carne picada.", "Cepille los bordes de la masa con leche y hornee por ocho minutos o hasta que estén dorados.", "Para hacer la crema de menta, mezcle la menta y el azúcar con la crema batida en un tazón pequeño.", "Espolvorear la tarta con nueces, rociar con miel y polvo con azúcar glas. Sirve la tarta caliente."]}, {"isVegetarian": true, "title": "Diamante de hojaldre de manzana y sultana con crema coagulada", "url": "www_bbc_co_uk_food_recipes_appleandsultanapuffp_71448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 manzanas Bramley peladas, sin corazón y cortadas en cubitos", "1 vaina de vainilla - dividida longitudinalmente y semillas raspadas", "50g / 1¾oz de mantequilla", "pizca de canela", "una pizca de azúcar", "100 g / 3½ oz de sultanas", "salpicaduras de agua", "200 g / 7 oz de hojaldre", "lavado de huevos", "una pizca de azúcar", "crema coagulada, para servir"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la compota, pon las manzanas, la vainilla, la mantequilla, la canela, el azúcar y el agua en una sartén y cocina, revolviendo a menudo, hasta que los ingredientes se conviertan en un puré.", "Luego mezcle las sultaninas y reserve.", "Para el diamante, despliegue la masa de hojaldre y corte dos diamantes de 10 cm de ancho.", "Corta los bordes de los diamantes y dobla las esquinas una contra la otra.", "Cepille con un lavado de huevo, espolvoree con azúcar y hornee a 180 ° C / 350 ° F / Gas 4 hasta que se doren. Deja enfriar.", "Corta los diamantes a la mitad, coloca el puré sobre el fondo, agrega las tapas de los pasteles y sírvelo con la crema coagulada."]}, {"isVegetarian": true, "title": "Manzana y pasas de uva chutney", "url": "www_bbc_co_uk_food_recipes_appleandraisinchutne_1475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Manzanas de 1.8kg / 4lb, peladas, sin corazón y picadas", "4 cebollas medianas, peladas y finamente picadas", "2 dientes de ajo, pelados y triturados", "1 limón, solo jugo", "1 cucharada de semillas de mostaza", "Vinagre de 900 ml / 1½ pinta (sidra o malta)", "450 g / 1 libra de pasas", "1 cucharada de jengibre molido", "2 cucharaditas de sal", "Azúcar marrón suave 900g / 2lb"], "serves": "Rinde 2 a 3 pintas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Haga hervir las manzanas, cebollas, ajo, jugo de limón, semillas de mostaza y 590 ml / 1 pinta de vinagre.", "Cocine a fuego lento durante 1 hora.", "Agregue las pasas, el jengibre, la sal, el azúcar y el resto del vinagre.", "Cocine a fuego lento hasta que espese.", "Vierta en frascos de mermelada calientes y limpios y cubra como de costumbre. Almacene por 6-8 semanas para permitir que se desarrollen los sabores."]}, {"isVegetarian": true, "title": "Crumble de manzana y tomillo con crema de tomillo", "url": "www_bbc_co_uk_food_recipes_appleandthymecrumble_86496", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 2 oz de mantequilla, más extra para engrasar", "1.5kg / 3lb 4oz manzanas Bramley, peladas, sin corazón y cortadas en trozos", "4 cucharadas de azúcar en polvo", "6 ramitas de tomillo fresco de limón, solo hojas", "150g / 6oz de mantequilla", "Harina normal de 300g / 12oz", "150 g / 6 oz de azúcar en polvo", "200ml / 7fl de leche en oz", "Crema doble de 200 ml / 7 fl oz", "4 ramitas de tomillo fresco, solo hojas", "6 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno de crumble, caliente la mantequilla en una cacerola, agregue las manzanas, el azúcar y el tomillo de limón y cocine a fuego medio, revolviendo de vez en cuando, durante 5-8 minutos, o hasta que estén tiernos. Engrase un plato a prueba de horno y vierta la mezcla en el plato.", "Para la cobertura de crumble, frote la mantequilla y la harina juntas en un tazón grande hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar y mezcle bien, luego vierta la migaja sobre la mezcla de manzana.", "Transfiera al horno y hornee durante 15-20 minutos, o hasta que estén dorados y burbujeantes.", "Mientras tanto, para la crema pastelera, coloque la leche, la crema y el tomillo en una olla y cocine a fuego lento. Cocine a fuego lento durante cinco minutos para infundir el sabor del tomillo.", "Coloque las yemas de huevo y el azúcar en un bol y mezcle. Vierta la leche tibia en la mezcla de huevo y revuelva bien, luego regrese la mezcla a la sartén y cocine suavemente hasta que espese.", "Para servir, coloca una cucharada de crumble en cada una de las seis placas y vierte sobre la crema de tomillo."]}, {"isVegetarian": false, "title": "Ensalada de manzana, tocino y morcilla con aderezo gribiche", "url": "www_bbc_co_uk_food_recipes_applebaconandblackpu_70513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manzana, sin corazón y cortada en rondas", "8 lonchas de tocino rayado", "puñado de hojas mixtas", "8 rebanadas de morcilla", "4 huevos de codorniz", "2 cucharaditas de alcaparras", "2 cucharaditas de pepinillos, finamente picados", "2 cucharaditas de vinagre balsámico", "1 cucharada de aceite de oliva", "2 cucharaditas de cebolla roja, finamente picada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fríe la manzana, el pudín negro y las lonjas de tocino.", "Luego coloque la manzana en un plato y cubra con hojas, morcilla, tocino y luego más morcilla.", "Por último, freír los huevos de codorniz y colocar encima de la ensalada en capas.", "Para hacer el aderezo mezcle las alcaparras, los pepinillos, el vinagre balsámico, el aceite de oliva y la cebolla roja y rocíe sobre la ensalada de manzana, tocino y morcilla."]}, {"isVegetarian": true, "title": "Muffins de manzana y caramelo", "url": "www_bbc_co_uk_food_recipes_appleandtoffeemuffin_86119", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appleandtoffeemuffin_86119_16x9.jpg", "ingredients": ["2 huevos de gallinas camperas, ligeramente golpeados", "80g / 2¾oz de azúcar en polvo", "240ml / 8½ fl oz de leche", "100 g / 3½ oz de mantequilla, derretida", "Harina normal 300g / 10½ oz", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "Pizca de canela", "2 comiendo manzanas, peladas, sin corazón, finamente picadas", "200 g / 7oz de piezas de toffee comprados en la tienda"], "serves": "Hace 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 190 ° C / 380 ° F / Gas 5 y alinee una lata para muffins de 12 hoyos con cajas de papel.", "Mezcle los huevos, el azúcar, la leche y la mantequilla derretida en un tazón grande. Tamiza la harina, el polvo de hornear, la sal y la canela en el tazón. Revuelva bien para combinar.", "Agregue la manzana picada y mezcle ligeramente.", "Usando la mitad de la mezcla, llene cada una de las cajas de muffins con la mezcla y cubra con algunos trozos de caramelo. Cubra con el relleno restante para que las cajas estén medio llenas.", "Hornee durante 30-35 minutos hasta que estén bien dorados. Transfiera a una rejilla para enfriar. Sirve caliente o frío."]}, {"isVegetarian": true, "title": "tarta de manzana", "url": "www_bbc_co_uk_food_recipes_applecake_90046", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecake_90046_16x9.jpg", "ingredients": ["330ml / 11½fl oz de sidra francesa", "Harina normal 300g / 10½ oz", "2 cucharaditas de bicarbonato de soda", "1 cucharadita de polvo de especias mezclado", "1 cucharadita de canela molida", "pizca de nuez moscada recién rallada", "4 manzanas, peladas, sin núcleo, ralladas", "150g / 5oz azúcar moreno oscuro", "150g / 5oz de mantequilla derretida", "2 huevos de gallinas camperas", "200 g / 7 oz de sultanas doradas", "Pacanas de 100g / 3½oz, picadas", "250g / 9oz de mascarpone", "salpicaduras doble crema", "1 cucharadita de canela molida"], "serves": "Sirve 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Coloque la sidra en una sartén a fuego alto. Llevar a ebullición y cocinar hasta que se reduzca en dos tercios.", "Tamiza la harina común, el bicarbonato de soda, el polvo de especias mezclado, la canela y la nuez moscada en un bol.", "En un recipiente aparte, mezcle las manzanas con el azúcar y la mantequilla.", "Agregue los huevos y la sidra reducida a la mezcla de manzana y mezcle bien.", "Agregue la mezcla de harina especiada a la mezcla de manzana y mezcle bien.", "Agregue las pasas sultanas y las pacanas y dóblese para combinarlas.", "Con una cuchara, mezcle la torta en una lata de torta en forma de resorte de 20 cm / 8 pulgadas y hornéela en el horno durante 45-60 minutos, o hasta que la brocheta salga limpia cuando se la empuje hacia el centro de la torta. Coloque la torta en una rejilla y déjela enfriar.", "Para la crema de mascarpone, mezcle el mascarpone, la crema y la canela en un tazón.", "Para servir, coloque rebanadas de pastel en los platos y coloque la crema de mascarpone al lado."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_applecharlotte_81084", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecharlotte_81084_16x9.jpg", "ingredients": ["175g / 6oz de mantequilla", "120 g / 4½ oz de azúcar en polvo", "1 kg / 2¼ lb de manzanas para cocinar, peladas, sin corazón y picadas", "4 cucharadas de mermelada de albaricoque suave", "12 rebanadas de pan blanco, cortezas eliminadas y descartadas", "flan, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una sartén grande, derrita 25 g / 1 oz de la mantequilla. Agregue el azúcar y las manzanas, luego ponga la tapa y cocine a fuego lento durante unos 10 minutos, revolviendo ocasionalmente.", "Retire la tapa y cocine durante 5-10 minutos más hasta que las manzanas se descomponen, pero aún con algunos trozos de textura. Agregue la mermelada de albaricoque y deje enfriar.", "Mientras tanto, derrita la mantequilla restante en una olla. Corta las rebanadas de pan por la mitad, y luego por la mitad otra vez en tiras. Sumerja cada pedazo de pan en la mantequilla derretida y forre un molde grande (use un cortador redondo para el fondo del molde; puede usar moldes individuales o uno grande).", "Una vez que el molde esté completamente forrado, espolvoree el puré de manzana y cubra con otra ronda de pan que se haya sumergido en mantequilla derretida. Coloque en el horno durante 30 minutos, o hasta que estén dorados en la parte superior.", "Retirar del horno y dejar enfriar un poco. Cuidadosamente salga y sirva inmediatamente con flan."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_applecharlotte_88965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg / 2¼ lb de manzanas para cocinar, peladas, sin corazón y en rodajas", "1 limón, cáscara y jugo solamente", "2-3 cucharadas de azúcar morena clara", "½ cucharadita de canela molida", "8-10 rebanadas de pan integral de buena calidad, sin costras", "50g / 2oz de mantequilla, derretida, más extra para engrasar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque las manzanas, la ralladura de limón y el jugo, el azúcar y la canela en una cacerola de base pesada a fuego medio. Cubra y traiga a fuego lento. Cocine a fuego lento, revolviendo con frecuencia, hasta que las manzanas se rompan y se ablanden.", "Retire la tapa, aumente el fuego a un nivel alto y golpee las manzanas vigorosamente hasta que todo el líquido se haya evaporado y las manzanas hayan formado un puré suave.", "Cepille las rebanadas de pan en ambos lados con la mantequilla derretida.", "Engrase ligeramente un molde para pastel redondo de 15 cm / 6 pulgadas de diámetro y forme la base y los lados con tres cuartas partes del pan, superponiendo las rebanadas para que no haya espacios y asegurándose de que el pan esté ligeramente más alto que el borde del molde.", "Con una cuchara, coloca el puré de manzana en la lata y cúbrelo con las rebanadas de pan restantes, superponiendo las rebanadas para que no queden huecos. Dobla hacia abajo el pan que recubre los lados de la lata y presiona hacia abajo sobre la tapa del pan para sellar.", "Transfiera al horno y hornee por 30 minutos o hasta que estén doradas. Retire del horno y deje enfriar un poco. Servir."]}, {"isVegetarian": true, "title": "Charlottes de manzana con crema de tomillo", "url": "www_bbc_co_uk_food_recipes_applecharlottes_84742", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1lb 2oz de manzanas Cox, peladas, sin corazón, más o menos picadas", "60 g / 2½ oz de azúcar en polvo", "½ limón, solo jugo", "2 cucharadas de mermelada de albaricoque", "3 cucharadas de agua", "75g / 3oz de mantequilla", "10 rebanadas de pan blanco, sin costras", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl de leche en oz", "2 ramitas de tomillo fresco", "6 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "crema doble, ligeramente azotada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Coloque las manzanas, el azúcar, el jugo de limón, el atasco de albaricoque y el agua en una cacerola junto con 25 g / 1 oz de la mantequilla. Llevar a ebullición, luego reduzca el fuego a fuego lento, hasta que la manzana esté tierna y ligeramente caramelizada.", "Mientras tanto, derrita la mantequilla restante de 50 g / 2 oz en una cacerola a fuego medio.", "Corta las rebanadas de pan por la mitad, luego corta cada mitad en cuatro rebanadas para hacer los dedos pequeños. Sumerja cada dedo del pan en la mantequilla derretida y colóquelo en cuatro moldes a prueba de horno para revestir el borde interior y la base, reservando algunos dedos de pan para la tapa.", "Una vez que cada molde esté alineado, coloque la mezcla de manzana en la parte superior y cubra con más dedos de pan mojados en la mantequilla derretida.", "Coloque los moldes en una bandeja para hornear y transfiera al horno para hornear durante 25-30 minutos, o hasta que estén dorados en la parte superior.", "Mientras tanto, para la crema pastelera, coloque la crema, la leche y el tomillo en una cacerola a fuego lento y llévelos al punto de escaldadura, luego cocine a fuego lento muy suavemente durante 5-6 minutos para infundir los sabores.", "Coloque las yemas de huevo y el azúcar en un tazón limpio y mezcle.", "Vierta la mezcla de leche y crema con infusión de tomillo sobre los huevos y revuelva vigorosamente, luego regrese a la cacerola y coloque a fuego lento a fuego lento, revolviendo continuamente, hasta que la crema se espese. Cuele en un tazón limpio para quitar el tomillo.", "Retire los charlottes del horno y deje que se enfríen un poco, luego con cuidado, délos en las placas.", "Para servir, cubra los charlottes con crema batida y coloque una cucharada de crema alrededor del plato."]}, {"isVegetarian": true, "title": "Creppes de manzana con calvados", "url": "www_bbc_co_uk_food_recipes_applecrepeswithcalva_66224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 50g / 2oz", "Harina de alforfón 25g / 1oz", "1 cucharadita de canela molida de nivel", "2 huevos", "1x200ml tina de crema fresca", "1 gran manzana Granny Smith", "2 cucharadas de calvados", "50g / 2oz de mantequilla derretida", "azúcar glas", "2 cucharadas de calvados", "crema doble, bien fría"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Comience por pelar y descorazonar la manzana, luego córtela en cuartos y rallarla en el lado grueso del rallador en un recipiente. A continuación, mezcle la manzana rallada en 2 cucharadas de calvados y déjela a un lado durante 10 minutos.", "Mientras tanto, tamiza la harina, la harina de alforfón y la canela en un bol. Luego, en un tazón o jarra por separado, mezcle los huevos y la crema fría juntos, luego bata gradualmente en la mezcla de harina con un batidor de mano eléctrico hasta que tenga una masa suave y sin grumos. Luego agrega la manzana y los calvados.", "Antes de hacer los panqueques, coloque un plato grande en un horno tibia o en un cajón calentador para que, mientras los haga, se puedan calentar y cubrir con papel de aluminio.", "Para hacer los panqueques, derrita la mantequilla en la sartén y luego colóquela en una taza. Para hacer su primer panqueque, caliente la sartén a fuego medio hasta que esté realmente caliente, use 1 cucharada de la mezcla para hacer cada panqueque, cocínelo hasta que quede crujiente en los bordes y tenga un precioso color dorado debajo, luego, usando una espátula o paleta, gire la crepe y cocine el otro lado hasta que esté crujiente y dorado (esto debería tomar aproximadamente 45 segundos en cada lado).", "Retire la crepe a un plato caliente. Use un trozo de papel de cocina para lubricar la sartén otra vez con mantequilla derretida, luego continúe cocinando los panqueques hasta que toda la masa esté agotada. Cuando esté listo para servir los panqueques, transfiéralos a platos calentados, dándole a cada persona tres o cuatro, ligeramente espolvoreados con azúcar en polvo. Luego combine la crema y los calvados, ponga un poco de cada porción y dele el resto por separado. Para una ocasión especial, puede flamearlos dejándolos amontonados en un plato grande, espolvorearlos con azúcar en polvo y luego calentar 3 cucharadas de Calvados en una sartén pequeña, encenderlo con un fósforo y verter los calvados en llamas sobre los panqueques. Cuando la llama se haya apagado, sirva a cada persona tres o cuatro panqueques con crema para servir, servidos por separado."]}, {"isVegetarian": true, "title": "Tarta de sidra de manzana con mascarpone", "url": "www_bbc_co_uk_food_recipes_applecidercakewithma_84141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["330ml / 11½fl oz de sidra de buena calidad", "300g / 10½ oz de harina común", "2 cucharaditas de bicarbonato de sodio", "1 cucharadita de especias mixtas", "1 cucharadita de canela", "pizca de nuez moscada rallada", "150g / 5oz azúcar moreno oscuro", "150g / 5oz de mantequilla derretida", "4 manzanas (Cox o Russet), peladas y ralladas", "2 huevos de gallinas camperas", "200 g / 7 oz de sultanas doradas", "100g / 3½oz de nueces picadas", "250g / 9oz de mascarpone", "salpicaduras de crema", "1 cucharadita de canela molida"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una sartén, hierva la sidra hasta que haya reducido el volumen en dos tercios. Deja enfriar.", "Tamiza la harina, bicarbonato de sodio, especias mixtas, canela y nuez moscada en un tazón.", "En un recipiente aparte, unte el azúcar y la mantequilla y agregue la manzana rallada. Agregue el huevo y reduzca la sidra y mezcle bien.", "Vierta la mezcla húmeda en los ingredientes secos y doble las pasas y sultanas.", "Cuchara en una lata de torta en forma de resorte engrasada de 20cm / 8in y hornea por 45-60 minutos hasta que quede elástica al tacto y una brocheta insertada en la torta salga limpia. Enfriar antes de girar cuidadosamente hacia un plato.", "Para la crema de mascarpone, mezcle el mascarpone, la crema y la canela molida.", "Sirva una porción del pastel con una cucharada de crema de canela."]}, {"isVegetarian": true, "title": "Crumble de manzana de Nigel Slater", "url": "www_bbc_co_uk_food_recipes_applecrumble_89166", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecrumble_89166_16x9.jpg", "ingredients": ["1kg / 2lb 3½oz de manzanas Bramley", "pellizcar azúcar, al gusto", "1 cucharada de agua o jugo de manzana", "Harina normal de 100 g / 3½ oz", "75 g / 2½ oz de mantequilla", "50g / 2oz de avena", "Azúcar demerara 100 g / 3½ oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Limpie las manzanas y córtelas en cuartos, luego quite los núcleos y corte cada pieza en dos. Póngalos en una sartén, pruebe una rebanada de dulzura y agregue una pizca de azúcar en consecuencia. Agregue una cucharada de agua o jugo de manzana y cocine a fuego medio durante unos cinco minutos, hasta que las manzanas comiencen a ablandarse.", "Transfiera la mezcla de manzana a un plato de pastel para horno poco profundo.", "Mezcle la harina y la mantequilla en un procesador de alimentos durante unos segundos, hasta que la mezcla se vea como pan rallado.", "Agregue la avena y el azúcar moreno y espolvoree sobre las manzanas cocidas en el plato de tarta. Transfiera al horno para hornear durante 30 minutos o hasta que esté crujiente y dorado en la parte superior."]}, {"isVegetarian": true, "title": "migas de manzana", "url": "www_bbc_co_uk_food_recipes_applecrumble_2971", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applecrumble_2971_16x9.jpg", "ingredients": ["Harina normal de 300 g / 10½ oz, pizca de sal tamizada", "175g / 6oz de azúcar moreno sin refinar", "200 g / 7 oz de mantequilla sin sal, en cubos a temperatura ambiente", "Botón de mantequilla para engrasar", "Manzanas de 450 g / 1 lb, peladas, sin corazón y cortadas en piezas de 1 cm / ½ en", "50g / 2oz de azúcar morena sin refinar", "1 cucharada de harina normal", "1 pizca de canela molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la harina y el azúcar en un tazón grande y mezcle bien. Tomando unos cubos de mantequilla a la vez frote en la mezcla de harina. Siga frotando hasta que la mezcla se asemeje a pan rallado.", "Coloque la fruta en un tazón grande y espolvoree sobre el azúcar, la harina y la canela. Revuelva bien teniendo cuidado de no romper la fruta.", "Unte con mantequilla un plato a prueba de horno de 24cm / 9in. Con una cuchara, vierta la mezcla de fruta en el fondo, luego espolvoree la mezcla de crumble encima.", "Hornee en el horno durante 40-45 minutos hasta que el crumble esté dorado y la mezcla de fruta burbujee.", "Sirva con crema espesa o natillas."]}, {"isVegetarian": true, "title": "Chutney de manzana, jengibre y jengibre", "url": "www_bbc_co_uk_food_recipes_appledateandgingerch_67595", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg / 3lb de manzanas Bramley", "2 dientes de ajo, muy finamente rebanados", "250ml / 8fl oz de vinagre de sidra", "Azúcar granulada 750g / 1½lb", "250g / 9oz de fechas empedradas, finamente picadas", "100g / 4oz sultanas", "50 g / 2 oz de jengibre fresco, pelado y rallado", "½ cucharadita de sal", "½ cucharadita de pimienta de Jamaica molida", "pizca de pimienta de cayena"], "serves": "Rinde 1,5 litros / 2½ pinta", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Pelar, cortar y cortar finamente las manzanas. Coloque en una sartén grande con el ajo y el vinagre. Cocine suavemente hasta que las manzanas se hayan descompuesto en un puré espeso. Agregue el azúcar, dátiles, sultanas, jengibre, sal y especias. Cocine por 20-25 minutos, revolviendo ocasionalmente.", "Cuchara en tarros calientes, esterilizados y conservadores de vidrio con pinzas. Para disfrutar de la salsa picante en su mejor momento, almacene en un lugar fresco, oscuro y seco durante aproximadamente 2-3 semanas antes de comer. Esto permite que los sabores maduren. Una vez que se haya abierto un tarro, guárdelo en el refrigerador y coma dentro de 1 mes."]}]