[{"isVegetarian": true, "title": "Black olive polenta with field mushrooms", "url": "www_bbc_co_uk_food_recipes_blackolivepolentawit_92626", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/1 pint 7fl oz boiling water", "pinch salt", "200g/7oz fine quick-cook polenta", "100g/3½oz black olives, finely chopped ", "salt and freshly ground black pepper", "1-2 tbsp olive oil", "150g/5½oz unsalted butter ", "1 garlic clove, crushed to a paste with the edge of a knife", "450g/1lb assorted wild and field mushrooms, brushed clean, rinsed well, roughly chopped", "½ lemon, zest and juice", "1 tbsp chopped fresh thyme leaves", "parmesan shavings, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the water to the boil and add a pinch of salt. Pour in the polenta, stirring well. Reduce the heat until the water is just bubbling and continue to cook, stirring well, for 4-5 minutes, or until the polenta has absorbed all of the water and is smooth and thick.", "Stir in the chopped olives and season, to taste, with salt and freshly ground black pepper.", "Line a baking tray with a sheet of baking paper and spread the polenta mixture onto it in an even layer. Set aside until the polenta has set and is completely cool.", "When the polenta has cooled and set, cut it into 10cm/4in squares. Brush each square on both sides with a little of the olive oil.", "Heat a griddle pan over a medium heat. When the pan is hot, add the polenta squares, in batches if necessary, and cook for 2-3 minutes on each side, or until golden-brown griddle marks have appeared on both sides and the polenta is warmed through. Remove the griddled polenta squares from the pan and keep warm. Repeat the process with the remaining polenta squares.", "Meanwhile, heat the remaining oil and the butter in a frying pan over a medium heat. Add the garlic and mixed mushrooms and fry for 3-4 minutes, or until browned. ", "Add the lemon juice, lemon zest and thyme and stir well to combine.", "To serve, place one square of griddled polenta into the centre of each of six serving plates. Spoon the field mushrooms and pan juices over the polenta square. Garnish each serving with a few parmesan shavings."]}, {"isVegetarian": false, "title": "Black pepper chicken (Murgh kali mirch) with seasoned potato and cauliflower (Aloo gobhi)", "url": "www_bbc_co_uk_food_recipes_blackpepperchickenmu_74040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "1 tsp peeled and finely grated root ginger", "2 garlic cloves, crushed", "¼ tsp salt", "1 tsp coarsely ground black pepper", "1 tsp ground white pepper", "6 chicken breasts, boneless and skinless, cut into bite-sized pieces", "1 medium onion, finely chopped", "2 fresh green chillies, slit lengthways", "1 tsp lemon juice", "30g/1oz coriander leaves, chopped", "2 tbsp vegetable or groundnut oil", "1 large Spanish onion, finely chopped", "2 green finger chillies, finely chopped", "2 garlic cloves, finely chopped", "300g/10½oz white potatoes, peeled and cut into 2cm (¾in) cubes", "200g/7oz cauliflower florets, cut into 4cm (1¾in) pieces", "1 tsp turmeric", "¼ tsp ground cumin", "¼ tsp ground coriander", "½ tsp salt", "¼ tsp garam masala", "1 tbsp butter or ghee", "1 tsp peeled and finely grated root ginger"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the chicken, mix together one tablespoon of oil, the ginger, garlic, salt and black and white peppers, and rub the mixture into the chicken pieces. ", "Cover and refrigerate for 30 minutes.", "Heat the remaining oil in a wok and fry the onion for two minutes. ", "Add the marinated chicken pieces and gently stir-fry for 10 minutes. ", "Add the chillies and 200ml (7fl oz) boiling water, cover and simmer for 10 minutes, until chicken is cooked. ", "Stir in the lemon juice and sprinkle over the coriander leaves. ", "To make the potato and cauliflower, heat the oil in a frying pan and add onions, chillies, garlic and potatoes. Fry for seven minutes or until the onion is deep yellow and translucent.", "Add the cauliflower and fry for a further three minutes until brown.", "Add the turmeric, cumin, coriander, and salt and garam masala. Stir and fry for five minutes.", "Add butter and mix, then add five tablespoons of cold water, cover and simmer for five minutes. Stir in ginger. ", "Serve with the chicken."]}, {"isVegetarian": false, "title": "Black pudding and mash cakes", "url": "www_bbc_co_uk_food_recipes_blackpuddingandmashc_83005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz potatoes, peeled and roughly chopped", "1 cooking apple such as Bramley or Granny Smith, peeled, quartered and cored", "1 tbsp butter ", "salt and freshly ground black pepper", "500g/1lb 2oz black pudding, skin removed", "1 tbsp grated cheddar ", "4 tbsp tiny salad greens, tossed in olive oil", "80ml/3fl oz double cream", "2 tbsp grain mustard", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes and the apple in boiling salted water for 20 minutes. Drain well and mash with the butter, salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6. ", "Mash the black pudding with a fork and gently fry in a hot pan for two minutes, turning, until crisp.", "Place an oiled ring mould measuring 8cm/3¼in wide by 6cm/2½in high on a baking tray lined with greaseproof paper, and arrange a layer of black pudding at the base, pressing down gently. ", "Top with a layer of mash, then repeat, finishing with a layer of potato. ", "Gently remove the mould and repeat until you have four cakes.", "Scatter with cheese and bake for 15 minutes to heat through. Finish under a hot grill if not golden brown. ", "For the sauce, gently heat the cream, mustard, salt and freshly ground black pepper, stirring frequently.", "Transfer the cakes to warm plates, top with the salad greens, and serve with the mustard sauce."]}, {"isVegetarian": false, "title": "Black pudding with scallops and shrimp butter, with pea and radish shoot salad", "url": "www_bbc_co_uk_food_recipes_blackpuddingwithscal_89483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oranges, juice only", "muscle trimmings from 3 scallops (see below)", "15g/½oz caster sugar", "3 tbsp shrimps", "salt and freshly ground black pepper", "25g/1oz butter", "¼ tsp ground mace", "¼ tsp ground paprika", "2 tbsp plain flour", "salt and freshly ground black pepper", "3 thick slices ready-made black pudding", "1 tbsp olive oil", "3 scallops, coral and muscle removed", "salt and freshly ground black pepper", "1 tbsp olive oil", "15g/½oz butter", "½ orange, juice only", "½ lemon, juice only", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 small handful fresh pea shoots ", "1 small handful fresh purple radish sprouts", "3 fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the shrimp butter, place the orange juice and scallop muscles in a small saucepan and bring to the boil. Skim off any foam, then stir in the sugar. ", "Blend two tablespoons of the shrimps in a food processor to form a paste, then add this to the pan with the orange juice, and continue to heat for a further 2-3 minutes. Pass the sauce through a sieve to remove the scallop muscles, return the liquid to the pan, and season to taste with salt and freshly ground black pepper. ", "Stir in the butter and the remaining tablespoon of shrimps and continue cooking for 1-2 minutes until the butter has melted and the shrimps have warmed through.", "For the black pudding, combine the mace, paprika, flour and seasoning in a bowl and press the black pudding slices into this mixture to coat, shaking off any excess. Heat the oil in a frying pan over a medium heat and fry the coated black pudding for 2-3 minutes on each side. ", "For the scallops, season the scallops with salt and freshly ground black pepper. Heat the oil and butter in a separate frying pan over a high heat. When the butter is foaming, add the scallops and cook for 1-2 minutes on each side, or until they are golden brown and crisp.", "For the pea and radish shoot salad, mix the orange and lemon juice, olive oil and seasoning in a bowl until well combined. Add the pea shoots and radish sprouts and toss them in the vinaigrette to coat. ", "To serve, pile the shoot salad onto a serving plate and alternate the scallops and black pudding slices around the edge of the plate. Drizzle the shrimp butter over the scallops and black pudding, then garnish with fresh chives."]}, {"isVegetarian": false, "title": "Black pudding-stuffed lamb with minted broad beans", "url": "www_bbc_co_uk_food_recipes_blackpuddingstuffedl_89938", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 7-bone rack of lamb, bones removed, but flap of skin reserved (ask your butcher to prepare the lamb)", "350g/12oz piece black pudding", "2 tbsp olive oil", "150g/5oz mini black puddings", "75g/3oz butter", "400g/14oz broad beans (shelled weight)", "175ml/6fl oz double cream", "4 sprigs fresh mint, leaves only", "salt and freshly ground black pepper ", "150ml/5fl oz red wine", "150ml/5fl oz beef stock", "25g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb, place the lamb onto a board, skin-side down. Place the black pudding along the length of the lamb fillet, then wrap the skin over the top, to form a roll. Secure the stuffed lamb at intervals with kitchen string.", "Heat an ovenproof frying pan until hot, then add half of the olive oil and the stuffed lamb. Fry for one minute on all sides, until browned all over.", "Turn the lamb skin-side up and roast in the oven for 18-20 minutes, or until cooked to your liking. Remove from the oven and rest for 5-10 minutes.", "Meanwhile, heat a frying pan until hot. Add the remaining olive oil and the mini black puddings and fry for 2-3 minutes, or until browned all over and completely cooked through. Remove from the pan and set aside.", "For the broad beans, heat a separate pan until hot, then add the butter and the broad beans and fry for two minutes, stirring regularly.", "Add the cream and mint and bring to the boil, then reduce the heat to a simmer for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper and mash lightly with a fork.", "For the sauce, place the red wine into a separate pan over a medium heat and bring to the boil. Reduce the heat and simmer until the liquid is reduced by half.", "Add the stock and continue to simmer until the liquid is reduced by half.", "Add the butter and season, to taste, with salt and freshly ground black pepper.", "To serve, slice the stuffed lamb into 12 slices of equal thickness. Spoon the minted broad bean mixture into the centre of each plate and top each portion with three slices of the stuffed lamb.", "Crumble the mini black puddings, then sprinkle around the edge of each plate. Spoon the red wine sauce over the stuffed lamb and around the plate."]}, {"isVegetarian": false, "title": "Black sea bass fillet with spicy broccoli rice", "url": "www_bbc_co_uk_food_recipes_blackseabassfilletwi_87434", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz basmati rice", "1 tbsp vegetable oil", "1 fresh red chilli, finely chopped", "100g/3½oz broccoli florets", "2 tbsp chopped fresh parsley", "1 tbsp soy sauce", "1 tbsp vegetable oil", "1 sea bass fillet", "2 tbsp balsamic vinegar", "1 tsp sesame seeds", "1 tsp clear honey", "1 tbsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spicy broccoli rice, cook the rice in boiling salted water, according to packet instructions. Drain. ", "Heat the vegetable oil in a frying pan. Add the chilli and broccoli and stir-fry for 2-3 minutes. Add the cooked rice, parsley and soy sauce and stir together. Spoon the rice onto a serving plate and keep warm.", "For the sea bass, heat the oil in another frying pan. Place the sea bass fillet into the pan, skin-side down, and fry for three minutes. Add the balsamic vinegar, sesame seeds and honey. Turn the fish over and cook for another 2-3 minutes, or until the fish is completely cooked through.", "To serve, place the sea bass on the plate next to the rice and sprinkle over the chopped fresh chives."]}, {"isVegetarian": false, "title": "Black spaghetti with white wine, crayfish and tomato sauce", "url": "www_bbc_co_uk_food_recipes_blackspaghettiwithwh_85271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, peeled", "2 spring onions, finely chopped", "5 prawn heads and shells", "75ml/2½fl oz white wine", "1 tsp tomato purée", "1 tsp tomato ketchup", "100ml/3½fl oz boiling water", "125ml/4fl oz double cream", "1 spring onion, chopped", "1 tomato, chopped", "300g/10½oz black (squid ink) spaghetti, cooked according to packet instructions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crayfish stock, put the garlic, spring onions, prawn heads and shells, white wine, tomato purée, ketchup and water into a medium saucepan; place on the heat and boil for eight minutes. Strain over a bowl, reserving the stock and discarding the shells and vegetables.", "For the pasta sauce, pour the strained stock back into the pan, add the cream and spring onion and cook over a medium heat for two minutes. Stir in the tomato.", "To serve, put the spaghetti into two pasta bowls and top with the sauce."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_9139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5g/1/8oz yeast", "125ml/4fl oz warm milk", "75g/2¾oz buckwheat flour ", "1 egg, separated", "Pinch of salt", "oil, to cook"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the yeast in half the milk. Put the flour in a bowl and make an indentation in the centre. Whisk in the yeast and milk mixture and leave to stand somewhere warm for 45 minutes.", "After this time slightly warm the remaining milk and whisk in the egg yolk. Add to the previous mixture and mix in well, then leave to rest for another 45 minutes.", "Beat the egg white until stiff and fold into mixture.", "Very lightly oil a large frying pan and heat gently. Add small spoonfuls of the blini mixture and cook gently for about 1-2 minutes on each side, until lightly golden."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_76", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["280g/10oz strong white flour", "180ml/6fl oz milk", "1 tbsp dried yeast", "2 eggs, separated", "300ml/10fl oz double cream", "1 tsp salt", "30g/1oz butter for frying"], "serves": "Makes 8-10 blinis", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the milk in a saucepan until lukewarm. Pour on to the yeast and leave for 10 minutes until the mixture is frothy.", "Sift the flour and salt into a large bowl. Mix the eggs yolks, cream and yeast mixture into the flour.  Set the batter aside for approximately 1 hour, until it has doubled in size.", "Whisk the egg whites until they form soft peaks and fold into the batter.  Add a little more milk, if necessary, so that the batter is of a thick pouring consistency.", "Heat the butter in a frying pan over a medium heat.  When it is hot, spoon small amounts of batter into the pan.", "Fry the blinis until they are golden brown on both sides and serve at once."]}, {"isVegetarian": true, "title": "Blinis", "url": "www_bbc_co_uk_food_recipes_blinis_3759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blinis_3759_16x9.jpg", "ingredients": ["12.5g/½oz yeast", "350g/12oz plain flour, sifted", "285ml/½ pint milk, lukewarm", "2 free-range egg yolks", "a pinch of salt", "145ml/¼ pint milk, tepid", "2 free-range egg whites, whisked"], "serves": "Makes approx 32", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Make a thin paste out of the yeast and 225g/8oz of the sifted flour diluted with the lukewarm milk.", "Leave this paste to ferment for two hours in a warm room atmosphere, and then add the rest of the flour (115g/4oz), the egg yolks, a pinch of salt, the tepid milk and mix together without letting it acquire any body. Finally add the whisked egg whites.", "Let the preparation ferment for half an hour, and when about to serve, cook the blinis quickly in the same way as pancakes, in special little omelette pans. Dish them up very hot on a napkin."]}, {"isVegetarian": false, "title": "Black treacle brushed pork, crushed butterbeans and Devon cider apple sauce", "url": "www_bbc_co_uk_food_recipes_blacktreaclebrushedp_93568", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz dried butterbeans", "2 tbsp white wine vinegar", "35g/1¼oz cold diced butter", "salt and freshly ground black pepper", "400g/14oz pork tenderloin fillet, fully trimmed ", "2 tbsp olive oil", "1 garlic clove, peeled, lightly crushed", "knob of butter", "3 tbsp black treacle", "150ml/5floz dry Devon cider, such as Ashridge", "275ml/10fl oz beef stock", "2 tbsp apple sauce or apple purée", "1 Braeburn apple, peeled, core removed, chopped", "35g/1¼oz butter"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the beans, place the butterbeans into a stainless steel bowl, cover with plenty of water and leave to soak overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Drain the soaked beans, and rinse with fresh water then place into a large saucepan and add enough fresh water to just cover the beans. Place on the heat, bring to the boil then reduce the heat and cook for 20-25 minutes, or until just softened (do not add any salt at this stage as this well make the beans tough).", "Drain the beans and blend in a food processor with the vinegar and butter to form a firm paste (alternatively crush with a fork and mix well with a wooden spoon.) Season to taste with salt and freshly ground black pepper, and place in a saucepan ready to be warmed up just before serving.", "For the pork, season the pork fillet with salt and black pepper then lightly cover in half the olive oil. Heat a large non-stick ovenproof pan on the hob until hot, then add the pork fillet and sear for a few minutes, turning every so often until the fillet is coloured on each side.", "Add the crushed garlic and a knob of the butter to the pan and baste the fillet, then place into the oven for 8-10 minutes, turning half way through cooking, until the pork is cooked through. The pork is cooked if the juices run clear when a skewer inserted into the thickest part of the fillet.", "Meanwhile, for the apple sauce, put the cider into a saucepan and bring to the boil. Cook for 3-4 minutes, or until the volume of liquid is reduced by half.", "Add the stock, bring to the boil and cook for 5 minutes, or  until the volume of liquid has reduced by half again. Add the apple sauce, chopped apple and butter and stir to combine. Season, to taste, with salt and freshly ground black pepper.", "Place the treacle into a small saucepan and warm through over a low heat.", "Remove the pork from the oven, discard the garlic and pour over the warm treacle. Set the pork aside to rest for a few minutes.", "To serve, warm the butterbeans through and divide between 2 plates. Slice the pork and fan half the slices over each serving of beans, then drizzle over the apple and cider sauce."]}, {"isVegetarian": false, "title": "Blinis with smoked salmon pâté, mackerel and a beetroot and shallot pickle", "url": "www_bbc_co_uk_food_recipes_blinis_with_smoked_06083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "7g instant yeast (one sachet)", "250ml/9 fl oz milk", "1 tsp salt", "1 tsp sugar", "2 free-range egg whites", "50g/1¾ oz butter", "175g/6 oz smoked salmon, roughly chopped", "75ml/2½ fl oz double cream", "50g/1¾ oz crème fraiche", "1 lemon, juice only", "salt and freshly ground black pepper", "½ bunch baby heritage beetroots, cleaned, small stalk left on", "75g/2¾oz unsalted butter", "200 ml white wine vinegar", "75g/2¾oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "2 banana shallots, thinly sliced", "4 mackerel fillets, filleted, pin boned, skin on", "250g/9oz crème fraîche", "2 tbsp chopped fresh chives/chervil", "4 tsp caviar (optional)"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the blinis, whisk together the flour, yeast, milk, salt and sugar. Set aside in a warm place to prove for an hour.", "Whisk the egg whites in a separate bowl until stiff peaks form when the whisk is removed. When the batter has proved fold in the egg whites.", "To cook the blinis, melt the butter in a large frying pan. Add a tablespoon of batter to the pan per blini and cook until golden-brown on the underside. Flip over and cook the other side. Remove the blini and place onto kitchen paper. Repeat until you have used all the batter. Keep the blinis warm until ready to serve.", "For the smoked salmon pâté, blend the smoked salmon, double cream and crème fraiche in a food processor to a fine purée.", "Season with salt, pepper and lemon juice then place in a bowl in the fridge until ready to serve. ", "For the beetroot and shallot pickle, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut in half. Melt the butter in a medium frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.", "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours.", "To serve, put the mackerel skin-side up on a heavy baking tray and use a chef's blow torch to char the skin. Season with salt and pepper.", "Place the blinis on the plate alongside the mackerel. Place the smoked salmon pâté on top of the blinis and the pickled beetroot and shallots on the side. Garnish with fresh chives/chervil, crème fraiche and caviar (if using)."]}, {"isVegetarian": true, "title": "Blinis with horseradish cream and roasted peppers", "url": "www_bbc_co_uk_food_recipes_bliniswithhorseradis_85969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/4oz buckwheat/wholewheat flour", "225g/4oz plain flour", "pinch salt", "2 free-range eggs, plus 2 free-range egg whites", "45g/1½oz fresh yeast", "2 tsp caster sugar", "700ml/1 pint 5fl oz warm milk", "1 tbsp melted butter", "vegetable oil, for frying", "4 red peppers, roasted, peeled, seeds removed", "225g/4oz soured cream", "1 tbsp creamed horseradish from a jar", "1 tbsp chopped fresh tarragon", "½ lemon, juice only", "12 black olives", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the blinis, sift the buckwheat (or wholewheat) flour and plain flour into a bowl and mix with a pinch of salt.", "Make a well in the centre of the flour mixture and add the two whole eggs and one of the egg whites. Whisk from the centre outwards to create a thick paste.", "In a separate bowl, combine the yeast, sugar and milk and leave to stand for a couple of minutes.", "Gradually pour the yeast mixture into the flour and egg mixture, whisking constantly, to make a smooth batter.", "Add the melted butter and stir well.", "Cover the bowl with clingfilm and leave in a warm place for one hour.", "Just before cooking the blinis, whisk the remaining egg white in a clean bowl until light, then fold into the batter.", "Heat a little oil in a frying pan over a medium heat. Pour enough batter into the pan to make a 10cm/4in diameter blini.", "When bubbles start to appear on the surface of the batter, turn the blini over and cook the other side. ", "Remove the blini from the pan and keep warm while you make the rest of the blinis in the same way.", "For the topping, slice the roasted red peppers into strips.", "Spoon the soured cream, horseradish, tarragon and lemon into a bowl and mix well.", "Spoon one tablespoon of the cream mixture onto each blini and top with some of the red pepper pieces.", "Top each blini with an olive and season with freshly ground black pepper."]}, {"isVegetarian": true, "title": "Blinis with poached egg and hollandaise", "url": "www_bbc_co_uk_food_recipes_bliniswithpoachedegg_83370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ready-made blinis", "2 free-range egg yolks", "½ lemon, juice only", "½ tsp white wine vinegar", "salt and freshly ground black pepper", "250g/9oz butter, melted in a pan", "50ml/2fl oz double cream", "50ml/2fl oz hot water", "500ml/18fl oz boiling water", "50ml/2fl oz white wine vinegar", "2 free-range eggs at room temperature", "1 tbsp finely chopped radish, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the blinis on a baking tray and bake for eight minutes in the oven.", "To make the hollandaise, place the egg yolks, lemon juice and vinegar in a food processor. Season with salt and freshly ground black pepper and blend together.", "Very slowly add the melted butter while blending.", "Slowly add the cream then the hot water in the same way.", "To make the poached eggs, simmer the water and vinegar in a saucepan. Swirl the water to create a whirlpool, then gently add the eggs and poach for three minutes. Remove with a slotted spoon.", "Serve two piles of blinis with a poached egg on each and some of the hollandaise spooned over. Garnish with chopped radish."]}, {"isVegetarian": true, "title": "Blood orange Halloween pumpkin pie", "url": "www_bbc_co_uk_food_recipes_blood_orange_halloween_70269", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blood_orange_halloween_70269_16x9.jpg", "ingredients": ["15g/½oz pecan nuts ", "170g/5¾oz plain flour, plus extra for dusting", "pinch salt", "75g/2½oz chilled unsalted butter, cut into cubes, plus extra for greasing", "3 large free-range eggs", "300g/10½oz pumpkin purée (available online and in the baking section of some large supermarkets)", "85g/3oz soft dark brown sugar", "1½ tsp ground cinnamon", "1½ blood oranges, zest of both and juice of one", "125g/4½oz evaporated milk", "2 pasteurised egg whites ", "115g/4oz caster sugar", "25g/1oz pecan nuts", "50ml/2fl oz blood orange juice (available in large supermarkets)", "100g/3½fl oz granulated sugar"], "serves": "Makes 1 20cm/8in pie", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put all the pecan nuts for the pastry and the meringue in a food processor and blend until fine. Weigh out 15g/½oz for the pastry and set aside the remainder.", "For the pastry, add the flour, salt and butter to the food processor. Tip in the pecan nuts and pulse until the ingredients are combined and resemble breadcrumbs. Add a tablespoon of cold water and pulse again. Keep adding more water a tablespoon at a time until the mixture comes together as a dough. ", "Tip out the dough onto a lightly floured work surface and knead lightly until smooth. Wrap in cling film and refrigerate for 10–15 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4. Grease a 20cm/8in pie dish.", "For the filling, lightly beat the eggs in a large mixing bowl. Add the pumpkin purée, sugar, cinnamon, orange zest and juice. Beat until combined. Pour in the evaporated milk and then blend everything together using a handheld blender. Set aside.", "Roll out the dough on a lightly floured work surface until 5mm/¼in thick. Line the pie dish with the pastry, taking care to push the pastry into the edges. Leave any excess overhanging and lightly prick the base using a fork (do not go through to the tin). Place on a baking tray.", "Cover the pastry with baking paper and fill with ceramic baking beads or uncooked rice. Bake on the middle shelf for 10 minutes or until the pastry is dry. Remove from the oven and trim any excess pastry so that they are no higher than the pie tin.", "Pour in the filling so that only 5mm/¼in of the pastry can be seen at the top.", "Increase the oven temperature to 200C/180C Fan/Gas 6. Bake the pie in the centre of the oven for 15 minutes. Turn the oven down to 160C/140C Fan/Gas 3 and bake for a further 30 minutes or until the filling is firm (a slight wobble in the centre is fine).", "For the meringue, put the egg whites in the bowl of a large freestanding mixer fitted with a whisk attachment (you can also use a mixing bowl and a hand mixer, but it is much easier and safer to add the syrup when you have both hands free). Place the sugar and 100ml/3½fl oz water in a saucepan. Place over a low heat and use a sugar thermometer to measure the temperature of the syrup. When the syrup mixture reaches 100C, begin whisking the egg whites.", "When the syrup reaches 116C, remove it from the heat. With the motor running, slowly pour the syrup down the side of the bowl into the mixer, taking care not to touch the whisk as it may splash.  Continue to whisk until shiny and stiff peaks form when the whisk is removed.", "Fold the reserved ground pecans into the meringue using a large metal spoon. ", "After baking, leave the pie to cool in the tin for 5 minutes. Spoon the meringue onto the pie and use a palette knife to smooth into a dome. Use a chef’s blowtorch to brown the top of the meringue.", "For the syrup, combine the orange juice and sugar in a saucepan and bring to the boil. Measure the temperature using a sugar thermometer and when it reaches 114C remove it from the heat. To decorate the pie, dip a fork into the caramel and carefully drizzle over the pie in a cross-hatch pattern (melted sugar is very hot – take care not to burn yourself).  Serve the pie warm."]}, {"isVegetarian": false, "title": "Steamed orange and cranberry pudding", "url": "www_bbc_co_uk_food_recipes_bloodorangeandcranbe_85041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz self-raising flour", "pinch baking powder", "150g/5oz butter, softened, plus extra for greasing ", "150g/5oz soft light brown sugar", "1 tbsp golden syrup", "3 free-range eggs", "1 tbsp dried cranberries", "1 orange, peeled and sliced into rounds", "100g/3½oz caster sugar", "175ml/6fl oz water", "1 tbsp orange marmalade", "1 tbsp cranberry jelly from a jar", "2 oranges, juice only", "double cream, whipped until stiff peaks form when the whisk is removed"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour and baking powder together into a bowl.", "In a separate bowl, beat the butter, sugar and syrup together. Add the eggs, one at a time, beating to incorporate well before adding the next egg. ", "Add the egg mixture to the bowl of flour and whisk well for two minutes, or until pale and light.", "Add the dried cranberries and fold in gently.", "For the sauce, place the sugar, water, marmalade, cranberry jelly and orange juice into a saucepan and heat gently to dissolve the sugar and marmalade. Bring to the boil and simmer gently for 5-10 minutes to form a thick syrup.", "Grease four ramekins and place a disk of greaseproof paper, cut to fit the ramekins, in the base of each. Spoon a little of the sauce into each ramekin, then sit a round of orange on top.", "Add the pudding mixture to almost fill the ramekins. Cover each ramekin with aluminium foil and transfer to a deep roasting tray. Half fill the tray with boiling water to create a bain-marie and transfer to the oven to bake for 20 minutes, or until the puddings have set.", "To serve, turn out the puddings onto plates and serve with a dollop of whipped cream."]}, {"isVegetarian": false, "title": "Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bloodymary_84135", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodymary_84135_16x9.jpg", "ingredients": ["2 ice cubes", "vodka, double shot", "½ lemon, juice only ", "6 dashes Worcestershire sauce", "3 dashes Tabasco sauce", "150ml/5fl oz tomato juice", "pinch salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ice into a tall glass and add the vodka.", "Add the lemon juice, Worcestershire sauce, Tabasco sauce and tomato juice. Stir well. ", "Adjust the seasoning, to taste, with salt and pepper and serve straightaway."]}, {"isVegetarian": false, "title": "Bloody Mary", "url": "www_bbc_co_uk_food_recipes_bloodymary_88974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40ml/1½fl oz vodka", "75ml/3fl oz tomato juice", "dash lemon juice", "½ tsp Worcestershire sauce", "2-3 drops Tabasco sauce", "salt and freshly ground black pepper", "handful ice cubes", "lime wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour all the ingredients, except for the lime wedges, into a cocktail shaker and shake well to mix. ", "Strain into a tall glass over ice cubes and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Bloody Mary shots", "url": "www_bbc_co_uk_food_recipes_bloodymaryshots_68098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint vodka, chilled", "250ml/9fl oz thin tomato juice, chilled", "1 lime, juice only", "2 tsp freshly grated horseradish", "1 tsp celery salt ", "a good shake of Tabasco ", "1 tbsp Worcestershire sauce ", "1 cucumber, peeled, sliced and very finely julienned", "1 tsp cracked black pepper", "10 shot glasses, chilled"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients for the shots together.  Keep refrigerated in a jug until ready to serve.", "To serve, place the glasses on a plate or tray pour some bloody mary mix into each one.  Finish with a little cucumber and a pinch of black pepper."]}, {"isVegetarian": false, "title": "Blow-torched mackerel with blini, warm pickled beetroot and chive crème fraîche", "url": "www_bbc_co_uk_food_recipes_blow_torched_mackerel_34721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/¼oz yeast", "10g/¼oz sugar", "300ml/10fl oz warm milk", "150g/5½oz flour", "75g/2¾oz buckwheat flour", "1 free-range egg, separated, plus 2 extra egg whites", "vegetable oil, for frying", "250g/9oz redcurrant jelly", "250ml/9floz red wine vinegar", "4 cloves", "75g/2¾oz Dijon mustard", "2 large cooked beetroot, peeled and diced", "200g/7oz crème fraîche", "1 bunch chives, finely chopped", "4 mackerel, filleted and pin boned", "rapeseed oil, for drizzling", "4 shallots, finely chopped", "1 tin Avruga caviar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the blini, mix the yeast, sugar, milk, flours and egg yolk together in a bowl to make a paste.", "Whisk the egg whites in a separate bowl until they form stiff peaks, then fold them into the yeast mixture. Cover the bowl and set aside at room temperature for 20 minutes. ", "Heat a frying pan until medium hot, add a little vegetable oil and small spoonfuls of the blini mixture.", "Cook the blini on each side until golden-brown then remove and drain onto kitchen paper. Repeat with the remaining batter and keep the blini warm until ready to serve.", "For the beetroot, place the redcurrant jelly, vinegar and cloves into a saucepan and cook until reduced down to a glaze thick enough to coat the back of a spoon.", "Pass the mixture through a sieve into a clean bowl, whisk in the mustard then fold the beetroot into the pickle mix and keep warm.", "Whisk the crème fraîche until thickened, add the chives and season with salt and freshly ground black pepper.", "Cut the mackerel fillets in half lengthways. Drizzle with rapeseed oil, gently blow torch on both sides until cooked through then season with salt and freshly ground black pepper.", "To serve, place the mackerel onto the serving plates with a little of the chopped shallots, the warm beetroot pickle, blini, crème fraîche and some Avruga caviar."]}, {"isVegetarian": true, "title": "Blue cheese and fig tarts", "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_fig_34219", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blue_cheese_and_fig_34219_16x9.jpg", "ingredients": ["2 sheets filo pastry (measuring 25x25cm/10x10in square)", "a little melted butter ", "3 ripe figs", "100g/3½oz creamy blue cheese such as dolcelatte or roquefort", "1 tsp lemon juice ", "3 sage leaves, chopped ", "sprinkling of ground paprika "], "serves": "Makes 24 tarts", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Brush two sheets of filo with butter and place on top of each other. Cut into 24 equal squares. Put the squares together in pairs on top of each other at a 45 degree angle to make a star shape. Press into the holes of a 12 mini-muffin tin. Repeat with the remaining pastry to make 24 mini tartlets. ", "Bake in the oven for about 5-10 minutes, or until golden-brown and crisp. Transfer to a baking tray. ", "Chop the figs into small pieces, and divide between the filo cases. Put the cheese, lemon juice and sage into a bowl. Mash down with a fork, season with pepper, then spoon blobs of cheese mixture on top of the fig. Sprinkle lightly with paprika.", "Bake in the oven for five minutes, or until the cheese has just melted."]}, {"isVegetarian": true, "title": "Blood orange tart", "url": "www_bbc_co_uk_food_recipes_bloodorangetart_93766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bloodorangetart_93766_16x9.jpg", "ingredients": ["200g/7oz sugar, plus extra for dusting", "3 blood oranges, juice and zest ", "1 tsp orange blossom water", "2 free-range eggs, plus 6 yolks", "200g/7oz butter, cubed", "25cm/10in sweetened shortcrust pastry tart shell, blind baked (you can use ready-made)", "3 blood oranges, peeled, sliced into rounds", "1 tbsp demerara sugar", "double cream or custard, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the sugar, orange juice and zest, orange blossom water, eggs and egg yolks together in a bowl until well combined.", "Add the butter and set over a pan over simmering water. (Do not let the base of the bowl touch the water.)", "Cook for 15-20 minutes, stirring regularly, until the butter has melted and the mixture has thickened.", "Pour the mixture into the cooked pastry case , cover with clingfilm (to prevent a skin forming) and set aside to cool.", "Arrange the orange slices on the cooled tart and sprinkle over the demerara sugar.", "Using a cooks' blowtorch, heat the sugar until caramelised.", "To serve, slice the tart and serve with double cream or custard."]}, {"isVegetarian": true, "title": "Blue cheese and pancetta tray loaf", "url": "www_bbc_co_uk_food_recipes_blue_cheese_and_pancetta_85716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz strong white flour, plus extra for flouring", "1 tsp sea salt, plus extra for the topping", "1 tbsp caster sugar, plus 1 tsp for cooking the onions", "1 tbsp dried instant yeast", "100ml/3½fl oz olive oil", "50g/1¾oz pancetta, sliced", "2-3 tsbp rosemary leaves, plus extra for serving", "extra virgin olive oil, to drizzle", "125g/4½oz blue cheese, such as Stilton, crumbled", "2 tbsp olive oil", "3 large onions, sliced", "1 tbsp thyme leaves", "1 tsp caster sugar", "1 tbsp balsamic vinegar", "salt and pepper"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the flour, salt, caster sugar and yeast in a bowl and mix.", "Create a well in the middle and add 300ml/10fl oz warm water and 100ml/3½fl oz olive oil. Bring the mixture together to a soft dough and turn out on a floured surface.", "Knead for 10 minutes, or until smooth and elastic. Place in a lightly oiled bowl, cover and leave to rise for one hour.", "For the caramelised onions, heat the olive oil in a frying pan and add the onions and thyme. Cook for 25 minutes, or until soft and golden-brown.", "Add the caster sugar and vinegar and cook for a further three minutes. Season with salt and pepper, set aside and clean the pan.", "Return the pan to the heat, add the pancetta and rosemary and cook until crisp. Remove and set aside in a separate bowl.", "Knock back the dough and then stretch out into a long oval shape.", "Place on an oiled baking tray and cover for 30 minutes.", "Make random dimples in the surface of the dough with your fingers. Top with the caramelised onions, a good drizzle of extra virgin olive oil and salt. Bake in the oven for 20 minutes, or until golden-brown.", "Remove the tray and sprinkle with blue cheese, pancetta and rosemary. Bake for an extra two minutes or until the cheese begins to melt.", "Dress with extra rosemary and serve immediately."]}, {"isVegetarian": false, "title": "Blue cheesecakes", "url": "www_bbc_co_uk_food_recipes_blue_cheese_cake_41569", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large beetroot, skin on and scrubbed ", "2 garlic cloves, crushed", "1 bay leaf", "10g/½oz sprigs of thyme", "½ tsp black peppercorns", "50g/1¾oz caster sugar", "500ml/18fl oz red wine vinegar ", "1 tbsp coarse sea salt", "40g/1½oz unsalted butter, fridge-cold and cut into 2cm/¾in cubes, plus extra, melted, for greasing", "50g/1¾oz pumpkin seeds, toasted", "5 digestive biscuits, roughly crumbled", "40g/1½oz Parmesan, coarsely grated", "½ tsp salt", "20g/¾oz unsalted butter", "1 leek, thinly sliced ", "360g/12oz cream cheese", "170g/6oz crème fraîche", "80g/3fl oz double cream", "2 garlic cloves, crushed", "20g/¾oz chives, finely snipped", "1 tbsp chopped basil", "½ tsp salt", "100g/3½oz Stilton, roughly crumbled", "4 free-range eggs, lightly beaten", "40g/1½oz runny honey (mixed, optionally, with a few drops of truffle oil)", "30g/1oz hazelnuts, toasted and lightly crushed", "15g/½oz baby basil "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the ingredients for the pickled beetroot in a medium, lidded saucepan. Pour over 800ml/1 pint 8fl oz  water. The beetroots should be submerged, so add a little more water if you need to. Bring to the boil, then reduce the heat to medium and cook, covered, for 35–40 minutes, or until the beetroot is soft. Leave to cool completely.", "Lift the beetroots out of the liquid, then peel and cut them into 1cm/½in dice. Put it in the bowl. Strain the pickling liquid, and return it to the pan. Cook over a medium heat for 25 minutes, or until reduced by half to about 600ml/1 pint 2fl oz. Set aside to cool, then pour the liquid over the beetroots. Cover and chill in the fridge for 24 hours.", "For the bases, lightly grease eight 12cm/6in diameter ramekins or soufflé tins with melted butter and place a circle of baking paper in the base of each.", "Put all the ingredients for the cheesecake base in a food processor. Pulse to form fine crumbs, then divide between the ramekins, pressing down evenly and firmly.", "For the cheesecake toppings, preheat the oven to 200C/180C Fan/Gas 6. Melt the butter in a small saucepan over a medium heat for 7 minutes, stirring from time to time, until soft. Leave the leeks to cool, then transfer them to a large mixing bowl.", "Add the cream cheese, crème fraîche, cream, garlic, chives, basil, salt and a good grind of black pepper to the leeks. Mix well to form a smooth paste. Gently fold in the blue cheese and eggs, then pour the mixture into the ramekins. ", "Bake for 25–30 minutes, until a skewer inserted into the middle comes out clean. ", "Serve immediately, in the ramekins or soufflé tins, garnished with a drizzle of honey, the hazelnuts and basil. The beetroot, strained, can be spooned on top of the cheesecakes before the garnishes, or served alongside."]}, {"isVegetarian": false, "title": "Blood orange pork belly with pickled vegetables", "url": "www_bbc_co_uk_food_recipes_blood_orange_pork_belly_88752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 blood oranges, juice only", "300ml/10fl oz balsamic vinegar", "2 onions, finely chopped", "100g/3½oz fresh galangal, peeled and finely chopped", "3 red chillies, deseeded and finely chopped", "4 bay leaves ", "10 garlic cloves, chopped", "2kg/4lb 8oz pork belly ", "1 x 500ml/18fl oz bottle sake ", "100g/3½oz butter, diced", "125ml/4fl oz rice vinegar", "1 red onion, peeled and quartered", "1 bunch pink radishes, stalks removed", "1 small mooli, ends removed", "10g mustard seeds ", "25g/1oz sugar ", "5g ground black cardamom ", "5g red pepper flakes"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork belly, place the orange juice and balsamic vinegar in a sterilized, sealable, airtight container. Leave to infuse in the fridge for at least a week.", "Preheat the oven to 160C/140C/Gas 3. Place the onions, galangal, chillies and bay leaves on the bottom of a heavy roasting tin. Rub the chopped garlic all over the pork belly and place the meat on top of the vegetables in the tin. Pour the sake into the tin, add 200ml/7fl oz cold water, cover with kitchen foil and roast for 45 minutes.  ", "Remove the pork belly from the oven and reserve the stock. Press the pork belly by covering with kitchen foil and laying a heavy weight on top. Leave for 12 hours, or longer if you have the time. ", "For the pickled vegetables, pour the vinegar and 125ml/4fl oz of water into a saucepan. Add the rest of the ingredients to the pan, place over a low heat and cook gently, stirring until the sugar has dissolved. Set aside to cool.", "Finely grate the cooled onion, radishes and mooli on a mandoline. Place in a bowl and stir in some of the pickling liquor. ", "Place 150ml/5fl oz of the orange-infused balsamic and the reserved stock in a saucepan and reduce down over a high heat. Whisk in the butter and simmer until it thickens. ", "Cut the pork belly into slices. Fry the pork in a hot frying pan or griddle, until golden on all sides. Coat the pork on both sides with the orange sauce. ", "Serve the pork belly slices with the pickled vegetables and leafy greens alongside. "]}]