[{"isVegetarian": false, "title": "Boston baked beans", "url": "www_bbc_co_uk_food_recipes_bostonbakedbeans_10471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bostonbakedbeans_10471_16x9.jpg", "ingredients": ["500g/1lb 2oz white haricot beans, dried", "400g/14oz piece pork belly ", "50g/2oz soft brown sugar", "45g/3 tbsp black treacle", "1 tbsp English mustard (made from powder)", "4 cloves", "8-10 pickling onions (or 2-3 small onions)", "fresh ground black pepper", "salt"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the beans overnight in plenty of fresh cold water. ", "Preheat the oven to 140C/275F/Gas 1.", "Drain and rinse, then put in a heavy, ovenproof pan or casserole, with fresh water to cover the beans by about 5cm/2in. Bring to the boil and boil hard for at least 10 minutes. Lower the heat to get a gentle simmer, cover with the pan lid, and simmer for about one hour until the beans are tender but not completely soft. Remove from the heat.", "Cut the pork belly in large 5cm/2in cubes, leaving the rind on and add to the beans. Stir in the brown sugar, black treacle and mustard. ", "Press the cloves into an onion and add, with the extra onions, to the pot. Season with pepper, but no salt at this stage. If necessary, add a little hot water so that the beans are covered.", "Replace the lid on the casserole. Bake the beans into the oven to bake for about three hours. Then remove the lid and dragging some of the pork chunks to the top. Return, uncovered, to the oven, for a further hour. Season, to taste, with salt and freshly ground black pepper.", "Serve on it's own, with crusty bread (or on toast), as a snack or light meal. ", "The baked beans will keep in the fridge, in a sealed jar or tupperware container, for two weeks. You can also freeze any leftovers. "]}, {"isVegetarian": true, "title": "Borsch (beetroot soup)", "url": "www_bbc_co_uk_food_recipes_borschbeetrootsoup_12298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb beetroot", "450g/1lb carrots", "8 shallots", "2 garlic cloves, chopped roughly ", "1 stick of celery, chopped roughly ", "1 bay leaf", "2 tbsp caraway seeds", "enough stock to cover the vegetables with about half a pint left over", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and roughly chop the vegetables. Place in a large pan with the bay leaf and caraway seeds. ", "Cover with the stock. Bring to a rapid boil. Cover the pan and reduce the heat to a simmer and cook for about 1 hour or until the vegetables are tender.", "Remove the bay leaf and liquidise the soup until smooth, adjust the seasoning.  Pass the soup through a medium sieve. ", "Reheat gently, do not allow to boil, serve with the soured cream and Pirags."]}, {"isVegetarian": true, "title": "Boozy cherries with mint cream and filo parcels", "url": "www_bbc_co_uk_food_recipes_boozycherrieswithmin_88601", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 425g/15oz can cherries in juice, drained", "3 strips orange zest, cut with a peeler", "2 tbsp maple syrup", "2 tbsp red wine", "1 tsp arrowroot", "2 cardamom pods, split", "1 sheet ready-made filo pastry", "55g/2oz butter, melted", "2 tbsp icing sugar", "100ml/3½fl oz double cream", "2 tbsp chopped fresh mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the boozy cherries, place all the ingredients into a pan and heat, stirring, until the mixture thickens and turns syrupy.", "For the filo parcels, cut the pastry sheet into three or four pieces, and scrunch up into little parcels. Brush generously with the melted butter and dust with the icing sugar.", "Place the filo parcels onto a baking sheet and cook in the oven for about 4-5 minutes, or until golden-brown and crisp.", "For the mint cream, in a bowl, whisk the cream until soft peaks form when the whisk is removed. Fold in the fresh mint.", "To serve, place the filo parcels on one half of a serving plate and spoon the boozy cherries onto the other. Serve with the mint cream in a small dipping bowl on the side."]}, {"isVegetarian": false, "title": "Bouillabaisse", "url": "www_bbc_co_uk_food_recipes_bouillabaisse_00342", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bouillabaisse_00342_16x9.jpg", "ingredients": ["2 tbsp olive oil", "2 onions, finely chopped ", "1 small fennel, finely chopped", "2 garlic cloves, crushed", "1 heaped tbsp tomato purée ", "100ml/3½fl oz dry white wine", "750ml/1¼ pint fish stock", "6 large tomatoes, skinned and roughly chopped ", "pinch saffron", "small bunch basil, stalks and leaves separated, leaves shredded", "1 small orange, zest and juice", "1kg/2lb 4oz mussels, scrubbed and debearded", "350g/12oz cod, skinned and cut into 15mm/⅝in slices", "2 sea bass fillet, skinned and cut into 5 slices ", "200g/7oz cooked crayfish tails, shelled", "salt and freshly ground black pepper", "pinch saffron", "½ small lemon, juice only ", "6 heaped tbsp full-fat mayonnaise ", "1 large garlic clove, crushed "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, deep saucepan. Add the onion and fennel and cook for 5 minutes, or until starting to soften. Add the garlic and tomato purée and stir for 30 seconds. Add the wine, stock and tomatoes. Bring up to the boil, add the saffron, basil stalks and orange zest. Cover and simmer for 10 minutes.", "Discard any mussels with broken shells and any that refuse to close when tapped. Add the mussels, turn in the pan and cover with a lid. Boil for about 4 minutes, or until all of the mussels have opened. Discard any that have not opened. Take the pan off the heat. ", "Carefully scoop out the cooked mussels. Reserve 18 mussels, then remove the remaining mussels from their shells and place in a small bowl. Discard the basil stalks.", "Blend the soup until completely smooth, transfer to a saucepan and simmer uncovered for 10 minutes to reduce. (You should have about 2 litres/3½ pints in total at this point.) ", "Season with salt and pepper and add the juice from half the orange. Add the cod and seabass, cover and gently simmer for 3–4 minutes, then return the cooked mussels, reserved mussels in shells and the crayfish tails and heat for another 2–3 minutes, or until piping hot and all of the fish is cooked.", "Spoon into bowls and sprinkle with shredded basil leaves. ", "To make the rouille, soak the saffron in the lemon juice and mix together with the garlic and mayonnaise in a bowl. Season with salt and pepper and spoon on top of the bouillabaisse."]}, {"isVegetarian": false, "title": "Bouillabaisse", "url": "www_bbc_co_uk_food_recipes_bouillabaisse_58073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 small (100g/3½oz) red mullet, gutted, scaled, gills removed, cut into 3cm/1¼in pieces, heads and tails reserved", "1 x 1kg/2lb 4oz gurnard, gutted, scaled, gills removed, cut into 3cm/1¼in pieces, head and tail reserved", "1 large onion, thinly sliced", "1 fennel bulb, thinly sliced ", "1 garlic bulb, cloves separated and thinly sliced", "1 leek, thinly sliced", "100ml/3½fl oz extra virgin olive oil", "15g/½oz fresh basil ", "2 sprigs fresh thyme", "10g/⅓oz fresh parsley stalks", "25g/1oz flaked sea salt", "10 black peppercorns", "1 heaped tsp coriander seeds", "1 heaped tsp fennel seeds", "pinch saffron strands", "1 clove", "pinch cayenne pepper", "500g/1lb 2oz plum tomatoes, sliced", "3 tbsp olive oil", "50g/1¾oz tomato purée", "500g/1lb 2oz tomatoes, chopped", "150ml/5fl oz good-quality dry white wine", "3 litres/5¼ pints good-quality fish stock or water", "600g/1lb 5oz Maris Piper potatoes, cut into bite-sized pieces ", "2 leeks", "12 large langoustines", "1 x 1kg/2lb 4oz monkfish tail, deboned and trimmed", "12 scallops", "2 small (100g/3½oz) red mullet, gutted, scaled, gills removed, cut into 3cm/1¼in pieces, heads and tails reserved", "1 x 1kg/2lb 4oz gurnard, gutted, scaled, gills removed, cut into 3cm/1¼in pieces, head and tail reserved", "1 large onion, thinly sliced", "1 fennel bulb, thinly sliced ", "1 garlic bulb, cloves separated and thinly sliced", "1 leek, thinly sliced", "100ml/3½fl oz extra virgin olive oil", "15g/½oz fresh basil ", "2 sprigs fresh thyme", "10g/⅓oz fresh parsley stalks", "25g/1oz flaked sea salt", "10 black peppercorns", "1 heaped tsp coriander seeds", "1 heaped tsp fennel seeds", "pinch saffron strands", "1 clove", "pinch cayenne pepper", "500g/1lb 2oz plum tomatoes, sliced", "3 tbsp olive oil", "50g/1¾oz tomato purée", "500g/1lb 2oz tomatoes, chopped", "150ml/5fl oz good-quality dry white wine", "3 litres/5¼ pints good-quality fish stock or water", "600g/1lb 5oz Maris Piper potatoes, cut into bite-sized pieces ", "2 leeks", "12 large langoustines", "1 x 1kg/2lb 4oz monkfish tail, deboned and trimmed", "12 scallops"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the red mullet and gurnard in a large bowl. Add the onion, fennel, garlic, leek, extra virgin olive oil, herbs, salt, spices and plum tomatoes and mix well. Cover and marinate in the fridge for 24 hours, turning the contents every 4–6 hours.", "Separate the fish from the vegetables and spice mix, reserving the liquid. Heat 2 tablespoons olive oil in a large frying pan over a medium heat and fry the fish, discarding the heads and tails, for 10–15 minutes, or until golden brown on all sides. ", "Meanwhile, heat the remaining 1 tablespoon oil in a saucepan large enough to hold the soup. Add the vegetables and sweat for 5–7 minutes, without allowing them to colour. Season with salt and pepper.  ", "Remove the fish from its pan and keep warm. Deglaze the pan with a splash of the wine and add to the vegetables. ", "When the vegetables are soft, add the tomato purée and cook for 5 minutes. Add the chopped tomatoes, reserved liquid and remaining wine, increase the heat and simmer for 10 minutes. Add the stock, bring to the boil rapidly, reduce to a simmer and cook for 20 minutes. ", "Meanwhile, cook the potatoes in a large pan of salted water for 20 minutes, or until soft. ", "Blend the soup in a blender until very smooth. Pass through a fine sieve and keep warm.", "Blanch the whole leeks in a large pan of salted water for 5 minutes. Drain and slice into 1cm/½in slices. ", "Drain the potatoes and add to the soup along with the leeks. ", "Bring a large saucepan of salted water to the boil, then add the langoustines and cook for 1 minute. Drain and set aside to cool slightly before removing the tail meat, then add to the soup to cook through. ", "Sear the monkfish tail in a hot frying pan for 5 minutes, until golden on each side but not quite cooked through. Remove from the pan and cut into 24 slices. Add to the soup to cook through. ", "Season the scallops in the same pan, sear and cook them through.", "To serve, divide the soup between 12 warmed serving bowls and top each one with a seared scallop. Drizzle the fish with lemon juice and serve alongside. "]}, {"isVegetarian": false, "title": "Bouillabaisse with fresh shrimps and squid, chilli croûtons and rouille", "url": "www_bbc_co_uk_food_recipes_bouillabaisse_of_sea_62124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "1 bulb fennel, chopped", "2 stalks celery, chopped", "2 carrots, chopped", "1 red chilli, chopped", "2 garlic cloves, chopped", "2 star anise", "1 tsp cayenne pepper", "½ tsp chilli powder", "500g/1lb 2oz tomatoes, chopped", "1 tbsp tomato purée", "2 strips orange peel", "400ml/14fl oz white wine", "1kg/2lb 4oz fish bones, roughly chopped (ask your fishmonger for these)", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh tarragon", "100g/3½oz peeled prawns, shells reserved", "300g/10½oz fish fillets (sea bream, gurnard and hake), sliced", "100g/3½oz fresh squid, sliced", "2 garlic cloves, crushed", "1 free-range egg yolk", "150ml/5fl oz chilli oil (reserved from the soup, add extra oil if needed to make it up to 150ml/5fl oz)", "pinch cayenne pepper", "sea salt", "2 tbsp olive oil", "pinch chilli powder", "pinch cayenne pepper", "4 slices baguette, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the bouillabaisse, heat the oil in a large pan, add the fennel, celery and carrot and fry for 6-8 minutes, or until softened but not coloured. Add the chilli and garlic and cook for two minutes until soft. ", "Add the spices and fry for two minutes until fragrant.  Add the tomatoes, tomato purée, orange peel, white wine and fish bones. Bring to the boil and simmer for an hour.", "Skim the deep red oil from the surface of the bouillabaisse with a spoon and reserve it for the rouille. ", "Strain the stock through a fine sieve, pressing down firmly to extract some of the vegetables. Return the strained stock to the pan and keep warm until ready to serve.", "For the rouille, put the garlic and egg yolk into a food processor. Turn the motor on and gradually add the chilli oil in a slow, steady stream until the mixture resembles mayonnaise. Season with a pinch of cayenne pepper and salt, to taste.", "For the croûtons, preheat a grill to medium-high. Combine the oil, chilli powder and cayenne and brush generously over the baguette slices. Warm under the grill for two minutes, or until crisp.", "For the bouillabaisse, return the pan to the heat and bring to a simmer. Add the parsley, tarragon, prawns, fish and squid and cook gently for five minutes. Divide the cooked fish between four serving bowls and ladle the liquid over the top. Top each bowl with a chilli crouton and a spoonful of rouille."]}, {"isVegetarian": false, "title": "Mussel, haddock and salmon stew", "url": "www_bbc_co_uk_food_recipes_bouillabaissestylefi_78625", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1litre/2 pints fish stock", "1kg/2lb 3¾oz mussels, scrubbed and de-bearded ", "pinch saffron ", "¼ tsp curry powder", "500ml/1pint double cream", "250g/9oz smoked haddock, cut into 1.5cm cubes ", "200g/7oz salmon, cut into 1.5cm cubes", "4 carrots, cut into 1cm cubes and blanched ", "2 potatoes, cut into 1cm cubes and blanched", "1 leek, cut into 1cm cubes", "2 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper", "4 slices country bread, griddled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the stock to the boil, then add the mussels and cook for 3-4 minutes until the mussels are open. Discard any mussels that do not open.", "Strain the stock into a saucepan, reserving the mussels.", "Pull the mussel shells in half, discarding the halves without the mussel meat, and keep to one side.", "Place the pan with the stock back on the heat and reduce the temperature to a simmer.", "Add the saffron, curry powder and cream, then bring it back to a simmer.", "Add the fish, carrots, potatoes and leek and simmer for 2-3 minutes until tender.", "Add the parsley and cooked mussels and stir through.", "Season with salt and freshly ground black pepper.", "Serve with the griddled bread."]}, {"isVegetarian": true, "title": "Bourbon-glazed monster doughnut with malted milk ice cream", "url": "www_bbc_co_uk_food_recipes_bourbon-glazed_monster_11608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp malted milk powder", "250ml/9fl oz full-fat milk  ", "250ml/9fl oz double cream  ", "6 free-range egg yolks  ", "100g/3½oz caster sugar  ", "1kg/2lb 4oz strong white bread flour, plus extra for dusting ", "100g/3½oz caster sugar ", "250g/9oz butter, plus extra for greasing ", "600ml/1pt 1fl oz milk ", "18g fresh yeast ", "200g/7oz demerara sugar ", "1 tbsp ground cinnamon ", "200g/7oz icing sugar", "2 tbsp bourbon whiskey"], "serves": "Serves 10-14", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, in a saucepan, whisk the malted milk powder with a splash of milk until dissolved, then add the remaining milk and the cream and bring the mixture to a simmer. ", "In a bowl, whisk the egg yolks and caster sugar until pale and fluffy, then pour the warm milk mixture over the egg mixture, whisking continuously until well combined.", "Return the mixture to the saucepan and cook over a gentle heat, whisking all the time, until the mixture thickens just enough to coat the back of a spoon. ", "If using a Pacojet machine, fill (but do not overfill) the container, then place it in the freezer for at least 4 hours, or until frozen solid. Alternatively, pour the mixture into an ice cream machine and churn until frozen, then transfer the ice cream to an airtight, freezeable container and freeze until needed.", "Meanwhile, for the doughnut, mix the flour and sugar in a large mixing bowl, or in the bowl of a free-standing mixer. ", "Heat 100g/3½oz of the butter and half of the milk in a saucepan over a low heat. When the butter is just melting, remove the pan from the heat and whisk in the yeast until dissolved. Set aside.", "Add the remaining milk to the pan containing the yeast mixture, then pour all of the liquid over the dry ingredients. Mix for 5 minutes in the free-standing mixer or using an electric whisk fitted with a bread hook attachment, on a medium speed, until the mixture has come together as a soft, sticky dough. Alternatively, knead by hand on a lightly floured work surface for 5 minutes. ", "Place the dough into a large bowl and cover with cling film, then set aside at room temperature to prove for 1 hour, or until well risen, spongey and nearly doubled in size. ", "Grease the insides of a 38cm/15in deep-sided, non-stick cake tin with butter, and grease the outside edge of a 12.5cm/5in cake tin or ovenproof ramekin. Place one inside the other.", "Melt the remaining 150g/5oz of butter and pour into a large, high-sided roasting tray.", "Mix together the demerara sugar and cinnamon in another high-sided roasting tray.", "Turn out the proved dough onto a lightly floured work surface. Knead it gently for a couple of minutes until smooth and elastic, then roll it into a big bun shape. Using a pair of scissors, snip the dough in the centre to create a hole reaching all the way from the top to the bottom of the bun; use your fingers to gently increase the size of the hole.", "Dip the monster doughnut into the melted butter until completely coated, then dust it on all sides with the cinnamon sugar. Transfer the doughnut to the prepared tin, easing the doughnut hole around the smaller cake tin or ramekin. Cover the doughnut loosely with cling film and set aside at room temperature for 40-45 minutes, or until the dough is well risen. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "When the monster doughnut has proved, remove the cling film and bake in the oven for 25-30 minutes, or until golden-brown on top and cooked through. Carefully remove the inner tin, then turn the whole doughnut out onto a large serving platter. ", "Stir the icing sugar and bourbon together in a bowl until smooth, then spoon the mixture into a small piping bag and drizzle it over the top of doughnut.", "Fill a ramekin small enough to fit inside the doughnut hole with the ice cream. Serve immediately."]}, {"isVegetarian": false, "title": "Bouillabaisse with seared squid", "url": "www_bbc_co_uk_food_recipes_bouillabaisse_with_26852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 onion, roughly chopped", "2 garlic cloves, roughly chopped", "1 tsp fennel seeds", "½ tsp cayenne pepper", "½ tsp saffron threads, soaked in 1 tbsp hot water", "4 shell-on tiger prawns, roughly chopped", "400g/14oz hake, boneless and skinless, cut into chunks", "50ml/2fl oz anise-flavoured liqueur (such as Pernod)", "110ml/4fl oz white wine", "1 x 400g/14oz tinned tomatoes", "500ml/18fl oz fish stock", "1kg/2lb 4oz mussels, cleaned", "1kg/2lb 4oz clams, cleaned", "salt and freshly ground black pepper", "4 baby squid, cleaned and cut into triangles", "1 baguette, cut on the diagonal into 5mm/¼in thick slices", "2 free-range egg yolks", "2 garlic cloves, crushed", "¼ tsp cayenne pepper", "½ tsp saffron threads, soaked in 1 tbsp hot water", "¼ lemon, juice only", "125ml/4½fl oz light olive oil", "200g/7oz Gruyère, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the bouillabaisse, heat a large frying pan until medium hot, add two tablespoons of the olive oil, plus the onion and garlic and fry gently for a couple of minutes, or until just softened.", "Add the fennel seeds and cayenne pepper and fry for a minute. Add the saffron, prawns and half the hake and stir fry for two minutes.", "Add the anise-flavoured liqueur and flambé to burn off the alcohol (CAUTION: keep your face and hair away from the flames. Do not leave unattended). Add the white wine and cook until the volume of the liquid reduced by half.", "Add the tinned tomatoes and fish stock, bring to the boil then reduce to a simmer and cook for eight minutes, or until the fish is cooked through.", "Place the mixture into a food blender and blend to a fine purée then strain through a sieve back into a clean frying pan.", "Return to a simmer, add the remaining hake, the mussels and clams and cook until all the shells have opened and the hake is just cooked through. Season to taste with salt and freshly ground black pepper.", "Meanwhile, heat a griddle pan until searing hot and lightly oil the squid with the remaining olive oil. Place the squid on the griddle and sear on each side for 30 seconds until just cooked through. Remove and season with salt and freshly ground black pepper.", "For the garnish, heat the grill to high. Toast the bread on each side until light golden-brown.", "Place the egg yolks, garlic, cayenne and saffron into a food processor and blend to a purée. Keep the processor running and very gradually add the olive oil until a thick, bright-yellow mayonnaise is formed. Then season to taste with salt and freshly ground black pepper.", "To serve, ladle the bouillabaisse into each soup plate and top with pieces of the seared squid. Pile the toast onto a board and serve the Gruyère and mayonnaise in bowls alongside."]}, {"isVegetarian": false, "title": "Bourbon glazed spare ribs with smoked corn salad", "url": "www_bbc_co_uk_food_recipes_bourbon_glazed_spare_56802", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz pork baby back ribs, cut into 12 equal small racks (2 or 3 ribs per rack)", "80g/2¾oz coarse sea salt", "4cm/1½in piece of ginger, peeled and cut into small strips", "1 medium onion, roughly chopped ", "6 garlic cloves, crushed", "8 whole star anise", "1 cinnamon stick", "1 tsp whole black peppercorns", "1½ litres/2½ pints chicken stock", "100ml/3½fl oz Shaoxing rice wine", "100ml/3½fl oz rice vinegar", "4 large corn cobs in their husks", "15 sprigs of lemon thyme", "3 tbsp lime juice", "2 tsp maple syrup", "4 tbsp olive oil", "1 green chilli, seeds removed and thinly sliced", "20g/¾oz coriander leaves", "20g/¾oz mint leaves", "20g/¾oz parsley leaves", "4 spring onions, thinly sliced ", "coarse sea salt", "3 banana shallots, peeled and thinly sliced ", "350ml/12fl oz bourbon", "4 tbsp maple syrup", "2 tsp Szechuan peppercorns", "1½ tbsp lemon juice", "2 tbsp sesame oil", "3 tbsp tomato ketchup", "1½ tbsp rice vinegar", "2 dried red chillies", "2 garlic cloves, lightly crushed"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Place the ribs in a large bowl with the salt. Rub it all over the meat and set aside for 1 hour.", "Rinse the ribs well under cold water, gently rubbing off all the salt and pat dry. Put them into a large lidded saucepan. Add the ginger, onion, garlic, star anise, cinnamon and peppercorns. Pour over the stock, rice wine and rice vinegar. Bring to the boil, then reduce the heat to medium-low and simmer gently, covered, for 1 hour.", "Lift out the ribs and set aside. If you are not serving them in the next couple of hours, let the ribs cool and store them in the fridge, covered, until ready to use. If you do this, make sure you bring them back to room temperature before you coat them in the glaze before serving.", "Strain the liquid, discarding the onion, garlic and spices, and return it to the pan. Place on a high heat and cook for 30-35 minutes, until the liquid has reduced to about 200ml/7fl oz. Remove from the heat and set aside. Chill if you are not serving the ribs in the next 2 hours.", "For the smoked corn salad, remove the husks from the corn and use them to line the base of a large lidded saucepan or wok which is deep enough to fit a colander or metal steaming basket inside. Add the lemon thyme and place the pan over a high heat. Once the husks and thyme begin to smoke (about 6 minutes) place the colander in the pan and place the corn cobs inside it. Use a lid to seal the pan and smoke for 5 minutes. Remove from the heat and set aside, covered, for another 5 minutes. Remove the lid and set aside to cool.", "Stand each corn cob on a chopping board and use a large sharp knife to shave off rows of kernels, cutting from top to bottom. Cut deep enough into the cob so that some of the kernels remain in clusters, this isn’t essential, it just looks good. Set the corn kernels aside and discard the cobs.", "Make the glaze about 45 minutes before you are ready to serve, place all the ingredients for the glaze, along with 100ml/3½fl oz of the stock reduction, in a large pan. Bring to the boil, then simmer on a medium-high heat for 20-25 minutes, until the liquid has reduced to about 200ml/7fl oz and has the consistency of syrup. Return the pork ribs to the sauce and stir gently so they all get coated. Cook for about 7 more minutes on a medium heat, stirring once or twice until the ribs are warmed through and sticky.", "Just before serving, finish the salad by placing the lime juice, maple syrup, olive oil and chilli in a large bowl with 1 teaspoon sea salt. Whisk to combine, then mix in the corn kernels, herbs and spring onion. Place two small racks of ribs on each plate – one leaning against the other – and serve with the corn salad alongside."]}, {"isVegetarian": false, "title": "Bourbon-glazed turkey with confit turkey legs", "url": "www_bbc_co_uk_food_recipes_bourbon-glazed_turkey_28426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 5kg/11lb good-quality free-range turkey, jointed into a crown and legs (wings left on)", "4 tbsp salt ", "8 juniper seeds, crushed", "2 sprigs thyme, leaves only", "2 garlic cloves, chopped", "8 peppercorns, crushed", "duck fat, to cover the legs", "150g/5½oz brown sugar", "150ml/5fl oz bourbon whiskey ", "2 tbsp soy sauce ", "30g/1oz butter", "2 tsp ground smoked paprika ", "1 tbsp vegetable oil"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To confit the legs, combine the salt, juniper, thyme, garlic and peppercorns in a bowl. Rub the mixture over the legs. Chill in the fridge for 24 hours, turning two or three times.", "Wipe the legs with kitchen paper and pat dry, but don’t wash off the marinade. Put into a cast-iron casserole and cover with the duck fat. Heat on the hob to a gentle simmer. Put the lid on and cook for 2-3 hours, until the meat is very tender. Remove from the heat and leave to cool in the fat.", "For the glaze, heat the brown sugar, bourbon and soy sauce in a pan and cook until the volume of liquid has reduced by half, but not quite a syrup. Stir in the butter and paprika. ", "To cook the turkey crown, preheat the oven to 170C/150C Fan/Gas 3. Season the crown with salt and pepper, rub with oil, transfer to a roasting dish and roast for 1 hour. Remove from the oven and brush with the glaze. Continue to brush with glaze periodically for the rest of the cooking time, reserving some of the glaze for the confit legs. Cooking will take about 2 hours in total, but check by piercing the thickest part of the meat with a skewer. When the juices run clear it is cooked. Remove from the oven, cover, and leave to rest.", "While the crown is resting, carefully remove the confit legs from the fat. Put them on a baking tray and roast for 20 minutes to crisp. Glaze and baste the confit legs for another 20 minutes, or until golden.", "Serve the turkey crown and confit legs in slices with all the trimmings."]}, {"isVegetarian": false, "title": "Bourbon-glazed sticky ribs with coleslaw and baked potatoes", "url": "www_bbc_co_uk_food_recipes_bourbonglazedstickyr_90440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz beef fore ribs", "1 tsp whole black peppercorns", "3 bay leaves", "1 small bunch fresh flatleaf parsley, leaves only", "1 onion, roughly chopped", "1 carrot, chopped", "175g/6oz tomato ketchup", "150g/5oz chipotle chilli ketchup", "110ml/4fl oz dark soy sauce", "175g/6oz clear honey", "4 tbsp ready-made teriyaki sauce", "4 tbsp bourbon whiskey", "2 free-range egg yolks", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "pinch salt", "200ml/7fl oz rapeseed oil", "90ml/3½fl oz olive oil", "2 tbsp cold water", "½ lemon, juice only", "salt and freshly ground black pepper", "250g/9oz carrots, finely shredded on a mandoline", "300g/11oz white cabbage, finely shredded on a mandoline", "1 sweet white onion, finely sliced", "4 large baking potatoes, washed and pricked all over with a fork", "1 tbsp olive oil", "1 tsp Maldon sea salt", "250ml/9fl oz soured cream", "4 tbsp chopped fresh curly parsley leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, place the beef fore ribs, peppercorns, bay leaves, flatleaf parsley, onion and carrot into a large pan. Cover with water and bring to the boil.", "Once the mixture is boiling, reduce the heat until the mixture is simmering.", "Simmer for 1½ hours, stirring occasionally to prevent sticking.", "Preheat the oven to 200C/400F/Gas 6.", "Meanwhile, for the bourbon sauce, place the tomato ketchup, chilli ketchup, soy sauce, honey, teriyaki sauce and bourbon into a separate pan, stir well and bring the mixture to a simmer. Simmer for 1-2 minutes, then remove from the heat.   ", "When the ribs have simmered for 1½ hours, dip them into the bourbon sauce, then place them onto a roasting tray, reserving the remaining sauce. Roast in the oven for 10-12 minutes, then spoon over more of the bourbon sauce. Continue to roast for a further 10-12 minutes, then remove from the oven and set aside on a warm plate.", "For the coleslaw, blend the egg yolks, white wine vinegar, Dijon mustard and salt in a food processor until smooth and well combined.", "With the food processor motor still running, gradually pour in the rapeseed oil and the olive oil in a thin stream until the mixture thickens to the consistency of thick mayonnaise. (You may not need all of both oils.)", "Transfer the mayonnaise mixture to a clean bowl. Gradually add the cold water and lemon juice in a thin stream, whisking continuously. Season, to taste, with salt and freshly ground black pepper.", "Place the carrots, cabbage and onion into a large mixing bowl and add enough mayonnaise to coat the vegetables. Stir until well combined and set aside.", "For the baked potatoes, rub the baking potatoes with olive oil and sprinkle over the salt.", "Place the potatoes onto the top shelf of the oven and bake for one hour, or until tender (allow more time for larger potatoes).", "To serve, divide the sticky ribs among four serving plates and spoon a portion of coleslaw alongside. Split the potatoes in half and place one onto each plate. Top with a spoonful of soured cream and garnish with the chopped curly parsley."]}, {"isVegetarian": false, "title": "Bourride of pollock and mussels with garlic and thyme croûtons", "url": "www_bbc_co_uk_food_recipes_bourride_of_pollock_and_91840", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range egg yolks (at room temperature)", "1 small garlic clove, finely chopped or crushed to a paste", "1 tsp lemon juice", "¼ tsp fine sea salt", "150ml/5fl oz extra virgin olive oil", "12-16 large mussels, scrubbed well and beards removed ", "600g/1lb 5oz skinless pollock fillet", "1 tbsp vegetable oil", "2 shallots, finely chopped", "¼ red pepper, thinly sliced", "1 tbsp finely chopped celery", "2 pinches saffron strands", "1 red bird’s-eye chilli, seeds removed and finely chopped", "½ orange, finely grated zest only ", "500ml/18fl oz chicken stock", "5 tbsp aïoli (from above)", "4 thick slices white bread", "30g/1oz butter", "1 sprig fresh thyme", "1 garlic clove, ", "sea salt and freshly ground black pepper", "coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aïoli, whisk the egg yolks in a mixing bowl with the garlic, lemon juice and salt. Whisk in the olive oil drop by drop, until you have a glistening sauce with the consistency of soft butter. (You can also use a food processor for this.)", "For the bourride, discard any mussels that are damaged or open and do not close when sharply tapped. Rinse the pollock fillet, pat dry with kitchen paper and cut into 5cm/2in pieces. Set aside with mussels.", "Heat the vegetable oil in a large lidded pan over a low heat. Add the shallots, red pepper and celery and fry gently for 5 minutes or until softened.", "Add the saffron, chilli and orange zest and cook for a further 3 minutes. Pour in the chicken stock and bring to boil then reduce the heat and simmer for 3 minutes. Add the mussels, put the lid on pan and cook for 3-4 minutes, just until the shells open. Now add the pollock pieces and cook for 3-4 minutes, or until just cooked through.", "Take the pan off heat and transfer the mussels and pollock to a warm bowl, using a slotted spoon. (Discard any unopened mussels.) Set aside to keep warm.", "Pour the cooking liquid into a blender and blend until smooth then with the motor running, slowly add 5 tablespoons of the aïoli through the funnel. When the mixture begins to thicken, stop blending and pour back into the saucepan. Warm the bourride gently and whisk with a balloon whisk or a hand held stick blender until foamy. Add the fish and mussels. Season, to taste, with salt and freshly ground black pepper and keep warm.", "Using a 4cm/1½in pastry cutter, cut 8 rounds from the bread slices. Melt the butter in a non-stick frying pan and add the thyme and garlic. Add the bread rounds and cook until dark golden-brown and crisp on both sides. Remove from the pan and drain on kitchen paper.", "Divide the bourride among four serving bowls. Spread the croûtons with a little of the remaining aïoli and place two on top of each bowl. Season with black pepper and garnish with coriander."]}, {"isVegetarian": false, "title": "Boxing Day brunch ‘kedgeree’", "url": "www_bbc_co_uk_food_recipes_boxing_day_brunch_89678", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["drizzle light rapeseed oil", "50g/1¾oz unsalted butter", "2 shallots, finely chopped", "1 leek, white part only, thinly sliced", "1 celery stalk, thinly sliced", "1 garlic clove, chopped", "300g/10½oz long-grain or basmati rice, washed and drained", "700ml/1 pint 4½fl oz chicken or turkey stock", "2 bay leaves", "pinch saffron strands", "½ tsp medium curry powder", "200g/7oz cooked leftover turkey, leg meat only, cut into pieces", "200g/7oz cooked leftover ham, cut into pieces", "200g/7oz cooked leftover sausages or sausage meat, cut into pieces", "3 free-range eggs", "2 tsp chopped fresh parsley", "2 tsp chopped fresh sage", "salt and freshly ground black pepper", "lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat the oil and butter in an ovenproof, lidded saucepan over a medium heat. When the butter is foaming, add the shallots, leek, celery and garlic and fry for 2-3 minutes, stirring well, until softened but not coloured.  ", "Add the rice and continue to cook, stirring well, for a 1 minute.", "Pour in the stock, then add the bay leaves, saffron and curry powder and heat until simmering.", "Add the leftover cooked meats, return the mixture to a simmer, then cover the pan with the lid.", "Transfer the pan to the oven and cook for 12-15 minutes, until the rice is tender.", "Meanwhile, carefully lower the eggs into a pan of simmering water and cook for 6 minutes. Drain well and run the eggs under a cold running tap. Peel the eggs and cut them into quarters lengthways.", "When the kedgeree is cooked, stir through the parsley and sage, then fold in the egg quarters. Season with salt and pepper.", "To serve, take the pan to the table and spoon it into bowls. Garnish with a lemon wedge and serve with bread and butter, if desired."]}, {"isVegetarian": false, "title": "Boxty with mackerel", "url": "www_bbc_co_uk_food_recipes_boxty_colcannon_pancakes_13555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz colcannon or mashed potato", "250g/9oz potatoes (such as Rooster), peeled and grated", "100g/3½oz plain flour", "125ml/4fl oz milk", "knob of butter", "rapeseed oil, for frying", "sea salt and freshly ground black pepper", "4 small mackerel, gutted and butterflied or filleted", "2–3 tbsp olive oil ", "3 garlic cloves, finely chopped", "knob of butter", "dill, chopped, to garnish", "1 lemon, juice only, to serve", "½ head frissee lettuce, inner leaves removed", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the boxty, put the colcannon (or mash), grated potato and flour in a bowl and mix until combined. Stir in the milk, little by little, until you have a wet dropping consistency. Season with salt and pepper.", "Heat a frying pan over a medium–high heat. Add a little butter and oil, when the butter begins to foam, spoon heaped tablespoons of the mixture into the frying pan and fry for 3–4 minutes on each side until golden-brown.", "Remove and place on a warm plate lined with kitchen paper. Repeat with the remaining mixture. Keep the pancakes warm in a low oven, if necessary.", "For the mackerel, coat the mackerel fillets with a little oil and garlic.  Season with salt and pepper.", "Heat a frying pan over a high heat and add a splash of oil and the butter. When the butter is foaming, add the mackerel skin-side down and fry for 3–4 minutes until the skin is crisp and the flesh is opaque. ", "Meanwhile, make the salad. Place the lettuce leaves in a large bowl. Mix the oil, vinegar and mustard in a small bowl. Season with salt and pepper and pour over the leaves. Toss to coat.\r\n", "Serve the mackerel with the potato pancakes. Finish with a little dill over the pancakes and a squeeze of lemon juice on the fish."]}, {"isVegetarian": false, "title": "Braciole in tomato sauce with green salad and oranges with cracked pepper", "url": "www_bbc_co_uk_food_recipes_bracioleintomatosauc_85462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz tomatoes, puréed in a food processor", "175g/6oz tomato paste", "425ml/15fl oz water", "1 tsp garlic salt", "1 tsp freshly ground black pepper", "1 tbsp olive oil", "1 tbsp mixed dried Italian herbs", "110g-175g/4oz-6oz pork bone with a little meat left on", "¼ tsp salt, or to taste", "900g/2lb rump steak, 5mm/¼in thick, cut into four slices", "1 large bunch flatleaf parsley, roughly chopped", "1 small bunch basil leaves, roughly chopped", "150g/5oz dried breadcrumbs", "3 tbsp garlic, finely chopped", "150g/5oz parmesan, freshly grated", "75ml/3fl oz olive oil", "3 large oranges", "3 tbsp olive oil", "freshly ground black pepper", "2 tbsp extra virgin olive oil", "1 tbsp balsamic vinegar", "large handful mixed green leaves"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato sauce, place the puréed tomatoes, tomato paste and water into a large saucepan over a medium heat and bring the mixture to a simmer.", "Add the garlic salt, freshly ground black pepper and olive oil and stir well.", "Add the mixed dried Italian herbs and stir well once more.", "Meanwhile, heat the olive oil a frying pan until hot, then add the pork bone. Season well with the salt and fry, turning occasionally, until browned all over.", "Add the pork bone to the tomato sauce and cook for 3-4 hours over a very low heat. Remove the pork bone from the sauce and discard.", "For the braciole, place the steak pieces between two sheets of cling film onto a strong work surface. Using a meat mallet or a rolling pin, pound the steaks to tenderise and flatten out.", "Place the parsley and the basil into a mini-food processor and blend together to a rough paste. Spread the herb mixture onto the meat.", "Mix together the breadcrumbs and the chopped garlic in a bowl. Place the breadcrumb mixture onto the meat, pressing it into the herb paste.", "Add the parmesan and salt and pepper on top of the bread-crumb mixture.", "Roll the meat pieces up, tuck in the ends, and secure with cooks' string.", "Heat the olive oil in a frying pan until hot and add the rolled meat pieces. Cook for a minute on each side, until just becoming golden-brown all over.", "Transfer the meat to the saucepan of tomato sauce, stir in and allow to simmer gently for 45-60 minutes, or until the meat is tender.", "To serve, remove the meat from the pan and place on a chopping board. Remove the string and allow the meat to rest for about five minutes, then cut the meat into 5cm/2in thick slices.", "For the salad, peel the oranges and slice into 5mm/¼in thick rounds. Remove any pips.", "Place the oranges on a plate and drizzle with oil and season, to taste, with freshly ground black pepper.", "Whisk the olive oil and balsamic vinegar together in a large clean bowl. Add the green salad leaves and mix well to coat.", "To serve, place several slices of the braciole onto plates. Pour a drizzle of tomato sauce over each. Place 2-3 orange slices alongside and top with the dressed salad leaves."]}, {"isVegetarian": false, "title": "Boxty with crisp streaky bacon and maple syrup", "url": "www_bbc_co_uk_food_recipes_boxtywithcrispstreak_91836", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz potato, peeled, grated", "500g/1lb 2oz cold mashed potato", "420g/15oz plain flour", "1 heaped tsp baking powder", "1-2 tbsp melted butter", "salt and freshly ground black pepper", "200ml/7fl oz milk", "1-2 tbsp olive oil", "8-12 rashers smoked streaky bacon", "maple syrup, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the grated potato in a clean tea towel and wring well to get rid of any excess liquid. ", "Transfer the grated potato to a mixing bowl, add the cold mashed potato and mix until well combined.", "Add the flour and baking powder to the potato mixture and mix until well combined. Stir in the melted butter and season, to taste, with salt and freshly ground black pepper. ", "Add the milk, a little at a time, to the potato mixture, beating after each addition until the milk has been fully incorporated into the mixture. When all of the milk has been incorporated into the potato mixture, it should resemble a thick, heavy batter. If the mixture is too sticky, add more milk as necessary. Set aside.", "Meanwhile, heat the oil in a large non-stick frying pan over a medium to high heat. Add the bacon rashers and fry for 6-8 minutes, or until crisp and golden-brown on both sides. Remove from the pan and set aside to drain on kitchen paper. ", "Add spoonfuls of the boxty batter into the same oil that the bacon was cooked in, leaving enough space around each spoonful for the mixture to spread. Fry the boxties on a medium to high heat for 3-4 minutes on each side, or until the boxties are golden-brown and the grated potato is cooked through. Remove the boxties from the pan using a slotted spoon, set aside to drain on kitchen paper and keep warm. Repeat the process with the remaining boxty mixture. ", "To serve, divide the boxties equally among four to six serving plates. Place two rashers of crisp streaky bacon alongside each. Drizzle over the maple syrup."]}, {"isVegetarian": false, "title": "Braised beef, bread and cheese pudding with deep-fried broccoli", "url": "www_bbc_co_uk_food_recipes_braised_beef_bread_and_31824", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz shin of beef on the bone  ", "1kg/2lb 4oz oxtail on the bone ", "2 carrots, cut in half ", "1 onion, cut into quarters", "2 celery sticks", "1 small head of garlic, cut in half ", "3 bay leaves ", "1 sprig of thyme ", "200g/7oz beef dripping, for frying", "8 thick slices sourdough bread ", "3 tbsp Dijon mustard, or English mustard if you prefer", "150g/5½oz Cheddar, grated", "salt and freshly ground black pepper", "vegetable oil, for deep frying", "8 small heads of purple sprouting broccoli (approximately 300g/10½oz)", "150g/5½oz mayonnaise ", "40g/1½oz creamed horseradish ", "300ml/10fl oz milk   ", "200g/7oz plain flour, to coat"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, preheat the oven 130C/110C Fan/Gas ¾.", "In a heavy bottomed, ovenproof dish with a tight fitting lid, add the beef shin, oxtail, vegetables and herbs. Cover with 2 litres/3½ pints water and place a circle of parchment paper on top. Cover with the lid and cook in the oven for 5 hours.", "When cooked, remove the beef shin, oxtail, carrots and celery from cooking liquor and set aside until cool enough to handle. ", "Remove the meat from the bones. Discard the bones and put the meat to one side. Set half of the cooking liquor to one side for serving. Heat the other half in the dish, or a pan, on the hob, to reduce it in volume by three-quarters. ", "For the pudding, preheat the oven to 160C/140C Fan/Gas 3.", "Heat the dripping in a frying pan. Fry the bread until golden-brown and crisp on both sides, but not fried all the way through. Brush liberally with mustard. ", "Break the cooked beef shin and oxtail into rough flakes. Roughly chop the cooked carrots and celery. ", "Make a layer of fried bread in the bottom of the baking dish. Sprinkle with a third of the cheese, half of the cooked meat and half of the vegetables. Season with salt and pepper. Make another layer of bread and cheese, then another layer of meat and vegetables. Finish with a final layer of bread and cheese. ", "Gently pour over the reduced beef stock then bake for 20 minutes. Remove from the oven and allow to stand for 5 minutes before serving.", "For the broccoli, heat the oil in a deep-fat fryer to 180C, or half-fill a deep pan with oil and heat until a breadcrumb sizzles and turns brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Cook the broccoli in salted boiling water until tender but still with a bite. Refresh in ice-cold water and drain. ", "Mix the mayonnaise and horseradish together. Add a little hot water to give it a pouring consistency. ", "Dip the broccoli in the milk, shaking off any excess, then coat evenly in flour. Repeat the process once more and then carefully lower into the deep-fat fryer. Cook for a few minutes until golden-brown. Drain on kitchen paper and season with a little salt. Place on a serving dish and dress with the horseradish and mayonnaise mixture.  ", "Serve the broccoli immediately with the hot pudding."]}, {"isVegetarian": false, "title": "Braised barbecue beef short ribs", "url": "www_bbc_co_uk_food_recipes_braised_bbq_irish_short_35047", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_bbq_irish_short_35047_16x9.jpg", "ingredients": ["2 x 300g/10½oz beef short ribs ", "olive oil, for frying", "2 tbsp sesame seeds", "500ml/18fl oz veal stock", "2 tbsp roughly chopped fresh coriander", "2 spring onions, thinly sliced at an angle", "1 jalapeño chilli, thinly sliced", "1 lime, cut into wedges, to serve", "500gkg/1lb 2oz salt", "bunch fresh thyme ", "½ garlic bulb, halved", "115g/4oz smoked paprika", "60g/2¼oz light brown sugar", "30g/1oz fine salt", "1 tbsp garlic powder", "1 tbsp onion powder", "1 tbsp freshly ground black pepper", "1 tsp chilli powder", "1 onion, finely chopped", "1 garlic clove, finely chopped", "400ml/14fl oz tomato ketchup", "100ml/3½fl oz American mustard", "4 tbsp cider vinegar", "4 tbsp Worcestershire sauce", "4 tbsp runny honey", "120g/4½oz light brown sugar"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the brine, mix 2.5 litres/4½ pints water with the salt, thyme and garlic in a large saucepan. Bring to the boil, then simmer until the salt has dissolved. Leave to cool. ", "Put the ribs in a large tupperware container and pour over the brine. Cover with a lid and refrigerate for 4 hours. When ready to cook, wash the ribs under cold running water for 30 minutes. ", "Meanwhile, to make the spice mix, put all ingredients in a bowl and mix well. ", "To make the barbecue sauce, fry the onion and garlic in a saucepan in a little oil over a medium heat for 3–4 minutes, until soft. Add 20g/¾oz of the spice mix and fry for 2 minutes. Add the remaining sauce ingredients and stir well. Cook over a low heat for 1 hour. Blend the sauce in a food processor while it’s still warm and pass through a fine sieve.", "Preheat the oven to 140C/120C Fan/Gas 2.", "Pat the ribs dry with kitchen paper and rub with some of the remaining spice mix. Fry in a little oil over a medium heat until brown on both sides. Place the ribs in a deep casserole dish and cover with the veal stock. Braise in the oven for 4 hours, or until tender. Set aside to rest.", "Increase the oven temperature to 180C/160C/Gas 4 and scatter the sesame seeds over a baking tray. Roast for 5 minutes, or until golden and aromatic.", "Brush the cooked ribs with the barbecue sauce and sprinkle with fresh coriander, spring onions, jalapeño chilli and sesame seeds. Serve with lime wedges."]}, {"isVegetarian": false, "title": "Braised beef cheeks with beer and mash", "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_with_50441", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large beef cheeks ", "2 onions, roughly chopped", "5 carrots, 4 left whole, 1 cut into chunks", "1 bulb of garlic, cut in half", "3 sprigs thyme", "2 x 500ml/18fl oz bottle porter beer", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "150g/5½ oz butter", "750ml/1¼ pint beef stock", "5 star anise", "50g/1¾oz caster sugar", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "150g/5½oz butter", "150ml/5fl oz full-fat milk or cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef cheeks, place the cheeks in a large bowl with the onions, chopped carrot, garlic and thyme. Pour over the beer, cover and place in the fridge for at least 12 hours, but preferably overnight.", "Preheat the oven to 150C/300F/Gas 2.", "Lift the beef cheeks out from the vegetables, pat dry, then season with salt and pepper. Reserve the marinade.", "Heat a large casserole or ovenproof pan until hot, add the olive oil and a knob of the butter. When foaming, add the beef cheeks two at a time and fry on each side until browned. Remove and set aside.", "Return the beef to the pan with the reserved marinade and add the beef stock.", "Bring to a simmer then cover with a lid, leaving the lid slightly ajar so you have a 1cm/½in gap at the side. Cook in the oven for 4-5 hours.", "Meanwhile, put the whole carrots, star anise, 100g/3½oz of the butter, a pinch of salt and the sugar into a pan and add enough water to just cover. Set on a low heat and cook for 20-30 minutes, or until the carrots are tender and glazed.", "Remove the casserole from the oven and strain the sauce into a saucepan, then place over the heat and cook until the volume of liquid has reduced and is thick enough to just coat the back of a spoon. ", "Whisk in the remaining butter until the sauce is shiny. Season with sea salt and freshly ground black pepper, to taste.", "For the mash, place the potatoes into a pan of cold, salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over a low heat for a couple of minutes to dry the potatoes slightly.", "Meanwhile, put the butter and milk into a saucepan and simmer until the butter is melted.", "Pass the potatoes through a ricer, then add the hot butter and milk (or cream) and beat to form a very smooth mash. Season, to taste, with salt and black pepper.", "To serve, lift out the beef cheeks and place in shallow bowls. Spoon the mash alongside and finish with a generous ladleful of sauce."]}, {"isVegetarian": false, "title": "Braised beef cheeks and parsley salad", "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_and_14349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large beef cheeks ", "1 small onion, quartered", "1 small carrot, quartered", "1 garlic bulb, halved horizontally", "2 fresh thyme sprigs", "1 fresh bay leaf ", "black peppercorns ", "500ml/18fl oz beer", "2 tbsp vegetable oil", "1 litre/1¾ pints chicken stock", "1 shallot, sliced", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "2 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the beef cheeks in a large bowl add the vegetables, herbs and peppercorns; pour over the beer and mix until well combined, then chill in the fridge for 24 hours.", "Preheat the oven to 140C/275F/Gas 1.", "Strain the beer from the beef mixture and set aside.", "Season the beef cheeks with salt and freshly ground black pepper.", "Heat a flameproof casserole dish, add the vegetable oil and brown the beef cheeks all over, then remove from the dish and set aside.", "Reduce the heat, add the onions, carrots and garlic and cook for 4-6 minutes, or until pale golden-brown. ", "Add the herbs and peppercorns, then add the reserved beer and continue to cook until the volume has reduced by half.", "Return the beef to the dish, add the chicken stock and bring up to the boil, then cook in the oven for three hours or until the beef is very tender. ", "For the parsley salad, place the shallot in a bowl, season with salt and freshly ground black pepper, add the lemon juice, olive oil and parsley.", "To serve, spoon the cheeks onto serving plates, pile the salad alongside with a dollop of mash."]}, {"isVegetarian": false, "title": "Braised beef cheeks with quince, bay, cinnamon and olive oil mash", "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_with_54459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small beef cheeks, trimmed", "500ml/18fl oz red wine", "3 bay leaves", "2 garlic cloves, crushed", "4 shallots, halved", "1 tbsp olive oil", "700ml/1¼ pint good beef stock", "1 stick cinnamon ", "3 cloves", "55g/2oz honey", "½ orange, finely grated zest only", "1 quince, peeled, cored and quartered", "sea salt and freshly ground black pepper", "2 large Desirée potatoes, peeled and cut into even chunks", "75ml/2½fl oz double cream", "20g/¾oz unsalted butter, cubed", "100ml/3½fl oz Arbequina or other fresh, grassy olive oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the beef cheeks in a dish and top with the wine, bay, garlic and shallots. Cover and marinate in the fridge overnight or for at least 6 hours.", "Remove the beef cheeks and set aside. Pour the marinade into a casserole dish and place over a medium heat. Bring to the boil and simmer until the volume of the liquid has reduced by three-quarters. ", "Preheat the oven to 150C/130C Fan/Gas 2.", "Heat the oil in a sauté pan over a high heat. Brown the beef cheeks for 4 minutes on each side, or until caramelised. ", "Transfer the cheeks to the reduced marinade and pour in the stock. Add the cinnamon, cloves and honey and bring to the boil. Cover with a lid and transfer to the oven for about 2 hours. Skim the surface every so often to remove any fat.", "Add the zest and quince and cook for a further 1 hour or until the cheeks and quince are soft and tender. Season with salt and pepper. ", "Meanwhile, to make the mash, cook the potatoes in lightly salted water for 20 minutes, or until tender. Drain, then pass through a sieve or vegetable mill.", "Gently heat the cream in a saucepan, then pour it into the potatoes. Fold in the butter and Arbequina olive oil and mix well. Season with salt and pepper. ", "To serve, divide the cheeks and quince between four plates. Add a spoonful of mash and pour over the sauce."]}, {"isVegetarian": false, "title": "Braised beef in red wine", "url": "www_bbc_co_uk_food_recipes_braised_beef_in_red_wine_79613", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_beef_in_red_wine_79613_16x9.jpg", "ingredients": ["1kg/2lb 4oz topside of beef", "1 garlic clove", "2 bay leaves", "2 sprigs rosemary", "8 black peppercorns", "1 large onion, finely chopped", "3 carrots, finely chopped", "2 celery stalks, finely chopped", "1 bottle red wine", "90ml/6 tbsp extra virgin olive oil", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pat the meat all over gently with kitchen paper to dry. Place in a large bowl together with all the other ingredients except for the oil and salt. Cover with clingfilm and marinate in the fridge overnight, or for at least 12 hours. ", "Remove the meat from the marinade, keeping the marinade for later. Pat the meat dry with kitchen paper. Heat the oil in a large saucepan, add the meat and seal well all over. Remove and set aside. ", "In the same saucepan, add the vegetables and herbs from the marinade and sweat for a couple of minutes. Return the meat to the pan, add some salt and cook on a medium heat for 10 minutes. ", "Add the wine from the marinade, bring to the boil then reduce the heat to low and cover with a lid. Cook for about two hours, until the meat is tender and the liquid has reduced, checking from time to time and gently turning over during cooking. Once the meat is cooked to your liking, remove it from the pan and keep it warm. If the sauce needs thickening continue to simmer until it has reduced to sauce consistency.", "To serve, slice the meat and place on a serving dish together with the vegetables and sauce. "]}, {"isVegetarian": false, "title": "Braised beef rump with onions, bay, anchovies and chillies served with courgette salad", "url": "www_bbc_co_uk_food_recipes_braised_beef_rump_with_89208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 white onions, sliced", "1.5kg/3lb 5oz beef rump, cut into 5cm/2in slices", "2 bay leaves", "250g/9oz unsalted butter, plus extra for greasing", "3 garlic cloves, peeled and chopped", "1-2 tsp red wine vinegar", "6 tbsp olive oil", "6 anchovy fillets", "2 red dried chillies", "handful of flatleaf parsley", "salt and freshly ground black pepper", "1 yellow courgette, sliced into strips using a vegetable peeler", "1 green courgette, sliced unto strips using a vegetable peeler", "4 courgette flowers, sliced", "1 carrot, sliced into strips with a vegetable peeler", "3 tbsp olive oil ", "1 tbsp sherry vinegar", "1 tbsp basil, torn", "1 tbsp parsley, chopped", "2 tbsp nasturtium leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1 and grease a casserole with butter.", "For the braised beef rump, layer the onions and beef with dots of butter in the casserole. Season with salt and pepper in between the layers and drop in the bay leaves. Cover with the lid and place in the oven for 1-2 hours, or until the beef is very tender.", "Meanwhile, put the garlic, red wine vinegar, oil, anchovies, chillies and parsley in a food processor and blend to a paste. Once the beef is cooked, add the paste and stir through.", "Put courgettes, courgette flowers and carrots into a large bowl. Mix the oil, sherry vinegar and salt and pepper in a small bowl. Just before serving add the basil, parsley and dressing to the salad and mix.", "To serve, spoon the beef into a shallow serving bowl and place the courgette salad alongside. Garnish with the nasturtium leaves."]}, {"isVegetarian": false, "title": "Braised beef tortellini with wild mushroom sauce", "url": "www_bbc_co_uk_food_recipes_braised_beef_tortellini_29785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz braising steak", "½ onion, roughly chopped", "1 garlic clove, crushed", "1 small carrot, roughly chopped", "2 sprigs thyme", "1 bay leaf", "400ml/14fl oz beef stock", "salt and freshly ground black pepper", "300g/10½oz '00' pasta flour, plus extra for dusting", "4 eggs", "1 tbsp olive oil", "50g/1¾oz unsalted butter", "1 garlic clove, chopped", "250g/9oz wild mushrooms (chanterelles, girolles, ceps, button mushrooms, morelles)", "3 tbsp Madeira", "500ml/18fl oz dark chicken stock", "300ml/10fl oz double cream", "handful fresh tarragon leaves, chopped", "2tbsp fresh chervil leaves, for garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the braised beef filling, preheat the oven to 150C/130C (fan)/Gas 2. ", "Put all the ingredients in a lidded ovenproof dish and cook for 2-3 hours, or until the beef is very tender. Remove the beef from the dish and shred into small strips. Place in a bowl with a little cooking liquor and set aside.", "Put the flour, three eggs and olive oil in a food processor and pulse until it forms small crumbs. Tip the mixture onto a lightly floured work surface and bring together to form a dough. Knead lightly for 2-3 minutes, or until smooth and elastic. Roll into a ball, wrap in cling film and chill in the fridge for 20 minutes.", "Lightly flour your pasta machine to prevent the dough from sticking. Take the dough ball from the fridge, and flatten it slightly with a rolling pin, then starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process, flouring the machine and changing the setting down each time, until you reach the thinnest setting. You can cut the pasta into smaller individual sheets and work on them individually, keeping the remaining unused dough covered under cling film to prevent it drying out.", "Beat the remaining egg in a bowl. Cut out circles from the pasta sheets using a 6cm/2½in pastry cutter, then brush each circle with the beaten egg. Place a heaped teaspoon of the beef filling onto one half of the circle, then fold over the other half and press together to seal. Bring the two corners together to create a ring and pinch to seal. Repeat with the remaining pasta and filling mixture, placing the completed tortellini on a tray lined with greaseproof paper. Cover with cling film until ready to cook.", "For the mushroom sauce, heat the butter in a large frying pan until foaming. Add the garlic and cook for 2-3 minutes. Add the mushrooms and cook for 3-4 minutes, or until golden-brown and the liquid from the mushrooms has been released. Pour in the Madeira and cook until the volume of liquid has reduced by half, then add the stock and reduce again by half. Stir in the cream and tarragon and simmer for 5-7 minutes.", "To cook the tortellini, bring a large pan of salted water to the boil, add the tortellini and cook for 1-2 minutes or until they float to the surface then remove with a slotted spoon and drain. ", "Place the tortellini in a serving bowl and pour over the sauce. Garnish with fresh chervil."]}]