[{"isVegetarian": false, "title": "Chicken in black bean sauce", "url": "www_bbc_co_uk_food_recipes_chicken_in_black_bean_48278", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp light soy sauce", "1½ tbsp Shaoxing rice wine (or dry sherry)", "½ tsp salt", "1 tsp sugar", "1 tsp sesame oil", "2 tsp cornflour", "450g/1lb boneless chicken thighs, cut into 5cm/2in pieces ", "1 tbsp vegetable or groundnut oil", "1 tbsp finely chopped fresh root ginger ", "1½ tbsp finely chopped garlic", "1 tbsp finely chopped shallots", "2½ tbsp fermented black beans, roughly chopped", "3½ tbsp finely chopped spring onions ", "150ml/5fl oz chicken stock"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix together the soy sauce, rice wine, salt, sugar, sesame oil and cornflour in a large bowl. Add the chicken pieces and refrigerate for 1 hour. Drain and discard the marinade.", "Heat a wok or a large frying pan over a high heat until hot. Add the oil and when very hot, add the chicken and stir-fry for 5 minutes, or until lightly browned.", "Add the ginger, garlic, shallots, black beans and 1½ tablespoons of the spring onions and cook for 2 minutes. Add the stock, bring to the boil and then reduce the heat.  Cover the wok or pan and simmer for 8–10 minutes, or until the chicken is cooked.  ", "Garnish with the remaining spring onions and serve. "]}, {"isVegetarian": false, "title": "Chicken in cider", "url": "www_bbc_co_uk_food_recipes_chicken_in_cider_73184", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_in_cider_73184_16x9.jpg", "ingredients": ["30g/1oz butter", "1 red onion, peeled and sliced", "6 chicken thighs", "6 rashers of smoked streaky bacon, cut into postage stamp sized pieces", "2 Discovery apples or similar, cored and sliced into wedges", "300ml/10½fl oz dry cider", "salt", "mashed potato, to serve"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butter in a heavy-based, lidded casserole over a medium heat.", "Add the sliced onion and allow to soften for one minute.", "Place the chicken thighs, skin-side down, into the pan and fry for 2-3 minutes, or until the skin begins to brown.", "Add the sliced bacon, turn the thighs over, and cook for a further 2-3 minutes, or until the bacon begins to colour.", "Add the apples and allow to soften for one minute. ", "Pour in the cider and season with a pinch of salt.  Cover with a lid and simmer for 10-15 minutes, or until the chicken juices run clear. ", "Serve immediately, taking the pot to the table and allowing people to help themselves."]}, {"isVegetarian": false, "title": "Chicken in pandan leaves", "url": "www_bbc_co_uk_food_recipes_chicken_in_pandan_leaves_22365", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs, boneless, skin removed", "2 tbsp red curry paste ", "1 tbsp palm sugar", "3 tbsp fish sauce", "1 tbsp vegetable oil", "½ tsp ground turmeric", "2 tbsp coconut milk", "350g/12oz jasmine rice, to serve", "8 pandan leaves (approximately 2 per chicken thigh)", "dash oil, for frying"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a large bowl, combine all the ingredients, except the pandan leaves, together and rub the marinade into the meat. Refrigerate for 1 hour.", "Meanwhile, rinse the rice until the water runs clear and then cook to packet instructions.", "Fill a glass bowl with boiling water and soak the pandan leaves for 1 minute to make them more pliable.", "Wrap each chicken thigh in a leaf, securing tightly with a cocktail stick.", "Heat a large wok over a medium heat with a dash oil. Fry the parcels for 6–8 minutes on each side, or until cooked through.", "Serve alongside the jasmine rice."]}, {"isVegetarian": false, "title": "Chicken katsu curry", "url": "www_bbc_co_uk_food_recipes_chicken_katsu_curry_48890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_katsu_curry_48890_16x9.jpg", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds ", "1 tsp fennel seeds", "1 tsp fenugreek seeds", "2 cardamom pods", "2 tbsp vegetable oil", "2 onions, sliced", "2 garlic cloves, sliced", "2 small red bird’s-eye chillies", "1 x 400g/14oz tin chopped tomatoes ", "2.5cm/1in piece root ginger, peeled, grated", "1 tbsp ground turmeric", "250ml/9fl oz chicken stock", "1 tbsp honey", "1 tbsp soy sauce", "150g/5½oz plain flour, seasoned with salt and freshly ground black pepper", "200g/7oz Japanese panko breadcrumbs", "2 free-range eggs", "4 chicken breasts, cut into strips", "4 tbsp vegetable oil", "3 carrots, sliced", "2 spring onions, chopped", "cooked basmati rice, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, fry the spices in a dry frying pan for 2-3 minutes, then grind to a powder in a mortar and pestle.", "Heat the oil in the same frying pan used to the fry the spices and fry the onions for 8-10 minutes, or until golden-brown. Add the garlic, chilli, chopped tomatoes, ginger and turmeric.", "Bring the mixture to the boil, then add the stock and simmer for 25 minutes.", "Leave to cool slightly, then blend the mixture until smooth, then stir in the honey and soy sauce. Keep warm.", "Meanwhile, for the katsu curry, sprinkle the flour and breadcrumbs onto separate plates. Beat the eggs in a bowl.", "Dredge the chicken pieces in the flour, then dip in the egg and coat in the breadcrumbs, shaking off any excess.", "Heat the oil in a frying pan over a medium heat and fry the chicken pieces for 2-3 minutes on each side, or until golden-brown. Remove from the pan and set aside to drain on kitchen paper.", "Meanwhile, cook the sliced carrots in a pan of boiling water for 4-5 minutes, or until tender. Drain.", "To serve, stir the cooked carrots and spring onions into the curry sauce. Spoon the cooked rice onto serving plates, spoon over some sauce and top with the fried chicken pieces."]}, {"isVegetarian": false, "title": "Chicken kebab wrap", "url": "www_bbc_co_uk_food_recipes_chicken_kebab_wrap_35076", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz chicken breasts (one large or two small)", "1 tbsp olive oil", "½ tsp cumin", "1 garlic clove, grated", "¼ stock cube, dissolved in a small glassful of hot water", "1 lemon, juice only", "2 large flatbreads or tortilla wraps", "4 tbsp hummus", "handful mixed salad leaves", "1 tomato, sliced", "1 carrot, grated", "Sprig fresh mint (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken breasts on a chopping board and cover loosely with a sheet of cling film. Using a rolling pin or a meat mallet, pound the chicken breast to flatten the thickest parts so that the breast is relatively even in thickness all over. (It will cook quicker.)", "Mix the olive oil, cumin, grated garlic, the juice of half the lemon and some black pepper in a bowl and swish the chicken around to coat it completely. Marinade the chicken breasts for 10 minutes, if you have time. Meanwhile, you can prepare all the salad you want to put in.", "Heat a frying pan until very hot. Lift the chicken breasts from the marinade and allow the excess to drip off. Cook in the hot pan on a high heat for 2 minutes on each side. ", "Add the stock – it will bubble up rapidly. Reduce the heat to medium and partly cover, cooking the chicken for about 5 more minutes or until cooked through (you’ll need to remove it from the pan and cut into it to make sure it’s cooked). Put the cooked chicken breasts onto a warm plate and scrape all the juices out on the top. ", "To serve, heat the flatbreads in the frying pan over a medium-high heat for a minute either side until they are warmed through and a little toasty. Place the flatbreads on two plates and spread each with some hummous. Slice the chicken into thin strips and divide between the two flatbreads. Top with salad and sauces that you like and a squeeze of lemon juice. Roll up and serve."]}, {"isVegetarian": false, "title": "Chicken Kiev with a seasonal salad, garlic and cheese croutons", "url": "www_bbc_co_uk_food_recipes_chicken_kiev_with_a_21730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic bulbs, the top cut off", "2 tbsp olive oil", "225g/8oz unsalted butter, softened", "4 tbsp chopped fresh flat leaf parsley leaves", "vegetable oil, for deep-frying", "4 skinless chicken breasts, wing bone left in (ask your butcher to do this for you)", "75g plain flour", "3 free-range eggs, lightly beaten", "90g/3¼oz Japanese panko breadcrumbs", "1 loaf ciabatta, cut into 6 slices", "4 tbsp olive oil", "8 slices pancetta", "250g/9oz strongly flavoured cheese, grated", "1 baby gem lettuce, leaves separated", "10g bull’s blood leaves", "1 bunch fresh rocket", "1 head red radicchio, leaves separated", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "200-300ml/7-10fl oz flavourless oil like vegetable oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken Kiev, preheat the oven to 200C/180C Fan/Gas 6.", "Place the garlic bulbs in tin foil and drizzle with the oil and season with salt and freshly ground black pepper. Fold the tin foil over to create a sealed parcel. Roast in the oven for 15-20 minutes, or until soft.", "Put the butter into a bowl. Squeeze one of the roasted bulbs of garlic from the skin, and add to the butter with the parsley and mix. Season, to taste, with salt and freshly ground black pepper. ", "Place a sheet of cling film on a clean work surface. Spoon the garlic butter onto the cling film, then pull the edge of the cling film on top of the butter and mould the butter into a log shape. Twist the ends of the cling film to seal and chill in the fridge for at least an hour, or until needed.", "Heat the oil in a deep-fat fryer to 160C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "While the oil is heating, carefully cut a deep pocket in each of the chicken breasts, inserting the knife into the bone end, just under the bone. ", "Remove the cling film from the chilled garlic butter and cut into 1cm/½in thick slices. Stuff each chicken breast with a few slices of garlic butter, pushing them into the chicken as far as possible.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Scatter the breadcrumbs onto another plate. Dust each chicken breast first in the flour, then dip into the beaten egg, then roll in the breadcrumbs until completely coated. ", "Carefully lower the chicken Kiev’s into the hot oil, two at a time, and fry for 8-10 minutes, or until the breadcrumbs are golden-brown and the chicken is cooked through. Set the chicken Kiev’s aside on a plate lined with kitchen paper to drain and keep warm. Repeat the process with the remaining two Kiev’s.", "For the garlic and cheese croutons, heat a large griddle pan. Preheat a grill to high.", "Drizzle the cut ciabatta with the olive oil and place cut side down on the griddle and cook for 1-2 minutes.", "Meanwhile heat a medium frying pan and add the pancetta. Cook on each side for 1-2 minutes or until crisp.", "Remove the bread from the griddle and spread it with the remaining roasted garlic. Top with the pancetta and grated cheese. Put on a baking sheet and grill until the cheese has melted.", "Remove from the grill and when cool enough to handle cut into 2cm/1in crouton shapes and set aside.", "For the salad, place all the leaves in a large bowl and mix to combine.", "In a separate small bowl add the oil, vinegar, mustard and whisk. Gradually add the oil until you have a dressing consistency. Just before serving add the dressing to the leaves and mix. Add the diced croutons to the salad and mix again.", "To serve, put a chicken Kiev on each serving plate along with some salad."]}, {"isVegetarian": false, "title": "Chicken kievs", "url": "www_bbc_co_uk_food_recipes_chicken_kievs_21151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["160g/5½oz butter, softened", "2-3 large garlic cloves, finely chopped", "4 tbsp freshly chopped parsley", "1 lemon, finely grated zest and juice only ", "salt and pepper", "4 free-range skinless chicken breasts", "6-8 tbsp plain flour", "1-2 tsp ground paprika", "2 large free-range eggs, beaten", "200g/7oz dried breadcrumbs", "sunflower oil, for shallow frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "To make the filling, mix the butter with the garlic, parsley, lemon zest, lemon juice and a pinch of salt and pepper, to taste, in a bowl. Shape the flavoured butter into two logs, using cling film to help you wrap and roll. Chill until firm.", "Make a pocket in each chicken breast by cutting a slash lengthways through the breast. Cut the butter logs in half and place one half in each chicken pocket. Secure with cocktail sticks.", "Mix the flour, paprika and some salt and pepper together in a shallow bowl. Tip the beaten eggs into another shallow bowl and the breadcrumbs into a third shallow bowl. Dredge the stuffed chicken breasts in the flour to coat, then into the egg, turning until covered. Repeat the flour and egg coating once more, then dip into the breadcrumbs and coat completely.", "Pour the oil into a frying pan to a depth of about  1cm/½in and set over a high heat. Check that the oil is hot enough, and then lower the chicken breasts carefully into the pan. Spoon hot oil over the top to seal the crumbs for about a minute. Turn over to brown the other side, again spooning oil over the top until golden-brown; this should take a further 1-2 minutes.", "Remove the chicken from the oil and place in a shallow roasting tin. Bake the chicken in the oven for 10-12 minutes, or until the breasts feel firm when pressed. Remove and drain on kitchen paper. Carefully remove the cocktail sticks and serve."]}, {"isVegetarian": false, "title": "Chicken Kievs", "url": "www_bbc_co_uk_food_recipes_chicken_kievs_69553", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, softened", "2 garlic cloves, peeled and grated", "1 tsp table salt", "½ tsp cayenne pepper", "3 tbsp chopped fresh parsley", "2 large skinless chicken breasts", "150g/5½oz plain flour", "2 large free-range eggs", "150g/5½oz Japanese panko breadcrumbs", "vegetable oil, for shallow frying", "pinch sea salt flakes"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a bowl, beat together the softened butter, garlic, salt, cayenne pepper and parsley until well combined. Spoon the butter into a piping bag fitted with a large plain nozzle. Alternatively, put the butter into a food bag, twist the bag to push the butter into one corner and snip off the tip. ", "Using a sharp knife, make a deep, wide 'pocket' in the thickest end of each chicken breast, without cutting all the way through. Fill each chicken breast with as much of the butter mixture as possible. ", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Break up the panko breadcrumbs using your hands or pulse in a food processor. Sprinkle the crumbs onto another plate.", "One by one, dust the chicken breasts first in the flour, then dip them into the egg, then roll them in the breadcrumbs until completely coated. Place the coated chicken breasts onto a plate, cover, then chill in the fridge for at least 20 minutes, or until needed. ", "When the chicken breasts have chilled, preheat the oven to 200C/400F/Gas 6. ", "Heat a little of the vegetable oil over a low-medium heat in a large non-stick frying pan. Fry the chicken Kievs for 3-4 minutes on each side, or until golden-brown all over. Sprinkle with salt flakes, then transfer to a roasting tray and cook in the oven for 10-15 minutes, or until the chicken is cooked through. (The chicken is cooked through when the juices run clear when the thickest part of the meat is pierced with a skewer - remember not to pierce the chicken all the way to the buttery centre!) Serve immediately."]}, {"isVegetarian": false, "title": "Chicken kiev with a cucumber and spring onion salad", "url": "www_bbc_co_uk_food_recipes_chicken_kiev_with_a_68028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, preferably free-range, skin removed", "150g/5½oz  butter, at room temperature", "bunch fresh parsley, finely chopped", "3 garlic cloves, crushed", "2 spring onions, finely chopped", "50g/1¾oz Cheddar, grated", "salt and freshly ground black pepper", "2 free-range eggs, beaten", "3 tbsp plain flour", "3 tbsp golden breadcrumbs", "sunflower oil, for deep-frying", "2 cucumbers, peeled, core removed", "2 spring onions, chopped", "50g/1¾oz soured cream", "1 tbsp mayonnaise", "large pinch paprika", "salt and freshly ground black pepper", "2 free-range eggs, hardboiled, peeled, sliced"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the kievs, slit each chicken breast down its longer side, almost cutting through to the other side (the breast should open out like a book). Place the opened chicken breast between two pieces of clingfilm and flatten with a rolling pin. Set aside. Repeat with the remaining three chicken breasts. ", "Mix the butter, parsley, garlic, spring onions and grated cheese in a bowl. Divide this stuffing into four and form each portion into a sausage shape. Set aside. ", "Pour the beaten eggs into a bowl and spread the flour and breadcrumbs onto separate plates. ", "Meanwhile, for the salad, peel the cucumbers into thin ribbons using a vegetable peeler and mix with the spring onions, soured cream, mayonnaise and paprika. Season to taste with salt and freshly ground black pepper. Garnish with the slices of hard-boiled egg. Set the salad aside until ready to serve.", "Lay a chicken breast flat on a chopping board, season with salt and freshly ground black pepper, and place a portion of stuffing in the middle. Roll the chicken very tightly around the stuffing and then dip in the flour to coat the chicken evenly. Dip into the beaten egg, and then roll in the breadcrumbs. Repeat with the remaining chicken breasts and stuffing. ", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns light golden when dropped into it. Alternatively, use an electric deep-fat fryer heated to 160C/325F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) NB: it’s important that the oil temperature isn’t too hot or the outside of the chicken will burn before the inside is cooked. ", "Cook the chicken for about 15 minutes until the coating is golden and crispy and the chicken is cooked through (test the chicken by removing to a plate and piercing with a skewer – the juices will run clear when the chicken is cooked). ", "Remove the chicken from the pan with a slotted spoon and set aside to drain on kitchen paper.", "Serve the chicken kievs with the cucumber salad alongside."]}, {"isVegetarian": false, "title": "Chicken, leek and mushroom pie with cauliflower mash topping", "url": "www_bbc_co_uk_food_recipes_chicken_leek_and_17968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_leek_and_17968_16x9.jpg", "ingredients": ["1 tbsp ghee", "2 leeks, trimmed, sliced", "2 large celery stalks, trimmed, diced", "1 bay leaf", "500ml/17fl oz hot chicken stock, preferably homemade", "4 carrots, sliced", "1 small fennel bulb, outer leaves removed, flesh diced", "250g/9oz mushrooms, sliced", "600g/1lb 5oz cooked leftover roast chicken ", "large handful chopped fresh flatleaf parsley", "salt and freshly ground black pepper   ", "1.2kg/2lb 10oz cauliflower, outer leaves removed, florets chopped into 5cm/2in pieces               ", "4 garlic cloves, peeled and left whole", "50g/2oz butter", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Heat the ghee in a frying pan over a medium heat. Add the leeks and fry for 4-5 minutes, or until softened but not browned. Add the celery and bay leaf and increase the heat to high. Fry for 1-2 minutes.", "Add the chicken stock to the pan and bring to the boil, then add the carrots, fennel and mushrooms and reduce the heat until the mixture is simmering. Continue to simmer the mixture until the volume of liquid has reduced and thickened, and the vegetables are tender, about 12-15 minutes.            ", "Meanwhile, for the topping, put the cauliflower, garlic cloves and half of the butter in a large, lidded saucepan. Add 4 tablespoons of water and cover.", "Bring the pan contents to a simmer over a medium heat and steam for 6-8 minutes, or until the cauliflower is tender when pierced with a knife (add a splash more water during cooking if necessary). Remove from the heat and transfer the contents to a food processor. Blend to your consistency of choice - either smooth and creamy or roughly textured. Season witth salt and pepper. ", "To finish the pie filling, remove the bay leaf and add the remaining filling ingredients to the pan. Season with salt and pepper. Stir well, then transfer the mixture to an ovenproof pie dish.                                ", "Spoon the pie topping over the filling and spread into an even layer using a palette knife. Use a fork to create a criss-cross pattern on top of the filling. Dot the top of the pie with the remaining butter. ", "Bake for 25-30 minutes, or until the filling is bubbling and the topping is golden-brown."]}, {"isVegetarian": false, "title": "Chicken korma", "url": "www_bbc_co_uk_food_recipes_chicken_korma_16352", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_korma_16352_16x9.jpg", "ingredients": ["4 fairly small boneless, skinless chicken breasts (about 600g/1lb 5oz)", "freshly ground black pepper", "25g/1oz low-fat natural yoghurt", "1 tbsp sunflower oil", "2 large onions, chopped (400g/14oz prepared weight)", "4 garlic cloves, peeled and sliced", "20g/¾oz piece fresh root ginger, peeled and finely grated", "12 cardamom pods, seeds crushed", "1 tbsp ground cumin", "1 tbsp ground coriander", "½ heaped tsp ground turmeric", "¼ tsp hot chilli powder", "1 bay leaf", "4 whole cloves", "1 tbsp plain flour", "small pinch saffron", "2 tsp caster sugar", "½ tsp fine sea salt, plus extra to season", "3 tbsp double cream", "fresh coriander, roughly torn, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Cut each chicken breast into eight or nine bite-sized pieces, season with black pepper and put them in a non-metallic bowl. Stir in the yoghurt, cover with cling film and chill for a minimum of 30 minutes but ideally 2–6 hours.", "Heat the oil in a large, non-stick saucepan and add the onions, garlic and ginger. Cover and cook over a low heat for 15 minutes until very soft and lightly coloured. Stir the onions occasionally so they don’t start to stick.", "Once the onions are softened, stir in the crushed cardamom seeds, cumin, coriander, turmeric, chilli powder and bay leaf. Pinch off the ends of the cloves into the pan and throw away the stalks. Cook the spices with the onions for five minutes, stirring constantly.", "Stir in the flour, saffron, sugar and ½ teaspoon of salt, then slowly pour 300ml/½ pint cold water into the pan, stirring constantly.", "Bring to a gentle simmer, then cover and cook for 10 minutes, stirring occasionally.", "Remove the pan from the heat, take out the bay leaf and blend the onion mixture with a stick blender until it is as smooth as possible. You can do this in a food processor if you prefer, but let the mixture cool slightly first.", "The sauce can now be used right away or cooled, covered and chilled until 10 minutes before serving.", "Drain the chicken in a colander over the sink, shaking it a few times – you want the meat to have just a light coating of yoghurt. ", " Place a non-stick frying pan on the heat, add the sauce and bring it to a simmer.", "Add the chicken pieces and cream and cook for about 10 minutes or until the chicken is tender and cooked through, stirring regularly. Exactly how long the chicken takes will depend on the size of your pieces, so check a piece after eight minutes – there should be no pink remaining.", "Adjust the seasoning to taste, spoon into a warmed serving dish and serve garnished with fresh coriander if you like."]}, {"isVegetarian": false, "title": "Chicken, leek and wild mushroom parcels with a chicory and radish salad", "url": "www_bbc_co_uk_food_recipes_chicken_leek_and_wild_27527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["270g/9½oz unsalted butter ", "2 boneless, skinless corn-fed chicken breasts (about 180g/6¼oz each), cut into 2cm/¾in cubes ", "2 lemons, 1 for zest and juice only, 1 whole ", "2 tbsp Greek yoghurt ", "2 tsp finely chopped tarragon leaves ", "1 small, young leek, green part only, cut in half lengthways and sliced", "200g/7oz mixed wild or shiitake mushrooms ", "1 tbsp sunflower oil ", "2 x 270g packs fresh readymade filo pastry", "1 free-range egg, beaten ", "2 tbsp sherry vinegar ", "200ml/7fl oz chicken stock ", "200ml/7fl oz whipping cream ", "2 large heads chicory, halved lengthways and leaves separated ", "12 radishes, thinly sliced ", "3 tbsp chopped parsley leaves ", "1 tbsp Chardonnay vinegar (alternatively use white wine vinegar)", "3 tbsp extra virgin olive oil ", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken parcels, first clarify the butter. Put 250g/9oz of the butter in a saucepan over a very low heat. Leave for 30 minutes until the butter has melted and the solids have fallen to the bottom. Remove from the heat and do not disturb the pan. ", "Mix the chicken, lemon zest and juice, yoghurt and half the tarragon in a bowl. Cover and marinate in the fridge for 30 minutes. ", "Bring a saucepan of water to the boil, add the leek, return to the boil and blanch for 1 minute. Lift out using a slotted spoon and refresh in ice-cold water. Transfer to a plate and pat dry with kitchen paper. Add the mushrooms to the boiling water, blanch for 1 minute, then lift out, refresh and pat dry. ", "Heat a large, non-stick frying pan over a high heat. Add the remaining butter and sunflower oil. When the butter is foaming, add the mushrooms and fry for 2 minutes. Add the leek and chicken and fry for 2 minutes, or until starting to colour. Remove from the pan and leave to cool at room temperature. Don’t wash the pan as you will need it later.", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Cut the filo into 16 rectangles 16x22cm/6¼x8½in and cover with a clean, damp tea towel to prevent them drying out. For each filo pie, working quickly, one piece at a time, lay a sheet of filo on the work surface and brush lightly with clarified butter, then grate a little lemon zest from the whole lemon over the top. Lay a second sheet over the top and brush with butter as before, then season with a little salt. Put another sheet on top, brush with butter again and grate over a little lemon zest. Finish with a fourth sheet, then a little pepper. ", "Beat together the egg and 1 tablespoon water to make an egg wash. Brush the edges of the pastry with the egg wash, then spoon a quarter of the chicken mixture onto the bottom half of the pastry. Gently fold the pastry over the filling, press the edges together and tuck them under to seal and form a little parcel. Transfer to a baking tray and refridgerate while you make the remaining 3 parcels. ", "Brush the outsides of the finished parcels with the clarified butter and bake for 20–25 minutes until golden-brown and crisp.  ", "Meanwhile, for the chicory and radish salad, toss the chicory leaves, radishes and parsley together in a bowl. In a small bowl, whisk the vinegar and oil together then season with salt and pepper. Just before serving, drizzle the dressing over the leaves and toss to coat. ", "Return the frying pan to a medium heat, add the sherry vinegar and deglaze by stirring to remove any caramelised bits stuck to the bottom. Add the stock and cream, turn the heat down to low and simmer for 10–12 minutes until the volume of liquid has reduced by half and the sauce is thick enough to coat the back of a spoon. Add the remaining tarragon and season with salt and pepper, to taste.  ", "To serve, spoon the sauce over the parcels and arrange the salad alongside."]}, {"isVegetarian": false, "title": "Chicken, lentil and leek bake", "url": "www_bbc_co_uk_food_recipes_chicken_lentil_and_leek_58385", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_lentil_and_leek_58385_16x9.jpg", "ingredients": ["2 leeks, halved and finely sliced", "6 fresh thyme sprigs", "4 garlic cloves, crushed", "2 x 250g packet vacuum-packed puy lentils", "200g/7oz radishes, halved", "4 free-range chicken breasts", "4 tsp mustard", "40g/1½oz panko breadcrumbs", "20g/¾oz fresh flat-leaf parsley, finely chopped", "1½ tbsp olive oil", "300ml/10fl oz hot chicken stock", "4 tbsp crème fraîche", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Place the leek, thyme, garlic, lentils and radishes in a roasting tin, stir to combine and make four indentations in the mixture. Place the chicken breasts in the indentations and cover each breast with a teaspoon of mustard.", "Mix together the breadcrumbs, parsley, olive oil and sea salt in a small bowl. Scatter evenly over the mustard on each chicken breast. ", "Carefully pour the stock into the tin, covering the vegetables and around the chicken breasts. Take care not to get any stock on the breadcrumbs. ", "Roast for 35–40 minutes, or until the chicken is cooked through and the breadcrumbs are crisp and golden. The chicken is cooked when the juices run clear with no trace of pink when the thickest part of the breast is pierced with a skewer. Leave the dish to stand for 10 minutes.  ", "Stir in crème fraîche and season with salt and pepper. Serve immediately.  "]}, {"isVegetarian": false, "title": "Chicken liver parfait with shallot chutney and melba toast", "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_29225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, softened", "500g/1lb 2oz chicken livers, trimmed", "1 garlic clove, chopped", "2 sprigs thyme, leaves only", "3 tbsp Madeira wine", "salt and freshly ground black pepper", "200g/7oz clarified butter", "2 tsp chopped chives, to garnish", "50g/1¾oz butter", "8 banana shallots, peeled and cut into rings", "75g/2½oz dark brown sugar", "2 sprigs fresh thyme, leaves only", "200ml/7fl oz balsamic vinegar", "8 slices white bread, crusts removed", "4 tbsp basil cress"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken liver parfait, line a loaf tin with cling film.", "Heat one tablespoon of the butter in a frying pan over a medium heat. When the butter is foaming, add the chicken livers. Fry for 1-2 minutes, or until just golden-brown.", "Add the garlic, thyme and Madeira. Fry the chicken livers in the mixture for a further 1-2 minutes.", "Transfer the mixture to a food processor, add the remaining butter and blend to a smooth paste. Season, to taste, with salt and freshly ground black pepper.", "Spoon the parfait mixture into the lined loaf tin, pour over the clarified butter and top with the chives. Chill in the fridge for at least three hours, or until set.", "For the shallot chutney, place the butter in a large frying pan and heat until melted. Add the shallots, cover and cook on a low heat until the shallots have softened and caramelised.", "Add the sugar, thyme and vinegar and cook for a further 10 minutes.", "For the melba toast, preheat the grill to its highest setting. ", "Place four of the slices of bread onto a baking tray and toast for 1-2 minutes on each side, or until crisp and golden-brown on both sides.", "Slice the toast horizontally and return the toast to the baking tray, soft-sides facing upwards. Grill for 1-2 minutes, or until crisp and golden-brown.", "Repeat the process with the remaining four slices of bread. Cut each slice of Melba toast into four triangles.", "To serve, place a quenelle (or a slice) of parfait onto each of four plates and serve with the chutney and melba toast. Garnish with basil cress."]}, {"isVegetarian": false, "title": "Chicken liver parfait", "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_53623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz fresh chicken livers, free-range or organic, sinews and gall bladders removed", "500ml/18fl oz milk", "4 tsp salt", "100ml/4fl oz dry Madeira", "100ml/4fl oz ruby port", "60g/2½oz shallots, finely chopped", "2 sprigs thyme, leaves only, finely chopped", "1 garlic clove, peeled and crushed", "50ml/2fl oz Cognac", "5 medium free-range eggs", "400g/14oz unsalted butter, melted and kept warm", "2 pinches freshly ground black pepper", "75g/3oz softened butter", "75g/3oz softened lard"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Soak the chicken livers in the milk, 500ml/18fl oz water and two teaspoons of the salt in a shallow dish for one hour. This will draw out most of the blood, which can make the livers bitter, giving the parfait a more delicate flavour. Rinse and drain the livers well.", "Preheat the oven to 130C/270F/Gas ½.", "Put the Madeira, port, shallots, thyme, garlic and Cognac in a small saucepan and bring to a boil. Let the mixture bubble until reduced by one-third and then remove the pan from the heat. The bitterness of the alcohol will have evaporated off and the flavours of the herbs will infuse into the liquid.", "Place the drained chicken livers and the contents of the pan in a blender or food processor and process, adding one egg at a time, for 3-4 minutes, or until the texture is silky smooth.", "Gradually add the melted butter (if you add it too quickly, the parfait may split), the remaining salt and the pepper. Taste the mixture and correct the seasoning if necessary.", "Line the base and sides of a 23cm x 9cm x 8cm/9in x 3½in x 3in terrine tin with greaseproof paper, leaving a 3cm/1in overlap above the top of the tin. The paper will protect the parfait from direct heat and prevent it discolouring and becoming hard.", "Using the back of a ladle, press the parfait mixture through a fine sieve into a large bowl then pour into the terrine tin and cover with another piece of greaseproof paper cut to fit. ", "Place the terrine in a deep baking tray and pour in boiling water until it reaches two-thirds of the way up the sides of the tin. This bain marie method of cooking allows the heat of the oven to permeate through the water and cook the parfait very gently so that it is cooked though evenly.", "Cover the tray loosely with a sheet of perforated foil and place it in the oven. Check the temperature of the parfait with a temperature probe after 40 minutes – the parfait is cooked when the middle has reached 65C-70C/150F-158F. Do not overcook or it will split and lose its fine texture.", "When the parfait is cooked, remove the terrine tin from the baking tray, leave it to cool for 30 minutes at room temperature then refrigerate.", "Discard the greaseproof paper from the top of the parfait then dip the tin in a deep tray of hot water. Slide a hot knife between the sides of the tin and the greaseproof lining then hold the edges of the lining and carefully lift the parfait from the tin onto a chopping board.", "Peel away the greaseproof paper from the sides of the parfait. Warm a palette knife in hot water and smooth the top and sides of the parfait, trimming away any discolouration on the top. Return the parfait to the fridge for at least 30 minutes to firm it up, or place it in the freezer for 15 minutes.", "To finish, beat the softened butter and lard together and spread a thin layer over the top of the parfait using a palette knife. ", "Line a flat baking tray with a sheet of clean greaseproof paper. Flip the parfait over onto the tray and spread the remaining butter/lard mixture over the sides and what has now become the top. Covering all the surfaces of the parfait with this mixture will prevent it from oxidising and discolouring.", "Return the parfait to the fridge and chill for at least one day before serving; two days is ideal.", "To serve, dip a knife into hot water and cut the parfait into thick slices. Serve with chutneys, pickles and toasted sourdough bread, or spread onto crostini to serve as canapés. Red Burgundy is the perfect wine match."]}, {"isVegetarian": false, "title": "Chicken liver parfait with pickled beetroot and toasted sourdough", "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_98548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp Madeira ", "1 tbsp port", "1 shallot, chopped", "1 tbsp brandy", "sprig thyme", "1 garlic clove, crushed", "250g/9oz chicken livers (trimmed weight)", "2 free-range eggs", "250g/9oz unsalted butter", "50g/2oz sugar", "50ml/2fl oz red wine vinegar", "2 large fresh beetroot, 1 finely sliced, 1 juiced", "salt and pepper", "small bunch fresh mint, leaves picked and thinly sliced", "1 gelatine leaf", "sourdough bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ½. ", "Put the Madeira, port, shallot, brandy, thyme and garlic in a pan and simmer gently until the onions are soft. Add the chicken livers and cook for 2-3 minutes.", "Transfer the livers and their cooking liquid to a food processor and blend until smooth. With the motor still running, gradually add the eggs and then the butter. Blend until well combined and completely smooth. Pass the parfait through a fine sieve into a bowl.", "Divide the parfait between four ramekins. Place the ramekins in a large deep roasting tin and pour boiling water into the tin to reach halfway up the ramekins. Cover the tin loosely with foil and carefully place in the oven for 20-25 minutes.", "Meanwhile, heat the sugar and vinegar in a pan until the sugar dissolves. Add the finely sliced beetroot to the mixture and simmer for 1-2 minutes. Drain the excess liquid and season to taste with salt and freshly ground black pepper. Mix with the finely sliced mint and set aside.", "Once the parfaits have cooked, remove from the oven set aside to cool.", "Soak the gelatine leaf in a bowl of cold water until soft, then squeeze out any excess water and add to the beetroot juice with 50ml/1¾fl oz boiling water. Stir until the gelatine has dissolved.", "Pour the gelatine mixture over the parfait to form a thin layer and refrigerate until set.", "Serve with toasted sourdough and a spoonful of the pickled minted beetroot."]}, {"isVegetarian": false, "title": "Chicken liver pâté with allspice", "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_06158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_liver_pt_06158_16x9.jpg", "ingredients": ["15g/½oz butter", "½ small onion or one shallot, finely chopped", "1 sprig fresh thyme, leaves picked and finely chopped", "400g/14oz chicken livers, roughly chopped", "1 tsp finely ground white pepper", "3 allspice berries, finely ground (available online and in some supermarkets)", "50ml/2 fl oz sherry or brandy ", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a frying pan. When it is just foaming, add the onion and thyme. Sauté until the onion is soft and translucent, then add the chicken livers and spices. ", "Turn up the heat and fry until the livers are just cooked through, this should take about 3-5 minutes. To test if the chicken is cooked, remove a piece of liver and cut it open; it should be moist but not bloody ,a little tinge of pink is fine. Transfer the mixture to a bowl and leave to cool. ", "Return the frying pan to the heat, pour in the sherry. Allow to bubble and reduce by half, stirring and scraping up any sediment from the bottom of the frying pan as you go, remove from the heat and leave to cool. ", "Put the chicken mixture in a food processor. Pour in the reduced sherry. Pulse the food processor until the pâté is smooth. To make the pâté extra smooth pass it through a coarse sieve. Season with salt to taste.", "Put the pâté in a terrine dish or pot and chill in the fridge for about 2 hours. If you want to keep the pâté for a few days, cover it with clarified butter."]}, {"isVegetarian": false, "title": "Chicken liver pâté with apple and walnut chutney", "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_04850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz chilled butter, plus extra for greasing", "500g/1lb 2oz chicken livers, cleaned", "1 tbsp fresh marjoram or thyme leaves", "5 tbsp brandy", "75g/3oz ghee or clarified butter", "8 slices white bread, crusts removed", "salt and freshly ground black pepper", "200g/7oz light soft brown sugar", "2 shallots, finely chopped", "90g/3¼oz dried apricots, finely chopped", "300ml/10½fl oz cider vinegar", "450g/1lb Bramley apples, peeled, cored and roughly chopped", "1 tsp ground cinnamon", "1 pinch ground cloves", "125g/4½oz walnut halves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8. Grease a terrine or loaf tin with butter then line with 2 layers of cling film, leaving a generous overhang at the edges.", "Arrange the chicken livers in a single layer in a large roasting tray, sprinkle over the marjoram or thyme and drizzle over the brandy. Season with salt and pepper, then roast for 4-5 minutes, or until the livers are cooked on the outside but still just pink in the centre.", "Transfer the contents of the roasting tray to a food processor and blend to a fine purée with the chilled butter. Season again, to taste.", "Spoon the mixture into the prepared terrine and smooth the top with a palette knife. Cover the top with the overhanging cling film. Chill in the fridge for 30 minutes, then top with the clarified butter and chill for a further 2 hours, until set.", "Meanwhile, for the chutney, heat the sugar in a large, heavy-based frying pan over a medium heat, until melted and caramelised, then add the shallots and apricots. The mixture will become lumpy, but keep the pan on the heat and continue to cook.", "Add the cider vinegar and cook until incorporated into the mixture, then stir in the Bramley apples, cinnamon and cloves and cook for 10 minutes, stirring well, until the apples are tender and the chutney has thickened.", "Remove the pan from the heat and stir in the walnuts, then season, to taste, with salt and pepper. Transfer to a sterilised jar and seal, or serve straight away.", "Just before serving, make the Melba toast. Preheat the grill to medium, toast the bread slices until pale golden-brown on both sides, then cut each bread slice in half horizontally to create 2 thinner slices, with one toasted side and one untoasted side. Remove any excess dough from the untoasted side - the aim is to make the slices as thin as possible so that every crumb toasts well. Cut the slices into triangles then grill the untoasted sides until golden-brown.", "To serve, peel the cling film from the surface of the pâté, upturn the terrine onto a plate, lift off the terrine and peel away the cling film. Slice and serve with the chutney and Melba toast."]}, {"isVegetarian": false, "title": "Chicken liver pâté with figs, chutney and ciabatta toast", "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_01703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz chicken livers, trimmed", "300g/10½oz butter", "75ml/2½fl oz Madeira", "2 tbsp chopped fresh tarragon leaves", "salt and freshly ground black pepper", "1 bay leaf", "2 sprigs fresh thyme", "2 chives", "75ml/2½fl oz  clarified butter", "1 tbsp olive oil", "1 ciabatta bread, thinly sliced", "1 tbsp vegetable oil", "2 shallots, finely diced", "1 tsp fresh rosemary, finely chopped", "100g/3½oz sultanas", "50g/2oz raisins", "50g/2oz demerara sugar", "200ml/7fl oz cider vinegar", "50g/2oz crystalised ginger, finely sliced", "325g/11½oz dried figs, cut in half", "½ tsp fresh nutmeg", "1 tsp ground allspice", "150g/5½oz mixed leaf salad", "8 fresh figs, cut into quarters", "3 tbsp olive oil", "1 tbsp cider vinegar", "1tsp Dijon mustard"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken liver pâté preheat the oven to 200C/400F/Gas 6.", "Place the chicken livers into a large roasting tray in a single layer. Dot with 50g/2oz of the butter. Pour over the Madeira and sprinkle over the tarragon leaves. Roast in the oven for 4-5 minutes, or until the livers are cooked on the outside but pink inside.", "Blend the chicken livers in a food processor with the remaining 250g/9oz butter to a smooth purée.", "Season with salt and freshly ground black pepper, then spoon the pâté into a 23 x 12cm/9 x 4½in loaf tin lined with cling film and smooth the top with a palette knife.", "Place the bay leaf, thyme sprigs and chives on top of the pâté, then pour over the clarified butter. Tap the sides of the dish gently to ensure that the surface of the pâté is evenly covered in clarified butter and any air bubbles are released. Chill in the fridge for two hours, or until set.", "Remove the pâté from the fridge 20 minutes before serving.", "For the chutney, heat the oil in a medium sauce pan. Once hot add the shallot and gently fry for 2-3 minutes. Add the rosemary, sultana, raisins and sugar and fry until the fruit begins to caramelise. Add the rest of the ingredients, bring to the boil, reduce the heat and simmer for 5-10 minutes.", "For the salad, place the leaves and cut figs in a bowl. Whisk the oil, vinegar and mustard in a small bowl to combine.", "To serve, heat a grill until hot, and drizzle the oil on the bread. Toast the bread for 1-2 minutes on each side. ", "Remove the pâté from the cling filmed tin and peel off the cling film. ", "Take two tablespoons, and shape the pâté into a quenelle. Place the pâté on the plate. Place the chutney on the side and the ciabatta next to it. Dress the salad and place on the plate."]}, {"isVegetarian": false, "title": "Chicken livers wrapped in a spiced omelette with a fennel and onion salad", "url": "www_bbc_co_uk_food_recipes_chicken_livers_wrapped_23520", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small fennel, thinly sliced", "1 red onion, thinly sliced", "12-15 fresh mint leaves, finely shredded", "1 green chilli, finely chopped", "1 tomato, cut into four and sliced", "½ lime, juice only", "1 tsp cider vinegar", "salt, to taste", "1 mango, peeled, stone removed, flesh chopped", "225g/8oz chicken livers, trimmed", "1 x 2.5cm/1in piece fresh ginger, peeled and finely chopped", "5-6 garlic cloves, peeled and finely minced", "1 green chilli, finely chopped", "¼ tsp turmeric", "½ tsp ground cumin", "1 tsp ground coriander", "½ lime, juice only", "1-2 tbsp sunflower oil", "2 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint", "salt, to taste", "4 medium free-range eggs", "1 medium red onion, finely chopped", "1-2 thin green chillies, finely chopped", "1 tomato, flesh only, finely chopped", "1 heaped tbsp finely chopped fresh coriander", "2 tbsp oil", "1 brown onion, sliced", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fennel and red onion salad, mix all of the ingredients together and set aside until ready to serve.", "Clean the chicken livers, taking care to remove all the membranes. Cut them into small pieces and put in a bowl. ", "Mix the ginger, garlic, chilli, turmeric, cumin, coriander and lime juice in with the livers. You can set this aside in the refrigerator for a few hours if you like. ", "Put the oil in a heavy-bottomed frying pan set over a high heat. When the oil begins to smoke, add the livers, spread them out and do not agitate the pan. After a few seconds shake the pan around or toss them, then let them settle again. (The pan has got to be really hot to prevent the livers from releasing too much liquid and losing their texture and flavour. Too much stirring introduces colder air to the base of the pan, thereby cooling it down.) If the pan remains hot enough the livers will cook within 2 minutes. To check the livers are cooked, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine).", "Season, to taste, with salt. Stir in half the coriander and mint (reserve the rest for the garnish). Immediately transfer to a colander set over a bowl to prevent any further cooking and to prevent the omelette from getting soggy from the juices from the livers.", "For the spiced omelette, break the eggs into a bowl and beat. Add the red onion, chillies, tomatoes and coriander. Season with salt and pepper and beat again. ", "Heat two small frying pans and add a tablespoon of oil to each. When the oil is hot, add half the egg mixture to each pan. Cook until browned on one side and cooked through. Remove from the heat. Divide the liver mixture between the two omelettes, sprinkle the sliced onion on top and garnish with the reserved coriander and mint. Roll up the omelettes.", "Cut the omelettes into two and serve with the salad alongside. "]}, {"isVegetarian": false, "title": "Chicken liver pâté with beetroot jelly", "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_78899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 whole beetroots, roughly chopped", "100ml/3½fl oz red wine vinegar", "25g/1oz sugar", "salt and freshly ground black pepper", "2 gelatine leaves, soaked in cold water for 10 minutes ", "4 shallots, finely sliced", "100ml/3½fl oz brandy", "100ml/3½fl oz Madeira", "100ml/3½fl oz port", "sprig fresh thyme", "1 bay leaf", "1 garlic clove, grated", "500g/1lb 2oz chicken livers, at room temperature", "4 free-range eggs, at room temperature", "300g/10½oz butter, melted", "3 chicken legs, poached for 20 minutes in chicken stock", "6 baby golden beetroot, cooked and peeled"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 100C/225F/Gas ¼.", "To make the beetroot jelly, in a food processor blend the beetroot, red wine vinegar and sugar to a purée.  Season to taste with salt and freshly ground black pepper. ", "Line a sieve with muslin and place over a bowl.  Pour the beetroot purée into the sieve and set aside to allow the juice to run into the bowl. ", "Warm the beetroot juice and then squeeze the excess water from the soaked gelatine before adding them to the beetroot juice. Stir to dissolve. Set aside to cool, but not set.", "To make the pâté, in a pan combine the shallots, all the alcohol, thyme, bay leaf and garlic. Bring to the boil and simmer until the liquid has evaporated.  ", "Remove the thyme and bay leaf and then place in a blender.  Add the chicken livers and pulse.  ", "Slowly add the eggs followed by the butter.  Season with salt and freshly ground black pepper then pass through a chinois. Divide the mixture between six sterilised jars, filling them two-thirds full. ", "Place the jars in an oven proof dish with a cloth underneath.  Fill the dish with boiling water until half way up side of the jars.  Place the dish in the oven for 30 minutes. ", "Remove the jars from the oven and transfer to the fridge to chill. Increase the oven temperature to 180C/350F/Gas 4.", "For the garnish, remove the chicken skin from the legs. Place the skin between two baking trays and bake in the oven for 25 minutes, or until crisp.", "When the pâté is firm, carefully pour a thin layer of the jelly on top (approximately 5mm/ ¼in deep). Return to the fridge to set.", "To serve, halve the golden beetroot and carefully place on the jelly.  Place the chicken skin on the side."]}, {"isVegetarian": false, "title": "Chicken liver pâté with madeira jelly", "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_49398", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "450g/1lb chicken livers (soaked overnight in milk to remove any bitterness)", "1 garlic clove, grated", "2 tbsp redcurrant jelly, melted in a pan over a low heat", "150ml/¼ pint chicken stock, warmed", "salt and freshly ground black pepper", "pinch freshly grated nutmeg", "2 free-range eggs, beaten", "570ml/1 pint double cream", "¼ pint madeira", "1 tbsp chicken stock", "2 gelatine leaves, softened in cold water for 10 minutes", "3 quails’ eggs", "1 tangerine, segmented"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pre-heat the oven to 150C/300F/Gas 2. Grease a 25x25x7.5cm/10x10x3in terrine mould or loaf tin with butter and line with good-quality greaseproof paper.", "Drain the chicken livers and place them in the bowl of a food processor, along with the garlic and redcurrant jelly.  Pour in the stock, salt, pepper and nutmeg then blend until smooth.", "When the mixture is really smooth, add the beaten eggs and the double cream. Season with a little grated nutmeg and plenty of salt and pepper. ", "Push the mixture through a fine sieve into a jug and then pour into the greased and lined terrine mould. Cover the top with greaseproof paper. Place the terrine in a roasting tray half filled with boiling water. Place in the centre of the oven and cook for about an hour, or until the pâté looks just set. Remove from the oven and set aside to cool before placing it in the fridge until ready to serve.", "Meanwhile, for the madeira jelly, put the madeira in a saucepan and heat to reduce in volume by two thirds.  Add the chicken stock and the softened gelatine leaves to the warm madeira liquid and then set aside to cool. ", "To serve, soft boil the quails’ eggs.  Put the tangerine segments and the halved quails’ eggs on top of the pâté and then pour over the jelly. "]}, {"isVegetarian": false, "title": "Chicken, Madeira and mushroom casserole", "url": "www_bbc_co_uk_food_recipes_chicken_madeira_and_30640", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium chicken, jointed into 8 pieces", "1 tsp plain flour", "75g/2½oz butter", "1 onion, finely chopped", "1 garlic clove, finely chopped", "5 tbsp Madeira", "500ml/18fl oz chicken stock", "200ml/7fl oz double cream", "4 sprigs fresh thyme, leaves only, chopped", "250g/9oz chestnut mushrooms, cut into quarters", "100g/3½oz chanterelle mushrooms, cleaned", "2 tbsp roughly chopped fresh flatleaf parsley", "sea salt and freshly ground black pepper", "1kg/2lb 4oz floury potatoes, such as King Edward, peeled and cut into chunks", "150g/5½oz butter", "150ml/5fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the casserole, season the chicken pieces with salt and freshly ground black pepper, then dredge them in the flour to coat.", "Heat two-thirds of the butter in a frying pan over a medium heat. When foaming, add the chicken pieces, in batches if necessary, and fry for 2-3 minutes, or until golden-brown on each side. (Do not overcrowd the pan.) Remove the chicken pieces from the pan and transfer to a casserole or a large heavy-based saucepan.", "Place the casserole over a medium heat. Add the onion, garlic, Madeira, chicken stock, cream and thyme, stir well and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 12-15 minutes.", "Stir in the mushrooms and continue to simmer for a further 12-15 minutes, or until the chicken pieces are cooked through and the sauce has thickened slightly. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a knife, and no trace of pink remains.) Season, to taste, with salt and freshly ground black pepper, then stir in the remaining butter and the parsley. ", "Meanwhile, for the mash, boil the potatoes in a pan of salted water, then reduce the heat and simmer for 12-15 minutes, or until tender. Drain well and return to the pan, then place over a low heat for a couple of minutes to dry them slightly.", "Mash or rice the potatoes until smooth, then stir in the butter and cream until smooth and well combined, and season to taste.", "Serve the casserole with a spoonful of mash."]}, {"isVegetarian": false, "title": "Chicken meatballs in Asian-style noodle broth", "url": "www_bbc_co_uk_food_recipes_chicken_meatballs_in_27036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz chicken mince ", "1 lime leaf, shredded ", "1 lemongrass stalk, tough outer leaves discarded, soft inner core finely chopped ", "1 heaped tsp cornflour", "1 tbsp vegetable oil", "1 litre/1¾ pints chicken stock ", "1 tbsp Thai fish sauce (nam pla)", "2 star anise ", "2.5cm/1in piece fresh root ginger, peeled and finely sliced", "50g/2oz thin egg or rice noodles", "4 spring onions, thinly sliced", "1 red chilli, sliced, plus extra to garnish ", "8 Thai basil leaves, chopped", "toasted sesame oil, to taste", "soy sauce, to taste ", "1 small bunch fresh coriander, chopped ", "small handful mint leaves, chopped ", "1 lime, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, mix all of the meatball ingredients, apart from the oil, together in a large bowl then shape the mixture into small walnut-sized balls. Heat the oil in a large frying pan over a medium heat and fry the meatballs for 4-5 minutes, turning regularly, or until golden-brown all over.", "For the broth, bring the stock to the boil in a wok or large saucepan, then add the fish sauce, star anise and ginger and turn the heat down to a simmer. Add the noodles and cook for one minute, then stir in the spring onions, chilli and the browned chicken meatballs. Simmer for 2-3 minutes, or until the meatballs are completely cooked through.", "Stir in the Thai basil and add sesame oil and soy sauce, to taste. ", "To serve, transfer the noodles to two warm serving bowls using tongs. Place the meatballs on top and pour over the broth. Garnish with the chopped coriander and mint, the chilli slices and a squeeze of lime."]}, {"isVegetarian": false, "title": "Chicken meatloaf", "url": "www_bbc_co_uk_food_recipes_chicken_meatloaf_53803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 small onion, finely chopped", "2 garlic cloves, crushed or grated", "750g/1lb 19oz minced chicken", "50g/1¾oz bacon, finely chopped", "1 tsp ground oregano", "1 tsp lemon zest", "1 tsp Dijon mustard", "1 tsp Worcestershire sauce", "50ml/2fl oz double cream", "100g/3½oz breadcrumbs", "2 free-range egg whites", "100g/3½oz gruyère, grated", "5 slices of rindless streaky bacon", "100ml/3½fl oz ketchup", "1 tsp Worcestershire sauce", "1 tbsp Dijon mustard", "1 tbsp maple syrup", "1 tbsp cider vinegar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Heat the olive oil in a frying pan. Add the onion and sauté for a few minutes until soft and starting to take on some colour. Add the garlic and cook for a further minute. Remove from the heat and leave to cool.", "Put the chicken in a large bowl and season with salt and pepper. Add the chopped bacon, oregano, zest, mustard, cream and breadcrumbs, followed by the cooled onion and garlic. Add the egg and stir everything together thoroughly.", "Take a small piece of the mixture and fry it. Taste and adjust the seasoning and any other flavours accordingly.", "For the glaze, put all the ingredients into a saucepan and season with salt and pepper. Heat through gently and set aside.", "Take half the chicken mixture, and mould it onto a baking tray, using the size of a loaf pan for guidance and making it as even as you can. Put the cheese down the centre, making sure you leave a border all the way round, then top with the remaining chicken mixture, building up round the sides and making sure it is well sealed as you don’t want the cheese leaking out. You should end up with a slightly domed loaf. Brush on some of the glaze. ", "Cut the bacon slices in half and stretch with the back of a knife. Each slice should reach from the base of one side, over the top and to the bottom of the other side. Brush with a little more of the glaze. ", "Bake for 30 minutes, then remove and brush with the remaining glaze. Bake for a further 30 minutes, by which time the meatloaf should be cooked through with nicely crisp bacon. Serve in thick slices."]}, {"isVegetarian": false, "title": "Chicken Milanese with beans and salsa verde", "url": "www_bbc_co_uk_food_recipes_chicken_milanese_with_29631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz borlotti beans", "1 onion", "1 celery stick", "½ head of garlic, cloves divided and peeled", "3 thyme sprigs", "2 chicken breasts, butterflied (cut through centre and opened out flat)", "100g/3½oz plain flour", "1 free-range egg yolk, beaten", "100g/3½oz panko breadcrumbs", "2 tbsp olive oil ", "75g/2¾oz unsalted butter, diced", "1 tbsp chopped fresh summer savory", "¼ lemon, juice only", "sea salt and freshly ground black pepper", "½ bunch fresh flatleaf parsley", "½ bunch fresh mint", "½ bunch fresh chives", "125ml/4fl oz extra virgin olive oil", "1 tsp capers", "2 anchovies", "½ lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beans, put all the ingredients in a saucepan and simmer over a medium heat for 10–15 minutes, or until the beans are tender. Leave to cool in the cooking liquor and then drain the beans, discarding the vegetables, herbs and garlic. Set aside. ", "For the chicken Milanese, lay out a double layer of cling film and place a chicken breast on top, cut-side up. Place another double layer of cling film on top of the chicken. Flatten the chicken evenly using a specialist meat bat or the back of a pan until it is about 1cm/½in thick. Repeat with the other breast. Place the flour on a plate and season with salt and pepper. Put the egg in a bowl and the breadcrumbs on a separate plate. Dredge the chicken breasts in the flour followed by the egg and then the breadcrumbs. Ensure the breasts are fully coated and season with salt and pepper. ", "Heat the oil in a large, non-stick frying pan and fry the chicken for 5–7 minutes on each side, until golden brown and cooked through with no traces of pink. Add the butter and savory to the pan and cook until foaming, whilst basting the chicken. The savory should lightly crisp up. Remove the chicken and savory using a slotted spoon and transfer to kitchen paper to drain. Squeeze over the lemon juice. ", "For the salsa verde, place the herbs, oil, capers and anchovies in a blender. Blitz to a rough purée and then season with the salt, pepper and lemon juice. ", "Place the chicken on warmed plates and spoon the beans and salsa verde over the top. Garnish with the crispy savory and serve immediately. "]}, {"isVegetarian": false, "title": "Chicken mole poblano", "url": "www_bbc_co_uk_food_recipes_chicken_mole_55992", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_mole_55992_16x9.jpg", "ingredients": ["16 mulato or ancho chillies (about 200g/7oz), cleaned, seeds removed and retained", "4 pasilla chillies, cleaned, seeds removed and retained", "30g/1oz stale baguette or white bread (roughly 1 slice)", "50g/1¾oz sesame seeds", "120g/4½ oz blanched almonds", "1 tbsp coriander seeds", "6 black peppercorns", "5cm/2in cinnamon stick", "4 tbsp corn oil", "1 small ripe plantain or unripe banana, peeled and thickly sliced", "130g/4¾oz raisins or currants", "1 onion, thinly sliced", "1 garlic clove, roughly chopped", "pinch ground cloves", "1 tsp oregano", "1 litre/1¾ pints chicken stock ", "100g/3½oz dark chocolate (70–85% cocoa solids), roughly chopped", "4–5 skinless chicken breasts", "2 tbsp sesame seeds", "salt ", "handful lettuce leaves", "4 corn tortillas, warmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the chillies in a frying pan on a high heat for about 20 seconds until fragrant but not burnt. Place them in a bowl and cover with boiling water for 20 minutes. Drain and set aside. ", "Place the same pan over a medium heat and toast the bread, 1 teaspoon of the reserved chilli seeds, sesame seeds, almonds, coriander seeds, peppercorns and cinnamon until fragrant but not burnt. Set them aside and blend to a powder when cool.", "Heat 2 tablespoons of the corn oil in a separate pan and fry the plantain (or banana). Add the raisins (or currants), onions and garlic and fry until soft and sweet. Tip into a food processer with the drained chillies, powdered spices, cloves, oregano and 350ml/12fl oz of the chicken stock. Blend into a smooth sauce. ", "Pour the sauce into a clean saucepan with the remaining stock and the chocolate. Heat through gently for 15–20 minutes until the chocolate has melted and the sauce resembles a thick dark ‘gravy’. Do not allow it to boil. If the mixture is too thick, add a splash of water. Taste for seasoning and add a little salt if needed. ", "Coat the chicken breasts with the remaining 2 tablespoons corn oil and season with salt. Place in a frying pan over a medium heat and brown on both sides. Reduce the heat and continue to cook for 10–15 minutes until cooked through and the juices run clear.", "Meanwhile, toast the sesame seeds in a dry frying pan until brown.", "Slice the chicken breasts diagonally and serve one breast per person, with the sauce spooned over. Sprinkle with toasted sesame seeds."]}, {"isVegetarian": false, "title": "Chicken noodle miso soup", "url": "www_bbc_co_uk_food_recipes_chicken_noodle_miso_soup_29043", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_noodle_miso_soup_29043_16x9.jpg", "ingredients": ["low-calorie cooking spray", "5cm/2in piece fresh root ginger, chopped", "3 garlic cloves, crushed", "pinch of crushed chillies", "3 tbsp miso paste", "2 tbsp lime juice", "200g/7oz fine egg noodles", "2 chicken breasts, 125g/4½oz each, thinly sliced", "125g/4½oz  shiitake mushrooms, sliced", "70g/2½oz baby sweetcorn, chopped", "200g/7oz sugar-snap peas, halved", "85g/3oz watercress, tough stems removed", "soy sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a large saucepan with oil and heat over a medium heat. Add the ginger, garlic and chillies and stir-fry for 1 minute. ", "Add 1.7 litres/3 pints boiling water and bring to a simmer. Stir in the miso paste, lime juice and noodles and cook for 1 minute. Cover and set aside.", "Spray a large wok or frying pan with oil and stir-fry the chicken, mushrooms and sweetcorn for 2-3 minutes. Add the peas and cook for 2 minutes, or until the chicken is cooked through. ", "Transfer the soup to 4 bowls, spoon over the vegetables and chicken. Top with watercress and serve with soy sauce on the side."]}, {"isVegetarian": false, "title": "Chicken noodle salad", "url": "www_bbc_co_uk_food_recipes_chicken_noodle_salad_67466", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_noodle_salad_67466_16x9.jpg", "ingredients": ["70g/2½oz medium egg noodles", "50g/1¾oz frozen soya beans or frozen peas", "1 carrot, peeled", "½ small red pepper, seeds removed, sliced", "75g/2¾oz mangetout, trimmed and halved lengthways", "1 cooked boneless, skinless chicken breast (about 125g/4½oz)", "4 spring onions, trimmed and finely sliced", "1 long red chilli, finely sliced (deseeded if preferred)", "15g/½oz fresh coriander leaves", "10g/⅓oz fresh mint leaves", "15g/½oz roasted cashew nuts, roughly chopped", "3 tbsp water", "3 tsp caster sugar", "½–1 tsp dried chilli flakes, to taste", "4 tsp dark soy sauce", "1 tsp toasted sesame oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dressing, place the water, sugar and chilli flakes in a small saucepan over a low heat and warm gently until the sugar is dissolved. Bring to the boil and cook for 30 seconds, stirring. Take off the heat and stir in the soy sauce and sesame oil. Leave to cool.", "Half-fill a saucepan with water and bring to the boil. Add the noodles and cook for 3–4 minutes, or according to the packet instructions, until tender. Stir occasionally to separate the strands. Add the soya beans or peas to the noodles, stir well and then immediately drain in a colander. Rinse the noodles and beans under cold running water until the mixture is completely cool. Tip into a large mixing bowl.", "Carefully peel the carrot into long, wide ribbons or cut into long, thin matchsticks. Add the carrot, pepper and mangetout to the noodle salad. Cut the chicken into thin slices and place in the bowl.  ", "Pour the dressing into the bowl and toss so everything is well mixed. Add the spring onions, red chilli, fresh herbs and nuts to the bowl and toss lightly before serving. "]}, {"isVegetarian": false, "title": "Chicken nuggets with smoked paprika and anchovy mayo", "url": "www_bbc_co_uk_food_recipes_chicken_nuggets_with_43012", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_nuggets_with_43012_16x9.jpg", "ingredients": ["3 free-range egg yolks", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "1 lemon, juice only", "10 salted anchovy fillets", "1 tbsp smoked paprika", "500ml/18fl oz vegetable oil", "vegetable or sunflower oil, for deep-frying", "200g/7oz semolina flour, plus extra for dusting", "100g/3½oz tapioca flour (available online or from health-food specialists)", "½ tsp bicarbonate of soda", "330ml/11fl oz sparkling water", "4 skinless chicken breasts, cut into nugget-sized pieces", "pinch cayenne pepper", "pinch sea salt flakes"], "serves": "Makes 12-16", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mayo, blend the egg yolks, white wine vinegar, Dijon mustard, lemon juice, anchovy fillets and paprika to a smooth paste in a food processor. ", "With the motor still running, gradually add the oil in a thin stream, until the mixture thickens to a smooth mayonnaise. ", "For the chicken nuggets, heat the oil in a deep-fat fryer to 180C/350F. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) ", "In a large bowl, mix together the flours and the bicarbonate of soda. ", "Gradually pour in the sparkling water in a thin stream, whisking well until the mixture comes together as a loose, smooth batter. ", "Sprinkle a little semolina flour onto a plate. Dust the chicken pieces in the flour, then dip them into the batter. ", "Carefully lower the chicken nuggets into the hot oil, in batches if necessary, and fry until the batter turns crisp and golden-brown, and the nuggets float to the surface of the oil (about 3-4 minutes). Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Just before serving, dust the chicken nuggets with the cayenne pepper and sprinkle over the sea salt flakes.", "To serve, place equal amounts of chicken nuggets into serving bowls with a dollop of mayo alongside."]}, {"isVegetarian": false, "title": "Chicken nuggets with easy BBQ sauce", "url": "www_bbc_co_uk_food_recipes_chicken_nuggets_with_61414", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_nuggets_with_61414_16x9.jpg", "ingredients": ["180g/6¼oz ground almonds                                                  ", "2 free-range eggs                         ", "4 chicken breasts, cut into nuggets", "1½ tsp salt          ", "freshly ground black pepper, to taste", "1 tbsp butter", "¾ tsp onion powder", "¾ tsp garlic powder", "3 tbsp tomato purée", "2 tbsp butter, melted", "2 tbsp balsamic vinegar", "½ tsp smoked paprika, to taste", "salt and freshly ground black pepper"], "serves": "Makes 30", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking parchment.", "Pour the ground almonds into a bowl and stir in the seasoning. Beat the eggs in a separate bowl.", "Season the chicken pieces all over with the salt and pepper. Dip each chicken piece first in the egg, then roll in the almonds until completely covered. Arrange the nuggets on the prepared baking tray.", "Melt the butter in a small saucepan over a low heat. Drizzle the melted butter over the nuggets. Bake in the oven for 18-20 minutes, turning halfway through cooking, until cooked through and golden-brown.", "Meanwhile, for the BBQ sauce, whisk together the tomato purée, melted butter and balsamic vinegar until well combined. Season with salt, pepper and smoked paprika.", "Transfer the BBQ sauce to a sterilised, airtight jar and chill in the fridge until needed. It will keep in a sealed jar for up to 1 week."]}, {"isVegetarian": false, "title": "Chicken and prawn pad Thai", "url": "www_bbc_co_uk_food_recipes_chicken_pad_thai_96522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs, bones removed", "3 tbsp vegetable oil", "1 large banana shallot, finely sliced", "3 bird's-eye red chillies, sliced", "2 cloves garlic, finely chopped", "1 tbsp fresh ginger, finely chopped", "100g/3½oz cooked peeled prawns", "300g/11oz rice noodles, cooked according to the packet instructions", "100g/3½oz beansprouts", "4 tbsp tamarind paste", "4 tbsp fish sauce", "4 tbsp soy sauce", "½ tsp freshly ground white pepper", "2 free-range eggs, beaten", "2 limes, juice only", "3 tbsp roughly chopped coriander", "2 tbsp roasted salted peanuts, crushed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until medium hot, add on tablespoon of the oil and fry the chicken thighs, skin side down, for 3-4 minutes until the skin is crisp. Turn the thighs over and cook for another 3-4 minutes or until cooked through. Remove from the pan and set aside to drain on kitchen paper.", "When the chicken is cool enough to handle, thinly slice then set aside.", "Heat a wok until hot then add the remaining oil, shallot, chilli, garlic and ginger and stir-fry for one minute.", "Add the prawns and cooked chicken and cook for another minute. Add the noodles and bean sprouts and stir-fry to heat through, then add the tamarind paste, fish and soy sauces, pepper and lime juice and stir to coat.", "Add the beaten egg to the wok and toss the noodles in the egg, continuing to stir-frying for 1-2 minutes. Sprinkle with the coriander and half the peanuts. ", "To serve, pile some pad thai onto the plates then sprinkle with the remaining crushed peanuts."]}, {"isVegetarian": false, "title": "Chicken paprikash", "url": "www_bbc_co_uk_food_recipes_chicken_paprikash_02086", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "8 chicken thighs, skin on and bone in", "2 onions, finely chopped", "2 garlic cloves, crushed", "2 green peppers, deseeded and finely chopped", "3 tbsp sweet smoked paprika ", "1 tsp hot paprika", "1 tbsp plain flour ", "1 x 400g tin chopped tomatoes ", "400ml/14fl oz hot chicken stock", "150ml/5fl oz soured cream ", "230g/8oz self-raising flour", "75g/2½oz suet", "1 tbsp finely chopped fresh dill", "1 tbsp finely chopped fresh parsley ", "500ml/18fl oz chicken stock", "salt and freshly ground black pepper "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Heat the olive oil in a sauté pan placed over a medium heat. Season the chicken thighs with salt and pepper and add them to the pan. Cook until browned all over. Remove the chicken and set aside. ", "Add the onions, garlic and peppers to the pan and gently fry for 10 minutes. Stir in the paprikas and flour. Cook, stirring all the time, for a few minutes. Stir in the tomatoes and stock, then return the chicken thighs to the pan. Simmer gently for 30–40 minutes, or until the chicken is cooked through. ", "Meanwhile, to make the dumplings, mix together the flour, suet, herbs and seasoning in a bowl. Add 100ml/3½fl oz water and mix to form a sticky dough. ", "Roll the dough into small balls and drop into a shallow baking dish. Pour over the hot chicken stock and bake for 30 minutes. ", "When ready to serve, stir the soured cream into the chicken and serve with the dumplings."]}, {"isVegetarian": false, "title": "Chicken parmo", "url": "www_bbc_co_uk_food_recipes_chicken_parmo_08987", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, butterflied and slightly flattened", "100g/3½oz plain flour", "2 free-range eggs, beaten", "75g/2½oz Parmesan, grated", "75g/2½oz breadcrumbs", "1 tsp dried oregano", "few basil leaves, finely chopped", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "100ml/3½fl oz red wine", "1 tsp dried oregano", "1 x 400g/14oz tin chopped tomatoes (or fresh equivalent)", "pinch sugar (optional)", "salt and freshly ground black pepper", "1 garlic clove", "1 tsp olive oil", "2 balls mozzarella, sliced", "handful fresh basil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Season the chicken with salt and pepper. Season the flour and place on one plate, put the beaten eggs on another and mix the breadcrumbs, Parmesan and herbs on a third plate. ", "Dip each chicken piece in the flour, then dust off any excess and drop into the egg. Finally coat in the breadcrumb and parmesan mixture, pressing it into the chicken firmly. ", "Arrange the chicken on a baking tray and drizzle with a little olive oil. Bake for around 12-15 minutes, or until just cooked through.", "To make the sauce, heat the olive oil in a saucepan and add the onion. Fry until very soft – you want it translucent and buttery – then add the garlic. Cook for a further 2 minutes, then add the red wine. Allow to bubble fiercely until the volume of liquid has reduced by half, then add the oregano and tomatoes. ", "Season with salt and pepper. Simmer, covered, for 10 minutes, then remove the lid. Taste and add a pinch of sugar if you think the tomatoes aren’t sweet enough. Simmer for a further 10 minutes, uncovered, until you have a well reduced sauce - you don’t want anything too wet for this dish as it will make the chicken soggy.", "To assemble, take a large, shallow oven dish which will take all the chicken in a single layer. Cut the garlic clove in half and rub it over the dish. ", "Spread the tomato sauce over the base of the dish, then top with the chicken. Arrange the mozzarella on top until the chicken is almost completely covered. Bake in the oven for around 15-20 minutes, or until everything is piping hot and the mozzarella is melted and browned. Serve with a few basil leaves scattered over."]}, {"isVegetarian": false, "title": "Chicken Parmentier", "url": "www_bbc_co_uk_food_recipes_chicken_parmentier_25434", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_parmentier_25434_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz floury potatoes, such as King Edwards, peeled", "30g/1oz butter", "5 tbsp double cream", "2 free-range egg yolks", "salt and black pepper", "30g/1oz butter ", "6 large or 8 small shallots, peeled and halved", "3 carrots, chopped", "2 sticks celery chopped", "1 garlic clove, finely chopped", "4 tbsp dry white wine", "1 tbsp tomato purée", "4 large ripe tomatoes, peeled and chopped (or 1 x 400g tin chopped plum tomatoes)", "350ml/12fl oz chicken stock", "600g/1lb 5oz leftover roast chicken, shredded", "16 black olives, stones removed, halved", "2 tbsp chopped fresh parsley", "50g/1¾oz Gruyère cheese"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the topping, boil the potatoes in salted water until tender. Drain and push through a potato ricer, or mash thoroughly. Stir in the butter, cream and egg yolks. Season and set aside.", "For the filling, melt the butter in a large pan. Add the shallots, carrots and celery and gently fry until soft, then add the garlic. Pour in the wine and cook for 1 minute. Stir in the tomato purée, chopped tomatoes and stock and cook for 10–15 minutes, until thickened. Add the shredded chicken, olives and parsley. Season to taste with salt and pepper.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Put the filling in a 20x30cm/8x12in ovenproof dish and top with the mashed potato. Grate over the Gruyère. Bake for 30–35 minutes, until piping hot and the potato is golden-brown. "]}, {"isVegetarian": false, "title": "Chicken pasta bake (Saturday night pasta)", "url": "www_bbc_co_uk_food_recipes_chicken_pasta_bake_25701", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pasta_bake_25701_16x9.jpg", "ingredients": ["butter, for greasing", "250g/9oz penne", "1 onion, roughly chopped", "3 skinless, boneless chicken breasts, cut into thin strips roughly the size of your little finger ", "1 tbsp paprika", "2 tbsp olive oil", "salt and freshly ground black pepper", "50g/1¾oz butter", "50g/1¾oz plain flour", "750ml/1 pint 6 fl oz hot milk (see tip)", "1 tsp Dijon mustard", "100g/3½oz Parmesan cheese, coarsely grated", "2 large tomatoes, deseeded and cut into small cubes"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Butter a shallow 1.75 litre/3 pint ovenproof dish.", "Cook the penne with the onion in boiling, salted water according to the packet instructions. Drain, refresh in cold water and leave to drain again in the colander.", "Put the chicken strips in a resealable freezer bag with the paprika and a little salt and pepper, seal the bag and shake to coat. ", "Heat 1 tablespoon of the oil in a large frying pan and quickly fry the chicken over a high heat for about 2 minutes until golden-brown and just cooked through (you may need to do this in batches). Using a slotted spoon, transfer the fried chicken to a plate and set aside.", "To make the sauce, melt the butter in a large saucepan, add the flour and whisk together to form a roux. Cook for 1 minute, then gradually add the hot milk, whisking over a high heat until the sauce is smooth and thickened, and allow to boil for 4 minutes. Stir in the mustard and half the cheese and season with salt and pepper.", "Add the pasta and onion to the sauce in the pan and stir together. Spoon half this mixture into the dish, arrange the chicken strips over the top and spoon the remaining pasta and sauce on top of the chicken. Scatter over the tomatoes and then top with the remaining cheese. Bake in the oven for about 20 minutes until piping hot and golden-brown on top."]}, {"isVegetarian": false, "title": "Chicken, pesto and rocket sandwich", "url": "www_bbc_co_uk_food_recipes_chicken_pesto_and_rocket_00432", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pesto_and_rocket_00432_16x9.jpg", "ingredients": ["3-4 tbsp mayonnaise", "1-2 tbsp pesto", "3 cooked skinless chicken breast, shredded", "handful rocket", "6 granary or seeded bread rolls, sliced horizontally, lightly buttered."], "serves": "Makes 6 sandwiches", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the mayonnaise and pesto together in a bowl. Gently stir in the shredded chicken.", "Fill the rolls with the chicken mixture and top with some rocket."]}, {"isVegetarian": false, "title": "Chicken pasties", "url": "www_bbc_co_uk_food_recipes_chicken_pasties_23673", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4.5kg/10lb 2oz plain flour, plus extra for dusting", "3 tbsp salt", "2.25kg/5lb lard, diced", "about 1.2 litres/2 pints cold water", "3kg/6lb 8oz chicken thighs, boned and skin removed, finely chopped", "150g/5½oz plain flour", "salt and freshly ground black pepper", "1.5kg/3lb 5oz onion, peeled, finely chopped", "1.5kg/3lb 5oz swede, peeled, finely chopped", "4.5kg/10lb 2oz potato, peeled, finely chopped", "10 free-range eggs, beaten"], "serves": "Makes 40 pasties", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pastry, blend the flour, salt, and lard in a large mixer until the mixture resembles breadcrumbs. ", "With the motor still running, gradually add the water in a thin stream until the mixture comes together as a dough. If you don’t have a large enough mixer, rub the fat into the flour in a large bowl or clean bucket.", "Wrap the pastry in cling film and chill in the fridge for 30 minutes. ", "For the filling, place the chopped chicken and flour in a large bowl and mix until the meat is coated in the flour. Season to taste with salt and freshly ground black pepper.", "Season the vegetables with salt and freshly ground black pepper.", "When the pastry has chilled, divide it into 40 pieces of equal weight. Roll out each piece of pastry onto a lightly floured work surface until it is just larger than the diameter of a dinner plate. Make sure you do not tear the pastry. ", "Using a dinner plate as a template, trim the edges of each piece of pastry to form a disc. ", "Spoon some of the chopped potato onto one half of each pastry disc, leaving 1.5cm/¾in free at the edges. ", "Spoon some of the chopped swede on top of the layer of potato, and then spoon some of the chopped onion on top of the layer of swede. Finally, spoon over some of the chicken.", "Brush the edges of the pastry discs lightly all over with a little of the beaten egg. ", "Fold the empty half of the pastry disc over the filled half and either press the edges together with a fork, or twist the edges to seal.", "Brush the top of each pasty with more beaten egg. Using a sharp knife, cut a small cross shape in the top of the pasties through which the steam can escape. ", "Place the pasties onto greased baking trays and transfer to the oven. Bake for 45-50 minutes, or until the pastry is crisp and golden-brown and the filling is cooked through and piping hot.", "When the pasties are cooked, remove them from the oven and set aside to rest for 5-10 minutes before serving."]}, {"isVegetarian": false, "title": "Slow-cooker chicken pho", "url": "www_bbc_co_uk_food_recipes_chicken_pho_97726", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pho_97726_16x9.jpg", "ingredients": ["1 onion, peeled, finely chopped", "4 garlic cloves, halved", "20g/¾oz fresh root ginger, peeled, thinly sliced", "2 long fresh red chillies, sliced (or 1 tsp dried chilli flakes)", "1 tsp Chinese five-spice powder ", "4 tbsp dark soy sauce, plus extra to serve", "1kg-1.2kg/2lb 4oz-2lb 10oz whole chicken", "1 tbsp Thai fish sauce (nam pla)", "200g/7oz dried flat rice noodles", "6 spring onions, trimmed and thinly sliced", "100g/3½oz beansprouts, rinsed and drained", "25g/1oz fresh coriander sprigs", "1 long red chilli, thinly sliced", "1 lime, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vegetables in the slow-cooker. Stir in the five-spice powder, 1 litre/1¾ pints water and soy sauce until well combined. ", "Cut any string from the chicken, remove the skin by pushing your fingers between the breast meat and the skin and easing off the skin. Do the same with the legs, snipping off any skin around the wings or leg tips with scissors. ", "Place the chicken, breast-side up, in the slow-cooker, pushing it down among the vegetables. Season all over with salt and pepper. ", "Cover and cook on high for 4½ hours, or until the chicken is completely cooked through and very tender. ", "Drain the contents of the slow-cooker into a large bowl. Place the chicken on a chopping board and strip the meat from the carcass, thickly slice. Cover with foil. ", "Skim off the fat from the stock collected in the bowl using a large metal spoon. Pour the stock into a clean saucepan, stir in the fish sauce and place on a gentle simmer. ", "Half-fill a separate saucepan with water and bring to the boil. Add the noodles and cook until just tender, stirring regularly to separate them. Drain well.", "Divide the noodles equally among 4 deep serving bowls. Top each with chicken, spring onions, beansprouts and coriander. Ladle over the hot stock and season with soy. Garnish with the remaining sliced chilli and lime wedges."]}, {"isVegetarian": false, "title": "Traditional chicken pie", "url": "www_bbc_co_uk_food_recipes_chicken_pie_24044", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pie_24044_16x9.jpg", "ingredients": ["1 medium chicken", "1 onion, peeled", "6 cloves", "1 carrot, peeled", "2 bay leaves", "1 chicken stock cube", "6–8 peppercorns", "450g/1lb plain flour", "½ tsp salt or to taste", "120g/4½ oz butter, cold", "120g/4½ oz vegetable shortening, cold", "1 free-range egg, beaten, for glazing", "250ml/9fl oz whole milk", "55g/2oz butter", "55g/2oz plain flour"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Rinse the chicken in cold water and place it in a large pan.", "Stud the onion with cloves and add it to the pan with the carrot, bay leaves, stock cube and peppercorns. ", "Cover with cold water and bring to the boil, then reduce the heat and simmer until the chicken is cooked. This will take about 45 minutes–1¼ hours, depending on the size of the chicken.", "Meanwhile, make the pastry. Sift the flour and salt together into a large mixing bowl. Dice the cold butter and vegetable shortening and rub them into the flour until the mixture resembles fine breadcrumbs. ", "Mix in just enough cold water to form a stiff dough. Turn this out onto a lightly floured surface and knead gently to form a smooth ball of dough. Wrap in clingfilm or place in a plastic bag and chill for at least 30 minutes.", "When the chicken is cooked, take the pan off the heat. Remove the chicken and place it on a plate. Put the pan back on the heat and reduce the cooking liquid to about 250ml/9fl oz. Strain the reduced liquid into a jug and leave to cool, then skim off the fat and discard it. ", "When the chicken is cool enough to handle, cut the meat into chunks and discard the skin and bones. ", "For the sauce, remove the cloves from the onion and place in a food processor with the reserved stock. Blend until smooth, then add the milk and set aside.", "Melt the butter in a pan and stir in the flour. Gradually add the stock and milk, then bring to the boil, stirring continuously. Reduce the heat and simmer for 4-5 minutes to cook out the taste of the flour.", "Season, to taste, with salt and freshly ground black pepper, then fold the meat gently into the sauce. Set the mixture aside to cool.", "Preheat the oven to 220C/425F/Gas 7. Roll out two-thirds of the pastry and use it to line a 20-25cm/8-10in pie plate and add the cooled chicken mix.", "Roll out the remaining pastry to make a lid for the pie, brush the edge with beaten egg and pinch the edges together to seal. ", "Decorate the top of the pie with leaves made from pastry trimmings and brush all over with beaten egg. Make a hole in the top of the pie to allow the steam to escape, then bake in the preheated oven for about 45 minutes, or until the pastry is golden-brown."]}, {"isVegetarian": false, "title": "Chicken piperade with pilau rice", "url": "www_bbc_co_uk_food_recipes_chicken_piperade_with_23608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp plain flour", "1 x 1.5kg/3lb 5oz chicken, giblets removed, jointed into 8 pieces", "25ml/1fl oz olive oil", "2 onions, thickly sliced", "2 garlic cloves, lightly crushed", "4 red peppers, seeds removed, thickly sliced", "1 tbsp tomato purée", "5 tbsp dry sherry", "5 tbsp white wine", "400g tin tomatoes", "2 tsp ground espelette pepper", "1-2 tsp caster sugar, to taste", "2 tbsp finely chopped flatleaf parsley", "sea salt and freshly ground black pepper", "2 tbsp vegetable oil", "1 onion, finely diced", "6 whole cloves", "1 cinnamon stick", "200g/7oz basmati rice", "2 bay leaves", "1 lemon, sliced"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, preheat the oven to 180C/160C Fan/Gas 4.", "Sprinkle the flour onto a plate and season with salt and pepper, then dredge the chicken pieces in the flour.", "Heat half of the oil in a large frying pan over a medium heat. Fry the chicken in batches for 2-3 minutes on each side, or until golden-brown on both sides. Remove from the pan using a slotted spoon and transfer to an ovenproof casserole. ", "Heat the remaining oil in the same pan, then fry the onions, garlic and peppers for 4-5 minutes, or until just softened. Stir in the tomato purée and continue to fry for 1-2 minutes, then pour in the sherry and white wine and bring the mixture to the boil. Stir in the tinned tomatoes, espelette pepper and sugar and return to the boil. Season with salt and pepper.", "Pour the sauce over the chicken pieces. Cover and bake for 1-1½ hours, or until the chicken is cooked through and no trace of pink remains, the peppers are tender and the sauce has thickened slightly.", "Meanwhile, for the pilau rice, heat the oil in a large lidded frying pan over a medium heat. Add the onion and fry for 2-3 minutes, or until softened but not browned. Add the cloves and cinnamon and cook for another 1-2 minutes, until fragrant. Add the rice and stir well to coat it in the oil, then pour over 600ml/20fl oz water and stir again. ", "Add the bay leaves and 2 lemon slices, then cover the pan with a lid and reduce the heat until it is just simmering. Cook the rice for 15-20 minutes, or until it is just tender and all the liquid has been absorbed. Remove the lemon slices and bay leaves before serving.", "To serve, stir the parsley into the chicken and season again. Serve with the pilau rice. Garnish the plates with the remaining lemon slices."]}, {"isVegetarian": false, "title": "Chicken pot pie with spicy coleslaw", "url": "www_bbc_co_uk_food_recipes_chicken_pot_pie_with_52117", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pot_pie_with_52117_16x9.jpg", "ingredients": ["375g/13oz boneless chicken thighs and breasts, skin removed, halved", "125ml/4fl oz chicken stock", "4 tbsp single cream or full-fat milk", "3 stalks celery, chopped", "1 leek, cut into 1cm/1in pieces", "125g/4½oz new potatoes, halved", "2 garlic cloves, chopped", "250g/9oz cooked ham, cut into 2cm/1in cubes", "25g/1oz salted butter", "3 tbsp plain flour", "¼ tsp freshly grated nutmeg", "2 tbsp chopped fresh flat-leaf parsley", "salt and freshly ground black pepper", "1 sheet of ready-rolled puff pastry", "1 egg yolk beaten with 1 tbsp milk, for glazing", "¼ white cabbage", "¼ red cabbage", "1 medium carrot", "1 medium beetroot", "½ red onion", "3 radishes", "2-3 tbsp mayonnaise ", "½ lemon, juice only", "1 red chilli, seeds removed and finely chopped"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken, stock, cream or milk, celery, leeks, potatoes, garlic and ham into a large saucepan.  Bring to the boil, reduce the heat, cover and simmer for about 20-25 minutes or until the chicken is tender.", "Pour the pan contents into a colander set over a large heatproof measuring jug. You will need 250ml/9fl oz of liquid.  Make up the quantity using extra cream or milk, if required. Allow to cool slightly while you make the roux.", "Clean and dry the pan, add the butter and melt gently over a moderate heat.  Stir in the flour until thoroughly combined, and cook for a few minutes but do not let the mixture colour.  ", "Stir in the poaching liquid, about a third at a time, heating and stirring well between additions, until the mixture is thick, smooth and velvety.  Stir in the nutmeg and parsley, then add salt and pepper, to taste.  ", "Stir in the cooked chicken and vegetables and toss gently in the sauce until well coated.  Cool for at least 10 minutes, ideally cool completely and chill in the fridge.", "Preheat the oven to 220C/425F/Gas 7.", "Unroll the pastry onto a floured work surface. Turn a 14x18cm/5½x7in rectangular pie dish with a flat lip edge upside-down on the pastry sheet and cut around it, leaving a 3cm/1¼in border.  ", "Cut 2cm/1in wide strip of pastry to fit around the edge of the dish.  Brush the flat lip edge of the pie dish with water and stick the strip on top.  Ladle the filling into the dish, piling it up high in the centre.", "Set the pastry lid on top and press onto the pastry strip to seal. If there is any excess, trim it off evenly.  Cut a 1cm/½in vent in the centre, then brush the egg and milk glaze over the pastry.  Mark decorative patterns in the pastry, if preferred, or leave plain.", "Bake for 25-30 minutes, or until the pastry has puffed and is golden brown. ", "For the coleslaw, grate the cabbage, carrot, beetroot, onion and radishes into a large mixing bowl. Add the mayonnaise, lemon juice, salt and pepper and chillies and stir well. Set aside in the fridge until ready to serve.", "Serve the chicken pie hot, straight from the dish, with cold crunchy coleslaw alongside."]}, {"isVegetarian": false, "title": "Chicken puttanesca with linguine", "url": "www_bbc_co_uk_food_recipes_chicken_puttanesca_with_80065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_puttanesca_with_80065_16x9.jpg", "ingredients": ["8 boneless chicken thighs, skin on", "1 tbsp Italian seasoning (a mixture of basil, oregano and parsley)", "salt and freshly ground black pepper", "4 tbsp olive oil", "1 small onion, peeled, finely chopped", "1 x 400g/14oz can Italian cherry tomatoes", "6 anchovy fillets, in oil", "2 garlic cloves, peeled, crushed", "½ tsp dried chilli flakes", "300g/10½oz linguine", "1 tbsp baby capers", "handful fresh basil leaves, plus extra to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place each chicken thigh skin-side down on a chopping board and sprinkle each with a little Italian seasoning and salt and freshly ground black pepper, to taste.", "Using cooking string, carefully fold over the edges of each thigh into the centre, then tie tightly to create neat round parcels (the skin should be on the outside).", "Heat two tablespoons of olive oil in a large frying pan over a medium to high heat. Add the chicken parcels, in batches if necessary, and cook for 3-4 minutes on each side, or until browned all over. Transfer the chicken parcels to an ovenproof dish and set aside.", "Add a further two tablespoons of olive oil to the same frying pan. Add the onion and fry for 3-4 minutes, or until softened.", "Add the cherry tomatoes, anchovy fillets, garlic and chilli flakes and continue to cook for 4-5 minutes, stirring well. Pour the mixture over the chicken parcels, drizzle over a little more olive oil, then bake in the oven for 18-20 minutes, or until the chicken has cooked through and the sauce has thickened.", "Meanwhile, bring a large pan of salted water to the boil and cook the linguine according to the packet instructions. Drain well, return to the pan and toss with a dash of olive oil.", "When the chicken puttanesca has cooked, carefully remove the chicken parcels from the sauce and discard the string. Stir the capers and basil leaves into the sauce and season, to taste, with salt and freshly ground black pepper.", "To serve, place a twist of linguine into the centre of each plate. Place two chicken thighs on top of each mound of pasta and spoon over the puttanesca sauce. Garnish with a few sprigs of fresh basil. "]}, {"isVegetarian": false, "title": "Chicken, red wine and garlic casserole", "url": "www_bbc_co_uk_food_recipes_chicken_red_wine_and_88480", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_red_wine_and_88480_16x9.jpg", "ingredients": ["400g/14oz baby shallots, peeled", "3 garlic cloves, crushed", "1 small bunch fresh thyme", "4 bay leaves", "600ml/20fl oz red wine", "6 small skinless and boneless chicken breasts", "2 tbsp olive oil", "75g/2¾oz butter", "3 tbsp plain flour", "350g/12oz smoked streaky bacon, chopped into pieces", "1 tbsp tomato purée", "1 tbsp light muscovado sugar", "400g/14oz button mushrooms, halved", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the shallots in a large bowl with the garlic, herbs and wine. Mix, then add the chicken breasts, season with salt and black pepper and marinate for at least 1 hour. When you’re ready to cook, preheat the oven to 160C/140C Fan/Gas 3.", "Sit a colander over a large saucepan and strain the marinated chicken, reserving the shallots, bay leaves and thyme. Dab the chicken with kitchen paper to dry it.", "Heat the oil and 50g/1¾oz of the butter in a deep ovenproof frying pan or casserole dish. Add the chicken breasts and fry on a medium-high heat, for 5–10 minutes each side, or until browned all over – you may need to do this in batches. Remove with a slotted spoon and set aside.", "Meanwhile, set the pan with the wine marinade over a high heat and boil, for 5–10 minutes, until the volume of liquid has reduced by a third. Add the flour to a bowl with 150ml/5fl oz water and whisk until smooth. Stir in a little of the hot wine, and add this mixture to the rest of the wine in the pan. Keep hot.", "Add the bacon to the frying pan or casserole dish and fry over a high heat for about 10 minutes, or until browned. Add the reserved shallots and continue to cook for another 10 minutes, or until they start to soften.", "Add the hot wine sauce and tomato purée to the frying pan or casserole dish with the sugar, reserved bay leaves, thyme, salt and black pepper and bring to a boil. Stir until thickened and add the browned chicken. Bring back to the boil, cover with a lid and bake for 20–25 minutes, or until cooked through.", "Meanwhile, melt the remaining butter in a medium pan and fry the mushrooms over a medium heat for 5–10 minutes, or until just cooked. Add to the chicken casserole just before serving. Remove the bay leaves and thyme from the casserole and serve the casserole hot with mashed potato and shredded cabbage."]}, {"isVegetarian": false, "title": "Chicken roasted over sourdough with morels, peas and wild garlic mayonnaise", "url": "www_bbc_co_uk_food_recipes_chicken_roasted_over_34391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ garlic bulb, unpeeled, from a whole bulb cut horizontally", "½ lemon", "1 free-range chicken (about 1.25kg/2lb 12oz)", "½ large, round, slightly stale sourdough loaf, from a whole loaf cut horizontally  ", "2 tbsp olive oil", "salt and freshly ground black pepper", "handful wild garlic leaves ", "1 large free-range egg yolk ", "1 tsp Dijon mustard ", "100ml/3½fl oz extra virgin olive oil ", "white wine vinegar, to taste ", "75g/2½oz unsalted butter", "100g/3½oz morel mushrooms, cleaned and halved ", "100g/3½oz frozen peas, defrosted", "handful wild garlic leaves, shredded", "2 tbsp unsalted butter", "2 tbsp olive oil", "2 potatoes, cut into 1cm/½in pieces ", "handful fresh wild garlic, shredded"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 8. For the chicken, put the garlic and lemon inside the chicken cavity and season with salt and pepper. ", "Put the sourdough into a large roasting tray and drizzle with 1 tablespoon olive oil. Season with salt and pepper and place the chicken on top. Season the chicken and drizzle over the other tablespoon of olive oil. ", "Roast the chicken for an hour and a half, or until the skin is golden-brown and crisp and the chicken is cooked through.To test the chicken is cooked, insert a small sharp knife into the thickest part of the meat, between the leg and breast; the juices that run should be clear, with no sign of pink. If there is any pink, roast the chicken for another 10–20 minutes, or until cooked through. When the chicken is cooked, leave to rest for 20 minutes. ", "Meanwhile, for the wild garlic mayonnaise, blanch the wild garlic in boiling water for 1 minute, then drain and blend with 100ml/3½fl oz water. Whisk together the egg yolk and mustard in a bowl, then slowly whisk in the oil until you have a thick mayonnaise. Stir through the wild garlic purée, season with the vinegar, salt and pepper and set aside at room temperature. ", "For the morels and peas, heat the butter in a medium sauté pan. When foaming, add the morels, season with salt and pepper and fry until golden-brown. Add the peas and wild garlic with a splash of water, then turn off the heat and set aside. ", "For the fried potatoes, heat the butter and oil in a frying pan over a medium-high heat. Fry the potatoes for 8–10 minutes, until cooked through. Place the wild garlic on top and cook until wilted.  ", "To serve, carve the chicken into legs and breasts, remove the leg meat from the bone and cut the breasts into pieces. Squeeze the cooked lemon from inside the chicken cavity over the meat. ", "Cut the sourdough into four pieces and divide between plates, place some chicken on top, spoon over the morels and peas and drizzle the garlic mayonnaise on top, serve with the fried potatoes on the side. "]}, {"isVegetarian": false, "title": "Chicken satay noodles", "url": "www_bbc_co_uk_food_recipes_chicken_satay_noodles_95490", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_satay_noodles_95490_16x9.jpg", "ingredients": ["400g/14oz chicken or turkey breast, cut into strips ", "2 tbsp soy sauce", "1 tsp cornflour", "375g/13oz dried egg noodles", "2 tsp rapeseed oil", "6 spring onions, thinly sliced", "3 tbsp peanut butter", "2 tbsp sweet chilli sauce", "1 x 400ml tin reduced-fat coconut milk", "100g/3½oz sugar snap peas", "150g/5½oz mixed frozen beans and peas", "100g/3½oz frozen sweetcorn", "1 lime, juice only", "1 carrot, shaved into thin slices using a vegetable peeler", "75g/2¾oz baby spinach leaves", "2 tbsp roughly chopped cashew nuts", "2 tbsp freshly chopped coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken in a bowl, add the soy sauce and cornflour and mix well. Cover and set aside for a few moments. ", "Meanwhile, bring a large pan of water to the boil, add the noodles and cook according to the packet instructions. Drain in a colander, rinse with cold water until they are cold, then drain once more and tip them back into the cold pan. Add half the rapeseed oil and toss.", "Heat a wok until hot, add the remaining rapeseed oil and the spring onions and stir-fry for 1 minute, or until softened. Add the peanut butter, chilli sauce and coconut milk and stir until combined. Bring to a simmer, then add the marinated chicken and poach for 4 minutes, or until cooked through. Add the sugar snap peas and simmer for another 2 minutes, or until nearly tender, then add the frozen peas, beans and sweetcorn. Return to the boil, stir in the lime juice and check the seasoning – you might want to add more lime juice or chilli, depending how hot you like it.", "Stir in the cooked noodles and heat for 1-2 minutes, or until hot through. Stir in the carrot shavings and spinach and remove from the heat. The heat from the dish will wilt the spinach down. Stir a couple of times.", "Serve in bowls, garnished with the cashews and coriander."]}, {"isVegetarian": false, "title": "Chicken satay wraps", "url": "www_bbc_co_uk_food_recipes_chicken_satay_wraps_38509", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_satay_wraps_38509_16x9.jpg", "ingredients": ["1 iceberg lettuce ", "1 cooked boneless, skinless chicken breast (about 100g/3½oz)", "⅓ cucumber", "1 carrot, peeled and cut into fine matchsticks", "½ red pepper, deseeded and cut into fine matchsticks", "5 radishes, trimmed and thinly sliced", "15g/½oz fresh coriander leaves", "1 long red chilli, finely chopped", "3 spring onions, trimmed and finely sliced", "lime wedges, for squeezing ", "3 tbsp crunchy peanut butter", "1 tbsp sweet chilli sauce", "2 tsp dark soy sauce", "2 tsp fresh lime juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the satay sauce, put the peanut butter in a small bowl and stir in 2 tablespoons of just-boiled water. Mix in the chilli sauce, soy sauce and lime juice. Transfer to a shallow serving dish and place in the centre of a large board or platter.", "Trim the bottom of the lettuce and carefully separate 8 large leaves. Don’t worry if they tear a little as you work towards the middle of the lettuce. Rinse the leaves and pat dry.", "Cut the chicken breasts into thin slices and place on the board or platter with the satay sauce. Arrange the lettuce leaves, cucumber, carrot, pepper, radishes and coriander in separate piles beside the chicken. Put the chilli and spring onions in separate small dishes on the board.", "To assemble the wraps, place a selection of the vegetables into the lettuce leaves. Add a couple of chicken slices and then top with the satay sauce, spring onions and chillies to taste. Garnish with the fresh coriander and add a squeeze of lime before wrapping the rest of the leaf around the filling. Serve immediately. "]}, {"isVegetarian": false, "title": "Chicken shawarma", "url": "www_bbc_co_uk_food_recipes_chicken_shawarma_34413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz thick Greek yoghurt", "½ tsp salt", "8-12 chicken thigh fillets, skinned", "2 lemons, juice only", "50ml/2fl oz olive oil", "4 garlic cloves, crushed", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp sweet smoked paprika", "½ tsp ground cinnamon", "½ tsp cayenne or red chilli powder", "2 bay leaves, crushed", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To make the labneh, line a colander or sieve with a double layer of cheesecloth or muslin and place over a bowl small enough to fit in your fridge. Pour in the yogurt and add ½ tsp salt. Wrap the cloth around it and tie into a bunch, then leave to strain, preferably overnight, until much thicker, but still creamy.", "Put the chicken thighs in a large food bag or bowl and season well. Whisk the lemon juice and oil together then add the garlic, spices and bay leaves. Mix thoroughly and pour over the chicken, rubbing in using your hands. If you prefer to keep your hands clean and you are using a bag, seal it first, then massage from the outside.", "Leave to marinade in the fridge, covered for at least 2 hours, but preferably overnight. Allow the chicken to come to room temperature before cooking.", "To cook the chicken, heat a grill or griddle pan and scrape off any excess marinade from the chicken. Over a medium heat, grill or griddle the chicken, turning frequently, for around 20-25 minutes, or until cooked through. Remove from the barbecue and leave to rest for a few minutes, before slicing up and serving with the labneh."]}, {"isVegetarian": false, "title": "Chicken, spring onion, chilli and wild rice grain bowl", "url": "www_bbc_co_uk_food_recipes_chicken_spring_onion_89118", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_spring_onion_89118_16x9.jpg", "ingredients": ["50g/1¾oz wild rice", "1 small handful rocket leaves", "50g/1¾oz cooked roast chicken, shredded", "2 spring onions, thinly sliced", "½ red pepper, sliced", "½ green chilli, finely chopped (or to taste)", "2 sprigs mint, leaves picked", "1 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the wild rice according to packet instructions, then drain. ", "Place the rice in the bowl you plan to eat from and add the rocket, chicken, spring onions, red pepper, chilli and mint. ", "Drizzle liberally with the oil and season with salt and pepper. Eat straight away or pack in your lunchbox ready to take to work. "]}, {"isVegetarian": false, "title": "Chicken supreme au vin bourguignon", "url": "www_bbc_co_uk_food_recipes_chicken_supreme_au_vin_16466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 skinless chicken supremes", "500ml/18fl oz strong red wine", "300ml/10fl oz chicken or veal stock", "1 tbsp honey", "1 garlic clove, crushed", "2 tbsp butter", "1 tbsp vegetable oil ", "10 pearl onions, peeled and blanched", "10 button mushrooms", "125g/4½oz smoked bacon, diced", "salt and freshly ground black pepper", "2 floury potatoes, peeled and grated", "1 shallot, peeled and grated", "½ carrot, peeled and grated", "½ parsnip, peeled and grated", "1 small turnip, peeled and grated", "1 tbsp finely chopped flatleaf parsley", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "2 knobs of butter"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the chicken supremes in a shallow dish and cover with the wine, stock, honey and garlic. Cover and marinate in the fridge for 2 hours. Remove the chicken from the marinade, drain and leave to dry on a cloth or kitchen paper, reserving the marinade.", "Place the marinade in a small saucepan and bring to the boil. Cook for 15 minutes, or until reduced by two thirds. ", "Meanwhile, pan-fry the chicken in a frying pan with 1 tablespoon of the butter and oil for 15 minutes, or until cooked through and the thickest part of the meat shows no trace of pink. Take out of the pan and leave to rest. ", "Add the onions and mushrooms to the pan and cook for a few minutes. Drain the excess fat and then add the bacon and cook for 5–8 minutes, or until browned. ", "Pour the reduced marinade into the pan and boil rapidly until syrupy. Add the remaining butter to make the sauce glossy. Preheat the oven to 200C/180C Fan/Gas 6.", "For the root vegetable röstis, place all of the vegetables into a large bowl. Season with salt and pepper and stir in the parsley. Place the mixture in a muslin cloth or clean tea towel and squeeze out as much water as possible. ", "Place two 10cm/4in metal rings in a roasting tin and grease with the oil. Press the vegetable mixture tightly into the rings, add a knob of butter on top of each and cook for 10 minutes. Turn over and cook for another 10 minutes. Leave to cool a little before removing the ring. ", "Place the vegetable röstis on warmed plates and top each with a chicken supreme. Pour the red wine sauce around the röstis and serve immediately. "]}]