[{"ingredients": ["1 cucharada de aceite de girasol", "1 cebolla grande, finamente picada", "1 diente de ajo, aplastado", "500 g / 1 libra de carne picada de cerdo de 2 onzas, o una mezcla de carne de cerdo y carne picada", "175g / 6oz de pan blanco fresco", "1 cucharada de mejorana seca o 2 cucharadas de hojas frescas de mejorana, picadas", "1 cucharadita de semillas de comino", "1 cucharadita de sal marina en copos", "1 cucharadita de pimienta negra molida", "2 huevos medianos, golpeados", "500ml / 18fl oz de caldo de res (preferiblemente caldo fresco)", "150ml / 5fl oz / ¼ pinta crema agria", "unas ramitas de mejorana fresca, para adornar (opcional)"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Caliente el aceite en una sartén grande y fría la cebolla durante 5 minutos o hasta que se suavice, revolviendo ocasionalmente. Agregue el ajo y cocine durante 1 minuto más, revolviendo constantemente.", "Incline la cebolla y el ajo en un tazón grande y agregue la carne picada, 150 g / 5½ onzas de pan rallado, la mejorana, semillas de alcaravea, sal y pimienta. Mezcle todo bien con las manos limpias, luego agregue los huevos batidos y vuelva a mezclar. Forme la mezcla en una bola áspera.", "Coloque la bola en el centro de una lata de asar resistente y déle forma de pan largo, de unos 4 cm / 1½ de alto. Espolvoree las migas de pan reservadas en la parte superior y déles palmaditas ligeramente en el exterior del pan. Vierta 300ml / 10fl oz / ½ litro de caldo de carne alrededor de la base del pastel de carne.", "Hornee en el centro del horno durante 20 minutos, luego vierta el caldo restante en la lata y vuelva al horno por 10 minutos hasta que esté cocido. Transfiera la albondiga cuidadosamente a un plato de servir calentado y cubra holgadamente con papel de aluminio.", "Coloque la lata de asar a fuego medio y cocine a fuego lento durante unos minutos hasta que los jugos estén bien reducidos; debe tener aproximadamente 100 ml / 3½ fl oz de líquido en la lata. Agregue la crema agria y caliente suavemente, revolviendo constantemente, luego sazone al gusto con sal y pimienta.", "Cuele la salsa a través de un colador en una jarra pequeña.", "Adorne las albondigas con algunas ramitas frescas de mejorana, si tiene algunas, y sírvalas con la salsa picante."], "url": "www_bbc_co_uk_food_recipes_minced_pork_meatloaf_70199", "title": "Pastel de carne de cerdo con crema agria (Faschierter Rahmbraten)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minced_pork_meatloaf_70199_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "500 g / 1 libra de carne picada 2 oz", "1 cebolla picada", "1 cucharada de puré de tomate 1½ cucharada de harina común, más extra para espolvorear", "75g / 2½ oz de champiñones, picados", "250ml / 9fl oz stout o caldo de carne", "dash salsa Worcestershire", "400g / 14oz de masa de pasta brisa lista para usar", "1 huevo de gallina, solo yema, ligeramente batido"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén honda y freír la carne picada durante 4-5 minutos, rompiéndola con una cuchara de madera mientras se dora.", "Agregue la cebolla y cocine por 2-3 minutos, luego agregue el puré de tomate y cocine por 2-3 minutos más. Agregue la harina y cocine durante un minuto más, luego agregue los champiñones picados, el caldo de res o de cordero y un par de gotas de salsa Worcestershire. Llevar a ebullición, luego reducir el fuego, cubrir la olla con una tapa y dejar hervir a fuego lento durante 20 minutos. Dejar de lado y dejar enfriar, luego convertir la mezcla de carne en un plato de tarta de un litro.", "Extienda la masa sobre una superficie de trabajo enharinada hasta que sea un poco más grande que el plato para pastel. Cubre suavemente la masa sobre el plato, presionando firmemente sobre los bordes. Recortar, luego dar forma a los bordes en forma de estrías.", "Corta algunas hojas de los adornos de pasteles y decora la parte superior del pastel, pegándolos a la masa con la yema de huevo batida.", "Haga tres o cuatro ranuras en la masa para permitir que salga el vapor, luego cepille la tarta con el resto de la yema de huevo batida y hornee en el horno durante 20-25 minutos, o hasta que estén doradas.", "Para servir, cortar en rodajas."], "url": "www_bbc_co_uk_food_recipes_mincedbeefpie_89198", "title": "Pastel de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincedbeefpie_89198_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz de hojas frescas de albahaca santa, o albahaca común (peso después de quitar los tallos)", "aceite vegetal para freír poco, más 4 cucharadas para freír", "5 dientes de ajo, pelados y finamente picados", "75g / 3 oz chalotes o cebollas, peladas y finamente cortadas", "2 chiles frescos de cayena verde caliente, o al gusto, en rodajas", "2 chiles cayenos rojos calientes recién hechos, o al gusto, en rodajas", "Jengibre fresco de la raíz del cubo 2.5cm / 1in, finamente rallado", "450 g / 1 libra de carne picada de pavo (de pechuga deshuesada y pelada y / o piernas)", "5 cucharaditas de salsa de pescado o 1 cucharadita de sal, al gusto", "1½ cucharadita de azúcar de palma o azúcar moreno oscuro"], "method": ["Lave las hojas de albahaca y séquelas. Reserve 15g / ½oz de hojas enteras. Pica el resto muy toscamente y reserva.", "Caliente 1 cm / ½ en profundidad de aceite en una sartén mediana a fuego medio-alto. Coloque un plato forrado con papel de cocina cerca del fogón. Tenga preparada una pantalla de salpicaduras o un colador vuelto hacia arriba para cubrir la bandeja y evitar que el aceite salpique.", "Cuando el aceite esté caliente, agrega todas las hojas de albahaca. Cubra inmediatamente con la pantalla o el tamiz. Retire la cubierta tan pronto como se haya apagado el intenso chisporroteo (cuestión de segundos) y mezcle las hojas una o dos veces. Se pondrán crujientes muy rápido.", "Retirar con una cuchara ranurada y extender sobre el papel de cocina para drenar. Una vez que el aceite se haya enfriado lo suficiente, cuela y reserva para usar en el futuro.", "Caliente cuatro cucharadas de aceite en una sartén grande o en un sartén a fuego medio. Agregue el ajo y los chalotes y fría, revolviendo, durante unos dos minutos o hasta que los chalotes estén ligeramente dorados. No permita que se quemen.", "Agregue los chiles y el jengibre y dé unas pocas agitaciones vigorosas.", "Agregue la albahaca picada y revuelva.", "Agregue el pavo picado, suba el fuego un poco y fríalo por 3-4 minutos, revolviendo para romper los grumos mientras lo hace. El pavo perderá su color rosado una vez que esté cocido.", "Agregue la salsa de pescado (o sal), al gusto, y el azúcar de palma (o azúcar moreno oscuro) y mezcle bien para combinar. Si queda líquido en la parte inferior del wok, continúe cocinando hasta que hierva, pero no cocine en exceso el pavo.", "Transfiera a un plato de servir, cubra con las hojas de albahaca crujientes y fritas y sirva."], "url": "www_bbc_co_uk_food_recipes_mincedturkeystirfrie_90232", "title": "Pavo picado salteado con albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincedturkeystirfrie_90232_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de sebo vegetariano", "Manzanas Bramley 225g / 8oz, peladas, sin corazón y picadas", "125g / 4oz de cáscara confitada picada", "225 g / 8oz sultanas", "225 g / 8oz de pasas", "225g / 8oz pasas de Corinto", "175g / 6oz demerara azúcar", "1 cucharadita de especias mixtas", "1 naranja, ralladura y jugo", "Brandy de 60 ml / 2 fl oz"], "method": ["Mezcla todos los ingredientes juntos.", "Embale en frascos esterilizados y selle.", "Almacene en un lugar fresco y oscuro hasta que quiera usarlo."], "url": "www_bbc_co_uk_food_recipes_mincemeat_2491", "title": "Carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1.8kg / 4lb", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_2491_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "75g / 2½oz de mantequilla fría, en cubos", "25g / 1oz de azúcar glasé, más extra para quitar el polvo", "1 naranja grande, ralladura ralladura solamente", "1 huevo de gallinas camperas, golpeado", "Carne picada preparada de buena calidad 250g / 9oz", "Albaricoques secos listos para comer de 100g / 3½ oz, finamente picados (haz esto en un procesador de alimentos si tienes poco tiempo)", "Mazapán sin colorear 125 g / 4 oz, rallado"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y coloque una bandeja para hornear dentro para calentar.", "Para la masa, pulse la harina y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado, o frote la harina y la mantequilla en un tazón grande con las yemas de los dedos.", "Agregue el azúcar glas y la ralladura de naranja, agregue el huevo batido y mezcle hasta que los ingredientes se unan como una masa. Envuelva la masa en papel resistente a la grasa y enfríe en el refrigerador durante 10-15 minutos, o hasta que esté firme.", "Cuando la masa repose, desenvuélvala. Coloque el papel antigrasa sobre una superficie de trabajo y espolvoree ligeramente con azúcar glas. Coloque la masa encima, espolvoree con azúcar glas y luego cubra con otra hoja de papel resistente a la grasa. Enrolle la masa entre las hojas de papel antigrasa a un grosor de 1-2 mm. (Si está seguro de extender los pasteles, no necesita usar el papel antigrasa, pero ayuda a evitar que se desgarre el pastel si la masa está un poco pegajosa).", "Sello 12 rondas de la masa con un cortador de hojaldre acanalado de 8cm / 3in. (Cualquier pastel sobrante puede congelarse y usarse para hacer tartas de mermelada.) Alinee cada orificio del molde para muffins con uno de los panecillos y pinche la base de cada uno con un tenedor.", "Para el relleno, mezcle la carne picada con los albaricoques picados hasta que estén bien combinados. Divida la mezcla por igual entre los casos de pastelería. Cubra cada tarta con algo del mazapán rallado.", "Deslice la lata de panecillo sobre la bandeja para hornear caliente y hornéela en el horno de 12 a 15 minutos, o hasta que esté dorada y crujiente. Polvo con azúcar glas y servir caliente."], "url": "www_bbc_co_uk_food_recipes_mincemeat_and_orange_21941", "title": "Carne picada y tartas de plumas naranjas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_and_orange_21941_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 350g / 12oz", "190g / 7oz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa),% 20broken% 20into% 20pieces", "50ml / 2fl oz de ron", "375g / 13oz de mantequilla sin sal", "375g / 13oz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "500 g / 1 lb 2 oz de azúcar en polvo", "Harina normal 225g / 8oz", "6 huevos grandes de gallinas camperas", "1 cucharada de extracto de vainilla", "1 cucharadita de sal", "1 x 410 g carne picada de jarra"], "method": ["Precalentar el horno a 160C / Fan 140 / Gas 2½. Cubra una lata de 15x20cm / 6x8in con papel de hornear.", "Para el ganache, ponga la crema a punto de ebullición y luego retírela del fuego. Deje que se enfríe durante un par de minutos, luego agregue el chocolate hasta que se derrita. Agregue el ron y vierta en un recipiente o recipiente grande de vidrio. Dejar enfriar a temperatura ambiente durante hasta una hora.", "Mientras tanto, para los brownies, derrita la mantequilla y el chocolate en una sartén grande. Agregue el azúcar y revuelva hasta que se disuelva. Retire del fuego y tamice la harina, luego bata los huevos de a uno por vez.", "Mezcle la vainilla, la sal y la carne picada y vierta en la lata de hornear preparada. Hornee por 25 minutos, o hasta que el brownie esté firme pero el interior todavía se sienta suave. Dejar enfriar completamente en la lata, luego sacar de la lata y cortar en cuadrados.", "Justo antes de servir, bata el ganache hasta que esté gaseado y brillante.", "Para servir, coloque un brownie caliente sobre un plato para servir y cubra con una cucharada de ganache de chocolate."], "url": "www_bbc_co_uk_food_recipes_mincemeat_brownies_with_27556", "title": "Carne picada brownies con ganache de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 8oz", "pizca de sal", "1 cucharada de lanzador o azúcar glas, más extra para rociar", "125g / 4oz de mantequilla, en cubos", "55 g / 2 oz de manteca de cerdo, en cubos", "1 huevo de corral, separado", "2-3 cucharadas de agua", "1 x 400 g / 14 oz frasco de carne picada de lujo", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de licor de naranja, como Cointreau o Grand Marnier", "2 cucharaditas de azúcar en polvo", "1 naranja pequeña, ralladura fina solamente"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Haga la masa en un procesador de alimentos: mezcle la harina con una pizca de sal y el azúcar. Agregue la mantequilla y la manteca de cerdo al procesador y pulse brevemente.", "Agregue la yema de huevo y suficiente agua fría para hacer una masa dura (deje a un lado la clara de huevo). Use el botón de pulso en el procesador para juntar la mezcla.", "Extienda tres cuartas partes de la masa y forre una lata de flan de 23 cm / 9 pulgadas o un plato para tarta con ella. Llene la lata o el plato con la carne picada.", "Estire la porción restante de la masa para cubrir la parte superior, cortando un orificio de 7½ / 3 pulgadas en el centro con una fresa plana. Coloque el anillo de repostería en la parte superior del flan, engarce alrededor del borde para decorar y sellar.", "Cubra el agujero con un trozo de papel de aluminio del mismo tamaño que el agujero y hornee el flan en el horno durante 35-40 minutos.", "Unos cinco minutos antes de que el flan esté cocido, bata ligeramente la clara de huevo y cepilla la parte superior del flan con ella. Espolvorear con azúcar en polvo (o azúcar glasé) y volver al horno.", "Para servir, batir la crema con el licor, el azúcar impalpable y la ralladura de naranja en un tazón. Apila la crema en el medio del flan caliente y sirve caliente."], "url": "www_bbc_co_uk_food_recipes_mincemeat_flan_with_96385", "title": "Flan de carne picada con naranja Chantilly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Carne picada lista para usar 200 g / 7 oz", "3 clementinas, jugo y ralladura", "1 paquete de 375g / 13oz de hojaldre listo para enrollar", "2 cucharadas de mantequilla, derretida", "4 cucharadas de azúcar glas, cernida", "1 huevo de gallinas camperas, golpeado"], "method": ["Mezcle la carne picada, la ralladura de clementina y el jugo en un procesador de alimentos hasta lograr una pasta homogénea.", "Coloque la masa de hojaldre sobre una superficie bien enharinada con el lado corto hacia usted. Haga rodar la masa un poco más delgada y córtela por la mitad. Cepille cada pedazo de masa con mantequilla derretida y espolvoree sobre el azúcar glasé. Extienda la pasta de carne picada sobre la masa de hojaldre.", "Con el extremo más corto hacia usted, pase los dos bordes largos de una pieza de masa hacia el centro. Cepille un poco de huevo batido en el centro para unir las dos mitades. Repita con la pieza de repostería restante.", "Con cuidado, levante los rollos en una bandeja para hornear y deje enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire el rollo de la nevera y, con un cuchillo muy afilado, córtelo en trozos de 1cm / ½ en piezas gruesas. Coloque cada rebanada en la bandeja de hornear, con el lado del corte hacia arriba, y cepille bien con el huevo batido y otra capa de azúcar glas, luego hornee en el horno durante 15 - 20 minutos, o hasta inflado, crujiente y dorado.", "Retire las palmeras del horno y deje que se enfríen en la bandeja de hornear. Polvo con más azúcar glas antes de servir."], "url": "www_bbc_co_uk_food_recipes_mincemeat_palmiers_17610", "title": "Mincemeat palmiers", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 25", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_palmiers_17610_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Almendras blanqueadas de 150 g / 5½ oz (o cualquier otra nuez entera de su elección)", "Carne picada de 250 g / 9 oz", "1 cucharadita de canela molida", "pellizcar nuez moscada rallada finamente", "pellizcar clavos de tierra", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids),% 20chopped", "100g / 3½oz de higos secos, finamente picados", "1 cucharada de cacao en polvo", "60g / 2¼oz de harina natural o harina '00'", "25g / 1oz de mantequilla salada", "100 g / 3½ oz de miel que moquea", "100g / 3½oz de azúcar morena suave", "azúcar glas, para servir"], "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Engrase y forre una lata redonda con forma de resorte de 23 cm / 9 pulg con papel de hornear.", "Mezcle las almendras, la carne picada, las especias, el chocolate, los higos, el cacao y la harina en un tazón grande.", "Caliente la mantequilla, la miel y el azúcar en una olla mediana hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Vierta los ingredientes secos y mezcle hasta que estén bien combinados.", "Incline la mezcla en la lata preparada y hornee durante 40-50 minutos. Dejar enfriar en la lata.", "Justo antes de servir, transfiéralo a un plato para servir, espolvorea con azúcar glas y córtalo en rodajas finas."], "url": "www_bbc_co_uk_food_recipes_mincemeat_panforte_60354", "title": "Carne picada panforte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_panforte_60354_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla", "250 g / 9 oz de azúcar en polvo", "75g / 2½ oz de almendras molidas", "Harina normal de 100 g / 3½ oz", "4 huevos grandes, golpeados", "naranja orgánica o no encerada, ralladura y jugo", "100 g / 3½ oz de carne picada de buena calidad", "5 limones, ralladura y jugo", "1 naranja, ralladura y jugo", "150 g / 5½ oz de mantequilla sin sal, cortada en cubos", "300g / 10½ oz de azúcar", "4 huevos y 2 yemas de huevo", "2 cucharadas de Marsala o jerez seco", "400ml / 14fl oz de crema lista para usar", "300 ml / 10 fl oz doble crema", "20 physalis (grosellas de cabo)", "puñado de pistachos, sin cáscara y picado"], "method": ["Necesitará una lata de pastel de 23 cm / 9 pulgadas, la base forrada con papel pergamino o grasa. Precalentar el horno a 180C / 350F / Gas 4.", "Batir la mantequilla y el azúcar en una batidora eléctrica hasta que esté pálida y esponjosa. En otro recipiente, mezcle las almendras y la harina y déjelas a un lado.", "Agregue los huevos a la mantequilla y el azúcar, poco a poco, con el batidor lento. Apague la máquina y agregue la ralladura y un tercio de las almendras y la harina, luego encienda lentamente la batidora hasta incorporar los ingredientes secos, luego agregue la segunda y luego la tercera, apagando la máquina cada vez. Si lo haces demasiado rápido terminarás con un pastel pesado.", "Finalmente, con la máquina aún lenta, mezcle el jugo de naranja y la carne picada. Transfiera la mezcla con una espátula de goma a la lata forrada y hornee durante 35 minutos. Pase una espátula alrededor del borde de la lata y gírelo sobre papel azucarado. Deja enfriar.", "Para la naranja y la cuajada de limón, ponga la ralladura y el jugo, el azúcar y la mantequilla en un tazón resistente al calor colocado sobre una fuente de agua hirviendo, asegurándose de que el fondo del recipiente no toque el agua. Revuelva con un batidor de vez en cuando hasta que la mantequilla se haya derretido.", "Mezcle los huevos y las yemas ligeramente con un tenedor y luego mezcle con la mezcla de limón y naranja. Deje que la cuajada cocine, revolviendo regularmente, durante aproximadamente 10 minutos hasta que esté espesa y parecida a la crema. Debería sentirse pesado en el batidor. Retirar del fuego y remover ocasionalmente a medida que se enfría.", "Rompa la esponja de carne picada en pedazos y póngala en el fondo de un plato para servir. Espolvorear con un poco de vino dulce o Marsala o jerez seco. Vierta sobre la crema pastelera y coloque en la nevera, cubierto.", "Cuando la cuajada esté fría, viértala sobre la crema pastelera y déjela enfriar durante una hora. Batir la crema, una cuchara en la parte superior, luego decorar la parte superior de la bagatela con cáscara de naranja y physalis y una dispersión de pistachos picados."], "url": "www_bbc_co_uk_food_recipes_mincemeat_trifle_99318", "title": "Mincemeat trifle", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_trifle_99318_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 11in / 30cm lata de fondo suelto", "1 cantidad de masa de azúcar (ver receta separada)", "4 cucharadas de carne picada (ver receta separada)", "2 peras, peladas, sin corazón y descuartizadas", "4oz (100 g) de mantequilla ablandada", "4oz (100g) de azúcar moreno claro", "4 oz (100 g) de almendras molidas", "algunas gotas de extracto de vainilla", "2 huevos grandes", "3 cucharadas de ron oscuro", "2 cucharadas de glaseado de albaricoque"], "method": ["precaliente el horno a 160C / 325F / Gas 3 / 140C para horno ventilador", "Coloque su lata de flan en una bandeja de horno. Alinee la lata de flan con la masa. Asegúrate de dejar que el exceso de pasta cuelgue sobre los lados pero no lo recortes.", "Extiende la carne picada sobre el fondo de la masa y luego coloca las peras encima.", "Mezcle la mantequilla y el azúcar y añada las almendras y los huevos. Vierta el ron y agregue el extracto de vainilla. Extiende esta mezcla sobre la parte superior de las peras y hornea en el horno durante 40 - 45 minutos hasta que se establezca el frangipano. Debe ser dorado y firme.", "Cuando se enfríe, caliente a través del glaseado de albaricoque y cepille sobre la parte superior de la tarta."], "url": "www_bbc_co_uk_food_recipes_mincemeatalmondandpe_8898", "title": "Tarta de carne picada, almendra y pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de harina de auto crianza, tamizada", "150g / 5½oz de azúcar mascabado ligero", "100g / 3½oz de mantequilla sin sal, ablandada", "100ml / 3½ fl oz de leche", "Carne picada de alta calidad 200 g / 7 oz", "2 huevos medianos de granja", "ralladura de limón sin cera", "Carne picada de alta calidad 200 g / 7 oz", "50g / 1¾oz de azúcar mascabado ligero", "50g / 1¾oz de avena integral", "½ cucharadita de canela molida", "25 g / 1oz de mantequilla sin sal, derretida"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4 y untar con mantequilla una lata profunda de 18 cm / 7 in en forma de resorte.", "Coloque la harina, el azúcar y la mantequilla en una batidora con la leche, la carne picada, los huevos y la ralladura de limón. Agregue una pizca de sal y mezcle a baja velocidad durante un par de minutos hasta que se combinen a fondo. Alternativamente, mezcle con una cuchara de madera. Incline en la lata preparada y hornee durante 30 minutos.", "Mientras tanto, mezcle los ingredientes de topping en un tazón. Retire la torta y espolvoree cuidadosamente la migaja sobre la parte superior con los dedos. Hazlo poco a poco, para que no se hunda en la torta. Regrese al horno y continúe horneando por otros 50 minutos o hasta que un pincho insertado en el medio salga limpio (80 minutos de cocción por completo). Cubra holgadamente con papel de aluminio durante los últimos 10 minutos para evitar que se queme.", "Retire a una rejilla de alambre. Deje que se enfríe durante aproximadamente 30 minutos antes de retirar cuidadosamente los lados de la lata. Deje que se enfríe por completo y retire la base si sirve frío para el té, o si apenas sirve calor, sirva como budín."], "url": "www_bbc_co_uk_food_recipes_mincemeatcake_73208", "title": "Pastel de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal, para freír", "75 g / 2½oz de carne picada lista para usar", "2 hojas de pasta filo, cada corte en 3 tiras", "1 huevo de gallinas camperas, golpeado", "1 cucharada de yogur natural", "azúcar glas, al polvo"], "method": ["Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque una cucharada de carne picada en cada tira de pasta filo y enrolle en forma de triángulo, sellando la masa en los bordes.", "Cepille cada triángulo con el huevo batido.", "Coloque con cuidado los triángulos de carne picada en el aceite caliente y fríalos durante tres minutos.", "Retire con cuidado con una cuchara ranurada y drene bien transfiriendo a un recipiente con papel de cocina.", "Cuchara en un plato. Vierte el yogur natural en el medio de las parcelas de carne picada y espolvorea con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_mincemeatparcels_84935", "title": "Paquetes de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de grosella", "100g / 3½oz de uva", "100 g / 3½ oz de sultanas", "100g / 3½oz de arándanos secos", "100 g / 3½ oz de albaricoques secos, picados", "50 g / 1¾oz de cáscara mixta", "1 manzana grande para cocinar, pelada, sin corazón y picada", "75g / 2¾oz de mantequilla, en cubos", "25g / 1oz de almendras blanqueadas enteras, picadas", "125g / 4oz de azúcar mascabado ligero", "¼ cucharadita de canela molida", "½ cucharadita de especias mixtas molidas", "1 limón, ralladura finamente rallada y jugo de medio limón", "100ml / 3½fl oz de brandy, ron o jerez", "Harina blanca normal 175g / 6oz", "1½ cucharada de azúcar glas, tamizada", "100 g / 3½ oz de mantequilla, en cubos, más extra para engrasar", "75g / 3oz de mantequilla", "Harina blanca autoalimentada de 75g / 3oz", "40 g / 1½ oz de sémola", "40 g / 1½ oz de azúcar en polvo", "crema fresca o mantequilla de brandy"], "method": ["Para la carne picada, coloque las grosellas, pasas, pasas, arándanos, albaricoques, cáscara mixta, manzana, mantequilla, almendras, azúcar, canela, especias mixtas, ralladura de limón y jugo en una sartén grande y cocine a fuego lento, revolviendo ocasionalmente durante unos 10 minutos. Retirar del fuego, dejar enfriar, luego agregar el brandy, el ron o el jerez.", "Precaliente el horno a 200C / 400F / Gas 6 (ventilador 180C) y engrase una lata de rollo suizo 23x33cm / 9x13in o equivalente.", "Para la masa, tamizar la harina y el azúcar glas en un tazón y frotar la mantequilla hasta que la mezcla se asemeje a pan rallado grueso.", "Añada suficiente agua fría para mezclarla con una masa firme; si lo prefiere, puede prepararla en un procesador. Si el tiempo lo permite, envuelva la masa en una película adhesiva y déjela enfriar por unos 30 minutos.", "Sobre una superficie de trabajo ligeramente enharinada, extienda la masa en un rectángulo un poco más grande que la lata preparada, luego forme la base y los lados de la lata con masa.", "Recorte el nivel de la masa con los bordes superiores de la lata y parche los espacios si es necesario.", "Extienda la carne picada uniformemente sobre la base de la repostería.", "Para hacer el relleno, derrita la mantequilla y permita que se enfríe un poco.", "Coloque los ingredientes restantes en un recipiente y vierta la mantequilla derretida. Mezcle hasta que los ingredientes se combinen para formar una masa. Si el tiempo lo permite, enfríe esta mezcla, esto facilita las rejillas.", "Usando un rallador grueso, ralle el relleno sobre la carne picada y extiéndalo uniformemente.", "Hornee en el horno precalentado durante unos 20-25 minutos, o hasta que se doren.", "Cortar en 16 rebanadas, espolvorear con azúcar glas y servir caliente con crema o mantequilla de brandy."], "url": "www_bbc_co_uk_food_recipes_mincemeatstreusel_73426", "title": "Carne picada streusel", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeatstreusel_73426_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lote de repostería dulce brócoli", "Carne picada de 450 g / 1 lb", "glaseado o azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Extienda la masa preparada sobre una superficie ligeramente enharinada a aproximadamente 3 mm / 1 / 8pulg de grosor. Recorte 18 rondas con la cortadora grande y, si es necesario, vuelva a extenderla para cortar 18 tapas con una fresa más pequeña. Alinee las latas de patty con las rondas más grandes.", "Llene la masa hasta aproximadamente la mitad de su profundidad con carne picada teniendo cuidado de no llenar en exceso. Humedezca los bordes con un poco de agua y cubra con las tapas de pastelería. Sella bien los bordes.", "Cepille las partes superiores con agua y drague con azúcar. Haga dos pequeños cortes en la parte superior de cada pastel. Hornee por 15 minutos o hasta que estén doradas.", "Retire las latas y deje enfriar y luego drague con un poco más de azúcar."], "url": "www_bbc_co_uk_food_recipes_mincepies_2808", "title": "Cheaty picaditos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 18 pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350 g / 12 oz de carne picada de alta calidad, preferiblemente casera", "Harina normal de 200 g / 7 oz, tamizada", "40g / 1½ oz de azúcar en polvo de oro", "75g / 2¾oz de almendras molidas", "125g / 4½oz de mantequilla sin sal, cortada en cubitos", "1 huevo grande de gallinas camperas, golpeado", "leche, glasear"], "method": ["Engrase ligeramente un pastel de 12 hoyos o una lata de hamburguesas. Incline la carne picada en un recipiente y revuelva para que el líquido se distribuya uniformemente.", "Coloque la harina, el azúcar, las almendras y la mantequilla en un procesador de alimentos y procese brevemente hasta que parezca pan rallado, luego agregue lentamente el huevo a través del tubo de alimentación. (O frote la mantequilla con los ingredientes secos a mano y mezcle el huevo).", "Traiga la mezcla con sus manos, envuélvala en film transparente y relájese por una hora más o menos. Deléitese ligeramente sobre la masa en una superficie enharinada. Recortar 12 círculos con un cortador de hojaldre estriado, lo suficientemente grande como para llenar la base de la lata preparada. Presione suavemente en cada hoyo, luego llene con la carne picada.", "Cortar otros 12 discos un poco más pequeños y utilizar para cubrir la carne picada. Presione los bordes para sellar. Haga una pequeña abertura en la parte superior de cada uno, luego cepille ligeramente con leche. Enfriar durante unos 30 minutos. Mientras tanto, precalentar el horno a 200C / 400F / Gas 6.", "Hornee los pasteles durante 20 minutos hasta que estén dorados. Retire a una rejilla y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_mincepies_73207", "title": "Mince pies", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincepies_73207_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de uva", "100 g / 3½ oz de sultanas", "100 g / 3½ oz de grosella", "50 g / 2 oz de cerezas (si usas cerezas secas, no tendrán azúcar extra, pero las de azúcar tendrán azúcar)", "1 cucharadita de jengibre molido", "1 cucharadita de nuez moscada molida", "½ cucharadita de maceta de tierra", "2 cucharaditas de canela molida", "50g / 2oz de sebo vegetal (opcional)", "½ manzana Bramley para cocinar, sin corazón y picado, pero sin pelar", "1 limón, cortado en trozos pequeños pero sin pelar", "1 naranja, cortada en trozos pequeños pero sin pelar", "120ml / 4fl oz de brandy o whisky", "375g / 13oz de harina sin gluten y sin trigo con goma de xantano O harina de garbanzo (gramos) de 200g / 7oz con 175g / 6oz de harina de arroz", "150 g / 5 oz de mantequilla O margarina sin lácteos", "1 huevo (opcional)", "azúcar glas"], "method": ["Mezcle todas las frutas secas con las especias y el sebo si lo está usando.", "Coloque las piezas de manzana, naranja y limón en un procesador de alimentos y puré.", "Agregue esta mezcla a la fruta seca junto con el brandy o el whisky.", "Mezcle bien, cúbralo y déjelo aparte entre dos horas y 24 horas. Alternativamente, puede colocar en frascos esterilizados y almacenar para un uso posterior.", "Para hacer la masa, mezcle la harina y el tamiz en el tazón de un procesador de alimentos.", "Cortar la mantequilla o la margarina y mezclar hasta que se forme migas.", "Agregue 8-10 cucharadas de agua fría. Mezclar a la masa y mezclar hasta que se forme una bola.", "Retire del procesador y deje enfriar por 30 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y enmiende sus latas para pastel de carne picada.", "Retire la masa de la nevera y estire hasta un grosor de aproximadamente 5 mm. Corta la masa en círculos con un cortador ligeramente más grande que el tamaño de cada tarta, y forra tus latas de pastel con ella, empujando la masa por los bordes.", "Coloque la mezcla en cada pastel, luego despliegue las tapas y cubra cada pastel, mojando los bordes de la masa y presionando con los dedos.", "Si está usando el huevo, tóquelo en un tazón y cepille generosamente la tapa de cada tarta.", "Hornee durante unos 20 minutos o hasta que los pasteles estén ligeramente dorados y la pasta cocida.", "Retire del horno y espolvoree con azúcar si lo desea. Enfríe ligeramente antes de sacarlos con cuidado de las latas (usar un cuchillo afilado alrededor de los bordes para aflojarlos ayuda) y enfriar en una rejilla.", "Cuando la tienda fría en una lata hermética. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_mincepies_77293", "title": "Tartas de carne picada sin gluten", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "2 zanahorias picadas", "3 palitos de apio grandes, picados", "2 dientes de ajo, finamente picados", "2 cucharadas de puré de tomate", "1 x 400g / 14oz de tomates picados en lata", "1.2 litros / 2 pintas de caldo de verduras o pollo, hecho de un cubo", "Frijoles cannellini de 400 g / 14 oz, escurridos y enjuagados", "Espaguetis secos 100g / 3½, rotos en trozos cortos", "¼ cabeza de repollo verde, finamente rallado", "sal y pimienta"], "method": ["Calentar el aceite de oliva en una olla grande con tapa a fuego medio. Agregue la cebolla, las zanahorias y el apio, sazone con un poco de sal y pimienta y cocine durante unos 10 minutos, revolviendo ocasionalmente hasta que las verduras se hayan suavizado.", "Agregue el ajo y fría por otro minuto. Agregue el puré de tomate y cocine por otros tres minutos.", "Sugerencia en los tomates y el caldo. Cubra con una tapa y deje que hierva lentamente. Reduzca el fuego a fuego lento y cocine por 15 minutos.", "Agregue los frijoles y la pasta y cocine por otros 10 minutos o hasta que la pasta esté cocida. Agregue el repollo y cocine por otros dos minutos. Si la sopa es demasiado espesa, agregue un poco de agua caliente para alcanzar su consistencia preferida.", "Sazone al gusto con sal y pimienta antes de servir."], "url": "www_bbc_co_uk_food_recipes_minestrone_23211", "title": "minestrone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de espárragos picados", "100g / 3½oz de guisantes frescos sin cáscara", "100 g / 3½ oz descascadas habas pequeñas frescas", "150g / 5½ oz de judías verdes finas, picadas", "aceite de oliva virgen extra", "2 cebollas tiernas, finamente picadas", "¼ de apio, finamente picado", "200g / 7oz de papas cerosas, peladas y cortadas en cubos de 1cm / ½ en", "500ml / 18fl oz de caldo de pollo fresco (o caldo de verduras)", "Crema doble de 50 ml / 2 fl oz (opcional)", "sal marina y pimienta negra recién molida", "50 g / 1¾oz de hojas frescas de albahaca", "1 diente de ajo, finamente picado, aplastado con un poco de sal", "50ml / 2fl oz de aceite de oliva", "2 cucharadas de piñones", "4 cucharadas de queso parmesano rallado (o alternativa vegetariana)"], "method": ["Para la primavera minestrone, pula los espárragos, los guisantes, las habas y las judías verdes en una cacerola de agua hirviendo con sal durante unos minutos hasta que estén cocidos pero con un crujido. Escurrir y reservar en una bandeja.", "Caliente un chorrito de aceite de oliva en una cacerola, agregue las cebolletas, el apio y las papas y fríalos por unos 10 minutos, o hasta que las papas estén suaves, revolviendo ocasionalmente.", "Vierta el caldo de pollo o verduras (o simplemente podría usar parte del agua utilizada para cocinar las verduras). Agregue las verduras blanqueadas. Agregue la crema doble (si se usa) y sazone con sal y pimienta. Mezcle con una batidora de mano, pero déjelo grueso.", "Para el pesto, coloque todos los ingredientes en un procesador de alimentos con una cucharada de agua y mezcle para hacer un pesto suave.", "Sirva la minestrone en tazones con un chorrito de pesto fresco en la parte superior."], "url": "www_bbc_co_uk_food_recipes_minestrone_primavera_28116", "title": "Minestrone spring", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de ghee", "2 cebollas grandes, cortadas en cubitos", "1 apio, cortado, cortado en cubitos", "1 hoja de laurel", "1 calabaza, cortada, pelada, sin semillas", "3 dientes de ajo, cortados en cubitos", "1 zanahoria grande, cortada en cubitos", "½ cucharadita de orégano seco", "½ cucharadita de albahaca seca", "¼ cucharadita de hojuelas de chile o chile fresco picado", "800ml / 1¾ pintas de caldo de verduras", "400g de tomates cortados en lata (o 6 tomates grandes y frescos, sin semillas y picados)", "2 x 400 g de garbanzos cocidos, escurridos, enjuagados", "200 g / 7 oz cavolo nero, tallos resistentes eliminados, hojas finamente cortadas", "sal y pimienta negra recién molida", "gran puñado de parmesano rallado (o alternativa vegetariana)", "rociar aceite de oliva virgen extra"], "method": ["Caliente el ghee en una olla grande con tapa a fuego lento. Agregue la cebolla, el apio y la hoja de laurel y fría por 6-8 minutos, o hasta que estén blandos.", "Mientras tanto, pela la calabaza en forma de espagueti usando un pelador de julianas", "Agregue el ajo, la zanahoria, el orégano, la albahaca, las hojuelas de chile y el caldo a la sartén. Llevar a ebullición, luego reduzca el fuego de inmediato y cocine a fuego lento, tapado, durante 6-8 minutos.", "Agregue los tomates, los garbanzos y los cordones de calabaza y continúe cocinando a fuego lento durante 6-8 minutos, revolviendo ocasionalmente.", "Agregue el cavolo nero y cocine durante 4-5 minutos, o hasta que estén tiernos. Condimentar con sal y pimienta.", "Sirva la sopa en tazones para servir, luego espolvoree con queso parmesano rallado. Rocíe un poco de aceite de oliva virgen extra y sirva."], "url": "www_bbc_co_uk_food_recipes_minestrone_with_35108", "title": "Minestrone con \"tallarines\" de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minestrone_with_35108_16x9.jpg", "isVegetarian": true, "recommendations": 0}]