[{"isVegetarian": false, "title": "Gingerbread baubles", "url": "www_bbc_co_uk_food_recipes_gingerbread_baubles_08209", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_baubles_08209_16x9.jpg", "ingredients": ["50g/1¾oz light muscovado sugar", "50g/1¾oz dark muscovado sugar", "50g/1¾oz golden syrup", "150g/5½oz butter, roughly chopped", "1 medium free-range egg (at room temperature)", "300g/10½oz plain flour", "1 tbsp ground ginger", "1 tbsp ground mixed spice", "50g/1¾oz hard sweets, such as glacier mints, coloured hard boiled sweets, buttermints, or hard toffees", "20 strawberry laces ", "15g/½oz dark or milk chocolate chopped into small pieces", "10 mini peanut butter cups or other mini chocolates"], "serves": "Makes 15 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put both types of sugar, the golden syrup and the butter in a heavy-based saucepan. Set it over a medium heat and warm, stirring occasionally, until the butter has melted and the sugars have dissolved. ", "Transfer the mixture to a large bowl and leave to cool for about 5 minutes before beating in the egg. Sift over the flour and then the spices, one at a time, mixing gently after each addition, to make a soft dough.", "Put the dough into a food bag, or wrap in cling film. Chill for several hours, preferably overnight, to firm up – this makes the dough easier to roll out. ", "Remove the dough from the fridge 15-30 minutes before rolling so it can soften slightly. Split the dough in half and roll out each piece between two sheets of baking parchment to the thickness of a £1 coin. If you think the dough is very sticky, lightly dust it and the parchment with a little flour.", "Peel off the top sheet of parchment. Using the round cutters – either just one size or a variety – cut out discs. For each bauble you need to cut a 1.5 x 2cm strip of dough as well (it’s easiest to cut these from one long 2cm-wide piece of dough. Peel away the excess dough and re-roll the trimmings between fresh parchment to cut more discs. Repeat with the other piece of dough.", "Lift up the edge of a disc and slip the end of a strip of dough under it. Press gently so the strip adheres to the underside of the disc – about 1cm of the strip should protrude from the bauble (this will be the hanging fixture). ", "Use the end of a thin paintbrush handle, straw or cocktail stick to make a hole near the top of the protruding strip (you can thread this with string once the biscuit is baked).", "Repeat with the remaining discs and strips. Make sure there is a little space between the baubles, then lift them (on their sheets of parchment), on to baking trays and refrigerate for 15 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4 while the biscuits are chilling.", "Meanwhile, crush the boiled sweets into small pieces. Remove the baubles from the fridge and use the star cutter to stamp out a star shape from the centre of each. Carefully remove these stars and lay them on a separate parchment-lined baking tray. ", "Carefully put the crushed-up sweets inside the cut-out star shapes (don’t mix the sweets together). Bake the biscuits for 8-12 minutes or until the sweets have melted and the biscuits are deep golden-brown around the edges. Bake the cut-out stars separately for about 5 minutes. You can eat these stars as they are or give them away with the biscuit baubles as gifts. ", "While still warm, check the holes in the strips – if they have closed during baking, open them up again. Leave the biscuits to firm up on their trays until the melted sweets have set before transferring, on the parchment, to a wire rack to cool.", "Thread a strawberry lace through the hole in each bauble, using the end of a cocktail stick or a needle to help feed it through. Tie into loops for hanging.", "Melt the chocolate in a microwave or a heatproof bowl set over a pan of water, then leave to cool a little. Carefully cut the mini chocolates in half (you need only 15 halves but it’s worth having a few spare). Use the paintbrush/cocktail stick to dab melted chocolate onto the protruding strip at the top of each bauble and press on a mini chocolate half, which should just conceal the hole and cover the thread. Leave to set."]}, {"isVegetarian": true, "title": "Gluten-free gingerbread biscuits", "url": "www_bbc_co_uk_food_recipes_gingerbread_biscuits_37157", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_biscuits_37157_16x9.jpg", "ingredients": ["230g/9oz buckwheat flour, plus extra for dusting", "120g/4¼oz potato flour (also known as potato starch) ", "½ tsp bicarbonate of soda", "½ tsp xanthan gum ", "pinch sea salt flakes", "3 heaped tsp ground ginger", "110g/3¾oz cold unsalted butter, cubed", "1 large free-range egg", "170g/5¾oz soft light brown sugar", "2 tbsp syrup from a jar of preserved stem ginger", "2 tbsp date syrup or maple syrup"], "serves": "Makes about 50 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line two baking sheets with baking parchment.", "Sift the flours into a large mixing bowl and add the bicarbonate of soda, xanthum gum, salt and ground ginger. Rub in the butter until there are no visible lumps (or blend in a food processor). Stir in the brown sugar.", "Beat the egg with the two syrups and pour into the dry ingredients. Stir in the liquid with a knife and then knead it by hand until the mixture comes together as a soft dough.", "Dust a work surface with buckwheat flour and roll out the dough to 4mm thickness. Using biscuit cutters or a template, cut out the biscuits. ", "Transfer to the prepared baking sheet and bake for about 10 minutes or until golden-brown. Allow the biscuits to cool for a few minutes before transferring to a wire rack to cool completely. "]}, {"isVegetarian": true, "title": "Gingerbread biscuits", "url": "www_bbc_co_uk_food_recipes_gingerbread_biscuits_38814", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_biscuits_38814_16x9.jpg", "ingredients": ["2 tbsp golden syrup", "60g/2¼oz caster sugar", "50g/1¾oz butter", "3 tbsp double cream", "½ tsp ground ginger", "½ tsp ground cinnamon", "175g/6oz plain flour, plus extra for dusting", "½ tsp bicarbonate of soda"], "serves": "Serves 15-20", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the golden syrup, sugar and butter into a medium saucepan over a medium heat. Stir until the mixture is heated and the sugar completely dissolved. Remove from the heat and add the cream and spices.", "Add the flour and bicarbonate of soda, stirring as you add it until you have a loose mixture.  Place a sheet of parchment paper on a baking tray and tip the mixture on top. Cover with another piece of parchment and flatten the dough slightly. Leave to cool in the fridge for 2-3 hours. After this you should have a thick dough.", "Preheat the oven to 180C/350F/Gas 4.", "Remove the dough from the fridge and roll between the sheets of paper with a rolling pin until 1cm/½in thick.", "Dust a work surface with flour and roll the dough out with a floured rolling pin until 5mm/¼in thick (as you want the biscuits to only rise slightly when cooking and be nice and crisp when cooked).", "Using a floured cutter of your choice cut out the biscuits and place onto a lined baking tray. You may need to cook these in batches or use two trays if they don’t all fit on one tray.  Any scraps of dough can be pressed together, rerolled and cut out .", "Place the biscuits in the preheated oven and bake for 8-10 minutes, or until the biscuits are a rich brown colour at the sides and slightly paler in the centre. ", "Remove from the oven.  If you intend to hang the biscuits up (say from a Christmas tree) pierce a small hole in the top of the biscuit immediately after they come out of the oven and place on a wire rack to cool. ", "Once cool, you can thread ribbon or string through the hole at the top of the biscuit to hang from the tree. Store in an airtight container so that the biscuits remain crisp."]}, {"isVegetarian": true, "title": "Gingerbread cake with orange icing", "url": "www_bbc_co_uk_food_recipes_gingerbread_cake_with_69829", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_cake_with_69829_16x9.jpg", "ingredients": ["225g/8oz butter, softened", "225g/8oz light muscovado sugar", "225g/8oz golden syrup", "225g/8oz black treacle", "225g/8oz self-raising flour, sifted", "225g/8oz wholemeal self-raising flour, sifted", "4 tsp ground ginger", "2 tbsp stem ginger (from a jar), chopped", "2 free-range eggs, beaten", "300ml/10½fl oz milk", "150g/5oz icing sugar", "1 orange, juice and zest"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 23cm/9in square cake tin at least 4cm/1½in deep with baking parchment.", "Preheat the oven to 160C/325F/Gas 3.", "Place the butter, sugar, golden syrup and black treacle into a pan and heat gently until the mixture has melted evenly.  Set aside to cool slightly.", "Sift the flours, ground ginger and stem ginger into a large mixing bowl and mix gently.  Pour the cooled butter mixture into the flour. Add the eggs and milk and beat with a wooden spoon until well combined.", "Pour the cake batter into the tin and level the surface with a palette knife or the back of a spoon. Bake for 50 minutes, or until the cake has risen and is golden-brown and a skewer inserted into the middle comes out clean. Set aside to cool slightly in the tin, then transfer the cake to a wire rack and set aside to cool completely.", "Meanwhile, for the orange icing, sift the icing sugar into a bowl.  Add about two tablespoons of the orange juice and mix to a smooth paste.  Add more orange juice, as necessary, until you get a smooth icing of the consistency you desire. ", "Pour the icing over the cooled cake and spread lightly, allowing it to ooze over the edges. Sprinkle over chopped orange zest and set the cake aside until the icing has set. "]}, {"isVegetarian": true, "title": "Gingerbread cupcakes with salted caramel icing", "url": "www_bbc_co_uk_food_recipes_gingerbread_cupcakes_24180", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_cupcakes_24180_16x9.jpg", "ingredients": ["140g/5oz unsalted butter", "200g/7oz golden caster sugar", "60g/2¼oz black treacle", "60g/2¼oz golden syrup", "2 free-range eggs, plus 2 free-range egg yolks", "300g/10½oz plain flour", "1 tsp ground ginger", "1 tsp ground nutmeg", "2 tsp baking powder", "1 tsp salt", "240ml/8½fl oz milk, warmed", "125g/4½oz white caster sugar", "80ml/2½fl oz double cream", "½ tsp salt (or to taste)", "1 tsp vanilla extract", "160g/5¾oz salted butter, softened", "200g/7oz icing sugar"], "serves": "Makes 15 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line two 12-hole muffin tray with 15 paper cases.", "Beat the butter and sugar together in a bowl until light and creamy. Beat in the treacle, syrup, eggs and egg yolks until well combined. ", "Sift together the flour, ginger, nutmeg, baking powder and salt.  Add  half of the flour mixture to the butter mixture, then beat in half of the warm milk. Add the remaining flour mixture and the remaining milk and beat until well combined.", "Spoon the mixture into the muffin cases and bake for 20-25 minutes, or until well risen and lightly firm to the touch. Remove the cakes from the tin and set aside to cool on a cooling rack.", "For the salted caramel buttercream, heat the caster sugar and four tablespoons of water in a saucepan over a gentle heat until the sugar has dissolved, then increase the heat and cook the caramel for 2-3 minutes, or until golden and slightly thickened. Remove the pan from the heat immediately and stir in the cream. (CAUTION: the caramel may splutter a little when you add the cream.) Stir in the salt and vanilla and set aside to cool completely.", "Cream the butter and icing sugar together for at least 4- 5 minutes, then beat in the caramel.  When combined pipe or spread the icing over the cup cakes and sprinkle with a little extra sea salt.", "Decorate the cupcakes with the buttercream."]}, {"isVegetarian": true, "title": "Gingerbread latte fudge", "url": "www_bbc_co_uk_food_recipes_gingerbread_latte_fudge_68292", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_latte_fudge_68292_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter, plus extra for greasing", "75g/2½oz sticky ginger cake, thinly sliced ", "500g/1lb 2oz caster sugar", "150ml/5fl oz double cream", "135ml/4½fl oz full-fat milk ", "1 tsp ground ginger", "2 tsp ground espresso coffee "], "serves": "Makes about 50 pieces of fudge", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Butter a 17cm/7in square tin and line it with baking parchment. Preheat the grill to medium.", "Lay the ginger cake slices on a baking sheet. Grill until toasted, turning over once one side is done. Allow to cool and then chop it up roughly.", "Now put the sugar, cream, milk and 50ml/2fl oz boiling water in the centre of a large, deep pan (24cm/9½ in diameter). Heat gently over a very low heat for about 15 minutes, or until the butter has melted and the sugar has dissolved. Check by giving the mixture a stir with a wooden spoon, remove the spoon and examine the back of it  - any remaining granules should be visible.", "Put a sugar thermometer into the pan and turn up the heat until the mixture starts to bubble. Hold it at this simmering point, adjusting the heat accordingly, and cook until the mixture reaches 116C/241F. If you don’t have a thermometer, cook at this steady pace for about 15 minutes. (CAUTION: boiling sugar is extremely hot. Handle very carefully and do not leave unattended.)", "As soon as the temperature has been reached, pour about a quarter of the mixture into a metal bowl. ", "Add the ginger and coffee to the mixture still in the pan and beat it in for about a minute. ", "Next, stir in the chopped ginger cake and beat well for a few minutes more until the mixture has cooled a little and it starts to thicken round the edge. It’ll be coming away from the edges of the pan by this stage.", "Pour into the prepared tin. Give the reserved plain fudge mixture in the bowl a quick beat and spoon dollops over the top. Use a skewer to marble the two layers – it should look fluffy like a latte on top. Allow to cool at room temperature for a couple of hours, or refrigerate for 30 minutes. Cut into squares and eat."]}, {"isVegetarian": true, "title": "Gingerbread man Christmas cake", "url": "www_bbc_co_uk_food_recipes_gingerbread_man_93985", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_man_93985_16x9.jpg", "ingredients": ["150g/5½oz mixed dried fruit, such as sultanas, raisins and currants", "150g/5½oz dried cranberries", "150g/5½oz pitted soft prunes", "150g/5½oz pitted soft-dried dates", "150g/5½oz dried figs", "150ml/5fl oz brandy, plus optional extra to ‘feed’ the cake", "finely grated zest and juice of ½ orange", "150g/5½oz mixed whole nuts", "150g/5½oz butter, softened", "150g/5½oz dark muscovado sugar", "3 tbsp black treacle or date syrup, optional", "3 free-range eggs (at room temperature), beaten", "150g/5½oz self-raising flour", "3 tbsp ground mixed spice", "4 tbsp apricot jam", "750g/1lb 10oz ready to roll fondant", "750g/1lb 10oz marzipan", "fondant water icing", "marzipan ", "small coloured sweets or sprinkles "], "serves": "Makes 20cm/8in cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the mixed dried fruit and cranberries in a bowl. Using kitchen scissors, snip the prunes, dates and figs into small pieces, removing any stalks, and drop into the bowl. Add the brandy and orange zest and juice, and stir well to combine. Cover the bowl with a shower cap, clingfilm or plate and leave to soak in a cool place for at least 12 hours or, even better, 2 days.", "When you’re ready to make the cake, grease and line a 20cm/8in round loose-bottomed tin and preheat the oven to 180C/160C Fan/Gas 4.", "Spread the nuts on a baking tray and toast, checking frequently to be sure they don’t burn, for 5–10 minutes or until fragrant (you can skip the toasting, but it really brings out their flavour). Cool, then chop the nuts – I like them relatively chunky to contrast with the fruit. Turn the oven down to 140C/120C Fan/Gas 1.", "Using a hand-held electric whisk (it’s tricky to beat this small quantity in a free-standing mixer), beat together the butter and sugar for 5–10 minutes or until very light and creamy. Beat in the treacle or syrup, if using. Gradually add the eggs to the butter and sugar mixture, beating well after each addition. Sift the flour and spice into the mixture and fold in. Finally, stir through the soaked fruit, with any liquid left in the bowl, and the chopped nuts. ", "Spoon the mixture into your prepared tin and smooth the surface with the back of a spoon dipped in hot water. Bake for 2¼–2½ hours or until the cake is firm to the touch and a skewer pushed into the centre comes out clean. Set the tin on a wire rack. If you want to ‘feed’ the cake, leave it to cool for about 15 minutes, then prick the top all over with a cocktail stick or skewer, going about 3cm deep. Brush over about 1 tablespoon of brandy. Leave to soak in while the cake is cooling. Once the cake is cold, remove from the tin and wrap in fresh baking parchment, if you like, and then in foil before storing in an airtight tin or container for at least 5 days before eating. You can repeat the feeding process weekly for up to 5 weeks.", "When you’re ready to finish the cake, gently heat the apricot jam and spread over the surface of the cake. Roll out the marzipan to about the thickness of a pound coin and cover the whole cake. Roll out the fondant icing to the same thickness and cover the cake completely, pressing down to smooth it out. ", "Place your gingerbread man cutter/s on to the surface of your fully iced cake according to your desired arrangement. Press your cutter/s through the fondant and marzipan layers and remove the icing with the cutter still inserted to help give a cleaner outline. Add the gingerbread man features to the cut out shape using either cut out and shaped pieces of white fondant or fondant water icing placed in a piping bag. Marzipan shapes and sweets can be added on to an around your gingerbread man shapes for extra decoration."]}, {"isVegetarian": true, "title": "Gingerbread gift tags", "url": "www_bbc_co_uk_food_recipes_gingerbread_gift_tags_44951", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_gift_tags_44951_16x9.jpg", "ingredients": ["50g/1¾oz light muscovado sugar", "50g/1¾oz dark muscovado sugar", "50g/1¾oz golden syrup", "150g/5½oz butter, roughly chopped", "1 medium free-range egg (at room temperature)", "300g/10½oz plain flour", "1 tbsp ground ginger", "1 tbsp ground mixed spice", "50g/1¾oz white fondant", "water or runny honey", "20 strawberry laces"], "serves": "Makes about 15 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put both types of sugar, the golden syrup and the butter in a heavy-based saucepan. Set it over a medium heat and warm, stirring occasionally, until the butter has melted and the sugars have dissolved. ", "Transfer the mixture to a large bowl and leave to cool for about 5 minutes before beating in the egg. Sift over the flour and then the spices, one at a time, mixing gently after each addition, to make a soft dough.", "Put the dough into a food bag, or wrap in cling film. Chill for several hours, preferably overnight, to firm up – this makes the dough easier to roll out.", "Remove the dough from the fridge 15–30 minutes before rolling it, so it can soften slightly.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Roll out the dough between sheets of baking parchment to the thickness of a £1 coin. If the dough seems very sticky, dust it and the parchment lightly with a little flour. Peel off the top parchment sheet, then using a template or gift tag, cut out your tags with a sharp knife. You could also use a suitably sized cutter-approx 5 x7cm. ", "Gather up the dough trimmings and re-roll them between more parchment paper to cut more tags. Lift the tags, on the parchment, on to a baking tray. If necessary, trim off the top corners of each tag with a knife to make the classic tag shape. Create a hole near one end with the end of the drinking straw. If you want to emboss your tags, do it now. Chill for about 15 minutes.", "Bake for 8–12 minutes or until a rich golden-brown. Leave to firm up on the tray, then lift, still on the parchment, on to a wire rack to cool.", "To finish the biscuit tags, roll out the fondant between two pieces of baking parchment to a 2mm thickness. Peel off the top sheet of parchment and use a 1.5cm round piping nozzle or a pen lid to cut out circles. Use a paintbrush to apply a tiny bit of water or runny honey to each biscuit tag around the cut-out hole, to act as glue, then place a circle of fondant on top. Use the drinking straw or the end of the paintbrush to push the fondant through the hole in the biscuit, leaving a white border.", "Leave to set before threading strawberry laces through the holes."]}, {"isVegetarian": false, "title": "Gingerbread pancakes with Parma ham and maple syrup", "url": "www_bbc_co_uk_food_recipes_gingerbread_pancakes_89406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_pancakes_89406_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "3 tbsp soft light brown sugar", "1 tsp baking powder", "1 tsp cinnamon", "2 tsp ground ginger", "pinch salt", "½ lemon, zest finely grated (optional)", "½ vanilla pod, or a couple of drops of vanilla extract (optional)", "300ml/½ pint semi-skimmed milk", "1 medium free-range egg", "4 tbsp sunflower oil", "12 slices Parma ham or bacon ", "100ml/3½fl oz maple syrup", "100ml/3½fl oz sour cream or crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/225F/Gas ¼ (this will be to keep the pancakes warm as they are cooked in batches).   ", "Put the flour, sugar, baking powder, cinnamon, ginger and salt into a large bowl, give them a quick mix and make a well in the centre. Finely grate the lemon zest in, if using. Split the vanilla pod open, scrape the seeds out and add them, too (or vanilla extract). Then gradually pour the milk in bit by bit, stirring all the time to give a smooth mixture. Then beat the egg in well and set aside. ", "Put a drizzle of oil into a large frying pan on a medium heat and cook the Parma ham for 2-3 minutes on each side until nice and crisp. Then remove with tongs and drain on kitchen paper. Keep the ham warm in the oven until ready to serve.", "Leave the pan on the heat, but reduce the heat to low and add a little bit more oil if need be. Then spoon in four dollops of the pancake mix (to spread to about 10cm/3¼in wide). Leave to cook for about 1-2 minutes until golden, then flip them over and cook for another 1-2 minutes. Slide them onto a baking tray and put in the oven to keep warm. Then, repeat with the remaining mix to make about 12.", "Once you have made all of the pancakes, divide them between four plates. I like to pile the parma ham high on them and then drizzle with the maple syrup and serve with a dollop of sour cream or crème frâiche. "]}, {"isVegetarian": true, "title": "Gingerbread men", "url": "www_bbc_co_uk_food_recipes_gingerbread_men_99096", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_men_99096_16x9.jpg", "ingredients": ["350g/12oz plain flour, plus extra for rolling out", "1 tsp bicarbonate of soda", "2 tsp ground ginger", "1 tsp ground cinnamon", "125g/4½oz butter", "175g/6oz light soft brown sugar", "1 free-range egg", "4 tbsp golden syrup", "writing icing", "cake decorations"], "serves": "Makes 20", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Sift together the flour, bicarbonate of soda, ginger and cinnamon and pour into the bowl of a food processor. Add the butter and blend until the mix looks like breadcrumbs. Stir in the sugar. ", "Lightly beat the egg and golden syrup together, add to the food processor and pulse until the mixture clumps together.  Tip the dough out, knead briefly until smooth, wrap in clingfim and leave to chill in the fridge for 15 minutes.", "Preheat the oven to 180C/350F/Gas 4. Line two baking trays with greaseproof paper. ", "Roll the dough out to a 0.5cm/¼in thickness on a lightly floured surface. Using cutters, cut out the gingerbread men shapes and place on the baking tray, leaving a gap between them. ", "Bake for 12-15 minutes, or until lightly golden-brown. Leave on the tray for 10 minutes and then move to a wire rack to finish cooling.  When cooled decorate with the writing icing and cake decorations."]}, {"isVegetarian": true, "title": "Gingerbread robins", "url": "www_bbc_co_uk_food_recipes_gingerbread_robins_89555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_robins_89555_16x9.jpg", "ingredients": ["50g/1¾oz light muscovado sugar", "50g/1¾oz dark muscovado sugar", "50g/1¾oz golden syrup", "150g/5½oz butter, roughly chopped", "1 medium free-range egg (at room temperature)", "300g/10½oz plain flour", "1 tbsp ground ginger", "1 tbsp ground mixed spice", "50g/1¾oz chocolate, melted", "freeze dried strawberries/raspberries", "edible glitter, optional", "20 strawberry laces"], "serves": "Makes 15 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put both types of sugar, the golden syrup and the butter in a heavy-based saucepan. Set it over a medium heat and warm, stirring occasionally, until the butter has melted and the sugars have dissolved. ", "Transfer the mixture to a large bowl and leave to cool for about 5 minutes before beating in the egg. Sift over the flour and then the spices, one at a time, mixing gently after each addition, to make a soft dough.", "Put the dough into a food bag, or wrap in cling film. Chill for several hours, preferably overnight, to firm up – this makes the dough easier to roll out.", "Remove the dough from the fridge 15-30 minutes before rolling so it can soften slightly. ", "Preheat the oven to 180C/160C Fan/Gas 4.", "Roll out the dough between sheets of baking parchment to the thickness of a £1 coin. If the dough seems very sticky, dust it and the parchment lightly with a little flour. Peel off the top parchment sheet, then cut out your bird shapes and use a cocktail stick or bamboo skewer to create the indent of an eye and hole to thread through your strawberry laces if making Christmas tree decorations. Bake the biscuits for 10–12 minutes until they are a rich golden-brown. Leave them to firm up for a few minutes on the baking tray, then transfer to a wire rack to cool.", "Apply the melted chocolate to the birds using a paintbrush and sprinkle over your freeze dried fruit and red glitter if using. Leave to set before threading and tying your strawberry laces if creating gingerbread robin decorations."]}, {"isVegetarian": true, "title": "Ginger and broccoli fried rice", "url": "www_bbc_co_uk_food_recipes_gingerfriedrice_90107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "knob butter", "55g/2oz broccoli, chopped", "1 tsp freshly grated root ginger", "85g/3oz basmati rice, cooked and drained", "2 tbsp chopped fresh dill"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a pan and gently fry the broccoli and ginger for 3-4 minutes, or until the broccoli is tender. Add the cooked rice and fry for a further 3-4 minutes, then stir in the dill. ", "Spoon the fried rice onto a plate and serve immediately."]}, {"isVegetarian": true, "title": "Ginger cheesecake", "url": "www_bbc_co_uk_food_recipes_gingercheesecake_76506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz digestive biscuits, crushed", "2-3 tbsp honey", "200g/7oz mascarpone", "1-2 tsp stem ginger, chopped", "2 tbsp icing sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the crushed digestives with the honey in a bowl.", "Spoon the mixture into a chefs' ring on a serving plate and press down.", "Meanwhile, mix the mascarpone, ginger and sugar together in a bowl to combine.", "Spoon the mixture into the ring and smooth off the top using a palette knife. ", "Carefully heat the ring using a blowtorch and remove the ring.", "Serve."]}, {"isVegetarian": true, "title": "Ginger-glazed carrots", "url": "www_bbc_co_uk_food_recipes_gingerglazedcarrots_73411", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerglazedcarrots_73411_16x9.jpg", "ingredients": ["4 or 5 medium to large carrots", "large knob butter", "330ml/12fl oz ginger beer", "pinch of caster sugar", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel medium to large carrots thinly, top and tail, then cut into slices, or thin batons. Simmer in  salted water for a few minutes until al dente. Drain, run under the cold tap to halt cooking, then drain again thoroughly.", "Put the carrots into a saucepan with the butter, and enough ginger beer to come about halfway up the carrots. Sprinkle over a little caster sugar and season with salt. Bring up to the boil, stirring occasionally, then boil until the ginger beer has more or less all boiled away, leaving the carrots glazed with a sweet, buttery gingery glaze. Taste and add more salt if needed."]}, {"isVegetarian": true, "title": "Ginger 'juice'", "url": "www_bbc_co_uk_food_recipes_gingerjuice_89277", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/17fl oz boiling water", "2cm/1in piece fresh root ginger, peeled, sliced", "3cm/1½in cube rock sugar or 2-3 tbsp soft brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the water in a small saucepan and add the ginger pieces. Bring to the boil, add the rock sugar and reduce the heat to a simmer. Simmer for five minutes, then strain into a cup and serve."]}, {"isVegetarian": true, "title": "Ginger, mango and lime trifle", "url": "www_bbc_co_uk_food_recipes_gingermangoandlimetr_89126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, skin and stone removed, flesh cut into chunks", "1 tbsp honey", "5 tbsp dark rum", "150ml/5fl oz double cream, whipped to soft peaks", "2 tbsp maple syrup", "3 slices Jamaican ginger cake, crumbled", "½ lime, zest only", "1 orange, peeled and segmented", "2 lime slices", "icing sugar, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place half of the chopped mango, the honey and two tablespoons of the rum into a food processor and blend to a smooth purée. Fold the mango mixture into the whipped cream, along with the maple syrup. ", "Place half of the ginger cake into the bottom of two large glasses or serving dishes. Drizzle over the remaining rum, then layer half of the mango mousse on top, followed by the remaining ginger cake. Finish with the rest of the mango mousse, then top with the remaining chopped mango, lime zest and orange segments. ", "To serve, garnish with the lime slice repeat the layers, finishing with the mousse. Top with the chopped mango pieces, lime zest and orange segments and garnish with the lime slices and dust with the icing sugar."]}, {"isVegetarian": true, "title": "Ginger, pecan and rum chocolate brownies", "url": "www_bbc_co_uk_food_recipes_gingerpecanandrumcho_91734", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerpecanandrumcho_91734_16x9.jpg", "ingredients": ["250g/9oz plain chocolate, minimum 70 per cent cocoa solids, broken into pieces", "250g/9oz butter", "5 free-range eggs", "350g/12oz dark muscovado sugar", "1-2 tbsp rum (optional)", "150g/5½oz plain flour, sifted", "125g/4½oz pecan nuts, roughly chopped", "4 x 2.5cm/1in pieces stem ginger (from a jar), chopped", "icing sugar, sifted, for dusting (optional)"], "serves": "Makes 18-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a 30cm x 20cm/12in x 8in, deep-sided cake tin with greaseproof paper.", "Bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the chocolate pieces and butter to the bowl and stir until melted and glossy. Remove from the heat and set aside to cool slightly.", "In a separate bowl, beat together the eggs and sugar using an electric whisk until pale, fluffy and thick. ", "Add the melted chocolate mixture and rum, if using, then whisk again until smooth and well combined. ", "Carefully fold in the flour, using a metal spoon. Add the pecan nuts and stem ginger and fold into the mixture, then pour the brownie batter into the prepared cake tin.", "Transfer the brownies to the oven and bake for 20-25 minutes, or until the top is firm to the touch but a skewer inserted into the centre of the brownies comes out slightly sticky. Remove from the oven and set aside to cool slightly in the tin. ", "When the brownies have cooled slightly, cut them into 18-20 squares or triangles and carefully remove from the tin. Pile onto a plate and dust with icing sugar, if using."]}, {"isVegetarian": true, "title": "Gingernut sandwich cookies", "url": "www_bbc_co_uk_food_recipes_gingernut_sandwich_21151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cardamom pods", "100ml/3½fl oz double cream", "½ tsp freshly grated nutmeg, plus more to taste", "150g/5½oz white chocolate", "50g/1¾oz cream cheese", "125g/4½oz plain flour, plus extra for dusting", "¼ tsp baking powder", "1 tsp bicarbonate of soda", "2 tsp ground ginger", "1 tsp mixed spice", "65g/2¼oz slightly salted butter", "65g/2¼oz golden caster sugar", "1 tsp finely grated lemon zest", "1 thumb-sized piece stem ginger, grated very finely", "100g/3½oz golden syrup, warmed", "100g/3½oz toasted flaked almonds", "1 sheet gold leaf", "50g/1¾oz white chocolate", "15 toasted hazelnuts, skins removed"], "serves": "Makes 12-15 petits fours", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ganache, crush the cardamon pods in a pestle and mortar. Tip them into a small saucepan with the cream and grated nutmeg and bring to a simmer. Once hot, remove from the heat and set aside to infuse.", "For the gingernuts, place all the dry ingredients into a food processor and pulse together briefly. ", "Add the butter and pulse again until the mixture resembles breadcrumbs. Add the sugar, lemon zest and stem ginger and pulse once more. ", "Pour the warmed syrup into the food processor and process until the mixture forms a ball of dough. Cover in cling film and transfer to the freezer for 15 minutes. ", "Preheat the oven to oven 180C/170C(fan)/Gas 4.", "Remove the gingernut dough from the freezer and make 24-30 macadamia nut-sized balls of dough (about 5g/⅛oz). ", "Place each ball of dough on the mini-macaroon trays and flatten slightly. ", "Bake in the oven for about 5-7 minutes, or until golden-brown and a crackly surface has appeared. ", "Remove from the oven and leave to cool on the baking trays. ", "For the almonds, dry fry the flaked almonds in a pan over a medium heat until browned. Remove from the heat.", "Take out 24-30 of the flaked almonds and cover them in gold leaf with a small, dry paintbrush. Set aside.", "Crush the remaining flaked almonds in the pestle and mortar and set aside.", "To finish the ganache, carefully reheat the cream until just below boiling, remove from the heat and stir through the white chocolate until melted.", "Strain the cream into a bowl to remove the cardamom pods. Taste and add more nutmeg if necessary. Cover and leave to cool.", "When cool, carefully stir through the cream cheese to make a smooth, thick ganache consistency. ", "To assemble, transfer the ganache to a piping bag fitted with a small round nozzle and pipe it onto the top of half of the gingernuts. ", "Sandwich together with the remaining gingernuts and roll in the reserved chopped nuts.", "Melt the white chocolate and use it to attach a gold almond to each side of each gingernut sandwich. Serve the biscuits upright on their sides, with a hazelnut on top."]}, {"isVegetarian": false, "title": "Ginger scallops", "url": "www_bbc_co_uk_food_recipes_gingerscallops_74887", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["few drops of ginger pure essential oil", "4 scallops, shelled and corals removed", "1 tbsp groundnut oil", "freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a wire rack in the base of a large pot.  Put the pot on the hob on a moderate heat.  Add the drops of essential oil to the bottom of the pot. Sit the scallops on the rack, cover and leave to infuse for 2-5 minutes, depending on the strength of flavour you would like to achieve.", "Meanwhile, preheat a frying pan until hot.  Remove the scallops from the essential oil.  Drizzle with the groundnut oil and season with black pepper. Fry for 30 seconds, on both sides, and serve."]}, {"isVegetarian": true, "title": "Ginger sponge with lemongrass custard", "url": "www_bbc_co_uk_food_recipes_gingerspongewithlemo_84534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour", "110g/4oz caster sugar", "110g/4oz butter, plus extra for greasing", "2 free-range eggs", "thumb-sized piece ginger, peeled, grated and squeezed dry in kitchen paper", "200ml/7fl oz milk", "200ml/7fl oz cream", "1 stick lemongrass", "2 tbsp caster sugar", "3 free-range egg yolks"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge, place the flour, sugar, butter and eggs into a food processor and blend until smooth. Add the ginger and briefly blend again.", "Divide the mixture between four small microwave-safe pudding bowls greased with butter. ", "Place into the microwave for eight minutes, or until sponges have risen and are cooked through.", "Turn out the sponges onto four plates and set aside.", "For the custard, place the milk, cream and lemongrass into a saucepan over a low heat and gently heat until steaming, but not boiling. Remove from the heat and leave to infuse for ten minutes.", "Place the caster sugar and egg yolks into a bowl and whisk together.", "Remove the lemongrass from the milk mixture and gradually pour the milk mixture into the bowl of eggs and sugar, whisking constantly. ", "Return the mixture to a low heat and simmer, stirring continuously, until the custard coats the back of a spoon, then strain into a jug.", "To serve, pour equal portions of lemongrass custard over each sponge pudding and serve."]}, {"isVegetarian": true, "title": "Girl’s birthday cake", "url": "www_bbc_co_uk_food_recipes_girls_birthday_cake_46200", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/girls_birthday_cake_46200_16x9.jpg", "ingredients": ["250g/9oz royal icing", "few drops yellow food colouring", "2 tbsp sugar syrup", "150g/5½oz lemon curd", "250ml/9fl oz double cream, whipped until stiff peaks form when the whisk is removed", "100g/3½oz unsalted butter", "250g/9oz caster or brown sugar", "50ml/2fl oz sunflower oil", "25g/1oz arrowroot or cornflour", "2 tsp vanilla extract", "4 medium free-range eggs", "80ml/2½fl oz milk", "100ml/3½fl oz double cream", "300g/10½oz plain flour", "3 tsp baking powder", "300g/10½oz icing sugar", "25g/1oz liquid glucose", "50ml/1¾fl oz condensed milk", "2 tsp vanilla extract or other flavouring", "200g/7oz unsalted butter, softened", "100g/3½oz baking margarine, softened", "200g/7oz icing sugar", "100ml/3¾fl oz double cream", "few drops yellow food colouring", "1 tsp lemon extract"], "serves": "Makes 1 x 20cm/8in cake", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["A few days before make the royal icing daisies. Spoon one quarter of the royal icing into a disposable piping bag and cut off a small hole (alternatively, use a piping bag fitted with a plain 3mm/⅛in nozzle).", "Line a baking tray with non-stick baking paper, stick the paper to the tray with a little royal icing. Pipe daisy shapes onto the paper. ", "Spoon one quarter of the royal icing into a bowl and stir in the yellow food colouring. Spoon this into a disposable piping bag and cut off a small hole (alternatively, use a piping bag fitted with a plain 3mm/⅛in nozzle). Pipe yellow dots into the middle of each daisy. ", "Set aside to dry, at room temperature, for 1-2 days.", "For the cake, line the base of a deep 20cm/8in cake tin with non-stick paper and preheat the oven to180C/350F/Gas 4.", "Melt the butter over a low heat in a small pan, pour it into a bowl with the sugar, oil, cornflour (or arrowroot or cocoa) and vanilla. Beat well until smooth, then whisk in the eggs followed by the milk and cream.", "Sift and beat the flour and baking powder into the butter mixture in batches until smooth, then spoon into the prepared tin and bake for about 50 minutes, or until springy to the tough and skewer inserted into the middle comes out clean.", "For the buttercream, mix the icing sugar, glucose, condensed milk, flavouring and butter with an electric mixer in a bowl until smooth and light, then beat in the baking margarine until smooth.", "In a jug, stir the icing sugar into the cream until dissolved, then add the yellow food colouring and lemon extract until light and fluffy. (This buttercream keeps very well covered at room temperature for 2-3 days and can be warmed slightly and re-beaten if the texture is too firm.)", "To assemble the cake, remove the cake from the tin, trim the top of the cake to make it flat, then cut the cake in half horizontally. Put the bottom half of the cake onto a serving plate and spread with the lemon curd. Spoon dollops of the double cream around the edge of the cake and carefully smooth it into the middle. Drizzle the top half of the cake with the sugar syrup and place it on top of the bottom half. (The sugar syrup will help to keep the cake moist.)", "Dollop a large spoonful of the buttercream onto the top of the cake, then smooth it over the top of the cake to create a flat surface. Using a ruler, slowly scrape the surface to make sure it is smooth and flat. ", "Spread the icing around the sides of the cake and use a cake scraper or palette knife to make sure it is smooth. ", "Chill in the fridge for two hours, then repeat with another layer of icing. Chill in the fridge for another two hours.", "Spoon the remaining royal icing into a disposable piping bag and cut off a small hole (alternatively, use a piping bag fitted with a plain 3mm/⅛in nozzle). ", "Pipe ‘Happy Birthday’ onto the cake (or a message of your choice) and use the remaining royal icing to stick the piped flowers onto the top and sides of the cake."]}, {"isVegetarian": false, "title": "Glam mac and cheese", "url": "www_bbc_co_uk_food_recipes_glam_mac_and_cheese_92848", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/glam_mac_and_cheese_92848_16x9.jpg", "ingredients": ["340g/12oz macaroni ", "80g/3oz pancetta, diced ", "small handful fresh thyme leaves ", "3 spring onions, trimmed and finely sliced ", "100g/3½oz breadcrumbs ", "handful chopped fresh parsley ", "40g/1½oz butter ", "40g/1½oz plain flour ", "pinch ground nutmeg ", "1 tsp English mustard powder ", "200ml/7fl oz milk ", "285ml/10fl oz double cream ", "200g/7oz dolcelatte or gorgonzola cheese", "115g/4oz parmesan, grated", "salt and freshly ground black pepper "], "serves": "Serves 4 glamorous guests", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Cook the macaroni in a large pan of boiling salted water, for 8-10 minutes, or until just cooked. (It needs to be just undercooked as the pasta will be cooked again in the oven.) Drain, return to the pan and set aside. ", "Meanwhile, fry the pancetta in a medium frying pan over a gentle heat until it just starts to brown and crisp up, then add the thyme leaves and spring onions and cook for a further 3-4 minutes. Remove the pan from the heat and add its contents to the pasta. ", "For the sauce, put the butter, flour, nutmeg and mustard in a small pan set over a medium heat and cook until the butter has melted. Mix the milk and cream together in a jug and add a little to the flour and butter in the pan, stirring well. Keep adding the milk mixture, bit by bit, stirring well each time. (This will prevent the sauce from going lumpy. The temptation is to put all the milk in at once only to find you are left with clumps of flour floating on the surface. Should this happen, take the pan off the heat and whisk it like crazy. This normally does the trick to eliminate all the lumps! Make sure you get the spoon into the ‘corners’ of the pan as stray mounds of flour often lurk there.)", "Once all the milk has been added, turn up the heat and boil for a minute or two. The sauce will thicken considerably, then remove the pan from the heat. Add two-thirds of the dolcelatte (or gorgonzola) and parmesan to the sauce while it is still hot and stir together until well combined. It may be a bit lumpy, but that is fine. Season to taste with salt and pepper.", "Add the sauce to the pasta mixture and stir everything together. Spoon the mixture into a shallow casserole dish or four individual large ramekins. ", "Sprinkle the remaining cheese and the breadcrumbs over the top and bake in the oven for about 20-30 minutes, or until the cheese starts to bubble and the topping is golden-brown.", "Sprinkle with the chopped parsley. "]}, {"isVegetarian": false, "title": "Glamming up a cheese board", "url": "www_bbc_co_uk_food_recipes_glamming_up_a_cheese_95592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz Lincolnshire Poacher cheese", "1 ball of Burrata or 1 mozzarella ball", "175g/6oz stilton, preferably Colston Bassett Stilton ", "175g/6oz Cornish yarg", "175g/6oz soft blue goats’ cheese", "175g/6oz Ogleshield cheese", "vegetable oil, for deep frying", "100g/3½oz plain flour", "3 medium free-range eggs, beaten", "200g/7oz dried breadcrumbs or panko breadcrumbs", "sea salt", "100g/3½oz caster sugar", "100g/3½oz walnut halves", "pinch cayenne pepper", "rapeseed oil, for shallow frying", "1 head celery with leaves", "2 tbsp olive oil", "1 head baby gem leaves, leaves separated ", "2 green apples, cut into wedges", "2 red apples, cut into wedges", "1 lemon, zest and juice only", "salt and freshly ground black pepper", "2 free-range egg yolks ", "1 tsp English mustard", "1-2 tbsp white wine vinegar (to taste)", "150ml/5fl oz sunflower oil", "150ml/5fl oz olive oil", "100g/3½oz mango chutney", "50g/1¾oz quince paste (membrillo)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried cheese, preheat a deep fat fryer to 190C. Alternatively, heat the oil in a heavy-based, deep-sided pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous; do no leave unattended.).", "Cut the some of the cheese into chunks. Coat the chunks in the flour, then dip in the eggs and dredge in the breadcrumbs. Place in the fryer, in batches if necessary, and cook until golden-brown. Remove and drain on kitchen paper, season with sea salt.", "For the salad, make a syrup by heating the sugar with 100ml/3½fl oz water until the sugar has dissolved. Bring to the boil and add the walnut halves and cayenne pepper. Remove from the heat and set aside to cool.", "In a frying pan or sauté pan, heat the rapeseed oil until hot. Shallow fry the walnuts until crisp (approximately 30 seconds), then drain on kitchen paper. ", "Chop half of the celery into small chunks, and slice the remainder into 5cm/2in long strips. Place the olive oil and baby gem leaves into a bowl, then add the celery strips. Toss the celery to coat in the oil and season with salt and pepper. Place the celery chunks and remaining salad ingredients, including the walnuts into a bowl and mix well.", "For the mayonnaise, place the egg yolks, mustard and white wine vinegar in a food processor and blend.", "With the processor still running, slowly pour in the sunflower oil and olive oil, drop by drop at first, then faster as the mixture thickens, alternating between the two oils as you go. Continue blending until all the oil is incorporated and a thick mayonnaise is formed. Transfer the mayonnaise to a clean bowl and season with salt and pepper.", "Just before serving, add the mayonnaise to the salad and mix well.", "For the mango and quince sauce, place the chutney and paste into a small food processor and blend until smooth. ", "Place the hot deep fried cheese on a serving board with the cold cheese. Serve the salad and sauce alongside. "]}, {"isVegetarian": true, "title": "Glamorgan sausages", "url": "www_bbc_co_uk_food_recipes_glamorgan_sausages_01437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "100g/3½oz leek (about 1 leek), finely chopped", "¼ tsp freshly grated nutmeg", "200g/7oz wholemeal breadcrumbs, plus an extra 75g to coat the sausages", "2 tsp fresh thyme leaves", "2 heaped tsp fresh laverbread", "175g/6oz strong Chedder, grated", "1½ tsp English mustard", "2 eggs, 1 beaten", "splash milk (if required)", "50g/1¾oz plain flour", "1 tbsp vegetable oil", "salt and freshly ground black pepper"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt half the butter in a pan over a medium heat. Add the leek and season with salt, pepper and nutmeg. Cover and cook for 10–12 minutes, or until soft, stirring occasionally. Allow to cool.", "In a bowl, combine the 200g/7oz breadcrumbs, thyme, laverbread and Cheddar. Stir in the cooled leek mixture, the mustard and the whole egg. Season well, adding a splash of milk if necessary, to bring together into a dough.", "Shape into 12 small sausages and chill in the fridge for 20 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with greaseproof paper.", "Place the beaten egg, flour and the remaining breadcrumbs in separate shallow bowls. Once the sausages are chilled, roll them in the flour, then the beaten egg and then the breadcrumbs.", "Melt the remaining butter and the vegetable oil in a frying pan over a medium heat and fry the sausages for 2–3 minutes, or until golden all over.", "Place on the prepared baking tray and cook for 12–15 minutes, or until dark golden brown."]}, {"isVegetarian": true, "title": "Glamorgan sausages with red onion and chilli relish", "url": "www_bbc_co_uk_food_recipes_glamorgan_sausages_with_64911", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/glamorgan_sausages_with_64911_16x9.jpg", "ingredients": ["25g/1oz butter", "115g/4oz leeks, trimmed, finely sliced (prepared weight)", "175g/6oz fresh white breadcrumbs", "2 tbsp chopped fresh parsley", "1 tbsp chopped fresh thyme", "150g/5oz Caerphilly cheese or Welsh Cheddar, finely grated", "2 free-range eggs, separated", "1 tsp English mustard", "½ tsp flaked sea salt", "5 tbsp sunflower oil", "freshly ground black pepper", "2 tbsp sunflower oil ", "2 medium red onions, finely sliced", "1 red chilli, finely chopped", "2 garlic cloves, crushed", "75g/2½oz light brown muscovado sugar", "5 tbsp white wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sausages, melt the butter in a large non-stick frying pan and fry the leek gently for 8-10minutes, or until very soft but not coloured. ", "Put 100g/3½oz of the breadcrumbs, the parsley, thyme and cheese in a large mixing bowl and mix until well combined.  Beat the egg yolks with the mustard, salt and plenty of freshly ground black pepper in a separate bowl. ", "Remove the frying pan from the heat and tip the leeks into the bowl with the breadcrumbs. Add the egg yolks and mix together well with a large wooden spoon until well combined. Divide the leek mixture into eight portions and roll into sausage shapes. Place the sausages onto a tray lined with clingfilm.", "Whisk the egg whites lightly in a bowl with a large metal whisk until just frothy. Sprinkle 40g/1½oz breadcrumbs over a large plate. Dip the sausages one at a time into the beaten egg and roll in the breadcrumbs until evenly coated, then place on the baking tray. Chill the sausages in the fridge for 30 minutes.", "Meanwhile, for the relish, heat the oil in a large non-stick saucepan and fry the onions for 20 minutes, or until very soft and just beginning to colour. Add the chilli and garlic to the pan and cook for a further five minutes, stirring regularly. ", "Sprinkle with the sugar and pour over the vinegar. Bring to a simmer and cook for five further minutes, or until the liquid is well reduced and the relish becomes thick and glossy. Remove from the heat, set aside to cool for a few minutes then tip into a serving dish. ", "Heat the oil into a large non-stick frying pan and fry the sausages over a medium heat for 10-12 minutes, turning regularly until golden-brown and crisp. Serve the sausages with a good spoonful of chilli and onion relish and some thinly sliced runner beans."]}]