[{"ingredients": ["Chorizo ​​de 170 g / 6 oz, cortado en rodajas finas", "Panceta 110 g / 4 oz, cortada en dados pequeños", "2 dientes de ajo finamente picados", "1 cebolla española grande, finamente picada", "1 pimiento rojo, cortado en cubitos", "1 cucharadita de hojas suaves de tomillo", "¼ cucharadita de hojuelas de chile rojo seco", "570ml / 1pint calasparra (arroz de grano corto español)", "1 cucharadita de pimentón", "125ml / 4fl oz de vino blanco seco", "1,2 litros / 2 pintas de caldo de pollo, calentado con ¼ cucharadita de hilos de azafrán", "8 muslos de pollo, cada uno picado por la mitad y dorado", "18 almejas pequeñas, limpiadas", "Guisantes frescos o congelados de 110g / 4oz", "4 tomates grandes, sin semillas y cortados en cubitos", "50ml / 2fl oz de buen aceite de oliva", "1 cabeza de ajo, clavos separados y pelados", "12 gambas crudas jumbo, en cáscaras", "Calamares de 450 g / 1 libra, limpiados y cortados en pedazos del tamaño de un bocado", "5 cucharadas de perejil de flatillo picado", "Sal y pimienta negra recién molida"], "method": ["Calienta la mitad del aceite de oliva en un plato de paella o en una cacerola de base pesada. Agregue el chorizo ​​y la panceta y fría hasta que estén crujientes. Agregue el ajo, la cebolla y la pimienta y caliente hasta que se ablanden. Agregue el tomillo, los copos de chile y el arroz calasparra, y revuelva hasta que todos los granos de arroz estén bien cubiertos y brillantes. Ahora agregue el pimentón y el vino blanco seco y cuando esté burbujeante, vierta el caldo de pollo caliente, agregue los muslos de pollo y cocine durante 5-10 minutos.", "Ahora coloque las almejas en el plato con la unión hacia abajo para que los bordes se abran hacia afuera. Espolvoree los chícharos y los tomates picados y continúe cocinando suavemente por otros 10 minutos.", "Mientras tanto, caliente el aceite restante con los dientes de ajo en una sartén por separado y agregue las gambas. Freír rápidamente por un minuto o dos y luego agregarlos a la paella. Ahora haz lo mismo con el calamar y agrégalo también a la paella.", "Esparce el perejil picado sobre la paella y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_paella_7100", "title": "Paella", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paella_7100_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 papa grande, preferiblemente variedad Desirée, pelada y cortada en cubitos", "10g / ¼ oz de mantequilla sin sal", "5 cucharadas de crema doble", "sal marina y pimienta negra recién molida", "125ml / 4fl oz de aceite de oliva Arbequina", "2 x guarniciones de merluza recortadas y limpias, aproximadamente 200 g / 7 oz cada una", "aceite de oliva, para cocinar", "125g / 4½oz de chorizo ​​caliente para cocinar, pelado y cortado en cubitos", "1 chalote de plátano pequeño, pelado y cortado en cubitos", "16 almejas de surf, lavadas", "50 ml / 2fl oz de jerez manzanilla", "50ml / 2fl oz de vino blanco", "25 g / 1oz de mantequilla sin sal", "1 ramita de hojas de perejil plano, hojas recogidas y picadas", "jugo de limón, al gusto"], "method": ["Para el puré, coloque las papas en una sartén con agua con sal y deje hervir. Cocine a fuego lento hasta que las papas estén tiernas y luego drene bien y empuje a través de un ricer.", "Regrese las papas a la sartén a fuego lento y luego agregue la mantequilla y la crema. Sazonar bien con sal marina y pimienta negra recién molida, luego batir lentamente en el aceite de oliva hasta que se combinen a fondo. Coloque la sartén a un lado en un lugar cálido.", "Para la merluza, caliente una sartén antiadherente a fuego alto y agregue un chorrito de aceite de oliva. Sazonar las mermeladas de merluza con sal marina y pimienta negra recién molida y colocarlas en la sartén.", "Escuche por un lado durante dos minutos, gire hacia el otro lado y agregue el chorizo, chalotes y almejas.", "Cocine por un minuto más hasta que el chorizo ​​haya comenzado a liberar su aceite y las almejas hayan comenzado a abrirse.", "Escurra un poco del aceite y luego agregue el jerez y el vino. Llevar a ebullición y reducir la salsa, luego volver a poner la merluza y agregar la mantequilla y el perejil.", "Mezcle la salsa para emulsionar, raspando el sedimento del fondo de la sartén para agregar sabor extra. La salsa debe tener una consistencia almibarada y la merluza cocida: la carne debe ser opaca cuando se inserta un cuchillo pequeño cerca del hueso. Compruebe la salsa para sazonar y agregue un chorrito de jugo de limón.", "Para servir, vierta un poco del puré en un plato para servir, cubra con la merluza, vierta sobre la salsa y espolvoree las almejas y el chorizo."], "url": "www_bbc_co_uk_food_recipes_pan-_fried_hake_on_the_33468", "title": "Merluza al hueso con puré de aceite de oliva arbequina, almejas, chorizo ​​y perejil plano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paquete de cohetes 2 x 120 g / 4 oz", "puñado de piñones", "16 rebanadas de panceta", "2 perillas de mantequilla", "1 cucharadita de aceite de oliva", "4 peras, peladas, sin corazón, descuartizadas", "1 cucharadita de miel, más extra para el aderezo", "1 cucharadita de vinagre balsámico, más 2 cucharadas de aderezo", "½ cucharadita de mostaza Dijon", "150g / 5oz de gorgonzola, desmenuzado en trozos", "sal y pimienta negra recién molida"], "method": ["Distribuya el cohete de manera uniforme entre las cuatro placas de servir.", "Caliente una sartén y tueste los piñones durante tres minutos o hasta que estén dorados. Retire las nueces de la sartén.", "Caliente la panceta en una sartén a fuego medio y cocine hasta que quede crujiente. Retire y reserve para drenar en papel de cocina.", "Coloque una perilla de mantequilla y el aceite en una sartén limpia a fuego lento. Una vez que la mantequilla se derrita, agregue las peras, sal, pimienta y miel. Suba el fuego y cocine por otros cinco minutos.", "Agregue el vinagre balsámico y cocine por un minuto más, luego retire la sartén del fuego. Retire las peras de la sartén, reservando el zumo que pueda quedar.", "Coloque las peras y la panceta en la parte superior de las hojas del cohete para que cada persona tenga cuatro cuartos cada una.", "Para el aderezo, coloque la olla que contiene los jugos de pera en el fuego y agregue el resto de la mantequilla, una pizca de miel, la mostaza, la sal y la pimienta y los piñones. Cocine la mezcla hasta que se caliente.", "Vierta el aderezo sobre las peras y el cohete. Esparce sobre el gorgonzola y sirve."], "url": "www_bbc_co_uk_food_recipes_pan-fried_balsamic_pear_35881", "title": "Ensalada de pera balsámica con panceta, gorgonzola y aderezo de miel tibia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_balsamic_pear_35881_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de girasol", "4 lonchas de bacon ahumado sin corteza", "1 cucharadita de vinagre de vino blanco", "2 huevos frescos muy frescos (nevera fría)", "8 tomates cherry, cortados a la mitad", "buen puñado de berros", "llovizna de vinagre balsámico de buena calidad", "pimienta negra recién molida"], "method": ["Cepille una sartén antiadherente grande con aceite de girasol, usando la punta de un cepillo de pastelería. Coloque la sartén a fuego medio y agregue el tocino. Cocine por 2 minutos hasta que se dore un poco, luego voltee y fría en el otro lado por otros 3 minutos.", "Mientras el tocino se está cocinando, llene a medias una cacerola mediana antiadherente con agua, agregue el vinagre y deje que hierva. Baje el fuego a bajo, por lo que el agua solo burbujea. Agriete los huevos en el agua, uno a la vez, separándolos bien. Cocine por 2½ minutos.", "Los huevos deben subir a la superficie en un minuto. Si la clara de huevo se pega al fondo de la sartén, levántela suavemente con una cuchara de madera. Alternativamente, puede usar un cazador furtivo de huevos con tapa, ligeramente engrasado con aceite de girasol.", "Agregue los tomates a la sartén con el tocino y sazone con abundante pimienta negra. Cocine los tomates durante aproximadamente un minuto hasta que comiencen a suavizarse, volteándolos una vez.", "Pon una pequeña pila de berros en cada plato. Ponga tocino y tomates en los platos y rocíe con una pizca de vinagre balsámico. Saque los huevos del agua con una espumadera y colóquelos encima. Sazonar con un poco más de pimienta y meter de inmediato, mientras que todo es encantador y caliente."], "url": "www_bbc_co_uk_food_recipes_pan-fried_bacon_with_76907", "title": "Tocino frito con huevo escalfado y tomates", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_bacon_with_76907_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de raíz de jengibre fresco, pelado y en rodajas finas", "4 hojas frescas de curry", "75g / 2¾oz de azúcar de palma", "Pasta de tamarindo 50g / 2oz", "pizca de sal", "25 g / 1 oz de azúcar en polvo", "1 manzana, cortada horizontalmente en 12 rodajas finas", "10g / ½ oz de mantequilla", "8 rebanadas finas de panceta", "8x1cm / ½ en rebanadas gruesas morcilla", "1 cucharadita de aceite de oliva", "4 vieiras grandes con huevas", "½ limón, solo jugo", "4 cucharaditas de aceite de oliva virgen extra, para servir"], "method": ["Ponga a hervir el jengibre, las hojas de curry, el azúcar de palma, el tamarindo y 500 ml / 18 fl oz de agua en una olla grande, luego reduzca el fuego y cocine a fuego lento durante 10 minutos. Retirar del fuego y reservar para enfriar un poco, luego mezclar hasta obtener un puré fino en un procesador de alimentos. Sazonar con una pizca de sal.", "Caliente el azúcar en polvo en una sartén a fuego medio bajo hasta que se derrita y comience a caramelizar. Agregue las rodajas de manzana y cocine en el azúcar caramelizado durante unos segundos antes de agregar la mantequilla. Cuando la mantequilla se haya derretido, agregue un chorrito de agua a la sartén y agite el contenido, sin remover, hasta que el caramelo esté suave y las rodajas de manzana cubiertas de caramelo.", "Freír en seco las rebanadas de panceta en una sartén antiadherente a fuego alto, hasta que estén crujientes en ambos lados. Retire de la sartén y reserve.", "Agregue las rebanadas de pudín negro a la misma sartén y fría por 30 segundos solo en cada lado, hasta que estén crujientes por fuera pero suaves por dentro. Retire de la sartén y reserve.", "Rocíe las vieiras con un poco del aceite, luego agréguelas a la misma sartén y fría por 1-1½ minutos en cada lado, o hasta que estén doradas por ambos lados y recién cocidas. Exprima el jugo de limón y luego retire las vieiras de la sartén.", "Para servir, corte las vieiras por la mitad a lo ancho. Coloque un disco de manzana caramelizada en el centro de las placas de servir. Cubra con una cucharada pequeña de puré de especias, luego una rodaja de morcilla, luego media vieira. Repita el proceso de apilamiento una vez más para crear dos torres en cada plato. Rocíe una cucharada de puré de especias alrededor del borde de cada plato, luego cubra las torres con un par de pedazos de panceta crujiente y termine con un chorrito de aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_pan-fried_black_pudding_99293", "title": "Black pudding frito con vieiras y puré de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ repollo savoy, rallado", "3 cucharadas de aceite de oliva", "botón de mantequilla", "½ cebolla, finamente rebanada", "½ zanahoria, pelada y finamente cortada", "¼ de apio nabo, pelado y en rodajas finas", "Crema doble 350ml / 12fl oz", "6 rebanadas de hígado de ternera", "4 puerros tiernos, cortados por la mitad a lo largo", "sal y pimienta negra recién molida", "salsa de vino tinto caliente, para servir", "berro, para adornar"], "method": ["Escalde la col en una sartén grande con agua con sal durante 3 minutos y luego escurra.", "Caliente 1 cucharada de aceite y la mantequilla en una sartén y cocine la cebolla hasta que se ablande. Agregue la zanahoria y el apionabo y cocine durante 2 minutos. Vierta la crema y sazone con sal y pimienta. Agregue el repollo a la sartén y cocine hasta que el volumen del líquido se haya reducido en un tercio.", "Mientras tanto, caliente 1 cucharada de aceite en una sartén y fríe las rodajas de hígado durante 1½ minutos en cada lado. Condimentar con sal y pimienta.", "Aceite una sartén con el aceite restante y colóquelo a fuego alto. Agregue los puerros y la plancha hasta que estén ligeramente carbonizados. Condimentar con sal y pimienta.", "Para servir, divida la col entre dos platos para servir. Agregue el hígado y cubra con los puerros. Vierta sobre la salsa y decore con berros."], "url": "www_bbc_co_uk_food_recipes_pan-fried_calfs_liver_78370", "title": "Hígado de ternera frito, puerros a la plancha y repollo con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "gran perilla de mantequilla", "1 puerro, en rodajas finas", "4-5 cebollas de primavera, finamente picadas", "150 g / 5 oz de champiñones, en rodajas finas", "Pollo cocido deshuesado 225 g / 8oz, rallado", "150g / 5oz de queso feta, desmenuzado", "4 cucharadas de eneldo picado", "4 cucharadas de perejil picado", "4-6 cucharadas de crema doble", "un poco de nuez moscada recién molida", "pimienta negra recién molida y un poco de sal", "aceite de oliva, para cepillar", "200g / 7oz de masa filo"], "method": ["Para el relleno, caliente el aceite de oliva y la mantequilla en una sartén y fría los puerros, cebollas y champiñones hasta que se ablanden.", "Coloque en un tazón grande con el pollo cocido, queso feta, hierbas y suficiente crema para humedecer la mezcla.", "Sazone el relleno con un montón de pimienta negra recién molida y un poco de nuez moscada, al gusto. Pruebe el relleno y agregue un poco de sal si es necesario. El queso feta es muy salado por lo que es posible que no lo necesite.", "Cepille la base de una sartén con aceite de oliva. Coloque algunos trozos grandes de hojaldre sobre la sartén de manera que cubra los lados y cepille todo con aceite de oliva, luego ponga la mitad del relleno.", "Arranca un pedazo de hojaldre y ponte encima del relleno para cubrirlo. Cepillar con aceite de oliva y espolvorear con un poco de agua.", "Cuchara en el resto del relleno; Coloque más masa en la parte superior de la misma manera que antes para hacer la capa superior, cepille con aceite de oliva y espolvoree con agua.", "Dobla la masa, colgando sobre los bordes de la sartén, de vuelta sobre la parte superior para formar un buen pastel redondo. Cepíllese nuevamente con aceite de oliva y espolvoree ligeramente con agua.", "Freír durante 6-8 minutos a fuego lento, controlando todo el tiempo para que no se ponga demasiado rápido.", "Retirar del fuego, voltear como una tortilla española colocando un plato sobre la sartén y volteando rápidamente la tarta boca abajo sobre el plato. Rápidamente deslícela hacia atrás en la sartén y cocine el otro lado durante 6-8 minutos, o hasta que se dore.", "Coloque en una tabla de madera redonda y corte en cuñas grandes. Sirva caliente o frío con una ensalada verde o vegetales."], "url": "www_bbc_co_uk_food_recipes_pan-fried_chicken_pie_32885", "title": "Pastel de pollo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_chicken_pie_32885_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "2 cucharadas de vermut", "300ml / 10½fl oz de caldo de pescado", "Crema doble 225ml / 8fl oz", "Pan rallado de 140 g / 5 oz", "55g / 2oz de perejil fresco de flatleaf", "6 cucharadas de aceite de oliva", "4 x 175 g / 6¼ oz de filetes de bacalao, piel en", "25 g / 1oz de mantequilla sin sal", "100 g / 3½ oz de hongos girolle", "2 cucharadas de perejil de flatillo, finamente picado"], "method": ["Para la salsa de vermut, derrita la mantequilla en una sartén y fría los chalotes y el ajo durante 2-3 minutos. Esmalte de la bandeja con el vermut y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue el caldo de pescado y la crema y vuelva a cocinar hasta que el volumen del líquido se haya reducido a la mitad.", "Mezcle la mezcla en una licuadora y pase la salsa por un colador.", "Para el bacalao frito con una corteza de perejil, precalentar la parrilla a la configuración más alta.", "Mezcle el pan rallado, el perejil y las cuatro cucharadas de aceite de oliva en un procesador de alimentos hasta que estén bien combinados.", "Haga rodar la mezcla sobre una superficie de trabajo y corte cuatro piezas del mismo tamaño que los filetes de bacalao.", "Mientras tanto, caliente el aceite restante en una sartén y fría el bacalao con la piel hacia abajo durante 2-3 minutos.", "Retire los filetes de bacalao de la sartén, retire la piel y coloque la corteza de perejil encima.", "Ase los filetes de bacalao durante 2-3 minutos.", "Para los girolles salteados, derrita la mantequilla en una sartén, fría los champiñones durante 2-3 minutos, luego agregue el perejil picado.", "Para servir, espolvoree los champiñones alrededor de cada uno de los cuatro platos para servir, coloque un filete de bacalao en el centro de cada plato y espolvoree la salsa de vermut."], "url": "www_bbc_co_uk_food_recipes_pan-fried_cod_with_a_42389", "title": "Bacalao frito con corteza de perejil, girolles salteados y salsa de vermut", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 suelas enteras de Dover, fileteadas y deshuesadas", "25g / 1oz de harina natural, condimentada con sal y pimienta", "25ml / 1fl oz de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "1 limón, solo jugo", "10g / alcaparras para bebés", "2 cucharadas de salsa de caballero", "2 cucharadas de perejil finamente picado", "100g / 3½oz de camarones marrones", "50 g / 1¾oz de mantequilla sin sal", "50 g / 1¾oz de espinaca baby", "pizca de nuez moscada recién rallada", "1 manojo de berros frescos", "1 limón, pelado con una cuchara para quitar toda la médula y finamente cortado para que se parezca a las flores"], "method": ["Para la lengua de Dover, espolvorea el pescado en la harina sazonada. Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el pescado con la piel hacia abajo y cocine durante unos minutos. Dé vuelta y cocine por un minuto más.", "Retire el pescado de la sartén y déjelo a un lado para que descanse.", "Caliente la mantequilla en una sartén por separado, agregue los chalotes y fría por unos minutos. Una vez que ha llegado a la etapa de castaño (o beurre noisette), agregue el jugo de limón, las alcaparras, el condimento del caballero, el perejil y los camarones y cocine durante unos minutos.", "Para la espinaca marchita, en la misma sartén fritas tu pescado, calienta la mantequilla, agrega la espinaca y una cucharada de agua y cocina hasta que se marchite. Termine con una ralladura de nuez moscada fresca.", "Para servir, coloque un poco de espinaca en el centro de cada plato y cubra con el pescado. Vierta la salsa sobre y alrededor del pescado. Adorne con berros y flores de limón."], "url": "www_bbc_co_uk_food_recipes_pan-fried_dover_sole_20729", "title": "Suela de Dover frita en sartén con salsa de camarones y mantequilla de alcaparra y espinacas marchitas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["manojo pequeño remolacha mixta bebé (rojo, dulce, a rayas), recortado", "2 ramitas de tomillo", "2 pechos de pato, piel eliminada y reservada", "2 cucharadas de aceite de oliva, más extra para lloviznar", "25g / 1oz de mantequilla", "1 coliflor blanca, medio quebrada en florecillas, mitad rallada", "200ml / 7fl de leche en oz", "3 cucharadas de semillas de sésamo", "1 cucharada de semillas de cebolla negra", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro trituradas", "4 vainas de cardamomo trituradas", "media coliflor morada, rota en florecillas", "media coliflor de Romanesco, quebrada en florecillas", "3 dientes de ajo, finamente picados", "1 chile rojo", "2 remolachas rojas cocidas", "1 remolacha amarilla cocida, pelada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Frote las remolachas baby con aceite de oliva y espolvoree con tomillo, sal y pimienta. Cubra con papel de aluminio y cocine durante aproximadamente 2 horas, o hasta que esté suave.", "Mientras tanto, retire cuidadosamente la piel de los pechos de pato, envuelva la película adhesiva y congele hasta que se solidifique. Triture lo más finamente posible.", "Una vez que las remolachas estén lo suficientemente frías para manipularlas, pélelas y córtelas en cuartos.", "Caliente un poco de aceite en una sartén a fuego medio y cocine las pechugas de pato durante 10-12 minutos hasta que no sea medio seco. Retire y reserve para descansar.", "Agregue la piel de pato a la sartén y fría hasta que esté crujiente. Retire y escurra sobre papel de cocina. Cuando esté lo suficientemente frío para manipularlo, divídalo en tiras.", "Derrita la mantequilla en una sartén a fuego medio. Agregue la coliflor rallada, el ajo y el chile y cocine suavemente, sin colorear, durante 5-8 minutos. Agregue la leche y cocine hasta que esté suave. Vierta en una licuadora o procesador de alimentos y mezcle en un puré. Pase a través de un tamiz fino y reserve.", "Seque las semillas y las especias en una sartén hasta que estén tostadas y aromáticas. Bash en un almirez y mortero.", "Blanquee las flores de coliflor en agua hirviendo durante 3 minutos, escurra y mezcle las especias tostadas, el chile y el ajo. Dejar de lado.", "Blitz las remolachas rojas cocidas en una licuadora hasta que quede suave.", "Coloque el puré de coliflor en el centro de dos platos y esparza sobre las flores de coliflor y remolacha baby. Cortar el pato en diagonal en tiras y servir entre las dos placas. Dispersa los arañazos de pato en la parte superior. Con una cuchara sobre el aderezo de remolacha, termine con las rodajas de remolacha amarillas y sirva."], "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_breast_41664", "title": "Pechuga de pato frita con ensalada de coliflor marroquí, arañazos de pato y salsa de remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 dientes de ajo grandes (nueva temporada si es posible), en rodajas", "100g / 3½oz de mantequilla sin sal", "Bombilla de hinojo 450g / 1lb, en rodajas finas", "600ml / 20fl oz de caldo de pescado", "sal y pimienta negra recién molida", "100 g / 3½ oz de sémola", "Ramitas de 15g / ½oz de hojas de hinojo silvestre", "4 x 225 g / 8 oz piezas preparadas rape filete", "4 cucharadas de aceite de girasol", "2 cucharaditas de jugo de limón", "licor de anís", "20g / ¾oz de hojas de ajo silvestre, en rodajas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corte 13 de los dientes de ajo longitudinalmente en trozos largos y delgados. Derretir la mitad de la mantequilla en una sartén, agregar el ajo y el hinojo en rodajas y freír a fuego medio hasta que esté ligeramente dorado. Agregue la mitad del caldo de pescado y sal y pimienta, y cocine a fuego lento durante 15 minutos, o hasta que el hinojo esté tierno.", "Mientras tanto, corte los tres dientes de ajo restantes y póngalos en un procesador de alimentos con la sémola y todas menos una ramita de hojas de hinojo. Mezcle hasta que tenga un polvo aromático de color verde pálido.", "Cubra los pedazos de rape en la mezcla de sémola. Caliente el aceite en una sartén a prueba de horno, agregue un poco de mantequilla y las piezas de rape y fría a fuego moderado, girando de vez en cuando, hasta que estén doradas por todas partes. Transfiera la sartén al horno y cocine el rape por otros 10 minutos.", "Retire la sartén del horno y levante los filetes en una tabla de cortar. Rebana diagonalmente en rodajas gruesas, manteniendo cada pieza en forma. Transfiera a un plato y manténgalo caliente.", "Pica finamente la hierba de hinojo silvestre restante. Agréguelo a la sartén donde se cocinó el rape junto con la mezcla de hinojo cocido, el jugo de limón, el licor y el ajo silvestre.", "Cocine a fuego lento hasta que esté ligeramente reducido en volumen, luego agregue la mantequilla restante y cocine a fuego lento hasta que se haya mezclado para hacer una salsa rica. Ajuste el aderezo si es necesario. Levante el pescado en cuatro platos calentados y cuchara una parte de la salsa alrededor de cada pieza."], "url": "www_bbc_co_uk_food_recipes_pan-fried_fillet_of_83911", "title": "Rape frito con ajo silvestre e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1oz de pasas", "300ml / 10fl oz oloroso jerez", "4 patas de pato de 175-200 g / 6-7 onzas", "25 g / 1 oz de azúcar en polvo", "2 cucharaditas de vinagre de jerez", "1 cucharada de vinagre de vino tinto", "¾ tsp arrurruz", "25 g / 1 oz de piñones, tostados", "aceite de oliva, para freír", "1 calabaza grande, finamente cortada, con piel", "1 chalote de plátano, finamente cortado en cubitos", "75g / 2oz de rebozuelos", "4 ramitas de tomillo", "ramitas de berro, para adornar", "sal marina y pimienta negra recién molida"], "method": ["Remoje las pasas en el jerez durante la noche. Coloque las pechugas de pato en un plato y cúbralas sin apretar con una hoja de papel resistente a la grasa. Déjalos en la nevera durante la noche (esto ayudará a secar la piel y la hará más crujiente).", "Cuando esté listo para comenzar a cocinar, coloque el vinagre de azúcar y jerez en una olla pequeña con 1 cucharada de agua fría y cocine a fuego lento hasta que el azúcar se haya disuelto por completo. Aumente el fuego y hierva vigorosamente hasta que el jarabe se convierta en un caramelo de color ámbar profundo (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente).", "Retire la sartén del fuego y agregue el vinagre de vino tinto (tenga cuidado ya que burbujeará bastante energéticamente). Regrese la sartén al fuego, agregue las pasas empapadas y el jerez. Dejar hervir a fuego lento durante 20 minutos.", "Mezcle el arrurruz con 2 cucharadas de agua, mezcle con la salsa y cocine a fuego lento durante 1 minuto, luego agregue los piñones. Sazone al gusto y mantenga caliente a fuego lento.", "Marque ligeramente la piel de cada pechuga de pato en un patrón de diamante, teniendo cuidado de no cortar la carne. Sazone la carne con sal y pimienta y la piel con solo sal.", "Caliente una sartén seca y de base pesada a fuego alto. Agregue las pechugas de pato, con la piel hacia abajo, baje el fuego a medio y cocine durante 3-4 minutos hasta que la piel esté crujiente y dorada. Dale la vuelta a los senos y cocínalos por 5 minutos si te gustan los rosados, o un poco más largos si te gustan un poco más cocidos. Retire los senos de la sartén y colóquelos en una tabla. Déjalo reposar por 5 minutos.", "Mientras tanto, usando la misma sartén en la que cocinó el pato, agregue un poco de aceite de oliva y fría la calabaza en rodajas durante unos minutos.", "Calentar un poco de aceite de oliva en una sartén pequeña y agregar la chalota. A medida que comienzan a cambiar de color, agregue los girolles y el tomillo, freír por no más de 1 minuto. Sazone al gusto.", "Coloque la calabaza en platos calientes. Rebana cada pechuga de pato diagonalmente en rodajas finas y largas y colócalo al lado de la calabaza. Agregue algunos de los girolles alrededor del plato, espolvoree la salsa y adorne con las ramitas de berros."], "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_with_90914", "title": "Pato frito con salsa de jerez, pasas y piñones", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de brócoli (aproximadamente 1 cabeza), más o menos picados", "100ml / 3½ fl oz de aceite de oliva, más extra para aflojar si se desea", "50-100 g / 2-3½ oz de piñones tostados, al gusto", "1 diente de ajo, aproximadamente picado", "1 chile verde, finamente picado", "50g / 1¾oz de queso parmesano (o alternativa vegetariana), recién rallado", "sal y pimienta para probar", "300g / 10½oz de vegetales verdes como espárragos, brócoli con brotes morados, calabacines y puerros tiernos", "aceite de oliva, para lloviznar y freír", "1 paquete de ñoquis comprados en la tienda", "3 rebanadas de panceta, al horno o a la parrilla, para adornar (opcional)"], "method": ["Blanquee el brócoli en agua hirviendo con sal durante 3-4 minutos, o hasta que esté tierno. Drene e inmediatamente sumérjalo en agua helada para evitar que siga cocinando. Escurrir de nuevo y agregar a una licuadora con aceite de oliva, piñones tostados, ajo, chile y una buena rejilla de queso parmesano. Mezcle y pegue para hacer pesto. Pruebe y sazone con sal y pimienta y agregue más aceite de oliva si es necesario para obtener la consistencia que desea.", "Para cocinar las verduras, caliente una sartén a la plancha. Rocíe las verduras verdes con aceite de oliva y cocine en una sartén plancha. (Puedes usar cualquier verdura que te guste para esto, pero si eliges raíz vegetal o algo más grande que los espárragos, es posible que necesites blanquearlo primero para ablandarlo antes de cocinarlo).", "Calienta una buena cantidad de aceite de oliva en una sartén e inclínate en el gnocchi directamente del paquete. Freír hasta que se doren por todas partes, para que se vean como mini patatas asadas.", "Sirva los gnocchi y las verduras a la plancha con una buena cucharada de pesto de brócoli. También puede espolvorear sobre una panceta desmenuzada para obtener una guarnición crujiente y salada."], "url": "www_bbc_co_uk_food_recipes_pan-fried_gnocchi_with_36887", "title": "Gnocchi frito con pesto de brócoli y verduras a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_gnocchi_with_36887_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 rebanadas de tocino", "2 pechos grouse", "sal y pimienta negra recién molida", "pequeñas hojas sabias puñado", "aceite de oliva", "mantequilla, para freír", "2 cucharadas de aceite de oliva", "1 diente de ajo, pelado y aplastado", "2 chalotes, pelados y finamente cortados", "½ chili, finamente picado", "4 cucharadas de vino Marsala", "2 cucharadas de jalea de serbal (alternativamente, use grosella o jalea de grosella negra)", "1 cucharada de aceite de oliva", "botón de mantequilla", "2 dientes de ajo, pelados y triturados", "300g / 10½ oz de col rizada", "100 ml / 3½ fl oz de caldo de pollo"], "method": ["Para el urogallo, coloque tres rebanadas de panceta en un tablero, superponiéndose ligeramente. Coloque una pechuga de grouse en el centro, sazone con sal y pimienta y coloque unas hojas de salvia en la parte superior. Envuelva el pecho en la panceta. Repita con el otro seno.", "En una sartén, caliente 1-2 cucharadas de aceite de oliva y fría el urogallo durante 2-2½ minutos en cada lado. Agregue un pomo de mantequilla y, cuando se haya derretido, hilvane los senos. Retire del fuego y reserve para descansar.", "Para la salsa, caliente el aceite en una sartén y fríe con cuidado el ajo, la chalota y la mitad de la guindilla picada durante unos minutos para que se ablanden. Agregue el Marsala y la jalea de serbal. Sazone al gusto con sal y pimienta negra recién molida. Reduzca el fuego y cocine a fuego lento hasta que la salsa se espese.", "Para la col rizada, caliente el aceite y la mantequilla en una sartén y fríe con cuidado el ajo y la guindilla reservada durante dos minutos. Agregue la col rizada, agregue el caldo y cocine por 2-3 minutos, o hasta que la col rizada se haya marchitado.", "Para servir, coloca la col rizada en platos para servir y coloca el urogallo al lado. Rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_pan-fried_grouse_with_94896", "title": "Gallo frito con salsa Marsala y col rizada marchita", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "200g / 7oz de papas nuevas, ligeramente raspadas y descuartizadas longitudinalmente", "½ cebolla, pelada, rebanada finamente", "1 diente de ajo, pelado, finamente picado", "400 ml / 14floz de caldo de pollo", "sal al gusto", "200 g / 7 oz de habas congeladas y envasadas, descongeladas", "250 g / 9 oz de espinacas, picadas", "10 g / ½ onza de hojas de menta fresca, en rodajas finas", "pimienta negra recién molida, al gusto", "4 x 175 g / 6oz de filetes de perlón, pin deshuesado, piel anotada", "Tocino rayado de 110 g / 4 oz, cortado en lardons"], "method": ["Caliente dos cucharadas de aceite en una cacerola grande y fría la cebolla y las papas suavemente durante unos 10 minutos, o hasta que las verduras estén blandas pero no doradas.", "Agregue el ajo y cocine por un minuto más.", "Agregue el caldo y sazone con sal, al gusto. Ponga a hervir el guiso, luego reduzca el fuego, cubra y cocine a fuego lento durante unos 10 minutos o hasta que las papas estén tiernas.", "Agregue las habas y cocine por un minuto más. Agregue la espinaca picada y cocine durante 1-2 minutos, o hasta que la espinaca se marchite. Finalmente, mezcle la menta y sazone con pimienta negra recién molida, al gusto.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva restante y fría los filetes de pergamino, con la piel hacia abajo, durante 2 a 3 minutos, o hasta que estén crujientes. Voltee los filetes y continúe cocinando por otros dos minutos, o hasta que el pescado esté bien cocido.", "Retire el pergamino de la sartén y déjelo a un lado para que descanse durante 1-2 minutos.", "Mientras tanto, caliente una sartén por separado y fríe los lardons de tocino durante 2-3 minutos, o hasta que estén dorados y crujientes.", "Para servir, divida el guiso entre dos tazones, cubra cada uno con dos filetes de perlitas y espolvoree sobre los lardons de tocino."], "url": "www_bbc_co_uk_food_recipes_pan-fried_gurnard_with_79627", "title": "Perlón frito con guiso de habas, espinacas y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 200 g / 7 oz rebanadas de merluza, cortadas a través del hueso (alternativamente, utilizar filetes de merluza gruesas)", "pellizcar copos de sal marina", "3-4 cucharadas de harina natural, para quitar el polvo", "1 cucharada de aceite vegetal", "50g / 1¾oz de mantequilla", "salpicaduras de vinagre de malta", "1 cucharada de hojas frescas de tomillo", "1 cucharada de azúcar demerara", "2 cucharadas de hojas de apio picadas, más extra para decorar", "25g / 1oz de mantequilla", "1 cebolla, pelada y finamente picada", "1 diente de ajo, rallado", "pizca de sal", "300g / 10½ oz champiñones, lavados, en rodajas", "75ml / 2¾fl oz de jerez seco", "20g / ¾oz de champiñones secos", "150ml / 5fl oz de crema doble", "1 cucharada de yogur griego", "75g / 2¾oz de mantequilla", "pellizcar copos de sal marina", "1 raíz de apio (el final de un racimo de apio), limpia, recortada, con trozos de fibra eliminados, cortada por la mitad a través de la raíz", "½ cucharadita de hojas frescas de tomillo", "30g / 1¼ oz de avellanas tostadas, para servir"], "method": ["Para la merluza, espolvorea un lado de la merluza con escamas de sal. Dejar de lado.", "Para el puré de champiñones, caliente la mantequilla en una cacerola a fuego medio. Agregue la cebolla y el ajo y sazone con una pizca de sal. Freír durante 3-4 minutos, o hasta que estén blandos.", "Agregue 200 g / 7 oz de los champiñones y continúe cocinando durante otros 1-2 minutos, revolviendo regularmente. Verter el jerez y llevar a ebullición, luego agregar los champiñones secos. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento hasta que la mayoría del líquido se haya evaporado.", "Agregue la crema doble y devuelva la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 4-5 minutos o hasta que el volumen del líquido se haya reducido en un tercio. Retirar del fuego y reservar para enfriar un poco.", "En un procesador de alimentos, mezcle la mezcla de champiñones en un puré y agregue el yogur mientras lo mezcla. Cuele el puré a través de un colador fino en una olla limpia, luego manténgalo caliente a fuego lento.", "Para la raíz de apio, ponga a hervir 200 ml / 7 fl oz de agua en una sartén. Agregue la mantequilla y una pizca de sal, luego agregue la raíz de apio y reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 20-25 minutos, o hasta que la mayor parte del agua se haya evaporado. Hilvane la raíz de apio con los jugos mantecosos que quedan en la sartén, luego espolvoree sobre las hojas de tomillo y déjelas a un lado. Mantener caliente", "Para el puré de champiñones, espolvorea los champiñones restantes con sal marina y déjalo a un lado durante 5 minutos.", "Para la salsa de merluza y mantequilla, espolvorea la harina en un plato. Polvo de la merluza en harina para cubrir por completo.", "Calentar el aceite en una sartén a fuego medio. Agregue el pescado y fría por 5-6 minutos, o hasta que esté crujiente y dorado en un lado. Voltee el pescado, agregue la mantequilla y cocine durante 4-5 minutos, o hasta que la merluza esté crujiente y dorada por ambos lados y la mantequilla se haya puesto marrón.", "Agregue el vinagre y el tomillo de malta a la sartén, luego hilvane el pescado en la mezcla de mantequilla y vinagre. Retire el pescado de la sartén.", "Agregue el azúcar a la sartén, revolviéndolo en la mezcla de mantequilla y vinagre hasta que se disuelva. Agregue las hojas de apio picadas.", "Para servir, ponga una cucharada del puré de hongos en el centro de cada plato. Coloque una pieza de raíz de apio encima con la merluza al lado. Adorne con los champiñones salados y algunas hojas de apio en rodajas, luego rocíe la salsa de mantequilla alrededor del borde de los platos. Termine con las avellanas tostadas."], "url": "www_bbc_co_uk_food_recipes_pan-fried_hake_with_95796", "title": "Merluza con champiñones y vinagre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_hake_with_95796_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas, cortadas en cubos de 2 cm / 1 in", "180 ml / 6 fl oz blanco miso", "160 g / 5½ oz de azúcar en polvo", "50g / 1¾oz de miel clara", "4 cucharadas de aceite de cacahuete", "4 x 150g-200g / 5½-7oz filetes de fletán, piel encerada, espinas", "75g / 2½oz de mantequilla sin sal", "100g / 3½oz de frijoles edamame", "4 cucharadas de semillas de sésamo blanco", "4 cucharadas de semillas de sésamo negro", "4 cucharadas de hilos de Cayena coreanos", "2 cucharadas de micro berros mezclados"], "method": ["Para los frijoles berenjena y edamame, llene a medias una sartén grande o una freidora con aceite. Caliente el aceite a 180 ° C o hasta que un cubo de pan de 2 cm / 1 pulg. Caído en el aceite se torne dorado y crujiente en 1 minuto. (PRECAUCIÓN: no deje el aceite caliente desatendido).", "Fríe la berenjena en cubitos por 2-3 minutos o hasta que estén dorados y crujientes. Déjelo a un lado para drenar en el rollo de cocina.", "En una sartén, caliente el miso blanco, el azúcar, la miel y 100 ml de agua. Cocine hasta que se haya reducido en volumen y se haya dorado.", "Para el halibut, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el pescado con la piel hacia abajo y cocine por 2-3 minutos, déle la vuelta y cocine por otros 2-3 minutos.", "Justo antes de servir, agregue la mantequilla e hilvane el pescado. Permita que el pescado descanse antes de servir.", "Para servir, coloque la berenjena en cubos en un plato de servir y cuchara sobre la salsa. Coloque el pescado en el centro y adorne con los frijoles edamame, semillas de sésamo, hilos de cayena y micro berros."], "url": "www_bbc_co_uk_food_recipes_pan-fried_halibut_with_97859", "title": "Halibut con frijoles de berenjena y edamame fritos, miso-glazed", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 tomates maduros, picados", "¼ de pepino, pelado y picado", "1 pimiento rojo, semillas retiradas y picadas", "50-100ml / 2-3½fl oz de vinagre de jerez, al gusto", "4 cucharadas de aceite de oliva virgen extra", "8 rebanadas de baguette blanco, cortado en diagonal 1 cm / ½ pulgada de espesor", "2 tomates, pelados y en rodajas", "1 cebolla roja, finamente rebanada", "2 pimientos de Charleston (o pimientos frescos y calientes) en rodajas", "¼ de manojo de perejil, finamente picado", "2 cucharadas de pasta de aceitunas negras (disponible en los supermercados turcos y en línea)", "2 cucharadas de melaza de granada", "1 cucharada de semillas de hinojo molido", "1 cucharada de semillas de comino", "1 cucharadita de aceite de girasol", "4 filetes de caballa, deshuesados", "2 cucharadas de pul biber (hojuelas de chile turco)", "sal marina y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "pul biber (copos de chile turco), al gusto", "100g / 3½ oz de rábanos con hojas, en rodajas finas", "chiles en escabeche, toscamente picados", "semillas de nigella"], "method": ["Para hacer el gazpacho, mezcle todos los ingredientes en un procesador de alimentos hasta que quede suave.", "Para la ensalada, precaliente el horno a 200C / 180C Fan / Gas 6.", "Rocíe un poco de aceite de oliva y sal marina en el pan y hornee en una bandeja durante 10 minutos o hasta que estén un poco dorados y crujientes.", "Combine los tomates, la cebolla roja, los pimientos, el perejil, el aceite de oliva virgen extra y la melaza de granada con un poco de sal y pimienta.", "Calentar una sartén pequeña y agregar el hinojo y las semillas de comino y cocinar hasta el comienzo para liberar sus aceites. Coloque en un mortero y mortero y muela.", "Caliente el aceite de girasol en una sartén grande a fuego medio a alto. Sazonar el lado de la carne de la caballa con sal, el hinojo molido, el comino y el biber de pul. Presione el aderezo. Cocine el pescado con la piel hacia abajo en la sartén durante 2 minutos o hasta que la piel esté dorada y crujiente. Dé vuelta y cocine durante 1 minuto o hasta que el pescado esté listo.", "Para la mantequilla de chile chili, caliente la mantequilla en una sartén hasta que haga espuma, luego agregue las hojuelas de chile y cocine hasta que la mantequilla se dore. Mantener caliente", "Justo antes de servir, sumerja un poco de pan en el gazpacho. Coloque dos rebanadas de pan en el plato de servir, luego amontone las verduras, sirva los ingredientes y los pescados encima, vierta sobre la manteca de chile y sirva."], "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_black_81238", "title": "Caballa frita, aceituna negra con tomate y ensalada de granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 rebanadas finas de panceta", "Lomo de venado 4 x 175 g / 6 oz, totalmente recortado, guarniciones reservadas", "1 cucharada de aceite de oliva", "1 ramita de tomillo", "1 diente de ajo, aplastado", "1 cucharada de aceite de oliva", "cubiertos de venado (desde arriba)", "1 cebolla picada", "2 zanahorias, cortadas peladas por la mitad a lo largo y picadas", "1 baya de enebro", "½ palito de apio, picado", "1 ramita de tomillo", "1 litro / 1¾pinturas de vino tinto", "2 litros / 3½ pintas de caldo de pollo", "50g / 2oz 6 por ciento de chocolate negro, aproximadamente picado", "sal y pimienta negra recién molida", "200g / 7oz de calabaza, cortada en pequeños rectángulos de 3-4 mm de grosor", "75ml / 3fl oz de aceite de oliva", "1 ramita de tomillo", "1 diente de ajo, piel sobre, aplastado", "30g / 1 oz chalotes, finamente en cubitos", "2 raíces salsifí, lavadas, cortadas en trozos de igual tamaño", "Leche entera 500ml / 18floz", "25g / 1oz de mantequilla", "4 cucharadas de perejil de hojaldre, hojas recogidas y picadas", "1 diente de ajo", "50g / 2oz de setas silvestres", "4 coles de Bruselas, base removida, hojas exteriores y hojas muy centrales descartadas, y hojas restantes separadas"], "method": ["Para la carne de venado, precaliente el horno a 150 ° C / 300 ° F / Gas 2. Coloque las rebanadas de panceta sobre una superficie de trabajo limpia. Ruede la carne de venado sobre la panceta, y envuélvela bien.", "Calienta una sartén grande a prueba de horno y freír la carne de venado hasta dorar por completo.", "Coloque en el horno y cocine de 12 a 14 minutos, o hasta que esté cocido a su gusto.", "Retire del horno y deje reposar, cubierto en un lugar cálido, durante cinco minutos.", "Para el jus de venado, caliente una sartén de lados altos hasta que esté caliente, agregue el aceite de oliva y las guarniciones de carne de venado y cocine por un par de minutos hasta que se dore.", "Agregue la cebolla, la zanahoria, el enebro, el apio y el tomillo.", "Cubra la carne con el vino tinto y deje que hierva, luego cocine hasta que el volumen de vino tinto se haya reducido por completo.", "Agregue una quinta parte del caldo de pollo y cocine hasta que quede muy poco líquido. Repita este proceso con el caldo de pollo cinco veces hasta que se haya agregado todo.", "Pase el jus a través de una tela de muselina en una sartén limpia.", "Batir en el chocolate negro y agregar sal y pimienta negra recién molida al gusto. Mantener caliente", "Para las verduras, coloque la calabaza en una sartén con una cucharada de aceite de oliva, más el tomillo y el ajo. Cocine por cinco minutos, o hasta que esté tierno.", "Cocine el salsifí: póngalo en una cacerola con la leche y chalote hasta que esté suave, pero aún retenga un poco la mordida. Retire de la sartén y seque con papel de cocina.", "Calentar la mitad de la mantequilla y una pizca de aceite de oliva en una sartén y freír el salsifí hasta que se dore. Agregue el perejil picado y el ajo.", "Calentar otra sartén, agregar la mantequilla restante y un chorrito de aceite de oliva y freír los champiñones durante 1-2 minutos.", "Pon a hervir una olla pequeña de agua con sal, agrega las hojas de brote de Bruselas y cocina durante un minuto. Prepare un recipiente con agua helada. Escurrir las hojas de brotes y refrescar en el agua helada. Drene nuevamente y seque con papel de cocina o una toalla de té limpia.", "Mezcle las hojas del brote con el aceite de oliva restante, y sal y pimienta negra recién molida al gusto.", "Para servir, corte el venado en rodajas gruesas y colóquelo en cada una de las cuatro placas. Esparce un poco de salsifí y calabacita alrededor y encima. Rocíe con la salsa y adornar con las hojas de brotes vestidos."], "url": "www_bbc_co_uk_food_recipes_pan-fried_loin_of_55675", "title": "Lomo frito de venado con calabaza, salsifí asado, salsa de venado con chocolate negro y ensalada de coles de Bruselas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 caballa, fileteada", "1 cucharada de aceite de oliva", "2 cucharadas de vinagre de vino de arroz", "1 cucharadita de azúcar en polvo", "pizca de sal", "2 chalotes de plátano, finamente cortados en anillos", "3 cucharadas de hojas de apio", "2 cucharadas de ramitas de perifollo (o perejil)", "50g / 1¾oz de ramitas de berros de bebé", "4 cucharadas de croutons", "500 g / 1 libra de remolacha cocida 2 oz, en rodajas finas", "1 cucharada de mostaza francesa", "1 cucharada de jugo de limón", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y los filetes de caballa con la piel hacia abajo y cocínelos durante dos minutos hasta que la carne cambie de color hasta la mitad del pescado.", "Voltee los filetes y cocine durante un minuto más, luego retírelos del fuego y déjelos reposar durante unos minutos.", "Caliente el vinagre de vino de arroz y el azúcar en una cacerola y luego agregue los anillos de chalota y la sal. Dejar macerar por unos minutos.", "Mientras tanto, mezcle las hojas de apio, perifollo (o perejil), berros y crutones juntos.", "Aparte dos tercios de la remolacha.", "Coloque la remolacha restante en un procesador de alimentos y mezcle para hacer un puré fino y luego páselo por un colador en un recipiente.", "Agregue la mostaza y el jugo de limón, mezcle el aceite de oliva y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque la remolacha reservada en los platos y cubra con los chalotes encurtidos.", "Mezcle la ensalada con un poco del aderezo y luego colóquela encima de las rodajas de remolacha.", "Agregue los filetes de caballa y luego rocíe sobre más aderezo."], "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_68364", "title": "Caballa frita con remolacha y ensalada de apio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]