[{"isVegetarian": false, "title": "Chicken tagine with preserved lemon and green olives", "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_27957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 large onions, roughly chopped", "3 garlic cloves, finely chopped", "1 tsp ground ginger", "½ tsp ground white pepper", "¼ tsp ground cinnamon", "¼ tsp cloves, roughly broken up", "generous pinch of saffron, soaked in a little water", "300ml/10fl oz chicken stock or water", "1 whole chicken, jointed into 8 pieces", "2 preserved lemons, cut into strips", "20 green olives", "2 tbsp fresh parsley, finely chopped", "2 tbsp fresh coriander, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large tagine, casserole or a deep frying pan. Add the onions and gently over a medium heat until softened and lightly golden-brown. ", "Add the garlic along with all the spices. Cook for a further minute, then push everything aside in the pan. Add the chicken pieces skin-side down and fry for a few minutes on each side. Season with salt and then pour over the stock or water.", "Bring to the boil then reduce the heat. Cover and simmer for around 45 minutes, or until the chicken is nearly falling off the bone. Turn the chicken regularly to prevent it sticking.", "Add half the preserved lemons and the olives and simmer uncovered for 5 minutes. Stir in the parsley and coriander just before serving. Garnish with the remaining preserved lemon and serve immediately."]}, {"isVegetarian": false, "title": "Chicken leg tagine with prunes, apricots and roasted almonds", "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_65235", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_tagine_with_65235_16x9.jpg", "ingredients": ["2 medium onions, finely chopped", "3-4 garlic cloves, finely chopped", "few sprigs fresh coriander, finely chopped", "½ bunch fresh flatleaf parsley, finely chopped", "4 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper", "2 tsp ground ginger", "5 tsp cinnamon", "½ tsp ground turmeric", "10 chicken legs, skinned, rinsed under cold running water and patted dry", "pinch saffron", "1 chicken stock cube", "150g/5½oz dried prunes", "6 tbsp sugar", "150g/5½oz dried apricots", "100g/3½oz almonds, blanched, skinned and toasted"], "serves": "Serves 5", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["In a large bowl, mix half of the onion, half of the garlic, half of the coriander and half of the parsley. Add 2 tablespoons of the olive oil, the lemon juice, 1 teaspoon of the ginger, 1 teaspoon of cinnamon and the turmeric and season well with salt and freshly ground black pepper. Rub the chicken legs with the mixture to coat.", "Cover the bowl with cling film and leave to marinade for 2–3 hours, or, for best results, overnight in the fridge. ", "Preheat the oven to 180C/160C Fan/Gas 4.", "Heat 1 tablespoon of olive oil in a frying pan. Fry the chicken on both sides until slightly brown and set aside. ", "Put the remaining olive oil, onion, garlic and 1 teaspoon of ginger into a tagine or into an ovenproof pot with a lid. Stir the mixture and place the chicken on top. ", "Heat the saffron in a dry pan and sprinkle it over the chicken. Sprinkle some freshly ground black pepper and 2 teaspoon cinnamon over the chicken and add a splash of water. Crumble the stock cube into the water and sprinkle with the remaining fresh parsley and coriander.", "Bake in the oven with the lid on for about 1 hour, or until tender.", "In a saucepan, cover the dried prunes with water and bring to the boil. Add half of the sugar and 1 teaspoon of cinnamon. Turn down the heat and let the prunes simmer until caramelised. ", "In another saucepan, cover the apricots with water and bring to the boil. Add the rest of the sugar and the rest of the cinnamon. Turn down the heat and let the apricots simmer until caramelised. ", "Check the tagine regularly, making sure that the sauce doesn’t dry. ", "To serve, garnish the tagine with the caramelised prunes and apricots and the toasted almonds."]}, {"isVegetarian": false, "title": "Chicken tagine with pomegranate tabbouleh", "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_76052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "6 large chicken thighs", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "5cm/2in piece fresh root ginger, grated", "½ tsp saffron", "1 tsp ground turmeric", "1 tsp ground coriander", "1 tbsp ras-el-hanout", "½ cinnamon stick", "500ml/18fl oz chicken stock", "1 red chilli, finely sliced", "2 tomatoes, roughly chopped", "2 tbsp clear honey", "2 tbsp roughly chopped mint leaves", "2 tbsp roughly chopped coriander", "25g/1oz butter ", "salt and pepper", "150g/5½oz bulgur wheat, soaked in cold water overnight", "3 tbsp roughly chopped mint ", "3 tbsp roughly chopped coriander", "½ red onion, finely chopped", "50g/1¾oz pistachio nuts, roughly chopped", "100g/3½oz whole skinned almonds", "100g/3½oz dried apricots, roughly chopped", "1 pomegranate, seeds only", "2 lemons, juice only"], "serves": "Serves 3-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken tagine, heat a large heavy-bottomed saucepan until hot. Add a little olive oil and the chicken thighs, skin-side down, and fry until golden-brown, then flip over and brown on the other side before transferring to a plate.", "Add the onion, garlic and ginger to the pan and gently fry for 2-3 minutes.", "Add all the spices and cook for a minute, then return the chicken to the pan and stir well to coat.", "Add the stock, chilli, tomatoes and honey and bring to the boil.", "Reduce the heat to a simmer, cover and cook for 20 minutes, or until the chicken is cooked through.", "Add the mint and coriander, then stir in the butter. Season, to taste, with salt and pepper.", "For the pomegranate tabbouleh, drain the bulgur wheat well, pressing down lightly to ensure all the water is removed, then place into a large bowl.", "Add all the other ingredients and mix well, then check the seasoning, adding salt and pepper to taste.", "To serve, pile the tabbouleh onto plates and spoon a chicken thigh and some sauce alongside."]}, {"isVegetarian": false, "title": "Chicken terrine with herbs", "url": "www_bbc_co_uk_food_recipes_chicken_terrine_with_86075", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.4kg/3lb chicken, flesh removed and chopped, skin and bones discarded", "110g/4oz unsmoked ham, chopped", "300g/11oz pork shoulder, chopped", "300g/11oz veal rump, chopped", "300ml/11fl oz double cream, very cold", "1 free-range egg", "75ml/3fl oz Armagnac or Cognac (optional)", "2 tbsp fresh thyme leaves", "200ml/7fl oz dry white wine", "3 tsp salt", "freshly ground black pepper", "100g/4oz butter", "2 shallots, finely chopped", "4 tbsp chopped fresh parsley", "4 tbsp chopped fresh chives", "2 tbsp chopped fresh tarragon", "1 x 250g/9oz chicken breast, sliced into 1cm/½in strips", "250g/9oz pork back fat (available from your butcher), finely sliced", "1 loaf crusty bread, sliced, toasted"], "serves": "Serves 14-16", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Mince the chicken, ham, pork and veal twice in a mincer using a medium-sized mincer blade disc. Alternatively, chop the meat into tiny pieces with a sharp knife.", "Put the minced meat into a well-chilled bowl, set on a larger bowl of ice and stir with a wooden spoon until well combined.", "Stir in the cream, egg, Armagnac or Cognac (if using), thyme and white wine until well combined.  ", "Add the salt and season to taste with freshly ground black pepper. This is called the farce.", "Heat 40g/1½oz of the butter in a small saucepan and fry the shallots for 2-3 minutes, then set aside to cool. Stir in the herbs.  ", "Melt the remaining butter in a small saucepan and remove from the heat.", "Dip the chicken breast strips in the melted butter, then dip in the shallot and herb mixture until well coated. Set aside on a plate.", "Line the terrines with strips of pork fat.  ", "Spread half of the farce in the bottom of the terrines, then add a layer of chicken breast strips, top with the remaining farce, then more slices of pork fat.  ", "Cover with the lid and chill in the fridge for 2 hours.", "Preheat the oven to 180C/350F/Gas 4.", "Place the terrines into a large baking tray and half-fill the baking tray with boiling water.", "Cook the terrines for 30 minutes uncovered, then cover with the lids and cook for a further 15 minutes.", "Remove the terrines from the oven, remove the lids and place a weighted board (maximum weight 250g/9oz) onto the terrines to compress them gently until they have completely cooled.  Leave to chill in the fridge.", "Serve with toasted crusty bread."]}, {"isVegetarian": false, "title": "Chicken thighs with pea custard and pea salad", "url": "www_bbc_co_uk_food_recipes_chicken_thighs_with_pea_92612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["splash of vegetable oil", "8 chicken thighs, boned, skin- on", "salt", "3 large free-range egg yolks", "15g/½oz caster sugar", "½ vanilla pod, split in half lengthways and seeds scraped out\t", "625g/1lb 6oz frozen peas, defrosted", "25ml/1fl oz double cream", "100g/3½fl oz fresh raw peas", "1 shallot, finely chopped", "½ bunch marjoram, leaves picked", "pinch curry powder", "pinch ground ginger", "splash of olive oil", "8–12 pea shoots, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat an ovenproof frying pan until hot, add a little vegetable oil and fry the chicken, skin-side down, until the skin is golden-brown. Transfer the pan to the oven and cook for a further 15 minutes, or until cooked through. Remove from the oven, season to taste with salt and leave to rest in a warm place.", "In a bowl, whisk together the egg yolks, sugar and the vanilla seeds.", "Blanch 375g/13oz of the frozen peas in a pan of salted boiling water, then drain and transfer to a blender. Pulse to a purée.", "Warm the cream and puréed peas in a saucepan, then pour over the egg yolk mixture. Return the contents to the saucepan and whisk the mixture over a medium heat until it thick enough to coat the back of a spoon.", "Pour into a bowl, cover the surface of the custard with cling film to prevent a skin forming and refrigerate.", "Put the remaining frozen peas in a blender and pulse a couple of times to form a rough paste. Add the fresh peas, shallot and marjoram. Season with curry powder, ginger and salt, then add a little olive oil, to taste, and mix together. ", "To serve, dress each serving plate with a few spoonfuls of the pea custard, two chicken thighs and the pea salad. Garnish with two or three pea shoots."]}, {"isVegetarian": false, "title": "Chicken tikka and naan bread", "url": "www_bbc_co_uk_food_recipes_chicken_tikka_and_naan_30521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12 oz boneless chicken legs or breasts ", "150g/5½oz yoghurt", "50g/1¾oz unsalted butter", "80g/2¾oz chopped fresh ginger", "½ tsp ground cumin", "½ tsp ground coriander", "½ tsp red chilli powder, plus extra if required", "¼ tsp turmeric", "2 limes, juice only", "2 tbsp tomato purée", "½ tsp garam masala powder", "50ml/2fl oz oil", "salt and white pepper, to taste", "1 green chilli, deseeded and finely chopped", "200g/7oz camembert ", "2 tbsp fresh coriander stalks, chopped", "1 tsp ground coriander", "100g/3½oz plain Greek style or live yogurt, at room temperature", "160ml/5½fl oz milk, at room temperature", "1-2 tsp salt", "1-2 tsp sugar", "500g/1lb 2oz white flour (preferably stone-ground organic), sifted", "1 heaped tsp baking powder", "3 tbsp extra-virgin rapeseed oil, plus extra for kneading", "1 heaped tbsp butter", "nigella seeds and poppy seeds, to scatter (optional)", "2 tbsp fresh coriander, chopped", "1 onion, finely sliced", "2 tbsp fresh coriander, chopped", "2 tbsp fresh mint leaves, chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Cut the chicken into cubes large enough to be skewered (about 4cm/1½in cubes). Rub salt and pepper into the chicken and set aside. ", "In a blender, add half the yoghurt and all the other ingredients. Blend to a smooth paste. Transfer to a large bowl and whisk in the remaining yoghurt. Taste to check for spiciness and add more chilli if preferred.", "Mix the chicken in the yoghurt mixture. If possible leave the chicken to marinate in the fridge overnight, or at least 4-5 hours.", "To cook the chicken, either preheat a grill to medium-high or prepare a barbecue. (If there is no other option you can use an oven set to its highest temperature.) Thread the chicken pieces onto metal skewers.", "Grill the chicken for 8-10 minutes, basting occasionally with the yoghurt marinade. To check the chicken is cooked through, take one of the largest pieces and cut in half. If there is no sign of pink and the juices run clear the chicken is cooked.", "For the naan filling, put all the ingredients in a blender and pulse to form a thick, smooth paste.", "For the naan bread, combine the yoghurt, milk, salt and sugar with 200ml/7fl oz water.", "Sift the flour and baking powder into a large mixing bowl and make a well in the centre. Pour in the liquid and 2 tablespoons of the rapeseed oil. Mix to form a soft dough. ", "Knead for 5-6 minutes, or until the dough stops looking ragged and becomes smooth. Cover the bowl with a damp tea towel and set aside to prove for 30-40 minutes. Remove the dough and knead for another minute or two, then return to the bowl. Cover and leave in a warm place for 1-2 hours.", "Lightly oil a work surface and divide the dough into 4-6 balls. Using your fingers or an oiled rolling pin, flatten each ball into a round shape about 1cm/½in thick. Place 2 tablespoons of the filling mixture in the centre of each naan and fold in half, pressing the edges to enclose the filling. Keep the remaining balls of dough under the damp tea towel as you work.", "Heat a large, dry frying pan with a tightly-fitting lid over a medium heat. Transfer one circle of dough to the pan and cover securely with the lid. Cook the naan for 3-4 minutes. When it is golden-brown, mottled and puffed up, flip it over and cook the other side for 3-4 minutes. Repeat with the remaining dough.", "While the naan breads are cooking melt the butter and mix with the remaining rapeseed oil. As soon as the naans are cooked, spread them generously with the melted butter mixture and scatter with sea salt, nigella seeds and poppy seeds. Set aside for a few minutes. ", "Alternatively, preheat your oven to 250C/230C Fan/Gas 9. Place an uncooked naan on a large baking tray and bake on the top shelf one at a time. Turn when you see the bread rise and puffed. Once browned on both sides, apply the butter mixture as above. ", "For the salad, combine all the ingredients in a bowl.", "To serve, scatter the naans with chopped coriander and serve with the chicken tikka and salad."]}, {"isVegetarian": false, "title": "Chicken tikka masala", "url": "www_bbc_co_uk_food_recipes_chicken_tikka_masala_11482", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_tikka_masala_11482_16x9.jpg", "ingredients": ["1 large skinless chicken crown (1kg/2lb 4oz) ", "½ lemon, juice only", "5cm/2in piece fresh root ginger, finely grated ", "4 large garlic cloves, grated ", "2 tbsp medium Madras curry powder ", "2 heaped tsp smoked paprika ", "large pinch salt ", "100g/3½oz 0% fat Greek-style yoghurt  ", "1 tbsp sunflower oil ", "2 large onions, finely chopped ", "2 large garlic cloves, grated ", "2.5cm/1in piece fresh root ginger, finely grated ", "1 tsp ground turmeric", "2 tsp ground paprika ", "2 tsp ground coriander ", "1 tbsp tomato purée ", "400g tin chopped tomatoes ", "1 large red pepper, cored, seeds removed, finely chopped ", "1 large green pepper, cored, seeds removed, finely chopped ", "150g/5½oz 0% fat plain yoghurt ", "2 tbsp finely chopped coriander", "sea salt and freshly ground black pepper ", "1 small red onion, finely chopped ", "2 large tomatoes, finely chopped", "⅓ cucumber (150g/5½oz), finely chopped", "½ lime, juice only ", "1 tsp chaat masala ", "coriander leaves, roughly torn ", "320g/11½oz basmati rice, cooked with salt and a pinch of saffron strands (optional)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the chicken in a large bowl or other non-reactive dish and slash the chicken breasts. ", "For the marinade, mix all the ingredients together in a small bowl. Spread the marinade all over the crown. Cover with cling film and place in the fridge to marinate overnight, or at least 4 hours. ", "When you’re ready to cook the chicken, preheat the oven 140C/120C Fan/Gas 1. Place the marinated chicken in a roasting dish and spoon over any remaining marinade. Bake for 2 hours. (It won’t be cooked right through at this stage.) ", "Meanwhile, make the curry sauce. Heat the oil in a large frying pan. Toss in the onions and cook for 10 minutes, or until they are golden-brown, adding a splash of water to the pan if they begin to stick. Add the garlic and ginger with a splash of water, stir well and cook for 1 minute. Add the spices with some salt and pepper and cook for another minute. ", "Stir in the tomato purée and cook for a further minute, then tip in the tinned tomatoes and pour in 300ml/10fl oz of water. Bring to the boil, reduce the heat to a gentle simmer and cook for 5–10 minutes. Add the chopped peppers and cook for a further 5 minutes, then remove from the heat.", "Take the chicken out of the oven. Carefully wave a cook’s blowtorch over the surface until the marinade has slightly blackened in places. Set aside for 10 minutes.", "For the katchumber salad, mix everything together in a bowl and set aside. ", "Take the chicken breasts off the bone and cut the meat into chunks, about 2.5cm/1in. Reheat the curry sauce, then add the chicken and simmer for 5 minutes, or until the pieces are cooked through. ", "Stir through the yoghurt and chopped coriander. Taste to check the seasoning. ", "Serve scattered with coriander, with saffron rice, if using, and the katchumber salad alongside."]}, {"isVegetarian": false, "title": "Chicken tikka masala with red onion salad", "url": "www_bbc_co_uk_food_recipes_chicken_tikka_masala_35350", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp garam masala", "1 tbsp paprika", "vegetable oil, for frying", "4 chicken breasts, skinned, boned and cut into bite-sized chunks", "200g/7oz basmati rice", "1 tsp ground turmeric, curry powder or pinch of saffron strands (optional)", "1 bunch spring onions, trimmed and thinly sliced", "2cm/¾in piece fresh root ginger, peeled and grated", "2 garlic cloves, finely chopped", "340ml/11fl oz single cream or yoghurt (optional)", "200g/7oz tomato paste or purée", "2 tsp English mustard powder", "fresh coriander or parsley leaves, to garnish", "salt and freshly ground black pepper", "4 plum tomatoes, sliced", "1 red onion, sliced", "2 tbsp chopped fresh coriander", "pinch sugar", "pinch salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan over a medium to high heat. Add the garam masala and paprika. Toast for a couple of minutes then tip the spices onto a plate and set aside.", "Drizzle some oil into the frying pan. Add the chicken and fry, tossing from time to time, until golden-brown all over, this should take about 5 minutes.", "Meanwhile, put the kettle on. Put the rice in a medium-sized, lidded saucepan and add the turmeric. Pour over enough boiled water to come about 2cm/¾in above the rice. Cover with the lid and bring to the boil. Reduce the heat to low and cook according to the packet instructions.", "Give the chicken a little toss, add the spring onions, ginger and garlic, cream, tomato paste, mustard powder and the toasted spices. Stir the sauce and leave it to bubble away on a low to medium heat until the chicken is cooked through, this should take about 15–20 minutes.", "Check the rice is tender and has absorbed all the water. Fluff it up with a fork, and season with salt and pepper. Cover with the lid and keep warm. ", "When the chicken is cooked, taste the sauce, adding more heat (with paprika) or seasoning. If the sauce is too thick, add a little water; if it is too thin, let it bubble away a little longer to thicken.", "Just before serving, make the salad. Put all the ingredients in a large bowl and mix. ", "Divide the rice among four plates and top with the curry. Scatter over some coriander leaves and serve with the salad alongside. "]}, {"isVegetarian": false, "title": "Chicken tikka salad", "url": "www_bbc_co_uk_food_recipes_chicken_tikka_salad_70502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz ready-prepared, cooked chicken tikka, sliced", "50g/1¾oz tinned brown or green lentils, drained and rinsed", "50g/1¾oz cucumber, thinly sliced", "2 spring onions, thinly sliced", "handful fresh coriander, roughly chopped (optional)", "1 tbsp ready-made tzatziki "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the chicken, lentils, cucumber, spring onions and coriander, if using, on a plate. Serve with the tzatziki."]}, {"isVegetarian": false, "title": "Chicken velouté soup with cheese croquette and truffle", "url": "www_bbc_co_uk_food_recipes_chicken_velout_soup_with_87349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 chicken wings", "125ml/4fl oz dry white wine", "1 thyme sprig", "6 button mushrooms", "1 litre/1¾ pints white chicken stock", "4 tbsp crème fraîche", "200ml/7fl oz double cream", "250g/9oz cooked floury potatoes ", "2 free-range eggs", "1 tbsp butter", "100g/3½oz camembert, cut into cubes", "2 tbsp plain flour", "8 tbsp dried breadcrumbs", "salt and freshly ground black pepper", "few shavings of truffle, to serve"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the chicken wings in a pan with the wine, thyme, mushrooms and stock. Bring to the boil and simmer for 30 minutes.", "Strain the stock into another pan. Trim off any excess skin from the wings and place the wings on a baking tray. Cover with cling film and then place another tray on top of that. Place weights on top and press and chill in the fridge until needed. ", "Pass the stock through a fine sieve into a clean saucepan. Place over a medium heat and cook until the volume of liquid has reduced by half. Stir in the  crème fraîche, double cream and season with salt and pepper. Blend with a hand blender until foam appears. Keep warm until ready to serve.", "Preheat a griddle pan to hot. Remove the bones from the wings, then griddle until crisp all over.", "To make the croquettes, pass the potato through a potato ricer. Add one egg, the butter and the camembert. Mix well.", "Beat the remaining egg in a shallow bowl. ", "Roll the potato mixture into cylinders, then roll in the flour, then the beaten egg and then the breadcrumbs.", "Preheat a deep-fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the croquettes until golden-brown. ", "Divide the velouté between two deep bowls, shave over a little truffle and serve with the griddled chicken and the croquettes. "]}, {"isVegetarian": false, "title": "Chicken, walnut and pomegranate stew with Persian basmati rice", "url": "www_bbc_co_uk_food_recipes_chicken_walnut_and_84591", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil ", "2 large onions, diced", "8 chicken thighs, bone in and skin removed", "1 tbsp plain flour", "600g/1lb 5oz de-shelled walnuts, finely ground in a food processor", "3 tbsp caster sugar", "450ml/16fl oz pomegranate molasses", "1 pomegranate, seeds only, to garnish ", "sea salt and freshly ground black pepper", "500g/1lb 2oz basmati rice ", "drizzle of light olive oil ", "60g/2¼oz butter", "flaked sea salt "], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a medium heat. Pour in the vegetable oil and fry the onions until translucent and lightly browned. ", "Season the chicken on both sides with salt and freshly ground black pepper and add to the pan. Increase the temperature and stir well to ensure you seal the thighs on both sides. Once they are gently browned, turn off the heat and set aside. ", "Heat another large saucepan over a medium high heat and toast the flour until it turns pale beige. Add the ground walnuts and cook the mixture through. ", "Add 1.2 litres/2 pints of water to the pan, stir well and bring the mixture to a slow boil, then cover with a lid and cook for an hour over a low-medium heat. This will cook the walnuts and soften their texture; once you see the natural oils of the walnuts rise to the surface, the mixture is cooked.", "Add the sugar and pomegranate molasses and stir well for about a minute. Take care to stir the pomegranate molasses well as it will take a while to dissolve. ", "Add the chicken and onions to the walnut and pomegranate mixture, cover and cook for about 2 hours, stirring thoroughly every 30 minutes to ensure the walnuts do not stick to the base of the pan.", "For the rice, bring a large saucepan of water to the boil. Add the rice and a generous pinch of salt. Boil for 6-8 minutes until the rice is par boiled. (The rice is par boiled when the rice is a brilliant white colour and the grains have begun to soften.) Drain the rice and rinse under cold running water for a couple of minutes. ", "Line the bottom of the saucepan used to cooked the rice with non-stick baking paper. Return to the hob and pour in the oil, butter and a tablespoon of crushed sea salt. Scatter the rice in the saucepan. Do not overcrowd the rice, you want the lightness of the falling rice to allow the steam to rise up. ", "Wrap the pan lid in a tea towel (to lock in the steam and make for a secure, tight seal). Make sure the tea towel is kept away from the flames. ", "Cook the rice on a low heat for 45 minutes-1 hour. The grains should be puffed up when cooked. Flip the rice onto a serving plate, then scrape out the crispy tahdig (rice at the bottom of the pot) and place on top. ", "Serve the chicken alongside the rice topped with pomegranate seeds. "]}, {"isVegetarian": false, "title": "Chicken with forty cloves of garlic", "url": "www_bbc_co_uk_food_recipes_chicken_with_40_cloves_22211", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_40_cloves_22211_16x9.jpg", "ingredients": ["250g/9oz shallots (small ones not banana shallots)", "1.35kg/3lb oven-ready fresh chicken ", "½ lemon, halved ", "1 large bay leaf ", "1 tbsp finely chopped fresh thyme", "25g/1oz butter ", "1 tbsp sunflower oil ", "40 garlic cloves (from 2-3 bulbs), unpeeled ", "150ml/5fl oz vermouth ", "250ml/9fl oz chicken stock (made with 1 stock cube)", "2 tbsp chopped fresh tarragon leaves", "100ml/3½fl oz double cream or crème fraîche", "flaked sea salt and freshly ground black pepper ", "1 baguette", "1kg/2lb 4oz medium floury potatoes, preferably Maris Piper or King Edward", "75g/2½oz butter", "100g/3½oz rindless smoked streaky bacon rashers, cut into 2cm/¾in pieces", "300g/10½oz fresh kale", "6 spring onions, trimmed and finely sliced", "200ml/7fl oz double cream", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Place the shallots in a heat-proof bowl, cover with just-boiled water and leave to stand for five minutes. This will make the skins easier to remove.", "Remove any string from the chicken and place the lemon and bay leaf inside the cavity. Generously season the chicken inside and out with plenty of flaked sea salt and freshly ground black pepper. Sprinkle with the chopped thyme over all sides. ", "Melt the butter with the oil in a large flameproof casserole. Brown the chicken over a medium-high heat for a couple of minutes on each side. ", "Drain the shallots and, once cool enough to handle, peel off the skin and trim, halving any larger ones. Add the whole garlic cloves and shallots to the casserole, nestling around the chicken.", "Pour over the vermouth and chicken stock. Cover the casserole with a tight-fitting lid and bring the liquid to a simmer on the hob, then transfer to the oven for 1¼ hours, or until the chicken is thoroughly cooked and the garlic is completely softened.", "Transfer the chicken, garlic and shallots to a warmed platter and cover with a piece of foil and a couple of dry tea towels. Holding the casserole with an oven-cloth, tilt the chicken liquor to one side. Skim off any fat that rises to the surface and discard.", "Return the casserole to the hob and stir in the tarragon and cream (or crème fraîche). Bring to a gentle simmer, stirring. Cook for three minutes. Season to taste and pour into a warmed jug. ", "For the colcannon, peel the potatoes and cut into evenly-sized chunks. Put in a large saucepan and cover with cold water. Bring to the boil and cook for about 15 minutes, or until very tender. Test with the tip of a knife.", "While the potatoes are cooking, trim the thick stems and cut out much of the tough central vein from each kale leaf. Thinly shred the leaves and wash in a colander under cold running water. Drain.", "Heat 25g/1oz of the butter in a large non-stick frying pan and fry the bacon and kale for four minutes, stirring regularly until the kale is tender. If it is still a little tough after four minutes, add a couple of tablespoons of cold water and continue cooking for a couple of minutes more. Add the spring onions and cook for one minute, stirring. ", "Drain the potatoes in a large colander and return to the saucepan. Leave to stand for a couple of minutes. Warm the cream and remaining butter in small pan. Mash the cooked potatoes with the cream and milk until smooth and season to taste. Use a set of electric beaters if you want your mash to be really fluffy and light.", "Tip the softened kale into the same pan and stir together until lightly combined. Transfer to a warmed dish.", "Carve the chicken into chunky pieces and serve with the sauce and colcannon. Squeeze the garlic out of its skin and spread on the bread just like butter. "]}, {"isVegetarian": false, "title": "Chicken with asparagus and lemon crème fraîche sauce", "url": "www_bbc_co_uk_food_recipes_chicken_with_asparagus_44206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_asparagus_44206_16x9.jpg", "ingredients": ["50g/1¾oz butter", "2 tbsp oil", "6 small chicken breasts, boned, skinned", "6 banana shallots, quartered lengthways", "30g/1oz plain flour", "400ml/14fl oz chicken stock", "1½ tbsp chopped lemon thyme leaves", "12 asparagus spears, woody ends snapped off", "1 large lemon, juice only", "200ml/7fl oz full-fat crème fraîche", "2 tbsp chopped parsley", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Heat half the butter and half the oil in a large, deep, ovenproof frying pan. Season the chicken breasts with salt and pepper and fry, in batches if necessary, for 2 minutes on each side until golden-brown. Remove from the pan and set aside.", "Add the remaining butter and oil to the pan, tip in the shallots and fry over a high heat for 5–10 minutes or until lightly golden-brown.", "Put the flour in a bowl, whisk in 8 tablespoons of the stock and mix until smooth. Add to the pan and bring to the boil, then pour in the remaining stock. Add the lemon thyme and return the chicken to the pan.", "Cover with a lid and cook in the oven for about 20 minutes, or until the chicken is cooked through. ", "Just before serving, trim the tip from each asparagus spear and slice the stem into short, even lengths. Cook the tips and sliced stems in boiling salted water for 2-3 minutes. Drain, reserving the tips for a garnish.", "Stir the lemon juice, crème fraîche and parsley into the pan with the chicken. Add the sliced asparagus stems and bring to the boil. Remove the chicken, slice each breast into three and arrange on a plate. Spoon over the sauce and arrange two asparagus tips in a cross over the top."]}, {"isVegetarian": false, "title": "Chicken with creamy mushroom sauce and mashed potato", "url": "www_bbc_co_uk_food_recipes_chicken_with_a_creamy_29335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/2½fl oz rapeseed oil", "1 large chicken, jointed into eight pieces", "salt and freshly ground black pepper", "200g/7oz pancetta, diced", "200g/7oz shallots, peeled and cut in half", "1 bulb of garlic, cut in half", "500g/1lb 2oz wild mushrooms (chanterelles, girolles, ceps, button mushrooms morelles), cleaned", "50g/1¾oz unsalted butter", "50ml/2fl oz Madeira", "500ml/18fl oz dark chicken stock", "300ml/10½fl oz double cream", "1 bunch fresh tarragon", "1kg/2lb 4oz Maris piper potatoes, peeled and cut into chunks", "300ml/10½fl oz full-fat milk", "300ml/10½fl oz double cream", "150g/5½oz unsalted butter, plus extra for dressing the green beans", "150g/5½oz fine green beans, trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken with a creamy mushroom sauce, heat a large pan and add half of the oil. Season the chicken pieces with salt and pepper. Once the oil is hot, cook the chicken until golden-brown all over. Remove from the pan and set aside.", "Add the pancetta to the pan the chicken was cooked in, and fry until crisp, then add the shallots, garlic and mushrooms and cook for 2-3 minutes.", "Return the chicken to the pan and cook for two minutes.", "Add the butter, Madeira, stock, cream and tarragon and simmer for 15-20 minutes. Remove the head of garlic before serving.", "For the mashed potato, place the potatoes in a large pan of salted water and bring to the boil. Cook for 15-20 minutes, or until soft when tested with the point of a knife.", "Drain the potatoes and place back into the pan to let the steam off. Mash and add the milk, cream and butter and mix until smooth.", "Heat a pan of boiling water and blanch the beans, refresh in ice-cold water.", "Heat a small frying pan and add a few knobs of butter, once melted add the beans and cook for a couple of minutes until the beans are coated in butter and tender.\r\n", "To serve, place the mash into serving bowls with the chicken, sauce and green beans."]}, {"isVegetarian": false, "title": "Chicken with chorizo, peppers and sage with spiced aubergine", "url": "www_bbc_co_uk_food_recipes_chicken_with_chorizo_17191", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_chorizo_17191_16x9.jpg", "ingredients": ["1 large corn-fed chicken, jointed into 8 pieces", "salt and freshly ground black pepper", "3 tbsp olive oil", "110g/4oz chorizo, peeled and sliced", "3 red peppers, cut into 2.5cm/1in squares", "2 garlic cloves, crushed", "1-2 tbsp chopped fresh sage", "2 tsp chopped fresh thyme", "1 lemon, juiced, zested", "2 large aubergines, cut into 2.5cm/1in chunks", "125ml/4fl oz olive oil", "2 red onions, finely chopped", "4 plum tomatoes, seeded and diced", "2 tbsp red wine vinegar", "good pinch cumin", "handful basil leaves, torn", "handful coriander leaves, picked from stems", "1 tbsp pine nuts, lightly toasted in a pan", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas4.", "Season the chicken pieces with salt and freshly ground black pepper. Heat two tablespoons of the olive oil in a large frying pan and brown the chicken on both sides for 4-5 minutes. When all the chicken pieces are nice and golden-brown, remove them from the pan and set aside.", "Heat the remaining tablespoon of olive oil in the same frying pan and cook the chorizo for 2-3 minutes. Add the peppers, garlic, sage and thyme to the pan and cook for another 2-3 minutes. Tip the chorizo and peppers into a roasting tin and place the chicken pieces on top. ", "Spread the lemon zest and juice from half a lemon over the chicken. Bake in the oven for 30-40 minutes, turning the chicken pieces halfway through the cooking time, or until the chicken is cooked through.", "Meanwhile, for the spiced aubergine, put the aubergines in a colander, add about ½ teaspoon of salt and leave to drain for half an hour.", "Heat 35ml/1fl oz of the olive oil in a pan and fry the red onions for five minutes, or until softened. Add the tomatoes and cook for a further five minutes, or until the tomatoes have broken down into a thick sauce. Season with salt and freshly ground black pepper, then remove from the pan and set aside. ", "Add three tablespoons of the olive oil to the pan and fry half the aubergines for 4-5 minutes, or until tender. Remove the aubergine pieces and set aside to drain on kitchen paper. Add the remaining three tablespoons of oil to the pan and fry the remaining aubergine pieces for 4-5 minutes, or until tender.", "Return the aubergine and tomato and onion mixture to the pan and stir in the red wine vinegar, cumin, basil and coriander. Season to taste with salt and freshly ground black pepper and sprinkle over the pine nuts.", "To serve, spoon the aubergine onto a plate and place the chicken alongside."]}, {"isVegetarian": false, "title": "Chicken with butternut squash, cherry tomatoes and minty yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_chicken_with_butternut_57086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_butternut_57086_16x9.jpg", "ingredients": ["150g/5½oz butternut squash or sweet potato flesh, cut into cubes", "1 small skinless chicken breast (110g/3¾oz), roughly chopped ", "5 cherry tomatoes", "1 very small onion (50g/1¾oz peeled weight), roughly chopped", "1 tsp Cajun or fajita seasoning ", "2 tsp olive oil", "4 tbsp fat-free plain yoghurt", "1 tsp mint sauce "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Place the butternut squash, chicken, tomatoes and onion in a bowl. Add the Cajun seasoning and oil and mix well. ", "Transfer the mixture to an ovenproof dish. Bake for 20–30 minutes, or until the chicken and vegetables are cooked.", "To make the dressing, mix the yoghurt and mint sauce in a small bowl.", "Just before serving, drizzle the dressing over the chicken and vegetables."]}, {"isVegetarian": false, "title": "Chicken with harissa, lemon and anchovy butter", "url": "www_bbc_co_uk_food_recipes_chicken_with_harissa_29438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz unsalted butter, softened", "1 large lemon, zest and juice", "6 salted anchovy fillets in oil, finely chopped", "2 tsp harissa", "1 garlic clove, crushed", "½ tsp coriander seeds, lightly toasted in a dry frying pan", "2 chicken breasts, skin on", "salt and freshly ground black pepper", "olive oil", "1 bunch watercress", "50g/1¾oz salted Marcona almonds", "1 tbsp soft yellow raisins", "3 spring onions, finely sliced", "red wine vinegar, to taste"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the lemon and anchovy butter, place the butter in a bowl and add the lemon zest, anchovy fillets, garlic, coriander seeds and one teaspoon of the harissa. Mash them all together and add the lemon juice bit by bit. Check the seasoning.", "Take a double layer of aluminium foil. Place the butter in a long sausage shape at one end and roll it up. Then twist the ends of the foil in opposing directions to form a tight roll. Chill for four hours in the fridge to set.", "For the chicken, preheat the oven to 180C/350F/Gas 4.", "Season the chicken with salt and pepper and rub the remaining harissa over the skin. Heat a heavy oven-proof pan on the hob along with a splash of oil. Once hot, place the chicken in skin-side down and fry for several minutes until lightly coloured.", "Transfer to the oven and cook for 30 to 40 minutes, or until the chicken is cooked through. Remove from the oven and leave to rest for 5-10 minutes in the cooking pan, keeping it warm.", "To serve, tear the top leafy part of the watercress from the bunch and put in a salad bowl. Add the almonds, raisins and spring onions. Season with salt and pepper and drizzle over a little olive oil and red wine vinegar. Mix well and pile onto a serving plate. Cut the breasts in half and pile on top of the salad. Finally, melt a few thin slices of the lemon and anchovy butter and drizzle over the chicken."]}, {"isVegetarian": false, "title": "Chicken with garlic, rosemary and bruschetta", "url": "www_bbc_co_uk_food_recipes_chicken_with_garlic_36940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz chicken thighs and drumsticks", "salt and black pepper", "50g/1¾oz plain flour", "150ml/5fl oz extra virgin olive oil", "1 bulb of garlic, cloves separated and bruised", "1 large handful fresh rosemary sprigs", "150ml/5fl oz dry white wine", "1 ciabatta loaf, sliced ", "2 tbsp olive oil", "1 garlic clove, peeled and halved"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken pieces with salt and pepper and dust with plain flour. ", "Put the olive oil in a large, heavy-based frying pan and place on a medium-high heat. When hot, add the floured chicken and fry for 1-2 minutes on each side, or until golden-brown and quite crisp.", "Reduce the heat to medium-low, add the garlic and most of the rosemary (reserve a few leaves to garnish). Cover with a lid and cook for 30 minutes, turning the chicken from time to time.", "Raise the heat to high, remove the lid, add the wine and simmer until it has evaporated. ", "Check the chicken is cooked; the flesh should come away easily from the bone and there should be no sign of pink when you pierce the thickest part. Skim any oil from the top and set aside.", "Heat a griddle pan and oil the ciabatta slices. Grill the bread on both sides until crisp. Immediately rub them with the garlic and drizzle with a little of the reserved oil from the chicken pan.", "Serve the chicken with the bruschetta. Garnish with a few rosemary leaves."]}, {"isVegetarian": false, "title": "Chicken with Marsala", "url": "www_bbc_co_uk_food_recipes_chicken_with_marsala_60943", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_marsala_60943_16x9.jpg", "ingredients": ["4 chicken breasts, skin removed", "40g/1½oz plain flour", "50g/1¾oz butter", "2 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "160g/5¾oz chestnut mushrooms, sliced", "250ml/9fl oz dry Marsala", "150ml/5fl oz chicken stock", "small handful chopped flatleaf parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken breasts between sheets of cling film and beat, using a meat mallet or rolling pin, until about 5mm thick. Season with salt and pepper on both sides.", "Put the flour on a plate and dip the chicken in it to coat lightly, shaking off any excess. ", "Melt half the butter and oil in a frying pan over medium-high heat and fry the chicken for 2–3 minutes on each side until golden-brown. Set aside.", "Wipe the pan with kitchen paper. Heat the remaining butter and oil over a medium heat and gently fry the shallot and garlic for about 5 minutes until softened. Add the mushrooms and cook for 2 minutes. Add the Marsala and increase the heat to high. Cook until the liquid has reduced in volume by about half. Turn the heat back down to medium, add the stock and chicken. Cook for about 10 minutes. Serve sprinkled with parsley."]}, {"isVegetarian": false, "title": "Chicken with ratatouille bake", "url": "www_bbc_co_uk_food_recipes_chicken_with_ratatouille_20444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz tinned ratatouille ", "80g/3oz cooked roast chicken breast, skin removed, roughly chopped", "15g/½oz fresh breadcrumbs ", "1 level tsp finely grated Parmesan "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a grill to medium–hot.", "Put the ratatouille in a small saucepan over a medium heat. Add the chicken and cook until bubbling and the chicken is hot through. Transfer to a small ovenproof dish. ", "Mix the breadcrumbs and Parmesan together and sprinkle over the chicken ratatouille. Grill until brown. Serve."]}, {"isVegetarian": false, "title": "Chicken with red kidney beans", "url": "www_bbc_co_uk_food_recipes_chicken_with_red_kidney_97909", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_red_kidney_97909_16x9.jpg", "ingredients": ["low-calorie cooking spray", "1 onion, roughly chopped", "1 red pepper, cored, deseeded and roughly chopped", "1 garlic clove, halved", "250g/9oz boneless, skinless chicken thighs, cut into 3cm/1¼in chunks", "2 tsp mild chilli powder", "200g/7oz easy-cook long-grain rice", "400g can red kidney beans, rinsed and drained", "400g can cherry tomatoes, in natural juice", "200ml/7fl oz chicken stock", "salt and freshly ground black pepper", "fresh coriander leaves, roughly chopped", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan with a flameproof handle over a medium heat and lightly spray with oil. Add the onion, red pepper, garlic and chicken. Cook for 3 minutes, stirring continuously. ", "Preheat the grill to a hot setting. ", "Add the chilli powder, rice, beans, tomatoes and stock to the pan. Season to taste with salt and freshly ground black pepper. Bring to the boil, then reduce the heat and simmer for 15 minutes.", "Place the pan under the grill and cook until golden.", "Divide between four plates, garnish with coriander and serve with lime wedges. "]}, {"isVegetarian": false, "title": "Chicken with rice, peas and dumplings", "url": "www_bbc_co_uk_food_recipes_chicken_with_rice_peas_19832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz can red kidney beans", "400ml/14fl oz can coconut milk", "1 Scotch bonnet, deseeded and chopped", "2 spring onions; chopped", "1 sprig thyme", "400g/14 oz long-grain rice ", "sea salt and freshly ground black pepper", "1 onion, chopped", "½ red pepper, chopped", "½ green pepper, chopped", "½ yellow pepper, chopped", "1 Scotch bonnet, deseeded and chopped", "2 tbsp ketchup", "1 tbsp gravy browning", "2 tbsp sugar", "1 tbsp cornflour", "½ tsp salt", "250g/9oz self-raising flour", "2–3 tbsp oil", "175g/6oz plain flour", "½ tsp garlic powder", "3 tbsp hot and spicy seasoning (see Tips)", "1½ tbsp all-purpose seasoning (see Tips)", "6 boneless chicken breasts", "sunflower oil, for deep-frying"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice & peas, tip the beans into a pan, add 400ml/14floz water and boil for three minutes. Add the coconut milk, Scotch bonnet, spring onions and thyme, bring to the boil again and cook for five minutes. ", "Add the rice and, if necessary, a little extra boiling water so the rice is just covered. Put a lid on the pan and cook for 12–15 minutes or until the rice is cooked. Season to taste with sea salt and freshly ground black pepper and set aside.", "For the sauce, bring about 250ml/9fl oz water to the boil. Add the chopped onion, peppers and Scotch bonnet and boil for three minutes. Add the ketchup, gravy browning and sugar, then simmer for another three minutes. ", "In a small bowl, mix the cornflour with a tablespoon of water and add to the sauce to thicken. Stir thoroughly then season to taste with sea salt and freshly ground black pepper and set aside in a warm place.", "For the dumplings, stir the salt into the flour. Add water to make a dough and knead together well then shape the mixture into small balls. Heat the oil in a frying pan and shallow fry the dumplings for 2–4 minutes until golden then drain on kitchen paper and keep warm.", "For the chicken, mix the plain flour with the garlic powder and seasonings in a bowl. Dip the chicken breasts into the mixture until well coated.", "Heat the oil in a deep-fat fryer or deep pan to about 170C/325F. The oil is hot enough when a cube of bread floats to the surface and turns golden-brown. (CAUTION: hot oil can be dangerous. Never leave the pan unattended.)", "Fry the chicken, a few pieces at a time, until cooked through and golden- brown. Drain on kitchen paper then serve with the rice and peas, sauce and dumplings."]}, {"isVegetarian": false, "title": "Chicken with tomato sauce", "url": "www_bbc_co_uk_food_recipes_chicken_with_tomato_23577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_tomato_23577_16x9.jpg", "ingredients": ["400g/14oz mini chicken fillets ", "black pepper (optional)", "2 tsp vegetable oil", "2–3 sprigs rosemary or thyme (alternatively use ½ tsp dried herbs)", "1 onion, chopped", "2 garlic cloves, finely chopped or crushed", "1 pepper (any colour), deseeded and chopped into 1cm/½in chunks", "1 courgette, chopped into 1cm/½in chunks", "1 x 400g/14oz can chopped tomatoes", "1 tspspoon tomato purée", "1 tsp Worcestershire sauce", "1 tsp vinegar (balsamic or red wine)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Arrange the chicken fillets in a large microwave-safe dish using a fork and grind over some black pepper, if using. Drizzle with the oil and tuck in the fresh herbs or sprinkle with the dried herbs. Wash your hands.", "Cover with a lid or cling film, leaving a small area open, and cook on full power for two minutes. Remove the dish, peel back the cling film and turn the chicken so that any cooked parts on the outside are in the centre. Re-cover and cook for another minute.", "Remove the dish and transfer the chicken to a plate using a fork.", "Add the onion and garlic to the dish. Cook on full power for two minutes.", "Add the pepper and courgette to the onions, stir well and cook on full power for another two minutes.", "Add the tomatoes to the vegetables. Measure in the tomato purée, Worcestershire sauce and vinegar. Stir to combine.", "Add the chicken and any juices so that they are completely covered with tomato sauce.", "Cover the dish with cling film in the same way as before and cook on full power for three minutes.", "Carefully peel back the cling film, keeping your hands and wrists out of the way, as steam can cause burns. Stir the chicken fillets so that they can cook evenly.", "Re-cover and cook on full power for another five minutes.", "Remove the dish and leave to stand for two minutes. Carefully peel back the cling film and check that all the chicken is thoroughly cooked (no pink in the middle). If not, re-cover and cook for another 1–2 minutes each time until cooked."]}, {"isVegetarian": false, "title": "Chicken alla Milanese", "url": "www_bbc_co_uk_food_recipes_chickenallamilanese_72800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium chicken breasts, skinless and boneless", "100g/3½ plain flour", "1 handful of fine breadcrumbs, toasted", "2 eggs, beaten with salt and freshly ground black pepper", "4 tbsp Italian extra virgin olive oil", "4 fresh large plum tomatoes, chopped", "1 handful of pitted black olives, sliced", "3 tbsp flatleaf parsley, chopped", "10 tbsp Italian olive oil, for frying", "1 clove garlic, sliced", "2 pinches dried, crushed chilli", "500g/1lb 1½oz spinach leaves, washed", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["With the help of a meat mallet, beat the chicken breasts between two sheets of cling film until thin.   ", "Dust the chicken breasts in flour, then dip each into the egg and then in the breadcrumbs making sure each piece is well coated.", "Preheat the olive oil in a large frying pan and gently fry the chicken for approximately two minutes on each side, until they become golden and crisp. Place the browned breasts on some kitchen roll, allowing the excess oil to drain. Keep warm. ", "To make the sauce, in a large bowl, mix the tomatoes, olives and parsley together and season with some extra virgin olive oil and some salt and pepper. Allow this mixture to rest.", "In the meantime, shallow fry the garlic and the chilli in two tablespoons of olive oil for approximately 10 seconds.  Immediately add the spinach leaves, season with salt and cook for approximately three minutes, until softened.", "To serve, put some spinach in the middle of a plate, place a chicken breast on top and spread two tablespoons of the cold tomato mixture on top. ", "Serve immediately."]}, {"isVegetarian": false, "title": "Chicken cacciatore", "url": "www_bbc_co_uk_food_recipes_chickenalocacciatore_70349", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenalocacciatore_70349_16x9.jpg", "ingredients": ["8 tbsp olive oil", "1 onion, sliced", "2 celery stalks, roughly chopped", "2 medium carrots, roughly chopped", "6 chicken breasts, or chicken thighs, bones removed", "175ml/6fl oz white wine", "3 tbsp tomato purée", "500ml/17 fl oz chicken stock", "2 bay leaves", "2-3 sage leaves", "1 rosemary sprig", "250g/9oz easy-cook polenta", "knob of butter", "25g/1oz parmesan"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the onion, celery and carrots for 4-5 minutes, or until softened. Add the chicken pieces and continue to cook for 2-3 minutes or until the have browned a little.", "Pour in the wine and continue to cook until the volume of the liquid has reduced by half. Stir in the tomato purée and the stock.", "Add the herbs, reduce the heat and simmer for 30 minutes, or until the chicken is cooked through.", "Meanwhile, cook the polenta according to packet instructions. Add the butter and parmesan and stir until well combined. ", "To serve, spoon the polenta onto serving plates and top with the chicken."]}]