[{"ingredients": ["80g / 2¾oz de coco desecado", "125ml / 4½fl oz de leche de coco entera en grasa", "1 cucharada de harina de coco", "2 cucharadas de jarabe de arce", "½ cucharadita de extracto de vainilla", "pizca de sal"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "Mezcle todos los ingredientes en una cacerola a fuego medio hasta que estén bien combinados. Continúe cocinando durante 4-5 minutos hasta que la leche de coco haya sido absorbida en la mezcla y la mezcla se haya espesado. Retirar del fuego y reservar para enfriar un poco.", "Coloque cucharadas de la mezcla de macarrones en la bandeja de horneado preparada, para formar pequeñas cúpulas, dejando un espacio entre cada una. Hornee en el medio del horno durante 12-15 minutos, o hasta que estén tostados y dorados en los bordes.", "Retire del horno y coloque los macarrones a un lado para que se enfríen por completo, luego disfrútelos."], "url": "www_bbc_co_uk_food_recipes_chewy_coconut_macaroons_69782", "title": "Macarrones de coco masticables", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chewy_coconut_macaroons_69782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150gr / 5 oz de almendras molidas", "1 cucharada de arrurruz", "¼ cucharadita de sal", "¼ cucharadita de bicarbonato de soda", "2 cucharadas de jarabe de arce", "½ cucharadita de hojas frescas de tomillo o limón-tomillo, o al gusto", "1 cucharada de ralladura de limón rallada (preferiblemente de un limón no encerado)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "Pulse las almendras, el arrurruz, la sal y el bicarbonato de soda en un procesador de alimentos hasta que la mezcla esté bien combinada y se asemeje a pan rallado.", "Agregue el jarabe de arce, las hojas de tomillo y la ralladura de limón y vuelva a pulsar hasta que la mezcla se una como una bola de masa.", "Retire la masa del procesador de alimentos. Arranca 10 piezas de la masa de igual tamaño y pégalas en bolas del tamaño de una pelota de golf, luego aplástalas entre las palmas de las manos y colócalas en la bandeja de hornear preparada, dejando suficiente espacio entre cada galleta.", "Hornee durante 10-12 minutos, o hasta que estén crujientes y dorados en los bordes. Retire la bandeja del horno y déjela enfriar. Las galletas se mantendrán crujientes a medida que se enfríen, pero aún serán suaves en el medio."], "url": "www_bbc_co_uk_food_recipes_chewy_lemon_and_thyme_92523", "title": "Galletas masticables de limón y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chewy_lemon_and_thyme_92523_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Patatas fritas de 250 g / 9 oz como Maris Piper o Sebago, peladas, cortadas en cerillas o ralladas gruesas, empapadas en agua fría durante 15 minutos", "aceite vegetal, para freír", "1-2 cucharaditas de sal", "3 cucharadas de aceite vegetal", "6 granos de pimienta negra", "5 dientes", "2 vainas de cardamomo verde, ligeramente magulladas con un rodillo", "2 chiles secos de Cachemira", "4cm / 1½ en pieza de canela", "1 cebolla mediana, finamente picada", "Tomates 100g / 3½z, finamente picados", "1 cucharadita de sal", "4cm / 1½en raíz fresca de jengibre, finamente rallada", "3 dientes de ajo, aplastados", "1½ cucharadita de chile en polvo Kashmiri", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de sal masala", "½ cucharadita de cúrcuma molida", "1 kg / 2 lb 4 oz de pollo, unidas en 8 piezas, o 1 kg / 2 lb 4 oz de pollo, peladas", "2 cucharaditas de azúcar morena o azúcar morena", "Albaricoques secos suaves listos para comer de 150g / 5½oz", "3 cucharadas de vinagre de vino blanco", "puñado de cilantro, picado"], "method": ["Escurra las papas y séquelas en papel de cocina. Caliente el aceite vegetal en una sartén profunda a fuego medio hasta que esté caliente (o caliente una freidora a 180 ° C / 350 ° F). PRECAUCIÓN: el aceite caliente puede ser peligroso. No dejes desatendido Freír las papas por lotes hasta que estén crujientes y doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre un plato forrado con papel de cocina. Sazonar con sal.", "Para el curry, caliente el aceite en una sartén de base pesada o karahi a fuego medio. Agregue las especias enteras y fría por un minuto hasta que estén fragantes, luego agregue la cebolla y fría por 10 minutos, o hasta que estén suaves y doradas.", "Agregue los tomates y la sal y cocine a fuego lento durante 2-3 minutos, luego agregue el jengibre, el ajo, el chile en polvo, el comino, el cilantro, el garam masala y la cúrcuma y cocine por un minuto.", "Agregue las piezas de pollo a la cacerola y cocine, revolviendo, durante 2-3 minutos, o hasta que esté bien cubierto con la mezcla de especias, luego agregue el azúcar moreno, los albaricoques, el vinagre y suficiente agua para cubrir. Llevar a ebullición, bajar el fuego, cubrir la olla con una tapa y cocinar a fuego lento durante 30-40 minutos, o hasta que el pollo esté cocido y tierno, y la salsa se reduzca a una consistencia rica y espesa.", "Sirva con los palos de patata amontonados en la parte superior y espolvoréelos con cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_and_apricot_15424", "title": "Curry de pollo y albaricoque con pajitas de patata (sali murghi)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_apricot_15424_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de azúcar", "250ml / 8¾fl oz de sidra de buena calidad", "2 cucharadas de vinagre de sidra", "10ml / 4fl oz de aceite de colza prensado en frío o aceite de oliva virgen extra", "½ cucharadita de mostaza", "2 dientes de ajo, aplastados", "sal y pimienta negra recién molida", "3 lonchas de tocino, rebanadas en lardons", "60 g / 2¼ oz de mantequilla", "pequeño perifollo fresco, toscamente picado", "racimo pequeño de cebolletas frescas, más o menos picadas", "sal y pimienta negra recién molida", "1 pollo mediano, cortado por la mitad por la mitad", "60ml / 2¼fl oz de caldo de pollo", "4 nabos para bebés, afeitados en tiras con un pelador de vegetales", "hojas crujientes como Little Gem, achicoria y berro", "puñado de hojas frescas de perejil", "cebollino fresco y perifollo, picado, para servir"], "method": ["Para la vinagreta de sidra, coloque el azúcar en una sartén y cocine a fuego medio hasta que esté caramelizado. Agregue la sidra y cocine hasta que esté reducida y pegajosa. Retire del fuego.", "Bata el vinagre de sidra, el aceite, la mostaza y el ajo en la reducción de sidra. Sazonar con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Para los lardones, freír el tocino en una sartén caliente hasta que estén crujientes. Escurra la grasa y ponga el tocino a un lado.", "Para la mantequilla de hierbas, coloque la mantequilla en un procesador de alimentos y pulse para suavizar. Agregue el perifollo y las cebolletas y sazone con sal y pimienta negra recién molida. Pulso hasta que esté bien mezclado.", "Para el pollo, afloje la piel de las mitades de pollo y rellene la mantequilla de hierbas debajo de la piel. Enfriar en la nevera hasta que sea necesario.", "Precalentar el horno a 190C / 370F / Gas 5.", "Caliente una sartén a prueba de horno, sin aceite, y fría las mitades de pollo, con la piel hacia abajo, hasta que estén crujientes. Voltee las mitades de pollo y transfiera la sartén al horno durante 20-25 minutos, o hasta que el pollo esté cocido: los jugos se mantendrán limpios cuando el pollo se taladre con un pincho en el punto más grueso.", "Retire el pollo cocido del horno y vierta el exceso de grasa. Coloque las mitades de pollo a un lado para descansar. Desglasar la sartén con el caldo de pollo y cocinar para reducir el líquido.", "Para servir, mezcle los nabos afeitados, hojas crujientes, hojas de perejil y lardons con la vinagreta de sidra.", "Corte el pollo en pedazos para servir y agregue a la ensalada. Coloque la ensalada en un plato, vierta sobre los jugos de la sartén y espolvoree con cebollino picado y perifollo. Servir."], "url": "www_bbc_co_uk_food_recipes_chervilstuffedroastc_85257", "title": "Queso relleno de ensalada de pollo asado con nabos, lardones y vinagreta de sidra", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pollo a 200 g / 7 oz, cortada en cubos grandes", "600 g / 1 lb 5½ oz muslos de pollo o alas", "1 cucharada de pasta harissa", "1 cucharada de aceite vegetal", "1 cebolla, en rodajas", "2 dientes de ajo, aplastados", "1 cucharadita de canela molida", "1 cucharadita de comino molido", "1 cucharadita de jengibre molido", "1 cucharadita de cúrcuma molida", "1 cucharadita de hojuelas de chile", "450ml / 16fl oz de caldo de pollo", "100 g / 3½ oz de albaricoques secos, descuartizados", "1 x 400 g de tomate picado", "1 x 400 g de garbanzos de lata, enjuagados, escurridos", "sal y pimienta negra recién molida", "2 cucharadas de menta recién picada", "2 cucharadas de perejil recién picado", "cuscús, cocinado según las instrucciones del paquete", "150 g / 5½ oz de yogur al estilo griego", "puñado de almendras copos"], "method": ["Mezcle la pechuga de pollo y los muslos (o las alas) con la pasta harissa en un recipiente hasta que estén bien combinados. Cubra con film transparente y enfríe en la nevera durante dos horas.", "Caliente el aceite vegetal en la base de un plato de tajine o en una cazuela de base pesada. Freír el pollo durante 2-3 minutos. Retire del plato con una espumadera y déjelo a un lado.", "Freír la cebolla durante cinco minutos, o hasta que esté suave. Agregue el ajo y las especias.", "Agregue la carne al plato, junto con el caldo, los albaricoques y los tomates. Sazonar con sal y pimienta negra recién molida. Llevar a ebullición, cubrir con la tapa y hervir a fuego lento durante una hora. (Agregue los garbanzos después de 45 minutos y revuelva hasta que estén bien combinados).", "Agregue la menta y el perejil al final de la cocción.", "Servir junto con cuscús y yogur griego, cubierto con almendras."], "url": "www_bbc_co_uk_food_recipes_chicken_and_apricot_97224", "title": "Tagine de pollo fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_apricot_97224_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de leche de coco reducida en grasa", "200ml / 7fl oz de caldo de pollo", "1 cebolla roja pequeña, más o menos picada", "1 cucharada de nivel de pasta de curry massaman tailandesa", "1 ramita de canela", "2 pechugas de pollo, deshuesadas, sin piel (150 g / 5½ oz cada una), cortadas en trozos del tamaño de un bocado", "100g / 3½oz de judías verdes finas, recortadas", "1 berenjena, cortada en cubos de 1.5cm / ½ in", "1 cucharada de anacardos asados, picados", "1 chile rojo, sin semillas, en rodajas finas", "1 cebolla tierna, finamente picada", "2 limas, cortadas a la mitad"], "method": ["Coloque la leche de coco, el caldo, la cebolla roja, la pasta de curry y la ramita de canela en una cacerola grande y ancha. Llevar a fuego lento a fuego medio.", "Agregue el pollo, las judías verdes y la berenjena y cocínelos suavemente durante 15-20 minutos, o hasta que las berenjenas estén tiernas y el pollo esté bien cocido.", "Vierta el curry en cuatro cuencos poco profundos y espárzalos sobre los anacardos, el chile y la cebolleta. Sirva con las mitades de lima para exprimir."], "url": "www_bbc_co_uk_food_recipes_chicken_and_aubergine_25245", "title": "Pollo y berenjena massaman curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_aubergine_25245_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 patas de pollo sin piel (muslo y muslo)", "4 palitos de apio, cortados en cubitos", "4 hojas de laurel, aproximadamente en rodajas", "200ml / 7fl oz de vino blanco seco", "300ml / 10fl oz de caldo de pollo", "250 g / 9 oz de tocino ahumado (alrededor de 7 lonchas), cortado en trozos pequeños", "1 cebolla grande, más o menos picada", "50g / 1¾oz de mantequilla", "60g / 2¼ oz de harina común, más extra para quitar el polvo", "2 cucharadas de crema entera de grasa", "1 cucharada de mostaza granulada", "2 paquetes de 375 g listos para untar, masa de hojaldre con mantequilla", "1 huevo, golpeado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Coloque las patas de pollo, el apio y las hojas de laurel en una olla grande a prueba de horno, vierta sobre el vino y el caldo y sazone con sal y pimienta negra recién molida. Llevar a ebullición a fuego medio-alto, cubrir con una tapa y transferir al horno durante 30-40 minutos, o hasta que las patas de pollo estén cocidas y tiernas. Dejar de lado para enfriar.", "Una vez frío, retire la carne de los huesos de pollo. Los huesos se pueden reservar y usar para una reserva. Rompa la carne en pedazos del tamaño de un bocado antes de transferirla a un recipiente. Colar el caldo, reservar el apio y descartar las hojas de laurel, y medir el líquido. Debe tener aproximadamente 750 ml / 1 pinta 6fl oz; de lo contrario, complete esta cantidad con un poco de caldo adicional o vino blanco.", "Calentar una sartén grande y freír las piezas de tocino a fuego medio-alto durante 3 minutos. Agregue la cebolla, cubra con una tapa y fría por otros 10 minutos hasta que la cebolla se ablande. Agregue la mantequilla, revuelva hasta que se derrita, y luego espolvoree la harina para hacer un roux. Vierta el líquido reservado en el roux poco a poco, batiendo mientras agrega, y revuelva a fuego alto hasta que espese hasta obtener una consistencia de salsa suave.", "Agregue un poco de sal y pimienta, el apio reservado, la crema fresca y la mostaza y mezcle para combinar antes de agregar las piezas de pollo. Coloque el relleno en el plato refractario y nivele la parte superior. Dejar enfriar y luego enfriar, cubrir, en la nevera durante 30 minutos.", "Mientras tanto, prepara la masa para el pastel. Sobre una superficie de trabajo ligeramente enharinada, despliegue cada una de las hojas de hojaldre a aproximadamente 3 mm / ⅛ de espesor. Corte cada pieza en cintas largas y gruesas, de aproximadamente 3 cm / 1¼ de ancho. Tendrá que hacer lo suficiente para cubrir la parte superior del plato, alrededor de 16 en total. Teje las cintas juntas en un trozo de papel para hornear, hasta que tengas una cubierta de repostería lo suficientemente grande como para cubrir tu pastel. Enfriar en la nevera durante 15 minutos para reafirmar o, si el tiempo lo permite, congelar hasta que se solidifique.", "Saque el relleno de la nevera y cepille los bordes del plato con un poco de huevo batido. Con cuidado, deslice la rejilla de pastelería del papel de hornear y colóquela encima del relleno frío. Recorte el exceso de masa alrededor de la llanta y presione ligeramente para sellar.", "Aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6. Cepille la masa con el huevo batido restante y hornee durante 30 minutos hasta que la masa esté dorada y cocida, y el pollo esté burbujeando. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_chicken_and_bacon_21897", "title": "Pastel de enrejado de pollo y tocino", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_bacon_21897_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo sin piel sin hueso, cortadas en rodajas de 1cm / ½ pulgada de grosor", "3 cucharadas de salsa de soja ligera", "3 cucharadas de vino de arroz Shaoxing (o jerez seco)", "2 cucharadas de aceite de sésamo tostado", "2 cucharadas de harina de maíz", "4 cucharadas de aceite vegetal", "Jengibre de raíz fresco de 10cm / 5 en pieza, pelado y finamente picado", "3 dientes grandes de ajo, finamente picados", "3 chiles rojos, finamente picados", "50 g / 1¾oz de frijoles negros fermentados", "1 cucharada de azúcar en polvo", "150ml / 5fl oz de caldo de pollo", "6 cebollas de primavera, finamente rebanadas", "3 cucharadas de hojas de cilantro picado", "2 cabezas bok choi", "200g / 7oz de arroz basmati cocido, frío", "1 huevo de gallinas camperas, golpeado"], "method": ["Ponga el pollo en un bol con una cucharada de salsa de soja, vino de arroz Shaoxing y aceite de sésamo. Agregue la harina de maíz y luego mezcle para combinar y deje macerar durante 10 minutos.", "Caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agregue una cucharada de aceite vegetal, y cuando esté caliente y ligeramente humeante, agregue el pollo y sofría por 2-3 minutos, o hasta que esté casi cocido. Levante con una cuchara ranurada y déjela a un lado, luego limpie el wok y vuelva al fuego.", "Mezcle el jengibre, el ajo y el chile.", "Agregue otra cucharada de aceite vegetal y cuando esté caliente y vuelva a humear, agregue un tercio del jengibre, el ajo, la mezcla de chile y todos los frijoles negros y saltee durante 2-3 minutos hasta que se ablanden.", "Agregue las dos cucharadas restantes de vino de arroz Shaoxing, una cucharada de soja, todo el azúcar y caldo de pollo y deje que hierva. Regrese el pollo a la sartén y cocine por 1-2 minutos, o hasta que la salsa se haya espesado un poco y el pollo esté bien cocido.", "Termine con un tercio de la cebolla tierna y una cucharada de cilantro y revuelva.", "Guarde y caliente otro wok hasta que esté caliente, agregue una cucharada de aceite vegetal, la mitad del jengibre restante, el ajo y la mezcla de chile y la mitad de la cebolla restante y saltee durante un minuto. Agregue el bok choi y 75 ml / 3 fl oz de agua y saltee hasta que el bok choi esté tierno y el líquido se haya evaporado. Agregue una cucharada de cilantro y la otra mitad de la cebolla tierna y saltee durante un minuto y luego colóquela en el plato para servir.", "Limpie el wok y vuelva al fuego, luego agregue lo último del aceite vegetal, jengibre, ajo y chile y saltee por un minuto, luego agregue el arroz cocido y saltee por un minuto.", "Vierta el huevo batido en el centro del wok, luego saltee por unos minutos para que el arroz esté caliente y el huevo cocido.", "Agregue la última cucharada de aceite de sésamo, el cilantro restante y la cebolla tierna y fría por otro minuto.", "Para servir, apile el arroz en platos, coloque una cuchara junto al pollo y luego termine con el bok choi."], "url": "www_bbc_co_uk_food_recipes_chicken_and_black_bean_01124", "title": "Salsa de pollo y frijoles negros con bok choi", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_black_bean_01124_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "harina, para quitar el polvo", "300g / 10½oz de pasta brisa lista para usar", "9 huevos de gallinas camperas, 1 batido para el glaseado", "Crema doble 600ml / 20fl oz", "100g / 3½oz de espárrago", "300 g / 10½ fl oz de pollo cocido sobrante cocido, cortado en trozos de 3 cm / 1 ¼", "1 cucharada de mejorana fresca picada", "100g / 3½oz de queso Comté vintage, finamente rallado", "1 bolsa de hojas de ensalada verde, para servir", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase una lata agria de fondo suelto de 23cm / 9pulg (4cm / 2pulg) con mantequilla. Extienda la masa sobre una superficie de trabajo ligeramente enharinada a un espesor de 5 mm / ¼ in. Envuelva la masa alrededor de su rodillo y suavemente hacia abajo en la lata preparada, presionando suavemente la masa en la base y los lados.", "Cubra la caja de pastelería con película adhesiva o pergamino para hornear, luego llene con frijoles para hornear, arroz crudo o harina. Hornee en el horno durante 20-25 minutos. Retire el papel de revestimiento y las cuentas para hornear.", "Cepille el interior de la tarta con el huevo batido. Devuelva la caja de repostería al horno por otros 5 minutos o hasta que se dore. Retire la caja de pastelería del horno.", "Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "En un tazón, mezcle 8 huevos y la crema, luego sazone con sal y pimienta negra recién molida.", "Coloque las lanzas de espárragos dentro de la caja de tarta, luego espolvoree sobre las piezas de pollo y la mejorana. Verter sobre la mezcla de huevo y crema hasta que esté casi a nivel con la parte superior de la caja de pastelería. Distribuye el Comté en la parte superior.", "Hornee la quiche durante 20-25 minutos, o hasta que el relleno se haya solidificado y la masa esté dorada. Retire del horno y déjelo a un lado sobre una rejilla para que se enfríe un poco.", "Para servir, corte la quiche en rodajas y sirva con las hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_and_asparagus_27353", "title": "Quiche de pollo y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo, en el hueso y la piel en", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "100g / 3½oz de chorizo ​​al estilo británico, finamente cortado en cubos", "½ cucharadita de semillas de comino", "50 g / 1oz de pasas", "sal y pimienta", "150g / 5½oz de mantequilla sin sal", "Harina normal 300g / 10½ oz", "gran pizca de sal", "1 huevo de gallinas camperas, ligeramente golpeado", "huevo batido, para terminar"], "method": ["Caliente el horno a 180C / 350F / Gas 4.", "Para el relleno, coloque los muslos de pollo en un plato pequeño para asar, sazone bien con sal y pimienta y tueste durante aproximadamente 45 minutos o hasta que esté bien cocido. Dejar de lado para enfriar un poco.", "Mientras tanto, haz los pasteles. Derrita la mantequilla y déjela enfriar ligeramente. Pon la harina en un tazón grande y mezcla la sal. Vierta la mantequilla y el huevo. Comience a mezclar, agregue 3-5 cucharadas de agua sobre la marcha, hasta que tenga una masa suave. Déle vuelta a una superficie de trabajo limpia y amasarla suavemente durante un par de minutos, o hasta que quede suave. Regrese la masa a su recipiente, cúbrala y déjela reposar mientras prepara el relleno.", "Para finalizar el llenado, caliente el aceite en una sartén a fuego medio-bajo. Agregue la cebolla y cocine por 10-12 minutos, o hasta que esté suave.", "Agregue el ajo, el chorizo, las semillas de comino y las pasas. Cocine a fuego medio durante 5-8 minutos, revolviendo a menudo, hasta que el chorizo ​​esté cocido. Retire del fuego.", "Una vez que los muslos de pollo estén lo suficientemente fríos como para manipularlos, quita la piel. Saque toda la carne de los huesos y córtela aproximadamente. Agregue a la mezcla de chorizo. Pruebe y agregue sal y pimienta si es necesario (el chorizo ​​ya está bastante salado), luego deje que se enfríe completamente.", "Encienda el horno a 200C / 400F / Gas 6 y alinee una bandeja grande para hornear con papel para hornear.", "Enharinar ligeramente la superficie de trabajo y extender la masa hasta un espesor de 3-4 mm. Use un cortador de 12 cm / 4½ pulgadas o un tazón pequeño para cortar 10 discos. Probablemente necesites repetir los recortes una vez para obtener tantos. Divida el relleno entre los discos. Humedezca los bordes de la masa con agua y luego doble la mitad de cada disco para hacer un paquete semicircular. Presione los bordes juntos firmemente y luego doble o presione los bordes con un tenedor.", "Coloque las empanadas en la bandeja para hornear y cepille con huevo batido. Hornee durante 15-20 minutos, o hasta que estén doradas. Cómelos calientes, solos o con salsa de chile."], "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_26918", "title": "Empanadas de pollo y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_26918_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pimiento amarillo, sin semillas, cortado en cubitos", "1 mango pequeño, pelado y cortado en cubitos", "8 tomates cherry, cortados en cuartos", "3 cebollas de primavera, picadas", "1 cucharadita de pimientos jalapeños picados (opcional)", "1 lima, solo jugo", "sal y pimienta negra recién molida", "4 tortillas de harina", "150 g / 5 oz Monterey Jack o queso cheddar, rallado", "restos de pollo cocido, rallado u otra carne fría como pavo", "1 pimiento verde o rojo, sin semillas, finamente picado", "pequeñas hojas de cilantro puñado, picadas, más extra para adornar (opcional)", "crema agria y guacamole, para servir (opcional)"], "method": ["Para la salsa, mezcle todos los ingredientes de la salsa en un tazón y sazone al gusto con sal y pimienta negra recién molida.", "Incline el aguacate en un tazón con el jugo de limón para evitar que se ponga marrón. Agregue el ajo, la crème fraîche y el cilantro y mezcle todo junto ligeramente con un tenedor, manteniendo una gran cantidad de textura. Sazone al gusto con sal y pimienta negra recién molida.", "Para las quesadillas, coloca dos de las tortillas sobre una superficie plana. Cubra cada uno con el queso, seguido del pollo, pimientos y cilantro. Coloque las tortillas restantes en la parte superior y presione suavemente.", "Calentar una sartén a fuego medio y agregar una de las quesadillas a la sartén. Freír, sin agregar aceite, durante 2-3 minutos por cada lado o hasta que la tortilla esté crujiente, el queso se derrita y el pollo se caliente por completo. Mantenga caliente mientras cocina las segundas quesadillas.", "Para servir, corte las quesadillas en cuartos y colóquelos en platos. Ponga un poco de crema agria en la parte superior, adorne con cilantro y sirva con la salsa y el guacamole al costado."], "url": "www_bbc_co_uk_food_recipes_chicken_and_cheese_65643", "title": "Quesadillas de pollo y queso con guacamole, crema agria y salsa de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite", "12 piezas enteras de pollo (piernas o muslos), en el hueso", "1 salchicha de chorizo, rebanada en rodajas gruesas de 3 mm / ⅛ pulgadas", "1 cebolla grande, finamente picada", "3 dientes de ajo, aplastados", "2 pimientos rojos, semillas eliminadas, en rodajas", "2-3 chiles rojos, sin semillas, picados", "2 cucharaditas de pimentón ahumado", "1.5 litros / 2½ pintas de caldo de pollo", "Arroz de paella 400 g / 14 oz", "12 mejillones o almejas, (opcional) conchas limpiadas, abiertas y dañadas descartadas", "puñado de perejil, toscamente picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite en una sartén o paellera grande, con tapa y a prueba de calor. Freír el pollo hasta que las piezas estén doradas uniformemente, volteándolas regularmente mientras se cocinan. Es posible que deba hacer esto en dos lotes, según el tamaño de su bandeja. Retire el pollo de la sartén y déjelo a un lado.", "Freír las rodajas de chorizo ​​en la sartén hasta que estén crujientes. Lanzarán sus jugos en la sartén, lo que agrega mucho sabor al plato. Agregue la cebolla a la sartén y cocine suavemente hasta que esté suave, luego agregue el ajo y fría por 2-3 minutos más. Agregue los pimientos rojos, los chiles y el pimentón ahumado, cocine por otros 2-3 minutos. Regrese las piezas de pollo a la sartén y vierta en el caldo. Cocine a fuego lento durante 20-25 minutos hasta que el pollo esté tierno.", "Agregue el arroz a la sartén, cúbralo con la tapa y colóquelo en el horno precalentado. Cocine por 30 minutos, o hasta que todo el líquido haya sido absorbido y el arroz esté cocido. Alternativamente, si utiliza una paellera que no cabe en el horno, cubra bien con papel de aluminio y continúe cocinando en la estufa a fuego lento durante el mismo tiempo de cocción. Si usas mejillones o almejas, agrégalos a la olla durante los últimos 20 minutos de cocción. Deseche cualquier caparazón que permanezca cerrado después de la cocción. Comprueba que el pollo esté cocido perforando la parte más gruesa de una pieza con un pincho; si los jugos son claros, el pollo está cocido.", "Espolvoree con perejil antes de llevar la sartén a la mesa. Deje que sus invitados se ayuden a sí mismos."], "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_33509", "title": "Paella de pollo y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_33509_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 grandes langostinos tigre, pelados y desvelados, conchas y cabezas reservadas", "aceite de oliva", "1 litro / 1¾ pinta de caldo de pollo de buena calidad", "pellizcar el azafrán", "aceite de oliva", "8 muslos de pollo, cortados en trozos pequeños", "Chorizo ​​200g / 7oz, pelado y finamente picado", "2 cebollas, finamente picadas", "2 dientes de ajo, aplastados", "4 tomates maduros, sin semillas, cortados en cubitos", "1 cucharadita de pimentón ahumado en caliente", "500 g / 1lb de paella 2 oz de arroz", "2 pimientos rojos asados, pelados y desgarrados en tiras", "perejil de hoja plana de manojo pequeño, hoja finamente picada", "Rodajas de limón"], "method": ["Para hacer el caldo, coloque las cáscaras de gambas y las cabezas en una sartén con un chorrito de aceite y fría por 5 minutos, o hasta que se tornen de un color rosado intenso. Vierta sobre el caldo, agregue el azafrán y cocine a fuego lento durante 20 minutos. Colar en una sartén limpia y mantener caliente.", "Precalentar una barbacoa a fuego medio. Calentar un buen chorrito de aceite en una paellera grande, agregar el pollo y freír hasta que se dore por todos lados. Retire el pollo de la sartén con una espumadera y déjelo a un lado.", "Agregue el chorizo ​​a la sartén, freír durante unos minutos hasta que estén crujientes, luego agregue las cebollas. Freír durante 5 minutos hasta que estén suaves, luego agregar el ajo, los tomates y el pimentón ahumado.", "Freír durante 5 minutos hasta que los tomates comiencen a descomponerse. Regrese el pollo a la sartén y revuelva en el arroz. Vierta sobre el caldo, revuelva todo rápidamente y luego deje hervir a fuego lento durante 10 minutos sin remover.", "Coloque las gambas y los pimientos en la parte superior del arroz, cubra la bandeja con una hoja de papel de aluminio, coloque la tapa sobre la barbacoa y déjela cocer durante 10 minutos o hasta que las gambas se hayan puesto rosadas. Retire la sartén del fuego y déjela reposar durante 5 minutos antes de servirla con perejil picado y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_59310", "title": "Paella de pollo y chorizo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "70g / 3oz de chorizo, reducido a la mitad y en rodajas", "½ cebolla grande, en rodajas", "Filetes de muslo de pollo de 200g / 7oz, cortados en pedazos de 2½cm / 1in", "1 diente de ajo, finamente cortado", "1 pimiento verde, en rodajas", "110g / 4oz de arroz basmati", "200ml / 7fl oz de caldo de pollo (½ cubo en existencia disuelto)", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una olla grande con una tapa hermética y freír el chorizo ​​a fuego alto durante 1 minuto. Agregue las cebollas y fría por un minuto más, luego agregue el pollo y el ajo y cocine por 5 minutos.", "Agregue el pimiento verde y el arroz basmati y mezcle bien para combinar. Vierta el caldo de pollo y revuelva, baje la temperatura lo más posible, coloque la tapa y déjela durante 12 minutos.", "Apague la calefacción pero no quite la tapa y déjela durante 12 minutos más, luego quite la tapa y agite bien con un tenedor. El agua debe ser absorbida. Sazone al gusto y sirva enseguida."], "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_rice_85780", "title": "Pollo y arroz al chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_rice_85780_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, con la piel puesta", "20 g / ¾oz de mantequilla sin sal", "2 cucharadas de aceite de girasol", "1 pepino, pelado, reducido a la mitad longitudinalmente y sin semillas", "2 cucharadas de aceite de oliva", "1 cucharadita de pimentón dulce (suave) ahumado", "250ml / 9fl oz de crema batida", "1 cucharada de perejil picado de hoja plana", "2 cucharadas de almendras en copos, tostadas, para servir", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Sazone la piel del pollo con sal y pimienta.", "Caliente una sartén grande a fuego medio-alto. Agregue la mantequilla y el aceite de girasol. Cuando la mantequilla esté espumosa, agregue el pollo, con la piel hacia abajo, y cocine durante cinco minutos, hasta que esté dorado y crujiente. Retire de la sartén y déjelo a un lado.", "Corte cada pedazo de pepino a la misma longitud que una de las pechugas de pollo, luego corte en tiras gruesas de 3 mm / 1/8.", "Retire la sartén del fuego y luego limpie con papel de cocina. Regrese al fuego, agregue el aceite de oliva y el pepino, sazone con sal y pimienta y cocine de 4 a 5 minutos, revolviendo continuamente, hasta que el pepino sea translúcido pero conserve su sabor crujiente. Agregue el pimentón y revuelva, luego escurra sobre papel de cocina.", "Coloque cuatro hojas cuadradas de papel para hornear de 30cm / 12in en una superficie de trabajo. Coloque una cuarta parte del pepino en una de las hojas, colocándola longitudinalmente en el centro. Coloque una pechuga de pollo encima y doble los lados y la parte inferior del papel para que la parte superior esté abierta.", "Vierta tres cucharadas de crema en la parte superior, doble el papel y doble bien la parte superior para sellar y hacer un paquete. Repita para hacer cuatro parcelas.", "Transfiera a una bandeja para hornear y tueste durante 8-10 minutos. Apaga el horno y abre la puerta para que esté entreabierta. Deje el pollo durante dos minutos hasta que esté lo suficientemente frío como para manipularlo.", "Con cuidado, abra un extremo de cada paquete y vierta los jugos en una sartén pequeña. Cierra las parcelas nuevamente y regrésalas al horno.", "Ponga la sartén a fuego medio y deje que hierva, luego baje el fuego a fuego lento y cocine a fuego lento durante cinco minutos, hasta que se reduzca el volumen a la mitad.", "Mientras tanto, bate la crema restante hasta que se formen picos suaves.", "Retire la sartén del fuego y mezcle con la crema batida. Regrese al fuego y cocine a fuego lento, luego retire inmediatamente del fuego. Agregue el perejil y sazone con sal y pimienta.", "Para servir, deslice las parcelas en los platos y ábralas. Vierta la salsa sobre el pollo y espolvoree con las almendras antes de servir."], "url": "www_bbc_co_uk_food_recipes_chicken_and_cucumber_en_93986", "title": "Pollo y pepino en papillote con almendras tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo cortado en cubos de 500 g / 1 lb 2 onzas (una mezcla de muslos y senos pelados)", "1 limón, ralladura solamente", "algunos granos de pimienta blanca, aplastados", "algunas hojas frescas de salvia", "100 ml / 3½ fl oz de vino blanco o vermut", "Puerros 250 g / 9 oz, cortados y cortados en rodajas de 2cm / ¾ de espesor", "1 cucharada de harina normal", "½ cucharadita de mostaza en polvo", "150ml / 5fl oz de caldo de pollo", "sal", "225g / 8oz de harina autoacabada, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "1 cucharadita de salvia frotada o ½ cucharadita de salvia seca", "½ cucharadita de mostaza en polvo", "100g / 3½oz Estacio", "100-150ml / 3½fl oz-5fl oz de leche", "botón de mantequilla, para engrasar"], "method": ["Para el relleno, ponga el pollo, la ralladura de limón, los granos de pimienta y la salvia en un tazón. Agregue el vino, cubra y deje en la nevera para marinar durante al menos una hora o durante la noche.", "Para la masa, ponga la harina, el polvo de hornear, la salvia frotada y el polvo de mostaza en un bol. Mezcle bien hasta que se combinen. Agregue el sebo y frótelo en la harina hasta que alcance una consistencia de migas de pan. Poco a poco agregue la leche, cortándola con un cuchillo hasta que la mezcla se una como una masa blanda que no sea para nada pegajosa.", "Aparte un cuarto de la masa para hacer la tapa. Extienda la masa restante sobre una superficie de trabajo ligeramente enharinada para formar un círculo grande (aproximadamente 30 cm). Engrase un bol de 1,2 litros / 2 pinta con mantequilla. Cubra el fondo del tazón con un pequeño círculo de papel para hornear. Alinee el tazón con la masa, asegurándose de que los lados estén completamente cubiertos y que todas las uniones estén bien selladas. Estire los pasteles restantes para hacer la tapa del pastel y déjelos a un lado mientras termina el llenado.", "Agregue los puerros al pollo marinado. Mezcle la harina con la mostaza en polvo y sazone con sal. Agregue la mezcla de harina al pollo y los puerros y mezcle bien para combinar. Con una cuchara, vierta en el recipiente del pudín y vierta lentamente el caldo. Coloque la tapa de la repostería sobre el relleno y presione los bordes para asegurarse de que el relleno esté bien sellado.", "Cubra la tapa con un círculo de papel para hornear. Toma un trozo de papel de aluminio y dobla un pliegue grueso en él. Móblelo sobre la parte superior del pudín, átalo con la cuerda del cocinero o asegúralo con una banda elástica resistente. Siente el bol con leche en un plato volteado en el fondo de una gran sartén con tapa. Vierta suficiente agua hirviendo para llegar hasta la mitad del borde del tazón. Coloque una tapa en la sartén y cocine a fuego lento. Reduzca el fuego a bajo y deje que el pudín hierva durante 2 horas. Rellene el agua hirviendo, si es necesario, para que la sartén no hierva en seco.", "Para servir, quite la tapa de aluminio y coloque una espátula alrededor del borde del pudin. Ponlo en un plato y sírvelo caliente."], "url": "www_bbc_co_uk_food_recipes_chicken_and_leek_suet_91971", "title": "Pudín de sebo de pollo y puerros", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite vegetal", "6 muslos de pollo deshuesados ​​y sin piel (aproximadamente 500 g / 1 lb 2 oz), cortados en trozos del tamaño de un bocado", "sal y pimienta negra recién molida", "3 puerros medianos, cortados", "1 cebolla picada", "algunas ramitas de tomillo fresco", "1 cucharada de mantequilla", "2 cucharadas de harina normal", "350ml / 12fl oz de caldo de pollo de buena calidad", "100g / 31 / 2oz de jamón de buena calidad, desgarrado en trozos del tamaño de un bocado", "100g / 31 / 2oz crème fraîche, opcional"], "method": ["Caliente el aceite en una sartén antiadherente grande. Sazonar el pollo con sal y pimienta negra recién molida y freír a fuego alto durante 10 minutos hasta que se dore por todas partes.", "Mientras tanto, corta los puerros en rodajas de 1 cm / ½. Coloque los puerros, la cebolla y las hojas de tomillo en la olla de cocción lenta. Cubra con el pollo.", "Agregue la mantequilla a la sartén, déjela derretir, luego agregue la harina y cocínela por un minuto o hasta que esté dorada y burbujeante. Saque la sartén del fuego, luego bata gradualmente en el caldo para hacer una salsa suave. Al principio será muy grueso, pero continúa. Vierta la salsa sobre el pollo y las verduras, cubra y cocine a fuego lento durante 4 horas o hasta que la carne esté tierna. Sazonar con sal y pimienta negra recién molida. Dejar enfriar, luego enfriar.", "Agregue el jamón y la crème fraîche (si se usa) en la mezcla de pollo frío y está listo para cubrir con pasta de rescoldo o hojaldre. Hornee en un horno caliente durante 40 minutos o hasta que estén calientes y dorados."], "url": "www_bbc_co_uk_food_recipes_chicken_and_leek_pie_27675", "title": "Pollo de cocción lenta, jamón y relleno de pastel de puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_leek_pie_27675_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 pollo mediano, cortado en 10 piezas", "2 cebollas, finamente picadas", "3 dientes de ajo, finamente picados", "Jengibre de raíz de 5cm / 2in, rallado", "2 palitos de canela", "2 cucharaditas ras-el-hanout (mezcla de especias del norte de África)", "1½ cucharadita de sal", "1 cucharadita de pimienta negra recién molida", "½ cucharadita de cúrcuma molida", "1 cucharadita de canela molida", "½ cucharadita de azafrán", "1 limón en conserva, toscamente picado", "3 cucharadas de miel", "750ml / 1 pinta 5fl oz de caldo de pollo", "Fechas de 150g / 7oz, piedras removidas, reducidas a la mitad", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatleaf fresco picado", "140g / 5oz de trigo bulgur, empapado en agua fría durante la noche", "1 cebolla roja, finamente picada", "2 tomates, sin semillas, finamente picados", "2 manojos grandes de perejil de flatleaf, más o menos picados", "1 manojo de menta, más o menos picado", "1 manojo de cilantro, más o menos picado", "1 jugo de limón solamente", "4 cucharadas de aceite de oliva virgen extra"], "method": ["Para el tagine de pollo y limón, caliente una olla grande con tapa hasta que esté caliente, agregue la mantequilla y el pollo y fríalos durante 2-3 minutos por cada lado, o hasta que estén dorados (puede que tenga que hacer esto en tandas). Retire el pollo de la sartén y déjelo a un lado en un plato.", "Agregue las cebollas, el ajo y el jengibre a la sartén y fría por 2-3 minutos, o hasta que estén blandos. Agregue las especias y cocine por un minuto, luego devuelva el pollo a la sartén y revuelva hasta que el pollo esté cubierto con la mezcla de especias.", "Agregue los limones, miel y caldo conservados y ponga la mezcla a ebullición.", "Reduzca el fuego hasta hervir a fuego lento, cubra con una tapa y cocine durante 45 minutos.", "Agregue las fechas y mezcle bien, luego continúe cocinando, sin tapa, por otros 30-45 minutos, o hasta que el pollo esté tierno y la salsa se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar el perejil.", "Para herby tabbouleh, escurra el trigo bulgur y colóquelo en un tazón grande. Agregue los otros ingredientes y revuelva hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la tabulé sobre los platos y sirva un poco de tagine al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_and_lemon_tagine_75608", "title": "Tagine de pollo y limón con herby tabbouleh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_lemon_tagine_75608_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pollo pequeño (aproximadamente 1 kg / 2 lb 4 oz)", "2 zanahorias, aproximadamente picadas", "1 tallo de limoncillo, magullado", "3 ramitas de tomillo", "1 cilantro de racimo pequeño, hojas recogidas y tallos reservados", "2 zanahorias grandes, descuartizadas", "3 tallos de limoncillo, 2 magullados, 1 pelado", "2 ramitas de tomillo", "1 lima, ralladura fina solamente", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta"], "method": ["Para la base, caliente una cacerola a prueba de fuego a fuego medio. Agregue el aceite de oliva y selle el pollo durante 3-4 minutos por cada lado hasta que comience a colorear. Agregue las zanahorias, el limoncillo, el tomillo y la mitad de los tallos de cilantro. Cocine por 5 minutos hasta que el pollo tenga más color y las verduras también estén ligeramente coloreadas.", "Para el caldo, transfiera el pollo y las verduras a una cacerola grande, con tapa y profunda, y cubra con aproximadamente 2 litros / 3½ pintas de agua fría. Llevar a ebullición y quitar la espuma. Agregue las zanahorias, limoncillo magullado, tomillo y los tallos restantes de cilantro. Baje el fuego a muy bajo, tape y cocine durante aproximadamente 1 ½ horas hasta que el pollo comience a caerse del hueso.", "Retire el pollo y déjelo enfriar. Cuele el caldo y reserve las verduras. Regrese el caldo al fuego y cocine a fuego lento durante 10-15 minutos sin cubrir, hasta que el caldo se haya reducido en un tercio.", "Mientras tanto, levante cuidadosamente las zanahorias descuartizadas del colador descartando el resto de las verduras. Cortar finamente las zanahorias y poner en tazones de sopa profunda.", "Cuando el pollo esté lo suficientemente frío como para manipularlo, quítele la piel, luego retire la carne de los huesos y deséchela en pedazos pequeños. Agregue el pollo y una pizca de sal y pimienta a los tazones, luego esparza sobre las hojas de cilantro. Espolvoree la ralladura de lima y rocíe con aceite de oliva virgen extra.", "Retire las hojas exteriores duras, la parte superior y la raíz del tallo de la hierba de limón restante, luego corte muy fino y agregue a los tazones. Por ahora, el caldo debe estar listo, así que simplemente agregue un par de cucharadas a cada plato antes de servir."], "url": "www_bbc_co_uk_food_recipes_chicken_and_lemongrass_84089", "title": "Caldo de pollo y hierba de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva", "harina, para quitar el polvo", "Muslos de pollo de 400g / 14oz, desollados y deshuesados", "150 g / 5½ oz cebollas pequeñas, peladas", "1 zanahoria, muy finamente picada", "1 tallo de apio, muy finamente picado", "300 g / 10½ oz champiñones, reducido a la mitad", "200ml / 7fl oz de vino blanco seco", "500ml / 18fl oz de caldo de pollo", "nuez moscada recién rallada, al gusto", "3 yemas de huevo de rango libre, batidas con 4 cucharaditas de leche", "1 cucharada de perejil fresco finamente picado"], "method": ["Calienta seis cucharadas de aceite de oliva en una sartén a fuego medio.", "Espolvoree un poco de harina en un plato. Cubra los muslos de pollo con la harina, sacuda el exceso y colóquelo cuidadosamente en el aceite caliente. Freír los muslos de pollo durante 4-5 minutos en cada lado, o hasta que estén dorados en cada lado.", "Retire los muslos de pollo de la sartén y déjelos a un lado en un plato forrado con papel de cocina.", "Caliente las dos cucharadas restantes de aceite de oliva en una sartén y fría la cebolla, la zanahoria, el apio y los champiñones durante cinco minutos, o hasta que se ablanden.", "Agregue el vino y el caldo, cocine a fuego lento y cocine por otros 10 minutos.", "Regrese el pollo a la sartén y sazone al gusto con sal, pimienta negra recién molida y nuez moscada. Continúe cocinando a fuego lento durante otros 4-5 minutos o hasta que el pollo esté cocido", "Justo antes de servir, agregue la mezcla de yema de huevo hasta que quede suave y espolvoree sobre el perejil."], "url": "www_bbc_co_uk_food_recipes_chicken_and_mushroom_17575", "title": "Cazuela de pollo y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_mushroom_17575_16x9.jpg", "isVegetarian": false, "recommendations": 0}]