[{"isVegetarian": true, "title": "Diggers", "url": "www_bbc_co_uk_food_recipes_diggers_46052", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/diggers_46052_16x9.jpg", "ingredients": ["120g/4½oz plain flour", "225g/8oz caster sugar", "100g/3½oz oats", "85g/3oz desiccated coconut", "125g/4½oz butter, plus extra for greasing", "1 tbsp golden syrup", "1 level tsp bicarbonate of soda", "2 tbsp boiling water"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.  Grease a 20cm/8in square tin", "Mix the flour, sugar, oats and coconut together in a large mixing bowl. ", "Put the butter in a small pan with the golden syrup and heat gently until melted. Mix the bicarbonate of soda with the boiling water and add this to the butter and syrup mixture. ", "Pour the liquid over the dry ingredients and mix well. Tip the mixture into tin  and press down. ", "Bake in the preheated oven for 20 minutes or until golden-brown then let cool for a few minutes before cutting into slices. Alternatively, shape the mixture into cookies and place them on a greased baking tray. Cook for 10–15 minutes or until golden-brown."]}, {"isVegetarian": false, "title": "Chive blinis with caviar and soured cream", "url": "www_bbc_co_uk_food_recipes_dillbliniswithcaviar_86321", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz plain flour", "1 tsp salt", "14g/½oz fresh yeast", "150ml/5fl oz milk", "2 free-range egg whites", "3 tbsp finely chopped fresh chives", "2 tbsp olive oil", "50g/2oz caviar", "150g/5oz soured cream"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour and salt into a bowl and crumble in the yeast.", "Place the milk into a pan over a low heat and warm through.", "Pour the warm milk into the flour, mixing thoroughly to form a thick batter. Set aside for one hour.", "Whisk the egg whites until soft peaks form when the whisk is removed.", "Fold the egg whites and chives into the batter mixture.", "Heat a small amount of the olive oil in a frying pan over a medium heat.", "Add a spoonful of the batter and fry for 45-60 seconds, until golden underneath, then turn over and cook for 30 seconds on the other side. Remove the blini and place onto kitchen paper. Repeat this process with the remaining batter. Keep the blinis warm.", "To serve, place a spoonful of sour cream onto each blini, top with a spoonful of caviar and arrange on a large serving plate."]}, {"isVegetarian": true, "title": "Dirty martini", "url": "www_bbc_co_uk_food_recipes_dirtymartini_93631", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dirtymartini_93631_16x9.jpg", "ingredients": ["70ml/2fl oz vodka or gin", "1 tbsp dry vermouth", "2 tbsp olive brine", "1 wedge of lemon", "1 green olive"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the vodka, dry vermouth and olive brine into a cocktail shaker with a handful of ice and shake well.", "Rub the rim of a martini glass with the wedge of lemon.", "Strain the contents of the cocktail shaker into the glass and add the olive."]}, {"isVegetarian": true, "title": "Disco pops", "url": "www_bbc_co_uk_food_recipes_disco_pops_02468", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/disco_pops_02468_16x9.jpg", "ingredients": ["4 drops vanilla extract", "2 tsp runny honey", "270g/9½oz Greek-style yoghurt", "50g/2oz fresh raspberries, mashed", "100g/4oz fresh strawberries, mashed"], "serves": "Makes 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix the vanilla extract and honey into the yoghurt. Stir in the fruit and fruit juices with a spatula to create a swirling pattern. ", "Divide the mixture equally among four lollipop moulds. Cover with the lids or with aluminium foil.", "Freeze the disco pops overnight. "]}, {"isVegetarian": true, "title": "Pomegranate molasses salad dressing", "url": "www_bbc_co_uk_food_recipes_divinesaladdressing_85676", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp pomegranate molasses ", "6 tbsp olive oil", "1 tbsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Makes 8 tbsp", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the pomegranate molasses, olive oil and white wine vinegar in a clean jam jar.", "Put the lid on the jar and shake well. Season with salt and freshly ground pepper to taste and use the dressing on your favourite salad."]}, {"isVegetarian": true, "title": "DIY chocolates", "url": "www_bbc_co_uk_food_recipes_diy_choc_box_18584", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/diy_choc_box_18584_16x9.jpg", "ingredients": ["300g/10½oz good quality milk or dark chocolate, chopped", "100g/3½oz desiccated coconut", "200ml/7fl oz condensed milk", "handful mini marshmallows", "2 tbsp peanut butter, crunchy or smooth", "handful dried fruit and nut mixture"], "serves": "Makes 21", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place 200g/7oz of the chocolate in a glass bowl. Melt in the microwave on the lowest setting until almost smooth. Quickly stir in the remaining chocolate. (This lowers the temperature quickly and ensures a smooth and glossy finish.) ", "Pour the melted chocolate into the ice cube squares until roughly one-quarter full. Move the tray around until the sides of the cube moulds are coated in chocolate. Set aside in a cool place until completely set. ", "Meanwhile, cover the remaining melted chocolate with cling film and set aside in a warm place. If it starts to set, place the chocolate bowl over a smaller bowl of boiling water and gently stir until smooth again.", "To make the coconut filling, place the desiccated coconut in a small bowl and stir in the condensed milk until it sticks together but isn’t sloppy. Roll into small bowls.", "Once the chocolate base has set hard, you can add a selection of fillings to the squares. Add a coconut ball, or a teaspoon of peanut butter, or sprinkle in a few nuts or fruits. (Do not overfill the squares as this can cause breakages when removing from the mould.)", "Pour in the remaining melted chocolate, until all the moulds are full and the fillings are covered. Leave to set hard in a cool place.", "Once set, carefully turn out the chocolates. If desired, dab a little melted chocolate on top of each chocolate and sprinkle on any remaining fillings. ", "Serve on a platter or package up in a gift box or bag to give as a gift. "]}, {"isVegetarian": true, "title": "Dobos torte", "url": "www_bbc_co_uk_food_recipes_dobos_torte_82293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dobos_torte_82293_16x9.jpg", "ingredients": ["800g/1lb 12oz granulated sugar", "400ml/14fl oz double cream", "450g/1lb butter, softened ", "8 large free-range eggs", "350g/12oz caster sugar", "300g/10½oz sifted self-raising flour ", "75g/2½oz flaked almonds", "16 hazelnuts, blanched", "400g/14oz granulated sugar"], "serves": "Makes 1 large two-tiered cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the caramel buttercream, place the sugar and 100ml/3½fl oz water into a large saucepan. Slowly bring to the boil over a medium heat, stirring until the sugar has dissolved. ", "Once there is no grittiness left, turn up the heat and boil until a golden caramel. Take off the heat and add the double cream and give it a quick stir then leave to cool then chill until set.", "Place the softened butter in the bowl of a free-standing mixer and whisk until light and fluffy. Add to the cooled caramel mixture a spoonful at a time, whisking between each addition. Scrape down the bowl regularly. Chill until ready to use.", "Preheat the oven to 200C/180C(fan)/Gas 6. Mark six 20cm/8in circles and six 15cm/6in circles on baking parchment and lay on baking trays. ", "To make the sponge layers, break the eggs into a large bowl and add the sugar. Whisk with a hand-held electric mixer until the mixture is light and foamy and the whisk just leaves a trail when lifted out of the mixture. ", "Lightly fold in the flour, a little at a time. Divide the mixture between the 12 marked circles, spreading the mixture out evenly. ", "Bake the cakes, a couple at a time, in the pre-heated oven for about 8-10 minutes until pale golden and springy to the touch. With a sharp knife, trim the circles. Peel off the parchment and leave to cool on a wire rack. ", "To make the almond praline and caramel coated hazelnuts, spread the flaked almonds over a sheet of baking parchment on a baking tray.  ", "Stick cocktail sticks into each of the 16 hazelnuts.  ", "Dissolve the sugar in 8 tbsp water over a low heat, stirring constantly, then increase the heat and boil the syrup until it turns a deep golden-brown colour. Allow it to cool slightly then pour half of it over the flaked almonds.  Set aside to cool completely.", "Dip the hazelnuts in the hot caramel twisting the cocktail sticks so the nuts are completely coated in caramel.  Carefully invert the cocktail sticks and press them into an orange or piece of foam and leave to set.", "Take one of the 15cm/6in sponge circles and place it on a sheet of silicon or baking parchment. Pour the remaining caramel over the sponge circle. ", "When the caramel on top of the sponge is just beginning to set, mark and then cut into eight portions with an oiled knife. ", "Sandwich the six circles of 20cm/8in sponges together with caramel buttercream.  Spread the sides and top with buttercream.", "Sandwich the remaining five circles of 15cm/6in sponges together with butter cream. Spread buttercream around the sides and top of the cakes and place on top the 20cm/8in cake stack to form a second tier.  ", "Break the almond praline into small pieces and press into the sides of both tiers of the cake. ", "Spoon the remaining buttercream into a piping bag fitted with a medium size star nozzle. Pipe 16 rosettes of the buttercream around the top edge of the larger cake and top each rosette with a caramel coated hazelnut.  ", "Pipe eight rosettes around the top of the small cake and place a caramel-topped wedge of cake at an angle on top of each rosette to form the top layer."]}, {"isVegetarian": true, "title": "Dolcelatte, pear and walnut tarts", "url": "www_bbc_co_uk_food_recipes_dolcelatte_pear_and_73284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for rolling", "175g/6oz butter", "1 free-range egg, beaten", "knob of butter", "1 tsp olive oil", "3 medium conference pears, peeled, quartered, core removed, thickly sliced lengthways", "3 free-range eggs, beaten", "300ml/½ pint crème fraîche", "3 fresh sage leaves, finely shredded", "150g/5½oz Stilton, rind removed, broken into small pieces", "40g/1½oz walnuts, broken into small pieces"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, blend the flour and butter in a food processor until the mixture resembles fine breadcrumbs. Add the egg and pulse until the mixture just comes together as a dough.  ", "Divide the pastry into eight portions and shape into balls. Flatten a pastry ball slightly and roll out on a lightly floured surface to a 3mm/½in thickness. Use the pastry to line a loose-bottomed individual tart tin. Trim any excess pastry and prick the base with a fork. Repeat with the remaining pastry balls and chill in the fridge for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "Line each tart case with greaseproof paper and baking beans and bake in the oven for 20 minutes. Remove the paper and beans and return to the oven for a further 10 minutes, or until the pastry is pale golden-brown. ", "Remove the tart cases reduce the oven to 170C/325F/Gas 3.", "Melt the butter and oil in a large non-stick frying pan. Fry the pear slices for 1-2 minutes on each side, or until lightly  browned on both sides. Remove from the pan and set aside to drain on kitchen paper. ", "Beat the eggs in a bowl until smooth, then stir in the crème fraîche and sage. Season with a good pinch of salt and lots of freshly ground black pepper. ", "Divide the Stilton amongst the tartlet cases. Add the pear slices and scatter with the walnut pieces. Slowly pour over the egg mixture, topping up each tart case when the liquid has had a chance to settle.", "Bake for 25-30 minutes or until the filling is just set. Remove the tarts from the oven and set for 15 minutes before carefully removing from the tart tins."]}, {"isVegetarian": true, "title": "Dolcelatte and watercress soufflé", "url": "www_bbc_co_uk_food_recipes_dolcelatteandwatercr_85113", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz Dolcelatte cheese, chopped", "2 free-range egg yolks", "2 tbsp chopped watercress ", "3 free-range egg whites", "salt and freshly ground black pepper", "25g/1oz unsalted butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat two ovenproof blini pans or small frying pans in the oven to 200C/400F/Gas 6.", "Place the cheese, egg yolks and watercress into a bowl and mix well.", "In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed. ", "Fold the egg white mixture into the cheese mixture and season with salt and freshly ground black pepper.", "Remove the pans from the oven, divide the butter between the pans and spoon in the soufflé mixture. Return to the oven and bake for ten minutes, or until risen and golden-brown.", "To serve, place the pans onto plates."]}, {"isVegetarian": false, "title": "Dolmades", "url": "www_bbc_co_uk_food_recipes_dolmades_72399", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dolmades_72399_16x9.jpg", "ingredients": ["120g/4¼oz long-grain rice, cooked", "250g/8¾oz minced lamb", "1 tsp dried oregano", "1 small onion, finely chopped", "3 tbsp finely chopped parsley", "3 tbsp finely chopped celery", "salt and freshly ground black pepper", "1 tbsp tomato purée", "250g/8¾oz preserved, drained vine leaves", "2 tomatoes, sliced", "2 garlic, cloves sliced", "1 lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "First, make the filling. In a bowl, combine the rice, meat, onion, herbs, celery, salt and pepper. Fold in the tomato purée.", "Place one vine leaf on a plate, vein side up. Take a heaped teaspoon of the filling and place in the centre of the leaf near the stem edge. Fold the stem end up over the filling then fold both sides towards the middle and roll up like a small cigar. Don't roll too tightly as the rice will expand.", "Line the bottom of a large ovenproof dish with a layer of tomato slices or left over vine leaves. This will prevent the stuffed leaves from sticking to the bottom and burning. ", "Pack the stuffed leaves in layers on top, pushing small pieces of garlic between them. Sprinkle with lemon juice and add around 150ml/5¼fl oz cold water. Cover with oiled foil.", "Place the leaves in the oven for 45 minutes, adding extra water if necessary. Serve."]}, {"isVegetarian": false, "title": "Irish beef stew", "url": "www_bbc_co_uk_food_recipes_donals_irish_beef_stew_85494", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/donals_irish_beef_stew_85494_16x9.jpg", "ingredients": ["2 tbsp vegetable oil ", "1 kg/2lb 4oz beef stewing steak, cut into 2.5cm/1in chunks", "2 onions", "3 celery stalks", "4 large carrots", "1 litre/ 1¾pint beef stock  (from stock cubes)", "900g/2lb potatoes", "25g/1oz unsalted butter", "sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. First cook the beef by placing a large saucepan over a high heat, add 1 tablespoon of the oil and brown the beef pieces. Do this in batches so the pan isn't too full. Remove the beef from the pan and set aside on a plate. Don't clean the pan, as you'll need this to fry the vegetables.", "While the beef is frying, peel and chop the onions and carrots and slice the celery.", "Heat the remaining oil in the same saucepan and fry the onion, celery and carrot for 4–5 minutes or until the onions have softened. Scrape any cooked on bits from the bottom of the pan. That will add flavour to the stew. Season with salt and pepper. ", "Mix the beef in with the vegetables, then take the pan off the heat. Tip the meat and vegetables into a large ovenproof dish and pour the stock over the top.", "Peel and slice the potatoes into ½cm/¼in thick slices and arrange over the top of the beef. Dot the butter over the top then cover tightly with foil. Bake for 1 hour then remove the foil and bake for a further 15 minutes until the potatoes are crisp and golden-brown. Serve in deep bowls. "]}, {"isVegetarian": true, "title": "Doorstep vanilla cheesecake with rum punch roasted pears, figs and toasted hazelnuts", "url": "www_bbc_co_uk_food_recipes_doorstep_vanilla_66658", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter", "250g/9oz digestive biscuits", "2 tbsp soft light brown sugar", "800g/1lb 12oz full-fat cream cheese", "1 lemon, zest only", "1 vanilla pod, split in half lengthways and seeds removed", "800ml/1⅓ pint fridge-cold double cream", "75g/2½oz icing sugar", "6 fresh figs, halved", "4 ripe pears, cored and cut into quarters lengthways", "2-4 tbsp maple syrup", "250ml/9fl oz dark rum or apple juice", "1 vanilla pod, split in half lengthways ", "1 cinnamon stick, broken in half", "1 sprig fresh rosemary, left whole", "1 orange, zest only", "25g/1oz toasted hazelnuts"], "serves": "Serves 8-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cheesecake, put the butter in a large saucepan over a low heat and leave to melt.", "Meanwhile, put the biscuits in a plastic food bag, seal it and crush the biscuits using a rolling pin, until you have fine crumbs. (Alternatively pulse them in a food processor.) Tip the crushed biscuits and sugar into the melted butter. Mix together.", "Push the mixture into the base of a deep 23cm/9in springform cake tin. Really pack in tight by pressing it down with your hands or the back of a spoon. Place in the fridge to firm up while you make the topping.", "In a large bowl, mix the cream cheese, lemon zest and vanilla seeds until smooth. Pour the double cream into a separate bowl and sift in the icing sugar. Whisk until it is almost the same consistency as the cream cheese, just a little looser.", "Tip the cream into the cream cheese mixture and mix everything gently. Remove the base from the fridge and tip the mixture onto the base. Smooth the top with the back of a spoon. Cover with cling film and put into the freezer for about 30 minutes, until just set. Or place in the fridge for 4 hours.", "For the pears, figs and hazelnuts, preheat the oven to 160C/140C Fan/Gas 3 and line a baking tray with baking paper. ", "Put the chopped fruit on the tray and drizzle with maple syrup, to taste. Drizzle with rum or apple juice and top with the vanilla pod, cinnamon stick, rosemary and orange zest. Mix together until combined and cover in aluminium foil. Roast for 30 minutes, then remove the foil and cook for a further 20 minutes, basting the fruit with the juices. Remove the rosemary before serving.", "To serve, remove the cheesecake from the freezer 10 minutes before serving. Cut into wedges and serve the roasted fruit and hazelnuts alongside."]}, {"isVegetarian": true, "title": "Double-baked mushroom soufflé with mushrooms, shallots and baby leeks", "url": "www_bbc_co_uk_food_recipes_double-baked_mushroom_97325", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter", "1 tbsp olive oil", "2 shallots, peeled and left whole", "100g/3½oz mushrooms", "1 garlic clove, finely chopped", "small bunch baby leeks, trimmed", "2 tbsp olive or rapeseed oil", "90g/3¼oz unsalted butter, plus extra for greasing", "40g/1½oz plain flour, plus extra for dusting", "150g/5½oz wild mushrooms", "350ml/12fl oz milk", "225g/8oz cheddar, grated", "1 tsp Dijon mustard", "3 free-range eggs, separated", "250ml/9fl oz double cream", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mushrooms and shallots, preheat the oven to 220C/200C Fan/Gas 7.", "Heat 50g/1¾oz of the butter and the oil in a small, ovenproof frying pan over a medium heat. Add the shallots, then transfer the pan to the oven and roast the shallots for 15 minutes, or until tender.", "Remove the roasted shallots from the pan and set aside. Once cool enough to handle, separate the shallots into 'petals' by peeling each whole layer.", "Place the same pan over a medium heat, then add the remaining butter, the mushrooms and the garlic and fry for 3-4 minutes, or until softened and starting to brown.", "For the baby leeks, blanch the baby leeks in a large saucepan of boiling, salted water for 1-2 minutes. Drain and refresh in a bowl of ice-cold water.", "Heat a griddle pan over a high heat. Rub the leeks all over with a little oil. Add the leeks to the griddle pan and chargrill for 2-3 minutes on all sides, or until golden-brown chargrill marks appear.", "Keep all of the vegetables warm until ready to serve.", "For the soufflés, preheat the oven to 180C/160C Fan/Gas 4. Grease the base and sides of 4 ramekins with a little butter, then dust with flour, shaking out any excess. Place the ramekins into a deep roasting tray.", "Heat 50g/1¾oz of the butter in a frying pan over a medium heat. Add the mushrooms and fry for 1-2 minutes, or until softened. Season, to taste, with salt and freshly ground black pepper.", "Melt the remaining butter in a large saucepan over a medium heat. Whisk in the flour to form a thick paste (known as a roux). Cook the roux over a low heat for a further 2-3 minutes, stirring with a wooden spoon.", "Gradually whisk in the milk, a little at a time, whisking constantly to prevent any lumps from forming. Once all of the milk has been incorporated into the roux, reduce the heat to its lowest setting and continue to cook for a further 2-3 minutes, or until the mixture is thick enough to coat the back of a spoon.", "Stir in 125g/4½oz of the cheese, as well as the mustard and cooked mushrooms. Beat in the egg yolks and season again with salt and pepper, to taste.", "In a clean, dry bowl, whisk the egg whites until stiff peaks form when the whisk is removed. Fold the egg whites carefully into the soufflé mixture.", "Divide the mixture equally among the prepared ramekins. Pour enough boiling water into the roasting tray to reach halfway up the sides of the ramekins. Carefully transfer the roasting tray to the oven and bake the soufflés for 15-20 minutes, or until they have risen and are evenly browned.", "Remove the soufflés from the roasting tray and set aside on a heatproof surface for 5 minutes.", "Preheat the grill to its highest setting.", "Run a round-bladed knife around the inner edges of the ramekins, then turn out each soufflé into an individual ovenproof dish.", "Pour one-quarter of the cream into each dish, coating the top of each soufflé. Sprinkle over the thyme and the remaining cheddar, then grill the soufflés for 3-4 minutes, or until the cheese is bubbling and golden-brown.", "To serve, place the soufflé dishes onto serving plates. Spoon the mushrooms, shallots and baby leeks alongside."]}, {"isVegetarian": true, "title": "Doris Grant loaf", "url": "www_bbc_co_uk_food_recipes_doris_grant_loaf_16985", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/doris_grant_loaf_16985_16x9.jpg", "ingredients": ["225g/8oz strong white bread flour, plus extra for dusting", "225g/8oz strong wholemeal flour", "1 tsp salt", "1 x 7g sachet fast-action dried yeast", "1 tbsp clear honey", "300ml/11fl oz warm water", "vegetable oil or oil spray, for oiling", "a little milk, for brushing"], "serves": "Makes 1 small loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Dust a medium baking tray well with flour.", "Sift the flours and salt into a large bowl. Reserve a tablespoon of the grain – the brown bits that are too big to fit through the sieve. Stir the rest through the flour mixture. Stir in the yeast, then make a big hole in the centre and pour in the honey and most of the water. Mix well to form a smooth dough, working it gently with your hands if necessary. If the dough feels a bit stiff, add more of the water. ", "Shape the mixture into a ball and place on the prepared baking tray. Make sure the top is smooth and wrinkle-free. Cover the dough loosely with oiled clingfilm, making sure it is airtight, and leave to rise in a warm place for a good hour, or until it has almost doubled in size.", "Preheat the oven to 200C/400F/Gas 6. Remove the clingfilm from the dough and make a few slashes in the top with a sharp knife – I use a sharp, serrated knife and saw gently. Brush the loaf with milk, sprinkle with the reserved grain and then place in the oven.", "Put about 10 ice cubes into the bottom of the oven – they will produce steam, which keeps the crust from hardening too quickly. (A quickly hardened crust prevents the bread from rising well.) Bake the bread for 30–40 minutes, or until it has risen, sounds hollow when tapped underneath and comes easily off the baking tray. Remove from the oven and leave to cool on the tray. ", "Serve fresh from the oven with loads of butter. These loaves do not keep well. However, if the whole lot does not disappear in one sitting, slice up the remainder and put it in the freezer to eat as toast."]}, {"isVegetarian": false, "title": "Pepper and coriander tuna with noodles and tomato and soy vinaigrette", "url": "www_bbc_co_uk_food_recipes_dgheth_86895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz tuna loin", "dash olive oil", "1 tsp peppercorns, crushed", "½ tsp coriander seeds, crushed", "150g/5½oz brown rice vermicelli noodles", "4 spring onions, halved lengthways", "dash olive oil", "150g/5½oz broccoli, cut into florets", "dash sesame oil", "pinch ground coriander", "1-2 tbsp soy sauce", "2 tbsp tomato ketchup", "2 tbsp soy sauce", "½ lemon, juice only", "dash olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Firstly, rub the tuna loin in a little olive oil, then roll in the crushed peppercorns and coriander seeds. ", "Drizzle the tuna with a little more olive oil, heat a griddle pan until smoking hot and add the tuna. Cook for two minutes on each side and remove from the heat. Set aside and keep warm.", "For the noodles, place the rice noodles into a bowl of cold water and leave to soak for five minutes, or until softened. Drain well. ", "Rub the spring onions in olive oil, heat a griddle pan until smoking hot, and add the spring onions. Griddle for 3-4 minutes and set aside. ", "Meanwhile, carefully drop the broccoli florets into a pan of gently boiling water and boil for three minutes. Drain well. ", "Heat a dash of olive oil in a wok, add the blanched broccoli florets and stir-fry for one minute. Add the griddled spring onions, sesame oil, ground coriander and soy sauce and cook for a further one minute. ", "Add the soaked and drained noodles to the wok and toss together.", "For the tomato and soy sauce vinaigrette, whisk together all the vinaigrette ingredients in a small bowl.", "To serve, pile the noodles and griddled vegetables onto a serving plate, top with the tuna and drizzle with vinaigrette."]}, {"isVegetarian": true, "title": "Double baked cheese soufflés", "url": "www_bbc_co_uk_food_recipes_double_baked_cheese_94727", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/double_baked_cheese_94727_16x9.jpg", "ingredients": ["1 small onion, peeled, cut into wedges", "275ml/10fl oz whole milk, plus extra for topping up if needed", "1 bay leaf", "40g/1½oz butter, plus extra for greasing", "40g/1½oz plain flour", "100g/3½oz mature cheddar, coarsely grated", "1 tsp English mustard (or 2 tsp Dijon mustard)", "freshly grated nutmeg, to taste", "salt and freshly ground black pepper", "3 free-range eggs, separated", "1 heaped tbsp chopped chives, plus extra for garnish", "50g gruyere or mature cheddar, finely grated", "6 tbsp double cream"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflés, preheat the oven to 200C/400F/Gas 6. Generously butter 6x150ml/5fl oz ovenproof ramekins and line the bases with a disc of baking parchment. Place on a baking tray. ", "Put the onion into a saucepan with the milk and bay leaf. Bring to a gentle simmer over a low heat and cook for 5 minutes to infuse the flavours. Watch carefully to ensure the pan doesn’t boil over. Remove from the heat and set aside for a couple of minutes.", "Melt the butter in a medium non-stick saucepan over a low heat. Remove from the heat and stir in the flour with a wooden spoon. Once combined, return to the heat and cook for a minute, stirring as it cooks and begins to bubble. Remove from the heat. ", "Strain the milk through a sieve into a jug and discard the onion and bay leaf. You’ll need around 250ml/9fl oz of infused milk, so discard any excess or top up as needed with fresh milk. ", "Gradually stir the milk into the flour and butter paste, then return to the heat and cook for 2 minutes, bringing to the boil, stirring constantly. The sauce will become smooth and thick. Add the Cheddar, mustard and a grating of nutmeg and continue to cook for a further 1–2 minutes more until the cheese melts.", "Stir in the chives and season to taste. The seasoning can be quite strong at this point, as the mixture will be bulked out with egg whites later. Transfer the cheese sauce to a heatproof bowl and leave to stand for 5 minutes.", "Once the mixture has cooled, beat in the egg yolks one at a time until thoroughly mixed. ", "Whisk the egg whites in a bowl until stiff peaks are formed when the whisk is removed. Fold about one-fifth of the egg whites into the cheese mixture with a large metal spoon (this slackens the mixture and makes folding the remaining egg whites in easier). Then gently fold in the remaining egg whites  to preserve the volume you have created. ", "Spoon the soufflé mixture into the ramekins until it almost reaches the top. Bake in the centre of the oven for 15-20 minutes until very well risen and golden-brown on top. (Do not open the oven door for the first 10 minutes of cooking). Once cooked, remove the tray from the oven and leave the soufflés to cool in their ramekins.", "When the soufflés are cold, line a baking tray with baking parchment and slide a knife around the edge of each ramekin. Carefully turn the soufflés out onto your hand. remove the baking paper disc from the base. Place on the tray upside down. The soufflés can now be covered with cling film and chilled for up to 24 hours before being baked again.", "For the second baking, preheat the oven to 200C/400F/Gas 6. Fifteen minutes before serving, remove the cling film from the soufflés, and sprinkle with the grated gruyere or cheddar. Spoon a tablespoon of double cream over each soufflé, allowing it to run down the sides. Bake for 10 minutes until the soufflés are hot and the cheese topping has melted. Serve immediately, sprinked with extra chives if using. "]}, {"isVegetarian": true, "title": "Double chocolate mousse entremets", "url": "www_bbc_co_uk_food_recipes_double_chocolate_mousse_23581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2⅓oz unsalted butter, softened", "70g/2⅓oz icing sugar", "2 free-range egg whites", "40g/1½oz plain flour, sifted", "40g/1½oz cocoa powder, sifted", "2 free-range egg whites", "10g/⅓oz caster sugar", "60g/2¼oz ground almonds", "60g/2¼oz icing sugar", "2 free-range eggs ", "20g/¾oz plain flour, sifted", "20g/¾oz unsalted butter, melted", "150g/5½oz plain chocolate (36% cocoa solids), chopped", "knob of butter", "2 free-range eggs, separated ", "1 tbsp brandy (optional)", "100ml/3½fl oz double cream", "300g/10½oz white chocolate, chopped", "100ml/3½fl oz double cream", "1 free-range egg white", "100g/3½oz fresh berries (raspberries and blueberries work well)", "icing sugar, for dusting"], "serves": "Makes 6 entremets", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease and line a 33x23cm/13x9in Swiss roll tin with baking parchment. Cut a sheet of baking silicone to fit the base of the Swiss roll tin.  Line a baking tray with baking parchment and lay the silicone sheet on top. ", "For the decorative paste, cream the butter and icing sugar together until light and fluffy. Gradually add the egg whites, beating continuously.  Fold in the flour and cocoa powder until combined.  ", "Spread the paste thinly and evenly over the silicon mat using a palette knife.  Drag a pastry comb diagonally through the paste to form a pinstripe pattern, scraping off the excess mixture after each drag.  Place the paste in the freezer for 15 minutes. ", "For the joconde sponge, preheat the oven to 220C/200C(fan)/Gas 7. ", "Whisk the egg whites in a bowl until stiff peaks form when the whisk is removed. Add the caster sugar, one teaspoon at a time, whisking between each addition to make a glossy meringue. Cover with cling film and set aside. ", "Tip the ground almonds and icing sugar into the bowl of a freestanding mixer and add the whole eggs. Whisk together for 3-5 minutes, or until doubled in volume. Fold in the flour, and then gently fold in the meringue in three separate batches. Pour the melted butter down the side of the bowl and fold in, until incorporated. ", "Remove the silicone sheet with the decorative paste from the freezer and place into the base of the lined Swiss roll tin. ", "Tip the joconde sponge mixture over the pinstripe paste and level the surface with a palette knife. Bake for 5-7 minutes, or until pale, golden-brown and springy to touch.", "Place a sheet of baking parchment over a cooling rack and turn the cake out onto it. Peel off the baking parchment and silicon sheet from the base of the cake and leave to cool completely.", "Line the sides of 6 x 6.5cm/2½in chefs’ rings with baking parchment.  Cut a rectangular template measuring 17x5cm/6½x2in, from a piece of parchment paper.", "When the sponge is cooled, trim the edges and cut out six rectangles of sponge using the template. Wrap the cake strips inside the cake rings, stripey side facing out. Once wrapped inside the rings, gently push and press the ends to meet together to make a seamless cake. You want the joconde to fit very tightly pressed up to the sides of the cake rings. ", "Using a small 4cm/1½in round cutter, cut out small circles from the cake trimmings and push them into the base of the cake rings.  ", "For the dark chocolate mousse, place the chocolate in a bowl set over a pan of simmering water (ensure the bottom of the bowl does not touch the water). Melt slowly and do not allow the chocolate become too hot. \u2028", "Stir in the butter and mix until combined. Add the egg yolks and brandy and set aside to cool a little. ", "In a bowl, whisk the egg whites until stiff peaks form when the whisk is removed. Fold into the chocolate mixture until completely incorporated. ", "Whip the cream until soft peaks form when the whisk is removed. Fold into the chocolate and egg white mixture. ", "Spoon the mousse into a disposable piping bag and pipe into the cake lined rings, until the mousse comes three-quarters of the way up the sponge. Chill them in the freezer while you make the white chocolate mousse. ", "For the white chocolate mousse, place the chocolate in a bowl set over a pan of simmering water (do not allow the bottom of the bowl to touch the water). Melt very gently, but do not allow the chocolate to become too hot. \u2028 ", "In a bowl, whisk the egg whites until stiff peaks form when the whisk is removed.  Fold into the white chocolate mixture. ", "In a bowl, whip the cream until soft peaks form when the whisk is removed and fold into the white chocolate mixture. ", "Spoon the white chocolate mousse into a disposable piping bag and pipe on top of the chocolate mousse until it reaches the top of the cake rings. Chill in the fridge until set.", "Once set, turn out of the cake rings and place on serving plates.  Top with the raspberries and blueberries and dust with icing sugar. "]}, {"isVegetarian": true, "title": "Double-baked goats' cheese soufflés", "url": "www_bbc_co_uk_food_recipes_doublebakedgoatschee_86260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225ml/8fl oz milk", "½ onion", "12 black peppercorns", "25g/1oz butter, plus extra for greasing", "25g/1oz plain flour, plus extra for dusting", "2 free-range eggs, separated", "1 tbsp fresh thyme leaves", "100g/3½oz semi-hard goats' cheese, grated", "salt and freshly ground black pepper", "watercress, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the milk, onion and peppercorns into a pan over a medium heat and bring to scalding point (but do not boil). Strain the milk into a bowl and discard the onion and peppercorns.", "Meanwhile, melt the butter in a clean pan over a medium heat. Add the flour and stir well for one minute to create a paste.", "Gradually add the heated milk, a little at a time, waiting for the flour to bubble before adding more milk and stirring between additions. Keep adding to create a smooth sauce.", "Remove the pan from the heat, then add the egg yolks and thyme and whisk to combine.", "Add 75g/2½oz of the goats' cheese, season with salt and freshly ground black pepper and stir well.", "Whisk the egg whites until stiff peaks form when the whisk is removed.", "Add a small spoonful of the egg whites to the cheese sauce and mix well. ", "Gradually add generous spoonfuls of the egg whites to the cheese sauce, gently folding the whites into the sauce, until the whites are completely combined with the sauce.", "Butter and flour four 150g/5oz ramekins and divide the cheese mixture among them.", "If cooking to serve immediately, sprinkle the soufflés with the remaining goats' cheese; if planning to store and reheat, reserve the cheese for later.", "Transfer the soufflés to an ovenproof dish and add enough water to the dish to come a third of the way up the ramekins.", "Carefully place into the oven to bake for 15-18 minutes, or until risen. ", "The soufflés can be cooled and stored in the fridge, or even frozen, to be cooked later. If reheating, defrost or remove from the fridge, top with the remaining cheese and place into an oven preheated to 180C/365F/Gas 4 and bake for 8-10 minutes, or until heated through. ", "To serve, place the soufflés onto plates and place a handful of watercress alongside."]}, {"isVegetarian": true, "title": "Doughnuts", "url": "www_bbc_co_uk_food_recipes_doughnuts_89027", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/doughnuts_89027_16x9.jpg", "ingredients": ["1 tbsp yeast", "4 tbsp caster sugar", "150ml/5¼fl oz milk, warmed", "225g/8oz plain flour, plus extra for dusting", "¼ tsp salt", "50g/2oz butter, melted", "1 free-range egg, beaten", "300ml/10½fl oz vegetable oil, for deep-frying", "jam of your choice"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the yeast with half a teaspoon of the sugar and two tablespoons of the warm milk. Place in a warm place to rest for 15 minutes, or until frothy. ", "Sift the flour and salt into a large bowl. Stir in one tablespoon of the sugar.", "Make a well in the flour and pour in the yeast mix, the rest of the milk, the melted butter and the egg. Mix to make a dough and then knead, cover the bowl and leave to stand for 45 minutes, or until the dough has doubled in size.", "On a floured work surface, knead the dough for five minutes, then divide into 12 balls and place in a warm place for 30 minutes, or until they have doubled in size.", "Heat the oil in a deep pan until it reaches 190C/375F, or a cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave  unattended.)", "Gently lower the dough balls one at a time into the hot oil, in batches of two or three, and fry for 3-5 minutes or until golden-brown, and then carefully turn over. Remove from the hot oil with a slotted spoon and drain on kitchen paper. ", "Roll the hot doughnuts in the remaining sugar. Make a small slit in the doughnut with the tip of a knife, and fill with a teaspoon of jam. Serve."]}, {"isVegetarian": true, "title": "Douglas fir pine custard with blood orange curd and coconut tuille", "url": "www_bbc_co_uk_food_recipes_douglas_fir_pine_custard_60315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz double cream", "1 sprig Douglas fir pine", "6 egg yolks", "50g/1¾oz sugar", "300ml/10½fl oz whole milk", "4 blood oranges, zest and juice", "110g/4oz butter", "175g/6oz caster sugar", "4 free-range eggs, beaten", "50g/1¾oz unsalted butter", "85g/3oz fresh or desiccated coconut", "85g/3oz icing sugar, sifted", "25g/1oz plain flour", "2 egg whites"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the custard, in a saucepan, bring the double cream and milk to the boil.", "In a bowl, whisk the egg yolks and caster sugar together. Pour the hot cream and milk onto the eggs, whisking as you go.", "Return to the pan and place on a low heat. Gently cook the custard, stirring all the time, until it’s thick enough to coat the back of a spoon, or reaches 82C/180F on a cooking thermometer. Add the fir sprig and bring back to the boil. Take the custard off the heat and allow the fir to infuse for up to an hour while the custard cools. ", "Pass through a fine sieve into a bowl. Cover the surface with cling film to prevent a skin forming and leave to chill in the fridge.", "For the blood orange curd, place the orange zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water).", "Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through.", "Remove from the heat and allow to cool completely.", "For the coconut tuilles, preheat the oven to 180C/350F/Gas 4 and line a baking tray with a silicone mat or baking parchment. ", "Melt the butter, then leave until cool, but still runny. ", "Blend the coconut in a food processor until finely ground, but not powdery. Add in the icing sugar and flour, and blend again, then add the egg whites followed by the cooled butter and blend until you have a smooth, slightly runny paste. ", "Put a teaspoon of the mixture on the silicone and spread with the back of a dessertspoon into a neat thin 7cm/3in circle. Repeat to fill the tray with circles.", "Bake for seven minutes, or until pale golden-brown around the edges. Remove and scrape off on to a wire rack to cool. To shape, press each one over a rolling pin as it cools, to make a curved tuille.", "To serve, put some of the orange curd onto serving plates. Whip the custard to foam it and layer it on top of the curd. Top with coconut tuilles."]}, {"isVegetarian": false, "title": "Dover sole and langoustine tail with asparagus tops and samphire drizzled with a white wine sauce", "url": "www_bbc_co_uk_food_recipes_dover_sole_and_08196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium-sized langoustines ", "1 whole Dover sole, about 600g/1lb 5oz", "salt and freshly ground black pepper", "200ml/7fl oz fish stock", "100ml/3½l oz white wine", "1 small bouquet garni", "1 shallot, finely chopped", "8 small to medium-sized asparagus", "50g/1¾oz samphire or seaweed \"sea lettuce\"", "50g/1¾oz unsalted butter", "½ lemon, juice only", "2 tbsp snipped chives"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Steam the langoustines for 5-6 minutes in a steamer. Remove the langoustines from the steamer and carefully remove the shell from the body as soon as it is cooked, taking care as it will be hot.  ", "Separate the heads from the body. Crush them with the back of a wooden spoon or a rolling pin and reserve.  Remove the tails from their shells. Reserve the tails to serve, and discard the remaining shell.", "Fillet and skin the Dover sole and then lightly season the fillets with salt.  Place the fillets flat in a lightly buttered shallow baking tray with the fish stock and white wine, then poach for 3-4 minutes by bringing to simmering point.  Quickly turn each fillet over in the liquor.  Immediately remove from heat.  ", "Carefully remove the fillets from the cooking liquor and set aside in a warm place.  Pour the cooking liquor into a pan.", "Add the crushed head of langoustine to the pan of sole cooking liquor with the bouquet garni and chopped shallot.", "Simmer on medium heat until the volume of this liquid has been reduced by two-thirds. Meanwhile, prepare the asparagus: asparagus with thicker stalks will naturally snap at the woodiest part of the spear. Young asparagus spears are more tender and don’t need to be snapped before cooking.", "Steam the asparagus for about five minutes, add the samphire (or seaweed) to the asparagus and cook for one minute.  Set aside.", "Pass the reduced liquid through a fine metal sieve, pressing firmly with the back of a ladle.  Reduce a little further if needed.", "Add the butter to the reduced liquid to make a sauce, either by gently whisking or gentle rotation of the pan.  Season to taste with salt and pepper.", "To serve, arrange the asparagus and samphire on two plates.", "Place the sole on the vegetables.  Arrange the langoustine tail to curl around the sole. Generously drizzle the sauce over the sole and langoustine. Pour over the lemon juice and sprinkle with the snipped chives."]}, {"isVegetarian": false, "title": "Dover sole with crab-crushed Jersey Royals and sauce grenoble", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_53504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 500g/1lb Dover soles (8 fillets), skinned and filleted", "1 tbsp vegetable oil", "250g/9oz Jersey Royal potatoes", "250g/9oz fresh white crabmeat, picked", "3 lemons, juice only", "salt and freshly ground black pepper", "200g/7oz butter", "110g/4oz caperberries", "110g/4oz gherkins, finely diced", "2 tbsp chopped fresh chives", "1 bunch Jersey asparagus", "1 punnet baby pea shoots", "1 punnet baby basil", "1 handful crôutons"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the fillets of sole on top of each other, with the first fillet facing one way then the other facing the other way (like building a sole wall!) so that you have an eight-fillet high wall.", "Skewer the sole fillets together with six cocktail sticks and trim off the ends, then slice the stacked fillets neatly in half. ", "Heat a non-stick frying pan until hot, add the vegetable oil and then the sole fillets; cook until coloured on one side. ", "Once one side is golden-brown, flip the sole fillets over and then place on a tray in the oven for 15 minutes.", "Meanwhile, place the potatoes in a saucepan of salted, boiling water and boil for about 5-10 minutes, or until cooked (the cooking time depends on the size of the potatoes). ", "Drain and return the potatoes to the pan and crush lightly using a fork, then add the crabmeat and a squeeze of the lemon juice and mix well.", "Add salt and freshly ground black pepper to taste. Keep the mixture warm.", "Return the frying pan used for the fish to the heat, then add the butter and cook until it is brown in colour; add the caperberries and gherkins and heat through.", "Add the chopped chives and the juice from two of the lemons (reserve another squeeze of lemon juice for the fish). ", "Remove the sole from the oven and gently twist out the cocktail sticks. Squeeze over the remaining lemon juice.", "Bring a pan of salted water to the boil, add the asparagus and boil for 10 seconds. Drain and keep warm.", "To serve, place a spoonful of the potato into a metal ring in the centre of each of two plates and top with a stack of Dover sole.", "Spoon the caperberry and gherkin butter over and around the fish, then scatter the cress and crôutons around the plate.", "Top the sole with some asparagus and serve straightaway."]}, {"isVegetarian": false, "title": "Dover sole with chorizo, gnocchi and artichoke stew", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_chorizo_77345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dry mashed potato", "1 free-range egg", "3 tbsp chives, finely chopped", "125g/4½oz “00” pasta flour", "salt and freshly ground black pepper", "4 x 700g/1lb 9oz Dover soles, skinned and filleted", "50g/1¾oz butter", "4 tbsp olive oil", "400g/14oz chorizo, preferably from pata negra pigs, sliced", "12 baby purple artichokes, trimmed and halved", "3 tbsp dry sherry", "250ml/9fl oz chicken stock", "200ml/7fl oz double cream", "2 tomatoes, skinned, seeds removed, diced", "2 tbsp finely chopped fresh chives", "2 tbsp roughly chopped fresh chervil", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the gnocchi, place the dry mashed potato, egg and chives into a bowl and mix well.", "Gradually add the flour, beating well between each addition then season with salt and freshly ground black pepper.", "Place the dough onto a floured work surface and roll out to a thickness of 2cm/¾in.", "Cut the gnocchi into pieces about 2cm/¾in long, then press the top of each one lightly with a fork.", "Bring a pan of salted water to the boil, then drop in the gnocchi and return the water to the boil. When the gnocchi rise to the surface, cook for a further three minutes, then drain well and refresh in iced water. Remove the gnocchi from the iced water with a slotted spoon and set aside.", "For the stew, season the fish fillets with a little salt. Heat a frying pan until medium hot, add the butter and one tablespoon of the olive oil and heat until foaming.", "Add the fish and fry the fillets on each side for two minutes until just cooked through. Remove the fish from the pan and set aside in a warm place.", "Heat a sauté pan until hot, add the remaining olive oil and the chorizo and fry for 2-3 minutes, or until the oil from the chorizo begins to run and the chorizo is crisp.", "Add the artichokes to the pan, fry for one minute, then add the sherry and chicken stock and bring to a simmer. ", "Cook for two more minutes or until the artichokes are just tender, then add the gnocchi and gently stir them through the sauce.", "Add the cream, simmer for a couple of minutes, then add the tomatoes and most of the chives and chervil. Season with salt and freshly ground black pepper, then add the lemon juice to taste.", "To serve, lay the fish on one side of the plate, spoon the chorizo, gnocchi and artichoke stew alongside and scatter over the remaining chives."]}, {"isVegetarian": false, "title": "Dover sole with clams", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_clams_50002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Dover sole, filleted", "160g/5⅔oz clams", "800g/1lb 12oz waxy potatoes as Desirée, sliced into 7mm-thick rounds", "1 large red onion, sliced", "1 large white Spanish onion, sliced", "3 garlic cloves, sliced", "2 bay leaves", "5 tbsp olive oil", "sea salt and pepper", "3 tbsp olive oil", "2 garlic cloves", "1 slice of bread, crusts removed, cut into 1cm/½in cubes ", "20 blanched almonds", "1 handful flatleaf parsley leaves", "200ml/7fl oz fish stock, hot", "salt and pepper", "vegetable oil, for deep frying", "1 bunch cherry tomatoes on the vine", "2 tbsp chopped fresh parsley", "drizzle olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the potatoes, bring a large pan of salted water to the boil. Add the sliced potatoes, bring back to the boil and cook for two minutes. Drain well.", "In a large roasting tin, mix the potatoes, onions, garlic, bay leaves and olive oil together. Season with salt and pepper. Roast for 15 minutes then turn all the vegetables over and return them to the oven for another 15 minutes, or until the vegetables are cooked and caramelised.", "Meanwhile, for the sauce, heat the olive oil in a frying pan. When hot, add the garlic, bread cubes and almonds and fry until the bread cubes are golden-brown and crisp. Add the parsley then immediately drain the mixture and reserve any excess oil. Place the mixture in a food processor and pulse. Gradually add the reserved oil and the hot fish stock, blending all the time, until you have a smooth sauce.", "Season with salt and pepper, to taste. Transfer the sauce to a clean saucepan. Just before serving, reheat the sauce.", "For the Dover sole, season the fillets with salt and pepper and roll individually. Place them in an oven tray and bake in the oven for 6-8 minutes (at 220C/425F/Gas 7). ", "Clean the clams in cold running water. Discard any with cracked shells. Discard any open clams that do not close when given a sharp tap.", "Heat a saucepan with a lid and place the clams in the pan with a little water. Cook for 2-3 minutes until they open.  Discard any clams that stay closed.", "For the cherry tomatoes, heat the oil in a deep-fat fryer, or fill a large, deep, heavy-based pan two-thirds full with vegetable oil. Heat the oil to 180C/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended). Fry the tomatoes for 1-2 minutes.", "To serve, divide the potatoes between four warmed plates, place the fish on top and finish with the sauce and clams. Finish with some chopped parsley, tomatoes and some fresh olive oil."]}, {"isVegetarian": false, "title": "Dover sole with lime and ginger", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_lime_and_52911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp plain flour", "½-1 tsp chilli powder", "salt and freshly ground black pepper", "2 Dover sole, scaled, cleaned and trimmed (dark skin removed if you can, otherwise you could slash it in several places with a sharp knife), or other fish of your choice", "1–2 tbsp vegetable or rapeseed oil", "12 asparagus spears", "140g/5oz unsalted butter", "50g/2oz chopped fresh root ginger", "4 tbsp lime juice (about 3 limes)", "30g/1¼oz fresh pomegranate seeds", "2 tbsp chopped fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the fish, heat the oven to 200C/400F/Gas 6. Mix together the flour, chilli powder and some salt and pepper, and dust the fish in it, then shake off any excess. Heat a large, non-stick, ovenproof frying pan over a medium-high heat; use two frying pans if the fish are too large to fit in a single pan. (If you have no ovenproof pans, then preheat a lightly oiled baking tray.) ", "Add the oil and heat it until it hazes. Add the sole (skin-side down if you’ve part-skinned them) and fry, without moving them, for 3-4 minutes, or until they form a golden-brown crust. Turn over and transfer the frying pan to the top of the hot oven (or transfer the fish to the warmed baking tray and place in the oven), and cook for a further 8–10 minutes, or until cooked through and the flesh is opaque. ", "Meanwhile, bring a large pan of salted water to the boil, drop in the asparagus and simmer for three minutes, or until just tender. Remove from the water, drain and set aside.", "For the sauce, melt the butter in a frying pan over a medium heat, and let it bubble for 2-3 minutes, or until it turns a nut-brown colour. Reduce the heat to low, add the ginger, lime juice, pomegranate seeds and chopped coriander and warm it through; don’t overheat it or it will separate. Season to taste. Serve the sole with the asparagus and spoon the sauce over the top."]}]