[{"isVegetarian": false, "title": "How to make trifle", "url": "www_bbc_co_uk_food_recipes_how_to_make_trifle_89033", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trifle_89033_16x9.jpg", "ingredients": ["500g/1lb 2oz frozen summer fruit (raspberries, blackberries, strawberries, blackcurrants and redcurrants work well)", "50g/2oz caster sugar, or more to taste", "2 tbsp blackcurrant or raspberry liqueur (cassis or Chambord)", "500ml/18fl oz cloudy apple juice", "5 sheets leaf gelatine ", "250g/9oz madiera cake", "250g/9oz mascarpone", "500ml/18floz ready-made vanilla custard", "300ml/½ pint whipping cream ", "handful toasted almonds or hazelnuts, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the fruit into a saucepan, add the sugar, then cook gently until the sugar has dissolved and the liquid is slightly syrupy. Remove half of the berries and juice to a bowl, stir in a tablespoon of cassis, then set aside to cool. ", "Add the apple juice to the fruit in the pan, and bring to a simmer. Taste the fruit, and add a little more sugar if necessary. Remove from the heat, and add the remaining cassis. ", "Soak the gelatine leaves in a bowl of cold water for five minutes, until soft and floppy. Lift the gelatin from the water and squeeze out the excess liquid.", "Add the gelatine to the fruit in the pan and stir until it has completely dissolved. Remove from the heat, and transfer the jelly mix to a bowl. Allow to cool, then chill in the fridge until the mix has set to a softly wobbling jelly.", "Cut the madeira cake into 1cm/½in slices. Give the fruity jelly a stir - it should be softly set. Layer the cake, jelly, fruit and juice in the bottom of a trifle dish (roughly 20cm/8in diameter).", "For the custard layer, put the mascarpone into a large bowl then add the custard. Whisk together until creamy and smooth. Spoon the custard over the fruit and sponge. ", "Whip the cream until soft peaks form when you remove the whisk from the mixture. ", "Spoon the cream over the top of the trifle, starting from the outside and working in. This will avoid the cream sinking into the custard.  ", "Chill the trifle for an hour before serving. ", "Finish with a scattering of toasted almonds."]}, {"isVegetarian": false, "title": "How to make Thai green curry paste", "url": "www_bbc_co_uk_food_recipes_how_to_make_thai_green_67270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_thai_green_67270_16x9.jpg", "ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "1 shallot, finely chopped ", "4 green bird’s-eye chillies, chopped", "4 garlic cloves, crushed", "thumb-sized piece fresh root ginger, grated", "1 lemongrass stalk, finely chopped", "pinch salt", "small bunch fresh coriander, stalks and leaves", "2 dried kaffir lime leaves", "1 tbsp fish sauce ", "pinch ground white pepper"], "serves": "Makes enough for one curry, serving four people", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly toast the coriander and cumin seeds in a dry frying pan, until fragrant. ", "Place the seeds into a pestle and mortar, and add the shallot, chillies, garlic, ginger, lemongrass and salt. Pound to a paste with the pestle. Alternatively, you can use a food processor to do this. ", "Cut the coriander stalks into chunks, and set aside the leaves to add to the finished curry. Add the coriander stalks and crumble the dried kaffir lime leaves to the mix, and continue to grind until fairly smooth. ", "Add the fish sauce and a pinch of white pepper. The curry paste is now ready to use. If not using immediately, the paste can be stored in a jar topped with a little oil and will keep in the fridge for a couple of weeks."]}, {"isVegetarian": false, "title": "Bake-in-a-bag fish", "url": "www_bbc_co_uk_food_recipes_how_to_make_trout_en_49680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trout_en_49680_16x9.jpg", "ingredients": ["2 tbsp olive oil", "¼  fennel bulb, finely sliced ", "½ onion, finely sliced", "salt and freshly ground black pepper", "1 medium tomato, sliced", "2 fish fillets, about 175g/6oz each, such as cod, sea bass or trout", "olive oil, drizzle ", "squeeze lemon juice", "1 tbsp chopped dill (optional)", "1 tsp capers (optional)", "2-3 tbsp white wine (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Cut out two squares baking paper about 40cm/16in square, and two squares of tin foil the same size. Lay a square of baking paper on top of each piece of foil.", "Heat the oil in a frying pan and fry the fennel and onion with some salt and pepper for 2-3 minutes, until softened. Divide the fennel and onions between the two squares of baking paper, and layer on the sliced tomatoes then put a fish fillet on top of each heap. Drizzle over some olive oil, a squeeze of lemon juice, and season with salt and freshly ground black pepper. Sprinkle over the chopped dill and a few capers, if using.", "Fold the foil and paper over the fish and double-fold each edge to make a sealed parcel, leaving a gap at the top to pour in a few tablespoons of white wine (if using). Pour in the wine, then fully seal the parcel, but not be too tight, as it needs to expand in the oven as it cooks.", "Place the parcels on a baking tray and bake for 12-14 minutes, or until the fish is just opaque and cooked through. Serve the parcels on each plate so they can be opened at the table."]}, {"isVegetarian": true, "title": "Spicy Mexican eggs (huevos rancheros)", "url": "www_bbc_co_uk_food_recipes_huevosrancherosranch_84543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/huevosrancherosranch_84543_16x9.jpg", "ingredients": ["3 kale leaves, finely chopped", "1 onion, finely chopped", "1 green pepper, finely chopped", "1 red pepper, finely chopped", "1 small bird's eye chilli, finely chopped", "1 courgette, finely chopped", "1 garlic clove, finely chopped", "150ml/5fl oz tomato passata", "1 tbsp olive oil", "knob of butter", "8 free-range eggs", "salt and freshly ground black pepper", "handful fresh coriander leaves", "2 soft flour or corn tortillas, warmed in the oven", "hot chilli sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salsa, put the kale, onion, peppers, chilli, courgette, garlic and passata into a bowl. Season with salt and pepper and mix well.", "Heat the oil in a medium lidded frying pan over a medium heat and add a quarter of the salsa. Stir to warm through, then make a hole in the middle of the salsa. Place the butter in the clear area in the middle of the pan, then break 2 eggs into this space.", "Put the lid on the pan and cook for 3-4 minutes. The dish is ready when the eggs are cooked into the salsa and the whites are firm. Slide the eggs and salsa onto a large plate and keep warm as you repeat this process three more times.", "To serve, sprinkle each dish with coriander leaves and serve the warm tortillas and chilli sauce alongside."]}, {"isVegetarian": true, "title": "Hugh's wastenot soup", "url": "www_bbc_co_uk_food_recipes_hughs_wastenot_soup_75817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 bendy carrots, peeled, if you like", "1 onion, peeled", "1-2 small potatoes, peeled ", "1-2 squishy tomatoes", "a little oil or butter, for frying", "water or stock made from a cube", "1 bag salad (tired), washed if necessary", "salt and pepper", "curry powder, to taste (optional)", "leftover hummus, to taste (optional)", "3-4 slices slightly stale bread", "oil, for shallow frying"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roughly chop the carrot, onion and potato. Cut the tomatoes in half and rub the cut-side on a coarse cheese grater to get the pulp, and leave the skin behind.", "Heat a little oil or butter in a medium saucepan over a medium heat. Fry gently until the onion and carrot start to soften (about 5 minutes). Add the tomatoes and then the potato pieces.", "Just cover with plain water or stock. Bring to a simmer and keep simmering until the potatoes are tender (about 10 minutes).", "Next, add the bag of salad and cook for another 2-3 minutes, until wilted. Season with a bit of salt and pepper. Add a good pinch of curry powder if you like.", "Blend the soup, either in the saucepan using a stick blender, or transfer to a blender. Blend until fairly smooth (some texture is fine) - then return to the pan.", "Stir the hummus (if using) gently into the soup. Taste and add more salt and pepper if required. ", "To serve, fry the bread lightly and serve with the soup. Enjoy!"]}, {"isVegetarian": true, "title": "Hummus", "url": "www_bbc_co_uk_food_recipes_hummus_80249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 410g/14oz tin chickpeas, rinsed and drained", "4 tbsp water or vegetable stock", "2 large cloves garlic", "3 tbsp tahini (sesame paste)", "3 tbsp lemon juice", "salt, to taste", "1 tbsp olive oil", "chopped fresh parsley", "olive oil", "pine nuts, fried ", "paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat chickpeas and four tablespoons of water or vegetable stock in a saucepan. ", "When warmed through, place the chickpeas and two tablespoons of the stock or water in a food processor. Blend until roughly combined. Add the garlic, tahini and lemon juice and a couple of large pinches of salt and blend again. ", "Add the olive oil and blend again until hummus is the desired texture. ", "Serve on a flat dish topped with a drizzle of olive oil, some parsley, fried pine nuts and a sprinkling of paprika."]}, {"isVegetarian": true, "title": "Hummus chickpea burgers", "url": "www_bbc_co_uk_food_recipes_hummus_chickpea_burgers_94137", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hummus_chickpea_burgers_94137_16x9.jpg", "ingredients": ["3-4 tbsp sunflower oil", "1 onion, roughly chopped", "2 garlic cloves, thinly sliced", "1 tsp ground cumin", "1 tsp ground coriander", "400g tin chickpeas, drained and rinsed", "100g/3½oz hummus", "50g/2oz plain flour", "½ tsp salt", "freshly ground black pepper", "50g/2oz pine nuts or cashews", "8 pitta breads, warmed", "mixed green salad", "8 tbsp plain yoghurt (optional)", "8 tsp chilli sauce"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 1 tablespoon of the oil in a non-stick frying pan over a medium heat. Add the onion and garlic and fry gently for 4-5 minutes, or until softened, stirring regularly. Stir in the cumin and coriander and fry for 1-2 minutes, or until fragrant. Remove from the heat and set aside to cool for 5 minutes. ", "Place in a food processor, add half of the chickpeas and all of the hummus and flour. Season with salt and pepper. Blend to a rough paste. ", "Add the remaining chickpeas and the pine nuts. Pulse for a few seconds until the chickpeas and pine nuts have broken down but retain some texture. Season to taste.", "Divide the chickpea mixture into 8 portions. Roll each  into a ball, flatten between your palms into a burger shape approximately 1.5cm/½in thick. ", "Heat the remaining oil in a large, non-stick frying pan. Add the burgers in batches and fry for 3-4 minutes on each side, or until golden-brown and crisp on both sides and heated through. ", "Serve the burgers in pitta breads stuffed with salad leaves, with a dollop of yoghurt and chilli sauce alongside."]}, {"isVegetarian": false, "title": "Hungarian pork stew", "url": "www_bbc_co_uk_food_recipes_hungarian_pork_stew_63624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz lard", "1 large onion, thinly sliced", "2–3 tbsp paprika", "1.8kg/4lb pork steak, diced", "1 tsp tomato purée", "1 green pepper, thinly sliced", "3 medium tomatoes, sliced", "salt and freshly ground black pepper", "1 tbsp cornflour"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the lard in a lidded frying pan, add the onion and fry for five minutes, or until softened. Remove the pan from the heat and stir in the paprika, adding more or less to taste. Add the pork and a splash of water. Simmer over a low heat for about 5 minutes. ", "Add enough boiled water to cover the meat, bring back to the boil and add the tomato purée, green pepper and tomatoes. Season with salt and freshly ground black pepper. Cover with a lid and simmer for 1 hour or until the pork is tender. ", "To thicken the sauce, mix the cornflour and two tablespoons of cold water to form a paste, then stir into the stew. Bring to the boil again to thicken. Check the seasoning, and season with salt and freshly ground black pepper to taste.", "Serve the stew with creamy mashed potato, or macaroni. The dish also goes well with finely sliced cucumber which can be lightly pickled with a splash of white wine vinegar and a sprinkling of caster sugar. "]}, {"isVegetarian": true, "title": "Hyderabadi biryani of vegetables in a pumpkin shell", "url": "www_bbc_co_uk_food_recipes_hyderabadi_biryani_of_73883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz basmati rice", "3 green cardamoms", "2 bay leaves", "4 cloves", "2 blade mace", "1 tbsp cumin", "3 tbsp salt", "1 tbsp chilli flakes", "100g/3½oz tamarind purée", "½ tsp salt", "1 large pumpkin, top removed, seeds and flesh scraped out", "2 medium onions, sliced and deep fried until golden-brown", "2 tbsp ginger and garlic paste", "1 tbsp red chilli powder", "1 tsp turmeric", "1 tsp garam masala", "1/8 nutmeg grated", "6 green chillies, slit lengthways", "½ bunch fresh coriander, chopped", "1 lemon, juice only", "2 tbsp vegetable oil", "150ml/5fl oz natural yoghurt", "75ml/2½fl oz single cream", "1 tsp salt", "1 tsp sugar", "½ turnip, cut into 1cm/½in cubes ", "1 carrot, cut into 1cm/½in cubes ", "½ swede, cut into 1cm/½in cubes ", "¼ celeriac, cut into 1cm/½in cubes ", "½ sweet potato with orange flesh, cut into 1cm/½in cubes ", "2 Jerusalem artichokes, cut into 1cm/½in cubes ", "10 fine beans, chopped", "200g/7oz Portabello mushrooms, cut into 1cm/½in cubes  ", "½g saffron", "50ml/2fl oz warm milk", "50g/1¾oz ghee", "2 tbsp rosewater or kewra water (screw pine essence)", "1 small bunch mint, chopped", "a little dough made from flour and water, optional, to seal the pumpkin lid", "50g/1¾oz raisins, for garnish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Wash the rice and soak in cold water for 20 minutes.", "For the pumpkin, mix the tamarind, chilli and salt and smear it on the inside of the hollowed out pumpkin. Bake it in the oven (without the pumpkin lid) for 30-50 minutes. When cooked, remove from the oven and set aside.", "Mix all the ingredients for the marinade. ", "For the vegetables, place all the vegetables in a heavy-based casserole and add the marinade. Set aside for 15 minutes. ", "For the rice, boil 3 litres/5¼ pints of water and add the whole spices and salt. ", "When the water is boiling, add the strained soaked rice and boil for about 6-8 minutes until two-thirds cooked then drain using a colander.", "Meanwhile bring the vegetables to a simmer over a low heat.", "Preheat the oven to 200C/400F/Gas 6.", "To finish, soak the saffron in the warm milk for 3-5 minutes then mix in the ghee and rosewater (or kewra water) and set aside.", "Fill the bottom of the pumpkin with layers of the vegetables and rice, sprinkling some chopped mint and the soaked saffron mix over the rice as you go. ", "Put on the pumpkin lid. You may wish to seal the lid using some dough to create a pressure cooking effect.", "Bake in the oven for 20-25 minutes.", "To serve, take the lid off the pumpkin and garnish the rice with raisins."]}, {"isVegetarian": false, "title": "Iberico pork pluma with spring onion and black pepper miso", "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_with_01362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz freshly ground black peppercorns ", "400g/14oz spring onions, finely chopped", "60g/2¼oz garlic, finely chopped", "250g/9oz white miso paste", "large pinch sea salt ", "50ml/2fl oz soy sauce", "5 tbsp rice vinegar ", "5 tbsp vegetable oil", "20g/¾oz carrot, cut into fine julienne strips", "20g/¾oz cucumber, cut into fine julienne strips", "20g/¾oz daikon, cut into fine julienne strips", "20g/¾oz leek, white part only, cut into fine julienne strips", "10g shiso leaves (available online), cut into fine julienne strips", "3 tbsp freshly squeezed lemon juice", "pinch sea salt", "2 pork pluma (each weighing approximately175-225g/6-8oz), trimmed", "100g/3½oz unsalted butter", "50ml/2fl oz vegetable oil", "5 tbsp rice vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the miso, put all of the ingredients in a blender and blend until smooth. This will make more miso than required, but it will keep in the fridge for weeks and can be rubbed on almost any meat", "For the salad, mix all of the ingredients together, put in a colander and wash under running water for about 10 minutes. Drain well.", "For the salad dressing, mix the lemon juice and salt together. ", "To cook the pork pluma, heat a non-stick frying pan to medium heat and add the butter and oil.", "Rub the pork heavily with the miso rub and place in the pan. Cook for about 2-3 minutes on each side or until cooked through. Remove from the pan and leave to rest for 1 minute. ", "Remove the pan from the heat and de-glaze it with the rice vinegar. Add a tablespoon of the fresh miso to mix through to make a sauce.", "Lightly dress the salad just before serving. ", "Slice the pork and place on a serving plate with a spoon of sauce and the salad on top. "]}, {"isVegetarian": true, "title": "‘I can’t believe you made that’ cake", "url": "www_bbc_co_uk_food_recipes_i_cant_believe_you_made_90494", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/i_cant_believe_you_made_90494_16x9.jpg", "ingredients": ["vegetable oil or oil spray ", "200g/7oz butter, softened ", "200g/7oz caster sugar", "4 free-range eggs ", "140g/5oz plain flour", "60g/2½oz cocoa powder ", "pinch salt ", "2 tsp baking powder ", "400g/14oz plain, milk, or white chocolate cigarillos (about 75–80 in total) ", "250g/9oz butter, softened ", "500g/1lb 2oz icing sugar ", "100g/3½oz good dark chocolate (at least 70 per cent cocoa solids), melted and slightly cooled ", "fresh flowers, for a Christening cake ", "strawberries or raspberries, for the girls ", "figs, quartered, for the boys "], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180/C/350F/Gas 4 and line a 20cm/8in round deep cake tin with baking paper and brush or spray with oil. ", "Cream together the butter and sugar in a large bowl until they begin to go pale. Add half of the eggs and half of the flour and mix well. Add the rest of the eggs, flour, cocoa powder, salt and baking powder and beat for a minute or two until the mixture is uniform. Dollop into the prepared tin and bake in the oven for about 30–40 minutes, or until a skewer inserted in the middle comes out clean. Leave to cool in the tin. ", "Meanwhile, make the buttercream: put the butter and icing sugar in a bowl and whisk together until the mixture goes fluffy. Add the cooled, melted chocolate and whisk for a further two minutes. ", "Once the cake is completely cool, remove it from the tin. Carefully cut the top flat with a large serrated knife. (Eat this bit as a chef’s perk!) ", "Turn the cake upside down on a 20cm/8in cake board so that the bottom now becomes a nice flat top. Split the cake horizontally and sandwich the top and bottom together with a 1cm/½in layer of buttercream. ", "Spread half of the remaining buttercream all over the top and sides of the cake, making it as smooth as possible. Put it in the fridge to set before doing another layer - this makes it much easier to get neat squared-off edges. ", "Gently push the cigarillos vertically onto the sides of the cake, positioning them as straight as possible and making sure they touch the bottom. ", "The next step is up to you - I can’t tell you the wide-eyed looks you’ll get when you walk into a room holding this finished cake.  Serve with a self-satisfied grin. "]}, {"isVegetarian": false, "title": "Iberian pork jowl with squid salad", "url": "www_bbc_co_uk_food_recipes_iberian_pork_jowl_with_92104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Iberian pork jowl, thinly sliced", "6 anchovies", "1 tbsp olive oil ", "10g flatleaf parsley leaves, finely chopped", "100g/3½oz croûtons", "4 black or red tomatoes, cut into thin wedges", "3 spring onions, chopped", "½ shallot, peeled and thinly sliced", "2 medium squid, cleaned, cut and scored ", "100g/3½oz sweet chorizo, cut into cubes", "6 tbsp olive oil, preferably Spanish", "2 tbsp Moscatel or white wine vinegar", "salt and freshly ground black pepper", "½ bunch chervil, finely chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the Iberian pork jowl, place the slices on four plates and cover with the anchovies. Drizzle with the olive oil and scatter over the parsley and croûtons. Set aside. ", "For the squid salad, place the tomato, spring onion and shallot in a bowl. Cook the squid in a frying pan for 60–90 seconds on each side over a medium heat. Season with salt and pepper, cut the squid into 2cm/¾in thick rings and set aside. Add the chorizo to the pan with 1 tablespoon of the olive oil and sweat for 30–40 seconds. ", "Add the squid and chorizo to the bowl of tomato salad. Mix together the remaining oil and the vinegar in a small bowl and season with salt and pepper. Pour the oil dressing over the salad, stir and then divide the salad between the four pork jowl plates. Garnish with the chervil and serve immediately. "]}, {"isVegetarian": false, "title": "Iberico pork pluma, herb vinaigrette and piquillo pepper purée", "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_herb_48331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/2¾oz sea salt", "40g/1½oz caster sugar", "sprig thyme", "4 x 200g/7oz Iberico pluma", "2 tbsp olive oil", "½ bunch parsley, finely chopped", "¼ bunch oregano, finely chopped", "1 garlic clove, crushed", "1 green chilli, seeds removed and finely chopped", "¼ tsp cumin seeds, crushed", "¼ tsp sweet paprika ", "½ shallot, finely chopped", "50ml/2fl oz red wine vinegar", "100ml/3½fl oz extra virgin olive oil", "salt and freshly ground black pepper", "1 shallot, thinly sliced", "1 garlic clove, thinly sliced", "olive oil", "150g/5½oz piquillo peppers", "25ml/1fl oz sherry vinegar", "50ml/2fl oz chicken stock", "50g/1¾oz cooked chickpeas", "¼ tsp cumin seeds, crushed", "¼ tsp sweet paprika", "1 tsp salt", "vegetable oil, for deep-frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the brine, put 1 litre/1¾ pint water and all the ingredients in a saucepan and heat until the salt and sugar dissolve. Leave to cool then place the pork in the brine, cover and leave in the fridge for 2 and a half hours. Remove from the brine, rinse well in fresh cold water and pat dry.", "To make the herb vinaigrette, mix all the ingredients in a bowl and season with salt and pepper.", "To make the pepper purée, gently cook the shallots and garlic in olive oil for 5 minutes. Add the peppers followed by the vinegar and chicken stock. Cook for 5 minutes then blitz in a blender. Season to taste with salt and pepper.", "For the chickpeas, heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Deep-fry the chickpeas for 2 minutes. Mix the spices and salt together, drain the chickpeas and season with the spiced salt.", "Lightly oil the pork on both sides and place on a hot griddle. Cook for 2 minutes then flip over and cook for a further 2-3 minutes. ", "To serve, slice the pork and place on a large plate, spoon the vinaigrette over the top then add a spoon of purée to the side. To finish, scatter the chickpeas over the pork."]}, {"isVegetarian": false, "title": "Ice box cake", "url": "www_bbc_co_uk_food_recipes_ice_box_cake_59770", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, softened", "250g/9oz granulated sugar", "4 free-range eggs", "5 tbsp strong cold espresso coffee", "4 tbsp chicory and coffee essence, such as Camp", "650g/1lb 7oz plain flour", "50g/1¾oz cocoa powder", "2 tsp bicarbonate of soda", "1 tsp salt", "1 litre/1¾ pint double cream", "1 tbsp chicory and coffee essence, such as Camp", "125ml/3½fl oz stem ginger syrup", "42 coffee biscuits ", "3 balls stem ginger, thinly sliced"], "serves": "Serves 10-14", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the ice box coffee biscuits, place the butter and sugar into a bowl and beat until light and fluffy, then add the eggs and beat well.", "Add the cold coffee and coffee essence and mix well. Fold in the flour, cocoa, bicarbonate of soda and salt and bring together to form a firm dough.", "Press into a 2cm/¾in thick block, then wrap in cling film and place in the fridge for one hour to rest.", "Preheat the oven to 180C/350F/Gas 4.", "Roll the dough out to 5mm/¼in thick, then stamp out into discs using a 7cm/2¾in diameter plain biscuit cutter.", "Place onto a baking tray and bake for 8-10 minutes, or until just risen and firm to touch.", "For the cake, whisk the double cream with the coffee essence in a bowl until it just holds soft peaks when the whisk is removed from the bowl, then fold in the stem ginger syrup and coffee essence.", "Take a large plate or cake stand and place a little cream on the base, then place a 25cm/9in round cake board on top.", "Dollop two spoonfuls of cream in the middle and spread out to within 2cm/¾in of the edge, then place one biscuit in the centre and six around it in a circle. Spread a layer of cream over the top, making sure the biscuits are still visible at the side.", "Repeat the process layering up the biscuits like bricks, until you have used up all the cream and all the biscuits, finishing with a layer of cream.", "Place in the fridge overnight but preferably for 24 hours so that the biscuits soften.", "Decorate the top of the cake with the slices of stem ginger. Serve cut into slices straight from the fridge."]}, {"isVegetarian": true, "title": "Iced berries with limoncello white chocolate sauce", "url": "www_bbc_co_uk_food_recipes_iced_berries_with_63709", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_berries_with_63709_16x9.jpg", "ingredients": ["250ml/9fl oz double cream", "4 tbsp limoncello liqueur", "200g/7oz white chocolate, finely chopped", "500g/1lb 2oz frozen mixed berries (unthawed)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the double cream and two tablespoons of the limoncello in a milk pan, and heat it until just about to come to the boil, but not actually boiling.", "Take the pan off the heat and add the white chocolate, then swirl the pan about so that it is all submerged.", "Take the berries out of the freezer and arrange them in a single layer in a dish or plate that has a small lip (so that the sauce doesn’t drip off later). Sprinkle with the remaining two tablespoons of limoncello and leave for five minutes, during which time you can swirl your white chocolate pan about every now and again to help the chocolate melt into the lemony cream.", "Using a rubber spatula, gently stir the chocolate-cream mixture, still off the heat, until it’s smooth, then pour it over the berries and serve immediately."]}, {"isVegetarian": true, "title": "Sour cherry and almond iced buns", "url": "www_bbc_co_uk_food_recipes_iced_buns_15490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white bread flour ", "2 tsp salt ", "40g/1½oz caster sugar ", "2 x 7g sachets fast-action yeast", "40g/1½oz unsalted butter, softened ", "150ml/5fl oz full-fat milk ", "2 tsp ground green cardamom ", "2 tsp ground nutmeg ", "250ml/9fl oz full-fat milk ", "40g/1½oz caster sugar ", "2 medium free-range egg yolks", "20g/¾oz cornflour ", "¼ tsp fine sea salt ", "1 tsp almond extract", "50ml/2fl oz whipping cream", "300g/10½oz sour cherries (drained weight)", "300g/10½oz jam sugar", "1 tbsp lemon juice", "cherry essence flavouring", "Morello cherry essence flavouring", "1 pasteurized egg white", "1 tbsp lemon juice", "250g/9oz icing sugar, sifted", "400ml/14fl oz double cream ", "4 tbsp icing sugar, sifted", "50g/1¾oz slivered almonds, toasted ", "green cardamom powder, for dusting ", "icing sugar, for dusting"], "serves": "Makes 16 iced buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, put the flour into the bowl of a freestanding mixer fitted with a dough hook. Add the salt and sugar to one side of the bowl and the yeast to the other.  Add the butter, milk and 150ml/5fl oz water. Mix until a dough forms then knead in the mixer for 5 minutes. Cover the bowl with cling film and leave to prove in a warm place for 1 hour, or until doubled in size. ", "Once the dough has proved, divide it into 2 equal parts. Flatten each piece of dough out and add the cardamom to one and the nutmeg to the other. Knead to distribute the spices and knock out the air. ", "Divide each piece of dough into 8 equal parts. Roll the cardamom dough into balls and the nutmeg dough into fingers. Place on baking trays, cover and leave to prove for 30 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 5. Bake the bread for 10 minutes.   ", "For the almond custard, warm the milk and sugar in a saucepan. In a bowl, whisk together the egg yolks and cornflour.  Slowly add the hot milk to the egg mixture stirring all the time. Return to the pan and heat, stirring all the time, until thickened. Remove from the heat and add the salt and almond extract. Cover the surface with cling film and leave to cool completely. ", "Whip the cream until soft peaks form, then fold into the cooled custard.   ", "For the sour cherry jam, drain the cherries and blend them to a paste in a blender. Transfer to a saucepan and add the sugar and lemon juice. Boil the mixture until it reaches 105C on a sugar thermometer.  Remove from the heat and stir in the cherry flavourings. Pass through a sieve and leave to cool completely. When cool transfer to a piping bag fitted with a small plain nozzle.", "For the royal icing, beat the egg white and lemon juice using a wooden spoon until frothy, then add 3 tbsp icing sugar and beat again. Keep beating and adding a few tablespoons of icing sugar until all the icing sugar is incorporated and you have a smooth paste (if the icing is too thick add a little water to slacken). Transfer to a piping bag fitted with a plain nozzle.", "For the Chantilly cream, add the cream and icing sugar to a large bowl. Whip until soft peaks form when the whisk is removed. Transfer to a piping bag fitted with a large star nozzle and leave in the fridge. ", "To assemble the cardamom and almond buns, cut the buns in half horizontally and fill them with the almond custard. Pipe icing on top of the bun, top with toasted almonds, a sprinkling of cardamom powder and a dusting of icing sugar. ", "To assemble the nutmeg and sour cherry fingers, make a deep slit lengthways in the top of the bread fingers. Pipe icing on both sides of the slits and leave to set.", "Pipe some cherry jam in the bottom of the slit. Pipe the cream neatly on top and pipe two stripes of cherry jam at either side of the cream. "]}, {"isVegetarian": true, "title": "Iced fingers", "url": "www_bbc_co_uk_food_recipes_iced_fingers_34133", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_fingers_34133_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "50g/1¾oz caster sugar", "40g/1½oz unsalted butter, softened", "2 free-range eggs", "2 x 7g/¼oz sachets instant yeast", "2 tsp salt", "150ml/5fl oz warm milk", "140ml/4½fl oz water", "200g/7oz icing sugar", "5 tsp cold water", "200ml/7fl oz whipping cream ", "100g/4oz strawberry jam", "icing sugar, for dusting"], "serves": "Makes 12 buns", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the dough, place all the ingredients into a large bowl, holding back a quarter of the water. Stir the mixture with your hands, then slowly add the remaining water to form a dough and knead in the bowl for four minutes.", "Turn the dough onto a lightly floured surface and knead well for 10 minutes or until the dough is smooth and elastic. Return the dough to the bowl, cover with a damp tea towel and leave to rise in a warm place for one hour.", "Divide the dough into 12 pieces, each about 70g/2½oz, then roll into balls and shape into fingers about 13cm/5in long.", "Place the dough fingers onto a greased baking tray, leaving space for them to double in size, then set aside in a warm place for 40 minutes. They should just touch each other when they’ve risen. Bake in the oven for 10 minutes then set them aside to cool.", "For the icing, sift the icing sugar in a wide bowl and gradually stir in the cold water to form a thick paste. ", "Dip the top of the cooled fingers into the icing, smoothing it with your finger, then leave to set on a wire rack.", "Lightly whip the cream and spoon it into a piping bag fitted with a small nozzle. Spoon the strawberry jam into another piping bag.", "Sliced the iced fingers horizontally, leaving one long edge intact. Pipe in a generous line of whipped cream into the middle of each finger, then a thinner line of jam. Dust the iced fingers with icing sugar and serve. "]}, {"isVegetarian": true, "title": "Iced peppermint and chocolate parfait", "url": "www_bbc_co_uk_food_recipes_iced_peppermint_and_37509", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz milk", "200ml/7fl oz double cream", "1 vanilla pod, split and seeded", "5 free-range eggs, yolks only", "50g/1¾oz caster sugar", "1 large bunch peppermint, leaves picked", "3-4 drops peppermint essence", "3 free-range eggs, whites only", "150g/5½oz caster sugar", "450ml/16fl oz double cream", "115g/4oz dark chocolate, roughly grated", "75g/2¾oz caster sugar", "50g/1¾oz chopped hazelnuts", "115g/4oz dark chocolate, 70% cocoa solids", "2 tbsp demerara sugar", "3-4 drops peppermint essence"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the crème anglaise, place the milk, cream, vanilla pod and seeds into a saucepan and bring to the boil.", "Place the egg yolks and caster sugar into a bowl then pour over the hot milk mixture and whisk to combine.", "Pour the mixture back into the saucepan, bring to a simmer and cook until just thickened, stirring all the time. Remove the pan from the heat and divide the mixture - ¼ into one bowl for the hazelnut custard, and ¾ into another for the peppermint parfait.  ", "Blanch the peppermint leaves in boiling water for 30 seconds then drain and refresh in iced water. ", "Pour the ¾ of the crème anglaise into a food processor with the peppermint leaves and peppermint essence and blend to a very fine, pale green purée. Strain through a fine sieve into a clean bowl and allow to cool.", "For the parfait, grease a loaf tin with a little vegetable oil then line with two layers of cling film.", "In a clean mixing bowl, whisk the egg whites until they form soft peaks. Fold in the sugar to make a raw meringue mixture then whisk it into the mint-flavoured crème anglaise.", "Place the cream into a clean bowl and whip until it forms soft peaks. Fold the cream into the mint mixture then fold in the grated chocolate very carefully. Pour the mixture into the lined loaf tin and place in the freezer for at least four hours until firm.", "For the hazelnut custard, line a baking tray with greaseproof paper. Heat a frying pan over a high heat until hot. Add the sugar and cook until the sugar has completely melted and is sticky and golden-brown.", "Add the chopped hazelnuts and stir until they are coated in the sugar mixture, then pour the mixture onto the prepared baking tray. Set aside until the mixture has hardened.", "When the praline mixture has hardened, cover with a sheet of cling film and break into small pieces using a toffee hammer or rolling pin then place into a food processor and blend to a fine powder. Stir into the reserved ¼ of the crème anglaise.", "For the chocolate mint shards, melt the chocolate in a bowl over a pan of simmering water. Stir in the demerara sugar and peppermint essence then spoon onto baking tray lined with silicone or baking parchment and leave to set. When set, break the chocolate into large shards.", "To serve, cut the parfait into thick slices and place onto plates. Spoon a little hazelnut custard around then finish with a shard of mint chocolate. "]}, {"isVegetarian": true, "title": "Iced biscuits", "url": "www_bbc_co_uk_food_recipes_icedbiscuits_3054", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedbiscuits_3054_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened at room temperature", "100g/3½oz caster sugar", "1 medium free-range egg, lightly beaten", "275g/10oz plain flour", "1 tsp vanilla extract", "400g/14oz icing sugar", "3-4 tbsp water", "2-3 drops food colourings"], "serves": "Makes 24 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until combined.", "Beat in the egg and vanilla extract, a little at a time, until well combined.", "Stir in the flour until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using biscuit cutters, cut biscuits out of the dough and carefully place onto the baking tray.", "Bake for 8-10 minutes, or until pale golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring.", "Carefully spread the icing onto the biscuits using a knife and set aside until the icing hardens."]}, {"isVegetarian": true, "title": "Iced Christmas muffins", "url": "www_bbc_co_uk_food_recipes_icedchristmasmuffins_87589", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour ", "100g/3½oz wholemeal flour ", "2 tsp golden caster sugar", "1 tsp baking powder ", "1 lemon, zest only", "pinch ground cinnamon", "pinch ground cloves", "pinch ground star anise", "pinch ground nutmeg", "25g/1oz golden sultanas ", "25g/1oz glace cherries ", "125ml/4fl oz milk ", "1 free-range egg, beaten", "100ml/3½fl oz natural yoghurt ", "3 tbsp clear honey ", "75g/2½oz butter ", "300g/10½oz icing sugar ", "25ml/1fl oz lemon juice ", "25ml/1fl oz water", "decorative silver sugar balls, to decorate"], "serves": "Makes 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the self-raising flour, wholemeal flour, sugar and baking powder into a bowl.", "Add the lemon zest, cinnamon, cloves, star anise and nutmeg and mix well. ", "Add the sultanas and cherries and mix again.", "Place the milk, egg and yoghurt into a clean bowl and mix well.", "Place the honey and butter into pan over a medium heat and cook until the butter has melted. Stir gently to combine.", "Add the honey and butter mixture to the yoghurt and egg mixture and mix well.", "Add to the dry ingredients and fold together until just combined.", "Spoon the mixture into muffin cases and transfer to the oven to bake for 20-25 minutes, until risen and golden. Remove from the oven and leave to cool on a wire rack.", "For the icing, place the icing sugar, lemon juice and water into a bowl and mix well, until smooth.", "To serve, spread the icing on top of the muffins once they have cooled and decorate with silver sugar balls."]}, {"isVegetarian": true, "title": "Iced coffee and honeycomb parfait with vanilla custard and chocolate-coated coffee beans", "url": "www_bbc_co_uk_food_recipes_icedcoffeeparfaitwit_88170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "400g/14oz caster sugar", "110ml/4fl oz clear honey", "2 tbsp liquid glucose (available from the baking section of most supermarkets)", "110ml/4fl oz water", "1½ tsp bicarbonate of soda", "3 free-range eggs, separated", "110ml/4fl oz cold espresso coffee", "150g/5oz caster sugar", "450ml/16fl oz double cream", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150ml/5fl oz double cream", "1 vanilla pod, split", "75g/3oz plain chocolate, chopped", "25g/1oz roasted espresso coffee beans"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the honeycomb, line a baking tray with greaseproof paper and grease with vegetable oil. ", "Place the sugar, honey, liquid glucose and water into a saucepan and bring to a boil. ", "Continue to cook until the temperature reaches 160C/320F on a sugar thermometer, taking care as sugar at this temperature can be very dangerous.", "Remove from the heat and quickly beat in the bicarbonate of soda with a wooden spoon, stirring constantly.", "Pour the mixture onto the lined baking tray. Set aside until hard and then break into pieces using your hands.", "For the parfait, place the egg yolks, coffee and half of the sugar into a small frying pan and whisk to combine. ", "Place over a low heat and cook gently, stirring occasionally, for about ten minutes, or until the mixture thickens.", "Remove from the heat and pour through a metal sieve into a mixing bowl. Whisk until the mixture cools and is light and fluffy. Set aside.", "In a clean mixing bowl, whisk the egg whites to form soft peaks when the whisk is removed from the bowl. Fold in the remaining sugar to make a raw meringue mixture.", "Whisk the meringue mixture into the set-aside coffee mixture.", "Place the cream into a separate bowl. Whip the cream until soft peaks form when the whisk is removed from the bowl. Fold the cream into the coffee mixture.", "Line a rectangular loaf tin with cling film. Pour half of the parfait mixture into the tin.", "Place pieces of the honeycomb on top of the parfait to cover. Pour the remainder of the parfait over the honeycomb.", "Tap to settle and cover with cling film. Place in the freezer for two hours until frozen just solid.", "For the custard, place the egg yolks and sugar in a bowl and whisk until well blended.", "Place the milk and cream into a saucepan.", "Using a sharp knife, scrape out the seeds of the vanilla pod and add to the milk mixture. Bring to the boil.", "Pour the hot milk and cream onto the eggs, whisking all the time. Pour the mixture back into the saucepan and heat gently, stirring occasionally, until the mixture thickens. Keep warm.", "For the chocolate-coated coffee beans, line a tray with greaseproof paper. Place the chocolate into a bowl and place over a pan of boiling water until melted.", "Add the coffee beans to the chocolate and stir to coat. Pour into the lined tray and allow to cool. Break into pieces when cool.", "To serve, remove the parfait from the freezer 20 minutes before serving. Cut 2cm/¾ slices of the parfait and place onto the centre of each serving plate. Spoon the custard around the edge and scatter over the chocolate coated coffee beans."]}, {"isVegetarian": true, "title": "Iced lemon curd layer cake", "url": "www_bbc_co_uk_food_recipes_icedlemoncurdlayerca_67258", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedlemoncurdlayerca_67258_16x9.jpg", "ingredients": ["1 lemon, zest only, grated", "1 tbsp lemon juice ", "175g/6oz self-raising flour, sifted ", "1 level tsp baking powder ", "175g/6oz butter, at room temperature ", "175g/6oz caster sugar ", "3 eggs ", "1 large juicy lemon, grated zest and juice only ", "75g/3oz  caster sugar ", "2 eggs ", "50g/2oz  unsalted butter ", "1 large lemon, zest only ", "50g/2oz sifted icing sugar ", "2-3 tsp lemon juice"], "serves": "12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Measure all the cake ingredients into a mixing bowl and beat - ideally with an electric hand whisk - until you have a smooth, creamy consistency. Then divide the mixture evenly  between the two tins and bake them on the centre shelf of the oven for about 35 minutes or until the centres feel springy when lightly touched with a little finger.", "While the cakes are cooking, make the lemon curd, place the sugar and grated lemon zest in a bowl, whisk the lemon juice together with the eggs, then pour this over the  sugar. Then add the butter cut into little pieces, and place the bowl over a pan of barely simmering water. Stir frequently till thickened - about 20 minutes. You don't have to stay  with it - just come back from time to time to give it a stir.", "When the cakes are cooked, remove them from the oven and after about 30 seconds turn them out on to a wire rack. When they are absolutely cold - and not before - carefully cut each one horizontally into two using a sharp serrated knife. Now spread the curd thickly to  sandwich the sponges together.", "For the icing, begin by removing the zest from the lemon - it's best to use a zester to get long, curly strips. Then sift the icing sugar into a bowl and gradually stir in the lemon juice until you have a soft, runny consistency. ", "Allow the icing to stand for 5 minutes before spreading it on top of the cake with a knife, almost to the edges, and don't worry if it runs a little down the sides of the cake. Then scatter the lemon zest over the top and leave it for half an hour for the icing to firm up before serving."]}, {"isVegetarian": false, "title": "Icelandic breaded lamb chops with spiced red cabbage", "url": "www_bbc_co_uk_food_recipes_icelandic_breaded_lamb_29809", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icelandic_breaded_lamb_29809_16x9.jpg", "ingredients": ["60g/2¼oz butter", "1 large onion, thinly sliced", "1 red cabbage (around 750g–1kg/1lb 10oz–2lb 4oz), thinly shredded", "1 large Bramley apple, peeled, cored and chopped", "50ml/2fl oz red wine vinegar", "60g/2¼oz blueberries", "2 tbsp dark brown sugar", "4 tbsp bramble jelly or jam (or redcurrant jelly)", "3 cloves", "5cm/2in length cinnamon stick", "freshly ground black pepper", "1½ tsp salt ", "16 small best-end lamb chops", "100g/3½oz plain flour", "2 free-range eggs, beaten", "100g/3½oz fresh white breadcrumbs", "60g/2¼oz butter, for frying", "2 tbsp vegetable or rapeseed oil ", "salt and pepper", "new potatoes, boiled ", "knob of butter", "1 tsp freshly chopped parsley"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the red cabbage, melt the butter in a large saucepan and gently fry the onion until soft. Add the red cabbage and cook for 2 minutes. Add the apple, vinegar, blueberries, brown sugar, bramble jelly, cloves, cinnamon stick and 125ml/4fl oz water. Season with 20 turns of a black pepper mill and the salt. Cover with a tight-fitting lid and cook for 45 minutes, then check the liquid, if drying out add a splash more water; if there is a lot of liquid in the pan, remove the lid so any excess evaporates. Cook for another 15 minutes. ", "For the lamb, season the chops with salt and pepper. Put the flour, beaten eggs and breadcrumbs in separate shallow bowls. Toss the chops in the flour, then dip in the beaten egg and coat with the breadcrumbs. ", "Heat the butter and oil in a large frying pan. Once hot, fry the chops until golden-brown all over and cooked through (about 7–8 minutes on each side). ", "To serve, remove the cinnamon stick and cloves from the cabbage. Serve the cabbage and chops with boiled new potatoes rolled in melted butter and sprinkled with chopped parsley. "]}, {"isVegetarian": true, "title": "Îles flottantes", "url": "www_bbc_co_uk_food_recipes_iles_flottantes_64016", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iles_flottantes_64016_16x9.jpg", "ingredients": ["500ml/17fl oz milk", "vanilla seeds from one vanilla pod", "4 free-range egg yolks, plus 1 whole free-range egg", "100g/3½oz caster sugar", "100g/3½oz caster sugar", "4 free-range egg whites", "500ml/17fl oz milk", "100g/3½oz caster sugar"], "serves": "Serves 3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the custard, warm the milk and vanilla seeds in a saucepan over a medium heat. Bring the mixture to a gentle simmer and simmer for 3 minutes.", "Meanwhile, in a large bowl, whisk together the egg yolks, whole egg and the sugar until pale and well combined. ", "Pour the warm milk over the egg mixture a little at a time, whisking continuously. ", "Return the custard mixture to the saucepan and cook over a medium heat, stirring continuously with a wooden spoon, for 5-10 minutes, or until the mixture thickens enough to coat the back of a spoon. Set aside to cool, then chill in the fridge.", "Meanwhile, for the meringues, sprinkle the caster sugar onto a high-sided baking tray. Cook the sugar in the oven for 4 minutes.", "In a large mixing bowl, whisk the egg whites using an electric whisk As you whisk them, gradually pour in the slightly warmed sugar, little by little, until it has all been incorporated into the mixture and stiff peaks form when the whisk is removed.", "Bring the milk to a very gentle simmer in a saucepan.", "Run a serving spoon under the tap, then take 3 oval-shaped scoops of the meringue mixture and gently lower them into the warm milk. Poach for 3-4 minutes on each side, or until cooked through. Remove from the milk using a slotted spoon and set aside to drain on kitchen paper.", "For the caramel, melt the sugar in 50ml/2fl oz water in a saucepan over a medium heat. Stir with a wooden spoon until the sugar dissolves in the water and the mixture turns copper in colour. Remove from the heat.", "To serve, ladle the chilled custard into bowls. Float one meringue 'island' on top of each portion of custard. Drizzle a trickle of caramel over each to finish."]}, {"isVegetarian": true, "title": "Iles flottantes 'façon Maman Blanc'", "url": "www_bbc_co_uk_food_recipes_ilesflottantefaconma_93228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites ", "squeeze lemon juice", "120g/4¼oz caster sugar", "1 litre/1¾fl oz pints full-fat milk, preferably organic", "2 tsp vanilla bean paste", "10 free-range egg yolks", "80g/3oz caster sugar", "ice cubes", "50ml/2fl oz water", "100g/3½oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the meringues, whisk the egg whites and lemon juice in a clean bowl until soft peaks form when the whisk is removed.", "Add the sugar a third at a time, whisking after each addition, until stiff peaks form when the whisk is removed. ", "Bring the milk and the vanilla bean paste to the boil in a large, shallow, lidded pan. Reduce the heat until the mixture is just simmering.", "Dip 2 tablespoons in hot water, then make 8 quenelles of the meringue mixture, using the spoons to shape the meringue. Carefully lower each quenelle of meringue into the simmering milk. Cover the pan with the lid and poach for 7-10 minutes, carefully turning the meringues over halfway through cooking.", "Remove the poached meringues from the pan using a slotted spoon and set aside to drain on a small tray until needed. Reserve the poaching milk and keep hot.", "For the vanilla cream, lightly whisk the egg yolks and caster sugar together in a mixing bowl, until smooth.", "Gradually add the hot milk to the egg yolks, whisking continuously, then return the custard mixture to the pan and heat over a medium heat, stirring continuously with a wooden spoon, until the custard is thick enough to coat the back of the spoon. ", "Pour the custard immediately into a large serving bowl and suspend it over a bowl of ice cubes or chilled water. Stir occasionally until the custard cools.", "When the custard has cooled, transfer to a serving bowl. Float the poached meringues on top of the cooled custard, then chill in the fridge for up to 24 hours.", "For the caramel, pour the water into a straight-sided pan, then add the sugar and cook over medium heat, until the sugar has dissolved. Once no sugar crystals remain, boil the mixture until caramelised to a dark golden-brown.", "Carefully dip the base of the pan into a bowl or sink full of cold water to prevent the caramel from cooking any further.", "Pour the caramel over the floating meringues and serve immediately."]}, {"isVegetarian": false, "title": "Indian-spiced lamb shoulder with Bombay potatoes", "url": "www_bbc_co_uk_food_recipes_indian-spiced_lamb_48529", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian-spiced_lamb_48529_16x9.jpg", "ingredients": ["1 tbsp coriander seeds", "1½ tsp cumin seeds", "1½ tsp chilli flakes ", "1½ tsp ground turmeric", "1 cinnamon stick, broken into pieces", "½ tsp fennel seeds", "½ tsp cracked black peppercorns ", "½ tsp fenugreek seeds", "¼ tsp cloves", "1 x 2.5-3kg/5lb 8oz-6lb 8oz lamb shoulder (bone in)", "2 tbsp vegetable oil", "2 onions, finely chopped", "2 long green chillies, split in half lengthways (seeds removed if desired)", "4 garlic cloves, finely chopped", "5cm/2in piece fresh root ginger, peeled, finely chopped", "1 tsp cardamom pods, lightly crushed", "8 curry leaves", "2 tbsp tamarind pulp", "1 x 400g tin chopped tomatoes", "1 litre/1¾ pints beef stock", "2 tbsp chopped fresh coriander leaves", "2 tbsp chopped fresh mint leaves", "salt and freshly ground black pepper", "750g/1lb 10oz potatoes, cut into 3cm/1¼in cubes", "4 tbsp flavourless vegetable oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp mustard seeds", "1 tsp chilli powder", "1 tsp ground coriander ", "1 tsp ground cumin", "½ tsp ground turmeric", "1 x 400g tin chopped tomatoes", "1 tbsp chopped fresh coriander ", "1 tbsp chopped fresh mint leaves", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice mix, dry fry the coriander and cumin seeds in a frying pan over a high heat for 1-2 minutes, or until fragrant. Grind to a powder with the remaining spice mix ingredients. Set aside.", "For the lamb, preheat the oven to 150C/130C Fan/Gas 2. Season the lamb all over with salt and freshly ground black pepper. ", "Heat the oil in a large, flameproof, lidded casserole over a medium heat. Add the lamb shoulder and sear for 1-2 minutes on each side, or until golden-brown all over. Remove from the pan and set aside.", "Add the onions and chillies and fry for 4-5 minutes, or until softened and just coloured. Add the spice mix, garlic and ginger, stir well, then fry for a further 1-2 minutes. Stir in the cardamom seeds, curry leaves and tamarind pulp.", "Add the chopped tomatoes and stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then cover the casserole with a lid. ", "Transfer the casserole to the oven and cook for 3-4 hours, or until the lamb is very tender. ", "Meanwhile, for the Bombay potatoes, boil the potatoes in a pan of salted water for 12-15 minutes, or until tender. Drain well. ", "Heat the oil in a large frying pan over a medium heat. Add the onion, garlic, mustard seeds, chilli powder, ground coriander, ground cumin and ground turmeric and stir well. ", "Add the chopped tomatoes, stir again, then bring the mixture to a gentle simmer.", "Add the cooked potatoes and continue to cook for a further 4-5 minutes, or until the potatoes have absorbed some of the sauce and are very tender. Season, to taste, with salt and freshly ground black pepper, then stir in the herbs.", "When the lamb shoulder is cooked, remove the lid from the casserole, baste the lamb with the sauce and cook for a further 5 minutes. Season, to taste, with salt and freshly ground black pepper, then stir in the herbs.", "To serve, spoon some of the Indian-spiced lamb onto serving plates. Serve a pile of Bombay potatoes alongside each portion."]}, {"isVegetarian": false, "title": "Indian-spiced smoked mackerel", "url": "www_bbc_co_uk_food_recipes_indian-spiced_smoked_54887", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian-spiced_smoked_54887_16x9.jpg", "ingredients": ["½ tsp garam masala ", "pinch dried red chilli flakes ", "1 tbsp butter, softened ", "2 x 100g/3½oz smoked mackerel fillets ", "2 tbsp Greek-style plain yoghurt", "1 tbsp roughly chopped fresh mint", "½ lime, juice only", "½ cucumber, halved lengthways and thinly sliced ", "6 radishes, roughly chopped", "salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the raita, mix the yoghurt, mint and a squeeze of lime juice together in a bowl and season with a pinch of salt. Stir in the cucumber and radishes, cover and place in the fridge until ready to use.", "Preheat the grill to high and line a baking tray with kitchen foil.", "In a small bowl, mix together the garam masala, chilli and butter. Spread the spiced butter onto the mackerel and place the fillets on the baking tray. Grill for 1 minute, or until the butter melts, soaking the spices into the warm fish.", "Serve the mackerel immediately with the raita."]}, {"isVegetarian": false, "title": "Indian barbecue rack of lamb and jalfrezi lamb shoulder", "url": "www_bbc_co_uk_food_recipes_indian_barbecue_rack_of_30534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-6 tbsp vegetable oil", "½ lamb shoulder, trimmed, boned and cut into 4 pieces ", "2 tsp cumin seeds", "1 onion, peeled and sliced", "2.5cm/1in piece fresh root ginger, peeled and chopped", "2 garlic cloves, peeled and chopped", "1 green chilli, seeds removed, chopped", "2 tsp garam masala", "1 tsp ground cinnamon", "4 cardamom pods, crushed", "2 cloves", "2 star anise (optional)", "600ml/20fl oz brown meat stock (lamb, chicken or beef)", "salt, to taste", "2.5cm/1in knob ginger, peeled and finely chopped", "2 garlic cloves, peeled and finely chopped", "1 tbsp vegetable oil", "100ml/3½fl oz natural yoghurt", "1 lime, zest and juice only", "salt and black pepper", "1 x 8 bone rack of lamb, French trimmed (and cut into 4 x 2-bone joints)", "300g/10½oz Charlotte potatoes, or waxy potatoes, peeled", "1 tsp ground cumin powder", "1 green chilli, chopped (seeds removed, optional)", "2 garlic cloves, peeled and finely chopped/grated", "handful of coriander, chopped", "salt and pepper", "oil, for frying", "butter, for frying", "2 tbsp vegetable oil", "1 tsp cumin seeds", "2 garlic cloves, peeled and grated", "2.5cm/1in ginger, peeled and grated", "½ green chilli, seeds removed (optional), finely diced", "1 onion, finely chopped", "1 tsp ground turmeric ", "salt", "1 aubergine, cut into chunks", "squeeze of lemon juice", "small handful of coriander, chopped", "1 small bunch fresh mint, shredded", "1 small bunch fresh coriander, shredded", "½ green chilli, finely chopped", "1cm/½in piece ginger, finely chopped", "1 small garlic clove, peeled and chopped", "1 lime, zest and juice only", "1 tsp caster sugar, to taste", "2 tbsp vegetable oil, to blend", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb shoulder, heat half of the oil in a large pan and brown the lamb shoulder with the cumin seeds until nicely coloured.  Set aside in a large bowl. ", "Heat two tablespoons of oil in a large pan and fry the sliced onion with the ginger, garlic, chilli, and all the spices. ", "Add the lamb to the pan and enough stock to just cover the meat. Put a lid on the pan and cook for 2-2½ hours, or until tender. ", "For the barbecue rack of lamb, make a paste by blending the ginger and garlic in a food processor. Transfer to a bowl and stir in the oil, yoghurt, lime zest and lime juice. Season to taste with salt and freshly ground black pepper. ", "Cover the lamb racks with the paste and leave to marinate for an hour, or longer if time allows. Heat a tandoor oven. ", "Thread the lamb racks onto skewers and roast in the tandoor oven for 12-15 minutes. Carefully remove the meat from the oven and allow to rest before carving. Carve in half to serve.", "For the cumin potato cakes, steam the potatoes for 25 minutes, or until softened. Once cool, grate half of the potatoes into a bowl and roughly crush the remaining half in a separate bowl. Combine both textures of potatoes.", "Stir in the ground cumin powder, chilli, garlic and coriander. Season to taste with salt and freshly ground black pepper. Shape into four patties or cakes using your hands.", "Heat the butter and oil in a pan and fry the cumin potato cakes until lightly browned.", "For the aubergine, heat the oil in a large pan and roast the cumin seeds with the garlic, ginger, chilli and onion for a few minutes until softened. ", "Add the turmeric, salt to taste and stir in the aubergine and a squeeze of lemon juice. Heat for 2-3 minutes, reduce the heat and cook slowly for 15-20 minutes. Stir in chopped coriander when ready to serve.", "For the lamb shoulder, remove the lamb from the pan and blend the sauce until smooth. Strain the sauce, re-heat and season to taste with salt and pepper. Put the lamb back into the sauce to warm through before serving.\r\n", "For the mint chutney, blend the mint, coriander, chilli, garlic, lime zest and juice in a food processor until smooth. Add caster sugar to taste and a little oil, pulse again to combine. Season to taste with salt and freshly ground black pepper.", "To serve, serve the aubergine, potato cakes, mint chutney, two bones from the rack and a piece of shoulder and some sauce on each plate."]}, {"isVegetarian": false, "title": "Indian chicken pie", "url": "www_bbc_co_uk_food_recipes_indian_chicken_pie_73681", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp coriander seeds", "5-6 dried red chillies", "4 tbsp sunflower oil", "1 tsp fenugreek seeds", "2 large white onions, sliced", "5 garlic cloves, crushed and chopped", "2.5cm/1in fresh root ginger, grated", "1 tsp red chilli powder", "1 tsp ground coriander", "800g/1lb 12 oz boneless, skinless chicken breasts, cut into 2.5cm/1in cubes", "1 x 400g/14oz can chopped tomatoes", "table salt, to taste", "½ tsp mango powder", "1 tsp garam masala", "450g/1lb plain flour", "100g/3½oz strong white flour", "75g/2½oz cold unsalted butter", "½ tsp fine salt", "100g/3½oz solid vegetable fat (such as Cookeen or Trex), plus extra for greasing", "1 egg yolks, beaten, to glaze"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 20cm/8in springform cake tin with vegetable fat. ", "For the filling, put the coriander seeds in a small dry frying pan set over a low heat. Keep on a low heat and toast lightly until they just start to change colour. Once done, put the coriander seeds in a pestle and mortar and crush them to a powder. ", "Heat the oil in a large frying pan. Add the fenugreek seeds and the whole chillies and stir until they turn golden-brown. Add the onions and cook until browned. Stir in the garlic, ginger, crushed coriander seeds, chilli powder and ground coriander.", "Add the chicken and fry over high high for five minutes, or until the chicken starts to colour. Stir in the chopped tomatoes, cook for five minutes then add the salt, mango powder and garam masala. Cook for 15 minutes, or until the chicken is cooked through. Transfer to the fridge to cool. Remove the whole chillies and discard.", "Preheat the oven to 200C/400F/Gas 6.", "To make the pastry, combine the flours in a large bowl. Add the butter and, using your fingertips, rub it into the flour until it resembles breadcrumbs. In a pan, heat 200ml/7fl oz water, the salt and fat until just boiling. Pour the liquid onto the flour mixture and mix using a wooden spoon.", "Tip the dough out onto a lightly floured work surface and knead to a smooth dough.", "Working as quickly as possible, take two thirds of the pastry and roll out a large circle of dough on a lightly floured surface. Using the rolling pin to help you, line the prepared tin.", "Spoon the filling into the pastry lined tin. Press it down and level the surface.", "Using the remaining pastry, roll out a pie lid on a lightly floured work surface.", "Brush the top edges of the pastry in the tin with beaten egg yolk and place the pastry lid on top. Crimp the edges to seal and trim off any excess pastry. Make a couple of slits in the top of the pie to allow the steam to escape and brush the pastry lid with egg yolk. Use any leftover pastry to make decorations for the top of the pie.", "Bake for 1 hour, or until the top is golden-brown. Leave to cool in the tin for 10 minutes then remove from the tin and leave to cool completely on a wire rack before serving."]}, {"isVegetarian": false, "title": "Indian deep-fried soft-shell crab with lime pickle", "url": "www_bbc_co_uk_food_recipes_indian_deep-fried_91443", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_deep-fried_91443_16x9.jpg", "ingredients": ["500g/1lb 2oz limes (approxiametly 5-6 limes), cut into wedges", "2 tbsp fine sea salt", "1 tbsp vegetable oil", "1 tbsp mustard seeds", "4 garlic cloves, finely chopped", "5cm/2in piece fresh root ginger, peeled and finely chopped", "1 tbsp ground cumin", "1 tbsp ground coriander", "½ tsp asafoetida", "1½ tsp mild chilli powder", "300g/10½oz soft light brown sugar ", "50ml/2fl oz white wine vinegar", "5cm/2in piece fresh root ginger, grated", "4 garlic cloves, crushed", "1 tbsp ground coriander", "2 tsp ground cumin", "1 tsp red chilli powder", "4 tbsp chopped fresh coriander leaves and stalks", "4 tbsp gram flour", "2 limes, juice and finely grated zest ", "4 tbsp groundnut oil", "8 small soft-shell crabs", "vegetable oil, for deep-frying", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the lime pickle, toss the lime wedges with the salt in a large bowl. Cover the bowl and chill in the fridge for 48 hours, stirring occasionally.", "When the limes have cured, heat the oil in a large frying pan over a high heat. Add the mustard seeds. (Caution: The mustard seeds will pop - keep eyes and face well clear.) ", "When the mustard seeds start popping, add the garlic and ginger and stir-fry for 1-2 minutes. ", "Add the cumin, coriander, asafoetida and chilli powder and stir-fry for a further 1-2 minutes, then add the sugar and continue to cook until it melts. ", "Add the cured limes and all of the juices from the bowl to the pan. Cover with the white wine vinegar and 200ml/7fl oz of cold water.", "Bring the pan contents to the boil, then reduce the heat until the mixture is simmering and simmer gently for 1½ hours until the mixture has thickened and the limes are very soft. Set aside to cool slightly.", "Blend the cooled lime pickle in a food processor for 20 seconds, or until the pieces of lime are quite small. Spoon the pickle into sterilised jars until needed. ", "For the crab, mix all of the crab ingredients except the crabs and vegetable oil in a large bowl until well combined as a thick paste. ", "Add the crabs and mix again until the crabs are coated in the spicy mixture. Cover the bowl and chill in the fridge for at least two hours.", "Before cooking, remove the crabs from the fridge and return to room temperature.", "Heat the vegetable oil in a deep fat fryer to 160C/315F. Alternatively, heat the vegetable oil in a deep, heavy-based sauté pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Fry the spiced crabs (in batches if necessary) in the hot oil for 1-2 minutes, or until cooked through. Remove from the oil using a slotted spoon, then set aside to drain on kitchen paper. Season with a little salt. ", "Serve the spiced soft-shell crabs with dollops of the lime pickle."]}, {"isVegetarian": true, "title": "Indian five-spice vegetable stir-fry", "url": "www_bbc_co_uk_food_recipes_indian_five-spice_63447", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_five-spice_63447_16x9.jpg", "ingredients": ["6 tbsp olive oil", "2 spring onions, sliced diagonally", "1 large red chilli, sliced diagonally (seeds in or out depending on how much heat you like)", "1 carrot, thinly sliced into rounds", "1 red pepper, thinly sliced", "100g/3½oz mangetout or sugar snap peas", "1 courgette, thinly sliced into matchsticks", "150g/5½oz asparagus, woody ends removed, halved and sliced diagonally", "4 garlic cloves, thinly sliced", "3 tbsp sriracha chilli sauce", "15g/½oz fresh coriander, chopped", "1 tsp Indian five-spice (panch phoran)", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 2 tablespoons of the oil in a wok or a large non-stick frying pan over a high heat. When the oil is really hot, add all the vegetables except the garlic and stir-fry for 2–3 minutes. Season with salt and pepper.", "Add the sriracha and fresh coriander to the vegetables and mix through. ", "Meanwhile, heat the remaining 4 tablespoons of oil in a small frying pan over a medium heat. Add the garlic and fry until golden-brown.", "Add the Indian five-spice to the garlic and heat over a medium heat for a few seconds, being careful not to burn the spices. Pour the garlic and five-spice mixture over the vegetables and stir through. Serve the stir-fry immediately. "]}, {"isVegetarian": false, "title": "Indian fried chicken", "url": "www_bbc_co_uk_food_recipes_indian_fried_chicken_88459", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_fried_chicken_88459_16x9.jpg", "ingredients": ["150g/5½oz Greek yoghurt", "2 tbsp rice vinegar", "3cm/¼in fresh root ginger, grated", "5 garlic cloves, grated", "1 tsp chilli powder", "1 tsp ground turneric", "1 tsp ground cumin", "1 tsp ground coriander", "pinch allspice", "1 tsp sea salt", "8 chicken thigh fillets", "50g/1¾oz plain flour", "50g/1¾oz rice flour", "½ tsp sea salt", "½ tsp white pepper ", "½ tsp chilli powder", "100ml/3½fl oz vegetable oil", "1 green chilli, sliced", "1 garlic clove, sliced", "handful fresh (or dried if you can't find) curry leaves", "lemon wedges, to serve", "green salad, to serve"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, mix together the yoghurt, vinegar, ginger, garlic, spices and salt in a bowl, add the chicken, coat and leave to marinade, covered, in the fridge for 1 - 3 hours.", "For the flour coating, mix together the flours and seasoning. Toss the chicken thighs in the flour mixture, one at a time, and place on a plate. ", "Add the oil to a large frying pan or wok and heat on a medium heat. Add the chilli, garlic and curry leaves and cook for 3 - 5 minutes, until the leaves start to crisp and the garlic goes golden-brown. Scoop them out with a slotted spoon and set aside to drain on kitchen paper. This will really flavour the oil. ", "Lay the chicken in the oil and cook on a medium heat for 5 minutes on each side, until cooked through and are golden-brown. Remove with a slotted spoon and drain on kitchen paper. Sprinkle over the chilli, garlic and curry leaves and serve with lemon wedges and a massive green salad. I make one with Little Gems, spring onions and mint."]}, {"isVegetarian": true, "title": "Indian potato raised pie", "url": "www_bbc_co_uk_food_recipes_indian_hot-water_crust_81459", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_hot-water_crust_81459_16x9.jpg", "ingredients": ["700g/1lb 9oz désirée potatoes, halved", "2 tbsp urad dal ", "2 tbsp sunflower oil", "1 tsp cumin seeds ", "2 tsp mustard seeds ", "10 fresh curry leaves (or 15 dried leaves)", "4 red chillies, chopped", "1 tsp ground turmeric ", "2 medium white onions, finely chopped", "table salt, to taste ", "2.5cm/1in piece fresh root ginger, grated", "2 tomatoes, finely chopped", "bunch fresh coriander, roughly chopped", "450g/1lb plain flour", "100g/3½oz strong white flour", "75g/2½oz cold unsalted butter", "½ tsp fine salt", "100g/3½oz solid vegetable fat (such as Cookeen or Trex), plus extra for greasing", "1 free-range egg yolk, beaten, to glaze"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Grease a 20cm/8in springform cake tins with vegetable fat.", "For the filling, boil the potatoes for 15 minutes, or until tender. Drain then chop into bite-size pieces. ", "Soak the lentils in a cup of boiling water for five minutes, then drain them.", "Heat the oil in a frying pan. Add the cumin seeds and mustard seeds. When they splutter add the curry leaves, lentils, red chillies, turmeric and onion and mix well. Fry for five minutes then add the salt, ginger, potatoes, tomatoes and coriander leaves and mix well. Transfer to the fridge to cool. ", "Preheat the oven to 200C/400F/Gas 6. ", "To make the pastry, combine the flours in a large bowl. Add the butter and, using your fingertips, rub it into the flour until it resembles breadcrumbs. In a pan, heat 200ml/7fl oz water, the salt and fat until just boiling. Pour the liquid onto the flour mixture and mix using a wooden spoon. ", "Tip the dough out onto a lightly floured work surface and knead to a smooth dough.", "Working as quickly as possible, take two thirds of the pastry and divide it in two. Roll out two large circles of dough and, using the rolling pin to help you, line the prepared tins. ", "Spoon the fillings into the pastry lined tins. Press it down and level the surface. ", "Using the remaining pastry, roll out the pie lids on a lightly floured work surface. ", "Brush the top edges of the pastry in the tin with beaten egg yolk and place the pastry lids on top. Crimp the edges to seal and trim off any excess pastry. Make a couple of slits in the top of the pie to allow the steam to escape and brush the pastry lid with egg yolk. Use any leftover pastry to make decorations for the top of the pie.", "Bake for 1 hour, or until the tops are golden-brown. Leave to cool in the tins for 10 minutes then remove from the tins and leave to cool completely on a wire rack before serving."]}, {"isVegetarian": true, "title": "Indian roti", "url": "www_bbc_co_uk_food_recipes_indian_roti_70511", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz chapati flour (available in Indian grocers and large supermarkets), plus extra for dusting", "1 tsp fine salt", "½ tsp cumin seeds", "½ tsp chilli flakes", "½ tsp ajwain seeds", "½ tsp turmeric", "1½ tsp dried fenugreek leaves (or a handful of fresh fenugreek leaves, roughly chopped)", "120ml/4fl oz warm water ", "1 tbsp sunflower oil", "ghee or unsalted butter, melted, for brushing over bread"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour into a large bowl and mix in the salt and spices.", "In a separate bowl, whisk the water and oil together.  ", "Gradually add the water and oil to the dry ingredients in batches and stir until it forms a soft, firm dough (you may need a little less or more water to achieve this). Cover the dough and set aside to prove for 20 minutes.", "Weigh the dough and divide it into six equal portions. Shape each portion into a ball. Roll each ball in flour and, using a rolling-pin, roll into a thin round approximately 15cm/6in in diameter. ", "Cover the roti with a damp tea towel until you are ready to cook them.", "Heat a tava or a large dry frying pan over a medium heat and cook each chapati for 30 seconds on one side, to set the dough. Turn over, and cook for another minute, until small bubbles appear on the top and light brown spots appear underneath. Turn over again and cook for a further 30-40 seconds.  The dough will start to puff up so press down with a rolled-up tea towel to force steam to escape. Each time you press with the towel, rotate the roti in the pan to keep it moving on the hot surface (to avoid burnt spots). ", "Transfer the cooked roti to a clean tea towel, brush lightly with either melted ghee or unsalted butter. Wrap and keep covered in the tea towel until ready to serve. Repeat until all the roti have been cooked."]}, {"isVegetarian": true, "title": "Indian scrambled eggs", "url": "www_bbc_co_uk_food_recipes_indianscrambledeggs_86454", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indianscrambledeggs_86454_16x9.jpg", "ingredients": ["1 tsp vegetable oil ", "a knob of butter", "2 tbsp finely chopped onion", "½ small tomato, chopped", "¼ green chilli, seeded and sliced (optional), or pinch of red chilli powder", "2 eggs, beaten ", "salt to taste", "1 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a small non-stick frying pan. Add the onion and fry for about four minutes, until soft.", "Beat together the rest of the ingredients in a bowl and pour into the pan and scramble as normal. Take them off the heat when they are cooked to your taste.  Serve with toast or naan bread."]}, {"isVegetarian": true, "title": "Indian rice pudding (kheer)", "url": "www_bbc_co_uk_food_recipes_indianricepuddingkhe_90219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.1 litres/2 pints whole milk", "2 tbsp long-grain rice, such as basmati", "4 whole green cardamom pods, lightly crushed", "2 tbsp sugar", "10 unsalted pistachios", "To decorate", "vark (edible silver or gold leaf, available from specialist cake shops or some Asian grocers, optional)", "extra pistachios"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the milk into a heavy-based pan and heat gently (you can preheat the milk in a jug in the microwave then transfer the hot milk to the pan, to save time, if you prefer).", "Add the cardamom pods and rice to the milk.", "Slowly bring to the boil then lower the heat and simmer rapidly, stirring from time to time to prevent the rice from sticking to the bottom of the pan. Simmer, stirring occasionally, until the milk is reduced by about half; this may take as long as 1¼ hours.", "While the milk is simmering, roughly chop the pistachios.", "When the milk has reduced by half or more, remove and discard the cardamom pods.", "Transfer the rice pudding to a bowl. Add the sugar and taste, adding more sugar if you want it sweeter.", "Add the chopped pistachios, stir well, and leave to cool.", "Cover the bowl with cling film and cool in the fridge for at least four hours or overnight.", "When ready to serve, spoon into individual serving bowls. Decorate with vark, if using.", "Sprinkle a few more chopped pistachios on top.", "Serve."]}, {"isVegetarian": false, "title": "Indian spiced lamb with Provençal vegetables and mint sauce", "url": "www_bbc_co_uk_food_recipes_indianspicedlambwith_11591", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb loin of lamb", "2 cloves garlic, crushed", "100ml/3½fl oz plain yoghurt", "1 lemon, juice only", "2 tbsp garam masala", "seasoning", "extra virgin olive oil", "1 courgette, cut into chunks and griddled", "1 aubergine, cut into chunks and griddled", "1 red pepper, cut into chunks and griddled ", "jar mint jelly ", "water"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the garlic, yoghurt, lemon juice, garam masala, salt and pepper in a large bowl.", "Add the lamb and stir to ensure everything is evenly coated. Cover with cling film and refrigerate for at least 2, but no more than 24 hours.", "Heat a little oil in a non-stick frying pan, drain the lamb from its marinade and add to the pan. Fry for about 3 minutes on each side until cooked through. Remove from the pan and allow to rest.", "To make the dressing, simply whisk the mint jelly with a little water.", "To serve - slice the lamb and place in the centre of the plate, place the vegetables around and drizzle the sauce over."]}, {"isVegetarian": false, "title": "Indian-spiced soft shell crab with mango chutney", "url": "www_bbc_co_uk_food_recipes_indianspicedsoftshel_88174", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp grated fresh ginger", "2 tsp chopped garlic", "2 tsp ground coriander", "2 tsp ground cumin", "1 tsp red chilli powder", "4 tbsp chopped coriander leaves", "4 tbsp gram flour (besan or chickpea flour)", "2 limes, juice only", "2 tbsp groundnut oil", "4 small soft shell crabs", "1 tsp black mustard seeds", "1 tsp black peppercorns", "1 tsp cumin seeds", "1 tsp dried chilli flakes", "1 tsp coriander seeds", "1 green mango, peeled and sliced", "2 ripe mangoes, peeled and sliced", "125g/4½oz light soft brown sugar", "110ml/4fl oz malt vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the crabs, place all of the ingredients except the crabs into a bowl and mix to a paste.", "Add the crabs and turn gently in the mixture to coat well. (Ideally leave for 30 minutes to infuse the flavours.)", "Heat an ovenproof frying pan until hot then add enough vegetable oil to coat the bottom of the pan. Add the crabs and fry for 2-3 minutes on each side, then transfer to the oven and cook for 8-10 minutes, or until completely cooked through.", "For the mango chutney, heat a frying pan until hot. Add all of the spices and toast for 30 seconds, or until the mustard seeds start to pop.", "Add the green mango and ripe mangoes and cook for 1-2 minutes.", "Add the sugar and cook until dissolved into the mango juices, then add the vinegar.", "Cover the mango mixture and reduce the heat to simmer for 25 minutes, or until the mango has broken down and the mixture resembles chutney.", "Place half of the chutney mixture into a food processor and blend to a purée, then return to the pan and mix with the remaining unblended chutney.", "Pour the chutney into sterilised jars and allow to cool before serving.", "To serve, place a soft shelled crab onto each plate with a spoonful of mango chutney alongside."]}, {"isVegetarian": false, "title": "Indian-style fish curry", "url": "www_bbc_co_uk_food_recipes_indianstylefishcurry_92835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp fine sea salt", "1 tsp ground turmeric", "400g/14oz white fish fillets, such as hake, pomfret or whiting, skin removed, cut into large pieces", "3-4 tbsp vegetable oil", "1 tsp black mustard seeds", "1 onion, peeled, grated", "10 fresh curry leaves", "4 ripe tomatoes, chopped", "2.5cm/1in piece fresh root ginger, grated", "1 garlic clove, peeled, crushed to a paste with the edge of a knife", "1 green birds'-eye chilli, finely chopped", "1 tsp garam masala", "200g/7oz creamed coconut, grated", "1-2 tbsp water (as necessary)", "basmati rice, cooked according to packet instructions", "handful fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the salt and ground turmeric onto a plate. Dredge the pieces of fish in the mixture until completely coated. ", "Heat 1-2 tablespoons of the oil in a frying pan over a medium to high heat. Add the coated fish pieces, then fry for 2-3 minutes, or until crisp, golden-brown and cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Heat the remaining 1-2 tablespoons of the oil in a separate pan. Add the mustard seeds, cover the pan with a lid, and fry until they start to pop. (CAUTION: Popping seeds can be dangerous. Keep the pan away from the eyes and face.)", "Add the onion and curry leaves and continue to fry for a further 4-5 minutes.", "Add the tomatoes, ginger, garlic, chilli and garam masala and continue to fry, stirring well, for 3-4 minutes.", "Add the grated coconut cream and stir until dissolved. Bring the mixture to the boil, then reduce the heat and simmer until the sauce has thickened. Add 1-2 tablespoons of water to the mixture to loosen the mixture, as necessary. ", "Add the fried fish pieces to the sauce and cook until heated through. ", "To serve, spoon the rice onto four serving plates. Spoon the fish curry on top of the rice, then garnish with the coriander."]}, {"isVegetarian": false, "title": "Indian-style pollack with spicy chickpeas", "url": "www_bbc_co_uk_food_recipes_indianstylepollockwi_88632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp mustard seeds", "2 tsp cumin seeds", "2 tsp coriander seeds", "1 tsp ground turmeric", "½ tsp smoked sweet paprika", "1 tsp fenugreek", "½ tsp ground cinnamon", "½ tsp salt", "2 tbsp vegetable oil", "4 x 175g/6oz pollack fillets, skinned", "2 tbsp vegetable oil", "2 shallots, finely sliced", "1 x 400g/14oz can of chickpeas, rinsed and drained", "3 tomatoes, skinned, seeds removed, chopped", "3 tbsp roughly chopped fresh coriander", "salt and freshly ground black pepper", "2 limes, quartered, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice paste, heat a frying pan until hot, then add the mustard seeds, cumin and coriander seeds and dry fry until the mustard seeds start to pop.", "Transfer the toasted spices into a pestle and mortar and grind to a fine powder.", "Place the spice powder into a bowl and add the remaining spice paste ingredients. Whisk to form a paste.", "For the pollack, preheat the grill to its highest setting.", "Take half the spice paste and smear it all over each pollack fillet. Place the pollack onto a grill tray and place under the grill to cook for 3-4 minutes, or until just cooked through.", "Meanwhile, heat a clean frying pan until hot. Add the oil and shallots and fry for 1-2 minutes.", "Add the remaining spice paste and cook for one minute.", "Add the chickpeas and continue to cook until the chickpeas are heated through.", "Add the tomatoes and coriander and season, to taste, with salt and freshly ground black pepper.", "To serve, place a large spoonful of the chickpea mixture onto each plate and top with a pollack fillet and a wedge of lime."]}, {"isVegetarian": true, "title": "Indian-style sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_indianstylesauteedpo_87766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "250g/9oz new potatoes", "½ onion, chopped", "4 garlic cloves, crushed", "2 tsp curry powder", "2 tsp ground cumin", "2 tsp ground turmeric ", "fresh coriander, to garnish"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in frying pan. Add the new potatoes, onion and garlic and fry for two minutes. ", "Add the curry powder, cumin and turmeric and fry over a high heat. ", "Cover the pan with a lid, reduce the heat and cook for 30-35 minutes until the potatoes are cooked. ", "Serve on a plate garnished with fresh coriander."]}, {"isVegetarian": true, "title": "Individual focaccia rolls", "url": "www_bbc_co_uk_food_recipes_individual_foccacia_02400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb strong white flour, plus extra for dusting", "1½ tsp salt", "1 x 7g/¼oz sachet fast-action dried yeast ", "400ml/14fl oz warm water", "vegetable oil, for greasing", "2 sprigs fresh rosemary, leaves only, finely chopped", "1 red onion, finely chopped", "3 tbsp extra virgin olive oil, plus extra for brushing", "½ tsp sea salt flakes"], "serves": "Makes 8 rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour, salt and yeast together in a large bowl. Add the warm water and mix together to form a sticky dough. ", "Tip the dough onto a lightly floured work surface and knead for five minutes, or until the dough is smooth and elastic.", "Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size. ", "Lightly grease two baking trays.", "Knock the dough back to its original size and turn out onto a lightly floured work surface. Divide the dough into eight equal balls and place onto the baking trays. Ensure the rolls are well spaced. Cover with a tea towel and set aside to prove for 30 minutes. ", "Preheat the oven to 220C/425F/Gas 7. ", "Mix the rosemary, onion and olive oil together in a bowl.", "With a well floured finger, press several holes into each roll then spoon over the rosemary mixture. Brush the oil down the sides of each roll and sprinkle over the sea salt flakes.", "Bake in the oven for 20-25 minutes or until well risen and golden-brown."]}, {"isVegetarian": true, "title": "Individual apricot upside-down puddings", "url": "www_bbc_co_uk_food_recipes_individual_apricot_35278", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "400g/14oz apricots, stones removed", "200g/7oz caster sugar", "200g/7oz butter, unsalted, plus extra for greasing", "2 lemons, zest only", "3 free-range eggs", "200g/7oz self-raising flour", "50ml/2fl oz apricot brandy", "570ml/1 pint custard"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line six dariole moulds. Roughly chop one-third of the apricots. Halve the remaining apricots.", "Heat the sugar in a saucepan until it begins to caramelise, add the apricot halves and cook for 4-5 minutes, or until softened. Set aside to cool.", "For the base, cream the sugar, butter and lemon zest in a bowl until fluffy. Gradually whisk in the eggs, then fold in the flour. Fold in the uncooked chopped apricots.", "Spoon the caramelised apricot halves into the bottom of the dariole moulds, then top with the cake mixture, cover with aluminium foil and transfer to a large baking tray. Fill the baking tray with enough water to come halfway up the moulds (this is called a bain-marie). Bake in the oven for 40-50 minutes, or until risen and golden-brown.", "To serve, mix the apricot brandy and custard together until well combined. Turn one pudding out onto each of six serving plates and serve the custard alongside."]}, {"isVegetarian": true, "title": "Individual fruit pies", "url": "www_bbc_co_uk_food_recipes_individual_fruit_pies_36363", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individual_fruit_pies_36363_16x9.jpg", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 tbsp icing sugar", "100g/3½oz unsalted butter, chilled, cut into 1cm/½in cubes", "1 free-range egg, lightly beaten", "1 tsp lemon juice", "7 medium eating apples (approximately 1kg/2lb 4oz),  peeled, quartered and cored", "25g/1oz unsalted butter", "75g/2½oz caster sugar, plus extra for dusting", "1 lemon, finely grated zest only", "50ml/2fl oz calvados", "2 tbsp mascarpone", "7 medium pears (approximately 1kg/2lb 4oz),  peeled, quartered and cored", "25g/1oz unsalted butter", "75g/2½oz caster sugar, plus extra for dusting", "1 lemon, finely grated zest only", "50ml/2fl oz perry", "2 tbsp mascarpone", "9 apricots (approximately 500g/lb 2oz),  halved and stoned", "25g/1oz unsalted butter", "75g/2½oz caster sugar, plus extra for dusting", "50ml/2fl oz amaretto", "2-3 tbsp milk, for brushing", "granulated sugar, for sprinkling"], "serves": "Makes 12 small pies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet shortcrust pastry, mix the flour and icing sugar together in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "In a separate bowl or jug, mix the egg with the lemon juice and two tablespoons of water. Make a well in the centre of the flour mixture and pour in the egg mix. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and rest in the fridge for at least 15 minutes.", "To make any of the fillings, first cut the fruit into 1cm/½in pieces.", "Melt the butter in a large frying pan or deep saucepan set over a medium heat. Add the fruit, sugar, lemon zest (if applicable) and the alcohol. Simmer for about 10 minutes, stirring from time to time, until the fruit is tender and most of the liquid has evaporated.", "Leave the fruit mix to go cold, mix in the mascarpone (if applicable), then chill the mixture.", "Preheat the oven to 200C/400F/Gas 6.", "On a lightly floured work surface, roll out the pastry to a thickness of 2–3mm. Using an 8.5cm/3½in plain cutter, cut out 12 circles and use them to line a bun tray (the kind you would use for fairy cakes, not a deep muffin tray). Re-roll the pastry as necessary and cut out 12 smaller circles, 6cm/2½in in diameter, for the lids.", "Spoon the fruit filling into the pastry cases, taking care not to overfill them. Dampen the rim of the pastry with a little water and top each pie with a lid. Press a smaller cutter over the pie to seal the edge and trim away any excess pastry. Make a couple of small steam holes in the top of each pie. ", "Brush the pastry lid with a little milk and sprinkle with granulated sugar. Bake for 25–30 minutes, or until the pastry is crisp and golden-brown.", "Leave to cool in the tin for five minutes before removing. Serve warm or at room temperature, within 24 hours of baking (or they’ll start to lose their crispness)."]}, {"isVegetarian": true, "title": "Individual lemon tartlets", "url": "www_bbc_co_uk_food_recipes_individual_lemon_92197", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individual_lemon_92197_16x9.jpg", "ingredients": ["175g/6oz plain flour", "100g/3½oz cold butter, cut into small cubes", "25g/1oz icing sugar", "1 free-range egg yolk", "4 large free-range eggs", "100ml/3½fl oz double cream ", "150g/5½oz caster sugar", "3 lemons, juice and zest", "icing sugar, for dusting ", "100g/3½oz plain chocolate (36% cocoa solids), chopped"], "serves": "Makes 12 tartlets", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, place the flour, butter and icing sugar into a food processor. Pulse briefly until the mixture resembles breadcrumbs, then add the egg yolk and one tablespoon of cold water. ", "Pulse again until the mixture sticks together in clumps then tip onto a work surface and gather it into a ball with your hands. Knead the pastry just two or three times to make it into a smooth ball. Wrap it in cling film and place in the refrigerator for 15 minutes. ", "Grease 12 x 7.5cm/3in fluted tart tins.", "Roll out the pastry to a thickness of 5mm/¼in. Cut out circles with a 10cm/4in round cutter and use to line the tins, re-rolling the pastry as necessary. Place the tart cases in the fridge to chill. ", "Preheat the oven to 200C(180C fan)/400F/Gas 6. ", "Cover the base of the tartlets with baking parchment or foil and fill with a few baking beans. ", "Bake blind for seven minutes then remove the parchment and beans. ", "Return the pastry cases to the oven for another 4-5 minutes or until they are light golden-brown and completely dry. Set aside to cool while you make the filling. Reduce the oven temperature to 170C(150 fan)/325F/Gas 3. ", "For the filling, break the eggs into a large bowl and whisk together with a wire whisk. Add the rest of the filling ingredients and whisk again until they are all well-combined. Pour the filling mixture into a jug, then into the cooled baked pastry cases. To prevent it spilling as they go into the oven, pour in most of the filling so it almost fills the tarts, carefully sit the baking sheet and tarts on the oven shelf, then top up with the rest of the filling to completely fill the tarst. ", "Bake for about seven minutes, or until just set but with a slight wobble in the centre.", "Leave to cool slightly then carefully ease the tartlets from their tins an place on a wire rack to cool completely. ", "For the decoration, melt the chocolate in a bowl set over a pan of simmering water. (Do not allow the bottom of the bowl to touch the surface of the water.) ", "Spoon the melted chocolate into a small disposable piping bag. Snip off the end and pipe the word ‘citron’ or a decoration of your choice on top of the tarts."]}, {"isVegetarian": false, "title": "Individual scallop and monkfish pies", "url": "www_bbc_co_uk_food_recipes_individual_scallop_and_36485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "75g/3oz butter", "8 scallops, roes removed, sliced in half horizontally (plus 4 scallop shells reserved and washed thoroughly)", "200g/7oz monkfish fillet, trimmed, cut into 1cm/½in slices", "salt and freshly ground black pepper", "1 banana shallot, finely diced", "½ leek, white part only, finely diced", "75ml/3fl oz white wine", "75ml/3fl oz fish stock", "75ml/3fl oz double cream", "4 tbsp peas", "2 tbsp chopped fresh chervil", "2 free-range egg yolks, lightly beaten", "400g/14oz baby spinach leaves", "50ml/2fl oz water", "pinch grated nutmeg"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Sift the flour onto a work surface and make a well in the middle. Add the butter and salt to the well and work them together with your fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually add 125ml/4½fl oz ice-cold water and mix until well combined.", "Roll the pastry into a ball, wrap in cling film and chill in the fridge for 20 minutes.", "Flour the work surface and roll out the pastry into a 40cm x 20cm/15in x 7½in rectangle.", "Fold one third of the dough to the centre, then fold the other third on top. Push the edges of the pastry with the rolling pin to seal.", "Rotate the pastry a quarter turn. Roll the pastry out again 40cm x 20cm/15in x 7½in rectangle and fold in the same way as above. Chill in the fridge for 30 minutes.", "Repeat the rolling and folding process two more times to give four rolls and folds in total. Wrap the pastry in cling film and chill in the fridge for at least 30 minutes.", "For the filling, preheat the oven to 225C/450F/Gas 8.", "Heat a frying pan until hot, add a little of the butter and heat until foaming.", "Add the scallops and fry for 5-10 seconds on each side then remove from the pan and set aside on a plate. Add the monkfish slices to the pan and cook for 5-10 seconds on each side.  Remove from the pan and set aside on a plate. Season, to taste, with salt and freshly ground black pepper.", "Add the remaining butter, shallot and leek to the pan used to cook the scallops and monkfish and fry for 2-3 minutes. Deglaze the pan with the white wine and cook until the volume of the liquid has reduced by half.", "Add the fish stock and cook for a further minute.", "Add the cream and bring the mixture to the boil, then add the peas and cook until warmed through.", "Stir in the chervil and season, to taste, with salt and freshly ground black pepper. Spoon a little of the mixture into each scallop shell, top with the scallops and monkfish then spoon over a little more sauce. Set aside to cool. ", "Meanwhile, roll the pastry out on a lightly floured surface to a 0.5cm/¼in thickness, then cut out four pieces of pastry big enough to cover the shells with a 2cm/1in border. ", "Brush the edge of each scallop shell with a little of the beaten egg. Lay the pastry gently over the top of the filled shell and press down around the edges to create a seal.", "Brush with the remaining egg wash then mark the top lightly with a knife to decorate.", "Place the scallop shells onto a baking tray in the oven and bake for 15-20 minutes, or until golden-brown and the pastry is cooked through.", "Meanwhile, for the spinach, heat a frying pan until hot, add the remaining butter, spinach and water and fry for a couple minutes, or until wilted. Season with salt, freshly ground black pepper and nutmeg.", "To serve, spoon some spinach into the centre of serving plates and place a scallop shell pie on top."]}, {"isVegetarian": true, "title": "Blackberry and apple pastries", "url": "www_bbc_co_uk_food_recipes_individualappleandbl_92217", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individualappleandbl_92217_16x9.jpg", "ingredients": ["300g/10½oz apples, peeled, cores removed, sliced", "125g/4½oz caster sugar, plus extra for dusting", "1 tbsp blackberry liqueur", "200g/7oz blackberries", "1 packet ready-rolled puff pastry, cut into eight to twelve 6in x 4in/15cm x 9in rectangles", "2 free-range eggs, beaten", "vanilla ice cream, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sliced apples in a pan with the sugar and blackberry liqueur and cook gently over a medium heat for 5-6 minutes, or until the apples are softened. Set aside to cool, then mix in the blackberries. ", "Preheat the oven to 180C/355F/Gas 4.", "Divide the apple and blackberry mixture, leaving aside any juices, among four of the puff pastry rectangles, leaving a 2cm/1in border around the edges of the pastry.", "Using a lattice cutter, roll over the remaining pieces of pastry, or alternatively use a sharp knife to cut 2cm/1in slits in staggered rows 1cm/½in apart. Gently pull the pastry so that the slits open up and a lattice shape is shown.", "Brush the edges of the filled pastry layer with the beaten egg, then carefully lay the lattice-cut layer of pastry on top. Seal the edges by pressing down, then brush the pastry all over with the beaten egg. Sprinkle over some caster sugar and bake the pastries for 20 minutes, or until the pastry is golden-brown and puffy. ", "Serve the pastries warm with ice cream."]}, {"isVegetarian": true, "title": "Individual pecan pies", "url": "www_bbc_co_uk_food_recipes_individualpecanpies_87266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz ready-made sweet shortcrust pastry, rolled to 5mm/¼ in thick", "2 free-range eggs", "pinch salt", "20g/¾oz butter, melted", "200g/7oz golden syrup", "75g/3oz dark muscovado sugar", "½ tsp vanilla extract", "150g/5oz pecan halves", "vanilla ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Line six individual tart cases with the sweet pastry and chill for 30 minutes.", "Place the pastry-lined tart cases onto a baking sheet. Line each one with baking parchment then add baking beans or uncooked rice. Place in the oven and bake blind for 15 minutes.", "Remove from the oven and carefully remove the baking parchment and baking beans or rice. Return the tarts to the oven for a further five minutes or until golden-brown. ", "Meanwhile, crack the eggs into a bowl and whisk. ", "Add a pinch of salt, melted butter, golden syrup, muscovado sugar and vanilla extract and whisk together until thoroughly combined and smooth.", "Pour this mixture into the pastry cases, filling to just below the rim of the pastry.", "Divide the pecan halves evenly among each tart, arranging them in a circular pattern on top of each one.", "Place in the oven and bake for 10-12 minutes until the filling is just set.", "Remove and leave to cool for ten minutes.", "Serve on individual serving plates with a scoop of vanilla ice cream alongside."]}, {"isVegetarian": true, "title": "Individual strawberry shortcakes", "url": "www_bbc_co_uk_food_recipes_individualstrawberry_72325", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individualstrawberry_72325_16x9.jpg", "ingredients": ["225g/8oz plain flour", "100g/3½oz caster sugar", "225g/8oz butter, at room temperature", "100g/3½oz semolina", "25g/1oz demerara sugar", "500g/1lb 1½oz strawberries, plus extra to garnish", "1½ tbsp port", "2 tbsp caster sugar", "300ml/10½fl oz double cream, whipped to soft peaks", "300ml/10½fl oz thick, natural yoghurt", "2 egg whites, whipped to stiff peaks", "extra strawberries, to garnish"], "serves": "Makes 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.  Put the flour, caster sugar, butter and semolina into a food processor and process until the mixture is thoroughly combined and comes together to form a dough.  This can also be done by hand, rubbing the butter into the flour first, then adding the sugar and semolina and working the ingredients together to form a ball.", "Roll the dough out on a floured surface to 1-2cm/½in thick.  Using a circular cookie cutter or the top of a drinking glass, cut the dough into circles.  Place the circles into a lightly greased tin and sprinkle the top with the demerara sugar.", "Bake for 30-40 minutes, until the shortbread is pale golden and cooked through.  Keep an eye on it in case it gets too brown.  Allow the shortbread to cool for a few minutes then carefully lift each shortbread with a small palette knife and place on a wire rack to cool completely.  (These can now be stored in an airtight container.)", "Meanwhile, make the filling. Place the strawberries, port and sugar into a pan and heat gently until the sugar dissolves, stirring and mashing the strawberries into a chunky salsa.  Allow to cool.", "Fold together the whipped double cream, yoghurt and whipped egg white.", "Fold in the strawberry salsa, leaving swirls.", "Place one shortbread circle on a small plate and place on a large dollop of the strawberry cream.", "Place one whole strawberry on top of each dollop and serve."]}, {"isVegetarian": true, "title": "Individual summer puddings with summer berries", "url": "www_bbc_co_uk_food_recipes_individualsummerpudd_6972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kgs/4lbs summer fruits: strawberries, raspberries, blackberries, red and blackcurrants", "570ml/1 pint  water", "285g/10oz caster sugar", "20 large slices slightly stale thin white bread, crusts removed", "selection of summer fruits (small strawberries, blueberries, raspberries, redcurrant, blackberries)", "fresh mint sprigs", "icing sugar to dust"], "serves": "Serves 10", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Line 10 timbales with pieces of cling film, or use teacups without cling film.", "Check over the fruit and remove all stalks and blemishes.", "Place the water and sugar into a large pan and bring to the boil.", "Add the firmest, most acidic fruits first leaving the strawberries and raspberries until last. Bring to the boil and simmer gently for 5-10 minutes. The redcurrant and blackcurrants should begin to burst slightly. Taste the fruit and stir in more caster sugar if necessary.", "Drain the fruit into a large colander and save the juice. Allow the fruit to cool.", "Save half the juice to dip the bread into. Place the remaining juice back into the pan and reduce until slightly syrupy, set aside for the sauce.", "When the fruit is cool, begin to assemble the summer puddings.", "Cut 10 of the slices of bread in half and then each half into 4 triangles.", "From the other 10 slices, cut 2 discs from each slice of bread, 1 small for the base and one large for the top of the pudding. ", "Dip the bread, a few pieces at a time, into the thinner syrup and line the timbales. Place the small circle on the bottom and the triangles around the sides of the timbale. Fill each timbale with the fruit mix and use the larger circle to top the pudding. Wrap the cling film up and cover the timbale. Place onto a tray and when all the puddings are done put another tray on the top with a weight of some kind to press the puddings.", "Chill for at least a couple of hours and serve with the reduced sauce and fresh summer berries. Dust the fresh berries with icing sugar."]}]