[{"ingredients": ["Galletas de jengibre sin gluten 150 g / 5½ oz, finamente trituradas", "30g / 1oz de mantequilla sin sal, derretida", "400g / 14oz de requesón blando", "Quark 100g / 3½oz", "2 huevos grandes de gallinas camperas", "4 cucharadas de vino de jengibre verde", "4 cucharadas de jarabe de arce", "4 piezas de tallo de jengibre en conserva, finamente picado", "300 g / 10½ oz de moras frescas (o congeladas, descongeladas)", "30 g / 1 oz de azúcar en polvo", "1 cucharadita de extracto de vainilla o pasta de vainilla", "9 moras", "9 galletas de pan de jengibre sin gluten, cortadas en formas de la casa", "azúcar en polvo, para quitar el polvo"], "method": ["Para las bases de tarta de queso, mezcle las galletas trituradas con la mantequilla derretida. Presione esto firmemente en una lata de hornear cuadrada de 20 cm / 8 pulgadas y póngalo en el congelador mientras realiza el llenado.", "Para hacer el relleno, bata el requesón, el requesón, los huevos, el vino de jengibre verde y el jarabe de arce hasta que estén suaves y livianos.", "Retire la base de galletas del congelador y espolvoree sobre el tallo jengibre picado. Verter el relleno en la parte superior y hornear durante 35-40 minutos hasta que se acaba de configurar. Dejar enfriar en la lata y luego enfriar hasta que esté listo para armar.", "Haz un coulis de mora colocando las moras, el azúcar y 5 cucharadas de agua en una sartén pequeña. Llevar a ebullición, luego cocine a fuego lento durante 5 minutos. Agregue la vainilla, mezcle con una batidora y cuele a través de un colador. Dejar enfriar y luego enfriar hasta que se necesite.", "Para servir, corte la tarta de queso en 9 cuadrados. Levante cuidadosamente de la lata en un plato de servir. Presione una casa de galletas en posición vertical contra cada rebanada de pastel de queso con firmeza. Coloque una mora en la parte superior de la tarta de queso y el polvo con azúcar glas. Sirve con los coulis de mora."], "url": "www_bbc_co_uk_food_recipes_gluten-free_blackberry_52734", "title": "Pastel de queso sin gluten y jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_blackberry_52734_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g-50g / 1oz-1¾oz linaza dorada", "475ml / 17fl oz de agua tibia", "1 bolsita de levadura de acción rápida (alrededor de 2½ cucharaditas)", "100ml / 3½fl oz de yogur natural", "450 g / 1 libra de harina de maíz", "1 cucharadita de sal", "1 cucharadita de azúcar en polvo", "50g / 1¾oz de cáscara de psyllium en polvo", "50ml / 1¾oz de aceite de oliva", "aceite de oliva extra y harina de maíz, para terminar"], "method": ["Caliente el horno a 180C / 350F / gas 4 y hornee las semillas de lino en una bandeja durante 10-12 minutos, o hasta que se oscurezcan un poco (el tostado reventará ligeramente las cáscaras y permitirá que las semillas desprendan una goma pegajosa similar al gluten cuando estén mojadas, haciendo la miga más suave y agregando un sabor parecido al de germen de trigo).", "En un recipiente, mezcle el agua y la levadura y luego agregue el yogur y las semillas. En un tazón grande mezcle la harina de maíz, la sal, el azúcar y la cáscara de psyllium en polvo. Vierta la mezcla de levadura y el aceite de oliva y mezcle bien para hacer una pasta fina y suave.", "Durante los próximos cinco minutos este líquido se convertirá en una masa pegajosa, ya que la linaza, la harina de maíz y el polvo de cáscara de psyllium absorberán líquido y se volverán gel. Una vez que la mezcla esté lo suficientemente firme, amasar durante 10 segundos en la superficie de trabajo para mezclar todo de nuevo, a continuación, vuelva la masa al recipiente, cubra y deje durante 30 minutos.", "Alinee una bandeja con papel para hornear antiadherente. Forme la masa en una salchicha gruesa, la longitud de la bandeja, luego cepille con aceite de oliva extra, cubra y deje que se levante durante 30 minutos.", "Caliente el horno a 240C / 465F / Gas 9, destape la masa y corte la parte superior con un pequeño cuchillo afilado, espolvoree un poco de harina de maíz para darle un aspecto enharinado y hornee durante aproximadamente 40 minutos o hasta que tenga un color dorado intenso . Deje que se enfríe en una rejilla de alambre antes de cortar."], "url": "www_bbc_co_uk_food_recipes_gluten-free_olive_oil_42050", "title": "Pan sin gluten", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_olive_oil_42050_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de mantequilla sin sal, suavizada", "Azúcar en polvo 350g / 12oz", "4 maracuyá, pulpa y semillas recogidas", "250 g / 9 oz de harina de arroz", "2 cucharaditas de goma xantana, disponible en muchos supermercados grandes o en línea", "4 cucharaditas de polvo de hornear sin gluten", "6 huevos grandes de gallinas camperas", "100g / 3½oz de coco desecado", "150g / 5½oz de mantequilla sin sal, suavizada", "200g / 7oz de azúcar glasé", "2 limas sin cera, solo ralladura, ralladas", "2 cucharadas de crema de coco", "2 cucharaditas de ron blanco con sabor a coco (opcional)", "2 maracuyá, pulpa y semillas raspadas", "2 limas, solo jugo", "100 g / 3½ oz de azúcar en polvo"], "method": ["Precalentar el horno a 180 ° C / 170 ° C (ventilador) / Gas 4. Ligeramente untar con mantequilla 2 latas de pastel de forma de resorte de 20 x 20 cm / 8 in y forrar con pergamino para hornear.", "Con un batidor de mano eléctrico, bata la mantequilla, el azúcar y la fruta de la pasión en un tazón grande.", "En un recipiente aparte, tamice la harina de arroz, la goma de xantano y el polvo de hornear.", "Agregue una cucharada de la mezcla de harina y un huevo a la mezcla de mantequilla y azúcar, batiendo a fondo. Agregue el resto de los huevos, uno por uno, agregando una cucharada de la mezcla de harina cada vez. Dobla el resto de la harina y dobla el coco desecado.", "Divida la mezcla en partes iguales entre las dos latas y hornee durante 40-45 minutos, o hasta que la parte superior esté dorada y un pincho de madera insertado en el centro del pastel salga limpio.", "Mientras los pasteles están en el horno, prepare la crema de mantequilla untando la mantequilla, el azúcar glas y la ralladura de lima en un bol hasta que esté suave y esponjosa.", "Agregue la crema de coco y el ron de coco (si se usa) y bata hasta que estén bien combinados. Dejar de lado.", "Poco antes de que los pasteles estén listos, haga el jarabe. Combine el jugo de fruta de la pasión con el jugo de lima, luego agregue el azúcar, revuelva para disolver. (Puede que necesite calentar en una sartén pequeña o darle una explosión en el microondas en una jarra resistente al calor.) Cuele el almíbar pero reserve las semillas de maracuyá.", "Cuando los pasteles estén cocidos, retírelos del horno y pínchelos con un pincho de madera. Verter sobre el jarabe colado y dejar enfriar en las latas.", "Cuando los pasteles estén fríos, coloque una de las capas en el plato de servir y extienda o vierta sobre la crema de coco. Coloque la otra capa de pastel encima.", "Esparce las semillas de maracuyá en el medio del pastel y córtalo en rodajas para servir."], "url": "www_bbc_co_uk_food_recipes_gluten-free_passion_23138", "title": "Pastel de fruta y maracuyá sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_passion_23138_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de polvo de psyllium (disponible en tiendas de alimentos integrales o tiendas especializadas en línea)", "Mezcla de harina de pan fuerte sin gluten 750g / 1lb 10oz (como Doves Farm), más extra para la elaboración", "3 cucharadas de semillas de nigella", "15 g / ½ oz de azúcar", "1 cucharada de sal", "21 g / ¾oz de levadura instantánea", "3 huevos grandes de gallinas camperas", "1 cucharada de vinagre de vino blanco", "6 cucharadas de aceite de oliva"], "method": ["Mezcle el polvo de psyllium con 300 ml / 10 fl oz de agua. Reserve para permitir que la mezcla se espese.", "Incline la harina y las semillas de nigella en un recipiente para mezclar. Agregue el azúcar y la sal a un lado del tazón y la levadura al otro. Agriete los huevos en el centro de la harina, agregue el vinagre, el aceite de oliva y la mezcla de psyllium. Combina los ingredientes para formar una masa suave. Poco a poco agregue aproximadamente 300 ml / 10 fl oz de agua, puede que no lo necesite todo, aunque la masa debe ser suave y ligeramente pegajosa.", "Coloque sobre una superficie enharinada y amasar para formar una masa suave. Vuelva a colocar en el recipiente, cúbralo y déjelo reposar durante 1½ horas, o hasta que duplique su tamaño.", "Caliente el horno a 220C / 200C Fan / Gas 9 y coloque 3 bandejas de cocción pesadas en el horno para calentar.", "Polvore su superficie de trabajo con harina. Divide la masa en 12 piezas iguales y dales forma de bola. Ruede o presione las piezas en formas ovales de aproximadamente 4 mm de grosor.", "Retire la bandeja de horno del horno y espolvoree con un poco de harina. Coloque cuatro pittas en cada bandeja y hornee durante 10-12 minutos, o hasta que se hinche y se cocine completamente. Los pittas deben tener un ligero color para ellos. Retire del horno y envuelva en una toalla de té limpia, esto ayuda a mantenerlos suaves."], "url": "www_bbc_co_uk_food_recipes_gluten-free_pitta_bread_09625", "title": "Pan de pitta sin gluten", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 pittas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_pitta_bread_09625_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2¼lb de patatas, sin pelar", "aceite de oliva, para freír", "1 cebolla, finamente picada", "100 g / 3½ oz de acelga suiza, hervida, exprimida de agua y picada", "1 huevo de gallinas camperas", "300g / 10½oz '00' de harina, más extra para quitar el polvo", "1 cucharadita de sal"], "method": ["Hervir las papas, con sus pieles, hasta que estén tiernas.", "Calentar el aceite de oliva en una sartén y freír la cebolla hasta que se dore.", "Pele las papas mientras todavía están calientes, luego pase las papas, la cebolla y las acelgas por un molinillo de alimentos o ricer. Coloque la mezcla en un recipiente.", "Agregue el huevo y la harina para formar una masa blanda y flexible.", "Divida la masa en pedazos del tamaño de un puño pequeño y extiéndalos en longitudes de aproximadamente 2 cm / ¾ de grueso. Corta las longitudes en piezas largas de 2cm /.. Los gnocchi pueden congelarse en esta etapa; extiéndalos en una bandeja bien enharinada y póngalos en el congelador. Cuando esté congelado, sacuda el exceso de harina y póngalos en una bolsa. Use dentro de 3 meses.", "Para cocinar, hierva los gnocchi en agua con sal por unos dos minutos (permitiendo 1-2 minutos de tiempo de cocción adicional si los cocina congelados). Cuando estén cocidos saldrán a la superficie.", "Escurra bien y sirva inmediatamente con la salsa que elija."], "url": "www_bbc_co_uk_food_recipes_gnocchi_82901", "title": "Gnocchi de acelga", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["568ml / 1 pinta de leche entera", "Harina de sémola 130g / 4¾oz", "pizca de nuez moscada recién rallada", "pizca de sal", "30g / 1oz de mantequilla", "60 g / 2¼ oz de queso parmesano", "2 yemas de huevo", "botón de mantequilla", "1 diente de ajo, aplastado", "2 chalotes, finamente picados", "1 médula ósea dividida, aproximadamente 20 cm / 8 pulgadas de largo", "2 cucharadas de perejil finamente picado", "50g / 1¾oz de pan rallado", "Mollejas de la ternera de 600g / 1lb 5oz,", "30g / 1oz de mantequilla", "splash Madeira", "1 manojo de perejil de hojaldre, toscamente picado", "1 chalota de plátano, en rodajas finas", "1 cucharadita de alcaparras para bebés", "salpicar vinagre de vino tinto", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer los gnocchi, llevar la leche a ebullición en una cacerola, verter la harina de sémola y batir hasta que quede suave. Sazonar con nuez moscada y sal.", "Baja el fuego y bate la mantequilla, el parmesano y las yemas de huevo. Incline en una bandeja poco profunda y deje enfriar.", "Con un cortador de 5 cm / 2 pulgadas, corte las rondas y colóquelas en un plato para horno. Rallar un poco más de queso parmesano y hornear durante unos 20 minutos, o hasta que estén doradas.", "Para la médula ósea, derrita la mantequilla en una sartén pequeña y agregue el ajo y la chalota. Cocine suavemente por unos minutos hasta que se ablanden.", "Retire la médula ósea del hueso y corte en trozos pequeños, reservando el hueso. Mezcle con la chalota blanda y el ajo, el perejil y el pan rallado. Vuelva a colocar la mezcla en la cavidad del hueso y hornee por unos 15 minutos o hasta que se dore.", "Mientras tanto, bata las mollejas en agua hirviendo durante 5 minutos, luego quita la piel y corta en rodajas gruesas. Derrita la mantequilla en una sartén y, cuando haga espuma, agregue las mollejas. Cocine hasta que se dore por ambos lados. Agregue un poco de Madeira para desglasar la sartén. Retire las mollejas y reserve para descansar.", "Para la ensalada, mezcle el perejil, chalotes de plátano, alcaparras, vinagre de vino tinto y aceite de oliva.", "Sirva los ñoquis con la médula ósea, mollejas y ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_gnocchi_alla_romana_with_06833", "title": "Gnocchi alla Romana con mollejas de médula ósea y ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rebanada de nuez moscada", "pizca de semillas de cilantro", "4 dientes", "1cm / ½ en rama de canela", "pizca de jengibre molido", "1 vaina de cardamomo verde, solo semillas", "⅛ cucharadita de cúrcuma", "⅛ cucharadita de chile en polvo", "225g / 8oz de papas harinas, en sus pieles", "Harina normal de 80g / 2¾oz", "¼ cucharadita de sal", "½ huevo de corral, batido (aproximadamente 20 g / ¾oz)", "2 cucharadas de aceite de oliva", "1 diente de ajo pequeño", "Cabezas y cáscaras de la gamba 250g / 9oz", "1 cucharada de puré de tomate", "½ cucharadita de sal", "5 cucharadas de aceite de oliva", "½ cebolla pequeña, rallada", "1 diente de ajo, rallado", "pizca de copos de chile", "¼ cucharadita de mezcla de especias bizantinas", "300ml / 10fl oz de caldo de gambas", "botón de mantequilla", "pequeño puñado de perejil de flatleaf finamente picado", "Carne de cangrejo blanca 200 g / 7 oz"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la mezcla de especias, coloque todos los ingredientes en una mano de almirez y mortero y machaque suavemente. Alternativamente, use un molinillo de especias eléctrico. Almacene en una lata o caja hermética.", "Hornee las papas durante 50 minutos, o hasta que estén muy suaves y deje que se enfríen.", "Mientras tanto, prepara el caldo de gambas, calienta el aceite de oliva en una sartén grande a fuego medio. Agregue el ajo y las cabezas y cáscaras de gambas. Revuelva freír durante un par de minutos antes de agregar el puré de tomate, sal y 300 ml / 10 fl oz de agua. Cocine por 10 minutos, luego pase a través de un colador, empujando hacia abajo las cáscaras para extraer la mayor cantidad de sabor a gambas que pueda. Deseche las cáscaras y reserve la reserva.", "Cuando las papas estén frías, saca la carne de las pieles y aplástala o pasa a través de un ricer de patata. Mezcle con la harina, la sal y el huevo para hacer una masa firme. Enrolle la mezcla en salchichas de 1cm / ½ en grosor, córtelas en 2cm / ¾ de largo. Cubra y reserve.", "Para la salsa, caliente el aceite de oliva en una sartén a fuego medio y sude la cebolla y el ajo durante 5 minutos, o hasta que estén blandos. Agregue los copos de chile y la mezcla de especias bizantinas y revuelva durante 1 minuto. Agregue el caldo de gambas, cocine a fuego lento para reducir un poco, luego bata la mantequilla.", "Pon a hervir una olla de agua con sal. Hervir los gnocchi por 3 minutos o hasta que salgan a la superficie. Escurrir y mantener caliente.", "Revuelva el perejil y la carne de cangrejo en la salsa, luego vierta sobre los ñoquis cocidos y sirva."], "url": "www_bbc_co_uk_food_recipes_gnocchi_con_granseola_42070", "title": "Ñoquis con cangrejo araña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas King Edward de 300g / 10½oz, peladas y cortadas en trozos", "60g / 2¼ oz de harina común", "40 g / 1½ oz de queso parmesano (o un queso duro vegetariano similar), finamente rallado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "2 cucharadas de piñones", "2 dientes de ajo, finamente picados", "100g / 3½oz de hojas de espinaca baby", "150ml / 5fl oz de caldo de verduras", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "50g / 2oz de queso parmesano, finamente rallado", "1 cabeza pequeña de brócoli, cortada en pequeños floretes, blanqueada y refrescada", "Harina común 110g / 4oz", "Harina de maíz 110 g / 4 oz", "150-200ml / 5-7fl oz de agua con gas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los gnocchi, coloque las papas en una bandeja para hornear y hornee en el horno durante una hora.", "Cuando estén cocidos, saca la carne de la patata y pasa a través de un ricer de papa en un tazón para mezclar, o machaca a fondo.", "Agregue la harina, el parmesano y una cucharada de aceite de oliva. Batir juntos hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Use sus manos para juntar la masa y enrollarla en forma de salchicha larga. Cortar en piezas de 2-3cm / ¾-1¼in de largo.", "Pon a hervir una olla grande de agua y cocina los ñoquis hasta que flote a la superficie (aproximadamente un minuto). No llene la sartén, es posible que deba cocinar los gnocchi en tandas.", "Retire los ñoquis del agua con una espumadera y escurra. Repita el proceso con cualquier masa restante.", "Calentar una sartén hasta que esté caliente y luego agregar el aceite de oliva restante. Agregue los gnocchi y fría hasta que estén dorados. Dejar de lado.", "Para la salsa de espinacas y brócoli, caliente la mantequilla en una sartén grande a fuego medio. Agregue los piñones a la sartén y cocínelos durante tres minutos o hasta que estén ligeramente dorados.", "Agregue el ajo a la sartén y cocine por un minuto. Agregue las espinacas a la sartén y cocine por un minuto, o hasta que la espinaca se marchite.", "Agregue el caldo y cocine durante cuatro minutos, luego agregue la crema y cocine por 2-3 minutos, o hasta que la salsa se espese. Sazonar con sal y pimienta y espolvorear con queso parmesano. Mezcle los ñoquis cocidos en la salsa.", "Para el brócoli frito, caliente una freidora a 180 ° C / 350 ° F, o hasta que un cubo de pan chisporrotee y se ponga dorado cuando se deje caer en el aceite.", "En un tazón, mezcle la harina común y la harina de maíz con el agua con gas. Sumerja los floretes de brócoli en la mezcla.", "Agregue las flores de brócoli al aceite caliente y fría hasta que estén crujientes. Con cuidado, retire el brócoli con una cuchara ranurada. Escurrir sobre papel de cocina y sazonar con sal y pimienta.", "Para servir, coloque los gnocchi calientes y la salsa en tazones para servir con el brócoli frito en la parte superior."], "url": "www_bbc_co_uk_food_recipes_gnocchi_in_a_creamy_77453", "title": "Gnocchi en salsa cremosa de espinaca con brócoli frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas King Edward de 300g / 10½oz", "60g / 2¼ oz de harina común", "40 g / 1½ oz de queso parmesano, finamente rallado", "1 cucharada de aceite de oliva", "75g / 2½oz de mantequilla sin sal", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 dientes de ajo, en rodajas finas", "1 chalote, picado", "Perro de 100g / 3½oz '", "1 calabacín verde y 1 amarillo, recogido en bolas con una bola parisienne (o dados)", "75g / 2½oz de mantequilla sin sal", "2 cucharadas de albahaca fresca", "4 cucharadas de queso parmesano, finamente rallado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee las papas en una bandeja para hornear durante 1 hora o hasta que estén suaves. Saque la carne y páselo a través de un ricot de papa en un tazón para mezclar, o tritúrelo a fondo. Agregue la harina, el parmesano y el aceite y bata hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Usando sus manos, junte la masa y gírela en forma de una salchicha larga. Cortar en piezas de 2-3cm / ¾-1¼in de largo.", "Ponga a hervir una olla grande de agua y cocine los ñoquis durante aproximadamente 1 minuto, o hasta que flote a la superficie. No llene la olla; es posible que necesite cocinar los gnocchi por tandas. Levante los ñoquis fuera del agua con una espumadera y escurra bien.", "Calentar una sartén hasta que esté caliente. Derrita la mantequilla, luego agregue los ñoquis y fría hasta que estén dorados. Dejar de lado.", "Para la salsa, caliente el aceite en una sartén hasta que esté caliente. Agregue el ajo y cocine por 1 minuto. Agregue la chalota y cocine por un minuto más. Agregue el nduja y los calabacines, revuelva y cocine por 4-5 minutos, o hasta que estén listos.", "Para servir, agregue los ñoquis fritos a la salsa y cocine hasta que estén calientes. Sirva salpicado con el parmesano y la albahaca."], "url": "www_bbc_co_uk_food_recipes_gnocchi_with_nduja_32034", "title": "Gnocchi con 'nduja, ajo y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas harinosas de 1 kg / 2 libras y 4 onzas, más o menos del mismo tamaño", "sal y pimienta negra", "1 huevo", "300g / 10½ oz de harina natural, más extra para espolvorear", "100 g / 3½ oz de mantequilla", "8 hojas de salvia"], "method": ["Coloque las papas sin pelar en una cacerola con abundante agua fría, lleve a ebullición y cocine hasta que las papas estén tiernas, pero sin deshacerte. Drene, deje que se enfríe un poco, luego quite las pieles. Mientras la carne todavía esté caliente, machaque las papas y déjelas enfriar. Coloque en un tazón grande, sazone con sal, mezcle el huevo, agregue la harina y mezcle para formar una masa (es posible que necesite usar las manos).", "Sobre una superficie de trabajo limpia, espolvoree un poco de harina extra y extienda la masa en cuatro formas de salchicha largas, cada una de aproximadamente 30x3 cm / 12x1¼ pulgadas. Con un cuchillo filoso, corte cada forma de salchicha en pedazos de 2cm / ¾en pedazos, y aparte.", "Coloque una cacerola grande de agua ligeramente salada sobre el fuego para hervir. Coloque los gnocchi en la olla con agua hirviendo y cocine a fuego lento hasta que se eleven hasta la parte superior.", "Mientras tanto, coloque una sartén grande sobre el fuego y derrita la mantequilla con las hojas de salvia. A medida que los gnocchi salen a la superficie, levántelos con una espumadera y agregue a la salsa de mantequilla junto con un poco de agua para cocinar. Freír suavemente durante un minuto, asegurándose de que todos los gnocchi estén cubiertos con la salsa de mantequilla, y luego sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gnocchi_with_sage_butter_26736", "title": "Ñoquis con mantequilla de salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 papas medianas", "200-300 g / 7-10½oz de sal", "Harina normal de 75 g / 2½ oz, más extra para espolvorear", "50 g / 1¾oz de parmesano rallado", "1 yema de huevo", "sal y pimienta", "botón de mantequilla", "30g / 1oz de pan rallado", "2 cucharadas de aceite vegetal", "2 salchichas de cerdo", "2 salchichas de carne", "1 cebolla, cortada en cubitos", "2 dientes de ajo, en rodajas", "200 ml / 7 fl oz existencias de jamón", "Guisantes 100 g / 3½ oz, descongelados si están congelados", "1 cucharada de crema", "1 cucharada de alcaparras", "1 cucharada de perejil seco (o use fresco si está disponible)", "½ corazón de lechuga romana", "rejilla fresca de parmesano, para servir", "1 limón, ralladura solamente, finamente rallado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Golpe ligeramente o pinche las papas. Extiende la sal en una bandeja para hornear para hacer una cama de sal y coloca las papas encima. Hornee en el horno por 45 minutos a una hora, o hasta que estén tiernos.", "Deje que las papas se enfríen hasta que estén lo suficientemente cómodas para manipularlas. Cortar por la mitad y sacar la papa cocida de las pieles.", "Triture finamente la papa o póngala en un ricer de papa. Agregue la harina, el queso parmesano y la yema de huevo. Sazonar con sal y pimienta y mezclar bien. Siga mezclando hasta que la papa forme una masa.", "Trabajando en una superficie ligeramente enharinada, divida la masa en cuatro. Enrolle cada cuarto en una forma de salchicha de unos 20 cm de largo y córtela en pedazos de 2 cm. Sacude el exceso de harina.", "Derrita la mantequilla en una sartén y fría ligeramente las migas de pan hasta que estén doradas. Incline en un tazón pequeño y reserve.", "Calentar una cucharada de aceite en la misma sartén y freír los gnocchi en tandas hasta que estén doradas por todos lados. Retire de la sartén, deje a un lado y mantenga caliente hasta que todos los gnocchi se fríen.", "Retire las pieles de las salchichas, rompa la salchicha y fría con un poco de aceite durante cuatro minutos, luego agregue la cebolla y fría por otros tres minutos hasta que todo esté dorado. Agregue el ajo y fría por otro minuto.", "Agregue el caldo, los guisantes, la crema, las alcaparras y el perejil. Haga burbujas a fuego alto para reducir ligeramente el volumen de líquido y espesar la salsa. Finalmente agregue los ñoquis fritos y caliente en la salsa por un minuto o dos.", "Para servir, divida la lechuga entre cuatro platos o cuencos, sirva los gnocchi en la parte superior, revuelva con las migas de pan fritas, el parmesano rallado y la ralladura de limón finamente rallada."], "url": "www_bbc_co_uk_food_recipes_gnocchi_with_sausage_68197", "title": "Gnocchi con carne de salchicha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas Desiree 700g / 1lb 9oz, aproximadamente cortadas en pedazos del mismo tamaño y sin pelar", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, solo yemas", "Harina normal 150g / 5½ oz", "harina de arroz, para quitar el polvo", "Cohete salvaje de 300g / 10½oz, más o menos picado", "Berros de 200g / 7oz, tallos descartados, toscamente picados", "150ml / 5½fl oz de aceite de oliva extra virgen", "1 cebolla pequeña, finamente picada", "1 diente de ajo, finamente picado", "1 chile rojo pequeño, finamente picado", "20 hojas de albahaca, aproximadamente desgarradas", "sal y pimienta negra recién molida", "parmesano recién rallado (o un queso duro vegetariano similar), para servir"], "method": ["Para los gnocchi, coloque las papas en una cacerola con abundante agua fría con sal. Llevar a ebullición y cocinar hasta que las papas estén tiernas, pero sin deshacerte (unos 15-20 minutos dependiendo del tamaño de tus papas).", "Escurrir y dejar enfriar un poco. Cuando se enfríe lo suficiente como para manipularlo, quite las máscaras. Mientras las papas aún estén tibias, aplastelas hasta que queden lisas o pasen por un ricer, luego póngalas a un lado para que se enfríen por completo.", "Sazone las papas enfriadas con sal y pimienta, agregue las yemas de huevo y agregue la harina. Junta la mezcla para formar una masa.", "Espolvoree un poco de harina de arroz en una superficie de trabajo limpia y extienda la masa en forma de salchichas largas. Con un cuchillo afilado, corte el rollo en formas de bola de masa de aproximadamente 2 cm. Dejar de lado.", "Para la salsa, pula el cohete y el berro por un minuto en agua hirviendo con sal. Retire y actualice en agua fría. Escurrir bien.", "En una sartén grande, caliente el aceite de oliva. Agregue la cebolla, el ajo y el chile y fría hasta que la cebolla esté suave y translúcida. Agregue el cohete, el berro y la albahaca y saltee por unos minutos para que se caliente. Sazone al gusto.", "Pon a hervir una olla grande de agua y vierte los gnocchi. Cocine a fuego lento hasta que se eleven de nuevo a la parte superior y luego retírelos con una cuchara ranurada. Escurra bien y mezcle con la salsa, teniendo cuidado de no romper los gnocchi.", "Sirva inmediatamente con un poco de parmesano recién rallado."], "url": "www_bbc_co_uk_food_recipes_gnocchi_with_wild_rocket_14134", "title": "Gnocchi con cohete salvaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchi_with_wild_rocket_14134_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "1 chile verde, picado", "1 cucharada de vinagre de vino blanco", "1 cucharadita de azúcar en polvo", "3 tomates de ciruela picados", "sal y pimienta negra recién molida", "200 g / 7 oz de ñoquis preparados, cocinados según las instrucciones del paquete", "1 cucharada de aceite de oliva"], "method": ["Para la salsa arrabbiata, caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo hasta que estén blandos. Agregue el chile, el vinagre y el azúcar y mezcle bien.", "Agregue los tomates picados y cocine a fuego lento hasta que los tomates se rompan y se vuelvan pastosos. Condimentar con sal y pimienta.", "Pon los gnocchi en un tazón para servir y rocía con aceite. Sazone con sal y pimienta y revuelva.", "Vierta la salsa sobre los ñoquis y sirva."], "url": "www_bbc_co_uk_food_recipes_gnocchiallarrabbiata_85118", "title": "Salsa de tomate picante con gnocchi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchiallarrabbiata_85118_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de espinaca congelada 2 oz, descongelada, o 650 g / 1 libra 7 oz de espinacas frescas, cocidas hasta que se marchiten", "250g / 9oz de queso ricotta", "100g / 3½ oz de parmesano, o queso duro vegetariano similar, recién rallado", "150g / 5oz de harina natural, más extra para la elaboración", "2 huevos de gallinas camperas", "nuez moscada recién rallada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "1 cebolla mediana picada", "1 zanahoria, finamente picada", "2 dientes de ajo picados", "2 x 400 g / 14 onzas de latas de tomates picados", "2 cucharadas de puré de tomate", "1 cucharadita de azúcar en polvo", "1 bouquet garni (3 ramitas generosas de tomillo fresco, 2 hojas de laurel, 2 ramitas grandes de perejil fresco, atadas con una cuerda)", "sal y pimienta negra recién molida", "parmesano recién rallado o queso duro vegetariano similar"], "method": ["Para los gnocchi, coloca la espinaca congelada descongelada o la espinaca fresca cocida en un colador para escurrir. Exprima la mayor cantidad de agua posible y luego pese las espinacas; debe tener 250 g / 9 oz de espinacas después de que haya extraído toda el agua. Córtalo finamente.", "Coloque la ricota en un tazón grande y bata hasta que quede suave. Agregue la espinaca, parmesano, harina, huevos y un montón de nuez moscada. Sazone generosamente con sal y pimienta negra recién molida y mezcle bien con sus manos, asegurándose de que esté uniformemente mezclado. Cubra y deje en la nevera durante una hora o más antes de pasar al siguiente paso.", "Para la salsa, caliente el aceite en una sartén grande y fría la cebolla y la zanahoria lentamente hasta que estén tiernas. Añadir el ajo y cocinar por otro minuto.", "Agregue los tomates, el puré de tomate, el azúcar impalpable y el bouquet garni, luego sazone con sal y pimienta negra recién molida y revuelva. Deje que hierva a fuego lento durante unos 30 minutos, revolviendo con frecuencia para evitar que se enganche en el fondo, e incluso agregue un chorrito de agua si es necesario. Retirar del fuego, quitar el bouquet garni y dejar enfriar un poco.", "Coloque la mezcla de tomate en un procesador de alimentos y mezcle hasta que quede suave, luego reserve.", "Dragar un plato grande con mucha harina. Tome cucharadas de la mezcla de ricotta fría, enrolle bolas limpias, luego enrolle la harina. Coloque en una bandeja enharinada y déjela a un lado hasta que la necesite.", "Poco antes de que tengas la intención de comer los ñoquis, pon una olla grande y poco profunda a hervir, luego baja la temperatura a fuego lento. Con cuidado, agregue los ñoquis a la sartén, teniendo cuidado de no sobrepoblar, y cocine durante 10-15 minutos, volteándolos de vez en cuando.", "Mientras tanto, vuelva a calentar suavemente la salsa de tomate.", "Cuando los gnocchi estén cocidos, quítelos del agua con una espumadera y colóquelos en platos calientes, o en un plato grande para servir, y vierta sobre la salsa de tomate. Espolvorear con parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_gnocchidispinacieric_85614", "title": "Gnocchi de espinaca y ricotta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchidispinacieric_85614_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "½ cebolla, picada", "1 diente de ajo, picado", "50ml / 2fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "100g / 3½oz Puente el queso Bishop, picado", "sal y pimienta negra recién molida", "150 g / 5½ oz de ñoquis preparados, cocinados de acuerdo con las instrucciones del paquete", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la salsa de queso, caliente la mantequilla en una sartén a fuego medio y fría la cebolla y el ajo hasta que estén suaves.", "Agregue el vino blanco y cocine a fuego lento hasta reducir a la mitad. Agregue la crema doble y cocine a fuego lento suavemente.", "Agregue el queso, sazone bien con sal y pimienta negra recién molida y caliente hasta que el queso se haya derretido.", "Para los gnocchi, coloque los gnocchi en un recipiente para servir y rocíe con aceite. Sazonar, al gusto, con sal y pimienta negra recién molida y revolver.", "Para servir, vierta la salsa sobre los gnocchi."], "url": "www_bbc_co_uk_food_recipes_gnocchiwithcheesesau_85119", "title": "Gnocchi con salsa de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb 5 oz patatas harinas (tales Russets), sin pelar", "1 huevo grande de gallinas camperas", "sal y pimienta negra recién molida", "Harina simple de 450g / 1lb", "aceite de oliva, a llovizna", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 zanahoria, finamente picada", "1 apio en barra, finamente picado", "4 dientes de ajo, finamente picados", "1 chile rojo, finamente picado", "1 pimiento rojo, finamente picado", "Puré de tomate 150 g / 5 oz", "450ml / 16fl oz de vino tinto", "450ml / 16fl oz de caldo de pollo", "ramita de romero fresco", "Pata de pato confitado lista para usar de 450 g / 1 lb, carne extraída del hueso", "Queso pecorino, afeitado, para servir"], "method": ["Para los ñoquis, hervir las papas durante unos 40 minutos, hasta que estén tiernas. Retirar del fuego, escurrir y dejar enfriar. Una vez que esté frío, machaque bien en un tazón.", "Haga un pozo en el centro del puré de papa, agregue el huevo al centro y sazone con sal y pimienta negra recién molida.", "Agregue la harina y mezcle bien para formar una masa. Amasar la masa durante 3-4 minutos, hasta que esté seca al tacto.", "Divide la masa en tres pedazos. Sobre una superficie limpia y bien enharinada, extender la masa en longitudes de 2cm / 1in de diámetro, luego cortar en pedazos a intervalos de 2cm / 1in.", "Coloque estas piezas de gnocchi en agua hirviendo y cocine por 2-3 minutos. Cuando suben a la cima están cocinados. Saque con una cuchara ranurada y revuelva en agua helada. Escurrir, rociar con aceite de oliva y dejar de lado.", "Para el pato ragu, caliente el aceite en una cacerola grande a fuego medio. Agregue las cebollas, las zanahorias, el apio, el ajo, el chile y la pimienta y fría por 5-6 minutos, o hasta que estén blandos.", "Agregue el puré de tomate, mezcle bien y cocine durante 7-8 minutos, hasta que la mezcla se vuelva de color rojo intenso.", "Agregue la ramita de vino, caldo y romero y deje hervir.", "Agregue la carne de pato y reduzca el fuego a fuego lento durante 45 minutos a una hora, o hasta que la carne se deshaga.", "Finalmente agregue los gnocchi al ragu y caliente.", "Para servir, espolvorear en tazones y adornar con virutas de queso Pecorino."], "url": "www_bbc_co_uk_food_recipes_gnocchiwithduckragu_84330", "title": "Gnocchi con ragú de pato", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ paquete gnocchi, cocinado", "puñado de cohetes, finamente picado", "1 limón, cáscara y jugo solamente", "5-6 cucharadas de aceite de oliva", "55 g / 2 oz de queso parmesano, finamente rallado"], "method": ["Mezcle todos los ingredientes del pesto.", "Agregue los gnocchi y revuelva para cubrir.", "Espolvoree más parmesano y sirva."], "url": "www_bbc_co_uk_food_recipes_gnocchiwithpesto_72119", "title": "Gnocchi con pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 ajo, clavo de olor", "½ cucharadita de vinagre de vino tinto", "½ cucharadita de azúcar en polvo", "150ml / 4½fl oz pasado", "albahaca pequeña, picada", "125 g / 4oz de ñoquis preparados, cocinados según las instrucciones del paquete", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría hasta que se ablanden.", "Agregue el vinagre y el azúcar y revuelva hasta que el azúcar se haya disuelto.", "Agregue la passata, lleve a ebullición, luego reduzca el fuego a fuego lento durante 5-6 minutos.", "Agregue la albahaca y la temporada, al gusto, con sal y pimienta negra recién molida.", "Agregue los gnocchi y revuelva bien para cubrir.", "Para servir, coloque los gnocchi y la salsa en un bol y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gnocchiwithtomatoand_84285", "title": "Gnocchi con tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de mantequilla", "Papas nuevas de 300 g / 10½ oz, preferiblemente aura, en rodajas finas", "700ml / 1¼ pinta de caldo de pollo", "700g / 1lb 9oz de patatas harinas", "Harina de pasta de 90 g / 3¼ oz \"00\", con un poco más para quitar el polvo", "10 g de almidón de patata", "2 yemas de huevo de gallinas camperas", "rociar aceite de oliva, para engrasar", "Huevas de fletán 400 g / 14oz, cortadas y sin membranas", "1 limón, solo jugo", "Guisantes 200 g / 7 oz, envasadas", "Habas jóvenes de 400 g / 14 oz, envasadas", "Mangetout de 200 g / 7 oz, finamente cortado, para servir", "puñado de hierbas con flores (como el perifollo, el cebollín, el ajo silvestre), para servir"], "method": ["Derretir 75 g / 2½ oz de mantequilla en una cacerola a fuego medio y cocinar las patatas nuevas en rodajas durante 1 minuto. Cubra con caldo, cocine a fuego lento y cocine por 10 minutos. Retirar del fuego y dejar enfriar en la sartén durante 1 hora.", "Mientras tanto, precaliente el horno a 200C / 180C Fan / Gas 5.", "Hornee las papas harinosas durante una hora o hasta que estén cocidas y esponjosas. Extraiga la carne y páselo por un colador más fino o fino en un recipiente limpio.", "Mezcle el puré de papa con la harina '00', el almidón de papa, las yemas de huevo y la sal hasta que se combinen.", "En una superficie ligeramente enharinada, extienda la masa en salchichas largas alrededor del grosor de su pulgar. Cortar en pedazos de la misma longitud (aproximadamente 1-2 pulgadas).", "Ponga a hervir una olla grande de agua con sal y coloque cuidadosamente los ñoquis con una espumadera. Hierva hasta que el gnocchi flote a la superficie. Retirar con una cuchara ranurada y colocar en una bandeja de horno engrasada. Reserve en un lugar cálido mientras termina el plato.", "Cuele el líquido de cocción de las papas nuevas en una sartén limpia, luego agregue la mitad de las rodajas de papa cocidas (puede reservar la otra mitad para el desayuno). Mezcle el caldo con una batidora y agregue sal al gusto. Llevar la sartén a fuego lento a fuego lento y agregar un poco de mantequilla, luego darle una espuma final con la batidora.", "Derrita 50 g / 1¾ oz de mantequilla en una sartén a fuego medio hasta que forme espuma. Cocine las huevas hasta que estén opacas, esto debería tomar 2-3 minutos por cada lado. Retire de la sartén y sazone con jugo de limón y sal y corte en rodajas.", "Poner a hervir una olla de agua con sal y cocinar las habas y los guisantes durante 1-2 minutos, hasta que estén tiernos.", "Para servir, coloque los guisantes y los frijoles entre 4 platos calentados. Agregue las huevas y los gnocchi, vierta sobre el caldo de patata y adorne con el mangetout en juliana y las hierbas en flor."], "url": "www_bbc_co_uk_food_recipes_gnocci_with_halibut_roe_93269", "title": "Gnocchi con huevas de halibut, guisantes y habas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de azúcar en polvo", "8 huevos medianos de granja", "Harina normal de 250g / 9oz", "50g / 1¾oz de mantequilla, derretida", "250 g / 9 oz de arándanos", "100 g / 3½ oz de azúcar en polvo", "Crema doble 500ml / 18fl oz", "1 vaina de vainilla, cortada a la mitad a lo largo y semillas raspadas", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos moldes para pasteles redondos de 22 cm.", "Para la esponja génoise, coloque el azúcar y los huevos en un tazón grande y bata hasta que estén gruesos y pálidos.", "Doble la harina y la mantequilla derretida y divídalo entre las latas de torta preparadas.", "Hornee en el horno durante 20-30 minutos, o hasta que los pasteles se levanten y sean elásticos al tacto. Retirar del horno y reservar para enfriar. Cuando se enfríe lo suficiente como para manipularlo, enciéndalo en una rejilla para que se enfríe por completo.", "Para la compota de arándanos y la crema de vainilla, coloca los arándanos, el azúcar y las cuatro cucharadas de agua en una cacerola pequeña. Coloque a fuego medio y cocine a fuego lento durante cinco minutos. Retirar del fuego y reservar para enfriar y espesar.", "Coloque la crema en un tazón grande y agregue las semillas de vainilla. Batir hasta que espese.", "Para servir, extender la compota enfriada sobre la parte superior de una torta y cubrir con la crema batida. Coloque la otra torta encima y espolvoree con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_gnoise_sponge_with_69988", "title": "Esponja Génoise con compota de arándanos y crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 x 22cm / 9en pastel", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]