[{"isVegetarian": true, "title": "Tomato tagliatelle", "url": "www_bbc_co_uk_food_recipes_tomatotagliatelle_90689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed to a paste in a mortar and pestle", "1 vine tomato, seeds removed and chopped", "2 tbsp white wine vinegar", "1 tsp caster sugar", "100g/3½oz dried tagliatelle, cooked according to packet instructions, drained", "2 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and gently fry the onion and garlic for 2-3 minutes, or until softened. Stir in the chopped tomato, vinegar and sugar and cook for a further 3-4 minutes, or until the sugar has dissolved. ", "Using a stick blender, process the sauce until smooth, then stir in the cooked tagliatelle and heat through. ", "Transfer the pasta onto a serving plate and garnish with the chopped chives."]}, {"isVegetarian": false, "title": "Tom kha soup", "url": "www_bbc_co_uk_food_recipes_tomkhasoup_93592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece galangal or ginger, peeled, roughly chopped ", "2 garlic cloves, peeled", "1 stalk lemongrass, bruised", "small bunch fresh coriander, leaves chopped, roots reserved", "1-2 shallots, peeled, quartered ", "1 medium green chilli, seeds removed, roughly chopped", "3 fresh or 6 dried kaffir lime leaves ", "2 limes, zest only", "1 tbsp olive oil ", "1 litre/1¾ pint boiling water", "1 chicken or vegetable stock cube ", "400ml/14fl oz coconut milk ", "3 tbsp fish sauce ", "8 tiger or king prawns, shelled, de-veined", "handful enoki mushrooms ", "handful shimeji mushrooms", "4 shiitake mushrooms, chopped", "handful sugar snap peas ", "100g/3½oz soba noodles", "1-2 limes, juice only, plus more to serve  ", "salt and freshly ground black pepper", "small handful thai basil leaves", "small handful shiso cress", "1 green chilli, sliced"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the paste, blend the paste ingredients in a food processor until smooth. ", "For the soup, heat the olive oil in a large saucepan and fry the paste over a medium heat for 2-3 minutes.", "Stir in the coconut milk and fish sauce.", "Pour in the boiling water, and crumble in the stock cube. ", "Add the prawns, and allow them to cook in the broth for 3-4 minutes, or until the prawns have turned pink and opaque.", "Add the mushrooms and sugar snap peas, and continue to cook for a further 2-3 minutes.", "Cook the soba noodles in a large pan of boiling water following pack instructions, then drain.", "To serve, add the lime juice to the soup and season, to taste, with salt and freshly ground black pepper.", "Divide the drained noodles between four bowls, and ladle over the soup. Garnish with thai basil leaves, shiso cress, the coriander leaves, and sliced chilli.", "Squeeze over a little more lime juice to taste."]}, {"isVegetarian": false, "title": "Tom's fried chicken in a basket", "url": "www_bbc_co_uk_food_recipes_toms_fried_chicken_in_a_83178", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_fried_chicken_in_a_83178_16x9.jpg", "ingredients": ["9 chicken pieces of your choice (such as thighs, drumsticks or breast on the bone)", "500ml/18fl oz buttermilk", "100g/3½oz plain flour", "50g/1¾oz cornflour", "2 tsp ground dried oregano", "2 tsp chilli powder", "2 tsp ground dried sage", "2 tsp dried basil", "2 tsp dried marjoram", "2 tsp ground white pepper ", "4 tsp table salt", "2 tbsp sweet paprika", "2 tbsp smoked paprika", "2 tsp onion salt", "2 tsp garlic powder", "oil, for shallow frying", "coleslaw, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the chicken pieces in a container, cover with the buttermilk and refrigerate for 12 hours.", "Preheat the oven to 180C/375F/Gas 4.", "Mix together the flours with the dried spices and herbs on a large plate. Remove the chicken from the buttermilk and shake off as much of the buttermilk as possible. Roll the chicken pieces around in the dry mix until coated.", "Heat a large frying pan over a medium-low heat and add a glug of oil. Fry 2-3 pieces of chicken at a time (do not crowd the pan) until golden-brown all over and cooked through. When cooked, drain the chicken on kitchen paper and then transfer to a roasting tin.", "Put the chicken pieces in the oven until the coating is crunchy rather than crisp (up to 15 minutes).", "Serve in a basket with some coleslaw."]}, {"isVegetarian": false, "title": "Turkey roll with Christmas crumble topping and sage and onion stuffing", "url": "www_bbc_co_uk_food_recipes_toms_turkey_roll_with_44115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_turkey_roll_with_44115_16x9.jpg", "ingredients": ["100g/3½oz pork scratchings ", "100g/3½oz sourdough bread, broken into pieces and baked until crisp", "100g/3½oz shelled pistachios, roughly chopped", "50g/1¾oz dried cranberries, roughly chopped", "2 tbsp fresh thyme leaves", "1 orange, zest only", "800g/1lb 12oz sausage meat", "400g/14oz onion, finely chopped and fried until translucent, cooled", "100g/3½oz cooked and peeled chestnuts, finely chopped", "160g/5½oz fresh breadcrumbs", "1 bunch fresh sage, chopped", "2 tsp salt", "3 tsp cracked black pepper", "100g/3½oz dried cranberries", "1 tbsp juniper berries, crushed", "20 rashers smoked streaky bacon (approximately 250-300g/9-10½oz)", "2-2.2kg/4lb 8oz-5lb boneless and skinless turkey breast ", "140g/5oz brown sauce", "bread sauce, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the crumble topping, crush the pork scratchings and the sourdough pieces in a bowl. Add the pistachios, cranberries and thyme. Mix with your hands and set aside in a covered container.", "For the stuffing, mix together all the ingredients apart from the bacon.  Mix to combine. ", "Trim any bits of fat or membrane from the turkey. With a sharp knife, open out the turkey breast as if you are butterflying it. Place the turkey between two sheets of cling film and flatten it out a little with a rolling pin. ", "Cut two large pieces of aluminium foil and lay the turkey breast on top. Season with salt and pepper. Spread a generous dollop the stuffing mix in a 5mm/¼in layer onto the turkey breast and then use the foil to help you roll it up like a Swiss roll. Completely encase the turkey in the two layers of foil and secure with cook's string at regular intervals along the length of the roll. Place in the fridge until needed.", "Preheat the oven to 120C/250F/Gas ½. ", "Add 400ml/14fl oz boiling water to a deep roasting tin. Place a wire rack in the tin and place the rolled turkey breast on top. Cover the roasting tin with aluminium foil. ", "Roast in the oven for 1½-2 hours, then check the core temperature with a meat thermometer. You are looking for a temperature of 70C/160F. If it is not ready, place back into the oven and continue to cook until it reaches 70C/160F. Once cooked, remove from the oven, cover with aluminium foil and set aside to rest for 40 minutes. When cool enough to handle, remove the string and foil.", "For the stuffing, preheat the oven to 170C/325F/Gas 3 and line a terrine mould or flameproof bowl with the streaky bacon, leaving some excess hanging over the sides. Pack the mould with the remaining stuffing mix and wrap the bacon over the top.", "Bake in the oven for 45 minutes, or until the middle has reached 70C/160F on a meat thermometer. When cooked, remove from the oven and set aside to rest for 20 minutes. ", "After 20 minutes, turn out the stuffing and pat dry. Heat the grill to hot, then grill the stuffing until the bacon is crisp.", "When rested, remove the turkey from the roasting tin and brush a thick layer of brown sauce over the top. Cover with the Christmas crumble mix, top with a little orange zest and serve straight away with the stuffing."]}, {"isVegetarian": false, "title": "Tom yum soup", "url": "www_bbc_co_uk_food_recipes_tomyumsoup_85069", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomyumsoup_85069_16x9.jpg", "ingredients": ["1 litre/2 pints chicken stock", "300ml/11fl oz water", "6 sticks lemongrass, lightly crushed", "4 fresh coriander roots, crushed", "110g/4oz fresh galangal, peeled and sliced (available from Asian supermarkets)", "8 tomatoes, cut into quarters, seeds removed", "6 kaffir lime leaves", "1-2 limes, juice only", "75ml/3fl oz tamarind water (tamarind is available from Asian supermarkets. Soak the tamarind in hot water and push the pulp through a sieve to make tamarind water.)", "3 red chillies, thinly sliced", "75ml/3fl oz fish sauce (nam pla), or to taste", "75g/3oz palm sugar (available from Asian supermarkets), use brown sugar if unavailable", "12 raw tiger prawns, shelled, gutted and split in half", "2 boneless skinless chicken breasts, cut into chunks", "1 small bunch fresh coriander, leaves", "1 small bunch fresh Thai basil, leaves (available from Asian supermarkets)", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the stock and water into a large pan over a high heat and bring to the boil.", "Add the lemongrass, coriander roots, galangal, tomatoes, lime leaves, lime juice, tamarind water and red chillies. Return to the boil, then reduce the heat and simmer for 15-20 minutes.", "Taste the stock and add as much fish sauce and palm sugar as necessary to keep the salty-sour-hot-sweet taste, then remove from the heat.", "Transfer 220ml/8fl oz of the stock into a separate pan over a high heat and bring to the boil. Add the chicken and cook for 1-2 minutes, then add the prawns and cook for a further 1-2 minutes, or until completely cooked through.", "To serve, pour the soup into two bowls and top up with the hot stock. Garnish with Thai basil, coriander and a wedge of lime."]}, {"isVegetarian": false, "title": "Tom yum soup with lime and white fish", "url": "www_bbc_co_uk_food_recipes_tomyumsoupwithlimean_74618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1½pints water or light chicken stock ", "6 small sticks of lemongrass", "12 lime leaves, torn in half (optional)", "1 long red chilli, sliced ", "20g/1oz fresh root ginger, thinly sliced ", "2 tbsp fish sauce ", "20g/1oz palm sugar or light demerara ", "200g/7oz white fish, such as cod, skin and bone removed ", "6 plump scallops ", "50mls/1¾fl oz vegetable oil  ", "handful of picked coriander leaves ", "handful of basil leaves", "2 limes, halved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the water or stock into a pan and add the lemon grass, torn lime leaves, chilli, ginger, fish sauce and sugar.", "Bring to the boil, then reduce the heat to very low and leave to infuse for 10 minutes. ", "Cut the white fish into 1cm square cubes and drop into the broth. ", "Quickly heat a griddle or frying pan and rub the scallops with a little oil. ", "Carefully place scallops in the pan, and don't touch for three minutes, until you can see the scallops colouring around the edges.", "Turn them over and cook for a further three minutes. ", "Distribute the coriander and basil among six little bowls. Squeeze a little lime juice over the top and pour in the soup. ", "Place a scallop in each bowl and garnish with a stick of lemongrass."]}, {"isVegetarian": false, "title": "Tonkatsu pork", "url": "www_bbc_co_uk_food_recipes_tonkatsu_pork_20288", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tonkatsu_pork_20288_16x9.jpg", "ingredients": ["125g/4½oz tomato ketchup (you can get Japanese ketchup, but any brand will do)", "75ml/2½fl oz sake ", "2 tbsp Worcestershire sauce (Japanese is available if you can get it) ", "2 tbsp dark soy sauce", "1 garlic clove, finely grated ", "1 tsp finely grated fresh root ginger ", "1 tsp Japanese mustard or Dijon (Japanese mustard tastes like a mixture of Dijon and English mustard)", "2 tsp mirin (or more to taste)", "1 tbsp sugar ", "4 tbsp plain flour", "2 free-range eggs, beaten ", "75g/2½oz Japanese panko breadcrumbs", "pinch of salt and pepper", "4 thick pork loin steaks ", "vegetable or groundnut oil, for frying", "½ Chinese cabbage, shredded", "spring onions, finely sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, mix all the ingredients together in a small saucepan. Bring to a gentle simmer and cook for five minutes, or until the garlic and ginger are soft. You want the sauce to reach a good pouring consistency.", "Strain the sauce through a fine sieve into a small bowl. It will be served at room temperature (so do not place in the fridge). Set to one side until ready to use  ", "For the pork, place the flour, beaten egg and breadcrumbs in three individual dishes. Season the flour well with salt and pepper. ", "Coat each steak by first dipping into the flour, then the egg and finally the breadcrumbs. Re-dip each steak into the egg and breadcrumbs again - this creates an extra crisp coating. ", "Heat up a non-stick frying pan and pour the oil in for frying.", "Shallow fry the cutlets on a medium heat until golden-brown on both sides and cooked all the way through - be careful when turning the cutlets to avoid splashing the hot fat.", "Serve the pork with the tonkatsu sauce and raw the finely shredded Chinese cabbage and sliced spring onions."]}, {"isVegetarian": false, "title": "Seafood ramen", "url": "www_bbc_co_uk_food_recipes_tonkotsu_seafood_ramen_87628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2g bonito flakes", "75ml/2½fl oz sake", "7g sea salt", "500ml/18fl oz soy sauce", "½ bulb garlic, peeled and roughly chopped", "20g/¾oz fresh root ginger, peeled and roughly chopped", "⅓ red chilli, roughly chopped", "2 bunches spring onions, roughly chopped", "6 free-range eggs", "1 cluster (about 300g/10½oz) fresh root ginger, peeled and roughly chopped", "1 bulb garlic, peeled and roughly chopped", "1 bunch spring onions, roughly chopped", "1 large onion, roughly chopped", "1 small whole free-range chicken ", "20g/¾oz konbu", "20g/¾oz bonito flakes", "75g/2½oz sea salt ", "4 tbsp sake", "1 tbsp mirin", "2 tbsp rice vinegar", "1 tbsp soy sauce", "500g/1lb 2oz fresh ramen noodles", "1 whole squid, body only, prepared and cleaned ", "12 whole king prawns, peeled, tails left on, shells reserved, butterflied ", "vegetable oil, for frying", "12 clams, cleaned ", "1 spring onion, sliced", "10g/⅓oz sesame seeds", "salt and pepper"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the soy base and seasoned eggs, in a large stock pot bring 1 litre/1¾ pints water to the boil. Add the bonito flakes and cook for 10 minutes. Remove the bonito flakes using a sieve.", "Add the rest of the ingredients, except the eggs, to the bonito stock. Bring to the boil then set aside to cool.", "Boil the eggs in a saucepan of boiling water for 6 minutes 20 seconds. When cooked, run the eggs under cold water until cool enough to handle. Remove the shells and add the eggs to the stock to marinate overnight.", "For the chicken stock, put all vegetables in a large stock pot with the chicken and 4 litres/7 pints water. Bring to boil then reduce the heat and simmer for 2 hours. Throughout cooking skim off any impurities and fat which rise to the surface, reserving the fat for the garnish. This should produce a clear chicken stock.", "For the salt base, bring 300ml/10fl oz water and the konbu to the boil then simmer for 10 minutes. Remove the konbu and discard. Add bonito flakes and simmer for 10 minutes then remove the flakes using a sieve and discard. Add the remaining ingredients. When the sea salt has dissolved, turn off heat and set aside to cool. (You will make more salt base than you need.)", "For the garnish, season the squid and prawns with salt and pepper. Heat a little vegetable oil in a frying pan and cook the squid for 1-2 minutes. ", "Steam the prawns in a bamboo steamer for 4 minutes. ", "Heat two litres of the chicken stock in a saucepan. Once boiling, add the clams and prawn shells. Discard any clams that do not open. After 2-3 minutes strain the stock through a rough sieve. Retain the clams and discard the prawn shells.", "Use a fine sieve lined with muslin to filter the stock back into a clean saucepan. Bring back to the boil.", "Bring a large pan of water to boil and cook the fresh noodles for 34 seconds and drain.", "To serve, put a tablespoon of the salt base into each bowl. Add 350ml/12fl oz of the chicken stock to each bowl. Add the cooked noodles, squid, prawns, clams, a seasoned egg, halved and some slices of spring onion. Drizzle with a little chicken fat and finish with a sprinkling of sesame seeds."]}, {"isVegetarian": false, "title": "Torbay sole, spiced red wine sauce, chanterelle mushrooms and creamed potato", "url": "www_bbc_co_uk_food_recipes_torbaysolespicedredw_90444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large King Edward potatoes, peeled and cut into chunks", "salt and freshly ground black pepper ", "150ml/5fl oz double cream", "2½ tbsp unsalted butter ", "2 x 180g/6½oz fillets Torbay sole (also known as witch sole), skinned", "salt and freshly ground black pepper ", "2½ tbsp unsalted butter ", "150g/5oz chanterelle mushrooms", "2 handfuls large leaf spinach", "75g/3oz butter", "2 shallots, finely sliced", "4 black peppercorns, lightly crushed", "1 tsp Chinese five spice powder", "1 tbsp sherry vinegar", "150m/5fl oz red wine", "225ml/8fl oz fish stock", "½ bay leaf", "1 sprig fresh thyme", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the creamed potato, place the potatoes into a saucepan and cover with water. Add a pinch of salt, bring to the boil, reduce the heat and simmer for 10-12 minutes until tender.", "Drain and return to the pan. Place the pan over the heat to remove any excess moisture.", "Pass the potatoes through a potato ricer until smooth (or use a potato masher, though you will not get such a smooth result) and return the mash to the pan.", "Add the cream and butter and beat well. Season, to taste, with salt and freshly ground black pepper and set aside, keeping the mash warm.", "For the fish and spinach, season the sole fillets with salt and freshly ground black pepper. ", "Heat a frying pan until hot, add half of the butter and the sole fillets. Fry for two minutes, then turn the fish and add the mushrooms and the remaining butter to the pan. Cook for a further 2-3 minutes, or until the mushrooms are golden-brown.", "Remove the fillets from the pan and pat dry briefly on a piece of kitchen towel. Set the mushrooms aside.", "Meanwhile, heat a separate frying pan until hot, add the remaining butter and the spinach and cook until just wilted. Set aside, keeping it warm.", "For the sauce, heat a frying pan until hot, add one-third of the butter and all of the shallots. Cook for 1-2 minutes or until the shallots have softened, but not browned.", "Add the peppercorns and Chinese five spice powder to the shallots and cook for a further minute.", "Add the sherry vinegar and stir until it has absorbed into the shallots. Add the red wine, fish stock, bay leaf and thyme, bring to the boil, then reduce the heat and simmer until the mixture has reduced in volume by two-thirds.", "Strain the sauce through a fine sieve into a clean saucepan and whisk in the remaining butter and the lemon juice. Season with salt and freshly ground black pepper, to taste.", "To serve, spoon the creamed potato onto the centre of each of two serving plates and pile the spinach alongside. Lay the fish fillets on top, scatter over the mushrooms and spoon around the sauce."]}, {"isVegetarian": false, "title": "Toridashi (Pork and chicken stock)", "url": "www_bbc_co_uk_food_recipes_toridashi_pork_and_55893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz chicken wings", "1.5kg/3lb 5oz pork bones (rib bones are good for this)", "10g piece dried kombu ", "2 thick slices fresh root ginger", "250ml/9fl oz sake", "1 medium onion, cut in half", "30g/1oz bonito flakes (katsuobushi)", "6 dried shiitake mushrooms"], "serves": "Makes 2.5 litres/4½ pints", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the chicken wings and pork bones in a roasting tin and into the preheated oven.", "Roast for 30-40 minutes, turning them half way through until golden-brown. Alternatively you can fry the bones until browned if you don’t have an oven. ", "When cooked, strain the wings and bones in a colander or large sieve and then pour a kettle of boiling water over them to remove excess grease.", "While the chicken is in the oven, rinse the dried kombu under cold running water. Soak the kombu in a large stock pot for 30 minutes in 2.5 litres/4½ pints cold water. The kombu will triple in size.", "Remove the kombu from the water and cut into three long strips. Return to the stockpot and bring up to a simmer. Remove from the heat and discard the kombu - do not boil the kombu in the water for a long time or the dashi will become bitter.", "Add the roasted and rinsed wings and bones along with all the remaining ingredients to the kombu water. Bring up to the boil, reduce the heat, put a lid on and simmer for two hours. Do not let the stock boil as it will become cloudy.", "After two hours, strain the stock carefully through some clean muslin or a jay cloth. Leave to drain gently for 10 minutes, cool and refrigerate until required."]}, {"isVegetarian": false, "title": "Shredded satay chicken", "url": "www_bbc_co_uk_food_recipes_tornsataychicken_80142", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range skinless chicken breasts", "70g/2½oz rice noodles", "3 garlic cloves, crushed", "1 small handful fresh coriander, torn into small pieces", "2 tbsp peanut butter", "3 tbsp light soy sauce", "2 tbsp clear honey", "1 tsp chilli oil", "1 tbsp balsamic vinegar", "1 cucumber, peeled and cut into thin strips"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the chicken under the grill and cook the chicken for 7-8 minutes on each side, turning once, until golden and cooked through. Remove from the grill once cooked and leave to cool slightly.", "Place the noodles into a large heatproof bowl and pour boiling water over to cover. Leave to cook for five minutes then drain and allow to cool.", "Place the warm chicken breast onto a sturdy flat surface and beat with a rolling pin and then shred to pieces.", "Place the garlic, coriander, peanut butter, soy sauce, honey, chilli oil and vinegar into a food processor and blend until smooth.", "To serve, place the noodles on plate, top with the cucumber strips followed by the shredded chicken breast. Drizzle lightly with the peanut sauce."]}, {"isVegetarian": true, "title": "Soft chocolate nougat (torrone molle)", "url": "www_bbc_co_uk_food_recipes_torrone_molle_soft_62924", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torrone_molle_soft_62924_16x9.jpg", "ingredients": ["125g/4½oz almonds, blanched", "200g/7oz unsalted butter, softened", "200g/7oz granulated sugar", "100g/3½oz best-quality unsweetened cocoa powder", "1 large free-range egg, preferably organic", "the yolk of 1 large free-range organic egg", "100g/3½oz digestive biscuits", "3 tbsp orange-flavoured liqueur", "candied flowers or sugared almonds or whipped cream, to decorate"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Spread the almonds on a baking tray and bake for 7-10 minutes, or until they turn golden-brown. Grind them coarsely in a food processor, being careful to stop when they resemble grains of rice.", "Cream together the butter and sugar in a bowl until light and fluffy.", "Sieve the cocoa and add it to the butter and sugar. Beat hard to incorporate. ", "Lightly beat together the whole egg and the egg yolk and then add the eggs to the mixture. Stir well until everything is well blended together.", "Crush the biscuits with a rolling pin, add to the mixture together with the ground almonds and the orange-flavoured liqueur. Mix thoroughly.", "Line a 20x10cm/8inx4in loaf tin with cling film and spoon the mixture into it pressing down all the time to eliminate any air bubbles and, when it is all in, bang the tin hard on the work surface. Cover with cling film and chill for at least four hours.", "Get an oval dish, turn the tin upside down over it and peel off the cling film.", "Decorate with candied flowers or sugared almonds or whipped cream before serving."]}, {"isVegetarian": true, "title": "Honey and chestnut cake", "url": "www_bbc_co_uk_food_recipes_torta_di_serretto_00934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_di_serretto_00934_16x9.jpg", "ingredients": ["225g/8oz butter, cubed, plus extra for greasing ", "250g/9oz honey, plus 1-2 tbsp to glaze ", "100g/3½oz light brown sugar", "3 large free-range eggs", "300g/10½oz Tipo 00 flour", "2 tsp baking powder", "1 tsp fennel seeds", "6 tbsp chopped cooked chestnuts (freshly roasted, tinned or vacuum-packed)", "4 tbsp pine nuts", "1 tsp flaky sea salt", "thick cream, to serve (optional)"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Butter and line a 20cm/8in or 23cm/9in springform cake tin. ", "Put the cubed butter in a saucepan with the honey and sugar and melt them together slowly, stirring occasionally.  Once dissolved, bring the mixture to a boil and simmer for one minute, turning the heat down as necessary to ensure the pan doesn't boil over. Set aside to cool for 20 minutes.", "Beat the eggs together in a jug, then stir them into the cooled honey mixture. Sift the flour and baking powder into a large mixing bowl and make a well in the centre.  ", "Pour the honey mixture into the flour and stir, gradually incorporating the flour. As soon as it is well combined, stir in the fennel seeds and four tablespoons of the chopped chestnuts.", "Pour the cake batter into the prepared tin. Combine the remaining chestnuts with the pine nuts and flaky sea salt in a small bowl and sprinkle them over the top of the cake. ", "Bake for 45-60 minutes, or until the cake has risen and a skewer inserted into the centre comes out clean.", "Leave the cake to cool in the tin for five minutes, then turn it out onto a wire rack. ", "Warm two tablespoons of honey in a small pan until runny, then brush it generously over the top of the cake. You can serve the cake warm with cream as a dessert, or leave it to cool completely, wrap in foil and store in an airtight tin, where it should keep for four days."]}, {"isVegetarian": true, "title": "Torta menjar blanc", "url": "www_bbc_co_uk_food_recipes_torta_menjar_blanc_99276", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_menjar_blanc_99276_16x9.jpg", "ingredients": ["350g/12oz plain flour", "150g/5½oz icing sugar", "175g/6oz butter, chilled and cut into cubes", "1 unwaxed lemon, finely grated zest only", "2 free-range eggs, beaten ", "salt", "1 litre/1¾ pint whole milk", "1 vanilla pod, split lengthways", "2 sticks cinnamon", "1 unwaxed lemon, finely grated zest only", "6 free-range egg yolks", "150g/5½oz caster sugar", "100g/3½oz cornflour", "egg white, for brushing", "icing sugar, to serve"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, by hand or using a stand mixer, mix the flour and icing sugar with a pinch of salt, then rub in the butter. Stir in the lemon zest, then mix in the eggs until you have a smooth dough – you might not need all of them. Form into two balls, one slightly larger than the other, and wrap in cling film. Chill for at least an hour, preferably overnight.", "Meanwhile, to make the filling, put the milk in a saucepan and add the vanilla pod, cinnamon sticks and lemon zest. Bring to the boil and leave to infuse until the milk has cooled to room temperature. ", "Whisk the egg yolks and caster sugar together in a heatproof bowl until increased in volume and mousse-like. Sieve in the cornflour and whisk until well combined. ", "Reheat the milk and strain into a jug, then rinse the saucepan. Pour the milk from a height in a steady stream over the egg and sugar mixture, whisking constantly. Pour the mixture into the saucepan. ", "Stir constantly over a medium heat for 5 minutes, or until the custard has thickened. Transfer to a jug or bowl and cover with cling film touching the custard to prevent it from forming a skin. Chill until you are ready to bake the tart. ", "Preheat the oven to 180C/Fan 160C/Gas 4.", "Roll out the larger piece of pastry and use it to line a 23cm/9in tart or shallow cake tin – preferably a loose-bottomed one. Trim. Pierce with a fork all over and chill in the fridge for half an hour. ", "Spread the custard over the base of the tart. Roll out the remaining piece of dough and use it to cover the tart. Dampen the edges with water and crimp together. ", "Brush the tart with egg white. Bake for 40 minutes. Leave to cool before chilling. Serve dusted with icing sugar."]}, {"isVegetarian": true, "title": "Torta nera (chocolate walnut tart)", "url": "www_bbc_co_uk_food_recipes_torta_nera_chocolate_02131", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_nera_chocolate_02131_16x9.jpg", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "pinch of salt", "100g/3½oz butter, chilled, cut into small pieces", "50g/1¾oz caster sugar ", "2 free-range egg yolks", "230g/8oz walnuts, plus extra to decorate", "200g/7oz  caster sugar", "3 free-range eggs", "50g/1¾oz butter, melted", "65g/2¼oz amaretti biscuits, roughly crushed", "75g/2½oz dark chocolate, grated", "1 tbsp plain flour", "1 tbsp instant coffee powder, dissolved in a little hot water", "50ml/2fl oz almond liqueur", "icing sugar, to decorate", "mascarpone, to serve"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and butter a 23cm/9in deep, fluted, loose-bottomed tart tin.", "To make the pastry, put the flour and salt in a bowl and rub in the butter with your fingertips until the mixture resembles coarse breadcrumbs. Add the sugar and mix in the egg yolks. Bring the dough together without kneading and wrap in cling film. Put it in the fridge for 30 minutes.", "Roll out the pastry on a lightly floured surface and use it to line the prepared tart tin. Cover the pastry with greaseproof paper and fill with baking beans. Bake blind for 10–12 minutes. Remove the baking beans and greaseproof paper and return to the oven for 5–6 minutes, or until lightly golden. Leave to cool.", "Reduce the oven temperature to 180C/160C Fan/Gas 4.", "To make the filling, blend the walnuts with 100g/3½oz sugar in a food processor until finely ground.", "Whisk the eggs with the remaining sugar. Carefully stir in the melted butter, ground walnut mixture, amaretti biscuits, chocolate, flour, coffee and almond liqueur. Mix well.", "Spoon the filling into the tart case. Decorate with the whole walnuts and bake in the middle of the oven for 25 minutes.", "Serve warm with a sprinkling of icing sugar and a small scoop of mascarpone."]}, {"isVegetarian": true, "title": "Torta di mele e mandorle (mini apple and almond pie)", "url": "www_bbc_co_uk_food_recipes_tortadimeleemandorle_71747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.4kg/3lb cooking apples, peeled, cored and roughly sliced", "100g/3½oz soft brown sugar", "3 eggs", "200g/7oz caster sugar", "200g/7oz butter, softened", "200g/7oz ground almonds", "sliced almonds for decoration"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "Put the apples and brown sugar in a large pan and cook over a low heat until soft.", "In a large bowl beat the eggs with the caster sugar then mix in the butter and ground almonds to create a smooth paste.", "Divide the cooked apples between six ramekins and spread the almond mixture on top.", "Sprinkle some sliced almonds on top of each and and cook for about 50 minutes until golden brown.", "Serve hot with cream or ice cream."]}, {"isVegetarian": true, "title": "Torta pasquale", "url": "www_bbc_co_uk_food_recipes_tortapasquale_88435", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortapasquale_88435_16x9.jpg", "ingredients": ["25g/1oz butter, for greasing", "2 tbsp plain flour, for dusting", "5 free-range eggs, plus 1 free-range egg, beaten, for brushing", "200g/7oz spinach", "110g/4oz dandelion leaves or rocket", "2 tbsp extra-virgin olive oil", "1 onion, finely chopped", "500g/1lb 2oz ricotta cheese", "50g/2oz parmesan, or similar vegetarian hard cheese, grated", "110g/4oz provolone cheese, or similar vegetarian alternative, cut into small cubes", "salt and freshly ground black pepper", "500g/1lb 2oz ready-made puff pastry", "300g/10½oz fresh or frozen broad beans (shelled weight)    ", "5 small celery sticks, finely chopped into matchsticks 3cm/1in long ", "large handful rocket  ", "12 mint leaves, roughly torn  ", "4 tbsp extra virgin olive oil, plus extra for drizzling", "1 small lemon, juice only", "110g/4oz pecorino cheese, or similar vegetarian alternative, shaved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease a 28cm/11in round, deep pie dish with butter, then dust with flour.", "For the torta, place five of the eggs into a pan of boiling water and boil for ten minutes. Drain and place the eggs into cold water and leave to cool. Once cool, remove the shells and cut the eggs in half lengthways.", "Wash the spinach and dandelion leaves and shake to remove the excess water.", "Heat a large pan with a lid until hot, then add the spinach and dandelion leaves and cover. Cook for 4-5 minutes, until steamed and wilted down. Drain the spinach and dandelion mixture, and, once cool enough to handle, squeeze out any excess liquid. Roughly chop the spinach and dandelion mixture and place into a bowl.", "Heat a frying pan over a medium heat and add the olive oil and onion. Fry the onion gently for a few minutes until softened, then set aside and allow to cool.", "Add the cooked onion to the spinach and dandelion and mix well.", "Add the ricotta and parmesan and mix well.", "Add the provolone, season, to taste, with salt and freshly ground black pepper and mix well.", "Roll out about half of the puff pastry to 0.5cm/¼in thick and use to line the prepared pie dish.", "Fill the pie case with half of the spinach and cheese mixture.", "Add the boiled egg halves, yolks down, evenly spaced, then top with the remaining spinach mixture.", "Brush the edge of the pastry with a little beaten egg.", "Roll out the remaining puff pastry to the same thickness as the first sheet, and place over the pie filling, pressing down the edges well. Trim away any excess pastry and crimp the edges with your fingers, so that the pie is well sealed.", "Make a small incision the shape of a cross into the centre of the pastry top to allow steam to escape during baking. ", "Brush the top of the pastry with beaten egg, then transfer to the oven to bake for 35-40 minutes, or until risen and golden-brown all over. Remove from the oven and allow to cool.", "For the salad, boil the broad beans for one minute, then drain and refresh in cold water.", "In a large clean bowl, place the celery, rocket and mint. Add the cooled broad beans and mix well.", "Place the olive oil and lemon juice into a small clean bowl and whisk until it starts to thicken. Pour the dressing over the salad and mix well.", "To serve, place a slice of the torta onto each plate and spoon some of the salad alongside. Drizzle everything with a little extra virgin olive oil and top with shavings of pecorino cheese."]}, {"isVegetarian": false, "title": "Tortelli(less) di zucca", "url": "www_bbc_co_uk_food_recipes_tortelliless_di_zucca_63852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz olive oil", "13 garlic cloves, chopped ", "pinch dried chilli flakes ", "1 litre/1¾ pint tomato passata", "2 tsp fine sea salt ", "70g/2½oz mustard fruits, syrup reserved (available online and in some Italian delis)", "1 large pumpkin, preferably Ironbark, cut into 3cm/1¼in wedges", "olive oil", "3 shallots, finely chopped", "1 small red chilli, finely chopped", "2 garlic cloves, finely chopped", "250g/9oz cavolo nero, washed and roughly chopped", "2 unwaxed lemons, finely grated zest only", "120g/4¼oz Parmesan or Grana Padano Cheese, thinly sliced", "30 large sage leaves ", "12 amaretti biscuits "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat a large saucepan and add the oil. Once hot, add the garlic and fry until golden-brown. Then add the chill, tomato passata and sea salt. Cook gently for 4-5 hours. ", "For the mustard fruit purée, place the mustard fruits and 30g/1oz of the reserved syrup in a blender and blend until smooth.", "For the pumpkin, preheat the oven 160C/140C Fan/Gas 3.", "Rub the pumpkin wedges with 4 tablespoons olive oil, season with sea salt and place onto a non-stick baking tray. Cook for approximately 20 minutes. Test with a small knife at the thicker end of the pumpkin to feel it is cooked. There should be no resistance from the pumpkin. Leave to cool and then gently peel off the skin, which can be discarded.", "Heat a large lidded pan and add some olive oil. Once hot, add the shallots, chilli and garlic and cook until soft, then add the cavolo nero. Add 4 tablespoons water to the pan, a good pinch of sea salt and cover. Cook over a medium heat, stirring regularly, for approximately 20-25 minutes or until the cavolo nero is completely soft to the bite. Drain away any excess water and leave in the pan, covered.", "Reheat the pumpkin in the oven until hot. Remove and spread a thin layer of the puréed mustard fruits on the top of the pumpkin wedges followed by the lemon zest and sliced Parmesan to cover the whole surface. Place back in the oven to soften and slightly melt the cheese. ", "Heat a small saucepan and add enough oil to cover the base of the pan. Once hot, add the sage leaves and cook until crisp. Remove from the pan using a slotted spoon and drain on kitchen paper.", "Reheat the cavolo nero and the tomato sauce. Place the cavolo nero on the plates first then dab tomato sauce on and around it. Place the pumpkin on top. Crush two amaretti biscuits over the pumpkin and finish with the deep fried sage leaves."]}, {"isVegetarian": true, "title": "Tortellini with spinach and ricotta", "url": "www_bbc_co_uk_food_recipes_tortelliniwithspinac_82375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortelliniwithspinac_82375_16x9.jpg", "ingredients": ["400g/14oz '00' flour, plus extra for dusting", "3 medium free-range eggs", "semolina, for dusting (optional)", "200g/7oz spinach, cooked in salted water and chopped", "200g/7oz ricotta", "30g/1oz grated parmesan", "large pinch freshly grated nutmeg", "salt and freshly ground black pepper", "small handful of pine nuts ", "handful sage leaves", "50g/2oz butter", "parmesan, grated or in shavings"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, pour the flour into a mound onto a flat surface and make a well in the centre. Crack the eggs into the well and gradually mix with either a blunt knife or your hands. When the dough has become a thick paste use your hands to incorporate more of the flour. ", "You can sieve any remaining flour and use the sifted flour while you knead the dough to stop it sticking to the surface and to your hands, but be careful not to make the dough too dry. Knead until well blended and the dough is soft and flexible. Don't worry if you haven't used up all the flour.", "Leave the pasta to rest for about 20 minutes with a bowl inverted over it or leave it covered in cling film. You can sieve any leftover flour again and save this flour for rolling out the pasta.", "Meanwhile, for the filling, in a clean bowl, mix the spinach, ricotta, parmesan and nutmeg well, and season with salt and freshly ground black pepper.", "Divide the fresh pasta into four and keep three portions under a bowl while you roll and stuff one quarter. This prevents the pasta from drying out. Roll out the pasta into a long, wide strip about 1mm in thickness, either by hand or using a machine. When you can see your hand through it, it is ready for stuffing. Cut the strip in half.", "Place teaspoons of the filling in a line down the centre of one of the strips about 5cm/2in apart. Place the other strip directly on top. Press the air out from around the filling by pushing down the pasta around them sealing them in. Now take a small wine glass or round cutter measuring about 7cm/3in across and cut out circles of pasta around each mound of filling.", "They can be cooked straight away or stored in fine semolina for up to two hours. You can also freeze them at this stage and then cook them from frozen when you are ready.", "To cook, bring a large pan of salted water to the boil and gently lower in the tortellini. Cook for about four minutes or until the pasta is soft but not floppy. ", "While the pasta is cooking make the sauce. Preheat the grill to hot.", "Toast the pine nuts under the grill or in a dry frying pan. They are quick to brown so don't take your eyes off them.", "Put the pine nuts, sage leaves and butter into a frying pan and melt the butter taking care not to burn it. Add about a tablespoon of the pasta water and stir together to emulsify the sauce. Remove from the heat. ", "When the pasta is done, drain it and toss with the sauce in the frying pan. Serve immediately sprinkled with parmesan."]}, {"isVegetarian": true, "title": "Tortiglioni with mushrooms and cheese", "url": "www_bbc_co_uk_food_recipes_tortiglioniwithmushr_70040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz dried ceps", "6 tbsp olive oil", "200g/7oz button mushrooms, finely sliced", "200g/7oz ricotta cheese, crumbled", "100g/4oz coarsely grated Fontina", "50g/2oz finely grated Pecorino cheese", "3 eggs, lightly beaten", "salt", "freshly ground black pepper", "375g/13oz dried tortiglioni"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the ceps in warm water for 20 minutes. Drain them, retaining the strained soaking water. Squeeze the ceps dry and finely chop them.", "Heat the oil and gently fry the button mushrooms. Add the ceps with 2-3 tbsp soaking water and cook for about 5 minutes. Remove from the heat and gently stir in the ricotta, Fontina and Pecorino cheeses, and the beaten eggs. (The eggs should not be cooked so that they remain liquid at this stage). Taste and add salt if necessary and pepper.", "Meanwhile cook the pasta for 6-7 minutes or until al dente, and drain. Return the pasta to the empty pan, and mix well with the sauce, so that the egg just starts to thicken with the heat of the pasta."]}, {"isVegetarian": true, "title": "Spanish-style tortilla", "url": "www_bbc_co_uk_food_recipes_tortilla_11230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_11230_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp olive oil", "2 large onions, finely sliced", "750g/1½lb Pink Fir Apple potatoes, peeled, parboiled and sliced into 1cm/½in pieces", "250g/8oz handful fresh spinach, cooked and roughly chopped", "10 free-range eggs, lightly beaten", "salt and freshly ground pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large, heavy-based frying pan, heat the butter and oil. Cook the onions slowly until transparent and soft.", "Add the potato slices and fry gently for two minutes.", "Stir in the spinach.", "Season the eggs with salt and freshly ground black pepper and pour onto the contents of the frying pan.", "Cook over a low to medium heat: it may take up to ten minutes until the egg is set enough to turn the tortilla over, and if the heat is too high, the bottom will burn before the middle is set.", "Once the bottom is nicely browned and the centre has set, it is time to turn it over. This is done with a  double flip: place a plate (or the bottom of a tart tin) over the pan and flip it over once, so that the cooked surface of the tortilla is on the bottom. Take another plate, and flip it again so the cooked surface is on the top. Then place the frying pan back over the tortilla plate and flip one more time, so the uncooked bit is now in contact with the base of the pan.", "Replace the pan over low heat until the tortilla is cooked through.", "Serve hot, warm or cold, cut into slices or cubes."]}, {"isVegetarian": true, "title": "Tortilla", "url": "www_bbc_co_uk_food_recipes_tortilla_28732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped", "1 red or orange pepper, deseeded and cut into rings", "50g/1¾oz mushrooms, finely sliced", "400g/14oz potatoes", "50g/1¾oz frozen peas", "4 large free-range eggs", "1 tsp grain mustard (optional)", "black pepper (optional)", "30g/1oz low-fat mature Cheddar cheese", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onion, pepper and mushrooms into a microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for four minutes.", "Meanwhile, peel the potatoes (or just scrub them if the skins are good) and slice.", "Take the dish out of the microwave, remove the vegetables and put to one side in a small bowl.", "Put the potatoes in the microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for six minutes. Allow to stand for two minutes, then check that the slices are soft. If they are not, cook on full power for another minute.", "Put the peas into a colander and pour some boiling water over them to soften them, then drain.", "Crack the eggs in a bowl, whisk well with the mustard and black pepper (if using) until frothy. ", "Mix the potatoes, vegetable mixture and peas together gently in the microwave-safe dish and pour over the eggs.", "Grate the cheese and sprinkle it into the dish over the egg.", "Cook on full power for two minutes, then remove the dish and stir the outside parts of the mixture into the centre and flatten with a spoon.", "Cook for another two minutes and repeat as in step 9.", "Cook for another two minutes and remove the dish from the microwave, cover with cling film and allow to stand for two minutes to finish cooking. If the egg is still a bit runny, cook for another minute on full power.", "Cut into wedges and serve with a tomato salad and crusty bread."]}, {"isVegetarian": false, "title": "Tortilla towers", "url": "www_bbc_co_uk_food_recipes_tortilla_towers_65545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_towers_65545_16x9.jpg", "ingredients": ["2 tsp celery salt", "1 tbsp dried oregano", "1 tsp dried chilli flakes", "1 tsp garlic salt", "2 tsp ground cumin", "1 tsp smoked paprika", "2 limes, zest and juice only", "6 chicken thighs, skin removed", "6 tomatoes, halved", "1 large red onion, cut into wedges", "2 fat red or green chillies", "1 dried chipotle chilli", "4 garlic cloves, peeled", "1 small bunch coriander", "2 limes, juice only", "salt and pepper", "3 ripe avocados", "3 tbsp soured cream", "½ lime, zest and juice", "½ lemon, zest and juice  ", "1 tbsp olive oil", "salt and pepper", "12-18 corn tortillas or flour tortillas (3 per person)", "soured cream, to taste", "200g/7oz Monterey Jack or strong cheddar cheese, grated", "1 bunch spring onions, finely chopped", "1 bunch coriander, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the spicy shredded chicken, preheat the oven to 180C/350F/Gas 4.", "Add all the dry ingredients and the lime zest to a plastic food bag. Shake the bag so that all the spices are mixed together.", "Pat dry the chicken thighs using kitchen paper and then squeeze the lime juice over the chicken flesh. One by one place the chicken thighs into the bag and coat in the spice mix. The lime is for flavour, but also helps the spices mix stick. ", "Leave the chicken to marinate for about an hour. Remove the chicken from the bag, place the coated thighs in a roasting dish and cook for 35 minutes, or until cooked through.", "Meanwhile make the roasted tomato salsa. Preheat the grill to high. Place the tomatoes, red onion wedges, chillies and garlic onto a baking tray. Lightly brush with oil.", "Place under the hot grill and cook until the tomato skins are blackened, approximately 10 minutes. ", "Place all the charred ingredients into a food processor with the chipotle chilli, coriander and lime juice. Pulse until a chunky consistency is achieved. Season to taste with salt and freshly ground black pepper. Set aside until ready to serve.", "For the guacamole, cut the avocadoes in half and remove the stone. Remove the flesh from the skin and roughly chop.  ", "Place in a bowl and lightly crush using a fork. Add the soured cream, lemon and lime juice and zest. Season to taste with salt and freshly ground black pepper and finish with a drizzle of olive oil. Set aside until ready to serve.", "For the spicy shredded chicken, once the chicken is cooked set aside to cool. When cool enough to handle, remove the meat from the bone and shred.", "To construct the tortilla towers, place a dollop of guacamole in the centre of each plate and place a tortilla on top. ", "Add a layer of guacamole, then chicken, salsa, soured cream and cheese. Add another tortilla and repeat again. Finish with sprig of coriander and a sprinkle of spring onions. "]}, {"isVegetarian": true, "title": "Tortilla chips with dips", "url": "www_bbc_co_uk_food_recipes_tortillachipswithdip_76376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "2 flour tortillas, cut into triangles", "55g/2oz mixed beans from tin", "2 garlic cloves, peeled and roughly chopped", "3-4 tbsp olive oil", "salt and freshly ground black pepper", "¼ tin tomatoes, chopped ", "2 tbsp tomato sauce", "pinch chilli powder", "Greek-style yoghurt", "Handful fresh coriander, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan one third filled with vegetable oil for deep-frying, until a crumb will sizzle gently in it. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Deep-fry the tortilla triangles for 30 seconds to one minute, or until golden, and then carefully remove and drain on kitchen paper.", "For the bean dip, blend the beans, garlic, olive oil and seasoning in a food processor until smooth. Transfer to a dish.", "For the tomato dip, blend the tinned tomato, tomato sauce and chilli powder in a food processor until smooth. Transfer to a dish.", "Serve the tortilla chips alongside the dips and serve each with the yoghurt sprinkled with fresh coriander."]}, {"isVegetarian": true, "title": "Tortilla chips with spicy yoghurt dip and corn salsa", "url": "www_bbc_co_uk_food_recipes_tortillachipswithspi_88038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "4 flour tortillas, cut into triangles", "sea salt, for sprinkling", "2 tsp chopped chipotle chillies ", "200ml/7fl oz Greek-style yoghurt", "squeeze lime juice", "¼ red pepper, finely chopped", "pinch Cajun spice seasoning", "salt and freshly ground black pepper", "dash olive oil", "1 corn-on-the-cob, kernels only", "¼ onion, finely chopped", "1 garlic clove, finely chopped", "¼ red pepper, finely chopped", "¼ yellow pepper, finely chopped", "¼ green pepper, finely chopped", "1 tsp chopped chipotle chillies ", "pinch Cajun spice seasoning", "salt and freshly ground black pepper", "2 tbsp chopped fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortilla chips, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the tortilla triangles into the hot oil and deep fry for 3-4 minutes, or until turning golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Scatter with sea salt.", "For the spicy yoghurt dip, place all the dip ingredients into a mini blender and blend to a coarse purée. Spoon into a small serving bowl.", "For the corn salsa, heat the olive oil in a medium frying pan, add the corn kernels and fry for 2-3 minutes. Add the chopped onion and fry for two minutes. Add the garlic and fry for one minute.", "Add the finely chopped peppers and fry for two minutes. Add the chipotle chillies, Cajun spice, salt and freshly ground black pepper and stir well over a gentle heat for one minute. Stir in the chopped coriander.", "To serve, spoon the salsa onto a serving plate. Place the small bowl of yoghurt dip in the middle of the serving plate and then place the crisp tortillas around the edge. Serve while the tortillas are still warm."]}]