[{"isVegetarian": false, "title": "Lamb and bulgar wheat-stuffed aubergines", "url": "www_bbc_co_uk_food_recipes_lambandbulgarwheatst_91834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, peeled, finely chopped", "1 garlic clove, peeled, crushed", "450g/1lb minced lamb", "50g/2oz raisins", "1 tsp ground cinnamon", "pinch ground cloves", "1 tbsp chopped fresh mint", "200g/7oz bulgar wheat, cooked according to packet instructions", "6 tomatoes, chopped", "2-3 large aubergines ", "100ml/3½fl oz olive oil", "salt and freshly ground black pepper", "Greek-style yoghurt", "fresh mint leaves", "pomegranate seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb and bulgar wheat stuffing, heat the olive oil in a pan and fry the onion and garlic for 4-5 minutes, or until softened.  ", "Add the lamb and fry for a further 4-5 minutes, or until browned, then add the raisins, ground cinnamon, ground cloves, mint, bulgar wheat and tomatoes. Mix well, then remove from the heat and set aside. ", "Preheat the oven to 180C/355F/Gas 4.", "For the aubergines, top and tail the aubergines, then slice each one in half to create two cylinder shapes per aubergine. Stand each aubergine piece on one end on a baking tray, and cut criss cross patterns across the tops. Brush with the olive oil, season with salt and freshly ground pepper and cook for 12-15 minutes in the oven, or until softened. ", "Remove the aubergines from the oven. Using a small glass slightly smaller than the circumference of the aubergines, press down to hollow out the aubergine (do not press down all the way through, so the aubergine flesh will be packed down towards the bottom end of the aubergine).", "Spoon the lamb and bulgar wheat mixture into the aubergines, packing the mixture in tightly. Place back into the oven for 4-5 minutes, to heat through. ", "To serve, place a piece of stuffed aubergine on each serving plate, and spoon some Greek-style yoghurt alongside. Sprinkle over the mint leaves and pomegranate seeds."]}, {"isVegetarian": false, "title": "Lamb and mint ravioli", "url": "www_bbc_co_uk_food_recipes_lambandmintravioli_87250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz type '00' pasta flour", "pinch salt", "2 free-range eggs", "3 free-range egg yolks", "handful medium semolina flour, for dusting", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "375g/13oz minced lamb", "salt and freshly ground black pepper", "4 tbsp chopped fresh mint ", "1 tbsp olive oil", "1 onion, finely chopped", "1 carrot, finely chopped", "1 stick celery, finely chopped", "4 garlic cloves, chopped", "150g/5oz tomato purée", "450ml/15¾fl oz red wine", "450ml/15¾fl oz chicken stock", "2 sprigs fresh rosemary", "parmesan shavings, to serve"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour, salt, eggs and egg yolks into a food processor and pulse to form a loose ball of dough (you may need to pulse the mixture in batches unless you've got a big food processor).", "Transfer the dough onto a clean work surface, dusted with semolina flour. Knead the dough for about three minutes, or until smooth.", "Divide the dough into eight evenly-sized balls, wrap in cling film and chill in the fridge for 20 minutes.", "Remove the dough from the fridge and run each ball through a pasta machine on the thickest setting. Repeat this process and, after each pass through the machine, fold the pasta sheet in three and turn by 90 degrees. For really silky pasta do this ten times.", "Reduce the gauge on the pasta machine to number five (or your machine's setting for ravioli) and run the pasta through the machine again. (You can make this pasta with a rolling pin, but it won't be as thin.)", "For the filling, heat the olive oil in a non-stick frying pan and gently fry the onion and garlic.", "Add the minced lamb, season well with salt and freshly ground black pepper and cook for 10-12 minutes, until the lamb is cooked through and nicely browned.", "Add the chopped mint and stir well, then set aside to cool. Drain off any excess liquid or oil from the pan.", "For the sauce, heat the olive oil in a clean non-stick frying pan, and gently fry the onion, carrot, celery and garlic for five minutes, until softened but not coloured. ", "Add the tomato purée to the pan and cook for 5-6 minutes until the mixture has become a rich red colour.", "Add the red wine, stock and rosemary sprigs to the pan, bring up to boil, then reduce the heat and simmer for 40 minutes, until thickened.", "To construct the ravioli, use a pastry cutter to cut out 7cm/3in circles out of the rolled out pasta sheet. Repeat until all the pasta has been used up.", "Spoon a little of the lamb mixture into the centre of one pasta circle and place another pasta circle on top. Wet the edge of the pasta and press down to seal (you can press with a fork to be extra sure). Repeat this process with the remaining pasta circles until all of the filling and pasta has been used.", "To cook the ravioli, bring a large pan of salted water to the boil, then carefully place the ravioli into the boiling water and cook for 3-4 minutes.", "To serve, place five ravioli onto each plate. Top with some of the sauce and sprinkle with parmesan shavings."]}, {"isVegetarian": false, "title": "Lamb and potato pie", "url": "www_bbc_co_uk_food_recipes_lambandpotatopie_83913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz lamb neck fillet, cut into chunks", "1 tbsp flour", "vegetable oil", "1 onion, sliced", "salt and freshly ground pepper", "2 carrots, sliced", "350ml/12fl oz lamb stock", "500g/1lb 2oz potatoes, peeled, cut into cubes and parboiled", "450g/1lb ready rolled shortcrust pastry", "beaten egg, to glaze"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dust the meat with flour to lightly coat.", "Heat enough vegetable oil in a large saucepan to fill the base, and fry the onion and meat until lightly browned. Season with salt and pepper.", "Add the carrots, stock and more seasoning to taste.", "Bring to the boil, cover and reduce the heat to a simmer. Simmer for at least an hour or until the meat is tender. Take your time cooking the meat, the longer you leave it to cook, the better the flavour will be.", "Preheat the oven to 180C/350F/Gas 4. ", "Add the drained potato cubes to the lamb.", "Turn the mixture into a pie dish or casserole and cover with the shortcrust pastry. Make three slits in the top of the pastry to release any steam while cooking.", "Brush with beaten egg and bake for about 40 minutes, until the pastry is golden brown.", "Serve."]}, {"isVegetarian": false, "title": "Lamb and rosemary koftas with yoghurt dip", "url": "www_bbc_co_uk_food_recipes_lambandrosemarykofta_93001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz lamb mince", "½ onion, peeled, finely diced", "pinch chilli powder", "pinch cayenne pepper", "1 tbsp plain flour", "3 stalks fresh rosemary", "1 tbsp olive oil", "3 tbsp greek yoghurt", "2 tbsp chopped fresh mint", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb koftas, mix the lamb mince, onion, chilli powder, cayenne pepper and flour together in a bowl. ", "Remove the leaves from the rosemary stalks, leaving some leaves at the tip. Using wet hands, shape the lamb mixture around the three rosemary stalks. Rub the oil onto the outside of the koftas.", "Heat a griddle pan over a high heat and cook the koftas, turning frequently, for 4-5 minutes, or until the koftas are golden-brown and cooked through.", "For the yoghurt dip, mix all the ingredients together in a bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, place the lamb koftas onto a serving plate with the yoghurt dip."]}, {"isVegetarian": false, "title": "Lamb baked in a crust with fresh peas, onions and pancetta", "url": "www_bbc_co_uk_food_recipes_lambbakedinacrustwit_74815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6½oz leg of spring lamb ", "200g/7oz prosciutto (such as parma ham), cut into strips 5mm/¼in thick and 6cm/2½in long ", "a few sprigs of rosemary, 6cm/2½in long ", "2 tbsp olive oil ", "salt and freshly ground black pepper ", "100g/3½oz freshly grated parmesan or pecorino cheese ", "100g/3½oz fresh breadcrumbs ", "1½ glasses of white wine ", "1½ glasses of water", "5 tbsp extra virgin olive oil", "300g/10½oz onion, finely chopped ", "100g/3½oz pancetta, cut into tiny cubes ", "500g/1lb 1½oz fresh peas, shelled weight, or 500g/1lb 1½oz frozen petits pois", "300ml/10½fl oz vegetable stock"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. For the roast leg of lamb, place the leg of lamb on a clean work surface or chopping board. ", "With a long, thin, sharp knife, make lots of incisions all over the meat.  ", "Insert the strips of ham and rosemary together deep into the incisions leaving a little out.  ", "Rub the olive oil all over the lamb and season with salt and pepper, rubbing well in.  ", "In a bowl, mix together the parmesan or pecorino and breadcrumbs. ", "Carefully sprinkle over the top and side of the lamb and press well with your hands so the meat is well covered and the crumbs don't fall off - if some do, just gather them up and place onto the meat.  ", "Carefully place the meat in a roasting tin which will just fit the lamb. Pour in the wine and water on the side of the tin (not on the meat).  ", "Cover with foil and place in the preheated oven for about two and a half hours, which will give you a medium- to well-cooked lamb. Cook for less time if you prefer your lamb pink. ", "During cooking, check from time to time the liquid content - if necessary add more water. For the last 10 minutes of cooking time, remove the foil and increase the heat to 200C/390F/Gas 6 and roast until the topping goes golden and crispy, but be careful not to burn.  ", "Remove from the oven, slice and serve. Don't forget to pour the cooking juices over the lamb slices if you desire. Serve with small roast Jersey potatoes with the skins on, and the peas with pancetta. ", "For the fresh peas with onion and pancetta, heat the olive oil in a saucepan, add the onion and pancetta and sauté.  ", "Stir in the peas and stir fry for a couple of minutes. Add the stock, bring to the boil, then reduce the heat, cover and simmer for approximately 20 minutes, stirring now and again.  ", "After this time, the stock should almost have evaporated. ", "Serve immediately or make in advance and re-heat when required."]}, {"isVegetarian": false, "title": "Lamb burgers with chickpea salad", "url": "www_bbc_co_uk_food_recipes_lambburgerswithchick_89313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 5oz minced lamb", "1 red onion, finely chopped", "1 garlic clove, finely chopped", "1 tbsp finely chopped fresh rosemary", "1 tbsp finely chopped fresh mint", "2 tbsp vegetable oil", "1 x focaccia loaf, cut into 6 x 10cm/4in square pieces, grilled", "2 tbsp olive oil ", "1 onion, sliced", "1 tbsp harissa paste from a jar (available in most supermarkets)", "1 x 400g/14oz can chickpeas, rinsed and drained", "100ml/3½fl oz plain yoghurt", "1 lime, juice only", "1 tbsp chopped fresh mint", "watercress, to serve"], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the minced lamb, red onion, garlic, rosemary and mint into a bowl and mix well.", "Divide the mince mixture into six equal portions and mould into patties. ", "Heat a griddle pan until smoking. Rub the patties with oil and griddle for 5-6 minutes on each side, or until completely cooked through.", "For the salad, heat one tablespoon of the olive oil in a pan and fry the onion for 5-6 minutes, until softened. Transfer to a clean bowl.  ", "Add the harissa paste, chickpeas, natural yoghurt, the remaining olive oil, lime juice and mint to the bowl of fried onions and mix together well. ", "To serve, place a piece of grilled focaccia onto each of six plates. Top each piece with a small handful of watercress.", "Place a lamb burger on top of each pile of watercress, then top with a spoonful of the spicy chickpea salad."]}, {"isVegetarian": false, "title": "Lamb, cherry and pine nut meatballs", "url": "www_bbc_co_uk_food_recipes_lambcherryandpinenut_88736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz minced lamb", "1 onion, finely grated", "3 garlic cloves, crushed to a paste", "50g/2oz dried sour cherries, chopped", "100g/3½oz pine nuts, lightly toasted and roughly chopped", "½ tsp Hungarian paprika", "¼ tsp ground allspice", "½ tsp ground cumin", "1 free-range egg white, lightly whisked", "small bunch fresh parsley, finely chopped", "small bunch fresh mint, finely chopped", "salt and freshly ground black pepper", "2 tbsp vegetable oil"], "serves": "Serves 12 as a canapé", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix together the minced lamb, onion, garlic, sour cherries, pine nuts, paprika, allspice and cumin. Add the egg white and mix again. Stir in the chopped fresh herbs and season, to taste, with salt and freshly ground black pepper.", "Using your hands, shape the mixture into golf ball-sized balls.", "Heat the oil in a frying pan and fry the meatballs over a medium heat a few at a time, turning occasionally, for ten minutes, or until golden-brown on all sides and completely cooked through.", "Serve the meatballs hot or at room temperature."]}, {"isVegetarian": false, "title": "Lamb chops with sauce vierge", "url": "www_bbc_co_uk_food_recipes_lambchopswithsaucevi_87067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb chops", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp olive oil", "1 garlic clove, crushed", "1 tomato, seeds removed, chopped", "½ lemon, zest and juice only", "2 tbsp chopped fresh basil leaves", "1 tbsp chopped fresh flatleaf parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb chops, rub the lamb with oil and season with salt and freshly ground black pepper.", "Heat a griddle pan and griddle the chops for 4-5 minutes on each side, or until cooked to your liking. Remove from the heat and set aside to rest for five minutes.", "For the sauce vierge, heat the oil in a small pan and fry the garlic with the tomato for one minute.", "Remove from the heat, add the lemon zest and juice and stir in the basil.", "To serve, place the chops in the centre of a serving plate and drizzle over the sauce. Garnish with the chopped parsley."]}, {"isVegetarian": false, "title": "Lamb curry", "url": "www_bbc_co_uk_food_recipes_lambcurry_77792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz lamb, cubed", "1 tbsp oil", "½ tsp cardamom pods, crushed", "½ tsp medium curry powder", "½ tsp dried cumin", "½ tsp coriander seeds, crushed", "2 garlic cloves, crushed", "½ tsp dried turmeric", "300ml/10½fl oz beef or vegetable stock", "1 chilli, chopped", "75g/2½ oz Greek-style yoghurt", "handful fresh coriander, chopped ", "100g/3½oz new potatoes, cooked, optional"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the lamb in the oil with all the spices for 4-5 minutes on each side, until it is browned and coated.", "Pour over the beef or vegetable stock and cook for 15 mins stirring every so often.", "For the yohurt sauce, mix the chilli and Greek-style yoghurt together and set aside.", "Serve the curry in a bowl topped with the chopped coriander.", "Serve with the spiced yoghurt and the new potatoes, if desired."]}, {"isVegetarian": false, "title": "Lamb curry with basmati rice", "url": "www_bbc_co_uk_food_recipes_lambcurrywithbasmati_84339", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambcurrywithbasmati_84339_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "900g/2lb lamb fillet, cut into 3cm/1in cubes", "2 onions, roughly chopped", "3 garlic cloves, peeled and crushed", "2 green chillies, finely chopped", "1 tbsp grated fresh ginger", "1 tbsp ground turmeric", "1½ tbsp garam masala", "1½ tbsp ground cumin", "1 tbsp chilli powder", "1 tbsp plain flour", "6 large tomatoes, roughly chopped", "400ml/14fl oz coconut milk", "600ml/1 pint chicken stock", "250g/9oz baby spinach leaves", "1 pomegranate, seeded", "200g/7oz plain yoghurt", "salt and freshly ground black pepper", "steamed basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan and add one tablespoon of the vegetable oil and then the lamb. Cook over a high heat for 3-4 minutes, or until the lamb is golden-brown all over, then remove and set aside.", "Reduce the heat and add the remaining tablespoon of vegetable oil. Add the onions, garlic, chillies and ginger and fry for 2-3 minutes, until golden and softened.", "Add all the turmeric, garam masala, cumin and chilli powder and fry, stirring well, for one minute.", "Add the flour and cook for a further minute.", "Add the tomatoes and coconut milk and heat to bring to a simmer.", "Add the lamb and enough chicken stock to just cover the lamb. Stir well, scraping the bottom of the pan to deglaze and release any residue at the bottom of the pan.", "Heat the mixture until simmering, then cover and cook on a low heat for about one hour, or until the lamb is tender and cooked through.", "Skim off any excess fat from the surface of the sauce, then add the spinach and pomegranate. Cook for 1-2 minutes, until the spinach has wilted.", "Add the yoghurt, season, to taste, with salt and freshly ground black pepper and stir well.", "Serve onto warmed plates with steamed basmati rice alongside."]}, {"isVegetarian": false, "title": "Lamb cutlets in a parsley caper crust with warm potato, ham & spring onion salad", "url": "www_bbc_co_uk_food_recipes_lambcutletsinaparsle_78338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 lamb cutlets", "115g /4oz plain  flour, seasoned with salt and freshly ground black pepper, to taste", "2 free-range eggs", "115g/4oz white breadcrumbs", "2 tbsp capers, chopped", "2 tbsp fresh flatleaf parsley, chopped", "2 tbsp oil", "55g/2oz butter", "500g/1lb small new potatoes", "170g/6oz cooked ham", "1 shallot, finely chopped", "10 gherkins, chopped", "3 spring onions, thinly sliced", "1 tbsp chives, chopped", "2 tbsp red wine vinegar", "2 tbsp Dijon mustard", "8 tbsp olive oil", "salt & freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut 2.5cm/1in deep into the cutlets and trim off the excess fat, being careful to leave some fat remaining for flavour.", "Dredge the cutlets in the seasoned flour, shaking off the excess flour.", "Beat the eggs in a bowl.", "Mix the breadcrumbs with the capers and parsley.", "Dip the floured cutlets one at a time into eggs then into breadcrumb mix. Shake off the excess coating and tap gently to shape with a palette knife.", "Heat oil in a frying pan. Place the cutlets into the pan, presentation side down. Add the butter and cook for two minutes on each side, until coloured nicely. Take out and drain on kitchen towels.", "Meanwhile, to make the salad, cook the small potatoes skin on in boiling salted water. When just cooked take them out and drain in a colander.", "Chop up the ham and mix with the rest of the salad ingredients in a bowl.", "Mix the dressing ingredients. Set half aside and pour the other half onto the salad.", "Cut warm potatoes in half lengthwise into bowl. Check for seasoning.", "Place a portion of salad in middle of a dish with the 2 cutlets on top. Sprinkle the rest of the dressing around and serve."]}, {"isVegetarian": false, "title": "Lamb cutlets with chickpea, caramelised onion and smoked paprika mash", "url": "www_bbc_co_uk_food_recipes_lambcutletswithchick_92256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "6 tbsp olive oil", "1 large onion, peeled, finely sliced", "2 garlic cloves, peeled and finely chopped", "2 tsp thyme leaves", "½ tsp smoked paprika", "2 x 400g/14oz tins of chickpeas, drained, rinsed", "½ lemon, juice only", "salt and freshly ground black pepper", "8-12 lamb cutlets (2-3 per person)", "salt and freshly ground black pepper", "1 tbsp olive oil", "50ml/2fl oz red wine", "100ml/3½fl oz chicken stock ", "1 tbsp balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mash, heat the butter and two tablespoons of the olive oil in a large frying pan over a very low heat. Add the onion and cook for about 15 minutes until very soft and golden. ", "Stir in the garlic, half the thyme and the paprika and cook for a further five minutes.", "Bring a pan of water to the boil, then add the chickpeas and heat through for 2-3 minutes. Drain well. ", "In a food processor, blend together the chickpeas, three-quarters of the caramelised onions, the lemon juice and the remaining olive oil to form a smooth purée. ", "Season well with salt and freshly ground black pepper, then return to the saucepan and keep warm. (Alternatively, you can blend all the ingredients in the pan using a hand-held blender.)", "Meanwhile, for the lamb cutlets, heat another large frying pan over a high heat. Season the lamb cutlets with salt and freshly ground black pepper and drizzle over the olive oil. ", "Cook the cutlets in batches, adding them to the hot pan to quickly sear on both sides, then reduce the heat to medium and fry for a further two minutes on both sides (for rare), 2-3 minutes on both sides (for medium) or 4-5 minutes on both sides (for well done). ", "Remove the cutlets from the pan and leave to rest, covered in foil to keep warm. Drain the fat from the pan and then stir in the wine, scraping up any browned bits from the bottom to deglaze.  ", "Allow the liquid to bubble and reduce for a few minutes, then add the stock, vinegar and remaining thyme. Simmer for 3-4 minutes until reduced and slightly thickened.", "To serve, spoon some of the chickpea mash onto each plate, arrange the lamb cutlets on top, drizzle over the sauce and scatter with the remaining caramelised onions."]}, {"isVegetarian": false, "title": "Lamb cutlets with garlic and rosemary", "url": "www_bbc_co_uk_food_recipes_lambcutletswithgarli_83750", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 garlic cloves", "2 springs rosemary, finely chopped", "4 lamb chops"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue to hot. ", "Combine the olive oil, garlic and rosemary in a small bowl. Stir well and brush the chops with the flavoured oil on both sides.", "Cook for about three minutes on each side - the meat should still be slightly pink on the inside."]}, {"isVegetarian": false, "title": "Lamb cutlets with sautéed potatoes and creamy sage sauce", "url": "www_bbc_co_uk_food_recipes_lambcutletswithsaute_73730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp pine nuts", "1 tbsp fresh sage, finely chopped", "2 tbsp dry white wine", "100ml/3½ fl oz double cream", "1 clove garlic, sliced", "10 tbsp Italian olive oil", "8 sprigs fresh rosemary, leaves only, roughly chopped", "4 large potatoes, pre-cooked al dente, skin on", "12 lamb cutlets, trimmed", "2 tbsp balsamic vinegar", "salt and freshly ground black pepper, to taste", "green beans, cooked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high. ", "In a small saucepan toast the pine kernels for approximately two minutes (do not let them burn). ", "Add the sage and white wine and gently simmer for one minute.  ", "Add the cream, season to taste with salt and freshly ground black pepper and cook on a low heat until thickened.  ", "Using a hand-held blender, blend the mixture to create a smooth sauce texture.", "In a large frying pan, fry the garlic in eight tablespoons of olive oil until well-browned over a medium heat, allowing the olive oil to flavour. ", "Remove the garlic with a slotted spoon and discard, then add the rosemary to the oil.  ", "Slice the pre-cooked potatoes approximately 1cm/0.5in thick and cook in the flavoured oil for approximately two minutes each side or until golden and crisp.", "Meanwhile, place the lamb cutlets on a large tray, drizzle over a couple of tablespoons of olive oil, the balsamic vinegar, and season to taste with salt and freshly ground black pepper. Using your hands, mix the seasoning into the meat and grill for approximately two minutes each side, or until cooked to your liking.", "To serve, stack 4-5 potato slices on top of each other in the middle of each of four plates. Lean three lamb cutlets against the potato stack and drizzle with the hot sage sauce. 11. Serve with the green beans."]}, {"isVegetarian": false, "title": "Lamb fillet with flageolet beans and leek chutney", "url": "www_bbc_co_uk_food_recipes_lambfilletwithflageo_71653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp finely chopped sage", "1 tbsp finely chopped thyme", "2-3 garlic cloves, finely chopped", "olive oil", "2 lamb fillets, weighing about 175g/6oz each", "400g/14oz canned flageolet beans, drained and rinsed", "1 red onion, finely chopped", "2 garlic cloves, chopped", "2 thyme sprigs ", "½ punnet of cherry tomatoes, quartered", "1 tbsp chopped flatleaf parsley", "1 tbsp olive oil", "splash of balsamic vinegar", "good squeeze of lemon juice", "salt ", "freshly ground black pepper", "1 leek, finely sliced ", "1 tbsp olive oil", "1 tsp brown sugar ", "50ml/2fl oz balsamic vinegar"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pound the sage, thyme garlic and olive oil to a thick paste, using a pestle and mortar. Smear this over the lamb fillets. ", "Put the beans, red onion, garlic, thyme, tomatoes and parsley in a pan with the olive oil. Place over medium heat and simmer for 3-4 minutes, stirring, to heat through. Add a splash of balsamic vinegar and a squeeze of lemon juice. Season with salt and freshly ground black pepper. Set aside and keep warm. ", "Meanwhile make the chutney. Cook the finely shredded leeks in olive oil for a few minutes, then add the balsamic vinegar and brown sugar.  Cook for five minutes on a medium-low heat.", "For the lamb heat a heavy-based frying pan over medium-high heat until hot. Add the lamb and sear for two minutes on each side. Transfer to a warm plate. ", "Reduce the heat to medium-low. Add a large glug of balsamic vinegar to the pan. Sizzle for a few seconds, scraping up any sediment from the pan. Season with salt and pepper then add to the chutney mixture.", "To serve, spoon the bean mixture onto warm serving plates. Place the lamb on top and drizzle on the hot leek chutney."]}, {"isVegetarian": false, "title": "Winter lamb hotpot", "url": "www_bbc_co_uk_food_recipes_lambhotpot_92585", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambhotpot_92585_16x9.jpg", "ingredients": ["4 thick lamb neck chops", "plain flour, for dredging", "good glug fruity olive oil", "3 onions, peeled and cut into wedges", "2-3 large parsnips, peeled and cut into sixths", "6 large, juicy garlic cloves, peeled, cut in half", "salt and freshly ground black pepper", "6-8 fresh rosemary sprigs", "6-8 small potatoes, cut in half"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/350F/Gas 4. ", "Lightly dredge the lamb chops in the flour. Heat the oil in a shallow ovenproof pan with a lid, then add the lamb chops and cook until browned on both sides. Remove the lamb from the pan and set aside. Add the onions, parsnips and garlic to the same pan and cook for 2-3 minutes. Season well with salt and freshly ground black pepper and add the rosemary.  ", "Return the lamb chops to the pan, tuck the potatoes around the chops, season well with salt and freshly ground black pepper and pour in just enough water to cover the pan contents. Cut out a circle of greaseproof paper the same size and shape as the inside of the pan. Place the paper circle over the lamb and vegetables, then cover the pan with the lid. ", "Cook in the preheated oven for an hour or so, until the meat is tender."]}, {"isVegetarian": false, "title": "Lamb 'hotpot' with potato", "url": "www_bbc_co_uk_food_recipes_lambhotpotwithpotato_80043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, melted", "½ potato, peeled and cut into thin round slices", "salt and freshly ground black pepper", "1 tsp olive oil", "200g/7oz lamb chop, boned and cut into bite sized chunks", "1 tbsp flour", "50ml/2fl oz red wine", "100ml/3½fl oz water", "½ carrot peeled, sliced, blanched and refreshed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Dip the potato slices in the melted butter. ", "Season, lay on a baking tray and roast for 12 minutes until golden.", "Place the olive oil in a large frying pan over a medium to high heat.", "Season the lamb, toss in the flour and fry until coloured on all sides. ", "Add the red wine and water and stir and cook until the sauce is reduced by half. ", "Once the sauce has thicken, season with salt and freshly ground black pepper.", "Serve the lamb hotpot on a warm plate and top with the potato and carrot."]}, {"isVegetarian": false, "title": "Lamb fillet wrapped in brik pastry with tomato 'confit', artichokes and lamb jus", "url": "www_bbc_co_uk_food_recipes_lambfilletwrappedinb_90937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz unsalted butter, softened", "2 sprigs chervil, roughly chopped", "2 sprigs tarragon, roughly chopped", "2 fresh anchovy fillets, roughly chopped", "1 garlic clove, roughly chopped", "½ lemon, juice only", "4 x 200g/7oz lamb fillets, trimmed", "freshly ground black pepper ", "4 sheets brik pastry (available in specialist North African stores or online, alternatively use filo pastry)", "110g/4oz clarified butter, melted", "vegetable oil, for deep fat frying", "4 large globe artichokes, leaves removed, cut short and middle choke removed with a teaspoon", "½ lemon, juice only", "50g/2oz butter", "1 tbsp olive oil", "1 garlic clove, finely chopped", "2 sprigs chervil, roughly chopped", "salt and freshly ground black pepper", "50g/2oz butter", "1 tbsp olive oil", "110ml/4fl oz ready-made lamb jus or reduced lamb stock", "2 tbsp sherry vinegar", "4 tbsp olive oil ", "2 ripe tomatoes, halved lengthways"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, place the softened butter into a bowl, add the chervil, tarragon, anchovies, garlic and lemon juice and beat well to combine.", "Season the lamb with freshly ground black pepper.", "Place a piece of brik pastry on a clean work surface or chopping board and brush with the clarified butter.", "Place one lamb fillet in the middle of the pastry sheet, spread half of the anchovy butter on the top, then put another fillet on top. Fold the pastry into a parcel, enclosing the lamb entirely.", "Lay a second sheet of pastry on the work surface, brush with clarified butter. Place the wrapped lamb on top and fold up once more. Repeat with the remaining two fillets and pastry. Tie both parcels tightly with kitchen string. Place on a plate or tray and transfer to the fridge to rest for at least one hour.", "To cook the lamb, preheat the vegetable oil in a deep fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous - do not leave unattended.) Carefully place the lamb parcels into the fat fryer, one at a time, and cook for 12-14 minutes, without turning as the pastry is very fragile. Remove the lamb from the fryer using a large slotted spoon, drain on kitchen paper and leave the lamb to rest in a warm place for five minutes.", "For the artichokes, slice the artichokes finely and rub with the lemon juice. Heat a frying until hot, add the butter, olive oil, sliced artichokes and the garlic and fry for 2-3 minutes, or until tender. Add the chervil and season with salt and freshly ground black pepper, to taste.", "For the sauce, heat a separate pan until hot. Add the butter and when it has turned nut-brown in colour, add the olive oil, lamb jus and sherry vinegar. Simmer for a further two minutes.", "For the tomato 'confit', gently heat the olive oil and tomatoes in a pan and cook for a few minutes until just softened.", "To serve, cut excess pastry from the lamb parcels and discard it. Cut each parcel into four thick slices. Place the artichokes onto the centre of each serving plate, then top with two pieces of pastry-wrapped lamb per person. Spoon the sauce over the top and arrange a tomato half on one side of the plate. Serve at once."]}, {"isVegetarian": false, "title": "Lamb kabob mashwi with spicy flatbreads and yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_lambkabobmashwiwiths_79721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb10oz finely ground lamb mince", "1 onion, very finely chopped ", "2 tsp chopped fresh marjoram or oregano or 1 tsp good quality dried", "2 tbsp chopped fresh mint", "½ tsp chilli powder", "pinch ground cardamom", "Maldon sea salt and freshly ground black pepper ", "500g/1lb 2oz plain flour ", "½tsp sugar", "1 tsp fine sea salt", "2 tsp dried oregano", "2 tsp chilli flakes", "1 packet dried yeast", "250ml/8fl oz tepid water", "1 tbsp olive oil", "2 tbsp extra virgin olive oil", "5 tbsp thick Greek yoghurt", "2 tbsp tahini (sesame seed paste)", "1 tbsp fresh lemon juice", "I garlic clove, crushed", "2 tbsp chopped fresh coriander", "Fresh mint leaves ", "1 small red onion, finely sliced and soaked in lemon juice", "8 wooden skewers, pre-soaked in water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7.", "For the kebabs, place all the  kebab ingredients in a large bowl. Season generously with plenty of salt and freshly ground black pepper and mix together really well.", "Divide the mixture into eight rough sausage shapes then put each onto a skewer, ensuring they are firmly wrapped around the skewers. Refrigerate until ready to use. In the meantime, prepare the flatbreads and dressing.", "When you're ready, heat a large frying pan or flat griddle until smoking hot and cook the kebabs for 4-5 minutes or until cooked through.", "For the flatbreads, place the flour in a bowl and mix in the sugar, salt, oregano and chilli flakes.", "Make a well in the centre of the flour mix and pour in the dried yeast. Add enough of the tepid water to form a rough dough. ", "Drizzle the olive oil over the dough and knead for about ten minutes. Divide into four balls and then roll out into long ovals.  ", "Place the flatbreads on lightly greased baking trays that have been pre-heated in the oven. Prick all over really well then place in the oven and cook for three minutes on each side.", "For the dressing, place all the dressing ingredients into a blender and blend to form a smooth paste.", "To serve, lay a flatbread on a serving plate with a couple of kebabs on top, drizzle with the dressing and garnish with some of the lemon-soaked onions and fresh mint leaves."]}, {"isVegetarian": false, "title": "Lamb kebab", "url": "www_bbc_co_uk_food_recipes_lambkebab_72360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz lamb fillet, sliced into 1cm/½in strips", "½ onion, grated", "3 garlic cloves", "salt and freshly ground black pepper", "1 tsp ground cumin", "½ tsp cayenne pepper", "4 tbsp olive oil", "4 pitta breads", "½ lemon, juice only", "4 tbsp Greek yoghurt", "1 tsp chopped oregano", "3 spring onions, sliced"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the lamb with the onion in a mixing bowl. ", "Mash the garlic with a little salt. Add the mashed garlic, one teaspoon of black pepper, cumin, cayenne and olive oil to the sliced lamb and toss well. ", "Cover and marinate in the refrigerator for at least 20 minutes, longer if time permits. ", "Heat a heavy-based frying pan or griddle until very hot. ", "Add the lamb to the frying pan or griddle, allowing two minutes each side. Alternately, chargrill or grill the lamb strips. ", "Meanwhile, warm the pitta breads. Slice along the pitta breads to form four pockets. ", "Fill the pitta pockets with the freshly cooked lamb, lemon juice, yoghurt, oregano and spring onions and serve at once."]}, {"isVegetarian": false, "title": "Lamb kebabs with couscous", "url": "www_bbc_co_uk_food_recipes_lambkebabswithcousco_86597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large rosemary sprig", "55g/2oz lamb, cut into cubes", "4 dried apricots", "1 courgette, cut into cubes", "2-3 tbsp olive oil, plus extra for drizzling", "200ml/7fl oz lamb stock", "100g/3½oz couscous", "1 small red onion, finely chopped", "1 sprig fresh parsley, chopped", "20g/¾ oz golden raisins", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Remove the rosemary leaves from their stem, leaving one inch at the top. Chop the rosemary leaves and mix through the lamb. Add the apricots, courgettes and olive oil. Cover the mixture and leave to marinate in the fridge for at least 30 minutes.", "Place the lamb stock into a pan and bring to the boil. Pour the stock over the couscous. Cover with cling film and leave for five minutes. Add the red onion, parsley and raisins to the couscous. Mix thoroughly and season with salt and freshly ground black pepper.", "Skewer the lamb onto the rosemary stalk, alternating with cubes of courgette and apricots. Place the lamb onto a medium hot griddle pan. Griddle the lamb, turning occasionally until it is browned on all sides and cooked through.", "To serve, place the couscous mix onto a serving plate. Place the kebab skewer over the couscous. To finish, drizzle with olive oil."]}, {"isVegetarian": false, "title": "Lamb kebabs", "url": "www_bbc_co_uk_food_recipes_lambkebabs_2214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambkebabs_2214_16x9.jpg", "ingredients": ["juice of half lemon ", "450g/1lb lamb mince ", "1 tablespoon oil ", "55g/2oz fresh coriander leaves (washed and chopped) ", "4 cloves garlic (crushed) ", "4 green chillies (de-seeded and chopped) ", "½ tsp coriander powder ", "1 tsp cumin powder ", "½ tsp black peppercorns (crushed) ", "½ tsp turmeric powder ", "½ tsp garam masala ", "2 tsp grated ginger ", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix two teaspoons of lemon juice and the lamb mince in a bowl. ", "Blend the oil, garlic, ginger, chillies, crushed peppercorns, cumin, coriander powder, lemon juice, turmeric powder and salt in a food processor to a paste.", "Stir the paste and coriander into the mince. With wet hands skewer the meat into long sausage shapes. Rotate the meat around the skewer, pressing gently all round.  Alternatively, shape the mixture into small patties.", "Brush each kebab with a little oil and grill under a medium heat or barbecue for 4-5 minutes on each side, or until cooked through."]}, {"isVegetarian": false, "title": "Lamb koftas with a cucumber and mint yoghurt", "url": "www_bbc_co_uk_food_recipes_lambkoftaswithacucum_70013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/10½oz lean lamb mince", "small bunch coriander, chopped", "1 tsp cumin seeds", "1 tsp coriander seeds, crushed", "1 tsp chilli, chopped", "1 tsp turmeric", "pinch dried cinnamon", "salt and freshly ground black pepper", "1 tbsp pine nuts", "1 lime, zest and juice only", "110g/4oz yoghurt", "½ cucumber, grated and squeezed to remove water", "small bunch fresh mint, chopped", "1 lemon, juice and zest only", "fresh coriander, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Mix all dry ingredients together and toast in a dry pan.  Crush in a pestle and mortar or blend in a spice grinder to powder. Mix the lamb, the lime zest and juice and all the toasted ingredients together. Form on to wooden skewers and put aside to rest.", "For the yoghurt sauce, miix the yoghurt ingredients togetherin a bowl and set aside.", "Heat an ovenproof griddle pan until smoking and add the koftas. Griddle on all sides to achieve brown char marks, then transfer to the oven to cook for ten minutes, or until completely cooked through.", "Serve on a plate with chopped coriander sprinkled over the top and some of the yoghurt mixture."]}, {"isVegetarian": false, "title": "Lamb madras with chapatis", "url": "www_bbc_co_uk_food_recipes_lambmadraswithchapat_93782", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2 tbsp coriander seeds", "2 tbsp fenugreek seeds", "1 tbsp mustard seeds", "1 tsp cumin seeds", "½ tsp fennel seeds", "1 tsp black peppercorns", "1 cinnamon stick, broken into pieces", "5 cloves", "1 tbsp ground turmeric", "4 lamb shanks", "salt and freshly ground black pepper", "1 green birds' eye chilli", "2 garlic cloves, peeled", "1.5cm/¾in piece fresh root ginger, peeled", "1 onion, peeled, thinly sliced", "12 curry leaves", "3 cardamom pods", "2 bay leaves", "400g/14oz tin chopped tomatoes", "200ml/7fl oz beef stock", "2 tsp tamarind juice", "325g/11½oz chapati flour (available in some supermarkets and Asian grocers), plus extra for dusting", "1½ tsp salt", "170-230ml/6-8fl oz water", "1 tbsp vegetable oil", "2 shallots, peeled, finely sliced", "2 tbsp plain flour", "2-3 tbsp vegetable oil"], "serves": "6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the madras curry powder, place all of the curry powder ingredients into a spice grinder and grind to a fine powder. ", "For the lamb madras, season the lamb shanks all over with salt and freshly ground black pepper. Heat the vegetable oil in a large non-stick casserole pan and sear the lamb shanks for 1-2 minutes on all sides, or until golden-brown all over. Remove the lamb shanks from the pan and set aside. ", "Blend the chilli, garlic and ginger in a small food processor to a paste, adding a splash of water if necessary. ", "Place the pan used to cook the lamb back over a high heat and add the onions (add a splash of oil to the pan if it is too dry). Fry for 2-3 minutes, or until softened and starting to colour. ", "Add 2½ tablespoons of the curry powder to the pot along with the garlic, chilli and ginger paste, curry leaves, cardamom and bay leaves. Stir well.", "Return the lamb shanks to the pan and cover with the chopped tomatoes, beef stock and tamarind juice. Season, to taste, with salt and freshly ground black pepper. Cover the pan with a lid simmer over a low heat for 2 hours, or until the lamb is very tender. ", "Meanwhile for the chapatis, sift the flour and salt into a large bowl and gradually mix in enough of the water to form a soft dough (you may not need all of the water). Cover and set aside to rest for 10 minutes.", "Turn the dough out onto a floured work surface, lightly knead and then divide equally into 12 balls. Roll out each ball as thin as possible. ", "Heat a frying pan over a high heat and add the oil. Cook the chapatis one at a time, frying for 1-2 minutes on both sides or until golden-brown and puffed up. ", "For the fried shallots, dust the sliced shallots in the flour. Heat the vegetable oil in a frying pan over a high heat and fry the shallots for 2-3 minutes, or until golden-brown and crisp. Remove from the oil and drain on kitchen paper. ", "To serve, remove the lamb shanks from the pan and place one on each serving plate. Place the pan back over a high heat and simmer until the liquid has reduced to a thick sauce, enough to coat the back of a spoon. Pour the sauce over the lamb shanks and garnish with the crisp shallots. Serve the chapatis on the side."]}, {"isVegetarian": false, "title": "Lamb koftas with spiced yoghurt", "url": "www_bbc_co_uk_food_recipes_lambkoftaswithspiced_74874", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz bulgar wheat", "2 tbsp olive oil", "1 chilli, finely chopped", "1 medium onion, finely chopped ", "½ tsp ground coriander", "½ tsp ground cumin", "500g/1lb 2oz lean leg of lamb, all visible fat removed, cubed", "1 egg", "40g/1½ oz pine kernels, finely chopped", "2 tsp mint, chopped", "3 tsp parsley, chopped ", "2 chillies, seeded and finely chopped", "1 tsp fresh mint leaves, chopped", "1 tsp chives, snipped", "1 tsp coriander leaves, finely chopped", "1 tsp parsley, finely chopped ", "1 garlic clove, crushed to a paste in a pestle and mortar", "½ tsp ground cumin ", "250g/9oz Greek-style yoghurt", "mixed salad leaves"], "serves": "Makes 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First, make the spiced yoghurt. Combine all the yoghurt ingredients in a large bowl. Leave for an hour to allow the flavours to develop.", "For the lamb koftas, soak the bulgar wheat in cold water for 30 minutes. Drain and squeeze dry.", "Heat half the olive oil in a frying pan, then add the chilli, onion, ground coriander and ground cumin and cook on a low heat for 15 minutes. Allow to cool.", "Place the lamb in a food processor along with the egg and the cooled onion mixture. Blend until the mixture has the consistency of a smooth paste.", "Remove the lamb mixture and place in a bowl. Add the bulgar wheat along with the pine kernels and the chopped mint and parsley.", "Wet your hands and shape 1 tsp of the mixture into a small log-shaped koftas. Repeat with the remaining mixture.", "Heat remaining one tablespoon olive oil in a frying pan, then add the koftas in batches, turning regularly until brown and cooked through. This should take approximately 10 minutes.", "When cooked, drain the koftas on absorbent kitchen paper and keep warm in the oven.", "Serve with spiced yoghurt dip and salad leaves."]}]