[{"isVegetarian": false, "title": "Ham and asparagus pasta nests", "url": "www_bbc_co_uk_food_recipes_ham_and_asparagus_pasta_69827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Italian ‘00’ flour", "2 free-range eggs", "500ml/18fl oz whole milk", "40g/1½oz butter", "40g/1½oz plain flour", "1 tsp freshly ground nutmeg", "salt and freshly ground white pepper", "2 tbsp olive oil", "250g/9oz asparagus, finely sliced", "1–2 garlic cloves, crushed", "400ml/14fl oz chicken or vegetable stock", "40g/1½oz butter", "20g/¾oz plain flour", "250g/9oz mozzarella balls, torn ", "250g/9oz cooked ham, torn ", "6 tbsp freshly grated Parmesan, plus extra to serve", "black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta, place the flour into a food-processor and pulse. Add the eggs one by one and keep pulsing for 2–3 minutes, until the mixture resembles fine breadcrumbs. Tip the dough onto a lightly floured surface and knead for 1 minute (it should be quite stiff and hard to knead). Wrap in kitchen film and leave to rest in the fridge for 20 minutes.", "Meanwhile, make the Béchamel sauce. Heat the milk in a small saucepan and melt the butter in a separate pan over a medium heat. Add the flour to the melted butter and mix well. Cook for 2 minutes. Tip the hot milk into the flour stirring continuously. Season with salt, pepper and nutmeg. Leave to cool until ready to serve.", "To make the asparagus sauce, place a frying pan over a medium heat and add the olive oil. Fry the asparagus and garlic for 2–3 minutes.", "Heat the stock in a small pan. Melt the butter in a separate pan over a medium heat. Mix the flour into the butter and cook for 1-2 minutes. Stir in the hot stock and add the asparagus. Leave to cool.", "Bring a large pan of salted water to the boil. Roll out the pasta into a large circle (about 40cm in diameter and as thin as you can make it). Carefully cook the pasta round for 1–2 minutes and then drain on a tea towel.", "To assemble the nests, spread half the cooled Béchamel onto the pasta, top with the mozzarella, ham and 4 tablespoons Parmesan. Roll into a log shape and wrap in a tea towel.  Refrigerate for at least 30 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Pour half the asparagus sauce into a deep baking dish. Slice the pasta roll into 9 pieces and place into the dish. Spoon over the remaining asparagus sauce and all the Béchamel. Sprinkle with Parmesan and black pepper and bake for 20–30 minutes, or until browned on top. Sprinkle with a little Parmesan and serve."]}, {"isVegetarian": false, "title": "Ham and cheese croquetas with rapeseed mayo", "url": "www_bbc_co_uk_food_recipes_ham_and_cheese_croquetas_52671", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz butter", "200g/7oz plain flour", "500ml/18fl oz milk", "salt and freshly ground black pepper", "75g/2½oz fresh breadcrumbs", "150g/5½oz ham, chopped", "100g/3½oz Lincolnshire poacher cheese", "1 small bunch fresh parsley, chopped", "75g/2½oz plain flour", "2 free-range eggs, beaten", "100g/3½oz panko Japanese breadcrumbs", "rapeseed oil, for deep frying", "3 free-range egg yolks", "1-2 tsp English mustard", "100ml/3½fl oz rapeseed oil", "1 tbsp white wine vinegar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the ham and cheese croquetas, melt the butter in a large saucepan, then whisk in the flour and cook for 2-3 minutes. Whisk in the milk gradually to make a thick sauce. Season with salt and pepper.", "Stir in the breadcrumbs, ham, cheese and parsley. Place in the fridge to chill for 3-4 hours.", "Shape the chilled mixture into 7cm/2¾in cylinders. Place the flour, beaten eggs and breadcrumbs in three separate bowls. Coat each croqueta in the flour, then egg and finish with a layer of panko breadcrumbs.", "Add the oil to a deep-fat fryer and preheat to 170C/338F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the croquetas in batches until golden-brown. Remove and drain on a plate lined with kitchen paper.", "To make the mayonnaise, whisk the egg yolks with the mustard in a bowl and then very gradually add the oil, whisking continuously. Stir through the vinegar, then season with salt and pepper.", "Serve the croquetas on a board with a bowl of the mayonnaise for dipping."]}, {"isVegetarian": false, "title": "Baked ham and egg pots", "url": "www_bbc_co_uk_food_recipes_ham_and_egg_pots_63131", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_and_egg_pots_63131_16x9.jpg", "ingredients": ["1 x 30g/1oz slice of ham", "4 fresh basil leaves", "1 tbsp half-fat crème fraîche", "1 large free-range egg", "1 tbsp grated Red Leicester", "sea salt and freshly ground black pepper", "salad leaves", "olive oil, for drizzling", "squeeze of lemon"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½. ", "Arrange the ham in the bottom of a ramekin dish so that it forms a cup and place the basil inside. Spoon in the crème fraîche and crack in the egg. Sprinkle over the Red Leicester and season with salt and pepper.", "Place the ramekin on a baking tray and bake for 15 minutes, or until cooked but the yolk is still a little runny. ", "Put the salad leaves on a plate, dress with a drizzle of oil and a squeeze of lemon juice and serve with the ham and egg pot. "]}, {"isVegetarian": false, "title": "Ham and eggs with grilled tomato", "url": "www_bbc_co_uk_food_recipes_ham_and_eggs_with_88506", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_and_eggs_with_88506_16x9.jpg", "ingredients": ["1 big beef tomato", "salt and freshly ground black pepper ", "dash olive oil", "3 slices prosciutto", "2 slices sourdough bread", "3 free-range eggs", "50ml/2fl oz cream", "knob of butter"], "serves": "Serves 1 hungry person", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the griddle to hot. Slice the tomato in half, season with salt and freshly ground black pepper, drizzle with oil and place on a grill pan with the prosciutto. Grill until the tomato is softened and the prosciutto is crisp. ", "Lightly toast the sourdough bread. ", "Crack the eggs into a bowl. Season them with salt and pepper and beat well. Beat in the cream. ", "Pour the mixture into a non-stick pan and cook the scrambled eggs until they reach a sloppy consistency. Remove from the heat. ", "Pour the scrambled eggs onto the sourdough toast and place the grilled prosciutto on top. Arrange the grilled tomatoes on the side and serve. "]}, {"isVegetarian": false, "title": "Ham and pea broth", "url": "www_bbc_co_uk_food_recipes_ham_and_pea_broth_79831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz fresh peas in the pod, podded, pods reserved", "100g/3½oz runny honey", "100ml/3½fl oz soy sauce", "1.5 litres/2½ pints chicken stock", "1 Savoy cabbage", "vegetable oil, for deep-frying", "300g/10½oz good-quality ham, diced", "½ bunch fresh mint, leaves picked and torn", "2 punnets pea shoots", "1 bunch spring onions, sliced", "1 green chilli, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the peas in boiling water for 1-2 minutes or until cooked. Drain.", "Heat the honey in a heavy-bottomed saucepan until caramel coloured. Carefully add the soy sauce and chicken stock and bring the mixture to the boil. Add the reserved pea pods and remove the pan from the heat. ", "Cover with clingfilm, set aside to infuse for 10 minutes, then pass the mixture through a fine sieve and set aside.", "Meanwhile, remove the outer leaves from the cabbage (use the rest of the cabbage for another recipe). Finely slice the leaves and blanch in boiling water for 1-2 minutes. Drain and pat dry.", "Heat the oil in a deep fat fryer to 140C/285F (CAUTION: Hot oil may be dangerous. Do not leave unattended.)", "Deep-fry the cabbage pieces until crisp, then remove from the oil and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the peas, ham, mint, pea shoots, spring onions and chilli among four serving bowls. Return the stock mixture to the boil and pour it in the bowls, then top with the crispy cabbage."]}, {"isVegetarian": false, "title": "Ham, chicken and crayfish pie", "url": "www_bbc_co_uk_food_recipes_ham_chicken_and_crayfish_02352", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_chicken_and_crayfish_02352_16x9.jpg", "ingredients": ["1 ham hock", "4 chicken thighs, skin on", "1 onion, roughly chopped", "2 carrots, roughly chopped", "2 sticks celery, roughly chopped", "small bunch thyme", "small bunch parsley stalks", "2 bay leaves", "10-12 raw crayfish (cooked can be substituted, but you will need to use fish stock)", "drizzle olive oil", "1 tbsp tomato purée", "small bunch tarragon", "50g/1¾oz unsalted butter", "2 tbsp plain flour", "small bunch chives, finely chopped", "300g/10½oz shop-bought all-butter puff pastry", "1 free-range egg, beaten", "1-2 sprigs of thyme"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Put the ham hock, chicken, onion, carrot and celery in a pot and cover with water. Tie together the thyme, parsley stalks and bay leaves with kitchen string and add to the pot. Bring to a boil and then simmer for around 1½ hours, or until the meat is cooked through.", "Remove the meat and then strain and reserve the cooking liquid. Shred the meat into bite-sized pieces and set aside.", "Peel the crayfish and set aside. Put the shells into a hot pan to brown with a drizzle of olive oil. Add the tomato purée and cook for one minute. Measure 1 litre/1¾ pints of the meat cooking liquid and add to the pan, along with a few leaves of fresh tarragon. Bring to the boil and simmer for 20 minutes before passing through a sieve. Discard the shells and set the stock aside.", "Make a roux by melting the butter and whisking in the flour. Gradually add the stock, whisking to prevent lumps from forming. Taste to check for seasoning and add more tarragon at this point if desired.", "To assemble, layer the ham, chicken and crayfish in a pie dish and pour over the sauce and scatter over the chopped chives. Reserve a few crayfish heads. ", "Roll out the pastry to a 5mm thickness and cover the pie dish with it. Trim the edges and press them firmly into the rim of the dish. Brush with beaten egg yolk and sprinkle over some fresh thyme leaves. Make a couple of incisions into the pastry and insert the reserved crayfish heads to let the steam escape from inside the pie.", "Bake for 30 minutes, or until the pastry is puffed up and golden-brown."]}, {"isVegetarian": false, "title": "Ham croquetas with garlic mayo", "url": "www_bbc_co_uk_food_recipes_ham_croquetas_with_98714", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_croquetas_with_98714_16x9.jpg", "ingredients": ["75g/2½oz butter", "200g/7oz plain flour", "500ml/18fl oz milk", "salt and freshly ground black pepper", "75g/2½oz fresh breadcrumbs", "100g/3½oz ham, chopped", "50g/2oz serrano ham, chopped", "1 small bunch fresh parsley, chopped", "75g/2½oz plain flour", "2 free-range eggs, beaten", "100g/3½oz panko Japanese breadcrumbs", "rapeseed oil, for deep frying", "3 free-range egg yolks", "1-2 tsp English mustard", "100ml/3½fl oz rapeseed oil", "1 tbsp white wine vinegar", "½ tsp crushed garlic (approximately 1 small clove) ", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a large saucepan, then whisk in the flour and cook for 2-3 minutes. Whisk in the milk slowly until you have a very thick sauce. Season with salt and pepper. ", "Stir in the breadcrumbs, both hams and parsley. Place in the fridge to chill for 3-4 hours.", "Shape the chilled mixture into 7cm/2¾in cylinders. Place the flour, beaten eggs and breadcrumbs in three separate bowls. Coat each one in the flour, then egg and finish with a layer of breadcrumbs. ", "Add the oil into a deep-fat fryer and preheat to 170C/338F. (Caution: Do not leave hot oil unattended.)", "Deep fry the croquetas in batches until golden-brown. Remove and  drain on kitchen paper.", "To make the mayonnaise, whisk the egg yolks with the mustard in a bowl and then very slowly and gradually add the oil, whisking continuously. Stir through the vinegar and garlic, then season with salt and pepper.", "Serve the croquetas on a board with a bowl of mayonnaise for dipping."]}, {"isVegetarian": false, "title": "Ham, fried duck egg and triple cooked chips", "url": "www_bbc_co_uk_food_recipes_ham_fried_duck_egg_and_97182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 large potatoes suitable for chipping ", "vegetable oil, for deep-frying", "salt and freshly ground black pepper", "4 thick slices good-quality ham", "75g/3oz butter", "4 duck eggs", "2 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the ends of the potatoes and cut into chips. Cook in salted boiling water for 5-6 minutes, or until just tender, then drain.", "Heat the oil in a deep fat fryer to 140C/285F (CAUTION: Hot oil may be dangerous. Do not leave unattended.) Fry the chips for 8-10 minutes, then remove from the oil and set aside to drain on kitchen paper.", "To serve, reheat the oil to 180C/350F and fry the chips for 4-5 minutes, or until crisp and golden-brown. Remove from the oil, set aside to drain on kitchen paper and season with salt.", "Fill a frying pan with 1cm/½in water and bring to the boil. Add the butter and once it has melted, add the sliced ham and cook for 1-2 minutes. ", "Remove the ham slices and place onto serving plates. Season with freshly ground black pepper.", "In a frying pan add a little vegetable oil and fry the duck eggs until cooked to your liking. Place on the serving plates, season with salt and freshly ground black pepper and serve the chips alongside."]}, {"isVegetarian": false, "title": "Ham, fried egg, beer mustard and homemade chips", "url": "www_bbc_co_uk_food_recipes_ham_fried_egg_beer_49630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz honey", "50g/1¾oz soft light brown sugar", "100ml/3½fl oz white wine vinegar", "75g/2½oz black mustard seeds", "75g/2½oz yellow mustard seeds", "100ml/3½ fl oz beer ", "400g/14oz chipping potatoes, peeled and cut into batons ", "vegetable oil, for deep frying", "4 free-range eggs", "½ cooked ham hock, shredded", "sea salt"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["First make the mustard. Place the honey, sugar and vinegar in a saucepan and heat until the honey has dissolved.", "Put the mustard seeds and beer in a bowl and pour over the warm honey mixture. Stir to combine and set aside in the fridge for two hours, or overnight.", "Pour into a food processor and pulse to form a purée – it will take about five minutes for the seeds will break down and the mustard to become creamy.", "You can store the mustard in the fridge in a sealed sterilised jar for up to two weeks.", "To make the chips, heat a deep fat fryer to 160C/325F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the potatoes into the fryer and cook for 8-10 minutes, or until light golden-brown and cooked through.", "Drain the chips onto kitchen paper and sprinkle with sea salt.", "While the chips are cooking, fry the eggs.Heat a frying pan until hot, add a little vegetable oil and crack the eggs directly onto the pan. Spoon the oil over the top of the eggs occasionally until just set and crisp around the edges. Add the ham to the pan as the eggs fry to heat through and crisp slightly.", "To serve, pile the chips onto serving plates, place an egg alongside.  Add some shredded ham hock next to it and finish with a dollop of mustard."]}, {"isVegetarian": false, "title": "Ham hock and pea soup", "url": "www_bbc_co_uk_food_recipes_ham_hock_and_pea_soup_18013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small ham hock (about 1kg/2lb 4oz)", "1 large onion, thickly sliced", "1 shallot, thickly sliced", "1 head garlic, cut in half horizontally", "2 carrots, cut into chunks", "1 stick celery, cut into chunks", "3 sprigs parsley", "1 sprig thyme", "6 whole peppercorns", "1 bay leaf", "25g/1oz butter", "400g/14oz frozen peas", "1 large bunch flatleaf parsley, roughly chopped", "750ml/1¼ pint ham stock (from above)", "150ml/5fl oz double cream, plus extra to serve", "salt and black pepper", "2 tbsp rapeseed oil", "1 long baguette, cut in half lengthways, then widthways", "2 garlic cloves, cut in half"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ham hocks, put the ham into a deep saucepan, add all the other ingredients for the ham hock and cover with water. Bring slowly to the boil, then simmer for 1½-2 hours, then remove from the heat and allow to cool slightly.", "Remove the ham hocks from the stock and shred the meat from the bone, reserving the ham stock to make the soup.", "For the soup, heat a large pan until hot, add the butter, peas and parsley then stir in 750ml/1¼ pint of the cooking liquor from the ham hock. Add the cream and bring to a simmer.", "Transfer to a blender and pulse to form a purée.", "Return to the saucepan to heat through, then season with salt and black pepper.", "Heat a griddle pan until hot, drizzle half of the rapeseed oil over the bread, then place on the griddle, cut-side down, and cook until charred.", "To serve, ladle the soup into serving bowls, top with some of the shredded ham, a drizzle of cream and the last of the rapeseed oil."]}, {"isVegetarian": false, "title": "Ham glazed with cherries and bourbon", "url": "www_bbc_co_uk_food_recipes_ham_glazed_with_cherries_83650", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_glazed_with_cherries_83650_16x9.jpg", "ingredients": ["2.5–3kg/5–6lb 8oz gammon joint, smoked or unsmoked, rolled and tied", "1 large onion", "6 cloves", "4 bay leaves", "1 sprig thyme", "few allspice berries", "2 carrots, peeled and roughly chopped", "2 celery sticks, roughly chopped", "few peppercorns", "cloves, for studding", "150g/5½oz cherry conserve", "100ml/3½fl oz bourbon whiskey", "3cm/1¼in piece root ginger, finely grated ", "1 tbsp light soft brown sugar", "½ tsp ground cinnamon"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the gammon in a large saucepan and cover with water. Bring to the boil, then drain. Rinse off any white starch from both the ham and the saucepan, then return the ham to the saucepan. Cover with water again. ", "Stud the onion with the cloves, and add to the pan with all the remaining ingredients. ", "Bring to the boil, reduce the heat and simmer, covered, for 2–2½ hours, or until the ham is cooked through – the internal temperature should reach 68C/154F (you can use a meat thermometer to check). Remove from the heat and either leave to cool in the liquor or immediately transfer to a work surface.", "Preheat the oven to 200C/180C Fan/Gas 6.", "To prepare the gammon for glazing, cut off the string and cut away the outer rind, leaving at least half the thickness of fat underneath attached to the ham. Score a diamond pattern on the fat and stud cloves into each corner. ", "To make the glaze, blend the cherry conserve using a food processor or hand-held blender to get it as smooth as possible, then put it in a saucepan with the bourbon, ginger, sugar and cinnamon. ", "Bring to the boil and simmer for 15 minutes, or until the liquid has reduced enough to coat the back of a spoon. Brush the glaze over the ham, making sure you use it all.", "Place the ham in a roasting tin and roast in the oven for 20–25 minutes, or until it is well browned. Serve in slices."]}, {"isVegetarian": false, "title": "Ham, cheese and fig skewers", "url": "www_bbc_co_uk_food_recipes_hamcheeseandfigskewe_10297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 slices of ham, cut in half ", "1 ball buffalo mozzarella, torn into 12 pieces", "12 basil leaves", "4 char-grilled figs, quartered", "olive oil", "sea salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["On the end of each ham slice, place a piece of mozzarella, basil leaf and a fig quarter.", "Drizzle with olive oil and season with sea salt and freshly ground black pepper.", "Roll up and secure with cocktail stick.", "Refrigerate until required."]}, {"isVegetarian": false, "title": "Ham, egg and peas", "url": "www_bbc_co_uk_food_recipes_hameggandpeas_85942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1¾oz liquid glucose, warmed (available from specialist baking suppliers and online)", "400g/14oz frozen petit pois", "2 sprigs mint, roughly chopped", "pinch caster sugar, if needed", "pinch salt, if needed ", "4 very fresh free-range duck eggs, at room temperature", "8 wafer-thin slices French baguette", "drizzle olive oil", "3-4 tbsp good-quality chicken stock ", "10g/½oz salted butter", "100g/4oz freshly shelled peas ", "pinch salt", "4 wafer-thin slices British air-dried ham, or similar such as Serrano or Parma ham", "100g/4oz fresh pea shoots, chilled"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pea sorbet, bring the liquid glucose and 200ml/7fl oz of water to boil in a saucepan to make a stock syrup. Add the frozen petit pois and mint. Allow to cool slightly and then pour into a food processor or blender. Process on high speed to make a purée. Chill, then pour into an ice cream machine and churn for 20-30 minutes or until the sorbet reaches a soft-scoop ice cream texture. Taste for seasoning and adjust with a pinch each of sugar and salt if necessary. Transfer to a freezer container and freeze. ", "Next, poach the eggs. A rice cooker is the best thing to use, but if you don't have one, heat a pan of water to around 62C/143F, ideally monitoring the temperature with a digital probe. Carefully add the eggs in their shells and leave at 62C/143F for about 1½ hours - the whites will be just firm and the yolks runny. Remove the eggs with a slotted spoon and set aside.", "Preheat the oven to 180C/350F/Gas 4. Arrange the bread slices on a large baking sheet, brush with olive oil and bake for about 12 minutes or until golden-brown. ", "Pour the chicken stock into a medium saucepan and add the butter, shelled peas and a good pinch of salt. Simmer gently for 3-4 minutes to braise the peas until tender. ", "To serve, carefully peel the shells from the duck eggs. Spoon the braised peas into the centre of warmed shallow soup bowls. Sit the eggs on top of the peas. Lay a slice of ham over each egg, and arrange a spoonful of pea sorbet to one side. Lay a couple of pieces of toast on top of the ham. Dress the pea shoots with a drizzle of olive oil and a sprinkling of salt, then scatter them all around."]}, {"isVegetarian": false, "title": "Ham hock terrine with pickled marrow", "url": "www_bbc_co_uk_food_recipes_hamhockterrinewithpi_87047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 4oz ham hocks", "1 onion, roughly chopped", "1 carrot, roughly chopped", "½ tsp black peppercorns", "1 tsp salt", "2 bay leaves", "2 sprigs fresh flatleaf parsley", "2 sprigs fresh rosemary", "water, to cover", "2 leaves gelatine", "1 bunch spring onions, trimmed", "250ml/9fl oz pickling malt vinegar", "125g/4½oz caster sugar", "1 tbsp olive oil", "1 tbsp mustard seeds", "½ tsp chilli flakes", "400g/14oz marrows, peeled, deseeded and cut into 1cm/½in rounds", "½ tsp salt", "pinch freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the terrine, place the ham hocks into a deep saucepan with the onion, carrot, peppercorns, salt and herbs. Cover with water and bring to the boil, then reduce the heat and simmer for two hours. Remove from the heat and allow to cool.", "Take the ham hocks out of the pan and set aside. Strain the cooking liquor through a fine sieve and pour 250ml/9fl oz of it into a saucepan (the rest could be saved and used as a soup base.)", "Bring a saucepan of water to the boil. Place the spring onions into a steamer set over the pan and steam for five minutes, or until just tender. Remove from the steamer and allow to cool.", "Place the gelatine leaves into a bowl of cold water and soak for five minutes until pliable, then drain.", "Bring the reserved 250ml/9fl oz cooking liquor to a simmer and stir in the soaked gelatine. Whisk until the gelatine has dissolved.", "Remove the ham from the bones and cut into 2.5cm/1in thick slices. Line a terrine mould with a large piece of cling film and spread half of the ham over the base.", "Spread the spring onions over the ham, then top with the remaining ham.", "Pour the gelatine mixture over the ham and give the mould a gentle tap to settle the contents and remove air pockets.", "Fold the cling film over the terrine and place two tins on top to weigh it down. Place in the fridge for at least two hours, or until set.", "For the pickled marrow, place the vinegar and sugar into a saucepan and bring to the boil. Remove from the heat.", "Heat the olive oil in a frying pan and add the mustard seeds and chilli flakes. Stir fry for one minute, until the seeds start to pop.", "Add the marrow and fry for 2-3 minutes, or until softened. Season, to taste, with salt and freshly ground black pepper.", "Place the marrow into a bowl, pour over the vinegar mixture and stir well. Allow to cool completely, then place into the fridge. The pickled marrow will keep for several days in the fridge if stored in sealed sterilised jars.", "To serve, remove the cling film from the terrine and cut the terrine into slices. Place onto serving plates with a spoonful of the pickled marrow, drained from its vinegar."]}, {"isVegetarian": false, "title": "Ham, leek and pea soup", "url": "www_bbc_co_uk_food_recipes_hamleekandpeasoup_84643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, chopped", "25g/1oz gammon chopped", "4 baby leeks, chopped", "100g/3½oz fresh peas", "150ml/5fl oz chicken stock", "salt and freshly ground black pepper", "1 tbsp double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan.  Add the onion, gammon and leeks and cook for four minutes. ", "Add the peas and stock to the saucepan and cook for 3-4 minutes. ", "Transfer the mixture into the bowl of a food processor and season with salt and freshly ground black pepper.  Blend the mixture until the soup has a smooth texture. Pour the soup back into a saucepan and simmer until hot all the way through, but not boiling. ", "To serve, pour the soup into a clean bowl and garnish with the double cream."]}, {"isVegetarian": false, "title": "Hand-made skinless sausages with pepper sauce", "url": "www_bbc_co_uk_food_recipes_hand-made_skinless_03476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz pork mince", "1 tsp chopped red chilli", "1 garlic clove, finely chopped", "1 tsp fennel seeds", "110ml/4fl oz red wine", "4 tbsp olive oil", "salt and freshly ground black pepper", "2 large red peppers", "2 large yellow peppers", "1 tbsp salted capers, soaked for 30 minutes, then drained", "1 garlic clove, sliced", "½ red chilli, finely chopped", "5 anchovies", "olive oil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the pork, chilli, garlic, fennel seeds, red wine, salt and freshly ground black pepper together in a bowl until well combined. ", "Using your hands, divide the mixture into 12 and roll each piece into a sausage shape roughly 8cm/3in long and 3cm/1¼in diameter.", "For the sauce, heat a cast-iron griddle on the hob. Grill the peppers on all sides until the skins are black. Set aside to cool, peel away the skins and remove the seeds.", "Blend the pepper with all the other ingredients (except the oil) in a food processor until smooth. ", "With the motor running, pour in enough oil until the dressing becomes a pouring consistency.", "Heat one tablespoons of oil in a large non-stick pan, gently place the sausages into the pan and fry over a medium heat for 10 minutes, turning frequently, until golden-brown on all sides", "Serve the sausages alongside the sauce."]}, {"isVegetarian": false, "title": "Ham shank croquettes", "url": "www_bbc_co_uk_food_recipes_hamshankcroquettes_89235", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ham, picked from a ready-cooked ham shank", "250g/9oz potatoes, boiled until tender, drained, then mashed", "1 tbsp chopped fresh parsley", "1 chilli, finely chopped", "4 gherkins, finely chopped ", "salt and freshly ground black pepper ", "150g/5oz plain flour, plus extra for dusting", "2 free-range eggs, beaten", "150g/5oz polenta", "2 tbsp vegetable oil", "25g/1oz butter, unsalted", "25g/1oz plain flour", "200ml/7fl oz whole milk", "3 tbsp chopped fresh parsley", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the ham, mashed potato, parsley, chilli and gherkins into a bowl and mix to combine well. Season well with salt and freshly ground black pepper.", "With floured hands, mould small amounts of the mixture into 7.5cm/3in long cylinders.", "Dredge the croquettes in the flour, then dip into the beaten egg and finally dip into the polenta to coat completely.", "Heat the oil in a frying pan over a medium heat. Add the croquettes and fry, turning occasionally, until crisp and golden-brown all over. Remove from the pan and drain on kitchen paper.", "For the sauce, melt the butter in a pan over a medium heat, then add the flour. Cook, stirring well, for 2-3 minutes.", "Add the milk, a little at a time, stirring constantly. Keep adding the milk and cooking until you have a smooth sauce.", "Add the parsley and lemon juice, then season, to taste, with salt and freshly ground black pepper. ", "To serve, place a few croquettes onto each plate and drizzle with the sauce."]}, {"isVegetarian": false, "title": "Hand-raised Boxing Day pie", "url": "www_bbc_co_uk_food_recipes_hand-raised_boxing_day_84945", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hand-raised_boxing_day_84945_16x9.jpg", "ingredients": ["450g/1lb plain flour, sifted, plus extra for dusting", "100g/3½oz strong white flour, sifted", "1 tsp salt", "75g/2½oz chilled butter, cut into cubes", "150g/5½oz lard, cut into cubes, plus extra for greasing", "1 free-range egg, beaten, to glaze", "400g/14oz leftover stuffing (sage and onion or flavour of your own preference)", "500g/1lb 2oz cooked turkey, both white and brown meat, roughly chopped", "salt and freshly ground black pepper", "200g/7oz cranberries (fresh, or frozen and defrosted) ", "150g/5½oz cranberry sauce"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the plain and strong flour and salt into a mixing bowl. Using your fingertips, rub the butter into the flour until the mixture resembles breadcrumbs. Make a well in the centre of the mixture. ", "Heat the lard and 200ml/7fl oz water in a small saucepan over a medium heat. When the mixture is simmering pour it into the well in the flour mixture and stir with a wooden spoon, gradually drawing the dry mixture into the liquid, until the mixture comes together as a dough. ", "Grease a 18cm/7in springform cake tin, or raised pie mould with melted lard.  Make sure you grease the tin liberally to prevent the pastry from sticking.", "Tip the dough onto a lightly floured work surface and knead until smooth and pliable. Roll out three-quarters of the dough and use it to a line the prepared tin. Press the pastry into the base and sides of the tin to prevent air bubbles from forming. Leave the excess pastry hanging over the edge of the tin.", "For the filling, spoon half of the stuffing into the pastry case and press down with the back of a spoon. Arrange half of the turkey over the stuffing, then season with salt and pepper.  Mix the cranberries and cranberry sauce together and spoon half over the turkey. Repeat the layers once more, pressing down as before. ", "Roll out the remaining pastry until it is large enough to cover the pie. Brush the overhanging edges with water and place the lid on top, squeezing it together at the edges to seal.  Trim off most of the excess pastry using scissors or a knife, and crimp to create a decorative edge. Make a small hole in the centre of the lid and chill for 30 minutes.  ", "Preheat the oven to 180C/350F/Gas 4 (fan 160C).", "Place the chilled pie in a roasting tin (to catch any juices that may leak from the pie tin) and cook for 45 minutes. Remove from the oven and brush with beaten egg to glaze. Return to the oven for 15 minutes.", "When the pie is cooked, remove from the oven and leave to cool on a wire rack for 10 minutes. Leave to cool for a further 30 minutes before removing from the springform tin or pie mould. "]}, {"isVegetarian": false, "title": "Hand-raised chicken and bacon pie", "url": "www_bbc_co_uk_food_recipes_hand-raised_chicken_and_12433", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hand-raised_chicken_and_12433_16x9.jpg", "ingredients": ["200g/7oz plain flour", "40g/1½oz strong flour", "50g/1¾oz butter", "130ml/4¼fl oz boiling water", "1 tsp salt", "60g/2¼oz lard", "1 free-range egg, beaten, for egg wash", "300g/10½oz chicken breast and thigh meat, cut into chunks", "300g/10½oz smoked back bacon rashers", "2 sprigs fresh thyme ", "salt and freshly ground black pepper", " 240g/8½oz dried apricots, chopped", "2 leaves gelatine", "¼ pint hot water", "1 chicken stock cube"], "serves": "Makes 2 pies", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a large mixing bowl, combine the flours then rub the butter in with your fingertips.", "Mix together the boiling water, salt and lard in small saucepan. Heat and stir together until the lard melts.", "Pour the lard and water mixture on top of the flour mixture, stirring with a spoon until everything comes together.", "Tip the dough onto a floured surface and bring together into a ball.", "Wrap a piece of clingfilm around two clean, empty, straight-sided jam jars (approximately 340g size). Divide the pastry in two, then remove a quarter from each half for the lids of the pies.", "With the remaining three-quarters of the pastry, place on a flat surface and place a jam jar on top of the pastry in the middle. Sculpt the still warm pastry around the dolly, try and make sure the pastry is an even thickness. Make sure the bottom is not too thick and that there are no holes in the pastry. ", "Chill the pie bases in the fridge for about 20 minutes.", "Roll out the reserved quarter of pastry into a circle to match the size of the pie top.  Make a hole in the centre of each one and chill in the fridge.", "Take the pastry cases out of the fridge and carefully pour boiling water from a kettle into each jam jar to soften the pastry and release it from the mould. If it softens too much and begins to sag you may need to chill again for 10 minutes or so. Trim the top of the pie shells to make sure they are even.", "Keeping  them separate, season  the chicken and bacon well with salt, pepper and fresh thyme.", "Now pack the filling into the pie, start with bacon, then chicken, then a layer of roughly chopped apricots. Repeat until the filling is all used up. ", "Place on the lid and crimp around the sides, sealing thoroughly. ", "Brush the lids of the pies with egg wash. Place on a baking tray and cook for 50-60 minutes, or until the pastry is nice and crisp all the way around.", "While the pies are baking, dissolve a chicken stock cube in 150ml/5fl oz of hot water.", "Soak two leaves of gelatine in cold water for five minutes. When soft, squeeze out the excess water and whisk into the warm stock.", "When the pies are cooked, place them on a cooling rack and allow to cool for 10 minutes.", "Carefully pour the stock into the slit on the pie lid, to fill in any spaces inside the pie with (what will be) chicken stock jelly.  This must be done when the pie is hot, if done when cold the jelly will just sit on the top and not soak into every nook and cranny.", "Leave to set overnight before eating."]}, {"isVegetarian": false, "title": "Hanger steak with cauliflower and roasted grapes", "url": "www_bbc_co_uk_food_recipes_hanger_steak_with_23801", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz red grapes, broken into small bunches", "700g/1lb 9oz hanger steaks (or bavette or onglet)", "salt and freshly ground black pepper", "1 large cauliflower, broken into florets, stalk roughly chopped", "400ml/14fl oz double cream", "2 garlic cloves, peeled", "75g/2½oz butter", "100g/3½oz raclette cheese", "1 tsp yeast extract", "15g/½oz Parmesan ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Pick out about 200g/7oz of the small and medium-sized cauliflower florets that have a good circular shape and set aside.", "To make the cauliflower mash, place the remaining florets and the stalk in a saucepan. Pour in the cream, add the garlic and 50g/1¾oz of the butter. Simmer over a medium heat for 10 minutes. Add the raclette cheese and plenty of salt and pepper. Cook for a further 5 minutes, or until the cauliflower is soft.", "Add the contents of the pan to a blender and blend to a purée. Push through a sieve into a clean pan, ready to reheat to serve.", "To make the roasted cauliflower, bring a large pan of water to the boil, add the reserved florets and cook for 2–3 minutes, or until tender. Drain and return to the pan with the remaining butter and the yeast extract. Stir until the butter has melted and the florets are coated. Tip into a small roasting tin and roast in the oven for 20 minutes. Grate the Parmesan all over before serving.", "Meanwhile, place the grapes in a separate roasting tin and roast in the oven for 15 minutes, or until sticky and soft.", "Heat a griddle pan over a very high heat and season the steaks with salt and pepper. Cook for 1–2 minutes on each side – this type of steak is best served very rare or it will become tough. ", "Rest the steaks for 10 minutes, before slicing and serving with the cauliflower mash, roasted florets and grapes."]}, {"isVegetarian": true, "title": "Hard-boiled eggs with mustard mayonnaise", "url": "www_bbc_co_uk_food_recipes_hardboiledeggswithmu_377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10-12 eggs", "1 tbsp English mustard", "2 egg yolks", "1 tbsp white wine vinegar", "A good pinch of salt", "A few turns of white pepper mill", "300ml/½ pint sunflower oil"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Hardboil the eggs for 8 minutes.", "Drain, cover with cold water and leave to cool.", "To make the mustard mayonnaise, mix the mustard, egg yolks, white wine vinegar together in a bowl.", "Very gradually whisk in the oil to make a thick and creamy mayonnaise.", "Spoon into a pot, cover and chill until needed. Serve with the peeled hard boiled eggs."]}, {"isVegetarian": false, "title": "Hardcore coleslaw", "url": "www_bbc_co_uk_food_recipes_hardcore_coleslaw_23307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hardcore_coleslaw_23307_16x9.jpg", "ingredients": ["1 bulb fennel", "¼ small celeriac, peeled", "¼ small red cabbage", "¼ small white cabbage", "1 beetroot, peeled", "1 Spanish onion", "2 large carrots, peeled", "1 tbsp fennel seeds, toasted", "2 tbsp flaky sea salt", "1 lemon, zest only", "1 tsp chopped fresh dill", "1 tbsp chopped chervil", "1 tbsp chopped fresh flatleaf parsley", "5 garlic cloves, grated", "2 free-range egg yolks", "4 tsp white wine vinegar", "35g/1¼oz English mustard", "1 lemon, juice only", "1 tbsp salted anchovies", "2 tsp caster sugar", "350ml/12fl oz vegetable oil", "salt", "cayenne pepper, to taste"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Finely slice the fennel, celeriac, red cabbage, white cabbage, beetroot, onion and carrots and place into a large mixing bowl. Add the fennel seeds and salt. Mix thoroughly, then leave to stand for 20 minutes so the vegetables wilt and cure in the salt.", "For the garlic dressing, add the garlic, egg yolks, white wine vinegar, mustard, lemon juice, anchovies and sugar to a food processor and blend until smooth. While the food processor is still running, slowly pour in the vegetable oil in a thin steady stream until the mayonnaise is emulsified. Season with salt and cayenne pepper, to taste. Pass through a fine sieve to make it really smooth. Keep in the fridge until needed.", "Rinse the vegetables under cold running water for a couple of minutes. Place in a clean tea towel and squeeze out all of the moisture. Put the vegetables in a clean mixing bowl and add the lemon zest and chopped herbs. Check and add seasoning if required. Fold in as much mayonnaise as you like, you may not need it all. Mix together and serve. The coleslaw will keep in the fridge for up to one week."]}, {"isVegetarian": true, "title": "Haricot, herb and ricotta dip", "url": "www_bbc_co_uk_food_recipes_haricot_herb_and_ricotta_45585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz can haricot beans", "20g/¾oz fresh coriander, chopped", "15g/½oz mint, chopped", "200g/7oz ricotta ", "3 tbsp olive oil"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly crush the beans with a potato masher in a large mixing bowl.", "Fold the beans together with the chopped herbs and the ricotta, without over mixing.", "Trickle over the olive oil and serve."]}, {"isVegetarian": false, "title": "Harira soup", "url": "www_bbc_co_uk_food_recipes_harira_soup_63128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil ", "500g/1lb 2oz lamb chops, fat trimmed", " 1 onion, finely chopped", "pinch saffron ", "2 tsp ras el hanout", "½ tsp ground ginger ", "½ tsp ground white pepper ", "½ tsp ground black pepper", "1 beef stock cube", "100g/3½oz brown lentils", "1.2 litres/2 pints boiling water", "2 tbsp tomato purée ", "400g tin chopped tomatoes", "400g can chickpeas, drained and rinsed", "1 tbsp plain flour", "100g/3½oz vermicelli noodles ", "1 bunch fresh parsley, finely chopped", "1 bunch fresh coriander, finely chopped "], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, lidded saucepan over a medium heat. Add the chops and cook on each side until browned. Remove from the pan and set aside. ", "Add the onion to the pan and cook for 5 minutes, until translucent. Add the saffron, ras el hanout, ginger and white and black peppers and crumble in the stock cube, then cook for 2 minutes. ", "Return the chops to the pan with the lentils and boiling water. Cover and cook for 30 minutes.", "Add the tomato purée, tomatoes and chickpeas. Top up with more water to cover if necessary, cover with a lid and cook for 30 minutes. ", "Mix the flour with a tablespoon of cold water and stir into the soup. Add the noodles and cook for 15 minutes, stirring often. ", "Remove from the heat and stir in the parsley and coriander. Serve. "]}, {"isVegetarian": false, "title": "Harissa baked fish with bulgur wheat", "url": "www_bbc_co_uk_food_recipes_harissa_baked_fish_with_63091", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/harissa_baked_fish_with_63091_16x9.jpg", "ingredients": ["2 medium-large ripe tomatoes, quartered", "1 orange or yellow pepper, deseeded and cut into 2cm chunks", "low-calorie cooking oil spray", "75g/2½oz bulgur wheat", "20g/¾oz pine nuts", "1 lemon ", "4 spring onions, thinly sliced", "3 heaped tbsp roughly chopped fresh coriander", "2 x 200g/7oz skinless white fish fillets, such as cod or haddock", "2 tsp harissa paste", "freshly ground black pepper", "160g/6oz broccoli, cut into florets", "2 tbsp fat-free natural yoghurt, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Put the tomatoes and pepper in a small roasting tin, spray with a little oil, season with black pepper and bake for 15 minutes. ", "Meanwhile, cook the bulgur wheat in a small pan of boiling water for five minutes, then drain well in a sieve.", "Toast the pine nuts in a small dry pan over a medium heat, turning regularly, until lightly browned.", "Cut the lemon in half and cut four thin slices from one half. Squeeze the juice from the other half.", "Take the vegetables out of the oven. Add the bulgur wheat, spring onions, pine nuts, two heaped tablespoons of coriander and lemon juice (reserve a little lemon juice to serve). Season with lots of black pepper and toss lightly.", "Make two gaps in the bulgur mixture and nestle the fish into them. Season the fish to taste, spread with the harissa paste and top with lemon slices. Bake for 15 minutes, or until the fish is just cooked. ", "Steam the broccoli until cooked to your liking.", "Divide the fish and bulgur mixture between two plates and scatter with the remaining coriander. Squeeze over the rest of the lemon juice. Add broccoli to the plates and serve with yoghurt."]}]