[{"isVegetarian": false, "title": "Barbecued lamb ribs", "url": "www_bbc_co_uk_food_recipes_bbqlambribs_86385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8-10lb/3.6-4.5kg lamb ribs", "1 litre/1 pint 15fl oz cola ", "85g tomato ketchup ", "2 tbsp black peppercorns, crushed in a mortar and pestle", "1 tbsp cayenne pepper (optional) ", "350ml/12fl oz bourbon whiskey", "165ml/6fl oz maple syrup (or 6 tbsp brown sugar) ", "3-4 tbsp soy sauce ", "2 bay leaves ", "4 large rosemary sprigs ", "4-5 garlic cloves, crushed or pounded in a mortar and pestle"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, combine all the ingredients in a large bowl or basin and immerse the ribs in them. Cover with cling film and leave overnight in the fridge, if possible, otherwise marinate for an hour in the fridge. ", "Preheat the oven to 180C/350F/Gas 4.", "Baste the ribs with the marinade and cover them with aluminium foil. Precook them in the oven for 20-30 minutes. Otherwise the sweet ingredients (cola and maple syrup) may char on the barbecue. ", "Prepare the barbecue. It should not be too hot - the coals should be grey and ashen, but still have good heat. ", "Place the ribs on the barbecue. Turn them over after about 40 minutes to give the other side some texture. After about 10 minutes, turn the ribs over again. ", "If you like your ribs slightly crisper put them under a preheated grill for about five minutes. Be careful not to burn them. Serve."]}, {"isVegetarian": true, "title": "BBQ sauce", "url": "www_bbc_co_uk_food_recipes_bbqsauce_4973", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbqsauce_4973_16x9.jpg", "ingredients": ["1 small onion, chopped", "3 cloves garlic, crushed", "olive oil", "1 red chilli, finely chopped", "1 tsp fennel seeds, crushed", "55g/2oz dark brown sugar", "50ml/1¾fl oz dark soy sauce", "300ml/10fl oz tomato ketchup", "salt and pepper"], "serves": "Makes ½pint", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the onion and garlic in olive oil with the chilli, fennel seeds and sugar. ", "Add the soy sauce and ketchup and season with salt and pepper. ", "Bring to the boil and simmer for a few minutes to combine the flavours. Use as a dip or to coat spare ribs, chicken or sausages. "]}, {"isVegetarian": true, "title": "Bûche de Noël (Yule log)", "url": "www_bbc_co_uk_food_recipes_bche_de_nol_christmas_96543", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs, separated", "60g/2¼oz caster sugar", "60g/2¼oz plain flour", "15g/½oz unsalted butter, melted", "70g/2¾oz caster sugar", "3 free-range egg yolks", "30ml/1¼fl oz dark rum", "240g/8¾oz unsalted butter, softened to room temperature", "200g/7oz candied chestnuts, half reserved whole, the remainder roughly chopped", "40g/1¼oz caster sugar", "25ml/1fl oz dark rum", "2 tbsp milk", "90ml/3fl oz whipping cream", "80g/2¾oz plain chocolate, minimum 70 per cent cocoa solids, chopped, plus extra grated chocolate, to decorate", "cocoa powder, to decorate"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the genoise, preheat the oven to 180C/160C Fan/Gas 4. ", "Whisk the egg whites in a bowl (or free-standing mixer) until soft peaks form when the whisk is removed. Gradually add the sugar as you whisk the egg whites, until stiff peaks form when the whisk is removed. ", "Reduce the speed of the electric whisk to medium, then whisk the egg yolks into the mixture, one by one. ", "Sift half of the flour into the bowl, then gently fold it into the egg mixture using a spatula. Add the remaining flour and carefully fold it into the egg whites too. ", "Pour over the melted butter and gently fold it into the egg white mixture. ", "Line a 30cm/12in Swiss roll tin with silicone paper, sticking each corner to the tin with a dab of the genoise mixture.", "Pour the genoise into the prepared tin, pushing it into the corners and levelling the surface using a palette knife.", "Bake the genoise in the oven for 10 minutes, or until it is pale golden-brown in colour and springy to the touch. Remove from the oven and set aside to cool in the tin. ", "Meanwhile, for the buttercream, heat the sugar and 50ml/2fl oz water in a small saucepan until the temperature of this sugar syrup reaches 121C (use a sugar thermometer for this). ", "Using an electric whisk or free-standing mixer, whisk the egg yolks with 30ml/1fl oz water for 5 minutes on full speed until pale and fluffy. ", "Reduce the speed of the electric beaters, then drizzle the sugar syrup in a thin stream down the side of the bowl. (Caution: do not pour the hot syrup directly onto the beaters). Whisk until the mixture thickens and looks silky, then continue to whisk until the mixture cools completely.", "Reduce the speed of the beaters to a slow speed, then whisk in the rum. Add the softened butter a little at a time, whisking until each addition has become fully incorporated into the sabayon, then continue to whisk for a further 3 minutes.", "Fold in the chopped chestnuts and set aside until needed (chill in the fridge if making in advance).", "For the soaking liquid, bring the sugar and 40ml/1¼fl oz water to the boil in a small saucepan, then remove the pan from the heat and stir in the rum.", "Using a pastry brush, brush the soaking liquid evenly over the cooled sponge.", "Turn the soaked sponge upside down onto a clean tea towel, then carefully peel away the silicone paper.", "Spread one-third of the buttercream in an even layer all over the soaked sponge.  Place the candied chestnuts in a line where the inside of the roll will be. Then roll the sponge as tightly as possible using the tea towel to lift the sponge. ", "Wrap the sponge roll tightly in cling film, then chill in the fridge for 15 minutes. ", "Unwrap the sponge roll and transfer it to a cake board with the seam on its underside. Carefully trim each end using a sharp knife.", "Spread the remaining buttercream all over the sponge roll in an even layer using a palette knife (or piping bag, if desired). Drag a fork lightly and unevenly through the buttercream to make it look like tree bark. Refrigerate for a further 30 minutes.", "Meanwhile, for the chocolate sauce, bring the milk and cream just to the boil in a saucepan. Remove the pan from the heat and stir in the chocolate until smooth and melted.", "Just before serving, dust the bûche de Noël with a little cocoa powder and garnish with grated chocolate or chocolate curls. If desired, slice the end off the log and place it on top. ", "To serve, slice the bûche de Noël and drizzle with a little of the chocolate sauce."]}, {"isVegetarian": false, "title": "Beachside paella", "url": "www_bbc_co_uk_food_recipes_beachside_paella_41859", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beachside_paella_41859_16x9.jpg", "ingredients": ["1 tbsp olive oil", "6 boneless, skinless chicken thighs, cut in half", "75g chorizo (we like picante) skinned and cut into 5mm/¼in slices", "2 medium onions, peeled and chopped", "1 red pepper, quartered, deseeded and sliced", "1 yellow pepper, quartered, deseeded and sliced", "150g/5½oz green beans, trimmed and cut into 2cm/¾in lengths", "3 garlic cloves, peeled and crushed", "2 tsp smoked paprika", "2 good pinches saffron threads", "1 bay leaf", "175g/6oz paella rice (medium-grain rice)", "1 litre hot chicken stock, made with 1 chicken stock cube", "500g/1lb 2oz live mussels, well scrubbed and beards removed", "1 medium squid, cleaned and sliced into rings or 225g/8oz prepared squid rings", "12 raw king prawns, peeled or shells on, thawed if frozen", "flaked sea salt", "freshly ground black pepper", "lemon wedges, for squeezing"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a 38cm/15in paella pan – ideally non-stick. A paella pan is best, but if you don’t have one, use a very wide, shallow non-stick saucepan, flameproof casserole dish or sauté pan.", "Place the pan over a medium heat. Season the chicken thighs with salt and black pepper and fry them for about five minutes, turning every now and then until lightly coloured. Add the chorizo and cook for 30 seconds more, turning once. Transfer the chicken and chorizo to a large heatproof bowl with a slotted spoon, leaving the fat in the pan.", "Add the onions to the pan and fry gently for 4–5 minutes until softened and very lightly browned, stirring occasionally. Add the peppers and green beans to the onions and cook for two minutes until they are beginning to soften. Stir in the garlic, smoked paprika, saffron, bay leaf and rice and cook for 1–2 minutes until the rice is glistening all over.", "Return the chicken and chorizo to the pan, along with any juices. Stir well, then pour in the chicken stock and season with black pepper. Stir once or twice and bring to a simmer over a medium heat. Cook for 12 minutes, stirring occasionally.", "Tip the mussels into the partly cooked rice mixture and stir once more, making sure they are well tucked into the hot rice and steaming liquid. Return to a simmer and cook for three minutes or until most of the mussels have opened, stirring occasionally.", "Scatter the squid and prawns over the top of the paella and stir well. Continue cooking for 4–5 minutes until the squid and prawns are cooked, the rice is tender and almost all the liquid has been absorbed. The prawns should be completely pink when cooked.", "It’s important not to keep stirring after the squid and prawns are added – you want the rice to become lightly browned and a bit sticky at the sides of the pan as this adds flavour. Keep an eye on the heat though, as you don’t want the rice to burn. Add a splash more water if the paella begins to look very dry before the rice is ready. Pick out any mussels that haven’t opened by the end of the cooking time and chuck them away. Serve hot with lemon wedges for squeezing."]}, {"isVegetarian": true, "title": "Bean and rice burrito", "url": "www_bbc_co_uk_food_recipes_bean_and_rice_burrito_33565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bean_and_rice_burrito_33565_16x9.jpg", "ingredients": ["½ small onion, finely diced ", "200g/7oz tomatoes, diced", "1 tbsp white wine vinegar ", "1 lime, zest only (juice used below)", "salt and pepper ", "1 x 400g/14oz tin Mexican-style bean mix or mixed beans in mild chilli sauce ", "200g/7oz frozen sweetcorn, defrosted ", "8 tortilla wraps ", "150g/5½oz long-grain rice, cooked according to the packet instructions ", "1 lime, juice only (zest used above) ", "about 200g/7oz plain yoghurt "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato relish, mix together all the ingredients for the relish in a bowl and season with salt and pepper. Set aside.", "For the bean and rice burrito, heat a small frying pan over a medium heat and warm the beans through for 3-5 minutes. Add the sweetcorn and mix well. Taste and add salt and pepper if necessary.", "Warm the tortilla wraps for 10 seconds in a microwave or in a dry pan over a medium heat until warm and softened.", "To assemble, divide the cooked rice and beans between the eight tortilla wraps. Squeeze a little lime juice over each of them. Spoon over the tomato relish and the yoghurt and roll up to enclose each burrito. Serve warm."]}, {"isVegetarian": true, "title": "Bean and tomato tortilla wraps with guacamole", "url": "www_bbc_co_uk_food_recipes_beanandtomatotortill_85375", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz tinned kidney beans, rinsed and drained", "200g/7oz tinned plum tomatoes, drained", "2 tbsp tomato ketchup", "1 spring onion, finely chopped", "salt and freshly ground black pepper ", "2 ready-made tortilla wraps", "handful fresh coriander, roughly chopped", "few drops Tabasco sauce", "½ avocado, peeled, sliced", "6 tbsp Greek yoghurt", "1 garlic clove, crushed", "2 tbsp tinned kidney beans, rinsed and drained", "½ avocado, peeled", "½ lemon, juice only", "pinch chilli powder", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortilla wraps, place the kidney beans, tomatoes, ketchup and spring onion into a small saucepan and bring to the boil. Reduce the heat and simmer for 3-4 minutes. Season with salt and freshly ground black pepper.", "Place the tortillas onto two plates and divide the bean mixture between the two. Sprinkle over the coriander and a few drops of Tabasco sauce. Add the sliced avocado and roll the wraps up like a cigar.", "Heat a griddle pan and griddle the wraps, turning carefully, until warmed through.", "For the guacamole, place all the guacamole ingredients into a bowl, season with salt and freshly ground black pepper and roughly mash together with a fork until combined.", "To serve, place the wraps onto plates with a dollop of guacamole."]}, {"isVegetarian": true, "title": "Bean and tomato stew with garlic bread, griddled vegetables and basil oil", "url": "www_bbc_co_uk_food_recipes_beanandtomatostewwit_85377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz tinned kidney beans, rinsed and drained", "200g/7oz tinned plum tomatoes, drained", "1 garlic clove, finely chopped", "1 spring onion, finely chopped", "pinch cayenne pepper", "salt and freshly ground black pepper ", "2 tbsp olive oil", "1 slice white crusty bread", "1 spring onion, sliced in half lengthways", "1 courgette, sliced into 4 lengthways", "1 garlic clove, peeled", "salt and freshly ground black pepper ", "1 garlic clove, chopped", "handful fresh basil leaves", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bean stew, place all the bean stew ingredients into a pan and bring to the boil. Reduce the heat and simmer for 4-5 minutes. Season, to taste, with salt and freshly ground black pepper.", "For the garlic bread and griddled vegetables, heat a griddle pan until hot. Drizzle the bread, spring onion and courgette slices with olive oil and chargrill until the bread is toasted and the vegetables are tender. Rub the hot toast with the garlic clove and season the spring onion and courgette with salt and freshly ground black pepper.", "For the basil oil, place the garlic, basil and oil into a small food processor, season with salt and freshly ground black pepper and blend until smooth.", "To serve, place the bean stew into a bowl and drizzle with basil oil. Serve the garlic bread and griddled vegetables alongside."]}, {"isVegetarian": false, "title": "Bean casserole", "url": "www_bbc_co_uk_food_recipes_beancasserole_79155", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 garlic clove, chopped", "2 roasted pepper strips from a jar, chopped", "8 cherry tomatoes, cut in half", "6 baby salami sausages, cut in half lengthways", "85g/3oz tinned cannellini beans, rinsed and drained", "½ courgette, diced", "2 tbsp fresh parsley, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan, add the garlic and sauté for 1 minute. ", "Stir in the peppers and the cherry tomatoes and heat for 2-3 minutes.", "Stir in the salami, beans and courgette and simmer gently for 6-8 minutes, stirring occasionally.", "Add the parsley and season, to taste, with salt and freshly ground black pepper. Transfer to a serving bowl and serve."]}, {"isVegetarian": true, "title": "Bean curd with 'oyster' sauce", "url": "www_bbc_co_uk_food_recipes_beancurdwithoystersa_90178", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beancurdwithoystersa_90178_16x9.jpg", "ingredients": ["6-8 dried shiitake mushrooms", "450g/1lb firm bean curd (tofu)", "oil for deep-frying", "1 clove garlic, peeled and finely chopped", "120g/4½oz fresh peas (shelled weight), or frozen peas (defrosted)", "1 tbsp sesame oil", "1 tsp cornflour", "120ml/4fl oz vegetable stock, plus 1 tbsp", "1 tsp Chinese light soy sauce", "2 tsp Chinese dark soy sauce", "2 tsp sugar", "3 tbsp vegetarian 'oyster' sauce or vegetarian mushroom condiment"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the dried shiitake mushrooms in a bowl, add warm water to cover and leave to soak for 30 minutes or until soft.", "While the mushrooms are soaking, cut the bean curd into slices about 0.5cm x 4cm x 5cm/½in x 1½in x 2in.", "Place the bean curd pieces on a sheet or two of kitchen paper, cover with another piece of kitchen paper and pat them dry.", "Remove the mushrooms from the water and cut off the hard stems. Discard the stems and return the caps to the soaking liquid until needed.", "Heat the oil in a wok or deep-fat fryer over a medium-high heat; it should be about 5cm/2in deep in the centre of the wok if you are using one. (CAUTION: hot oil can be dangerous. Don't leave unattended.)", "When the oil begins to shimmer, add the bean curd pieces and fry them until golden-brown on both sides - this should take about 5-7 minutes.", "Remove the bean curd with a slotted spoon and leave to drain on a plate lined with kitchen paper. Very carefully drain off all but two tablespoons of the oil from the wok.", "For the sauce, mix the cornflour with the one tablespoon of vegetable stock in a small bowl.", "In a separate bowl, combine the light and dark soy sauces, sugar, 'oyster' or mushroom sauce, and the remaining vegetable stock and stir to mix.", "Place the wok or large frying pan back on the hob, set over a high heat. When the oil is hot, add the garlic and stir-fry for 30 seconds.", "Remove the mushrooms from their liquid, squeeze out any excess liquid and add the mushrooms to the garlic. Stir fry for 30 seconds.", "Stir in the bean curd and pour over sauce mixture. Cover, turn the heat to low and simmer very gently for 7-8 minutes.", "Add the peas. Simmer, covered, for a further two minutes.", "Remove the lid and take the wok off the heat. Stir the cornflour mixture and pour it into the wok. Return to the heat, stir gently and cook, covered, on a low heat until the sauce has thickened. Add the sesame oil and stir.", "Serve at once."]}, {"isVegetarian": true, "title": "Bean salad", "url": "www_bbc_co_uk_food_recipes_beansalad_88164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "85g/3oz fine green beans, trimmed", "100ml/3½fl oz double cream", "salt and freshly ground black pepper ", "1 tbsp chopped flatleaf parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently fry the onion and garlic for 5-7 minutes, until translucent. Add the beans and continue to cook for five minutes or until the beans are cooked, but still firm. ", "Add the cream, season with salt and freshly ground black pepper and continue to cook until the cream is heated through and has reduced slightly, about 3-4 minutes.", "Serve as a side dish garnished with chopped parsley."]}, {"isVegetarian": false, "title": "Pork noodles with bean sauce", "url": "www_bbc_co_uk_food_recipes_beansaucenoodles_76545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beansaucenoodles_76545_16x9.jpg", "ingredients": ["300g/10½oz dried or fresh egg noodles, cooked according to the packet instructions and drained", "1½ tbsp oil", "2 garlic cloves, finely chopped", "1 tbsp fresh root ginger, finely chopped", "3 tbsp spring onions, chopped, plus extra for garnish", "450g/1 lb minced pork", "3 tbsp yellow bean sauce or black bean sauce", "1½ tbsp Shaoxing rice wine or dry sherry (optional)", "2 tbsp soy sauce", "½ tsp freshly ground black pepper", "2 tsp chilli oil (optional)", "2 tsp sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat a wok or large frying-pan over high heat until hot. Add the oil. When it is very hot and slightly smoking, add the garlic, ginger and spring onions. Stir-fry for 15 seconds, then add the minced pork.", "Stir well to break up all the pieces and continue to stir-fry for about 2 minutes, or more, until the pork loses its pink colour. Add the remaining ingredients, except the noodles, stirring all the time. Bring the mixture to the boil, turn the heat down to low and simmer for 5 minutes, adding a little water if it looks too dry.  ", "Plunge the cooked noodles into a bowl of boiling water from the kettle for 30 seconds, or until they are just heated through. Drain them well in a colander or sieve.", "Tip the noodles into a large serving bowl and pour the hot sauce over the top. ", "Sprinkle spring onions on top, mix everything together well and serve immediately."]}, {"isVegetarian": false, "title": "Gamekeeper's stew", "url": "www_bbc_co_uk_food_recipes_beaters_stew_70079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pheasants", "2 tbsp oil", "100g/3½oz smoked streaky bacon, cut into 1cm/½in strips", "1 onion, roughly chopped", "2 sticks celery, sliced thinly on the diagonal", "25g/1oz plain flour", "300ml/10fl oz apple juice", "300ml/10fl oz hot chicken stock", "1 tbsp fruit jelly, such as redcurrant jelly", "2 tbsp Worcestershire sauce", "3 bay leaves", "250g/9oz button mushrooms, halved", "gravy browning (optional)", "mashed potato, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 160C/140C Fan/Gas 3.", "To prepare the meat, remove the breast meat and legs from the birds. Set aside the carcasses to make stock for another time. Remove the skin from all the meat and cut the the breast meat into 3cm/1¼in cubes. Season the breast meat and legs with salt and pepper.", "Heat 1 tablespoon of the oil in a casserole dish placed over a medium heat. Add the meat and fry until brown all over. Remove with a slotted spoon and set aside.   ", "Add the remaining oil and fry the bacon for a few minutes until crisp. Add the onion and celery, and fry over a high heat for few minutes until softened. ", "Sprinkle in the flour and stir. Gradually pour in the apple juice and stock and bring to the boil. Add the redcurrant jelly, Worcestershire sauce and bay leaves and return the meat to the pan.  ", "Bring everything back to the boil, stirring. Season with salt and pepper and a few drops of gravy browning, using. Cover and cook in the oven for about 1–1½ hours, or until tender. Add the mushrooms and cook for a further 30 minutes.", "Remove the bay leaves and serve piping hot with mashed potato."]}, {"isVegetarian": true, "title": "Béchamel sauce", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_8751", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "30g/1oz plain flour", "455ml/16fl oz milk", "½ a small onion, peeled and sliced", "4 black peppercorns", "1 dried bay leaf", "3 fresh parsley stalks", "blade of mace", "salt and white pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the milk in a saucepan with the onion, peppercorns, bay leaf, parsley stalks and mace. Bring up to the boil and then turn off the heat. Allow to infuse for 30 minutes and then drain. ", "Melt the butter in a saucepan. Stir in the flour and cook for 1-2 minutes. ", "Take the pan off the heat and gradually stir in the infused milk to get a smooth sauce. ", "Return to the heat and, stirring all the time, bring to the boil. ", "Simmer gently for 8-10 minutes and season with salt and white pepper."]}, {"isVegetarian": true, "title": "Béchamel sauce", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_70004", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bechamelsauce_70004_16x9.jpg", "ingredients": ["15fl oz/425ml milk ", "a few parsley stalks ", "1 bay leaf ", "1 blade of mace or a pinch of powdered mace (optional) ", "10 whole black peppercorns ", "1 slice onion, 1/4 inch (5 mm) thick ", "1½oz/40g butter ", "¾oz/20g plain flour ", "salt and freshly milled black pepper"], "serves": "Makes 15fl oz/425ml", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First place the milk in a small saucepan and add the parsley stalks, bay leaf, mace (if using), peppercorns and onion. Then place it over a low heat and let it come very slowly up to simmering point, which will take approximately 5 minutes. Then remove the saucepan from the heat and strain the milk into a jug, discarding the flavourings.", "All this can be done ahead of time, but when you want to make the sauce, use the same washed pan and place it over a gentle heat. Begin by melting the butter gently - don't over-heat it or let it brown, as this will affect the colour and flavour of the sauce. As soon as the butter melts, add the flour and, over a medium heat and using a small pointed wooden spoon, stir quite vigorously to make a smooth, glossy paste. Now begin adding the infused milk a little at a time - about 1fl oz/25ml first of all and stir again vigorously. Then, when this milk is incorporated, add the next amount and continue incorporating each bit of liquid before you add the next. When about half the milk is in, switch to a balloon whisk and start adding large amounts of milk, but always whisking briskly. Your reward will be a smooth, glossy, creamy sauce.", "Now turn the heat down to its lowest setting and let the sauce cook for 5 minutes, whisking from time to time. While that's happening, taste and season with salt and freshly milled black pepper. If you wish to keep the sauce warm, all you do is pour it into a warmed jug and cover the surface with clingfilm to stop a skin from forming, then place the jug in a pan of barely simmering water."]}, {"isVegetarian": true, "title": "Béchamel sauce", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_70892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1½ pints milk", "1 onion", "1 bay leaf", "2 cloves", "6 black peppercorns", "55g/2oz butter", "55g/2oz plain flour", "grated nutmeg (optional)"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the milk just to the boil with the onion pierced with the bay leaf and cloves, and the peppercorns. ", "Remove from the heat and leave to infuse for 20 minutes before straining.", "Then melt the butter in a non-stick pan, stir in the flour, and cook over a low heat for five minutes. ", "When smooth, start adding some of the strained milk. Stir until smooth, and then add more milk until the sauce is thickened. ", "Cook for 10-15 minutes to ensure the flour is cooked through.", "Sprinkle with grated nutmeg, if desired, and serve."]}, {"isVegetarian": false, "title": "Beef and ale stew", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_76412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 tbsp groundnut oil", "2 onions, peeled and roughly diced", "2 carrots, peeled and sliced", "2 celery sticks, trimmed and cut into large pieces", "1 x 400g/14oz tin good-quality plum tomatoes ", "1 tsp crushed black peppercorns", "2 fresh bay leaves", "2 sprigs fresh thyme", "1 tbsp flour (seasoned with ½ tsp cayenne pepper)", "500g/1lb 2oz diced braising beef", "500ml/17fl oz pale ale", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, heavy-based casserole over a medium-high heat. Add the onions, carrots and celery and fry for 4-5 minutes, or until softened but not browned. ", "Add the plum tomatoes, crushed black peppercorns, bay leaves and thyme and continue to cook, stirring regularly, for 3-4 minutes.", "Stir in the seasoned flour and continue to cook for 2-3 minutes. ", "Add the beef to the vegetable mixture, then pour in the pale ale and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer gently for 3 hours, stirring every 20-30 minutes, until the beef is tender enough to be cut with a spoon.", "Serve the beef and ale stew either in bowls with thick slices of fresh bread, or on plates with mashed potato and green vegetables."]}, {"isVegetarian": false, "title": "Beef and ale pie with mushy peas", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_pie_with_75061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1kg/2lb 4oz braising steak cut into 5cm/2in cubes", "1 onion, finely diced", "250g/9oz chestnut mushrooms, cut into four pieces", "8 small whole round shallots, peeled", "400g/14oz carrots, peeled and cut into three", "4 sprigs thyme", "2 bay leaves", "4 tbsp tomato purée", "500ml/18fl oz ale", "300ml/10½fl oz hot reduced beef stock", "500g/1lb 2oz readymade puff pastry", "1 free-range egg, beaten", "225g/8oz dried marrowfat peas", "1 tsp bicarbonate of soda", "75g/2½oz unsalted butter", "salt"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pie, heat a casserole or a large ovenproof pan over a high heat and add the oil. Once hot, add the steak pieces in batches and fry for 3-4 minutes, or until golden-brown on all sides, stirring regularly. Remove the cooked steak from the dish, transfer to a warm plate and set aside. Repeat the process with the remaining steak pieces, then set aside. ", "Add the onion, mushrooms, whole shallots and carrots to the emptied casserole and fry for 2-3 minutes, or until just softened.", "Add the thyme, bay leaves and tomato purée and stir well to combine.", "Add the ale and stir well, scraping any sediment up from the bottom of the casserole using a wooden spoon. ", "Return the browned steak pieces to the casserole, add the hot stock, stir well and bring the mixture to the boil. Turn down the heat, place a lid on the casserole and cook for 1½ hours, or until the beef is tender and the gravy has thickened. ", "Once cooked, remove the pie filling from the dish and set aside to cool.", "Preheat the oven to 220C/425F/Gas 7.", "Place the beef and gravy mixture in a 23cm diameter round ovenproof dish.", "Roll out the pastry to 1cm/⅓in thickness and cut the pastry into a circle slightly bigger than the pie dish.", "Brush a little water around the rim of the pie dish, then place the pastry over the filling and press the edges to seal the pastry to the dish.", "Brush the pie with a little beaten egg, then place the pie in the oven and cook for 20-30 minutes, or until the pastry is pale golden-brown and has risen. ", "For the mushy peas, in a large bowl soak the peas in three times their volume of water and the bicarbonate of soda. Leave for at least four hours or, if you have the time, overnight.", "Drain the peas, rinse under the tap, and place on the stove in a large pan and cover with water. Cover and bring to the boil. Once boiled, reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. ", "The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid off to dry out a little. Beat in the butter and season to taste with salt.", "To serve, cut a slice of pie and place it on a plate and spoon some mushy peas on the side."]}, {"isVegetarian": false, "title": "Beef and ale stew with horseradish dumplings", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_with_57183", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_ale_stew_with_57183_16x9.jpg", "ingredients": ["2–3 tbsp light olive oil", "1kg/2lb 4oz braising beef, cut into cubes", "250g/9oz shallots or silverskin pickling onions, halved", "2 carrots, thinly sliced", "200g/7oz button mushrooms, left whole", "50g/1¾oz plain flour", "500ml/18fl oz ale", "150ml/5fl oz beef stock", "2–3 tbsp onion marmalade", "1–2 tbsp Worcestershire sauce", "3 bay leaves", "gravy browning (optional)", "salt and freshly ground black pepper", "175g/6oz self-raising flour, plus extra for dusting", "75g/1¾oz suet, shredded", "3-4 tbsp hot horseradish sauce, from a jar", "2 tbsp chopped parsley"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.  ", "Heat 1 tablespoon oil in a deep ovenproof casserole dish over a high heat. Add the beef in batches and brown all over, adding more oil if needed. Transfer to a plate using a slotted spoon and set aside. Pour another tablespoon oil into the casserole dish, then add the shallots, carrots and mushrooms and fry for few minutes, stirring.", "Meanwhile, put the flour in a bowl, whisk in a little ale to make a smooth paste, then whisk in the rest of the ale.", "Return the beef to the casserole, then pour in the ale mixture and stock. Stir over a high heat until thickened and boiling. Stir in the onion marmalade, Worcestershire sauce, bay leaves and gravy browning (if using) and cook, stirring, for few minutes. Season with salt and pepper, cover, then bake for 2–2½ hours, or until the meat is tender.", "To make the dumplings, put the flour and suet in a bowl and season with salt and pepper. Gradually add 150ml/5fl oz water and stir to make a soft, sticky dough. Tip onto a floured work surface and gently knead until smooth.  ", "Flour a sheet of non-stick baking paper. Put the dough on top and roll out to about 15x25cm/6x8in. Spread over the horseradish cream and scatter with parsley. Roll up the dough, from the long side, to make a Swiss roll shape. Chill for 45 minutes, then slice into eight pieces.  ", "When the beef is tender, remove from the oven and increase the oven temperature to 220C/200Fan/Gas 7. Remove the bay leaves and add the dumplings. Return to the oven, without the lid, for 25 minutes, or until the dumplings are golden and puffed up. Serve piping hot. "]}, {"isVegetarian": false, "title": "Beef and apple tagine", "url": "www_bbc_co_uk_food_recipes_beef_and_apple_tagine_51104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz braising steak (ideally chuck steak)", "4 tbsp sunflower oil", "2 onions, halved and sliced", "2 garlic cloves, finely chopped", "2 tsp ground cumin", "2 tsp ground coriander", "1 tsp hot chilli powder", "400g/14oz can chopped tomatoes", "400g/14oz can chickpeas, drained and rinsed", "3 tbsp clear honey", "1 beef stock cube", "1 cinnamon stick", "1 medium sweet potato (around 400g/14oz)", "2 large eating apples", "25g/1oz bunch fresh coriander", "75g/2½oz no-soak dried prunes, halved", "flaked sea salt and freshly ground black pepper", "1 large red-skinned eating apple", "15g/½oz butter", "1 tbsp clear honey"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Trim the beef of any hard fat and cut into roughly 3cm/1¼in chunks. Season all over with salt and pepper.  Heat one tablespoon of the oil in a large non-stick frying pan and fry the beef in three batches over a high heat until lightly browned on all sides, adding a little more oil to the pan when needed. Transfer each batch to a large flameproof casserole once browned.", "Reduce the heat and add two tablespoons more oil to the frying pan. Fry the onions for five minutes, or until softened and lightly coloured, stirring regularly. Add the garlic and sprinkle with the cumin, coriander and chilli powder. Cook for 1-2 minutes more, stirring constantly.", "Tip the onions and spices into the casserole with the beef. Stir 150ml/5fl oz cold water into the frying pan and stir vigorously to lift the sediment from the bottom. Pour into the casserole.", "Add 350ml/12fl oz more water, the tomatoes and chickpeas to the casserole and stir in the honey. Crumble the stock cube over the top, add the cinnamon stick and stir well. Bring to a simmer on the hob, stirring a couple of times. Cover the dish with a lid, transfer to the oven and cook for 1½ hours.", "Ten minutes before the time is up, peel the sweet potato and cut into roughly 2.5cm/1in chunks. Peel the apples, cut into quarters and remove the cores. Cut the apples into 2cm/¾in chunks. Trim the coriander and roughly chop half of the leaves.", "Carefully take the casserole out of the oven and remove the lid. Stir in the sweet potato, apples, prunes and chopped coriander. Cover once more and return to the oven. Cook for a further 45-60 minutes, or until the beef is very tender. Roughly chop the remaining coriander leaves just before serving.", "To make the garnish, cut the apple into quarters and remove the core. Slice each apple quarter lengthways into five. Season with ground black pepper. Melt the butter in a large non-stick frying pan and fry the apple slices over a high heat for 3-4 minutes, or until lightly browned, turning occasionally. Remove from the heat, drizzle with the honey and toss lightly.", "Scatter the fried apples over the tagine in the casserole, scatter with roughly chopped coriander and serve."]}, {"isVegetarian": false, "title": "Beef and ale stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_with_39262", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_ale_stew_with_39262_16x9.jpg", "ingredients": ["2 cloves ", "¼ cinnamon stick ", "2 star anise", "plain flour, for dusting", "1 tbsp salt", "1kg/2lb 4oz braising beef (ideally boneless short rib), cut into large pieces", "3-4 tbsp vegetable oil", "4 carrots, chopped", "2 onions, cut into quarters", "4 celery stalks, trimmed, cut in half", "3 large Bramley apples, cored and diced", "500ml/18fl oz ale", "1.5 litres/2½ pints chicken stock", "1 bunch rosemary, tied together with cook's string", "5 bay leaves", "115g/4oz fresh white breadcrumbs", "115g/4oz beef suet", "115g/4oz self-raising flour", "pinch salt", "2 tbsp chopped fresh flatleaf parsley leaves", "1 free-range egg, beaten", "2 tbsp milk", "rapeseed oil or melted butter, for glazing"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1. ", "For the stew, wrap the cloves, cinnamon and star anise in a clean piece of muslin and secure well. Set aside.", "Sprinkle the flour onto a plate and mix in the salt. Dredge the beef pieces in the seasoned flour, shaking off any excess.", "Heat the oil in a large, heavy-based, lidded, flameproof casserole over a medium heat. Add the beef in batches, frying for a few seconds on all sides, or until browned all over. Remove from the casserole using a slotted spoon and set aside in a bowl. Repeat the process with the remaining beef. ", "Add the carrots and fry, stirring regularly, for 6-8 minutes, or until sticky and deep golden-brown. Remove from the casserole using a slotted spoon and set aside with the beef.", "Add the onions and fry, stirring regularly, for 6-8 minutes, or until well coloured. Remove from the casserole using a slotted spoon and set aside with the beef and carrots. Add the celery and fry, stirring regularly, for 6-8 minutes, or until well coloured. ", "Return the beef and cooked vegetables to the casserole and stir well. Add the muslin bag and the apples and stir again. Pour in the ale, stir well, then bring the mixture to the boil. ", "Pour in the stock, add the rosemary and bay leaves and return the mixture to the boil. Stir well, then cover the casserole with the lid and reduce the heat until the mixture is just simmering. Season, to taste, with salt.", "Transfer the casserole to the oven and cook for 2½-3½ hours, or until the beef is tender and falling-apart.", "For the dumplings, mix together the breadcrumbs, suet, self-raising flour, salt and parsley in a large bowl until well combined. In a jug, whisk together the egg and milk until well combined.", "Make a well in the centre of the dry ingredients, then gradually pour the wet ingredients into it. Stir the dry mixture into the wet mixture a little at a time, until the mixture comes together as a dough. Roll the dough into eight equally-sized dumplings, then set aside.", "When the stew has been cooking for 2½-3 hours and the meat is tender, remove the casserole from the oven and remove the lid. Dot the dumplings onto the surface of the stew, leaving space between each. ", "Put the lid on the casserole and return it to the oven for a further 20 minutes, or until the dumplings have expanded.", "Remove the casserole from the oven. Remove the lid from the casserole and brush the tops of the dumplings with a little oil or melted butter. ", "Increase the oven temperature to 200C/400F/Gas 6. ", "Return the casserole to the oven. Continue to cook for a further 10-15 minutes, or until the dumplings are crisp and golden-brown on top and cooked through. ", "Set the casserole aside for 10-20 minutes before serving. To serve, place the casserole on the table and let people help themselves."]}, {"isVegetarian": false, "title": "Beef and aubergine fatteh", "url": "www_bbc_co_uk_food_recipes_beef_and_aubergine_46108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_aubergine_46108_16x9.jpg", "ingredients": ["4 pitta breads, split open and cut into nacho-sized triangles ", "500g/1lb 2oz Greek-style yoghurt ", "5 tbsp tahini, at room temperature", "2 lemons, juice only ", "2 garlic cloves, crushed", "1–2 tsp sea salt flakes, to taste ", "125g/4½oz pomegranate seeds ", "50g/1¾oz toasted pine nuts ", "1 tbsp finely shredded mint leaves ", "3 tbsp olive oil ", "1 small onion, finely chopped", "1 aubergine, cut into small cubes", "2 tsp ground cumin ", "2 tsp ground coriander ", "1 tsp Aleppo pepper or paprika, plus extra for sprinkling", "1–2 tsp sea salt flakes, to taste ", "500g/1lb 2oz beef mince"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Spread the pitta triangles out on a large baking sheet and toast in the oven for 10–15 minutes, or until they are crisp. You don’t need them to colour, but if they do just a little here and there, that’s not a bad thing. Set aside.", "To make the topping, beat the yoghurt, tahini, 3 tablespoons of lemon juice, garlic and 1 teaspoon of sea salt flakes together in a heatproof bowl that will later sit over a saucepan. Taste to see if you want any more salt. Set aside.", "To make the aubergine-beef layer, warm the oil in a wide, though not deep, heavy-based saucepan or casserole and cook the onion, stirring occasionally, over a medium-low heat for 5 minutes, then turn the heat down to low and cook for another 4 minutes, stirring occasionally, until soft and a pale caramel colour. ", "Turn the heat up to medium, add the aubergine cubes and stir well. Cook for about 10 minutes, stirring frequently. Turn the heat down if they look as if they’re catching. ", "Stir in the cumin, coriander and a teaspoon each Aleppo pepper and sea salt flakes. Turn the heat up to high, add the mince and use a fork to break it up a little and turn in the pan until it’s lost its red colour. Turn the heat back down to medium and cook for 10 minutes, stirring occasionally, until the meat is cooked through. Taste to see if you want to add more salt, then take off the heat.", "Pour about 3cm/1¼in of just-boiled water into a fresh pan and put over a low heat. Sit the bowl with the tahini-yoghurt mixture on top, making sure the bowl does not touch the water. Beat well until the yogurt is slightly above room temperature and has the consistency of lightly whipped cream. ", "To assemble, arrange the crisp pitta triangles on a large round plate. Top with the aubergine-beef mixture, followed by the yoghurt-tahini sauce. Sprinkle with Aleppo pepper or paprika to give a light dusting. Scatter over the pomegranate seeds and toasted pine nuts and, finally, strew with the finely shredded mint leaves. Eat with your fingers, nacho-style. "]}, {"isVegetarian": false, "title": "Beef and blue cheese risotto", "url": "www_bbc_co_uk_food_recipes_beef_and_blue_cheese_34718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 x 200g/7oz pieces beef shin, bone in  ", "375ml/13fl oz red wine", "vegetable oil, for frying ", "1 carrot, diced", "2 celery stalks, trimmed and chopped", "½ onion, chopped", "2 bay leaves", "2 star anise", "1 tbsp salt", "1.2 litres/2 pints dark chicken stock", "2 tbsp olive oil", "50g/1¾oz butter, plus extra to finish", "1 large onion, finely chopped", "2 garlic cloves, grated", "400g/14oz risotto rice", "1 litre/1¾ pints beef stock (from above)", "120g/4oz mild blue cheese, diced", "2 tbsp fresh thyme leaves"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the beef shin pieces in a bowl and cover with red wine. Cover the bowl with cling film and chill in the fridge overnight. The next day, remove the beef from the red wine and pat dry with kitchen paper. Reserve the red wine.", "Preheat the oven to 150C/130C Fan/Gas 2.", "Heat a tablespoon of oil in a flameproof casserole over a medium heat. Fry the beef shin pieces for a few seconds on all sides, or until nicely browned all over. Remove from the pan and set aside.", "Add the carrot, celery and onion to the casserole and fry gently for 4-5 minutes, stirring regularly, until softened. Add the bay leaves and star anise, then lay the browned meat on top of the vegetables. Sprinkle over the salt and pour in the reserved red wine. Bring the mixture the boil.", "Add the chicken stock and return the mixture to the boil. Cover the casserole with a lid and transfer to the oven. Cook for 3½-4 hours, or until the beef shins are very tender.", "Remove the beef shins from the casserole. Pull the meat off the bone and break into flakes. Extract the marrow from the bones. Set aside and keep warm. Strain the stock from the casserole through a fine sieve and keep warm. ", "For the risotto, heat the oil and butter in a saucepan over a medium heat. Add the onion and garlic and fry for 3-4 minutes, or until soft but not coloured.", "Stir in the risotto rice and cook for 1-2 minutes, or until coated in the fat and slightly translucent. ", "Add the warm beef stock a ladleful at a time, stirring well after each addition and allowing almost all of the liquid to be absorbed before adding the next ladleful.", "Continue to add the stock until the rice is just tender (you may not need to use all the beef stock).", "Remove the risotto from the heat and stir in the flaked meat, a knob of butter, the blue cheese and the thyme leaves. Add the bone marrow, to taste and stir well until the butter and cheese have melted, then serve in shallow bowls."]}, {"isVegetarian": false, "title": "Beef and blue cheese puff pastry pizza", "url": "www_bbc_co_uk_food_recipes_beef_and_blue_cheese_89652", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_blue_cheese_89652_16x9.jpg", "ingredients": ["500g/1lb 2oz all-butter puff pastry", "plain white flour, for dusting", "1 free-range egg yolk", "1 tbsp double cream, for the glaze", "2 tsp beef extract ", "3 tbsp onion marmalade", "100ml/3½fl oz cider", "100ml/3½fl oz cider vinegar", "50g/1¾oz demerara sugar", "3 small red onions, peeled and cut into six wedges with the root intact", "75g/2¾oz full-fat crème fraîche", "75g/2¾oz soft blue cheese, such as Dolcelatte", "1 tbsp chopped chives", "salt and freshly ground black pepper ", "200g/7oz bavette steak, thinly sliced", "50g/1¾oz cornflour", "4 tbsp vegetable oil, for cooking", "cayenne pepper, to taste ", "salt, to taste ", "watercress, to garnish"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the base, roll the puff pastry out on a lightly floured work surface into a 28cm/11in circle about 5mm thick. Transfer the pastry to a baking tray lined with baking parchment. Cover with cling film and place in the fridge for at least one hour.", "For the sour onions, place a frying pan over a medium heat and add the cider, cider vinegar and demerara sugar. Bring the pan to the boil and place the onion segments in the liquid. Turn the heat down to a simmer and cook for 5-8 minutes until they start to soften. Turn the onions over and cook for a further five minutes. ", "When soft, remove the pan from the heat, put the onions on a baking tray. Use a blowtorch to char them (alternatively char them under a hot grill). Leave to cool. ", "For the base, preheat the oven to 220C/425F/Gas 7. ", "Prick the puff pastry all over using a fork. In a small bowl or mug, mix the egg yolk and double cream together and brush it on top of the pastry. Place the pastry in the preheated oven and bake for 20 minutes, or until risen, crisp and golden-brown. Turn the oven down to 110C/225F/Gas ¼ and continue to ‘dry’ the pastry out for a further 15 minutes. Do not let it burn.", "Once the pastry is crisp and dried out, remove it from the oven and leave to cool for five minutes. Increase the oven temperature to 180C/350F/Gas 4. ", "For the beef, toss the bavette steak strips in the cornflour and shake off any excess. ", "Heat the oil in a non-stick frying pan. Add the beef strips in batches (do not crowd the pan) and fry until crisp, this will take about 6-8 minutes. Once crisp, drain on kitchen paper and season with salt and cayenne pepper while the beef is still warm.", "Brush the pastry with the beef extract, spread a layer of onion marmalade on top and add the beef. Warm through in the oven for a few minutes. ", "For the crème fraîche dressing, whisk the crème fraîche and blue cheese in a bowl until thick. Fold in the chopped chives and season with salt and pepper. If the mixture is too thick, add a little water to loosen it up so it can be drizzled on top of the pizza.", "Take the pizza out of the oven, spoon some of the blue cheese and crème fraîche dressing on top and garnish with watercress. Serve immediately. "]}, {"isVegetarian": false, "title": "Beef and chorizo with horseradish mash and rosemary dumplings", "url": "www_bbc_co_uk_food_recipes_beef_and_chorizo_with_86545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_chorizo_with_86545_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1kg/2lb 4oz shin of beef, cut into 4cm/1½in pieces", "225g/8oz chorizo, diced", "1 large onion, diced", "2 large carrots, cut to same size as beef", "2 large parsnips, cut to same size as beef", "2 tbsp plain flour", "300ml/½ pint red wine", "600ml/1 pint beef stock", "salt and freshly ground black pepper", "225g/8oz self-raising flour", "pinch salt", "100g/4oz shredded suet", "1-2 tbsp fresh rosemary, finely chopped", "900g/2lb potatoes, peeled and cut into chunks", "25g/1oz fresh grated horseradish, or to taste", "25g/1oz butter", "about 100ml/4floz single cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, make sure there are two available shelves in your oven and preheat the oven to 160C/320F/Gas 3. Heat the olive oil in a flameproof casserole and brown the beef. (You will need to do this in batches, so don't overcrowd the pan.) Using a slotted spoon, lift out the meat and set aside. ", "Add the chorizo and onion to the pan and fry until softened and the fat runs from the chorizo.", "Add the carrots and parsnips and continue to cook until tinged with colour and beginning to soften. Sprinkle in the flour and cook for 2-3 minutes, stirring frequently. Pour over the wine and stirring constantly, bring to the boil.  Stir in the beef stock.", "Return the beef to the pan and season with salt and freshly ground black pepper. Cover with a tight fitting lid and braise on the bottom shelf of the oven for two hours, or until the meat is tender - check during the cooking time to ensure that the meat doesn't become too dry. If it does, add a splash of boiled water.", "For the dumplings, line a baking tray with non-stick baking paper. Sift the flour into a bowl with a pinch of salt. Add the suet and rosemary and bind together with enough cold water to form a soft dough. ", "Using floured hands and working as lightly fingered as possible, divide the mixture into eight and shape into oval dumplings. Place on a baking tray slightly spaced apart.", "Bake the dumplings on the shelf above the beef for the last 25 minutes of the beef’s cooking time, until they are puffed up and cooked through.", "Meanwhile, for the mash, boil the potatoes in a pan of boiling, salted water for 15 minutes, or until tender. Drain well and press through a potato ricer into a warm bowl. Mix in the horseradish, butter and cream. Season to taste with salt and freshly ground black pepper. ", "Serve the mash with the beef and dumplings."]}, {"isVegetarian": false, "title": "Beef and honey stew", "url": "www_bbc_co_uk_food_recipes_beef_and_honey_stew_47298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz plain flour", "450g/1lb braising steak, cut into 2.5cm/1in cubes", "3 tbsp vegetable oil", "1 onion, roughly chopped", "2 carrots, roughly chopped", "2 leeks, roughly chopped", "½ medium turnip, roughly chopped", "1 tbsp honey", "550ml/1 pint beef stock", "2 large potatoes, cut into chunks", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the flour in a freezer bag then add the cubes of meat and shake well to coat. ", "Heat the oil in a large pan and brown the meat on all sides. (Do this in batches as adding too much meat at once makes the meat steam rather than brown.) ", "Fry the onion in the same pan you used for the meat, adding more oil if needed. Once the onion is browned, add the carrots, leeks, turnip, honey and beef stock and return the meat to the pan. ", "Cover the pan with a lid and simmer the stew over a very low heat for at least two hours – the longer it cooks, the better it will be.", "About 20 minutes before serving, add the potato to the stew (adding them at this point means they keep their shape). Season, to taste, with sea salt and freshly ground black pepper before serving."]}]