[{"ingredients": ["1 cebolla picada", "1 diente de ajo, picado", "1 zanahoria, picada en trozos del tamaño de un guisante", "300g / 10½oz de carne magra picada", "1 x 400 g / 14 oz pueden cortar tomates", "50ml / 2fl oz de agua hirviendo", "1 cubo de caldo de carne", "1 cucharadita de orégano seco (opcional)", "pimienta negra (opcional)", "300g / 10½oz de espagueti sin cocer", "1 cucharada de aceite vegetal"], "method": ["Coloque la cebolla picada, el ajo y la zanahoria en un tazón grande apto para microondas.", "Agregue la carne picada y mezcle con un tenedor, rompiendo la carne hasta que esté bien combinada.", "Cubra el recipiente con una tapa para microondas o película adhesiva, dejando un área pequeña abierta, y cocínelo al microondas a plena potencia durante tres minutos.", "Retire el tazón. Revuelva con el tenedor, volviendo a romper la carne picada, cubra y vuelva al microondas por otros tres minutos. Tenga cuidado al retirar el recipiente ya que estará muy caliente. Rompe cualquier grupo de carne picada de nuevo.", "Agregue los tomates picados al recipiente junto con 50 ml / 2 onzas líquidas de agua hirviendo, y desmigaje sobre el cubo de caldo, el orégano y la pimienta negra (si está usando).", "Mezcle todo junto con una cuchara de madera. Cubra nuevamente y cocine en el microondas a máxima potencia durante siete minutos. Retire el recipiente, revuelva bien, cubra y vuelva al microondas por otros 10 minutos a máxima potencia, revolviendo hasta la mitad.", "Retire el recipiente y déjelo reposar mientras cocina los espaguetis.", "Hervir el hervidor de agua para los espaguetis. Rompa los espaguetis en tres partes y colóquelos en un recipiente seguro para microondas. Agregue el aceite y mezcle bien con una cuchara de madera para cubrir los espaguetis con aceite. Vierta sobre agua hirviendo hasta que se cubra y mezcle bien.", "Ponlo en el microondas y cocínalo a máxima potencia durante cuatro minutos.", "Retire el tazón y revuelva los espaguetis. Cubra y vuelva al microondas y cocine a máxima potencia durante otros cuatro minutos.", "Saque el tazón del microondas y déjelo reposar durante dos minutos. Verifique que el espagueti esté cocido y esté al dente (aún tiene un poco de mordisco). Cocine por otro par de minutos si no es lo suficientemente suave.", "Escurrir los espaguetis cocidos y servir con la salsa boloñesa."], "url": "www_bbc_co_uk_food_recipes_microwave_spaghetti_44920", "title": "Microondas espaguetis a la boloñesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/microwave_spaghetti_44920_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "Hígados de pollo de 450g / 1lb, cortados con cualquier tendón y grasa, drenados y secos, cortados en trozos del tamaño de un bocado", "1 cebolla, finamente rebanada", "1 diente de ajo, finamente cortado", "½ cucharadita de copos de chile", "½ limón, solo jugo (ralladura utilizada a continuación)", "200g / 7oz de yogurt natural", "4 panes pitta", "sal y pimienta", "1 manojo de perejil, hojas ásperamente picadas, tallo muy finamente picado", "½ cebolla, muy finamente picada", "½ limón, ralladura solamente (jugo usado arriba)", "2 cucharadas de aceite de oliva"], "method": ["Calentar una sartén a fuego medio. Agregue la mitad de la mantequilla y, una vez derretida, y la olla caliente agregue los hígados de pollo. Brown en cada lado hasta que esté bien coloreado, pero no cocido. Agregue la cebolla a la sartén y cocine durante cinco minutos, luego agregue las hojuelas de ajo y chile y continúe cocinando por dos minutos más.", "Exprima el jugo de limón, comenzando con un cuarto del limón y agregando más al gusto. Agregue la mantequilla restante, deje que se derrita en la sartén y luego hilvane los hígados durante dos minutos a fuego medio para que la salsa burbujee. Los hígados deberían haberse estabilizado en este punto con solo un toque de rosa en el medio. Agregue el yogur y mezcle. Pruebe y sazone con sal y pimienta al gusto. Quítate el fuego y déjalo descansar mientras preparas la ensalada.", "Mezcle todos los ingredientes de la ensalada de perejil y sazone con sal y pimienta. Tueste los panes pitta y luego hágalos abrir a lo largo de uno de los lados largos.", "Coloque los hígados de pollo en los bolsillos de pitta, cubra con la ensalada de perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_middle_eastern-style_60412", "title": "Hígados de pollo al estilo del Medio Oriente con ensalada de perejil y pitta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 t tsp ras-el-hanout", "1½ cucharadita de canela molida", "1 cucharadita de jengibre molido", "½ cucharadita de pimentón", "½ cucharadita de comino molido", "½ cucharadita de chile en polvo Kashmiri", "Patatas Maris Piper de 350g / 12oz, peladas y cortadas en cubos de 2.5cm / 1in (280g / 10oz después del pelado)", "3 cucharadas de aceite vegetal", "Carne de conejo 280 g / 10 oz, en cubos", "Pechuga de paloma de 280 g / 10 oz, en cubos", "120 g / 4¼ oz de venado, en cubos", "280g / 10oz% 20lamb% 20mince% 20 (aproximadamente% 2020 %% 20fat)% 20", "25 g / 1 oz de bérberos secos (disponible en línea)", "100 g / 3½ oz de albaricoques secos, cortados en tercios", "60 g / 2¼ oz de almendras blanqueadas enteras, tostadas y picadas", "100g / 3½oz de yogur griego completo en grasa", "4 cucharadas de melaza de granada", "4 cucharadas de melaza", "1¼ cucharadita de sal de mesa", "80g / 2¾oz de mantequilla sin sal", "140 g / 5 oz de manteca de cerdo, más extra para engrasar", "1 cucharada de sal de mesa", "300g / 10½ oz de harina natural, más extra para espolvorear", "Harina de pan blanco fuerte de 300g / 10½oz", "1 huevo grande de gallinas camperas, batido para lavar huevos"], "method": ["Para hacer la mezcla de especias, mezcle todos los ingredientes en un tazón pequeño. Dejar de lado.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Llene una olla pequeña con agua hirviendo y colóquela a fuego medio. Agregue las papas y cocine por 5-7 minutos. Deben suavizarse pero aún mantener su forma.", "En una sartén grande, caliente el aceite y luego agregue la mezcla de especias. Freír durante 1 minuto a fuego medio, luego agregar las carnes picadas y dorarlas a fuego alto durante 2-3 minutos. Agregue el cordero picado y cocine a fuego medio durante 1 minuto más. Agregue las papas, los frutos secos y las almendras tostadas. Finalmente, agregue el yogur griego, la granada y la fecha de la melaza y cocine hasta que se incorpore y se reduzca ligeramente. Sazonar con la sal. Retirar del fuego y dejar enfriar un poco mientras se hace la masa.", "Para la masa de la masa de agua caliente, agregue la mantequilla, manteca, sal y 240 ml / 8½ fl oz de agua en una olla mediana y caliente hasta que la manteca se derrita.", "Mezcle las harinas juntas en un recipiente y agregue la mezcla de manteca derretida. Mezcle con una cuchara de madera hasta formar una masa suave.", "Cuando esté lo suficientemente frío como para manipularlo, amase brevemente y reserve un tercio de la masa. Espolvoree la encimera y el rodillo con harina y enrolle los pasteles en un grosor de 4 mm.", "Cubra una lata de pastel con forma de resorte de 20cm / 8in con la masa, luego agregue el relleno y cepille el borde de la masa con el lavado de huevo. Estirar dos tercios de la masa restante para hacer la tapa del pastel. Cubra el pastel y ribete los bordes para sellar. Haz un agujero en el medio para permitir que escape el vapor mientras se cocina la tarta.", "Extiende con delicadeza la masa restante y corta las formas de hojas de distintos tamaños y pégalas en la parte superior del pastel con el lavado de huevos.", "Cepille la parte superior del pastel con más huevo lavado y hornee por 1 hora y media. Después de 1 hora, verifique que el pastel esté cocinando uniformemente y muévalo en el horno si es necesario.", "Mientras se hornea el pastel, moldee los pasteles restantes en rosas para decorar los diamantes superiores y pequeños para decorar los lados del pastel. Coloque en una bandeja para hornear forrada con papel antiadherente y hornee los diamantes por 10 minutos y las rosas por 25 minutos.", "Una vez que el pastel esté cocido, retire con cuidado los lados de la lata. Adjunte los diamantes al lado de la tarta con un lavado de huevos. Cepille el huevo en la base de cada una de las rosas y fíjelo en la parte superior del pastel. Hornee el pastel durante 5 minutos para cocinar el lavado de huevos.", "Sirve el pastel caliente o frío."], "url": "www_bbc_co_uk_food_recipes_middle-eastern_game_pie_16769", "title": "Pastel del Medio Oriente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace una tarta de 1 x 20 cm / 8 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 papas para hornear", "1 cucharada de aceite de oliva", "2 dientes de ajo, en rodajas finas", "200g / 7oz de acelga, cortada en tiras de 2cm / ¾in (tallos gruesos de 1cm / ½ pulgada)", "400 g de frijoles cannellini, escurridos", "½ cucharadita de semillas de comino o comino molido", "sal y pimienta negra recién molida", "½ limón, solo jugo, para servir", "100 g / 3½ oz de yogur natural de estilo griego", "1½ nivel de cucharada de tahini", "½ diente de ajo, aplastado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee las papas durante 1 hora y media, o hasta que estén tiernas.", "Mientras tanto, caliente el aceite en una sartén tapada a fuego medio. Agregue el ajo y la acelga. Revuelva y sazone, luego agregue 50ml / 2fl de onza de agua.", "Coloque una tapa en la sartén, baje el fuego y cocine durante 3-4 minutos, revolviendo hasta la mitad. Agregue los frijoles y el comino, cubra y cocine hasta que los tallos estén tiernos, agregando un poco más de agua si es necesario.", "Mientras tanto, para hacer el aderezo, mezcle los ingredientes con una pizca de sal y reserve.", "Separe cada papa al horno por la mitad, cubra con los frijoles y la acelga, un chorrito de jugo de limón y rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_middle_eastern_beans_and_72584", "title": "Papas al horno con frijoles y verduras de Oriente Medio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/middle_eastern_beans_and_72584_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "3 cebollas, en rodajas finas", "4 dientes de ajo, finamente picados", "semillas de comino, tostadas y luego molidas (al gusto)", "pizca de hojuelas de chile, o al gusto", "200g / 7oz de lentejas marrones o verdes", "2 pimientos verdes, semillas retiradas y descuartizado", "jugo de limón, al gusto", "1 cilantro fresco de racimo pequeño, aproximadamente picado", "menta fresca, rasgada", "sal y pimienta negra recién molida", "panes planos", "yogur griego"], "method": ["Caliente el aceite en una sartén grande y agregue las cebollas. Cocine a fuego lento y deje que las cebollas suavicen, endulcen y revuelvan el oro. Esto puede tomar alrededor de 20 minutos. No apresure esta parte, es importante que las cebollas sean dulces.", "Aparte la mitad de las cebollas, suba el fuego y agregue el ajo, el comino y el chile. Revuelva y cuando realmente pueda oler el ajo agregue las lentejas y suficiente agua para cubrirlas en 5 cm.", "Llevar a ebullición y luego reducir a fuego lento. Cubra la sartén y cocine hasta que las lentejas se ablanden. Puede que tenga que recargar el agua si las lentejas se ven secas pero no agregan demasiado, no desea drenar los deliciosos jugos más tarde.", "Mientras tanto, calentar la parrilla a fuego alto. Ase los cuartos de pimiento con la piel hacia arriba hasta que la piel tenga ampollas y se ennegrezca, luego transfiéralos a una bolsa de plástico con cierre hermético. Dejar de lado durante 5-10 minutos, o hasta que la piel se haya desprendido de la carne de pimiento. Una vez que los pimientos estén lo suficientemente fríos como para desprenderse de las cáscaras. Cortar finamente los pimientos y reservar.", "Una vez que las lentejas son realmente suaves, y esto puede tomar hasta una hora, sazone con sal, pimienta y jugo de limón. Agregue las hojas de cilantro y adornar con el resto de las cebollas fritas dulces, pimientos asados ​​y menta.", "Sirva con panes calientes calientes y una cucharada de yogurt griego."], "url": "www_bbc_co_uk_food_recipes_middle_eastern_lentils_38158", "title": "Lentejas del Medio Oriente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/middle_eastern_lentils_38158_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "200g / 7oz de harina fuerte", "1 cucharadita de levadura de acción rápida", "1 cucharada de azúcar en polvo", "1½ cucharadas de zaatar (una mezcla de especias del Medio Oriente ahora disponible en supermercados)", "1 cucharadita de sal fina", "325ml / 11fl oz de agua tibia", "2 cucharadas de aceite de oliva, más extra para aceitar el tazón", "3 cucharadas de zaatar", "1½ cucharada de zumaque (disponible en algunos supermercados y en delicatessen de Medio Oriente)"], "method": ["Para la masa, tamiza las dos harinas en un tazón grande. Mezcle la levadura, el azúcar, el zaatar y la sal. En un recipiente aparte, mezcle el agua tibia y el aceite juntos antes de agregar los ingredientes secos. Mezcle hasta que tenga una masa blanda y pegajosa, cubra con un paño y déjela a un lado para que se demuestre durante 10 minutos.", "Extiende la masa sobre la superficie enharinada y amasa la masa durante 10 minutos hasta que tengas una masa suave y brillante (agrega un poco de harina si es necesario).", "Transfiera la masa a un recipiente engrasado y gírelo para que toda su superficie tenga una fina capa de aceite. Cúbralo con una película adhesiva y déjelo a un lado para probar durante una hora.", "Harina sus manos y derribar la masa girándola de tres a cuatro veces en su tazón. Transfiere a una superficie enharinada y divide la masa en seis piezas iguales y forma cada pieza en una bola. Ruede cada bola para formar un círculo de aproximadamente 18 cm / 7 pulgadas de ancho y 3 mm / pulgadas de espesor (no es necesario que sean círculos perfectos). Coloque cada círculo en un paño ligeramente enharinado.", "Rocíe los círculos de la masa ligeramente con agua y espolvoree zaatar y zumaque sobre la superficie. Deje probar nuevamente por 30 minutos.", "Precalentar el horno a la temperatura máxima; necesita estar muy caliente. Coloque una bandeja para tostar hacia arriba en el estante de la mitad a la inferior (cuanto más desigual sea la superficie, mejor, utilice una bandeja vieja y batida si tiene una). Deje que la bandeja se caliente durante 20 minutos antes de hornear los panes planos.", "Hornee dos o tres panes planos a la vez durante cinco minutos, o hasta que los panes planos estén hinchados y las manchas marrones comiencen a desarrollarse. Mantenga la puerta del horno cerrada para evitar que se enfríe el horno y siga revisando los panes planos mientras se cocinan, ya que pueden arder fácilmente. Retire los panes planos del horno y colóquelos en una rejilla para enfriar. Cocine los círculos de masa restantes."], "url": "www_bbc_co_uk_food_recipes_middle_eastern_taboon_90922", "title": "Pan plano de tabú del Medio Oriente", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6 panes planos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Habas de vaina de 100g / 3½oz (o 600g / 1lb 5 oz si están en las vainas)", "2 lechugas Little Gem, cortadas a la mitad a lo largo, luego en 8 cuñas delgadas", "60g / 2¼ oz de hojas de ensalada", "6 higos frescos recién maduros, removidos, descuartizados", "100g / 3½oz de queso de cabra firme, pelado y desmenuzado", "Espárragos de 250 g / 9 oz, puntas cortadas, tallos cortados en trozos diagonales", "selección de microhierbas púrpuras", "1 cucharadita de jugo de limón", "1 cucharadita de azúcar", "1 cucharadita de mostaza Dijon", "1 diente de ajo, aplastado", "1 cucharada de cebollines finamente picados", "6 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Pon a hervir una olla mediana de agua. Agregue los frijoles y los espárragos y hierva por 2-3 minutos. Escurrir, refrescar en agua fría, luego escurrir nuevamente y pelar las habas.", "Ensamble la ensalada en una ensaladera grande colocando en capas las rodajas de Little Gem, hojas de ensalada, higos, queso de cabra, espárragos, habas y micro hierbas.", "Para el aderezo, mezcle el resto de los ingredientes en un tazón pequeño. Justo antes de servir, vierta el aderezo sobre la ensalada, revuelva para combinar y sirva."], "url": "www_bbc_co_uk_food_recipes_midsummer_asparagus_36009", "title": "Espárragos de verano, queso de cabra y ensalada de higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas y sin piel (cada una con un peso aproximado de 600 g / 1lb5oz), cortadas en trozos de 2.5 cm / 1 in", "2 cucharadas de girasol o aceite vegetal", "25g / 1oz de mantequilla", "2 cebollas ralladas gruesas o muy finamente picadas", "2 dientes de ajo, triturados o finamente rallados", "25 g / 1 oz de raíz fresca de jengibre, pelada y finamente rallada", "2 cucharadas de polvo de curry medio", "1 cucharadita de cúrcuma molida", "1 cucharada de chutney de mango", "75g / 2¾oz de lentejas rojas secas", "800 ml / 1½ pintas de caldo de pollo, hecho con 1 cubo de acciones", "3 cucharadas de crema individual", "pimienta negra recién molida", "160g / 5¾oz de arroz basmati, para servir"], "method": ["Sazonar el pollo generosamente con pimienta.", "Caliente 1 cucharada de aceite en una sartén antiadherente grande. Freír el pollo a fuego medio-alto durante 4-5 minutos, volteándolo ocasionalmente. Transfiera el pollo a un plato con una cuchara o espátula ranurada y devuelva la sartén al fuego.", "Coloque el aceite restante, la mantequilla y la cebolla en una olla grande y antiadherente, y cocine a fuego medio durante 7-8 minutos, o hasta que las cebollas estén bien blandas y ligeramente doradas. Agregue el ajo, el jengibre, el curry en polvo y la cúrcuma y cocine por unos segundos más, revolviendo constantemente.", "Agregue el chutney de mango, lentejas y caldo a las cebollas con especias y deje que hierva a fuego lento. Cocine, revolviendo regularmente, durante 15 minutos, o hasta que el líquido se haya reducido y las lentejas estén blandas.", "Agregue el pollo y la crema a la mezcla de lentejas y cocine a fuego lento durante 5-6 minutos, o hasta que el pollo esté bien cocido. Agregue un chorrito de agua adicional si la salsa es demasiado espesa.", "Mientras tanto, coloque el arroz en una cacerola con agua hirviendo y cocine durante 10-12 minutos, o de acuerdo con las instrucciones del paquete. Escurrir y apartar. Sirva el curry inmediatamente con el arroz recién hecho."], "url": "www_bbc_co_uk_food_recipes_midweek_chicken_korma_82829", "title": "Entre semana korma de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/midweek_chicken_korma_82829_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pan blanco 85g / 3oz, aproximadamente picado", "3 cucharadas de perejil fresco picado", "Pechuga de pollo de 150 g / 5½ oz, cortada en el centro y abierta plana (mariposa)", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva", "Hojas de espinaca 85 g / 3 oz", "½ cucharadita de copos de chile", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "2 cucharadas de hojas de perejil fresco picado", "1 puñado de hojas frescas de albahaca", "sal y pimienta negra recién molida", "1 cucharada de yogur al estilo griego"], "method": ["Para el pollo, coloque el pan y el perejil en un procesador de alimentos y pulse para migas de pan finas. Transfiera a un tazón grande o un plato poco profundo.", "Coloque la pechuga de pollo pegada a la mariposa entre dos hojas de película adhesiva y aplanar con un mazo de carne o un rodillo hasta la mitad del grosor. Sumérgete en el huevo batido y luego revuelve el pan rallado de perejil para cubrirlo todo. Sacuda cualquier pan rallado sobrante.", "Calentar el aceite de oliva en una sartén y freír la pechuga de pollo durante cinco minutos en ambos lados, o hasta que esté dorado y cocido.", "Para la espinaca, caliente el aceite en un wok y agregue las hojuelas de espinaca y chile, revolviendo suavemente durante 2-3 minutos, o hasta que la espinaca se marchite. Sazonar con sal y pimienta negra recién molida.", "Para el pesto de hierbas, coloque todos los ingredientes del pesto en un procesador de alimentos y pulse hasta que estén bien combinados.", "Para servir, espolvoree la espinaca marchita en un plato para servir y cubra con el pollo frito. Rocíe el pesto alrededor de los bordes del plato, y una cucharada de yogur al estilo griego a un lado."], "url": "www_bbc_co_uk_food_recipes_milanesechickenwithw_89111", "title": "Pollo milanés con pesto de espinacas y hierbas marchitas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pargo rojo (aproximadamente 1kg / 2lb 4oz), fileteado, huesos y cabeza reservados", "3 cucharadas de condimento de pescado jamaicano en polvo", "2 limones, solo jugo", "pequeño racimo de tomillo fresco", "4 dientes de ajo, aplastados", "1 zanahoria grande, rebanada en 1cm / ½ en rondas", "2 plátanos verdes o plátanos, pelados, cortados en rodajas a 2cm / 1en rondas", "2 cho cho (disponible en los mercados de las Indias Occidentales o delicatessen), cortado en discos de 1cm / ½ en", "1 ñame, pelado, cortado en discos de 1cm / ½ en", "1 guindilla Scotch verde, parte superior cortada", "6 cebollas de primavera, recortadas"], "method": ["Corta los filetes de pargo rojo en tercios para crear seis piezas en total.", "En un tazón grande, mezcle el aderezo de pescado con el jugo de limón hasta que esté suave y disuelto. Agregue las piezas de pescado y mezcle bien para cubrirlas en el adobo. Dejar de lado para marinar durante 30 minutos.", "Ponga a hervir 1,5 litros / 2¾ pintas de agua en una olla grande. Agregue los huesos de pescado y la cabeza reservados, el tomillo y el ajo. Reduzca el fuego hasta que el caldo esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 30 minutos. Cuele a través de un tamiz fino, devolviendo el líquido filtrado a la sartén.", "Agregue la zanahoria, los plátanos verdes, el chocho y el ñame y cocine a fuego lento durante 10 minutos o hasta que estén tiernos.", "Agregue los filetes de pescado marinado y el adobo. Equilibre cuidadosamente el chile sobre el pescado, solo permitiendo que quede parcialmente sumergido en el caldo. (Sumerja la guindilla por completo para liberar sus semillas si desea un plato más caliente; tenga presente que los chiles Scotch bonnet están muy calientes). Continúe cocinando a fuego lento durante otros 8 minutos o hasta que el pescado esté casi cocido.", "Agregue las cebollas tiernas y cocine a fuego lento durante los últimos 2 o 3 minutos, o hasta que el pescado se desmenuce fácilmente y esté recién cocido. Servir en tazones."], "url": "www_bbc_co_uk_food_recipes_miles_fish_tea_93869", "title": "Té de pescado de Miles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "175g / 6oz de mantequilla sin sal, fría, cortada en cubos", "75g / 2¾oz de azúcar en polvo", "150g / 5oz de mantequilla", "1 x 379 g puede leche condensada", "100g / 3½ oz de jarabe dorado", "350 g / 12 oz de chocolate negro, o una mezcla de leche oscura y cortada en trozos pequeños"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Cubra una lata de torta cuadrada de 23 cm / 9 pulgadas con papel para hornear.", "Combine los cubos de harina y mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a migas de pan finas. (Alternativamente, puede frotar la mantequilla con la mano).", "Agregue el azúcar impalpable y vuelva a pulsar hasta que se combinen.", "Incline la mezcla en la lata de torta forrada y extiéndala uniformemente con el dorso de una cuchara. A continuación, presione el shortbread hacia abajo con firmeza con los nudillos para que esté bien embalado en la lata.", "Hornee los bizcochos durante 30 minutos o hasta que estén ligeramente dorados. Dejar de lado para enfriar.", "Mientras tanto, para el aderezo, caliente la mantequilla, la leche condensada y el sirope dorado en una cacerola, revolviendo ocasionalmente hasta que la mantequilla se derrita y la mezcla esté suave.", "Aumenta el fuego y lleva la mezcla a ebullición, revolviendo con frecuencia. El caramelo se espesará y se pondrá dorado. Déjelo enfriar un poco, luego vierta sobre la manteca fría. Deje que se enfríe completamente.", "Derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua), revolviendo ocasionalmente.", "Vierta el chocolate derretido sobre el caramelo y deje a un lado hasta que el chocolate se haya enfriado por completo.", "Cortar en cuadrados y servir."], "url": "www_bbc_co_uk_food_recipes_millionaires_shortbread_76712", "title": "Torta dulce del millonario", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 20 piezas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/millionaires_shortbread_76712_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de albaricoques secos", "1½ cucharadas de azúcar moreno oscuro", "2 hojas de gelatina", "5 cucharadas de licor de amaretto", "60g / 2¼ oz de mantequilla o margarina", "30g / 1oz de azúcar en polvo de oro", "Almendras molidas 15 g / ½ oz", "½ cucharadita de extracto de almendra", "Harina normal de 80g / 3oz", "Azúcar glas de 140g / 5oz", "225gr / 8 oz de almendras molidas", "exprimir jugo de limón", "1 huevo mediano de gallinas camperas", "gota de extracto de almendra", "120 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (alrededor de% 2050-60 %% 20cocoa% 20solids)", "Crema doble de 120 g / 4½ fl oz", "12g / ⅓oz de glucosa líquida", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (alrededor de% 2051 %% 20cocoa% 20solids)", "Dulce efervescente", "hoja de oro (opcional)"], "method": ["Para hacer que el albaricoque y el amaretto se conserven, ponga los albaricoques y el azúcar en una olla con alrededor de 150 ml / 5 fl oz de agua hirviendo. Llevar los albaricoques a ebullición y cocine a fuego lento durante 40 minutos, o hasta que los albaricoques se hayan ablandado. Recarga el agua si la ves evaporarse demasiado rápido.", "Remoje las hojas de gelatina en un recipiente de agua fría durante cinco minutos, o hasta que se ablanden. Saque los albaricoques del fuego y agregue el amaretto, al gusto, antes de agregar las hojas de gelatina. Revuelva hasta que se disuelva.", "Coloque la mezcla en un procesador de alimentos y mezcle con un puré. Dejar de lado.", "Para las galletas de mantequilla, precaliente el horno a 190 ° C / 170 ° C (ventilador) / Gas 5 y engrase y forre una lata cuadrada de 15 cm / 6 pulgadas con papel de hornear.", "En una batidora independiente con el accesorio batidor, mezcle la mantequilla (o margarina), el azúcar, las almendras molidas y el extracto de almendra hasta que estén suaves y esponjosos. Agregue la harina y bata hasta que comience a agruparse, no se exceda.", "Junta la masa con las manos y presiona en la lata para que quede plana y pareja. Pinchar la masa con un tenedor y hornear en el medio del horno durante 15-20 minutos. Retire de la lata, despegue el papel de hornear y deje enfriar sobre una rejilla.", "Una vez que el shortbread se haya enfriado lo suficiente (alrededor de 20-30 minutos), vierta la reserva en la parte superior y alise para que cubra uniformemente el shortbread y luego colóquelo en el refrigerador por unos 20-30 minutos.", "Para el mazapán, mezcle el azúcar y las almendras en un bol antes de agregar el jugo de limón, el huevo y el extracto de almendras. Mezcle usando un cuchillo, usando las manos hacia el final para crear una bola. Amasar en una superficie de trabajo hasta que quede suave, usando un poco de azúcar glas para evitar que el mazapán se pegue. Envuelva la película adhesiva y relájese hasta que sea necesario.", "Para hacer el ganache, divida el chocolate en cuadrados y colóquelo en un tazón. Lleva la crema y la glucosa líquida justo por debajo del punto de ebullición y luego viértela sobre el chocolate. Revuelva con una espátula hasta que quede suave y brillante. Enfríe a temperatura ambiente hasta que sea necesario.", "Extienda el mazapán a un espesor de 3-5 mm y colóquelo en la parte superior del shortbread. (La reserva debe ser lo suficientemente pegajosa como para sostener el mazapán en su lugar.) Vuelva a colocar en el refrigerador para dejar reposar durante 10 minutos.", "Extienda la ganache sobre el mazapán, asegurándose de que sea lo más uniforme y suave posible. Enfriar en la nevera durante al menos 20 minutos.", "Para hacer las decoraciones de chocolate, coloque el chocolate en un tazón sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del tazón. Cuando el chocolate parezca casi derretido pero aún quedan unos trocitos de chocolate sin fundir encima, retírelo de la sartén y mezcle el chocolate suavemente hasta que esté suave. Debería haberse engrosado un poco. Ahora está listo para usar. Alinee una bandeja para hornear con un pergamino para hornear antiadherente.", "Transfiera el chocolate en una pequeña manga pastelera y recorte un orificio muy pequeño en la parte inferior. Pipe 4 x 3cm / 1½ en líneas paralelas juntas en la bandeja de horno forrada. Pipe otras cuatro líneas a través de estos para crear una forma de celosía. Repite para crear doce formas de celosía. Deje que se configure ligeramente.", "Con un cortador redondo de 2cm / ¾in, corte 12 círculos de las decoraciones del enrejado de chocolate, dejándolos en la bandeja de hornear para que se asienten completamente antes de usarlos.", "Cuando el shortbread del millonario esté listo, usa un cuchillo largo y muy afilado para cortar la galleta en 12 cuadrados. Espolvoree dulcemente caramelos en un lado de los cuadrados.", "Con cuidado, retire las pequeñas rondas de celosías de chocolate del papel y cepille una pequeña cantidad de hoja de oro en cada uno de ellos (si los usa).", "Con cuidado, coloque un disco en cada cuadrado, el lado opuesto a los caramelos y presente en un puesto de pasteles escalonado."], "url": "www_bbc_co_uk_food_recipes_millionaires_amber_59013", "title": "Mantequilla de ámbar del millonario", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 cuadrados", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, ablandada, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo de oro", "Harina normal 300g / 10½ oz", "1 cucharadita de extracto de vainilla", "100g / 3½oz de chips de plátano duro", "150g / 5½oz de mantequilla sin sal", "150 g / 5½ oz de azúcar en polvo de oro", "50g / 1¾oz de jarabe dorado", "1x 397 g / 14 oz de leche condensada", "1 banana grande ligeramente madura, machacada hasta que quede suave", "100 g / 3½ oz de chips de plátano masticables, cortados con tijeras", "1 cucharada de escamas de sal marina", "250 g / 9 oz de chocolate negro", "fichas de plátano duro y masticable cubiertas de hojas de oro"], "method": ["Precaliente el horno a 180 ° C / ventilador 160 ° C / 350 ° F / Gas 4 y engrase ligeramente una lata de rollo suizo con esquinas cuadradas de 20 x 33 cm / 8 x 13 pulgadas.", "Coloque todos los ingredientes para el shortbread en un procesador de alimentos y pulse para formar una masa suave.", "Presione la mezcla firmemente en la base de la lata, para crear una superficie plana y un borde limpio. Pinche todo con un tenedor y hornee durante 20-30 minutos, o hasta que esté ligeramente dorado y firme.", "Para el relleno, moler las chips de plátano duro en un procesador de alimentos a un polvo grueso. Dejar de lado.", "Para hacer el caramelo, coloque la mantequilla, el azúcar, el jarabe y la leche condensada en una cacerola y revuelva a fuego lento hasta que la mantequilla se haya derretido, revolviendo todo el tiempo. Hierva la mezcla suavemente durante 10 minutos, revolviendo todo el tiempo hasta que quede dorado y espeso, revolviendo el puré de plátano unos minutos antes del final.", "Retirar del fuego y dejar enfriar un poco antes de remover a través de los chips de plátano y el polvo de plátano reservado. Vierta sobre la base de pan dulce horneado y espolvoree sobre los copos de sal marina. Deje que se enfríe un poco mientras prepara la cobertura de chocolate.", "Derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Vierta el chocolate sobre la capa de caramelo sazonado con plátano y deje que se coloque en la nevera.", "Cortar en barras con un cuchillo muy filoso y pesado y apilar en un plato de servir. Decore con chips de banana duros y masticables cubiertos de hojas de oro si lo desea."], "url": "www_bbc_co_uk_food_recipes_millionaires_shortbread_88342", "title": "Bandeja de banano de banquete de millonario", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace alrededor de 24 cuadrados", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "1 cebolla grande, finamente rebanada", "2 dientes de ajo, finamente picados", "2 palitos de apio, pelados, finamente cortados", "2 zanahorias medianas, cortadas en cubitos", "500 g / 1 libra de carne de vaca magra 2 oz", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharadas de puré de tomate", "350ml / 12fl stock de carne", "150ml / 5fl oz de vino tinto", "pizca de azúcar en polvo", "1 hoja de laurel", "sal y pimienta negra recién molida", "Harina de 250g / 10oz de levante, más extra para enrollar", "125g / 5oz de carne de res desmenuzada sebo", "½ cucharadita de sal marina fina", "2 cucharadas de perejil fresco picado"], "method": ["Caliente el aceite en una cacerola grande o en una cazuela a prueba de fuego y cocine la cebolla, el ajo, el apio y las zanahorias durante 15 minutos, revolviendo de vez en cuando hasta que estén suaves y dorados.", "Agregue la carne picada y cocine por otros cinco minutos.", "Agregue los tomates, puré de tomate, caldo de carne, vino tinto, azúcar y laurel. Agregue una buena pizca de sal y pimienta negra recién molida. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20 minutos, revolviendo ocasionalmente.", "Para las albóndigas, ponga la harina en un tazón y mezcle el sebo, la sal y el perejil. Haga un pozo en el centro y agregue suficiente agua fría (necesitará alrededor de 200 ml / 7 fl oz) para mezclarlo con una masa suave y esponjosa. Use las manos ligeramente enharinadas para enrollarlas en 12 bolitas.", "Coloque las albóndigas cuidadosamente encima de la carne picada. Cubra con una tapa hermética y cocine a fuego medio durante 18-20 minutos, o hasta que las albóndigas estén bien cocidas y bien cocidas."], "url": "www_bbc_co_uk_food_recipes_mince_and_dumplings_47431", "title": "Picada y albóndigas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mince_and_dumplings_47431_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de azúcar granulada", "30g / 1oz de mantequilla", "Crema doble de 200 ml / 7 fl oz", "200g / 7oz% 20milk% 20chocolate% 20 (38 %% 20cocoa% 20solids),% 20chopped", "3 huevos grandes de gallinas camperas, separados", "copos de sal marina, para adornar"], "method": ["En una cacerola a fuego lento, haga un caramelo disolviendo lentamente el azúcar con 2 cucharadas de agua. Llevar a fuego lento a fuego lento sin remover. Cuando el jarabe comience a colorear alrededor de los bordes, agite suavemente la cacerola, permitiendo que el caramelo se cocine de manera uniforme. No te muevas, pero deja que se vuelva marrón oscuro. Retirar del fuego y mezclar con la mantequilla.", "Mientras tanto, ponga la crema doble en una cacerola grande y llévela a ebullición.", "Vierta el caramelo sobre la crema caliente y continúe mezclando hasta que quede suave. Si hay trozos de caramelo endurecido, déjelos disolver en la crema tibia antes de agregar los demás ingredientes. Deje que se enfríe un poco.", "Agregue el chocolate a la crema de caramelo y deje que se derrita, luego mezcle suavemente. Agregue las yemas de huevo (asegurándose de que la crema de caramelo no esté demasiado caliente o que los huevos revoloteen).", "En un recipiente para mezclar, bata las claras de huevo hasta que formen picos firmes pero no rígidos. (No se sienta tentado a batir demasiado las claras de huevo, ya que una textura más suelta es la mejor). Doble en la mezcla de chocolate con una cuchara grande de metal.", "Divida la mousse entre seis moldes. Enfríe por al menos 6 horas. Termine con una pizca de escamas de sal marina."], "url": "www_bbc_co_uk_food_recipes_milk_chocolate_salt_51156", "title": "Mousse de caramelo de sal y chocolate con leche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pasteles de carne picada sobrantes", "helado de vainilla"], "method": ["Retire el helado del congelador y déjelo ablandar.", "Rompa los pasteles de carne picada en trozos pequeños y mezcle con el helado. Regrese el helado al congelador."], "url": "www_bbc_co_uk_food_recipes_mince_pie_ice_cream_43784", "title": "Pastel de helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz pasas", "150 g / 5½ oz de grosella", "75g / 2½oz de cáscara mixta picada", "3 cucharadas de brandy", "150g / 5½oz de mantequilla fría, rallada", "125g / 4½oz de azúcar morena oscura o azúcar mascabado", "1 vaina de vainilla, semillas raspadas", "1 cucharadita de especias mixtas molidas", "1 manzana Bramley, pelada, rallada, con núcleo descartado", "1 naranja, jugo y ralladura", "1 limón, jugo y ralladura", "Harina normal de 350g / 12oz, más extra para espolvorear", "150g / 5½oz de mantequilla sin sal, ablandada, cortada en cubos", "50g / 1¾oz de azúcar glas, tamizado", "1 naranja, solo ralladura", "2 yemas de huevo de gallinas camperas", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz demerara azúcar"], "method": ["Combine todos los ingredientes para la carne picada en un tazón grande y mezcle bien. Cubra con una película adhesiva y déjela durante 24 horas.", "Para la masa, tamice la harina en un tazón, agregue la mantequilla ablandada, el azúcar glas y la ralladura de naranja e incorpórela suavemente con las manos hasta que la mezcla se asemeje a las migajas de pan rallado. Mezcle las yemas de huevo y luego agregue 2-3 cucharadas de agua para ayudar a unirlas. Exprima la masa juntos suavemente hasta que tenga una bola suave de masa. Aplane a un disco, envuélvalo en una película adhesiva y refrigere durante 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Engrase una lata de bollo o panecillo, dependiendo de cuán profundo le gusten sus pasteles de carne picada. Desenvuelve la masa y despliega sobre una superficie de trabajo ligeramente enharinada al grosor de una moneda de una libra. Recorte 12 discos de hojaldre con un cortador de pasteles ligeramente más grande que el tamaño de los hoyos de lata de bollo. Presione una ronda de pastel en la parte inferior de cada hoyo. Llene cada caja de repostería con carne picada y luego corte otras 12 rondas de masa (esta vez una talla más pequeña). Cepille los bordes de las cajas de repostería con un poco de huevo batido y presione las tapas, presionando los bordes con los extremos de un tenedor para sellarlos.", "Cepille las tapas con huevo batido y luego use un cuchillo pequeño o un pincho para hacer una hendidura en la parte superior de cada pastel. Espolvorear con azúcar demerara y luego transferir la bandeja a la nevera durante 30 minutos.", "Hornee los pasteles de carne picada durante 20-25 minutos, o hasta que estén dorados y crujientes. Transfiera a una rejilla de alambre para enfriar y luego apague los pasteles de carne y sirva. Cualquier carne picada sobrante debe ser cucharada en frascos esterilizados y sellados."], "url": "www_bbc_co_uk_food_recipes_mince_pies_16839", "title": "Mince pies", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 12 tartas de carne picada (más carne picada sobrante)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mince_pies_16839_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 410 g / 14½ oz de carne picada lista para usar", "150g / 5oz de cerezas de Morello en kirsch (disponibles en Continental delicatessens), escurridas", "150g / 5oz de albaricoques secos y listos para comer, cortados en cubitos", "1 lima, ralladura solamente, más ½ limón, solo jugo", "4 hojas de albahaca fresca, trituradas", "pizca de pimienta inglesa", "harina común, para quitar el polvo", "1 x 320g / 12oz de hoja lista para enrollar hojaldre con mantequilla", "1 huevo de gallinas camperas, batido con un chorrito de crema doble", "1 cucharada de azúcar granulada, para decorar", "mantequilla, para engrasar"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "En un tazón grande, mezcle la carne picada, las cerezas, los albaricoques, la ralladura de lima y el jugo de lima hasta que estén bien combinados. Agregue las hojas de albahaca y la pimienta de Jamaica.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta obtener un rectángulo de aproximadamente 38x10cm / 15x4in. Con el borde largo del rectángulo hacia usted, espolvoree la mezcla de carne picada en una línea gruesa en el centro del rectángulo de hojaldre.", "Cepille la masa que no está cubierta por la mezcla de carne picada con un poco de la mezcla batida de huevo y crema, luego enrolle la masa alrededor de la carne picada, presionando para sellar a lo largo de la unión y en cada extremo. Corte cualquier exceso de hojaldre con un cuchillo afilado.", "Cepille la parte superior del rollo de papel picado con el resto del huevo y la mezcla de crema, luego ribetee los bordes o corte con tijeras. Espolvorea sobre el azúcar.", "Transfiera el rollo de papel picado a una bandeja para hornear ligeramente engrasada con mantequilla. Hornee el rollo de carne picada en el horno durante 20-30 minutos, o hasta que la masa se haya levantado y esté dorada claro, y el relleno esté bien caliente. Retire del horno y deje enfriar un poco durante 10 minutos.", "Para servir, corte el rollo de carne picada en rodajas, o rasgue y comparta."], "url": "www_bbc_co_uk_food_recipes_mince_pie_rolls_61196", "title": "Rollos de pastel de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "1 cebolla grande, cortada a la mitad, en rodajas finas", "2 dientes de ajo, finamente picados", "2 palitos de apio, finamente cortados", "2 zanahorias medianas, cortadas en cubitos", "500 g / 1 libra de carne picada 2 oz", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharadas de puré de tomate", "450ml / 16fl oz de caldo de carne, fresco o hecho con un cubo", "pizca de azúcar en polvo", "1 hoja de laurel", "sal marina y pimienta negra recién molida", "Harina de auto aumento 250g / 9 oz", "125 g / 4½ oz de sebo de res, triturado", "½ cucharadita de sal marina fina", "2 cucharadas de perejil fresco finamente picado", "1 cucharadita de romero finamente picado", "1 cucharadita de tomillo finamente picado"], "method": ["Para la carne picada, caliente el aceite en una cacerola grande o en una cazuela a prueba de fuego y cocine la cebolla, el ajo, el apio y las zanahorias durante 15 minutos, revolviendo ocasionalmente hasta que estén suaves y ligeramente coloreados. Agregue la carne de res y cocine con las verduras por otros cinco minutos hasta que la carne picada comience a dorarse, revolviendo regularmente para romper la carne.", "Agregue los tomates, puré de tomate, caldo de carne, azúcar y laurel. Agregue una buena pizca de sal y mucha pimienta negra recién molida. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20 minutos, revolviendo ocasionalmente.", "Para hacer las albóndigas, poner la harina en un tazón y agregar el sebo, la sal y el perejil, el romero y el tomillo. Haga un pozo en el centro y agregue suficiente agua fría (necesitará alrededor de 200 ml / 7 fl oz) para mezclarlo con una masa suave y esponjosa. Enharina ligeramente las manos y enrolle la mezcla en 12 bolitas.", "Revuelva bien la carne picada y retire del fuego. Coloque las albóndigas cuidadosamente encima de la carne picada, luego cubra con una tapa bien ajustada y coloque la sartén a fuego medio. Cocine durante 18-20 minutos o hasta que las albóndigas estén bien rotas."], "url": "www_bbc_co_uk_food_recipes_mince_with_herb_14547", "title": "Pique con albóndigas de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "½ cebolla mediana, pelada y finamente picada", "1 diente de ajo, aplastado", "500 g de carne magra picada", "1 cucharadita de hierbas mezcladas secas", "1 cucharada de puré de tomate", "1 cucharada de harina normal, más extra para enrollar", "500g bloque de hojaldre hecho a mano", "50 g de queso cheddar maduro, finamente rallado (opcional)", "1 huevo mediano, golpeado", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Tienda una bandeja de horno grande (o dos bandejas de hornear más pequeñas) con papel resistente a la grasa.", "Caliente el aceite en una sartén pequeña y fría la cebolla y el ajo durante 2-3 minutos hasta que estén suaves, revolviendo regularmente. Incline la mezcla en un recipiente grande a prueba de calor y deje enfriar durante unos minutos.", "Agregue la carne picada, las hierbas secas, el puré de tomate y la harina al tazón con la cebolla y sazone con sal y pimienta negra recién molida. Mezcle con las manos limpias hasta que estén completamente combinadas.", "Enharina ligeramente una superficie limpia con harina y enrolle la masa de hojaldre en un cuadrado de 34cm / 13½ pulgadas.", "Extienda la mezcla de carne picada sobre la masa, dejando un borde de 2cm / ¾ pulg alrededor de los bordes. Espolvoree sobre el queso rallado, si se usa, y cepille los bordes de la masa con un poco del huevo batido.", "Firmemente enrolle la masa, como un rollo suizo.", "Cortar el rollo en 12 rebanadas iguales con un cuchillo de sierra: un cuchillo de pan es ideal.", "Coloque los molinillos en la bandeja de horno (o bandejas), separados bien para permitir el aumento. Aplane cada molinete ligeramente con la palma de su mano. Cepille la parte superior de cada molinillo con el huevo batido para glasear, teniendo cuidado de no dejar que el glaseado gotee por los lados y sobre la bandeja, ya que esto hará que los molinetes se peguen al papel de hornear. Hornee durante 15 minutos o hasta que estén bien dorados y dorados, y la carne esté bien cocida.", "Deje que se enfríe un poco, luego retírelo del papel de hornear con una espátula. Mejor servido caliente."], "url": "www_bbc_co_uk_food_recipes_minced_beef_pinwheels_78308", "title": "Pinwheels de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minced_beef_pinwheels_78308_16x9.jpg", "isVegetarian": false, "recommendations": 0}]