[{"isVegetarian": false, "title": "Fish curry with watercress and lemon couscous", "url": "www_bbc_co_uk_food_recipes_fish_curry_with_84873", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["240g/9oz couscous ", "1 tbsp butter ", "½ tsp salt ", "1 lemon, zest only", "700g/1lb 9oz skinless tilapia or white fish fillets, defrosted if frozen, cut into large chunks", "1 tsp paprika ", "1 tsp ground turmeric ", "3 tbsp olive oil ", "3 garlic cloves, crushed ", "1 small onion, peeled and finely chopped ", "1 small green chilli, finely chopped (deseeded if you want less heat) ", "½ tsp salt ", "½ tsp ground cumin ", "1 tsp ground coriander ", "85g/3oz watercress, finely chopped ", "large handful pea shoots or micro herbs, to garnish", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon couscous, put the couscous into a large bowl and cover with boiling water to 1cm/½in above the level of couscous. Add the butter, then cover tightly with cling film and set aside for 20 minutes.", "To make the curry, put the fish into a bowl, and sprinkle over the paprika and ½ teaspoon turmeric. Add a pinch of salt and mix well to coat the fish.  ", "Heat the oil in a large lidded non-stick frying pan on a medium-high heat and fry the fish for 3–4 minutes on each side, until cooked all the way through and golden-brown. Remove the fish from the pan and set aside to keep warm. ", "Add the garlic, onions, chilli and salt to the same pan and cook for 5 minutes on a low to medium heat, until the onions have softened. Add the turmeric, cumin and coriander and cook for a few more minutes. Add 200ml/7fl oz water and leave to cook gently on a low heat for a few more minutes. Add the watercress, then cover the pan and cook for 2 minutes, until it has wilted. Return the fish and any resting juices to the pan and mix through gently, just enough to warm the fish through.", "Meanwhile, remove the cling film from the couscous and fluff up with a fork. Add the lemon zest and salt and mix well. ", "Serve the curry with the couscous on the side, garnished with pea shoots or micro herbs and the lemon wedges."]}, {"isVegetarian": false, "title": "Fish fingers with tomato salsa", "url": "www_bbc_co_uk_food_recipes_fish_fingers_with_tomato_13687", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fish fingers", "150g/5½oz tomatoes, roughly chopped", "½ tsp olive oil", "¼ onion (25g/1oz peeled weight), finely chopped ", "pinch dried red chilli flakes", "salt and freshly ground black pepper, to taste", "fresh coriander, finely chopped (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium–hot. Grill the fish fingers according to packet instructions. ", "Meanwhile, mix together all the salsa ingredients in a bowl and serve alongside the fish fingers."]}, {"isVegetarian": false, "title": "Fish goujons and tartare sauce", "url": "www_bbc_co_uk_food_recipes_fish_goujons_and_tartare_10220", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 plaice or lemon sole, filleted, skinned and cut into strips", "75g/2½oz plain flour", "2 free-range eggs", "150g/5½oz panko breadcrumbs", "3 free-range egg yolks", "2 tbsp cider vinegar", "300ml/10fl oz rapeseed oil", "110g/4oz capers", "150g/5½oz gherkins, chopped", "½ shallot, finely chopped", "1 small bunch fresh dill, chopped", "2 tbsp chopped fresh flatleaf parsley", "1 lemon, cut into wedges, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 190C or until a breadcrumb sizzles and turns golden-brown when dropped into it (CAUTION: Hot oil can be dangerous. Don't leave unattended).", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the panko breadcrumbs onto a separate plate. Dredge the fish in flour, dusting off any excess, then dip them in the egg, then roll in the breadcrumbs until coated.", "Cook in the deep-fat fryer for 2-3 minutes until golden-brown.", "For the tartare sauce, whisk the egg yolks and vinegar together in a bowl.", "Continue to whisk the mixture and slowly pour in the rapeseed oil until all of the oil is incorporated and mixture is thick and light.", "Stir in the capers, gherkins, shallot and herbs. Season, to taste, with salt and pepper and a squeeze of lemon juice.", "Serve the fish goujons with the tartare sauce and lemon wedges. "]}, {"isVegetarian": false, "title": "Fish in parsley sauce", "url": "www_bbc_co_uk_food_recipes_fish_in_parsley_sauce_44734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz unsalted butter", "375g/13oz plain flour", "3 litres/5¼ pints whole milk", "large bunch fresh curly parsley, finely chopped", "sea salt and freshly ground black pepper", "6kg/13lb ling fillets, skin on"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "The make the parsley sauce, melt the butter in a large saucepan. Add the flour, cook for 2-3 minutes then slowly add the milk to the pan, whisking continually, until you have a thick white sauce. ", "Add the parsley and cook for a further five minutes.  Season with salt and freshly ground black pepper.", "Meanwhile, place the fish on large baking trays lined with greaseproof paper.  Season with salt and freshly ground black pepper and put in the oven for 7-10 minutes or until the fish is cooked through. (You may have to do this in batches.)", "To serve, place the fish on the plate and pour over the parsley sauce."]}, {"isVegetarian": false, "title": "Fish pie", "url": "www_bbc_co_uk_food_recipes_fish_pie_27557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb floury potatoes, peeled and cut into chunks", "100g/3½oz butter", "100ml/3½fl oz milk", "salt and freshly ground black pepper ", "2 free-range eggs", "600ml/21fl oz milk", "1 bay leaf", "1 leek, finely chopped", "100g/3½oz smoked haddock fillet, skinned", "200g/7oz salmon fillet, skinned", "50g/1¾oz butter", "50g/1¾oz plain flour", "2 anchovy fillets", "1 whole smoked mackerel, flaked", "300g/10½oz cooked prawns", "4 scallops, cleaned, roe removed", "100g/3½oz Edam cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the mash, boil the potatoes in a large saucepan of salted water until tender. Drain, return the potatoes to the pan and mash them with the butter and milk. Season. ", "To make the filling, cook the eggs in boiling water for 10 minutes. Cool under running water, then peel and quarter them. ", "Warm the milk, bay and leek in a wide sauté pan. Add the haddock and salmon and poach gently for 5 minutes then remove, reserving the infused milk.", "Melt the butter in a frying pan and gradually add the flour, stirring, until you have a paste. Pour in the infused milk, whisking constantly, until you have a smooth sauce. Add the anchovy and season. ", "Flake in the salmon, haddock and mackerel.  Add the prawns and scallops and transfer to a pie dish. Dot the egg quarters over the top.", "Top with the mashed potato, scatter with the Edam cheese and bake for 20 minutes, or until golden and bubbling. "]}, {"isVegetarian": false, "title": "Fish pie", "url": "www_bbc_co_uk_food_recipes_fish_pie_84774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz floury potatoes, cut into chunks", "300g/10½oz Gruyère, grated", "salt and freshly ground black pepper", "2 free-range eggs ", "300g/10½oz smoked haddock fillet, skinned and pin-boned  ", "150g/5½oz raw prawns, shells removed", "6 cooked crayfish, shells removed", "3 sardines, gutted and cleaned ", "1 small monkfish tail, loin removed", "500ml/18fl oz whole milk", "1 onion, halved", "1 bay leaf ", "30g/1oz unsalted butter", "2 banana shallots, finely chopped", "50ml/2fl oz vermouth ", "30g/1oz plain flour", "½ bunch fresh dill, roughly chopped", "½ bunch fresh parsley, roughly chopped ", "½ bunch fresh chives, snipped"], "serves": "Serves 4–6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. To make the topping, cook the potatoes in lightly salted boiling water for 15–20 minutes, or until cooked. Drain well and mash.", "To make the filling, put the eggs in a saucepan of water and bring to the boil. Lower the temperature and boil for 8 minutes. Remove from the pan with a slotted spoon and leave to cool. Peel and cut in half. ", "Meanwhile, put the smoked haddock, prawns, crayfish, sardines, monkfish, milk, onion and bay in a sauté pan and bring to a simmer. Poach the fish for a few minutes. Lift it out using a slotted spoon and break the haddock and monkfish into large chunks, then set aside. Strain the milk into a jug and reserve. ", "Add enough of the poaching milk to the potatoes to make a thick mash. Mix in the Gruyère. Season and set aside.", "To make the sauce, heat a medium sauté pan, add the butter and heat until melted. Add the shallots and cook until softened. Pour in the vermouth and reduce by half. Tip in the flour, stir well and cook for a minute. Whisk in most of the reserved poaching milk and simmer for a few minutes. Remove from the heat and stir in the smoked haddock, monkfish and herbs.", "Put the prawns and half the crayfish in a 23cm/9in ovenproof pie dish. Top with the eggs, then the sauce and white fish. Finally spoon over the mash and stick the remaining crayfish and the sardines in the top, heads and tails showing.", "Bake for 20–30 minutes, or until golden and bubbling. Serve."]}, {"isVegetarian": false, "title": "Fish pie with garden peas", "url": "www_bbc_co_uk_food_recipes_fish_pie_with_garden_36257", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5-6 large baking potatoes", "1 tbsp vegetable oil", "handful rock salt", "200g/7oz mussels", "150ml/5fl oz white wine", "1 onion, thinly sliced", "½ tsp black peppercorns", "2 bay leaves", "500g/1lb 2oz boneless, skinless smoked haddock", "400g/14oz salmon, bones and skin removed", "400g/14oz cod, bones and skin removed", "200g/7oz butter ", "3 heaped tbsp plain flour", "475ml/17fl oz milk  ", "1 lemon, zest and juice", "4 tbsp chopped flat leaf parsley", "250g/9oz cooked peeled prawns", "1 cooked lobster, meat removed", "150g/5½oz strong cheddar, grated", "200g/7oz peas", "50g/1¾ unsalted butter", "salt and pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish pie, preheat the oven to 180C/160C Fan/Gas 4. ", "Prick the potatoes all over with a fork, then rub with a little oil. Sprinkle a roasting tray with the rock salt and place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Clean the mussels in running water. Discard any open mussels that do not close when given a sharp tap. Put a large saucepan over a high heat. Add the mussels and white wine, cover with a lid and cook for 2-3 minutes, or until the mussels have opened. Strain and discard any mussels that have not opened (keep the cooking liquor). Pick the mussels from their shells. ", "Meanwhile, half-fill a large frying pan with water and bring to a simmer. Add the onion, black peppercorns, bay leaves and all the fish. Poach for 3-4 minutes, then lift the fish from the pan using a slotted spoon and set aside. Strain the fish stock through a sieve suspended over a large bowl. Reserve the strained stock and discard the onion, bay leaves and peppercorns.", "Melt 100g/3½oz of the butter in a saucepan over a medium heat. Whisk in the flour to form a smooth paste, then cook for a further 1-2 minutes. ", "Whisk in 50ml/2fl oz of the milk until it is fully incorporated into the sauce. Continue to add 350ml/12fl oz of the remaining milk little by little, whisking after each addition, until the sauce is smooth and thick. Add 500ml/18fl oz of the fish stock and the cooking liquor from the mussels, stir well and cook for 4-5 minutes, or until the sauce is smooth and just thick enough to coat the back of a spoon. (Any remaining fish stock can be chilled and frozen for use in another dish.)", "Stir in the lemon zest, juice and parsley, then season with salt and pepper. Remove from the heat. Stir the prawns and lobster meat into the sauce, then flake in the poached fish, keeping it in fairly large pieces. Transfer the pie filling to a large ovenproof dish.", "When the potatoes are cooked, remove them from the oven and increase the oven temperature to 220C/200C Fan/Gas 7.", "Slice the potatoes in half, scoop out the flesh and pass it through a potato ricer into a pan set over a medium heat. Add 75g/2½oz of the butter and the remaining 75ml/2½fl oz milk to the potatoes and beat over the heat until the mash is smooth, thick and not too soft. ", "Spoon the mash into a piping bag with a large star-shaped nozzle and pipe the mashed potato all over the fish pie filling. (Alternatively, just spread mashed potato over the filling.) Sprinkle over the grated cheese.", "Place the ovenproof dish onto a baking sheet and bake for 5-10 minutes, or until the cheese and potatoes are golden-brown and the pie is heated through.", "Meanwhile, bring a pan of salted water to the boil, add the peas and cook for 2-3 minutes until tender. Drain well and return to the pan, then stir in the butter and season with salt and pepper. Serve the fish pie with the peas alongside."]}, {"isVegetarian": false, "title": "Fish pie with soufflé crouton topping", "url": "www_bbc_co_uk_food_recipes_fish_pie_with_souffl_57249", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_pie_with_souffl_57249_16x9.jpg", "ingredients": ["50g/1¾oz butter, plus extra for greasing", "1 leek, thinly sliced or chopped", "50g/1¾oz flour", "600ml/20fl oz hot milk", "2 tbsp chopped fresh dill", "2 tbsp lemon juice", "350g/12oz fresh haddock, skinned and cut into evenly sized cubes", "350g/12oz undyed smoked haddock, skinned and cut into evenly sized cubes", "3 hard-boiled eggs, each cut into 4 or 8 wedges", "1 small (400g/14oz) loaf white bread (about 2-3 days old)", "50g/1¾oz full fat cream cheese", "75g/2½oz butter", "75g/2½oz mature cheddar, grated", "1 large free-range egg white", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1.5 litre/2½ pint shallow wide-based ovenproof dish with butter.", "To make the fish pie, melt the butter in a saucepan, add the leeks and gently soften over a low heat until completely tender but not coloured.  ", "Sprinkle in the flour and stir over a high heat for a minute. Gradually pour in the hot milk, stirring all the time until the sauce is smooth, thick and has come to the boil.  Remove from the heat and add the chopped dill, lemon juice, fish and season with salt and pepper.  Cook for two minutes, stirring.  Remove from the heat.", "Spoon into a 1.5 litre/2½ pint shallow wide-based ovenproof dish. Arrange the eggs on top of the sauce and press in gently. Level the top and set aside until cold. Cover with cling film and chill in the fridge for about an hour or until firm.", "Preheat the oven to 200C/180C Fan/Gas 6.", "To make the soufflé topping, remove the crusts from the loaf and discard. Cut into five slices then cut each slice into small cubes (about 1.5cm/¾in across). You will need 150g/5½oz of bread cubes.  ", "Add the cream cheese, butter and cheddar to a saucepan, melt over a low heat until runny (the mixture may look curdled but do not worry).  Set aside for a moment.  ", "In a spotlessly clean bowl, whisk the egg white until stiff peaks form when the whisk is removed. Fold the eggs whites into the cheese mixture.  Season with salt and pepper and carefully stir.  Stir in the bread cubes so they are all coated in the mixture.  Spoon onto the top of the chilled fish mixture so the cubes are in a single layer.", "Bake in the oven for 25-30 minutes until golden-brown and bubbling. If it is getting too brown cover it with foil and continue to bake.", "Leave to stand for five minutes then serve with salad or green vegetables."]}, {"isVegetarian": false, "title": "Fish soup-stew", "url": "www_bbc_co_uk_food_recipes_fish_soup-stew_79327", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup-stew_79327_16x9.jpg", "ingredients": ["2kg/4lb 8oz mixed fresh fish fillets and shellfish, such as red mullet, small sole, gurnard, monkfish, sea bass, cuttlefish, baby octopus, prawns, mussels, squid or scallops", "8 tbsp olive oil, plus extra for drizzling", "1 large onion, finely sliced", "2 garlic cloves, finely chopped, plus an extra clove for the toast", "1kg/2lb 4oz ripe tomatoes, skinned and chopped, or 2x400g/14oz tins of chopped tomatoes ", "125ml/4fl oz red wine", "chopped fresh chilli, to taste", "3 tbsp finely chopped flatleaf parsley", "½ tsp fennel seeds", "salt and freshly ground black pepper", "6-8 slices good bread, slightly stale or toasted"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["If your fishmonger hasn’t already done so, clean and prepare your chosen fish and shellfish. Cut fish fillets into large chunks and seafood into manageable pieces. ", "Put the oil, onion and garlic into a large pan and fry briefly. ", "Add the tomatoes, wine, chilli, parsley and fennel seeds and season with salt and pepper. Cook for 15 minutes. ", "Start to add large pieces of fish to the sauce first and those that will take the longest to cook such as monkfish, then add the more tender fish such as red mullet or sole and the shellfish, ending up with the mussels if using. Cook for five or so minutes, or until the fish is cooked and the mussels have opened. (Discard any mussels that haven't opened.)", "Rub the bread with garlic, drizzle with olive oil, and put each slice in the bottom of a deep soup bowl. Pour over the soup and serve. "]}, {"isVegetarian": false, "title": "Fish soup with rouille-topped crostini", "url": "www_bbc_co_uk_food_recipes_fish_soup_with_27076", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup_with_27076_16x9.jpg", "ingredients": ["4 tbsp olive oil", "1 onion, peeled, roughly chopped", "2 banana shallots, peeled, roughly chopped", "1 fennel bulb, trimmed, roughly chopped", "4 garlic cloves", "2kg/4lb 4oz fish bones (if using fish heads, ask your fishmonger to remove the gills)", "300g/10½oz prawn shells and heads", "2 tbsp sun-dried tomato purée", "400g/14oz canned chopped tomatoes", "500g/1lb 2oz passata", "2 tbsp dried mixed herbs", "1.5 litres/2½pints chicken or vegetable stock", "1 tbsp caster sugar", "salt and freshly ground black pepper", "1 small dressed crab (optional)", "250ml/9fl oz double cream", "1 small unbaked ciabatta, cut into 6-8 thin slices", "splash olive oil", "salt and freshly ground black pepper", "2 garlic cloves", "2 free-range egg yolks", "75ml/3fl oz extra virgin olive oil", "75ml/3fl oz vegetable oil", "large pinch cayenne pepper", "3 tbsp tomato purée", "freshly squeezed lemon juice, to taste", "6-8 bantam eggs (available from farm shops)", "splash of white wine vinegar", "75g/3oz gruyère, grated", "parsley or chervil sprigs, to garnish"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish soup, heat the oil in a frying pan over a medium heat. Fry the onion, shallots and fennel for 8-10 minutes, or until softened, then add the garlic and continue to fry for a further 1-2 minutes, stirring well.", "Add the fish bones and fry for a further 4-5 minutes, stirring well.", "Add the prawn shells and heads, tomato purée, chopped tomatoes, passata, mixed herbs, stock and caster sugar and stir until well combined. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 30 minutes. Once cooked, set aside to cool slightly.", "Meanwhile, for the rouille-topped crostini, place the slices of ciabatta onto a baking tray. Brush each slice with a little olive oil and season, to taste, with salt and freshly ground black pepper. Bake in the oven for 5-6 minutes, or until crisp and golden-brown. Set aside.", "To make the rouille, blend the garlic and egg yolks in a food processor with a pinch of salt.", "Mix together the vegetable and extra virgin olive oil. With the motor still running, gradually add the oils to the egg mixure in a thin stream until the mixture becomes thick and smooth.", "Add the cayenne pepper, tomato purée and lemon juice and blend again until smooth. Set aside.", "Once the fish soup has cooled, blend the mixture to a smooth purée using a hand-held blender, then strain through a fine sieve into a clean bowl, helping the mixture through the sieve using the back of a wooden spoon. Season, to taste, with salt and freshly ground black pepper.", "Just before serving, reheat the fish soup gently, stirring in the crabmeat (if using) and cream.", "Meanwhile, poach the bantam eggs. Bring a saucepan of water to the boil, add the eggs (still in their shells) and boil for 20 seconds. Remove the eggs from the water.", "Add a splash of white wine vinegar to the boiling water and stir to form a vortex. Crack one of the eggs into the centre of the vortex and poach for 2-3 minutes, or until the egg is cooked to your liking. Remove the poached egg from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining eggs.", "Top each crostini with a teaspoonful of rouille and a little grated gruyère. Top each with a poached bantam egg and garnish with a sprig of parsley or chervil.", "When the soup is warmed through, ladle into bowls. Serve the rouille-topped crostini alongside, or float them on top of the soup."]}, {"isVegetarian": false, "title": "Fish soup with aïoli", "url": "www_bbc_co_uk_food_recipes_fish_soup_with_aoli_67591", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz cod loin, cut into 1.5cm/⅝in chunks", "1 lemon, zest only", "1½ tbsp olive oil", "1 garlic clove, thinly sliced", "1 large red onion, thinly sliced", "1 fennel bulb, thinly sliced", "1 carrot, finely chopped", "1 tsp mild curry powder", "½ tsp paprika", "1 400g tin chopped tomatoes, drained", "400ml/14fl oz Pino Grigio white wine ", "2 tsp caster sugar", "250ml/9fl oz fish stock ", "small bunch fresh dill, finely chopped", "200g/7oz raw king prawns, deveined", "20g/¾oz butter", "15g/½oz finely chopped flatleaf parsley", "small bunch chives, finely chopped", "freshly ground black pepper", "2 free-range egg yolks", "1 tbsp fresh lemon juice", "250ml/9fl oz sunflower oil", "1 garlic clove, crushed", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coat the cod with the lemon zest and a few turns of pepper and set aside. ", "Heat the olive oil in a large saucepan over a medium heat. Sweat the garlic, onion, fennel and carrot for 10 minutes or until soft. Add the curry powder and paprika and fry for a further minute. ", "Add the tomatoes, white wine, sugar, stock and 2 tablespoons of the dill. Bring to the boil, reduce the heat and simmer for 25 minutes. ", "While the soup is simmering, make the aioli by placing two egg yolks in a mini food processor. Add the lemon juice and blend together. Gradually add the oil, drop by drop while blending, for about 5 minutes or until it thickens. Add the garlic and season to taste. ", "When the soup has been cooking for 25 minutes, add the cod and simmer for 3 minutes. Season to taste. ", "Meanwhile, fry the prawns in the butter for 3 minutes, or until pink and cooked through. Once cooked, stir the prawns into the soup. ", "To serve, divide the soup between four bowls and garnish with the parsley, chives, dill and a dollop of the aïoli."]}, {"isVegetarian": false, "title": "Fish tacos", "url": "www_bbc_co_uk_food_recipes_fish_tacos_33979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_33979_16x9.jpg", "ingredients": ["1 small red onion, peeled, halved and sliced into half moons", "2 limes, juice only", "125g/4½oz mayonnaise", "2 tsp gochujang paste, or other hot sauce, to taste", "1 x 198g/7oz tin sweetcorn, drained", "1 fresh red chilli, finely diced (de-seed if you don’t like too much heat)", "3 tbsp chopped fresh coriander", "salt, to taste", "4 skinless fillets of firm white fish, such as hake or haddock (750–900g/1lb10oz-2lb total), from the thicker loin end", "1 tsp ground cumin", "½ tsp paprika", "1 tsp sea salt flakes", "1 garlic clove, peeled and finely grated or minced", "2 tbsp regular olive oil", "8 soft corn tortillas", "2 ripe avocados", "1 lime, juice only", "salad leaves of your choice", "1–2 tbsp chopped fresh coriander", "2 limes, cut into wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 for the fish, and begin by preparing the sides for your tacos. Put the red onion slices into a bowl and cover with the lime juice. Stir with a fork to mix the onion well in the juice. Actually, if you can get this done ahead of time (up to 1 day), so much the better, but even 20 minutes is fine.", "Make the hot sauce by mixing together the mayonnaise and the gochujang paste (or other hot sauce) in a small bowl. Set aside.", "For the corn relish, put the canned sweetcorn into a bowl. Add the chilli to the sweetcorn, along with the chopped coriander and some salt to taste. Give it all a good stir, and set aside.", "Cut the fish fillets in half lengthways, so you have long fingers, and arrange in a shallow roasting tin. Mix together the cumin, paprika and salt, and sprinkle over the fish fillets. Mix the garlic and the oil in a small bowl. Drizzle the fish with the garlicky oil, and roast in the oven for 8–10 minutes, depending on the thickness of your fillets. Check to see if the fish is cooked through (though only just) before taking out of the oven.", "Once you’ve taken the fish out (though don’t let it get cold) turn off the oven and warm the tortillas in the fading heat. Meanwhile, peel, stone and slice the avocados, then spritz with the juice of the lime, ready to serve with the other accompaniments.", "Arrange the fish on a plate (lined with salad leaves, if so desired), sprinkle with some chopped fresh coriander, and take to the table along with the warmed tortillas. If you don’t want to add any salad to the fish directly, you may want to put a bowl of shredded iceberg or some other crisp leaves nearby.", "Put the bowls of soused, but drained, red onions, the corn relish, hot sauce and a plate of sliced avocados on the table so that everyone can load their tortillas. A plate of lime wedges and a pile of napkins are both good ideas, too. "]}, {"isVegetarian": false, "title": "Fish tacos 'Ensenada' (Tacos de Pescado Ensenada)", "url": "www_bbc_co_uk_food_recipes_fish_tacos_ensenada_42309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_ensenada_42309_16x9.jpg", "ingredients": ["2 chipotles en adobo, finely chopped ", "3 tbsp mayonnaise ", "3 tbsp soured cream", "½ lime, juice only", "flaked sea salt and freshly ground black pepper", "2 large ripe tomatoes, deseeded and finely chopped", "½ onion, finely chopped", "handful fresh coriander, roughly chopped", "1 green serrano or jalapeno chilli, finely chopped", "1 lime, juice only", "1 litre/1¾ pints corn or vegetable oil", "300g/10½oz plain flour ", "½ tsp baking powder", "275ml/9½fl oz ice-cold lager", "600g/1lb 5oz cod fillet, preferable Icelandic, cut into chunks", "12 corn tortillas ", "½ small white cabbage, finely shredded", "1 avocado, diced", "hot chilli sauce"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chipotle crema, mix the ingredients together with a pinch of salt in a small bowl and set aside. ", "To make the salsa, mix all the ingredients together with ½ teaspoon of salt in a small bowl, and set aside.", "Heat the oil in a large heavy-based pan to 190C (CAUTION: hot oil can be dangerous. Do not leave unattended). ", "To make the batter, sift 200g/7oz of the flour, 1 teaspoon of salt and the baking powder into a large bowl. Whisk in the lager until smooth. Tip the remaining100g/3½oz flour into a small bowl and season well with salt and pepper. ", "In batches, coat the fish in the seasoned flour, shake off the excess, then dip into the batter. Fry each piece for 2–3 minutes, until crisp and golden-brown. Repeat until all the fish is cooked. Drain each batch on kitchen paper to remove any excess oil. Sprinkle lightly with salt. ", "Warm the tortillas in a dry frying pan, microwave or oven. ", "Serve the fish immediately in the warm tortillas, with the cabbage, avocado, salsa and sauces on the side. "]}, {"isVegetarian": false, "title": "Fish triple decker", "url": "www_bbc_co_uk_food_recipes_fish_triple_decker_52632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "1 x 200g/7oz haddock fillet, or similar white fish", "splash tomato ketchup", "4 black olives, pitted, chopped", "2 small chestnut mushrooms, chopped", "2 sprigs fresh curly-leaf parsley, leaves only, chopped", "1 rounded tbsp sweetcorn", "25g/1oz grated cheddar", "1 slice day-old bread, crusts removed, grated", "pinch freshly ground black pepper", "steamed green vegetables, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with baking parchment and brush the paper all over with vegetable oil. ", "Place the haddock fillet onto the baking tray, spread a little tomato ketchup all over the top of it, then sprinkle over the chopped olives, mushrooms, parsley and sweetcorn.", "In the bowl, mix together the cheddar and breadcrumbs, then season with freshly ground black pepper. Cover the fish with the breadcrumb mixture.", "Transfer the haddock to the oven and bake for 18-20 minutes, or until the fish is completely cooked through and the breadcrumbs are golden-brown. (The fish is cooked through when it is opaque throughout and flakes easily.) Serve with steamed green vegetables."]}, {"isVegetarian": false, "title": "Fish with lemon and brown butter sauce", "url": "www_bbc_co_uk_food_recipes_fish_with_lemon_and_80186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fillets of lemon sole (about 150g/5oz each), skin removed", "3 tbsp plain flour", "½ tsp salt", "2 pinches freshly ground black pepper", "1½ tbsp sunflower oil", "45g/1½oz butter, cut into cubes", "½ lemon, juice only", "1 tbsp chopped flatleaf parsley", "1 tbsp small capers (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Check the fish for small bones and use tweezers to pull out any that you find.", "Mix the flour with the salt and pepper and spread out over a large plate. Pat the fish fillets in the flour so they are evenly coated, and shake off any excess.", "Heat the oil in a large frying pan over a high heat. When the oil is smoking hot, place the fish fillets in the pan and lower the heat to medium. Cook for 1-2 minutes on one side until golden-brown, then turn the fillets over and cook for a further 1-2 minutes until the second side is golden-brown. (Flatfish fillets need only 1-2 minutes cooking on each side. If you’re cooking thicker slices or fillets from a fish like trout (2-3cm/1in thick), then 3-4 minutes on each side should be fine.) ", "When cooked remove the fish from the pan and wrap the fish in aluminium foil to keep warm.", "Wipe the pan with paper towels and return to a medium heat. Add the cubes of butter and heat until they melt and become light brown, then turn off the heat and add the lemon juice (stand back a little as it will splutter). ", "Add the parsley and capers (if using), and swirl the contents of the pan around. Return the fish to the pan, spoon over the juices and serve immediately."]}, {"isVegetarian": false, "title": "Fishcakes", "url": "www_bbc_co_uk_food_recipes_fishcakes_1915", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fishcakes_1915_16x9.jpg", "ingredients": ["450g/1lb potato, chopped into chunks", "450g/1lb mixed frozen fish such as cod, haddock, salmon, smoked haddock", "2 tbsp chopped fresh parsley", "1 free-range egg, beaten", "vegetable oil, for frying", "salt and freshly ground black pepper"], "serves": "Makes 8-12 cakes", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "For the mashed potato, bring a pot of salted water to the boil. Add the potatoes to the pot and cook until tender, this should tabke about 15 minutes. When cooked drain in a colander and leave to drain for a few minutes. Return to the pot and mash with a potato masher until a smooth consistency is achieved. Set aside. ", "Put the frozen fish on a roasting tin and cook in the oven for about 10-15 minutes until opaque and starting to flake. When cool enough to handle, remove the skin and any bones and flake the fish into large chunks.", "Mix the fish, mashed potato, parsley and egg together until well combined. (Mix together carefully so as not to break up the fish too much.) Season with salt and pepper. Shape the mixture into 8-12 patties, depending on how large you want them to be and set aside to chill in the fridge for one hour. ", "Heat vegetable oil in a frying pan and fry the fish cakes until golden brown on each side and heated right through. Serve with tartare sauce and a simple salad. "]}, {"isVegetarian": false, "title": "Fishcakes and creamy peas", "url": "www_bbc_co_uk_food_recipes_fishcakes_and_creamy_01930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz potatoes, chopped  ", "25g/1oz butter ", "salt and pepper ", "360g/12oz frozen white fish fillets (such as Coley or Pollock), defrosted, skin and bones removed ", "2 tbsp plain flour", "1 egg, beaten ", "150g/5½oz breadcrumbs (made from 4-5 slices of bread, broken into breadcrumbs and dried slightly) ", "1 tbsp olive oil ", "25g/1oz butter ", "1 onion, finely sliced", "300g/10½oz frozen peas ", "100g/3½oz cream cheese "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the fish cakes, cook the potatoes in a large saucepan of boiling water until tender. Drain and set aside to dry for a couple of minutes. ", "Mash with a potato masher until smooth then mix in the butter. Taste and add salt and pepper as necessary.  Set aside to cool.", "Meanwhile, half fill a frying pan with boiling water and place over a medium heat. Add the defrosted fish fillets and poach gently for 5-6 minutes, or until just cooked through. Drain, pat dry with kitchen paper and leave to cool for 10 minutes. ", "Break the fish into flakes and add to the mashed potato. Taste and add salt and pepper as necessary.", "Put the flour into a shallow bowl and season with a pinch of salt and pepper. Put the beaten egg in a separate shallow bowl and the breadcrumbs in another shallow bowl. Shape the potato and fish mixture into four large patties.", "Dust a fishcake in the flour, shaking off any excess, then dip into the egg, making sure all sides are coated and finally roll in the breadcrumbs, coating all the sides in crumbs. Set to one side while you repeat with the other fishcakes. At this point the fishcakes can be chilled for up to 24 hours until needed, but otherwise refrigerate for at least 20 minutes to allow them to firm up.", "Line a baking tray with baking paper and place the fishcakes on top. Drizzle with olive oil and bake for 15-20 minutes, turning after 10 minutes.", "While the fishcakes are cooking, make the creamy peas. Heat a sauté or frying pan over a medium-high heat. Add the butter and, once hot, add the onion along with a pinch of salt. Fry gently until the onions are tender and translucent. Add the peas and crush lightly with the back of a fork. Once the peas are heated through, stir in the cream cheese until melted. Taste and add salt and pepper as necessary. ", "Serve the hot fish cakes with the creamy peas alongside. "]}, {"isVegetarian": false, "title": "Fishcakes with lime and caper yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_fishcakeswithlimeand_81289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz hot-smoked trout", "100g/3½oz ready-made mashed potato", "pinch dried chilli flakes", "1 tbsp chopped fresh coriander", "1 free-range egg", "2 tbsp sesame seeds", "1 tsp chopped fresh coriander, to garnish", "2 tbsp capers, finely chopped", "75g/2¾oz Greek yoghurt", "1 tsp finely chopped fresh chives", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the fish cake, place the mashed potato, smoked trout, chilli flakes, coriander and egg into a large bowl and mix together well. Season the mixture well with salt and freshly ground black pepper and shape into a ball.", "Roll the fishcake in the sesame seeds until coated, then flatten to a patty shape.", "Heat the oil in a frying pan over a medium heat. Add the fishcake and fry for three minutes on each side, until golden and cooked through.", "To make the dressing, place the capers, yoghurt, chives and lime juice into a bowl. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the fishcake in the centre of a warm plate, spoon some of the dressing around the plate and sprinkle over the chopped coriander."]}, {"isVegetarian": false, "title": "Fishcakes with cheddar sauce", "url": "www_bbc_co_uk_food_recipes_fishcakeswithcheddar_93165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz hake steaks", "sea salt and freshly ground black pepper", "250ml/9fl oz milk, plus extra for the cheddar sauce", "1 bay leaf", "500g/17½oz cold mashed potatoes", "3 free-range eggs", "1 heaped tbsp chopped fresh curly parsley", "freshly ground white pepper", "4 tbsp plain flour", "1 x 200g/7oz packet golden breadcrumbs", "vegetable oil, for shallow frying", "50g/2oz unsalted butter", "2 tbsp plain flour", "175g/6oz cheddar cheese", "salt and freshly ground black pepper"], "serves": "Makes 4 large fishcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the hake into a large pan and season with sea salt and freshly ground black pepper. Pour over the milk and add the bay leaf, then cover the pan with aluminium foil and gently poach the fish over a medium low heat for 25 minutes, or until the fish is cooked through (the flesh should be opaque and flake easily). ", "Set the fish aside to cool, then flake the flesh into a bowl and discard the bones. Strain the poaching liquid into a measuring jug, discarding any solids. Add enough milk to the liquid to bring it up to 500ml/17½fl oz, then set aside for making the cheese sauce later.", "In a large bowl, carefully fold together the fish, mashed potatoes, one beaten egg and the parsley until well combined. Season, to taste, with salt and freshly ground white pepper. ", "With damp hands, divide the mixture into four equal portions and form into patties. Dust the fishcakes in the flour, dip into the remaining beaten egg and roll in the breadcrumbs. ", "Heat a few tablespoons of vegetable oil in a frying pan and fry the fish cakes for 2-3 minutes on both sides, or until golden-brown and crisp all over.", "For the cheddar cheese sauce, melt butter in a pan set over a medium heat, then beat in the flour. Cook the mixture for 2-3 minutes, then gradually whisk in the reserved milk mixture until smooth. Cook for 10-12 minutes, or until the sauce is thickened slightly, then stir in the grated cheddar cheese until melted. Season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the cheddar cheese sauce over the fishcakes."]}, {"isVegetarian": false, "title": "Fish finger butty", "url": "www_bbc_co_uk_food_recipes_fishfingerbutty_89301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz assorted cooked fish (salmon, whiting, pollack)", "salt and freshly ground black pepper", "100g/3½oz plain flour", "2 free-range eggs", "100g/3½oz polenta  ", "vegetable oil, for shallow frying", "200ml/7fl oz ready-made mayonnaise", "1 tbsp English mustard", "1 tbsp capers, rinsed and drained", "1 tbsp finely chopped gherkins", "4 burger buns", "handful rocket", "4 lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Break up the cooked fish with a fork in a bowl. Season with salt and freshly ground black pepper.", "Divide the fish mixture into 12 even portions, then mould into finger-shapes about 7.5cm/3in long and 2.5cm/1in thick.", "Dredge the fish fingers in the flour, then dip into the beaten egg.", "Dip the fish fingers into the polenta to coat completely.", "Heat the oil in a frying pan over a medium heat. Add the polenta-coated fish fingers and fry for 2-3 minutes, turning regularly, until golden-brown ll over and warmed through.", "For the tartare sauce, place all of the tartare sauce ingredients into a bowl and mix well. ", "To serve, place a spoonful of tartare sauce onto each bun, then add a little rocket.", "Top each with three fish fingers and a squeeze of lemon."]}, {"isVegetarian": false, "title": "Fish in a hot and sour sauce", "url": "www_bbc_co_uk_food_recipes_fishinahotandsoursau_74007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh white fish fillets such as sole or plaice", "cornflour, for dusting", "150ml/5fl oz groundnut oil", "150ml/5 fl oz chicken stock", "2 tbsp Shaoxing rice wine or dry sherry", "1½ tbsp dark soy sauce", "2 tbsp chilli bean sauce (available from Asian grocers)", "½ tsp freshly ground white pepper", "2 tbsp Chinese black rice vinegar or cider vinegar", "2 tsp sugar", "3 tbsp finely chopped spring onions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the skin from the fish. Cut the fillet across the width and at a slight diagonal into 2.5cm (1in) wide strips. Dust the pieces with cornflour, shaking off any excess.", "Heat a wok until it is very hot. Add the oil and fry the fish strips gently for 2-3 minutes until golden brown. ", "Drain the cooked fish strips on kitchen paper.", "Pour off all the oil. Wipe the wok and reheat. Add all the hot and sour sauce ingredients, bring to a boil then simmer. ", "Add the fish strips and simmer in the sauce for two minutes. ", "Serve on a warm platter garnished with spring onions."]}, {"isVegetarian": false, "title": "Fish chowder with 'piri-piri' sauce and fennel salad", "url": "www_bbc_co_uk_food_recipes_fishchowderwithpirip_92209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 tbsp olive oil ", "2 onions, peeled, finely chopped ", "pinch sea salt", "3 garlic cloves, peeled, finely chopped", "100g/3½oz cooking chorizo, skin removed, roughly chopped", "1 medium red chilli, finely sliced ", "reserved fennel stem, finely chopped (see below)", "1 red pepper, seeds removed, sliced", "salt and freshly ground black pepper", "2 large floury potatoes, such as Maris Piper or King Edward, peeled, chopped ", "pinch saffron threads, infused in 1 glass dry white wine", "500ml/17fl oz fish stock or vegetable stock", "1 x 400g/14oz can chopped tomatoes", "8-12 fresh prawns, heads and shells removed, de-veined ", "450g/1 lb cod fillet, skin removed, chopped", "8-12 mussels, rinsed, cleaned, de-bearded (discard any mussels that do not close tightly when tapped)", "1 fennel bulb, finely sliced, stem reserved for chowder, green fronds reserved for the piri-piri sauce ", "1 red chilli, finely chopped", "bunch fresh flatleaf parsley, leaves only ", "½ lemon, juice only ", "reserved green fennel fronds, finely chopped (see above)", "6 small fresh red chillies, finely chopped", "3 ripe tomatoes, skins removed, chopped", "1 tsp salt flakes", "1 tbsp finely chopped garlic, plus 1 garlic clove, peeled and cut in half", "4-6 tbsp olive oil", "2 tbsp red wine vinegar", "4-6 thick slices crusty white bread", "4-6 tbsp olive oil", "large pinch salt", "4-6 wild sea bass fillets (about 500g/1 lb in total), skin scored several times using a sharp knife", "3-4 tbsp olive oil", "salt, to taste", "½ lemon"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish chowder, heat the olive oil in a large, lidded saucepan over a medium heat. Add the onions, salt and garlic and fry for 2-3 minutes, or until softened. ", "Add the chorizo and chilli and continue to fry for 3-4 minutes, or until the chorizo is crisp and has darkened in colour.", "Add the chopped fennel stem and red pepper and season, to taste, with sea salt and freshly ground black pepper. Continue to fry for 2-3 minutes.", "Add the chopped potatoes and fry for 3-4 minutes, or until coloured. ", "Add the wine and saffron mixture to the pan, scraping any browned bits up from the bottom of the pan to deglaze. ", "Add the stock and all of the canned tomatoes and bring the mixture to a simmer. Continue to simmer for 15-20 minutes, or until the potatoes are tender and the volume of liquid has reduced by half.", "Add the prawns, cod and mussels, cover the pan with a lid and bring the mixture back to a simmer. Steam for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).", "Meanwhile, for the fennel salad, in a glass or ceramic bowl, mix together the sliced fennel, chopped red chilli and parsley leaves until well combined. Squeeze over the lemon juice and mix well to coat the vegetables. Set aside.", "Meanwhile, for the 'piri-piri' sauce, in a bowl, mix together the fennel fronds, chillies, tomatoes and garlic. Season, to taste, with salt. Drizzle over the olive oil and red wine vinegar and stir to combine.", "For the bread, rub the bread slices all over with the halves of garlic. Drizzle both sides of each slice with a dash of olive oil. ", "Heat a griddle pan over a medium heat. When the pan is hot, add the bread slices, in batches, and grill for 1-2 minutes on each side, or until golden-brown griddle marks appear on both sides. Repeat the process with the remaining batches of bread slices. Keep warm.", "For the sea bass, drizzle the sea bass fillets with olive oil and sprinkle the salt over the skin. ", "Heat a griddle pan over a high heat. When the pan is hot, add the sea bass fillets, skin-side down and griddle for 2-3 minutes, or until the skin is crisp.", "Turn the fish fillets over and fry for a further minute, or until the sea bass is cooked through. Drizzle over the lemon juice.", "To serve, spoon the fish chowder equally among four to six serving bowls. Place one of the sea bass fillets on top of each serving. Sprinkle over the chopped parsley. Serve the bread alongside, with the 'piri-piri' sauce spooned over it."]}, {"isVegetarian": false, "title": "Fish fingers with chive yoghurt dip", "url": "www_bbc_co_uk_food_recipes_fishfingerswithchive_79025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "1 lemon sole fillet, cut into strips", "110g/4oz plain flour", "1 free-range egg", "salt and freshly ground black pepper", "splash of carbonated water ", "110g/4oz Greek yoghurt", "2 tbsp fresh chives, chopped", "squeeze of lime juice", "½ lime, cut into wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a heavy bottomed saucepan, a third full of vegetable oil, until a breadcrumb sizzles in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.)", "Place the flour in a large bowl and beat in the egg and salt and freshly ground black pepper, to taste. ", "Add the carbonated water and whisk to create a batter the consistency of double cream.", "Dredge the sole pieces in flour then dip pieces into the batter to coat.", "Place in the hot oil and deep-fry for 2-3 minutes, until crisp and golden. Carefully remove using a slotted spoon and drain on kitchen towels. ", "To make the dip, mix the yoghurt with the chives and lime juice. Transfer to a serving bowl.", "Serve the fish fingers on a plate with the dip and lime wedges alongside."]}, {"isVegetarian": false, "title": "Fish mousse", "url": "www_bbc_co_uk_food_recipes_fishmousse_75672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["chunk of bread", "1 plaice fillet", "handful dill", "100ml/3½fl oz double cream", "1 free-range egg", "1 orange, juice only", "100ml/3½fl oz cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 220C/425F/Gas 7.", "Blend the bread, cream, plaice, dill and egg in a food processor.", "Pour into a lined and greased round ramekin dish and place in a bain-marie.", "Bake in the oven for 8-10 minutes.", "For the cream, place the cream and juice in a saucepan. Bring to the boil and reduce for 1-2 minutes.", "Turn out onto a plate and drizzle with orange cream."]}, {"isVegetarian": false, "title": "Fish pie with sweet potato topping", "url": "www_bbc_co_uk_food_recipes_fishpiewithcrunchysw_89434", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, chopped", "2 garlic cloves, chopped", "splash water", "100ml/3½fl oz hot fish stock", "100g/3½oz haddock, skin removed, chopped", "75ml/2½fl oz double cream", "4 tbsp chopped fresh chervil", "salt and freshly ground black pepper ", "½ sweet potato, peeled, sliced very thinly on a mandoline"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the olive oil in a pan, add the onion and garlic and fry for 3-4 minutes until softened.", "Add the water and hot fish stock and boil for three minutes. ", "Add the chopped haddock and cook for three minutes. ", "Add the cream and three tablespoons of the chervil and season, to taste, with salt and freshly ground black pepper. Simmer for 1-2 minutes, then pour the mixture into a gratin dish.", "Place the sweet potato slices on top of the fish sauce mixture, drizzle with the remaining olive oil, and season, to taste, with salt and freshly ground black pepper. Place under a medium grill for 4-5 minutes, or until the top is crisp and golden-brown.", "Serve the fish pie at the table in the gratin dish, and garnish with the remaining chopped chervil."]}, {"isVegetarian": false, "title": "Fish kebabs with cucumber raita", "url": "www_bbc_co_uk_food_recipes_fishkebabswithcucumb_74039", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz cod fillet, skinned and diced", "300g/10½oz salmon fillet, skinned and finely chopped", "1 lime, juice and grated zest only", "1 small fennel bulb, finely chopped", "1 small bunch of fresh coriander, finely chopped", "4-8 green chillies, finely chopped", "4 spring onions, finely chopped", "2 tbsp fennel seeds, finely ground", "2 tbsp coriander seeds, finely ground", "½ tsp salt", "2 tbsp vegetable oil", "1 tbsp garlic paste", "1 tbsp ginger paste", "4 tsp crushed black pepper", "1 cucumber, grated", "450ml/16fl oz yoghurt", "4 tbsp finely chopped dill", "½ tsp crushed garlic", "1 tbsp vegetable oil", "½ tsp mustard seeds", "½ tsp cumin seeds", "pinch of asafoetida", "4-5 curry leaves", "basmati rice, boiled, enough for 4"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a food processor, blend the cod until finely minced.", "In a large mixing bowl mix together the minced cod, chopped salmon and lime zest.", "Add the chopped fennel, chopped coriander, green chillies, spring onions, fennel seeds, coriander seeds, salt, two tablespoons of oil, garlic paste, ginger paste, two teaspoons of crushed black pepper and lime juice and mix well.", "Mould the fish mixture onto 12 skewers, forming 12 fish kebabs.", "To make the cucumber raita, squeeze out any excess water from the grated cucumber.", "Mix together the cucumber and yoghurt, and stir in the dill, the remaining black pepper and the garlic.", "Heat one tablespoons of oil in a small frying pan and fry the mustard seeds, cumin seeds, asafoetida and curry leaves for 2-3 minutes, stirring, until fragrant.", "Mix the fried mustard seed mixture into the raita.", "Either grill the kebabs on a barbecue until golden brown on both sides or heat one tablespoon of oil in a large frying pan and fry the kebabs until golden brown on both sides.", "Serve the freshly cooked kebabs with cucumber raita and basmati rice."]}, {"isVegetarian": false, "title": "Fish pie with cheese pastry crust", "url": "www_bbc_co_uk_food_recipes_fishpiewithcheesepas_11071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shallot, peeled and chopped", "olive oil", "110ml/4fl oz fish stock", "110ml/4fl oz double cream", "salt and freshly ground black pepper", "300g/10½oz ready-to-roll puff pastry ", "700g/1½lb fish, cut into chunks (salmon, cod, haddock or mixture)", "110g/4oz mushrooms, sliced ", "3 tbsp chives, chopped", "4 slices Emmenthal cheese", "2 tbsp grain mustard", "1 egg, beaten"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sauté the shallot in a little olive oil. After a few minutes add the fish stock and cream and bring to the boil. Season and leave to one side.", "Roll out the pastry to twice the size of the ovenproof dish.", "Place the fish, mushrooms and chives in the dish. Season and cover with the sauce. ", "Spread half of the pastry with the mustard and cheese. Fold the other half over the top, sandwiching the mustard and cheese in the middle.  ", "Top the pie with the pastry, crimp the edges and then egg wash.", "Bake for 25-30 minutes."]}, {"isVegetarian": false, "title": "Fish stock", "url": "www_bbc_co_uk_food_recipes_fishstock_1296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb fish bones and skin", "1 carrot, peeled and roughly chopped", "1 onion, peeled and quartered", "1 stalk celery, roughly chopped", "½ bulb fennel, roughly chopped", "6 black peppercorns", "1 dried bay leaf", "3 fresh parsley stalks"], "serves": "Makes 1-2 pints", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a large pan and cover with water. Bring to the boil and skim off any scum that has formed. Cover and simmer very gently for 20-30 minutes. Strain into a large bowl and allow to cool. ", "Use within 3 days or freeze. To freeze, reduce the stock by half by boiling vigorously and cool. Pour into ice-cube trays and freeze. When frozen put the cubes into a bag, label it, and when you want to use one, just put in a jug and add boiling water to dissolve the cube."]}, {"isVegetarian": false, "title": "Fish stock", "url": "www_bbc_co_uk_food_recipes_fishstock_90209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz fish trimmings (you can include heads and bones and skin of most types of fish, but try to avoid salmon, red mullet and oily fish)", "3 leeks", "1 bulb fennel", "3 carrots", "large handful fresh parsley", "175ml/6fl oz dry white wine"], "serves": "Makes about 1 litre/2 pints", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Rinse the fish bones and trimmings of any blood, which would make the stock look cloudy and taste bitter. Chop the leeks roughly and place into a large heavy-bottomed stockpot.", "Chop the fennel and carrots roughly and add to the stockpot.", "Roughly chop the parsley, including the stems, and add to the stockpot.", "Add the fish trimmings to the stockpot.", "Pour in the white wine, then add enough cold water to cover the fish and vegetables (about 1 litre/2 pints).", "Place the stockpot onto a high heat and bring the liquid to a simmer. After five minutes, remove the scum that forms on the surface with a spoon and discard. Reduce the heat and simmer, covered, for about 25 minutes, skimming as necessary.", "At the end of cooking time, remove the stock from the heat and strain, discarding the fish trimmings and the vegetables.", "Cool and store in the fridge for up to three days or freeze. Alternatively you can reduce the stock further and then freeze it in ice cube trays (freezing it this way means you can defrost as little or as much as you need at a time)."]}, {"isVegetarian": false, "title": "Fish tacos with guacamole", "url": "www_bbc_co_uk_food_recipes_fishtacoswithguacamo_90762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red onion, finely chopped", "5 tomatoes, skins and seeds removed, finely chopped ", "3-4 chillies, seeds removed and finely chopped", "1 tsp sugar", "1 lime, juice only", "4 tbsp chopped fresh coriander", "pinch salt", "1 large avocado, peeled, halved, stone removed", "1 green chilli, seeds removed", "1 lime, juice only", "2 spring onions, chopped", "1 tbsp chopped fresh coriander", "3 tbsp vegetable oil", "½ tsp salt", "2 x 325g/12oz sea bass, filleted", "salt and freshly ground black pepper  ", "225g/8oz plain flour", "2 free-range eggs", "200ml/7fl oz water", "sunflower oil, for deep-frying", "8 soft flour tortillas, warmed in an oven or microwave", "225g/8oz iceberg lettuce, finely shredded", "300ml/10 oz soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa, place all of the salsa ingredients together into a bowl and mix well to combine. Set aside. ", "For the guacamole, place all of the guacamole ingredients together into a food processor and blend until smooth.", "For the tacos, slice the fish fillets into strips 1cm/½in wide and season with salt and freshly ground black pepper. (You can use the rest of the fish for making fish stock, or for another recipe.) ", "Place the flour, eggs, water and a pinch of salt into a food processor and blend until smooth.", "Heat a deep-fat fryer to 190C/375F. Alternatively, half-fill a deep, thick-based pan with the sunflower oil and heat until a cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Dip the strips of fish into the batter, then fry in batches in the oil for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. ", "To serve, lay the tortilla wraps down flat on a plate or flat surface and place some lettuce leaves down the centre of each wrap. Arrange the fried fish over the lettuce, then spoon over some salsa and soured cream. Fold in the sides, roll up as tightly as you can and serve each taco with a dollop of guacamole."]}, {"isVegetarian": false, "title": "Fish tagine", "url": "www_bbc_co_uk_food_recipes_fishtagine_72361", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz monkfish", "1½ tbsp ground ginger", "2 tsp freshly ground black pepper", "2 tsp powdered cinnamon", "3 tsp ground turmeric", "1½ tbsp paprika", "1 tsp cayenne pepper", "1 head garlic, all but 3 cloves crushed with a little salt", "450g/1lb onions, grated", "2 tbsp olive oil", "175g/6¼oz dried apricots, soaked in a little water (reserve the water), cut in half", "85g/3oz flaked almonds", "55g/2oz sultanas or raisins", "2 tbsp clear honey", "1 tsp saffron stamens, soaked in cold water", "400g/14oz tinned tomatoes, roughly chopped", "600ml/1 pint tomato juice", "600ml/1 pint fish stock", "1 pickled lemon, rind only, chopped", "25g/1oz coriander leaves, chopped"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Coat the fish in half the ground spices and leave to marinate in the fridge overnight. ", "Preheat the oven to 170C/340F/Gas 3. Heat one tablespoon of the olive oil in a casserole and add the remaining spices, the crushed garlic and grated onion.  Allow the onion to soften without browning.", "Add the apricots and their soaking water, the almonds, sultanas or raisins, honey, saffron, tomatoes, tomato juice and fish stock.  Bring to the boil, place in the oven and cook for one hour.", "After 40 minutes, add the fish and return the casserole to the oven to finish cooking.  If you want a thicker sauce, remove the fish pieces, put on a warm plate and reduce the sauce over a high heat until thickened.", "Fry the preserved lemon rind in the remaining olive oil for a few minutes, then fold in the chopped coriander.", "Pour the sauce over the fish and garnish with the lemon and coriander mixture."]}, {"isVegetarian": false, "title": "Five-hour roast pork belly", "url": "www_bbc_co_uk_food_recipes_five-hour_roast_pork_03985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3.5-4kg/8-9lb piece of pork belly, bone in, skin on", "2 tbsp salt", "8 garlic cloves, smashed ", "4 tbsp smoked paprika", "4 tbsp vegetable oil", "2 lemons, halved lengthways then thickly sliced", "4 large potatoes, peeled and halved", "4 tsp vegetable oil ", "6 parsnips peeled, trimmed and split down the middle ", "500g/1lb 2oz parsnips, peeled and cut into 5cm/2in pieces", "100g/3½oz potatoes, diced", "1 garlic clove, peeled and left whole", "200ml/7fl oz milk ", "50ml/2fl oz olive oil ", "½ lemon, juice only ", "50ml/2fl oz double cream ", "10g/¼oz butter", "salt and pepper", "2 large handfuls flatleaf parsley, leaves picked", "1 large handful basil leaves", "2 garlic cloves, peeled ", "1 boiled egg ", "1 handful fresh white breadcrumbs", "1 tbsp white wine vinegar", "1 tbsp capers", "50ml/2fl oz olive oil", "pinch salt"], "serves": "Serves 10-12 very hungry people, with leftovers", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork, using a very sharp knife (or a utility knife), score the skin of the pork really deeply in a criss-cross pattern with about a 1cm/½in gap between each cut. Boil your kettle, put the pork in a clean sink, skin-side up, and pour the boiling water over the skin of the pork – this scalds it and it will make sure the skin is crispy once it is roasted.", "In a large bowl, mix the salt, garlic, paprika, vegetable oil and lemon pieces. Now, rub the mixture into the pork skin and flesh, leaving the lemon pieces sitting on top of the skin. Put the pork on a tray and leave it to marinate in the fridge for 12-24 hours.", "Preheat the oven to 160C/140C Fan/Gas 3. Put the potatoes in a large roasting tin (the potatoes will act as a trivet). Lay the pork, skin-side up, on top of the potatoes and pour over any marinade left in the tray. Pour a mug of water into the bottom of the tray underneath the pork. Cover the pork with baking paper, then with foil and tuck the foil around the outside of the tin to seal. Roast for 4 hours.", "Take the pork out of the oven and increase the oven temperature to 200C/180C Fan/Gas 6. Carefully remove the foil – the tin will be steaming. Put the pork back in the oven and roast for a further hour.", "For the roast parsnips, heat the oil in a roasting tray until hot.  Put the parsnips in a bowl and pour over boiling water to scald them. Drain the parsnips and pat dry, place in the hot oil and carefully toss so they are all covered. Roast for 45 minutes. Season with a little salt before serving.", "Take the pork out of the oven and leave it to sit somewhere warm to rest for 30 minutes. While the pork is resting, make the mash and the salsa verde.", "For the parsnip mash, put the parsnips, potatoes, garlic cloves in a saucepan and half cover with water. Add the milk and olive oil and season with salt and pepper. Cover with a lid and cook until completely overcooked, stirring constantly. ", "Drain well, transfer to a clean pan and keep warm, reserving the cooking liquid. Warm the cream and the butter. Put the cooked vegetables in a food processor with some of the cooking liquor and blend until smooth, add the cream and butter and blend more. If the mixture is too thick add a little more of the cooking liquid.", "For the salsa verde, put the parsley, basil and garlic into a food processor and pulse until chunky. Add the remaining ingredients and pulse for 30 seconds or until the mixture has a roughly chopped texture – it should not be a paste.", "When the pork has rested, lift it out of the tin and lay it skin-side down on a carving board. Score the underside of the pork so that you can see the ends of the bones. Pop them out using your thumb, then take the bones out by simply pulling at the sticking out ends – they should pull away from the flesh easily. Cut the pork in half lengthways, then cut each half into 5 or 6 slices. Flip each one over – it should be a lovely glistening slice of roasted deliciousness. The whole board goes to the table. Bowls of mash, bowls of salsa verde – go for it! Serve with the spuds that were cooked under the pork and the roast parsnips."]}, {"isVegetarian": false, "title": "Five-spice baked ribs", "url": "www_bbc_co_uk_food_recipes_five-spice_baked_ribs_40323", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 star anise", "1 tsp fennel seeds", "few whole Sichuan peppercorns", "1 tbsp five-spice powder", "salt", "1kg/2lb 4oz pork spare ribs ", "½ bunch spring onions, trimmed, chopped", "salt and freshly ground black pepper", "2 tbsp olive oil", "few squidges honey", "1-2 garlic cloves, peeled, finely chopped", "150ml/5fl oz soy sauce", "1 lime, zest only", "3 tbsp sesame seeds (optional)", "1-2 red chillies, deseeded, finely sliced"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a large baking tray or roasting tin with aluminium foil.", "For the rub, crush the star anise, fennel seeds and Sichuan peppercorns in a pestle and mortar. Then add the five-spice powder and some salt and mix together to combine.", "Put the ribs into a bowl, sprinkle over the rub mixture and rub everything in. Tip the ribs onto the baking tray and spread them out in a single layer. ", "Cook in the oven for 45 minutes.", "Meanwhile, mix all the ingredients for the honey glaze in a small pan. Warm over a low heat until the honey is melted and all the ingredients are well combined.", "Remove the ribs from the oven, brush generously with the honey glaze, then sprinkle with the spring onions and season well with salt and freshly ground black pepper. (Set the rest of the honey glaze aside for later.)", "Return the ribs to the oven and cook for a further 15 minutes.", "Once the ribs are cooked, remove them from the oven and tip them onto a large plate. Reheat the remaining honey glaze and serve as a dipping sauce with the ribs and a large green salad."]}, {"isVegetarian": false, "title": "Five-spice belly pork with mango, pickled ginger and glass noodle salad", "url": "www_bbc_co_uk_food_recipes_five-spice_belly_pork_65372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz pork belly, skin on", "1½ tsp salt", "1 tsp Chinese five-spice", "2 tbsp roughly chopped ginger", "5 garlic cloves, roughly chopped ", "3 spring onions, roughly chopped", "splash soy sauce (if needed)", "4 tbsp chicken stock", "4 tbsp soy sauce", "4 tsp palm sugar", "4 tsp plum sauce", "4 tsp balsamic vinegar", "1 large head Little Gem lettuce, sliced", "½ mango, chopped", "4 tbsp pickled ginger", "2 tbsp salted peanuts", "1-2 red chillies, finely sliced (to taste)", "2 spring onions, finely sliced", "1 tsp roasted sesame seeds", "2 tbsp finely chopped red onion", "4 tbsp chopped coriander leaf", "large handful cooked glass noodles"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork, score the skin with a sharp knife in ½cm/¼in lines. Season generously on both sides with salt, rubbing the salt well into the scored skin.", "Turn the belly skin-side down and season the flesh side with one teaspoon of Chinese five-spice.", "Put the ginger, garlic and spring onions into a casserole dish or roasting tin and lay the pork belly on top. ", "Bake for one hour, then lower the temperature to 170C/325F/Gas 4 and cook for another hour.", "If the pork belly catches in the pan, add a tablespoon of water and tablespoon of soy sauce.", "For the dressing, whisk together all the dressing ingredients.", "For the salad, combine all the salad ingredients in a bowl and toss to combine.", "To serve, place the salad on four plates. Slice the pork and it serve on top of the salad. Drizzle over a little dressing (1-2 tablespoons per serving) to finish."]}, {"isVegetarian": false, "title": "Five-spice braised beef", "url": "www_bbc_co_uk_food_recipes_five-spice_braised_beef_86835", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/five-spice_braised_beef_86835_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "2 large red onions, thinly sliced", "50g/1¾oz piece fresh root ginger, peeled, finely grated", "4 garlic cloves, crushed", "1 tsp dried chilli flakes", "500g/1lb 2oz  braising steak, trimmed, cut into 5cm/2in cubes ", "2 tsp Chinese five-spice powder", "350ml/12fl oz hot beef stock (made with 1 stock cube) ", "4 tbsp dark soy sauce", "4 tsp cornflour", "2 tbsp clear honey", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, heavy-based frying pan over a medium heat. Add the onions and fry for 8-10 minutes, stirring regularly, until softened and lightly browned. Add the ginger, garlic and chilli flakes, stir well and cook for 2-3 minutes, making sure the garlic doesn't burn.", "Season the beef all over with pepper, then sprinkle over the five-spice powder and mix to coat evenly. Add to the pan and fry for 3-4 minutes, turning the beef regularly until lightly browned all over. ", "Transfer to the slow-cooker. Pour over the stock and stir in the soy sauce. Cover and cook on high for 4 hours, until the beef is meltingly tender. ", "When the beef is cooked, whisk the cornflour with 1 tablespoon water to a smooth paste, stir in the honey. Add to the slow-cooker, cover and cook for 12-15 minutes, or until the sauce is glossy and has thickened slightly. ", "Serve the beef with steamed rice or boiled noodles and stir-fried vegetables."]}, {"isVegetarian": false, "title": "Five-spice chicken with ginger and garlic", "url": "www_bbc_co_uk_food_recipes_five-spice_chicken_with_00850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heads of garlic, cloves peeled", "100g/3½oz ginger, peeled", "3 tsp rapeseed oil", "3 tsp five-spice mixture (panch phoran: fenugreek seed, nigella seed, cumin seed, black mustard seed and fennel seed)", "1 tsp ground turmeric", "2 tsp red kashmiri chilli paste ", "1 tsp tomato purée", "salt, to taste", "500g/1lb 2oz boneless chicken, cut into pieces", "plain boiled rice or chapati, to serve"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Make a paste from the garlic and ginger in a food blender.", "Heat the oil in a non-stick pan and add the spice mix.", "Add the ginger and garlic paste to the pan. Cook on a high heat for 5-6 minutes, or until it turns light brown. Add the ground turmeric, red Kashmiri chilli paste, tomato purée and salt, to taste.", "Add the boneless chicken and mix well. Cook for 10-15 minutes on a medium heat, or until the chicken is cooked through, stirring occasionally.", "Serve with plain boiled rice or chapatti."]}, {"isVegetarian": false, "title": "Five-spice roasted quail with sweet-and-sour cranberry sauce", "url": "www_bbc_co_uk_food_recipes_five-spice_oven-roasted_18972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz waxy potatoes such as Vivaldi, skin left on, chopped into 2.5cm/1in cubes", "pinch salt", "1-2 tbsp peanut oil", "1-2 tbsp freshly grated root ginger", "1 tsp fermented salted black beans (available from Chinese supermarkets), rinsed, crushed", "¼ tsp dry-roasted chilli flakes", "120g/4½oz oak-smoked bacon lardons", "1 tbsp dark soy sauce", "2-3 tbsp rapeseed oil or goose fat (optional)", "300g/10½oz fresh cranberries", "100g/3½oz soft brown sugar", "2-3 tbsp water", "1 lemon, juice only", "1 small orange, juice only", "2 star anise", "1 tsp dry-roasted chilli flakes", "2 tsp Chinese five-spice powder", "1 tsp dried chilli flakes", "8 pinches salt", "½ tsp ground white pepper", "4 quails (about 560g/1lb 4oz in total), cleaned (ask the butcher to do this for you)", "2.5cm/1in piece fresh root ginger, peeled, cut into 8 slices", "1 small orange, peel only, peel removed in one go, then chopped into 8 equal-sized lengths", "4 spring onions, trimmed, cut into 8 slices", "2 tbsp rapeseed oil", "4 baby shallots, peeled, sliced", "1 tbsp shaoxing rice wine", "salt and freshly ground black pepper", "700ml/1¼ pints chicken stock", "4-5 tbsp plain flour", "1 tbsp dark soy sauce", "300g/10½oz baby heritage carrots (less than 10cm/4in in length), tops removed", "1 tbsp rapeseed oil", "320g/11¼oz cavolo nero, washed, sliced", "2 generous pinches sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the potatoes, place the potato cubes and salt into a lidded saucepan of cold water. Bring to the boil, then reduce the heat until the water is simmering. Cover the pan with a lid and simmer for 15-20 minutes, or until tender. Drain well and set aside.", "For the cranberry sauce, heat all of the cranberry sauce ingredients in a lidded saucepan over a medium heat for 10-15 minutes, stirring well until the cranberries have softened. Cover the pan with the lid and keep warm over a very low heat.", "For the spice rub, mix together all of the spice rub ingredients until well combined.", "For the spiced quail, preheat the oven to 180C/160C Fan/Gas 4. Wash the quails under a cold running tap, then pat dry with kitchen paper.", "Season the cavity of each quail with salt and freshly ground black pepper, then stuff each with two pieces of ginger, two pieces of orange peel and two pieces of the spring onion. Sew up the cavities using a small metal pin or small bamboo skewer. This will help keep the quail moist and impart flavour to the meat.", "Brush the quails all over with the rapeseed oil, then roll them in the spice rub until completely covered. Tie the hind legs of each quail using butchers' string.", "Line the base of a roasting tray with the sliced baby shallots and the remaining slices of spring onion. Place the quails on top of the vegetable layer and drizzle over the rice wine to season. Roast in the oven for 20-25 minutes, or until the skin is crisp and golden-brown and the meat is cooked through. (The quails are cooked through if the juices run clear when a skewer is inserted into the thickest part of the thigh and no trace of pink remains.) Check the quails after 15 minutes to make sure the legs are not browning too quickly; cover the legs with aluminium foil if so.", "Meanwhile, carry on with the potatoes. Heat the peanut oil in a wok over a high heat. Add the ginger, black beans, dried chilli flakes and bacon and stir-fry for 30 seconds, or until just browning. Add the drained potato cubes and continue to stir-fry for 2-3 minutes. Add the soy sauce and stir again.", "Transfer the potato mixture to a roasting tray, drizzle over a splash of rapeseed oil (or the goose fat), then roast in the oven for 20-25 minutes, or until the potatoes are crisp and golden-brown.", "When the quails are cooked, transfer them to a wooden board, remove the butchers' string and any foil, and set aside to rest for 5 minutes. Reserve the juices in the roasting tray.", "For the gravy, place the roasting tray with the reserved quail juices over a medium heat on the stove-top. Add the chicken stock and bring to the boil, scraping up any burned bits from the bottom of the tray using a wooden spoon. Whisk in the flour until the mixture is smooth, then continue to boil until it thickens to a gravy. Stir in the soy sauce, then keep warm over a low heat.", "For the carrots, blanch the carrots in a pan of boiling water for 2-3 minutes, then drain well and set aside.", "For the cavolo nero, heat the rapeseed oil in a wok over a high heat. Add the cavolo nero and stir-fry for 1 minute.", "Add a splash of cold water to the wok, then continue to stir-fry until the water has evaporated and the cavolo nero has wilted.", "Add the carrots, season with the sea salt flakes, then stir-fry for a further 1-2 minutes. Remove from the heat and set aside.", "To serve, put the cavolo nero and carrots onto one side of each of four serving plates and potatoes on the other side. Put one quail on top of each portion and put a dollop of the cranberry sauce on the side of each plate. Serve the gravy in a jug alongside."]}, {"isVegetarian": false, "title": "Five-spice whole roast duck with pancakes, cucumber, spring onion and plum sauce", "url": "www_bbc_co_uk_food_recipes_five-spice_whole_roast_95220", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2kg/4lb 8oz duck, back bone removed, flattened", "salt and freshly ground black pepper", "4 tbsp Chinese five-spice powder", "1 tbsp olive oil", "3 spring onions, sliced", "1 cinnamon stick", "½ tsp Sichuan peppercorns, crushed", "500g/1lb 2oz plums, stones removed, roughly chopped", "125ml/4fl oz rice wine vinegar", "75g/2½oz caster sugar", "salt and freshly ground black pepper", "225g/8oz strong white flour", "175ml/6fl oz boiling water", "4 spring onions, finely shredded", "1 cucumber, cut into batons"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the five-spice duck, preheat the oven to 210C/410F/Gas 6.", "Place the duck, skin-side up, on a rack over a roasting tray and pierce the skin all over with a knife.", "Boil a kettle and pour the just boiled water over the duck skin. Discarding the water and pat the duck dry using kitchen paper. Rub salt, freshly ground black pepper and five-spice all over the skin. ", "Roast for 1-1¼ hours, or until crisp and golden-brown. Remove from the oven and set aside to rest for 10 minutes. Shred the duck into fine pieces using two forks.", "Meanwhile, for the plum sauce, heat the olive oil in lidded pan and fry the spring onions for 1-2 minutes, or until softened. Add the spices and continue to cook for another 1-2 minutes. ", "Add the plums, vinegar and sugar and bring the mixture to the boil. Reduce the heat until the mixture is simmering, cover with a lid and simmer for 5-6 minutes, or until the plums are tender. Set aside to cool.", "Remove the cinnamon stick and blend the mixture to a purée in a food processor. Strain the purée through a sieve into a bowl. Season, to taste, with salt and freshly ground black pepper.", "For the pancakes, place the flour in a bowl and make a well in the centre. Pour in the boiling water and stir to form a dough. Tip the dough out onto a floured work surface and knead for 2-3 minutes, or until the dough is smooth.", "Cut the dough into 16 pieces and roll each piece into a thin pancake.", "Heat a frying pan until hot and fry each pancake for 1-2 minutes on each side, or until pale golden-brown. Keep the pancakes warm until ready to serve.", "To serve, place the shredded duck on a large serving plate and place the spring onion and cucumber alongside. Place the pancakes on a separate serving plate and serve with the plum sauce."]}, {"isVegetarian": false, "title": "Five spice belly pork with Asian greens", "url": "www_bbc_co_uk_food_recipes_five_spice_belly_pork_81415", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz boneless pork belly, with rind", "4 tbsp coarse sea salt", "2 tsp freshly ground white pepper", "2 tbsp Chinese five-spice powder", "1 tbsp caster sugar", "2 tbsp sunflower oil", "2 pak choi, cut into quarters", "500g/1lb 2oz mixed Asian greens", "2cm/1in piece fresh ginger, peeled and cut into thin strips", "4 spring onions, sliced", "5cm/2in piece fresh root ginger, cut into thin strips", "2 garlic cloves, thinly sliced", "2 long red chillies, thinly sliced", "3 tbsp chopped fresh coriander leaves", "3 tbsp chopped fresh mint", "3 tbsp palm sugar", "2 tbsp soy sauce", "2 tsp fish sauce", "1 lime, juice only", "4 spring onions, sliced", "1 red chilli, sliced"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To prepare the pork, pierce the rind side of pork with a sharp fork or knife until the skin is covered with fine holes. ", "Bring a large pan of water to a boil and, using a large ladle, pour the hot water over the rind side of the pork several times. This is best done suspending the pork above the sink by a hook, but you can place it on a wire rack in the sink instead. Set the pork belly aside.", "Heat a wok until it is hot, then add the salt, pepper, five-spice powder and sugar and stir-fry the mixture for 3 minutes. Allow the mixture to cool slightly. ", "When the mixture is cool enough to handle, rub it into the flesh side of the pork. Hang the meat to dry for 8 hours or overnight in a cool place or in front of a fan. Alternatively, place the meat on a wire rack set above a roasting tin. ", "To cook the pork, preheat the oven to 200C/180C fan/Gas 6.", "Place the pork on a wire rack, rind-side up and roast for 20 minutes. ", "Reduce the heat to 180C/160C fan/Gas 4 and continue to roast for 2 hours. Turn the oven back up to 230C/210C fan/Gas 8 and cook for 15 minutes. Remove the meat from the oven and allow the pork to cool. ", "For the greens, heat a wok, once hot, add the ingredients and cook for 2-3 minutes.", "To make the dressing, place all the ingredients into a pestle and mortar and pound to a rough paste.", "To serve, stir the dressing through the wok vegetables and scatter on a large plate. Cut the pork into small squares and dot around the plate. Garnish with the spring onions and chilli."]}, {"isVegetarian": false, "title": "Five-spice duck breasts with honey and soy", "url": "www_bbc_co_uk_food_recipes_fivespiceduckbreasts_90212", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespiceduckbreasts_90212_16x9.jpg", "ingredients": ["2 small duck breasts", "4 tsp five-spice powder", "salt and freshly ground black pepper", "2 tbsp clear honey", "6 tbsp soy sauce", "salt", "4 spring onions", "1 packet oriental-style egg noodles (2 squares of dried noodles)", "sesame seeds, to taste", "toasted sesame oil, to taste", "squeeze fresh lime juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "With a sharp knife, score the fat of the duck into a cross-hatch pattern.", "Sprinkle the five-spice powder onto the skin of the duck breasts and rub it into the fat well. Season with salt and freshly ground black pepper.", "Heat a heavy-based ovenproof frying pan. Don't add oil. Place the duck breasts skin-side down in the hot pan. Season the other side with five-spice powder and salt and freshly ground black pepper. Cook until most of the fat has run out into the pan and the skin has a golden colour (about three minutes).", "Turn the duck breasts over and cook the other side for a minute or so.", "Place the duck breasts in the oven for 3-5 minutes to finish.", "To make the sauce, warm the honey and soy sauce together in a small pan. Bring up to boiling point and let it bubble for a minute or two to reduce. Take off the heat and allow to cool. The sauce should have a syrup-like consistency.", "Remove the cooked duck breasts from the oven and leave to rest in a warm place.", "While the duck is resting, heat a medium pan of salted water for the noodles.", "Meanwhile, cut the white and green parts of the spring onions into slices on the diagonal.", "When the water is boiling, add the egg noodles and cook for 3-4 minutes or according to packet instructions.", "Drain the noodles and place them in a bowl. Sprinkle in the sesame seeds, drizzle with a few drops of sesame oil and sprinkle with cut spring onions, reserving some for the garnish. Stir together well.", "To serve, place the noodles onto a plate. Squeeze over a bit of lime juice. Slice the duck breasts into strips and place next to the noodles. Sprinkle over the remaining spring onion and drizzle over the honey and soy sauce."]}, {"isVegetarian": false, "title": "Five-spice roast chicken drumsticks", "url": "www_bbc_co_uk_food_recipes_fivespiceroastchicke_89295", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespiceroastchicke_89295_16x9.jpg", "ingredients": ["1 tbsp groundnut oil", "3 garlic cloves, chopped", "2 tbsp grated fresh root ginger", "1 tbsp Shaoxing rice wine or dry sherry (optional)", "2 tbsp light soy sauce", "2 tsp five-spice powder", "2 tbsp honey", "1kg/2lb chicken drumsticks, skin on"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinade, put all of the marinade ingredients into a large bowl and stir to combine. Add the chicken and allow to marinate while you preheat the oven to 200C/180C Fan/Gas 6. ", "Put the chicken drumsticks on a roasting tray and roast for 20-30 minutes, or until the skin is golden and the chicken is cooked through. (To check, pierce the drumstick at its thickest part, next to the bone. The juices should run clear.)"]}, {"isVegetarian": false, "title": "Chinese five-spice spare ribs", "url": "www_bbc_co_uk_food_recipes_fivespicespareribs_70976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespicespareribs_70976_16x9.jpg", "ingredients": ["750g/1½lb pork spareribs", "600ml/1 pint groundnut (peanut) oil", "1 tbsp Shaoxing rice wine or dry sherry", "1 tbsp light soy sauce", "1 tbsp Chinese black rice vinegar or cider vinegar", "2 tsp sesame oil", "1 tbsp cornflour", "2 tbsp finely chopped garlic", "2 tsp five-spice powder", "3 tbsp finely chopped spring onions", "3 tbsp Chinese rock sugar or granulated sugar", "3 tbsp Shaoxing rice wine or dry sherry", "150ml/5fl oz chicken stock", "1½ tbsp light soy sauce", "2 tbsp dried grated orange peel", "85ml/3fl oz Chinese black rice vinegar or cider vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Have your butcher separate the spareribs into individual ribs and then into chunks which are approximately 7.5cm/3in long.  Alternatively do this yourself using a heavy sharp cleaver that can cut through the bones.  ", "Mix the marinade ingredients together in a bowl and steep the spareribs in the marinade for about 25 minutes at room temperature.  Remove the spareribs from the marinade with a slotted spoon.", "Heat the oil in a deep-fat fryer or large wok.  When the oil is very hot and slightly smoking, slowly brown the marinated spareribs in several batches until they are brown.  Drain each cooked batch on kitchen paper.  (Leave the cooking oil to cool.  Strain it through a filter if you want to re-use it when cooking pork.)", "Put the sauce ingredients into a clean wok or frying pan.  ", "Bring the sauce to the boil and then reduce the heat.  Add the spareribs, cover and simmer gently for about 40 minutes, stirring occasionally.  ", "If necessary, add a little water to the sauce to prevent the spareribs from drying up.  Skim off any surface fat, turn onto a warm serving plate and serve at once."]}, {"isVegetarian": false, "title": "Fizzy pop cheesecakes", "url": "www_bbc_co_uk_food_recipes_fizzy_pop_cheesecakes_30211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz plain flour ", "375g/13oz unsalted butter, chilled and cubed", "150g/5½oz icing sugar ", "3 medium free-range eggs ", "1 tbsp full-fat milk", "675g/1lb 7oz full-fat cream cheese", "150g/5½oz caster sugar", "150ml/5fl oz soured cream", "3 medium free-range eggs and 1 free-range egg yolk", "3 tbsp plain flour", "2 balls stem ginger in syrup, ginger chopped ", "1 large unwaxed lemon, zest only ", "1 tsp vanilla bean paste ", "100ml/3½fl oz double cream", "100g/3½oz dark chocolate buttons (minimum 70% cocoa solids) ", "4 tbsp stem ginger syrup (reserved from the stem ginger jar)", "100ml/3½fl oz double cream", "100g/3½oz good-quality white chocolate buttons ", "2 tsp Sicillian lemon extract ", "yellow gel food colouring ", "100ml/3½fl oz double cream", "100g/3½oz white chocolate", "2 tsp vanilla bean paste ", "2 medium egg whites ", "110g/4oz caster sugar ", "100g/3½oz good-quality white chocolate buttons ", "50g/1¾oz popping candy ", "3 cubes crystallised ginger, roughly chopped"], "serves": "Makes 3 tiers of decorated cheesecakes", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "For the pastry base, rub the flour into the butter until it resembles breadcrumbs. Mix in the icing sugar. ", "Whisk the eggs and milk together in a separate bowl and add to the flour mixture. Use your hands to bring the dough together. Wrap in cling film and transfer to the freezer for 10 minutes.", "On a lightly floured work surface, roll out the pastry as thinly as possible (ideally 3mm thick).", "Line the 3 tins with the pastry, making sure to leave some extra in case it shrinks (leave any excess pastry upright not hanging over the sides as it could be difficult to trim later). Prick the bases with a fork and chill the filled tins for 15 minutes in the fridge.", "Line the inside of the tins with baking paper and fill each tin with baking beans. Place the tins on baking trays. Blind bake the pastry shells for 15 minutes. Remove the baking beans and leave the pastry to cool in the tins. ", "Reduce the oven temperature to 150C/130C Fan/Gas 2.", "For the cream cheese filling, mix the cream cheese and sugar in a large bowl until incorporated.  Add the soured cream, eggs, egg yold and flour. Mix gently to avoid incorporating excess air and pour the mixture into the pastry cases leaving a small lip at the top which will be filled with sauce later. ", "Scatter the stem ginger over the surface of the 20cm/8in cheesecake, the lemon zest on the 18cm/7in cheesecake and swirl the vanilla bean paste on the 15cm/6in cheesecake. Place all the tins on the middle shelf of the oven and bake the 15cm/6in cheesecake for 30 minutes and the 2 larger ones for 45 minutes, or until each cheesecake is set with a slight wobble in the centre. Leave them to cool in the tin. ", "For the ginger beer topping, heat the cream until just boiling then pour it over the chocolate. When melted, stir in the stem ginger syrup. Once it has cooled a little, pour over the 20cm/8in cheesecake. Cool in the fridge or freezer.", "For the lemonade topping, heat the cream until just boiling then pour it over the chocolate. When melted, stir in the lemon extract and food colouring. Once it has cooled a little, pour over the 18cm/7in cheesecake. Cool in the fridge or freezer.", "For the cream soda topping, heat the cream until just boiling then pour it over the chocolate. When melted, stir in the vanilla paste. Once it has cooled a little, pour over the 15cm/6in cheesecake. Cool in the fridge or freezer.", "For the Italian meringue, set up a freestanding mixer with the whisk attachment. Add the egg whites and whisk until soft peaks form when the whisk is removed. Meanwhile, heat the sugar and 3 tablespoons water in a pan until it reaches 120C on a sugar thermometer.", "As soon as the sugar reaches 120C, slowly drizzle it into the egg whites with the motor running (take care not to pour the syrup onto the beaters as it might splash).  When all the syrup is incorporated the mixture should be shiny and smooth. Continue to whisk until the bowl feels cold. Transfer the meringue to a piping bag fitted with a medium plain nozzle.", "To assemble, pipe a few dots of meringue onto each cake board. Carefully trim away any excess pastry and remove the cheesecakes from their tins. Place each cheesecake on the corresponding cake board. ", "Starting with the largest cheesecake, insert 3 drinking straws  in a triangle formation about 5cm/2in apart (these will support the weight of the next layer of cheesecake). Carefully trim the straws to the same height as the cheesecake. Repeat the process with the 18cm/7in cheesecake. ", "Stack the cheesecakes from large to small and pipe the Italian meringue around the edge of each of the bottom 2 cheesecakes and over the top of the smallest one. Decorate the cheesecakes with white chocolate on the top layer, popping candy on the middle and crystallised ginger on the bottom."]}, {"isVegetarian": false, "title": "Flaked salmon, spinach and cream cheese puff 'pizza'", "url": "www_bbc_co_uk_food_recipes_flakedsalmonspinacha_87684", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["flour, for dusting", "½ x 425g/15oz packet ready-rolled puff pastry", "1 free-range egg, beaten", "55g/2oz spinach", "55g/2oz cream cheese", "salt and freshly ground black pepper ", "1 tbsp olive oil", "¼ onion, cut into wedges", "100g/3½oz salmon fillet, skinned and sliced into 4cm/1½in pieces"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Roll out the pastry on a lightly floured surface to make a 20cm/8in round and place onto a non-stick baking sheet.", "Heat a frying pan over a low-medium heat and place the spinach into the dry pan. Stir over the heat until wilted, then sprinkle over the pastry.", "Dot the cream cheese over the spinach and season, to taste, with salt and freshly ground black pepper.", "Bake in the oven for 10-12 minutes, or until golden-brown and crisp.", "Heat the oil in a small frying pan, add the onion and fry gently for five minutes.", "Add the salmon pieces and continue cooking for 2-3 minutes, or until the salmon is cooked through.", "To serve, place the puff pastry pizza onto a serving plate and scatter the salmon and onion over the top."]}, {"isVegetarian": false, "title": "Flaky pastry", "url": "www_bbc_co_uk_food_recipes_flakypastry_1282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "pinch of salt", "80g/3oz lard", "80g/3oz butter"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flour with the salt and rub in half of the lard. Add enough cold water to bring the flour to a soft dough. ", "Mix together the rest of the lard and the butter.", "Roll out the dough to make a rectangle 12.5 x 25cm/5 x 10in.", "Dot one third of the butter/lard mixture over two-thirds of the rectangle. Fold the third without any fat on it over the middle third of the pastry. Bring the other third on top. Seal the edges with a rolling pin and turn the dough 90 degrees. Chill for 10 minutes.", "Repeat stage 4 with half of the rest of the fat and then repeat one more time with the remaining fat. Chill for 10 minutes after each folding.", "Roll and fold one more time without any fat and then chill for 30 minutes. "]}, {"isVegetarian": false, "title": "Flamed mackerel with rhubarb chutney, roasted beetroot and pickled shallots", "url": "www_bbc_co_uk_food_recipes_flamed_mackerel_with_79694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz caster sugar", "2cm/¾in piece root ginger, peeled and finely chopped", "1 shallot, finely chopped", "3 sticks rhubarb, finely chopped", "5 tbsp cider vinegar", "1 orange, juice only", "2 mackerel fillets, filleted, pin boned, skin on", "salt and freshly ground black pepper", "½ bunch baby heritage beetroots, cleaned, leave a little stalk on", "75g/2¾oz unsalted butter", "200ml/7fl oz white wine vinegar", "75g/2¾oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "2 banana shallots, thinly sliced", "100g/3½oz crème fraîche", "1 tbsp bull's blood leaves", "1 tbsp baby red sorrel leaves"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the chutney, in a heavy-based pan melt the sugar until a golden-brown caramel forms (CAUTION: boiling sugar is extremely hot. Handle very carefully.). Remove from the heat and stir in the ginger, shallot and rhubarb. Stir in the cider vinegar and orange juice. Return to the boil then cook gently for 8-10 minutes. Season with salt and pepper, set aside to cool.", "Put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut in half. Melt the butter in a medium frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.", "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours.", "Put the mackerel skin-side up on a heavy baking tray and use a chef's blow torch to char the skin. Season with salt and pepper.", "Place a spoonful of chutney on each serving plate with the baby beetroot dotted around the plates. Place the mackerel in the centre and dot the plates with crème fraîche and pickled shallots. Garnish with the leaves."]}, {"isVegetarian": true, "title": "Flambéed pears with pancakes and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_flambeedpearswithpan_84484", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz plain flour", "2 free-range eggs", "1 tbsp olive oil", "100ml/3½fl oz milk", "vegetable oil", "55g/2oz chocolate", "30g/1oz butter", "30ml/1oz butter", "1 tbsp brown suga", "170g/6oz tinned pears, drained and sliced", "1 tbsp hazelnut liqueur", "icing sugar", "whipped cream, to serve, optional"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the pancake ingredients, apart from the oil, into a bowl and mix together to form a smooth batter.", "Heat the vegetable oil in a frying pan over a high heat, and pour in enough batter to cover the base in a thin layer.  ", "Cook the pancake for a minute or two, then carefully turn over when base is golden brown and cook the other side.  Cool.  Repeat until you have three pancakes.  Fold in half, then into quarters and stack onto a serving plate.", "For the chocolate sauce, place the chocolate and butter in a bowl (non-metallic) and place into the microwave. Cook for 30 seconds or until melted.", "For the pears, melt the butter in a pan over a medium heat. Add the brown sugar let dissolve, then add the pears.", "Add the liqueur and flambé, by lighting the liqueur with a match, taking care to keep the pan at arm's length (NB: keep a saucepan lid to the side in case the flame needs to be put out).  Shake the pan until the flame dies out. ", "To serve, stack the pancakes into the centre of a serving plate and place the pears on top.  Drizzle with the chocolate sauce and dust with icing sugar. Serve with a spoon of whipped cream if desired."]}, {"isVegetarian": false, "title": "Flambéed lobster", "url": "www_bbc_co_uk_food_recipes_flambeedlobster_89187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz white fish trimmings, rinsed ", "2 leeks, white part only, roughly chopped", "½ bulb fennel, roughly chopped", "2 carrots, roughly chopped", "1 bay leaf", "1 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "2 canned plum tomatoes, drained and finely chopped", "2 cooked lobsters, split, tail and claw meat removed, cut into serving pieces", "75ml/3fl oz brandy", "110ml/4fl oz fish stock", "50g/2oz butter", "3 tbsp chervil, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stock, place all the fish stock ingredients into a saucepan and cover with cold water. Place on the heat and bring to the boil.", "Reduce the heat and simmer for 25 minutes, skimming off any scum that sits on the surface. Strain into a container and use when needed (the stock can be frozen if necessary - make sure it has cooled completely before you place it in the freezer and that the container you use is suitable for freezing).", "For the flambéed lobster, heat a sauté pan until hot, add the olive oil, shallots and garlic and cook for two minutes.", "Add the tomatoes and sauté for one minute. Stir in the lobster and the brandy.", "Tip the pan towards the heat so that the brandy is set alight, tossing the lobster to be covered by the flames. Once the flames have subsided, add the fish stock and simmer for two minutes. Stir in the butter and chervil, season with salt and freshly ground black pepper and serve at once."]}, {"isVegetarian": false, "title": "Flamenco eggs", "url": "www_bbc_co_uk_food_recipes_flamenco_eggs_29298", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flamenco_eggs_29298_16x9.jpg", "ingredients": ["4 tbsp olive oil", "1 small onion, chopped", "1 garlic clove, chopped", "80g/2¾oz serrano ham, chopped", "1 heaped tsp hot smoked paprika", "8 large tomatoes (about 750g/1lb 10oz), skinned and chopped, or 2 x 400g tins peeled plum tomatoes", "1 tsp tomato purée", "75g/2½oz peas, fresh or frozen", "100g/3½oz fine green beans", "4 free-range eggs", "12 slices chorizo ", "1 red pepper, roasted and skinned, cut into 8 strips (or use peppers from a jar)", "salt and freshly ground black pepper", "4-8 thick slices bread", "1 garlic clove, halved", "2 tbsp olive oil", "small handful flatleaf parsley, chopped, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 (alternatively you can finish cooking on the hob).", "Heat the oil in a large, lidded, ovenproof frying pan or shallow casserole over medium–low heat. Cook the onion and garlic for 5–10 minutes, or until soft. ", "Add the ham and paprika and fry for 3 minutes. Add the tomatoes and tomato purée, cover the pan and cook for 10-15 minutes, or until the tomatoes are reduced and pulpy.", "Meanwhile, bring a pot of water to the boil. Add the peas and beans cook for 3–4 minutes, then drain and refresh in cold water (frozen peas do not require pre-cooking).", "Scatter the peas and beans over the tomato sauce. Break the eggs into the sauce. Arrange the chorizo slices and red pepper strips around the eggs. Season with salt and pepper.", "Bake for 10 minutes, or until the egg whites are set and the yolks still soft; check after 8 minutes. Alternatively, cook on the hob over a medium heat with a lid on the pan for 10 minutes. ", "Meanwhile, rub the bread with the garlic, brush with the oil and griddle it on a ridged pan or in a frying pan. ", "Scatter the parsley over the dish and serve with griddled bread."]}, {"isVegetarian": true, "title": "Flan de Saint Jean de Minervois", "url": "www_bbc_co_uk_food_recipes_flan_de_saint_jean_de_38808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz granulated sugar", "2 tbsp water", "900ml/1½ pint full-fat milk", "4 tbsp lavender honey", "1 orange, zest finely grated", "9 free-range eggs", "100ml/3½fl oz sweet muscat wine (or any other dessert wine)"], "serves": "Serves 8 - 10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To make the caramel, heat the sugar and water in a heavy-based pan until the sugar dissolves, stirring occasionally. Once the sugar has dissolved, stop stirring and cook until the sugar syrup caramelises and turns a deep golden brown. Swirl the liquid in the pan occasionally so that it doesn’t burn. ", "As soon as the caramel is ready, pour it carefully into a 1.5 litre/2¾ pint non-stick ridged flan tin. (Do not use a loose-bottomed flan tin for this) Holding the tin with an oven cloth, tip the caramel up into the ridges – be very careful as the caramel will be extremely hot! Leave to one side while the caramel sets.", "To make the custard, pour the milk into a medium non-stick saucepan and add the honey and orange zest. Bring to a simmer and cook until the honey dissolves, stirring occasionally. Watch carefully so that it doesn’t boil over.  Remove the milk from the heat and leave to infuse for 10 minutes. ", "Meanwhile, bring a kettle of water to the boil and preheat the oven to 170C/325F/Gas 3½.  Put the flan tin into a roasting tin.", "Whisk the eggs and wine together until pale and creamy. Strain the hot milk and honey through a fine sieve into a jug, then pour on to the eggs and wine, stirring constantly. Pour this mixture into the flan tin on top of the caramel. ", "Pour just-boiled water into the roasting tin to come halfway up the sides of the flan tin. This helps the custard cook gently and gives a smooth texture to the finished flan.", "Bake for 45–50 minutes or until the custard is just set. Cover the tin loosely with foil halfway through the cooking time to prevent the top browning too much. The custard should still be fairly wobbly in the centre when it is cooked and will continue to set as it cools. ", "Take the roasting tin out of the oven and leave the flan to cool in the water for at least an hour. Once cooled, cover with cling film and transfer to the fridge. Chill for at least 6 hours or overnight. ", "To serve, press the custard all the way around with your finger tip to break the seal at the edge of the tin. Place a fairly deep serving plate on top of the tin (to contain the caramel) and invert. Holding both the plate and flan tin tightly together, give a small shake. The custard should then drop down on to the plate. Pour any caramel in the dish over the custard. If the custard is reluctant to leave the tin, dip the base very quickly into a bowl of just-boiled water and try again. "]}]