[{"ingredients": ["1kg / 2lb 4oz vientre de cerdo deshuesado, piel anotada", "2 chiles rojos largos, divididos longitudinalmente", "2 palitos de limoncillo, ligeramente magullados", "½ cabeza de ajo, rebanada horizontalmente", "4 ramitas de cilantro, preferiblemente con raíz adjunta", "4 rebanadas de jengibre fresco", "2 hojas de lima ligeramente magulladas", "Aceite para freír", "botón de mantequilla", "1 nabo blanco, pelado y en rodajas finas", "1 pepino, en rodajas finas", "Vinagre de vino blanco 110ml / 4fl oz", "1 cucharadita de azúcar", "1 cucharadita de sal", "150 g / 5½ oz de azúcar en polvo", "2 chiles rojos, más o menos picados", "3 tomates de ciruela, toscamente picados", "8 hojas de lima", "2 tallos de limoncillo, hojas externas duras retiradas, finamente picadas", "4 ramitas de cilantro (preferiblemente con raíz adjunta), aproximadamente picadas", "25 g / 1 oz de jengibre fresco picado", "2 dientes de ajo, pelados", "2 chalotes pequeños, toscamente picados", "4 cucharadas de salsa de pescado tailandés", "40ml / 1½fl oz de aceite de sésamo", "50ml / 2fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "3 limas, jugo y ralladura", "110 g / 4 oz de crema fresca", "Hojas de berro de 150g / 5oz", "3 cucharadas de hojas de cilantro", "2 cucharadas de hojas de menta"], "method": ["Para el vientre de cerdo, coloque la barriga de cerdo, los chiles, la hierba de limón, el ajo, el cilantro, el jengibre y las hojas de lima en una olla grande. Cubra con agua, para que el cerdo esté cubierto, luego hierva. Reduzca el fuego a fuego lento y cocine por dos horas.", "Para las verduras en escabeche, coloque el nabo y el pepino en un recipiente resistente al calor. Ponga 110ml / 4fl de agua en una sartén con el vinagre de vino blanco, el azúcar y la sal, y caliente hasta que la sal y el azúcar se hayan disuelto. Vierta sobre el nabo y el pepino y deje a un lado para encurtir durante dos horas, luego drene el líquido decapante.", "Para la barriga de cerdo, cuando se cueza a fuego lento, retírelo del fuego y colóquelo entre dos bandejas de hornear pesadas y colóquelo en la nevera durante al menos dos horas para que se enfríe y caliente.", "Para la mermelada de chile, caliente el azúcar en una cacerola de base pesada a fuego medio a bajo hasta que se derrita y forme un caramelo dorado. No revuelva y vigílelo para que no se queme.", "Mezcle todos los ingredientes restantes de mermelada de chile, excepto la crème fraîche, en un procesador de alimentos para obtener un puré suave.", "Una vez que el azúcar se haya caramelizado, vierte la mezcla de mermelada de chile picado y revuelve bien. Ponga la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que esté pegajoso y atascado. Retirar del fuego y reservar para enfriar un poco.", "Para la barriga de cerdo, retire la carne de cerdo de la nevera y córtela en rodajas gruesas de 1 cm / ½. Calentar una sartén hasta que esté caliente, agregar un chorrito de aceite y un poco de mantequilla, y freír las rodajas de cerdo en cada lado durante 1-2 minutos, o hasta que estén doradas y crujientes.", "Agregue un par de cucharadas de mermelada de chile a la sartén y continúe freír, hilvanando a medida que avanza hasta que esté cubierto y ligeramente pegajoso.", "Para servir, coloque tres rebanadas del vientre de cerdo en el plato, vístelas con las verduras en escabeche, berros, cilantro y hojas de menta y termine con unos puntos de mermelada de chile."], "url": "www_bbc_co_uk_food_recipes_thai_poached_pork_belly_75251", "title": "Tailandés vientre de puerco escalfado con ensalada de cilantro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7 chalotes tailandeses, pelados y en rodajas", "8 dientes de ajo, pelados", "2-3 piezas de galangal, peladas y en rodajas", "6 tallos de limoncillo, pelados y en rodajas", "4 piezas de cúrcuma fresca, peladas y en rodajas", "1 cucharadita de pasta de camarón", "1 chile pequeño, seco, muy caliente, remojado y finamente picado", "1 guindilla, finamente picada", "1 lima kaffir, solo ralladura", "Una pizca de sal marina", "½ cucharadita de pimienta negra molida", "135g / 4¾oz de carne picada de cerdo", "½ cucharadita de aceite fragante tailandés", "2-3 chiles Prik Kee Noo Suan u otros chiles rojos tailandeses", "3-4 pequeños granos de pimienta verdes", "pequeña pizca de azúcar en polvo de oro", "1 cucharada de salsa de pescado", "pequeña salpicadura de caldo de pollo", "1½ cucharadas de limoncillo en rodajas finas", "1 cucharada colmada de hojas de lima kaffir en juliana", "1 hinojo, el centro eliminado y en rodajas", "¼ de pepino, picado", "¼ repollo chino, finamente picado", "2 piezas blancas de cúrcuma o judías verdes en rodajas", "8 hojas de lima", "1 ramita de albahaca tailandesa", "1 ramita de Pennywort asiática"], "method": ["Para la pasta de curry, machaque todo en una maja y mortero hasta obtener una pasta suave.", "Para el salteado, coloque el wok a fuego lento y agregue 1½ cucharadas de la pasta de curry. Agregue la carne picada y mezcle la carne de cerdo y pegue. Vierta el aceite y mezcle bien, continuar freír y romper la carne. Sofríe hasta que el cerdo esté cocido.", "Agregue los chiles y los granos de pimienta verde y continúe cocinando por otro minuto, machaque todo para que los chiles y los granos de pimienta estén magullados. Agregue el azúcar, la salsa de pescado y el caldo para crear una salsa ligera. Agregue las hojas de limoncillo y de lima kaffir y cocine por 15 segundos más.", "Coloque el hinojo, el pepino, la col y la cúrcuma blanca en agua helada durante unos minutos. Sirva los salteados con guarnición de verduras congeladas, hojas de lima, albahaca tailandesa y chilena asiática."], "url": "www_bbc_co_uk_food_recipes_thai_pork_kaffir_lime_91692", "title": "Cerdo tailandés y limoncillo salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chalotes grandes, picados", "Jengibre fresco de 5cm / 2in en pieza, pelado, picado", "2.5cm / 1in pieza de galanga fresca, pelada, picada", "2 tallos de limoncillo, finamente picado", "2 dientes de ajo picados", "cilantro de racimo pequeño, toscamente picado, más extra para servir", "3 chiles rojos calientes y secos empapados en 75 ml / 3 fl oz de agua tibia", "3 hojas de lima, más o menos picadas", "1 cucharada de salsa de pescado tailandesa", "1 cucharada de aceite vegetal", "400g / 14oz de gambas de tigre crudas, peladas y desvainadas", "1 cucharada de azúcar de palma", "1 cucharada de pasta de tamarindo", "1 x 225 g / 8oz de castañas de agua de estaño, escurridas y cortadas aproximadamente", "¼ cucharadita de pimienta blanca recién molida", "Leche de coco 400ml / 14fl oz", "1 lima, solo jugo", "1 cucharada de aceite vegetal", "1 cucharada de salsa de chile picante", "6 cebollas de primavera, finamente rebanadas", "3 chiles rojos tailandeses, en rodajas finas", "Fideos de arroz fino de 200 g / 7 oz, cocinados según las instrucciones del paquete", "2 cucharadas de cacahuetes salados tostados, aplastados", "1 cucharada de salsa de soja ligera", "1 cucharada de aceite de sésamo tostado", "3 cucharadas de cilantro fresco picado", "1 lima, solo jugo"], "method": ["Para la pasta de curry rojo tailandés, mezcle todos los ingredientes de pasta de curry rojo tailandés, incluido el agua de remojo, en un procesador de alimentos hasta lograr una pasta homogénea. Guarde cualquier pasta de repuesto en un frasco esterilizado sellado en el refrigerador por hasta 1 semana.", "Para el gambas al curry, caliente el aceite en un wok a fuego muy alto. Agregue 50g / 1¾oz de la pasta de curry y saltee durante 1-2 minutos, o hasta que empiece a oscurecerse en color.", "Agregue las gambas, el azúcar de palma, la pasta de tamarindo, las castañas de agua, la pimienta blanca y la leche de coco. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 10 minutos, o hasta que espese. Mantener caliente; sazonar con el jugo de lima y decorar con un poco de cilantro picado justo antes de servir.", "Para los fideos, caliente el aceite en un wok a fuego muy alto. Agregue la salsa de chile, cebollas tiernas y chile rojo y saltee durante 1-2 minutos.", "Agregue los fideos cocidos, los cacahuetes, la salsa de soja, el aceite de sésamo y el cilantro y saltee hasta que se caliente. Sazonar, al gusto, con jugo de lima.", "Para servir, divida los fideos entre cuatro platos para servir. Cuchara sobre el curry de gambas."], "url": "www_bbc_co_uk_food_recipes_thai_prawn_curry_with_09136", "title": "Curry tailandés de gambas con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 palitos de limoncillo", "50g / 1¾oz de jengibre, pelado", "3 cebollas de primavera", "2 chiles rojos medianos", "2 chiles amarillos medianos", "1 chile verde mediano", "1 cucharada de cúrcuma molida", "Aceite de cacahuete 200ml / 7oz", "1 pollo entero"], "method": ["Ajuste el horno a 180C / 350F / Gas 4.", "Combine todos los ingredientes aparte del pollo en un procesador de alimentos y mezcle hasta que quede suave.", "Cepille generosamente el pollo con la mezcla de especias.", "Cubra el pollo con papel de aluminio y tueste en el horno durante 70-80 minutos, o hasta que los jugos salgan limpios cuando el pollo esté perforado con un pincho - el tiempo de cocción dependerá del tamaño del pollo. Retire la lámina a la mitad para permitir que la piel se frunza.", "Deje reposar durante 15 minutos cubierto con papel de aluminio antes de servir."], "url": "www_bbc_co_uk_food_recipes_thai_roast_chicken_92130", "title": "Pollo asado tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_roast_chicken_92130_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas grandes, más o menos picadas", "5cm / 2in pieza galangal, pelado y rallado", "2 chiles de ojo de pájaro", "4 dientes de ajo", "3 hojas de lima kaffir", "1½ cucharada de salsa de soja oscura", "3 cucharadas de salsa de pescado", "1½ cucharada de pasta de camarones tailandeses", "6 cucharadas de puré de tomate", "2 cucharadas de pimentón ahumado", "1½ cucharadas de comino molido", "1½ cucharadas de cilantro molido", "1 cucharadita de cúrcuma", "½ cucharadita de clavo de olor molido", "½ cucharadita de nuez moscada", "1 cucharada de azúcar moreno claro (empacado firmemente)", "2 cucharadas de aceite de maní", "600 g / 1 lb 5 oz de tofu extra firme, en cubos", "½ pimiento rojo, descuartizado y en rodajas finas", "½ pimiento verde, descuartizado y en rodajas finas", "500ml / 18fl oz de leche de coco", "2 cucharadas de salsa de pescado", "1 lima, solo jugo", "6 cucharadas de aceite vegetal", "Harina normal de 200g / 7oz", "½ cucharadita de sal marina", "½ cucharadita de pimienta negra molida", "½ cucharadita de pimentón ahumado", "¼ cucharadita de chile rojo en polvo", "¼ cucharadita de comino en polvo", "200ml / 7fl oz de leche entera", "4 huevos medianos (solo se necesitan 200 g / 7 oz)", "puñado de albahaca tailandesa o hojas de cilantro", "3 limas, cortadas en cuñas"], "method": ["Precalentar el horno a 245C / 225C Fan / Gas 9.", "Para la pasta de curry, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que quede suave. Si la pasta es muy espesa, agregue un poco de agua y mezcle nuevamente.", "Para el tofu, caliente el aceite de maní en un wok o una sartén grande a fuego alto, agregue el tofu y saltee durante 10 minutos, volteándolo o hasta que se dore. Agregue los pimientos y continúe revolviendo. Agregue la pasta de curry y cocine por 2-3 minutos. Vierta la leche de coco, la salsa de pescado y el jugo de lima. Cocine a fuego lento durante 15-20 minutos, o hasta que la mayoría del líquido se haya evaporado, luego déjelo a un lado.", "Para los budines de Yorkshire, agregue una cucharadita de aceite vegetal a cada orificio de una lata de muffins. (Usted tiene suficiente masa para 18 pudines pequeños de Yorkshire.) Precaliente en el horno durante 10 minutos o hasta que el aceite esté humeante.", "Mientras tanto, en un tazón grande, mezcle bien la harina, la sal marina, la pimienta negra, el pimentón ahumado, el chile en polvo y el comino en polvo hasta que estén bien combinados.", "En otro recipiente, bata ligeramente la leche y los huevos. Agregue a la mezcla de harina y bata hasta que quede suave. Reserve para descansar en la nevera durante al menos unos minutos o, idealmente, media hora.", "Retire con cuidado las latas calientes del horno y, utilizando una jarra medidora, vierta la mezcla uniformemente en cada orificio. Hornee durante 12 minutos, o hasta que estén dorados y se hayan levantado. Retire del horno y deje enfriar en las latas durante unos minutos, luego retírelo y colóquelo en una rejilla para que se enfríe aún más.", "Para armar, coloque los budines de Yorkshire en un plato de servir. Si es necesario, empuja suavemente hacia abajo en el medio de Yorkshire para crear un chapuzón. Cucha una cantidad generosa de la mezcla de tofu en ellos. Cubra cada una con una albahaca tailandesa o una hoja de cilantro. Coloque las rodajas de lima alrededor del plato de servir y sirva."], "url": "www_bbc_co_uk_food_recipes_thai_tofu_panang_99782", "title": "Tofu tailandés Panang Yorkshires", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Cumple 18 años", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_tofu_panang_99782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 chiles rojos, partidos por la mitad, sin semillas", "150g / 5¼ oz de crema de coco", "4 limas, cáscara y jugo de 2 limas, 2 limas restantes en rodajas", "puñado de cilantro fresco", "1 x 1,5 kg / 3 lbs 5 oz de pollo entero, preferiblemente de corral", "350g / 12½oz de fideos de huevo frescos", "1 cucharada de semillas de sésamo, tostadas", "1 cucharada de aceite de sésamo", "2 cebollas de primavera, en rodajas", "1 cucharada de aceite vegetal", "2 dientes de ajo, aplastados", "azúcar pizca", "4 cabezas pak choi, reducido a la mitad, núcleos eliminados", "570ml / 1 pinta de caldo de pollo", "2 cucharaditas de salsa de pescado tailandés (nam pla)", "4 ramitas de cilantro fresco, para adornar"], "method": ["Para el pollo asado tailandés, precaliente el horno a 190 ° C / 350 ° F / Gas 5.", "Mezcle los chiles, el coco con crema, la ralladura de lima, el jugo de lima y el cilantro en un procesador de alimentos hasta conseguir una pasta homogénea.", "Con cuidado, empuje un poco de la pasta entre la piel y la carne de las pechugas de pollo, asegurándose de que esté distribuida uniformemente.", "Marca los muslos de pollo dos veces con un cuchillo afilado hasta el hueso. Con cuidado frote la pasta restante en los cortes y en los muslos de pollo.", "Coloque las rodajas de lima en el fondo de una bandeja de asar y sitúe el pollo encima. Cubra con papel de aluminio y tueste en el horno por 40 minutos. Retire el papel de aluminio, hilvane el pollo con cualquier jugo que se haya acumulado en el fondo de la bandeja y vuelva al horno por otros 30-40 minutos, rociando de vez en cuando, o hasta que el pollo esté bien cocido.", "Retire el pollo del horno y déjelo reposar en un lugar cálido durante cinco minutos.", "Mientras tanto, para los fideos de sésamo, cocinar los fideos de acuerdo con las instrucciones del paquete. Escurrir bien.", "Mezcle los fideos cocidos, las semillas de sésamo, el aceite de sésamo y las cebolletas en un tazón. Dejar de lado.", "Para el ajo pak choi, caliente el aceite en una sartén a fuego medio. Freír el ajo y el azúcar por un minuto, hasta que el azúcar se haya caramelizado. Agregue el pak choi, los lados cortados hacia abajo, luego vierta el caldo de pollo y la salsa de pescado y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cubra la sartén con un círculo de papel antigrasa (un cartucho) y cocine a fuego lento durante 3-4 minutos, o hasta que el pak choi esté tierno.", "Para servir, esculpe el pollo. Coloque una mitad pak choi en cada uno de los cuatro tazones de servir. Gire porciones de los fideos alrededor de un tenedor y colóquelos en el medio de los tazones de servir. Cubra con un poco de pollo y las restantes mitades de pak choi, luego rocíe con los jugos de la bandeja de asar. Adornar con las ramitas de cilantro."], "url": "www_bbc_co_uk_food_recipes_thai_roast_chicken_with_58724", "title": "Pollo asado tailandés con fideos de sésamo y pak choi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20 chiles rojos secos, semillas retiradas, reducidas a la mitad, empapadas durante 30 minutos y luego escurridas", "Raíz de cilantro 50g / 1¾oz (disponible en línea)", "8 hojas de lima, trituradas", "4 tallos de limoncillo, toscamente picados", "Galanga 100g / 3½ oz, pelado y en rodajas", "2 cucharadas de ralladura de lima, preferiblemente lima kaffir", "50g / 1¾oz de chalotes tailandeses, pelados y en rodajas (disponible en línea),", "50g / 1¾oz de ajo, en rodajas", "2 cucharadas de pasta de camarones", "½ cucharadita de semillas de cilantro", "¼ cucharadita de semillas de comino", "pequeña pieza de maza", "5 granos de pimienta blanca", "2-3 cucharadas de crema de coco", "4 cucharadas de pasta de curry (ver arriba)", "1 cm / ½ en pieza de raíz de jengibre fresco, pelado y picado", "6 muslos de pollo deshuesados, desollados y picados", "2 cucharadas de azúcar de palma", "1 cucharada de salsa de pescado", "2 palitos de limoncillo, golpeados", "6 hojas de lima, aplastadas", "2 latas de leche de coco de 400 ml", "100 ml / 3½ fl oz de caldo de pollo, calentado hasta ebullición", "puñado de cilantro fresco, hojas recogidas", "puñado de albahaca tailandesa, hojas recogidas", "puñado de menta, hojas recogidas", "2 chiles rojos largos, semillas extraídas y cortadas en tiras largas y delgadas", "2 chalotes pequeños, en rodajas, fritos hasta que estén crujientes", "2 dientes de ajo, en rodajas, fritos hasta que estén crujientes", "2 dientes de ajo", "pulgar de jengibre raíz fresca", "6 raíces o tallos de cilantro", "50ml / 2fl oz de aceite vegetal", "Fideos de arroz 300 g / 10½ oz, empapados", "1 cucharada de salsa de ostras", "1 cucharada de salsa de soja", "puñado de cilantro fresco", "100g / 3½oz de brotes de soja"], "method": ["Para la pasta de curry, coloque todos los ingredientes, excepto las semillas de cilantro, semillas de comino, macis y granos de pimienta en una licuadora, y mezcle hasta lograr una pasta homogénea. Agregue un poco de agua si es necesario.", "Tueste el cilantro, el comino y la maza en una sartén hasta que estén fragantes. Agregue los granos de pimienta. Retirar del fuego y dejar enfriar. Moler en un almirez y mortero y agregar a la pasta.", "Para el curry, caliente la crema de coco. Cuando la crema se separa, agregue la pasta de curry y fría, revolviendo constantemente a fuego medio. Agregue el pollo, el azúcar de palma y la salsa de pescado. Debería verse como un atasco pegajoso. Agregue el limoncillo, hojas de lima, leche de coco y caldo. Llevar a ebullición y cocinar por 4 minutos o hasta que el pollo esté bien cocido. Mantenga caliente a fuego muy lento mientras prepara los fideos.", "Para los fideos, coloque el ajo, el jengibre y el cilantro en un almirez, mortero y en una pasta. Calentar el aceite en un wok y agregar la pasta al aceite, sofreír a fuego muy alto por un minuto hasta que esté fragante y comenzar a colorear.", "Agregue los chiles y los fideos. Agregue las salsas, mezcle y cuando esté caliente ponga en un tazón grande cubierto con cilantro fresco y brotes de soja.", "Sirve el curry con los fideos al lado. Cubra con la guarnición de curry, si la está usando."], "url": "www_bbc_co_uk_food_recipes_thai_red_curry_with_23014", "title": "Curry rojo tailandés con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de grupa 175g / 6oz, finamente picado", "1 diente de ajo", "¼ cucharadita de hojuelas de chile seco", "½ cucharadita de aceite de sésamo", "2 cucharadas de cilantro fresco picado", "½ huevo de corral, ligeramente golpeado", "sal marina y pimienta negra recién molida", "100g / 3½ oz de judías verdes, cortadas y en rodajas finas", "1 cucharadita de harina común", "2 cucharadas de aceite de oliva", "cilantro fresco para adornar", "1 cucharadita de semillas de sésamo tostadas, para adornar"], "method": ["Coloque el bistec, el ajo, el chile, el aceite de sésamo, el cilantro y el huevo en un procesador de alimentos. Mezcle para combinar los ingredientes. Cubra con sal y pimienta negra recién molida.", "Transfiera a un recipiente y revuelva a través de las judías verdes. Ligeramente enharine sus manos y forme la mezcla de carne en cuatro hamburguesas.", "Caliente el aceite en una sartén honda a fuego medio-alto. Coloque las empanadas de carne en la sartén y fríe durante unos tres minutos en cada lado, hasta que estén doradas y cocidas.", "Para servir, coloque las hamburguesas en un lecho de hojas frescas de cilantro y espolvoree sobre las semillas de sésamo tostadas."], "url": "www_bbc_co_uk_food_recipes_thaibeefpatties_84008", "title": "Empanadas de carne tailandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de pollo", "2 chiles rojos a la vista de pájaro picados", "1 cucharadita de galanga pelada y finamente rallada", "1 cucharadita de limoncillo finamente picado", "2 cebollas tiernas, finamente picadas", "15g / ½ oz de cilantro, incluidos los tallos, picados", "1 lima, ralladura de mitad y jugo", "2 cucharadas de aceite vegetal", "sal y pimienta negra recién molida", "Azúcar en polvo de 55 g / 2 oz", "55 ml / 2 fl oz de agua", "½ cucharadita de hojuelas de chile secas trituradas"], "method": ["En un tazón mediano, mezcle la galanga, la hierba de limón, la cebolleta, el cilantro, la ralladura de lima y el jugo. Temporada.", "En un procesador de alimentos mezcle el pollo y el chile.", "Agregue la mezcla de galangal al pollo y mezcle de nuevo hasta que se combinen.", "Retire con cuidado la mezcla del procesador, divídala en ocho pociones y dé forma a cada porción en una torta.", "En una cacerola pequeña mezcle el azúcar, el agua y los chiles, colóquelos a fuego lento y cocine hasta que se forme un jarabe.", "Calentar el aceite en una sartén mediana.", "Freír los pasteles en el aceite durante 2-3 minutos por cada lado o hasta que estén cocidos y dorados.", "Sirva los pasteles con la salsa de inmersión en un plato aparte a un lado."], "url": "www_bbc_co_uk_food_recipes_thaichickencakeswith_66006", "title": "Tartas de pollo tailandés con una salsa dulce de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de arroz glutinoso (pegajoso) (disponible en fruterías asiáticas)", "4 cebollas rojas pequeñas, peladas y picadas", "16 dientes de ajo, pelados", "12 tallos de limoncillo, hojas exteriores retiradas, núcleo toscamente picado", "8 chiles rojos largos, tallos eliminados", "8 cucharadas de cilantro fresco picado (raíces y hojas)", "8 cucharaditas de chile en polvo", "10cm / 4in pieza de galanga fresca, pelada", "4 cucharaditas de ralladura de lima rallada", "4 hojas frescas de lima", "4 cucharaditas de pasta de camarones (disponible en fruterías asiáticas)", "12 cucharaditas de pimentón picante", "8 cucharaditas de cúrcuma molida", "2 cucharaditas de semillas de comino", "8 cucharadas de aceite vegetal", "2 cucharadas de aceite vegetal", "1 puerro grande, cortado, en rodajas finas", "2 dientes de ajo, triturados hasta formar una pasta", "1 chile rojo grande, cortado, finamente picado", "2 cucharadas de pasta de curry rojo tailandés (ver arriba)", "4 hojas frescas de lima", "2 zanahorias, peladas, más o menos picadas", "400g / 14oz de tomates picados enlatados", "Leche de coco 400 g / 14 oz", "250ml / 9fl oz de caldo de verduras", "I pequeña coliflor, cortada, cortada en florecillas", "½ calabaza pequeña, pelada, sin semillas, carne cortada en piezas de 2.5cm / 1in", "175g / 7oz serpiente o judías verdes, recortadas", "1 x 225 g / 8½ oz pueden brotes de bambú, drenados", "manojo de cilantro fresco, picado", "puñado de brotes de soja frescos, para servir"], "method": ["Para el arroz pegajoso, antes de comenzar a preparar el curry, remoje el arroz pegajoso en agua fría durante al menos 20 minutos o hasta 3 horas.", "Para la pasta de curry rojo tailandés, mezcle todos los ingredientes de pasta de curry rojo tailandés en una pasta suave en un procesador de alimentos.", "Para el curry, caliente una cucharada de aceite vegetal en un wok grande a fuego alto. Cuando el aceite esté humeando, agregue el puerro, el ajo y el chile y saltee durante 3-5 minutos, o hasta que se ablanden pero no se doren.", "Agregue las dos cucharadas de pasta de curry y fría por 2-3 minutos, revolviendo bien.", "Agregue las hojas de lima, zanahorias y tomates picados, luego vierta la leche de coco y el caldo de verduras, revuelva bien para combinar. Ponga la mezcla a ebullición, luego reduzca el fuego hasta que hierva a fuego lento y continúe cocinando a fuego lento, sin tapa, durante 10 minutos.", "Agregue las florecillas de coliflor, calabaza, judías verdes y brotes de bambú y continúe cocinando a fuego lento durante 12-15 minutos, o hasta que la calabaza esté tierna y la salsa se haya espesado ligeramente y reducido en volumen.", "Mientras tanto, para cocinar el arroz pegajoso, escurra el arroz remojado y enjuague bien. Perfore algunos agujeros en una hoja de papel para hornear y forre un vapor de metal o bambú con ella. Agregue el arroz drenado al vapor, cubra bien y suspenda el vapor sobre una olla de agua hirviendo durante 20 minutos. (No permita que la parte inferior del vaporizador toque la superficie del agua).", "Cuando las verduras en el curry estén tiernas y la salsa se haya espesado, agregue el cilantro picado.", "Para servir, coloque el arroz espolvoreado en cuencos, cocine sobre el curry de verduras y adorne con algunos brotes de soja."], "url": "www_bbc_co_uk_food_recipes_thai_vegetable_curry_41763", "title": "Curry de vegetales tailandeses", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_vegetable_curry_41763_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de pollo picado", "30g / 1oz de cilantro picado (tallos y hojas)", "1 chile rojo, finamente picado", "2 dientes de ajo, finamente picados", "sal y pimienta negra recién molida", "1 tallo de limoncillo, finamente triturado", "1 pedazo de jengibre del tamaño de un pulgar, finamente picado", "1 cucharada de salsa de soja oscura", "2 hojas de lima kaffir, finamente trituradas", "1 lima, solo jugo", "6 cebollas de primavera", "aceite de sésamo", "aceite de cocina", "30 g / 1 oz de hojuelas de chile seco", "110 g / 4 oz de azúcar en polvo", "120ml / 4fl oz de agua"], "method": ["Para hacer la salsa de chile dulce, mezclar el azúcar y el agua y llevar a ebullición. Agregue las hojuelas de chile a fuego lento y cocine por 40 minutos. Dejar de lado para enfriar.", "Cepille las cebolletas con aceite de sésamo y la plancha durante 2 minutos.", "Para las hamburguesas de pollo mezclar todos los ingredientes y marinar juntos durante 20 minutos. Usando tus manos crea pequeñas hamburguesas del tamaño de una cucharada. Freír en una mezcla de sésamo y aceite puro durante 5 minutos en cada lado. Coloque las cebolletas en un plato y coloque las empanadas encima. Coloque un tazón pequeño de salsa en el plato y espolvoree con cilantro."], "url": "www_bbc_co_uk_food_recipes_thaichickenpattieswi_70011", "title": "Empanadas de pollo tailandesas con salsa dulce de chile y cebolletas a la plancha", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, pelados, más o menos picados", "5 cm / 2 en pieza galangal, o jengibre, pelado, picado", "2 tallos de limoncillo", "2 hojas de lima frescas, más o menos picadas", "4 chalotes, preferiblemente tailandeses, pelados, picados", "1 cucharada de azúcar de palma", "1 cucharada de salsa de pescado", "1 cucharada de aceite vegetal", "1kg / 3lb 3 oz de mejillones, barba eliminada, limpiada (deseche los mejillones que no se cierren herméticamente cuando se golpean suavemente)", "Leche de coco 400ml / 14fl oz", "1 lima, solo jugo", "1 cucharada de cilantro fresco picado", "1 cucharada de albahaca tailandesa tailandesa fresca picada", "1 cucharada de menta fresca picada", "aceite vegetal, para freír", "3 papas para hornear grandes, peladas, en juliana", "sal y pimienta negra recién molida"], "method": ["Para los mejillones de coco tailandés, triture el ajo, galanga, limoncillo, hojas de lima, chalotas, azúcar de palma, salsa de pescado y aceite vegetal en un almirez y mortero hasta obtener una pasta.", "Calentar un wok con tapa a fuego alto y freír la pasta durante 1-2 minutos, o hasta que esté fragante.", "Agregue los mejillones y la leche de coco, cubra con una tapa y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos, o hasta que los mejillones se hayan abierto. (Deseche cualquier mejillón con conchas que no se hayan abierto por completo).", "Mientras tanto, para las papas fritas, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, caliente el aceite en una freidora a 190 ° C.", "Con cuidado, baje las papas en juliana al aceite caliente y fríe durante 3-4 minutos, o hasta que estén crujientes y doradas. Retirar del aceite y reservar para escurrir sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra recién molida. (Puede necesitar hacer esto en lotes).", "Para servir, mezcle el jugo de lima, cilantro, albahaca tailandesa y menta en los mejillones. Coloque los mejillones en cada uno de los 4 tazones para servir y coloque las papas al lado."], "url": "www_bbc_co_uk_food_recipes_thaicoconutmussels_93907", "title": "Mejillones de coco tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de pescado de 500 g / 1 lb 2 oz (merlán, abadejo, coley, etc.)", "½ pimiento rojo, picado", "2 chiles rojos picados", "2 cucharadas de cilantro", "3 cebolletas, finamente picadas", "2 dientes de ajo picados", "1 tallo de limoncillo, solo parte blanda, picada", "1 cucharada de salsa de pescado", "125ml / 4fl oz de leche de coco", "1 huevo entero", "125g / 4½oz de judías verdes", "aceite vegetal", "2 pepinos pelados, cortados a la mitad longitudinalmente y sin semilla", "35 g / 1 oz de azúcar en polvo", "50ml / 2fl oz de vinagre de arroz", "2 pimientos picantes, finamente picados", "2 chalotes, finamente cortados en cubitos", "2 cucharadas de hojas de cilantro picado", "Cacahuetes tostados 40g / 1½oz, picados", "½ cucharada de nam pla (salsa de pescado)"], "method": ["Corta el pescado en trozos pequeños. Coloque la pimienta, los chiles, el cilantro, la cebolleta, el ajo, la hierba de limón y la salsa de pescado en un procesador de alimentos y mezcle hasta obtener una pasta.", "Agregue las piezas de pescado a la pasta y mezcle bien. Mezcle hasta obtener una pasta suave agregando leche de coco y huevo.", "Coloque la mezcla en un recipiente. Cortar los frijoles finamente en 3 mm (1 / 8in) y mezclar en pasta de pescado. Enfríe en el refrigerador durante la noche o durante al menos dos horas.", "Llene a la mitad una sartén de base pesada con aceite y caliente a fuego medio a alto. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje sin supervisión.) Con la ayuda de una cuchara, moldee la pasta fría en pequeñas hamburguesas. Baje con cuidado las empanadas de pescado en el aceite caliente, en tandas (el aceite debe llegar a la mitad de los lados de las empanadas). Freír hasta que esté crujiente y dorado, dando vuelta una vez durante la cocción. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina. Repite el proceso con las hamburguesas de pescado restantes.", "Para la ensalada, corte el pepino en rebanadas de 5 mm (¼ in)", "Disuelva el azúcar en el vinagre y mezcle las rodajas de pepino. Dobla la guindilla, el chalote y el cilantro.", "Espolvoree con los cacahuetes y la salsa de pescado justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_thaifishcakesservedw_73733", "title": "Tarta de pescado tailandés servido con ensalada de pepino tailandés", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaifishcakesservedw_73733_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jengibre de raíz de 5 cm, picado", "25g / 1oz de coco fresco", "pizca de copos de chile", "1 lima, cáscara y jugo solamente", "3 dientes de ajo", "gran cilantro fresco puñado", "2 cucharadas de agua de coco", "75g / 2½oz de espinaca fresca", "1 lima, solo jugo", "pizca de copos de chile seco", "2 cucharaditas de salsa de soja", "1 cucharada de aceite de oliva", "½ diente de ajo, picado", "2 cucharaditas de miel", "1 pechuga de pollo", "500ml / 18fl oz de aceite vegetal caliente, para freír", "2 zanahorias, cortadas en tiras largas y delgadas, secadas sobre papel de cocina", "sal"], "method": ["Para la pasta de curry, coloque todos los ingredientes de pasta de curry, excepto la espinaca, en un procesador de alimentos y mezcle hasta formar una pasta suave.", "Vierta la pasta en una sartén a fuego medio y fría durante 3-4 minutos para resaltar los sabores y fragancias de la pasta.", "Agregue la espinaca y fría por un minuto, hasta que se marchite.", "Para el pollo, coloque todos los ingredientes del pollo en un tazón, revuelva bien, luego déjelo marinar durante diez minutos.", "Caliente una sartén hasta que esté humeando, luego agregue el pollo y la plancha durante 5-7 minutos a cada lado, o hasta que esté completamente cocida. (Verifique que los jugos se vean claros cuando se perforan con un pincho en su punto más grueso).", "Para las tiras de zanahoria crujiente, caliente el aceite vegetal en una olla profunda de fondo grueso, hasta que la miga de pan chisporrotee y se vuelva dorada en 30 segundos cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue las zanahorias y fríe durante 5-6 minutos, o hasta que estén doradas y crujientes. Con cuidado, quite con una espumadera y escurra sobre papel de cocina. Espolvoree las tiras de zanahoria con sal al gusto.", "Para servir, vierta la salsa de pasta de curry en el centro de un plato. Coloque el pollo en la parte superior y coloque con un puñado de tiras de zanahoria crujientes en la parte superior."], "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_84582", "title": "Pollo al curry verde tailandés con tiras de zanahoria crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de cilantro, lavado", "12 hojas de menta, lavadas", "1 cucharadita de sal", "3 dientes de ajo, aplastados", "2 chiles verdes, sin semillas", "3 cucharadas de jugo de lima fresco", "1 cucharada de salsa de pescado (nam pla)", "2 cucharadas de azúcar en polvo", "2 cucharaditas de jengibre pelado y picado", "4 x 175 g / 6 oz de filetes de salmón", "450g / 1lb pak choi", "1 cucharada de aceite de sésamo", "1 cucharada de aceite vegetal", "1 diente de ajo, en rodajas finas", "85g / 3oz cebollas de primavera, finamente rebanadas", "2 chiles rojos, sin semillas y finamente cortados", "sal y pimienta negra recién molida", "1 cucharada de salsa de soja"], "method": ["En un procesador de alimentos, mezcle las hojas y tallos de cilantro, las hojas de menta, la sal, el ajo y los chiles para hacer una pasta.", "Agregue el jugo de limón, la salsa de pescado, una cucharada de azúcar impalpable y una cucharadita de jengibre, y procese hasta que quede suave. Coloque la salsa en un tazón y combine con el salmón. Marinar durante 20 minutos.", "Hierva agua en la mitad inferior de un barco de vapor. Coloque el recipiente con el salmón marinado en la mitad superior y cocínelo al vapor durante 6-8 minutos.", "Escalde el pak choi en agua hirviendo con sal durante dos minutos, escurra y refresque.", "En un wok, caliente el aceite de sésamo y el aceite vegetal. Cuando esté caliente, agregue el ajo, cebollas tiernas, chiles y el jengibre restante. Cocine por un minuto.", "Agregue la salsa de soja, el azúcar impalpable restante y el pak choi. Mezcle para calentar. Sazone al gusto.", "Coloque el pak choi en el centro de un plato para servir y coloque el salmón al vapor encima. Sirve inmediatamente con la ensalada."], "url": "www_bbc_co_uk_food_recipes_thaifragrantsalmonwi_72333", "title": "Salmón fragante tailandés con pak choi", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "2 chalotes de plátano, en rodajas finas", "2 cucharadas de pasta de curry verde tailandés", "Leche de coco 400ml / 14fl oz", "1 cucharadita de salsa de pescado", "4 muslos de pollo, deshuesados ​​y sin piel", "250g / 9oz de patatas nuevas, peladas y partidas por la mitad", "125 g / 4½ oz de berenjenas (disponibles en algunos supermercados o tiendas de comestibles asiáticas)", "1 lima, solo jugo", "sal y pimienta negra recién molida", "250g / 9oz de arroz jazmín tailandés", "1 tallo de limoncillo, ligeramente triturado", "500ml / 18fl oz de agua", "puñado de cilantro fresco, solo hojas, para servir"], "method": ["Para el curry, caliente una sartén grande con tapa profunda o wok hasta que esté caliente, luego agregue el aceite vegetal y las chalotas. Revuelva freír durante un minuto, luego agregue la pasta de curry y sofría por un minuto más.", "Agregue la leche de coco y deje que hierva.", "Agregue la salsa de pescado, los muslos de pollo, las papas y las berenjenas y vuelva a hervir a fuego lento. Cubra con una tapa y cocine a fuego lento durante 15-20 minutos, o hasta que el pollo esté completamente cocido y las papas estén tiernas. Agregue el jugo de lima, condimente, al gusto, con sal y pimienta negra recién molida y revuelva.", "Mientras tanto, para el arroz, coloque el arroz y la hierba de limón en una cacerola pequeña y cubra con agua fría. Cubra con una tapa y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que el arroz esté tierno y toda el agua haya sido absorbida. Retire el lemongrass.", "Para servir, coloque el arroz en platos para servir, cubra con el curry y espolvoree sobre el cilantro."], "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_86295", "title": "Curry de pollo verde tailandés con arroz jazmín lemongrass", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1-2 cucharadas de pasta de curry verde preparada", "6 muslos de pollo, piel y huesos retirados, carne cortada en tiras", "Leche de coco de estaño 400ml", "2 hojas de lima (opcional)", "2 cucharadas de salsa de pescado tailandesa", "1 cucharada de azúcar", "puñado de judías verdes, recortadas", "puñado de espárragos", "sal y pimienta negra recién molida", "Arroz fragante tailandés, cocinado según las instrucciones del paquete", "puñado de hojas frescas de cilantro (opcional)"], "method": ["Caliente el aceite en un wok a fuego alto hasta que humee. Agregue la pasta de curry verde y saltee durante 1-2 minutos, o hasta que esté fragante.", "Agregue las tiras de pollo y revuelva hasta cubrir la pasta de curry. Continúe revolviendo por 1-2 minutos, o hasta que el pollo se dore por todos lados.", "Agregue la leche de coco, las hojas de lima, la salsa de pescado y el azúcar y mezcle bien. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 8-10 minutos o hasta que la salsa se espese.", "Agregue las judías verdes y los espárragos y continúe cocinando a fuego lento durante 2-3 minutos, revolviendo regularmente, hasta que estén tiernos. Condimentar con sal y pimienta.", "Para servir, espolvorea el arroz en cuatro tazones para servir, luego haz una cucharada sobre el curry de pollo verde tailandés. Espolvorea sobre las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_92440", "title": "Pollo al curry verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaigreenchickencurr_92440_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "2 cucharadas de pasta de curry verde tailandés (según el gusto)", "1 cucharada de azúcar moreno oscuro", "1-2 tallos gruesos de limoncillo, extremos gruesos golpeados con un rodillo (opcional)", "750g / 1½lb de pollo deshuesado y sin piel, cortado en trozos (use carne de pechuga y / o pierna)", "6-8 hojas de lima kaffir, rotas en pedazos (si no están disponibles, use la ralladura de 1 lima)", "Leche de coco 400ml / 14fl oz", "Buena salsa de pescado tailandés o salsa de soja ligera", "Pequeño puñado de cilantro, toscamente picado", "½-1 lima, solo jugo"], "method": ["Caliente el aceite en un wok o en una sartén grande. Agregue la pasta de curry verde y el azúcar y cocine a fuego medio durante aproximadamente un minuto, revolviendo con el limoncillo, si se usa. Reduzca el fuego levemente y agregue los trozos de pollo y las hojas de lima o la ralladura hasta cubrir la pasta. Agregue la leche de coco, la salsa de pescado o la salsa de soja y cocine a fuego lento durante 25-30 minutos hasta que espese un poco. Agregue el cilantro y el jugo de lima. Verifique el condimento, agregue más salsa de pescado o salsa de soja si es necesario.", "El curry ahora es mejor dejar reposar durante unos minutos para que la salsa se vuelva más cremosa. También probará los verdaderos sabores de los ingredientes de la pasta de curry cuando esté un poco más fría. Sirve con mucho fragante arroz jazmín tailandés."], "url": "www_bbc_co_uk_food_recipes_thaigreencurry_67788", "title": "curry verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaigreencurry_67788_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 gambas tigre, conchas y cabezas solamente", "100ml / 3½fl oz de agua hirviendo", "Jengibre de raíz 15g / ½ oz", "1 cucharada de aceite vegetal", "4 berenjenas para bebés, cortadas en cuñas", "1 guindilla de capote escocés en rodajas", "Jengibre de raíz 30 g / 1 oz, cortado en bastones", "2 dientes de ajo picados", "4 langostinos", "2 cebollas de primavera, picadas", "gran cilantro fresco puñado", "2 cucharadas de crema doble", "1 lima, ralladura solamente", "gran puñado de menta fresca", "1 guindilla de capote escocés, picado", "2 cucharadas de albahaca fresca, picada", "2 cucharadas de yogurt griego", "hojas frescas de cilantro"], "method": ["Para el caldo de gambas, coloque las cáscaras y las cabezas de gambas, agua hirviendo y jengibre en una cacerola y deje hervir durante diez minutos.", "Cuele la mezcla en un tazón limpio. Deseche las cáscaras y el jengibre.", "Para las berenjenas y gambas, caliente el aceite en un wok hasta que esté caliente. Agregue las berenjenas y cocine durante dos minutos. Agregue la guindilla, el jengibre y el ajo al wok y cocine por un minuto.", "Agregue las gambas y las cebolletas al wok y cocínelas por 2-3 minutos o hasta que las gambas estén coloreadas por todos lados y estén bien cocidas.", "Para la pasta de curry, coloque todos los ingredientes en el tazón de un procesador de alimentos y mezcle hasta formar una pasta.", "Agregue la pasta y el caldo de gambas a las berenjenas y gambas en el wok y cocine durante tres minutos.", "Para servir, agrega la albahaca y vierte en un tazón para servir. Adorne con el yogur griego y las hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_thaigreencurrywithau_84641", "title": "Curry verde tailandés con berenjena y gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12fl oz / 340ml de arroz basmati", "50g / 2oz de crema de coco", "4 dientes de ajo", "2 chiles verdes frescos grandes o 3 medianos", "Jengibre raíz de cubo 4cm", "20g de cilantro fresco", "1½ cucharada de maní u otro aceite sin sabor", "3 x 2in / 5cm trozos de canela en rama", "6 clavos enteros", "15 granos de pimienta negra", "Anacardos sin sal de 1½ oz / 40g, partidos por la mitad", "2 cebollas medianas, peladas y finamente cortadas", "Guisantes frescos de 4oz / 110g, o congelados y descongelados", "1½ nivel de sal de cucharadita, o al gusto", "15fl oz / 425ml de agua caliente", "2 cucharadas de jugo de lima"], "method": ["Comience por disolver el coco batido en agua hirviendo, luego colóquelo en un procesador de alimentos con ajo, chiles, jengibre y tallos de cilantro, zumbando hasta que todo esté finamente picado.", "Deje esto a un lado mientras que calienta el aceite con un poco de calor en la sartén, luego agregue los palitos de canela, clavos de olor, granos de pimienta y anacardos a la sartén y saltee todo suavemente durante aproximadamente 1 minuto. A continuación, agregue las cebollas y continúe cocinando a fuego medio hasta que se suavicen y adquieran un color dorado pálido, lo que tomará de 8 a 10 minutos. A continuación, agregue el arroz, revuelva una vez y cocine por otros 2-3 minutos. Después de eso, agregue la mezcla de coco, revuelva todo y cocine durante 2-3 minutos más. Ahora agregue los guisantes, la sal y el agua caliente, traiga todo a fuego lento, luego cubra con la tapa. Baje el fuego a fuego lento y deje que todo se cocine muy suavemente durante 8 minutos; usa un cronómetro aquí, y no levantes la tapa.", "Luego retire la sartén del fuego, quite la tapa y cubra la sartén con un paño durante 10 minutos antes de servir. Finalmente, quite los pedazos de canela, espolvoree el jugo de lima y las hojas de cilantro finamente picadas, luego bifurque el arroz suavemente para separar los granos. Adorne con las hojas reservadas de cilantro entero."], "url": "www_bbc_co_uk_food_recipes_thaigreenrice_68034", "title": "Arroz verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]