[{"ingredients": ["Harina normal de 200g / 7oz", "½ cucharadita de sal marina", "2 cucharaditas de semillas de cilantro, agrietadas en mortero", "100 g / 3½ oz de mantequilla, derretida", "100 g / 3½ oz de mantequilla, derretida", "1kg / 2lb 4 oz de mejillones frescos, barba removida, limpiada (deseche cualquier mejillón que no se cierre herméticamente al golpear suavemente)", "150ml / 5fl oz de vino blanco", "2 cucharadas de cilantro fresco finamente picado", "1 pechuga de pato ahumada, sin piel, finamente picada", "200g / 7oz de pan blanco fresco"], "method": ["Para hacer los panes planos, coloque las semillas de harina, sal y cilantro en un tazón grande y gradualmente agregue agua para formar una masa.", "Enrolla la masa en una superficie enharinada y dale forma de rondas.", "Calentar una sartén a fuego medio. Agregue los panes planos a la sartén y cocine a cada lado durante 2-3 minutos. Mantener caliente", "Caliente una cacerola grande a fuego medio. Agregue los mejillones y el vino, cubra y cocine por 2-3 minutos, agitando la sartén de vez en cuando.", "Una vez que los mejillones se hayan abierto, cuela, reservando el licor de cocción. Deseche cualquier mejillón que no se haya abierto por completo.", "Una vez que los mejillones estén lo suficientemente fríos como para manipularlos, quítelos de sus conchas, reservando la mitad de las conchas.", "Coloque el cilantro fresco en un pequeño procesador de alimentos con un poco de licor de cocción y mezcle hasta que quede suave.", "Precalentar la parrilla a alto.", "Coloque las conchas de mejillón en una bandeja para asar y espolvoree un poco del puré de cilantro en cada caparazón y cubra con la carne de mejillón cocida.", "En un tazón, mezcle el pato picado con las migas de pan.", "Espolvoree la mezcla de migas de pan sobre los mejillones y colóquela debajo de la parrilla durante 3-5 minutos.", "Cepille los panes con la mantequilla derretida y sirva con los mejillones."], "url": "www_bbc_co_uk_food_recipes_duck-stuffed_mussels_26303", "title": "Mejillones rellenos de pato ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de azúcar moreno", "100ml / 3½fl oz de vinagre de vino tinto", "500ml / 18fl oz de caldo de pollo", "20 g / oz de mantequilla", "3-4 palitos de ruibarbo, toscamente picados", "2 cucharadas de azúcar moreno", "salpicadura de granadina (opcional)", "2 cucharaditas de cinco especias chinas", "2 cucharaditas de sal", "2 grandes pechugas de pato, recortadas y grasa anotada", "aceite de maní, para freír", "1 chile rojo, picado", "4 pak choi, descuartizado", "salsa de soja, al gusto", "salsa de pescado, al gusto", "50g / 1¾oz de azúcar moreno", "½ palo de ruibarbo, cortado en bastones de 1¾cm / 2in", "20 g / oz de mantequilla"], "method": ["Para la salsa, ponga el azúcar y el vinagre en una cacerola y hierva, luego reduzca el fuego y cocine hasta que empiece a espesarse y caramelizarse. Agregue el caldo de pollo. Cocine hasta que la salsa reduzca su volumen a la mitad. Agregue la mantequilla para terminar la salsa.", "Mientras tanto, para el ruibarbo, coloque las piezas picadas en una sartén con el azúcar, dos cucharadas de agua y granadina, si las usa. Cocine hasta que el ruibarbo se haya suavizado. Dejar enfriar un poco y luego verter en una licuadora y pulsar para formar un puré.", "Para el pato, coloque las cinco especias chinas en un plato junto con una buena pizca de sal. Mezcle y frote los senos de pato con la mezcla.", "Coloque los pechugas de pato, con la piel hacia abajo en una sartén fría. Encienda el fuego y cocine hasta que la piel esté dorada y el pato esté casi cocido. Voltea los senos y retira la sartén del fuego. El pato continuará cocinando con el calor residual de la sartén, pero este método asegura que no se cocinará en exceso. También permite que el pato descanse antes de servir.", "Mientras tanto, para el pak choi, agregue un poco de aceite de cacahuate al wok y saltee la guindilla durante 1-2 minutos. Agregue el pak choi y sofría por otros dos minutos antes de agregar la salsa de soja y el pescado. Cocine por 1-2 minutos, o hasta que el pak choi esté tierno.", "Para la guarnición, simplemente derrita el azúcar en una sartén, agregue los bastones de ruibarbo y la mantequilla, mezcle para cubrir el ruibarbo en el caramelo.", "Para servir, corte los pechugas de pato por la mitad a lo largo y compártalos entre cuatro platos para servir. Adorne el pato con los bastones de ruibarbo, coloque un poco de pak choi y vierta un poco de salsa sobre el pato."], "url": "www_bbc_co_uk_food_recipes_duck__la_rhubarb_67136", "title": "Pato ruibarbo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duck__la_rhubarb_67136_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de papas, sin pelar, cortadas en trozos pequeños", "1 cucharada de grasa de pato (opcional, puede usar 2 cucharadas de aceite de oliva en su lugar)", "1 bulbo de ajo, cortado en clavos", "algunas ramitas de romero", "sal y pimienta negra recién molida", "50g / 1¾oz de azúcar granulada", "12 kumquats, en rodajas, sin pepitas", "200ml / 7fl oz de vino tinto", "1 cucharada de vinagre de vino tinto", "2 chalotes grandes, finamente picados", "Anís de 2 estrellas", "2 naranjas, solo jugo", "500ml / 18fl oz de caldo de pollo", "sal y pimienta negra recién molida", "4 pechos de pato", "dash aceite o grasa de pato", "sal y pimienta negra recién molida"], "method": ["Para las patatas asadas, precaliente el horno a 220C / 200C Ventilador / Gas 7. Coloque las papas en una cacerola y cúbralas con agua fría. Agregue una pizca generosa de sal y deje hervir. Cocine a fuego lento durante 5 minutos, luego drene y deje secar por un minuto.", "Ponga la grasa del pato (o aceite) en una lata grande para asar y caliente en el horno hasta que fume. Agregue las papas y agite la lata para que las papas se cubran bien con grasa o aceite. Sazonar con abundante sal y pimienta.", "Aplastar los dientes de ajo, dejando sus pieles, luego agregar a la lata junto con el romero. Asar en el horno durante unos 30 minutos, revisando y volteando cada cierto tiempo hasta que las papas estén crujientes y doradas alrededor de los bordes. El ajo puede cocerse antes, en cuyo caso, quítelo y déjelo a un lado hasta que las papas estén cocidas.", "Para hacer la salsa, ponga el azúcar y 50 ml / 2 fl oz de agua en una olla y cocine a fuego lento, revolviendo regularmente, hasta que el azúcar se haya disuelto. Agregue los kumquats y cocine a fuego lento durante unos 5 minutos hasta que los kumquats estén tiernos. Retire los kumquats del jarabe y reserve.", "Suba el fuego y hierva el almíbar hasta que tome el color del caramelo. Agregue el vino tinto, el vinagre de vino tinto, los chalotes y el anís estrellado y vuelva a hervir. Cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el jugo de naranja y el caldo de pollo.", "De nuevo, cocine a fuego lento hasta que el volumen de la salsa se haya reducido a la mitad. La salsa debe ser rica y almibarada. Pruebe el condimento y agregue mucha pimienta negra y sal si es necesario. Regrese los kumquats a la salsa y reserve.", "Para el pato, marque un patrón entrecruzado a través de la piel y la grasa de los pechos de pato, deteniéndose justo antes de la carne. Espolvorear con sal y pimienta. Caliente el aceite (o la grasa de pato) en una sartén grande a prueba de horno. Cuando esté cerca del punto de ahumado, agregue los pechugas de pato, con la piel hacia abajo y fríalos hasta que la piel tenga un dorado intenso y una gran cantidad de grasa se haya consumido, alrededor de 6-7 minutos. Voltee y espere otros 4 minutos. Retirar de la sartén y dejar reposar.", "Cuele la mayor parte de la grasa de la sartén, luego vierta en la salsa. Desglasar la sartén y volver a agregar los jugos que puedan haberse acumulado debajo de la grasa filtrada. Finalmente agrega cualquier jugo del pato en reposo. Cocine a fuego lento hasta que esté caliente y muy almibarado, luego sirva la salsa sobre los pechugas de pato en rodajas."], "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_20145", "title": "Pato con naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ naranja grande", "Pato listo para asar entero de 1.8kg / 4lb", "2 cucharadita de sal marina en copos, más extra para sazonar", "2 hojas de laurel", "½ cebolla, cortada en cuatro cuñas", "pimienta negra recién molida", "½ cebolla, pelada y finamente cortada", "4 cucharadas de licor de naranja, como Cointreau", "75ml / 2½fl oz de vino tinto", "1½ naranjas grandes, solo jugo recién exprimido (alrededor de 150 ml / 5 fl oz)", "3 cucharadas de mermelada de naranja", "2 cucharaditas de harina de maíz (si quieres una salsa más fina solo usa 1 cucharadita)"], "method": ["Precalentar el horno a 210C / 400F / Gas 6½. Use un pelador de verduras para despegar la piel de la media naranja en tiras anchas. Coloque una pila de tres tiras una encima de la otra y corte los lados. Corta las tiras en julianas muy delgadas. Dejar de lado.", "Pincha la piel de pato con la punta de un pincho para ayudar a liberar la grasa. No pinches demasiado. Coloque en un estante ubicado dentro de una lata de asar mediana y resistente. Coloque la mitad naranja dentro del pato, empujando hacia el extremo del cuello para ayudar a sostener el pecho. Agregue las hojas de laurel y las cuñas de cebolla. Sazonar el pato con la sal y mucha pimienta negra recién molida. Asar por 45 minutos.", "Saque el pato del horno y retire con cuidado el estante de la lata de asar con guantes para hornear. Incline cualquier grasa que se haya acumulado en la lata en un recipiente resistente al calor. (Enfríe, luego guárdelo en una olla en el refrigerador y úselo para asar o patatas salteadas.) Vuelva a colocar la parrilla en la lata y devuelva el pato al horno durante 35-45 minutos más o hasta que la piel esté dorada. y crujiente.", "Retire el pato del horno y mueva una de sus patas. Si el pato está listo, la pierna estará bastante floja y fácil de mover. De lo contrario, devuelva el pato al horno por otros 10 minutos o hasta que esté cocido. Transfiera a una tabla o bandeja de servir caliente. Cubre muy ligeramente con papel de aluminio y déjalo reposar durante 15 minutos.", "Mientras el pato está en reposo, prepare la salsa. Escurre todas menos una cucharada de grasa de pato de la lata de asar en el recipiente resistente al calor con el resto. Regrese la lata al fogón y agregue la cebolla. Freír a fuego medio durante cinco minutos, revolviendo regularmente hasta que comiencen a suavizarse y colorearse.", "Vierta el licor de naranja y el vino en la sartén con la cebolla suavizante y deje que burbujee durante unos segundos. Agregue el jugo de naranja y 150ml / 5 fl oz oz de agua fría y cocine a fuego lento durante unos dos minutos, revolviendo para levantar cualquier sedimento de carne del fondo de la lata. Con cuidado cuele el líquido a través de un colador fino en una pequeña olla antiadherente.", "Mezcle las tiras de naranja juliana reservadas y la mermelada en el jus y cocine a fuego lento. Mezcle la harina de maíz con una cucharada de agua fría en un tazón pequeño hasta que quede suave. Revuelva en la salsa de naranja y cocine durante 1-2 minutos más, revolviendo regularmente hasta que la salsa esté espesa y brillante. Vierta los jugos que se han recogido del pato en la salsa y cocine a fuego lento durante unos segundos, revolviendo. Vierta en una jarra calentada. Tallar el pato en la mesa con una rodaja de cebolla para cada persona, verter un poco de la salsa y servir el resto por separado."], "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_58409", "title": "Duck a l'orange", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb Patatas blancas de 4 oz, peladas y cortadas en cuartos", "4 dientes de ajo ahumados, pelados y dejados enteros", "150ml / 5fl oz de leche entera", "Mantequilla de 110ml / 3½fl oz, ablandada", "2 vainas de cardamomo verde, rotas", "2 cucharadas de azúcar en polvo", "2 cucharadas de mantequilla sin sal", "4 zanahorias jóvenes y dulces con hojas cortadas por la mitad, dejan una pequeña cantidad de tallo verde en el extremo", "1 manojo de hojas de acelga, separadas y tallos finamente picados", "25 g / 1oz de mantequilla sin sal", "1 diente de ajo", "Crema doble 250ml / 9fl oz", "100g / 3½oz de pan rallado", "Queso parmesano 100 g / 3½ oz, rallado", "50 g / 1 oz de azúcar en polvo", "2 naranjas, cáscara y jugo solamente", "2 cucharadas de vinagre de vino blanco", "350ml / 12fl oz de caldo de pollo", "2 cucharadas de aceite de oliva", "4 pechos de pato, recortados y anotados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las papas en una olla y cubra con agua fría. Caliente a fuego lento y cocine durante 15-20 minutos, o hasta que las papas estén suaves. Escurrir y luego poner a través de un ricer de patata o trituradora en la sartén.", "Mientras tanto, ponga el ajo ahumado en una cacerola mediana con la leche y cocine por 10 a 15 minutos, cuele y retenga la leche. Agregue la leche y la mantequilla a las papas y mezcle hasta que tenga un puré de patatas muy húmedo. Ponga a un lado hasta que esté listo para servir.", "Para hacer las zanahorias glaseadas, coloque una lata de asar en la placa. Una vez caliente, agregue el cardamomo, el azúcar y la mantequilla y derrita. Agregue las zanahorias y colóquelas en el horno por 30 minutos.", "Para la crema de acelga, coloque una olla de agua sobre la placa, llénela con agua y deje que hierva.", "Blanquee las hojas y los tallos por separado, drene cada uno y revuelva en agua fría para mantener el color.", "Calentar una sartén honda que cabe en el horno, agregar la mantequilla y freír el ajo. Agregue la crema y la acelga. Cocine por 4-6 minutos, o hasta que el volumen de crema se haya reducido.", "En un tazón mediano, mezcle las migas de pan y el queso parmesano. Espolvorea esta mezcla sobre la parte superior de la acelga y colócala en el horno durante 20 minutos, o hasta que la parte superior esté dorada.", "Para hacer la salsa, coloca el azúcar en una sartén mediana y caliéntala. Una vez que se convierte en un caramelo, agregue la ralladura de naranja y el jugo, el vinagre de vino blanco y el caldo y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Caliente una sartén grande a prueba de horno y agregue el aceite. Una vez caliente, agregue el pato con la piel hacia abajo y cocine durante cuatro minutos. Dar la vuelta al pato y colocar en el horno durante ocho minutos.", "Para servir, coloca una cuchara de las papas en cada plato. Corta el pato en un ángulo y coloca la mitad sobre el puré. Siente un montón de acelga al lado y las zanahorias del otro lado en forma de cruz. Vierta la salsa de naranja sobre el pato."], "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_with_56899", "title": "Pato a la naranja con puré de ajo ahumado, zanahorias glaseadas con cardamomo y acelga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "10 g / ½ oz de azúcar en polvo", "15 g / ½ oz de levadura fresca, desmenuzada", "pellizcar bicarbonato de soda", "30g / 1oz de grasa de pato", "Pan rallado de 20g / ¾oz panko", "20 g / oz de mantequilla", "20g / ¾oz de hongos shiitake", "2 cucharaditas de salsa de soja ligera", "dash salsa Tabasco", "1 cucharadita muere", "1 cucharadita de vinagre de vino de arroz", "300ml / 10fl oz de caldo de pollo", "Corazones de pato 150 g / 5½ oz, en rodajas", "20g / ¾oz de pechuga de pato ahumada, en rodajas finas", "50ml / 2fl oz de vinagre de jerez", "1 cucharadita de extracto de levadura", "200 ml / 7 fl oz demi-glace", "sal marina", "150g / 5½oz de queso de cabra firme", "Lechuga iceberg 10g / ½oz"], "method": ["Engrase ligeramente el interior de los seis anillos de crumpet.", "Para hacer los bollos, tamice la harina, agregue el azúcar en un tazón. Disuelva la levadura en 270ml / 9fl½ oz de agua tibia. Haga un pozo en el centro de la harina y agregue la mezcla de levadura. Incorpore gradualmente la harina en el centro y bata hasta que tenga una masa suave. Permita descansar por 1 hora.", "Agregue el bicarbonato de soda a la mezcla y mezcle otros 90 ml / 3 fl oz de agua.", "Coloque los anillos en una sartén de plancha colocada a fuego medio. Llena tres cuartas partes con la masa. Cocine los bollos por 4 minutos, luego quite los anillos. Debería haber una gran cantidad de agujeros muy pequeños en la superficie.", "Dé la vuelta a los bollos y cocínelos hasta que luzcan de color. Quita la plancha y deja enfriar.", "Calentar un poco de grasa de pato en una sartén y freír las migas de pan hasta que estén doradas. Escurrir sobre papel de cocina y sazonar con sal.", "Calentar la mantequilla en una sartén y freír el shiitake. Agregue la soja, salsa Tabasco, mirin, vinagre de vino de arroz y caldo.", "Calentar un poco de grasa de pato en una sartén y freír los corazones de pato durante 2-3 minutos, o hasta que esté bien cocido. Desglasar la sartén con el vinagre de jerez y luego agregar el extracto de levadura demi-glace. Deje burbujear hasta que tenga una salsa suave.", "Divida los bollos entre cuatro platos. Cubra con corazones de pato y hongos shiitake y vierta sobre la salsa de pato. Cubra con rebanadas de pechuga de pato ahumado, virutas de queso de cabra y hojas de lechuga. Espolvorear con las migas de pan y servir."], "url": "www_bbc_co_uk_food_recipes_duck_and_crumpets_24221", "title": "Pato y bollos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechos de pato, con la piel puesta", "75ml / 2½fl oz de aceite vegetal", "75ml / 2½fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "2 limas, solo jugo", "3 dientes de ajo, rallados", "1 chile rojo, finamente picado", "Jengibre fresco de 3cm / 1in, rallado", "2 hongos de campo grandes, cada uno cortado en 6 pedazos", "1 cabeza grande de brócoli, rota en grandes floretes", "1 pimiento verde, sin semillas y cortado en cuadrados", "2 cebollas rojas, cada una cortada en 8 trozos", "8 tallos de limoncillo"], "method": ["Marque la piel de la pechuga de pato con un cuchillo afilado (no corte en la carne). Corte las líneas a unos 5 mm de distancia con un ligero ángulo, luego corte en la otra dirección para formar formas de diamante en la piel.", "Coloque los senos con la piel hacia abajo en una sartén seca y antiadherente a fuego medio. Lentamente cocine durante unos 5-10 minutos, o hasta que la grasa se haya formado del seno y se haya filtrado en la sartén. Cuando la piel esté dorada y crujiente, retire las pechugas de pato y escurra sobre papel de cocina. Deje que se enfríe, luego coloque en el refrigerador hasta que lo necesite.", "Para hacer un adobo, mezcle el aceite, la salsa de soja y la miel en un tazón. Agregue el jugo de lima, el ajo, el chile y el jengibre rallado y vuelva a mezclar.", "Corte el pato en 12-16 cubos de tamaño uniforme, luego perfore cada pedazo de pato y las verduras con un pincho. Ensartarlos en los tallos de la hierba de limón, tratando de no poner los mismos ingredientes uno al lado del otro. Cuando los ocho tallos de limoncillo estén llenos, colóquelos en un recipiente de plástico y vierta sobre el adobo. Coloque los kebabs en la nevera para marinar durante al menos dos horas, pero durante la noche estará bien.", "Retire los pinchos de la nevera 30 minutos antes de que desee cocinarlos. Caliente una sartén o barbacoa hasta que esté caliente.", "Coloque los kebabs en la sartén o parrilla de la plancha caliente. Hilvalos con el adobo cada 3-4 minutos, volteándolos frecuentemente para que se cocinen uniformemente. Cocine durante aproximadamente 8-10 minutos, luego retírelo del fuego y déjelo reposar de 4 a 5 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_duck_and_lemongrass_18615", "title": "Kebabs de pato y lemongrass", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 8 pinchos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cadáveres de pato (preferiblemente orgánicos)", "1 cebolla grande, más o menos picada", "2 puerros, más o menos picados", "2 palitos de apio, más o menos picados", "3 zanahorias, 2 toscamente picadas, 1 rallada", "2 hojas de laurel frescas, rotas", "2 chalotes de plátano, finamente picados", "50g / 1¾oz de hojas de acedera, en rodajas", "1 eneldo pequeño de racimo, toscamente picado", "4 cebollas de primavera, en rodajas finas", "6 huevos de codorniz duros, partidos por la mitad", "micro acedera roja veteada o verde (opcional)"], "method": ["Para hacer el caldo, coloque las canales de pato, la cebolla, el puerro, el apio, las zanahorias picadas y las hojas de laurel en una olla muy grande y vierta sobre agua fría hasta que los cuerpos estén cubiertos. Llevar a ebullición, rociar cualquier espuma que naturalmente llega a la superficie y bajar la temperatura. Cocine a fuego lento durante 2 horas, o hasta que el líquido se haya reducido a la mitad y el caldo sea rico y fragante.", "Retire los cadáveres de la sartén, retire la carne y reserve, descartando los huesos.", "Cuele el caldo en un tazón grande a través de un colador y deseche las verduras. Sazonar bien el caldo.", "Saque una cucharada de la grasa de pato del caldo y colóquelo en una sartén a fuego alto durante aproximadamente un minuto o hasta que el agua se haya evaporado, dejando solo la grasa. Agregue los chalotes y cocine durante 5 minutos o hasta que estén blandos. Agregue las zanahorias ralladas y cocine a fuego medio hasta que estén suaves y comience a caramelizar. Incline las verduras fritas en el caldo y revuelva bien.", "Para servir, ponga un poco de la carne reservada en el fondo de cada tazón, vierta sobre el caldo y cubra con el resto de los ingredientes."], "url": "www_bbc_co_uk_food_recipes_duck_and_sorrel_broth_30291", "title": "Caldo de pato y sorrel (borscht verde)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de champiñones secos o porcini secos", "2 cucharadas de pimienta negra molida", "1 cucharada de hierbas de Provenza (generalmente mejorana, orégano, romero, tomillo)", "3 pechos de pato", "6 calabacines jóvenes", "sal", "½ cebolla, finamente picada", "2 cucharadas de menta, finamente triturada", "1 limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Mezcle los champiñones secos en un procesador de alimentos hasta que estén finamente molidos, luego combínelos con la pimienta negra y las hierbas de Provenza.", "Corta las pechugas de pato longitudinalmente en rodajas de 3 mm / 1/8 pulgadas de grosor.", "Cortar tres de los calabacines jóvenes en rodajas finas con un pelador de verduras.", "Ensamble los tournedos dividiendo las rebanadas de pato en seis porciones. Para cada porción, coloque dos rebanadas de pechuga de pato uno al lado del otro, y apile el resto de las rebanadas para esa porción en la parte superior, alternando capas de grasa y carne magra.", "Divida las tiras de calabacín en seis porciones. Para cada porción, coloque las tiras de calabacín sobre el pato, sazone con el hongo en polvo y sazone con sal.", "Enrolle las rodajas de pato y las tiras de calabacín con fuerza para hacer tournedos y atar con una cuerda, para mantener la forma del cilindro en su lugar.", "Haz seis tournedos de esta manera.", "Cocine suavemente en la barbacoa o en la sartén de la plancha, durante cinco minutos por cada lado.", "Pique finamente los calabacines restantes y mezcle con la cebolla, la menta, el jugo de limón y el aceite de oliva.", "Para servir, corte los tournedos en rodajas gruesas y colóquelos en platos para servir con la ensalada."], "url": "www_bbc_co_uk_food_recipes_duck_breast_and_zucchini_65488", "title": "Tournedos de pechuga de pato y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de polvo de curry suave", "1 cucharadita de jengibre molido", "1 cucharadita de polvo chino de cinco especias", "2 cucharaditas de pimienta del Pacífico", "4 pechos de pato de 175g / 6oz", "4 cucharadas de miel", "1 cabeza de bok choi, raíz eliminada, hojas separadas", "Jengibre de raíz 3cm / 1¼in, pelado, finamente cortado en cubos", "1 diente de ajo, aplastado", "1 chile rojo, finamente cortado", "½ cebolla roja, finamente rebanada", "Ciruelas umeboshi de 200 g / 7 oz, piedras extraídas (disponible en tiendas de alimentos saludables y especialistas en línea)"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "En un tazón, mezcle el polvo de curry, jengibre molido, cinco especias chinas y pimienta sansho. Aparte una cucharadita de la mezcla de especias para las ciruelas. Espolvorea el resto de la mezcla de especias sobre la piel y la carne de los pechugas de pato.", "Coloque las pechugas de pato, con la piel hacia abajo, en una sartén grande, fría, antiadherente, a prueba de horno. Encienda el fuego a alta y déjelo durante 3-4 minutos, hasta que la cacerola esté caliente y la grasa se haya secado.", "Voltee los pechos de pato y rocíe la mitad de la miel sobre las pieles. Transfiera la sartén al horno y tueste los pechugas de pato durante 8-10 minutos (por el medio) o por más tiempo hasta que se cocinen a su gusto, rociando las pechugas de pato con los jugos de la sartén hasta la mitad de la cocción.", "Cuando el pato esté cocido a su gusto, retírelo de la sartén y póngalo a un lado para descansar sobre un plato caliente durante 8-10 minutos.", "Mientras tanto, cocine al vapor las hojas de bok choi con el jengibre, el ajo, el chile y la cebolla roja en un vapor suspendido sobre una sartén con agua a fuego lento durante 5-6 minutos, o hasta que esté marchito y tierno.", "Mezcle las ciruelas en un puré fino con 1 cucharadita de la mezcla de especias restante y toda la miel restante, usando un procesador de alimentos o una licuadora de mano. Caliente la mezcla en una olla pequeña y luego agréguela a los jugos que se liberan del pato. Sazonar con más miel si es necesario.", "Para servir, divida las verduras al vapor por igual entre cuatro platos para servir. Talla los pechos de pato en rebanadas gruesas y colócalos al lado. Termine con una cucharada de salsa umeboshi."], "url": "www_bbc_co_uk_food_recipes_duck_breast_with_30241", "title": "Pechuga de pato con salsa de umeboshi y bok choi al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pato pequeñas (aproximadamente 140 g / 5 oz cada una)", "1 cucharada de aceite", "botón de mantequilla", "2 manzanas de postre, peladas, sin corazón y cortadas en finas tiras", "Calvados 100ml / 3½fl oz", "200ml / 7fl oz de jugo de manzana, más una cucharada extra", "100 ml / 3½ fl oz de caldo de pollo", "1 cucharada de harina de maíz integral", "sal y pimienta negra recién molida"], "method": ["Retire la piel de las pechugas de pato y sazone bien con sal y pimienta en ambos lados. Calentar el aceite en una sartén grande y freír los pechos durante cuatro minutos por cada lado. Retire de la sartén y reserve para descansar.", "Agregue un trozo grande de mantequilla a la sartén y agregue las astillas de manzana. Cocine durante 4-5 minutos, moviéndose con regularidad, o hasta que esté bien cocido y dorado, pero no blanda. Retire de la sartén y reserve para descansar.", "Desglasar la sartén con los calvados y llevar a ebullición. Deje burbujear hasta que el volumen de líquido se haya reducido a la mitad.", "Agregue el jugo de manzana y el caldo y la burbuja para reducir nuevamente el volumen del líquido a la mitad. Vierta los jugos de reposo del pato.", "Agregue la harina de maíz a un recipiente con una cucharada de jugo de manzana. Vierta un poco de líquido caliente de la sartén y revuelva hasta que quede suave.", "Vierta la mezcla de harina de maíz en la sartén y revuelva hasta que quede suave. Llevar a ebullición a espesar un poco y sazonar con sal y pimienta. Regrese las rebanadas de manzana a la sartén para que se caliente y deje que todo se cocine a fuego lento durante 1 minuto.", "Divida las rebanadas de manzana entre cuatro platos. Corta los pechugas de pato en la diagonal y colócalos en la parte superior de la manzana. Rocíe con la salsa y sirva."], "url": "www_bbc_co_uk_food_recipes_duck_breast_with_52263", "title": "Pechuga de pato con calvados y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 piernas de pato confitadas", "2 cucharadas de grasa del pato confitado", "2 dientes de ajo, finamente picados", "1 chalote grande, finamente picado", "2 cucharadas de hojas de romero fresco toscamente picadas", "Tocino panceta 50g / 1oz", "1 hoja de laurel", "400 g de frijoles cannellini, escurridos", "¼ col de hispi, finamente triturada", "275ml // 9fl oz de caldo de pollo", "100g / 3½oz de mantequilla sin sal", "1 cucharada de perejil fresco de hoja plana picada", "2 cucharadas de miel líquida", "4 x pequeños pechos de pato, con la piel encendida", "Jus de pato 200ml / 7fl oz, para servir"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cortar las patas de pato por la mitad. Tritura la carne de la mitad superior y reserva.", "Caliente una cazuela y agregue la grasa de pato, una vez caliente agregue el ajo, la chalota y el romero y cocine por 2-3 minutos.", "Agregue la panceta y cocine por un minuto hasta que quede crujiente.", "Agregue la hoja de laurel, los frijoles, el repollo y el caldo de pollo, una vez caliente agregue la mantequilla y mezcle hasta que forme una emulsión.", "Termine con el perejil y la carne de pierna de pato rallada.", "Para la pechuga de pato asada, caliente una sartén a prueba de horno y coloque la pato con la piel hacia abajo y cocine durante 4-5 minutos hasta que estén doradas y crujientes, y voltee.", "Transfiera al horno por 4-6 minutos.", "Permita descansar por lo menos 8 minutos antes de rebanar y servir.", "Calentar una sartén pequeña y agregar un poco de aceite; una vez caliente, agregar la pata de pato recortada y la miel y cocinar durante 1-2 minutos o hasta que estén doradas.", "Para servir, coloque el cassoulet de pato confitado en el centro de un plato y cubra con la pechuga de pato rebanada y la pata de pato glaseada con miel. Viste el plato con el pato jus."], "url": "www_bbc_co_uk_food_recipes_duck_breast_with_confit_69482", "title": "Pechuga de pato con cassoulet de pato confitado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ manojo de remolachas heredadas del bebé, limpiadas y recortadas, hojas reservadas", "200ml / 7fl oz de vinagre de vino blanco", "75 g / 2½ oz de azúcar en polvo", "1 cucharadita de sal", "½ cucharadita de pimienta negra", "75g / 2½oz de mantequilla sin sal", "100g / 3½oz de mantequilla sin sal", "1 cebolla roja, finamente picada", "½ repollo rojo, sin corazón y finamente cortado", "200ml / 7fl oz de vinagre de vino tinto", "50g / 1¾oz de miel clara", "Azúcar demerara 100 g / 3½ oz", "1 hoja de laurel", "Anís de 2 estrellas", "1 ramita de canela", "sal", "600 g / 1 libra de remolacha cruda de 5 oz, pelada, cortada en trozos", "1 cebolla, más o menos picada", "½ diente de ajo, aproximadamente picado", "2 ramitas de tomillo fresco, solo hojas", "2 manzanas para cocinar (preferiblemente Bramley), peladas, sin corazón y picadas", "50g / 1¾oz de mantequilla", "2-4 cucharadas de azúcar en polvo, al gusto", "4 cucharadas de aceite de oliva", "4 pechugas de pato, recortadas", "col rizada, marchita y untada con mantequilla", "jus o salsa"], "method": ["Para la remolacha asada, coloque la remolacha en una olla grande de agua hirviendo y cocine durante 15-20 minutos. Escurrir y dejar enfriar un poco. Con cuidado pele las remolachas y córtelas a la mitad.", "Caliente el vinagre de vino blanco, el azúcar, la sal y los granos de pimienta en una sartén a fuego medio hasta que el azúcar se disuelva. Coloque las hojas de remolacha reservadas en un recipiente y vierta sobre la mezcla de vinagre caliente. Mezcle, cubriendo las hojas. Déjelo a un lado para que quede en salmuera durante al menos una hora, pero preferiblemente durante 24 horas.", "Para la col roja cocida, caliente una sartén grande y agregue la mantequilla. Una vez caliente, agregue la cebolla y cocine por 2-3 minutos, luego agregue el repollo y cocine durante 2 minutos. Agregue el vinagre, la miel, el azúcar y las especias y sazone con sal. Baje el fuego y cocine durante 30-40 minutos, o hasta que el repollo esté muy tierno.", "Para el puré de remolacha, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta obtener un puré.", "Transfiera el puré a una sartén a fuego lento. Cocine por 30-40 minutos, revolviendo ocasionalmente. Condimentar con sal y pimienta.", "Para el puré de manzana, ponga las manzanas para cocinar, la mantequilla y 2-3 cucharadas de agua en una cacerola. Cubra y cocine durante 4-5 minutos, o hasta que las manzanas se hayan descompuesto. Revuelva y sazone con el azúcar y un poco de sal. Apartar y mantener caliente.", "Para el pato, precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente una sartén a prueba de horno hasta que esté muy caliente y agregue el aceite. Agregue las pechugas de pato con la grasa hacia abajo y cocine durante 3-4 minutos, o hasta que estén doradas. Dé vuelta y cocine por 1-2 minutos más. Transfiera al horno por 8-10 minutos. Retire del horno y coloque el pato a un lado para descansar durante 5 minutos.", "Mientras tanto, para terminar la remolacha asada, derrita la mantequilla en una sartén y agregue las remolachas. Cocine por 2-3 minutos o hasta que esté ligeramente dorado.", "Para servir, vista los platos con remolacha y puré de manzana. Coloque la col roja en los platos con la pechuga de pato, la remolacha asada, la col rizada, las hojas de remolacha y la llovizna con jus o salsa."], "url": "www_bbc_co_uk_food_recipes_duck_breasts_with_37538", "title": "Pechugas de pato con remolacha, manzana y col roja estofada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 grandes pechos de pato", "2 cucharadas de queso Vacherin, recogido del medio", "2 chalotes de plátano, pelados y cortados en tiras finas", "1 cucharada de mantequilla", "250 g / 9 oz de champiñones girolle, limpiados", "2 bollos de brioche", "aceite vegetal, para freír", "2 patatas King Edward, limpias y descascadas"], "method": ["Para la hamburguesa de pato, quite aproximadamente dos tercios de la grasa de cada pechuga de pato y luego córtela en trozos y pásela a través de una picadora. Sazone bien la carne y forme dos bolas usando sus manos.", "Tome una bola de carne y empuje una bola de Vacherin en el centro. Forme la carne alrededor del Vacherin y palmee un poco para hacer una forma clásica de hamburguesa. Repita con la bola restante y la bola de queso.", "Precaliente el aceite en una freidora a 160C / 325F (PRECAUCIÓN: el aceite caliente puede ser peligroso: no lo deje desatendido).", "Enjuague las patatas desportilladas con agua corriente fría para eliminar el exceso de almidón. Sécalo bien con una toalla de té limpia y luego ponlo en el aceite caliente para cocinar durante unos 8-10 minutos. Las fichas deben comenzar a colorear ligeramente en el exterior y ser lo suficientemente suave como para aplastar entre los dedos.", "Retire con cuidado las virutas del aceite con una espumadera y escurra sobre un plato forrado con papel de cocina. Aumente la temperatura del aceite a 180C / 350F", "Mientras tanto, caliente una sartén a fuego alto. Una vez caliente, agregue las hamburguesas y fría por 3-4 minutos por cada lado hasta que estén bien cocidas en cada lado y cocinadas en el medio. Si le gusta la hamburguesa completamente cocida, colóquela en un horno caliente durante unos minutos para terminar. De lo contrario, coloque las hamburguesas en un plato para descansar.", "Coloque los chalotes en rodajas en la plancha caliente para caramelizar. Cocine por unos dos minutos.", "Caliente la mantequilla en una sartén por separado a fuego alto. Agregue los champiñones y fríalos durante 3-4 minutos, o hasta que se ablanden.", "Cuando esté listo para comer, agregue las virutas al aceite caliente y cocínelas por 2-3 minutos, o hasta que estén doradas y crujientes. Retire y escurra en un plato forrado con papel de cocina.", "Sirva las hamburguesas de pato con chalotas y champiñones en un bollo de brioche."], "url": "www_bbc_co_uk_food_recipes_duck_burger_and_chips_40267", "title": "Pato hamburguesa y patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duck_burger_and_chips_40267_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pato confitadas listas para usar", "1 cabeza de lechuga romana (o lechuga firme, similar), raíz cortada, hojas cortadas en rodajas gruesas de 2.5cm / 1 in", "1 pechuga de pato ahumada, en rodajas", "75g / 2¾oz azúcar moreno claro", "pizca de cayena", "100g / 3½ oz de pacanas", "pizca de sal", "75g / 2¾oz de gorgonzola, más o menos picada", "50g / 1¾ozmild, queso azul cremoso como St Agur, aproximadamente picado", "1 diente de ajo, finamente picado", "2 cucharadas de miel", "50ml / 2fl oz de suero de leche", "60g / 2¼ oz de crema fresca", "1 limón, solo jugo", "dash Tabasco", "2 guiones de salsa Worcestershire", "1 cucharada de vinagre de vino tinto", "75g / 2¾oz de mayonesa lista para usar", "sal y pimienta negra recién molida"], "method": ["Para el pato, precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque las patas de pato confitadas en una bandeja para hornear en el horno durante 10 minutos para calentarlas.", "Mientras tanto, para las pacanas caramelizadas, caliente una sartén a fuego alto hasta que esté caliente. Agregue el azúcar y la pimienta de cayena y cocine sin revolver hasta que el azúcar se haya derretido (agite la sartén cuidadosamente de vez en cuando si cree que el azúcar comenzará a arder).", "Cuando el azúcar comience a derretirse, agregue 50ml / 2fl oz de agua y agite la sartén para combinar (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado).\r\n Continúe cocinando a fuego alto hasta que el azúcar se derrita hasta obtener un caramelo de color profundo, luego agregue las nueces y la sal y revuelva para cubrirlas con el caramelo.", "Transfiera las pacanas caramelizadas a una bandeja de asar, luego hornee en el horno durante 4-5 minutos.", "Mientras tanto, para la ensalada de queso azul, en un tazón grande, batir la gorgonzola y St Agur hasta que se rompa un poco, luego mezcle el ajo, la miel, el suero de leche y la nata fresca hasta que estén bien combinados.", "Agregue el jugo de limón, Tabasco, salsa Worcestershire, vinagre y mayonesa hasta que estén bien combinados, luego sazone al gusto con sal y pimienta negra recién molida.", "Cuando las patas de pato confitadas se hayan calentado, quítelas y las pacanas caramelizadas del horno y déjelas a un lado hasta que estén lo suficientemente frías como para que se puedan manipular. Triture la carne de pato del hueso.", "Para servir, apile las hojas de lechuga rebanadas en un plato de servir y rocíe sobre el aderezo de queso azul. Cubra con la pierna de pato confitado rallado, rodajas de pato ahumado y las pacanas caramelizadas."], "url": "www_bbc_co_uk_food_recipes_duck_confit_with_85583", "title": "Confit de pato con ensalada de pato ahumado, nueces caramelizadas y aderezo de queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "1 ramita de tomillo fresco", "½ diente de ajo, finamente picado", "1 hoja de laurel", "puñado de setas silvestres, cortado en 2cm / ¾oz en pedazos", "100 ml / 3½ fl oz de vino blanco seco", "150ml / 5fl oz de crema doble", "2 huevos de pato", "20g / ¾oz Gruyère, finamente rallado", "sal marina y pimienta negra recién molida", "6-10 rebanadas de trufa, para adornar (opcional)", "4 g de levadura fresca", "Yogur natural de 40 g / 1½ oz", "Harina normal de 200g / 7oz", "½ cucharadita de polvo de hornear", "½ cucharadita de sal", "aceite de oliva, para engrasar"], "method": ["Para hacer el pan, coloque la levadura y el yogur en un recipiente, agregue 120 g / 4½ oz de agua a temperatura ambiente y mezcle. Dejar de lado por 10 minutos.", "En un tazón más grande por separado, mezcle la harina, el polvo de hornear y una cucharadita de sal juntas. Agregue la mezcla de agua a la mezcla de harina y mezcle uniformemente. Amasar durante 5 minutos en el tazón; la masa debe estar mojada. Cubra con un paño húmedo y déjelo durante aproximadamente 2 horas.", "Elimine el aire de la masa y divídalo en cuatro bolas de 120 g / 4oz. Engrase una bandeja para hornear grande, coloque las bolas de masa espaciadas y cúbralas con una toalla de té. Déjala probar durante 10-15 minutos.", "Precalentar el horno a 200C / Fan 180C / Gas 6. Pat las bolas de masa ligeramente hacia abajo para formar una superficie plana de unos 15 cm de diámetro. Hornee durante 12 a 15 minutos (si lo prefiere, puede cocinar en una sartén a la plancha ligeramente engrasada a fuego medio durante 2-3 minutos en cada lado). Dejar de lado.", "Para cocinar los huevos en cocotte, reduzca la temperatura del horno a 180 ° C / Fan 160 ° C / Gas 4. Mantee dos moldes de 100 ml / 31/2 fl oz o cocottes individuales. Calentar el aceite en una olla y cocinar los chalotes, el tomillo, el ajo y la bahía hasta que se ablanden. Agregue los champiñones y cocine por 5 minutos. Vierta el vino y cocine a fuego lento hasta que se reduzca en tres cuartas partes. Vierta la crema y cocine hasta que se reduzca a la mitad. Condimentar con sal y pimienta.", "Con una cuchara, coloque un cuarto de la salsa de champiñones en el fondo de cada molde, retire el tomillo y el laurel, luego agregue un huevo de pato y cubra con la salsa restante. Hornee durante 3 minutos, o hasta que los blancos hayan comenzado a fraguar. Espolvorea sobre el Gruyère y hornea por 4-8 minutos más, dependiendo de cómo te gusten tus huevos cocinados.", "Cortar el pan en soldados y pan tostado. Adorne las ollas para huevos con la trufa, si las usa, y cómalas inmediatamente con los soldados."], "url": "www_bbc_co_uk_food_recipes_duck_eggs_en_cocotte_68169", "title": "Huevos de pato en cocotte con setas y Gruyère", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de pan blanco, sin costras", "2 patas de pato confitadas, de una lata, 100 g / 3½ oz de grasa reservada", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "125 g / 4½ oz de champiñones silvestres, limpios y en rodajas", "200ml / 7fl oz puerto", "300ml / 10fl oz de caldo de ternera marrón reducido", "55g / 2oz de mantequilla sin sal", "Brotes de flores de 300g / 10½oz"], "method": ["Precalentar el horno a 210C / 190C Fan / Gas 7. Humedezca el pan con algo de la grasa reservada del confit. Use dos de las rebanadas para alinear dos platos de ramekin, asegurándose de que el pan se superpone y está bien presionado en los moldes.", "Caliente un poco de grasa de pato en una cacerola a fuego medio y fría la chalota y el ajo por 3-5 minutos o hasta que se ablanden. Agregue los champiñones y cocine durante 2 minutos.", "Caliente una cacerola pequeña a fuego medio-alto. Vierta en el puerto y reduzca a la mitad. Agregue el caldo y cocine a fuego lento hasta que tenga una salsa pegajosa.", "Retire la piel del pato y vierta la carne en la sartén que contiene los champiñones. Agregue solo la salsa pegajosa para unir y mezclar. Vierta la mezcla en los moldes y selle con las otras dos rebanadas de pan. Hornea por 20 minutos.", "Para las flores de brotes, vierta 100 ml / 3½ fl oz de agua en una olla y caliente. Agregue la mantequilla y, una vez que se haya derretido, agregue los brotes de la flor. Cocine por 2-3 minutos, o hasta que esté marchito y caliente.", "Convierta los Charlottes de los moldes en platos calientes para la cena. Sirva con la salsa pegajosa restante y los brotes de flores."], "url": "www_bbc_co_uk_food_recipes_duck_leg_charlotte_12940", "title": "Pierna de pato Charlottes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 piernas de pato confitadas", "75g / 3oz azúcar moreno claro", "1 pizca de pimienta de cayena", "100 g / 3½ oz nueces de pacana", "pizca de sal", "75 g / 2½ oz de gorgonzola, más o menos picada", "50 g / 1¾oz de queso azul St Agur, aproximadamente picado", "1 diente de ajo, finamente picado", "2 cucharadas de miel", "50ml / 2fl oz de suero de leche", "60g / 2¼ oz de crema fresca", "1 limón, solo jugo", "dash Tabasco", "2 guiones de salsa worcestershire", "1 cucharada de vinagre de vino tinto", "Mayonesa de 75 g / 2½ oz", "1 cabeza de lechuga romana, cortada en rebanadas gruesas de 2.5cm / 1in"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las patas de pato en una bandeja en el horno durante 10 minutos para que se caliente.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue el azúcar y la pimienta de cayena. Cuando las estrellas de azúcar se derritan, agregue 50 ml / 2 de agua y agite para combinar.", "Cocine a fuego alto hasta que el azúcar se convierta en un caramelo de color profundo, luego agregue las nueces y la sal y revuelva para cubrir. Incline sobre una bandeja de asar y coloque en el horno durante cinco minutos mientras prepara el aderezo.", "Ponga la gorgonzola y St Agur en un tazón y bata para romper el queso un poco, luego agregue el ajo, la miel, el suero de leche y la crema fresca y bata bien.", "Agregue el jugo de limón, Tabasco, salsa Worcestershire, vinagre y mayonesa y mezcle bien hasta que estén combinados, luego sazone con sal y pimienta negra.", "Retire el pato y las pacanas del horno y deje que se enfríen lo suficiente como para manipularlas, luego triture el pato del hueso.", "Mezcle la lechuga con un poco del aderezo, lo suficiente para cubrir las hojas, luego agregue el pato rallado y las pacanas y mezcle.", "Acumula un tazón grande y sirve enseguida."], "url": "www_bbc_co_uk_food_recipes_duck_salad_with_blue_19571", "title": "Ensalada de pato con aderezo de queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "1 cucharadita de jengibre fresco rallado", "50 g / 1¾oz de champiñones shiitake frescos o hongos porcini empapados, cortados en rodajas, sin tallos", "50g / 1¾oz de brotes de bambú en conserva, escurridos y cortados en cerillas", "25 g / 1 oz de castañas de agua enlatadas, escurridas, cortadas en tiras pequeñas", "1 cucharada de salsa de soja ligera", "½ cucharada de polvo chino de cinco especias", "30g / 1oz de soja, deben estar muy frescos", "1 cebolleta grande, cortada longitudinalmente", "½ zanahoria pequeña, cortada en fósforos", "2 patas de pato confitadas, carne desmenuzada", "1 cucharada de salsa de ostras", "1 cucharadita de aceite de sésamo tostado", "25-30 envolturas grandes del rollo de primavera, 15x15cm / 6x6in forma cuadrada", "1 huevo mediano de granja, ligeramente golpeado", "aceite vegetal, para freír", "1 cucharada de aceite vegetal", "1 cebolla pequeña, picada", "2 dientes de ajo, aplastados", "1 chile rojo, finamente picado", "1 cucharadita de semillas de hinojo, trituradas", "50g / 1¾oz de azúcar moreno oscuro", "50ml / 2fl oz de salsa de soja oscura", "300 ml / 10 fl oz de ketchup de tomate", "sal y pimienta negra recién molida", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz de vino de arroz", "75ml / 2½fl oz de jugo de toronja", "4 cucharadas de salsa de soja", "1 cucharadita de hojuelas de chile", "Jengibre fresco de la raíz de los 10cm / 4in, finamente rallado", "2 cucharadas de cilantro picado", "4 cebolletas, picadas", "1 chile rojo, cortado en anillos"], "method": ["Para hacer el relleno de los rollitos de primavera, caliente un wok y agregue el aceite. Una vez caliente, agregue el jengibre, los champiñones, los brotes de bambú y las castañas de agua. Cocine por un par de minutos.", "Agregue la salsa de soja, polvo chino de cinco especias, brotes de soja, cebolleta y zanahoria. Y cocine por 1 minuto.", "Agregue la carne de pato, la salsa de ostras y termine con el aceite de sésamo tostado. Transfiere a un plato y deja que se enfríe antes de usarlo.", "Para ensamblar los rollitos de primavera, coloque una envoltura de rodillo de resorte de manera que las esquinas apunten hacia arriba, hacia abajo y hacia los lados.", "Cuchara 2 cucharaditas de relleno cerca de la esquina inferior a unos 2 cm del borde. (Asegúrese de que el relleno esté frío pero no demasiado mojado; de lo contrario, el rollo de primavera estará mojado y romperá la envoltura del rollo de primavera).", "Ruede la envoltura sobre el relleno, exprimiendo el aire mientras se aleja rodando. Cuando llegue al medio, traiga las 2 esquinas laterales hacia el centro, asegurándose de que se superponen. Continúa enrollando y metiendo el borde superior y sellándolo con un poco del huevo batido.", "Repita con las envolturas y el relleno del rodillo de resorte restante.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Calentar el aceite a 180C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Freír a fuego lento los rollitos de primavera en lotes durante 5-6 minutos, agitándolos en la freidora hasta que estén dorados. Retire y escurra sobre papel de cocina.", "Para la salsa de inmersión de barbacoa, freír la cebolla y el ajo en el aceite con el chile, las semillas de hinojo y el azúcar. Agregue la salsa de soja y el ketchup y sazone con sal y pimienta.", "Llevar a ebullición y cocine a fuego lento durante unos minutos para combinar los sabores.", "Para la salsa agridulce, coloque todos los ingredientes en una sartén y hierva y cocine hasta que se espese, de 5 a 8 minutos.", "Para servir, coloque los rollitos de primavera en una tabla de servir o en una pizarra y vierta las 2 salsas de inmersión en recipientes separados y sirva al lado. Adorne con cilantro fresco, cebolletas y chile rojo fresco."], "url": "www_bbc_co_uk_food_recipes_duck_spring_rolls_with_84656", "title": "Rollos de primavera de pato con salsas para mojar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pato, separadas en muslo y muslos", "15g / ½ oz de sal de mesa por kilo de patas de pato", "2-3 ramitas de tomillo fresco, solo hojas", "300g / 10½ oz de grasa de pato", "5 cucharadas de perejil de flatleaf tostado", "sal y pimienta negra recién molida", "Anís de 2 estrellas", "1 palitos de canela", "½ cucharadita de pimienta negra", "4 dientes", "½ cucharadita de semillas de comino", "4 pechos de pato, piel anotada", "botón de mantequilla, para freír", "110ml / 3½fl oz de vino tinto", "250ml / 9fl oz de caldo de carne", "50g / 1¾oz de mantequilla", "100g / 3½oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "2 chalotes, enteros", "1 pera, cortada en cuñas", "1 cabeza de acelga, en rodajas"], "method": ["Para el pato, pese las piernas y los muslos del pato y colócalos sobre una sábana de film transparente. Espolvorear con 15 g / ½ oz de sal por kilo y el tomillo. Envuelva en film transparente y coloque en la nevera durante la noche.", "Al día siguiente, caliente una olla pesada hasta que esté tibia y agregue las patas de pato y los muslos de pato y suficiente grasa de pato para cubrir totalmente la carne.", "Llevar la grasa a fuego lento y cocinar durante aproximadamente 2 horas y media, o hasta que esté muy tierna. Retire con cuidado las patas de la grasa y colóquelas en una bandeja para hornear, drene y reserve el exceso de grasa.", "Retire la piel de las patas de pato y reserve.", "Retire la piel, los huesos y los tendones del muslo y deséchelos. Coloque la carne del muslo en un tazón y mastique con un tenedor. Poco a poco agregue aproximadamente la mitad de la grasa de pato. Agregue el perejil picado y sazone con sal y pimienta negra recién molida.", "Coloque un trozo de película adhesiva en un tablero y coloque la mezcla de pato en una línea gruesa, organice en forma de salchicha y enrolle la película adhesiva como una galleta de Navidad. Gire los extremos y colóquelos en la nevera durante al menos dos horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las especias en una sartén seca y caliente hasta que las especias comiencen a oler y revientan en la sartén.", "Coloque en un molinillo de especias y moler hasta que se forme un polvo. Espolvorea la pechuga de pato con el polvo de especias.", "Caliente una sartén grande a prueba de horno hasta que esté a fuego medio, luego agregue la pechuga de pato, con la piel hacia abajo y cocine a fuego lento durante 4-5 minutos, o hasta que la grasa se haya extraído del pecho. Es posible que deba hacer los senos en lotes si la sartén no es lo suficientemente grande.", "Encienda el fuego y revuelva por un minuto, antes de dar vuelta y colocar en el horno durante 6-8 minutos.", "Retirar del horno y dejar reposar, cubrir y en un lugar cálido, durante cinco minutos.", "Mientras tanto, saca la mezcla de pato de la nevera y corta.", "Caliente una sartén grande y agregue la mantequilla, una vez caliente agregue las rebanadas de pato y las patas confitadas reservadas y cocine ambos lados hasta que estén doradas.", "Para la salsa, caliente una cacerola, agregue el vino tinto y cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo de carne y vuelva a hervir.", "Reduzca la cantidad de líquido a la mitad nuevamente, luego bata la mantequilla y sazone con sal y pimienta negra recién molida. Mantener caliente", "Para las peras y los chalotes asados, precaliente el horno a 220C / 425F / Gas 7.", "Caliente la mitad de la mantequilla y todo el aceite en una sartén limpia, pequeña y resistente al horno. Agregue los chalotes y las peras, revuelva bien, luego transfiera al horno y tueste por 15 minutos, o hasta que esté cocido y tierno.", "La otra mitad de la mantequilla agrega a una sartén por separado y agregue la acelga agregue un poco de agua y cocine hasta que se marchite.", "Para servir, coloque la acelga marchita sobre los platos, talle la pechuga de pato en rodajas en diagonal y colóquela sobre la acelga. Coloque un muslo asado en el plato junto con los discos de pato. Coloque las peras asadas y las chalotas al lado del pato y rocíe con la salsa de vino tinto."], "url": "www_bbc_co_uk_food_recipes_duck_three_ways_with_24881", "title": "Pato de tres maneras con peras asadas, chalotes, acelga marchita y una reducción de vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]