[{"ingredients": ["1 mazorca de maíz dulce, cortada en cuatro pedazos", "aceite de oliva", "sal y pimienta negra recién molida", "4 cebollas de primavera", "50ml / 2fl oz de vino blanco", "2 yemas de huevo de gallinas camperas", "150ml / 5½ fl oz crema doble", "pizca de cayena", "55g / 2oz de carne de cangrejo blanca"], "method": ["Para el maíz asado a la parrilla, rocíe los trozos de mazorca de maíz en aceite de oliva y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y cocine el maíz por 4-5 minutos. Agregue las cebolletas y la plancha hasta que estén doradas por todos lados. Retire de la sartén y colóquelo en un pequeño plato gratinado.", "Para el gratinado, coloque el vino blanco, las yemas de huevo y la crema en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento y bata constantemente hasta que la mezcla comience a espesarse.", "Retire del fuego y vierta la salsa sobre las verduras a la brasa en el plato. Espolvorea sobre la pimienta de cayena y la carne de cangrejo, luego glasea la parte superior con un mini soplete hasta que se dore y burbujee. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledcornonthecobw_88760", "title": "Maíz asado a la parrilla con cebollas de primavera y gratén de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 ciruelas maduras", "2 nidos de merengue", "250 g de queso mascarpone", "4 cucharadas de azúcar en polvo"], "method": ["Precalentar el horno 200C / 180C Fan / Gas 6.", "Dividir y apedrear las ciruelas y ponerlas, con el lado hueco hacia arriba, en un plato resistente al calor.", "Rompe los merengues y espárzalos por encima, asegurándote de que muchos caigan en los huecos de la fruta.", "Coloque las masas de queso mascarpone encima de los merengues y la fruta.", "Espolvorea con el azúcar y coloca el plato en el horno.", "Cocine por 20 minutos, sacándolo del horno cuando la fruta esté tierna con una costra crujiente.", "Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_grilledfruitwithmasc_72274", "title": "Ciruelas al horno con mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledfruitwithmasc_72274_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite", "1 patata", "1 tomate grande", "Filete de gamuza 150 g / 5½ oz", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar la patata en pedacitos y rociar con dos cucharadas de aceite. Coloque en una bandeja para hornear. Corta el tomate por la mitad y siéntalo en el lado de la bandeja para hornear. Hornee durante 30-40 minutos, o hasta que las papas estén doradas y crujientes y el tomate se ablande.", "Caliente una cucharada de aceite en una sartén. Sazonar el jamón con sal y pimienta negra recién molida y freír en ambos lados durante 5-6 minutos, o hasta que esté completamente cocido. Reserve para descansar en un lugar cálido.", "Calentar el aceite restante en una sartén y freír los huevos hasta que la yema esté recién preparada.", "Para servir, coloca el jamón en un plato con las patatas fritas y el tomate. Arriba con los huevos."], "url": "www_bbc_co_uk_food_recipes_grilledgammonwithdou_87779", "title": "Gammon con doble huevo y chips de horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ haggis cocido, picado", "1 cucharadita de jengibre molido", "1 cucharadita de chile en polvo", "1 cucharadita de cúrcuma molida", "1 cucharadita de cilantro molido", "1 huevo de gallinas camperas", "1 cucharada de harina normal", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "4 cucharadas de yogur natural", "1 cucharada de cebolletas frescas picadas", "1 cucharada de menta fresca picada", "1 lima, ralladura y jugo", "sal y pimienta negra recién molida"], "method": ["Para los haggis koftas, coloque todos los ingredientes, excepto el aceite de oliva, en un procesador de alimentos y pulse hasta que se combinen.", "Remoje cuatro brochetas de madera en un recipiente con agua durante aproximadamente 20 minutos para evitar que se quemen.", "Forme la mezcla de haggis alrededor de los pinchos y frote con el aceite. Caliente una sartén hasta que esté caliente y cocine los koftas hasta que se doren por todos lados y se cocinen, alrededor de 5-7 minutos.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón y mezcle bien.", "Sirva los koftas en un plato con el aderezo en un recipiente al costado."], "url": "www_bbc_co_uk_food_recipes_grilledhaggiskoftasw_88669", "title": "Haggis a la parrilla 'koftas' con aderezo de yogur, menta y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cordero", "dash aceite de oliva", "sal y pimienta negra recién molida", "1 chirivía, pelada, cortada en porras", "25g / 1oz de mantequilla", "pizca de curry en polvo", "Crema doble 85ml / 3fl oz", "salpicar vino blanco", "sal y pimienta negra recién molida", "4 cucharadas de aceite vegetal", "1 chirivía pequeña, finamente cortada en rondas en una mandolina", "sal, para rociar", "4 cucharadas de aceite de oliva", "2 ramitas de tomillo fresco"], "method": ["Para la chuleta de cordero a la parrilla, caliente una sartén hasta que esté caliente. Cepille el cordero con aceite de oliva y sazone bien con sal y pimienta negra recién molida. Coloque el cordero en la sartén y la plancha de la plancha caliente durante 3-4 minutos por cada lado, o hasta que esté dorado pero ligeramente rosado en el medio. Retire de la sartén y deje reposar durante cinco minutos, cubierto con papel de aluminio.", "Para los bastones de chirivía al curry, coloque los bastones de la chirivía en una sartén con agua salada hirviendo y blanquee durante 2-3 minutos. Retire con una espumadera y seque sobre papel de cocina.", "Derrita la mantequilla en una sartén, agregue las chirivías blanqueadas y el polvo de curry y revuelva para cubrir con la mantequilla derretida. Freír suavemente durante 2-3 minutos.", "Agregue la crema y el vino, sazone al gusto, con sal y pimienta negra recién molida y cocine a fuego lento hasta que la salsa se espese y las chirivías estén tiernas.", "Para las patatas fritas de chirivía, caliente el aceite en una sartén, agregue las rodajas de chirivía y fría hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Espolvorea con sal.", "Para el aceite de tomillo, coloca el aceite y el tomillo en una olla pequeña y calienta suavemente durante diez minutos. Retirar del fuego y dejar para infundir. Justo antes de servir, retire el tomillo.", "Para servir, cuchara las chirivías al curry en un plato de servir y cubra con el cordero a la parrilla. Rocíe el aceite de tomillo y adornar con las patatas fritas de chirivía."], "url": "www_bbc_co_uk_food_recipes_grilledlambchopwithc_88756", "title": "Chuleta de cordero a la parrilla con bastones de chirivía al curry, patatas fritas de chirivía y aceite de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 chuletas de cordero", "sal y pimienta molida recién molida", "10 hojas frescas de salvia", "puñado de agujas frescas de romero", "puñado de hojas frescas de perejil de hoja plana", "puñado de hojas de albahaca fresca", "1 diente de ajo, finamente picado", "6 cucharadas de queso parmesano recién rallado", "110 g / 4 oz de mantequilla, ligeramente suavizada (retirar de la nevera aproximadamente una hora de antelación)", "6 rebanadas de jamón de Parma"], "method": ["Coloque todas las hierbas en una tabla de cortar y corte muy finamente. Colóquelos en un tazón con ajo, parmesano, mantequilla y un poco de sal y pimienta y mezcle bien hasta que obtenga una pasta suave.", "Coloque las rodajas de jamón de Parma superpuestas ligeramente sobre un pedazo de film transparente y extienda la pasta uniformemente sobre ellas con una espátula. Luego, con la ayuda del film transparente, enrolle el jamón en forma de salchicha y ate los extremos para que el relleno no se escape. Coloque en la nevera durante al menos media hora.", "Corta cada chuleta de cordero horizontalmente en el centro, dejándola unida en un extremo y ábrela como una mariposa. Con un ablandador de carne, aplana cada pieza. Puede pedirle a su carnicero que haga esto por usted si lo prefiere.", "Retire el relleno del refrigerador y deseche la película adhesiva. Corte el relleno en rebanadas de 2.5 cm / 1 in, presione ligeramente para que quede plano.", "Coloque en un lado de cada chuleta y doble el otro lado por encima. Presione juntos bien, asegurándose de que no se escapa nada del relleno.", "Transfiera las chuletas a una bandeja para hornear forrada con papel de aluminio y sazone con sal y pimienta negra recién molida.", "Coloque debajo de una parrilla caliente y ase a la parrilla durante unos 2 minutos en cada lado para raros, 4 minutos para mediano o bien hecho, todo el tiempo que desee."], "url": "www_bbc_co_uk_food_recipes_grilledlambcutletsfi_70345", "title": "Chuletas de cordero a la parrilla rellenas con jamón de parma y hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 17½oz de harina de pan fuerte, más extra para quitar el polvo", "10g / ½ oz de levadura rápida (levadura activa no seca)", "5 g / ¼ onza de azúcar", "5g / ¼ oz de sal", "200ml / 7fl oz de agua a temperatura ambiente", "aceite de oliva, para cepillar", "50 g / 2 oz de azúcar", "150ml / 5fl oz de agua", "1in / 2cm pieza de raíz fresca de jengibre, pelada y rallada", "½ chili, en rodajas", "2 dientes de ajo, pelados, finamente picados", "salpicar el vinagre de vino de arroz", "Salsa de pescado", "1 x 410 g / 14½ oz pueden garbanzos, escurridos", "3 cucharaditas de pasta tahini", "1 limón, solo jugo", "1 diente de ajo, pelado, finamente picado", "3 cucharadas de aceite de oliva", "1 cilantro fresco de racimo pequeño, picado", "sal al gusto", "500 g / 17½ oz de cordero picado", "3 cucharaditas de pimentón", "2 cucharaditas de cilantro molido", "2 cucharaditas de comino molido", "1 diente de ajo, pelado, picado", "½ chili, finamente picado", "pizca de cayena", "sal y pimienta negra recién molida, al gusto", "1 cebolleta cortada en racimo pequeña, picada", "2 tomates, picados", "2-3 chiles jalapeños, finamente picados", "1 pepino, picado", "1 gran manojo de hojas de lechuga, desgarrado en pedazos", "1 cilantro fresco de racimo pequeño, picado"], "method": ["Para la masa de pan pitta, coloque la harina de pan fuerte, la levadura, el azúcar y la sal en un tazón y mezcle.", "Haga un pozo en el centro y agregue la mitad del agua. Con las manos, junte la mezcla, agregue un poco de agua a la vez, hasta que la mezcla forme una masa (es posible que no necesite toda el agua). Convierta la masa en una superficie de trabajo enharinada y amasar la masa durante unos diez minutos, o hasta que la masa esté suave y elástica.", "Espolvorea la masa con un poco más de harina y colócala en el bol y cúbrela con una toalla de té húmeda. Déjelo a un lado durante una hora en un lugar cálido y seco, o hasta que la masa haya subido. (También puede cepillar ligeramente la parte exterior de la masa con aceite de oliva para evitar que la masa se seque demasiado).", "Precaliente el horno a 200C / 400F / Gas 6. Engrase una bandeja para hornear con un poco de aceite de oliva.", "Enrolle la masa en una capa muy fina de aproximadamente 3-5 mm de grosor, y corte óvalos largos de la hoja (la masa debe producir aproximadamente diez panes pitta). Coloque los panes pitta en la bandeja de horno engrasada y hornee en el horno durante 5-6 minutos, o hasta que el pan pitta comience a hincharse y se ponga dorado. Retire del horno y reserve. Cubra los panes pitta con una toalla de té limpia ligeramente húmeda para evitar que los panes se sequen y se vuelvan quebradizos.", "Para la salsa de chile, coloque el azúcar y el agua en una olla no reactiva y cocine a fuego lento. Cocine por 5-6 minutos, o hasta que el azúcar se haya disuelto y el líquido se haya reducido a un jarabe espeso.", "Agregue el jengibre rallado, el chile y el ajo a la sartén y agregue un poco de vinagre de vino de arroz y un chorrito de salsa de pescado. Revuelva bien y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos.", "Transfiera la mezcla de salsa de chile a un procesador de alimentos y mezcle hasta que quede suave, luego cubra y enfríe en la nevera hasta que sea necesario.", "Para el humus de cilantro, coloque los garbanzos, pasta de tahini, ajo y aceite de oliva en un procesador de alimentos y mezcle hasta que quede suave. Agregue el cilantro fresco picado y el jugo de limón y mezcle de nuevo para combinar.", "Precalentar la parrilla a alto.", "Para los kebabs de cordero kofta, coloque todos los ingredientes del kebab juntos en un tazón y mezcle con las manos hasta que la carne se pegue.", "Con las manos húmedas, toma un puñado de la mezcla de kebab y dale forma a una forma de salchicha larga alrededor de un pincho de metal. Repita con la mezcla de kebab restante, usando un nuevo pincho cada vez (o coloque dos pinchos en cada pincho, si el espacio lo permite).", "Coloque los pinchos debajo de la parrilla durante 10-12 minutos, girándolos hasta la mitad, hasta que el cordero esté dorado y cocido. Deslice los pinchos de los pinchos y déjelos a un lado.", "Para la ensalada, mezcle todos los ingredientes de la ensalada en un tazón grande.", "Para servir, coloque algunos panes Pitta en cada plato de servir junto con unos kebabs de cordero kofta. Coloque la ensalada al costado y coloque la salsa de chile y el hummus en pequeños cuencos para compartir."], "url": "www_bbc_co_uk_food_recipes_grilledlambkoftakeba_92066", "title": "Kebabs de kofta de cordero a la parrilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero 100 g / 3½ oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "1 diente de ajo, picado", "¼ de puerro, picado", "1 cucharada de vino blanco", "2 cucharadas de crema doble", "sal y pimienta negra recién molida"], "method": ["Para el filete de cordero a la parrilla, frote la carne con el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la parrilla y carme el cordero durante 4-5 minutos en cada lado, o hasta que esté cocido a su gusto. Retire de la sartén y déjelo a un lado para que descanse en un lugar cálido.", "Para los puerros con crema, caliente el aceite en una sartén y fríe con cuidado la cebolla hasta que se suavice pero no se coloree.", "Agregue el ajo y cocine por un minuto.", "Agregue los puerros y el vino blanco y cocine a fuego lento durante 2-3 minutos.", "Agregue la crema doble y hierva a fuego lento por otros 2-3 minutos, hasta que espese un poco. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque los puerros con crema en un plato de servir y cubra con el filete de cordero a la parrilla."], "url": "www_bbc_co_uk_food_recipes_grilledlambsteakoncr_86143", "title": "Filete de cordero a la parrilla en puerros con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de pierna de cordero sin hueso 200 g / 7oz, cortado", "1 ramita de romero fresco, solo hojas", "2 dientes de ajo, ligeramente triturados", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "100g / 3½oz Tentedtem brócoli, blanqueado y escurrido", "30g / 1oz de mantequilla, derretida", "2 cucharadas de perejil fresco picado, para servir"], "method": ["Coloque el filete de cordero en un recipiente con el romero, el ajo y el aceite y revuelva. Deje marinar durante diez minutos o más si es posible.", "Caliente una sartén hasta que esté muy caliente. Retire el filete de cordero del adobo y sazone con sal y pimienta negra recién molida. Planche durante dos minutos en cada lado para carne medianamente rara, o más si le gusta bien hecho. Retire el cordero de la sartén y déjelo reposar.", "Coloque el brócoli en la plancha y cocínelo, volteándolo con frecuencia, hasta que esté dorado.", "Para servir, coloque el brócoli en un plato para servir y cubra con el filete de cordero. Rocíe la mantequilla derretida y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_grilledlambsteakwith_87206", "title": "Filete de cordero a la parrilla con mantequilla de romero y brócoli a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de pierna de cordero de 175g / 6oz", "1 ramita de tomillo fresco, picado", "½ diente de ajo, picado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "½ berenjena, cortada en cubos", "½ cebolla, picada", "1 diente de ajo, finamente picado", "200g / 7oz de tomates cherry enlatados", "pizca de copos de chile", "2 cucharadas de vino blanco", "puñado de albahaca fresca, picada", "sal y pimienta negra recién molida", "ramita de tomillo fresco, para adornar"], "method": ["Para hacer el filete de cordero a la parrilla, coloque el cordero en un plato o tazón de vidrio poco profundo. Agregue el tomillo, el ajo, el aceite de oliva y el condimento al cordero y masajee la carne. Deje de lado para marinar durante cinco minutos, o hasta una hora si el tiempo lo permite.", "Caliente una sartén hasta que esté caliente, luego agregue el bistec y la plancha en ambos lados durante 3-4 minutos, o hasta que esté cocido a su gusto. Reserve para descansar durante cinco minutos antes de servir.", "Para preparar el pisto, caliente una cucharada de aceite de oliva en una sartén antiadherente y agregue la berenjena. Freír durante diez minutos, o hasta que estén suaves y dorados por todas partes.", "En una sartén antiadherente separada, caliente la cucharada restante de aceite de oliva, agregue la cebolla a la sartén y fríela a fuego lento durante cinco minutos, o hasta que esté blanda pero no coloreada.", "Agregue el ajo a la sartén y cocine por un minuto más.", "Agregue la berenjena frita, los tomates cherry enlatados y las hojuelas de chile a la sartén y cocínelos durante tres minutos.", "Agregue el vino blanco a la sartén y cocine por otros dos minutos.", "Agregue la albahaca a la sartén y sazone bien con sal y pimienta negra recién molida.", "Para servir, cuchara el pisto en un plato y cubra con el cordero a la parrilla. Adorne con una ramita de tomillo."], "url": "www_bbc_co_uk_food_recipes_grilledlambwithauber_87005", "title": "Cordero a la plancha con ratatouille de berenjena y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de cuello de cordero (aproximadamente 100 g / 4 oz cada uno)", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "4 cucharadas de vinagre balsámico", "½ vaso de vino tinto", "4 ramitas de romero", "300 ml / ½ litro de carne de cerveza", "una pizca de azúcar", "sal y pimienta negra recién molida", "una buena pizca de sal de apio", "una buena pizca de orégano seco", "½ limón, solo jugo", "2 puñados de judías verdes", "½ pepino", "1 diente de ajo", "sal", "un montón de menta, picada", "½ limón, solo jugo", "1 cucharada de aceite de oliva", "250ml / 9fl oz de yogur griego", "85g / 3oz de cuscús", "60 g / 2 oz de piñones, tostados", "2 puñados de pasas sin semillas", "un pequeño manojo de perejil flatleaf, picado", "2 limones, jugo de ambos y cáscara de 1 solo", "8 cucharadas de aceite de oliva", "una pizca de comino molido"], "method": ["Para hacer el tzatsiki, corta el pepino en cubos pequeños, colócalo en un colador y déjalo escurrir. Aplasta el ajo en una pasta con la punta de un cuchillo.", "En un tazón grande, mezcle el ajo, una buena pizca de sal y un tercio de la menta picada.", "Agregue un chorrito de jugo de limón y aceite de oliva, mezcle bien y luego agregue el yogur, seguido por el pepino escurrido. Mezclar suavemente y enfriar en la nevera.", "Recorte cualquier tendón de los filetes de cordero. Caliente dos cucharadas de aceite en una olla grande y selle el cordero. Retire los filetes de la olla y colóquelos a un lado.", "Agregue el ajo a la olla y agregue rápidamente el vinagre balsámico y el vino tinto. Llevar a ebullición, luego agregar el romero y la mitad de la menta picada restante. Ahora agregue el caldo de carne y el azúcar con sal y pimienta al gusto y deje cocer a fuego lento hasta que se reduzca a la mitad.", "Mientras hierve a fuego lento, espolvorea los filetes de cordero con sal de apio y orégano seco y colócalos en los jugos hervidos. Cubra con una tapa y cocine suavemente durante cinco minutos.", "Retire los filetes de cordero y reduzca la salsa a la mitad, exprimiendo el jugo de limón.", "Para preparar el cuscús, remójalo según las instrucciones del paquete, luego agrega los piñones tostados, las pasas, el perejil picado, la menta picada restante, el zumo y la ralladura de limón, el aceite de oliva, el comino y sal y pimienta al gusto. Mezclar bien.", "Mientras el cuscús se remoja, cocine las judías verdes en agua hirviendo con sal por 4-5 minutos hasta que estén tiernas. Escurrir bien.", "Corte cada filete de cordero en pedazos y colóquelo sobre el cuscús y las judías verdes. Cuchara sobre los jugos de cordero y terminar con una gran porción de tzatziki. Servir."], "url": "www_bbc_co_uk_food_recipes_grilledlambwithcousc_72147", "title": "Cordero a la plancha con aderezo de cuscús y yogur", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pequeño puñado de ramitas de orégano fresco", "1 pequeño puñado de ramitas de tomillo fresco", "Aceite de oliva con sabor a fruta, para lloviznar y freír", "sal y pimienta negra recién molida", "1 bloque de queso feta de buena calidad", "1 limón, solo jugo, al gusto", "6-8 chuletas de cordero"], "method": ["Raspe las tiernas hojas del orégano y las ramitas de tomillo, colóquelas en un recipiente y rocíe con aceite de oliva. Desmoronarse en el queso feta (los trozos grandes están bien ya que se romperán ligeramente cuando todo se revuelva en el recipiente). Sazonar, al gusto, con pimienta negra recién molida y jugo de limón y mezclar todo junto suavemente.", "Caliente una sartén hasta que esté caliente, sazone las chuletas de cordero con sal y pimienta negra recién molida, y cepille cada chuleta con un poco de aceite de oliva antes de colocarla en la plancha caliente. Cocine por unos minutos uno a cada lado, o hasta que esté ligeramente crujiente - Me gusta el mío todavía rosado y un poco elástico en el medio.", "Divida las chuletas entre dos platos calientes, y mientras las chuletas sigan chisporroteando, cubra suavemente el aderezo de feta y hierbas. Come de inmediato, mientras todo está caliente, herbal y picante."], "url": "www_bbc_co_uk_food_recipes_grilledlambwithfetaa_92373", "title": "Cordero a la plancha con queso feta y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledlambwithfetaa_92373_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 filete de cordero, cortado por la mitad", "½ cucharadita de Romero fresco picado", "½ cucharadita de hojas de tomillo fresco picado", "25 g / 1oz de mantequilla sin sal", "2 remolachas cocidas, descuartizadas", "100 g / 3½ oz de judías verdes, blanqueadas y refrescadas", "sal y pimienta negra recién molida"], "method": ["Para el cordero, coloque el aceite, el cordero, el romero y el tomillo en un bol y mezcle bien. Sazonar con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté humeando y luego agregue el cordero. Cocine por tres minutos en cada lado, o hasta que esté cocido, luego retírelo del fuego y déjelo reposar por dos minutos.", "Para los frijoles y la remolacha, derrita la mantequilla en una sartén a fuego medio. Agregue la remolacha y cocine durante tres minutos.", "Agregue los frijoles y cocine durante tres minutos más y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca los frijoles en el medio de un plato y coloca el cordero encima."], "url": "www_bbc_co_uk_food_recipes_grilledlambwithgreen_84128", "title": "Cordero a la plancha con judías verdes y remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 puerro grande, cortado y partido a la mitad", "Crema doble de 300 ml / ½ pinta", "Queso parmesano 150 g / 5½ oz, rallado", "pimienta negra recién molida", "2 rebanadas de jamón, desgarrado", "55g / 2oz de pan rallado fresco"], "method": ["Precalentar la parrilla a mediano.", "Coloque el puerro a la mitad en agua hirviendo con sal y cocine hasta que esté tierno. Retirar con una espumadera y escurrir bien. Coloque en una bandeja para hornear.", "Coloque la crema doble en una sartén y cocine a fuego lento hasta que se haya reducido a la mitad. Agregue la mitad del parmesano y sazone con pimienta negra.", "Coloque el jamón rasgado sobre la parte superior del puerro cocido y luego vierta sobre la salsa cremosa de parmesano. Dispersar sobre las migas de pan y el resto del parmesano y colocar debajo de la parrilla hasta que estén doradas y burbujeantes.", "Coloque el puerro a la parrilla en un plato para servir y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledleekswithcrun_87410", "title": "Puerros a la plancha con crujiente de jamón y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tallos de hierba de limón, finamente picados", "2 dientes de ajo, aplastados", "2 chalotes, finamente picados", "1 chile, finamente picado", "2 cucharadas de salsa de pescado tailandés (nam pla)", "1 cucharada de jugo de lima", "1 cucharada de agua", "1 cucharada de aceite de semilla de sésamo", "Filete de res 450g / 1lb", "2 cucharadas de semillas de sésamo", "2 limas, solo jugo", "2 cucharadas de salsa de pescado tailandés (nam pla)", "2 cucharadas de agua", "2 cucharadas de vinagre de sidra", "1 cucharadita de azúcar", "1 diente de ajo, aplastado", "1 chile, picado", "1 zanahoria, finamente rallada"], "method": ["Mezcle todos los ingredientes del adobo en un tazón grande.", "Enrolle la carne con fuerza en una película adhesiva para formar un rollo redondo y déjelo reposar en la nevera durante 30 minutos. Retire de la nevera cuando esté 'listo' en un rollo.", "Desenvuelva la carne y corte en discos de 5 mm de grosor. Coloque los discos en el adobo y déjelos durante 30 minutos.", "Coloque las rodajas de carne en palitos de cóctel, para parecer paletas, y espolvorear con semillas de sésamo.", "Calentar una sartén de plancha. Agregue los discos de carne y la plancha durante 1-2 minutos en cada lado, hasta que las semillas de sésamo hayan tomado color.", "Mientras tanto, para la salsa de inmersión, mezcle todos los ingredientes en un tazón.", "Para servir, coloque las rebanadas de carne en un plato de servir con el tazón de salsa de inmersión al lado."], "url": "www_bbc_co_uk_food_recipes_grilledlemongrassbee_79306", "title": "Carne de vaca de limoncillo a la parrilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de vinagre de vino blanco", "3 cucharadas de vino blanco", "10 granos de pimienta negra, ligeramente triturados", "2 cucharadas de chalotes, pelados, finamente picados", "1 cucharadita de hojas frescas de estragón fresco picado", "1 cucharada de agua", "1 cucharada de puré de tomate", "3 yemas de huevo de gallinas camperas", "200g / 7oz de mantequilla, derretida", "1 cucharada de perejil de flatleaf fresco finamente picado", "2 cucharadas de aceite de oliva", "8 solomillos de limón", "sal y pimienta negra recién molida", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de colza", "sal y pimienta negra recién molida", "150g / 5oz de berros, solo hojas"], "method": ["Para la salsa Choron, coloque el vinagre de vino blanco, el vino blanco, los granos de pimienta negra, los chalotes y el estragón en una olla no reactiva y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el líquido en la sartén se haya reducido a aproximadamente 1 cucharada.", "Agregue el puré de agua y tomate a la sartén y bata para combinar. Batir las yemas de huevo, batiendo durante 3-4 minutos a fuego lento, o hasta que estén espumosas. Poco a poco vierta la mantequilla en una corriente fina y constante, batiendo continuamente hasta que toda la mantequilla se haya incorporado y la salsa se espese.", "Sazone al gusto, con sal y pimienta negra recién molida, luego cuele la salsa a través de un colador fino. Deseche los sólidos que quedan en el tamiz. Mantenga caliente hasta que esté listo para servir. Revuelva el perejil en la salsa justo antes de servir.", "Precalentar la parrilla a alto. Engrase ligeramente una bandeja de tostado con aceite de oliva.", "Para la suela de limón, coloque los filetes de lenguado con la piel hacia arriba sobre la bandeja de tostado preparada y sazone con sal y pimienta negra recién molida. Grill durante 3-4 minutos, o hasta que la piel esté crujiente y dorada y el pescado esté bien cocido. (Cuando el pescado esté cocido, la carne debe estar completamente opaca y desmenuzarse fácilmente con un tenedor.) Retire el pescado de la parrilla y déjelo a un lado para que descanse durante 1-2 minutos.", "Para el berro, mezcle la mostaza de Dijon, el vinagre de vino blanco y el aceite de colza en un tazón pequeño hasta que se emulsione. Sazonar, al gusto, con sal y pimienta negra recién molida. Coloque el berro en un recipiente, vierta sobre el aderezo y mezcle bien para cubrir.", "Para servir, coloque 2 filetes en cada plato de servir. Coloque el berro al costado, luego coloque la salsa Choron sobre el pescado."], "url": "www_bbc_co_uk_food_recipes_grilledlemonsolewith_93714", "title": "Suela de limón a la parrilla con salsa Choron", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "150 g / 5½ oz de lomo de cerdo, cortado en medallones", "sal y pimienta negra recién molida", "½ patata, pelada y rallada", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "1 albaricoque, piedra removida, picada", "pizca de copos de chile", "1 cucharada de vinagre de vino blanco", "1 cucharada de miel clara", "1 cucharada de agua", "1 cucharada de aceite vegetal", "¼ de puerro, finamente cortado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de cerdo, caliente una sartén hasta que esté caliente.", "Frote la carne de cerdo con el aceite y sazone bien con sal y pimienta negra recién molida. Chargrill durante 2-3 minutos en cada lado, o hasta que esté completamente cocido (no debe haber rosado en el centro). Retire del fuego y reserve para descansar en un lugar cálido.", "Para los rösti, coloque la papa rallada en una toalla de té limpia y exprima el exceso de agua. Sazonar bien con sal y pimienta negra recién molida.", "Caliente la mitad de la mantequilla en una sartén pequeña a prueba de horno. Coloque la papa rallada en la sartén, presione hacia abajo y fría hasta que esté ligeramente dorada debajo. Dar la vuelta, agregar la mantequilla restante a los bordes del rösti y freír en el otro lado hasta que esté ligeramente dorado.", "Transfiera al horno y hornee por 6-8 minutos, o hasta que estén crujientes.", "Para los albaricoques con especias, caliente el aceite en una sartén y agregue el albaricoque, los copos de chile, el vinagre, la miel y el agua. Cocine a fuego lento hasta que espese.", "Para la guarnición de puerro, caliente el aceite en un wok o en una sartén grande hasta que esté muy caliente. Agregue el puerro en rodajas, sazone con sal y pimienta negra recién molida y saltee hasta que estén doradas y crujientes.", "Para servir, coloque el rösti en un plato de servir y cubra con el cerdo. Cuchara sobre los albaricoques y decorar con los puerros."], "url": "www_bbc_co_uk_food_recipes_grilledloinofporkwit_85927", "title": "Lomo de cerdo a la plancha con patata rosti y albaricoques con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175ml / 6 fl oz yogur natural sin grasa", "1 cucharada de harina de gramo (también llamado besan)", "250ml / 9fl oz de agua", "½ cucharadita de sal", "¼ cucharadita de cúrcuma molida", "1 cucharada de ghee", "1 chile rojo entero", "½ cucharadita de semillas de comino", "20-25 hojas frescas de curry", "1 cucharadita de clavo de olor", "1 cucharadita de semillas de hinojo", "½ cucharadita de pimienta", "5cm / 2in canela en rama", "1 cucharadita de semillas de comino", "½ cucharadita de chile rojo en polvo", "4 filetes grandes de caballa, huesos recogidos con pinzas, recortados", "1 cucharadita de sal", "½ limón, solo jugo", "1 cucharada de aceite vegetal", "2 cucharadas de aceite vegetal", "1 cucharadita de semillas de mostaza", "1 ramita de hojas frescas de curry", "1 cebolla, finamente picada", "½ cucharadita de sal", "1 chile verde fresco, finamente picado", "Espinaca 150 g / 5 oz, finamente triturada", "60g / 2½oz de coco fresco, rallado"], "method": ["Para el yogur kadhi, coloque el yogur, la harina de gramo, el agua, la sal y la cúrcuma en un tazón y bata para combinar, luego pase la mezcla a través de un tamiz fino.", "Coloque la mezcla de yogur en una sartén a fuego medio y deje hervir, batiendo constantemente. Reduzca el fuego y cocine a fuego lento durante 5-8 minutos, o hasta que la salsa se vuelva brillante y comience a cubrir la parte posterior de una cuchara de madera. Desnata el yogurt kadhi para eliminar cualquier espuma o impurezas que puedan aparecer en la superficie.", "Coloque el ghee en una olla pequeña y caliente hasta el punto de ahumado. Agregue el chile rojo, el comino y las hojas de curry, y mientras crepitan y cocinan (casi de inmediato), vierta el aceite y las especias sobre el yogurt kadhi. Dejar de lado.", "Para la caballa, precaliente la parrilla a su nivel más alto.", "Coloque todas las especias en un mortero (o un molinillo de especias) y muela en una mezcla gruesa.", "Espolvorea la mezcla de especias sobre ambos lados de los filetes de caballa.", "Mezcle el aceite y el jugo de limón juntos, luego rocíe sobre los filetes de caballa.", "Coloque los filetes de caballa en una bandeja y colóquelos debajo de la parrilla, con la piel hacia arriba, y cocínelos durante 8-10 minutos, o hasta que la jurel esté recién hecha.", "Para la poriyal de espinacas, caliente el aceite en una sartén a fuego medio. Agregue las semillas de mostaza y las hojas de curry y fría por 10-15 segundos (deben crujir y explotar).", "Agregue las cebollas y fría por 5-6 minutos a fuego lento, o hasta que estén translúcidas.", "Agregue la sal y el chile verde y saltee por un minuto.", "Agregue las hojas de espinaca y sofría por 2-3 minutos, hasta que se marchite.", "Agregue el coco rallado y mezcle bien. Cocine por un minuto y luego retírelo del fuego.", "Para servir, verter o cucharear cantidades iguales de yogur kadhi en tazones de servir y colocar un filete de caballa en la parte superior de cada uno. Coloque un poco de poriyal de espinaca sobre cada filete de caballa y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledmackerelfille_89359", "title": "Filetes de caballa a la parrilla con yogurt kadhi y espinaca de hoja de curry poriyal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 pequeñas lechugas gema", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "250g / 9oz de queso de cabra, o taleggio", "¼ limón"], "method": ["Corta las lechugas por la mitad, dejando intacta la base del tallo para mantener juntas las hojas. Cepille las lechugas con el aceite de oliva, sazonado con sal y pimienta.", "Luego coloque el lado cortado hacia abajo en una parrilla de barbacoa precalentada o en una de esas bandejas de hierro fundido con crestas levantadas. Cocine por 3-5 minutos. Están listos cuando las hojas exteriores están bien carbonizadas, a rayas de la parrilla y los tallos gruesos se vuelven tiernos.", "Coloque las 12 mitades de lechuga en un plato y coloque sobre rodajas finas del queso. Agregue algunos giros más de pimienta y una llovizna de aceite de oliva sobrante. Eche el horno caliente o debajo de la parrilla hasta que el queso comience a burbujear.", "Servir a la vez Dos mitades de lechuga, cubiertas con queso burbujeante, por persona."], "url": "www_bbc_co_uk_food_recipes_grilledlettucewithgo_14300", "title": "Lechuga a la parrilla con queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledlettucewithgo_14300_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nuevas papas de 150g / 5oz, como Jersey Royals, restregadas", "pizca de sal", "2 filetes de caballa", "1 cucharada de mostaza integral", "sal y pimienta negra recién molida", "1 cucharadita de mostaza inglesa", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de colza o aceite de oliva", "exprimir jugo de limón", "2 lechugas con gemas pequeñas"], "method": ["Poner a hervir una olla de agua. Agregue las papas y cocínelas durante 8-10 minutos hasta que estén tiernas. Drene y regrese a la sartén para mantenerse caliente.", "Para la caballa, precaliente la parrilla a altura.", "Coloque los filetes de caballa en la bandeja de la parrilla, cepille con la mostaza integral y sazone con sal y pimienta. Parréelos durante 2-3 minutos, luego déles la vuelta y ase a la parrilla por un minuto más, o hasta que la caballa esté cocida.", "Para el aderezo y la ensalada, mezcle la mostaza inglesa, el vinagre de vino blanco, el aceite de colza y el jugo de limón en un tazón. Condimentar con sal y pimienta. Agregue las hojas de lechuga al tazón y mezcle para combinar.", "Divida la caballa entre dos platos, junto con las papas y la ensalada. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledmackerelwithj_86201", "title": "Caballa a la parrilla con papas nuevas y ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledmackerelwithj_86201_16x9.jpg", "isVegetarian": false, "recommendations": 0}]