[{"ingredients": ["175g / 6oz de frutas mezcladas secas", "50g / 2oz de cerezas glaseadas, picadas", "50 g / 2 oz de almendras, picadas", "2 limones no encerados, ralladura fina solamente", "¼ cucharadita de nuez moscada molida", "1 cucharada de extracto de vainilla", "2 cucharadas de aguardiente", "375g / 13oz de harina de pan blanco fuerte, más extra para espolvorear", "1 x 7 g / oz de sachet levadura seca de acción rápida", "50 g / 2 oz de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "70 g / 2½ oz de mantequilla sin sal, derretida", "150ml / 5fl oz de leche caliente, más extra para acristalamiento", "Mazapán 200g / 7oz", "azúcar en polvo, para quitar el polvo"], "method": ["Mezcle las frutas secas, las cerezas, las almendras, la ralladura de limón, la nuez moscada, el extracto de vainilla y el brandy en un tazón. Cubra con film transparente y reserve.", "Ponga la harina, la levadura y el azúcar en un tazón. Agregue el huevo, 50 g / 2 oz de la mantequilla derretida y la leche. Mezcle los ingredientes para formar una masa y agregue 1-2 cucharadas de leche si la masa está un poco seca.", "Voltee la mezcla sobre una superficie ligeramente enharinada y amase durante 10 minutos o hasta que quede suave y elástica. Coloque en un recipiente ligeramente engrasado, cubra con film transparente y deje que se levante en un lugar cálido durante 1-1¼ horas, hasta que la masa se haya duplicado.", "Convierta la masa en una superficie ligeramente enharinada. Poco a poco amasar en la mezcla de frutas hasta que se distribuye uniformemente a través de la masa. Cubra con una toalla de té húmeda y deje reposar durante 20 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Divida el mazapán en seis pedazos y enrolle cada uno en un tronco de 10cm / 4 pulgadas.", "Amasar la masa ligeramente durante un minuto. Divida en seis pedazos y enrolle cada pieza en un rectángulo. Coloque un tronco de mazapán justo al centro de cada pieza de masa, cepille los bordes con un poco de leche, luego doble la masa sobre el mazapán y presione para sellar.", "Coloque las bandejas de cocción robadas, cúbralas con una película adhesiva ligeramente engrasada y déjelas en un lugar cálido y libre de corrientes de aire hasta que dupliquen su tamaño.", "Hornee el robado, en el estante del medio del horno durante 20-25 minutos, o hasta que se haya levantado y dorado. Enfríe en las rejillas de alambre, luego aspire abundantemente con azúcar glasé."], "url": "www_bbc_co_uk_food_recipes_mini_stollen_10408", "title": "Mini stollen", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 6 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_stollen_10408_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, ablandada", "75 g / 2½ oz de azúcar en polvo", "Harina normal de 175g / 6oz, más extra para espolvorear", "Sémola de 75 g / 2½ oz", "50 g / 1¾oz de leche o chips de chocolate normal", "1 limón, ralladura finamente rallada solamente", "1-2 cucharadas de azúcar demerara", "1 cucharadita de extracto de almendra", "40g / 1½oz de almendras en copos"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Coloque tres bandejas para hornear con papel de hornear.", "Para hacer la masa de galletas, mida la mantequilla, el azúcar, la harina y la sémola en el tazón de un mezclador de alimentos eléctrico y mezcle hasta que se forme una masa suave, teniendo cuidado de no batir demasiado. Alternativamente, agregue la mantequilla y el azúcar a un tazón y bata con una cuchara de madera hasta que esté suave y cremoso, luego agregue la harina y la sémola. Divida la masa de manera uniforme en tres y espolvoree la superficie de trabajo con harina antes de amasar cada lote.", "Para las galletas con trocitos de chocolate, amase las chispas de chocolate en una porción de masa, forme 20 bolitas y colóquelas separadas en una de las bandejas para hornear. Presione hacia abajo con la parte posterior de un tenedor en discos de aproximadamente 5 cm / 2 pulgadas de diámetro y hornee en el horno durante 10 minutos, o hasta que estén dorados.", "Para las galletas de limón, amase la ralladura de limón en la segunda porción de masa. Ruede en una forma larga de salchicha (aproximadamente 20 cm / 8 pulgadas de largo) y enrolle el azúcar demerara. Envuelva la película adherida y déjela en el congelador durante aproximadamente 30 minutos, o hasta que esté firme y casi congelada. Rebana en 20 rondas pares, cada una de aproximadamente 1 cm / ½ pulgada de grosor. Acomode en una bandeja para hornear, bien separados, y hornee durante aproximadamente 10 minutos, o hasta que estén pálidas doradas.", "Para las galletas de almendras, amase el extracto de almendras en la porción restante de la masa, junto con la mayoría de las almendras en copos. Forme 20 bolas pequeñas y colóquelas en la tercera bandeja para hornear, separadas. Coloque unas almendras encima de cada bola de masa y presione con el dorso de un tenedor en discos de unos 5 cm de diámetro. Hornee durante unos 10 minutos o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_mini_three-way_biscuits_95845", "title": "Mini galletas de tres vías", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 20 de cada variedad", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_three-way_biscuits_95845_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ picado vegetariano", "75g / 1¾oz de papa dulce cocida y machacada", "1 cebolleta, en rodajas", "1 rebanada de pan, rallado en pan rallado", "1 huevo de gallinas camperas", "2 cucharadas de aceite de oliva", "10 tomates cherry, descuartizados", "5 hojas de albahaca"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle la carne picada, la batata y la cebolla tierna, pan rallado y huevo juntos en un bol hasta que estén bien combinados.", "Divida la mezcla en cuatro porciones iguales, luego enrolle cada porción en una bola y aplaste suavemente en forma de hamburguesa. Coloque cada hamburguesa en una bandeja para hornear y rocíe con un poco de aceite.", "Hornee en el horno durante 18-20 minutos, o hasta que estén cocidos.", "Para hacer la salsa, mezcle los tomates, la albahaca y el aceite restante en un tazón. Sazonar con pimienta recién molida negro.", "Sirve las hamburguesas con la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_mini_veggie_burgers_and_22803", "title": "Mini hamburguesas vegetarianas y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 450 g / 1 lb, picadas", "300g / 10½ oz de mermelada de azúcar", "Harina de levante 225g / 8oz", "4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "Margarina 225g / 8oz", "extracto de vainilla", "250 g / 9 oz de azúcar glas, más extra para quitar el polvo", "65g / 2¼ oz de mantequilla", "1 cucharada de leche"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Coloque dos latas de rollo suizo con papel antigrasa.", "Para la mermelada, coloque las fresas y el azúcar en una cacerola de base pesada, lleve a ebullición y cocine durante 10 minutos. Transfiera a un recipiente y déjelo enfriar.", "Para la esponja, bata todos los ingredientes en un bol hasta que estén suaves y esponjosos. Extienda la mezcla en una lata de rollo suizo, aplanar con una espátula y hornear en el horno durante 18-20 minutos o hasta que estén doradas y cocidas.", "Con cuidado, gire el bizcocho sobre una rejilla de alambre, retire el papel y déjelo enfriar.", "Para la crema de mantequilla, tamiza el azúcar glas en un tazón. Agregue la mantequilla y la leche y bata hasta que quede suave. Coloque la crema de mantequilla en una bolsa de plástico con una boquilla pequeña.", "Corta círculos de 24 x 5 cm en las esponjas, luego corta cada círculo en dos mitades de sándwich. Extiende doce mitades con la mermelada de fresa y pipa un poco de crema de mantequilla. Sandwich junto con los círculos de esponja restantes. Espolvorea azúcar glas en la parte superior de cada sándwich."], "url": "www_bbc_co_uk_food_recipes_mini_vicotria_sandwich_38131", "title": "Mini bocadillos de Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_vicotria_sandwich_38131_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 500 g / 1 libra y 2 onzas, mondadas y partidas por la mitad", "500g / 1lb de azúcar de mermelada 2 oz", "175 g / 6 oz de mantequilla sin sal, a temperatura ambiente, más extra para engrasar", "175g / 6oz de azúcar en polvo", "3 huevos grandes de gallinas camperas, golpeados", "1 cucharadita de extracto de vainilla", "Harina de 175g / 6oz de auto crianza", "300ml / 10½ fl oz crema doble", "azúcar en polvo, para quitar el polvo"], "method": ["Para la mermelada, coloque las fresas en una cacerola grande y aplaste con un machacador de papas.", "Agregue el azúcar mermelada y caliente suavemente, revolviendo continuamente, hasta que el azúcar se disuelva.", "Siga revolviendo, aumentando el calor, llevándolo a un punto de ebullición completo, uno que burbujee vigorosamente, se eleve en la sartén y no se pueda remover.", "Comience cronometrando y hierva por solo cuatro minutos. Retirar del fuego y reservar para enfriar.", "Para la esponja, precaliente el horno a 190 ° C (ventilador 170 ° C) / 375 ° F / Gas 5. Engrase ligeramente las latas con mantequilla.", "Para hacer los pasteles, unte la mantequilla y el azúcar impalpable hasta que la mezcla esté pálida y ligera. Agregue gradualmente los huevos batidos, mezclándolos bien entre cada adición y raspando los lados del tazón de vez en cuando. Agregue el extracto de vainilla y mezcle para combinar.", "Tamiza la harina en el bol y dóblala hasta que la mezcla esté lisa y brillante.", "Divida la mezcla entre las mini tazas de lata de sándwich y nivele con una cucharadita.", "Hornee en el estante del medio del horno por unos 15 minutos hasta que estén dorados y elásticos al tacto.", "Deje que los pasteles se enfríen en la lata durante dos minutos y luego colóquelos en una rejilla de enfriamiento para cables y deje que se enfríen por completo.", "Batir la crema en picos suaves y la cuchara en una manga pastelera equipada con una pequeña boquilla.", "Corta cada pastel por la mitad horizontalmente con un cuchillo de pan.", "Pase un punto de la crema en el medio de cada base de pastel y el resto en puntos alrededor de los bordes. Rocíe la mermelada sobre la crema, coloque las tapas de esponja y tamice ligeramente el azúcar glas sobre los pasteles."], "url": "www_bbc_co_uk_food_recipes_mini_victoria_sponge_61310", "title": "Bizcochos Mini Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 mini pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_victoria_sponge_61310_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla sin sal, para engrasar", "Piezas de nogal de 75g / 2½oz", "225 g / 8 oz de azúcar en polvo", "225g / 8oz de mantequilla sin sal", "Harina normal 175g / 6oz", "3 cucharaditas de gránulos de café descafeinado instantáneo, disueltos en 1 cucharada de agua hirviendo", "2½ cucharaditas de polvo de hornear", "½ cucharadita de bicarbonato de soda", "4 huevos grandes de gallinas camperas", "4 cucharaditas de leche entera", "500g / 1lb 2oz de azúcar glas", "175g / 6oz de mantequilla sin sal", "2½ cucharaditas de café descafeinado instantáneo, disuelto en suficiente agua hirviendo para hacer una pasta suave", "3-4 cucharaditas de polvo de brillo (opcional)", "Piezas de nogal 100g / 3½oz, aplastadas", "granos de café de chocolate, para decorar (opcional)"], "method": ["Para la esponja, precaliente el horno a 170C / 325F / Gas 3 y engrase y alinee tres bandejas para hornear de 23x33cm / 9x13 con papel para hornear.", "Para la esponja, coloque las nueces y el azúcar en un procesador de alimentos y muela en una consistencia de polvo grueso. Transfiera a un tazón grande o a un mezclador independiente.", "Agregue la mantequilla al tazón y bata hasta que quede suave y liviano. Tamizar la harina y continuar mezclando. Agregue todos los ingredientes restantes y mezcle hasta lograr una consistencia suave.", "Divida la mezcla por igual entre las latas preparadas y alise la superficie. Hornee durante 10-12 minutos, o hasta que estén dorados y elásticos para tocar. Deje que se enfríe durante unos minutos antes de salir de las latas en bastidores de alambre.", "Cuando los pasteles estén completamente fríos, corte 54 círculos con un cortador redondo de 5 cm / 2 pulgadas.", "Para el llenado, tamice 350g / 12oz de azúcar glas en un tazón grande o en un mezclador independiente. Agregue la mantequilla, la mitad de la mezcla de café y el polvo de lustre y mezcle hasta que tenga una capa suave de crema de mantequilla con un suave brillo dorado. Transfiera a una manga pastelera equipada con una boquilla simple.", "Para el relleno, mezcle la pasta de café restante con cuatro cucharadas de agua. Tamiza el azúcar glas restante en un tazón y agrega la mezcla de café para hacer glaseado glaseado para la parte superior de los pasteles. Si el glaseado es muy espeso, agregue más agua hasta que el glaseado se desprenda de una cuchara en gruesas cintas.", "Para armar los pasteles, tome un tercio de los círculos de la torta y póngale crema de mantequilla de café en la parte superior. Cubra con otro círculo de pastel y pinte más crema de mantequilla en la parte superior. Agregue una última capa de pastel y rocíe la glaseado glaseado. Cubra con pedazos de nuez machacados y granos de café con chocolate, si los usa."], "url": "www_bbc_co_uk_food_recipes_miniature_coffee_and_70008", "title": "Pasteles de café y nueces en miniatura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 18 mini pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 40 g / 1½ oz, tamizada", "¼ cucharadita de polvo de hornear", "120g / 4¼oz de azúcar glas, tamizado, más extra para quitar el polvo", "45 g / 1½ oz de almendras molidas", "4 huevos de gallinas camperas, solo para blancos", "65g / 2¼ oz de mantequilla", "12 hojas de albahaca, finamente trituradas", "12 - 24 frambuesas, cortadas a la mitad"], "method": ["Precaliente el horno a 170 ° C / 350 ° F / Gas 4. Engrase los moldes financieros y colóquelos en una bandeja para hornear.", "Tamiza la harina y el polvo de hornear en un bol. Agregue el azúcar glas y almendras molidas y revuelva para mezclar.", "Agregue las claras de huevo y bata todo por un minuto con un batidor de alambre.", "Caliente la mantequilla en una olla pequeña hasta que los sólidos comiencen a dorarse. Incline la mantequilla en la mezcla financiera a través de un colador de té.", "Agregue las hojas de albahaca finamente trituradas.", "Deje la mezcla para descansar durante 5-10 minutos.", "Transfiera la mezcla a una manga pastelera equipada con una boquilla simple de 1 cm / ½ in.", "Pipe en los moldes financieros de silicona, llenándolos tres cuartas partes.", "Coloque dos frambuesas (si es pequeña) o una (si es grande) cortadas en dos mitades en los financistas de albahaca.", "Hornea de 10 a 12 minutos hasta que esté dorado (puede necesitar hasta 15 minutos para cocinar).", "Retire del horno y deje los financieros horneados en sus moldes durante 1-2 minutos antes de girar sobre una rejilla para terminar de enfriar.", "Cuando se enfríe, pula ligeramente a los financistas con azúcar glas tamizada."], "url": "www_bbc_co_uk_food_recipes_miniature_raspberry_and_44358", "title": "Financiadores miniatura de frambuesa y albahaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal, más extra para engrasar", "175g / 6oz de azúcar en polvo", "6 huevos de gallinas camperas, separados", "125g / 4oz de harina de auto crianza", "75g / 2½ cacao en polvo", "1 cucharadita de polvo de café instantáneo (o 1 cucharadita de gránulos de café disueltos en 1 cucharadita de agua caliente)", "Licor de grosella negra 50ml / 2fl oz", "50g / 2oz de confitura de cereza negra", "400 ml / 14 fl oz de crema batida", "50 g / 2 oz de azúcar en polvo", "25g / 1oz de azúcar glas", "1 vaina de vainilla, semillas raspadas", "400g / 14oz de cerezas negras en almíbar, escurridas", "50 g / 2 oz de chocolate negro (al menos un 70 por ciento de sólidos de cacao), rallado"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para las esponjas, en un bol bate la mantequilla y el azúcar hasta que estén pálidos y esponjosos.", "Agregue las yemas de huevo y mezcle bien.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Doble las claras de huevo batidas en la mezcla de mantequilla y yema de huevo.", "Tamiza la harina y el cacao en polvo en la mezcla.", "Agregue el café instantáneo y doble la mezcla hasta que se combine.", "Divida la mezcla de esponja en partes iguales entre cuatro latas de pastel en forma de resorte engrasadas y forradas de 7.5cm / 3 pulgadas.", "Coloque en el horno y hornee durante 20-25 minutos. Pruebe las tortas con un pincho de metal insertado en el centro de cada torta. Si los pasteles se cocinan a través del pincho saldrán limpios.", "Retire los pasteles del horno y déjelos enfriar. Rebana cada mitad por el centro para crear dos círculos de esponja de cada pastel.", "Rocíe la mitad de cada pastel con el licor de grosella negra, luego distribuya la mermelada sobre la misma mitad.", "Mientras tanto, batir la crema, el azúcar impalpable, el azúcar glasé y las semillas de vainilla juntas en un bol para mezclar hasta que se formen picos suaves cuando se quite el batidor, luego doblar en la mitad de las cerezas.", "Extienda un poco de la crema de vainilla sobre la mitad cubierta de mermelada de cada pastel, luego coloque la otra mitad en la parte superior.", "Cubra cada pastel con más crema de vainilla y decore con las cerezas restantes.", "Espolvoree cada pastel con chocolate rallado y sirva."], "url": "www_bbc_co_uk_food_recipes_miniblackforestgatea_90437", "title": "Mini tortas de bosque negro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 4 pasteles pequeños", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, separados", "Queso Cheddar de 75g / 2½ oz, rallado", "3 cucharadas de crema doble", "puñado de cohetes, picado", "½ cucharadita de harina de maíz", "sal y pimienta negra recién molida", "2 cucharadas de cebollino picado, más extra para decorar", "2 cucharaditas de mantequilla"], "method": ["Precaliente el horno y una bandeja para hornear a 200C / 400F / Gas 6.", "Coloque las yemas de huevo, el queso, la crema, el cohete y la harina de maíz en un bol y mezcle.", "Coloque las claras de huevo en un tazón limpio y bata, hasta que las claras de huevo forman picos brillantes y brillantes cuando se quita el batidor.", "Doble la mezcla de clara de huevo en la mezcla de yema de huevo y sazone bien con sal y pimienta negra recién molida.", "Dobla una cucharada de cebollino picado en la mezcla de huevo.", "Derrita una cucharadita de mantequilla en dos sartenes pequeñas de tortilla a fuego medio. Divida la mezcla entre las dos bandejas.", "Coloque las ollas en la bandeja para hornear precalentada y colóquelas en el horno para cocinar durante seis minutos, hasta que estén doradas.", "Sirva inmediatamente, adornado con el resto de las cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_minicheeseandrockets_84488", "title": "Mini soufflé de queso y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite vegetal", "1 cebolla, pelada, en rodajas", "1 diente de ajo, aplastado hasta formar una pasta con el filo de un cuchillo", "500 g / 1 lb 2 oz filetes de pescado surtidos (como el salmón, merlán, abadejo), la piel eliminada, cortada en pedazos", "125g / 5¼ oz de camarones cocidos o gambas", "75ml / 3fl oz de vino blanco", "½ lima, jugo y ralladura", "250 g / 9 oz de crema fresca", "1 cucharada de hojas de perejil fresco picado", "1 cucharada de mostaza integral", "sal y pimienta negra recién molida", "2 tomates maduros, finamente picados", "4-6 hojas de pasta filo", "125g / 4½oz de mantequilla, derretida", "hojas de ensalada de bebé mixtas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 6.", "Para el relleno, caliente el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por 4-6 minutos, o hasta que se ablanden.", "Agregue el pescado mezclado y los camarones o gambas, luego vierta el vino y lleve a la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, y continúe cocinando a fuego lento durante 2-3 minutos.", "Agregue el jugo de lima, la ralladura de lima, la crème fraîche, el perejil y la mostaza, y sazone al gusto con sal y pimienta negra recién molida. Revuelva bien y cocine a fuego lento durante 2-3 minutos más.", "Divida la mezcla de llenado por igual entre cuatro pequeños platos para pasteles o moldes. Espolvorea sobre los tomates picados.", "Para el relleno, aplaste 1-2 hojas de masa de filo, usando sus manos, para que la masa arrugada encaje sobre el molde o el plato para pastel. Repita el proceso con las hojas restantes de pasta filo. Coloque una 'tapa' de hojaldre en la parte superior de cada plato de tarta o molde. Cepille las tapas de repostería generosamente con mantequilla derretida.", "Coloque los pasteles en una bandeja para hornear y cocine en el horno durante 10-12 minutos, o hasta que la masa esté crujiente y dorada y el relleno esté burbujeante.", "Sirva los pasteles individuales en el plato con una porción de hojas de ensalada para bebés al lado."], "url": "www_bbc_co_uk_food_recipes_minifilofishpie_92714", "title": "Mini pasteles de pescado filo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva o mantequilla", "12 rebanadas de jamón de buena calidad", "12 huevos grandes", "2 cucharadas de crema", "sal marina", "pimienta negra recién molida", "2 cucharadas de perejil picado", "4 cucharadas de queso parmesano rallado"], "method": ["Caliente el horno a 180C / 350F / Gas 4.", "Ligeramente aceite o mantequilla una bandeja para muffins de 12 agujeros. Alinee la base y la mayoría de los lados de cada molde con una loncha de jamón, luego rompa un huevo en el hueco.", "Rocíe con la crema y espolvoree con sal marina, pimienta, perejil y parmesano.", "Hornee por 15-20 minutos hasta que el huevo esté listo y comience a encogerse a los lados de la lata.", "Deje que se enfríe durante cinco minutos, luego pase un cuchillo por cada molde para aflojar el jamón y el huevo, y retire a una bandeja de alambre. Coma caliente o a temperatura ambiente.", "Sirva con un puñado de hierbas y ensalada de hojas de bebé."], "url": "www_bbc_co_uk_food_recipes_minihamandeggpies_71267", "title": "Mini pasteles de jamón y huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ seta de Portobello", "½ cebolla roja, cortada en anillos gruesos", "½ tomate de vid", "2 lonchas de tocino ahumado", "2 huevos de codorniz", "2 rebanadas de pan blanco, tostado"], "method": ["Calentar el aceite en una sartén y freír el champiñón y la cebolla roja durante 5-6 minutos, o hasta que se dore. En la misma sartén, fría la mitad del tomate y el tocino durante 3-4 minutos, o hasta que el tocino esté crujiente, luego agregue los huevos de codorniz y cocine a su gusto.", "Sirva los champiñones y las cebollas en la tostada, con el tomate, el tocino y los huevos encima."], "url": "www_bbc_co_uk_food_recipes_minifryup_90126", "title": "Mini fritura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "1 tomate, semillas eliminadas, picadas", "4 cucharadas de ketchup de tomate", "3 mini panes pitta, divididos por la mitad horizontalmente", "½ pimiento amarillo, sin semillas, cortado en tiras", "½ pimiento rojo, sin semillas, cortado en tiras", "55g / 2oz de queso manchego, rebanado", "1 puñado de lechuga iceberg, rallada, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite de oliva en una sartén y freír la cebolla y el ajo durante 2-3 minutos, o hasta que se ablanden. Agregue el tomate y el ketchup y cocine a fuego lento durante 3-4 minutos, o hasta que se reduzca un poco.", "Extienda la mezcla de tomate en un lado de las mitades de pitta, coloque las tiras de pimiento en la parte superior y cubra el queso. Transfiera a una bandeja para hornear y hornee en el horno durante 3-4 minutos, o hasta que el queso comience a derretirse.", "Sirva las pizzas de pan pitta en un plato al lado de la lechuga iceberg rallada."], "url": "www_bbc_co_uk_food_recipes_minipittabreadpizzas_90715", "title": "Mini pizzas de pan pitta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120-125ml / 3½-4fl oz de agua tibia", "1 cucharada de levadura seca de acción rápida", "½ cucharada de azúcar en polvo", "1 cucharada de aceite de oliva", "150 g / 5½ oz '00' tipo de harina, más extra para quitar el polvo", "1 cucharada de sal", "Polenta de 25g / 1oz", "Guisantes 150 g / 5½ oz, escaldados en agua hirviendo, escurridos", "Habas de 150g / 5½oz, escaldadas en agua hirvienda, drenado, vainas quitadas, pieles quitadas", "pizca de pimienta negra recién molida", "Queso de oveja 200 g / 7 oz, desmenuzado", "exprimir jugo de limón", "225g / 8oz de queso crema", "5 lanzas de espárragos, a la parrilla, cortadas por la mitad a lo largo", "Brotes de guisantes de 100 g / 3½ oz", "pequeño manojo de hojas de menta fresca", "rociar aceite de oliva virgen extra, para servir"], "method": ["Para las bases de pizza 'flatbread', en un tazón grande, mezcle el agua, la levadura, el azúcar y el aceite de oliva hasta que estén bien combinados.", "En un recipiente aparte, mezcle la harina, la sal y la polenta hasta que estén bien combinados.", "Agregue los ingredientes húmedos a los ingredientes secos y mezcle para combinar. Amasar hasta que la mezcla se una como masa, luego dejar reposar por 30 minutos.", "Cuando la masa haya descansado y se haya levantado levemente, arrójela a una superficie de trabajo ligeramente enharinada. Divida la masa en diez porciones iguales, cada una del tamaño de una pelota de golf.", "Haga rodar las bolas de masa sobre una superficie de trabajo ligeramente enharinada, una a la vez, hasta 10-12 cm / 4-5 pulgadas de diámetro y 3 mm de espesor (deben parecer pan plano).", "Caliente una sartén a fuego alto. Agregue las bases de \"pizza\" de pan plano a la bandeja de la plancha en lotes. Cocine por 1-2 minutos en cada lado, o hasta que los panes planos estén cocidos y tengan marcas doradas en ambos lados. Retire de la sartén y deje a un lado para que se enfríe un poco. Repita el proceso con las bases restantes de pizza 'flatbread'.", "Para el relleno, mezcle los guisantes y las habas, el pimiento negro, el pecorino y el jugo de limón hasta obtener una pasta áspera en un almirez y mortero.", "Extienda una capa de queso crema sobre cada base de pan plano, luego extiéndala sobre una capa de pasta de guisantes y frijoles. Coloque una de las mitades de espárragos en cada base, luego coloque los brotes de guisantes y las hojas de menta a su alrededor. Rocíe sobre una pizca de aceite de oliva.", "Transfiera las \"pizzas\" de mini primavera flatbread a los platos de servir y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_miniprimaveraflatbre_91325", "title": "Mini primavera flatbread 'pizzas'", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 10 mini pizzas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de tomates enlatados, escurridos y picados", "sal y pimienta negra recién molida", "3 panes mini-pitta", "Queso Jarlsberg de 55 g / 2 oz, rallado", "2 salchichas polacas Kabanos, en rodajas", "aceite de oliva, para lloviznar", "pequeño puñado de albahaca fresca, picado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar los tomates con sal y pimienta negra recién molida y extender sobre los panes pitta. Espolvorea sobre el queso y la salchicha en rodajas.", "Rocíe cada mini pizza con un poco de aceite de oliva y coloque en una bandeja para hornear antiadherente. Transfiera al horno y hornee por 6-8 minutos, o hasta que el queso se derrita y se dore.", "Para servir, coloque las mini pizzas en platos y espolvoree sobre la albahaca."], "url": "www_bbc_co_uk_food_recipes_minipizzas_85388", "title": "Mini pitta pizzas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas fritas de 250g / 9oz, como maris piper, desirée o king edward, cortadas en trozos grandes", "2 cucharadas de queso crema", "200 g / 7 oz de salmón ahumado", "2 cucharadas de eneldo fresco más o menos picado", "1 limón, ralladura solamente, finamente rallado", "1 cucharadita de salsa de rábano picante", "1 cucharada de alcaparras escurridas, picadas (opcional)", "sal y pimienta negra recién molida", "4 cucharadas de pan fresco rellenas", "aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Hervir las papas en agua sin sal por unos 20 minutos hasta que estén tiernas. No es necesario agregar sal al agua ya que el salmón ahumado proporcionará la salinidad requerida. Escurra, deje enfriar por unos minutos, permitiendo que el vapor se evapore, y luego machaque con el queso crema hasta que quede suave.", "Picar el salmón ahumado y mezclar con puré de papas, eneldo, ralladura de limón, rábano picante y alcaparras, si se usa, y sazonar con sal y pimienta. Forma bolitas del tamaño de una nuez y aplana suavemente. Cubra ligeramente cada uno con las migas de pan y coloque en una bandeja para hornear engrasada. O cocine de inmediato o refrigere hasta que lo necesite.", "Para cocinar, rocíe un poco de aceite de oliva y hornéelo en el horno durante 10-12 minutos, volteándolo después de 5 minutos o hasta que esté dorado."], "url": "www_bbc_co_uk_food_recipes_minismokedsalmonandd_68058", "title": "Mini salmón ahumado y tortas de eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minismokedsalmonandd_68058_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, sin sal, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "Harina de levante 225g / 8oz", "90g / 3oz de mantequilla", "1 vaina de vainilla, partido, semillas raspadas", "175g / 6oz de azúcar glas, tamizado", "Frambuesas 150g / 5oz", "Mermelada de frambuesa 75g / 2½ oz"], "method": ["Precaliente el horno a 180 ° C / 360 ° F / Gas 4. Engrase y alinee seis moldes para pasteles de 7,5 cm / 2 pulg. X 10 cm / 3 pulg. Con pergamino para hornear.", "Para el pastel, coloca la mantequilla y el azúcar en un tazón y bate juntos hasta que estén pálidos y esponjosos.", "Agregue los huevos, uno a la vez, batiendo bien para combinarlos antes de agregar el siguiente.", "Agregue la harina y mezcle bien.", "Divida la masa de la torta entre las seis latas de pastel y coloque en el horno para hornear durante 25-30 minutos. Pruebe presionando un pincho de metal en el centro del pastel; si sale limpio, los pasteles están listos.", "Retire del horno y cuando esté lo suficientemente frío como para manipularlo, retírelo de las latas y déjelo enfriar en una rejilla.", "Para el relleno, coloque la mantequilla, las semillas de vainilla y el azúcar en un tazón limpio y bata hasta que espese.", "Para servir, extiende el mermelada de frambuesa en tres de los pasteles. Cubra la capa de mermelada con frambuesas, luego agregue una cucharada de crema de mantequilla en cada una.", "Coloque una de las tortas restantes encima de cada una de las tortas en capas y aspire generosamente con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_minivictoriaspongeca_88683", "title": "Bizcochos Mini Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo", "Harina normal de 85g / 3oz", "85ml / 3fl oz de leche y agua mezclada", "aceite vegetal", "1 tina de crema fresca", "2 cucharadas de rábano picante fresco", "sal y pimienta", "2-3 filetes de carne (dependiendo del tamaño)", "perejil de hoja plana, para adornar"], "method": ["Para hacer los budines de Yorkshire, agregue suavemente el huevo a la harina. Agregue lentamente el agua y la leche a la mezcla, revolviendo continuamente para mantenerla suave.", "Ponga unas gotas de aceite en cada bandeja para muffins y colóquelas en un horno medio caliente para calentarlas. Cuando la bandeja esté caliente, vierta 2,5 cm / 1 pulgada de mezcla en cada espacio y vuelva a colocar en el horno. Cocine durante aproximadamente 8-10 minutos hasta que la mezcla se hinche. Luego enfríe en una rejilla para enfriar.", "Para hacer la crema de rábano picante, simplemente mezcle todos los ingredientes.", "Cocine el filete de carne de res rara (o más si lo prefiere), corte en rodajas finas y coloque los budines de Yorkshire. Agregue una cucharada de crema de rábano picante y decore con una ramita de perejil plano."], "url": "www_bbc_co_uk_food_recipes_miniyorkshirepudding_11253", "title": "Postres de Yorkshire con carne asada y crema de rábano picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miniyorkshirepudding_11253_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750ml / 1⅓ pinta de leche entera", "Crema doble 250ml / 9fl oz", "40 g / 1½ oz de menta fresca", "420 g / 15 oz% 20% oscuridad 20 agua% 20 (70%% 20cocoa% 20 sólidos)% 20", "240 g / 8½ oz de yemas de huevo", "100 g / 3½ oz de azúcar en polvo", "Frambuesas 250 g / 9 oz", "50g / 1¾oz de azúcar glas", "1 cucharadita de extracto de vainilla", "50 g / 1 oz de azúcar en polvo", "50 g / 1¾oz de almendras molidas", "30g / 1oz plain fl our", "25 g / 1 oz de cacao en polvo", "3g de sal de mesa", "35 g / 1 oz de mantequilla salada, derretida y enfriada", "1 cestitas de frambuesas frescas", "4 hojas de albahaca picadas", "4 hojas de menta, picadas", "1 cucharada de vinagre de frambuesa o vinagre balsámico", "2 cucharadas de azúcar glas", "pimienta negra, al gusto"], "method": ["Para la cremosa de chocolate con menta, en una cacerola grande hierva la leche, la crema y la menta. Retire del fuego y reserve para infundir durante 15 minutos.", "Ponga a hervir una olla de agua y coloque un recipiente resistente al calor sobre la parte superior (no permita que el recipiente toque el agua). Agrega el chocolate. Cuando se derrita, retíralo del fuego.", "En un tazón grande, mezcle las yemas de huevo y el azúcar hasta que estén pálidos y esponjosos. Vierta la mitad de la infusión de leche sobre la mezcla de yema y agite para incorporar completamente. Agregue la mezcla de leche restante y mezcle. Transfiera a una cacerola grande y caliéntela suavemente hasta que alcance los 82C o sea lo suficientemente grueso para cubrir la parte posterior de una cuchara de madera.", "Vierta 1 litro de crema en una jarra medidora y viértala sobre el chocolate derretido, batiendo todo el tiempo hasta que se incorpore. Cubra la superficie con film transparente para evitar que se forme una piel y colóquelo en la nevera durante 4 horas para que se asiente.", "Para el puré de frambuesa, lave y seque las frambuesas y coloque 250 g / 9 oz en una olla mediana con el azúcar glas, la vainilla y 2 cucharadas de agua. Colocar a fuego medio y llevar a fuego lento, revolviendo con frecuencia. Cuando las frambuesas estén blandas, retírelas del fuego y transfiéralas a una licuadora. Licúa hasta que quede suave, luego pasa a través de un colador. Reserve en el refrigerador hasta que lo necesite.", "Para el suelo de chocolate, precaliente el horno a 160 C / 140 C Fan / Gas 3.", "Tamiza el azúcar, las almendras, la harina, el cacao en polvo y la sal en el cuenco de una batidora independiente. Agregue la mantequilla derretida y mezcle a velocidad baja-media durante 3-4 minutos, o hasta que quede suave.", "Extienda la mezcla en una bandeja para hornear forrada con papel antiadherente. Hornea por 15 minutos. Retirar del horno y dejar enfriar por completo.", "Una vez que se haya enfriado completamente, mezcle con una miga fina en un procesador de alimentos. Almacene en un recipiente hermético y use dentro de 2 semanas.", "Para las frambuesas vestidas, mezcle todos los ingredientes.", "Para servir, rocíe un poco de salsa de frambuesa en un plato de servir y cubra con una quenelle de la cremosa. Adorne con las frambuesas vestidas y el suelo de chocolate."], "url": "www_bbc_co_uk_food_recipes_mint_chocolate_cremosa_95030", "title": "Menta chocolate cremosa, puré de frambuesa, tierra de chocolate y frambuesas vestidas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 275g / 9¾oz", "40 g / 1½ oz de cacao en polvo", "¾ cucharadita de bicarbonato de soda", "½ cucharadita de sal marina en copos", "200g / 7oz de mantequilla sin sal, suavizada y cortada en cubitos", "50 g / 1 oz de azúcar en polvo", "200g / 7oz de azúcar moreno claro", "½ cucharadita de extracto de vainilla", "85g / 3oz% 20dark% 20chocolate% 20 (60% E2% 80% 9370 %% 20cocoa% 20solids),% 20finely% 20chopped", "Bastón de caramelo con sabor a menta de 40g / 1½oz, aproximadamente aplastado", "250 g / 9oz% 20dark% 20chocolate% 20 (60% E2% 80% 9370 %% 20cocoa% 20solids)", "3-4 bastoncitos de caramelo con sabor a menta, triturados hasta obtener un polvo grueso, para espolvorear (opcional)"], "method": ["Para la masa, tamice la harina, el cacao y el bicarbonato de soda en un tazón mediano. Moler en la sal y revolver. Dejar de lado.", "Ponga la mantequilla en un tazón grande y, usando una batidora eléctrica, bata hasta que quede suave y liviano. Agregue los azúcares y el extracto de vainilla, y bata durante 2 minutos, o hasta que quede suave. Agregue los ingredientes secos al recipiente y mezcle hasta que la masa se vea arenosa (que es lo que significa sable en inglés).", "Agregue el chocolate y el bastón de caramelo al tazón, luego mezcle. La masa debe verse casi como el suelo; no debería haberse formado en una gran bola. Si se mezclan durante mucho tiempo, las galletas serán duras.", "Incline la masa sobre una superficie de trabajo y presione suavemente. Divida por la mitad y enrolle en dos troncos, de aproximadamente 4 cm / 1½ pulgadas de espesor. Envuelva cada registro en una película adhesiva y enfríe durante 3 horas, o hasta que esté firme. (Alternativamente, envuelva el segundo registro en papel marrón y ate los extremos. Congele la masa para hornear en una fecha posterior.)", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Coloque tres bandejas para hornear con papel de hornear.", "Con un cuchillo delgado y afilado, corte los troncos en rondas de aproximadamente 1 cm / ½ pulgadas de espesor. Coloque los bizcochos en las bandejas para hornear, dejando 2 cm / in entre cada uno. Hornee durante 10-12 minutos, o hasta que se establezca en el exterior pero suave en el centro.", "Deje que los bizcochos se enfríen en las bandejas durante 10 minutos, luego transfiéralos a una rejilla para que se enfríen por completo.", "Para decorar, forre una bandeja para hornear con papel de hornear. Temple o derrita el chocolate. Sumerja cada galleta hasta la mitad en el chocolate, permitiendo que el exceso gotee. Poner en las bandejas de hornear preparadas y espolvorear con un poco de bastón de caramelo triturado. Deja para establecer. Los bizcochos se mantendrán durante una semana almacenados en un recipiente hermético."], "url": "www_bbc_co_uk_food_recipes_mint_chocolate_sabls_03965", "title": "Torta de chocolate con menta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace alrededor de 40 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mint_chocolate_sabls_03965_16x9.jpg", "isVegetarian": true, "recommendations": 0}]