[{"ingredients": ["300g / 10½oz de frutas secas mezcladas (pasas, pasas, pasas)", "75g / 3oz de azúcar en polvo", "2 palitos de canela", "2 cucharaditas de especias mixtas molidas", "6 dientes", "½ nuez moscada entera, finamente rallada", "1 naranja, solo ralladura, finamente rallado", "1 limón no encerado, solo ralladura, finamente rallado", "750ml / 1 pinta 5fl oz botella buena calidad vodka"], "method": ["Mezcle la fruta seca con el azúcar, los palitos de canela, las especias mixtas, el clavo de olor, la nuez moscada rallada y la ralladura de cítricos en un tazón grande.", "Vierta sobre el vodka y cúbralo con film transparente.", "Coloque en la nevera y déjela durante 3 días, revolviendo una vez al día.", "Alinee un tamiz con una doble capa de muselina fina y colóquelo sobre una jarra grande y limpia.", "Vierta la mezcla de fruta seca y vodka en el tamiz y deje que gotee dentro de la jarra.", "Vierta en una botella esterilizada."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_vodka_45343", "title": "Vodka de pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 500ml / 18fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_vodka_45343_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 lonchas de tocino rayado ahumado", "3 cucharadas de aceite de oliva", "3 papas medianas a grandes de Maris Piper", "2 cebollas", "sal y pimienta negra recién molida", "puñado de tomillo", "1 x 2.5kg / 5lb 8oz pato", "6 hojas de laurel", "una copa de vino en Madeira"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar el tocino en trozos del tamaño de un sello postal y freír directamente en la lata de asar con un poco de aceite. Agregue los discos en rodajas finas de las papas, esparza sobre la cebolla en rodajas y raspe en el tomillo. Freír por completo hasta que el tocino se fríe y las papas empiecen a calentarse.", "Sobre esta base, coloque el pato, rellénelo con las hojas de laurel y tápelo durante 60-90 minutos. Verifica que el pato esté cocido. Sus jugos deben ser claros sin ningún rastro de sangre. Retire la lata del horno, suba el fuego a 220C / 425F / Gas 8, coloque el pato y las papas en una lata nueva o en un plato para servir a prueba de calor, luego regréselo al horno mientras prepara la salsa.", "Coloque la lata de tueste original sobre el fuego y vierta en el Madeira. Con una cuchara de madera, desaloje todos los sedimentos crujientes caramelizados y revuélvalos para hacer la salsa. Sirve el pato y las papas con la salsa."], "url": "www_bbc_co_uk_food_recipes_christmas_quackers_23472", "title": "Quackers de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_quackers_23472_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas de 1.5kg / 3lb y 5oz, peladas y en rodajas finas", "2 cebollas, en rodajas finas", "500ml / 18fl oz de caldo de pollo", "1 x 2kg / 4lb 8oz pato entero, menudencias quitadas", "1 clementina, cortada por la mitad", "1 ramita de canela", "½ cucharadita de polvo chino de cinco especias", "75 g / 2½ oz de mantequilla", "1 cabeza de repollo Savoy, hojas trituradas", "50g / 1¾oz de arándanos secos", "sal marina y pimienta negra recién molida", "2 manzanas Bramley, peladas, sin núcleo, picadas", "200g / 7oz de arándanos frescos", "5 cucharadas de sidra", "2-3 cucharadas de azúcar en polvo, al gusto"], "method": ["Arregle los estantes de su horno para que haya espacio para el pato en la parte superior y las papas en el estante inmediatamente debajo. Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque las papas y las cebollas en un plato grande para asar, condimente cada capa con sal y pimienta negra recién molida. Vierta sobre el caldo, aplanando la capa superior hacia abajo.", "Coloque las papas en el estante inferior en el horno.", "Pierce la piel de pato con un tenedor y rellena el extremo del cuello de la cavidad con las mitades de satsuma y la rama de canela. Frote el polvo de cinco especias por toda la piel y sazone con sal y pimienta negra recién molida.", "Coloque el pato directamente sobre la rejilla del horno encima de las papas, para que los jugos del pato goteen sobre las papas mientras se cocinan. Si su plato con las papas es pequeño, puede ser útil poner una bandeja vacía muy grande en el fondo del horno para atrapar cualquier gota de grasa.", "Asar durante 1½-2 horas, o hasta que el pato esté bien cocido y las papas estén tiernas y doradas.", "Mientras tanto, para la salsa especiada de manzana y arándano, ponga a hervir las manzanas, los arándanos y la sidra en una sartén. Reduzca el fuego hasta que hierva a fuego lento y cocine a fuego lento durante 10 minutos, revolviendo ocasionalmente, hasta que los arándanos se rompan y la mezcla se espese. Sazonar, al gusto, con azúcar, si es demasiado ácido, luego verter la salsa en un tazón para servir y reservar.", "Cuando el pato esté cocido, retírelo del horno y déjelo reposar durante 10 minutos en un plato de servir mientras cocina el repollo.", "Vierta suficiente agua en el fondo de una sartén grande para llegar a 1 cm / ½ pulgada por los lados de la sartén. Agregue la mitad de la mantequilla y déjela hervir. Cuando la mantequilla se haya derretido, agregue la col y hiérvala hasta que se haya marchitado, revolviendo ocasionalmente. Agregue los arándanos secos y cocine por otros 1-2 minutos, o hasta que la mayor parte del agua se haya evaporado, luego sazone al gusto, con sal y pimienta negra recién molida.", "Para servir, espolvoree la col marchita (escurrida, si es necesario) en un plato para servir y coloque el pato asado encima. Sirva las papas y la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_christmas_roast_duck_83066", "title": "Pato asado de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_roast_duck_83066_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Recortes de salmón ahumado 200 g / 7 oz", "100g / 3½ oz de queso crema", "75g / 2½ oz de crema agria o crema fresca", "½ limón, jugo y ralladura de ralladura", "pimienta negra recién molida", "Rebanadas de pepino", "eneldo fresco pequeño racimo (opcional)", "24 tostadas crostini o mini Melba", "½ bulbo de ajo, sin pelar", "150 g / 5½ oz de mayonesa de buena calidad", "250 g / 9 oz de gambas cocidas, peladas y jumbo", "1 limón, solo jugo", "perejil pequeño de hojaldre, picado", "36 sofás blinis", "Recortes de salmón ahumado de 100 g / 3½ oz", "75ml / 2½fl oz crema agria", "1 x 50 g de tarro de caviar de lumpo", "½ limón, para exprimir"], "method": ["Para el paté de salmón ahumado, coloque el salmón, el queso crema, la crema agria, el jugo de limón y la pimienta negra en un procesador de alimentos y mezcle hasta que tenga una pasta áspera. Transfiera a un tazón de servir, o una terrina pequeña llena de película adhesiva si quiere apagarla más tarde. Refrigere por al menos 1 hora o hasta 1 semana.", "Para la mayonesa, precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Envuelva el ajo en un trozo de papel de aluminio y frótelo para sellarlo. Asar durante 20-30 minutos hasta que el ajo esté suave y dorado. Dejar de lado para enfriar.", "Coloque la mayonesa en un recipiente para mezclar y exprima cada diente de ajo de su piel como si fuera un tubo de pasta de dientes. Mezcle con un tenedor para machacar el ajo. Condimentar con sal y pimienta. Cubra con una película adhesiva y déjela en el refrigerador por hasta 3 días.", "Poco antes de servir, ponga las gambas en un tazón y exprima el jugo de limón, revolviéndolas para combinarlas. Coloque las gambas al limón en un tazón para servir, espolvoree con perejil y sazone con sal y pimienta. Sirva la mayonesa de ajo al lado para mojar.", "Inmediatamente antes de servir, caliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque los blinis en una bandeja y caliéntelos en el horno durante 5 minutos. Mientras tanto, caliente un plato para servir (el truco con estos blinis es servirlos solo tibios, los blinis fríos son pastosos).", "Asegúrate de que los adornos de salmón estén cortados en pedazos manejables listos para cubrir los blinis. Retire los blinis del horno y transfiéralos a la bandeja para servir calentada. Trabajando rápidamente, cuchara media cucharadita de crema agria en cada blini. Agregue un poco de salmón ahumado a la parte superior de los 18 blinis y un cuarto de cucharadita de caviar a los 18 restantes. Exprima el limón sobre los blinis de salmón y pásele un poco de pimienta negra. Servir inmediatamente.", "Para servir el paté de salmón ahumado, sáquelo y quítelo si tiene forma de terrina. Adorne con las rodajas de pepino, eneldo fresco y sirva extendido en tostadas pequeñas."], "url": "www_bbc_co_uk_food_recipes_christmas_seafood_89090", "title": "Bandeja de mariscos de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "450 g / 1lb de azúcar en polvo", "1 cucharada de harina de maíz", "1 cucharada de vinagre de vino blanco", "¼ cucharadita de clavo de olor molido", "½ cucharadita de jengibre molido", "1 ramita de canela", "1 limón, pelado", "1 naranja, pelada", "400 g / 14 oz de moras frescas", "Crema doble 600ml / 20fl oz", "1 cucharada de pasta de frijoles de vainilla", "50ml / 2fl oz de crème de cassis"], "method": ["Precaliente el horno a 110C / 90C Fan / Gas ½. Cubra una bandeja grande para hornear con silicona o papel para hornear.", "Batir las claras de huevo en un recipiente limpio con un batidor eléctrico, o en el recipiente de un mezclador independiente, hasta que se formen picos suaves cuando se quite el batidor.", "Agregue 300 g / 10½ oz de azúcar en polvo y continúe batiendo hasta que la mezcla esté suave y brillante y se formen picos rígidos cuando se retire la batidora. Debería escuchar que la máquina deja caer una marcha cuando la mezcla de merengue alcanza la consistencia correcta. Reduzca la velocidad de los batidores y agregue la harina de maíz y el vinagre. Batir hasta que esté muy tieso.", "Transfiera la mezcla de merengue a una manga pastelera. Pase un contorno de una forma de árbol de Navidad en la bandeja de horno preparada. Pipe un tronco rectangular en la parte inferior. Rellene el contorno con la mezcla de merengue restante, luego alise la parte superior con una espátula. Con la última mezcla de merengue, pida alrededor del borde de la forma del árbol de Navidad para formar un borde elevado. Pipeta bolitas en cada uno de los puntos para que se asemejen a chucherías.", "Hornee el árbol de Navidad en el horno durante 1½-2 horas, o hasta que esté firme, luego retírelo del horno y déjelo enfriar.", "Mientras tanto, haz el relleno. Traiga el azúcar impalpable restante y 150 ml / 5 fl oz de agua a ebullición en una cacerola. Agregue los clavos molidos, el jengibre molido, la ramita de canela y la cáscara de limón y naranja y déjela hervir durante 4-5 minutos o hasta que esté espesa y almibarada. Agregue las moras, luego retire la sartén del fuego y deje a un lado hasta que esté completamente fría.", "Cuando el merengue y el jarabe de fruta se hayan enfriado, bata la crema y la pasta de frijoles de vainilla en un bol hasta que se formen picos suaves cuando se quite el batidor, luego agrega la crema de cassis.", "Para ensamblar, transfiera el merengue a un plato de servir y extienda la crema encima. Cuchara sobre el jarabe de fruta. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_christmas_tree_pavlova_36017", "title": "Árbol de navidad pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_tree_pavlova_36017_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón, ralladura finamente rallada solamente", "250g / 9 oz de albaricoques secos listos para el consumo", "150g / 5½oz de arándanos secos y dulces", "150g / 5½oz de piña seca", "3 yemas de huevo grandes de gallinas camperas", "35g / 1¼ oz de harina de maíz", "50 g / 1 oz de azúcar en polvo", "600 ml / 20 fl oz de leche", "300 ml / 10 fl oz crema individual", "16 esponjas poco", "½ jar de mermelada de albaricoque", "20 ratafía biscuits (oro amaretti biscuits)", "250ml / 9fl oz de jerez medio seco", "Crema doble 600ml / 20fl oz", "50 g / 1¾oz de almendras en copos, tostadas"], "method": ["Primero, haz la compota de fruta. Vierta 600ml / 20fl de agua en una sartén grande, agregue la ralladura de limón y deje que hierva. Agregue los albaricoques, arándanos y piña, reservando 2 albaricoques y 5 arándanos para la decoración. Llevar a ebullición, bajar el fuego y hervir a fuego lento durante 40 minutos. Retire del fuego y deje enfriar durante al menos 4 horas, o preferiblemente durante la noche. Una vez frío, cuele la fruta, reservando el jarabe.", "Para la crema pastelera, ponga las yemas de huevo, la harina de maíz y el azúcar en un tazón grande y mezcle con un batidor. Caliente la leche y la crema juntas en una sartén hasta que estén calientes pero no hirviendo. Poco a poco mezcle las yemas, luego regrese la mezcla a la sartén. Revuelva a fuego alto hasta que la mezcla hierva y la crema se espese. Quitar el fuego, cubrir y dejar enfriar.", "Para los rellenos, divida las esponjas pequeñas y extienda generosamente con la mermelada de albaricoque. Coloque un sándwich y coloque en la base de un plato de bagatela de 3 litros / 5 ¼, muy juntos, cortando para que quepan si es necesario. Desmenuce las ratafias en la parte superior.", "Combine 250ml / 9fl oz del jarabe de fruta reservado con el jerez y espolvoree sobre la esponja y desmenuce los bizcochos. Nivele la superficie presionando hacia abajo con una cuchara.", "Esparce la fruta regordeta sobre la esponja, luego extiende la crema enfriada sobre la fruta. Cúbralo y déjelo hasta que esté completamente frío antes de transferirlo al refrigerador para enfriarlo y ponerlo.", "Para decorar, bata la crema hasta que esté lo suficientemente rígida como para sostener una forma suave y flexible. Con una cuchara, coloque la mitad en una manga pastelera con una boquilla simple y extienda suavemente la mitad restante sobre la superficie de la crema pastelera y espolvoree con las almendras. Aplique gotas de crema alrededor del borde del tazón. Dividir a la mitad los albaricoques reservados, luego cortar en rodajas finas. Corta cada arándano en tres pedazos pequeños. Ponga un pedazo de albaricoque y un pedazo de arándano en cada gota de crema para decorar. Cubra y refrigere hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_christmas_trifle_17719", "title": "Bagatela de Navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_trifle_17719_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["115g / 4oz de mantequilla sin sal", "100 g / 3½ oz de azúcar en polvo", "2 naranjas, ralladura finamente rallada solamente", "1 huevo pequeño de granja, golpeado", "150 g / 5½ oz harina natural, más extra para quitar el polvo", "50g / 1¾oz de harina de maíz", "50 g / 1¾oz de almendras molidas", "40 g / 1½ oz de pistachos o pistachos", "150 g / 5½ oz de chocolate blanco, cortado en trozos", "25 g / 1 oz de arándanos secos", "40 g / 1½ oz de bérberos secos"], "method": ["Crema junto la mantequilla y el azúcar. Agregue la ralladura de naranja y dos tercios del huevo. Agregue las harinas y las almendras y mezcle para formar una masa, agregando un poco de harina extra si lo necesita para hacer una masa enrollable.", "Enharine ligeramente una superficie de trabajo y extienda la masa a 8 mm. Coloque en una bandeja para hornear y enfríe en el congelador por 15 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Corta 18 galletas con una plantilla de anillo de 5cm / 2 pulgadas de diámetro y corta un círculo más pequeño en el medio para que parezca una corona, volviendo a enrollar la masa si es necesario.", "Hornea de 12 a 15 minutos. Retire y reserve para enfriar.", "Si ha comprado pistachos enteros, empápelos en agua hirviendo durante 2-3 minutos, luego póngalos en piel y córtelos en astillas.", "Derrita el chocolate blanco en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua. Use una espátula pequeña para rociar y extender sobre los bizcochos.", "Decora con los pistachos, los bérberos y los arándanos. Deja para establecer."], "url": "www_bbc_co_uk_food_recipes_christmas_wreath_66081", "title": "Galletas de guirnalda de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 18 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_wreath_66081_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla grande, picado grueso", "Albaricoques secos de 225 g / 8 oz, recortar en trozos pequeños", "Pan rallado blanco fresco de 225 g / 9 oz", "75g / 3oz de mantequilla", "225g / 8oz de castañas congeladas, descongeladas, toscamente picadas", "generoso manojo de perejil fresco, picado", "sal", "pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Unte con mantequilla un plato para horno poco profundo.", "Agregue 600 ml / 1 pinta de agua en una sartén con la cebolla y los albaricoques. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante unos cinco minutos. Desagüe.", "Ponga las migas de pan en un tazón grande. Derrita la mantequilla en una sartén y vierta la mitad de esto en las migas de pan.", "En la mantequilla restante, freír las castañas a fuego alto hasta que estén ligeramente doradas. Incline en el recipiente con el pan rallado. Agregue los albaricoques, la cebolla y el perejil al bol. Condimentar con sal y pimienta.", "Convierta en un plato a prueba de horno, con mantequilla y poco profundo y hornee en un horno precalentado durante unos 25-30 minutos hasta que esté crujiente y caliente."], "url": "www_bbc_co_uk_food_recipes_christmasapricotandc_73428", "title": "Albaricoque de Navidad y relleno de castaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasapricotandc_73428_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, suavizada a temperatura ambiente", "100 g / 3½ oz de azúcar en polvo", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de extracto de vainilla", "Harina normal de 275g / 10oz", "Para decorar", "400g / 14oz de azúcar glasé", "3-4 cucharadas de agua", "2-3 gotas de colorantes de alimentos", "Brillo comestible"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Cubra una bandeja para hornear con papel resistente a la grasa.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos, livianos y esponjosos.", "Batir el huevo y el extracto de vainilla, poco a poco, hasta que estén bien combinados.", "Agregue la harina hasta que la mezcla se una como masa.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 1 cm / ½ pulg.", "Usando cortadores de galletas o un vaso, corte los bizcochos de la masa y colóquelos cuidadosamente sobre la bandeja para hornear. Para hacer adornos de árboles de Navidad, haga un agujero cuidadosamente en la parte superior de la galleta con una pajita.", "Hornee los bizcochos por 8-10 minutos, o hasta que estén pálidos dorados. Poner a un lado para endurecer durante 5 minutos, luego enfriar en una rejilla de alambre.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y agregue suficiente agua para crear una mezcla suave. Agregue el colorante de alimentos.", "Cuidadosamente, extienda el glaseado sobre los bizcochos con un cuchillo y espolvoree sobre el brillo. Dejar de lado hasta que la formación de hielo se endurezca."], "url": "www_bbc_co_uk_food_recipes_christmasbiscuits_93733", "title": "Galletas de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 36 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasbiscuits_93733_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cebolla roja picada", "1 diente de ajo, picado", "Recortes de cordero de 100 g / 3½ onzas", "½ batata, finamente picada", "2 cucharadas de puerto", "150ml / 5fl oz de caldo de verduras", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado", "100 g / 3½ oz de pan, cortado en cubos", "1 cucharada de aceite de oliva", "80g / 3oz Stilton"], "method": ["Precalentar la parrilla a su configuración más alta.", "Caliente el aceite en una sartén y agregue la cebolla y el ajo. Freír durante dos minutos hasta que se ablanden.", "Agregue los adornos de cordero y freír hasta que se dore por todas partes.", "Agregue la batata, el puerto y el caldo, lleve a ebullición y cocine durante diez minutos, o hasta que la batata esté suave. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el perejil.", "Mientras tanto, para los croûtons, coloque el pan en una bandeja para hornear y rocíe con el aceite de oliva. Coloque debajo de la parrilla para tostar ligeramente.", "Espolvoree la tostada con el queso y vuelva a la parrilla hasta que el queso se haya derretido.", "Sirva la sopa en un tazón con los croûtons cursis espolvoreados."], "url": "www_bbc_co_uk_food_recipes_christmasbrothwithch_84924", "title": "Caldo de Navidad con croûtons cursi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "¼ cucharadita de sal", "½ cucharadita de especias mixtas", "½ cucharadita de canela molida", "200g / 7oz de mantequilla", "200g / 7oz de azúcar moreno oscuro", "2 cucharadas de melaza negra", "1 cucharada de mermelada", "¼ cucharadita de esencia de vainilla", "4 huevos de gallinas camperas, ligeramente golpeados", "800g / 1¾lb de frutas secas mezcladas", "100g / 3½oz de cáscara mixta picada", "150g / 5oz de cerezas glacé, reducidas a la mitad", "100g / 3½ oz de almendras blanqueadas, picadas", "brandy", "Mazapán 200g / 7oz", "1-2 cucharadas de mermelada de albaricoque, calentado", "3 claras de huevo de gallinas camperas", "600g / 1lb 5oz de azúcar glas, tamizado", "1½ cucharadita de glicerina líquida - opcional", "1 cucharada de jugo de limón"], "method": ["Caliente el horno a 150C / 300F / Gas2. Engrase una ronda de 20 cm / 8 pulgadas o una lata cuadrada de 18 cm / 7 pulgadas y alinee la parte inferior y los lados con papel para hornear.", "Tamiza la harina, la sal, la mezcla de especias y la canela en un bol.", "Ponga la mantequilla y el azúcar en un tazón grande y mezcle el azúcar, la melaza, la mermelada y la esencia de vainilla hasta que esté suave y esponjoso.", "Mezcle los huevos un poco a la vez en la mezcla y agregue una cucharada de harina con la última cantidad.", "Dobla la mezcla de harina restante hasta que esté bien mezclada y luego mezcla la fruta seca, la cáscara mixta, las cerezas glace y las almendras.", "Convierta la mezcla en la lata preparada y haga un pequeño hueco en el centro.", "Hornee en el horno por 3 horas y luego pruebe con un pincho. Si no está listo hornee por hasta otra hora, pruebe cada 20 minutos hasta que el pincho salga limpio. Es posible que deba cubrir la parte superior con un pedazo de papel de aluminio si comienza a verse demasiado oscuro.", "Retire del horno y deje enfriar en la lata durante 15 minutos. Enciéndalo en una rejilla y déjelo enfriar.", "Una vez frío, haga unos agujeros en la torta con un pincho y vierta más de 3-4 cucharadas de brandy. Deje que el brandy se empape en la torta. Guarde la torta envuelta en papel de aluminio y en un recipiente de plástico o estaño hermético con los agujeros hacia arriba. Para un pastel rico y húmedo, cuchara cada unas pocas cucharadas de brandy cada semana hasta que esté listo para el hielo y decorar su pastel.", "Para decorar el pastel, coloque el pastel sobre un papel de aluminio o sobre un plato de pastel. Espolvorea tus manos y la superficie de trabajo con un poco de azúcar glas y amasa el mazapán hasta que esté suave. Estirar la mitad del mazapán para que se ajuste a la parte superior de la torta y extender el resto en tiras para que quepan alrededor de los lados de la torta.", "Cepille todo el pastel con la mermelada de albaricoque caliente y luego coloque el mazapán encima y alrededor del pastel. Cubra el pastel con una toalla de té limpia y luego déjelo en un lugar fresco para que se seque por lo menos un día.", "Para hacer la guinda, batir ligeramente las claras de huevo agregando el azúcar a intervalos. Batir bien hasta que la formación de hielo llegue a los picos suaves. Agregue la glicerina si está usando y el jugo de limón. Extienda el glaseado sobre el pastel, ya sea helado plano usando una regla limpia o formando suaves picos. Decorar con adornos navideños."], "url": "www_bbc_co_uk_food_recipes_christmascake_2359", "title": "pastel de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_2359_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mazapán 200g / 7oz", "1-2 cucharadas de mermelada de albaricoque, calentado", "3 claras de huevo", "600g / 1lb 5oz de azúcar glas, tamizado", "1½ cucharadita de glicerina líquida - opcional", "1 cucharada de jugo de limón"], "method": ["Coloque la torta en un tablero de aluminio o en un plato de pastel.", "Espolvorea tus manos y la superficie de trabajo con un poco de azúcar glas y amasa el mazapán hasta que esté suave.", "Estirar la mitad del mazapán para que se ajuste a la parte superior de la torta y extender el resto en tiras para que quepan alrededor de los lados de la torta.", "Cepille todo el pastel con la mermelada de albaricoque caliente y luego coloque el mazapán encima y alrededor del pastel.", "Cubra el pastel con una toalla de té limpia y luego déjelo en un lugar fresco por al menos un día.", "Para hacer la guinda, batir ligeramente las claras de huevo agregando el azúcar a intervalos. Batir bien hasta que la formación de hielo llegue a los picos suaves. Agregue la glicerina si está usando y el jugo de limón.", "Extienda el glaseado sobre el pastel, ya sea helado plano usando una regla limpia o formando suaves picos. Decorar con adornos navideños."], "url": "www_bbc_co_uk_food_recipes_christmascakeicing_2360", "title": "Glaseado de pastel de Navidad", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "1 pastel", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de margarina de soja (o cualquier tipo de mantequilla que te guste)", "1 plátano maduro grande", "2 limones grandes, corteza finamente rallada y solo jugo", "Ciruelas pasas 100g / 3½oz, apedreado y reducido a la mitad", "75 g / 3oz de pasas", "75g / 3oz sultanas", "75g / 3oz pasas de Corinto", "Albaricoques secos suaves de 150g / 5oz, cortados en trozos bastante grandes", "50g / 2oz de cáscara mixta", "75g / 2½oz de nueces, a la mitad y 25g / ¾oz de avellanas, picado O 75g / 3oz de semillas de calabaza grandes y 25g / ¾oz de semillas de girasol", "2 huevos (o 2 cucharaditas de cucharadita de polvo de hornear sin gluten para hacer un pastel sin huevo)", "75g / 2½ oz de polenta gruesa y 75 g / 2½ oz de harina de arroz y 1 cucharadita de cucharadita de goma de xantano O 150 g de harina sin gluten que ya incluye goma de xantano", "2 cucharaditas de nuez moscada molida apilada", "1 cucharada de canela molida", "1 jengibre molido cucharadita de jengibre", "½ cucharadita de clavo de olor molido", "2 cucharadas de brandy (opcional)"], "method": ["Precalentar el horno a 160 ° C / 300 ° F / Gas 3.", "En un procesador de alimentos bata la mantequilla / margarina con el plátano y el jugo de limón y la corteza. Vierta en un tazón.", "Mezcle la fruta seca y nueces o semillas.", "Batir los huevos si los estás usando.", "El tamiz que alguna vez te da se usa con el polvo de hornear (si lo estás sustituyendo por los huevos) y las especias.", "Dobla los huevos (si los estás usando) en la mezcla de frutas alternativamente con las harinas. Agregue un poco de brandy si lo desea.", "Cubra una lata para pastel de 20cm / 8in con papel engrasado engrasado. Vierta la mezcla y nivele la parte superior.", "Hornee durante aproximadamente dos horas o hasta que un pincho insertado en el medio salga limpio.", "Retirar de la lata y enfriar sobre una rejilla.", "Coma como está o almacene para congelarlo en Navidad. También puedes decorar este pastel con nueces enteras como almendras."], "url": "www_bbc_co_uk_food_recipes_christmascake_77307", "title": "Pastel de Navidad sin gluten", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 20 cm / 8 en pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_77307_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de cebollas, peladas y picadas", "5 cucharadas de agua", "900 g / 2lb para cocinar manzanas, peladas, sin corazón y picadas", "Peras 700g / 1½, peladas, sin corazón y picadas", "Fechas de 85g / 3oz, apedreado y picado", "570ml / 1 pinta de vinagre de sidra", "1 cucharadita de sal", "1 cucharadita de canela molida", "1 cucharadita de polvo de cayena", "225g / 8oz de azúcar"], "method": ["Coloque las cebollas y el agua en una sartén grande de base pesada. Llevar a ebullición y cocine a fuego lento hasta que esté suave.", "Agregue las manzanas y las peras y continúe cocinando suavemente por 15-20 minutos. Agregue las fechas, la sal, las especias y la mitad del vinagre. Cocine, revolviendo ocasionalmente hasta que la mezcla se espese.", "Agregue el azúcar y el resto del vinagre, revolviendo hasta que el azúcar se disuelva. Continúe cocinando a fuego lento hasta que la salsa picante se vuelva espesa. Revuelva de vez en cuando.", "Cuando esté listo, póngalo en recipientes esterilizados y déjelo madurar durante una semana o más."], "url": "www_bbc_co_uk_food_recipes_christmaschutney_2803", "title": "Chutney de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1.8kg / 4lb", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 tallos de ruibarbo", "2 cucharadas de azúcar mascabado ligero", "1 naranja, solo jugo", "pellizcar canela molida", "Harina normal de 55g / 2oz", "pizca de tierra mezcla de especias", "2 cucharadas de mantequilla finamente picada", "1 cucharada de azúcar en polvo", "100ml / 3½fl oz de crema de vainilla fresca lista para usar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Recorte y pele el ruibarbo. Cortar el ruibarbo en trozos y colocar en una sartén a fuego medio.", "Agregue el azúcar mascabado ligero, jugo de naranja y canela. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 8-10 minutos, hasta que el ruibarbo esté tierno, pero aún mantenga su forma.", "Mientras tanto, tamiza la harina y mezcla la especia en un tazón.", "Agregue la mantequilla y frote en la mezcla de harina con los dedos hasta que la mezcla se asemeje a pan rallado fino.", "Agregue el azúcar impalpable y revuelva para combinar.", "Transfiera el ruibarbo guisado a un plato resistente al horno y espolvoree sobre una capa fina y uniforme del relleno de crumble.", "Transfiera la migaja al horno para hornear durante 10-12 minutos, o hasta que la cobertura esté cocida y ligeramente dorada.", "Caliente la crema de vainilla en una sartén pequeña, luego transfiera a una jarra de servir.", "Sirva el crumble en su plato en la mesa (coloque debajo una tabla gruesa y resistente al calor), con una jarra de crema para que los invitados puedan ayudarse a sí mismos."], "url": "www_bbc_co_uk_food_recipes_christmascrumblewith_87717", "title": "Crumble de Navidad con natilla de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz, tamizada", "100 g / 3½ oz de azúcar en polvo de oro", "100ml / 3½fl oz de aceite de girasol", "75ml / 2½ fl oz de leche", "1 huevo grande de gallinas camperas", "50g / 1¾oz de chocolate negro de buena calidad, picado", "1 cucharada colmada de carne picada de alta calidad", "50g / 1 ¾oz de chocolate blanco de buena calidad, picado", "50g / 1¾oz de arándanos secos (o frescos)"], "method": ["Precalienta el horno a 190 ° C / 375 ° F / Gas 5 y coloca 24 cajas de mini muffins dentro de una lata de mini muffin.", "Mezcle la harina y el azúcar en un tazón, luego haga un pozo en el centro. Batir el aceite, la leche y el huevo y verter lentamente en el recipiente, revolviendo suavemente. Divida esta mezcla entre dos cuencos. En un tazón agrega el chocolate amargo y la carne picada. Agregue el chocolate blanco y los arándanos al otro tazón. Revuelva muy suavemente.", "Divida las dos mezclas entre las 24 cajas de muffins y hornee por 20 minutos o hasta que estén doradas y se hayan levantado.", "Retire los muffins a una rejilla de alambre y coma bien."], "url": "www_bbc_co_uk_food_recipes_christmasminimuffins_73210", "title": "Mini magdalenas de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasminimuffins_73210_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de pasas", "4 cucharadas de ron oscuro", "6 hojas de gelatina", "1 litro / 1¾ pintas de crema doble", "120 g / 4½ oz de azúcar en polvo", "1 cucharadita de jengibre molido", "1 cucharadita de pimienta de Jamaica molida", "¼ cucharadita de nuez moscada, al gusto", "1 cucharadita de canela molida", "1 puñado de bayas, como grosellas rojas, para servir"], "method": ["Coloque las pasas en un tazón pequeño y cubra con el ron. Déjalo a remojo durante al menos 30 minutos.", "Mientras tanto, remoje las hojas de gelatina en un recipiente con agua fría hasta que se ablanden. Drene y exprima cualquier exceso de líquido con sus manos.", "En una sartén de base pesada, caliente la crema doble, el azúcar y las especias molidas. Llevar a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 2-3 minutos, batiendo hasta que el azúcar se haya disuelto.", "Retire la mezcla de crema del fuego y mezcle con la gelatina drenada hasta que se disuelva. Escurra las pasas y agregue la mezcla de crema (deseche el líquido de remojo).", "Vierta la mezcla en diez moldes o moldes de 200ml / 7fl oz, llenándolos a tres cuartas partes. Déjelo enfriar por completo, luego cúbralo con film transparente y deje enfriar en la nevera durante al menos dos horas, o hasta que se endurezca.", "Para servir, sumerja los moldes brevemente en agua caliente para aflojar cada panna cotta y colóquelos en platos para servir. Esparce sobre algunas grosellas rojas para adornar."], "url": "www_bbc_co_uk_food_recipes_christmaspannacotta_93082", "title": "Panna cotta de navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspannacotta_93082_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12¼ oz de sultanas", "350 g / 12¼ oz de pasas o pasas de Corinto", "150g / 5¼ oz de higos secos, picados", "125g / 4½oz de cáscara confitada", "100 g / 3½ oz de albaricoques secos", "75 g / 2½ oz de cerezas glaseadas oscuras, reducidas a la mitad", "150ml / 5fl oz de aguardiente", "100g / 3½ oz de jengibre en almíbar, picado, más 2 cucharadas de jarabe", "2 manzanas o membrillos, rallados", "2 naranjas, jugo y ralladura", "6 huevos, golpeados", "250 g / 8¾oz de sebo triturado", "350g / 12¼ oz azúcar suave mascabado", "250g / 8¾oz de pan de migas frescas", "175g / 6¼ oz de harina de auto crianza", "1 cucharadita de especias mixtas", "2 sixpences o monedas antiguas (opcional)"], "method": ["Para esta receta necesitarás dos recipientes de plástico para budín de 1,5 litros (2½ pinta) con tapas.", "Remoje las sultaninas, las pasas, las grosellas, los higos, la cáscara, los albaricoques y las cerezas en el brandy durante la noche, dándole un buen revuelo de vez en cuando.", "Al día siguiente, en un tazón grande mezcle el jengibre, el jarabe, las manzanas o los membrillos, el jugo de naranja y la ralladura con los huevos, el sebo, el azúcar, las migas y la harina.", "Agregue la fruta y especias empapadas.", "Engrase los dos cuencos con leche y divida la mezcla entre ellos. Agrega monedas ahora si las usas.", "Corta dos círculos de papel a prueba de grasa para cubrir la parte superior del pudín y dobla un pliegue en el centro para permitir que el pudín se expanda.", "Ponga tapas en las cuencas y budines al vapor por 3½ horas.", "Deje enfriar los postres antes de quitar el papel resistente a las grasas y cubra bien con la película adhesiva y la tapa. Los postres ahora se pueden guardar en un lugar fresco y seco hasta Navidad.", "Para recalentar, cocine al vapor durante 3½ horas más, apague y flamee con brandy."], "url": "www_bbc_co_uk_food_recipes_christmaspudding_71054", "title": "Perfecto pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_71054_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de uva", "100 g / 3½ oz de grosella", "50g / 2oz sultanas", "50g / 2oz de ciruelas pasas, picadas", "50g / 2oz de albaricoques o higos picados", "25g / ¾oz de cáscara mixta fresca o seca", "50g / 2oz de almendras en copos o, si no puedes comer nueces, semillas de girasol", "150g / 5oz de pera fresca, puré en un procesador de alimentos, con la piel puesta", "1 cucharadita nivelada de jengibre molido y canela", "Mazo de tierra de ½ cucharadita de nivel", "Suero vegetal sin gluten de 25 g / 1 oz", "2 huevos O si no puede comer huevos, 2 cucharaditas colmadas de polvo de hornear libre de gluten y de trigo", "150ml / 5fl oz de jugo de manzana o pera O 100ml / 3½oz de jugo de manzana o pera y 50ml / 2fl oz de brandy", "100g / 3½oz de harina libre de gluten y trigo O 50g / 2oz cada uno de harina de gramo y 50g / 2oz de harina de arroz"], "method": ["Mezcle todos los ingredientes secos en un tazón grande.", "Batir los huevos (si los está usando) con el jugo y el brandy si lo está usando y revolverlo en la mezcla seca.", "Tamiza las harinas junto con el polvo de hornear (si lo estás usando en lugar de los huevos).", "Dobla la harina muy bien en la fruta.", "Coloque la mezcla en un recipiente para budines, cubra con papel doblado a prueba de grasa y átelo con una cuerda o bandas elásticas.", "Coloque el recipiente en un recipiente hondo, vierta agua hasta la mitad del recipiente, cubra bien la olla y cocine a fuego lento durante 4-5 horas, controlando periódicamente el nivel del agua.", "Retire el lavabo de la olla, deseche el papel a prueba de grasa y cúbralo con nuevo. Dejar enfriar, luego guardar en una despensa fría.", "Para servir, vuelva a calentar durante 1-2 horas o vuelva a calentar en un microondas durante 3-5 minutos."], "url": "www_bbc_co_uk_food_recipes_christmaspudding_77292", "title": "Pudín de Navidad sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275g / 10oz pan rallado blanco o marrón suave", "100 g / 4 oz de albaricoques secos, cortados (aproximadamente del mismo tamaño que las pasas)", "100g / 4oz de higos secos, cortados (aproximadamente del mismo tamaño que las pasas)", "225g / 8oz pasas de Corinto", "225g / 8oz de pasas sin semillas", "225 g / 8oz sultanas", "Cáscara confitada de alta calidad 75g / 3oz, finamente picada", "50 g / 2 oz de almendras, finamente picadas", "225g / 8oz de azúcar mascabado claro u oscuro", "225 g / 8oz de sebo triturado", "½ cucharadita de sal", "1 cucharadita de especias mixtas molidas", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada recién rallada", "1 naranja, ralladura y jugo", "1 limón, ralladura y jugo", "1 manzana de comer, sin corazón y rallado", "3 huevos de gallinas camperas, ligeramente golpeados", "150ml / 5fl oz cerveza negra o cerveza oscura similar", "150ml / 5fl de leche en oz", "4 cucharadas de aguardiente", "mantequilla, para engrasar cuencos con leche"], "method": ["Coloque todos los ingredientes secos en un tazón grande y mezcle bien.", "Agregue los ingredientes húmedos y mezcle bien con sus manos (una cuchara no hace el trabajo la mitad también).", "Divida la mezcla entre dos tazones engrasados ​​con 1½ litro / 2½ pinta de pudín a prueba de calor, llenando casi hasta el borde, luego alise la superficie.", "Cubra cada tazón con un gran cuadrado de papel resistente a la grasa, luego cúbralo con un gran cuadrado de papel de aluminio. Ate las dos hojas firmemente en su lugar debajo del borde con un cordón, dejando los extremos largos del cordón sobrante para hacer un mango. Enrolle una de las longitudes de cuerdas sobrantes sobre el recipiente de budín y deslícela debajo de la cuerda tensa sosteniendo las sábanas en su lugar en el otro lado. Levante la cuerda y anude firmemente con la otra cuerda sobrante, para formar una manija segura para levantar y sacar el pudín del agua.", "Deje los postres en un lugar fresco durante la noche antes de cocinar.", "Para cocinar, ponga ambos budines en un salvamanteles en una sartén grande, profunda, de base pesada (o cada pudín en una sartén por separado). Vierta agua hirviendo en la (s) sartén (es), lo suficiente como para llegar a la mitad de los lados de los tazones.", "Cubra la (s) bandeja (s) con una tapa o una cúpula de papel de aluminio y hierva durante siete horas. Revise el nivel de agua regularmente, llenando con más agua hirviendo según sea necesario para mantener los cuencos medio sumergidos.", "Después de siete horas, retire los tazones de la sartén y déjelos enfriar. Desate y quite la lámina y las hojas a prueba de grasa y reemplace con hojas limpias y secas de papel y papel de aluminio a prueba de grasa.", "Almacene en un lugar fresco y seco (o congele si lo prefiere, aunque se mantendrán perfectamente bien durante un año o más sin congelar). Para recalentar en Navidad, regrese a una olla que contenga unos pocos centímetros de agua hirviendo, cúbralo y hágalo durante dos horas, controlando los niveles de agua de vez en cuando, hasta que se caliente por completo."], "url": "www_bbc_co_uk_food_recipes_christmaspudding_87598", "title": "pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_87598_16x9.jpg", "isVegetarian": false, "recommendations": 0}]