[{"isVegetarian": true, "title": "Warm chocolate and amaretto pudding", "url": "www_bbc_co_uk_food_recipes_warm_chocolate_and_60154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_chocolate_and_60154_16x9.jpg", "ingredients": ["500ml/18fl oz milk", "1 tbsp plain flour ", "2 tbsp caster sugar ", "1 vanilla pod, halved lengthways, seeds removed", "80ml/2½fl oz Amaretto (or other almond liqueur)", "100g/3½oz dark chocolate, finely chopped ", "50g/2oz unsalted butter ", "30g/1oz amaretti biscuits, crushed"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Warm the milk in a saucepan over a low heat.", "Mix the flour, sugar and vanilla seeds in a separate saucepan until smooth, then whisk in the warm milk, a little at a time, until smooth. Place the pan onto the heat and cook over a gentle heat for 2-3 minutes, stirring continuously.", "Whisk in the Amaretto liqueur and continue to whisk until the mixture thickens.", "Remove the pan from the heat and stir in the chocolate and butter.", "To serve, spoon the mixture into serving glasses and sprinkle over the crushed amaretti biscuits."]}, {"isVegetarian": true, "title": "Chocolate fondant tart", "url": "www_bbc_co_uk_food_recipes_warm_chocolate_fondant_20828", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_chocolate_fondant_20828_16x9.jpg", "ingredients": ["100g/3½oz plain flour", "50g/1¾oz icing sugar", "50g/1¾oz diced butter, chilled", "1 large free-range egg yolk  ", "about 1 tbsp cold water", "100g/3½oz butter", "150g/5½oz plain chocolate, finely chopped, preferably with a high percentage of cocoa solids", "150g/5½oz golden caster sugar ", "75g/3oz plain flour ", "6 medium free-range eggs", "icing sugar ", "a few small strawberries, to decorate (optional)", "pouring cream (optional) "], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put flour and icing sugar in a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. ", "Add the egg yolk and water and mix until it comes together to form a firm dough.  Wrap in cling film and leave to rest in the fridge for about 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6 (180C fan). Dust the work surface with flour and then roll out the pastry as thinly as you can to a circle - about 5cm/2in larger than your flan tin. Line the tin with pastry. Don’t worry if the pastry breaks a little, it is easy to patch up. Leave to chill in the fridge for 15 minutes.  ", "Prick the base of the pastry with a fork and line the pastry case with a circle of baking parchment or foil and fill with baking beans.  Bake the pastry blind for 10 minutes, or until just lightly golden-brown, then remove the paper and beans and return the tart to the oven to cook for a further 5-7 minutes, or until pale golden-brown and dried out. ", "For the filling, melt the butter in a medium pan over a low heat, then add the chocolate and stir until melted and smooth. Remove from the heat and stir in the sugar and flour. Beat in the eggs, one at a time.  ", "Place the pastry case on a baking tray. Pour the mixture into the pastry case, filling it right to the top and place in the oven. Bake for 10-12 minutes, or until just set around the edges - but it should still be slightly wobbly in the centre.", "Remove from the oven and allow to cool.  Dust with icing sugar - if liked, you can cut a heart shape out of baking parchment and place on top of the tart before dusting with icing sugar, then remove the paper to make a stenciled effect. Or serve warm with strawberries, a dusting of icing sugar and cream."]}, {"isVegetarian": false, "title": "Warm courgette and mint salad with feta and lamb-fat dressing", "url": "www_bbc_co_uk_food_recipes_warm_courgette_and_mint_37569", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 Little Gem lettuces, leaves washed and separated ", "½ bunch fresh coriander, leaves picked, stalks chopped", "bunch fresh mint, leaves only", "100g/3½oz pitted black olives, roughly chopped", "1 green pepper, seeds removed, diced", "½ green chilli, seeds removed, sliced", "½ red chilli, seeds removed, sliced", "100g/3½oz feta, crumbled", "100g/3½oz leftover lamb dripping, warmed (or extra virgin olive oil)", "4 courgettes, cut diagonally into 0.5cm/1/4in slices ", "sea salt", "25ml/1fl oz sherry vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the lettuce leaves, coriander leaves and stalks, mint, olives, pepper, chillies and feta together in a large bowl. Arrange the mixture on a large serving platter.", "Heat a little lamb fat (or olive oil) in a large non-stick frying pan over a high heat. Fry the courgette slices in batches until golden-brown on each side (about 1-2 minutes on each side). Sprinkle a little sea salt over each batch.  ", "Add the cooked courgette slices to the salad platter. ", "Drizzle the sherry vinegar and the warmed lamb dripping over the salad, then serve."]}, {"isVegetarian": false, "title": "Warm salad of black pudding, potatoes and bacon with curried haddock", "url": "www_bbc_co_uk_food_recipes_warm_salad_of_black_05014", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "small handful fresh curry leaves", "1 tsp curry powder", "1 tsp turmeric ", "pinch salt ", "300g/10½oz thick piece haddock ", "2 tsp Dijon mustard", "100ml/3½fl oz plain yoghurt ", "pinch sugar", "100ml/3½fl oz crème fraiche ", "salt and freshly ground black pepper", "olive oil, for drizzling", "2 salad potatoes, diced", "100g/3½oz thick cut bacon, diced", "150g/5½oz black pudding ", "2 handfuls mixed leaves "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "To make the curried haddock, heat the oil in a large ovenproof frying pan over a medium heat and fry the curry leaves for 2–3 minutes, until crisp. Remove the curry leaves from the pan and drain on kitchen paper. ", "Mix the curry powder with the turmeric and salt in a bowl and sprinkle over the flesh side of the haddock. Fry the haddock in the same pan used to fry the curry leaves, skin side down over a medium heat for 2–3 minutes, then finish in the oven for 6–8 minutes, or until cooked through. ", "To make the crème fraiche and Dijon mustard cream, mix the ingredients together in a bowl. ", "To make the warm salad, heat a drizzle of olive oil in a large frying pan and fry the potatoes and bacon together for 5 minutes. Crumble in the black pudding and cook until crisp and the potatoes and bacon are golden-brown. ", "Place the salad leaves in a serving bowl add the black pudding, potato and bacon mixture and stir through. ", "Spoon some of the mustard cream onto each plate then top with the warm salad, flake over the haddock and scatter with the curry leaves. "]}, {"isVegetarian": false, "title": "Warm salad of sprouting broccoli, morels and duck egg with cashew milk and almonds", "url": "www_bbc_co_uk_food_recipes_warm_salad_of_sprouting_84438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz cashews ", "4 duck eggs", "50g/1¾oz butter", "8 large morels, chopped", "300g/10½oz sprouting broccoli", "2 tbsp fresh breadcrumbs", "1 eryngii (king oyster) mushroom, cut into thin slices", "1 tsp roasted and salted almonds, chopped, to garnish", "1 tsp mustard powder", "1 tsp demerara sugar", "1 tbsp white wine vinegar", "½ clove of garlic, minced", "150ml/5fl oz vegetable oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the cashew milk, preheat the oven to 180C/160C Fan/Gas 4 and place the cashews onto a lined baking sheet. Bake for 10 minutes or until golden-brown. Place the nuts in 300ml/10fl oz water and soak for 2 hours. Blend the nuts and water in a liquidiser until you have a velvety dressing.", "Bring a pan of water to simmering and stir until it is circling. Crack an egg into the water and cook for 4½ minutes. Remove from the water and set aside. Repeat to cook the other eggs.", "Heat half the butter in a frying pan and cook the morels for 2 minutes. Set aside. Heat the remaining butter and cook the breadcrumbs until golden. Set aside.", "To make the vinaigrette, whisk together all the ingredients in a small bowl.", "Blanch the broccoli in a pan of boiling water for 3 minutes then drain.", "To serve, lay the broccoli on the serving plates. Dress with a little vinaigrette. Coat with the cashew cream. Place the egg, morels and eryngii on top. Garnish with the breadcrumbs and almonds."]}, {"isVegetarian": false, "title": "Warm smoked Arctic char with prawns, girolles, pickled fennel and cucumber", "url": "www_bbc_co_uk_food_recipes_warm_smoked_arctic_char_92669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz distilled vinegar", "1 tbsp caster sugar", "pinch flaked sea salt", "1 tsp mustard seeds", "50g/1¾oz dill", "2 Lebanese cucumbers, finely sliced using a mandolin", "1 fennel bulb, finely sliced using a mandolin", "2 shallots, finely chopped", "50ml/2fl oz white wine vinegar", "salt", "1 Arctic char fillet", "extra virgin olive oil, for drizzling", "150g/5½oz small Scottish girolles, washed in cold water and dried on kitchen paper", "few chives, finely chopped", "150g/5½oz  cooked prawns, peeled", "dill, to garnish", "flaked sea salt"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pickled cucumber and fennel, place the vinegar in a saucepan with 100ml/3½fl oz water. Bring to the boil and add the sugar, salt and mustard seeds. Remove from the heat and leave to cool. When completely cool, add the dill, cucumbers and fennel and pickle for 2–3 hours. ", "To make the pickled shallots, place the shallots in a saucepan with the vinegar and season. Gently warm the shallots over a low heat, then set aside to cool. ", "Preheat the oven to 230C/210C Fan/Gas 8.", "To make the salad, dry the char fillet with kitchen paper, season with salt and place into the smoker bag with a drizzle of extra virgin olive oil. Place the bag on the lowest oven shelf for 5 minutes then reduce the oven temperature to 200C/180C Fan/Gas 6 and cook for a further 7 minutes. Remove from the oven and leave to rest. ", "Heat a drizzle of olive oil in a frying pan over a medium heat, cook the girolles for 2–3 minutes and season with salt. Strain the shallots and add them to frying pan, discarding the pickling liquid. Remove the pan from the heat and set aside. ", "Strain the pickled fennel and cucumber, discarding the pickling liquid and mix them with the girolles and shallots. Add the chives and mix through then divide between two plates. Break the warm smoked salmon into pieces and place on top, along with the prawns and a garnish of dill. "]}, {"isVegetarian": false, "title": "Warm smoked lobster salad with radish, and a lime vanilla mango dressing", "url": "www_bbc_co_uk_food_recipes_warm_smoked_lobster_79321", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x small whole cooked lobster", "50g/1¾oz butter", "1 mango, peeled and finely diced", "1 vanilla pod, seeds only", "1 lime, juice only", "1 tbsp sherry vinegar", "salt and black pepper", "40g/2½ oz yellow frisée lettuce (from the centre of the lettuce) ", "6 English radishes, finely sliced on a mandoline", "1 tbsp finely chopped chives", "40g/2½ oz sea aster", "40g/2½ oz bull's blood leaves", "40g/2½ oz baby red sorrel", "40g/2½ oz mache salad leaves", "1 red pepper, finely diced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut through the lobsters at the head joint, setting aside the heads. Place the lobster cut-side down onto a plate lined with kitchen paper to drain.", "Chop the tail fans off at the other end and set aside.", "Snip down the inside of the remainder of the tail shell and ease off of the lobster meat – you want the tail in one piece. Then carefully crack the claws and ease the meat out.", "Heat a large frying pan until medium hot, add the butter and lobster meat and just warm through, then remove the pan from the heat.", "Once it is cool enough cover the pan with cling film then place the smoke gun under the cling film and smoke for five seconds.", "Reseal the cling film around the pan then leave to cool while you assemble the plates. ", "For the dressing, place the mango, vanilla seeds and lime juice into a small food processor. Blend to a purée then pass through a fine sieve into a bowl.", "Add the sherry vinegar, then check for seasoning, adding more lime if needed, salt and black pepper.", "For the salad, place the frisée, radishes and chives into a bowl and dress with a little of the mango dressing.", "Combine the remaining leaves together in a separate bowl.", "To serve, place the heads of the lobster, cut-side down at the top centre of each plate. Lay a line of the dressed frisée salad down the centre of the plates.", "Carve the smoked lobster tail meat into thick slices and lay over the dressed frisée, then place the tail fan shells at the bottom.", "Place the claw meat either side of the heads at an angle – it should resemble a lobster.", "Scatter the remaining leaves around the plates, with a few pieces of red pepper in between.", "Finish with a little drizzle of the mango dressing."]}, {"isVegetarian": false, "title": "Warm smoked mackerel with honey-spiced beetroot and fresh horseradish", "url": "www_bbc_co_uk_food_recipes_warm_smoked_mackerel_48304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz extra virgin olive oil", "4 garlic cloves, peeled", "1 tbsp coriander seeds, lightly crushed", "salt and freshly ground black pepper", "1 bunch baby red beetroot with leaves", "2 lemons, zest, juice of 1 lemon, plus extra lemon juice to serve", "1 bunch golden baby beetroot", "1 bunch baby chioggia beetroot", "½ tsp smoked paprika", "½ tsp smoked hot paprika", "4 mackerel fillets, pin boned", "1 tbsp olive oil", "wood smoking chips", "3 tbsp clear honey", "½ fresh horseradish, grated", "pea shoots, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Pour the olive oil into a large baking tray and add the garlic and crushed coriander seeds and season with salt and freshly ground black pepper.", "Remove the leaves from the baby red beetroots and cook in a pan of boiling salted water for 20 seconds. Drain the leaves and add them to the olive oil mixture. Stir in the lemon zest.", "Place the red beetroot, golden baby beetroot and candied baby beetroot onto a baking tray and season with salt and freshly ground black pepper. Sprinkle over the paprika and hot paprika and roast in the oven for 10 minutes.", "Meanwhile, rub the mackerel fillets with oil and season with salt and freshly ground black pepper.", "Add the smoking chips to the smoker and place onto the heat. Place the mackerel fillets into the smoker, close the lid and smoke for 6-8 minutes, according to manufacturer's instructions. (CAUTION: smoking generates a lot of smoke. Cook in a well-ventilated area, and open the smoker outside if possible.) ", "Remove the beetroots from the oven, cut into quarters and drizzle with the honey.", " To serve, remove the beetroot leaves from the oil mixture and scatter onto each of four serving plates. Lay the mackerel fillets on top and arrange the beetroot around the plate.  Sprinkle over the fresh horseradish and pea shoots. Squeeze over a little extra lemon juice. "]}, {"isVegetarian": true, "title": "Warm spiced cauliflower and chickpea salad with pomegranate seeds", "url": "www_bbc_co_uk_food_recipes_warm_spiced_cauliflower_36652", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_spiced_cauliflower_36652_16x9.jpg", "ingredients": ["3 tbsp regular olive oil", "½ tsp ground cinnamon", "2 tsp cumin seeds", "1 small head cauliflower, trimmed and divided into small florets", "250g/9oz home-cooked chickpeas (drained weight) or a 400g tin chickpeas", "1–2 tbsp harissa, to taste ", "4 small ripe vine tomatoes (approximately 150g/5½oz), quartered", "1 tsp sea salt flakes, or to taste", "3–4 tbsp pomegranate seeds", "large bunch (approximately 100g/3½oz) flatleaf parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. ", "Pour the oil into a large bowl, add the cinnamon and cumin seeds, and stir. Tip in the cauliflower and toss to coat. Pour into a small oven tray (I mostly use a disposable foil baking tray measuring 30x20cm/12x8in) and place in the oven for 15 minutes. Don’t wash out the bowl you’ve been using.", "Add the chickpeas to the bowl, and add the harissa, tasting it first to see if you want both tablespoonfuls. Toss to coat. Add the tomatoes to the bowl, and stir to mix. ", "Remove the cauliflower and quickly tip the chickpeas and tomatoes over the cauliflower. Toss to combine and return to the oven for 15 minutes, or until the cauliflower is tender.", "Remove from the oven and sprinkle the salt over the vegetables, add half of the pomegranate seeds and toss to combine. Divide between 2 bowls.  Divide the parsley leaves – without chopping them – between the 2 bowls and toss to mix. Scatter with the remaining pomegranate seeds and serve."]}, {"isVegetarian": true, "title": "Warm, spiced oranges with labneh", "url": "www_bbc_co_uk_food_recipes_warm_spiced_oranges_with_20973", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_spiced_oranges_with_20973_16x9.jpg", "ingredients": ["2 x 150g/5½oz pots fat-free natural yoghurt", "3 oranges", "good pinch ground cinnamon", "2 star anise", "¼ tsp vanilla extract", "10g/¼ oz unsalted pistachio nuts, roughly chopped (alternatively use toasted flaked almonds)"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the labneh, line a sieve with a single layer of muslin cloth and place over a bowl. Spoon the yoghurt into the sieve and tie up the ends of the cloth. Leave to drain in the fridge overnight.", "Cut one of the oranges in half and squeeze all the juice – you should end up with 4-5 tbsp. Peel the remaining oranges and cut into thin slices.", "Pour the juice into a small saucepan and stir in the cinnamon, star anise and vanilla extract.", "Place over a medium heat and simmer for 1-2 minutes, stirring occasionally. Add the orange slices and warm through gently.", "Divide the labneh between two small dishes. Top with the warm spiced oranges and juice and scatter the nuts on top. "]}, {"isVegetarian": false, "title": "Warm tomato and onion salad with a beef dressing and sourdough croûtons", "url": "www_bbc_co_uk_food_recipes_warm_tomato_and_onion_29582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warm_tomato_and_onion_29582_16x9.jpg", "ingredients": ["2 red onions", "drizzle rapeseed oil", "½ loaf stale sourdough bread", "300g/11oz beef dripping ", "salt and black pepper", "1kg/2lb 4oz mixed tomatoes (preferably heritage varieties), cut into equally sized chunks", "1 strong English onion, thinly sliced", "2 tbsp lemon thyme leaves", "2 tbsp sea salt", "1 bunch spring onions, chopped, white and green parts kept separate", "3 tbsp cabernet sauvignon vinegar", "1 bunch chives, finely chopped", "2 tbsp toasted onion seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Peel the red onions keeping them whole. Trim the root end and then cut them into 5mm/¼in wedges, keeping the root base intact so they don’t fall apart. Drizzle with a little rapeseed oil, place on a roasting tin and roast in the oven for 20 minutes, or until caramelised.", "Break the bread into bite-sized chunks and drizzle them with half the beef dripping. Bake them in the oven until toasted and crisp. Season with salt and pepper as soon as they come out of the oven so it takes the flavour on as they cool down.", "Place the tomatoes into a large mixing bowl.  Add the English onion and thyme leaves. Add the sea salt and mix thoroughly. Leave to infuse and break down for 15 minutes. ", "After 15 minutes there will be a lot of water in the bowl. Drain the tomato mixture in a colander and then transfer the tomatoes to a baking tray and put into the oven for 1-2 minutes to warm through.", "When the tomatoes are warm, place them in a large bowl with the roasted red onions, the white parts of the spring onions and sourdough croûtons. ", "Warm the remaining beef dripping in a pan with the cabernet sauvignon vinegar (it should be about one part vinegar to three parts dripping). Mix in the chives, onion seeds and the green parts of the spring onions. Season to taste with salt and pepper.", "Dress the tomato salad with the beef dripping dressing and serve immediately."]}, {"isVegetarian": false, "title": "Warm white asparagus salad with grapefruit zest vinaigrette", "url": "www_bbc_co_uk_food_recipes_warm_white_asparagus_61636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "1kg/ 2lb 4oz white asparagus, peeled and woody ends discarded", "1 white grapefruit", "1 tbsp Dijon mustard", "1 heaped tbsp mayonnaise ", "6 tbsp sunflower oil", "1 tsp chopped chervil leaves", "sea salt and freshly ground black pepper", "griddled green asparagus ", "chargrilled bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil over a medium heat, add the egg, return to the boil, then turn the heat down to low and simmer for 10 minutes. Drain and refresh under cold water, then crack and peel the egg. Finely chop the cooked egg and leave to one side.", "Divide the asparagus into four equal-sized bunches and tie each bunch with kitchen string to secure. Bring a pan of salted water to the boil over a medium heat, add the bunched asparagus and simmer for 5-8 minutes (depending on the size of your asparagus) until tender, but with just a little resistance when pierced with the top of a knife. ", "Grate the zest from the grapefruit, reserve a pinch and put the rest in a small bowl. Peel the grapefruit, then take out four segments, cut each one in half and leave to one side, juice the rest of the grapefruit, pressing it through a fine sieve into the bowl with the zest. Add the mustard and mayonnaise and whisk together until well blended, then whisk in the sunflower oil in a steady stream. Stir in the chopped egg and chervil and season with salt and pepper to taste.", "Remove the asparagus from the pan and drain briefly on a plate lined with kitchen paper or a clean tea towel. Remove the string and put the asparagus onto four serving plates. Spoon the dressing over the top and finish with the reserved grapefruit segments and a sprinkling of the reserved zest. ", "Serve with griddled green asparagus and chargrilled bread.  "]}, {"isVegetarian": false, "title": "Warm bacon and chicken liver salad", "url": "www_bbc_co_uk_food_recipes_warmbaconandchickenl_85044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz chicken livers, trimmed", "2 tbsp plain flour", "1 tbsp olive oil", "50g/1¾oz ciabatta, cut into cubes", "25g/1oz unsalted butter", "50g/1¾oz bacon lardons", "salt and freshly ground black pepper", "handful mixed herbs, such as parsley, chives, basil ", "3 tbsp olive oil", "1 tbsp Dijon mustard", "½ lemon, juice only", "1 garlic clove, crushed", "1 tsp clear honey", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken livers, wipe the livers with kitchen paper, then coat them with the flour and shake off any excess.", "For the ciabatta cubes, heat the oil in a frying pan and fry the ciabatta cubes until crisp and golden-brown. Set aside in a bowl.", "In the same pan, melt the butter and fry the bacon lardons until crisp and golden-brown. Remove the bacon from the pan and transfer it to the bowl, leaving the remaining fat in the pan.", "Add the chicken livers to the pan and fry for 1½ minutes on each side, or until golden-brown and completely cooked through. Add the livers to the bowl with the ciabatta cubes and bacon, season with salt and freshly ground black pepper and mix well.", "For the dressing, place the oil and mustard into a bowl and whisk together until thickened. Add the lemon juice, garlic and honey. Season, to taste, with salt and freshly ground black pepper and mix well.", "Add the herbs to the bowl with the dressing and stir well to coat the leaves.", "To serve, place the dressed herbs onto a plate with the chicken livers, bacon and ciabatta cubes on top."]}, {"isVegetarian": false, "title": "Warm bacon salad", "url": "www_bbc_co_uk_food_recipes_warmbaconsalad_88564", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 rashers smoked back bacon", "1 vine tomato, seeds removed, sliced", "55g/2oz wild rocket", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the olive oil in a frying pan and fry the bacon until golden-brown and crisp, about 4-5 minutes. Remove from the pan and tear each rasher into three pieces.", "Place the bacon into a bowl with the remaining ingredients and stir well. Serve."]}, {"isVegetarian": true, "title": "Warm beetroot, green bean, potato and almond salad", "url": "www_bbc_co_uk_food_recipes_warmbeetrootgreenbea_88366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz new potatoes, cut into 1cm/½in thick slices", "50g/2oz green beans, cut into pieces diagonally", "50g/2oz flaked almonds, toasted", "3 tbsp olive oil", "2 sprigs fresh basil, torn", "3 tbsp chopped fresh parsley ", "salt and freshly ground black pepper", "1 tbsp balsamic vinegar", "½ cooked beetroot (not in vinegar), chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potato slices in a saucepan of boiling water for 5-7 minutes, or until tender. Drain.", "Blanch the beans for 3-4 minutes, then drain.", "Combine the blanched potatoes and beans and all the remaining ingredients in a bowl and stir well. Serve warm."]}, {"isVegetarian": true, "title": "Warm blackberries with cheat's brown bread ice cream", "url": "www_bbc_co_uk_food_recipes_warmblackberrieswith_7411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices brown bread", "500g/1lb2oz blackberries", "¾fl oz/1½tbsp caster sugar", "vanilla ice cream", "sprigs of fresh mint"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sliced bread in a blender and mix to a crumb then either sauté in a dry frying pan until dry or place on an oven tray and bake for 10 minutes at 200C/400F/Gas 6 until golden brown.", "Heat up a small pan on the stove then add the blackberries and the sugar.  Sauté for about 1 minute until the berries are warm but not too mashed.  Spoon the berries into the serving bowls, top with a scoop of vanilla ice cream.  Sprinkle the breadcrumbs all over the ice cream and berries.  Serve with a sprig of mint on the ice cream."]}, {"isVegetarian": true, "title": "Warm broccoli and wild rocket salad with sweet tomatoes", "url": "www_bbc_co_uk_food_recipes_warmbroccoliandwildr_88881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz purple sprouting broccoli", "100g/3½oz cherry tomatoes", "55g/2oz rocket", "4 tbsp olive oil", "2 tbsp balsamic vinegar", "1 free-range egg", "3 fresh basil leaves, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the broccoli in boiling salted water for 3-4 minutes, then drain and plunge into iced water. Drain and set aside.", "Place the tomatoes, rocket, three tablespoons of the olive oil and the vinegar into a bowl and mix well. Add the broccoli and mix again.", "Heat the remaining one tablespoon of oil in a frying pan over a medium heat. Crack in the egg and fry until cooked to your liking.", "To serve, spoon a generous portion of the salad onto a plate. Place the egg on top and garnish with the chopped basil."]}, {"isVegetarian": true, "title": "Warm bulgar wheat broth", "url": "www_bbc_co_uk_food_recipes_warmbulgurwheatbroth_79904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz bulgar wheat", "1 bay leaf", "50g/2oz red onion, finely sliced", "500ml/1 pint chicken stock (vegetarians can substitute vegetable stock)", "2 garlic cloves, chopped", "50g/2oz sunblushed tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place all of the ingredients into a large saucepan over a high heat. Bring to the boil, then reduce the heat and simmer for five minutes.", "Cut out a piece of greaseproof paper slightly larger than the pan. Place under the tap to wet slightly, then crumple it up and place inside the pan to cover the contents. Transfer to the oven to cook for ten minutes."]}, {"isVegetarian": true, "title": "Warm squash and goats' cheese salad", "url": "www_bbc_co_uk_food_recipes_warmbutternutsquasha_71454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["650g/1lb7oz butternut squash, peeled", "2 garlic cloves, thinly sliced", "2 dried chillies, crumbled", "1 cinnamon stick, broken into slices", "leaves of 1 bunch of sage", "200ml/7floz olive oil", "5 tbsp balsamic vinegar", "salt ", "freshly ground black pepper", "2½ tbsp sugar", "55g/2oz fresh goats' cheese, crumbled", "100g/3½oz loosely packed wild rocket", "½ lemon, quartered"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2 and line a baking tray with baking paper. ", "Cut the squash into 2.5 cm/1in slices.", "Halve these diagonally to give half-moon shapes. Place in a large bowl with the garlic, chilli, cinnamon and sage. ", "Add one tablespoon of the oil and two tablespoons of the vinegar, and season with salt and pepper. Toss to distribute evenly, then leave for ten minutes.", "Spread the pumpkin in a single layer on the prepared baking tray and roast until it's soft and the edges crispy, about 30 minutes. If some is burnt just pick it out.", "Place the sugar in a small saucepan and melt over a low heat. Continue cooking until it changes to a light gold colour. ", "Remove from the heat and gradually stir in the remaining vinegar. ", "Return to the heat and stir until smooth. Allow to cool.", "Stir the remaining oil into the vinegar mixture to make a dressing. ", "Toss half with the pumpkin to coat well and transfer the slices to a large serving plate.", "Toss the remaining dressing with the goats' cheese over the pumpkin and garnish with dressed rocket and the lemon wedges."]}, {"isVegetarian": false, "title": "Warm duck and citrus salad", "url": "www_bbc_co_uk_food_recipes_warmduckandcitrussal_89418", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ smoked duck breast, sliced thinly", "100g/3½oz cooked bulgar wheat", "3 fresh chard leaves, shredded", "½ bunch fivers, or small onions, or shallots, chopped", "small handful chopped Alexander leaves (optional)", "1 lime, peeled and segmented", "1 lemon, peeled and segmented", "1 orange, peeled and segmented", "salt and freshly ground black pepper", "1 tbsp soy sauce", "1 tbsp honey", "1 tsp Worcestershire sauce", "1 tbsp sesame seeds", "2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck and citrus salad, heat the oil in a frying pan over a medium heat, add the duck breast and fry gently for 2-3 minutes, or until warmed through. ", "Add the cooked bulgar wheat, chard, fivers and Alexander leaves and stir well to mix. ", "Fold in the segmented citrus fruits. Season to taste with salt and freshly ground black pepper.", "For the dressing, place all the dressing ingredients into a bowl and mix well to combine. ", "To serve, pile the warm duck and citrus salad onto a serving plate and pour the dressing over it."]}, {"isVegetarian": false, "title": "Warm chicken liver salad with perry vinegar dressing", "url": "www_bbc_co_uk_food_recipes_warmchickenliversala_962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh chicken livers", "100g/4oz mixed salad leaves (frisée lettuce , baby leaf spinach and watercress sprigs)", "3 tbsp clarified butter ", "salt and freshly ground black pepper", "4 thick slices white bread", "3 tbsp clarified butter", "1 tbsp perry vinegar", "1 tsp Dijon mustard", "pinch caster sugar", "4 tbsp sunflower oil", "1 tbsp walnut oil", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken liver salad, remove the sinew from the livers and, if the livers are quite large, cut them in half. Set aside.", "Arrange the mixed salad leaves over the base of one large serving plate.", "For the croutons, remove the crusts from the bread and cut the rest into 1cm/½ inch cubes.", "Heat the clarified butter over a medium heat in a frying pan. Add the bread cubes and stir well to coat in the butter. Fry for 4-5 minutes, stirring frequently, until the bread is golden-brown and crisp. Drain on kitchen paper and set aside. ", "Heat the clarified butter for the livers in a large, heavy-based frying pan over a high heat. Season the chicken livers with salt and freshly ground black pepper, then fry for 1-2 minutes on both sides, or until the livers are golden-brown all over but still slightly pink in the middle. Remove from the heat and allow to cool slightly before arranging on top of the salad leaves.", "For the perry vinegar dressing, return the pan used to cook the livers to the heat and add the perry vinegar, mustard and sugar. Stir well with a wooden spoon, scraping up any browned bits from the bottom of the pan. Transfer to a small bowl. ", "Add the sunflower and walnut oil to the perry vinegar mixture and season with salt and freshly ground black pepper. Whisk together until well combined, then drizzle the dressing over the chicken liver salad. ", "To serve, scatter over the chives and the croutons and serve while the livers are still hot."]}, {"isVegetarian": false, "title": "Warm duck and lettuce salad", "url": "www_bbc_co_uk_food_recipes_warmduckandlettucesa_81166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "50g/2oz smoked duck breast, chopped", "1 orange, juice only", "1 tbsp balsamic vinegar", "2 small Little Gem lettuce leaves, shredded", "salt and freshly ground black pepper", "50g/2oz roasted hazelnuts, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the olive oil in a frying pan. Fry the duck until crisp and golden.", "Add the orange juice, balsamic vinegar and the remaining olive oil. Stir through the lettuce and season with salt and freshly ground black pepper.", "Serve on a warm plate and sprinkle over the chopped hazelnuts."]}, {"isVegetarian": true, "title": "Warm goats' cheese salad", "url": "www_bbc_co_uk_food_recipes_warmgoatscheesesalad_80782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warmgoatscheesesalad_80782_16x9.jpg", "ingredients": ["290ml/½ pint extra virgin olive oil ", "100ml/3½fl oz balsamic vinegar ", "1 garlic clove, sliced ", "3 sprigs fresh thyme ", "10 fresh basil leaves", "2 red peppers, halved, seeds removed", "2 yellow peppers, halved, seeds removed", "freshly ground black pepper", "olive oil, for drizzling", "1 large aubergine (or 2 small), chopped into 1cm/½in rounds", "1 large courgette (or 2 small), chopped into 1cm/½in rounds", "200g goats' cheese log, cut into 1cm/½in thick slices", "extra virgin olive oil ", "fresh basil ", "green salad leaves of your choice (e.g. lettuce, baby spinach, endive, cos lettuce)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Preheat the grill to its highest setting.", "For the marinade, place all of the marinade ingredients into a large bowl and mix together well.", "Line a large roasting tray with a piece of aluminium foil twice the size of the tray. Place the peppers onto one half of the foil placed in the roasting tin, season with freshly ground black pepper and drizzle with olive oil. Fold over the other half of the foil to seal the peppers and place into the oven to roast for 20 minutes, turning from time to time. ", "Once the peppers are cooked and softened, place into a bowl and cover with cling film. Once cooled, peel the peppers and cut into large, but even triangles and place into the marinade.", "Place the courgette and aubergine slices onto a baking sheet. Drizzle with olive oil and season with salt and freshly ground black pepper and place under the hot grill. Grill both sides for 3-4 minutes, or until golden. Remove from the heat and place into the marinade with the peppers.", "Turn down the grill to a moderate heat.", "Place the goats' cheese rounds onto a baking sheet and place under a moderate grill. Grill for 2-3 minutes, until the cheese has melted and begun to brown.", "To serve, place the salad leaves into a large serving bowl. Add the marinated vegetables and top with the grilled goats' cheese. Drizzle with a little of the marinade and serve."]}, {"isVegetarian": true, "title": "Warm goats' cheese salad with crisp potato rosti", "url": "www_bbc_co_uk_food_recipes_warmgoatscheesesalad_88795", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz goats' cheese, sliced from a 'log'", "olive oil, for drizzling", "salt and freshly ground black pepper ", "½ lemon, juice only", "large handful each of chervil, basil, parsley", "¼ large potato, peeled, grated", "25g/1oz butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, drizzle the goats' cheese with the olive oil and season with salt and freshly ground black pepper. Heat a frying pan, add the goats' cheese and fry for 1-2 minutes on each side until golden-brown.", "Mix the lemon juice, a drizzle of olive oil, salt and freshly ground black pepper in a bowl and add the herbs, tossing well to coat evenly.", "For the potato rösti, grate the potato into a dry clean tea towel and squeeze out the excess water. Melt the butter in a small frying pan, add the grated potato and press down with a spatula or palette knife. Season with salt and freshly ground black pepper. Fry until golden-brown on both sides, turning carefully. ", "To serve, pile the herb salad onto a serving plate, place the potato rösti next to the salad and top with the warm goats' cheese."]}, {"isVegetarian": true, "title": "Warm Greek salad with parsley pesto", "url": "www_bbc_co_uk_food_recipes_warmgreeksaladwithpa_84442", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves", "large handful fresh flatleaf parsley, roughly chopped ", "25g/1oz pine nuts", "50g/2oz freshly grated parmesan cheese", "150ml/5fl oz extra-virgin olive oil ", "salt and freshly ground black pepper", "6 beef tomatoes, or 12-15 large plum tomatoes", "450g/1lb courgettes", "salt and freshly ground black pepper", "handful fresh basil leaves, plus extra for garnish", "450g/1lb Greek feta cheese, crumbled", "olive oil, for drizzling ", "18 large Kalamata black olives", "6 lemon wedges, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "To make the pesto, place the garlic and parsley into a food processor and blend together. With the food processor still running, add the pine nuts, parmesan and oil and blend until smooth. Season, to taste, with salt and freshly ground black pepper.", "Skin the tomatoes by cutting a small cross into the bottom and carefully placing them into a heatproof bowl of boiling water for about 30 seconds. Remove them with a slotted spoon and place into a bowl of iced water for one minute. The skin should then peel off easily. Once peeled, slice the tomatoes to the thickness of a pound coin.", "Heat a griddle pan until smoking. Slice the courgettes to the same thickness as the tomatoes, season with salt and freshly ground black pepper and place onto the griddle pan to cook for 2-3 minutes on each side, or until striped with griddle marks.", "To assemble the salad, place six deep 10cm/4in chefs' rings onto a baking tray. Place a layer of the tomatoes into the bottom of each ring. Season with salt and freshly ground black pepper, then spoon over a little pesto. ", "Add a couple of basil leaves to cover the pesto layer, then add a layer of feta. ", "Add a layer of griddled courgette, then repeat the layers of tomato, pesto, basil, feta and courgette. ", "Top the stacks with a layer of feta and drizzle each with a little olive oil.", "Transfer to the oven to bake for 10-12 minutes just to warm the stacks through. (You can then place the stacked chefs' rings under a hot grill to brown the feta if you want.)", "To serve, place each chefs' ring onto a plate, and arrange three olives around each stack. Carefully remove the chefs' rings and garnish each Greek salad stack with basil leaves, drizzle with olive oil and place a lemon wedge alongside."]}, {"isVegetarian": true, "title": "Warm green bean, pear, Brie and carrot salad", "url": "www_bbc_co_uk_food_recipes_warmgreenbeanpearbri_87024", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz green beans, trimmed", "1 tbsp butter", "1 tbsp caster sugar", "½ pear, cored, peeled and sliced", "½ carrot, peeled and grated", "handful fresh coriander, leaves only", "30g/1oz Brie, chopped", "1 tbsp olive oil", "¼ lemon, zest and juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of salted water to the boil and blanch the green beans for two minutes. Drain and rinse under cold water, then drain again.", "Heat the butter and caster sugar together in a small non-stick frying pan until the sugar has melted.", "Add the sliced pear to the pan and cook for two minutes, or until well coated and caramelised but still holding its shape.", "In a bowl, mix the carrot, coriander leaves and Brie together and stir in the blanched green beans.", "Drizzle the green bean mixture with the olive oil and lemon juice and stir in the lemon zest.", "To serve, pile the green bean mixture onto a serving plate and top with the caramelised pear."]}, {"isVegetarian": false, "title": "Warm lamb salad", "url": "www_bbc_co_uk_food_recipes_warmlambsalad_84697", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz lamb loin steak, fat removed", "olive oil", "salt and freshly ground black pepper", "2 garlic cloves, unpeeled, lightly crushed", "2 sprigs rosemary", "75g/3oz walnut halves", "75g/3oz green beans, blanched", "handful flat leaf parsley, chopped", "1 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub the lamb with the olive oil and season well with salt and freshly ground black pepper. ", "Heat a small ovenproof frying pan until hot, then place the lamb, garlic and rosemary into the pan and sear for 2-3 minutes on each side.", "Transfer the pan to the oven and cook for ten minutes or until cooked but slightly pink in the middle.", "Place the lamb onto a plate and cut into four slices, then add all of the remaining ingredients to a bowl and mix well to combine. ", "To serve, place the mixed salad ingredients onto a serving plate, then place the lamb on top of the salad."]}, {"isVegetarian": false, "title": "Warm mallard duck salad with Puy lentils and crisp parsnip shreds", "url": "www_bbc_co_uk_food_recipes_warmmallardducksalad_87875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 mallard duck carcass (without the breasts) roughly chopped", "25g/1oz butter", "2 shallots, sliced", "2 garlic cloves, finely chopped", "1 bay leaf", "1 sprig thyme", "freshly ground black pepper", "1 tbsp tomato purée", "150ml/5fl oz red wine", "800ml/14fl oz chicken stock ", "50g/2oz Puy lentils", "150ml/5fl oz chicken stock", "1 garlic clove, finely chopped", "1 thyme sprig", "4 mallard duck breasts", "salt and freshly ground black pepper ", "1 tbsp sunflower oil", "150-175g/5-6oz parsnips, thinly sliced lengthways (use a vegetable peeler)", "vegetable oil, for deep fat frying", "salt", "150-175g/5-6oz mixed salad leaves", "1 tbsp balsamic vinegar", "2 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, preheat the oven to 230C/350F/Gas 8.  ", "Place the mallard carcass in a roasting tin and roast in the oven for 15 minutes, until browned.", "Heat a large frying pan until hot. Add half of the butter to the pan and, when the butter starts foaming, add the shallots, garlic, bay leaf, thyme and freshly ground black pepper to the pan. Fry until well-browned.  ", "Add the tomato purée to the pan and cook for a minute or two.  ", "Add the red wine to the pan and cook until it reduces so much that nearly all of the liquid has gone.  ", "Add the roasted carcass to the pan and stir well. Pour in the stock and 200ml/7fl oz of water.  ", "Bring to the boil and then reduce the heat. Simmer over a low heat until thickened - this will take approximately 45 minutes.", "Pass the sauce through a fine sieve into a clean pan or jug, and skim off any fat. Keep the sauce warm.", "For the lentils, place the lentils in a saucepan with the stock, garlic, thyme and just enough water to cover. Cook them over a low heat for 20 minutes, until tender. ", "Drain the lentils and transfer them to a bowl. Cover with aluminium foil and keep warm until required. ", "For the duck, season the duck breasts well with salt and freshly ground black pepper.", "Heat a large frying pan until hot, add the sunflower oil, and then the breasts, skin-side down. ", "Cook for 4-5 minutes, until crisp and brown. Turn the breasts over with tongs and cook on the other side for 2-4 minutes (this will leave the centre of each breast slightly pink; you may wish to add extra cooking time if you like your duck more cooked through).", "Place the duck breasts on a clean plate, cover with aluminium foil, and allow them to rest in a warm place for at least ten minutes.", "For the crisp parsnip shreds, heat the vegetable oil in a deep heavy-based saucepan to about to 190C/375F - a breadcrumb will sizzle and brown when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.) ", "Deep fry the parsnip slices until golden-brown. Remove them with a slotted spoon and place them in a bowl lined with kitchen paper to drain. Sprinkle with salt.", "To serve, mix the salad leaves, balsamic vinegar and olive oil in a large bowl. Add the cooked lentils and combine gently. Carve the duck breasts into thin slices and add the duck to the bowl. ", "Carefully mix the salad together using your hands and divide among four plates, then drizzle over the sauce.  ", "Top each mound of leaves with a handful of crisp parsnip shreds. Serve immediately."]}, {"isVegetarian": true, "title": "Warm melon 'boats' with ginger and cinnamon syrup", "url": "www_bbc_co_uk_food_recipes_warmmelonboatswithgi_87768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Galia melon", "small bunch fresh mint, chopped", "200g/7oz caster sugar", "4 tbsp water", "50ml/2fl oz champagne", "1 tbsp ground cinnamon", "1 tbsp ground ginger"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Slice the melon in half and remove the seeds using a spoon.", "Slice each half into four wedges and place onto a baking sheet. ", "Place the melon in the oven and cook for five minutes while you make the syrup. ", "For the syrup, place the sugar and water into a pan. Dissolve the sugar over a low heat, before turning up the heat. Add the remaining syrup ingredients and reduce by a third.", "Arrange the warm melon on a serving platter, spoon over the syrup and sprinkle with chopped mint."]}, {"isVegetarian": false, "title": "Warm new potato salad with rosemary, raclette cheese and red peppers", "url": "www_bbc_co_uk_food_recipes_warmnewpotatosaladwi_70909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz boiled and diced new potatoes", "55g/2oz Raclette cheese or Abondance ", "2 tbsp grain mustard", "½ head of frisee lettuce", "1 red pepper", "3 tbsp balsamic vinegar", "6 tbsp olive oil", "fresh basil", "fresh rosemary", "salt ", "freshly ground black pepper", "black olives", "1 clove garlic", "1 onion ", "1 lemon, juice only", "3 tbsp capers", "6 anchovy fillets", "flat leaf parsley chopped", "extra virgin olive oil"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the red pepper in half, remove the seeds and top, and place on an oven tray.  Drizzle the red pepper with olive oil and bake in a hot oven until brown on the top.  Remove from the oven and place in a bowl while still hot and cover with cling film to allow cooling.  ", "Peel the skin off the cooled pepper and dice the flesh, then mix with the balsamic vinegar, olive oil, seasoning and finely chopped fresh rosemary.  Place in the microwave for about 30 seconds to warm up and then press peppers and potatoes into some 5cm/2in stainless steel rings. Top this with some grated cheese and place under a hot grill to brown the top.  ", "Place a small pile of lettuce on the middle of the plate and the ring of potato and cheese on the top, remove the stainless steel ring.  Spoon a pile of the tapenade on top of the cheese.  Chop some fresh basil and add into the dressing.   ", "Check for seasoning again and spoon around the edge of the plate and serve."]}, {"isVegetarian": false, "title": "Warm octopus and potato salad", "url": "www_bbc_co_uk_food_recipes_warmoctopusandpotato_82387", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 bay leaves", "1 carrot, roughly chopped", "1 stalk celery, roughly chopped", "½ onion, halved", "1kg/2¼lb octopus, cleaned", "4 medium potatoes", "salt and freshly ground black pepper", "1 tbsp lemon juice", "extra virgin olive oil", "small bunch fresh parsley, roughly chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large pan with water and add the bay leaves, carrot, celery, onion and octopus. Bring to the boil and simmer for about one hour, or until a sharp knife can pass through the flesh of the octopus easily. ", "Take the octopus out of the water and clean it again. Peel off the outer skin and remove the central eye. If necessary wash it again. Chop the flesh into small pieces.", "Meanwhile, boil the potatoes. Drain and peel them and cut into slices.", "Mix together the potato slices and octopus cubes. Season with salt and freshly ground black pepper to taste, then drizzle with the lemon juice and a generous helping of olive oil. Mix in the chopped parsley and serve."]}, {"isVegetarian": true, "title": "Warm pak choi salad with ginger and chilli dressing", "url": "www_bbc_co_uk_food_recipes_warmpakchoisaladwith_88948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pak choi, quartered", "25g/1oz piece root ginger, peeled, finely chopped", "1 red chilli, finely chopped", "1 tbsp balsamic vinegar", "1 orange, peeled, segmented", "3 tbsp olive oil", "1 tbsp fresh chopped chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the pak choi into a steamer and steam for five minutes, or until wilted. ", "Whisk the rest of the ingredients together in a small bowl to make a dressing.", "To serve, pile the pak choi onto a serving plate and drizzle over the dressing."]}, {"isVegetarian": true, "title": "Warm pear tart", "url": "www_bbc_co_uk_food_recipes_warmpeartart_10393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz unsalted butter, plus extra, melted, for greasing", "50g/2oz parmesan (or similar vegetarian hard cheese), finely grated ", "450g/1lb plain flour", "100g/3½oz cornflour", "150g/5oz icing sugar", "2 free-range egg yolks", "80ml/2½fl oz cold milk", "3 pears, peeled and halved", "1 small piece of ginger, finely sliced", "500ml/17fl oz dessert wine", "220g/8oz blanched pistachio nuts", "180g/6oz icing sugar", "200g/7oz unsalted butter", "2 free-range eggs, beaten", "2 tbsp flour", "1 tbsp pomegranate molasses"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, grease six 10cm/4in fluted tart cases with melted butter. ", "In a mixing bowl, rub the butter and cheese into the flour and cornflour, then mix in the icing sugar. ", "In a separate bowl, beat the egg yolks with the milk, then add two-thirds of the mixture into the flour mixture. Add more egg mixture as necessary until the mixture comes together as a dough. Bring the mixture together using your hands and knead the dough lightly until smooth and elastic.", "Wrap the dough in cling film and chill in the fridge for one hour. Meanwhile, preheat the oven to 170C/325F/Gas 3.", "Roll the chilled dough out onto a lightly floured work surface. Cut out six 12.5cm/5in discs using a pastry cutter or upturned bowl as a template. Line each tart case with a pastry disc. ", "Place a circle of greaseproof paper into each pastry case and fill with dried beans or rice. Bake in the oven for 15-20 minutes, then remove from the oven and set aside to cool slightly.", "For the filling, place the pears, ginger and dessert wine in a pan, cover with a lid and bring to a simmer. Simmer for 10-12 minutes, or until the pears are tender. (The cooking time will vary according to the ripeness of the pear.) Remove the pears from the pan using a slotted spoon and transfer to a plate.", "Turn the heat up and boil the wine until it has reduced by three quarters. Remove from the heat and set aside.", "Blend the pistachio nuts in a food processor until they resemble breadcrumbs. ", "Add the icing sugar and butter and blend the mixture to a paste.", "Add the beaten eggs, flour and molasses and blend until smooth. ", "Divide the filling among the pastry cases and place one of the poached pear halves on top. ", "Bake the tarts in the oven for 20-25 minutes, or until the filling is cooked."]}, {"isVegetarian": true, "title": "Warm Pecorino, spinach and croûton salad with pesto dressing", "url": "www_bbc_co_uk_food_recipes_warmpecorinospinacha_80304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "3 slices bread, crusts removed and cut into 1cm cubes", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 tsp butter", "100g/3½oz spinach, washed", "salt and freshly ground black pepper", "75g/3oz Pecorino, chopped into 1cm cubes", "2 cloves garlic, crushed", "2 large handfuls fresh basil leaves", "50g/2oz Pecorino, grated", "150ml/¼ pint olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the croutons, heat the butter in a frying pan. Add the bread cubes, salt and freshly ground black pepper and one tablespoon olive oil. Fry gently until golden brown on all sides. Remove from the heat and drain on kitchen paper.", "For the salad, melt the butter in a large saucepan, add the spinach and toss to coat in the butter. Cook for 1-2 minutes, tossing frequently, until starting to wilt. Add the Pecorino cubes and remove from the heat.", "For the pesto dressing, put all the ingredients in a food processor and blend until almost smooth. ", "To serve, place the spinach and Pecorino salad onto a large plate. Scatter with the croutons and drizzle with pesto dressing."]}, {"isVegetarian": false, "title": "Warm poached salmon and 'never-fail hollandaise'", "url": "www_bbc_co_uk_food_recipes_warmpoachedsalmonand_92049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz white wine", "400g/14oz onions, peeled, finely chopped", "3 bay leaves", "500ml/17fl oz water or fish stock", "salt and freshly ground black pepper, to taste", "700g/1lb 7oz new potatoes, preferably Jersey Royals, scrubbed", "few sprigs fresh mint", "4 x 200g/7oz salmon fillets", "12 asparagus spears, woody ends trimmed", "150g/5oz salted butter", "2 free-range egg yolks", "½ tbsp Dijon mustard", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the white wine, onions, bay leaves, water or fish stock and salt and freshly ground black pepper into a saucepan or roasting tray that is large enough to hold the salmon fillets. Heat for 20 minutes over a low heat. (NB: Do not allow the liquid to simmer or boil.)", "Meanwhile, place the new potatoes into a separate saucepan and cover with cold water. Add a pinch of salt and the mint sprigs and simmer for 20-25 minutes, or until tender.", "When the poaching liquid has warmed through, add the salmon fillets, skin-side down. Cover the pan or roasting tray with aluminium foil and continue to poach on a low heat for ten minutes. ", "Add the asparagus spears to the poaching liquid, then cover again and continue to poach for a further five minutes, or until the asparagus is tender and the salmon is cooked through.", "Meanwhile, for the hollandaise, heat the butter in a pan over a medium heat. ", "Blend the egg yolks, mustard and lemon juice in a food processor until pale and well combined. ", "When the butter is foaming vigorously, with the motor of the food processor still running, pour the melted butter into the egg and lemon mixture a drop at a time, or until the mixture is well combined and has thickened. ", "Transfer the hollandaise sauce to a bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, carefully lift the salmon fillets from the poaching liquid and pat dry. Place one into the centre of each of four serving plates. Spoon the new potatoes and asparagus spears alongside. Drizzle over the hollandaise sauce. (NB: The poaching liquid can be set aside to cool and frozen, then defrosted and reused. Remove the bay leaves before freezing.)"]}, {"isVegetarian": false, "title": "Warm poached skate with aromatic flavours of Morocco with crushed potatoes", "url": "www_bbc_co_uk_food_recipes_warmpoachedskatewith_74906", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb new potatoes, scraped clean  ", "2 tbsp olive oil", "1 onion, sliced", "2 celery sticks, sliced", "1 fresh bay leaf", "3 tbsp white wine vinegar", "2 tsp salt", "6 black peppercorns", "1.2 litres/2 pints water", "2 x 450g/1lb prepared skate wings", "pinch of saffron strands", "2 plum tomatoes, skinned, seeded and diced", "¼ tsp crushed coriander seeds", "pinch of ground cumin", "1 small roasted red pepper skinned, seeded and cut into thin strips", "1 medium-hot Dutch red chilli, seeded and finely chopped", "2 garlic cloves, finely chopped", "150ml/5fl oz extra virgin olive ", "1 tbsp lemon juice", "salt and freshly ground black pepper", "2 tsp each of shredded coriander and mint", "85ml/3fl oz extra virgin olive oil, plus extra to serve", "50g/2oz watercress sprigs, very roughly chopped.", "balsamic vinegar", "sea-salt flakes", "coarsely crushed black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in well salted boiling water until tender. ", "For the court bouillon, put all the ingredients into a large shallow pan. Bring to the boil and simmer for 20 minutes. ", "Cut each skate wing in half. Add them to the court bouillon and simmer gently for 10 minutes. ", "Meanwhile, for the sauce, steep the saffron in a couple of teaspoons of warm water for five minutes. Then put the saffron  and its water, tomatoes, coriander, cumin, red pepper, chilli, garlic, oil, lemon juice, one teaspoon of salt and ten turns  of the black pepper mill into a small pan and, just before the skate is ready, warm the sauce through over a very gentle  heat.", "Lift the pieces of skate out of the court bouillon, drain off the excess liquid and set aside on a plate. Stir the  coriander and mint into the sauce, spoon some over each piece of skate.", "Heat the two tablespoons of  olive oil in a large frying pan. When the potatoes are done, drain them well and return them to the pan with the extra virgin olive oil.", "Gently crush each potato against the side of the pan with the back of a fork until it just bursts open.", "Season the potatoes and add any juice from the fish.  Add the watercress and turn over gently until the watercress is well mixed in.", "To serve spoon the crushed potatoes onto the four warmed plates and put the skate on top.  Put your thumb over the top of  the bottle of extra virgin olive oil and drizzle a little of it around the outside edge of each plate.", "Do the same with the balsamic vinegar and then sprinkle around a few sea salt flakes and coarsely crushed black pepper."]}, {"isVegetarian": false, "title": "Warm potato and spinach salad with flaked poached salmon and red pepper coulis", "url": "www_bbc_co_uk_food_recipes_warmpotatoandspinach_88581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salmon fillet", "2 sprigs fresh dill", "½ lemon, juice only", "1 garlic clove, peeled", "300ml/½ pint fish stock", "splash white wine", "2 cloves", "85g/3oz baby spinach", "splash water", "¼ tsp freshly grated nutmeg", "salt and freshly ground black pepper ", "½ lemon, juice and zest", "¼ potato, chopped and cooked", "1 tbsp white wine vinegar", "3 tbsp olive oil", "2 tsp Dijon mustard", "salt and freshly ground black pepper ", "dash olive oil", "½ onion, finely chopped", "1 red pepper, chopped", "100ml/3½fl oz milk", "1 garlic clove, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the poached salmon, place all the poached salmon ingredients into a large pan and bring to the boil. Remove from the heat, cover and leave to cook in the residual heat for five minutes, or until the salmon is cooked through. Remove the salmon from the liquid and pull away and discard the skin. Flake the salmon into pieces and set aside.", "For the spinach and potato, place the spinach into a pan, add the water, nutmeg, lemon juice and zest, salt and freshly ground black pepper and leave to wilt for 1-2 minutes. Drain off the excess water and stir in the cooked potato.", "For the salad dressing, whisk all the ingredients together and then pour over the spinach and potato mix.", "For the red pepper coulis, heat the olive oil in a saucepan, add the onion and red pepper and fry over a gentle heat until softened. Add the milk, garlic, salt and freshly ground black pepper and boil for six minutes, or until the red pepper is tender. Allow to cool slightly, then pour into a blender and blend until smooth.", "To serve, spoon the spinach and potato onto a serving plate. Top with the flaked salmon and spoon around the red pepper coulis."]}, {"isVegetarian": true, "title": "Warm potato salad with asparagus and poached egg", "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwitha_86998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely sliced", "1 tbsp Dijon mustard", "75ml/2½fl oz double cream", "salt and freshly ground black pepper ", "1 tbsp butter", "150g/5½oz cooked new potatoes, sliced", "1 tbsp chopped fresh chives ", "3-4 asparagus spears, trimmed", "1 free-range egg"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of olive oil in a non-stick frying pan and gently fry the onion until soft but not coloured.", "Add the mustard and cream and simmer for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper and whisk in the butter.", "Stir in the sliced potatoes and chives.", "Drizzle the asparagus spears with the remaining olive oil and heat a griddle pan. Griddle the asparagus for 3-4 minutes, or until just tender and charred.", "Bring a saucepan of salted water to the boil and crack in the egg. Reduce to a simmer and poach the egg for four minutes. Remove from the pan with a slotted spoon and drain on kitchen paper.", "To serve, place the potato salad onto a plate and top with the asparagus and poached egg."]}, {"isVegetarian": true, "title": "Warm potato, mustard and dill salad", "url": "www_bbc_co_uk_food_recipes_warmpotatomustardand_80303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz new potatoes", "2 tbsp Dijon mustard", "drizzle of olive oil", "2 tbsp dill, chopped ", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the new potatoes into a large saucepan of boiling salted water and boil for 15 minutes, or until just cooked through.", "Drain the potatoes and place into a large bowl with all of the other ingredients.", "Mix well and serve warm."]}, {"isVegetarian": true, "title": "Warm potato salad with herb dressing", "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwithh_88228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "2 tbsp white wine vinegar", "1 tbsp Dijon mustard", "salt and freshly ground black pepper ", "2 tbsp chopped fresh chives", "200g/7oz new potatoes, cooked and halved, still warm"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, whisk together the oil, vinegar and Dijon mustard. Season with salt and freshly ground black pepper, to taste, and stir in the chives.", "Stir the warm cooked new potatoes into the dressing and serve warm."]}, {"isVegetarian": true, "title": "Warm potato salad with shallot dressing", "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwiths_86599", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warmpotatosaladwiths_86599_16x9.jpg", "ingredients": ["6 new potatoes, preferably Charlotte, Ratte and truffle", "salt", "30ml/1¼fl oz olive oil, plus extra for drizzling", "1 banana shallot, very finely chopped", "25ml/1fl oz chardonnay vinegar ", "2 thyme sprigs, leaves only ", "1 portion summer leaves (eg, rocket, sorrel, dandelion leaf, red chard leaf)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the potatoes into a pan of salted boiling water and cook for 15 minutes or until tender when pierced with the tip of a knife. Drain and leave to cool for 2-3 minutes. ", "Heat 10ml of the olive oil in a pan and fry the shallot for a few minutes until soft and transparent. Add the vinegar. Cook until it has reduced by half. Remove the pan from the heat and add the remaining olive oil and the thyme leaves. ", "To serve chop the potatoes and scatter on a large plate. Dress the salad leaves with a little of the shallot dressing and drizzle the remainder over the potatoes. Place the salad leaves on top of the potatoes."]}, {"isVegetarian": true, "title": "Warm Provençal vegetables with melted goats cheese on a toasted ciabatta bread", "url": "www_bbc_co_uk_food_recipes_warmprovencalvegetab_13151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["ciabatta bread ", "1 red pepper", "1 yellow pepper  ", "1 aubergine ", "1 courgette ", "goats cheese log ", "extra virgin olive oil", "fresh basil ", "290ml/½ pint extra virgin olive oil ", "100ml/3½fl oz balsamic vinegar", "1 clove of garlic, sliced", "3 sprigs of thyme", "10 basil leaves"], "serves": "Serves 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the marinade ingredients together in a large bowl. ", "preheat the oven to 160C/325F/Gas 3.  Take a roasting tray and line it with a piece of aluminium foil large enough to cover and envelope the peppers. ", "Place the peppers into the tray, season with salt and pepper and pour some olive oil over the peppers. Seal them in the foil and place into the oven for 20 minutes, turning from time to time. ", "Once cooked, remove from the tray, place into a bowl and cover with cling film. Once cool, peel and wash off any seeds. Cut into large, but even triangles and place into the marinade.  ", "Slice the courgettes and aubergines into 5mm/¼in thick rounds, (if the aubergines are very thick then cut them in half first). ", "Using a hot griddle frying pan, grill the courgettes and aubergines with some olive oil and season with salt and pepper. Cook both sides and then place into the marinade with the peppers.", "Slice the ciabatta bread into thick slices. Brush with olive oil and toast both sides until golden brown. Now top with the Provencal vegetables and slices of goats cheese. ", "Place under a moderate grill and cook until the cheese has melted and coloured slightly. Remove the outer skin if you wish and serve with a salad."]}, {"isVegetarian": true, "title": "Warm pumpkin and walnut salad", "url": "www_bbc_co_uk_food_recipes_warmpumpkinandwalnut_92834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small pumpkin, such as Baby Bear or onion squash, peeled, seeds removed, cut into cubes", "50ml/2fl oz vegetable oil", "1 tbsp nigella seeds", "salt and freshly ground pepper", "100ml/3½fl oz clear honey", "75ml/2¾fl oz cider vinegar", "150g/5½oz walnuts, chopped", "handful fresh watercress leaves", "1 shallot, peeled, finely sliced", "125g/4½oz feta, crumbled, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Place the pumpkin into a roasting tray. Drizzle over the vegetable oil, sprinkle over the nigella seeds, then season, to taste, with salt and freshly ground black pepper. Roast for 20-25 minutes, or until softened. ", "Meanwhile, heat the honey and cider vinegar in a small frying pan over a medium heat, or until dissolved. Stir in the walnuts until well combined.", "Mix together the watercress leaves, shallot, roasted pumpkin and pumpkin seeds until well combined. Drizzle over the honey and vinegar mixture and stir until the leaves are coated in the dressing. Sprinkle over the crumbled feta."]}, {"isVegetarian": true, "title": "Warm roquefort cheesecake with pears in balsamic vinaigrette", "url": "www_bbc_co_uk_food_recipes_warmroquefortcheesec_67093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz white breadcrumbs", "50g/2oz Pecorino Romano, finely grated (or parmesan)", "25g/1oz butter, melted", "freshly ground black pepper", "3 eggs, beaten", "225g/8oz medium fat curd cheese", "110g/4oz fromage frais", "175g/6oz Roquefort", "1 tbsp chives, snipped", "4 spring onions, finely diced", "salt and freshly ground black pepper (to taste)", "4 pears, firm but ripe", "1 clove garlic, peeled", "1 tsp sea salt", "1 tsp mustard powder", "1 tbsp balsamic vinegar", "4 tbsp extra virgin olive oil", "freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. First of all make the base of the cheesecake by mixing the breadcrumbs and Pecorino Romano cheese together, then pour in the butter, adding a good grinding of pepper. ", "Press the crumb mixture firmly down all over the base of the tin, then bake in the preheated oven for 10-15 minutes. (This time will vary slightly, so it does need careful watching - the aim is for the base to be crisp and toasted. If it is undercooked it does not have the lovely crunchy texture so necessary to the finished cheesecake.) Then remove it from the oven and turn the heat down to 180C/350F/Gas  4.", "Now make the filling. First beat together the eggs and curd cheese in a bowl, then stir in the fromage frais and seasoning. After that crumble the Roquefort fairly coarsely and stir it in, together with the chives. Pour the mixture into the tin and scatter the diced spring onion over the top, then place it on the high shelf of the oven and bake for 30-40 minutes or until the centre feels springy to the touch. Allow the cheesecake to cool and settle for about 20 minutes before serving cut into slices.", "The pears in balsamic vinaigrette can be prepared up to two hours before serving. Thinly pare off the skins of the pears using a potato peeler and being careful to leave the stalks intact. Now lay each pear on its side with the stalk flat on a board, then take a very sharp knife and make an incision through the tip of the stalk. Turn the pear the right way up and gently cut it in half, first sliding the knife through the stalk and then through the pear.", "Now remove the central core of each half, then, with the pear core side downwards, slice it thinly but leave the slices joined at the top. Press gently and the slices will fan out.", "Make up the vinaigrette by crushing the clove of garlic and sea salt together with a pestle and mortar until it becomes a creamy paste. Now add the mustard and several grinds of black pepper. Work these into the garlic, then, using a small whisk, add the balsamic vinegar and then the oil - whisking all the time to amalgamate. Serve one pear half with each portion of the cheesecake, with a little of the vinaigrette spooned over."]}, {"isVegetarian": true, "title": "Warm salad of broccoli, cherry tomatoes, feta cheese and crunchy croûtons", "url": "www_bbc_co_uk_food_recipes_warmsaladofbroccolic_86840", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil, plus extra for drizzling", "2 slices white country bread, torn", "salt and freshly ground black pepper, to taste", "85g/3oz feta cheese, crumbled", "100g/3½oz broccoli, cut into florets", "70g/2½oz cherry tomatoes", "1 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil in a frying pan. Add the torn bread and fry for five minutes, or until golden. Season with salt and freshly ground black pepper, to taste, and place in a large bowl with the feta cheese. ", "Boil the broccoli florets in salted boiling water for four minutes, or until just cooked. Drain and add to the mixture in the large bowl. ", "For the tomatoes, place the cherry tomatoes on a baking tray with a dash of olive oil. Season with salt and freshly ground black pepper and roast in the oven for ten minutes. ", "Add the tomatoes to the bowl with one tablespoon of balsamic vinegar and a splash of olive oil. Toss well and then spoon onto a serving plate."]}, {"isVegetarian": false, "title": "Warm salad of new potatoes and gruyere cheese", "url": "www_bbc_co_uk_food_recipes_warmsaladofnewpotato_74710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper ", "olive oil", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper", "225g/8oz cooked new potatoes", "1 tbsp grain mustard", "1 sprig fresh rosemary, chopped", "85g/3oz gruyère (or raclette) cheese, grated", "½ head frisée lettuce", "60g/3oz tapenade", "a few sprigs fresh basil", "1 x 400/14oz jar sun-dried tomatoes in oil", "1 tbsp capers", "canned anchovy fillets ", "1 tbsp pesto", "1 tbsp pine kernels", "salt and freshly ground black pepper", "olive oil, if needed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200c/400F/Gas 6.", "Cut the red pepper in half, remove the seeds and stalk and place cut side-down on a baking tray.", "Drizzle with olive oil and bake until brown, about 15-20 minutes.", "Remove from the pan and place in a bowl. Cover with cling film and allow to cool. ", "When cool, peel the skin off and dice the flesh.", "Mix the dice with six tablespoons of the olive oil, the vinegar and some seasoning to make the dressing.", "Dice the potatoes (keep the skins on) and place in a bowl with the mustard, some more seasoning and the chopped fresh rosemary.", "Place in a microwave for about 30 seconds. ", "Press the mixture into 4 x 5cm/2in round steel rings and place on a baking tray.", "Top with the cheese and place under the grill to brown the top. (If you do not have a microwave then place the steelrings filled with potatoes in a warm oven to warm through the potatoes and slowly melt the cheese).", "For the tapenade, place all the ingredients into a food processor, except the olive oil (include the oil from the tomatoes) - if you need more to bind the mixture, add more olive oil.", "Place a small pile of frisée leaves in the middle of each plate.", "Place the ring of potato on top and add the tapenade.", "Spoon round the red pepper dressing and serve."]}, {"isVegetarian": false, "title": "Warm salad of pancetta, avocado and roasted red pepper", "url": "www_bbc_co_uk_food_recipes_warmsaladofpancettaa_85989", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red pepper, seeds removed, quartered", "olive oil, for drizzling", "70g/2½oz pancetta lardons", "1 avocado, stone removed, peeled and chopped", "2 tsp balsamic vinegar", "1 tbsp olive oil", "salt and freshly ground black pepper ", "2 slices rustic white bread, roughly torn into bite-sized pieces", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the roasted red pepper, place the red pepper onto a baking sheet and drizzle with olive oil. Transfer to the oven and roast for 8-10 minutes, or until lightly charred. Remove from the oven and chop roughly.", "For the salad, heat a frying pan and fry the pancetta lardons until golden-brown and crisp. Remove from the pan with a slotted spoon and drain on kitchen paper.", "Place the crisp pancetta into a salad bowl with the chopped avocado and roasted pepper pieces. Drizzle over the balsamic vinegar and olive oil, season, to taste, with salt and freshly ground black pepper and stir.", "For the croutons, place the bread into a large bowl, drizzle over the oil and stir to coat. Season well with salt and freshly ground black pepper.", "Spread the bread pieces out on a baking sheet, transfer to the oven and bake for five minutes, or until golden-brown and crisp.", "To serve, sprinkle the croutons over the salad."]}, {"isVegetarian": false, "title": "Warm salad of pigeon, roast chicory and pickled walnuts", "url": "www_bbc_co_uk_food_recipes_warmsaladofpigeonroa_89885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large chicory head", "1 tbsp sherry vinegar", "30g/1oz butter", "salt and freshly ground black pepper", "2 tsp caster sugar", "small handful hazelnuts or walnuts, shelled", "4 x wood pigeon breasts", "salt and freshly ground black pepper", "25g/1oz butter", "¾ tbsp walnut oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard", "salt and freshly ground black pepper", "1 small handful each of oak leaf lettuce and frisée lettuce", "2 pickled walnuts, finely sliced"], "serves": "Serves 4", "time": {"preparation": "", "cookingMins": 0, "cooking": "", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 230C/445F/Gas 8.", "Line a baking tray with baking parchment.", "Trim the chicory, removing any brown leaves, but do not cut off the stem at the bottom, because this holds the chicory together. Cut the chicory in half lengthways, then cut each half into four equal pieces lengthways. Place the chicory onto the baking sheet and drizzle with the sherry vinegar.", "Dot the chicory generously with little knobs of butter and season well with salt and freshly ground black pepper.", "Sprinkle the chicory with caster sugar and cook in the oven for 15 minutes.", "Check the chicory after 15 minutes. If it has started to brown, turn it over in the melted butter and return it to the oven. If not, allow to cook for 4-5 more minutes before turning.", "When the chicory is almost golden-brown all over, place the hazelnuts or walnuts for the salad onto a baking tray and roast for 3-4 minutes. Remove and allow to cool, then roughly chop.", "Season the pigeon breasts with salt and freshly ground black pepper.", "Melt the butter in a frying pan over a medium heat. Add the pigeon breasts and cook for 2-3 minutes, until browned, then turn over and cook for a further 2-3 minutes, or until cooked to your liking. Set aside to rest for 3-4 minutes, then carve each pigeon breast into four slices.", "For the dressing, place the walnut oil, vinegar and mustard into a bowl and mix well. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the mixed lettuce leaves into a bowl and add the chicory. Mix gently, then add equal amounts of salad onto each plate.", "Place a sliced pigeon breast onto each salad and drizzle with the dressing. Sprinkle each salad with equal amounts of sliced pickled walnuts and the chopped roasted nuts."]}, {"isVegetarian": true, "title": "Warm salad of roasted pepper, broccoli and tomato", "url": "www_bbc_co_uk_food_recipes_warmsaladofroastedpe_87209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ Romero pepper, seeds removed", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp wholegrain mustard", "2 tbsp red wine vinegar", "100g/3½oz Tenderstem broccoli, blanched and drained", "½ plum tomato, sliced", "2 tbsp chopped fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the pepper half onto a baking sheet, drizzle with olive oil and season well with salt and freshly ground black pepper.", "Transfer the pepper to the oven and roast for ten minutes, or until tender.", "Mix the mustard and vinegar together in a large mixing bowl. Chop the broccoli into 2cm/1in pieces and add to the bowl.", "Cut the warm pepper into slices and add to the bowl, along with the sliced tomato and chervil. Mix well.", "To serve, place the salad onto a serving plate."]}, {"isVegetarian": false, "title": "Warm salad of tea-smoked trout with crispy bacon, frisée and horseradish", "url": "www_bbc_co_uk_food_recipes_warmsaladofteasmoked_81088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz demerara sugar", "175g/6oz long grain rice", "leaves from 14 tea bags", "olive oil, to drizzle", "4 x 330-350g /11½-12½oz fresh trout, heads removed", "salt and freshly ground black pepper", "100ml/3½fl oz fish stock", "100ml/3½fl oz double cream ", "2 tbsp creamed horseradish sauce, from a jar", "100ml/3½fl oz cider", "salt and freshly ground black pepper", "225g/8oz smoked streaky bacon, rind removed", "25g/1oz butter", "1 Golden Delicious apple, thinly sliced", "200g/7oz frisée lettuce, torn", "4 tbsp chopped parsley", "2 tbsp chopped chives", "extra virgin olive oil, to drizzle"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tea-smoked trout, put the sugar, rice and tea leaves into a bowl and mix together. Line a wok with heavy-duty kitchen foil and pour the mixture on top. Cover with another layer of foil, drizzle over some olive oil and place the trout on top. Season with salt and freshly ground black pepper, then cover with another sheet of foil, sealing it tightly around the edges. Place on the hob over a moderate heat and leave the trout to smoke for a few minutes. Set aside. (CAUTION: tea-smoking generates a lot of smoke. Cook in a well-ventilated area.)", "For the dressing, bring the stock to the boil in a saucepan and continue to boil, uncovered, until reduced by half. Leave to cool.", "Whip the cream until stiff peaks form, then fold in the creamed horseradish, the cooled fish stock and cider. Season to taste with salt and freshly ground black pepper.", "For the salad, place the bacon on a baking tray and cook in the oven until crisp.", "Meanwhile, heat the butter in a frying pan and cook the apple slices until soft and golden.", "Remove the bacon from the oven and, when cold enough to handle, break into bite-size pieces.", "Arrange the frisée lettuce on serving plates. Scatter the bacon on top, drizzle over some of the dressing, then scatter over the apple slices and chopped herbs. Spoon over the remainder of the dressing and top with the smoked trout.  Drizzle with a little olive oil and serve immediately."]}]