[{"ingredients": ["4 anillos de salchicha Cumberland", "4 ramitas de tomillo", "1 limón, ralladura cortada en juliana", "1 naranja, ralladura cortada en juliana", "Jalea de grosella roja 220 g / 8 oz", "4 cucharadas de puerto", "1 cucharadita de mostaza inglesa", "1 cucharadita de jengibre molido", "1 kg / 2lb 4oz de papas, peladas y cortadas en cuartos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de crema doble", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon", "1 manojo de berros frescos"], "method": ["Para el anillo de salchicha Cumberland con salsa Cumberland, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque las ramitas de tomillo entre los anillos de Cumberland y colóquelas en una bandeja para hornear.", "Asar en el horno durante 30-35 minutos, o hasta que esté cocido. Justo antes de servir, eliminar el tomillo.", "Caliente una olla mediana de agua hirviendo y blanquee la ralladura de limón y naranja tres veces, refrescándola con agua fría todo el tiempo.", "Una vez que la cáscara se haya suavizado, tápelo y déjelo a un lado.", "Coloque el resto de los ingredientes en una cacerola mediana y bata hasta que estén brillantes y espesos. Sazone con sal y pimienta y agregue la ralladura de limón y naranja y cocine a fuego lento durante cinco minutos.", "Para el puré, hierva las papas en agua con sal durante 15 minutos, o hasta que estén tiernas. Drene y coloque las papas de nuevo en la cacerola sobre el calor para eliminar el exceso de humedad.", "Coloque la mantequilla y la crema en una cacerola y caliente hasta que la mantequilla se derrita. Agregue al puré y bata bien hasta que esté suave y cremoso. Finalmente sazone con sal y pimienta negra recién molida.", "Para servir, mezcle el aceite, el vinagre y la mostaza en un tazón pequeño de vidrio y vístelos con berros. Coloque la salchicha en un plato para servir o en un recipiente poco profundo, vierta la masa sobre el plato y vierta sobre la salsa. Adorne con el berro fresco."], "url": "www_bbc_co_uk_food_recipes_cumberland_sausage_ring_04703", "title": "Salchicha Cumberland y puré con salsa Cumberland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["botón de mantequilla", "2 chalotes, en rodajas finas", "pulgar tamaño jengibre fresco, rallado", "Puerto de 75 ml / 3 fl oz", "150ml / 5fl oz de caldo de pollo", "Gelatina de grosella negra 250 g / 9 oz", "1 cucharadita de pimienta verde en salmuera, enjuagada y escurrida"], "method": ["Derrita la mantequilla en una sartén a fuego medio. Agregue los chalotes y el jengibre y fría por 2-3 minutos, hasta que estén blandos.", "Agregue el puerto y hierva hasta que el líquido se reduzca a un jarabe muy espeso, luego agregue el caldo.", "Ponga a hervir el caldo, luego agregue la jalea de grosella roja y los granos de pimienta verde y reduzca el fuego a fuego lento durante 2 a 3 minutos, o hasta que la jalea se haya disuelto por completo.", "Retirar del fuego y servir."], "url": "www_bbc_co_uk_food_recipes_cumberlandsauce_87528", "title": "Salsa Cumberland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de papas, preferiblemente Maris Piper", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de semillas de comino", "2 cucharadas de aceite de girasol", "1 cucharadita de sal masala", "½ cucharadita de cúrcuma", "1 cebolla roja mediana, partida a la mitad y cortada en finas cuñas", "1 pimiento amarillo, sin semillas y cortado en trozos de 4cm / 1½ pulgadas", "1 pimiento rojo, sin semillas y cortado en trozos de 4cm / 1½ pulgadas", "1 pimiento naranja, sin semillas y cortado en trozos de 4cm / 1½ pulgadas", "2 calabacines medianos, cortados en rodajas de 1 cm / ½", "pimienta negra recién molida"], "method": ["Precaliente el horno a 190C / 400F / Gas 6. Llene a la mitad una cacerola mediana con agua y deje que hierva. Pele las papas, córtelas en cuartos y bájelos cuidadosamente en el agua. Deje que el agua vuelva a hervir y cocine durante cinco minutos, lo suficiente como para sancocharlos.", "Mientras las papas están hirviendo, coloque una sartén antiadherente grande a fuego medio y agregue las semillas de mostaza y comino. Tueste durante unos 30 segundos, luego agregue el aceite, el garam masala y la cúrcuma. Chisporrotear durante unos segundos y agregar la cebolla.", "Freír la cebolla en las especias durante 1-2 minutos, revolviendo con frecuencia.", "Escurra las papas en un colador grande y mezcle varias veces para hacer áspero la superficie de cada patata.", "Incline las papas en la sartén con la cebolla y las especias, sazone con unos giros de pimienta negra molida y mezcle hasta que las papas estén ligeramente cubiertas.", "Incline todo en una bandeja grande para hornear y tueste durante 30 minutos.", "Saque la bandeja del horno y agregue los pimientos y calabacines.", "Mezcle ligeramente y vuelva al horno durante otros 25-30 minutos hasta que las papas estén crujientes y doradas, y las verduras se hayan suavizado."], "url": "www_bbc_co_uk_food_recipes_cumin-crusted_vegetables_96980", "title": "Vegetales con costra de comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cumin-crusted_vegetables_96980_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de comino molido", "4 pechos de pato", "75g / 2½oz de mantequilla sin sal", "1 manojo de remolachas para bebés, hervidas en sus pieles hasta que estén tiernas", "250g / 9 oz de chalotes bebé, hervidos en sus pieles hasta que estén tiernos", "4 cucharadas de aceite de oliva", "75g / 2½oz de mantequilla sin sal", "50 g / 1¾oz de mantequilla sin sal", "200g / 7oz de guisantes congelados", "pequeño puñado de perejil flatleaf", "100ml / 3½ fl oz crema doble", "200g / 7oz guisantes en sus vainas", "2 cucharadas de aceite de oliva", "1 chalote, picado", "1 diente de ajo, picado", "5 cucharadas de Madeira", "200ml / 7fl oz de caldo de carne", "brotes de guisantes"], "method": ["Para el pato, precalentar el horno a 200C / 180C Fan / Gas 6.", "Espolvoree el comino molido sobre los pechos de pato. Caliente una sartén a prueba de horno a fuego lento. Agregue el pato con la piel hacia abajo y cocine lentamente hasta que la grasa se derrita y la piel esté crujiente. Si sale mucha grasa, escurra la sartén y agregue la mantequilla. Voltee el pato y transfiéralo al horno durante 6-8 minutos, dependiendo del tamaño de la pechuga de pato. Retire de la sartén y deje reposar en un lugar cálido, reservando la sartén para hacer la salsa.", "Para las verduras asadas, caliente el aceite en una sartén mediana. Pele los chalotes hervidos y corte las remolachas en cuartos. Agregue las verduras a la sartén y fría por 2-3 minutos, luego termínelas en el horno por 2-3 minutos.", "Para los guisantes, agregue la mantequilla a una sartén grande. Caliente hasta que se derrita, luego agregue los guisantes congelados, el perejil, 50ml / 2fl oz de agua y la crema doble. Sazone al gusto con sal y pimienta. Calentar a través de un calor suave y luego transferir a una licuadora y pulsar hasta que tenga un puré muy suave. Pruebe comprobar el condimento y agregue más mantequilla si lo desea.", "Ponga a hervir una olla de agua con sal y cocine las vainas de guisantes durante 1-2 minutos.", "Para la salsa, coloque la sartén utilizada para cocinar el pato a fuego medio. Agregue el aceite, los chalotes y el ajo y cocine durante 1-2 minutos. Agregue el Madeira y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue el stock y reduzca nuevamente. Justo antes de servir, pasa la salsa por un colador.", "Para servir, esculpe las pechugas de pato reposadas y colóquelas en platos para servir. Vístase con las remolachas asadas, los chalotes, los guisantes en sus vainas, el puré de guisantes y la salsa. Adornar con brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_cumin_duck_with_peas_and_85062", "title": "Pato de comino con guisantes y remolachas baby baby y chalotas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 alas de pollo cornfed, coronado y atado", "500g / 1lb 2oz de grasa de pato", "½ bulbo de ajo", "6 ramitas de tomillo", "1 limón, ralladura y jugo", "75 g / 2½ oz de mantequilla", "75 g / 2½ oz de miel clara", "sal", "50g / 1¾oz de avellanas, peladas", "10g / ¼ oz de mantequilla sin sal", "250 g / 9 oz de apionabos, pelados y picados", "1 chalote de plátano, pelado y finamente picado", "1 diente de ajo, pelado", "75g / 2½oz de mantequilla sin sal", "sal y pimienta negra recién molida", "Crema doble 50ml / 2fl oz", "2 manzanas Granny Smith, peladas y finamente picadas", "100ml / 3½fl oz de vinagre de sidra", "¼ vaina de vainilla, solo semillas", "200 g / 7 oz de azúcar en polvo", "12 vieiras, retiradas de sus caparazones, limpiadas y eliminadas las huevas", "2g de comino molido", "2 cucharadas de aceite de colza", "sal", "50 g / 1¾oz de mantequilla sin sal", "1 limón, solo jugo", "Aceite de avellanas", "1 manzana Granny Smith, cortada en fósforos finos", "2 cucharadas de berro shiso rojo", "1 cucharada de berro de coriandro"], "method": ["Para las alitas de pollo glaseadas, precaliente el horno a 150 ° C / 300 ° F / Gas 2.", "Coloque las alitas de pollo, la grasa de pato, el ajo, el tomillo y la ralladura de limón en un plato resistente al horno y cubra con papel de aluminio. Coloque en el horno por una hora. Deje que se enfríe antes de quitar el hueso central y cortar la carne.", "Caliente una sartén grande y agregue la mantequilla. Una vez caliente, agregue las alas de pollo con la piel hacia abajo y cocine hasta que estén doradas. Agregue la miel y el bastón para formar un glaseado pegajoso. Sazonar con sal y jugo de limón.", "Para las avellanas tostadas, caliente una sartén y agregue las avellanas y la mantequilla. Lentamente asar hasta que se dore. Una vez que esté frío, córtalo por la mitad.", "Para el puré de apio nabo, coloque todos los ingredientes, aparte de la crema doble, en una cacerola grande con 250ml / 9fl de agua. Llevar a ebullición y reducir hasta que el agua y la mantequilla se hayan emulsionado a un tercio del volumen.", "Coloque en un procesador de alimentos y mezcle. Sazonar con sal y pimienta y pasar por un colador fino. Termine mezclando la crema doble. Mantenga caliente hasta que esté listo para servir.", "Para la manzana y el chutney de vainilla, coloque todos los ingredientes con 50 ml / 2 onzas de agua en una olla mediana y caliéntelos suavemente hasta que todo el líquido se haya absorbido en las manzanas.", "Para las vieiras asadas al comino, espolvoree el comino sobre un lado de las vieiras. Caliente una sartén grande y agregue el aceite. Una vez caliente, freír las vieiras con comino hacia abajo hasta que estén doradas y luego sazone con sal.", "Agregue la mantequilla y dé vuelta las vieiras. Vierta el jugo de limón y hilvana las vieiras. Termina con un poco de sal.", "Para servir, coloque una cucharada de puré de apio nabo en cada plato y con una pequeña paleta de cuchillo deslice el puré para formar una mancha.", "Coloque tres vieiras sobre el puré y coloque las alitas de pollo entre las vieiras. Cuchara un poco de la chutney de manzana al lado de las alas.", "Esparce sobre las avellanas y coloca los fósforos de manzana sobre las alas y las vieiras. Termine con shiso berro rojo y berro de coriandro y vístete con un poco de aceite de avellana."], "url": "www_bbc_co_uk_food_recipes_cumin_roasted_scallops_71246", "title": "Comino de vieiras asadas con ensalada de miel, alitas de pollo glaseadas, manzana, apio nabo y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 x 100 g / 3½ oz de filetes de barramundi, huesos retirados, piel en", "sal y pimienta negra recién molida", "2 cucharadas de aceite de semilla de uva", "3 cucharadas de semillas de comino, tostadas durante 1 minuto en una sartén seca, trituradas", "1 tsc zumaque (disponible en algunos supermercados y anuncios de delicatessen de Oriente Medio)", "2 chalotes, pelados y picados", "110ml / 4fl oz de vino blanco seco", "2 cucharadas de cebollines, picados", "2 cucharadas de orégano, picado", "2 aguacates maduros, pelados, sin hueso, cortados en cubos", "½ limón, solo jugo", "4-5 cucharadas de aceite de oliva virgen extra", "3 dientes de ajo, aplastados", "4 cucharadas de tahini (pasta de sésamo)", "2 cucharadas de comino molido", "½ cucharadita de zumaque", "1 cucharada de semillas de sésamo negro"], "method": ["Para el barramundi, sazone los dos lados de los filetes de barramundi con sal y pimienta negra recién molida y aplíquelos con una cucharada de aceite de semilla de uva.", "Espolvorea los filetes con comino y zumaque.", "Caliente la cucharada restante de aceite de semilla de uva en una sartén hasta que esté caliente, luego agregue los filetes de barramundi. Freír durante 2-3 minutos en cada lado, o hasta que estén bien cocidos, luego retírelos de la sartén y manténgalos calientes.", "Agregue los chalotes y freír durante 2-3 minutos, luego agregue el vino y cocine a fuego lento hasta que se reduzca al menos la mitad del volumen.", "Agregue las cebolletas frescas y el orégano y sazone, al gusto, con sal y pimienta negra recién molida.", "Para el hummus de aguacate, coloque los aguacates y el jugo de limón en un procesador de alimentos y mezcle hasta que quede suave.", "Agregue el aceite de oliva, ajo, tahini, comino y zumaque y mezcle a la consistencia de la mayonesa.", "Agregue las semillas de sésamo y revuelva.", "Para servir, coloque dos filetes de barramundi en cada uno de los cuatro platos y rocíe con el vino blanco y la salsa de hierbas. Sirva con una cucharada de hummus de aguacate al lado."], "url": "www_bbc_co_uk_food_recipes_cuminandsumaccrusted_86040", "title": "Barramundi con comino y zumaque con hummus de aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 11fl oz de yogurt natural", "2 cucharadas de menta o cilantro, finamente picado", "1 limón, solo jugo", "1 cucharada de semillas de comino molidas", "2 cucharadas de aceite de oliva", "2 dientes de ajo, finamente rallados o triturados", "buena pizca de pimienta", "1kg / 2lb 2 oz de pollo, preferiblemente orgánico, espátula", "llovizna de aceite de oliva", "1 pepino grande o 2 medianos", "½ limón, solo jugo", "4 cucharadas de aceite de oliva virgen extra", "2 cucharadas grandes de eneldo picado (menta o cilantro también es genial)", "sal marina y pimienta negra recién molida"], "method": ["Para el pollo, mezcle todos los ingredientes del adobo en un tazón.", "Con un cuchillo filoso, corte con cuidado las patas de pollo dos o tres veces hasta el hueso. Frote el adobo en el pollo, masajeando la carne.", "Coloque en un plato en la nevera durante al menos 30 minutos, pero puede dejarlo durante 4-6 horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén hasta que esté muy caliente. Retire el pollo del adobo, deje que el exceso gotee, pero no lo limpie. Vierta un poco de aceite de oliva en la sartén de la plancha y agregue el pollo con la piel hacia abajo. Cocine por 2-3 minutos en cada lado, hasta que estén dorados y anotados con las marcas marrones de la plancha.", "Transfiera a una lata para asar y colóquela en el horno durante 25-30 minutos, o hasta que esté completamente cocida. Pruebe que el pollo esté cocido empujando un pincho en la carne del muslo; si los jugos son claros, el pollo está cocido.", "Retire del horno y deje reposar durante 5-10 minutos.", "Para la ensalada de pepino, corte los pepinos en mitades a lo largo y saque las semillas acuosas.", "Corta el pepino en trozos y colócalo en un tazón. Agregue los ingredientes restantes y revuelva para cubrir. Sazone al gusto con más jugo de limón o sal y pimienta negra recién molida.", "Para servir, esculpe el pollo en ocho pedazos (piernas, muslos y pechos). Coloque la ensalada de pepino en una pila en un plato y un poco de pollo al lado. Servir con pan crujiente o una ensalada de cuscús."], "url": "www_bbc_co_uk_food_recipes_cuminandyoghurtchick_83849", "title": "Pollo de yogur y comino con ensalada de pepino y eneldo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cuminandyoghurtchick_83849_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de zanahorias (peladas y cortadas en porras)", "sal y pimienta recién molida", "azúcar pizca", "1 cucharada de mantequilla clarificada", "15-20 ml / ¾tsp de semillas de comino entero"], "method": ["Coloque las zanahorias en una olla, cubra con agua.", "Sazonar y agregar el azúcar.", "Llevar a ebullición y cocinar con la tapa hasta que esté cocido (debe ofrecer algo de resistencia cuando se perfora con un cuchillo).", "En una sartén más pequeña, caliente la mantequilla hasta que esté muy caliente, mezcle las semillas de comino y, después de unos 10 segundos, agregue esto a las zanahorias y vuelva a colocar la tapa.", "Retire la tapa y continúe cocinando las zanahorias hasta que el agua se evapore y las zanahorias estén cubiertas con la mantequilla y el comino.", "Re-temporada y servir."], "url": "www_bbc_co_uk_food_recipes_cumincarrots_9993", "title": "Comino, zanahorias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de zanahorias Chantenay u otras zanahorias pequeñas", "rociar aceite de oliva", "2 dientes de ajo sin pelar", "1 ramita de romero", "1 cucharadita de semillas de comino", "sal y pimienta negra recién molida", "2 cucharadas de cebolletas frescas picadas, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las zanahorias en una bandeja para hornear, agregue los dientes de ajo, semillas de romero y comino y sazone generosamente con sal y pimienta negra recién molida. Mezclar todo junto.", "Coloque en el horno y tueste durante 10-15 minutos, o hasta que las zanahorias estén tiernas y doradas.", "Para servir, transfiera las zanahorias a un recipiente para servir y adorne con las cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_cuminroastcarrots_89088", "title": "Comino, asado, zanahorias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cuminroastcarrots_89088_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 4oz de mantequilla sin sal", "Azúcar en polvo de 110 g / 4 oz", "Aroma 30g / 1oz: ralladura de limón, polvo rallado o de cacao o 6 gotas de esencia de vainilla", "2 huevos, batidos", "Harina de auto crianza 110g / 4oz", "glaseado de color pálido"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Bata la mantequilla y el azúcar juntos hasta que estén suaves y esponjosos. Agregue su saborizante elegido de cáscara de limón cacao o vainilla.", "Agregue el huevo batido a la mezcla. Poco a poco, dobla la harina para criar y coloca la mezcla en cajas de papel en una lata de bollo.", "Cocine por aproximadamente 10 minutos hasta que se levante y se comience a tocar.", "Decorar con glaseado en colores pálidos, por ejemplo, blanco, rosa, azul y amarillo."], "url": "www_bbc_co_uk_food_recipes_cupcakes_11254", "title": "Pasteles de la taza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12-15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "Echador de 250g / 9oz o azúcar moreno", "50ml / 2fl oz de aceite de girasol", "25 g / 1 oz de arrurruz o harina de maíz", "2 cucharaditas de extracto de vainilla", "4 huevos medianos de granja", "80ml / 2½ fl oz de leche", "100ml / 3½ fl oz crema doble", "Harina normal 300g / 10½ oz", "3 cucharaditas de polvo de hornear", "300g / 10½oz de azúcar glas", "25g / 1 oz de glucosa líquida", "50g / 1¾oz de leche condensada", "2 cucharaditas de extracto de vainilla u otro saborizante", "200g / 7oz de mantequilla sin sal, ablandada", "100g / 3½oz de margarina para hornear, ablandada", "200g / 7oz de azúcar glasé", "100ml / 3¾ fl oz crema doble", "algunas gotas de colorante o saborizante", "azúcar en polvo, para decorar"], "method": ["Para las magdalenas, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una lata de muffins con cajas.", "Derrita la mantequilla a fuego lento en una olla pequeña, viértala en un bol con el azúcar, el aceite, la harina de maíz (o arrurruz) y la vainilla. Batir bien hasta que quede suave, luego batir los huevos, seguido de la leche y la crema.", "Tamizar y batir la harina y el polvo de hornear en la mezcla de mantequilla en tandas hasta que quede suave.", "Con una cuchara, coloque la mezcla en las cajas de papel hasta aproximadamente dos tercios de su capacidad, luego hornee durante 20-25 minutos o hasta que la parte superior esté elástica al tacto. Retire los cupcakes del horno y déjelos a un lado para que se enfríen.", "Mientras tanto, para la crema de mantequilla, mezcle el azúcar glas, la glucosa, la leche condensada, el saborizante y la mantequilla con un mezclador eléctrico en un tazón hasta que quede suave y liviano, luego bata en la margarina para hornear hasta que quede suave.", "En una jarra, mezcle el azúcar glas en la crema hasta que se disuelva, luego agregue cualquier colorante o saborizante que desee, o simplemente déjelo en limpio. Bata esto gradualmente en la mezcla de mantequilla hasta que esté suave y esponjoso. (Esta crema de mantequilla se mantiene muy bien cubierta a temperatura ambiente durante 2-3 días y puede calentarse ligeramente y volverse a batir si la textura es demasiado firme).", "Para decorar las magdalenas, puedes echar un poco de hielo y agitarlo con un cuchillo o usar una manga pastelera. Llene una manga pastelera desechable con el glaseado y recorte el extremo o llene una manga pastelera equipada con una boquilla estrella grande.", "Para enroscar el glaseado, comience en la orilla del borde exterior del borde de la magdalena en espiral hacia el centro. Cuando llegue a la cima, tire rápidamente para terminar el remolino. Decorar con chispas."], "url": "www_bbc_co_uk_food_recipes_cupcakes_99366", "title": "Cupcakes con glaseado y chispas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12 magdalenas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cupcakes_99366_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 175g / 6oz, más extra para espolvorear", "25 g / 1 oz de almendras molidas", "35g / 1¼ oz de azúcar glas", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos, más extra para engrasar", "2 huevos medianos de granja, golpeados", "60 g / 2¼ oz de pasas de Corinto, remojadas en 30 ml / 1 fl oz de té de rosa china durante la noche", "175g / 6oz de cuajada de queso, picado en cubos pequeños", "½ limón, ralladura y jugo", "75 g / 2½ oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "Crema doble de 300 ml / ½ pinta, suavemente batida", "Yogur natural de 100 g / 3½ oz", "2 cucharaditas de agua de rosas", "1 redcurrants redondos, tallos eliminados", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 160C / 325F / Gas 2½. Para la masa, mezcle la harina común, las almendras molidas y el azúcar glas en un tazón grande. Agregue la mantequilla y frote con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue la mitad del huevo y amasar para formar una masa. Envuelva la masa en una película adhesiva y déjela reposar durante una hora.", "Estirar la masa en una superficie enharinada hasta que tenga un grosor de 2 mm. Engrase ligeramente cuatro pequeños platos de flan con fondo aflojado, espolvoree con harina común y sacuda el exceso de harina. Alinee los platos de flan preparados con la masa y recorte los bordes. Coloque en la nevera para enfriar durante diez minutos. Pinche la base de cada caja de pastelería con un tenedor, alinee con papel de hornear y llénelo con alubias para hornear. Coloque en una bandeja para hornear y hornee en el horno precalentado durante 15 minutos. Retire los frijoles para hornear, cepille con huevo batido y hornee durante cinco minutos o hasta que estén dorados y crujientes. Retirar del horno y dejar enfriar por completo.", "Para el relleno, escurra el exceso de té de las grosellas y reserve. Coloque el queso cuajado, la ralladura de limón y el jugo de limón en un recipiente no reactivo y déjelo reposar durante una hora. Escurra el exceso de jugo de limón del queso cuajado y transfiera cuidadosamente el queso a las cajas de los pasteles. Espolvorea las grosellas empapadas sobre el queso cuajado en las cajas de repostería.", "Coloque los huevos y el azúcar en un tazón grande y bata hasta que estén pálidos y esponjosos. Divida la mezcla azucarada de huevo batido por igual entre los paquetes de repostería, vertiendo sobre la cuajada y las grosellas.", "Reduzca la temperatura del horno a 150C / 300F / Gas 2, coloque las tartas en una bandeja para hornear y hornee durante 30-40 minutos. Retire del horno y deje enfriar a temperatura ambiente.", "Para la crema de pétalos de rosa, coloque la crema batida en un tazón grande, doble el yogur y el agua de rosas, y finalmente doble las grosellas rojas.", "Para servir, coloque una tarta en cada plato de servir, coloque una cucharada de la crema encima, espolvoree con azúcar glas y sirva."], "url": "www_bbc_co_uk_food_recipes_curdtartwithrosepeta_88554", "title": "Tarta de cuajada con crema de pétalos de rosa y grosellas rojas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110 g / 4 oz de mantequilla o margarina, ablandadas a temperatura ambiente", "Azúcar en polvo de 110 g / 4 oz", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de extracto de vainilla", "Harina de auto crianza 110g / 4oz", "1-2 cucharadas de leche", "140g / 5oz de mantequilla, suavizada", "280g / 10oz de azúcar glasé", "1-2 cucharadas de leche", "algunas gotas colorante de alimentos"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una lata para muffins de 12 hoyos con cajas de papel.", "Bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos. Batir los huevos un poco a la vez e incorporar el extracto de vainilla.", "Doble la harina con una cuchara grande de metal, agregue un poco de leche hasta que la mezcla tenga una consistencia de caída. Coloque la mezcla en las cajas de papel hasta que estén medio llenos.", "Hornee en el horno durante 10-15 minutos, o hasta que estén dorados en la parte superior y un pincho insertado en uno de los pasteles salga limpio. Poner a un lado para enfriar durante 10 minutos, luego retire de la lata y deje enfriar sobre una rejilla de alambre.", "Para el glaseado de crema de mantequilla, bata la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave.", "Luego agregue el azúcar glas restante con una cucharada de leche, agregando más leche si es necesario, hasta que la mezcla esté suave y cremosa.", "Agregue el colorante de alimentos y mezcle hasta que estén bien combinados.", "Con una cuchara, coloque el glaseado en una manga pastelera con una boquilla de estrella y pinte la formación de hielo con un movimiento en espiral sobre los pasteles de la taza en un gran remolino."], "url": "www_bbc_co_uk_food_recipes_cupcakes_93722", "title": "Cupcakes de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 pequeños pasteles de hadas o 9 cupcakes más grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cupcakes_93722_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de vinagre chardonnay", "50 g / 2 oz de azúcar en polvo", "2 limones, Amalfi si es posible", "125ml / 4fl oz de aceite de oliva virgen extra", "25 g / 1 oz de azúcar", "75g / 3oz de sal", "20g / ¾ oz de ralladura de limón", "10g / ½ oz de ralladura de lima", "10g / ½ oz de semillas de cilantro, tostadas suavemente en una sartén seca y ligeramente trituradas", "2 g de granos de pimienta negra, tostados suavemente en una sartén seca y ligeramente triturados", "2 caballas frescas", "1 pepino", "aceite de oliva, para lloviznar y freír", "3 cucharadas de chalotes finamente picados", "1 diente de ajo, muy finamente picado", "2½ cucharadas de vinagre Chardonnay", "Habas de 150g / 5oz, envasadas, blanqueadas, peladas", "150 g / 5 oz de guisantes frescos, envasadas, blanqueadas", "2 cucharadas de eneldo picado", "2 cucharadas de perejil de flatillo picado", "2 cucharadas de brotes de guisantes", "sal y pimienta negra recién molida"], "method": ["Para los limones encurtidos, en una sartén sobre una mezcla de calor suave 150 ml / 5 fl oz de agua, el vinagre y el azúcar juntos.", "Cuando el azúcar se haya disuelto, retírelo del fuego y déjelo enfriar.", "Corta finamente los limones, descarta las semillas y coloca los limones en el líquido decapante.", "Coloque en el refrigerador durante 48 horas antes de usar.", "Para hacer el aderezo, tome el aceite de oliva y 110 ml / 4 fl oz del jugo de limón en escabeche, mezcle bien y reserve.", "Para la caballa coloque el azúcar, la sal, la ralladura de limón y limón, las semillas de cilantro y los granos de pimienta en un tazón y mezcle bien. Coloque sobre una bandeja y colóquela a un lado.", "Tripa y filete de caballa. Pase la punta de un cuchillo filleting afilado hacia abajo a cada lado de los espinas y la línea de sangre en el centro de cada filete y suavemente retire esta área tirando de ella con un par de pinzas para peces. Extiende la curación de los cítricos en una bandeja y coloca los filetes de pescado sobre ella, con la carne hacia abajo.", "Cubra con película adhesiva y refrigere durante dos horas.", "Enjuague los filetes con agua corriente fría para eliminar la cura, luego seque con papel de cocina.", "Caliente una sartén hasta que esté muy caliente.", "Frote ligeramente la piel de caballa con aceite de oliva, coloque el lado de la piel hacia abajo sobre la plancha durante dos minutos, retírelo y continúe plateando el plato.", "Para el jugo de guarnición un tercio del pepino y reservar el jugo.", "Pele el pepino restante y luego corte los 4 lados del pepino para dejarlo con un corazón rectangular del pepino.", "Corta los lados de pepino en trozos de 5 mm / ¼ en pedazos y reserva.", "Caliente una sartén hasta que esté muy caliente.", "Sazone los corazones de pepino y rocíe con aceite de oliva, coloque en la plancha y cocine durante dos minutos por cada lado hasta que estén ligeramente coloreados y suaves.", "En una sartén caliente, vierta una capa delgada de aceite de oliva y agregue las piezas cortadas de pepino. Deje colorear por un lado, luego gire suavemente para colorear más.", "Reduzca el fuego y agregue los chalotes y el ajo y cocine durante dos minutos.", "Desglasar la sartén con el vinagre de Chardonnay y reducir hasta que casi todo se haya ido.", "Agregue cuatro cucharadas de jugo de pepino, habas, guisantes y hierbas y caliente suavemente para asegurarse de que la mezcla permanezca húmeda. Sazonar con sal y pimienta negra recién molida.", "Para servir, vierta las verduras en el centro de un plato grande, coloque los filetes de caballa a la parrilla en la parte superior. Coloque las rodajas de limón en vinagre una y otra vez.", "En un tazón de vestir, el guisante se dispara con el aderezo de limón y se coloca sobre la caballa.", "Espolvorea con un poco más de aderezo de limón y una generosa pizca de sal marina.", "Espolvoree flores de frijol si ha tenido la satisfacción de cultivar sus propias habas."], "url": "www_bbc_co_uk_food_recipes_cured_grilled_mackerel_89657", "title": "Caballa a la parrilla curada, pepino, limón en vinagre, habas y guisantes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de caballa de grado sushi", "200g / 7oz de sal", "50g / 1¾oz de azúcar", "1 estrella de anís", "pellizcar granos de pimienta negra", "pizca semillas de cilantro", "50ml / 2fl oz de vinagre de vino blanco", "1 zanahoria, pelada, cortada longitudinalmente y cortada finamente en ángulo", "½ cabeza de coliflor, cortada en pequeños floretes", "1 pimiento rojo, en juliana", "1 pimiento amarillo, en juliana", "1 cebolla roja, cortada en octavos", "1 calabacín, cortado longitudinalmente y en rodajas finas en ángulo", "8 grosellas", "25g / 1oz de mantequilla", "2 cucharadas de azúcar en polvo", "½ vaina de vainilla", "100 g / 3½ oz de grosellas", "salpicar dulce vino blanco", "salpicar vinagre de vino blanco", "berro de coriandro", "bebé cohete hojas"], "method": ["Coloque los filetes de caballa en una bandeja y espolvoree con sal y azúcar. Cubra con papel de hornear, presione con un peso y deje enfriar en la nevera durante 30 minutos.", "Para hacer el jarabe de decapado, hierva 250 ml / 9 fl oz de agua con el anís estrellado, los granos de pimienta, las semillas de cilantro y el vinagre de vino blanco. Dejar enfriar.", "Ponga a hervir otra olla de agua y blanquee las verduras y las grosellas durante 1 minuto. Escurrir y agregar al jarabe de decapado en frío.", "Para hacer el puré de grosella, derrita la mantequilla en una cacerola pequeña a fuego medio. Agregue el azúcar, la vainilla y las grosellas espinosas. Cocine por 10 minutos hasta que las grosellas estén suaves. Agregue el vino y el vinagre y revuelva bien. Transfiera a un procesador de alimentos o licuadora y mezcle con un puré suelto.", "Retire la caballa y lave la cura de sal. Rebana cada filete muy finamente.", "Ponga un poco de puré en el fondo de un plato para servir. Escurra bien las verduras en vinagre y espolvoree sobre el puré. Coloque la caballa encima y adorne con el berro y el berro."], "url": "www_bbc_co_uk_food_recipes_cured_mackerel_with_67591", "title": "Caballa curada con verduras encurtidas y uchuvas curadas dulces", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 21", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de puré de papa cocido", "60g / 2¼ oz de harina común", "1 huevo de gallinas camperas, solo yema", "sal marina y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 chalote, finamente picado", "2 cucharadas de vinagre de vino blanco", "4 cucharadas de vino blanco", "110 g / 4oz de mantequilla sin sal, fría y en cubos", "2 cucharadas de alcaparras", "1 anchoa, finamente picada", "½ manojo de perejil, finamente picado", "puñado de berros", "4 huevos de gallinas camperas, preferiblemente orgánicos", "4 x 160 g / 5¾oz filetes de salmón orgánico curado", "Aceite para freír"], "method": ["Para el pan de papa, mezcle la papa, la harina y la yema de huevo en un bol. Sazonar con sal marina y pimienta negra recién molida y juntar para formar una masa.", "Enharine ligeramente una superficie de trabajo y extiéndala a 5 mm / ¼ de grosor. Con un cortador de pasteles, corte 9cm / 3½ en rondas.", "Caliente una sartén seca y antiadherente a fuego medio, agregue las rondas de pan de papa y cocínelas durante 1 ½ minutos por cada lado. Retire los panes de papa de la sartén y seque la sartén.", "Agregue la mantequilla a la sartén y fría los panes hasta que estén crujientes en cada lado. Sacar de la sartén y mantenga caliente.", "Para la salsa de mantequilla, caliente la chalota, el vino blanco y el vinagre de vino blanco en una sartén a fuego medio, y cocine hasta que el líquido haya reducido su volumen hasta que solo quede una cucharada de líquido.", "Batir la mantequilla fría en cubos de una pieza a la vez. Retire la sartén del fuego, agregue las alcaparras, la anchoa y el perejil y sazone al gusto con sal marina y pimienta negra recién molida.", "Para el salmón y los huevos, coloque los huevos en agua hirviendo durante 4-5 minutos hasta que estén hervidos. Transfiéralos a un recipiente con agua helada durante un minuto para detener el proceso de cocción, luego pela y mantén el calor.", "Coloque el salmón en una sartén caliente con un poco de aceite. Cocine por un minuto en cada lado - el salmón ya se ha curado para que no tarde mucho. Todavía debe ser de color rosa oscuro en el medio.", "Para servir, coloque el pan de papa en platos para servir con el salmón encima y rompa suavemente el salmón para exponer la carne interna. Coloque el huevo sobre el salmón, luego córtelo en cuatro y sazone con sal marina y pimienta negra recién molida.", "Coloque la salsa de mantequilla sobre el huevo y el salmón, y cubra con berros."], "url": "www_bbc_co_uk_food_recipes_cured_organic_salmon_71222", "title": "Salmón orgánico curado con pan de patata, huevo de gallina y salsa de mantequilla verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 trucha arco iris, fileteada, con la piel puesta, con espinas", "200g / 7oz de sal", "200g / 7 oz de azúcar", "10 semillas de hinojo", "10 semillas de cilantro", "1 estrella de anís, aplastado", "70g / 2½ oz de azúcar", "50ml / 2fl oz de vinagre de vino blanco", "1 limón, finamente cortado en una mandolina", "aceite vegetal, para freír", "4 papas reales Jersey, finamente cortadas en una mandolina", "1 limón, solo jugo", "100ml / 3½fl oz de aceite de oliva virgen extra", "sal y pimienta", "2 cucharadas de berros de mostaza", "100g / 3½ oz de guisantes frescos, envasadas", "10g de hinojo silvestre", "70g / 2½ oz de ricotta"], "method": ["Para curar los filetes de trucha, mezcle todos los ingredientes de curado en un recipiente hermético y cubra los filetes por completo con la mezcla. Selle con la tapa, colóquelo en la nevera y déjelo durante 24 horas.", "Cuando el pescado esté curado, córtalo en pedazos y use un soplete de chef para carbonizar la piel.", "Para los limones en conserva, coloque 100 ml / 3½ oz de agua, el azúcar y el vinagre en una sartén. Caliente hasta que el azúcar se disuelva y tenga un jarabe, retírelo del fuego. Mientras aún esté tibio, agregue las rodajas de limón y luego transfiera a un recipiente esterilizado con tapa. Deja por lo menos 24 horas antes de usar.", "Precaliente una freidora a 150C / 300F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Para las patatas fritas, ponga las rodajas de papa en agua fría durante 10 minutos para eliminar el almidón. Escurrir sobre papel de cocina.", "Mientras tanto, mezcle el jugo de limón con el aceite de oliva en un tazón pequeño o jarra.", "Cuando las rebanadas de papa estén secas, fríelas hasta que estén crujientes. Déjelo a un lado en papel de cocina hasta que esté listo para servir. Espolvorear con un poco de sal, si se usa.", "Para hacer una ensalada, coloca el berro de mostaza, los guisantes y el hinojo silvestre en una ensaladera. Agregue el aceite de limón y sazone con sal y pimienta, al gusto.", "Para servir, extender la ricota en el fondo de los platos para servir. Coloque la trucha curada en la parte superior y luego la ensalada. Termine con las patatas fritas esparcidas alrededor del plato y unas rodajas de limón en conserva."], "url": "www_bbc_co_uk_food_recipes_cured_river_trout_jersey_87210", "title": "Trucha de río curada, Jersey Royal crisps, ricotta y limón en conserva", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 2 como principal, o 4 como titular", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Nabos de 450 g / 14 oz, pelados y en rodajas finas", "Colinabo 200g / 7oz, pelado y finamente cortado", "6 bayas de enebro, molidas a un polvo", "2 dientes, molidos a un polvo", "rejilla de maza", "1 cucharadita de sal marina", "pizca de azúcar en polvo", "pizca de cayena", "3 cucharadas de grasa de pato", "1½ cucharada de vinagre Chardonnay", "1 cucharada de ginebra"], "method": ["En un tazón grande, mezcle los nabos y el colinabo con bayas de enebro, clavo de olor, macis, sal, azúcar y cayena. Cubra y reserve por 3 horas para que los jugos de vegetales liberen e intercambien sabores.", "En una sartén grande o una sartén a fuego alto, endulza los nabos y agrega la grasa de pato. Baje el fuego a medio y cocine durante 5 minutos, revolviendo ocasionalmente. Las verduras deben ser ligeramente suaves, pero aún tienen un poco de mordida. Agregue el vinagre y la ginebra, pruebe y sazone si es necesario.", "Servir de inmediato o almacenar en un recipiente hermético en la nevera durante un máximo de dos semanas."], "url": "www_bbc_co_uk_food_recipes_cured_spiced_turnip_and_16605", "title": "Nabo y nabo especiado curado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz puré de fresa", "225 g / 8 oz de azúcar en polvo", "500ml / 18fl oz de crema individual", "2 cucharaditas de berro de albahaca", "200 g / 7 oz de fresas inglesas, sin cascarón", "10 g de azúcar demerara", "2g hojas de albahaca, rasgadas o trituradas", "20g / ¾oz de vinagre balsámico envejecido, preferiblemente 8 años de edad", "6 galletas amaretti, desmenuzadas"], "method": ["Para el helado, mezcle el puré con el azúcar y luego agregue la crema.", "Coloque la mezcla en una máquina para hacer helados y batir según las instrucciones del fabricante hasta que se congele.", "Para las fresas, corte las fresas por la mitad y espolvoree con el azúcar, la albahaca y el vinagre balsámico.", "Mezcle suavemente para cubrir las fresas en la mezcla y déjelas durante 20 minutos, o hasta que vea que las fresas comienzan a ablandarse y curarse con el azúcar y el vinagre.", "Para servir, divide las fresas y el líquido en dos tazones.", "Incline sobre el helado de fresa, espolvoree las galletas amaretti desmenuzadas y adorne con el berro de albahaca."], "url": "www_bbc_co_uk_food_recipes_cured_strawberries_26839", "title": "Fresas curadas, helado de fresa y galletas amaretti", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 ml / ⅓ de agua mineral espumosa", "pizca de sal", "1 cucharada de aceite de girasol", "270g / 9¾ oz de harina natural, suficiente para formar una masa blanda", "2 huevos, golpeados", "100 ml / 3½ fl oz oz yogur", "jamón, chorizo, queso, champiñones,", "lo que sea que te apetezca"], "method": ["Vierta el agua mineral en un recipiente para mezclar y agregue la sal y el aceite. Dobla la harina, agregando lo suficiente para hacer una masa suave. Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante aproximadamente 30 minutos. Esto hace que sea más fácil de implementar.", "Precaliente el horno a 180 ° C / 350 F / Gas 4. Saque la masa del refrigerador y divídala en 4 bolas. Estire cada bola tan finamente como pueda, luego coloque una tabla de cortar redonda o un plato debajo, dejando que los bordes de la masa se superpongan. Esto hace un tipo de plantilla para su llenado.", "Coloque una capa delgada de relleno sobre la masa extendiéndola hasta los bordes de la placa o placa debajo. No exagere la sensación, un poco vale mucho.", "Dobla los bordes de la masa hacia el centro para formar un bonito pastel rizado plisado. No se preocupe si se ve un poco rústico: los dobleces hacen los rizos en su pastel rizado. Repita para hacer los pasteles restantes de la misma manera y colóquelos en una bandeja para hornear.", "Batir los huevos con el yogur y cepillar la mezcla sobre los pasteles. Hornee durante aproximadamente 40 minutos hasta que estén cocidos y tengan una hermosa costra dorada.", "Sirve con una ensalada."], "url": "www_bbc_co_uk_food_recipes_curly_pie_61590", "title": "Pastel rizado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]