[{"isVegetarian": true, "title": "Deep-fried halloumi with potato röstis", "url": "www_bbc_co_uk_food_recipes_deep-fried_halloumi_with_42154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g/9oz blocks halloumi, cut into 1cm/½in slices", "200ml/7fl oz buttermilk", "plain flour, for dusting", "vegetable oil, for deep frying", "salt and freshly ground black pepper", "225g/8oz plain flour", "1 free-range egg, separated", "300ml/10½fl oz fridge-cold lager", "2 large baking potatoes, grated", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "50g/1¾oz capers", "50g/1¾oz gherkins", "1 tbsp chopped fresh dill", "1 lemon, juice and zest", "200ml/7fl oz mayonnaise", "lemon wedges, to serve "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Marinate the halloumi in the buttermilk for at least 20 minutes. ", "To make the batter, sift the flour into a large bowl and add the egg yolk. Whisk in the lager gradually and add 125ml/4½oz ice-cold water until well combined. ", "Whisk the egg white until stiff peaks form in a separate bowl. Fold the egg whitesinto the batter and chill in the fridge until required.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Shake any excess buttermilk off the halloumi, then dip into the flour and coat in the batter. Fry the halloumi 5 minutes, or until crisp and golden-brown. Remove with a slotted spoon and drain on a baking sheet lined with kitchen paper. Season to taste with salt and freshly ground black pepper.", "For the röstis, boil the potatoes in for 7-8 minutes, then drain. Once cool enough to handle, peel and grate coarsely, and season with salt and freshly ground black pepper. ", "Form flat, rounded shapes of the potato mixture and chill in the fridge for 20 mnutes. ", "Heat the oil in a frying pan and fry the rostis on a medium heat for 4-5 minutes on each side, or until crisp and golden-brown. Drain on kitchen paper.", "For the tartare sauce, stir the capers, gherkins, dill and lemon in a bowl, add the mayonnaise and mix until well combined.", "Serve the halloumi on top of a rosti with a spoonful of tartare sauce and a lemon wedge on the side."]}, {"isVegetarian": true, "title": "Deep-fried ice cream with rum and raisin sauce", "url": "www_bbc_co_uk_food_recipes_deep-fried_ice_cream_29049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints vanilla ice cream", "150g/5½oz ginger nut biscuits", "75g/2½oz desiccated coconut", "2 free-range eggs, beaten", "2 tbsp coconut cream", "vegetable oil, for deep frying", "150g/5½oz raisins", "150ml/5fl oz dark rum", "1 tsp ground cinnamon", "1 lime, zest only", "200g/7oz granulated sugar", "100ml/3½fl oz double cream", "pinch salt"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Place a small baking tray in the freezer for at least 20 minutes, until very cold. Remove from the freezer. Use an ice cream scoop to make balls of ice cream, each about the same size as a golf ball. Place on the baking tray and freeze for at least an hour, preferably longer.", "In a food processor, blend the biscuits to the texture of fine breadcrumbs then mix with the desiccated coconut. Mix the eggs with the coconut cream.", "Remove the ice cream from the freezer. Dip each ball into the biscuit and coconut mixture, patting it onto the ice cream. Then dip each ball into the egg and coconut cream mixture, then coat in the biscuit and coconut mixture again. Repeat this step again, to make sure you get a thick crust with no risk of leakages. Return to the freezer again, this time for several hours or preferably overnight.", "Meanwhile, for the sauce, put the raisins and rum in a saucepan with the cinnamon. Bring to the boil, then immediately remove from the heat and add the lime zest. Leave to infuse while you make the caramel.", "Put the sugar in a medium saucepan with 100ml/3½fl oz water. Stir until the sugar looks like very wet sand. Set over a medium heat and leave until the sugar starts to dissolve. Do not stir, but carefully shake the pan every so often if it looks as though it is cooking unevenly. When it has turned an amber colour, remove from the heat and pour in the cream – it will splutter and bubble, so be careful. If the caramel seizes up, set over a low heat and stir until it has dissolved back into a sauce. Add the infused rum and raisins. Taste, season with salt and add a more rum if needed.", "When you are ready to fry the ice cream, heat the oil in a deep-fat fryer to 190C (CAUTION: hot oil can be dangerous. Do not leave unattended.) Remove the ice cream balls from the freezer right at the last minute, and carefully lower the balls into the oil and cook for around 15 seconds, until a rich golden-brown colour. Drain onto kitchen towel and serve immediately with the rum and raisin sauce."]}, {"isVegetarian": false, "title": "Deep-fried langoustines and mussels", "url": "www_bbc_co_uk_food_recipes_deep-fried_mussels_and_66637", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint vegetable oil, for frying", "200g/7oz plain flour", "1 tsp salt", "1 tsp sugar", "7g sachet instant yeast", "50ml/2fl oz vodka", "200ml/7fl oz tonic water", "5 tbsp mayonnaise", "25ml/1fl oz sweet chilli sauce", "2 tsp yuzu juice", "150g/5½oz cooked and shelled mussels ", "150g/5½oz cooked and shelled langoustines ", "2 spring onions, sliced", "1 red chilli, sliced", "1 tbsp chopped fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan until it reaches 170C/330F on a cooking thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Whisk together the flour, salt, sugar, yeast, vodka and tonic water to make a batter. Leave to prove for 10 minutes.", "To make the dip, in a separate bowl, whisk together the mayonnaise, chilli sauce and yuzu juice.", "Coat the mussels and langoustines in the batter. Fry in batches until crisp and golden-brown. Remove using a slotted spoon. Drain on kitchen paper.", "Sprinkle the spring onions, chilli and coriander over the battered seafood and serve with the dip."]}, {"isVegetarian": true, "title": "Deep-fried soft boiled egg with toasted brioche, mushrooms and dill mayonnaise", "url": "www_bbc_co_uk_food_recipes_deep-fried_soft_boiled_73060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar ", "5 free-range eggs ", "110g /4oz plain flour ", "200g/7oz fresh breadcrumbs ", "vegetable oil, for deep frying ", "50g/1¾oz butter", "1 tbsp olive oil", "1 banana shallot, finely chopped", "1 garlic clove, finely chopped", "300g/10½oz mixed wild mushrooms, torn into pieces if large", "2 tbsp dill, finely chopped", "fresh black truffle, shaved to taste", "½ loaf brioche, cut into thick slices", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz vegetable oil", "4 tbsp fresh dill, finely chopped", "fresh black truffle, to taste", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the toasted brioche, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil 4 of the eggs for 5 minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of ice-cold water.", "Crack the remaining egg into a bowl. Whisk with a pinch of salt and pepper.", "Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the beaten egg and roll in the breadcrumbs. Set aside on a tray in the fridge until needed.", "Heat the oil in a deep-fat fryer to 180C. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm/¾in and heat until a breadcrumb goes brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the eggs until golden-brown. Remove with a slotted spoon, drain on kitchen paper and season with salt.", "Heat a frying pan, add the butter and olive oil. Add the shallot and gently fry for 3 minutes, until just softened. Add the garlic and mushrooms and cook until the mushrooms have released their liquid and are tender. Finish with the dill and black truffle and season with salt and pepper.", "For the mayonnaise, put the egg yolks, vinegar and mustard in a food processor and blend until pale and creamy. ", "With the motor running, pour in a steady stream of oil until the mayonnaise is thick (you may not need all the oil). Just before serving add the dill and truffle and blend.", "When you are ready to serve, heat a clean frying pan and lay the brioche in the hot pan. Toast each side until golden-brown.", "To serve, cut a hole in the slices of brioche and sit the eggs in the holes. Dress the plate with mushrooms and mayonnaise and shavings of fresh truffle."]}, {"isVegetarian": false, "title": "Deep-fried soft-boiled egg with mushrooms, toasted brioche and herb mayonnaise", "url": "www_bbc_co_uk_food_recipes_deep-fried_soft-boiled_22870", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar ", "5 free-range eggs ", "110g/4oz plain flour ", "200g/7oz fresh breadcrumbs ", "vegetable oil, for deep-frying ", "50g/1¾oz butter", "1 tbsp olive oil", "1 banana shallot, finely chopped", "1 garlic clove, finely chopped", "300g/10½oz mixed wild mushrooms, torn into pieces if large", "½ loaf brioche, cut into thick slices", "2 egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz vegetable oil", "4 tbsp chopped fresh parsley", "2 tbsp chopped fresh tarragon", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried egg, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil 4 of the eggs for 5 minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of ice-cold water.", "Crack the remaining egg into a bowl. Whisk with a pinch of salt and pepper.", "Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the beaten egg and roll in the breadcrumbs. Set aside on a tray in the fridge until needed.", "Heat the oil in a deep-fat fryer to 180C/350F. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm/¾in and bring to the same temperature on the hob. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the eggs until golden-brown. Remove with a slotted spoon, drain on kitchen paper and season with salt.", "Heat a frying pan, add the butter and olive oil. Add the shallot and gently fry for 3 minutes, until just softened. Add the garlic and mushrooms and cook until the mushrooms have released their liquid and are tender. Season with salt and pepper.", "Heat a clean frying pan. Lay the brioche in the hot pan and toast each side until golden-brown.", "For the mayonnaise, put the egg yolks, vinegar and mustard in a food processor and blend until pale and creamy. ", "With the motor running, pour in a steady stream of oil until the mayonnaise is thick (you may not need all the oil). Just before serving add the herbs and blend.", "To serve, cut a hole in the slices of brioche and sit the eggs in the holes. Dress the plate with mushrooms and mayonnaise."]}, {"isVegetarian": false, "title": "Deep-fried poached eggs with creamed spinach", "url": "www_bbc_co_uk_food_recipes_deep_fried_poached_eggs_31935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp white wine vinegar ", "6 free-range eggs", "25g/1oz butter ", "400g/14oz baby spinach leaves, washed and drained", "generous splash double cream", "100g/3½oz plain flour ", "100g/3½oz panko breadcrumbs", "50g/1¾oz grated Cheddar or Parmesan cheese", "sunflower oil, for deep frying", "salt and freshly ground black pepper", "4 rashers smoked streaky bacon, grilled until crisp and broken up", "1 tsp truffle oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a wide, shallow pan of water to the boil and add the vinegar. Crack four eggs into individual cups. Stir the boiling water to create a ‘whirlpool’. Pour in the eggs one by one. Bring the water back to the boil and cook the eggs for 2½ minutes. Remove the eggs from the water with a slotted spoon and plunge them into a bowl of iced water. Leave to chill until required. ", "In a large frying pan or wok, melt the butter and add the spinach. Cook over a high heat for 2 minutes, or until just wilting. Stir in the cream, reduce the heat, then season with salt and pepper.", "Put the flour in a small bowl. Beat the two remaining eggs in a second bowl. Mix the breadcrumbs and cheese together in a third bowl. Carefully remove each poached egg from the iced water and pat dry with kitchen paper. ", "Gently coat each egg in the flour, then the egg and then the cheese and breadcrumb mixture. Place on a baking tray and cover with cling film. Put in the fridge for 10 minutes. ", "Meanwhile, heat the oil in a deep fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Deep fry the eggs for 2—3 minutes, or until brown and crisp. Drain on kitchen paper. ", "Meanwhile, reheat the spinach and divide between four warmed bowls. Top with the eggs and garnish with crispy bacon and a few drops of truffle oil. "]}, {"isVegetarian": false, "title": "Deep-fried sea bass with Issan-style salad", "url": "www_bbc_co_uk_food_recipes_deep_fried_sea_bass_with_54134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sticky rice", "200g/7oz hot dried chilies", "1 sea bass about 500-600g/1lb 2oz-1lb 5oz, gutted and scaled but fins and tail left on ", "3 tbsp light soy sauce", "pinch white sugar", "vegetable oil, for deep frying", "2 sticks lemongrass, thinly sliced ", "4-5 Thai red shallots, thinly sliced (available online)", "2 spring onions, thinly sliced", "small handful of sawtooth coriander (sometimes called Thai parsley), thinly sliced (available online)", "3-4 fresh or frozen kaffir lime leaves, cut into very fine strips ", "small handful fresh mint leaves", "small handful fresh coriander leaves", "2-3 dry chillies, fried briefly in a little oil until dark red and crisp", "5 tbsp lime juice", "1½ tsp of caster sugar", "4 tbsp fish sauce", "1 mandarin, juice only", "1 tbsp roasted chilli powder (see above)"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted rice powder, dry toast the rice in a heavy pan over a low heat until golden-brown. Leave to cool, then grind to a coarse powder in a pestle and mortar or a spice grinder.", "For the roasted chilli powder, slowly dry roast hot dried chillies in a wok or frying over a medium-low heat until dark red and a little black in places, this should take about 10-15 minutes. Then grind into a coarse powder in a pestle and mortar or a spice grinder. ", "Preheat a deep-fat fryer or a deep-sided, heavy-bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Score the sea bass with 3-4 angled cuts on each side. Then roll it in the soy sauce and sugar. Place the fish in the deep fry basket so it curls slightly (this is just for presentation) and then deep fry it for about 8-10 minutes, until the skin is crisp and the flesh a deep golden-brown.", "While the fish is frying, place all the salad ingredients, except the fried chillies, in a mixing bowl.  ", "Now make the dressing, mix together the lime juice and sugar until the sugar is dissolved. Add the fish sauce, mandarin juice, 3 tablespoons water and roasted chilli powder.  Taste and adjust: it should be hot, sour and slightly salty. Set aside.", "Once the fish is cooked, carefully remove from the fryer and allow to drain and cool slightly on kitchen paper for a minute ", "Put the fish on a large plate and pour ⅓ of the dressing over it, add the remainder of the dressing to the salad and serve the salad over the top of the crisp fish. Garnish with the roasted rice powder and dried chillies. "]}, {"isVegetarian": false, "title": "Deep fried soft-shell crab with aioli and a watercress salad", "url": "www_bbc_co_uk_food_recipes_deep_fried_soft-shell_80642", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz fresh yeast", "¼ tsp caster sugar", "¼ tsp salt", "200ml/7fl oz Belgian beer", "1 tsp white balsamic vinegar", "4 tbsp chopped coriander", "1 lime, juice only", "200g/7oz plain flour", "8 soft-shell crabs", "salt", "6 garlic cloves, cut in half", "250ml/9fl oz white wine", "2 free-range egg yolks", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "salt, to taste", "125ml/4fl oz extra virgin olive oil", "½ tsp saffron, soaked in 25ml/1fl oz hot water", "1 lemon, juice only", "2 bunches watercress", "½ bunch mint", "2 handfuls pea shoots", "1 tbsp vegetable oil", "2 red chillies, finely chopped", "2 green chillies, finely chopped"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the batter for the crab, place the yeast, sugar, salt, beer, white balsamic vinegar, coriander and lime juice in a large bowl and whisk until smooth.", "Add the flour and whisk until the batter is well combined. Leave to rest for an hour.", "Preheat a deep fat dryer to 190C/370F, or until a cube of bread sizzles and turns golden-brown when dropped in the oil. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the crabs in the batter and place in the deep fat fryer for 3-4 minutes turning two or three times, until golden-brown and crisp.", "Carefully remove the crabs from the hot oil using a slotted spoon, place on a plate lined with kitchen paper and season with salt.", "For the aioli, place the garlic and white wine in a pan and cook for a few minutes, then drain.", "Place the egg yolks in a small food processor, add the vinegar, Dijon mustard and salt. Blend until smooth, then with the motor running, gradually add the oil until the mixture resembles mayonnaise. Add the saffron and garlic and blend to combine. Add lemon juice to taste.", "For the watercress salad, place the watercress, mint and pea shoots in a bowl. Heat a small wok and add the oil. Once hot, add the chillies and cook for a couple of minutes.", "To serve, place the deep fried crab on a board and place the leaves next to it. Top the crab with the fried chillies and place the aioli in a bowl."]}, {"isVegetarian": false, "title": "Deep South pulled pork sliders with sweet potato fries and coleslaw", "url": "www_bbc_co_uk_food_recipes_deep_south_pulled_pork_60591", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep_south_pulled_pork_60591_16x9.jpg", "ingredients": ["1kg/2lb 4oz boneless pork shoulder ", "4 floury baps, to serve", "1 large onion, finely chopped", "8 garlic cloves, roughly chopped", "1½ tsp Tabasco", "½ tsp coriander seeds", "2 tbsp English mustard powder", "2 tsp paprika", "6 tbsp tomato ketchup", "1 tbsp Worcestershire sauce", "2 tbsp treacle", "75g/2¾oz dark brown sugar", "sea salt ", "3 sweet potatoes, cut into thin chips", "1 tbsp vegetable oil", "2 tsp Cajun seasoning", "a few fresh thyme sprigs", "3 tbsp buttermilk", "3 tbsp mayonnaise", "1 tbsp apple cider vinegar", "1 garlic clove, finely chopped", "3 carrots, grated", "½ head white cabbage, finely shredded", "½ head red cabbage, finely shredded", "6 spring onions, thinly sliced", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the marinade, put all the ingredients in a blender and blend until you have a smooth mixture.", "Put the pork in a large saucepan, pour over the marinade and turn the meat until coated. Cover and marinade in the fridge for 2 hours, or overnight if you have the time.", "Place the pan over a high heat, add just enough water to cover the meat (you will need about 1 litre/1¾ pints) and bring to the boil. Reduce the heat to a steady simmer, cover with a lid and cook for 1½ hours, or until the meat pulls apart easily with a fork. You will need to turn the pork during the cooking time.", "Meanwhile, preheat the oven to 210C/190C Fan/Gas 6. Put the sweet potato in a large roasting tin, drizzle over the oil and sprinkle with the Cajun seasoning and thyme. Roast for 35–40 minutes, turning halfway, until slightly charred on the edges.", "When the pork is cooked, remove it from the sauce using a carving fork. Shred the meat, then transfer to a plate, cover with kitchen foil and set aside. Return the marinade to the heat and bring a steady simmer. Cook without a lid until reduced and thick.", "For the coleslaw, put the buttermilk, mayonnaise, vinegar and garlic in a large bowl. Add the carrots, cabbages and spring onions and toss until coated. Season with salt and pepper.", "Toast the buns, slide in the pork and spoon over the marinade sauce. Serve with the sweet potato fries and coleslaw."]}, {"isVegetarian": false, "title": "Deep-fried calamari with lemon mayonnaise", "url": "www_bbc_co_uk_food_recipes_deepfriedcalamariwit_13050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz squid tubes", "plain white flour to coat", "salt and pepper to taste ", "oil for deep-frying", "4 tbsp mayonnaise ", "½ a lemon, juiced ", "3 sprigs of dill, chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the calamari, open up the squid tubes and slice into 2cm/¾in strips.  ", "Coat with flour and season.  ", "Place in the fridge for 2 hours. By doing this you'll find the flour will melt onto the squid creating a form of self-batter. When fried it will be deliciously crisp. It is not a traditional method, but an excellent alternative.  ", "Deep fry in hot oil until golden brown, drain on kitchen towel and serve with lemon mayonnaise.  ", "For the lemon mayonnaise, mix all ingredients together and serve with the calamari."]}, {"isVegetarian": false, "title": "Deep fried calamari with garlic and lemon mayonnaise", "url": "www_bbc_co_uk_food_recipes_deepfriedcalamariwit_68061", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deepfriedcalamariwit_68061_16x9.jpg", "ingredients": ["vegetable oil, for deep frying", "250g/9oz plain flour", "½ tsp cayenne pepper", "½ tsp smoked Spanish paprika (many supermarkets and delis sell smoked Spanish paprika. If you can't get hold of any, use the traditional paprika instead)", "½ tsp salt", "500g/1lb 2oz squid, cut into 5mm/¼in rings", "2 eggs, beaten", "200ml/7fl oz mayonnaise", "1 garlic clove, crushed", "½ lemon, juice only"], "serves": "Serves 6-8 as a snack", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mayonnaise, mix all the ingredients together and set aside.", "For the calamari, place enough oil in a wok, large saucepan or deep-fat fryer to come halfway up the pan. Place over a medium heat. If you're using a deep-fat fryer or have a thermometer, heat the oil to 180C/350F. If not, to check the oil is at the right temperature, drop a 2-3cm/¾-1¼in cube of bread into the hot oil. It should become golden and crispy in 1 minute.", "While the oil is heating, place the flour, cayenne, paprika and salt in a large sandwich bag. Drop in the squid and shake around to coat evenly. This may need to be done in two batches, depending on the size of the bag.", "Dip the floured squid into the beaten egg and then carefully drop into the hot oil. Fry for 2-3 minutes until golden. Remove from the oil and briefly drain on kitchen paper before serving with the garlic and lemon mayonnaise."]}, {"isVegetarian": true, "title": "Deep-fried cauliflower with spiced batter and herbs", "url": "www_bbc_co_uk_food_recipes_deepfriedcauliflower_87213", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "2 tbsp chopped fresh chives", "1 tbsp cumin seeds", "1 tbsp ground turmeric", "250g/9oz self-raising flour", "300ml/10fl oz sparkling water", "1 cauliflower, cut into florets, blanched and drained", "salt, for sprinkling"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the chives, cumin seeds, turmeric and flour into a bowl and mix well. Gradually whisk in enough sparkling water to make a smooth batter the consistency of double cream.", "Dip the cauliflower florets into the batter to coat completely, shaking off any excess.", "Carefully place the cauliflower into the hot oil. Deep fry for about 4-5 minutes, or until lightly golden-brown. Remove from the oil using a slotted spoon and drain on kitchen paper.", "To serve, place onto a serving plate and sprinkle with salt."]}, {"isVegetarian": false, "title": "Chilli hoki with tamarind ketchup", "url": "www_bbc_co_uk_food_recipes_deepfriedchillihokiw_87091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz self-raising flour", "85g/3oz cornflour", "1 tsp chilli flakes", "salt and freshly ground black pepper", "200g/7oz hoki fillet, chopped into bite-sized pieces", "1 free-range egg white, beaten", "2 tbsp vegetable oil", "1 lime, juice only", "1 tbsp soy sauce", "2 tbsp tomato ketchup", "2 tbsp tamarind paste", "dash vegetable oil", "salt and freshly ground black pepper", "1 lime, cut into wedges", "small handful fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli hoki, in a shallow bowl mix the self-raising flour, cornflour, chilli flakes and salt and freshly ground black pepper together. ", "Dip the chopped hoki into the beaten egg white and then roll in the flour mixture to coat. ", "Heat the vegetable oil in a non-stick frying pan, add the hoki and fry for 1-2 minutes on each side, or until golden-brown.", "For the tamarind ketchup, mix all the tamarind ketchup ingredients together in a small pan and heat gently for 1-2 minutes, then pour into a small dipping bowl.", "To serve, place the chilli hoki on a serving plate and serve with the tamarind ketchup. Garnish with the lime wedges and coriander."]}, {"isVegetarian": true, "title": "Deep-fried courgette flowers", "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettefl_89332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz vegetable oil, for deep frying", "225g/8oz ricotta", "1 lemon zest and juice only", "salt and freshly ground black pepper", "4 courgette flowers, with the baby courgette stems left on", "plain flour, for dusting", "200g/7oz plain flour", "1 tsp bicarbonate soda ", "pinch salt", "250ml/9fl oz ice cold carbonated water", "1 tbsp mint, finely chopped", "1 lemon, juice only", "100ml/3 fl oz crème fraîche", "1 fennel bulb, finely sliced on a mandoline"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "For the stuffed courgette flowers, mix the ricotta, lemon zest and juice together in a bowl. Season well with salt and freshly ground black pepper.", "Carefully spoon equal amounts of the ricotta mixture into each of the courgette flowers. Be careful not to overfill the flowers or they won't close.", "Gently squeeze the petals of each flower back together to enclose the ricotta mixture.", "Dredge each stuffed courgette flower in some plain flour.", "For the batter, mix together the flour, bicarbonate of soda and salt in a clean bowl.", "Gradually add the water, whisking well to form a batter. ", "Dip the stuffed courgette flowers into the batter and transfer to the hot oil to deep-fry for 3-4 minutes, or until golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the salad, place the mint, lemon juice and crème fraîche into clean bowl and mix well.", "Add the fennel and stir gently to coat. ", "To serve, place equal amounts of fennel salad onto each plate and top with a deep-fried courgette flower."]}, {"isVegetarian": false, "title": "Deep-fried courgette flowers", "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettefl_91863", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 good-quality anchovy fillets in olive oil, drained, cut in half lengthways", "75g/2¾oz buffalo mozzarella, drained, cut into slices 2.5cm/1in long and 1cm/½in wide, then drained on kitchen paper for 20-30 minutes", "salt and freshly ground black pepper", "6 baby courgettes, with flowers", "sunflower oil, for deep-frying", "3 tbsp strong white flour", "75g/2¾oz strong white flour", "½ tsp bicarbonate of soda", "2 tbsp lightly beaten free-range egg", "good pinch salt", "125ml/4fl oz chilled fizzy water or light lager", "1 lemon, cut into wedges, to serve"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, wrap one piece of anchovy fillet around the middle of each length of mozzarella. Season, to taste, with salt and freshly ground black pepper.", "Open up the flower of one of the courgettes into the palm of your hand, taking care not to tear it. Carefully remove the stamens and pistil from each with a small knife. Insert one piece of the prepared mozzarella inside, then gently twist the petals back around the filling. Repeat the process with the remaining baby courgettes and filling.", "Half-fill a large saucepan with sunflower oil and heat to 180C (use a cooking thermometer to check the temperature).", "Sift the flour onto a plate or shallow dish and season well with salt and freshly ground black pepper. Set aside. ", "For the batter, sift the flour and bicarbonate of soda into a mixing bowl. Add the beaten egg and a pinch of salt. Gradually add the sparkling water or lager in a thin stream, whisking continuously with a large whisk until the batter is the consistency of double cream. (NB: Do not overwhisk, as the air will escape from the batter.)", "When the oil is hot, dredge the stuffed courgette flowers, one at a time, in the seasoned flour, then dip into the batter until completely covered. ", "Carefully lower two of the stuffed courgette flowers into the hot oil and fry for 2-3 minutes, turning carefully once or twice, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining stuffed courgette flowers. Keep warm. ", "To serve, pile the stuffed courgette flowers into the centre of a serving plate, squeeze over the juice from the lemon wedges and season, to taste, with salt."]}, {"isVegetarian": true, "title": "Deep-fried filo mushrooms with rocket pesto", "url": "www_bbc_co_uk_food_recipes_deepfriedfilomushroo_85295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "3 tbsp pine nuts", "1 garlic clove, peeled", "large handful rocket", "salt and freshly ground black pepper", "500ml/18fl oz vegetable oil, for deep frying", "6 chestnut mushrooms, stalks removed", "12 x 8cm/3½in squares ready-made filo pastry", "1 free-range egg, beaten"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the rocket pesto, place all the pesto ingredients into a small food processor and blend until smooth.", "For the mushrooms, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place a teaspoon of the rocket pesto into the cap of each mushroom. You will have some left over.", "Lay half of the filo squares out on a flat surface and brush the edges of each square with beaten egg. Place a stuffed mushroom into the middle of each square and scrunch together around the edges to seal, brushing with more beaten egg.", "With the remaining filo squares, wrap each mushroom in another piece of pastry brushed with beaten egg. ", "Carefully place the wrapped mushrooms into the hot oil and deep fry for 4-5 minutes, or until golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To serve, place the mushrooms onto a serving plate and drizzle over the remaining rocket pesto."]}, {"isVegetarian": true, "title": "Deep-fried goats cheese with winter pear and watercress salad", "url": "www_bbc_co_uk_food_recipes_deepfriedgoatscheese_14412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Crottin goats' cheese (or 1 x 200g/7oz)", "4 sheets spring roll pastry - 20cm/8in square", "little beaten eggwash", "2 red onions, thinly sliced", "1 tbsp brown sugar", "2 tbsp virgin olive oil", "2 tbsp red wine vinegar", "150ml/5fl oz red wine", "½ tsp freshly picked thyme leaves or rosemary", "vegetable oil for frying", "1 stick celery, peeled and thinly sliced", "1 avocado, cut into large wedges", "1 ripe but firm pear, sliced", "2 bunches watercress", "4 cos gem lettuce, separated into leaves", "150g/5oz rocket leaves", "1 tbsp balsamic vinegar", "6 tbsp peanut oil or vegetable oil ", "½ tsp dijon mustard", "1 tbsp halved walnuts", "¼ tsp honey"], "serves": "Serves 2-4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Firstly make the sweet onion marmalade. Heat the oil in a pan, add the onions and fry for 1 minute. Add the sugar and caramelise lightly together.", "Pour over the vinegar and red wine, add the thyme and leave to cook over a gentle heat until reduced and has a jam consistency -  about 25 minutes (this can be made well in advance). Chill until ready for use.", "Lay out the pastry sheets and brush liberally all over with eggwash. Place a spoonful of onion marmalade in centre of each sheet, then top with goats cheese. Wrap up securely to enclose the cheese within using eggwash as glue.  ", "Heat the vegetable oil in a large pan to 170C/325F - you could bake them in the oven too if you wanted.", "Meanwhile for the salad, place all three salad leaves in a bowl. Top with the avocado, fresh pear and celery and season lightly.", "Make a dressing from the mustard, honey, balsamic vinegar, oil, salt and pepper. Pour over the salad, add the walnuts and dress on a serving plate (either individual or one large serving plate).", "Fry the goats' cheese parcels for 1-2 minutes until golden and crispy, remove and drain on kitchen paper and dress on the salad. Serve immediately."]}, {"isVegetarian": false, "title": "Fish and chips", "url": "www_bbc_co_uk_food_recipes_deepfriedfishinbeerb_67776", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deepfriedfishinbeerb_67776_16x9.jpg", "ingredients": ["beef dripping or oil, for deep frying (beef dripping is used in the traditional method and gives a far better flavour, but sunflower or vegetable oil will work just as well)", "4x175g/6oz thick cod or haddock fillets, taken from the head end rather than the tail end of the fish", "225g/8oz self-raising flour, plus extra for dusting", "salt and freshly ground black pepper", "300ml/10fl oz fridge-cold lager ", "6-8 large floury potatoes, such as maris piper, king edward, desiree (depending on how hungry you are)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2 and preheat the dripping or oil to 120C/250F.", "For the chips, peel the potatoes and cut into whatever size you prefer. Wash well in cold water, drain and pat dry with a clean tea towel. Put the potatoes into the fryer and allow them to fry gently for about 8-10 minutes, until they are soft but still pale. Check they're cooked by piercing with a small, sharp knife. Lift out of the pan and leave to cool slightly on greaseproof paper.", "Increase the heat of the fryer to 180C/350F.", "Season the fish and dust lightly with flour; this enables the batter to stick to the fish.", "To make the batter, sift the flour and a pinch of salt into a large bowl and whisk in the lager to give a thick batter, adding a little extra beer if it seems over-thick. It should be the consistency of very thick double cream and should coat the back of a wooden spoon. Season with salt and thickly coat 2 of the fillets with the batter. Carefully place in the hot fat and cook for 8-10 minutes until golden and crispy. Remove from the pan, drain and sit on a baking sheet lined with greaseproof paper, then keep warm in the oven while you cook the remaining 2 fillets in the same way.", "Once the fish is cooked, return the chips to the fryer and cook for 2-3 minutes or until golden and crispy. Shake off any excess fat and season with salt before serving with the crispy fish. If liked, you can serve with tinned mushy peas and bread and butter, for the authentic experience!"]}, {"isVegetarian": true, "title": "Deep-fried courgettes with tomato sauce", "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettesw_84659", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "pinch dried chilli flakes", "400g/14oz canned tomatoes", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper ", "handful fresh basil", "handful fresh parsley", "2 tbsp grated cheddar", "400ml/14fl oz vegetable oil, for deep frying", "1 courgette, cut into 4 long strips", "100ml/3½fl oz milk", "75g/3oz self-raising flour, seasoned with salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the olive oil in a saucepan over a medium heat. Add the onion and fry for three minutes, or until softened. ", "Add the chilli flakes, tomatoes, balsamic vinegar and season with salt and freshly ground black pepper. Bring to the boil, then reduce the heat and simmer for 15 minutes.", "Add the parsley and basil and stir well, then pour the sauce into a bowl.", "Sprinkle with the cheddar cheese.", "For the deep-fried courgettes, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the courgettes first in the milk and then dredge in the flour. Repeat this process with the milk and flour, then carefully place the courgettes into the hot oil and fry for three minutes, or until golden. Carefully remove the courgettes with a slotted spoon and drain on kitchen paper.", "To serve, place the courgettes onto a warm plate, sprinkle with salt and serve the tomato sauce alongside."]}, {"isVegetarian": true, "title": "Deep-fried mozzarella with tomato and rocket sauce", "url": "www_bbc_co_uk_food_recipes_deepfriedmozzarellaw_83815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil", "1 medium onion, finely chopped", "1 garlic clove, finely chopped", "1.5kg/3lb 4oz tomatoes, chopped", "8 fresh basil leaves", "50g/2oz rocket leaves", "salt and freshly ground black pepper", "8 thin slices white bread", "125ml/4½fl oz milk", "200g/7oz buffalo mozzarella, cut into discs 1cm/½in thick", "salt and freshly ground black pepper", "6 tbsp plain flour", "2 medium free-range eggs, beaten and seasoned with salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the olive oil in a pan and, once hot, add the onion and garlic and fry for 4-5 minutes, until soft and golden.", "Add the tomatoes, bring to the boil, then reduce the heat and simmer gently for 15 minutes. ", "Add the basil leaves and rocket, stir and simmer for another 10-15 minutes.", "Season with salt and freshly ground black pepper and, using a hand blender, blend to a sauce. Pass the sauce through a sieve into a bowl and set aside.", "For the deep-fried mozzarella, heat a deep-fat-fryer to 180C/350F. (CAUTION: hot oil can be dangerous - do not leave unattended)", "Cut the crusts off the bread and cut into slightly larger discs than the mozzarella slices.", "Dip the slices of the bread on one side into the milk and then place a slice of the mozzarella onto the dry side.", "Season the mozzarella with salt and freshly ground black pepper and make a sandwich with the other slice of bread, milk-soaked side on the outside. Press down around the edges to seal the sandwich.", "Dredge the sandwich in the flour and then dip into the beaten egg to soak.", "Carefully place the sandwich into the hot deep-fat-fryer and fry until golden and crisp on the outside. Carefully remove with a slotted spoon and drain on paper towels.", "To serve, pour the hot sauce onto a plate and place two of the mozzarella sandwiches into the middle."]}, {"isVegetarian": true, "title": "Deep-fried onion rings with watercress mustard salad", "url": "www_bbc_co_uk_food_recipes_deepfriedonionringsw_84753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz vegetable oil, for deep frying", "75g/2½oz plain flour", "75g/2½oz self-raising flour", "salt and freshly ground black pepper", "100ml/3½fl oz sparkling water", "1 red onion, peeled, cut into thick rings", "1 tbsp wholegrain mustard", "1 tbsp Dijon mustard", "2 tbsp white wine vinegar", "100ml/3½fl oz extra virgin olive oil", "salt and freshly ground black pepper", "100g/3½oz watercress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the onion rings, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place both types of flour into a large bowl, season well with salt and freshly ground black pepper and whisk in enough sparkling water to make a batter the consistency of single cream - you may not need it all.", "Dip the onion rings into the batter then carefully place them into the hot oil to deep fry for 4-5 minutes, or until golden-brown. Remove the onion rings from the oil with a slotted spoon and drain on kitchen paper.", "For the salad, place the mustards, vinegar and olive oil into a large bowl, season well with salt and freshly ground black pepper and mix well. Add the watercress to the bowl and stir to coat.", "To serve, place the salad onto a large plate with the onion rings on top."]}, {"isVegetarian": false, "title": "Deep-fried prawns with pesto and saffron mayonnaise", "url": "www_bbc_co_uk_food_recipes_deepfriedprawnswithp_85133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "150g/5½oz self-raising flour", "100ml/3½oz sparkling water", "salt and freshly ground black pepper ", "10 raw tiger prawns, peeled, tails left on", "50g/1¾oz plain flour", "50g/1¾oz parmesan, grated", "2 garlic cloves, peeled", "2 large handfuls fresh basil leaves", "75g/2½oz pine nuts", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg", "1 free-range egg yolk", "½ tsp white wine vinegar", "1 tbsp Dijon mustard", "1 garlic clove, crushed", "salt and freshly ground black pepper ", "200ml/7fl oz vegetable oil", "2 spring onions, finely chopped ", "pinch saffron, soaked in 1 tbsp warm water", "1 tbsp chopped fresh parsley", "1 lemon, cut into wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the 150g/5½oz self-raising flour and sparkling water into a bowl. Season with salt and freshly ground black pepper and mix to make a batter the consistency of double cream.", "Place the 50g/1¾oz plain flour into a shallow dish. Roll the prawns in the plain flour, shake off any excess and dip into the batter. Carefully place the prawns into the hot oil and deep fry for 6-8 minutes, or until golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the pesto, place all the pesto ingredients into a small food processor and blend until smooth.", "For the saffron mayonnaise, place the egg and egg yolk, vinegar, mustard and garlic into a bowl. Season with salt and freshly ground black pepper and mix well. ", "Pour in the vegetable oil in a very slow trickle, whisking vigorously until all the oil has been incorporated and the mixture is thick.", "Stir in the chopped spring onions, the saffron, along with its soaking liquid, and the parsley and taste to check the seasoning. ", "To serve, place the deep-fried prawns onto a large plate with the pesto and saffron mayonnaise in small bowls alongside and the lemon wedges, to garnish."]}, {"isVegetarian": false, "title": "Deep-fried sole with crisp noodles and brown butter sauce", "url": "www_bbc_co_uk_food_recipes_deepfriedsolewithcri_88041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½pt vegetable oil for deep frying", "1 sole fillet, skinned", "200g/7oz self-raising flour, plus extra for dusting", "pinch turmeric", "cold fizzy water", "salt and freshly ground black pepper", "300ml/½ pint vegetable oil for deep frying", "100g/3½oz rice noodles", "55g/2oz butter", "½ lemon, juice only", "small handful fresh parsley, chopped", "salt and freshly ground black pepper", "lemon wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep fried sole, pour the vegetable oil into a large saucepan or deep fat fryer and heat until a small cube of bread turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "For the batter, put the flour into a large bowl and gradually whisk in enough cold fizzy water to make a batter the onsistency of double cream.  Dip the sole into a little flour and shake off the excess and then dip into the batter. Then gently drop the battered fish into the hot oil. Deep fry for  five minutes or until crisp and golden-brown. Remove with a slotted spoon and drain on kitchen paper.", "For the crisp noodles, carefully drop the rice noodles into the hot oil and fry for one minute or until puffed up. Remove with a slotted spoon and  drain on kitchen paper.", "For the brown butter sauce, melt the butter in a saucepan and heat until just turning golden-brown. Add the lemon juice and parsley, and season, to taste, with salt and freshly ground black pepper. Cook for one more minute.", "To serve, pile the crisp noodles onto a serving plate, top with the deep fried sole and pour over the brown butter sauce and garnish with lemon wedges."]}, {"isVegetarian": false, "title": "Deep-fried prawns with soy and sesame noodle salad", "url": "www_bbc_co_uk_food_recipes_deepfriedprawnswiths_89052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz self-raising flour", "1 tsp dried chilli flakes", "2 tbsp fresh chopped chives", "salt and freshly ground black pepper", "150ml/5½fl oz cold sparkling water", "300ml/10½fl oz vegetable oil, for deep-frying", "5 raw tiger prawns, peeled, de-veined", "150g/5½oz rice noodles", "1 tbsp soy sauce", "dash sesame oil", "1 tbsp sesame seeds, toasted", "small handful chopped fresh coriander leaves", "salt and freshly ground black pepper", "lime wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried prawns, place the flour, chilli flakes, chives, salt and freshly ground black pepper into a large bowl and then gradually whisk in the cold sparkling water until the mixture is smooth and reaches the consistency of double cream. (You may not need all of the water.)", "Pour the vegetable oil into a saucepan and heat until a small cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the prawns into the batter and then carefully lower into the hot oil. Fry for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the noodle salad, cook the rice noodles in boiling water according to packet instructions, then drain and refresh under cold running water. Transfer to a bowl, then stir in the soy sauce, sesame oil, sesame seeds and coriander. Season, to taste, with salt and freshly ground black pepper. ", "To serve, pile the noodle salad onto a serving plate and top with the deep-fried prawns. Garnish with lime wedges and serve."]}, {"isVegetarian": false, "title": "Deep fried vegetables with cashews", "url": "www_bbc_co_uk_food_recipes_deepfriedvegetablesw_70708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/2¾ of self-rising flour", "salt", "1 tbsp fish sauce", "pinch white pepper", "dash white wine", "6floz/170ml water", "fresh clean oil for deep-frying", "1 small carrot", "¼ aubergine", "¼ green pepper", "¼ red pepper", "¼ orange pepper", "¼ sweet potato", "4 florets broccoli", "4 florets cauliflower", "½ onion sliced", "1 spring onion", "1 handful of cashew nuts, crushed", "1 red chilli, chopped fine", "1 clove garlic, choped fine", "100ml/3½ of plum sauce", "1 lime, juice only", "dash sesame oil"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix flour, salt, fish sauce, white pepper, white wine, and water to make a nice smooth batter.", "Cut all the vegetables into thin strips.", "Wash all vegetables and dry to avoid splattering.", "Mix well with the batter.", "Put the oil in a wok or frying pan and allow it to be hot.", "Deep-fry the mixed vegetables for between 3-4 minutes or until golden brown.", "Remove onto a platter. ", "To make sauce, mix all ingredients in third group except cashew nuts. ", "Pour sauce on top of vegetables, sprinkle with crushed cashew nuts on top, and serve."]}]