[{"isVegetarian": true, "title": "Rollos de berenjena al horno rellenos de mozzarella", "url": "www_bbc_co_uk_food_recipes_bakedauberginerollsf_71302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 berenjena grande, cortada longitudinalmente en 6 rebanadas de aproximadamente 5 mm / ¼ de pulgada de grosor", "2 cucharadas de harina normal", "2 huevos, ligeramente batidos con un poco de sal y pimienta", "aceite de oliva para freír", "40 g / 1½ oz de queso parmesano (o un queso duro vegetariano similar), recién rallado", "18 hojas grandes de albahaca fresca", "300 g / 11 oz de queso mozzarella, aproximadamente en rodajas", "sal", "pimienta negra recién molida", "4 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, finamente picado", "1 cebolla pequeña, finamente picada", "½ tallo de apio, finamente picado", "Lata de 400g / 14oz de tomates de ciruela", "ensalada verde frondosa"], "serves": "Sirve 2-3", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para hacer la salsa de tomate, caliente el aceite de oliva en una cacerola, agregue el ajo, la cebolla, el apio y el sudor hasta que se ablanden. Agregue los tomates, sazone con sal y pimienta, luego cubra la sartén y cocine a fuego lento durante 25 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Espolvorea las rodajas de berenjena en la harina y luego sumérgelas en el huevo batido.", "En una sartén grande, caliente un poco de aceite de oliva a una profundidad de aproximadamente 1 cm / ½ pulgada, agregue las rodajas de berenjena y fría en ambos lados hasta que estén doradas. Retire y escurra sobre papel de cocina.", "Separe las rodajas de berenjena en una tabla de cortar grande, sazone con sal y pimienta, y luego espolvoree uniformemente 25 g / 1 oz del queso parmesano sobre la parte superior.", "Coloque tres hojas de albahaca en cada rebanada de berenjena y cubra con un par de rodajas de mozzarella, reservando la mitad del queso. La ruede cuidadosamente cada rebanada, asegurándose de que estén hacia abajo para que no se abran.", "Cubra un plato grande a prueba de horno (o los individuales) con un poco de salsa de tomate y coloque los rollos de berenjena en la parte superior.", "Vierta la salsa de tomate restante y cubra con las rodajas de mozzarella y parmesano restantes.", "Coloque en el horno y hornee durante 15 minutos, hasta que la parte superior esté ligeramente coloreada y empiece a burbujear. Sirve con una ensalada verde."]}, {"isVegetarian": false, "title": "Pollo al aguacate y mostaza al horno", "url": "www_bbc_co_uk_food_recipes_bakedavocadoandmusta_87754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pechuga de pollo pequeña sin piel", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ aguacate, piedra removida", "1 cucharada de aceite de oliva", "azúcar pizca", "1 cucharadita de mostaza Dijon", "2 cucharaditas de vinagre de vino blanco", "sal y pimienta negra recién molida", "55g / 2oz de tomates cherry, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Caliente una sartén hasta que esté muy caliente.", "Sazone la pechuga de pollo con sal y pimienta negra recién molida. Cepille el pecho con un poco del aceite de oliva y luego coloque la pechuga de pollo en la sartén de la plancha. Cocine por 8-10 minutos, o hasta que esté completamente cocido.", "Mientras tanto, coloque el aguacate en una sartén pequeña a prueba de horno y coloque en el horno para hornear durante 5-6 minutos, o hasta que se caliente. Retire del horno y, cuando esté lo suficientemente frío como para manipularlo, quítese la piel con cuidado.", "Para el aderezo de mostaza, coloque el aceite de oliva, el azúcar, la mostaza y el vinagre en un recipiente con tapa de rosca. Sazonar generosamente con sal y pimienta negra recién molida, atornillar bien la tapa y agitar hasta que el aderezo se emulsione.", "Corte los tomates cherry por la mitad y acomódelos en un plato. Cortar el aguacate horneado y colocar sobre la parte superior de los tomates, luego agregar el pollo chamuscado. Cuchara sobre el aderezo de mostaza y servir."]}, {"isVegetarian": false, "title": "Bajo cocido con puerros con nata", "url": "www_bbc_co_uk_food_recipes_bakedbasswithcreamed_88654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ filete de lubina, piel anotada", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "25g / 1oz de mantequilla", "1 puerro, cortado en rondas", "75ml / 2½ fl oz crema doble", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "85 g / 3 oz de champiñones silvestres, como ostras, níscalos, porcini, etc., limpios y picados", "1 tomate de vid, picado", "½ limón, solo jugo"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la lubina al horno, sazonar bien el pescado con sal y pimienta negra recién molida y colocar en una bandeja para hornear. Rocíe el aceite de oliva y el jugo de limón y hornee en el horno durante 6-8 minutos, o hasta que estén cocidos.", "Para los puerros con crema, caliente la mantequilla en una sartén y fría los puerros durante cinco minutos, hasta que empiecen a ablandarse.", "Agregue la crema y cocine a fuego lento durante unos 4-5 minutos, hasta que los puerros estén suaves y la crema se haya reducido ligeramente.", "Para la salsa de tomate y champiñones, caliente el aceite en una sartén y fríe con cuidado el ajo y los champiñones durante 4-5 minutos. Agregue los tomates y cocine a fuego lento durante 3-4 minutos más. Al final de la cocción, agregue el jugo de limón.", "Para servir, coloca una pila de puerros con crema en el centro de un plato para servir. Coloque el bajo tostado encima y rocíe sobre la salsa de tomate y champiñones."]}, {"isVegetarian": false, "title": "Fondue de queso azul al horno", "url": "www_bbc_co_uk_food_recipes_bakedbluecheesefondu_87200", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 queso azul pequeño en una caja de madera", "1 diente de ajo, en rodajas finas", "1 cucharada de hojas frescas de tomillo", "1 cucharada de miel", "3 rebanadas de pan", "2 cucharadas de aceite de oliva"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Retire el queso de la caja de madera. Retire y deseche cualquier papel o envoltura de cera y luego devuelva el queso a su caja. Coloque el queso en su caja en una bandeja para hornear antiadherente con papel de aluminio.", "Use un cuchillo pequeño y afilado para hacer varias incisiones en la parte superior si el queso. Inserte las rodajas de ajo en las incisiones, esparza sobre las hojas de tomillo y rocíe con la miel.", "Transfiera al horno y hornee por diez minutos o hasta que el medio del queso esté caliente y derritiéndose.", "Mientras tanto, caliente una sartén de plancha. Gotee generosamente ambos lados de las rebanadas de pan con aceite de oliva, agregue a la sartén de la plancha y cocine por ambos lados hasta que esté tostado y ligeramente chamuscado. Retire de la sartén y corte o rasgue en trozos del tamaño de un bocado.", "Para servir, coloque el queso, todavía en su caja, en un plato de servir. Coloque el pan a la parrilla al lado para mojar."]}, {"isVegetarian": true, "title": "Queso al horno", "url": "www_bbc_co_uk_food_recipes_bakedcheese_79377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 queso réblochon (u otro queso en una caja)", "1 ramita de romero fresco", "2 rebanadas de pan", "1 cucharada de aceite de oliva"], "serves": "Hace 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Lanza el queso con la ramita de romero. Coloque en una bandeja para hornear y coloque en el horno para hornear durante diez minutos, o hasta que el queso se derrita y caliente por dentro.", "Mientras tanto, caliente una sartén de plancha. Agregue el pan y las tostadas durante 1-2 minutos en cada lado. Retire la tostada y cepille con el aceite de oliva.", "Para servir, coloque el queso derretido en el centro de un plato, rodeado de las tostadas."]}, {"isVegetarian": true, "title": "Chili feta al horno con tomates, aceitunas y un huevo escalfado", "url": "www_bbc_co_uk_food_recipes_bakedchillifetawitht_89154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de queso feta", "puñado de menta fresca, picada", "½ tomate, en rodajas", "1 cucharadita de hojuelas de chile seco", "exprimir jugo de limón", "1 cucharada de aceite de oliva, más extra para lloviznar", "sal y pimienta negra recién molida", "2 cucharadas de aceitunas Kalamata", "pequeño puñado de perejil fresco, picado", "1 huevo de gallina, escalfado, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque el queso feta, la menta, el tomate, las hojuelas de chile y el aceite de oliva en un cuadrado de papel de aluminio. Sazonar con sal y pimienta negra recién molida, luego doblar los lados para hacer un paquete. Exprime el jugo de limón, colócalo en el horno y hornea por diez minutos.", "Para servir, espolvorea el queso feta horneado en un plato para servir, esparce sobre las aceitunas y el perejil y coloca el huevo escalfado encima. Rocíe un poco de aceite de oliva y sirva."]}, {"isVegetarian": true, "title": "Naranjas canela al horno y Grand Marnier", "url": "www_bbc_co_uk_food_recipes_bakedcinnamonoranges_73598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 naranjas grandes", "1 cucharada de azúcar moreno", "½ ramita de canela o un poco de la especia en polvo", "Grand Marnier"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Ajuste el horno a 200C / 400F / Gas 6.", "Pele la fruta con un cuchillo afilado, retire toda la médula y corte en rodajas horizontales de aproximadamente 2.5cm de grosor.", "Reúna las rebanadas para reformar el naranja. Coloque en un cuadrado de papel aluminio lo suficientemente grande como para cubrir la naranja y espolvorear con azúcar.", "Rompa la ramita de canela por la mitad y espolvoree sobre las naranjas.", "Junta los bordes de la lámina y envuelve la fruta para formar un paquete.", "Agregue una cucharadita de Grand Marnier y aplaste la lámina en la parte superior de cada naranja.", "Hornee en el horno durante 10-15 minutos, hasta que estén calientes y fragantes, y sirva."]}, {"isVegetarian": true, "title": "Mousse de chocolate al horno con fruta de la pasión", "url": "www_bbc_co_uk_food_recipes_bakedchocolatemousse_68103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 10½ oz de chocolate negro", "150g / 5oz de mantequilla sin sal", "Azúcar en polvo de 55 g / 2 oz", "6 huevos, separados", "un poco de mantequilla extra, para engrasar la lata", "255g / 9oz de mascarpone", "Crema doble 55ml / 2fl oz", "3 cucharadas de azúcar glas", "3 maracuyá (pulpa)", "azúcar en polvo", "polvo de cacao", "ramitas de menta"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Unte con mantequilla una lata de torta de fondo de 20 cm / 8 pulg con una base extraíble.", "Derrita el chocolate y la mantequilla en un recipiente sobre el agua hirviendo a fuego lento.", "Batir las claras de huevo a los picos rígidos y en otro recipiente batir las yemas con el azúcar hasta que estén pálidas.", "Agregue la mezcla de chocolate a las yemas de huevo y azúcar y doble las claras de huevo.", "Verter en la lata de la torta y hornear durante unos 20 minutos. Enfriar y espolvorear con azúcar impalpable y cacao en polvo.", "Para hacer la mousse de fruta de la pasión, bata todos los ingredientes en un tazón hasta que esté firme y sirva."]}, {"isVegetarian": false, "title": "Bacalao al horno con corteza herby", "url": "www_bbc_co_uk_food_recipes_bakedcodwithaherbycr_7813", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedcodwithaherbycr_7813_16x9.jpg", "ingredients": ["2 piezas de 180 g / 6 oz de lomo de bacalao", "2 cucharadas de pan rallado blanco fresco", "2 cucharadas de hierbas frescas picadas (como una mezcla de perifollo, cebollino, perejil, cilantro) - opcional", "1 diente de ajo, picado finamente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "Nuevas papas 140 g / 5 oz, las grandes se cortan por la mitad", "160g / 6oz de guisantes frescos o congelados"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el horno a 200C / 180C Fan / Gas 6.", "Mezcle las hierbas (si las usa), el ajo y el aceite. Agregue las migas de pan y sazone con sal y pimienta. Pon el pescado en una bandeja para hornear y extiende la mezcla de migas de pan sobre el pescado. Hornee en el horno durante 10-15 minutos hasta que la carne se vuelva opaca y se desmenuce fácilmente.", "Hervir las papas en una olla grande de agua durante 12-15 minutos, hasta que estén cocidas. Hervir los guisantes en una sartén de agua por separado durante unos minutos hasta que estén recién cocinados. Saca el bacalao del horno y sírvelo con las patatas y los guisantes."]}, {"isVegetarian": true, "title": "Batatas de comino al horno con yogur y menta", "url": "www_bbc_co_uk_food_recipes_bakedcuminsweetpotat_87787", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 camote, pelado y reducido a la mitad", "1 cucharadita de comino molido", "6 cucharadas de yogur al estilo griego", "4 hojas de menta fresca, finamente cortadas", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque las mitades de batata en una sartén con agua salada hirviendo. Regrese a ebullición, reduzca el fuego y cocine a fuego lento durante cinco minutos.", "Escurra la batata. Espolvorea cada mitad con comino molido, luego envuelve cada mitad en papel de aluminio. Transfiera directamente al estante del horno y tueste durante 12 minutos, o hasta que esté tierno.", "Mientras tanto, mezcle el yogur y la menta en un bol y sazone generosamente.", "Para servir, abra los paquetes de papel de batata y rocíe sobre el yogur acuñado."]}, {"isVegetarian": false, "title": "Huevos al horno", "url": "www_bbc_co_uk_food_recipes_bakedeggs_67466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 huevo", "1 rebanada de salmón ahumado, picado o 1 rebanada de jamón picado", "o, puñado de hongos,", "salteado", "perejil picado y cebollín, para dispersar en la parte superior", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a su configuración más alta.", "Unte con mantequilla un plato pequeño y poco hondo para hornear y esparza el salmón ahumado, trozos de jamón o champiñones en el fondo.", "Agregue el perejil picado y las cebolletas.", "Con cuidado, rompa un huevo en la parte superior y sazone con sal y pimienta.", "Hornee hasta que la clara de huevo esté lista, pero la yema todavía esté líquida, aproximadamente 5 minutos, y sirva inmediatamente con pan crujiente."]}, {"isVegetarian": false, "title": "Huevos al horno", "url": "www_bbc_co_uk_food_recipes_bakedeggs_8634", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedeggs_8634_16x9.jpg", "ingredients": ["35 g / 1¼ oz de mantequilla", "4 huevos", "2 puñados de queso rallado", "sal y pimienta", "adiciones: jamón o champiñones cocidos, espinacas escurridas (opcional)"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Gire el horno a la configuración más alta y unte la mantequilla sobre dos platos pequeños a prueba de horno. Cubra con una combinación de jamón, champiñones y espinacas, si le gusta.", "Rompe un par de huevos en la parte superior, seguido de queso rallado, sal y pimienta.", "Cocine por aproximadamente 10 minutos."]}, {"isVegetarian": true, "title": "Feta al horno", "url": "www_bbc_co_uk_food_recipes_bakedfeta_79832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de queso feta", "1 cucharada de aceite de oliva", "1 cucharadita de orégano seco", "pimienta negra recién molida", "1 limón, ralladura solamente", "exprimir jugo de limón", "1 diente de ajo, aplastado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno 200C / 400F / Gas 6.", "Coloque el queso feta en una bandeja para hornear. Rocíe el aceite y espolvoree sobre los ingredientes restantes.", "Coloque en el horno para hornear durante cinco minutos, o hasta que comience a colorear.", "Retire del horno, transfiera a un plato y sirva."]}, {"isVegetarian": true, "title": "Feta al horno con tapenade de oliva y baba ganoush", "url": "www_bbc_co_uk_food_recipes_bakedfetawitholiveta_76869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de queso feta", "2 ramitas de tomillo fresco, solo hojas", "3 cucharadas de aceite de oliva", "½ cucharadita de copos de chile", "100g / 3½oz de aceitunas negras deshuesadas", "1 diente de ajo, picado", "4 cucharadas de perejil fresco, picado", "2 cucharadas de aceite de oliva", "½ berenjena", "2 cucharadas de aceite de oliva", "100ml / 3¾fl oz de yogur griego", "1 diente de ajo, picado", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para el queso feta horneado, coloque el queso feta en una bandeja para hornear. Rocíe con aceite de oliva y espolvoree con hojas de tomillo y hojuelas de chile.", "Cocine en el horno durante cinco minutos o hasta que estén dorados.", "Para tapenade de oliva, coloque las aceitunas negras, el ajo y el perejil picado en un mini procesador de alimentos. Agregue la mitad del aceite de oliva y mezcle. Continúe agregando el aceite de oliva hasta que tenga una pasta homogénea; es posible que no necesite usar las cuatro cucharadas soperas del aceite.", "Para el baba ganoush, coloque la berenjena en una bandeja para hornear y rocíe con aceite de oliva. Cocine en el horno durante 10-12 minutos, o hasta que estén suaves.", "Retire la berenjena del horno. Despegue la piel de berenjena y deséchela.", "Coloque la carne de berenjena en un mini procesador de alimentos y mezcle. Agregue el yogur griego y el ajo y sazone y mezcle de nuevo.", "Para servir, coloca el queso feta horneado en un plato para servir. Rocíe con la tapenade y severa el baba ganoush al costado."]}, {"isVegetarian": true, "title": "Mousse de higo y chocolate horneado", "url": "www_bbc_co_uk_food_recipes_bakedfigandchocolate_78332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 1 oz de azúcar en polvo", "25g / 1oz de cacao", "2 cucharadas de harina de maíz", "¼ litro de leche", "1 clara de huevo de granja, batida para formar picos rígidos", "50ml / 1¾fl oz de crema doble, batida", "2 higos picados"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el azúcar impalpable en una sartén con el cacao, la harina de maíz y la leche. Caliente hasta que forme una salsa espesa y suave.", "Quite el fuego y deje enfriar durante cinco minutos.", "Doble las claras de huevo y la crema doble juntas. Agregue esta mezcla a la mezcla de chocolate enfriada.", "Coloque en un anillo de chefs de 6 pulgadas. Dejar enfriar durante diez minutos en la nevera.", "Saque y quite el anillo con un soplete.", "Servir en un plato con los higos picados alrededor de la mousse."]}, {"isVegetarian": true, "title": "Higos horneados con Stilton", "url": "www_bbc_co_uk_food_recipes_bakedfigswithstilton_78111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 higos, corte abierto", "55g / 2oz de queso Stilton", "vinagre balsámico", "aceite de oliva", "hojas de ensalada mixta, para servir"], "serves": "Hace 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rellene cada higo con una cuña de Stilton y vuelva a unir las mitades.", "Coloque en una bandeja para hornear y rocíe con vinagre balsámico y aceite de oliva. Coloque en el horno de ocho a diez minutos, hasta que esté caliente y burbujeante.", "Retire del horno y sirva con una ensalada mixta."]}, {"isVegetarian": true, "title": "Ensalada de queso de cabra y higos horneados", "url": "www_bbc_co_uk_food_recipes_bakedfigandglazedgoa_90710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 higo fresco y maduro", "55g / 2oz de queso de cabra", "1 puñado de hojas de cohetes", "1 tomate, picado", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque el higo en una bandeja de horno. Con un cuchillo afilado, haga una incisión a la mitad de la figura en la parte superior con forma de cruz, para que la parte superior del higo se abra cuando se aprieta ligeramente.", "Desmenuce el queso en el centro expuesto de la figura y hornee en el horno durante 3-4 minutos, o hasta que el queso comience a derretirse.", "En un tazón, mezcle el cohete y el tomate con el jugo de limón y sazone con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada de rúcula y tomate en un plato para servir y coloque la higuera cocida encima."]}, {"isVegetarian": true, "title": "Camembert al horno con pan de ajo", "url": "www_bbc_co_uk_food_recipes_bakedcamembertwithga_86995", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedcamembertwithga_86995_16x9.jpg", "ingredients": ["1 camembert entero, en su caja", "1 diente de ajo, en rodajas", "3-4 ramitas de tomillo fresco", "1 cucharadita de aceite de oliva", "1 pan de chapata pequeño, cortado por la mitad", "1 cucharada de aceite de oliva", "1 diente de ajo, pelado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Retire el envoltorio de plástico del queso y vuelva a colocarlo en su caja, dejándolo sin tapa.", "Perfore la parte superior del queso en varios lugares con un cuchillo afilado e inserte pedazos de ajo y ramitas de tomillo en las ranuras.", "Rocíe el queso con aceite de oliva y colóquelo en una bandeja para hornear, dejando el queso en su caja. Hornee en el horno por diez minutos, o hasta que el centro del queso se derrita.", "Para el pan de ajo, rocíe el lado cortado del pan con aceite de oliva y coloque el lado del corte hacia abajo en una sartén caliente hasta que esté tostado. Frote el lado tostado del pan con el diente de ajo.", "Sirva el pan de ajo con el queso caliente para mojar."]}, {"isVegetarian": false, "title": "Pescado al horno con tapenade de aceitunas verdes", "url": "www_bbc_co_uk_food_recipes_bakedfishwithgreenol_72460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 filetes de solla", "150ml / 5fl oz de vino blanco seco", "mantequilla para engrasar", "Filetes de anchoa 50 g / 1¾oz", "2 dientes de ajo, pelados", "175 g / 6¼ oz de aceitunas verdes deshuesadas", "1 limón, solo jugo", "4 cucharadas de aceite de oliva", "20g / ¾oz, o gran puñado, hojas de albahaca", "20g / ¾oz, o gran puñado, perejil de flatleaf", "sal y pimienta negra recién molida", "16 ciruelas o tomates cherry", "2 cucharadas de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para hacer la tapenade, coloque las anchoas, el ajo, las aceitunas, el jugo de limón y cuatro cucharadas de aceite de oliva en un procesador de alimentos y mezcle con una mezcla gruesa, no lo haga demasiado suave. Agregue la albahaca y el perejil y pulse suavemente para combinar. Sazone al gusto.", "Tome la mezcla de tapenade y extienda por un lado de cada filete de solla. Enrolle los filetes desde la cabeza hasta la cola y fíjelos con un pequeño pincho o palito de cóctel. Coloque los filetes en una fuente para hornear y vierta el vino sobre el pescado.", "Coloque un pedazo de pergamino generosamente untado o papel de hornear directamente sobre cada filete, con la mantequilla hacia abajo, y hornee durante 20 minutos.", "Mientras tanto, coloca los tomates en una bandeja para hornear y cúbrelos con el aceite. Asar hasta que las pieles comiencen a separarse, alrededor de 10-15 minutos.", "Sirva el pescado al horno con los tomates. Rocíe cualquier jugo de cocina sobre el pescado."]}, {"isVegetarian": true, "title": "Ajo cocido al horno", "url": "www_bbc_co_uk_food_recipes_bakedgarlic_1395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 bulbos regordetes de ajo, se quitan las tapas", "aceite de oliva, a llovizna", "sal de roca", "pan rústico calentado, para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el ajo en una bandeja para hornear y rocíe con un poco de aceite de oliva.", "Espolvorea sobre un poco de sal de roca y coloca en un horno caliente durante 20-30 minutos o hasta que los dientes se hayan suavizado.", "Exprime el puré de ajo de cada diente y extiende sobre el pan caliente."]}]