[{"isVegetarian": true, "title": "Mary's lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_marys_lemon_meringue_pie_02330", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_lemon_meringue_pie_02330_16x9.jpg", "ingredients": ["225g/8oz plain flour", "175g/6oz butter", "45g/1¾oz icing sugar", "1 large free-range egg, beaten", "6 lemons, zest and juice ", "65g/2¼oz cornflour", "250g/9oz caster sugar", "6 free-range egg yolks", "4 free-range egg whites", "225g/8oz caster sugar", "2 tsp cornflour"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.  ", "First make the pastry.  Measure the flour and butter into a food processor and blend together until the mixture resembles fine breadcrumbs.  Add the icing sugar, egg and one tablespoon of water and whizz again until combined to a ball.  ", "Tip the pastry onto a work surface and roll out to a 3mm thickness. Use the rolling pin to lift the pastry up and transfer it to line a 23cm/9in loose-bottomed flan tin.  Be careful not to stretch the pastry as you tuck it into the corners. Cover in cling film and place in the refrigerator to chill for 30 minutes.", "Take the pastry-lined tin out of the fridge and trim the excess pastry. Press the top edge of the pastry so that it stands slightly higher than the top of the tin.", "Line the pastry case with parchment and fill with baking beans.  Bake for about 15 minutes then remove the beans and parchment and return to the oven for a further five minutes.  ", "Remove from the oven and reduce the temperature to 170C/340F/Gas 3½. ", "For the filling, mix the lemon zest and juice with the cornflour and stir to form a smooth paste.  Measure 450ml/16fl oz of water into a pan and bring to the boil.  Add the lemon cornflour mixture to the hot water and stir over the heat until the mixture has thickened, then remove from the heat.  ", "In a bowl mix together the sugar and egg yolks and carefully whisk into the lemon mixture in the pan.  Stir over a medium heat until thickened.  Set aside for a few minutes and then pour into the baked pastry case.", "For the meringue, whisk the egg whites in a free-standing mixer until soft peaks form when the whisk is removed.  Add the caster sugar a little at a time, still whisking until the meringue is stiff and glossy.  Add the cornflour and whisk again.", "Spoon on top of the filled pastry case and spread the meringue to completely cover the lemon filling. Then create a swirl on the top of the meringue.", "Bake in the oven for about 15 minutes until the filling is completely set and the meringue is lightly golden and crisp. Allow to cool completely before cutting or serve very slightly warm."]}, {"isVegetarian": true, "title": "Mary's sticky toffee pudding", "url": "www_bbc_co_uk_food_recipes_marys_sticky_toffee_41970", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_sticky_toffee_41970_16x9.jpg", "ingredients": ["100g/3½oz butter, softened, plus extra for greasing ", "175g/6oz light muscovado sugar", "2 large free-range eggs", "225g/8oz self-raising flour ", "1 tsp baking powder", "1 tsp bicarbonate of soda", "3 tbsp black treacle\t\t\t", "275ml/9½fl oz full-fat milk", "double cream or vanilla ice cream, to serve", "100g/3½oz butter", "125g/4½oz light muscovado sugar", "1 tbsp black treacle", "300ml/10fl oz pouring double cream", "1 tsp vanilla extract"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Butter a wide shallow 1.7-litre/3-pint ovenproof dish.", "Put the butter, sugar, eggs, flour, baking powder, bicarbonate of soda and treacle into a mixing bowl. Beat using an electric handheld whisk for about 30 seconds or until combined. Pour in the milk gradually and whisk again until smooth. Pour into the prepared dish. Bake for 35–40 minutes or until well risen and springy in the centre.", "To make the sauce, put all the ingredients into a saucepan and stir over a low heat until the sugar has dissolved and the butter has melted.  Bring to the boil, stirring for a minute.", "To serve, pour half the sauce over the pudding in the baking dish. Serve with the cream or ice cream."]}, {"isVegetarian": true, "title": "Mary’s Victoria sandwich", "url": "www_bbc_co_uk_food_recipes_marys_victoria_sandwich_58140", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_victoria_sandwich_58140_16x9.jpg", "ingredients": ["4 large free-range eggs ", "225g/8oz caster sugar, plus extra for sprinkling ", "225g/8oz self-raising flour ", "1 level tsp baking powder ", "225g/8oz unsalted butter, softened, plus extra for greasing ", "200g/7oz raspberries ", "250g/9oz jam sugar ", "100g/3½oz unsalted butter, softened ", "200g/7oz icing sugar, sifted ", "2 tbsp milk "], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line two 20cm/8in sandwich tins: use a piece of baking or silicone paper to rub a little baking spread or butter around the inside of the tins until the sides and base are lightly coated. Line the bottom of the tins with a circle of baking paper. ", "Break the eggs into a large mixing bowl, add the sugar, flour, baking powder and soft butter. Mix everything together until well combined. Be careful not to over-mix – as soon as everything is blended you should stop. The finished mixture should be of a soft ‘dropping’ consistency. ", "Divide the mixture evenly between the tins. Use a spatula to remove all of the mixture from the bowl and gently smooth the surface of the cakes. ", "Place the tins on the middle shelf of the oven and bake for 25 minutes. Don’t be tempted to open the door while they’re cooking, but after 20 minutes do look through the door to check them. ", "While the cakes are cooking, make the jam. Put the raspberries in a small deep-sided saucepan and crush them with a masher. Add the sugar and bring to the boil over a low heat until the sugar has melted. Increase the heat and boil for 4 minutes. Remove from the heat and carefully pour into a shallow container. Leave to cool and set. ", "The cakes are done when they’re golden-brown and coming away from the edge of the tins. Press them gently to check – they should be springy to the touch. Remove them from the oven and set aside to cool in the tins for 5 minutes. Then run a palette or rounded butter knife around the inside edge of the tin and carefully turn the cakes out onto a cooling rack. ", "To take your cakes out of the tins without leaving a wire rack mark on the top, put the clean tea towel over the tin, put your hand onto the tea towel and turn the tin upside-down. The cake should come out onto your hand and the tea towel – then you can turn it from your hand onto the wire rack. Set aside to cool completely. ", "For the buttercream, beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth. Add the remaining icing sugar and one tablespoon of the milk and beat the mixture until creamy and smooth. Add the remaining tablespoon of milk if the buttercream is too thick. Spoon the buttercream into a piping bag fitted with a plain nozzle. ", "To assemble, choose the sponge with the best top, then put the other cake top-down on to a serving plate. Spread with the jam then pipe the buttercream on top of the jam. Place the other sponge on top (top uppermost) and sprinkle with caster sugar to serve."]}, {"isVegetarian": true, "title": "Mary’s Viennese whirls", "url": "www_bbc_co_uk_food_recipes_marys_viennese_whirls_96895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_viennese_whirls_96895_16x9.jpg", "ingredients": ["200g/7oz raspberries ", "250g/9oz jam sugar ", "250g/9oz very soft unsalted butter ", "50g/1¾oz icing sugar ", "225g/8oz plain flour ", "25g/1oz cornflour ", "100g/3½oz unsalted butter, softened ", "200g/7oz icing sugar, plus extra for dusting ", "½ tsp vanilla extract "], "serves": "Makes 12-14", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, put the raspberries in a small, deep-sided saucepan and crush them using a potato masher. Add the sugar and bring to the boil over a low heat. When the sugar is melted, increase the heat and boil for a further 4 minutes. Remove from the heat and carefully pour into a shallow container (pass it through a sieve if you'd rather not have seeds in your jam). Leave to cool and set. ", "For the biscuits, preheat the oven to 190C/170C Fan/Gas 5. Line 3 baking sheets with non-stick baking parchment. Using a 5cm/2in round cutter as a guide, draw 8 circles on each sheet of paper, spaced well apart. Turn the paper over so the pencil marks are underneath. ", "Measure the butter and icing sugar into a bowl and beat until pale and fluffy. Sift in the flour and cornflour and beat well, until thoroughly mixed. Spoon the mixture into a piping bag fitted with a medium star nozzle. Pipe 24 swirled rounds (not rosettes), inside the circles on the baking sheets. ", "Bake in the centre of the oven for 13—15 minutes, until a pale golden-brown. Cool on the baking sheets for 5 minutes then carefully transfer to a wire rack to cool completely and harden. ", "For the filling, measure the butter into a bowl and sift the icing sugar on top. Add the vanilla extract and beat with a wooden spoon or an electric whisk until very light and smooth. Spoon into a piping bag fitted with a large star nozzle. ", "Spoon a little jam onto the flat side of 12 of the biscuits and place jam-side up on a cooling rack. Pipe the buttercream over the jam and sandwich with the remaining biscuits. Dust with icing sugar to finish."]}, {"isVegetarian": true, "title": "Marzipan", "url": "www_bbc_co_uk_food_recipes_marzipan_70975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz blanched almonds", "1 plum kernel (the soft seed inside the plum stone)", "200g/7oz icing sugar", "10 strands saffron, soaked in 4 tbsp water", "1 tbsp cinnamon"], "serves": "Makes 12-15 sweetmeats", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a mortar and pestle grind 50g/2oz of almonds.", "Place the remaining 150g/5oz of almonds and the plum kernel and into a food processor", "In a pan melt the icing sugar with a sprinkle of water until it just turns transparent. At this point pour it into the food processor and blend well until the mixture is a thick paste.", "Return the processed almonds to the pan, add the contents of the mortar and pestle, and mix well with a wooden spoon on a low heat.", "When the almonds are well mixed roll out into a thick sausage and wrap in foil. Leave to stand for at least an hour.", "Place the  cinnamon in one small bowl and the soaked saffron in the other. Shape little golf ball shapes of marzipan and then roll them in your desired flavour and serve."]}, {"isVegetarian": true, "title": "White chocolate and ginger cheesecake", "url": "www_bbc_co_uk_food_recipes_marys_white_chocolate_55940", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_white_chocolate_55940_16x9.jpg", "ingredients": ["50g/1¾oz butter, plus extra for greasing", "25g/1oz plain chocolate", "150g/5½oz digestive biscuits, crushed", "300g/10½oz white chocolate buttons, or a bar chopped into pieces", "400g/14oz full-fat cream cheese", "150ml/5fl oz soured cream", "2 free-range eggs", "1 tsp vanilla extract", "4 pieces stem ginger (from a jar), finely chopped", "150g/5½oz plain chocolate, melted", "few drops red food colouring", "25g/1oz marzipan", "icing sugar, for dusting", "300ml/10½fl oz double cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat  the oven to 170C/150C Fan/Gas 3. Grease the base of a 20cm/8in springform cake tin with butter, then line with a circle of baking parchment. ", "For the base, melt the butter and chocolate in small saucepan over a low heat. Stir in the crushed biscuits.", "Transfer the base mixture to the cake tin and, using your fingers, press down until it completely covers the bottom of the cake tin in an even layer. Chill in the fridge until needed.", "For the filling, suspend a heatproof bowl over a pan of gently simmering water (do not allow the base of the bowl to touch the water). Add the white chocolate to the bowl and melt until runny and smooth, stirring occasionally with a wooden spoon.", "In a large bowl, whisk the cream cheese and soured cream together until smooth and well combined. Whisk in the eggs and vanilla extract until completely smooth, then stir in the melted white chocolate until well combined. Fold in the chopped ginger.", "Pour the filling mixture on top of the chilled base and level the top using a palette knife. Bake in the oven for 40-45 minutes, or until firm around the edge and just set in the middle. ", "Remove the cheesecake from the oven and rest for 10 minutes, then run a small blunt knife around the inside edge of the cake tin. Set aside until the cheesecake has completely cooled in the tin, then chill in the fridge.", "For the decoration, lay two strips of baking parchment on a work surface. Spoon the melted chocolate into a small piping bag fitted with a size-two writing nozzle and pipe eleven small chocolate holly leaf shapes onto the baking parchment strips (five on one, six on the other).", "Lay the strips of baking parchment paper over two rolling pins or similar slightly curved surfaces. Secure the strips at each end with elastic bands. Place the rolling pins onto the bases of two empty egg boxes to prevent them rolling away, then allow the chocolate leaves to cool and set.", "Meanwhile, add a few drops of red food colouring to the marzipan and knead until the marzipan is a uniform bright red. Dust your hands with icing sugar, then roll the marzipan into 27 small balls (these will be berries for the chocolate holly leaves).", "Remove the cake-tin ring from the cheesecake and place the cheesecake, still on its base, onto a serving plate. ", "Whip the cream until soft peaks form when the whisk is removed, then spoon into a piping bag fitted with a star nozzle. Pipe eight rosettes or swirls around the edge of the top of the cheesecake and one rosette or swirl in the middle. ", "Place one chocolate holly leaf and three holly berries in the centre of each swirl of cream, then arrange three chocolate holly leaves and the remaining marzipan berries on top of the central swirl of cream. Serve immediately."]}, {"isVegetarian": true, "title": "Marzipan and apple tart with caramel sauce", "url": "www_bbc_co_uk_food_recipes_marzipan_and_apple_tart_98603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz caster sugar", "250g/9oz ground almonds", "1 free-range egg, white only, lightly whisked", "¼ tsp almond extract", "500g/1lb 2oz all butter ready-made puff pastry", "1 free-range egg, beaten", "4 apples, very finely sliced", "75g/3oz butter", "4 tbsp caster sugar", "4 tbsp apricot jam", "115g/4oz dark soft brown sugar", "115g/4oz butter", "175ml/6fl oz double cream", "250ml/9fl oz vanilla ice cream", "4 sprigs mint "], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the marzipan, heat the sugar and 75ml/5 tbsp water in a saucepan until dissolved then boil the syrup until the mixture reaches 100C/220F (use a sugar thermometer to measure this). This is known as the soft ball stage, when a drop placed in cold water to cool down, it will form a soft ball. ", "In a bowl, mix together the ground almonds, egg white and almond extract.", "Pour the sugar syrup over the ground almonds and mix vigorously until the mixture forms a thick paste. ", "Chill the marzipan in the fridge for 1-2 hours, or until firm.", "For the tart, preheat the oven to 210C/425F/Gas 7. Line a baking tray with baking parchment.", "Roll the puff pastry out thinly on a floured surface. Cut out 4 x 12cm/4½ in circles, and lay them onto the baking tray. Leaving a gap of about a centimetre round the edge, lightly score the middles of each pastry circle with a small sharp knife, making a grid of lines. This will stop the pastry puffing up too much in the middle. Brush each pastry circle with the beaten egg.", "Roll the chilled marzipan out to 5mm/¼in thick. (If the marzipan is too hard to rollout, allow it to warm slightly at room temperature.) Cut out 4 x 11cm/4in circles and place each marzipan circle on top of a pastry circle.", "Arrange the apple slices, overlapping in concentric circles, on top of each circle of marzipan so that all of the marzipan is covered. ", "Heat the butter in a saucepan until just melted then brush over the top of the apples and sprinkle the sugar over the top.", "Transfer to the oven to bake for 15-18 minutes, or until the pastry is risen and golden-brown. ", "Meanwhile, place the apricot jam and a tablespoon of water into a saucepan and heat until the jam has melted. Pass the jam through a fine sieve into a bowl.", "Remove the tarts from the oven and brush with the melted apricot jam. ", "For the sauce, heat the sugar and butter in a small saucepan until melted and well combined. ", "Pour in the double cream and simmer gently for 3-5 minutes, or until the mixture thickens slightly.", "To serve, place a tart into the centre of each serving plate, drizzle the caramel sauce around the outside. Top with a ball of ice cream and sprig of mint and serve immediately."]}, {"isVegetarian": true, "title": "Marzipan berry cakes", "url": "www_bbc_co_uk_food_recipes_marzipan_berry_cakes_91508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marzipan_berry_cakes_91508_16x9.jpg", "ingredients": ["180g/6¼oz caster sugar", "180g/6¼oz butter, softened", "2 free-range eggs", "80g/2¾oz plain flour", "150g/5oz ground almonds", "100g/3½oz marzipan, cut into 1cm/½in pieces", "100g/3½oz blueberries", "icing sugar, to serve"], "serves": "Makes 12 cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cut out squares of baking parchment that would easily cover the holes of a bun tray. Line each one. ", "Beat the sugar and butter together in a bowl with an electric mixer until pale and fluffy.", "Gradually beat in the eggs, then gradually introduce the flour and ground almonds. Continue to beat until all is well incorporated.", "Fold the marzipan into the mixture.", "Divide the mixture between the lined cups of the bun tray. Scatter 3-4 berries over each one.", "Bake the cakes for 30 minutes, or until springy to the touch.", "Sprinkle with a little icing sugar and serve warm."]}, {"isVegetarian": true, "title": "Marzipan and orange plait with mascarpone cream", "url": "www_bbc_co_uk_food_recipes_marzipanandorangepla_75825", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz puff pastry", "150g/5½oz marzipan, cut", "2 oranges, peeled, segmented and sliced", " into bite-sized pieces", "1 tbsp honey", "½ tsp of cinnamon ", "1 free-range egg, beaten", "2 tbsp of icing sugar ", "55ml/2fl oz double cream, whipped", "125g/4oz mascarpone"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the marzipan orange plait, preheat oven 180C/350F/Gas 4.", "Roll out the puff pastry to form a large rectangle.", "Place the marzipan down the centre of the puff pastry and top with the orange slices.", "Drizzle with honey and sprinkle with cinnamon. ", "Cut the sides of pastry making the cuts about one inch markings apart.  Plait the pastry across the middle.", "Brush with the beaten egg and place plait onto baking tray.", "Cook in a pre-heated oven for 20 minutes until golden.", "Dust with icing sugar and serve.", "To make the mascarpone cream, mix the whipped cream and mascarpone together in a bowl to a smooth thick consistency. Serve with the orange plait."]}, {"isVegetarian": true, "title": "Marzipan and peach filo crown", "url": "www_bbc_co_uk_food_recipes_marzipanandpeachfilo_77970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 100g/3½oz/12-inch squares of ready-made filo pastry", "2 x 100g/3½oz/12-inch square slices marzipan", "50g/1¾oz unsalted butter, melted", "2 peach halves ", "icing sugar for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas6", "Roll the marzipan squares to 1cm/½in thickness.", "Place the two 12-inch squares of layered filo pastry onto a floured surface. Brush each pastry square with melted butter.", "Place one marzipan square in the centre of each pastry square.", "Place a peach half flat-side down on top of each marzipan square.", "Fold in the corners, making sure each peach in the centre is visible.", "Brush with the melted butter and transfer to a baking tray. Bake for six minutes.", "To serve, place on a plate with a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Marzipan and raspberry tart with Chantilly cream", "url": "www_bbc_co_uk_food_recipes_marzipanandraspberry_93745", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz caster sugar", "75ml/3fl oz water", "250g/9oz ground almonds", "1 free-range egg white, lightly whisked", "¼ tsp almond extract", "500g/1lb 2oz all butter ready-made puff pastry", "1 free-range egg, beaten", "200g/7oz raspberries", "50g flaked almonds", "200ml/7fl oz double cream", "1½ tbsp icing sugar", "½ tsp vanilla extract", "200g/7oz raspberries", "1½ tbsp icing sugar, plus extra for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sugar and water in a saucepan until dissolved then boil the syrup until the mixture reaches the soft ball stage, 100C/220F (use a sugar thermometer to measure this).", "Place the ground almonds, egg white and almond extract into a bowl. Pour over the sugar syrup and mix vigorously until the mixture forms a thick paste. Chill the marzipan mixture in the fridge for 1-2 hours, or until firm.", "Meanwhile, preheat the oven to 210C/425F/Gas 7.", "Roll the puff pastry out thinly on a floured surface. Cut out 4 x 12cm/5in circles, place onto a baking tray and score the centre of each circle with a knife. Brush each pastry circle with the beaten egg.", "Roll the chilled marzipan out to 0.5cm/¼in thick. (If the marzipan is too hard to rollout, allow it to warm slightly at room temperature.) Cut out 4 x 11cm/4in circles and place each circle on top of a pastry circle.", "Arrange the raspberries in concentric circles on top of each circle of marzipan so that all of the marzipan is covered. Sprinkle over the flaked almonds.", "Transfer to the oven to bake for 15-18 minutes, or until the pastry is risen and golden-brown. Remove the tarts from the oven and dust with icing sugar immediately. ", "Meanwhile whisk the double cream in a bowl until stiff peaks form when the whisk is removed. Whisk in the icing sugar and vanilla extract. ", "For the raspberry purée, blend the raspberries and icing sugar in a food processor to a purée. Sieve the sauce into a bowl.", "To serve, spoon some of the raspberry purée onto each of 4 serving plates and top with a tart.  Top with a quenelle of the vanilla cream."]}, {"isVegetarian": false, "title": "Masala-marinated chicken with minted yoghurt sauce", "url": "www_bbc_co_uk_food_recipes_masala-marinated_chicken_18088", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masala-marinated_chicken_18088_16x9.jpg", "ingredients": ["6 cardamom pods", "2 tbsp cumin seeds", "2 tbsp coriander seeds", "4 whole cloves", "1 tsp black peppercorns", "1 tsp ground fenugreek", "2 tsp ground turmeric", "1 tbsp paprika", "1-2 tsp hot chilli powder (the more you use, the spicier the dish)", "¼ tsp ground cinnamon", "1 tsp flaked sea salt", "4 garlic cloves, peeled and crushed", "40g/1½oz piece fresh root ginger, peeled and finely grated", "100g/3½oz low-fat natural yoghurt", "1.65kg/3lb 8oz chicken", "1 lime, quartered", "freshly ground black pepper", "fresh watercress or baby leaf salad, to serve", "200g/7oz low-fat natural yoghurt", "1 tsp ready-made mint sauce"], "serves": "Serves 4-5", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To make the marinade, split the cardamom pods and remove the seeds. Put the cardamom seeds in a dry non-stick frying pan and discard the husks. Add the cumin and coriander seeds, cloves and black peppercorns and place the pan over a medium heat. Cook for 1-2 minutes, stirring regularly until the spices are lightly toasted – you know they’re ready when you can smell the spicy aroma. ", "Tip the toasted spices into a pestle and mortar, or an electric spice grinder, and pound to a fine powder. Transfer to a mixing bowl and stir in the fenugreek, turmeric, paprika, chilli powder, cinnamon and salt. Add the garlic, ginger and yoghurt, then mix well and leave to stand while you prepare the chicken. ", "Place the chicken on its breast on a sturdy chopping board and cut carefully either side of the backbone with good scissors or poultry shears. Chuck out the bone and cut off the foot joints and wing tips. ", "Strip all the skin off the bird apart from the ends of the wings (which are easier to remove after cooking). You’ll find this simpler to do if you snip the membrane between the skin and the chicken flesh as you go. Cut off and discard any obvious fat – it will be a creamy white colour. Open out the chicken and place it on the board so the breast side is facing upwards. ", "Press down heavily with the palms of your hands to break the breastbone and flatten the chicken as evenly as possible. This will help it cook more quickly. Slash the meat with a knife through the thickest parts of the legs and breast. Place the chicken in a shallow non-metallic dish – a lasagne dish is ideal – and tuck in the legs and wings. ", "Spoon over the marinade and really massage it into the chicken on both sides, ensuring that every bit of bird is well coated – get your hands in there and really go for it. Cover the dish with cling film and put the chicken in the fridge to marinate for at least four hours or ideally overnight. ", "Preheat the oven to 200C/400F/Gas 6. Take the chicken out of the dish and place it on a rack inside a large baking tray, breast-side up. Squeeze over some juice from the lime and season with ground black pepper. ", "Roast for 1-1¼ hours until the chicken is lightly browned and cooked throughout, tossing the lime quarters on to the rack for the last 20 minutes to cook alongside the chicken. They’ll be good for squeezing over the meat later. The juices should run clear when the thickest part of one of the thighs is pierced with a skewer. Cover loosely with foil and leave to rest for 10 minutes before carving.", "While the chicken is resting, make the sauce. Spoon the yoghurt into a serving bowl and stir in the mint sauce until thoroughly combined. Transfer the chicken to a plate or wooden board and carve into slices, discarding any skin. Serve with the sauce and some watercress or salad and enjoy!"]}, {"isVegetarian": true, "title": "Masala chai baklava", "url": "www_bbc_co_uk_food_recipes_masala_chai_baklava_33678", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz toasted flaked almonds", "100g/3½oz cashew nuts", "½ tsp cardamom seeds, ground", "300g/10½oz granulated sugar", "100g/3½oz clear honey", "3 breakfast tea bags ", "¼ tsp cardamom seeds", "2½cm/1in piece fresh root ginger, finely chopped", "12 sheets ready-made filo pastry ", "75g/2½oz unsalted butter, melted"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, combine the almonds, cashews and cardamom in a blender and pulse until finely chopped. Set aside.", "To make the syrup, combine the sugar, honey, tea bags, cardamom and ginger with 200ml/7fll oz water in a medium saucepan and heat until the sugar is dissolved. Lower the heat and simmer for 15-20 minutes then set aside to cool.", "When the syrup has reached a safe temperature, sieve the syrup and leave to cool completely in the freezer. ", "Preheat the oven to 180C/350F/Gas 4 and grease a baking tray with butter.", "Brush a sheet of pastry with butter then fold it over. Spread about a tablespoon of the filling mixture over it, leaving a 5mm/¼in border on all sides. ", "Starting at one of the long edges, roll up the filo into a long cylinder shape. Brush generously with butter and roll the cylinder into a tight spiral. Brush with butter again and place on the prepared baking tray. Repeat the process with the remaining sheets of filo and place them next to each other in the baking tray. ", "Bake for 50 minutes, or until golden-brown.", "When cooked, spoon half the syrup all over the baklavas. Leave for five minutes and then spoon over the remaining syrup. Let the baklava cool a little, then serve."]}, {"isVegetarian": true, "title": "Masala dosa in a chapati", "url": "www_bbc_co_uk_food_recipes_masaladosainachappat_74794", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masaladosainachappat_74794_16x9.jpg", "ingredients": ["1 tsp skinned split black lentils or urad dal", "2 tbsp vegetable oil", "pinch of asafoetida", "1 tsp cumin seeds", "½ tsp brown or black mustard seeds", "8-10 curry leaves", "3 medium dried red chillies, stalks removed", "½ tsp turmeric", "1 medium Spanish onion, finely sliced", "¼ tsp salt", "1 tsp root ginger, peeled and finely grated", "600g/1lb 5oz white or red potatoes, peeled, diced and boiled", "1 medium tomato, roughly chopped", "20g/1oz coriander leaves, finely chopped ", "2-3 chapatis or naan breads, to serve"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pick over the lentils and remove any small stones.", "Soak the lentils in a cup of hot water for five minutes.", "Heat the oil in the frying pan. Add the asafoetida, then the cumin and mustard seeds. When they splutter, add the curry leaves, lentils, red chillies, turmeric and onion and mix. Fry over a medium heat for four minutes, then add the salt, ginger, potatoes, tomato, and coriander leaves and mix well.", "Grill the chapatis or naan breads for a couple of minutes on each side.", "Place the potato mixture on top of the breads. Roll up and serve."]}, {"isVegetarian": false, "title": "Masala Machchi", "url": "www_bbc_co_uk_food_recipes_masalamachchi_83901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cod fillets weighing 100-120g/3½-4½oz each", "1 tbsp lime juice", "pinch salt ", "1 tbsp ginger or garlic paste", "½ tsp turmeric powder", "½ tsp red chilli powder or crushed black pepper ", "¼ tsp garam masala powder", "½ tsp mango powder", "½ tsp ajwain seeds (optional)", "100g/4½oz  gram flour", "1 tbsp cornflour", "1 drop orange colour (optional)", "120ml/4¼fl oz sparkling water", "oil in a wok to deep fry", "1 tsp chaat masala", "1 small cucumber thick sliced", "2 medium tomatoes, sliced", "½ medium red onion, peeled and sliced", "10 sprigs of coriander leaves", "sea salt to taste", "pinch freshly ground black pepper or red chilli powder", "1 tsp lime juice", "½ tsp salad oil or olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Marinate the fish with lime juice and salt and keep aside for 20 minutes.   ", "Mix all the batter ingredients in a bowl until it's a smooth, runny liquid. with the sparkling water.   ", "Wipe the fish with kitchen paper or towel to remove excess moisture.   ", "Marinate the fish in the batter for further ten minutes.   ", "Heat oil in the wok and fry the fillets over medium heat until crisp.", "Remove, place on kitchen towel and sprinkle with chaat masala powder.", "To make the salad mix all the salad ingredients together. ", "Mix the dressing ingredients together, and toss the salad in the dressing.   ", "Serve the crisp fried fish on the salad."]}, {"isVegetarian": false, "title": "Masala mutton shanks with lemon rice", "url": "www_bbc_co_uk_food_recipes_masalamuttonshankswi_85025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mutton shanks", "1 tbsp ground turmeric ", "3cm/1in piece root ginger, grated", "3 garlic cloves, crushed", "pinch salt", "2 tbsp sunflower oil", "1 bay leaf", "1 cinnamon stick", "5 cloves", "6 cardamom pods, lightly crushed", "2 onions, sliced", "1 x 400g/14oz can chopped tomatoes", "2 tsp ground cumin", "3 tsp ground coriander", "2 green chillies, halved", "1 small bunch coriander", "50g/2oz desiccated coconut", "3 tbsp coriander seeds", "5 tbsp poppy seeds", "2 tbsp fennel seeds", "1 tbsp black peppercorns", "5 red chillies", "2 tbsp sunflower oil", "1 tsp mustard seeds", "2 tsp chana dal (a type of lentil from India, available in specialist Indian stores)", "3 tbsp cashew nuts", "1 tsp curry leaves", "1 tsp turmeric", "1 tsp powdered asafoetida", "1 tsp ground ginger", "500g/1lb cooked basmati rice (about 350g/12oz dry weight)", "1 lemon, juiced", "1 bunch coriander, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mutton shanks in a large saucepan with the turmeric, ginger, garlic and some salt.", "Add enough water to cover and simmer gently for 1½ hours or until the meat is tender.", "Meanwhile, grind all the curry paste ingredients together in a spice grinder or pestle and mortar. Set aside until required.", "For the curry, heat two tablespoons of the sunflower oil in a large deep frying pan and add the bay leaf, cinnamon, cloves and cardamom and fry until aromatic. ", "Add the onion and fry until it is softened, but not coloured. ", "Add the tomato and cook for five minutes, then add the cumin, coriander and green chillies and cook for a further three minutes. ", "Add the curry paste to the frying pan and cook for another two minutes, before adding the cooked mutton, salt to taste and enough of the mutton cooking water to come halfway up the shanks. Cook for another 20 minutes, turning the shanks over several times during cooking and adding more of the mutton cooking water if the sauce gets too thick. ", "For the rice, heat a frying pan until hot and add the sunflower oil.", "Add the mustard seeds and chana dal and fry until they start to pop, taking care as the oil may splatter.", "Add the cashew nuts, curry leaves, turmeric, asafoetida and ginger and stir fry for 1-2 minutes.", "Finally add the cooked rice and lemon juice and cook until hot all the way through.", "Serve the mutton with a spoonful of rice and sprinkle with coriander."]}, {"isVegetarian": true, "title": "Mascarpone and ginger crème brûlée", "url": "www_bbc_co_uk_food_recipes_mascarpone_and_ginger_88784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mascarpone_and_ginger_88784_16x9.jpg", "ingredients": ["450ml/16fl oz whipping or double cream ", "100g/3½oz mascarpone ", "1 vanilla pod, seeds only (or 2 tsp vanilla extract)", "10cm/4in piece fresh root ginger, peeled, very finely grated ", "6 free-range egg yolks ", "60g/2½oz soft light brown sugar, plus about 4–6 tbsp for the topping "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Put the ramekins into a roasting tin and pour in enough hot water to come halfway up the sides of the ramekins. ", "Put the cream, mascarpone and vanilla seeds (or extract) in a pan and heat until almost boiling, then remove the pan from the heat and stir in the ginger until well combined.", "Whisk the egg yolks and sugar together in a bowl until pale and fluffy. ", "Gradually add the ginger cream, whisking all the time. (I like to include the bits of ginger in the crème brûlée, but if you don’t want them, place a sieve over a measuring jug and pour the cream mixture into it to sieve out the ginger. Using a wooden spoon, push the ginger mix left in the sieve to get as much flavour as you can, then discard the ginger bits.)", "Divide the cream mixture equally between the ramekins, then place them (still in the roasting tin) in the oven for about 30 minutes, or until the brûlées begin to set. They should still wobble like jelly in the very centre, but should not be too liquid, nor completely set. It is very easy to overcook these so check after 20 minutes to see how they are doing. Then check every five minutes after that as some ovens are much more powerful than others. ", "Remove the brûlées from the oven and from the roasting tin and leave to cool, then place in the fridge for at least one hour. ", "Sprinkle about one tablespoon of brown sugar evenly on the top of each brûlée, making sure the tops are completely covered. Using a cook’s blowtorch, caramelise the sugar until dark brown and crisp. A very hot grill works too. Leave to cool a little and then serve immediately. "]}, {"isVegetarian": true, "title": "Mascarpone-filled pandoro", "url": "www_bbc_co_uk_food_recipes_mascarponefilledpand_87752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pandoro (sweet Italian bread)", "300ml/½pint double cream", "250g/9oz mascarpone cheese", "1 lemon, finely grated zest only", "splash maraschino liqueur", "2 tbsp icing sugar, plus extra to dust", "gold candles, to decorate (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pandoro horizontally into four.", "In a large bowl, whisk together the cream, mascarpone, lemon zest, maraschino and icing sugar, until soft peaks form when the whisk is removed. ", "Divide the mixture between the layers of pandoro and carefully spread out to the edges.", "Reconstruct the pandoro in layers on a serving plate and dust liberally with icing sugar and serve. Decorate with gold candles, if you like."]}, {"isVegetarian": true, "title": "Mashed potatoes", "url": "www_bbc_co_uk_food_recipes_mashedpotatoes_90230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mashedpotatoes_90230_16x9.jpg", "ingredients": ["500g/1lb 2oz potatoes, such as Maris Piper", "50g/2oz butter", "25ml/1fl oz double cream", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the potatoes and chop them in half.", "Place the potatoes in a large pan of water over a high heat. Add a pinch of salt and bring to the boil.", "Boil the potatoes gently until tender. When you can break the potatoes with a fork or cut them easily with a knife, they're done. Drain them in a colander.", "Leave the potatoes in the colander until the steam has evaporated (about 3-4 minutes). If the potatoes are still wet when you start to mash, you will end up with watery mash.", "Place the potatoes in a large bowl and mash them with a potato masher. The harder you work them, the lighter and fluffier they'll become. Don't use anything electrical. Electric whisks or food processors will ruin the texture. If you get tired, stop for a minute, shake your arms and then get back to it.", "Once you're sure there are no more lumps in the potatoes, add the butter.", "Mash the butter into the potato. Once it has melted into the mash, add a splash of cream. Mash again and check the consistency, adding more cream if necessary. Taste and add a bit of salt and freshly ground black pepper, to your liking. You can add ingredients to your mash to complement your dish. Try wholegrain mustard with rack of lamb, chopped chives with sea bream and caramelised red onions with bangers."]}, {"isVegetarian": false, "title": "Mashed potato-topped sausage pie", "url": "www_bbc_co_uk_food_recipes_mashedpotatotoppedsa_83707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb potatoes, peeled and cut into large, equal-sized chunks", "25g/1oz butter", "100ml/3½fl oz cream or milk, approximately", "1kg/2¼lb sausagemeat ", "1 large onion, diced", "1 tsp olive oil", "2 x 400g/14oz cans chopped tomatoes, drained", "2 tsp mixed herbs", "salt and freshly ground pepper", "75g/3oz cheddar (optional)", "peas ", "sweetcorn"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a large saucepan of boiling, salted water, boil the potatoes for about 15-20 minutes, until tender. Drain.  ", "Add the butter and a pinch of salt to the potatoes. Mash well, using a potato ricer, mouli or traditional masher, adding enough milk or cream to bring it to a creamy consistency.", "Roll the sausagemeat into walnut-sized balls and place in an oven-proof pie dish. Transfer to the oven and bake for 20-25 minutes until sizzling, but not brown.  ", "Put the onions in a frying pan with the olive oil and cook until softened. Add the tomatoes, herbs, and salt and pepper to taste. Bring to the boil, before simmering for 10 minutes.", "Pour the tomato sauce over the cooked sausage balls and top with the mashed potato.", "Sprinkle with grated cheese if liked. Return to the oven and cook for 30 minutes, until golden brown. Serve with peas and sweetcorn."]}, {"isVegetarian": true, "title": "Mashed potato with garlic-infused olive oil", "url": "www_bbc_co_uk_food_recipes_mashedpotatowithgarl_67177", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mashedpotatowithgarl_67177_16x9.jpg", "ingredients": ["900g/2lb potatoes (Désirée or King Edward)", "50g/2oz butter", "3 fat garlic cloves, halved lengthways", "8 tbsp best quality extra virgin olive oil", "salt and freshly millled black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First place the garlic and olive oil in a small saucepan over the gentlest heat possible - a heat diffuser is good for this - and leave for 1 hour for the garlic to infuse and become really soft.", "Use a potato peeler to pare off the skins as thinly as possible and then cut the potatoes into even-sized chunks, not too small. If they are large, quarter them and if they are small, halve them. ", "Put the potato chunks in a large saucepan, then pour boiling water over them, add 1 dessertspoon of salt, put on a lid and simmer gently until they are absolutely tender - they should take approximately 25 minutes. The way to tell whether they are ready is to pierce them with a skewer in the thickest part; the potato should not be hard in the centre. And you need to be careful here, because if they are slightly underdone you do get lumps.", "When the potatoes are cooked, drain them. Cover them with a clean tea cloth to absorb some of the steam for about 5 minutes, then using an electric whisk on a low speed, begin to break them up using half the garlic and oil. As soon as all that is incorporated, add the rest of the garlic and oil and whisk until smooth, seasoning well with salt and freshly milled black pepper."]}, {"isVegetarian": true, "title": "Ma's macadamia salad", "url": "www_bbc_co_uk_food_recipes_masmacadamiasalad_85171", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masmacadamiasalad_85171_16x9.jpg", "ingredients": ["2 red onions, halved, cut into wedges ", "2 red peppers, seeded, cut into chunks ", "1-2 tbsp extra virgin olive oil ", "120g/4½oz macadamia nuts ", "½ cucumber, peeled ", "3 spring onions, finely chopped", "2 shallots, finely chopped ", "2 chicory heads, hearts removed, coarsely chopped ", "½ fennel bulb, chopped", "1 tart green apple (such as Braeburn or Granny Smith) peeled, chopped", "3 Baby Gem lettuces, chopped ", "sea salt and freshly ground black pepper", "3 shallots, very finely sliced", "1 tsp wholegrain mustard", "1 tbsp brown sugar", "2 tbsp white wine vinegar", "large pinch Maldon sea salt", "freshly ground black pepper", "75ml/3fl oz extra virgin olive oil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Toss the onion and red pepper in the olive oil and roast in the oven for 30 minutes. ", "Toast the macadamia nuts in a small roasting tin for 5-7 minutes in the same oven, until they are a lovely caramel colour. Remove the macadamias from the oven and chop coarsely, then set aside to cool while the onion and pepper finish cooking.", "Slice the cucumber into quarters lengthways. Now slice down each length, cutting out the seeds (which are watery and would make your salad wishy-washy). Chop the remaining flesh.", "For the French dressing, mix all the dressing ingredients except the olive oil in a glass jar with a screw-top lid.  Shake well to dissolve the sugar and leave to stand for ten minutes (this takes the onion punch out of the shallot and softens its flavour).  Add the oil and shake again.", "To serve, mix all the salad ingredients in a bowl, season with salt and freshly ground black pepper, then toss in the French dressing."]}, {"isVegetarian": false, "title": "Masour pulao (Layered minced lamb with rice)", "url": "www_bbc_co_uk_food_recipes_masourpulaolayeredmi_74823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp saffron strands", "600g/1 lb 5oz basmati rice (uncooked weight)", "50g/2oz red masour lentils or puy lentils, soaked according to packet instructions, or tinned green lentils ", "150ml/5fl oz vegetable oil", "4 onions, thinly sliced", "4 whole cinnamon sticks", "6 to 8 whole cardamom pods", "2 tsp  fresh root ginger, finely grated ", "1 tsp garlic, crushed", "2 medium tomatoes, chopped", "2 green chillies, halved", "1 tsp garam masala", "1 tsp ground cumin", "1 tsp red chilli powder", "450g/1 lb minced lamb", "1 tbsp plain yoghurt", "handful of fresh coriander leaves, chopped", "small bunch mint leaves, chopped", "3 boiled eggs, shelled and halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Make the saffron water by soaking the saffron strands in 200ml/7fl oz of hot water. Leave to stand until needed.", "Wash the rice in warm to hot water and leave to soak in a bowl of water while you prepare the other ingredients.", "Add the lentils to a large pan filled with 400ml/14fl oz hot water (you can use some chicken stock instead of the water to give more flavour if you prefer). Place over a low to medium heat and cook for approximately 30-45 minutes, until the lentils are tender. If necessary, add more hot water during cooking. If using tinned lentils you can omit this step.", "Heat two thirds of the vegetable oil in another large pan and heat until smoking hot. Add half the onions and fry until they are golden brown and crispy. Remove with a slotted spoon and place on kitchen paper to drain. Set aside.", "Leave the oil in the pan and add the cinnamon sticks and cardamom pods. Allow the spices to sizzle for a few seconds then add the remaining raw onions and fry until golden brown.", "Now add the garlic and ginger and stir for a few seconds. ", "Add the chopped tomatoes, green chillies, ground cumin, garam masala and red chilli powder and stir for a minute or two.", "Add the minced lamb and cook until browned then add the yoghurt and stir through. Cover the pan and cook on a low heat for 30 minutes.", "Meanwhile, bring a large pan of water to the boil and add the rice. Add three teaspoons of salt and a drizzle of oil to prevent the rice from sticking. Cook until the rice becomes tender but not completely cooked through - about three minutes. Drain well and leave to stand.", "Add the remaining oil to the empty rice pan and add a layer of the crispy-fried onions and a drizzle of the saffron water. ", "Next add a thin layer of rice, then a thin layer of the lentils and some of the lamb mixture.", "Repeat the above several times until all the ingredients have been used up and you have a number of layers. Finish with a layer of fried onions and sprinkle over the chopped coriander and mint.", "Cover the pan with a clean, dry cloth and steam over a low heat for 10 - 15 minutes.", "Transfer to a large platter and garnish with the boiled egg halves. Serve."]}, {"isVegetarian": false, "title": "Massaman curry paste", "url": "www_bbc_co_uk_food_recipes_massamancurrypaste_4953", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 dried red chillies", "1 tbsp coriander seeds, ground", "1 tsp cumin seeds, ground", "1 stick cinnamon, ground", "3 cloves, ground", "4 peppercorns, ground", "4 tbsp garlic, chopped", "4 tbsp shallots, chopped", "1 heaped tsp shrimp paste", "1 - 2 sticks lemongrass, chopped", "1 tsp galangal root, chopped", "1 tsp fish sauce"], "serves": "Makes one jar", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the chillies in water for 10 minutes and then deseed. ", "Dry-fry the dry spices in a wok to release the flavours and then grind to a powder in a pestle and mortar or in a processor/blender. ", "Add all the other ingredients and grind or blitz to a fine paste. ", "Store in the refrigerator for up to 2-3 months."]}, {"isVegetarian": true, "title": "Jamaican fruit salad (Matrimony de luxe)", "url": "www_bbc_co_uk_food_recipes_matrimonydeluxe_91693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe mango, peeled, stone removed, flesh chopped", "2 kiwi fruit, peeled, cut into quarters, cores removed, flesh finely sliced", "2 ripe passionfruit, pulp and seeds", "1 large piece preserved stem ginger (from a jar), finely chopped", "1½ tbsp ginger syrup (from the jar of preserved stem ginger)", "½ lime, juice only", "double cream or ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the chopped mango, sliced kiwi and passion fruit pulp and seeds together in a large serving bowl.", "Sprinkle over the chopped stem ginger and mix well.", "Drizzle over the ginger syrup and squeeze over the lime juice. Mix carefully until the fruit is coated in the ginger and lime juice.", "To serve, spoon the matrimony de luxe into four shallow serving bowls. Drizzle over double cream or add a scoop of ice cream."]}]