[{"isVegetarian": true, "title": "Egg nog with cherries", "url": "www_bbc_co_uk_food_recipes_eggnog_9370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggnog_9370_16x9.jpg", "ingredients": ["1140ml/2 pints whole milk", "6 free-range eggs", "50g/2oz caster sugar", "1 vanilla pod, split", "20 fresh cherries, stones removed and halved", "200ml/7fl oz brandy", "cocoa powder, for dusting"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the milk, eggs, sugar and vanilla pod in a medium pan and heat gently, without boiling, until the mixture thickens enough to coat the back of a spoon.", "The egg nog can be chilled at this stage or served hot.", "To serve, scatter the cherries in the bottom of each serving glass. Divide the brandy between the glasses and pour the egg nog over. Dust with cocoa powder and serve."]}, {"isVegetarian": false, "title": "Eggs Arnold Bennett", "url": "www_bbc_co_uk_food_recipes_eggs_arnold_bennett_69867", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz milk", "200g/7oz un-dyed smoked haddock", "1 bay leaf", "10 black peppercorns", "4 free-range eggs", "40g/1½oz butter", "15g/½oz plain flour", "50g/1¾oz grated mature cheddar cheese", "sea salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the milk into a large shallow pan, then add the smoked haddock, bay leaf and peppercorns and bring to a simmer.", "Cook for five minutes, or until the fish has just cooked through and flakes when pushed gently.", "Lift the fish out of the pan and set aside to cool slightly before gently flaking, discarding the skin.", "Meanwhile, strain the milk into a clean pan and beat the eggs together in a separate bowl.", "Heat a frying pan until medium-hot, add 15g/½oz of the butter and the eggs and cook gently, stirring with a fork until they just hold together.", "Add half the flaked fish to the top of the omelette, then roll out of the pan onto an ovenproof serving dish and top with the remaining fish.", "Preheat the grill to hot.", "Wipe out the omelette pan and add the remaining 25g/1oz butter and melt, then add the flour and cook stirring well for two minutes. Gradually add the milk, whisking all the time until it forms a smooth sauce. Season the sauce with salt and black pepper. You can add a knob of butter at this stage too if you want to.", "Pour the sauce over the top of the omelette, then scatter the grated cheese over the top and place under the grill for 3-5 minutes, or until golden-brown and bubbling.", "Serve immediately."]}, {"isVegetarian": false, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggs_benedict_10471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range eggs, at room temperature", "2 tbsp white wine vinegar", "6 English muffins, halved", "butter, for spreading", "6 slices ham or smoked salmon", "1-2 tbsp finely snipped fresh chives", "225g/8oz butter, cut into pieces", "4 tbsp white wine vinegar", "1 small shallot or ½ banana shallot, peeled and very finely chopped", "10 black peppercorns", "1 bay leaf", "3 free-range egg yolks", "pinch sea salt flakes", "pinch caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a small pan just over one third full with cold water and bring it to the boil. Add the vinegar and reduce to a simmer. Crack the eggs one at a time into a small bowl and gently tip into the simmering water. Poach for 2-3 minutes. Remove with a slotted spoon and plunge into iced water, then remove the eggs and place them on a kitchen towel.  ", "For the hollandaise sauce, melt the butter slowly in a medium pan over a low heat, stirring occasionally.  Remove from the heat and pour the butter into a jug.  Add enough water into a medium saucepan to come a third of the way up the sides.  Bring to the boil, then reduce the heat to a simmer.", "Put the vinegar, shallot, peppercorns and bay leaf in a small saucepan over a high heat and bring to the boil.  Cook for 1-2 minutes, or until reduced to two tablespoons of liquid.  Remove from the heat.  ", "Put the egg yolks in a heatproof bowl and place over the pan of simmering water.  Whisk the egg yolks with the salt and sugar until pale.  Pour the vinegar mixture through a fine sieve onto the yolks and continue whisking until well combined.  Slowly add the butter in a steady stream whisking constantly until the sauce is smooth, thick and shiny.", "Toast the muffin halves and bring the pan of water back to a simmer, ready to reheat the eggs.", "Spread the muffins with butter.  Put a muffin half on each plate and top with ham or salmon.  Using a slotted spoon, drop the cooked eggs in to the simmering water and reheat for one minute.  Remove and drain on kitchen paper.  ", "Place an egg on each muffin and spoon over some hollandaise.  Sprinkle with chives and serve with the other muffin halves on the side."]}, {"isVegetarian": false, "title": "Eggs Benedict Florentine", "url": "www_bbc_co_uk_food_recipes_eggs_benedict_florentine_33122", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_benedict_florentine_33122_16x9.jpg", "ingredients": ["8 thin rashers smoked streaky bacon", "dash of vinegar", "4 large free-range eggs", "2 English muffins, halved", "knob of butter, plus extra for spreading", "200g/7oz baby spinach", "2 free-range egg yolks", "1 tsp white wine vinegar", "100g/3½oz unsalted butter, melted", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.  ", "Arrange the bacon on a baking tray and bake for 10 minutes, or until golden-brown and crisp. (Fry or grill if preferred.) Keep warm.", "To make the hollandaise, whisk the egg yolks and white wine vinegar together in a medium bowl. ", "Sit the bowl over a pan of simmering water, making sure the bowl doesn't touch the water. Pour in the melted butter, whisking continuously until the sauce has thickened and is glossy. Season with salt and pepper. Cover with cling film and set aside.", "To poach the eggs, bring the same water up to the boil, reduce to a simmer and add a dash of vinegar. Crack each egg into a ramekin or cup and swirl the water, then carefully tip the eggs into the pan.  ", "Simmer for 3–4 minutes, or until the whites are just set but the yolks are soft. Using a slotted spoon, carefully lift the eggs out and drain on kitchen paper.", "Toast the muffin halves and butter them. Divide between four plates.", "Heat a frying pan, add the butter until melted and fry the spinach until wilted, season with salt and pepper.", "Spoon the spinach on top of the muffins, top with the egg, spoon over some hollandaise and arrange a cross of two rashers on top. Serve hot."]}, {"isVegetarian": false, "title": "Eggs en cocotte with smoked haddock", "url": "www_bbc_co_uk_food_recipes_eggs_en_cocotte_with_86221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz milk", "200ml/7fl oz double cream", "1 bay leaf", "½ tsp black peppercorns", "200g/7oz undyed smoked haddock", "25g/1oz butter, plus extra for greasing ", "25g/1oz plain flour", "4 duck eggs", "2 tbsp finely grated Parmesan", "1 tbsp finely chopped chives", "buttered toast, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3 and grease 4 small cocotte dishes with butter.", " Pour the milk and cream into a saucepan, add the bay leaf and peppercorns and bring to a simmer. Remove from the heat and set aside to infuse for 30 minutes. ", "Bring the liquid back to a simmer, add the haddock and poach gently for 4–5 minutes, or until the fish flakes apart when pushed. Remove the fish from the liquid and flake into a bowl.", "Melt the butter in a separate saucepan, add the flour and whisk together. Strain the poaching liquid into a jug and measure out 300ml/10fl oz. Gradually whisk the liquid into the butter and flour until smooth, then simmer gently for 2–3 minutes, or until thickened. ", "Pour most of the sauce over the fish, reserving a little for the top of each egg, and carefully fold to combine. Divide the mixture between the moulds, then crack an egg on top of each. Spoon over the reserved sauce, sprinkle over the Parmesan and then transfer to a deep roasting tin. ", "Pour in enough boiling water to come halfway up the sides of the dishes, then bake for 10–12 minutes, or until the whites are set and the yolks are still runny. Garnish with chopped chives and serve with buttered toast."]}, {"isVegetarian": false, "title": "Eggs in pots (oeufs en cocotte)", "url": "www_bbc_co_uk_food_recipes_eggs_in_pots_93154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_in_pots_93154_16x9.jpg", "ingredients": ["150g/5½oz crème fraîche", "salt and freshly ground black pepper", "pinch nutmeg ", "handful of chopped dill", "4 free-range eggs", "red lumpfish roe", "small sprigs of dill"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the crème fraîche with salt, freshly ground pepper and a pinch of nutmeg.", "Place a heaped tablespoon of crème fraîche in the bottom of a ramekin, followed by a little dill. ", "Crack an egg on top, add a second tablespoon of crème fraîche and sprinkle with a pinch each of salt, pepper and nutmeg. Repeat with three more ramekins.", "Place the ramekins in a baking dish and pour enough lukewarm water into the dish to come halfway up the sides of the ramekins. ", "Bake for 15 minutes or until the egg yolks are set to your liking. ", "If you like, finish each serving with a teaspoon of red lumpfish roe and a sprig or two of dill."]}, {"isVegetarian": true, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggsbenedict_74872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 muffins", "4 free range eggs", "200g/7oz baby spinach leaves, wilted in a small pan", "Good-quality readymade hollandaise sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large, shallow pan with water, about 3cm (1in) deep and bring to a simmer. Add some vinegar (1-2 tablespoons per one litre of water) to help the eggs hold their shape.", "Break four eggs into separate coffee cups (this is also to help eggs maintain their shape when they're placed in the pan). Gently tip the eggs into the simmering water and poach for 2-3 minutes.", "Slice the muffins in half and lightly toast. ", "Once the eggs are poached, remove with a slotted spoon and drain on paper towels.", "Place the spinach on top of the muffins, top with the egg and spoon a generous amount of hollandaise sauce over the eggs.", "Serve at once."]}, {"isVegetarian": true, "title": "Eggs and spinach en cocotte", "url": "www_bbc_co_uk_food_recipes_eggsandspinachencoco_88059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "55g/2oz fresh spinach leaves", "2 medium free-range eggs", "50ml/2fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Melt the butter in a small pan. Add the spinach and cook until wilted. Place into a small ovenproof dish.", "Crack the eggs into a bowl and carefully slide on top of the spinach. Pour over the cream and season well with salt and freshly ground black pepper.", "Place in the oven and bake for about 7-10 minutes, or until the eggs are just set. Serve immediately."]}, {"isVegetarian": false, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggsbenedict_9435", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsbenedict_9435_16x9.jpg", "ingredients": ["6 tbsp hollandaise sauce ", "6 large, very fresh eggs ", "12 slices pancetta, grilled until crisp ", "3 English muffins, split in half horizontally ", "a little butter "], "serves": "Serves 3-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Poach the eggs in a pan of boiling water. ", "When the pancetta is cooked, keep it on a warm plate while you lightly toast the split muffins on both sides. ", "Now butter the muffins and place them on the baking tray, then top each half with two slices of pancetta. ", "Put a poached egg on top of each muffin half and then spoon over the hollandaise, covering the egg (there should be a little over 1 tablespoon of sauce for each egg). ", "Now flash the Eggs Benedict under the grill for just 25-30 seconds, as close to the heat as possible, but do not take your eyes off them - they need to be tinged golden and no more. This should just glaze the surface of the hollandaise. Serve straight away on hot plates."]}, {"isVegetarian": true, "title": "Eggs en cocotte, with mushrooms, thyme and gruyere", "url": "www_bbc_co_uk_food_recipes_eggsencocottewithcho_71187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 small onion, finely chopped", "225g/8oz button mushrooms, finely chopped", "leaves from 1 sprig of thyme", "freshly grated nutmeg", "6 large eggs", "6 tsp double cream", "40g/1½oz Gruyére cheese, finely grated", "salt", "freshly ground black pepper", "handful of baby leaf salad", "sprigs of flat-leaf parsley, tarragon, chervil, chives, fennel and dill", "lemon olive oil or extra virgin olive oil", "salt"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas Mark 6. Melt the butter in a medium-sized pan, add the onion and cook gently until soft but not coloured. ", "Add the mushrooms and thyme and continue to cook until all the excess liquid has evaporated and the mixture is quite dry. Season to taste with salt, pepper and nutmeg. ", "Spoon the mushroom mixture into six lightly buttered ramekin dishes. Break in the eggs, season them lightly, then spoon over the cream and sprinkle with the Gruyére cheese. ", "Put the ramekins into a shallow roasting tin and pour some hot water around them so that it comes about half way up the sides of the dishes. Bake for 15 minutes until the eggs are set but the yolks are still runny and the cheese is lightly golden.", "Serve with a mixture of seasoned baby salad leaves and herbs, dressed in lemon olive oil or extra virgin olive oil."]}, {"isVegetarian": true, "title": "Eggs en cocotte with morel or porcini mushrooms", "url": "www_bbc_co_uk_food_recipes_eggsencocottewithmor_67958", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large, very fresh eggs ", "½ oz (10 g) dried morels or porcini ", "3 shallots, peeled and finely chopped ", "4 oz (110 g) dark-gilled flat mushrooms, roughly chopped ", "¼ whole nutmeg, grated ", "1 oz (25 g) butter ", "salt and freshly milled black pepper ", "3 rounded tablespoons crème fraîche , half-fat crème fraîche  or Greek yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Start by soaking the morels or porcini about 30 minutes ahead of time. Place them in a bowl with 5 fl oz (150 ml) boiling water and leave them aside to soak. After that, strain them in a sieve and squeeze them to get rid of any surplus water. (You can reserve the soaking water, which can be frozen and is great for soups and sauces.) Set aside 4 pieces of the morels or porcini and put the rest in a food processor, along with the shallots, flat mushrooms, nutmeg and salt and freshly milled black pepper. Process until finely chopped.", "Heat the butter in a small saucepan. When it starts to foam, add the chopped mushroom mixture and, keeping the heat low, let it cook very gently, without a lid, for 25-30 minutes; the idea is that any excess liquid will evaporate and leave a lovely, dark, concentrated mixture.", "All this can be prepared in advance, but when you're ready to cook the eggs, start by pre-heating the oven to gas mark 4, 350°F (180°C) and boil a kettle. Gently re-heat the mixture and, stirring in 1 rounded tablespoon of the crème fraîche or yoghurt, divide it between the ramekins, making a small indentation where the egg will be placed. Now break an egg into each one and season. Stir the rest of the crème fraîche or yoghurt around to loosen it, divide between the dishes, then spread it gently over the eggs using the back of the spoon or a small palette knife. ", "Heat the butter in a small saucepan. When it starts to foam, add the chopped mushroom mixture and, keeping the heat low, let it cook very gently, without a lid, for 25-30 minutes; the idea is that any excess liquid will evaporate and leave a lovely, dark, concentrated mixture.", "All this can be prepared in advance, but when you're ready to cook the eggs, start by pre-heating the oven to gas mark 4, 350°F (180°C) and boil a kettle. Gently re-heat the mixture and, stirring in 1 rounded tablespoon of the crème fraîche or yoghurt, divide it between the ramekins, making a small indentation where the egg will be placed. Now break an egg into each one and season. Stir the rest of the crème fraîche or yoghurt around to loosen it, divide between the dishes, then spread it gently over the eggs using the back of the spoon or a small palette knife. ", "Place a piece of the reserved morels or porcini on top of each ramekin, then place the ramekins in the baking tin, pop the tin on the centre shelf of the oven and add enough boiling water to the tin to come halfway up the sides of the dishes. Now let the eggs bake for 15 minutes if you like them soft and runny, or 18 minutes if you like them more set. Either way, bear in mind that they go on cooking in the dishes as they leave the oven and reach the table. These are lovely served with slices of wholemeal bread and butter."]}, {"isVegetarian": true, "title": "Eggs Florentine", "url": "www_bbc_co_uk_food_recipes_eggsflorentine_88979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsflorentine_88979_16x9.jpg", "ingredients": ["100g/3½oz butter, cut into cubes ", "2 free-range egg yolks", "½ tbsp cold water", "½ tbsp lemon juice", "salt and freshly ground white pepper", "2 English muffins, split in half horizontally, buttered ", "2 large handfuls baby spinach, steamed", "4 free-range eggs, poached"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "For the hollandaise sauce, place 75g/2½ oz of the butter into a small saucepan and melt slowly over a gentle heat. Once melted, remove from the heat and set aside.", "Place the egg yolks into a bowl set over a pan of gently simmering water (take care not to let the bowl touch the water) and beat until pale and thickened. Add the water, lemon juice, salt and freshly ground black pepper to the egg yolks and beat for another 30 seconds.", "Add half of the remaining butter to the egg mixture in the bowl and stir for 1-2 minutes or until the mixture thickens. Remove from the heat and beat in the rest of the butter.", "Slowly pour in the melted butter, whisking constantly, until the sauce reaches the consistency of double cream. Season to taste with lemon juice, salt and freshly ground black pepper. Keep the sauce warm by resting the bowl in a pan of lukewarm water. ", "Place the buttered muffins onto a baking tray.", "Arrange the steamed spinach on top of the muffins, top with the poached eggs and pour the hollandaise sauce over the top", "Place the tray under the preheated grill for 1-2 minutes, or until the top is bubbling and just turning golden-brown. ", "Transfer the eggs Florentine onto two serving plates and serve immediately."]}, {"isVegetarian": false, "title": "Eggy bread", "url": "www_bbc_co_uk_food_recipes_eggybread_76849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice of brioche ", "2 eggs, beaten", "knob of butter", "2 slices of smoked salmon", "freshly ground black pepper", "drizzle of extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the brioche slice in the beaten eggs.", "Gently melt the butter in a non-stick frying pan and fry the brioche slice for 2-3 minutes on each side, until golden.", "Transfer to a serving plate and arrange the smoked salmon on top. ", "Sprinkle with freshly ground black pepper and drizzle with oil to serve."]}, {"isVegetarian": true, "title": "Eggy bread", "url": "www_bbc_co_uk_food_recipes_eggybread_84018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "3 tbsp condensed milk", "handful blueberries", "2 slices brioche", "knob of butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs in a bowl with the condensed milk and whisk together.", "Place a brioche slice onto a plate and place the blueberries on the top, put the second brioche slice on the top to make a sandwich. Push down on the sandwich to slightly squash the blueberries.", "Carefully pick up the brioche sandwich and place it into the egg mixture, turning it to  completely coat. ", "Meanwhile, heat a frying pan with butter on a medium to high heat, and when bubbling, place the brioche sandwich into the frying pan. Fry for two minutes on each side or until golden.", "Remove the brioche from the frying pan and serve immediately."]}, {"isVegetarian": true, "title": "Egyptian dukkah", "url": "www_bbc_co_uk_food_recipes_egyptiandukkah_13892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz sesame seeds", "100g/4oz blanched almonds", "50g/2oz coriander seeds", "10g/½oz cumin seeds", "1 tsp sea salt", "½ tsp pepper", "Turkish bread", "olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast all the seeds and almonds together in a hot dry pan. Keep stirring until fragrant. ", "Cool, then coarsely grind with the salt and pepper. ", "To serve, dip the Turkish bread into the olive oil and then into the dukkah. "]}, {"isVegetarian": true, "title": "Eight-strand plaited loaf", "url": "www_bbc_co_uk_food_recipes_eight-strand_plaited_57815", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eight-strand_plaited_57815_16x9.jpg", "ingredients": ["500g/1lb 2oz strong bread flour", "7g sachet fast action dried yeast", "10g/¼oz fine salt", "1½ tbsp olive oil", "extra flour for dusting", "sunflower oil for greasing bowl ", "1 free-range egg, beaten lightly with a pinch of salt", "pinch salt"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour in a large bowl. Add the yeast on one side of the bowl and add the salt on the other side. Salt should not be placed on top of the yeast, as it can kill it and make in in-active.  Stir the ingredients together until evenly mixed. ", "Add a good splash of olive oil.  Measure out 340ml/12fl oz water and add three-quarters to the flour mixture, and mix together by hand, then add the rest of the liquid.", "Turn the dough out onto a work surface and knead by hand until the dough looks silky and stretchy. This will take approximately 10 minutes. ", "Oil a medium sized mixing bowl and place the dough into the bowl. Cover with cling film and set aside to rise, for about an hour, or until the dough doubles in size. ", "When risen, turn the dough out onto a lightly floured work surface and knead, to knock the dough back. Shape the dough into a ball.  ", "Divide the dough into eight equal pieces then roll out each piece into a strand about 40cm/16in long.   ", "Lay the strands out on the lightly floured surface like an octopus, fanned out from a central point at the top. Stick all the ends at the central point to the table with your thumb.", "For the following braiding sequence, number the strands of dough from 1-8 from left to right. Every time you move any strand it will take the new number of its position in the row. \r\nStep 1: place 8 under 7 and over 1 \r\nStep 2: place 8 over 5\r\nStep 3: place 2 under 3 and over 8\r\nStep 4: place 1 over 4 \r\nStep 5: place 7 under 6 and over 1 \r\nRepeats step 2-5, until all the dough is braided.", "Tuck both ends of the loaf underneath to give a tidy finish.", "Place the plaited dough onto a floured baking tray, and leave to prove for another hour, until risen again.  ", "Preheat the oven to 200C/400F/Gas 6.", "Brush the loaf with the beaten egg wash and bake in the oven for 20-25mins.  "]}, {"isVegetarian": true, "title": "Elderflower and bramble berry pavlova", "url": "www_bbc_co_uk_food_recipes_elderflower_and_bramble_33135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 large free-range egg, whites only", "1kg/2lb 4oz caster sugar ", "250g/9oz white chocolate", "400g/14oz milk chocolate, chopped", "200g/7oz white chocolate, chopped", "600g/1lb 5oz strawberries, hulled ", "600g/1lb 5oz blackberries ", "500g/1lb 2oz raspberries (frozen is fine)", "6 tbsp icing sugar", "1.2 litres/2 pints double cream ", "400ml/14fl oz elderflower liqueur ", "100g/3½oz icing sugar ", "200g white caster sugar"], "serves": "Makes 1", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the meringues, draw a 22cm/8½in circle onto two pieces of parchment, then two 20cm/8in circles on two more pieces of parchment, and finally one 18cm/7in circle. Now draw an eight-petalled flower inside the circle ensuring that the petals stay within the circle. ", "Preheat the oven to 140C/275F/Gas 1. ", "Place nine of the egg whites into a large mixing bowl. Weigh out half the sugar into a smaller bowl. Using a handheld electric mixer on medium speed, mix the egg whites to soft peaks, then slowly add the sugar and continue whisking until stiff peaks form when the beaters are removed and the meringue is glossy. ", "Spoon the meringue into a disposable piping bag fitted with a large star nozzle. Place both 22cm/8½in stencils and one 20cm/8in stencil onto baking trays and pipe meringue onto the petals, filling the petals completely. ", "With a teaspoon make slight indentations in the petals. These will hold the berries later on. Remember that these layers will be stacked and so should be rather shallow. ", "Place into the preheated oven and immediately turn down to 100C/225F/Gas ¼ and bake for 1½ hours. When they are done, turn off the oven and allow to cool for 30 minutes with the oven door open. Repeat the process with the remaining two meringue layers. The smallest meringue layer will be the top, so pipe it with care, though make it as elaborate as you like. ", "Meanwhile for the bramble berries, temper the milk chocolate. Melt half of the milk chocolate into a bowl set over a saucepan of simmering water (make sure the bottom of the bowl does not touch the water). Heat until the chocolate reaches 43C/109F (measure the temperature with an electric food thermometer). ", "Remove from the heat, and add the remaining half of the milk chocolate. Cool to 28C/82F then reheat slightly to 30C/86F. The chocolate is now tempered. Repeat the process with the white chocolate.  ", "Line a baking tray with baking parchment. Using cocktail sticks, dip the strawberries into the tempered milk chocolate and place onto the baking sheet. Allow to set. Spoon the melted white chocolate into a piping bag fitted with a writing nozzle and zig-zag the white chocolate over the chocolate-dipped strawberries.  Set aside.", "For the raspberry coulis, blend the raspberries and icing sugar in a food processor, then press the purée through a fine sieve into a small bowl. Set aside. ", "For the elderflower cream, whisk the cream in a large mixing bowl to soft peaks. Fold in the elderflower liqueur and icing sugar with a spatula. Refrigerate until needed. ", "Once the meringue layers are completely cool, melt the white chocolate and paint this over the tops of the meringues using a pastry brush. This will help avoid any absorption of excess liquid from the cream. ", "To assemble the pavlova, place one of the largest meringues onto a cake stand. Add a quarter of the cream into the centre. Place some of the blackberries on top, and place some berries into the hollows in the meringue flower petals – alternate a chocolate-coated strawberry on one petal, with three blackberries on another. Add the next layer of meringue and repeat. ", "Add the top layer of meringue and pipe a small blob of cream in the centre, and top with a chocolate strawberry. ", "To make the spun sugar, dissolve the sugar in two tablespoons water in a medium saucepan over a medium heat, stirring constantly. ", "When the sugar is dissolved, turn the heat up and boil without stirring until it turns a copper colour. Immediately remove from the heat and place the saucepan into a sink of cold water (be careful not to get any water in the caramel or you will need to start again). ", "Dip two forks, held together back to back, into the caramel and spin them around and over the meringue layer, until you have a cage of spun sugar. ", "Serve in slices with the raspberry coulis. "]}, {"isVegetarian": true, "title": "Elderflower and lemon buns and spiced buns", "url": "www_bbc_co_uk_food_recipes_elderflower_and_lemon_58955", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour", "250g/9oz plain white flour", "40g/1½oz butter", "6g fine sea salt", "2 x 7g sachets instant yeast", "120ml/4fl oz full-fat milk", "2 large free-range eggs", "75ml/2½fl oz elderflower cordial ", "1 cap food-grade lemon oil", "250g/9oz strong white flour", "250g/9oz plain white flour", "40g/1½oz butter", "12 cardamom pods, crushed and seeds removed", "12 cloves", "6g fine sea salt", "2 x 7g sachets instant yeast", "½ tsp cinnamon", "60g/2¼oz golden caster sugar", "150ml/5fl oz full-fat milk", "2 large free-range eggs", "80g/3oz butter", "160g/5¾oz golden caster sugar", "3 lemons, zest and juice only", "2 large free-range eggs and 1 large free-range egg yolk ", "3 Braeburn apples, peeled, cored and finely chopped", "80g/3oz frozen cranberries, defrosted", "1 lemon, juice only", "150g/5½oz jam sugar", "150g/5½oz icing sugar", "2 tbsp elderflower cordial ", "150g/5½oz icing sugar", "1 tsp vanilla paste", "1 tsp cinnamon", "1 tsp lemon juice", "2 tsp orange juice", "600ml/20fl oz double cream", "40g/1½oz icing sugar"], "serves": "Makes 24 iced finger buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the elderflower dough, put both flours in the bowl of a freestanding mixer fitted with a dough hook.  Rub in the butter using your fingertips then add the salt to one side of the bowl and the yeast to the other.", "Warm the milk to about 40C (if you don’t have a kitchen thermometer, gently heat the milk until warm to the touch).", "Add the eggs, warm milk, cordial and lemon oil to the bowl and mix slowly for a few minutes to combine. Increase the speed and mix for a few more minutes. Transfer to a large bowl and cover with cling film. Prove in a warm place for 1 hour, or until doubled in size.", "For the spice bun dough, put both flours in the bowl of a freestanding mixer fitted with a dough hook.  Rub in the butter using your fingertips.", "Remove the seeds from the cardamom pods and take the heads off the cloves. Grind until fine in a pestle and mortar. Add to the flour mixture along with the salt, yeast, cinnamon and sugar.", "Warm the milk to about 40C (if you don’t have a kitchen thermometer, gently heat the milk until warm to the touch). Add 3 tablespoons water and mix.", "Add the eggs and warm milk to the bowl and mix slowly for a few minutes to combine. Increase the speed and mix for a few more minutes. Transfer to a large bowl and cover with cling film. Prove in a warm place for 1 hour, or until doubled in size.", "To make the lemon curd, put the butter, caster sugar, lemon juice and zest in a heatproof bowl and warm in the microwave until the butter has melted (alternatively put the bowl over a pan of simmering water). Beat the eggs and egg yolk into the lemon mixture. Place over pan of simmering water and stir until thick. Pass through a sieve and leave to cool.", "To make the apple and cranberry jam, put a plate in the freezer. Add the apples, cranberries, lemon juice and sugar to a pan. Simmer for about 10–15 minutes until the apples are soft. Bring to a rolling boil for a few minutes. To check if the jam has reached setting point, place a blob on the frozen plate and leave to cool for a few minutes – if the jam is ready it will wrinkle when pushed with your finger. If it doesn’t wrinkle, cook for a few more minutes then test again. Once the setting point has been reached, transfer the jam to a blender and blitz until smooth. Leave to cool.", "Once the doughs have been proved, divide both doughs into 12 equal pieces. Lightly flour 4 baking trays and a work surface. Roll each piece of dough into a ball and then into a sausage shape. Place 6 fingers on each tray and leave to prove again for 30 minutes, or until doubled in size.", "Preheat the oven to 205C/185C Fan/Gas 6. ", "Bake the buns for 10–15 minutes, or until golden-brown. Remove from the trays and leave to cool. Once cool cut the buns in half lengthways.", "For the elderflower icing, combine the icing sugar and elderflower cordial in a bowl until a smooth, pourable consistency is achieved. ", "For the cinnamon icing, combine the icing sugar, vanilla paste, cinnamon and lemon juice in a bowl. Add enough orange juice to make a smooth icing. ", "To decorate, dunk the top halves of the elderflower and lemon buns in the elderflower icing. ", "Dunk the top halves of the spiced buns in the cinnamon icing.", "To fill the buns, whip the cream with the icing sugar until stiff peaks form when the whisk is removed. Transfer to a disposable piping bag.", "Spread the jam on half the buns and the lemon curd on the other half, then pipe the cream on top. Sandwich the buns together using the respective iced tops. Serve immediately."]}, {"isVegetarian": true, "title": "Elderflower cordial", "url": "www_bbc_co_uk_food_recipes_elderflower_cordial_21346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz caster sugar", "2 lemons", "about 25 heads elderflowers", "50g/1¾oz citric acid", "2 Campden tablets"], "serves": "Makes about 3-4 litres", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the sugar and 1.5 litre/3lb 5oz water into a large pan. Bring to the boil, stirring, until the sugar has dissolved. Remove from the heat and cool. ", "Slice the lemons thinly. Put into a large plastic box or a bucket.", "Add the elderflower heads to the lemons with the citric acid and the Campden tablets. (CAUTION: Campden tablets produce an irritant gas if inhaled. Keep your face well back from the mixture.) Pour over the cooled sugar syrup. Cover and leave overnight or up to a couple of days.", "Sieve and strain through muslin into sterilised bottles and store in the fridge. To serve, dilute to taste with still or sparkling water."]}, {"isVegetarian": false, "title": "Elderflower jelly with easy strawberry ice cream", "url": "www_bbc_co_uk_food_recipes_elderflower_jelly_with_16318", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strawberries, hulls removed", "300ml/10½fl oz extra-thick double cream", "½ vanilla pod, seeds scraped out with a sharp knife", "450ml/¾ pint sparkling elderflower pressé", "50g/2oz caster sugar", "5 gelatine sheets, soaked in cold water for 5 minutes", "1 peach, stone removed, flesh finely diced", "50g/2oz small fresh strawberries, cut into quarters", "small handful fresh basil leaves, preferably Greek basil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the strawberry ice cream, freeze the strawberry quarters in the freezer in a sealable food bag for at least 4 hours, but preferably overnight.", "Meanwhile, for the elderflower jelly, heat 100ml/3½fl oz of the elderflower pressé and all of the caster sugar in a saucepan over a medium heat until just simmering. Drain the soaked gelatine and add it to the elderflower mixture, stirring until dissolved.", "When the gelatine has dissolved, pour in the rest of the elderflower pressé and stir to combine.", "Pour the elderflower jelly mixture into a wide, shallow bowl or a lipped plate. Chill in the fridge until set, about 30 minutes.", "When the strawberries have frozen and the jelly is ready to serve, blend the strawberries in a food processor with the vanilla seeds and half of the cream for 3-4 minutes, or until the ice cream mixture is smooth and thick and the strawberries have started to freeze the cream.", "To serve, decorate the top of the jelly with the chopped peaches, chopped fresh strawberries and basil, then top with scoops of the strawberry ice cream. Serve immediately, with the remaining ice cream in bowls alongside."]}, {"isVegetarian": true, "title": "Elderflower vodka babas", "url": "www_bbc_co_uk_food_recipes_elderflower_vodka_babas_28481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5fl oz plain flour", "20g/¾oz caster sugar", "½ tsp sea salt flakes", "1 x 7g sachet easy-blend dried yeast", "½ orange, juice only", "3 large free-range eggs, lightly whisked", "75g/2½oz butter, softened and cut into cubes, plus extra for greasing", "100g/3½z raisins", "lemon zest, grated", "elderflower vodka, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour, sugar, salt into a bowl and mix thoroughly. Then stir in the yeast.", "Warm the orange juice slightly in a pan. ", "Gently stir the eggs into the flour mixture a little at a time, alternating with the warm orange juice and the butter. ", "Add the raisins and give it a good mix until it forms a smooth dough.  ", "Spoon the mixture into two greased bun tins, dariole moulds or 11cm/4½in baba tins (savarin moulds).  ", "Cover lightly with a tea towel and leave in a warm place for about an hour, or until doubled in size and lightly spongy.  ", "Preheat the oven to 180C/350F/Gas 4.", "Bake in the oven for 10-12 minutes until risen and golden-brown.  ", "Remove from the oven and leave to cool on a wire rack.  ", "To transport for a picnic, put into a preserve jar with some lemon zest and drizzle, to taste, with elderflower vodka."]}, {"isVegetarian": true, "title": "Elderflower cordial", "url": "www_bbc_co_uk_food_recipes_elderflowercordial_6465", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/elderflowercordial_6465_16x9.jpg", "ingredients": ["30 elderflower heads ", "1.7litres/3 pints boiling water ", "900g/2lb caster sugar ", "50g/2oz citric acid (available from chemists) ", "2 unwaxed oranges, sliced", "3 unwaxed lemons, sliced"], "serves": "Makes 1.5litres/2¾pints", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Gently rinse over the elderflowers to remove any dirt or little creatures. ", "Pour the boiling water over the sugar in a very large mixing bowl. Stir well and leave to cool. ", "Add the citric acid, the orange and lemon slices, and then the flowers. ", "Leave in a cool place for 24 hours, stirring occasionally. ", "Strain through some muslin and transfer to sterilised bottles."]}, {"isVegetarian": false, "title": "Elizabethan lamb stew", "url": "www_bbc_co_uk_food_recipes_elizabethanlambstew_83712", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 onions, finely chopped", "2 small red chillies, finely chopped", "½ garlic bulb, peeled and crushed", "5cm/2in piece ginger root, finely chopped", "2 tsp ground coriander", "1.5kg/3lb 5oz diced lamb (ask butcher for a mixture of shoulder and leg)", "100g/3½oz apricots, chopped", "100g/3½oz raisins", "½ bottle white wine", "½ pint chicken stock (or 2 chicken or vegetable stock cubes with ½ pint of water)", "1 tbsp honey", "1 tbsp cornflour", "handful chopped coriander", "couscous ", "mixed leaf salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. ", "Heat the olive oil in a casserole dish and cook the onions for a few minutes until softened, but not coloured.", "Stir in the chilli, garlic, ginger and ground coriander, and cook for a further minute.", "Add the lamb and cook until the meat is browned.", "Add the apricots, raisins, wine, stock and honey. Stir well and bring to the boil.  ", "Transfer to the oven and cook for 1½ hours - alternatively you can simmer it gently on the hob for 1½ hours. ", "Add a tablespoon of water to the cornflour to form a paste and stir this paste into the lamb. ", "Cook for a further couple of minutes to thicken, and stir in the chopped coriander. Serve with couscous and a green salad."]}, {"isVegetarian": false, "title": "Elizabethan pot-roast chicken with spiced plums and creamy leeks", "url": "www_bbc_co_uk_food_recipes_elizabethanpotroastc_81091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4½lb chicken, preferably free-range", "25g/1oz butter", "1 large onion, finely chopped", "115g/4oz raisins ", "225g/8oz firm plums, halved, stones removed", "6 juniper berries, lightly crushed", "1 tsp ground cinnamon", "1 tsp ground ginger", "pinch freshly grated nutmeg", "runny honey", "1 orange, juice only", "300ml/11fl oz chicken stock", "300ml/11fl oz red wine", "few sprigs fresh rosemary", "salt and freshly ground black pepper", "chicken juices from the pan ", "25g/1oz butter", "1 onion, finely chopped", "1 leek, chopped", "sprig thyme", "55ml/2fl oz single cream", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Brown the chicken all over in a non-stick frying pan. Set aside, but reserve the juices in the pan.", "Preheat the oven to 200C/400F/Gas 6. ", "Heat the butter, onion and raisins in an ovenproof saucepan big enough to hold the chicken, and cook until softened. Add the plums, juniper berries, cinnamon, ginger and nutmeg, and stir through. Drizzle in a little honey and pour in orange juice to taste. ", "Pour in the chicken stock and red wine. Simmer gently for a few minutes, then add a few sprigs of rosemary. Season liberally with salt and freshly ground black pepper. ", "Add the chicken to the pan, place in the preheated oven and cook for about 1½ hours, basting several times. The plums will stew down and create a sauce to go with the chicken. The chicken will be cooked when the juices from the thigh run clear when pierced with a skewer.", "Meanwhile, for the creamy leek dish, heat the reserved juices in the chicken pan and add the butter. Fry the onion and chopped leek, then add the thyme. Pour the single cream over the leeks and season well with salt and freshly ground black pepper. Heat through for a couple of minutes. Serve with the spicy plum chicken."]}, {"isVegetarian": true, "title": "Elderflower and lychee cheesecake", "url": "www_bbc_co_uk_food_recipes_elderflowerandlychee_91445", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz ginger biscuits, crushed ", "75g/2¾oz butter, melted ", "400ml/14fl oz elderflower pressé", "100g/3½oz caster sugar", "225g/8oz mascarpone", "1 vanilla pod, seeds scraped out using a knife", "50ml/1¾oz elderflower liqueur", "225ml/8fl oz whipping cream, whipped until soft peaks form when the whisk is removed", "200g/7oz canned lychees, drained, cut into quarters", "125g/4½oz lime marmalade", "50ml/2fl oz boiling water", "edible flowers, to garnish (optional)"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix together the crushed ginger biscuits and melted butter until well combined. Press this mixture into the bottom of each of six glass tumblers to form an even layer.", "Bring the elderflower pressé and sugar to the boil in a pan. Continue to boil until the volume of liquid has reduced by half. Set aside to cool for 5-10 minutes. ", "In a separate bowl, beat the mascarpone, vanilla seeds, cooled elderflower pressé mixture and elderflower liqueur together until well combined. Fold in the whipped cream until well combined, then fold in the lychees.", "Spoon the mixture into the tumblers.", "In a bowl, mix the lime marmalade with the boiling water until it has dissolved. Set aside to cool slightly, then spread over the surface of each cheesecake. ", "Chill the cheesecakes in the fridge for two hours. ", "To serve, place each tumbler onto a small serving plate. Decorate each cheesecake with edible flowers, if using."]}, {"isVegetarian": true, "title": "Emergency brownies", "url": "www_bbc_co_uk_food_recipes_emergency_brownies_43976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/emergency_brownies_43976_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "50g/1¾oz soft light brown sugar", "1 tbsp maple or golden syrup", "3 tbsp plain flour", "3 tbsp cocoa powder", "¼ tsp sea salt flakes", "1 large free-range egg", "1 tsp vanilla extract", "50g/1¾oz walnut pieces", "50g/1¾oz dark or milk chocolate chips "], "serves": "Makes 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. ", "Warm the butter, sugar and maple syrup in a small, heavy-based saucepan, stirring occasionally until the butter has melted and the sugar has dissolved. Remove from the heat. ", "Mix together the flour, cocoa and salt in a bowl, then beat into the melted butter with a wooden spoon until smooth.", "In a small bowl, whisk the egg with the vanilla then stir into the pan, ensuring everything is well combined. Fold in the nuts and chocolate chips. Pour and scrape the batter into the foil tin. Bake for 15–20 minutes, until it is beginning to come away at the sides and the top has dried a little just around the edges. ", "Transfer to a wire rack and leave to cool – but not completely. I leave them for 20–30 minutes (and that’s difficult enough). If your need is not so great, or you want them to go further, cut each square in half again. "]}, {"isVegetarian": true, "title": "English almond butter toffee", "url": "www_bbc_co_uk_food_recipes_english_almond_butter_49759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/english_almond_butter_49759_16x9.jpg", "ingredients": ["groundnut oil, for greasing", "400g/14oz flaked almonds ", "450g/1lb unsalted butter", "500g/1lb 2oz granulated sugar", "1 tsp vanilla extract", "200g/7oz milk chocolate, broken into small pieces"], "serves": "Makes 25 lumps of almond toffee", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a baking tin 42x27cm/17x11in and 4cm/1½in deep with groundnut oil. ", "Place the almonds on a second, clean baking tray and toast in the oven for 15 minutes, turning them over and around after five minutes and taking care not to singe the edges. Remove from the oven once golden-brown and set aside to cool.", "Place the butter in a deep, heavy-bottomed pan and melt it gently. Add the sugar and stir until it has dissolved. Place a sugar thermometer in the pan, bring the mixture to the boil and bubble on a medium heat until it reaches 120C/250F. This takes about five minutes. ", "Add three-quarters of the toasted almonds and the vanilla extract to the sugar and butter mixture and give it a couple of brisk stirs with a wooden spoon. Be careful as the mixture will bubble up a fair bit.", "Bring the mixture back to a rolling boil and, on a moderate heat, bubble slowly and steadily, stirring frequently, for around 15 minutes until the temperature reaches 150C/302F. Take care, as it will stay for a long time at 135C/275F and then quickly go up to 150C/300F. You need to catch it when this happens or it will start to burn.", "As soon as the temperature nudges 150C/300F, whip the pan off the heat and pour the golden-coloured mixture into the greased baking tin. Don’t worry if it looks a little oily. Leave to cool for one hour. ", "Place the small pieces of chocolate evenly over the top of the still-warm toffee and leave to melt. Spread out the chocolate with a palette knife.", "Roughly grind the remaining almonds in a food processor and scatter the crumbs over the melted chocolate. Leave to cool.", "To remove the toffee from the tin, take a flat screwdriver or toffee hammer and break it into chunks and store in the fridge."]}, {"isVegetarian": false, "title": "Chicken korma", "url": "www_bbc_co_uk_food_recipes_enams_chicken_korma_35055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 head garlic, cloves separated and peeled", "100g/3½oz fresh root ginger, peeled ", "3 tbsp vegetable oil", "5 tbsp ghee", "8 cardamom pods ", "4 bay leaves", "4 cinnamon sticks", "5 onions, finely chopped", "1 tbsp salt", "1 whole chicken, jointed, skin removed ", "steamed pilau rice, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the garlic, ginger, vegetable oil and 4 tablespoons water to a purée in a food processor.", "Heat the ghee in a heavy-based saucepan over a medium heat. Add the garlic and ginger purée and fry for 1-2 minutes, then add the cardamom pods, bay leaves and cinnamon sticks.", "Add the onions and fry for 4-5 minutes, or until slightly browned.", "Add the salt and 500ml/17fl oz water. Bring the mixture to the boil, then reduce the heat until it is simmering. Half-cover the pan with the lid and simmer for 12-15 minutes, or until the water has nearly evaporated.", "Stir the onion mixture, then add another 500ml/17fl oz water. Simmer, half-covered, as before, for 12-15 minutes.", "Repeat this process 5 more times - this draws all of the natural sweetness from the onions and helps break them down to sweet and silky sauce.", "Add the chicken pieces and cover with 250ml/9fl oz water. Bring the water to the boil, then reduce the temperature until it is simmering. Cover the pan with the lid and cook the chicken for 15-20 minutes, or until cooked through. (The chicken is cooked through if the juices run clear when the thickest part of the chicken is pierced with a skewer and no trace of pink remains.)", "Serve in bowls with steamed pilau rice."]}, {"isVegetarian": true, "title": "English apricot and almond bake", "url": "www_bbc_co_uk_food_recipes_english_apricot_and_84974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz ready-made sweet shortcrust pastry", "200g/7oz butter, softened, plus extra for greasing", "200g/7oz caster sugar", "3 large free-range eggs", "200g/7oz plain flour, plus extra for dusting", "125g/4½oz ground almonds", "½ tsp baking powder", "150g/5oz apricot jam, warmed until melted", "8 fresh apricots, stones removed, cut into quarters"], "serves": "Makes 10-15 pieces", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Grease a 30x23cm/12x9in cake tin with butter and line with baking paper. ", "Roll out the pastry onto a lightly floured work surface until it is slightly larger than the cake tin and 0.5cm/¼in thick. ", "Roll the pastry onto a rolling pin, then line the cake tin with the pastry, pressing it gently into the corners and trimming away any excess. Chill in the fridge while you make the filling.", "Beat the butter and sugar in a large bowl for 5 minutes, until pale, fluffy and well combined. Alternatively, use a free-standing food mixer to do this. ", "Beat in the eggs one at a time, waiting until each has been incorporated into the mixture before adding the next.", "Fold in the flour, ground almonds and baking powder.", "Brush the pastry with the warmed apricot jam, then spoon in the filling mixture and smooth the top with a palette knife. Decorate the top of the filling with the apricot halves.", "Bake the tart in the oven for 30-35 minutes, until the filling has risen and is golden-brown, and a skewer inserted into the centre comes out clean (if it doesn’t, return the bake to the oven for a further 5 minutes). Set aside to cool, in the tin, on a wire rack, then remove from the tin and cut into rectangles to serve."]}, {"isVegetarian": true, "title": "English muffins", "url": "www_bbc_co_uk_food_recipes_english_muffins_56640", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/english_muffins_56640_16x9.jpg", "ingredients": ["300g/10½ oz strong white bread flour, plus extra for flouring", "6g fast-action yeast ", "6g salt", "15g/½oz caster sugar", "15g/½oz softened butter, cut into small pieces", "1 medium free-range egg (about 22g/¾oz), lightly beaten", "170ml/6fl oz milk (should make a soft dough – you can add up to about 30ml/1floz extra if needed)", "oil, for greasing ", "15g/½oz semolina or polenta, plus extra for dusting"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the flour into a large mixing bowl.  Sprinkle the yeast on one side of the flour and the salt into the other side of the flour. Add the sugar, butter, egg and milk, then mix all the ingredients together to form a soft dough.", "Turn the mixture out of the bowl onto a lightly floured surface and knead for 10 minutes, or until soft, smooth and stretchy.", "Lightly grease a large bowl with oil. Place the dough in the oiled bowl, cover and leave to prove for about one hour, or until doubled in size.", "Dust the work surface with a mixture of the semolina/polenta and flour. Tip the dough out onto the work surface and roll out to about 2.5cm thick.  ", "Lightly dust two baking trays with half of the semolina or polenta. ", "Using a 9cm/3½oz straight-sided cutter, cut out eight muffins. Place four muffins, evenly spaced apart on each of the dusted baking trays.  Dust the remaining semolina or polenta over the top of the muffins. ", "Leave to prove for another 30 minutes.", "Preheat the hot plate or a heavy-based frying pan on the hob to a very low heat. Griddle the muffins for approximately 5-6 minutes, then flip over and griddle for another 5-6 minutes on the other side."]}, {"isVegetarian": false, "title": "English garden soup with prawns", "url": "www_bbc_co_uk_food_recipes_englishgardensoupwit_91687", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter ", "1 large banana shallot, peeled, finely chopped", "1 large garlic clove, peeled, finely chopped", "1 medium cucumber, peeled, cut in half lengthways, seeds scooped out using a teaspoon and discarded, flesh sliced into half-moons", "Large pinch freshly ground nutmeg", "Sea salt flakes and freshly ground white pepper", "220g/½lb fresh peas, pods removed (podded weight)", "200ml/7fl oz fresh chicken stock", "1 soft-leaved round lettuce, core removed, leaves separated, core and leaves chopped", "8 large sorrel leaves, chopped", "2 tbsp crème fraîche", "2 handfuls cooked North Atlantic prawns, to serve (optional)"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan over a low to medium heat. When the butter is foaming, add the chopped shallot and garlic and fry for 8-10 minutes, stirring regularly, or until softened but not coloured.", "Add the sliced cucumber and nutmeg and season, to taste, with salt and freshly ground white pepper. Stir well and continue to fry the mixture for 3-4 minutes, stirring occasionally, until soft and translucent.", "Add the peas and stock to the pan and bring the mixture to a simmer. Cover the pan with a lid and cook gently for 6-8 minutes, adding a little more stock as necessary to prevent the mixture from drying out, until the peas are tender. Remove the pan from the heat and set aside to cool slightly. ", "When the mixture has cooled, transfer it to a food processor and blend to a smooth purée. Set aside to cool further. ", "When the mixture has cooled, add the chopped lettuce leaves and stalk and the chopped sorrel and blend again until smooth. ", "Pass the mixture through a fine sieve into a large bowl. Whisk in the crème fraîche until well combined, then chill in the fridge until cold.", "To serve, ladle the English garden soup into shallow serving bowls. Garnish with the cooked prawns, if using."]}, {"isVegetarian": true, "title": "English parsley sauce", "url": "www_bbc_co_uk_food_recipes_englishparsleysauce_70006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15fl oz/425ml milk ", "a few parsley stalks ", "1 bay leaf ", "1 slice onion, ¼in/5mm thick ", "1 blade of mace ", "10 whole black peppercorns ", "¾oz/20g plain flour ", "1½oz/40g butter ", "4 heaped tbsp finely chopped fresh parsley ", "1 tbsp single cream ", "1 tsp lemon juice ", "salt and freshly milled black pepper"], "serves": "Makes 15fl oz/425ml", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the milk and the next five ingredients in a small pan, bring everything slowly up to simmering point, then pour the mixture into a bowl and leave aside to get completely cold. ", "When you're ready to make the sauce, strain the milk back into the pan, discard the flavourings, then add the flour and butter and bring everything gradually up to simmering point, whisking continuously with a balloon whisk until the sauce has thickened and is smooth and glossy. Then turn the heat down to its lowest possible setting and let the sauce cook gently forminutes, stirring from time to time. ", "To serve the sauce, add the chopped parsley, cream and lemon juice, taste and season, then serve in a warm jug."]}, {"isVegetarian": false, "title": "Chargrilled chicken strips with potatoes, sweet and sour roast tomatoes and tomato ketchup vinaigrette", "url": "www_bbc_co_uk_food_recipes_escalopechickenwitht_89354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, skin removed, cut into slices", "1 tbsp olive oil", "salt and freshly ground black pepper", "25g/1oz butter", "1 potato, peeled and sliced", "salt and freshly ground black pepper", "2 vine tomatoes, cut in half", "1 tbsp flour", "2 tbsp olive oil", "1 tsp caster sugar", "1 tbsp balsamic vinegar", "2 tbsp white wine vinegar", "3 tbsp tomato ketchup", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh basil", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, rub the oil into the meat and season well with salt and freshly ground black pepper.", "Heat a small amount of oil in a griddle pan over a high heat. Add the chicken and fry for 2-3 minutes to brown it, then transfer to the oven for 6-7 minutes to cook the chicken through.", "For the potatoes, melt the butter in a small, ovenproof frying pan, then remove from the heat. ", "Add the potato slices to the pan one by one to form a layer. Season well with salt and freshly ground black pepper, and transfer to the oven for 7-8 minutes. ", "Remove the pan from the oven and turn the potato slices over, then return the pan to the oven and cook the potatoes for a further 5-7 minutes, or until cooked through.", "For the sweet and sour roast tomatoes, press the flat sides of the tomato halves onto a floured work surface so that they are coated with flour.", "Heat the oil in an ovenproof saucepan over a medium heat, add the tomatoes, flat sides down, and fry for 3-4 minutes.", "Sprinkle the tomatoes with the sugar and balsamic vinegar, then place the pan into the oven to roast for 6-8 minutes.", "For the ketchup vinaigrette, heat the wine vinegar and ketchup in a separate saucepan over a medium heat for 5-6 minutes. Stir in the chopped fresh herbs and remove from the heat. ", "To serve, place the chicken strips onto a plate with the potatoes and tomatoes, and drizzle with the vinaigrette."]}, {"isVegetarian": false, "title": "Escalope of chicken with rocket, sage and lemon", "url": "www_bbc_co_uk_food_recipes_escalopeofchickenwit_92046", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/escalopeofchickenwit_92046_16x9.jpg", "ingredients": ["4 boneless chicken breasts, skin removed", "10-12 fresh sage leaves, finely chopped", "12 black peppercorns, crushed", "8 tbsp plain flour", "2 free-range eggs, beaten", "150ml/5fl oz milk", "250g/9oz fresh breadcrumbs", "180g/6¼oz unsalted butter", "½ lemon, juice only", "olive oil, for drizzling", "splash balsamic vinegar", "100g/3½oz wild rocket leaves ", "80g/3oz freshly grated parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken escalopes, sandwich each chicken breast between two sheets of cling film. Using a rolling pin, flatten each chicken breast until it has widened and become thinner (this is called an escalope). Remove and discard the cling film. Season the chicken escalopes with the chopped sage and black pepper.", "Tip the flour into a bowl. Beat the eggs and milk together in a separate bowl. Sprinkle the breadcrumbs onto a plate.", "Dredge each chicken escalope in the flour and shake off any excess. Dip each floured escalope in the egg and milk mixture, then dredge it in the breadcrumbs until completely coated. ", "Heat half of the butter in a frying pan over a medium to high heat. Add two of the breaded chicken escalopes, in batches, and fry for 4-6 minutes on each side, or until the breadcrumbs are crisp and golden-brown and the chicken is cooked through (the juices will run clear when the chicken is pierced in the thickest part with a skewer). Remove the breaded escalopes from the pan and keep warm.", "Repeat the process with most of the remaining butter and the remaining two chicken escalopes. (Reserve a little of the remaining butter.)", "Heat the remaining butter in the frying pan over a medium heat. When the butter has turned a pale golden-brown, squeeze in the lemon juice and stir to combine. Remove from the heat.", "For the salad, in a large bowl, mix together the olive oil and balsamic vinegar, to taste, until well combined. Add the rocket leaves and mix well to coat the leaves in the dressing.", "To serve, place one chicken escalope into the centre of each of four serving plates. Pour a little of the lemon butter over each escalope. Pile the dressed rocket leaves alongside and sprinkle over the parmesan."]}, {"isVegetarian": false, "title": "Escovitch fish", "url": "www_bbc_co_uk_food_recipes_escovitch_fish_40233", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red snapper, gutted and scaled with head and tail left on", "1 tsp allspice seeds, ground to a fine powder", "260ml/9½fl oz vegetable oil, for frying", "300ml/10fl oz malt vinegar ", "1 large onion, thinly sliced into half moons ", "¼ Scotch bonnet chilli", "3 peppers (1 red, 1 yellow and 1 green), sliced into 1cm/½in thick strips ", "1 large cho cho (available from Caribbean shops), sliced and heart removed ", "bunch of fresh thyme, leaves picked ", "3 spring onions, sliced", "pinch of freshly ground black peppercorns ", "3 medium carrots, peeled into ribbons using a vegetable peeler"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Make 2 deep slashes into each side of the fish. Sprinkle a few pinches of ground allspice all over the fish, rubbing it into the cuts and the cavity of the fish. ", "Heat the vegetable oil in a large frying pan, until very hot. Gently lower the fish into the pan and leave to fry on one side for 7-10 minutes, until the snapper is golden brown and crisp. Turn the fish and cook on the other side, gently moving it around to ensure even cooking. Baste with the hot oil. Turn again and baste if necessary. Once cooked, carefuly lift out of the pan and leave to drain on a plate lined with kitchen paper. Leave to rest while you prepare the escovitch.", "Pour the vinegar into a large saucepan. Add the onion, chilli, peppers, cho cho, thyme, spring onions, a pinch of ground allspice and black pepper. ", "Turn the heat to high, place a lid on the pan and steam for 10-15 minutes. Once the vegetables have begun to soften, turn off the heat, add the carrot ribbons and let the heat of the vegetables cook the ribbons for a further 5 minutes. ", "Put some of the vegetables in the bottom of a large serving dish, place the fish on top and then put more vegetables on top of the fish and pour over some, but not all, of the juice from the pan. Can be eaten hot or cold. "]}, {"isVegetarian": false, "title": "Espresso martini tiramisu", "url": "www_bbc_co_uk_food_recipes_espresso_martini_85728", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/espresso_martini_85728_16x9.jpg", "ingredients": ["4 free-range eggs, separated", "1 tsp vanilla extract", "125g/4½oz caster sugar", "pinch salt", "115g/4oz plain flour", "1 tbsp instant espresso coffee powder", "400ml/14fl oz double cream", "250g/9oz mascarpone", "4 tbsp vodka", "4 tbsp coffee liqueur", "60g/2oz amaretti biscuits", "20g/¾oz cocoa powder"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5 and line three 18cm/7in cake tins with greaseproof paper. ", "In a large bowl, whisk the egg yolks, vanilla and half the sugar together for 5 minutes, or until very pale. ", "In a large, glass bowl, whisk the egg whites using an electric whisk, slowly adding the remaining sugar and the salt until they hold soft peaks. Gently fold the whites into the yolks. Sift and fold in the flour.", "Fill the tins equally with the mixture and bake for 15 minutes, or until firm to the touch and golden-brown. ", "Carefully remove the cakes from their tins, discard the paper and leave to cool on a wire rack. ", "Mix the espresso powder with 200ml/7fl oz boiling water, leave to cool, then brush both sides of the sponge with the coffee.", "In a medium bowl, using a handheld whisk, mix a little of the cream with the mascarpone until smooth. Add the remaining cream, vodka and coffee liqueur, whisking until slightly stiffened. ", "Place the amaretti biscuits with half the cocoa powder in a food processor and blend to make a crumb.", "To serve, place a layer of sponge in an 18cm/7in glass trifle bowl, spread with a half the cream mixture and top with half the amaretti-cocoa crumbs. Repeat this process with a second layer of sponge, cream and crumbs. Finish with the final sponge and a dusting of cocoa powder."]}, {"isVegetarian": true, "title": "Espresso and ice cream (affogato)", "url": "www_bbc_co_uk_food_recipes_espressoandicecreama_72309", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vanilla or chocolate ice cream", "espresso or strong-brewed coffee"], "serves": "Serves as desired", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ice cream in serving bowls.", "Pour the coffee over the ice cream and serve."]}, {"isVegetarian": true, "title": "Ensaïmadas", "url": "www_bbc_co_uk_food_recipes_ensaimadas_22045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain flour, plus extra for flouring", "150g/5½oz caster sugar", "2 tsp yeast", "pinch salt", "200ml/7fl oz warm milk ", "2 free-range eggs, beaten", "oil, for greasing", "icing sugar, to serve", "100g/3½oz caster sugar", "100g/3½oz softened butter", "100g/3½oz ground almonds", "few drops almond extract", "few drops orange blossom water (optional)"], "serves": "Makes 16", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the bread dough. Put the flour, caster sugar and yeast into the bowl of a stand mixer with a pinch of salt. Mix to combine.", "Heat the milk in a pan until just tepid, then mix with the eggs in a jug. With the motor running, gradually add the milk and eggs until you have a tacky, smooth dough. Knead with the dough hook until the dough is no longer sticky, but soft and smooth. ", "Transfer to an oiled bowl and cover with a damp cloth until it has risen, this should take a couple of hours. ", "Alternatively, make by hand, turn out the dough onto a lightly floured surface and knead until it is smooth.", "For the almond filling, beat the sugar and butter together until soft and fluffy, then add the almonds, almond extract and orange blossom water (if using).", "Transfer the dough to a lightly floured work surface and divide into 16 pieces. Keep the pieces covered with a damp tea towel until you need to use them. ", "Roll each piece of dough into a ball, then roll out to a round of between 15–20cm/6–8in in diameter. Spread with a dessertspoon of the filling mixture and spread it out, leaving a small border all the way round. Roll up tightly, then roll or massage into a long sausage, about 25cm/10in long. ", "Roll up into a coil, like a snail shell, tucking the outside end underneath. Make sure you do this quite loosely, otherwise the middle coils will not have enough space to spread and will push upwards.", "Repeat and arrange over two baking trays and cover with a damp tea towel to prove for another hour or so until doubled in size again. ", "Preheat the oven to 180C/160C Fan/Gas 4. Bake for around 12 minutes until lightly golden and cooked through.", "Leave to cool then sprinkle with icing sugar."]}, {"isVegetarian": true, "title": "Espresso crème brûlée", "url": "www_bbc_co_uk_food_recipes_espressocremebrle_68024", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55ml/2fl oz milk", "450ml double cream", "½ vanilla pod", "1 egg", "4 egg yolks", "55g/2oz caster sugar", "85g/3oz mascarpone cheese", "3 tsp instant coffee", "demerera sugar for caramelising"], "serves": "Makes 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the milk, coffee, cream and vanilla to a near boil. ", "In a separate bowl, whisk the egg, yolks, sugar and cheese together.", "Once the milk is near boiling point pour over the egg mixture, mix well, and strain through a colander and back into the pan. Put the mixture back on the heat and whisk constantly until it begins to thicken.", "Pour the mixture into martini glasses or brulée dishes and allow to set in the fridge for 3-4 hours.", "Once set, sprinkle the top of the brulée with sugar and place under a grill for 2 minutes or use a gas burner to colour the sugar and create the brulée topping."]}, {"isVegetarian": true, "title": "Espresso prunes", "url": "www_bbc_co_uk_food_recipes_espressoprunes_13913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp ground espresso coffee", "300g/10½oz sugar", "2 tbsp brandy", "450g/1lb large prunes, dried and pitted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Dissolve the coffee in 125ml/4fl oz boiling water, then strain.", "Add the sugar, brandy and 500ml/17fl oz water and bring to the boil, stirring.", "Add the prunes, bring to the boil and cook at quite a fast simmer for 30-45 minutes until the liquid is thick and syrupy. Serve."]}, {"isVegetarian": false, "title": "Estonian lamb shanks", "url": "www_bbc_co_uk_food_recipes_estonian_lamb_shanks_37085", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/estonian_lamb_shanks_37085_16x9.jpg", "ingredients": ["4 small lamb shanks", "2 tbsp plain flour", "2 tbsp vegetable oil", "2 small onions, finely chopped", "1 tbsp juniper berries, lightly crushed", "2 unwaxed lemons, zest only", "strip of orange zest", "4 bay leaves", "small bunch of parsley", "2 large potatoes, diced", "4 carrots, cut into 1cm/½in slices on the diagonal\t", "800ml/1½ pint  lamb or chicken stock", "1 orange, juice only", "2 tbsp soured cream", "salt and freshly ground black pepper", "400g/14oz ready-made gnocchi, cooked according to packet instructions (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Put the lamb shanks in a large bag and add the flour. Close and shake, so the flour completely coats the lamb.", "Heat 1 tablespoon of the oil in a large, heavy-bottomed frying pan. Sear the lamb shanks on all sides until well browned and slightly crisp. ", "Meanwhile heat the remaining oil in a large lidded casserole, add the onions and sauté for several minutes until soft. Add the juniper berries, lemon and orange zests, bay leaves and 2 large sprigs of parsley. Stir for a minute or two, then add the lamb shanks, on their sides if possible. Add the potatoes and carrots.", "De-glaze the frying pan used to brown the lamb with a little stock and add to the casserole dish, then pour in the remaining stock and bring to the boil. Add the orange juice and season with salt and pepper. Cover and transfer to the oven. Cook for an hour and half, then remove the lid and cook for a further 30 minutes. ", "Return the casserole to the hob and remove the lamb shanks, parsley sprigs and bay leaves. Add the sour cream and stir until well combined. Finely chop the leaves from the remaining parsley and stir in. Return the shanks to the casserole and serve with the gnocchi."]}, {"isVegetarian": true, "title": "Lighter Eton mess", "url": "www_bbc_co_uk_food_recipes_eton_mess_57705", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eton_mess_57705_16x9.jpg", "ingredients": ["4 meringue nests", "300g/10½oz strawberries, halved ", "300ml/10fl oz plain yoghurt "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pop the meringue nests into a freezer bag and scrunch them up until broken into pieces. ", "Mash half of the strawberries with the back of a fork until almost smooth.", "Layer the ingredients into serving glasses. Start with some strawberries, along with a spoonful of their juices. Mix half of the crushed meringues through the yoghurt and add some of this.", "Top with a bit more fruit and some of the crushed meringues. Repeat until all the ingredients are used up and the glasses are full. Serve immediately."]}, {"isVegetarian": true, "title": "Eton mess cheesecake", "url": "www_bbc_co_uk_food_recipes_eton_mess_cheesecake_58338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eton_mess_cheesecake_58338_16x9.jpg", "ingredients": ["250g/9oz digestive biscuits, crushed ", "100g/3½oz  unsalted butter, melted, plus extra for greasing", "300ml/10fl oz double cream", "100g/3½oz icing sugar ", "1 tbsp vanilla bean paste", "600g/1lb 5oz full-fat cream cheese", "18g/¾oz freeze-dried strawberry pieces ", "200g/7oz strawberries, hulled ", "15g/½oz icing sugar", "1 tsp lemon juice ", "50g/1¾oz free-range egg whites ", "100g/3½oz caster sugar ", "red food colouring", "15 strawberries", "100g/3½oz white chocolate, broken into pieces", "10 dehydrated strawberry slices, dusted with gold lustre dust (optional) "], "serves": "Serves 10–12", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Grease a loose-bottomed 23cm/9in round cake tin and line with baking paper. ", "For the base, put the crushed biscuits into a bowl with the melted butter and mix together. The mixture should resemble wet sand. Pour into the cake tin and pack tightly using the back of a spoon, then cover and place in the fridge for 15 minutes. ", "Pour the cream into a large bowl, add the icing sugar and vanilla and whisk into soft peaks. Put the cream cheese into another bowl and stir to slacken. ", "Add the cream mixture and the freeze-dried strawberry pieces to the cream cheese and fold together gently. Spoon on to the chilled base and level off. Put the cheesecake back into the fridge. ", "For the strawberry sauce, put the strawberries, icing sugar and lemon juice into a food processor and pulse to a purée. Transfer to a bowl and put in the fridge. ", "To make the mini meringues, preheat the oven to 120C/100C Fan/Gas ½. Line a baking tray with baking paper. Fit a piping bag with a 1½cm/½in star-tip nozzle and turn inside out. Stand it in a tall glass or jug until you need it.", "Put the egg whites into a large clean, glass bowl and whisk with an electric whisk or stand mixer. After 2 minutes the mixture should be frothy and increased in volume. Start adding the sugar a little at a time. Once all the sugar is added, keep whisking until you have stiff peaks. ", "Using a brush and red food colouring, paint the inside of the piping bag with red stripes, starting with the tip and painting only as far as you will fill the bag. Fill the bag with the meringue mixture and pipe little kisses on to the tray. ", "Bake the meringues for 1 hour. Turn off the oven and leave the door open, and leave the meringues in the oven for another hour. Remove them from the oven and take them off the paper.", "For the white chocolate-dipped strawberries, gently melt the chocolate in a bowl over a pan of simmering water (do not let the bowl touch the water.) Using the same tray you made the meringues on, flip the paper over. Hold the strawberries by the stalk and dip them into the white chocolate to come three-quarters of the way up. Place on the tray to set – you can put them into the fridge to speed up the setting. ", "Take the cheesecake out of the fridge, remove from the tin and place on a serving board. Just before serving, pour over enough sauce to just cover the top – you may not need it all. Top with the dipped strawberries, meringues and lustred dehydrated strawberry slices. "]}, {"isVegetarian": true, "title": "Eton mess torte", "url": "www_bbc_co_uk_food_recipes_eton_mess_torte_15363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range egg whites", "400g/14oz white caster sugar", "400g/14oz strawberries, 300g/11oz roughly chopped, the rest whole", "2 tbsp icing sugar", "600ml/1pint 1fl oz double cream", "1 vanilla pod, split and seeds scraped out", "150g/5oz caster sugar", "2 tbsp water"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringue, preheat the oven to 100C/200F/Gas ¾. Line three baking trays with greaseproof paper.", "Whisk the egg whites in a bowl until soft peaks are formed when the whisk is removed.", "Gradually whisk in the sugar until stiff and glossy.", "Spoon into a piping bag fitted with a small plain nozzle.", "Draw three 23cm/9in circles on the greaseproof paper, then divide the remaining meringue between the circles and spread the mixture out until the circles are filled.", "Bake in the oven for 20 minutes, then turn the oven off and leave the meringues in the oven for at least 2 hours, or until crisp. Remove from the oven and set aside to cool.", "For the filling, blend 150g/5½oz of the chopped strawberries with the icing sugar in a food processor and pass through a sieve into a bowl.", "Whip the double cream to soft peaks then fold in the vanilla seeds and strawberry purée. Fold in the remaining chopped strawberries.", "Heat a frying pan until hot, add the caster sugar and water and heat until the sugar turns a deep caramel colour. Place the base of the pan into a pan of cold water to stop the caramel from cooking on any more.", "Carefully dip the whole strawberries into the caramel and place onto a plate. (Caution: the caramel will be very hot.)", "To assemble the torte, place a meringue circle onto a serving plate. Spoon on some of the cream mixture and spread it out to cover the meringue. Repeat with another meringue dish and layer of cream, finishing with the remaining meringue circle. Drizzle the remaining liquid caramel over the top of the meringue and decorate with the caramel-dipped strawberries."]}, {"isVegetarian": true, "title": "Eton mess with passionfruit", "url": "www_bbc_co_uk_food_recipes_etonmess_89422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz ripe strawberries, hulled", "splash kirsch", "1-2 tbsp icing sugar, to taste", "200ml/7fl oz double cream", "200ml/7fl oz crème fraîche or thick Greek-style yoghurt", "6 ready-made meringue shells", "2 passion fruit, pulp only"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Cut the larger strawberries into halves or quarters. ", "Set aside a quarter of the strawberries for garnish and place the rest into a large bowl.", "Add a splash of kirsch and 1-2 tablespoons of icing sugar to taste.", "Lightly mash the strawberries with a large fork or a potato masher. Cover with cling film and place into the fridge to chill for an hour. ", "Whip the cream lightly and fold in the crème fraîche or yoghurt.", "Using your hands, roughly crush the meringues into bite-sized pieces over the bowl of cream mixture, then gently fold through the mixture.", "Fold in the crushed strawberries and passion fruit pulp, to create a rippled effect. ", "Spoon the cream and meringue mixture into clear serving glasses and garnish with the reserved strawberries."]}, {"isVegetarian": true, "title": "Eton mess", "url": "www_bbc_co_uk_food_recipes_etonmess_87719", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 rhubarb stem, trimmed, peeled and finely chopped", "115g/4oz caster sugar", "1 vanilla pod, split in half", "4 tbsp double cream", "1 ready-made meringue nest, crushed", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rhubarb, caster sugar and vanilla pod into a small heavy-based pan over a low heat.", "Cook gently for 8-10 minutes, until the rhubarb is tender but still holding its shape.", "Transfer the rhubarb mixture to a bowl and leave to cool. Discard the vanilla pod.", "Meanwhile, whip the cream until soft peaks form when the whisk is removed, then carefully fold in the crushed meringue nest.", "To serve, spoon the cold rhubarb into a tall serving glass and top with the cream and meringue mixture. Dust with icing sugar and serve."]}, {"isVegetarian": true, "title": "Eton mess", "url": "www_bbc_co_uk_food_recipes_etonmess_67916", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/etonmess_67916_16x9.jpg", "ingredients": ["1 punnet strawberries", "a dash of sugar", "a dash of port", "meringues, broken up", "cream, softly whipped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mash the strawberries with a little sugar and port, and fold in broken meringues and softly whipped cream."]}, {"isVegetarian": true, "title": "Eton mess with berry coulis", "url": "www_bbc_co_uk_food_recipes_etonmesswithberrycou_83245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pt double cream, whipped until soft peaks form", "75g/2½oz cornflakes", "3 tbsp frozen mixed berries, defrosted", "sprig fresh mint", "100g/3½oz frozen mixed berries, defrosted", "1 lime, juice only", "1 tbsp icing sugar"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the whipped double cream, cornflakes and two tablespoons of the mixed berries into a large bowl and mix together well.", "Spoon half of the cream mixture into a tall glass.", "To make the coulis, place the mixed berries, lime juice and icing sugar into a small food processor and blend until smooth.", "Pass the berry mixture through a fine sieve.", "Spoon two tablespoons of the coulis over the cream mixture in the glass. ", "Spoon the rest of the cream mixture into the glass, then drizzle with another spoonful of coulis.", "To serve, decorate with the remaining one tablespoon of mixed berries and a sprig of mint."]}, {"isVegetarian": false, "title": "Coriander, chilli and cumin-crusted lamb served with spiced risotto and mint and chilli oil", "url": "www_bbc_co_uk_food_recipes_etuate_86970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ tsp coriander seeds", "¼ tsp cumin seeds", "¼ tsp coarsely ground black pepper", "¼ tsp chilli flakes", "1 orange, zest and juice", "1 slice bread", "1 lamb leg steak", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ onion, chopped", "1 tsp ground turmeric", "150g/5½oz basmati rice, washed and drained", "100ml/3½fl oz double cream", "small handful fresh coriander leaves, roughly chopped", "salt and freshly ground black pepper", "small bunch each fresh mint, coriander, flatleaf parsley and chives", "½ tsp chilli flakes", "3 tbsp olive oil ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the crusted lamb, place the spices, orange zest and bread into a food processor and pulse unti broken into crumbs. Add a squeeze of orange juice to bind if necessary.", "Rub the lamb with olive oil and season with salt and freshly ground black pepper.  ", "Heat an ovenproof frying pan and fry the lamb for two minutes on each side.", "Carefully press the breadcrumb mixture onto the top side of the lamb and transfer the pan to the oven for a further 4-6 minutes, or until cooked to your liking. Set aside to rest for five minutes.", "For the risotto, heat the olive oil in another non-stick frying pan and add the onion and turmeric. Sauté the onion until soft but not coloured.", "Add the basmati rice to the pan and fry for two minutes, stirring continuously.", "Add the double cream to the rice and gently bring to the boil, stirring regularly.", "Reduce the heat and simmer for 8-10 minutes, or until the rice is tender. ", "Stir in the fresh coriander and season with salt and freshly ground black pepper.", "For the mint and chilli oil, place all the ingredients into a small food processor and blend to combine.", "To serve, place the risotto onto a plate, top with the lamb and drizzle over the mint and chilli oil."]}, {"isVegetarian": true, "title": "European Christmas wreath", "url": "www_bbc_co_uk_food_recipes_european_christmas_86114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour", "50g/1¾oz caster sugar", "8g dried active yeast", "10g/¼oz salt", "¾ tsp mixed spice", "1 tsp (approx 12) green cardamom pods, lightly crushed, seeds removed and ground", "6 free-range eggs (should be 350g/12oz shelled weight)", "250g/9oz unsalted soft butter, cut into small cubes", "100g/3½oz sultanas", "2 tbsp orange flower water", "100g/3½oz chopped pistachios", "1 orange, zest only, grated ", "200g/7oz undyed marzipan, chopped into 1cm/½in squares ", "1 free-range egg, mixed with pinch salt for eggwash", "2 oranges, zest of both, juice of one  ", "1 lemon, juice only ", "pinch salt", "170g/6oz caster sugar", "85g/3oz unsalted butter", "3 free-range eggs, lightly beaten ", "1 tbsp orange liqueur", "1 orange, juice only", "300g/10½oz fondant icing sugar, plus extra for dusting", "toasted flaked almonds", "chopped pistachios", "edible gold stars (available online)", "ready rolled red and green fondant icing sugar to form berries and holly leaves (only small amount needed)"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Make the brioche dough the day before serving.  For the dough, put the flour, sugar, yeast, salt and spices into the mixing bowl of a stand mixer with the dough hook fitted.", "Add the eggs and knead on a low speed for five minutes.", "Scrape down the sides of the bowl, then knead at medium speed for 10 minutes. The dough will be smooth, elastic and well amalgamated.", "Start adding the butter to the dough a few pieces at a time, whilst mixing at low speed. When all the butter has been added, work the dough at a higher speed for 6-10 minutes until dough is smooth, shiny and elastic and comes away from the sides of the bowl.", "Cover the dough and leave in a cool place overnight (10-12C/50-54F is best).", "Soak the sultanas in the orange flower water, for the filling, and leave overnight also. ", "The next day, allow the dough to come back up to room temperature and finish proving. ", "Roll out the dough into a square and scatter over the soaked sultanas, pistachios, orange zest and marzipan. ", "Divide the dough into approximately 90g/3¼oz pieces and form into balls.", "Generously butter a 28cm/11in pie tin and four small brioche moulds.", "Place 11 balls in a circle in the pie dish, just slightly apart.", "Form the remaining dough into four brioche à tête by pressing with the edge of your hand into the ball two-thirds of the way across and ‘sawing’ the dough to make a small head. Lift the head to stretch it from the ‘body’, then press the head into the body. Place the shaped brioche into the buttered moulds. ", "Cover the dough and leave to prove for up to 2½ hours. ", "Preheat the oven to 190C/375F/Gas 5. ", "Brush the brioche with egg wash and bake the buns and wreath for 10 minutes at 190C/375F/Gas 5. Reduce the oven temperature to 180C/350F/Gas 4 and continue to bake the small brioche for five minutes more, until dark golden-brown, then remove from the oven. When the small brioche come out of the oven, cover the wreath with aluminium foil and continue to bake for 15-20 minutes more. Remove from the oven when dark golden-brown.", "Remove the brioche from the tins and cool on a wire rack.", "For the orange curd, heat the juices, zest, salt, sugar, butter and eggs in a heavy saucepan, or in a bain marie, over a low heat. Stir the mixture constantly until it thickens and coats the back of a spoon. ", "Sieve the orange curd and add the orange liqueur and leave in the fridge to firm up.", "When the orange curd has cooled, cut a cone out of the brioche à tête and place a small amount of curd into each brioche. Return the brioche tops and dust with icing sugar.   ", "Mix the orange juice with the icing sugar to make icing. Drizzle the orange icing over the wreath in a random pattern and sprinkle with the toasted flaked almonds, pistachios and decorate with edible gold stars and green and red icing decorations.", "Mix the orange juice with the icing sugar to make icing. Drizzle the orange icing over the wreath in a random pattern and sprinkle with the toasted flaked almonds, pistachios and decorate with edible gold stars and green and red icing decorations."]}]