[{"isVegetarian": true, "title": "Lemon and lime cheesecake", "url": "www_bbc_co_uk_food_recipes_lemon_and_lime_02564", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oat digestive-style biscuits", "20g/¾oz butter, melted", "½  lemon, juice only", "½ lime, juice only", "1  tbsp icing sugar", "125g/4½ oz mascarpone"], "serves": "Makes 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the biscuits in sandwich bag and use a rolling pin to gently bash them until small crumbs.", "Tip the crushed biscuits into a bowl and pour in the melted butter. Stir together until well combined, then spoon the crumbs into the bottom of two small glasses and press down firmly.", "Mix the lemon and lime juice, mascarpone and icing sugar together in a bowl until well combined.", "Divide the mixture between the two glasses and chill in the fridge for two hours."]}, {"isVegetarian": false, "title": "Lemon and lime chicken with coriander-fried rice", "url": "www_bbc_co_uk_food_recipes_lemon_and_lime_chicken_27815", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lime_chicken_27815_16x9.jpg", "ingredients": ["2 skinless chicken breasts", "2 tbsp sesame oil", "2 tsp vegetable oil", "2 tbsp soy sauce", "2 garlic cloves, finely chopped", "½ lemon, grated zest and juice", "salt and freshly ground black pepper", "1 tbsp clear honey", "2 tbsp groundnut oil", "2-3 tsp sesame oil", "2 free-range eggs, lightly beaten", "splash soy sauce", "2 spring onions, finely chopped", "50g/2oz fresh peas or frozen peas, defrosted", "150g/5oz long-grain rice, cooked according to packet instructions", "salt and freshly ground black pepper", "3-4 tbsp chopped coriander", "lime wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To butterfly the chicken breasts, lay them on a board and use a sharp knife to make a cut parallel to the chopping board three-quarters of the way through each breast. Open each chicken breast out so you have two large, thinner chicken breasts.", "Place them in a bowl with one tablespoon of the sesame oil, the vegetable oil, soy sauce, garlic and lemon zest and juice. Season with salt and freshly ground black pepper and mix to combine. In a separate bowl, mix the honey with the remaining sesame oil.", "Heat a griddle pan over a medium-high heat until smoking then lay the chicken on the griddle and cook for 2-3 minutes on each side, brushing it once or twice with the honey and sesame mixture. When it's done the chicken should be chargrilled on the outside and completely cooked through (the juices should run clear when a skewer is inserted into the thickest part of the chicken). Leave to rest for 2-3 minutes.", "Meanwhile, for the rice, heat a wok over a high heat then add the groundnut and one teaspoon of the sesame oil. When the oil starts to shimmer add the eggs and cook, stirring all the time, for 1-2 minutes or until they're scrambled. ", "Push the eggs to the side of the pan and add a little more sesame oil, the soy sauce, spring onions and peas and cook for one minute then add the rice and season with salt and freshly ground black pepper. Cook, stirring continuously, for 3-4 minutes, or until warmed through. Stir through the coriander.", "To serve, spoon the rice onto plates. Cut the chicken on the diagonal into thin strips and place on top of the rice. Top with a wedge of lime."]}, {"isVegetarian": true, "title": "Lemon and plum meringue roulade", "url": "www_bbc_co_uk_food_recipes_lemon_and_plum_meringue_51269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "5 free-range egg whites", "400g/14oz caster sugar", "2 sprigs lemon verbena, leaves only, plus extra sprigs to serve", "8 ripe plums, stones removed, cut into quarters", "500ml/18fl oz double cream", "225g/8oz good-quality ready-made lemon curd"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Grease a 35x25cm/14x10in Swiss roll tin with butter and line with silicone or baking paper.", "Whisk the egg whites in a large clean mixing bowl using an electric whisk, or in the bowl of a free-standing food mixer. Set the whisk to a high speed and whisk until soft peaks form when the whisk is removed.", "Gradually add 275g/9¾oz of the caster sugar, whisking until all of the sugar has been incorporated and the mixture is smooth and glossy. You should hear the machine dropping down a gear as the mixture reaches the correct consistency, and it should resemble shaving foam.", "Spoon the meringue into the prepared tin and smooth into an even layer using a palette knife. Sprinkle over the lemon verbena leaves. ", "Bake for 7-8 minutes, or until golden-brown on top, then reduce the oven temperature to 170C/150C Fan/Gas 3 and bake for a further 8-10 minutes, or until crisp.", "Remove the meringue from the oven and turn it out of the tin onto a clean tea towel. Peel the paper from the base of the meringue and set aside to cool.", "Meanwhile, place the plums, 100g/3½oz of the sugar and 100ml/3½fl oz water into a saucepan and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 8-10 minutes, or until the plums have softened but still retain their shape. ", "Whisk the double cream in a large bowl until very soft peaks form when the whisk is removed. Gently whisk in the remaining sugar, then fold in the lemon curd.", "Spread the lemon cream mixture on top of the cooled meringue all the way to the edges, leaving a 1cm/½in gap along one of the long edges. Spoon three-quarters of the cooked plums over the top. ", "Starting at the long end with the border, roll up the meringue using the tea towel to help you. ", "Carefully roll the roulade off the tea towel and onto a serving platter. Spoon the remaining plums around the roulade and garnish with the lemon verbena sprigs."]}, {"isVegetarian": true, "title": "Lemon and mascarpone tart", "url": "www_bbc_co_uk_food_recipes_lemon_and_mascarpone_29573", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_mascarpone_29573_16x9.jpg", "ingredients": ["1 x 25cm/10in sweet shortcrust pastry tart shell, baked blind (you can use ready-made pastry)", "300g/10½oz mascarpone", "300g/10½oz caster sugar", "6 lemons, juice and zest", "6 free-range eggs, plus 6 free-range egg yolks", "175g/6oz caster sugar", "150ml/5½fl oz champagne", "200g/7oz fresh raspberries", "icing sugar", "raspberries", "whipped cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Beat the mascarpone, caster sugar, lemon juice and zest together in a bowl until very smooth. ", "Beat in the eggs and egg yolks until well combined. ", "Pour the mixture into the tart shell and bake in the oven for 45-60 minutes, or until set.  Remove the tart from the oven and set aside to cool, then leave to chill in the fridge. ", "For the sauce, bring the sugar and champagne to the boil in a saucepan, then reduce the heat and simmer for 10 minutes. Remove from the heat, then add the raspberries and set aside to cool completely.", "Blend the sauce in a blender until smooth, then pass through a sieve. ", "To serve, cut a slice of the tart, sprinkle over some icing sugar and caramelise with a cook’s blowtorch (optional).", "Place the slice onto a serving plate and drizzle over a little sauce. Top with the raspberries and whipped cream."]}, {"isVegetarian": true, "title": "Lemon and pomegranate couscous", "url": "www_bbc_co_uk_food_recipes_lemon_and_pomegranate_48177", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_pomegranate_48177_16x9.jpg", "ingredients": ["1 large or 2 small pomegranates", "200g/7oz couscous", "250ml/9fl oz pints boiling chicken stock or water", "sea salt and freshly ground black pepper", "2 lemons, juice only", "6 tbsp olive oil", "4 tbsp chopped, fresh mint or coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pomegranates in half and scoop out the seeds using a teaspoon and remove the white membrane around the seeds.", "Place the couscous in a bowl. Pour the boiling stock or water onto the couscous and and mix in the olive oil and lemon juice. Season with sea salt and freshly ground black pepper.  ", "Cover tightly with clingfilm and allow the couscous to sit in a warm place for 5-10 minutes, or until the liquid has been absorbed.  Remove the clingfilm and fluff the grains with a fork. Allow the couscous to cool completely.", "Stir the chopped herbs and pomegranate seeds into the couscous. Add more olive oil, salt, pepper and herbs to taste."]}, {"isVegetarian": true, "title": "Lemon and poppy seed drizzle cake", "url": "www_bbc_co_uk_food_recipes_lemon_and_poppy_seed_63235", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppy_seed_63235_16x9.jpg", "ingredients": ["vegetable oil or cake release spray, for greasing the tin", "250g/9oz self-raising flour", "2 tsp baking powder", "250g/9oz butter, softened", "250g/9oz caster sugar", "50g/1¾oz ground almonds", "4 large free-range eggs", "4 unwaxed lemons, zest only (juice reserved for the drizzle)", "3 tbsp poppy seeds", "a little boiling water, to slacken the mixture if necessary", "8 tbsp lemon juice (from above)", "8 tbsp caster sugar", "2 tbsp limoncello (alternatively use lemon juice) ", "1 unwaxed lemon, thinly sliced and pips removed", "4-5 tbsp caster sugar ", "4 tbsp flaked almonds", "1 tbsp poppy seeds", "125g/4½oz icing sugar", "1 tbsp limoncello (alternatively use lemon juice)", "1 unwaxed lemon, juice only"], "serves": "Makes 1 x 25cm/10in ring-shaped cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease a 25cm/10in non-stick, fluted ring cake tin with cake release spray or vegetable oil.", "Sift the flour and baking powder into a large bowl. Add the rest of the ingredients (except the water) and whisk until smooth using an electric hand mixer. Add about 100ml/3½fl oz hot water from the kettle to slacken the mixture to a soft dropping consistency, if necessary. Pour into the prepared tin and bake for about 35 minutes, or until the cake starts to come away from the sides. To check the cake is ready insert a skewer, if it comes out clean the cake is cooked.", "Meanwhile, make the drizzle. Put the lemon juice and sugar in a small saucepan and heat gently until the sugar is dissolved. Increase the heat a little and let it boil for about a minute, or until thickened and syrupy. Add the limoncello, boil for another minute and set aside.", "For the decoration, add the lemon slices to the drizzle syrup. Reheat the syrup and simmer for 1-2 minutes or until the lemon slices have softened.  Turn off the heat and, using tongs, carefully transfer the lemon slices to a plate lined with greaseproof paper. Leave to cool and reserve any leftover syrup.", "When cool enough to handle, make a cut from the centre of the lemon slices to the skin and twist the ends in the opposite direction (so they resemble a bow). Repeat with all the slices, sprinkle with caster sugar and place on a baking tray lined with non-stick paper. ", "When the cake is cooked, reduce the oven temperature to 100C/80C Fan/Gas ¼. ", "Leave the cake in the tin while you apply the drizzle. Make holes using a skewer and brush or spoon about a third of the drizzle over the cake. Allow to cool for 5 minutes then turn the cake out onto a wire rack. Make some more holes in the top of the cake (these will be covered with icing later) and brush or spoon the rest of the syrup over the whole cake. Allow to cool completely. When the cake is cool, transfer it to a serving plate or cake board.", "Meanwhile, put the lemon twists in the oven to dry out for 30 minutes to 1 hour, until they are chewy (rather than crisp).  ", "Toast the flaked almonds in a dry frying pan until golden-brown, then set aside to cool.", "For the icing, mix the icing sugar, limoncello and a little lemon juice until you have a thick icing. Drizzle it over the top of the cake, encouraging it to run down the sides a little. Decorate with the lemon twists, flaked almonds and poppy seeds."]}, {"isVegetarian": true, "title": "Lemon and ricotta tart", "url": "www_bbc_co_uk_food_recipes_lemon_and_ricotta_tart_44080", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_ricotta_tart_44080_16x9.jpg", "ingredients": ["1 x 400g/14oz ready-made puff pastry", "plain flour, for dusting", "1 lemon, finely grated zest only", "300g/10½oz ricotta cheese", "200g/7oz mascarpone cheese", "200g/7oz candied peel, roughly chopped", "125g/4½oz caster sugar", "6 free-range eggs, separated "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Roll the pastry out on a lightly floured work surface to a 3mm/⅛in thickness. Use the pastry to line a 25cm/10in pastry case. Cover with a damp cloth while you make the filling.", "In a large bowl, mix the ricotta, mascarpone and candied peel with 100g/3½oz of the sugar and five of the egg yolks until smooth and well combined. ", "Whisk the egg whites in another large, clean bowl until fluffy. Whisk in the remaining sugar and continue whisking until stiff peaks form when the whisk is removed.", "Using a large metal spoon, fold the whites into the ricotta mixture, then pour into the pastry-lined tart tin. ", "Beat the reserved egg yolk in a bowl. Fold in the overhanging pastry and brush with the egg yolk. Bake in the oven for 30 minutes, until the pastry is cooked through and the filling has a slight wobble in the centre.", "Set aside to cool for two hours, then sprinkle with lemon zest. "]}, {"isVegetarian": true, "title": "Lemon and poppyseed cheesecake", "url": "www_bbc_co_uk_food_recipes_lemon_and_poppyseed_09377", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppyseed_09377_16x9.jpg", "ingredients": ["175g/6oz ginger biscuits, crushed ", "150g/5oz butter, melted ", "1.2kg/2½lb full-fat ricotta", "150g/5oz caster sugar", "6 free-range eggs", "1 tsp vanilla extract", "250g/9oz lemon curd", "1 tbsp poppy seeds", "200g/7oz caster sugar", "150ml/5fl oz white wine", "250g/9oz raspberries, fresh or frozen ", "1 tbsp rose water", "double cream, to serve"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 175C/350F/Gas 4.", "Mix the ginger biscuits and melted butter in a bowl until well combined. Press into a 22cm/9in springform cake tin and chill in the fridge for 30 minutes. ", "For the topping, blend the ricotta, sugar, eggs and vanilla extract in a food processor until smooth.", "Spoon the mixture into a bowl then gently fold in the lemon curd and poppy seeds. Spoon this mixture into the cake tin on top of the chilled biscuit base.", "Cook the cheesecake in the oven for one hour, depending on your oven. The cheesecake is cooked when springy to the touch and just set in the middle. ", "For the syrup, place the sugar, 100ml/3½fl oz water and wine in a saucepan and bring gently to a simmer until all the sugar dissolves. Allow to boil for five minutes, or until thickened. ", "Add the raspberries and rose water to the syrup, remove the pan from the heat and set aside. Once cooled, blend the sauce in a food processor until smooth and then pass through a fine sieve. ", "Serve the cheesecake with the sauce and some double cream."]}, {"isVegetarian": true, "title": "Lemon and rhubarb tartlets", "url": "www_bbc_co_uk_food_recipes_lemon_and_rhubarb_94455", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salted butter, cold, chopped roughly", "200g/7oz plain flour", "80g/2¾oz icing sugar", "3 free-range eggs, 2 yolks only, 1 whole for egg wash", "50g/1¾oz rhubarb ", "4 lemons, zest and juice", "320g/11¼oz double cream", "350g/12oz caster sugar", "10 free-range eggs, 9 whole, 1 yolk only", "200g/7oz rhubarb, roughly chopped", "100g/3½oz caster sugar", "1 x 8g sachet pectin"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, rub the butter into the flour using your hands until it resembles breadcrumbs. Mix in the icing sugar, then add the two egg yolks and bring the mixture together into a dough. Wrap the pastry in cling film and chill in the fridge for 10 minutes. ", "Preheat the oven to 180C/350F/Gas 4.", "Remove the pastry from the fridge, and roll out to 2-3mm/1/8in thick. Line the tart tins and crimp the edges. Scrunch up pieces of parchment paper just larger than the tart tins, and lay them on top of the pastry. Fill with baking beans.", "Bake the tart cases for five minutes, then remove from the oven, and remove the parchment and baking beans. Lightly beat an egg in a bowl for the egg wash. Brush the tarts with egg wash. Bake again for another few minutes until cooked and golden-brown. Remove from the oven and set aside to cool completely. ", "Turn the oven down to 120C/250F/½ Gas. ", "For the filling, blend the 50g/1¾oz rhubarb in a food processor and squeeze the juice out. Combine this juice with all other filling ingredients and place in a heatproof bowl set over a pan of simmering water, and heat to 60C/140F (use a thermometer to measure this). ", "Remove from the heat and pour the filling into the cooled tart cases and then bake until the filling reaches 70C/158F on the thermometer (roughly 10 minutes).", "Remove the tarts from the oven and set aside to cool. ", "Make the rhubarb jam by combining the rhubarb, sugar and pectin in pan and bringing up to the boil. Heat to 107C/225F and then remove from the heat. Strain the jam through a sieve, and set aside to cool slightly. ", "Spoon a small amount of the jam on top of each tartlet, and serve. "]}, {"isVegetarian": false, "title": "Lemon and sage stuffed loin of pork with wilted spring greens and mashed potato", "url": "www_bbc_co_uk_food_recipes_lemon_and_sage_stuffed_91825", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter", "2 onions, finely diced", "200g/7oz pork mince", "1 bunch fresh sage, finely chopped", "175g/6oz fresh white breadcrumbs", "100g/3½oz suet", "1 lemon, zest", "1.5kg/3lb 5oz boneless loin of pork, butterflied", "salt and freshly ground black pepper", "500g/1lb 2oz Maris Piper potatoes", "125ml/4fl oz double cream", "125g/4½oz unsalted butter", "50g/1¾oz unsalted butter", "1 head spring greens, core removed and sliced", "200ml/7fl oz pork jus or gravy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the stuffed loin of pork, preheat the oven to 150C/300F/Gas 2.", "Heat a frying pan and add 25g/10z of the butter. Once hot, add the onion and cook for a couple of minutes. Allow the onion to cool.", "In large bowl, mix the cooled onion, pork mince, sage, breadcrumbs, suet and lemon zest.", "Lay the pork loin, flesh-side up, on a chopping board.", "With a sharp knife, make an incision in the eye of the loin half way down running parallel to the board, cutting almost all the way through. Open the loin up and repeat a few times, cutting so that the loin opens up and it is as flat as the belly part of the pork.", "Season with salt and black pepper, then spoon the stuffing onto the loin and spread out along the loin, then roll up into a large sausage.", "Secure with cook's string at 5-6 points along the loin and then transfer to a roasting tin.", "Rub the rest of the butter over the top of the pork and season with plenty of sea salt.", "Roast in the oven for five hours. The crackling should be crisp and the pork very tender.", "For the mash potato, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain.", "Press the potato through a potato ricer into a saucepan. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper.", "For the spring greens, heat the butter in a clean pan and add the spring greens with a little water and cook until wilted.", "To serve, carve the pork loin and place on a serving plate. Place the mash potato next to the loin and the wilted greens next to that. Pour over some of the pork jus or gravy."]}, {"isVegetarian": true, "title": "Lemon and strawberry roulade", "url": "www_bbc_co_uk_food_recipes_lemon_and_strawberry_26775", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_strawberry_26775_16x9.jpg", "ingredients": ["4 medium free-range eggs", "120g/4¼oz caster sugar", "100g/3½oz plain flour, sifted", "20g/¾oz unsalted butter, melted, plus extra for greasing", "190g/6½oz caster sugar", "4 unwaxed lemons, finely grated zest and juice ", "130g/4⅔oz unsalted butter", "1-2 tbsp cornflour", "3 large free-range eggs and 1 large free-range yolk, beaten", "600ml/20fl oz double cream", "30g/1oz icing sugar, plus extra for dusting", "150g/5½oz strawberries, 3 reserved for decoration, rest sliced", "50g/1¾oz white chocolate, chilled and grated ", "50g/1¾oz shelled pistachios, pulsed in a food processor to fine crumbs "], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Grease and line a 30x24cm/12x9½in Swiss roll tin with baking paper.", "For the roulade, place a large heatproof bowl over a pan of gently simmering water. Add the eggs and sugar to the bowl and, using an electric mixer, beat for 3–4 minutes, or until doubled in size. Take off the heat and continue to beat for another 4–5 minutes on a medium to high speed.", "Using a large metal spoon, fold in the flour in three batches making sure it is all incorporated. Fold in the melted butter in the same way.", "Gently pour the mixture into the prepared tin and spread evenly using a spatula. Bake for 10 minutes or until just firm and lightly golden-brown.", "Dust a large baking sheet with icing sugar and carefully turn the roulade out. Carefully peel away the baking paper used to line the tin. Starting at a short end, fold the edge of the paper over the cake. Roll the cake up into the paper. Allow the roulade to cool completely while rolled.", "For the filling, first make a curd. In a saucepan, heat the sugar, lemon juice, lemon zest and butter over a medium heat. Stir as the butter melts and when combined stir in the cornflour. Keep stirring, using a hand whisk, for another 2–3 minutes. Take off the heat and stir in the beaten eggs. Return to a low heat and keep stirring until the curd is thickened and leaves a trail on the surface when the whisk is removed (about 15–20 minutes). Leave to cool and set. ", "For the cream, beat the cream and icing sugar together until soft peaks form when the whisk is removed. Transfer to the fridge to chill.", "Once the roulade is cool, unroll it and spread with a generous layer of whipped cream (keep any remaining cream for the decoration). Top with a layer of curd and sliced strawberries. Tightly re-roll the roulade and place on a serving plate.", "Spread the remaining cream over the roulade and score with a fork. Scatter with grated white chocolate and pistachio crumbs and top with the strawberries. "]}, {"isVegetarian": false, "title": "Lemon and tarragon pulled pork with pitta breads and walnut mayonnaise", "url": "www_bbc_co_uk_food_recipes_lemon_and_tarragon_51274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salt", "150g/5½oz Demerara sugar", "2 fresh bay leaves", "3-4 sprigs thyme", "4 star anise", "2 lemons, peeled rind and juice only ", "1 skinless, boneless pork shoulder", "vegetable oil, for cooking", "100ml/3½fl oz white wine vinegar", "300ml/10½fl oz chicken stock", "150g/5½oz brown sugar ", "180ml/6fl oz white wine", "2 garlic cloves, grated", "100ml/3½fl oz honey", "4 fresh bay leaves, finely chopped", "4 tbsp chopped fresh tarragon", "2 large free-range egg yolks", "2 tbsp Dijon mustard", "2 tbsp white wine vinegar", "250ml/9fl oz vegetable oil", "5 tbsp walnut oil", "salt and cayenne pepper, to taste", "lemon juice, to taste", "100g/3½oz toasted walnuts, chopped", "1 carrot, grated", "¼ white cabbage, finely sliced", "1 onion, finely sliced", "wholemeal pitta breads, lightly toasted", "lettuce (optional)"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the lemon and tarragon pulled pork, in a saucepan heat 1 litre/1¾ pints water, the salt, Demerara sugar, bay leaves, thyme, star anise and the lemon rind. Boil until the salt and sugar have dissolved then remove from the heat and leave to cool.", "When the brine is cold, place the pork shoulder into a container and pour over the chilled brine. Cover and place into the fridge for 24 hours. ", "When ready to cook the pork, preheat the oven to 140C/275F/Gas 1.", "Remove the pork from the marinade, pat dry and place onto a sheet of aluminium foil. Drizzle with the oil and wrap the meat in the foil, sealing the edges to form a parcel. Place in a roasting tin and transfer to the oven to slow cook for at least four hours, or until the pork is very well done and tender.", "Remove from the oven and leave to cool, still wrapped, for 25-30 minutes.", "Meanwhile, in a large pan, combine the white wine vinegar, chicken stock, brown sugar, white wine, grated garlic, honey and bay leaves and bring to the boil. Turn the heat down to a low simmer.", "Open the wrapped pork and, using two forks, pull the pork apart, shredding it all up. Place the pork mix into the gently simmering stock and cook for 35-40 minutes, letting the stock reduce to a sticky glaze. ", "Meanwhile, for the walnut mayonnaise, place the egg yolks, mustard and white wine vinegar into a food processor and blend until smooth. Slowly add the vegetable oil in a thin, steady stream while the motor is still running. ", "When all the vegetable oil is combined, add the walnut oil with the motor running. Blend until the mayonnaise has emulsified then season with salt, cayenne pepper and lemon juice. Stir in the walnuts.", "For the coleslaw, mix together the carrot, cabbage and onion with a little mayonnaise.", "When ready to serve, season the pork with the lemon juice, tarragon, salt and pepper. ", "To serve, tear apart the pitta bread apart, put in a big blob of coleslaw, add the pulled pork and lettuce (if using)."]}, {"isVegetarian": true, "title": "Lemon and thyme cake", "url": "www_bbc_co_uk_food_recipes_lemon_and_thyme_cake_15394", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_cake_15394_16x9.jpg", "ingredients": ["200g/7oz butter", "200g/7oz golden caster sugar", "100g/3½oz plain flour", "1 tsp baking powder", "100g/3½oz ground almonds", "4 free-range eggs", "1 lemon, zest only", "1 tsp thyme leaves", "4 tbsp sugar", "2 large lemons, juice only", "½ tsp thyme leaves"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 160C/325F/Gas 3. Line a 900g/2lb loaf tin with baking parchment.", "Cream the butter with the sugar in a food mixer until pale and fluffy. In a separate bowl sift together the flour and baking powder then mix with the almonds.", "Lightly beat the eggs then fold them into the butter mixture in two or three sessions, beating them in thoroughly each time. If the mixture looks as if it is about to curdle, stir in some of the flour. ", "Grate the zest from the lemon and mix it with the thyme leaves. Pound the two together with a pestle, or some other heavy weight, and stir into the cake mixture. ", "Gradually mix in the flour, baking powder and almonds. ", "Spoon the cake mixture into the lined tin and bake for 45 minutes (if dividing the mixture into smaller tins reduce the time accordingly). ", "For the topping, dissolve the sugar in the juice of the lemons over a moderate heat and stir in the thyme leaves (a few flowers would be good here too). As the cake comes from the oven, spike the surface with a skewer and spoon over the syrup. ", "Leave to cool and serve in slices with thick yoghurt."]}, {"isVegetarian": false, "title": "Lemon and thyme pork schnitzel with potato salad", "url": "www_bbc_co_uk_food_recipes_lemon_and_thyme_pork_15402", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_pork_15402_16x9.jpg", "ingredients": ["400g/14oz new potatoes, scrubbed", "3 tbsp mayonnaise", "1 tbsp crème fraiche", "2 tbsp baby capers, drained", "50g/2oz baby gherkins, drained and sliced", "1 lemon, zest and 2 tsp juice", "salt and freshly ground black pepper", "1 tbsp chopped fresh flatleaf parsley", "2 x 180g/6oz pork loin steaks, fat trimmed", "salt and freshly ground black pepper", "1 large free-range egg", "2 tbsp plain flour", "75g/2½oz coarse dried white breadcrumbs, preferably Japanese panko breadcrumbs", "½ lemon, zest only, finely grated", "15g/½oz parmesan, finely grated", "1 heaped tbsp chopped fresh thyme leaves", "300ml/10½fl oz sunflower oil", "2 handfuls fresh watercress", "1-2 tsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato salad, half-fill a pan with salted water and bring to the boil. Add the potatoes and return to the boil. Cook for 15-18 minutes, or until just tender. Drain in a colander and then rinse under running water until cold.", "Mix the mayonnaise, crème fraiche, capers, gherkins and lemon juice in a large bowl until well combined.", "Cut each of the potatoes into four chunks and stir into the mayonnaise dressing with the lemon zest. Season, to taste, with salt and freshly ground black pepper. Sprinkle over the parsley.", "For the pork schnitzels, sandwich one of the pork loin steaks between two sheets of cling film. Flatten the steak using a rolling pin or meat mallet to an even thickness of 1cm/½in. Remove the cling film and cut the flattened steak in half lengthways. Season on both sides with salt and freshly ground black pepper. Repeat the process with the remaining pork loin steaks.", "Beat the egg in a bowl. Sprinkle the flour onto a plate. Mix the breadcrumbs, lemon zest, parmesan, thyme and a good pinch of salt in a shallow bowl until well combined.", "Dredge each piece of pork first into the flour, then dip it into the beaten egg, then dredge it in the breadcrumb mixture until completely coated. Repeat the process with the remaining pieces of pork.", "Heat the sunflower oil in a large frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Add two of the schnitzels to the pan and fry for 2-3 minutes on each side, or until the pork is cooked through and the coating is crisp and golden-brown. Remove from the pan using a pair of tongs and set aside to drain on a warmed plate lined with kitchen paper. Keep warm. Repeat the process with the remaining two pork schnitzels.", "To serve, divide the potato salad among four serving plates. Arrange a few watercress leaves alongside each portion and drizzle with a little olive oil. Lay one pork schnitzel alongside."]}, {"isVegetarian": true, "title": "Lemon drizzle cake", "url": "www_bbc_co_uk_food_recipes_lemon_cake_29430", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_cake_29430_16x9.jpg", "ingredients": ["5 free-range eggs", "300g/11oz caster sugar", "140ml/5fl oz double cream", "3 lemons, zest only", "1½ tbsp dark rum", "1 pinch salt", "80g/3oz unsalted butter, melted", "240g/8½oz plain flour", "½ tsp baking powder", "3 tbsp apricot jam, warmed in a small saucepan", "1 lemon, zest and juice", "150g/5oz icing sugar"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Lightly butter a 26cm x 9cm x 8cm/10in x 3½in x 3in loaf tin and line it with greaseproof paper.", "In a large mixing bowl, whisk together the eggs, sugar, cream, lemon zest, rum, salt and butter.", "Sift the flour and baking powder into a separate bowl then whisk it into the egg mixture until you have a smooth batter.", "Pour the batter into the prepared tin and bake in the oven for 50-60 minutes, turning halfway through cooking. The cake is cooked when a knife blade inserted into the middle comes out clean.", "Remove the cake from the tin, turn onto a cooling rack and leave to cool for 10 minutes. This will allow the steam to escape before you glaze the cake. Leave the oven turned on.", "Brush the cake with the warmed apricot glaze and leave for five minutes while you make the lemon glaze.", "For the lemon glaze, mix together the lemon juice, zest and icing sugar.", "Heat the mixture in a small pan, or in the microwave, until the sugar has dissolved and you have a syrup.", "Brush the lemon glaze all over the cake and leave for a few minutes to set.", "Place the glazed cake in the oven on a baking tray, turn off the heat and leave for 3-5 minutes to dry the glaze and turn it translucent.", "Remove the cake from the oven and leave to cool to room temperature before serving."]}, {"isVegetarian": true, "title": "Lemon cake served with a goats’ cheese cream, lemon curd, sugared almonds and roasted rhubarb", "url": "www_bbc_co_uk_food_recipes_lemon_cake_served_with_a_72886", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter, plus extra for greasing", "3 medium free range eggs", "2 lemons, zest and juice only", "200g/7oz caster sugar", "75g/2½oz crème fraîche", "150g/5½oz plain flour", "1 tsp baking powder", "75g/2½oz icing sugar", "1 lemon, juice only", "300g/10½oz rhubarb, cut in 2cm/¾in pieces", "1 tbsp caster sugar", "1 orange, juice only ", "4 lemons, zest and juice", "110g/4oz butter", "175g/6oz caster sugar", "4 free-range eggs, beaten", "110g/4oz mild soft goats' cheese", "50ml/2fl oz double cream", "2 tbsp icing sugar", "100g/3½oz candied almonds", "4 tbsp lemon balm leaves or baby basil leaves"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon cake, preheat the oven to 180C/170C Fan/Gas 3. Grease and line a 20cm/8in square cake tin.", "Melt the butter and set aside to cool slightly. Put the eggs, lemon juice and sugar in a bowl. Using an electric whisk, beat until the sugar is dissolved. Whisk in the butter and crème fraiche. Sift the flour and baking powder over the top and gently fold in. Stir in the lemon zest and spoon into the prepared tin.", "Bake for 45-60 minutes, or until golden-brown and risen (the cake will split along the top). Put the cake on a wire rack to cool for 10 minutes before removing from the tin. Place a tray or a piece of baking paper underneath the rack.", "For the glaze, whisk the icing sugar and lemon juice together in a bowl then pour over the still warm cake. Remove the tray or paper from underneath the cake and pour any excess back over the cake. Allow to cool before serving.", "For the roasted rhubarb, preheat the oven to 200C/180C Fan/Gas 6.", "Arrange the rhubarb in a single layer in a roasting tin. Sprinkle over the sugar and drizzle over the orange juice. Roast for 8-12 minutes, or until just tender.", "For the lemon curd, put a heatproof bowl over a pan a gently simmering water (don’t let the bowl touch the water). Put the lemon zest, juice, butter and sugar in the bowl and whisk occasionally until the sugar is completely dissolved. Beat in the eggs and whisk until thickened and cooked through. Remove from the heat and allow to cool completely. ", "For the sugared almonds, preheat the oven to 130C/110C Fan/Gas 1 and line a baking tray with baking paper.", "For the goat’s cheese cream, put all the ingredients in a bowl and mix well.", "To serve, cut the cake into cubes or small slices and arrange on serving plates. Dress the plate with lemon curd, roasted rhubarb, goats’ cheese cream, sugared almonds and lemon balm or baby basil leaves."]}, {"isVegetarian": false, "title": "Lemon chicken and blackbean squid with stir-fried rice", "url": "www_bbc_co_uk_food_recipes_lemon_chicken_and_81996", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz boneless skinless chicken breast, cut into strips", "2 tbsp light soy sauce", "1 tbsp honey", "2 tbsp cornflour", "2 lemons, zest and juice only", "75ml/2½fl oz chicken stock", "1 tsp groundnut oil", "1 tbsp dry sherry", "1 red chilli, finely chopped", "3 garlic cloves, thinly sliced", "2cm/¾in piece fresh root ginger, peeled and finely grated", "3 spring onions, thinly sliced", "300g/10½oz squid, cleaned and cut into strips", "1 tsp sesame oil", "1 tbsp soy sauce", "1 tbsp mirin ", "2 tbsp groundnut oil", "3cm/1½in piece fresh root ginger, peeled and finely chopped", "2 garlic cloves, finely chopped", "2 red chillies, finely chopped ", "40g/1½oz black beans, rinsed, drained and roughly chopped", "50-75ml/2-2½fl oz chicken stock", "2 tbsp dry sherry or Shaoxing rice wine", "3 spring onions, thinly sliced", "2-3 tbsp fresh coriander, roughly chopped", "1 tbsp groundnut oil", "300g/10½oz cooked and cooled basmati rice ", "2 spring onions, sliced", "2 tbsp coriander leaves, roughly chopped", "2 tbsp soy sauce", "1 tsp sesame oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken in a bowl. Mix the soy sauce, honey and cornflour together in a separate bowl then pour over the chicken. Toss to coat, then set aside.", "Mix the lemon zest, juice and chicken stock together.", "Heat a wok or frying pan until hot then add the groundnut oil. Add the sherry to the chicken and stir through, then add to the hot wok and stir fry for 2 minutes until just sealed. Add the chilli, garlic and ginger and the lemon and chicken stock. Bring to the boil, stirring well. Reduce the heat to a simmer and cook for 4-5 minutes until the chicken is cooked through and the sauce thickened. ", "For the squid, mix the squid, sesame oil, soy and mirin together in a bowl and set aside for 5 minutes.", "Heat a frying pan or wok until hot, add the groundnut oil and when it’s shimmering, add the ginger, garlic and chilli. Stir fry for 2 minutes or until just softened. Add the squid and black beans and stir fry for 2-3 minutes over a high heat. Add the chicken stock, sherry, spring onion and coriander. Stir well then simmer for another couple of minutes until the squid is cooked through. Spoon into a serving bowl.", "For the rice, heat a frying pan or wok until hot. Add the groundnut oil and when it’s shimmering, add the rice and stir fry for 1 minute before adding the spring onions, coriander, soy and sesame oil. Stir fry for 2-3 minutes, or until piping hot through then tip into a serving bowl. ", "To serve, add the spring onions to the lemon chicken and mix through. Serve with the squid and rice."]}, {"isVegetarian": true, "title": "Lemon cake with lemon curd, meringue and lemon cream", "url": "www_bbc_co_uk_food_recipes_lemon_cake_with_lemon_56875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 egg whites", "250g/9oz caster sugar", "2 lemons, thinly sliced and slices cut into quarters", "350g/12oz butter, softened, plus extra for greasing", "350g/12oz caster sugar", "4 lemons, zested, plus juice of 2 lemons", "6 free-range eggs", "3 tsp baking powder", "300g/10½oz self-raising flour", "4 lemons, zest and juice", "110g/4oz butter", "175g/6oz caster sugar", "4 free-range eggs, beaten", "150g/5½oz mascarpone", "200ml/7fl oz double cream", "30g/1oz icing sugar", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringues, preheat the oven to 65C/150F/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat.", "Place the egg whites in a large food processor with a whisk attachment and whisk until stiff peaks form when the whisk is removed.", "With the motor running, gradually add the sugar until you have a glossy meringue. ", "Spread the meringue very thinly over the silicone lined baking tray using a palette knife. ", "Bake in the oven for 3-4 hours, or until completely dried out (this will take less time if your oven temperature is higher than recommended).", "Remove shards of the cooked meringue from the silicone mat using a palette knife and set aside.", "For the lemon slices, preheat the oven to 65C/150F/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat or baking parchment.", "Put the lemon slices onto the trays and place in the oven for about three hours or until dried out.", "For the lemon cake, preheat the oven to 180C/350F/Gas 4. Grease and line a square 20cm/8in cake tin.", "Cream the butter and sugar together in a bowl until pale and fluffy. Add the lemon zest and juice. ", "Slowly beat in the eggs, one at a time, until the mixture is well combined. ", "Sift the baking powder and self-raising flour together in a bowl then fold into the cake mixture.", "Pour the cake batter into the tin and bake for 25-30 minutes or until risen and golden-brown. Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tin to loosen the cake. Remove the cake from the tin and set aside to cool completely on a rack.", "For the lemon curd, place the lemon zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water).", "Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through.", "Remove from the heat and allow to cool completely. ", "For the lemon cream, place the mascarpone into a bowl and beat to soften.", "Pour in the double cream, icing sugar and lemon juice.", "Whisk until the mixture forms soft peaks when the whisk is removed.", "Fold the lemon curd into the lemon cream.", "Serve slices of the cake with a spoonful of the lemon cream and decorate with shards of meringue and a couple of lemon slices."]}, {"isVegetarian": true, "title": "Lemon crème brûlée, marinated figs and pistachio", "url": "www_bbc_co_uk_food_recipes_lemon_crme_brle_21806", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450ml/16fl oz double cream ", "50ml/2fl oz lemon juice", "1 lemon, zest only", "5 free-range egg yolks", "100g/3½oz caster sugar", "2 figs, quartered", "1 tsp caster sugar", "2 tbsp rosewater", "100g/3½oz caster sugar", "100g/3½oz pistachio nuts"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the crème brûlée, preheat the oven to 150C/300F/Gas 2. ", "Mix together the cream, lemon juice and lemon zest in a saucepan and bring to the boil. Reduce the heat and simmer gently  for 10 minutes, whisking continuously. Remove from the heat and set aside.", "In a heatproof bowl, whisk together the eggs and sugar until light and frothy. ", "Add the boiled cream to the eggs and mix well.", "Pour the mixture into individual moulds placed in a roasting tin. Cover the base of the tin with water to make a bain marie. Place in the oven for about 30 minutes, or until they are set on the edges but still wobbly in the centre. Remove from the oven and set aside to cool. ", "For the figs, preheat the oven to 160C/325F/Gas 3. Place the figs on a baking tray and sprinkle them with sugar and rosewater. Bake the figs for six minutes.", "For the brittle, line a baking tray with greaseproof paper. Place the sugar into a saucepan over a low heat. Once the sugar has completely melted, add the nuts. Pour the mixture onto the prepared tray and leave to cool. ", "When set, break the brittle into shards. ", "For the crème brûlée, cover the tops with an even layer of caster sugar and caramelise using a chef's blowtorch.", "Serve the crème brûlée with the figs and brittle."]}, {"isVegetarian": true, "title": "Lemon curd", "url": "www_bbc_co_uk_food_recipes_lemon_curd_68499", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_68499_16x9.jpg", "ingredients": ["4 unwaxed  lemons, zest and juice", "200g/7oz unrefined caster sugar", "100g/3½oz unsalted butter, cut into cubes", "3 free-range eggs, plus 1 free-range egg yolk"], "serves": "Makes one 500g/1lb 2oz (large) jar or two 250g/9oz (small) jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lemon zest and juice, the sugar and the butter into a heatproof bowl.  Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl.  Stir the mixture every now and again until all of the butter has melted.", "Lightly whisk the eggs and egg yolk and stir them into the lemon mixture. Whisk until all of the ingredients are well combined, then leave to cook for 10-13 minutes, stirring every now and again, until the mixture is creamy and thick enough to coat the back of a spoon.", "Remove the lemon curd from the heat and set aside to cool, stirring occasionally as it cools. Once cooled, spoon the lemon curd into sterilised jars and seal.  Keep in the fridge until ready to use."]}, {"isVegetarian": true, "title": "Lemon curd and passion fruit pavlova", "url": "www_bbc_co_uk_food_recipes_lemon_curd_and_passion_24599", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium free-range egg whites", "pinch salt ", "400g/14oz caster sugar", "2 tsp white wine vinegar", "4 tsp cornflour", "900ml/1½ pint double cream", "2 heaped tbsp icing sugar ", "10-15 ripe passion fruits, halved and seeds scooped out ", "4 unwaxed lemons, zest and juice only ", "200g/7oz caster sugar", "100g/3½oz unsalted butter, cubed", "3 medium free-range eggs, plus 1 medium free-range egg yolk", "1 lemon, zest only ", "limoncello liqueur, to serve (optional)"], "serves": "Makes 1 large pavlova", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/140C Fan/Gas 2.", "Draw a 20cm/8in circle on three pieces of baking parchment and put each piece on a separate baking tray.", "In a very clean bowl beat the egg whites with a pinch of salt using a hand-held mixer at medium speed until soft peaks form when the whisk is removed. Increase the speed to medium-high and add the sugar a tablespoon at a time. When all the sugar is incorporated continue to whisk for a further minute.  Add the vinegar and cornflour and then beat at a high speed until the meringue is glossy and holds stiff peaks when the whisk is removed (this will take about 5 minutes). ", "Divide the mixture equally between the circles on the three baking trays. One of the discs will be used to top the tier, so should look especially nice!", "Bake until the meringues have a crisp crust and feel dry to the touch, about 1-1¼ hour (the insides will still be marshmallow-like).", "Switch off the oven and leave the meringues to cool down in the oven, leaving the oven door slightly open.  Leave the meringues to cool very slowly in the oven.", "For the filling, whip the cream and icing sugar until soft peaks form when the whisk is removed. Gently stir through the passion fruit flesh.  ", "For the lemon curd, put the lemon zest, lemon juice, sugar and butter in a heatproof bowl.  Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl.  Stir the mixture every now and again until the butter has melted.  Remove the bowl from the heat.", "In a separate bowl, lightly whisk the eggs and egg yolk. Gently stir them into the lemon mixture, then whisk until all the ingredients are well combined.", "Put the bowl back over the simmering water. Heat the lemon curd for 10-13 minutes, stirring every now and again, until the mixture is creamy and thick enough to coat the back of a spoon. Remove the lemon curd from the heat and set aside to cool, stirring occasionally. It will thicken as it cools.", "To assemble, top a disc of meringue with a third of the passion fruit cream and a drizzle of the lemon curd.  Repeat with the other two meringue discs to make a three-tiered stack.  Decorate the top with more lemon curd and the grated lemon zest.  Serve with a shot of limoncello, if using."]}, {"isVegetarian": true, "title": "Lemon curd and pistachio meringue roulade", "url": "www_bbc_co_uk_food_recipes_lemon_curd_and_pistachio_20948", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_and_pistachio_20948_16x9.jpg", "ingredients": ["5 free-range egg whites", "280g/10oz caster sugar", "50g/1¾ oz shelled pistachio nuts, finely chopped", "icing sugar, for dusting", "100g/3½oz butter, softened", "225g/8oz caster sugar", "5 free-range egg yolks", "3 large lemons, juice and finely grated zest", "300ml/10fl oz double cream, lightly whipped"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a 23x33cm/9x13in Swiss roll tin with greased non-stick baking paper.", "Whisk the egg whites in a clean large bowl using an electric mixer on full speed until very stiff. Gradually add the sugar, a teaspoon at a time, and still on high speed, whisking well between each addition. Whisk until very, very stiff and glossy and all the sugar has been added.", "Spread the meringue mixture into the prepared tin, sprinkle with the chopped nuts. Bake for about 8 minutes until very golden-brown. Lower the oven to 160C/140C Fan/Gas 3 and bake for 15 minutes more until firm to the touch. Remove and turn upside down on a piece of non-stick baking paper. Carefully peel the paper from the base of the meringue and leave it to cool for about 10 minutes. ", "To make the lemon curd, put the butter into a heatproof bowl, add the sugar and whisk by hand until combined. Stir in the egg yolks. Add the lemon zest and juice and whisk until smooth. Sit the bowl over a pan of just simmering water and whisk until the mixture has thickened. This will take about 8-10 minutes. Be careful the water does not boil as this will curdle the curd.", "Reserve 100g/3½oz (about 6 tablespoons) of the lemon curd and set aside. Spoon the remaining lemon curd into a sterilised jar. Seal and label it. It will keep in the fridge for 2 weeks. ", "To fill the roulade, mix the reserved lemon curd with the whipped cream, swirling to give a marbled effect. Spread over the cooled meringue. Lightly score the meringue along one long side, slightly in from edge. Use this to help you fold and start to roll the base. Roll up the meringue tightly, using the paper to help you. Sit it on a plate with the join underneath.", "To serve, dust with icing sugar and decorate with Easter chicks."]}, {"isVegetarian": true, "title": "Lemon curd, mascarpone and almond pancakes", "url": "www_bbc_co_uk_food_recipes_lemon_curd_mascarpone_04597", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_mascarpone_04597_16x9.jpg", "ingredients": ["90g/3¼oz mascarpone", "1 tbsp icing sugar, to taste", "6 tbsp lemon curd", "30g/1oz toasted flaked almonds", "4 pancakes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Beat the icing sugar into the mascarpone a little at a time until smooth and sweet enough to suit your tastes.", "Spread the lemon curd over the pancakes. Top with a dollop of mascarpone and the flaked almonds. "]}, {"isVegetarian": true, "title": "Lemon curd meringue cake", "url": "www_bbc_co_uk_food_recipes_lemon_curd_meringue_cake_09194", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range egg whites", "400g/7oz white caster sugar", "4 lemons, zest and juice", "110g/4oz butter", "175g/6oz caster sugar", "4 free-range eggs, beaten", "500ml/18floz double cream", "50g/1¾oz physalis (Cape gooseberries)", "2 passion fruit, seeds only", "50g/1¾oz cherries", "50g/1¾oz redcurrants"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the meringue, preheat the oven to 150C/300F/Gas1.", "Whisk the egg whites in a bowl until soft peaks are formed when the whisk is removed.", "Gradually add the sugar and continue to whisk until soft peaks are formed again. Spoon into a piping bag fitted with a small plain nozzle.", "To make a template, draw four 20cm/8in diameter circles onto baking parchment and place on a baking sheet.", "Starting in the centre of each circle, pipe the meringue in a spiral to fill the circle, keeping the meringue height as low as possible.", "Cook in the oven for 20 minutes.", "Turn the oven off but leave the meringues in there for at least two hours. When crisp, remove from the oven and leave to cool.", "For the lemon curd, place the lemon zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water).", "Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through.", "Remove from the heat and allow to cool completely.", "Whisk the double cream in a large bowl until soft peaks form when the whisk is removed, then fold in the lemon curd and mix gently.", "Spoon into a piping bag and snip the end off, giving a width of about 1.5cm/½in.", "To assemble the cake, place a meringue disc onto a serving plate.", "Pipe the lemon curd cream in a spiral onto the meringue to cover totally.", "Place another meringue disc on top and repeat with the cream.", "Repeat with the remaining meringue and cream, finishing with meringue on top.", "Decorate with the fruit and serve in wedges."]}, {"isVegetarian": true, "title": "Lemon curd Swiss roll", "url": "www_bbc_co_uk_food_recipes_lemon_curd_swiss_roll_49855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz lightly salted butter ", "110g/4oz caster sugar", "2 lemons, zest and juice ", "2 free-range eggs, at room temperature, beaten", "unsalted butter, for greasing", "4 free-range eggs, three whole eggs plus an egg yolk", "160g/5¾oz caster sugar, plus extra for rolling", "160g/5¾oz self-raising flour, sifted "], "serves": "Makes 1 Swiss roll", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon curd, put the butter, sugar, lemon zest and juice into a bowl set over a saucepan of simmering water (ensure the bowl does not touch the water). Stir occasionally until the sugar is dissolved. ", "When the sugar is dissolved, add the beaten eggs and continue to heat, stirring occasionally, until the mixture thickens. Transfer to a bowl to cool.", "For the sponge, preheat the oven to 200C/400F/Gas 6. Grease and line a 26x40cm/10½x16in baking tray with baking parchment.", "Place a large heatproof bowl over a pan of simmering water. Add the eggs and sugar to the bowl and whisk until lukewarm (don't overheat the mixture). Remove bowl and whisk until the mixture is very thick and leaves trails when the whisk is removed. Fold in the sifted flour using a metal spoon.", "Spread the mixture onto the prepared baking tray and place on the middle shelf in the oven. Bake for 8-10 minutes, or until firm to the touch.", "Lay a large piece of greaseproof paper or a tea towel on the work surface and dust with sugar. Tip out the cake onto the dusted paper/tea towel and carefully remove the baking parchment. ", "Spread the, still warm, lemon curd evenly over the sponge.", "Position the cake with one of the short ends nearest to you. Make a cut across the width of the sponge about 1cm/½in in and about three-quarters of the way through the depth of the sponge (this will help you roll up the sponge). Tightly roll up the sponge starting at the nearest edge and using the paper/tea towel to help you. Set aside to cool.", "Before serving, trim the ends of the roll to create a neat finish and dust with a little extra sugar, if desired. "]}, {"isVegetarian": false, "title": "Lemon curd trifle", "url": "www_bbc_co_uk_food_recipes_lemon_curd_trifle_04769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs", "225g/8oz caster sugar ", "225g/8oz unsalted butter, melted", "225g/8oz self-raising flour", "100ml/3½fl oz vodka", "2 lemons, juice and zest only", "250g/9oz caster sugar", "300g/10½oz frozen raspberries ", "75g/2½oz caster sugar ", "1 vanilla pod, seeds only", "4 lemons, juice and zest", "225g/8oz unsalted butter", "350g/12oz caster sugar", "4 free-range eggs", "600ml/20fl oz milk", "600ml/20fl oz double cream", "1 vanilla pod, cut in half lengthways", "150g/5½oz sugar", "100g/3½oz cornflour", "3 free-range eggs", "3 free-range egg yolks", "50g/1¾oz unsalted butter, cubed", "400ml/14fl oz double cream, whipped", "4 tbsp crushed unsalted, shelled pistachio nuts"], "serves": "Serves 8–10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and line a 15x20cm/6x8in cake tin with baking paper. Alternatively use 2 x 20cm/8in round cake tins (the shape of the tin does not matter as the cake will be broken up for the trifle).", "For the sponge, in a large bowl whisk the eggs and sugar on high using an electric whisk for 3 minutes, or until thick, creamy and at least doubled in size. Pour in the melted butter in a steady stream, mixing all the time. Gently fold the flour into the mixture. ", "Pour the mixture into the prepared tin and bake for 20-25 minutes. Remove from the oven and leave to cool in the tin slightly before transferring to a wire rack to fully cool.", "For the lemon syrup, in a saucepan combine all the ingredients with 100ml/3½fl oz water and bring to the boil. Once syrupy, remove from the heat and set aside to cool.", "For the compôte, combine all the ingredients with 150ml/¼ pint water in a saucepan. Gently simmer for about 10 minutes. Remove from the heat and set aside to cool.", "For the lemon curd, in a saucepan gently bring the lemon juice, zest, butter and half of the sugar to a simmer. In a bowl, combine the remaining sugar with the eggs and lightly whisk. Slowly pour the juice mixture over the eggs, whisking constantly. Pour back into the pan and place over a low heat. Stir constantly for about 5 minutes until thickened. Pass through a sieve and keep refrigerated until needed.", "For the custard, gently heat the milk, cream and vanilla in a saucepan until just boiling. Remove from the heat. Combine the sugar and cornflour in a mixing bowl and gradually whisk in the eggs and yolks. ", "Pour the warm milk mixture over the eggs, a little at a time, whisking constantly. Return to the pan and stir constantly over a low heat until thickened. Pass through a sieve and remove the vanilla pod. Cover the surface with baking paper to prevent a skin forming while the custard cools.", "To assemble the trifle, start by layering pieces of the sponge in the bottom of a serving dish or individual glasses. Pour over the syrup and let it soak in for about 5 minutes or so. ", "Add a layer of the raspberry compôte and then the lemon curd. Spoon the custard on top. Finish with the whipped cream and sprinkle over the crushed pistachios. Refrigerate until ready to serve."]}, {"isVegetarian": true, "title": "Lemon and almond cake", "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_cake_66665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_66665_16x9.jpg", "ingredients": ["200g/7oz butter, softened, plus extra for greasing", "200g/7oz golden caster sugar", "3 large free-range eggs (organic if possible)", "50g/2oz plain flour or white spelt flour", "125g/4½oz ground almonds", "2 lemons (juice of 1 and finely grated zest of 2)", "1 lemon, juice only", "5-6 tbsp icing sugar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease the base and sides of a 20-22cm/8-8½in round cake tin and line the bottom with baking parchment.", "In a mixing bowl cream together the butter and sugar until light and fluffy using an electric hand whisk or wooden spoon. Slowly beat in the eggs, one at a time. When the eggs are fully incorporated, fold in the flour, then the almonds and lemon zest.", "Scrape the mixture into the tin and tap the sides to release any air bubbles. Bake for 35-40 minutes, or until the sponge is lightly golden-brown, coming away from the sides of the tin and a skewer inserted into the middle of the cake comes out clean. ", "While the cake is still hot and still in the tin, stab it with a chopstick or some such weapon all over the cake, making 15 or so holes. Drizzle the lemon juice into the holes and all over the cake then leave in the tin to cool.", "When you're ready to serve the cake, make the icing. To make the icing, mix the lemon juice, a little at a time, into the icing sugar to make a smooth paste. Remove the cake from the tin and smooth the icing on the top, then serve."]}, {"isVegetarian": true, "title": "Lemon cake with lemon curd and double cream", "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_cake_with_90476", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_with_90476_16x9.jpg", "ingredients": ["350g/12oz butter, softened, plus extra for greasing", "350g/12oz caster sugar", "4 lemons, zest only, plus juice of 2 lemons", "3 large pieces candied lemon peel , finely chopped", "6 free-range eggs", "3 tsp baking powder", "300g/10½oz self-raising flour", "50g/2oz cornflour", "60g/2¼oz butter", "225g/8oz caster sugar", "3 lemons, juice and zest", "2 free-range eggs", "300ml/12fl oz double cream", "200g/7oz icing sugar, sifted, plus extra for dusting"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line three 20cm/8in sandwich tins.", "Cream the butter and sugar together in a bowl until pale and fluffy. Add the lemon zest and juice and candied peel. ", "Slowly beat in the eggs, one at a time, until the mixture is well combined. ", "Sift the baking powder, self raising flour and cornflour together in a bowl and fold into the cake mixture.", "Divide the cake batter among the sandwich tins and bake for 25-30 minutes or until risen and golden-brown. Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tins to loosen the cakes. Remove the cakes from the tins and set aside to cool completely on a rack.", "While the cakes are cooking, make the lemon curd. Heat the butter, sugar and lemon juice and zest in a bowl set over a pan of simmering water, stirring occasionally until the butter has melted and the sugar has dissolved. (Do not allow the base of the bowl to touch the surface of the water.) Remove from the heat.", "Meanwhile, beat the eggs in a separate bowl. Slowly whisk the melted butter mixture into the beaten eggs until well combined.", "Set the bowl over the pan of simmering water and cook, whisking constantly, for 2-3 minutes or until the mixture thickens enough to coat the back of a spoon. ", "Sieve the lemon curd into a clean bowl, then cover with cling film and set aside to cool.", "For the filling, whip the cream and icing sugar together in a bowl until soft peaks form when the whisk is removed.", "Place one of the cakes onto a serving plate and spread with the lemon curd. Spread over some of the whipped cream and sandwich with another cake. Repeat the process with the remaining lemon curd, whipped cream and cake tiers. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Lemon drizzle traybake", "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_traybake_01890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_traybake_01890_16x9.jpg", "ingredients": ["225g/8oz baking spread, straight from the fridge, or butter at room temperature, plus extra for greasing", "225g/8oz caster sugar", "275g/10oz self-raising flour", "2 level tsp baking powder", "4 free-range eggs", "4 tbsp milk", "2 lemons, zest only", "1 heaped tbsp very finely chopped lemon verbena (optional)", "175g/6oz granulated sugar", "2 lemons, juice only"], "serves": "Makes 16 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease the tin with baking spread and line the base with baking paper.", "Measure all the ingredients into a large bowl and beat for 2 minutes, or until well blended. Turn the mixture into the prepared tin and level the top.", "Bake for 35–40 minutes until the cake has shrunk a little from the sides of the tin and springs back when lightly touched with a fingertip in the centre of the cake. ", "Meanwhile, make the glaze. Mix the granulated sugar with the lemon juice and stir to a runny consistency. ", "Leave the cake to cool for 5 minutes in the tin, then lift out, with the lining paper still attached, and place on wire rack set over a tray.", "Brush the glaze all over the surface of the warm cake and leave to set. Remove the lining paper and cut into slices to serve."]}, {"isVegetarian": false, "title": "Lemon, herb and paprika spatchcocked chicken", "url": "www_bbc_co_uk_food_recipes_lemon_herb_and_paprika_35932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole chicken (1.5–1.8kg/3lb 5oz–4lb)", "1tsp salt", "1 tsp black peppercorns", "½ tsp finely  chopped fresh rosemary", "½ tsp finely chopped fresh chives", "1 tsp sweet smoked paprika", "1 lemon, zest and juice", "2 tbsp olive oil"], "serves": "Serves 4–6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To spatchcock the chicken, turn it breast-side down with the legs towards you. Using very sturdy kitchen scissors or poultry shears, cut down one side of the parson’s nose and the backbone.Turn the chicken around and cut along the other side of the backbone, back to the parson’s nose. Remove this piece and discard. Flip the chicken breast-side up again and press down firmly on the breast bone to flatten it out. ", "Mix together the salt, peppercorns, herbs, paprika and lemon zest in a small bowl and whisk in the oil. Rub this mixture all over the chicken.", "Put the chicken in a bowl or a plastic bag and pour over the lemon juice. Place in the fridge to marinate overnight or for at least 1 hour. ", "Remove the chicken from the fridge 1 hour before you are ready to cook it.", "Put the chicken in the hot oven and reduce the temperature to 200C/Fan 180C/Gas 6. Roast for 35–40 minutes until cooked through and the juices run clear. Alternatively, cook the chicken on a barbecue, turning regularly until cooked through. ", "To oven cook, preheat the oven to its highest setting and put the chicken in a large roasting tray. "]}, {"isVegetarian": true, "title": "Lemon hummus", "url": "www_bbc_co_uk_food_recipes_lemon_hummus_83864", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_hummus_83864_16x9.jpg", "ingredients": ["2 x 400g/14oz can chickpeas, drained", "1 garlic clove, crushed", "5 tbsp extra virgin olive oil", "2 lemons, zest and juice only", "3 tbsp Greek yoghurt", "a good pinch ground cumin", "plenty of ground black pepper and salt"], "serves": "Serves 8 as part of a sharing platter", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients in a food processor with two tablespoons of hot water and blend until smooth. ", "Season, to taste, and serve chilled."]}, {"isVegetarian": true, "title": "Lemon iced buns", "url": "www_bbc_co_uk_food_recipes_lemon_iced_buns_24468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour, sifted", "250g/9oz plain flour, sifted", "125ml/4fl oz warm water", "125m/4fl oz warm milk", "1 x 7g/¼oz sachet fact-action dried yeast", "2 tsp fine sea salt", "50g/2oz caster sugar", "1 lemon, zest only", "1 free-range egg, beaten", "50g/2oz butter, cut into cubes", "vegetable oil, for greasing", "50g/2oz icing sugar, sifted", "½ lemon, juice only"], "serves": "Makes 8 buns", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the flours, water, milk, yeast, salt, sugar and lemon zest into a large bowl and mix with a fork until combined. Add the beaten egg and butter and continue to mix until the mixture comes together as a sticky dough.", "Tip the dough onto a lightly floured work surface and knead for five minutes, or until the dough is smooth and elastic.", "Lightly oil a bowl with a little of the vegetable oil.", "Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size. ", "Lightly grease two baking trays.", "Knock the dough back to its original size and turn it out onto a lightly floured work surface. Divide the dough into eight portions, shape them into rounds and place onto the baking trays. Ensure the rolls are well spaced. Cover with a tea towel and set aside to prove for 30 minutes. ", "Preheat the oven to 220C/425F/Gas 7. ", "Bake the buns in the oven for 20-25 minutes or until well risen and golden-brown. Remove the buns from the oven and set aside to cool on a wire rack.", "Meanwhile for the icing, mix the icing sugar and lemon juice together in a bowl until smooth. ", "Once the buns have completely cooled, spread the icing on top of them and set aside until the icing has hardened."]}, {"isVegetarian": true, "title": "Lemon Madeira cake with candied peel", "url": "www_bbc_co_uk_food_recipes_lemon_madeira_cake_with_15109", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_madeira_cake_with_15109_16x9.jpg", "ingredients": ["1 unwaxed lemon", "200g/7oz granulated sugar", "100g/3½oz caster sugar", "175g/6oz softened butter", "175g/6oz caster sugar", "225g/8oz self-raising flour", "50g/1¾oz ground almonds", "4 large free-range eggs", "1 large unwaxed lemon, finely grated zest only"], "serves": "Makes 1 x 18cm/7in cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the candied peel, cut the lemon into 8 wedges, then cut out the flesh, leaving a 5mm thickness of peel and pith. Cut each wedge into 4 strips.", "Pour 300ml/10fl oz water into a small pan, add the granulated sugar and heat, stirring until the sugar has dissolved.  Add the lemon zest and simmer uncovered for 30-45 minutes, until the lemon peel is soft and translucent. ", "Drain in a wire sieve and leave to cool. Spread the peel out on a baking sheet lined with parchment and sprinkle with caster sugar. Place in the oven on the lowest setting (approximately 110C/90C Fan/Gas ¼) for 1 hour until dry. ", "For the cake, preheat the oven to 180C/160C Fan/Gas 4. Grease a 18cm/7in deep round cake tin and line the base and sides with baking parchment.", "Put the butter, sugar, flour, ground almonds, eggs and lemon zest into a large bowl. Using an electric mixer, beat for 1 minute to mix thoroughly. Turn into the prepared tin and level the surface.", "Bake for 35 minutes. Decorate with 3 pieces of candied peel and bake for a further 20-25 minutes, until a skewer inserted into the centre, comes out clean. Leave in the tin for 15 minutes to cool before turning out onto a wire rack to cool completely.  "]}, {"isVegetarian": true, "title": "Lemon meringue cupcakes", "url": "www_bbc_co_uk_food_recipes_lemon_meringue_cupcakes_41613", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_cupcakes_41613_16x9.jpg", "ingredients": ["100g/3½oz baking spread", "150g/5½oz self-raising flour", "150g/5½oz caster sugar", "3 tbsp full-fat milk", "2 free-range eggs", "1 unwaxed lemon, finely grated zest only", "7g freeze-dried strawberries (available in large supermarkets), to decorate", "lemon curd", "2 free-range egg whites", "100g/3½oz caster sugar"], "serves": "Makes 12 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a 12-hole muffin tray with cases.", "Put the sponge ingredients into a bowl and whisk using an electric hand whisk until light and fluffy. Spoon the mixture evenly between the cases. Bake for 18–20 minutes or until golden-brown, risen and springy to the touch. Set aside to cool completely. ", "Cut a deep circle in the centre of each cake (about the width of a £2 coin) and pull out a walnut size of sponge to leave a hole. Spoon 1 teaspoon lemon curd into each hole, making sure the curd is level with the top.", "To make the meringue, whisk the egg whites in a large bowl with an electric hand whisk until stiff. Gradually add the sugar as you continue whisking on full speed, until you have a stiff glossy mixture. Spread or pipe on the top of each cupcake and sit back in their tins.  ", "Use a chef’s blowtorch to brown the meringues or slide the tray under the grill. Watch carefully and remove when golden-brown. ", "Sprinkle with the freeze-dried strawberries."]}, {"isVegetarian": true, "title": "Lemon meringue ice cream with lemon balm", "url": "www_bbc_co_uk_food_recipes_lemon_meringue_ice_cream_57978", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_ice_cream_57978_16x9.jpg", "ingredients": ["300ml/½ pint double cream", "1 lemon, zest and juice", "1 jar good quality lemon curd", "50g/1¾oz meringues, broken into chunky pieces", "2 tbsp chopped fresh lemon balm", "3 passionfruit, halved, pulp and seeds scooped out", "sprigs of lemon balm, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 450g/1lb loaf tin with clingfilm, overlapping the sides. Whisk the cream lightly until the whisk leaves a trail, add the lemon zest and juice and half the jar of lemon curd then fold in the meringue and chopped lemon balm.", "Spoon the mixture into the loaf tin, cover with clingfilm and freeze for at least six hours.", "If the ice cream has been freezing overnight or longer, remove it from the freezer for 10-15 minutes before turning onto a plate. Lift the ice cream from the loaf tin, invert it onto a board and remove the clingfilm. Dip a sharp knife in boiling water and cut the ice cream into thick slices.", "Mix the other half of the lemon curd with the pulp and seeds from the passion fruit. Place a slice of ice cream on a plate and top with a spoonful of the passionfruit sauce. Decorate with sprigs of lemon balm."]}, {"isVegetarian": true, "title": "Lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_lemon_meringue_pie_01804", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_pie_01804_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "125g/4½oz butter, cut into cubes", "1 tbsp caster sugar", "2 large free-range egg yolks", "3 tbsp cold water", "80g/2¾oz cornflour", "325g/11½oz caster sugar", "150ml/¼ pint lemon juice", "1 unwaxed lemon, finely grated zest only", "80g/2¾oz unsalted butter, cut into cubes", "4 large free-range egg yolks", "225g/8oz caster sugar", "3 large free-range egg whites "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "To make the pastry, sift the flour and salt into a bowl. Rub in the butter using your fingertips until the mixture resembles fine breadcrumbs. Stir in the sugar. ", "Add the egg yolks and then the cold water, a little at a time, using a table knife to bring the pastry together. If the mixture is too dry to hold together, add a little more water. Do not overwork the pastry or make it too sticky or it will become tough. Shape into a disc, cover with cling film and place in the fridge for at least 10 minutes.", "Unwrap the pastry and roll it out on a lightly floured surface to a large circle about 3mm thick.", "Transfer the pastry on the rolling pin to a 23cm/9in loose-bottomed tart tin, pressing it into all the corners and allowing excess pastry to hang over the edge. Chill in the fridge for 10 minutes. ", "Place the lined tart tin on a baking sheet. Line the pastry case with baking paper and ceramic baking beans or dried beans. Bake for 15–20 minutes. Remove the beans and paper and bake for a further 5–8 minutes, until pale golden. Leave to cool. Trim off the excess pastry with a sharp knife.", "To make the filling, combine the cornflour and sugar in a saucepan, then stir in the lemon juice and 300ml/10½fl oz water until smooth. Bring to the boil, stirring frequently, until the mixture thickens. Reduce the heat, simmer gently for 1–2 minutes, then remove from the heat and immediately stir in the egg yolks. Leave to cool a little. ", "Stir in the lemon zest and butter and mix until combined. Pour it into the pastry case and set aside to cool completely. The mixture should be smooth, thickened and set. ", "To make the meringue, put the sugar and 75ml/2½fl oz water into a saucepan and gently bring to the boil, stirring until the sugar is dissolved. Cook until the sugar syrup reaches 120C on a thermometer.  ", "Meanwhile, put the egg whites into a free-standing mixer with a balloon whisk. When the syrup reaches 110C, start whisking until stiff peaks form when the whisk is removed. Once the syrup reaches 120C, while the mixer is whisking, pour it over the egg whites. Be careful not to pour it over the mixing attachment, which could splash it back at you. Whisk until the meringue is cool – it should be shiny and stiff. ", "Remove the cooled tart from the tin. Spoon the meringue over the top, making sure there are no gaps and spreading it out so it just touches the pastry (this will stop it sliding off). Use the spoon to make it smoothly swirled or to create peaks all over.  ", "Using a blowtorch, gently caramelise the meringue. Alternatively, you can do this under a preheated grill for a few seconds. Serve. "]}, {"isVegetarian": false, "title": "Lemon mousse with roasted strawberries, Rioja and lemon syrup", "url": "www_bbc_co_uk_food_recipes_lemon_mousse_with_25853", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs, eggs and yolks separated", "150g/5½oz caster sugar", "3 lemons, zest and juice only", "300ml/10½fl oz double cream", "15g gelatine, soaked in water", "100g/3½oz caster sugar", "50g/1¾oz unsalted butter", "30 fresh strawberries, stalks removed", "400ml/14fl oz Rioja", "200g/7oz caster sugar", "2 lemons, zest cut into thin strips"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon mousse, whisk together the egg yolks, sugar, zest and juice of the lemons until doubled in volume.", "In a clean bowl, whip the cream until soft peaks form when the whisk is removed, then stir in the gelatine. Fold the cream into the egg yolk mix.", "Whisk the egg whites in a separate clean bowl until soft peaks form, and then fold them into the egg yolk mix.", "Decant into small glasses or dishes and place in the fridge.", "For the roasted strawberries, place a frying pan on the heat and add the sugar and butter. Once melted quickly add the strawberries and toss in the sugar and butter. Set aside until ready to serve.", "For the Rioja and lemon syrup, put the Rioja in a medium-sized saucepan and cook until reduced to half the volume. Add the sugar and most of lemon zest and cook for a further 10 minutes.", "To serve place the mousse on the plate with the strawberries next to it and pour over the syrup. Top the mousse with the reserved lemon zest."]}, {"isVegetarian": true, "title": "Lemon pavlova", "url": "www_bbc_co_uk_food_recipes_lemon_pavlova_50340", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_pavlova_50340_16x9.jpg", "ingredients": ["6 free-range egg whites (feel free to use egg whites from a carton if wished)", "375g/13oz caster sugar", "2½ tsp cornflour", "2 unwaxed lemons", "300ml/10½fl oz double cream", "325g/11½oz jar lemon curd ", "50g/1¾oz flaked almonds, toasted"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking parchment.", "Beat the egg whites using an electric mixer until satiny peaks form, then beat in the sugar a spoonful at a time until the meringue is stiff and shiny.", "Sprinkle the cornflour over the meringue, then grate in the zest – a fine microplane is best for this – of 1 lemon and add 2 teaspoons of lemon juice.", "Gently fold until everything is thoroughly mixed in. Mound onto the lined baking tray in a fat circle approximately 23cm/9in in diameter, smoothing the sides and the top with a knife or spatula. Place in the oven, then immediately reduce the temperature to 150C/130C Fan/Gas 2, and cook for 1 hour.", "Remove from the oven and leave to cool, but don’t leave it anywhere cold as this will make it crack too quickly. If you think your kitchen is too cool, then leave the pavlova inside the oven with the door completely open. When you’re ready to eat, turn the pavlova onto a large flat plate or board with the underside uppermost – I do this before I sit down to the meal in question and let it stand till pudding time. This is so the tender marshmallow belly of the pav melds with the soft topping.", "Whip the cream until thick and airy but still with a soft voluptuousness about it, and set it aside for a moment.", "Put the lemon curd into a bowl and beat it with a wooden spoon or spatula to loosen it a little. Taste the lemon curd (if it’s shop-bought) and add some lemon zest and a spritz of juice if it’s too sweet.", "With a light hand, a glad heart and a spatula, spread the lemon curd on top of the meringue base. Now top with the whipped cream, peaking it rather as if it were a meringue topping. Sprinkle with the zest of the remaining lemon – you can grate this finely or coarsely as you wish – followed by the flaked almonds, and serve triumphantly."]}, {"isVegetarian": true, "title": "Lemon pavlova", "url": "www_bbc_co_uk_food_recipes_lemon_pavlova_89056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2ml vanilla essence", "2ml lemon essence ", "2ml Champagne vinegar or white wine vinegar", "2 tsp hot water", "4 free-range egg whites", "80g/3oz sugar", "1 tsp cornflour ", "2 free-range egg yolks", "160g/5¾oz sugar", "100ml/3½fl oz lemon Juice \t", "2 tsp lime juice\t", "60g/2¼oz butter\t", "1 lemon, rind  only, julienned ", "1 lime, rind only, julienned ", "100g/3½oz sugar ", "whipped  cream"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven for 135C/115C Fan/Gas 1. Line a large baking tray with baking paper. ", "Dissolve the vanilla essence, lemon essence and vinegar in the hot water.  ", "Using an electric mixer, whisk the egg whites until stiff in a very clean bowl. Fold in the sugar and cornflour and continue to whisk for 2 minutes, then add the water mixture and beat until stiff peaks form.", "Using a very large kitchen spoon make 12 large quenelles from the meringue mixture and place on the lined tray. Cook the meringue for 1 hour, then turn the oven off and leave the meringue in the oven overnight.  ", "Meanwhile, for the lemon curd. Whisk the yolks and sugar until smooth and pale. Stir in the lemon and lime juice. Put the mixture through a sieve into a heatproof bowl. Add the butter. Put the bowl over a pan of gently simmering water and cook the curd until smooth and thickened.", "For the candied peel. Bring a small saucepan of water to the boil, add the rinds and cook for 20 seconds. Strain and boil again in fresh water. For the third boil, add the sugar to 100ml/3½fl oz water and heat gently until dissolved. Return the rind to the pan. Once the liquid has reduced to a syrup remove from the heat. Carefully remove the rind (boiling sugar gets very hot) and set aside to cool. ", "Mix the curd with the whipped cream. Top the pavlovas with the whipped cream mixture and some candied peel. Serve 3 mini pavlovas per person."]}, {"isVegetarian": true, "title": "Lemon posset with fennel biscotti", "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_fennel_86459", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_posset_with_fennel_86459_16x9.jpg", "ingredients": ["425ml/¾ pint double cream", "125g/4½oz sugar", "2 lemons, juice only", "95g/3¼oz butter", "60g/2¼oz sugar", "2 free-range eggs", "225g/8oz plain flour, plus extra for dusting", "1 tsp baking powder", "pinch salt ", "50g/1¾oz chopped toasted almonds", "½ tbsp fennel seeds", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the posset, bring the cream and sugar to the boil in a pan. Reduce the heat to a simmer and cook for 1-2 minutes. Add the lemon juice and mix thoroughly. Pass through a fine sieve and set aside to cool for five minutes.", "Skim off any air bubbles from the surface and pour into six serving glasses. Transfer to the fridge for at least two hours, or until set. ", "For the biscotti, preheat the oven to 170C/325F/Gas 3 and line a baking tray with baking parchment.", "Sift the flour and baking powder together. In a separate bowl, beat the butter and sugar together until smooth and creamy.  Add the eggs one at a time with a spoonful of flour each time (to prevent the mix from splitting). Sift in the remaining flour mixture and mix to combine. Fold in the toasted almonds and fennel seeds.", "Lightly dust a work surface with flour and shape the dough into two fat sausage shapes. Place on the prepared baking tray and slightly flatten the dough. ", "Bake in the oven for 20-25 minutes, or until pale golden-brown. Remove from the oven and leave to cool for 10 minutes.", "After 10 minutes, slice the loaf into 2cm/¾in thick slices and lay the biscuits out onto a wire rack that will fit in the oven. Place the rack into the oven for five minutes, or until the biscuits are dried out.", "Remove from the oven and immediately dust with icing sugar. Leave to cool completely before serving with the lemon posset."]}, {"isVegetarian": true, "title": "Lemon posset with meringue shards and Jamaican gingerbread", "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_89572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "150g/5½oz caster sugar", "2 large lemons, zest and juice only", "4 free-range egg whites", "250g/9oz caster sugar", "150g/5½oz soft light brown sugar", "150g/5½oz softened butter, plus extra for greasing", "250g/9oz golden syrup", "75g/2½ oz black treacle", "125g/4½oz oat flakes", "175g/6oz self-raising flour", "3 tbsp ground ginger", "1 tsp ground nutmeg", "1 tsp mixed spice powder", "pinch salt", "2 free-range eggs, beaten", "25ml/1fl oz milk", "4 sprigs fresh lemon balm", "4 scoops ready-made lemon sorbet (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the lemon posset, slowly bring the double cream and sugar to the boil in a large saucepan over a low heat, stirring well to dissolve the sugar in the cream. Boil for 3 minutes, then remove from the heat and set aside to cool.", "Once the cream mixture has cooled, whisk in the lemon juice and zest. Pour the posset mixture into 6 glass serving bowls and chill in the fridge for at least 3 hours.", "For the meringue shards, preheat the oven to 65C/50C Fan/Gas ¼ (or to the lowest setting on your oven). Line a baking tray with a silicone mat or a sheet of baking parchment.", "Whisk the egg whites in a clean bowl until stiff peaks form when the whisk is removed. Gradually whisk in the sugar a little at a time, until the meringue mixture is glossy.", "Spread the meringue in a thin, even layer all over the lined baking tray using a palette knife. Bake in the oven for 3-4 hours, or until completely dried out (this will take less time if your oven temperature is higher than suggested above).", "Bend the silicone mat or lining paper to break the meringue into shards. Remove the meringue shards from the silicone mat using a palette knife and set aside to cool.", "For the Jamaican gingerbread, increase the oven temperature to 140C/120C Fan/Gas 1. Grease a 30x20cm/12x8in cake tin with butter.", "Melt the sugar, butter, syrup and treacle in a small saucepan over a low heat, stirring well to combine.", "In a mixing bowl, mix together the oats, flour, ginger, nutmeg, mixed spice and salt until well combined. Add the eggs and milk, pour over the melted syrup mixture, then whisk slowly until well combined.", "Pour the gingerbread mixture into the prepared cake tin and bake for 1¼ hours, or until a skewer inserted into the centre of the cake comes out clean.", "To serve, crumble a little of the gingerbread on top of each posset, then garnish with a lemon balm sprig. Place the serving dishes onto small plates. Decorate the plates with the meringue shards and a few thin slices of the remaining gingerbread. Place a scoop of lemon sorbet alongside, if desired."]}, {"isVegetarian": true, "title": "Lemon posset with gran's shortbread", "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_grans_18007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "150g/5½oz caster sugar", "2 large lemons, zest and juice", "8 ripe strawberries", "2 ripe fresh figs, cut into wedges", "1 handful tiny fresh mint sprigs, to garnish", "175g/6oz plain flour ", "90g/3¼oz icing sugar", "60g/2½oz ground almonds", "25g/1oz cornflour", "250g/9oz cold butter, cut into cubes", "200g/7oz stawberry jam"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the posset, bring the cream and sugar to the boil in a saucepan. Remove the pan from the heat, then whisk in the lemon zest and juice, whisking as much air into the mixture as possible.", "Pour the posset mixture into ramekins and chill in the fridge for 1 hour, or until set. Once set, decorate the tops with strawberries, figs and mint sprigs.", "For the shortbread, preheat the oven to 180C/160C Fan/Gas 4.", "Mix the plain flour, icing sugar, ground almonds and cornflour together into a bowl. Rub the butter into the dry ingredients until the mixture resembles breadcrumbs, then gently bring the mixture together as a dough. ", "Divide the dough into 24 small, equal-sized balls and press one into each well of a 24-hole silicone fairy cake mould (or two 12-hole ones). Alternatively roll out the dough to about 1cm/½in thick and use a small biscuit cutter to cut out shapes.", "Bake the shortbreads in the oven for 10-12 minutes, or until pale golden-brown.", "While the shortbreads bake, bring the jam to the boil in a saucepan with 50ml/2fl oz water. Reduce the heat and simmer for 2-3 minutes, or until the mixture resembles a thick syrup.", "Remove the shortbread from the oven and, when cool enough to handle but still malleable, make a small dent in the centre of each with your finger.", "Spoon the warm strawberry syrup into the dent in each shortbread, then remove them from the moulds and set aside to cool on a wire rack. Serve the shortbread alongside the lemon possets."]}, {"isVegetarian": true, "title": "Lemon, ricotta and pine nut tart", "url": "www_bbc_co_uk_food_recipes_lemon_ricotta_and_pine_38427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "100g/3½oz very cold butter, cut into small cubes, plus extra for greasing", "60g/2¼oz ground almonds", "60g/2¼oz icing sugar, sifted", "½ lemon, zest only", "pinch salt", "1 large free-range egg yolk", "1 tsp vanilla extract", "300g/10½oz ricotta cheese", "100g/3½oz mascarpone", "100ml/3½fl oz cream", "½ lemon, zest only", "3 tbsp lemon juice", "5 tbsp runny honey", "6 large free-range eggs, separated", "150g/5½oz pine nuts", "icing sugar, for dusting", "200g/7oz crème fraîche"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, rub the butter into the flour until the mixture looks like breadcrumbs. Mix in the ground almonds, icing sugar, lemon zest and salt. ", "Make a well in the centre and incorporate 3 tablespoons of ice-cold water a little at a time, kneeding gently. Just as the dough starts to come together, mix in the egg yolk and vanilla extract. ", "Turn the mixture out onto a clean work surface and knead lightly until it forms a ball. Press into a flat circle, wrap in cling film and refrigerate for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. Grease a 20cm/8in pie or tart tin, roughly 4cm/1½in deep, and dust with flour. ", "Dust a clean work surface with flour and roll out the dough into a circle about 5mm/¼in thick. Press the pastry into the tin, concentrating on the sides. Trim off most of the excess pastry, leaving some around the edge to allow for shrinking. Refrigerate for 10-15 minutes.", "Prick the pastry base with a fork, line with greaseproof paper and pour in the baking beans. Bake for 15 minutes, remove the greaseproof paper and beans and cook for a further 5 minutes until lightly golden. Trim any excess pastry and set aside on a wire cooling rack.", "Meanwhile, make the filling. In a large mixing bowl, beat together the ricotta, mascarpone, cream, lemonjuice and zest, honey and egg yolks until smooth.", "In a separate bowl, whisk the egg whites until stiff peaks form. Fold the egg whites into the ricotta mixture one spoonful at a time.", "Pour the mixture into the pastry case and sprinkle over the pine nuts. Cook for 30–35 minutes, or until slightly set at the sides but still wobbly in the middle. Cool on a wire rack for at least one hour. ", "Dust with icing sugar and serve in generous slices with a dollop of crème fraîche."]}, {"isVegetarian": false, "title": "Lemon roly-poly", "url": "www_bbc_co_uk_food_recipes_lemon_roly-poly_72099", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.375kg/3lb 1oz self-raising flour ", "200g/7oz caster sugar", "550g/1lb 4oz shredded suet ", "5 lemons, zest only", "about 700ml/1¼ pint water", "375g/13oz lemon curd", "50ml/2fl oz whole milk"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas mark 6.", "Place the flour, sugar, suet and lemon zest into a large bowl and mix thoroughly.", "Make a well in the centre of the mixture then gradually add enough water to make a soft dough. Knead lightly until smooth and divide into five portions.", "Roll each portion of dough out on a floured surface into a rectangle about 1cm/½in thick. Spread the lemon curd out on the dough leaving a 1cm/½in border.", "Roll up from the short side into a pinwheel, seal the ends well with a little water and place onto greased baking trays. Brush with the milk.", "Place in the oven for 35-40 minutes, or until golden brown."]}, {"isVegetarian": false, "title": "Lemon sole, cockles and samphire with garlic parsley dumplings and lemon sauce", "url": "www_bbc_co_uk_food_recipes_lemon_sole_cockles_and_99774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small lemon sole fillets, trimmed and washed ", "500g/1lb 2oz live cockles ", "300g/10½oz samphire", "200g/7oz broad beans, blanched, refreshed and podded", "1 tbsp chopped flatleaf parsley  ", "2 tbsp olive oil", "salt and pepper", "300g/10½oz baked potatoes, cooked and cooled, flesh pushed through a ricer or sieve ", "1 garlic bulb, roasted whole, soft cloves peeled and pushed through a sieve ", "1½ tbsp grated parmesan ", "1 egg yolk ", "75g/2⅔oz 00 flour ", "2 tsp lemon oil ", "3 tbsp chopped flatleaf parsley ", "1 egg yolk ", "1 lemon, zest and juice", "200ml/7fl oz light olive oil ", "50ml/2fl oz double cream ", "110ml/4fl oz fish stock "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the grill to medium-hot and place the fish onto a baking tray and season. Place the fish under the grill and cook for approximately 10 minutes, or until the flesh comes away from the bone. ", "Meanwhile, place a pan with a lid onto the stove and when the pan is hot add the cockles. Add 110ml/4fl oz water and immediately cover with the lid. Steam the cockles for a minute then drain. Discard any cockles that have not opened. When cool enough to handle, pick the cockles from their shells.", "For the dumplings, bring a large pan of water to a simmer. Add one teaspoon of the olive oil and a pinch of salt. ", "Place the potato, garlic, parmesan and egg yolk into a bowl and fold together (don’t overwork). Fold in the flour, lemon oil and parsley. Season and place on a clean work surface. ", "Divide the dough up into small balls and blanch in the simmering water until the dumplings rise to the surface. Plunge into ice-cold water and, when cold, transfer to a tea towel to dry. ", "Heat a non-stick pan until hot. Add the remaining oil and the dumplings and fry until they are golden-brown. Drain on kitchen paper.", "For the lemon sauce, place the egg yolk, lemon juice and zest into a bowl and whisk together. Slowly add the oil in a thin stream, whisking all the time, to make a mayonnaise.", "Whisk the cream into the mayonnaise and add enough fish stock to thin the mayonnaise to a sauce consistency (you will not need all the stock). Place the sauce into a pan and gently warm through.", "Bring a pan of salted water to the boil. Just before serving, plunge the samphire into the water and cook for two minutes. ", "To serve, add the cooked cockles, samphire, broad beans and parsley to the sauce and bring to just below a simmer.", "Place the cooked fish onto serving plates and pile the dumplings alongside. Use a slotted spoon to remove the cockles, samphire and broad beans from the sauce and serve alongside the fish. Pass the sauce through a sieve and spoon over the fish."]}, {"isVegetarian": false, "title": "Lemon sole goujons, marie-rose sauce and crushed minted peas", "url": "www_bbc_co_uk_food_recipes_lemon_sole_goujons_mary_00757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large lemon sole, filleted and skinned ", "50g/1¾oz plain flour, seasoned with salt and pepper", "50g/1¾oz Japanese panko breadcrumbs", "3 whole free-range eggs, whisked", "vegetable oil, for deep-fat frying", "sea salt, to taste", "20g/¾oz butter", "1 large banana shallot, diced", "30g/1oz mint, separated into leaves and stalks, stalks tied together with cook's string", "200g/7oz fresh peas, blanched in a pan of boiling water and refreshed in a bowl of cold water", "10g sugar", "5g malt vinegar", "40g/1½oz tomato ketchup", "60g/2¼oz mayonnaise ", "2 splashes Tabasco", "½ lemon juice  ", "2 splashes Worcestershire sauce", "splash brandy (optional)", "pinch cayenne pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon sole goujons, slice the fish into thick strips with a sharp knife. Prepare a plate of the seasoned flour, a plate of breadcrumbs and a shallow dish of eggs.", "Dip the fish into the seasoned flour, pat off any excess, then coat with the egg wash, let the excess drip off, then add the fish to the breadcrumbs, making sure all the fish is coated.", "Heat the oil in a deep-fat fryer to 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Add the sole goujons to the fryer and deep fry until golden-brown, remove using a slotted spoon, transfer to a plate lined with kitchen paper and season with sea salt.", "For the crushed minted peas, heat the butter in a pan and fry the shallots until softened. Add 30ml/1fl oz of water and bring to a rapid boil with the mint stalks and sugar. Add the peas and boil for 20 seconds and then drain.", "Remove the stalks and put the peas into a food processor with the mint leaves. Pulse for 10 seconds to make a crushed pea texture and check for seasoning, adding salt and pepper to taste. Add the malt vinegar.", "For the marie-rose sauce, mix together the ketchup, mayonnaise, Tabasco, lemon juice, Worcestershire sauce, brandy (if using) and cayenne pepper.", "Serve the goujons with the crushed minted peas and Marie-rose sauce."]}, {"isVegetarian": false, "title": "Lemon sole goujons with watercress and tartare sauce", "url": "www_bbc_co_uk_food_recipes_lemon_sole_goujons_with_95881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "60g/2¾oz cornflour", "300ml/10½fl oz sparkling ale", "300ml/10½fl oz soda water", "100g/3½oz ready-made mayonnaise", "2 tbsp drained capers, chopped", "4 gherkins, drained, chopped", "1 tbsp chopped flatleaf parsley", "salt and freshly ground black pepper, to taste", "vegetable oil, for deep-fat frying", "6 medium fillets of lemon sole, cut into strips", "plain flour, for dusting fish", "large bunch fresh watercress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the batter, sift the plain flour and cornflour together into a bowl. ", "Whisk in the ale and the soda water until the mixture is smooth and well combined. Set aside to rest for 10 minutes, then whisk again for 30 seconds.", "Meanwhile, for the tartare sauce, mix together all of the tartare sauce ingredients until well combined. Chill in the fridge until needed.", "To cook the fish, pour enough vegetable oil into a deep-sided, heavy-based pan to fill it by about two-thirds. Heat the oil until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Sprinkle a little flour onto a plate and press both sides of each of the lemon sole strips into the flour until completely covered. ", "Dip the floured lemon sole strips into the batter, then gently lower them into the hot oil and fry until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "To serve, place a few lemon sole goujons onto each of four serving plates. Spoon a dollop of tartare sauce alongside each portion. Garnish with a handful of watercress leaves."]}, {"isVegetarian": false, "title": "Lemon sole, slow-cooked leeks, brown shrimp and capers", "url": "www_bbc_co_uk_food_recipes_lemon_sole_slow-cooked_00010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 leeks, trimmed and white parts cut into 10cm/4in pieces", "50ml/2fl oz white wine", "75g/2½oz butter ", "1 sprig thyme ", "vegetable or sunflower oil, for deep frying", "165g/5¾oz whole lemon sole, cleaned and filleted ", "2 tbsp olive oil", "25g/1oz brown shrimp", "10g/¼oz Lilliput capers", "100g/3½oz unsalted butter", "2 lemons, juice of 1 and 1 segmented ", "small handful fresh flatleaf parsley, chopped ", "salt and black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½. ", "Lay the leeks on a piece of aluminium foil, season with salt and pepper and bring the edges of the foil up to enclose the leeks leaving the top open. Pour over the white wine and add the butter and thyme, then seal the foil to make a parcel. Bake for 10-15 minutes, or until the leeks are soft.", "Meanwhile, preheat a deep-fat fryer to 180C, or fill a large, deep saucepan two-thirds full with oil and heat until a small piece of bread turns crisp and golden-brown within a minute of adding it to the oil.", "Season the sole fillets with salt and pepper. Heat the olive oil in a large frying pan. Once hot, add the fish and cook for 3 minutes on each side.", "Meanwhile, place the shrimps in the deep-fat fryer and cook for 1-2 minutes until golden-brown and crisp. Once cooked, remove from the fryer using a slotted spoon and drain on a plate lined with kitchen roll. Add the capers and deep fry for 1 minute. Remove using a slotted spoon and set aside.", "In a saucepan melt the butter until it becomes a light-brown colour, then add the lemon juice and set aside to cool. Add the brown shrimp, lemon segments and parsley.", "To serve, place the sole fillets on serving plates. Add the leek then pour the butter over the sole, then finish with the deep-fried capers. "]}, {"isVegetarian": false, "title": "Lemon sole with Lyonnaise potatoes", "url": "www_bbc_co_uk_food_recipes_lemon_sole_with_16617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["120g/4¼oz unsalted butter", "2 sprigs of fresh lemon thyme", "2 sprigs rosemary ", "100ml/3½fl oz groundnut or vegetable oil", "1 turkey leg, boned, cut into large dice", "1 small onion, sliced into rings", "1 garlic bulb, halved", "5 sprigs fresh thyme", "500ml/18fl oz chicken stock", "60g/2¼oz unsalted butter", "½ large onion, sliced", "1 sprig fresh thyme, leaves only, chopped", "vegetable oil, for deep frying, plus 4 tsp for shallow frying", "400g/14oz floury potatoes, preferably Desiree, Maris Piper or King Edward, cut into 1cm/½in dice", "4 tsp wholegrain mustard", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper", "iced water", "6 tomatoes", "60g/2¼oz unsalted butter", "4 x 160g/5¾oz pieces lemon sole, skinned, pin-boned", "sprinkle of lemon juice", "120g/4¼oz brown shrimps", "40g/1½oz peeled lemon segments, cut into small pieces", "40g/1½oz baby capers", "40g/1½oz tomato concasse", "20g/¾oz shallots, finely chopped", "1 tbsp chopped fresh parsley", "75g/2¾oz frozen peas"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the beurre noissette, heat two small saucepans and divide the butter between them. Add the lemon thyme to one saucepan and add the rosemary to the other, this will give you two different burnt butters. Cook until the butter turns golden brown, remove from the heat. ", "Preheat the oven to 220C/200C Fan/Gas 6. ", "For the turkey jus, heat a roasting tray in the oven and add the oil. Add the turkey meat and roast until golden brown and cooked through, stirring from time to time, this should take about 15 minutes. Remove the roasting tray from the oven and put on the hob over a medium-low heat. ", "Add the onion and garlic, flesh side-down, and cook gently until lightly coloured. Add the thyme and deglaze the roasting tray with 500ml/18fl oz water. ", "Transfer to a large saucepan and stir in the chicken stock. Bring to the boil, then reduce to a simmer and cook for 3 hours, skimming off any scum and excess fat. Strain in a colander and pass through a fine sieve, then put back in the pan and reduce to 500ml/18fl oz. Set aside. ", "For the Lyonnaise potatoes, melt 40g/1½oz butter in a heavy-based saucepan. Add the onion and thyme and season with salt and pepper. Cook, stirring from time to time, until soft and transparent. ", "Meanwhile heat the oil in a deep-fat fryer or a deep-sided, heavy-based pan to 140C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave if unattended). Blanch the potatoes in the oil until soft and lightly coloured. Drain on kitchen paper and leave to cool.", "Heat the remaining 4 teaspoons oil in a frying pan with the remaining butter. Add the blanched potatoes and cook until golden brown. Drain away the excess butter, and add the cooked onion and the mustard to the potatoes. Mix well, then add the parsley and season with salt and pepper.", "For the tomato concasse, half-fill a bowl with iced water. Remove the stalks from the tomatoes and cut away what remains of the stalk area. Using a sharp knife, cut across the top of each tomato. Plunge each tomato in boiling water for 10 seconds and refresh in the iced water. Peel the tomatoes, cut into quarters and remove the seeds. Cut the tomato quarters into strips, then into small dice.", "To make a sauce for the lemon sole, take the thyme beurre noisette and strain through a sieve, add the turkey jus and simmer until it has reduced by two thirds, then season with salt and pepper and set aside.\r\n\r\n", "For the lemon sole, preheat the oven to 200C/180C Fan/Gas 6. Season the fish with salt and pepper. Heat the remaining butter and a drop of oil in an ovenproof frying pan over a medium heat. Before the butter turns golden-brown add the fish thick side-down. Once the fish starts to colour, place the pan in the oven for 5 minutes, then turn the fish to cook for a further 4 minutes. Cook in batches if needed. ", "For the garnish, put your rosemary beurre noisette in a pan. Add the brown shrimp and heat gently. Add the lemon segments, baby capers, tomato concasse, shallots, parsley, and peas. Season with salt and pepper, keep warm.", "Sprinkle the fish with lemon juice. Leave it to stand for 1 minute while you put some of the Lyonnaise potatoes in the middle of each serving plate. Put the fish on top of the potatoes and spoon the rosemary noisette garnish over it. Pour over the lemon sole sauce and serve. "]}, {"isVegetarian": false, "title": "Lemon sole with slow-cooked leek, brown shrimp and capers", "url": "www_bbc_co_uk_food_recipes_lemon_sole_with_slow_24057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 leek, outer leaves removed, cut into 10cm/4in pieces", "50ml/2fl oz dry white wine ", "knob of butter ", "1 sprig fresh thyme ", "165g/5¾oz whole lemon sole, head removed, gutted and skinned on both sides ", "2 tsp lilliput capers", "salt and freshly ground black pepper", "50g/1¾oz butter", "1 lemon, juice and segments ", "25g/1oz brown shrimp ", "handful fresh flatleaf parsley, chopped "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½. ", "Lay the leeks on a large piece of aluminium foil. Season with salt and pepper and bring the side of the foil up to make a parcel. Add the wine, butter and thyme, then close the foil. Put the parcel on a baking tray and cook for 10—15 minutes until the leek is soft.", "Season the lemon sole with salt and pepper. Heat a frying pan over a medium heat, add the lemon sole and cook for 3 minutes on each side.", "Heat a deep fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Add the capers and cook for 30 seconds, or until they are open and crispy. Remove and drain on kitchen paper.", "To make the sauce, melt the butter in a small saucepan until it is light brown, then add the lemon juice. Remove from the heat and leave to cool. Add the brown shrimp, lemon segments and parsley.", "To serve, put the lemon sole on a deep plate and add the leeks. Pour over the butter and top with the capers.                                                           "]}]