[{"ingredients": ["100g / 3½oz de chocolate negro liso, roto en pedazos", "150 g / 5½ oz de mantequilla ablandada", "150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de almendras molidas", "50g / 1¾oz de harina de auto crianza", "3 huevos de gallinas camperas", "1 cucharada de jugo de limón", "3 peras de conferencias firmes (aproximadamente 500 g / 1 lb 2 oz)", "Almendras en copos de 15g / ½oz", "1 cucharadita de azúcar glasé, para tamizar", "Bloque de hojaldre refrigerado prefabricado de 500 g / 1 lb 2 oz", "harina simple, para rodar"], "method": ["Precaliente el horno a 200C / 180C (ventilador) / Gas 6 y coloque una bandeja para hornear dentro.", "Coloque el chocolate en un recipiente resistente al calor y colóquelo sobre una fuente de agua hirviendo a fuego lento, sin dejar que el recipiente toque el agua, hasta que el chocolate se haya derretido casi por completo. Retire con cuidado de la sartén y déjela reposar para terminar de fundir, revolviendo de vez en cuando hasta que quede suave.", "Coloque la mantequilla, las almendras molidas, el azúcar, la harina y los huevos en un tazón grande y bata con un batidor eléctrico hasta que quede suave y esponjoso. Alternativamente, poner en un tazón y batir con una cuchara de madera.", "Para la masa, presione los lados del bloque de repostería en un poco para ayudar a formar una forma más redonda. Despliegue sobre una superficie ligeramente enharinada hasta unos 5 cm / 2 pulgadas más grande que una lata de flan con estrías de 26 cm / 10½ y 3 mm de grosor. Levante cuidadosamente sobre el rodillo y colóquelo suavemente en la lata, presionando firmemente en las esquinas y los lados. Pincha la base ligeramente con un tenedor. Recorte los bordes con un cuchillo afilado, sostenido horizontalmente.", "Con una cuchara, coloque toda la mezcla de almendras en la tarta, trabaje alrededor del exterior antes de trabajar hacia la mitad de la caja de la pastelería. Deje caer cucharadas del chocolate derretido en la parte superior y dibuje la punta de un cuchillo a través de la mezcla para obtener un poco de mármol.", "Pon el jugo de limón en un tazón grande. Pele las peras y corte en cuartos. Retire los núcleos y deseche. Mezcle las peras con el jugo de limón para ayudar a evitar que se decoloren. Coloque las peras alrededor de la tarta, con el lado del corte hacia abajo, con los extremos puntiagudos hacia el centro, presionando suavemente en la masa de almendras. Hornee en la bandeja de horno en el horno durante 30 minutos.", "Tire del estante del horno que sostiene la tarta un poco hacia afuera y esparza con cuidado sobre las almendras en copos. Reduzca la temperatura del horno a 180 ° C / 160 ° C (ventilador) / Gas 4. Vuelva a colocar la tarta en el horno durante otros 25-30 minutos o hasta que esté bien subida. El relleno también debe sentirse firme al tacto. Si la tarta comienza a extenderse demasiado hacia el final del tiempo de cocción, cúbrala con un trozo de papel de aluminio.", "Enfríe en la lata durante al menos 10 minutos y luego transfiéralo cuidadosamente a un tablero o plato de servir. Espolvorear con azúcar glas tamizada y servir caliente o frío en trozos."], "url": "www_bbc_co_uk_food_recipes_pear_frangipane_18911", "title": "Frangipane de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pear_frangipane_18911_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo grandes de gallinas camperas", "375 g / 13 oz de azúcar en polvo", "1 cucharadita de vinagre de vino blanco", "1 cucharada de harina de maíz", "75 g / 3 oz de chocolate negro, roto en pedazos", "300 ml / 10 fl oz doble crema", "300ml / 10fl oz de yogur griego", "1 cucharadita de extracto de vainilla", "50g / 2oz de azúcar glas, tamizado", "4 peras pochadas o 2 x 400 g de latas de peras, mitades en almíbar, cortadas en trozos grandes", "Avellanas tostadas 50 g / 2 oz, reducido a la mitad"], "method": ["Precalentar el horno a 160 ° C / 140 ° Ventilador / Gas 3. Cubra una bandeja de horno con papel de hornear y dibuje un círculo de 15 cm en el centro y un círculo de 30 cm en el exterior para hacer un anillo.", "Coloque las claras de huevo en un recipiente para mezclar y bata con un batidor eléctrico a toda velocidad hasta que se formen picos suaves. Poco a poco agregue el azúcar, una cucharadita a la vez, aún batiendo a la máxima velocidad hasta que esté tieso y brillante. Mezcle el vinagre y la harina de maíz en un tazón pequeño hasta que quede suave y luego revuelva en el huevo hasta que se combinen.", "Coloque la mezcla entre las líneas del anillo. Haga una trinchera en el merengue con el dorso de una cuchara. Coloque en el horno y luego reduzca inmediatamente la temperatura a 140C / 120C Fan / Gas 1 y hornee durante 1-1½ horas o hasta que esté firme al tacto. Apague el horno y déjelo en el horno hasta que se enfríe.", "Derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento, no permita que el agua toque el recipiente. Revuelva hasta que se derrita y luego manténgalo caliente.", "Batir la crema hasta los picos suaves con un batidor eléctrico, agregue el yogur, la vainilla, el azúcar glas y la mitad de las piezas de pera. Con una cuchara, coloca la crema en la ranura de merengue, coloca las peras restantes en la parte superior y espolvorea con avellanas. Llene una pequeña bolsa con el chocolate derretido y pinte un patrón en zigzag en la parte superior. Cortar en trozos para servir."], "url": "www_bbc_co_uk_food_recipes_pear_hazelnut_and_86322", "title": "Pavlova de pera, avellana y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pear_hazelnut_and_86322_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20 g / ¾oz de levadura seca", "435g / 15½oz de harina blanca fuerte, más extra para espolvorear", "125ml / 4fl de leche en oz", "75 g / 2½ oz de azúcar en polvo", "3 cucharadas de mantequilla derretida, más 230 g / 8oz de mantequilla sin sal, suavizada", "1½ cucharadita de sal", "4 peras, peladas y picadas", "2 cucharadas de azúcar en polvo", "75 g / 2½ oz de chocolate negro, picado en trozos pequeños", "1 huevo grande de gallinas camperas, batido con 2 cucharadas de leche"], "method": ["Mezcle la levadura y 125 ml / 4 fl oz de agua tibia en el tazón de un mezclador independiente, equipado con un gancho de masa. Permita que la levadura se disuelva por cinco minutos.", "Agregue la harina, la leche, el azúcar, la mantequilla derretida y la sal, y mezcle a velocidad media durante dos minutos.", "Retire la masa del recipiente, forme una bola, envuélvala en una película adhesiva y déjela reposar durante 20 minutos.", "Polvore la superficie de trabajo ligeramente con harina. Desenvuelva la masa y gírela en un rectángulo de aproximadamente 25x38 cm / 10x15 pulgadas, cúbrala con un paño de cocina limpio y deje que se levante durante 30 minutos.", "Coloque el rectángulo en la mitad de la mantequilla ablandada. Dobla el tercio superior del rectángulo hacia abajo en el centro, luego pliega el tercio inferior hacia arriba, de modo que la masa esté doblada en tercios. Estirar en un rectángulo otra vez, doblar en tercios otra vez, cubrir con película adhesiva y colocar en la nevera durante 40 minutos.", "Retire la masa de la nevera, extiéndala en un rectángulo como antes y salpique con la mantequilla restante. Doblar en tercios, desplegar de nuevo y doblar en tercios de nuevo. Refrigere por otros 40 minutos.", "Para el relleno de pera y chocolate, coloque la pera picada en una sartén con el azúcar. Cocine a fuego medio durante unos 20-30 minutos, o hasta que la pera esté suave y pegajosa.", "Estirar la masa y cortar en 12 cuadrados iguales, extender la pera en el tercio superior de cada cuadrado y cubrir con el chocolate.", "Dobla el tercio superior de cada cuadrado, para encerrar el relleno de pera y chocolate, luego coloca la masa llena sobre el tercio inferior. Coloque el lado de la costura hacia abajo en dos bandejas para hornear forradas con papel de hornear antiadherente. Cubra con una película adhesiva y deje que se levante durante 40 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cepille los pasteles con la mezcla batida de huevo y leche y colóquelos en el horno de 12 a 14 minutos o hasta que estén dorados.", "Transfiera a una rejilla de alambre para que se enfríe un poco, luego coma caliente."], "url": "www_bbc_co_uk_food_recipes_pear_pain_au_chocolat_90614", "title": "Pera dolor de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de masa dulce con brisa", "1 huevo de gallinas camperas, golpeado", "4 peras maduras, peladas, sin corazón y cortadas en finas cuñas", "2 limones, solo jugo", "75 g / 2½ oz de mantequilla ablandada", "75 g / 2½ oz de azúcar en polvo de oro", "75g / 2½ oz de almendras molidas", "1 yema de huevo de gallinas camperas", "2 cucharadas de licor de pera o brandy", "3 cucharadas de mermelada de albaricoque"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cubra la lata de tarta con la masa, cubra con una hoja de papel a prueba de grasa y llene con alubias para hornear. Hornee durante 15 minutos, luego quite los frijoles para hornear y el papel, cepille la masa con el huevo batido y hornee por otros 10 minutos. Dejar de lado para enfriar.", "Para hacer el relleno, mezcle las peras en el jugo de limón para evitar que se pongan marrones. Batir la mantequilla, el azúcar, las almendras molidas, la yema de huevo y el licor de pera (o brandy) hasta que estén suaves. Cuchara en la caja de pastelería, luego extiéndala en una capa uniforme. Coloque las peras en anillos superpuestos, comenzando desde el borde exterior de la tarta y trabajando hacia adentro.", "Hornee por 30 minutos y luego póngalo a un lado para que se enfríe. A medida que la tarta se enfría, caliente el atasco en una cacerola pequeña hasta que se afloje, luego páselo por un colador hasta un recipiente.", "Retire con cuidado la tarta de la lata y cepille generosamente la parte superior con el atasco. Dejar enfriar antes de rebanar y servir."], "url": "www_bbc_co_uk_food_recipes_pear_tart_77757", "title": "Tarta de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de masa de hojaldre", "2 peras, peladas", "500ml / 18fl oz de vino tinto", "85g / 3oz de azúcar en polvo", "2 cucharadas de cassis (opcional)", "1 ramita de canela", "1 diente", "1 chile rojo seco", "150g / 5½oz Stilton, desmenuzado", "60 g / 2¼ oz de pistachos, sin cáscara y picados", "hojas de ensalada de bebé", "aceite de oliva", "jugo de limon", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Extienda la masa sobre una superficie ligeramente enharinada hasta obtener un rectángulo de aproximadamente 3 mm / ⅛ de grueso y pinche todo con un tenedor. Coloque la masa entre dos bandejas antiadherentes, transfiérala a una bandeja para hornear y cocine en el horno hasta que estén doradas y crujientes. Dejar enfriar y luego cortar en cuatro rectángulos.", "Coloque las peras en una cacerola con el vino, el azúcar, el licor, las especias y el chile. Deje que hierva rápidamente, cubra con papel antigrasa y cocine a fuego lento hasta que estén tiernos, girando las peras suavemente durante la cocción. Retire la sartén del fuego y deje enfriar.", "Una vez que se haya enfriado, escurra las peras, reservando el líquido de cocción. Corta las peras por la mitad, quita los corazones, córtalas en rodajas y colócalas en los rectángulos de la masa.", "Regrese el líquido de cocción a la sartén y hierva rápidamente hasta que el líquido esté almibarado.", "Espolvorea el Stilton y los pistachos sobre las peras. Adorne con algunas hojas de ensalada aderezadas con aceite de oliva, jugo de limón, sal y pimienta recién molida. Sirva con un chorrito de jarabe de vino tinto y unas gotas de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pear_tart_with_stilton_36656", "title": "Tarta de pera con Stilton y pistachos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pear_tart_with_stilton_36656_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "300ml / 10fl oz de leche entera", "300 ml / 10 fl oz doble crema", "125g / 4½oz de chocolate blanco, aproximadamente picado", "Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de sal", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "4 peras, peladas, sin corazón, cortadas a la mitad", "1 limón, ralladura solamente", "2 vainas de vainilla, partidas y semillas raspadas (solo semillas)", "1 ramita de canela", "½ naranja, pelar solo", "Azúcar en polvo 110g / 3¾oz", "110g / 3¾oz de mantequilla", "150ml / 5fl oz de crema doble", "75 g / 2½ oz de azúcar en polvo", "200 g / 7 oz de chocolate negro, toscamente picados"], "method": ["Para el helado de chocolate blanco, mezcle las yemas de huevo y el azúcar en un tazón grande hasta que se combinen.", "Caliente la leche y la crema en una sartén hasta que empiece a hervir. Verter sobre las yemas de huevo y batir bien. Vierta en la sartén y vuelva al fuego. Caliente hasta que sea lo suficientemente grueso como para cubrir la parte posterior de una cuchara.", "Pon el chocolate blanco en un tazón grande y resistente al calor. Vierta la mezcla de crema a través de un colador sobre el chocolate blanco y revuelva bien hasta que el chocolate se haya derretido. Permita que la mezcla se enfríe, luego vierta en una máquina de helados y siga las instrucciones del fabricante.", "Para la pasta de hojaldre áspera, coloque la harina y la sal en un tazón grande. Agregue la mantequilla y use la punta de los dedos para frotar la mantequilla en la harina. Cuando la mezcla de harina y mantequilla se asemeje a pan rallado, agregue 125ml / 4½fl oz de agua helada. Mézclalo con una espátula para mantener fresca la mezcla. Cuando la mezcla se una para formar una masa, colóquela en una superficie de trabajo enharinada limpia y amasar brevemente hasta que quede suave.", "Forme la masa en un bloque rectangular (esto facilitará el despliegue más adelante), envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enrolle la masa refrigerada sobre una superficie limpia y enharinada en un rectángulo de aproximadamente 40x20cm / 16x8 pulgadas. Dobla un tercio de la masa en el centro, luego dobla el otro tercio sobre eso. Dale a la masa un cuarto de vuelta y repite la laminación y el doblado. Envuelva el bloque de repostería en una película adhesiva, refrigere por 20 minutos y luego ruede y doble 2 veces más. Envuelva el bloque de repostería en una película adhesiva y refrigere durante 30 minutos antes de usar.", "Para la tarta de pera, precaliente el horno a 200C / 180C Fan / Gas 6.", "Coloque las peras, la ralladura de limón, las semillas de 1 vaina de vainilla, canela, cáscara de naranja y 25 g / 1 oz del azúcar en una cacerola. Llene la cacerola con suficiente agua para cubrir las peras. Caliente las peras suavemente hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 15 minutos, o hasta que las peras estén tiernas. Escurra las peras y séquelas. Deseche la canela y la cáscara de naranja.", "Caliente el azúcar restante de 85g / 3oz en una sartén a prueba de horno de 24cm / 9½ pulgadas a fuego lento hasta que se derrita y tenga un color dorado intenso. Agregue la mantequilla, la crema y las semillas restantes de vainilla. Caliente suavemente hasta que la mezcla forme un caramelo suave. Coloque las peras en el caramelo, con el lado cortado hacia arriba.", "En una superficie de trabajo enharinada, extienda la masa fría a un grosor de 5 mm / ¼ in. Corta la masa en un círculo ligeramente más grande que la sartén.", "Coloque el círculo de repostería sobre las peras, metiendo los bordes de la masa dentro de la sartén para rodear las peras. Transfiera al horno para hornear por 20-25 minutos, o hasta que la masa se levante, dorada y cocida. Una vez cocinado, reservar para enfriar durante 5-10 minutos.", "Para la salsa de chocolate, ponga el azúcar y 110ml / 3¾fl oz de agua en una olla y cocine a fuego lento. Cocine durante 1-2 minutos, o hasta que todo el azúcar se haya disuelto, luego retírelo del fuego y agregue el chocolate. Batir hasta que quede suave.", "Para servir, invierta la tarta Tatin en un plato de servir. Corta el Tatin y divídelo entre platos para servir. Cubra cada rebanada con una bola de helado y un poco de salsa de chocolate."], "url": "www_bbc_co_uk_food_recipes_pear_tarte_tatin_with_40778", "title": "Tarta de pera Tatin con helado de chocolate blanco y salsa de chocolate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 peras cómicas", "125 g / 4½ oz de azúcar en polvo", "licor de cereza o kirsch", "1 limón, cáscara y jugo solamente", "Hojaldre de 500 g / 1 libra, descongelado si está congelado", "2 ramitas de romero", "125 g / 4½ oz de azúcar en polvo", "25g / 1oz de mantequilla, ablandada", "20 g / oz de mantequilla", "100g / 3½ oz de chocolate negro de buena calidad", "105ml / 3¾fl de leche en oz", "40 g / 1½ oz de azúcar en polvo", "1 cucharada de crema doble"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Comienza preparando las peras. Pelarlos y cortarlos a la mitad, eliminando el núcleo con una cucharadita.", "Póngalos en una sartén con 125 g / 4½ oz de azúcar y suficiente agua para cubrir. Agregue el alcohol, el jugo de limón y la ralladura.", "Llevar a ebullición y cocine a fuego lento durante quince o veinte minutos dependiendo de la madurez de las peras. Una vez cocinado, prueba con un cuchillo afilado.", "Dejar enfriar en el líquido. Una vez que esté frío, retíralo del líquido y déjalo escurrir hasta que se seque.", "Haga el caramelo colocando 125 g / 4½ oz de azúcar en una sartén a prueba de horno. Caliente suavemente sin revolver hasta que se dore. Retire del fuego, agregue la mantequilla y mezcle con cuidado.", "Estirar la masa de hojaldre en una superficie enharinada. Recorta un círculo un poco más grande que el molde a prueba de horno.", "Coloque las peras secas y secas cortadas hacia arriba en la sartén, encima del caramelo. Espolvorea sobre el romero picado.", "Cubra las peras y la mezcla de caramelo con la masa, metiendo los bordes superpuestos por el lateral de la sartén.", "Hornee en el horno de quince a veinte minutos hasta que la masa esté dorada.", "Mientras tanto, prepara la salsa de chocolate. Coloque un recipiente de vidrio sobre una fuente de agua hirviendo a fuego lento. Derretir la mantequilla y el chocolate juntos en el recipiente, luego agregue la leche.", "Agregue el azúcar y la crema, revuelva hasta que quede suave y retire del fuego.", "Retire la tarta del horno y déjela reposar durante un minuto antes de apagarla. Para hacer esto, coloque un plato encima de la sartén e inviértalo para que la tarta se deslice, la masa en la parte inferior y las peras en la parte superior.", "Servir caliente con la salsa de chocolate y helado."], "url": "www_bbc_co_uk_food_recipes_pearandchocolatetart_72075", "title": "Tarta de licor de pera y cereza con salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de vinagre de vino tinto", "50ml / 2fl oz de vino tinto", "2 cucharadas de azúcar moreno", "1 pera, pelada, sin corazón y picada", "1 cebolla roja picada", "1 diente de ajo, picado", "puñado de perejil fresco, picado", "gran cuña de Stilton, para servir"], "method": ["Coloque todos los ingredientes, excepto el perejil y el Stilton, en una cacerola pequeña y cocine a fuego alto durante 8-10 minutos, o hasta que estén reducidos y almibarados, luego agregue el perejil.", "Para servir, vierta en un tazón, con una cuña grande de Stilton al costado."], "url": "www_bbc_co_uk_food_recipes_pearandredonioncompo_84666", "title": "Compota de pera y cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½ oz de harina de auto crianza", "50g / 2oz de mantequilla, cubos", "1 huevo de gallinas camperas", "1 cucharada de leche", "1 pera, en rodajas", "2 cucharadas de azúcar moreno", "1 cucharada de nueces, finamente picadas", "4 cucharadas de crema doble", "2 cucharadas de cacao en polvo", "1 cucharada de azúcar glas", "75ml / 2½ fl oz crema doble"], "method": ["Para la tarta de peras y nueces, precaliente el horno a 200C / 400F / Gas 6.", "Coloque la harina y la mantequilla en una licuadora o procesador de alimentos y mezcle hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo y la leche y mezcle hasta que se forme una bola. Dale la vuelta a una superficie plana, amasa una pelota y luego rueda al grosor de una moneda de una libra.", "Recorte un rectángulo de 20 cm / 10 pulgadas, pinche con un tenedor, cubra con la pera rebanada y espolvoree más de la mitad del azúcar.", "Deslice sobre una bandeja para hornear y hornee durante cinco minutos. Agregue el resto del azúcar y las nueces y hornee durante otros tres minutos, o hasta que la masa esté dorada. Retire del horno y coloque en un plato grande.", "Para la salsa de chocolate, mezcle la crema, el cacao en polvo y el azúcar glas en una cacerola pequeña a fuego lento hasta que estén bien combinados.", "Para servir, corte una tajada de la tarta, vierta sobre la crema doble y rocíe con abundante salsa de chocolate."], "url": "www_bbc_co_uk_food_recipes_pearandwalnuttartwit_86133", "title": "Tarta de pera y nuez con crema de chocolate y crema batida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, para engrasar", "45 g / 1½ oz de azúcar en polvo", "45g / 1½oz de azúcar moreno claro", "2-3 peras maduras", "Mitades de nuez 25g / ¾oz, peladas y ligeramente asadas", "crema batida y / o salsa de caramelo o salsa de chocolate, para servir", "45 g / 1½ oz de mantequilla sin sal", "75g / 2¾oz de azúcar en polvo", "50g / 1¾oz de harina blanca lisa", "2 cucharaditas de polvo de hornear", "½ cucharadita de bicarbonato de soda", "sal", "½ cucharadita de canela molida", "¼ cucharadita de clavo de olor molido", "¼ cucharadita de nuez moscada molida", "1 huevo", "60ml / 2fl oz de suero de leche", "150ml / 5fl de leche en oz", "50ml / 2fl oz crema batida", "250 g / 9 oz de chocolate negro, finamente picado o rallado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase una lata de pastel redonda o cuadrada de 23 cm con un poco de mantequilla derretida.", "Vierta la mantequilla derretida en la lata de la torta. Agregue el azúcar impalpable y el azúcar moreno claro y mezcle hasta que los azúcares se mezclen con la mantequilla.", "Pele, reduzca a la mitad y base las peras. Acomódalos atractivamente, con el lado curvo hacia abajo, en la mezcla de mantequilla / azúcar. Coloque las mitades de nuez entre cada mitad de pera.", "Para hacer la masa de esponja, bata la mantequilla y el azúcar hasta que esté suave y esponjosa. Mezcle todos los ingredientes secos.", "Rompa el huevo, revuelva ligeramente y añádalo lentamente a la crema de mantequilla y azúcar. Incorpore cada adición completamente antes de agregar más.", "Con la mano, dobla ligeramente los ingredientes secos hasta que la mezcla esté bien mezclada, pero sin exagerar.", "Vierta la mezcla sobre las peras y hornee en el horno durante 40 minutos, o hasta que la torta esté firme al tacto.", "Retire del horno y deje enfriar al menos diez minutos.", "Afloje la torta de los lados de la lata e inviértala en un plato con borde. La mayoría de los jugos deberían haber sido absorbidos por las peras, pero si queda alguna en la lata, colóquelas sobre la torta.", "Sirva la torta caliente, cortada en porciones individuales y dispuesta en platos calientes con crema batida y / o toffee o salsa de chocolate en el lateral.", "Para hacer una salsa de chocolate, hierva la leche y la crema. Retirar del fuego y dejar enfriar un poco. Agregue el chocolate y revuelva hasta que esté bien mezclado y todo el chocolate se haya derretido.", "Para recalentar la salsa, derrita en un tazón sobre una fuente de agua hirviendo a fuego lento, o aproximadamente a la mitad de potencia en el microondas durante 1-2 minutos."], "url": "www_bbc_co_uk_food_recipes_pearandwalnutupsided_70759", "title": "Pastel de pera y nuez al revés con salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de azúcar en polvo", "2 cucharadas de agua", "1 pera, partida a la mitad y sin corazón, medio restante entero, la otra mitad picada", "4 hojas de verbena de limón, picadas, más extra para decorar", "1 naranja, cáscara y jugo solamente", "85g / 3oz de queso crema", "1 cucharada de azúcar glas", "½ vaina de vainilla, solo semillas"], "method": ["Coloque el azúcar impalpable en una sartén con el agua y caliente suavemente sin remover hasta que el azúcar se disuelva y comience a caramelizar. Agregue la pera picada, las hojas de verbena picadas y un chorrito de jugo de naranja y revuelva.", "Coloque la mitad de la pera, con el lado del corte hacia abajo, en la sartén y deje hervir a fuego lento durante 5-6 minutos.", "En un tazón, mezcle el queso crema, el resto del jugo de naranja y la ralladura, el azúcar glas y las semillas de vainilla.", "Coloque un anillo de chefs en un plato de servir y cuchara en la mitad de la pera picada. Empaque la mezcla de queso crema en la parte superior y luego retire con cuidado el anillo. Coloque la mitad de la pera en la parte superior, espolvoree la pera picada restante y los jugos de la bandeja alrededor del plato y decore con unas pocas hojas de verbena de limón."], "url": "www_bbc_co_uk_food_recipes_pearcheesecake_90021", "title": "Pastel de queso de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pera, pelada, sin corazón y en rodajas", "¼ cebolla roja, finamente rebanada", "1 cucharada de hojas de menta fresca picada", "Brie de 140 g / 5oz, en rodajas"], "method": ["Mezcle los ingredientes en un bol y sirva."], "url": "www_bbc_co_uk_food_recipes_pearcheeseandmintsal_78728", "title": "Ensalada de pera, queso y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60ml / 2¼fl oz de aceite de oliva", "1 cucharadita de romero fresco, finamente picado", "200 g / 7¼ oz de sultanas", "100g / 3½oz de uva", "100g / 3½ oz de azúcar demerara / o azúcar de coco", "Vinagre de sidra 400ml / 14¼ oz", "Jengibre cristalizado 100g / 3½oz, finamente cortado", "800 g / 1 libra de peras de 12¼ oz peladas y cortadas en cuñas", "½ cucharadita de sal marina", "½ cucharadita de nuez moscada, recién rallado", "2 cucharaditas de pimienta de Jamaica", "1 buena pizca de azafrán"], "method": ["Caliente una olla grande con el aceite, agregue el romero, las pasas, las pasas y el azúcar y fríalos hasta que la fruta comience a caramelizar.", "Vierta el vinagre y hierva a fuego alto durante tres minutos. Luego agregue el resto de los ingredientes, lleve a ebullición, luego cocine a fuego lento y cocine hasta que la mayoría del líquido se haya evaporado. Debido a la fruta, este chutney tiene una tendencia a pegarse al fondo de la sartén, por lo tanto agítelo bien y vigílelo. No dejes que las peras se cocinen demasiado; deben mantener su forma.", "Cuchara en tarros limpios y calientes, llenándolos lo más que puedas y sellalos mientras estén calientes. Almacenar en la nevera."], "url": "www_bbc_co_uk_food_recipes_pearchutney_73890", "title": "Chutney de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace aprox. 1 litro", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "1 cebolla, finamente picada", "800g-1kg / 1lb 12oz-2lb 4 oz de calabaza, peladas, sin semillas, cortadas en cubitos", "2 dientes de ajo, finamente picados", "1 litro / 1¾ pinta de caldo de verduras (hecho de un cubo común)", "Cebada perlada 250 g / 9 oz, enjuagada", "2 ramitas de salvia, hojas recogidas y finamente cortadas", "sal y pimienta negra"], "method": ["Caliente una cacerola grande a fuego medio. Agregue 25 g / 1 oz de la mantequilla y, una vez derretida, agregue la cebolla y la calabaza junto con una pizca de sal. Freír suavemente durante 10 minutos o hasta que la cebolla esté transparente y la calabaza se esté ablandando. Agregue el ajo y continúe cocinando por dos minutos, o hasta que esté aromático.", "En una sartén por separado, caliente el caldo y la mitad de las hojas de salvia.", "Agregue 25 g / 1 oz de la mantequilla a la cebolla y la calabaza y, una vez derretida, agregue la cebada perlada. Suba el fuego y cocine por 2-3 minutos. Baje el fuego a medio y agregue un cucharón lleno de caldo caliente. Revuelva bien para mezclar y, una vez absorbido, agregue otro cucharón, revolviendo de vez en cuando. Repita este proceso hasta que la reserva se haya agotado y la cebada perlada esté tierna (aproximadamente 30 minutos).", "Una vez que la cebada esté tierna, pruebe y sazone al gusto con sal y pimienta. Agregue la mantequilla restante a la sartén y revuelva.", "Sirve el risotto guarnecido con el sabio restante."], "url": "www_bbc_co_uk_food_recipes_pearl_barley_butternut_61137", "title": "Cebada perlada, calabaza moscada y risotto de salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pearl_barley_butternut_61137_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 mejillas de res, completamente recortadas", "2 dientes de ajo, aplastados", "1 hoja de laurel", "1 pequeño racimo de tomillo fresco", "500ml / 18fl oz de cerveza con sabor intenso, como Riggwelter", "2 cucharadas de aceite vegetal", "2 litros / 3½ pintas de caldo de carne", "sal marina y pimienta negra recién molida", "2 pequeñas cebollas blancas, peladas", "500ml / 18fl oz de cerveza con sabor intenso, como Riggwelter", "1 limón, cortado por la mitad", "4 palitos de salsifí, frotados", "50g / 1¾oz de mantequilla", "2 dientes de ajo, ligeramente triturados", "200g / 7oz de cebada perlada, empapada en agua fría durante 1 hora y luego escurrida", "1 litro / 1¾ pintas de caldo de pollo", "100g / 3½ oz de perejil fresco de flatleaf, aproximadamente picado", "100ml / 3½ fl oz crema doble", "25 g / 1 oz de queso parmesano, finamente rallado", "sal marina y pimienta negra recién molida", "1 cubo de carne de res, desmenuzado, para servir"], "method": ["Para las mejillas de ternera cocidas con cerveza, coloque las mejillas de res en un tazón grande y luego agregue el ajo, laurel y las ramitas de tomillo y vierta sobre la cerveza para cubrir. Dejar en la nevera para marinar durante al menos 6 horas o durante la noche.", "Una vez macerado, precaliente el horno a 150C / 130C Fan / Gas 2.", "Levanta las mejillas de res del adobo y córtalas a la mitad. (Reserve el adobo).", "Caliente el aceite vegetal en una cazuela a prueba de fuego a fuego medio a alto. Agregue las mejillas de carne marinada y fría por unos minutos en cada lado hasta que se dore por ambos lados. Vierta el adobo reservado en la cazuela, agregue el caldo de carne y lleve la mezcla a fuego lento.", "Cubra la cazuela con papel de aluminio, luego cocine en el horno durante 6 horas, o hasta que las mejillas de la carne estén muy blandas y el volumen del líquido se haya reducido y espesado. Alternativamente, cocine las mejillas de res en la olla de cocción lenta (puesta a fuego lento) durante 12 horas o durante la noche.", "Cuando las mejillas de carne estén cocidas, quítelas de la salsa con una espumadera y déjelas a un lado. Llevar la salsa a ebullición, luego reduzca el fuego hasta que la salsa hierva a fuego lento. Cocine a fuego lento la salsa hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la guarnición, llevar la cebolla y la cerveza a ebullición en una olla pequeña. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 45 minutos, o hasta que las cebollas estén tiernas hasta el final. Coloque la bandeja a un lado para permitir que el contenido se enfríe.", "Prepare agua acidulada llenando un recipiente con agua fría y añadiéndole las mitades de limón.", "Pele el salsifí y corte en bastones de 5cm / 2 in. Agregue cada bastón al agua acidulada enseguida para evitar que se oscurezca.", "Pon a hervir una olla de agua. Escurra el salsifí y los limones, agregue el salsifí al agua hirviendo, luego exprima el jugo de una de las mitades de limón en el agua. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento el salsifí durante 8-10 minutos, o hasta que esté tierno - verifique cuán tierno es al perforarlo con la punta de un cuchillo. Escurrir bien y dejar reposar.", "Para el risotto de cebada perlada, coloque el ajo y la cebada perlada en una cacerola de base pesada y simplemente cúbralo con caldo de pollo. Llevar la mezcla a fuego lento durante 10-12 minutos, o hasta que la cebada perlada esté tierna.", "Mezcle el perejil y 125ml / 4½ fl oz del resto del caldo de pollo en un puré muy fino en un procesador de alimentos; esto llevará un buen tiempo.", "Vierta el puré de perejil en la sartén que contiene la cebada perlada cocida, luego mezcle la crema y el parmesano hasta que se caliente. Sazonar, al gusto, con sal y pimienta negra recién molida, luego cubrir la sartén y retirar del fuego (esto evitará que el perejil pierda su color).", "Para la guarnición, caliente la mantequilla en una sartén a fuego alto hasta que forme espuma. Agregue las cebollas cortadas a la mitad y freír durante 3-4 minutos, o hasta que estén doradas. Agregue el salsifí escaldado y fría por otros 3-4 minutos, o hasta que estén dorados.", "Justo antes de servir, devuelva las mejillas de carne a la salsa y cálida.", "Para servir, vierta un poco del risotto de cebada perlada en el centro de cada plato. Coloque una pieza de carne en la parte superior de cada porción. Agregue una pizca de cubo de caldo de carne a cada mejilla de carne de res. Separe los pétalos de las cebollas y colóquelos alrededor del borde de cada plato. Sirva el salsifí al lado."], "url": "www_bbc_co_uk_food_recipes_pearl_barley_risotto_90820", "title": "Risotto de cebada perlada con mejillas y cebollas de vaca braseadas con cerveza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cebolla pequeña, finamente picada", "150 g / 5½ oz de carne picada de cerdo", "200g / 7oz de cebada perlada", "120 g / 4 oz de espinacas, picadas", "½ vaso de vino blanco", "1 litro / 1¾ pinta de caldo de verduras", "puñado de perejil flatleaf, finamente picado", "sal y pimienta negra recién molida"], "method": ["Caliente una cucharada de aceite en una cacerola grande, agregue la cebolla y el cerdo y cocine, revolviendo, hasta que la cebolla esté suave y el cerdo dorado.", "Agregue la cebada perlada y las espinacas y cocine por un par de minutos.", "Agregue el vino blanco y permita que se evapore.", "Ahora agregue gradualmente el cucharón de reserva por cucharón, esperando hasta que se haya absorbido cada cucharón antes de agregar el siguiente. Continúe hasta que la cebada perlada esté cocida, aproximadamente 30 minutos.", "Retirar del fuego, mezclar el aceite y el perejil restantes y sazonar con sal y pimienta negra. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pearl_barley_with_21752", "title": "Cebada perlada con espinacas y carne picada de cerdo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pearl_barley_with_21752_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más más para lloviznar", "200g / 7oz de cuscús perla grande", "1 cebolla roja, finamente picada", "1 limón, ralladura y jugo", "1 gran manojo de perejil fresco, finamente picado", "1 manojo pequeño de menta fresca, finamente picado", "1 cilantro fresco pequeño, finamente picado", "sal y pimienta negra recién molida", "una pizca de zumaque (opcional)"], "method": ["Ponga una cucharada de aceite en una cacerola y agregue el cuscús. Freír por un par de minutos hasta que el cuscús huela a tostado, luego cubrir generosamente con agua con sal. Llevar a ebullición y cocine a fuego lento durante 6-8 minutos, o hasta que el cuscús esté tierno.", "Usando un colador o colador, escurra el cuscús y transfiéralo a un recipiente. Agregue la cebolla roja, la ralladura de limón y las hierbas. Batir la cucharada restante de aceite con el zumo de limón y sazonar con sal y pimienta. Verter sobre el cuscús y, si se usa, espolvorear el zumaque sobre el cuscús. Mezcle bien y sirva caliente o frío."], "url": "www_bbc_co_uk_food_recipes_pearl_couscous_25307", "title": "Cuscús perla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 galletas de macarrón", "1 naranja, jugo y ralladura", "1 pera, pelada y en rodajas", "3 claras de huevo de gallinas camperas", "75g / 2¾oz de azúcar en polvo", "50g / 1¾oz de chocolate negro, rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los macarrones en una pila en una bandeja para hornear. Espolvoree sobre el jugo de naranja y la ralladura y cubra con la pera en rodajas.", "En un recipiente, mezcle las claras de huevo hasta que estén firmes. Agregue el azúcar impalpable y bata de nuevo hasta que se formen picos rígidos y brillantes al quitar el batidor de la mezcla.", "Vierta la mezcla de huevo sobre la base de macarrón y pera para cubrir completamente. Luego coloque en el horno precalentado para hornear durante tres minutos, o hasta que esté dorado.", "Para servir, colocar en un plato y espolvorear con chocolate rallado."], "url": "www_bbc_co_uk_food_recipes_pearmeringues_80846", "title": "Merengues de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750ml / 1⅓ pintas de sidra de pera", "175g / 6oz de azúcar en polvo de oro", "Jengibre fresco de raíz de 2½ cm / 1 en pieza, pelado y en rodajas", "3 dientes", "1 canela grande", "1 guindilla roja pequeña", "10 vainas de cardamomo", "1 vaina de vainilla, partida por la mitad, semillas raspadas con un cuchillo", "4 peras firmes Williams o Comice, peladas, tallos intactos", "300ml / 10½ fl oz crema batida", "1 cucharadita de cristales de sal marina"], "method": ["Para las peras escalfadas, encuentre una cacerola lo suficientemente grande como para que quepan las cuatro peras cómodamente.", "Agregue la sidra, el azúcar, el jengibre, el clavo de olor, la canela, el chile y el cardamomo a la sartén y deje que hierva, luego retire la sartén del fuego.", "Agregue la vaina de vainilla, las semillas de vainilla y las peras a la sartén, asegurándose de que el líquido cubra las peras por completo.", "Recorta un círculo de papel resistente a la grasa un poco más grande que el diámetro de la sartén. Coloque el círculo sobre las peras, presionándola hacia abajo para que quepa dentro de la sartén.", "Regrese la sartén al fuego y deje que la mezcla hierva a fuego lento. Continúe cocinando a fuego lento durante 35-45 minutos, o hasta que las peras estén tiernas.", "Retire la sartén del fuego y déjela enfriar, luego enfríe las peras, en su jarabe, en el refrigerador, de la noche a la mañana si es posible (se mantendrán durante 1-2 días).", "Cuando esté listo para servir las peras, cuele 200 ml / 7 fl oz del sirope enfriado en una sartén (deseche la vaina de vainilla recogida, las vainas de cardamomo, el jengibre y la rama de canela).", "Ponga a hervir el almíbar, reduzca el fuego hasta que esté hirviendo a fuego lento y continúe cocinando a fuego lento hasta que el líquido se espese a un jarabe espeso y reduzca el volumen a la mitad.", "Agregue la crema batida y cocine para calentar durante 1-2 minutos más. Justo antes de servir, espolvorea sobre los cristales de sal.", "Para servir, retire cuidadosamente las peras del jarabe restante. Corta la parte inferior de cada pera para que cada uno se pueda poner de pie en un plato. Vierta una cucharada de sirope de caza furtiva restante. Rocíe la salsa de caramelo salado."], "url": "www_bbc_co_uk_food_recipes_pears_poached_in_75989", "title": "Peras escalfadas en cardamomo, canela y jarabe de chile con salsa de caramelo salado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pears_poached_in_75989_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de vino tinto", "50g / 1¾oz de azúcar moreno", "2 anís estrellado", "1 pera, pelada", "3 cucharadas de yogur griego, para servir"], "method": ["En una sartén, caliente el vino tinto, el azúcar y el anís estrellado hasta que hierva a fuego lento.", "Agregue la pera y el poach durante 5-10 minutos, volteándolo ocasionalmente, hasta que estén tiernos.", "Para servir, coloque la pera en un tazón con el licor de cocina y el yogur griego junto con la cuchara."], "url": "www_bbc_co_uk_food_recipes_pearspoachedinredwin_84931", "title": "Peras escalfados en vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]