[{"ingredients": ["aceite vegetal, para freír", "Harina normal de 250g / 9oz", "½ cucharadita de pimienta de cayena", "½ cucharadita de pimentón ahumado español (muchos supermercados y delis venden pimentón ahumado español. Si no puede conseguir ninguno, use el pimentón tradicional en su lugar)", "½ cucharadita de sal", "Calamar de 500 g / 1 libra y 2 onzas, cortado en anillos de 5 mm / ¼ in", "2 huevos, golpeados", "200ml / 7fl oz de mayonesa", "1 diente de ajo, aplastado", "½ limón, solo jugo"], "method": ["Para la mayonesa, mezcle todos los ingredientes y reserve.", "Para los calamares, coloque suficiente aceite en un wok, una cacerola grande o una freidora para que quede a medio camino de la sartén. Coloque a fuego medio. Si usa una freidora de grasa o un termómetro, caliente el aceite a 180 ° C / 350 ° F. Si no, para verificar que el aceite esté a la temperatura adecuada, deje caer un cubo de 2-3 cm / ¾-1¼ en el aceite caliente. Debería ponerse dorado y crujiente en 1 minuto.", "Mientras el aceite se calienta, coloque la harina, la cayena, el pimentón y la sal en una bolsa grande para sándwiches. Suelta el calamar y agita para cubrir uniformemente. Esto puede necesitar hacerse en dos lotes, dependiendo del tamaño de la bolsa.", "Sumerja el calamar enharinado en el huevo batido y luego colóquelo cuidadosamente en el aceite caliente. Freír por 2-3 minutos hasta que estén dorados. Retire del aceite y drene brevemente sobre papel de cocina antes de servir con el ajo y la mayonesa de limón."], "url": "www_bbc_co_uk_food_recipes_deepfriedcalamariwit_68061", "title": "Calamares fritos con ajo y mayonesa de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve de 6 a 8 como refrigerio", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deepfriedcalamariwit_68061_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "2 cucharadas de cebolletas frescas picadas", "1 cucharada de semillas de comino", "1 cucharada de cúrcuma molida", "Harina de auto aumento 250g / 9 oz", "300ml / 10fl oz de agua con gas", "1 coliflor, cortada en florecillas, blanqueada y escurrida", "sal, para rociar"], "method": ["Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque el cebollino, las semillas de comino, la cúrcuma y la harina en un tazón y mezcle bien. Poco a poco agregue suficiente agua con gas para que la mezcla suave tenga la consistencia de crema doble.", "Sumerja los floretes de coliflor en la mezcla para cubrir completamente, sacudiendo cualquier exceso.", "Coloque cuidadosamente una coliflor en el aceite caliente. Freír durante unos 4-5 minutos, o hasta que estén ligeramente doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, colocar en un plato de servir y espolvorear con sal."], "url": "www_bbc_co_uk_food_recipes_deepfriedcauliflower_87213", "title": "Coliflor frita con pasta especiada y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 85g / 3oz de levante", "85g / 3oz de harina de maíz", "1 cucharadita de hojuelas de chile", "sal y pimienta negra recién molida", "Filete hoki de 200g / 7oz, cortado en trozos del tamaño de un bocado", "1 clara de huevo de granja, batida", "2 cucharadas de aceite vegetal", "1 lima, solo jugo", "1 cucharada de salsa de soja", "2 cucharadas de ketchup de tomate", "2 cucharadas de pasta de tamarindo", "guión de aceite vegetal", "sal y pimienta negra recién molida", "1 lima, cortada en cuñas", "pequeño cilantro fresco"], "method": ["Para el chili hoki, en un tazón poco profundo mezcle la harina, la harina de maíz, los copos de chile y la sal y la pimienta negra recién molida.", "Sumerja el hoki picado en la clara de huevo batida y luego enrolle la mezcla de harina para cubrir.", "Caliente el aceite vegetal en una sartén antiadherente, agregue el hoki y fría por 1-2 minutos por cada lado, o hasta que se dore.", "Para el ketchup de tamarindo, mezcle todos los ingredientes de salsa de tomate de tamarindo en una sartén pequeña y caliente suavemente durante 1-2 minutos, luego vierta en un bol pequeño.", "Para servir, coloque el chile hoki en un plato y sirva con el ketchup de tamarindo. Adorne con las rodajas de lima y el cilantro."], "url": "www_bbc_co_uk_food_recipes_deepfriedchillihokiw_87091", "title": "Chili hoki con tamarindo ketchup", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10½fl oz de aceite vegetal, para freír", "225g / 8oz de ricotta", "1 ralladura de limón y jugo solamente", "sal y pimienta negra recién molida", "4 flores de calabacín, con los tallos del calabacín del bebé dejados en", "harina común, para quitar el polvo", "Harina normal de 200g / 7oz", "1 cucharadita de bicarbonato de soda", "pizca de sal", "250ml / 9fl oz de agua carbonatada helada", "1 cucharada de menta, finamente picada", "1 limón, solo jugo", "100 ml / 3 fl oz crema fresca", "1 bulbo de hinojo, finamente cortado en una mandolina"], "method": ["Calentar el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para las flores rellenas de calabacín, mezcle la ricota, la ralladura de limón y el jugo en un bol. Sazonar bien con sal y pimienta negra recién molida.", "Con cuidado, cucharee cantidades iguales de la mezcla de ricotta en cada una de las flores de calabacín. Tenga cuidado de no llenar demasiado las flores o no se cerrarán.", "Aprieta suavemente los pétalos de cada flor para formar la mezcla de ricotta.", "Draga cada flor rellena de calabacín en un poco de harina.", "Para la mezcla, mezcle la harina, el bicarbonato de soda y la sal en un tazón limpio.", "Poco a poco agregue el agua, batiendo bien para formar una mezcla.", "Sumerja las flores rellenas de calabacín en la masa y transfiéralas al aceite caliente para freír durante 3-4 minutos, o hasta que estén doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la ensalada, coloque la menta, el jugo de limón y la crème fraîche en un tazón limpio y mezcle bien.", "Agregue el hinojo y revuelva suavemente para cubrir.", "Para servir, coloque la misma cantidad de ensalada de hinojo en cada plato y cubra con una flor de calabacín frita."], "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettefl_89332", "title": "Flores de calabacín fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 filetes de anchoa de buena calidad en aceite de oliva, escurridos, cortados por la mitad a lo largo", "75 g / 2¾oz de mozzarella de búfala, escurrida, cortada en rodajas de 2.5cm / 1pulgada de largo y 1cm / ½pulgada de ancho, luego escurrida en papel de cocina por 20-30 minutos", "sal y pimienta negra recién molida", "6 calabacines bebé, con flores", "aceite de girasol, para freír", "3 cucharadas de harina blanca fuerte", "75g / 2¾oz de harina blanca fuerte", "½ cucharadita de bicarbonato de soda", "2 cucharadas de huevo a campo abierto ligeramente batido", "buena pizca de sal", "125ml / 4fl oz de agua con gas refrigerada o cerveza ligera", "1 limón, cortado en cuñas, para servir"], "method": ["Para el relleno, envuelva una pieza de filete de anchoa en el medio de cada longitud de mozzarella. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Abra la flor de uno de los calabacines en la palma de su mano, teniendo cuidado de no romperla. Retire con cuidado los estambres y el pistilo de cada uno con un cuchillo pequeño. Inserte una pieza de la mozzarella preparada en el interior, luego gire suavemente los pétalos alrededor del relleno. Repite el proceso con los calabacines y el relleno restantes.", "Llene a la mitad una olla grande con aceite de girasol y caliente a 180 ° C (use un termómetro para cocinar para verificar la temperatura).", "Tamizar la harina en un plato o un plato poco profundo y sazonar bien con sal y pimienta negra recién molida. Dejar de lado.", "Para la mezcla, tamice la harina y el bicarbonato de soda en un tazón. Agregue el huevo batido y una pizca de sal. Poco a poco agregue el agua con gas o lager en una corriente delgada, batiendo continuamente con un batidor grande hasta que la mezcla tenga la consistencia de crema doble. (NB: No overwhisk, ya que el aire se escapará de la mezcla).", "Cuando el aceite esté caliente, drague las flores rellenas de calabacín, una a la vez, en la harina sazonada, luego sumérjalas en la masa hasta que estén completamente cubiertas.", "Con cuidado, baje dos de las flores rellenas de calabacín en el aceite caliente y fría por 2-3 minutos, volteándolas cuidadosamente una o dos veces, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repita el proceso con las flores de calabacín rellenas restantes. Mantener caliente", "Para servir, amontonar las flores de calabacín rellenas en el centro de un plato para servir, exprimir el jugo de las rodajas de limón y sazonar, al gusto, con sal."], "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettefl_91863", "title": "Flores de calabacín fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 cucharadas de piñones", "1 diente de ajo, pelado", "gran puñado de cohetes", "sal y pimienta negra recién molida", "500ml / 18fl oz de aceite vegetal, para freír", "6 hongos castaños, tallos eliminados", "12 x 8 cm / 3½ pulgadas cuadrados de pasta de filo prefabricada", "1 huevo de gallinas camperas, golpeado"], "method": ["Para el pesto de rúcula, coloque todos los ingredientes del pesto en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para los champiñones, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque una cucharadita del pesto de rúcula en la tapa de cada hongo. Te sobrará algo.", "Coloque la mitad de los cuadrados de filo sobre una superficie plana y cepille los bordes de cada casilla con huevo batido. Coloque un hongo de peluche en el medio de cada cuadrado y frote entre los bordes para sellar, cepillando con más huevo batido.", "Con los cuadrados de filo restantes, envuelva cada seta en otra pieza de masa cepillada con huevo batido.", "Con cuidado, coloque los champiñones envueltos en aceite caliente y fríalos durante 4-5 minutos o hasta que estén dorados. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, coloque los champiñones en un plato para servir y rocíe sobre el pesto restante del cohete."], "url": "www_bbc_co_uk_food_recipes_deepfriedfilomushroo_85295", "title": "Champiñones fritos con pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 queso de cabra Crottin (o 1 x 200 g / 7 oz)", "4 hojas de pasteles de primavera roll - 20cm / 8in cuadrado", "poco lavado de huevo batido", "2 cebollas rojas, finamente cortadas", "1 cucharada de azúcar moreno", "2 cucharadas de aceite de oliva virgen", "2 cucharadas de vinagre de vino tinto", "150ml / 5fl oz de vino tinto", "½ cucharadita de hojas de tomillo recién recogidas o romero", "aceite vegetal para freír", "1 apio en barra, pelado y en rodajas finas", "1 aguacate, cortado en grandes cuñas", "1 pera madura pero firme, en rodajas", "2 manojos de berro", "4 cos gem de lechuga, separadas en hojas", "Hojas de cohete de 150g / 5oz", "1 cucharada de vinagre balsámico", "6 cucharadas de aceite de maní o aceite vegetal", "½ cucharadita de mostaza dijon", "1 cucharada de nueces a la mitad", "¼ cucharadita de miel"], "method": ["Primero, haga la mermelada de cebolla dulce. Calentar el aceite en una sartén, agregar las cebollas y freír durante 1 minuto. Agregue el azúcar y la carameliza ligeramente juntos.", "Vierta sobre el vinagre y el vino tinto, agregue el tomillo y deje cocer a fuego lento hasta que se reduzca y tenga una consistencia de mermelada, unos 25 minutos (esto puede prepararse con bastante anticipación). Enfriar hasta que esté listo para usar.", "Coloque las hojas de hojaldre y cepíllelas generosamente por todas partes con eggwash. Coloque una cucharada de mermelada de cebolla en el centro de cada hoja, luego cubra con queso de cabra. Envuelva de manera segura para encerrar el queso dentro utilizando eggwash como pegamento.", "Caliente el aceite vegetal en una sartén grande a 170 ° C / 325 ° F - también podría hornearlos en el horno si quisiera.", "Mientras tanto, para la ensalada, coloque las tres hojas de ensalada en un tazón. Cubra con el aguacate, la pera fresca y el apio y sazone ligeramente.", "Prepare un aderezo con mostaza, miel, vinagre balsámico, aceite, sal y pimienta. Vierta sobre la ensalada, agregue las nueces y viértalas en un plato para servir (ya sea individual o en un plato grande).", "Freír los paquetes de queso de las cabras durante 1-2 minutos hasta que estén dorados y crujientes, retirar y escurrir sobre papel de cocina y vestir la ensalada. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_deepfriedgoatscheese_14412", "title": "Queso de cabra frito con ensalada de peras y berros de invierno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Goteo de carne o aceite para freír (el goteo de carne se usa en el método tradicional y le da un mejor sabor, pero el aceite de girasol o vegetal también funciona)", "Filetes de bacalao o eglefino de 4x175g / 6oz de espesor, tomados del extremo de la cabeza en lugar de la cola del pescado", "225g / 8oz de harina autoacabada, más extra para quitar el polvo", "sal y pimienta negra recién molida", "Lager de 300ml / 10fl oz nevera-frío", "6-8 papas grandes y harinosas, como maris piper, king edward, desiree (dependiendo de lo hambriento que estés)"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2 y precaliente el goteo o aceite a 120 ° C / 250 ° F.", "Para las patatas fritas, pele las papas y corte en el tamaño que prefiera. Lave bien en agua fría, escurra y seque con una toalla de té limpia. Coloque las papas en la freidora y déjelas freír suavemente durante unos 8-10 minutos, hasta que estén blandas pero pálidas. Verifique que estén cocidos perforando con un cuchillo pequeño y afilado. Levante de la sartén y déjela enfriar levemente en papel resistente a las grasas.", "Aumente el calor de la freidora a 180C / 350F.", "Sazone el pescado y el polvo ligeramente con harina; esto permite que el bateador se adhiera al pez.", "Para hacer la mezcla, tamice la harina y una pizca de sal en un tazón grande y bata en la cerveza para dar una masa espesa, agregando un poco de cerveza extra si parece demasiado grueso. Debe ser la consistencia de una crema doble muy espesa y debe cubrir la parte posterior de una cuchara de madera. Sazonar con sal y cubrir grueso 2 de los filetes con la mezcla. Coloque con cuidado la grasa caliente y cocine durante 8-10 minutos hasta que estén dorados y crujientes. Retire de la sartén, escurra y siéntese en una bandeja para hornear forrada con papel resistente a la grasa, luego mantenga caliente en el horno mientras cocina los 2 filetes restantes de la misma manera.", "Una vez que el pescado esté cocido, devuelva las papas fritas a la freidora y cocine por 2-3 minutos o hasta que estén doradas y crujientes. Sacuda el exceso de grasa y sazone con sal antes de servir con el pescado crujiente. Si le gusta, puede servir con guisantes blandos en lata y pan y mantequilla, ¡para la experiencia auténtica!"], "url": "www_bbc_co_uk_food_recipes_deepfriedfishinbeerb_67776", "title": "Pescado y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deepfriedfishinbeerb_67776_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "pizca de copos de chile seco", "400g / 14oz de tomates enlatados", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida", "puñado de albahaca fresca", "puñado de perejil fresco", "2 cucharadas de queso cheddar rallado", "400ml / 14fl oz de aceite vegetal, para freír", "1 calabacín, cortado en 4 tiras largas", "100ml / 3½ fl oz de leche", "75g / 3oz de harina criada, condimentada con sal y pimienta negra recién molida"], "method": ["Para la salsa de tomate, caliente el aceite de oliva en una cacerola a fuego medio. Agregue la cebolla y fría por tres minutos, o hasta que se ablanden.", "Agregue las hojuelas de chile, los tomates, el vinagre balsámico y sazone con sal y pimienta negra recién molida. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Agregue el perejil y la albahaca y mezcle bien, luego vierta la salsa en un tazón.", "Espolvorear con el queso cheddar.", "Para los calabacines fritos, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerge los calabacines primero en la leche y luego draga en la harina. Repita este proceso con la leche y la harina, luego coloque cuidadosamente los calabacines en el aceite caliente y fría por tres minutos, o hasta que estén dorados. Con cuidado, retire los calabacines con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, coloque los calabacines en un plato caliente, espolvoree sal y sirva la salsa de tomate al lado."], "url": "www_bbc_co_uk_food_recipes_deepfriedcourgettesw_84659", "title": "Calabacines fritos con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cebolla mediana, finamente picada", "1 diente de ajo, finamente picado", "1,5 kg / 3 lb tomates 4 oz, picados", "8 hojas frescas de albahaca", "50g / 2oz de hojas de cohete", "sal y pimienta negra recién molida", "8 rebanadas finas de pan blanco", "125ml / 4½ fl oz de leche", "200 g / 7 oz de mozzarella de búfala, cortado en discos de 1 cm / ½ pulgada de espesor", "sal y pimienta negra recién molida", "6 cucharadas de harina común", "2 huevos medianos de granja, batidos y sazonados con sal y pimienta negra recién molida"], "method": ["Para la salsa, caliente el aceite de oliva en una sartén y, una vez caliente, agregue la cebolla y el ajo y fría durante 4-5 minutos, hasta que estén suaves y dorados.", "Agregue los tomates, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Agregue las hojas de albahaca y el cohete, revuelva y cocine a fuego lento durante otros 10-15 minutos.", "Sazone con sal y pimienta negra recién molida y, utilizando una batidora de mano, mezcle con una salsa. Pase la salsa a través de un colador en un recipiente y reserve.", "Para la mozzarella frita, caliente una freidora a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión)", "Corta las cortezas del pan y córtalas en discos un poco más grandes que las rebanadas de mozzarella.", "Sumerja las rebanadas del pan en un lado en la leche y luego coloque una rodaja de la mozzarella en el lado seco.", "Sazonar la mozzarella con sal y pimienta negra recién molida y hacer un sándwich con la otra rebanada de pan, con el lado empapado en leche en el exterior. Presione hacia abajo alrededor de los bordes para sellar el emparedado.", "Dragar el sándwich con la harina y sumergirlo en el huevo batido para remojarlo.", "Coloque con cuidado el sándwich en la freidora y fríalos hasta que estén dorados y crujientes por fuera. Retire con cuidado con una cuchara ranurada y escurra sobre toallas de papel.", "Para servir, vierta la salsa picante en un plato y coloque dos de los sándwiches de mozzarella en el centro."], "url": "www_bbc_co_uk_food_recipes_deepfriedmozzarellaw_83815", "title": "Mozzarella frita con salsa de tomate y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal, para freír", "Harina normal de 75 g / 2½ oz", "Harina de auto crianza de 75g / 2½ oz", "sal y pimienta negra recién molida", "100 ml / 3½ fl oz de agua con gas", "1 cebolla roja, pelada, cortada en anillas gruesas", "1 cucharada de mostaza integral", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de vino blanco", "100ml / 3½fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "100g / 3½oz de berro"], "method": ["Para los aros de cebolla, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los dos tipos de harina en un tazón grande, sazone bien con sal y pimienta negra recién molida y mezcle con suficiente agua con gas para que el batido tenga la consistencia de una crema individual; puede que no lo necesite todo.", "Sumerja los aros de cebolla en la mezcla y colóquelos cuidadosamente en el aceite caliente para freír durante 4-5 minutos, o hasta que se doren. Retire los aros de cebolla del aceite con una espumadera y escurra sobre papel de cocina.", "Para la ensalada, coloque las mostazas, el vinagre y el aceite de oliva en un tazón grande, sazone bien con sal y pimienta negra recién molida y mezcle bien. Agregue el berro al recipiente y revuelva para cubrir.", "Para servir, coloque la ensalada en un plato grande con los aros de cebolla en la parte superior."], "url": "www_bbc_co_uk_food_recipes_deepfriedonionringsw_84753", "title": "Anillos de cebolla fritos con ensalada de mostaza y berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "150g / 5½ oz de harina de auto crianza", "100ml / 3½oz de agua con gas", "sal y pimienta negra recién molida", "10 gambas de tigre crudas, peladas, con las colas a la izquierda", "50g / 1¾oz de harina natural", "50 g / 1¾oz de queso parmesano, rallado", "2 dientes de ajo, pelados", "2 puñados grandes de hojas frescas de albahaca", "75g / 2½oz de piñones", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "½ cucharadita de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "1 diente de ajo, aplastado", "sal y pimienta negra recién molida", "200ml / 7fl oz de aceite vegetal", "2 cebollas tiernas, finamente picadas", "pellizque el azafrán, empapado en 1 cucharada de agua tibia", "1 cucharada de perejil fresco picado", "1 limón, cortado en cuñas, para servir"], "method": ["Para los langostinos, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina autoreflectante de 150 g / 5½ oz y el agua con gas en un tazón. Sazonar con sal y pimienta negra recién molida y mezclar para hacer una mezcla con la consistencia de crema doble.", "Coloque la harina normal de 50g / 1¾oz en un plato poco profundo. Enrolle los langostinos en la harina común, sacuda el exceso y sumérjalos en la masa. Con cuidado, coloque las gambas en el aceite caliente y fría durante 6-8 minutos, o hasta que estén doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para el pesto, coloque todos los ingredientes del pesto en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para la mayonesa de azafrán, coloque el huevo y la yema de huevo, el vinagre, la mostaza y el ajo en un tazón. Sazonar con sal y pimienta negra recién molida y mezclar bien.", "Vierta el aceite vegetal en un chorrito muy lento, batiendo vigorosamente hasta que todo el aceite se haya incorporado y la mezcla esté espesa.", "Agregue las cebollas picadas de primavera, el azafrán, junto con su líquido de remojo, y el perejil y el gusto para comprobar el condimento.", "Para servir, coloque las gambas fritas en un plato grande con el pesto y la mayonesa de azafrán en tazones pequeños al costado y las rodajas de limón, para adornar."], "url": "www_bbc_co_uk_food_recipes_deepfriedprawnswithp_85133", "title": "Gambas fritas con mayonesa de pesto y azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Aceite vegetal 300ml / ½pt para freír", "1 único filete, pelado", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "pizca de cúrcuma", "agua gaseosa fría", "sal y pimienta negra recién molida", "300ml / ½ pinta de aceite vegetal para freír", "Fideos de arroz 100 g / 3½ oz", "55 g / 2 oz de mantequilla", "½ limón, solo jugo", "pequeño puñado de perejil fresco, picado", "sal y pimienta negra recién molida", "cuñas de limón, para adornar"], "method": ["Para la lengua frita, vierta el aceite vegetal en una olla grande o freidora y caliente hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para la mezcla, coloque la harina en un tazón grande y bata gradualmente con suficiente agua fría con gas para hacer que la mezcla tenga la consistencia de la crema doble. Sumerja la planta en una pequeña harina y sacuda el exceso y luego sumérjalos en la masa. Luego, vierta suavemente el pescado regado en el aceite caliente. Freír a fuego lento durante cinco minutos o hasta que estén crujientes y doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Para obtener los fideos crujientes, vierta cuidadosamente los fideos de arroz en el aceite caliente y fríalos durante un minuto o hasta que se hinchen. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa de mantequilla marrón, derrita la mantequilla en una cacerola y caliente hasta que se ponga dorado. Agregue el jugo de limón y el perejil, y sazone al gusto con sal y pimienta negra recién molida. Cocine por un minuto más.", "Para servir, apile los fideos crujientes en un plato para servir, cubra con la lengua frita y vierta sobre la salsa de mantequilla marrón y adorne con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_deepfriedsolewithcri_88041", "title": "Lenguado frito con fideos crujientes y salsa de mantequilla marrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz", "1 cucharadita de hojuelas de chile seco", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida", "150ml / 5½fl oz de agua fría y brillante", "300ml / 10½fl oz de aceite vegetal, para freír", "5 gambas de tigre crudas, peladas, desveladas", "Fideos de arroz 150 g / 5½ oz", "1 cucharada de salsa de soja", "lanzar aceite de sésamo", "1 cucharada de semillas de sésamo, tostadas", "pequeño puñado de hojas de cilantro fresco picado", "sal y pimienta negra recién molida", "rodajas de limón"], "method": ["Para los langostinos fritos, coloque la harina, los copos de chile, el cebollín, la sal y la pimienta negra recién molida en un tazón grande y luego bata gradualmente con agua fría y chispeante hasta que la mezcla esté suave y tenga la consistencia de crema doble. (Puede que no necesite toda el agua).", "Vierta el aceite vegetal en una cacerola y caliente hasta que un pequeño cubo de pan caiga en chispas y se vuelva dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las gambas en la mezcla y luego con cuidado en el aceite caliente. Freír por 2-3 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para la ensalada de fideos, cocine los fideos de arroz en agua hirviendo de acuerdo con las instrucciones del paquete, luego drene y refresque con agua corriente fría. Transfiera a un tazón, luego mezcle la salsa de soja, el aceite de sésamo, las semillas de sésamo y el cilantro. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, amontone la ensalada de fideos en un plato de servir y cubra con los langostinos fritos. Adorne con cuñas de lima y sirva."], "url": "www_bbc_co_uk_food_recipes_deepfriedprawnswiths_89052", "title": "Gambas fritas con ensalada de fideos de soja y sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 2¾ de harina que se levanta solo", "sal", "1 cucharada de salsa de pescado", "pizca de pimienta blanca", "dash vino blanco", "6floz / 170ml de agua", "aceite limpio fresco para freír", "1 zanahoria pequeña", "¼ berenjena", "¼ de pimienta verde", "¼ de pimiento rojo", "¼ de naranja", "¼ batata", "4 floretes de brócoli", "Coliflor de 4 flores", "½ cebolla rebanada", "1 cebolla de primavera", "1 puñado de anacardos, aplastados", "1 chile rojo, picado fino", "1 diente de ajo, picado fino", "100 ml / 3½ de salsa de ciruela", "1 lima, solo jugo", "lanzar aceite de sésamo"], "method": ["Mezcle la harina, la sal, la salsa de pescado, la pimienta blanca, el vino blanco y el agua para hacer un buen batido suave.", "Corta todas las verduras en tiras finas.", "Lave todas las verduras y seque para evitar salpicaduras.", "Mezcle bien con la mezcla.", "Pon el aceite en un wok o sartén y deja que esté caliente.", "Freír las verduras mixtas durante 3-4 minutos o hasta que estén doradas.", "Retire en un plato.", "Para hacer la salsa, mezcle todos los ingredientes en el tercer grupo excepto los anacardos.", "Vierta la salsa encima de las verduras, espolvoree con anacardos triturados en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_deepfriedvegetablesw_70708", "title": "Verduras fritas con anacardos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, ablandada, más extra para engrasar", "225 g / 8 oz de azúcar en polvo, más extra para rociar", "4 huevos de gallinas camperas", "220g / 7¾oz de harina de auto crianza", "2 cucharaditas de polvo de hornear", "50 g / 1¾oz de cacao en polvo", "4 cucharadas de conserva de albaricoque", "300 ml / 10½ fl oz de crema batida, suavemente batida"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Ligeramente unte con mantequilla dos latas de sándwich de 20 cm / 8 in de fondo suelto y forre las bases con papel de hornear.", "Coloque la mantequilla, el azúcar, los huevos, la harina, el polvo de hornear y el cacao en un tazón grande y bata durante 2 minutos, o hasta que se haya mezclado por completo. (Un mezclador eléctrico es mejor para esto, pero también puede batirlo a mano con una cuchara de madera).", "Divida la mezcla de manera uniforme entre las latas. Nivele la superficie con una espátula o la parte posterior de una cuchara.", "Hornea por 25-30 minutos. La parte superior de los pasteles debe retroceder cuando se presiona ligeramente con un dedo. Deje los pasteles para enfriar en las latas durante 5 minutos. Pase una pequeña espátula alrededor del borde de las latas, luego cuidadosamente gire las tortas sobre una rejilla de alambre. Despegue el papel y deje que se enfríe por completo.", "Elija la torta con la mejor tapa, luego coloque la otra torta de arriba hacia abajo en un plato de servir. Extiéndalo con la mermelada y la crema batida, coloque la otra torta en la parte superior (hacia arriba) y espolvoree con azúcar en polvo para servir."], "url": "www_bbc_co_uk_food_recipes_definitivechocolatec_72226", "title": "Pastel de chocolate definitivo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/definitivechocolatec_72226_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, ablandada, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "220g / 7¾oz de harina de auto crianza", "Polvo de hornear 2 cucharaditas de nivel", "1 naranja, ralladura fina solamente", "75g / 2¾oz de mantequilla sin sal, ablandada", "250 g / 9 oz de azúcar glas, cernida", "1 naranja, ralladura finamente rallada y 2 cucharadas de jugo", "espirales naranjas zests"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Ligeramente unte con mantequilla dos latas de sándwich de 20 cm / 8 in de fondo suelto y forre las bases con papel de hornear.", "Coloque la mantequilla, el azúcar, los huevos, la harina, el polvo de hornear y la ralladura de naranja en un tazón grande para mezclar y bata durante 2 minutos, o hasta que se haya mezclado por completo. (Una batidora eléctrica es la mejor para esto, pero puede batir a mano con una cuchara de madera).", "Divida la mezcla de manera uniforme entre las latas. Nivele la superficie con una espátula o la parte posterior de una cuchara.", "Hornee por 25 minutos o hasta que esté bien dorado. La parte superior de los pasteles debe retroceder cuando se presiona ligeramente con un dedo. Deje que las tortas se enfríen en las latas durante 5 minutos, luego coloque una pequeña espátula o un cuchillo de mantequilla redondo alrededor del borde de las latas y con cuidado pase las tortas a una rejilla. Despegue el papel y deje que se enfríe por completo.", "Elija la torta con la mejor tapa, luego coloque la otra torta de arriba hacia abajo en un plato de servir.", "Batir los ingredientes de relleno y extender en un lado del pastel, poner el otro pastel en la parte superior (hacia arriba) y extender el resto de la crema de naranja en la parte superior. Decorar con zests de naranja en espiral."], "url": "www_bbc_co_uk_food_recipes_definitiveorangecake_72228", "title": "Pastel de naranja definitivo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/definitiveorangecake_72228_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina", "2 huevos de gallinas camperas", "gran pizca de sal", "Leche 250ml / 9fl oz", "50g / 1¾oz de mantequilla derretida", "3 yemas de huevo de gallinas camperas", "250 g / 9oz de mantequilla sin sal, derretida", "½ limón, solo jugo", "sal y pimienta negra recién molida", "8 rodajas de jamón de Parma", "16 lanzas de espárragos"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y precaliente la parrilla a alto.", "Para la masa de panqueque, coloque los huevos en un recipiente para mezclar y bata la harina. Agregue la sal y la mitad de la leche. Finalmente, mezcle la mantequilla y la leche restante para obtener una consistencia cremosa fina y espesa. Enfriar en la nevera durante 30 minutos.", "Derrita un pequeño botón de mantequilla en una sartén antiadherente de 20 cm / 8 in. Una vez que esté caliente y chisporroteante vierta suficiente masa para cubrir ligeramente la base de la sartén. Después de 30 segundos, puede levantar el borde con una espátula para ver si está teñida de oro como debería ser. Dale la vuelta al panqueque, cocina el otro lado durante unos segundos y luego deslízalo fuera de la sartén sobre un plato.", "Sin engrasar la sartén nuevamente, repita el proceso en la etapa tres para hacer ocho panqueques delgados.", "Para la salsa holandesa, mezcle las yemas de huevo con una cucharada de agua en una cacerola de acero inoxidable a fuego muy lento, hasta que estén gruesas y suaves.", "Retire la sartén del fuego y continúe batiendo mientras agrega la mantequilla derretida en una corriente delgada, dejando atrás el residuo lechoso que se ha asentado en el fondo de la fuente de mantequilla. Sazonar la salsa con sal y pimienta negra recién molida y afilar con jugo de limón, al gusto. Mantener caliente", "Hervir los espárragos en agua con sal hasta que estén tiernos. Una vez cocinado, refresca los espárragos en un recipiente con agua helada. Drene y seque.", "Para armar los délices, coloque una loncha de jamón encima de un panqueque, luego coloque tres lanzas de espárragos sobre él. Enróllalo y colócalo en una fuente para horno ligeramente untada con mantequilla. Repita con los panqueques restantes, jamón de Parma y espárragos. Hornee en el horno por unos 20 minutos o hasta que comience a crujir en los bordes.", "Sirva los délices en un plato para servir y cúbralos cuidadosamente con una cucharada de salsa holandesa, y páselos a lo largo. Destelle brevemente los restos bajo la parrilla hasta que el calor los dore."], "url": "www_bbc_co_uk_food_recipes_deilces_dargenteuil_18036", "title": "Panqueques con jamón de Parma y espárragos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deilces_dargenteuil_18036_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla o margarina, ablandada", "225 g / 8 oz de azúcar en polvo", "4 huevos", "Harina de levante 225g / 8oz", "2 cucharaditas de polvo de hornear", "4 cucharadas de mermelada de fresa o frambuesa", "un poco de azúcar en polvo", "2 latas de sándwich de 20 cm / 8 in de fondo suelto, 4 cm de profundidad"], "method": ["Engrase ligeramente las latas y forre las bases con papel para hornear antiadherente. Precaliente el horno a 180C / 350F / Gas 4.", "Mida la mantequilla o la margarina, el azúcar, los huevos, la harina y el polvo de hornear en un tazón grande y bata durante unos dos minutos, hasta que se mezcle; un mezclador eléctrico es lo mejor para esto, pero por supuesto también puede batir a mano con una cuchara de madera.", "Divida la mezcla de manera uniforme entre las latas preparadas y nivele la superficie con el dorso de una cuchara o una espátula de plástico.", "Hornee durante unos 25 minutos, hasta que estén bien dorados. La parte superior de los pasteles debe retroceder cuando se presiona ligeramente con un dedo. Deje que los pasteles se enfríen en las latas durante unos minutos, luego pase una pequeña espátula o un cuchillo sin filo alrededor del borde de las latas para cargar los lados de los pasteles. Coloque las tortas en una rejilla de alambre, retire el papel y deje que se enfríe por completo.", "Elija la torta con la mejor tapa, luego coloque la otra torta hacia abajo en un plato de servir. Extienda con la mermelada, coloque la otra torta en la parte superior (arriba hacia arriba) y espolvoree con azúcar impalpable para servir."], "url": "www_bbc_co_uk_food_recipes_definitivevictoriasa_72222", "title": "Sándwich victoriano definitivo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["190g / 7 oz de azúcar", "165ml / 5½fl oz de agua", "1 cucharada de glucosa líquida", "350 g / 12 oz de grosellas negras", "50 ml / 2 fl oz sorbete de jarabe (ver arriba)", "60g / 2½ oz de azúcar", "5 cucharaditas de agua", "1 huevo blanco de corral", "4½ hojas de gelatina", "agua fría, para remojar", "puré de grosella negra (ver arriba)", "12 g / ½ oz de leche en polvo", "½ vaina de vainilla", "3 yemas de huevo medianas de campo abierto", "25 g / 1 oz de azúcar en polvo", "Merengue italiano (ver arriba)", "200ml / 7fl oz crème de cassis", "Crema doble de 400 ml / 14 fl oz, ligeramente batida hasta que se formen las cintas", "½ base de flan de esponja redonda lista para usar, cortado horizontalmente", "50 ml / 2 fl oz sorbete de jarabe (ver arriba)", "1 cucharada de puré de grosella negra (ver arriba)", "3 hojas de gelatina", "agua fría, para remojar", "50 ml / 2 fl oz sorbete de jarabe (ver arriba)", "3 cucharadas de puré de grosella negra (ver arriba)"], "method": ["Para el jarabe, coloque todos los ingredientes de jarabe en una sartén y deje que hierva, revolviendo ocasionalmente con una cuchara de madera. Hierva por unos 2-3 minutos, rozando la superficie si es necesario. Pase el jarabe a través de un colador cónico y deje hasta que esté completamente frío antes de usar. Lo que no usas para esta receta puede almacenarse durante varios meses.", "Para el puré de grosella negra, coloque las grosellas negras en una licuadora con el jarabe y mezcle hasta que quede suave. Pase la mezcla a través de un colador cónico en un recipiente.", "Para el merengue italiano, coloque el azúcar y el agua en una sartén y lentamente hierva hasta que el almíbar alcance los 110 ° C / 230 ° F en un termómetro de azúcar.", "En esta etapa, coloque las claras de huevo en el cuenco de un batidor eléctrico y bata hasta que se formen picos firmes cuando se quite el batidor.", "Tan pronto como el azúcar alcance 121C / 250F, retire la sartén del fuego. Inmediatamente reanude batiendo las claras de huevo. Con el batidor a su velocidad más baja, vierta el azúcar derretido, en un flujo constante, asegurándose de que esté limpio de los batidores. Continúa latiendo durante unos cinco minutos, hasta que el merengue esté tibia.", "Para la mousse de grosella negra, remoje las hojas de gelatina en agua fría durante 15 minutos, luego drene.", "Reserve cuatro cucharadas de puré de grosella negra y coloque el resto en una sartén. Agregue la leche en polvo y la vaina de vainilla y deje que hierva.", "Coloque las yemas de huevo y el azúcar en un bol y bata hasta que la mezcla forme una cinta cuando se quite el batidor. Vierta la mezcla de grosella negra en la mezcla de huevo, batiendo continuamente, luego vierta esta mezcla de crema en la sartén. Calentar suavemente, revolviendo continuamente con una espátula, hasta que la crema esté lo suficientemente espesa para cubrir la espátula. No permita que hierva.", "Retire la sartén del fuego y mezcle la gelatina drenada con la crema pastelera. Deseche la vaina de vainilla, luego pase la crema a través de un colador cónico en un recipiente y deje que se enfríe, revolviendo ocasionalmente para evitar que se forme la piel.", "Para la base, coloque la base del flan de esponja en un tablero. Mezcle 50ml / 2fl oz del jarabe y una cucharada de puré de grosella negra reservada y cepille esta mezcla sobre la esponja. Coloque un anillo para flan de 25 cm / 10 pulgadas (6 cm / 2½ pulgadas de profundidad) sobre la esponja y recorte un círculo para formar la base.", "Cuando la crema esté tibio, doble suavemente la mitad del merengue italiano; puede usar el resto en otra receta. Agregue la crema de cassis, luego agregue la crema batida. Ahora debe armar el postre inmediatamente, antes de que la gelatina haga que la mezcla se solidifique.", "Llene el anillo de flan con la mezcla de mousse de grosella negra, dejando un pequeño espacio en la parte superior, y cuidadosamente alise la superficie con una espátula. Coloque en el congelador o en una nevera muy fría durante varias horas.", "Para el glaseado, remoje las hojas de gelatina en agua fría durante 15 minutos, luego drene bien. Coloque 50ml / 2fl oz del jarabe y las tres cucharadas restantes de puré de grosella negra en una sartén y caliente suavemente, luego retírelo del fuego y agregue la gelatina. Dejar enfriar, luego extender el glaseado sobre la parte superior de la mousse. Coloque en la nevera para enfriar antes de servir.", "Para servir, quite el anillo agrio calentando la parte exterior del anillo con un soplete durante unos segundos, luego deslice el anillo hacia arriba, girándolo ligeramente."], "url": "www_bbc_co_uk_food_recipes_deliceaucassis_86299", "title": "Delice con grosella negra", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]