[{"ingredients": ["4-6 calabacines firmes jóvenes", "1 achicoria de cabeza mediana", "4 tomates medianos", "Queso de cabra inglés firme 125g / 4oz", "2 cucharadas de piñones tostados", "4 cucharadas de aceite de oliva", "1 cucharada de jugo de limón", "algunas hojas de menta fresca, picadas", "unas ramitas de orégano fresco, picado (opcional)", "sal y pimienta negra"], "method": ["Lave, seque y corte todas las verduras en trozos de buen tamaño. Cortar el queso de cabra en trozos más pequeños.", "Agite los ingredientes para el aderezo en un frasco y vierta sobre los vegetales. Mezcle bien. Espolvorea sobre los piñones y sirve."], "url": "www_bbc_co_uk_food_recipes_courgetteandgoatsche_13775", "title": "Ensalada de calabacín y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla roja, pelada y cortada en cubitos", "1 cebolla blanca, cortada en cubitos", "1-2 dientes de ajo, cortados en cubitos", "1 calabacín, cortado en cubitos", "1 berenjena, cortada en cubitos", "1 x 400g / 14oz de tomates enlatados", "8 flores de calabacín", "100 g / 3½ oz de harina", "2 huevos, golpeados", "Ingredientes para el puré de guisantes", "sal y pimienta para probar", "Guisantes 400 g / 14 oz", "2 ramitas de menta fresca, solo hojas", "1 brotes de guisantes", "100 g / 3½ oz de queso manchego, cortado en cubos pequeños", "50ml / 1¾dfl oz de aceite de menta"], "method": ["Para el pistou, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue todas las verduras y los tomates enlatados y cocine a fuego medio hasta que los sabores se mezclen, esto llevará de 8 a 12 minutos. Permitir que se enfríe", "Caliente una freidora a 180C / 350F (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Enrolla las flores en harina y luego sumérgelas en el huevo batido. Freír las flores por un par de minutos hasta que estén crujientes. Retire con cuidado de la freidora y drene en un plato forrado con rollo de cocina.", "Para el puré de guisantes, caliente una olla grande de agua hirviendo y sazone con sal. Blanquee los guisantes y luego drene y deje enfriar.", "Coloque los guisantes y las hojas de menta en una licuadora y mezcle para hacer un puré. Sazonar con sal y pimienta al gusto.", "Para servir, coloque el puré de guisantes en el plato junto con las flores de calabacín. Cubra con los brotes de guisantes y queso manchego y rocíe con el aceite de menta."], "url": "www_bbc_co_uk_food_recipes_courgette_flowers_55960", "title": "Flores de calabacín rellenas de pistou, puré de guisantes y queso manchego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 calabacines, cortados en cintas con un pelador de verduras", "2 cucharaditas de aceite vegetal", "sal pimienta negra recién molida", "150ml / 5fl oz de agua", "2 cucharadas de miel clara", "2 zanahorias, en rodajas", "4 tomates de ciruela", "½ pepino", "2 cebollas tiernas, finamente picadas", "1 lechuga Cos, rallada", "1 cucharada de semillas de girasol", "100ml / 3½fl oz de aceite de oliva virgen extra", "2 limones, solo jugo", "2 cucharadas de aceite de trufa"], "method": ["Para los calabacines, coloque las cintas de calabacín en un bol, mezcle con el aceite y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén hasta que fume. Agregue las cintas de calabacín en lotes y la plancha por un minuto en cada lado, o hasta que las marcas de la plancha marrón se formen en ambos lados. Retire de la plancha y reserve.", "Para las zanahorias, coloque el agua y la miel en una sartén a fuego alto y deje que hierva.", "Agregue las zanahorias y cocine por 2-3 minutos.", "Para la ensalada, corte los tomates, el pepino, las cebolletas y la lechuga y colóquelos en un tazón.", "Espolvorea la ensalada con semillas de girasol.", "Para el aderezo, mezcle el aceite de oliva, el jugo de limón y el aceite de trufa en un tazón limpio.", "Para servir, agregue las zanahorias y las cintas de calabacín a la parrilla al resto de la ensalada y sirva en la mesa."], "url": "www_bbc_co_uk_food_recipes_courgetteandcarrotsa_89168", "title": "Ensalada de calabacín y zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "1 cebolla, finamente picada", "½ calabacín, picado", "Arroz risotto 225g / 8oz (como arborio o canaroli)", "425 ml / ¾ de litro de caldo de verduras calientes", "30 g / 1 oz de parmesano recién rallado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "1 calamar pequeño, limpio, ligeramente rayado con un cuchillo afilado", "1 limón, solo jugo", "puñado de perejil fresco, picado", "sal y pimienta negra recién molida"], "method": ["Caliente la mantequilla en una sartén grande y fría la cebolla hasta que se suavice pero no se coloree.", "Agregue el calabacín y el arroz y revuelva bien para cubrir los granos en aceite.", "Agregue el caldo de a poquito, revuelva bien y asegúrese de que todo el caldo haya sido absorbido antes de la siguiente adición.", "Cuando todo el caldo haya sido absorbido y el arroz esté tierno, agregue el queso y sazone al gusto con sal y pimienta negra recién molida. Cubra y reserve.", "Para el calamar a la plancha, coloca el aceite de oliva y el ajo en un bol. Coloque el calamar en el recipiente y mezcle bien para cubrirlo.", "Caliente una sartén hasta que esté caliente y cocine el calamar durante 2-3 minutos, volteándolo con frecuencia, hasta que esté dorado y cocido, pero aún tierno (no lo cocine en exceso o se pondrá duro). Rocíe el jugo de limón, espolvoree sobre el perejil y sazone con sal y pimienta negra recién molida.", "Para servir, coloca el risotto en tazones. Divida el calamar en dos pedazos y cubra cada porción de risotto con calamar."], "url": "www_bbc_co_uk_food_recipes_courgetteandparmesan_85380", "title": "Risotto de calabacín y parmesano con calamares a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20 langostinos, cocidos en sus caparazones", "1 cucharada de puré de tomate", "1 barra de apio, más o menos picada", "1 zanahoria, más o menos picada", "1 cebolla, más o menos picada", "500ml / 18fl oz de aceite de oliva", "1 cucharada de aceite de oliva", "12 calabacines pequeños, cortados longitudinalmente", "1 ramita de tomillo", "pizca de sal", "500g / 1lb 2oz de pasta fresca de tagliatelle", "2 calabacines grandes, cortados en tiras con un pelador de verduras", "sal y pimienta negra recién molida", "parmesano recién rallado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los langostinos y el aceite, pele los langostinos y ponga la carne a un lado. Coloque todas las conchas de langostinos, el puré de tomate, el apio, la zanahoria y la cebolla en un recipiente y mezcle bien. Coloque en una bandeja para hornear y coloque en el horno para asar durante 30 minutos o hasta que estén dorados.", "Retire del horno y reduzca la temperatura del horno a 170 C / 325 F / Gas 3.", "Vierta el aceite sobre las cáscaras y verduras asadas y mezcle bien. Regrese al horno por una hora más y luego retírelo del horno y drene el aceite pasando por un tamiz fino en un recipiente. Reserve el aceite y deseche las cáscaras y las verduras.", "Para los tallarines, caliente una sartén hasta que esté caliente y luego agregue el aceite de oliva, los calabacines pequeños y el tomillo. Freír hasta que estén dorados y tiernos.", "Mientras tanto, lleva una olla grande de agua a ebullición y luego agrega una pizca de sal. Agregue la pasta y cocine por dos minutos.", "Agregue las cintas de calabacín al agua y cocine por un minuto más hasta que se marchite. Escurra las cintas de pasta y calabacín y colóquelas nuevamente en la cacerola.", "Agregue los calabacines salteados y sazone con sal y pimienta negra recién molida.", "Para servir, cuchara en un plato de servir. Coloque los langostinos en la parte superior de la pasta, espolvoree sobre el queso parmesano y una cuchara sobre un poco del aceite de langostinos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_courgetteandthymetag_84249", "title": "Tagliatelle de calabacín y tomillo con langostinos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "250ml / 9fl oz de aceite de oliva, más extra para engrasar", "450 g / 1lb de azúcar en polvo", "2 cucharaditas de extracto de vainilla", "4 calabacines rallados gruesos", "Pulpa de piña 225g / 8oz", "Harina normal de 425 g / 15 oz, más extra para quitar el polvo", "2 cucharaditas de bicarbonato de soda", "1 cucharadita de sal", "½ cucharadita de polvo de hornear", "1½ cucharadita de canela molida", "¾ cucharadita de nuez moscada recién rallada", "Nueces 110g / 4oz, picadas", "170 g / 6oz de pasas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque los huevos en un procesador de alimentos y mezcle. Agregue el aceite, el azúcar y el extracto de vainilla y mezcle de nuevo, hasta que espese y espumoso. Agregue los calabacines rallados y la pulpa de piña.", "En otro recipiente, mezcle la harina, el bicarbonato de soda, la sal, el polvo de hornear, la canela y la nuez moscada. Agregue los ingredientes secos a los ingredientes húmedos un tercio a la vez, doblando suavemente con una espátula de goma después de cada adición. Agregue las nueces y las pasas y revuelva.", "Engrase dos moldes de barras de 12.5cm x 20cm / 5in x 8in y polvo con harina. Divida la mezcla por igual entre las latas.", "Transfiera al horno y hornee durante aproximadamente una hora, o hasta que un pincho insertado en el centro salga limpio. Enfríe en las latas durante diez minutos, luego colóquelo en las rejillas para que se enfríe completamente antes de servir."], "url": "www_bbc_co_uk_food_recipes_courgettebread_85718", "title": "Pan de Calabacín (zucchini)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 2 panes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabacín, cortado en cintas finas en una mandolina", "Aceitunas Kalamata 60g / 2oz, piedras removidas, picadas", "1 tomate, picado", "½ limón, cáscara y jugo solamente", "1 pequeño puñado de menta fresca, picada", "1 pequeño puñado de perejil fresco, picado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Coloque las cintas de calabacín en dos platos en una sola capa.", "Mezcle el resto de los ingredientes en un tazón pequeño y rocíe sobre las cintas de calabacín. Deje marinar durante diez minutos, luego sirva."], "url": "www_bbc_co_uk_food_recipes_courgettecarpacciowi_89156", "title": "Carpaccio de calabacín con tomate, aceitunas Kalamata y aderezo de limón, menta y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "1 cucharadita de polvo de hornear", "pizca de pimentón ahumado", "sal y pimienta negra recién molida", "1 cucharada de azúcar en polvo", "2 huevos de gallinas camperas", "75ml / 2½ fl oz de leche", "100g / 3½oz de calabacines rallados", "75g / 2½oz de maíz dulce enlatado", "6 cebolletas, finamente picadas", "2 cucharadas de aceite vegetal", "200g / 7oz de aceitunas verdes grandes, piedras removidas", "2 limones, jugo y ralladura solamente", "1 diente de ajo, aplastado", "1 cucharada de alcaparras", "1 cucharada de perejil fresco picado", "50ml / 2fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cucharada de guisantes frescos (o guisantes congelados descongelados)"], "method": ["Para los buñuelos, mezcle la harina, el polvo de hornear, el pimentón, la sal y la pimienta negra recién molida y el azúcar en un tazón.", "En otro recipiente, mezcle los huevos y la leche.", "Poco a poco agregue la mezcla de huevo y leche a los ingredientes secos, batiendo constantemente, para formar una mezcla suave.", "Coloque los calabacines, el maíz dulce y las cebolletas en un bol y mezcle bien.", "Agregue un poco del rebozado a la mezcla de vegetales, lo suficiente como para unir las verduras.", "Calentar el aceite en una sartén a fuego medio. Coloque una cucharada grande de la mezcla de buñuelos en la sartén y cocine por 2-3 minutos en cada lado, o hasta que se dore por todas partes. Retire y escurra sobre papel de cocina. Reserve en un lugar cálido y repita el proceso hasta que toda la mezcla de buñuelos se haya agotado.", "Para la salsa, triture las aceitunas suavemente con un mortero (o mezcle con un procesador de alimentos). Coloque las aceitunas en un tazón con todos los demás ingredientes de la salsa y mezcle bien.", "Para servir, coloque dos buñuelos en cada plato y sirva una cucharada de salsa al lado."], "url": "www_bbc_co_uk_food_recipes_courgettefritters_87587", "title": "Buñuelos de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½ oz de harina de auto crianza", "2 huevos de gallinas camperas, golpeados", "50ml / 2fl de leche en oz", "3 calabacines pequeños, rallados", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "4 cucharadas de yogur al estilo griego", "pizca de pimentón"], "method": ["Para los panqueques de calabacín, bata la harina, los huevos y la mitad de la leche en un tazón con una mezcla bastante suelta, agregando más leche poco a poco según sea necesario.", "Agregue el calabacín rallado y sazone con sal y pimienta negra recién molida.", "Caliente la mantequilla y el aceite de oliva en una sartén a fuego alto. Ponga un poco de la pasta de calabacín en la sartén y agite la sartén hasta que la mezcla esté distribuida uniformemente. Freír durante 3-4 minutos en cada lado, o hasta que estén doradas por ambos lados. Poner a un lado en un plato cubierto caliente. Repita con el resto de la mezcla.", "Para servir, amontona los panqueques en un plato. Coloque el yogur de estilo griego en un recipiente pequeño, espolvoréelo con el pimentón y sirva en un lado."], "url": "www_bbc_co_uk_food_recipes_courgettepancakeswit_89457", "title": "Panqueques de calabacín con yogur griego con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "400 g / 14 oz pueden cortar tomates", "salpicaduras de vinagre balsámico", "sal y pimienta negra recién molida", "Harina normal de 55g / 2oz", "pizca de sal", "2 huevos de gallinas camperas", "4 cucharadas de leche", "2 calabacines", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa de tomate, caliente el aceite en una sartén resistente al horno de base pesada. Agregue la cebolla y el ajo y freír suavemente durante unos minutos hasta que estén blandos, pero no coloreados.", "Agregue los tomates y el vinagre balsámico, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Revuelva bien, luego transfiera al horno por 6-8 minutos, hasta que la salsa se reduzca ligeramente y espese.", "Para los panqueques, tamiza la harina en un bol con una pizca de sal.", "Haz un pozo en el centro y rompe los huevos. Poco a poco mezcle, agregando la leche poco a poco para hacer una mezcla suave.", "Rallar los calabacines y mezclar en la masa.", "Calentar el aceite en una sartén y agregar cucharadas de la masa de calabacín. Cocine durante 2-3 minutos, o hasta que se formen pequeñas burbujas en la superficie y que la parte inferior de los panqueques tenga un ligero color dorado. Voltee y cocine durante otros 1-2 minutos, hasta que estén cocidos y ligeramente dorados.", "Para servir, coloque los panqueques de calabacín en platos calientes y póngalo sobre la salsa de tomate."], "url": "www_bbc_co_uk_food_recipes_courgettepancakeswit_87811", "title": "Panqueques de calabacín con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabacín", "25g / 1oz de queso halloumi, picado", "puñado de pimientos Peppadew", "2 cucharadas de aceite de oliva", "jugo de ½ limón"], "method": ["Usando un pelador de verduras, pele el calabacín en largas \"cintas\".", "Coloque las cintas de calabacín en agua hirviendo durante 30 segundos y drene.", "Al calabacín agregue los trozos de queso halloumi, Peppadews rojos, aceite de oliva y jugo de limón. Sazone al gusto con sal y pimienta negra recién molida.", "Coloque en un tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_courgettepasta_78480", "title": "Pasta de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g de judías de hojalata, escurridas", "2 dientes de ajo grasos", "10 tomates secados al sol", "75 g / 2½ oz de albahaca fresca, reservar unas hojas para adornar", "4 cucharadas de jugo de limón", "pizca de copos de chile", "sal y pimienta negra recién molida", "6 calabacines, recortados", "2 aguacates maduros grandes, sin piel y semillas, picados", "chile rojo, picado, para adornar", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Para el pesto, mezcle todos los ingredientes y 9 cucharadas de agua hasta obtener una pasta áspera en un procesador de alimentos. Agregue agua adicional para aflojar la mezcla si es necesario. Condimentar con sal y pimienta. Dejar de lado.", "Para los espaguetis courgetti, pele las hebras de espagueti de los calabacines usando un pelador juliano, recogiéndolos en un tazón grande.", "Raspe el pesto encima de los hilos del calabacín y revuelva cuidadosamente hasta que el calabacín esté cubierto uniformemente.", "Para servir, amontone los espaguetis y pesto de calabacín en platos para servir y cubra con aguacate picado, hojas de albahaca reservadas, chile picado y un chorrito de aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_courgetti_spaghetti_with_07741", "title": "Espagueti de calabacín con pesto de tomate y frijol de mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgetti_spaghetti_with_07741_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabacín redondo, parte superior en rodajas y carne recortada", "aceite de oliva, para lloviznar", "Cuscús 250 g / 9 oz", "250ml / 9fl oz de caldo de verduras calientes", "1 cucharada de aceite de oliva", "puñado de perejil fresco y albahaca fresca, picada", "3 fechas, piedras removidas, picadas", "½ ciruela amarilla, picada", "50g / 1¾oz de queso de cabra, desmenuzado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rocíe todo el calabacín con aceite de oliva y colóquelo en una bandeja para hornear, luego transfiéralo al horno para cocinar durante 10-12 minutos o hasta que se suavice un poco.", "Coloque el cuscús en un recipiente y vierta sobre suficiente caldo de vegetales calientes para cubrir el cuscús. Cubra el recipiente con film transparente y déjelo reposar de 4 a 5 minutos.", "Retire la película adhesiva, separe los granos de cuscús con un tenedor, luego agregue todos los ingredientes restantes al tazón y mezcle bien.", "Para servir, coloque el calabacín cocido en un plato y llénelo con la ensalada de cuscús."], "url": "www_bbc_co_uk_food_recipes_courgettestuffedwith_84703", "title": "Calabacín relleno de ensalada de ciruela y cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "2 cucharadas de aceite de oliva", "1 huevo de gallinas camperas, solo yema", "sal y pimienta negra recién molida", "2-3 cucharaditas de agua fría, para unir", "½ calabacín, cortado en rodajas", "2 tomates de vid, cortados en rodajas", "55 g / 2 oz de queso mozzarella, en rodajas", "6 aceitunas negras deshuesadas", "2 cucharadas de puré de tomate", "2 cucharadas de agua", "1 puñado de hojas frescas de perejil", "2 cucharadas de aceite de oliva"], "method": ["Precalentar la parrilla a mediano.", "Para la tarta, coloque la harina, el aceite de oliva, la yema de huevo, la sal y la pimienta negra recién molida en un procesador de alimentos y pulse hasta que estén bien combinados. Poco a poco agregue un poco de agua fría, lo suficiente como para unir la mezcla en una masa.", "Coloque la masa sobre una superficie de trabajo enharinada y amase ligeramente, luego extiéndala en una rodaja de 5 mm / ¼ de grosor, lo suficientemente grande como para caber dentro de una sartén resistente al horno.", "Caliente la sartén y coloque la masa en el fondo. Coloque las rodajas de calabacín y tomate en forma de espiral en la parte superior, colóquelas debajo de la parrilla y cocínelas durante 4-5 minutos, hasta que la masa esté dorada y el calabacín y el tomate comiencen a ablandarse. Retire de la parrilla y coloque la mozzarella y las aceitunas negras en la parte superior. Regrese a la parrilla y cocine por otros 1-2 minutos, hasta que la mozzarella se derrita.", "Para la salsa de tomate, coloque el puré de tomate y el agua en una sartén y caliente, revuelva bien.", "Para el puré de perejil, coloque el perejil y el aceite juntos en un mini procesador de alimentos y mezcle hasta que quede suave.", "Con cuidado, coloque la tarta en un plato de servir y rocíe sobre la salsa de tomate y el puré de perejil. Servir."], "url": "www_bbc_co_uk_food_recipes_courgettetomatoolive_88922", "title": "Tarta de calabacín, tomate, aceituna y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paleta de cerdo sin corteza de 300 g / 10 oz, picada en pequeños trozos", "Vientre de cerdo sin corteza de 300g / 10z, picado en pedazos pequeños", "Lonchas de tocino sin corteza sin corteza, 150g / 5oz, picadas en trozos pequeños", "225/8 oz de hígado de cerdo, enjuagado y secado al tacto con papel de cocina", "2 dientes de ajo, pelados y triturados", "1 naranja, jugo y ralladura", "6 cucharadas de aguardiente", "3 cucharadas de hojas de salvia frescas picadas", "1 cucharada de hojas de tomillo fresco picado", "1 cucharada de granos de pimienta negros enteros", "1 cucharada de bayas de enebro", "Lonchas de tocino rayado ahumado sin corteza 400g / 14oz", "Cornichons de 200g / 7oz, escurridos", "sal marina y pimienta negra recién molida"], "method": ["Coloque la mitad del hombro de cerdo, la mitad del vientre de cerdo, la mitad del tocino, el hígado y el ajo en un procesador de alimentos y mezcle hasta que quede suave. Agregue el resto del hombro de cerdo, la panceta de cerdo, el tocino y el pulso hasta que estén bien picados y bien combinados.", "Transfiera a un tazón y agregue el jugo de naranja y la ralladura, el brandy y las hierbas hasta que estén bien combinados. Moler los granos de pimienta y bayas de enebro junto con un mortero y agregar a la mezcla. Revuelva hasta que esté bien combinado. Cubra el recipiente con film transparente y enfríe en la nevera durante 1-3 horas.", "Coloque las lonchas de tocino ahumado en un tablero y estírelo de a uno con la parte posterior de un cuchillo. Coloque la primera loncha en diagonal en el molde de terrina asegurándose de que algunos se solapen con el borde. Coloque la segunda barra en diagonal en la esquina opuesta. Repita con las lonchas restantes, cambiando el ángulo ligeramente con cada loncha para que todo el molde de terrina esté cubierto con tocino. (Esto hará que la terrina sea más fácil de cortar).", "Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Ponga un tercio de la mezcla de paté en la terrina forrada y coloque la mitad de los cornichons prolijamente en la parte superior. (Deben correr longitudinalmente por la terrina, de modo que cuando se corte la terrina, formen una fila de círculos verdes en el centro).", "Ponga otro tercio de la mezcla de paté encima de los cornichons y presione la superficie suavemente y con firmeza. Cubra con una segunda capa de cornichons y termine con el paté restante. Coloque el tocino superpuesto y sobre el paté para cubrir la superficie.", "Cubra con la tapa (o papel de aluminio si usa una fuente para horno) y coloque la terrina en una lata pequeña para asar. Agregue suficiente agua recién hervida a la lata de asar para que llegue a 2 cm / ¾ pulgada por la parte exterior de la terrina. Hornee en el centro del horno durante 1½ horas.", "Para probar que la terrina está lista, sáquela del horno e inserte un pincho en el centro. Sostenga por 10 segundos, luego retírelo y toque ligeramente el extremo. El pincho debería estar caliente. El paté también debería haberse reducido a los lados de la terrina. Retire de la lata de tostado.", "Retire la tapa de terrina, cubra con una doble capa de papel de aluminio y coloque un par de latas de frijoles u otros pesos pesados ​​en la parte superior. Dejar enfriar, luego enfriar en la nevera durante la noche. Al día siguiente, coloca la paté en un tablero y córtala en rodajas gruesas. Sirva con pan caliente y crujiente y mucha mantequilla."], "url": "www_bbc_co_uk_food_recipes_course_country_terrine_54023", "title": "Terrina de campo grueso", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/course_country_terrine_54023_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Filete de salmón de 100 g / 3½ oz, sin piel", "1 huevo de gallinas camperas, golpeado", "55g / 2oz de cuscús", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "2 tomates, picados", "¼ cucharadita de hojuelas de chile seco", "1 cucharada de vinagre balsámico", "perejil fresco picado, para adornar"], "method": ["Para los goujons de salmón, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cortar el salmón en cuatro tiras largas. Sumerja las tiras de salmón en el huevo batido.", "Espolvoree el cuscús en un plato y cubra las rodajas de salmón en el cuscús.", "Coloque con cuidado el salmón en el aceite caliente y fríalo durante unos 3-4 minutos, o hasta que esté crujiente y cocido. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la salsa de tomate, caliente el aceite en una sartén. Agregue el ajo, los tomates y las hojuelas de chile y cocine a fuego lento durante 2-3 minutos. Agregue el vinagre balsámico.", "Sirva los goujons de salmón en un plato con la salsa y decore con perejil."], "url": "www_bbc_co_uk_food_recipes_couscouscoatedgoujon_87775", "title": "Goujons recubiertos de cuscús con salsa de tomate y hierbas calientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de cuscús", "1 manojo de perejil fresco, picado", "1 manojo de cilantro fresco, picado", "1 cebolla roja, muy finamente picada", "1 limón, ralladura y jugo", "½ pepino, sin semillas y finamente cortado en cubos", "Semillas de girasol 30g / 1oz, tostadas", "30 g / 1 oz de semillas de sésamo, tostadas", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Cubra el cuscús con dos veces su volumen de agua caliente y déjelo en remojo durante 10 minutos.", "Mezcle con los ingredientes restantes y déjelos reposar durante 30 minutos para dejar que se desarrollen los sabores.", "Servir a temperatura ambiente"], "url": "www_bbc_co_uk_food_recipes_couscoussalad_1921", "title": "Ensalada de cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/couscoussalad_1921_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["700ml / 1¾pints de aceite vegetal", "1 pechuga de pollo sin piel, cortada en tiras", "150 g / 5½ oz de harina, sazonado con sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "100g / 3½oz de cuscús", "1 cucharada de aceite de oliva", "50g / 2oz de puerros picados", "pizca de chile en polvo", "1 tomate de buey, aproximadamente picado", "1 cucharada de puré de tomate", "2 cucharadas de ketchup de tomate", "1 cucharada de vinagre de vino tinto", "1 cucharada de azúcar en polvo", "75g / 3oz de cilantro, toscamente picado", "200g / 7oz de couscous cocido", "sal y pimienta negra recién molida"], "method": ["Para el pollo, caliente el aceite vegetal en una olla de fondo grueso. El aceite está listo cuando una miga de pan se cuela suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cubra el pollo en la harina, sumerja en el huevo, luego cubra con cuscús. Freír el pollo durante 5 minutos hasta que esté dorado y completamente cocido. Retire con una espumadera y escurra sobre los paños de cocina.", "Para hacer la salsa, caliente el aceite en una sartén. Agregue el puerro y el chile y fría por 1 minuto. Agregue el tomate picado, el puré de tomate, el ketchup, el vinagre, el azúcar y la mitad del cilantro. Cocine por 2 minutos.", "Mezcle el cuscús cocido con la salsa de tomate y sazone bien con sal y pimienta negra recién molida.", "Para servir, coloca el cuscús picante en el centro de un plato caliente, coloca el pollo encima y espolvorea con el resto del cilantro picado."], "url": "www_bbc_co_uk_food_recipes_couscousfriedchicken_80610", "title": "Pollo frito Cuscús con cuscús y salsa de tomate con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "200g / 7oz de cuscús", "400ml / 14fl oz de caldo de pollo caliente", "½ granada, solo semillas", "2 cucharadas de cilantro fresco picado, más extra para servir", "2 cucharadas de perifollo fresco picado, más extra para servir", "Filete de salmón 400 g / 14 oz", "1 limón, cortado en cuñas delgadas", "2 dientes de ajo, en rodajas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de cebolletas frescas picadas", "1 cucharada de eneldo fresco picado", "salpicar pescado o caldo de pollo"], "method": ["Para el cuscús, caliente el aceite de oliva en una sartén. Vierta el cuscús y deje asar y colorear ligeramente en la sartén durante 3-4 minutos. Transfiera a un recipiente y vierta sobre el caldo caliente. Cubra con película adhesiva apartada durante 5-6 minutos, o hasta que el cuscús haya absorbido todo el líquido.", "Pelusa los granos con un tenedor y revuelva en las semillas de granada y hierbas frescas picadas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el pescado, haga tres incisiones profundas en el pescado y coloque una rodaja de limón y una rodaja de ajo en cada una. Sazonar con sal y pimienta negra recién molida.", "Calentar el aceite de oliva en una sartén y freír el salmón, con la piel hacia abajo, durante 2-3 minutos, o hasta que la piel esté dorada y crujiente. Transfiera el pescado a un plato resistente al horno, espolvoree con la mitad de las hierbas y agregue un poco de caldo. Coloque en el horno para asar durante 8-10 minutos, o hasta que el pescado esté bien cocido.", "Para servir, espolvorear el cuscús en un plato para servir y colocar el filete de pescado encima. Adorne con más hierbas frescas."], "url": "www_bbc_co_uk_food_recipes_couscoussaladwithpan_93103", "title": "Ensalada de cuscús con salmón frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más extra para engrasar", "200g / 7oz de cuscús", "Albaricoques secos 30 g / 1 oz, picados", "2 cucharadas de cilantro fresco picado", "exprimir jugo de limón", "sal y pimienta negra recién molida", "300ml / 10½fl oz pollo caliente o caldo de verduras", "30g / 1oz de nueces de Brasil, picadas", "pequeña albahaca fresca puñado, para adornar"], "method": ["Para el cuscús, caliente el aceite de oliva en una cacerola, agregue el cuscús y revuelva bien para cubrir con aceite. Continúe revolviendo a fuego medio durante 2-3 minutos, luego agregue el resto de los ingredientes y cocine a fuego lento, revolviendo ocasionalmente, hasta que el caldo haya sido absorbido y el cuscús esté tierno. Pelusa el cuscús con un tenedor.", "Presione el cuscús en un molde ligeramente aceitado y colóquelo en un plato para servir. Adornar con las hojas de albahaca y servir."], "url": "www_bbc_co_uk_food_recipes_couscouswithapricots_88958", "title": "Cuscús con albaricoques, limón y nueces de Brasil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]