[{"ingredients": ["350g / 12oz de queso feta", "2 dientes de ajo, cortados en rodajas finas", "puñado de hojas de menta", "150ml / 5fl oz de aceite de oliva virgen extra", "pimienta negra recién molida", "3-4 cucharadas de vinagre balsámico", "100-150ml / 3½-5fl oz de aceite de oliva virgen extra", "pimienta negra recién molida", "55g / 2oz de lentejas Puy, cocidas", "2 cucharadas de aceite de oliva", "2 pimientos rojos, semillas eliminadas, en rodajas", "2 pimientos amarillos, sin semillas, en rodajas", "2 pimientos de naranja, sin semillas, en rodajas", "1 guindilla roja (izquierda entera)", "1 hoja de laurel", "2 dientes de ajo, pelados", "1 cucharada de azúcar en polvo", "1 limón, jugo y cuñas restantes"], "method": ["Para el queso feta marinado, coloque el queso en un tazón grande y poco profundo y espolvoree sobre el ajo.", "Agregue las hojas de menta, rocíe sobre el aceite de oliva y sazone con pimienta negra. Cubra y deje macerar durante una hora a temperatura ambiente.", "Para el aderezo de lentejas, mezcle el vinagre balsámico y el aceite virgen extra en un tazón. Sazonar con pimienta negra y agregar las lentejas cocidas. Dejar de lado.", "Para la mermelada de pimiento rojo, caliente el aceite de oliva a fuego medio en una sartén grande. Agregue los pimientos, el chile, la hoja de laurel, el ajo, el azúcar, el jugo de limón y las rodajas de jugo.", "Coloque un pedazo de papel húmedo a prueba de grasa sobre los pimientos y cubra con una tapa. Cocine con cuidado durante 35-40 minutos o hasta que los pimientos estén realmente suaves.", "Retire el papel y la tapa de la sartén e incremente el fuego. Cocine a fuego lento para reducir el líquido durante aproximadamente 3-4 minutos, teniendo cuidado de no permitir que se queme. Sazone al gusto."], "url": "www_bbc_co_uk_food_recipes_marinated_feta_roasted_19610", "title": "Feta marinada, mermelada de pimiento asado y aderezo de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón sin cebar, ralladura fina solamente", "2 cucharadas de orégano fresco", "2 dientes de ajo, finamente picados", "4 cucharadas de aceite de oliva", "12 chuletas de cabra o 3 x 4 huesos de chuletas de cabra", "75g / 2½oz de mantequilla sin sal", "12 higos, a la mitad o en cuartos según el tamaño", "4 cucharadas de miel", "1 cucharadita de pimienta negra molida", "75g / 2½oz de mantequilla sin sal", "75g / 2½ oz de ortigas frescas, picadas", "75 g / 2½ oz de acelga fresca, picada", "200ml / 7fl oz de caldo de pollo", "sal y pimienta negra recién molida", "150g / 5½oz de cuajada de cabras"], "method": ["Para las chuletas de cabra, mezcle la ralladura de limón, el orégano, el ajo y el aceite en un tazón grande. Agregue las chuletas y marinado en la nevera durante al menos una hora (vuelva a la temperatura ambiente antes de cocinar).", "Para los higos, precaliente el horno a 220C / 200C Fan / Gas 7.", "Derretir la mantequilla en una sartén grande. Agregue los higos y mezcle para cubrir la mantequilla. Agregue la miel y la pimienta negra y mezcle de nuevo. Asar durante 4-6 minutos, o hasta que los higos estén pegajosos y glaseados.", "Mientras tanto, caliente una sartén grande o una sartén, agregue las chuletas marinadas y cocínelas por 2-3 minutos en cada lado. Reserve para descansar por unos 3 minutos.", "Para las ortigas cocidas y la acelga, calienta otra sartén grande o una sartén y agrega la mantequilla. Una vez derretido, agregue las ortigas y acelga y cubra en la mantequilla. Vierta el caldo y cocine por 2-4 minutos, o hasta que el líquido se haya reducido a la mitad. Condimentar con sal y pimienta.", "Para servir, ponga las chuletas e higos en platos y cubra las ortigas y la acelga estofadas. Terminar con puntos de cuajada de cabras."], "url": "www_bbc_co_uk_food_recipes_marinated_goat_cutlets_08411", "title": "Chuletas de chivo marinado con higos asados ​​y cuajada de cabras", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cucharadita de pimentón ahumado agridulce, más extra para servir", "2 ramitas de orégano fresco, solo hojas, picadas", "1 diente de ajo, finamente picado", "½ cucharadita de comino molido", "4 x 250 g / 9 oz de filetes de cerdo (preferiblemente cerdo ibérico)", "Patatas cerosas de 1kg / 2lb 4oz, como papas Desirée, peladas, cortadas en rodajas de 7-8mm de grosor", "2 cucharadas de aceite de oliva, más extra para servir", "1 cebolla pequeña en rodajas finas", "3 dientes de ajo, en rodajas finas", "4 ramitas de tomillo fresco, solo hojas, para servir", "sal y pimienta negra recién molida"], "method": ["Para el cerdo, precaliente el horno a 200C / 180C Fan / Gas 6.", "Mezcle todos los ingredientes del cerdo, a excepción del cerdo, en un tazón grande hasta que estén bien combinados. Agregue los filetes de cerdo y cúbralos en la mezcla. Enfriar en la nevera durante al menos 12 horas, para marinar.", "Cuando la carne se haya marinado, retírela del refrigerador y déjela a un lado hasta que haya vuelto a la temperatura ambiente.", "Caliente una sartén a prueba de horno a fuego medio. Cuando la sartén esté caliente, retire los filetes de cerdo del adobo, sacuda el exceso y fríalos durante 1-2 minutos en cada lado, o hasta que se doren por todos lados.", "Transfiera la sartén al horno y cocine los filetes de cerdo por otros 5 minutos (si usa carne de cerdo ibérico, los filetes solo necesitarán cocinarse en el horno durante 2 minutos). Retire la carne de la sartén y déjela reposar sobre un plato caliente durante 5 minutos. Reserve los jugos de pan.", "Mientras tanto, para las papas, hierva las rodajas de papa en una sartén de agua con sal durante 1-2 minutos, o hasta que estén tiernas. Escurrir bien.", "Caliente el aceite en una sartén a fuego medio, luego agregue las papas escurridas y fría por 2-3 minutos, o hasta que estén coloreadas.", "Agregue la cebolla y el ajo y continúe freír durante 1-2 minutos, o hasta que estén dorados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la mezcla de papa por igual entre 4 platos para servir. Tallar cada filete de cerdo en rodajas y disponer las rodajas en la parte superior de las patatas. Rocíe los jugos de la sartén y un chorrito de aceite de oliva alrededor del borde de cada plato. Adornar con las hojas de tomillo."], "url": "www_bbc_co_uk_food_recipes_marinated_iberico_pork_50937", "title": "Filete de cerdo ibérico marinado con patatas salteadas y pimentón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de leche entera", "2 cucharadas de jugo de limón", "5 cebollas grandes, en rodajas finas", "6 tomates, toscamente picados", "600 ml / 1 pinta de yogur natural", "100 g / 3½ oz de raíz de jengibre fresco, rallado", "8 dientes de ajo rallados", "1 cucharada de sal masala", "1 cucharada de comino molido", "1-2 cucharaditas de chile en polvo, al gusto", "2 cucharaditas de pimentón ahumado", "2 cucharaditas de cúrcuma molida", "1 cucharada de miel líquida", "1 limón no encerado, jugo y ralladura finamente rallada", "12 chuletas de cordero", "3 cucharadas de aceite vegetal", "1 chile seco", "½ cucharadita de semillas de comino", "Jengibre fresco de la raíz de los 5cm / 2in, pedazo fino rallado", "3 cebollas pequeñas, en rodajas finas", "1 fresco escalofrío verde, picado", "1 cucharadita de sal", "½ cucharadita de cúrcuma molida", "1½ cucharadita de chile en polvo", "200 g / 7 oz de coliflor, cortada en florecillas", "Paneer de 250g / 9oz (desde arriba), cortado en cubos de 2.5cm / 1in", "4 tomates, semillas eliminadas, cortadas en tiras", "½ cucharadita de comino molido", "½ cucharadita de sal masala"], "method": ["Para el paneer, alinee un tamiz grande con una doble capa de tela de muselina.", "Caliente la leche en una cacerola grande a fuego lento durante unos 20 minutos, hasta que hierva. Esto debe hacerse lentamente. Cuando empiece a burbujear, agregue 1 cucharada de jugo de limón. Cuando la leche comience a separarse, retírela del fuego, agregue el resto del jugo de limón y revuelva hasta que el líquido se separe de la cuajada.", "Vierta la mezcla en el colador forrado y deje que el suero se drene. Corra un poco de agua fría sobre la cuajada para enjuagar el exceso de suero de leche, luego junte la muselina y apriete para eliminar la humedad.", "Coloque en un recipiente de plástico, coloque otro recipiente de plástico en la parte superior y use pesas pesadas como latas de tomates para pesarlo. Deja durante 2 horas para establecer.", "Para las chuletas de cordero, combine todos los ingredientes aparte del cordero en un tazón. Cubra las chuletas con el adobo, cubra y reserve.", "Para el paneer cocido, caliente el aceite en una cacerola a fuego medio. Freír el chile, las semillas de comino y el jengibre durante 1 minuto. Agregue las cebollas, el chile verde y la sal y fría por 5 minutos, o hasta que las cebollas estén suaves pero no coloreadas. Agregue la cúrcuma, el chile en polvo y la coliflor y fría por 4 minutos. Baje el fuego y agregue el paneer y los tomates y cocine durante 5 minutos. Agregue el comino molido y el garam masala y reserve.", "Para las chuletas de cordero, caliente una sartén grande a fuego alto. Cocine las chuletas durante 2-3 minutos en cada lado, dependiendo de cómo le guste su cordero cocinado.", "Coloque el paneer cocido y la coliflor en el centro de un plato grande para servir, cubra con las chuletas de cordero y sirva."], "url": "www_bbc_co_uk_food_recipes_marinated_lamb_chops_24406", "title": "Chuletas de cordero marinado con paneer", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, finamente picado", "½ cucharada de pimentón ahumado español", "1 cucharada de miel", "5 cucharadas de aceite de oliva, más extra para servir", "pizca de orégano fresco", "4 x 250-350 g / 9-12 oz de filetes de cuello de cordero", "600g / 1lb 5oz de tomates maduros en la vid, reducidos a la mitad", "4 dientes de ajo, piel sobre", "aceite de oliva, para lloviznar", "1 chalote de plátano, finamente picado", "2 ramitas de tomillo", "250ml / 9fl oz de caldo de pollo", "2 papas cerosas, como desirée, peladas y cortadas en rodajas de 6-8 mm de espesor", "½ pimiento rojo grande, en rodajas", "1 pimiento verde, en rodajas", "aceite de oliva, para asar", "1 cebolla roja, en rodajas", "2 dientes de ajo grasos, en rodajas finas", "1 hoja de laurel fresca", "sal marina y pimienta negra recién molida"], "method": ["Para el cordero, mezcle todos los ingredientes, excepto el cordero, para hacer una pasta. Frote todo el cordero y deje marinar en la nevera durante al menos 12 horas.", "Cuando esté listo para cocinar, precaliente el horno a 190C / 170C Fan / Gas 5.", "Para los tomates, coloque los tomates en una bandeja para hornear con el ajo. Rocíe con abundante aceite de oliva y sazone generosamente con sal y pimienta. Asar durante 45-60 minutos, o hasta que los tomates estén comenzando a caramelizar.", "Mientras tanto, para las papas, mezcle las papas, los pimientos, la cebolla, el ajo y la hoja de laurel en una bandeja para hornear. Sazone con sal marina y mucha pimienta negra. Vierta más de 3 cucharadas de aceite de oliva y mezcle para cubrir las verduras.", "Asar en el estante superior del horno durante 15 minutos, luego voltee las verduras. Vuelva al horno y tápelo por otros 15 minutos, o hasta que las papas estén doradas y las otras verduras estén tiernas y estén bien caramelizadas por todas partes.", "Cuando los tomates estén listos, caliente un poco de aceite de oliva en una cacerola y fría la chalota por 10 minutos. Consejo en los tomates asados. Exprime el ajo tostado de sus pieles y agrégalo a la sartén. Agregue el tomillo y el caldo. Llevar a ebullición y cocine a fuego lento durante 10 minutos.", "Caliente una sartén grande a prueba de horno a fuego medio. Agregue los cuellos de cordero y fría hasta que estén dorados por todos lados (no necesita aceite en la sartén, ya que esto vendrá del adobo). Transfiera al horno por 2-4 minutos, o hasta medio raro. Reserve para descansar por 2 minutos.", "Para servir, coloque las papas y las verduras asadas en el medio de los platos para servir calentados. Cubra con algunos de los tomates. Cortar el cordero y colocar encima de las papas. Sazonar con sal y pimienta y rociar con un poco de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_marinated_lamb_neck_with_87366", "title": "Cuello de cordero marinado con patatas asadas y tomates", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 langostinos crudos grandes, sin cáscara", "1 chile rojo, finamente picado", "1 limón, ralladura y jugo", "2 dientes de ajo, aplastados", "3 cucharadas de aceite de oliva", "3 cucharadas de cilantro fresco picado", "16 lanzas de espárragos, tallos leñosos recortados", "2 manojos de berro, hojas recogidas", "3 limones, cortados por la mitad", "2 yemas de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "1 cucharadita de mostaza dijon", "200ml / 7fl oz de aceite de colza o aceite de oliva light"], "method": ["Para las gambas, mezcle las gambas, el chile, la ralladura de limón y el jugo, el ajo, dos cucharadas de aceite de oliva y el cilantro en un bol hasta que se combinen. Adobo en la nevera durante al menos dos horas.", "Caliente una sartén hasta que esté caliente y póngalos a la plancha por 1-2 minutos por cada lado, o hasta que estén rosados ​​y recién cocidos.", "Blanquee los espárragos durante 1-2 minutos en una olla con agua hirviendo, o hasta que estén tiernos. Escurra y mezcle el resto del aceite de oliva y luego ponga la plancha en la sartén por 1 o 2 minutos.", "Para la mayonesa de limón tostada, caliente una sartén hasta que esté caliente y cocine las mitades de limón, con la parte del corte hacia abajo, durante un minuto.", "Mezcle las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos, luego exprima el jugo de uno de los limones carbonizados y mezcle hasta que esté bien combinado. Mientras el motor está funcionando, agregue gradualmente el aceite. Continúe hasta que se haya agregado todo el aceite y la mayonesa se haya espesado. Sazonar con sal y pimienta negra recién molida", "Para servir, coloque los espárragos en los platos para servir y cubra con los langostinos. Coloque el berro al costado y termine con una cucharada de mayonesa de limón y la mitad de un limón a la plancha."], "url": "www_bbc_co_uk_food_recipes_marinated_prawns_with_15688", "title": "Gambas marinadas con mayonesa de limón asada y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, aplastado", "2 cucharadas de menta picada", "1 cucharada de salsa de menta lista para usar", "150g / 5½oz de yogurt natural bajo en grasa", "375 g / 13 oz de cordero magra, en cubos", "400g / 14oz de cuscús integral", "2 cebollas pequeñas, cortadas en cuñas", "1 pimiento verde, sin corazón, sin semillas y cortado en cuñas", "cuñas de limón, para servir", "sal y pimienta negra recién molida"], "method": ["Mezcle el ajo, la menta, la salsa de menta y el yogur en un bol, agregue el cordero y revuelva bien. Cubra y deje marinar en un lugar fresco por 10 minutos.", "Mientras tanto, coloque el cuscús en un recipiente resistente al calor, vierta 500 ml / 18 fll oz de agua hirviendo sobre el cuscús. Deje reposar hasta que el líquido haya sido absorbido. Sazonar con sal y pimienta y pelusa el cuscús con un tenedor. Dejar de lado.", "Precalentar la parrilla a un ajuste caliente.", "Pase el cordero y las rodajas de cebolla y pimiento a 8 brochetas de metal y cocínelas debajo de la parrilla durante 8-10 minutos, o hasta que estén bien cocidas.", "Sirve los kebabs con rodajas de limón y el cuscús."], "url": "www_bbc_co_uk_food_recipes_marinated_minty_lamb_61532", "title": "Kebabs de cordero minty marinados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_minty_lamb_61532_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz okra, en rodajas", "Cebolla roja 10g / ⅓oz, finamente picada", "25g / 1oz de guisantes congelados, picados", "1 cucharada de perejil de flatleaf tostado", "pellizcar ajo finamente picado", "pellizcar el comino molido", "Harina normal de 40 g / 1½ oz, tamizada", "¼ cucharadita de polvo de hornear", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de leche entera", "2 cucharadas de crema fresca", "aceite vegetal, para freír poco", "sal y pimienta negra recién molida", "100ml / 3½fl oz de aceite vegetal, más extra para freír poco", "100ml / 3½fl oz de aceite de oliva", "3 limones, solo jugo", "1 naranja, solo jugo", "azúcar pizca", "¼ cucharadita de semillas de cilantro, trituradas", "30 g / 1 oz de zanahorias, en rodajas finas", "4 filetes pequeños de salmonete, escamados y deshuesados", "pellizcar hilos de azafrán", "1 plátano verde o amarillo, pelado y en rodajas", "aceite vegetal, para freír", "Cilantro micro 40g / 1½oz", "40 g / 1½ oz micro albahaca roja", "40g / 1½oz de berro de bebé", "40 g / 1½ oz de hojas de capuchina", "40 g / 1½ oz de flores de capuchina", "20g / ¾oz okra, en rodajas finas", "¼ chile rojo (opcional)", "¼ de chile verde (opcional)", "2 cucharadas de aceite de oliva", "165g / 6 oz de yogur natural de estilo griego", "1 limón, cortado en cuñas"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para hacer los buñuelos, mezcle la okra, la cebolla roja, los guisantes, el perejil, el ajo y el comino. Agregue la harina y el polvo de hornear y mezcle bien. Agregue el huevo, la leche y la crema fresca y sazone.", "Caliente el aceite en una sartén grande y fría las cucharadas de la mezcla (puede necesitar hacer esto en tandas). Una vez dorado por ambos lados, retíralo de la sartén y escurre sobre papel de cocina. Termine en el horno por 3-4 minutos.", "Para hacer el salmonete, mezcle los dos aceites, jugo de limón, jugo de naranja, azúcar, semillas de cilantro y un poco de aderezo. Agregue las zanahorias y revuelva bien. Coloque en una cacerola pequeña a fuego medio y caliente hasta infundir. Dejar de lado para enfriar.", "Corte los filetes de mújol por la mitad y frote con un poco de azafrán y sal. Calentar un poco de aceite en una sartén y freír los filetes con la piel hacia abajo durante 5 minutos, o hasta que la piel esté crujiente y dorada. Dé vuelta y cocine por unos segundos. (El pescado debe estar poco cocido).", "Escurra los filetes en papel de cocina y coloque la carne sobre el líquido de marinado frío durante 5 minutos.", "Mientras tanto, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con el aceite. Caliente a 180 ° C (un cubo de pan debe dorarse en 1 minuto cuando lo deje caer) PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido Fríe el plátano en profundidad durante 2 minutos, o hasta que se dore por fuera y suave por dentro. Escurra sobre papel de cocina y sazone con un poco de sal.", "Para servir, mezcle con hierbas, flores, quimbombó y chiles, si los usa, juntos. Dejar reposar durante 1 minuto. Coloque los buñuelos en un plato para servir. Rocíe con el aceite de oliva y todo menos 1 cucharada de yogur. Coloque el pescado marinado junto con el plátano frito, el resto del yogur y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_marinated_red_mullet_00871", "title": "Salmonete marinado con okra y buñuelos de guisantes y plátano frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 costillas de carne de res, corte flanqueado a 1cm / ½ pulgada de grosor", "1 manojo de cilantro, tallos y hojas finamente picadas", "4 limas, solo jugo", "2 chalotes de plátano, picados", "4 cucharadas de aceite de oliva", "1-2 cucharaditas de comino molido", "½ cucharadita de cilantro molido", "3 dientes de ajo picados", "1 chile jalapeño, picado", "2 maíz en las mazorcas, sin cáscara", "4 tomatillos (o tomates verdes), finamente picados", "1 diente de ajo, finamente picado", "2 cucharadas de cilantro finamente picado", "2 cucharadas de vinagre de vino blanco", "azúcar pizca", "pizca de sal", "1 aguacate maduro, carne picada", "½ chile verde, finamente picado", "½ cebolla roja, muy finamente picada", "jugo de lima, al gusto", "2 cucharadas de cilantro picado", "6 tortillas de maíz", "2 cucharadas de aceite vegetal"], "method": ["Coloque las costillas en una bandeja grande y agregue los ingredientes restantes, reservando la mitad del chile para la salsa y revuelva para combinar. Deje marinar a temperatura ambiente durante al menos 1 hora.", "Mientras tanto, para la salsa, coloque el maíz en una sartén grande y cocine hasta que se dore por todas partes. Retire los granos y colóquelos en un tazón grande. Agregue los ingredientes restantes con el chile reservado y mezcle.", "Para el guacamole, ponga todos los ingredientes en un mortero y mortero y machaque para combinar.", "Para los chips de tortilla, precaliente el horno a 200C / 180C Fan / Gas 6. Corte las tortillas en triángulos, colóquelas en una bandeja para hornear y rocíe con el aceite. Hornea por 6-8 minutos.", "Para las costillas, caliente una sartén grande a fuego alto, agregue las costillas y cocine a cada lado de 1-2 minutos. Caliente a través del adobo de la izquierda en una cacerola pequeña a fuego medio.", "Coloque las costillas cocidas, la salsa, el guacamole y las tortillas en un plato grande. Rocíe el adobo tibio sobre las costillas y sirva."], "url": "www_bbc_co_uk_food_recipes_marinated_ribs_with_55287", "title": "Costillas marinadas con salsa de tomatillo, guacamole y chips de tortilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_ribs_with_55287_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de azúcar en polvo", "25g / 1oz de sal fina", "2 limones, cáscara eliminada con un pelador, luego finamente cortada en juliana", "½ filete del salmón fileteado, con un peso aproximado de 500g / 1lb 2oz, despellejado y deshuesado", "300ml / 11fl oz de aceite de oliva", "10g de eneldo fresco picado", "200 g / 7¼ yogur de estilo griego", "1 cucharadita de mostaza integral", "pizca de sal", "10g / ½ oz de azúcar mascabado", "1 cucharadita de jugo de limón", "rábano picante recién rallado, al gusto", "1 pepino", "1 cucharadita de vinagre de vino", "sal al gusto", "2 cucharadas de aceite de oliva", "1 cucharadita de mostaza integral", "5g / ¼oz de eneldo fresco picado", "2 rebanadas de pan de centeno", "aceite de oliva, al gusto", "pizca de sal", "2 cucharadas de eneldo fresco picado", "1-2 cucharadas de hojas micro mixtas"], "method": ["Mezcle el azúcar, la sal y la cáscara de limón en un tazón pequeño.", "Coloque el salmón en un plato poco profundo y espolvoree el adobo.", "Deje macerar durante una hora y luego enjuague con agua fría.", "Divida los peces en cuatro porciones.", "Pon el aceite de oliva en una sartén grande y calienta a 45 ° C / 113 ° F usando un termómetro de cocina para comprobar. Si no tiene un termómetro, coloque la sartén sobre el fuego, luego sumerja una cuchara después de 30 segundos. Siente la cuchara para controlar el calor del aceite; necesita estar tibio. Mantenga el aceite en el calor y siga revisando cada 30 segundos hasta que el aceite se sienta caliente. Agregue el salmón a la sartén, apague el fuego y deje el salmón durante unos 15-20 minutos.", "Poner a un lado para enfriar, luego transferir a un plato y dejar en la nevera hasta que esté listo para servir.", "Para la salsa de mostaza, mezcle todos los ingredientes en un tazón pequeño y relájese hasta que se requiera.", "Para la ensalada de pepino, pele el pepino y córtelo en cubos de 1cm / ½.", "Mezcle el pepino con el vinagre, la sal, el aceite de oliva y la mostaza en un recipiente y reserve para marinar.", "Agregue el eneldo justo antes de servir.", "Para los croûtons de centeno, rocíe las rebanadas de pan con aceite de oliva y espolvoree con sal.", "Calentar una sartén y freír el pan de centeno hasta que se dore por todas partes. Retire del fuego y transfiera a un plato para que se enfríe un poco antes de romper en croûtons rústicos. Espolvorear con el eneldo picado.", "Espolvorea el eneldo picado sobre el salmón y sírvelo con croûtons de centeno, salsa de mostaza, ensalada de pepino y hojas micro mixtas para adornar."], "url": "www_bbc_co_uk_food_recipes_marinated_salmon_78063", "title": "Gravlax de salmón marinado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["650g / 1lb 7oz remolachas crudas", "Vinagre de vino blanco o rojo de 500ml / 17fl oz", "2 litros / 3½ pintas de agua", "pizca de sal", "2 dientes de ajo, en rodajas", "1 cucharada de orégano seco", "1 chile rojo, finamente picado", "500ml / 17fl oz de aceite de oliva"], "method": ["Lave y restriegue la remolacha con agua fría. Colóquelos en una cacerola con el vinagre, sal y agua y lleve a ebullición. Reduzca el fuego, cubra y luego cocine a fuego lento durante aproximadamente 1 ¼ horas hasta que la remolacha esté tierna. Mientras tanto, combine todos los ingredientes del adobo en un recipiente y reserve.", "Una vez que la remolacha esté cocida, escurra, colóquela sobre un paño y seque. Retire las pieles con la ayuda de la tela. Cortar en rodajas, colocar en el adobo y mezclar bien. Deja por un día antes de servir. La remolacha se mantendrá durante varios días en un recipiente tapado en el refrigerador, pero se debe llevar a temperatura ambiente antes de servirla.", "Servir con un poco de salami o atún seco al aire."], "url": "www_bbc_co_uk_food_recipes_marinatedbeetroot_67843", "title": "Remolacha marinada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinatedbeetroot_67843_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pequeño racimo de cilantro fresco, picado", "100ml / 3½fl oz de aceite de oliva", "2 limas, cáscara de una sola y jugo de ambos", "20g / ¾oz de jengibre rallado", "2 dientes de ajo, aplastados", "1 chile fresco, picado", "pimienta de cayena ahumada, al gusto (si no está disponible, sustituya el pimentón picante ahumado)", "4 pechugas de pollo"], "method": ["Para el adobo, coloque el cilantro picado, el aceite de oliva, la ralladura de lima y el jugo, el jengibre, el ajo y el chile en un bol.", "Sazonar, al gusto, con pimienta de cayena y batir bien.", "Coloque las pechugas de pollo en un plato hondo. Vierta el adobo sobre el pollo, cubriéndolo por completo. Cubra el plato y deje que el pollo se mase durante tres horas.", "Precalentar la barbacoa hasta que los carbones estén al rojo vivo.", "Coloque las pechugas de pollo en la barbacoa y cocine durante 15-25 minutos, o hasta que estén completamente cocidas, volteándolas de vez en cuando."], "url": "www_bbc_co_uk_food_recipes_marinatedchickenbrea_86535", "title": "Pechuga de pollo marinada a la parrilla con lima, cilantro, jengibre y chile", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "2 dientes de ajo, pelados y en rodajas", "gran ramita de tomillo fresco", "gran ramita de romero fresco", "8 chuletas de cordero", "sal y pimienta negra recién molida", "150g / 5½oz de mantequilla sin sal, suavizada", "2 dientes de ajo, pelados y triturados", "1 cucharada de perejil fresco de flatleaf, picado", "8 hongos de campo frescos, tallos eliminados", "sal y pimienta negra recién molida, al gusto"], "method": ["Para las chuletas de cordero marinado, vierta tres cucharadas de aceite de oliva en un plato hondo o bandeja y agregue el ajo en rodajas.", "Frote el tomillo y el romero entre sus manos para ayudar a liberar los aceites aromáticos de las hierbas, antes de colocarlos en el plato engrasado.", "Coloque las chuletas de cordero sobre las hierbas y el ajo antes de cubrir con la cucharada restante de aceite de oliva. Cubra y coloque en una nevera para marinar durante la noche.", "Para la mantequilla de ajo, mezcle la mantequilla y el ajo picado en un bol con el perejil.", "Para los hongos de campo, vierta la mezcla de mantequilla de ajo en la parte inferior de los champiñones. Sazonar con sal y pimienta negra recién molida.", "Precalentar una barbacoa hasta que los carbones estén al rojo vivo. (Alternativamente, cocine en una sartén muy caliente o debajo de una parrilla alta).", "Retire las chuletas de cordero del adobo y drene el exceso de aceite. Sazonar con sal y pimienta negra recién molida. Coloque en la barbacoa con una ramita de romero sobre cada chuleta y cocine a su gusto.", "Mientras tanto, coloque los champiñones en la barbacoa, con la mantequilla hacia arriba y cocine lentamente.", "Para servir, coloque los champiñones y las chuletas de cordero en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_marinatedlambchopswi_86536", "title": "Chuletas de cordero marinado con champiñones a la brasa y mantequilla de ajo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de cordero, hazlos limpiar por tu carnicero", "Chutney de fruta picante de 200ml / 7fl oz", "50 ml / 1½ flf oz de mermelada de albaricoque", "1 lata de cola", "2 cucharadas de masala en pasta", "2 cucharaditas de cúrcuma", "2 cucharadas de pasta de tamarindo", "sal de maldon", "pimienta negra recién molida"], "method": ["Mezcle todos los ingredientes del adobo en un tazón grande.", "Sumergir el cordero en el adobo durante 2 horas.", "Saca el cordero del adobo y quítate el exceso.", "Coloque la sartén de la plancha o la sartén sobre la placa y rocíe con aceite de oliva, asegúrese de que la sartén esté caliente.", "Coloque los filetes del cuello en la sartén y la plancha durante 8-10 minutos."], "url": "www_bbc_co_uk_food_recipes_marinatedlamb_10898", "title": "Cordero marinado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 filetes de caballa", "½ limón", "10 bayas de enebro, ligeramente trituradas", "1 ramita de tomillo, solo hojas", "1 cantidad de adobo agridulce", "sal y pimienta negra recién molida", "400ml / 14fl oz de agua", "Azúcar en polvo de 110 g / 4 oz", "100ml / 3½fl oz de jugo de limón", "2 palitos de regaliz pequeños, ligeramente triturados", "Anís de 4 estrellas"], "method": ["Saca los huesos de alfiler de la caballa con unas pinzas, corta los filetes en grandes diamantes y colócalos en un plato hondo.", "Corta el limón por la mitad verticalmente por el medio, luego córtalo en finos semicírculos. Coloque estos entre los diamantes de caballa, luego se esparcen sobre las bayas de enebro triturado, sal, pimienta y tomillo.", "Combine el agua, el azúcar y el jugo de limón para el adobo en una cacerola y llévelo a ebullición. Mezcle los palitos de regaliz y el anís estrellado y cocine a fuego lento durante 1 minuto.", "Vierta el adobo sobre los diamantes de caballa mientras aún esté caliente. Cubra con film transparente y deje a temperatura ambiente hasta que esté completamente frío, luego refrigere por 2-3 horas dependiendo del tamaño del pescado, un máximo de 2½ horas para filetes pequeños, de lo contrario la consistencia del pescado sufre.", "Sirva la caballa directamente del plato, permitiendo que todos sazonen sus propios pescados."], "url": "www_bbc_co_uk_food_recipes_marinatedmackereldia_65552", "title": "Diamantes de caballa marinada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz cada una de aceitunas negras y verdes", "4 cucharadas de aceite extra virgen", "3 pequeñas ramitas de tomillo fresco, romero y orégano", "4 pequeñas hojas frescas de laurel", "1 diente de ajo grande, cortado en rodajas finas", "2 rodajas de limón, descuartizado"], "method": ["Simplemente mezcle todo, cubra y reserve por 3-4 horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_marinatedolives_498", "title": "Aceitunas marinadas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 30", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3 oz champiñones, cepillado limpio", "2 cucharadas de vinagre balsámico", "1 cucharada de miel", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "100 g / 3½ oz de espinaca de hoja de bebé", "1 limón, solo jugo", "50g / 2oz de queso de cabra, en rodajas", "gran puñado de perejil, más o menos picado", "½ diente de ajo, finamente picado", "1 cucharadita de sal marina", "pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Para hacer los champiñones marinados, coloque los champiñones en un tazón pequeño, agregue el vinagre balsámico, la miel, la sal y la pimienta negra recién molida. Revuelva bien y deje en infusión durante 10 minutos. Escurra el exceso de adobo y reserve.", "Precalentar la parrilla a su configuración más alta.", "Caliente el aceite de oliva en una sartén grande, agregue la espinaca, el jugo de limón, la sal y la pimienta negra recién molida y mezcle bien. Cocine por 1-2 minutos hasta que se marchite.", "Retire del fuego, escurra y exprima el exceso de jugo. Coloque la espinaca en el anillo de un cocinero en una bandeja para hornear y coloque los champiñones escurridos encima. Retire el anillo de los chefs, agregue el queso de cabra en rodajas y colóquelo debajo de la parrilla durante cuatro minutos o hasta que se dore un poco.", "Para hacer el \"pesto\", coloque todos los ingredientes en un mortero o mortero o una mini licuadora y muela o licúe hasta que tenga una pasta homogénea.", "Para servir, deslice la pila de champiñones en un plato pequeño y rocíe el pesto por el costado."], "url": "www_bbc_co_uk_food_recipes_marinatedmushroomswi_81826", "title": "Champiñones marinados con queso de cabra a la plancha, pesto de espinacas y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ repollo rojo, en rodajas finas", "3 cucharadas de vinagre balsámico", "5 cucharadas de aceite de oliva", "50g / 1¾oz de nueces picadas", "1 puñado de cilantro fresco, picado", "2 naranjas, peladas, segmentadas"], "method": ["Coloque la col lombarda, el vinagre balsámico, el aceite de oliva, las nueces y el cilantro en un bol. Mezcle bien y deje macerar durante cinco minutos.", "Para servir, coloque la ensalada en un plato y cubra con las rodajas de naranja."], "url": "www_bbc_co_uk_food_recipes_marinatedredcabbagea_84895", "title": "Ensalada de col roja y nuez marinada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo, sin semillas, descuartizado", "4 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "2 dientes de ajo, aplastados", "6 hojas de albahaca fresca, aproximadamente desgarradas", "100 g / 3½ oz anacardos, tostados", "2 cucharadas de aceite de oliva", "1 puñado de hojas frescas de cilantro"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pimiento asado, coloque el pimiento en una bandeja para hornear y rocíe sobre una cucharada de aceite. Coloque en el horno para asar durante 8-10 minutos, o hasta que estén tiernos, luego retire y mezcle con los ingredientes restantes de pimienta en un tazón.", "Para el aderezo tostado de anacardo, coloque los anacardos y el aceite en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, esparza las hojas de cilantro sobre un plato para servir y apile el pimiento asado encima. Rocíe sobre el aderezo de anacardo y sirva."], "url": "www_bbc_co_uk_food_recipes_marinatedroastedpepp_89250", "title": "Pimientos asados ​​marinados con aderezo de marañón tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 400g / 14oz, lavadas y descuartizadas", "Azúcar en polvo de 55 g / 2 oz", "½ limón, solo jugo", "pizca de pimienta blanca molida", "1 cucharadita de menta fresca finamente picada", "crema coagulada, para servir"], "method": ["Coloque la mitad de las fresas en un tazón grande con la mayor parte del azúcar y todo el jugo de limón. Usando un tenedor, machaque bien. Mezcle las fresas en cuartos restantes en la mezcla de puré de fresas.", "Sazonar la mezcla con el pimiento y la menta picada y ajustar la dulzura al gusto con el azúcar restante. Cubra y deje macerar en la nevera durante 30 minutos.", "Para servir, coloque las fresas en tazones y cuchara sobre la crema coagulada."], "url": "www_bbc_co_uk_food_recipes_marinatedstrawberrie_86537", "title": "Fresas marinadas con menta y crema cuajada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]