[{"ingredients": ["300g / 10½oz bourbon biscuits, aplastados", "75g / 2½oz de mantequilla, derretida", "85g / 3oz de chocolate negro, mínimo 70 por ciento de sólidos de cacao", "85g / 3oz de mantequilla", "2 huevos de gallinas camperas", "85g / 3oz de azúcar mascabado", "Crema doble de 100ml / 3½oz", "150 g / 5½ oz de chocolate negro, mínimo 70 por ciento de sólidos de cacao", "Crema doble de 150 ml / 5½ fl oz, más extra para servir", "3 cucharadas de jarabe de oro", "175g / 6oz de azúcar glas, tamizado"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Mezcle los bizcochos y la mantequilla derretida en un bol. Presione la mezcla en la base y los lados de una lata de resorte de 23 cm / 9 in. Enfriar en la nevera durante 10 minutos.", "Para el relleno, derrita el chocolate y la mantequilla en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque el agua).", "Mientras tanto, mezcle los huevos y el azúcar juntos en un tazón de 5 a 6 minutos o hasta que estén espesos y cremosos. Agregue la crema y la mezcla de chocolate derretido. Verter en la lata de springform enfriada y hornear en el horno durante 40-50 minutos, o hasta que esté listo. Retire del horno y deje a un lado para que se enfríe completamente.", "Mientras tanto, para la salsa de chocolate, caliente todos los ingredientes de la salsa de chocolate en una cacerola, revolviendo regularmente, a fuego medio hasta que la mezcla esté suave y brillante. Dejar enfriar por 5 minutos.", "Extienda la salsa sobre la tarta enfriada y deje enfriar en la nevera durante 20 minutos. Sirve con crema doble."], "url": "www_bbc_co_uk_food_recipes_mississippimudpie_93659", "title": "Pastel de Mississippi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mississippimudpie_93659_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 400 g de ensalada de frijoles mezclados, escurridos y enjuagados", "2 cebollas tiernas, finamente picadas", "2 palitos de apio, en rodajas finas", "1 tomate grande, sin semillas y finamente cortado en cubitos", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de azúcar", "2 cucharaditas de mostaza Dijon", "1 cucharada de estragón fresco picado", "1 cucharada de perejil fresco picado"], "method": ["Coloque todos los ingredientes de la ensalada en un tazón y mezcle bien.", "Mezcle los ingredientes del aderezo en un tazón o jarra por separado hasta que estén bien combinados.", "Vierta el aderezo sobre la ensalada, sazone bien con sal y pimienta y mezcle."], "url": "www_bbc_co_uk_food_recipes_mixed_bean_salad_89055", "title": "Ensalada de frijoles mixtos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mixed_bean_salad_89055_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 300g / 10½oz de filete de halibut, escalado, deshuesado y cortado en cubos de 5cm / 2in", "4 vieiras grandes, limpiadas y eliminadas de sus caparazones", "4 gambas grandes, conchas eliminadas, desvenaduradas", "1 langosta, carne extraída y cortada en cubos de 2½ cm / 1 in, reserva 1 uña", "1 calamar, limpiado y cortado en anillos de 1 cm / ½ en grueso", "2 patatas pequeñas, peladas, hervidas y en rodajas (aproximadamente 1 cm / ½ pulgadas de espesor)", "2 berenjenas pequeñas, cortadas en rodajas de 1cm / ½ pulgada de grosor", "8 tomates cherry en la vid", "1½ cucharadita de sal", "3 cucharadas de aceite vegetal", "½ cucharadita de azúcar", "1 cucharadita de cúrcuma molida", "½ cucharadita de chile rojo en polvo", "½ cucharadita de semillas de hinojo", "½ cucharadita de semillas de nigella", "berro de coriandro, para adornar", "2 cucharadas de aceite", "4 vainas de cardamomo verde, aplastadas", "10 granos de pimienta, aplastados", "2 hojas de laurel", "1 cucharadita de semillas de cebolla", "1 cucharadita de semillas de hinojo", "1 cebolla grande, finamente picada", "¼ cucharadita de cúrcuma molida", "1 cucharadita de chile rojo en polvo", "1½ cucharadita de comino molido", "2 tomates, finamente picados", "2 chiles verdes calientes, finamente picados", "750 ml / 1¼ pinta de pescado", "1¼ cucharadita de sal", "½ cucharadita de azúcar", "2 cucharadas de cilantro fresco picado", "1 limón, solo jugo", "pellizcar el cardamomo de tierra", "arroz basmati hervido"], "method": ["Lave los mariscos y séquelos con papel de cocina. Espolvoree los mariscos, las patatas, la berenjena y los tomates con sal y aceite vegetal. Espolvorea sobre el azúcar y las especias, cúbrelo y colócalo en la nevera.", "Mientras tanto, para el caldo, caliente el aceite en una sartén grande a fuego alto. Una vez caliente, agregue las vainas de cardamomo, los granos de pimienta, las hojas de laurel, las semillas de cebolla y las semillas de hinojo y deje que crujen. Agregue las cebollas y cocine a fuego alto hasta que estén doradas, esto tomará aproximadamente 10 minutos.", "Agregue la cúrcuma, el chile en polvo y el comino y fría con cuidado durante 1 minuto. Agregue los tomates y los chiles y fría con cuidado durante 3 minutos. Agregue el caldo de pescado, la sal y el azúcar. Reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Agregue el cilantro y el jugo de limón y cocine durante 2 minutos. Pase el caldo a través de un colador y agregue el cardamomo molido. Mantener caliente", "Calienta una sartén grande antiadherente. Agregue la mezcla de mariscos, excepto la langosta y el calamar. Cocine a fuego moderado durante 2 minutos.", "Agregue la langosta y cocine por un minuto más o menos. Agregue los anillos de calamar y, a medida que colorean, voltee la mezcla en la sartén. Cocine el otro lado por otros 2 minutos hasta que el marisco y los vegetales estén recién cocinados.", "Retire de la sartén y coloque en un tazón grande. Espolvorear con el berro de cilantro y verter sobre el caldo. Sirva inmediatamente con arroz basmati."], "url": "www_bbc_co_uk_food_recipes_mixed_seafood_in_a_40876", "title": "Mariscos mixtos en caldo bengalí (Macher jhol)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Remolacha cruda 250 g / 9 oz, preferiblemente variedades mixtas y colores, como blanco, dorado y rojo", "250g / 9oz de espárragos", "puñado de hojas de acedera de plata, o hojas verdes de acedera si no están disponibles", "150-200g / 5½-7oz de queso de cabra, roto en pequeñas pepitas, preferiblemente de Woolsery", "2-3 nueces en vinagre, picadas en cubos pequeños", "sal y pimienta negra recién molida", "1 cucharada de vinagre de sidra", "3 cucharadas de aceite de colza prensado en frío", "sal y pimienta negra recién molida"], "method": ["Cocine la remolacha en sus pieles en agua hirviendo con sal durante aproximadamente una hora o hasta que estén tiernas. (Si utiliza diferentes colores, cocínelos por separado.) Drene y deje enfriar; luego frote las pieles (es posible que desee usar guantes al hacer esto para evitar que las manos se manchen).", "Corta los extremos leñosos de los espárragos. Cocine las lanzas en agua hirviendo con sal durante 5-6 minutos o hasta que estén tiernas. Escurrir y dejar enfriar.", "Cortar las remolachas en trozos del tamaño de un bocado (una mezcla de rodajas y cuñas). Corta las lanzas de espárragos por la mitad.", "Prepare el aderezo batiendo el vinagre de sidra y el aceite de colza con sal y pimienta negra recién molida al gusto.", "Para servir, coloque cuidadosamente la remolacha y los espárragos en los platos con las hojas de acedera, luego esparza el queso de cabra y las nueces en escabeche sobre la parte superior. Rocíe sobre el aderezo justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_mixedbeetrootsandasp_86324", "title": "Remolachas mixtas y espárragos con queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 yemas de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "110ml / 3fl oz de champán", "6 hojas frescas de albahaca, finamente picadas", "Frambuesas 50g / 2oz", "50 g / 2 oz de fresas", "50 g / 2 oz moras", "50g / 2oz de arándanos", "50 g / 2 oz de azúcar en polvo"], "method": ["Para el sabayon, coloque un recipiente de vidrio sobre una olla de agua apenas hervida. Agregue las yemas de huevo y el azúcar y bata continuamente, hasta que estén claros y pálidos.", "Agregue el champán y continúe batiendo hasta que esté pálido y esponjoso. (La espuma debe espesarse lo suficiente para que no se rompa cuando se enfríe.) Retirar del fuego y enfriar hasta que esté tibia.", "Para el gratinado de bayas, coloque todas las bayas y el azúcar en un tazón y mezcle. Luego divídelo en cuatro recipientes a prueba de horno.", "Agregue la albahaca al sabayon, mezcle bien, luego cuchara el sabayon sobre las bayas.", "Usando un mini soplete, caliente la parte superior del sabayon hasta que se ponga dorado, luego sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mixedberrygratinwith_84245", "title": "Mezcla de gratinado de bayas con sabayón de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre listo para enrollar de 10cm / 4in cuadrado", "azúcar glas, al polvo", "1 cucharada de bayas congeladas, descongeladas", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharada de azúcar glas", "100g / 3½oz de bayas congeladas, descongeladas, más extra para servir", "hojas de menta fresca, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el paquete de bayas mixtas, espolvorea la masa con azúcar glas y coloca las bayas en el centro.", "Cepille los bordes de la masa con el huevo batido y doble las esquinas hacia el centro. Pellizca los bordes para sellar el relleno dentro de la masa.", "Coloque el paquete en una bandeja para hornear antiadherente, transfiéralo al horno y hornee durante 10-12 minutos, o hasta que esté ligeramente levantado y dorado.", "Para el coulis, coloque el azúcar glas y las bayas en un procesador de alimentos y mezcle hasta que quede suave. Cuele la mezcla a través de un tamiz para eliminar las pepitas.", "Para servir, vierta un grupo de coulis en un plato de servir y cubra con el paquete de bayas mixtas. Adorne con bayas y menta fresca."], "url": "www_bbc_co_uk_food_recipes_mixedberryparcelwith_86148", "title": "Paquete de bayas mixtas con coulis de bayas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de crema doble, batida", "1 cucharada de azúcar glas", "10 dedos de esponja", "1 naranja, en rodajas", "¼ de piña en rodajas", "4 hojas de menta fresca"], "method": ["Mezcle la crema doble con el azúcar.", "Molde de anillo de 5 pulgadas / 12.5cm con algunos dedos de esponja.", "Cubra con la crema, luego agregue la fruta en rodajas y termine con las ramitas de menta.", "Retire el molde del anillo y sirva."], "url": "www_bbc_co_uk_food_recipes_mixedfruitcharlotte_77133", "title": "Mezcla de fruta charlotte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "4 muslos de pollo deshuesados, piel sobre", "Vientre de cerdo 100 g / 3½ oz, cortado en cubos de 1 cm / ½ in", "Calamares para bebé de 100 g / 3½ onzas, cortados en anillos", "75g / 3oz de chorizo, picado", "1 cebolla picada", "1 diente de ajo", "400g / 14oz de arroz de grano corto o arroz de paella (como Calasparra)", "1 cucharada de romero seco", "pellizque los hilos de azafrán, empapados en 3-4 cucharadas de leche", "1 litro / 1 pinta 15fl oz de caldo de pollo", "sal y pimienta negra recién molida", "8 tomates de ciruela, picados", "8 langostinos con cáscara extraídos y sin piel", "125g / 4oz de pescado fresco surtido (como salmón, eglefino o bacalao), sin piel, sin hueso, cortado en trozos", "cuñas de limón, para servir"], "method": ["Caliente el aceite en una paella o en una sartén ancha, profunda y de fondo grueso.", "Agregue los muslos de pollo y cocine hasta que se doren por todos lados. Agregue los cubitos de cerdo, el calamar y el chorizo ​​y freír hasta que estén dorados por completo, luego retírelos de la sartén y déjelos a un lado.", "En la misma sartén, freír la cebolla y el ajo durante 3-4 minutos, hasta que se ablanden.", "Agregue el arroz, el romero, el azafrán y su leche, y aproximadamente la mitad del caldo. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 18-20 minutos, agregando más caldo si el arroz se seca.", "Regrese el pollo y la carne de cerdo a la sartén, revuelva bien y permita que continúe hirviendo a fuego lento durante diez minutos, agregando un poco más de caldo si es necesario, hasta que el pollo esté completamente cocido.", "Agregue el calamar cocido y el chorizo ​​y mezcle bien.", "Agregue los langostinos, el surtido de pescado y los tomates y cocínelos durante aproximadamente 8-10 minutos, o hasta que los pescados y gambas estén recién hechos.", "Para servir, coloque la paella en tazones calientes con una rodaja de limón al costado."], "url": "www_bbc_co_uk_food_recipes_mixedpaella_86766", "title": "Paella mixta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ berenjena mediana, picada", "2 zanahorias pequeñas, picadas", "100 g / 4 oz de judías verdes, a la mitad", "1 patata mediana, picada", "Guisantes 100g / 4oz (congelado está bien)", "50g / 2oz de coco desecado sin endulzar, empapado en un poco de agua caliente durante cinco minutos", "4 chiles verdes, más o menos picados (o al gusto)", "1 cucharadita de sal", "3 tomates medianos, toscamente picados", "1 cucharada de yogur natural", "1 cucharadita de sal masala", "2 cucharadas de hojas frescas de cilantro picado"], "method": ["Coloque la berenjena, zanahorias, judías verdes y patatas en una sartén de tamaño mediano. Agregue 250 ml / 8 fl oz de agua.", "Llevar a ebullición, agregar los guisantes, tapar, calentar a fuego medio y cocinar durante cuatro minutos o hasta que los vegetales estén tiernos.", "Mientras tanto, coloca el coco, los chiles y la sal en el tazón de un procesador de alimentos. Agregue 150ml / 5fl oz de agua y mezcle hasta formar una pasta fina. Dejar de lado. (Siempre puedes picar finamente a mano, pero es posible que quieras ponerte guantes al cortar los chiles)", "Cuando las verduras estén recién cocidas, agregue la pasta de chile. Revuelva y cocine a fuego lento suavemente durante cinco minutos.", "Agregue los tomates, el yogur y el garam masala. Revuelva suavemente para mezclar bien. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 2-3 minutos o hasta que las papas estén cocidas.", "Para servir, coloca el curry de verduras en un plato para servir y adorna con el cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_mixedvegetablecurry_90225", "title": "Curry de verduras mixtas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mixedvegetablecurry_90225_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de harina de pan blanco, refrigerada, más extra para quitar el polvo", "150g / 5½oz de harina común refrigerada", "pizca de sal", "2 huevos grandes de gallinas camperas, más extra para glasear", "250g / 9oz de mantequilla sin sal, refrigerada", "azúcar en polvo, para rociar", "200 g / 7 oz% 20plain% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "400ml / 14fl oz de leche entera", "100 g / 3½ oz de azúcar en polvo", "4 yemas de huevo grandes de gallinas camperas", "40 g / 1½ oz de harina de maíz", "1 cucharada de extracto de café", "Crema doble de 150 g / 5½ oz", "1 cucharada de limoncello", "250g / 9oz de ricotta", "75g / 2½oz de cáscara confitada, picada, más extra para la decoración"], "method": ["Para la masa de hojaldre, ponga las harinas, sal, huevos y 100 ml / 3½ fl oz de agua fría en un tazón grande y mezcle suavemente con los dedos hasta formar una masa pareja. Transfiera la masa a una superficie ligeramente enharinada y amasar durante 5-10 minutos hasta que quede suave. La masa debería sentirse un poco apretada en esta etapa. Forme la masa en una bola y colóquela en una bolsa de plástico en la nevera para que se enfríe durante toda la noche o durante al menos 7 horas.", "Aplaste la mantequilla en un rectángulo, de aproximadamente 40x19cm / 16x7½ pulgadas, golpeándola con un rodillo (puede encontrarlo más fácil si coloca la mantequilla entre 2 hojas de película adhesiva). Regrese a la nevera por una hora para endurecer la mantequilla nuevamente.", "Estira tu masa a un rectángulo, de aproximadamente 60x20cm / 24x8 pulgadas de ancho. Coloque la mantequilla sobre la masa para que cubra los dos tercios inferiores. Asegúrese de que esté bien colocado y cubra casi hasta los bordes.", "Levanta la masa expuesta en la parte superior y dobla hacia abajo más de la mitad de la mantequilla, luego dobla la mitad inferior de la masa cubierta de mantequilla por la parte superior. Ahora tendrás un sándwich de dos capas de mantequilla y tres de masa. Pellizca los bordes para sellar. Vuelva a colocarlo en una bolsa de plástico y deje enfriar por 1 hora.", "Saque la masa de la bolsa y colóquela en una superficie ligeramente enharinada con un borde corto hacia usted. Estire hacia un rectángulo como antes, manteniendo los bordes lo más limpios posible. Doble el cuarto superior hacia abajo y el cuarto inferior hacia arriba para que se encuentren perfectamente en el centro. Luego dobla la masa por la mitad a lo largo de la línea central. Esto se llama un giro de libro. Enfríe en la bolsa por 1 hora.", "Saque la masa de la bolsa, colóquela en una superficie ligeramente enharinada con el extremo corto hacia usted y gírela en un rectángulo como antes. Esta vez, dobla hacia abajo un tercio de la masa y luego dobla hacia arriba el tercio inferior para formar un cuadrado ordenado. Esto se llama un solo turno. Enfríe en la bolsa por otra hora.", "Saca la masa nuevamente y haz un solo giro como anteriormente. Enfríe en la bolsa durante la noche.", "Para la moca crème pâtissière, derrita la mitad del chocolate en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. Vierta la leche en una cacerola y llévela a ebullición, luego retírela del fuego.", "Batir el azúcar, las yemas de huevo y la harina de maíz en un tazón grande. Vierta un poco de la leche caliente en la mezcla de huevo, batiendo continuamente. Agregue el resto de la leche caliente hasta que esté bien combinada, batiendo todo el tiempo. Regrese la mezcla a la sartén y cocine a fuego lento, revolviendo continuamente, hasta que la mezcla se espese.", "Retire del fuego y pase la mezcla a través de un colador en un recipiente limpio. Agregue el chocolate derretido y el extracto de café y revuelva hasta que estén bien combinados. Cubra la superficie con film transparente para evitar que se forme la piel y enfríe bien antes de usar.", "Para el relleno de tutti frutti, batir la crema y el limoncello hasta que se formen picos suaves cuando se quite el batidor. Doble la ricota y la cáscara picada. Cubra con film transparente y enfríe antes de usar.", "Para los cuernos de crema, forrar una bandeja para hornear con papel de hornear antiadherente. Precalentar el horno a 200C / 180C Fan / Gas 6.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta que su borde más largo tenga 60 cm de largo. Cortar la masa en tiras largas de 1cm / ½ pulgada de ancho. Comenzando en el extremo puntiagudo de un molde de cuerno de crema, envuelva una tira de pastelería alrededor del molde en espiral, con cada línea solapándose ligeramente. Coloque en la bandeja de horno. Repita para cubrir los 12 moldes. Cepille todos los bollos de hojaldre con huevo y espolvoree con azúcar.", "Hornee en el horno durante 12-15 minutos, o hasta que los cuernos estén dorados, crujientes y la masa se haya levantado. Transfiera a una rejilla para que se enfríe completamente. Una vez frío, retire cuidadosamente los moldes.", "Para ensamblar, derrita el chocolate normal restante en un tazón resistente al calor colocado sobre una fuente de agua hirviendo y sumerja el extremo ancho de 6 de los cuernos de crema en él. Deja para establecer. Con una cuchara, coloque la mocha crème pâtissière fría en una manga pastelera equipada con una boquilla de estrella y úsela para llenar los cuernos de crema de chocolate.", "Con una cuchara, coloque el tutti frutti en una manga pastelera equipada con una boquilla simple y úsela para llenar los 6 cuernos de crema restantes. Decorar con cáscara confitada picada. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mocha_and_tutti_frutti_12936", "title": "Cuernos de crema de moka y todas las frutas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 12 cuernos de crema", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mocha_and_tutti_frutti_12936_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de sal", "250 g / 9 oz de mantequilla sin sal muy fría, cortada en cubos", "1 huevo de gallinas camperas, batido para lavar huevos", "1 cucharada de azúcar demerara, para rociar", "50g / 1¾oz mascarpone", "25g / 1oz de azúcar glasé, más extra para quitar el polvo", "Crema doble de 200 ml / 7 fl oz", "2 cucharadas de café instantáneo, mezclado con 1 cucharada de agua hirviendo para hacer una pasta", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20sólidos)", "50 g / 1¾oz de avellanas tostadas, picadas"], "method": ["Para la masa de hojaldre, tamice la harina y la sal en un tazón. Agregue la mantequilla y use las yemas de los dedos para separar los trozos de mantequilla y formar copos en toda la harina. Agregue 125ml / 4fl oz de agua helada y mezcle con una espátula hasta que la masa se una. Amasar brevemente y luego cubrir y enfriar en el congelador durante 15 minutos.", "Aplique un poco de polvo a la superficie de trabajo con harina y extienda la masa en un rectángulo de aproximadamente 4 mm de grosor. Con un lado corto más cercano, pliegue hacia abajo el tercio superior en el centro, luego doble el tercio inferior hacia arriba. Gire la pastelería 90 grados (un cuarto de vuelta). Tire hacia afuera en un rectángulo nuevamente y repita el proceso de plegado. Envuelva la película adherida y deje enfriar en el congelador durante 10 minutos.", "Estirar la masa fría nuevamente y repetir el proceso de doblado. Dale otro cuarto de vuelta y rueda y dobla como antes. Enfríe en el congelador por otros 15 minutos.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "En una superficie de trabajo ligeramente enharinada, enrolle la masa hasta aproximadamente 3 mm de grosor. Recorte 12 tiras largas, de aproximadamente 2 cm de ancho y 30 cm de largo. Envuelva los moldes en las tiras de masa comenzando en la punta (no cubra la punta ya que la masa se expandirá a medida que se cocina) y trabajando hacia arriba, superponiéndose a la mitad. Coloque los cuernos con la costura hacia abajo en una bandeja para hornear forrada con una estera de silicona. Coloque la bandeja en el congelador durante 5 minutos.", "Cepillar los cuernos fríos con huevo batido y espolvorear con azúcar demerara. Hornee durante 10-12 minutos, hasta que la masa esté crujiente y dorada. Deje que se enfríe durante unos minutos antes de quitar los moldes y colocar los cuernos en una rejilla para que se enfríen por completo.", "Para el relleno de crema, coloque el mascarpone en un bol y bátalo con una cuchara de madera hasta que se ablande. Tamice el azúcar glas, mezcle completamente.", "En un recipiente separado, bate la crema hasta que se formen picos suaves cuando se quite el batidor. Doble la crema batida en el mascarpone con una cuchara de metal. Mezcle suavemente la mezcla de café enfriada. Coloque la mezcla en una bolsa de plástico con una boquilla de estrella.", "Para el relleno, derrita el chocolate en el microondas o en un recipiente resistente al calor colocado sobre una sartén de agua hirviendo a fuego lento. Coloque las nueces picadas en un tazón.", "Una vez que los cuernos de los pasteles se hayan enfriado, cepille el interior de cada uno con chocolate derretido y voltéelo boca abajo para drenar cualquier exceso. Sumerja la parte superior de los cuernos en el chocolate y luego sumerge las nueces. Enfríe hasta que el chocolate esté listo.", "Llene los cuernos con la mezcla de crema y el polvo con azúcar glas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mocha_hazelnut_cream_95152", "title": "Cuernos de crema de avellana mocha", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 cuernos de crema", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1½ limas, cortadas en cuñas", "20 hojas de menta fresca", "2½ cucharaditas de azúcar granulada", "puñado de hielo", "Ron blanco 65ml / 2½fl oz", "salpicar agua de soda, al gusto", "ramita de menta fresca, para adornar"], "method": ["Coloque las limas, la menta y el azúcar en un vaso alto resistente y \"revuelva\" o mezcle con el extremo de un rodillo limpio, para magullar la menta y liberar el jugo de limón.", "Agregue el hielo y vierta sobre el ron.", "Agregue soda agua al gusto y mezcle bien. Adorne con una ramita de menta y sirva."], "url": "www_bbc_co_uk_food_recipes_mojito_85338", "title": "Mojito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mojito_85338_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "3 huevos grandes de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "65g / 2¼ oz de harina de auto crianza", "1 cucharada de harina de maíz", "50g / 1¾oz de mantequilla", "1 cucharada de café instantáneo", "225g / 8oz de azúcar glas, cernida", "40 g / 1½ oz de azúcar en polvo", "1 yema de huevo grande de gallinas camperas", "75 g / 2½ oz de mantequilla ablandada", "2 cucharaditas de esencia de café", "4 cucharadas de mermelada de albaricoque", "100 g / 3½ oz de almendras picadas, tostadas", "100 g / 3½ oz de glaseado de fondant listo para enrollar blanco", "colorante de alimentos en gel en marrón oscuro"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forre una lata de torta cuadrada de 18 cm / 7 pulgadas y forre la base con papel para hornear.", "Para el genoise, derrita suavemente la mantequilla en una sartén, luego déjelo a un lado para que se enfríe un poco. Mida los huevos y el azúcar en un tazón grande y bata a toda velocidad hasta que la mezcla esté pálida, parecida a un mousse y lo suficientemente espesa para dejar un rastro cuando se levante el batidor de la mezcla.", "Tamiza las harinas en un bol. Con cuidado, doble la mitad de la harina en la mezcla de huevo, vierta suavemente la mitad de la mantequilla enfriada alrededor del borde de la mezcla y dóblela. Repita con la harina restante y la mantequilla. Vierta la mezcla en la lata preparada.", "Hornee por 35-40 minutos hasta que esté bien levantado y la parte superior de la torta salta hacia atrás cuando se presiona ligeramente con el dedo. Deje que se enfríe en la lata durante unos minutos, luego sáquelo, despegue el pergamino y termine de enfriar en una rejilla de alambre.", "Para hacer el glaseado de café, mida la mantequilla en una sartén pequeña y caliéntela suavemente hasta que la mantequilla se derrita. Retire del fuego y agregue el polvo de café hasta que se disuelva. Agregue el azúcar glas y bata hasta que quede suave y brillante. Reservar para espesar", "Para la crème au beurre moka, mida el azúcar y 2 cucharadas de agua en una sartén pequeña de base pesada. Caliente muy suavemente hasta que el azúcar se haya disuelto. Llevar a ebullición y luego hervir constantemente durante 2-3 minutos o hasta que el almíbar esté limpio y forme un hilo delgado cuando se separa entre 2 cucharaditas. (PRECAUCIÓN: el azúcar derretido está muy caliente. Tenga cuidado de no quemarse).", "Coloca las yemas de huevo en un tazón pequeño y dales un batidor rápido para separarlas. Agregue el jarabe en una corriente delgada sobre las yemas, batiendo todo el tiempo hasta que se incorpore todo el jarabe y la mezcla esté espesa y fría (es más fácil hacerlo en un mezclador independiente).", "En otro tazón, bata la mantequilla hasta que esté muy suave y bate gradualmente en la mezcla de yema de huevo. Agregue la esencia del café al sabor. Coloque una cuchara en una manga pastelera equipada con una boquilla de 7 estrellas.", "Para ensamblar, corte la torta fría por la mitad horizontalmente y emparede las rebanadas con el glaseado de café. Recorte los bordes y corte el pastel en 9 cuadrados iguales.", "Calienta la mermelada de albaricoque en una sartén, luego pasa a través de un colador en un tazón pequeño. Cepille los lados de los pasteles con mermelada de albaricoque y presione las almendras picadas alrededor de los lados.", "Pipeta pequeñas rosetas de crème au beurre moka muy juntas en torno al borde superior de las tortas (deben crear un contorno sólido que se pueda rellenar con glaseado). Pipe las pequeñas rosetas de crème au beurre moka alrededor del borde inferior de las tortas.", "Para el glaseado de fondant, amase el glaseado de fondant hasta que esté suave (si es realmente difícil, caliente en el microondas durante unos segundos). Batir con una cuchara de madera hasta que quede suave (alternativamente, puede hacerlo en un procesador de alimentos). Poco a poco, agregue 4 cucharadas de agua y suficiente colorante para hacer un glaseado de color café. Con cuidado, vierta el glaseado en el centro de la parte superior de los pasteles y déjelo reposar."], "url": "www_bbc_co_uk_food_recipes_mokatines_96500", "title": "Gatos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mokatines_96500_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20 hojas de menta fresca", "2 cucharaditas de azúcar moreno", "20ml / ¾fl oz de jugo de limón", "Ron blanco 50ml / 1¾ fl oz", "200ml / 7fl oz de agua caliente"], "method": ["Coloque la menta y el azúcar moreno en el fondo de un vaso alto y resistente al calor.", "Agregue el jugo de lima y mezcle (mezcla) junto con el extremo de un rodillo limpio o una cuchara de madera.", "Agregue el ron, luego el agua caliente y sirva."], "url": "www_bbc_co_uk_food_recipes_mojitominttea_84409", "title": "Té de menta Mojito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4¼oz de mantequilla sin sal, más extra para engrasar", "150g / 5oz de chocolate (70 por ciento de sólidos de cacao)", "4 huevos de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "Harina de 50g / 2oz de levante, más extra para quitar el polvo", "1 cucharada de cacao en polvo, más extra para quitar el polvo", "mascarpone, para servir"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque la mantequilla y el chocolate en un recipiente resistente al calor. Coloque el recipiente sobre una fuente de agua a fuego lento y permita que el chocolate y la mantequilla se derritan.", "Una vez que el chocolate y la mantequilla se hayan derretido, revuelva para combinar, luego deje a un lado y deje enfriar.", "Coloque los huevos y el azúcar en un tazón limpio y bata durante 4-5 minutos, o hasta que estén pálidos y claros.", "Agregue la mezcla de huevo a la mezcla de chocolate y doble suavemente, teniendo cuidado de mantener el volumen en los huevos.", "Agregue la harina y el cacao en polvo y pliéguelo.", "Engrasar y enharinar seis moldes de 200 ml / 7 fl oz o moldes dariole.", "Divida la mezcla de chocolate entre los moldes. Colóquelo en una bandeja para hornear y transfiéralo al horno para hornear durante 7-8 minutos, o hasta que se endurezca, pero aún con un poco de oscilación en el centro.", "Afloje los postres y con mucho cuidado conviértelos en platos.", "Espolvorea los budines con cacao en polvo y sirve con una cucharada de mascarpone en la parte superior."], "url": "www_bbc_co_uk_food_recipes_moltenchocolatepuddi_86227", "title": "Pudín de chocolate fundido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva", "1 cebolla picada", "3 pimientos mixtos, picados", "2 cucharadas de ajo, aplastado", "4 enlaces de chorizo, picados", "450 g / 1 lb de trozos de pollo, dentro o fuera del hueso", "2 Scotch Bonnet u otros chiles picantes, 1 rojo, 1 amarillo, picado", "500 g / 1 lb 1 oz de fácil preparación de arroz de estilo americano", "1 cucharadita de chile en polvo", "2 cucharadas de cúrcuma", "2 cucharadas de especias Cajun", "2 pintas de caldo de pollo o agua", "verduras mixtas, como zanahorias, guisantes, judías verdes, coles, calabacines, picadas (verduras congeladas serán suficientes)", "450g / 1 libra de langostinos o cigalas", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva en una sartén grande y agregue la cebolla, pimientos mixtos, ajo, chorizo ​​y trozos de pollo. Cocine por unos diez minutos.", "Agregue los chiles. Estos son muy calientes, así que ten cuidado cuántos agregues. Al manipularlos, tenga cuidado si tiene algún corte, ya que realmente le dolerán.", "Agregue el arroz y mezcle bien. Agregue el chile en polvo, la cúrcuma y las especias de Cajun y mezcle para que el arroz esté bien cubierto con los sabores.", "Agregue el caldo de pollo o agua y cocine a fuego lento.", "Agregue las verduras mixtas y deje que hierva, luego baje la temperatura a fuego lento.", "Una vez que el arroz se haya hinchado y esté parcialmente cocido, agregue las gambas o el cangrejo de río.", "Cocine a fuego lento durante aproximadamente 45 minutos a una hora. Saborea los condimentos y agrega sal y pimienta negra recién molida y más especias, según tu gusto personal.", "Servir."], "url": "www_bbc_co_uk_food_recipes_mommasmeatjambalaya_76386", "title": "La carne de mamá jambalaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mommasmeatjambalaya_76386_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "1 alcachofa globo fresco, solo corazón, descuartizado", "1 rape de rape, fileteado, sin piel, descuartizado, carcasa reservada", "100g / 3½ oz pancetta, picada en cubos de 1 cm", "8 chalotes pequeños", "2 dientes de ajo, 1 aplastado, 1 rebanado fino", "150ml / 5fl oz de vino tinto", "200ml / 7fl oz de caldo de pollo oscuro", "8 hongos castaños, descuartizados", "4 ramitas de tomillo, solo hojas", "25 g / 1oz de mantequilla sin sal", "4 ramitas de perejil, solo hojas, finamente picadas"], "method": ["Vierta 3 cucharadas de aceite de oliva en una cacerola tapada de base pesada a fuego lento y agregue los cuartos de alcachofa. Cubra con una tapa y cocine durante 5-6 minutos. Sáquelo del fuego y apártelo.", "Ponga 1 cucharada de aceite en una sartén grande a fuego alto. Triture la carne de rape y fría por 5-6 minutos en todos los lados. Reduzca el fuego y agregue la mitad de la panceta, la mitad de los chalotes y el ajo picado. Vierta el vino tinto y cocine a fuego lento hasta que el líquido se haya reducido a la mitad. Agregue el caldo y reduzca a la mitad nuevamente. Colar a través de un colador fino en una olla limpia y volver a colocarlo sobre el fuego para reducirlo por última vez. Temporada.", "Mientras tanto, sazone la carne de rape con sal y pimienta y colóquela en una sartén limpia a fuego alto con 1 cucharada de aceite de oliva. Cocine por 4-5 minutos en ambos lados.", "Agregue las alcachofas cocidas, los champiñones, el ajo en rodajas, la panceta restante, los 4 chalotes y el pescado en la salsa para hervir a fuego lento. Cubra con una tapa y cocine durante 1-2 minutos. Retire el pescado de la sartén y déjelo reposar.", "Agregue las hojas de tomillo a la salsa y reduzca aún más si necesita espesar un poco. Batir la mantequilla.", "Cortar los pescados diagonalmente en nuggets y dividir entre 2 platos, verter sobre la salsa y terminar con perejil picado."], "url": "www_bbc_co_uk_food_recipes_monkfish_bourguignon_29096", "title": "Rape de búfalo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 papas para hornear grandes", "25g / 1oz de mantequilla", "3 huevos de gallinas camperas, solo yemas", "sal y pimienta negra recién molida", "1litre / 1¾ pintas de caldo de pescado", "1kg / 2lb filete de rape de 2 oz, cortado en trozos grandes", "25g / 1oz de mantequilla, más extra para freír", "Harina normal de 25g / 1oz", "Cebollas de bebé 110g / 4oz peladas", "110g / 4 oz champiñones, descuartizado", "4 huevos de gallinas camperas, solo yemas", "Crema doble 250ml / 9fl oz", "3 cucharadas de hojas de estragón"], "method": ["Para las papas, precaliente el horno a 200C / 400F / Gas 6.", "Hornea las papas en el horno durante aproximadamente 1 hora y 15 minutos hasta que estén tiernas cuando las perfores con un cuchillo.", "Retire y enfríe lo suficiente como para manipular y luego saque la carne y pase a través de un tamiz fino en un recipiente.", "Batir hasta obtener un puré suave y esponjoso, luego agregar la mantequilla y las yemas de huevo. Sazone al gusto con sal y pimienta negra recién molida.", "Coloque una cuchara en una manga pastelera y coloque pequeñas pirámides en una bandeja para hornear y colóquelas en el horno de 5 a 10 minutos hasta que estén doradas.", "Para la blanquette, coloque el caldo de pescado en una sartén grande y cocine a fuego lento.", "Agregue el rape y vuelva a hervir a fuego lento, luego cocine por cinco minutos hasta que esté cocido. Retire de la acción y reserve.", "Caliente una cacerola de base pesada a fuego medio. Agregue la mantequilla y derrita, luego agregue la harina y siga revolviendo hasta que se haya absorbido por completo.", "Poco a poco mezcle el caldo de pescado, y siga revolviendo hasta que se haya agregado todo el caldo.", "Caliente una sartén a fuego medio, agregue un poco más de la mantequilla y las cebollas y cocine hasta que se coloreen un poco, luego agregue los champiñones y cocínelos durante dos minutos más y luego colóquelos en la salsa de pescado.", "Regrese el rape a la salsa y cocine a fuego lento.", "Batir las yemas de huevo y la crema juntas en un tazón y luego agregar gradualmente a la salsa de pescado, batiendo sobre la marcha.", "Retire del fuego y continúe batiendo por un par de minutos. Agregue el estragón y revise el condimento.", "Para servir, coloque un par de papas duquesa en cada plato. Coloque la blanquette al lado y termine con un poco más de estragón."], "url": "www_bbc_co_uk_food_recipes_monkfish_blanquette_with_02834", "title": "Estofado de rape con patatas duquesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan blanco", "1kg / 2lb 4 oz de carne picada", "1 cebolla roja grande, picada", "3 cucharadas de ketchup de tomate", "1 huevo de gallinas camperas", "2 cucharadas de salsa marrón", "1 cucharadita de salsa Worcestershire", "70 g / 2½ oz de queso parmesano, rallado", "1 cucharada de orégano fresco picado", "1 cucharada de perejil fresco picado", "1 cucharada de leche", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque el pan en un procesador de alimentos y pulse para hacer migas de pan.", "Mezcle las migas de pan con el resto de los ingredientes en un tazón grande hasta que la mezcla se separe de los lados del tazón y forme una bola.", "Forme la mezcla en forma de hogaza y colóquela en un molde para horno o en una lata de pan. Hornee en el horno por 50-60 minutos, o hasta que un pincho insertado en el centro salga limpio."], "url": "www_bbc_co_uk_food_recipes_moms_hockey_puck_88058", "title": "Pastel de carne de mamá", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moms_hockey_puck_88058_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 mejillas de rape, recortadas (pídale a su pescadero que haga esto)", "1 cucharada de semillas de hinojo, trituradas", "1 cucharada de semillas de cilantro, trituradas", "1 limón, ralladura y jugo", "3 cucharadas de aceite de oliva", "sal", "pequeño racimo micro albahaca, para servir", "2 chalotes grandes, toscamente picados", "20 pequeñas alcaparras", "100ml / 3½fl oz de ketchup de tomate", "1 cucharada de vinagre de vino tinto", "50ml / 1¾oz de aceite de oliva virgen extra", "2 cucharadas de salsa Worcestershire", "5 tomates pequeños, reliquia si es posible, descuartizado", "albahaca pequeña, toscamente picada", "perejil pequeño, picado", "sal y pimienta negra recién molida", "3 papas grandes Maris Piper, peladas", "4 cucharadas de vinagre de malta", "fina sal marina, al gusto", "300ml / 10fl oz de aceite de oliva", "manojo de estragón", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "sal", "exprimir jugo de limón"], "method": ["Coloque el rape, las semillas de hinojo, las semillas de cilantro, la ralladura de limón y el aceite de oliva en una bolsa sellable. Poner en la nevera y marinar durante 30 minutos.", "Para hacer el aderezo, mezcle todos los ingredientes y sazone al gusto.", "Para hacer las patatas fritas, caliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Con un espiralizador, corta la patata en tiras largas y delgadas. Freír a fuego lento las tiras hasta que estén crujientes, escurrir sobre papel de cocina y sazonar con sal y vinagre.", "Para hacer la mayonesa, mezcle el aceite de oliva y el estragón en un procesador de alimentos para hacer un aceite verde. Retire de la licuadora y reserve. Coloque el huevo entero, la yema de huevo, la mostaza y la sal en el procesador de alimentos y mezcle. Lentamente agregue el aceite verde, mientras licua, hasta que espese y cremoso. Termine con un limón exprimido.", "Calentar el aceite en una sartén colocada a fuego alto. Cocine el rape durante 2-4 minutos en cada lado, hasta que esté cocido. Exprima más de la mitad del jugo de limón antes de sacarlo de la sartén.", "Para servir, divida las patatas fritas y las mejillas de rape entre dos platos. Rocíe con el aderezo y esparza sobre las hojas de micro albahaca. Sirve la mayonesa al lado."], "url": "www_bbc_co_uk_food_recipes_monkfish_cheeks_and_74056", "title": "Mejillones y patatas fritas con aderezo de ketchup y mayonesa de estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]