[{"ingredients": ["1 litro / 1¾ pintas de caldo de pollo (casero o comprado)", "2 tallos de limoncillo", "4 chiles de ojo de pájaro", "4-5 hojas de lima kaffir (opcional)", "3 chalotes largos, pelados y finamente cortados", "50 g / 2 onzas de pieza de jengibre fresco de raíz, pelado y en rodajas finas", "3 dientes de ajo, pelados y partidos a la mitad", "4 cucharadas de jugo de lima", "2 cucharadas de nam pla (salsa de pescado tailandés)", "100 g / 3½ oz de arroz medio o fideos de huevo", "Tage de sarga de 100 g / 3½ oz, cortado y cortado diagonalmente", "1 pimiento rojo, sin semillas y muy finamente cortado", "pequeño racimo de cilantro fresco, toscamente desgarrado", "Pollo picado 250 g / 9 oz", "2 cebollas de primavera, cortadas y finamente rebanadas", "1 diente de ajo, pelado y aplastado", "1 ají de ojos de pájaro, finamente picado", "1 cucharada de harina de maíz, más extra para quitar el polvo", "¼ cucharadita de sal marina fina", "2 cucharadas de hojas de cilantro fresco picado", "pimienta negra recién molida"], "method": ["Para hacer la base de sopa, vierta el caldo en una olla grande y cocine a fuego lento. Picar finamente uno de los tallos de limoncillo y agregar a la sartén. Separe dos chiles a lo largo casi hasta el final y agregue a la sartén.", "Agregue las hojas de lima, si usa, una de las chalotas en rodajas y todo el jengibre y el ajo. Deje que hierva a fuego lento y cocine suavemente durante 15 minutos. Retirar del fuego y dejar reposar ..", "Para las bolas de pollo, coloque todos los ingredientes en un tazón grande y mezcle hasta que estén bien combinados. Incline un poco de harina de maíz en un plato y use polvo en sus manos. Enrolla la mezcla de pollo en 16 bolitas y pon en un plato grande.", "Cuele el material infundido a través de un tamiz en una sartén limpia. Agregue los chalotes restantes, el jugo de lima y la salsa de pescado. Corta las dos últimas chiles de ojo de pájaro muy finamente y agrégalas a la sartén. Basta la hierba de limón con un rodillo para magullar, y revuelva en el caldo.", "Llevar a fuego lento a fuego lento y agregar las bolas de pollo. Cocine por cinco minutos, permitiendo que el líquido burbujee. Agregue los fideos y vuelva a hervir a fuego lento durante dos minutos.", "Agregue la salsa de la sarna y el pimiento rojo y cocine a fuego lento durante dos minutos más hasta que las albóndigas estén cocidas y las verduras y los fideos estén tiernos. Agregue sal y pimienta negra recién molida, al gusto, agregando un poco de jugo de lima o salsa de pescado si es necesario.", "Vierte en cucharones en cuencos hondos, esparce el cilantro y sirve."], "url": "www_bbc_co_uk_food_recipes_fragrant_chicken_noodle_59139", "title": "Sopa de fideos de pollo fragante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de arroz basmati (para un sabor y una textura más auténticos, es mejor no usar arroz de fácil cocción, sin embargo, seguirá funcionando y será muy sabroso si lo hace)", "1 cebolla mediana, finamente picada", "Mantequilla de mantequilla grande, más extra para servir", "4 vainas de cardamomo", "8 dientes", "1 ramita de canela", "pellizcar hilos de azafrán (opcional)", "2 hojas de laurel", "600 ml / 1 pinta de caldo de pollo caliente, caldo de verduras o agua", "sal"], "method": ["Para asegurarse de obtener un arroz suave y esponjoso, lávelo con varios cambios de agua fría y déjelo en remojo durante unos 30 minutos en agua fría. Si no tienes tiempo para esto, colócalo en un colador y lávalo debajo del grifo durante aproximadamente un minuto.", "Cocine la cebolla en la mantequilla durante unos 5 minutos hasta que se ablande. Agregue las especias, el azafrán y las hojas de laurel y cocine por un par de minutos más. Las especias le darán un maravilloso sabor fragante al arroz. Agregue el arroz y revuelva hasta que los granos estén cubiertos con la mantequilla antes de remover en el caldo o agua y sal. Llevar a ebullición y luego cubrir con una tapa ajustada. Si la tapa no es muy apretada, cubra la bandeja con papel de aluminio antes de poner la tapa. Baje el fuego y deje cocinar durante 10 minutos antes de apagar el fuego. No quite la tapa; simplemente deje el arroz para continuar cocinando en la sartén por unos 5 minutos hasta que esté listo para servir.", "El arroz debería haber absorbido toda el agua y solo necesitaría esponjarse con un tenedor. Agregue un poco de mantequilla antes de servir."], "url": "www_bbc_co_uk_food_recipes_fragrantpilaurice_67870", "title": "Fragante arroz pilaf", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fragrantpilaurice_67870_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de cacahuete", "1 berenjena, cortada a la mitad longitudinalmente y cortada en rodajas de 1cm / ½", "2 dientes de ajo, finamente picados", "1 cucharada de jengibre fresco rallado", "1 chile rojo, finamente picado", "200 g / 7 oz de carne picada de cerdo", "1 cucharada de vino de arroz Shaoxing o jerez seco", "2 cucharadas de salsa de chile en grano (disponible en tiendas de comestibles asiáticas)", "200ml / 7fl oz de caldo de pollo caliente", "2 cabezas de pak choi o ½ col china, cortadas a la mitad y cortadas en lonchas", "1 cucharada de vinagre de arroz claro o vinagre de sidra", "1 cucharadita de aceite de sésamo tostado", "2 cebollas de primavera, picadas", "1 cucharada de harina de maíz, mezclada con 2 cucharadas de agua fría"], "method": ["Caliente un wok hasta que esté humeando y agregue dos cucharadas de aceite de cacahuete, luego fríe las rodajas de berenjena con un chorro de agua durante 3-4 minutos, o hasta que estén suaves y doradas por todas partes. Transfiera a un plato y reserve.", "Limpie el exceso de aceite del wok, vuelva a calentar y agregue el aceite de cacahuete restante. Calienta hasta fumar. Revuelva freír el ajo, el jengibre y el chile durante unos segundos, luego agregue el cerdo picado. Revuelva freír durante un minuto, luego agregue el vino de arroz o jerez. Cocine por 3-4 minutos, o hasta que se dore, luego agregue la salsa de chile y el caldo de pollo caliente. Regrese las berenjenas al wok y agregue el pak choi.", "Sazonar, al gusto, con el vinagre y el aceite de sésamo y llevar a ebullición. Cocine durante 3-4 minutos, o hasta que el cerdo esté bien cocido, luego revuelva en las cebollas de primavera. Agregue la pasta de harina de maíz y revuelva hasta que el líquido se haya espesado.", "Coloque la fragante carne de cerdo y las berenjenas en un recipiente para servir y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fragrantpork_89290", "title": "Fragantes carnes de cerdo y berenjenas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fragrantpork_89290_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz de brócoli, cortado en florecillas", "400ml / 14fl oz stock de pescado", "1 tallo de limoncillo, hojas exteriores duras retiradas, dentro picadas", "¼ de cebolla picada", "1 cucharada de puré de tomate", "3 cabezas de gambas tigre (ver más abajo)", "1 cucharada de aceite vegetal", "½ cebolla, en rodajas", "2 dientes de ajo, finamente picados", "1 chile rojo, finamente cortado", "3 langostinos tigre, pelados y desvelados", "55g / 2oz anacardos, tostados", "1 lima, solo jugo", "2 cucharadas de cilantro fresco picado", "1 cucharada de cebolletas frescas picadas"], "method": ["Pon a hervir una olla de agua. Agregue los brotes de brócoli y cocínelos durante 1-2 minutos, o hasta que se hayan suavizado un poco, pero aún estén firmes. Desagüe.", "Cocine a fuego lento el caldo de pescado, la hierba de limón, la cebolla picada y el puré de tomate en una cacerola aparte a fuego medio.", "Agregue las cabezas de gambas al caldo. Cocine a fuego lento durante 5-7 minutos, luego retírelo del fuego, cuélelo y deje el caldo a un lado. Deseche las cabezas de gambas.", "Para las gambas y el brócoli, caliente el aceite a fuego medio, luego fría la cebolla, el ajo y el chile por 3-4 minutos para ablandar.", "Agregue las gambas y fría hasta que estén rosadas y cocidas. A continuación, agregue los anacardos tostados y las flores de brócoli.", "Vierta 150ml / 5fl oz de la reserva de pescado reservada en la sartén, mezcle bien, luego agregue el jugo de lima. Caliente durante 2-3 minutos, luego agregue el cilantro y el cebollín.", "Para servir, espolvoree el brócoli y el caldo en un bol y coloque las gambas en la parte superior del plato."], "url": "www_bbc_co_uk_food_recipes_fragrantthaiprawnswi_89380", "title": "Fragantes gambas tailandesas con hierba de limón, chile, brócoli y anacardos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de azúcar en polvo", "4 huevos de gallinas camperas", "2 limones, solo ralladura, finamente rallados", "Harina 125g / 4½oz de levante automático, más extra para hacer harina", "50 g / 1¾oz de mantequilla sin sal, derretida y enfriada ligeramente, más extra para engrasar", "600 ml / 20 fl oz de leche", "vaina de vainilla", "4 huevos de gallinas camperas, más 2 yemas de huevo de gallinas camperas", "180g / 6¼ oz de azúcar en polvo", "1 cucharada de kirsch", "100 g / 3½ oz de harina de maíz", "150 g / 5½ oz de mantequilla, cortada en cubos y mantenida a temperatura ambiente", "75g / 2¾oz de azúcar en polvo", "2 limones, solo jugo", "Mazapán 200g / 7oz", "200 g / 7 oz de chocolate negro, para decoración", "600g / 1lb 5 oz de fresas de tamaño mediano"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase, enharine y forme la base de una lata de pastel de 23cm / 9 pulgadas en forma de resorte o redonda.", "Coloque el azúcar, los huevos y la ralladura de limón en un tazón grande sobre una fuente de agua hirviendo.", "Con un batidor de mano eléctrico, bata la mezcla a fuego medio hasta que duplique el volumen y el color pálido. La mezcla se encuentra en la etapa correcta cuando forma un camino de cinta cuando la batidora se saca de la mezcla. Retire del fuego.", "Tamizar en dos tercios de la harina y doblar suavemente en la mezcla batida con una cuchara de metal o una espátula. Agregue la harina restante y doble nuevamente. Trata de mantener la mayor cantidad de aire posible. Asegúrese de que toda la harina esté incorporada en la mezcla.", "Doble suavemente la mantequilla derretida.", "Vierta la mezcla en la lata de la torta y hornee durante 25-30 minutos o hasta que los lados de la torta comiencen a salir de la lata y que sea de color marrón dorado pálido.", "Cuando esté cocido, deje que la esponja se enfríe un poco en la lata y luego colóquela en una rejilla para enfriar. Tenga cuidado ya que esta esponja es bastante delicada. Debe ser justo debajo de 5cm / 2in de altura.", "Para hacer la crème pâtissière, vierta la leche en una sartén de base ancha, divida la vaina de vainilla a lo largo de su longitud con un cuchillo afilado y añádala a la leche junto con las semillas de vainilla. Haga que la leche hierva y luego retírela del fuego.", "Batir los huevos, el azúcar, la kirsch y la harina de maíz en un tazón mediano hasta que se mezclen.", "Retire la vaina de vainilla de la leche y vierta la leche caliente a través de un colador en la mezcla de huevo. Batir para combinar.", "Vierte la crema en una olla limpia y ponla a fuego medio.", "Revuelva la crema constantemente hasta que la mezcla se espese. La mezcla tardará aproximadamente cuatro minutos en espesarse, pero cuando sucede, ocurre muy rápidamente, por lo que debe seguir revolviendo para evitar grumos. Batir hasta que quede suave.", "Cocine la mezcla hasta que la crema esté muy espesa, de modo que pueda ser canalizada y mantendrá su forma. Agregue la mantequilla hasta que se derrita por completo y se combine.", "Deje que se enfríe un poco, vierta en un plato poco profundo y enfríe en el refrigerador durante aproximadamente una hora hasta que esté realmente frío y firme. Esto lo enfría más rápido a medida que se enfría en un área de superficie más grande; alternativamente, puede llenar las bolsas de tubería en esta etapa y dejar que se enfríe durante la noche.", "Coloque los ingredientes para el jarabe de limón en una olla pequeña con 70 ml / 4½ cucharadas de agua. Calentar suavemente hasta que el azúcar se disuelva, luego hervir rápidamente durante dos minutos. Retirar del fuego y reservar para enfriar.", "Mientras tanto, despliegue un disco delgado de mazapán para caber en un círculo de circunferencia de 23 cm / 9 pulg. Lo mejor es dibujar alrededor de la base de 23cm / 9 pulgadas de otra lata suelta para el círculo perfecto. Para obtener mejores resultados y una superficie perfectamente plana, enfríela en el refrigerador hasta que la necesite.", "Corta la esponja por la mitad horizontalmente, creando dos discos delgados de torta. El corte debe ser lo más nivelado posible ya que será visible en el pastel terminado.", "Coloque una tira de acetato de plástico alrededor del interior de la lata Springform. O alinee la base y los lados con película adhesiva o papel de aluminio forrado.", "Coloque una capa de bizcocho en el fondo de la lata de la torta. A continuación, cepilla generosamente la esponja con la mitad del almíbar. Con la parte posterior de una cuchara, aplasta suavemente los bordes de la torta hacia abajo para que se empujen directamente contra los lados de la lata, creando los bordes definidos necesarios para la torta Fraisier.", "Enjuague, proteja y reduzca a la mitad aproximadamente 12 fresas, intente y asegúrese de que todas tengan la misma altura.", "Coloque los lados cortados de las fresas contra el plástico en el interior de la lata. Las mitades de fresa deben estar cómodamente una junto a la otra, por lo que se ve como una pequeña corona dentro de la lata.", "Saque la crème pâtissière fría de la nevera y coloque dos tercios de la crema en una manga pastelera, equipada con una boquilla de 1 cm / ½ pulgadas.", "Haga un remolino que cubra completamente la esponja expuesta en el fondo de la lata.", "Luego, pase el tubo entre cada una de las fresas para llenar los huecos hasta la parte superior con la crema pastelera.", "Coloque alrededor de 3-5 fresas a un lado para decorar, luego corte el resto y colóquelas encima de la crema, de modo que levante el interior del pastel aproximadamente una pulgada.", "Pipe otro remolino de crème pâtissière en la parte superior de las fresas cortadas para cubrir toda la superficie. Luego alisa con una espátula.", "Coloque el otro disco de esponja sobre este, con el lado cortado hacia arriba, de modo que tenga una parte superior completamente plana. Cepille con el resto del jarabe.", "Presione suavemente la parte superior hacia abajo con bastante firmeza, de modo que la torta y el relleno empujen contra el acetato para crear los lados distintivos lisos y definidos de la torta Fraisier.", "Coloque el círculo de mazapán frío sobre la torta y vuelva a colocar todo en la nevera para prepararlo.", "Haga algunas decoraciones bonitas de su elección con chocolate negro derretido.", "Cuando esté listo para servir, retire la torta de la nevera.", "Con mucho cuidado, suelte la lata de primavera / fondo suelto y retire la torta de la lata y del acetato o película adhesiva.", "Colocar en un plato de servir y decorar con fresas reservadas, decoración de chocolate y una capa de azúcar glas. Servir frío."], "url": "www_bbc_co_uk_food_recipes_fraisier_cake_75507", "title": "Pastel de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 x 23 cm / 9 en pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fraisier_cake_75507_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla fría", "Harina normal de 250g / 9oz, más extra para espolvorear", "1 huevo de gallinas camperas", "225 g / 8 oz de mermelada", "225g / 8oz de mantequilla, ablandada", "1 vaina de vainilla, división y semillas raspadas (pod reservado)", "225 g / 8 oz de azúcar en polvo", "5 huevos de gallinas camperas", "225gr / 8 oz de almendras molidas", "75g / 3oz de almendras blanqueadas enteras", "Leche 250ml / 9fl oz", "Crema doble 250ml / 9fl oz", "4 yemas de huevo de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz"], "method": ["Para la masa, coloque la mantequilla y la harina en un mezclador de alimentos y mezcle hasta que la textura se asemeje a pan rallado, luego agregue el huevo y mezcle hasta que esté combinado en una masa firme.", "Envuelva la película adhesiva y colóquela en la nevera para que descanse durante 30 minutos.", "Para la tarta, precalentar el horno a 160C / 325F / Gas 3.", "En una superficie de trabajo ligeramente espolvoreada con harina, extienda la masa hasta aproximadamente 3 mm de grosor.", "Con cuidado, forre una lata de tarta de 23cm / 9pulg de fondo profundo y de fondo suelto con la masa, presionando la masa en los bordes de la lata. Extienda la mermelada sobre la base de la tarta, luego colóquela en la nevera para que descanse durante 10 minutos.", "Para hacer el frangipane, bata la mantequilla, las semillas de vainilla y el azúcar en un tazón hasta que estén pálidos y esponjosos.", "Agriete los huevos, uno a la vez, batiendo bien después de cada adición, hasta que todos los huevos se hayan incorporado por completo a la mezcla. Dobla las almendras molidas cuidadosamente con la mano.", "Cubra la caja de los pasteles con la mezcla de almendras y alise los bordes, luego decore con las almendras blanqueadas, en círculos concéntricos.", "Hornee la tarta en el horno precalentado durante 35-40 minutos, o hasta que el relleno se haya levantado, esté bien cocida y la superficie esté pálida dorada.", "Para la crema pastelera, coloque la leche y la crema en una cacerola poco profunda con la vaina de vainilla sobrante del relleno de frangipane. Establecer a fuego medio y llevar a ebullición.", "Mientras tanto, mezcle las yemas de huevo y el azúcar en un tazón.", "Cuando la leche esté hirviendo, viértala sobre los huevos batiendo todo el tiempo, luego devuelva toda la mezcla a la sartén y cocine a fuego lento, batiendo de vez en cuando hasta que esté lo suficientemente grueso como para cubrir el revés de una cuchara de madera.", "Colar en una sartén limpia y calentar.", "Para servir, corte la tarta en trozos, colóquela en los platos y vierta la crema al lado."], "url": "www_bbc_co_uk_food_recipes_frangipane_tart_with_63856", "title": "Tarta de frangipane con crema pastelera", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 240 g / 8½ oz, más extra para espolvorear", "115g / 4oz de mantequilla, enfriada y cortada en cubos", "75 g / 2½ oz de azúcar en polvo, más extra para rociar", "pizca de sal", "1 huevo grande de gallinas camperas, más 1 huevo pequeño batido para cepillar", "2 cucharadas de agua helada", "Ruibarbo de 500 g / 1 lb 2 oz, cortado en piezas de 2.5 cm / 1 in", "Fresas de 200g / 7oz, mondadas y en rodajas", "2-3 cucharadas de azúcar en polvo, al gusto", "2 cucharaditas de azúcar glas, para decorar (opcional)"], "method": ["Para hacer la masa, poner la harina en un tazón o procesador de alimentos. Agregue la mantequilla, el azúcar y la sal y frote todo con las puntas de los dedos hasta que tenga la textura de pan rallado fino. (Alternativamente, pulse en el procesador de alimentos.) Agregue el huevo grande y el agua helada y mezcle o pulse hasta que estén bien combinados. Incline sobre una superficie de trabajo y junte en una bola de masa. Envuelva la película adhesiva y colóquela en la nevera para que descanse durante 30 minutos.", "Precaliente el horno a 200C / Fan 180C / Gas 6. Cubra una bandeja de hornear con papel para hornear antiadherente.", "Extienda la masa en una superficie de trabajo ligeramente enharinada en un círculo aproximado de aproximadamente 35 cm de diámetro. Usando el rodillo, levante la masa en la bandeja de hornear.", "Espolvorea el ruibarbo sobre la masa, dejando un borde de aproximadamente 5 cm. Esparce las fresas sobre el ruibarbo y luego espolvorea la fruta con 2-3 cucharadas de azúcar.", "Dobla los bordes de la masa para hacer un pastel con un centro abierto. Cepille la masa con el huevo batido y espolvoree con el azúcar restante.", "Hornee durante 30-35 minutos, o hasta que la masa esté dorada y crujiente y la fruta esté cocida. Tamice el azúcar glas sobre la masa para servir si lo desea."], "url": "www_bbc_co_uk_food_recipes_free-form_fruit_pie_56828", "title": "Pastel de fruta de forma libre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/free-form_fruit_pie_56828_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 17½ oz bayas mixtas (arándanos, frambuesas, moras)", "3 cucharadas de azúcar o más al gusto", "salpicar agua", "500g / 17½oz de bizcocho liso listo para usar", "250ml / 9fl oz de crema lista para usar", "azúcar glas, para servir (opcional)"], "method": ["Traiga las frambuesas, moras y arándanos a ebullición en una cacerola con el azúcar y un poco de agua. Cocine a fuego lento durante unos minutos hasta que estallen los frutos. Dejar de lado.", "Cortar el bizcocho en trozos delgados y colocarlos en un bol o en cuatro platos de sopa individuales. Cuchara sobre las frutas calientes y parte de su jarabe. Escurrir sobre la crema pastelera y, si lo desea, espolvorear con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_freeformtriflewithbe_92227", "title": "Bagatela de forma libre con bayas y natillas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra 2 oz de freekeh", "1 cebolla roja pequeña, muy finamente picada", "250 g / 9 oz de arándanos secos", "200g / 9oz de almendras blanqueadas", "20g / ¾oz de eneldo, hojas y tallos finamente picados", "400 g / 14 oz de semillas de granada", "150ml / ¼ litro de melaza de granada", "generoso glug de aceite de oliva"], "method": ["Ponga a hervir una olla grande de agua y cocine el freekeh de acuerdo con las instrucciones del paquete (unos 15-20 minutos). Escurra, enjuague bien hasta que esté frío y colóquelo en un tazón grande.", "Agregue los ingredientes restantes al tazón con el freekeh y déle a todo una buena mezcla. Cubra con film transparente y deje reposar por una hora antes de servir."], "url": "www_bbc_co_uk_food_recipes_freekeh_salad_16186", "title": "Ensalada Freekeh", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Freekeh 200g / 7oz, cebada perlada deletreada o perlada", "5 cucharadas de aceite de oliva", "4 cebolletas, finamente picadas", "1 granada, solo semillas", "puñado de perejil, toscamente picado", "puñado de menta, más o menos picada", "1 cucharada de melaza de granada", "2 cucharadas de pistachos, más o menos triturados", "sal y pimienta negra recién molida"], "method": ["Ponga el freekeh y 1 litro / 1¾ de agua en una sartén junto con 1 cucharadita de sal y 1 cucharada de aceite de oliva. Llevar a ebullición, luego baje a fuego lento y cocine durante 15 minutos hasta que esté tierno. Escurrir y dejar enfriar.", "Cuando esté frío, mezcle el freekeh con las cebolletas, las semillas de granada y las hierbas. Condimentar con sal y pimienta.", "Batir las 4 cucharadas soperas restantes de aceite de oliva y la melaza de granada con una pizca de sal, y vestir la ensalada con ella, mezclándola suavemente. Servido cubierto con pistachos."], "url": "www_bbc_co_uk_food_recipes_freekeh_salad_48068", "title": "Ensalada Freekeh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 como guarnición", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freekeh_salad_48068_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 manzana pequeña para comer, pelada, sin núcleo, rallada", "30 g / 1¼ oz de fruta seca mixta", "50g / 2oz de avena", "1 cucharada colmada de azúcar demerara", "3 cucharadas de jugo de manzana", "1 cucharadita de aceite vegetal, más extra para engrasar"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata de pan con un poco de aceite vegetal.", "En un tazón, mezcle la manzana rallada, la fruta seca, la avena y el azúcar hasta que estén bien combinados. Agregue el jugo de manzana y el aceite.", "Coloque la mezcla en la lata de pan preparada y aplánela en las esquinas con una espátula.", "Hornee en el horno por unos 25 minutos, o hasta que la avena esté dorada. Déjelo a un lado para que se enfríe un poco, luego colóquelo en una rejilla para que se enfríe por completo.", "Para servir, cortar en cuatro dedos."], "url": "www_bbc_co_uk_food_recipes_freewheeling_fruit_23409", "title": "Dedos de fruta de rueda libre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["botón de mantequilla, para engrasar", "225 g / 8 oz jumbo avena", "50 g / 2 oz de almendras, piel en", "60 g / 2¼ oz de semillas mixtas", "60g / 2¼ oz de arándanos secos", "50g / 2oz de arroz llano o con chocolate", "100g / 3½ oz de jarabe de agave", "100 g / 3½ oz de mantequilla de maní", "125 g / 4½ oz de miel"], "method": ["Engrase ligeramente una bandeja para hornear de 33x23 cm / 13x9 pulgadas que tenga aproximadamente 3 cm de profundidad. Línea con película adhesiva.", "Coloque la avena y las almendras en un procesador de alimentos y mezcle durante 10-20 segundos, hasta que se descompongan bastante bien (si desea un poco de textura, pero debe ser un poco pulverulenta). Incline en un recipiente grande y luego agregue las semillas, los arándanos y el arroz y revuelva muy bien.", "Caliente el jarabe de agave, la mantequilla de maní y la miel en una cacerola pequeña a fuego medio hasta que se derrita. Revuelva, vierta esto sobre la mezcla de avena y mezcle bien con una cuchara, hasta que se enfríe un poco. Mezcle con sus manos para asegurarse de que toda la avena esté cubierta.", "Incline en la lata y extiéndase uniformemente. Coloque una hoja de película adhesiva en la parte superior, luego presione hacia abajo para aplastar la mezcla. Deja en el congelador durante 1 hora hasta que se establezca.", "Retire la capa superior de la película adhesiva, luego la punta sobre un tablero, retire la película adhesiva restante y corte en 24 barras.", "Para mantenerlos, acóplelos entre hojas de papel resistente a la grasa y guárdelos en una caja sellada en el refrigerador. También pueden mantenerse en el congelador."], "url": "www_bbc_co_uk_food_recipes_freezer_oaty_bar_14307", "title": "Barras de avena", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 24 barras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freezer_oaty_bar_14307_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva virgen extra, más extra para servir", "3 dientes de ajo, en rodajas", "4 cucharadas de perejil picado", "¼ cucharadita de copos de chile", "1¼ litros / 2 pintas 4fl oz de caldo de pescado", "4 tomates medianos, pieles eliminadas, descamadas y finamente picadas", "250g/9oz fregola pasta", "1kg / 2lb 4 oz pequeñas almejas, enjuagadas y escurridas (descartar las almejas que permanecen abiertas cuando se golpea)", "Azafrán pellizco grande, infundido en 1 cucharada de agua caliente", "1 limón, ralladura finamente rallada solamente"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio y agregar el ajo, el perejil y los copos de chile. Caliente, revuelva, por un minuto, hasta que el ajo comience a colorear.", "Agregue el caldo y la mitad de los tomates y deje que hierva.", "Agregue la pasta fregola y cocine a fuego lento durante diez minutos (o para cocinar según las instrucciones del paquete), revolviendo con frecuencia, hasta que la pasta esté recién hecha.", "Mientras tanto, vierta suficiente agua en una gran sartén limpia con una tapa para que llegue a aproximadamente ½ cm por los lados. Llevar a ebullición, luego agregue las almejas y cubra bien con la tapa. Cocine, agite la sartén de vez en cuando, a fuego alto, durante 3-5 minutos, o hasta que todas las almejas se hayan abierto.", "Retire las almejas de la sartén con una cuchara ranurada. Deseche cualquier almeja que no se haya abierto.", "Con cuidado, vierta la mayor parte del licor de cocina de la sartén en un recipiente, dejando atrás la arena y la arena que se han asentado en el fondo de la sartén.", "Agregue las almejas, el licor de cocción colado, el azafrán infundido y su agua, la ralladura de limón y los tomates restantes a la cacerola de la pasta hirviendo a fuego lento y mezcle bien.", "Retire del fuego y cueza en seis tazones de sopa. Rocíe con un poco de aceite de oliva y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fregolaconarsellesar_89307", "title": "Fregola con arselle (sopa de pasta y almejas de Cerdeña)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo de corral, alimentadas con maíz, ribeteadas en francés (ver abajo el método)", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "50 g / 1¾oz trompettes de mort champiñones, limpios y cortados", "50g / 1¾oz de champiñones, limpios y cortados", "50g / 1¾oz girolles champiñones, limpios y recortados", "75ml / 3fl oz Madeira", "150ml / 5fl oz de caldo de pollo reducido", "Crema doble 75ml / 3fl oz", "2 cucharadas de cebollines finamente picados", "2 cucharadas de perifollo finamente picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para recortar en francés su propio pollo, corte las patas del ave y déjelo a un lado para usarlo en otro plato. Coloque un cuchillo afilado en el extremo delantero del pollo y corte a ambos lados de la horquilla. Descarta la horquilla.", "Rebane a cada lado del esternón y quite las pechugas de pollo, con las alas todavía unidas. Recorte los extremos de las alas y deséchelos.", "Pase el cuchillo por el extremo de cada ala, presione la carne hacia abajo para revelar parte del hueso y raspe la carne del hueso revelado. Ahora tiene una pechuga de pollo con borde francés.", "Sazonar las pechugas de pollo con sal y pimienta negra recién molida. Caliente una sartén a prueba de horno hasta que esté caliente, agregue la mitad de la mantequilla y cocine el pollo con la piel hacia abajo durante 1-2 minutos o hasta que la piel esté dorada.", "Voltee las pechugas de pollo y cocínelas por un minuto más, luego transfiéralas al horno y tueste durante 12-15 minutos o hasta que el pollo esté bien cocido.", "Mientras tanto, caliente otra sartén, agregue la mantequilla restante, los chalotes y el ajo y cocine suavemente durante 1-2 minutos hasta que se ablanden. Agregue los champiñones, cocínelos por un minuto y luego agregue el Madeira, déjelo flamear y luego cocínelo hasta que se reduzca a la mitad.", "Agregue el caldo de pollo y cocine por un minuto y luego agregue la crema. Sazone con sal y pimienta negra recién molida, luego agregue el cebollín y el perifollo y revuelva a través de la salsa.", "Para servir, coloque los champiñones en un plato para servir, talle el pollo en rodajas gruesas y colóquelo en la parte superior."], "url": "www_bbc_co_uk_food_recipes_french-trimmed_chicken_70337", "title": "Pechuga de pollo francés recortada con setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de hojaldre listo para usar", "2 cucharadas de manzana guisada o salsa de manzana dulce", "6 manzanas (Cox o Granny Smith), peladas, descuartizadas y sin corazón", "2 cucharadas de azúcar en polvo", "40 g / 1½ oz de mantequilla, en cubos", "1 yema de huevo de gallinas camperas, golpeada", "Crema doble 250ml / 9fl oz", "1 cucharada de azúcar glas", "1 vaina de vainilla, semillas raspadas", "splash calvados"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Pase la masa de hojaldre sobre una superficie de trabajo limpia a una hoja grande, de 3 mm de grosor. Con un tazón o plato, corte un círculo de aproximadamente 25 cm de diámetro. Prensar el borde antes de voltear toda la hoja y colocarla directamente sobre una bandeja de horno plana. Enfriar en la nevera durante al menos 10 minutos.", "Retire la masa de la nevera y extienda la compota de manzana por toda la base de la masa, dejando un borde de 1 cm / ½ pulgada en el borde.", "Rebane las manzanas con el grosor de una moneda de dos libras y colóquelas en la lámina de repostería, abanicándolas, comenzando desde el exterior y trabajando. Las manzanas deben superponerse entre sí. Use las rebanadas más grandes en el exterior y coloque las rebanadas más pequeñas en el medio de la tarta.", "Una vez que todas las manzanas hayan sido distribuidas, espolvorea el azúcar impalpable y salpícalo con la mantequilla en cubos. Cepille el borde con el huevo batido y hornee en el horno durante aproximadamente 30 minutos, o hasta que se doren y se eleven por el borde.", "Para la crema de Chantilly, bata la crema, el azúcar glas y las semillas de la vaina de vainilla en un bol hasta que se formen picos muy suaves y déjelos a un lado hasta que estén listos para servir.", "Cuando esté listo para servir, coloque la tarta en un plato de servir. Caliente los calvados en una olla pequeña. Enciende el alcohol con un fósforo (ten cuidado con tus dedos) y vierte sobre la tarta. Sirve con crema Chantilly."], "url": "www_bbc_co_uk_food_recipes_french_apple_tart_with_70368", "title": "Tarta de manzana francesa con calvados y crema de Chantilly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_apple_tart_with_70368_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de yogur sin grasa de estilo griego", "2 cucharadas de jarabe de arce", "2 cucharaditas de semillas de chia", "200 g / 7 oz de hojaldre ligero listo para enrollar", "2 cucharadas de mermelada de albaricoque", "2 manzanas grandes, afiladas y verdes para comer (300 g / 10½ oz en total), descuartizadas, sin corazón, en rodajas finas", "1 cucharada de leche semidesnatada", "2 cucharaditas de edulcorante granulado", "½ cucharadita de canela molida", "½ cucharadita de macis molido (o nuez moscada)"], "method": ["Para hacer el yogur, mezcle todos los ingredientes en un tazón pequeño. Cubra y refrigere durante al menos 2 horas, preferiblemente durante la noche.", "Precaliente el horno a 220C / 200C Fan / Gas 7 y forre una bandeja para hornear con papel de hornear.", "Corte la masa de hojaldre en cuartos (deben ser de aproximadamente 10x13 cm / 4x5 pulgadas) y colóquela en la bandeja de horno forrada.", "Divida el atasco entre los pasteles y extiéndalo con la parte posterior de una cuchara, dejando un margen de 1 cm / ½ pulgada alrededor de cada pieza. Coloque las rodajas de manzana, superpuestas, encima del atasco. Cepille los bordes expuestos de la masa con la leche.", "Mezcle el edulcorante, la canela y la macla y espolvoree abundantemente sobre cada tarta.", "Hornee durante 15-20 minutos, o hasta que la masa esté dorada y crujiente.", "Sirva con una cucharada generosa del yogur en el lado."], "url": "www_bbc_co_uk_food_recipes_french_apple_tarts_with_72842", "title": "Tartas de manzana francesas más claras", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de sal marina", "1 cucharadita de pimienta negra en grano, molido", "1 cucharadita de polvo de mostaza seca", "1 cucharadita de tomillo seco", "2kg / 4lb 8 oz de solomillo, laminado", "2 cucharadas de goteo o aceite", "15g / ½ oz de mantequilla", "2 chalotes, finamente picados", "250g / 9 oz de champiñones, en rodajas finas", "1 diente de ajo, en rodajas", "1 ramita grande de tomillo, solo hojas", "1 cucharada de harina normal", "200ml / 7fl oz de vino tinto o blanco", "500ml / 18fl oz de caldo de carne (o consomé)", "2 cucharadas de estragón fresco picado", "par de baguettes grandes", "mantequilla (o goteo)", "mostaza o rábano picante (opcional)"], "method": ["Precalentar el horno a 220 ° C / 200 ° C Ventilador / Gas 7. Mezcle la sal marina, la pimienta, la mostaza en polvo y el tomillo y presiónela en las áreas superficiales del solomillo.", "Ponga el goteo o el aceite en una lata para asar y caliente a fuego bastante alto hasta que hierva a fuego lento. Dorar la carne por todos lados hasta que quede bastante dorado, luego transferir al horno. Cocine a su gusto (10 minutos por 500 g / 1 lb 2 oz por raro, 15 minutos por 500 g / 1 lb 2 oz por medio raro, 20 minutos por 500 g / 1 lb 2 oz por medio y 25 minutos por 500 g / 1 lb 2 oz por bien hecho).", "Una vez que el asado haya terminado de cocinarse, retírelo de la lata y déjelo en un plato, cubierto con papel de aluminio, para que descanse durante al menos 20 minutos. Cuele la grasa y los jugos de la lata de tueste y déjelos a un lado.", "Para la salsa, caliente la mantequilla en una cacerola. Agregue los chalotes y los champiñones y cocine hasta que los chalotes estén dorados claros. Agregue el ajo y el tomillo y revuelva por otros 2 minutos.", "Espolvorea la harina y revuelve por un par de minutos. Agregue el vino y permita que burbujee y que el volumen de líquido se reduzca a la mitad. Agregue el caldo (o consomé) y cocine hasta que se reduzca en un tercio. Agregue el estragón.", "Pruebe y sazone con sal y pimienta. Agregue cualquier jugo de la carne asada, y si desea extraer la mayor cantidad de sabor de la lata de asar, agregue la salsa a la lata de asar y revuelva vigorosamente a fuego lento para incorporar los jugos de cocción caramelizados (esto se llama deglazing) ) Transfiera a una jarra caliente.", "Sirva el solomillo en rodajas con la salsa, amontonado en baguette con mantequilla. Bueno con mostaza o rábano picante en el lateral."], "url": "www_bbc_co_uk_food_recipes_french_dip_sandwich_25385", "title": "Sándwich de dip francés", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "6 cebollas blancas grandes, en rodajas finas", "1½ cucharada de azúcar en polvo", "200ml / 7fl oz de vino blanco", "2 litros / 1¾ pinta de buen caldo rico", "3 hojas de laurel", "ramita de romero", "sal y pimienta negra recién molida", "½ baguette delgada", "mostaza de Dijon", "Queso gruyere 25 g / 1 oz, rallado"], "method": ["Derretir la mantequilla y el aceite en una cacerola profunda. Agregue la cebolla y fría a fuego alto durante unos minutos. Cubra, baje el fuego y cocine a fuego lento durante aproximadamente 10 minutos.", "Retire la tapa, espolvoree el azúcar y un poco de sal y pimienta, y fría por unos minutos. Cubra y cocine a fuego lento durante al menos 15 minutos, o hasta que la cebolla esté tierna, dorada y caramelizada.", "Agregue el vino y hierva por unos minutos, agregue el caldo y las hierbas y cocine por otros 8-10 minutos.", "Para hacer los croûtes, corte la baguette, tueste un lado debajo de la parrilla. Extienda el lado del pan con mostaza y cubra con queso rallado. Grill hasta que se derrita.", "Retire las hierbas, revise el condimento y sirva en recipientes calientes con los croûtes de queso en la parte superior."], "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_02884", "title": "Sopa de cebolla francesa con croûtes de mostaza y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_onion_soup_with_02884_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "3 cebollas grandes, en rodajas finas", "2 ramitas de tomillo, hojas recogidas", "1 cucharada de azúcar morena suave", "2 dientes de ajo, en rodajas finas", "200ml / 7fl oz de vino blanco", "1 cucharada de harina normal", "50ml / 2fl oz de brandy", "50ml / 2fl oz de jerez seco", "1 litro / 1¾ pinta de caldo de carne fresca y oscura", "1 baguette, en rodajas gruesas", "Queso Gruyère 110 g / 4 oz, rallado"], "method": ["Calentar una sartén grande y agregar 2 cucharadas de aceite de oliva, las cebollas, el tomillo y el azúcar. Freír durante 10-15 minutos a fuego medio-bajo, o hasta que estén suaves y dorados, revolviendo ocasionalmente.", "Agregue el ajo y cocine durante 1 minuto, luego agregue el vino blanco y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la harina y cocine durante 2 minutos.", "Agregue el brandy y el jerez, luego vierta el caldo y llévelo a ebullición. Reduzca el fuego levemente y cocine durante aproximadamente 10-15 minutos.", "Mientras tanto, caliente una plancha hasta que esté caliente. Rocíe el aceite de oliva restante sobre el pan y la tostada en un lado. Dejar de lado.", "Sazonar la sopa al gusto, agregando un poco más de azúcar o alcohol si es necesario.", "Precalentar la parrilla a alto.", "Coloque la sopa en tazones y cubra con el pan, con el lado tostado hacia abajo. Agregue el queso en la parte superior del pan y la parrilla hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_75645", "title": "Sopa de cebolla francesa clásica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "3 cebollas grandes, finamente rebanadas", "2 ramitas de tomillo, hojas recogidas", "1 cucharada de azúcar morena suave", "2 dientes de ajo, en rodajas finas", "200ml / 7fl oz de vino blanco", "1 cucharada de harina normal", "50ml / 2fl oz de brandy", "50ml / 2fl oz de jerez seco", "1 litro / 1¾pints de carne de res fresca y oscura", "1 baguette, en rodajas gruesas", "Queso Gruyère 110 g / 4 oz, rallado"], "method": ["Caliente una sartén grande o saltee la sartén hasta que esté caliente, agregue dos cucharadas de aceite de oliva, las cebollas, el tomillo y el azúcar morena suave. Freír durante 10-15 minutos a fuego medio-bajo, o hasta que estén suaves y dorados, revolviendo ocasionalmente para que no se enganchen en el fondo.", "Agregue el ajo y cocine por un minuto, luego agregue el vino blanco y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la harina y cocine durante dos minutos.", "Agregue el brandy y el jerez, luego vierta el caldo y llévelo a ebullición. Reduzca ligeramente el calor y cocine suavemente durante aproximadamente 10-15 minutos.", "Mientras la sopa hierve a fuego lento, caliente una plancha hasta que esté caliente. Rocíe la cucharada restante de aceite de oliva sobre el pan y la tostada en un lado. Dejar de lado.", "Verifique el condimento de la sopa, agregue mucha sal, un poco de pimienta negra y más azúcar o alcohol si es necesario para satisfacer su propio gusto.", "Precalentar la parrilla a alto.", "Sirva la sopa en tazones y cubra con el pan tostado. Agregue el queso en la parte superior del pan y la parrilla hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_76295", "title": "Sopa de cebolla francesa con crutones de Gruyère", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]