[{"isVegetarian": true, "title": "Flapjack cinnamon apple crumble with vanilla custard", "url": "www_bbc_co_uk_food_recipes_flapjack_cinnamon_apple_32656", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjack_cinnamon_apple_32656_16x9.jpg", "ingredients": ["250g/9oz porridge oats ", "2 tsp lemon zest ", "125g/4½oz unsalted butter ", "100g/3½oz muscovado sugar", "100g/3½oz golden syrup ", "1kg/2lb 4oz Granny Smith or cooking apples, peeled, cored and cut into chunks ", "40g/1½ oz unsalted butter ", "1 tsp cinnamon ", "1–2 tbsp muscovado sugar ", "1 lemon, juice only", "1 tbsp cornflour ", "150g/5½oz raisins ", "600ml/1 pint whole milk ", "1 tbsp vanilla bean extract ", "4 free-range eggs, yolk only (roughly 80g/3oz)", "20g/¾oz caster sugar ", "2 tsp cornflour"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2. ", "For the crumble topping, spread the oats on a large baking tray and bake for 10–15 minutes, stirring once, until they are toasted and golden in colour. Once toasted, put the oats into a bowl and add the lemon zest. Leave the oven on. ", "Melt the butter, sugar and syrup in a saucepan over a medium heat until the sugar has dissolved. Pour over the oats, give it a good mix and set aside.", "Put the apples, butter, cinnamon, 1 tablespoon of sugar and the lemon juice into a pan. Cook for about 10 minutes on a medium heat, until the apples have softened slightly. Stir in the cornflour and raisins, then tip the mixture into a 25cm/10in square or round ovenproof baking dish. Top with the flapjack mix in an even layer. Bake on the middle shelf of the oven for 40–45 minutes. ", "Meanwhile, for the custard put the milk and vanilla into a pan and bring to the boil, then turn down to a gentle simmer. Put the egg yolks, sugar and cornflour into a bowl and whisk until the mixture is light. Slowly add the warm milk in a steady stream, whisking all the time. Once all the milk is added, pour it back into the pan over a medium heat and stir gently with a spoon till the mixture thickens. ", "Pour straight into a serving jug and, if there is a wait, cover with cling film, making sure the film touches the top of the custard. Unless of course you enjoy the skin, in which case by all means leave it exposed. Serve the crumble with the custard alongside."]}, {"isVegetarian": true, "title": "Flapjacks", "url": "www_bbc_co_uk_food_recipes_flapjacks_84370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter, melted", "50g/1¾oz caster sugar", "50ml/2fl oz clear honey, plus extra for drizzling", "200g/7oz oats", "icing sugar, to dust"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Line a baking sheet with greasproof paper.", "Place all the ingredients into a bowl and mix together.", "Spoon the flapjack mixture onto the greaseproofed baking sheet, and place into the oven to cook for 10 minutes. ", "Remove the flapjacks and transfer into the freezer for five minutes to set and firm.", "Once the flapjacks are set, remove from the freezer and cut into chunks.", "To serve, place onto a serving plate and dust with icing sugar and drizzle over with honey."]}, {"isVegetarian": true, "title": "Flapjacks", "url": "www_bbc_co_uk_food_recipes_flapjacks_86993", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjacks_86993_16x9.jpg", "ingredients": ["175g/6oz butter", "175g/6oz golden syrup", "175g/6oz muscovado sugar", "350g/12oz porridge oats", "½ lemon, finely grated zest", "pinch ground ginger"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2 and line a 20cm/8in square baking tin with baking paper.", "Melt the butter in a medium pan over a low heat. Dip a brush in the butter and brush the baking tin with a little bit of it. Add the golden syrup and sugar to the butter and heat gently. Once the sugar is dissolved and the butter is melted, remove the pan from the heat and stir in the porridge oats, lemon zest and ginger.", "Pack the mixture into the baking tin and squash down. Bake in the oven for 40 minutes.", "Once cooked, remove from the oven, leave to cool for 15 minutes, then turn out on to a chopping board and cut into squares.", "These flapjacks are delicious in a packed lunch or as a grab-and-go breakfast."]}, {"isVegetarian": false, "title": "Flash fried steak with mushroom ketchup", "url": "www_bbc_co_uk_food_recipes_flash_fried_steak_with_94231", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1½ shallots, finely chopped", "4 Portobello mushroom, pulsed in food processor", "125g/4½oz demerara sugar", "100g/3½oz white wine vinegar", "500ml/18fl oz double cream", "2 anchovies", "2 tbsp oil ", "2 x 250g/9oz tail fillet steaks, flattened to 1cm/½in thick ", "table salt, to taste ", "1 tsp cracked black pepper", "knob butter", "1 bunch watercress, picked and washed", "crispy shallot rings "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mushroom ketchup, heat a frying pan and add the butter. Once melted, fry the shallots for a few minutes. Add the blended mushrooms and fry until soft.", "Add the sugar and vinegar and cook until the volume of liquid has reduced then add cream and reduce again. Blend in a food processor with the anchovies then pass through a sieve. Keep in the fridge until needed.", "For the flash fried steak, in a large very hot frying pan, add a little oil. Once hot, season the steaks with the salt and black pepper.", "Add a knob of butter to the pan and then add the steak. Cook for 30-40 seconds one side and then 20 seconds on the other side.", "Let the steaks rest for two minutes and then slice. ", "To serve, serve the sliced steak with the mushroom ketchup, watercress and shallot rings."]}, {"isVegetarian": false, "title": "Flash-fried salmon with yellow pepper and onion salsa", "url": "www_bbc_co_uk_food_recipes_flashfriedsalmonwith_87243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tbsp olive oil", "150g/5½oz salmon fillet, sliced into pieces 0.5cm/½in thick", "½ lemon, juice only", "¼ yellow pepper, finely chopped", "¼ red onion, finely chopped", "1 tsp chilli flakes", "2 tbsp chopped fresh parsley", "1 tbsp olive oil", "1 lemon, zest and juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat the oil in a small frying pan over a high heat and fry the salmon slices for 20 seconds on each side, or until just cooked through.", "Remove the salmon from the pan to a serving plate and squeeze over the lemon juice.", "For the salsa, mix all the salsa ingredients together in a bowl and serve with the salmon."]}, {"isVegetarian": false, "title": "Flat rib broth", "url": "www_bbc_co_uk_food_recipes_flat_rib_broth_00443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "4 carrots, 2 finely chopped, 2 diced ", "1 onion, finely chopped", "1 large stick celery, finely chopped", "1kg/2lb 4oz flat rib, or short ribs (including the bone) ", "125g/4½oz pearl barley", "125g/4½oz split peas", "2 bay leaves", "salt and freshly ground black pepper", "100g/3½oz lentils", "1 leek, sliced", "1 small turnip, cut into 1cm/½in dice", "2 medium potatoes, cut into 1cm/½in dice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large saucepan over a medium heat. Add the two finely chopped carrots, the onion and celery and cook for five minutes, or until soft. Add the flat ribs and 3 litres/5¼ pints of boiling water to the pan. ", "Bring back to the boil and add the pearl barley, split peas and bay leaves. Place a lid on the saucepan and reduce the heat. Simmer with the lid on for 1½ hours.", "Taste and add a good pinch of salt and pepper, to taste. Add the lentils and cook for a further 20 minutes, making sure to replace the lid.", "After 20 minutes, add the leeks, the reserved diced carrot, the turnip and the potatoes and cook for a further 20 minutes, or until tender.", "Adjust the seasoning by adding salt and pepper if required.", "Remove the flat ribs from the pan and set aside on a warm plate.", "Ladle the broth into serving bowls and carve a piece of flat rib from the bone and place on top of the broth. "]}, {"isVegetarian": false, "title": "Flatbread pizza with pepperoni, courgette and onion", "url": "www_bbc_co_uk_food_recipes_flatbread_pizza_with_08542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting ", "salt and black pepper", "2 tbsp olive oil ", "150-200ml/5-7fl oz warm water", "3 tbsp olive oil ", "2 garlic cloves, finely chopped ", "1 x 400g/14oz tin chopped tomatoes ", "½ tsp dried mixed herbs ", "1 courgette (about 200g/7oz), grated ", "2 balls mozzarella, drained and torn ", "100g/3½oz pepperoni slices ", "1 onion, very finely sliced "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the flatbreads, sieve the flour into a mixing bowl and season with a couple of pinches of salt and a pinch of pepper. Add the olive oil and mix in the warm water - starting with 150ml/5fl oz and adding more if needed to bring the mixture together to form a thick dough. Knead the dough in the bowl to bring it together.", "Knead the dough on a floured work surface for 3-4 minutes, or until the dough is slightly elastic. Cover and leave to rest while you prepare the rest of the dish.", "For the toppings, heat a small saucepan over a low heat. Add a dash of olive oil and add the garlic and fry for one minute. Add the tomatoes, dried herbs and a pinch of salt and pepper and bring to a simmer. Mash the tomatoes with a potato masher to create a smoother sauce and simmer the mixture for 10-15 minutes, or until thickened to a spreadable sauce.", "Preheat the oven to the highest temperature and place a non-stick baking tray in the oven to heat.", "For the flatbreads, divide the dough into four balls and roll each ball out on a floured surface until about 5mm/¼in thick. Lightly oil the hot baking tray, place the flatbread pizza bases on top and cook in the hot oven for 2-3 minutes (you may need to do this in batches if you don’t have room to do them all at once).", "Turn the flatbread pizza bases over. Taste the tomato sauce and add salt and pepper to taste. Divide the tomato mixture between the four flatbread pizza bases, spreading out until you almost reach the edges but leaving a 2cm/¾in border round the edge. ", "Sprinkle over the grated courgette, top with the torn mozzarella, pepperoni slices and onion. Drizzle with a little extra olive oil, season with salt and pepper and place back into the hot oven for 6-7 minutes, or until the base is cooked through and the cheese melting and turning golden-brown. Serve immediately. "]}, {"isVegetarian": true, "title": "Flattened rice with poha potatoes", "url": "www_bbc_co_uk_food_recipes_flattened_rice_with_poha_64857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium waxy potatoes (such as Charlotte or Jersey Royal)", "140g/5oz poha rice (also called flaked rice or thick flattened rice)", "3 tbsp olive oil", "generous pinch of ground asafoetida ", "½ tsp urad dal", "½ whole brown mustard seeds", "½ tsp whole cumin seeds", "1 dried hot chilli", "10-15 fresh curry leaves, lightly crushed", "½ onion, chopped", "salt", "1 tsp sugar", "2-3 tbsp chopped fresh coriander, to garnish", "4 wedges of lime or lemon, to serve", "1 round lettuce, washed and leaves separated", "¼ cucumber, chopped", "3 plum tomatoes, chopped"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes until cooked. Drain and set aside to cool, then peel and cut into 1cm/½in cubes.", "Put the rice in a sieve and wash gently but thoroughly under cold running water. Empty it into a bowl, cover generously with water and leave to soak for two minutes. Drain and leave in the sieve set over a bowl. ", "Put the oil in a large, non-stick frying pan and set it over a medium-high heat. When hot, add the asafoetida and the urad dal. As soon as the dal starts to pick up a little colour, add the mustard seeds, cumin seeds and chilli (whatever type you are using). As soon as the mustard seeds start to pop, a matter of seconds, add the curry leaves (take care as they will splutter), then the onion and potatoes. Lower to a medium heat and fry, stirring now and again, for 3-4 minutes or until the onion and potatoes are slightly browned.", "Sprinkle a pinch of salt over the top and stir.", "Add the poha rice, gently breaking up any lumps, and sprinkle ½ teaspoon of salt and one teaspoon sugar over the top. Cook on a low heat for 3-4 minutes, tossing frequently by lifting all the ingredients from the bottom of the pan with a flat spatula and folding them over, until the poha is heated through. Cover and set aside until you are ready to eat. ", "To make the salad, mix all the ingredients in a large bowl.", "To serve, garnish the poha potatoes with fresh coriander and serve with lime or lemon wedges. Serve the salad alongside."]}, {"isVegetarian": false, "title": "Flexible fish stew", "url": "www_bbc_co_uk_food_recipes_flexible_fish_stew_82833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "knob of butter", "1 bulb fennel, finely chopped, fronds reserved for garnish", "1 bunch spring onions, chopped", "1 tsp paprika", "6 whole peppercorns", "1 x 400g tin chopped tomatoes", "6-8 baby new potatoes (preferably Jersey Royals), washed and halved ", "4-8 mussels, cleaned and beards removed", "small fillet haddock (about 150-170g), skinned, pin boned and cut into chunks ", "small fillet monkfish (about 150-170g), skinned, pin boned and cut into chunks ", "12 Queen Scallops or fresh prawns (optional)", "large sprig fresh tarragon", "handful cherry tomatoes, halved", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the base for the stew, heat a little olive oil and a knob of butter in a large saucepan. When the butter is melted, add the chopped vegetables and a pinch of salt. ", "Cover with a lid and simmer gently for 4-5 minutes, then add a teaspoon of paprika, a generous twist of freshly ground black pepper and the whole peppercorns. Pour in the tinned tomatoes, then fill the empty tin with water and add that to the pot as well. Simmer with a lid on for 5 minutes or so, stirring occasionally. Add the new potatoes, replace the lid and continue to simmer for another 5 minutes, or until the potatoes are nearly cooked through.  ", "If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Add the fish and mussels to the pan. If you are using Queen scallops or fresh prawns, they should go in a minute or two later, as they will cook quickly. ", "Add a large sprig of tarragon and simmer for a few more minutes. The mussels are cooked when they've opened up. Discard any that don't open. ", "Serve the stew in bowls garnished with the cherry tomatoes and fennel fronds."]}, {"isVegetarian": true, "title": "Floating island with strawberry coulis and summer fruit", "url": "www_bbc_co_uk_food_recipes_floating_island_with_39422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter, softened, for greasing", "225g/8oz cream cheese", "100g/3½oz icing sugar, sifted", "1 lemon, zest only, plus a squeeze of the lemon juice", "200g/7¼oz strawberries, hulls removed, cut in half", "200g/7¼oz raspberries", "75g/2½ oz icing sugar, sifted (or caster sugar)", "220g/7¾oz egg whites", "230g/8¼oz caster sugar", "2 vanilla pods, seeds scraped out using a sharp knife", "50g/2oz pistachios, shells removed, finely chopped (optional)", "100g/3½oz caster sugar", "150g/5¼oz raspberries", "16 strawberries, hulls removed, cut into quarters", "1 small white-fleshed melon, such as Honeydew, peeled, seeds removed, flesh finely diced", "1 small orange-fleshed melon, such as canteloupe, peeled, seeds removed, flesh very finely diced"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease the insides of six dariole moulds by brushing them with the softened butter.", "For the cream cheese mixture, beat the cream cheese, icing sugar, lemon zest and a squeeze of lemon juice in a large bowl until well combined. Chill in the fridge until needed.", "For the strawberry coulis, heat the strawberries and raspberries in a large pan for 4-5 minutes, or until they start to break down. ", "Add the icing (or caster) sugar and continue to cook the fruit for a further 2-3 minutes, or until the sugar has dissolved. ", "Transfer the coulis mixture to a food processor and blend until smooth, adding a splash of water to the mixture if necessary to loosen. Strain the coulis through a sieve and set aside to cool. Chill in the fridge until needed.", "For the floating islands, make a meringue mixture: whisk the egg whites in a bowl until soft peaks form when the whisk is removed. Add the sugar and vanilla seeds and continue to whisk until stiff, glossy peaks form when the whisk is removed. Transfer the mixture to a piping bag and set aside.", "For the caramel, heat a non-stick frying pan over a medium heat and add the sugar. Cook the sugar until it has dissolved and formed a caramel. ", "Pour a little of the caramel into each of the dariole moulds and tip the moulds to line them with the caramel. ", "Pipe some of the meringue mixture into each mould. ", "Arrange the moulds in a roasting tray. Add enough boiling water to reach halfway up the sides of the moulds and bake in the oven for 7-8 minutes, or until the meringue has just set.", "To serve, drizzle a little of the coulis into each of six serving bowls. Sprinkle the raspberries, strawberries and melon into the bowls. Turn out one floating island into each bowl, spooning over any excess caramel from the mould. Place a quenelle of the cream cheese mixture alongside each serving. "]}, {"isVegetarian": true, "title": "Floating islands", "url": "www_bbc_co_uk_food_recipes_floating_islands_01988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_01988_16x9.jpg", "ingredients": ["750ml/1⅓ pint milk", "1 vanilla pod, seeds only", "8 free-range egg yolks", "190g/7oz caster sugar", "500ml/18fl oz milk ", "1 tbsp caster sugar", "8 free-range egg whites", "190g/7oz caster sugar", "75g/2½oz caster sugar "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crème anglaise, heat the milk and vanilla seeds in a saucepan over a medium heat. Simmer for 4-5 minutes.", "Whisk together the egg yolks and sugar in a mixing bowl.", "Pour the hot milk mixture onto the eggs and sugar, a little at a time, so the eggs do not start to cook, whisking continuously until smooth and creamy. ", "Return the mixture to the saucepan and place the pan over a medium heat and stir continuously for 4-5 minutes, or until the mixture has thickened enough to coat the back of a spoon.", "Strain the mixture through a sieve into a bowl, leave to cool and then refrigerate.", "For the poaching liquor, combine the milk and 500ml/18fl oz water with the sugar in a saucepan, stirring to dissolve the sugar.", "For the meringue, using an electric hand whisk, whisk the whites in a bowl until stiff peaks form when the whisk is removed, but the mixture should not look too dry. Add one tablespoon of the sugar to the egg whites, and continue to whisk until the mixture comes back to stiff peaks. Add the sugar one tablespoon at a time until it has all been used, and the meringue is thick and glossy.", "Using a serving spoon dipped in cold water, shape big quenelles of the meringue and gently poach in the milk and water solution, turning after 4-5 minutes to ensure they are cooked on both sides. Make sure the liquid doesn’t boil or the meringues will puff then collapse. When fully cooked, gently place on a wire rack to drain.", "For the caramel, pour the sugar into a clean pan. Melt the sugar slowly, stirring with a wooden spoon over a low heat until the sugar turns a dark copper colour. Remove immediately from the heat to ensure the caramel does not burn.", "Pour the caramel over the meringues. When set, take the caramel-covered meringues off the tray and serve in a generous pool of the crème anglaise."]}, {"isVegetarian": true, "title": "Floating islands", "url": "www_bbc_co_uk_food_recipes_floatingislands_86219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range egg whites", "125g/4½oz caster sugar", "50g/2oz icing sugar", "1 vanilla pod, split, seeds scraped out", "1 tbsp honey"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the egg whites into a clean, dry bowl and whisk with an electric hand whisk until stiff peaks form when the whisk is removed. Gradually add the sugar one tablespoon at a time until all the sugar is incorporated and the mixture is glossy. ", "Half-fill a medium saucepan with boiling water, add the vanilla seeds and bring to a gentle boil.", "Using two tablespoons, make quenelles (large spoonfuls) of meringue mixture and then drop the quenelles into the boiling vanilla water. Poach for 2-3 minutes, turn over, drizzle with honey and poach for another 2-3 minutes. ", "Carefully spoon onto a plate and repeat with the rest of the meringue mix."]}, {"isVegetarian": true, "title": "Floral tea cake", "url": "www_bbc_co_uk_food_recipes_floral_tea_cake_15741", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floral_tea_cake_15741_16x9.jpg", "ingredients": ["3 tbsp camomile tea (preferably whole flowers) ", "120g/4½ oz unsalted butter", "8 free-range eggs", "250g/9oz caster sugar", "250g/9oz plain flour", "420g/15oz baking margarine ", "850g/1lb 14oz icing sugar", "½ tsp elderflower cordial ", "2 drops elderflower extract (available online), optional", "yellow food colouring gel"], "serves": "Makes 1 x 20cm/8 inch cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and flour a 20cm/8in springform cake tin.", "For the cake, crush the tea in a spice grinder or pestle and mortar until it is a fine powder. Melt the butter in a saucepan and stir in the tea. When melted, remove from the heat.", "Crack the eggs into a large mixing bowl and beat in the sugar using an electric mixer. Beat until the mixture is thick enough to hold its shape for several seconds when drizzled on its surface (known as the ribbon stage, this can take around 15 minutes). Sift in a third of the flour and fold in using a large metal spoon. Sift in another third of the flour and fold in as before. Sift in the remaining flour into the butter mixture and mix well then gently fold into the rest of the batter.", "Transfer the batter to the tin and bake for 45 minutes (checking regularly to make sure it doesn’t over brown). When cooked, remove from the oven and leave to cool in the tin for 5 minutes. Remove from the tin and leave to cool on a wire rack. ", "For the buttercream, using an electric mixer beat the margarine, icing sugar and elderflower flavourings together in a large bowl. Keep beating until white and fluffy, then set aside in the fridge until needed.", "To assemble, if necessary, trim the top of the cake to ensure it is flat. Cut the cake in half horizontally. Add a generous layer of buttercream to the bottom layer of cake and then place the other layer on top. Transfer the cake to a serving board or cake stand.", "Spread a thin layer of buttercream all over the cake (also known as a crumb coat).", "Fit a large piping bag with a medium closed star nozzle. Smear streaks of the yellow food colouring on the inside of the piping bag using a pastry brush or a round tipped knife.  ", "Fill the piping bag with buttercream and pipe a few test dots until the buttercream comes out two-tone. Starting at the base of the cake, pipe lines of dots all around the cake to cover the sides, then start piping the top in circles of dots starting at the edge and working inwards. Place in the fridge between icing levels if you find the buttercream is melting. "]}, {"isVegetarian": false, "title": "Fantastic fish fingers", "url": "www_bbc_co_uk_food_recipes_floss_fantastic_fish_31623", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floss_fantastic_fish_31623_16x9.jpg", "ingredients": ["40g/1½oz bread (approximately 1 thick slice) ", "400g/14oz skinless white fish fillets (such as cod, haddock or pollock)", "5 tbsp plain flour", "1 large free-range egg, beaten", "¼ tsp paprika (optional)", "1 tsp garlic powder (optional)", "freshly ground black pepper", "little sunflower oil, a spray oil is also good to use"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with non-stick parchment paper. ", "To make the breadcrumbs, put the bread in a food processor and blitz into fine breadcrumbs. If you do not have a food processor, you could also try grating the bread, but you would need an adult to help you with this. ", "Pat the fish dry using kitchen paper. Carefully cut the fish into strips, the strips should be about 2cm thick and 8cm long. Run your finger gently over the fish to make sure all the bones have been taken out, you can get an adult to double-check this for you. ", "Set up your assembly line. Get 3 dinner plates and one shallow bowl ready.  ", "Put the flour on the first plate. Crack the egg into the shallow bowl and beat lightly using a fork.  Put the breadcrumbs on the second plate and mix with the paprika, garlic powder and black pepper. The third plate is for the coated fish fingers. ", "Toss each fish finger in the flour and shake off any excess. Next, dip the fish fingers into the egg mixture and allow any extra egg liquid to drip back into the bowl. Then coat the fish fingers with the breadcrumbs. Slightly press the fish fingers into the breadcrumbs to make sure they are well coated and then put them on the third plate. ", "Put the fish fingers in the fridge for 10 minutes, this will help the coating stick to the fish better.  Wash your hands again before moving on to the next step, it is really important to always wash your hands after handling raw fish or meat.", "Arrange the fish fingers in a single layer on the prepared baking tray. Drizzle or spray some oil over the fish fingers.", "Bake in the oven for 10-12 minutes, turning halfway through using cooking tongs. The fish fingers are cooked when the crumbs are golden-brown and the fish is cooked through.", "These fish fingers are best served with ketchup for dipping and with sweet potato wedges and peas alongside. "]}, {"isVegetarian": true, "title": "Rich flourless chocolate cake", "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_82362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz good-quality dark chocolate, chopped into pieces", "100g/3½oz unsalted butter, plus extra for greasing", "4 large free-range eggs, separated", "175g/6½oz icing sugar, sifted"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a large baking mould.", "In a small bowl resting over a saucepan of hot water, melt the chocolate and butter together (the bowl should not be touching the water).", "In a separate bowl whisk the egg yolks with the icing sugar until pale and creamy.", "Fold the melted chocolate into the egg mixture.", "Using a clean whisk, whisk the egg whites until soft peaks form, then fold gradually into the chocolate mixture.", "Using a spatula pour the mixture into the greased mould, then bake in the oven for approximately 30 minutes, until slightly cracked on the top, but still gooey in the middle. Serve."]}, {"isVegetarian": true, "title": "Floating islands with spun sugar", "url": "www_bbc_co_uk_food_recipes_floating_islands_with_03517", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_with_03517_16x9.jpg", "ingredients": ["300ml/10½fl oz whole milk", "300ml/10½fl oz double cream", "1 tsp vanilla bean paste", "6 free-range eggs, yolks only", "100g/3½oz caster sugar", "6 free-range eggs, whites only", "150g/5½oz caster sugar", "100g/3½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the poaching liquid (and what will become the crème anglaise), heat the milk and cream in a large lidded pan or deep-sided frying pan. Stir in the vanilla bean paste and bring to a simmer over a low heat.", "For the meringues, in a large grease-free bowl use an electric hand whisk to whisk the egg whites together on fast speed, until stiff peaks form when the whisk is removed. Add one tablespoon of the sugar to the egg whites and continue to whisk until the mixture comes back to stiff peaks. Keep adding sugar one tablespoon at a time until 150g/5½oz has been used, and the meringue is thick and glossy.", "Using two large tablespoons or serving spoons dipped in cold water, shape six large quenelles from the meringue mixture and place in the poaching liquid, over a very low heat for about 9-10 minutes, flipping the quenelles halfway through.  Cover the pan with a lid while poaching. Make sure the poaching liquid doesn’t boil or the meringues will puff up then collapse.", "When the quenelles are really puffed up and cooked, transfer them to a wire rack to drain.", "For the crème anglaise, pass the poaching milk through a sieve into a large jug.  ", "In a large bowl, whisk the egg yolks and caster sugar together until pale and fluffy.  Pour over the warm poaching milk, whisking continuously.  Pour the mixture into a clean heavy-based pan and cook over a very low heat for 3-4 minutes stirring continuously until smooth and thick enough to coat the back of a spoon. Remove from the heat and set aside.", "For the spun sugar, melt the sugar, without stirring, in a small stainless steel pan over a medium heat. Grease a rolling pin or knife steel with oil. Take care as the sugar will be very hot. When it turns a dark golden-brown remove from the heat. Leave to cool slightly, then, using the back of a fork, flick the caramel backwards and forward over the rolling pin or knife steel.  Gather the strands into rough ball shape and place on a sheet of parchment paper. ", "To serve, pour a little crème anglaise into each serving bowl and float a quenelle of meringue on top. Decorate the quenelle with a ball of spun sugar."]}, {"isVegetarian": true, "title": "Flourless chocolate cake", "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_93580", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flourlesschocolateca_93580_16x9.jpg", "ingredients": ["300g/10½oz plain chocolate, broken into pieces ", "225g/8oz caster sugar ", "175ml/6fl oz boiling water  ", "225g/8oz salted butter, cut into cubes, plus extra for greasing  ", "6 free-range eggs, separated  ", "1 tsp instant coffee powder ", "2 tsp vanilla extract ", "200ml/7fl oz crème fraîche", "255g/9oz summer berries ", "1 tbsp plain chocolate, grated", "Icing sugar, to dust"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cake, grease and line the base of a 23cm/9in springform tin with baking parchment. ", "Blend the chocolate and sugar in a food processor until a fine powder forms. Add the boiling water, butter, egg yolks, coffee powder and vanilla extract and blend until well combined.", "In a clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed, then, using a metal spoon, gently fold into the chocolate mixture.", "Pour the mixture into the prepared cake tin and bake for 45-55 minutes, or until a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven and allow to cool in the tin, then transfer to the fridge for 2-3 hours. ", "To serve, remove the cake from the tin and place on a serving plate or cake stand, spread the crème fraîche on top, then scatter over the berries. To decorate, grate some chocolate over the top, or dust with icing sugar."]}, {"isVegetarian": true, "title": "Flower power pizza", "url": "www_bbc_co_uk_food_recipes_flower_power_pizza_13681", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flower_power_pizza_13681_16x9.jpg", "ingredients": ["butter, ghee or coconut oil, for greasing", "140g/5oz cauliflower (about ¼ of a head without the stalk)", "1 egg white, beaten", "50g/1¾oz ground almonds", "40g/1½oz buckwheat flour", "½ tsp sea salt", "½ tsp black pepper", "¼ tsp bicarbonate of soda", "1 medium mozzarella ball", "2 handfuls fresh tomatoes (a mixture of colours look good)", "chilli flakes (optional)", "handful fresh basil", "drizzle of olive oil, to serve"], "serves": "Makes 1 30cm/12in pizza", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/190C fan/350F/Gas 4. Line a baking tray with baking parchment and lightly grease with butter, ghee or coconut oil.", "Grate the cauliflower into rice-sized pieces using a hand grater or food processor.", "Put all the pizza base ingredients in a bowl and mix well with a spoon, or add to the food processor and blend, to form a sticky dough.", "Using the back of a spoon, spread the dough out onto the greased parchment on the tray, shaping it into a circle 30cm/12in wide.", "Bake in the oven for about five minutes, then flip it over and return to the oven for another two minutes.", "Pull the mozzarella ball apart into small pieces and arrange over the base of the pizza.", "Slice the tomatoes into 1cm/½in thick slices and arrange over the pizza. Add the chilli flakes, if desired.", "Bake the pizza for 10-15 minutes more until the mozzarella is melted and bubbling.", "Sprinkle the basil over the top of the pizza before serving and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Fluffy American pancakes", "url": "www_bbc_co_uk_food_recipes_fluffyamericanpancak_74828", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fluffyamericanpancak_74828_16x9.jpg", "ingredients": ["135g/4¾oz plain flour", "1 tsp baking powder", "½ tsp salt", "2 tbsp caster sugar", "130ml/4½fl oz milk", "1 large egg, lightly beaten", "2 tbsp melted butter (allowed to cool slightly) or olive oil, plus extra for cooking", "Maple syrup", "Butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour, baking powder, salt and caster sugar into a large bowl. In a separate bowl or jug, lightly whisk together the milk and egg, then whisk in the melted butter.", "Pour the milk mixture into the flour mixture and, using a fork, beat until you have a smooth batter. Any lumps will soon disappear with a little mixing. Let the batter stand for a few minutes.", "Heat a non-stick frying pan over a medium heat and add a knob of butter. When it's melted, add a ladle of batter (or two if your frying pan is big enough to cook two pancakes at the same time). It will seem very thick but this is how it should be. Wait until the top of the pancake begins to bubble, then turn it over and cook until both sides are golden brown and the pancake has risen to about 1cm (½in) thick.", "Repeat until all the batter is used up. You can keep the pancakes warm in a low oven, but they taste best fresh out the pan.", "Serve with lashings of real maple syrup and extra butter if you like."]}, {"isVegetarian": true, "title": "Focaccia", "url": "www_bbc_co_uk_food_recipes_focaccia_08389", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focaccia_08389_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white bread flour", "2 tsp salt", "2 sachets dried easy blend yeast", "2 tbsp olive oil", "400ml/14fl oz cold water", "olive oil, for drizzling", "fine sea salt"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, salt, yeast, olive oil and 300ml/10½fl oz of the water into a large bowl. Gently stir with your hand or a wooden spoon to form a dough then knead the dough in the bowl for five minutes, gradually adding the remaining water.", "Stretch the dough by hand in the bowl, tuck the sides into the centre, turn the bowl 80 degrees and repeat the process for about five minutes.", "Tip the dough onto an oiled work surface and continue kneading for five more minutes. Return the dough to the bowl, cover and leave to rise until doubled in size.", "Line two large baking sheets with baking paper. Tip the dough out of the bowl and divide into two portions. Flatten each portion onto a baking sheet, pushing to the corners, then leave to prove for one hour.", "Preheat the oven to 220C/425F/Gas 7. Drizzle the loaves with oil, sprinkle with fine sea salt then bake in the oven for 20 minutes. When cooked, drizzle with a little more olive oil and serve hot or warm."]}, {"isVegetarian": true, "title": "Focaccia", "url": "www_bbc_co_uk_food_recipes_focaccia_82368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint tepid water", "1½ tsp dried yeast or 2 heaped tsp fresh yeast", "500g/1lb 2oz '00' flour or strong white bread flour, plus extra for dusting", "1½ tsp salt", "3 tbsp olive oil, plus extra for greasing ", "extra virgin olive oil, for drizzling", "medium coarse sea salt", "2 sprigs rosemary, torn into small pieces"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Pour a little of the tepid water into a small bowl. Add the yeast and blend using your fingers. Leave the yeast for five minutes to soften and dissolve.", "Mix the flour and salt together in a large mixing bowl. You may like to transfer your mixture to a pastry board or other flat work surface at this stage and prepare the dough there, in traditional Tuscan style. Otherwise, mix the dough in the bowl.", "Make a well in the centre of the flour and salt mixture. Pour the blended yeast and water into the well along with the olive oil. Mix thoroughly. Gradually add the rest of the tepid water until a sticky dough is formed.", "Transfer the dough onto a floured surface. Gather any stray pieces. Knead the dough for about 10 minutes, adding a little extra flour if necessary, until smooth and elastic and the dough no longer sticks to your hand. To see if it is ready, you can carry out the stretch test: pull off a piece of dough, it should be elastic enough not to break quickly when stretched out.", "Next accumulate any stray ends and rough sections by 'chafing' your ball of dough. Hold it and curve your hands around it, use your palms to pull at its sides gently while you slowly rotate it, letting your little fingers meet underneath. Do this for five minutes. You should be left with a neat, smooth ball.", "Oil a bowl and place the dough inside and cover with either oiled cling film or a damp tea towel. Leave in a warm place to rise until doubled in size - about 1½ hours depending on the room temperature.", "Use your fist to knock it back, then knead it again for a further two minutes. ", "Leave to rest again, but only for 5-10 minutes. ", "Shape by placing into a shallow baking tray, using your hands to spread it out to a depth of about 1.5cm/¾in, then allow to rise again, covered with a tea towel, until doubled in size - this will take about 30 minutes. Preheat the oven to 200C/400F/Gas 6.", "Create a dimpled effect by repeatedly pushing your fingertips gently into the surface of the dough. Drizzle a generous amount of extra virgin olive oil evenly over the dough. Sprinkle over the sea salt and push the small pieces of rosemary into the dough. ", "Bake for 25-35 minutes or until the top is crusty and cooked through to the base. Serve."]}, {"isVegetarian": true, "title": "Focaccia with garlic and rosemary", "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_28682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12g fresh yeast, or 7g instant yeast", "350ml/12fl oz lukewarm water ", "500g/1lb 2oz strong white bread flour, plus extra for dusting", "2 tsp salt ", "semolina or dried breadcrumbs, for sprinkling", "1 tbsp extra virgin olive oil, plus extra for drizzling ", "2 garlic cloves, finely chopped ", "needles of 2 rosemary branches, finely chopped ", "1 tsp sea salt ", "freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the yeast in the warm water.  Place the flour and salt in a bowl, add the yeast mixture and mix to form a soft dough.  Lightly flour the work surface and knead well for 5 minutes until smooth and elastic.  Cover with a tea towel and rest in a warm place for 20 minutes. ", "Roll out the dough on a lightly floured work surface into a rectangular shape roughly the same as a 38x28cm/15x11in baking tray. Sprinkle the tray with semolina or breadcrumbs.  ", "Place the dough in the tray and pour the extra virgin olive oil in the middle.  With your fingers, spread the oil all over.  Leave for 5 minutes, then poke the dough all over with your fingers to make indentations.  Sprinkle the garlic, rosemary, salt and a little black pepper over the top. Cover with a cloth and leave to rest in a warm place for 45 minutes, or until doubled in size. ", "Preheat the oven to 240C/220C Fan/Gas 9. ", "Bake for about 15 minutes until evenly golden-brown.  Check the focaccia occasionally as domestic ovens often colour one side more, so turn the baking tray round accordingly.", "Remove and immediately drizzle a little extra virgin olive oil all over. Leave to cool, then cut into squares."]}, {"isVegetarian": true, "title": "Focaccia with garlic and rosemary", "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_35777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour ", "7g instant yeast ", "1 tsp salt ", "oil, for greasing", "2 tbsp extra virgin olive oil, plus extra to drizzle after baking", "3 rosemary branches, needles only, finely chopped ", "2 large garlic cloves, finely chopped ", "1 tsp flaked sea salt  ", "freshly ground black pepper "], "serves": "Makes 1 medium-sized rectangular focaccia", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the flour, yeast and salt with up to 350ml/12fl oz lukewarm water, until you have a soft dough. Knead for 10-15 minutes. Transfer to an oiled bowl, cover with cling film and leave to rise for 30 minutes.", "After 30 minutes, place into a lined and slightly warmed baking tray of 37 x 27cm/14 x 10¾in. Drizzle with olive oil and top with fresh rosemary, chopped garlic, sea salt and a little pepper.", "Press your fingers into the dough to make dimples and then rest again for another 30 minutes.", "Preheat the oven to 240C/450F/Gas 8. ", "Bake for about 15 minutes, or until evenly golden-brown.  Check the focaccia from time to time as domestic ovens can very often colour one side and not the other. Check and move the tray accordingly.  ", "Once cooked, remove from the oven and immediately drizzle some olive oil all over. Leave to cool, then cut into squares.  "]}, {"isVegetarian": true, "title": "Focaccia bread", "url": "www_bbc_co_uk_food_recipes_focacciabread_83716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3Ib 5oz strong white bread flour", "1 x 7g/¼oz sachet dried yeast", "50ml/2fl oz olive oil, plus a little extra for oiling", "pinch salt", "570ml/20fl oz/1 pint warm water", "sprigs rosemary", "2 tbsp olive oil", "1 tsp coarse sea salt"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, yeast, olive oil and salt in a mixer with a dough hook.", "Add the water to make a soft dough, and knead in the mixer until smooth and shiny.", "Transfer to an oiled bowl, cover with a tea towel and leave in a warm place for about an hour until well risen. ", "Tip the mix out onto a floured surface and knead to knock out any air pockets. Roll the dough into an oval-like shape about 2cm/¾in thick. Transfer to an oiled baking tray.", "Firmly press your fingers into the surface to 'pit' the surface. For the topping, drizzle with olive oil and lightly grind sea salt over the top. ", "Put a small sprig of rosemary into each pit. ", "Cover with a tea towel and set the loaf aside for another 20 minutes.  ", "Preheat the oven to 200C/400F/Gas 6.", "Transfer the loaf to the middle shelf of the oven and cook for about 15 minutes until golden brown.", "Serve straightaway."]}, {"isVegetarian": true, "title": "Focaccia with rosemary", "url": "www_bbc_co_uk_food_recipes_focacciawithrosemary_90210", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focacciawithrosemary_90210_16x9.jpg", "ingredients": ["30g/1oz fresh yeast", "½ tsp sugar", "600ml/1 pint 2fl oz warm water", "4 tbsp olive oil, plus extra for oiling", "680g/1½lb strong white flour, plus extra for dusting", "2 tsp salt", "2 tbsp olive oil", "1½ tsp coarse salt", "leaves from 3-4 rosemary sprigs"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the yeast with the sugar in a small bowl for about 30 seconds, until the yeast becomes liquid. Stir in two-thirds of the water and the olive oil.", "In a large bowl stir together the flour and the salt. Pour the yeast mixture into the flour and salt along with some of the remaining water, if needed. Mix with a wooden spoon and bring together to form a soft dough. Add more water if the dough is a bit dry.", "Turn the dough out onto a lightly floured surface and knead for ten minutes until smooth and elastic.", "Place the dough into a large, lightly oiled bowl. Cover with cling film or a damp cloth and leave in a warm place to rise for about 1½ hours until doubled in size.", "Preheat the oven to 220C/400F/Gas 7.", "When the dough has risen, knead it again for about five minutes on a clean floured work surface to 'knock it back'.", "Shape the dough into two rough circles. Place the circles onto two baking sheets, cover with a clean, damp cloth and allow to prove (rise) until double their original size (about 10-15 minutes).", "When the dough has risen, use your fingertips to form dimples in the dough. Brush with the olive oil and sprinkle with the salt and rosemary leaves.", "Transfer the baking sheets to the oven and bake for ten minutes.", "Reduce the heat to 190C/375F/Gas 5 and bake for a further 25-30 minutes until the loaves are golden and cooked-through. If you like, you can spray the bread with water (using a mister) once or twice during baking so that it 'steams' in the oven.", "When baked, turn out onto a wire rack to cool slightly. The focaccia is best eaten the day it's made."]}]