[{"ingredients": ["100 g / 3% C2% BDoz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "50 g / 1 oz de azúcar en polvo", "2 yemas de huevo de gallinas camperas", "1 cucharada de licor de crema irlandesa", "300 ml / 10 fl oz crema de vertido doble", "4 galletas digestivas, finamente trituradas", "dash Irish cream licor", "100g / 3½ oz de chocolate blanco", "cacao en polvo, para quitar el polvo"], "method": ["Whizz el chocolate en un procesador de alimentos.", "Ponga el azúcar y las 6 cucharadas de agua en una cacerola pequeña y caliente suavemente, revolviendo, hasta que el azúcar se haya disuelto. Hervir durante unos segundos hasta que se convierta en un almíbar diluido.", "Coloque el procesador de alimentos en funcionamiento y vierta el jarabe caliente a través del embudo sobre el chocolate para que se derrita. Agregue un poco de agua hirviendo si queda chocolate sin fundir. Agregue las yemas de huevo y procese durante unos segundos antes de agregar el licor de crema irlandés.", "En un recipiente aparte, bate la crema hasta que se formen picos suaves, luego dobla la mezcla de chocolate. Reserve 3 cucharadas de mousse en un tazón pequeño. Coloque la mousse restante en pequeños vasos o macetas. Deja en la nevera para establecer durante 6 horas o toda la noche.", "Para hacer las trufas de chocolate, agregue las galletas trituradas a la mousse reservada con un toque de licor de crema irlandesa. Mezcle bien y déle forma a seis bolas del tamaño de una trufa. Poner en un plato en la nevera durante 30 minutos.", "Derretir el chocolate blanco en un tazón pequeño a prueba de calor sobre una olla de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua. Inserta un palito de cóctel en las bolas, sumerge en el chocolate blanco derretido y revuelve hasta que esté cubierto. Ponga un trozo de papel para hornear y colóquelo en la nevera durante 30 minutos o hasta que esté firme.", "Coloque una trufa encima de cada mousse antes de servir y espolvoree con cacao. Sirve directamente de la nevera."], "url": "www_bbc_co_uk_food_recipes_chocolate_truffle_pot_53461", "title": "Trufas de chocolate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Rinde 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_truffle_pot_53461_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 350ml / 12fl oz", "400g / 14oz% 20dark% 20chocolate,% 20about% 2060 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "3-4 cucharadas de cacao en polvo tamizado", "200 g / 7 oz de azúcar en polvo", "50ml / 1¾fl oz de miel clara", "1 cucharada de glucosa líquida", "¾ cucharadita de bicarbonato de soda"], "method": ["Para las trufas de chocolate, coloque la crema en una cacerola y llévela a ebullición.", "Pon el chocolate en un bol, luego cuando la crema esté hirviendo, vierte sobre el chocolate y mezcla bien hasta que la mezcla esté suave.", "Déjelo enfriar, cubra y coloque en la nevera para enfriar y firme durante aproximadamente dos horas.", "Tamizar el polvo de cacao en un plato y, con una cucharadita, enrollar bolas de chocolate y caer directamente en el cacao y luego rodar para cubrirlos", "Coloque en un plato para reafirmar, luego sirva o guarde en un recipiente sellado en el refrigerador hasta que esté listo para servir.", "Para el caramelo toffee, forrar una bandeja de horno con pergamino para hornear.", "Coloque el azúcar, la miel, la glucosa y 50 ml / 1¾ fl oz de agua en una olla y llevar a ebullición.", "Continúe cocinando hasta que la temperatura alcance 160C / 320F en un termómetro de azúcar.", "Retire del fuego, deje enfriar durante 30 segundos para que las burbujas se dispersen, luego bata rápidamente en el bicarbonato de soda, revolviendo constantemente.", "Vierta sobre la bandeja de horno forrada y deje enfriar durante 30 minutos.", "Rompe los fragmentos y guárdalos en un recipiente sellado hasta que quieras servirlos."], "url": "www_bbc_co_uk_food_recipes_chocolate_truffles_with_97104", "title": "Trufas de chocolate con caramelo de ceniza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de cacao en polvo, para quitar el polvo", "165g / 5¾oz de chocolate negro (70 por ciento de sólidos de cacao), cortados en trozos pequeños", "165 g / 5¾oz de mantequilla sin sal, cortada en trozos pequeños, más extra para engrasar", "3 huevos medianos de granja", "3 yemas de huevo medianas de campo abierto", "85g / 3oz de azúcar en polvo", "2 cucharadas de harina normal", "crema doble, para servir"], "method": ["Engrasar seis moldes de pudín pequeños con mantequilla y espolvorear el interior con cacao en polvo, luego refrigerar durante 30 minutos.", "Derrita el chocolate y la mantequilla en un tazón resistente al calor colocado sobre una fuente de agua hirviendo (no permita que el recipiente toque el agua). Dejar enfriar un poco.", "Con un batidor eléctrico, bata los huevos, las yemas de huevo y el azúcar en polvo juntos durante varios minutos hasta lograr una consistencia espesa y pálida similar a la de una mousse.", "Con cuidado, dobla el chocolate derretido y la mantequilla enfriados en la mezcla de huevo y azúcar. Finalmente doble la harina cuidadosamente para no expulsar el aire de la mezcla.", "Divida la mezcla por igual entre los moldes preparados. Coloque en el refrigerador durante al menos dos horas o hasta que esté firme. Puede preparar los pudines con hasta 24 horas de anticipación y dejarlos en el refrigerador hasta que esté listo para cocinarlos.", "Precalienta el horno a 200 ° C (ventilador 180 °) / 400 ° F / Gas 6. Coloca los postres en una bandeja para hornear y hornea durante ocho minutos, o hasta que los postres se hayan levantado pero no estén rajados.", "Ponga los budines en platos individuales y sírvalos con crema para servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_volcanoes_37330", "title": "Volcanes de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6 postres individuales", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_volcanoes_37330_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de azúcar en polvo", "Cacahuetes salados de 350g / 12oz", "Harina normal 230g / 8oz", "65 g / 2¼ oz de cacao en polvo", "1 cucharadita de polvo de hornear", "¼ cucharadita de bicarbonato de soda", "¼ cucharadita de sal fina", "170g / 6oz de mantequilla, suavizada", "150 g / 5½ oz de azúcar en polvo", "1 huevo grande de gallinas camperas, golpeado", "1 cucharadita de extracto de vainilla", "4 cucharadas de suero de leche", "100ml / 3½fl oz de café fuerte", "400 ml / 14 fl oz crema doble", "50g / 1¾oz de azúcar glas", "100g / 3½ oz de malvaviscos, más o menos picados", "4 cucharadas de mantequilla de maní suave", "2 cucharadas de helado de vainilla", "280ml / 9½fl oz de leche entera"], "method": ["Alinee una bandeja para hornear con una lámina de silicona. Alinee otra bandeja con papel para hornear.", "Coloque el azúcar en una sartén grande a fuego medio. Derrita el azúcar y cocine, sin remover, hasta que se dore, luego agregue los cacahuates. Vierta la mezcla sobre la lámina de silicona. Deja para establecer.", "Para los pasteles de whoopie, coloque la harina, el cacao, el polvo de hornear, el bicarbonato de soda, la sal, la mantequilla, el azúcar, los huevos, el extracto de vainilla, el suero de leche y el café en una batidora eléctrica y mezcle hasta que estén bien combinados.", "Coloque la mezcla en una manga pastelera con una boquilla redonda lisa y pinte 4cm / 1½ en círculos, dejando un espacio de 3cm / 1¼in entre ellos en el pergamino para hornear.", "Hornee los pasteles de whoopie durante 10 minutos hasta que estén suaves al tacto. Dejar enfriar sobre una rejilla.", "Para el relleno, bata la crema con el azúcar en un tazón grande y agregue los malvaviscos.", "Para el batido de mantequilla de maní, coloque todos los ingredientes del batido en una licuadora y mezcle hasta que quede suave.", "Para servir, toma uno de los whoopies y cuchara sobre una cucharada de crema y sándwich con otro whoopie. Destroza el quebradizo y sirve un poco en el lado. Vierta el batido en un vaso y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_chocolate_whoopie_pies_37636", "title": "Tartas de chocolate whoopie y cacahuete salado quebradizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de mantequilla", "150 g / 5% C2% BDoz% 20chocolate,% 20 mínimo 2070% 20cocoa% 20solids,% 20plus% 20extra% 20for% 20melting% 20 (opcional)", "225g / 8oz de azúcar", "3 huevos de gallinas camperas", "1 cucharadita de extracto de vainilla", "250g / 8¾oz de harina", "30 g / 1¼ oz de cacao en polvo", "½ cucharadita de polvo de hornear", "18 malvaviscos", "Polvo de cacao", "Azúcar en polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja de hornear con papel antigrasa.", "Derrita la mantequilla y el chocolate en un tazón sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque el agua).", "Batir el azúcar, los huevos y la vainilla juntos en un recipiente aparte y doblar en la mezcla de chocolate.", "Tamizar la harina, el cacao y el polvo de hornear juntos, luego doblar en la mezcla de chocolate y huevo.", "Coloque cucharadas de la mezcla en la bandeja de hornear (la mezcla debe hacer 36 galletas) y hornee en el horno durante 6-8 minutos.", "Retire del horno y reserve la mitad de los bizcochos en una rejilla para enfriar. Voltee los bizcochos restantes y coloque un malvavisco encima de cada uno. Vuelva al horno por 2-3 minutos, o hasta que los malvaviscos se hayan ablandado.", "Retire del horno y deje a un lado en una rejilla para enfriar un poco. Presione las galletas enfriadas en la parte superior.", "Opcional: Derrite 100 g / 3½ oz de chocolate adicional y viértalo sobre las galletas, luego déjelo enfriar."], "url": "www_bbc_co_uk_food_recipes_chocolate_whoopies_67418", "title": "Pasteles de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_whoopies_67418_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 lb% 202 oz% 20 buena% 20 calidad% 20 ml% 20 agua% 20 (% mínimo 2040%% 20cocoa% 20sólidos)", "2 cucharadas de aceite de girasol", "Jugo de yuzu 125ml / 4fl oz", "150ml / 5fl oz de jarabe de azúcar", "5½ g de agar", "sal, para condimentar", "ácido cítrico, para condimentar", "10g / ¼oz de polvo de miso seco", "20g / ¾oz de sal marina"], "method": ["Para el chocolate aireado, derrita el chocolate con el aceite de girasol y déjelo en infusión durante 1 hora.", "Colar en una pistola de espuma y cargar con 2 bombillas.", "Rocíe 100 g / 3½ oz en un recipiente de plástico y coloque en una máquina de envasado al vacío. Luego colóquelo en una máquina sous-vide y apague cuando el chocolate llegue a la parte superior del recipiente.", "Deje en la nevera durante al menos 2 horas. Retirar del recipiente y cortar en 4 porciones.", "Para el puré de yuzu, mezcle el jugo de yuzu, el jarabe de azúcar y agar-agar juntos. Coloque en una sartén y deje que hierva. Vierta en un recipiente y déjelo reposar.", "Una vez establecido, transfiera a una licuadora y mezcle hasta que quede suave. Cuele y si es necesario, sazone con un poco de sal y ácido cítrico.", "Para la sal de miso, cubra suavemente la sal en el miso en polvo y guárdelo en un recipiente hermético hasta que lo necesite.", "Para servir, vierta 5 puntos del puré de yuzu a través de cada porción del chocolate aireado y polvo con 4 a 5 granos de la sal de miso."], "url": "www_bbc_co_uk_food_recipes_chocolate_yuzu_miso_80775", "title": "Choko y Yuzu Miso", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 16-20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de chocolate con leche, picado", "1 chile rojo, picado", "Crema doble de 300 ml / ½ pinta, batida a picos suaves", "azúcar glas, al polvo"], "method": ["Coloque el chocolate en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento y caliente, revolviendo ocasionalmente, hasta que se derrita.", "Agregue casi todos los chiles. Retirar del fuego y dejar enfriar un poco.", "Doble el chocolate derretido en la crema batida en un tazón grande, luego la cuchara en un plato de servir. Enfríe hasta que sea necesario.", "Para servir, espolvorear con el chile reservado y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolateandchillimo_87986", "title": "Mousse de chocolate y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateandchillimo_87986_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120 g / 4 oz de mantequilla sin sal, más extra para engrasar", "120g / 4 oz de chocolate negro (mínimo 70 por ciento de sólidos de cacao)", "4 huevos de gallinas camperas", "220 g / 7½ oz de azúcar en polvo", "Harina normal de 75 g / 2½ oz", "½ cucharadita de polvo de hornear", "50 g / 2 oz de cacao en polvo", "200g / 7 oz de azúcar", "100 g / 3½ oz de mantequilla", "100ml / 3½ fl oz crema doble", "crema batida o coagulada, para servir"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Engrase cuatro tazas de café o tazas de té a prueba de horno (o moldes) con mantequilla.", "Coloque el chocolate amargo y la mantequilla en un recipiente resistente al calor colocado sobre una fuente de agua apenas hervida (asegúrese de que el agua no toque el fondo del recipiente).", "Revuelva la mezcla de chocolate y mantequilla hasta que se derrita y combine, luego retírela del fuego y deje que se enfríe un poco.", "Batir los huevos en un recipiente aparte hasta que estén espumosos, luego agregar el azúcar y batir hasta que estén pálidos y espesos.", "Poco a poco agregue la mezcla derretida de chocolate y mantequilla a los huevos, revolviendo continuamente.", "Tamiza la harina, el polvo de hornear y el cacao en polvo, luego dóblalos en la mezcla de chocolate y huevo.", "Vierta la mezcla en las tazas preparadas y hornee durante 8-12 minutos (dependiendo del tamaño de las tazas), o hasta que estén cocidas pero todavía pegajosas en el medio.", "Para la salsa, derrita el azúcar en una sartén de base pesada a fuego medio, revolviendo continuamente.", "Agregue la mantequilla y bata bien hasta que se combinen, luego retire del fuego y mezcle con la crema.", "Para servir, coloque los budines en sus tazas en platos pequeños. Verter sobre la salsa de caramelo y terminar con una cucharada de crema batida o coagulada."], "url": "www_bbc_co_uk_food_recipes_chocolateandcaramelp_89233", "title": "Postres de chocolate y caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "300 g / 10½ oz de azúcar en polvo", "50g / 2oz de chocolate (70 por ciento de sólidos de cacao), rallado", "3 cucharadas de cacao en polvo", "1 cucharadita de vinagre de jerez", "Avellanas 150g / 5oz, sin cáscara, tostadas, picadas", "Crema doble de 400 ml / 14 fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "1 vaina de vainilla, partido, semillas raspadas", "1 cucharada de azúcar", "200 g / 7 oz de extensión de avellanas con chocolate", "100g / 3½oz de mantequilla sin sal", "Crema doble de 200 ml / 7 fl oz", "2 cucharadas de licor de avellana"], "method": ["Precalentar el horno a 180 ° C / 365 ° F / Gas 4.", "Para los merengues, batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor.", "Agregue el azúcar, una cucharada a la vez, batiendo bien.", "Agregue el chocolate, el cacao en polvo, el vinagre y las nueces y doble suavemente en la mezcla de merengue.", "Cubra una bandeja para hornear con papel resistente a la grasa y coloque pequeños montones de mezcla de merengue sobre ella.", "Transfiera la bandeja al horno y baje la temperatura a 150C / 300F / Gas 2 inmediatamente y hornee por 45-50 minutos. (Los merengues deben ser crujientes por fuera y masticables en el medio).", "Para el relleno, coloque la crema, las semillas de vainilla y el azúcar en un tazón limpio y mezcle bien.", "Para la salsa, coloque la mezcla de chocolate y avellanas, la mantequilla, la crema doble y el licor de avellana en una sartén a fuego lento. Permita que los ingredientes se derritan, revolviendo ocasionalmente, hasta que se combinen.", "Para servir, coloque una cucharada de mezcla de relleno entre dos merengues. Coloque en un plato y vierta la salsa sobre la parte superior. Repita con los merengues restantes y sirva."], "url": "www_bbc_co_uk_food_recipes_chocolateandhazelnut_86256", "title": "Merengues de chocolate y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de chocolate negro, picado", "3 huevos grandes de gallinas camperas", "110 g / 4oz de mantequilla sin sal, cortada en cubitos", "150 g / 5 oz de azúcar en polvo", "Avellanas de tierra 90g / 3oz", "60g / 2oz de harina auto crianza", "3 cucharadas de licor de naranja", "pizca de sal", "crema recién batida, para servir", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids),% 20chopped", "60g / 2oz de mantequilla sin sal, cortada en cubitos", "1 cucharada de licor de naranja (opcional)", "10-12 avellanas tostadas enteras, para decorar"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5. Pase la base de una lata para pasteles de 23cm / 9 in con papel de horno y engrase los lados.", "Coloque el chocolate picado en un recipiente a prueba de calor sobre una fuente de agua hirviendo, asegurándose de que el recipiente no toque el agua. Revuelva suavemente hasta que desaparezcan los últimos grumos y retírelo del fuego. Agregue la mantequilla y revuelva hasta que esté completamente incorporado.", "Separe las claras de huevo de las yemas de huevo, colocándolas en recipientes separados. Agregue el azúcar a las yemas de huevo y mezcle con un batidor eléctrico hasta que esté pálido y esponjoso. Doble con cuidado el chocolate, las avellanas molidas y la harina. Finalmente, agregue el licor de naranja.", "Usando un batidor eléctrico, bata las claras de huevo con la sal hasta que se formen picos duros. Revuelva una cucharada de la clara de huevo en la mezcla de chocolate hasta que esté completamente incorporada, luego doble las claras de huevo restantes en la mezcla con una cuchara de metal.", "Vierta la mezcla de la torta en la lata preparada y hornee durante 40-50 minutos, hasta que esté firme al tacto. (Todavía estará húmedo en el centro, por lo que la prueba de pincho habitual no funcionará). Deje enfriar durante 5-10 minutos, luego colóquelo en una rejilla para terminar de enfriar. Cuando esté frío, colóquelo en un plato para servir.", "Para hacer el glaseado, derrita el chocolate en un recipiente a prueba de calor sobre una fuente de agua hirviendo, asegurándose de que el recipiente no toque el agua. Retire el tazón del fuego y bata en la mantequilla poco a poco con una cuchara de madera. Agrega el licor, si lo estás usando. Deje que se enfríe durante 5-10 minutos, hasta que empiece a espesarse, pero todavía se está moqueando.", "Extiende el glaseado sobre el pastel y por los lados, usando una espátula. Decora la parte superior con las avellanas enteras antes de que se establezca el glaseado. Sirva con un poco de crema recién batida."], "url": "www_bbc_co_uk_food_recipes_chocolateandhazelnut_90185", "title": "Pastel de chocolate y avellanas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateandhazelnut_90185_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3oz de harina de auto crianza", "55g / 2oz de azúcar en polvo de oro", "Margarina de soja 55 g / 2 oz", "50 g / 1% C2% BEoz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids),% 20broken% 20up% 20into% 20small% 20chunks", "50 g / 1¾oz de nueces de macadamia, reducidas a la mitad"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Frote la harina, el azúcar impalpable y la margarina hasta que empiece a formar una masa. Agregue un poco más de harina si la mezcla parece demasiado húmeda.", "Mezcle los trozos de chocolate y las nueces.", "Forme la masa en forma de salchicha larga en un tablero, y córtela en rondas de aproximadamente 1 cm / ½ pulgadas de ancho. Debido al chocolate y las nueces en la mezcla, puede ser bastante desmenuzable.", "Engrase y enharille una bandeja para hornear antiadherente. Coloque cada ronda en la bandeja y presione suavemente hacia abajo con la parte posterior de un tenedor.", "Hornee en la parte superior del horno durante 15 minutos o hasta que estén dorados. Deje que se enfríe durante al menos diez minutos antes de colocarlo en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_chocolateandmacadami_83825", "title": "Galletas veganas de chocolate y nuez de macadamia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas, golpeados", "Harina normal de 55g / 2oz", "15 g / ½ oz de azúcar en polvo", "30g / 1 oz de cacao en polvo, más extra para quitar el polvo", "¼ de chile rojo, sin semillas, picadas", "mantequilla, para engrasar", "¼ de mango, pelado, rebanado", "100 g / 3½ oz de azúcar en polvo", "1 cucharada de semillas de sésamo", "½ mango, en rodajas", "½ chile rojo, sin semillas, picadas", "azúcar glas, al polvo", "crema doble, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la torta de mousse, coloque los huevos, la harina, el azúcar, el cacao en polvo y el chile en un procesador de alimentos y mezcle para combinar.", "Engrase ligeramente un anillo de chefs de 6 cm / 2½ pulgadas y colóquelo en una bandeja para hornear antiadherente. Coloque el mango en rodajas en la base del anillo, cubra con la mezcla de mousse de chocolate y alise la parte superior con la parte posterior de una cuchara.", "Transfiera al horno y hornee por 12-15 minutos.", "Retire la torta del horno y coloque el anillo en un plato de servir. Caliente la parte exterior del anillo con un mini soplete para aflojarlo, luego quítelo y espolvoree la torta con cacao en polvo.", "Para el sésamo quebradizo, derrita suavemente el azúcar en una sartén hasta que esté dorado y completamente derretido.", "Vierta el caramelo caliente en una bandeja para hornear antiadherente, espolvoree sobre las semillas de sésamo y deje enfriar durante unos minutos. Cortar un pequeño disco de sésamo quebradizo con un cortador de hojaldre de metal.", "Para el mango de chile caramelizado, coloque el mango en rodajas en una bandeja para hornear, espolvorear con el chile picado y el polvo con abundante azúcar glas. Usando un mini soplete, caramelice el mango por todas partes.", "Para servir, coloque el mango de chile caramelizado en un plato con el pastel de mousse de chocolate y mango. Sirva con el sésamo quebradizo y vierta un poco de crema doble."], "url": "www_bbc_co_uk_food_recipes_chocolateandmangomou_85176", "title": "Pastel de mousse de chocolate y mango con mango de ají quebradizo y caramelizado de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de castañas dulces", "Ron oscuro de 75 ml / 2½ fl oz", "50 g / 2 oz de azúcar en polvo", "Pastel de chocolate precocido de 400 g / 14oz", "375g / 13oz de chocolate negro, derretido", "200g / 8oz de puré de castañas endulzado", "Crema doble 560ml / 20½fl oz", "5 cucharadas de azúcar glas"], "method": ["Corta aproximadamente dos tercios de los graces marrón.", "Coloque el ron y el azúcar impalpable en una cacerola a fuego medio. Deje que hierva a fuego lento, luego cocine hasta que el azúcar se derrita. Retire del fuego y agregue los marrons glacés picados. Revuelva bien y permita que el jarabe de ron se enfríe.", "Tome una rebanada de 2.5 cm / 1 in de espesor de la torta de chocolate y colóquela en el fondo de una caja de tarta redonda de 25 cm / 10 in. Repita para cubrir la base de la lata.", "Vierta los marrons glacés empapados y el ron uniformemente sobre el pastel de chocolate.", "Vierta el chocolate derretido en un tazón. Agregue el puré de castañas endulzado y bata para combinar.", "Vierta la crema en la mezcla de castañas y chocolate y bata para combinar.", "Vierta la mezcla de chocolate y crema sobre los cáscaras glaseados y la torta y alise. Transfiera a la nevera para enfriar durante al menos dos horas, preferiblemente durante la noche.", "Para servir, retire la tarta de la lata. Espolvorea con azúcar glas y decora con el resto de marrons glacés."], "url": "www_bbc_co_uk_food_recipes_chocolateandmarronsg_84994", "title": "Tarta de castañas con chocolate y helado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "2 cucharadas de harina normal", "1 cucharada de cacao en polvo", "100ml / 3½ fl oz de leche", "2 huevos de gallinas camperas, separados", "Azúcar en polvo de 55 g / 2 oz", "½ naranja, solo ralladura"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque una bandeja para hornear en el horno para calentar.", "Derretir la mantequilla en una olla pequeña. Cepille dos moldes con otra capa de mantequilla derretida. Coloque en el refrigerador y déjelo listo. Repita con un poco más de mantequilla derretida y coloque en la nevera hasta que los necesite.", "Agregue la harina y el polvo de cacao a la mantequilla derretida restante en la sartén y revuelva hasta que la mezcla se haya unido en una pasta espesa.", "Poco a poco batir la leche y calentar suavemente durante 2-3 minutos, o hasta que espese. Retire del fuego y bata las yemas de huevo de a una por vez. Dejar enfriar un poco.", "Coloque las claras de huevo en un recipiente aparte y bata hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco mezcle la ralladura de azúcar y naranja hasta que esté todo incorporado y la mezcla esté brillante y tieso.", "Agregue un tercio de la mezcla de clara de huevo a la mezcla de chocolate y dóblela. Luego agregue el resto de las claras de huevo y dóblelas cuidadosamente.", "Coloque la mezcla en los moldes preparados y colóquela en la bandeja para hornear caliente en el horno durante diez minutos, o hasta que esté bien hecha. Retirar del horno y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chocolateandorangeso_88280", "title": "Soufflé de chocolate y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de harina de gramo y 100g / 3½oz de harina de arroz o de papa, O 200g / 7oz de harina sin gluten y sin trigo", "1 nivel de goma xantana tsp (disponible en tiendas naturistas y en algunos supermercados)", "Margarina sin lácteos de 110 g / 4 oz O mantequilla (vaca o cabra) si puedes comerlo", "30ml / 1fl oz de agua fría", "350ml / 12fl oz de leche de vaca, soja o arroz (la leche de arroz será más fina y dulce)", "15g / ½ oz de harina de maíz", "80g / 3oz% 20dark% 20 sin látex% 20chocolate% 20 (70 %% 20cocoa% 20solids% 20minimum)", "2 cucharadas de Cointreau, Grand Marnier o brandy", "3 peras maduras"], "method": ["Tamiza la harina o las harinas con la goma de xantano en el recipiente de un procesador de alimentos.", "Corte la margarina o la mantequilla en la harina y mezcle hasta que se asemeje a pan rallado.", "Agregue el agua y mezcle de nuevo; si parece seco, agregue un poco más de agua. Mezcle hasta que la masa forme una bola.", "Retire del procesador, envuelva y enfríe durante 30 minutos.", "Precaliente el horno a 180C / 350F / Gas 4.", "Retire la masa de la nevera. Estirar sobre una tabla bien enharinada y forrar una lata de flan suelta de 20-25 cm / 8-9 pulgadas. La masa será bastante suave, por lo que es posible que tenga que parchar cualquier trozo que se rompa. Cubra la masa con papel y papel grasoso con alubias para hornear.", "Hornee durante 15 minutos, luego quite los frijoles y el papel y hornee por otros 10 minutos para que queden crujientes. Guay.", "Mientras tanto, mezcle gradualmente la leche que esté usando en la harina de maíz y caliente lentamente, revolviendo continuamente hasta que se espese. Cocine por un minuto o dos y luego retírelo del fuego.", "Divide 60g / 2½ oz del chocolate y agrégalo a la mezcla de harina de maíz, revolviendo hasta que todo se derrita.", "Agregue el licor o brandy.", "Triture las peras, cúbralas y pélelas y colóquelas, con el lado puntiagudo hacia el centro, en el plato de flan.", "Con una cuchara, coloca la salsa de chocolate sobre las peras y deja que se enfríe por completo.", "Rallar sobre el chocolate restante antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolateandpeartort_77306", "title": "Pastel de chocolate y pera sin gluten", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 ml / 1 pinta de crema doble", "½ vaina de vainilla, dividida longitudinalmente", "80g / 3oz de chocolate puro, finamente picado", "6 yemas de huevo grandes de gallinas camperas", "2 cucharadas de azúcar en polvo, más extra para rociar", "Frambuesas 100g / 3½ oz"], "method": ["Vierta la crema en una cacerola antiadherente y raspe las semillas pequeñas de la vaina de vainilla en la crema con un cuchillo pequeño.", "Agregue la vaina y coloque la crema a fuego medio hasta que casi hirviendo.", "Agregue el chocolate y bata hasta que quede suave.", "Mientras tanto, bate las yemas de huevo con el azúcar hasta que se combinen, pero no exageres ya que no quieres que se vuelva liviano y espumoso.", "Vierta la crema de chocolate en los huevos, revuelva con una cuchara de madera para combinar y vuelva a la cacerola.", "Cocine a fuego lento hasta que la crema se espese, revolviendo constantemente, pero no deje hervir.", "Prueba para ver si la crema está lista pasando el dedo por la crema en el reverso de una cuchara. Si la crema permanece separada, está lista.", "Divida las frambuesas entre cuatro moldes grandes.", "Colar la crema de chocolate sobre las frambuesas y dejar enfriar.", "Refrigere durante al menos seis horas, preferiblemente durante la noche.", "Unos minutos antes de servir espolvoree cada natilla con una fina capa de azúcar en polvo. Con un mini soplete, caramelice el azúcar de manera uniforme. Una vez caramelizado no refrigere. (Si no tiene un soplete, precaliente la parrilla a fuego alto y revuelva la crema brulées durante unos segundos hasta que el azúcar se caramelice)."], "url": "www_bbc_co_uk_food_recipes_chocolateandraspberr_82723", "title": "Crème brûlée de chocolate y frambuesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateandraspberr_82723_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "azúcar en polvo, para rociar", "3 claras de huevo de gallinas camperas", "50g / 2oz de azúcar glasé", "50 g / 2 oz de chocolate negro, rallado", "1 naranja, solo ralladura", "azúcar glas, al polvo", "2 ramitas de menta fresca", "2 cucharadas de yogur al estilo griego"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja para hornear en el horno.", "Engrase dos moldes con mantequilla y espolvoree con azúcar impalpable.", "En un tazón grande, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco agregue el azúcar glas, batiendo entre cada adición, hasta que la mezcla esté espesa y brillante.", "Doble suavemente el chocolate rallado y la ralladura de naranja en la mezcla, luego mezcle la mezcla en los moldes.", "Coloque los moldes en la bandeja para hornear caliente. Transfiera al horno y hornee por diez minutos, o hasta que los soufflés se levanten y se doren.", "Para servir, coloca los soufflés en platos para servir, espolvorea con azúcar glas y decora con una ramita de menta. Sirva con una cucharada de yogur."], "url": "www_bbc_co_uk_food_recipes_chocolateandorangeso_85913", "title": "Soufflés de chocolate y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 huevos de gallinas camperas", "150 g / 5 oz de azúcar en polvo", "Harina común 110g / 4oz", "40 g / 1½ oz de cacao en polvo", "25g / 1oz de mantequilla, derretida, más extra para engrasar", "whisky, para lloviznar", "azúcar en polvo, para quitar el polvo", "175g / 6oz de corte grueso, mermelada de naranja de Sevilla", "300ml / 10½ fl oz crema doble"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente y alinee la base de dos moldes para pasteles de 20 cm / 8 in.", "Para la esponja, mezcle los huevos y el azúcar juntos en un tazón de 4 a 5 minutos o hasta que estén espesos y pálidos.", "En un recipiente aparte, tamice la harina y el cacao en polvo, luego dóblelos suavemente en la mezcla de huevo y azúcar hasta que se combinen. Agregue la mantequilla derretida.", "Divida la mezcla de manera uniforme entre las 2 latas de torta preparadas. Coloque las latas en una bandeja para hornear y hornéelas en el horno durante 18-20 minutos, o hasta que los pasteles se levanten y sean elásticos al tacto. Retire del horno y permita que se enfríe brevemente antes de encenderlo en una rejilla para que se enfríe completamente.", "Para la crema de mermelada, coloque la mermelada en un procesador de alimentos y mezcle con un puré.", "Batir la crema en un bol hasta que se formen picos suaves cuando se quite la batidora. Doble suavemente el puré de mermelada para crear un efecto de marmoleado en toda la crema.", "Para servir, coloque los bizcochos en una bandeja y rocíe el whisky en forma pareja entre los 2 pasteles. Coloque una esponja en un plato de servir y unte la crema de mermelada. Cubra con el segundo bizcocho. Ligeramente espolvorear con azúcar glas y luego cortar en trozos para servir."], "url": "www_bbc_co_uk_food_recipes_chocolateandwhiskyge_93664", "title": "Esponja Génoise de chocolate y whisky con crema de mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de cacao en polvo o chocolate en polvo para beber", "Harina normal de 180 g / 6½ oz", "2 cucharaditas de polvo de hornear", "250 g / 8½ oz de azúcar en polvo", "250g / 8½oz de remolacha cocida", "3 huevos grandes", "200ml / 7fl oz de aceite de maíz", "1 cucharadita de extracto de vainilla", "azúcar glas para espolvorear"], "method": ["Precaliente el horno a 180 ° C / 355 ° F / Gas 4. Organice las cajas de muffins de papel en una lata para muffins de 12 moldes.", "Tamizar el cacao en polvo, la harina y el polvo de hornear en un bol. Mezcle el azúcar y reserve.", "Puré la remolacha en un procesador de alimentos. Agregue los huevos, uno a la vez, luego agregue la vainilla y el aceite y mezcle hasta que quede suave.", "Haga un pozo en el centro de los ingredientes secos, agregue la mezcla de remolacha y mezcle ligeramente. Vierta en los estuches de muffins.", "Hornee por 30 minutos o hasta que la parte superior esté firme al presionar con un dedo.", "Enfriar sobre una rejilla de alambre y espolvorear con azúcar glas para servir."], "url": "www_bbc_co_uk_food_recipes_chocolatebeetrootcak_71739", "title": "Pasteles de remolacha de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatebeetrootcak_71739_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["9 rebanadas, cada una de 5 mm / ¼ de grosor, pan blanco de buena calidad, un día de edad, tomado de un", "pan grande", "150g / 5oz de chocolate negro (75 por ciento de sólidos de cacao)", "75g / 3oz de mantequilla", "425ml / 15fl oz de crema batida", "4 cucharadas de ron oscuro", "Azúcar en polvo de 110 g / 4 oz", "buena canela pizca", "3 huevos", "crema doble, bien fría", "También necesitarás un plato para horno poco profundo de 18x23 cm / 7x9 pulgadas de base por 5 cm / 2 pulgadas de profundidad, ligeramente untado con mantequilla."], "method": ["Comience quitando las cortezas de las rebanadas de pan, lo que debería dejarle nueve piezas sobrecm / 4 pulgadas cuadradas. Entonces, corte cada rebanada en cuatro triángulos. A continuación, coloque el chocolate, la crema batida, el ron, el azúcar, la mantequilla y la canela en un recipiente sobre una cacerola de agua apenas hervida, teniendo cuidado de que el recipiente no toque el agua, luego espere hasta que la mantequilla y el chocolate se hayan derretido y el el azúcar se ha disuelto por completo A continuación, retire el tazón del fuego y revuelva muy bien para amalgamar todos los ingredientes.", "Ahora en un recipiente aparte, bate los huevos y luego vierte la mezcla de chocolate sobre ellos y bate nuevamente para mezclarlos.", "Luego, coloque una cuchara sobre acm / ½ en la capa de la mezcla de chocolate en la base del plato y coloque la mitad de los triángulos de pan sobre el chocolate en filas superpuestas. Ahora, vierta la mitad de la mezcla de chocolate restante en todo el pan lo más uniformemente posible, luego coloque el resto de los triángulos sobre eso, terminando con una capa de chocolate. Use un tenedor para presionar el pan suavemente hacia abajo para que quede cubierto de manera muy uniforme con el líquido a medida que se enfría.", "Cubra el plato con film transparente y déjelo reposar a temperatura ambiente durante horas antes de transferirlo al refrigerador por un mínimo de 24 (pero preferiblemente 48) horas antes de cocinarlo.", "Cuando esté listo para cocinar el pudín, precaliente el horno a C / 350F / Gas 4. Retire la película adhesiva y hornee en el horno en un estante alto durante 30-35 minutos, momento en el cual la parte superior estará crujiente y el interior suave y squidgy Déjelo reposar por 10 minutos antes de servir con la crema doble bien fría."], "url": "www_bbc_co_uk_food_recipes_chocolatebreadandbut_67343", "title": "Pan de chocolate y pudín de mantequilla", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]