[{"isVegetarian": false, "title": "Crisp fried monkfish with chilli tomato salsa and okra", "url": "www_bbc_co_uk_food_recipes_crispfriedmonkfishwi_88087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint hot vegetable oil, for deep frying", "150g/5½oz monkfish tail, membrane removed, cut into strips", "100g/3½oz self-raising flour, plus extra for dusting", "pinch sea salt", "200ml/7fl oz chilled sparkling water", "2 tbsp sesame seeds", "100g/3½oz fresh baby plum tomatoes, chopped", "¼ onion, finely chopped", "1 lime, juice only", "½ fresh red chilli, chopped", "2 tbsp chopped fresh coriander", "2 tbsp olive oil", "1 tbsp vegetable oil", "55g/2oz okra, sliced", "2 tsp sesame oil", "salt and freshly ground black pepper ", "handful fresh chives, chopped, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crisp fried monkfish, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "In a bowl, whisk together the self-raising flour and salt with enough chilled water to make a thick batter. Stir in the sesame seeds. ", "Dust the monkfish strips with a little flour and shake off the excess, then dip into the batter. Carefully place the monkfish into the hot oil and deep fry for 3-4 minutes, or until crisp and golden. Remove with a slotted spoon and drain on kitchen paper.", "For the salsa, mix together all the salsa ingredients in a small bowl.", "For the okra, heat the vegetable oil in a frying pan, add the okra and fry for 1-2 minutes. Add the sesame oil and salt and freshly ground black pepper, to taste, and fry for one minute.", "To serve, pile the tomato salsa onto a serving plate. Top with the crisp fried monkfish and place the okra on the side. Garnish with chives and serve."]}, {"isVegetarian": true, "title": "Crisp goats' cheese, herb and tomato salad", "url": "www_bbc_co_uk_food_recipes_crispgoatscheeseherb_90709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz goats' cheese, sliced into four rounds", "½ onion, finely sliced", "1 tomato, chopped", "1 small handful fresh coriander, chopped", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. When hot, place the cheese slices onto a baking tray and grill for 1-2 minutes on each side, or until golden-brown and crisp on both sides.", "Mix the onion, tomato and coriander together in a bowl, drizzle over the olive oil and season with salt and freshly ground black pepper. Mix well to coat in the oil. ", "To serve, place the salad in the middle of a serving plate and arrange the crisp goats' cheese rounds on top."]}, {"isVegetarian": true, "title": "Crisp noodle salad with herbs, chilli and sesame seeds", "url": "www_bbc_co_uk_food_recipes_crispnoodlesaladwith_85288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz vegetable oil, for deep frying", "125g/4½oz tagliatelle", "large handful mixed fresh herbs, including parsley, basil, coriander, chervil, chopped", "2 tbsp balsamic vinegar", "pinch salt", "1 chilli, seeds removed, chopped", "2 tbsp sesame seeds, toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the tagliatelle into a large pan of boiling salted water and cook until just al dente. Drain well and leave to cool for five minutes.", "Carefully place the pasta into the hot oil in batches and deep fry for 3-4 minutes, or until crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. Repeat until all the pasta has been fried.", "Place the deep-fried pasta into a bowl. Add the herbs, balsamic vinegar, salt, chilli and sesame seeds to the bowl and mix well.", "To serve, place the salad into a large serving dish."]}, {"isVegetarian": false, "title": "Crisp lemon sole with chilli, sesame and soy", "url": "www_bbc_co_uk_food_recipes_crisplemonsolewithch_91060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemon sole", "vegetable oil, for deep frying", "50-75g/2-3oz potato starch ", "1 tsp green chilli, chopped", "1 tsp red chilli, chopped", "1 tsp ginger, chopped", "½ tsp garlic, chopped ", "2 tsp roughly chopped fresh coriander ", "1 tsp black sesame seeds", "1 tsp Dijon mustard ", "1 tsp sesame oil", "50ml/2fl oz soy sauce ", "½ lemon, juice only", "5 tbsp vegetable oil", "2 lemons, zest only", "2 tsp yukari seasoning (available from specialist Japanese stores)", "2 green chillies, sliced into rings", "4 sprigs coriander, leaves only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish, scale, clean and fillet the sole (or you can get your fishmonger to do this for you). Clean the skeleton, then cut in half lengthways, keeping the backbone intact on one half. Discard the half of the skeleton without the back bone. Using a sharp knife, skin the sole fillets and cut each fillet into bite-sized pieces. Set aside. ", "Heat a deep fat fryer to 190C/375F. (CAUTION: hot oil can be dangerous - do not leave unattended.) ", "For the marinade and dipping sauce, place the green chilli, red chilli, ginger, garlic, coriander, sesame seeds, mustard, sesame oil, soy and lemon juice into a bowl and whisk to combine.", "Heat the vegetable oil on high heat until smoking. Pour the hot oil into the bowl and stir - the sauce should splatter a little when the oil is added, so take care.", "Pour half of the sauce into a shallow non-reactive dish and set the remainder aside. Place the sole pieces in with the sauce in the dish and leave to marinate for 15 minutes.", "Meanwhile, dust the sole skeleton with a little of the potato starch. ", "Press the sole skeleton between a ladle and a metal bowl or second ladle to bend it, and carefully place into the hot oil to cook for 2-3 minutes. As it cooks and hardens, it should form a rough bowl shape. Remove the sole from the hot oil using a large slotted spoon. Drain on kitchen paper.", "Lift the sole from the marinade and coat the pieces evenly in the remaining potato starch. Shake to remove any excess flour, then drop into the fat fryer and fry for 2-3 minutes, or until lightly golden-brown. Remove with a slotted spoon and drain on kitchen paper.", "To serve, arrange the fish pieces on the curved sole skeleton using it as a serving bowl. Sprinkle with fresh lemon zest, yukari seasoning, fresh green chilli slices and coriander leaves. Serve with the little bowl of the dipping sauce."]}, {"isVegetarian": true, "title": "Crisp onion and rocket salad", "url": "www_bbc_co_uk_food_recipes_crisponionandrockets_87238", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz rocket", "1 tbsp olive oil", "½ lemon, juice only", "½ red onion, finely sliced", "1 tsp brown sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rocket leaves into a bowl with half a tablespoon of olive oil and the lemon juice and mix well.", "Heat the remaining olive oil in a small frying pan and fry the onion with the sugar until crisp and caramelised.", "To serve, place the dressed rocket onto a serving plate and top with the onion."]}, {"isVegetarian": true, "title": "Crisp oyster mushroom salad", "url": "www_bbc_co_uk_food_recipes_crispoystermushrooms_92752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour ", "50g-150g/2oz-5½oz Chinese five spice powder, for dredging  ", "salt and freshly ground black pepper ", "400g/14oz fresh oyster mushrooms, cleaned and rinsed thoroughly, patted dry, torn", "vegetable oil, for deep frying", "1 red chilli, seeds removed, finely chopped ", "1 star anise", "1 tsp ground ginger", "100ml/3½fl oz rice vinegar", "100g/3½oz caster sugar", "100ml/3½fl oz olive oil", "200g/7oz fresh plums, stones removed, finely chopped", "250g/9oz watercress leaves", "1 cucumber, cut in half lengthways, seeds scooped out with a spoon, chopped into batons approx 7.5cm/3in long ", "1 tbsp pickled pink ginger (available from some Asian supermarkets), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mushrooms, mix together the flour and Chinese five spice powder in a bowl until well combined. Season with a pinch of salt, or to taste.", "Dredge the oyster mushrooms in the spice mixture until completely coated.", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the coated mushrooms into the oil and fry for 4-5 minutes, or until crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm.", "For the dressing, heat the chilli, star anise, ginger, rice vinegar and sugar in a pan until simmering. Continue to cook for a further 4-5 minutes, or until the mixture resembles syrup. ", "Remove the pan from the heat and set aside until cooled, then whisk in the oil until well incorporated into the mixture. Stir in the chopped plums until coated in the mixture. ", "Stir the watercress and cucumber into the dressing mixture until coated in the dressing. ", "To serve, divide the dressed salad equally among four serving plates. Sprinkle over the pickled ginger. Spoon over the crisp mushrooms. Drizzle over any remaining dressing."]}, {"isVegetarian": false, "title": "Crisp paprika chicken on chorizo rice", "url": "www_bbc_co_uk_food_recipes_crisppaprikachickeno_88445", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisppaprikachickeno_88445_16x9.jpg", "ingredients": ["100g/3½oz basmati rice", "200ml/7fl oz chicken stock", "2 tbsp olive oil", "¼ onion, chopped", "1 garlic clove, finely chopped", "½ small chorizo sausage, finely chopped", "1 chicken thigh, bone removed", "salt and freshly ground black pepper", "smoked paprika, to dust", "1 orange, juice and zest only", "1 sprig fresh thyme, chopped", "fresh basil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a large pan, simmer the rice in the chicken stock until just cooked. Drain of any excess liquid.", "Heat one tablespoon of oil in a pan and fry the onion and garlic until softened. Add the chopped chorizo and fry gently for a further 3-4 minutes.", "Add the cooked rice to the pan and stir to coat in the juices.", "Meanwhile, heat the remaining oil in an ovenproof frying pan, season the chicken thigh well with salt and freshly ground black pepper and dust with smoked paprika. Open the chicken thigh out so that it's flat, then fry until golden-brown on all sides. Transfer to the oven and roast for 7-10 minutes, or until completely cooked through.", "Remove from the oven, set the chicken aside and place the pan back on the heat. Add the orange juice and zest and the chopped fresh thyme and simmer for 3-4 minutes, or until sticky. Return the cooked chicken to the pan to coat in the sauce. Slice into three or four pieces diagonally.", "To serve, pile the rice in the centre of a serving plate and arrange the chicken on top. Garnish with fresh basil."]}, {"isVegetarian": false, "title": "Crisp pancetta and herb salad", "url": "www_bbc_co_uk_food_recipes_crisppancettaandherb_85535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil ", "2 rashers pancetta, chopped", "large handful fresh herbs, such as parsley, basil, mint, coriander", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the olive oil in a frying pan and fry the pancetta pieces until crisp and golden-brown. Remove from the pan and drain on kitchen paper.", "Place the herbs into a bowl and drizzle over the vinegar and the remaining olive oil. Season with salt and freshly ground black pepper and stir to coat the herbs.", "To serve, sprinkle the crisp pancetta over the salad."]}, {"isVegetarian": true, "title": "Crisp poppadoms with tomato chutney and sautéed spinach", "url": "www_bbc_co_uk_food_recipes_crisppoppadumswithto_88155", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "3 raw poddadoms", "dash olive oil", "½ onion, peeled, finely chopped", "1 garlic clove, finely chopped", "1 fresh tomato, chopped", "1 tsp soft brown sugar", "pinch chilli flakes", "2 tsp red wine vinegar", "1 tbsp each chopped fresh basil, mint and coriander", "salt and freshly ground black pepper", "25g/1oz butter", "150g/5½oz baby spinach", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crisp poppadoms, pour the oil into a large saucepan or deep fat fryer and heat until a small cube of bread turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Carefully lower the poppadums into the hot oil and fry for 30 seconds or until crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the tomato chutney, heat the olive oil in a small saucepan, add the onion and fry gently for four minutes or until softened. Add the garlic and fry for one minute. Add the chopped tomato, brown sugar, chilli and red wine vinegar and simmer for 4-5 minutes. Stir in the herbs and season well with salt and freshly ground black pepper.", "For the sautéed spinach, melt the butter in a large saucepan, add the spinach and wilt in the hot butter. Season well with salt and freshly ground black pepper. Drain off any excess water.", "To serve, place one poppadum onto a serving plate, top with half the tomato chutney and sautéed spinach and then layer up with the rest of the crisp poppadoms, chutney and spinach to make a tower. Serve immediately."]}, {"isVegetarian": false, "title": "Crisp roasted salmon with sweet and sour peppers", "url": "www_bbc_co_uk_food_recipes_crisproastedsalmonwi_89455", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil", "125g/4½oz salmon fillet, skin on", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 red pepper, seeds removed, chopped ", "1 yellow pepper, seeds removed, chopped", "2 tbsp red wine vinegar", "pinch caster sugar", "handful mixed salad leaves", "balsamic vinegar, for drizzling"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the roasted salmon, rub the olive oil into the salmon and season well with salt and freshly ground black pepper. ", "Heat an ovenproof frying pan over a high heat. Add the salmon, skin-side down first, and fry for 1-2 minutes, or until the skin is crisp. Turn the salmon over and fry for 30 seconds to one minute to sear the fish. Turn it over again so it is laying skin-side down and transfer the pan to the oven for 7-8 minutes to roast the salmon. ", "For the sweet and sour peppers, heat the oil in a separate non-reactive frying pan over a medium heat. Add the pepper pieces and fry for 2-3 minutes, or until they start to soften. ", "Add the red wine vinegar and sugar and continue to cook for 5-6 minutes, or until the peppers are soft and the vinegar has reduced.", "To serve, scatter the mixed leaves onto a serving plate, and place the crisp roasted salmon on top. Arrange the peppers around the edge of the plate. Drizzle the dish with balsamic vinegar."]}, {"isVegetarian": false, "title": "Crisp salmon with turmeric rice and warm tomato dressing", "url": "www_bbc_co_uk_food_recipes_crispsalmonwithturme_90019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp butter", "85g/3oz salmon fillet, skin on", "salt and freshly ground black pepper", "85g/3oz basmati rice", "½ tsp ground turmeric", "100ml/3½fl oz fish stock", "2 tbsp olive oil", "1 tsp tomato purée", "1 small handful pine nuts, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat the olive oil and butter in a pan and season the fish with salt and freshly ground black pepper. Lay the fish skin-side down into the pan and fry for 4-5 minutes, then flip over and cook for a further 3-4 minutes, or until golden-brown all over and cooked to your liking. Set aside on a warm plate. ", "For the turmeric rice, cook the rice according to packet instructions. During the last two minutes of cooking, stir in the turmeric. When cooked, fluff up the grains with a fork. ", "For the warm tomato dressing, heat the fish stock, olive oil and tomato purée together in a saucepan and whisk to combine. Bring to a gentle simmer and reduce for 4-5 minutes. ", "To serve, spoon the rice onto a plate and place the salmon on top. Drizzle the warm dressing around the edges of the plate and scatter the pine nuts over the top."]}, {"isVegetarian": false, "title": "Crisp sea bass tortillas with pink pickled onion", "url": "www_bbc_co_uk_food_recipes_crispseabasstortilla_91746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispseabasstortilla_91746_16x9.jpg", "ingredients": ["1 small red onion, peeled, finely sliced", "½ tsp dried oregano", "5 black peppercorns, left whole", "1½ limes, juice only", "½ orange, juice only", "½ tsp sea salt flakes", "500g/1lb 2oz line-caught sea bass fillets, scales and gills removed", "sea salt flakes", "pinch chipotle chilli powder", "2 ripe avocados, peeled, cut in half, stones removed", "1 lime, juice only, plus extra to serve", "2 tbsp good-quality ready-made mayonnaise", "small bunch fresh coriander, roots trimmed, stalks finely chopped, leaves left whole", "1 small green chilli, seeds removed, finely chopped", "sea salt flakes ", "1 tsp olive oil", "6 ready-made soft corn tortillas"], "serves": "Makes 6 tortillas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pink pickled onion, bring a small pan of water to the boil. Add the sliced onion and boil for 25-30 seconds, then drain well and transfer to a large mixing bowl. ", "Add the oregano, peppercorns, lime juice, orange juice and salt, then stir well to coat the onions in the juices. Cover and set aside for at least one hour, or until the onions have turned a vibrant pink colour. ", "Meanwhile, light the barbecue. When the flames have died down and the coals have turned ash-white, the barbecue will be ready (this should take about 30 minutes). ", "For the sea bass, rinse the sea bass fillets in cold water, then pat dry using kitchen paper. ", "Season the skin of the sea bass fillets with the salt and chipotle chilli powder. When the barbecue is ready, place the sea bass fillets, skin-side down,  onto the grill, and cook for 4-5 minutes, or until the skin is crisp and golden-brown and just over half of the flesh is cooked through. ", "Turn the sea bass fillets over carefully and cook for no more than 10 seconds, or until the outside of the fillets are just cooked. Transfer the sea bass fillets to a plate, skin-side up. Set aside and keep warm. Just before serving, flake the flesh of the sea bass using a fork.", "Meanwhile, for the guacamole, blend the avocado flesh in a food processor until smooth. Add the lime juice, mayonnaise, chopped coriander stalks, coriander leaves and chilli and blend again until smooth and well combined. Season, to taste, with salt and blend again until smooth. Spoon the mixture into a serving bowl and chill in the fridge until needed.", "For the tortillas, brush a frying pan with the oil and heat over a high heat until the oil is smoking. Heat each tortilla, one at a time, on both sides, for 15-20 seconds, or until soft and pliable and warmed through.", "To serve, place one tortilla into the centre of each of six small serving plates. Spoon a dollop of guacamole into the centre of each tortilla, then lay some of the flaked sea bass and skin over the guacamole. Top with the pink pickled onions and a squeeze of lime juice, then roll up the tortillas into a cigar shape or fold into a U-shape."]}, {"isVegetarian": false, "title": "Crispy-skinned chicken, herbed gnocchi and mushroom sauce", "url": "www_bbc_co_uk_food_recipes_crispy-skinned_chicken_21035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs (bone in and skin on)", "500ml/18fl oz vegetable stock", "5g dried cep powder", "1 tbsp chopped parsley", "900g/2lb Desirée potatoes, peeled", "salt and pepper", "1 tbsp chopped tarragon", "1 tbsp chopped flatleaf parsley", "75g/2½oz plain flour (this may be more or less depending on your potatoes)", "glug of olive oil", "20g/½oz unsalted butter", "1 tbsp olive oil", "1 shallot, chopped", "2 garlic cloves, chopped", "200g/7oz chestnut mushrooms, sliced", "15g/½oz dried morels, soaked and drained", "28g/1oz dried ceps, soaked and drained ", "150g/5½oz crème fraîche", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the crispy-skinned chicken, remove the bone from each chicken thigh and pierce the skin with a knife. Heat the stock in a deep frying pan. Add the thighs skin-side down and cover with a cartouche (a round of greaseproof paper with a hole in the middle to allow steam to escape). Poach the thighs for five minutes then remove the chicken from the pan, put on a plate and place another plate on top to weigh them down. Allow to cool in the refrigerator while you make the gnocchi and sauce. Reserve the vegetable stock to use in the mushroom sauce.", "To make the gnocchi, cook the potatoes in a pan of as little water as possible until tender. Drain and mash or rice the potatoes while they are still warm. ", "Turn out the mash onto a work surface, season with salt and pepper and add the herbs. Slowly add the flour in batches, kneading gently by folding the edges of the dough into the center and pressing down lightly before sprinkling in each further addition of flour, until the dough is soft. Don’t overwork the dough or you will spoil the structure and the gnocchi will be powdery on the outside and pulpy on the inside. ", "Roll the dough into a Frankfurter-sized sausage. Cut the sausage into 3cm/1¼in pieces.", "Press each piece of dough against the back of a fork so that it curves slightly and the prongs leave indentations (which will help the gnocchi hold the sauce). ", "Bring a large pan of salted water to the boil. Add the olive oil and drop in the gnocchi. Cook for a minute, or until the gnocchi rises to the surface. Remove from the pan, plunge into a bowl of ice-cold water and drain.", "For the mushroom sauce, heat the butter and olive together in a frying pan until melted. Quickly cook the shallot and garlic until just softened. Add all the mushrooms to the pan along with some of the reserved poaching liquid. Cook for five minutes, then remove from the heat and stir in the crème fraiche. Transfer to a food processor and blend until smooth. Check the seasoning and add salt and pepper as required. Set aside until ready to serve. ", "Just before serving, cut eight squares of greaseproof paper (large enough to cover the chicken thighs). Sprinkle each piece of paper with cep powder. Put each piece of chicken skin-side down on top of a square of greaseproof paper. Season with salt and pepper, then top with a second piece of greaseproof paper and fold the edges of the two squares of paper to make a parcel. Place each chicken parcel into a frying pan and with a weight on top. Place over a medium heat until the chicken skin crisps up and the meat is cooked through. Remove from the paper and roll the chicken in the chopped parsley.", "To serve, return the sauce to the pan to heat through and stir through the drained gnocchi. Cut the chicken into slices and serve with the gnocchi and sauce."]}, {"isVegetarian": true, "title": "Crispy aubergine and mozzarella with a classic tomato sauce", "url": "www_bbc_co_uk_food_recipes_crispy_aubergine_and_11471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp extra virgin olive oil", "400g can chopped tomatoes, preferably San Marzano", "2 garlic cloves, roughly chopped", "1 tsp dried oregano", "1 large handful fresh basil leaves, roughly chopped", "salt and freshly ground black pepper", "25g/1oz Parmesan cheese (or alternative vegetarian hard cheese), grated", "100g/3½oz breadcrumbs", "2 aubergines, topped and tailed and sliced long ways", "2 balls of mozzarella, sliced", "100g/3½oz plain flour", "2 eggs, beaten", "vegetable oil, for frying"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat a frying pan over a medium-high heat and add the olive oil, tomatoes, garlic and dried oregano. Simmer for 3-4 minutes, or until the tomatoes have just started to break down. Stir in the basil and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Mix the Parmesan with the breadcrumbs. Coat the aubergine and mozzarella in flour, dip in the beaten egg and roll in the breadcrumbs.", "Heat the vegetable oil in a large frying pan, once hot add the aubergine and mozzarella in batches and fry on each side for 2-3 minutes until crisp.", "Place the aubergine and mozzarella on to plates and spoon the sauce over."]}, {"isVegetarian": false, "title": "Crispy chicken and sun-dried tomato spring rolls", "url": "www_bbc_co_uk_food_recipes_crispy_chicken_and_40136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz glass noodles", "225g skinless chicken breast, cut into thin strips", "2 tsp olive oil", "1 tbsp finely chopped spring onions", "2 tbsp finely chopped fresh chives", "2 tsp finely chopped fresh coriander", "2 tbsp finely chopped sun-dried tomatoes", "3 tbsp plain flour", "3 tbsp water", "300ml/10fl oz groundnut oil", "1 pack 22cm/8in banh trang rice paper wrappers", "1 iceberg lettuce, leaves separated into cups", "2 tbsp fresh basil leaves, torn ", "2 tbsp coriander sprigs, leaves left whole", "salt and freshly ground pepper "], "serves": "Makes 35–40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the noodles in warm water for about 15 minutes, or until soft. Drain in a colander and cut them into thirds. Squeeze out any excess moisture in a clean tea towel.", "Meanwhile, mix the chicken with some salt and pepper, the olive oil, spring onions, chives, coriander and sun-dried tomatoes in a bowl. Add the noodles and mix well. ", "Make a paste by mixing the flour and water together. ", "When you are ready to make the rolls, fill a large bowl with warm water. Dip a rice paper wrapper in the water and let it soften for 1 minute. Remove and drain on a clean tea towel.", "Place a large spoonful of the filling in the middle of the wrapper and roll the bottom edge over the filling, fold up both sides of the rice paper, and continue to roll to the end. Seal the end with a little of the flour paste mixture. The roll should be compact and tight, about 7.5cm/3in. Place on a clean plate and continue the process until you have used up all the filling.", "Heat the oil in a wok or large frying-pan over a high heat to smoking point. Turn the heat down to medium and deep-fry the rolls a few at a time, until they are golden-brown. They have a tendency to stick to each other, so only fry a few at a time. Do not attempt to break them apart if they stick together, you can do this after they have been removed from the oil. Drain each batch on kitchen paper. ", "Serve with iceberg lettuce cups, fresh basil and coriander sprigs."]}, {"isVegetarian": false, "title": "Crispy chicken thighs with avocado, chargrilled asparagus, chorizo and aioli", "url": "www_bbc_co_uk_food_recipes_crispy_chicken_thighs_89521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz sea salt", "1 small dried red chilli", "2 garlic cloves, crushed ", "4 large chicken thighs, boneless, skin on ", "1 tbsp vegetable oil", "1 bulb garlic", "2 free-range egg yolks", "1 tsp Dijon mustard", "few saffron strands", "150ml/5fl oz rapeseed oil", "150ml/5fl oz extra virgin olive oil", "½ lemon, juice only", "salt and freshly ground black pepper", "2 avocados, peeled, halved, stone removed and cut into 2cm/1in slices ", "1 free-range egg, beaten", "50g/1¾oz plain flour", "50g/1¾oz panko breadcrumbs", "vegetable oil for deep-frying ", "flaked sea salt ", "8 spears asparagus, trimmed, ends peeled ", "4 cooking chorizo sausages, skin removed ", "100g/3½oz monk’s beard, stalks removed.", "1 head of dandelion salad, trimmed and washed", "splash sherry vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the salt, chilli and garlic in a large saucepan with 1 litre/1¾ pints of water and bring to the boil. Remove from the heat and cool then add the chicken thighs, cover and place in the fridge for 2 hours. ", "For the aioli, preheat the oven to 180C/160C Fan/Gas 4, wrap the bulb of garlic in foil and roast for 30 minutes. When roasted, squeeze the garlic out of its skins and add into a small food processor along with the egg yolks, mustard and saffron and blend. Then slowly add the oils to make an emulsion and season with the lemon juice and salt and pepper. ", "Remove the chicken from the brine and pat dry with kitchen paper. Heat the oil in a large non-stick frying pan and cook the chicken skin-side down over a medium heat. Cover with a circle of greaseproof paper and place an empty saucepan on top as a weight for 5 minutes. Turn the chicken and cook for a further 5 minutes without the paper or weight. Turn and cook for a further 5 minutes until the skin is golden-brown and crisp. (The chicken is cooked through when the juices run clear with no trace of pink when the thickest part of the thigh is pierced with a skewer.) Set aside. ", "Meanwhile, for the chargrilled asparagus and chorizo, roast the chorizo sausages in the preheated oven for 10 minutes, then set aside, reserving the oil. ", "Blanch the asparagus in salted boiling water for 1 minute, then refresh in cold water and drain. ", "Heat a griddle pan over a high heat and cook the asparagus and chorizo for 2–3 minutes, turning to make sure they char on all sides. ", "For the avocado, place the beaten egg, flour and breadcrumbs into three separate bowls and dip each slice first into the flour, then the egg, then the breadcrumbs. Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Deep-fry the avocado for 1–2 minutes, until crisp and golden-brown. Drain on kitchen paper and season with flaked sea salt. ", "For the salad, blanch the monk’s beard and dandelion in salted boiling water for 30 seconds then drain and place in a bowl. Add a splash of sherry vinegar and some of the reserved chorizo oil and mix to combine. ", "To serve, divide the monk’s beard and dandelion between four serving plates and top with the chicken, avocado, asparagus and chorizo, with the aioli on the side. "]}, {"isVegetarian": false, "title": "Crispy chicken with sweet potato fries and barbecue beans", "url": "www_bbc_co_uk_food_recipes_crispy_chicken_with_12063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_chicken_with_12063_16x9.jpg", "ingredients": ["4 x 150g/5½oz chicken thighs on the bone", "200ml/7fl oz sweet chilli sauce", "150g/5½oz plain flour", "1 tsp baking powder", "1 tsp cayenne pepper", "1 tsp onion powder", "1 tsp garlic powder", "1 tsp salt", "150ml/5fl oz vegetable oil, for frying", "2 tsp garlic powder", "1½ tsp paprika", "large pinch salt", "2 large sweet potatoes (approx. 800g/1lb 12oz), cut into wedges", "2 tbsp olive oil", "2 x 400g tins baked beans", "1 tsp smoked paprika", "2 tbsp brown sauce"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and line a baking tray with baking paper. ", "To make the chicken, bring a large saucepan of salted water to the boil, add the chicken, cover with a lid and boil for 15 minutes. Remove the chicken pieces from the water and place on kitchen paper to drain. ", "Put the chicken in a bowl with the sweet chilli sauce. Mix well and set aside.", "Put the flour, baking powder, cayenne, onion powder, garlic powder and salt on a plate and mix. Dip each piece of chicken into the dry spice mix, coat well and set aside on another plate.", "Heat the oil in a non-stick frying pan over a medium heat. Add the chicken and fry for 3 minutes on each side, until golden-brown. Place on the lined baking tray and set aside. ", "To make the sweet potato wedges, combine the garlic powder, paprika and salt in a small bowl. Put the sweet potato wedges on a large baking tray, then cover them with the garlic mix, drizzle with the oil and mix well to coat.", "Bake the chicken and sweet potatoes, with the sweet potatoes on the higher shelf, for 25–30 minutes, or until the chicken is cooked through and the wedges are tender. ", "Meanwhile, mix the beans, smoked paprika and brown sauce together in a small saucepan and warm through over a low heat. Serve everything together."]}, {"isVegetarian": false, "title": "Crispy chilli beef", "url": "www_bbc_co_uk_food_recipes_crispy_chilli_beef_88136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz beef rump", "vegetable oil, for deep-frying", "3-4 tbsp cornflour, for coating", "pinch chilli flakes ", "large pinch toasted sesame seeds", "viola flowers, available online (optional), to garnish", "2 tsp light soy sauce", "1 tsp Shaoxing rice wine", "7g potato starch", "1g baking powder", "50g/1¾oz carrot, cut into very fine strips", "180ml/6fl oz Chinese red vinegar", "4 tbsp light soy sauce", "1 tbsp chilli oil", "1 tsp sugar", "1 tsp sesame oil", "1 tsp chilli flakes", "8g pickled red chilli, chopped", "1 tsp Chinese five-spice powder", "½ tsp salt", "250g/9oz sugar", "5 tbsp Chinese red wine vinegar", "5 tbsp malt vinegar", "1 star anise", "250g/9oz plain flour", "50g/1¾oz tapioca flour", "½ tsp baking powder", "½ tsp xanthan gum", "sparkling mineral water, chilled"], "serves": "Serves 2-4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the beef in the freezer for around 1½ hours until it is about 70% frozen.", "For the marinade, mix all the ingredients together in a large bowl with 50ml/2fl oz water.", "Using a sharp knife, cut the partially frozen beef into 7cmx5mm/2¾x⅛in batons. Add the beef batons to the marinade, cover and leave to marinate in the fridge for 2 hours.", "For the pickled carrot, place the carrot in a sterilized airtight container. Heat up all the remaining ingredients in a non-reactive pan and bring to a gentle simmer. Pour over the carrot strips and leave to cool. Seal the container. (It will keep for several months if stored in a cool, dry place.)", "For the Chinese five-spice salt, mix the powder and salt and combine thoroughly. ", "For the sauce, combine all the ingredients and 400ml/14fl oz water in a pan and cook until the mixture has reduced to the consistency of honey.", "For the batter, combine the dry ingredients in a bowl, then whisk in enough sparkling water until you have a light batter", "When the beef is ready, heat the vegetable oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.).", "Remove the beef from the marinade, coat the beef in cornflour and plunge the batons individually into the batter before deep-frying until crispy (the fried batter coating should have miniature holes throughout instead of being a solid shell). Remove from the oil and drain on kitchen paper.", "Add the beef to the sauce, season with a pinch of chilli flakes, Chinese five-spice salt and sesame seeds. Top with some pickled carrots, garnish with viola flowers, if using, and serve immediately."]}, {"isVegetarian": true, "title": "Crisp, chocolate and salted peanut tart", "url": "www_bbc_co_uk_food_recipes_crispy_chocolate_and_87547", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_chocolate_and_87547_16x9.jpg", "ingredients": ["250g/9oz good quality salted crisps ", "100g/3½oz  butter", "4 tbsp golden syrup", "225g/8oz butter, cut into cubes", "375g/13oz dark chocolate (70% cocoa solids), chopped", "3 free-range eggs, plus 3 yolks", "150g/5½oz caster sugar", "125g/4½oz roasted and salted peanuts, roughly chopped"], "serves": "Serves 10–12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease a 23cm/9in, loose-bottomed, fairly deep tart tin.", "For the base, crush the crisps to crumbs in a sealed plastic bag with a rolling pin or use a food processor. Melt the butter with the golden syrup in a pan. Stir in the crisp crumbs to bring together.", "Press the crisp mixture evenly into the base and sides of the tart tin. Line the tin with non-stick baking parchment and fill with baking beans. Put onto an oven tray and bake for 10 minutes. Remove the baking beans and parchment and set aside to cool.", "Meanwhile, for the topping, melt the butter and chocolate in a heat-proof bowl over a pan of gently simmering water (make sure the bottom of the bowl does not touch the water), stirring now and again until completely melted and glossy. Remove from the heat and leave to cool a little.", "Whisk together the eggs, yolks and sugar in a large bowl using an electric whisk for 3-4 minutes, until pale and thickened.  Whisk the melted chocolate into the egg mixture, until completely incorporated. Stir in a little more than half the peanuts. ", "Pour the chocolate mixture into the crisp base and sprinkle the remaining peanuts over the top. Bake for 20–25 minutes, or until almost set, but still with a very slight wobble. If the tart is still very wobbly, bake for a further 5 minutes. Leave to cool completely in the tin on a rack, then chill in the fridge for at least 4 hours.", "Carefully remove from the tin, slice and serve. Delicious with some vanilla ice cream on the side."]}, {"isVegetarian": false, "title": "Crispy chilli beef with noodles and steamed broccoli", "url": "www_bbc_co_uk_food_recipes_crispy_chilli_beef_with_40462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for deep frying", "400g/14oz rib-eye steak, cut into thin strips", "2 tbsp vegetable oil", "1 tbsp Sichuan peppercorns", "2 limes, zest only", "1 orange, zest only", "3 heaped tbsp cornflour, rice flour or potato starch", "150g/5½oz caster sugar", "150ml/5fl oz Shaoxing rice wine", "25ml/¾fl oz rice wine vinegar", "1½ red chillies, finely chopped", "2 tsp dried chilli flakes", "10cm/4in piece fresh root ginger, finely chopped", "2 lemongrass stems, outer leaves removed, then finely chopped", "4 lime leaves, finely chopped", "1 tbsp vegetable oil", "10cm/4in piece fresh ginger, julienned", "4 garlic cloves, finely chopped", "6 spring onions, trimmed, finely sliced", "250g/9oz fine rice noodles, cooked according to packet instructions, drained and refreshed in cold water and drained again", "3 tbsp sesame oil", "2 tbsp soy sauce", "2 tbsp rice wine vinegar", "½ lemon, juice only", "2 tbsp sesame seeds", "4 tbsp chopped fresh coriander", "steamed broccoli"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, heat a deep-fat fryer to 190C, or heat the oil for deep-frying in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Toss the beef strips in the vegetable oil. In a pestle and mortar, crush the Sichuan peppercorns to a fine powder. Place them in large bowl with the lime and orange zest and cornflour then toss well to combine. Add the beef and toss to coat each piece thoroughly.", "In batches, drop the beef into the deep-fat fryer and cook for 2 minutes. Drain on a plate lined with kitchen paper.", "For the sauce, heat a frying pan or wok until hot, add the sugar, rice wine and rice wine vinegar and bring to the boil. Add the chillies, chilli flakes, ginger, lemongrass and lime leaves then cook for 5-8 minutes until thickened, sticky and glossy looking.", "Add the fried beef to the sauce, remove from the heat and toss well so that all the beef is coated in the sticky sauce.", "For the noodles, heat the vegetable oil in a wok over a high heat. When the oil is smoking, add the ginger, garlic and spring onions and stir fry for 2-3 minutes, or until softened. Add the cooked noodles and stir fry for a further minute, or until warmed through. Add the sesame oil, soy sauce, rice wine vinegar and lemon juice and mix well to combine. Add the sesame seeds and stir fry for a further 1-2 minutes. Sprinkle over the coriander and stir well to combine.", "To serve, divide the noodles between serving bowls and top with the chilli beef. Place the broccoli in a separate serving bowl."]}, {"isVegetarian": false, "title": "Deep-fried coconut prawns", "url": "www_bbc_co_uk_food_recipes_crispy_coconut_prawns_83642", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_coconut_prawns_83642_16x9.jpg", "ingredients": ["24 raw king prawns, peeled, tails on (about 600g/1lb 5oz frozen raw shell-on prawns)", "175g/6oz plain flour", "1½ tsp baking powder", "1 medium egg, beaten", "150ml/5fl oz ice-cold water", "60g/2¼oz panko breadcrumbs", "60g/2¼oz unsweetened desiccated coconut", "600ml/200fl oz corn oil, for deep frying", "salt and freshly ground black pepper", "1 large papaya, skin and seeds removed, roughly chopped", "½–1 habanero chilli, stem and seeds removed, roughly chopped", "1 banana shallot, roughly chopped", "1 garlic clove, halved", "3 tbsp cider vinegar", "2 thin slices fresh root ginger, skin removed", "1 lime, juice only", "1 orange, juice only", "1 tbsp soft brown sugar", "1 large pinch ground allspice", "½ tsp salt"], "serves": "Serves 4-6 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dipping sauce, place all the ingredients into a food processer and blend until smooth. Pour into a saucepan and bring to the boil. Reduce to a simmer and cook gently over a low heat for 5 minutes. If the sauce gets too thick, add a few tablespoons of boiling water. ", "To make the batter, sift 125g/4½oz plain flour, the baking powder and pinch salt into a bowl. Make a well in centre and break in the egg. Bring in the flour from the sides to make a paste then whisk in the cold water to make a smooth batter. ", "Line a baking tray with greaseproof paper and fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Tip the remaining 50g/1¾oz flour into a shallow bowl and season generously with salt and pepper. Mix together the breadcrumbs and coconut in a seperate bowl.", "Coat each prawn in the flour, shaking off any excess, then holding it by the tail, dip it into the batter. Lift it out and let any excess batter drip back into the bowl. Roll the prawn in the coconut crumbs, pressing down so the mixture sticks. Put the prawn on the prepared tray and repeat until all are coated, leaving space between each one. ", "Deep-fry the prawns in batches for 1 or 2 minutes until golden-brown and crisp. Drain on kitchen paper. ", "Serve at once with the papaya dipping sauce."]}, {"isVegetarian": false, "title": "Crispy duck salad", "url": "www_bbc_co_uk_food_recipes_crispy_duck_salad_03934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_duck_salad_03934_16x9.jpg", "ingredients": ["4 large duck legs", "½ chilled watermelon, skin removed, flesh chopped", "1 fresh pomegranate, seeds only", "½ bunch fresh mint, leaves picked and roughly torn", "large bunch coriander, leaves picked and stalks chopped", "1-2 red chillies (to taste)", "2 tbsp dark soy sauce", "2 tbsp Thai fish sauce", "2 limes, juice only", "½ tsp ground Sichuan pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/350F/Gas 4.", "Place a wire rack on a roasting tin and place the duck legs on top, skin-side up. Roast the duck legs on the rack for 1¾-2 hours, or until the skin is crisp and the meat is cooked through (when the duck is cooked, the juices should run clear when a skewer is inserted into the thickest part of the leg). Set aside to cool for 10-15 minutes, reserving the duck fat on the baking tray.", "In a large bowl, mix together the chopped watermelon and pomegranate seeds. Stir in the mint leaves and coriander and the sliced chillies, to taste.", "When the duck legs have cooled, flake the meat from the bone and add it to the watermelon and pomegranate mixture. Add the soy sauce, fish sauce, lime juice and a little of the reserved duck fat, to taste, if desired. Season with Sichuan pepper and gently toss.", "Serve the salad immediately, while the watermelon is cold and the duck meat still warm."]}, {"isVegetarian": false, "title": "Crispy duck breast with glazed miso aubergine and edamame beans", "url": "www_bbc_co_uk_food_recipes_crispy_duck_breast_with_14444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil, plus extra for deep frying", "4 duck breasts, fat trimmed", "2 aubergines, diced", "180ml/6fl oz white or dark miso", "160g/5¾oz caster sugar", "50g/1¾oz clear honey", "50g/1¾oz kale", "100g/3½oz edamame beans, to serve", "4 tbsp white sesame seeds, to serve", "4 tbsp black sesame seeds, to serve", "2 tbsp mixed micro cress, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 5. Heat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "For the duck, heat a large frying pan and add the oil. Once hot, add the duck breasts and cook skin-side down for 3-4 minutes. Turn the duck over and place in the oven for 6-8 minutes, depending on the size of the duck breast, until cooked through.", "Remove the duck from the oven and, using a large meat fork, hold one breast over the deep-fat fryer. Using a ladle, pour the hot oil over the duck skin for 1-2 minutes, or until golden-brown and crisp. (CAUTION: hot oil can be dangerous. Take care when ladling the oil over the duck.) Set aside, covered with aluminum foil, to rest. Repeat with the remaining duck breasts.", "Heat a deep-fat fryer to 180C. Deep-fry the aubergine for 2-3 minutes or until golden-brown and crisp. Set aside to drain on kitchen paper.", "Add the white miso, sugar, honey and 100ml/3½fl oz water to a saucepan. Over a medium heat, cook until it has reduced in volume and turned golden-brown.", "To serve, bring a pan of salted water to the boil and blanch the kale for 1-2 minutes. Drain and place on serving plates. Slice the rested duck breasts. Place the aubergine on the plates and spoon over the sauce. Arrange the duck around the plates and garnish with the edamame beans, sesame seeds and micro cress."]}, {"isVegetarian": false, "title": "Crispy fillet steak with chilli sauce and lime lemongrass pilau", "url": "www_bbc_co_uk_food_recipes_crispy_fillet_steak_with_08366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "25g/1oz butter", "1 onion, finely diced", "1 garlic clove, finely diced", "1 lemongrass stem, outer leaves removed and finely diced", "300g/10½oz basmati rice", "450ml/16fl oz vegetable or chicken stock", "1 lime, zest and juice", "3 tbsp fresh coriander leaves, roughly chopped", "salt and freshly ground black pepper", "4 x 250g/9oz fillet steaks", "1 tbsp vegetable oil", "8 tbsp potato flour", "1 tsp ground star anise", "2 tbsp light olive oil", "150ml/5fl oz rice wine vinegar", "150g/5½oz caster sugar", "4 tbsp tamari soy sauce", "2 tsp dried chilli flakes", "10cm/4in piece fresh ginger, peeled and finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pilau, heat a deep frying pan or saucepan until medium hot, add the oil and butter and gently cook the onion, garlic and lemongrass for about two minutes, or until just softened.", "Add the rice and cook for one minute, stirring all the time, then add the stock and bring to a simmer.", "Reduce the heat and cover with a lid, then simmer gently for 15 minutes or until the stock is absorbed and the rice is tender.", "Stir in the lime zest, juice and coriander and season to taste with salt and freshly ground black pepper.", "Meanwhile, rub the steaks with the vegetable oil. Mix together the potato flour and star anise and thoroughly dust the steaks, pressing the flour onto the meat to completely cover it.  ", "Heat a frying pan until hot, add the olive oil, then fry the steaks for 2-3 minutes on each side. Remove the steaks from the pan and set aside to rest for 2-3 minutes.", "Place the rice wine vinegar and caster sugar in a separate pan and bring to a simmer. Add the soy, chilli and ginger and simmer for 4-5 minutes, or until the sauce is thick and slightly sticky.", "To serve, spoon some pilau rice onto each plate. Carve the steak into thick slices, place over the pilau and then pour the sticky chilli sauce over the steak."]}, {"isVegetarian": true, "title": "Crispy filo mince pies with pear and apple mincemeat", "url": "www_bbc_co_uk_food_recipes_crispy_filo_mince_pies_63765", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_filo_mince_pies_63765_16x9.jpg", "ingredients": ["3 tart eating apples (such as Granny Smith), peeled, cored and cut into 1cm/½in chunks", "1 perfectly ripe pear, peeled, cored and cut into 1cm/½in chunks", "100g/3½oz raisins", "100ml/3½fl oz apple juice", "75g/2¾oz dried cranberries", "50g/1¾oz pecan nuts, finely chopped", "2 tsp ground ginger", "2 tsp ground cinnamon", "pinch ground cloves", "big pinch freshly grated nutmeg", "1 vanilla pod, seeds scraped out", "1 orange, zest only, finely grated", "1cm/½in piece fresh ginger, very finely chopped", "a few twists cracked black pepper", "3 tbsp cider, calvados, rum or brandy (optional)", "vegetable oil, in a spray bottle", "12 sheets filo pastry", "1 egg, lightly beaten (alternatively use a little melted butter or vegetable oil)", "icing sugar for dusting (optional)", "200g/7oz low-fat Greek yogurt (optional)", "50g/1¾oz icing sugar, sifted", "1 vanilla pod, seeds scraped out or 1 tsp vanilla extract "], "serves": "Makes 12 mince pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/160C(fan)/350F/Gas 4. Place a baking tray into oven to heat up. (This will give extra bottom heat to the pies so that the bases cook through and are not soggy.) Grease a 12-hole muffin tin with a little spray oil and set aside. ", "Put all the mincemeat ingredients into a saucepan over a medium heat. Allow to cook gently, stirring occasionally, for about 10 minutes or until the apples begin to soften. Then remove from the heat and leave the mixture to infuse while you make the pies. ", "Lay the sheets of filo pastry out on top of each other and cut them in half across the width. Then cut each half in half again to give four stacks of about 12cm/4½in squares of filo. I find scissors really handy to cut these out, but a sharp knife will do. Keep any filo not being worked on under a damp tea towel so that it doesn’t dry out.", "Line each hole of the muffin tin with three squares of filo. I like to take a square at a time and press it into the hole, each one slightly staggered from the previous so the resulting pastry case edge looks like a star. Make sure to push the pastry down so it is in the ‘corners’ of each muffin hole. ", "After lining the tin, you should be left with 12 squares of filo. Which you can reserve under a damp tea towel for now. ", "Spray each stack in the tin with a little oil and bake in the oven for five minutes until crisp and pale golden. Then, divide the filling evenly among the cases. ", "Next take the remaining squares of filo, scrunch each one up lightly and place one on top of each pie so that it looks like a scrunched-up tissue. Brush them lightly with beaten egg or melted butter. ", "Pop in the oven on the heated baking sheet for 8-10 minutes or until the pies are crisp and golden. ", "Meanwhile, prepare the yogurt for serving. Gently mix together the yogurt, icing sugar and vanilla seeds or extract in a bowl. Cover and set aside in the fridge until ready to use. ", "Once ready, remove the pies from the oven, dust with a little icing sugar and serve with a dollop of the yogurt, if you like."]}]