[{"ingredients": ["5 hojas de gelatina", "750 g / 1 libra de frambuesas frescas de 10 oz", "100g / 3½oz de azúcar glasé", "1 cucharada colmada de harina de maíz", "250ml / 9fl oz de leche entera", "1 cucharadita de extracto de vainilla", "Crema doble 250ml / 9fl oz", "2-3 ramitas de hierba luisa, solo hojas, para decorar"], "method": ["Remoje las hojas de gelatina en un recipiente con agua fría durante unos minutos, hasta que se ablanden.", "Mientras tanto, mezcle 600 g / 1 lb 5 oz de las frambuesas y todas menos 2 cucharadas de azúcar glas para un puré en un procesador de alimentos. Cuele la mezcla a través de un tamiz fino en un recipiente, descartando las semillas.", "En un tazón, bata la harina de maíz y el azúcar glas restante con 75 ml / 3 fl oz de la leche para formar una pasta suave y espesa. Agregue la leche restante y el extracto de vainilla hasta que estén suaves y bien combinados, luego vierta la mezcla en una cacerola y caliente hasta que hierva a fuego lento.", "Cocine a fuego lento durante unos minutos hasta que la mezcla se haya espesado un poco, luego exprima las hojas de gelatina empapadas y añádalas a la mezcla, revolviendo constantemente hasta que se disuelva.", "Retire la sartén del fuego y mezcle con la crema doble y 150 ml / 5 fl oz del puré de frambuesa hasta que estén bien combinados.", "Vierta la mezcla de manjar blanco en los moldes y enfríe en la nevera durante al menos 4 horas.", "Cuando esté listo para servir, retire los moldes del refrigerador y rápidamente sumérjalos en un recipiente de agua caliente para aflojar el manjar blanco. Invierta los moldes en platos para servir. Sirva con el puré de frambuesa restante, adornado con las frambuesas frescas enteras restantes y las hojas de verbena de limón."], "url": "www_bbc_co_uk_food_recipes_big_kids_raspberry_43909", "title": "Gran manjar blanco de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, más extra para engrasar", "175g / 6oz de azúcar en polvo", "175g / 6oz azúcar moreno claro y suave", "4 huevos grandes de gallinas camperas", "Harina normal de 100 g / 3½ oz", "50 g / 1¾oz de cacao en polvo", "125g / 4½oz de chocolate negro", "125g / 4½ oz de chocolate blanco", "100g / 3½oz de nueces de pacana sin cáscara (o nueces)", "Paquete de 70 g / 2½ oz de guindas secas"], "method": ["Precaliente el horno a 190 ° C / 170 ° C (ventilador) / Gas 5. Ligeramente un molde de brownies rectangulares de 20x30 cm / 8x12 pulgadas o bandeja de hornear y lade la base y los lados con una hoja grande de papel para hornear.", "Coloque la mantequilla en una olla mediana y coloque a fuego muy lento hasta que se derrita. Retire la mantequilla del fuego y mezcle los azúcares hasta que estén bien combinados. Batir los huevos en un tazón grande hasta que estén suaves y verter lentamente la mantequilla y la mezcla de azúcar en la parte superior, revolviendo constantemente hasta que estén bien combinados.", "Coloque la harina y el polvo de cacao en un tamiz y tamice sobre la mezcla de huevo y mantequilla. Batir duro con una cuchara de madera hasta que quede suave. Deja enfriar por 10 minutos. (Esto evitará que los trozos de chocolate se derritan demasiado rápido cuando se agregan a la mezcla).", "Pon todo el chocolate en un tablero y corta en trozos gruesos con un cuchillo grande. Usted quiere que los pedazos estén alrededor de 1.5cm / ¾in. Rompe las nueces de nuez o nueces por la mitad. Revuelva los trozos de chocolate, las cerezas y las nueces en la masa para pasteles. Vierta en la lata preparada y se extendió a todas las esquinas con una espátula de goma o el dorso de una cuchara.", "Hornee el brownie en el centro del horno durante 25-30 minutos o hasta que la mezcla esté crujiente en la superficie y ligeramente cocida por dentro. No permita que se cocine demasiado ya que la torta se volverá esponjosa en lugar de pegajosa en el centro.", "Retire del horno y deje enfriar durante 5-10 minutos. Saque la lata y transfiérala a un tablero. Cortar en cuadrados o rectángulos para servir caliente o dejar enfriar por completo si se sirve frío. Este brownie debe mantenerse bien durante 3-4 días si está bien envuelto con papel de aluminio, ¡pero dudamos que dure tanto!"], "url": "www_bbc_co_uk_food_recipes_bikers_chocolate_46736", "title": "Brownies de nuez de cereza del motorista", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16-20 cuadrados", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cebolla, en rodajas", "1 cucharadita de bayas de enebro, aplastadas", "½ cucharadita de semillas de comino", "Vientre de cerdo magra de 300g / 10½oz, en cubos", "1 cucharada de azúcar moreno", "500g / 1lb 2oz sauerkraut", "media col blanca, rallada", "200g / 7oz de tomates frescos picados o 400g de tomates de hojalata", "500ml / 18fl oz de pollo o caldo de carne", "10g / ¼ oz de champiñones secos", "Salchicha polaca ahumada de 300 g / 10½ oz, como kabanas, picada", "1 manzana, rallada"], "method": ["Derretir la mantequilla en una cazuela grande. Agregue la cebolla y saltee a fuego medio hasta que la cebolla esté suave y translúcida. Espolvoree sobre las bayas de enebro y la alcaravea, luego agregue el cerdo. Espolvorea sobre el azúcar moreno. Enciende el fuego un par de minutos, girando la carne para que se dore bien.", "Escurra bien el chucrut y enjuague si desea reducir el sabor del vinagre. Lo más fácil es exprimirlo con las manos. Agregue a la cazuela con el repollo blanco y los tomates picados, luego vierta sobre el caldo. Cocine a fuego lento durante unos 30 minutos.", "Remoje los champiñones secos en agua tibia. Cuando se hayan suavizado, escurra y agregue el licor empapado a la cazuela. Picar los champiñones finamente y agregarlos a la cazuela, junto con la salchicha y la manzana.", "Cocine a fuego lento durante una hora y media más y sirva o cubra toda la noche y vuelva a calentar al día siguiente."], "url": "www_bbc_co_uk_food_recipes_bigos_stew_69890", "title": "Guiso de Bigos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigos_stew_69890_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de cebada perlada", "1.15kg / 2½ libras de hombro de cordero", "2 litros / 3½ pintas de agua fría o caldo de cordero", "2 cebollas picadas", "1 hoja de laurel", "manojo de tomillo fresco", "2 zanahorias, cortadas en piezas de 2.5cm / 1in", "2 nabos, cortados en piezas de 2.5cm / 1in (opcional)", "2 tallos de apio, recortados, cortados en piezas de 2.5cm / 1in", "1 copo de sal marina tsp colmada, más extra para el gusto", "2 papas, cortadas en piezas de 2.5cm / 1in", "½ repollo savoy, cortado, sin corazón y finamente rallado", "puñado de perejil fresco, toscamente picado", "pimienta negra recién molida"], "method": ["Coloque la cebada perlada en un recipiente y cubra con agua fría. Dejar de lado para empapar.", "Mientras tanto, pase el cordero en una cacerola grande o en una cazuela a prueba de fuego y cúbralo con agua fría o caldo de cordero. Traiga a fuego lento y saque la escoria. Agregue la cebolla, la hoja de laurel y el tomillo a la sartén. Vuelva a cocinar a fuego lento y cocine durante una hora, rozando ocasionalmente.", "Agregue las zanahorias, los nabos y el apio a la cazuela con el cordero. Sazonar con sal y pimienta negra recién molida. Llevar a fuego lento a fuego lento, cubrir con una tapa y cocinar durante 30 minutos.", "Después de que las verduras y el cordero hayan estado hirviendo a fuego lento durante 30 minutos, enjuague la cebada perlada en un colador con agua corriente fría. Dale la vuelta al cordero. Agregue la cebada perlada y las papas a la cazuela. Cocine suavemente durante otros 30 minutos, sin tapar.", "Agregue el repollo y vuelva a hervir a fuego lento. Continúe cocinando sin tapa por otros 15 minutos o hasta que el cordero esté muy tierno y caiga del hueso y la cebada se ablande. Retire la sartén del fuego", "Levante el cordero de la olla con pinzas o un tenedor grande y colóquelo sobre una tabla. Cortar toda la carne, cortar o desgarrar en trozos grandes y descartar cualquier piel y hueso. Sazonar el caldo con más sal y pimienta al gusto y una cuchara en platos grandes y profundos. Divida el cordero entre las placas y espolvoree con perejil recién picado."], "url": "www_bbc_co_uk_food_recipes_bikers_scotch_broth_91406", "title": "Caldo escocés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bikers_scotch_broth_91406_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 filetes de muslo de pollo, sin piel, cortados por la mitad", "1 cucharada de aceite vegetal", "1 cebolla roja, en rodajas", "3 dientes de ajo, en rodajas", "55ml / 2fl oz de salsa de soja oscura", "110g / 4oz de azúcar moreno", "55ml / 2fl oz de salsa de pescado tailandesa", "arroz al vapor, para servir", "vegetales verdes al vapor, para servir"], "method": ["Coloque el pollo y el aceite en un recipiente y mezcle para combinar. Caliente una sartén grande a fuego alto hasta que esté caliente. Agregue la mitad del pollo y cocine durante dos minutos por un lado hasta que esté ligeramente dorado, gírelo y cocínelo por un minuto más. Retire de la sartén y repita con el pollo restante.", "Reduzca el fuego a medio y agregue un poco de aceite extra si es necesario. Agregue la cebolla y el ajo y cocine durante cinco minutos, revolviendo ocasionalmente. Regrese el pollo a la sartén, sazone abundantemente con pimienta negra, agregue la salsa de soja y revuelva para combinar.", "Cubra la sartén, reduzca el fuego a bajo y cocine durante 10 minutos, revolviendo ocasionalmente. Aumente el fuego a alto, agregue el azúcar y revuelva para combinar. Cocine sin tapar durante 3-4 minutos, o hasta que la salsa esté rica, oscura y almibarada.", "Agregue la salsa de pescado y mezcle para combinar. Coloque en un plato para servir y sirva con arroz al vapor y vegetales verdes."], "url": "www_bbc_co_uk_food_recipes_billgrangerscaramelc_73143", "title": "Pollo de caramelo de Bill Granger", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "100g / 3½ oz champiñones, finamente picados", "1 cucharada de salsa Worcestershire", "1 cucharada de salsa Tabasco", "1 cucharada de tomillo seco", "450g / 1lb de carne de salchicha (puedes sacar fácilmente la carne de las pieles de las salchichas preparadas)", "sal y pimienta negra recién molida", "450 g / 1 libra de hojaldre laminado", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla en una sartén grande y fría los champiñones hasta que estén blandos. Transfiera a un tazón grande.", "Agregue la salsa Worcestershire, la salsa Tabasco, el tomillo y la carne de salchicha y sazone bien con sal y pimienta negra recién molida. Mezcle hasta que esté completamente combinado.", "Ruede la masa de hojaldre en un rectángulo grande, luego córtela en dos rectángulos largos.", "Coloque una capa de mezcla de carne de salchicha en el centro de cada rectángulo de repostería, luego cepille cada uno con huevo batido en un borde.", "Dobla el otro lado de la masa sobre el borde lavado con huevo. Presione hacia abajo para sellar y recortar cualquier exceso. Corte cada panecillo en 8-10 pequeños rollos de salchicha.", "Coloque los rollos de salchicha en una bandeja para hornear y transfiera al horno para hornear durante 15-20 minutos, o hasta que estén crujientes y dorados y la carne de la salchicha esté completamente cocida."], "url": "www_bbc_co_uk_food_recipes_bigsausagerolls_86258", "title": "Rollos de salchicha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigsausagerolls_86258_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 salchichas italianas", "2 cucharadas de aceite de oliva", "1 cebolla roja, cortada en cuñas", "2 dientes de ajo, aplastados", "400g de tomates cortados en lata", "1 pimiento rojo, cortado en tiras", "½ cucharadita de copos de chile", "2 cucharaditas de orégano seco", "2 cucharadas de perejil fresco picado, opcional", "Fusilli de trigo integral de 200g / 7oz, o pasta de su elección"], "method": ["Ponga una sartén antiadherente mediana a fuego alto y dore las salchichas en 1 cucharada de aceite de oliva. Coloque las salchichas doradas a un lado.", "Reduzca el fuego a una llama media y sude la cebolla y el ajo en el aceite restante durante 2 minutos. Agregue los tomates, el pimiento rojo, el chile, el orégano y las salchichas a la sartén. Cocine a fuego lento hasta que los pimientos rojos se ablanden (esto debería tomar alrededor de 10 minutos).", "Cocine el fusilli hasta que esté al dente (con una mordida) de acuerdo con las instrucciones del fabricante.", "Escurrir bien la pasta y poner en dos tazones con la salsa. Sirva con una pizca de perejil picado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_billsspicysausageand_73069", "title": "Pasta de salchicha picante de Bill", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/billsspicysausageand_73069_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manzana", "50 g / 1¾oz de avena", "40 g / 1½ oz pasas", "1 cucharada de semillas de girasol", "1 cucharada de semillas de chia", "125ml / 4fl oz de leche de anacardo (u otra leche a base de plantas)", "1 cucharada de jarabe de arce, jarabe de miel o miel (opcional)", "puñado de arándanos, frambuesas o fresas (opcional)"], "method": ["Ralla la manzana en un tazón grande y descarta el núcleo.", "Agregue la avena, las pasas, las semillas y la leche de anacardo y mezcle bien. Agregue el jarabe y las bayas, si usa, y vuelva a mezclar.", "Transfiera la mezcla a un recipiente hermético, selle y refrigere durante al menos 6 horas o hasta 3 días. Esto permite que la avena absorba la leche. Regrese a la temperatura ambiente antes de servir."], "url": "www_bbc_co_uk_food_recipes_bircher_muesli_70498", "title": "Bircher muesli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bircher_muesli_70498_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 7oz de avena", "Albaricoques secos de 25 g / 1 oz, picados", "Ciruelas pasas 25g / 1oz picadas", "1 cucharada de semillas de calabaza", "1 cucharada de semillas de girasol", "bayas frescas, para servir", "leche, yogur o jugo de fruta, para servir"], "method": ["Mezcle la avena, los albaricoques secos, las ciruelas pasas, las semillas de calabaza y las semillas de girasol juntas y métalas en un tazón para servir.", "Para servir, esparza un puñado de bayas frescas y vierta sobre la leche, el yogur o el jugo de fruta."], "url": "www_bbc_co_uk_food_recipes_birchermuesli_88972", "title": "Muesli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1-2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/birchermuesli_88972_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250 g / 9 oz (280 g / 10 oz de harina natural, si se hacen las galletas de chocolate)", "½ cucharadita de polvo de hornear", "250 g / 9 oz de azúcar en polvo", "3 huevos de gallinas camperas, golpeados", "220 g / 8oz de pistachos sin cáscara y picados", "125 g / 4½ oz de arándanos secos, picados", "1 limón, ralladura solamente", "200g / 7oz de avellanas sin cáscara y picadas", "125g / 4½oz de fechas, picadas", "1 limón, ralladura solamente", "50g / 1¾oz de chocolate negro derretido, enfriado a temperatura templada", "25 g / 1 oz de pepitas de chocolate", "35 g / 1¼ oz de almendras picadas", "1 naranja, solo ralladura", "½ cucharadita de esencia de vainilla", "150g / 5½oz de chocolate negro de buena calidad", "150ml / 5fl oz de crema doble", "100 ml / 3½ fl oz de café expreso", "100g / 3½ oz pequeños malvaviscos", "100 ml / 3½ fl oz miel"], "method": ["Para la base de biscotti, precaliente el horno a 160 C / 325 F / Gas 3 (no use el ventilador en su horno).", "Mezcle la harina, el polvo de hornear y el azúcar en un bol y agregue los huevos lentamente para hacer una masa.", "Para los biscotti de pistacho y arándano, agregue las nueces, los arándanos y la ralladura de limón en este punto.", "Para la biscote de avellana y la fecha agregue las nueces, las fechas y la ralladura de limón en este punto.", "Para los bizcochos de chocolate, almendras y naranja, agregue el chocolate tibia derretido a la masa base y mezcle bien antes de agregar las chispas de chocolate, almendras, cáscara de naranja y esencia de vainilla.", "Amasar la mezcla suavemente y luego separarla y enrollarla en dos troncos. Coloque en una bandeja de horno forrada y hornee durante 25 minutos en el horno precalentado.", "Enfríe ligeramente y corte en rodajas gruesas de 1-2 cm / ½ pulgada.", "Vuelva a colocar la bandeja en el horno y hornee por otros 10-15 minutos, voltee y continúe horneando por otros 10-15 minutos hasta que se doren.", "Para la salsa de moca, combine todos los ingredientes en una cacerola de base pesada y caliéntelos suavemente, revolviendo constantemente hasta que todos los malvaviscos y el chocolate se hayan derretido.", "Sirva la salsa de moca caliente en una taza con el biscotti en el lado para sumergir."], "url": "www_bbc_co_uk_food_recipes_biscotti_with_hot_mocha_60995", "title": "Biscotti con salsa de moka caliente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 20 porciones por receta base", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/biscotti_with_hot_mocha_60995_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["115 g / 4 oz de azúcar en polvo", "3 limones, zumos y zumos sin cera", "350ml / 12fl% 20oz% 20eau-de-vie% 20 (incoloro% 20fruit% 20liqueur),% 2040-80 %% 20proof,% 20or% 20vodka", "Harina normal de 250g / 9oz", "250 g / 9 oz de azúcar en polvo", "1½ cucharadita de polvo de hornear", "2 huevos de gallinas camperas, ligeramente golpeados", "90 g / 3¼ oz de sultanas", "90 g / 3¼ oz de uva", "90g / 3¼oz de guindas secas", "Albaricoques secos de 115g / 4oz, aproximadamente picados", "1 limón, ralladura solamente"], "method": ["Para el limoncello, caliente el azúcar y 75 ml / 5 cucharadas de agua en una cacerola a fuego medio. Revuelva para disolver el azúcar.", "Llevar la mezcla a ebullición, luego cocine a fuego lento durante 3-4 minutos hasta que las burbujas parezcan almibaradas. Retirar del fuego y dejar enfriar.", "Agregue la ralladura de limón y el jugo al almíbar mientras todavía esté ligeramente tibio. A continuación, agregue el aguardiente o vodka.", "Vierta el limoncello en una botella o frascos esterilizados y selle. Deje en un lugar fresco y oscuro durante 24 horas, sacudariendo de vez en cuando, luego cuele en una botella limpia.", "Poner en el congelador durante varias horas antes de servir. El licor se sirve mejor en vasos de chupito congelados.", "Método para biscotti, precaliente el horno a 180C / 350F / Gas 4 y forre una bandeja para hornear con pergamino.", "Mezcle la harina, el azúcar y el polvo de hornear juntos en un tazón grande.", "Agregue la mitad de los huevos batidos y mezcle bien, luego agregue la mitad de lo que queda y vuelva a mezclar.", "Ahora agregue el último cuarto un poco a la vez hasta que la masa tome forma pero no esté demasiado mojada (es posible que no necesite usar todos los huevos).", "Agregue la fruta seca y la ralladura de limón y mezcle bien.", "Divida la masa por la mitad, y cada mitad en forma de salchicha y coloque en la bandeja de hornear, dejando al menos un espacio de 6 cm / 2½ pulgadas entre ellos.", "Aplanar ligeramente las \"salchichas\", luego hornear durante 20-30 minutos hasta que estén doradas.", "Retire del horno y deje reposar durante 10 minutos para que se solidifique.", "Baje el horno a 150C / 300F / Gas 2.", "Una vez enfriado, mueva la masa de biscotti cocida sobre una tabla para cortar. Con un cuchillo de sierra, corte el biscotti en un ángulo de 5 mm / ¼ en rodajas.", "Coloque las rebanadas en la bandeja de horno. Regrese al horno y cocine durante ocho minutos, luego dé vuelta las rebanadas y cocine por otros 10-15 minutos o hasta que estén doradas.", "Retire del horno y enfríe los biscotti en bastidores de alambre.", "Para servir, amontone las galletas en un plato y sirva con una inyección de limoncello."], "url": "www_bbc_co_uk_food_recipes_biscotti_with_limoncello_55604", "title": "Biscotti con limoncello", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 galletas amaretti, desmenuzadas", "6 galletas de mantequilla, desmenuzadas", "3-4 plátanos, en rodajas", "Licor de almendra 150ml / 5fl oz, como amaretto", "50g / 1¾oz de mantequilla salada", "2 cucharadas de azúcar moreno claro", "150 g / 5½ oz de almendras enteras, tostadas y picadas", "250 g / 9 oz de crema fresca"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Desmenuzar casi todas las galletas en moldes individuales. Pon el resto a un lado. Corta el plátano y extiende sobre la parte superior de cada plato. Vierta sobre el licor, salpique con mantequilla y espolvoree con azúcar.", "Hornee durante 25 minutos, rociando con frecuencia.", "Esparce sobre las almendras tostadas y picadas y algunas galletas más desmenuzadas. Sirve con crème fraiche."], "url": "www_bbc_co_uk_food_recipes_biscuit_and_banana_bake_18797", "title": "Bizcocho de galletas y bananas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de azúcar en polvo", "2 huevos de gallinas camperas", "Harina normal de 75 g / 2½ oz, tamizada", "20g / 1oz de mantequilla, derretida y enfriada", "8 cucharadas de licor de café", "100 g / 3½ oz de chocolate negro, derretido", "1 hoja de gelatina, empapada en agua fría durante cinco minutos", "4 cucharadas de café instantáneo, disuelto en 4 cucharadas de agua hirviendo", "2 cucharadas de azúcar glas", "2 huevos de gallinas camperas, separados", "Crema doble de 300 ml / 10 fl oz, suavemente batida", "2 claras de huevo de gallinas camperas", "175g / 6oz% 20chocolate% 20 (70 %% 20cocoa% 20solids),% 20chopped", "1 yema de huevo de gallinas camperas", "4 claras de huevo de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "275ml / 9¾oz de crema doble", "1 cucharada de gránulos de café instantáneo", "3 huevos de gallinas camperas, solo yemas", "2 cucharadas de azúcar en polvo", "1 cucharada de harina de maíz", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids)", "40 g / 1½ oz de azúcar en polvo", "Crema doble de 60 ml / 4 cucharadas", "polvo de cacao endulzado, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos bandejas planas para hornear de 18 x 30 cm / 7 x 12 pulgadas con papel para hornear.", "Para el bizcocho, bata juntos el azúcar impalpable y los huevos hasta que la mezcla esté pálida y esponjosa, y la mezcla forma cintas en la superficie cuando se rocía. Dobla la harina común, vierte la mantequilla derretida y dóblala.", "Vierta la mezcla en las bandejas de hornear forradas y hornee durante 8-10 minutos, o hasta que estén doradas. Retirar del horno y dejar enfriar. Una vez que esté frío, despegue el pergamino para hornear y use un cortador de 7 cm / 2 in para cortar ocho discos.", "Coloque un disco de esponja en la parte inferior del anillo de un cocinero en cada uno de los cuatro platos de servir. Rocíe una cucharada de licor de café en cada disco. Deje remojar y luego cepille con un poco del chocolate derretido.", "Para la mousse de café, exprime el exceso de agua de las hojas de gelatina y revuelve en el café caliente.", "Batir el azúcar glas y las yemas de huevo en un tazón hasta que estén pálidos y esponjosos. Dobla la mezcla de café en la mezcla de yema de huevo. Dobla la crema batida.", "En un tazón para mezclar limpio, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Dobla las claras de huevo en la mousse de café.", "Vierta la mousse de café en las bases empapadas hasta que los anillos de los chefs estén medio llenos. Remoje los discos restantes de esponja en el licor de café restante y luego colóquelo en la parte superior de la mousse. Cepíllese con un poco más de chocolate negro y luego haga la mousse de chocolate.", "Para la mousse de chocolate, coloque el chocolate picado en un recipiente sobre una fuente de agua hirviendo a fuego lento. Una vez derretido, retíralo del fuego y déjalo enfriar un poco. Batir la yema de huevo.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor. Poco a poco bata el azúcar, poco a poco, hasta que se formen picos rígidos y brillantes.", "Una vez que el chocolate se haya enfriado a la temperatura corporal, dobla las claras de huevo en el chocolate. Coloque la mousse en una manga pastelera y póngala sobre los pasteles. Coloque en la nevera para establecer.", "Para el café inglés, caliente la crema en una sartén con los gránulos de café.", "En un tazón grande, mezcle las yemas de huevo, la harina de maíz y el azúcar impalpable, luego vierta la crema de café caliente, batiendo todo el tiempo. Regrese la mezcla a una olla limpia y coloque a fuego lento. Revuelva continuamente hasta que la crema se espese y cubra la parte posterior de una cuchara. Viértalo en un recipiente y déjelo enfriar. Enfríe en la nevera.", "Para la salsa de chocolate, coloque los ingredientes de la salsa de chocolate con cinco cucharadas de agua en una cacerola y caliente suavemente. Cuando todos los ingredientes se hayan derretido, vierta en una botella o un recipiente y deje que se enfríe.", "Una vez que esté listo para servir, use un soplete para calentar el anillo alrededor de la pila de mousse, lo que facilita su extracción. Polvo las tapas con cacao en polvo endulzado. Rocíe con un poco de la salsa de chocolate y sirva el café frío inglés en una jarra al lado."], "url": "www_bbc_co_uk_food_recipes_bitter_chocolate_and_38429", "title": "Pastel de mousse de chocolate amargo y café servido con un café inglés", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "300 g / 10½ onzas de carne de cerdo picada", "½ cebolla, muy finamente picada", "1 zanahoria, rallada", "aceite vegetal, para freír", "1 cucharadita de nuez moscada rallada", "2 cucharadas de perejil fresco finamente picado", "1 limón, jugo y ralladura", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "Harina simple de 75g / 2¾oz", "225ml / 8fl oz de leche entera, calentada", "2 huevos de gallinas camperas, golpeados", "125g / 4½oz de pan rallado"], "method": ["Calentar el aceite en una sartén y freír el cerdo picado durante 4-5 minutos, o hasta que se dore por todas partes. Retire la carne de cerdo de la sartén y déjela a un lado.", "Agregue la cebolla y la zanahoria a la sartén y fría por 4-5 minutos. Retire de la sartén y agregue al cerdo frito. Dejar de lado para enfriar.", "Agregue la nuez moscada, el perejil y el jugo de limón y la ralladura y condimente, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, derrita la mantequilla en una cacerola, agregue la harina y cocine por 2-3 minutos. Poco a poco agregue la leche tibia para formar una salsa espesa.", "Agregue la salsa a la mezcla de carne y mezcle hasta que esté bien combinada. Dejar de lado para enfriar.", "Una vez frío, divida la mezcla en bolitas.", "Batir los huevos en un bol y espolvorear las migas de pan en un plato.", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las bolas en el huevo, luego cubra con las migas de pan. Freír las bolas durante 3-4 minutos o hasta que estén doradas. Retire las bolas de la sartén y déjelas a un lado para escurrirlas sobre papel de cocina.", "Sirva con salsa picante y cebollas en escabeche."], "url": "www_bbc_co_uk_food_recipes_bitterballen_57810", "title": "Bitterballs", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bitterballen_57810_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["puñado de pasas", "1 cucharada de ron oscuro", "200g / 7oz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids)", "125g / 4½oz de mantequilla sin sal", "400 g de guisantes carlin de hojalata, escurridos y enjuagados", "3 huevos de gallinas camperas (preferiblemente orgánicos)", "150g / 5oz de azúcar morena suave", "1½ cucharadita de cacao en polvo"], "method": ["Remoje las pasas en el ron durante 3 horas, o preferiblemente durante la noche.", "Precalentar el horno a 170C / 150C Fan / Gas 3½. Engrase y forre una lata de brownie cuadrada de 20 cm / 8 pulgadas con papel de hornear.", "Derrita el chocolate y la mantequilla en un recipiente resistente al calor colocado sobre agua hirviendo, asegurándose de que el recipiente no toque el agua. Revuelva para combinar y reservar para que se enfríe un poco.", "Mezcle los guisantes con un puré en un procesador de alimentos. Agregue los huevos, el azúcar y el cacao en polvo y mezcle hasta que quede suave. Vierta la mezcla de chocolate y mezcle hasta que quede suave. Agregue las pasas y su licor de remojo y pulso hasta que se combinen", "Verter en la lata de brownie preparada, hornear durante 20-25 minutos hasta que esté listo, pero aún un poco squidgy. Deje que se enfríe completamente en la lata antes de cortar."], "url": "www_bbc_co_uk_food_recipes_black_badger_brownies_04899", "title": "Brownies negros del tejón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 brownies", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_badger_brownies_04899_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "175g / 6 oz de azúcar (media luz muscovado, medio lanzador dorado)", "Avellanas de 75 g / 2½ oz", "2 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "2 plátanos muy maduros (aproximadamente 250 g / 9 oz de peso total)", "gota de extracto de vainilla", "175g / 6oz de buena calidad de chocolate negro o con leche", "un poco de azúcar demerara"], "method": ["Precaliente el horno a 170C / 325F / Gas 3. Alinee la base y los lados de una lata de pan de 20cm x 12cm / 8in x 5in con papel para hornear.", "Batir la mantequilla y los azúcares hasta que estén claros y de color café. Esto se logra mejor en un mezclador de alimentos.", "Tueste las avellanas, frótelas en un paño de cocina para quitarles la piel y luego pásalas muy finamente.", "Poco a poco agregue los huevos a la mantequilla y la mezcla de azúcar, luego mezcle las avellanas molidas tostadas y la harina para criar.", "Pela los plátanos y córtalos los trozos pequeños. Doble suavemente el extracto de vainilla, los plátanos y las chispas de chocolate en la mezcla de tortas, gírelo suavemente y tenga cuidado de no mezclarlo demasiado.", "Coloque la masa de torta en la lata de hogaza preparada. Polvo con un poco de azúcar demerara. Hornee durante 1 hora y 1 hora 10 minutos, cubriendo la torta con papel de aluminio si la parte superior comienza a oscurecerse demasiado rápido."], "url": "www_bbc_co_uk_food_recipes_black_banana_cake_52982", "title": "Pastel de plátano negro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve al menos 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_banana_cake_52982_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Arroz integral 110 g / 3½ oz, enjuagado", "1 cucharada de aceite de oliva", "1 x 400 g de frijoles negros de hojalata, escurridos y enjuagados", "2 cucharaditas de pimentón ahumado", "1 cucharadita de vinagre de vino blanco", "2 huevos de gallinas camperas", "50g / 2oz de espinaca", "1 aguacate, reducido a la mitad y en rodajas", "60 g / 2 oz de queso feta, desmenuzado", "1 limón, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Ponga a hervir una olla de agua, agregue el arroz y cocine a fuego lento durante 30-40 minutos, hasta que esté tierna. Escurrir y apartar.", "Coloque un poco de aceite de oliva en una olla pequeña, agregue los frijoles negros y caliente a fuego medio a bajo. Revuelva a través del pimentón ahumado.", "Mientras tanto, ponga otra olla de agua a hervir, reduzca a fuego lento y agregue el vinagre de vino blanco. Agriete suavemente los huevos de uno en uno, tan cerca del agua como sea posible, y cocine a fuego lento a fuego lento durante 3 minutos.", "Mientras los huevos se cocinan, agregue la espinaca a los frijoles y marchite durante 2 minutos, luego sazone con sal y pimienta.", "Coloque el arroz cocido en un tazón grande, agregue la espinaca y los frijoles negros y mezcle para combinar. Vierta la mezcla en dos tazones para servir y cubra con los huevos escalfados, rebanadas de aguacate y trozos de queso feta. Agregue jugo de limón, sal y pimienta al gusto."], "url": "www_bbc_co_uk_food_recipes_black_bean_and_smoke_29105", "title": "Cuenco de frijol negro y arroz con huevos escalfados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_smoke_29105_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de jugo de lima", "7 cucharadas de aceite de oliva virgen extra", "3-4 chiles jalapeños (o 1 chile rojo), finamente picados, al gusto", "1 diente de ajo, picado", "pellizcar el comino molido", "sal y pimienta negra recién molida", "3 x 400 g de alubias negras cocidas, escurridas", "gran puñado de cilantro fresco picado", "4 tomates medianos, cortados en rodajas, sin semillas (o 16 tomates cherry, cortados a la mitad)", "1 pimiento rojo grande, tallo y semillas retirados, cortados en tiras finas", "1 cebolla roja, finamente rebanada", "5 cebollas de primavera, cortadas y en rodajas finas (o 1 cebolla roja pequeña, finamente cortada en rodajas)", "200g / 7oz de berros frescos, tallos duros cortados a la mitad", "2 aguacates maduros grandes, sin piel y semillas, cortados en cubos"], "method": ["Coloque todos los ingredientes del aderezo en un tarro de mermelada, vuelva a colocar la tapa y agite hasta que estén bien combinados. Condimentar con sal y pimienta. Agregue más chile si lo desea.", "Para la ensalada, enjuague los frijoles negros con agua corriente fría y escúrralos. Poner en un tazón grande y verter más de la mitad del aderezo.", "Agregue los ingredientes restantes de la ensalada, aparte del berro y el aguacate, y mezcle bien para combinar.", "Para servir, divida el berro entre 4 platos para servir. Coloque la ensalada encima y cubra con los cubos de aguacate. Rocíe un poco más de aderezo sobre cada porción."], "url": "www_bbc_co_uk_food_recipes_black_bean_and_avocado_32747", "title": "Ensalada de frijoles negros y aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_avocado_32747_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "75 g / 3 oz de manteca de cerdo, en cubos", "75g / 3oz de mantequilla, en cubos", "pizca de sal", "½ cucharadita de polvo de hornear", "1 huevo de gallinas camperas, batido, para glasear", "Harina normal de 200g / 7oz", "300 g / 10½oz de pasas", "300 g / 10½ oz de grosella", "½ cucharadita de jengibre molido", "½ cucharadita de canela molida", "½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de especias mixtas", "¼ cucharadita de pimienta negra molida", "100g / 3½oz de azúcar moreno oscuro", "100 g / 3½ oz de cáscara mixta, picada", "½ cucharadita de bicarbonato de soda", "2 cucharadas de whisky", "1 huevo de gallinas camperas", "3 cucharadas de suero de leche"], "method": ["Para la masa, tamice la harina en un tazón y frote la manteca y la mantequilla hasta que la mezcla se asemeje a pan rallado. Agregue la sal, el polvo de hornear y cuatro cucharadas de agua fría y mezcle con una masa suave. Sal y amasa una pelota. Envuelva la película adhesiva y déjela enfriar en la nevera mientras realiza el llenado.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador 160 ° C).", "Para el relleno, mezcle todos los ingredientes en un tazón grande.", "Alinee una lata de hogaza de 900g / 2lb con pergamino para hornear. En una superficie ligeramente enharinada, extender dos tercios de la masa a un rectángulo lo suficientemente grande como para forrar la lata. Cubre la lata y presiona contra los lados. Coloque el relleno en la lata, presionando hacia abajo para comprimir.", "Estirar tres cuartas partes de la masa restante a un rectángulo lo suficientemente grande como para cubrir la lata. Humedece los bordes de la masa con agua y presiona la tapa de la pastelería en la parte superior para sellarla. Recorte los bordes y engarce con los dientes de un tenedor. Estirar los pasteles restantes, junto con los adornos, y usar para hacer un arco para decorar la parte superior, luego unir con un poco de agua.", "Esmaltar con huevo batido y hornear durante dos horas. Retire del horno y deje enfriar en la lata antes de apagar."], "url": "www_bbc_co_uk_food_recipes_black_bun_66755", "title": "Moño negro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bun_66755_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz de cerezas frescas", "200 g / 7 oz (alrededor de 2) manzanas Bramley", "350g / 12oz granulada o azúcar en polvo", "1 limón pequeño, solo jugo", "50 g / 2oz de avellanas picadas y tostadas"], "method": ["Coloque las cerezas (bien picadas, enteras o en mitades) en una cacerola y cúbralas con 500 ml / 18 fl oz de agua. Llevar a ebullición, luego cocine hasta que las cerezas estén muy tiernas y el agua casi se haya evaporado.", "Pele y ralle las manzanas Bramley, menos el núcleo y las pepitas, y agregue la manzana rallada a la sartén. Hierva nuevamente hasta que los hilos de la manzana estén muy suaves y se caigan y el líquido casi haya desaparecido.", "Agregue el azúcar y el jugo de limón, lleve a ebullición y cocine hasta que la reserva alcance 105C / 220C en un termómetro de azúcar. Agregue las avellanas al final de la cocción.", "Deje que se enfríe durante unos minutos, luego vierta en jarras calientes y selle inmediatamente.", "Deje el atasco hasta el día siguiente antes de comer, y después de abrir, guárdelo en el refrigerador."], "url": "www_bbc_co_uk_food_recipes_black_cherry_and_47093", "title": "Mermelada de cereza negra y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde aproximadamente 600 ml / 20 fl oz (aproximadamente 2 jarras de mermelada)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_cherry_and_47093_16x9.jpg", "isVegetarian": true, "recommendations": 0}]