[{"ingredients": ["12 cebollas blancas bebé", "130 g / 4½ oz de mantequilla", "300g / 10½oz Tenderstem broccoli spears, recortado", "200g / 7oz rebozuelos", "1 gallina de Guinea, alrededor de 1.6kg / 3lb 8oz, cortada en 8 pedazos, canal y cuello cortados y reservados", "3 chalotes, en rodajas finas", "2 ramitas de tomillo", "2 hojas de laurel", "2 ramitas de estragón, hojas y tallos separados", "500ml / 18fl oz de vino blanco Riesling", "300ml / 10fl oz de caldo de pollo", "Crema doble 300ml", "½ limón, solo jugo", "sal y pimienta recién molida"], "method": ["Coloque las cebollas y 30 g / 1 oz de la mantequilla en una sartén pequeña y cubra con agua fría. Agregue una pizca de sal y cocine a fuego medio durante 15 minutos. Retirar del fuego y reservar, dejando las cebollas en el agua de cocción.", "Precalentar el horno a 200C / 400F / Gas 6.", "Derretir la mantequilla restante a fuego muy suave y llevar lentamente a ebullición. Elimina la espuma de la superficie. Con cuidado, vierta la mantequilla líquida en un tazón, reteniendo el sedimento lechoso en el fondo de la sartén. La mantequilla clarificada debe ser del color del aceite de oliva ligero.", "Cocine los tallos de brócoli en agua hirviendo con sal durante dos minutos, revuelva en agua fría y escurra. Cubra con film transparente y reserve.", "Recorte los tallos de rebozuelo, luego use una toalla de té húmeda para limpiar suavemente cualquier rastro de arena o tierra.", "Caliente tres cucharadas de mantequilla clarificada en una sartén a fuego medio-alto, agregue los níscalos y una pizca de sal y cocínelos suavemente durante 3-4 minutos. Tan pronto como hayan liberado su líquido, transfiéralo a un recipiente y cúbralo con una película adhesiva, perforada en varios lugares.", "Caliente la mantequilla restante clarificada en una sartén a prueba de horno a fuego moderadamente alto. Espolvoree las piezas de gallina de Guinea y el cadáver con sal y agregue a la sartén. Colorea por todos lados, luego transfiere la sartén al horno y cocina por 15 minutos.", "Saca la gallina de Guinea de la sartén y ponla en un plato, dejando las piezas de la carcasa dorada en la sartén. Cubra el plato con papel de aluminio y reserve. Vierta la grasa de la sartén.", "Agregue los chalotes, tomillo, hojas de laurel y tallos de estragón a las piezas de la carcasa en la sartén. Verter el vino y subir el fuego a lo alto.", "Use una cuchara de madera o una espátula para raspar las partes cocidas en el fondo de la sartén para desglasarlo. Continúe cocinando hasta que el volumen de líquido se reduzca en dos tercios.", "Vierta el caldo y cocine para reducir el volumen del líquido a la mitad, luego agregue la crema y cocine a fuego lento hasta que la salsa sea lo suficientemente espesa como para cubrir ligeramente la parte posterior de una cuchara. Colar a través de una tela china o un colador fino en una sartén grande y sazonar con sal y pimienta al gusto.", "Agregue los pedazos de gallina de Guinea a la salsa, junto con las cebollas, brócoli y rebozuelos, asegurándose de que estén bien drenados. Lleve a fuego lento a fuego lento, luego agregue el jugo de limón y dos tercios de las hojas de estragón e inmediatamente retire del fuego.", "Para servir, incline el contenido de la sartén en un plato hondo para servir, espolvoree con las hojas de estragón restantes y sírvalas con pan para limpiar los deliciosos jugos."], "url": "www_bbc_co_uk_food_recipes_guinea_fowl_cooked_with_67526", "title": "Aves de Guinea cocinadas con Riesling y rebozuelos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "198g maíz dulce de hojalata, escurrido", "100 ml / 3½ fl oz de caldo de pollo", "2 coliflores grandes, cocidos", "aceite vegetal, para freír", "1 cucharadita de pimentón", "1 cucharadita de especia cajún", "1 cucharadita de jengibre molido", "2 pechos de gallina de Guinea, con la piel puesta", "5 cucharadas de aguardiente", "200ml / 7fl oz de caldo de pollo", "100 g / 3½ oz de mantequilla", "198g maíz dulce de hojalata, escurrido", "2 cucharadas de jarabe de abedul (alternativamente, use jarabe de arce mezclado con un toque de salsa de soja)", "1 plátano muy maduro, a temperatura ambiente", "3-4 cucharadas de crema doble", "1 manojo de berros, para adornar"], "method": ["Para el puré de maíz dulce, caliente la mitad de la mantequilla en una sartén grande y agregue el maíz. Cocine durante 1-2 minutos, luego agregue el caldo y cocine a fuego lento durante 3-4 minutos. Agregue la mantequilla restante y la coliflor y mezcle hasta que quede suave. Dejar de lado.", "Para las aves de Guinea, precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente una freidora a 180 ° C o, alternativamente, llene hasta la mitad una olla grande y profunda con aceite vegetal y caliente hasta que un cubo de pan se dore en 1 minuto después de agregarlo al aceite. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Combine las especias y frótelas en las pintadas. Caliente una sartén a prueba de horno y, una vez caliente, agregue la carne y cocine hasta que se dore por todas partes. Desglaze la sartén con el brandy agitando el fondo para aflojar los trozos carbonizados de carne. Cocine por unos minutos para permitir que el alcohol se queme. Agregue el caldo de pollo a la sartén, cubra con papel de aluminio y termine en el horno durante 8-10 minutos.", "En una sartén, caliente un poco de mantequilla y fría el maíz dulce hasta que la mantequilla esté dorada. Agregue el jarabe de abedul. Mantenga caliente hasta que esté listo para servir.", "Con la piel puesta, use papel de cocina para asegurarse de que el plátano esté seco. Freír el plátano, con la piel encendida, hasta que esté dorado y burbujeante, luego retírelo de la freidora. Cortar por la mitad a lo ancho.", "Cuando la gallina de Guinea esté cocinada, retírela de la sartén y déjela a un lado para que descanse. Coloque la bandeja sobre la placa y caliente hasta que el volumen del líquido se reduzca a una salsa. Retire del fuego y mezcle con la mantequilla restante y la crema para terminar.", "Para servir, esculpir los senos y servir con el maíz tostado, mitades de plátano y puré de maíz dulce. Cuchara sobre la salsa y decorar con berros."], "url": "www_bbc_co_uk_food_recipes_guinea_fowl_maryland_95208", "title": "Aves de Guinea Maryland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 gallinas de Guinea alrededor de 1.2kg / 2lb 12oz cada una", "10g / ¼oz de hongos porcini secos", "2 cucharadas de aceite de oliva", "200g / 7 oz de tocino ahumado lardons", "4 chalotes de plátano, picados", "4 ramitas de tomillo", "300 ml / ½ litro de jerez seco amontillado o vino blanco seco", "50g / 1¾oz de mantequilla", "50g / 1¾oz de harina natural", "200g / 7oz de setas pequeñas de castaña", "2-3 cucharadas de crema entera de grasa", "pequeño racimo de perejil fresco, picado"], "method": ["Para unir las aves, flexione las piernas y los muslos lejos de las aves, luego corte entre las articulaciones para separarlas. Corte entre las articulaciones del muslo y la pierna para hacer dos piezas. Dobla las alas y córtalas. Aparta las alas para el caldo.", "Corta cualquier lado del esternón y quita los senos. Quita la piel de todos los trozos de carne. Coloque los cadáveres, la piel y las alas en una sartén con 900ml / 1½ pintas de agua y deje que hiervan para hacer un caldo. Cocine a fuego lento durante 30 minutos, luego retire del fuego.", "Ajuste el horno a 180C / 350F / Gas 4 (ventilador de 160C). Coloque los hongos porcini en un tazón pequeño, cubra con cuatro cucharadas de agua hirviendo y déjelos a un lado para que se llenen.", "Calentar el aceite en una sartén grande y freír las piezas de gallina de Guinea durante unos cinco minutos, o hasta que estén doradas por todos lados. Es posible que deba hacer esto en dos lotes. Retire la carne con una cuchara ranurada y colóquela en una lata grande para asar. No lave la sartén, la necesitará más tarde.", "Asar las gallinas de Guinea en el horno durante 25 minutos y luego quitar las pechugas de gallina de Guinea. Regrese las piernas y los muslos al horno para cocinar por otros 15 minutos. Cortar los pechos en diagonal por la mitad para dar dos porciones. Deja la carne a un lado una vez cocida y mantenla caliente para servir.", "Agregue los lardons y chalotes a la sartén y freír suavemente durante 10 minutos, o hasta que los chalotes estén tiernos, pero no dorados. Agregue el tomillo y el jerez (o vino) y hiérvalos durante unos minutos, o hasta que el volumen del líquido se haya reducido en un tercio.", "Derrita la mantequilla en una olla pequeña, agregue la harina y cocine por un minuto, o hasta que espese. Vierta gradualmente en 500ml / 18fl oz de la acción, revolviendo hasta que espese. Vierta la salsa en la sartén con los lardons y las cebollas.", "Cuele los champiñones empapados a través de un colador, reservando el agua. Picar los champiñones finamente y agregarlos a la salsa con el agua de remojo. Agregue los champiñones frescos.", "Cocine por cinco minutos, o hasta que los champiñones estén tiernos. Sazone al gusto. Agregue la crème fraiche, espolvoree con perejil. Sirva la gallina de Guinea con la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_guinea_fowl_with_bacon_26194", "title": "Aves de Guinea con porcini y lardons", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ de cebolla, más o menos picada", "½ palo de apio, aproximadamente picado", "½ zanahoria, más o menos picada", "1 hoja de laurel", "125ml / 4fl oz de vino tinto", "menudillos de las pintadas", "1 gallina de Guinea (alrededor de 1.2-1.5kg / 2lb 12oz-3lb 5oz)", "aproximadamente 250 g / 9 oz de mantequilla", "1 cebolla pequeña o 1 chalote de plátano, pelado y finamente picado", "2 dientes", "3 hojas frescas de laurel", "1,2 litros / 2 pintas de leche entera", "½ pan blanco de buena calidad", "200ml / 7fl oz jus (ver arriba)", "2 cucharadas de aceite de oliva", "Castillo de 250 g / 9 oz", "Repollo negro de 250 g / 9 oz"], "method": ["Para el jus, precaliente el horno a 150C / 300F / Gas 2. Coloque todos los ingredientes junto con 250ml / 9fl de agua en una olla pequeña con tapa. Coloque un trozo de grasa sobre los ingredientes y coloque una tapa en la parte superior.", "Cocine en el horno por dos horas. Retire del horno y pase el jus a través de un colador.", "Para las gallinas de Guinea, con un cordón de cocina, ate las patas delante del ave y sazone con sal y pimienta.", "En una cacerola grande, derretir 150 g / 5½ oz de la mantequilla y dorar el ave a fuego moderado hasta que se dore bien por completo, rociando con la mantequilla marrón sobre la marcha.", "Coloque el ave en un salvamanteles encima de una lata de asar y cocine en el horno a 150 ° C / 300 ° F / Gas 2 durante aproximadamente 35 minutos, o hasta que los jugos salgan claros cuando se perforan con un pincho.", "Freír la cebolla en 50 g / 1¾ oz de la mantequilla en una sartén, agregar los dientes de ajo, las hojas de laurel y la leche, llevar a fuego lento y reservar.", "Retire las costras del pan y mezcle las costras en las migas de pan en un procesador de alimentos. Deja de lado el blanco del pan por ahora.", "Espolvoree las migas en la bandeja del horno, salpique con todo menos un trozo de la mantequilla restante y cocine durante 10 minutos.", "Corta la miga blanca del pan restante, agrégala a la leche infundida y quita los dientes y las hojas de laurel. Regrese a fuego lento y no revuelva. Agregue un poco de mantequilla y déjela cocer a fuego lento.", "Saque el pájaro del horno, cúbralo y déjelo reposar durante 20 minutos en un lugar cálido. Coloque la lata a fuego medio y agregue el jus. Deje que burbujee, revolviendo todo el tiempo para eliminar cualquier sedimento de carne en la bandeja.", "Calentar el aceite en una sartén por separado y freír la col rizada y el cavolo nero hasta que estén tiernos. Condimentar con sal y pimienta.", "Bata la salsa de pan y luego espárcela en cada plato. Sirve algunos verdes al lado. Esculpe el pájaro y colóquelo sobre el repollo, espolvoree el jugo para asar y sirva las migas de pan tostado a un lado."], "url": "www_bbc_co_uk_food_recipes_guinea_fowl_with_bread_78715", "title": "Aves de Guinea con salsa de pan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 poussin o pequeñas pintadas, que pesan alrededor de 450 g / 1 lb cada una", "80g / 3oz de mantequilla", "sal y pimienta negra recién molida", "200g / 7oz de cebada perlada", "2 cucharadas de aceite de oliva", "1 chalote, finamente picado", "100 g / 3 oz de ciruelas secas y secas", "100g / 3oz de nueces tostadas, picadas", "3 cucharadas de perejil fresco, picado", "2 cucharadas de melaza de granada", "½ limón, jugo y ralladura finamente rallada", "150ml / 5fl oz de vino blanco seco", "100ml / 4fl oz de jugo de granada"], "method": ["Cocine la cebada perlada en una olla de agua hirviendo durante unos 20 minutos, hasta que esté suave. Escurrir y poner a un lado.", "Precalentar el horno a 180C / 350F / Gas 4.", "Enjuague las poussin o las pintadas con agua corriente fría y seque cuidadosamente.", "Para el relleno, caliente el aceite de oliva en una sartén pesada y cocine la chalota y las guindas durante unos minutos hasta que las cerezas estén llenas y jugosas.", "Agregue la cebada perlada cocida y continúe cocinando por 2-3 minutos.", "Agregue las nueces tostadas, el perejil, la melaza de granada y el jugo y la ralladura de limón. Revuelva bien y deje que se enfríe.", "Una vez que el relleno se haya enfriado, úselo para rellenar las cavidades de las aves, dividiéndolo equitativamente entre las dos. No te preocupes si el relleno se derrama.", "Unte la parte exterior de las aves con mantequilla y espolvoree con sal y pimienta negra recién molida.", "Coloque los pájaros en una bandeja grande para asar y agregue el vino y el jugo de granada. Asar durante 30-35 minutos o hasta que esté cocido, hilvanando a intervalos regulares.", "Cuando la poussin o la pintada estén cocidas, retírela del horno y déjela reposar durante 10 minutos. Tallar y servir con el relleno."], "url": "www_bbc_co_uk_food_recipes_guineafowlgeorgianst_76688", "title": "Estilo georgiano de Poussin", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 gallina de Guinea, cortada en trozos", "sal y pimienta negra recién molida", "harina simple para espolvorear", "150ml / 10 cucharadas de aceite de oliva extra virgen", "4 dientes de ajo, cortados longitudinalmente", "gran manojo de romero, partido por la mitad", "150ml / 5fl oz de vino blanco", "pocas rebanadas de pan", "dientes de ajo"], "method": ["Sazone los trozos de gallina de Guinea con sal y pimienta y cúbralos con harina común.", "En una sartén grande de base pesada, caliente el aceite de oliva virgen extra. Cuando esté caliente, agregue las pintadas enharinadas y selle bien por todos los lados hasta que estén doradas y crujientes.", "En esta etapa, reduzca el fuego a bajo, agregue el ajo y el romero, cubra con una tapa y cocine por 30 minutos, volteando la carne de vez en cuando.", "Después de 30 minutos, aumente el fuego a alto, quite la tapa, agregue el vino blanco (si lo desea, podría flamear las aves ahora) o deje que se evapore.", "Para hacer la bruschetta, cuando la gallina de Guinea esté lista, tuesta unas rebanadas de pan. Frote inmediatamente un poco de ajo y rocíe un poco del aceite de oliva de la salsa de gallina de guinea. Sirva la gallina de Guinea con rebanadas de bruschetta."], "url": "www_bbc_co_uk_food_recipes_guineafowlwithgarlic_14050", "title": "Gallina de Guinea con ajo y romero servido con bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 ramita pequeña de tomillo fresco", "4 dientes de ajo, sin pelar y ligeramente triturados", "1 gallina de Guinea grande, que pesa alrededor de 1,5 kg / 3 lb 5 oz", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva ligero", "100 ml / 3 fl oz oz Madeira o puerto", "250ml / 9fl oz de pollo marrón o caldo de carne", "2 cucharadas de mantequilla", "½ cucharadita de hojas frescas de tomillo", "½ cucharada de perejil fresco, picado", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "250 g / 9 oz de setas, como los mízcalos, shiitake", "sal", "1 repollo savoy", "pizca de nuez moscada"], "method": ["Precaliente el horno a 200C / 400F / Gas 6.", "Coloque el tomillo y el ajo dentro de las pintadas y sazone por dentro y por fuera.", "Calienta dos cucharadas de aceite en una lata para asar en el horno. Coloque las gallinas de Guinea de lado en la lata y tueste durante 10 minutos.", "Coloque la gallina de Guinea en su otro lado y continúe asando por otros 10 minutos. Levante el lado de la pintada con la pechuga de gallina hacia arriba, baje la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y ase durante 20 minutos.", "Retire la gallina de Guinea del horno, transfiérala a un plato limpio, cúbrala con papel de aluminio y déjela reposar durante 15 minutos. Para hacer la salsa, vierta la grasa de la bandeja de asar y desglasar la sartén con Madeira o el puerto. Incline los jugos en una cacerola y agregue el caldo. Hierva hasta que se reduzca a la mitad.", "Calentar una sartén grande a fuego alto, agregar el aceite restante y freír los champiñones con un poco de sal durante 3-4 minutos. Incline sobre una bandeja de asar.", "Corta las piernas de la gallina de Guinea y colócalas en la bandeja de asar con los champiñones. Corta el lado del esternón y quita los senos. Coloque en la bandeja de asar.", "Para servir, caliente los champiñones y las pintadas en el horno durante 3-4 minutos. Mientras tanto, lleva la salsa a ebullición, luego agrega la mantequilla y las hierbas. Sazone al gusto.", "Calentar una sartén hasta que esté caliente. Agregue la mantequilla y la col. Sofría hasta sazonar la temporada con sal, pimienta y nuez moscada.", "Coloque un poco de repollo y algunas setas en cada plato calentado. Cubra con las gallinas de Guinea y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_guineafowlwithwildmu_77765", "title": "Gallina de Guinea con setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400ml / 14fl oz de leche entera", "100ml / 3½ fl oz crema doble", "1 vaina de vainilla, dividida por la mitad a lo largo, semillas raspadas con un cuchillo afilado", "6 yemas de huevo de gallinas camperas", "Azúcar en polvo de 65 g / 2¼ oz", "2 cucharadas de jengibre molido", "125 g / 4½ oz de crema", "Crema doble 125ml / 4½fl oz", "2 cucharaditas de jarabe de jengibre, de un tarro", "Harina normal 225g / 8oz", "2 cucharaditas de jengibre molido", "pellizcar canela molida", "pizca de tierra mezcla de especias", "pizca de sal", "85g / 3oz de mantequilla, derretida, más extra para engrasar", "Jarabe dorado de 225g / 8oz", "55g / 2¼ oz de azúcar demerara", "1 huevo de gallinas camperas", "4 cucharaditas de leche", "100 g / 3½ oz de pastel de jengibre, cortado en cubos (ver arriba)", "azúcar en polvo, para quitar el polvo", "1 pera pequeña y firme, pelada, sin núcleo, en cubitos", "1 pieza de tallo de jengibre (de un tarro), finamente picado", "1 x 440 ml puede stout irlandés", "1 x botella de 500 ml de ginger ale picante"], "method": ["Para el helado de jengibre, hierva la leche, la crema y las semillas de vainilla en una cacerola. Batir las yemas de huevo y el azúcar en un bol hasta que estén pálidas y esponjosas.", "Cuando la mezcla de crema esté hirviendo, viértala sobre la mezcla de yema de huevo, batiendo continuamente para combinar.", "Regrese la mezcla de crema a la cacerola y cocine a fuego medio, revolviendo constantemente, hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. Cuele la crema en una jarra y mezcle el jengibre molido. Dejar de lado para enfriar. Una vez frío, enfría la crema en la nevera.", "Transfiera la crema refrigerada a una máquina de helados y batir según las instrucciones del fabricante hasta que se endurezca. Congelar hasta que sea necesario.", "Para la crema, mezcle todos los ingredientes de la crema en un tazón grande hasta que estén bien combinados. Enfríe por al menos 30 minutos.", "Para la tarta de jengibre, precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Engrase una lata de rollo suizo de 35x25 cm con mantequilla.", "En un tazón grande, mezcle los ingredientes secos hasta que estén bien combinados. En un recipiente aparte, mezcle la mantequilla derretida, el jarabe y el azúcar hasta que estén bien combinados. En un tercer tazón, mezcle el huevo y la leche.", "Mezcle la mezcla de huevo, los ingredientes secos y la mezcla de jarabe juntos hasta que estén bien combinados, luego vierta la mezcla de torta en la lata preparada. Hornee en el horno durante 8-10 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio. Cortar aproximadamente 100 g / 3½ oz de la torta de jengibre en cubos pequeños.", "Para el crumble, coloca los cubitos de pastel de jengibre en azúcar glas y colócalos en una bandeja para hornear. Hornee en el horno por 2-3 minutos, o hasta que el azúcar se derrita y caramelice y la torta esté ligeramente tostada. Retire del horno y reserve.", "En un tazón, mezcle la pera y el jengibre confitado hasta que estén bien combinados. Justo antes de servir, mezcle la mezcla de pera con la torta de jengibre tostado.", "Para servir, espolvorea parte de la mezcla de crumble en el fondo de un tazón grande de vidrio o 4 tazones de vidrio individuales. Cubra con algunos de los helados de jengibre. Cubra el helado con una capa de la mezcla de crema. Rocíe sobre la Guinness y la cerveza de jengibre (es posible que no necesite usar todos los líquidos). Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_guinness_and_ginger_72284", "title": "Guinness y jengibre flotan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina normal", "1 cucharadita de copos de sal marina", "1 cucharadita de pimienta negra recién molida", "1kg / 2lb 3oz stewing steak, cortado en trozos", "2 cucharadas de aceite vegetal", "3 cebollas grandes, peladas, en rodajas", "1 cucharada de puré de tomate", "8 zanahorias, peladas y cortadas en discos", "2 palitos de apio, picados", "500ml / 17½fl oz de caldo de carne", "250ml / 9fl oz Irish stout", "1 cucharadita de semillas de comino", "1 cucharada de pasas", "20 castañas, cocidas y en rodajas", "2 cucharadas de perejil fresco picado, para servir", "1 kg / 2lb 3 oz de papas harinosas, como King Edward o Maris Piper, peladas y cortadas en trozos grandes", "Leche 250ml / 9fl oz", "500 g / 17½ oz puerros, lavados y cortados en rondas", "2 cucharadas de mantequilla", "1 cucharada de crema doble", "copos de sal de mar y pimienta blanca"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Para la cazuela, coloque la harina en una bolsa de plástico, agregue la sal marina y la pimienta negra recién molida y agite para mezclar. Agregue los trozos de bistec y mezcle para cubrirlos con la harina.", "Caliente una sartén grande a fuego alto y agregue el aceite vegetal. Dorar la carne en pequeños lotes, freír hasta que la carne esté dorada por todas partes. Transfiera cada baño de carne chamuscada a una cazuela y repita el proceso según sea necesario.", "Freír las cebollas en la sartén, cocinar la carne durante 2-3 minutos, o hasta que se ablanden, luego incorporar el puré de tomate y cocinar por otros dos minutos. Transfiera la mezcla a la cazuela.", "Agregue las zanahorias, el apio, el caldo de carne, la cerveza irlandesa, las semillas de alcaravea y las pasas a la cacerola y mezcle bien para combinar. Cubra la cacerola con una tapa y cocine en el horno durante dos horas, o hasta que la carne esté tierna.", "Agregue las castañas y cocine por otros 30 minutos.", "Mientras tanto, para el colcannon puerro, cocine las papas en una cacerola de agua hirviendo a fuego lento durante 15-20 minutos, o hasta que las papas estén tiernas. Escurra las papas y reserve.", "En una sartén por separado, llevar la leche a fuego lento y escalfar los puerros durante 4-5 minutos, o hasta que estén tiernos. Escurre los puerros, reservando algunas cucharadas de leche.", "Mash las patatas y doblar en la mantequilla y la crema. Agregue los puerros y algunas cucharadas de la leche reservada y aplaste juntos hasta que estén cremosos. Sazonar, al gusto, con sal marina y pimienta blanca.", "Para servir, coloca la cazuela de res en recipientes para servir y coloca al colcannon de puerros al lado."], "url": "www_bbc_co_uk_food_recipes_guinnessbeefandchest_93084", "title": "Cazuela de ternera, corpulenta y castaña con colcannon de puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de leche en polvo", "Harina común 110g / 4oz", "1/4 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "350 ml / 12 fl oz de leche", "25g / 1oz de mantequilla, derretida", "aceite vegetal, para freír", "200 g / 7 oz de azúcar en polvo", "100 ml / 3½ fl oz de agua", "algunas hebras de azafrán", "1 cucharada de nueces de pistacho picadas", "1 cucharada de almendras en copos, tostadas en una sartén"], "method": ["Para las bolas de masa, mezcle todos los ingredientes en un bol, agregando suficiente agua extra para formar una masa suave y pegajosa. Cubra con film transparente y déjelo a un lado durante 10 minutos. Forme la masa en pequeñas bolas redondas.", "Calentar el aceite en una sartén profunda de fondo pesado. Está listo cuando una migaja de pan se cuela suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las bolas hasta que estén doradas, luego retire del aceite con una espumadera y déjelo a un lado en el papel de cocina para drenar.", "Haga un jarabe de azúcar calentando el azúcar y el agua junto con el azafrán hasta que el azúcar se haya disuelto y la mezcla esté almibarada.", "Cuando las bolas de masa estén frías, agréguelas al almíbar y déjelas en remojo durante aproximadamente 1 hora.", "Adorne con pistachos picados y almendras en hojuelas y sirva."], "url": "www_bbc_co_uk_food_recipes_gulabjambu_81245", "title": "Baya rosada", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gulabjambu_81245_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "225 g / 8 oz de leche en polvo", "Harina común 110g / 4oz", "1/4 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "Crema doble 350ml / 12fl oz", "25g / 1oz de mantequilla, derretida", "75ml / 3fl oz de agua", "200 g / 7 oz de azúcar en polvo", "1 limón, solo jugo", "Fresas de 150g / 5oz, descascaradas", "Frambuesas 150g / 5oz", "4 cucharadas de azúcar glas"], "method": ["Precaliente el aceite vegetal en una freidora a 170C / 350F.", "Coloque la leche en polvo, la harina, el polvo de hornear y el bicarbonato de soda en un bol y mezcle para combinar.", "Agregue 100ml / 3½fl oz a la crema y mezcle bien.", "Agregue la mantequilla y tanta crema adicional como sea necesario para formar una masa suave y ligeramente pegajosa.", "Enrolle la masa en bolitas y colóquela cuidadosamente en la freidora. Freír por 2-3 minutos hasta que estén dorados y completamente cocidos. Con cuidado, retire las bolas cocidas con una cuchara ranurada y escurrir sobre papel de cocina.", "Para el almíbar, coloque el agua, el azúcar y el jugo de limón en una sartén a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 1-2 minutos.", "Coloque con cuidado las bolas de jamun en el almíbar y revuelva para cubrir completamente. Retire del fuego y deje que absorba el jarabe durante diez minutos.", "Para servir, coloque las fresas y las frambuesas en un tazón y espolvoree con el azúcar glasé, revolviendo suavemente para cubrir uniformemente.", "Coloque las fresas y las frambuesas en un plato de servir grande y cubra con el gulab jamun."], "url": "www_bbc_co_uk_food_recipes_gulabjamunandenglish_86415", "title": "Gulab jamun y frutas inglesas de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,5 litros / 2½ pintas de cerveza de jengibre / jengibre", "750ml / 1¼ pintas de jugo de naranja", "1 limón grande, jugo y ralladura", "2 naranjas, jugo y ralladura", "4 palitos de canela", "¼ cucharadita de nuez moscada rallada", "12 dientes", "Anís de 5 estrellas", "2.5cm / 1in de jengibre fresco, rallado"], "method": ["En una sartén grande, caliente suavemente el ginger ale y el jugo de naranja.", "Agregue todos los demás ingredientes. Llevar a ebullición, retirar del fuego y dejar durante unos minutos para permitir que los sabores se infundan. Servir."], "url": "www_bbc_co_uk_food_recipes_gunpowderplotpunch_14518", "title": "Golpe de pólvora", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de coco o aceite vegetal", "2 dientes", "10 Tellicherry o granos de pimienta negra ordinarios", "Corteza de cassia de 2.5 cm / 1 in (disponible en tiendas asiáticas y algunos supermercados)", "12 hojas de curry", "1 cucharadita de jengibre raíz recién rallado", "1 cebolla mediana, cortada en cubitos", "Harina normal de 50g / 2oz", "sal y pimienta negra recién molida, al gusto", "500 g / 1 lb 2 oz de muslos de pollo, sin hueso y en cubitos", "8-12 zanahorias baby, peladas, blanqueadas y picadas", "16-20 cebollas plateadas", "15 judías verdes picadas y blanqueadas", "1 cucharadita de cúrcuma molida", "½ cucharadita de cilantro molido", "2 cucharadas de harina sazonada", "Leche de coco 400ml / 14fl oz", "Hoja de hojaldre lista para hacer 110g / 4oz", "1 huevo de gallinas camperas, golpeado, para cepillar los pasteles", "1 cucharadita de semillas de cilantro", "½ cucharadita de semillas de comino", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de sésamo negro"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una sartén grande caliente el aceite antes de freír los dientes de ajo, la pimienta en grano, la corteza de cassia y las hojas de curry durante aproximadamente un minuto. Agregue el jengibre y la cebolla y cocine hasta que la cebolla esté transparente.", "Coloque la harina común en un bol con un poco de sal y pimienta negra recién molida, al gusto. Mezcle las piezas de pollo en la harina hasta que estén completamente cubiertas.", "Coloque las piezas de pollo en la sartén. Saltee el pollo brevemente, dorando por todos lados. Agregue las zanahorias, las cebollas de piel de plata, los frijoles y las especias y cocine durante aproximadamente un minuto. Agregue la harina sazonada y cocine durante 2-3 minutos más. Agregue la leche de coco y cocine a fuego lento durante otros cinco minutos antes de retirar la sartén del fuego. Deja enfriar.", "Coloque el relleno en una fuente para pastel hasta que el relleno llegue casi a la parte superior. En el centro del plato, coloque un embudo de tarta o una taza de huevo. Esto mantendrá la pastelería mientras se cocina.", "Sobre una tabla de cortar o una superficie limpia, extienda la masa para que sea ligeramente más grande que la circunferencia del plato para pastel. Use un poco de agua o leche para humedecer los bordes de la masa y colóquela sobre el plato de tarta. Pellizca los bordes firmemente para sellar los pasteles en el plato.", "Para la curvatura, use un mortero y una maja para aplastar el cilantro, el comino, el hinojo y las semillas de sésamo.", "Cepille la parte superior del pastel con el huevo batido antes de rociar la corteza de especias sobre la parte superior. Coloque el pastel en el horno y cocine durante 10-15 minutos o hasta que la masa esté dorada y crujiente en los bordes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gymkhanachickenpie_86568", "title": "Pastel de pollo Gymkhana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "2 cucharadas de azúcar glas", "75g / 2½oz de mantequilla sin sal, refrigerada, cortada en aproximadamente 1cm / ½ en cubos", "1 yema de huevo de gallinas camperas", "½ cucharadita de jugo de limón", "230ml / 8fl oz de leche condensada", "170ml / 6fl oz de leche evaporada", "175g / 6oz de azúcar mascabado ligero"], "method": ["Para hacer la masa, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Mezcle el huevo con el jugo de limón y una cucharada de agua. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola.", "Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie ligeramente enharinada hasta un grosor de aproximadamente 3 mm y úsela para revestir la lata de tarta, dejando el exceso de hojaldre colgando sobre el borde. Mantenga un poco de pasta cruda en caso de que necesite parchear las grietas más tarde.", "Alinee la caja de repostería con papel de hornear o papel de aluminio, y luego rellene con alubias, arroz crudo o lentejas. Hornee la persiana por 15 minutos, luego quite el pergamino y hornee los frijoles y devuelva la masa al horno por aproximadamente ocho minutos, o hasta que se vea seca y levemente coloreada.", "Con un cuchillo pequeño y afilado, corte el exceso de masa del borde de la lata. Use un poquito de la masa cruda reservada para parchear las grietas o agujeros si es necesario. Baje el horno a 190C / 375F / Gas 5.", "Para el relleno, ponga las dos leches y el azúcar en un tazón grande o en el tazón de una mezcladora independiente. Batir con un batidor eléctrico, comenzando lentamente y luego aumentando la velocidad, durante unos 10 minutos hasta que la mezcla se incremente en volumen, ligero y burbujeante.", "Vierta la mezcla en la caja de pastelería. Hornee por unos 30 minutos (revise después de 20 minutos), o hasta que esté listo y todavía un poco tambaleante en el centro. Retire del horno y deje enfriar en la lata antes de cortar y servir."], "url": "www_bbc_co_uk_food_recipes_gypsy_tart_81908", "title": "Tarta gitana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Filete de abadejo de 400g / 14oz, despellejado, sin espinas, cortado en tiras", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "3 huevos de gallinas camperas, golpeados", "600g / 1lb 6oz astillando patatas, peladas, cortadas en pedacitos", "3 yemas de huevo de gallinas camperas", "2 cucharadas de vinagre de sidra", "300ml / 11 fl oz aceite de colza", "110g / 4oz alcaparras", "150 g / 5 oz de pepinillos, picados", "½ chalota, finamente picada", "1 manojo pequeño de eneldo fresco, picado", "2 cucharadas de perejil de flatleaf fresco picado", "½ limón, solo jugo"], "method": ["Para los goujons y chips de eglefino, precaliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Espolvoree la harina y las migas de pan en platos separados y bata los huevos en un bol. Dragar las tiras de eglefino en la harina, luego sumergir en el huevo y cubrir en las migas de pan.", "Freír a fuego lento durante 3-4 minutos o hasta que estén doradas. (Puede necesitar hacer esto en lotes.) Retire de la freidora con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Agregue las papas a la freidora y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina. Sazonar con un poco de sal.", "Para la salsa tártara, mezcle las yemas de huevo y el vinagre en un tazón.", "Continúe batiendo la mezcla y vierta lentamente el aceite de colza hasta que se incorpore todo el aceite y la mezcla sea espesa y ligera.", "Agregue las alcaparras, pepinillos, chalotes y hierbas. Sazonar, al gusto, con sal y pimienta negra recién molida y un chorrito de jugo de limón.", "Para servir, apile las papas fritas y los goujons en los platos y espolvoree un poco de salsa tártara al lado."], "url": "www_bbc_co_uk_food_recipes_haddock_goujons_chips_57280", "title": "Pescado de eglefino, patatas fritas y salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de eglefino, aproximadamente 150 g / 5½ oz cada uno", "4 cucharadas de cilantro fresco picado", "1 chile rojo, picado", "1 chalote, en rodajas finas", "1 lima, rebanada, más mitades de lima extra para servir", "2 tallos de limoncillo, 1 toscamente picado y 1 golpeado", "300g / 10½oz de arroz basmati", "2 hojas de lima Kaffir frescas o secas", "50ml / 2fl oz de leche de coco reducida en grasa"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Corte 4 pedazos de papel para hornear antiadherente, cada uno de 30cm / 12 pulgadas cuadradas. Coloque un filete de eglefino en el centro de cada pieza y coloque el cilantro, el chile, el chalote, la lima y el tallo de limoncillo picado uniformemente sobre cada uno. Envuélvalos en paquetes limpios. Transfiera las parcelas a una bandeja para hornear y hornee durante 20 minutos.", "Pon el arroz en una sartén con tapa, cúbrelo con agua y llévalo a ebullición. Cocine a fuego lento con la tapa puesta durante 10 minutos, o hasta que el arroz esté suave. Cuando el arroz esté cocido y el agua absorbida, agregue la leche de coco.", "Sirva con el arroz junto con los paquetes de eglefino, con algunas mitades de lima extra."], "url": "www_bbc_co_uk_food_recipes_haddock_parcels_and_76666", "title": "Paquetes de eglefino y arroz de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/haddock_parcels_and_76666_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de eglefino ahumado sin piel sin hueso", "1 cucharada de crema fresca", "pizca de pimienta negra molida", "puñado de berros", "125g / 4½oz de masa de hojaldre"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 220C / 425F / Gas 8.", "Pídele a un adulto que te ayude a usar las tijeras para cortar el abadejo en trozos del tamaño de un bocado, revisando los huesos a medida que avanzas. Pon el pescado en un tazón y luego agrega la crème fraiche. Agregue una pizca de pimienta negra molida.", "Lavar el berro y secarlo en una toalla de té. Rasgue las hojas de los tallos y ponga en el tazón con la crème fraiche y el pescado. Revuelva y ponga el tazón a un lado.", "Harina su superficie de trabajo. Estire la masa de la superficie enharinada en un rectángulo, de aproximadamente 5 mm de grosor y aproximadamente 15 mm x 21 mm / 6 pulgadas x 8 pulgadas (aproximadamente del tamaño de una hoja de papel A5).", "Con la masa colocada con el borde corto más cercano a usted, coloque la mezcla de pescado en la mitad inferior del rectángulo, dejando un borde de 1 cm / ½ pulgada alrededor de los bordes. Cepille los bordes de la masa con un poco de agua, esto los ayudará a mantenerse unidos. Traiga la mitad superior de la masa para cubrir la mezcla como un sobre. Doble y presione los bordes juntos firmemente con sus dedos. Recorte los bordes con un cuchillo de mesa y haga una pequeña abertura en la parte superior para dejar salir el vapor.", "Pídale a un adulto que ponga el paquete en una bandeja para hornear con papel de hornear y hornee de 25 a 30 minutos o hasta que se dore. Sirva con bastones de zanahoria y tomates cherry."], "url": "www_bbc_co_uk_food_recipes_haddock_puff_63743", "title": "Abadejo, abadejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de abadejo ahumado sin teñir 200 g / 7oz, sin piel", "25ml / 1fl oz de jugo de limón", "25ml / 1fl oz de aceite de oliva", "½ cucharadita de granos de pimienta rosa, triturados", "2 cucharaditas de eneldo fresco picado", "200 g / 7oz de carne de cangrejo blanco cocido", "75 g / 3 oz de apionabo, pelado, finamente picado", "½ manzana Granny Smith, con piel, sin núcleo, finamente picada", "75g / 3oz de mayonesa lista para usar", "30g / 1½ oz de crema", "1 limón, solo jugo", "1 cucharadita de perejil fresco picado", "2 cestones micro greens", "1 ciabatta, cortado en rodajas de 3-5 mm de espesor", "2 cucharadas de aceite de oliva", "2 ramitas de tomillo fresco, solo hojas"], "method": ["Para el 'ceviche' de eglefino, corte los extremos finos del filete de abadejo ahumado (reserve estas piezas para otra receta) y corte el filete grueso restante en rebanadas delgadas (2-3 mm de espesor). Divida las rebanadas por igual entre los cuatro platos y déjelos a un lado.", "Coloque el jugo de lima, el aceite de oliva, los granos de pimienta rosa triturados y el eneldo en un bol, mezcle bien y reserve.", "Para la ensalada de cangrejo, mezcle el apionabo, la manzana, la mitad de la mayonesa, la crema fresca y el jugo de limón en un bol hasta que estén bien combinados. Agregue la carne de cangrejo, el perejil picado y la mayonesa restante, mezclando suavemente hasta que se combinen.", "Coloque un anillo de chefs de 5cm / 2in en uno de los platos de servir, al lado de las rodajas de eglefino y cuchara en un cuarto de la mezcla de ensalada de cangrejo. Retire el anillo y repita con la mezcla restante, colocando una porción de ensalada de cangrejo en cada plato. Adorne cada ensalada de cangrejo con los micro greens.", "Para la chapata, precaliente el horno a 210C / 425F / Gas 7.", "Coloque las rebanadas de ciabatta en una bandeja para hornear y rocíe con aceite de oliva. Sazonar con sal y pimienta negra recién molida y espolvorear sobre las hojas de tomillo. Hornee en el horno durante 4-5 minutos o hasta que estén dorados y crujientes.", "Mientras tanto, rocíe la mezcla de jugo de limón sobre el eglefino unos minutos antes de servir.", "Para servir, coloque las rebanadas de ciabatta tostadas junto a la ensalada de cangrejo y el 'ceviche' de abadejo."], "url": "www_bbc_co_uk_food_recipes_haddockcevichewithcr_92452", "title": "Eneldo 'ceviche' con ensalada de cangrejo y chapata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla, finamente rebanada", "2 dientes de ajo, triturados y picados", "250ml / 9fl oz pasado", "200ml / 7fl oz de vino tinto", "100ml / 3½fl oz de caldo de pescado", "Aceitunas negras de 100 g / 3½ oz, sin piedras", "2 cucharadas de estragón fresco picado", "1 pimiento verde, muy finamente cortado", "sal y pimienta negra recién molida", "4 x 150g / 5oz de filetes de eglefino", "3 cucharadas de harina, para quitar el polvo", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "patatas salteadas", "4 tomates, sin semillas, desollados y picados"], "method": ["Para la salsa, derrita la mantequilla en una sartén a fuego alto. Agregue la cebolla y el ajo y fría hasta que se ablanden.", "Agregue la passata, el vino y el caldo y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 15-20 minutos.", "Agregue las aceitunas, el estragón y el pimiento verde y sazone al gusto con sal y pimienta negra recién molida.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para el eglefino, drague los filetes de eglefino en la harina y sazone con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén a fuego medio. Agregue el pescado y fría por 1-2 minutos en ambos lados, hasta que se dore por todas partes.", "Transfiera los filetes de eglefino a un plato resistente al horno y vierta sobre la salsa. Coloque en el horno para cocinar durante 8-10 minutos, o hasta que el eglefino esté bien cocido.", "Para servir, coloque un filete de eglefino en cada uno de los cuatro platos y espolvoree la salsa. Sirva con papas salteadas y espolvoree con tomates frescos picados."], "url": "www_bbc_co_uk_food_recipes_haddockwithprovencal_89234", "title": "Abadejo con salsa provenzal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 estómago de oveja o secum de buey, limpiado y completamente escaldado, revuelto y empapado durante la noche en agua fría con sal", "corazón y pulmones de un cordero", "450 g / 1 libra de carne de res o cortes de cordero, grasa y magra", "2 cebollas, finamente picadas", "225 g / 8 oz de harina de avena", "1 cucharada de sal", "1 cucharadita de pimienta negra molida", "1 cucharadita de cilantro seco molido", "1 cucharadita de macis", "1 cucharadita de nuez moscada", "agua, suficiente para cocinar los haggis", "stock de pulmones y adornos"], "method": ["Lave los pulmones, el corazón y el hígado (si está usando). Colocar en una olla grande de agua fría con los restos de carne y llevar a ebullición. Cocine por alrededor de 2 horas.", "Cuando esté cocido, cuele el caldo y deje el caldo a un lado.", "Pica los pulmones, el corazón y los adornos.", "Ponga la mezcla picada en un recipiente y agregue las cebollas finamente picadas, la avena y el condimento. Mezcle bien y agregue suficiente material para humedecer la mezcla. Debe tener una consistencia suave y desmenuzable.", "Coloca la mezcla en el estómago de la oveja, por lo que está medio lleno. Coser el estómago con hilo fuerte y pinchar un par de veces para que no explote durante la cocción.", "Ponga los haggis en una olla con agua hirviendo (suficiente para cubrirlo) y cocínelos durante 3 horas sin tapa. Siga agregando más agua para mantenerlo cubierto.", "Para servir, corte los haggis y saque el relleno. Sirva con neeps (puré de nabo o nabo) y tatties (puré de papas)."], "url": "www_bbc_co_uk_food_recipes_haggis_66072", "title": "Haggis", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]