[{"isVegetarian": false, "title": "Mussels marinière", "url": "www_bbc_co_uk_food_recipes_mussels_marinere_00294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz fresh mussels ", "2 tbsp olive oil", "1 shallot, finely chopped ", "2 garlic cloves, chopped ", "150ml/5fl oz white wine", "2 sprigs thyme", "150ml/5fl oz double cream", "small bunch flat leaf parsley, chopped ", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by thoroughly scrubbing them under plenty of running water, pulling away and discarding the 'beards', the seaweed-like stringy threads. Discard any broken mussels, and any mussels that don't close tightly when you tap them. ", "Heat the olive oil in a heavy pan with a tight-fitting lid. Add the shallot and garlic and cook over a medium heat until softened, but not coloured.", "Add the wine and turn up to a high heat. As the wine starts to boil, add the cleaned mussels and thyme to the pan. Turn the heat down to low. ", "Put the lid on the pan and allow the mussels to steam. Cook for about 4-5 minutes, lifting the lid from time to time to check - you will know they are cooked when the shells have opened. Discard any mussels that remain closed.", "Add the double cream and cook for a further minute.", "Scatter with the chopped parsley and serve in deep bowls."]}, {"isVegetarian": false, "title": "Mussels ‘Rockefeller’ style", "url": "www_bbc_co_uk_food_recipes_mussels_rockefeller_21768", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_rockefeller_21768_16x9.jpg", "ingredients": ["30g/1oz butter", "2 small shallots, finely chopped", "1 celery stick, peeled and chopped", "1kg/2lb 4oz mussels, cleaned and de-bearded", "30ml/1fl oz pastis", "200ml/7fl oz dry sherry", "200g/7oz spinach ", "10g/¼oz fresh parsley leaves, chopped", "2 sprigs fresh tarragon, leaves only", "2-3 drops Tabasco"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and blanch the spinach for 30 seconds. Drain the spinach, rinse it under cold water, squeeze and pat dry.", "Melt the butter in a large saucepan and gently fry the shallots and celery until softened. Tip in the mussels, increase the heat until the sound of sizzling emanates from beneath, then add the pastis and sherry. Shake the saucepan once steam appears, place back onto the heat, and continue cooking for a further 1-2 minutes. ", "Once all the shells are fully open, immediately strain into a colander suspended over a bowl. Shake the mussels to extract the juices and set aside. ", "Pour the juices into a blender along with the reserved spinach and other remaining ‘Rockefeller’ ingredients. Blend until smooth and return the green sauce to the mussel cooking pot. ", "Remove the empty half shell from all the mussels and add the full halves to the green sauce. Briefly reheat and serve."]}, {"isVegetarian": false, "title": "Mussels with bacon and pastis", "url": "www_bbc_co_uk_food_recipes_mussels_with_bacon_and_43156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, cubed", "2 celery sticks, chopped", "1 onion, chopped ", "6 slices smoked bacon, cut into lardons", "1 garlic clove, chopped", "1 tsp curry powder", "1 pinch of whole grated nutmeg", "75ml/2½fl oz pastis", "500g/1lb 2oz large mussels", "200ml/7fl oz double cream", "1 lemon, juice only", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives ", "crusty bread, to serve "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels. Remove any beards and rinse under plenty of cold, running water. Discard any open ones that won't close when lightly squeezed.", "In a large, lidded saucepan, heat the butter and gently fry the chopped celery, onion and lardons. Stir in the garlic and spices. Stir and cook for a few minutes then add the pastis. ", "Add the mussels and put the lid on the pan. Steam the mussels until they open taking care not to overcook. Remove the mussels with a slotted spoon and put them into a serving bowl. Discard any mussels that have not opened.", "Turn up the heat and cook to reduce the sauce to a third of the volume before adding the cream. Bring to boil then add lemon juice and pour over mussels. ", "To serve, spoon the mussels into large serving bowl and scatter over the fresh herbs."]}, {"isVegetarian": false, "title": "Mussels with Bayonne ham and shallots", "url": "www_bbc_co_uk_food_recipes_mussels_with_bayonne_ham_91522", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_with_bayonne_ham_91522_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz mussels", "100ml/3½fl oz dry white wine", "50g/1¾oz butter ", "1 shallot, finely chopped", "75g/2½oz Bayonne or prosciutto ham, finely chopped", "1 garlic clove, grated or chopped very finely", "1 handful mixed flatleaf parsley, tarragon, chervil and chives, chopped", "freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean and debeard the mussels. If any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them. ", "Add 2 tablespoons wine to a large lidded saucepan. Add the mussels, cover with the lid and cook over a high heat for 3-4 minutes, shaking the pan periodically until they have opened (discard any that do not open). Remove from the heat and strain into a colander over a large bowl. Reserve the cooking liquor and keep the mussels warm. ", "In the same pan, melt the butter and gently cook the shallot, ham and garlic for 4-5 minutes, until softened but not browned. Add the mussel cooking liquor and remaining wine. Bring to a boil and cook until the volume of liquid has reduced by half. Add the mussels and herbs and mix well, then season with black pepper. ", "Serve in warmed bowls with some crusty bread. "]}, {"isVegetarian": false, "title": "Mussels with sparkling wine", "url": "www_bbc_co_uk_food_recipes_mussels_with_sparkling_09137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.75kg/4lb (4 pints) mussels", "2 shallots, chopped", "1 fennel bulb, finely sliced", "300ml/½ pint English sparkling dry white wine", "2 tbsp chopped fresh parsley", "150ml/1/4 pint double cream", "½ lemon, juice only", "25g/1oz unsalted butter", "1 tbsp fennel leaves (or dill), chopped ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels thoroughly, removing the beards, and discard any that are cracked, or remain open after you tap them sharply against the edge of the sink. Transfer to a large, heavy-bottomed pan with lid.", "Add the shallots, fennel, wine and half the parsley. Cover with a lid and cook over a fierce heat for 6-7 minutes, or until all of the mussels have opened.", "Lift the mussels out into a colander set over a bowl. Carefully strain the cooking liquor through a clean tea-towel into a separate clean bowl and allow to stand for five minutes so that any sand sinks to the bottom. Discard the vegetables.", "Pour the liquor into a clean pan, taking care not to disturb any sand at the bottom. Add any liquor from the bowl below the mussels. Add the cream and lemon juice, and boil to reduce by half. Add the butter and remaining parsley, and adjust the seasoning.", "Meanwhile, discard any mussels that remain closed. Divide them between four soup plates, pour the sauce over, sprinkle with fennel leaves (or dill) and serve immediately."]}, {"isVegetarian": false, "title": "Mussels and jamon with sherry", "url": "www_bbc_co_uk_food_recipes_musselsandjamonwiths_71469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb mussels", "2 tbsp olive oil", "half onion, finely chopped", "2 thick or 5 thin slices jamon or prosciutto, diced", "100ml/3½fl oz dry white wine", "3 tbsp sherry"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Scrub the mussels well, then yank out the little beards and discard.", "Heat the oil in a heavy frying pan and cook the onion for five minutes until soft.", "Add the ham, white wine and sherry and bring to the boil. Add the mussels and clamp the lid on tightly.", "Allow to boil for one minute, then give the pan a big shake, remove the lid, and use a pair of tongs to remove the mussels as they open. When all the mussels have opened ( discard any which do not), return them to the pan and toss well in the sauce  and transfer to a large platter. ", "Serve warm or at room temperature."]}, {"isVegetarian": false, "title": "Mussels in a saffron white wine sauce", "url": "www_bbc_co_uk_food_recipes_musselsinasaffronwhi_86539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "40g/1½oz shallots, chopped ", "pinch of saffron strands ", "1 bay leaf", "1 sprig fresh thyme ", "1 sprig fresh tarragon", "200ml/7fl oz white wine", "100ml/3½fl oz double or whipping cream ", "200ml/7fl oz fish stock ", "1.5kg/3lb 5oz mussels, washed and cleaned - discard any that don't close when tapped ", "salt and freshly ground black pepper, to taste"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan, melt the butter. Add the shallots and cook until they are soft and translucent. Add the saffron, bay leaf, thyme, tarragon and white wine and bring to the boil.", "Once the mixture has reduced by half, add the cream and fish stock to the pan and bring back to the boil. Add the mussels and place a lid over the pan. ", "Once the mixture has returned to the boil and the mussels have opened, strain the mussels in a colander over a pan to collect the sauce. Discard any mussels that have not opened.", "Gently heat the sauce until it has reduced further and season with salt and freshly ground black pepper.", "To serve, place the mussels into a bowl and pour the reduced sauce over them."]}, {"isVegetarian": false, "title": "Mussels marinara", "url": "www_bbc_co_uk_food_recipes_musselsmarinara_86888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, crushed", "½ red chilli, seeds removed and finely chopped", "1 large vine tomato, chopped", "6tbsp dry white wine", "salt and freshly ground black pepper", "110g/4oz mussels, beards removed (discard any opened mussels that don't close when tapped firmly)", "1 lemon, cut into 4 wedges"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and fry the garlic, chilli and tomato for two minutes. Add the wine and simmer until the sauce has reduced by half.  Season with salt and freshly ground black pepper.", "Add the mussels and cover with a lid.  Simmer in the liquid for 3-4 minutes until the shells have opened. Discard any mussels with shells that have not opened. Squeeze over the juice from one lemon wedge.", "Lift out the mussels, arrange in a shallow bowl and spoon over the sauce. Garnish with the remaining lemon wedges to serve."]}, {"isVegetarian": false, "title": "Mussel skewers on French bread barrel", "url": "www_bbc_co_uk_food_recipes_musselskewersonfrenc_10300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb mussels, cleaned - scrubbed with beards removed", "2 shallots, finely chopped", "2 cloves garlic, finely chopped", "1 bunch basil, picked", "200ml/7fl oz dry white wine", "50g/2oz butter", "1 large or 2 small part baked baguettes", "2 plum tomatoes, skinned, de-seeded and diced", "30 wafer thin slices pancetta (approx 175g/6oz), cut in half ", "175g/6oz mozzarella, grated", "black pepper to season"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large saucepan.", "Add the chopped garlic and shallots and saute (without colour) for one minute.", "Add the drained mussels (discard any that are already open), half the basil, white wine and freshly milled black pepper.", "Bring to the boil over a high heat and then immediately cover and cook for 4 minutes.", "Remove mussels from pan with a slotted spoon and strain off the liquid through a fine sieve into a saucepan.", "Simmer this liquid for 10 minutes over a low heat.", "After 10 minutes add the rest of the basil, chopped and the tomatoes, leave to infuse over a low heat for a further 8 minutes, keep warm.", "In the meantime remove mussels from their shells, discard any that haven t opened.", "Place each mussel on a piece of the sliced pancetta and roll up. Skewer horizontally onto wooden skewer and repeat until you have 10 mussels on each skewer.", "Place the skewered mussels on a baking sheet.", "Take the baguettes and cut into 6 x 8cm/3¼in barrels. Carefully remove the centres from each leaving ½cm/¼in perimeter around the sides and base. Place on a baking tray and bake as directed on packet, reducing cooking time by 3 minutes.", "Place mussel skewers under a preheated grill and cook for 2 minutes on either side under a medium heat.", "Sprinkle with mozzarella and flash under the grill for a further minute or until the cheese begins to melt.", "Remove bread from the oven and place in deep serving dishes.", "Pour mussel juice into the centre of the up-right barrel of bread and place skewer of mussels across the top. Serve at once."]}, {"isVegetarian": false, "title": "Mussels with coconut crumb crust", "url": "www_bbc_co_uk_food_recipes_musselswithcoconutcr_88894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz brioche crumbs (you can make your own by blending a brioche in a food processor)", "100g/3½oz desiccated coconut, toasted in a dry frying pan", "1 tbsp chopped fresh coriander", "1 tbsp softened butter", "1 red chilli, finely chopped", "1 clove garlic, crushed to a paste with a pinch of salt", "salt and freshly ground black pepper", "12 green lip mussels, ready-cooked, bottom half of the shell on ", "1 pink grapefruit, peeled, segmented", "1 lime, juice only", "1 red chilli, finely chopped", "12 lychees from a can, drained, chopped", "splash Tabasco sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the brioche breadcrumbs, toasted coconut, coriander, butter, chilli, garlic and salt and freshly ground black pepper into a bowl and mix together well.", "Place the mussels, open-side up, onto a baking tray. Place a spoonful of the breadcrumb mixture into each mussel to cover the mussel flesh completely. Place under the grill and cook for 5-6 minutes, or until the topping is golden-brown. ", "For the salsa, place the grapefruit segments, lime juice, chilli, chopped lychees and Tabasco into a bowl and mix well. ", "To serve, place three mussels onto each plate and serve a dollop of salsa alongside."]}, {"isVegetarian": false, "title": "Mussels with dry coconut", "url": "www_bbc_co_uk_food_recipes_musselswithdrycoconu_86738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "1 small onion, finely chopped", "2-4 green chillies, whole", "thumb-sized piece fresh ginger, peeled and pounded into a paste in a pestle and mortar", "4 garlic cloves, peeled and pounded into a paste in a pestle and mortar ", "salt, to taste", "½tsp ground turmeric", "1 tbsp garam masala", "3 tomatoes, chopped into large cubes", "1kg/2¼lb mussels, scrubbed and de-bearded", "60g/2oz desiccated coconut", "handful fresh coriander leaves and stalks, chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a medium non-stick pan and fry the onion until golden brown. ", "Add the chillies, ginger and garlic pastes, salt, turmeric, garam masala and tomatoes and cook until the tomatoes have softened and start to break down. ", "Meanwhile, cook the mussels in a large pot of boiling water for about three minutes, until they have opened. Remove them with a slotted spoon and set aside. Reserve the water.", "Add the coconut, coriander and a splash of the cooking water to the spices and tomatoes and stir. The spice mixture should be thick enough to coat the mussels and enter the shells.", "Remove some of the mussels from their shells and leave others in their shells, for a dramatic and appetising effect. Add the mussels to the spice mixture and stir thoroughly. Serve with basmati rice."]}, {"isVegetarian": false, "title": "Mussels with fried artichokes", "url": "www_bbc_co_uk_food_recipes_musselswithfriedarti_84375", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz cooked artichokes from a jar, drained", "50g/1¾oz flour", "500ml/18fl oz vegetable oil", "50g/1¾oz cooked mussels, shells removed", "1 tbsp olive oil", "1 clove garlic", "½tsp white wine vinegar ", "½tsp white wine ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the artichokes, toss the artichokes in the flour and shake off any excess.", "Heat the oil in a heavy-bottomed pan (CAUTION: hot oil can be dangerous, do not leave unattended). When hot add the artichokes and fry until crisp and golden. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To make the vinaigrette, place all the vinaigrette ingredients into a bowl and mix together.", "To serve, arrange the artichokes and cooked mussels on a plate, season, and spoon over the vinaigrette."]}, {"isVegetarian": false, "title": "Mussels with parsley and chilli risotto", "url": "www_bbc_co_uk_food_recipes_musselswithparsleyan_88585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "½ red chilli, chopped", "100g/3½oz long grain rice", "85ml/3fl oz white wine", "200ml/7fl oz hot vegetable stock", "85g/3oz cherry tomatoes, halved", "2 tbsp chopped fresh parsley", "25g/1oz butter", "salt and freshly ground black pepper", "1 tbsp olive oil", "100g/3½oz mussels, cleaned - discard any which do not close when tapped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the risotto, heat the oil in a large heavy-bottomed saucepan, add the onion and fry over a low heat until softened but not coloured.", "Add the garlic and chilli and fry for one minute.", "Add the rice and stir over a gentle heat until the rice grains turn translucent.", "Add the wine, turn up the heat and boil until almost all of the liquid has disappeared. Add the vegetable stock, one ladleful at a time, and stir constantly until all the stock has been absorbed and the rice is tender.", "Stir in the tomatoes, parsley and butter and season, to taste, with salt and freshly ground black pepper. Take off the heat, cover with a lid and leave for 3-4 minutes.", "For the mussels, heat the olive oil in a large saucepan until very hot, add the mussels, cover with a lid and shake the pan over the heat until the mussel shells have opened. Discard any that are cracked or have not opened.", "To serve, spoon the risotto into a serving bowl, top with the mussels and serve."]}, {"isVegetarian": false, "title": "Mussels with lychee and coconut", "url": "www_bbc_co_uk_food_recipes_musselswithlycheeand_87249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 shallots, finely sliced ", "1 stalk lemongrass, lightly crushed ", "1 bird's-eye chilli, finely chopped ", "100ml/3½fl oz white wine", "450g/1lb mussels, washed and de-bearded (discard any mussels that remain open after washing)", "440ml/15½fl oz coconut milk", "150g/5oz lychees (fresh or canned; peel them if using fresh)", "salt and freshly ground black pepper", "1 tbsp chopped fresh coriander, to serve", "lime wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large non-stick pan with a lid. Add the shallots, lemongrass stalk and chilli and fry until softened but not coloured.", "Add the white wine to the pan and bring to a boil.", "Add the mussels, coconut milk and lychees. Cover the pan with a lid and give it a good shake.", "After 2-3 minutes, when the mussels have opened, season well with salt and freshly ground black pepper. Discard any mussels that haven't opened.", "To serve, spoon the mussels into bowls and garnish with the coriander sprinkled over the top and the lime wedges alongside."]}, {"isVegetarian": false, "title": "Mussels with pesto pasta", "url": "www_bbc_co_uk_food_recipes_musselswithpestopast_81621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "25g/1oz fresh basil leaves", "2 garlic cloves", "1 tbsp sesame seeds", "salt and freshly ground black pepper ", "150g/5½oz pasta of your choice, cooked according to packet instructions", "1 tbsp olive oil", "1 shallot, sliced", "50ml/2fl oz white wine", "200g/7oz fresh mussels in their shells, beards removed", "50g/1¾oz blue cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "To make the pesto pasta, place the oil, fresh basil, garlic cloves and sesame seeds into food processor. Season, to taste, with salt and freshly ground black pepper and blend to a smooth consistency.", "Place the pesto into a large bowl, add the cooked pasta and toss together to coat.", "For the mussels, heat the olive oil in a lidded saucepan over a medium heat. Add the garlic and shallots and sauté for two minutes, until softened.", "Add the mussels and white wine, stir well and place the lid on. Allow the mussels to steam for 3-4 minutes, then remove the lid and check that all the mussels are cooked and have opened. Discard any that have not opened.", "Select 10 large mussels, open them up and discard the empty half of the shell. Place the mussels on a baking tray, crumble over the blue cheese, season with salt and freshly ground black pepper and place under the grill for two minutes, until the cheese has melted.", "To serve, place the pasta in the centre of a warm plate and arrange the mussels around in their shells."]}, {"isVegetarian": false, "title": "Mussels with spaghetti", "url": "www_bbc_co_uk_food_recipes_musselswithspaghetti_85894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "400g/14oz mussels, cleaned (discard any that don't close when lightly tapped)", "½ shallot, finely chopped", "2 garlic cloves, finely chopped", "150ml/¼ pint white wine", "½ lemon, juice only", "2 tbsp chopped fresh dill ", "2 tbsp chopped fresh parsley ", "200g/7oz spaghetti, cooked according to packet instructions and drizzled with olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan until smoking hot, add the mussels and cook, shaking the pan frequently, until all the shells are open. Discard any that do not open.", "Add the shallot and garlic, turn down the heat and cook gently for 1-2 minutes.", "Add the wine and simmer for one minute, then add the lemon juice and herbs and cook for a further minute.", "Add the cooked spaghetti to the pan and stir well to coat.", "To serve, place into serving bowls."]}, {"isVegetarian": false, "title": "Mustard and lemon sausages with carrot mash", "url": "www_bbc_co_uk_food_recipes_mustard_and_lemon_49577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_and_lemon_49577_16x9.jpg", "ingredients": ["8 plump pork sausages", "2 tbsp grain mustard", "a tbsp smooth Dijon mustard", "3  heaped tbsp runny honey", "2 tbsp lemon juice", "750g/1lb 10oz carrots", "a large knob of butter "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Set the oven at  200C/400F/Gas 6. ", "Put the sausages in a roasting tin large enough to take them in a single layer. If they overlap, they won’t cook properly. ", "In a bowl mix the mustards, honey and lemon juice. Stir well and pour over all the sausages. Bake for 25-30 minutes, rolling the sausages over in the honey and mustard mixture once or twice during cooking, so that they eventually take on a sticky, glossy coat. ", "Meanwhile, to make the mash, trim and scrub the carrots, slice into chunks and pile into a steamer basket or metal colander balanced over a pan of simmering water. Steam, covered, for 15-20 minutes or until just tender.  ", "Remove the carrots from the steamer and mash with a generous knob of butter. Divide the mash between 4 plates and pop the sausages on top."]}, {"isVegetarian": false, "title": "How to cook mussels", "url": "www_bbc_co_uk_food_recipes_musselswithwineandpa_90229", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/musselswithwineandpa_90229_16x9.jpg", "ingredients": ["1kg/2lb 3oz mussels", "drizzle olive oil", "1 shallot, finely chopped", "2 garlic cloves, finely chopped", "75ml/2½fl oz dry white wine", "handful of fresh parsley, chopped", "crusty bread, to serve"], "serves": "Serves 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean and debeard the mussels. If any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them.", "Heat the olive oil in a wide, heavy-based pan. Add the shallots and garlic and cook until softened, but not browned.", "Add the wine to the pan and boil for a minute to burn off the alcohol.", "Add the mussels to the pan. Add most of the chopped parsley, cover the pan with a lid and cook the mussels for about 3-4 minutes, giving the pan a shake from time to time. The mussels are cooked when they've opened up. Be sure to discard any that don't open.", "Sprinkle in the remaining parsley, then spoon the mussels into a serving bowl. Pour over the cooking liquid and serve with some crusty bread."]}, {"isVegetarian": false, "title": "Roasted ham hocks with celeriac mash, celeriac and apple salad and a raisin and pasilla chutney", "url": "www_bbc_co_uk_food_recipes_mustard_and_muscovado_29561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g smoked ham hocks", "1 onion, peeled", "8 cloves", "1 x 440ml can dry cider ", "½ tsp black peppercorns", "100g/3½oz dark brown muscovado sugar", "pinch ground cloves ", "75g/2½oz English mustard", "30g/1oz pasilla chillies", "200g/7oz muscovado sugar", "50g/1¾oz tamarind pulp", "100ml/3½fl oz red wine vinegar", "4 tbsp port or brandy", "1 star anise", "4 cloves", "200g/7oz raisins", "500g/1lb 2oz floury potatoes, cut into small chunks", "1kg/2lb 4oz celeriac, cut into chunks approximately twice the size of the potato", "50g/1¾oz butter", "100g/3½oz crème fraîche", "salt and freshly ground black pepper", "3 tbsp red wine vinegar", "½ lemon, juice only", "75g/2½oz natural yoghurt", "35g/1¼oz mayonnaise", "¼ tsp wholegrain mustard", "¼ tsp English mustard", "½ celeriac (about 350g/12oz), very finely sliced", "2 Granny Smith apples, very finely sliced", "small bunch flatleaf parsley, roughly chopped"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the ham hocks, soak the ham hocks overnight in a large saucepan of cold water. Drain the next day to remove any excess salt (this applies with an unsmoked ham too), keeping the ham in the pan. ", "Stud the onion with the cloves, then add to the pan with the cider and peppercorns. Add enough cold water to cover the ham, cover with a lid and bring to the boil. Once boiling, reduce the heat to a simmer and cook for 2 hours until the ham is tender to the point of a knife, topping up with boiling water to cover the ham again if necessary.", "Meanwhile, to make the chutney. Heat a frying pan over a medium heat. Once hot, add the chillies, stirring continuously for a few minutes until they smell fragrant and delicious. Try not to burn them or they will turn from delicious to bitter! Transfer to a bowl and cover with boiling water from the kettle (at least 100ml/3½fl oz).  ", "Add the sugar to a small saucepan and melt with the tamarind pulp. Stir in the vinegar, brandy, spices and raisins and let them simmer very gently over a very low heat.  ", "Meanwhile check the chillies. When soft, use a stick blender to blend them to a smooth paste. Add the chillies to the rest of the chutney and simmer gently over a low heat for 10 minutes, seasoning generously with salt.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Lift the hocks out of the pan onto a wire rack sat in a roasting tin (reserve the cooking liquor). When cool enough to handle, remove the skin of the ham (not the fat) using a sharp knife. Discard the skin (or save it to make crackling) and lightly score the fat into diamonds. Mix together the muscovado sugar, ground cloves and mustard then rub it over the fat of the ham. ", "Pour 200ml/7fl oz of the ham cooking liquor into the roasting tin (so the meat doesn’t dry out as it roasts), and roast the hocks on a rack for 35 minutes until the fat is golden and glazed. Remove from the oven and allow to rest.", "Meanwhile, for the celeriac mash, steam or boil the potato and celeriac together for about 15 minutes, until tender. Then, using plenty of elbow grease, roughly mash everything together, stirring in the butter and crème fraîche as you go. If you prefer super-smooth mash, use an electric whisk. Season to taste with salt and pepper.", "For the salad, mix all the ingredients except the celeriac, apple and parsley, together in the bottom of a serving dish. Toss the celeriac and apple in the dressing with the parsley. ", "To serve, pull the ham off the bone in large chunks and serve with the celeriac mash, salad and chutney."]}, {"isVegetarian": false, "title": "Mustard, bacon and caramelised onion scones", "url": "www_bbc_co_uk_food_recipes_mustard_bacon_and_64379", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_bacon_and_64379_16x9.jpg", "ingredients": ["2 rashers streaky bacon, rind removed", "450g/1lb self-raising flour, plus extra for dusting", "generous pinch salt", "pinch baking powder", "1 tsp English mustard powder", "110g/4¼oz unsalted butter, diced", "1 free-range egg, lightly beaten", "50ml/2fl oz double cream", "2 tbsp ready-made onion marmalade, plus extra to serve", "200ml/7fl oz full-fat milk"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Preheat the grill to a medium-high setting. When the grill is hot, grill the bacon for 2-3 minutes on each side, or until crisp and golden-brown. Set aside on a plate lined with kitchen paper. When cool enough to handle, crumble into small pieces. Set aside until needed.", "Sift the flour, salt and baking powder into a large mixing bowl. Stir in the mustard powder.", "Add the diced butter to the bowl, then rub the butter into the flour mixture using your fingertips until the mixture resembles fine breadcrumbs.", "Make a well in the centre of the dry mixture and add the beaten egg and cream, gradually drawing the dry mixture into the wet mixture using a wooden spoon. ", "Stir in the onion marmalade and reserved bacon pieces, then gradually stir in enough milk to make the mixture come together as a soft dough. (The mixture should not be sticky.)", "Dust a clean work surface with a little flour. Turn the dough out onto the work surface and roll it out to a thickness of 2.5cm/1in. Stamp out twelve 5cm/2in rounds from the dough using a cookie cutter, placing them onto a non-stick baking sheet as you go. ", "Bake the scones in the oven for 15-20 minutes, or until risen and golden-brown. Set aside to cool on a wire rack for at least 10 minutes before serving."]}, {"isVegetarian": true, "title": "Mustard and butterbean pâté with garlic toasts", "url": "www_bbc_co_uk_food_recipes_mustardandbeanpatewi_84047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter beans from a can, rinsed and drained", "1 tbsp wholegrain mustard", "3 tbsp olive oil", "1 tsp lemon juice", "sea salt and freshly ground black pepper", "2 slices french bread", "1 garlic clove, peeled and halved"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butterbeans, mustard, olive oil and lemon into a food processor and blend until smooth. Season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan until smoking and place the bread onto it. Griddle for two minutes on each side, then remove and rub with the cut side of the garlic.", "To serve, place the toasts onto a plate and top with the bean pâté."]}, {"isVegetarian": false, "title": "Mustard chicken with bean salad", "url": "www_bbc_co_uk_food_recipes_mustardchickenwithbe_77834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "1 chicken breast, flattened", "25g/1oz butter", "50ml/1¾fl oz white wine", "3 tbsp wholegrain mustard", "100ml/3½fl oz double cream ", "150g/5¼oz tinned haricot beans, rinsed and drained", "¼ red onion, chopped", "3 tbsp fresh coriander, chopped ", "3 tbsp basil, chopped ", "3 tbsp parsley, chopped ", "½ lemon, rind only", "4 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat a chargrill pan with a little oil and cook chicken on both sides for six minutes or until cooked through.", "In a separate saucepan melt the butter. Add the wine and heat to reduce by half.  Mix in the cream and mustard and reduce to make a thick sauce.", "To make the bean salad, mix the beans, red onion, coriander, basil, parsley and lemon rind together in a bowl.  Finally add the olive oil and mix through.", "To serve place the chicken on a bed of salad and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Mustard-crust salmon with a medley of vegetables and basil butter", "url": "www_bbc_co_uk_food_recipes_mustardcrustedsalmon_84598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz fresh breadcrumbs", "1 tbsp fresh, chopped chives", "1 tbsp fresh, chopped parsley", "15g/½oz butter, melted", "salt and freshly ground black pepper", "1 tsp Dijon mustard", "125g/4½ oz salmon fillet", "dash olive oil", "dash olive oil", "¼ onion, sliced", "75g/2½oz can cherry tomatoes", "50g/1¾oz frozen peas, blanched", "½ avocado, peeled and chopped", "3 tbsp double cream", "25g/1oz butter", "handful fresh basil leaves, chopped", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, place the breadcrumbs, herbs, butter, salt and freshly ground black pepper into a bowl and mix well. ", "Spread the Dijon mustard all over the salmon and then roll the salmon in the breadcrumb mixture and press down. ", "Heat the oil in a small frying pan.  Add the salmon and cook for three minutes on each side, or until golden-brown and completely cooked through.", "For the medley of vegetables, heat the oil in a saucepan and add the onions. Cook gently until the onions have softened.", "Add the tomatoes and cook for two minutes. ", "Add the peas, avocado and cream and heat through for one minute.", "For the basil butter, melt the butter in a small saucepan. Then add the basil and lemon juice and season, to taste, with salt and freshly ground balck pepper.", "To serve, place the medley of vegetables onto a clean plate.  Place the salmon on top and pour the basil butter over the salmon."]}, {"isVegetarian": false, "title": "Mustard grilled chicken fillet with chilli and black-eyed bean salad", "url": "www_bbc_co_uk_food_recipes_mustardgrilledchicke_90128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken fillet", "1 tbsp grain mustard", "2 tbsp olive oil", "1 tbsp white wine vinegar", "1 red chilli, chopped", "2 tbsp chopped fresh dill", "55g/2oz cooked canned black-eyed beans", "¼ banana, peeled, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak a wooden skewer in cold water for ten minutes. ", "For the chicken, thread the meat on to the skewer and coat in the mustard. Heat a chargrill pan until smoking and cook the chicken for 3-4 minutes on both sides, or until golden-brown and cooked through. ", "For the salad, mix all of the salad ingredients in a bowl placed onto a plate. Serve with the chicken on top."]}, {"isVegetarian": false, "title": "Mustard toad in the hole", "url": "www_bbc_co_uk_food_recipes_mustardtoadinthehole_87360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz self-raising flour", "pinch of salt", "2 medium free-range eggs, beaten", "300ml/½ pint milk", "1 tbsp Dijon mustard", "drizzle olive oil", "1 Cumberland sausage", "2 tbsp vegetable oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the flour and salt into a large bowl and make a well in the middle.", "In a separate bowl, whisk the eggs with the milk and mustard. Gradually pour the mixture into the well in the middle of the flour and whisk until you have a thick batter. Set aside and leave to rest for a few minutes while you cook the sausage.", "Heat a drizzle of olive oil in a frying pan, add the sausage and fry until brown on all sides. ", "Pour the vegetable oil into a small gratin or pie dish and place in the oven until very hot. Place the sausage into the hot oil and pour over the batter. Place back in the oven  and cook for 15 minutes, or until puffed up and golden-brown. Serve immediately in the gratin dish."]}, {"isVegetarian": false, "title": "Mutton chops with potato and turnip gratin", "url": "www_bbc_co_uk_food_recipes_mutton_chops_with_potato_75289", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mutton_chops_with_potato_75289_16x9.jpg", "ingredients": ["plain flour, for dusting", "4 free-range eggs, beaten", "150g/5oz Japanese panko breadcrumbs, crushed", "12 mutton chops, French-trimmed (ask your butcher to do this for you, and keep the mutton trimmings)", "vegetable oil, for frying", "knob of unsalted butter ", "squeeze lemon juice", "sea salt flakes, to taste", "2 onions, sliced", "1 pointed cabbage (such as hispi cabbage), root removed, leaves thinly sliced", "600ml/20 fl oz double cream", "600g/1lb 5oz floury potatoes, such as Maris Piper, peeled, sliced into 2mm-thick slices using a mandoline ", "600g/1lb 5oz large turnips, sliced into 2mm-thick slices using a mandoline ", "3 garlic cloves, grated", "1 duck egg, hard-boiled and grated", "1 tbsp Dijon mustard", "1 tbsp red wine vinegar", "½ tsp salt", "1 tsp sugar", "1 tsp English mustard powder", "¼ tsp smoked paprika", "100ml/3½fl oz olive oil", "2 tbsp chopped cornichons", "2 tbsp fine capers", "1 tbsp chopped fresh flatleaf parsley", "salt and freshly ground white pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mutton, sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the panko breadcrumbs onto a separate plate. ", "Dust each mutton chop first in the flour, then dip it in the egg, then roll it in the breadcrumbs until completely coated. Set aside, covered, until needed. ", "For the potato and turnip gratin, bring the cream to the boil in a saucepan and season, to taste with salt and freshly ground white pepper. Remove the pan from the heat and set aside. ", "Arrange alternate layers of the potato slices and turnip slices into a large ovenproof dish, sprinkling each layer with a little of the grated garlic. Make sure you slightly overlap the slices of potato and turnip in each layer.", "Pour over the warm cream, then transfer the dish to the oven and cook for 18-20 minutes. ", "Remove the dish from the oven and press the potato and turnip layers down using a fish slice. Return the dish to the oven and continue to cook for a further 10 minutes.", "Repeat this process until the vegetables are tender, the cream has thickened and the top is golden-brown. Remove the dish from the oven and set aside to cool slightly.", "Meanwhile, for the sauce gribiche, in a bowl, mix together the grated duck egg, Dijon mustard, red wine vinegar, salt, sugar, English mustard powder and smoked paprika until well combined. ", "Gradually add the olive oil in a thin stream, stirring it into the mixture until the mixture emulsifies to a paste. Stir in the cornichons, capers and parsley and season, to taste, with salt and pepper. Set aside.", "To cook the chops, heat the vegetable oil in a large, non-stick frying pan over a medium heat. Add the breaded mutton chops, in batches if necessary, and shallow fry for 2-3 minutes on each side, or until golden-brown on both sides. Halfway through cooking, add a knob of butter and a squeeze of lemon juice to the pan and baste the chops with the mixture. ", "When the mutton chops are cooked to your liking, remove them from the pan and set aside to drain on an ovenproof plate lined with kitchen paper. Sprinkle with sea salt flakes and keep warm in an oven set to its lowest setting. ", "Chop the mutton trimmings into tiny pieces, then heat a lidded saucepan over a medium heat, add the chopped mutton trimmings and dry-fry until the fat has melted and the mutton trimmings are crisp and browned. ", "Add the onion and a pinch of salt, then cover the pan with the lid and fry for 3-4 minutes, or until the onions have softened. ", "Add the sliced cabbage, cover again with the lid and cook for 3-4 minutes, or until the cabbage is wilted and tender. ", "To serve, place two breaded mutton chops onto each serving plate with some cabbage. Spoon over a little of the sauce gribiche. Serve the potato and turnip gratin alongside."]}, {"isVegetarian": false, "title": "Mutton hotpot with heritage carrots", "url": "www_bbc_co_uk_food_recipes_mutton_hotpot_with_72316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 mutton kidneys, fat on", "1kg/2lb 4oz boneless leg of mutton, cut into 2.5cm/1in pieces", "2 tbsp flour", "2 large onions, cut into thick slices", "2 bay leaves", "2 tsp Worcestershire sauce", "600ml/20fl oz fresh beef stock", "900g/2lb potatoes, peeled and cut into 5mm/¼in thick slices", "sea salt and freshly ground black pepper ", "100g/3½oz butter", "300g/10½oz heritage carrots, cleaned and trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Trim the fat from the kidneys and place the fat into a large ovenproof casserole and cook over a medium heat until the fat begins to melt and is golden-brown.", "Sprinkle the mutton all over with the flour. Add half the mutton and kidneys to the casserole and cook until browned all over. Remove from the pan and set aside.", "Add the remaining meat and cook until browned all over, then add half the onions and the bay leaves. Top with the reserved mutton then the remaining onions.", "Add the Worcestershire sauce and stock and bring to a simmer.", "Arrange the potato slices on top in an overlapping pattern.  ", "Season the potatoes with salt and pepper and add a few dots of butter over the top. Cover with a tight-fitting lid and cook for two hours in the preheated oven.  When cooked, you can brush the potatoes with a little more butter, then place under the grill to crisp up if you like. Alternatively, increase the oven temperature during the last 30 minutes in the oven and remove the lid.  ", "When the hotpot is cooked, bring a pan of salted water to the boil. Add the carrots and simmer until just tender, about 3-5 minutes. Drain and toss with the remaining butter, salt and black pepper.", "Serve a pile of hotpot on each plate with some carrots alongside."]}, {"isVegetarian": false, "title": "Mutton saag", "url": "www_bbc_co_uk_food_recipes_mutton_saag_25343", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mutton_saag_25343_16x9.jpg", "ingredients": ["5 tbsp sunflower oil", "4 large onions, peeled and sliced", "10 cardamom pods", "1 tbsp cumin seeds", "2 tsp mustard seeds", "¼ cinnamon stick", "6 garlic cloves, peeled and sliced", "2 long red chillies, sliced ", "1 tbsp ground coriander", "2 tsp ground turmeric", "500g/1lb 2oz spinach leaves (preferably not baby spinach), stalks removed, washed and drained", "900g/2lbs boneless mutton leg, cut into 4cm/1½in pieces (You may need to start off with a 1.7kg piece of mutton on the bone.)", "1 tsp flaked sea salt, plus extra to taste", "1 bay leaf", "2 tbsp tomato purée", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat three tablspoons of the sunflower oil in a large heavy-based frying pan and cook the onions gently for 20 minutes, or until softened and golden-brown. ", "Meanwhile place the cardamom pods in a pestle and mortar and pound lightly to split the pods. Tip onto a board and open each pod, scraping the seeds back into the mortar. Add the cumin, mustard seeds and cinnamon stick and grind into a fine, dry powder.", "Remove half of the onions and transfer to a plate. Return the pan to the heat and stir in chillies and garlic and cook for three minutes. Add the ground spices, ground coriander and turmeric and fry, stirring constantly, for two minutes.", "Preheat the oven to 170C/325F/Gas 3.", "Add 300g/10z spinach to the pan and cook for 2-3 minutes. Remove from the heat, scrape into a heatproof bowl and set aside to cool. ", "Return the pan to the heat and add one tablespoon of oil. Season the mutton all over with salt and freshly ground black pepper. Fry the mutton over a medium-high heat in 2-3 batches until nicely browned on all sides, adding a little more oil if necessary. As soon as one batch is browned, transfer to a medium flame-proof casserole while the rest is fried. ", "Transfer the spiced onions and spinach to a food processor and blend to a thick green paste. Stir into the casserole dish with the lamb and add the bay leaf, tomato purée and 800ml/1⅓ pints cold water. Season with a teaspoon of sea salt flakes, stir well and bring to a simmer.", "Remove from the heat and cover the surface of the curry with a piece of crumpled baking parchment. Place a lid on top of the casserole and cook in the oven for 2½-3 hours or until the mutton is very tender and the sauce is thick. ", "Stir in the reserved onions and the remaining spinach. Cover with the lid and return to the oven for a further 15-20 minutes or until the onions are hot and the spinach has wilted. Serve with rice or warm naan bread."]}, {"isVegetarian": false, "title": "Mutton cannon ni seek boti (mutton kebabs)", "url": "www_bbc_co_uk_food_recipes_muttoncannonniseekbo_93662", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz cannon of mutton (from the best end of neck), cut into 2cm/1in pieces", "1 tbsp minced, peeled root ginger", "1 tbsp minced, peeled garlic", "½ tsp ground turmeric ", "2 tsp ground coriander", "1 tsp ground cumin", "1 tsp red chilli powder", "½ tsp garam masala", "1 tbsp lemon juice", "110-150ml/4-5fl oz vegetable oil", "1 large green chilli, finely chopped", "1 tsp root ginger, peeled, finely chopped", "2 garlic cloves, peeled, very finely chopped", "1 tbsp chopped fresh coriander", "2 free-range eggs", "pinch salt", "3-4 tbsp plain flour", "1 red onion, peeled, thinly sliced", "1 small green mango, peeled, finely julienned", "1 green chilli, finely chopped", "1-2 plum tomatoes, seeds removed, finely julienned", "½ cucumber, cut into 5cm/2in lengths, seeds removed, julienned", "10-15 fresh mint leaves, finely shredded", "handful chopped fresh coriander", "½ tsp salt", "1 lime, juice only", "1 tsp cider vinegar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the kebabs, soak several small wooden skewers in cold water for 10 minutes.", "For the marinade, mix all of the marinade ingredients in a bowl until well combined. Set aside for 2-3 hours, at room temperature, then transfer to the fridge for 5-6 hours.", "For the kebabs, heat 2 tablespoons of the oil in a casserole until smoking. Add the marinated mutton to the pan, in batches if necessary, and fry for 4-5 minutes, or until browned all over. ", "Once all of the meat is browned, remove the pan from the heat and stir in the chill, ginger, garlic and coriander. Set aside to cool slightly.", "Fill a frying pan with enough vegetable oil to reach 1.5cm/¾in up the side of the pan and heat until hot.", "Meanwhile, beat the eggs in a bowl with a pinch of salt. Sprinkle the flour onto a plate. Skewer the mutton pieces onto small wooden skewers and dredge in the flour, then dip into the beaten egg until the mutton is well coated in the egg.", "Carefully lower the kebabs into the oil and fry for 2-3 minutes on each side, or until golden-brown and cooked through. Remove the kebabs from the pan and set aside to drain on kitchen paper.", "For the cachumber, mix all of the cachumber ingredients in a bowl until well combined.", "To serve, pile the mutton kebabs onto a serving plate and serve the cachumber alongside."]}, {"isVegetarian": false, "title": "Mutton, onion and mint terrine with beetroot chutney and crusty bread", "url": "www_bbc_co_uk_food_recipes_muttononionandmintte_85922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 onions, finely sliced", "salt and freshly ground black pepper ", "3 tbsp finely chopped fresh mint", "300g/11oz streaky bacon", "750g/1lb 11oz leg of mutton, thinly sliced", "1 tbsp olive oil", "1 red onion, finely chopped", "1 garlic clove, finely chopped", "2cm/¾in piece fresh ginger, grated", "1 tsp mustard seeds", "300g/11oz ready-cooked beetroot, chopped", "50g/2oz caster sugar", "75ml/3fl oz sherry vinegar", "1 baguette, thickly sliced"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Heat a frying pan until hot, then add the olive oil and onions. Fry the onions for 3-4 minutes, until just beginning to soften, then season well with salt and freshly ground black pepper and add the mint. Stir well, then remove from the heat and set to aside to cool.", "Use the bacon to line the base and sides of a 1 litre/2 pint pudding basin, leaving some of the bacon slices hanging over the top of the bowl.", "Place a little of the sliced mutton into the bottom of the bacon-lined bowl, then season with salt and freshly ground black pepper.", "Top the layer of mutton with some of the onions, then repeat with alternate layers of mutton and onions, until the bowl is three-quarters full.", "Fold the excess bacon over the filling to cover and press down firmly.", "Cover the top with aluminium foil and place the bowl into a deep baking dish three-quarters-filled with hot water (this is a bain-marie).", "Transfer to the oven to bake for two hours, then remove and allow to cool for 15-20 minutes.", "Place a couple of cans of tomatoes or beans (or any reasonably weighty objects) on top of the foil over the terrine and place into the fridge until cold.", "Meanwhile, for the beetroot chutney, heat a frying pan until hot, then add the olive oil, red onion, garlic and ginger. Fry for 2-3 minutes, until just softened.", "Add the mustard seeds and cook until they pop.", "Add the beetroot, sugar and vinegar and cook for 4-5 minutes, or until the chutney has thickened. Season, to taste, with salt and freshly ground black pepper and allow to cool.", "To serve, turn the terrine out of the basin. Cut out wedges of terrine and place onto plates with a spoonful of chutney and a hunk of crusty bread alongside."]}, {"isVegetarian": false, "title": "My big fat British wedding cake", "url": "www_bbc_co_uk_food_recipes_my_big_fat_british_69650", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, softened, plus extra for greasing ", "225g/8oz caster sugar ", "4 medium free-range eggs ", "3 lemons, zest only ", "225g/8oz self-raising flour ", "2 lemons, juice only", "75g/2½oz caster sugar", "2 lemons, juice and zest", "100g/3½oz caster sugar ", "50g/1¾oz butter ", "2 free-range eggs ", "½ tbsp cornflour ", "125g/4½oz unsalted butter ", "250g/9oz icing sugar, sifted ", "2 tsp Sicilian lemon extract  ", "300g/10½oz white marshmallows", "ivory food colouring", "550g/1lb 4oz icing sugar, sifted ", "vegetable fat (such as Trex), for greasing", "cornflour, for dusting", "pearl lustre spray", "a gold ribbon and pins to secure it in place", "gold lustre dust ", "rejuvenator spirit (used with the lustre dust to create edible paint)", "a decorative jewel", "1 kg/2lb 4oz sugar flower paste", "vegetable fat (such as Trex)", "pink gel food colouring"], "serves": "Makes 1 x 20cm/8in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line and grease a 20cm/8in springform cake tin. ", "Cream together the butter and sugar until pale and fluffy. Beat in the eggs one at a time then add the lemon zest. Mix in the flour and pour the batter into the prepared tin. Smooth the surface and bake for an hour, or until a skewer inserted into the centre comes out clean.", "For the lemon drizzle, add the lemon juice and sugar to a saucepan and warm through. Leave to cool, then brush it over the surface of the cooked cake while it is still warm. Set aside to cool completely. ", "For the lemon curd, whisk together all the ingredients in a saucepan. Heat gently, stirring every now and then, until thickened.  Set aside to cool completely.", "For the lemon buttercream, beat the butter until soft and fluffly. Add the icing sugar slowly until completely combined, pale and fluffy. Stir in the lemon extract.  ", "Slice the cake in half horizontally and fill with buttercream and lemon curd. Place on a cake board. Spoon any remaining buttercream on top of the cake and smooth it down to completely cover the cake in a smooth ‘crumb coat’. It doesn’t need to look great at this stage, but it is important that the top and edges are straight and smooth (so that lumps don’t show through when the cake is covered with fondant icing).", "For the marshmallow fondant, add the marshmallows, a tablespoon water and a little food colouring to a microwave safe bowl.  ", "Heat in short bursts in a microwave on a medium heat, stirring well each time, until the marshmallows are melted. Stir in the icing sugar and mix until it forms a rough paste - don’t worry if there are still lumps of icing sugar at this stage. ", "Grease your hands and a work surface with vegetable fat. Tip out the marshmallow paste and knead until the paste is smooth. Shape it into a rough circle wrap in cling film and set aside. ", "Dust a clean work surface and a rolling pin with cornflour and roll out the marshmallow fondant until large enough to cover the cake with some excess.", "Lift the marshmallow fondant onto the cake and smooth the top using a fondant icing smoother if you have one, or your hands. Carefully smooth down the sides, making sure you push out any air bubbles as you go. If you have any small creases rub them out using a little cornflour. Trim off any excess icing from the bottom. ", "If using the decorations, spray the cake with pearl lustre spray and cover the bottom edge with ribbon and secure in place. Mix 2 tablespoons of lustre dust with enough rejuvenator spirit to make a paint. Neatly brush a large gold circle on top of the cake and set aside to dry. Reserve any leftover paint.", "To make the sugar flowers, knead the paste on a work surface greased with vegetable fat until pliable. Add a few drops of the colouring and knead until the paste is evenly coloured.", "Cut out petal shapes and use a baller icing tool (or a round knife handle) to thin out the edges. Pull the petals together to make flowers and pinch the bottom to make them stay together. Paint the edges of the petals with gold paint. Trim off any excess from the ‘stalk’ and arrange the flowers on top of the cake. "]}, {"isVegetarian": true, "title": "My big fat tipsy trifle", "url": "www_bbc_co_uk_food_recipes_my_big_fat_tipsy_trifle_16006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x ready-made Madeira loaf cakes", "150ml/5fl oz amaretto (or any strong liqueur), plus extra for flambéeing ", "800g/1lb 12oz strawberries, hulled, cut in half lengthways", "250g/9oz amaretti biscuits, crumbled", "few drops vanilla extract", "100g/3½oz icing sugar", "900ml/1½ pints double cream", "200g/7oz white chocolate, grated"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the trifle dish on a large tray to make it easy to carry. Slice one of the Madeira cakes into 0.5cm/¼in slices and use a few of the pieces to line the bottom of the dish. (Make sure they are nice and tight and in a single layer, so push down any bits that are standing up too high.)", "Brush the sponge with some of the amaretto. Then take a few strawberries halves that are roughly the same size and put them point upwards on the outer edge of the cake so the cut edges are pressing up against the glass. Repeat all the way round the dish. ", "Sprinkle some crumbled amaretti biscuits on top of the sponge to a third of the way up the strawberries.", "Place the vanilla, icing sugar and cream in a bowl and whisk until thick and well combined.", "Spread a third of the cream on top of the strawberries and crumbled biscuits, and smooth it down with a spoon. ", "Once the cream mixture is level in the bowl, wipe round the edge with kitchen towel. Sprinkle over with white chocolate.", "Repeat the layering process until the bowl is full, finishing with a layer of strawberries. Chill in the fridge until ready to eat.", "Shortly before serving, you can flambé the top of the trifle. To do this, place some amaretto in a stainless steel ladle. Warm it through over low heat. Gently ignite the mixture and pour it over the trifle. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.)"]}, {"isVegetarian": false, "title": "My mother’s cheese and onion pie", "url": "www_bbc_co_uk_food_recipes_my_mothers_cheese_and_42949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/my_mothers_cheese_and_42949_16x9.jpg", "ingredients": ["60g/2oz butter, cut into small pieces", "60g/2oz lard, cut into small pieces", "200g/7oz self-raising flour, plus extra for dusting", "pinch salt", "25g/1oz butter", "3 onions, roughly sliced", "salt and freshly ground white pepper ", "250g/9oz Lancashire cheese, coarsely grated ", "milk, for sealing and glazing"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and place a baking tray in the oven to heat through.", "For the pastry, place the butter and lard into a large bowl with the flour and salt. Gently rub the fat into the flour using finger tips until the texture resembles very coarse breadcrumbs. Alternatively use a food processor to bind the fat and flour.", "Add 2-3 tbsp ice cold water to bind the mixture. Lightly knead the dough until well amalgamated, dust with flour and place into a sealable plastic bag. Chill in the fridge for 30 minutes before using. If you are in a rush, you can use the dough straightaway.", "For the filling, heat the butter in a saucepan and fry the onions for 10 minutes, without colouring. Stir in 150ml/5fl oz water, salt and freshly ground black pepper and cook until almost all the liquid has evaporated. Remove the onions, spread out onto a plate and set aside to cool. ", "Roll out two-thirds of the pastry until it is about 0.5cm/¼in thick and line a greased 20cm/8in loose-bottomed tart tin, leaving any excess pastry overhanging the edge.", "Now roll out the remaining pastry to a similar thickness which will also be generously wide enough to use as a lid to the pie. Cover the base of the pie with half of the onions and then cover with half the grated cheese. ", "Repeat the layering process in step 6 until all the mixture is used up. ", "Roll out the remaining pastry to make a lid for the pie. Brush the edges of the pastry case with milk to seal the pastry lid upon it, while also pressing the edges together lightly before trimming off any excess overhang. Brush the surface of the pie with milk. Make three small incisions into the centre of the pie using the point of a sharp knife and, if you wish, further decorate to make a lattice effect. ", "Place the pie into the oven and bake for 40-50 minutes, or until golden-brown. Remove from the oven and leave for a good 20-30 minutes before un-moulding and cutting into generous wedges. ", "Serve the pie warm or at room temperature (not piping hot)."]}, {"isVegetarian": false, "title": "My favourite stuffing", "url": "www_bbc_co_uk_food_recipes_myfavouritestuffing_13964", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/myfavouritestuffing_13964_16x9.jpg", "ingredients": ["500g/1lb2oz chestnuts", "1 whole head celery, washed and chopped", "1 small onion, finely chopped ", "25g/1oz butter", "12 plump prunes, stoned", "1 tbsp chopped parsley", "1 egg, beaten", "salt and black pepper", "the turkey's liver, trimmed washed and finely chopped", "50g/2oz fresh breadcrumbs"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Make little slits in the chestnuts then blanch or roast them to ease peeling. Simmer the chestnuts in unsalted water until completely tender (15-20 minutes).", "Drain and leave to cool, then place in a basin and roughly break them up with a fork - you want them crumbled rather than puéed.", "Sweat the onion and celery in the butter over a medium heat for a few minutes until softened, then add the prunes, chestnuts and parsley. Season with salt and pepper, mix well and cook for a further few minutes. Remove the pan from the heat.", "When the mixture has cooled a little, mix in the breadcrumbs, liver and egg until all the ingredients are well combined. Pile the mixture into a suitably sized ovenproof dish. Bake for 30-35 minutes in a fairly hot oven (i.e. with the turkey at 180C/350F/Gas 4) until nicely browned and crispy on top", "Serve slices of the stuffing with the turkey."]}, {"isVegetarian": false, "title": "Easy mince pies", "url": "www_bbc_co_uk_food_recipes_mymincepies_71055", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mymincepies_71055_16x9.jpg", "ingredients": ["140g/5oz cold butter, diced", "225g/8oz plain flour", "50g/2oz ground almonds", "50g/2oz golden caster sugar", "1 orange, zest only", "pinch of salt", "1 egg yolk", "1-2 tsp cold water", "280g/10oz good quality mincemeat", "1 egg, beaten", "icing sugar for dusting"], "serves": "Makes 18", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Rub the butter into the flour and add the almonds, caster sugar, orange rind and salt until the mixture is a bit crumbly. ", "Combine mixture with the egg yolk and 1-2 teaspoons of water until it forms soft dough, then put it into a plastic bag and chill for 20 - 30 minutes. ", "Roll out the pastry to a thickness of 2-3mm(0.1in) and cut out about 18 rounds measuring 7.5cm(3in) with a pastry cutter.", "Place in lightly greased patty tins and spoon the mincemeat evenly into the pies.", "Re-roll the leftover pastry and cut out round lids, stars or other festive shapes to fit on top of the mincemeat.", "Lightly brush the pastry tops with the beaten egg and bake in the oven for 12 - 15 minutes until golden.", "Remove from oven and leave for a few minutes before removing from tins and cooling on a wire rack. ", "Dust with icing sugar."]}, {"isVegetarian": false, "title": "Rogan josh", "url": "www_bbc_co_uk_food_recipes_myroganjosh_90030", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/myroganjosh_90030_16x9.jpg", "ingredients": ["5 tbsp vegetable oil", "7 black peppercorns, left whole", "3 black cardamom pods, left whole", "5 green cardamom pods, left whole ", "4 cloves, left whole ", "1 cinnamon stick", "1 piece of mace", "1 onion, finely chopped", "750g/1½lb lamb or mutton, cut into pieces ", "6 garlic cloves, peeled, left whole", "2cm/¾in piece ginger, peeled and cut in half", "2 tsp ground coriander", "2 tsp ground cumin", "½ tsp red chilli powder", "2 tsp ground fennel seeds", "1½ tsp garam masala", "salt, to taste", "2 tomatoes, blended to a pulp in a food processor ", "3 tbsp plain yoghurt, stirred", "handful chopped fresh coriander, leaves and stalks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan over a medium heat. Add the black peppercorns, black and green cardamom pods, cloves, cinnamon and mace and fry for 1-2 minutes, or until the spices are sizzling and fragrant.", "Add the chopped onion and fry for 8-10 minutes, stirring regularly, until golden-brown. ", "Add the lamb pieces and fry for 3-4 minutes, stirring continually, until golden-brown all over.", "Meanwhile, in a food processor, blend the garlic cloves and ginger with one tablespoon of water to a fine paste. ", "Add the garlic and ginger paste to the lamb mixture, stir well to combine, then reduce the heat and continue to cook for 3-4 minutes, stirring regularly. ", "Stir in the powdered coriander, cumin, red chilli powder, fennel seeds, garam masala, salt, tomato pulp and yoghurt, cover the pan with a lid, then reduce the heat to a low heat and simmer for 10-12 minutes, or until the sauce has almost completely dried out. ", "Add 2-3 tablespoons of boiling water to the sauce, stir well and simmer for a further 7-8 minutes, stirring continually and adding splashes of water as necessary, until the volume of liquid has reduced and the sauce has thickened.", "Add enough boiling water to almost cover the lamb, bring the mixture to the boil, then reduce the heat to a simmer and simmer or 8-10 minutes, or until the lamb is cooked through. ", "Stir in the chopped coriander just before serving."]}, {"isVegetarian": true, "title": "Naan bread", "url": "www_bbc_co_uk_food_recipes_naan_86626", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/naan_86626_16x9.jpg", "ingredients": ["250g/9oz plain flour", "2 tsp sugar", "½ tsp salt", "½ tsp baking powder", "110-130ml/3½-4½fl oz milk", "2 tbsp vegetable oil, plus extra for greasing", "nigella seeds, poppy seeds or sesame seeds, or chopped garlic and fresh coriander", "1 tbsp butter, melted, to serve"], "serves": "Makes 5", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dough, sift the flour, sugar, salt and baking powder into a bowl. In another bowl, mix together the milk and oil.", "Make a well in the centre of the flour mixture and pour in the liquid mixture. Slowly mix together the dough by working from the centre and incorporating the flour from the edges of the 'well', to make a smooth, soft dough. Knead well for 8-10 minutes, adding a little flour if the dough is too sticky.", "Place the dough into an oiled bowl, cover with a damp tea-towel and leave in a warm place for 10-15 minutes. Form the dough into five balls.", "Preheat the grill to medium and place a heavy baking sheet on the upper shelf of the grill to heat.", "Roll the dough balls out quite thinly, ideally in a teardrop shape, but really this is just aesthetic. Sprinkle over your chosen topping and press into the surface of the dough. Place the naans onto the hot baking sheet and grill for just 1-2 minutes, or until lightly browned. Brush with butter and serve hot."]}, {"isVegetarian": true, "title": "Naan breads", "url": "www_bbc_co_uk_food_recipes_naanbreads_77147", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp dried active yeast", "1 tsp sugar", "200g/7oz plain flour", "pinch black onion seeds (nigella seeds)", "¼ tsp salt", "½ tsp baking powder", "1 tbsp vegetable oil", "2 tbsp plain yoghurt", "2 tbsp milk"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1.", "In a small bowl, mix the yeast with one tablespoon of warm water. Stir in the sugar and leave it in a warm place for five minutes until the yeast is covered with froth. ", "Meanwhile, mix together the flour, onion seeds, salt and baking powder. Stir in the oil, yoghurt and milk, then stir in the activated yeast mixture.", "To knead the dough, clench your hand into a fist, wet your knuckles with a little water, then press them repeatedly into the dough. Continue pressing and kneading until you have a soft, pliable dough. It should take about ten minutes. ", "Place the dough in a mixing bowl, cover it with cling film and leave it in a warm place to rise for 10-15 minutes.", "Divide the dough into four balls and place on a floured surface or board. Roll each into a long oval shape about 0.5cm/¼in thick. Don't roll them out too thinly or they'll turn out like crisps. ", "Place them on a greased baking tray and put them in the centre of the oven for 10-15 minutes. They are ready when they have puffed up a little. They should be soft and crumbly, not chewy. Serve fresh from the oven."]}, {"isVegetarian": true, "title": "Nachos", "url": "www_bbc_co_uk_food_recipes_nachos_92445", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nachos_92445_16x9.jpg", "ingredients": ["2 very ripe avocados, skin and stones removed ", "1 large lime, juice only", "1 chilli, seeds removed, finely chopped", "½ garlic clove, peeled, grated", "pinch ground cumin (optional)", "1 large ripe tomato, seeds removed, chopped", "2 spring onions, trimmed, finely sliced", "salt and freshly ground black pepper", "3-4 tomatoes, seeds removed, finely chopped", "1 red chilli, seeds removed, finely chopped", "dash Tabasco, to taste", "1 garlic clove, peeled", "1 large lime, juice only", "½ tbsp extra virgin olive oil", "2 x 200g/7oz bags plain tortilla chips", "200g/7oz jar jalapeno chillies, drained, sliced", "200g/7oz mature cheddar cheese, grated", "1 x 150ml/5¼fl oz pot soured cream", "small handful chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7. ", "For the guacamole, mash all of the guacamole ingredients together in a bowl using a fork, until well combined. ", "Cover the bowl with cling film and chill in the fridge until needed (or for at least 20 minutes). ", "Meanwhile, for the salsa, mix all of the salsa ingredients together until well combined. Set aside for 10 minutes. ", "Sprinkle the tortilla chips into a large ovenproof dish. Scatter over the sliced jalapeno peppers and grated cheese. Transfer to the oven and cook until the cheese has melted, about 4-5 minutes. ", "To serve, spoon dollops of the guacamole, salsa and soured cream on top of the nachos. Sprinkle over the coriander leaves."]}, {"isVegetarian": true, "title": "Nadiya's dal", "url": "www_bbc_co_uk_food_recipes_nadiyas_dhal_45569", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nadiyas_dhal_45569_16x9.jpg", "ingredients": ["250g/9oz yellow lentils", "2 tbsp vegetable oil", "4 onions, chopped", "1 red chilli, finely chopped (seeds removed if preferred)", "4 garlic cloves, crushed", "½ tsp ground turmeric", "½ tsp chilli powder", "1 tsp ground cumin", "3 small dried red chillies", "2 floury potatoes, peeled and cut into 5mm dice", "2 tomatoes, roughly chopped", "5 tbsp vegetable oil", "2 garlic cloves, crushed ", "½ onion, thinly sliced", "1 red chilli, thinly sliced", "1 tsp Indian five-spice (punch pooran)", "large handful fresh coriander leaves"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the dal, soak the lentils (ideally overnight) or for a minimum of 4 hours. ", "Heat the vegetable oil in a large pan. Add the onions, chilli and garlic and cook until softened. ", "Add the ground spices, dried chillies and a little water to loosen and stir.", "Add the potatoes and lentils and enough water to almost cover. Simmer for 10–12 minutes..Add the tomatoes and simmer for 10–15 minutes, until they have softened but not dissolved.", "Meanwhile, for the topping fry the garlic, onion and chilli in the oil until caramelised and crispy. Add the five-spice and, once you hear the spices pop, take off the heat.", "To serve, spoon out the dal and garnish it with the crunchy topping. Sprinkle with the coriander."]}, {"isVegetarian": false, "title": "Nargis kebabs", "url": "www_bbc_co_uk_food_recipes_nargiskebabs_93344", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 free-range eggs, plus 1 egg yolk", "250g minced beef or lamb", "2 garlic cloves, peeled, crushed", "2.5cm/1in piece root ginger, peeled, grated", "½ tsp ground coriander", "½ tsp ground cumin", "½ tsp chilli powder", "¼ tsp ground cloves", "1 tbsp cornflour", "salt", "2 tbsp flour", "2 tbsp sesame seeds", "vegetable oil for shallow frying"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil and cook 4 of the eggs for 4-5 minutes until they are medium- to hard-boiled. Drain and cool under cold running water (this will prevent the yolks from discolouring). Peel and set aside. Beat the remaining egg in a bowl and set aside.", "In a bowl, mix together the minced beef, garlic, ginger, spices, cornflour and egg yolk until well combined. Season, to taste, with salt.", "Divide the beef mixture evenly into 4 portions. Roll each portion into a ball, then flatten out to form a thin patty. Wrap each patty around the peeled boiled eggs, smoothing out the join and making sure there is no egg left exposed. ", "Roll the scotch eggs in the flour, then dip in the beaten egg and roll in the sesame seeds.", "Half-fill a frying pan with the vegetable oil and heat until hot. (CAUTION: hot oil can be dangerous. Do not leave unattended). Fry the nargis kebabs in small batches for 4-5 minutes, turning the eggs occasionally, or until golden-brown all over and cooked through. Remove from the oil with a slotted spoon and drain on kitchen paper."]}, {"isVegetarian": false, "title": "Nasi goreng (Indonesian-style fried rice)", "url": "www_bbc_co_uk_food_recipes_nasi_goreng_69542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves, peeled", "pinch nutmeg ", "¼ tsp freshly ground black pepper ", "½ tsp ground turmeric ", "2 shallots, peeled", "25g/1oz unsalted peanuts ", "1 tsp salt ", "3 birds'-eye chillies, seeds removed ", "1 tbsp palm sugar ", "1-2 tbsp vegetable oil, or more if necessary", "2 tbsp vegetable or groundnut oil, plus extra for frying the eggs", "2 chicken breasts, skin removed, cut into thin strips ", "200g/7oz prawns, heads and shells removed and de-veined ", "110g/4oz fine green beans, trimmed and sliced into 1cm/½in pieces", "4 spring onions, sliced ", "275g/10oz cooked long-grain rice (this must be cold)", "splash light soy sauce", "splash ketjap manis (Indonesian soy sauce)", "4 free-range eggs", "½ cucumber, peeled, seeds removed, finely diced", "1 tbsp roughly chopped coriander", "50g/2oz peanuts ", "1 lime, cut into wedges", "handful crispy fried shallots ", "Asian-style chilli oil, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice paste, blend all of the spice paste ingredients together in a food processor. Add enough oil to bring the mixture together as a loose paste. Set aside.", "For the stir-fry, heat the oil in a wok over a high heat until shimmering hot, then add the chicken and fry for a minute or so, then add the spice paste and prawns and stir well, cooking for a good 4-5 minutes.", "Add the beans and spring onions and fry for another minute, keeping everything moving. ", "Add the cooked rice and stir until it's all been incorporated - you can add a few tablespoons of water at this point if it becomes a little dry and starts to stick. Season with soy sauce and ketjap manis, to taste.", "Heat a little of the oil in a large frying pan over a medium heat and fry the eggs until crisp at the edges and cooked to your liking.", "To serve, divide the stir-fry between two bowls, place two eggs on top and sprinkle over the garnish ingredients. Serve with the chilli oil on the side, for drizzling."]}, {"isVegetarian": false, "title": "Nasi goreng with lime and sugar barbecued chicken", "url": "www_bbc_co_uk_food_recipes_nasi_goreng_with_lime_87031", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nasi_goreng_with_lime_87031_16x9.jpg", "ingredients": ["3 garlic cloves, crushed", "1 tsp crushed white peppercorns", "1 tbsp granulated sugar", "1 tbsp Thai fish sauce", "1 lime, juice only", "500g/1lb 2oz skinned boneless chicken thighs, each cut into 2.5cm/1in strips", "2 tbsp vegetable oil", "4 fat garlic cloves, roughly chopped", "50g/2oz shallots, roughly chopped", "25g/1oz roasted salted peanuts", "6 medium-hot red chillies, roughly chopped", "1 tsp blachan (shrimp paste)", "1 tsp salt", "300g/10½oz long-grain rice", "sunflower oil, for frying", "6 large shallots, thinly sliced", "2 large free-range eggs", "salt and freshly ground black pepper", "1 tbsp tomato purée", "1 tbsp ketjap manis", "1 tbsp light soy sauce", "5cm/2in piece cucumber, cut into quarters lengthways, sliced", "8 spring onions, trimmed, thinly sliced on the diagonal", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the barbecued chicken, mix the crushed garlic, crushed white peppercorns, sugar, fish sauce and lime juice together in a bowl. Add the chicken pieces and place in the fridge to marinate for at least 2 hours or overnight. ", "To cook the chicken, thread the marinated chicken pieces onto parallel pairs of the soaked bamboo skewers (this helps to stop the pieces from spinning around as you turn them). ", "Preheat the grill to its highest setting (or prepare the barbecue).", "Grill the chicken skewers for 6-7 minutes, turning regularly, until golden-brown and caramelised on the outside and cooked through (no trace of pink should remain). ", "Slide the barbecued chicken off the skewers, cut into chunks and set aside. ", "For the spice paste, blend all of the spice paste ingredients in a food processor to a smooth paste. ", "For the nasi goreng, cook the rice in boiling, salted water for 12-15 minutes, or according to packet instructions, until just tender. Drain, rinse well with boiling hot water from the kettle, and drain well again.", "Spread the rice out onto a large baking tray and set aside until cold (but do not refrigerate). ", "Heat 1cm/½in of the sunflower oil in a large, deep-sided frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Add the sliced shallots and shallow fry, stirring now and then, until crisp and richly golden-brown. Remove the onions from the pan with a slotted spoon and set aside to drain on plenty of kitchen paper. Sprinkle lightly with salt and set aside until cold and crisp. ", "Beat the eggs in a bowl with some salt and freshly ground black pepper. ", "Heat a couple of tablespoons of the sunflower oil in a small frying pan over a medium-high heat, pour in one-third of the beaten egg and cook until it has has set on top. ", "Flip the egg over, fry it for a few more seconds then turn it out onto a chopping board or plate, roll it up tightly and set aside until cold. Repeat the process twice more with the remaining egg. ", "When the egg rolls are cold, slice them into thin strips. ", "Heat a wok over a high heat until smoking hot. Add two tablespoons of the oil left over from frying the shallots, then add the nasi goreng paste and stir-fry for 1-2 minutes, or until fragrant. ", "Add the tomato purée and ketjap manis and stir-fry for a few seconds, then add the cold cooked rice and stir-fry for a further 2-3 minutes, or until heated through. ", "Add the barbecued chicken pieces, fried shallots and strips of omelette and stir-fry for another minute. ", "Add the soy sauce, cucumber and most of the spring onions and mix together well. ", "To serve, spoon the nasi goreng onto a large warmed platter. Sprinkle over the remaining spring onions and allow people to help themselves."]}, {"isVegetarian": false, "title": "Nasi lemak", "url": "www_bbc_co_uk_food_recipes_nasi_lemak_58791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml tin coconut milk", "thumb-sized piece fresh root ginger, peeled and finely chopped    ", "1 lemongrass stalk", "350g/12oz basmati rice ", "salt", "1 piece pandan leaf, tied in a knot, to serve", "2 tbsp vegetable oil", "1 onion, thinly sliced", "1 garlic clove, finely chopped", "1 tsp shrimp paste", "1–2 tsp red chilli paste", "250g/9oz dried anchovies, soaked in water and drained ", "1 tbsp caster sugar ", "250ml/9fl oz tamarind paste mixed with 400ml/13fl oz water", "1 free-range egg", "vegetable oil for deep frying", "handful small dried white anchovies ", "handful peanuts, skin-on if possible", "½ cucumber, thinly sliced "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the coconut milk, ginger, lemongrass, rice and a pinch of salt in a large saucepan. Add 400ml/14fl oz water, stir and cook over a medium heat for 10–15 minutes, or until the rice is cooked and all the liquid has been absorbed. ", "To make the sambal, heat the oil in a frying pan and sweat the onion and garlic for 5–7 minutes, until soft. Add the shrimp paste, chilli paste and most of the soaked anchovies and stir. Add the sugar and a pinch of salt and pour in the tamarind water. Simmer until it reduces to a thick paste. Set aside.", "Meanwhile, to prepare the garnish, boil the eggs in water for 7–10 minutes; the yolks should be firm. When they are cool enough to handle, peel off the shells and cut the eggs in half. Preheat the oil in a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the dried white anchovies for 3 minutes, or until crispy. Toast the peanuts in a dry frying pan.", "Pick the lemongrass out of the rice and discard. Put the rice in a small bowl and press down until it is compacted. Upturn the rice in the middle of the pandan leaf. Arrange the egg, peanuts, cucumber and remaining anchovies around the rice and scatter over the crispy anchovies. "]}, {"isVegetarian": false, "title": "Navarin of lamb", "url": "www_bbc_co_uk_food_recipes_navarinoflamb_91968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2½ lb neck fillet of lamb, cut into 7.5cm/3in cubes", "1½ tbsp flour", "4 tsp vegetable oil", "1 onion, peeled, chopped", "1 whole garlic head, cut in half horizontally", "350ml/12fl oz white wine", "300g/10½oz canned chopped tomatoes", "3-4 sprigs fresh thyme, leaves only", "3-4 sprigs fresh rosemary, leaves only ", "500ml/17fl oz cold lamb or chicken stock ", "450g/1lb mixed seasonal vegetables, peeled, chopped into equal-sized pieces", "50g/2oz butter", "200-250g/7-9oz mashed potatoes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the flour onto a plate and dredge the lamb cubes in it until completely covered. ", "Heat one teaspoon of the vegetable oil in a large, heavy-based casserole over a medium heat. Add a third of the lamb cubes and fry for 6-8 minutes, stirring occasionally, until golden-brown on all sides, being careful not to overcrowd the pan. Remove from the pan with a slotted spoon and set aside on a warm plate.", "Repeat the process twice more with the two more teaspoons of the oil and remaining batches of lamb cubes until all of the lamb is browned. ", "Add the remaining teaspoon of oil to the pan the lamb was cooked in and heat over a medium heat Add the onions and garlic and fry for 4-5 minutes, or until golden-brown. ", "Add the wine and bring the mixture to a simmer. Continue to simmer for 6-8 minutes, or until the volume of liquid has reduced by half. ", "When the wine has reduced, add the chopped tomatoes and herbs and stir well. Return the mixture to a simmer, then continue to simmer for a further 4-5 minutes, or until the volume of liquid has reduced by half. ", "Add the cold stock and the reserved browned lamb pieces (add a little more water if the stock does not cover the lamb pieces).", "Heat the pan contents until simmering, cover the pot and simmer gently for 1½ hours, stirring occasionally, or until the sauce has thickened and the lamb is tender.", "Meanwhile, for the vegetables, cook the vegetables for 2-3 minutes in a pan of boiling, salted water. Drain well.", "Heat the butter in a pan over a high heat. Add the blanched vegetables and fry for 1-2 minutes, or until the butter has melted and coated the vegetables, and the vegetables are tender.", "To serve, divide the mashed potatoes equally among four serving plates. Spoon over the navarin of lamb. Top with the cooked mixed vegetables."]}, {"isVegetarian": false, "title": "N’duja-crusted cod with broccoli", "url": "www_bbc_co_uk_food_recipes_nduja-crusted_cod_with_15828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sultanas", "2 tsp muscatel vinegar      ", "1 slice white bread ", "4 tbsp finely chopped flatleaf parsley", "1 tbsp capers, drained, finely chopped", "2 anchovies, drained, finely chopped                    ", "1 egg, hard-boiled, cooked white only, finely chopped", "½ tbsp fennel seeds", "110g/4oz N’duja (spreadable French pork sausage)                       ", "300g/11oz broccoli, washed and trimmed into florets", "4 x 175g/6oz cod fillets", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil                    ", "1 garlic clove, finely julienned", "1 red chilli, finely julienned", "1 tbsp pine nuts    "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the sultanas overnight in the vinegar. ", "The next day, remove the sultanas from the vinegar using a slotted spoon and set aside. Soak the slice of bread in the same vinegar. When soaked, squeeze out any excess liquid.", "Pound the soaked bread, parsley, capers, anchovies, cooked egg white, fennel seeds and N’Duja in a pestle and mortar to a paste. ", "Spread the paste between two sheets of greaseproof paper and chill in the fridge until firmed up.", "Preheat the oven to 200C/400F/Gas 6.", "Blanch the broccoli florets in a pan of salted, boiling water for 3-4 minutes, or until tender. Drain well and set aside to cool.", "When the paste has firmed up, season the cod fillets on both sides with salt and freshly ground black pepper. Cut the layer of paste into four pieces that are the same size as each cod fillet. Place one on top of each piece of cod. ", "Place the N’duja-crusted cod fillets onto a baking tray and roast in the oven for 6-8 minutes. ", "Meanwhile, heat one tablespoon of the extra virgin olive oil in a frying pan and fry the garlic and chilli until the garlic is golden-brown. Add the pine kernels, reserved soaked sultanas and the broccoli and stir-fry for 1-2 minutes, or until warmed through.  Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the broccoli mixture into the centre of four serving plates. Place one N’duja-crusted cod fillet on top of each portion.", "In a bowl, whisk together the pan juices and the remaining tablespoon of olive oil until emulsified (well combined). Drizzle the sauce over the cod."]}, {"isVegetarian": false, "title": "‘Nduja and mozzarella pizza", "url": "www_bbc_co_uk_food_recipes_nduja_and_mozzarella_49902", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz 00 flour", "200g/7oz semolina flour", "1 tbsp caster sugar", "1 tsp salt", "1 x 7g sachet fast-action yeast", "650ml/1 pint 2fl oz tepid water ", "4 tbsp extra virgin olive oil", "1 x 400g tin plum tomatoes, preferably San Marzano, blended to a purée", "400g/14oz mozzarella cheese, torn into pieces", "300g/10½oz ’nduja sausage", "1 large handful fresh basil leaves", "1 tbsp vegetable oil"], "serves": "Makes 4-6 large pizzas", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza dough, sift the flours, sugar and salt into a large bowl and mix well. Mix the yeast and a splash of the water in a small jug.", "Make a well in the centre of the dry ingredients and add the yeast paste. Gradually pour over the rest of the tepid water, bringing the dry ingredients into the centre a little at a time, until the mixture comes together as a soft dough.", "Turn the dough out onto a lightly oiled work surface and knead for 5-10 minutes, until smooth and elastic. Place the dough into a large, clean bowl and cover with a damp, clean tea towel. Set aside in a warm room to prove for 1½ hours.", "When the dough has almost doubled in size, knock it back by punching and kneading it a little, and then divide it into 4-6 equal balls (depending on how many pizzas you want to make). ", "Place the dough balls on a lightly greased baking tray, spaced well apart, and cover with a lightly greased sheet of cling film. Set aside to prove again, for at least 4 hours (in a warm room) or overnight (in the fridge). ", "When the dough balls have doubled in size again, preheat the oven to its highest setting. Place a heavy baking tray or pizza stone into the oven to heat up. ", "Roll one of the dough balls out onto a lightly floured work surface to a 0.5cm/¼in thickness. Sprinkle a little flour onto an upturned baking tray and transfer the pizza base onto it. ", "Spoon some of the tomato mixture into the centre of the pizza base, spreading it almost to the edges. Sprinkle some of the mozzarella cheese, ’ndjua sausage and basil leaves onto the pizza, then drizzle over the peanut oil. ", "Working as quickly as possible, move the pizza into the oven by sliding it from the upturned tray onto the pizza stone or hot baking tray. Cook for 5-8 minutes, or until the base is cooked through, the cheese has melted and the tomatoes are bubbling. ", "Meanwhile, repeat the process with the remaining pizza bases, serving each pizza immediately."]}, {"isVegetarian": false, "title": "Nduja and potato hash", "url": "www_bbc_co_uk_food_recipes_nduja_and_potato_hash_45320", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nduja_and_potato_hash_45320_16x9.jpg", "ingredients": ["300g/10oz new potatoes", "2 tbsp vegetable oil", "1 onion, sliced", "75g/3oz 'nduja (available from Italian delis and specialist online retailers)", "1 red chilli, chopped", "200g/7oz Serrano ham, chopped", "1 tbsp capers", "100g/3½oz butter", "8 free-range eggs", "4 slices French bread", "1 tbsp chopped fresh parsley ", "chilli sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the new potatoes in a saucepan, fill with water and bring to the boil. Turn down the heat and simmer until the potatoes are tender. Drain and set aside.", "Heat one tablespoon of oil in two heavy-based frying pans set over a medium heat. Divide the onion between the two pans and fry gently for 10 minutes, or until soft and golden-brown.", "Add half the nduja and chilli to each pan and cook for three minutes. Stir in equal amounts of the Serrano ham, cook for a further three minutes.", "Add half the potatoes, capers and butter to each pan. Let the potatoes brown - keep turning them every so often with a spatula until crisp all over.", "Make two holes in the mixture in each pan. Crack two eggs in each hole, cover with a lid and cook for three minutes until set.", "Meanwhile, toast the bread on a griddle pan until crisp.", "Spoon the hash onto four plates, giving each person two eggs, and sprinkle over the parsley.  Serve with the toast and chilli sauce on the side."]}, {"isVegetarian": false, "title": "'Nduja sausage and sheeps’ cheese pizza", "url": "www_bbc_co_uk_food_recipes_nduja_sausage_and_sheeps_56588", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nduja_sausage_and_sheeps_56588_16x9.jpg", "ingredients": ["200g/7oz semolina flour", "800g/1lb 12oz type ‘00’ flour, plus extra for dusting", "1 tbsp caster sugar", "1 tsp salt", "650ml/1 pint 3fl oz tepid water", "1 x 7g sachet fresh yeast ", "1 x 400g can plum tomatoes, preferably San Marzano", "400g/14oz sheeps’ cheese, crumbled", "300g/11oz ’nduja (soft spicy Italian sausage, available from delicatessens or online specialists)", "1 large handful fresh basil leaves", "1 tbsp peanut oil"], "serves": "Makes 4 large pizzas", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the pizza dough, sift the flours, sugar and salt into a large bowl and mix well.", "Mix the yeast and a splash of the water to a paste in a small jug.", "Make a well in the centre of the dry ingredients and add the yeast paste. Gradually pour over the rest of the tepid water, bringing the dry ingredients into the centre a little at a time, until the mixture comes together as a soft dough.", "Turn the dough out onto a lightly floured work surface and knead for 5-10 minutes, until smooth and elastic. Place the dough into a large, clean bowl and cover with a damp, clean tea towel. Set aside in a warm room to prove for 1½ hours.", "When the dough has almost doubled in size, knock it back by punching and kneading it a little, then divide it into four equal balls. ", "Place the dough balls onto a lightly greased baking tray, spaced well apart, and cover with a lightly greased sheet of cling film. Set aside to prove again, for at least four hours (in a warm room) or overnight (in the fridge). ", "When the dough balls have doubled in size again, preheat the oven to its highest setting. Place a heavy baking tray or pizza stone into the oven to heat up with it. ", "Roll one of the dough balls out onto a lightly floured work surface to a 0.5cm/¼in thickness. Sprinkle a little flour onto an upturned baking tray and transfer the pizza base onto it.  ", "For the topping, blend the canned tomatoes to a purée in a food processor. Spoon some of the mixture into the centre of the pizza base, spreading it almost to the edges.", "Sprinkle some of the sheeps’ cheese, ’ndjua and basil leaves onto the pizza, then drizzle over the peanut oil. ", "Working as quickly as possible, scoot the pizza into the oven by pushing it from the upturned tray onto the pizza stone or hot baking tray. Cook for 5-8 minutes, or until the base is cooked through, the cheese has melted and the tomatoes are bubbling. ", "Meanwhile, repeat the process with the remaining three pizza bases and the remaining topping, serving each pizza immediately."]}, {"isVegetarian": false, "title": "Neapolitan-style pizza", "url": "www_bbc_co_uk_food_recipes_neapolitanstylepizza_67358", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong plain flour ", "1 tsp salt ", "1 tsp fresh yeast ", "325ml/11fl oz lukewarm water ", "300g canned plum tomatoes ", "salt and freshly ground black pepper ", "4 tbsp extra virgin olive oil ", "30g/1oz parmesan cheese, freshly grated  ", "a few fresh basil leaves or some dried oregano ", "140g/5oz mozzarella, roughly chopped ", "extra virgin olive oil, for drizzling ", "1 garlic clove, finely chopped", "1 rosemary sprig, chopped", "30g/1oz taleggio, grated", "2 slices speck", "½ courgette, sliced", "¼ aubergine, sliced", "1 slice prosciutto", "handful rocket leaves"], "serves": "Makes 2 pizzas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 250C/500F/Gas 9.  ", "In a large bowl, place the flour and salt together.  Dissolve the yeast in the lukewarm water and gradually add to the flour.  Mix well until you obtain a dough.  If you  find the dough too sticky, just add a little flour.  ", "Shape the dough into a ball and leave to rest covered with a cloth for 5 minutes.  After this time, you will find the dough much more pliable to work with.  Knead the  dough and split into two.  Knead each piece for a couple of minutes each and form into balls.  Sprinkle some flour on a clean kitchen cloth and place the dough on it  covering with a slightly damp cloth.  Leave to rise in a warm place for 30 minutes.  ", "Place the tomatoes in a bowl and squash them slightly, add salt and pepper and mix well.  ", "Sprinkle some flour on a clean work surface and with your fingers spread the dough into a roughly round shape with a border.  Make the dough as thin as a pancake  but beware not to split the dough.  Sprinkle some breadcrumbs on two large flat baking sheets and place the pizza bases on them.  ", "Spread a little of the tomato evenly over each base  -  not put too much as the pizza will go soggy.  Drizzle with olive oil, sprinkle with parmesan cheese, add a few  basil leaves or sprinkle some oregano and top with pieces of mozzarella cheese.  Then add topping of your choice.", "Place in the hot oven for 7 minutes (a couple of minutes longer if you prefer your pizza crispy).  Remove from the oven, drizzle with some olive oil and eat immediately - pizzas are not very nice cold or reheated!"]}]