[{"isVegetarian": false, "title": "Asado de costilla todo en uno con glaseado de rábano picante", "url": "www_bbc_co_uk_food_recipes_all-in-one_rib_roast_75464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-in-one_rib_roast_75464_16x9.jpg", "ingredients": ["2kg / 4lb 8oz de patatas Maris Piper, cortadas en tres partes", "Goteo de carne de 600 g / 1 lb 5 oz", "3 cucharadas de rábano picante fresco rallado", "2 cucharadas de pimienta negra", "2 cucharadas de sal marina", "3.5kg / 7lb 11oz costilla de res", "8 zanahorias grandes, picadas en 3", "8 chirivías grandes, cortadas en tercios a lo largo"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Hervir las papas peladas y cortadas en una sartén grande con agua con sal hasta que estén suaves hasta la punta de un cuchillo.", "Escurra las papas y agite en un colador para que los bordes se ablanden.", "En una sartén, derrita el goteo con rábano picante, sal y pimienta.", "Marca la carne con un cuchillo afilado.", "Coloque en capas todas las verduras picadas en una bandeja grande para horno y coloque la carne en la parte superior. Incline las papas en otra bandeja.", "Coloque la mayor parte del glaseado de rábano picante encima de las verduras y la carne (reservando algunas para las papas). Ase la carne en el horno durante 20 minutos, luego reduzca la temperatura a 160 ° C / 325 ° F / Gas 3 e hilvane la carne con el goteo.", "Vierta el resto del glaseado de rábano picante sobre las papas y colóquelas en el horno para que se cocinen durante el tiempo de cocción de la carne.", "Ase la carne durante dos horas, rociándola con el goteo cada media hora.", "Deje reposar la carne debajo de la lámina durante 30 minutos antes de servir. Si es necesario, puede subir el horno para hacer crujientes las papas mientras la carne está en reposo."]}, {"isVegetarian": true, "title": "Pastel de mantequilla fácil de uso general", "url": "www_bbc_co_uk_food_recipes_all-purpose_easy_butter_03274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-purpose_easy_butter_03274_16x9.jpg", "ingredients": ["100g / 3½oz de mantequilla sin sal", "Echador de 250g / 9oz o azúcar moreno", "50ml / 2fl oz de aceite de girasol", "25 g / 1 oz de arrurruz, harina de maíz o cacao", "2 cucharaditas de extracto de vainilla", "4 huevos medianos de granja", "80ml / 2½ fl oz de leche", "100ml / 3½ fl oz crema doble", "Harina normal 300g / 10½ oz", "3 cucharaditas de polvo de hornear"], "serves": "Hace alrededor de 12 cupcakes grandes o una torta de cumpleaños redonda de 22 cm / 9 pulgadas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Alinee la base de una lata de torta cuadrada profunda de 20 cm / 9 in con papel antiadherente y precaliente el horno a 180 ° C / 350 F / Gas 4.", "Derrita la mantequilla a fuego lento en una olla pequeña, viértala en un bol con el azúcar, el aceite, la harina de maíz (o el arrurruz o el cacao) y la vainilla. Batir bien hasta que quede suave, luego batir los huevos, seguido de la leche y la crema.", "Tamizar y batir la harina y el polvo de hornear en la mezcla de mantequilla en lotes hasta que quede suave, luego cuchara en la lata preparada y hornear durante 50-60 minutos (para un pastel grande). Mantenga un ojo atento hacia el final del tiempo de cocción y cubra con papel de aluminio si el pastel está demasiado oscuro. Para pastelitos, llene los papeles aproximadamente tres cuartas partes llenas y luego hornee por unos 20-25 minutos."]}, {"isVegetarian": true, "title": "Salsa blanca todo en uno", "url": "www_bbc_co_uk_food_recipes_allinonewhitesauce_66114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["425ml / 15fl oz de leche - esto puede ser infundido pero debe ser frío", "Harina normal de 20g / ¾oz", "40 g / 1½ oz de mantequilla", "sal y pimienta negra recién molida"], "serves": "Rinde 425ml / 15fl oz", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cuando esté listo para hacer la salsa, coloque la leche en una cacerola, luego simplemente agregue la harina y la mantequilla y suba todo gradualmente al punto de cocción lenta, batiendo continuamente con un batidor de globo, hasta que la salsa se espese y se vuelva lisa y brillante .", "Luego baje la temperatura a su configuración más baja posible y deje que la salsa se cocine muy suavemente durante minutos, revolviendo de vez en cuando. Mientras tanto, prueba y agrega aderezo."]}, {"isVegetarian": true, "title": "Pastel de polenta de almendra y limón con mascarpone de naranja", "url": "www_bbc_co_uk_food_recipes_almond_and_lemon_polenta_21317", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_and_lemon_polenta_21317_16x9.jpg", "ingredients": ["225g / 8oz de mantequilla sin sal", "225 g / 8 oz de azúcar en polvo", "3 huevos de gallinas camperas, golpeados", "225gr / 8 oz de almendras molidas", "115g / 4oz de polenta instantánea", "1 cucharadita de levadura en polvo (sin gluten si es necesario)", "3 limones, cáscara y jugo solamente", "azúcar en polvo, para quitar el polvo", "2 limones, solo jugo", "3 cucharadas de azúcar en polvo", "250g / 9oz de mascarpone", "2 naranjas, solo ralladura, más un chorrito de jugo", "50-75g / 1¾-2½oz de azúcar glas, tamizado", "75-100 g / 3-4 oz de azúcar en polvo, para quitar el polvo", "100ml / 3½fl oz de jugo de naranja", "4 satsumas, peladas y cortadas por la mitad horizontalmente"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase y forre una lata de pastel de 25 cm / 10 in con papel pergamino.", "Coloque la mantequilla y el azúcar en un tazón grande y bata con un batidor eléctrico hasta que esté pálido y ligero. Poco a poco agregue los huevos, batiendo todo el tiempo. Con una cuchara de metal grande, agregue las almendras molidas, luego doble la polenta, el polvo de hornear, la ralladura de limón y el jugo y mezcle para combinar.", "Coloque la mezcla en la lata de pastel preparada y hornee durante aproximadamente 1 hora y 15 minutos, o hasta que quede solo dorado.", "Mientras tanto, para hacer el glaseado de limón, ponga el jugo de limón y el azúcar en un tazón y mezcle bien. Cuando el pastel esté cocido, pellizque la superficie y vierta sobre la mezcla de limón. Deje que se enfríe en la lata durante 15 minutos.", "Para hacer el mascarpone naranja, bata suavemente el mascarpone, la ralladura de naranja, el chorrito de jugo de naranja y el azúcar glas juntos hasta que quede suave. Dejar de lado.", "Para las satsumas caramelizadas, caliente una sartén grande a fuego medio y agregue el azúcar y el jugo de naranja. Reduzca hasta que esté espeso y almibarado, agregue las mitades de satsuma y cocine suavemente por unos minutos en cada lado hasta que se suavice y se caramelice. Reserve el sirope para servir.", "Retire la torta de la lata y corte en rodajas para servir. Transfiera a un plato, espolvoree con azúcar glas y sirva con una quenelle de crema de mascarpone naranja, las mitades de satsuma caramelizadas y rocíe el sirope naranja para servir."]}, {"isVegetarian": false, "title": "Tarta de almendras con peras escalfados en vino tinto", "url": "www_bbc_co_uk_food_recipes_almond_cake_and_pears_45958", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_cake_and_pears_45958_16x9.jpg", "ingredients": ["Mantequilla 110g / 3½oz, ablandada, más extra para engrasar", "280 g / 9½ oz de azúcar en polvo", "3 huevos de gallinas camperas, golpeados", "2-3 gotas de extracto de almendra", "110 g / 3½ oz de almendras molidas", "Harina normal de 40 g / 1½ oz", "2 naranjas, corteza solo, cortado en tiras finas, para decorar", "50 g / 1¾oz de almendras en copos, para decorar", "50 g / 1¾oz de frutos secos mezclados, para decorar", "crema fresca, para servir", "300ml / 10fl oz de vino tinto", "130 g / 4½ oz de azúcar en polvo", "corteza de 1 limón no encerado", "1 ramita de canela", "4 peras de postre"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Ligeramente unte con mantequilla y forre una caja de sándwich de fondo suelto de 20 cm / 8 pulg.", "Batir la mantequilla con una cuchara de madera o en un procesador de alimentos para suavizar. Agregue 130g / 4½oz de azúcar gradualmente, batiendo constantemente, hasta que esté suave y liviano. Agregue los huevos y el extracto de almendras y bata bien. Dobla las almendras molidas y la harina.", "Incline la mezcla de la torta en la lata preparada y hornee durante 35 minutos. Pruebe si la torta está cocinada insertando un pincho en el centro; si sale limpio, el pastel está listo. Deje que la torta se enfríe en la lata durante 10 minutos y luego colóquela sobre una rejilla de alambre.", "Encienda la temperatura del horno hasta 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel de hornear.", "Mientras tanto, para las peras pochadas, coloque una cacerola grande a fuego medio. Vierta el vino y 300 ml / 10 fl oz de agua. Agregue el azúcar, corteza de limón y canela. Llevar a ebullición y dejar que burbujee durante 1 minuto.", "Mantener los tallos en las peras, pelar y quitar el ojo de la base de cada pera. Coloque las peras en el jarabe de vino y cocine por 30 minutos, o hasta que estén tiernas hasta la punta de un cuchillo.", "Para hacer la decoración de la torta, coloque la cáscara de naranja en una olla de agua a fuego alto. Llevar a ebullición, cambiar el agua y volver a hervir. Mientras tanto, haga un jarabe de azúcar calentando 50g / 1¾oz de azúcar y 100ml / 3½fl de agua en una olla. Coloque la corteza en el jarabe de azúcar y hierva durante 20 minutos. Transfiera a la bandeja de horneado preparada y hornee durante 15 minutos.", "Para hacer que la nuez se vuelva quebradiza para la torta, coloque el resto de 100 g / 3½ oz de azúcar en una cacerola a fuego lento y lentamente derrita hasta que se caramelice. Agregue las nueces, luego vierta la mezcla en papel de hornear para enfriar. Pica en frágil.", "Decora el pastel con las tiras de naranja y la nuez quebradiza y sírvelo con las peras escaldadas y la crème fraîche."]}, {"isVegetarian": true, "title": "Biscotti de almendra, arándano y naranja", "url": "www_bbc_co_uk_food_recipes_almond_cranberry_and_36170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 300g / 10½ oz", "½ cucharadita de sal", "2 cucharaditas de polvo de hornear", "Almendras peladas de 120 g / 4½ oz, más o menos picadas", "50 g / 1¾oz de arándanos secos, picados", "3 huevos grandes de gallinas camperas, ligeramente golpeados", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de extracto de anís (opcional) o ¼ cucharadita de extracto de almendra", "1 naranja grande, solo ralladura", "200g / 7oz de chocolate puro", "200g / 7oz de chocolate blanco", "100 g / 3½ oz de almendras copos tostadas, trituradas", "100 g / 3½ oz de pistachos picados", "brillo comestible (opcional)"], "serves": "Hace alrededor de 45-50 galletas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180C / 160F Fan / Gas 4 y alinee dos bandejas para hornear con papel para hornear.", "Para el biscotti, tamice la harina, la sal y el polvo de hornear en un tazón grande. Agregue el resto de los ingredientes de biscotti y mezcle bien.", "Divida la mezcla en cuatro y enrolle en troncos de alrededor de 20 cm / 8 pulgadas de largo. Coloque dos troncos en cada una de las bandejas de horneado preparadas, dejando suficiente espacio para que se extiendan. Hornea por 25 minutos - deben estar muy pálidos.", "Retirar del horno y dejar enfriar durante 10 minutos. Reduzca la temperatura del horno a 140C / 120C Fan / Gas 1.", "Corta los troncos en rodajas de aproximadamente 5 mm / ¼ de grosor y vuelve a colocarlos en las bandejas de horneado con el lado cortado hacia abajo. Hornee durante 15 minutos y luego voltee con cuidado y hornee por otros 15 minutos. Coloque en la rejilla para enfriar.", "Para la decoración, derrita los chocolates en dos tazones separados y ponga las almendras y los pistachos en platos separados.", "Sumerja los extremos de la biscotti en el chocolate blanco o liso y luego cubra con nueces picadas o váyase con una cobertura de chocolate. También puede agregar un poco de brillo comestible para una verdadera chispa de Navidad.", "Empaque en bonitos frascos o bolsas de celofán y agregue una cinta y una etiqueta si lo desea."]}, {"isVegetarian": true, "title": "Guiso de lentejas y almendras", "url": "www_bbc_co_uk_food_recipes_almond_lentil_stew_69086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_lentil_stew_69086_16x9.jpg", "ingredients": ["2 cucharadas de aceite de oliva, más extra para freír las almendras", "1 zanahoria, picada", "1 tallo de apio, picado", "1 cebolla picada", "1 nabo, picado", "2 dientes de ajo picados", "150 g / 5½ oz de champiñones, a la mitad", "Lentejas verdes 250 g / 9 oz", "1,2 litros / 2 pintas de caldo de verduras", "1 hoja de laurel", "1 ramita de romero", "4 ramitas de tomillo", "puñado de almendras", "1 cucharada de canela molida", "10 tomates cherry, descuartizados"], "serves": "Sirve 3-4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva en una olla grande y fría la zanahoria, el apio, la cebolla y el nabo hasta que se ablanden, aproximadamente cinco minutos.", "Agregue el ajo y los champiñones. Freír por otros cinco minutos.", "Agregue las lentejas a la sartén. Vierta sobre el caldo y agregue las hierbas. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 45 minutos.", "Justo antes del final del tiempo de cocción para el guiso, en otra sartén, freír las almendras en un chorrito de aceite de oliva con la canela durante dos minutos.", "Agregue los tomates cherry y caliente.", "Sirve el guiso de lentejas con almendras y tomates."]}, {"isVegetarian": true, "title": "Postre de almendras con helado de pudín de Navidad", "url": "www_bbc_co_uk_food_recipes_almond_puddings_with_37419", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g / 7oz de pudín de Navidad", "2 cucharadas de aguardiente", "Mazapán 50g / 1¾oz, picado en trozos pequeños", "400g / 14oz de helado de vainilla", "150 g / 5½ oz de mantequilla sin sal, ablandada, más extra para engrasar", "150 g / 5½ oz de azúcar en polvo", "2 cucharaditas de esencia de almendra", "3 huevos medianos de granja", "150g / 5½ oz de harina de auto crianza", "1 cucharada de leche entera", "Mazapán de 4 x 10cm / 4 en discos", "300 ml / 10 fl oz de leche", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½fl oz de brandy", "1 cucharada de harina de maíz o arrurruz", "20 g / oz de mantequilla"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para el helado con leche de Navidad, mezcle el pudín de Navidad, luego agregue el brandy, el mazapán picado y mezcle. Agregue el helado y vuelva al congelador para ponerlo.", "Precalentar el horno a 170C / 150C Fan / Gas 3.", "Para los budines de almendras, unte la mantequilla y el azúcar en un tazón para mezclar hasta que esté pálido y esponjoso. Agregue la esencia de almendra, luego agregue los huevos uno por uno (agregue un poco de harina si la mezcla comienza a cuajarse). Cuando los huevos se combinan, agregue el resto de la harina. Agregue la leche, si es necesario, para obtener una consistencia blanda.", "Engrase 4 moldes individuales de budín y coloque un círculo de papel para hornear en la parte inferior de cada uno. Presione un disco de mazapán en la parte inferior de cada molde. Con una cuchara, vierta la mezcla de pudin en los moldes, dejando espacio para que se levanten. Toca para eliminar cualquier bolsa de aire.", "Coloque los moldes en un plato hondo para asar y agregue suficiente agua hirviendo para llegar hasta la mitad de los lados de los moldes. Hornee durante 25 minutos, o hasta que estén suaves al tacto. Dejar enfriar un poco en los moldes.", "Mientras tanto, prepara la salsa de mantequilla de brandy. Pon la leche y el azúcar en una cacerola de base pesada. Llevar a ebullición y agregar el brandy.", "Mezcle la harina de maíz o el arrurruz con 50 ml / 2 fl oz de agua fría para obtener una solución lechosa sin grumos. Vierta la mezcla en la leche caliente. Batiendo todo el tiempo, cocine a fuego lento durante 5 minutos para cocinar la harina de maíz (no hierva o se descompondrá la harina de maíz, aunque arrurruz estará bien).", "Retire la sartén del fuego y continúe revolviendo. Si han aparecido grumos, cuela la salsa. Batir la mantequilla y mantener caliente hasta que esté listo para servir.", "Para servir, voltea los budines en platos para servir. Agregue una o dos cucharadas de helado y termine con la salsa."]}, {"isVegetarian": true, "title": "Pudín de arroz almendra y compota de cereza", "url": "www_bbc_co_uk_food_recipes_almond_rice_pudding_and_42007", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_rice_pudding_and_42007_16x9.jpg", "ingredients": ["1½ litros / 2½ pintas de leche entera", "300 g / 10½ oz de grano corto o arroz con leche", "15g / ½ oz de mantequilla", "3 cucharadas de azúcar en polvo", "1 vaina de vainilla, dividida", "100 g / 3½ oz de almendras blanqueadas, finamente picadas", "500g / 1lb 2oz de cerezas, sin hueso", "100 g / 3½ oz de azúcar en polvo", "1 limón, solo jugo", "2 cucharaditas de arrurruz", "kirsch, al gusto (opcional)", "100 ml / 3½ fl oz crema doble, batida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la leche, el arroz, la mantequilla, el azúcar impalpable y la vaina de vainilla en una olla grande. Caliéntelo muy lentamente, hasta casi en punto de ebullición, luego apáguelo. Cocine durante unos 30 minutos a fuego muy lento, revolviendo con frecuencia para asegurarse de que no se pegue al fondo.", "Mientras tanto, haz la compota de cereza. Coloque las cerezas en una cacerola con el azúcar impalpable, el jugo de limón y 300 ml / 10 fl oz de agua. Calienta lentamente, revolviendo constantemente, hasta que el azúcar se haya disuelto, luego hierve a fuego lento durante unos 10 minutos hasta que las cerezas estén ligeramente blandas. Mezcle el arrurruz con un poco de agua y revuelva hasta que quede suave. Agregue a las cerezas mientras hierven a fuego lento y revuelva hasta que la salsa se haya espesado un poco. Agrega el kirsch, si lo estás usando.", "Revuelva las almendras en el pudin. Sirva el budín con una cucharada de crema batida y una cucharada grande de compota de cereza."]}, {"isVegetarian": true, "title": "Tarta de almendras", "url": "www_bbc_co_uk_food_recipes_almond_tart_40368", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_tart_40368_16x9.jpg", "ingredients": ["150g / 5½ oz de harina común, tamizada, más extra para espolvorear", "75g / 2¾oz de mantequilla, refrigerada", "60g / 2¼ oz de azúcar en polvo", "1 yema de huevo de gallinas camperas", "225g / 8oz de almendras en copos", "120 g / 4¼ oz de mantequilla", "120 g / 4 oz de azúcar en polvo", "4 cucharadas de leche"], "serves": "Sirve 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Para la repostería, coloque la harina, la mantequilla y el azúcar juntos en un procesador de alimentos y blitz hasta que se asemejen a pan rallado. Agregue la yema de huevo y 2 cucharaditas de agua fría y mezcle hasta que la masa se una. Despliegue sobre una superficie de trabajo enharinada a un grosor de 5 mm, un poco más grande que la base de una lata agria acanalada de 24 cm / 9½ pulgadas.", "Use sus dedos para presionar la masa en las esquinas de la lata y alrededor de 1 cm / ½ en los lados para crear un pequeño borde alrededor del borde. Cubra con film transparente y déjelo en la nevera durante al menos 30 minutos.", "Retire la película adhesiva y pinche ligeramente la base de la masa con un tenedor. Línea con papel de hornear y la punta en al horno frijoles o lentejas. Hornea por 15 minutos. Retire los frijoles para hornear y el papel y vuelva al horno durante 3-4 minutos para secar la base sin colorear.", "Para hacer el relleno, tueste las almendras en una sartén seca a fuego medio-alto durante 2-3 minutos, hasta que estén doradas claras, vigilándolas de cerca. Inclínalas en un tazón.", "Coloque la mantequilla, el azúcar y la leche en la sartén a fuego medio. Cuando el azúcar se haya disuelto y la mantequilla se haya derretido, hierva y hierva durante 1 minuto. Agregue las almendras y mezcle bien antes de convertirlas en la caja de pastelería.", "Hornee durante 15-20 minutos, hasta que estén doradas. Sacar del horno y dejar enfriar. Sirve caliente o frío."]}, {"isVegetarian": true, "title": "Ajwain parathas", "url": "www_bbc_co_uk_food_recipes_ajwain_parathas_37143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina integral de 250 g / 9 oz, más extra para quitar el polvo", "¼ cucharadita de sal", "7 cucharaditas de aceite de oliva", "1½ cucharadita de semillas de ajwain"], "serves": "Rinde 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la harina en un tazón grande y haga un pozo en el centro. Agregue la sal y una cucharadita de aceite al pozo, luego agregue gradualmente 150 ml / 5 fl oz de agua tibia. Revuelva hasta que la mezcla forme una masa suave. Si la masa está seca y no se junta, agregue 1-2 cucharadas adicionales de agua.", "Amasar la masa apretando la mano en un puño, luego mojar los nudillos y presionarlos repetidamente en la masa, presionando contra el costado del tazón, hasta que se forme una masa suave y suave. Esto debería tomar alrededor de 10 minutos.", "Divida la masa en seis bolas de igual tamaño. Espolvoree cada bola con un poco de harina para evitar que se pegue, luego extiéndala en una superficie ligeramente enharinada en círculos de 15cm / 6 pulgadas.", "Espolvoree ¼ de cucharadita de semillas de ajwain sobre los círculos y presione las semillas en cada paratha.", "Unte una cucharadita de aceite de oliva sobre cada paratha. Con un cuchillo afilado, corta el paratha para hacer dos semicírculos y doblar, luego dobla nuevamente para hacer un cuarto de círculo (o triángulo).", "Aplana el triángulo con los dedos y arrástralo de nuevo. Use movimientos circulares para hacer esto para tratar de mantener la forma. Mientras rueda no apriete demasiado ya que esto hará que las capas se peguen juntas y el paratha no será escamoso. Aproximadamente 5 mm / ¼ in de espesor es bueno.", "Caliente una sartén poco profunda a fuego medio hasta que salpique un chorro de agua en la superficie.", "Coloque un paratha en la sartén y cocine durante 20 segundos, o hasta que la parte superior comience a dorarse y burbujee ligeramente. Gire el paratha con una espátula y continúe cocinando durante aproximadamente 30 segundos o hasta que aparezcan manchas marrones. Déle la vuelta una vez más y, con la espátula, presione con cuidado hacia abajo. Dé vuelta otra vez y repita en el otro lado hasta que tenga el crujiente deseado.", "Mantenga cada paratha caliente, mientras repite para cocinarlos todos. Servir caliente."]}, {"isVegetarian": false, "title": "Almendra y trucha con mantequilla de eneldo con guisantes 'bonne femme'", "url": "www_bbc_co_uk_food_recipes_almondanddillbuttere_85315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g / 1oz de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "100g / 3½oz de guisantes congelados", "2 cucharadas de vino blanco", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "55 g / 2 oz de almendras, picadas", "puñado de eneldo fresco, picado", "30 g / 1 oz de mantequilla, ablandada", "1 filete de trucha", "ramita de eneldo fresco, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los guisantes, caliente la mantequilla en una cacerola pequeña a fuego medio y fríela suavemente hasta que esté blanda pero no coloreada. Agregue el ajo y cocine por un minuto.", "Agregue los guisantes y el vino blanco. Llevar a ebullición y cocine a fuego lento hasta que el vino se haya reducido a la mitad.", "Agregue la crema doble y cocine a fuego lento hasta que espese un poco. Sazonar con sal y pimienta negra recién molida y reservar para mantener el calor.", "Para la trucha, coloque las almendras, el eneldo y la mantequilla en un bol y mezcle bien.", "Calentar la mantequilla de almendras y eneldo en una sartén y freír la trucha durante 2-3 minutos en cada lado, dando vuelta con una rodaja de pescado, hasta que esté dorado y completamente cocido.", "Para servir, coloque los guisantes en un plato, cubra con la trucha y vierta sobre la mantequilla que queda en la sartén. Adorne con una ramita de eneldo."]}, {"isVegetarian": true, "title": "Almendra y coliflor Korma curry", "url": "www_bbc_co_uk_food_recipes_almondandcauliflower_88512", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 cucharadita de cúrcuma molida", "½ cucharadita de pimentón molido", "½ cucharadita de pimienta de cayena", "4 coliflores bebé, descuartizado", "150ml / 5fl oz de crema doble", "2 cucharadas de cilantro fresco picado", "1 cucharada de cilantro fresco picado", "50g / 2oz de almendras copos tostadas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una cacerola y fría la cebolla hasta que se ablande, alrededor de 4 a 5 minutos.", "Agregue la cúrcuma, el pimentón y la pimienta de cayena y sofría por otros dos minutos.", "Agregue las coliflores en cuartos y cocine hasta que estén bien cubiertas con las especias, aproximadamente 4-5 minutos.", "Vierta la crema doble y cocine a fuego lento. Cocine a fuego lento durante cinco minutos, o hasta que la coliflor esté tierna. Agregue el cilantro picado.", "Servir en un bol adornado con más cilantro fresco picado y las almendras tostadas esparcidas por la parte superior."]}, {"isVegetarian": false, "title": "Salmón al cortezas de almendras con chile espinaca", "url": "www_bbc_co_uk_food_recipes_almondcrustedsalmonw_85526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de almendras enteras", "gran puñado de perejil fresco", "50g / 1¾oz de pan rallado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharadita de ajo y mostaza de rábano picante", "Filete de salmón 150g / 5½ oz, pelado", "1 cucharada de aceite de oliva", "2 dientes de ajo, en rodajas", "150 g / 5½ oz espinacas", "pizca de copos de chile", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la corteza de salmón, coloque las almendras, el perejil, el pan rallado, una pizca de aceite de oliva y el aderezo en una licuadora y pulse para combinar.", "Extienda el ajo y la mostaza de rábano picante sobre el filete de salmón y luego revuelva en las migas de pan. Pat para asegurar que las migas se peguen al salmón.", "Caliente el aceite de oliva restante en una sartén, agregue el salmón y la sartén durante 3-4 minutos por cada lado.", "Para la espinaca chili, caliente el aceite de oliva en un wok, agregue el ajo y cocine suavemente durante 1-2 minutos. Agregue la espinaca, el chile y el condimento y mezcle para que se marchiten ligeramente las espinacas. Dejar enfriar un poco y luego exprimir para eliminar el exceso de humedad de la espinaca", "Para servir, cuchara en el anillo de un chef, retire el anillo y la parte superior con el salmón."]}, {"isVegetarian": true, "title": "Praliné de almendra", "url": "www_bbc_co_uk_food_recipes_almondpraline_85698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125 g / 4½ oz de azúcar en polvo", "50g / 1¾oz de almendras copos tostadas", "exprimir jugo de limón"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Derrita el azúcar impalpable en una sartén hasta que se ponga dorado o alcance 300C / 570F en un termómetro de azúcar: tenga cuidado ya que el azúcar estará muy caliente.", "Agregue las almendras y el jugo de limón, revuelva bien y luego cuchara sobre una bandeja para hornear forrada de silicona.", "Dejar enfriar y luego cortar en cuñas con un cuchillo afilado.", "Sirva amontonado en un tazón pequeño."]}, {"isVegetarian": true, "title": "Queso de cabra almendrado", "url": "www_bbc_co_uk_food_recipes_almondrolledgoatsche_86765", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almondrolledgoatsche_86765_16x9.jpg", "ingredients": ["250g / 10½oz de remolacha fresca", "sal y pimienta negra recién molida", "75ml / 3fl oz de aceite de oliva", "1 cucharada de vinagre balsámico", "aceite vegetal, para freír", "Queso de cabra suave 200 g / 7 oz", "Harina normal de 75g / 3oz", "200g / 7oz de almendras en copos", "200g / 7oz de hojas frescas de albahaca", "75g / 3oz de almendras ahumadas", "1 diente de ajo", "100 g / 3½ oz de queso parmesano, o queso duro vegetariano similar", "100ml / 3½fl oz de aceite de oliva", "pequeño puñado de berros, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la remolacha, corte la remolacha en cubos y colóquela en un tazón. Sazonar bien con sal y pimienta negra recién molida y rociar con el aceite de oliva.", "Coloque en una bandeja para hornear y transfiéralo al horno para asar durante 30-40 minutos, o hasta que esté suave.", "Retire del horno y coloque en un recipiente. Rocíe con el vinagre balsámico y revuelva para cubrir.", "Para el queso de cabra, llene a medias una sartén profunda de fondo grueso con aceite y calor hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cortar el queso de cabra en ocho partes iguales y enrollar en bolas. Dragar las bolas en la harina.", "Extienda las almendras copos en un plato y enrolle las bolas de queso en las almendras copos, presionándolas en el queso, para cubrirlas por completo (no se preocupe si los copos de almendras se rompen un poco).", "Con cuidado, agregue las bolitas de queso al aceite caliente y fríe a fuego lento durante unos 30 segundos, un minuto o hasta que estén doradas por todas partes. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para el aderezo, coloque la albahaca, las almendras ahumadas, el ajo, el queso parmesano y el aceite de oliva en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloque una pequeña cantidad de berros en cada plato y coloque un pedazo de queso de cabra frito encima. Coloque unos cubos de remolacha alrededor del queso y ponga un poco del aderezo."]}, {"isVegetarian": true, "title": "Almendra semifreddo", "url": "www_bbc_co_uk_food_recipes_almondsemifreddo_82380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g / 4½oz de almendras blanqueadas", "Azúcar granulada 75g / 3oz", "aceite de oliva, para engrasar", "600 ml / 1 pinta de crema doble", "2 huevos de gallinas camperas, separados", "100g / 3½oz de azúcar glas, cernida", "2 cucharadas de vodka", "1 cucharada de sirope de cereza (opcional)"], "serves": "Para 6", "time": {"preparation": "durante la noche", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Para el praliné, tueste las almendras ligeramente en una sartén seca. Agregue el azúcar y revuelva hasta que se derrita y dore. Vierta sobre una bandeja para hornear ligeramente engrasada y, cuando esté fría, rompa en pedazos.", "Ponlo en una licuadora y mézclalo en trozos de pan rallado. No te preocupes si tienes algunas piezas más grandes; se agrega a la textura.", "Para el semifrío, batir la crema hasta que esté espeso, luego batir las yemas de huevo con 25 g / 1 oz del azúcar glas hasta que esté pálida. Batir los blancos hasta que se formen picos duros, y agregar el resto del azúcar glas, batiendo hasta que la mezcla quede en picos duros.", "Doble las yemas en la crema, luego doble las claras de huevo y el praliné. Agregue el vodka y el sirope de cereza si se usa.", "Cubra una lata pequeña de pan con film transparente. Cuchara en la mezcla de crema, nivelar y cubrir con más película adhesiva. Congelar por 24 horas. Deje reposar por unos minutos antes de salir del molde y servir."]}, {"isVegetarian": true, "title": "Sopa de almendras", "url": "www_bbc_co_uk_food_recipes_almondsoup_80315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g / 1oz de mantequilla", "1 diente de ajo, aplastado", "150ml / ¼ pinta de caldo de verduras", "Crema doble 50ml / 2fl oz", "75g / 3oz de almendras enteras, tostadas y finamente picadas", "2 cucharadas de aceite de oliva", "2 rebanadas de pan blanco, cortezas eliminadas, cortadas en cubos", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la sopa, derrita la mantequilla en una cacerola pequeña a fuego medio. Agregue el ajo y saltee hasta que se ablande.", "Agregue el caldo de verduras, crema doble y almendras y cocine a fuego lento durante cinco minutos.", "Licuar con una batidora y verter en un bol.", "Para los crotones, caliente el aceite en una sartén y agregue los cubos de pan revolviendo para cubrir los cubos de pan en aceite. Freír suavemente hasta dorar por todos lados.", "Sazonar con sal y pimienta negra recién molida y espolvorear con perejil.", "Para servir, espolvoréalos en la sopa."]}, {"isVegetarian": false, "title": "Almondy picaditos", "url": "www_bbc_co_uk_food_recipes_almondymincepies_14566", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almondymincepies_14566_16x9.jpg", "ingredients": ["Harina normal 225g / 9oz", "2 cucharaditas de canela molida", "140g / 5oz de mantequilla fría, cortada en cubos", "55 g / 2 oz de almendras molidas", "25 g de azúcar en polvo", "1 huevo, solo yema", "Mazapán dorado de 55g / 2oz", "Carne picada vegetariana de 170g / 6oz", "2 cucharadas de jerez", "azúcar en polvo, para rociar", "crema, natilla o mantequilla de brandy, para servir"], "serves": "Hace 12", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pon la harina en una licuadora con la canela. Agregue la mantequilla y blitz para formar migas de pan finas. Agregue las almendras, el azúcar, la yema de huevo y 2-3 cucharadas de agua fría y blitz para formar una masa suave. Amasar la masa brevemente sobre una superficie enharinada, luego envolver en film transparente y enfriar durante 30 minutos.", "Mientras tanto, corta el mazapán en trozos pequeños. Revuelva en la carne picada, junto con el jerez.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Extienda ligeramente la masa y corte doce rondas de 7,5 cm / 3 pulgadas. Coloque las rondas en una lata de 12 tarta engrasada engrasada. Divida la carne picada entre las cajas de repostería.", "Corta 12 estrellas y coloca una encima de cada tarta. Hornee durante 20 minutos hasta que la masa esté dorada y cocida. Transfiera a una rejilla y espolvoree con azúcar en polvo. Sirva con crema, natillas o mantequilla de brandy"]}, {"isVegetarian": true, "title": "Berenjena a la papa con arroz basmati", "url": "www_bbc_co_uk_food_recipes_aloo_baingun_with_37548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g / 6oz de arroz basmati", "2 cucharadas de aceite de girasol", "1 cebolla, finamente rebanada", "1 cucharadita de semillas de comino", "½ ramita de canela", "2 dientes", "2 vainas de cardamomo", "2 cucharadas de aceite de girasol", "20 g / oz de mantequilla", "1½ cebollas, cortadas en cubitos", "3cm / 1¼en raíz fresca de jengibre, pelado y rallado", "1½ cucharadita de cúrcuma", "1½ cucharadita de semillas de comino", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de chile verde fresco picado (ajustar al gusto)", "1 papa grande picada en cubos de 1cm / ½ en cubitos", "6-8 berenjenas bebe (o dos berenjenas medianas), cortadas en cubos de 2cm / ¾in", "25 g / 1 oz de hojas frescas de fenogreco (methi), picadas (o 3 cucharadas de methi seco)", "1 cucharadita de sal masala", "pequeño racimo de cilantro fresco, finamente picado", "sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el arroz, lávelo en un tazón de agua fría, drene y repita hasta que el agua salga limpia, luego déjelo en agua para remojar durante 15-20 minutos.", "Mientras tanto, para hacer el Aloo Baingan, caliente el aceite y la mantequilla en una cacerola grande con tapa a fuego medio. Agregue la cebolla y cocine por 5 minutos. Agregue el jengibre, la cúrcuma, el comino, las semillas de mostaza, el chile y 1 cucharadita de sal. Freír todo junto por unos minutos y agregar la papa. Agregue un poco de agua y cocine por 5-6 minutos, o hasta que esté al dente.", "Agregue las berenjenas a la sartén con el methi y otro buen chorrito de agua. Cubra con una tapa y deje que hierva durante 10-15 minutos, o hasta que las verduras estén suaves y cocidas.", "Para hacer el arroz, caliente el aceite en una olla grande con tapa a fuego medio, agregue la cebolla y cocine por 5 minutos o hasta que comience a ablandarse. Agregue todas las especias y cocine por un minuto más. Retire un poco de la mezcla de cebolla y reserve.", "Escurra el arroz de su líquido de remojo y agréguelo a la sartén con las especias. Vierta aproximadamente 235ml / 8¼fl oz de agua y cocine a fuego lento con mucha suavidad, tapado, durante 10-12 minutos, o hasta que el agua se haya absorbido y el arroz esté tierno.", "Para servir, esparza la mitad del cilantro y la cebolla reservada sobre el arroz. Revuelva el garam masala a través del curry y espárcelo con el cilantro restante."]}]