[{"ingredients": ["2 cucharadas de harina normal", "1 cucharadita de perejil de flatleaf fresco picado", "2 huevos de gallinas camperas", "50ml / 2fl de leche en oz", "pimienta negra recién molida", "aceite vegetal, para freír", "400 g / 14 oz de champiñones mixtos, limpiados, en rodajas a lo largo"], "method": ["Mezcle la harina y el perejil en un recipiente ancho y poco profundo. Batir los huevos, la leche y un poco de pimienta negra recién molida en un recipiente aparte.", "Caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las rodajas de champiñones en la mezcla de huevo, luego cubra con la mezcla de harina.", "Coloque con cuidado los champiñones en el aceite y fríalos durante 3-4 minutos o hasta que estén dorados. (Es posible que deba hacer esto por lotes. No atempere la sartén).", "Retire los champiñones del aceite con una espumadera y déjelos a un lado para drenarlos sobre papel de cocina."], "url": "www_bbc_co_uk_food_recipes_breadcrumbed_mushrooms_70965", "title": "Champiñones fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 g / 1 libra de remolacha cruda de 5 oz, pelada, cortada en trozos", "1 cebolla, más o menos picada", "½ diente de ajo, aproximadamente picado", "2 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "350g / 12oz de remolacha cocida, cortada en cuñas", "30g / 1 oz chalote, finamente picado", "2 cucharadas de perejil fresco de flatleaf, finamente picado", "2 cucharadas de perifollo fresco, finamente picado", "2 cucharadas de cebollín fresco, finamente picado", "3 cucharadas de vinagre balsámico", "4 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "4 pechugas de faisán, deshuesadas y sin piel", "sal y pimienta negra recién molida", "Harina normal de 75g / 3oz", "1 huevo de gallinas camperas, golpeado", "50g / 2oz de pan rallado", "25g / 1oz de mantequilla", "1 cucharadita de aceite de oliva"], "method": ["Para el puré de remolacha, coloque todos los ingredientes de puré de remolacha en un procesador de alimentos y mezcle hasta obtener un puré.", "Transfiera el puré a una sartén a fuego lento. Cocine por 30-40 minutos, revolviendo ocasionalmente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la remolacha marinada, coloque todos los ingredientes de remolacha en un tazón y sazone al gusto con sal y pimienta negra recién molida. Coloque en la nevera y déjela durante al menos una hora, preferiblemente más tiempo.", "Para el faisán, coloque los pechugas del faisán en una tabla de cortar limpia, cubra con una película adhesiva y golpee suavemente con un rodillo para aplastarlo ligeramente.", "Sazonar las pechugas de faisán con sal y pimienta negra recién molida, luego dragar en la harina. Sumerja los pechugas enharinados en el huevo para cubrir, luego sumerja en las migas de pan, cubriéndolo bien.", "Caliente una sartén hasta que esté caliente, luego agregue la mantequilla y el aceite. Cuando la mantequilla se haya derretido, agregue los pechugas de faisán empanizado y fríalos durante 1-2 minutos en cada lado, o hasta que se doren por completo y el faisán esté bien cocido.", "Para servir, coloca una cucharada de puré de remolacha en el centro de cada plato. Cortar los pechugas de faisán por la mitad a lo largo y colocar dos piezas en cada plato, equilibradas con el puré de remolacha. Vierta la remolacha marinada alrededor del faisán y sirva."], "url": "www_bbc_co_uk_food_recipes_breadcrumbedpheasant_87654", "title": "Pechuga de faisán panificado con puré de remolacha y remolacha marinada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "½ cebolla, picada", "Hojas de espinaca de 200 g / 7 oz, más o menos picadas", "5 cucharadas de perejil fresco picado", "300ml / 10fl oz de caldo de pollo o vegetal", "Pan crujiente blanco 85g / 3oz, rasgado", "1 lima, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de yogur al estilo griego, para servir"], "method": ["Calentar el aceite en una sartén y freír la cebolla durante 3-4 minutos, o hasta que se ablanden, luego agregue la espinaca, el perejil y el caldo. Llevar a ebullición, luego agregue el pan y el jugo de lima y cocine a fuego lento durante 3-4 minutos, o hasta que el pan comience a descomponerse.", "Sazonar, al gusto, con sal y pimienta negra recién molida y luego licuar hasta que quede suave con una batidora.", "Sirva la sopa en un tazón y cubra con el yogur."], "url": "www_bbc_co_uk_food_recipes_breadandspinachsoup_90402", "title": "Sopa de pan y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7 oz de azúcar", "200ml / 7fl oz de vinagre de vino blanco", "3 chiles", "5g de raíz de jengibre fresco, rallado", "1 diente de ajo, rallado", "Caña de la carne de 900g / 2lb", "550g / 1lb 4oz rabo de toro", "Restos de pollo de 450 g / 1 lb, cortados en trozos (alternativamente, use cuello de pollo o alas)", "450 g / 1 libra de huesos de cerdo (preferiblemente huesos del cuello, pero puede usar corvejones)", "pizca de sal", "225 g / 8 oz de grasa de cerdo de la parte posterior (opcional. Solo necesitarás esto si tu otra carne es muy magra)", "3 cucharadas de salsa de soja, al gusto", "1 cucharada de sake, al gusto", "1 cucharada de mirin, al gusto", "Harina normal de 75 g / 2½ oz", "4 claras de huevo de gallinas camperas", "Pan rallado de 150 g / 5½ oz", "2 x chuletas de cerdo, aplastadas", "¼ daikon, rallado", "¼ repollo blanco pequeño, en rodajas finas", "Fideos ramen a 400 g / 14 oz (preferiblemente fideos alcalinos recién hechos) o masa de ramen congelada a través de una mandolina para hacer monedas grandes o tiras", "½ manojo de cebollas de primavera, en rodajas finas", "Col de napa 100 g / 3½ oz, en rodajas", "150g / 5½oz de brotes de soja", "2 dientes de ajo, en rodajas finas", "100 ml / 3½ fl oz salsa ponzu"], "method": ["Para el tonkatsu, coloca el azúcar y el vinagre en una cacerola y llévalo a ebullición. Deje que se enfríe y luego agregue el resto de los ingredientes y mezcle hasta que quede suave.", "Para el caldo, precaliente el horno a 200C / 180C Fan / Gas 6.", "Caliente la pierna de buey y el rabo de toro con 2,25 litros / 4 pintas de agua en una olla a presión. Una vez que la presión ha aumentado, cocine durante 15 minutos a fuego medio-alto. Libere la presión y regrese la olla a la estufa, o transfiera el caldo a una olla de sopa más grande. Cocine a fuego lento durante al menos 30 minutos más a fuego medio.", "Mientras la carne se cocina, esparza los trozos de pollo y los huesos de cerdo en una bandeja para hornear. Asar durante 30-40 minutos, o hasta que todo esté bien dorado.", "Una vez que la espiga y el rabo de toro hayan terminado de hervir a fuego lento, quítelos del líquido de cocción y déjelos a un lado. Agregue los huesos de cerdo y pollo asados ​​al líquido de cocción junto con 1.2 litros / 2 pintas de agua y una gran pizca de sal. Agregue la grasa de la parte posterior de la carne de cerdo, si se usa, y vuelva a hervir a fuego lento. Cocine sin tapar, con la olla constantemente burbujeante pero no hirviendo, durante 30 minutos. Revuelva de vez en cuando.", "Retire el pollo y la carne de cerdo y reserve. Cuele el caldo para eliminar cualquier trozo grande de cartílago, luego regréselo a la bandeja. Sazone el caldo, al gusto, con salsa de soja, sake, mirin y más sal, si lo desea. Mantenga el caldo caliente.", "Para la chuleta de cerdo empanizada, ponga la harina, las claras de huevo y el pan rallado en recipientes separados. Polvo de las chuletas de cerdo en harina, sumergir en las claras de huevo y luego cubrir en pan rallado.", "Caliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír el cerdo durante 4-6 minutos, o hasta que esté dorado y cocido.", "Mientras tanto, hierva los fideos en una cacerola con agua con sal y escurra bien.", "Triture la carne de la carne reservada y el rabo de toro. Divida el caldo entre 4 tazones de ramen calentados y agregue la carne triturada. Agrega los fideos. Adorne con cebollas de primavera, repollo, brotes de soja y ajo.", "Cortar las chuletas de cerdo y colocarlas en una tabla de servir con el daikon, el repollo, la salsa tonkatsu y la salsa ponzu. Sirve con el caldo de fideos calientes."], "url": "www_bbc_co_uk_food_recipes_breaded_pork_cutlet_27947", "title": "Tonkatsu de chuleta de cerdo empanizado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite para freír", "150g / 5¼oz de queso Wensleydale, cortado en triángulos", "100g / 3½oz de pan rallado", "1 huevo de gallinas camperas, batido"], "method": ["Caliente el aceite listo para freír. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Sumerja el queso en el huevo y luego cubra con el pan rallado.", "Con cuidado, vierta el queso en el aceite caliente y fríalo por 2-3 minutos o hasta que esté crujiente y dorado.", "Escurrir sobre papel de cocina y servir caliente."], "url": "www_bbc_co_uk_food_recipes_breadedcheese_77127", "title": "Queso empanado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo alimentadas con maíz, deshuesadas y sin piel", "sal y pimienta negra recién molida", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas", "60g / 2½oz de pan rallado japonés", "2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "1 chalote de plátano, finamente cortado en cubitos", "1 diente de ajo, finamente cortado en cubitos", "75g / 3 oz de pepinillos, finamente cortados en cubitos", "4 cucharadas de alcaparras, enjuagadas", "3 cucharadas de perejil de flatillo picado", "2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "2-3 calabacines grandes, cortados en cubos", "2 ramitas de romero, finamente picadas", "175g / 6oz de tomates cherry"], "method": ["Para los escalopes de pollo, coloque una pechuga de pollo en una tabla adhesiva y cubra con una película adhesiva. Usando un martillo para carne o un rodillo, golpee el pollo hasta que tenga solo 5 mm de grosor.", "Retire de la película adhesiva y sazone con sal y pimienta negra recién molida. Repita con el pollo restante.", "Esparce la harina sobre un plato junto con la sal y la pimienta negra recién molida, al gusto. Coloque los huevos en un recipiente y golpee ligeramente, e incline el pan rallado en otro plato. Polvo de cada pechuga de pollo en la harina, luego sumerja en el huevo y finalmente cubra cada lado con el pan rallado.", "Para la salsa de alcaparras, caliente el aceite de oliva y la mantequilla en una sartén grande, luego agregue las pechugas de pollo, una a la vez, y fría hasta que estén doradas y completamente cocidas (aproximadamente 2 minutos por cada lado). Retirar con una rodaja de pescado y escurrir sobre varias capas de papel de cocina.", "Agregue los chalotes y el ajo a la sartén y fría por un minuto. Agregue los pepinillos y las alcaparras y cocine por un minuto más. Sazone con sal y pimienta negra, al gusto, y agregue el perejil.", "Para los calabacines, caliente el aceite de oliva y la mantequilla en una sartén y agregue los calabacines y el romero. Saltear durante 3-4 minutos hasta que se torne dorado y empiece a ablandarse. Agregue los tomates y cocine por otros dos minutos. Sazone con sal y pimienta negra recién molida, al gusto.", "Sirva el pollo con la salsa de alcaparras y una pila de calabacines y tomates a los lados."], "url": "www_bbc_co_uk_food_recipes_breadedchickenescalo_88767", "title": "Escalope de pollo empanizado, salsa de alcaparras, calabacines salteados y tomates cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Atasco de cerezas 340 g / 12 oz", "125 g / 4½ oz de mantequilla", "Pan blanco de 400g / 14oz, media barra de pan, en rodajas", "4 cucharadas de azúcar demerara", "10 cerezas", "10 fresas", "1 cucharadita de extracto de vainilla", "Crema doble de 200 ml / 7 fl oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mermelada de cereza y 340 ml / 12 fl oz de agua en una sartén y mezcle bien.", "Manteque generosamente el pan rebanado, luego corte cada rebanada en triángulos descuartizados.", "Arregle el pan en un plato de forma desordenada.", "Vierta el líquido de mermelada sobre el pan. Con una cuchara o cuchara ranurada, presione el pan hacia abajo para absorber todos los jugos.", "Espolvorea la parte superior con azúcar y hornea por 30 minutos.", "Mientras tanto, corta las cerezas y las fresas por la mitad, y descarta las piedras de cereza.", "Agregue el extracto de vainilla a la crema doble en un tazón grande y bata ligeramente hasta que se formen picos suaves cuando se quite el batidor del tazón.", "Cuando el pan esté cocido y caramelizado, corte en porciones y sirva con una porción de crema y una dispersión de fruta."], "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_72702", "title": "Pudin de pan y mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de champiñones", "100 g / 3½ oz de harina natural, sazonado con sal y pimienta negra recién molida", "2 huevos de gallinas camperas, golpeados", "100g / 3½oz de pan rallado", "500ml / 18fl oz de aceite vegetal", "200g / 7oz de yogur griego", "½ cucharadita de hojuelas de chile seco", "1 diente de ajo", "25g / 1oz de hierbas mezcladas (albahaca, perejil, cilantro, perifollo, cebollín)", "sal y pimienta negra recién molida"], "method": ["Mezcle los champiñones en la harina, cúbralos con huevo y luego cúbralos con pan rallado.", "Calentar el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. ¡No lo deje sin supervisión!)", "Freír los champiñones hasta que estén dorados. Retire con cuidado con una cuchara ranurada y drene las toallas de cocina.", "Para hacer la inmersión, coloque todos los ingredientes en un procesador de alimentos, sazone con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Sirva los champiñones en un plato con la salsa en un tazón pequeño."], "url": "www_bbc_co_uk_food_recipes_breadedmushroomswith_83302", "title": "Champiñones empanizados con chile y salsa de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 filetes de solla", "Harina normal de 30g / 1oz", "1 huevo, golpeado", "Pan rallado blanco 30g / 1oz", "1-2 cucharadas de aceite de oliva", "110g / 4oz de arroz basmati, cocido", "½ pimiento rojo, cortado en cubitos", "1 naranja, solo jugo", "3 cucharadas de perejil picado", "3 cucharadas de cilantro picado"], "method": ["Cubra los filetes de solla en harina, luego en el huevo batido y finalmente en las migas de pan.", "Calentar el aceite en una sartén antiadherente y freír los filetes durante 2-3 minutos en cada lado, hasta que estén dorados.", "Para la ensalada, mezcle el arroz, la pimienta, el jugo de naranja y las hierbas frescas en un tazón grande.", "Coloque el arroz en un plato y sirva los filetes empanizados al lado."], "url": "www_bbc_co_uk_food_recipes_breadedplaicewithher_76728", "title": "Solla empanizada con ensalada de arroz con hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ hogaza de pan blanco, sin corteza", "2 cucharadas de hierbas frescas mezcladas (perejil, albahaca, cebollín)", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 huevos de gallinas camperas", "1 filete de lenguado de limón", "2 puñados grandes de hierbas frescas mezcladas (perejil, albahaca, cebollín), finamente picadas", "1 cucharada de vinagre de vino blanco", "1 cucharada de aceite de oliva", "sal y pimienta recién molida", "apretón de jugo de limón"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque el pan en un procesador de alimentos y mezcle para formar migas.", "Agregue las hierbas con el aderezo y pulse nuevamente.", "Agregue el aceite de oliva y los huevos y mezcle para formar una pasta suave.", "Coloque el solomillo de limón en una bandeja para hornear antiadherente. Extienda la mezcla de hierba y pan en el pescado para cubrir. Coloque en el horno y hornee durante 5-6 minutos, hasta que estén dorados y cocidos.", "Para hacer el pesto, mezcle las hierbas, el vinagre, el aceite de oliva, la sal y la pimienta recién molida y el jugo de limón en un tazón.", "Para servir, transfiera el filete empanizado a un plato y cuchara sobre el pesto de hierbas."], "url": "www_bbc_co_uk_food_recipes_breadedsolewithherbp_79027", "title": "Lenguado empanizado con pesto de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pan blanco sin rebanar de 1 día de edad", "1 litro / 2 pintas de leche entera", "1 cebolla, pelada y descuartizada", "4 dientes", "2 hojas frescas de laurel", "1 cucharadita de granos de pimienta blanca", "2 cuchillas de maza fresca o apiladas ¼ cucharadita de maceta de tierra", "2 cucharaditas de sal", "30g / 1oz de mantequilla", "2 cucharadas de crema doble, opcional", "1 nuez moscada fresca, para rallar"], "method": ["Retire la corteza del pan y desgarre la barra pelada en un montículo de trozos o cubos ásperos de aproximadamente 2 cm de diámetro. Deberías terminar con 175-200 g (6¼-7¼oz) de cubos. Si el pan ya no está rancio, déjelo en una rejilla para que se seque.", "Vierta la leche en una cacerola. Presione un diente en cada cuarto de la cebolla.", "Agregue los cuartos de cebolla, las hojas de laurel, los granos de pimienta y las hojas de macis (o espolvoree la macis macerada en la sartén) junto con la sal y lleve a la mezcla hasta que hierva.", "Retire la sartén del fuego. Cubra la olla con una tapa y deje que los ingredientes se infundan durante al menos media hora, aunque puede dejarlo durante unas horas si eso le ayuda con su programa de cocción.", "Después de que la mezcla se haya infundido, coloque la sartén nuevamente a fuego muy bajo. Con una cuchara ranurada, quite las cebollas, los granos de pimienta, los clavos de olor, las hojas de laurel y las hojas de macis.", "Agregue el pan a la cacerola y cocine durante unos 15 minutos, revolviendo de vez en cuando, momento en el cual la salsa debe haberse espesado y calentado.", "Justo antes de servir la salsa de pan, agregue la mantequilla a la cacerola y revuelva hasta que la mantequilla se haya derretido y se haya combinado con la salsa y sazone, al gusto, con sal.", "Agregue la crema (si está usando). Rallar un poco de nuez moscada, agregando más una vez que haya vertido la salsa de pan en un recipiente calentado o en un bote con salsa."], "url": "www_bbc_co_uk_food_recipes_breadsauce_84755", "title": "Salsa de pan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 litro", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadsauce_84755_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["550ml / 1 pinta de leche entera", "½ cebolla blanca, cortada en cuartos y tachonada con 3 dientes", "2 hojas frescas de laurel", "Pan blanco en rodajas de 150 g / 5¼ oz, cortado en cuadrados de 3 cm / 1 in", "1 cucharadita de mostaza inglesa", "nuez moscada recién rallada", "50 g / 1¾oz de mantequilla sin sal, picada en cubitos", "sal y pimienta negra recién molida"], "method": ["Caliente la leche en una sartén con la cebolla tachonada y las hojas de laurel. Llevar a ebullición brevemente y luego reducir a fuego lento a fuego lento.", "Agregue los cubos de pan y revuelva hasta que comience a descomponerse. Retire la cebolla y las hojas de laurel y mezcle la mostaza y un poco de nuez moscada recién rallada al gusto.", "Cocine lentamente por 10 minutos, revolviendo regularmente.", "Para terminar, agregue la mantequilla, sazone con sal y pimienta recién molida. Colóquelo en un recipiente o bote de salsa, cúbralo con film transparente y déjelo en un lugar tibio hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_breadsauce_84868", "title": "Salsa de pan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fechas medjool 250 g / 9 oz", "2 cucharaditas de canela molida", "75g / 2½oz de bayas de goji", "75g / 2½oz semillas de calabaza", "150 g / 5½ oz de linaza marrón", "50 g / 1¾oz de semillas de cacao", "Semillas de chia 25g / 1oz", "Copos de maíz de 25 g / 1 oz (sin gluten si es necesario)", "100g / 3½ oz de avena orgánica avena (no instantánea)"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4 y alinee la parte inferior y los lados de una lata cuadrada de 20 cm con papel de hornear.", "Ponga las fechas y raspe con los dedos en una cacerola pequeña, agregue la canela, cubra con 325ml / 11fl oz de agua fría, lleve a ebullición y deje burbujear durante 5 minutos. Apague el fuego, y bata con un tenedor hasta que tenga un puré áspero.", "Coloque todos los ingredientes restantes en un tazón grande, agregue la mezcla de la fecha y mezcle hasta que todo esté combinado. Uso un par de guantes desechables de vinilo para esto.", "Mézclate en tu molde preparado y hornea en el horno por 30 minutos, hasta que esté firme y listo, dorado por arriba y más oscuro por los bordes. Dejar enfriar en la lata antes de cortar en pedazos."], "url": "www_bbc_co_uk_food_recipes_breakfast_bars_20_09760", "title": "Desayunadores 2.0", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 barras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_20_09760_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "75ml / 2½fl oz de jarabe dorado", "175 g / 6 oz de avena cocida", "50 g / 1¾oz de semillas de calabaza", "50g / 1¾oz semillas de girasol", "Avellanas de 50g / 1¾oz, aplastadas o picadas", "60 g / 2¼ oz de albaricoques secos, toscamente picados"], "method": ["Precaliente el horno a 180C / 160C Fan / Gas 4, y forre una bandeja para hornear de 24x24cm / 9x9in con papel antigrasa.", "Caliente la mantequilla y el sirope dorado en una cacerola pequeña a fuego medio hasta que burbujee.", "Mientras tanto, incline la avena, las semillas, las nueces y los albaricoques en un tazón grande. Vierta la mezcla de jarabe caliente sobre la avena y mezcle bien para combinar.", "Vierta en la bandeja de horno forrada y presione hacia abajo en una capa uniforme. Hornee durante 20 minutos, hasta que estén dorados.", "Dejar enfriar durante 10 minutos, luego girar y cortar en 16 cuadrados. Cuando esté frío, transfiéralo a un recipiente hermético; se mantendrá durante hasta una semana."], "url": "www_bbc_co_uk_food_recipes_breakfast_bars_49065", "title": "Barras de desayuno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_49065_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Patatas de 250g / 9oz, peladas y cortadas en cubos de 1.5 cm", "250 g / 9 oz de zanahorias, cortadas en bastones de 2 cm x 1 cm", "50ml / 2fl oz de aceite vegetal", "2 cucharaditas de semillas de mostaza negra", "1 cebolla roja mediana, finamente picada", "1 cucharadita de ají de Kashmiri en polvo", "½ cucharadita de cúrcuma", "2 tomates, picados", "½ cucharadita de sal", "1 cucharadita de sal masala", "4-6 huevos de corral, fritos, para servir", "Panes Naan, para servir"], "method": ["Cocine las papas en agua hirviendo con sal durante unos 10 minutos o hasta que estén tiernas. Retirar con una cuchara ranurada, dejar de lado, luego cocinar las zanahorias en la misma agua durante unos tres minutos, o hasta que estén tiernas, pero aún con un poco de crujido.", "Calentar el aceite en una cacerola o karahi de base pesada y freír las semillas de mostaza hasta que empiecen a reventar. Agregue la cebolla y fría a fuego moderado durante cinco minutos o hasta que se ablanden. Agregue el chili en polvo y la cúrcuma y fría por 30 segundos, luego agregue las papas, zanahorias, tomates, sal, garam masala y 50 ml / 2 fl oz de agua. Cocine por 3-5 minutos, revolviendo para romper las papas un poco, hasta que los tomates se reduzcan y se ablanden.", "Para servir, cepille el pan indio con un poco de ghee derretido, mantequilla o aceite vegetal si lo desea, o aléjese. Sirve el bhaji con panes naan y un huevo frito."], "url": "www_bbc_co_uk_food_recipes_breakfast_bhaji_32025", "title": "Vegetales de desayuno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "50g / 1¾oz de mantequilla", "3 salchichas herby, despellejadas", "1 cebolla, en rodajas", "½ papa grande, incluida la piel", "2 huevos de gallinas camperas"], "method": ["Calienta el aceite en una sartén grande. Agregue la mantequilla y las salchichas peladas y cocine durante unos minutos, revolviendo para asegurarse de que la carne se dore.", "Agregue la cebolla a la sartén.", "Rallar la patata, incluida la piel y exprimir sobre el fregadero para eliminar la humedad.", "Agregue la papa a la sartén.", "Cuando los ingredientes del pan estén cocidos, agriete los huevos en la sartén. Servir."], "url": "www_bbc_co_uk_food_recipes_breakfast_hash_02520", "title": "Hachís de desayuno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_hash_02520_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina blanca fuerte, más extra para espolvorear", "7 g de levadura instantánea (una bolsita)", "1 cucharadita de sal", "2 cucharadas de aceite de oliva", "175ml / 6fl oz de agua tibia", "200g / 7fl oz pasados", "1 cucharada de pasta de tomate", "2 dientes de ajo", "1 cucharadita de orégano seco", "puñado de hojas de albahaca fresca", "sal y pimienta negra recién molida", "4 salchichas gordas, peladas y rotas en pedazos pequeños", "8 rebanadas de tocino, cortadas en trozos", "4 rebanadas de pudin negro, rotas (opcional)", "4 setas de campo, en rodajas finas", "4 tomates medianos, en rodajas", "2-4 huevos de gallinas camperas", "2 bolas de mozzarella, rotas", "aceite de oliva, para lloviznar"], "method": ["Para hacer la base de pizza, ponga la harina en un tazón grande (o mezcle la base) y espolvoree la levadura. Revuelva bien antes de agregar la sal. Mezcle el aceite de oliva con el agua, luego haga un pozo en el centro de la harina y comience a verterlo. Revuelva hasta que tenga una masa bastante húmeda, luego revuelva y amase hasta que ya no esté pegajosa, sino suave y flexible.", "Deje que se levante durante una hora en un tazón grande, cubra, luego derribe y divídalo en dos piezas grandes o 4 más pequeñas, dependiendo del tamaño que pueda cocinar.", "Cuando esté listo para cocinar las pizzas, precaliente el horno a su configuración más alta y caliente las bandejas para hornear o una piedra para pizza. Dé forma a las pizzas en círculos grandes, luego espolvoree más bandejas para hornear con harina y transfiera las bases de pizza a ellas, para que pueda deslizarlas directamente sobre la bandeja para hornear o la piedra para pizza.", "Haga la salsa de tomate simplemente mezclando todos los ingredientes de la salsa de tomate en un procesador de alimentos con mucha sal y pimienta.", "Extienda una pequeña cantidad de salsa de tomate sobre la base de la pizza, luego cubra con los trozos de salchicha, tocino, morcilla (si se usa), champiñones y tomates.", "Rompa un huevo o dos en la parte superior, asegurándose de que los huevos estén contenidos por otros ingredientes para que el blanco no se escurra (alternativamente, puede subir ligeramente los bordes para asegurarse). Espolvorear con trozos de mozzarella y luego rociar con aceite de oliva.", "Hornee en el horno durante aproximadamente 8-10 minutos, o hasta que la pizza esté crujiente y los ingredientes estén cocidos."], "url": "www_bbc_co_uk_food_recipes_breakfast_pizza_68739", "title": "Pizza de desayuno", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 2 pizzas grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para freír", "3 cebollas en rodajas", "1 diente de ajo, picado", "4 salchichas de cerdo, cocidas y en rodajas", "6 huevos grandes de gallinas camperas", "125ml / 4fl oz de crema doble", "1 cucharada de hojas frescas de tomillo", "sal y pimienta negra recién molida", "400 g / 14 oz pueden frijoles cocidos, cocidos", "caviar negro (opcional)"], "method": ["Precalentar la parrilla a su configuración más alta.", "Derrita la mantequilla en una sartén grande a fuego lento. Agregue las cebollas y el ajo y fría a fuego lento durante 15-20 minutos, hasta que estén blandos y comience a caramelizar.", "Agregue las salchichas en rodajas a la sartén y mezcle bien.", "Batir los huevos, la crema y el tomillo en un bol y sazonar con sal y pimienta negra recién molida.", "Agregue la mezcla de huevo a la mezcla de salchicha y cebolla y revuelva suavemente a fuego medio durante diez minutos.", "Transfiera a la parrilla para cocinar por cinco minutos, o hasta que esté dorado.", "Para servir, coloque la frittata en un plato grande y corte en cuartos. Sirva las porciones en platos limpios con una generosa cucharada de frijoles horneados y una cucharada de caviar, si los usa."], "url": "www_bbc_co_uk_food_recipes_breakfastfrittata_85042", "title": "Tortilla de desayuno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de ginebra", "1 cucharada de Cointreau, o licor de naranja similar", "1 cucharada de jugo de limón", "1½ cucharadita de mermelada de naranja", "espiral de cáscara de naranja, para adornar"], "method": ["Coloque la ginebra, el Cointreau, el jugo de limón y la mermelada en una coctelera con hielo y agite bien para combinar.", "Para servir, colar en un vaso de Martini y adornar con una espiral de cáscara de naranja."], "url": "www_bbc_co_uk_food_recipes_breakfastmartini_87148", "title": "Desayuno Martini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 besugo (aproximadamente 350 g / 12 oz cada uno), limpiado, recortado y escalado", "3 dientes de ajo pequeños, finamente picados", "1 chili rojo seco, desmenuzado", "100 g / 3½ oz de nueces, aproximadamente picadas", "4 cucharadas de aceite de oliva virgen extra, más extra para cocinar", "½ limón, solo jugo", "2 cucharaditas de melaza de granada", "2 cucharaditas de miel", "Hojas de cilantro de 30g / 1oz, finamente picadas", "100 g / 3½ oz de semillas de granada", "sal y pimienta negra recién molida", "puñado de nueces, más o menos picadas", "semillas de granada", "aceite de oliva virgen extra, para lloviznar", "Rodajas de limón"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Haga dos cortes diagonales en los peces de cada lado. Sazone el interior del pescado con sal y pimienta.", "Mezcle los ingredientes restantes y sazone. Ponga esta mezcla dentro de cada pescado y póngalos en una lata de asar ligeramente engrasada, o en dos latas de asar engrasadas separadas. Sazone el exterior del pescado y rocíe con aceite de oliva.", "Hornee durante 20 minutos o hasta que estén cocidos. Compruebe el pescado en su parte más gruesa: la carne debe ser blanca, no vidriosa. Si no están listos, regrésalos al horno por otros 4 minutos más o menos.", "Justo antes de servir, tueste las nueces en una sartén seca hasta que estén fragantes.", "Esparza el pescado con nueces y semillas de granada, rocíe con aceite de oliva y sirva inmediatamente con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_bream_stuffed_with_76363", "title": "Besugo relleno de nueces y granadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]