[{"isVegetarian": false, "title": "Pain perdu with sticky apricots", "url": "www_bbc_co_uk_food_recipes_painperduwithstickya_86043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "5 tbsp/75ml double cream", "1 tbsp caster sugar", "1 reday-made teacake, sliced horizontally into three ", "1 tbsp butter", "110g/4oz tinned apricots, drained", "3 tbsp marmalade ", "1 tbsp chopped fresh mint"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the eggs, cream and sugar together to form a batter then dip the teacake pieces into the batter until well coated.", "Heat the butter in a non-stick frying pan and fry the bread on each side for 2-3 minutes, or until golden brown on both sides.", "Place the apricots and marmalade into a separate frying pan and warm until the jam melts. Stir in the mint.", "To serve stack the fried teacake slices on a plate and spoon over the sticky apricots."]}, {"isVegetarian": true, "title": "Pakora with mango chutney", "url": "www_bbc_co_uk_food_recipes_pakorawithmangochutn_92807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2.5cm/1in piece fresh root ginger, peeled, minced", "1 small red chilli, chopped", "1 lime, zest and juice", "1 garlic clove, peeled, crushed", "pinch ground cinnamon ", "pinch ground coriander", "225g/8oz soft light brown sugar", "225g/8fl oz cider vinegar", "3 mangoes, stones removed, peeled, diced ", "2 onions, peeled, sliced", "1 head broccoli, cut into florets", "½ cauliflower head, cut into florets", "200g/7oz gram flour (chickpea flour)", "1 small red chilli, finely chopped", "1 tsp ground turmeric", "1 tsp cayenne pepper", "salt and freshly ground black pepper", "100-175ml/3½-6fl oz ice cold water", "vegetable oil, for deep frying", "plain yoghurt, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat two tablespoons of vegetable oil in a frying pan over a medium heat. Add the ginger, chilli, lime zest and garlic and fry for 3-4 minutes, or until softened.", "Stir in the ground cinnamon, ground coriander, sugar, cider vinegar, lime juice and mangoes. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 20-30 minutes, or until the mixture has reduced and has the consistency of jam. (NB: The chutney makes double the amount needed for this recipe. The remaining chutney can be kept in sterilised jars in the fridge for up to 3 weeks.)", "Meanwhile, for the pakora, boil the onion slices in a pan of salted water for 2-3 minutes. Add the broccoli and cauliflower florets and continue to boil for 1-2 minutes, or until the onions are tender. Drain well and set aside.", "For the batter, mix together the flour, chilli, ground turmeric, cayenne pepper and seasoning in a bowl until well combined. Gradually add the water in a thin stream, whisking continuously, until a thick batter forms. (NB: You may not need to use all of the water.)", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the blanched cauliflower florets and broccoli into the batter, then lower spoonfuls of the sliced onion into the batter.", "Carefully lower the battered vegetables into the hot oil in batches and fry for 4-5 minutes, or until crisp and golden-brown. Remove from the heat using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining battered vegetables.", "To serve, divide the pakora among four serving baskets. Serve the yoghurt (if using) and mango chutney in dipping bowls alongside."]}, {"isVegetarian": true, "title": "Palmiers", "url": "www_bbc_co_uk_food_recipes_palmiers_83940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz ready-rolled puff pastry", "25g/1oz caster sugar", "1 tsp ground cinnamon", "50ml/2fl oz double cream, whipped ", "1 orange, cut into wedges, to serve"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Unroll the pastry and brush with water. Mix the sugar and cinnamon together in a bowl, then sprinkle over the pastry to lightly cover. Fold in both of the long ends of the pastry so that they meet in the middle. Brush with more water and sprinkle with more of the sugar mixture. Fold the pastry over again and slice 1cm/½in slices and place on a baking tray.", "Place in the oven and bake for ten minutes, or until cooked through. Serve with whipped cream and oranges."]}, {"isVegetarian": true, "title": "Pampushki (Baltic buns)", "url": "www_bbc_co_uk_food_recipes_pampushki_baltic_buns_10557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz white bread flour", "150g/5½oz rye flour", "7g dry instant yeast (1 sachet)", "1 tsp sugar", "1 tsp salt", "1 tbsp oil or butter", "300ml/10 fl oz milk, warmed", "2 garlic cloves, crushed", "25g/1oz butter or oil", "salt"], "serves": "Makes 8 bread rolls", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["If using a stand mixer, attach the dough hook. Put all the dry ingredients in, mixing in the yeast thoroughly before you add the salt, then add the butter. Start the motor running and gradually add all the milk until you have a dough. If your dough is still a little dry add a little water. Knead with the dough hook for 5 minutes. Cover with a damp cloth and leave somewhere warm to rise until doubled in size, this will take at least an hour.", "If you are doing this by hand, put the dry ingredients in a large bowl and mix. Add the butter and combine.  Make a well in the centre and gradually incorporate all of the milk, taking flour from the sides as you go. When you have something resembling a dough, knead until smooth. Leave to rise as before.", "When your bread has risen, knock back the dough, and cut it into 8 pieces. Knead each piece and form it into a tight ball (by tucking the dough under as you turn it). Dust a baking tray with a little flour and arrange the dough balls on the tray – one in the middle, the others placed around it, placed slightly apart – like a flower. Cover the bread rolls with a damp cloth and leave to rise again. ", "Preheat the oven to its highest setting.", "When the bread rolls are well risen and are just touching, they are ready to bake. Put in the oven and immediately reduce the temperature to 200C/180C Fan/Gas 6. Bake for around 20 minutes.", "Meanwhile, make the topping. Mash the garlic, butter and salt together. Put in a frying pan and melt very gently – you don’t want either the butter or the garlic to brown. When the bread rolls are out of the oven, spread the mixture over the rolls while they are still hot."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_92222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil, plus extra for drizzling", "2 onions, peeled, one sliced and the other roughly chopped ", "3 garlic cloves, peeled, two finely chopped and the third finely sliced", "1 large red pepper, seeds removed, chopped", "4 large tomatoes, roughly chopped", "3 tbsp chopped fresh flatleaf parsley", "2 sprigs fresh oregano, chopped", "6 skinless and boneless chicken thighs, cut into bite-sized pieces", "sea salt and freshly ground black pepper", "1 tsp smoked paprika", "125g/4½oz cooking chorizo, chopped", "400g/14oz Spanish short-grain rice, such as Calasparra", "pinch saffron strands", "150ml/5fl oz dry sherry ", "1 litre/2 pints hot vegetable stock", "200g/7oz fresh peas ", "1 preserved lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a large frying pan or paella pan. Add the sliced onion, the two cloves of finely chopped garlic and the chopped red pepper. Gently fry for 5-6 minutes over a medium heat, or until the onions are softened but not coloured. ", "Place the tomatoes, parsley and oregano into a bowl and mix well to combine. ", "Season the chicken thighs with sea salt and freshly ground black pepper and rub with the smoked paprika. Heat the remaining olive oil in a frying pan and fry the chicken for 2-3 minutes on each side, or until golden-brown all over. Transfer the chicken to a bowl, along with any pan juices. ", "Return the paella pan to the heat and add the chopped onion, the finely sliced garlic, and the chopped chorizo. Cook for 3-4 minutes, or until the chorizo is golden-brown. ", "Add the rice to the pan along with the saffron and stir to coat in the oil, then add the chicken pieces. Pour in the sherry and stir once, then allow to bubble for 2-3 minutes until most of the liquid has evaporated. Pour in the vegetable stock and turn down the heat to a simmer. Cover the pan with a lid and cook for 20 minutes, stirring once or twice during cooking, until all of the stock is absorbed and the rice is tender. ", "Sprinkle the fresh peas over the paella, then top with the prepared tomatoes, oregano and parsley. Turn the heat off and cover with a lid for 2-3 minutes.", "To serve, fluff up the paella with a fork and spoon into serving bowls, with a wedge of preserved lemon to garnish."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_7100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paella_7100_16x9.jpg", "ingredients": ["170g/6oz chorizo, cut into thin slices", "110g/4oz pancetta, cut into small dice", "2 cloves garlic finely chopped", "1 large Spanish onion, finely diced", "1 red pepper, diced", "1 tsp soft thyme leaves", "¼ tsp dried red chilli flakes", "570ml/1pint calasparra (Spanish short-grain) rice", "1 tsp paprika", "125ml/4fl oz dry white wine", "1.2 litres/2 pints chicken stock, heated with ¼ tsp saffron strands", "8 chicken thighs, each chopped in half and browned", "18 small clams, cleaned", "110g/4oz fresh or frozen peas", "4 large tomatoes, de-seeded and diced", "50ml/2fl oz good olive oil", "1 head garlic, cloves separated and peeled", "12 jumbo raw prawns, in shells", "450g/1lb squid, cleaned and chopped into bite-sized pieces", "5 tbsp chopped flatleaf parsley", "Salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat half the olive oil in a paella dish or heavy-based saucepan. Add the chorizo and pancetta and fry until crisp. Add the garlic, onion and pepper and heat until softened. Add the thyme, chilli flakes and calasparra rice, and stir until all the grains of rice are nicely coated and glossy. Now add the paprika and dry white wine and when it is bubbling, pour in the hot chicken stock, add the chicken thighs and cook for 5-10 minutes.", "Now place the clams into the dish with the join facing down so that the edges open outwards. Sprinkle in the peas and chopped tomatoes and continue to cook gently for another 10 minutes.", "Meanwhile, heat the remaining oil with the garlic cloves in a separate pan and add the prawns. Fry quickly for a minute or two then add them to the paella. Now do the same with the squid and add them to the paella too.", "Scatter the chopped parsley over the paella and serve immediately."]}, {"isVegetarian": false, "title": "Pan-fried hake on the bone with Arbequina olive oil mash, surf clams, chorizo and flat parsley", "url": "www_bbc_co_uk_food_recipes_pan-_fried_hake_on_the_33468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large potato, preferably Desirée variety, peeled and evenly diced", "10g/¼oz unsalted butter", "5 tbsp double cream", "sea salt and freshly ground black pepper", "125ml/4fl oz Arbequina olive oil", "2 x trimmed and cleaned darnes of hake, about 200g/7oz each", "olive oil, for cooking", "125g/4½oz hot cooking chorizo, peeled and diced", "1 small banana shallot, peeled and diced", "16 surf clams, washed", "50ml/2fl oz manzanilla sherry", "50ml/2fl oz white wine", "25g/1oz unsalted butter", "1 sprig flat leaf parsley, leaves picked and chopped", "lemon juice, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mash, place the potatoes in a pan of salted water and bring to the boil. Simmer until the potatoes are tender and then drain well and push through a ricer. ", "Return the potatoes to the pan over a low heat and then stir in the butter and cream. Season well with sea salt and freshly ground black pepper then slowly whisk in the olive oil until thoroughly combined. Set the pan aside in a warm place.", "For the hake, heat a non-stick pan over a high heat and add a splash of olive oil. Season the hake darnes with sea salt and freshly ground black pepper and place them in the pan. ", "Sear on one side for two minutes, turn onto the other side and add the chorizo, shallots and clams. ", "Cook for a further minute until the chorizo has started to release its oil and the clams have started to open. ", "Drain off a little of the oil then add the sherry and wine. Bring to the boil and reduce the sauce then turn the hake again and add the butter and parsley.", "Stir the sauce to emulsify it, scraping the sediment from the bottom of the pan to add extra flavour. The sauce should have a syrupy consistency and the hake cooked through – the flesh should be opaque when a small knife is inserted near the bone. Check the sauce for seasoning and add a squeeze of lemon juice.", "To serve, spoon some of the mash onto a serving plate, top with the hake, spoon over the sauce and scatter around the clams and chorizo. "]}, {"isVegetarian": false, "title": "Pan-fried balsamic pear salad with pancetta, gorgonzola and a warm honey dressing", "url": "www_bbc_co_uk_food_recipes_pan-fried_balsamic_pear_35881", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_balsamic_pear_35881_16x9.jpg", "ingredients": ["2 x 120g/4oz packets rocket", "handful pine nuts", "16 slices pancetta", "2 knobs of butter", "1 tsp olive oil", "4 pears, peeled, cored, quartered", "1 tsp honey, plus extra for the dressing", "1 tsp balsamic vinegar, plus 2 tbsp for the dressing", "½ tsp Dijon mustard", "150g/5oz gorgonzola, ripped into chunks", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Distribute the rocket evenly among four serving plates.", "Heat a frying pan and toast the pine nuts for three minutes, or until golden-brown. Remove the nuts from the frying pan.", "Heat the pancetta in a frying pan over a medium heat and cook until crispy. Remove and set aside to drain on kitchen paper.", "Place a knob of butter and the oil into a clean frying pan set over a low heat. Once the butter melts, add the pears, salt, pepper and honey. Turn up the heat and cook for a further five minutes.", "Add the balsamic vinegar and cook for another minute, then take the pan off the heat. Remove the pears from the pan, reserving any juice that may be left.", "Arrange the pears and pancetta on top of the rocket leaves so each person has four quarters each. ", "For the dressing, put the pan containing the pear juices back on the heat and add the remaining knob of butter, a dash of honey, the mustard, salt and pepper and the pine nuts. Cook the mixture until warmed through.", "Pour the dressing over the pears and the rocket. Scatter over the gorgonzola and serve."]}, {"isVegetarian": false, "title": "Fried bacon with poached egg and tomatoes", "url": "www_bbc_co_uk_food_recipes_pan-fried_bacon_with_76907", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_bacon_with_76907_16x9.jpg", "ingredients": ["1 tsp sunflower oil", "4 rashers of rindless smoked back bacon", "1 tsp white wine vinegar", "2 free-range very fresh eggs (fridge cold)", "8 cherry tomatoes, halved", "good handful of watercress", "drizzle of good-quality balsamic vinegar", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Brush a large non-stick frying pan with sunflower oil, using the tip of a pastry brush. Place the pan over a medium heat and add the bacon. Cook for 2 minutes until lightly browned, then turn and fry on the other side for another 3 minutes.", "While the bacon is cooking, half fill a medium non-stick saucepan with water, add the vinegar and bring to the boil. Turn the heat to low, so the water is only just bubbling. Crack the eggs into the water, one at a time, spacing them well apart. Cook for 2½ minutes. ", "The eggs should rise to the surface within a minute. If the egg white sticks to the bottom of the pan, lift it gently with a wooden spoon. Alternatively, you can use a hob-top egg poacher, lightly greased with sunflower oil.", "Add the tomatoes to the pan with the bacon and season with plenty of black pepper. Cook the tomatoes for about a minute until just beginning to soften, turning them once. ", "Put a small pile of watercress on each plate. Put some bacon and tomatoes on the plates and drizzle with a dash of balsamic vinegar. Take the eggs out of the water with a slotted spoon and place them on top. Season with a little more pepper and tuck in right away while it’s all lovely and hot."]}, {"isVegetarian": false, "title": "Pan-fried black pudding with scallops and ginger purée", "url": "www_bbc_co_uk_food_recipes_pan-fried_black_pudding_99293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh root ginger, peeled and thinly sliced", "4 fresh curry leaves", "75g/2¾oz palm sugar", "50g/2oz tamarind paste", "pinch salt", "25g/1oz caster sugar", "1 apple, cut horizontally into 12 thin slices", "10g/½oz butter", "8 thin slices pancetta", "8 x 1cm/½in thick slices black pudding", "1 tsp olive oil", "4 large scallops with roe", "½ lemon, juice only", "4 tsp extra virgin olive oil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the ginger, curry leaves, palm sugar, tamarind and 500ml/18fl oz water to the boil in a large saucepan, then reduce the heat and simmer for 10 minutes. Remove from the heat and set aside to cool slightly, then blend to a fine purée in a food processor. Season with a pinch of salt. ", "Heat the caster sugar in a frying pan over a low to medium heat until melted and beginning to caramelise. Add the apple slices and cook in the caramelised sugar for a few seconds before adding the butter. When the butter has melted, add a splash of water to the pan and swirl the contents, without stirring, until the caramel is smooth and the apple slices are coated in caramel.", "Dry-fry the pancetta slices in a non-stick frying pan over a high heat, until crisp on both sides. Remove from the pan and set aside.", "Add the black pudding slices to the same pan and dry-fry for 30 seconds only on each side, until just crisp on the outside but still soft on the inside. Remove from the pan and set aside.", "Drizzle the scallops with a little of the oil, then add them to the same pan and fry for 1-1½ minutes on each side, or until golden-brown on both sides and just cooked through. Squeeze over the lemon juice then remove the scallops from the pan.", "To serve, cut the scallops in half widthways. Place one disc of caramelised apple into the centre of the serving plates. Top with a small spoonful of the spice purée, then a slice of black pudding, then half a scallop. Repeat the stacking process once more to create two towers on each plate. Drizzle a spoonful of spice purée around the edge of each plate, then top the towers with a couple of pieces of crispy pancetta and finish with a drizzle of extra virgin olive oil."]}, {"isVegetarian": false, "title": "Pan-fried calf’s liver, grilled baby leeks and creamed cabbage", "url": "www_bbc_co_uk_food_recipes_pan-fried_calfs_liver_78370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ savoy cabbage, shredded ", "3 tbsp olive oil ", "knob of butter", "½ onion, thinly sliced", "½ carrot, peeled and thinly sliced", "¼ celeriac, peeled and thinly sliced", "350ml/12fl oz double cream", "6 slices calf’s liver", "4 baby leeks, cut in half lengthways", "salt and freshly ground black pepper", "hot red wine gravy, to serve", "watercress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the cabbage in a large pan of salted water for 3 minutes then drain. ", "Heat 1 tablespoon of the oil and the butter in a frying pan and cook the onion until softened. Add the carrot and celeriac and cook for 2 minutes. Pour in the cream and season with salt and pepper. Add the cabbage to the pan and cook until the volume of the liquid has reduced by a third. ", "Meanwhile, heat 1 tablespoon of the oil in a frying pan and fry the liver slices for 1½ minutes on each side. Season with salt and pepper.", "Oil a griddle pan with the remaining oil and place over a high heat. Add the leeks and griddle until slightly charred. Season with salt and pepper.", "To serve, divide the cabbage between two serving plates. Add the liver and top with the leeks. Pour over the gravy and garnish with the watercress."]}, {"isVegetarian": false, "title": "Pan-fried chicken pie", "url": "www_bbc_co_uk_food_recipes_pan-fried_chicken_pie_32885", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_chicken_pie_32885_16x9.jpg", "ingredients": ["2 tbsp olive oil", "large knob of butter", "1 leek, thinly sliced", "4-5 spring onions, thinly chopped", "150g/5oz button mushrooms, thinly sliced", "225g/8oz boneless cooked chicken, shredded", "150g/5oz feta cheese, crumbled", "4 tbsp chopped dill", "4 tbsp chopped parsley", "4-6 tbsp double cream", "a little freshly ground nutmeg", "freshly ground black pepper and a little salt ", "olive oil, for brushing ", "200g/7oz filo pastry"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, heat the olive oil and butter in a pan and fry the leeks, spring onions and mushrooms until softened.", "Place in a large bowl with the cooked chicken, feta cheese, herbs and enough cream to make the mixture moist.", "Season the filling with lots of freshly ground black pepper and a little nutmeg, to taste. Try the filling and add a little salt if needed. Feta cheese is very salty so you might not need it.", "Brush the base of a frying pan with olive oil. Lay some large pieces of pastry over the pan so that it drapes over the sides and brush all over with olive oil, then spoon in half the filling.", "Rip a piece of pastry and lay on top of the filling to cover. Brush with olive oil and sprinkle with a little water.", "Spoon in the rest of the filling; place more pastry on top in the same way as before to make the top layer, brush with olive oil and sprinkle with water.", "Fold the pastry, hanging over the edges of the pan, back over the top to form a nice round pie. Brush again with olive oil and sprinkle lightly with water.", "Fry for 6-8 minutes on a low heat, checking all the time so it doesn’t go brown too fast. ", "Remove from the heat, turn over like a Spanish tortilla by placing a plate over the frying pan and quickly turning the pie upside-down on to the plate. Quickly slide it back into the pan and cook the other side for 6-8 minutes, or until golden-brown.", "Place on a round wooden board and cut into large wedges. Serve hot or cold with a green salad or vegetables. "]}, {"isVegetarian": false, "title": "Pan-fried cod with a parsley crust, sautéed girolles and vermouth sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_cod_with_a_42389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "2 tbsp vermouth", "300ml/10½fl oz fish stock", "225ml/8fl oz double cream", "140g/5oz breadcrumbs", "55g/2oz fresh flatleaf parsley", "6 tbsp olive oil", "4 x 175g/6¼oz cod fillets, skin on", "25g/1oz unsalted butter", "100g/3½oz girolle mushrooms", "2 tbsp flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the vermouth sauce, melt the butter in a frying pan and fry the shallots and garlic for 2-3 minutes. De-glaze the pan with the vermouth and cook until the volume of the liquid has reduced by half. Add the fish stock and cream and cook again until the volume of the liquid has reduced by half. ", "Blend the mixture in a blender and pass the sauce through a sieve.", "For the pan-fried cod with a parsley crust, preheat the grill to the highest setting.", "Blend the breadcrumbs, parsley and four tablespoons of the olive oil in a food processer  until well combined. ", "Roll the mixture out on a work surface and cut out four pieces the same size as the cod fillets.", "Meanwhile, heat the remaining olive oil in a frying pan and fry the cod, skin-side down, for 2-3 minutes.", "Remove the cod fillets from the pan, peel off the skin and place the parsley crust on top. ", "Grill the cod fillets for 2-3 minutes.", "For the sautéed girolles, melt the butter in a frying pan, fry the mushrooms for 2-3 minutes, then stir in the chopped parsley.", "To serve, spoon the mushrooms around each of four serving plates, place a cod fillet into the centre of each plate and spoon around the vermouth sauce."]}, {"isVegetarian": false, "title": "Pan-fried Dover sole with a shrimp and caper butter sauce and wilted spinach", "url": "www_bbc_co_uk_food_recipes_pan-fried_dover_sole_20729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole Dover sole, filleted and pin boned ", "25g/1oz plain flour, seasoned with salt and pepper", "25ml/1fl oz olive oil ", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 lemon, juice only", "10g/ baby capers", "2 tsp gentleman’s relish", "2 tbsp finely chopped parsley", "100g/3½oz brown shrimps", "50g/1¾oz unsalted butter", "50g/1¾oz baby spinach", "pinch freshly grated nutmeg", "1 bunch fresh watercress", "1 lemon, peeled with spoon to remove all the pith and finely sliced to resemble flowers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Dover sole, dust the fish in the seasoned flour. Heat a large frying pan and add the oil. Once hot, add the fish skin-side down and cook for a couple of minutes. Turn over and cook for a further minute.", "Remove the fish from the pan and set aside to rest.", "Heat the butter in a separate frying pan, add the shallots and fry for a few minutes. One it has reached the nut brown stage (or beurre noisette), add the lemon juice, capers, gentleman’s relish, parsley and shrimps and cook for a couple of minutes.", "For the wilted spinach, in the same pan you fried your fish, heat the butter, add the spinach and a tablespoon of water and cook until wilted. Finish with a grating of fresh nutmeg.", "To serve, place some spinach in the centre of each serving plate and top with the fish. Spoon the sauce over and around the fish. Garnish with watercress and lemon flowers."]}, {"isVegetarian": false, "title": "Pan-fried duck breast with a Moroccan cauliflower salad, duck scratchings and a beetroot dressing", "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_breast_41664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch mixed baby beetroot (red, candy, striped), trimmed", "2 thyme sprigs", "2 duck breasts, skin removed and reserved", "2 tbsp olive oil, plus extra for drizzling ", "25g/1oz butter", "1 white cauliflower, half broken into florets, half grated ", "200ml/7fl oz milk ", "3 tbsp sesame seeds ", "1 tbsp black onion seeds", "1 tsp cumin seeds", "1 tsp crushed coriander seeds", "4 crushed cardamom pods", "half purple cauliflower, broken into florets", "half Romanseco cauliflower, broken into florets", "3 garlic cloves, finely chopped", "1 red chilli", "2 cooked red beetroots", "1 cooked yellow beetroot, peeled", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Rub the baby beetroots with olive oil and sprinkle with thyme, salt and pepper. Cover with foil and cook for about 2 hours, or until soft. ", "Meanwhile, carefully remove the skin from the duck breasts, wrap in cling film and freeze until solid. Shred as finely as possible. ", "Once the beets are cool enough to handle, peel and cut into quarters. ", "Heat a dash oil in a frying pan over a medium heat and cook the duck breasts for 10–12 minutes until medium rare. Remove and set aside to rest. ", "Add the duck skin to the pan and fry until crisp. Remove and drain on kitchen paper. When cool enough to handle, slice into strips.", "Melt the butter in a frying pan over a medium heat. Add the grated cauliflower, garlic and chilli and gently cook, without colouring, for 5–8 minutes. Add the milk and cook until soft. Pour into a blender or food processor and blend into a purée. Pass through a fine sieve and set aside. ", "Dry fry the seeds and spices in a frying pan until toasted and aromatic. Bash in a pestle and mortar.", "Blanch the cauliflower florets in boiling water for 3 minutes, drain and toss in the toasted spices, chilli and garlic. Set aside. ", "Blitz the cooked red beetroots in a blender until smooth. ", "Place the cauliflower purée in the centre of two plates and scatter over the cauliflower florets and baby beetroot. Slice the duck on a diagonal into strips and serve between the two plates. Scatter the duck scratchings on top. Spoon over the beetroot dressing, finish with the yellow beetroot slices and serve. "]}, {"isVegetarian": false, "title": "Pan-fried monkfish with wild garlic and fennel", "url": "www_bbc_co_uk_food_recipes_pan-fried_fillet_of_83911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 large garlic cloves (new season if possible), sliced", "100g/3½oz unsalted butter", "450g/1lb fennel bulb, thinly sliced", "600ml/20fl oz fish stock", "salt and freshly ground black pepper", "100g/3½oz semolina", "15g/½oz sprigs wild fennel leaves", "4 x 225g/8oz pieces prepared monkfish fillet", "4 tbsp sunflower oil", "2 tsp lemon juice", "splash aniseed liqueur", "20g/¾oz wild garlic leaves, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.  ", "Cut 13 of the garlic cloves lengthways into long thin pieces.  Melt half of the butter in a pan, add the garlic and sliced fennel and fry over a medium heat until lightly browned.  Add half of the fish stock and salt and pepper, and simmer for 15 minutes, or until the fennel is tender.", "Meanwhile slice the remaining three cloves of garlic and put into a food processor with the semolina and all but one sprig of fennel leaves. Blend until you have an aromatic pale-green powder. ", "Coat the pieces of monkfish in the semolina mixture.  Heat the oil in an ovenproof frying pan, add a small knob of the butter and the monkfish pieces and fry over a moderate heat, turning now and then, until they are golden-brown all over.  Transfer the pan to the oven and cook the monkfish for a further 10 minutes.", "Remove the pan from the oven and lift the fillets onto a chopping board. Slice diagonally into thick slices, keeping each piece in shape. Transfer to a plate and keep warm.", "Finely chop the remaining wild fennel herb. Add it to the pan in which the monkfish was cooked along with the cooked fennel mixture, lemon juice, liqueur, and wild garlic.  ", "Simmer rapidly until slightly reduced in volume, then add the remaining butter and simmer until it has blended in to make a rich sauce.  Adjust the seasoning if necessary.  Lift the fish onto four warmed plates and spoon some of the sauce around each piece."]}, {"isVegetarian": false, "title": "Pan-fried duck with sherry, raisin and pine nut sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_with_90914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz raisins", "300ml/10fl oz oloroso sherry", "4 x 175-200g/6-7oz duck breasts", "25g/1oz caster sugar", "2 tsp sherry vinegar", "1 tbsp red wine vinegar", "¾ tsp arrowroot", "25g/1oz pine nuts, toasted", "olive oil, for frying", "1 large pumpkin, thinly sliced, skin on", "1 banana shallot, finely diced", "75g/2¾oz girolles", "4 sprigs thyme", "watercress sprigs, to garnish", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the raisins in the sherry overnight. Place the duck breasts on a plate and cover them loosely with a sheet of greaseproof paper. Leave them in the fridge overnight (this will help dry out the skin and make it extra crispy).", "When ready to start cooking, put the sugar and sherry vinegar in a small pan with 1 tablespoon cold water and cook over a low heat until the sugar has completely dissolved. Increase the heat and boil vigorously until the syrup turns into a deep amber-coloured caramel (CAUTION: boiling sugar is extremely hot). ", "Remove the pan from the heat and add the red wine vinegar (take care as it will bubble quite energetically). Return the pan to the heat, add the soaked raisins and the sherry. Leave to simmer gently for 20 minutes. ", "Mix the arrowroot with 2 tablespoons water, stir into the sauce and simmer for 1 minute, then add the pine nuts. Season to taste and keep warm over a low heat.", "Lightly score the skin of each duck breast in a diamond patter, taking care not to cut down into the flesh. Season the meat with salt and pepper and the skin with just salt. ", "Heat a dry, heavy-based frying pan over a high heat. Add the duck breasts, skin-side down, lower the heat to medium and cook for 3-4 minutes until the skin is crisp and golden brown. Turn the breasts over and cook them for 5 minutes if you like them pink, or slightly longer if you like them a little more cooked. Remove the breasts from the pan and place on a board. Leave to rest for 5 minutes. ", "Meanwhile, using the same pan that you cooked the duck in, add a little olive oil and fry the sliced pumpkin for a few minutes. ", "Heat a little olive oil in a small frying pan and add the shallot. As they start to turn colour, add the girolles and thyme, fry for no more than 1 minute. Season to taste. ", "Place the pumpkin on warm serving plates. Slice each duck breast diagonally into long thin slices and place alongside the pumpkin. Add some of the girolles around the side of the plate, spoon the sauce over and garnish with the watercress sprigs. "]}, {"isVegetarian": false, "title": "Pan-fried gnocchi with broccoli pesto and grilled veg", "url": "www_bbc_co_uk_food_recipes_pan-fried_gnocchi_with_36887", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_gnocchi_with_36887_16x9.jpg", "ingredients": ["350g/12oz broccoli (about 1 head), roughly chopped", "100ml/3½fl oz olive oil, plus extra to loosen if desired", "50-100g/2-3½oz toasted pine nuts, to taste", "1 garlic clove, roughly chopped", "1 green chilli, finely chopped", "50g/1¾oz parmesan cheese (or vegetarian alternative), freshly grated", "salt and pepper, to taste", "300g/10½oz green vegetables such as asparagus, purple sprouting broccoli, courgettes and baby leeks", "olive oil, for drizzling and frying", "1 pack shop-bought gnocchi", "3 slices pancetta, baked or grilled, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the broccoli in boiling salted water for 3-4 minutes, or until tender. Drain and immediately plunge into ice water to stop it from cooking any further. Drain again and add to a blender with the olive oil, toasted pine nuts, garlic, chilli and a good grating of parmesan cheese. Blend to a paste to make pesto. Taste and season with salt and pepper and add more olive oil if needed to get the consistency you like.", "To cook the vegetables, heat a griddle pan to hot. Drizzle the green vegetables with olive oil and cook on a griddle pan. (You can use any vegetables you like for this, but if you choose root veg or anything bigger than asparagus you might need to blanch it first to soften before griddling.)", "Heat a good amount of olive oil in a frying pan and tip in the gnocchi straight from the pack. Fry until golden-brown all over, so they look like mini roast potatoes.", "Serve up the gnocchi and griddled veg with a good dollop of broccoli pesto. You could also sprinkle over some crumbled pancetta for a crisp, salty garnish."]}, {"isVegetarian": false, "title": "Pan-fried grouse with Marsala sauce and wilted kale", "url": "www_bbc_co_uk_food_recipes_pan-fried_grouse_with_94896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 slices pancetta", "2 grouse breasts", "salt and freshly ground black pepper", "small handful sage leaves", "olive oil", "butter, for frying", "2 tbsp olive oil", "1 garlic clove, peeled and crushed", "2 shallots, peeled and finely sliced", "½ chilli, finely chopped", "4 tbsp Marsala wine", "2 tbsp rowan jelly (alternatively use redcurrant or blackcurrant jelly)", "1 tbsp olive oil", "knob of butter", "2 garlic cloves, peeled and crushed", "300g/10½ oz curly kale", "100ml/3½fl oz chicken stock"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the grouse, lay three slices of pancetta on a board, overlapping slightly. Place a grouse breast in the centre, season with salt and pepper and place a few sage leaves on top. Wrap up the breast in the pancetta. Repeat with the other breast. ", "In a frying pan, heat 1-2 tablespoons olive oil and fry the grouse for 2-2½ minutes on each side. Add a knob of butter and, when it has melted, baste the breasts. Remove from the heat and set aside to rest.", "For the sauce, heat the oil in a pan and gently fry the garlic, shallot and half the chopped chilli for a few minutes to soften. Add the Marsala and rowan jelly. Season to taste with salt and freshly ground black pepper. Reduce the heat and simmer until the sauce has thickened.", "For the kale, heat the oil and butter in a pan and gently fry the garlic and the reserved chilli for two minutes. Add the kale, stir in the stock and cook for 2-3 minutes, or until the kale has wilted.", "To serve, spoon the kale onto serving plates and place the grouse alongside. Drizzle with the sauce. "]}, {"isVegetarian": false, "title": "Pan-fried gurnard with broad bean, spinach and mint stew", "url": "www_bbc_co_uk_food_recipes_pan-fried_gurnard_with_79627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "200g/7oz new potatoes, lightly scraped then quartered lengthways", "½ onion, peeled, sliced finely ", "1 garlic clove, peeled, finely chopped", "400ml/14floz chicken stock", "salt, to taste", "200g/7oz frozen shelled and podded broad beans, thawed", "250g/9oz spinach, chopped", "10g/½ oz fresh mint leaves, sliced finely ", "freshly ground black pepper, to taste", "4 x 175g/6oz gurnard fillets, pin boned, skin scored", "110g/4oz streaky bacon, cut into lardons"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a large saucepan and fry the onion and potatoes gently for about 10 minutes, or until the vegetables are softened but not brown.", "Add the garlic and cook for a further minute. ", "Add the stock and season with salt, to taste. Bring the stew to the boil, then reduce the heat, cover and simmer for about 10 minutes or until the potatoes are tender. ", "Add the broad beans and cook for a further minute. Stir in the chopped spinach and cook for 1-2 minutes, or until the spinach is wilted. Finally, stir in the mint and season with freshly ground black pepper, to taste.", "Heat a frying pan until hot, add the remaining olive oil and fry the gurnard fillets, skin side down, for 2-3 minutes, or until just crisp. Flip the fillets over and continue to cook for another two minutes, or until the fish is cooked through.", "Remove the gurnard from the pan and set aside to rest for 1-2 minutes.", "Meanwhile, heat a separate frying pan and  fry the bacon lardons for 2-3 minutes, or until golden-brown and crisp.", "To serve, divide the stew between two bowls, top each with two gurnard fillets and sprinkle over the bacon lardons."]}, {"isVegetarian": false, "title": "Hake with button mushrooms and vinegar", "url": "www_bbc_co_uk_food_recipes_pan-fried_hake_with_95796", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_hake_with_95796_16x9.jpg", "ingredients": ["2 x 200g/7oz slices of hake, cut through the bone (alternatively use thick hake fillets)", "pinch sea salt flakes", "3-4 tbsp plain flour, for dusting", "1 tbsp vegetable oil ", "50g/1¾oz butter", "splash malt vinegar", "1 tbsp fresh thyme leaves ", "1 tbsp demerara sugar", "2 tbsp chopped celery leaves, plus extra for garnish", "25g/1oz butter", "1 onion, peeled and finely diced", "1 garlic clove, grated", "pinch salt", "300g/10½oz button mushrooms, washed, sliced", "75ml/2¾fl oz dry sherry", "20g/¾oz dried mushrooms", "150ml/5fl oz double cream", "1 tbsp Greek yoghurt", "75g/2¾oz butter", "pinch sea salt flakes", "1 celery root (the end of a bunch of celery), cleaned, trimmed, stringy bits removed, cut in half through the root", "½ tsp fresh thyme leaves", "30g/1¼oz toasted hazelnuts, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the hake, sprinkle one side of the hake with salt flakes. Set aside.", "For the mushroom purée, heat the butter in a saucepan over a medium heat. Add the onion and garlic and season with a pinch of salt. Fry for 3-4 minutes, or until softened.", "Add 200g/7oz of the button mushrooms and continue to cook for a further 1-2 minutes, stirring regularly. Pour in the sherry and bring to the boil, then add the dried mushrooms. Reduce the heat until the mixture is simmering and continue to simmer until most of the liquid has evaporated.", "Add the double cream and return the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 4-5 minutes, or until the volume of liquid has reduced by one-third. Remove from the heat and set aside to cool slightly.", "In a food processor, blend the mushroom mixture to a purée, adding the yoghurt as you blend. Strain the purée through a fine sieve into a clean saucepan, then keep warm over a low heat.", "For the celery root, bring 200ml/7fl oz water to the boil in a frying pan. Add the butter and a pinch of salt, then add the celery root and reduce the heat until the water is simmering. Continue to simmer for 20-25 minutes, or until most of the water has evaporated. Baste the celery root with the buttery juices remaining in the pan, then sprinkle over the thyme leaves and set aside. Keep warm.", "For the mushroom purée, sprinkle the remaining mushrooms with sea salt and set aside for 5 minutes.", "For the hake and butter sauce, sprinkle the flour onto a plate. Dust the hake in flour to completely cover. ", "Heat the oil in a frying pan over a medium heat. Add the fish and fry for 5-6 minutes, or until crisp and golden-brown on one side. Turn the fish over, add the butter and cook for 4-5 minutes, or until the hake is crisp and golden-brown on both sides and the butter has turned brown.", "Add the malt vinegar and thyme to the pan, then baste the fish in the butter and vinegar mixture. Remove the fish from the pan. ", "Add the sugar to the pan, stirring it in the butter and vinegar mixture until dissolved. Stir in the chopped celery leaves.", "To serve, put a spoonful of the mushroom purée into the centre of each plate. Place one piece of celery root on top with the hake alongside. Garnish with the salted mushrooms and a few sliced celery leaves, then drizzle the butter sauce around the edge of the plates. Finish with the toasted hazelnuts."]}, {"isVegetarian": false, "title": "Halibut with deep-fried, miso-glazed aubergine and edamame beans", "url": "www_bbc_co_uk_food_recipes_pan-fried_halibut_with_97859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines, cut into 2cm/1in cubes", "180ml/6fl oz white miso", "160g/5½oz caster sugar", "50g/1¾oz clear honey", "4 tbsp groundnut oil", "4 x 150g-200g/5½-7oz fillets of halibut, skin on, pin boned", "75g/2½oz unsalted butter", "100g/3½oz edamame beans", "4 tbsp white sesame seeds", "4 tbsp black sesame seeds", "4 tbsp Korean cayenne threads", "2 tbsp mixed micro cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aubergine and edamame beans, half-fill a large saucepan or deep-fat fryer with the oil. Heat the oil to 180C, or until a 2cm/1in cube of bread dropped into the oil turns golden-brown and crisp within 1 minute. (CAUTION: do not leave hot oil unattended.)", "Deep-fry the diced aubergine for 2-3 minutes or until golden-brown and crisp. Set aside to drain on kitchen roll.", "In a saucepan, heat the white miso, sugar, honey and 100ml/3½fl oz water. Cook until it has reduced in volume and turned golden-brown.", "For the halibut, heat a large frying pan and add the oil. Once hot add the fish skin-side down and cook for 2-3 minutes, turn over and cook for a further 2-3 minutes.", "Just before serving add the butter and baste the fish. Allow the fish to rest before serving.", "To serve, place the diced aubergine onto a serving plate and spoon over the sauce. Place the fish in the centre and garnish with the edamame beans, sesame seeds, cayenne threads and micro cress."]}, {"isVegetarian": false, "title": "Pan-fried mackerel, black olive croute with tomato and pomegranate salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_black_81238", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ripe tomatoes, chopped", "¼ cucumber, peeled and chopped", "1 red pepper, seeds removed and chopped", "50-100ml/2-3½fl oz sherry vinegar, to taste", "4 tbsp extra virgin olive oil", "8 slices white baguette, cut on diagonal 1cm/½in thick", "2 tomatoes, peeled and sliced", "1 red onion, thinly sliced", "2 Charleston peppers (or hot fresh chillies), sliced", "¼ bunch parsley, finely chopped", "2 tbsp black olive paste (available in Turkish supermarkets and online)", "2 tbsp pomegranate molasses", "1 tbsp ground fennel seeds", "1 tbsp cumin seeds", "1 tsp sunflower oil", "4 mackerel fillets, pin-boned", "2 tbsp pul biber (Turkish chilli flakes)", "sea salt and freshly ground black pepper", "50g/1¾oz butter", "pul biber (Turkish chilli flakes), to taste", "100g/3½oz radishes with leaves, thinly sliced", "pickled chillies, roughly chopped", "nigella seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the gazpacho, blend all the ingredients in a food processor until smooth.", "For the salad, preheat the oven to 200C/180C Fan/Gas 6.", "Drizzle a little olive oil and sea salt on the bread and bake on a tray for 10 minutes or until a little golden and crisp.", "Combine the tomatoes, red onion, peppers, parsley, extra virgin olive oil and pomegranate molasses with a little salt and pepper.", "Heat a small frying pan and add the fennel and cumin seeds and cook until the start to release their oils. Place into a pestle and mortar and grind.", "Heat the sunflower oil in a large frying pan over a medium to high heat. Season the flesh side of the mackerel with salt, the ground fennel, cumin and pul biber. Press the seasoning in. Cook the fish skin-side down in the frying pan for 2 minutes or until the skin is golden-brown and crisp. Turn over and cook for 1 minute or until the fish is just done.", "For the Turskish chilli butter, heat the butter in a pan until foaming then add the chilli flakes, cook until the butter browns. Keep warm.", "Just before serving dip some bread into the gazpacho. Place two slices of bread on the serving plate then pile the vegetables, serving ingredients and fish on top, pour over the chilli butter and serve. "]}, {"isVegetarian": false, "title": "Pan-fried loin of venison with butternut squash, roasted salsify, venison jus with dark chocolate and Brussels sprout salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_loin_of_55675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 thin slices pancetta ", "4 x 175g/6oz venison loin, fully trimmed, trimmings reserved", "1 tbsp olive oil", "1 thyme sprig", "1 garlic clove, crushed", "1 tbsp olive oil", "venison trimmings (from above)", "1 onion, chopped ", "2 carrot, peeled cut in half lengthways, and chopped ", "1 juniper berry", "½ stick celery, chopped ", "1 thyme sprig", "1 litre/1¾pints red wine", "2 litres/3½ pints chicken stock", "50g/2oz 6 per cent dark chocolate, roughly chopped", "salt and freshly ground black pepper", "200g/7oz butternut squash, cut into 3-4mm thick small rectangles", "75ml/3fl oz olive oil", "1 thyme sprig ", "1 garlic clove, skin on, crushed", "30g/1oz shallots, finely diced", "2 salsify roots, washed, cut into equal-sized pieces", "500ml/18floz full fat milk", "25g/1oz butter", "4 tbsp flatleaf parsley, leaves picked and chopped", "1 garlic clove", "50g/2oz wild mushrooms", "4 Brussels sprouts, base removed, outer leaves and very centre leaves discarded, and remaining leaves separated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the venison, preheat the oven to 150C/300F/Gas 2. Lay the pancetta slices out on a clean work surface. Roll the venison onto the pancetta, and tightly wrap it up. ", "Heat a large ovenproof frying pan and fry the venison until golden-brown all over.", "Place in the oven and cook for 12-14 minutes, or until cooked to your liking.", "Remove from the oven and leave to rest, covered in a warm place, for five minutes.", "For the venison jus, heat a high-sided frying pan until hot, add the olive oil and venison trimmings and cook for a couple of minutes until browned.", "Add the onion, carrot, juniper, celery and thyme. ", "Cover the meat with the red wine and bring to the boil, then cook until the volume of red wine has reduced completely.", "Add one-fifth of the chicken stock and cook until very little of the liquid is left. Repeat this process with the chicken stock five times until it is all added.", "Pass the jus through a muslin cloth into a clean pan.", "Whisk in the dark chocolate and add salt and freshly ground black pepper to taste. Keep warm.", "For the vegetables, place the butternut squash in a frying pan with a tablespoon of the olive oil, plus the thyme and garlic. Cook for five minutes, or until just tender.", "Cook the salsify: poach it in a saucepan with the milk and shallot until soft, but still retaining a little bite. Remove from the pan and pat dry with kitchen paper. ", "Heat half of the butter and a dash of olive oil in a pan and fry the salsify until light golden-brown. Add the chopped parsley and garlic.", "Heat another frying pan, add the remaining butter and a splash more olive oil and fry the wild mushrooms for 1-2 minutes.", "Bring a small pan of salted water to the boil, add the Brussels sprout leaves and cook for one minute. Prepare a bowl of iced water. Drain the sprout leaves and refresh in the iced water. Drain again and pat dry with kitchen paper or a clean tea towel.", "Toss the sprout leaves with the remaining olive oil, and salt and freshly ground black pepper to taste.", "To serve, cut the venison into thick slices and place on each of four plates. Scatter some salsify and butternut squash around and on top. Drizzle with the sauce and garnish with the dressed sprout leaves. "]}, {"isVegetarian": false, "title": "Pan-fried mackerel with beetroot and celery salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_68364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel, filleted", "1 tbsp olive oil", "2 tbsp rice wine vinegar", "1 tsp caster sugar", "pinch salt", "2 banana shallots, finely sliced into rings", "3 tbsp celery leaves", "2 tbsp chervil sprigs (or parsley)", "50g/1¾oz baby watercress sprigs", "4 tbsp croutons", "500g/1lb 2oz cooked beetroot, thinly sliced", "1 tbsp French mustard", "1 tbsp lemon juice", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, add the olive oil and the mackerel fillets, skin side down, and cook for two minutes until the flesh changes colour halfway up the fish. ", "Flip the fillets over and cook for one more minute then remove from the heat and set aside to rest for a couple of minutes.", "Heat the rice wine vinegar and sugar together in a saucepan then add the shallot rings and salt. Leave to macerate for a few minutes.", "Meanwhile, toss the celery leaves, chervil (or parsley), watercress and croutons together.", "Set aside two-thirds of the beetroot. ", "Place the remaining beetroot into a food processor and blend to make a fine purée then pass it through a sieve into a bowl.", "Add the mustard and lemon juice then whisk in the olive oil and season to taste with salt and freshly ground black pepper.", "To serve, lay the reserved beetroot onto the plates and top with the pickled shallots. ", "Toss the salad with a little of the dressing then place on top of the beetroot slices.", "Add the mackerel fillets then drizzle over more of the dressing."]}]