[{"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "pizca de sal", "150g / 5½oz de mantequilla fría, cortada en cubos", "50g / 1¾oz de parmesano (o queso vegetariano vegetariano alternativo), finamente rallado", "2½-3½ cucharadas de agua helada", "10 g de mantequilla", "1 cebolla, finamente picada", "2 pastinacas, peladas y cortadas en cubos de 1cm", "1 batata, pelada y cortada en cubos de 1cm", "2 huevos de gallinas camperas", "Crema doble de 200 ml / 7 fl oz", "2 hojas de salvia, finamente picadas", "1 cucharadita de hojas frescas de tomillo, más 12 ramitas de tomillo para adornar", "60g / 2¼ oz de parmesano (o queso vegetariano vegetariano alternativo), finamente rallado", "30 g / 1 oz de avellanas blanqueadas, más o menos picadas", "sal y pimienta negra recién molida"], "method": ["Tamiza la harina y la sal en un tazón. Frote la mantequilla, luego mezcle el parmesano y junte con el agua. Envuelva en film transparente y colóquelo en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Estirar la masa en una superficie ligeramente enharinada hasta 2-3 mm de espesor. Corta seis círculos con un cortador de 11 cm / 4 in y utiliza para alinear seis latas de tarta, volviendo a enrollar la masa si es necesario. Cubra cada caja de repostería con papel de hornear, agregue alubias para hornear y hornee a ciegas durante 12 minutos.", "Retire el papel y los frijoles y hornee durante un minuto más. Retire del horno y reduzca la temperatura a 180 ° C / 160 ° Ventilador / Gas 4.", "Mientras tanto, para el relleno, caliente la mantequilla en una sartén de fondo grueso. Agregue la cebolla y cocine durante 1-2 minutos. Agregue la chirivía y las batatas y cocine, revolviendo de vez en cuando, durante 15 minutos, o hasta que estén casi cocidas y caramelizadas. Cuchara en los casos de pastelería.", "Mezcle los huevos, la crema, la salvia, el tomillo y la mitad del queso parmesano en una jarra y sazone bien. Vierta sobre las verduras en los casos de pastelería.", "Espolvoree las avellanas y el parmesano restante sobre las cajas de pastelería y decore cada una con dos ramitas de tomillo. Hornee durante 35-40 minutos hasta que estén doradas. Servir."], "url": "www_bbc_co_uk_food_recipes_parsnip_sweet_potato_and_66305", "title": "Tajadas de chirivía y batatas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 6 tartas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_sweet_potato_and_66305_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de aceite de colza", "200ml / 7fl oz de chardonnay o vinagre de vino blanco", "100 g / 3½ oz de azúcar en polvo", "6 ramitas de tomillo", "2 alcachofas de Jerusalén, peladas y en rodajas finas", "1 cucharada de aceite de colza", "4 alitas de pollo", "2 chalotes de plátano, pelados y en rodajas", "30g / 1 oz de champiñones, en rodajas", "1 diente de ajo, en rodajas", "1 ramita de tomillo", "100 ml / 3½ fl oz en Madeira", "300ml / 10½fl oz de caldo de pollo oscuro", "100ml / 3½ fl oz crema doble, para terminar", "1 limón, solo jugo", "350 g / 12½ oz de alcachofas de Jerusalén, peladas y cortadas en cubitos", "150 g / 5½ oz de apio nabo, cortado en cubitos", "3 chalotes de plátano, picados", "1 diente de ajo, pelado", "150g / 5½oz de mantequilla sin sal", "Crema doble de 200 ml / 7 fl oz", "1,1 litros / 2 pintas de caldo de pollo", "3 dientes de ajo, pelados y dejados enteros", "6 ramitas de tomillo", "2 coronas de perdiz", "1 cucharada de aceite de colza", "sal y pimienta negra recién molida", "botón de mantequilla", "aceite vegetal, para freír", "100g / 3½oz de hojas de col rizada", "sal al gusto", "1 cucharada de aceite de colza", "50 g / 1¾oz de panceta ahumada, picada en cubos de 1cm / ½ en cubitos", "50g / 1¾oz de hongos girolle, recortados", "botón de mantequilla", "10g de cebollín finamente picado", "100g / 3½ oz de azúcar", "1 manzana Granny Smith, sin corazón y cortada en anillos", "50g / 1¾oz de mantequilla"], "method": ["Para los discos de alcachofas marinadas, coloca todos los ingredientes aparte de las alcachofas en una sartén grande. Traiga a fuego lento, agregue los discos de alcachofa y vuelva a hervir a fuego lento. Viértalo en un recipiente hondo y déjelo marinar durante una hora.", "Para la salsa de pollo, caliente el aceite en una sartén profunda a fuego medio-alto. Agregue las alas y cocine hasta que estén caramelizadas. Pon las alas a un lado.", "Escurra la sartén y agregue los chalotes. Cocine los chalotes hasta que estén caramelizados y luego agregue los champiñones, el ajo y el tomillo.", "Cuando se hayan tornado de color marrón dorado, glasear la sartén con el Madeira y seguir cocinando para reducir el volumen hasta un almíbar.", "Agregue el caldo, coloque las alas en la sartén y deje que hierva. Hierva a fuego lento durante 30 minutos y luego páselos por un colador fino.", "Para finalizar, agregue la crema y cocine para reducir el volumen de líquido hasta obtener una consistencia de salsa. Termine con jugo de limón, al gusto.", "Para el puré de alcachofa de Jerusalén, ponga todos los ingredientes en una sartén con 560 ml / 1 litro de agua y deje que hierva. Cocine a fuego alto para reducir rápidamente el volumen de líquido hasta que la mantequilla y el agua se hayan absorbido en las verduras. Agregue la crema, al gusto, y mezcle hasta lograr un puré suave usando una batidora.", "Para la perdiz, hierva el caldo de pollo, el ajo y el tomillo en una sartén. Una vez que hierva, retire la sartén del fuego y coloque las coronas de perdiz en el caldo, cúbralas y déjelas durante 10 minutos.", "Retire las coronas de perdiz de la sartén y seque. Retire con cuidado los pechos de las coronas de perdiz con un cuchillo fino y afilado.", "Caliente una sartén antiadherente y agregue un poco de aceite. Sazone los pechugas de perdiz con sal y pimienta y coloque el lado de la piel hacia abajo en la sartén. Cocine hasta que se dore, agregue un poco de mantequilla y revuelva la perdiz. Hilvane durante 20 segundos, retire los senos de la sartén y déjelos a un lado en un lugar cálido.", "Para la col rizada, prepare una freidora con mucha grasa o llene una bandeja grande, profunda y de fondo grueso con aceite vegetal dos tercios lleno. Caliente el aceite a 160 ° C / 300 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Freír la col rizada durante aproximadamente 30 segundos o hasta que la col rizada esté crujiente. Retire y escurra sobre papel de cocina. Sazonar con un poco de sal y dejar enfriar.", "Para el champiñón y la guarnición de tocino ahumado, en una sartén caliente agregue un toque de aceite de colza y fría la panceta hasta que se dore. Agregue los champiñones y un poco de mantequilla y cocine por un minuto más. Agregue las cebolletas picadas y sazone si es necesario.", "Para la manzana caramelizada, caliente el azúcar en una sartén hasta que tome un color caramelo claro.", "Agregue los anillos de manzana y un poco de mantequilla y cocine durante 30 segundos, voltee la manzana y apague el fuego de la sartén, después de 20 segundos retire la manzana de la sartén.", "Para servir, en platos de servir grandes recortar la perdiz y colocar cuidadosamente fuera del centro, y poner la manzana al lado de la perdiz. Cucharee el puré de alcachofa de Jerusalén al lado de ellos. Coloque el tocino ahumado y los champiñones sobre y alrededor del pecho. Termine con un poco de salsa de pollo y ponga unas cuantas piezas de col rizada y discos de alcachofa alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_partridge_with_jerusalem_01583", "title": "Perdices con puré de alcachofas de Jerusalén, manzana caramelizada y salsa de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["guión de aceite vegetal", "3 perdiz entera, unidas (pregunte a su carnicero para que haga esto)", "Juego mixto 300 g / 10½ oz", "1 x 340 g / 12 oz de grasa de ganso de estaño, fundido", "100 g / 3½ oz de avena", "Harina simple de 100 g / 3½ oz, más extra para enharinar", "50 g / 1¾oz de parmesano rallado", "½ cucharadita de pimienta de cayena", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Cogolines sin cáscara 100 g / 3½ oz", "200g / 7oz de mantequilla derretida", "50g / 1¾oz de cebollino finamente picado", "1 mora de cilantro", "hierbas frescas, para adornar"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Calentar el aceite en una sartén y freír las patas de perdiz para colorearlas por todos lados.", "Coloque las patas de perdiz en un plato resistente al horno.", "Agregue el juego mixto y vierta sobre la grasa de ganso. Deja de lado los pechitos de perdiz.", "Coloque en el horno durante dos horas para confitarlo suavemente.", "Una vez cocido, retire cuidadosamente la perdiz de la grasa con una cuchara ranurada. Sazone el confit y apriételo para formar una forma de salchicha delgada y envuélvalo bien en una película adhesiva. Coloque en la nevera para establecer.", "Ajuste el horno a 180C / 350F / Gas 4.", "Mezcle la avena, la harina, el parmesano, la pimienta de cayena, la sal y la pimienta en un tazón.", "Agregue suficiente agua hirviendo para hacer una masa que no sea pegajosa.", "Sobre una superficie ligeramente enharinada, extender la masa y cortar en rondas.", "Engrase una bandeja para hornear con aceite de oliva y coloque las rondas en la bandeja de hornear preparada. Cocine por 12-15 minutos", "Suavemente fríe los cocos en una sartén. Córtelos finamente y déjelos a un costado para la corteza.", "Sazonar los pechugas de perdiz, dorar ligeramente en una sartén antes de colocarlos en el horno durante 6-8 minutos, o hasta que la perdiz esté cocida pero ligeramente rosada en el medio. Cepille con un poco de la mantequilla derretida y sumerja en los coágulos para formar una costra.", "Para armar el plato, corta una pequeña ronda del juego confitado, cepilla con un poco de mantequilla derretida y sumérgete en cebollines picados. Coloque el juego, los senos y las tortas de avena en cada plato y adorne con moras y hierbas frescas."], "url": "www_bbc_co_uk_food_recipes_partridge_with_cobnut_86862", "title": "Perdiz con corteza de cobnut y juego de macetas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de azúcar en polvo", "250ml / 9fl oz de vinagre de sidra", "1 ramita de estragón fresco", "1 ramita de tomillo fresco", "2 cm / ¾ en pieza de raíz fresca de jengibre", "½ chile rojo", "500 g / 1 libra 2 oz de moras frescas", "500 g / 1 lb 2 oz zanahorias, en rodajas", "1 litro / 1¾ pinta de jugo de zanahoria fresco", "sal y pimienta negra recién molida", "450 g / 1 libra de espinaca de hoja grande, sin tallos, hojas blanqueadas brevemente en agua ligeramente salada", "6 pechos de perdiz (fuera del hueso)", "6 círculos de repostería de feuilles de brick (disponibles en línea y en tiendas especializadas)", "4 patatas Maris Piper, cortadas en cuerdas con un espiralizador", "aceite vegetal, para freír", "1 huevo de gallinas camperas, golpeado", "1 chalote, finamente picado", "75g / 2½oz de mantequilla sin sal", "Girolles de 150 g / 5½ oz, limpios", "Rebozuelos 150g / 5½oz, limpios", "2 cucharadas de estragón fresco picado", "6 círculos de pan rebanado, frito en manteca de cerdo", "6 hojas de col hispi, cocidas y refrescadas en agua helada", "perdiz jus o salsa"], "method": ["Para las moras en escabeche, mezcle el azúcar, el vinagre de sidra, el estragón, el tomillo, el jengibre y el chile en una cacerola. Llevar a ebullición y luego enfriar un poco antes de agregar las moras. Permitir infundir durante unas horas y hasta 2 semanas.", "Para el puré de zanahoria, coloca las zanahorias en una cacerola grande y cúbrelas con suficiente jugo de zanahoria. Llevar a ebullición y luego cocine a fuego lento hasta que las zanahorias estén suaves. Transfiera a una licuadora y pulse hasta que quede suave. Empujar a través de un tamiz, sazonar con sal y pimienta. Mantenga caliente hasta que esté listo para servir.", "Para la perdiz, precaliente una freidora a 160C. O hasta que un pequeño pedazo de pan se ponga crujiente y dorado en un minuto. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque 6 hojas de espinaca en una superficie de trabajo. Coloque una pechuga de perdiz en el medio de cada hoja y sazone con sal y pimienta. Envuelva en un paquete, luego distribuya 2 círculos de la masa de ladrillo y corte cada círculo en cuartos. Envuelva cada paquete de espinacas en un cuarto de masa, cepillando los bordes con huevo batido para ayudarlos a permanecer en su lugar.", "Envuelva los paquetes por completo en cadenas de patata. Baje cada paquete en la freidora y cocine por 3 minutos. Retire con una espumadera y déjelo a un lado para que descanse y escurra sobre papel de cocina.", "Calentar la mantequilla en una sartén grande, luego freír la chalota hasta que esté suave. Agregue los champiñones y cuando estén cocidos, termine con el estragón.", "Cuando esté listo para servir, si es necesario, vuelva a freír los paquetes brevemente para asegurarse de que estén calientes. Para servir, ponga una hoja de repollo hispi en el centro de cada plato. A un lado coloque el pan frito, encima agregue los champiñones. Corta los paquetes croustilliant en 2 y colócalos en el repollo. Escurra las moras y colóquelas alrededor de los platos. Cuchara sobre jus de perdiz y terminar con una cucharada de puré de zanahoria."], "url": "www_bbc_co_uk_food_recipes_partridge_croustillant_20604", "title": "Perdiz crujiente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "400g / 14oz chirivías, cortadas en 3cm x 10cm (1¼in x 4in bastones)", "2 cucharadas de miel", "2 ramitas de tomillo fresco", "2 ramitas de romero fresco", "sal y pimienta negra recién molida", "1.5kg / 3lb 4oz bonete de cordero deshuesado", "6 papas grandes, cortadas en cilindros de aproximadamente 5 cm de largo", "1 cucharada de agua", "2 ramitas de tomillo fresco", "50g / 2oz de mantequilla", "3 remolachas grandes, cortadas en cuñas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "200ml / 7fl oz de vino tinto", "300ml / 11fl oz de caldo de carne", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cordero, caliente el aceite en una sartén a prueba de horno y agregue las chirivías. Freír por 2-3 minutos, luego agregar la miel, el tomillo y el romero. Revuelva para cubrir y sazone, al gusto, con sal y pimienta negra recién molida.", "Transfiera al horno y tueste por 20-25 minutos, o hasta que esté tierno y dorado. Retirar del horno y dejar enfriar.", "Abra el cordero y sazone con sal y pimienta negra recién molida. Coloque las chirivías en el centro del cordero. Dobla el cordero sobre las chirivías, luego dale la vuelta para que la unión quede en la parte inferior y ata firmemente con una cuerda para encerrar el relleno.", "Caliente una sartén grande hasta que esté caliente. Coloque el cordero en la sartén y cocine en cada lado durante 2-3 minutos, hasta que se dore ligeramente por todas partes. Coloque en el horno durante 30-40 minutos, hasta que el cordero esté cocido, pero aún rosado, o hasta que esté cocido a su gusto. Retire del horno y deje reposar durante cinco minutos.", "Para las papas fondant, coloque las papas en una bolsa plástica resistente al calor con agua y tomillo y selle herméticamente.", "Coloque una olla de agua a fuego alto y coloque la bolsa de patatas en ella. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20-25 minutos, o hasta que las papas estén tiernas. Retire la bolsa del agua y saque las papas de la bolsa, teniendo cuidado, ya que habrá vapor.", "Caliente la mantequilla en una sartén y fría las papas, volteándolas con frecuencia, hasta que se doren por todas partes.", "Mientras tanto, para la remolacha asada, coloque la remolacha en una sartén, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida. Coloque en el horno junto con el cordero y tueste durante 30 minutos, o hasta que estén tiernos.", "Para la salsa, caliente el vino tinto en una sartén pequeña. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta reducir a la mitad.", "Agregue el caldo de carne y cocine a fuego lento hasta que se reduzca en dos tercios. Sazonar, al gusto, con sal y pimienta negra recién molida y batir en la mantequilla.", "Para servir, corte el cordero y colóquelo en platos para servir con las patatas fondant y la remolacha. Vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_parsnipstuffedroasts_86957", "title": "Chuleta de cordero asada rellena de chirivía con patatas fondant, remolacha asada y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas, duros, pelados, cortados a la mitad a lo largo", "2 cucharaditas de crema de ensalada", "tomates cherry, picados", "pedacitos de tocino cocidos", "berro", "cebolla de primavera, en rodajas"], "method": ["Retire con cuidado la yema de los huevos y colóquela en un tazón. Mash en la crema de ensalada y un poco de los aderezos.", "Vierta la mezcla de yema en los huevos partidos por la mitad y colóquelos en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_party_eggs_72598", "title": "Huevos de fiesta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de hojaldre listo para el uso de 2 oz", "harina simple, para rodar", "Filete de abadejo ahumado sin teñir 225g / 8oz", "300ml / 10fl oz de leche entera", "100g / 3½oz de gambas cocidas y peladas", "2 cucharadas de cebollín, finamente cortado", "½ cebolla, cortada en cuartos", "2 hojas de laurel", "3 ramitas de tomillo fresco", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "5 cucharadas de crema fresca", "copos de sal marina", "pimienta negra recién molida", "2 pechugas de pollo sin hueso, asadas, sin piel, cortadas en trozos pequeños", "1 cucharada de hojas frescas de estragón", "1 cucharada de vino blanco"], "method": ["Para la masa, precaliente el horno a 200C / 400F / Gas 6 y alinee una bandeja grande para hornear con papel resistente a la grasa. Estirar la masa en una superficie ligeramente enharinada y cortar en cuadrados de 30 x 6 cm. Marque un cuadrado más pequeño dentro de cada uno, dejando un borde de 75 mm / ¼ pulg. (Tenga cuidado de no cortar la pasta todo el tiempo).", "Hornee los cuadrados de repostería en el horno durante 18-20 minutos, o hasta que estén hinchados y dorados.", "Retire del horno y transfiera a una rejilla para enfriar. Cuando se enfríe, retire cuidadosamente el cuadrado central de masa de cada uno.", "Mientras tanto, para el abadejo ahumado y el relleno de gambas, coloque el eglefino en una cacerola con la leche, cocine a fuego lento, apague el fuego y deje que el pescado se cocine en el calor residual durante diez minutos.", "Escurre el eglefino, reservando la leche. Deja el eglefino a un lado para que se enfríe un poco, luego quita la piel.", "Para la salsa, vierta la leche reservada en una cacerola y agregue la cebolla, las hojas de laurel y el tomillo. Llevar a fuego lento a fuego lento, luego retirar del fuego y dejar en infusión durante diez minutos. Cuele la leche a través de un colador en una jarra y deseche la cebolla y las hierbas.", "Derrita la mantequilla en una cacerola antiadherente a fuego lento, agregue la harina y cocine por unos segundos, revolviendo constantemente. Agregue lentamente la leche infundida en caliente y cocine por 1-2 minutos o hasta que la salsa esté suave y espesa. Sazonar, al gusto, con sal y pimienta negra recién molida, retirar del fuego e incorporar la crema fresca. Cubra con clingfilm y déjelo enfriar.", "Divida la salsa en dos porciones, vierta el eglefino en la mitad de la salsa, revise si quedan huesos y agregue las gambas y el cebollín. Para el relleno de pollo y estragón, revuelva el pollo, el estragón y el vino en la otra mitad de la salsa.", "Para armar los voltajes de ventilación precaliente el horno a 200C / 400F / Gas 6. Coloque los cuadrados de repostería en una bandeja para hornear, coloque los rellenos y caliente en el horno durante 8-10 minutos o hasta que el relleno burbujee. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_party_vol-au-vents_60239", "title": "Fiesta de vol-au-vent", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 30", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina común de 270g / 9¾oz, más extra para quitar el polvo", "30g / 1 oz de cacao en polvo", "30 g / 1 oz de almendras molidas", "Azúcar glasé 65g / 2½oz", "170 g / 6 oz de mantequilla sin sal, en cubos", "1 huevo mediano de gallinas camperas", "1 clara de huevo de gallinas camperas, para lavar huevos", "40 g / 1½ oz de almendras molidas", "60g / 2¼ oz de azúcar glas", "1 clara de huevo grande de gallinas camperas", "1 cucharada de azúcar en polvo", "colorante anaranjado o amarillo del gel o de la goma de la pasta", "125ml / 4fl oz de crema doble", "4 cucharadas de maracuyá", "2 yemas de huevo de gallinas camperas", "1 huevo grande de gallinas camperas", "Azúcar en polvo de 55 g / 2 oz", "200g / 7oz de gotas de chocolate con leche", "50g / 1¾oz de gotas de chocolate negro", "50 g / 1¾oz de mantequilla sin sal", "Mini malvaviscos blancos de 150 g / 5½ oz", "Crema doble de 200 ml / 7 fl oz", "100 g / 3½ oz de azúcar en polvo", "3 grandes frutas de la pasión, semillas recogidas", "3 hojas de gelatina, empapadas en agua fría durante 10 minutos", "50g / 1¾oz de mantequilla", "125g / 4½oz de azúcar glasé", "1 cucharada de maracuyá", "Crema doble 50ml / 2fl oz", "200g / 7oz de gotas de chocolate negro", "50ml / 2fl oz de fruta de la pasión tamizada", "pequeños pensamientos comestibles amarillos y morados (opcional)"], "method": ["Para la masa, coloque todos los ingredientes, excepto la clara de huevo, en un procesador de alimentos y blitz brevemente para combinar. Agregue unas gotas de agua y pulse para juntar la masa. Cubra con película adhesiva y enfríe durante 20 minutos.", "Para hacer los macarons, rellene las almendras molidas y el azúcar glas hasta obtener un polvo fino usando un procesador de alimentos. En un recipiente aparte, bata la clara de huevo hasta que se formen picos rígidos cuando se quite la batidora. Agregue el azúcar impalpable y bata hasta que esté brillante. Agregue una gota del colorante de alimentos y revuelva. Dobla la mezcla de polvo en las claras de huevo. Transfiera a una manga pastelera equipada con una boquilla simple.", "Alinee una bandeja para hornear con papel para hornear antiadherente. Pipetee pequeñas rondas de la mezcla de macarrón sobre el tamaño de una moneda de 10p y luego déjelas a un lado hasta que formen una piel. Precalentar el horno a 160C / 140C Fan / Gas 3.", "Hornee los macarons durante 12-15 minutos, o hasta que ya no estén pegajosos al tacto. Coloque los macarons en bastidores de alambre para enfriar.", "Extienda la masa fría sobre una superficie de trabajo ligeramente enharinada hasta que tenga un grosor aproximado de 4 mm. Cubra una lata de tarta de 23cm / 9in con la masa. Enfríe por 20 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la capa de fruta de la pasión, ponga todos los ingredientes en una cacerola y bata suavemente a fuego lento hasta que se espese.", "Alinee la caja de repostería con un pergamino para hornear y llénela con alubias para hornear. Hornee por 10 minutos, luego retírelo del horno y reduzca la temperatura a 180 ° C / 160 ° Ventilador / Gas 4. Retire los frijoles para hornear y cepille los pasteles con la clara de huevo.", "Vierta la capa de fruta de la pasión y vuelva al horno durante 10 minutos, o hasta que se endurezca. Dejar enfriar un poco y luego colocar en la nevera para enfriar.", "Para la capa de mousse de chocolate, derrita las gotas de chocolate, mantequilla y malvaviscos juntos hasta que se combinen. Deja enfriar.", "Batir la crema hasta que se formen picos rígidos cuando se quite la batidora. Doble en la mezcla de chocolate y luego bátalo en el tazón de un mezclador independiente durante aproximadamente 10 minutos, o hasta que esté muy pálido y esponjoso. Vierta encima de la capa de maracuyá, alise la superficie y vuelva a enfriar.", "Para hacer la gelatina, combine el azúcar y la fruta de la pasión en una sartén con 100 ml / 3½ fl oz de agua. Llevar a ebullición, exprimir el exceso de agua de la gelatina y agregar a la sartén. Cuando se disuelva la gelatina, vierta la mezcla en una lata de sándwich de 23 cm / 9 in forrada con película adhesiva. Enfríe hasta que esté listo.", "Para preparar la crema de mantequilla para los macarons, mezcle todos los ingredientes hasta que quede suave. Transfiera a una manga pastelera equipada con una boquilla simple de 1 cm / ½ pulgada. Usa la crema de mantequilla para unir los macarons.", "Para la ganache de maracuyá, caliente la crema en una sartén y luego agregue las gotas de chocolate. Cuando el chocolate esté derretido, agregue la fruta de la pasión, deje que se enfríe un poco y luego alise la parte superior de la mousse de chocolate y enfríe en el refrigerador hasta que se asiente.", "Para armar la tarta, corte la gelatina en cubos. Decora la parte superior de la tarta con los macarons, algunos cuadrados de gelatina y pensamientos."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_and_76131", "title": "Fruta de la pasión y tarta de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 tarta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600 ml / 1 pinta de crema doble", "250 g / 9 oz de azúcar en polvo", "1 lima, solo jugo", "Pulpa de la fruta de la pasión de 150ml / 5fl oz, pasada a través de un tamiz fino", "2 hojas de gelatina, empapadas en agua fría", "300g / 10½ oz de harina natural, más extra para espolvorear", "250 g / 9 oz de azúcar en polvo", "100 g / 3½ oz de pistachos sin cáscara", "60g / 2¼oz de coco fresco, rallado", "50 g / 2 oz de cerezas glaseadas naturales, más o menos picadas", "1 limón, ralladura y jugo", "1/4 cucharadita de polvo de hornear", "pizca de sal", "3 huevos de gallinas camperas"], "method": ["Para la crema de fruta de la pasión, lleve la crema doble y 150 g / 5 oz del azúcar hasta que hierva suavemente en una olla grande, luego retírela del fuego. Agregue el jugo de lima y la mitad de la pulpa de maracuyá cribada.", "Vierta la mezcla de crema en cuatro vasos grandes de Martini (no llene hasta la parte superior) y enfríe en la nevera durante al menos dos horas, o hasta que se endurezca.", "Mientras tanto, escurra las hojas de gelatina y agítelas. Traiga 100 ml / 3½ fl oz de agua y el azúcar restante a ebullición en una olla grande. Agregue las hojas de gelatina y bata hasta que se disuelva por completo.", "Agregue la pulpa de maracuyá cribada restante a la mezcla de jarabe de azúcar, luego déjela enfriar.", "Cuando la mezcla de gelatina se haya enfriado y la crema se haya solidificado, vierta un cuarto de la mezcla de gelatina en la parte superior de cada porción de crema para formar una fina capa de aproximadamente 0.5 cm / ¼ de grosor. Regrese al refrigerador por otra hora, o hasta que esté listo.", "Mientras tanto, para el biscotti, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "Coloque todos los ingredientes biscotti en un tazón grande y revuelva hasta que la mezcla se una como una masa suave y pegajosa.", "Divida la masa por la mitad y enrolle cada porción en forma de salchicha en una superficie de trabajo ligeramente enharinada.", "Coloque los pedazos de masa en la bandeja de horneado preparada y hornee durante 20-30 minutos, o hasta que estén dorados. Retire del horno y deje reposar durante 10 minutos para que se enfríe y firme.", "Con un cuchillo de sierra, corte discos de 1cm / ½ pulgada de los pedazos de masa, cortándolos en ángulo. Coloque los discos en la misma bandeja de horneado (use una bandeja de hornear adicional si es necesario). Regrese las galletas al horno y cocínelas durante 6-8 minutos, luego dé vuelta las rebanadas y cocine durante otros 10-15 minutos, o hasta que estén crujientes y doradas pálidas en ambos lados. Retire del horno y transfiera a los bastidores de alambre para que se enfríe.", "Sirva las cremas de maracuyá con biscotti al lado."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_cream_with_05122", "title": "Crema de fruta de la pasión con biscotti de coco y cereza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de azúcar en polvo", "110 g / 4 fl oz de agua", "Jarabe de glucosa 10g / ½ oz", "175g / 6oz de azúcar en polvo", "5 cucharadas de agua", "3 claras de huevo de gallinas camperas", "300 ml / 10 fl oz de puré de maracuyá", "100 ml / 3½ fl oz de jarabe de azúcar (ver arriba)", "4½ hojas de gelatina, remojadas en agua fría durante 15 minutos, escurridas, exprimidas", "½ vaina de vainilla", "3 yemas de huevo de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "Estuche de flan de esponja de 25cm / 10in listo", "20ml / ¾fl oz de licor de maracuyá", "Crema doble de 400 ml / 14 fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "100g / 3½oz de mantequilla sin sal", "100g / 3½oz de azúcar glasé", "1 cucharada de miel clara", "3 claras de huevo de gallinas camperas", "Harina normal de 100 g / 3½ oz", "50ml / 2fl oz de jarabe de azúcar (ver arriba)", "50ml / 2fl oz de puré de maracuyá", "2 hojas de gelatina, empapadas en agua fría durante 15 minutos, escurridas", "4 maracuyá", "12 g / ½ oz de leche en polvo"], "method": ["Para el jarabe de azúcar, coloque todos los ingredientes en una sartén y deje hervir lentamente, revolviendo ocasionalmente con una cuchara de madera.", "Hierva por unos 2-3 minutos, rozando la superficie si es necesario. Pase el jarabe a través de un colador fino y deje hasta que esté completamente frío antes de usarlo.", "Para el merengue italiano, coloque el azúcar y el agua en una sartén y lentamente hierva hasta que el almíbar alcance los 110 ° C / 230 ° F en un termómetro de azúcar.", "En esta etapa, bata las claras de huevo en el tazón de un mezclador eléctrico hasta que se formen picos firmes cuando se quite el batidor.", "Tan pronto como el azúcar alcance 121C / 250F, retire la sartén del fuego.", "Inmediatamente reanude batiendo las claras de huevo - con el batidor a su velocidad más baja, vierta el azúcar derretido, en una corriente delgada y constante. PRECAUCIÓN: asegúrese de que el almíbar esté limpio de los batidores, ya que podría salpicarlo en sus manos. Continúa latiendo durante unos cinco minutos, hasta que el merengue esté tibia.", "Para el maracuyá, mezcle la pulpa de la fruta de la pasión y el jarabe de azúcar en un procesador de alimentos hasta que quede suave. Cuele la mezcla a través de un tamiz fino.", "Reserve cuatro cucharadas de puré de maracuyá y coloque el resto en una sartén. Agregue la leche en polvo y la vaina de vainilla y deje que hierva.", "Batir las yemas de huevo y el azúcar en un bol hasta que la mezcla forme una cinta cuando se quite el batidor.", "Vierta la mitad de la mezcla de maracuyá en la mezcla de huevo, batiendo continuamente, luego vierta esta mezcla de crema en la sartén.", "Calentar suavemente, revolviendo continuamente con una espátula, hasta que la crema esté lo suficientemente espesa para cubrir la espátula. No permita que hierva.", "Retire la sartén del fuego y agregue las hojas de gelatina escurridas. Dejar enfriar un poco.", "Deseche la vaina de vainilla, y luego pase la crema pastelera a través de un colador en un recipiente y deje que se enfríe, revolviendo ocasionalmente para evitar que se forme la piel.", "Para la base del delice, coloque la base de flan de esponja en un tablero o bandeja de horno.", "Mezcle 50ml / 2fl oz del jarabe de azúcar frío y el puré de maracuyá reservado y cepille esta mezcla sobre la esponja.", "Coloque un anillo de flan de 25 cm / 10 pulgadas (6 cm / 2½ pulgadas de profundidad) sobre la esponja y presione hacia abajo para cortar un círculo, dejando la esponja como la base del anillo de flan.", "Cuando la crema esté tibio, doble suavemente la mitad del merengue italiano (el merengue restante se puede usar en otra receta). Agregue el licor de fruta de la pasión, y luego doblar en la crema doble batida. (Ahora debe armar el postre inmediatamente, antes de que la gelatina haga que la mezcla se solidifique).", "Llene el anillo de flan con la mezcla de natillas de maracuyá, dejando un pequeño espacio en la parte superior, y alise cuidadosamente la superficie con una espátula. Transfiera al congelador y deje enfriar durante varias horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para los tuiles, bata la mantequilla, el azúcar glas y la miel en un bol hasta que quede suave.", "Gradualmente bata las claras de huevo, una a la vez, hasta que estén bien combinadas. Luego, dobla cuidadosamente la harina con una cuchara de metal.", "Tome una pieza de silicona o plástico y recorte formas largas y delgadas de hojas para crear una plantilla. Alinee una bandeja para hornear con un pergamino para hornear y luego coloque la plantilla sobre la bandeja. Usando una espátula, extienda una capa delgada de la mezcla de tuiles en la parte recortada de la plantilla. Retire con cuidado la plantilla y repita con la mezcla restante.", "Coloque la bandeja en el horno y hornee por 3-4 minutos, o hasta que esté pálida dorada.", "Para el glaseado, coloque el jarabe de azúcar y la pulpa de maracuyá en una sartén y caliente suavemente, luego retírelo del fuego, agregue la gelatina drenada y déjela enfriar. Una vez que esté frío, retire el delice del congelador y extienda el glaseado sobre la parte superior del relleno de maracuyá. Transfiera a la nevera para enfriar de nuevo antes de servir.", "Para servir, retire el anillo de flan calentando la parte exterior del anillo con un soplete durante unos segundos, luego deslice el anillo hacia arriba, girándolo ligeramente. Coloque las semillas restantes de maracuyá en el centro del delice. Coloque los tuiles en posición vertical alrededor del borde del delice para formar un anillo. Cortar en rodajas para servir."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_delice_69401", "title": "Delice fruta de la pasión con azulejos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "4 maracuyá", "4 cucharaditas de licor de naranja", "8 nidos de merengue comprados en la tienda", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de azúcar moreno claro y suave", "50 g / 1 oz de azúcar en polvo", "3 cucharadas de jarabe de oro", "250ml / 9fl oz crema de coco (no crema de coco)"], "method": ["Alinee la lata de pan con película adhesiva, dejando un montón de saliente a los lados de la lata para que pueda cubrir la parte superior más tarde.", "Para hacer la torta de helado, bate la crema doble hasta que las ondulaciones comiencen a aparecer en el recipiente y se espese un poco, pero no se endurezca. Agregue la pulpa, las semillas y el jugo de la fruta de la pasión, luego el licor y doblar brevemente para combinar.", "Rompe los nidos de merengue, haciendo una mezcla de polvo y pequeños trozos de merengue, y dóblate suavemente, hasta que esté uniformemente mezclado.", "Cuchara suavemente en la lata de pan revestida, presionando sobre la marcha para que no tengas bolsas de aire. Una vez que la mezcla se empaqueta cuidadosamente y la parte superior se alisa, cubra con el saliente de la película adhesiva, luego envuelva la lata en otra hoja de película adhesiva y colóquela en el congelador durante la noche.", "Para hacer la salsa, derrita suavemente la mantequilla, los azúcares y el sirope dorado en una cacerola profunda de base pesada de unos 20 cm de diámetro. Una vez derretido, sube el fuego un poco y déjalo cocer a fuego lento durante 3 minutos. Levanta la sartén del fuego de vez en cuando y dale un giro.", "Agregue la crema de coco cuando la sartén no esté caliente y gire de nuevo, luego vuelva a calentar y cocine a fuego lento durante unos 10 minutos, revolviendo de vez en cuando, hasta que tenga el color de la mantequilla de maní y espese un poco ( espesará más una vez que se haya enfriado).", "Vierta la salsa en una jarra resistente al calor y deje enfriar a temperatura ambiente. La salsa se espesará demasiado si se la refrigera.", "Cuando esté listo para servir, saque la lata del congelador, retire la capa externa de la película adhesiva, levante la torta de helado y siéntela sobre una tabla antes de desenvolver completamente. Cortar en rodajas gruesas; Si no quieres comer todo el pastel de una vez, envuelve el resto del pan sin cortar y vuelve a ponerlo en el congelador.", "Coloque una rodaja en cada plato y deje que se ablanden durante 5-10 minutos, dependiendo de la calidez de su cocina. Pon en zigzag un poco de salsa de caramelo de coco sobre cada rebanada, revolviéndolo primero si está demasiado espeso, y vierte el resto en una jarra para servir junto a la mesa."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_ice_cream_67878", "title": "Pastel de helado de maracuyá con salsa de caramelo de coco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/passion_fruit_ice_cream_67878_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo", "180g / 6¼ oz de azúcar en polvo", "180g / 6¼ oz de azúcar glas", "Crema doble 600ml / 20fl oz", "150 g / 5½ oz de azúcar en polvo", "2 limones grandes, jugo y ralladura solamente", "4 maracuyá, semillas eliminadas", "Crema doble 600ml / 20fl oz", "10-15 maracuyá, semillas eliminadas", "hojas de verbena de limón, para decorar"], "method": ["Para pavlova, precaliente el horno a 100C / 80C Fan / Gas ¼ y forre una bandeja grande para hornear con papel para hornear.", "Batir las claras de huevo con el azúcar impalpable hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar glas y continúe batiendo durante 4-6 minutos, o hasta que la mezcla esté suave y brillante.", "Coloque la mezcla en la bandeja de hornear preparada creando una forma circular de aproximadamente 30 cm de ancho.", "Hornea por 2 horas. Una vez cocinado, deje que el pavlova se enfríe un poco antes de sacarlo de la bandeja con una espátula. Transfiera a un estante de enfriamiento y reserve.", "Para la presentación de maracuyá y limón, lentamente hierva la crema doble y el azúcar en una cacerola grande a fuego lento, revolviendo bien para disolver el azúcar en la crema. Hervir durante 3 minutos, luego retirar del fuego y reservar para enfriar.", "Una vez que la mezcla de crema se haya enfriado, mezcle el jugo de limón, la ralladura y el jugo y las semillas de maracuyá. Vierta la mezcla pospuesta en un recipiente de vidrio y enfríe en la nevera durante al menos 3 horas.", "Batir la crema doble hasta que se formen picos suaves cuando se quite la batidora. Doble el posset en la crema (puede dejar rayas de posset si lo desea).", "Para servir, espolvoree la mezcla de crema y pospuesto en la parte superior de la pavlova y decore con las semillas de fruta de la pasión y la hierba luisa."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_pavlova_48479", "title": "Pavlova de fruta de la pasión con un relleno de pospos de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["568ml / 1 pinta de crema doble", "1 vaina de vainilla, dividida longitudinalmente", "12-14 maracuyá", "6 yemas de huevo de rango medio", "150 g / 5½ oz de azúcar en polvo", "90g / 3¼ oz de azúcar glas", "185g / 6½oz de harina natural, más extra para enharinar", "60g / 2¼ oz de harina de maíz", "30 g / 1 oz de almendras molidas", "250g / 9oz de mantequilla, cortada en cubos, más extra para engrasar", "2 gotas de esencia de almendra", "1 limón, ralladura solamente", "azúcar en polvo, para quitar el polvo", "mantequilla, para engrasar", "2 cucharadas de azúcar en polvo", "4 claras de huevo de rango medio", "120ml / 4fl oz de crema fresca lista para usar", "1 maracuyá, reducido a la mitad, semillas y pulpa raspadas"], "method": ["Para el helado de maracuyá, coloque la crema, la vaina de vainilla y las semillas y la fruta de la pasión en una olla grande y caliente hasta que comience a hervir a fuego lento.", "Coloque las yemas de huevo y el azúcar en un tazón grande y bata hasta que se espese y se ponga pálido.", "Poco a poco agregue la mezcla de crema al recipiente, batiendo continuamente. Una vez que haya agregado todo el líquido, vuelva a verterlo en la sartén.", "Cocine hasta que la mezcla se espese. Transfiera a una máquina de helados durante 40-50 minutos antes de congelar, o siga las instrucciones del fabricante.", "Para el shortbread de limón, alinee dos bandejas para hornear con papel de silicona o pergamino para hornear.", "Tamiza el azúcar glas, la harina y la harina de maíz en un bol y agrega las almendras molidas.", "Transfiera la mezcla de harina a un procesador de alimentos. Agregue la mantequilla y el pulso hasta que no haya terrones visibles de mantequilla.", "Agregue la esencia de almendra y la ralladura de limón. Pulsa de nuevo, luego pasa la mezcla a una superficie ligeramente enharinada y agrégala para formar una masa suave.", "Polvore la superficie de trabajo con harina y extienda la masa. Recorta las formas como desees y colócalas en la bandeja para hornear.", "Transfiera al horno y hornee las tortas durante 8-12 minutos, o hasta que tengan un color dorado claro. Polvo con azúcar en polvo.", "Retirar del horno y dejar enfriar.", "Para el suflé de maracuyá, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase dos platos de ramekin con mantequilla y espolvoree con una cucharada de azúcar impalpable.", "Coloque las claras de huevo en un tazón limpio grande y bata hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar restante y mezcle hasta que esté espeso y brillante.", "Coloque la crema en un tazón grande por separado, agregue las semillas de fruta de la pasión y la pulpa y mezcle bien. Doble suavemente las claras de huevo batidas. Vierta la mezcla en los moldes preparados y colóquelos en una bandeja para hornear.", "Hornee por 15-20 minutos, o hasta que se levante y dore.", "Polvo con azúcar glas antes de servir.", "Para servir, coloca el soufflé en el medio del plato y coloca una quenelle de helado en el centro del soufflé.", "Sirva con el shortbread de limón en el lado del plato."], "url": "www_bbc_co_uk_food_recipes_passion_fruit_souffl_10439", "title": "Soufflé de fruta de la pasión con helado de fruta de la pasión y mantecada de limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos medianos de granja, separados", "70 g / 2½ oz de azúcar en polvo", "½ cucharadita de extracto de vainilla", "60g / 2¼ oz de harina común", "1 cucharada de harina de maíz", "pizca de sal", "pizca de crema de tártaro", "25g / 1oz de azúcar glas", "450ml / 16fl oz de leche entera", "6 yemas de huevo de gallinas camperas", "75 g / 2¾ oz de azúcar en polvo", "7 hojas de gelatina, empapada en agua fría durante 10 minutos", "Puré de maracuyá 200ml / 7fl oz (disponible en algunos supermercados grandes)", "Crema doble 350ml / 12oz", "2 limas, ralladura fina y jugo solamente", "125 g / 4½ oz de azúcar en polvo", "3 hojas de gelatina, empapada en agua fría durante 10 minutos", "colorante de comida verde", "450g / 16oz de fruta fresca, como fresas"], "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Cubra la base y los lados de una lata honda profunda de 20cm / 8in con papel de hornear. Alinee 2 bandejas para hornear con pergamino para hornear y dibuje diez líneas de 11cm / 4¼ pulgadas, separadas 2½cm en cada hoja. Voltee el pergamino para que la línea de tinta / lápiz quede debajo, para usar como plantilla.", "Para el savoiardi, mezcle las yemas de huevo y la mitad del azúcar con un batidor de mano eléctrico hasta que estén pálidos, cremosos y lo suficientemente gruesos como para dejar un rastro en la superficie cuando se quita el batidor (conocido como etapa de cinta). Agregue el extracto de vainilla y mezcle de nuevo. Tamiza la harina, la harina de maíz y la sal sobre la mezcla y dóblala suavemente.", "En un tazón limpio, bata las claras de huevo y la crema de tártaro hasta que se formen picos suaves cuando se quite el batidor. Agregue el azúcar restante una cucharada a la vez, batiendo continuamente a un merengue brillante. Doble suavemente el merengue en la mezcla de huevo y harina en 3 lotes, manteniendo la mayor cantidad posible de aire en la mezcla, hasta que se incorpore toda la harina.", "Coloque la mezcla en una bolsa de plástico con una boquilla plana de 12 mm / ⅝ in y pinte la mezcla en líneas rectas a lo largo de las líneas del pergamino de horneado preparado. Tamiza el azúcar glas en la parte superior y hornea durante 10-12 minutos hasta que quede bastante firme pero un poco esponjoso (se endurecerán a medida que se enfríen).", "Retire del horno e inmediatamente transfiera las hojas de savoiardi a los estantes de enfriamiento. Deje que se enfríe durante 2-3 minutos, luego elimine del pergamino para hornear con una espátula. Deje que se enfríe completamente en una rejilla de alambre.", "Para los bavarois, vierta la leche en una sartén y caliente hasta justo por debajo del punto de ebullición. Batir las yemas de huevo y el azúcar impalpable hasta que estén pálidas y cremosas. Vierta la leche caliente sobre los huevos y mezcle. Escurra la gelatina, exprima el exceso de humedad y luego agregue a la mezcla. Regrese la crema pastelera a la sartén y cocine suavemente hasta que la mezcla esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara (no hierva ya que la crema se puede partir). Retire del fuego.", "Transfiera a un tazón limpio y deje que se enfríe un poco antes de doblar en el puré de maracuyá. Deje que se enfríe completamente.", "En un bol, batir la crema hasta que se formen picos suaves cuando se quite el batidor y luego doblar en el bavarois de maracuyá.", "Cuando los savoiardi estén fríos, párelos verticalmente, uno al lado del otro, alrededor del borde interior de la lata. Acomódalos bien juntos para formar un sello y aplastarlos ligeramente para que permanezcan en posición vertical. Con una cuchara, coloca los bavarois en la lata forrada de savoiardi. Cubra con film transparente y deje enfriar en la nevera durante 3-4 horas hasta que se endurezca.", "Para la gelatina de lima, coloque la ralladura de limón y el jugo, el azúcar y 150 ml / 5 fl oz de agua en una sartén. Llevar a ebullición, revolviendo hasta que el azúcar se haya disuelto. Retire del fuego.", "Escurra la gelatina, exprima el exceso de humedad y agréguela a la sartén. Revuelva hasta que la gelatina se haya disuelto, luego pase a través de un tamiz fino en una jarra. Agregue la pasta colorante para alimentos para hacer una gelatina verde lima. Deje que se enfríe hasta que comience a fraguar, luego vierta sobre la superficie del conjunto de bavarois y deje enfriar durante 3-4 horas hasta que se establezca.", "Cuando esté listo para servir, retire la Charlotte de la lata y colóquela en un plato para servir o en un soporte para pasteles. Retire el papel de hornear y decore con fruta."], "url": "www_bbc_co_uk_food_recipes_passionfruit_and_lime_35313", "title": "La fruta de la pasión y lima Russian Charlotte", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/passionfruit_and_lime_35313_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "2 cucharadas de azúcar en polvo", "4 claras de huevo de rango medio", "120ml / 4fl oz de crema fresca lista para usar", "1 maracuyá, reducido a la mitad, semillas y pulpa raspadas", "25g / 1oz de mantequilla", "1 cucharada de azúcar en polvo", "2 bananas medianas, peladas y cortadas a la mitad", "helado de vainilla", "algunas ramitas de menta fresca"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase dos platos de ramekin con mantequilla y espolvoree con una cucharada de azúcar en polvo.", "Coloque las claras de huevo en un tazón limpio grande y bata hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar restante y mezcle hasta que esté espeso y brillante.", "Coloque la crema pastelera en un tazón grande por separado, agregue las semillas de fruta de la pasión y la pulpa y mezcle bien. Doble suavemente las claras de huevo batidas. Vierta la mezcla en los moldes preparados y colóquelos en una bandeja para hornear.", "Transfiera al horno y hornee por 15-20 minutos, o hasta que se levante y dore.", "Mientras tanto, para las bananas, caliente la mantequilla en una sartén antiadherente hasta que se ponga ligeramente marrón. Agregue el azúcar y los plátanos y cocine, revolviendo con frecuencia, hasta que los plátanos estén dorados por todas partes.", "Para servir, coloque los soufflés en platos para servir en sus platos de ramekin. Coloque las bananas al costado y sirva con una bola de helado de vainilla. Adorne con menta fresca."], "url": "www_bbc_co_uk_food_recipes_passionfruitandcusta_86197", "title": "Soufflé de fruta de la pasión y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["370 g / 13¼ oz de azúcar en polvo", "325ml / 11½fl oz de agua", "30g / 1¼ oz de glucosa líquida", "170 g / 6 oz de azúcar en polvo", "5 cucharadas de agua", "3 claras de huevo de gallinas camperas", "16 maracuyá, solo pulpa", "50ml / 2fl oz de jarabe de azúcar (ver arriba)", "12 g / ½ oz de leche en polvo", "½ vaina de vainilla", "3 yemas de huevo de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "4½ hojas de gelatina, remojadas en agua fría durante 15 minutos, escurridas, exprimidas", "20ml / ¾fl oz de licor de maracuyá", "Crema doble de 400 ml / 14 fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "½ base de flan de esponja redonda lista para usar, cortado por la mitad horizontalmente para formar dos tortas más delgadas (la segunda torta está reservada para otra receta)", "50 ml / 1¾fl oz de jarabe de azúcar (ver arriba)", "5 maracuyá, solo pulpa", "3 hojas de gelatina, empapadas en agua fría durante 15 minutos, escurridas", "200 g / 7¼ oz de moras frescas", "200g / 7¼ oz de grosellas frescas", "1 fruta de la pasión, solo pulpa interna"], "method": ["Para el jarabe de azúcar, coloque todos los ingredientes de jarabe en una sartén y llevar a ebullición, revolviendo ocasionalmente con una cuchara de madera. Hierva por 2-3 minutos, rozando la superficie si es necesario. Pase el jarabe a través de un tamiz fino y déjelo a un lado hasta que esté completamente frío.", "Para el merengue italiano, coloque el azúcar y el agua en una sartén y lentamente hierva hasta que el almíbar alcance los 110 ° C / 230 ° F (use un termómetro de azúcar para verificar la temperatura).", "En esta etapa, coloque las claras de huevo en un bol y bata hasta que se formen picos firmes cuando se quite el batidor.", "Tan pronto como el azúcar alcance 121C / 250F, retire la sartén del fuego. Inmediatamente reanude batiendo las claras de huevo. Mientras bate, vierta gradualmente la mezcla de azúcar y agua en las claras de huevo en un flujo constante, manteniéndolo separado de los batidores. Continúe batiendo durante 4-5 minutos, hasta que el merengue esté tibia.", "Para el maracuyá, mezcle la pulpa de la fruta de la pasión y el jarabe de azúcar en un procesador de alimentos hasta que quede suave. Cuele la mezcla a través de un tamiz fino.", "Coloque el puré de fruta de la pasión en una sartén, agregue la leche en polvo y la vaina de vainilla y deje que hierva.", "Coloque las yemas de huevo y el azúcar en un tazón y bata hasta que la mezcla forme una cinta cuando se retire la batidora (esto se denomina etapa de cinta). Vierta la mezcla de fruta de la pasión en la mezcla de huevo, batiendo continuamente, luego vierta esta mezcla de crema en la sartén. Caliente suavemente, revolviendo continuamente con una espátula, hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de la espátula (no permita que la mezcla hierva).", "Retire la sartén del fuego y mezcle la gelatina drenada con la crema pastelera. Cuele la crema a través de un tamiz cónico y déjelo enfriar. Revuelva de vez en cuando para evitar que se forme una piel.", "Cuando la crema esté tibio, doble suavemente la mitad del merengue italiano (el merengue restante se puede usar en otra receta). Agregue el licor de fruta de la pasión, y luego doblar en la crema doble batida. (Ahora debe armar el postre inmediatamente, antes de que la gelatina haga que la mezcla se solidifique).", "Coloque las bases de flan de esponja en una tabla de cortar. Mezcle 50ml / 2fl oz del jarabe de azúcar y una cucharada de puré de maracuyá reservado y cepille esta mezcla sobre la esponja. Coloque un anillo para flan de 25 cm / 10 pulgadas (6 cm / 2½ pulgadas de profundidad) sobre la esponja y recorte un círculo para formar la base (deseche el exceso de esponja).", "Llene el anillo de flan con la mezcla de natillas de maracuyá, dejando un pequeño espacio en la parte superior, y alise cuidadosamente la superficie con una espátula. Transfiera al congelador y deje enfriar durante varias horas.", "Para el glaseado, coloque el jarabe de azúcar y la pulpa de maracuyá en una sartén y caliente suavemente, luego retírelo del fuego, agregue la gelatina drenada y déjela enfriar. Una vez que esté frío, retire el delice del congelador y extienda el glaseado sobre la parte superior del relleno de maracuyá. Transfiera a la nevera para enfriar de nuevo antes de servir.", "Para servir, quite el anillo agrio calentando la parte exterior del anillo con un soplete durante unos segundos, luego deslice el anillo hacia arriba, girándolo ligeramente.", "Coloque una rodaja de delice en un plato para servir y decore con grosellas rojas, moras y pulpa de maracuyá."], "url": "www_bbc_co_uk_food_recipes_passionfruitdelicewi_92675", "title": "Delice fruta de la pasión con bayas de otoño", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 maracuyá", "Crema doble 50ml / 2fl oz", "3 cucharadas de azúcar en polvo", "2 yemas de huevo de gallinas camperas", "1 hoja de gelatina, empapada en agua fría", "1 huevo blanco de corral", "200 ml / 7 fl oz crema batida, batida a picos suaves", "1 bizcocho hecho a mano", "4 maracuyá", "20 g / oz de azúcar en polvo", "3 cucharadas de agua", "1 hoja de gelatina, empapada en agua fría", "3 maracuyá", "3 satsumas, peladas y segmentadas", "3 cucharadas de licor de naranja"], "method": ["Para el delice, saque la carne de ocho maracuyánes, colóquela en un procesador de alimentos y mezcle hasta que las semillas se despunten bien. Vierta el jugo a través de un colador fino en una olla pequeña, exprimiendo la mayor cantidad de líquido posible. Descarta las semillas.", "Agregue la crema doble y dos cucharadas de azúcar en polvo. Coloque a fuego medio y deje hervir, luego reduzca el fuego a fuego lento hasta que el azúcar se haya derretido.", "Coloque las yemas de huevo en un recipiente limpio y agregue la mezcla de fruta caliente de la pasión, batiendo constantemente.", "Regrese la mezcla de maracuyá a la cacerola y cocínela por un minuto, o hasta que espese.", "Agregue la hoja de gelatina empapada y revuelva bien para disolver, luego retire del fuego y deje enfriar.", "Mientras tanto, en un tazón limpio separado, bata la clara de huevo con la cucharada restante de azúcar, hasta que se formen picos suaves cuando se quite el batidor.", "Coloque la crema batida en un tazón limpio. Agregue la mezcla de maracuyá enfriada y dóblela suavemente para crear una mousse.", "Agregue la clara de huevo batida y dóblela en la mezcla de crema.", "Corta seis rondas del bizcocho usando seis anillos de chefs de 7,5 cm / 3 in, dejando la esponja en la parte inferior.", "Cuchara en la mousse para llenar el anillo de cada chef justo debajo de la parte superior, luego coloque en la nevera para enfriar durante 1-2 horas.", "Para el relleno, saca la carne de cuatro maracuyá y vierte a través de un colador en una olla pequeña, exprimiendo la mayor cantidad de jugo posible.", "Agregue el azúcar impalpable y el agua a la sartén y colóquelo a fuego medio. Llevar a ebullición, luego cocine a fuego lento hasta que el azúcar se haya disuelto.", "Agregue la hoja de gelatina y revuelva para disolver. Retire la sartén del fuego y deje enfriar.", "Retire las mousses de la nevera y vierta cuidadosamente la salsa de maracuyá sobre la parte superior de la mousse, llenando hasta la parte superior de los anillos. Devuelva los anillos a la nevera para que se enfríen durante 30 minutos, o hasta que se haya fijado el relleno.", "Para las satumas, saca la carne de tres maracuyá en un tazón limpio. Agregue los segmentos de satsuma y el licor de naranja y revuelva suavemente.", "Para servir, coloque cada delice en el centro de un plato. Use un mini soplete para aflojar los anillos de los chefs alrededor de la tienda, luego retire el anillo. Cuchar las satsumas y servir."], "url": "www_bbc_co_uk_food_recipes_passionfruitdelicewi_85066", "title": "Delicia de maracuyá con satsumas en licor de naranja", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 maracuyá", "284 ml / 10 fl oz crema doble bañera", "100g / 3½oz de azúcar glasé", "1 limón, solo jugo", "2 cucharaditas de Malibu o ron de coco"], "method": ["Cortar las frutas de la pasión por la mitad, sacar la pulpa con una cuchara y colocar en un bol.", "Agite suavemente la crema en un tazón grande y colóquela en el refrigerador, junto con cuatro vasos.", "Tamice el azúcar glas en un tazón y déjelo a un lado.", "Cuando desee comer, mezcle el azúcar glas en la crema con el jugo de limón y el ron de coco.", "Doble la pulpa de la fruta de la pasión y vierta el tonto en los vasos fríos.", "Sirve con galletas de tu elección."], "url": "www_bbc_co_uk_food_recipes_passionfruitfool_74615", "title": "Tonto de la fruta de la pasión", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "125g / 4oz de azúcar en polvo", "Harina normal de 40 g / 1½ oz, más extra para quitar el polvo", "1 cucharada de leche entera", "2 huevos de gallinas camperas, separados", "8 maracuyá, solo pulpa interna, tamizada para quitar las semillas", "mantequilla, para engrasar", "200 g / 7 oz de azúcar en polvo", "200 ml / 7 fl oz de agua", "Licor de coco 50ml / 2fl oz", "crema doble, ligeramente azotada, para servir"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque la mantequilla y el azúcar en un tazón grande y mezcle bien, hasta que esté suave y esponjoso.", "Agregue la harina, la leche, las yemas de huevo y la mitad de la pulpa de la fruta de la pasión, y revuelva hasta que se combinen.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos rígidos cuando se quite el batidor.", "Dobla las claras de huevo en la mezcla de maracuyá.", "Divida la mezcla de pastel entre cuatro moldes engrasados ​​y enharinados de 6 fl oz / 170 ml o moldes dariole y colóquelos en una bandeja para hornear.", "Transfiera al horno y hornee durante 12 minutos, o hasta que esté cocido.", "Mientras tanto, para la salsa, coloque el azúcar y el agua en una sartén a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 15 minutos, hasta que espese a un jarabe, luego retire del fuego.", "Agregue la pulpa de maracuyá restante y el licor de coco y mezcle bien.", "Para servir, coloque los pudines en sus platos en platos, rocíe la salsa sobre la parte superior de cada uno y cubra con una cucharada de crema batida."], "url": "www_bbc_co_uk_food_recipes_passionfruitpuddings_86768", "title": "Postres de fruta de la pasión", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de leche entera", "2 cucharadas de azúcar en polvo", "2 yemas de huevo de gallinas camperas", "1 cucharada de harina de maíz", "2 frutas de la pasión, pulpa sacada, pieles reservadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la leche y el azúcar en una cacerola y deje que hierva.", "Batir las yemas de huevo y la harina de maíz en un bol.", "Retire la sartén del fuego y bata las yemas de huevo y la mezcla de harina de maíz, batiendo continuamente hasta que la mezcla comience a espesarse.", "Mezcle la pulpa de la fruta de la pasión en la mezcla de natillas, vierta la mezcla de soufflée en las pieles de fruta de la pasión reservadas ahuecadas y colóquelas en una bandeja para hornear. Transfiera al horno para cocinar por 5-7 minutos o hasta que se levante y dore. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_passionfruitsouffle_92900", "title": "Soufflé de maracuyá", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]