[{"ingredients": ["8 chuletas de cordero", "115g / 4oz de harina natural, condimentada con sal y pimienta negra recién molida, al gusto", "2 huevos de gallinas camperas", "Pan rallado blanco de 115g / 4oz", "2 cucharadas de alcaparras picadas", "2 cucharadas de perejil fresco de flatleaf, picado", "2 cucharadas de aceite", "55 g / 2 oz de mantequilla", "500g / 1lb de papas nuevas pequeñas", "170g / 6oz de jamón cocido", "1 chalote, finamente picado", "10 pepinillos, picados", "3 cebollas de primavera, en rodajas finas", "1 cucharada de cebollín, picado", "2 cucharadas de vinagre de vino tinto", "2 cucharadas de mostaza Dijon", "8 cucharadas de aceite de oliva", "sal"], "method": ["Corta 2.5cm / 1 in de profundidad en las chuletas y corta el exceso de grasa, teniendo cuidado de dejar algo de grasa para darle sabor.", "Dragar las chuletas en la harina sazonada, sacudiendo el exceso de harina.", "Batir los huevos en un tazón.", "Mezcle las migas de pan con las alcaparras y el perejil.", "Sumerja las chuletas enharinadas una a la vez en huevos y luego en la mezcla de migas de pan. Sacuda el exceso de recubrimiento y toque suavemente para darle forma con una espátula.", "Calienta el aceite en una sartén. Coloque las chuletas en la sartén, con la presentación hacia abajo. Agregue la mantequilla y cocine por dos minutos en cada lado, hasta que esté bien coloreado. Saque y escurra las toallas de cocina.", "Mientras tanto, para hacer la ensalada, cocine la piel de papas pequeñas en agua hirviendo con sal. Cuando recién cocinados los sacan y escurren en un colador.", "Pica el jamón y mezcla con el resto de los ingredientes de la ensalada en un tazón.", "Mezcle los ingredientes del aderezo. Establecer a medio lado y verter la otra mitad en la ensalada.", "Corte las papas calientes por la mitad a lo largo en un tazón. Verifica el condimento.", "Coloque una porción de ensalada en el medio de un plato con las 2 chuletas en la parte superior. Espolvorea el resto del aderezo y sirve."], "url": "www_bbc_co_uk_food_recipes_lambcutletsinaparsle_78338", "title": "Chuletas de cordero en una corteza de alcaparras de perejil con patata tibia, jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "6 cucharadas de aceite de oliva", "1 cebolla grande, pelada, finamente cortada", "2 dientes de ajo, pelados y finamente picados", "2 cucharaditas de hojas de tomillo", "½ cucharadita de pimentón ahumado", "2 latas de garbanzos x 400 g / 14 oz, escurridas, enjuagadas", "½ limón, solo jugo", "sal y pimienta negra recién molida", "8-12 chuletas de cordero (2-3 por persona)", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "50ml / 2fl oz de vino tinto", "100 ml / 3½ fl oz de caldo de pollo", "1 cucharada de vinagre balsámico"], "method": ["Para el puré, caliente la mantequilla y dos cucharadas de aceite de oliva en una sartén grande a fuego muy lento. Agregue la cebolla y cocínela por unos 15 minutos hasta que esté suave y dorada.", "Agregue el ajo, la mitad de tomillo y el pimentón y cocine por otros cinco minutos.", "Pon a hervir una olla con agua, luego agrega los garbanzos y caliéntalos durante 2-3 minutos. Escurrir bien.", "En un procesador de alimentos, mezcle los garbanzos, las tres cuartas partes de las cebollas caramelizadas, el jugo de limón y el aceite de oliva restante para formar un puré suave.", "Sazonar bien con sal y pimienta negra recién molida, luego volver a la cacerola y mantener el calor. (Alternativamente, puede mezclar todos los ingredientes en la sartén usando una licuadora de mano).", "Mientras tanto, para las chuletas de cordero, caliente otra sartén grande a fuego alto. Sazone las chuletas de cordero con sal y pimienta negra recién molida y rocíe sobre el aceite de oliva.", "Cocine las chuletas en lotes, agregándolas a la sartén caliente para dorarlas rápidamente por ambos lados, luego reduzca el fuego a medio y fría por otros dos minutos en ambos lados (por raro), 2-3 minutos en ambos lados (para el medio). ) o 4-5 minutos en ambos lados (por bien hecho).", "Retire las chuletas de la sartén y déjelas reposar cubiertas con papel de aluminio para mantener el calor. Escurra la grasa de la sartén y luego mezcle el vino, raspando los trozos dorados del fondo para quemar.", "Permita que el líquido burbujee y reduzca durante unos minutos, luego agregue el caldo, el vinagre y el tomillo restante. Cocine a fuego lento durante 3-4 minutos hasta que esté reducido y ligeramente espesado.", "Para servir, espolvorea un poco de puré de garbanzos en cada plato, coloca las chuletas de cordero en la parte superior, rocía sobre la salsa y espolvoréala con las cebollas caramelizadas restantes."], "url": "www_bbc_co_uk_food_recipes_lambcutletswithchick_92256", "title": "Chuletas de cordero con garbanzos, cebolla caramelizada y puré de pimentón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "3 dientes de ajo", "2 fuentes de romero, finamente picadas", "4 chuletas de cordero"], "method": ["Precalentar una barbacoa a caliente.", "Combina el aceite de oliva, el ajo y el romero en un tazón pequeño. Revuelva bien y cepille las chuletas con el aceite saborizado en ambos lados.", "Cocine durante unos tres minutos en cada lado - la carne todavía debe estar ligeramente rosada en el interior."], "url": "www_bbc_co_uk_food_recipes_lambcutletswithgarli_83750", "title": "Chuletas de cordero con ajo y romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de piñones", "1 cucharada de salvia fresca, finamente picada", "2 cucharadas de vino blanco seco", "100ml / 3½ fl oz crema doble", "1 diente de ajo, en rodajas", "10 cucharadas de aceite de oliva italiano", "8 ramitas de romero fresco, solo hojas, más o menos picadas", "4 patatas grandes, al dente precocinadas, piel sobre", "12 chuletas de cordero, recortadas", "2 cucharadas de vinagre balsámico", "sal y pimienta negra recién molida, al gusto", "judías verdes cocidas"], "method": ["Precalentar la parrilla a alto.", "En una cacerola pequeña tueste los granos de pino por aproximadamente dos minutos (no los deje quemar).", "Agregue la salvia y el vino blanco y cocine a fuego lento suavemente durante un minuto.", "Agregue la crema, sazone al gusto con sal y pimienta negra recién molida y cocine a fuego lento hasta que espese.", "Usando una licuadora de mano, mezcle la mezcla para crear una textura de salsa suave.", "En una sartén grande, freír el ajo en ocho cucharadas de aceite de oliva hasta que esté bien dorado a fuego medio, permitiendo que el aceite de oliva dé sabor.", "Retire el ajo con una cuchara ranurada y deséchelo, luego agregue el romero al aceite.", "Cortar las papas precocinadas de aproximadamente 1 cm / 0,5 in de espesor y cocinar en aceite aromatizado durante aproximadamente dos minutos a cada lado o hasta que estén doradas y crujientes.", "Mientras tanto, coloque las chuletas de cordero en una bandeja grande, rocíe sobre un par de cucharadas de aceite de oliva, el vinagre balsámico, y sazone al gusto con sal y pimienta negra recién molida. Con las manos, mezcle el aderezo en la carne y ase a la parrilla durante aproximadamente dos minutos por cada lado, o hasta que se cocinen a su gusto.", "Para servir, apile 4-5 rebanadas de papa una sobre otra en el medio de cada una de las cuatro placas. Apoya tres chuletas de cordero en la pila de patatas y rocía con la salsa sabrosa caliente. 11. Sirve con las judías verdes."], "url": "www_bbc_co_uk_food_recipes_lambcutletswithsaute_73730", "title": "Chuletas de cordero con patatas salteadas y salsa cremosa de salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de salvia picada finamente", "1 cucharada de tomillo finamente picado", "2-3 dientes de ajo, finamente picados", "aceite de oliva", "2 filetes de cordero, que pesan aproximadamente 175 g / 6 oz cada uno", "400g / 14oz de frijoles flageolet enlatados, escurridos y enjuagados", "1 cebolla roja, finamente picada", "2 dientes de ajo picados", "2 ramitas de tomillo", "½ cestito de tomates cherry, descuartizado", "1 cucharada de perejil de flatillo picado", "1 cucharada de aceite de oliva", "salpicaduras de vinagre balsámico", "buen apretón de jugo de limón", "sal", "pimienta negra recién molida", "1 puerro, finamente cortado", "1 cucharada de aceite de oliva", "1 cucharadita de azúcar moreno", "50ml / 2fl oz de vinagre balsámico"], "method": ["Vierte la salvia, el tomillo, el ajo y el aceite de oliva en una pasta espesa, usando un mortero y un mortero. Smear esto sobre los filetes de cordero.", "Coloque los frijoles, la cebolla roja, el ajo, el tomillo, los tomates y el perejil en una sartén con el aceite de oliva. Coloque a fuego medio y cocine a fuego lento durante 3-4 minutos, revolviendo, para calentar. Agregue un poco de vinagre balsámico y un chorrito de jugo de limón. Sazonar con sal y pimienta negra recién molida. Apartar y mantener caliente.", "Mientras tanto, prepara el chutney. Cocine los puerros finamente triturados en aceite de oliva durante unos minutos, luego agregue el vinagre balsámico y el azúcar moreno. Cocine por cinco minutos a fuego medio-bajo.", "Para el cordero calentar una sartén de base pesada a fuego medio-alto hasta que esté caliente. Agregue el cordero y dore durante dos minutos en cada lado. Transfiera a un plato caliente.", "Reduzca el fuego a medio-bajo. Agregue un gran glug de vinagre balsámico a la sartén. Chisporrotear durante unos segundos, raspando cualquier sedimento de la sartén. Sazonar con sal y pimienta y agregar a la mezcla de chutney.", "Para servir, vierta la mezcla de frijoles en platos calientes. Coloque el cordero en la parte superior y rocíe en la salsa picante de puerro caliente."], "url": "www_bbc_co_uk_food_recipes_lambfilletwithflageo_71653", "title": "Filete de cordero con frijoles flageolet y chutney de puerro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas gruesas de cuello de cordero", "harina común, para dragado", "buen aceite de oliva con sabor a glug", "3 cebollas, peladas y cortadas en cuñas", "2-3 chirivías grandes, peladas y cortadas en sextas", "6 dientes de ajo grandes y jugosos, pelados, cortados por la mitad", "sal y pimienta negra recién molida", "6-8 ramitas de romero fresco", "6-8 patatas pequeñas, cortadas por la mitad"], "method": ["Precalentar el horno a 170C / 350F / Gas 4.", "Ligeramente dragar las chuletas de cordero en la harina. Caliente el aceite en una bandeja poco profunda para horno con tapa, luego agregue las chuletas de cordero y cocine hasta que se dore por ambos lados. Retire el cordero de la sartén y déjelo a un lado. Agregue las cebollas, chirivías y ajo en la misma sartén y cocine por 2-3 minutos. Sazonar bien con sal y pimienta negra recién molida y agregar el romero.", "Regrese las chuletas de cordero a la sartén, ponga las papas alrededor de las chuletas, sazone bien con sal y pimienta negra recién molida y vierta solo el agua suficiente para cubrir el contenido de la sartén. Recorta un círculo de papel resistente a la grasa del mismo tamaño y forma que el interior de la sartén. Coloque el círculo de papel sobre el cordero y las verduras, luego cubra la olla con la tapa.", "Cocine en el horno precalentado durante una hora o más, hasta que la carne esté tierna."], "url": "www_bbc_co_uk_food_recipes_lambhotpot_92585", "title": "Estofado de cordero de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambhotpot_92585_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, derretida", "½ patata, pelada y cortada en finas rodajas redondas", "sal y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "200g / 7oz de chuleta de cordero, deshuesada y cortada en trozos pequeños", "1 cucharada de harina", "50ml / 2fl oz de vino tinto", "100 ml / 3½ fl oz de agua", "½ zanahoria pelada, rebanada, blanqueada y refrescada"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sumerja las rodajas de papa en la mantequilla derretida.", "Sazonar, poner en una bandeja para hornear y asar durante 12 minutos hasta que estén dorados.", "Coloque el aceite de oliva en una sartén grande a fuego medio a alto.", "Sazonar el cordero, echar la harina y freír hasta que esté coloreado por todos lados.", "Agregue el vino tinto y el agua y revuelva y cocine hasta que la salsa se reduzca a la mitad.", "Una vez que la salsa se espese, sazone con sal y pimienta negra recién molida.", "Sirva el caldo de cordero en un plato caliente y cubra con la papa y la zanahoria."], "url": "www_bbc_co_uk_food_recipes_lambhotpotwithpotato_80043", "title": "Lamb 'hotpot' con patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de mantequilla sin sal ablandada", "2 perifollo de ramitas, más o menos picadas", "2 ramitas de estragón, más o menos picadas", "2 filetes de anchoa fresca, toscamente picados", "1 diente de ajo, aproximadamente picado", "½ limón, solo jugo", "4 x 200 g / 7 oz de filetes de cordero, recortado", "pimienta negra recién molida", "4 hojas brik pastelería (disponible en tiendas especializadas del norte de África o en línea, alternativamente, use filo pastelería)", "110 g / 4 oz de mantequilla clarificada, derretida", "aceite vegetal, para freír en grasa", "4 alcachofas de globo grandes, hojas retiradas, cortar corta y medio estrangular eliminado con una cucharadita", "½ limón, solo jugo", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "2 perifollo de ramitas, más o menos picadas", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "Jus de cordero listo para usar de 110 ml / 4 fl oz o caldo de cordero reducido", "2 cucharadas de vinagre de jerez", "4 cucharadas de aceite de oliva", "2 tomates maduros, cortados a la mitad longitudinalmente"], "method": ["Para el cordero, coloque la mantequilla ablandada en un bol, agregue el perifollo, estragón, anchoas, ajo y jugo de limón y bata bien para combinar.", "Sazonar el cordero con pimienta negra recién molida.", "Coloque una pieza de hojaldre brik sobre una superficie de trabajo limpia o tajadera y cepille con la mantequilla clarificada.", "Coloque un filete de cordero en el medio de la hoja de hojaldre, extienda la mitad de la mantequilla de anchoa en la parte superior, luego coloque otro filete en la parte superior. Dobla la masa en un paquete, encerrando completamente el cordero.", "Coloque una segunda hoja de hojaldre en la superficie de trabajo, cepille con mantequilla clarificada. Coloque el cordero envuelto encima y doble una vez más. Repita con los dos filetes y pasteles restantes. Ate bien los paquetes con hilo de cocina. Coloque en un plato o bandeja y transfiera a la nevera para descansar por lo menos una hora.", "Para cocinar el cordero, precaliente el aceite vegetal en una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido). Coloque con cuidado los paquetes de cordero en la freidora de grasa, uno a la vez, y cocínelos durante 12-14 minutos, sin darles vuelta, ya que la masa es muy frágil. Retire el cordero de la freidora con una cuchara grande ranurada, escurra sobre papel de cocina y deje que el cordero descanse en un lugar cálido durante cinco minutos.", "Para las alcachofas, corta las alcachofas finamente y frota con el jugo de limón. Calentar una fritura hasta que esté caliente, agregar la mantequilla, el aceite de oliva, las alcachofas en rodajas y el ajo y freír durante 2-3 minutos, o hasta que estén tiernos. Agregue el perifollo y sazone con sal y pimienta negra recién molida, al gusto.", "Para la salsa, caliente una sartén por separado hasta que esté caliente. Agregue la mantequilla y cuando se haya vuelto de color castaño oscuro, agregue el aceite de oliva, el jugo de cordero y el vinagre de jerez. Cocine a fuego lento por otros dos minutos.", "Para el \"confit\" de tomate, caliente suavemente el aceite de oliva y los tomates en una sartén y cocine por unos minutos hasta que se ablanden.", "Para servir, corte el exceso de masa de las parcelas de cordero y deséchelo. Corta cada paquete en cuatro rebanadas gruesas. Coloque las alcachofas en el centro de cada plato para servir, luego cubra con dos trozos de cordero envuelto en pasta por persona. Coloque la salsa sobre la parte superior y coloque la mitad de tomate en un lado del plato. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_lambfilletwrappedinb_90937", "title": "Filete de cordero envuelto en brik con tomate 'confit', alcachofas y jus de cordero", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700 g / 1lb10 oz de carne de cordero picada finamente", "1 cebolla, muy finamente picada", "2 cucharaditas de mejorana fresca picada u orégano o 1 cucharadita de buena calidad secada", "2 cucharadas de menta fresca picada", "½ cucharadita de chile en polvo", "pellizcar el cardamomo de tierra", "Sal marina de Maldon y pimienta negra recién molida", "500g / 1lb 2 oz de harina común", "½ cucharadita de azúcar", "1 cucharadita de sal marina fina", "2 cucharaditas de orégano seco", "2 cucharadas de chile en hojuelas", "1 paquete de levadura seca", "250ml / 8fl oz de agua tibia", "1 cucharada de aceite de oliva", "2 cucharadas de aceite de oliva virgen extra", "5 cucharadas de yogur griego grueso", "2 cucharadas de tahini (pasta de semillas de sésamo)", "1 cucharada de jugo de limón fresco", "I diente de ajo, aplastado", "2 cucharadas de cilantro fresco picado", "Hojas de menta fresca", "1 cebolla roja pequeña, cortada finamente y empapada en jugo de limón", "8 pinchos de madera, previamente empapados en agua"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Para los kebabs, coloque todos los ingredientes del kebab en un tazón grande. Sazone generosamente con mucha sal y pimienta negra recién molida y mezcle muy bien.", "Divida la mezcla en ocho formas de salchicha ásperas y luego ponga cada una en un pincho, asegurándose de que estén bien envueltas alrededor de los pinchos. Refrigere hasta que esté listo para su uso. Mientras tanto, prepara los panes planos y el aderezo.", "Cuando esté listo, caliente una sartén grande o una plancha plana hasta que esté caliente y cocine los kebabs durante 4 a 5 minutos o hasta que estén cocidos.", "Para los panes planos, coloque la harina en un bol y mezcle el azúcar, la sal, el orégano y los copos de chile.", "Haga un pozo en el centro de la mezcla de harina y vierta la levadura seca. Agregue suficiente agua tibia para formar una masa áspera.", "Rocíe el aceite de oliva sobre la masa y amasar durante unos diez minutos. Divida en cuatro bolas y luego extiéndalas en óvalos largos.", "Coloque los panes planos en bandejas para hornear ligeramente engrasadas que hayan sido precalentadas en el horno. Pinche todo muy bien, coloque en el horno y cocine durante tres minutos por cada lado.", "Para el aderezo, coloque todos los ingredientes del aderezo en una licuadora y mezcle para formar una pasta suave.", "Para servir, ponga un pan plano en un plato para servir con un par de pinchos en la parte superior, rocíe con el aderezo y adorne con algunas de las cebollas empapadas en limón y las hojas de menta fresca."], "url": "www_bbc_co_uk_food_recipes_lambkabobmashwiwiths_79721", "title": "Mashwi de kabob de cordero con panes picantes y aderezo de yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero 300g / 10½oz, cortado en tiras de 1cm / ½ pulgada", "½ cebolla rallada", "3 dientes de ajo", "sal y pimienta negra recién molida", "1 cucharadita de comino molido", "½ cucharadita de pimienta de cayena", "4 cucharadas de aceite de oliva", "4 panes pitta", "½ limón, solo jugo", "4 cucharadas de yogur griego", "1 cucharadita de orégano picado", "3 cebollas de primavera, en rodajas"], "method": ["Mezcle el cordero con la cebolla en un tazón.", "Mash el ajo con un poco de sal. Agregue el puré de ajo, una cucharadita de pimienta negra, comino, pimienta y aceite de oliva al cordero en rodajas y mezcle bien.", "Cubra y deje marinar en el refrigerador durante al menos 20 minutos, más tiempo si el tiempo lo permite.", "Caliente una sartén o una sartén de base pesada hasta que esté muy caliente.", "Agregue el cordero a la sartén o plancha, dejando dos minutos para cada lado. Alternativamente, chargrill o asar a la parrilla las tiras de cordero.", "Mientras tanto, calienta los panes Pitta. Rebana a lo largo de los panes pitta para formar cuatro bolsillos.", "Llene los bolsillos de pitta con el cordero recién cocido, el jugo de limón, el yogur, el orégano y las cebolletas y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_lambkebab_72360", "title": "Kebab de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 ramita grande de romero", "55 g / 2 oz de cordero, cortado en cubos", "4 albaricoques secos", "1 calabacín, cortado en cubos", "2-3 cucharadas de aceite de oliva, más extra para lloviznar", "200ml / 7fl oz de caldo de cordero", "100g / 3½oz de cuscús", "1 cebolla roja pequeña, finamente picada", "1 ramita de perejil fresco, picado", "20 g / ¾ oz de pasas doradas", "sal y pimienta negra recién molida"], "method": ["Retire las hojas de romero de su tallo, dejando una pulgada en la parte superior. Picar las hojas de romero y mezclar a través del cordero. Agregue los albaricoques, los calabacines y el aceite de oliva. Cubra la mezcla y deje macerar en la nevera durante al menos 30 minutos.", "Coloque el caldo de cordero en una sartén y deje hervir. Vierta el caldo sobre el cuscús. Cubra con una película adhesiva y déjela durante cinco minutos. Agregue la cebolla roja, el perejil y las pasas al cuscús. Mezcle bien y sazone con sal y pimienta negra recién molida.", "Ensarta el cordero en el tallo de romero, alternando con cubos de calabacín y albaricoques. Coloque el cordero en una sartén mediana de plancha caliente. Planche el cordero, volteándolo ocasionalmente hasta que esté dorado por todos los lados y cocido.", "Para servir, coloque la mezcla de cuscús en un plato de servir. Coloque el pincho de kebab sobre el cuscús. Para finalizar, rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_lambkebabswithcousco_86597", "title": "Brochetas de cordero con cuscús", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["jugo de medio limón", "450 g / 1lb de carne picada de cordero", "1 cucharada de aceite", "55g / 2oz de hojas frescas de cilantro (lavadas y picadas)", "4 dientes de ajo (aplastados)", "4 chiles verdes (sin semillas y picados)", "½ cucharadita de polvo de cilantro", "1 cucharadita de comino en polvo", "½ cucharadita de granos de pimienta negra (triturados)", "½ cucharadita de polvo de cúrcuma", "½ cucharadita de sal masala", "2 cucharaditas de jengibre rallado", "1 cucharadita de sal"], "method": ["Mezcle dos cucharaditas de jugo de limón y la carne de cordero en un bol.", "Mezcle el aceite, el ajo, el jengibre, los chiles, los granos de pimienta triturados, el comino, el polvo de cilantro, el jugo de limón, la cúrcuma en polvo y la sal en un procesador de alimentos hasta obtener una pasta.", "Revuelva la pasta y el cilantro en la carne picada. Con las manos mojadas, ensarte la carne en formas de salchichas largas. Gire la carne alrededor del pincho, presionando suavemente todo alrededor. Alternativamente, dé forma a la mezcla en pequeñas hamburguesas.", "Cepille cada kebab con un poco de aceite y ase a la parrilla a fuego medio o haga una barbacoa por 4-5 minutos en cada lado, o hasta que esté bien cocido."], "url": "www_bbc_co_uk_food_recipes_lambkebabs_2214", "title": "Kebabs de cordero", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambkebabs_2214_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 10½oz de carne de cordero magra", "cilantro de racimo pequeño, picado", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro, trituradas", "1 cucharadita de chile picado", "1 cucharadita de cúrcuma", "pellizcar la canela seca", "sal y pimienta negra recién molida", "1 cucharada de piñones", "1 lima, cáscara y jugo solamente", "Yogur 110 g / 4 oz", "½ pepino, rallado y exprimido para eliminar el agua", "pequeño manojo de menta fresca, picado", "1 limón, jugo y ralladura solamente", "cilantro fresco, picado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Mezcle todos los ingredientes secos y tueste en una sartén seca. Aplastar en un almirez y mortero o mezclar en un molinillo de especias hasta convertirlo en polvo. Mezcle el cordero, la ralladura de lima y el jugo y todos los ingredientes tostados. Forma parte de los pinchos de madera y ponlos a un lado para descansar.", "Para la salsa de yogurt, mezcle los ingredientes del yogur en un tazón y déjelos a un lado.", "Caliente una sartén a prueba de horno hasta que fume y agregue los koftas. Planche en todos los lados para obtener marcas de carbón marrón, luego transfiéralo al horno para cocinar durante diez minutos, o hasta que esté completamente cocido.", "Servir en un plato con cilantro picado espolvoreado en la parte superior y parte de la mezcla de yogur."], "url": "www_bbc_co_uk_food_recipes_lambkoftaswithacucum_70013", "title": "Koftas de cordero con yogur de pepino y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 cucharadas de semillas de cilantro", "2 cucharadas de semillas de alholva", "1 cucharada de semillas de mostaza", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 palito de canela, roto en pedazos", "5 dientes", "1 cucharada de cúrcuma molida", "4 corderos", "sal y pimienta negra recién molida", "1 guindilla verde para pájaros", "2 dientes de ajo, pelados", "1.5cm / ¾in en pieza de raíz de jengibre fresco, pelado", "1 cebolla, pelada, finamente cortada", "12 hojas de curry", "3 vainas de cardamomo", "2 hojas de laurel", "400g / 14oz de tomates picados en lata", "200ml / 7fl oz de caldo de carne", "2 cucharaditas de jugo de tamarindo", "Harina de chapati 325 g / 11½ oz (disponible en algunos supermercados y tiendas de comestibles asiáticas), más extra para quitar el polvo", "1½ cucharadita de sal", "170-230 ml / 6-8 fl oz de agua", "1 cucharada de aceite vegetal", "2 chalotes, pelados, finamente cortados", "2 cucharadas de harina normal", "2-3 cucharadas de aceite vegetal"], "method": ["Para el polvo de curry madras, coloque todos los ingredientes de curry en polvo en un molinillo de especias y muela hasta obtener un polvo fino.", "Para las madras de cordero, condimente el cordero con sal y pimienta negra recién molida. Caliente el aceite vegetal en una cazuela grande antiadherente y cocine las patas de cordero durante 1-2 minutos en todos los lados, o hasta que se doren por todas partes. Retire las espigas de cordero de la sartén y déjelas a un lado.", "Mezcle el chile, el ajo y el jengibre en un procesador de alimentos pequeño hasta formar una pasta, agregando un chorrito de agua si es necesario.", "Coloque la sartén utilizada para cocinar el cordero a fuego alto y agregue las cebollas (agregue un chorrito de aceite a la sartén si está demasiado seco). Freír por 2-3 minutos, o hasta que se suavice y comience a colorear.", "Agregue 2½ cucharadas de polvo de curry a la olla junto con el ajo, el chile y la pasta de jengibre, las hojas de curry, el cardamomo y las hojas de laurel. Revuelva bien.", "Regrese las espigas de cordero a la sartén y cúbralas con los tomates picados, el caldo de carne y el jugo de tamarindo. Sazonar, al gusto, con sal y pimienta negra recién molida. Cubra la olla con la tapa a fuego lento durante 2 horas, o hasta que el cordero esté muy tierno.", "Mientras tanto, para los chapatis, tamice la harina y la sal en un tazón grande y gradualmente mezcle suficiente agua para formar una masa suave (es posible que no necesite toda el agua). Cubra y reserve para descansar por 10 minutos.", "Convierta la masa en una superficie de trabajo enharinada, amase ligeramente y divídala en 12 bolas. Estirar cada bola lo más delgada posible.", "Calentar una sartén a fuego alto y agregar el aceite. Cocine los chapatis de a uno por vez, friéndolos durante 1-2 minutos en ambos lados o hasta que estén dorados e hinchados.", "Para las chalotas fritas, espolvorea los chalotes en rodajas en la harina. Calentar el aceite vegetal en una sartén a fuego alto y freír las chalotas durante 2-3 minutos, o hasta que estén doradas y crujientes. Retirar del aceite y escurrir sobre papel de cocina.", "Para servir, quite los corderos de la sartén y coloque uno en cada plato de servir. Coloque la sartén a fuego alto y cocine a fuego lento hasta que el líquido se reduzca a una salsa espesa, suficiente para cubrir la parte posterior de una cuchara. Vierta la salsa sobre las patas de cordero y adornar con los chalotes crujientes. Sirve los chapatis en un lado."], "url": "www_bbc_co_uk_food_recipes_lambmadraswithchapat_93782", "title": "Cordero madras con chapatis", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de trigo bulgar", "2 cucharadas de aceite de oliva", "1 chile, finamente picado", "1 cebolla mediana, finamente picada", "½ cucharadita de cilantro molido", "½ cucharadita de comino molido", "500g / 1lb 2oz pierna de cordero magra, toda la grasa visible eliminada, en cubos", "1 huevo", "40 g / 1 ½ oz de piñones, finamente picados", "2 cucharaditas de menta, picadas", "3 cucharaditas de perejil picado", "2 chiles, sin semillas y finamente picados", "1 cucharadita de hojas de menta fresca picada", "1 cucharadita de cebollín, cortado", "1 cucharadita de hojas de cilantro, finamente picadas", "1 cucharadita de perejil, finamente picado", "1 diente de ajo, triturado hasta formar una pasta en una mano de mortero", "½ cucharadita de comino molido", "250 g / 9 oz de yogur de estilo griego", "hojas de ensalada mixta"], "method": ["Primero, prepara el yogur con especias. Combine todos los ingredientes de yogur en un tazón grande. Deja durante una hora para permitir que los sabores se desarrollen.", "Para las koftas de cordero, remoje el trigo bulgar en agua fría durante 30 minutos. Escurrir y exprimir secar.", "Caliente la mitad del aceite de oliva en una sartén, agregue el chile, la cebolla, el cilantro molido y el comino molido y cocine a fuego lento durante 15 minutos. Dejar enfriar.", "Coloque el cordero en un procesador de alimentos junto con el huevo y la mezcla de cebolla enfriada. Mezcle hasta que la mezcla tenga la consistencia de una pasta suave.", "Retire la mezcla de cordero y colóquelo en un recipiente. Agregue el trigo bulgar junto con los granos de pino y la menta picada y el perejil.", "Moje sus manos y dé forma a 1 cucharadita de la mezcla en un koftas pequeño con forma de tronco. Repita con la mezcla restante.", "Caliente una cucharada sopera de aceite de oliva en una sartén, luego agregue las koftas en tandas, volteándolas regularmente hasta que estén doradas y cocidas. Esto debería tomar aproximadamente 10 minutos.", "Cuando estén cocidos, escurra los koftas sobre papel de cocina absorbente y manténgalos calientes en el horno.", "Sirva con salsa de yogur con especias y hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_lambkoftaswithspiced_74874", "title": "Koftas de cordero con yogur con especias", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz wheatgerm", "250g / 10½oz de carne de cordero magra", "1 huevo de gallinas camperas", "1 cebolla, finamente picada", "1 cucharada de piñones, finamente picados", "2 cucharadas de perejil fresco finamente picado", "1 cucharadita de aceite de oliva, para freír", "1 chile rojo, sin semillas y finamente picado", "1 cucharada de menta fresca finamente picada", "1 cucharada de perejil fresco finamente picado", "1 cucharada de cilantro fresco finamente picado", "1 diente de ajo, aplastado", "½ cucharadita de comino molido", "200g / 7oz de yogur bajo en grasa de estilo griego"], "method": ["Coloque el germen de trigo en un recipiente grande y cubra con agua fría. Deje reposar durante diez minutos, luego drene y seque con toallas de cocina para eliminar el exceso de agua.", "Coloque el germen de trigo, carne de cordero, huevo, cebolla, piñones y perejil en un tazón grande y mezcle bien. Haga rodar pequeños trozos de la mezcla de cordero en pequeñas bolas, del tamaño de una pelota de golf y colóquelas en una bandeja para hornear engrasada, cúbralas con una película adhesiva y colóquelas en la nevera para que se enfríen durante 30-45 minutos.", "Mientras tanto, para el yogur con especias, coloque el chile, la menta, el perejil, el cilantro, el ajo, el comino y el yogur en un tazón limpio y mezcle bien.", "Caliente una cucharada de aceite en una sartén grande a fuego medio. Agregue las bolas de kofta y fría, volteándolas regularmente, hasta que se doren y cocinen todo el tiempo.", "Para servir, divida las bolas calientes de kofta entre tres platos y cubra con una cucharada de yogurt con especias."], "url": "www_bbc_co_uk_food_recipes_lambkoftaswithspiced_80781", "title": "Koftas de cordero con yogur con especias", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 Dirígete al messenger", "½ cucharadita de canela molida", "½ cucharadita de jengibre molido", "½ cucharadita de pimentón dulce ahumado", "½ cucharadita de comino molido", "¼ cucharadita de pimienta negra recién molida", "¼ cucharadita de cúrcuma molida", "3 cucharadas de aceite de oliva", "1 kg / 2 lb 3 oz de filete de cordero, cortado en trozos grandes", "1 cebolla, rebanada gruesa", "2 dientes de ajo, pelados, finamente picados", "1 x 400g / 14oz de tomates picados en lata", "2 cucharadas de melaza de granada (disponible en supermercados de Oriente Medio y algunos supermercados)", "½ cucharadita de azafrán", "350ml / 12fl oz de caldo de pollo", "Albaricoques secos sin hueso 125g / 4½oz, partidos por la mitad", "Aceitunas verdes 110 g / 4 oz, piedras quitadas", "75g / 2½oz de almendras enteras", "1 cilantro fresco pequeño racimo", "sal y pimienta negra recién molida", "175g / 6oz de trigo bulgar", "700ml / 1 pinta 5fl oz de caldo de pollo", "2 cebollas rojas pequeñas, peladas, finamente picadas", "300 g / 10½ oz de pistachos, conchas eliminadas, más o menos picadas", "1 limón, solo jugo", "3 cucharadas de aceite de oliva virgen extra", "5 cucharadas de perejil de flatleaf fresco picado", "5 cucharadas de hojas de cilantro fresco picado", "5 cucharadas de menta fresca picada", "sal y pimienta negra recién molida"], "method": ["Para el tagine de cordero, mezcle el ras-el-hanout, la canela molida, el jengibre molido, el pimentón dulce ahumado, el comino molido, la pimienta negra recién molida y la cúrcuma molida en un bol. Agregue las piezas de filete de cuello de cordero y entregue la mezcla para cubrir uniformemente.", "Caliente una sartén grande hasta que esté humeando, luego agregue una cucharada de aceite de oliva y dore las piezas del filete del cuello por todos lados durante 2-3 minutos, o hasta que se doren por todas partes. Retire las piezas de cordero de la sartén y reserve", "Agregue el aceite de oliva restante a la misma sartén y fría las cebollas y el ajo durante 2-3 minutos, o hasta que estén blandos. Agregue los trozos de cordero a la sartén y revuelva bien, luego agregue todos los ingredientes restantes del tajine excepto el cilantro y la sal y pimienta negra recién molida y cocine a fuego lento.", "Pica el cilantro, reserva las hojas para más adelante y agrega los tallos a la sartén. Reduzca el fuego, cubra la olla con una tapa y deje cocer a fuego lento durante una hora y 30 minutos, o hasta que el cordero esté tierno.", "Retire la tapa y cocine por otros 30 minutos, o hasta que la tagine esté ligeramente espesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el tabbouleh, coloca el trigo bulgar en una sartén con el caldo de pollo, lleva a ebullición y luego reduce el fuego a fuego lento. Cubra la olla con una tapa y cocine durante 15-20 minutos a fuego lento. Cuando el trigo bulgar es tierno, escurra el exceso de caldo.", "Retirar del fuego y dejar enfriar un poco, luego transferir el trigo bulgar a un recipiente. Agregue la cebolla roja, los pistachos, el jugo de limón, el aceite de oliva y las hierbas y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el tabbouleh entre cuatro platos para servir, luego coloque a cucharadas el tagine de filete de cuello de cordero al costado. Picar las hojas de cilantro reservadas y espolvorear sobre el tagine."], "url": "www_bbc_co_uk_food_recipes_lambneckfillettagine_91764", "title": "Tagine de cuello de cordero tagine con tabbouleh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero de 200g / 7oz, con guarnición de grasa y trozos gruesos", "½ cebolla roja pequeña, finamente picada", "puñado de menta fresca, picada", "sal y pimienta negra recién molida", "1 cucharada de harina normal", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva", "1 cebolla roja, cortada en anillos", "½ jarra de alcachofas marinadas, escurridas", "2 cucharadas de miel", "½ cucharadita de hojuelas de chile seco"], "method": ["Para el cordero, coloque la carne en un procesador de alimentos con la cebolla y la menta y sazone con sal y pimienta negra recién molida. Pulso para mezclar pero no sobre mezclar para pegar.", "Transfiera la mezcla de cordero a un recipiente y use la harina para unir y formar cuatro empanadas. Coloque en la nevera y enfríe mientras prepara las cebollas.", "Para las cebollas, caliente el aceite en una sartén pequeña y agregue las cebollas. Cocine suavemente por tres minutos. Agregue las alcachofas y continúe cocinando, cubierto por cinco minutos.", "Agregue las hojuelas de miel y chile y cocine destapado a fuego alto durante tres minutos.", "Mientras tanto, caliente el aceite del cordero en una sartén. Agregue el cordero y cocine por tres minutos en cada lado, o hasta que esté bien cocido.", "Para servir, coloque el cordero en un plato y cubra con las cebollas."], "url": "www_bbc_co_uk_food_recipes_lambpattieswithhoney_83929", "title": "Empanadas de cordero con miel y cebollas de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero deshuesada de 500g / 17½oz", "100g / 3½oz de ghee (mantequilla clarificada)", "4 palitos de canela, cada 4 cm (1¾in) de largo", "4 cardamomos negros", "200g / 7¼ oz de harina, aprox.", "50ml / 1¾fl oz de agua, o suficiente para unirse a una masa floja", "8 higos secos, empapados en agua, para cubrir", "3 cucharadas de khoya (leche deshidratada y seca), disponible en tiendas de comestibles étnicas", "1 cucharada de pasas, empapado en agua, para cubrir", "½ cucharadita de hilos de azafrán, empapados en 3 cucharadas de agua tibia", "150ml / 5¼fl oz de yogur natural", "3 cebollas, cortadas y fritas en aceite hasta que estén doradas", "4cm / 1¾ en trozo de jengibre fresco de raíz, pelado y rallado", "6 dientes de ajo", "2 cucharaditas de sal, o al gusto", "2 cucharaditas de chile rojo en polvo", "4 cucharaditas de sal masala", "2 cucharaditas de comino molido", "1 cucharadita de semillas de cardamomo recién molida", "1 cucharada de cilantro picado, para decorar", "pan naan, calentado", "Mazo para carne"], "method": ["Retire todas las membranas blancas de la superficie de la carne.", "Con un cuchillo afilado, corte la carne en cuadrados de 5 cm (2 pulgadas), de aproximadamente 1 cm (½ pulgada) de grosor.", "Coloque estos escalopes entre láminas de película adhesiva y golpéelos con un mazo de carne o rodillo hasta que el cordero haya sido aplanado en pedazos delgados.", "Incline todos los ingredientes del marinado en un procesador de alimentos y mezcle hasta que quede suave.", "Cubra los escalopes con el adobo, asegurándose de que la carne esté completamente cubierta con la mezcla de especias masala. Dejar de lado por lo menos una hora.", "Caliente la mantequilla clarificada en una cazuela de fondo grueso, lo suficientemente ancha como para tomar la carne en una capa.", "Agregue los palitos de canela y los cardamomos negros y déjelos chisporrotear por unos segundos antes de agregar la carne marinada con su líquido.", "Cubra la olla con una tapa hermética y selle los bordes con una pasta de harina y agua (esto ayuda a retener todos los sabores en la olla mientras la carne se cocina).", "Cocine a fuego lento durante una hora hasta que la salsa se haya reducido y la carne esté tierna.", "Retire la tapa de la sartén. Si hay demasiado líquido, cocine la salsa hasta que haya una fina capa de aceite encima.", "Esparza el cilantro picado y sirva enseguida con pan naan tibio."], "url": "www_bbc_co_uk_food_recipes_lambpasanda_74035", "title": "Largo favorito", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175ml / 6fl oz de jugo de piña", "4 cucharadas de vinagre de malta", "115 g / 4 oz de azúcar melaza", "sal y pimienta negra recién molida", "Filete de cordero con filete de cordero de 750 g / 1 lb 10 oz, con guarnición de grasa, cortado en cubos de 3 cm / 1¼ en cubitos", "2 pimientos rojos grandes, sin semillas, cortado en cuadrados de 3cm / 1¼", "2 pimientos verdes grandes, sin semillas, cortadas en cuadrados de 3cm / 1¼", "2 cebollas rojas, peladas, picadas en trozos de 3cm / 1¼in", "1 piña fresca, piel y núcleo retirados, carne cortada en cuartos, luego picada", "3 plátanos grandes (no demasiado maduros), pelados, picados", "aceite de girasol o maní, para cepillar", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida", "1 diente de ajo grande, aplastado hasta formar una pasta con el filo de un cuchillo", "1 lima, solo jugo", "290ml / 9¾fl oz de girasol o aceite de oliva ligero", "1 guindilla roja, semillas retiradas (medio reservadas), trituradas", "cilantro pequeño, solo hojas, finamente picado", "5-6 panes planos", "½ lechuga iceberg, rallada"], "method": ["Para el adobo, en un tazón de vidrio o cerámica, mezcle el jugo de piña, el vinagre, el azúcar de melaza y el condimento juntos hasta que estén suaves y bien combinados.", "Para los kebabs, enjuague el filete de cuello de cordero y seque con papel de cocina. Coloque el cordero en un vaso o plato de cerámica a prueba de horno y vierta más de la mitad de la mezcla de adobo. Cubra el plato y enfríe en el refrigerador por entre una y cuatro horas.", "Mientras tanto, para la lima, el chile y la mayonesa de cilantro, en un bol, mezcle bien las yemas de huevo, la mostaza, la sal y la pimienta negra recién molida, el ajo y la mitad del jugo de lima.", "Poco a poco agregue el aceite en una corriente delgada, batiendo continuamente, hasta que la mezcla se espese y todo el aceite se haya incorporado a la mezcla.", "Agregue el chile picado y las semillas de ají reservadas, cilantro picado y el jugo de lima restante. Mezcle hasta que esté bien combinado, luego enfríe en el refrigerador hasta que lo necesite.", "Remoje doce pinchos de madera en agua fría durante al menos 30 minutos, luego sacuda el exceso de humedad.", "Cuando la carne se ha marinado, ensarte trozos alternos de pimiento rojo y verde, cebolla, piña, plátano y cordero marinado en los pinchos empapados para hacer 10-12 pinchos. Deje 3-5 cm / 1/2 libre en un extremo de cada pincho con el que pueda agarrar los pinchos. Cepille los kebabs por todas partes con el aceite.", "Caliente una sartén a fuego alto. Cuando la sartén esté muy caliente, agregue los kebabs, en tandas si es necesario, y fría durante 8-10 minutos, hilvanando a intervalos con el adobo restante y volteándolo regularmente. (NB: Los kebabs también se pueden asar a la parilla oa la parrilla bajo una parrilla caliente mediana, si se desea).", "Para servir, rellenar los panes con la lechuga y la llovizna en un poco de la mayonesa de lima, chile y cilantro. Sandwich dos kebabs dentro de cada pan plano."], "url": "www_bbc_co_uk_food_recipes_lambpepperandpineapp_91704", "title": "Brochetas de cordero, pimiento y piña con mayonesa de lima, chile y cilantro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambpepperandpineapp_91704_16x9.jpg", "isVegetarian": false, "recommendations": 0}]