[{"isVegetarian": true, "title": "Parkin de jengibre al horno con ruibarbo, helado de vainilla y jarabe de especias calientes", "url": "www_bbc_co_uk_food_recipes_bakedgingerparkinwit_83900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["mantequilla, para engrasar", "110 g / 4 oz harina de auto aumento", "sal", "2 cucharadas de jengibre molido", "½ cucharadita de nuez moscada molida", "½ cucharadita de especias mixtas", "El nacimiento de su hijo", "Jarabe dorado de 175g / 6oz", "50g / 2 oz de melaza negra", "110g / 4oz de mantequilla sin sal", "110g / 4oz de azúcar morena suave", "1 huevo de gallina, batido", "2 cucharaditas de leche entera", "Jarabe dorado de 200g / 7oz", "2 cucharaditas de sidra seca", "½ cucharadita de especias mixtas molidas", "Ruibarbo 255 g / 9 oz, en longitudes de 1 cm / ¼ in", "3-4 cucharadas de azúcar en polvo, al gusto", "500ml / 1lb 2oz de helado de vainilla"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 140C / 275F / Gas 1.", "Engrase una lata de torta cuadrada de 20 cm / 8 pulgadas con mantequilla.", "Tamice la harina, una pizca de sal, el jengibre, la nuez moscada y las especias mezcladas en un tazón grande.", "Mezcle los copos de avena.", "Caliente las latas de jarabe y melaza en agua caliente para que sea más fácil medirlas con precisión.", "Coloque el jarabe, la melaza, la mantequilla y el azúcar moreno en una cacerola pequeña y derrita con un poco de calor, deje hervir a fuego lento pero no hierva.", "Revuelva en la mezcla de harina.", "Mezcle el huevo batido y la leche para crear una consistencia suave, casi vertida.", "Verter en la lata con mantequilla y hornear durante 1 ¼ horas, hasta que quede firme en el centro.", "Retirar del horno y dejar en la lata durante 5-10 minutos antes de girar y cortar en cuadrados.", "Para el jarabe con especias calientes, simplemente mezcle todos los ingredientes en una sartén pequeña y caliente, pero no hierva.", "Coloque el ruibarbo en una olla con un poco de agua y el azúcar.", "Deje que hierva a fuego lento y cocine hasta que esté tierno.", "Para servir, coloque una cucharada de ruibarbo en el centro del plato y cubra con una bola de helado.", "Coloque un pedazo de hierba en un lado y rocíe sobre el jarabe con especias."]}, {"isVegetarian": true, "title": "Queso de cabra al horno sobre pan tostado con tomates cherry y pasta de hierbas", "url": "www_bbc_co_uk_food_recipes_bakedgoatscheeseonto_88472", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 panes pitta integrales, divididos por la mitad", "Registro de queso de cabra de 100 g / 3½ oz, en rodajas", "8 tomates cherry rojos y amarillos mezclados, cortados por la mitad", "1 cucharada de vinagre balsámico", "1 cucharada de aceite de oliva", "puñado de perejil fresco", "gran puñado de albahaca fresca, más extra para decorar", "1 diente de ajo, aplastado", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el queso sobre pan tostado, extienda las mitades de pitta con el queso de cabra en rodajas y coloque los tomates cherry a la mitad en la parte superior. Rocíe el vinagre balsámico y el aceite de oliva y coloque en una bandeja para hornear. Hornee en el horno durante cinco minutos, o hasta que el queso comience a derretirse y se ponga dorado.", "Para la pasta de hierbas, coloque todos los ingredientes de la pasta de hierbas en un procesador de alimentos pequeño y procese hasta que quede suave.", "Sirva el queso sobre una tostada con la pasta de hierbas untada en la parte superior y espolvoréese con albahaca para adornar."]}, {"isVegetarian": true, "title": "Queso de cabra al horno con salsa de gazpacho y ensalada de col", "url": "www_bbc_co_uk_food_recipes_bakedgoatscheesewith_85300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tomates maduros, picados", "2 dientes de ajo picados", "pequeño puñado de cebollín fresco, picado", "1 cucharadita de vinagre de vino blanco", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "¼ camote, pelado y rallado", "½ cebolla roja, finamente rebanada", "1 zanahoria, pelada y rallada", "1 yema de huevo de gallinas camperas", "1 cucharadita de mostaza integral", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida", "1 tomate maduro, en rodajas", "1 cucharadita de aceite de oliva", "pequeño puñado de cebollín fresco, picado", "50g / 1¾oz queso de cabra firme, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa de gazpacho, coloque todos los ingredientes de gazpacho en un procesador de alimentos, sazone con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Para la ensalada de col, coloque la batata, la cebolla y la zanahoria en un tazón y mezcle bien.", "Para el aderezo, coloque los ingredientes del aderezo en un recipiente aparte, sazone con sal y pimienta negra recién molida y mezcle bien. Vierta el aderezo sobre la ensalada de col y mezcle bien.", "Para la ensalada de tomate, coloque las rodajas de tomate en un plato de servir, rocíe con aceite de oliva y esparza sobre el cebollino.", "Coloque el queso de cabra en una bandeja para hornear antiadherente y hornee en el horno durante 3-5 minutos, hasta que se ablanden.", "Para servir, coloque la ensalada de col en el plato con los tomates, cubra con el queso de cabra al horno y rocíe sobre la salsa de gazpacho."]}, {"isVegetarian": false, "title": "Gratinado de eglefino al horno", "url": "www_bbc_co_uk_food_recipes_bakedhaddockgratin_87125", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml / ¼ litro de leche", "½ cucharadita de pimienta de cayena", "30g / 1oz de mantequilla", "sal y pimienta negra recién molida", "¼ cabeza de brócoli, cortada en florecillas", "Filete de eglefino 150 g / 5½ oz", "Parmesano 55 g / 2 oz, rallado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una cacerola, caliente la leche, la pimienta de cayena y la mantequilla hasta que la mantequilla se haya derretido y la mezcla esté bien combinada. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue el brócoli y el pescado a la sartén y cocine a fuego lento durante cinco minutos, o hasta que esté casi cocido. Levante el brócoli y los pescados con una cuchara ranurada y colóquelos en un plato pequeño a prueba de horno.", "Ponga más de 2-3 cucharadas de la mezcla de leche y espolvoree sobre el queso rallado. Deseche la mezcla de leche restante.", "Hornee en el horno durante cinco minutos, o hasta que el queso se derrita y se dore. Sirve en el plato."]}, {"isVegetarian": false, "title": "Eglefino al horno con guisantes triturados y salsa de mantequilla de cebollino", "url": "www_bbc_co_uk_food_recipes_bakedhaddockwithcrus_80762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g / 5½ oz de abadejo ahumado sin teñir", "1 cucharada de aceite de oliva", "200ml / 7fl oz de caldo de pollo caliente", "1 diente de ajo", "Guisantes 150 g / 5½ oz", "Crema doble 50ml / 2fl oz", "50g / 2oz de mantequilla", "Crema doble 50ml / 2fl oz", "½ limón, solo jugo", "1 cucharadita de mostaza Dijon", "1 cucharada de cebollín, picado", "sal y pimienta negra recién molida", "perifollo, adornar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el eglefino en una bandeja para hornear y rocíe con el aceite. Hornee en el horno por 4 minutos o hasta que esté cocido.", "Para los guisantes, hierva el caldo de pollo con el diente de ajo durante 5 minutos, luego agregue los guisantes para cocinar.", "Agrega la crema. Usando una mini batidora de mano, licúe la pasta y la crema y reserve.", "Para la salsa, derrita la mantequilla en una sartén, luego agregue la crema, el jugo de limón y la mostaza. Cocine a fuego lento a fuego medio hasta que se reduzca a la mitad.", "Revuelva a través de las cebolletas y sazone con sal y pimienta negra recién molida.", "Para servir, coloca el eglefino en un plato con los guisantes a un lado. Rocíe la salsa sobre el pescado y adorne con el perifollo."]}, {"isVegetarian": false, "title": "Tomates herby al horno", "url": "www_bbc_co_uk_food_recipes_bakedherbytomatoes_72378", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g / 1lb de tomates grandes (maduros pero firmes)", "sal y pimienta negra recién molida", "1 chalote, finamente cortado en cubitos", "2 dientes de ajo, finamente picados", "1 cucharadita de hojas frescas de tomillo", "2 cucharadas de aceite de oliva virgen extra", "4 filetes de anchoa enlatados, finamente picados", "2 cucharadas de perejil fresco de flatleaf", "½ cucharadita de hojuelas de chile seco", "50g / 1¾oz de pan blanco fresco", "aceite de oliva virgen extra y vinagre balsámico, para adornar"], "serves": "Rinde 4", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Corta los tomates por la mitad horizontalmente y quita cuidadosamente las semillas. Espolvorea los lados cortados con sal y colócalos boca abajo sobre papel de cocina para eliminar el líquido. Deje reposar durante 20 minutos. Enjuague y seque con papel de cocina.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque la chalota en un procesador de alimentos con el ajo, las hojas de tomillo, aceite y anchoas y luego mezcle hasta obtener una pasta homogénea. Transfiera a un tazón y doble el perejil, los copos de chile y el pan rallado hasta que estén bien combinados. Sazone al gusto.", "Coloque la mezcla de pan en las cavidades del tomate y hornee por unos 15 minutos hasta que hierva y se dore. Transfiera a un plato y sirva caliente o a temperatura ambiente, rociado con aceite de oliva virgen extra y vinagre balsámico."]}, {"isVegetarian": false, "title": "Jamon cocido", "url": "www_bbc_co_uk_food_recipes_bakedham_2810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Junta gammon 4.5-5.5kg / 10-12lb - sin ahumar", "1 pinta de sidra seca", "2 zanahorias, cortadas en trozos gruesos", "2 cebollas, peladas y tachonadas con clavos de olor", "4 hojas de laurel", "2 dientes de ajo", "2 cucharadas de azúcar moreno", "12 granos de pimienta", "clavos para clavar", "8 cucharadas de mermelada de naranja sin triturar", "jugo de medio limón"], "serves": "Sirve aproximadamente 20", "time": {"preparation": "durante la noche", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Remojar la articulación gammon de la noche a la mañana.", "Drene y deseche el agua y seque el gammon. Coloque el jamón en una sartén grande y luego vierta sobre la sidra y suficiente agua para cubrir la articulación.", "Agregue todos los demás ingredientes a la sartén. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 3 - 3 ½ horas. Elimine cualquier espuma durante la cocción.", "Cuando esté cocido, retire el jamón de la sartén y colóquelo en una lata para asar. Deje que se enfríe un poco y luego despegue la piel.", "Precalentar el horno 190C / 375 F / Gas 5.", "Puntuación de formas de diamantes en la grasa y stud cada diamante con un clavo de olor.", "Caliente la mermelada y el jugo de limón en una sartén por unos minutos hasta que se espese hasta obtener un glaseado pegajoso. Cepille el glaseado de mermelada sobre la superficie del jamón.", "Hornee en el horno durante 30 minutos hasta que el glaseado se haya solidificado."]}, {"isVegetarian": true, "title": "Tarta de queso de lima al horno", "url": "www_bbc_co_uk_food_recipes_bakedlimecheesecake_90177", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedlimecheesecake_90177_16x9.jpg", "ingredients": ["10 galletas digestivas grandes", "6 galletas de jengibre", "85g / 3oz de mantequilla", "675g / 1½lb de queso crema", "Crema doble de 150 ml / 1/4 de pinta", "Azúcar en polvo 140g / 5oz", "3 huevos grandes de gallinas camperas", "3 limas, solo cáscara", "½ piña", "4 maracuyá", "Crema doble de 300 ml / ½ pinta", "azúcar glas, al gusto, más extra para quitar el polvo"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 150 ° C / 300 ° F / Gas 2. Rompe los bizcochos digestivos y las galletas de jengibre y colócalos en el tazón de un procesador de alimentos.", "Coloque la mantequilla en una sartén de base pesada y derrita suavemente.", "Procese las galletas en el procesador de alimentos, hasta que la mezcla tenga la consistencia de pan rallado fino.", "Alinee la base de una lata de torta con forma de resorte suelta de 24cm / 9in-10in con una ronda de papel antigrasa. Cepille la parte inferior de la lata con un poco de la mantequilla derretida y coloque la ronda de papel resistente a la grasa en la base.", "Agregue la mantequilla derretida restante a las migas de galletas en el procesador de alimentos y vuelva a procesarlas brevemente.", "Incline las migas en el fondo de la lata de la torta. Usando la parte posterior de una cuchara, empuje suavemente las migajas desde el centro hacia afuera, hasta que estén suaves y niveladas. Esto formará la base de la tarta de queso.", "Hornee la base de la tarta de queso en el horno durante 10 a 15 minutos hasta que esté ligeramente dorada y recién colocada. Retire del horno y deje enfriar durante al menos cinco minutos.", "Mientras tanto, haz el relleno. Coloque el queso crema, la crema, el azúcar y los huevos en un tazón grande. Usando un rallador, ralle en la cáscara de las limas. Con un batidor eléctrico, bata a baja velocidad, hasta que quede suave.", "Cuidadosamente vierta el relleno sobre la base enfriada. Si prepara la tarta de queso con anticipación, puede prepararla para esta etapa, luego enfriar en el refrigerador y hornear al día siguiente (lo que le permite alcanzar la temperatura ambiente por primera vez).", "Regrese la tarta de queso al horno y hornee durante aproximadamente una hora, o hasta que esté listo. Deje que se enfríe completamente, luego colóquelo en el refrigerador y déjelo enfriar durante aproximadamente una hora.", "Retire con cuidado la tarta de queso de la lata y colóquela en un plato para servir, utilizando una espátula para aflojar la base de la torta del fondo de la lata.", "Para el relleno, use un cuchillo afilado de sierra para quitar la parte superior e inferior de la piña. Corta la dura piel exterior de la piña y corta por la mitad a lo largo. Con una mandolina, corta la mitad de la piña (asegúrate de usar el protector para los dedos si la mandolina tiene uno). Reserve la otra mitad para usar en otro plato. Coloque las rodajas de piña en un recipiente.", "Corte la fruta de la pasión por la mitad y saque la pulpa con una cucharadita. Agregue al tazón con la piña y mezcle bien.", "Batir la crema en un tazón limpio con un batidor de mano. Cuando se forman picos suaves, agregue azúcar glas, al gusto, y bata suavemente hasta que estén bien mezclados.", "Para servir, extender la crema endulzada sobre la superficie de la tarta de queso y apilar la fruta fresca. Vierta sobre el jugo de maracuyá del tazón. Polvo con azúcar glas y servir en rebanadas generosas."]}, {"isVegetarian": true, "title": "Macarrones al horno", "url": "www_bbc_co_uk_food_recipes_bakedmacaroni_88896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litro / 1 pinta 15 fl oz de leche entera", "2 hojas de laurel", "40 g / 1½ oz de mantequilla, sin sal", "Harina normal de 50g / 2oz", "Queso gruyere 250 g / 9 oz, rallado", "1 cucharadita de mostaza inglesa", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "4 chalotes, en rodajas", "Macarrones 400 g / 14 oz, cocidos de acuerdo con las instrucciones del paquete", "20 tomates cherry, cortados a la mitad", "12 tomates tomados por el sol", "salpicar leche", "2 cucharadas de parmesano recién rallado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa, coloque la leche y las hojas de laurel en una sartén a fuego medio. Caliente hasta el punto de escaldado y luego retírelo del fuego.", "Mientras tanto, en una sartén limpia a fuego medio, derrita la mantequilla. Agregue la harina y cocínela durante 3-4 minutos (no deje que la mezcla se ponga marrón).", "Retire las hojas de laurel de la mezcla de leche.", "Agregue un poco de leche caliente a la mezcla de harina y mantequilla y revuelva para combinar. Continúe calentando y revuelva, agregando gradualmente más leche, hasta que se forme una salsa suave.", "Agregue la leche restante y deje hervir, revolviendo todo el tiempo. Reduzca el fuego y cocine a fuego lento durante 3-4 minutos.", "Quite el fuego y agregue el queso, la mostaza y la sal y pimienta negra recién molida.", "Para la pasta, derrita la mantequilla en una sartén grande a fuego medio. Agregue los chalotes y cocine por 2-3 minutos, luego agregue los macarrones cocidos y los tomates cherry, y la salsa de queso preparada previamente. (Es posible que deba agregar un poco de leche adicional para aflojar la salsa de queso). La salsa debe cubrir, pero no ahogar los macarrones.", "Divida el queso de macarrones de manera uniforme entre cuatro tazones de fuente de horno y cubra con parmesano rallado. Coloque en el horno para hornear durante 8-10 minutos.", "Precalentar la parrilla a su configuración más alta.", "Retire los tazones de queso de macarrones individuales del horno y colóquelos debajo de la parrilla hasta que el relleno de queso esté burbujeante y dorado.", "Servir en la mesa en los tazones de cocina. ¡Ten cuidado, los cuencos estarán muy calientes!"]}, {"isVegetarian": false, "title": "Macarrones al horno con albóndigas", "url": "www_bbc_co_uk_food_recipes_bakedmacaronimeatbal_84603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litro / 1 pinta 15 fl oz de leche entera", "2 hojas de laurel", "40 g / 1½ oz de mantequilla sin sal", "Harina normal de 50g / 2oz", "250g / 10½oz de queso cheddar maduro o gruyere, rallado", "1 cucharadita de mostaza inglesa", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "1 cucharadita de orégano seco", "250 g / 10½oz de carne de caña picada", "1 cucharada de aceite de oliva", "4 chalotes, en rodajas", "Macarrones 400 g / 14 oz, cocidos de acuerdo con las instrucciones del paquete", "20 tomates cherry, cortados a la mitad", "12 tomates tomados por el sol", "1 cucharadita de orégano seco", "2-3 cucharadas de leche, si es necesario", "2 cucharadas de queso parmesano rallado"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa de queso, coloque la leche y las hojas de laurel en una sartén y coloque a fuego medio. Caliente la leche hasta el punto de escaldar (no hierva) y luego retírela del fuego. Déjalo infundir.", "En una cacerola limpia, derrita la mantequilla a fuego medio, luego mezcle la harina y cocine durante tres minutos. Tenga cuidado de no dejar que la mezcla se ponga marrón.", "Retire las hojas de laurel de la mezcla de leche y agregue un poco de leche a la mezcla de harina y mantequilla. Revuelva para combinar la leche y la pasta de harina a fuego lento, luego repita el proceso, agregue gradualmente leche y revuelva hasta que se forme una pasta homogénea.", "Agregue el resto de la leche y hierva, revuelva todo el tiempo, luego reduzca el fuego y cocine a fuego lento durante tres minutos.", "Retire la sartén del fuego y agregue el queso, la mostaza y la sazón, al gusto, con sal y pimienta negra recién molida.", "Para las albóndigas, caliente una cucharada de aceite en una cacerola a fuego medio. Agregue la cebolla, el ajo y el orégano y fría hasta que se ablanden, luego retire del fuego y deje enfriar.", "Coloque la mezcla de cebolla en un recipiente y agregue la carne picada. Sazonar bien con sal y pimienta negra recién molida, y mezclar para combinar.", "Enrolle la mezcla de carne picada en pequeñas albóndigas de 2.5cm / 1 in.", "Caliente la cucharada restante de aceite en una sartén limpia a fuego medio. Agregue las albóndigas y fría, volteándolas de vez en cuando, hasta que estén doradas por completo y completamente cocidas.", "Para la pasta, caliente el aceite en una sartén grande. Agregue las chalotas y fría por dos minutos para ablandar, luego agregue la pasta cocida y revuelva bien.", "Agregue los tomates y el orégano y cocine por 2-3 minutos, luego agregue las albóndigas y la salsa de queso. (Puede que necesite agregar un poco de leche para aflojar la salsa de queso). La salsa debe cubrir, no mojar, los macarrones.", "Transfiera los macarrones y las albóndigas a un plato grande a prueba de horno o en moldes de 10 cm / 4 pulg. Cubra con parmesano y colóquelo en el horno para hornear por 15 minutos si usa un plato grande, 7-8 minutos si usa los moldes.", "Precaliente la parrilla a su nivel más alto y coloque el plato o los moldes debajo de la parrilla para derretir y dorar el queso antes de servir."]}, {"isVegetarian": true, "title": "Mango al horno", "url": "www_bbc_co_uk_food_recipes_bakedmango_89128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, piedra eliminada", "1 pizca de hojuelas de chile", "½ lima, solo jugo", "2 cucharadas de miel"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Marca la carne del mango en un patrón entrecruzado con la punta de un cuchillo afilado. Voltea el mango hacia adentro para formar una forma de 'erizo'.", "Coloque el mango en una bandeja para hornear y esparza sobre los copos de chile, exprima el jugo de lima y rocíe sobre la miel. Hornee durante cinco minutos, o hasta que el mango esté ligeramente caramelizado.", "Transfiera el mango a un plato de servir y sirva inmediatamente."]}, {"isVegetarian": true, "title": "Mango al horno con jarabe de jengibre", "url": "www_bbc_co_uk_food_recipes_bakedmangowithginger_84495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, piel en", "1 lima, solo jugo", "3 cucharadas de azúcar en polvo", "1 guindilla roja, picada", "Jengibre de raíz 25g / 1oz, picado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta el mango por la mitad. Con un cuchillo puntúa un patrón de rejilla en el mango, pero sin perforar la piel. Voltea el mango hacia dentro para hacer una forma de erizo. Coloque el mango en una bandeja para hornear y rocíe con el jugo de limón.", "Coloque en el horno para hornear durante ocho minutos.", "Coloque el azúcar, el chile y el jengibre en una cacerola pequeña a fuego medio y cocine hasta que el azúcar se haya disuelto y la salsa se vuelva pegajosa.", "Para servir, transfiera el mango a un plato de servir y rocíe con la salsa de chile pegajoso."]}, {"isVegetarian": false, "title": "Seta horneada rarebit con chutney de manzana y tomate", "url": "www_bbc_co_uk_food_recipes_bakedmushroomrarebit_83846", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 hongos de campo grandes, tallos eliminados", "225g / 8oz de queso Stilton, empanizado", "Queso Cheddar 110 g / 4 oz, rallado", "50ml / 2fl de leche en oz", "25 g / 1 oz de harina", "Pan rallado de 25 g / 1 oz", "pizca de salsa Worcestershire", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "½ cucharadita de mostaza en polvo inglesa", "sal y pimienta blanca", "2 cucharadas de aceite de oliva", "pan de chapata, en rodajas y tostado", "225g / 8oz de azúcar morena Demerara", "Sultanas 110 g / 4oz", "275ml / 10floz de vinagre de malta", "10g / ½ oz de jengibre fresco, finamente picado", "2 chiles rojos, finamente picados", "1kg / 2lb 2oz de tomates maduros, toscamente picados", "500 g / 1 lb 2 oz manzanas, peladas y picadas", "Chalotes de 200g / 7oz, cortados aproximadamente", "1 cucharada de romero fresco, aproximadamente picado", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la rarebit, coloque el queso y la leche en una cacerola y caliente hasta que el queso se derrita, revolviendo ocasionalmente para evitar que se enganche.", "Agregue las migas de pan y la harina y cocine por 2-3 minutos, revolviendo todo el tiempo para evitar grumos.", "Retirar del fuego y dejar enfriar, luego agregar la salsa Worcestershire, los huevos y el polvo de mostaza. Mezcle bien y sazone, al gusto, con sal y pimienta blanca.", "Coloque los champiñones en una bandeja para hornear. Con una cuchara, mezcla la rareza sobre los champiñones.", "Rocíe un poco de aceite de oliva y coloque en el horno para hornear durante 10-15 minutos, o hasta que los champiñones son suaves y la rarebit es burbujeante y dorado.", "Para la salsa picante, coloque el azúcar, pasas y la mitad del vinagre en una cacerola a fuego alto y derretir a un caramelo pegajoso.", "Agregue el resto de los ingredientes excepto el romero y deje que hierva.", "Agregue el romero y reduzca el fuego a fuego lento durante 30-40 minutos, teniendo cuidado de no quemar la base. Dejar enfriar, luego sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque las rebanadas de chapata tostada en platos. Coloque los champiñones en las ciabattas con algunos de los jugos de hongos vertidos. Coloque una cucharada de chutney al lado."]}, {"isVegetarian": true, "title": "Sopa de cebolla al horno con queso gruyere y madeira", "url": "www_bbc_co_uk_food_recipes_bakedonionsoupwithgr_74620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg / 3lb 5 oz cebollas marrones, en rodajas", "85g / 3oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "1 cucharadita de hojas de tomillo", "2 hojas de laurel", "1 cucharadita de sal", "2 cucharaditas de azúcar en polvo", "Harina normal de 25g / 10z", "1 botella de vino blanco seco", "2 litros / 3 pintas 10½ fl oz de pollo o verdura", "Queso gruyere 175g / 6oz, rallado", "12 x 2cm / ¾ en rebanadas de pan francés, tostado en ambos lados", "1 diente de ajo", "3 yemas de huevo", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de brandy", "4 cucharadas de madeira"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque la cebolla, la mantequilla, el aceite, el tomillo, las hojas de laurel, la sal y el azúcar en una cacerola de base pesada y cocine a fuego medio durante 40 minutos, revolviendo de vez en cuando. Las cebollas deben ser doradas y suaves.", "Agregue la harina y cocine a fuego lento por otros 10 minutos.", "Vierta el vino, revuelva para combinar y cocine durante 10 minutos.", "Agregue el caldo y cocine a fuego medio por otros 20 minutos. La sopa puede prepararse hasta 48 horas antes de este punto.", "Esparza un poco de queso (no lo use todo) sobre el fondo de una sopera grande a prueba de horno o 6-8 recipientes para sopa a prueba de horno colocados en una bandeja para hornear.", "Vierta la sopa. Frote las rebanadas de pan tostado con el diente de ajo y flote en la parte superior de la sopa.", "Cubra con el queso restante y colóquelo en el horno hasta que esté burbujeante y dorado, a unos 20 minutos del calor o 40 minutos del frío.", "Batir las yemas de huevo, crema, brandy y Madeira. Cuando la sopa esté lista para servir, levante la costra cursi y vierta la mezcla de crema en la sopa, o sirva en una jarra y ofrézcala por separado a sus invitados."]}, {"isVegetarian": true, "title": "Papaya al horno con azúcar de lima y yogur", "url": "www_bbc_co_uk_food_recipes_bakedpapayawithlimes_89053", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 papaya, partida en dos, sin semillas", "30g / 1oz de mantequilla", "1 lima, solo jugo", "1 cucharada de azúcar morena suave", "1 limón, cortado en cuñas", "Yogur de estilo griego, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la papaya en una bandeja pequeña para hornear, con el lado cortado hacia arriba.", "Derrita la mitad de la mantequilla en una cacerola pequeña y agregue el jugo de lima y el azúcar, revolviendo hasta que el azúcar se haya disuelto. Vierta la mezcla sobre la papaya, agregue las rodajas de limón a la bandeja y luego coloque en el horno y hornee durante 6-8 minutos, o hasta que la papaya esté tierna. Retire la papaya del horno y transfierala a un plato para servir junto con las rodajas de limón tostadas.", "Coloque la bandeja de hornear a fuego medio, agregue un chorrito de agua y el resto de la mantequilla y revuelva hasta que se derrita. Rocíe la mezcla sobre la papaya y sirva con una cucharada de yogurt al estilo griego."]}, {"isVegetarian": true, "title": "Parkin al horno con ruibarbo asado", "url": "www_bbc_co_uk_food_recipes_bakedparkinwithroast_86400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina de auto crianza de 170g / 6oz", "pizca de sal", "2 cucharadas de jengibre molido", "1 cucharadita de nuez moscada recién rallada", "1 cucharadita de especias mixtas molidas", "Copos de avena de 120g / 5oz", "250ml / 8fl oz de jarabe dorado", "75ml / 2fl oz de melaza negra", "150 g / 6oz de mantequilla sin sal, más extra para engrasar", "150g / 6oz de azúcar morena oscura", "2 huevos medianos de granja, golpeados", "25 ml / 1 fl oz de leche", "4 barras de ruibarbo fresco, cortadas en longitudes de 5cm / 2in", "azúcar al gusto", "salpicar agua", "200 ml / 7 fl oz de jarabe de oro", "100ml / 3½fl oz de jugo de manzana", "1 cucharadita de especias mixtas molidas", "helado de vainilla", "ramitas de menta fresca"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 140 ° C / 275 ° F / Gas 1. Engrase un molde para pastel de 20 x 30 cm / 8 x 12 pulgadas y alinee con papel resistente a la grasa.", "Tamiza la harina, la sal, el jengibre, la nuez moscada y la mezcla de especias en un tazón grande. Mezcle en la avena.", "Coloque el jarabe dorado, la melaza, la mantequilla y el azúcar en una olla pequeña y caliéntelo suavemente hasta que se derrita y se combine bien. Revuelva esta mezcla en el recipiente con los ingredientes secos.", "Agregue el huevo batido y la leche al tazón y mezcle para obtener una consistencia suave, casi vertida. Vierta la mezcla en la lata de la torta.", "Transfiera al horno y hornee durante 1-1¼ horas, o hasta que esté firme en el centro. Retire del horno y deje en la lata durante 5-10 minutos antes de apagar.", "Mientras tanto, para el ruibarbo asado, coloque las piezas de ruibarbo en una bandeja para hornear y espolvoree con azúcar, a gusto, y un chorrito de agua. Transfiera al horno y tueste por 10-15 minutos, hasta que se ablanden.", "Para el jarabe, coloque todos los ingredientes de jarabe en una sartén pequeña y mezcle a fuego lento hasta que estén bien combinados.", "Para servir, corte el parkin caliente en trozos, cubra con el ruibarbo y rocíe sobre el almíbar. Sirva con una bola de helado y una ramita de menta para adornar."]}, {"isVegetarian": false, "title": "Conchas de pasta al horno rellenas de queso", "url": "www_bbc_co_uk_food_recipes_bakedpastashellsfill_70348", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedpastashellsfill_70348_16x9.jpg", "ingredients": ["16 conchiglioni rigati (conchas de pasta grande)", "1 cantidad de salsa de tomate (ver a continuación)", "3 cucharadas de queso parmesano recién rallado", "1 bola de mozzarella, rebanada", "150g / 5oz de ricotta", "1 bola de queso mozzarella, muy finamente picada", "2 cucharadas de parmesano recién rallado", "16 hojas grandes de albahaca fresca", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "2 x 400 g de latas de tomates ciruela, picados", "puñado de albahaca fresca, finamente picada", "sal y pimienta negra recién molida"], "serves": "4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Hacer la pasta Precaliente el horno a 200C / 400F / Gas 6. Cocine las cáscaras de pasta en abundante agua hirviendo ligeramente salada hasta que estén al dente. Drene bien (asegúrese de vaciar las conchas de agua) y deje enfriar.", "Para hacer el relleno, machaque la ricota con un tenedor, mezcle la mozzarella en cubitos, el parmesano y un poco de sal y pimienta al gusto y mezcle bien. Forme la mezcla en 16 bolas, envuelva cada bola en una hoja de albahaca y coloque en una cáscara de pasta enfriada.", "Hacer la salsa Caliente el aceite de oliva en una sartén grande, agregue el ajo y el sudor hasta que se ablanden. A continuación, agregue los tomates y la albahaca, sazone con sal y pimienta y cocine a fuego lento durante 25 minutos.", "Vierta una capa de salsa de tomate sobre el fondo de un plato resistente al horno y coloque las conchas rellenas en la parte superior. Verter sobre la salsa de tomate restante, espolvorear sobre el parmesano y cubrir con rodajas de mozzarella. Cubra con papel de aluminio y hornee durante 35 minutos. Retire la lámina y hornee al descubierto durante cinco minutos. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Pera al horno", "url": "www_bbc_co_uk_food_recipes_bakedpear_79255", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de salsa de arándanos de un tarro", "1 cucharada de crema doble", "1 pera, pelada y sin corazón", "55g / 2oz Stilton"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Rellene la pera con el Stilton y coloque en una bandeja para hornear. Coloque en el horno y hornee durante 8-10 minutos, o hasta que el Stilton se haya derretido.", "Coloque la salsa de arándano y la crema en una sartén pequeña a fuego lento durante 2-3 minutos.", "Para servir, coloque la pera horneada en un plato para servir y vierta la salsa de arándanos."]}, {"isVegetarian": true, "title": "Melocotones al horno con amaretti triturado", "url": "www_bbc_co_uk_food_recipes_bakedpeacheswithcrus_82371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g / 2oz de mantequilla", "12 galletas amaretti, aplastadas", "2 cucharadas de miel, más extra para lloviznar", "buen dash vin santo, o vino de postre dulce similar, más extra para lloviznar", "4 melocotones, cortados a la mitad y piedras quitadas", "azúcar demerara, para rociar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derrita la mantequilla en una cacerola, pero no la deje dorar.", "Mezcle las galletas amaretti trituradas, la mantequilla derretida, la miel y una pizca de vin santo en un tazón.", "Coloque una cucharadita colmada de la mezcla sobre el lado plano de cada una de las mitades de melocotón y colóquela en una bandeja para hornear.", "Espolvorear con azúcar demerara y rociar con más miel y vin santo.", "Hornee en el horno por 15-30 minutos hasta que estén dorados. Servir."]}, {"isVegetarian": false, "title": "Salchicha y pasta de ricotta hornear", "url": "www_bbc_co_uk_food_recipes_bakedpennewithricott_91319", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedpennewithricott_91319_16x9.jpg", "ingredients": ["2 cucharaditas de aceite vegetal", "2 cebollas rojas, peladas, en rodajas", "1 chile rojo, finamente picado", "2 dientes de ajo, en rodajas", "Salchichas de hierbas de buena calidad de 200g / 7oz, a la parrilla hasta que estén totalmente cocidas, enfriadas, rebanadas gruesas", "Penne 350g / 12oz, cocido de acuerdo con las instrucciones del paquete, escurrido", "200g / 7oz de ricotta", "2 tomates maduros, finamente picados", "Virutas de parmesano 100 g / 3½ oz, más extra para servir", "1 cucharada de perejil fresco picado", "1 baguette de ajo listo, en rodajas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite en una sartén a fuego medio. Agregue las cebollas, el chile y el ajo y fría por 3-4 minutos, o hasta que estén blandos.", "Agregue las salchichas cocidas y en rodajas, la pasta cocida, la ricotta y los tomates picados y revuelva bien para combinar.", "Transfiera la mezcla a un plato resistente al horno y espolvoree sobre las virutas de queso parmesano. Hornee en el horno durante 10-12 minutos, o hasta que el queso se haya derretido y esté dorado.", "Para servir, divida el penne horneado entre cuatro platos para servir. Espolvorea sobre las virutas restantes de parmesano y el perejil picado. Coloque 1-2 rebanadas de pan de ajo al lado de cada porción."]}]