[{"isVegetarian": false, "title": "Mexican tortilla bake", "url": "www_bbc_co_uk_food_recipes_mexican_tortilla_bake_28158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexican_tortilla_bake_28158_16x9.jpg", "ingredients": ["1 tbsp olive oil", "2 large onions, chopped", "500g/1lb 2oz beef mince", "1 mild red chilli, deseeded and finely chopped", "1 red pepper, deseeded and diced", "2 garlic cloves, crushed", "1 tbsp ground cumin", "1 tbsp ground coriander", "2 tbsp tomato purée", "1–2 tbsp mango chutney", "2 x 400g tins chopped tomatoes", "1 small bunch fresh coriander, chopped", "salt and freshly ground black pepper", "3 large tortilla wraps\t \t", "250g/9oz full-fat mascarpone", "100g/3½oz mozzarella, grated", "100g/3½oz cheddar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Pour the oil into a large ovenproof frying pan over a medium heat, add the onions and fry for 3 minutes. Turn up the heat, add the mince and fry until brown, breaking the meat up with a wooden spoon and stirring occasionally.", "Add the chilli, red pepper, garlic and spices and fry for 5 minutes, or until all the moisture has evaporated and the mixture is quite dry. Stir in the tomato purée, mango chutney, tinned tomatoes and salt and black pepper. Cover with a lid, bring to the boil and transfer to the oven to simmer for an hour.", "Remove from the oven and stir in half the coriander. Increase the oven temperature to 200C/180C Fan/Gas 6.", "Spread a third of the cooked mince beef mixture over the bottom of the ovenproof dish and lay one tortilla wrap on top. Spread a third of the mascarpone (see tip) over the tortilla and sprinkle with a third of each of the mozzarella and Cheddar cheeses. Repeat twice more so you have 3 layers.", "Bake in the oven for about 25 minutes until golden-brown and bubbling. Set aside for 5 minutes before serving and garnish with the remaining coriander."]}, {"isVegetarian": false, "title": "Mexican chilli lamb with sweet and sour leeks", "url": "www_bbc_co_uk_food_recipes_mexicanchillilambwit_76865", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz lamb neck fillet, sliced", "½ romero pepper, sliced", "1 clove garlic, sliced", "1 tsp chilli flakes", "1 tsp ground coriander", "100ml/3½fl oz vegetable stock", "1 tsp Tabasco sauce", "2 tbsp of butter ", "3 tbsp brown sugar", "1 packet of baby leeks", "1 tbsp red wine vinegar", "25g/1oz dark chocolate, grated", "3 tbsp Greek yoghurt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spiced lamb, sear the slices of lamb in a hot frying pan until lightly browned on both sides. Add the pepper and garlic and cook for 3-4 minutes. ", "Add the chilli flakes and ground coriander and stir. Pour in the vegetable stock and simmer for 10 minutes.", "For the sweet and sour leeks, melt the butter and brown sugar together in a pan until a caramel forms.", "Add the baby leeks and cook for 3-4 minutes, or until soft. Add the red wine vinegar and cook for a further minute.", "To serve, place the lamb on a warm plate and serve the leeks on the side. Top with the grated chocolate and Greek yoghurt."]}, {"isVegetarian": false, "title": "Mexican fish tortillas", "url": "www_bbc_co_uk_food_recipes_mexicanfishtortillas_73223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1½lb haddock fillet", "¼ tsp black peppercorns", "½ tsp cumin seeds", "½ tsp coriander seeds", "½ tsp dried oregano", "½ tsp turmeric", "½ tsp paprika", "¼ tsp cayenne pepper", "3 cloves garlic, chopped", "1 Seville orange, juice only and 1 lime", "or", "1 lime, juice only and ½ grapefruit", "or", "1 lime, juice only and 1 Seville orange", "½ tsp salt", "450g/1lb ripe tomatoes, deseeded and finely diced", "½ red onion, finely chopped", "1 clove garlic, very finely chopped", "2 green chillis, deseeded and finely chopped", "½ Seville orange, juice only or ½ grapefruit", "1 tsp sugar", "4 tbsp chopped fresh coriander", "salt", "freshly ground black pepper", "soft flour tortillas", "150ml/¼ pint soured cream (optional)", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Divide the haddock into four portions. ", "To make the marinade, dry fry the peppercorns, cumin and coriander seeds over a moderate heat until they turn a shade darker and give off an aroma.  ", "Tip into a bowl and cool slightly.  Grind with the oregano, turmeric, paprika and cayenne.  ", "In a mortar, mash the garlic to a paste with the salt, and gradually work in the spices and the citrus juices. ", "Smear this mixture over the haddock, then tip over any left in the mortar. ", "Leave to marinate for at least one hour and up to four hours.  ", "To make the salsa, mix all the ingredients together, then taste and adjust seasonings.  Chill in the fridge until needed.  ", "Pre-heat a grill or barbecue.  ", "Wrap the tortillas in foil and warm through in the oven, or on the edge of the barbecue.  ", "Grill the fish, turning carefully once, until just cooked through.  You can either lay each piece of fish on a warm tortilla, top with a good dollop of salsa, and a spoonful of sour cream, then hand out to your guests. Alternatively (and your friends or family may well prefer the DIY approach) pass the fish, tortillas, salsa, cream and lime wedges around so that everyone can put together their own Yucatan fish tortilla."]}, {"isVegetarian": true, "title": "Mexican soup", "url": "www_bbc_co_uk_food_recipes_mexicansoup_75676", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["pinch cumin seeds", "pinch dried chilli", "1 tbsp olive oil", "½ tin of cherry tomatoes", "200g/7oz mixed beans", "¼ chilli chopped", "pinch sugar", "squeeze lemon juice", "splash of water", "Greek-style yoghurt", "handful coriander ", "½ avocado, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a pestle and mortar, grind the spices.", "Heat the oil in a pan and cook out the spices for 1-2 minutes.", "Add the tomatoes, beans, chilli, sugar, lemon juice and a splash of water and simmer gently for 5-8 minutes.", "Pour into a bowl and top with yoghurt, coriander and avocado."]}, {"isVegetarian": false, "title": "Mexican steak burrito", "url": "www_bbc_co_uk_food_recipes_mexicansteakburrito_86980", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexicansteakburrito_86980_16x9.jpg", "ingredients": ["2 small ripe avocados, peeled, stones removed", "1 garlic clove, peeled and finely chopped", "½ small onion, peeled and finely chopped", "1 small red chilli, seeds removed, finely chopped", "1 lime, juice only", "salt and freshly ground black pepper", "2 medium ripe tomatoes, chopped", "½ onion, peeled and finely chopped", "small handful fresh coriander, chopped", "2 tbsp vegetable oil (or 40g/1½oz lard)", "1 small onion, peeled and finely chopped", "350g/12oz rump steak, chopped ", "1 garlic clove, peeled and finely chopped", "½ red or green chilli, seeds removed, finely chopped", "dash Worcestershire sauce", "dash Tabasco sauce", "pinch cayenne pepper", "small handful fresh coriander, chopped", "2 ready-made soft flour tortillas, warmed briefly in a hot dry pan", "1 Little Gem lettuce, finely sliced", "100g/3½oz rice, cooked according to packet instructions and drained", "75g/2½oz cheddar cheese, grated", "100ml/3½fl oz soured cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the guacamole, place the avocados in a bowl with the garlic, onion and chilli and mash together roughly with a fork.", "Stir in the lime juice and season to taste with salt and freshly ground black pepper. Set aside.", "For the tomato salsa, mix the tomatoes, onion and coriander in a bowl. Set aside.", "For the steak filling, heat the oil or lard in a pan and fry the onion for 1-2 minutes until softened but not browned.", "Add the steak pieces to the pan with the garlic and chilli and stir fry for one minute.", "Add a pinch of cayenne pepper and a dash of Worcestershire sauce and Tabasco sauce and cook for another minute, or until cooked to your liking, then remove from the heat.", "To assemble the burrito, place the warmed tortillas on serving plates and divide the steak between them. Top with salsa and lettuce and fold to enclose the filling. ", "Serve the burrito with rice, grated cheese, soured cream and a spoonful of the guacamole."]}, {"isVegetarian": false, "title": "Mexican-style fried chicken", "url": "www_bbc_co_uk_food_recipes_mexicanstylefriedchi_85656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz tequila", "3 limes, juice only", "1 red chilli, chopped", "1 x 330ml/12fl oz bottle Mexican beer", "1 garlic clove, chopped", "8 chicken legs", "flour, seasoned with salt and freshly ground black pepper", "vegetable oil, to deep fry", "2 ripe avocados, chopped", "2 plum tomatoes, peeled, seeds removed, chopped", "1 bird's eye chilli, seeds removed, chopped", "1 tbsp chopped fresh coriander stems", "½ tsp chilli powder", "1 lime, juice only", "1 red onion, finely chopped", "1 red chilli, finely chopped", "2 limes, juice only", "2 tomatoes, chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken; mix the tequila, lime, chilli, beer and garlic together in a large bowl.", "Score the chicken legs with a sharp knife and place into the marinade. Mix well to coat the chicken in the marinade, then transfer to the fridge to marinate for two hours.", "Heat the oil in a deep, heavy-bottomed pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Remove the chicken from the marinade and pat dry.", "Dredge the chicken legs in the seasoned flour, then carefully place into the hot oil and deep-fry for 15 minutes, or until golden-brown and completely cooked through.", "Carefully remove the chicken legs from the oil with a slotted spoon and drain on kitchen paper.", "For the guacamole, place all of the guacamole ingredients into a clean bowl and mix together well.", "For the pico de gallo, place all of the pico de gallo ingredients into a clean bowl and mix together well.", "To serve, place the chicken legs into a big bowl with the bowls of guacamole and pico de gallo alongside."]}, {"isVegetarian": true, "title": "Mexican sweetcorn pancakes, poached eggs and salsa", "url": "www_bbc_co_uk_food_recipes_mexicansweetcornpanc_89498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexicansweetcornpanc_89498_16x9.jpg", "ingredients": ["100g/3½oz plain flour", "1 tsp baking powder", "1 free-range egg", "150ml/5fl oz whole milk", "salt and freshly ground black pepper", "1 sweetcorn on the cob, kernels only", "1 tbsp vegetable oil ", "3 tomatoes, skin and seeds removed, chopped", "6 coriander sprigs, leaves only, chopped", "1 green chilli, very finely chopped ", "pinch sugar", "¼ small red onion, finely chopped ", "1 lime, juice only", "pinch sea salt", "freshly ground black pepper", "1 tbsp white wine vinegar", "4 free-range eggs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweetcorn pancakes, sieve the flour and baking powder into a mixing bowl, then whisk in the egg and half of the milk to form a thick batter with a consistency slightly thicker than double cream. Add more milk as necessary to loosen the mixture. Season to taste with salt and freshly ground black pepper, then stir in the sweetcorn.", "Heat the oil in a frying pan over a medium to high heat. Spoon half of the batter into the pan and fry for 1-2 minutes on each side, or until the pancake is golden-brown on both sides. Set the pancake aside on a warm plate and cover loosely with aluminium foil. Repeat with the remaining batter.", "For the tomato chilli salsa, mix the tomatoes, coriander, chilli, sugar, finely chopped onion, lime juice and salt until well combined. Season to taste with freshly ground black pepper.", "For the poached eggs, bring a pan of water to the boil, stir in the vinegar and turn down the heat so that the water is simmering. Add the eggs and poach for 3-4 minutes, or until cooked to your liking, then remove from the pan with a slotted spoon and drain on kitchen paper. ", "To serve, place one of the sweetcorn pancakes onto each plate, arrange two of the poached eggs on top, and finish with a spoonful of the tomato chilli salsa."]}, {"isVegetarian": false, "title": "Chinese-spiced steak wraps", "url": "www_bbc_co_uk_food_recipes_mexinese_fajitas_68356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz sirloin, sliced into strips against the grain", "100g/3½oz cumin seeds", "100g/3½oz coriander seeds", "50g/1¾oz brown sugar", "pinch Sichuan pepper", "pinch salt", "pinch sushi vinegar powder (available from Asian supermarkets or online)", "1 dried chilli", "30g/1oz light soy sauce", "30g/1oz oyster sauce", "20g/¾oz rice wine vinegar", "1 garlic clove, finely chopped", "Thumb-sized piece fresh ginger, peeled and finely chopped", "1 tbsp sesame seeds", "10g/⅓oz sesame oil", "2 large red peppers, thinly sliced", "50ml/2fl oz smoked rapeseed oil", "25g/1oz caster sugar", "30g/1oz light soy sauce", "20g/¾oz dark soy sauce", "100ml/3½fl oz rice wine vinegar", "150ml/5fl oz peanut chilli oil ", "50g/1¾oz crispy dried shallots, roughly chopped", "25g/1oz fermented black beans, rinsed and roughly chopped", "100g/3½oz doubanjiang fermented chilli", "300ml/10fl oz chilli oil", "½oz Sichuan pepper, ground", "200ml/7fl oz thick soured cream", "2 tbsp smoked rapeseed oil", "150g/5½oz dried fat rice noodles", "1 tbsp ground dried nori seaweed", "4 flour tortillas", "2 spring onions, sliced at an angle", "1 tbsp sesame seeds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the steak, toast the cumin and coriander seeds n a dry frying pan until brown and fragrant. Place into a spice blender with the sugar, Sichuan pepper, salt, sushi vinegar powder and the whole dried chilli and grind into a fine powder. Rub the beef with most of the spice mix, reserving a little for later.", "Sear the beef in a hot pan or wok until seared and caramelised but still pink inside (be careful not to burn the sugar). ", "Mix together the remaining steak ingredients, adding the sesame oil last and whisk together to make a dressing. Tip in the dressing to deglaze the wok. Remove from the heat very quickly. Set aside and keep warm until ready to serve. ", "To make the soy pickled peppers, place the peppers and oil in a hot pan or wok and caramelise until the edges are charred. Add the sugar and cook for a few more minutes. Add half the soy and half the vinegar, mix, remove from the heat then add the remaining ingredients. Set aside until cooled to room temperature.", "To make the chilli sauce, mix all the ingredients together and set aside.", "To make the noodles, preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the noodles for a couple of seconds until puffed up and crisp. Drain on kitchen paper, season with the ground seaweed and set aside. Put in a small bowl until ready to serve.", "Put the sour cream into a small bowl, pour the oil around edges. Sprinkle a touch of the remaining spice seasoning on top. Set aside until ready to serve", "Heat the tortillas carefully in a dry frying pan. Put on one tortilla on a serving plate and .top with the beef, pickled peppers, chilli sauce and the sour cream sauce. Sprinkle with the sesame seeds and sliced spring onions. Serve with the crispy noodles on the side."]}, {"isVegetarian": true, "title": "Mezze platter with flatbread", "url": "www_bbc_co_uk_food_recipes_mezze_platter_with_12562", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines, sliced lengthways ", "2 tbsp olive oil", "1 tbsp pine nuts ", "1 garlic clove, finely diced", "1 tbsp finely chopped flatleaf parsley", "2 tbsp toasted Japenese panko breadcrumbs", "1 tbsp golden raisins ", "200g/7oz feta cheese, crumbled", "1 tsp whole mint leaves, to garnish", "400g/14oz green beans", "400g/14oz yellow runner beans", "400g/14oz runner beans", "3 free-range eggs", "3 tbsp olive oil", "1 garlic clove, crushed", "1 tsp red chilli, sliced", "1 tbsp red wine vinegar", "1 tsp Dijon mustard", "1 lemon, zest only", "1 tbsp torn mint leaves", "1 tbsp torn parsley leaves", "4 spring onions, chopped", "250g/9oz dried chickpeas, soaked overnight", "2 tbsp olive oil", "pinch chilli", "pinch cumin", "1 tsp sumac", "18 ripe cherry tomatoes, halved", "2 spring onions, sliced ", "1 bunch parsley, finely chopped", "1 bunch mint, finely chopped", "1 lemon, juice only", "250g/9oz strong bread flour", "½ tsp salt", "150ml/5fl oz warm water", "5g instant yeast", "1 tsp olive oil", "200g/7oz thick yoghurt"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the aubergine and feta, preheat the oven to 200C/400F/Gas 6.", "Drizzle the oil over the aubergine and heat a grill pan. Place the aubergines on the grill pan and cook each side for two minutes, then transfer to the oven for four minutes.", "Heat a dry frying pan and dry fry the pine nuts.", "Heat a clean pan, add the olive oil and gently fry the garlic, parsley and breadcrumbs. Add the pine nuts and golden raisins and cook for a further two minutes.", "Pour the breadcrumb mixture over the aubergines and top with the crumbled feta and mint leaves.", "For the three bean salad with soft-boiled egg. Add the green beans to a pan of boiling water. A minute later, add the yellow and runner beans. Boil them until cooked to your liking, then drain and refresh them in cold water, then drain again and set aside.", "In another pan of boiling water, cook the eggs for five minutes so that they are soft-boiled. Leave until cool enough to handle then peel them and leave to one side.", "Heat a small frying pan and add a tablespoon of olive oil. Once hot, add the garlic and chilli and cook for one minute.", "Place the beans in a large glass bowl and finish with the rest of the olive oil, and the vinegar, mustard and lemon zest.", "Add the herbs and spring onions. Serve with the soft-boiled eggs halved on top.", "For the chickpea salad, drain the soaked chickpeas. In pan of clean water, boil them for 10-15 minutes, or until cooked. Drain well.", "Heat the oil in a frying pan and gently fry the chilli, cumin and sumac. Add the spices and cook until aromatic, then add the chickpeas.", "Fry for a few minutes, then combine with the other chopped ingredients and the lemon juice.", "For the flatbread, place the flour and salt in a free-standing mixer with a dough hook attachment and dissolve the yeast in a little water.", "Add the oil to the flour, along with the salt and yeast and mix with the dough hook, kneading for five minutes. Tip the dough into a bowl, cover loosely and leave to prove until doubled in size (about 30-60 minutes).", "To cook the flatbread, heat a cast iron pan. Divide the dough into balls and roll out to about the thickness of a pound coin. Lay them on the hot pan in batches and cook for a couple of minutes on each side, or until all the raw dough has cooked and the bread has bubbled up and is crisp and coloured.", "To serve, place the mezze in separate bowls or a large platter and serve with the flatbread and thick yoghurt."]}, {"isVegetarian": true, "title": "Mice in jackets", "url": "www_bbc_co_uk_food_recipes_miceinjackets_74797", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miceinjackets_74797_16x9.jpg", "ingredients": ["4 potatoes", "1 tbsp oil", "30g/1oz butter", "6 tbsp milk", "grated cheese", "salt and freshly ground black pepper", "cherry tomatoes", "chives", "raisins", "radishes", "spring onions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Wash the potatoes and pat them dry. Prick the skins with a fork and put the potatoes on a baking tray. Brush them all over with oil.", "Bake the potatoes until they are soft. Medium-sized potatoes take about an hour. ", "Cool enough to handle? Then cut off the tops and carefully scoop out the soft potato centres. You can throw away the lids (or eat them).", "Mash the soft centres with the butter, milk and cheese. Add a pinch of salt and pepper, then pop the mixture back into the potato jackets.", "Sprinkle with cheese and cook your potatoes under the grill for a few minutes until they are golden.", "Make a nose and whiskers with half a cherry tomato held in place with a cocktail stick and chives tucked behind.", "Finish decorating with raisin eyes, radish ears and spring onion tails."]}, {"isVegetarian": false, "title": "Khao soi noodles", "url": "www_bbc_co_uk_food_recipes_mickeys_khao_soi_noodles_24933", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mickeys_khao_soi_noodles_24933_16x9.jpg", "ingredients": ["4 tbsp ready-made Thai red curry paste", "9 chicken drumsticks", "1 tbsp mild curry powder", "400ml/14fl oz coconut milk", "400ml/14fl oz chicken stock", "2 tbsp palm sugar (or light brown sugar)", "1 tbsp fish sauce", "300g/10½oz fresh egg noodles", "3 tbsp groundnut oil", "splash dark soy sauce", "2 spring onions, trimmed, thinly sliced", "1 red onion, finely chopped", "50g/2oz chopped fresh coriander", "2 limes, cut into wedges, to serve"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the curry paste in a large saucepan over a medium heat. Add the chicken drumsticks and cook for 3-4 minutes on all sides, or until covered in the curry paste and browned all over.", "Add the curry powder, coconut milk and chicken stock to the pan and bring the mixture to the boil. Add the palm sugar and fish sauce, reduce the heat until the mixture is simmering, then simmer for 20 minutes, or until the chicken drumsticks are cooked through. (The chicken is cooked through if the juices run clear when pierced in the thickest part with a skewer and no trace of pink remains.)", "Boil 200g/7oz of the noodles in a large pan of boiling water for no more than 1 minute. Drain well and set aside.", "Heat the groundnut oil in a wok over a high heat. Add the remaining noodles and fry for a few seconds, until crisp.", "Divide the blanched noodles among 3 or 4 serving bowls and splash a little soy sauce over each. Pour over the chicken and sauce, then sprinkle the spring onions, red onion and coriander on top. ", "Break the fried noodles into small pieces and sprinkle them over each bowl of khao soi. Serve with lime wedges alongside."]}, {"isVegetarian": false, "title": "Microwave chilli con carne with rice", "url": "www_bbc_co_uk_food_recipes_microwave_chilli_con_83522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium onion", "1 garlic clove", "100g/3½oz mushrooms (optional)", "1 x 400g/14oz can chopped tomatoes", "1 x 400g/14oz can red kidney beans", "200g/7oz minced beef", "1 beef stock cube", "1 tsp chilli powder OR ¾ tsp spoon chilli flakes", "black pepper (optional)", "1 mug long grain or basmati rice (about 250–300g/9-10½oz)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and finely chop the onion and garlic (press or chop the garlic as small as you can).", "Wipe the mushrooms, if using, with kitchen paper to remove any dirt and slice finely.", "Open the cans of tomatoes and beans. Drain the kidney beans through a colander and rinse with cold water.", "Put the minced beef into the large bowl and add the onion and garlic. Mix together using a fork until the meat is thoroughly broken up.", "Cover with a microwaveable lid or cling film, leaving a small area open to allow steam to escape.", "Cook in the microwave on full power for five minutes. Remove from the microwave. Peel back the cling film and stir well with the fork, breaking up any clumps of meat.", "Add the mushrooms, crumbled stock cube, chilli flakes or powder, tomatoes and beans to the meat and stir well.", "Add a small amount of water to the empty tomato can, swirl around and add to the bowl. Season with black pepper to taste, if using.", "Re-cover in the same way and cook on full power for five minutes. Remove the bowl and stir well.", "Re-cover, return to the microwave and cook on full power for 10 minutes. Remove halfway through and stir well. Leave to stand while you cook the rice.", "To cook the rice, boil the kettle. Add the rice to the sieve. Run cold water through the rice until the water runs clear and drain. Pour the rice into the other large microwave-safe bowl. Fill the same mug with boiling water twice and pour over the rice. Stir once and put into the microwave.", "Microwave on full power for 10 minutes.", "Remove the rice and stir. Return it to the microwave on full power for another minute.", "Remove the rice and leave to stand for 1–2 minutes and then taste to check it is cooked. If it needs slightly more cooking add a small amount of water and cook for another two minutes."]}, {"isVegetarian": false, "title": "Microwave fish parcels", "url": "www_bbc_co_uk_food_recipes_microwave_fish_parcels_46241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium sweet potatoes, peeled and very finely sliced", "½ large leek, thinly sliced into rounds", "100g/3½oz frozen green beans", "100g/3½oz frozen peas", "4 x 75g/2½oz frozen pollock fillets, skinned and boned", "1 tbsp finely chopped chives", "4 tsp olive oil", "½ lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Lay 4 large square sheets of greaseproof paper onto a work surface. Divide the sweet potato between the 4 sheets, piling them into the centre of the paper. Divide the leeks, beans and frozen peas between the sheets then top each with a piece of frozen pollock. Season the fish well with salt and pepper. Scatter the chives over the top and drizzle with the rapeseed oil.", "Seal the fish into a parcel by folding the paper in half into a triangle, then crimp the edges together, folding the edge over itself so that it seals all the way along, so it looks a little like a Cornish pasty!", "Place 2 parcels onto a microwave-safe plate. Cook in the microwave on a high setting for 10 minutes until the fish is cooked through and the parcels have expanded. Leave them to rest for 2 minutes before opening.", "To check that the fish is cooked through, open one of the parcels and see if the fish is white and hot to the touch. If not, reseal and return to the microwave for another 5 minutes and check again.", "Put each parcel onto a plate and open at the table, adding a squeeze of lemon juice over the fish just before serving."]}, {"isVegetarian": false, "title": "Microwave jacket potatoes with various toppings", "url": "www_bbc_co_uk_food_recipes_microwave_jacket_34010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium baking potato (about 180g/6oz)", "½ leek", "black pepper (optional)", "15g/½oz reduced-fat cheddar cheese", "15g/½oz cooked bacon or ham", "1 eating apple", "1 x 80g/2¾oz can tuna (in spring water)", "½ x 198g/7oz can sweetcorn", "1 tbsp reduced-fat mayonnaise", "black pepper (optional)", "50g/1¾oz frozen peas", "1 x 80g/2¾oz can skinless and boneless salmon", "1 tbsp salad cream", "5 button mushrooms", "black pepper (optional)", "140g/5oz reduced-fat cream cheese (1 mini tub)", "1 tsp tomato purée", "1 tsp lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the potato and prick with a sharp knife several times on all sides.", "Dry the potato well with kitchen paper and place on a microwave-safe plate.", "Place in the microwave and cook on full power for four minutes.", "Remove the plate using oven gloves and turn the potato over. Dry the potato and the plate and put back into the microwave.", "Heat on full power for a further four minutes.", "Remove the plate and leave the potato to stand for a minute, as it will continue to cook. Check that the potato is soft by pushing a sharp knife into the centre. Return to the microwave for another 30 seconds if it is still hard in any part.", "For the leek, apple, cheese and bacon filling, wash and slice the leek. Place in a small bowl and grind over some black pepper, if using. Cover the bowl with cling film, leaving a small area open, and microwave on full power for two minutes. Grate the cheese, chop the bacon and grate the apple into the leeks.", "Cut the potato in half, scoop out the fluffy middle and add to the cheese and vegetables. Mix well and spoon back into the ‘jackets’. Put the filled ‘jackets’ on a microwave-safe plate and heat for one minute, or until the cheese has melted.", "For the tuna and sweetcorn, open the cans of tuna and sweetcorn and drain, then tip into the bowl with the mayonnaise and mix with black pepper, if using.", "Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping.", "For the salmon and peas, put the peas into a mixing bowl and pour over boiling water from the kettle. Leave for five minutes, then drain and return the peas to the bowl.", "Open the can and drain the salmon, then add to the peas in the mixing bowl.", "Measure in the salad cream and mix well.", "Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping.", "For the mushroom and tomato filling, wipe the mushrooms clean with a piece of damp kitchen paper. Slice them and place into a microwave-safe bowl and grind over some black pepper, if using. Microwave on full power for one minute, stir, and then heat for a further minute.", "Allow to cool, then mix in the other ingredients.", "Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping."]}, {"isVegetarian": true, "title": "Microwave lemon drizzle cake", "url": "www_bbc_co_uk_food_recipes_microwave_lemon_drizzle_76127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz butter, softened, plus extra for greasing", "110g/4oz self-raising flour", "110g/4oz caster sugar", "2 free-range eggs, lightly beaten", "1 lemon, zest only", "100g/3½oz icing sugar", "½ lemon, juice only"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 20x14cm/8x5½in microwave-safe bowl with butter (a small ice cream tub will do) .", "Place the butter, flour and sugar in a bowl. Using your fingertips, rub the butter into the dry ingredients until the mixture resembles coarse breadcrumbs.", "Add the eggs and lemon zest and beat with a fork until you have a smooth batter. ", "Pour the cake mixture into the greased bowl and cover with cling film.", "Place into the microwave and cook on the highest power for four minutes, or until cooked through. You can test this by pulling back the cling film and piercing the cake with a skewer and removing it - if the skewer comes away clean then the cake is ready. Set the cake aside to cool, ideally on a wire rack.", "For the lemon icing, put the icing sugar and lemon juice into a bowl. Mix well until smooth. The icing should be thin enough to slowly run off the back of a spoon - if your lemon isn't very juicy you may need to add a little water to get the right consistency.", "To serve, place the cooled cake on a serving plate with the neatest side facing upwards. Drizzle over the lemon icing using a spoon. The cake is best eaten on the same day it's made."]}, {"isVegetarian": false, "title": "Microwave spaghetti bolognese", "url": "www_bbc_co_uk_food_recipes_microwave_spaghetti_44920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/microwave_spaghetti_44920_16x9.jpg", "ingredients": ["1 onion, chopped", "1 garlic clove, chopped", "1 carrot, chopped into pea-sized pieces", "300g/10½oz lean beef mince", "1 x 400g/14oz can chopped tomatoes", "50ml/2fl oz boiling water", "1 beef stock cube", "1 tsp dried oregano (optional)", "black pepper (optional)", "300g/10½oz uncooked spaghetti", "1 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chopped onion, garlic and carrot into a large microwave safe bowl.", "Add the mince and mix together with a fork, breaking up the meat until it is well combined.", "Cover the bowl with a microwaveable lid or cling film, leaving a small area open, and microwave on full power for three minutes.", "Remove the bowl. Stir with the fork, breaking up the mince again, cover and return to the microwave for another three minutes. Take care when removing the bowl as it will be very hot. Break up any clumps of mince again.", "Add the chopped tomatoes to the bowl together with 50ml/2fl oz of boiling water, and crumble over the stock cube, oregano and black pepper (if using).", "Mix everything together with a wooden spoon. Cover again and cook in the microwave on full power for seven minutes. Remove the bowl, stir well, cover and return to the microwave for another 10 minutes on full power, stirring halfway through.", "Remove the bowl and leave to stand while you cook the spaghetti.", "Boil the kettle for the spaghetti. Break the spaghetti into thirds and put in a separate microwave safe bowl. Add the oil and mix well with a wooden spoon to coat the spaghetti with oil. Pour over boiling water until just covered and stir well.", "Put into the microwave and cook on full power for four minutes.", "Remove the bowl and stir the spaghetti. Cover and return to the microwave and cook on full power for another four minutes.", "Take the bowl out of the microwave and leave to stand for two minutes. Check that the spaghetti is cooked and is al dente (still has a little bite). Cook for another couple of minutes if it’s not soft enough.", "Drain the cooked spaghetti and serve with the bolognese sauce."]}, {"isVegetarian": false, "title": "Middle Eastern-style chicken livers with parsley salad and pitta", "url": "www_bbc_co_uk_food_recipes_middle_eastern-style_60412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "450g/1lb chicken livers, trimmed of any sinews and fat, drained and patted dry, chopped into bite-sized pieces", "1 onion, finely sliced", "1 garlic clove, finely sliced", "½ tsp chilli flakes", "½ lemon, juice only (zest used below)", "200g/7oz plain yoghurt", "4 pitta breads", "salt and pepper", "1 bunch parsley, leaves roughly chopped, stalk very finely chopped", "½ onion, very finely diced", "½ lemon, zest only (juice used above)", "2 tbsp olive oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a medium heat. Add half of the butter and, once melted, and the pan is hot add the chicken livers. Brown on each side until nicely coloured, but not cooked through. Add the onion to the pan and cook for five minutes then add the garlic and chilli flakes and continue to cook for two more minutes.", "Squeeze in the lemon juice, starting with a quarter of the lemon and adding more to taste. Add the remaining butter, allow it to melt in the pan and then baste the livers for two minutes over a medium heat so that the sauce is bubbling. The livers should by this point have firmed up with only a hint of pink in the middle.  Add the yoghurt and mix through. Taste and season with salt and pepper to taste. Take off the heat and leave to rest while you make the salad.", "Mix all the parsley salad ingredients together and season with salt and pepper. Toast the pitta breads and then slit them open along one of the long sides.", "Spoon the chicken livers into the pitta pockets, top with the parsley salad and serve."]}, {"isVegetarian": false, "title": "Middle-Eastern game pie", "url": "www_bbc_co_uk_food_recipes_middle-eastern_game_pie_16769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½ tsp ras-el-hanout ", "1½ tsp ground cinnamon", "1 tsp ground ginger", "½ tsp paprika", "½ tsp ground cumin", "½ tsp Kashmiri chili powder ", "350g/12oz Maris Piper potatoes, peeled and cut into 2.5cm/1in cubes (280g/10oz after peeling)", "3 tbsp vegetable oil", "280g/10oz rabbit meat, cubed", "280g/10oz pigeon breast, cubed", "120g/4¼oz venison, cubed", "280g/10oz lamb mince (about 20% fat) ", "25g/1oz dried barberries (available online)", "100g/3½oz dried apricots, cut into thirds", "60g/2¼oz whole blanched almonds, toasted and chopped", "100g/3½oz full-fat Greek yoghurt", "4 tbsp pomegranate molasses  ", "4 tbsp date molasses ", "1¼ tsp table salt", "80g/2¾oz unsalted butter", "140g/5oz lard, plus extra for greasing", "1 tsp table salt", "300g/10½oz plain flour, plus extra for dusting", "300g/10½oz strong white bread flour ", "1 large free-range egg, beaten for egg wash"], "serves": "Makes 1 x 20cm/8in pie", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the spice mix, mix all the ingredients together in a small bowl. Set aside.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Fill a small pan with boiling water and place on a medium heat. Add the potatoes and cook for 5-7 minutes. They should be softened but still hold their shape.", "In a large frying pan, heat the oil and then add the spice mix. Fry for 1 minute on a medium heat then add the chopped meats and brown them on a high heat for 2-3 minutes. Add the minced lamb and cook on medium for a further 1 minute. Add the potatoes, dried fruit and toasted almonds. Finally, add the Greek yoghurt, pomegranate and date molasses and cook until incorporated and slightly reduced. Season with the salt. Remove from the heat and leave to cool slightly while you make the pastry.", "For the hot water crust pastry, add the butter, lard, salt and 240ml/8½fl oz water to a medium saucepan and heat until the lard is melted.", "Mix the flours together in a bowl and add the melted lard mixture. Mix using a wooden spoon until formed into a smooth dough. ", "When cool enough to handle, knead briefly and set aside a third of the dough. Dust the worktop and rolling pin with plain flour and roll the pastry out to 4mm thick.", "Line a 20cm/8in springform cake tin with the pastry, then add the filling and brush the edge of the pastry with egg wash. Roll out two-thirds of the remaining pastry to make the pie lid. Cover the pie and crimp the edges to seal. Make a hole in the middle to allow steam to escape while the pie cooks.", "Thinly roll out the remaining pastry and cut out leaf shapes of varying sizes and stick these on the top of the pie using egg wash. ", "Brush the top of the pie with more egg wash and bake for 1½ hours. After 1 hour, check the pie is cooking evenly and move it around in the oven if necessary. ", "While the pie is baking, shape any remaining pastry into roses to decorate the top and small diamonds to decorate the sides of the pie.  Place on a baking tray lined with non-stick paper and bake the diamonds for 10 minutes and the roses for 25 minutes. ", "Once the pie is cooked, carefully remove the sides of the tin. Attach the diamonds to the side of the pie using egg wash. Brush egg onto the base of each of the roses and attach to the top of the pie. Bake the pie for 5 minutes to cook the egg wash.", "Serve the pie warm or cold."]}, {"isVegetarian": true, "title": "Baked potatoes with Middle Eastern beans and greens", "url": "www_bbc_co_uk_food_recipes_middle_eastern_beans_and_72584", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/middle_eastern_beans_and_72584_16x9.jpg", "ingredients": ["2 baking potatoes ", "1 tbsp olive oil ", "2 garlic cloves, thinly sliced", "200g/7oz chard, cut into 2cm/¾in strips (thick stalks 1cm/½in)", "400g tin cannellini beans, drained  ", "½ tsp cumin seeds or ground cumin", "salt and freshly ground black pepper", "½ lemon, juice only, to serve", "100g/3½oz Greel-style plain yoghurt ", "1½ level tbsp tahini", "½ garlic clove, crushed "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Bake the potatoes for 1½ hours, or until tender. ", "Meanwhile, heat the oil in a lidded frying pan over a medium heat. Add the garlic and chard. Stir and season, then add 50ml/2fl oz water.", "Place a lid on the pan, turn down the heat and cook for 3–4 minutes, stirring halfway through. Stir in the beans and cumin, cover and cook until the stalks are tender, adding a dash more water if needed.", "Meanwhile, to make the dressing, mix together the ingredients with a pinch of salt and set aside.", "Split each baked potato in half, top with the beans and chard, a squeeze of lemon juice and drizzle over the dressing."]}, {"isVegetarian": true, "title": "Middle Eastern lentils", "url": "www_bbc_co_uk_food_recipes_middle_eastern_lentils_38158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/middle_eastern_lentils_38158_16x9.jpg", "ingredients": ["4 tbsp olive oil", "3 onions, thinly sliced", "4 garlic cloves, finely chopped", "cumin seeds, toasted and then ground (to taste)", "pinch chilli flakes, or to taste", "200g/7oz brown or green lentils", "2 green peppers, seeds removed and quartered", "lemon juice, to taste", "1 small bunch fresh coriander, roughly chopped", "fresh mint, torn", "salt and freshly ground black pepper", "flatbreads", "Greek yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan and add the onions. Cook over a low heat and allow the onions to soften, sweeten and turn gold. This may take about 20 minutes. Do not rush this part, it is important that the onions are sweet. ", "Set aside half the onions, turn up the heat and add the garlic, cumin and chilli. Stir and when you can really smell the garlic add the lentils and enough water to cover them by 5cm/2in. ", "Bring to the boil and then reduce to a simmer. Cover the pan and cook until the lentils soften. You may have to top up the water if the lentils look dry but don't add too much, you don’t want to drain away any delicious juices later. ", "Meanwhile, heat the grill to high. Grill the pepper quarters skin-side up until the skin is blistered and blackened then transfer to a resealable plastic bag. Set aside for 5-10 minutes, or until the skin has loosened from the pepper flesh. Once the peppers are cool enough to handle peel off the skins. Thinly slice the peppers and set aside. ", "Once the lentils are really soft, and this can take up to an hour, season with salt, pepper and lemon juice. Stir in the coriander leaves and garnish with the remaining sweet fried onions, grilled peppers and mint. ", "Serve with warm flatbreads and a dollop of Greek yoghurt. "]}, {"isVegetarian": true, "title": "Middle Eastern taboon flatbread", "url": "www_bbc_co_uk_food_recipes_middle_eastern_taboon_90922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "200g/7oz strong flour", "1 tsp fast-action yeast", "1 tbsp caster sugar", "1½ tbsp zaatar (a Middle Eastern spice mix now available in supermarkets)", "1 tsp fine salt", "325ml/11fl oz warm water", "2 tbsp olive oil, plus extra for oiling bowl", "3 tbsp zaatar", "1½ tbsp sumac (available from some supermarkets and from Middle Eastern delicatessens)"], "serves": "Makes 6 flatbreads", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, sieve both flours into a large bowl. Mix in the yeast, sugar, zaatar and salt. In a separate bowl mix the warm water and oil together before adding to the dry ingredients. Mix until you have a soft, sticky dough then cover with a cloth and set aside to prove for 10 minutes.", "Turn out the dough onto floured surface, and knead the dough for 10 minutes until you have a soft, shiny dough (add a little flour if needed). ", "Transfer the dough to an oiled bowl and turn it round so that its entire surface has a thin coat of oil. Cover with cling film and set aside to prove for up to an hour. ", "Flour your hands and knock back the dough by turning it over three to four times in its bowl. Transfer to a floured surface and divide the dough into six equal pieces and form each piece into a ball. Roll each ball out to form a circle approximately 18cm/7in wide and 3mm/⅛in thick (they do not need to be perfect circles). Place each circle on a lightly floured cloth. ", "Spray the dough circles lightly with water and sprinkle zaatar and sumac over the surface.  Leave to prove again for 30 minutes. ", "Preheat the oven to maximum temperature; it needs to be very hot.  Place an upturned roasting tray on the middle to lower shelf (the more uneven the surface the better, so use an old beaten up tray if you have one).  Leave the tray to heat up for 20 minutes before baking the flatbreads.", "Bake two or three flatbreads at a time for five minutes, or until the flatbreads are puffy and brown spots start to develop. Keep the oven door closed to avoid cooling the oven and keep checking the flatbreads while they cook - they can burn easily. Remove the flatbreads from the oven and place on a cooling rack. Cook the remaining dough circles. "]}, {"isVegetarian": true, "title": "Midsummer asparagus, goats’ cheese and fig salad", "url": "www_bbc_co_uk_food_recipes_midsummer_asparagus_36009", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz podded broad beans (or 600g/1lb 5oz if in pods)", "2 Little Gem lettuces, cut in half lengthways, then into 8 thin wedges", "60g/2¼oz bag salad leaves", "6 just-ripe fresh figs, tops removed, quartered", "100g/3½oz firm goats’ cheese, peeled and crumbled", "250g/9oz asparagus, tips cut off, stalks cut into diagonal pieces", "selection of purple micro herbs", "1 tsp lemon juice", "1 tsp sugar", "1 tsp Dijon mustard", "1 garlic clove, crushed", "1 tbsp finely chopped chives", "6 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a medium pan of water to the boil. Add the beans and asparagus and boil for 2–3 minutes. Drain, refresh in cold water, then drain again and peel the broad beans. ", "Assemble the salad in a large salad bowl by layering the Little Gem wedges, salad leaves, figs, goats’ cheese, asparagus, broad beans and micro herbs. ", "For the dressing, mix the remaining ingredients together in a small bowl. Just before serving, pour the dressing over the salad, toss to combine and serve."]}, {"isVegetarian": false, "title": "Midweek chicken korma", "url": "www_bbc_co_uk_food_recipes_midweek_chicken_korma_82829", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/midweek_chicken_korma_82829_16x9.jpg", "ingredients": ["4 boneless, skinless chicken breasts (each weighing about 600g/1lb5oz), cut into 2.5cm/1in chunks ", "2 tbsp sunflower or vegetable oil", "25g/1oz butter", "2 onions, coarsely grated or very finely chopped", "2 garlic cloves, crushed or finely grated", "25g/1oz fresh root ginger, peeled and finely grated", "2 tbsp medium curry powder", "1 tsp ground turmeric", "1 tbsp mango chutney", "75g/2¾oz dried red split lentils", "800ml/1½ pints chicken stock, made with 1 stock cube", "3 tbsp single cream", "freshly ground black pepper", "160g/5¾oz basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken generously with pepper. ", "Heat 1 tablespoon of the oil a large, non-stick frying pan. Fry the chicken over a medium–high heat for 4–5 minutes, turning occasionally. Transfer the chicken to a plate using a slotted spoon or spatula and return the pan to the heat.", "Place the remaining oil, butter and onions in a large, non-stick saucepan and cook over a medium heat for 7–8 minutes, or until the onions are well softened and lightly browned. Stir in the garlic, ginger, curry powder and turmeric and cook for a few seconds more, stirring constantly.", "Add the mango chutney, lentils and stock to the spiced onions and bring to a simmer. Cook, stirring regularly, for 15 minutes, or until the liquid has reduced and the lentils are softened.", "Add the chicken and cream to the lentil mixture and simmer gently for 5–6 minutes, or until the chicken is cooked through. Add an extra splash of water if the sauce is too thick.", "Meanwhile, place the rice in a saucepan of boiling water and cook for 10–12 minutes, or according to the packet instructions. Drain and set aside. Serve the curry immediately with the freshly cooked rice."]}, {"isVegetarian": false, "title": "Milanese chicken with wilted spinach and herb pesto", "url": "www_bbc_co_uk_food_recipes_milanesechickenwithw_89111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz white bread, roughly chopped", "3 tbsp chopped fresh parsley", "150g/5½oz chicken breast, cut through the centre and opened out flat (butterflied)", "2 free-range eggs, beaten", "2 tbsp olive oil", "1 tbsp olive oil", "85g/3oz spinach leaves", "½ tsp chilli flakes", "salt and freshly ground black pepper", "3 tbsp olive oil", "2 tbsp chopped fresh parsley leaves", "1 handful fresh basil leaves", "salt and freshly ground black pepper", "1 tbsp Greek-style yoghurt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the bread and parsley into a food processor and pulse to fine breadcrumbs. Transfer to a large bowl or shallow dish.", "Place the butterflied chicken breast in between two sheets of cling film and flatten out with a meat mallet or rolling pin until half as thin. Dip into the beaten egg, then roll in the parsley breadcrumbs to coat all over. Shake off any excess breadcrumbs. ", "Heat the olive oil in a frying pan and fry the chicken breast for five minutes on both sides, or until golden-brown and cooked through. ", "For the spinach, heat the oil in a wok and add the spinach and chilli flakes, stirring gently for 2-3 minutes, or until the spinach is wilted. Season with salt and freshly ground black pepper.", "For the herb pesto, place all of the pesto ingredients into a food processor and pulse until well combined. ", "To serve, spoon the wilted spinach onto a serving plate and top with the fried chicken. Drizzle the pesto around the edges of the plate, and spoon a dollop of the Greek-style yoghurt to the side."]}, {"isVegetarian": false, "title": "Miles’ fish tea", "url": "www_bbc_co_uk_food_recipes_miles_fish_tea_93869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red snapper (approximately 1kg/2lb 4oz), filleted, bones and head reserved", "3 tbsp Jamaican fish seasoning powder", "2 lemons, juice only", "small bunch fresh thyme", "4 garlic cloves, crushed", "1 large carrot, sliced into 1cm/½in rounds", "2 green bananas or plantains, peeled, sliced to 2cm/1in rounds", "2 cho cho (available from West Indian markets or delicatessens), sliced into 1cm/½in discs ", "1 yam, peeled, sliced into 1cm/½in discs", "1 green Scotch bonnet chilli, top sliced off", "6 spring onions, trimmed"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the red-snapper fillets into thirds to create six pieces in total. ", "In a large bowl, mix the fish seasoning with the lemon juice until smooth and dissolved. Add the fish pieces and mix well to coat them in the marinade. Set aside to marinate for 30 minutes.", "Bring 1.5 litres/2¾ pints water to the boil in a large saucepan. Add the reserved fish bones and head, the thyme and the garlic. Reduce the heat until the stock is simmering and continue to simmer for 30 minutes. Strain through a fine sieve, returning the strained liquid to the pan.", "Add the carrot, green bananas, cho cho and yam and simmer for 10 minutes, or until tender.", "Add the marinated fish fillets and the marinade. Carefully balance the chilli on top of the fish, only allowing it to become partially submerged in the stock. (Submerge the chilli fully to release its seeds if you want a hotter dish - be warned that Scotch bonnet chillies are very hot.) Continue to simmer for a further 8 minutes, or until the fish is almost cooked through.", "Add the spring onions and simmer for a final 2-3 minutes, or until the fish flakes easily and is just cooked through. Serve in bowls."]}]