[{"ingredients": ["8 vieiras, vivir en el caparazón, caparazón limpiado", "200g / 7 oz de champiñones, finamente en rodajas", "¼ limón, solo jugo", "500ml / 18fl oz de caldo de pescado", "Papas para hornear medianas de 300 g / 11 oz", "2 yemas de huevo de gallinas camperas", "25g / 1oz de mantequilla", "sal y pimienta blanca recién molida", "50g / 2oz de mantequilla", "Harina normal de 25g / 1oz", "2 yemas de huevo de gallinas camperas", "Crema doble 150ml / 7fl oz", "sal y pimienta negra recién molida", "110g / 4oz de cuscús", "110ml / 4fl oz de agua hirviendo", "1 cabeza de brócoli", "1 cucharadita de aceite de oliva ligero", "sal y pimienta negra recién molida", "Gruyère 15 g / ½ oz, finamente rallado", "15g / ½oz de pan rallado fino", "50g / 2oz de mantequilla, derretida", "sal y pimienta negra recién molida"], "method": ["Coloque las vieiras en vivo en una placa calefactora o plancha caliente durante 1-2 minutos, hasta que comiencen a abrir.", "Deslice la cuchilla de un cuchillo para filetear entre la cáscara plana y la vieira y levante con cuidado la tapa de la cáscara.", "Deslice la hoja del cuchillo entre la vieira y la concha cóncava para separar la vieira y el coral.", "Mantenga las cuatro mejores mitades de caparazón cóncavo para servir, cepíllelas con agua fría y séquelas.", "Pele la membrana que rodea las vieiras, límpiela con agua fría, córtela en pedazos y déjela a un lado para usarla en la salsa.", "Separe los blancos de las vieiras de los corales anaranjados y lávelos suavemente con agua fría para eliminar los granos de arena.", "Coloque las vieiras, los corales, los champiñones, las membranas y el jugo de limón en una sartén con el caldo de pescado, ponga a fuego lento y deje que hierva lentamente. Baje el fuego a fuego lento a fuego lento durante un minuto. Retire del fuego, reserve y mantenga las vieiras y los champiñones en el caldo a temperatura ambiente.", "Precalentar el horno a 220C / 425F / Gas 7.", "Frote las papas con agua fría y pinche en 2-3 lugares con la punta de un cuchillo. Coloque en una bandeja para hornear y transfiera al horno para hornear en sus chaquetas durante 35-40 minutos, o hasta que estén suaves por dentro.", "Mitad de las papas y saque la carne cocida de las chaquetas. Forzar la carne de la patata a través de un tamiz duro o ricer en un recipiente limpio.", "Agregue dos de las yemas de huevo y la mantequilla y bata hasta que quede suave. Sazonar, al gusto, con sal y pimienta blanca recién molida. (La papa se puede hacer el día anterior y se guarda en el refrigerador hasta que se necesite).", "Para la salsa, derrita la mantequilla en una cacerola, mezcle la harina y cocine durante dos minutos para hacer un roux.", "Saque la sartén del fuego y cuele el caldo de las vieiras y los champiñones, revolviendo constantemente para combinar sin grumos. Coloque las vieiras y los champiñones a un lado.", "Cocine a fuego lento la salsa suavemente durante unos minutos, batiendo con frecuencia.", "En un tazón, mezcle las dos yemas de huevo con la crema y luego vierta esta mezcla en la salsa. Antes de que comience a burbujear, quite la sartén del fuego, sazone la salsa con sal y pimienta negra recién molida y manténgala caliente.", "Para el tabbouleh, coloque el cuscús en un tazón y vierta una cantidad igual de agua hirviendo en él, sazone con sal y pimienta negra recién molida, revuelva con un tenedor y cubra con una película adhesiva durante 4-5 minutos. Mezcle nuevamente y agregue el aceite de oliva.", "Afeite la parte superior de los brotes de brócoli con un cuchillo afilado y agregue al cuscús. Remover suavemente con un tenedor y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para ensamblar el plato final, aumente la temperatura del horno a 240C / 465F / Gas 9.", "Cortar los blancos de vieira en rodajas gruesas. Coloque una capa de champiñones en cada una de las cuatro conchas de vieiras limpias. Agregue una capa de claras de vieira y luego cubra con los corales de vieira.", "Llene una manga pastelera con la mezcla de papa y pinte una cinta atractiva alrededor del borde de las conchas de vieiras.", "Mezcle el gruyère y las migas de pan en un tazón limpio.", "Cubra las capas de champiñones y vieiras generosamente con salsa y espolvoree la parte superior con la mezcla gruyère y miga de pan.", "Derretir la mantequilla y verter sobre la salsa.", "Coloque las vieiras en el horno caliente para hornear durante 3-5 minutos, hasta que la parte superior de la salsa esté ligeramente glaseada y el borde de la papa dorado pálido.", "Para servir, espolvorea el tabbouleh en cuatro platos y quita con cuidado las vieiras del horno y coloca una encima de cada pila de tabbouleh. No olvide advertir a sus invitados que la concha de vieira estará extremadamente caliente."], "url": "www_bbc_co_uk_food_recipes_coquillessaintjacque_85814", "title": "Vieiras en Parisienne con taboulleh", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["120g / 4oz de cilantro, lavado a fondo", "3 dientes de ajo, pelados", "1 chile verde, sin tallo", "25g / 1oz de azúcar de palma", "3 cucharadas de aceite vegetal", "1 cucharadita de sal", "½ cucharadita de azúcar", "1 limón, solo jugo", "1 lubina salvaje completa (o 2 cultivadas), aletas removidas, limpiadas y evisceradas", "200 g / 7 oz de yogur", "2 cucharaditas de comino molido, tostado en una sartén seca hasta que esté fragante", "½ pepino, finamente picado", "2 cucharadas de hojas de cilantro fresco finamente picado", "sal y pimienta negra recién molida", "1 manojo (alrededor de 225 g / 8 oz) de brócoli brotación púrpura", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de berro de coriandro", "2 cucharadas de berro de alazor bebé"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 5.", "Para la lubina al horno, ponga el cilantro (hojas y tallos), ajo, chile, azúcar de palma, aceite, sal, azúcar y jugo de limón en un procesador de alimentos y mezcle hasta conseguir una consistencia pastosa.", "Coloque la lubina en una bandeja para hornear forrada con papel de aluminio. Cubra el pescado con la pasta de cilantro y otra hoja de papel de aluminio. Hornee por 10 minutos y luego retire la hoja superior de aluminio para destapar el pescado y cocine por otros 10-15 minutos.", "Para la raita de cilantro, mezcle todos los ingredientes de raita en un bol. Condimentar con sal y pimienta.", "Para el brócoli de brotación púrpura, coloque el brócoli brotado púrpura en un vaporizador y vapor durante 4-7 minutos. Mantenga caliente y termine con la mantequilla.", "Para servir, coloca el brócoli en el centro de los tazones para servir. Pele la piel de la lubina y cubra el brócoli con un poco de carne de lubina y una cucharada de raita de cilantro. Adorne con berro de coriandro y berro rojo, si lo usa."], "url": "www_bbc_co_uk_food_recipes_coriander_baked_sea_bass_66447", "title": "Coriandro al horno lubina al vapor con brócoli brotación al vapor púrpura y una raita de cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de cilantro, ligeramente trituradas", "8 cucharadas de cilantro fresco picado", "800 g / 1 libra de filete de atún fresco de 12 onzas", "4 cucharadas de aceite de oliva", "110g / 3¾oz de cilantro", "1 diente de ajo, picado", "75g / 2¾oz de coco fresco, rallado", "aceite vegetal", "½ repollo rojo, rallado finamente", "4 cucharadas de hojas frescas de cilantro", "4 cucharadas de hojas de menta fresca", "1 chile rojo, finamente cortado en cubos", "3 cucharadas de salsa de pescado", "2 limas, cáscara y jugo solamente"], "method": ["Para el atún, mezcle las semillas de cilantro y el cilantro fresco y espolvoréelos en un tablero.", "Cepille el aceite sobre el atún y enrolle la mezcla de cilantro. Caliente una sartén de plancha y coloque el atún en la sartén. Cocine hasta que aparezcan marcas en la barra y gire el atún hasta que tenga marcas alrededor del atún. Asegúrate de que todavía esté rosado en el medio.", "Para el pesto de cilantro, ponga el cilantro, el ajo y el coco en un procesador de alimentos y mezcle añadiendo suficiente aceite para darle una pasta gruesa.", "Para la ensalada, coloque todos los ingredientes en un tazón grande y mezcle.", "Cortar el atún en formas extrañas y el punto en un plato. Coloque una quenelle del pesto en el plato y viste con la ensalada de repollo."], "url": "www_bbc_co_uk_food_recipes_corainder_crusted_tuna_70559", "title": "Atún en costra de cilantro con ensalada de repollo rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de semillas de cilantro", "2 cucharadas de semillas de alholva", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 ramita de canela", "5 dientes", "3 vainas de cardamomo, semillas retiradas", "1 cucharada de cúrcuma molida", "2 hojas de laurel aplastadas", "2 cucharadas de cilantro fresco", "400g / 14oz de yogurt natural", "2 cucharadas de aceite vegetal", "1 pollo, espolvoreado", "50g / 1¾oz mitzuna leaves", "2 cabezas de lechuga Little Gem, hojas separadas", "½ coco fresco, solo carne, cortado en tiras", "4 cucharadas de azúcar de palma", "4 dientes de ajo", "2 cucharadas de jengibre fresco rallado", "3 chiles rojos, finamente picados", "1 manojo de cilantro fresco", "3 limas, solo jugo", "2 cucharadas de salsa de pescado"], "method": ["Para el pollo espolvoreado adobado con cilantro, coloque todas las especias en una sartén seca y cocine por 2-3 minutos, o hasta que las especias comiencen a reventar y se den cuenta de sus aceites y aroma.", "Coloque las especias en un molinillo de especias y muela hasta formar un polvo.", "Coloque el cilantro, el yogur, el aceite y las especias en polvo en un bol y mezcle. Extiende el adobo por todo el pollo y deja marinar durante al menos dos horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén grande de la plancha y coloque la pechuga de pollo hacia abajo y cocínela durante 4-5 minutos, o hasta que aparezcan las marcas de la barra. Voltee y cocine por otros 4-5 minutos.", "Cocine en el horno durante 20-25 minutos, dependiendo del tamaño del pollo. El pollo se cocina cuando los jugos se vuelven transparentes cuando la parte más gruesa se perfora con un pincho. Una vez cocinado, retíralo del horno, cúbrelo y déjalo reposar en un lugar cálido.", "Para la ensalada de coco y cilantro, coloque las hojas de mizuna y lechuga en un bol y agregue las tiras de coco.", "Coloque los ingredientes restantes de la ensalada en un mortero y hierva y pegue hasta obtener una pasta. Agregue la pasta al cuenco de hojas y revuelva para cubrir.", "Para servir, corte el pollo en porciones y colóquelo en un plato junto con la ensalada de cilantro."], "url": "www_bbc_co_uk_food_recipes_coriander-marinated_56361", "title": "Pollo salpicado de coriandro con ensalada de coco y cilantro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina común", "1½ cucharadita de sal de mesa", "560 g / 1 libra de mantequilla sin sal 4 oz", "½ cucharadita de jugo de limón", "1 huevo grande de gallinas camperas, para lavar huevos", "aceite vegetal, para freír", "300g / 10½oz de muslos de pollo sin hueso, cortados en trozos pequeños", "1 cebolla blanca mediana, más o menos picada", "1 pimiento verde pequeño, sin semillas y picado", "puñado de cilantro fresco, toscamente picado", "2 pequeños chiles verdes de ojo de pájaro, sin semillas y finamente picados", "2cm / ¾ en jengibre fresco de raíz, pelado y finamente picado", "2 dientes de ajo, finamente picados", "1 cucharada de sal de mesa", "1 cucharadita de semillas de cilantro molido", "¼ cucharadita de cúrcuma molida", "1 cucharada de yogur griego completo en grasa", "1 limón, solo jugo", "aceite vegetal, para freír", "Filetes de carne de cerdo a 400 g / 14 oz (6 filetes)", "Jugo de manzana claro 500ml / 18fl oz", "2 cucharadas de salsa de soja oscura", "2 cucharaditas de semillas de hinojo", "25g / 1oz de mantequilla", "2 cucharaditas de Romero fresco picado", "½ cucharadita de sal"], "method": ["Para la masa de hojaldre, en un procesador de alimentos combine la harina, la sal y 60 g / 2¼ oz de la mantequilla. Agregue 225 ml / 8 fl oz de agua y el jugo de limón y amasar hasta conseguir una masa homogénea. Cubra con film transparente y déjelo reposar en la nevera.", "Toma dos pedazos grandes de pergamino para hornear y colócalos a cada lado del bloque de mantequilla restante. Golpea el bloque de mantequilla con un rodillo en forma cuadrada hasta que quede suave y flexible. Una vez que la masa ha descansado durante unos 15 minutos, desplácela hacia un cuadrado lo suficientemente grande para que cubra la mantequilla. Selle la mantequilla en la masa y luego extiéndala en un rectángulo largo y doble la masa sobre sí misma en tercios (como doblar una letra).", "Gire la masa 90 grados, despliegue y doble nuevamente. Cubra con película adhesiva y descanse en la nevera de nuevo. Repita este proceso para dar 6 vueltas en total. Descanse la masa en la nevera de nuevo durante unos 20 minutos.", "Mientras la masa reposa, haz los rellenos. Para el pollo al cilantro, caliente un poco de aceite en una sartén a fuego medio y cocine el pollo hasta que se dore.", "Mientras tanto, ponga la cebolla, los pimientos, el cilantro, los chiles, el jengibre, el ajo y la sal en una licuadora y mezcle hasta formar una pasta.", "En otra sartén, cocine las especias molidas en un poco de aceite durante 1 minuto. Agregue el pollo y cocine por un minuto más. Agregue la pasta de cilantro y cocine durante 5-10 minutos a fuego medio. Agregue sal según sea necesario y luego termine revolviendo el yogur y el jugo de limón al gusto.", "Para el cerdo desmenuzado, caliente un poco de aceite vegetal a fuego medio y dore las costillas de cerdo en todos los lados. Agregue el jugo de manzana y la salsa de soja y cocine a fuego lento, tapado, durante 1½-2 horas a fuego medio.", "Una vez que el cerdo esté cocido y casi se esté cayendo a pedazos, déjelo enfriar en la sartén con los jugos. Retire a un plato después de 15-20 minutos y triture con sus manos o dos tenedores.", "Moler las semillas de hinojo en un almirez y mortero. Calentar la mantequilla en un wok grande a fuego medio y agregar las semillas de hinojo y el romero. Cocine por 1 minuto y luego retire la carne de cerdo de sus jugos de cocción y agréguela al wok con la sal. Freír a fuego medio durante 2-3 minutos, agregando algunos de los jugos de cocción si la carne comienza a secarse.", "Cuando se completen todos los giros, ruede la masa hasta 5 mm de grosor. Cortar los anillos con un cortador de galletas arrugadas de 5 cm / 2 pulgadas, luego, con un cortador de galletas redondas de 2½ cm / 1 pulgadas, quitar el centro. Haga 48 de estos en total.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Tome los restos de masa restante y amasarlos en una bola. Extiéndalo hasta 4 mm y corte 48 bases con el cortador de 5 cm / 2 pulgadas. Arregle en 2 bandejas para hornear forradas con pergamino para hornear. Cepille las bases con huevo lavado y pique todo con un tenedor. Coloque los anillos en la parte superior y cepíllelos nuevamente con un lavado de huevos, teniendo cuidado de no dejar que ningún lavado de huevos gotee por los lados. Hornee durante 17 minutos, o hasta que estén cocidos y dorados. Retire y reserve para enfriar.", "Ensamble los vol-au-vents colocando un poco del relleno de pollo o cerdo en cada hojaldre. Cubra el relleno de cerdo con un toque de algunos de los jugos reservados. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_coriander_chicken_and_76082", "title": "Las semillas de coriandro de pollo y hinojo y el romero sacaron los voltajes de cerdo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 48 vuelos a vientos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz de atún fresco (debe estar fresco)", "30 g / 1 oz de semillas de cilantro", "20g / ¾oz de granos de pimienta sichuan", "sal y pimienta para probar", "Brotes de soja 180g / 6oz", "20 ml / 1 cucharadita de vinagre de vino de arroz (cualquier otro es demasiado fuerte)", "40ml / 2tsp de azúcar moreno", "20g / ¾oz de albahaca tailandesa, rasgada", "20g / ¾oz de menta, rasgado", "50g / 2oz cebolleta, finamente rebanada", "60g / 2¼ oz chalotes, en rodajas finas", "20 g / ¾oz de chile en juliana (chiles rojos grandes - no demasiado calientes - en rodajas)", "20g / ¾oz de ajo / chile fritos (puede hacerse o comprar en una tienda asiática)", "Cilantro 20g / ¾oz (fresco)", "aceite de cúrcuma", "vinagre balsámico reducido", "100ml / 4fl oz de aceite de oliva", "1 cucharadita de cúrcuma (fresca o en polvo)", "100ml / 3½fl oz de vinagre balsámico"], "method": ["Enrolla el atún en semillas de cilantro trituradas y las semillas de pimienta de sichuan.", "Haga rodar el atún en una película adhesiva para mantener su forma y refrigerar durante una hora, esto evita que las semillas se caigan.", "Dorar el atún en todos los lados, mantener a temperatura ambiente, el atún debe ser rosado.", "Corta el atún en 4 pedazos.", "Para hacer los brotes de soja encurtidos, caliente el vinagre de vino de arroz y el azúcar. Vierta sobre los brotes de soja y deje enfriar.", "Para preparar el aceite de cúrcuma, caliente el aceite, agregue la cúrcuma y deje enfriar.", "Para preparar el vinagre balsámico, reduzca a la mitad calentando por aproximadamente 5 minutos.", "Para servir, mezcle los brotes de soja encurtidos con albahaca, menta, chalotes en rodajas, cebolletas y chiles / ajo fritos. Acomoda ordenadamente en cuatro placas planas.", "Coloque una pieza del atún en cada una de las placas. Adorne con cilantro, rocíe aceite de cúrcuma y vinagre balsámico reducido alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_coriandersearedtunao_10343", "title": "Atún sellado con cilantro en brotes de soja en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla, finamente rebanada", "3 vainas de cardamomo verde, aplastadas", "1 palito de canela, partido por la mitad", "Anís de 2 estrellas", "400g / 14oz de arroz basmati", "2 cucharaditas de semillas de comino", "4 cucharaditas de semillas de cilantro", "50ml / 2fl oz de aceite de girasol", "1 cebolla pequeña, finamente picada", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de cúrcuma", "1 palo de canela, roto", "3 dientes de ajo picados", "1 chile rojo, sin semillas y finamente picado", "2cm / ½ en jengibre fresco", "1 mango, finamente cortado en cubitos", "100g / 3½oz de coco fresco, rallado", "Leche de coco 400ml / 14fl oz", "Filetes de pescado blanco de 800 g / 1 lb 12 oz, deshuesados, sin piel, cortados en cubitos", "4 cucharaditas de pasta de tamarindo", "4 cucharadas de cilantro fresco finamente picado", "1 cucharadita de cúrcuma", "1 cucharadita de curry en polvo", "4 cucharaditas de cilantro fresco finamente picado", "1 cucharadita de sal", "Harina normal de 200g / 7oz", "100g / 3½oz de mantequilla o ghee, derretida"], "method": ["Para el arroz pilaf, caliente el aceite en una cacerola grande y, una vez caliente, agregue la cebolla. Cocine hasta que las cebollas estén doradas, esto tomará aproximadamente 10 minutos.", "Agregue el cardamomo, la canela y el anís estrellado. Agregue el arroz y revuelva para cubrir con la mezcla de especias de cebolla. Agregue 600ml / 21fl oz de agua y lleve a ebullición, reduzca el fuego a bajo y cubra con una tapa. Cocine por 15 minutos, luego apague el fuego, dejando la tapa puesta, y deje que hierva durante otros 15 minutos.", "Para el curry, caliente una sartén pequeña y agregue las semillas de comino y cilantro y cocínelas hasta que empiecen a reventar. Retire de la sartén, transfiera a un almirez y mortero y machaque las semillas hasta obtener un polvo grueso.", "En una sartén grande, caliente el aceite de girasol. Cuando esté caliente, agregue las cebollas y fría por 4-5 minutos, o hasta que estén doradas. Agregue todas las especias (incluidas las del almirez y el mortero), el ajo, el chile, el jengibre, el mango y el coco fresco y cocínelas durante 2 a 3 minutos, luego agregue la leche de coco y deje que hierva.", "Agregue el pescado y cocine por 2-3 minutos.", "Para finalizar, agregue la pasta de tamarindo y el cilantro y cocine a fuego lento durante 1-2 minutos.", "Método para las bolas planas de cilantro, mezcle la cúrcuma, el polvo de curry, el cilantro, la sal, la harina y en un recipiente, agregue suficiente agua para crear una masa suave.", "Amasar con las manos enharinadas y extender sobre una superficie enharinada hasta que quede delgada. Cortar en formas rústicas y luego freír en una sartén caliente con mantequilla durante 4-5 minutos por cada lado o hasta que estén doradas.", "Sirva el curry y el arroz en tazones para servir poco profundos y coloque los panes planos en un lado."], "url": "www_bbc_co_uk_food_recipes_coriander_fish_curry_68807", "title": "Curry de pescado al cilantro con arroz pilaf y panes al cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos grandes de pollo", "2 cucharadas de yogurt natural", "1 lima, jugo y ralladura", "1 cucharadita de miel", "¼ cucharadita de pimentón ahumado", "4 maíz dulce en la mazorca con cáscaras en", "4 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "3 dientes de ajo, finamente picados", "½ cucharadita de hojas de tomillo y limón", "1 chili chipotle seco, sin semillas, finamente picado o 1 cucharadita de pasta de chipotle", "200ml / 7fl oz de jugo de manzana", "1-2 cucharadas de quinua", "½ pimiento rojo", "1 pepino, cortado en trozos de 5cm / 2in", "¼ cebolla roja pequeña", "1 tomate", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "½ diente de ajo", "1 lima, solo jugo", "½ puñado de menta fresca, picada", "½ puñado de cilantro fresco, picado", "½ puñado de albahaca fresca, picada"], "method": ["Coloque todos los ingredientes para el adobo en un tazón pequeño y luego mezcle bien con una cuchara. Sumerja cada pedazo de pollo en el adobo y luego colóquelo en un plato. Cubra con una película adhesiva para marinar en la nevera durante un par de horas.", "Para el tamal de maíz y quinua, retire suavemente la cáscara (hojas) de alrededor de la mazorca, asegurándose de mantenerlo entero. Con un cuchillo afilado, corte el maíz de la mazorca y mantenga las hojas a un lado.", "En una sartén, caliente el aceite de oliva y agregue las cebollas, el ajo, el tomillo limón y el chipotle finamente picado. Cocine revolviendo suavemente hasta que las cebollas obtengan un color dorado claro; en esta etapa agregue el maíz y el jugo de manzana. Cubra con una tapa y cocine a fuego lento para hervir a fuego lento.", "Después de 15 minutos, manteniendo los ingredientes en la sartén, use una batidora manual para mezclar ligeramente la mezcla: pulse 3 o 4 veces (solo lo suficiente como para comenzar a romper un poco de maíz y liberar parte del almidón). Agregue la quinua, mezcle bien, cubra con una tapa y cocine a fuego lento durante otros 10 minutos. Vierta la mezcla en un recipiente limpio, luego déjela enfriar.", "Para darle forma al tamal: corte cuatro cuerdas de cocina de 15cm / 6 pulgadas. Sobre una superficie limpia se superponen las hojas de maíz para hacer cuatro cruces. Coloque cantidades iguales de la mezcla en el medio y luego doble en el lado derecho hacia la izquierda, luego la parte superior hacia usted, luego la izquierda hacia la derecha y finalmente, la parte delantera hacia arriba para completar el paquete. Aprieta el paquete cuidadosamente con un trozo de cuerda.", "Para la salsa, caliente una sartén o una parrilla a fuego vivo. Mezcle las verduras en muy poco aceite de oliva, sazone con sal y pimienta, luego dótelas en una plancha de hierro fundido muy caliente o en una barbacoa para que se cocinen ligeramente en el exterior.", "Coloque en una licuadora, agregue el resto del aceite de oliva con un poco de sal, pimienta, ajo y jugo de limón y mezcle hasta obtener una salsa un poco gruesa. Pruebe y sazone de nuevo si es necesario.", "Precalentar una sartén o barbacoa a fuego medio-alto y asar los muslos de pollo marinados hasta que estén bien cocidos, luego dejarlos a un lado para que descanse. (Inserte una brocheta en la parte más gruesa del muslo para verificar que los jugos estén limpios). Termine en el horno si es necesario a 200C / 400F / Gas 6.", "Coloque los tamales en la plancha o barbacoa para colorear en ambos lados. Luego apague el fuego (o mueva el tamal del calor directo si está en la barbacoa) y deje que se caliente.", "Para servir, coloca la salsa en una jarra. Corta las hojas superiores de cada tamal con unas tijeras y coloca una en cada plato. Coloque un muslo de pollo al lado, espolvoree sobre las hierbas y sirva."], "url": "www_bbc_co_uk_food_recipes_corn_and_quinoa_tamale_77639", "title": "Tamal de maíz y quinoa, salsa de verduras a la parrilla y pollo marinado a la parrilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite vegetal", "3 cebollas, peladas y en rodajas", "2 hojas de laurel", "Vinagre de vino blanco 150ml / 5fl oz", "1 cucharada de salsa Worcestershire", "3 dientes de ajo, rallados", "50g / 1¾oz de azúcar moreno oscuro", "1 cucharada de anchoas saladas picadas", "100 g / 3½ oz de mantequilla, ablandada", "1 cucharadita de pimentón ahumado", "1 cucharadita de salvia seca", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de granos de pimienta negra agrietada", "1 cucharada de sal de mesa", "1 cucharadita de ajo en polvo", "4 cabezas de maíz dulce, cáscara y seda eliminado"], "method": ["Para el ketchup de cebolla quemada, caliente una cucharada de aceite en una sartén antiadherente grande a fuego alto. Agregue un puñado pequeño de las cebollas en rodajas y fría hasta que estén doradas y casi chamuscadas. Retire de la sartén con una espumadera y déjela en un bol. Repita el proceso con más aceite y más cebollas hasta que todas las cebollas estén cocidas.", "Regrese todas las cebollas cocidas a la sartén y agregue las hojas de laurel, el vinagre de vino blanco, la salsa Worcestershire, el ajo rallado y el azúcar mascabado. Llevar a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 20-25 minutos, o hasta que las cebollas se hayan suavizado. Si la mezcla comienza a engancharse en el fondo de la sartén, agrega un poco de agua.", "Retire la sartén del fuego y retire las hojas de laurel de la mezcla de ketchup. Agregue las anchoas picadas y deje que se enfríen un poco.", "Cuando la mezcla de salsa de tomate se haya enfriado un poco, transfiérala a una jarra y mezcle hasta lograr un puré suave usando una licuadora portátil (o transfiérala a un procesador de alimentos y mezcle). Agregue un poco de agua si el ketchup es demasiado espeso.", "Cuele la mezcla a través de un tamiz de malla fina, recogiendo el ketchup filtrado en un recipiente. Cubra y enfríe hasta que sea necesario.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el maíz en la mazorca, en un bol, bata la mantequilla, el pimentón ahumado, la salvia seca, los copos de chile, la pimienta negra, la sal y el ajo en polvo. Extiende la mezcla por todo el maíz, luego envuelve cada maíz en la mazorca con papel de aluminio. Coloque en una bandeja para hornear y tueste en el horno durante 20-25 minutos, o hasta que los granos de maíz estén cocidos.", "Para servir, desenvuelva el maíz en las mazorcas, colóquelo en platos para servir y sirva la salsa de tomate quemada al lado."], "url": "www_bbc_co_uk_food_recipes_corn_on_the_cob_with_88227", "title": "Maíz en la mazorca con ketchup de cebolla quemada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corn_on_the_cob_with_88227_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Masa de harina 150 g / 5½ oz (disponible en línea)", "pizca de sal", "100ml / 3½fl oz de agua fría", "1 cucharada de aceite de oliva"], "method": ["Mezcle la harina de masa y la sal en un tazón. Agregue el agua y el aceite de oliva y mezcle hasta que se logre una masa suave. (Si es demasiado pegajoso, agregue un poco más de masa harina o, si está demasiado seco, agregue una gota más de agua).", "Divida la masa en 24 bolas. Cubra y deje reposar en la nevera durante 10 minutos.", "Aplaste las bolas de masa con las manos; alternativamente, use una prensa para tortillas o enróllelas entre dos capas de película adhesiva. Aplanar a aproximadamente 3 mm de espesor.", "Para cocinar las tortillas, unte ligeramente una sartén plana o una sartén y colóquelas sobre un fuego caliente.", "Cocine las tortillas durante aproximadamente un minuto en cada lado, o hasta que estén ligeramente coloreadas."], "url": "www_bbc_co_uk_food_recipes_corn_tortilla_59257", "title": "Tortilla de maiz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 tortillas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corn_tortilla_59257_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 mazorca de maíz dulce, sin granos", "Crema doble de 200 ml / 1/4 de pinta", "pellizcar hilos de azafrán", "1 x 100 g / 3½ oz de filete de bacalao, sin piel, picada", "1 tomate, finamente picado", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "1 loncha de tocino rayado, picado y frito hasta que esté crujiente, para servir"], "method": ["Caliente el aceite en una sartén, agregue la cebolla y saltee durante 3-4 minutos, o hasta que se ablande.", "Agregue los granos de maíz dulce a la sartén y cocine durante 1-2 minutos.", "Agregue la crema, el azafrán y las piezas de bacalao y cocine a fuego lento durante 2-3 minutos, o hasta que el bacalao esté cocido.", "Agregue el tomate y el perejil, sazone bien con sal y pimienta negra recién molida y revuelva.", "Para servir, vierta la sopa de pescado en un recipiente para servir y cubra con el tocino."], "url": "www_bbc_co_uk_food_recipes_cornandcodchowderwit_86166", "title": "Sopa de maíz y bacalao con azafrán, tocino y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 375g / 13oz", "Harina de maíz 225 g / 8 oz", "1 cucharadita de sal", "4 cucharaditas de polvo de hornear", "110 g / 4 oz de azúcar", "Leche de 480 ml / 17 fl oz", "2 huevos de gallinas camperas", "110g / 4oz de mantequilla, derretida, más extra para engrasar", "pequeños granos de maíz dulce de estaño, escurridos (o use maíz dulce fresco)"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase el molde para hornear cuadrado de 23cm / 9in con mantequilla derretida.", "En un tazón grande, combine todos los ingredientes, excepto los granos de maíz dulce. Mezcle hasta que tenga la consistencia de una masa de bizcocho, luego agregue el maíz dulce.", "Revuelva para combinarlo completamente, luego viértalo en el molde para hornear preparado. Hornee por unos 20 minutos en la parte superior del horno. (Alternativamente, puede hornear estos en una bandeja para muffins llena de cajas de papel).", "El pan de maíz está listo cuando tiene un color dorado y es elástico al tacto. Deje que se enfríe un poco antes de cortar."], "url": "www_bbc_co_uk_food_recipes_cornbread_86386", "title": "pan de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornbread_86386_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "½ 326 g / 11½ oz puede maíz dulce, enjuagado y drenado", "100ml / 3½fl oz salsa de queso lista para usar", "50ml / 2fl oz de vino blanco", "100 ml / 3", "1 diente de ajo, aplastado", "100 ml / 3½ fl oz de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras adecuado)", "½ limón, solo ralladura", "2 cebollas tiernas, finamente picadas", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola y agregue el maíz dulce, revolviendo para cubrir.", "Agregue la salsa de queso, el vino, la crema, el ajo, el caldo, la ralladura de limón, las cebolletas y el cebollín a la sartén y sazone al gusto con sal y pimienta negra recién molida.", "Ponga el mezclador a fuego lento, cocine por 3-4 minutos, luego vierta en un tazón."], "url": "www_bbc_co_uk_food_recipes_cornchowder_84186", "title": "Sopa de dulce de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½ oz de harina de auto crianza", "100g / 3½ oz de polenta media", "2 cucharaditas de polvo de hornear", "1 limón, ralladura y jugo", "1 cucharadita de pimienta de cayena", "200-225ml / 7-8fl oz de agua", "1 diente de ajo, pelado, aplastado", "sal y pimienta negra recién molida", "250ml / 9fl oz de aceite vegetal", "2-3 cucharadas de aceite vegetal", "1 cebolla roja, pelada, picada", "2 tallos de apio, cortados, finamente picados", "1 diente de ajo, pelado, aplastado", "1 cucharadita de pimienta blanca molida", "1 cucharadita de hojas secas de tomillo", "1 cucharadita de hojas secas de orégano", "pizca de cayena", "440 g / 1 libra de tomates picados en conserva", "125ml / 4½fl oz de caldo de verduras", "200g / 7oz de alubias en conserva, escurridas, enjuagadas", "Habas de mantequilla enlatadas 200g / 7oz, escurridas, enjuagadas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pan de maíz, mezcle bien la harina, la polenta, el polvo de hornear, la ralladura de limón y la pimienta de cayena en un tazón hasta que estén bien combinados. Poco a poco agregue el agua en una corriente delgada, revolviendo bien hasta que la mezcla se una como una pasta espesa (puede que no necesite usar toda el agua). Agregue el jugo de limón y el ajo y sazone, al gusto, con sal y pimienta negra recién molida.", "Caliente la mitad del aceite en una sartén para horno de 20-25 cm / 8-10 pulgadas a fuego medio a alto. Cuando el aceite esté humeando, vierta la mezcla de pan de maíz. Freír durante 4-5 minutos en cada lado, o hasta que comience a fraguar.", "Rocíe el aceite restante sobre el pan de maíz, luego transfiera la sartén al horno y continúe cocinando por otros 4-5 minutos, o hasta que esté dorado en la parte superior y cocido. Retire de la sartén y deje a un lado para que se enfríe un poco.", "Mientras tanto, para el aderezo, caliente el aceite en una sartén a fuego medio. Agregue la cebolla, el apio y el ajo y fría por 4-5 minutos, o hasta que se ablanden. Agregue las especias y las hierbas y cocine durante 1-2 minutos o hasta que estén fragantes.", "Agregue los tomates picados y el caldo y llévelo a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 5-8 minutos o hasta que espese.", "Agregue los frijoles y los frijoles con mantequilla y cocine por 3-4 minutos más, o hasta que se caliente por completo.", "Para servir, corte el pan de maíz en seis piezas de igual tamaño. Coloque uno en el centro de cada una de las seis placas para servir. Cuchara sobre la mezcla de frijoles."], "url": "www_bbc_co_uk_food_recipes_cornbreadwithspicedc_92780", "title": "Pan de maíz con frijoles estilo cajún con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Goteo de carne de res 25g / 1oz o mantequilla", "115g / 4oz de avena fina", "450 g / 1 lb de carne en conserva, picada", "Migajas de pan integral de 55 g / 2 oz", "2 cucharadas de zanahoria rallada", "300ml / ½ pinta de caldo de verduras", "sal y pimienta negra recién molida"], "method": ["Derretir el goteo en una olla caliente. Agregue la harina de avena y cocine durante 2-3 minutos y luego agregue la carne en conserva, el pan rallado y las zanahorias crudas.", "Agregue el caldo de verduras hasta que esté bien combinado.", "Engrase un cuenco con leche y una cuchara en la mezcla.", "Dobla un pedazo grande de papel de aluminio por la mitad y unta de mantequilla con mantequilla. Envuelva el pudín en la lámina engrasada, con el lado engrasado hacia el budín. (Pliegue la lámina unas cuantas veces mientras la envuelve para dejar espacio para que se expanda el budín.) Asegure la lámina al borde del cuenco del pudín con una cuerda.", "Coloque el pudín envuelto en un gran vapor. (Alternativamente, coloque el pudín envuelto en una sartén grande, vierta suficiente agua hirviendo para llegar a la mitad de los lados del lavabo, luego cubra la sartén con una tapa). Cueza al vapor el budín a fuego medio durante 1 hora y 30 minutos, o hasta que esté cocido, rellenando el vaporizador con agua hirviendo según sea necesario. (Nota: El budín se cuece cuando una brocheta insertada en el centro sale limpia)."], "url": "www_bbc_co_uk_food_recipes_corned_beef_and_oatmeal_07769", "title": "Carne en conserva y pudín de avena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "1 cucharada de aceite de girasol", "1 cebolla grande, en rodajas o picada", "2 palitos de apio, recortados, pelados para eliminar trozos fibrosos, cortados", "2 zanahorias medianas, cortadas en dados de 1 cm / ½ pulgadas", "Papas de 300 g / 10½ oz, preferiblemente Maris Pipers, peladas y cortadas en dados de 1 cm / ½ pulgadas", "2 cucharadas de ketchup de tomate", "1 x 340 g / 11¾oz puede carne en conserva", "pimienta negra recién molida", "Harina normal de 300 g / 10½ oz, más extra para enrollar", "buena pizca de sal marina", "175g / 6oz de mantequilla fría, en cubos", "1 huevo de gallinas camperas"], "method": ["Para el relleno, derrita la mantequilla con el aceite en una sartén antiadherente grande. Agregue la cebolla, el apio, las zanahorias y las papas. Cocine a fuego lento durante unos 15 minutos hasta que las verduras se suavicen y comiencen a colorearse, revolviendo regularmente. Las zanahorias deben retener un poco de mordida.", "Agregue el ketchup y revuelva en las verduras durante unos segundos antes de agregar la carne en conserva. Rompa la carne en trozos gruesos con una cuchara de madera y mezcle con los vegetales.", "Sazonar con pimienta - no necesita sal ya que la carne en conserva es bastante salada - y retirar del fuego. Deja enfriar por unos 20 minutos.", "Precalentar el horno a 190C / 375F / Gas 5.", "Para hacer la masa, poner la harina, la sal y la mantequilla en un procesador de alimentos y pulsar hasta que la mezcla se asemeje a pan rallado.", "Batir ligeramente el huevo con una cucharada de agua fría en un tazón pequeño. Lentamente vierta todos menos una cucharada de la mezcla de huevo en el procesador de alimentos con el motor funcionando y mezcle hasta que la mezcla comience a formar una bola.", "Coloque los pasteles en una superficie de trabajo bien enharinada y combínelos en una bola. Tome aproximadamente un tercio de la masa, extiéndala y úsela para revestir un plato circular de 23 cm / 9 pulgadas o un plato de quiche de cerámica redondo de 20 cm / 8 pulgadas o una lata de sándwich Victoria profunda. Deje cualquier exceso de hojaldre que sobresalga por el borde. Cepille ligeramente el borde de la pastelería con el huevo reservado.", "Coloque el relleno en la base de la masa y extiéndalo de manera uniforme. Harina la superficie una vez más y extender la masa restante. Levante la masa enrollada sobre el rodillo y colóquela suavemente sobre el relleno. Presione los bordes firmemente juntos y luego recorte bien. Selle el borde con un tenedor.", "Cepille la parte superior de la masa con el huevo batido restante, corte una cruz en el centro del pastel y colóquelo en una bandeja para hornear. Hornee durante aproximadamente 40 minutos o hasta que la masa esté dorada y el relleno esté bien caliente."], "url": "www_bbc_co_uk_food_recipes_corned_beef_and_onion_91401", "title": "Pastel de carne en conserva y cebolla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corned_beef_and_onion_91401_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal", "10 cebollas en rodajas", "Patatas blancas harinosas de 7kg / 15lb 4oz, hervidas y picadas en cubos", "10 x 340g / 12oz latas de carne en conserva, cortada en cubos", "150ml / 5fl oz salsa Worcestershire", "pequeño racimo de perejil rizado, picado", "sal marina y pimienta negra recién molida"], "method": ["Derrita la mantequilla en las sartenes hasta que haga espuma y fríela suavemente durante 2-3 minutos, o hasta que se ablande.", "Agregue las papas y la carne en conserva y fría por 5-6 minutos, presionando la mezcla de vez en cuando con una lonja de pescado, hasta que la mezcla esté dorada y crujiente.", "Cuando el hash de carne en conserva esté cocido, retire la sartén del fuego, espolvoree la salsa Worcestershire y el perejil y sazone al gusto con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_00708", "title": "Hash de carne en conserva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 papas harinosas, como Maris Piper, peladas y cortadas en cubitos", "aceite vegetal, para freír", "Harina normal de 100 g / 3½ oz", "1 cucharada de azúcar en polvo", "pizca de sal", "2 cucharadas de vinagre de sidra", "150-200ml / 5-7fl oz de cerveza o lager", "2 cebollas, 1 corte en rebanadas de 1cm / ½ pulgada, 1 picada", "50g / 1¾oz de mantequilla", "1 diente de ajo, aplastado", "4 tomates maduros, 2 picados, 2 rebanados", "1 x 340 g de carne en conserva de lata, picada", "1 cucharada de salsa Worcestershire", "4-5 gotas Tabasco"], "method": ["Llevar las papas a ebullición en una sartén de agua con sal. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento las patatas durante 8-10 minutos, o hasta que estén tiernas. Escurrir bien y dejar reposar.", "Mientras tanto, caliente el aceite en una freidora a 190C. Alternativamente, caliente el aceite en una olla profunda de base pesada, hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Bata la harina, el azúcar, la sal, el vinagre y la mitad de la cerveza en un tazón grande hasta obtener una mezcla espesa y suave. Continúe agregando la cerveza un poco a la vez hasta que la mezcla tenga la consistencia de crema doble (es posible que no necesite usar toda la cerveza).", "Separe las rebanadas de cebolla en anillos y sumérjalas en la mezcla hasta que estén completamente cubiertas. Baje con cuidado los aros de cebolla, en tandas, en el aceite caliente y fría durante 3-4 minutos, o hasta que estén dorados y cocidos. Retirar del aceite caliente y reservar para escurrir sobre papel de cocina. Repita el proceso con los anillos de cebolla restantes.", "Caliente la mitad de la mantequilla en una sartén a fuego medio y agregue la cebolla picada. Freír por 2-3 minutos, o hasta que se ablanden.", "Agregue la mantequilla restante a la sartén, agregue el ajo y las papas drenados y continúe freír durante 2-3 minutos.", "Agregue los tomates picados y la carne en conserva y saltee durante 1-2 minutos, o hasta que los tomates se hayan ablandado y la carne en conserva se haya calentado. Agregue la salsa Worcestershire y Tabasco y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, cuchara el hash de carne en conserva en platos para servir. Apila los aros de cebolla en la parte superior. Adornar con los tomates en rodajas."], "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_with_09807", "title": "Hash de carne en conserva con aros de cebolla maltratados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de 500 g / 1 libra y 2 onzas, peladas y cortadas en trozos de tamaño similar", "3 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada", "1 x 200 g / 7 oz de carne en conserva de lata, en cubitos", "1-2 cucharaditas de mostaza inglesa, al gusto", "4 huevos", "sal y pimienta negra"], "method": ["Cocine las papas peladas y picadas en una cacerola de agua hirviendo con sal durante 8-10 minutos o hasta que estén tiernas. Una vez que esté tierna, escurra y reserve.", "Mientras tanto, caliente una cucharada de aceite de oliva en una sartén antiadherente grande. Cocine la cebolla con una pizca de sal a fuego medio durante unos cinco minutos, o hasta que se ablande y se ponga dorada. Una vez que las cebollas estén cocidas, empújalas al borde de la sartén.", "Agregue un poco más de aceite a la sartén y luego agregue las papas, triturándolas aproximadamente con la parte posterior de un tenedor. Extiéndalos para que cubran la base de la sartén y deje que se cocinen durante 4-5 minutos, o hasta que se empiece a formar una costra dorada en la base. Gire y repita hasta que todos los lados de las papas estén dorados. Mezcle con las cebollas en el borde de la sartén.", "Agregue la carne en conserva y la mostaza inglesa al gusto y revuelva para mezclar bien. Continúe cocinando a fuego lento mientras prepara los huevos.", "Agregue el aceite de oliva restante a una sartén por separado. Una vez caliente, agregue los huevos y fría hasta que el blanco esté bien cocido, pero la yema todavía se está mojando.", "Sirva el hash dividido entre platos para servir con un huevo encima y coma de inmediato."], "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_with_90754", "title": "Hash de carne en conserva con huevo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "pizca de sal", "75g / 2½oz de mantequilla fría sin sal, cortada en aproximadamente 1cm / ½ en dados", "75 g / 2½ oz de manteca de cerdo, cortado en aproximadamente 1 cm / ½ en dados", "huevo batido, para terminar", "1 cucharada de aceite vegetal o de girasol", "1 cebolla mediana picada", "1 zanahoria grande, pelada y cortada en cubitos", "2 palitos de apio, cortados en cubitos", "1 papa grande, aproximadamente 250 g / 9 oz, como Desiree, pelada y cortada en dados de 1cm / ½ en", "Carne en conserva de hojalata de 340g / 12oz, quebrada en trozos grandes", "splash salsa Hendersons Relish o Worcestershire", "250 m / 9 fl oz de caldo de carne oscura", "1 cucharada de perejil picado", "sal y pimienta blanca"], "method": ["Para hacer la masa, poner la harina en un tazón y mezclar la sal. Agregue la mantequilla y la manteca de cerdo y frote en la harina con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o mezclador y luego transfiéralo a un tazón.", "Usando un cuchillo de mesa, trabaje con suficiente agua fría para unir la masa (4-6 cucharadas). Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la masa en una película adhesiva y colóquela en la nevera para que descanse mientras realiza el llenado.", "Caliente el aceite en una sartén grande a fuego medio-bajo. Agregue la cebolla, la zanahoria y el apio y cocine suavemente durante 5-10 minutos, o hasta que estén suaves pero no coloreados.", "Agregue la papa y cocine por otros cinco minutos. Agregue la carne en conserva, asegurándose de que esté distribuida uniformemente.", "Agregue la salsa embotellada, vierta sobre el caldo y llévela a ebullición. Baje el fuego y cocine a fuego lento, sin tapar, durante 20 minutos más o menos, hasta que las zanahorias y las papas estén tiernas y la mayor parte del líquido se haya evaporado.", "Pruebe y agregue sal y pimienta si es necesario, luego hágalo en un bol y deje que se enfríe por completo.", "Precaliente el horno a 200C / 400F / Gas 6 y tenga listo un plato de metal de 23 cm / 9 in.", "Divida la masa en dos partes: aproximadamente dos tercios y un tercio. Enharine ligeramente la superficie de trabajo y extienda la pieza más grande a un grosor de 2-3 mm. Úselo para alinear el plato de pastel. Estirar el pastel restante listo para formar la tapa.", "Revuelva el perejil picado en el relleno. Vierta el relleno en el plato cubierto de hojaldre (si está muy mojado, mantenga parte del líquido para servir como salsa). Cepille los bordes de la masa en el plato con un poco de huevo batido, luego cubra el pastel con la tapa de la pastelería.", "Engarce los bordes con un tenedor o con los dedos, luego recorte el exceso de pastelería. Cepíllese con huevo batido y haga un par de agujeros en la parte superior para dejar salir el vapor. Hornee durante 30-35 minutos hasta que estén doradas. Deje reposar durante 15-20 minutos antes de cortar."], "url": "www_bbc_co_uk_food_recipes_corned_beef_plate_pie_41244", "title": "Pastel de placa de carne en conserva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corned_beef_plate_pie_41244_16x9.jpg", "isVegetarian": false, "recommendations": 0}]