[{"isVegetarian": false, "title": "Bacon butty and brown sauce", "url": "www_bbc_co_uk_food_recipes_baconbuttyandbrownsa_91737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1½lb strong bread flour, plus extra for dusting", "1 tsp dried yeast", "1 tsp sugar", "400ml/14fl oz warm water", "1 tsp salt", "1 tbsp vegetable oil", "4 shallots, peeled, finely chopped", "4 fresh tomatoes, chopped", "75g/2½oz dates, chopped", "50ml/2fl oz ready-made tamarind sauce", "1 tsp ground ginger", "4 cloves", "4 black peppercorns", "pinch ground turmeric", "pinch cayenne pepper", "pinch ground coriander", "200ml/7fl oz water", "700ml/1 pint 5fl oz malt vinegar", "1 tbsp mustard powder", "2 tbsp molasses", "pinch salt", "2 tbsp muscovado sugar", "2 tbsp cornflour, mixed with enough water to form a loose paste", "30 slices thick-cut smoked back bacon, grilled", "butter, for spreading"], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly oil and flour two 450g/1lb loaf tins.", "For the bread, sift the flour, yeast and sugar into a large bowl. Gradually add the water, mixing gently as you go, until the mixture comes together to form a dough (you may not need all of the water). ", "Knead the dough on a lightly floured work surface for 3-5 minutes, or until the dough feels smooth and elastic. Place the dough back into the bowl and cover with a damp tea towel. Leave in a warm, dry place for two hours. ", "Add the salt to the dough, then knead for 2-3 more minutes, or until smooth and elastic. Cut into two oblong loaves, then place each piece into a prepared loaf tin. Cover with a damp tea towel again and leave to rest in a warm, dry place for one hour. Meanwhile, preheat the oven to 220C/430F/Gas 7. ", "Bake the two loaves for 30-40 minutes, or until golden-brown and cooked through. (The bread will sound hollow when it is tapped on the bottom.) Remove from the oven and set aside to cool. ", "For the brown sauce, heat the oil in a non-reactive pan and gently fry the shallots for 4-5 minutes, or until softened but not coloured. Add the tomatoes, dates, tamarind sauce, ginger, cloves, peppercorns, turmeric, cayenne pepper, ground coriander and water. Bring to boil, then reduce the heat and simmer for ten minutes.", "Transfer the mixture to a food processor and blend until smooth. Pass the mixture through a very fine sieve into a clean, non-reactive pan and bring to the boil. Stir in the malt vinegar, mustard powder, molasses, salt and muscovado sugar. Whisk well and boil for 4-5 minutes. ", "Reduce the heat, then stir in the cornflour paste and cook for a further minute, or until the sauce is thickened. Set aside to cool slightly. (The sauce can be cooled and stored in an airtight bottle for up to three weeks in the fridge.)", "To serve, thickly slice the bread and butter each slice. Place three slices of cooked bacon in between two slices of bread, with dollops of brown sauce on top of the bacon. Serve immediately."]}, {"isVegetarian": false, "title": "Bacon-wrapped cheese stuffed chicken with fresh herbed pasta and sautéed broccoli", "url": "www_bbc_co_uk_food_recipes_baconwrappedcheesech_87168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 boneless chicken thigh, skin removed, boned", "55g/2oz cheddar cheese, sliced", "3 rashers bacon", "freshly ground black pepper", "1 tbsp olive oil", "250ml/9fl oz double cream", "1 garlic clove, crushed", "handful each fresh chives, dill, parsley, chopped", "salt and freshly ground black pepper", "125g/4½oz pasta bows, cooked according to packet instructions", "1 tbsp olive oil", "25g/1oz butter", "½ head broccoli, cut into florets", "splash water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the chicken, stuff the chicken thigh with the cheese slices and season with salt and freshly ground black pepper.", "Wrap the chicken in bacon rashers. Secure with a wooden skewer. ", "Heat the olive oil in an ovenproof frying pan, add the chicken and cook until it is brown on all sides. Place the frying pan into the oven and cook for 12 minutes, or until the chicken is cooked through.", "For the pasta, put the cream and garlic into a saucepan and bring to the boil. As soon as it boils, remove from the heat, stir in the herbs and season, to taste, with salt and freshly ground black pepper. Add the cooked pasta and stir well.", "For the broccoli, heat the olive oil and butter in a frying pan, add the broccoli and a splash of water and sauté for three minutes. ", "To serve, pile the pasta onto a serving plate or bowl, slice the chicken thigh into 3-4 vertical slices and place on top of the pasta. Serve with the sautéed broccoli on the side."]}, {"isVegetarian": false, "title": "Bacon sandwich", "url": "www_bbc_co_uk_food_recipes_baconsandwich_82114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 slices crusty white bread", "2 slices prosciutto", "2 tomatoes, halved", "salt and freshly ground black pepper", "olive oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the olive oil over the bread. Heat a griddle pan until hot, add the bread slices and griddle for two minutes on each side.", "Remove from the pan and then griddle the prosciutto until crispy. Remove.", "Add the tomatoes to the grill pan and cook until soft.", "To serve, put the prosciutto onto one slice of griddled bread, top with the tomatoes, season well with salt and freshly ground black pepper, drizzle with olive oil and place the other griddled slice of bread on top."]}, {"isVegetarian": false, "title": "Bacon-wrapped chicken with cheese and potato tower", "url": "www_bbc_co_uk_food_recipes_baconwrappedchickenw_84124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast", "25g/1oz Wensleydale cheese, chopped", "100g/3½oz streaky bacon", "1 tbsp olive oil, plus extra to grease", "½ potato, peeled and thinly sliced", "25g/1oz Wensleydale cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Using a sharp knife, cut a pocket halfway into the chicken breast. Stuff the cheese into the pocket and wrap the chicken in the streaky bacon, to seal up the pocket.", "Heat an ovenproof frying pan and, when hot, add the wrapped chicken breast and fry for two minutes on each side, until the bacon is golden but not crisp. Transfer to the oven and cook for five minutes, or until completely cooked through. (You will know the chicken is cooked when if pierced the juices run clear.)", "To make the potato tower, place a 5cm/2in greased chefs' ring onto a clean work surface. Add alternate layers of potato and cheese, seasoning well with salt and freshly ground black pepper between each layer.", "Heat the oil in an ovenproof frying pan over a medium heat. Carefully lift the chefs' ring and add to the pan. Cook for two minutes on each side, then transfer to the oven and bake for 12 minutes.", "To serve, push the potato and cheese tower out of the chefs' ring onto a plate and serve the chicken alongside."]}, {"isVegetarian": false, "title": "Bacon, mozzarella, and mushroom pizza", "url": "www_bbc_co_uk_food_recipes_baconmozzarellaandmu_80090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour", "50ml/2fl oz water", "2 tbsp olive oil", "pinch salt", "1 tin plum tomatoes", "3 tbsp olive oil", "1 garlic clove, finely chopped", "25g/1oz parsley chopped", "25g/1oz basil chopped", "salt and freshly ground black pepper", "50g/1¾oz crispy fried bacon lardons", "50g/1¾oz smoked mozzarella ripped", "50g/1¾oz marinated mushrooms"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the base, in a large bowl mix the flour, water, oil and salt to form a dough.", "Dust your hands with flour and shape the dough into a ball. Roll out on a floured surface into an 20cm/8in round.", "Heat a small frying pan and cook for two minutes on each side.", "To make the tomato sauce, place the tomatoes, olive oil and garlic in a saucepan. ", "Simmer until thick, then stir in the herbs. Season with salt and freshly ground black pepper.", "Spread some of the tomato sauce on the pizza. Sprinkle over the bacon, mushrooms and cheese, and season with salt and freshly ground black pepper.", "Bake in the oven for five minutes until the cheese has melted."]}, {"isVegetarian": false, "title": "Bacon-wrapped pigeon stuffed with orange zest with roasted tomatoes and citrus salad", "url": "www_bbc_co_uk_food_recipes_baconwrappedpigeonst_88925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pigeon breasts", "1 orange, zest only", "1 tbsp chopped fresh rosemary", "4 smoked streaky bacon rashers", "1 tbsp olive oil", "7 vine cherry tomatoes ", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 orange, peeled and segmented", "½ lemon, peeled and segmented", "1 tbsp chopped fresh chervil", "6 fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pigeon, lay out the bacon rashers side-by-side on a chopping board. Flatten out the pigeon breasts with a meat mallet or rolling pin, and place side by side across the bacon. Scatter over the orange zest and rosemary, then roll up tightly with the bacon on the outside.", "Heat the olive oil in a frying pan and fry the breasts for 6-8 minutes, until golden-brown all over and cooked through. Remove from the heat and set aside to rest, then slice in half.", "For the roasted tomatoes, place the tomatoes in an ovenproof frying pan and drizzle over the olive oil. Heat until the oil starts to sizzle, then season with salt and freshly ground black pepper and transfer to the oven to roast for 6-7 minutes, until softened.", "For the citrus salad, combine all the salad ingredients together in a bowl and mix gently to combine. ", "To serve, pile the citrus salad onto a serving plate and place the sliced pigeon on top. Arrange the roasted cherry tomatoes on the side and serve."]}, {"isVegetarian": false, "title": "Bacon sandwich", "url": "www_bbc_co_uk_food_recipes_baconsandwich_81145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/2oz streaky bacon", "25g/1oz unsalted butter, softened", "2 slices thick-cut white farmhouse loaf", "salt and freshly ground black pepper", "1 tbsp tomato ketchup"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Fry the bacon rashers until crisp and golden on both sides.", "Spread the butter on the bread slices, then place the bacon on the bread. Sandwich together and season with salt and freshly ground black pepper. Cut into triangles on a chopping board.", "Serve on a plate with a dollop of ketchup to the side."]}, {"isVegetarian": true, "title": "Bagels", "url": "www_bbc_co_uk_food_recipes_bagels_47163", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bagels_47163_16x9.jpg", "ingredients": ["450g/1lb strong bread flour, plus extra for dusting", "2 tsp salt", "7g sachet fast-acting yeast", "2 tbsp clear honey", "1 tbsp vegetable oil, plus extra for greasing", "3 tbsp black treacle or molasses", "fine polenta, for sprinkling", "1 free-range egg, beaten", "sesame seeds, sea salt, poppy seeds, or a savoury topping of your choice (optional)"], "serves": "Serves 7", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl, then add the yeast and mix well.", "Measure 250ml/9fl oz warm water in a measuring jug and then stir in the honey and oil.", "Make a well in the centre of the flour and pour the liquid in gradually, bringing the dough together with your hands.", "Turn the dough out onto a clean, dry and floured work surface. Start kneading the dough, stretching it away with the palm of one hand and folding it back again with the other. Knead for approximately 10 minutes, adding more flour if the dough becomes too sticky. Continue kneading until the dough is firm and elastic.", "Shape the dough into a large ball and place in a lightly oiled, large bowl. Turn the dough in the oil to coat. Cover with cling film or a plastic bag and put in a warm, dry place for 1–3 hours, or until the dough has doubled in size.", "When the dough has proved, bring a large saucepan of water to the boil and add the treacle or molasses. Cover and turn off the heat.", "Lightly oil two baking trays and sprinkle with polenta. Remove the dough from the bowl, then punch it down and knead it briefly. Roll it into a rough sausage shape and divide into seven equal chunks. As you work with one chunk, keep the others covered with a clean tea towel.", "Firmly roll out each chunk into a long, slender sausage shape. Bring the ends together, splash the ends with a tiny bit of water and squeeze them together to seal. Place on the prepared baking trays and repeat with the remaining the dough.", "Cover and set aside to prove for a further 10–20 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Bring the saucepan of molasses and water back to a gentle simmer. Gently drop each bagel into the water (do this in batches of no more than three at a time) and turn over after 1-2 minutes. Simmer for another 1-2 minutes, then remove the bagels from the water, and drain.", "Place the bagels on the prepared baking trays, spacing them widely apart. Brush the tops with the beaten egg and sprinkle with sesame seeds, sea salt, poppy seeds or a savoury topping of your choice. Bake in the oven for 15 minutes, or until golden-brown, then turn them upside down for a further ten minutes to cook the bases. Transfer to a wire rack to cool before serving."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_79923", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz extra virgin olive oil", "4-5 cloves of garlic, peeled and crushed", "12 anchovies preserved in olive oil, drained and chopped", "120g/4oz unsalted butter, cut into cubes", "Selection of raw vegetables such as fennel, cauliflower, endive, celery, peppers and courgettes, cut into bite-sized pieces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the olive oil in a pan with the garlic and anchovies and stir over a low heat for a few minutes.", "Whisk in 90g of the butter, and as soon as it has melted, remove from the heat and whisk a few more times so that everything is creamy and amalgamated.", "Taste, and if you feel you want this dipping sauce, which is meant to be pungent but not acrid, a little more mellow, then whisk in two more tablespoons of butter.", "Pour into a fondue dish over a flame or just serve in a very warm bowl.", "Serve with the vegetable crudités for dipping."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_81861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "¼ red onion, finely sliced", "150g/5½oz anchovy fillets in olive oil, chopped", "200g/7oz tinned flageolet beans, drained", "150ml/¼ pint vegetable stock", "1 tbsp double cream", "2 slices crusty white bread, crusts removed and cubed", "1 tbsp chopped fresh parsley, for garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon olive oil in a medium saucepan, add the red onion and anchovy fillets and sauté for three minutes. ", "Add the beans and vegetable stock and cook for two minutes. Stir in the double cream and heat for one minute. ", "Remove from the heat and blend with a hand blender until smooth.  Set aside.", "To make the croutons, roll the cubed bread in two tablespoons olive oil, season well and fry for three minutes or until golden brown. Drain on kitchen paper.", "To serve, pour the hot soup into a bowl and sprinkle over the croutons and chopped parsley."]}, {"isVegetarian": true, "title": "Baguettes", "url": "www_bbc_co_uk_food_recipes_baguettes_11543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baguettes_11543_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "5g/¼oz salt", "5g/¼oz fast action dried yeast", "30ml/1fl oz olive oil, plus extra for oiling", "180ml/6fl oz water"], "serves": "Makes 2 small baguettes", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, salt, yeast, olive oil and most of the water in a food mixer with a dough hook attached, taking care not to let the yeast touch the salt until you begin mixing. ", "Start mixing on a slow speed, gradually adding the rest of the water until you have a smooth dough.  This should take about five minutes.", "Tip the dough into an oiled bowl, cover and leave the dough to prove for two hours.", "Tip the dough out onto an oiled surface. Dust your hands in a little flour and divide the dough in two.", "Knock back the dough and stretch and fold, and then roll the dough into a baguette shape.", "Place on a baguette tray or a large baking tray, cover and leave to prove until it has doubled in size. ", "Heat a roasting dish in the bottom of the oven and pour in some water to create some steam (this will help form the crust). Preheat the oven to 220C/425F/Gas 7 in a non-fan oven.", "Just before baking, slash the top of each baguette three times. ", "Bake the baguettes for 30 minutes. Then drop the temperature to 200C/400G/Gas 6 and cook for 10 minutes. The baked baguettes should be golden-brown and have a slight sheen to them. "]}, {"isVegetarian": true, "title": "Irish cream and chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_baileysandchocolatec_72293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileysandchocolatec_72293_16x9.jpg", "ingredients": ["100g/3½oz butter", "250g/8¾oz digestive biscuits, crushed", "600g/1lb 5oz cream cheese", "25ml/1fl oz Baileys or other Irish cream liqueur", "100ml/3½oz icing sugar", "300ml/10½oz double cream, whipped", "100g/3½oz grated chocolate", "200ml/7¼oz double cream, whipped", "cocoa powder, to dust"], "serves": "Makes 1", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a pan and add the crushed digestive biscuits. Mix well until the biscuits have absorbed all the butter. ", "Remove from the heat and press into the bottom of a lined 18cm/7in springform tin. Place in the refrigerator and allow to set for one hour.", "Meanwhile, prepare the filling. Lightly whip the cream cheese then beat in the Irish cream and icing sugar. Fold in the whipped cream and grated chocolate. When smooth, spoon evenly onto the biscuits. ", "Refrigerate and allow to set for a further two hours. Once set, remove and decorate with whipped cream and cocoa powder dusted over the top. Serve."]}, {"isVegetarian": true, "title": "Baked Alaska", "url": "www_bbc_co_uk_food_recipes_baked_alaska_96104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint double cream", "300ml/½ pint milk", "1 vanilla pod (soft and fresh)", "3 free-range egg yolks", "100g/3½oz caster sugar", "3 free-range egg whites", "175g/6oz caster sugar", "2-3 tbsp cherry jam", "20cm/8in circle ready-made sponge cake about 2.5cm/1in thick"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the vanilla ice cream, pour the cream and milk into a heavy-based saucepan.  Split the vanilla pod lengthways and scrape out the seeds; then add the seeds and pod to the pan. Heat the mixture until just below boiling point.  ", "Remove the pan from the heat and set aside to cool for one hour to allow the vanilla flavour to infuse into the mixture.  Remove the vanilla pod and discard.", "Whisk the egg yolks and sugar in a bowl until pale and thickened. Slowly whisk in about one-quarter of the cream mixture. Reheat the remaining cream mixture until just boiling, then slowly whisk it into the egg mixture.", "Pour the egg mixture into a clean saucepan and cook over a gentle heat, stirring continuously until the custard thickens enough to coat the back of a spoon – it must not boil.  Pour the custard into a bowl and set aside to cool, then cover and chill in the fridge overnight.", "Pour the cooled custard into an ice cream machine and churn according to the manufacturer's instructions, until thick and smooth. Spoon into a freezer container and freeze until needed.", "For the meringue, whisk the egg whites in a clean, large bowl until stiff peaks form when the whisk is removed.  Slowly whisk in the sugar, whisking well between each addition.  Continue to whisk until glossy and very stiff peaks form when the whisk is removed.", "To assemble the Alaska, spread the jam over the circle of sponge cake, then arrange scoops of ice cream in a pyramid shape on top, leaving a 1.5cm/½in border. Spoon the meringue all over the ice cream, ensuring there are no gaps, and use the back of a spoon to make a swirl pattern.", "The baked Alaska can now be frozen until needed.", "To cook the baked Alaska, preheat the oven to 200C/400F/Gas 6 and bake for 8-10 minutes, or until golden-brown all over."]}, {"isVegetarian": false, "title": "Brilliant breakfast omelette", "url": "www_bbc_co_uk_food_recipes_baileys_breakfast_24338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileys_breakfast_24338_16x9.jpg", "ingredients": ["3 free-range eggs", "1 tbsp milk", "1 tsp butter", "1 tomato, finely chopped", "2 tbsp grated cheddar", "1 tbsp finely chopped fresh parsley or 1 tsp dried parsley", "2 thin slices good-quality ham", "salt and pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Take your eggs and crack them into a bowl – don’t put them directly into the pan as you need to mix them first! Add a pinch of salt and pepper to the eggs and stir in the milk. ", "Beat the eggs with a fork, first use the fork to break the yolks of the eggs (this makes beating the eggs easier). Then tip the bowl gently and using a fork in a circular motion beat the eggs until the yolks and whites are combined and the mixture has an even colour.", "Bring your pan to a high heat and add the butter. Pour in your egg mixture and cook on a high heat for 2 minutes, making sure that the mixture is spread out evenly. Reduce the heat.", "As the egg begins to set, use a spatula to push the set egg towards the omelette centre, tilting the pan so the runny egg fills the space. Add the tomatoes and most of the cheese and parsley. Arrange the ham on top. ", "Cook the omelette for another minute, then loosen the edges with a spatula. Slide the omelette from the pan onto a warmed plate, tilting the pan so that the omelette folds nicely on the plate.", "Sprinkle with the remaining cheese and parsley, then serve."]}, {"isVegetarian": true, "title": "Baked Alaska with creamy chocolate sauce", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_creamy_40265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz caster sugar", "6 free-range egg whites", "1 small ready-made sponge flan case, cut in half horizontally to create two thinner discs (only one is needed in this recipe)", "50ml/2fl oz Armagnac", "1 x 500g/1lb 2oz tub firm vanilla ice cream (not soft-scoop)", "200g/7oz plain chocolate, roughly chopped", "200ml/7fl oz double cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked Alaska, bring 50ml/5fl oz water and the sugar to the boil in a saucepan. Keep boiling until the mixture reaches 121C on a sugar thermometer. (Caution: Hot sugar can be dangerous as it boils over very quickly. Do not leave unattended.)", "Meanwhile, whisk the egg whites in a large clean bowl, using a freestanding mixer or an electric whisk, until stiff peaks form when the whisk is removed.", "When the sugar reaches 121C, remove the pan from the heat. With the whisk or mixer running slowly, carefully pour the sugar syrup into the whisked egg whites in a thin stream, taking care not to let the hot sugar hit the beaters as it may splash. Continue to whisk until all the syrup has been incorporated into the egg whites and the mixture is glossy.", "Continue to whisk the egg white mixture at a slow speed until it has almost completely cooled (about 5 minutes).", "For the chocolate sauce, heat the chocolate with 2 tablespoons water in a saucepan over a low heat. When the chocolate has melted, add half of the cream and bring the mixture to the boil, whisking continuously.", "When the mixture is boiling, remove the pan from the heat and whisk the mixture until smooth. Whisk in the remaining cream until combined. Decant into a serving jug and set aside until needed.", "To assemble the baked Alaska, place the sponge disc onto a heatproof serving plate and drizzle the Armagnac all over it. Upturn the tub of ice cream in the centre of the sponge base and cut away the packaging.", "Spread half of the meringue mixture all over the ice cream and sponge base using a palette knife. Transfer the remaining meringue mixture to a piping bag with a star nozzle and pipe it over the top of the meringue layer to decorate.", "Using a chefs’ blow torch, heat the piped meringue all over until it caramelises to a light golden-brown. Alternatively, heat your oven to its highest setting and place the baked Alaska into the oven for a few seconds.", "Serve immediately with the chocolate sauce alongside."]}, {"isVegetarian": true, "title": "Baked Alaska with hot chocolate sauce", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_hot_20041", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_alaska_with_hot_20041_16x9.jpg", "ingredients": ["1 litre/1¾ pints vanilla, coffee or chocolate ice cream", "50g/1¾oz dark chocolate, in drops or broken into pieces", "125g/4½oz butter, softened, plus extra for greasing", "125g/4½oz caster sugar", "2 free-range eggs, beaten", "125g/4½oz self-raising flour, sifted", "3 free-range egg whites", "200g/7oz caster sugar", "pinch cream of tartar", "200ml/7fl oz double cream", "200g/7oz dark chocolate, in drops or chopped into pieces", "1–2 tbsp rum or brandy (optional)"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the base, line the pudding basin with two layers of cling film, leaving enough hanging over the edge to cover the sides of the basin. ", "Place the ice cream in the basin (you may need to allow it to soften for a few minutes, but don't let it melt) and press down to get a smooth surface , giving it a few gentle bangs to help remove any air holes.  Cover the top with the cling film and return it to the freezer.", "Preheat the oven to 180C/350F/Gas 4, butter the sides of the cake tin and line the base with a disc of baking parchment.", "Place the chocolate in a heatproof bowl set over a pan of gently simmering water. Leave until just melted, stirring occasionally, then remove from the heat and set aside.", "In a large bowl or in an electric food mixer, cream the butter until soft. Add the sugar and beat until the mixture is light and fluffy. Gradually add the eggs to the creamed butter mixture, beating all the time.", "Beat in the melted chocolate, then gently fold in the flour until combined.", "Pour the batter into the prepared cake tin and bake for 25-30 minutes, or until a wooden skewer inserted into the centre of the cake comes out clean.", "Remove the cake from the oven and turn the temperature up to 220C/425F/Gas 7 (if cooking the meringue straight away).", "Allow the cake to cool down in the tin for 10 minutes, then loosen around the edges with a small, sharp knife and carefully remove the cake. Place on a wire rack to cool down fully.", "For the meringue, in a large, spotlessly clean bowl, whisk the egg whites until they form soft peaks when the whisk is removed. ", "Add half of the caster sugar and the cream of tartar and whisk until stiff peaks form when the whisk is removed and the meringue is satiny and glossy. Fold in the remaining sugar with a metal spoon or spatula.", "For the chocolate sauce, place the cream in a saucepan and bring to the boil. Add the chocolate and stir until just melted, then add the rum or brandy (if using). Set aside until ready to serve (reheat the sauce gently if needed).", "To assemble, once the cake has cooled, place it in the middle of a baking tray (one that is completely flat, with no 'lip', so that the baked Alaska can be removed easily). ", "Take the ice cream out of the freezer. With the help of the cling film, remove the ice cream from the pudding bowl and place it upside down on the cake, remove all the cling film.", "Quickly spoon over the meringue, spreading it thickly and in peaks over the ice cream and the sides of the cake right down to the baking tray. You can cook the baked Alaska immediately or you can return it to the freezer for up to an hour (it will take an extra 3-4 minutes in the oven if cooking from frozen). ", "Place in the centre of the hot oven for 3-4 minutes or until the meringue is set on the outside and golden in colour.", "Carefully transfer the baked Alaska to a serving plate, using a palette knife dipped in hot water to help you slide and push it onto the plate.", "Serve immediately with the chocolate sauce."]}, {"isVegetarian": true, "title": "Baked almond cheesecake", "url": "www_bbc_co_uk_food_recipes_baked_almond_cheesecake_31585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz softened butter, for greasing", "40g/1½oz crunchy amaretti biscuits ", "750g/1lb 10oz ricotta cheese", "150g/5½oz caster sugar", "6 free-range eggs", "100ml/3½fl oz double cream", "1 lemon, zest only", "4 tbsp amaretto liqueur"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/ Gas 4. Grease a 24cm/9½in springform cake tin with a little butter on the base and all around the sides. (Put the base of the tin in upside down so that it will be easier to remove the cheesecake once it is ready.)", "Put the amaretti biscuits into a food processor and blend into fine crumbs. (If you don’t have a food processor, put the biscuits into a strong plastic bag and crush with a rolling pin instead.) Dust the amaretti biscuits on the bottom and the sides of the cake tin, tilting and shaking to get an even coating. Reserve some of the crumbs to sprinkle on the top of the finished cheesecake.", "Drain the ricotta cheese and put in a mixing bowl with the sugar. Using electric beaters, whisk until well combined. Gradually add the eggs, one at a time, whisking well between each addition. ", "Stir in the cream, lemon zest and the amaretto liqueur. The mixture should be very soft and light.", "Pour all the cheese mixture slowly into the prepared tin, starting in the middle to avoid disturbing the crumbs. Put on a baking tray and bake in the centre of the oven for 10 minutes. ", "Reduce the oven temperature to 160C/140C Fan/Gas 3 and cook for a further hour, or until the cheesecake is just set. Do not allow to over-brown. If the cheesecake does start to brown while it is still very wobbly, cover the tin loosely with a large piece of foil.", "When the cheesecake is ready, turn the oven off and open the door slightly. Wedge a folded tea towel or wooden spoon in the door to keep it ajar and leave the cheesecake to cool completely. This will take 3–4 hours and should prevent the top from cracking. When the cake is completely cool, transfer to the fridge and chill for at least 2 hours before removing from the tin. ", "Slide a knife around the cheesecake, taking care to retain as much of the crumb as possible, and release gently from the tin. Slide carefully off the tin base onto a serving plate and sprinkle the top with the reserved amaretti crumbs. Serve in wedges. "]}, {"isVegetarian": true, "title": "Baked Alaska with sautéed apples", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_sauted_94738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "4 medium free-range eggs", "125g/4½oz plain flour", "25g/1oz butter, melted ", "2 Bramley apples, peeled, cored, thinly sliced", "75g/2¾oz butter, melted", "4 tbsp caster sugar", "300g/10½oz caster sugar", "6 free-range egg whites", "50ml/2fl oz Calvados", "1 x 500g/1lb 2oz tub firm vanilla ice cream", "75g/2¾oz unsalted butter", "2 eating apples, peeled and sliced", "2 tbsp brandy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 23cm/9in round cake tin.", "For the génoise sponge, put the sugar and eggs in a large bowl and whisk until thick and pale. Fold in the flour and melted butter and pour into the prepared cake tin.", "Bake in the oven for 20-30 minutes, or until risen and springy to the touch. Remove from the oven and set aside to cool. When cool enough to handle, turn out on to a wire rack to cool completely.", "For the apple purée, put the apples, butter, sugar and 2 tablespoons water into a lidded pan and cover. Place over a medium heat and bring to a simmer. Cook for 3-4 minutes until the apples have become light and softened. Whisk the apples to a smooth purée, then set aside to cool.", "For the baked Alaska, bring 50ml/2fl oz water and the caster sugar to the boil in a saucepan (CAUTION: Hot sugar can be dangerous as it boils over very quickly. Do not leave unattended).", "Meanwhile, whisk the egg whites in a large clean bowl, using a freestanding mixer or an electric whisk, until stiff peaks form when the whisk is removed.", "When the sugar reaches 121C on a sugar thermometer, remove the pan from the heat. With the whisk or mixer running slowly, carefully pour the sugar syrup into the whisked egg whites in a thin stream, taking care not to let the hot sugar hit the beaters as it may splash. Continue to whisk until all the syrup has been incorporated into the egg whites and the mixture is glossy. Continue to whisk the egg white mixture at a slow speed until it has almost completely cooled (about 5 minutes).", "Cut a circle of sponge out using a plate or a cutter. Place the sponge circle on a heatproof serving plate and drizzle the calvados all over it. Spoon the apple purée on top of the sponge.", "Shape the ice cream in the centre of the sponge base. Spread half of the meringue mixture all over the ice cream and sponge base using a palette knife, making sure there aren't any gaps. Transfer the remaining meringue mixture to a piping bag fitted with a star nozzle and pipe it over the top of the meringue layer to decorate.", "Using a chefs’ blow torch, heat the piped meringue all over until it caramelises to a light golden-brown. Alternatively, heat your oven to its highest setting and place the baked Alaska into the oven for a few minutes.", "For the sautéed apples, heat a medium frying pan and add the butter, once hot add the apples and cook until golden-brown. Finish with the brandy and reduce until most of the liquid has evaporated. ", "Place the baked Alaska on a serving plate and serve the sautéed apples alongside."]}, {"isVegetarian": true, "title": "Baked apples in a semolina soufflé", "url": "www_bbc_co_uk_food_recipes_baked_apples_in_a_74612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz unsalted butter", "4 apples, such as Blenheim Orange or Chivers Delight, stalks intact ", "60g/2¼oz caster sugar", "20g/¾oz unsalted butter", "100g/3½oz caster sugar, plus extra for sprinkling", "500ml/18fl oz whole milk", "2 drops of vanilla extract", "70g/2½oz semolina", "70g/2½oz sultanas", "1 tbsp calvados (optional)", "4 free-range medium eggs, separated", "8 drops of lemon juice", "icing sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked apples, preheat the oven to 170C/150C Fan/Gas 3½. Grease a baking tray with a little butter. ", "Melt the butter. Brush the apples with the melted butter and roll in the caster sugar to coat all over. Place on the greased tray and bake in the oven for 25–30 minutes, until almost tender and still holding their shape. Set aside.", "For the soufflé, preheat the oven to 190C/170C Fan/Gas 5. ", "Melt 10g/¼oz butter. Grease the baking dish with the melted butter, then sprinkle with 20g/¾oz sugar. Wipe the rim of the dish with a damp cloth, this will stop the soufflé sticking to the rim and enable it to rise evenly.", "Pour the milk into a saucepan, add the vanilla and bring to the boil. Lower the heat and add 60g/2¼oz sugar, the semolina, sultanas and calvados (if using). Simmer for 3 minutes, or until thickened, whisking constantly to keep it smooth. Transfer to a large bowl, sprinkle with a little sugar to prevent a crust forming and let the mixture cool slightly, for 2-3 minutes.", "In a clean bowl, whisk the egg whites with the lemon juice until soft peaks form and then slowly add the remaining 20g/¾oz caster sugar, whisking constantly. Continue to whisk until stiff peaks form when the whisk is removed.", "Mix the egg yolks into the warm milk mixture, then briskly whisk in a third of the whisked egg whites. Carefully fold in the remaining egg whites using a spatula or large metal spoon. As you fold in the egg whites, delicately cut and lift the mixture to ensure there is minimum loss of volume and lightness.", "Pour the mixture into the prepared baking dish and place the baked apples in it. Dab a knob of butter on top of each apple and sprinkle caster sugar evenly over the surface of the pudding. Bake for 25 minutes or until the soufflé is risen and golden-brown. Sprinkle with icing sugar and serve."]}, {"isVegetarian": false, "title": "Baked bean soup", "url": "www_bbc_co_uk_food_recipes_baked_bean_soup_08513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2½ canned borlotti beans, drained and rinsed", "1 celery stalk, trimmed, chopped", "1 spring onion, trimmed, sliced", "50g/2oz cooked bacon, chopped", "1 garlic clove, peeled and crushed", "pinch dried chilli flakes", "25g/1oz tomato purée", "pinch stock or bouillon powder", "250ml/9fl oz water"], "serves": "Makes 2 small bowls", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Spoon the borlotti beans into a lidded ovenproof dish and squash with the back of a spoon to loosen the skins. Add the celery, spring onion, bacon pieces and garlic. Stir in the chilli flakes and the tomato purée. ", "Pour over the water, add the stock powder or bouillon and stir again until well combined. Cover the dish with the lid.", "Transfer the dish to the oven and cook for 25-30 minutes, or until the soup has thickened. Stir well before serving in soup bowls with bread and butter on the side, if desired."]}, {"isVegetarian": false, "title": "Baked beans with bubble and squeak hash browns", "url": "www_bbc_co_uk_food_recipes_baked_beans_with_bubble_72371", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_beans_with_bubble_72371_16x9.jpg", "ingredients": ["600g/1lb 5oz floury potatoes", "2–3 tbsp double cream", "30g/1oz unsalted butter", "200g/7oz pancetta, cubed", "1 large bunch fresh thyme", "300g/10½oz savoy cabbage, finely shredded", "1 large bunch flat-leaf parsley, roughly choppped", "3–4 oregano sprigs, leaves picked", "1 tbsp wholegrain mustard", "sunflower oil for frying ", "salt and freshly ground black pepper", "30g/1oz dried porcini", "1 tbsp sunflower oil", "2 tbsp unsalted butter", "400g/14oz smoked pancetta, cubed ", "10 fresh thyme sprigs", "2 fresh bay leaves", "3 fresh rosemary sprigs", "1 large white onion, finely chopped", "1 large carrot, peeled and finely chopped", "2 celery sticks, finely chopped", "3 garlic cloves, crushed", "1 cinnamon stick", "300ml/10fl oz red wine", "2 tbsp tomato purée", "1 tbsp umami paste", "50g/1¾oz light brown sugar", "500ml/18fl oz fresh beef stock ", "200ml/7fl oz passata", "1 tbsp smoked paprika", "400g tin pinto beans ", "400g tin haricot beans", "large handful fresh flat-leaf parsley, roughly chopped", "3 sprigs oregano, leaves picked", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the hash browns, bring a large pan of salted water to the boil and cook the potatoes for 15–20 minutes, or until tender. Drain and roughly mash with the cream. Season and set aside.", "Place a frying pan over a medium heat and add the butter. Fry the pancetta and thyme until crispy. Remove with a slotted spoon and add to the mash. ", "Add the cabbage to the same pan with a dash water, cover and cook for 2–3 minutes, or until the cabbage is just tender. Stir into the mash with the herbs and mustard. Season, leave to cool completely and then refrigerate. ", "Meanwhile, to make the beans, place the mushrooms into a bowl and cover with boiling water to rehydrate. Drain and chop finely.", "Place a large pan over a medium heat with the oil and butter. Fry the pancetta, thyme, bay leaves, pepper and rosemary until brown and starting to crisp. Remove with a slotted spoon and discard. Add the onion, carrot and celery to the pan and fry for 10 minutes, or until softened. Add the mushrooms, garlic and cinnamon stick for 1 minute. Add the red wine and simmer until reduced by half. Add the tomato purée, umami paste, sugar, stock and passata and bring to the boil until reduced by half again. Stir in the paprika and beans and heat through.", "Divide the cooled potato mixture into 10 equal peices and shape into patties. ", "Heat a layer of oil 1cm deep in a non-stick pan over a high heat and fry the hash browns for 2–3 minutes on each side, or until golden and piping hot (CAUTION: hot oil can be dangerous. Do not leave unattended.). ", "Stir the fresh herbs through the beans, remove the cinnamon stick and serve with the hash browns. "]}, {"isVegetarian": true, "title": "Baked blackcurrant rice", "url": "www_bbc_co_uk_food_recipes_baked_blackcurrant_rice_06422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/8fl oz apple juice ", "50g/2oz arborio rice", "40g/1½oz  fresh blackcurrants", "2 tbsp sugar", "½ tsp vanilla extract"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 220C/425F/Gas 7. ", "Pour the juice into the ovenproof dish, then add the rice.", "Prepare the blackcurrants by pinching out any woody stalks before adding them to the ovenproof dish. ", "Add the sugar and the vanilla extract. Give the mixture a stir and put on the lid. Place on a baking tray.  ", "You’ll need to ask a grown-up to help with this part. Cook for 20 minutes then leave to stand for at least 10 minutes with the lid on (the rice will carry on cooking). When the rice has cooled a bit, you can eat it! "]}, {"isVegetarian": true, "title": "Baked blueberry cheesecake with blueberry compôte", "url": "www_bbc_co_uk_food_recipes_baked_blueberry_91786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, melted, plus extra for greasing", "300g/10½oz digestive biscuits, crushed", "1 vanilla pod, seeds scraped out", "1 lemon, zest and juice", "200g/7oz caster sugar", "50g/1¾oz cornflour", "850g/1lb 4oz full-fat cream cheese", "375ml/13fl oz double cream", "4 large free-range eggs", "250g/9oz blueberries", "250g/7oz blueberries", "100g/3½oz caster sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a 23cm/9in springform cake tin with baking parchment.", "For the baked blueberry cheesecake, melt the butter in a medium saucepan and add the crushed biscuits and mix.", "Tip into the prepared tin and press the crumbs down firmly and evenly to form a bottom crust. Bake for 10 minutes, then set aside to cool completely. ", "Place the vanilla seeds, lemon zest and juice, caster sugar, cornflour, cream cheese and cream in a large glass bowl and whisk together.", "Add the eggs continually whisking until the mixture is smooth, then add the blueberries and stir carefully.", "Pour onto the baked base and tap the tin lightly against the work surface to settle the mixture into the tin. Wrap the outside of the tin in a double thickness of foil if you are concerned about the tin’s water-tightness.", "Place the cake into a deep roasting tin containing 2cm/1in hot water.", "Bake in the oven for 1¼-1½ hours or until the cheesecake is golden-brown and just set.", "Turn the heat off in the oven and leave the cake in the oven for at least two hours or preferably overnight.", "For the blueberry compôte, place the blueberries and sugar into a sauce pan and cook until the sauce thickens.", "Serve the cooled cheesecake in slices with the blueberry compote."]}, {"isVegetarian": true, "title": "Baked Bramley apple with spiced custard and apple granita", "url": "www_bbc_co_uk_food_recipes_baked_bramley_apple_with_15070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Bramley apples (or 125ml/4fl oz apple juice if you do not have a juicer)", "sugar, to taste", "2 Bramley apples, peeled, cored and cut in half", "100g/3½oz butter", "50g/1¾oz demerara sugar", "110g/3¾oz raisins", "50ml/1¾fl oz double cream", "110g/3½oz soft brown sugar", "5g ground mixed spice", "1 lemon, zest only", "1 orange, zest only", "250ml/9fl oz milk", "250ml/9fl oz cream", "50g/1¾oz fresh Douglas fir pine needles", "200g/7oz pasteurised egg yolk, or fresh egg yolks", "80g/2¾oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the apple granita, juice the apples using a juicer (or alternatively use bought apple juice). You will need 125ml/4fl oz apple juice. Add a little sugar if it is too sour, then strain through a fine metal sieve into a freezable tub. Freeze until completely frozen.", "For the baked apples, preheat the oven to 240C/475F/Gas 9. ", "Use a pastry brush to coat the apples in some of the butter and sprinkle over the demerara sugar. Set aside until needed.", "Place the remaining baked apple ingredients, except the mixed spice and zests, into a pan. Bring to the boil and simmer for two minutes. Remove from the heat and add the mixed spice and zest.", "Divide the mixture between four small ovenproof pots or ramekins and top with the halved apples.Transfer to the oven and bake for 10 minutes.", "Reduce the oven temperature to 160C/325F/Gas 3 and cook until soft (approximately 10 minutes), then set aside.", "For the pine custard, in a pan bring the milk, cream and pine needles up to the boil. Turn off the heat and set aside for 30 minutes to infuse.", "When the mix has infused, slowly bring back up to the boil.", "Whisk together the egg yolks and sugar in a large heatproof bowl until pale.", "When the infused milk is boiling, turn off the heat. Pour it gradually, in a steady stream, into the egg yolk mixture, whisking constantly. Keep whisking until the mixture has cooled down a little, then strain through a fine metal sieve into a clean pan and keep warm.", "When ready to serve, scrape the frozen juice with the back of a spoon to form a granita.", "To serve, divide the custard between four bowls then place a baked apple half on top and sprinkle over the granita. Serve at once."]}, {"isVegetarian": false, "title": "Baked burrito", "url": "www_bbc_co_uk_food_recipes_baked_burrito_04690", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_burrito_04690_16x9.jpg", "ingredients": ["1 small onion", "oil, for cooking", "600g/1lb 5oz skinless, boneless turkey breast or thigh", "3 tsp Mexican seasoning, such as mild taco seasoning", "2 tomatoes, halved", "200g tin of sweetcorn, drained", "200g/7oz grated cheese, such as Cheddar", "4 large soft tortilla wraps", "4 tbsp natural yoghurt, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 4. ", "Peel and roughly chop the onion. Heat a large frying pan over a medium heat, then add a dash of oil and the onion. Cook for 7-10 minutes, or until soft and translucent but not brown. Reduce the heat if the onion starts to colour.", "Cut the turkey meat into 2½cm/1in cubes and add them and the Mexican seasoning to the onion. Cook for 10 minutes, stirring now and again, or until the turkey is cooked through with no sign of pink juices when you cut into the largest cube.", "Grate the cut sides of the tomatoes into the pan, using a cheese grater, and stir. Discard the skin once the flesh is grated. Increase the heat to medium-high and cook for 3-4 minutes, or until the tomato mixture has thickened and coats the turkey. Add the sweetcorn and stir.", "Put the tortilla wraps on a chopping board and spoon the meat mixture into the middle of the wraps. Sprinkle with the grated cheese. Fold the sides of the wraps over the filling, then roll the wraps up from bottom to top to enclose the filling completely.", "Put the wraps, folded side-down on a baking tray. Put a little oil into your hand and gently rub it over the wraps. Place in the oven and bake for 7 minutes, then turn the wraps over and bake for a further 5 minutes, or until golden and crisp all over.", "Serve each burritos with a tablespoon of yoghurt on the side for dipping."]}]