[{"ingredients": ["110g / 4oz de trigo bulgar", "55 g / 2oz de pasas", "1½ naranjas, solo jugo", "exprimir jugo de lima", "1 cucharada de semillas de cáñamo (disponible en tiendas naturistas)", "½ cebolla roja, pelada y finamente picada", "pizca de chile en polvo", "1 cucharadita de salsa de soja", "2 dientes de ajo", "puñado mezclado de hierbas frescas (romero, tomillo, perejil)", "2 pechos poussin"], "method": ["Para la ensalada, coloque el trigo bulgar en un tazón grande. Vierta suficiente agua hirviendo para cubrir y luego cubra con papel de aluminio. Deje reposar durante 10 minutos a vapor.", "Agregue las pasas, el jugo de naranja y un chorrito de jugo de lima y mezcle.", "Agregue las semillas de cáñamo, cebolla roja, chile en polvo y salsa de soja y cubra con papel de aluminio nuevamente hasta que esté listo para servir.", "Para el poussin, llene a medias una sartén con agua. Agregue los dientes de ajo y las hierbas mixtas. Traiga a fuego lento y coloque un vaporizador en la parte superior.", "Coloque las pechugas poussin en el vaporizador, cubra con una tapa y deje hervir durante 6-8 minutos, o hasta que el poussin esté cocido.", "Para servir, coloca la ensalada de trigo bulgar en un plato caliente y coloca el poussin al vapor encima."], "url": "www_bbc_co_uk_food_recipes_bulgarwheatsaladwith_79265", "title": "Ensalada de trigo búlgaro con pechuga de poussin al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de trigo bulgur", "2 huevos medianos de granja", "1 cebolla roja pequeña, finamente picada", "2 cúrcuma de cucharadita colmada", "2 cucharaditas de comino molido", "1 cucharadita de canela molida", "½ cucharadita de pimienta de cayena", "20g / ½ oz de cilantro fresco, picado", "80g / 3oz de arándanos secos", "sal y pimienta para probar", "4 cucharadas de aceite de oliva", "200g / 7oz de yogur griego", "150g / 5½oz de salsa dulce de tamarindo", "Semillas de 25g / 1oz de nigella", "4 cucharadas de cilantro fresco, picado"], "method": ["Cocine el trigo bulgur por un poco más de lo que dicen las instrucciones del paquete, así que está muy hinchado (alrededor de 20 minutos). Enjuague con agua fría para eliminar el almidón y deje que se drene hasta que esté lo suficientemente frío como para manipularlo.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Mezcle todos los ingredientes, excepto el aceite, para las bolas de trigo bulgur juntas. Aprieta la mezcla con tus manos para que se adhiera. Forma la mezcla en bolas o empanadas del tamaño de una pelota de golf, no te preocupes por convertirlas en bolas perfectas. Coloque en la nevera durante 30 minutos.", "Calentar una sartén grande y agregar el aceite, una vez caliente agregar las bolas y freír o 3-4 minutos. Termine en el horno durante 5-10 minutos si lo desea.", "Servir en palitos con una llovizna de yogur al estilo griego, salsa dulce de tamarindo, una pizca de semillas de nigella y más cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_bulgur_wheat_balls_57026", "title": "Bolas de trigo Bulgur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bulgur_wheat_balls_57026_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 papas para hornear de tamaño mediano, peladas, cortadas en chips", "3 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "Conejo picado 350g / 12oz", "100 g / 4 oz de panceta de cerdo picada", "4 hojas de salvia fresca, finamente picadas", "3 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 220C / 425F / gas 7.", "Para las patatas fritas, ponga a hervir un sartén grande de agua con sal, agregue las papas y hierva durante cinco minutos. Escurrir, luego verter el aceite de oliva, sazonar con sal marina y pimienta negra recién molida y extender en una bandeja para hornear.", "Transfiera al horno por cerca de 20 minutos, o hasta que esté dorado y cocido.", "Para las hamburguesas, mezcle todos los ingredientes de la hamburguesa aparte del aceite de oliva. Sazonar con sal marina y pimienta negra recién molida, dividir la mezcla por la mitad y formar dos hamburguesas grandes.", "Calentar el aceite en una sartén a fuego medio y freír las hamburguesas durante 4-5 minutos en cada lado, o hasta que estén doradas y cocidas.", "Sirve la hamburguesa con las patatas fritas y el ketchup de tomate."], "url": "www_bbc_co_uk_food_recipes_bunny_burgers_with_36119", "title": "Bunny hamburguesas con chips gruesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunny_burgers_with_36119_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 berenjenas medianas", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "½ limón, solo jugo", "10 g / ¼ oz de sal", "8g de pimienta negra molida", "azúcar pizca", "80g / 3 oz de garbanzos cocidos o enlatados escurridos", "10 fechas, picadas", "1 pimiento rojo, finamente picado", "menta pequeña, hojas recogidas y picadas", "cilantro de racimo pequeño, hojas recogidas y picadas", "chile, al gusto, finamente picado", "1 diente de ajo, finamente picado", "40 g / 1½ oz de queso feta, desmenuzado", "almendras copos puñado", "vinagre balsámico, para lloviznar", "picatostes, para servir"], "method": ["Pinche las berenjenas para permitir que la humedad escape mientras cocina.", "En una barbacoa caliente, cocine las berenjenas enteras durante 15 minutos, volteándolas cada cinco minutos hasta que las berenjenas estén blandas y la piel esté ennegrecida y con ampollas. Déjelo a un lado hasta que esté lo suficientemente frío para manejarlo.", "En una bandeja pequeña, corte la berenjena a lo largo, saque el exceso de agua y las semillas. Retire la carne de la piel con una cuchara y colóquela en un tazón grande.", "Rocíe con su mejor aceite de oliva y el jugo de limón. Sazone al gusto con sal y pimienta negra recién molida; luego agrega una pizca de azúcar.", "Reserve algunos de los garbanzos, la pimienta y la menta para decorar, luego mezcle los garbanzos restantes, las fechas, la pimienta, la menta, el cilantro, el chile y el ajo. Pruebe y corrija el condimento a su gusto.", "Coloque la berenjena en el centro de un plato y decore con el queso feta, almendras en copos, garbanzos reservados, menta picada y pimienta.", "Rocíe con vinagre balsámico y un poco más de aceite de oliva. Cubra con crujientes croûtons y sirva."], "url": "www_bbc_co_uk_food_recipes_burnt_aubergine_salad_22252", "title": "Ensalada de berenjena a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/burnt_aubergine_salad_22252_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 lima", "12 chiles con bonete escocés mediano, tallos eliminados, toscamente picados", "Hojas de cilantro de 15 g / ½ oz, picadas", "1 ½ bulbos de ajo, clavos pelados", "Vinagre de vino blanco 150ml / 5fl oz", "1½ cucharada de azúcar en polvo colada", "1 cucharada de mostaza americana", "1 pedazo pequeño de pulgar de raíz de jengibre fresco, pelado y toscamente picado", "½ papaya inmadura (firme al tacto), pelada, removida de piedra, carne toscamente picada", "sal marina y pimienta negra recién molida", "Harina de auto aumento de 360 ​​g / 12½ oz, tamizada, más extra para quitar el polvo", "sal pizca generosa", "20 g / oz de mantequilla, a temperatura ambiente", "aceite de colza, para recubrimiento", "aceite de maní, para freír", "750 g / 1 libra 10 oz de bacalao (o cualquier otro pescado salado) empapado durante 12 horas, o durante la noche, cambiando el agua 5-6 veces", "2 cebollas tiernas, bulbo blanco descartado, extremos verdes finamente picados", "2 tomates grandes de vid, sin semillas, finamente picados", "1 pimiento amarillo o naranja, sin semillas, finamente picado", "2 cucharaditas de cebollines finamente picados", "1-2 limas, solo jugo", "½ cucharada de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida", "4 tbsp mayonesa colmada", "4 dientes de ajo, pelados y aplastados", "2-4 cucharaditas de salsa de pimienta (de arriba), o 1 chile rojo picado finamente", "½ cucharadita de pimentón", "1 aguacate maduro, pelado y removido de piedra, en rodajas finas"], "method": ["Para la salsa de pimienta, ponga la lima en una olla pequeña y cubra con agua fría con sal. Llevar a ebullición y cocinar la lima hasta que esté suave y tierno, unos 15-20 minutos. Dejar de lado para enfriar.", "Mientras tanto, coloque todos los demás ingredientes, excepto la sal y la pimienta, en una licuadora y pulse hasta que quede suave.", "Pica finamente la lima (manteniendo la cáscara), descartando cualquier semilla, y agrega los otros ingredientes. Transfiera a una botella esterilizada o tarro de mermelada, cubra con la tapa y deje que se \"desarrolle\" durante un mínimo de 2 días, luego sazone al gusto con pimienta recién molida y mucha sal. Dale a la botella un buen batido para distribuir el condimento. Almacene en el refrigerador por hasta 6 meses (no se preocupe por la decoloración con el tiempo).", "Para los pasteles fritos, mezcle la harina y la sal en un tazón grande y luego use las puntas de los dedos para frotar la mantequilla hasta que se asemeje a migas de pan finas. Poco a poco agregue 150-200ml / 5-7fl oz de agua (puede que no necesite usarlo todo), mezcle con una cuchara, hasta que se forme una masa.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada, frote sus manos con aceite de colza y amasar, por alrededor de un minuto más o menos, hasta que la masa esté suave. Forme una bola y vierta una gota de aceite en su palma y cubra la masa. Cubra la masa con una película adhesiva y déjela durante 30 minutos en un lugar cálido.", "Para las pastas buljol, enjuague el bacalao, colóquelo en una cacerola grande, cúbralo con agua fresca y llévelo a ebullición. Una vez que el agua comience a hervir, retire la sartén del fuego, vierta el agua, agregue agua fría y vuelva a hervir. Tan pronto como el agua empiece a hervir, reduzca el fuego y cocine a fuego lento durante unos 5-10 minutos, hasta que el bacalao esté cocido. Escurra el bacalao y déjelo enfriar.", "Cuando el bacalao esté lo suficientemente frío como para manipularlo, vierta finamente el pescado en un recipiente, teniendo cuidado de descartar cualquier espina y piel. Suavemente pero a fondo mezcle los ingredientes restantes y sazone al gusto con sal y pimienta.", "Para los horneados fritos, caliente el aceite de cacahuete a 180C en una freidora. Alternativamente, llene dos tercios de una cacerola grande, profunda y pesada, y caliente hasta que un pequeño trozo de pan se dore casi inmediatamente después de haberlo dejado caer en el aceite. Alinee un plato grande con papel de cocina.", "Regrese la masa a una superficie enharinada y amase unas cuantas veces más. Divida la masa en 6 bolas y aplaste cada una en un círculo de tamaño de palma. Use las yemas de sus dedos para cubrir la parte superior de cada bola con un poco de aceite de colza.", "Haga bolitas de masa en el aceite caliente 2 o 3 a la vez, dependiendo del tamaño de su sartén. Freírlos durante aproximadamente 30 segundos a 1 minuto, luego voltéelos y cocínelos hasta que estén dorados por ambos lados e hinchados. Retire con una cuchara ranurada y coloque sobre la placa forrada para drenar.", "Para el alioli, combine todos los ingredientes en un tazón. Sazonar, al gusto, con sal y pimienta.", "Para servir, cortar los pasteles fritos, extender generosamente con alioli, rellenar con la mezcla de bacalao y cubrir con rebanadas de aguacate."], "url": "www_bbc_co_uk_food_recipes_buljol_butties_with_53010", "title": "Butitas Buljol con salsa de pimienta, bakes fritos y alioli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pequeñas cebollas marrones, sin pelar", "2 puerros silvestres enteros, raíces intactas", "Pan rallado de masa fermentada de 150 g / 5½ oz", "55g / 2oz de mantequilla sin sal", "1 diente de ajo", "100g / 3½oz de requesón fresco de queso de oveja o ricotta", "1 limón, ralladura solamente", "Queso duro de oveja 100 g / 3½ oz, finamente rallado", "1 cucharadita de semillas de nigella", "2 puñados de hojas de ajo, en rodajas finas", "sal", "125g / 4½ oz de harina de trigo duro o sémola, más extra para espolvorear", "125 g / 4½ oz de harina de alforfón quemada", "125ml / 4½fl oz de agua", "8 g de aceite de colza prensado en frío", "4 cucharadas de aceite vegetal", "10 dientes de ajo, aplastados", "4 cucharadas de sésamo tostado o aceite de camelina", "2 cucharadas de vinagre de saúco o jugo de limón recién exprimido", "4 cucharadas de aceite de ajo quemado"], "method": ["Para las albóndigas de grano quemado, coloque las harinas en un recipiente para mezclar. Haga una sangría en el centro, gradualmente agregue el agua y amasar para crear una masa suave y suave. Agregue el aceite y continúe amasando. Forme la masa en forma de bola, envuélvala en una película adhesiva y déjela reposar durante 15 minutos.", "Polvore una superficie de trabajo con harina de trigo duro. Tome un trozo pequeño de masa y enrolle en forma de cuerda de unos 2.5 cm de ancho, manteniendo el resto de la masa envuelto en la película adhesiva. Corta la cuerda en pedazos de 1cm / ½ y dale forma a cada pieza en un caparazón. Repita con el resto de la masa. Coloque las albóndigas sobre una tabla enharinada y déjelas reposar durante unas horas o durante la noche.", "Precaliente el horno a 200C / 180C Fan / Gas 6. Coloque las cebollas en una bandeja para hornear y hornee durante 35-45 minutos, o hasta que el azúcar en las cebollas comience a burbujear desde los extremos de la raíz. Dejar enfriar y luego pelar. Cortar por la mitad a lo largo y separar las capas en pétalos. Apartar y mantener caliente.", "Blanquee los puerros colocándolos con el extremo de las raíces hacia abajo en agua hirviendo con sal durante 30 segundos. Precalentar una sartén a fuego medio y cortar los puerros en rodajas gruesas. Cocine a la parrilla los puerros por 6-8 minutos, o hasta que estén ligeramente carbonizados. Apartar y mantener caliente.", "Para el aceite de ajo quemado, agregue el aceite vegetal y el ajo en una olla pequeña y cocine a fuego medio-bajo, revolviendo, hasta que empiece a dorarse. Reduzca el fuego a bajo y continúe cocinando, revolviendo con frecuencia, durante 10 minutos, o hasta que el ajo se ponga completamente negro (el ajo se volverá muy pegajoso en el proceso). Transfiera la mezcla a un recipiente resistente al calor y agregue el aceite de sésamo. Coloque en una licuadora y blitz a alta velocidad durante unos 30 segundos, o hasta que esté completamente suave. Cuele la mezcla a través de un filtro de café o muselina húmeda y transfiera a un recipiente sellable. Use este aceite en el Paso 6 a continuación y el resto puede guardarse en el refrigerador hasta por 2 meses.", "Para el aderezo de ajo, bata el vinagre de flor de saúco con 4 cucharadas de aceite de ajo quemado que se hizo en el Paso 5.", "Freír las migas de pan en la mantequilla con el diente de ajo durante unos minutos hasta que estén doradas. Descartar el ajo Cocine las albóndigas en agua hirviendo con sal durante 3-8 minutos. Mezcle las cebollas, los puerros y las albóndigas con el aderezo de ajo en un tazón. Sazonar con sal.", "Divida el queso cuajado entre cuatro platos y espolvoree con la ralladura de limón. Vierta la mezcla de puerro y bola de masa en la parte superior. Cubra con pan rallado, queso duro, semillas de nigella y hojas de ajo."], "url": "www_bbc_co_uk_food_recipes_burnt_grain_dumplings_63263", "title": "Albóndigas de grano quemado, puerros silvestres y cuajada de oveja", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chirivía grande, pelada y cortada en bastones cortos", "2 zanahorias, peladas y cortadas en bastones cortos", "3 cucharadas de aceite de oliva", "100g / 3½oz de trigo bulgur, enjuagado", "1 cucharada de miel clara", "½-1 cucharadita de hojuelas de chile seco, al gusto", "½ limón, solo jugo", "25g / 1 oz de perejil picado fresco de hoja plana", "Remolacha cocida al vacío 150 g / 5oz, escurrida, en cubos", "100g / 3½oz de queso de cabra suave, finamente picado", "sal y pimienta negra recién molida", "4 panes calientes, para servir"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear o una lata pequeña para hornear con papel de aluminio.", "Coloque las chirivías y las zanahorias en la bandeja de hornear y rocíe con 1 cucharada de aceite. Sazonar con sal y pimienta y asar durante 18-20 minutos.", "Mientras tanto, medio llenar una olla con agua y llevar a ebullición. Agregue el bulgur y cocine por 6-8 minutos, o hasta que esté casi tierno.", "Rocíe las verduras asadas con la miel y espolvoree con las hojuelas de chile, volteándolas para cubrirlas por completo. Vuelva al horno por otros 10 minutos o hasta que esté dorado y pegajoso.", "Escurre el bulgur y transfiéralo a un tazón grande. Agregue las verduras asadas. Agregue el jugo de limón y la mayor parte del perejil y mezcle de nuevo. Condimentar con sal y pimienta.", "Coloque la ensalada de trigo bulgur en un plato de servir. Espolvoree sobre la remolacha y el queso de cabra. Adorne con el perejil y el aceite restantes. Sirve con panes planos."], "url": "www_bbc_co_uk_food_recipes_bulgur_wheat_salad_with_65322", "title": "Ensalada de trigo Bulgur con remolacha, miel y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bulgur_wheat_salad_with_65322_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "½ cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "2.5cm / 1 en una pieza de canela", "2 vainas de cardamomo verde", "1 estrella de anís", "1 hoja de laurel", "1 cebolla, finamente picada", "2 cucharadas de polvo de curry de Sudáfrica", "2 tomates, picados", "1kg / 2lb 2oz de pierna de cordero sin hueso, cortada en dados de 1.5cm / ½ in", "1 cucharada de jengibre fresco finamente picado", "1 cucharada de ajo finamente picado", "10-12 hojas de curry", "2 papas grandes, cortadas en cubos del mismo tamaño que la carne", "sal", "2 cucharadas de hojas de cilantro finamente picadas", "2 cucharadas de jugo de lima", "2 panes de pan blanco crujiente, sin cortar, cada uno cortado por la mitad en el medio y la mayoría de las migajas retiradas", "berro de coriandro o ramitas, para adornar"], "method": ["Calentar el aceite en una sartén y saltear las especias enteras y la hoja de laurel hasta que las especias chisporrotean.", "Agregue la cebolla y cocínela durante 5-7 minutos hasta que esté transparente.", "Agregue el polvo de curry y saltee durante un minuto, luego agregue los tomates y revuelva para mezclar.", "Cocine a fuego medio, revolviendo a menudo, hasta obtener una consistencia similar a la salsa.", "Agregue la carne, el jengibre, el ajo y las hojas de curry y 300 ml / 11 fl oz de agua, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento, revolviendo ocasionalmente, durante 40-50 minutos o hasta que la carne esté tierna.", "Agregue las papas, sal al gusto y 200 ml / 7 fl oz de agua. Continúe hirviendo a fuego lento hasta que la carne y las papas estén perfectamente cocidas (aproximadamente 15 minutos).", "Agregue el cilantro picado y el jugo de lima.", "Para servir, espolvorear en los huecos en el pan y decorar con berro de coriandro."], "url": "www_bbc_co_uk_food_recipes_bunny_chow_38916", "title": "Bunny Chow", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunny_chow_38916_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 zanahorias, peladas y finamente picadas", "1 cebolla, pelada y finamente picada", "3 ramas de tomillo, hojas retiradas", "4 dientes de ajo, finamente picados", "aceite de oliva", "2kg / 4lbs 2 oz de carne de vacuno / tomates de ciruela pelados, sin semillas y picados", "850ml / 1½pt stock de peces", "sal y pimienta recién molida", "azúcar", "6 filetes de rape en el hueso", "12 anillos de calamar", "12 langostinos", "6 pequeños filetes de lubina o besugo", "12 mejillones", "1 baguette", "125g / 4oz de mantequilla", "6 dientes de ajo, finamente picados", "2 cucharadas de perejil, finamente picado"], "method": ["Cocine las zanahorias, la cebolla, el tomillo y el ajo en un poco de aceite de oliva a fuego lento.", "Agregue los tomates y el caldo de pescado.", "Sazonar con sal, pimienta y un poco de azúcar.", "Cubra la salsa con un cartucho hecho con papel de hornear.", "Cocine lentamente por hasta 2 horas. (En esta etapa, la burrida se puede guardar en la nevera durante 48 horas).", "Cuando quiera servir, vuelva a calentar la salsa agregando el pescado y cocínelo durante unos 5-10 minutos hasta que todo el pescado esté cocido.", "Mezcle la mantequilla ablandada con el ajo y el perejil. Cortar la baguette en un ángulo, parrilla a ambos lados y luego extender sobre el perejil y la mantequilla de ajo. Sirve con el guiso de pescado."], "url": "www_bbc_co_uk_food_recipes_burrida_67681", "title": "Burrida", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 200 g / 7oz 00, más extra para quitar el polvo", "2 huevos de gallinas camperas, ligeramente golpeados", "Burrata de 225g / 8oz", "5 cucharadas de aceite de oliva virgen extra", "2 dientes de ajo, picados", "200g / 7oz de tomates cherry frescos, picados", "gran puñado de albahaca fresca", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "2 puñados de espinaca baby", "1 cucharada de vinagre balsámico de buena calidad", "50g / 1¾oz de queso italiano duro, rallado", "hojas de albahaca bebé, para adornar"], "method": ["Para los tortellini, mezcle la harina y los huevos en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado. Ponlo en una superficie de trabajo ligeramente enharinada y aplasta las migas en una bola de masa. Amasar la masa durante 4-5 minutos o hasta que quede suave y elástica. Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Para preparar la pasta, espolvoree los rodillos de una máquina de pasta con harina. Corte la pasta enfriada en 3 pedazos y aplánelos a un grosor de aproximadamente 1cm / ½ pulg. Coloque la máquina de pasta en su posición más amplia y pase una pieza de masa por la máquina, girando el mango con una mano y recogiendo la masa enrollada a medida que pasa por la máquina con la otra. Cambie la configuración de la máquina de pasta al siguiente ajuste más grueso, espolvoree los rodillos con un poco de harina, luego vuelva a alimentar la misma hoja de pasta a través de la máquina, como antes. Repita este proceso 3 o 4 veces más, enharinando la máquina y cambiando la configuración cada vez, hasta que llegue a la configuración penúltima. A medida que la hoja de pasta se hace más larga, córtela a la mitad para que el proceso de laminación sea más manejable. Repita el proceso de laminado con las piezas restantes de masa. Una vez que se ha extendido toda la masa, debe tener seis hojas largas de pasta.", "Corte las hojas de pasta en discos de 9 cm / 4 pulgadas con un cortador de galletas. Coloque una pequeña pieza de burrata encima de cada círculo de pasta y cepille los bordes de cada disco con un poco de agua. Junta los bordes de cada disco para formar una forma semicircular, presionando los bordes junto con los dedos para sellar. Acerque los extremos puntiagudos de los tortellini entre sí alrededor de la yema del dedo para formar un anillo, luego presione las esquinas con la otra mano.", "Para la salsa de tomate cherry, caliente el aceite en una sartén a fuego medio. Agregue el ajo y fría por 1-2 minutos, o hasta que se ablanden. Agregue los tomates cherry y la albahaca y cocine durante 2-3 minutos más. Sazone al gusto con sal y pimienta negra recién molida.", "Llevar a ebullición una sartén grande de agua salada. Con cuidado, baje los tortellini en agua hirviendo, en tandas, y cocine durante 3-4 minutos, o hasta que flote a la superficie. Retire con una espumadera y manténgase caliente mientras cocina los demás tortellini.", "Para servir, caliente una sartén grande y agregue la mantequilla, una vez derretida agregue las espinacas y un chorrito de agua y cocínelas durante 1-2 minutos o hasta que se marchiten.", "Mezcle suavemente la salsa de tomate con los tortellini hasta que estén cubiertos. Para servir, espolvorea un poco de espinaca marchita en el fondo de cada tazón para servir y coloca el tortellini y la salsa de tomate encima. Rocíe con vinagre balsámico y espolvoree un poco de queso italiano rallado y unas hojas pequeñas de albahaca encima."], "url": "www_bbc_co_uk_food_recipes_burrata_filled_59791", "title": "Burrata llenó los tortellini con una salsa de tomate cherry, terminó con vinagre balsámico", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20 g / oz de mantequilla", "1 cucharadita de aceite de oliva", "250 g / 9 oz de espinaca baby", "10 tomates cherry, cortados a la mitad", "2 huevos grandes de gallinas camperas", "½ limón, solo jugo", "sal y pimienta negra recién molida", "2 x 100 g / 3½ oz rebanadas de pan integral, para servir"], "method": ["Derretir tres cuartas partes de la mantequilla con el aceite en una sartén pequeña a fuego medio. Agregue la espinaca y los tomates y sazone. Revuelva, cubra con una tapa, baje el fuego y cocine por 2-3 minutos, o hasta que la espinaca se haya marchitado.", "Empuja las verduras alrededor del borde de la sartén en un anillo ancho con un espacio en el medio para los huevos, como un nido.", "Derretir la mantequilla restante en el centro de la sartén y dejar que se mezcle con algunos de los jugos que han salido de las verduras. Rompe los huevos en el medio. Cubra y cocine hasta que los huevos estén hechos a su gusto (3-4 minutos para una yema líquida y 5-6 minutos para la firmeza).", "Mientras tanto, tuesta el pan en ambos lados.", "Sazone el huevo y exprima el jugo de limón. Sirva inmediatamente con la tostada."], "url": "www_bbc_co_uk_food_recipes_butter-poached_egg_in_a_26822", "title": "Huevo escalfado con mantequilla en un nido de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter-poached_egg_in_a_26822_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de mantequilla o margarina, ablandadas a temperatura ambiente", "375g / 13oz de azúcar en polvo sin refinar", "6 huevos grandes de gallinas camperas", "2 cucharaditas de extracto de vainilla", "Harina autoacabada a 375g / 13oz", "2-3 cucharadas de leche", "algunas gotas de colorante azul", "algunas gotas de colorante rojo", "300 g / 10 oz de azúcar en polvo", "5 claras de huevo grandes de gallinas camperas", "500g / 1lb de mantequilla sin sal, ablandada y cortada en cuadrados", "pizca de sal", "algunas gotas de extracto de vainilla", "6 cucharadas de mermelada de frambuesa"], "method": ["Para las capas de esponja, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre la base de tres moldes para pasteles de 18 cm en papel para hornear.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Agregue los huevos, poco a poco, e incorpore el extracto de vainilla. Doble la harina con una cuchara grande de metal y agregue un poco de leche extra si es necesario.", "Divida la mezcla por igual en tres cuencos de mezcla. Agregue unas gotas de colorante azul en un tazón y mezcle suavemente para obtener un color uniforme. Agregue coloración roja de alimentos al otro tazón y vuelva a mezclar para obtener un color uniforme. Deje la tercera mezcla clara.", "Con una cuchara, mezcle las tortas en las tres latas de pastel y extiéndalas suavemente con una espátula. Hornee durante 20-25 minutos, o hasta que estén doradas en la parte superior y un pincho insertado en el centro salga limpio.", "Retire del horno y deje a un lado durante cinco minutos, luego retire de la lata y despegue el papel. Coloque sobre una rejilla de alambre para que se enfríe por completo.", "Para el glaseado, llene un recipiente grande con agua fría. Vierta 100ml / 3½fl de agua en una sartén y agregue 250 g / 9 oz de azúcar en polvo. Calienta suavemente y revuelve hasta que el azúcar se disuelva, luego lleva la mezcla a ebullición. Use un cepillo de pastelería húmedo para lavar los cristales de azúcar en el costado de la sartén. Hierva la mezcla rápidamente, sin removerla, hasta que alcance 121C / 250F (use un termómetro de cocina para esto).", "Preferiblemente, usando una batidora independiente, bata las claras de huevo hasta que estén firmes. Comience esto cuando la temperatura del azúcar del jarabe llegue a aproximadamente 100 ° C. Poco a poco agregue el azúcar impalpable restante.", "Tan pronto como el jarabe alcance los 121 ° C / 250 ° F, sumerja la base de la sartén en el tazón de agua fría, para evitar que el jarabe se caliente más. Solo deje la bandeja en el agua durante unos segundos o el almíbar se volverá demasiado espeso.", "Encienda la batidora a velocidad máxima y vierta gradualmente el jarabe en un chorro delgado en el centro del tazón, tratando de no poner jarabe en los lados del bol o del batidor, ya que se colocará allí y no se mezclará. en correctamente Continúe batiendo la mezcla durante aproximadamente 8-10 minutos hasta que el recipiente se sienta tibio. Si el almíbar comienza a ser demasiado espeso para verter, devuelva la olla a la placa de cocción muy brevemente.", "Poco a poco bata la mantequilla. A continuación, agregue la sal y el extracto de vainilla. El merengue se colapsará un poco, y la mezcla puede parecer que está cuajada, pero manténgala batiendo hasta que se forme una crema suave y esponjosa.", "Extienda la mermelada sobre dos de las capas de pastel y cubra con una capa de glaseado. Sandwich los pasteles juntos. Enfriar en la nevera durante 15 minutos. Retire de la nevera y cubra suavemente toda la torta con glaseado. Espolvoree con salpicaduras de decoración si lo desea.", "Para hacer la decoración del bunting, tome dos longitudes, de modo que se pliegue y cubra con una espiral de cuerda de color. Atar una longitud de cuerda a través de ambas varillas de espiga. Corta trozos de tela con forma de diamante o cinta de 5cm / 2 pulgadas. Doblar las banderas del empavesado sobre la cuerda y pegar para asegurar. Suavemente facilite la espiga en la torta y tiene una hermosa barrida de empavesado."], "url": "www_bbc_co_uk_food_recipes_bunting_cake_35577", "title": "Pastel de Bunting", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunting_cake_35577_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla sin sal", "2 langostas, carne extraída de las conchas (si es posible, conserve la carne en trozos enteros)", "1 yema de huevo", "1 limón, solo jugo", "110 g / 4 oz de mantequilla clarificada, calentada", "½ naranja sanguina, cáscara y jugo solamente", "1 manojo de espárragos, extremos leñosos recortados, pelados", "100g / 3½oz de mantequilla sin sal", "50 g / 1¾oz de espinaca baby", "sal y pimienta negra recién molida", "2 cucharadas de berros mixtos (como la sangre de toro bebé, acedera de vena roja y perifollo) o pequeñas flores comestibles"], "method": ["Para la langosta, caliente una sartén grande y agregue la mantequilla. Una vez caliente y burbujeante, agregue la carne de langosta y cocine a cada lado durante 1-2 minutos. Mantenga caliente hasta que esté listo para servir.", "Para la salsa Maltaise, ponga la yema de huevo, el jugo de limón y una cucharada de agua en una licuadora. Mezcla para combinar. Con el motor en funcionamiento, vierta lentamente la mantequilla calentada a través del pico en la tapa hasta que toda la mantequilla se combine y la salsa se emulsione. Termine con la ralladura de naranja de sangre y el jugo y mezcle para combinar. Sazonar con sal.", "Para los espárragos y las espinacas, cocine los espárragos en una olla grande de agua hirviendo durante 2 o 3 minutos. Escurrir y apartar.", "Caliente una sartén grande y agregue la mitad de la mantequilla. Una vez que la mantequilla se derrita, agregue los espárragos y fría por 2 minutos. Condimentar con sal y pimienta. Reservar en un plato caliente.", "Calienta la mantequilla restante en la sartén. Agregue la espinaca y una cucharada de agua. Cocine hasta que se marchite.", "Para servir, coloque la espinaca marchita en el centro de los platos para servir y cubra con los espárragos y la langosta. Vierta sobre la salsa y decore con berro."], "url": "www_bbc_co_uk_food_recipes_butter-poached_lobster_74792", "title": "Langosta a la mantequilla con espárragos, espinacas y salsa Maltaise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patatas nuevas", "1 maíz en la mazorca", "200g / 7oz de mantequilla sin sal", "10 langostinos Strangford (u otras gambas grandes), cabezas y caparazones eliminados y reservados, desvanecidos", "1 cucharada de aceite vegetal", "ramita de tomillo fresco", "ramita de albahaca fresca, más extra para decorar", "1 cucharada de puré de tomate", "200ml / 7fl oz de caldo de pollo", "1 limón, solo jugo", "sal y pimienta negra recién molida", "2 tomates de ciruela maduros, pelados, sin semillas, en rodajas", "1 ronda de lechuga, hojas separadas", "1 cucharada de aceite de oliva extra virgen", "1 bulbo de hinojo, finamente cortado"], "method": ["Cocine las papas en agua hirviendo con sal durante 5-6 minutos, o hasta que estén tiernas, luego escurra. Cortar las papas y mantener caliente.", "Mientras tanto, cocine el maíz en la mazorca en agua hirviendo durante 5-6 minutos, o hasta que esté tierno. Escurrir bien y reservar para enfriar un poco. Una vez que se enfríe lo suficiente como para manejarlo, corte los granos de la mazorca en un tazón.", "Calentar la mantequilla en una cacerola hasta que se derrita, luego escalfar las gambas durante 5-6 minutos o hasta que estén rosadas y recién cocidas. Retire los langostinos de la mantequilla y manténgalos calientes. Reserve la mantequilla.", "Mientras tanto, caliente el aceite en una sartén y fríe las cabezas y cáscaras reservadas de las gambas, usando una cuchara de madera para aplastar las conchas mientras se cocinan. Agregue el tomillo, la albahaca, el puré de tomate y el caldo de pollo y ponga la mezcla a ebullición. Cocine a fuego lento durante 2-3 minutos, luego cuele la mezcla en una olla limpia. Continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la mantequilla derretida reservada y mezcle la mezcla hasta que esté emulsionada, usando una licuadora de mano. Sazonar, al gusto, con jugo de limón, sal y pimienta negra recién molida.", "Mientras tanto, cocine los granos de maíz en agua hirviendo durante 5-6 minutos, o hasta que estén tiernos. Escurra bien. Coloque los granos de maíz, los tomates, las gambas y el hinojo en la salsa.", "Coloque las hojas de lechuga en un recipiente, agregue un chorrito de jugo de limón, el aceite de oliva virgen extra y un poco de salsa y mezcle hasta que se combinen.", "Para servir, coloque las hojas de lechuga en los platos para servir, cubra con las rodajas de patata y cubra la salsa"], "url": "www_bbc_co_uk_food_recipes_butter-poached_prawns_50564", "title": "Langostinos escalfados a la mantequilla con ensalada de jardín tibia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz oz yogur", "1 lima, solo jugo", "15 g / ½ oz de ajo, triturado", "Jengibre fresco de la raíz de los 2.5cm / 1in, rallado", "1 cucharadita de comino molido", "1 cucharada de cilantro molido", "1 cucharadita de sal masala", "pizca de pimentón", "pizca de sal", "4 pechugas de pollo de 150g / 5½oz", "25 g / 1oz de mantequilla sin sal, derretida", "½ limón", "100g / 3½oz de mantequilla sin sal", "1 cebolla rallada", "Jengibre fresco de la raíz de los 2.5cm / 1in, rallado", "2 dientes de ajo, aplastados", "100g / 3½ oz de puré de tomate", "2 chiles rojos pequeños", "pizca de chile en polvo", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida", "puñado de cilantro fresco", "pan naan", "arroz basmati"], "method": ["Para el adobo, mezcle todos los ingredientes del adobo en un tazón hasta que estén bien combinados. Agregue las pechugas de pollo y asegúrese de que estén bien cubiertas en el adobo. Reserve para marinar en la nevera durante 12 horas o durante la noche.", "cuando el pollo esté marinado, precaliente la parrilla a su nivel más alto. Retire las pechugas de pollo del adobo, sacuda el exceso y ase de 3 a 4 minutos por cada lado, o hasta que el revestimiento esté dorado. Hilvane las pechugas de pollo con la mantequilla y un poco de jugo de limón.", "Precalienta el horno a 200C / 400F / Gas 6 y tuesta el pollo durante 10-12 minutos, o hasta que esté cocido.", "Mientras tanto, para la salsa, caliente la mantequilla en una sartén a fuego medio y fría la cebolla durante 4-5 minutos, o hasta que se ablande. Agregue el jengibre y el ajo y cocine por un minuto más, luego agregue el puré de tomate, los chiles y el chile en polvo y cocínelos por otros 2-3 minutos.", "Reduzca el fuego, agregue la crema y cocine a fuego lento durante un minuto más, luego agregue las pechugas de pollo a la salsa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva con arroz basmati y pan naan.", "Para servir, coloque las pechugas de pollo con mantequilla sobre los platos para servir y rocíe sobre la salsa. Espolvorea sobre el cilantro. Coloque el arroz basmati al lado y sirva con pan naan."], "url": "www_bbc_co_uk_food_recipes_butter_chicken_74537", "title": "Pollo de mantequilla", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter_chicken_74537_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de chile en polvo", "2 cucharaditas de comino molido", "1 cucharada de sal masala", "1 cucharadita de cilantro molido", "6 dientes de ajo, picados", "½ cucharadita de cúrcuma molida", "½ cucharadita de canela molida", "Jengibre fresco de la raíz de los 7.5cm / 3in, apenas cortado", "50g / 1¾oz de anacardos, aproximadamente picados", "2 limones, solo jugo", "150g / 5½oz de yogurt natural sin grasa", "4 grandes pechugas de pollo sin piel sin hueso, cortadas en dados de 2.5cm / 1in", "1 cucharada de aceite vegetal", "1 ramita de canela", "4 vainas de cardamomo, divididas", "2 chiles verdes largos, finamente rebanados", "1 x 400 g de tomate picado", "75g / 2½oz de mantequilla fría, más 25 g / 1oz de mantequilla derretida", "Crema doble 50ml / 2fl oz", "Harina integral de 250 g / 9 oz, más extra para quitar el polvo", "sal y pimienta negra recién molida"], "method": ["Mezcle el chile en polvo, el comino, el garam masala, el cilantro, 3 dientes de ajo, la cúrcuma, la canela, el jengibre y los anacardos en un puré fino en un procesador de alimentos. Agregue la mitad del jugo de limón y blitz una vez más hasta que quede suave. Agregue el yogur hasta que esté bien combinado.", "Coloque las pechugas de pollo en un recipiente y vierta sobre el adobo, mezcle para cubrir. Marinar en la nevera durante 1 hora.", "Precaliente la parrilla a su configuración más alta y coloque un estante del horno en el medio del horno.", "Transfiera el pollo marinado a una bandeja de parrilla forrada con papel de aluminio. Grill durante 12-15 minutos, hasta que el adobo se haya dorado y el pollo esté recién cocido.", "Mientras tanto, caliente el aceite en una sartén a fuego medio. Agregue la canela y las vainas de cardamomo y saltee durante 1 minuto, hasta que estén fragantes. Agregue el ajo restante, los chiles y los tomates y cocine a fuego lento durante 4-5 minutos.", "Agregue el pollo a la parrilla y cocine durante 4-5 minutos más, hasta que la salsa se haya espesado un poco y el pollo esté bien cocido.", "Batir la mantequilla fría un poco a la vez, luego agregue la crema y cocine a fuego lento durante otros 2 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Mientras tanto, haz algunos chapatis, apila la harina en una superficie de trabajo limpia y haz un pozo en el centro. Poco a poco y con cuidado agregue 250ml / 9fl oz de agua fría, tirando de la harina desde los bordes internos del pozo para combinar, hasta que la mezcla se una como una masa suave. Amasar hasta que esté suave, liso y elástico.", "Divida la masa en 4 piezas y luego enrolle cada pieza en una bola. Estire las bolas sobre una superficie de trabajo enharinada para formar un disco plano de 2-3 mm de espesor.", "Caliente una sartén de plancha o una sartén antiadherente a fuego alto hasta que esté muy caliente. Cocine los chapatis uno a la vez hasta que queden carbonizados, aproximadamente 20 segundos en cada lado. Cuando el chapati está cocido, se formarán burbujas en su superficie. Cepille los chapatis cocidos con la mantequilla derretida.", "Sirve el pollo con mantequilla con los chapatis."], "url": "www_bbc_co_uk_food_recipes_butter_chicken_curry_and_92429", "title": "Mantequilla de pollo al curry y chapati", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter_chicken_curry_and_92429_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz deshuesado, muslos de pollo sin piel, cortado en dos", "120g / 4oz de yogur griego", "2 cucharadas de jengibre y pasta de ajo", "1 cucharada de aceite vegetal", "1½ cucharadita de sal", "1 limón, solo jugo", "3 cucharaditas de chile rojo en polvo", "1 cucharada de comino molido", "½ cucharadita de sal masala", "1kg / 2lb 4oz de tomates", "Jengibre fresco de raíz de 5cm / 2 pulgadas, pelado, medio aplastado y medio picado fino", "4 dientes de ajo, pelados", "4 vainas de cardamomo verde", "1 hoja de laurel", "1 cucharada de chile rojo en polvo", "80 g / 3 oz de mantequilla, en cubitos", "2 chiles verdes, hendidura longitudinal", "5 cucharadas de crema individual", "1 cucharadita de sal", "2 cucharaditas de hojas secas de fenogreco, aplastadas entre las puntas de los dedos", "½ cucharadita de sal masala", "sal y pimienta", "1 cucharada de azúcar", "2 cucharadas de cilantro fresco picado, para decorar", "2 cucharadas de aceite vegetal", "1 cebolla, finamente rebanada", "3 vainas de cardamomo verde, aplastadas", "1 palito de canela, partido por la mitad", "4 dientes", "400g / 14oz de arroz basmati", "100 g / 3½ oz de mantequilla sin sal, cortada en cubitos"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para el adobo, haga pequeños cortes en las piezas de pollo con un cuchillo afilado para ayudar al adobo a penetrar.", "Mezcle el resto de los ingredientes en un tazón hondo. Unta el pollo cortado con el adobo, cúbrelo y déjalo a un lado en la nevera durante 10 minutos.", "Levante los pedazos de pollo del adobo y colóquelos en una bandeja para hornear. Hornee el pollo en el horno durante 13-15 minutos. Es posible que deba girar las piezas después de 8-10 minutos para asegurarse de que el color sea uniforme en ambos lados. (El pollo no debe estar completamente cocido en este punto, ya que se cocinará a fuego lento unos minutos más en la salsa). Cuele los jugos de cocción a través de un colador fino y déjelos a un lado.", "Para la salsa, coloque los tomates en una sartén con 125 ml / 4 fl oz de agua, el jengibre triturado, el ajo, el cardamomo y la hoja de laurel. Cocine a fuego lento hasta que los tomates estén completamente desintegrados.", "Licuar con una batidora y pasar la salsa por un colador para obtener un puré suave. Regrese a un recipiente limpio, agregue el chile en polvo y cocine a fuego lento de 12 a 15 minutos. Debería comenzar a espesarse lentamente. Cuando la salsa se vuelva brillante, agregue las piezas de pollo y los jugos de cocina reservados. Vierta en una taza de agua y cocine a fuego lento durante aproximadamente 3-5 minutos, o hasta que el agua se absorba y la salsa vuelva a su consistencia brillante original.", "Bata lentamente la mantequilla, un par de piezas a la vez, y cocina a fuego lento durante 6-8 minutos, o hasta que el pollo esté cocido y la salsa comience a adquirir un glaseado. Agregue el jengibre picado, los chiles verdes y la crema y cocine a fuego lento durante un minuto o dos más, teniendo cuidado de que la salsa no se parta. Agregue la sal, las hojas de alholva trituradas y el garam masala, luego revise el condimento. agregando sal y pimienta al gusto y agregue el azúcar.", "Para la mantequilla de arroz, caliente el aceite en una cacerola grande y, una vez caliente, agregue la cebolla. Cocine hasta que las cebollas estén doradas, esto tomará aproximadamente 10 minutos.", "Agregue el cardamomo, la canela y el clavo de olor. Agregue el arroz y revuelva para cubrir con la mezcla de especias de cebolla. Agregue 600ml / 20fl oz de agua y lleve a ebullición, reduzca el fuego a bajo y cubra con una tapa. Cocine durante 15 minutos, luego apague el fuego, dejando la tapa puesta, y deje que hierva durante otros 15 minutos.", "Justo antes de servir tenedor a través de la mantequilla.", "Sirva el pollo con mantequilla sobre una cama de arroz y decore con el cilantro."], "url": "www_bbc_co_uk_food_recipes_butter_chicken_with_47272", "title": "Pollo con mantequilla y arroz con mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 ml / 5 oz de yogur natural", "50 g / 2 oz de almendras molidas", "1 cucharadita de chile en polvo", "2 chiles de ojo de pájaro, picados", "½ cucharadita de canela molida", "1 cucharada de sal masala", "6 vainas de cardamomo verde, partidas y semillas ligeramente trituradas", "4 dientes de ajo, toscamente picados", "25 g / 1 oz de raíz de jengibre fresco, toscamente picado", "1 x 400g / 14oz de tomates picados en lata", "4 pechugas de pollo, deshuesadas y sin piel, cortadas en tiras largas", "50g / 2oz de mantequilla", "1 cebolla grande, finamente rebanada", "2 chiles de ojo de pájaro, cortados en rodajas finas", "150ml / 5fl oz de crema doble", "200ml / 7fl oz de caldo de pollo", "4 cucharadas de hojas de cilantro, picadas", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "Papas para astillado de 400g / 14oz, peladas y cortadas en bastones de 1cm x 1cm x 6cm / ½in x ½in x 2½in de largo"], "method": ["Para el adobo, coloque todos los ingredientes, excepto el pollo, en un procesador de alimentos y mezcle con un puré.", "Viértalo en un bol y luego agregue el pollo, mezcle bien y luego colóquelo en la nevera para que se deje marinar durante al menos una hora.", "Para el curry, caliente una sartén grande hasta que esté caliente, agregue la mitad de la mantequilla y la cebolla y los chiles y cocine durante 10 minutos hasta que estén dorados y suaves. Retire la mezcla de la sartén y déjela a un lado.", "Regrese la sartén al fuego y luego levante el pollo del adobo y cocine en tandas a fuego alto durante 1-2 minutos hasta que se coloreen.", "Regrese la mezcla de cebolla, el pollo y el adobo a la sartén y deje hervir a fuego lento. Agregue la crema y el caldo de pollo, vuelva a hervir a fuego lento y cocine durante 5-10 minutos hasta que el pollo esté bien cocido y la salsa espesada. Sazonar, al gusto, con sal y pimienta negra recién molida y luego revolver a través del cilantro.", "Para las papas fritas, caliente el aceite vegetal en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje la bandeja desatendida). Alternativamente, caliente una freidora a 160 ° C.", "Coloque las papas en el aceite caliente, unas pocas a la vez, y cocine en lotes durante 2-3 minutos hasta que estén tiernas pero no coloreadas. Drene en papel de cocina y suba el fuego a 190C / 375F.", "Coloque los chips semicocidos nuevamente en aceite en lotes y cocine por otros 2-3 minutos hasta que estén dorados y crujientes.", "Para servir, apile las papas fritas en los platos para servir y coloque el curry al lado."], "url": "www_bbc_co_uk_food_recipes_butter_chilli_chicken_91839", "title": "Mantequilla de pollo con chips de chili", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo de 1.5 kg / 3 lb 5 oz", "2 limones, cortados por la mitad", "2 cucharadas de aceite vegetal", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "1 cucharadita de canela molida", "1 cucharadita de cúrcuma", "1 cucharadita de chile en polvo", "½ cucharadita de cardamomo molido", "2 cucharadas de aceite vegetal", "2 cebollas, finamente cortadas", "2 chiles rojos largos, en rodajas finas", "1 cucharadita de chile en polvo", "2 hojas de laurel machacadas", "½ cucharadita de canela molida", "1 cucharada de sal masala", "4 dientes de ajo, en rodajas finas", "Jengibre fresco de la raíz 25g / 1oz, rallado fino", "50 g / 2 oz de almendras molidas", "400g / 14oz de tomates picados en lata", "150ml / 5fl oz de crema doble", "150ml / 5fl oz de caldo de pollo", "sal y pimienta negra recién molida", "4 cucharadas de hojas de cilantro, picadas", "400 g / 14 oz de lentejas cocinadas con estaño, escurridas", "1 cebolla roja, finamente picada", "2 tomates, sin semilla y picados", "2 chiles rojos largos, sin semillas y en rodajas finas", "3 cucharadas de hojas de cilantro picado", "3 cucharadas de hojas de menta picadas", "1 limón, solo jugo", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta el pollo por la espina dorsal y aplástalo con la palma de la mano, con la piel hacia arriba.", "Cortar varias barras en la carne y luego frotar con los limones y un poco de aceite vegetal.", "Mezcle las especias juntas en un tazón y frote en el pollo.", "Caliente una sartén a prueba de horno hasta que esté caliente, coloque el pollo con la piel hacia abajo, y los limones con el lado hacia abajo, sobre la plancha y espere 2-3 minutos hasta que estén coloreados y carbonizados en los bordes. Retire el limón de la plancha y deje a un lado.", "Voltee, rocíe con un poco más del aceite, luego coloque toda la sartén en el horno y tueste durante 25-30 minutos hasta que esté bien cocida, y los jugos salgan limpios cuando la carne esté perforada.", "Retire el pollo cocido del horno y descanse durante 10 minutos antes de cortar en porciones.", "Para la salsa de masala, caliente una sartén grande hasta que esté caliente, agregue el aceite vegetal, las cebollas y los chiles, y cocine por 10 minutos hasta que las cebollas estén doradas y suaves.", "Agregue las especias, el ajo y el jengibre y cocine por otros dos minutos.", "Agregue las almendras molidas y los tomates y cocine a fuego lento y luego agregue la crema y el caldo. Regrese a fuego lento y cocine durante 10-15 minutos hasta que la salsa se espese.", "Compruebe el condimento y agregue sal y pimienta negra recién molida al gusto, luego revuelva a través del cilantro.", "Para la ensalada de lentejas, coloque todos los ingredientes en un tazón y mezcle cuidadosamente, luego sazone con un poco de sal y pimienta negra recién molida.", "Para servir, apile la ensalada de lentejas en cada plato y coloque un par de trozos de pollo al costado, espolvoree la salsa y termine con un limón chamuscado."], "url": "www_bbc_co_uk_food_recipes_butter_chilli_13339", "title": "Pollo salpicado de especias con salsa de chile masala y ensalada de lentejas puy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 langosta", "50g / 1¾oz de mantequilla", "2 cucharadas de azúcar", "pizca de sal", "1 estrella de anís", "1 cardamomo debajo", "1 vaina de vainilla", "2 cm / 1 en pieza de jengibre fresco", "2 zanahorias, cortadas en cubitos", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "2 cucharaditas de crema", "1 cucharada de aceite de oliva", "1 chalote, finamente picado", "1 zanahoria, finamente picada", "1 palo de apio", "10g / 1 / 3oz de hinojo", "1 cm / ½ en pieza de jengibre fresco", "1 palo de limoncillo", "1 ramita de verbena de limón (hojas frescas o secas)", "60ml / 2fl oz de caldo de verduras", "60ml / 2fl oz de pollo consumido", "3 cucharadas de crema", "limón, solo jugo", "azúcar pizca pequeña", "25g / 1oz de habas", "15g / ½ oz de mantequilla", "sal y azúcar, al gusto", "3 colmenas", "4 cucharaditas de pollo comido", "15g / ½ oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para el puré de zanahoria con especias, ate el anís estrellado, el cardamomo, la vainilla y el jengibre en una bolsa de muselina.", "Coloque las zanahorias en una sartén con la bolsa de especias, mantequilla (reservando una pequeña cantidad), sal y pimienta, y suficiente agua para cubrir. Cocine lentamente hasta que las zanahorias estén tiernas, retire las especias y reserve.", "Escurra las zanahorias, reservando el agua para cocinar. En una licuadora, licuar las zanahorias hasta lograr un puré suave. Use parte del agua reservada para aflojar el puré si es necesario. Agregue la mantequilla y la crema restante.", "Para la salsa de verbena de limón, caliente el aceite en una sartén y fría los chalotes, las zanahorias, el apio y el hinojo hasta que estén suaves pero no coloreados.", "Agregue el jengibre y la hierba de limón, y cocine suavemente durante 15 minutos.", "Agregue el caldo de verduras y el consomé de pollo, lleve a ebullición y cocine a fuego lento durante 30 minutos.", "Retire del fuego y agregue las hojas de verbena de limón. Poner a un lado para infundir en una sartén cubierta durante cinco minutos, luego pasar a través de un chino o un tamiz de metal fino.", "Agregue la crema y bata vigorosamente a una espuma ligera, sazone con sal y pimienta, al gusto, y termine con jugo de limón y azúcar.", "Para la langosta, para matar a la langosta viva, colóquela en el congelador durante 30 minutos para aturdirla y luego hállela justo detrás de la cabeza con un cuchillo afilado y pesado o un pincho.", "Separe las garras y la cola de la cabeza.", "En una sartén con agua hirviendo, blanquear las pinzas durante cinco minutos y la cola durante tres minutos, retirar y actualizar en agua helada.", "Retire la carne de langosta de la cáscara, manteniendo la carne en pedazos grandes.", "Para las habas, pula las habas y luego quítelas rápidamente.", "Para cocinar las colmenillas, quíteles los tallos y lávelos rápidamente para asegurarse de que no haya arena adentro. Asar en una emulsión del consomé y 15 g / ½ onza de mantequilla. Sazonar, al gusto, con sal y pimienta negra recién molida. Cocine suavemente hasta que esté suave.", "Para terminar de cocinar las habas, derrita la mantequilla en una sartén. Agregue dos cucharadas de agua, una pizca de sal y una pizca de azúcar y mezcle para hacer una emulsión. Agregue las habas y deje que se caliente durante unos minutos.", "Cuando esté listo para servir, vuelva a calentar la langosta fundiendo la mantequilla con dos cucharadas de azúcar, una pizca de sal y un poco de agua en una sartén. Mezcle para hacer una emulsión. Agregue la carne de langosta y deje reposar el fuego durante tres minutos para que se caliente.", "Para servir, coloca una cucharada de puré de zanahoria en el centro de cada plato. Coloque la carne de langosta en la parte superior. Vístase con las colmenillas y las habas. Coloque la salsa de verbena alrededor del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_butter_poached_lobster_45901", "title": "Langosta de mantequilla escalfado, puré de zanahoria con especias y salsa de verbena de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]