[{"ingredients": ["900g / 2lb de frutas secas mezcladas (como higos, albaricoques, guindas, pasas, dátiles, arándanos o sultaninas)", "150ml / 5fl oz de brandy o whisky", "1 naranja grande, ralladura de ralladura y jugo", "225g / 8oz de mantequilla, ablandada, más extra, derretida, para engrasar", "225g / 8oz de azúcar moreno oscuro", "4 huevos grandes de gallinas camperas, golpeados", "Harina de auto crianza 110g / 4oz", "110g / 4oz de pan rallado fresco", "85g / 3oz de nueces picadas (almendras, avellanas o nueces)", "1 cucharadita de nuez moscada recién rallada", "1 cucharadita de canela apilada", "brandy, para flamear", "cerezas frescas", "flan, crema espesa o helado"], "method": ["Coloque la fruta seca en un tazón grande (corte cualquier pieza grande de albaricoque o higo para que todas las piezas de fruta sean aproximadamente del mismo tamaño). Vierta el brandy o el whisky.", "Agregue la ralladura de naranja rallada a la fruta, luego vierta sobre el jugo de naranja.", "Mezcle todo el contenido del recipiente hasta que esté bien combinado. Cubra el recipiente con film transparente y déjelo en un lugar fresco durante la noche.", "Al día siguiente, engrase ligeramente dos recipientes de pudín de 1,2 litros / 2 pinta con la mantequilla derretida y coloque un disco de papel antigrasa en la base de cada uno.", "En un tazón muy grande, mezcle la mantequilla y el azúcar ablandados hasta que estén pálidos y esponjosos con un batidor eléctrico (esto tomará aproximadamente cinco minutos).", "Batir los huevos batidos, poco a poco, incorporando cada adición en la mezcla antes de agregar la siguiente. (NB: si la mezcla comienza a cuajarse, simplemente mezcle con una cucharada de harina).", "Cuando todos los huevos se hayan incorporado a la mezcla, agregue la fruta empapada y los jugos empapados y revuelva bien para combinar.", "Agregue la harina y las migas de pan a la mezcla y revuelva para combinar.", "Agregue las nueces y especias y mezcle suavemente hasta que estén bien combinados. (NB: la mezcla debería ser de caída constante).", "Vierta la mezcla en los cuencos de pudín preparados y cubra con una doble capa de papel resistente a la grasa y una hoja de papel de aluminio. Atar con una cuerda.", "Prepare un vaporizador y cocine al vapor los postres durante cuatro horas. Puede comer los pudines en esta etapa, o puede enfriarlos por completo y guardarlos, en sus cuencas, durante 2 a 3 meses, en un lugar fresco y oscuro, volviéndolos a hervir durante dos horas antes de servirlos.", "Para servir, retire con cuidado los postres de las cubetas y conviértelos a un plato de servir.", "Adorne la parte superior de los postres con las cerezas. Con cuidado, apaga el brandy con una cerilla. Deje que las llamas se enciendan, luego vierta el brandy sobre los postres. (PRECAUCIÓN: Mantenga la llama lejos de los ojos, el cabello y la cara).", "Adorne cada ración con algunas cerezas extra y sírvalas con crema pastelera, crema espesa o helado."], "url": "www_bbc_co_uk_food_recipes_christmaspudding_90194", "title": "Último minuto pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 2 pudines de x1 litro", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmaspudding_90194_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ cucharadita de canela molida", "generoso pinch clavos de tierra", "5 cucharadas de aguardiente o ron oscuro", "350g / 12oz de frutas secas variadas: pasas, pasas, grosellas, cerezas, jengibre cristalizado (picado), cáscara mixta, ciruelas (picadas), albaricoques (picados), higos (picados) o cualquier otra cosa que desee", "200ml / 7fl oz de yogur puro de vaca, oveja, cabra O yogur de soja", "100 ml / 3½ fl oz crema de vacas, cabras o soja O crema de avena 300 ml / 10 fl oz", "2 cucharadas de miel"], "method": ["Mezcle las especias en el brandy o ron y déjelos en infusión durante 30 minutos.", "Verter el líquido sobre las frutas mezcladas y dejar en remojo durante un par de horas.", "Mezcle el yogur con la crema y la miel, luego mezcle con las frutas empapadas.", "Coloque la mezcla en una máquina para hacer helados y revuelva en la configuración de \"congelación\" durante 15-20 minutos.", "Retírelo del congelador y colóquelo en un recipiente pequeño con leche, y coloque la tapa sobre el recipiente o cúbralo con una película adhesiva. Congelar.", "Para servir, envuelva el recipiente en un paño caliente para aflojarlo y voltee el pudín en un plato. Coloque un poco de holly en la parte superior y, si lo desea, vierta un poco de brandy caliente en la parte inferior y enciéndalo para servir."], "url": "www_bbc_co_uk_food_recipes_christmaspuddingicec_77305", "title": "Helado con leche de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de chocolate negro, picado", "150g / 5oz de chocolate con leche, picado", "175g / 6oz de mantequilla, ablandada, más extra para engrasar", "4 cucharadas de jarabe de oro", "200 g / 7 oz de galletas amaretti", "150g / 5oz sin cáscara de nueces de Brasil", "150g / 5oz de cerezas rojas glacé", "125g / 4oz mini malvaviscos", "1 cucharada de azúcar glas", "Brillo comestible, para decorar (opcional)"], "method": ["Coloque los pedazos oscuros y de chocolate con leche en una sartén de base pesada. Agregue la mantequilla y el sirope dorado y cocine a fuego lento para derretir y combinar.", "Coloque las galletas amaretti en una bolsa de congelador y golpee con un rodillo para hacer migas de varios tamaños.", "Coloque las nueces de Brasil en otra bolsa de congelador y golpee de la misma manera.", "Retire la sartén de la mezcla de chocolate fundido del fuego y agregue los bizcochos y nueces triturados.", "Agregue las cerezas glacé y mini malvaviscos. Dobla la mezcla cuidadosamente para cubrir todos los ingredientes sólidos con la mezcla de chocolate almibarado.", "Vierta la mezcla en una bandeja para hornear engrasada y revestida de 25cm / 10in x 30cm / 12in y alise la superficie tanto como sea posible (aunque se verá llena de baches).", "Refrigere por dos horas o hasta que esté lo suficientemente firme para cortar. Polvo con azúcar glas y espolvorear con brillo comestible si lo desea.", "Retire el bloque de la carretera rocosa de la bandeja y corte en 24 rectángulos."], "url": "www_bbc_co_uk_food_recipes_christmasrockyroad_90624", "title": "Camino rocoso de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasrockyroad_90624_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de brandy", "2 cucharadas de licor de naranja", "5 cucharadas de jugo de naranja fresco", "2 tortas de Madeira hechas a mano, cortadas y cortadas en rodajas", "100g / 3½oz de azúcar glasé", "100 g / 3½ oz de pudín de Navidad listo, hecho y roto en pedazos", "1 vaina de vainilla, partido, semillas raspadas", "Crema doble de 450 ml / 16 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "85 g / 3 oz de chocolate negro (70 por ciento de sólidos de cacao), rallado", "85g / 3oz de chocolate negro (70 por ciento de sólidos de cacao), derretido, más extra para servir", "crema doble, para servir"], "method": ["Cubra una cubeta o cuenca de fondo redondo con una capacidad de 1½ litros / 2½ pinta de capacidad con película adhesiva.", "Coloque el brandy, el licor de naranja y el jugo de naranja en un tazón limpio y sumerja las rebanadas de pastel de Madeira en un poco de remojo.", "Coloque tres cuartas partes de las rebanadas de pastel empapado en el tazón forrado con film adhesivo para cubrir el interior del tazón.", "En otro recipiente, coloca el azúcar glas, la crema y las semillas de vainilla y dóblalas suavemente.", "Coloque el chocolate rallado, los trozos de pudin de Navidad y las tres cuartas partes de la mezcla de crema en un recipiente limpio y mezcle bien. Extienda esta mezcla de crema y pastel de Navidad sobre las rebanadas de pastel, moldeando un hueco en el centro de la crema y la mezcla de pastel de Navidad.", "Agregue el chocolate derretido a la mezcla de crema restante y vierta esto en el hueco. Allanar.", "Coloque las rodajas de pastel húmedas restantes sobre el relleno para cerrar completamente el relleno, luego cúbralo con una toalla de té limpia y colóquelo en el refrigerador para que se enfríe durante 24 horas.", "Para servir, retire del refrigerador, retire la cubierta y coloque la torta en un plato. Retire la película adhesiva si se ha pegado a la torta, luego vierta un poco de chocolate derretido. Cortar rebanadas generosas y servir con crema."], "url": "www_bbc_co_uk_food_recipes_christmasstylezucott_84677", "title": "Zuccotto estilo navideño", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2oz de arroz basmati, cocido según las instrucciones del paquete", "pizca de cúrcuma", "1 limón, ralladura solamente", "1 cebolla, finamente picada", "600g / 1lb 5 oz de champiñones marrones, en rodajas", "50g / 2oz de mantequilla, derretida", "1 cucharada de perejil fresco picado", "1 cucharada de estragón fresco picado", "1 cucharada de arándanos secos", "2 huevos de gallinas camperas, duros, picados", "sal y pimienta negra recién molida", "250 g / 9 oz de hojaldre laminado", "1 huevo de gallinas camperas, golpeado", "1 cucharadita de semillas de sésamo", "salsa vegetariana, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Combine el arroz cocido, la cúrcuma y la ralladura de limón y reserve, cubra, en el refrigerador.", "Calentar la mantequilla en una sartén a fuego medio, agregar la cebolla y el champiñón y freír durante 3-4 minutos, o hasta que se ablanden. Dejar de lado para enfriar.", "Agregue el arroz cocido, las hierbas, los arándanos y los huevos duros hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la masa, corte un rectángulo de 40cm x 20cm / 15in x 8in de la masa de hojaldre.", "Vierta la mezcla de arroz en el centro de la masa. Traiga los lados de la masa juntos y selle. Cepille todo con huevo batido y deje enfriar por 30 minutos.", "Espolvoree el paquete de repostería con semillas de sésamo y hornee en el horno durante 30 minutos, o hasta que estén crujientes y doradas.", "Para servir, coloque una porción del Wellington en cada uno de los seis platos para servir. Vierta la salsa vegetariana."], "url": "www_bbc_co_uk_food_recipes_christmasveggiewelli_90569", "title": "Veggie de Navidad Wellington", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasveggiewelli_90569_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 manzanas Bramley para cocinar grandes (que pesan alrededor de 900 g / 2 lb)", "1 naranja grande, ralladura y jugo solamente", "2 ramitas de romero", "225 g / 8 oz zarzamoras", "salpicaduras de agua", "30 g / 1½ oz de azúcar en polvo", "55 g / 2 oz de almendras molidas", "Harina normal 140g / 5oz", "Polenta de 85g / 3oz (no de cocción rápida)", "140g / 5oz de mantequilla, fría", "110g / 4oz de azúcar mascabado ligero", "salpicaduras de agua", "crema espesa o crema"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para rellenar, pelar, cortar y amasar las manzanas y cortar en trozos grandes. Coloque en un plato para horno poco profundo.", "Zest y jugo la naranja, agregando la ralladura y el jugo a las manzanas. Mezcle con sus manos.", "Frote las ramitas de romero y esparza sobre las manzanas. Mezcle las moras, agregue un chorrito de agua y espolvoree sobre el azúcar.", "Para la cobertura de crumble, coloque las almendras, la harina, la polenta, la mantequilla y el azúcar en un procesador de alimentos y pulse brevemente varias veces, solo para mezclar. La mezcla debe verse como pan rallado grueso.", "Incline en un recipiente y agregue un chorrito de agua. Usa una cuchara para mezclar brevemente, debe ser bastante grumosa.", "Espolvorea la mezcla de crumble sobre la fruta.", "Coloque en el horno y hornee durante 20 minutos.", "Baje el fuego a 180 ° C / 350 ° F / Gas 4 y cocine por otros 20-25 minutos, hasta que la parte superior esté dorada y burbujee.", "Sirva con crema o natilla."], "url": "www_bbc_co_uk_food_recipes_chunkyapplecrumble_90202", "title": "Crumble de manzana gruesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chunkyapplecrumble_90202_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "160g / 6½oz de harina natural", "1 cucharadita de polvo de hornear", "20g / 1oz de mantequilla, ablandada", "1 manzana mediana de postre, pelada", "60g / 2oz de queso cheddar maduro, rallado, más un poco extra para rociar", "1 huevo", "50ml / 1fl oz de jugo de manzana"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cepille el interior de una lata de pan de 500 g con un poco de aceite y colóquelo en una bandeja para hornear.", "Coloque la harina, el polvo de hornear y la mantequilla en un tazón. Frótelos con la punta de los dedos (como si estuviera haciendo cosquillas a la mezcla) hasta obtener una mezcla fina y desmenuzable.", "Pídele a un adulto que te ayude a cortar la manzana en trozos pequeños. Agregue estos a la taza con el queso rallado.", "Ahora rompa el huevo en la taza y bátalo con el tenedor. Luego agrégalo a la mezcla de harina. Agregue un poco de jugo de manzana para humedecer la mezcla. Debe ser una pasta espesa, por lo que es posible que no necesite todo el jugo de manzana.", "Con una cuchara, coloca la mezcla en la lata del pan y espolvorea la parte superior con el queso extra. Pídale a un adulto que lo ponga en el horno durante unos 20-25 minutos, o hasta que esté dorado y haya subido bien. Sirve el pan con trozos de manzana fresca."], "url": "www_bbc_co_uk_food_recipes_chunky_cheese_loaf_74948", "title": "Pan de queso grueso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 5", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "½ cebolla roja, más o menos picada", "Apioalerio de 150 g / 5½ oz, pelado y cortado en cubos de 2½ cm / 1 in", "1 cucharada de puré de tomate", "pizca de copos de chile seco", "100g / 3½oz de lentejas puy", "200 ml / 7 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "hoja de albahaca fresca, para adornar"], "method": ["Coloque el aceite de oliva en una cacerola a fuego medio. Agregue el ajo, la cebolla y el apionabo, y fría por dos minutos, revolviendo ocasionalmente.", "Agregue el puré de tomate y las hojuelas de chile y cocine por un minuto más.", "Agregue las lentejas y el caldo y deje que hierva. Reduzca el fuego a fuego lento durante 15 minutos, revolviendo ocasionalmente.", "Sazonar, al gusto, con sal y pimienta negra recién molida y verter en un recipiente tibio. Adorne con una hoja de albahaca y sirva."], "url": "www_bbc_co_uk_food_recipes_chunkyceleriacsoup_80861", "title": "Sopa de apio y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "6 chiles secos largos", "2 cucharaditas de pimienta de Sichuan", "1 anís estrellado entero (opcional)", "100 g / 3½ oz de lardons ahumados, cortados en trozos de 1cm / ½ en gruesos", "1 chile rojo, sin semillas, finamente picado", "1-2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de vinagre de arroz claro o vinagre de sidra", "2 cucharadas de aceite de sésamo tostado", "200g / 7oz de pepino, cortado a la mitad longitudinalmente, sin semillas y cortado en trozos de 1cm / ½ en gruesas", "Una pizca de sal marina", "1-2 pizca de copos de chile seco", "1 cucharada de jugo de lima", "1 cucharada de aceite de chile", "1 pequeño puñado de hojas frescas de cilantro, toscamente picadas", "cacahuetes tostados en seco (opcional)"], "method": ["Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue los chiles secos y los granos de pimienta de Sichuan. Revuelva freír durante unos segundos, o hasta que esté fragante.", "Agregue el anís estrellado (si se usa), los lardons de tocino y el chile y saltee durante 2-3 minutos, o hasta que los lardones se hayan dorado en los bordes.", "Agregue el vino de arroz o el jerez, el vinagre y el aceite de sésamo y saltee por unos segundos, luego agregue el pepino y saltee por unos segundos más.", "Sazone con sal marina, hojuelas de chile secas y jugo de lima, revolviendo bien.", "Coloque la salteada en un plato para servir, rocíe sobre el aceite de ají, decore con el cilantro picado, espolvoree algunos cacahuetes, si está usando, y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chunkybaconandcucumb_89286", "title": "Ensalada de tocino y pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "½ pimiento amarillo, picado", "150ml / ¼ litro de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "puñado de cohetes, finamente picado"], "method": ["Caliente el aceite en una cacerola pequeña y fría la cebolla hasta que se suavice pero no se coloree.", "Agregue el ajo y fría por un minuto.", "Agregue la pimienta y el caldo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento durante 6-8 minutos.", "Agregue el cohete y cocine a fuego lento por otros 2-3 minutos, o hasta que el pimiento esté tierno. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en un tazón de servir."], "url": "www_bbc_co_uk_food_recipes_chunkyyellowpepperan_87239", "title": "Sopa de rúcula y pimiento amarillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol, más extra para engrasar", "1 plátano maduro", "1 huevo de gallinas camperas, golpeado", "3 cucharadas de pasas", "1 cucharadita de extracto de vainilla", "50g / 2oz de azúcar en polvo de oro", "Harina común 110g / 4oz", "1 cucharadita de polvo de hornear"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata de pan con un poco de aceite de girasol.", "En un tazón grande, mezcle el puré de plátano con el aceite de girasol hasta que esté bien combinado. Batir el huevo, luego incorporar las pasas y el extracto de vainilla.", "En un recipiente aparte, mezcle el azúcar, la harina y el polvo de hornear.", "Revuelva los ingredientes secos en los ingredientes húmedos hasta que estén bien combinados.", "Vierta la mezcla de la torta en la lata de hogaza preparada y hornee en el horno durante 30-40 minutos, o hasta que una brocheta insertada en el centro de la tarta salga limpia. Poner a un lado para enfriar en una rejilla de alambre, luego cortar en rodajas y servir."], "url": "www_bbc_co_uk_food_recipes_chunky_banana_bread_27126", "title": "Pan de plátano grueso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "Leche 250ml / 9fl oz", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, partida por la mitad, semillas raspadas con la punta de un cuchillo afilado", "75g / 2¾oz de mantequilla", "25 g / 1 oz de azúcar", "4 duraznos maduros, piedras removidas y toscamente picadas", "2 ramitas grandes de albahaca fresca, solo hojas, rotas", "aceite vegetal, para freír", "Azúcar en polvo de 50 g / 2 oz, más extra para quitar el polvo", "75g / 2¾oz de mantequilla", "Harina normal de 200g / 7oz", "¼ cucharadita de polvo de hornear", "1 huevo de gallinas camperas"], "method": ["Para la crema pastelera, bata las yemas de huevo y la mitad del azúcar en un tazón hasta que estén pálidas y gruesas.", "Llevar la leche y la crema lentamente a ebullición con el azúcar restante y las semillas de vainilla, revolviendo bien.", "Cuando la leche esté hirviendo y el azúcar se haya disuelto, vierta la mezcla sobre la mezcla de huevo, batiendo continuamente hasta que esté bien combinada.", "Regrese la mezcla a la misma sartén y cocine a fuego lento, batiendo ocasionalmente, hasta que la crema espese lo suficiente como para cubrir el revés de una cuchara de madera. Colar en un recipiente y reservar.", "Para los melocotones, caliente 50 ml / 2 fl oz de agua con la mantequilla y el azúcar en una sartén tapada a fuego medio, hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Agregue los duraznos y la albahaca, cubra y cocine durante 5-10 minutos, o hasta que estén tiernos pero aún intactos y caramelizados en el fondo. Transfiera a un plato para servir, colocándolos con los lados caramelizados hacia arriba.", "Para los churros, caliente el aceite en una freidora a 150 ° C. Alternativamente, caliente el aceite en una olla profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En una olla aparte, ponga a hervir 250 ml / 9 fl oz de agua con el azúcar y la mantequilla. Cuando la mezcla esté hirviendo, retire la sartén del fuego, agregue la harina y el polvo de hornear de una sola vez e inmediatamente comience a batir hasta que la mezcla se una como una mezcla suave. Batir el huevo hasta que la mezcla esté suave y brillante.", "Coloque una manga pastelera con una boquilla grande en forma de estrella. Llene la manga pastelera con la mitad de la mezcla y coloque líneas cortas directamente en el aceite caliente, teniendo cuidado de mantener la cara lo más lejos posible de la fuente. Para cortar la mezcla, sumerja con cuidado un par de tijeras de metal en el aceite caliente, luego corte la masa a medida que la pipetea.", "Cocine los churros, en tandas, durante 5-6 minutos, o hasta que estén dorados y crujientes, luego retírelos y escurra sobre papel de cocina. Repita el proceso con la masa restante, luego espolvoree todos los churros con azúcar en polvo.", "Para servir, espolvorea la crema por encima y alrededor de los melocotones, con los churros amontonados en un plato."], "url": "www_bbc_co_uk_food_recipes_churros_with_peaches_and_16379", "title": "Churros con duraznos y crema pastelera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de harina blanca fuerte, más extra para enharinar", "7g de levadura instantánea", "30ml / 1fl oz de aceite de oliva, más extra para engrasar", "7g de sal", "harina de sémola, para enharinar"], "method": ["Combine la mitad de la harina y 4 g de la levadura con 150 ml / 5 fl oz de agua en un recipiente. Combínalo en una masa suave.", "Engrase una superficie de trabajo limpia y amasar la masa durante cinco minutos.", "Coloque la masa en un tazón limpio y engrasado y cubra con una película adhesiva o una toalla de té húmeda. Deje que se levante durante 3-6 horas, dependiendo de la temperatura ambiente. (Ver consejo para más detalles). La masa está lista una vez que ha duplicado su tamaño.", "Incline la mezcla en un mezclador de alimentos. Agregue la harina restante, el aceite, la levadura y 75 ml / 2 ½ oz de agua y mezcle con un accesorio de gancho de masa.", "Disuelva la sal en 75 ml / 2 ½ oz de agua y agregue gradualmente esto a la mezcla, mezcle durante 6-10 minutos, o hasta que la masa esté fibrosa y suave.", "Engrase un recipiente cuadrado grande de plástico con punta en la masa y colóquelo. Deje la masa para probar a temperatura ambiente hasta que haya duplicado su tamaño.", "Espolvorea una superficie de trabajo limpia con harina y sémola. Incline la masa sobre la superficie (estará muy húmedo) y cubra con más harinas, tratando de mantener una forma cuadrada y teniendo cuidado de no eliminar el aire. Cortar la masa en dos y estirar las piezas longitudinalmente en la clásica forma de ciabatta.", "Precaliente el horno a 220C / 200C Fan / Gas 7 y espolvoree las harinas sobre una bandeja para hornear.", "Con cuidado, coloque la masa en la bandeja de hornear y deje probar nuevamente durante otros 30 minutos. Hornee durante 30 minutos o hasta que los panes estén dorados y emitan un sonido hueco al tocar la base. Deja enfriar sobre una rejilla y sirve."], "url": "www_bbc_co_uk_food_recipes_ciabatta_05418", "title": "chapata", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ciabatta_05418_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz tipo italiano harina de pan '00'", "190ml / 7fl oz de agua", "15 g / ½ onza de levadura", "250g / 9oz tipo italiano harina de pan '00'", "10 g / ¼ oz de levadura", "190ml / 7fl oz de agua", "12 g / ½ oz de sal"], "method": ["Para la preparación durante la noche, mezcle la harina con el agua en un tazón grande y agregue la levadura. Batir durante tres minutos y dejar que se levante durante la noche (o al menos ocho horas).", "Para terminar el pan, agregue la harina restante y la levadura a la mezcla de pan y mezcle bien.", "Poco a poco agregue el resto del agua a la mezcla de pan. Cuando se haya agregado casi toda el agua, agregue la sal al agua restante y mezcle durante otros cinco minutos, hasta que se forme una masa pegajosa.", "Transfiera la masa a un tazón grande engrasado y deje que se levante durante una hora.", "Transfiera la masa a una superficie de trabajo muy enharinada y déjela reposar durante otros 30 minutos.", "Precalentar el horno a 240C / 465F / Gas 8.", "Corta la masa en tres tiras y estíralas para hacer formas de pan de chapata largas y planas.", "Coloque en una bandeja para hornear forrada con papel de hornear y déjela durante diez minutos.", "Transfiera la masa al horno para hornear por 25 minutos, o hasta que se levante y dore.", "Retire del horno y transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_ciabatta_85453", "title": "chapata", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "3 panes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 ciabatta rancia, o pan de masa fermentada decente (alrededor de 250 g / 9 oz)", "1 cebolla roja pequeña, muy finamente cortada", "500g / 1lb 2oz de tomates muy maduros", "1 diente de ajo, aplastado", "½ cucharadita de orégano seco", "2 cucharadas de aceite de oliva", "puñado de aceitunas negras", "albahaca pequeña, solo hojas", "sal y pimienta negra recién molida"], "method": ["Rasgue o corte el pan en trozos de alrededor de 3-4cm / 1¼-1½in. Espolvorea con un poco de agua, solo para ayudar a humedecer la superficie. Agregue el agua gradualmente; no lo quiere empapado, ya que también absorberá algunos de los jugos de tomate.", "Espolvoree las cebollas rojas con una pizca de sal y ponga en un tazón de agua fría durante media hora, luego escurra y reserve.", "Picar los tomates y ponerlos en un tazón, junto con los jugos que puedan haberse escapado. Agregue el ajo y el orégano y sazone bien con sal y pimienta.", "Rocíe el aceite de oliva, luego agregue el pan, las cebollas, las aceitunas y las hojas de albahaca. Deje reposar durante media hora a temperatura ambiente antes de servir."], "url": "www_bbc_co_uk_food_recipes_cialledda_salad_60889", "title": "Ensalada Cialledda", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, ablandada, más extra para engrasar", "300g / 10½ oz de azúcar", "4 huevos de gallinas camperas, separados", "Harina normal 300g / 10½ oz", "100g / 3½oz de harina de patata o harina de maíz", "1 limón, ralladura solamente", "4-6 cucharadas de leche", "1 bolsita pane di angeli, o use 1 cucharadita de polvo para hornear mezclado con 2 a 3 gotas de esencia de vainilla"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase ligeramente el molde del anillo de cocción.", "Crema la mantequilla y el azúcar en un tazón hasta que la mezcla esté pálida y cremosa.", "Agregue las yemas de huevo, la harina común, la harina de patata o la harina de maíz y la ralladura de limón junto con cuatro cucharadas de leche. Agregue 1-2 cucharadas de leche si la mezcla es muy espesa. Debe ser cremoso, liviano y colocarse en suaves picos en el tazón.", "Agregue el pane di angeli, o la mezcla de esencia de vainilla y polvo de hornear.", "Batir las claras de huevo hasta que se formen picos suaves. Luego doble las claras de huevo en la mezcla.", "Vierta la mezcla en el molde del anillo de hornear engrasado y hornee en el horno durante 20 minutos o hasta que estén dorados y elásticos al tacto. Servir."], "url": "www_bbc_co_uk_food_recipes_ciambellone_82364", "title": "ciambellone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de sidra, preferiblemente seco o al menos no dulce", "175ml / 6fl oz de aceite de girasol, más extra para engrasar", "100g / 3½oz de azúcar morena oscura", "300g / 10½ oz de melaza negra (use una medida aceitada de 1 taza para mayor facilidad)", "3 huevos grandes de gallinas camperas", "3 cm / 1¼ en pieza (15 g / ½ oz) de jengibre fresco de raíz, pelado y finamente rallado", "Harina normal 300g / 10½ oz", "2 cucharaditas de polvo de hornear", "¼ cucharadita de bicarbonato de soda", "½ cucharadita de nuez moscada recién rallada", "2½ cucharaditas de polvo chino de cinco especias", "1½ cucharadita de canela molida", "75g / 2½oz de mantequilla sin sal", "50g / 1¾oz de azúcar moreno claro y suave", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de jarabe dorado", "125ml / 4fl oz de crema doble", "2 cucharaditas de copos de sal marina ahumada, o al gusto"], "method": ["Abra la sidra para que pierda su espuma. Precaliente el horno a 170 ° C / 150 ° C Ventilador / Gas 3. Engrase la lata de paquete con aceite antiadherente para cocinar, o simplemente póngala al aceite, y deje la lata boca abajo sobre un trozo de papel de periódico o horneado mientras continúa con la masa.", "Mida el aceite, el azúcar moreno y (ya sea que lo pese o vaya por volumen y usando una medida de taza, siempre aceite primero ligeramente el receptáculo para la melaza y se deslizará fácilmente) melaza negra en un recipiente.", "Vierta la sidra y agregue los jengibre, agregue el jengibre y bata hasta que quede suave. Mientras uso una batidora independiente para hacer esta torta, es bastante simple a mano: en ese caso, batir los huevos juntos antes de agregarlos a los demás ingredientes.", "En otro recipiente, mida la harina, el polvo de hornear, el bicarbonato, la nuez moscada, las cinco especias y la canela, y bátalos para combinarlos.", "Incline suavemente los ingredientes secos en la mezcla húmeda de melaza, batiendo a medida que avanza para hacer una mezcla suave. Raspe los lados y el fondo del recipiente bien para asegurarse de que no haya bolsas de harina.", "Vierta la mezcla oscura y aromática en la lata preparada: será muy líquida, pero no se alarme. Coloque en el horno para hornear durante 45-50 minutos, pero comience a verificar después de 40. Cuando el pastel esté listo, comenzará a desprenderse de los lados de la lata y un probador de pasteles saldrá limpio; es decir, no mojado, pero con algunas migajas adheridas a él. Transfiera el paquete a una rejilla de alambre durante aproximadamente 30 minutos, luego use sus dedos para ayudar a separar la torta de los bordes de la lata, más particularmente alrededor del embudo, y déjela salir. Deje que se enfríe completamente antes de envolver, primero en pergamino y luego en papel aluminio, ya que sabe mejor si se lo come al día siguiente. No siempre manejo esto.", "Para la salsa, derrita la mantequilla, los azúcares y el almíbar en una sartén pequeña de base pesada y déjelos hervir a fuego lento durante 3 minutos, agitando la sartén de vez en cuando.", "Agregue la crema y la sal ahumada y agite de nuevo, revuelva con una cuchara de madera y pruebe. Vaya con cuidado para no quemarse la lengua, y vea si desea agregar más sal, antes de dejarla cocinar por otro minuto. Deje que se enfríe un poco, luego rocíe sobre la torta y vierta la salsa restante en una jarra para servir."], "url": "www_bbc_co_uk_food_recipes_cider_and_5-spice_bundt_05085", "title": "Pastel de sidra y 5 especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta de bundt o torta cuadrada de 20cm / 8in", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cider_and_5-spice_bundt_05085_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1½ oz de sultanas", "150ml / 5fl oz sidra media seca", "125g / 4½oz de mantequilla ablandada", "125g / 4½oz de azúcar morena suave", "2 huevos de gallinas camperas, golpeados", "Harina blanca de 175g / 6oz", "50g / 1½oz de harina de espelta marrón", "½ cucharadita de polvo de hornear", "1 cucharadita de cilantro molido", "pizca de sal", "1 manzana crujiente de postre, pelar, cortar en cubos", "100 ml / 3½ fl oz de sidra media seca", "75g / 2½ oz de azúcar granulada"], "method": ["Remoje las pasas sultanas en 50 ml / 2 fl oz de la sidra hasta que estén rellenas (aproximadamente una hora, o puede hacerlo durante la noche).", "Precalentar el horno a 180C / 350F / Gas 4", "Engrase ligeramente un molde para hornear de 18cm / 7 pulgadas de diámetro y espolvoréelo con harina.", "En un tazón o procesador de alimentos mezcle la mantequilla y el azúcar. A continuación, agregue los huevos batidos, las harinas, el polvo de hornear, el cilantro y la sal. Mezclar bien.", "Agregue la manzana, las pasas sultanas y la sidra que remojaron, más la cantidad restante de sidra en la mezcla para pastel, y revuelva para combinar pero no la rompa.", "Vierta la mezcla en la lata de la torta y hornéela en el horno por 20-25 minutos hasta que estén doradas y firmes al tacto. Sacar del horno y dejar enfriar.", "Para el jarabe de sidra, en una sartén ponga a hervir la sidra y el azúcar granulada, y cuando se haya disuelto todo el azúcar, deje enfriar el almíbar.", "Retire la torta de la lata y colóquela en un plato para servir. Usando un pincho pinche el pastel por igual. Vierta lentamente el jarabe de sidra sobre el pastel, luego sirva."], "url": "www_bbc_co_uk_food_recipes_cider_and_apple_cake_80542", "title": "Tarta de sidra y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["sidra seca", "3 puñados de piezas de frutas mezcladas (como naranja, limón, lima, fresas)", "250ml / 9fl oz Pimms"], "method": ["Vierta la sidra en una jarra grande o ponchera", "Agregue un par de pajitas y las piezas de fruta fresca mezclada, luego vierta suavemente los Pimms en la parte superior de la sidra para crear una capa separada."], "url": "www_bbc_co_uk_food_recipes_cidercup_86223", "title": "Golpe de Pimms", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidercup_86223_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 manzanas grandes, cortadas en cubitos", "1 litro / 1 pinta 15fl oz de sidra", "Ron oscuro de 250ml / 8¾fl oz", "3 palitos de canela", "Anís de 3 estrellas", "1 litro / 1 pinta 15 fl oz de agua", "100g / 3½ oz de azúcar"], "method": ["Coloque todos los ingredientes en una sartén, excepto el ron. Cocine lentamente durante una hora y 15 minutos, luego agregue el ron. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_ciderrumandcinnamonp_70704", "title": "Sidra, ron y ponche de canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]