[{"ingredients": ["300 ml / 10 fl oz doble crema", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "100ml / 3½fl oz de leche condensada", "2 hojas de gelatina, empapadas en agua durante al menos cinco minutos", "350ml / 12fl oz de suero de leche", "25ml / 1fl oz pera William", "250g / 9oz de harina blanca fuerte", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla, ablandada", "1 cucharadita de levadura de acción rápida", "aceite vegetal, para freír", "1 cucharadita de jengibre molido", "4 peras, peladas", "1 limón, ralladura y jugo", "150 g / 5½ oz de azúcar en polvo", "1 vaina de vainilla, dividida y sin semillas", "1-2 cucharadas de azúcar glas, para quitar el polvo", "50g / 1¾oz de mantequilla", "4 pequeñas ramitas de menta"], "method": ["Para la panna cotta, enfríe una jarra en el congelador.", "Caliente la crema doble, la vaina de vainilla y las semillas y el azúcar en una cacerola hasta que hierva, revolviendo ocasionalmente. Retire la sartén del fuego, exprima el exceso de agua de la gelatina empapada y agréguela a la crema caliente. Batir el suero de leche hasta que la gelatina se disuelva por completo.", "Pase la mezcla a través de un tamiz fino en la jarra fría, y luego revuelva en el poire William.", "Enfríe la mezcla de crema en la nevera, batiendo cada cinco minutos hasta que la mezcla comience a fraguar. Divida la mezcla entre cuatro moldes dariole y enfríe en la nevera durante al menos dos horas.", "Para las rosquillas, mezcle la harina, la sal, 25 g / 1 oz del azúcar impalpable y toda la mantequilla, 150 ml / 5 fl oz de agua y levadura hasta que estén bien combinados.", "Mezcle por 4-5 minutos, o hasta que la mezcla se una como una masa suave. Cúbralo con una película adhesiva y déjelo a un lado durante una hora para que suba, o hasta que se duplique su tamaño.", "Divida la masa en 12 porciones iguales y enrolle cada una en una bola.", "Alinee una bandeja con pergamino para hornear y coloque las bolas de masa sobre ella, dejando suficiente espacio entre cada bola. Reserve en un lugar cálido para probar durante otros 20 minutos.", "Cuando la masa haya probado, caliente el aceite en una freidora a 150C / 302F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las bolas de masa en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Coloque el azúcar impalpable restante y el jengibre molido en un plato y enrolle los donuts hasta que esté completamente cubierto.", "Para el puré de pera, coloque las peras peladas en una olla con la ralladura de limón y el jugo, y el azúcar, la vaina de vainilla y las semillas. Agregue suficiente agua para cubrir las peras.", "Coloque en el fuego, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Levante las peras y escurra sobre papel de cocina hasta que estén lo suficientemente frías para manipularlas.", "Corta dos de las peras por la mitad de arriba a abajo, luego corta cada mitad en aproximadamente ocho pedazos gruesos, descartando el núcleo.", "Pat las piezas de pera secas y luego transferir a una bandeja de horno. Espolvorear con azúcar glas y caramelizar con un soplete de chef (o debajo de una parrilla precalentada) hasta que esté dorado.", "Corta aproximadamente las dos peras restantes y colócalas en una licuadora con dos cucharadas de líquido de caza furtiva y mezcla hasta obtener un puré espeso, agregando más líquido si es necesario.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y cocínela hasta que esté completamente dorada, luego agregue el puré de pera y caliente, la salsa debe partir.", "Para servir, sumerja el exterior de los moldes de panna cotta en agua caliente durante unos segundos, luego déle vuelta suavemente hacia el centro de cada plato de servir. Coloque tres rosquillas en cada plato y esparza los trozos de pera caramelizada alrededor. Termine con un chorrito de puré de pera mantecoso y algunas hojas de menta."], "url": "www_bbc_co_uk_food_recipes_buttermilk_and_poire_45307", "title": "Suero de leche y poire William panna cotta con donas de jengibre y puré de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz Pimms o 'taza' de fruta similar", "1 vaina de vainilla, dividida", "250 g / 9 oz de azúcar en polvo", "Fresas de 200g / 7oz, cascadas", "3 kiwis, peladas y rebanadas gruesas", "Frambuesas 100g / 3½ oz", "150 g / 5½ oz de arándanos", "Harina normal de 375g / 13oz", "½ cucharadita de polvo de hornear", "500 g / 1 libra de azúcar 2 oz", "pizca de sal", "225g / 8oz de mantequilla, ablandada, más extra para engrasar", "6 huevos de gallinas camperas", "1 vaina de vainilla, semillas raspadas", "1 limón, ralladura solamente", "225ml / 8fl oz de suero de leche", "crema coagulada, para servir"], "method": ["Para las frutas empapadas en Pimms, coloque los Pimms, la vainilla y el azúcar en una sartén y llévelos a ebullición. Hierva durante 6-8 minutos, o hasta que se reduzca para hacer un jarabe.", "Retirar del fuego y dejar enfriar ligeramente. Coloque la fruta en un recipiente y luego vierta el almíbar sobre la fruta.", "Precalentar el horno a 165C / 325F / Gas 3.", "Para la torta de suero de leche, tamice la harina, el polvo de hornear, el azúcar y la sal en un tazón grande.", "Coloque la mantequilla en un recipiente aparte y bata los huevos, uno a la vez. Agregue las semillas de vainilla y la ralladura de limón y mezcle bien.", "Agregue el suero de leche a la mezcla, luego vierta esta mezcla en la mezcla de harina y dóblela.", "Engrase y forme una lata de pastel con forma de resorte de 22 cm / 9 pulg. Vierta la mezcla de la torta en la lata.", "Transfiera al horno y hornee durante aproximadamente 1½ horas, o hasta que estén doradas y una brocheta insertada en la torta salga limpia. Deje que se enfríe un poco en la lata, luego colóquelo en una rejilla para enfriar por completo.", "Para servir, corte el pastel en trozos y sirva con una cucharada de crema coagulada y una cucharada de las frutas empapadas en Pimms."], "url": "www_bbc_co_uk_food_recipes_buttermilkpoundcakew_86622", "title": "Pastel de mantequilla con frutas empapadas en Pimms", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buttermilkpoundcakew_86622_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Parmesano 50 g / 2 oz (o una alternativa vegetariana)", "50g / 2oz de pan rallado natural seco", "600g / 1lb 5oz preparado de camote y calabaza", "pizca de sal", "4 ramitas de romero", "12 hojas de salvia", "rociar aceite de oliva", "12 hojas de lasaña", "75g / 3oz de hojas de espinaca baby", "100 g / 3½ oz de piñones tostados (algunos supermercados los venden tostados)", "100g / 3½ oz de queso parmesano (o una alternativa vegetariana)", "2cm / ¾en pedazo de jengibre fresco", "600g / 1lb 5oz de ricotta", "2 huevos de gallinas camperas, solo yemas", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre balsámico", "pellizcar polvo de mostaza inglesa (opcional)", "sal y pimienta negra recién molida", "Cohete salvaje de 80 g / 2 oz"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Ponga la tetera a hervir para las verduras.", "Mientras tanto, rallar finamente el parmesano para el aderezo, echar en un tazón pequeño con las migas de pan y reservar.", "Cuando el hervidor haya hervido, incline la batata preparada y la calabaza en una sartén grande, agregue un poco de sal y luego vierta el agua hervida para cubrirla. Cúbralo, vuelva a hervir y luego déjelo burbujear durante 15-20 minutos hasta que esté tierno.", "Llene la caldera con agua otra vez y vuelva a ponerla a hervir mientras prepara rápidamente las hierbas para después. Pasa los dedos por la longitud de los tallos de romero para soltar las hojas y pégalas con las hojas de salvia y sepáralas en un tazón pequeño.", "Vierta el agua hervida en una sartén grande, agregue un chorrito de aceite, coloque las láminas de lasaña y deje cocer durante cinco minutos. (Como no hay mucho líquido en este plato, las hojas de lasaña necesitan un poco de precocción).", "Mientras tanto, prepara la salsa. Rallar finamente el parmesano, pelar y rallar el jengibre. Coloque ambos en un tazón mediano, agregue la ricota, las yemas de huevo, la pizca de nuez moscada, sal y pimienta, revuelva para combinar y reservar.", "Drene las sábanas de lasaña una vez que hayan tenido su tiempo y vuelvan a meterlas en la sartén. Rocíe un poco más de aceite y agite suavemente para cubrir, de modo que las sábanas no se peguen.", "Verifique que las verduras ahora estén tiernas y tiernas. Escurra bien y vuelva a colocarlos en la sartén. Mashlos con un triturador hasta que quede suave y agregue sal y pimienta al gusto.", "Ahora monta la lasaña en una fuente para horno, colocada en una bandeja para hornear. Extienda un tercio del puré de verduras en la base del plato. A continuación, esparza un tercio de las hierbas, los piñones y las hojas de espinaca. Luego coloque cuatro hojas de lasaña en la parte superior, cortando para que quepa si es necesario. Extienda un tercio de la salsa blanca.", "Repita esto dos veces más dándole tres capas y finalmente espolvoree las migas de pan de parmesano en la parte superior. Hornea por 15-20 minutos.", "Prepare el aderezo para ensalada simplemente mezclando el aceite de oliva, el vinagre balsámico, la mostaza en polvo (si está usando) y condimentéelo en un tazón pequeño.", "Cuando la lasaña esté lista, la pasta se sentirá tierno cuando se la atraviese con un cuchillo y la parte superior estará crujiente y dorada.", "Córtalo en porciones, levante con cuidado y sirva con un puñado de cohetes rociados con el aderezo."], "url": "www_bbc_co_uk_food_recipes_butternut_and_sweet_49981", "title": "Lasaña de Butternut y de batata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_and_sweet_49981_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla roja, cortada en trozos", "2-3 chiles rojos, tallos eliminados y cortados en tres", "50g / 1¾oz de jengibre fresco, pelado y cortado en monedas gruesas", "2 dientes de ajo, cortados a la mitad", "15g / ½ oz de cúrcuma fresca, pelada y picada (o 1 cucharadita de cúrcuma molida)", "1 cucharadita de cilantro molido", "½ cucharadita de canela molida", "1 cucharadita de copos de sal marina, o al gusto", "2 cucharadas de aceite de coco o aceite vegetal", "1 x 400 ml de leche de coco de estaño", "350ml / 12fl oz de caldo de verduras", "1 x 400 g de tomate picado", "500 g / 1 libra de batatas de 2 onzas, peladas y cortadas en trozos grandes del tamaño de un bocado", "1 calabaza grande, pelada, sin semillas y cortada en piezas del tamaño de un bocado", "300g / 10½oz de arroz Venus negro, para servir", "puñado de cilantro, toscamente picado", "2 limas, cortadas en cuñas"], "method": ["Coloque la cebolla, los chiles, el jengibre, el ajo, la cúrcuma, el cilantro molido, la canela y la sal en un procesador de alimentos y mezcle hasta obtener una pasta, o use una batidora y un bol.", "Caliente el coco o el aceite vegetal en una cacerola de base ancha y pesada, luego fríe la pasta por aproximadamente 1 minuto, revolviendo bien. No use una cuchara de madera a menos que no le importe que la cúrcuma la manche.", "Abra la lata de leche de coco con cuidado y luego raspe la parte cremosa en la pasta, revolviendo todo junto sobre el fuego durante un minuto más o menos antes de agregar el resto de la lata de leche de coco, seguido de la acción, tomates enlatados, luego el batata y calabaza. Remover bien, llevar a ebullición y, una vez burbujeando, bajar el fuego, poner la tapa y hervir a fuego lento durante 40-50 minutos (aunque comience a comprobar a 30) hasta que las batatas estén suaves y la calabaza cocida. Verifique el condimento, luego déjelo reposar durante 10 minutos o más antes de servir.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Sirva con el arroz y coloque cilantro picado y trozos de lima sobre la mesa al lado, para rociar y espolvorear."], "url": "www_bbc_co_uk_food_recipes_butternut_and_sweet_04563", "title": "Butternut y curry de patata dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_and_sweet_04563_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 3 oz de calabaza, peladas, sin semillas y cortadas en cubos de 1.5cm / ½ en cubitos", "1 cebolla roja, finamente rebanada", "2 cucharadas de aceite de oliva virgen extra", "12 hojas de salvia, trituradas", "sal y pimienta negra recién molida", "800 g / 1 libra de hojaldre listo para usar de 12 oz", "Pacanas de 120 g / 4 oz, tostadas", "500g / 1lb de ricotta", "4 cucharadas de aceite de semilla de calabaza", "1 huevo de gallinas camperas", "pizca de sal", "3 cucharadas de harina, más extra para quitar el polvo"], "method": ["Precaliente el horno a 200 ° C / 390 ° F / Gas 6 y alinee una bandeja para hornear con papel para hornear.", "Mezcle la calabaza, la cebolla, el aceite de oliva y la salvia, sazone con sal y pimienta negra recién molida y colóquela dentro de la bandeja para hornear forrada.", "Asar hasta que la calabaza esté cocida (cuando un cuchillo la atraviesa fácilmente), luego sacar del horno y dejar enfriar.", "Divida la masa por la mitad y ruede cada mitad a un rectángulo de 60x20cm / 24x8 pulgadas en una superficie de trabajo ligeramente espolvoreada. Usando una placa de 20 cm / 8 pulgadas de diámetro como plantilla, recorte tres rondas de cada pieza. Coloque estos en una bandeja para hornear y poner en la nevera para descansar durante al menos 20 minutos.", "Una vez que la calabaza se haya enfriado, colócala en un tazón grande y mezcla las pacanas, la ricota y el aceite de semilla de calabaza, asegurándote de no aplastar la calabaza.", "Saca los panecillos de la nevera y deja que alcancen la temperatura ambiente.", "Batir el huevo con una pizca de sal y cepillar la masa por completo por un lado con el lavado de huevos - será más fácil hacer esto de una pieza a la vez.", "Tome una sexta parte de la mezcla de calabaza y mézclela en el centro de una masa de hojaldre, luego doble cuidadosamente la masa por la mitad, asegurándose de que el relleno esté encerrado.", "Sumerja un tenedor en la harina y úsela para presionar y sellar los bordes. Intente exprimir el exceso de aire mientras lo hace; de ​​lo contrario, puede hacer que el pastel se abra al calor del horno. Cuando termine cada pastel, colóquelo en una bandeja para hornear forrada con pergamino para hornear. Cepilla el resto del huevo sobre las empanadas y pínchalas varias veces con el tenedor.", "Hornee durante 25-35 minutos, hasta que la masa esté dorada y cocida.", "Sirva directamente del horno o déjelos enfriar y haga un picnic."], "url": "www_bbc_co_uk_food_recipes_butternut_pecan_ricotta_65342", "title": "Butternut, pecan, ricotta y salvia empanadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_pecan_ricotta_65342_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "1 cebolla, finamente picada", "600g / 1lb 5 oz de calabaza, peladas y cortadas en pequeños cubos", "2 dientes de ajo, finamente picados", "500ml / 18fl oz de pollo fresco o caldo de verduras", "2 limas, solo jugo", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "1 cucharada de vinagre de vino blanco", "4 huevos de gallinas camperas", "Hojas de espinaca baby 300g / 10½oz", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de berro mezclado"], "method": ["Caliente una sartén o una cacerola grande hasta que esté caliente. Agregue la mitad de la mantequilla y la cebolla y fría por 1-2 minutos.", "Agregue la calabaza y cocine por otros dos minutos. Agregue el ajo y cocine por un minuto más.", "Agregue el caldo y llévelo a ebullición, reduzca el fuego a fuego lento y cocine por cinco minutos, o hasta que la calabaza esté tierna.", "Agregue el jugo de lima y la crema doble, deje enfriar un poco, luego transfiera a un procesador de alimentos y mezcle hasta obtener un puré. Sazone al gusto con sal y pimienta negra recién molida.", "Regrese el puré a la sartén y caliente.", "Mientras tanto, lleve una olla de agua a fuego lento y llene un recipiente con agua helada.", "Agregue el vinagre a la sartén, luego agite el agua y agriete en dos huevos a la vez. Pochar por 1½ minutos, o hasta que esté cocido.", "Retire los huevos con una espumadera y transfiéralos al recipiente con agua helada. Cueza los huevos restantes de la misma manera.", "Calentar una sartén hasta que esté a fuego medio, agregar la mantequilla restante y calentar hasta que se forme espuma, luego agregar las espinacas y freír suavemente hasta que se marchiten. Sazone al gusto con sal y pimienta negra, luego escurra sobre papel de cocina.", "Cuando esté listo para servir, coloque nuevamente los huevos en agua hirviendo a fuego lento para recalentar (aproximadamente de 30 segundos a un minuto, dependiendo de cuánto tiempo estuvieron sentados los huevos en agua fría). Levante, escurra sobre papel de cocina y sazone con un poco de sal y pimienta negra.", "Coloque un montículo de espinacas en cada tazón para servir, vierta sobre la sopa, cubra con un poco más de espinaca y un huevo escalfado. Termine con un chorrito de aceite de oliva virgen extra y algunos berros."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_and_28275", "title": "Calabaza y sopa de lima con huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "1 calabaza pequeña (aproximadamente 800 g / 1 libra 12 onzas), fregada, sin semillas, cortada en trozos", "2 cebollas, en rodajas finas", "3 zanahorias, peladas, cortadas en trozos", "2 chirivías, peladas, cortadas en trozos", "2 cucharadas de harina normal", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "½ cucharadita de hojuelas de chile seco (opcional)", "3 cucharadas de pesto (opcional)", "350ml / 12fl oz de caldo de verduras calientes (hecho con 1 cubo de reserva)", "Hojas de espinaca joven de 100g / 3½oz (opcional)", "sal y pimienta negra recién molida", "Harina de auto crianza de 200g / 7oz", "75g / 2¾oz de mantequilla congelada (o 75g2¾oz de suero vegetal triturado)", "125ml / 4½fl oz de agua fría", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande y antiadherente a fuego medio. Agregue las verduras, en tandas si es necesario, y freír durante 4-5 minutos, revolviendo regularmente, hasta que estén ligeramente doradas. Condimentar con sal y pimienta.", "Transfiera las verduras a la olla de cocción lenta, espolvoree sobre la harina y revuelva bien. Agregue los tomates picados, el puré de tomate, los copos de chile y el pesto y revuelva nuevamente. Vierta sobre el caldo y revuelva. Cubra y cocine a fuego alto durante 4 horas.", "Después de que el hotpot ha estado cocinando durante 3 horas y media, haz las albóndigas. Ponga la harina en un tazón grande y sazone con sal y pimienta.", "Remenda gruesa una cuarta parte de la mantequilla congelada en la harina. Mezcle la mezcla para cubrir la mantequilla ligeramente en la harina. Agregue la mantequilla restante en tres lotes más, rallando y tirándola de la misma manera. Esto evitará que la masa de bola de masa se apelmace y produzca empanadillas ligeras y esponjosas.", "Agregue suficiente agua fría para unir la mezcla como una masa blanda y picante. Divida en 12 piezas de igual tamaño y enrolle cada una en una bola.", "Retire la tapa de la olla de cocción lenta, mezcle la espinaca hasta que se marchite, luego coloque las albóndigas suavemente encima. Vuelva a colocar la tapa y continúe cocinando a fuego alto durante otros 25-30 minutos, o hasta que las albóndigas estén hinchadas y esponjosas.", "Coloque el punto caliente en los platos para servir con las albóndigas encima."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_and_46813", "title": "Calabaza moscada y caldo de verduras de raíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_and_46813_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 chalota, más o menos picada", "1 ramita de tomillo", "Mejillones de 200g / 7oz, limpios y sin barba (deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos)", "150ml / 5fl oz de vino blanco", "25g / 1oz de mantequilla", "350g / 12oz de calabaza, pelada y cortada en cubos de 1cm / ½ en cubitos", "500ml / 18fl oz de caldo de verduras", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva, más 2 cucharadas de llovizna", "½ pan de masa fermentada integral, cortado en cubos de 1cm / ½ en cubitos", "2 cucharadas de berro de coriandro", "2 cucharadas de berro de amaranto rojo"], "method": ["Para la sopa, caliente una olla grande con tapa y agregue 2 cucharadas de aceite. Una vez caliente, agregue la chalota, el tomillo y los mejillones y cocine durante 1 minuto. Agregue el vino y cubra con una tapa. Cocine por 2-3 minutos o hasta que se hayan abierto todos los mejillones. Descarta cualquiera que no se abra.", "Cuele los mejillones a través de un colador fino manteniendo tanto los mejillones como el licor. Retire la mitad de los mejillones de sus caparazones y deje el resto en sus caparazones para servir.", "Caliente una olla grande y agregue el aceite restante y la mantequilla. Una vez caliente, agregue la calabaza y cocine durante 2 minutos. Agregue el caldo, los mejillones sin cáscara y el licor de cocción reservado y cocínelos durante 6-8 minutos.", "Retirar del fuego y colocar en una licuadora. Licúe hasta que quede suave y vuelva a colocar en la cacerola. Condimentar con sal y pimienta.", "Para los croûtons de masa fermentada, caliente una sartén mediana y agregue el aceite, una vez caliente agregue el pan y cocine hasta que se dore. Escurrir sobre papel de cocina y sazonar con sal y pimienta.", "Sirva la sopa en tazones y adorne con croûtons, mejillones reservados, berros y un chorrito de aceite."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_and_38079", "title": "Sopa de calabaza y mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Florecillas de coliflor de 100 g / 3½ oz", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharadita de aceite de colza", "1 cebolla pequeña (75 g / 2½ oz de peso pelado), picada", "250 g / 9 oz de calabaza, cortada en cubos", "1 diente de ajo, finamente picado", "1 cucharada de pasta de curry (ver consejo)", "200g / 7oz de tomates picados en lata", "150ml / 5fl oz de caldo de verduras", "Espinaca bebé 40 g / 1½ oz, lavado"], "method": ["Para hacer el \"arroz\" de coliflor, precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Pulsar la coliflor en un procesador de alimentos durante 30 segundos, o hasta que esté finamente picado (debe tener la misma textura que el cuscús). Mezcle el aceite de oliva y sazone al gusto. Distribuya la mezcla en una bandeja para hornear y hornee durante 15 minutos.", "Para hacer el curry, caliente el aceite de colza en una olla pequeña y profunda. Agregue la cebolla y cocine suavemente durante 2-3 minutos. Agregue la calabaza, el ajo y la pasta de curry, y cocine por 2-3 minutos.", "Agregue los tomates y el caldo, lleve a ebullición y luego reduzca el fuego. Cubra y cocine a fuego lento durante 15 minutos, revolviendo de vez en cuando. Retire la tapa y cocine a fuego lento por otros 10 minutos.", "Agregue la espinaca tierna, cubra y cocine hasta que se marchite. Sazone al gusto con sal y pimienta. Sirve el curry con el 'arroz'."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_and_50241", "title": "Encendedor de calabacín y espinacas al curry con coliflor 'arroz'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_and_50241_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de calabaza de 2 onzas, pelada, sin semillas, cortada en trozos de 4 cm / 1.5 in cm", "3 cucharaditas de aceite de oliva", "copos de sal marina", "pimienta negra recién molida", "½ cebolla roja pequeña, pelada, cortada a la mitad, finamente cortada", "25g / 1oz de pecorino u otro queso italiano duro vegetariano, finamente rallado, más extra para servir", "nuez moscada recién rallada, al gusto", "Harina de 300 g / 10½ oz '00', más extra para quitar el polvo", "3 huevos grandes de gallinas camperas", "1 cucharadita de sal", "6 cucharadas de aceite de oliva", "puñado de hojas frescas de salvia", "4 tomates secados al sol (conservados en aceite, de una jarra o lata), escurridos, cortados en tiras finas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, coloque las piezas de calabaza en un tazón grande, rocíe sobre dos cucharaditas de aceite de oliva y revuelva para cubrir. Sazonar, al gusto, con un par de pizcas de sal y mucha pimienta negra recién molida; revuelve de nuevo. Coloque los trozos de calabaza en una bandeja de asar y tueste en el horno durante 18-20 minutos, o hasta que estén tiernos.", "Mientras tanto, agregue las rodajas de cebolla al recipiente utilizado para sazonar la calabaza. Rocíe sobre la cucharadita restante de aceite de oliva y revuelva para cubrir. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Una vez que la calabaza ha asado durante 20 minutos, espolvorea sobre las rodajas de cebolla y continúa asando por otros 10 minutos. Retira del horno y deja reposar por cinco minutos, para que se enfríe.", "En un tazón de lados altos, mezcle los vegetales calientes con un puré espeso y suave usando una licuadora de mano. Dejar de lado para enfriar durante una hora. Una vez enfriado, agregue el queso rallado y un poco de nuez moscada rallada. Sazonar, al gusto, con sal y pimienta negra recién molida, luego reservar hasta que esté completamente frío.", "Mientras tanto, para la pasta, mezcle la harina y los huevos en un procesador de alimentos hasta que los ingredientes se unan para formar una masa. Continúe pulsando por un minuto más, quitando la tapa y volteando la masa cada 15-20 segundos (PRECAUCIÓN: mantenga las manos alejadas de la cuchilla afilada del procesador de alimentos).", "Convierta la masa en una superficie ligeramente enharinada y amase bien durante 10 minutos, golpeando y estirando la masa hasta que quede lisa, elástica y tenga un ligero brillo.", "Divida la masa en cuatro porciones y envuelva cada una con una película adhesiva. Enfriar en la nevera durante 30 minutos", "Cuando la masa de la pasta se haya enfriado, tome la primera porción y extiéndala sobre una superficie de trabajo ligeramente enharinada a un grosor de 1 mm (aproximadamente el grosor de un centavo), espolvoreando la masa con una ligera capa de harina si comienza a pegarse. Necesita el área de la superficie de la masa desplegada para producir 12 discos, cada uno de 8.5cm / 3½ pulgadas de diámetro.", "Usando un cortador de galletas de 8.5cm / 3½ pulgadas, marque 12 círculos en la hoja de pasta sin cortar a través de la masa.", "Repita el proceso de despliegue con la segunda porción de masa de pasta. Separe cuidadosamente.", "Divida la mezcla de llenado enfriada por la mitad y coloque una cucharadita colmada en el centro de cada disco de pasta marcado. Cepille la masa que rodea el relleno con un poco de agua fría.", "Una vez que todos los discos se hayan llenado, levante la segunda hoja de masa de pasta y cubra sobre la primera, alisando cuidadosamente la pasta alrededor del relleno usando las yemas de los dedos para eliminar las burbujas de aire y pegar las hojas humedecidas de pasta juntas.", "Polvo una bandeja para hornear con un poco de harina. Use el mismo cortador de galletas para cortar los 12 ravioles; coloque cada uno en la bandeja de horno preparada. Dejar de lado hasta que sea necesario.", "Repita el proceso con la pasta restante y la mezcla de relleno para hacer 12 ravioles más ..", "Para la guarnición, caliente el aceite de oliva en una sartén pequeña a fuego medio a alto. Agregue las hojas de salvia y freír durante 10-15 segundos, o hasta que se vean translúcidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Regrese la sartén al fuego y agregue los tomates secados al sol. Freír por 20-30 segundos, revolviendo bien, hasta que se caliente. Retirar del fuego y reservar en un plato aparte.", "Para cocinar los raviolis, llene a medias una olla muy grande con agua fría. Agregue una cucharadita de sal y deje hervir. Cuando el agua esté hirviendo, baje cuidadosamente los raviolis, en lotes si es necesario, con una cuchara ranurada. Hervir durante unos minutos, hasta que la pasta esté cocida a su gusto. (Podría hacer algunos raviolis adicionales para probar el tiempo de cocción).", "Escurra los raviolis con cuidado en un colador y vuelva a la cacerola. Agregue los tomates secados al sol y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida los raviolis entre cuatro platos calentados, espolvoree los tomates secados al sol que quedan en la cacerola. Adorne con las hojas de salvia fritas y espolvoree un poco de queso."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_ravioli_31141", "title": "Ravioles de calabaza con hojas de salvia fritas y tomates secados al sol", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_ravioli_31141_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mix de pan listo para llevar 'pain de campagne' listo para llevar 450 g / 1lb", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "Cebolla 100g / 3½ oz, en rodajas finas", "450 g / 1 libra de calabaza, pelada y cortada en cubos de 1 cm / ½ in", "500ml / 18fl oz de caldo de verduras", "Leche de 375ml / 13fl oz", "sal y pimienta negra recién molida", "2 limas, cáscara y jugo"], "method": ["Haga el pan de acuerdo con las instrucciones del paquete, luego déjelo en un tazón grande durante una hora, o hasta que duplique su tamaño.", "Mientras tanto, unta ocho macetas de arcilla limpias con mantequilla y cúbrelas con pergamino para hornear.", "Retire la masa y golpee hacia atrás. Divida en ocho pedazos y colóquelos en macetas de barro limpias, luego déjelos para probar nuevamente durante 30 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Coloque las macetas en una bandeja para hornear y hornee por 10-15 minutos, o hasta que estén doradas y cocidas.", "Mientras tanto, caliente el aceite de oliva y la mantequilla en una sartén grande o saltee la sartén. Agregue la cebolla, tape y fríe con cuidado durante 3-4 minutos.", "Agregue la calabaza y continúe cocinando durante 2-3 minutos más.", "Agregue los ingredientes restantes, excepto la lima y deje que hierva, reduzca a fuego lento y cocine durante seis minutos, o hasta que la calabaza esté tierna.", "Transfiera la sopa a una licuadora y pulse hasta que quede suave.", "Sazone con sal y pimienta, al gusto, y termine con la ralladura de limón y el jugo.", "Sirve la sopa con el pan al lado."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_soup_06198", "title": "Sopa de calabaza con pan de maceta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabaza", "2 cucharadas de aceite de oliva", "1 cebolla picada", "mantequilla, al gusto", "600ml / 20fl oz de caldo de verduras, más caldo adicional para soltar la sopa si así lo desea", "1 cucharadita colmada de pimentón ahumado en caliente", "sal y pimienta negra recién molida", "pieles reservadas de squash", "rociar aceite de oliva", "algunas gotas de vinagre de jerez", "2 cucharadas de romero finamente picado"], "method": ["Pele la calabaza y reserve las tiras largas de piel.", "Deseche la pulpa de calabaza y corte la calabaza restante en trozos.", "Caliente el aceite de oliva en una cazuela grande, agregue la cebolla y la calabaza y un montón de mantequilla (al gusto) y cocínelos hasta que estén dorados y caramelizados.", "Vierta sobre el caldo. Cocine a fuego lento durante 20 minutos. Retire del fuego, deje que se enfríe un poco y luego mezcle con un procesador de alimentos o licuadora a la consistencia deseada.", "Agregue pimentón ahumado caliente y sazone al gusto con sal y pimienta negra recién molida.", "Para las patatas fritas, precaliente el horno a 140C / 275F / Gas 1.", "Coloque las cáscaras de nogal reservadas en una bandeja de asar y cubra con aceite de oliva, vinagre de jerez, romero picado y colóquelas en el horno durante 20 minutos a fuego lento para que estén bien crujientes.", "Retire las patatas fritas del horno y colóquelas en papel de cocina para absorber el exceso de aceite.", "Sirve la sopa con las patatas fritas."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_soup_90300", "title": "Sopa de calabaza con patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_soup_90300_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabaza grande, descuartizada longitudinalmente (con la piel puesta) y sin semillas", "4 cucharadas de aceite de oliva", "sal marina y pimienta negra recién molida", "Feta de 150g / 5½oz", "100 g / 3½ oz de semillas de granada", "100 g / 3½ oz de nueces de pistacho sin cáscara", "70g / 2¼ oz de queso parmesano (o alternativa vegetariana), picado en trozos gruesos", "100ml / 3½fl oz de aceite de oliva", "1 cilantro fresco pequeño racimo", "1 manojo pequeño de perejil fresco", "1 manojo pequeño de eneldo fresco", "1 chile rojo picante o 1 cucharada de aceite de chile (opcional)", "1 limón, solo jugo", "2 cucharaditas de sal marina"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y alinee una bandeja para hornear con papel para hornear.", "Para la calabaza, frote cada cuña de calabaza con aceite y sazone generosamente con sal marina y pimienta negra. Coloque en la bandeja de horno forrada.", "Ase la calabaza por unos 45-50 minutos, hasta que los bordes comiencen a dorarse un poco (desea ennegrecer los bordes un poco para darles una agradable textura masticable). Comprueba que la calabaza esté cocinada insertando un cuchillo: si se desliza fácilmente, la calabaza está cocida.", "Para el pesto, agregue los pistachos y el queso a un procesador de alimentos. Pulse para romperlos en trozos pequeños y agregue suficiente aceite de oliva para aflojar la mezcla a la consistencia deseada (es posible que no necesite todo el aceite). Agregue todas las hierbas, el chile (si se usa) y el jugo de limón. Pulse de nuevo para combinar las hierbas y agregue un poco más de aceite de oliva. Sazone generosamente con sal marina y déle a la mezcla un último pulso. Pruebe el pesto, para asegurarse de que tenga suficiente sal y acidez, y déjelo reposar en el refrigerador hasta que lo necesite.", "Para servir, sirva la calabaza en platos, rociada generosamente con el pesto. Desmenuce su queso feta en la parte superior y esparza algunas semillas de granada para terminar."], "url": "www_bbc_co_uk_food_recipes_butternut_squash_with_55612", "title": "Calabaza con pesto de pistacho persa, queso feta y semillas de granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_with_55612_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabaza pequeña, pelada", "1 ramita de romero fresco", "1 ramita de tomillo fresco", "1 diente de ajo, picado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una tabla de cortar, corte la calabaza en seis cuñas.", "Coloque la calabaza en una bandeja para hornear antiadherente y esparza sobre las hierbas, el ajo y una cucharada de aceite de oliva. Sazonar con sal y pimienta negra recién molida y transferir al horno durante 20-30 minutos, o hasta que estén dorados y tiernos.", "Servir en un plato"], "url": "www_bbc_co_uk_food_recipes_butternutchipswithro_87033", "title": "Rodajas de calabaza con romero y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de nueces", "Harina normal de 200g / 7oz, más extra para el recubrimiento", "300 g / 10½ oz de calabaza, pelada, sin semillas, picada, cocinada y escurrida", "100g / 3½oz de mantequilla sin sal", "1 cucharada de hojas de salvia, más extra para decorar", "sal y pimienta negra recién molida"], "method": ["Para hacer los gnocchi, coloque las nueces en un procesador de alimentos y mezcle. Agregue la harina y la calabaza cocida y mezcle.", "Divida la mezcla en 4 y mezcle en harina normal. Enrolle cada uno en una salchicha larga y delgada, luego córtela en trozos de 2.5 cm / 1 in. Mezcle de nuevo en harina para cubrir, luego vierta en una olla de agua hirviendo.", "Después de un minuto, los gnocchi deberían flotar a la superficie. Retire con una espumadera y déjelo a un lado.", "Para hacer la mantequilla sabia, derrita la mantequilla en una sartén, luego agregue las hojas de salvia. Fría por un minuto para infundir, luego agregue los gnocchi y mezcle.", "Sirva los gnocchi en un recipiente templado y sazone bien con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_butternutgnocciwiths_81302", "title": "Gnocchi de Butternut con mantequilla de salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva light", "125g / 5oz de Jamón Serrano, en cubos", "2 cucharadas de salvia fresca, en rodajas", "225 g / 8 oz de calabaza, cortadas en cubos de 1cm / ½ en cubitos", "1 cebolla mediana, muy finamente cortada", "Gruyère 140g / 5oz, rallado", "3 cucharadas de crema doble", "2 hojas de x 375g / 13oz de masa de corteza corta ya preparada", "1 huevo de gallinas camperas", "Sal marina Maldon y pimienta blanca recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite de oliva en una sartén. Freír el jamón hasta que comience a ponerse crujiente. Agregue el sabio y mezcle rápidamente. Incline hacia un plato forrado con papel de cocina.", "Haga el relleno mezclando la calabaza, la cebolla, el queso, el jamón crujiente y la salvia. Sazone generosamente con sal y pimienta blanca recién molida y luego mezcle bien con la crema.", "Coloque una hoja de hojaldre sobre una tabla enharinada. Tome un plato lo suficientemente grande como para cortar 2 círculos de la pastosa. También puede simplemente dividir en dos para hacer un triángulo pastoso.", "Batir el huevo y agregar una cucharadita de agua para hacer que el huevo se lave.", "Coloque un cuarto de la mezcla en la mitad de la masa. Cepille los bordes interiores con un poco de lavado de huevo, luego cuidadosamente cerca de la forma de un bolso. Usando un tenedor, ribete suavemente los bordes. Cepille la parte superior con más cantidad de huevo y colóquelo en una bandeja para hornear. Repita el proceso para hacer los tres restantes.", "Coloque en el horno por diez minutos. A continuación, reduzca la temperatura a 180 ° C / 350 ° F / Gas 4 y cocine durante otros 25 a 30 minutos cuando la masa esté dorada y las pastas estén bien cocidas.", "Servir caliente oa temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_butternutsquashandgr_70352", "title": "Butternut squash y gruyere pasties", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "85g / 3oz de calabaza, pelada, cortada en cubos de 2cm / 1in", "pequeño puñado de albahaca fresca", "pequeño puñado de perejil fresco", "pequeño puñado de perifollo fresco", "dash aceite de oliva", "2 rebanadas de jamón serrano, picado", "Habas enlatadas 300g / 10½oz, enjuagadas y escurridas", "2 cucharadas de vinagre balsámico", "3 cucharadas de aceite de oliva", "2 cucharadas de menta fresca picada", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, derretir la mantequilla y el aceite de oliva en una sartén a fuego medio, agregar la calabaza y freír durante 6-8 minutos, o hasta que estén blandos y dorados.", "Coloque las hierbas en un tazón grande, agregue la calabaza y el aceite de oliva y mezcle bien.", "Regrese la sartén al fuego, agregue el jamón serrano y fríalos durante 3-4 minutos, hasta que estén dorados y crujientes.", "Para el aderezo, coloque las habas, el vinagre balsámico, el aceite de oliva y la menta en una cacerola pequeña, sazone con sal y pimienta negra recién molida y caliente suavemente a fuego lento durante 2-3 minutos.", "Para servir, coloque la ensalada en un plato, cubra con el crujiente jamón serrano y vierta sobre el aderezo tibio."], "url": "www_bbc_co_uk_food_recipes_butternutsquashandhe_85175", "title": "Ensalada de calabaza y hierbas con jamón serrano y aderezo de alubias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 2½fl oz de aceite vegetal", "50g / 1¾oz de pasta de curry roja preparada de un tarro", "1 cucharada de azúcar de palma o azúcar moreno (disponible en los supermercados asiáticos)", "1 calabaza mediana, pelada, sin semillas, cortada en trozos grandes", "1 camote grande, pelado, cortado en trozos grandes", "1 x 400 ml / 14 fl oz de leche de coco estaño", "90ml / 6 cucharadas de crema de coco", "½ cucharada de salsa de pescado (nam pla)", "2 palitos de limoncillo, magullados", "1 cucharada de lima en escabeche de un frasco (disponible en supermercados y supermercados asiáticos)", "250g / 9oz de langostinos crudos, pelados y desvainados", "Fideos de huevo de 250 g / 9 oz, cocinados de acuerdo con las instrucciones del paquete", "55ml / 2fl oz de aceite vegetal", "50g / 1¾oz de chile rojo, finamente cortado", "50g / 1¾oz de ajo, en rodajas finas", "50g / 1¾oz de chalotes, en rodajas finas", "50g / 1¾oz de soja, recogidos y lavados", "cilantro de racimo pequeño, solo hojas", "pequeño racimo de albahaca, solo hojas"], "method": ["Calentar el aceite en un wok a fuego medio y freír la pasta de curry rojo durante dos minutos, hasta que quede fragante. Agregue el azúcar de palma y cocine durante 4-5 minutos hasta que la mezcla esté pegajosa.", "Agregue la calabaza y la batata y cocine por 2-3 minutos.", "Agregue la leche de coco, la crema de coco, la salsa de pescado y el lemongrass y deje que hierva. Reduzca el fuego a fuego lento durante 20-30 minutos, o hasta que la calabaza y la papa estén tiernas pero no blandas. Agregue la salmuera de limón y las gambas y cocine por 2-3 minutos, hasta que las gambas estén rosadas y cocidas.", "Para la guarnición, caliente el aceite en un wok a fuego lento. Agregue el chile en rodajas y cocine lentamente hasta que toda la humedad de los chiles se haya evaporado (en ese punto el aceite dejará de burbujear), luego suba ligeramente el fuego, para que los chiles se caramelicen y se fríen. Retire las rodajas de chile con una cuchara ranurada y escurrir sobre papel de cocina. Repita este proceso de cocción con el ajo en rodajas y las chalotas.", "Para servir, divide los fideos entre cuatro cuencos poco profundos. Cubra con varias cucharadas de curry, luego rocíe cada plato con un poco de los brotes de frijol, hojas de cilantro y hojas de albahaca. Adorne con una pizca de cada uno de los crujientes chiles fritos, ajo y chalotes."], "url": "www_bbc_co_uk_food_recipes_butternutsquashandpr_88913", "title": "Butternut squash y gambas al curry con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashandpr_88913_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "100g / 3½oz de mantequilla sin sal", "1 huevo de gallinas camperas, golpeado", "25 g / 1 oz de azúcar en polvo", "50ml / 2fl oz de leche, para unir (más si es necesario)", "harina normal y azúcar glas, al polvo", "1 huevo de gallinas camperas, batido, para lavar huevos", "Calabaza de 350g / 12oz, pelada, cortada en cubos", "150g / 5oz de calabaza", "50 g / 2 oz de azúcar moreno oscuro", "Crema doble 140ml / 5fl oz", "1 cucharadita de miel clara", "½ cucharadita de canela molida", "pizca de nuez moscada recién rallada", "pizca de pimienta molida", "pellizcar jengibre molido", "2 huevos de gallinas camperas, golpeados", "6 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, dividida", "Leche 400ml / 14fl oz"], "method": ["Para la masa, coloque la harina, la mantequilla, el huevo, el azúcar y la leche en un procesador de alimentos y pulse brevemente para juntar los ingredientes como una masa. Retire y coloque en un recipiente y mezcle bien con las manos, luego cubra y coloque en la nevera para enfriar durante 20 minutos.", "Espolvoree una superficie limpia y plana con una mezcla de harina y azúcar glas y extienda la masa. Coloque la masa en una caja de tarta de 20 cm / 8 in y vuelva a la nevera para enfriar durante dos horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la caja de tarta en el horno, cubierta con una hoja de papel para hornear pesada con alubias y hornee a ciegas durante 25 minutos, o hasta que estén doradas, pero no doradas. Retire el papel de hornear y los frijoles, cepille con la colada de huevo y vuelva al horno durante cinco minutos más, luego retírelos y déjelos enfriar.", "Para el relleno, coloque la calabaza y la calabaza en una bandeja para hornear, espolvoree con el azúcar y colóquela en el horno para que se asa durante 40 minutos, luego retírela y deje que se enfríe un poco.", "Coloque la calabaza y la calabaza en un procesador de alimentos y mezcle hasta que quede suave.", "Reduzca la temperatura del horno a 180C / 355F / Gas 4.", "Mientras tanto, coloca la crema, la miel y las especias en una cacerola a fuego medio y llévalas al punto de cocción a fuego lento.", "Coloque los huevos batidos en un recipiente limpio y vierta sobre la mezcla de crema, batiendo constantemente.", "Agregue la mezcla de calabaza a la sartén, mezcle bien para combinar, luego vierta en la caja de tarta.", "Transfiera la tarta al horno y hornee durante 35 minutos, o hasta que se haya establecido el llenado. Retirar y dejar enfriar.", "Para la crema pastelera, mezcle los huevos, el azúcar y la vainilla en un tazón limpio.", "Coloque la leche en una olla limpia y caliente hasta cerca del punto de ebullición, luego retírela del fuego y vierta sobre la mezcla de huevo, batiendo constantemente.", "Coloque la mezcla de crema en la bandeja de leche y cocine a fuego lento, revolviendo regularmente, hasta que la crema espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Para servir, corte una rebanada generosa de calabaza y pastel de calabaza, coloque en un plato y sirva con la natilla casera rociada sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_butternutsquashandpu_84333", "title": "Butternut squash y pastel de calabaza con natillas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla, pelada, en rodajas", "2 dientes de ajo, pelados, picados", "2 puerros, cortados, cortados en rebanadas grandes", "200 g / 7 oz cavolo nero o hojas de col, picadas", "200g / 7oz de carne de calabaza, cortada en cubos, asada en el horno en 1 cucharada de aceite durante 15-20 minutos", "1 x 440g / 1lb puede cortar tomates", "1 cucharadita de sal masala", "1 cucharadita de alholva molida", "1 cucharadita de curry en polvo", "sal y pimienta negra recién molida", "Harina normal 150g / 5½ oz", "pizca de sal", "200g / 7oz de mantequilla fría, cortada en cubos", "Avena de avena 150 g / 5½ oz", "150ml / 5fl oz de aceite de oliva", "hojas pequeñas de albahaca, rotas", "½ limón, solo jugo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por 3-4 minutos, o hasta que se ablanden.", "Agregue los puerros y el cavolo nero o las hojas de repollo y continúe freír durante 3-4 minutos o hasta que se marchiten.", "Agregue la calabaza tostada asada, los tomates enlatados y las especias. Revuelva bien, luego sazone, al gusto, con sal y pimienta negra recién molida. Continúe cocinando por otros 4-5 minutos, luego ponga la mezcla en un plato resistente al horno. Dejar de lado.", "Para la migaja, en un tazón, frote todos los ingredientes de la migaja, con las yemas de los dedos, hasta que la mezcla se asemeje a pan rallado. Espolvoree la mezcla de crumble encima de la mezcla de relleno en una capa uniforme.", "Hornee la migaja en el horno durante 20-25 minutos, o hasta que el relleno esté burbujeante y el crumble sea crujiente y dorado.", "Mientras tanto, para el aderezo, mezcle el aceite de oliva, la albahaca y el jugo de limón en un procesador de alimentos hasta que estén bien combinados.", "Para servir, divida la migaja de calabaza entre cuatro platos para servir por igual. Rocíe sobre la cobertura."], "url": "www_bbc_co_uk_food_recipes_butternutsquashcrumb_92581", "title": "Crumble de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]