[{"isVegetarian": true, "title": "Egg nog with cherries", "url": "www_bbc_co_uk_food_recipes_eggnog_9370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggnog_9370_16x9.jpg", "ingredients": ["1140ml/2 pints whole milk", "6 free-range eggs", "50g/2oz caster sugar", "1 vanilla pod, split", "20 fresh cherries, stones removed and halved", "200ml/7fl oz brandy", "cocoa powder, for dusting"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the milk, eggs, sugar and vanilla pod in a medium pan and heat gently, without boiling, until the mixture thickens enough to coat the back of a spoon.", "The egg nog can be chilled at this stage or served hot.", "To serve, scatter the cherries in the bottom of each serving glass. Divide the brandy between the glasses and pour the egg nog over. Dust with cocoa powder and serve."]}, {"isVegetarian": false, "title": "Eggs Arnold Bennett", "url": "www_bbc_co_uk_food_recipes_eggs_arnold_bennett_69867", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz milk", "200g/7oz un-dyed smoked haddock", "1 bay leaf", "10 black peppercorns", "4 free-range eggs", "40g/1½oz butter", "15g/½oz plain flour", "50g/1¾oz grated mature cheddar cheese", "sea salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the milk into a large shallow pan, then add the smoked haddock, bay leaf and peppercorns and bring to a simmer.", "Cook for five minutes, or until the fish has just cooked through and flakes when pushed gently.", "Lift the fish out of the pan and set aside to cool slightly before gently flaking, discarding the skin.", "Meanwhile, strain the milk into a clean pan and beat the eggs together in a separate bowl.", "Heat a frying pan until medium-hot, add 15g/½oz of the butter and the eggs and cook gently, stirring with a fork until they just hold together.", "Add half the flaked fish to the top of the omelette, then roll out of the pan onto an ovenproof serving dish and top with the remaining fish.", "Preheat the grill to hot.", "Wipe out the omelette pan and add the remaining 25g/1oz butter and melt, then add the flour and cook stirring well for two minutes. Gradually add the milk, whisking all the time until it forms a smooth sauce. Season the sauce with salt and black pepper. You can add a knob of butter at this stage too if you want to.", "Pour the sauce over the top of the omelette, then scatter the grated cheese over the top and place under the grill for 3-5 minutes, or until golden-brown and bubbling.", "Serve immediately."]}, {"isVegetarian": false, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggs_benedict_10471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range eggs, at room temperature", "2 tbsp white wine vinegar", "6 English muffins, halved", "butter, for spreading", "6 slices ham or smoked salmon", "1-2 tbsp finely snipped fresh chives", "225g/8oz butter, cut into pieces", "4 tbsp white wine vinegar", "1 small shallot or ½ banana shallot, peeled and very finely chopped", "10 black peppercorns", "1 bay leaf", "3 free-range egg yolks", "pinch sea salt flakes", "pinch caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a small pan just over one third full with cold water and bring it to the boil. Add the vinegar and reduce to a simmer. Crack the eggs one at a time into a small bowl and gently tip into the simmering water. Poach for 2-3 minutes. Remove with a slotted spoon and plunge into iced water, then remove the eggs and place them on a kitchen towel.  ", "For the hollandaise sauce, melt the butter slowly in a medium pan over a low heat, stirring occasionally.  Remove from the heat and pour the butter into a jug.  Add enough water into a medium saucepan to come a third of the way up the sides.  Bring to the boil, then reduce the heat to a simmer.", "Put the vinegar, shallot, peppercorns and bay leaf in a small saucepan over a high heat and bring to the boil.  Cook for 1-2 minutes, or until reduced to two tablespoons of liquid.  Remove from the heat.  ", "Put the egg yolks in a heatproof bowl and place over the pan of simmering water.  Whisk the egg yolks with the salt and sugar until pale.  Pour the vinegar mixture through a fine sieve onto the yolks and continue whisking until well combined.  Slowly add the butter in a steady stream whisking constantly until the sauce is smooth, thick and shiny.", "Toast the muffin halves and bring the pan of water back to a simmer, ready to reheat the eggs.", "Spread the muffins with butter.  Put a muffin half on each plate and top with ham or salmon.  Using a slotted spoon, drop the cooked eggs in to the simmering water and reheat for one minute.  Remove and drain on kitchen paper.  ", "Place an egg on each muffin and spoon over some hollandaise.  Sprinkle with chives and serve with the other muffin halves on the side."]}, {"isVegetarian": false, "title": "Eggs Benedict Florentine", "url": "www_bbc_co_uk_food_recipes_eggs_benedict_florentine_33122", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_benedict_florentine_33122_16x9.jpg", "ingredients": ["8 thin rashers smoked streaky bacon", "dash of vinegar", "4 large free-range eggs", "2 English muffins, halved", "knob of butter, plus extra for spreading", "200g/7oz baby spinach", "2 free-range egg yolks", "1 tsp white wine vinegar", "100g/3½oz unsalted butter, melted", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.  ", "Arrange the bacon on a baking tray and bake for 10 minutes, or until golden-brown and crisp. (Fry or grill if preferred.) Keep warm.", "To make the hollandaise, whisk the egg yolks and white wine vinegar together in a medium bowl. ", "Sit the bowl over a pan of simmering water, making sure the bowl doesn't touch the water. Pour in the melted butter, whisking continuously until the sauce has thickened and is glossy. Season with salt and pepper. Cover with cling film and set aside.", "To poach the eggs, bring the same water up to the boil, reduce to a simmer and add a dash of vinegar. Crack each egg into a ramekin or cup and swirl the water, then carefully tip the eggs into the pan.  ", "Simmer for 3–4 minutes, or until the whites are just set but the yolks are soft. Using a slotted spoon, carefully lift the eggs out and drain on kitchen paper.", "Toast the muffin halves and butter them. Divide between four plates.", "Heat a frying pan, add the butter until melted and fry the spinach until wilted, season with salt and pepper.", "Spoon the spinach on top of the muffins, top with the egg, spoon over some hollandaise and arrange a cross of two rashers on top. Serve hot."]}, {"isVegetarian": false, "title": "Eggs en cocotte with smoked haddock", "url": "www_bbc_co_uk_food_recipes_eggs_en_cocotte_with_86221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz milk", "200ml/7fl oz double cream", "1 bay leaf", "½ tsp black peppercorns", "200g/7oz undyed smoked haddock", "25g/1oz butter, plus extra for greasing ", "25g/1oz plain flour", "4 duck eggs", "2 tbsp finely grated Parmesan", "1 tbsp finely chopped chives", "buttered toast, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3 and grease 4 small cocotte dishes with butter.", " Pour the milk and cream into a saucepan, add the bay leaf and peppercorns and bring to a simmer. Remove from the heat and set aside to infuse for 30 minutes. ", "Bring the liquid back to a simmer, add the haddock and poach gently for 4–5 minutes, or until the fish flakes apart when pushed. Remove the fish from the liquid and flake into a bowl.", "Melt the butter in a separate saucepan, add the flour and whisk together. Strain the poaching liquid into a jug and measure out 300ml/10fl oz. Gradually whisk the liquid into the butter and flour until smooth, then simmer gently for 2–3 minutes, or until thickened. ", "Pour most of the sauce over the fish, reserving a little for the top of each egg, and carefully fold to combine. Divide the mixture between the moulds, then crack an egg on top of each. Spoon over the reserved sauce, sprinkle over the Parmesan and then transfer to a deep roasting tin. ", "Pour in enough boiling water to come halfway up the sides of the dishes, then bake for 10–12 minutes, or until the whites are set and the yolks are still runny. Garnish with chopped chives and serve with buttered toast."]}, {"isVegetarian": false, "title": "Eggs in pots (oeufs en cocotte)", "url": "www_bbc_co_uk_food_recipes_eggs_in_pots_93154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggs_in_pots_93154_16x9.jpg", "ingredients": ["150g/5½oz crème fraîche", "salt and freshly ground black pepper", "pinch nutmeg ", "handful of chopped dill", "4 free-range eggs", "red lumpfish roe", "small sprigs of dill"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the crème fraîche with salt, freshly ground pepper and a pinch of nutmeg.", "Place a heaped tablespoon of crème fraîche in the bottom of a ramekin, followed by a little dill. ", "Crack an egg on top, add a second tablespoon of crème fraîche and sprinkle with a pinch each of salt, pepper and nutmeg. Repeat with three more ramekins.", "Place the ramekins in a baking dish and pour enough lukewarm water into the dish to come halfway up the sides of the ramekins. ", "Bake for 15 minutes or until the egg yolks are set to your liking. ", "If you like, finish each serving with a teaspoon of red lumpfish roe and a sprig or two of dill."]}, {"isVegetarian": true, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggsbenedict_74872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 muffins", "4 free range eggs", "200g/7oz baby spinach leaves, wilted in a small pan", "Good-quality readymade hollandaise sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large, shallow pan with water, about 3cm (1in) deep and bring to a simmer. Add some vinegar (1-2 tablespoons per one litre of water) to help the eggs hold their shape.", "Break four eggs into separate coffee cups (this is also to help eggs maintain their shape when they're placed in the pan). Gently tip the eggs into the simmering water and poach for 2-3 minutes.", "Slice the muffins in half and lightly toast. ", "Once the eggs are poached, remove with a slotted spoon and drain on paper towels.", "Place the spinach on top of the muffins, top with the egg and spoon a generous amount of hollandaise sauce over the eggs.", "Serve at once."]}, {"isVegetarian": true, "title": "Eggs and spinach en cocotte", "url": "www_bbc_co_uk_food_recipes_eggsandspinachencoco_88059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "55g/2oz fresh spinach leaves", "2 medium free-range eggs", "50ml/2fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Melt the butter in a small pan. Add the spinach and cook until wilted. Place into a small ovenproof dish.", "Crack the eggs into a bowl and carefully slide on top of the spinach. Pour over the cream and season well with salt and freshly ground black pepper.", "Place in the oven and bake for about 7-10 minutes, or until the eggs are just set. Serve immediately."]}, {"isVegetarian": false, "title": "Eggs Benedict", "url": "www_bbc_co_uk_food_recipes_eggsbenedict_9435", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsbenedict_9435_16x9.jpg", "ingredients": ["6 tbsp hollandaise sauce ", "6 large, very fresh eggs ", "12 slices pancetta, grilled until crisp ", "3 English muffins, split in half horizontally ", "a little butter "], "serves": "Serves 3-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Poach the eggs in a pan of boiling water. ", "When the pancetta is cooked, keep it on a warm plate while you lightly toast the split muffins on both sides. ", "Now butter the muffins and place them on the baking tray, then top each half with two slices of pancetta. ", "Put a poached egg on top of each muffin half and then spoon over the hollandaise, covering the egg (there should be a little over 1 tablespoon of sauce for each egg). ", "Now flash the Eggs Benedict under the grill for just 25-30 seconds, as close to the heat as possible, but do not take your eyes off them - they need to be tinged golden and no more. This should just glaze the surface of the hollandaise. Serve straight away on hot plates."]}, {"isVegetarian": true, "title": "Eggs en cocotte, with mushrooms, thyme and gruyere", "url": "www_bbc_co_uk_food_recipes_eggsencocottewithcho_71187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 small onion, finely chopped", "225g/8oz button mushrooms, finely chopped", "leaves from 1 sprig of thyme", "freshly grated nutmeg", "6 large eggs", "6 tsp double cream", "40g/1½oz Gruyére cheese, finely grated", "salt", "freshly ground black pepper", "handful of baby leaf salad", "sprigs of flat-leaf parsley, tarragon, chervil, chives, fennel and dill", "lemon olive oil or extra virgin olive oil", "salt"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas Mark 6. Melt the butter in a medium-sized pan, add the onion and cook gently until soft but not coloured. ", "Add the mushrooms and thyme and continue to cook until all the excess liquid has evaporated and the mixture is quite dry. Season to taste with salt, pepper and nutmeg. ", "Spoon the mushroom mixture into six lightly buttered ramekin dishes. Break in the eggs, season them lightly, then spoon over the cream and sprinkle with the Gruyére cheese. ", "Put the ramekins into a shallow roasting tin and pour some hot water around them so that it comes about half way up the sides of the dishes. Bake for 15 minutes until the eggs are set but the yolks are still runny and the cheese is lightly golden.", "Serve with a mixture of seasoned baby salad leaves and herbs, dressed in lemon olive oil or extra virgin olive oil."]}, {"isVegetarian": true, "title": "Eggs en cocotte with morel or porcini mushrooms", "url": "www_bbc_co_uk_food_recipes_eggsencocottewithmor_67958", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large, very fresh eggs ", "½ oz (10 g) dried morels or porcini ", "3 shallots, peeled and finely chopped ", "4 oz (110 g) dark-gilled flat mushrooms, roughly chopped ", "¼ whole nutmeg, grated ", "1 oz (25 g) butter ", "salt and freshly milled black pepper ", "3 rounded tablespoons crème fraîche , half-fat crème fraîche  or Greek yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Start by soaking the morels or porcini about 30 minutes ahead of time. Place them in a bowl with 5 fl oz (150 ml) boiling water and leave them aside to soak. After that, strain them in a sieve and squeeze them to get rid of any surplus water. (You can reserve the soaking water, which can be frozen and is great for soups and sauces.) Set aside 4 pieces of the morels or porcini and put the rest in a food processor, along with the shallots, flat mushrooms, nutmeg and salt and freshly milled black pepper. Process until finely chopped.", "Heat the butter in a small saucepan. When it starts to foam, add the chopped mushroom mixture and, keeping the heat low, let it cook very gently, without a lid, for 25-30 minutes; the idea is that any excess liquid will evaporate and leave a lovely, dark, concentrated mixture.", "All this can be prepared in advance, but when you're ready to cook the eggs, start by pre-heating the oven to gas mark 4, 350°F (180°C) and boil a kettle. Gently re-heat the mixture and, stirring in 1 rounded tablespoon of the crème fraîche or yoghurt, divide it between the ramekins, making a small indentation where the egg will be placed. Now break an egg into each one and season. Stir the rest of the crème fraîche or yoghurt around to loosen it, divide between the dishes, then spread it gently over the eggs using the back of the spoon or a small palette knife. ", "Heat the butter in a small saucepan. When it starts to foam, add the chopped mushroom mixture and, keeping the heat low, let it cook very gently, without a lid, for 25-30 minutes; the idea is that any excess liquid will evaporate and leave a lovely, dark, concentrated mixture.", "All this can be prepared in advance, but when you're ready to cook the eggs, start by pre-heating the oven to gas mark 4, 350°F (180°C) and boil a kettle. Gently re-heat the mixture and, stirring in 1 rounded tablespoon of the crème fraîche or yoghurt, divide it between the ramekins, making a small indentation where the egg will be placed. Now break an egg into each one and season. Stir the rest of the crème fraîche or yoghurt around to loosen it, divide between the dishes, then spread it gently over the eggs using the back of the spoon or a small palette knife. ", "Place a piece of the reserved morels or porcini on top of each ramekin, then place the ramekins in the baking tin, pop the tin on the centre shelf of the oven and add enough boiling water to the tin to come halfway up the sides of the dishes. Now let the eggs bake for 15 minutes if you like them soft and runny, or 18 minutes if you like them more set. Either way, bear in mind that they go on cooking in the dishes as they leave the oven and reach the table. These are lovely served with slices of wholemeal bread and butter."]}, {"isVegetarian": true, "title": "Eggs Florentine", "url": "www_bbc_co_uk_food_recipes_eggsflorentine_88979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsflorentine_88979_16x9.jpg", "ingredients": ["100g/3½oz butter, cut into cubes ", "2 free-range egg yolks", "½ tbsp cold water", "½ tbsp lemon juice", "salt and freshly ground white pepper", "2 English muffins, split in half horizontally, buttered ", "2 large handfuls baby spinach, steamed", "4 free-range eggs, poached"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "For the hollandaise sauce, place 75g/2½ oz of the butter into a small saucepan and melt slowly over a gentle heat. Once melted, remove from the heat and set aside.", "Place the egg yolks into a bowl set over a pan of gently simmering water (take care not to let the bowl touch the water) and beat until pale and thickened. Add the water, lemon juice, salt and freshly ground black pepper to the egg yolks and beat for another 30 seconds.", "Add half of the remaining butter to the egg mixture in the bowl and stir for 1-2 minutes or until the mixture thickens. Remove from the heat and beat in the rest of the butter.", "Slowly pour in the melted butter, whisking constantly, until the sauce reaches the consistency of double cream. Season to taste with lemon juice, salt and freshly ground black pepper. Keep the sauce warm by resting the bowl in a pan of lukewarm water. ", "Place the buttered muffins onto a baking tray.", "Arrange the steamed spinach on top of the muffins, top with the poached eggs and pour the hollandaise sauce over the top", "Place the tray under the preheated grill for 1-2 minutes, or until the top is bubbling and just turning golden-brown. ", "Transfer the eggs Florentine onto two serving plates and serve immediately."]}, {"isVegetarian": false, "title": "Eggy bread", "url": "www_bbc_co_uk_food_recipes_eggybread_76849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice of brioche ", "2 eggs, beaten", "knob of butter", "2 slices of smoked salmon", "freshly ground black pepper", "drizzle of extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the brioche slice in the beaten eggs.", "Gently melt the butter in a non-stick frying pan and fry the brioche slice for 2-3 minutes on each side, until golden.", "Transfer to a serving plate and arrange the smoked salmon on top. ", "Sprinkle with freshly ground black pepper and drizzle with oil to serve."]}, {"isVegetarian": true, "title": "Eggy bread", "url": "www_bbc_co_uk_food_recipes_eggybread_84018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "3 tbsp condensed milk", "handful blueberries", "2 slices brioche", "knob of butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs in a bowl with the condensed milk and whisk together.", "Place a brioche slice onto a plate and place the blueberries on the top, put the second brioche slice on the top to make a sandwich. Push down on the sandwich to slightly squash the blueberries.", "Carefully pick up the brioche sandwich and place it into the egg mixture, turning it to  completely coat. ", "Meanwhile, heat a frying pan with butter on a medium to high heat, and when bubbling, place the brioche sandwich into the frying pan. Fry for two minutes on each side or until golden.", "Remove the brioche from the frying pan and serve immediately."]}, {"isVegetarian": true, "title": "Egyptian dukkah", "url": "www_bbc_co_uk_food_recipes_egyptiandukkah_13892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz sesame seeds", "100g/4oz blanched almonds", "50g/2oz coriander seeds", "10g/½oz cumin seeds", "1 tsp sea salt", "½ tsp pepper", "Turkish bread", "olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast all the seeds and almonds together in a hot dry pan. Keep stirring until fragrant. ", "Cool, then coarsely grind with the salt and pepper. ", "To serve, dip the Turkish bread into the olive oil and then into the dukkah. "]}, {"isVegetarian": true, "title": "Eight-strand plaited loaf", "url": "www_bbc_co_uk_food_recipes_eight-strand_plaited_57815", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eight-strand_plaited_57815_16x9.jpg", "ingredients": ["500g/1lb 2oz strong bread flour", "7g sachet fast action dried yeast", "10g/¼oz fine salt", "1½ tbsp olive oil", "extra flour for dusting", "sunflower oil for greasing bowl ", "1 free-range egg, beaten lightly with a pinch of salt", "pinch salt"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour in a large bowl. Add the yeast on one side of the bowl and add the salt on the other side. Salt should not be placed on top of the yeast, as it can kill it and make in in-active.  Stir the ingredients together until evenly mixed. ", "Add a good splash of olive oil.  Measure out 340ml/12fl oz water and add three-quarters to the flour mixture, and mix together by hand, then add the rest of the liquid.", "Turn the dough out onto a work surface and knead by hand until the dough looks silky and stretchy. This will take approximately 10 minutes. ", "Oil a medium sized mixing bowl and place the dough into the bowl. Cover with cling film and set aside to rise, for about an hour, or until the dough doubles in size. ", "When risen, turn the dough out onto a lightly floured work surface and knead, to knock the dough back. Shape the dough into a ball.  ", "Divide the dough into eight equal pieces then roll out each piece into a strand about 40cm/16in long.   ", "Lay the strands out on the lightly floured surface like an octopus, fanned out from a central point at the top. Stick all the ends at the central point to the table with your thumb.", "For the following braiding sequence, number the strands of dough from 1-8 from left to right. Every time you move any strand it will take the new number of its position in the row. \r\nStep 1: place 8 under 7 and over 1 \r\nStep 2: place 8 over 5\r\nStep 3: place 2 under 3 and over 8\r\nStep 4: place 1 over 4 \r\nStep 5: place 7 under 6 and over 1 \r\nRepeats step 2-5, until all the dough is braided.", "Tuck both ends of the loaf underneath to give a tidy finish.", "Place the plaited dough onto a floured baking tray, and leave to prove for another hour, until risen again.  ", "Preheat the oven to 200C/400F/Gas 6.", "Brush the loaf with the beaten egg wash and bake in the oven for 20-25mins.  "]}, {"isVegetarian": true, "title": "Elderflower and bramble berry pavlova", "url": "www_bbc_co_uk_food_recipes_elderflower_and_bramble_33135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 large free-range egg, whites only", "1kg/2lb 4oz caster sugar ", "250g/9oz white chocolate", "400g/14oz milk chocolate, chopped", "200g/7oz white chocolate, chopped", "600g/1lb 5oz strawberries, hulled ", "600g/1lb 5oz blackberries ", "500g/1lb 2oz raspberries (frozen is fine)", "6 tbsp icing sugar", "1.2 litres/2 pints double cream ", "400ml/14fl oz elderflower liqueur ", "100g/3½oz icing sugar ", "200g white caster sugar"], "serves": "Makes 1", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the meringues, draw a 22cm/8½in circle onto two pieces of parchment, then two 20cm/8in circles on two more pieces of parchment, and finally one 18cm/7in circle. Now draw an eight-petalled flower inside the circle ensuring that the petals stay within the circle. ", "Preheat the oven to 140C/275F/Gas 1. ", "Place nine of the egg whites into a large mixing bowl. Weigh out half the sugar into a smaller bowl. Using a handheld electric mixer on medium speed, mix the egg whites to soft peaks, then slowly add the sugar and continue whisking until stiff peaks form when the beaters are removed and the meringue is glossy. ", "Spoon the meringue into a disposable piping bag fitted with a large star nozzle. Place both 22cm/8½in stencils and one 20cm/8in stencil onto baking trays and pipe meringue onto the petals, filling the petals completely. ", "With a teaspoon make slight indentations in the petals. These will hold the berries later on. Remember that these layers will be stacked and so should be rather shallow. ", "Place into the preheated oven and immediately turn down to 100C/225F/Gas ¼ and bake for 1½ hours. When they are done, turn off the oven and allow to cool for 30 minutes with the oven door open. Repeat the process with the remaining two meringue layers. The smallest meringue layer will be the top, so pipe it with care, though make it as elaborate as you like. ", "Meanwhile for the bramble berries, temper the milk chocolate. Melt half of the milk chocolate into a bowl set over a saucepan of simmering water (make sure the bottom of the bowl does not touch the water). Heat until the chocolate reaches 43C/109F (measure the temperature with an electric food thermometer). ", "Remove from the heat, and add the remaining half of the milk chocolate. Cool to 28C/82F then reheat slightly to 30C/86F. The chocolate is now tempered. Repeat the process with the white chocolate.  ", "Line a baking tray with baking parchment. Using cocktail sticks, dip the strawberries into the tempered milk chocolate and place onto the baking sheet. Allow to set. Spoon the melted white chocolate into a piping bag fitted with a writing nozzle and zig-zag the white chocolate over the chocolate-dipped strawberries.  Set aside.", "For the raspberry coulis, blend the raspberries and icing sugar in a food processor, then press the purée through a fine sieve into a small bowl. Set aside. ", "For the elderflower cream, whisk the cream in a large mixing bowl to soft peaks. Fold in the elderflower liqueur and icing sugar with a spatula. Refrigerate until needed. ", "Once the meringue layers are completely cool, melt the white chocolate and paint this over the tops of the meringues using a pastry brush. This will help avoid any absorption of excess liquid from the cream. ", "To assemble the pavlova, place one of the largest meringues onto a cake stand. Add a quarter of the cream into the centre. Place some of the blackberries on top, and place some berries into the hollows in the meringue flower petals – alternate a chocolate-coated strawberry on one petal, with three blackberries on another. Add the next layer of meringue and repeat. ", "Add the top layer of meringue and pipe a small blob of cream in the centre, and top with a chocolate strawberry. ", "To make the spun sugar, dissolve the sugar in two tablespoons water in a medium saucepan over a medium heat, stirring constantly. ", "When the sugar is dissolved, turn the heat up and boil without stirring until it turns a copper colour. Immediately remove from the heat and place the saucepan into a sink of cold water (be careful not to get any water in the caramel or you will need to start again). ", "Dip two forks, held together back to back, into the caramel and spin them around and over the meringue layer, until you have a cage of spun sugar. ", "Serve in slices with the raspberry coulis. "]}, {"isVegetarian": true, "title": "Elderflower and lemon buns and spiced buns", "url": "www_bbc_co_uk_food_recipes_elderflower_and_lemon_58955", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour", "250g/9oz plain white flour", "40g/1½oz butter", "6g fine sea salt", "2 x 7g sachets instant yeast", "120ml/4fl oz full-fat milk", "2 large free-range eggs", "75ml/2½fl oz elderflower cordial ", "1 cap food-grade lemon oil", "250g/9oz strong white flour", "250g/9oz plain white flour", "40g/1½oz butter", "12 cardamom pods, crushed and seeds removed", "12 cloves", "6g fine sea salt", "2 x 7g sachets instant yeast", "½ tsp cinnamon", "60g/2¼oz golden caster sugar", "150ml/5fl oz full-fat milk", "2 large free-range eggs", "80g/3oz butter", "160g/5¾oz golden caster sugar", "3 lemons, zest and juice only", "2 large free-range eggs and 1 large free-range egg yolk ", "3 Braeburn apples, peeled, cored and finely chopped", "80g/3oz frozen cranberries, defrosted", "1 lemon, juice only", "150g/5½oz jam sugar", "150g/5½oz icing sugar", "2 tbsp elderflower cordial ", "150g/5½oz icing sugar", "1 tsp vanilla paste", "1 tsp cinnamon", "1 tsp lemon juice", "2 tsp orange juice", "600ml/20fl oz double cream", "40g/1½oz icing sugar"], "serves": "Makes 24 iced finger buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the elderflower dough, put both flours in the bowl of a freestanding mixer fitted with a dough hook.  Rub in the butter using your fingertips then add the salt to one side of the bowl and the yeast to the other.", "Warm the milk to about 40C (if you don’t have a kitchen thermometer, gently heat the milk until warm to the touch).", "Add the eggs, warm milk, cordial and lemon oil to the bowl and mix slowly for a few minutes to combine. Increase the speed and mix for a few more minutes. Transfer to a large bowl and cover with cling film. Prove in a warm place for 1 hour, or until doubled in size.", "For the spice bun dough, put both flours in the bowl of a freestanding mixer fitted with a dough hook.  Rub in the butter using your fingertips.", "Remove the seeds from the cardamom pods and take the heads off the cloves. Grind until fine in a pestle and mortar. Add to the flour mixture along with the salt, yeast, cinnamon and sugar.", "Warm the milk to about 40C (if you don’t have a kitchen thermometer, gently heat the milk until warm to the touch). Add 3 tablespoons water and mix.", "Add the eggs and warm milk to the bowl and mix slowly for a few minutes to combine. Increase the speed and mix for a few more minutes. Transfer to a large bowl and cover with cling film. Prove in a warm place for 1 hour, or until doubled in size.", "To make the lemon curd, put the butter, caster sugar, lemon juice and zest in a heatproof bowl and warm in the microwave until the butter has melted (alternatively put the bowl over a pan of simmering water). Beat the eggs and egg yolk into the lemon mixture. Place over pan of simmering water and stir until thick. Pass through a sieve and leave to cool.", "To make the apple and cranberry jam, put a plate in the freezer. Add the apples, cranberries, lemon juice and sugar to a pan. Simmer for about 10–15 minutes until the apples are soft. Bring to a rolling boil for a few minutes. To check if the jam has reached setting point, place a blob on the frozen plate and leave to cool for a few minutes – if the jam is ready it will wrinkle when pushed with your finger. If it doesn’t wrinkle, cook for a few more minutes then test again. Once the setting point has been reached, transfer the jam to a blender and blitz until smooth. Leave to cool.", "Once the doughs have been proved, divide both doughs into 12 equal pieces. Lightly flour 4 baking trays and a work surface. Roll each piece of dough into a ball and then into a sausage shape. Place 6 fingers on each tray and leave to prove again for 30 minutes, or until doubled in size.", "Preheat the oven to 205C/185C Fan/Gas 6. ", "Bake the buns for 10–15 minutes, or until golden-brown. Remove from the trays and leave to cool. Once cool cut the buns in half lengthways.", "For the elderflower icing, combine the icing sugar and elderflower cordial in a bowl until a smooth, pourable consistency is achieved. ", "For the cinnamon icing, combine the icing sugar, vanilla paste, cinnamon and lemon juice in a bowl. Add enough orange juice to make a smooth icing. ", "To decorate, dunk the top halves of the elderflower and lemon buns in the elderflower icing. ", "Dunk the top halves of the spiced buns in the cinnamon icing.", "To fill the buns, whip the cream with the icing sugar until stiff peaks form when the whisk is removed. Transfer to a disposable piping bag.", "Spread the jam on half the buns and the lemon curd on the other half, then pipe the cream on top. Sandwich the buns together using the respective iced tops. Serve immediately."]}, {"isVegetarian": true, "title": "Elderflower cordial", "url": "www_bbc_co_uk_food_recipes_elderflower_cordial_21346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz caster sugar", "2 lemons", "about 25 heads elderflowers", "50g/1¾oz citric acid", "2 Campden tablets"], "serves": "Makes about 3-4 litres", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the sugar and 1.5 litre/3lb 5oz water into a large pan. Bring to the boil, stirring, until the sugar has dissolved. Remove from the heat and cool. ", "Slice the lemons thinly. Put into a large plastic box or a bucket.", "Add the elderflower heads to the lemons with the citric acid and the Campden tablets. (CAUTION: Campden tablets produce an irritant gas if inhaled. Keep your face well back from the mixture.) Pour over the cooled sugar syrup. Cover and leave overnight or up to a couple of days.", "Sieve and strain through muslin into sterilised bottles and store in the fridge. To serve, dilute to taste with still or sparkling water."]}, {"isVegetarian": false, "title": "Elderflower jelly with easy strawberry ice cream", "url": "www_bbc_co_uk_food_recipes_elderflower_jelly_with_16318", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strawberries, hulls removed", "300ml/10½fl oz extra-thick double cream", "½ vanilla pod, seeds scraped out with a sharp knife", "450ml/¾ pint sparkling elderflower pressé", "50g/2oz caster sugar", "5 gelatine sheets, soaked in cold water for 5 minutes", "1 peach, stone removed, flesh finely diced", "50g/2oz small fresh strawberries, cut into quarters", "small handful fresh basil leaves, preferably Greek basil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the strawberry ice cream, freeze the strawberry quarters in the freezer in a sealable food bag for at least 4 hours, but preferably overnight.", "Meanwhile, for the elderflower jelly, heat 100ml/3½fl oz of the elderflower pressé and all of the caster sugar in a saucepan over a medium heat until just simmering. Drain the soaked gelatine and add it to the elderflower mixture, stirring until dissolved.", "When the gelatine has dissolved, pour in the rest of the elderflower pressé and stir to combine.", "Pour the elderflower jelly mixture into a wide, shallow bowl or a lipped plate. Chill in the fridge until set, about 30 minutes.", "When the strawberries have frozen and the jelly is ready to serve, blend the strawberries in a food processor with the vanilla seeds and half of the cream for 3-4 minutes, or until the ice cream mixture is smooth and thick and the strawberries have started to freeze the cream.", "To serve, decorate the top of the jelly with the chopped peaches, chopped fresh strawberries and basil, then top with scoops of the strawberry ice cream. Serve immediately, with the remaining ice cream in bowls alongside."]}, {"isVegetarian": true, "title": "Elderflower vodka babas", "url": "www_bbc_co_uk_food_recipes_elderflower_vodka_babas_28481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5fl oz plain flour", "20g/¾oz caster sugar", "½ tsp sea salt flakes", "1 x 7g sachet easy-blend dried yeast", "½ orange, juice only", "3 large free-range eggs, lightly whisked", "75g/2½oz butter, softened and cut into cubes, plus extra for greasing", "100g/3½z raisins", "lemon zest, grated", "elderflower vodka, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour, sugar, salt into a bowl and mix thoroughly. Then stir in the yeast.", "Warm the orange juice slightly in a pan. ", "Gently stir the eggs into the flour mixture a little at a time, alternating with the warm orange juice and the butter. ", "Add the raisins and give it a good mix until it forms a smooth dough.  ", "Spoon the mixture into two greased bun tins, dariole moulds or 11cm/4½in baba tins (savarin moulds).  ", "Cover lightly with a tea towel and leave in a warm place for about an hour, or until doubled in size and lightly spongy.  ", "Preheat the oven to 180C/350F/Gas 4.", "Bake in the oven for 10-12 minutes until risen and golden-brown.  ", "Remove from the oven and leave to cool on a wire rack.  ", "To transport for a picnic, put into a preserve jar with some lemon zest and drizzle, to taste, with elderflower vodka."]}, {"isVegetarian": true, "title": "Elderflower cordial", "url": "www_bbc_co_uk_food_recipes_elderflowercordial_6465", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/elderflowercordial_6465_16x9.jpg", "ingredients": ["30 elderflower heads ", "1.7litres/3 pints boiling water ", "900g/2lb caster sugar ", "50g/2oz citric acid (available from chemists) ", "2 unwaxed oranges, sliced", "3 unwaxed lemons, sliced"], "serves": "Makes 1.5litres/2¾pints", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Gently rinse over the elderflowers to remove any dirt or little creatures. ", "Pour the boiling water over the sugar in a very large mixing bowl. Stir well and leave to cool. ", "Add the citric acid, the orange and lemon slices, and then the flowers. ", "Leave in a cool place for 24 hours, stirring occasionally. ", "Strain through some muslin and transfer to sterilised bottles."]}, {"isVegetarian": false, "title": "Elizabethan lamb stew", "url": "www_bbc_co_uk_food_recipes_elizabethanlambstew_83712", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 onions, finely chopped", "2 small red chillies, finely chopped", "½ garlic bulb, peeled and crushed", "5cm/2in piece ginger root, finely chopped", "2 tsp ground coriander", "1.5kg/3lb 5oz diced lamb (ask butcher for a mixture of shoulder and leg)", "100g/3½oz apricots, chopped", "100g/3½oz raisins", "½ bottle white wine", "½ pint chicken stock (or 2 chicken or vegetable stock cubes with ½ pint of water)", "1 tbsp honey", "1 tbsp cornflour", "handful chopped coriander", "couscous ", "mixed leaf salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. ", "Heat the olive oil in a casserole dish and cook the onions for a few minutes until softened, but not coloured.", "Stir in the chilli, garlic, ginger and ground coriander, and cook for a further minute.", "Add the lamb and cook until the meat is browned.", "Add the apricots, raisins, wine, stock and honey. Stir well and bring to the boil.  ", "Transfer to the oven and cook for 1½ hours - alternatively you can simmer it gently on the hob for 1½ hours. ", "Add a tablespoon of water to the cornflour to form a paste and stir this paste into the lamb. ", "Cook for a further couple of minutes to thicken, and stir in the chopped coriander. Serve with couscous and a green salad."]}, {"isVegetarian": false, "title": "Elizabethan pot-roast chicken with spiced plums and creamy leeks", "url": "www_bbc_co_uk_food_recipes_elizabethanpotroastc_81091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4½lb chicken, preferably free-range", "25g/1oz butter", "1 large onion, finely chopped", "115g/4oz raisins ", "225g/8oz firm plums, halved, stones removed", "6 juniper berries, lightly crushed", "1 tsp ground cinnamon", "1 tsp ground ginger", "pinch freshly grated nutmeg", "runny honey", "1 orange, juice only", "300ml/11fl oz chicken stock", "300ml/11fl oz red wine", "few sprigs fresh rosemary", "salt and freshly ground black pepper", "chicken juices from the pan ", "25g/1oz butter", "1 onion, finely chopped", "1 leek, chopped", "sprig thyme", "55ml/2fl oz single cream", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Brown the chicken all over in a non-stick frying pan. Set aside, but reserve the juices in the pan.", "Preheat the oven to 200C/400F/Gas 6. ", "Heat the butter, onion and raisins in an ovenproof saucepan big enough to hold the chicken, and cook until softened. Add the plums, juniper berries, cinnamon, ginger and nutmeg, and stir through. Drizzle in a little honey and pour in orange juice to taste. ", "Pour in the chicken stock and red wine. Simmer gently for a few minutes, then add a few sprigs of rosemary. Season liberally with salt and freshly ground black pepper. ", "Add the chicken to the pan, place in the preheated oven and cook for about 1½ hours, basting several times. The plums will stew down and create a sauce to go with the chicken. The chicken will be cooked when the juices from the thigh run clear when pierced with a skewer.", "Meanwhile, for the creamy leek dish, heat the reserved juices in the chicken pan and add the butter. Fry the onion and chopped leek, then add the thyme. Pour the single cream over the leeks and season well with salt and freshly ground black pepper. Heat through for a couple of minutes. Serve with the spicy plum chicken."]}, {"isVegetarian": true, "title": "Elderflower and lychee cheesecake", "url": "www_bbc_co_uk_food_recipes_elderflowerandlychee_91445", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz ginger biscuits, crushed ", "75g/2¾oz butter, melted ", "400ml/14fl oz elderflower pressé", "100g/3½oz caster sugar", "225g/8oz mascarpone", "1 vanilla pod, seeds scraped out using a knife", "50ml/1¾oz elderflower liqueur", "225ml/8fl oz whipping cream, whipped until soft peaks form when the whisk is removed", "200g/7oz canned lychees, drained, cut into quarters", "125g/4½oz lime marmalade", "50ml/2fl oz boiling water", "edible flowers, to garnish (optional)"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix together the crushed ginger biscuits and melted butter until well combined. Press this mixture into the bottom of each of six glass tumblers to form an even layer.", "Bring the elderflower pressé and sugar to the boil in a pan. Continue to boil until the volume of liquid has reduced by half. Set aside to cool for 5-10 minutes. ", "In a separate bowl, beat the mascarpone, vanilla seeds, cooled elderflower pressé mixture and elderflower liqueur together until well combined. Fold in the whipped cream until well combined, then fold in the lychees.", "Spoon the mixture into the tumblers.", "In a bowl, mix the lime marmalade with the boiling water until it has dissolved. Set aside to cool slightly, then spread over the surface of each cheesecake. ", "Chill the cheesecakes in the fridge for two hours. ", "To serve, place each tumbler onto a small serving plate. Decorate each cheesecake with edible flowers, if using."]}]