[{"isVegetarian": false, "title": "Duck liver and orange pâté", "url": "www_bbc_co_uk_food_recipes_duckliverandorangepa_71658", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, softened", "450g/1lb duck livers, trimmed and cleaned", "2 shallots, finely chopped", "2 cloves garlic, finely chopped", "2 tsp orange juice", "1 tbsp orange zest", "½ tsp freshly ground black pepper", "2 tbsp orange liqueur ", "55g/2oz clarified butter, melted"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat 15g/½oz of the butter in a frying pan until foaming. ", "Add half the livers and fry quickly on all sides until golden, but still pink in the middle, about 4-5 minutes. ", "Repeat with a second batch of butter and livers. ", "Place the livers and juices in a food processor. ", "In the same pan heat another 15g/½oz butter, add the shallot, garlic, and orange juice and zest and cook over a moderate heat until the shallot is soft but not coloured. ", "Add the orange liqueur and freshly ground black pepper, and scrape the bottom of the pan to release any coagulated juices. ", "Place everything in the food processor, including the remaining unsalted butter. Blend until smooth.", "If you want a very smooth pâté, pass the mixture through a fine sieve and put in a bowl. Cover with the cling film, cool then refrigerate. If not using within 48 hours, cover the top with clarified butter."]}, {"isVegetarian": false, "title": "Duck rillettes", "url": "www_bbc_co_uk_food_recipes_duckrillettes_83817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 legs duck confit", "150g-175g/5oz-6oz duck fat", "5 tbsp roughly chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Remove all of the meat from the duck legs, discarding skin, bone and tendons.", "Place the duck meat into a bowl and mash with a fork. ", "Gradually add the duck fat as you continue to mash.", "Add the chopped parsley and season with salt and freshly ground black pepper.", "Spoon the mixture into four small ramekins and place in the fridge to set.", "Remove from the fridge ten minutes before serving."]}, {"isVegetarian": false, "title": "Duck salad", "url": "www_bbc_co_uk_food_recipes_ducksalad_85724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 carrots, cut into thin strips", "1 bunch spring onions, cut into thin strips", "½ cucumber, seeds removed, cut into thin strips", "1 crisp lettuce, such as cos or iceberg, sliced", "2 pre-cooked duck breasts, shredded into small slices", "hoisin sauce, from a jar, to taste", "handful sesame seeds"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all the prepared vegetables in a salad bowl.", "In a separate bowl, toss the cooked duck pieces in the hoisin sauce.", "Place the hoisin duck on top of the salad and sprinkle with sesame seeds. Serve at once."]}, {"isVegetarian": false, "title": "Duck stir-fry with baby corn, cashews and mangetout", "url": "www_bbc_co_uk_food_recipes_duckstirfrywithbabyc_89252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz mangetout, cut in half lengthways", "100g/3½oz baby sweetcorn, cut in half lengthways", "55g/2oz cashew nuts", "150g/5oz duck breast, thinly sliced", "1 tbsp honey", "2 tsp soy sauce", "½ tsp freshly ground black pepper", "2 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok until smoking. Add the mangetout, sweetcorn and cashew nuts and fry for 3-4 minutes, or until the vegetables are tender but retaining a bit of bite.", "Add the duck breast slices to the wok and stir fry for 1-2 minutes, then add the rest of the ingredients. Cook until the sauce is reduced and sticky, and the duck is cooked to your liking. ", "Pile the stir-fry onto a serving plate and serve."]}, {"isVegetarian": false, "title": "Duck teriyaki with pickled cucumber served with celery leaf tempura", "url": "www_bbc_co_uk_food_recipes_duckteriyakiwithpick_83001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large cucumber ", "1 tsp Dijon mustard ", "½ tsp salt ", "1 tbsp sugar", "2 tbsp rice wine vinegar ", "4 duck breasts, boneless and skin removed", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "100ml/4fl oz soy sauce ", "100ml/4fl oz sake ", "3 tbsp sugar ", "vegetable oil, for deep frying", "1 free-range egg yolk ", "250ml/8fl oz iced water", "125g/4½oz plain flour, plus extra for dusting ", "8 sprigs pale celery leaves ", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pickled cucumber, peel and seed the cucumber and slice into 1cm/½in pieces. In a bowl, whisk together the mustard, salt, sugar and vinegar. Marinate the cucumber slices in the mixture for at least 15 minutes and up to one hour.", "For the duck, check the duck breasts and trim off any fat and sinew. Season with salt and freshly ground black pepper.", "Heat a large heavy frying pan over a high heat and sauté the duck breasts in the vegetable oil over a medium to high heat until well browned but still pink in the middle. This will take about four minutes on each side. ", "Remove the duck breasts. Add all the teriyaki glaze ingredients to the pan and boil the mixture until it becomes thick and syrupy. Add the duck to the glaze, and turn frequently for about one minute. When well glazed on both sides, place the breasts on a cutting board and slice into 4-5 pieces each.", "Meanwhile, for the celery tempura, heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "In a small bowl, beat the egg yolk with the water until just mixed. Add the flour and stir just five times with a fork and no more. The mixture will be very lumpy, and this is part of the secret to good tempura.", "Dip the celery leaves in the dusting flour, and then into the tempura batter. Fry in the hot oil for about three minutes until golden brown, turning the leaves in the oil to ensure even cooking. Remove with a slotted spoon and season lightly with salt.", "Serve the duck with the pickled cucumber and garnish with the celery leaf tempura."]}, {"isVegetarian": false, "title": "Duck with mango salsa", "url": "www_bbc_co_uk_food_recipes_duckwithmangosalsa_72997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small Barbary duck breasts", "salt, to taste", "freshly ground green peppercorns", "4 tbsp red onion, finely chopped", "2 ripe mangoes, peeled and cut into 1cm (½in) dice", "4 tbsp lime or lemon juice", "1-2 red chillies, finely diced", "1 tbsp sugar", "2 tbsp fresh mint, chopped", "½ tsp salt", "freshly ground green peppercorns", "flatleaf parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Season the duck breasts with salt and freshly ground green peppercorns, then place them, skin-side down, on a heated griddle pan. ", "Turn the duck breasts. ", "Cook for a few minutes, skin-side up, then turn them again to crisp up the skin. ", "Continue this process until the duck is cooked to your taste.", "To make the salsa, first scald the red onion by pouring boiling water over it and draining it off immediately (this softens the raw flavour of the onion, which can slightly overpower the other ingredients). ", "Mix together with the remaining salsa ingredients and allow the flavours to combine for ½ an hour. ", "Taste the salsa, adding a little more lime, sugar or salt if desired.", "Garnish the duck breasts with parsley and serve with plenty of salsa on the side. Serve with Asian crispy noodles."]}, {"isVegetarian": false, "title": "Duck with noodles and bamboo shoots", "url": "www_bbc_co_uk_food_recipes_duckwithnoodlesandba_77705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, skin cut criss-cross", "salt and freshly ground black pepper ", "2 tbsp olive oil", "4 tbsp brown sugar", "4 whole tinned bamboo shoots", "100g/3½oz rice noodles, uncooked ", "250ml/8¾ fl oz vegetable oil, for frying"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6", "Place the duck skin-side down into a frying pan and season with salt and freshly ground black pepper.  Cook for 3-4 minutes.", "When the duck skin becomes golden, place into the preheated oven for five minutes and cook. Remove and leave to rest. ", "To make the bamboo shoots, in a small frying pan heat the olive oil with the brown sugar and add the bamboo shoots.", "Place into the preheated oven for five minutes. ", "To make the noodles, heat the oil in a heavy-bottomed saucepan (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)  Place the rice noodles into the hot oil.  They will puff immediately.  Remove and drain on kitchen paper.", "To serve place the duck breast on the plate.  Add the bamboo shoots around the duck and top with the noodles."]}, {"isVegetarian": false, "title": "Duck with plum sauce and crispy seaweed", "url": "www_bbc_co_uk_food_recipes_duckwithplumsauceand_4849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["227g-283½g/8-10oz duck breast (or 2 smaller ones) ", "1 tbsp cumin", "2 tbsp clear honey", "1 tbsp corn oil", "salt and pepper", "bottle plum sauce", "packet of crispy seaweed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas6.", "Remove the tendon from the duck breast to prevent the meat shrinking during cooking. ", "Place cumin, honey and oil in a hot non-stick pan and heat until foaming and nut brown. ", "Place the pre-prepared duck, skin side down, into the pan and season well. Cook the breast until the skin is dark brown and crisp. It is important to colour the skin at this stage as it will not colour in the oven. It also removes some of the fat. ", "Turn the duck over in the pan, or remove to a baking tray, and place in the oven. Cook for 5-6 minutes for medium, 8-12 minutes for well done. ", "Remove the duck and let it rest. ", "While the duck is cooking, spoon about 6 tbspof plum sauce into the centre of a serving plate and scatter the crispy seaweed around the edge. ", "Slice the duck and lay it on the pool of sauce. Serve with rice or noodles."]}, {"isVegetarian": false, "title": "Duck wraps", "url": "www_bbc_co_uk_food_recipes_duckwraps_71806", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, marinated in Hoisin sauce and five spice", "salt", "freshly ground black pepper", "2 tbsp oil", "2 spring onions", "2 Baby Gem, picked, washed and dried", "1 cucumber", "3 tbsp simple peanut sauce", "1 tbsp roasted and crushed peanuts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Season the duck breast with salt and pepper. Heat the oil in a pan over a high heat and sear the duck for a few minutes minutes.  ", "Transfer to the oven and cook until medium, 10-15 minutes. Allow to rest for ten minutes.", "Meanwhile, chop the spring onions into julienne and chop the cucumber into thin batons.", "Take the baby gem leaves and spread a little peanut sauce into each one.  ", "Slice the duck into nice thin slices.  Place two slices into each baby gem leaf and add a little spring onion and cucumber. ", "Sprinkle with peanuts and serve."]}, {"isVegetarian": false, "title": "Dukkah lamb cutlets with quinoa salad", "url": "www_bbc_co_uk_food_recipes_dukkah_lamb_cutlets_with_80089", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dukkah_lamb_cutlets_with_80089_16x9.jpg", "ingredients": ["200g/7oz quinoa, cooked according to the packet instructions", "handful fresh parsley, chopped", "1 tbsp chopped fresh mint", "1 red pepper, finely diced", "1 cucumber, finely diced", "1 red onion, finely diced", "2 tbsp extra virgin olive oil", "1 lemon, juice only", "salt and freshly ground black pepper", "½ tsp cloves", "1 tsp fennel seeds", "1 tsp coriander seeds", "1 tsp cumin seeds", "1 tsp paprika", "pinch turmeric", "½ tsp chilli flakes", "50g/2oz hazelnuts, chopped", "30g/1oz pistachios, chopped", "1 tbsp sesame seeds", "4 tbsp honey", "1 orange, juice only", "salt and freshly ground black pepper ", "4 tbsp olive oil", "12 lamb cutlets"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the quinoa salad, mix together the quinoa, herbs and vegetables in a bowl and dress with olive oil and lemon juice. Season, to taste, with salt and freshly ground black pepper. ", "For the dukkah, heat a frying pan and dry fry the cloves, fennel, coriander and cumin until fragrant. Place in a pestle and mortar and grind until smooth. ", "Combine the spices with the rest of the dukkah ingredients in a bowl and mix until well combined. ", "Rub each lamb cutlet with the dukkah and orange juice mixture and grill on a hot griddle, on a barbecue, or under a pre-heated grill, for 2-3 minutes on each side, or until cooked to your liking. ", "To serve place some of the quinoa salad onto four plates and place three lamb cutlets on top of each. "]}, {"isVegetarian": true, "title": "Dundee cake", "url": "www_bbc_co_uk_food_recipes_dundee_cake_22157", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dundee_cake_22157_16x9.jpg", "ingredients": ["175g/6oz softened butter, plus extra for greasing", "175g/6oz soft light brown sugar", "3 tbsp orange marmalade", "3 free-range eggs, beaten", "225g/8oz self-raising flour", "25g/oz ground almonds", "1 heaped tsp ground mixed spice", "400g/14oz mixed dried fruit", "75g/3oz glace cherries, halved ", "2 tbsp whisky or milk", "40g/1½oz blanched almonds to decorate", "1 tsp granulated or caster sugar, to decorate (optional)"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Grease and double-line a 20cm/8in loose-based deep cake tin with greaseproof paper. ", "Beat the butter and sugar in a food processor for 3-4 minutes, or until very light and fluffy.  ", "Add the marmalade and mix for a few seconds more. Slowly add the eggs, one at a time, beating well after each addition. ", "Add the flour, almonds and spices to the batter. Mix slowly until well combined, then stir in the mixed dried fruit and cherries with a large metal spoon. Add the whisky or milk and mix until well combined. ", "Spoon the mixture into the cake tin, smooth the surface and carefully arrange the blanched almonds in circles on top. ", "Bake for 1½-2 hours, or until well risen, firm and golden-brown.  (Test the cake by inserting a skewer into the centre. If the skewer comes out clean, the cake is done.)", "Leave the cake to cool for 10 minutes then remove from the tin, peel off the lining paper and set aside to cool on a wire rack. Sprinkle with granulated sugar. Store in a cake tin and eat within 4-5 days."]}, {"isVegetarian": true, "title": "Dulce and banana traybake", "url": "www_bbc_co_uk_food_recipes_dulce_and_banana_13248", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dulce_and_banana_13248_16x9.jpg", "ingredients": ["50g/2oz butter, plus extra for greasing", "50g/2oz soft light brown sugar", "150g/5½oz butter ", "175g/6oz soft light brown sugar", "4 medium free-range eggs", "½ vanilla pod, seeds only (or a couple of drops of vanilla extract)", "100g/3½oz self-raising flour", "75g/2½oz plain wholemeal flour", "1 tsp baking powder", "3 tsp ground ginger", "1 tsp ground cinnamon", "1 tbsp treacle", "handful pecan nuts (optional)", "pinch salt", "2 small firm bananas", "1 tbsp calvados (optional)", "softly whipped cream or ice cream, to serve"], "serves": "Makes 9 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease and line a 20cm/8in square tin with baking parchment and grease again. Preheat the oven to 180C/350F/Gas 4. ", "First make the sticky topping. Place the butter and soft light brown sugar in a small pan over a medium heat. Once the butter is melted, turn up the heat and let the mixture bubble away for a few minutes, until it begins to thicken slightly. Stir it frequently so it does not catch on the bottom. ", "Pour the mixture into the bottom of the lined tin and tip the tin back and forth to spread it out evenly. The mixture will eventually solidify in the tin so make sure to spread it out now.", "Next, tip the pecans (if using) onto a baking tray and toast in the oven for five minutes. Set aside to cool.", "Now make the sponge mixture. Cream together the butter and sugar in a large bowl (or food mixer) until light and fluffy. Add the eggs one at time, beating hard between each addition. Split the vanilla pod open, scrape the seeds out into the mixture (or add the vanilla extract). Then fold in both flours, the baking powder, ginger, cinnamon, treacle and salt and set aside.", "Slice the bananas into 5mm/¼in thick pieces. Arrange them in a single layer in the bottom of the tin. I line them up so they are nice and straight but of course it is fine to do them in any old order too. Pack them all in tight so they don’t move around once the cake mix goes over. Then drizzle over the calvados (if using). ", "Roughly chop the pecans and stir them through the cake mix. Now, carefully dollop the cake mix over the bananas and gently spread it out with the back of a spoon or palate knife, levelling the top. Pop it into the oven for about 45 minutes.", "After 35 minutes, remove the cake from the oven and insert a metal skewer or the blade of a small knife right into the centre (but not touching the bottom. It should come out completely clean. If there is some cakey gooeyness left on it just pop it back in the oven for another five minutes or so.", "Once the cake is cooked remove it from the oven and leave to cool in the tin for about 10 minutes. Then put a large flat plate over the top of the tin and holding the tin and the plate, flip the whole lot over so that the tin is now upside down. Gently remove the tin and carefully peel off the baking parchment.", "Cut into squares and serve warm or cold with your choice of crème anglaise, softly whipped cream or ice cream. "]}, {"isVegetarian": false, "title": "Duo of lamb with paloise sauce and crushed new potatoes and green beans", "url": "www_bbc_co_uk_food_recipes_duo_of_lamb_with_paloise_18894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter", "½ bunch fresh mint, plus 2-3 tbsp chopped fresh mint leaves ", "2 tbsp white wine vinegar", "50ml/2floz white wine", "1 tsp white peppercorns", "1 small banana shallot, finely diced", "4 free-range eggs, yolks only", "¼ lemon, juice only", "400g/14oz new potatoes", "200g/7oz French beans", "75g/2½ oz butter", "2 x 150-200g/5-7oz lamb fillets", "salt and freshly ground black pepper", "olive oil", "8 lamb chops, trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the paloise sauce, melt the butter in a medium saucepan on a gentle heat. Skim the white foam that floats to the top off the butter. Then pour the butter into a clean bowl, leaving behind any milk solids that have sunk to the bottom of the pan. Add the bunch of mint to the butter.", "Place the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Reduce the heat and simmer until the volume of the liquid has reduced by half.", "Remove the peppercorns, and then pour the mixture into a medium heat-proof bowl. Allow to cool slightly.", "Whisk the egg yolks into the white wine reduction.", "Place the bowl over a pan of simmering water (ensure the bottom of the bowl does not touch the water) and whisk the eggs together until thickened and light in colour.", "Strain the mint-flavoured butter through a sieve into the egg mixture, whisking constantly.", "Season with salt and freshly ground black pepper,  then add the lemon juice and chopped mint leaves.", "Turn off the heat and leave the bowl over the pan until ready to use.", "For the crushed new potatoes and green beans, place the potatoes in a medium saucepan and add cold water bring to the boil and cook for 10-15 minutes until the potatoes are cooked. Drain.", "Bring a medium saucepan of water to the boil and add the beans. Boil for one minute, then drain. ", "Heat a small frying pan and add half the butter. Add the blanched beans to the pan and cook for a minute.", "Crush the new potatoes slightly with a fork and add the remaining butter. Season with salt and pepper.", "Pre-heat the oven to 200C/400F/Gas 6.", "For the duo of lamb, heat a large frying pan and add the oil, season the fillets with salt and fry until browned all over. Transfer to the oven for 8-10 minutes. Remove from the oven and allow to rest.", "Meanwhile, heat a griddle pan until hot. Brush the chops with oil and season with salt and freshly ground black pepper. Place on the griddle and cook for a couple of minutes on each side. Set aside to rest for a few minutes.", "To serve, slice the lamb fillets and place onto a plate with a lamb chop, serve with the new potatoes, green beans alongside and sauce drizzled over."]}, {"isVegetarian": true, "title": "Earl Grey tea bread", "url": "www_bbc_co_uk_food_recipes_earl_grey_tea_bread_48452", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earl_grey_tea_bread_48452_16x9.jpg", "ingredients": ["175g/6oz currants", "175g/6oz sultanas", "300ml10fl oz strong hot Earl Grey tea", "275g/9¾oz self-raising flour", "225g/8oz light muscovado sugar", "1 large free-range egg, beaten", "butter, for greasing, plus extra to serve"], "serves": "Makes 1 loaf", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the currants and sultanas in a bowl and pour over the hot tea. Stir, cover and leave to soak overnight for the liquid to absorb.", "Preheat the oven to 150C/130C Fan/Gas 3½. Grease a 900g/2lb loaf tin and line with non-stick baking paper.", "Add the flour, sugar and egg to the bowl of soaked fruit (if there is a little excess liquid this is fine) and mix thoroughly.  ", "Spoon into the prepared tin and level the top. Bake for 1¾ hours, or until the cake is risen and just firm to the touch, but check it after 1¼ hours to see how it is doing. Leave to cool in the tin for about 10 minutes.  ", "Turn out the cake and remove the paper. To serve, cut into fairly thick slices and spread with butter to serve."]}, {"isVegetarian": true, "title": "Earl Grey martini", "url": "www_bbc_co_uk_food_recipes_earlgreymarteani_87394", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreymarteani_87394_16x9.jpg", "ingredients": ["50ml/2fl oz gin ", "35ml/1½fl oz strong cold Earl Grey tea ", "20ml/¾fl oz lemon juice ", "12.5ml/½fl oz sugar syrup (sold as 'gomme' syrup)", "½ free-range egg white ", "twist lemon peel, to garnish"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gin, Earl Grey tea, lemon juice, sugar syrup and egg white into a cocktail shaker and shake well.", "Double strain the liquid into a Martini glass and garnish with a lemon twist."]}, {"isVegetarian": true, "title": "Earl Grey sorbet with pear, Earl Grey and cinnamon strudel", "url": "www_bbc_co_uk_food_recipes_earlgreysorbetwithpe_92106", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreysorbetwithpe_92106_16x9.jpg", "ingredients": ["30g/1oz Earl Grey tea leaves  ", "300g/10oz caster sugar  ", "1 lemon, juice only ", "1 litre /1¾ pints boiling water ", "700g/1.5lb pears, peeled", "1 tbsp Earl Grey tea leaves", "3 tbsp caster sugar", "½ lemon, juice only", "150g/5½oz sultanas", "100g/3½oz flaked almonds, toasted", "100g/3½oz soft light brown sugar", "1½ tsp ground cinnamon", "275g/10oz ready-made filo pastry", "1 heaped tbsp icing sugar, plus extra for dusting", "100g/3½oz butter, melted", "2-3 rich tea biscuits, crumbled, to serve (optional)"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sorbet, mix together the tea leaves, caster sugar and lemon juice in a heatproof bowl. Pour over the boiling water and set aside to steep for at least 30 minutes.", "When the mixture has steeped, strain it through a fine sieve into an ice cream maker. Churn the mixture, according to the manufacturer's instructions, until almost frozen, then transfer to a freezable container and place in the freezer until set.", "(NB: To make the sorbet without an ice cream maker, freeze the mixture in a freezable container for one hour, then remove and stir to break up the ice crystals. Repeat the freezing and stirring process 2-3 times, until the sorbet is frozen solid.)", "Meanwhile, for the strudel, preheat the oven to 190C/375F/Gas 5.", "Stand the pears in the bottom of a saucepan. Add the tea leaves, caster sugar and lemon juice, then pour over enough cold water to just cover the pears. Bring the mixture to the boil, stirring carefully.", "When the liquid is boiling, reduce the heat until it is simmering. Poach the pears for 15-20 minutes, or until tender. Drain the pears, rinsing off any tea leaves that stick to them, then set aside to cool slightly.", "When the pears have cooled, cut them into quarters, remove the cores, then chop roughly.", "In a bowl, mix together the chopped poached pears, sultanas and almonds until well combined.", "Mix together the soft brown sugar and ground cinnamon, then fold the mixture into the pear mixture until well combined.", "Lay the filo pastry onto a work surface lightly dusted with icing sugar. Overlap the sheets of pastry slightly to form a rectangle about 40cm x 30cm/16in x 12in. As you layer the filo pastry sheets, brush each sheet all over with the melted butter.", "Continue to add the remaining filo pastry sheets in layers, brushing each sheet with more of the melted butter, until all the filo pastry and butter is used.", "Sprinkle the pear mixture onto the filo pastry rectangle, leaving a 2.5cm/1in free at the edges of the rectangle.", "Fold the free edges of the long sides of the rectangle back over the pear mixture. Starting at one end of the shorter sides of the rectangle, roll up the filo pastry and pear filling to form a swiss roll.", "Transfer the filo pastry roll to a baking tray and dust all over with the icing sugar. Bake in the oven for 40-45 minutes, or until the pastry is crisp and golden-brown.", "To serve, slice the cinnamon strudel and place one slice into the centre of each serving plate. Sprinkle some of the rich tea biscuits in a pile alongside the strudel. Place a scoop of the Earl Grey sorbet on top of the crumbled rich tea biscuits."]}, {"isVegetarian": true, "title": "Easter biscuits", "url": "www_bbc_co_uk_food_recipes_easter_biscuits_37686", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_biscuits_37686_16x9.jpg", "ingredients": ["200g/8oz softened butter", "150g/6oz caster sugar", "2 large free-range egg yolk", "400g/14oz plain flour, plus extra for flouring", "1 level tsp mixed spice", "1 level tsp ground cinnamon", "2-4 tbsp milk", "100g/4oz currants", "a little caster sugar, for sprinkling", "1-2 tsp lemon juice", "250g/9oz icing sugar", "about 2 tbsp cold water", "different coloured food colouring"], "serves": "Makes about 30 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Lightly grease two baking trays lined with baking parchment.", "Measure the butter and sugar into a bowl and beat together until light and fluffy. Beat in the egg yolk. Sieve in the flour and spices and add enough milk to give a fairly soft dough.  Bring together, using your hands, to make a soft dough.", "Halve the mixture and set half to one side. ", "For the traditional currant biscuits, add the currants to the remaining half of the mixture and knead it lightly on a lightly floured work surface. Roll out to a thickness of about 5mm/¼in. Cut into rounds using a circular cutter. Place on the prepared baking trays.  Sprinkle with caster sugar.", "Bake in the preheated oven for 15 minutes, or until pale golden-brown. Keep a careful eye on the biscuits - it doesn’t matter if you open the oven door to check. Sprinkle with caster sugar and lift onto a wire rack to cool. Store in an airtight container.", "For the iced biscuits, knead the remaining half of the biscuit dough mixture lightly on a lightly floured work surface. Roll out to a thickness of 5mm/¼in. Cut out Easter biscuits using an assortment of shaped cutters, such as bunnies, Easter eggs, chicks, spring flowers. ", "Lightly grease two baking trays lined with baking parchment.", "Place the biscuit shapes on the prepared baking trays and bake in the preheated oven for 10-15 minutes. Remove from the oven and lift on to a wire rack to cool.", "To make the icing, pass one teaspoon of lemon juice through a fine sieve, to remove any pips or bits. Mix the icing sugar with the lemon juice, and then add about two tablespoons of water, adding it little by little until you have a relatively stiff but smooth icing. Add a splash more sieved lemon juice if necessary.", "Divide the icing into separate bowls and mix in food colourings of your choice into the separate bowls of icing, until you achieve the desired shade.  ", "Spoon a little icing into a piping bag and pipe your decorations onto the biscuits. For a smooth finish, you can pipe the outline of your design in the firmer icing, then slacken it down a bit by mixing in a little more water, giving the icing more of a runny consistency, and use this to fill in the designs."]}, {"isVegetarian": false, "title": "Easter fruit cupcakes", "url": "www_bbc_co_uk_food_recipes_easter_fruit_cupcakes_75736", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_fruit_cupcakes_75736_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter", "2 tsp ground ginger", "2 tsp mixed spice", "250g/9oz caster sugar", "100ml/3½fl oz sunflower oil", "4 medium free-range eggs", "1-2 small dessert apples, about 100g/3½oz ", "100g/3½oz crystallised ginger", "100g/3½oz currants ", "100g/3½oz mixed dried fruit ", "300g/10½oz plain flour", "2 tsp baking powder", "half a batch of cream cheese frosting (see Top recipe tip below) ", "25g/1oz caster sugar", "25ml/1fl oz water"], "serves": "Makes about 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Line the pockets of a muffin tray with muffin cases or paper wraps, and preheat the oven to 180C/350F/Gas 4.", "Melt the butter with the spices in a small pan over a low heat, then pour this into a mixing bowl with the sugar and oil and stir well. Beat in the eggs until smooth.", "Peel the apples and grate them, discarding the core, and stir the apples into the other ingredients, followed by the crystallised ginger, currants and mixed dried fruit. Stir in the flour and baking powder evenly.", "Three-quarter fill each muffin paper with spoonfuls of the mixture and bake for about 25 minutes, or until a skewer poked in comes out almost clean.", "Make the syrup by boiling the sugar with the water in a small pan until dissolved, then leave to liquid to cool. Brush it over the warm cupcakes. ", "When cold, pipe crosses on the cupcakes with the cream cheese frosting before serving."]}, {"isVegetarian": false, "title": "Easter lamb with peas", "url": "www_bbc_co_uk_food_recipes_easter_lamb_with_peas_10766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lamb_with_peas_10766_16x9.jpg", "ingredients": ["1kg/2lb 4oz boned lamb shoulder, cut into large chunks ", "150ml/5fl oz extra virgin olive oil ", "2 onions, roughly chopped", "1 large carrot, sliced ", "1 celery stalk, roughly chopped", "5 garlic cloves, crushed ", "½ x 50g/2oz tin anchovy fillets ", "handful thyme sprigs", "1 red chilli, sliced ", "250ml/9fl oz white wine ", "25ml/1fl oz white wine vinegar ", "250g/9oz fresh or frozen peas ", "400g/14oz potatoes, cut into quarters ", "200g/7oz cherry tomatoes, halved ", "salt and freshly ground black pepper ", "6 portions fresh bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the lamb chunks with salt and black pepper. Set aside. ", "Heat the olive oil in a large lidded pan and fry the onions, carrot and celery for 4–5 minutes, or until softened. Add the garlic, anchovies, thyme and chilli, and continue to cook, stirring, until the anchovies have almost dissolved into the oil. Add the lamb chunks and fry for a further 4–5 minutes, or until browned all over. ", "Stir in the wine and continue to cook until the volume of the liquid has reduced by half, then add the vinegar. Reduce the heat to low, cover and simmer gently for 20 minutes. ", "Add the peas, potatoes and tomatoes, cover again and continue to cook for about an hour, until the sauce has reduced by half. ", "Serve hot with plenty of bread to mop up the sauce."]}, {"isVegetarian": true, "title": "Easter lemon pavlova", "url": "www_bbc_co_uk_food_recipes_easter_lemon_pavlova_99601", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lemon_pavlova_99601_16x9.jpg", "ingredients": ["6 free-range egg whites", "350g/12oz caster sugar", "2 tsp white wine vinegar ", "2 level tsp cornflour", "6 free-range egg yolks", "350g/12oz caster sugar", "4 lemons, juice only", "225g/8oz butter", "450ml/¾pint double cream", "30 chocolate mini-eggs", "100g/3½oz caster sugar, plus extra for coating the zest", "4 lemons, zest only (in long thin strips)"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Lay a piece of baking paper on a baking tray and draw a 25cm/10in circle on it.  ", "Put the egg whites into a bowl and whisk on the fastest speed with an electric hand-whisk or in a free-standing mixer until stiff.  Gradually, still whisking on maximum speed, add generous teaspoons of sugar until the mixture is stiff and shiny and stands in peaks.", "Blend the vinegar and cornflour together in a cup and mix until smooth.  Stir this into the meringue mixture.", "Spread half of the meringue mixture onto the paper to give a 25cm/10in circle. Fill a piping bag, fitted with a rose nozzle, with the rest of the meringue mixture. Carefully pipe about 10 separate little nests positioned equally around the edge of the circle. ", "Slide the meringue into the middle of the oven, turn the heat down to 150C/300F/Gas 2 and bake for 1½-2 hours (check after one hour), or until it easily comes off the paper.  The pavlova will be a pale creamy colour rather than white.  Turn off the oven and leave the pavlova in the oven to become cold.", "Meanwhile, make the lemon curd for the filling. Place a heatproof bowl over a pan of hot water, simmering gently on the stove. Add the egg yolks, sugar and lemon juice to the bowl and whisk. Gradually add the butter, whisking continually until it starts to thicken. It should coat the back of a spoon when it reaches the correct consistency. It will firm up further once cooled.", "Whisk the double cream in a large bowl until thickened, then swirl it through the cooled lemon curd. ", "Spoon the lemon curd and cream mixture into the middle of the pavlova and spread over the base of the meringue nest. Spoon a lemon filling into each of the mini nests. Decorate by placing three chocolate mini-eggs in each of the 10 mini-nests around the edge of the dessert.", "Put 100ml/3½fl oz water and the caster sugar in a pan. Bring to the boil, stirring. Add the zest and boil for 2-3 minutes, or until syrupy. Drain on parchment paper, roll in extra caster sugar and leave to dry in a warm place for a couple of hours, or overnight. Place a delicate mound of candied zest in the middle of the pavlova, and serve."]}, {"isVegetarian": true, "title": "Easter Men", "url": "www_bbc_co_uk_food_recipes_easter_men_31265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz milk. ", "900g/2lb strong white flour", "pinch salt", "14g/½oz fast-action yeast (2 sachets)", "30g/1oz butter", "oil, for greasing", "6 free-range eggs, plus 1 beaten egg for glazing", "18 currants "], "serves": "Makes 6 bread 'men'", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line 3 baking trays with non-stick baking paper.", "Gently heat the milk until tepid. Measure the flour into a large bowl, add the salt to one side of the bowl and the yeast on the opposite side. Rub in the butter using your fingertips. Pour in the tepid milk and mix to combine. Transfer the mixture to a freestanding mixer fitted with a dough hook. Knead until it leaves the side of the bowl and forms a ball of dough. Alternatively, tip out the mixture onto a floured work surface and knead the dough for 10 minutes, or until smooth and elastic to the touch. ", "Put the dough in a lightly oiled bowl and cover loosely with cling film. Set aside until doubled in size. This will take less than an hour in a warm place. ", "Once the dough has proved, carefully remove it from the bowl (expect the dough to collapse once touched). Place on a lightly floured surface and divide into 6 equal pieces. ", "Using your fingers, or a rolling pin, roll the dough to a flatter rectangle shape (about 2.5cm/1in thick). Place an egg (still in its shell) in the middle pressing down slightly. Imagine the dough as a clock, makes short slits at 2, 4, 6, 8 and 10 o’clock. Stretch out the dough to form the legs and arms and shape the top into a circle to form a head.  Pull the arms up and secure over the egg. Use the currants to make eyes and a smile. Glaze with beaten egg. Repeat with the remaining dough.", "Place each 'man' on the prepared baking tray (they will expand as they cook so it’s best to place 2 on each tray). Bake for 25 minutes, or until golden-brown.", "Serve warm. Remove the egg and break the shell to release the hard-boiled egg. Serve with a little butter."]}, {"isVegetarian": false, "title": "Easter simnel cake", "url": "www_bbc_co_uk_food_recipes_easter_simnel_cake_82449", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_cake_82449_16x9.jpg", "ingredients": ["100g/4oz glacé cherries", "225g/8oz  butter, softened", "225g/8oz light muscovado sugar", "4 large eggs", "225g/8oz self-raising flour", "225g/8oz sultanas", "100g/4oz currants", "50g/2oz chopped candied peel", "2 lemons, grated zest only ", "2 tsp ground mixed spice", "450g/1lb marzipan", "1-2 tbsp apricot jam, warmed"], "serves": "Makes One cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/280F/Gas 2. Grease and line a 20cm/ 8in cake tin. ", "Cut the cherries into quarters, put in a sieve and rinse under running water. Drain well then dry thoroughly on kitchen paper. ", "Place the cherries in a bowl with the butter, sugar, eggs, self-raising flour, sultanas, currants, candied peel, lemon zest and mixed spice and beat well until thoroughly mixed. Pour half the mixture into the prepared tin.", "Take one-third of the marzipan and roll it out to a circle the size of the tin and then place on top of the cake mixture. Spoon the remaining cake mixture on top and level the surface.", "Bake in the pre-heated oven for about 2½ hours, or until well risen, evenly brown and firm to the touch. Cover with aluminium foil after one hour if the top is browning too quickly. Leave to cool in the tin for 10 minutes then turn out, peel off the parchment and finish cooling on a wire rack.", "When the cake is cool, brush the top with a little warmed apricot jam and roll out half the remaining marzipan to fit the top. Press firmly on the top and crimp the edges to decorate. Mark a criss-cross pattern on the marzipan with a sharp knife. Form the remaining marzipan into 11 balls. ", "Brush the marzipan with beaten egg and arrange the marzipan balls around the edge of the cake. Brush the tops of the balls with beaten egg and then carefully place the cake under a hot grill until the top is lightly toasted."]}, {"isVegetarian": false, "title": "Spiced pork loin with black pudding sauce, asparagus, and spiced January King cabbage", "url": "www_bbc_co_uk_food_recipes_easter_spiced_pork_loin_42095", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp salt", "½-1 orange, zest only", "6 juniper berries, crushed", "1 stick cinnamon, crushed", "2 tsp Jamaican allspice", "pinch sugar", "700g/1lb 9oz pork loin", "1 large parsnip, peeled and cut into large dice", "600ml/21fl oz chicken stock, plus extra for the gravy", "1 tbsp icing sugar", "pinch fecule (potato flour)", "1 black pudding (2cm/¾in thick, 12cm/4½in long), diced", "knob of butter", "dash of cream", "2 tbsp chopped parsley ", "8 spears new season asparagus ", "4 pieces deep-fried pork rind, to garnish", "300g/11oz January King cabbage, thinly sliced", "30g/1oz salt", "50g/1¾oz smoked bacon lardons", "5g roasted garlic", "25ml/1fl oz rice vinegar", "2 pinches of cumin", "pinch salt, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork loin, mix together the salt, orange zest, juniper, cinnamon, Jamaican allspice and a pinch of sugar. Rub this all over the pork loin. Wrap tightly in clingfilm and leave to marinate in the fridge for three days.", "For the spicy cabbage, when you are ready to cook, mix the 30g/1oz of salt with the sliced cabbage and set aside for 30 minutes.", "Meanwhile, put the pork in a pressure cooker with the diced parsnip and stock and cook for 25 minutes.", "Remove the pork from the cooker. Allow it to rest for five minutes then sprinkle with icing sugar and glaze with a blow torch. ", "To make the sauce, pour off the excess cooking juices from the pork into a small pan, add a little more stock and bring to the boil, thicken lightly with fecule (potato starch) and pass through a fine sieve. Add the diced black pudding. Reserve.", "Remove the parsnips and crush with a fork, add a knob of butter and a few drops of cream. Mix in the parsley and reserve.", "Cook the asparagus spears in boiling water with a pinch of salt and sugar added.", "To cook the spicy cabbage, wash the cabbage thoroughly and dry well.", "In a heavy-bottomed pan, gently fry the bacon, add the roast garlic then the cabbage, rice vinegar and cumin. Mix well and season to taste with salt.", "Stir well and cook for two minutes, or until the cabbage is tender. Check the seasoning again and reserve.", "To serve, place the spicy cabbage in the center of the plate. Carve the pork into two slices per portion and place on top. Place the crushed parsnip to the right and garnish with asparagus. Spoon on the gravy and black pudding. Garnish with the pork rind and serve. "]}, {"isVegetarian": true, "title": "Easter simnel truffles", "url": "www_bbc_co_uk_food_recipes_easter_simnel_truffles_05358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_truffles_05358_16x9.jpg", "ingredients": ["200ml/7fl oz full-fat milk or double cream", "1 cinnamon stick, crushed", "half a nutmeg, grated", "75g/2¾oz muscovado sugar", "300g/10½oz dark chocolate (preferably with 62% or more cocoa solids), finely chopped", "5 tsp brandy", "100g/3½oz marzipan", "100g/3½oz cocoa powder", "100g/3½oz icing sugar", "25g/1oz ground cinnamon", "10g/¼oz ground nutmeg", "400g/14oz dark chocolate, melted and tempered"], "serves": "Makes approximately 30 truffles", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the ganache, put the milk or cream, spices and sugar into a saucepan and bring to a simmer. Place the chopped chocolate in a heatproof bowl. Remove the spiced milk from the heat and strain through a fine sieve onto the chopped chocolate. Whisk until smooth, then add the brandy and whisk again. Pour into a plastic container and refrigerate for an hour, or until set.", "Roll the marzipan into small balls the size of a hazelnut. Coat the marzipan balls in the set ganache and place on a tray.", "For the coating, place the cocoa powder, icing sugar, cinnamon and ground nutmeg into a bowl. ", "Melt and temper the dark chocolate by breaking the chocolate into small, even pieces and gently melting it in a bowl over a saucepan of hot, not boiling, water. Place a cook’s thermometer into the chocolate and continue to heat until it reaches 43C/110F. Remove from the heat and cool to 35C/95F. Now it is ready to use.", "Using your fingers, dip each truffle in the melted, tempered chocolate and drop into the cocoa powder mixture, rolling until the truffle is completely coated. Set aside to cool on a plate. ", "Eat the truffles at room temperature, so they are very soft inside."]}, {"isVegetarian": true, "title": "Easter garibaldi biscuits", "url": "www_bbc_co_uk_food_recipes_easterbiscuits_67742", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easterbiscuits_67742_16x9.jpg", "ingredients": ["110g/4oz caster sugar, plus extra for dusting", "110g/4oz butter, softened at room temperature", "1 free-range egg, separated", "225g/8oz plain flour, sieved", "good pinch mixed spice", "55g/2oz currants", "30g/1oz candied peel", "3 tbsp milk"], "serves": "Makes 20-25 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 160C/325F/Gas 3. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until light and fluffy. Beat in the egg yolk until well combined.", "Fold the flour into the mixture,  then stir in the mixed spice, currants and candied peel.  Stir in enough milk to form a stiff dough.", "Roll the dough out onto a floured surface and cut out the biscuits with a fluted cutter. Place onto the baking sheet and bake for 10 minutes.", "Remove the biscuits from the oven, brush with the reserved egg white, sprinkle with sugar and return to the oven for 5-10 minutes, or until pale golden-brown.", "Remove the biscuits from the tray and set aside to cool on a wire rack."]}]