[{"ingredients": ["Hojaldre de 500g / 1lb 2oz block ready-made", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "3 cucharadas de aceite de girasol", "botón de mantequilla", "1 diente de ajo grande, aplastado", "250g / 9oz de setas de castaña, descuartizado", "250 g / 9 oz de champiñones planos grandes, cortados en 8 cuñas", "250 g / 9 oz de hongos silvestres mezclados como ostra y shitake, en rodajas", "400g / 14oz de crema entera en grasa", "50g / 1¾oz de parmesano o queso duro vegetariano alternativo, finamente rallado", "½ limón, solo jugo", "perejil de flatleaf finamente picado, para adornar", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee una bandeja de hornear con papel de hornear.", "Extienda la masa sobre una superficie de trabajo enharinada en un rectángulo de 28x20cm / 11x8in de aproximadamente 3cm / 1pulg. Marque ligeramente un patrón entrecruzado sobre la superficie de la masa, teniendo cuidado de no cortar todo el camino. Sello de seis rondas con un cortador de 8½cm / 3in.", "Coloque en la bandeja de hornear y refrigere durante 10 minutos. Retire de la nevera y cepille las partes superiores con huevo batido.", "Coloque una lata grande para asar en el horno hasta que esté muy caliente. Agregue con cuidado el aceite, la mantequilla, el ajo y la castaña y los champiñones planos. Sazone con sal y pimienta y mezcle. Coloque la lata en el fondo del horno y la bandeja para hornear con masa cerca de la parte superior del horno. Hornee durante 18-20 minutos, o hasta que los pasteles estén bien aliñados y ligeramente dorados. Los champiñones deben ser marrones y la mayoría de los jugos deberían haberse evaporado.", "Retire ambas bandejas del horno. Corta las galettes por la mitad y quita cualquier pastel sin cocer de los medios. Coloque al revés en la bandeja para hornear.", "Agregue los champiñones silvestres y la crème fraîche a la lata de asar y mezcle. Coloque ambas bandejas de nuevo en el horno durante 8-10 minutos, o hasta que las cajas de los pasteles estén crujientes. Los champiñones se deben ablandar y la crème fraîche habrá hecho una salsa de color champiñón. Agregue el queso y el jugo de limón a los champiñones y sazone bien.", "Coloque la mezcla de champiñones en la mitad de las cajas de repostería. Adorne con el perejil restante y cubra con las otras mitades. Servir de inmediato"], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_galettes_33717", "title": "Galettes de setas silvestres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "½ cucharadita de sal", "100 g / 3½ oz de mantequilla, en cubos", "75 g / 2½ oz de manteca de cerdo, en cubos", "1 cucharada de aceite de oliva", "300g / 10½ oz de champiñones silvestres, limpios", "5 huevos de gallinas camperas, golpeados", "100ml / 3½fl oz de leche entera", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra", "200 g / 7 oz de queso cheddar maduro, rallado", "2 ramitas de tomillo, hojas recogidas", "8 cebolletas, cortadas y cortadas en dos", "5 cucharadas de aceite de oliva", "2 filetes de salmón ahumado en caliente, piel removida y carne en copos", "2 puñados de berros frescos", "1 cucharadita de mostaza Dijon", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco"], "method": ["Para la masa de pasta brisa, ponga la harina y la sal en un tazón grande y agregue los cubos de mantequilla y manteca.", "Use las puntas de los dedos para frotar la mantequilla y la manteca de cerdo en la harina hasta que tenga una mezcla que se asemeje a migas de pan gruesas sin grandes trozos de mantequilla o manteca. Intente trabajar rápidamente para que no se vuelva grasoso.", "Mida ocho cucharadas de agua fría. Con un cuchillo, agregue la cantidad suficiente de agua fría para unir la masa.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera de 10 a 15 minutos antes de usarla.", "Alternativamente, use un procesador de alimentos. Coloque la harina, la mantequilla y la sal en el procesador de alimentos y pulse hasta que la grasa se frote en la harina. Con el motor en funcionamiento, agregue gradualmente el agua a través del embudo hasta que la masa se una. Solo agregue suficiente agua para unirlo y luego deténgase. Envuelva la masa en una película adhesiva como antes y enfríe durante 30 minutos antes de usarla.", "Precalentar el horno a 190C / 375F / Gas 5.", "Estirar la masa en una superficie de trabajo ligeramente enharinada al grosor de una moneda de una libra. Use el rodillo para ayudarlo a levantarlo en una lata de flan de 22cm / 8½ pulgadas de profundidad. Deje que los bordes sobresalgan (estos se recortarán más adelante) y coloque en el refrigerador para enfriar durante al menos 15 minutos.", "Alinee la caja de pastelería con el pergamino para hornear y llénela con alubias para hornear. Coloque en una bandeja para hornear y hornee por 15-20 minutos, o hasta que la masa esté ligeramente dorada. Retire los frijoles para hornear y el pergamino, y vuelva al horno por otros cinco minutos para cocinar la base. Retire y reduzca la temperatura del horno a 160 ° C / 325 ° F / Gas 3.", "Para la quiche de setas silvestres, caliente el aceite en una sartén grande y cocine los champiñones por un minuto. En una jarra, combine los huevos, la leche y la crema y sazone con sal y pimienta.", "Espolvoree el queso en la caja de repostería, luego agregue los champiñones y vierta sobre la mezcla de huevo. Espolvoree las hojas de tomillo sobre la parte superior. Hornee durante 40-45 minutos, o hasta que se complete el llenado.", "Retirar del horno y reservar para enfriar. Cuando esté lo suficientemente frío para manipular, recorte los bordes de la masa.", "Para la ensalada de salmón ahumado, caliente una sartén y mezcle las cebolletas en dos cucharadas de aceite de oliva. Planche las cebolletas durante dos minutos por cada lado, o hasta que estén carbonizadas.", "Coloque las cebolletas en un tazón grande con el salmón y el berro.", "En un tazón pequeño, agregue la mostaza, el vinagre y las tres cucharadas restantes de aceite de oliva. Batir hasta que esté combinado. Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle.", "Sirva la quiche en rebanadas con la ensalada de salmón ahumado."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_quiche_13320", "title": "Quiche de hongos silvestres con ensalada de salmón ahumado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de caldo de pollo", "150 g / 5½ oz de mantequilla sin sal, más una perilla adicional para remover", "200g / 7oz de champiñones, desgarrados si son grandes", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "300 g / 10½ oz de arroz Arborio", "75ml / 2½fl oz de vino blanco seco", "75g / 2¾oz de queso parmesano, finamente rallado", "sal y pimienta negra recién molida", "75g / 2¾oz de mantequilla sin sal", "500 g / 1lb 2 oz de alcachofas de Jerusalén, peladas y cortadas en cubitos", "2 ramitas de tomillo frescas", "150g / 5½oz de queso parmesano, finamente rallado", "75g / 2¾oz de queso parmesano, finamente rallado", "4 huevos de gallinas camperas", "1 manojo de cohete fresco", "aceite de oliva virgen extra, para lloviznar"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para hacer las patatas fritas a la parmesana, cubra una bandeja para hornear con papel antigrasa. Coloque un cortador circular en la bandeja y espolvoree el parmesano en el interior. Repite hasta que tengas cuatro círculos de queso parmesano. Hornee durante 3-8 minutos, o hasta que el queso se haya derretido. Deja enfriar.", "Vierta el caldo en una cacerola y cocine a fuego lento.", "Mientras tanto, caliente una sartén grande a fuego medio. Derrita 75 g / 2½ oz de mantequilla, luego fría los champiñones hasta que estén ligeramente coloreados y la humedad liberada se haya evaporado. Transfiera a un plato y reserve.", "Caliente el resto de la mantequilla de 75 g / 2½ oz y el aceite en la misma sartén, agregue la cebolla y fríela suavemente durante 10-12 minutos, o hasta que esté suave. Agregue el arroz y revuelva hasta que esté cubierto.", "Vierta el vino y deje que burbujee hasta que casi se evapore. Comience a agregar el caldo caliente, aproximadamente dos cucharadas a la vez, revolviendo constantemente y asegurándose de que todo se absorba antes de agregar más. Continúe agregando caldo durante 15-20 minutos, revolviendo todo el tiempo, hasta que el arroz esté tierno y tenga una capa cremosa. Dejar de lado.", "Para las alcachofas, caliente una sartén a fuego lento y agregue la mantequilla. Una vez derretido, agregue las alcachofas y cocine por 5-7 minutos. Agregue el tomillo y cocine durante 3-5 minutos, o hasta que esté bien cocido. Condimentar con sal y pimienta.", "Coloque una bandeja poco profunda de agua con sal sobre fuego medio, cocine a fuego lento y cocine los huevos. Retire de la sartén con una espumadera y escurra sobre papel de cocina", "Regrese el risotto al fuego, agregue el pomo de mantequilla, champiñones cocidos y parmesano y revuelva suavemente. Sazone al gusto con sal y pimienta.", "Transfiera el risotto a los platos para servir, cubra con las alcachofas salteadas, huevo escalfado y parmesano, rocíe con aceite y adorne con el parmesano crujiente y sirva con el cohete."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_risotto_44544", "title": "Risotto de setas silvestres con alcachofas salteadas de Jerusalén", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "1 ramita de tomillo", "200 g / 7 oz de champiñones silvestres, limpios y picados", "Arroz risotto 250 g / 9 oz", "100 ml / 3½ fl oz de vino blanco seco", "600ml / 20fl oz de caldo de pollo", "2 cucharadas de mascarpone o crema doble", "2 cucharadas de parmesano recién rallado", "2 cucharadas de perejil de flatillo picado", "200 g / 7 oz pequeñas bolas de mozzarella de bebé", "sal y pimienta negra recién molida", "Filete de res 300 g / 10½ oz cortado", "1 cucharada de aceite de oliva", "3 cucharadas de menta fresca picada", "3 cucharadas de albahaca fresca rasgada", "3 cucharadas de perejil de flatillo picado", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 limón sin cebar, solo cáscara", "2 cucharadas de alcaparras, escurridas", "4 anchoas, aproximadamente picadas", "3 cucharadas de aceite de oliva virgen extra", "10g / ¼ oz de sangre de toro hojas", "5g hojas de sangre de toro bebé", "½ manojo de cohetes", "Parmesano, virutas"], "method": ["Para las bolas de risotto, en una cacerola mediana, derrita la mantequilla y fría la chalota y el ajo por 5 minutos o hasta que se ablanden. Agregue el tomillo y los champiñones y fría con cuidado durante 2 minutos. Agregue el arroz hasta cubrir la mantequilla. Vierta el vino y permita que burbujee por un minuto más o menos.", "Agregue un cucharón de caldo, hierva y reduzca a fuego lento, revolviendo constantemente. Agregue otra cucharada de caldo y revuelva nuevamente hasta que se absorba. Continúe agregando más caldo de esta manera hasta que los granos de arroz estén rellenos y cremosos. Debe tomar alrededor de 15-18 minutos. Doble en el mascarpone y el parmesano. Sazone al gusto con sal y pimienta y mezcle con el perejil. Deja enfriar.", "Para el carpaccio de ternera, sazone el filete de ternera con sal y pimienta. Calentar una sartén hasta que se fume, agregar el aceite de oliva y dorar la carne durante 2-3 minutos en todos los lados, hasta que se dore. Retire la carne de la cacerola y cúbrala con film transparente y enrolle en forma de barril, girándola firmemente en ambos extremos para sellarla. Refrigere por 1 hora, o hasta que esté firme.", "Cuando el risotto esté frío, use sus manos para cubrir cada bola de mozzarella con el risotto. Forma en bolas.", "Caliente una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las bolas de risotto en el aceite caliente durante 4-5 minutos o hasta que estén doradas. Escurrir sobre papel de cocina.", "Para la salsa verde, ponga todos los ingredientes en un mortero y hierva hasta que tenga una pasta espesa.", "Corta finamente la carne y colócala en un plato grande. Coloca la salsa verde alrededor del plato y agrega las bolas de risotto. Rocíe con el aceite de oliva virgen extra y cubra con hojas de toro y virutas de parmesano."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_risotto_80784", "title": "Bolas de risotto de setas silvestres con carpaccio de ternera", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bulbo de ajo", "Crema doble 500ml / 18fl oz", "puñado de perejil fresco, finamente picado", "5 cucharadas de aceite de oliva virgen extra", "1 ciabatta grande, cortado longitudinalmente en 4", "50ml / 2fl oz de aceite de colza", "1 chalote, picado", "1 diente de ajo, picado", "625g / 1lb 6 oz de hongos silvestres, como chanterelle, ceps, tompette, girolle o ostra", "½ limón, solo jugo", "400ml / 14fl oz de caldo de pollo", "125ml / 4fl oz de crema doble", "50g / 13 / 4oz de mantequilla, cortada en cubitos", "sal y pimienta negra recién molida", "¼ manojo de perifollo fresco, picado, para adornar"], "method": ["Para el pan de ajo, precaliente el horno a 170C / 150C Fan / Gas 3½. Envuelva el bulbo de ajo en papel de aluminio y colóquelo en una bandeja de asar. Asar durante 40-45 minutos, o hasta que estén blandos. Deja enfriar.", "Corta la parte superior del bulbo de ajo y exprime todos los dientes suaves, luego corta finamente.", "Vierta la crema en el tazón de un mezclador independiente y bata durante 3-5 minutos, o hasta que la mezcla se convierta en grumos de grasa sólida con una base líquida. Alinee un colador con una tela de muselina limpia y colóquelo sobre un recipiente. Incline la mezcla en el colador y envuelva la muselina alrededor de la crema. Exprime todo el líquido para que tengas una masa sólida de mantequilla en la muselina, luego descarta el líquido.", "Incline la mantequilla en un recipiente, agregue el ajo picado y una generosa pizca de sal. Agregue el perejil y mezcle una vez más. Refrigere hasta que esté listo para servir.", "Mientras tanto, para la sopa, caliente la mitad del aceite en una cacerola grande de base pesada a fuego medio. Agregue la chalota y el ajo y cocine durante 1-2 minutos, o hasta que se ablanden. Agregue 500 g / 1 libra 2 onzas de champiñones, sazone con sal y pimienta y cocine durante 3-4 minutos.", "Agregue el jugo de limón, luego el caldo. Haga hervir, reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Vierta la sopa en una licuadora y mezcle hasta lograr un puré suave. Regrésalo a la sartén y agrega la crema. Suavemente caliente a fuego lento, agregue la mantequilla, ajuste el condimento, si es necesario, y manténgalo caliente sobre la placa.", "Caliente el aceite restante en una sartén a fuego medio. Freír suavemente los champiñones restantes durante 3 minutos, o hasta que estén cocidos, luego sazonar y reservar.", "Para servir, caliente una sartén grande y cepille el pan con aceite. Coloque en la sartén de la plancha y cocine cada lado durante 1-2 minutos. Extienda el pan con la mantequilla de ajo. Divida los champiñones cocidos entre cuencos, cocine sobre la sopa y espolvoree con el perifollo."], "url": "www_bbc_co_uk_food_recipes_wild_mushroom_soup_with_65367", "title": "Sopa de champiñones con pan casero de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de habas, envasadas", "3-4 cucharadas de aceite de oliva virgen extra", "1 limón, solo jugo", "1 diente de ajo, aplastado", "pizca de copos de chile", "175g / 6oz de arroz salvaje, cocido de acuerdo con las instrucciones del paquete", "1 aguacate maduro, pelado, sin hueso, rebanado", "3 cebollas de primavera, en rodajas", "4 rábanos, en rodajas", "2-3 puñados micro berro"], "method": ["Cocine las habas en una olla de agua hirviendo durante 3-5 minutos. Escurrir y refrescar en agua fría. Cuando se enfríe lo suficiente como para manipularlo, quite la piel de cada frijol, use la uña para cortar la piel y luego saque el frijol verde brillante.", "Batir el aceite de oliva, el jugo de limón, el ajo y las hojuelas de chile en un tazón y sazonar, al gusto, con sal y pimienta negra recién molida.", "Mezcle el arroz salvaje, las habas, el aguacate, la cebolleta y los rábanos en un bol, agregue el aderezo y mezcle con suavidad. Agregue el micro berro, déle a la ensalada un nuevo lanzamiento y sirva."], "url": "www_bbc_co_uk_food_recipes_wild_rice_salad_89972", "title": "Ensalada de arroz salvaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_rice_salad_89972_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "pizca de sal y pimienta negra recién molida", "2 cucharaditas de perejil seco", "250g / 9oz de mantequilla fría, cortada en cubos", "4 yemas de huevo de rango medio", "100 ml / 3½ fl oz de agua helada", "1 huevo de gallinas camperas, batido, para lavar huevos", "rociar aceite de oliva", "3 x 110 g / 4 oz de filetes de salmón sin espinas", "3 ramitas de eneldo fresco", "½ cucharadita de copos de chile", "2 dientes de ajo, ligeramente triturados", "½ limón, en rodajas", "Espárragos finos de 220 g / 8 oz", "tazón de fuente grande agua helada, para refrescarse", "8 huevos grandes de gallinas camperas", "Crema doble de 160ml / 5¾oz", "Parmesano 200 g / 7 oz, finamente rallado", "Gruyère 100 g / 3½ oz, finamente rallado", "pequeño manojo de cebollín fresco"], "method": ["En un tazón grande, combine la harina, la sal, la pimienta y el perejil seco. Agregue la mantequilla fría en cubos y frote con las puntas de los dedos hasta que tenga la textura de las migas de pan (también puede hacerlo en un procesador de alimentos). Agregue las yemas de huevo y mezcle con las manos, luego mezcle lentamente en el agua poco a poco hasta que se una.", "Voltee la masa en la superficie de trabajo y amasar unas pocas veces para formar una bola. Trate de no manejar demasiado la pastelería. Luego divide la masa por la mitad, envuélvela en una película adhesiva y déjala enfriar en la nevera durante media hora.", "Para el llenado, precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Coloque una hoja grande de papel de aluminio y rocíe con aceite de oliva. Coloque los filetes de salmón sobre la lámina y cubra con eneldo fresco, hojuelas de chile y dientes de ajo, agregando una generosa cantidad de sal y pimienta negra recién molida. Exprime las rodajas de limón sobre el pescado y colócalas encima. Doble la lámina para hacer una bolsa suelta y selle los bordes con doble pliegue. Coloque la bolsa en una bandeja para hornear y hornee el salmón durante 10-15 minutos, dependiendo de su grosor. Desenvuelva el pescado, deseche las hierbas, el ajo y el limón y deje el pescado a un lado para que se enfríe. Refrigere hasta que sea necesario.", "Corta los extremos leñosos de los espárragos. Llevar a ebullición una sartén grande de agua con sal, agregar los espárragos y blanquear durante 1 minuto. Vierte los espárragos en el tazón de agua helada y escurre cuando esté frío. Guarde 2 lanzas de espárragos, corte a 10 cm por tarta. Corta el resto en pedazos de 1cm / ½.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Ruede los pasteles a 4 mm de grosor y córtelos en círculos de 11 cm / 4¼, volviendo a enrollarlos según sea necesario, para revestir las mini latas de pastelería. Coloque las latas en una bandeja para hornear y deje enfriar en la nevera durante 10 minutos. (Si no tiene suficientes latas y hornea la masa por lotes, divida la masa por la mitad y enfríe la segunda tanda mientras los demás hornean).", "Corta un cuadrado de papel para hornear un poco más grande que las latas de tarta y escríbalo para ablandar el papel. Coloque un cuadrado en cada caja de pastelería y agregue un montón de granos para hornear. Hornee las cajas de repostería durante 15 minutos. Retire los cuadrados de papel y los frijoles para hornear, y cepille las cajas de repostería con el lavado de huevos. Regrese al horno por otros 6 minutos.", "Mientras tanto, en un tazón, mezcle los huevos y la crema doble, agregue una pizca de sal y una buena molienda de pimienta negra. Aparte 30 g / 1 oz del queso parmesano rallado, luego mezcle los quesos restantes en la mezcla de huevo. Cortar el cebollín fresco y mezclar para combinar.", "Agite suavemente el salmón cocido en trozos en las cajas de pastelería horneada y con algunos pedazos de espárragos. Cuchara sobre la mezcla de huevo para que llene la tarta hasta la parte superior (puede que tenga que empujar el relleno hacia abajo en los huecos). Coloque dos espigas cruzadas de espárragos en la parte superior y espolvoree sobre parmesano rallado reservado.", "Hornee las tartas durante 15 minutos hasta que estén doradas, pero con un leve bamboleo en la parte superior. Deje que se enfríe durante unos minutos antes de pasar cuidadosamente a un estante de enfriamiento. Sirva caliente o frío con una ensalada verde crujiente."], "url": "www_bbc_co_uk_food_recipes_wild_salmon_and_07205", "title": "Quiches de salmón y espárragos silvestres", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 18 quiches individuales", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_salmon_and_07205_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 palitos de apio", "pequeño racimo de perejil", "estragón pequeño racimo", "2 hojas de laurel", "1 puerro, en rodajas", "1 bulbo de hinojo, en rodajas", "2 cebollas, descuartizadas", "6 zanahorias, peladas y en rodajas", "2kg / 4lb 8 oz de espárragos, adornos reservados", "2 cucharadas de sal", "1 cucharada de pimienta negra", "100ml / 3½ oz de vinagre de vino blanco", "2 limones, picados por la mitad", "1x 3.5kg / 8lb de salmón salvaje, eviscerado y a escala", "6 yemas de huevo de gallinas camperas", "1 kg / 2lb 4 oz de mantequilla clarificada, mantenida caliente", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra"], "method": ["Ate el apio, el perejil, el estragón y las hojas de laurel para formar un bouquet garni.", "Llene la mitad de un caldero de pescado grande con agua fría, agregue el bouquet garni, puerro, hinojo, cebolla, zanahoria, guarnición de espárragos, sal, pimienta en grano, vinagre de vino blanco y limones. Coloque el salmón encima y agregue más agua fría para cubrir, si es necesario. Cubra con una tapa y deje que hierva, luego retírela del fuego.", "En una olla grande de agua hirviendo, cocine las espárragos durante 1-2 minutos o hasta que estén tiernas. Escurrir y sumergir en agua helada para refrescar.", "Para hacer la salsa, coloque las yemas de huevo en un recipiente colocado sobre una fuente de agua hirviendo (tenga cuidado de que el recipiente no toque el agua) y bata hasta que quede pálido y espeso. Agregue lentamente la mantequilla tibia en una corriente fina y constante, batiendo todo el tiempo hasta que tenga una emulsión suave. Batir el vinagre de vino blanco y sazonar con sal y pimienta.", "Para servir, tome un trozo de pescado en cada plato junto con algunos espárragos blanqueados y una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_wild_salmon_with_english_40568", "title": "Salmón salvaje con espárragos ingleses y salsa holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_salmon_with_english_40568_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "4 x 150-200g / 5½-7oz pedazos de filete de salmón salvaje", "120ml / 4fl oz de aceite de oliva virgen extra", "1 limón, solo jugo", "2 tomates, piel y semillas retiradas, cortadas en cubitos", "1 chalote, finamente cortado en cubitos", "1 diente de ajo finamente picado", "2 cucharadas de alcaparras", "2 cucharadas de albahaca fresca rasgada", "2 cucharadas de perifollo fresco picado", "2 cucharadas de eneldo fresco picado", "2 cucharadas de perejil fresco picado", "2 cucharadas de cebolletas frescas cortadas", "sal y pimienta negra recién molida"], "method": ["Para el salmón salvaje, caliente una sartén grande y, una vez caliente, agregue el aceite. Coloque los filetes de salmón con la piel hacia abajo durante tres minutos y voltee durante otros tres minutos. Retire de la sartén y deje reposar en un lugar cálido.", "Para la salsa vierge, vierta el aceite de oliva en una sartén no reactiva. Batir el jugo de limón hasta que esté bien combinado. Agregue los tomates picados, chalota, ajo y alcaparras.", "Calentar la sartén a fuego medio hasta que la mezcla se caliente por completo.", "Agregue la albahaca, el perifollo, el eneldo, el perejil y el cebollín y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, divide el salmón entre cuatro platos y luego coloca la salsa vierge sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_wild_salmon_with_sauce_52126", "title": "Salmón salvaje con salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de remolacha marina (disponible en algunos supermercados o en línea)", "Aster de mar 50g / 1¾oz (disponible en línea)", "20g / ¾oz sea purslane (disponible en línea)", "cáscaras de clementina (ver abajo)", "300 g / 10½ oz de calabaza, pelada y cortada en cubitos", "20g / ¾oz de eneldo fresco", "2 x 140g / 5oz lubina salvaje, fileteada", "150ml / 5fl oz de caldo de pescado", "aceite de oliva, para freír", "100g / 3½ oz de mejillones, preferiblemente mejillones Shetland, restregados y despalillados (deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos)", "1 chalote, finamente picado", "tallos de perejil", "100ml / 3½fl oz de vino blanco", "3 clementinas, segmentos y jugo, cáscara reservada", "100ml / 3½fl oz de vinagre de vino blanco", "100 ml // 3½ fl oz de vino blanco", "3 yemas de huevo de gallinas camperas", "150g / 5½ oz de mantequilla clarificada", "salpicar a Tabasco", "algunas ramitas de eneldo fresco, picado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque las verduras de mar, cáscaras de clementina, calabaza en cubitos, eneldo fresco y filetes de lubina en el medio de un gran trozo de papel de pergamino. Doble sobre el papel pergamino para sellar, pero dejando un espacio de 5 cm en un lado. Vierta el caldo de pescado a través del espacio y selle, usando una engrapadora si tiene una, o doblándola como antes.", "Calienta un poco de aceite de oliva en una sartén a prueba de horno y coloca la bolsa en la sartén. Cuando la bolsa comience a subir (aproximadamente un minuto), transfiera la sartén al horno durante 4-5 minutos.", "Para el holandés, ponga el jugo de clementina, el vinagre de vino blanco y el vino blanco en una sartén y póngalo a fuego medio. Llevar a ebullición y cocinar hasta que el volumen del líquido se haya reducido en aproximadamente dos tercios en volumen.", "Coloque las yemas de huevo en un recipiente resistente al calor y agregue la reducción. Coloque el recipiente sobre una olla con agua hirviendo y comience a batir. Batir consistentemente, ya que los huevos comienzan a ponerse ligeros, esponjosos y de color pálido, lentamente comienzan a agregar la mantequilla clarificada en una corriente delgada hasta que se incorpore. Agregue los segmentos de clementina, una pizca de tabasco y eneldo fresco picado.", "Caliente una olla con tapa a fuego muy alto. Una vez que la sartén esté realmente caliente y ahumada, agregue los mejillones, el chalote, los tallos de perejil y el vino blanco. Cubra con la tapa y deje que se caliente durante 2 minutos, o hasta que los mejillones se hayan abierto (deseche los mejillones que permanecen cerrados).", "Abra el paquete de pescado y levante todo el contenido en el medio de un plato grande. Esparce los mejillones alrededor del plato de servir y sirve el holandesa en un lado."], "url": "www_bbc_co_uk_food_recipes_wild_sea_bass_en_83887", "title": "Wild sea bass en papillote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de colza prensado en frío", "4 papas grandes", "pizca de sal marina ahumada", "100ml / 3½fl oz de aceite de colza prensado en frío", "5 chiles rojos pequeños, enteros", "4 cebollas rojas pequeñas, finamente cortadas", "800 g / 1 libra de filetes de carne de venado escocés salvaje de venado de 12 oz", "200g / 7oz de higos secos", "50ml / 2fl oz puerto", "150ml / 5fl oz de vinagre balsámico", "ensalada de berros, para servir"], "method": ["Para las cuñas de papa, precaliente el horno a 200C / 400F / Gas 6. Caliente el aceite de colza en una bandeja para hornear en el horno.", "Corta las papas en trozos tan gruesas o delgadas como quieras, enjuaga con agua fría y sécalo con un paño de cocina (no querrás gotas de agua en las cuñas).", "Agregue las cuñas al aceite caliente y hornee hasta que estén doradas y crujientes (unos 40 minutos), volteándolas solo una vez hasta la mitad. (El tiempo de horneado depende del grosor de las cuñas).", "Para la carne de venado, caliente la mitad del aceite de colza en una sartén pesada. Agregue los chiles al aceite caliente y cubra completamente, cocinando durante aproximadamente dos minutos o hasta que las pieles comiencen a formar ampollas.", "Agregue las cebollas rojas y cocine por tres minutos. Agregue los filetes de carne de venado, girando para sellar todos los lados de la carne. Cocine durante aproximadamente ocho minutos para medio raro. Agregue los higos y el aceite restante, luego el puerto y el vinagre balsámico y reduzca por unos tres minutos.", "Sirva el venado con una ensalada de berros y una pizca de sal marina ahumada sobre las rodajas de patata."], "url": "www_bbc_co_uk_food_recipes_wild_scottish_venison_36281", "title": "Venado escocés salvaje con cuñas de puerto, higos y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_scottish_venison_36281_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Savia de 225g / 8oz", "500g / 1lb 2oz de patatas nuevas y medianas, fregadas y descuartizadas", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "aceite de oliva", "Tocino rayado ahumado de 175g / 6oz, cortado en lardons", "125 g / 4½ oz de habas, envasadas", "gran perilla de mantequilla sin sal", "pimienta negra recién molida", "4 cucharadas de aceite de oliva", "700-900 g / 1 libra 9oz-2 lb de lubina, descascarillada, huesos de alfiler retirados y cortados en 4 filetes", "copos de sal marina y pimienta negra recién molida", "200g / 7oz de mantequilla", "1 chalota de plátano, en rodajas finas", "1 zanahoria mediana, en rodajas finas", "6 botones de champiñones, en rodajas", "200ml / 7fl oz de champán", "300 ml / 10 fl oz de pescado blanco", "300 ml / 10 fl oz doble crema", "Camarones marrones de 150g / 5½oz, pelados"], "method": ["Para la sabana, quite las frondas de los tallos principales y lave bien. Blanquee los tallos en agua hirviendo durante 30 segundos. Refresque en agua fría, drene y reserve.", "Coloque las papas nuevas en una sartén grande con agua con sal, hierva y cocine hasta que estén tiernas, luego escurra.", "Mientras tanto, caliente una sartén grande a fuego alto y agregue un poco de aceite de oliva. Freír los chalotes y el ajo por unos minutos, luego agregar el tocino y cocinar por unos minutos más. Agregue las papas, agite la sartén para asegurarse de que las papas estén coloreadas por todas partes. Agregue el samphire, las habas y la mantequilla.", "Sazonar con pimienta, revolviendo a fondo para asegurarse de que todo esté bien caliente.", "Para la lubina, precaliente la parrilla a altura. Alinee una bandeja para hornear con papel de aluminio", "Marca la piel de los filetes de lubina teniendo cuidado de no cortar demasiado profundamente en la carne.", "Sazonar el lado de la carne del pescado con sal y pimienta. Coloque el pescado con la piel hacia arriba en la bandeja preparada. Cepille la piel con aceite de oliva y coloque los filetes debajo de la parrilla. Cocine durante aproximadamente 4 minutos o hasta que la piel se haya ennegrecido y la carne esté recién hecha.", "Para la salsa, derrita 50 g / 1¾ oz de la mantequilla en una cacerola a fuego medio, agregue las verduras y fríe suavemente hasta que estén suaves pero no coloreadas.", "Agregue la mitad del champán y cocine hasta que se reduzca su volumen hasta obtener una consistencia almibarada. Agregue el caldo y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema y cocine a fuego lento para reducir a la mitad.", "Pasar a través de un colador en una olla limpia y luego con un batidor de calor bajo en la mantequilla restante. Justo antes de servir, agregue los camarones y caliente cuidadosamente la salsa hasta que todo esté bien caliente. Agregue el champán restante y revise el condimento.", "Para servir, coloque las papas nuevas en un plato grande. Cubra con la lubina y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_wild_sea_bass_with_new_73976", "title": "Lubina salvaje con patatas nuevas y salsa de champán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz fresas silvestres, cascadas", "60 g / 2 ½ oz de jugo de yuzu", "150 g / 5½ oz de azúcar", "100 g / 3½ oz de clara de huevo pasteurizada", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de azúcar glasé", "Puré de fresa 250 g / 9 oz", "50g / 1¾oz de jarabe de vainilla", "1 cuchara Gelcrem Fred", "70g / 2½ oz de azúcar", "1½ hojas de gelatina, empapada en agua helada durante 10 minutos", "Hojas de albahaca de 20 g / ½ oz", "50 g / ½ oz de azúcar", "50g / ½ oz de jugo de limón", "160g / 5⅔oz de fresas gariguette, cascadas y cortadas en cuartos", "100ml / 3½fl oz de jarabe de vainilla (hecho de 250 g / 9 oz de azúcar, 250 ml / 9 fl oz de agua y las semillas de una vaina de vainilla)", "20 fresas de fresa alpina, sin cascara", "hojas de micro albahaca, para adornar", "1 lima o yuzu, solo cáscara", "malvaviscos, para adornar"], "method": ["Para sorbete de fresa salvaje y yuzu, coloque las fresas en una licuadora y mezcle hasta que quede suave. Pasar a través de un tamiz.", "Coloque el azúcar y 150ml / 5½ fl oz de agua en una cacerola y hierva hasta que el azúcar se disuelva y tenga un jarabe.", "Agregue el puré de fresa y el jugo de yuzu al almíbar. Coloque en una máquina para hacer helados y revuelva siguiendo las instrucciones del fabricante hasta que se congele.", "Para el merengue, precaliente el horno a 80C / 150F / Gas ¼, o la configuración más baja posible.", "Combine los ingredientes en una batidora grande independiente y bata hasta que se formen picos rígidos cuando se quite la batidora. Con una cuchara, póngala en una manga pastelera y póngale pequeños puntos en una esterilla de silicona o en una bandeja para hornear forrada con pergamino para hornear.", "Hornee por 2-3 horas o hasta que esté firme. Batir las hojas de albahaca en un almirez y mortero. Cuando retire los merengues del final, remuévalos a través de la albahaca triturada y déjelos a un lado.", "Para la mermelada de fresa, combine todos los ingredientes en una termo mezcla o licuadora y pulse hasta que esté completamente incorporado. Colar a través de un tamiz y verter en jarras esterilizadas.", "Para la sopa de albahaca, coloque el azúcar y 350 ml / 12 fl oz de agua en una olla grande y deje que hierva. Exprima la gelatina para eliminar el exceso de agua y luego agregue a la sartén. Dejar de lado para enfriar.", "Coloque las hojas de albahaca y el azúcar en una licuadora y pulse para formar una pasta suave. Agregue el jugo de limón y la mezcla de gelatina, mezcle nuevamente y pase a través de un colador fino.", "Para las gariguettes y fraise des bois, se cubren las gariguettes con un chorrito de jarabe de vainilla y se mezclan con el fraise des bois.", "Para servir, coloque las fresas en tazones pequeños, coloque cinco mini merengues alrededor de las fresas, unas cuantas gotas de mermelada de fresa y espolvoree unas hojas de micro albahaca en la parte superior. Coloque una bola de sorbete encima de las fresas y ralle un poco de yuzu fresco o ralladura de lima sobre la parte superior.", "Rocíe con un poco de jarabe de vainilla y esparza algunos malvaviscos y sirva. Finalmente, en la mesa, ponía un poco de sopa de albahaca fría en los tazones."], "url": "www_bbc_co_uk_food_recipes_wild_strawberries_and_62191", "title": "Fresas salvajes y sorbete de yuzu", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Arroz con IG bajo a 400 g / 14 oz (disponible en tiendas naturistas y algunos supermercados)", "1 hoja de laurel", "2 vainas de cardamomo verde", "2 dientes", "1 cucharada de aceite vegetal", "1 cucharada de mantequilla", "1 cucharadita de semillas de comino", "2 vainas de cardamomo verde, ligeramente trituradas", "1 hoja de laurel", "2 dientes de ajo, pelados, picados", "Cebollas de 200g / 7oz, peladas, finamente picadas", "2 hongos Portobello grandes, limpios, picados", "110 g / 4 oz de champiñones silvestres mezclados, limpios, más o menos picados", "75g / 3oz de granos de maíz dulce", "1 cucharadita de cilantro molido", "½ cucharadita de comino molido", "½ cucharadita de chile rojo en polvo", "½ cucharadita de sal masala", "1 cucharada de pasta de trufa blanca (opcional)", "½ cucharada de puré de tomate", "2 cucharadas de crema individual", "2 cucharadas de hojas de cilantro fresco picado", "sal y pimienta negra recién molida", "8 hojas grandes pasta de filo lista para usar", "Mantequilla 110g / 4oz, derretida", "1 cornetón de cilantro berro", "1/2 cucharada de mantequilla", "½ cucharada de aceite vegetal", "1 diente de ajo, aplastado hasta formar una pasta con el filo de un cuchillo", "½ cucharadita de semillas de cilantro trituradas", "¼ cucharadita de hojuelas de chile seco", "50 g / 2 oz de almendras, ligeramente tostadas, cortadas en mitades", "110g / 4oz de setas silvestres mezcladas, limpias, en rodajas", "1 cucharada de jugo de limón recién exprimido", "sal y pimienta negra recién molida", "1 x 20 g / ¾oz cilantro coriandro cress (opcional)", "Yogur griego de 300g / 11oz", "1 cucharadita de semillas de comino tostadas, molidas a un polvo", "110 g / 4 oz de moras frescas, mezcladas para puré", "virutas de trufa negra (opcional), para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el arroz sancochado, agregue el arroz, la hoja de laurel, el cardamomo y los clavos de olor en una sartén con agua salada hirviendo. Cocine el arroz hasta que esté casi tierno, luego drene bien y reserve.", "Para el biryani, caliente el aceite y la mantequilla en una sartén. Cuando la mantequilla esté espumosa, agregue el comino, el cardamomo y la hoja de laurel y fríalos durante 1-2 minutos, o hasta que estén fragantes y comiencen a reventar. (PRECAUCIÓN: mantenga la bandeja lejos de los ojos y la cara; las semillas pueden explotar).", "Agregue el ajo picado y fría por 1-2 minutos, o hasta que esté pálido dorado.", "Agregue la cebolla picada y fría por 2-3 minutos, o hasta que se dore.", "Agregue todos los hongos y los granos de maíz dulce y continúe freír, revolviendo bien, por otros 3-4 minutos, o hasta que se ablanden.", "Agregue las especias molidas y revuelva bien para cubrir las verduras. Continúe freír durante 1-2 minutos, o hasta que esté fragante, luego agregue la pasta de trufa blanca (si se usa), puré de tomate y crema y revuelva bien para combinar.", "Agregue el arroz sancochado y el cilantro picado y sazone, al gusto, con sal y pimienta negra recién molida.", "Cepille un lado de cada hoja de pasta filo con algo de la mantequilla derretida.", "Coloque una hoja de hojaldre encima de otra para crear dos capas de masa, luego coloque una cuarta parte de la mezcla de biryani en el centro de la masa.", "Doble los lados sobre el relleno de arroz, luego enrolle la masa en un paquete. Cepille todo con más mantequilla derretida.", "Repite el proceso con la masa de filo restante y la mezcla de biryani.", "Coloque los paquetes de biryani y el cilantro en una bandeja para hornear y hornéelos en el horno durante 12-15 minutos, o hasta que la masa esté crujiente y dorada, y el cilantro se haya secado.", "Mientras tanto, para los champiñones, caliente el aceite y la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue el ajo triturado, las semillas de cilantro y las hojuelas de chile y fría durante 1-2 minutos, o hasta que el ajo se haya ablandado.", "Agregue las almendras tostadas, agregue las setas y revuelva bien. Continúe freír durante 1-2 minutos, o hasta que los champiñones se hayan suavizado, luego rocíe sobre el jugo de limón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la raita, mezcle todos los ingredientes de la raita en un procesador de alimentos hasta que estén bien combinados, luego enfríelos en la nevera hasta que los necesite.", "Para servir, espolvoree la mezcla de hongos y almendras en el centro de cada una de las cuatro placas para servir. Corta los paquetes de biryani por la mitad y coloca un paquete de biryani (dos mitades) encima de cada porción. Espolvorea sobre el berro de cilantro seco y las virutas de trufa, si se usa. Sirve la raita al costado."], "url": "www_bbc_co_uk_food_recipes_wildmushroomandsweet_92214", "title": "Paquetes de setas silvestres y biryani de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de pan de ciabatta", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "½ chalota, finamente picada", "100 g / 3½ oz de champiñones, picados", "1 diente de ajo, finamente picado", "75ml / 2½ fl oz crema doble", "1 cucharada de salvia fresca picada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "150g / 5½oz de tomates de vid", "2 ramitas de tomillo fresco", "2 ramitas de romero fresco", "2 cucharaditas de vinagre balsámico", "2 huevos escalfados de campo abierto", "1 cucharada de perejil fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la bruschetta, caliente una sartén hasta que esté caliente. Rocíe el aceite de oliva sobre la rebanada de pan ciabatta y la plancha hasta que se dore por ambos lados. Retire de la sartén.", "En una sartén separada, caliente la mantequilla y fría los chalotes, los champiñones y el ajo hasta que los champiñones comiencen a colorearse, unos cinco minutos. Agregue la crema y cocine a fuego lento hasta que se reduzca un poco, luego agregue la salvia picada y sazone, al gusto, con sal y pimienta negra recién molida.", "Para los tomates, caliente el aceite en una sartén para horno. Agregue los tomates y las hierbas a la sartén y dore por todos lados. Espolvorea sobre el vinagre balsámico y transfiéralo al horno para cocinar durante unos seis minutos, o hasta que esté suave.", "Para servir, coloque la chapata a la parrilla en un plato de servir y cubra con la mezcla de champiñones. Coloque los huevos escalfados encima y coloque los tomates balsámicos en un lado. Adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_wildmushroombruschet_88541", "title": "Bruschetta de hongos silvestres con huevos escalfados y tomates balsámicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla, en rodajas", "1 diente de ajo, picado", "200 g / 7 oz de setas, en rodajas", "salpicar vino blanco", "150ml / 5½ fl oz crema doble", "sal y pimienta negra recién molida", "pequeñas ortigas frescas (use guantes de goma cuando manipule ortigas)", "exprimir jugo de limón", "dash aceite de oliva", "pequeñas ortigas frescas (use guantes de goma cuando manipule ortigas)", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco crujiente, tostado"], "method": ["Para la fricassée, caliente la mantequilla en una sartén, agregue la cebolla y el ajo y fría por 3-4 minutos, o hasta que estén suaves pero no coloreados. Agregue los champiñones y fríalos por 2-3 minutos, o hasta que estén dorados.", "Agregue un poco de vino blanco, luego reduzca el fuego y cocine a fuego lento durante 2-3 minutos. Agregue la crema, sazone al gusto con sal y pimienta negra recién molida y cocine a fuego lento hasta que la salsa se haya reducido a la mitad. Agregue las ortigas y agregue un chorrito de jugo de limón al gusto.", "Para las ortigas marchitas, caliente el aceite de oliva en una sartén y agregue las ortigas. Sazone con sal y pimienta negra recién molida, y deje que se marchite con el fuego durante 1-2 minutos.", "Para servir, apile las ortigas marchitas en un plato para servir, coloque las tostadas encima y luego vierta sobre las setas fricassée."], "url": "www_bbc_co_uk_food_recipes_wildmushroomfricasse_89012", "title": "Setas silvestres fricassée sobre pan tostado con ortigas marchitas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "125 g / 4½ oz de hongos silvestres, como colmenillas, porcini, rebozuelos, etc.", "150ml / 5fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "2 tomates de vid, sin semillas, picados", "Tagliatelle cocido a 200g / 7oz, mantenido caliente", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas"], "method": ["Caliente el aceite en una sartén y fría la cebolla y el ajo durante 3-4 minutos.", "Agregue los champiñones y continúe cocinando durante 4-5 minutos.", "Vierta el vino blanco y cocine a fuego lento hasta que se reduzca un poco, luego vierta la crema. Sazonar bien con sal y pimienta negra recién molida y cocine a fuego lento durante unos cinco minutos. Agregue los tomates.", "Revuelva la salsa en los tallarines cocidos.", "Servir en un tazón de pasta poco profundo, adornado con perejil fresco y cebollino."], "url": "www_bbc_co_uk_food_recipes_wildmushroompasta_88656", "title": "Pasta de hongos salvajes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "1 cucharadita de semillas de comino", "2 hojas de laurel", "1 pedazo grande de canela", "2 vainas de cardamomo negro, ligeramente trituradas", "6 granos de pimienta negra", "6 vainas de cardamomo verde, ligeramente trituradas", "4 dientes", "1 cebolla pequeña, más o menos picada", "gran puñado de anacardos crudos, entero", "200g / 7oz de setas silvestres frescas (girolles, colmenillas, ceps, hongos ostra, etc.) se secaron con una toalla de cocina húmeda y se limpiaron de arena.", "2 dientes de ajo, finamente picados", "sal al gusto", "300g / 10½oz de arroz basmati, lavar bien y remojar (remojar el arroz mientras picas los champiñones)", "390ml / 13¾fl oz de agua", "1 cucharadita de jugo de limón, o al gusto"], "method": ["Calentar el aceite en una olla grande y ancha. Agregue las especias enteras, cocine durante 20 segundos y luego agregue la cebolla y los anacardos. Tenga cuidado ya que pueden ejercer un poco. Freír durante unos 4-5 minutos, hasta que las cebollas estén suaves y doradas en los bordes.", "Agregue los champiñones, el ajo y la sal y saltee a fuego alto durante 4-5 minutos. Escurra el arroz remojado y agrégalo a la sartén junto con el agua de 390ml / 13¾ fll oz, lleva a ebullición, luego cubre y baja el fuego a muy bajo y cocina por diez minutos.", "Después de diez minutos, revise un grano de arroz para ver si está tierno. Si no, déjalo por un minuto más. Quite el calor, retire la tapa y permita que se evapore el exceso de humedad. Mezcle suavemente el jugo de limón, pruebe y ajuste el condimento si es necesario y revuelva suavemente con un tenedor."], "url": "www_bbc_co_uk_food_recipes_wildmushroompilaff_86758", "title": "Pilaf de setas silvestres", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "1 diente de ajo, finamente picado", "100 g / 3½ oz de champiñones silvestres, limpios y picados", "150g / 5½oz de arroz de grano largo", "50ml / 2fl oz de vino blanco", "200ml / 7fl oz de caldo de verduras calientes", "25g / 1oz de mantequilla", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "1 cucharadita de hojas frescas de tomillo"], "method": ["Caliente el aceite en una sartén grande a fuego medio, agregue la cebolla picada y cocine durante 4-5 minutos, o hasta que se suavice pero no se dore.", "Agregue el ajo y los champiñones y cocine por 3-4 minutos.", "Agregue el arroz y revuelva para cubrir todos los granos con aceite. Suba el fuego, agregue el vino blanco y cocine a fuego lento durante 2-3 minutos.", "Reduzca el fuego y gradualmente agregue el caldo, un cucharón a la vez, hasta que todo el líquido haya sido absorbido.", "Agregue la mantequilla y la crema y sazone bien con sal y pimienta negra recién molida.", "Para servir, coloque el risotto en un recipiente y espolvoree sobre las hojas de tomillo."], "url": "www_bbc_co_uk_food_recipes_wildmushroomrisotto_85127", "title": "Risotto de hongo silvestre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Cebolla 50g / 2oz, picada", "1 diente de ajo, picado", "sal al gusto", "175g / 6oz de arroz risotto", "1 litro / 1¾ pintas de agua hirviendo", "1 cucharada de aceite de oliva", "400 g / 14 oz de champiñones mixtos", "100g / 3½oz de parmesano rallado", "1 cucharadita de perifollo fresco picado", "1 cucharadita de cebolletas frescas picadas", "Tomates 100 g / 3½ oz, despellejados, sin semillas y finamente picados", "sal y pimienta negra recién molida", "aceite de trufa blanca, para lloviznar"], "method": ["Para el risotto, caliente el aceite de oliva en una sartén. Coloque las cebollas, el ajo y una pizca de sal en la sartén y cocine hasta que las cebollas estén suaves y transparentes.", "Cuando las cebollas estén cocidas, agregue el arroz y revuelva hasta que el arroz esté muy caliente y los granos estén comenzando a ponerse translúcidos. Comience a agregar el agua poco a poco, revolviendo continuamente. Cocine durante 18-20 minutos, luego retire la sartén del fuego y déjela reposar.", "Para completar el risotto, caliente un poco de aceite de oliva en una sartén. Agregue los champiñones a la sartén y fría por unos minutos.", "Cuando los champiñones se hayan suavizado, mézclelos a través de la base de risotto y cocine el arroz por unos minutos más. Una vez que el arroz esté suave, mezcle el parmesano, el perifollo, la cebolleta y el tomate. Sazonar con sal y pimienta negra recién molida.", "Para servir, coloque el risotto en medio de cuatro platos para servir y rocíe un poco de aceite de trufa blanca."], "url": "www_bbc_co_uk_food_recipes_wildmushroomrisottow_86555", "title": "Risotto de setas con parmesano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]