[{"isVegetarian": true, "title": "Good vegetable soup", "url": "www_bbc_co_uk_food_recipes_goodvegetablesoup_73412", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goodvegetablesoup_73412_16x9.jpg", "ingredients": ["2 tbsp olive or sunflower oil, or 30g/1oz butter", "1 onion, peeled and chopped", "1 garlic clove, peeled and chopped", "1 bouquet garni ", "and/or 1-2 fresh red chillies, de-seeded and chopped", "or 1 tsp or more curry paste or curry powder or spices, e.g. cumin, fennel seeds, cinnamon, etc", "1 potato, or other thickener if needed, peeled and cut into chunks", "500g/18oz vegetables, prepared as appropriate and roughly chopped", "1-1.5 litres/1¾-2¾ pints) vegetable or chicken stock, or vegetable cooking water, or a mixture of water and milk", "salt", "freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oil or butter gently in a large saucepan, then add the base ingredients, the aromatics and the main ingredients. Stir around to coat everything in the fat, then sweat very gently for 10-15 minutes.", "Add 1litre/1¾pints of stock or other liquid, saving the rest for thinning down (if necessary), and season with salt and freshly ground black pepper. Bring up to the boil, then simmer gently for about  20 minutes until all the vegetables are tender.", "Liquidise in several batches, and return to the pan. Thin down with the reserved stock, water or milk as required, and check the seasoning", "Reheat when needed."]}, {"isVegetarian": false, "title": "Goodwood tart", "url": "www_bbc_co_uk_food_recipes_goodwood_tart_84631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain white flour, plus extra for rolling", "pinch salt", "110g/4oz butter, cold and diced, plus extra for greasing", "1 free-range egg, beaten", "1 tbsp olive oil", "4 rashers back bacon, cut into thin strips", "30g/1oz butter", "1 onion, sliced ", "170g/6oz creamy soft cheese, such as Levin Down", "4 free-range eggs", "285ml/½pt double cream", "170g/6oz mature hard cheese, such as Charlton, grated", "2 tbsp chopped fresh parsley", "freshly ground black pepper", "pinch freshly grated nutmeg"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, sieve the flour and salt into a bowl and make a well in the centre. Rub in the butter, then add the egg and bring the dough together with a splash of water. Pull into a ball shape, wrap in cling film and chill in the fridge for at least one hour. ", "Grease a 25cm/10in flan case. Roll out the pastry and lay in the flan case, leaving a little pastry overhanging. Rest it in the fridge for 30 minutes. Preheat the oven to 180C/350F/Gas 4.", "Prick the base of the pastry, lay a circle of greaseproof paper on top, followed by baking beans and bake blind for 20 minutes. Remove from the oven, leave to rest and trim off the excess pastry. ", "For the filling, heat the oil in a frying pan and cook the bacon until lightly browned. Remove the bacon with a slotted spoon, retaining the oil.", "Add the butter to the oil and slowly colour the onion. Leave to cool, then sprinkle in the flan case. Sprinkle the bacon over and break in the soft cheese.", "Beat the eggs and double cream together and mix with 110g/4oz of the grated cheese and the parsley. Season with pepper and pour into flan case. Bake for 20 minutes. ", "Sprinkle over the remaining cheese and the nutmeg and bake for a further 5-10 minutes, until set. Leave to cool for five minutes. Remove the flan ring and slice to serve."]}, {"isVegetarian": true, "title": "Homemade pickles", "url": "www_bbc_co_uk_food_recipes_goonggoongshomemadep_72057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["650-700g/1lb 8 oz Savoy cabbage", "1 cucumber, unpeeled", "2 medium carrots, peeled", "1 medium daikon radish, peeled", "1 bunch red radishes", "45g/1½ oz sea salt ", "385g/13½ oz white sugar", "1.5l/2 pints 13fl oz white vinegar ", "1 tsp chilli oil", "60ml/2¼fl oz light soy sauce"], "serves": "Makes 2 x 1 litre jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Slice cabbage in half lengthways, remove the core and cut into irregular pieces (about 5cm x 2.5cm/2in x 1in). ", "Roughly pull pieces apart to separate the leaves. ", "Slice cucumber and carrots in half lengthways, and then cut into batons (about 6cm x 1cm/2.5in x 0.5in). ", "Slice daikon radish in half lengthways, and cut into pieces (roughly 3cm x 2cm/1in x 0.5in). Cut red radishes in half. ", "Place prepared vegetables in a large bowl, sprinkle with salt, and mix well to combine. Cover bowl tightly with plastic wrap and refrigerate overnight. ", "Combine sugar and vinegar in a heavy-based pot and stir over medium heat until sugar dissolves. ", "Simmer, without stirring, until reduced and slightly syrupy (about 15 minutes). Set aside to cool.", "Next day, pour the cooled syrup over salted vegetables. Add chilli oil and soy sauce to taste, and mix thoroughly. ", "Store in an airtight container in the refrigerator for three days to allow the flavours to develop before using. The pickles will keep, refrigerated, for several months."]}, {"isVegetarian": true, "title": "Gooseberry and elderflower fool", "url": "www_bbc_co_uk_food_recipes_gooseberry_and_12470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp caster sugar\u2028", "4 tbsp elderflower cordial\u2028", "250g/9oz gooseberries, topped, tailed and halved\u2028", "200g/7oz ginger biscuits", "400ml/14fl oz double cream\u2028", "elderflowers, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the sugar, cordial and gooseberries into a pan and cook gently until just soft. Remove from the heat and allow to cool. Set aside a few gooseberries to use as decoration later.", "Crush a quarter of the ginger biscuits into fine crumbs, and break the remaining biscuits into small pieces. ", "Put half the gooseberries in a food processor and blend, then set aside.", "Put the rest of the gooseberries in a bowl and mix with the broken biscuit pieces.\u2028", "Spoon the gooseberry and biscuit mix into four martini glasses.", "Whisk the cream until soft peaks form when the whisk is lifted. Carefully stir in gooseberry purée and then add it to the glasses.", "Sprinkle the biscuit crumbs over the top and decorate with elderflowers and reserved gooseberries."]}, {"isVegetarian": false, "title": "Gooseberry creams with strawberry salad and shortbread", "url": "www_bbc_co_uk_food_recipes_gooseberry_creams_with_49391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "100g/3½oz icing sugar", "pinch salt", "200g/9oz chilled butter, diced", "2 free-range egg yolks, beaten", "700g/1lb 9oz gooseberries, hulled", "40g/1½oz golden caster sugar ", "200ml/7fl oz elderflower cordial", "55ml/2fl oz milk", "3 sheets leaf gelatine, soaked in a bowl of cold water", "275ml/9¼oz plain yoghurt ", "5 tbsp vanilla syrup", "250g/9oz fresh strawberries, washed, hulled, cut into quarters", "1 spring thyme, leaves picked"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the shortbread, sift the flour, icing sugar and salt into a large mixing bowl. Add the diced butter, then rub the butter into the flour mixture using your fingertips until the mixture resembles breadcrumbs.", "Make a well in the centre of the flour mixture, then add the egg yolks and work them into the mixture, drawing the dry ingredients into the wet ingredients gradually, until the mixture comes together as a dough. Be careful not to overwork the dough.", "Shape the dough into a sausage using your hands, then wrap in cling film and chill in the fridge for at least two hours.", "Meanwhile, for the gooseberry creams, place the gooseberries into a large, heavy-based saucepan, sprinkle over the sugar and pour in the elderflower cordial. ", "Bring the mixture to a simmer and simmer, uncovered, for 25-30 minutes, stirring regularly to prevent the mixture catching on the bottom of the pan. Set aside to cool slightly.", "Blend one-quarter of the cooked, cooled gooseberries in a food processor to a smooth purée. ", "Heat the milk over a gentle heat in a separate saucepan. When the milk is hot, drain the gelatine leaves, squeeze to remove any excess liquid and add them to the milk, whisking until dissolved. Remove the pan from the heat.", "Spoon 225ml/8fl oz of the gooseberry purée into a measuring jug (any leftover purée can be added to the reserved cooked gooseberries). Whisk the gooseberry purée into the hot milk, then whisk in the yoghurt until well combined. ", "Divide the mixture equally among four ramekins. Cover each ramekin with cling film and set aside to cool completely, then chill in the fridge until set (when set, the gooseberry creams should wobble slightly when tapped).", "To cook the shortbread, preheat the oven to 190C/375F/Gas 5. Remove the shortbread dough from the fridge, unwrap and slice into thick, even slices. Arrange the slices of dough on a baking tray, then bake the shortbread in the oven for 15-20 minutes, or until crisp and golden-brown.", "Meanwhile, for the strawberry salad, gently warm the vanilla syrup in a small saucepan. Place the quartered strawberries into a bowl, sprinkle over the thyme leaves, then pour over the warm vanilla syrup. Set aside until needed.", "To serve, place one ramekin of gooseberry cream onto each of four dessert plates. Place a teaspoonful of the reserved cooked gooseberries on top of each gooseberry cream. Stack two shortbread alongside. Spoon a portion of the strawberry salad alongside."]}, {"isVegetarian": true, "title": "Gooseberry cupcakes", "url": "www_bbc_co_uk_food_recipes_gooseberry_cupcakes_63065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberry_cupcakes_63065_16x9.jpg", "ingredients": ["4 tbsp caster sugar", "100g/3½oz gooseberries, trimmed ", "120g/4oz ground almonds", "75g/2½oz plain flour", "150g/5½oz icing sugar", "6 free-range egg whites, lightly beaten ", "100g/3½oz unsalted butter, melted, plus extra for greasing", "2 tbsp elderflower cordial", "icing sugar, to dust"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Brush a bun or muffin tin with melted butter.", "Place the caster sugar with two tablespoons of water into a small saucepan and heat, stirring, until the sugar has dissolved. Add the gooseberries and simmer in the syrup for five minutes until soft, stirring occasionally, but be careful not to break them up too much.", "In a large mixing bowl, combine the almonds and flour then sift in the icing sugar.  ", "Stir in the egg whites until just combined, then stir in the melted butter and the elderflower cordial.", "Transfer the batter in spoonfuls to the muffin tin. Place 3-4 stewed gooseberries into the centre of each cake.", "Bake in the oven for 35-40 minutes, or until the cakes feel springy to touch and begin to pull away from the edges of the tin.", "Remove from the oven and allow to cool in the tin for five minutes, then transfer carefully to a wire rack. These are best eaten warm with a dollop of cream."]}, {"isVegetarian": true, "title": "Gooseberry and elderflower Bakewell tart petits fours", "url": "www_bbc_co_uk_food_recipes_gooseberry_and_02813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain flour", "100g/3½oz icing sugar", "250g/9oz cold butter, cut into cubes", "1 vanilla pod, split, seeds scraped out", "2 free-range eggs", "knob of butter", "225g/8oz gooseberries, topped and tailed", "150ml/5½oz water", "225g/8oz granulated sugar", "1 tbsp elderflower cordial", "3 free-range eggs, plus 1 free-range egg yolk", "150g/5½oz soft butter", "150g/5½oz caster sugar", "150g/5½oz ground almonds", "100g/3½oz untoasted flaked almonds"], "serves": "Makes 24", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, pulse the flour, icing sugar and butter in a food processor until the mixture resembles fine breadcrumbs. Add the vanilla seeds and pulse briefly. Remove from the food processor and pour the crumbs into a large bowl. Add the eggs and use a blunt knife to form a paste. Roll into a ball, flatten, cover in cling film and chill in the fridge for 30 minutes.  ", "For the gooseberry and elderflower jam, place a saucer in the freezer.", "Smear the bottom of a large saucepan with the butter, then add the gooseberries and water and simmer for 15 minutes or until the gooseberries are tender. Reduce the heat, add the sugar and stir until well combined. Let this mixture heat through until the sugar has dissolved then increase the heat and boil for 8-10 minutes. Remove the pan from the heat and drop a teaspoon of the mixture onto the chilled saucer - you are looking for a skin to form on the surface once it has cooled. If it hasn’t, continue to boil, checking every five minutes, until the setting point is reached. Put the jam into a bowl and allow the mixture to cool a little before stirring in the cordial. ", "Preheat the oven to 180C/350F/Gas 4. Grease two 12-hole petit four tins. ", "Roll the pastry out thinly on a floured work surface and use it to line the petit four tins. Chill in the fridge for 30 minutes.", "Meanwhile, for the frangipane, beat the eggs in a jug and set aside. Beat the butter and sugar until light and fluffy then add the beaten eggs a little at a time until well combined. Stir in the ground almonds. ", "Spoon a little jam into the bottom of the tart cases, cover with a little frangipane then bake in the oven for 15 minutes or until the filling is just beginning to set. Arrange the flaked almonds in a flower pattern on top of the tarts then return them to the oven for 10-15 minutes or until golden-brown. Cool on a wire rack. "]}, {"isVegetarian": true, "title": "Gooseberry and elderflower fool", "url": "www_bbc_co_uk_food_recipes_gooseberryandelderfl_6907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb green gooseberries topped and tailed", "4 tbsp water ", "10 heads elderflower", "4 tbsp granulated sugar", "1 thick strip of lemon rind ", "290ml/½ pint crème fraîche", "sprigs of lemon balm, mint or elderflower", "muslin to make the elderflower infusion"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gooseberries in a large pan with the water and bring to the boil. Cook gently until the gooseberries begin to soften and release their juices.", "Wrap the elderflower heads in muslin, tie and push into the gooseberries. Allow to simmer gently for 15 minutes.", "Roughly mash the gooseberry mixture with a fork or potato masher, or lightly pulse in a food processor. Tip into a bowl and set aside to cool.", "Remove the elderflower infusion from the gooseberries and squeeze all the juices back into the bowl. Discard the muslin bag. Spoon a quarter of the gooseberry pureé into a small bowl and set aside.", "Add the crème fraîche to the remaining gooseberry pureé and gently fold it in. ", "Spoon the reserved gooseberry pureé between the serving glasses. Layer the fool mixture on top of that and place the glasses in the fridge to chill until they are needed.", "To serve each fool decorate with sprigs of lemon balm, mint or elderflower berries and serve with sponge fingers, if liked."]}, {"isVegetarian": true, "title": "Gooseberry fool", "url": "www_bbc_co_uk_food_recipes_gooseberry_fool_54833", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberry_fool_54833_16x9.jpg", "ingredients": ["500g/1lb 4oz gooseberries, topped and tailed", "100g/3½oz caster sugar", "3 tbsp elderflower cordial", "200g/7oz double cream", "100ml/3½fl oz thick Greek-style yoghurt or crème fraîche", "fresh mint sprigs, to decorate (optional)"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put the gooseberries, sugar and cordial in a saucepan. Cook on a high heat until the sugar has dissolved and the fruit is soft. Remove from the heat and reserve a quarter of the cooked gooseberries. ", "Blend the remaining cooked gooseberries in a blender or food processor, then sieve to remove the skins. Set aside to cool.", "Whisk the cream in a bowl until soft peaks form when the whisk is removed from the bowl. Fold in the yoghurt and fold in the blended gooseberries. Divide between six glasses.  ", "Leave the glasses in the fridge for at least 2 hours, to allow the fool to thicken. ", "To serve, spoon the remaining gooseberries over the top of the fool and decorate with the mint, if using. Serve with honey melts."]}, {"isVegetarian": true, "title": "Gooseberry and elderflower tart", "url": "www_bbc_co_uk_food_recipes_gooseberryandelderfl_72321", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["shortcrust pastry ", "500g/1lb 2oz gooseberries", "125g/4½oz caster or soft brown sugar", "a slug of elderflower cordial", "1 tbsp potato flour", "generous knob of butter", "milk", "1 egg ", "beaten demerara sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven and a baking sheet to 180C/356/Gas 4. ", "Divide the pastry into two halves, one slightly bigger than the other. Roll out the bigger piece and line a shallow, greased dish, leaving some overhang. Sprinkle some sugar over the surface, then throw in the gooseberries. ", "Sprinkle over the potato flour, the rest of the sugar and the elderflower cordial, then dot with the butter. ", "Roll out the remaining piece of pastry for the lid, place it over the top, then seal with a fork all round the edges. ", "Cut a cross in the middle through which the steam can escape, brush with beaten egg, then scatter a bit of demerara sugar over the surface. ", "Place on the hot baking sheet and cook for about 25 minutes. Turn the heat down a bit and continue to cook for another 20-25 minutes until golden and bubbling. ", "Cool for at least 15 minutes, then serve with clotted Jersey cream, or homemade custard."]}, {"isVegetarian": true, "title": "Gooseberry pie with champagne custard", "url": "www_bbc_co_uk_food_recipes_gooseberrypiewithcha_91596", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter, for greasing ", "500g/1lb 2oz fresh gooseberries", "200g/7oz caster sugar", "300g/10½oz ready-rolled shortcrust pastry (rectangular in shape)", "plain flour, for dusting", "1 free-range egg, beaten", "6 free-range egg yolks", "125g/4½oz caster sugar", "200ml/7fl oz full fat milk", "150ml/5½fl oz single cream", "50ml/1¾fl oz champagne", "1 vanilla pod, split, seeds scraped out with a knife"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 25cm/10in pie dish with butter.", "For the gooseberry pie, heat the gooseberries and sugar in a pan over a low to medium heat for 6-8 minutes, or until softened. Set aside to cool.", "Cut the shortcrust pastry in half and roll each piece out onto a lightly floured work surface, until they are 5-8cm/2-3in larger than the diameter of the pie plate.", "Line the prepared pie plate with one of the rolled pastry sheets and trim the edges. Spoon the gooseberry and sugar mixture into the pie case in an even layer, leaving 2.5cm/1in free around the edges.", "Lay the remaining pastry sheet over the pie plate and trim off any excess. Seal the edges of the pastry using a fork. Prick the pie all over with a fork and brush all over with the beaten egg.", "Transfer the gooseberry pie to the oven and bake for 25-30 minutes, or until golden-brown. ", "Meanwhile, for the champagne custard, in bowl, whisk together the egg yolks and sugar until pale and fluffy.", "Heat the milk, cream, champagne and vanilla seeds in a pan until simmering but not boiling. When the mixture is almost boiling, remove the pan from the heat and gradually pour it over the egg and sugar mixture in a thin stream, whisking continuously. ", "Return the custard mixture to a clean pan and heat over a low to medium heat for 8-10 minutes, stirring continuously, until the mixture is thick enough to coat the back of a spoon.", "To serve, slice the pie into 6-8 wedges. Place one wedge into the centre of each serving plate and pour over the champagne custard."]}, {"isVegetarian": true, "title": "Gooseberry fool", "url": "www_bbc_co_uk_food_recipes_gooseberryfool_6466", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberryfool_6466_16x9.jpg", "ingredients": ["450g/1lb gooseberries ", "150ml/5fl oz elderflower cordial ", "2 egg yolks ", "1 tsp arrowroot ", "150ml/5fl oz milk ", "30g/1oz sugar ", "150ml/5fl oz double cream ", "Fresh elderflowers, to decorate"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Top and tail the gooseberries. Put them into a pan with the elderflower cordial. Bring up to the boil and then simmer gently until soft and pulpy. Leave to go cold, and then place in a serving dish. ", "Make the custard heat the milk up in a pan to the point of boiling. Beat the egg yolks, arrowroot and sugar together in a jug and pour the hot milk into the jug.. Mix well and then return to the pan. Heat gently until the custard thickens, but do not boil. Strain into a clean bowl and cool. ", "Whip the cream to the same consistency of the gooseberries.", "Gently stir the cream into the gooseberries and then fold in the custard. Try to give it a marbled effect in the serving bowl. Place a few elderflowers on top to decorate."]}, {"isVegetarian": true, "title": "Gooseberry snow", "url": "www_bbc_co_uk_food_recipes_gooseberrysnow_91868", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberrysnow_91868_16x9.jpg", "ingredients": ["40g/1½oz unsalted butter, plus extra for greasing", "500g/1lb 2oz red or green gooseberries, trimmed", "150g/5½oz caster sugar", "2 large free-range eggs, whites and yolks separated", "¼ tsp vanilla extract"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease four 150ml/5fl oz ramekins with butter. ", "Place 40g/1½oz of the butter, gooseberries and 50g/2oz of the sugar into a pan and heat over a medium heat, stirring regularly, until the butter has melted and the sugar has dissolved. ", "Bring the mixture to a simmer and continue to cook for 6-8 minutes, or until the fruit has started to break down. Remove from the heat and set aside to cool for five minutes.", "Preheat the oven to 190C/375F/Gas 5. ", "In a bowl, whisk the egg whites until stiff peaks form when the whisk is removed. ", "Gradually whisk in the remaining 100g/3½oz of sugar, a little at a time, until the meringue mixture is thick and glossy. Whisk in the vanilla extract until well combined.", "Beat the egg yolks into the cooled gooseberry mixture until well combined. ", "Spoon the gooseberry mixture into the prepared ramekins, then gently spoon over the meringue. Transfer the ramekins to a baking tray. ", "Place the baking tray into the oven and cook the gooseberry snows for 12-15 minutes, or until the meringue is just set and pale golden-brown. Serve immediately."]}, {"isVegetarian": false, "title": "Goose risotto", "url": "www_bbc_co_uk_food_recipes_gooserisotto_93080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "4 shallots, peeled, finely chopped", "2 garlic cloves, crushed", "1 litre/1¾ pints chicken stock", "400g/14½oz risotto rice (such as arborio or carnaroli)", "1 tbsp whole green peppercorns", "2 tbsp butter", "250g/9oz chestnut mushrooms, finely sliced", "500g leftover goose meat, finely chopped", "1 tbsp chopped mixed fresh herbs (sage, rosemary, parsley, tarragon, chives)", "4 tbsp freshly grated parmesan", "salt and freshly ground black pepper", "dressed green salad, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large heavy-based pan over a medium heat, heat two tablespoons of the oil and gently fry the shallots for 2-3 minutes, or until softened but not coloured. Add the garlic and cook for a further 2-3 minutes, or until softened. ", "Meanwhile, place the stock into a pan and bring to a gentle simmer. ", "Add the rice to the pan with the garlic and onion and stir to coat in the oil. Cook for 1-2 minutes, or until the rice is translucent. ", "Add a few ladles of the hot stock to the rice and stir well, then add the peppercorns. Cook until most of the stock has been absorbed before adding another ladleful. Continue cooking until the rice is creamy but is still al dente, about 20 minutes (you may not need all of the stock). ", "Meanwhile, heat the remaining tablespoon of olive oil with one tablespoon of the butter in a frying pan until foaming. Add the mushrooms and fry for 1-2 minutes, or until tender. ", "Fold the mushrooms into the cooked risotto, followed by the chopped goose meat, fresh herbs and parmesan cheese. Season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the risotto into serving dishes. If desired, serve with a green salad alongside."]}, {"isVegetarian": true, "title": "Gorgonzola and pine nut risotto with roasted cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_gorgonzolaandpinenut_84950", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, chopped", "½ onion, chopped", "200g/7oz risotto rice (such as arborio or cannaroli)", "½ tsp chilli flakes", "55ml/2fl oz white wine", "200ml/7fl oz hot vegetable stock ", "large handful spinach leaves", "50g/1¾oz gorgonzola (or a similar vegetarian blue cheese), crumbled", "4 tbsp chopped fresh parsley", "1 tbsp chopped fresh thyme", "2 tbsp chopped fresh basil", "1 garlic clove, chopped ", "55ml/2fl oz olive oil", "salt and freshly ground black pepper ", "200g/7oz cherry tomatoes", "1 tbsp olive oil", "salt and freshly ground black pepper ", "50g/1¾oz pine nuts, toasted, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan, add the garlic, onion and risotto rice and cook over a medium heat for 3-4 minutes.", "Add the chilli flakes, wine and stock to the pan and simmer for 15 minutes, stirring often, until the rice is al dente.", "Stir in the spinach and gorgonzola and set aside to keep warm.", "For the herb oil, place the parsley, thyme, basil, garlic and oil into a bowl. Season, to taste, with salt and freshly ground black pepper and mix well.", "For the roasted tomatoes, place the tomatoes onto a baking sheet, drizzle with the oil and season with salt and freshly ground black pepper. Transfer to the oven and roast for 8-10 minutes.", "To serve, place the risotto onto plates, top with the tomatoes, drizzle with the herb oil and scatter over the toasted pine nuts."]}, {"isVegetarian": false, "title": "Gorgonzola-crusted lamb cutlets on garlic green bean salad", "url": "www_bbc_co_uk_food_recipes_gorgonzolacrustedlam_87031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz gorgonzola cheese", "1 tsp fresh thyme, leaves only", "2 lamb cutlets", "150g/5½oz green beans, trimmed", "1 tbsp olive oil", "1 garlic clove, crushed", "½ onion, finely sliced", "¼ tsp caster sugar", "½ tsp chilli flakes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "In a small bowl, mix the gorgonzola cheese and thyme leaves together.", "Heat a small ovenproof, non-stick frying pan and place the lamb cutlets, fat-side down, into the pan until the fat has melted and is crisp and golden-brown. Turn the lamb cutlets over and brown on the other side.", "Divide the herb gorgonzola cheese into two and press onto the top of the lamb cutlets.", "Transfer the pan to the oven for 3-4 minutes, or until the lamb is cooked to your liking.", "For the green bean salad, bring a pan of salted water to the boil and blanch the green beans for two minutes. Drain.", "Heat the olive oil in a non-stick frying pan and add the garlic, onion, sugar and chilli flakes. Sauté until the onions are soft but not coloured. ", "Add the drained green beans to the pan and fry for a further minute.", "To serve, place the warm green bean salad on a serving plate and top with the lamb cutlets."]}, {"isVegetarian": false, "title": "Gorgonzola, parma ham and thyme filo parcels", "url": "www_bbc_co_uk_food_recipes_gorgonzolaparmahaman_86217", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "4 sheets ready-made filo pastry", "1 free-range egg, beaten", "1 tbsp double cream", "85g/3oz gorgonzola, cubed", "2 slices parma ham, chopped", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper", "1 tbsp sesame seeds, to serve"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Lay two filo pastry sheets on a clean work surface. Mix the beaten egg and cream together in a bowl, then brush a little onto the filo sheets. Lay another sheet of filo on top of each sheet to form a double layer, then brush again with the egg and cream mix. ", "Cut each sheet into four lengthways so you now have eight strips of filo. ", "In a small bowl, mix together the gorgonzola, parma ham, thyme leaves and seasoning. Place a tablespoon of the mixture at the end of each strip of filo pastry, brush again around the filling with the egg and cream mix and then roll up to make triangles. Brush again with the egg and cream mix. ", "Carefully place each triangle into the hot oil. Deep fry for five minutes, or until golden. Remove with a slotted spoon and drain on kitchen paper. ", "To serve, sprinkle with sesame seeds and serve piled up on a serving plate."]}, {"isVegetarian": false, "title": "Gougère barquettes filled with crab, prawn and smoked salmon", "url": "www_bbc_co_uk_food_recipes_gougre_barquettes_filled_00451", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gougre_barquettes_filled_00451_16x9.jpg", "ingredients": ["65g/2¼oz unsalted butter, chopped", "100g/3½oz strong flour", "pinch salt", "3 free-range eggs, beaten ", "75g/2¾oz gruyère, grated", "30g/1oz full-fat cream cheese, softened", "1 tbsp mayonnaise ", "1 tbsp soured cream  ", "1 tsp Dijon mustard", "pinch cayenne pepper", "½ lemon, zest only", "200g/7oz crabmeat, half brown and half white", "handful watercress", "3 slices smoked salmon, cut into 15 strips", "15 cooked large king prawns, peeled ", "½ red pepper, finely chopped", "2 tsp capers, chopped", "salt and freshly ground black pepper", "lemon wedges, to serve"], "serves": "Makes 15 choux canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, put 160ml/5½fl oz cold water and the butter in a saucepan and gently bring to a boil.", "Remove from the heat and add the flour and salt. Stir vigorously and then put on a low heat and mix until the mixture comes away from the sides of the pan. Remove from the heat and leave to cool slightly. ", "Beat in the eggs a little at a time, incorporating each addition thoroughly. Only add enough egg to make the pastry a soft, pipeable consistency (you may not need all the eggs). Fold in the cheese. ", "Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.", "Put the dough in a piping bag fitted with a 16mm plain nozzle and pipe 15 x 8cm/3¼in fingers on to the prepared tray. Bake for about 25 minutes, reducing the oven temperature to 180C/160C Fan/Gas 4 after 10 minutes. When crisp and golden-brown, turn off the oven, open the door and leave the gougères in the oven to dry out and cool.", "Meanwhile, for the filling, stir together the cream cheese, mayonnaise, soured cream, mustard, cayenne pepper and lemon zest with the brown crabmeat. Fold in the white crabmeat, and season, to taste, with salt and pepper. ", "To assemble, cut the tops off the gougères, so they look like canoes. Put a few leaves of watercress in the base and spoon the crab mixture on top. Place a curled strip of smoked salmon and a prawn on top.", "Sprinkle over the finely chopped red pepper, capers and a few small watercress leaves decoratively."]}, {"isVegetarian": false, "title": "Goujons of salmon with sweet potato chips and garlic", "url": "www_bbc_co_uk_food_recipes_goujonsofsalmonwiths_88937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp self-raising flour", "1 free-range egg", "3 tbsp milk", "3-6 tbsp sparkling water", "1 x 125g/4½oz salmon fillet, cut into strips", "vegetable oil, for deep frying", "2 tbsp olive oil", "1 sweet potato, peeled and cut into chips", "1 clove garlic, crushed", "1 slice of lemon"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the salmon goujons, whisk together the flour, egg, milk and enough sparkling water to make a batter with the consistency of double cream (you may not need all of the water). ", "Half-fill a deep saucepan with the vegetable oil and heat until a small cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended). Dip the salmon strips into the batter and deep-fry, in batches, in the oil for 1-2 minutes, or until golden-brown. Remove with a slotted spoon and drain on kitchen paper. Repeat until all the salmon strips are cooked. ", "For the sweet potato chips and garlic, heat the oil in an ovenproof frying pan and gently fry the sweet potato and garlic for 3-4 minutes, then transfer to the oven to cook for 10-12 minutes, or until the chips are tender and golden-brown. ", "To serve, pile the salmon goujons on a serving plate alongside the sweet potato chips and garlic. Garnish with a slice of lemon."]}, {"isVegetarian": false, "title": "Goujons of sole with lemon and mushy peas", "url": "www_bbc_co_uk_food_recipes_goujonsofsolewithlem_71476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1Ib sole or lemon sole fillets, skinned", "sunflower oil for deep-frying", "50g/1¾oz plain flour", "salt", "freshly ground black pepper", "3 medium eggs beaten", "125g/4½oz fine fresh breadcrumbs", "225g/8oz dried marrowfat peas", "1 tsp bicarbonate of soda", "35g/1¼oz butter", "salt", "freshly ground black pepper", "½ tsp cayenne pepper", "2 lemons cut into wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Cut each sole or lemon sole fillet into strips, on the diagonal, about 1cm/½ in thick. Mix the breadcrumbs with the  cayenne pepper and leave to one side. Heat the oil in a deep fat fryer to 190C/375F.", "Season the flour with salt and pepper. Coat the fish in the seasoned flour, then dip first in the beaten egg and then in the breadcrumbs. Do a few pieces at a time,  making sure all the fish is coated in each of the three dips. ", "Place a few of the goujons in the fryer at a time and cook for about one minute, until crisp and golden brown. Repeat  until all the goujons are cooked. Once cooked, remove on to some kitchen paper to soak up the excess oil.", "Pile the goujons in a dish or on plates, season, and serve with the lemon wedges. They're great with a mixed, dressed  green leaf salad. ", "For the mushy peas, soak the peas in a large bowl, in three times their volume of water with the bicarbonate of soda for at least four hours or, if you have the time, overnight.", "Drain the peas, rinse under the tap, and place on the stove in a large pan and cover with the water. Cover and bring  to the boil and once boiled, reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. ", "The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid  off to dry out a little. Beat in the butter and season.", "Serve the mushy peas with the fish, sprinkle with a little cayenne pepper and top with a lemon wedge."]}, {"isVegetarian": false, "title": "Goujons of sole with lemon", "url": "www_bbc_co_uk_food_recipes_goujonsofsolewithlem_83893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz fresh fine breadcrumbs", "½ tsp cayenne pepper", "450g/1lb sole or lemon sole fillets, skinned", "sunflower oil, for frying", "50g/2oz plain flour", "3 free-range eggs, beaten", "2 lemons, cut into wedges", "100g/4oz mayonnaise", "2 tbsp chopped capers", "4 chopped gherkins", "1 tbsp flatleaf parsley", "salt and freshly ground black pepper", "1 lemon, juice only", "4 tbsp olive oil", "1 bag of mixed salad leaves"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the breadcrumbs with the cayenne pepper and leave to one side.", "Cut each lemon sole or sole fillets into strips on the diagonal about 1cm/½in thick.", "Heat the oil in a deep-fat fryer to 190C/375F.", "Coat the fish in flour, then the beaten egg and finally the crumbs; a few pieces at a time, making sure all the fish is coasted thoroughly.", "Place a few of the goujons in the fryer at a time and cook for about one minute, until crisp and golden brown.  Repeat until all the goujons are cooked.", "Once cooked, remove onto some kitchen paper to soak up the excess oil.", "For the tartare sauce mix together the mayonnaise, capers, gherkins and parsley and season.", "To make the salad dressing mix the lemon juice and olive oil together. Dress the mixed salad leaves with it.", "Pile the goujons in a dish or on plates, and serve with the wedges of lemon, tartare sauce and salad."]}, {"isVegetarian": false, "title": "Gourmet burger and unbelievable onion rings", "url": "www_bbc_co_uk_food_recipes_gourmetburgerandunbe_86229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large sweet white onion, sliced into 1cm/½in rings", "1 litre/1¾ pints buttermilk", "175g/6oz plain flour, sifted", "50g/2oz polenta", "1½ tbsp sea salt", "freshly ground black pepper", "1 tbsp chilli powder", "vegetable oil, for deep frying", "balsamic vinegar, to serve", "600g/1lb 5oz steak mince", "salt and freshly ground black pepper", "50ml/2fl oz olive oil", "4 x onion focaccia buns, sliced, griddled until slightly charred", "ready-made mayonnaise, to taste", "1 large beefsteak tomato, sliced", "2 large gherkins, sliced", "handful rocket leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the onion rings, heat the vegetable oil in a deep, heavy-bottomed pan until a bread crumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the separated rings of sliced onion into a large bowl with the buttermilk to soak for 30 minutes, stirring occasionally. ", "Place the flour, polenta, salt, freshly ground black pepper and chilli powder into a clean bowl and mix well. Transfer the mixture to a large plate.", "Take individual onion rings from the buttermilk, making sure there's lots of buttermilk clinging to the onion.", "Dredge each ring in the flour and polenta mixture and set aside, taking care not to shake off any excess flour and polenta coating.", "Carefully add the coated rings to the hot oil in batches of six and fry, stirring occasionally, for 3-4 minutes, or until crisp and golden. (The rings may sink to the bottom at first, but will then float to the top as they cook.)", "Carefully remove the rings with a slotted spoon and drain on kitchen paper. Repeat the deep-frying process until all of the onion rings are cooked.", "For the burger, place the mince into a bowl and season well with salt and freshly ground black pepper.", "Divide the mince into four and mould each piece into a patty shape.", "Brush each patty with the olive oil and place onto a hot griddle pan. Cook for four minutes on each side, or until completely cooked through.", "Place a burger inside each focaccia bun. Spoon over mayonnaise, to taste, and garnish with lettuce, tomato and gherkins.", "To serve, place the onion rings into a large bowl and sprinkle with salt. Place a small bowl of balsamic vinegar alongside to dip into.", "Place the burgers and buns onto plates and serve with the onion rings."]}, {"isVegetarian": false, "title": "How to roast potatoes in goose fat", "url": "www_bbc_co_uk_food_recipes_goose_fat_roast_potatoes_24965", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goose_fat_roast_potatoes_24965_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz King Edward or Maris Piper potatoes", "1 sprig rosemary", "1 sprig thyme", "5-6 garlic cloves, roughly bashed", "1 bay leaf", "½ tbsp whole black peppercorns", "6 tbsp goose fat ", "sea salt"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and halve the potatoes (quarter any large ones; the pieces should all be around the same size). Put the potatoes into a large saucepan along with the rosemary, garlic, bay and peppercorns. Cover with cold water and bring to the boil. Reduce the heat slightly and simmer for 5-7 minutes. ", "Drain the potatoes and leave in the colander to steam dry for 5-10 minutes.", "Meanwhile preheat the oven to 220C/425F/Gas 7. Put the goose fat into a large roasting tin and put in the oven for 3-5 minutes, or until very hot.", "Carefully tip the potatoes (as well as the aromatics they were boiled with) into the hot goose fat, shake gently to move around and roast for 35-40 minutes, turning once or twice. ", "After 20 minutes in the oven remove and gently squash the potatoes a little to create more surface area to make them extra crisp. Return to the oven and cook for a further 15-20 minutes, or until crisp and golden-brown. ", "Discard the aromatics and then season the potatoes with salt. Serve."]}, {"isVegetarian": true, "title": "Graffiti cake", "url": "www_bbc_co_uk_food_recipes_graffiti_cake_96777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, softened, plus extra for greasing", "200g/7oz soft light brown sugar", "½ a vanilla pod, seeds scraped out or 2 drops vanilla extract", "4 free-range eggs, lightly beaten", "200g/7oz self-raising flour", "200g/7oz granulated sugar", "200ml/7oz water", "400g/14oz butter, softened", "½ a vanilla pod, seeds scraped out or 2 drops vanilla extract", "800g/1lb 12oz icing sugar", "250g/9oz granulated sugar", "130ml/4½fl oz golden syrup or liquid glucose", "125ml/4fl oz water", "few drops food colouring", "few drops vanilla extract"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 20cm/8in cake tins.", "Cream the butter and sugar together in a bowl until soft and fluffy. Add the vanilla and a little beaten egg and beat until well combined. Add half the remaining eggs and two tablespoons of flour and mix until well combined. Then add the remaining eggs, another two tablespoons of flour and mix until well combined. Add the rest of the flour and mix until well combined.", "Divide the mixture between the two tins, smooth the mixture and bake in the oven for 25–30 minutes, or until a skewer inserted into the centre of one of the cakes comes out clean.", "Meanwhile for the sugar syrup, heat the sugar and water in a small saucepan over a low-medium heat until the sugar dissolves. Increase the heat and let the mixture boil for two minutes. Remove the pan from the heat and set aside.", "Remove the cakes from the oven and brush the tops liberally with sugar syrup. Once cool, place the sponges in the freezer for 20 minutes. (This will make them easier to ice.)", "For the buttercream, place the butter and vanilla in a large bowl and beat well with a wooden spoon until light and creamy. Add the icing sugar gradually, and beat until well combined. ", "Spoon some of the buttercream onto the middle of the cake board. Place one of the cakes on top. Spread the cake with buttercream and place the remaining sponge on top. ", "Spread the buttercream on the top and side of the cake. (Spread it quite liberally at first, then smooth around the edges and over the top, removing any excess, to give a neat first layer.) Chill the cake in the fridge for 1-2 hours, or until firm. Remove the cake from the fridge and spread over another layer of buttercream.", "For the graffiti, heat the sugar, golden syrup (or liquid glucose) and water in a heavy-based saucepan over a medium heat. Swirl the pan gently. Once the sugar has dissolved, increase the heat and bring the mixture to the boil. If there is any sugar stuck to the side of the pan, brush it with a wet pastry brush. Cook the caramel for 10–15 minutes or until it reaches 150C/300F (the 'hard-crack' stage). Remove the pan from the heat.", "To test whether the caramel is ready: remove a small piece of the sugar mixture with a teaspoon and place it into a cup of cold water. Leave it there for a minute or so to cool down. Feel the sugar mixture on the end of the spoon: it should be hard and form hard, brittle threads that break when bent.", "Add the colouring and flavouring and swirl the pan gently until well combined. Pour the caramel into a heatproof jug. (CAUTION: the caramel will be extremely hot at this point) and set aside to cool slightly for 1-2 minutes.", "Lay a 65cm/25in wide piece of greaseproof paper out on the work surface widthways. Drizzle overlapping circles of the caramel the whole width of the paper (they should be the same height at the cake). Repeat the process so that you have a thick band of caramel.", "Remove the cake from the fridge. When the 'graffiti' is firm but still pliable, carefully peel off the back of the greaseproof paper and stick around the cake. Cut off any excess with scissors."]}, {"isVegetarian": true, "title": "Grandma’s chocolate cake", "url": "www_bbc_co_uk_food_recipes_grandmas_chocolate_cake_60838", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grandmas_chocolate_cake_60838_16x9.jpg", "ingredients": ["235g/8½oz self-raising flour", "255g/9oz caster sugar", "20g/¾oz cocoa powder", "1½ tsp baking powder", "4½ medium free-range eggs, beaten", "255g/9oz baking margarine ", "2 tbsp semi-skimmed milk", "225g/8oz caster sugar", "225g/8oz evaporated milk ", "240g/8¾oz plain chocolate, finely chopped ", "115g/4oz salted butter", "75g/2½oz raspberries", "30g/1oz roasted chopped hazelnuts", "50g/1¾oz dark chocolate ", "50g/1¾oz white chocolate "], "serves": "Makes 1 large cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease and line three 18cm/7in sandwich tins with baking paper.", "For the cake, sieve the flour, sugar, cocoa powder and baking powder into a large mixing bowl. Add the eggs and margarine and beat on high speed for 10 seconds using an electric mixer. Scrape down the sides to make sure everything is incorporated. Add the milk and mix for another 10 seconds on high until well combined.", "Divide the mixture evenly between the three sandwich tins and bake on the middle shelf of the oven for 15-20 minutes or until springy to the touch and starting to come away from the sides of the tins. Remove from the tins and place on a wire rack to cool.", "For the icing, add the sugar and evaporated milk to a large saucepan set over a medium heat. Stir until it starts to simmer, then stop stirring and allow to bubble for 6 minutes. Remove from the heat and set aside to cool slightly. Add the chocolate and butter to the warm mixture and stir until melted and incorporated. Cool until it reaches a spreadable consistency. Transfer the icing to a large piping bag fitted with a large closed star nozzle.", "To decorate, stack the three layers of cake with 3–4 piped rings of icing in between each layer. Cover the top with small swirls of icing then add the raspberries and sprinkle the roasted chopped hazelnuts over the cake.", "In two separate bowls, melt three-quarters of the white chocolate and dark chocolate. Once melted and cooled slightly, add the remaining quarter of each chocolate and stir until combined.  When the melted chocolate becomes tacky, spread the dark chocolate in a thin layer on a large piece of non-stick paper, acetate or a silicone mat. Drizzle lines of the white chocolate across the dark. Leave to set completely then cut into shards. Use the shards to decorate the top of the cake."]}, {"isVegetarian": false, "title": "Granny’s bacon sarnie", "url": "www_bbc_co_uk_food_recipes_grannys_bacon_sarnie_55935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices dry cured back bacon", "50g/1¾oz salted butter, softened", "1 tomato, cut into quarters", "2 slices fresh thick white bread"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the bacon into a cold frying pan, then turn the heat up and cook for a couple of minutes before adding a knob of the butter and the quartered tomatoes.", "Cook until the bacon is just golden-brown at the edges and cooked through and the tomatoes are softened – about 5-6 minutes.", "Slather the bread with the softened butter and place the tomatoes onto one slice of the bread and press down slightly, then add the bacon and top with the second slice of bread.", "Press down lightly to squish it all together then cut in half and eat, mopping up any spilled butter and juices with the sandwich as you go."]}, {"isVegetarian": true, "title": "Granny’s cake", "url": "www_bbc_co_uk_food_recipes_grannys_cake_88424", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grannys_cake_88424_16x9.jpg", "ingredients": ["450g/1lb self-raising flour", "125g/4oz caster sugar", "1 tsp baking powder", "1 tsp mixed spice", "pinch salt", "125g/4oz unsalted butter", "450g/1lb mixed fruit and peel", "1 tsp bicarbonate of soda ", "250ml/9fl oz milk"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to gas 150C/300F/Gas 2. Grease and line a 1.4kg/3lb loaf tin.", "In a bowl sift together the flour, sugar, baking powder, mixed spice and salt. ", "Rub in the butter and then fold in the mixed fruit.", "Stir the bicarbonate of soda into the milk then add to the mix and stir until well combined.  ", "Spoon the mixture into the loaf tin and place in the oven for 1hr 45 minutes. Keep an eye on the cake and cover it with a sheet of foil if it’s getting too dark.", "Allow to cool a little and then turn out. Serve in slices with plenty of butter. "]}, {"isVegetarian": false, "title": "Granny's toad in the hole with my Mum's onion gravy", "url": "www_bbc_co_uk_food_recipes_grannys_toad_in_the_hole_98879", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "1 tbsp wholegrain mustard", "570ml/1 pint milk", "pinch salt", "75g/2¾oz beef dripping (or lard)", "6 good-quality sausages", "2 onions, finely sliced", "1-2 tbsp yeast extract", "75ml/2½fl oz red wine", "1 tbsp gravy granules", "200ml/7fl oz beef stock", "buttered peas, to serve", "knob of butter", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the plain flour in a bowl and make a well in the centre.", "Whisk in the eggs and mustard and continue to whisk until just smooth, then gradually add the milk and salt and whisk to a smooth batter. ", "Place in the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 220C/425F/Gas 7.", "Place three-quarters of the beef dripping into a roasting tin and heat in the oven.", "Heat a frying pan until hot, then add the remaining dripping. When it’s melted, add the sausages and fry on each side until browned.", "Remove the batter from the fridge and whisk once more to combine.", "Place the sausages in the roasting tin and pour over the batter.", "Place in the oven for 30 minutes, then briefly open the oven door to allow the steam to escape and cook for another 10 minutes.", "Make the gravy using the same pan that the sausages were cooked in.", "Place the pan on a high heat, then add the onion and fry for 10 minutes, or until just softened and browned.", "Add the yeast extract and cook for a minute, then add the red wine and cook until the volume of liquid has reduced by half.", "Whisk the gravy granules with a little water until smooth, then add 250ml/9fl oz water and whisk once more. Add to the pan and cook for a few minutes then add the beef stock and simmer for five minutes. Add a knob of butter and season, to taste, with salt and pepper.", "Remove the toad in the hole from the oven and set aside for a few minutes.", "Serve a large spoonful of the toad with a ladleful of gravy and some buttered peas."]}, {"isVegetarian": true, "title": "Grapefruit and ginger meringue pie", "url": "www_bbc_co_uk_food_recipes_grapefruit_and_ginger_59169", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grapefruit_and_ginger_59169_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "65g/2⅓oz icing sugar", "½ tsp salt", "3 tsp ground ginger", "½ tsp ground cinnamon ", "125g/4½oz butter, chilled and cubed", "2 large free-range egg yolks", "1 small free-range egg, beaten", "2 pink grapefruit, juice and zest only", "3 white grapefruit, juice and zest", "1 red grapefruit, juice and zest", "70g/2½oz fresh root ginger, peeled and sliced", "5 large free-range egg yolks", "3 large free-range eggs ", "60g/2¼oz caster sugar", "2 tbsp cornflour ", "pinch salt", "70g/2½oz unsalted butter, cubed", "300g/10½oz caster sugar", "2 tsp lemon juice", "140g/5oz egg whites, at room temperature"], "serves": "Makes 1 23cm/9in pie", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, sift the flour, sugar, salt, ginger and cinnamon into a large bowl. Add the butter and, working quickly, rub the mixture together between your thumb and forefinger until the mixture resembles coarse breadcrumbs.", "Add the yolks and 3 tablespoons water. Using your hands, mix to form a dough.", "Turn onto a very lightly floured work surface. Gently and quickly knead the dough until it becomes smooth. Flatten the dough into a disc and wrap in cling film. Refrigerate for 30 minutes or freeze for 10 minutes.", "Once the pastry has chilled, roll it out thinly on a lightly floured surface. Lift the dough into the tart tin and press into the edges. Leave any excess overhanging the sides of the tart tin. Prick the base with a fork and line with baking paper. Fill with baking beans or uncooked rice and chill again for 10 minutes.", "Preheat the oven to 180C/170C Fan/Gas 4.", "For the filling, add the juice and zest of the grapefruits to a large saucepan. Add the ginger and bring to the boil. Simmer for 10 minutes, then strain to remove the ginger and set the juice aside to cool.", "In a separate heatproof bowl, add the yolks, eggs, sugar, cornflour and salt. Whisk to combine then set the bowl over a pan of gently simmering water (do not allow the water to touch the bowl). Pour in the grapefruit juice and whisk the mixture for about 15 minutes, or until it starts to thicken. Add the butter piece by piece, whisking all the time for about 15 minutes, or until the mixture is very thick. (If the mixture is taking too long to thicken, transfer the mixture to a pan and heat gently until thick.) Place some cling film on the surface of the curd to prevent a skin forming and set aside.", "Remove the pastry from the fridge, place the tin on a baking tray and bake for 15 minutes. Remove the baking beans and greaseproof paper. Brush the base well with beaten egg and bake for another 7–10 minutes, or until the pastry is dry and pale golden-brown. Set aside to cool in the tin, then using a sharp knife cut away the overhanging edge. ", "For the Italian meringue, add the sugar and 180ml/6¼fl oz water to a medium saucepan and bring to the boil. ", "While the sugar and water is being heated, use a paper towel to rub the inside of the bowl of a freestanding mixer with the lemon juice (this will remove any traces of grease that can cause meringues to fail). Add the egg whites to the bowl and whisk on a medium speed until stiff peaks form when the whisk is removed. ", "Once the sugar syrup has reached 113C on a sugar thermometer, remove it from the heat. With the motor running on the mixer, pour the syrup slowly down the side of the bowl. Once the syrup has all been added, increase the speed to high and whisk for about 7–9 minutes, or until the bowl is cool to the touch and the meringue has stiff peaks.", "To assemble the tart, remove the cling film on the curd and gently reheat, if required. Once the curd is warm, pour into the pastry case and smooth the surface.  ", "Spoon the meringue into a large piping bag fitted with a large open star nozzle. Pipe the meringue in swirls on top of the curd and then finish by browning the meringue with a chef’s blowtorch.", "Serve while the filling is still warm."]}, {"isVegetarian": false, "title": "Grapefruit and pepper meringue tartlets", "url": "www_bbc_co_uk_food_recipes_grapefruit_and_pepper_36188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 unwaxed grapefruit, zest and juice only  ", "1 free-range egg plus 1 egg yolk ", "100g/3½oz sugar ", "pinch of salt  ", "1 heaped tbsp cornflour ", "50g/1¾oz soft butter, cubed", "75g/2¾oz butter, very soft but not melted ", "75g/2¾oz sugar ", "a generous pinch of salt", " ½ unwaxed lemon, zest only", "2 egg yolks ", "100g/3½oz plain flour", "2 tsp baking powder", "100g/3½oz sugar ", "2 egg whites (roughly 60g/2¼oz)", "pinch of salt ", "½ tsp pepper"], "serves": "Makes 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the grapefruit curd, measure 90ml/6 tbsp of grapefruit juice into a pan and whisk together with the zest, sugar, salt and eggs over a gentle heat. Sift in the cornflour and continue to whisk. Don’t stop whisking at any point, otherwise the eggs will curdle. ", "Once the curd is as thick as puréed tomatoes and has released a bubble or two, take it off the heat and whisk in the butter a cube at a time. Pour into a bowl and cover with clingfilm, placing it in direct contact with the curd to prevent a skin forming. Refrigerate for at least an hour (best overnight).", "To make the biscuit base, preheat the oven to 180C/350F/Gas 4 and butter six 8x5cm/3x2in metal dessert rings.  ", "Cream together the butter and sugar with the salt and lemon zest until fluffy and pale in colour. Add the egg yolks and continue to beat. ", "Sift the flour and baking powder together, add to the creamed mixture and continue beating until the dough comes together as a smooth paste. ", "Put the dough into a piping bag fitted with a 1cm round nozzle.", "Pipe the dough into the rings in a spiral working from the outside towards the centre until the base is completely covered by a 3–4mm layer, then pipe a ring round the edge to create a little dip for the curd to sit in. Bake for 12–15 minutes or until golden (but not too dark). ", "Remove the biscuit base from the oven and leave to cool for a couple of minutes before running a small sharp knife around the inside of each ring to release the biscuit. Transfer the biscuits to a wire rack (be careful as they’re fragile) and leave to cool.", "To make the meringue, put the sugar into a pan with 40ml/1fl oz water and place on a high heat.  Bring to the soft-ball stage (118C on a sugar thermometer) which will take about 10 minutes. To test without a thermometer, drop a tiny bit of sugar syrup into a bowl of very cold water. When it forms a soft sticky ball, it is ready.", "While waiting for the sugar syrup, start whisking the egg whites with the salt in a clean glass or metal bowl. Whisk until a light froth forms, stopping before any soft peaks can be formed. Once the sugar syrup has reached the soft-ball stage, beat the egg whites at the same time as pouring the syrup onto them in a thin stream. (Don’t pour the syrup over the whisk, but down the side of the bowl.) Add the pepper and continue to whisk for 10 minutes or until the egg whites are glossy and stiff.", "To assemble, place a generous tablespoon of the grapefruit curd on top of the biscuits, followed by the meringue. Either place under a very hot grill for a couple of minutes or use a blowtorch to brown."]}, {"isVegetarian": true, "title": "Grapefruit sandwich cake", "url": "www_bbc_co_uk_food_recipes_grapefruit_sandwich_cake_53862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz unsalted butter", "80g/3oz sugar", "3 large free-range eggs", "125ml/4fl oz grapefruit juice (around 2½ grapefruits)", "1 grapefruit, zest only", "1 grapefruit", "75g/2½oz caster sugar, plus extra for coating", "200g/7oz caster sugar", "200g/7oz baking spread", "210g/7½oz self-raising flour", "4 large free-range eggs ", "25g/1oz ground almonds", "1 grapefruit, zest grated and half the juice", "75ml/2½fl oz grapefruit juice (around 1½ grapefruits)", "75g/2½oz caster sugar", "100g/3½oz mascarpone", "200g/7oz double cream", "50g/1¾oz icing sugar, sifted"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the grapefruit curd, place a heatproof bowl over a saucepan of simmering water.  Melt the butter in the bowl before adding all the other ingredients and whisk with an electric hand-held mixer until thickened.  Remove from the heat and cool to room temperature before placing in the fridge to set further.  (You will make more grapefruit curd than you need for the cake. Refrigerate the rest and eat within a week.)", "For the candied grapefruit peel, peel the grapefruit and cut the peel to the desired length and width. Place in a small saucepan, cover with water and bring to the boil.  Boil for 10-15 seconds and then drain the peel.  Return the peel to the same saucepan and add the sugar with 75ml/2½fl oz of water.  Bring to a boil and cook for 8-10 minutes, or until the liquid is syrupy.  Drain the peel and coat in more caster sugar before leaving to cool and dry on a wire rack.", "Preheat the oven to 180C/160C(fan)/Gas 4. Grease and line 2 x 20cm/8in sandwich tins.  ", "For the cake, mix all the ingredients together in an electric mixer.  Divide the mixture equally between the two tins and bake on the middle shelf of the oven for 25-30 minutes. Allow to cool in the tins for five minutes, then turn out onto a wire rack.", "Meanwhile, for the grapefruit sugar syrup, place the grapefruit juice and sugar in a small saucepan and bring to a boil. Boil for around five minutes, or until the syrup begins to thicken.  Remove from the heat and cool slightly.  ", "While the cakes are still warm, pierce the surface with a cocktail stick all over.  Drizzle the syrup evenly over both cakes. Allow to cool completely.", "For the mascarpone cream, whisk the ingredients together until thick and airy, but not too stiff.", "To decorate the cake, place the bottom layer of the cake onto a serving plate.  ", "Transfer a quarter of the mascarpone cream into a piping bag fitted with a 1cm/½in plain nozzle, and set aside. Then spread on half of the remaining mascarpone cream onto the cake.  Spoon over a generous amount of the grapefruit curd – some curd may spill over the edges but don’t worry about this.  ", "Place the other cake on top and spread the remaining cream on top of the cake, smoothing it all over so that it is evenly distributed.  ", "Using the piping bag, pipe balls of icing around the edges and centre of the cake.  Place a few strips of the candied peel on each ball of icing.  Serve straight away, or refrigerate until ready to be devoured."]}, {"isVegetarian": true, "title": "Grape spritzer", "url": "www_bbc_co_uk_food_recipes_grapespritzer_92194", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180-200g/6½-7oz ripe grapes", "2 tbsp elderflower cordial", "8 ice cubes, plus extra to serve", "150ml/5fl oz white wine", "4 mint leaves ", "splash sparkling water, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients except for the sparkling water in a food processor until smooth and well combined. ", "To serve, half-fill two tall glasses with ice cubes. Pour over the grape mixture. Top up each glass with the sparkling water."]}, {"isVegetarian": true, "title": "Gratin of roasted Mediterranean vegetables with mature cheddar", "url": "www_bbc_co_uk_food_recipes_gratin_of_roasted_11753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red onions, cut into quarters and then cut lengthways again", "1 large aubergine (the purple Italian variety is best), roughly chopped", "2 yellow peppers, deseeded and roughly chopped", "2 red peppers, deseeded and roughly chopped", "3 courgettes, roughly chopped", "1 small fennel bulb, roughly chopped", "275ml/½ pint olive oil", "1 garlic clove, peeled and roughly chopped", "black pepper and coarsely ground sea salt", "600g/1lb 5oz small new potatoes", "450g/1lb baby vine tomatoes", "25g/1oz basil, roughly chopped or torn", "400g/14oz tin red kidney beans, rinsed and drained", "200g/7oz mature cheddar cheese, grated  "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "In a large bowl, mix the onions, aubergine, peppers, courgettes and fennel. Pour over the olive oil, add the garlic, and mix thoroughly with your hands. ", "Transfer the vegetables to a roasting tin. Spread evenly and season to taste with salt and pepper. ", "Fill a large pan with boiling salted water. Add the new potatoes and cook until just tender. Drain the potatoes and add them to the mixed vegetables. ", "Place in the hot oven and once the vegetables have started to colour, add the tomatoes, basil and kidney beans. Mix well and return to the oven for a further 20 minutes, or until the vegetables are coloured, but still reasonably crunchy in texture. ", "Taste and add more salt and pepper, if desired. Serve either hot or cold with grated cheese scattered over."]}, {"isVegetarian": false, "title": "Gratinated scallops and lobster", "url": "www_bbc_co_uk_food_recipes_gratinatedscallopand_92456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "2 shallots, peeled, finely chopped", "12 hand-dived scallops, in their shells, cut in half to create two thinner scallops (roes and trimmings reserved, rounded halves of shells washed and reserved)", "200ml/7fl oz white wine", "300ml/10½fl oz fish stock", "225ml/8fl oz double cream", "2 tsp Dijon mustard", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper", "1 large carrot, peeled, julienned", "1 large courgette, julienned", "2 x 750g/1lb 10½oz cooked lobsters, shell removed, meat roughly chopped", "25g/1oz fresh breadcrumbs", "25g/1oz Gruyère, finely grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "Heat half of the butter in a pan over a medium heat. When the butter is foaming, add the chopped shallots and fry for 2-3 minutes, or until softened.", "Add the scallop roes and trimmings and the wine and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the volume of liquid has reduced by half.", "Add the fish stock and return the mixture to the boil. Return the mixture to a simmer, and simmer for 1-2 minutes.", "Add the cream and mustard, stir well, and simmer for a further minute, or until the cream has warmed through.", "Strain the mixture into a clean pan (discard the solids), sprinkle over the chives, and season, to taste, with salt and freshly ground black pepper.", "Season the scallops, to taste, with salt and freshly ground black pepper.", "Heat a frying pan over a medium to high heat. When the pan is hot, add the remaining butter.", "When the butter is foaming, add the scallops, in batches if necessary, and fry for 15-20 seconds on each side, or until just cooked through. Remove from the pan and set aside.", "Mix together the julienned carrot and courgette. Place small piles of the julienned vegetables into the washed scallop shells.", "Layer the scallops and lobster meat alternately in each of the shells, arranging the shellfish layers in a fan shape. Spoon over the strained cream sauce.", "Mix the breadcrumbs and grated Gruyère together, then sprinkle the mixture generously over each scallop shell.", "Transfer the filled scallop shells to the preheated grill and grill for 2-3 minutes, or until the breadcrumbs are golden-brown and the cheese is bubbling. Serve immediately."]}, {"isVegetarian": true, "title": "Gratin dauphinoise", "url": "www_bbc_co_uk_food_recipes_gratindauphinoise_72994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, crushed", "butter", "450g/1lb waxy potatoes, thinly sliced (such as Desirée, Golden Wonder or King Edward)", "300ml/½ pint double cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Rub a gratin dish liberally with the garlic and butter.", "Layer the potatoes into the dish, making sure each layer is seasoned.", "Pour over the cream and cook in the oven for 1¼ hours.", "Turn up the heat to 200C/400F/Gas 6 and cook for a further 15 minutes until the top is golden. Serve."]}, {"isVegetarian": false, "title": "Brussels sprouts gratin with bacon, cream and almonds", "url": "www_bbc_co_uk_food_recipes_gratinofbrusselsspro_87597", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gratinofbrusselsspro_87597_16x9.jpg", "ingredients": ["900g/2lb Brussels sprouts, trimmed", "20g/¾oz butter", "4 tsp sunflower oil", "150g/5oz bacon lardons (or rindless back bacon, cut into short fat strips)", "20g/¾oz flaked almonds", "400ml/14fl oz double cream", "2½ tsp lemon juice", "5 tbsp fresh white breadcrumbs", "4 tbsp freshly grated Parmesan ", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the sprouts into a saucepan of simmering salted water and cook for 4-5 minutes, until almost, but not quite, cooked. Drain thoroughly, allow to cool slightly, then cut in half.", "Place the butter and oil into a wide frying pan over a medium heat. Add the bacon lardons and almonds and gently fry for 3-4 minutes, until lightly browned. ", "Add the sprouts and fry for a further 2-3 minutes, stirring constantly.", "Add the cream and bring the mixture to the boil. Boil for 2-4 minutes, until the cream has reduced to a rich sauce. Season to taste with salt and freshly ground black pepper.", "Remove from the heat, add the lemon juice and spoon into an ovenproof gratin dish.", "Mix the breadcrumbs and Parmesan together in a bowl, then sprinkle evenly over the top of the sprout mixture.", "Place into the oven and bake for 20 minutes, until the top is golden-brown and the cream visibly boiling.", "Remove from the oven and serve in the gratin dish (when the dish has cooled slightly)."]}, {"isVegetarian": false, "title": "Gratin of chard and new potatoes", "url": "www_bbc_co_uk_food_recipes_gratinofchardandnewp_85609", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gratinofchardandnewp_85609_16x9.jpg", "ingredients": ["5 tbsp olive oil, plus extra for greasing", "450g/1lb ruby or Swiss chard, stems and broad ribs cut into 1cm/½in pieces, leaves finely sliced", "salt and freshly ground black pepper", "60g/2oz black olives, stones removed", "2 canned anchovy fillets, chopped", "2 sun-dried tomatoes, chopped", "½ tbsp capers, rinsed and drained ", "1 tbsp chopped fresh parsley", "400g/14oz new potatoes, scrubbed, boiled until just tender, drained and sliced", "60g/2oz gruyère cheese, grated", "30g/1oz parmesan, freshly grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Heat two tablespoons of the olive oil in a wide, lidded pan and add the chopped chard ribs. Stir, then cover and cook over a low heat for four minutes, stirring occasionally.", "Add the leaves, stir, then cover again and cook for a further five minutes, or until just tender. Season with salt and freshly ground black pepper and set aside.", "Place the olives, anchovies, sun-dried tomatoes, capers, parsley and two tablespoons of olive oil into a food processor and blend to make a smooth paste.", "Lightly oil a 30cm/12in ovenproof dish. Place a layer of the chard, along with any cooking juices, and a layer of the cooked potatoes into the dish. Spread a little of the olive paste over the chard and potatoes and season with freshly ground black pepper. Continue to layer up the chard and potato, spreading more of the olive paste between each layer and finishing with a layer of chard.", "Mix the gruyère and parmesan in a bowl and sprinkle over the top of the gratin. Drizzle over the remaining tablespoon of olive oil.", "Transfer to the oven and bake for about 25-30 minutes, until the cheese is browned and bubbling. Serve hot or warm."]}, {"isVegetarian": false, "title": "Gravad lax with deep-fried egg and avocado salad", "url": "www_bbc_co_uk_food_recipes_gravadlax_with_20643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz sea salt", "150g/5oz caster sugar", "2 vanilla pods, split lengthways, seeds scraped out", "2 x 900g/2lb thick salmon fillet, skin on, scaled, pin bones removed", "2 tbsp Dijon mustard", "2 large bunches fresh dill, chopped", "2 tbsp white wine vinegar ", "5 free-range eggs ", "110g/4oz plain flour ", "200g/7oz fresh breadcrumbs ", "vegetable oil, for deep frying ", "1 tbsp red wine vinegar", "1 tsp honey", "½ lemon, juice only", "3 tbsp olive oil", "1 avocado, peeled, stoned, finely chopped", "1 head frisee, centre leaves only, picked", "2 punnets pea shoots", "3 tbsp coriander cress", "3 tbsp chives, finely sliced", "3 tbsp chervil, roughly chopped", "110g/4oz soft goats’ cheese, torn into small pieces", "4 tbsp croutons"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the gravadlax, place the salt, sugar, vanilla seeds and pods into food processor and blend for 30 seconds. ", "Line a large, shallow, rectangular dish, with cling film. Sprinkle a third of the curing mixture over the base, then add the fish, skin-side down and cover with another third of the mixture, then top with the second piece of salmon, skin-side up. Spread the remaining curing mixture on top of the fillet and wrap in cling film. Leave to chill in the fridge for eight hours.", "Rinse off the curing salt from the fish pat and dry with kitchen paper. Spread the mustard over the flesh side of the salmon, then sprinkle the dill over the top. Roll very tightly with clingfilm again and leave to chill in the fridge for a further six hours.", "Carve thin slices from the salmon at a 45 degree angle.", "For the deep-fried egg, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil four of the eggs for five minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of iced water.", "Crack the remaining egg into a bowl - whisk and add a pinch of salt and freshly ground black pepper.", "Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the egg and roll in the breadcrumbs. Set aside on a tray in the fridge until needed.", "Heat the oil in a deep-fat fryer to 180C/350F. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm/¾in and bring to the same temperature on the hob, checking with a sugar thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the eggs until golden-brown. Remove with a slotted spoon, drain on kitchen paper and season with salt.", "For the avocado salad, whisk the vinegar, honey, lemon juice and olive oil together in a bowl until well combined.", "Mix the remaining ingredients in a bowl and drizzle over the dressing. Lightly toss to coat the salad ingredients with the dressing.", "Lay slices of gravadlax onto a plate. Add a serving of salad alongside and place a deep-fried egg on top."]}, {"isVegetarian": false, "title": "Gravad lax", "url": "www_bbc_co_uk_food_recipes_gravadlaxandgravadse_8838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole salmon, preferably wild or organic, (or sea trout, or large trout) about  2-4kg/4½-9lb", "2-3 large bunches fresh dill", "125g/4oz rough sea salt crystals", "250g/8oz caster sugar", "30g/1oz  freshly ground black pepper  ", "1 tbsp chopped fresh dill ", "1 tbsp English mustard", "1 tsp caster sugar", "1 tbsp sunflower oil", "2 tbsp crème fraîche", "1 tbsp wine vinegar"], "serves": "Makes 1 whole fish", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Gut and wipe clean the salmon then take two large fillets from each side, as close to the backbone as possible (use the carcass for stock or soup).", "Roughly chop the dill and mix thoroughly in a bowl with the salt, sugar and pepper. Lay out a sheet of foil or cling film about four times the width of a salmon fillet. Spread a quarter of the pickling mix over a fillet-size area on one side of the foil with a good 15cm/6in margin for folding over.", "Place one fillet, skin side down, on top of the pickle mixture and cover with slightly more than half of what is left. Place the second fillet on top, skin side up, to make a sandwich. Scatter the remaining pickle mixture over the skin. ", "Wrap up the parcel tightly, tucking the ends and edges in underneath the fish.", "Put the package on the tray and place a similar size tray, or a plank of wood on the top. Weight it down, with a brick or two or anything else handy (the contents of the fridge?).Turn the  package daily for at least five days, and no more than eight. Do not discard the pickling liquid that oozes from the package unless it threatens to spill over the side of the tray.", "At least one hour before you wish to serve the fish, combine all the ingredients for the dressing in a jar and shake well together. Leave to stand and shake again to emulsify before serving.", "To serve, unwrap the gravadlax and wipe off any excess pickling liquid. There is no need to scrape off the dill pieces though, as some recipes suggest. Slice fairly (but not too) thinly then serve with the sauce and buttered brown bread. (Unused gravadlax can be re-wrapped in clean cling film or foil and kept in the fridge for up to five days.)"]}, {"isVegetarian": false, "title": "Gravad lax with sweet mustard and dill sauce", "url": "www_bbc_co_uk_food_recipes_gravadlaxwithsweetmu_74504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz coarse rock salt", "75g/3oz caster sugar", "1 tbsp white peppercorns, crushed", "2 large bunches of fresh dill, finely chopped", "2  900g/2lb thick salmon fillets, skin on, scaled and pin bones removed", "rye bread, to serve", "2 tbsp Dijon mustard", "1 tbsp caster sugar", "1 tbsp white wine vinegar", "1 egg yolk ", "150ml/¼ pint groundnut or vegetable oil", "1 tbsp chopped fresh dill", "salt and freshly ground black pepper"], "serves": "Serves 10-20", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["To make the curing mixture for the salmon, place the salt, sugar and crushed white peppercorns in a bowl.", "Add half the dill and stir to combine.", "Use cling film to line a large, shallow, rectangular dish which fits the salmon comfortably.", "Sprinkle a quarter of the curing mixture over the base of the dish and lay one of the salmon fillets on top, skin side down. ", "Sprinkle half of the curing mixture on top and cover with the other salmon fillet, skin side up.", "Sprinkle the remaining curing mixture on top and wrap the salmon in cling film.", "Weigh the salmon down with some weights or cans to help squeeze out any excess liquid or moisture. Place in the fridge for 2-3 days, turning the salmon over every 6 hours or so, replacing the weights after turning.", "After 2-3 days, unwrap the salmon. Rinse the curing mixture off the gravadlax using cold water and pat fish dry with kitchen paper.", "Lay a large piece of cling film on the work surface and place one of the fillets on top, skin side down. Cover with the remaining fresh dill and place the other salmon fillet on top, skin side up. Wrap tightly in cling film and chill for six hours.", "Meanwhile, to make the sauce, place the mustard, sugar, vinegar and egg yolk in a large bowl and whisk to combine.", "Add the oil drop by drop to begin with, then in a steady stream, whisking constantly, until the sauce becomes thick and  smooth.", "Stir in the dill and season to taste. ", "To serve, cut the gravadlax into thin slices using a sharp knife, leaving the skin behind. Gravadlax is traditionally served sliced thicker than smoked salmon. ", "Place three or flour slices on each serving plate and add a spoonful of the sauce to the side.", "Serve at once with rye bread."]}, {"isVegetarian": false, "title": "Gravlax with dill and mustard mayonnaise and lettuce", "url": "www_bbc_co_uk_food_recipes_gravlax_with_dill_and_34974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz yellow mustard seeds", "40g/1½oz brown mustard seeds", "50ml/2fl oz white wine vinegar", "25g/1oz honey", "110ml/3¾fl oz light ale", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10½fl oz vegetable oil ", "6 tbsp chopped fresh dill", "250g/9oz caster sugar", "250g/9oz fine salt", "50g/1¾oz fresh dill, chopped ", "½ side of salmon (about 500g/1lb 2oz), filleted, skin removed, pin boned", "4 heads Little Gem lettuce, leaves separated", "1 free-range egg yolk", "1 tsp English mustard", "2 tsp clear honey", "2 tbsp cider vinegar", "150ml/5fl oz vegetable or sunflower oil", "1 banana shallot, finely chopped", "1 garlic clove, finely chopped", "1 tbsp finely chopped flatleaf parsley", "1 tbsp finely chopped mint", "1 tbsp finely chopped basil", "1 tbsp finely chopped thyme", "wholemeal bread ", "butter"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the dill and mustard mayonnaise, put the mustard seeds in a bowl. Heat the vinegar and honey in a non-reactive saucepan until the honey has dissolved. Pour the vinegar and honey mixture over the mustard seeds and mix thoroughly. Add the ale and stir until well combined. ", "Cover the bowl with cling film and set aside for at least four hours, preferably overnight.", "Once cooled, blend the mustard base mixture in a food processor until smooth (this will take a few minutes as all of the mustard seeds need to break down). Spoon the mixture into a bowl and set aside. ", "To make a mayonnaise, blend the egg yolks, white wine vinegar and Dijon mustard together in a food processor. With the motor running, slowly add the oil in a thin stream until the mixture comes together as a thick and creamy mayonnaise. (You may not need to use all of the oil.) ", "Mix the mayonnaise, mustard base and dill together in a bowl until well combined. Cover with cling film and chill in the fridge until needed.", "For the gravlax, mix the sugar, salt and dill together in a bowl. ", "Sprinkle half of this marinade mixture into the bottom of a shallow roasting tray, then place the salmon on top and sprinkle over the remaining marinade mixture.", "Cover the tray with cling film and place the salmon in the fridge to marinade for one hour. Rinse the marinade off under cold running water and pat dry with kitchen paper. ", "For the Little Gem lettuce, place the lettuce in a large bowl. Place the rest of the ingredients in a blender and blend until smooth and emulsified.", "Just before serving, toss the lettuce in the dressing.", "To serve, cut the salmon in thin slices on an angle and place on a serving platter. Serve with the salad, dill and mustard mayonnaise and buttered wholemeal sliced bread."]}, {"isVegetarian": false, "title": "Gravlax with hay smoked scallops, sour cucumber and mustard leaves", "url": "www_bbc_co_uk_food_recipes_gravlax_with_hay_smoked_66813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz high-quality salmon fillet, mid piece, skin on", "75g/2½oz fine sea salt", "50g/1¾oz caster sugar", "2 tsp coarsely ground white peppercorns", "5 sprigs dill, roughly chopped", "100g/3½oz caster sugar", "50ml/2fl oz Swedish vinegar essence (Ättiksprit 12%), alternatively use white wine vinegar", "1 bay leaf", "2 tsp yellow mustard seeds", "2 tsp brown mustard seeds", "1 cucumber, peeled", "4 scallops, roe reserved", "1 tbsp clarified butter, preferably smoked", "fine sea salt", "1 handful hay", "1 small shallot, finely chopped", "100ml/3½fl oz double cream", "4 scallop roes (from above)", "sea salt, for seasoning", "pinch leek ash (from leek cooked over an open flame)", "½ lemon, juice only", "1 small red apple", "½ handful mustard leaves"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the gravlax, put the salmon in a sealable plastic food bag. Mix all the the remaining ingredients and pour them into the bag. Shake the bag lightly, let the air out and seal the bag.", "Put the bag in the fridge and leave for 12 hours. Flip the bag and leave for another 12 hours.", "Remove the salmon from the bag and scrape off any excess salt/sugar. Slice thinly across the fibers.", "For the cucumber, add all the ingredients except for the cucumber to a saucepan with 150ml/5fl oz water and bring to a boil. Remove from the heat and cool for two minutes. Pour into a sealable glass jar.", "Slice the cucumber lengthwise into quarters. Remove the seeds and cut into 10cm/4in pieces. Put the cucumber pieces in the brine in the jar, the liquid should cover the cucumber. Store in the fridge for at least 12 hours before serving.", "For the scallops, open the scallops using a thin sharp knife. Clean them and reserve the white meat, shell and the roe (for the dressing). ", "Heat a small cast iron skillet or a heavy-based frying pan until hot. Melt the butter and sear the scallops on both sides until golden-brown. Remove from the pan and season with salt. Reserve the butter in the pan for the roe dressing.", "Put the scallops back in their shells and place in the drum of a barbecue. Cover the scallops with the hay. Set fire to the hay and let it burn until the scallops are covered in ashes. Scrape off the excess ashes. ", "For the roe dressing, heat two teaspoons of the butter reserved from the scallops in a small cast iron or heavy based saucepan and gently fry the shallot for one minute. Add the cream. Roughly chop the roes and add to the cream. Using a handheld blender mix until smooth. Season with salt, a pinch of leek ash and some lemon juice.", "To serve, put two slices of salmon irregularly on each plate. Slice each scallop in half so that you get two round pieces and place them next to the salmon. Drizzle a few drops of the roe dressing over the salmon. ", "Cut very thin slices of the sour cucumber lengthwise using a mandolin. Do the same with the apple. Place a few of these cucumber and apple slices around each plate and finish with a few mustard leaves."]}, {"isVegetarian": false, "title": "Turkey gravy", "url": "www_bbc_co_uk_food_recipes_gravy_2812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gravy_2812_16x9.jpg", "ingredients": ["turkey giblets", "1 bay leaf", "1 sprig of thyme", "4 black peppercorns", "½ onion, sliced", "2 pints water", "pan juices from the roast turkey", "25g/1oz plain flour ", "salt and pepper"], "serves": "Makes 2 pints", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the giblets in a saucepan and cover with the water. Add the bay leaf, thyme, peppercorns and onion.", "Bring to the boil and skim off any scum. Reduce the heat and then simmer for 45 minutes.", "Strain the stock and measure 750 ml / 1 1/4 pints.", "Strain off the fat from the roasting tin leaving only the turkey juices. Add the flour and blend with the juices over a gentle heat until it turns golden brown and it has a smooth texture. ", "Remove from the pan and pour in the hot stock. Scrape the base of the pan with a spatula to mix in all the meaty sediment.", "Return to the heat and boil for 3-4 minutes stirring all the time to remove any lumps and until the gravy thickens. Season to taste and serve."]}, {"isVegetarian": false, "title": "Great sausage casserole", "url": "www_bbc_co_uk_food_recipes_great_sausage_casserole_73010", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/great_sausage_casserole_73010_16x9.jpg", "ingredients": ["1–2 tbsp sunflower oil", "12 good quality pork sausages", "6 rashers rindless streaky bacon, cut into 2.5cm/1in lengths", "2 medium onions, thinly sliced", "2 garlic cloves, crushed", "½–1 tsp hot chilli powder or smoked paprika", "1 x 400g/14oz can chopped tomatoes", "300ml/10fl oz chicken stock", "2 tbsp tomato purée", "1 tbsp Worcestershire sauce", "1 tbsp dark brown muscovado sugar", "1 tsp dried mixed herbs", "2 bay leaves", "3–4 sprigs of fresh thyme", "100ml/3½fl oz red or white wine (optional)", "1 x 400g/14oz can butter beans or mixed beans", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat a tablespoon of the oil in a large non-stick frying pan and fry the   sausages gently for 10 minutes, turning every now and then until nicely browned all over. Transfer to a large saucepan or a flameproof casserole dish and set aside. ", "Fry the bacon pieces in the frying pan until they begin to brown and crisp then add to the sausages. ", "Place the onions in the frying pan and fry over a medium heat for five minutes until they start to soften, stirring often. You should have enough fat in the pan, but if not, add a little more oil. ", "Add the garlic and cook for 2–3 minutes more until the onions turn pale golden-brown, stirring frequently. ", "Sprinkle over the chilli powder or smoked paprika and cook together for a few seconds longer. ", "Stir in the tomatoes, chicken stock, tomato purée, Worcestershire sauce, brown sugar and herbs. ", "Pour over the wine, or some water if you’re not using wine, and bring to a simmer. ", "Tip carefully into the pan with the sausages and bacon and return to a simmer, then reduce the heat, cover the pan loosely with a lid and leave to simmer very gently for 20 minutes, stirring from time to time. ", "Drain the beans and rinse them in a sieve under cold running water. Stir the beans into the casserole, and continue to cook for 10 minutes, stirring occasionally, until the sauce is thick. ", "Season to taste with salt and freshly ground black pepper and serve with rice or slices of rustic bread."]}, {"isVegetarian": false, "title": "Greek-style mutton", "url": "www_bbc_co_uk_food_recipes_greek-style_mutton_24087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz natural yoghurt", "40g/1½oz caster sugar", "1 lemon, sliced", "200g/7oz salt ", "1 tsp red chilli", "2 garlic cloves, roughly chopped", "1 tsp cumin", "1 tsp ground coriander", "1 kg/2lb 4oz mutton shoulder (boned weight)", "olive oil, for frying", "350ml/12fl oz white chicken stock ", "350ml/12fl oz brown chicken stock ", "100g/3½oz minced pork belly", "100g/3½oz minced mutton shoulder", "2 shallots, chopped", "1 tsp chopped red chilli", "2 garlic cloves, finely chopped", "1 tsp ground cumin", "1 tsp ground coriander\t", "1 tbsp tomato purée", "200g/7oz chopped fresh tomatoes", "100ml/3½fl oz brown chicken stock", "½ large cucumber, peeled", "sea salt", "2 Little Gem lettuces, cut in half", "1 bunch spring onions, trimmed", "2 tbsp olive oil", "200g/7oz aged feta cheese, diced", "fresh mint, to taste", "honey, to taste"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the yoghurt, spoon the yoghurt into a cheesecloth or muslin cloth placed over a bowl and leave to hang overnight. ", "Discard the liquid and scoop the yoghurt curd into a bowl. Chill until ready to use.", "Place the sugar and 200ml/7fl oz water in a saucepan and heat until the sugar is dissolved. Add the sliced lemon and cook for 15–20 minutes. Set aside to sit overnight in the syrup.", "For the braised mutton, mix the salt, chilli, garlic, cumin and coriander together and spread it over the mutton. Set aside to marinate in the fridge for 12 hours.", "Wash off the salt mixture. Heat a little oil in a casserole and brown the meat all over. Add both stocks and simmer for around 4 hours or until the meat is tender. Remove the meat from the pan, reserving the liquid, and place on a baking tray lined with baking parchment. Place another sheet of baking parchment on top, followed by another tray and place some weights on top (4 tins of beans will do). Place in the fridge to cool and set.", "Strain all the liquid from the pan through a sieve into a clean pan. Heat and reduce in volume to thicken to a sauce consistency. Set aside until needed.", "For the mutton ragù, fry both meats in a little oil over high heat. When browned, deglaze the pan with a little water and add the shallots, chilli and garlic. Stir in the cumin and coriander and cook for 30 seconds, then add the tomato purée, chopped tomatoes and brown chicken stock. Simmer for an hour, or until the liquid is thick and glossy. Set aside until needed.", "To serve, cut the cucumber into two pieces, about 6cm/2½in long. Take one piece, halve it, halve again and once more so that you are left with eighths. Repeat with the other piece. Slice off the seeded core and discard. Sprinkle with sea salt and set aside.", "Char the lettuces on the cut-side down in a hot pan until caramelised. Place them in the reserved mutton sauce and gently warm through.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "When you are ready to serve, slice the mutton shoulder into portions. Brown in a hot frying pan and place in the oven for 6 minutes.", "Heat a flat griddle pan. Brush the spring onions with a little oil and griddle for 1–2 minutes until charred and wilted.", "In a bowl, mix the feta, mint and honey together.", "Place slices of mutton shoulder on serving plates and add a spoonful of ragù, the cucumber and charred lettuce. Dot the feta and strained yoghurt around the plates, and add the confit lemon slices and charred spring onions. Spoon over the sauce."]}, {"isVegetarian": false, "title": "Greek lamb stew", "url": "www_bbc_co_uk_food_recipes_greeklambstew_84507", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz lamb chop meat off the bone, cut into cubes", "1 garlic clove, finely chopped", "½ green pepper, chopped", "1 tomato, chopped", "8-10 black olives ", "2 tbsp red wine", "200ml/7fl oz beef stock", "1 sprig fresh rosemary"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large saucepan. Add the lamb meat and fry for 3-4 minutes, stirring occasionally, until golden brown all over, then remove with a slotted spoon and set aside.", "Add the garlic to the pan and cook for one minute, then add the pepper, tomato, olives and red wine. Bring to the boil and cook for 1-2 minutes.", "Add lamb pieces, beef stock and rosemary, then reduce the heat and simmer for ten minutes, or until the lamb is cooked and tender.", "Pour into a bowl and serve."]}, {"isVegetarian": true, "title": "Greek salad", "url": "www_bbc_co_uk_food_recipes_greek_salad_16407", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greek_salad_16407_16x9.jpg", "ingredients": ["½ small red onion, thinly sliced ", "2 large ripe tomatoes, roughly chopped", "½ cucumber, deseeded and roughly chopped", "100g/3½oz reduced fat feta cheese, drained and cut into cubes", "50g/1¾oz black olives, pitted and drained (in brine not oil and preferably Kalamata olives)", "small handful fresh mint leaves", "½ tsp dried oregano", "2 tsp extra virgin olive oil", "2 tsp fresh lemon juice", "sea salt and freshly ground black pepper", "2 wholemeal pitta breads, warmed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onion, tomatoes and cucumber in a bowl and season to taste.", "Scatter the feta, olives and mint leaves on top. Sprinkle over the oregano and toss lightly. Drizzle over the oil and lemon juice and serve with warmed pitta bread."]}, {"isVegetarian": false, "title": "Greek pulled duck burger with spiced duck popcorn, apple and peach slaw, pickles and watercress", "url": "www_bbc_co_uk_food_recipes_greek_pulled_duck_burger_28630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["160g/5½oz salt", "60g/2¼oz brown sugar", "2 oranges, juice and zest", "pinch chilli flakes", "2 tsp fennel seeds", "1 large cinnamon stick", "1 head of garlic, halved width ways", "4 tbsp sherry vinegar", "1 whole duck, back bone removed, spatchcocked", "2 small Spanish onions, thinly sliced", "4 garlic cloves, left whole", "1 large cinnamon stick", "2 bay leaves", "1 orange zest and juice ", "1 tbsp ground coriander", "2 tbsp fennel seeds", "1 tbsp cumin seeds", "pinch chilli flakes", "40g/1½oz shredded white cabbage", "1 Granny Smith apples, cut into thin strips (on a mandolin)", "2 peaches, cut into thin strips", "3 tbsp apple vinegar", "1½ tbsp ouzo", "handful fresh coriander leaves", "lemon juice, to taste", "2 tbsp olive oil", "50g/1¾oz popping corn", "1 tsp ground fennel seeds", "pinch chilli flakes", "1 bunch watercress, leaves picked", "1 dill pickle, thinly sliced", "sheep’s milk cheese, such as a truffled pecorino, sliced", "6 burger buns"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the brine, stir the salt, sugar, vinegar and 1 litre/1¾ pints water in a saucepan over medium heat to dissolve the sugar and salt. Remove 6 strips of zest from the oranges using a vegetable peeler, add to the pan with the orange juice, garlic and spices, and bring to a simmer. Turn off the heat and transfer to a container large enough to fit the duck.  Add 2 litres of cold water and allow the brine to cool before adding the duck, pushing it down to submerge it. Refrigerate for at least 8 hours, or overnight.", "When you are ready to cook, remove the duck from the brine and pat dry, leave in a cool place for one hour to dry out.  Preheat the oven to 180C/160C Fan/Gas 4.", "Place the onions in a roasting tray adding the garlic cloves, cinnamon stick, bay leaves and orange juice and zest.  Mix together the coriander, cumin, fennel seeds and chilli and sprinkle a little on the underside of the duck. Lay the duck on top of the onions and sprinkle the remaining spice evenly over the duck.  Add 1.5 litres/2½ pints of water to the tray and cover securely with foil.  Roast for 4-4½ hours, then check for tenderness. The flesh should be easily pierced with the point of a knife.", "Remove foil, baste and return to the oven for a further 30 minutes to crisp the skin. Transfer the duck to a tray and leave to cool. ", "Carefully skim off the surface fat and set it aside.  (If making ahead of time pour off the duck cooking liquor into a container, leave to cool and refrigerate overnight. The following day, skim off the solidified fat and set aside.)", "Remove the cinnamon sticks and orange strips and place the cooking liquor and onions in a small pan and bring to the boil, lower heat to a simmer and reduce in volume until the sauce has thickened.  Meanwhile carefully pick the crispy skin and meat from the duck into a large bowl. ", "Add the reduced duck sauce to the skin and meat and mix well. Season to taste, although it usually doesn’t need any seasoning since it’s been brined. Divide the mixture into six patties and place on one half of a tray lined with parchment paper. Fold the paper over the patties, folding edges over to secure. Place in the oven and gently reheat for 10-12 minutes while you griddle the bread before serving, drizzled with some olive oil.", "For the slaw, mix the ingredients together, season with sea salt, freshly ground black pepper add lemon juice to taste. Cover and refrigerate until serving.", "For the popcorn, heat the oil in a large saucepan with a tight-fitting lid. Add the corn and cover immediately. Cook over a medium heat, moving the pan continuously until the popping has just about stopped, about 2-3 minutes. Remove the pan from the heat and leave covered for a minute until the popping stops completely. Carefully remove the lid, add the reserved duck fat, fennel seeds and chilli and mix well. The popcorn can be made ahead of time and stored in an airtight container. ", "To serve, carefully lift the duck patties off the paper and serve sandwiched between bread topped with slaw, watercress and pickles. Serve with a bowl of the popcorn."]}, {"isVegetarian": false, "title": "Greek lamb with potatoes", "url": "www_bbc_co_uk_food_recipes_greeklambwithpotatoe_65572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb steaks or 8 chump chops, about 750g/1lb 10oz total weight ", "2 tsp dried oregano ", "1 kg/2lb 4oz floury potatoes, such as king edwards, sliced ", "2 onions, sliced ", "4 fat cloves garlic ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Wipe the steaks or chops and sprinkle with salt, freshly ground black pepper and half the oregano. ", "Tip the potatoes and onions into a roasting tin and drizzle over 3 tbsp of olive oil, the rest of the oregano, salt and pepper. Mix everything until the potatoes and onions are well coated with oil. Tuck the unpeeled garlic cloves among the potatoes. ", "Roast the potatoes for 20 minutes until they are just starting to soften, then put the chops on top, pour in 300ml/½ pint lamb or chicken stock or water and return to the oven for 30-35 minutes, until the lamb is tender and the potatoes tinged brown. When servinng make sure everyone gets a garlic clove to squeeze out and mix with the other ingredients."]}, {"isVegetarian": true, "title": "Greek salad", "url": "www_bbc_co_uk_food_recipes_greeksalad_13055", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greeksalad_13055_16x9.jpg", "ingredients": ["50g/2oz black Kalamata olives ", "3 medium tomatoes, diced into 2cm/¾in cubes", "1 cucumber peeled, diced into 2cm/¾in cubes ", "1 red pepper, de-seeded, diced ", "½ red onion, sliced finely ", "100ml/3fl oz extra virgin olive oil ", "150g/5oz feta, diced ", "1 small, firm cos lettuce, chopped into rough cubes lengthways  ", "1 generous sprig of oregano (or 2 tsp dried oregano) ", "50ml/3 tbsp red wine vinegar"], "serves": "Serves  4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients in a bowl."]}]