[{"isVegetarian": false, "title": "Crab lasagne", "url": "www_bbc_co_uk_food_recipes_crab_lasagne_12498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for drizzling", "rapeseed oil, for frying", "150g/5½oz baby spinach ", "200g/7oz white crab meat ", "4 plum tomatoes, skin removed, thinly sliced", "sea salt and freshly ground black pepper", "pinch saffron strands", "500g/1lb 2oz ‘00’ flour, plus extra for dusting", "3 free-range eggs, lightly beaten", "5 free-range egg yolks (100g/3½oz), lightly beaten", "2 tbsp olive oil", "1 shallot, thinly sliced", "1 tbsp olive oil", "1 strip unwaxed lemon peel", "2 tbsp dry vermouth", "120ml/4fl oz whipping cream", "50g/1¾oz Gruyère, grated"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pasta, soak the saffron in 1 tablespoon of boiling water for 5 minutes.", "Place all the pasta ingredients, including the saffron in its water, in a food processor and pulse until the dough comes together. Turn it out onto a lightly floured work surface and knead well, until smooth. Divide the dough into four pieces, wrap each piece in cling film and refrigerate for 2 hours.", "Cut each piece of dough in half. Flatten one piece on a lightly floured surface. Roll it through a pasta machine, gradually making your way to two notches from the thinnest setting. Lay the pasta on a work surface and cut out a 7.5cm/3in disc. Repeat this step with the remaining dough, you should have eight discs. Allow the pasta to dry out on the surface while you make the sauce.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "To make the sauce, fry the shallot in the oil over a medium heat until softened. Add the lemon peel and vermouth and bring to the boil. Simmer until reduced by half. Add the cream and Gruyère, bring back to the boil and simmer until thickened. Pass through a sieve into a clean saucepan and set aside. ", "Drop the pasta discs into a pan of simmering salted water. Cook for about 3 minutes, then lift out with a slotted spoon. Season and drizzle over a splash of olive oil. ", "Heat a frying pan over a medium heat, add a splash of rapeseed oil and cook the spinach until just wilted. Season with salt and pepper. ", "Lightly oil a large baking tray and lay on four pasta discs. Divide the spinach between the discs and top with the crab meat and two slices of tomato. Finish with another pasta disc and spoon over the Gruyère sauce. Bake for 10–15 minutes, or until bubbling and lightly browned. Serve immediately on warmed plates."]}, {"isVegetarian": false, "title": "Crab fritters with crispy langoustine tails and a chilli, cashew and ginger sauce", "url": "www_bbc_co_uk_food_recipes_crab_fritters_with_08803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2–3 tbsp  sunflower oil ", "1 star anise", "3 tbsp roughly chopped cashew nuts", "2 thin green chillies, finely chopped", "5cm/2in piece fresh root ginger, peeled and finely chopped ", "2 spring onions, finely chopped", "500ml/18fl oz hot light chicken stock", "2–3 tbsp light soy sauce", "2 heaped tbsp cornflour blended with 50ml/2fl oz water ", "2 tbsp finely chopped coriander ", "salt and ground white pepper ", "sunflower oil, for deep frying", "250–300g/9–10½oz crabmeat ", "1 free-range egg", "200g/7oz cornflour ", "1–2 thin green chillies, finely chopped ", "1 spring onion, finely chopped ", "5cm/2in piece fresh root ginger, peeled and finely chopped ", "1–2 tbsp fresh coriander, finely chopped  ", "2 tbsp light soy sauce ", "½ tsp crushed black pepper ", "6–8 langoustine tails, peeled and deveined", "3 tbsp cornflour "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sauce, heat the oil in a wok over a high heat. Add the star anise then the cashew nuts, stirring all the time so they don’t burn. As soon as the cashews are golden-brown add the chilli, ginger and spring onions and stir-fry until the onions are soft. Add the stock and bring to the boil. Add the soy sauce and season to taste. ", "Stir in the cornflour mixture and keep stirring until the sauce thickens and there are no lumps. (You may need to add more cornflour, if the sauce doesn’t thicken.) Stir in the coriander and pour into a serving bowl. ", "Heat the oil in a wok or deep-fat fryer to 150C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "To make the fritters, put the crabmeat in a bowl and mash it up as best you can, mixing it well. If using only white meat you will need to break it down completely.  ", "Mix all the remaining ingredients together well until you have a thick batter. Drop a teaspoon of the mixture in the oil and fry until golden brown on all sides. Drain on kitchen paper and then taste to check the seasoning, add more salt and pepper to the batter as required. Fry spoonfuls of the remaining batter, in batches, being careful not to overcrowd the pan.", "Increase the temperature of the oil to 200C. ", "Season the langoustine tails and roll them in cornflour. Drop them into the oil and fry until pink and cooked through. Drain on kitchen paper. ", "To serve, divide the fritters between serving plates and pour over the sauce. Top with the langoustines and serve with fried rice. "]}, {"isVegetarian": false, "title": "Crab linguine", "url": "www_bbc_co_uk_food_recipes_crab_linguine_22025", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_linguine_22025_16x9.jpg", "ingredients": ["1 x 900g/2lb cooked brown crab, 350g/12oz fresh crabmeat", "315g/11oz linguine ", "25g/1oz sea salt", "55ml/2fl oz olive oil ", "1 garlic clove, finely chopped ", "4 spring onions, finely chopped ", "½ tsp finely chopped red chilli ", "275g/10oz picked fresh white crabmeat ", "25ml/1fl oz dry white wine ", "1 tbsp chopped fresh flat leaf parsley ", "1 tbsp chopped fresh basil", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the brown crab, first remove the legs by twisting them off where they meet the body. Remove the claws by pulling them off from the body. Separate the crab body from the central part of the crab by placing the crab on its back (hard shell-side down). Put your hands under the edge of the crab and push upwards until you hear it break. You may need to use a heavy knife to help you lever the crab apart.", "Remove all ten of the spongy 'dead men's fingers' and discard. Drain any excess water from the shell of the crab and remove the stomach sac and hard membranes inside the shell.Use a spoon to remove the brown meat from the shell and place into a bowl (it can be used in another recipe).  ", "Crack the two large front claws and pick out the white meat. Place all of the white meat on a metal tray and check thoroughly for any pieces of shell. Cover and chill in the fridge until needed. ", "For the pasta, bring a large pan of salted water to the boil, add the sea salt and cook the linguine for 7–8 minutes, or according to packet instructions, until al dente. ", "Meanwhile, for the sauce, heat the olive oil in a large, deep frying pan and add the garlic, spring onions and chilli. Gently fry for about 1-2 minutes, or until softened but not coloured. Stir in the crabmeat and cook for another minute, or until heated through. ", "Add the wine to the pan and cook until most of the alcohol has evaporated. ", "Drain the linguine, reserving a few tablespoons of the pasta water. Add to the pan with the crabmeat and stir in the parsley and basil. Mix together to coat evenly, adding a splash of reserved pasta water if the mixture is too dry. Season to taste with salt and freshly ground black pepper and serve. "]}, {"isVegetarian": false, "title": "Crab rarebit on grilled sourdough with a green salad and French dressing", "url": "www_bbc_co_uk_food_recipes_crab_rarebit_on_grilled_01579", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large slices sourdough bread", "2 tbsp olive oil", "350g/12oz Lincolnshire Poacher cheese, grated (alternatively use a good cheddar)", "50ml/2fl oz beer", "1 tsp English mustard ", "3-4 dashes Tabasco", "1 tsp Worcestershire sauce", "150g/5½oz white crab meat", "50g/1¾oz brown crab meat", "2 tbsp plain flour", "1 free-range egg yolk", "1 tbsp finely chopped chives", "1 head Little Gem lettuce, leaves separated and washed", "50g/1¾oz bull's blood salad leaves", "1 free-range egg yolk", "1 tsp white wine vinegar", "½ tsp Dijon mustard", "100ml/3½fl oz vegetable oil", "1 shallot, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Heat a griddle pan. Drizzle the sliced sourdough with olive oil and place on the hot griddle. Cook on each side for 2-3 minutes, or until the bar marks appear.", "Place the cheese and beer in a frying pan and heat gently until the cheese is melted, and the sauce is bubbling and smooth. Stir in the mustard, Tabasco and Worcestershire sauce. Add the white and brown crab meats, flour and egg yolk. Cook until just thickened then season, to taste, with salt and black pepper. Finish with the chopped chives. Spread the mixture on the griddled sourdough and place under a hot grill for 1-2 minutes or until golden-brown and bubbling.", "For the green salad and French dressing, put the salad leaves in a large bowl. In a small bowl or jug whisk the egg yolk, vinegar and mustard together. Gradually add the oil in a thin steady stream whisking all the time until all the oil is incorporated. Add the chopped shallots. Just before serving pour the dressing over the leaves and mix.", "To serve, place the crab rarebit on a serving board with the green salad alongside."]}, {"isVegetarian": false, "title": "Crab rarebit, spiced crab butter, hazelnut and beurre noisette salad", "url": "www_bbc_co_uk_food_recipes_crab_rarebit_spiced_crab_67113", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp whole milk", "55g/2oz unsalted butter, softened", "175g/6oz Lancashire cheese, grated", "2 free-range egg yolks", "100g/3½oz fresh white crab meat", "2 tbsp chopped flat leaf parsley", "1 tsp vegetable oil", "4 slices sourdough bread", "75g/2½oz fresh brown crab meat ", "pinch paprika", "squeeze lemon juice", "salt and freshly ground black pepper", "150g/5½oz unsalted butter", "25g/1oz blanched hazelnuts, roughly chopped", "squeeze lemon juice", "1 tsp Dijon mustard", "2 tsp Chardonnay vinegar", "50g/1¾oz wild rocket"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a saucepan, warm the milk and 30g/1oz butter together until the butter has melted. Add the cheese and mix until melted; do not boil. Add the egg yolks and mix well. Add the white crab meat and parsley and season. Keep warm.", "Meanwhile, heat the oil in a griddle pan. Cook the sourdough until golden and crispy. Drain on kitchen paper. Heat the grill to medium.", "Preheat the grill to hot. Mix the brown crab meat with the remaining 25g/1oz butter, the paprika and lemon juice, then season. Spread the mixture onto the toast, then pour over the cheese mixture. Grill until everything has melted and coloured, but be careful not to burn.", "To make the salad, in a heavy-bottomed saucepan, melt the butter. Once it starts to foam, watch until it cooks to a nice golden colour. Add the hazelnuts, then remove from the heat. Add the lemon juice and season. Allow to cool to body temperature, but not cold.", "Mix the mustard and vinegar together in a bowl, then slowly add the melted butter and hazelnuts to make a vinaigrette. Dress the rocket in the vinaigrette and serve immediately along side the rarebit. ."]}, {"isVegetarian": false, "title": "Crab ravioli with spring onion dressing", "url": "www_bbc_co_uk_food_recipes_crab_ravioli_with_spring_67164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz 00 pasta flour ", "3 free-range eggs ", "2 free-range egg yolks", "pinch salt ", "60g/2¼oz Granny Smith apple, diced", "60g/2¼oz cucumber, diced ", "300g/11oz white crabmeat", "1 lemon, zest only", "20g/¾oz chives, finely chopped", "6 spring onions, washed and left whole with just the root trimmed off", "1 tbsp olive oil", "sea salt", "400ml/14fl oz cloudy apple juice", "100ml/3½fl oz rapeseed oil ", "1 tsp nigella seeds, toasted", "lemon juice, to taste"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pasta dough, bring all the ingredients together in a food processor and rest for one hour.", "To make the filling, sprinkle the apple and cucumber with salt and set aside for half an hour, then squeeze out the excess liquid.", "In a large mixing bowl mix the crab, lemon zest, chives, apple and cucumber. Season to taste and set aside in the fridge. ", "For the dressing, heat the apple juice in a pan to reduce it in volume down to a light syrup. Whisk in the rapeseed oil and the toasted nigella seeds and lemon juice.", "Roll the pasta through the pasta machine until it is smooth and perfectly thin.", "Cut the sheet of pasta into 40 x 15cm/6in squares. This should give you enough space to fill and cut the ravioli out.", "With a tablespoon make a small pile of the crab filling in the middle of 20 of the squares.", "Brush around the filling with water and put another pasta square on top to form a lid. Working from one side of the square seal each parcel all around ensuring that all the air has been removed (otherwise they will burst when cooked). Use a8½cm/3½in wide round pastry cutter to measure out each ravioli, and cut around the pastry cutter with a knife. Check the edges are sealed again. You should be able to make 20 ravioli. Place them on a sheet of floured cling film laid on a baking tray. Set them aside in the fridge until ready to cook.", "Heat a dry frying pan and brush the spring onions in a little oil and season with salt. Add to the pan to colour and steam for a few minutes until slightly charred.", "To cook the ravioli, heat a pan of salted water to boiling. Add the ravioli and boil for a couple of minutes until cooked to your liking and heated through. Once cooked, remove from the water, drizzle with olive oil and season with sea salt.", "To serve, put the ravioli in the bottom of a pasta bowl and lay the charred spring onions over and dress with the apple and nigella seed dressing."]}, {"isVegetarian": false, "title": "Crab, mango, lime and chilli salad", "url": "www_bbc_co_uk_food_recipes_crab_lime_and_chilli_90734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red chillies, seeds removed, finely chopped", "2 garlic cloves, finely chopped", "2cm/½in fresh root ginger, peeled and finely chopped", "2 tbsp finely chopped mint", "2 tbsp finely chopped coriander", "1–2 tbsp fish sauce", "2 limes, juice only", "pinch brown sugar", "500g/1lb 2oz cooked white crab meat", "250g/9oz cooked brown crab meat", "1 lime, zest only", "1 tbsp finely chopped mint", "1 tbsp finely chopped coriander", "½ Chinese cabbage, thinly sliced", "handful celery leaves", "2 ripe mangoes, stones removed, thinly sliced", "4 kaffir lime leaves, finely chopped, to serve", "100g/3½oz toasted sesame seeds, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, mix together the chillies, garlic, ginger, mint, coriander, fish sauce, lime juice and brown sugar. Set aside.", "For the salad, mix together the crab meat, lime zest, mint, coriander and half the dressing in a bowl.", "In a separate bowl, toss the cabbage, celery leaves and mangoes with the remaining dressing.", "To serve, top the cabbage mixture with the crab meat mixture and sprinkle over the kaffir lime leaves and sesame seeds. "]}, {"isVegetarian": false, "title": "Crab scotch eggs", "url": "www_bbc_co_uk_food_recipes_crab_scotch_eggs_35126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 quails’ eggs ", "250g/9oz white crabmeat, picked through", "1 free-range egg yolk", "1 tbsp fresh tarragon, chopped", "salt and freshly ground black pepper", "50g/1¾oz plain flour, seasoned with salt and freshly ground black pepper", "1 free-range egg beaten with 50ml/2fl oz milk", "50g/1¾oz panko breadcrumbs", "sunflower oil, to deep-fry"], "serves": "Makes 6 scotch eggs", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the quails’ eggs in a pan of boiling salted water for 2½ minutes, drain and peel.", "In a bowl mix the crab with the egg yolk, tarragon, salt and pepper.  ", "Wrap this mixture around the quails’ eggs, covering them completely.", "Prepare three bowls: one with plan flour, another with the egg and milk, and another with breadcrumbs", "Dip the quails’ eggs into first the flour, then the egg wash and finally into the breadcrumbs.  ", "Fill a deep-sided pan up to a third with sunflower oil and heat to 160C/325F.  (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the eggs into the oil and cook for about three minutes, or until golden-brown, then take the eggs out and drain on a plate lined with kitchen paper."]}, {"isVegetarian": false, "title": "Crab spaghetti in a tomato and caper sauce", "url": "www_bbc_co_uk_food_recipes_crab_spaghetti_in_a_91406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz pancetta", "1 tbsp extra virgin olive oil", "2 garlic cloves, crushed", "10 vine-ripened tomatoes, chopped", "1 x 400g/14oz tin chopped tomatoes ", "250ml/9fl oz fish stock", "1 red onion, left whole, peeled and trimmed", "½ fresh green chilli, deseeded and chopped", "pinch saffron", "½ tsp sugar", "500g/1lb 2oz dried spaghetti", "600g/1lb 5oz mixed cooked brown and white crab meat", "handful chopped fresh parsley", "3 tsp capers, rinsed and chopped", "knob of butter", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the pancetta in a large lidded saucepan over a medium heat for 5 minutes. Reduce the heat and add the olive oil and garlic and cook gently for 2 minutes. Add the fresh tomatoes, tinned tomatoes and fish stock and simmer for 5 minutes. Add the whole onion, chilli, saffron and sugar and simmer gently for 10 minutes with the lid on.", "Bring a large pan of salted water to the boil and cook the spaghetti according to packet instructions. ", "Stir the crab meat into the tomato sauce and simmer for 2 minutes. Add the parsley and capers and cook for a further 2 minutes. Remove the whole onion and discard. ", "Drain the spaghetti and add to the tomato sauce along with a knob of butter. Stir well to coat the spaghetti with the sauce, transfer to platter and serve. "]}, {"isVegetarian": false, "title": "Crab tart", "url": "www_bbc_co_uk_food_recipes_crab_tart_93038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["a little plain flour, for dusting", "320g pack shortcrust pastry", "salt and freshly ground black pepper", "3 free-range eggs, plus 2 egg yolks", "425ml/15fl oz double cream ", "pinch freshly grated nutmeg", "3 dressed crabs or 450g/1lb white crab meat", "2 tbsp olive oil", "2 bunches spring onions, thinly sliced", "40g/1½oz freshly grated Parmesan ", "2 ripe avocados, flesh only, cut into chunky dice", "75ml/3fl oz olive oil", "2 limes, juice only", "3 tomatoes, skinned, deseeded and finely diced", "2 garlic cloves, finely chopped", "2 shallots, chopped", "1 red chilli, deseeded and very finely chopped", "2 tbsp chopped fresh coriander"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Lightly dust a work surface with flour. Roll out the pastry to the thickness of a pound coin, to line a 23cm/9in diameter, 4cm/1½in deep tart tin. Prick the base with a fork but do not trim the pastry.", "Cover the pastry with baking paper, fill with baking beans and bake ‘blind’ for 30 minutes, or until it just starts to colour.", "Carefully remove the baking beans and paper. (If there are cracks, use leftover pastry or beaten egg to fill them.) Return the pastry case to the oven for 5 minutes. Leave to cool on a baking tray. Trim the pastry.", "For the custard, put the eggs, yolks and cream in a bowl and whisk gently, adding a pinch of nutmeg, salt and pepper. Sieve the custard  into a pouring jug.", "If using dressed crabs, separate the crab meat with your fingers and remove any shell. Flake the white meat and set aside, then spread the dark meat over the pastry case. If using only white meat, spread half of it over the pastry case.", "Heat the oil in a frying pan, then quickly fry the spring onions until just softened. Add them to the pastry case. ", "Stir the white crab meat and Parmesan into the custard, lightly season, then carefully pour it on to the spring onions.", "Bake the tart in the centre of the oven for 50 minutes, or until the filling is just set. Leave to cool for a few minutes before serving. ", "For the guacamole, in a bowl mix all the ingredients well and season. If making in advance, cover the surface tightly with a layer of cling film, then cover the bowl with another layer of cling film and set aside. ", "Serve slices of the tart with the guacamole in a serving bowl."]}, {"isVegetarian": false, "title": "Crab tartare with kiwi", "url": "www_bbc_co_uk_food_recipes_crab_tartare_with_kiwi_29535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lime, zest and juice", "80g/3oz chilled crabmeat (brown and white meat)", "2 ripe kiwi fruit, peeled and cut into small cubes", "1 shallot, finely chopped", "10cm/4in piece of cucumber, seeds removed, cut into small cubes", "salt", "4 slices of bread ", "1 tbsp unsalted soft butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Add half a teaspoon of lime zest to a bowl then flake in the crabmeat. Add the kiwi, shallot and cucumber then squeeze over the juice from the lime and toss to coat the ingredients. Taste and season with salt.", "Toast the bread and cut into triangles. Spread with the butter and arrange on a plate next to a bowl of the crab tartare.", "For an especially pretty starter, use an 8cm/3in biscuit cutter to cut out four circles from the toast. Spread with the butter then place the biscuit cutter on top and fill with the crab tartare to create neat mounds."]}, {"isVegetarian": false, "title": "Crab tortellini with parsley and pea broth", "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_05319", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz '00' pasta flour, plus extra for dusting", "4 free-range eggs", "1 tbsp olive oil", "250g/9oz picked white crab meat", "115g/4oz picked brown crab meat", "1 lemon, juice only", "½ tsp paprika", "1 tbsp flatleaf parsley, finely chopped", "salt and freshly ground black pepper", "2 tbsp olive oil", "small bunch flatleaf parsley, leaves picked", "50g/2oz butter", "½ onion, finely chopped", "250g/9oz frozen peas", "500ml/18fl oz chicken stock", "1 bunch baby carrots, trimmed", "1 bunch baby leeks, halved widthways", "2 tbsp chervil sprigs"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pasta, place the flour, three of the eggs and the olive oil into a food processor and pulse until it forms small crumbs. Remove the mixture from the processor and pull together to form a dough.", "Knead the dough lightly on a floured surface for 2-3 minutes until it is smooth and elastic. Wrap in cling film and place in the fridge for 20 minutes.", "Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. ", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time - it helps to cut the pasta into smaller pieces as this will mean the pasta is less likely to dry out - any pasta you are not working on should be covered with cling film.", "To make the tortellini, place both the crab meats into a bowl with a little juice, the paprika and parsley and mix to combine. Season to taste with salt and freshly ground black pepper and adjust the lemon juice accordingly.", "Beat the remaining egg to make an egg wash. Lay a sheet of pasta onto the work surface and stamp out 6cm/2½in diameter discs. Place a spoonful of the crab mixture onto each disc and brush the edges of the pasta lightly with the egg wash.", "Fold one half of the pasta over the filling then press lightly to seal. Pick the crescent of pasta up and twist the edges together, forming a little lip on the outside edge of the pasta. Repeat with the remaining pasta and filling then set the tortellini aside, covered in cling film, until ready to cook.", "For the broth, bring a pan of salted water to the boil, blanch the parsley for 30 seconds then refresh in iced water. Drain, squeeze dry then roughly chop and set aside.", "Heat a sauté pan until hot, add the butter and onion and cook gently for a few minutes until just softened. Add the peas and stock, bring to the boil then add the chopped blanched parsley.", "Ladle the mixture in batches into a food processor and blend to make a fine broth -  try a small amount first to see how much it comes up the sides when blending, be careful not to overfill as the broth is hot and can easily come out of the top. Strain into a clean saucepan then return to a simmer and check the seasoning.", "Bring a pan of water to the boil, add the carrots, boil for one minute then add the leeks and cook for another two minutes until both are tender. Drain and season with a little olive oil. ", "To cook the tortellini, bring a large pan of salted water to the boil, add the tortellini and cook for 1-2 minutes or until they float to the surface then remove with a slotted spoon and drain. Toss with a little olive oil, salt, and freshly ground black pepper.", "To serve, ladle the parsley and pea broth into a soup plate. Place a few tortellini on top then scatter the carrots and leeks around. Garnish with the chervil sprigs. "]}, {"isVegetarian": false, "title": "Crab tortellini with spring vegetables, crab sauce and chive oil", "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_53501", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg yolks", "1 free-range egg", "250g/9oz plain flour", "1 tsp salt", "75g/2½oz unsalted butter", "75g/2½oz shallots", "25g/1oz fresh root ginger, grated", "75g/2½oz brown crabmeat", "250g/9oz crab carcasses (available from fishmongers)", "250ml/9fl oz fish stock", "300g/11oz unsalted butter", "½ tsp salt", "pinch ground white pepper", "1 tsp lemon juice", "10g fresh chives", "100ml/3½fl oz olive oil", "40g/1½oz scallops", "1 free-range egg yolk", "25ml/1fl oz double cream", "40g/1½oz brown crabmeat", "125g/4½oz white crabmeat", "cayenne pepper", "lemon juice, to taste", "25g/1oz butter", "25ml/1fl oz olive oil", "1 leek, cut into julienne strips", "2 carrot, cut into julienne strips", "1 courgette, cut into julienne strips"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, put the egg, egg yolk, flour and salt into a food processor. Switch on the processor and slowly add two tablespoons of water until well combined. Remove the dough from the food processor, knead briefly until smooth, then wrap in cling film and chill in the fridge for 30 minutes.", "For the crab sauce, heat a heavy-based saucepan until medium hot. Add the butter, shallots and ginger and fry for five minutes.", "Add the brown crabmeat and crab carcasses and fry for five minutes.", "Pour in the fish stock and bring to the boil, then simmer for 20 minutes. Pass the mixture through a fine sieve into a clean saucepan.", "To finish the sauce, add the butter, salt, freshly ground black pepper and lemon juice. Whisk until well combined.", "For the chive oil, heat the oil to 80C/180F and add the chives. Infuse for a few minutes and then blend in a food processor until smooth. Pass the mixture through a fine sieve and set aside", "For the crab tortellini filling, place the scallops, egg yolk, cream and brown crabmeat into a food processor and mix until smooth and mousse-like.", "Stir in the white crabmeat. Season with salt, pepper and a pinch of cayenne pepper. Add a few drops of lemon juice.", "Split the crab mousse into four equal portions.", "To make the tortellini, roll the pasta out thinly using a pasta machine or rolling pin. Using a pastry cutter, cut the dough into 10cm/4in circles.", "Place a spoonful of crab mixture onto a pasta circle, fold the top over to form a semi-circle, press down lightly to seal and then wrap the edges of the semi-circle around your index finger and join together.", "Bring a saucepan of salted water to the boil, add the pasta and simmer for 4-5 minutes. Drain.", "For the spring vegetables, heat a large frying pan and once hot add the butter and oil. Add the vegetables and cook for a couple of minutes, or until the vegetables are slightly wilted.", "To serve, place the vegetables in the centre of each of four plates and serve the tortellini alongside with the crab sauce and a drizzle of chive oil for each plate."]}, {"isVegetarian": false, "title": "Crab tortellini with a lemongrass and ginger sauce and wilted spinach", "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_a_55783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Italian '00' flour, plus extra for dusting", "1 free-range egg", "6 free-range egg yolks", "50g/1¾oz fine semolina flour", "250g/9oz picked white crab meat", "115g/4oz picked brown crab meat", "1 lemon, juice only", "1 free-range egg yolk, beaten", "200g/7oz fresh mussels", "200g/7oz fresh clams", "150ml/5fl oz white wine", "1 tbsp coriander stalks", "75g/2½oz unsalted butter", "1 banana shallot, finely chopped", "3cm/1in fresh ginger, peeled and finely chopped", "2 sticks fresh lemongrass, bruised and finely chopped", "150ml/5fl oz fish stock", "150ml/5fl oz double cream", "½ lemon, juice only", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "50g/1¾oz baby spinach", "2 tbsp coriander cress", "200g/7oz Italian '00' flour, plus extra for dusting", "1 free-range egg", "6 free-range egg yolks", "50g/1¾oz fine semolina flour", "250g/9oz picked white crab meat", "115g/4oz picked brown crab meat", "1 lemon, juice only", "1 free-range egg yolk, beaten", "200g/7oz fresh mussels", "200g/7oz fresh clams", "150ml/5fl oz white wine", "1 tbsp coriander stalks", "75g/2½oz unsalted butter", "1 banana shallot, finely chopped", "3cm/1in fresh ginger, peeled and finely chopped", "2 sticks fresh lemongrass, bruised and finely chopped", "150ml/5fl oz fish stock", "150ml/5fl oz double cream", "½ lemon, juice only", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "50g/1¾oz baby spinach", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pulse the flour, egg, egg yolks and semolina in a food processor until well combined and the mixture comes together as a dough. Put the dough in a bowl, cover with cling film and rest in the fridge for 30 minutes.", "Cut the pasta dough in half. Feed the pieces one at a time through a pasta machine according to the machine instructions, ending on the thinnest setting.", "Mix both crab meats in a bowl with a little lemon juice. Season to taste with salt and pepper.", "Lay a sheet of pasta onto a floured work surface and stamp out discs 6-8cm/2½-3in wide. Put a spoonful of the crab mixture onto each disc and brush the edges of the pasta lightly with the beaten egg.", "Fold one half of the pasta over the filling then press lightly to seal. Pick the crescent of pasta up and twist the edges together, forming a little lip on the outside edge of the pasta. Repeat with the remaining pasta and filling then set the tortellini aside, covered in cling film, until ready to cook.", "For the lemongrass and ginger sauce, clean the shellfish and remove and beards from the mussels. Discard any that are cracked, and any open shells that do not close when given a sharp tap.", "Heat a large saucepan with a lid and add the mussels, clams, wine and coriander stalks. Cook with the lid on for 2-3 minutes or until all the shells are open. Discard any that do not open.", "Strain, keeping the liquor, and remove half the mussels and clams from the shells and keep the other half in their shells for presentation.", "Heat a sauté pan until hot and add the butter, shallots, ginger and lemongrass and fry for 5 minutes.", "Pour in the liquor from the mussels and clams, add the fish stock and bring to the boil, then simmer for 3-4 minutes. Pass the mixture through a fine sieve into a clean saucepan.", "To finish the sauce, add the cream, salt, pepper and lemon juice. Whisk until well combined.", "For the spinach, heat a large sauté pan and add the butter and cook the spinach for 1-2 minutes or until wilted.", "To cook the pasta, heat a large saucepan of salted water. Once boiling add the tortellini and cook for 1-2 minutes or until they float to the top.", "Place the wilted spinach in the centre of the serving bowl and top with the tortellini. Spoon the sauce over the top and garnish with mussels, clams and coriander cress."]}, {"isVegetarian": false, "title": "Crab with wakame salad and wasabi mayonnaise", "url": "www_bbc_co_uk_food_recipes_crab_with_wakame_salad_12481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz dried wakame seaweed", "½ cucumber, peeled", "225g/8oz fresh white crabmeat", "1 tbsp bonito flakes", "½ tsp dashi granules", "40ml/1½fl oz warm water", "8ml rice wine vinegar", "½ tsp white sugar", "1 tsp dark soy sauce", "2 free-range egg yolks", "2 tsp white wine vinegar", "2 tsp wasabi powder", "300ml/10fl oz rapeseed oil", "½ tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Refresh the wakame seaweed in a bowl of boiling water for five minutes, then drain well and slice if necessary.", "Cut the cucumber in half lengthways and scoop out the seeds with a teaspoon. Cut across into thin slices. ", "For the wakame dressing, in a bowl dissolve the dashi granules in the warm water and mix with the rest of the dressing ingredients. Add the wakame seaweed and the cucumber and mix together well with the dressing. Set aside in the fridge to chill.", "To make the mayonnaise, mix the egg yolks, white wine vinegar and wasabi powder together in a bowl. Using a wire whisk gradually beat in the oil a few drops at a time, until you have incorporated it all and have achieved a mayonnaise-like texture.  Season to taste with salt.", "To serve, divide the crabmeat equally between four small ramekins and gently press down. (Or serve piled up.) Turn the crabmeat out onto four plates and spoon a tablespoon of the wasabi mayonnaise alongside. Take a large handful of the cucumber and wakame seaweed and place next to the crabmeat, sprinkle the bonito flakes on top of the seaweed, and serve."]}, {"isVegetarian": false, "title": "Crab and asparagus fettuccine", "url": "www_bbc_co_uk_food_recipes_crabandasparagusfett_74709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp extra virgin olive oil ", "1 shallot, finely diced ", "1 tsp soft thyme leaves", "2 tsp anchovy essence", "150ml/¼ pint dry white wine", "150ml/¼ pint fish stock", "salt and freshly ground black pepper ", "450g/1lb asparagus, trimmed and cut into 2.5cm/1in pieces ", "350g/12oz white crab meat", "675g1½lb fresh fettuccine", "55g/2oz unsalted butter", "1 lemon, juice only", "2 tbsp chopped parsley"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a heavy-bottomed frying pan.", "Add the shallot and cook gently until soft but not brown.", "Add the thyme, anchovy essence, wine and fish stock and bring to the boil.", "Cook until the liquid has reduced by half.", "Meanwhile, bring a large pot of salted water to the boil.", "Add the asparagus and cook for six minutes.", "Drain, retaining the water, and add the reduced shallot liquid with the crab.", "Cook the fettuccine in the asparagus water for about 3-4 minutes, depending on the freshness.", "Drain and add to the crab sauce.", "To finish, heat the butter in a frying pan until nutty and golden.", "Add the lemon juice and the parsley and pour over the pasta. ", "Toss to combine. ", "Season to taste with plenty of black pepper."]}, {"isVegetarian": false, "title": "Crab and chilli tagliatelle", "url": "www_bbc_co_uk_food_recipes_crabandchillitagliat_87860", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz '00' flour (available in most supermarkets' baking sections)", "1 free-range whole egg", "6 free-range egg yolks", "50g/2oz fine semolina flour", "1 tbsp olive oil", "2 shallots, finely chopped", "1 red chilli, finely sliced ", "½ stalk lemongrass, finely chopped", "3cm/1¼in fresh ginger, finely chopped", "1 tsp hot curry powder", "200ml/7fl oz white wine", "250ml/9fl oz double cream", "350g/12oz picked brown and white crabmeat", "1 lime, juice only", "3 tbsp fresh coriander, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the pasta, place the '00' flour, eggs and egg yolks into a food processor and process for one minute, or until everything is bound together and smooth.", "Cover and place in the fridge to rest for 30 minutes.", "Flour the pasta machine with semolina flour and divide the pasta into two equal pieces. Starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other piece of dough.", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the tagliatelle cutter attachment to the pasta machine, flouring it well with more semolina flour.", "Run the sheets of dough through the machine once again, cutting them into tagliatelle of 5mm/0.2in. Dust with the remaining semolina flour and place in the fridge overnight.", "For the crab sauce, heat a frying pan until hot and add the olive oil, shallots, chilli, lemongrass, ginger and curry powder. Fry for 2-3 minutes.", "Add the white wine and bring to a simmer. Cook until the wine has reduced by half. ", "Add the cream and cook for a further minute before adding the crabmeat. Stir to combine and simmer for one minute. ", "Season with salt and freshly ground black pepper, to taste, and add a little of the lime juice and coriander, saving a squeeze of lime to serve. Set aside, keeping the sauce warm, while you cook the pasta.", "To serve, bring a large pan of salted water to the boil, add the tagliatelle and cook for 2-3 minutes until tender. ", "Drain the pasta and place into the pan with the sauce and stir to combine. Serve in bowls with a squeeze of lime."]}, {"isVegetarian": false, "title": "Crab and coriander tart", "url": "www_bbc_co_uk_food_recipes_crabandcoriandertart_74910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 eggs, 1 egg yolk", "400g/14oz crab meat, fresh or frozen", "300ml/10fl oz cream ", "1 tbsp lemon juice", "2 tbsp chopped coriander", "1 tsp grated ginger", "¼ to ½ red, de-seeded chilli (may need to add more) OR ½tsp Tabasco to taste", "50g/2oz grated parmesan", "salt and freshly ground black pepper", "1 x recipe of savoury pastry", "Follow pastry packet instructions and line out 27cmx3cm or a 30cmx2cm tin and bake blind", "4 ripe tomatoes, chopped ", "1 tbsp onion or spring onion, chopped", "1-2 cloves of garlic, crushed", "½-1 chilli, finely chopped", "1 heaped tbsp chopped coriander", "½ lime, juice only", "salt and freshly ground black pepper", "pinch of sugar"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["preheat oven to 180C/356F/Gas 4.", "Whisk the eggs and yolk, add the rest of the ingredients, except the parmesan and the seasoning. ", "Add salt and pepper to taste, and pour into the baked pastry in the tin.", "Sprinkle with parmesan and bake for 40 minutes, until it feels firm to the touch in the centre.", "To make the tomato salsa, mix all the ingredients together and season with the salt, pepper and a pinch of sugar.", "Serve with chunky tomato salsa on the side."]}, {"isVegetarian": false, "title": "Crab and cucumber vichyssoise", "url": "www_bbc_co_uk_food_recipes_crabandcucumbervichy_91771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter, unsalted", "2 leeks, sliced", "400g/14oz potatoes, cut into cubes", "400ml/14fl oz vegetable stock", "75ml/2½fl oz white wine", "2 cucumbers, peeled, seeds removed, finely chopped", "½ lemon, juice only", "50ml/2fl oz double cream ", "1 tbsp chopped fresh chives", "250g/9oz cooked white crabmeat, picked", "1 radish, finely sliced, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan until foaming, then add the leeks and fry for 4-5 minutes, or until tender. ", "Add the chopped potatoes, stock and wine to the pan and bring to boil. Reduce the heat to a simmer and cook for 20-25 minutes, or until the potatoes are tender. ", "Transfer the mixture to a food processor and blend until smooth. (Adjust the consistency of the soup, if needed, by adding water). Chill in the fridge for at least 30 minutes, or until completely cold.", "Stir the cucumber into the soup, then add the lemon juice, to taste. Spoon the soup into serving bowls or glasses and swirl in the double cream. Sprinkle over the chopped chives and top each serving with a spoonful of crabmeat and a few slices of radish."]}, {"isVegetarian": false, "title": "Crab and fennel tagliatelle", "url": "www_bbc_co_uk_food_recipes_crabandfenneltagliat_71812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 baby fennel bulbs", "200g/7¼oz brown crabmeat", "75g/2½oz unsalted butter", "450g/1lb fresh tagliatelle", "4 drops of truffle oil ", "2 lemons, juice only", "salt ", "freshly ground black pepper", "400g/15oz white crabmeat"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put a large pot of salted water on to boil.", "Discard the tough outer leaves of the fennel bulbs, reserving the green feathery tops for garnish. Slice the bulbs into thin wedges and reserve.", "Force the dark crabmeat through a sieve and add to a saucepan with 3-4 tablespoons of water. ", "Add the butter and place the mixture in a pan on a low heat to melt the butter and heat through. If the sauce is too thin, continue cooking until it reduces. ", "Meanwhile, put the fennel wedges and the pasta into the boiling water to cook. ", "Add the truffle oil to the crab sauce, and lemon juice to taste. Season with salt and pepper. ", "Drain the fennel and pasta when it is al dente and return to the pan. ", "Pour in the crab sauce and the white crab meat. Toss to coat. ", "Serve with a sprinkling of the chopped fennel tops."]}, {"isVegetarian": false, "title": "Crab and ginger tart with a chilli dressing", "url": "www_bbc_co_uk_food_recipes_crabandgingertartwit_83886", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb ready made shortcrust pastry", "10cm/4in piece fresh ginger, peeled and roughly chopped", "1 large bunch flatleaf parsley", "2 tbsp sunflower oil", "350g/12oz fresh white crabmeat ", "2 free-range eggs", "2 free-range egg yolks", "325ml/11fl oz crème fraîche ", "salt and freshly ground black pepper", "4 spring onions, finely chopped", "1 lime, juice only", "1 red chilli, finely chopped", "3 tbsp soy sauce", "6 tbsp sunflower oil", "1 tsp caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "On a lightly floured surface, roll out the pastry and use to line a 25cm/10in loose-bottomed tart tin. Cover and place in the fridge for 15 minutes. ", "Line the pastry tart case with greaseproof paper and fill with baking beans. ", "Bake in the oven for 10-15 minutes. ", "Remove the greaseproof paper and beans and return the tart case to the oven for a further 3-5 minutes until it is just cooked. ", "Reduce the heat to 180C/350F/Gas 4.", "In a small food processor, blend the ginger with the parsley and two tablespoons of sunflower oil. ", "Spread over the base of the tart case.", "Scatter the crabmeat over the top of the ginger mixture.", "In a bowl combine the eggs and egg yolks with the crème fraîche and season with salt and freshly ground black pepper. ", "Pour into the tart case.", "Return the tart to the oven for 30-35 minutes or until just set.", "Meanwhile, make the dressing. In a small bowl, whisk together the onions, lime juice, chilli, soy sauce, sunflower oil and sugar with one tablespoon of water. Season to taste.", "Serve the tart warm with a drizzling of chilli dressing."]}, {"isVegetarian": false, "title": "Crabcakes", "url": "www_bbc_co_uk_food_recipes_crabcakes_85675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz crabmeat", "1 tsp mustard powder", "2 tsp Worcestershire sauce", "1 tbsp mayonnaise", "1 tbsp chopped fresh parsley", "1 free-range egg yolk", "4 tbsp dry breadcrumbs, plus additional breadcrumbs for coating", "30g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together in a bowl, except for the coating breadcrumbs and the butter.", "Form the mixture into eight individual fishcakes using your hands.", "Tip the additional breadcrumbs onto a plate. Dip each fishcake into the breadcrumbs to coat.", "Heat the butter in a frying pan and add the fishcakes to the pan - you may need to cook them in batches. Fry them until they're crisp and golden-brown and serve at once."]}, {"isVegetarian": false, "title": "Crab and sweetcorn soup", "url": "www_bbc_co_uk_food_recipes_crabandsweetcornsoup_89965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz canned sweetcorn, rinsed and drained (or use fresh sweetcorn)", "1 tbsp vegetable oil", "3 spring onions, finely chopped", "2.5cm/1in piece ginger, peeled, cut into matchsticks", "200g/7oz crabmeat", "50ml/2fl oz dry sherry", "1 litre/1 pint 15fl oz chicken stock", "1 tsp cornflour mixed with a little water to form a paste", "1 free-range egg, beaten", "1 tsp sesame seeds", "1 red chilli, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place three-quarters of the sweetcorn into a food processor and blend to a smooth purée. ", "Heat the vegetable oil in a pan over a medium heat. Add the spring onion and ginger and fry for 3-4 minutes, until the onion is softened, but not coloured.", "Add the crabmeat, sherry, sweetcorn purée and the stock and bring to the boil. Reduce the heat and simmer for five minutes.", "Add the remaining sweetcorn and the cornflour paste and stir well.", "Pass the beaten egg through a fine sieve held over the soup to create strings of egg in the soup. Cook until the eggs have set as strands.", "To serve, ladle equal quantities of the soup into bowls and garnish with sesame seeds and chillies."]}, {"isVegetarian": false, "title": "Crab and Taleggio omelette", "url": "www_bbc_co_uk_food_recipes_crabandtaleggioomele_82133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs, lightly beaten", "3 tbsp spring onions, finely chopped (1 tablespoon reserved for garnish)", "25g/1oz butter", "50g/1¾oz tinned crabmeat", "50g/1¾oz Taleggio, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs and spring onions into a bowl and whisk together.", "Melt the butter in a small frying pan until foaming. Add the egg mixture and cook for two minutes. ", "Preheat the grill to high.", "Sprinkle the omelette with the crabmeat and Taleggio, season with salt and freshly ground black pepper and place under the grill for four minutes. ", "To serve, turn the omelette out onto a plate and sprinkle with the remaining tablespoon of chopped spring onions."]}, {"isVegetarian": false, "title": "Crabcakes with a rice noodle salad", "url": "www_bbc_co_uk_food_recipes_crabcakes_with_a_rice_91861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz floury potatoes, such as King Edward, cut into large chunks", "vegetable oil, for deep frying", "10g/¼oz butter", "1 tbsp finely chopped fresh coriander", "½ large fresh green chilli, seeds removed and finely chopped", "150g/5½oz white crabmeat, flaked", "100g/3½fl oz brown crabmeat", "2 limes, juice only", "salt and freshly ground black pepper", "250g/9oz rice noodles", "3 limes, juice only", "4 garlic cloves, crushed", "2 tbsp finely grated fresh root ginger", "4 tbsp palm sugar", "1 tbsp sesame oil", "3 tbsp nuoc nam (Vietnamese fish sauce)", "3 tbsp soy sauce", "2 red chillies, 1 finely chopped and 1 sliced", "1 large bunch fresh mint, leaves only, chopped", "1 large bunch coriander, leaves only, chopped", "coriander cress", "1 red chilli, sliced", "4 spring onions, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in a saucepan of lightly salted water for about 15 minutes, or until tender. Drain well, and then return to the pan. Mash with a fork or potato masher until smooth.", "Heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Add the butter, coriander, chilli and season with salt and pepper. Stir together to mix thoroughly, then leave to cool completely.", "Meanwhile, check the crabmeats carefully for any flecks of shell and discard. Add the crabmeats to the mashed potato mixture. Add the lime juice then shape into 4 round patties. If the mixture sticks to your hands, dip your hands in cold water.", "Carefully add the crabcakes to the oil and cook for 3-4 minutes, until golden-brown on the underside, then carefully turn them and cook for another 3-4 minutes on the other side. When fully cooked, remove from the fryer and drain on kitchen paper. ", "Cook the noodles according to the packet instructions and place in a large bowl.", "Place all the other ingredients in a food processor and blend to a rough paste. Add the dressing to the noodles and mix well.", "Place the noodles in the centre of serving bowls and top with the crabcakes. Garnish with the coriander cress, chilli and spring onions."]}]