[{"ingredients": ["3 cucharadas de coco desecado", "200g / 7oz de arroz basmati", "40g / 1¾oz de mantequilla", "1 cucharada de aceite vegetal", "1 cebolla, finamente rebanada", "50g / 2oz de pasta de curry de intensidad media", "4 pechugas de pollo pequeñas, despellejadas y cortadas en rodajas de 2 cm / 1 in", "200g / 7oz de tomates enlatados", "300ml / 10½ fl oz de leche de coco", "2 cucharadas de hojas de cilantro fresco picado", "2 cucharadas de hojas de menta fresca picada", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a fuego medio. Espolvoree el coco en una bandeja para hornear y tueste debajo de la parrilla hasta que se dore. Dejar de lado.", "Coloque el arroz basmati en una olla con tapa y cubra con 400 ml / ¾ de agua fría. Agregue la mitad de la mantequilla, cubra la sartén, colóquela a fuego alto y ponga a hervir. Reduzca el fuego a su nivel más bajo y cocine el arroz por 12-15 minutos, o hasta que el arroz haya absorbido toda el agua y esté solo tierna.", "Mientras tanto, caliente el aceite vegetal en una sartén a fuego medio. Agregue la cebolla y saltee por 2-3 minutos, o hasta que se suavice. Agregue la pasta de curry y saltee por un minuto más.", "Agregue el pollo a la sartén y mezcle bien para cubrirlo con la salsa.", "Agregue los tomates y la leche de coco, revuelva bien y ponga la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 10 minutos o hasta que el pollo esté cocido y la salsa espesada ligeramente.", "Agregue el cilantro picado, la menta y el jugo de lima, agregue la mantequilla restante y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, esponje el arroz cocido con un tenedor, luego divídalo por igual entre cuatro platos para servir. Coloque una cucharada de pollo al curry en la parte superior de cada porción de arroz. Adorne con una pizca de coco desecado."], "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_83629", "title": "Pollo al curry con arroz basmati", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_curry_with_83629_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite en aerosol bajo en calorías", "2 cebollas, finamente picadas", "6-8 muslos de pollo deshuesados, despellejados y sin grasa visible", "2 dientes de ajo, aplastados", "20g / ¾oz de jengibre, finamente rallado", "2 cucharaditas de sal masala", "½ cucharadita de chile en polvo", "400g de tomates cortados en lata", "Stock de pollo 600ml / 20floz, hecho con 1 cubo de caldo de pollo", "100 g / 3½ oz de lentejas rojas secas, enjuagadas y escurridas", "2 hojas de laurel", "200g / 7oz de arroz integral de grano largo", "150g / 5½oz de yogur natural sin grasa", "1 cucharada de hojas frescas de cilantro picado"], "method": ["Rocíe una cacerola de base ancha o saltee la sartén con aceite y coloque a fuego medio. Cocine las cebollas durante cinco minutos, revolviendo regularmente, hasta que estén suaves y ligeramente doradas.", "Cortar los muslos de pollo por la mitad y agregar a la sartén. Cocine por dos minutos, volteando ocasionalmente. Agregue el ajo, el jengibre, el garam masala y el chile en polvo y cocine por unos segundos, revolviendo constantemente.", "Incline los tomates en la sartén y agregue el caldo de pollo, las lentejas y las hojas de laurel. Llevar a ebullición, luego cubrir sin apretar con una tapa y cocine a fuego lento durante 35 minutos, o hasta que el pollo esté tierno y las lentejas se hayan roto por completo, revolviendo ocasionalmente. Retire la tapa durante los últimos 10 minutos del tiempo de cocción, revolviendo regularmente para que las lentejas no se peguen.", "Aproximadamente 25 minutos antes de que el curry esté listo, cocine el arroz en abundante agua hirviendo hasta que esté tierno, luego escurra bien.", "Sazonar el curry al gusto. Sirva con el arroz, cubierto con yogur y espolvoreado con cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_dhansak_curry_98040", "title": "Curry de pollo al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_dhansak_curry_98040_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 muslos de pollo", "1 cucharada de pimentón", "1 cucharada de comino molido", "4 dientes de ajo", "1 cucharada de aceite vegetal", "6 envolturas de tortilla grandes", "aproximadamente 200 g de maíz dulce de hojalata, enjuagado y escurrido", "1 pimiento rojo", "2 cebollas de primavera", "medio limón, solo jugo", "sal y pimienta"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Incline el pollo en una bandeja grande para asar y espolvoree sobre las especias. Triture ligeramente el ajo, dejando las pieles y agregue a la bandeja con el pollo. Rocíe con el aceite y sazone con sal y pimienta. Asar durante 30 minutos, hasta la mitad de la cocción, hasta que el pollo esté ligeramente carbonizado por fuera y perfectamente cocido por dentro.", "Mientras el pollo está cocinando, haz la ensalada. Incline el maíz dulce en un recipiente y luego pique finamente la pimienta (quitando las semillas) y agregue al recipiente. Cortar finamente las cebolletas y agregar al bol junto con un chorrito de jugo de limón. Sazone al gusto con sal y pimienta.", "Triture el pollo del hueso y luego envuélvalo en envolturas de tortilla con la ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_drumsticks_with_66853", "title": "Muslos de fajita de pollo con ensalada de maíz mexicano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_drumsticks_with_66853_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mozzarella de búfala 225g / 8oz picada", "12 hojas de albahaca fresca, trituradas", "20 tomates dorados, picados", "4 x pechugas de pollo", "Hojaldre de 4 piezas, 15cm / 6 pulgadas cuadradas, 3mm / ⅛ pulgadas de espesor", "1 huevo, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle los tomates mozzarella, albahaca y crema solar en un tazón.", "Corte un bolsillo en cada una de las pechugas de pollo y rellene con la mezcla de mozzarella.", "Coloque una pechuga de pollo rellena en el centro de cada cuadrado de hojaldre y enrolle en paquetes.", "Cepille cada paquete con el huevo batido y hornee en el horno durante 25-30 minutos, o hasta que se levante y dore."], "url": "www_bbc_co_uk_food_recipes_chicken_en_croute_94416", "title": "Pollo en una costra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates patrimonio, cortados a la mitad a la mitad", "4 cucharadas de aceite de oliva", "sal y pimienta negra", "6 ramitas de tomillo, hojas recogidas", "2 lechugas Little Gem, separadas en hojas", "Espinaca de la hoja del bebé 25g / 1oz", "150g / 5½oz de alcachofas a la parrilla", "Bolas de mozzarella para bebé de 100 g / 3½ oz", "1 cucharada de vinagre de Jerez", "1 cucharada de vinagre de vino tinto", "3 cucharadas de aceite de oliva", "1 limón, cortado en cuñas para servir", "Pan rallado panko japonés de 60 g / 2¼ oz", "25g / 1oz de queso parmesano, recién rallado", "1 limón, ralladura solamente", "4 pechugas de pollo, deshuesadas y sin piel", "8 rebanadas de jamón de Parma", "Harina normal de 75 g / 2½ oz", "sal y pimienta negra", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de aceite de oliva", "50g / 1¾oz de mantequilla"], "method": ["Para la ensalada de tomate y alcachofa, precaliente el horno a 150 C / 300 F / Gas 2 (o su ajuste más bajo).", "Coloque los tomates, con el lado del corte hacia arriba en una bandeja de tostado y rocíe con aceite de oliva.", "Sazone con sal y pimienta negra y luego esparza la mitad de las hojas de tomillo sobre la parte superior.", "Coloque en el horno y tueste durante 4-6 horas, o hasta que se sequen ligeramente. Apague el horno y deje que se enfríe, preferiblemente durante la noche en el horno.", "Para el escalope de pollo, precaliente el horno a 220C / 425F / Gas 7.", "Coloque las migas de pan, parmesano y ralladura de limón en un procesador de alimentos y pulse para formar migas finas.", "Coloque las pechugas de pollo entre dos hojas de película adhesiva o pergamino para hornear y use un recipiente de rodillo hasta que quede aplanado. Envuelva las pechugas de pollo en el jamón de Parma.", "Sazone la harina con sal y pimienta negra y luego espolvoree el pollo en la harina.", "Coloque el huevo batido en un recipiente poco profundo. Sumerja el pollo en el huevo batido y luego en las migas de pan, asegurándose de cubrir cada lado a fondo.", "Caliente el aceite de oliva y la mantequilla en una sartén grande, luego agregue las pechugas de pollo, una a la vez, y fría por dos minutos en cada lado, o hasta que estén doradas. Transfiera al horno para terminar de cocinar. Cuando el pollo esté bien cocido, colóquelo en papel de cocina para escurrirlo.", "Para la ensalada de tomate y alcachofa, coloque la lechuga y la espinaca baby en un tazón grande y agregue los tomates refrigerados, las alcachofas y las bolas de mozzarella.", "En un tazón pequeño combine los vinagres y el aceite de oliva. Sazonar con sal y pimienta y batir para combinar. Vierta el aderezo sobre la ensalada, agregue cualquier aceite de la alcachofa y revuelva para cubrir.", "Para servir, coloque el escalope de pollo en un plato de servir con la ensalada al lado y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_chicken_escalope_with_49951", "title": "Escalope de pollo con ensalada de tomate y alcachofa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja pequeña, finamente picada", "Tomates maduros pequeños de 425 g / 15 oz cortados en trozos", "2 dientes de ajo, aplastados", "gran puñado de hojas de cilantro fresco, picado", "pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cebolla roja grande, finamente rebanada", "1 pimiento rojo, sin corazón, sin semillas y en rodajas finas", "1 pimiento amarillo, sin corazón, sin semillas y en rodajas finas", "Pechugas de pollo de 450 g / 1 lb, peladas y cortadas en tiras finas", "pizca de pimentón", "pellizcar el chile en polvo suave", "pizca de comino", "pellizcar el orégano seco", "4 tortillas integrales blandas", "½ lechuga iceberg, finamente triturada"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la salsa Combina la cebolla, los tomates, el ajo y el cilantro en un tazón. Sazonar con pimienta recién molida negro. Cubra y enfríe por 30 minutos.", "Para el pollo, caliente el aceite en un wok o una sartén antiadherente grande, agregue la cebolla y los pimientos y saltee durante 3-4 minutos. Agregue el pollo, el pimentón, el chile en polvo, el comino y el orégano y cocínelos durante 5 minutos o hasta que el pollo esté bien cocido.", "Mientras tanto, envuelve las tortillas en papel de aluminio y caliéntalas en el horno durante 5 minutos.", "Coloque una cuarta parte de la mezcla de pollo en el centro de cada tortilla, agregue un par de cucharadas de salsa y lechuga picada. Enrolle y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_chicken_fajitas_with_07231", "title": "Fajitas de pollo con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_fajitas_with_07231_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de caldo de pollo", "200ml / 7fl oz de vino blanco", "125g / 4½ oz cebollas perla", "3 ramitas de tomillo, solo hojas", "1,5 kg / 3 libras 5 oz pollo entero, cortado en 8 piezas, más el resto de la carcasa", "200 g / 7 oz de champiñones bebé", "4 yemas de huevo de gallinas camperas", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatillo finamente picado", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de leche entera o crema", "sal y pimienta negra recién molida"], "method": ["Coloque una cazuela grande a fuego alto, agregue el caldo, el vino blanco, las cebollas perladas y el tomillo y deje que hierva a fuego lento.", "Agregue el pollo, incluido el cadáver y vuelva a hervir a fuego lento.", "Agregue los champiñones, cubra y cocine a fuego lento durante unos 15-20 minutos, o hasta que el pollo esté bien cocido.", "Retire la cazuela del fuego y retire el pollo, descartando la carcasa.", "Batir las yemas de huevo y la crema juntas en un recipiente, luego agregarlas gradualmente a la cacerola, mezclándolas bien a medida que vierte; si la cacerola está demasiado caliente, los huevos se cocinarán demasiado rápido y se dorarán la salsa.", "Regrese el pollo a la sartén y luego revise el condimento, agregue sal y pimienta negra recién molida, al gusto. Finalmente agregue el perejil.", "Para el puré, coloque las papas en una sartén con agua fría y salada y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y vuelva a la sartén, luego coloque a fuego lento durante un par de minutos para secar ligeramente las papas.", "Incline las papas de nuevo en un colador y luego páselos por un ricer.", "Agregue la mantequilla y la leche (o crema) y bata hasta formar un puré muy suave, luego sazone al gusto con sal y pimienta negra.", "Para servir, espolvorea el puré en tazones, luego completa con dos trozos de pollo y una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_chicken_fricasse_02463", "title": "Fricasé de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_fricasse_02463_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de soja", "50g / 1¾oz mangetout, finamente cortado en palos", "50g / 1¾oz de zanahoria, finamente cortada en barras", "2 cucharadas de caldo dashi (disponible en algunos grandes supermercados)", "1 cucharada de jarabe de reserva (ver consejo)", "1 cucharada de vinagre de vino de arroz", "½ cucharada de salsa de pescado", "3 cucharadas de jugo de limón", "50ml / 2fl oz de salsa de soja", "1 cucharada de aceite y mantequilla", "2 chalotes, finamente picados", "1½ dientes de ajo, finamente picados", "60g / 2¼ oz de raíz de jengibre fresco, finamente rallado", "300 g / 10½ oz de almendras picadas y tostadas", "4 cucharadas de miel clara", "5 cucharadas de caldo de pollo", "5 cucharadas de salsa de soja", "1 lima, solo jugo", "1 chile rojo, finamente picado", "pequeñas hojas de cilantro puñado, finamente picado", "aceite vegetal, para freír", "Harina normal de 75 g / 2½ oz", "2 huevos medianos de granja, golpeados", "Pan rallado pancho japonés de 100 g / 3½ oz", "4 pechugas de pollo grandes, sin piel y sin hueso, cortadas en tiras", "algunas ramitas de cilantro, para adornar"], "method": ["Mezcle las verduras juntas y déjelas a un lado.", "Para el aderezo ponzu, mezcle todos los ingredientes, vierta en un recipiente y reserve.", "Para la satay de almendras, derrita la mantequilla y el aceite en una cacerola. Agregue la chalota y el ajo y fríe con cuidado hasta que estén suaves, pero no coloreados. Agregue el jengibre y cocine durante 5 minutos. Agregue las almendras, la miel, el caldo, la salsa de soja y el jugo de lima. Cocine por 2 minutos más o hasta que se combinen. Retire del fuego, luego agregue el chile y el cilantro. Dejar de lado.", "Para los goujons de pollo, precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina, los huevos y las migas de pan en recipientes separados poco profundos. Dragar las tiras de pollo en la harina, luego sumergir en el huevo y cubrir en pan rallado.", "Baje los goujons de pollo en el aceite caliente (puede necesitar hacer esto en tandas) y cocine durante 5 minutos o hasta que el pollo esté bien cocido y las migas de pan doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Sirva los goujons de pollo con las verduras crudas al lado. Vierta una cucharada de satay de almendras calientes, luego 3 cucharadas de aderezo Ponzu. Adorne con algunas hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_goujons_with_82425", "title": "Goujons de pollo con salsa de almendra satay y un aderezo Ponzu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["rociar aceite de oliva", "2 pechugas de pollo, sin piel y cortadas (200 g / 7 oz cada una)", "½ cebolla, finamente picada", "1 diente de ajo graso, aplastado", "100 g / 3½ oz de champiñones mixtos o castaña, en rodajas", "250ml / 9fl oz de caldo de pollo (hecho con ½ de un cubo de reserva)", "sal y pimienta", "100 ml / 3½ fl oz oz crème fraiche medio", "1 cucharada de perejil recién picado, para decorar", "Brócoli 300 g / 10½ oz, al vapor, para servir"], "method": ["Caliente el aceite en una sartén antiadherente, agregue las pechugas de pollo y fríalos por unos 10 minutos, o hasta que estén doradas por ambos lados. Dejar de lado.", "En la misma sartén, agrega un poco más de aceite y freír la cebolla durante 2-3 minutos, o hasta que esté transparente. Agregue el ajo y fría por otros 1-2 minutos. Agregue los champiñones y fría hasta que estén dorados. Si comienzan a pegarse, agregue un poco de caldo a la sartén.", "Regrese el pollo a la sartén y agregue el caldo. Llevar a ebullición. Cubra con una tapa ajustada, baje el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que el pollo esté bien cocido. Condimentar con sal y pimienta.", "Mientras tanto, cocine el brócoli en agua hirviendo con sal hasta que esté tierno.", "Revuelva la crème fraîche y el perejil en la salsa y sirva inmediatamente con el brócoli."], "url": "www_bbc_co_uk_food_recipes_chicken_in_a_creamy_84614", "title": "Pollo en salsa cremosa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_in_a_creamy_84614_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 patas de pollo, sin piel", "½ cucharadita de comino molido", "½ cucharadita de menta seca", "1 hoja de laurel", "4 chalotes, pelados y en rodajas", "110ml / 4fl oz de caldo de pollo", "3 cucharadas de perejil de flatillo picado", "Queso halloumi 200 g / 7 oz, migajas", "3 chiles verdes pequeños, sin semillas y en rodajas finas", "16 hojas de pasta filo, cada 10cm / 4in x 10cm / 4in", "5-6 cucharadas de mantequilla derretida, para cepillar", "1-2 cucharadas de semillas de sésamo o cáñamo", "2 cucharadas de aceite de oliva virgen extra", "Zanahorias 300 g / 11 oz, peladas, ralladas medianas gruesas", "300g / 11oz de espesor, yogurt colado", "½ cucharada de mayonesa de buena calidad", "3 cucharadas de pasas", "2 dientes de ajo, aplastados", "½ cucharadita de comino molido", "sal y pimienta negra recién molida", "2 cucharadas de cebollín fresco, finamente picado"], "method": ["Para los rollitos de primavera, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Caliente una sartén a prueba de horno hasta que esté caliente, agregue el aceite de oliva y el pollo y dore ligeramente el pollo.", "Agregue el comino, la menta, la hoja de laurel y los chalotes, y fría por 1-2 minutos.", "Agregue el caldo, cocine a fuego lento, luego cubra con una tapa y colóquelo en el horno para cocinar durante 30 minutos, o hasta que el pollo esté bien cocido.", "Retire el pollo y colóquelo a un lado hasta que esté lo suficientemente frío como para manipularlo. Deje de lado el caldo, luego saque la carne del pollo y tritúrelo en un recipiente, descartando la piel y los huesos.", "Agregue los chalotes y el caldo del pollo, junto con el perejil, el queso desmenuzado y los chiles verdes al pollo, y dele una buena mezcla.", "Caliente una freidora a 180C / 350F o encienda el horno a 200C / 400F / Gas 6. (PRECAUCIÓN: No deje la grasa caliente desatendida).", "Coloque una hoja de filo en una superficie de trabajo limpia.", "Coloque un poco de pollo en un extremo de la hoja de filo, jale el fondo y enrolle. Cierre a los lados, cepille con mantequilla derretida y selle. Espolvorear con las semillas de sésamo o cáñamo. Repita para usar todo el relleno y el filo.", "Coloque los rollos en una bandeja y hornee por 5-6 minutos, o hasta que estén dorados (o coloque en una freidora de grasa profunda y cocínelos durante 3-4 minutos, o hasta que estén dorados y calientes).", "Para la ensalada de zanahoria y yogur con pasas, caliente una sartén hasta que esté caliente, agregue el aceite de oliva y la zanahoria y fría por dos minutos a fuego medio. La zanahoria debe estar marchita, pero no marrón. Retire y coloque en un recipiente para enfriar.", "Una vez que la zanahoria se haya enfriado, agregue el yogur, la mayonesa, las pasas, el ajo y el comino.", "Revuelva bien para combinar y sazone al gusto con sal y pimienta negra recién molida.", "Espolvorear con las cebolletas y servir.", "Para servir, apile los rollitos de primavera en un plato y ponga la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_halloumi_and_45727", "title": "Rollo de primavera de pollo, halloumi y chiles verdes con zanahoria y ensalada de yogur con pasas de uva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de salsa de soja ligera", "1½ cucharadas de vino de arroz Shaoxing (o jerez seco)", "½ cucharadita de sal", "1 cucharadita de azúcar", "1 cucharadita de aceite de sésamo", "2 cucharadas de harina de maíz", "Muslos de pollo deshuesados ​​de 450 g / 1 lb, cortados en trozos de 5 cm / 2 in", "1 cucharada de aceite de verdura o maní", "1 cucharada de jengibre fresco de raíz finamente picado", "1½ cucharadas de ajo finamente picado", "1 cucharada de chalotes finamente picados", "2½ cucharadas de frijoles negros fermentados, toscamente picados", "3½ cucharadas de cebollas de primavera finamente picadas", "150ml / 5fl oz de caldo de pollo"], "method": ["Mezcle la salsa de soja, el vino de arroz, la sal, el azúcar, el aceite de sésamo y la harina de maíz en un tazón grande. Agregue las piezas de pollo y refrigere durante 1 hora. Escurrir y descartar el adobo.", "Caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agregue el aceite y cuando esté muy caliente, agregue el pollo y saltee por 5 minutos o hasta que esté ligeramente dorado.", "Agregue el jengibre, el ajo, los chalotes, los frijoles negros y 1½ cucharadas de cebolletas y cocine durante 2 minutos. Agregue el caldo, lleve a ebullición y luego reduzca el fuego. Cubra el wok o sartén y cocine a fuego lento durante 8-10 minutos, o hasta que el pollo esté cocido.", "Adorne con las cebolletas restantes y sirva."], "url": "www_bbc_co_uk_food_recipes_chicken_in_black_bean_48278", "title": "Pollo en salsa de frijoles negros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "1 cebolla roja, pelada y rebanada", "6 muslos de pollo", "6 lonchas de tocino rayado ahumado, cortadas en piezas del tamaño de un sello postal", "2 manzanas de descubrimiento o similares, sin corazón y cortadas en rodajas", "300ml / 10½fl oz de sidra seca", "sal", "puré de papa, para servir"], "method": ["Coloque la mantequilla en una cazuela con tapa y tapa dura a fuego medio.", "Agregue la cebolla en rodajas y deje ablandar durante un minuto.", "Coloque los muslos de pollo, con el lado de la piel hacia abajo, en la sartén y freír durante 2 o 3 minutos, o hasta que la piel comience a dorarse.", "Agregue el tocino en rodajas, voltee los muslos y cocine durante 2-3 minutos más, o hasta que el tocino comience a colorear.", "Agregue las manzanas y deje ablandar por un minuto.", "Vierta la sidra y sazone con una pizca de sal. Cubra con una tapa y cocine a fuego lento durante 10-15 minutos, o hasta que los jugos de pollo salgan limpios.", "Sirva de inmediato, llevando el bote a la mesa y permitiendo que las personas se ayuden a sí mismas."], "url": "www_bbc_co_uk_food_recipes_chicken_in_cider_73184", "title": "Pollo en sidra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_in_cider_73184_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo deshuesados, sin piel", "2 cucharadas de pasta de curry rojo", "1 cucharada de azúcar de palma", "3 cucharadas de salsa de pescado", "1 cucharada de aceite vegetal", "½ cucharadita de cúrcuma molida", "2 cucharadas de leche de coco", "350 g / 12 oz de arroz jazmín, para servir", "8 hojas pandan (aproximadamente 2 por muslo de pollo)", "dash oil, para freír"], "method": ["En un tazón grande, combine todos los ingredientes, excepto las hojas de pandan, juntos y frote el adobo en la carne. Refrigere por 1 hora.", "Mientras tanto, enjuague el arroz hasta que el agua salga limpia y luego cocine según las instrucciones del paquete.", "Llene un recipiente de vidrio con agua hirviendo y remoje las hojas pandan durante 1 minuto para que sean más flexibles.", "Envuelva cada muslo de pollo en una hoja, asegurando firmemente con un palillo de cóctel.", "Calentar un wok grande a fuego medio con un chorrito de aceite. Freír los paquetes durante 6-8 minutos en cada lado, o hasta que estén cocidos.", "Sirve junto al arroz jazmín."], "url": "www_bbc_co_uk_food_recipes_chicken_in_pandan_leaves_22365", "title": "Pollo en hojas pandan", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de fenogreco", "2 vainas de cardamomo", "2 cucharadas de aceite vegetal", "2 cebollas en rodajas", "2 dientes de ajo, en rodajas", "2 pequeños chiles rojos de ojo de pájaro", "1 x 400g / 14oz de tomates picados en lata", "Jengibre de raíz de 2.5cm / 1in, pelado, rallado", "1 cucharada de cúrcuma molida", "250ml / 9fl oz de caldo de pollo", "1 cucharada de miel", "1 cucharada de salsa de soja", "150g / 5½ oz de harina natural, sazonado con sal y pimienta negra recién molida", "Pan rallado panko japonés de 200g / 7oz", "2 huevos de gallinas camperas", "4 pechugas de pollo, cortadas en tiras", "4 cucharadas de aceite vegetal", "3 zanahorias, en rodajas", "2 cebollas de primavera, picadas", "arroz basmati cocido, para servir"], "method": ["Para la salsa, freír las especias en una sartén seca durante 2-3 minutos, luego muele a un polvo en un mortero y una mano.", "Calentar el aceite en la misma sartén que se usa para freír las especias y freír las cebollas durante 8-10 minutos, o hasta que estén doradas. Agregue el ajo, el chile, los tomates picados, el jengibre y la cúrcuma.", "Llevar la mezcla a ebullición, luego agregar el caldo y cocinar a fuego lento durante 25 minutos.", "Deje que se enfríe un poco, luego mezcle la mezcla hasta que quede suave, luego agregue la miel y la salsa de soja. Mantener caliente", "Mientras tanto, para el curry katsu, espolvorea la harina y el pan rallado en platos separados. Batir los huevos en un tazón.", "Seca las piezas de pollo en la harina, luego sumérgelas en el huevo y cúbrelas con el pan rallado, sacudiendo cualquier exceso.", "Calentar el aceite en una sartén a fuego medio y freír las piezas de pollo durante 2-3 minutos en cada lado, o hasta que estén doradas. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Mientras tanto, cocine las zanahorias en rodajas en una olla con agua hirviendo durante 4-5 minutos o hasta que estén tiernas. Desagüe.", "Para servir, mezcle las zanahorias cocidas y las cebolletas en la salsa de curry. Coloque el arroz cocido sobre los platos para servir, espolvoree un poco de salsa y cubra con los pedazos de pollo frito."], "url": "www_bbc_co_uk_food_recipes_chicken_katsu_curry_48890", "title": "Flores de cerezo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_katsu_curry_48890_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pollo de 200g / 7oz (una grande o dos pequeñas)", "1 cucharada de aceite de oliva", "½ cucharadita de comino", "1 diente de ajo, rallado", "¼ cubo de caldo, disuelto en un vaso pequeño lleno de agua caliente", "1 limón, solo jugo", "2 flatbreads grandes o envolturas de tortilla", "4 cucharadas de hummus", "puñado de hojas de ensalada mixtas", "1 tomate en rodajas", "1 zanahoria, rallada", "Ramita de menta fresca (opcional)"], "method": ["Coloque las pechugas de pollo en una tabla de cortar y cubra holgadamente con una hoja de película adhesiva. Usando un rodillo o un mazo de carne, machaque la pechuga de pollo para aplanar las partes más gruesas de manera que la pechuga tenga un grosor relativamente uniforme. (Se cocinará más rápido).", "Mezcle el aceite de oliva, el comino, el ajo rallado, el jugo de la mitad del limón y un poco de pimienta negra en un recipiente y revuelva el pollo para cubrirlo por completo. Adorte las pechugas de pollo durante 10 minutos, si tiene tiempo. Mientras tanto, puedes preparar toda la ensalada que quieras poner.", "Calentar una sartén hasta que esté muy caliente. Levante las pechugas de pollo del adobo y permita que el exceso gotee. Cocine en la sartén caliente a fuego alto durante 2 minutos por cada lado.", "Agregue el stock: burbujeará rápidamente. Reduzca el fuego a medio y cubra parcialmente, cocine el pollo durante aproximadamente 5 minutos más o hasta que esté cocido (deberá sacarlo de la sartén y cortarlo para asegurarse de que esté cocido). Ponga las pechugas de pollo cocidas en un plato caliente y raspe todos los jugos en la parte superior.", "Para servir, caliente los panes planos en la sartén a fuego medio-alto por un minuto a cada lado hasta que estén calientes y un poco tostados. Coloque los panes planos en dos platos y reparta cada uno con algo hummous. Cortar el pollo en tiras finas y dividir entre los dos panes planos. Cubra con ensalada y salsas que le gusten y un chorrito de jugo de limón. Enrollar y servir."], "url": "www_bbc_co_uk_food_recipes_chicken_kebab_wrap_35076", "title": "Envoltura de kebab de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 bulbos de ajo, la parte superior cortada", "2 cucharadas de aceite de oliva", "225 g / 8oz de mantequilla sin sal, ablandada", "4 cucharadas de hojas de perejil frescas y planas picadas", "aceite vegetal, para freír", "4 pechugas de pollo sin piel, hueso de ala izquierda (pide a tu carnicero que haga esto por ti)", "75 g de harina común", "3 huevos de gallinas camperas, ligeramente golpeados", "Pan rallado panko japonés de 90 g / 3¼ oz", "1 pan ciabatta, cortado en 6 rebanadas", "4 cucharadas de aceite de oliva", "8 rebanadas de tocino", "250g / 9oz de queso con mucho sabor, rallado", "1 lechuga gema bebé, hojas separadas", "10g de hojas de sangre de toro", "1 manojo de cohete fresco", "1 cabeza radicchio rojo, hojas separadas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "200-300ml / 7-10fl oz de aceite sin sabor como el aceite vegetal"], "method": ["Para el pollo Kiev, precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque los bulbos de ajo en papel de aluminio y rocíe con el aceite y sazone con sal y pimienta negra recién molida. Doble la lámina de estaño para crear un paquete sellado. Asar en el horno durante 15-20 minutos, o hasta que estén suaves.", "Pon la mantequilla en un tazón. Exprima uno de los bulbos asados ​​de ajo de la piel, y agregue a la mantequilla con el perejil y mezcle. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque una hoja de película adhesiva sobre una superficie de trabajo limpia. Coloque la mantequilla de ajo en la película adhesiva, luego tire del borde de la película adherida sobre la mantequilla y moldee la mantequilla en forma de tronco. Gire los extremos de la película adhesiva para sellar y enfriar en la nevera durante al menos una hora o hasta que sea necesario.", "Caliente el aceite en una freidora a 160 ° C. Alternativamente, caliente el aceite en una olla profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras el aceite se calienta, corte cuidadosamente un bolsillo profundo en cada una de las pechugas de pollo, insertando el cuchillo en el extremo del hueso, justo debajo del hueso.", "Retire la película adhesiva de la mantequilla de ajo refrigerada y córtela en rodajas gruesas de 1 cm / ½ pulgadas. Rellene cada pechuga de pollo con unas rodajas de mantequilla de ajo, empujándolas en el pollo lo más posible.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Distribuye las migas de pan en otro plato. Espolvorea cada pechuga de pollo primero en la harina, luego sumérgete en el huevo batido, luego rueda en las migas de pan hasta que esté completamente cubierto.", "Baje cuidadosamente el pollo Kiev en el aceite caliente, dos a la vez, y fría durante 8-10 minutos, o hasta que el pan rallado esté dorado y el pollo esté bien cocido. Coloque el pollo Kiev a un lado en un plato forrado con papel de cocina para drenar y mantener caliente. Repita el proceso con los dos restantes de Kiev.", "Para los crotones de ajo y queso, caliente una sartén grande. Precalentar una parrilla a fuego alto.", "Rocíe la ciabatta cortada con aceite de oliva y coloque el lado cortado sobre la plancha y cocine durante 1-2 minutos.", "Mientras tanto, caliente una sartén mediana y agregue la panceta. Cocine a cada lado durante 1-2 minutos o hasta que estén crujientes.", "Retire el pan de la plancha y extiéndalo con el ajo tostado restante. Cubra con la panceta y el queso rallado. Ponga en una bandeja para hornear y a la parrilla hasta que el queso se haya derretido.", "Retírelo de la parrilla y cuando esté lo suficientemente frío como para cortarlo, póngalo a hornear en forma de crouton de 2 cm / 1 in y déjelo a un lado.", "Para la ensalada, coloque todas las hojas en un tazón grande y mezcle para combinar.", "En un tazón pequeño aparte, agregue el aceite, el vinagre, la mostaza y el batidor. Poco a poco agregue el aceite hasta que tenga una consistencia de aderezo. Justo antes de servir, agregue el aderezo a las hojas y mezcle. Agregue los croutons cortados en cubitos a la ensalada y vuelva a mezclar.", "Para servir, coloque un pollo Kiev en cada plato y una ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_kiev_with_a_21730", "title": "Pollo Kiev con una ensalada de temporada, crutones de ajo y queso", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["160g / 5½oz de mantequilla, suavizada", "2-3 dientes de ajo grandes, finamente picados", "4 cucharadas de perejil recién picado", "1 limón, ralladura fina y jugo solo", "sal y pimienta", "4 pechugas de pollo sin piel de corral", "6-8 cucharadas de harina común", "1-2 cucharaditas de pimentón molido", "2 huevos grandes de gallinas camperas, golpeados", "200g / 7oz de pan rallado seco", "aceite de girasol, para freír poco"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para hacer el relleno, mezcle la mantequilla con el ajo, el perejil, la ralladura de limón, el jugo de limón y una pizca de sal y pimienta, al gusto, en un tazón. Forme la mantequilla aromatizada en dos troncos, utilizando una película adhesiva para ayudarlo a enrollarse y rodar. Enfríe hasta que esté firme.", "Haga un bolsillo en cada pechuga cortando una barra a lo largo del pecho. Corta los troncos de mantequilla por la mitad y coloca una mitad en cada bolsillo de pollo. Seguro con palitos de cóctel.", "Mezcle la harina, el pimentón y un poco de sal y pimienta en un tazón poco profundo. Incline los huevos batidos en otro recipiente poco profundo y el pan rallado en un tercer recipiente poco profundo. Separe las pechugas de pollo rellenas en la harina para cubrirlas, luego en el huevo, volteándolas hasta cubrirlas. Repita la harina y el huevo una vez más, luego sumerja en las migas de pan y cubra completamente.", "Vierta el aceite en una sartén a una profundidad de aproximadamente 1 cm / ½ pulgada y ponga a fuego alto. Verifique que el aceite esté lo suficientemente caliente, y luego baje las pechugas de pollo con cuidado en la sartén. Ponga aceite caliente sobre la parte superior para sellar las migas durante aproximadamente un minuto. Voltee para dorar el otro lado, otra vez echando aceite por la parte superior hasta que se dore; esto debería tomar otros 1-2 minutos.", "Retire el pollo del aceite y colóquelo en una lata para asar poco profunda. Hornee el pollo en el horno durante 10-12 minutos, o hasta que los senos se sientan firmes cuando se presionen. Retire y escurra sobre papel de cocina. Retire con cuidado los palitos de cóctel y sirva."], "url": "www_bbc_co_uk_food_recipes_chicken_kievs_21151", "title": "Chicken kievs", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, ablandada", "2 dientes de ajo, pelados y rallados", "1 cucharada de sal de mesa", "½ cucharadita de pimienta de cayena", "3 cucharadas de perejil fresco picado", "2 grandes pechugas de pollo sin piel", "Harina normal 150g / 5½ oz", "2 huevos grandes de gallinas camperas", "Pan rallado panko japonés 150g / 5½ oz", "aceite vegetal, para freír poco", "pellizcar copos de sal marina"], "method": ["En un tazón, bata la mantequilla, el ajo, la sal, la pimienta de cayena y el perejil ablandados hasta que estén bien combinados. Coloque la mantequilla en una bolsa de plástico con una boquilla grande y lisa. Alternativamente, ponga la mantequilla en una bolsa de comida, tuerza la bolsa para empujar la mantequilla en una esquina y corte la punta.", "Con un cuchillo afilado, haga un \"bolsillo\" profundo y ancho en el extremo más grueso de cada pechuga de pollo, sin cortarlo completamente. Llene cada pechuga de pollo con tanta mezcla de mantequilla como sea posible.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Rompe las migas de pan con las manos o el pulso en un procesador de alimentos. Espolvorea las migas en otro plato.", "Una a una, espolvorea primero las pechugas de pollo en la harina, luego sumérgelas en el huevo y luego enróllalas en el pan rallado hasta que estén completamente cubiertas. Coloque las pechugas de pollo recubiertas en un plato, cúbralas, luego enfríelas en la nevera por al menos 20 minutos o hasta que las necesite.", "Cuando las pechugas de pollo se hayan enfriado, precaliente el horno a 200C / 400F / Gas 6.", "Calentar un poco del aceite vegetal a fuego medio bajo en una sartén antiadherente grande. Freír los Kievs de pollo durante 3-4 minutos por cada lado, o hasta que se doren por todas partes. Espolvorear con escamas de sal, luego transferir a una bandeja de asar y cocinar en el horno durante 10-15 minutos, o hasta que el pollo esté bien cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando la parte más gruesa de la carne se perfora con un pincho. ¡Recuerde no perforar el pollo hasta el centro de mantequilla!) Sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_kievs_69553", "title": "Chicken Kievs", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, preferiblemente de corral, sin piel", "150 g / 5½ oz de mantequilla, a temperatura ambiente", "manojo de perejil fresco, finamente picado", "3 dientes de ajo, aplastados", "2 cebollas tiernas, finamente picadas", "50g / 1¾oz Cheddar, rallado", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, golpeados", "3 cucharadas de harina común", "3 cucharadas de pan rallado dorado", "aceite de girasol, para freír", "2 pepinos, pelados, sin núcleo", "2 cebollas de primavera, picadas", "50g / 1¾oz crema agria", "1 cucharada de mayonesa", "pimentón grande pizca", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, duros, pelados, en rodajas"], "method": ["Para los kievs, corte cada pechuga de pollo por su lado más largo, casi cortando hacia el otro lado (el pecho debe abrirse como un libro). Coloque la pechuga de pollo abierta entre dos piezas de film transparente y aplaste con un rodillo. Dejar de lado. Repita con las tres pechugas de pollo restantes.", "Mezcle la mantequilla, el perejil, el ajo, las cebolletas y el queso rallado en un tazón. Divida este relleno en cuatro y forme cada porción en forma de salchicha. Dejar de lado.", "Vierta los huevos batidos en un recipiente y esparza la harina y el pan rallado en platos separados.", "Mientras tanto, para la ensalada, pele los pepinos en cintas finas usando un pelador de verduras y mezcle con las cebollas tiernas, la crema agria, la mayonesa y el pimentón. Sazone al gusto con sal y pimienta negra recién molida. Adorne con las rebanadas de huevo duro. Deja la ensalada a un lado hasta que esté lista para servir.", "Coloque una pechuga de pollo sobre una tabla de cortar, sazone con sal y pimienta negra recién molida, y coloque una porción de relleno en el medio. Enrolle el pollo muy apretado alrededor del relleno y luego sumerja la harina para cubrir el pollo de manera uniforme. Sumérgete en el huevo batido y luego rueda en las migas de pan. Repita con las pechugas de pollo restantes y el relleno.", "Calentar el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se vuelva dorada cuando se la deje caer. Alternativamente, use una freidora eléctrica de alta grasa calentada a 160 ° C / 325 ° F. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje desatendido). Nota: es importante que la temperatura del aceite no sea demasiado alta o que la parte exterior del pollo se queme antes de que se cocine el interior.", "Cocine el pollo durante unos 15 minutos hasta que el revestimiento esté dorado y crujiente y el pollo esté cocido (pruebe el pollo quitándolo a un plato y perforando con un pincho; los jugos se mantendrán limpios cuando el pollo esté cocido).", "Retire el pollo de la sartén con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina.", "Sirva los kievs de pollo con la ensalada de pepino al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_kiev_with_a_68028", "title": "Kiev de pollo con ensalada de pepino y cebolleta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de ghee", "2 puerros, cortados, rebanados", "2 tallos grandes de apio, cortados, cortados en cubitos", "1 hoja de laurel", "500ml / 17fl oz de caldo de pollo caliente, preferiblemente casero", "4 zanahorias, en rodajas", "1 bombilla pequeña de hinojo, hojas exteriores retiradas, carne picada", "250 g / 9 oz de champiñones, en rodajas", "600g / 1lb 5 oz de pollo asado sobrante cocinado", "gran puñado de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida", "Coliflor de 1.2kg / 2lb 10 oz, hojas exteriores eliminadas, florecillas cortadas en trozos de 5cm / 2in", "4 dientes de ajo, pelados y dejados enteros", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Calienta el ghee en una sartén a fuego medio. Agregue los puerros y fríalos durante 4-5 minutos, o hasta que estén suaves pero no dorados. Agregue el apio y la hoja de laurel y aumente el fuego a alto. Freír por 1-2 minutos.", "Agregue el caldo de pollo a la sartén y lleve a ebullición, luego agregue las zanahorias, el hinojo y los champiñones y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento la mezcla hasta que el volumen del líquido se haya reducido y espesado, y las verduras estén tiernas, alrededor de 12-15 minutos.", "Mientras tanto, para el aderezo, ponga la coliflor, los dientes de ajo y la mitad de la mantequilla en una cacerola grande con tapa. Agregue 4 cucharadas de agua y cubra.", "Haga que el contenido de la sartén hierva a fuego lento a fuego medio y caliente durante 6-8 minutos, o hasta que la coliflor esté tierna cuando se la atraviesa con un cuchillo (agregue un chorrito de agua adicional durante la cocción si es necesario). Retire del fuego y transfiera el contenido a un procesador de alimentos. Mezcle según la consistencia de su elección, ya sea suave y cremosa o rugosa. Sazone con sal y pimienta.", "Para terminar el relleno del pastel, retire la hoja de laurel y agregue los ingredientes de relleno restantes a la sartén. Condimentar con sal y pimienta. Revuelva bien, luego transfiera la mezcla a un plato para pastel a prueba de horno.", "Coloque la tarta sobre el relleno y extiéndala en una capa pareja con una espátula. Use un tenedor para crear un patrón entrecruzado en la parte superior del relleno. Coloca la parte superior del pastel con la mantequilla restante.", "Hornee durante 25-30 minutos, o hasta que el relleno esté burbujeante y el relleno esté dorado."], "url": "www_bbc_co_uk_food_recipes_chicken_leek_and_17968", "title": "Pastel de pollo, puerro y champiñones con relleno de puré de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_leek_and_17968_16x9.jpg", "isVegetarian": false, "recommendations": 0}]