[{"isVegetarian": false, "title": "Big kids’ raspberry blancmange", "url": "www_bbc_co_uk_food_recipes_big_kids_raspberry_43909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 gelatine leaves", "750g/1lb 10oz fresh raspberries", "100g/3½oz icing sugar", "1 heaped tbsp cornflour", "250ml/9fl oz full-fat milk", "1 tsp vanilla extract", "250ml/9fl oz double cream", "2-3 sprigs lemon verbena, leaves only, to decorate"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the gelatine leaves in a bowl of cold water for a few minutes, until softened.", "Meanwhile, blend 600g/1lb 5oz of the raspberries and all but 2 tablespoons of the icing sugar to a purée in a food processor. Strain the mixture through a fine sieve into a bowl, discarding the seeds.", "In a bowl, whisk the cornflour and the remaining icing sugar with 75ml/3fl oz of the milk to form a smooth, thick paste. Stir in the remaining milk and vanilla extract until smooth and well combined, then pour the mixture into a saucepan and heat until just simmering.", "Simmer for a couple of minutes until the mixture has thickened slightly, then squeeze the soaked gelatine leaves dry and add them to the mixture, stirring constantly until dissolved.", "Remove the pan from the heat and whisk in the double cream and 150ml/5fl oz of the raspberry purée until well combined.", "Pour the blancmange mixture into the moulds and chill in the fridge for at least 4 hours.", "When ready to serve, remove the moulds from the fridge and quickly dip them into a bowl of hot water to loosen the blancmange. Invert the moulds onto serving plates. Serve with the remaining raspberry purée, garnished with the remaining whole fresh raspberries and the lemon verbena leaves. "]}, {"isVegetarian": true, "title": "Biker’s cherry pecan brownies", "url": "www_bbc_co_uk_food_recipes_bikers_chocolate_46736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, plus extra for greasing", "175g/6oz caster sugar", "175g/6oz soft light brown sugar", "4 large free-range eggs", "100g/3½oz plain flour", "50g/1¾oz cocoa powder", "125g/4½oz plain dark chocolate ", "125g/4½oz white chocolate", "100g/3½oz shelled pecan nuts (or walnuts)", "70g/2½oz packet dried sour cherries  "], "serves": "Makes 16-20 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C (fan)/Gas 5. Lightly butter a 20x30cm/8x12in rectangle brownie or tray bake tin and line the base and sides with a large sheet of baking parchment. ", "Put the butter in a medium saucepan and place over a very low heat until only just melted. Remove the butter from the heat and stir in the sugars until well combined. Whisk the eggs in a large bowl until smooth and slowly pour the butter and sugar mixture on top, stirring constantly until well combined.", "Put the flour and cocoa powder in a sieve and sift on top of the egg and butter mixture. Beat hard with a wooden spoon until smooth. Leave to cool for 10 minutes. (This will prevent the chocolate chunks melting too quickly when they are added to the batter.)", "Put all the chocolate on a board and cut into chunky pieces with a large knife. You want the chunks to be around 1.5cm/¾in. Break the pecan nuts or walnuts in half. Stir the chocolate pieces, cherries and nuts into the cake batter. Pour into the prepared tin and spread to all the corners with a rubber spatula or the back of a spoon.", "Bake the brownie in the centre of the oven for 25-30 minutes, or until the mixture is crusty on the surface and lightly cooked inside.  Do not allow it to overcook as the cake will become spongy rather than gooey in the centre.", "Remove from the oven and leave to cool for 5-10 minutes. Take out of the tin and transfer to a board. Cut into squares or rectangles to serve warm or leave to cool completely if serving cold. This brownie should keep well for 3-4 days if well wrapped with foil – but we doubt it will last that long!"]}, {"isVegetarian": false, "title": "Bigos stew", "url": "www_bbc_co_uk_food_recipes_bigos_stew_69890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigos_stew_69890_16x9.jpg", "ingredients": ["50g/1¾oz butter", "1 onion, sliced", "1 tsp juniper berries, crushed", "½ tsp caraway seeds", "300g/10½oz lean pork belly, cubed", "1 tbsp brown sugar", "500g/1lb 2oz sauerkraut", "half a white cabbage, shredded", "200g/7oz fresh chopped tomatoes or 400g tin tomatoes", "500ml/18fl oz chicken or beef stock", "10g/¼oz dried mushrooms", "300g/10½oz smoked Polish sausage, such as kabanas, chopped", "1 apple, grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large casserole. Add the onion and sauté over a medium heat until the onion is softened and translucent. Sprinkle over the juniper berries and caraway, then add the pork. Sprinkle over the brown sugar. Turn the heat up high for a couple of minutes, turning the meat so it browns well. ", "Drain the sauerkraut well and give it a rinse if you want to reduce the vinegar flavour. The easiest thing to do is squeeze it out with your hands. Add to the casserole with the white cabbage and chopped tomatoes, then pour over the stock. Simmer for about 30 minutes.", "Soak the dried mushrooms in warm water. When they have softened, drain, adding their soaking liquor to the casserole. Chop the mushrooms finely and add these to the casserole, along with the sausage and apple. ", "Simmer for a further hour and a half and serve or cover overnight and reheat the following day. "]}, {"isVegetarian": false, "title": "Scotch broth", "url": "www_bbc_co_uk_food_recipes_bikers_scotch_broth_91406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bikers_scotch_broth_91406_16x9.jpg", "ingredients": ["75g/3oz pearl barley", "1.15kg/2½lb lamb shoulder", "2 litres/3½ pints cold water or lamb stock", "2 onions, chopped", "1 bay leaf", "bunch fresh thyme", "2 carrots, cut in 2.5cm/1in pieces", "2 turnips, cut in 2.5cm/1in pieces (optional)", "2 celery stalks, trimmed, cut in 2.5cm/1in pieces", "1 heaped tsp sea salt flakes, plus extra to taste", "2 potatoes, cut in 2.5cm/1in pieces", "½ savoy cabbage, trimmed, cored and finely shredded", "handful fresh parsley, roughly chopped", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pearl barley into a bowl and cover with cold water. Set aside to soak.", "Meanwhile, pace the lamb in a large saucepan or flameproof casserole and cover with the cold water or lamb stock. Bring to a simmer and skim off the scum. Add the onion, bay leaf and thyme to the pan. Return to a gentle simmer and cook for one hour, skimming occasionally.", "Add the carrots, turnips and celery to the casserole with the lamb. Season with the salt and freshly ground black pepper. Bring to a very gentle simmer, cover with a lid and cook for 30 minutes. ", "After the vegetables and lamb have been simmering for 30 minutes, rinse the pearl barley in a sieve under cold running water. Turn the lamb over. Add the pearl barley and potatoes to the casserole. Cook gently for a further 30 minutes, uncovered. ", "Stir in the cabbage and return to a gentle simmer. Continue cooking uncovered for a further 15 minutes or until the lamb is very tender and is falling off the bone and the barley is softened. Remove the pan from the heat", "Lift the lamb out of the pot with tongs or a large fork and put on a board. Carve off all the meat, slicing or tearing into largish chunks and discarding any skin and bone. Season the broth with more salt and pepper to taste and spoon into large, deep plates. Divide the lamb between the plates and sprinkle with freshly chopped parsley. "]}, {"isVegetarian": false, "title": "Bill Granger's caramel chicken", "url": "www_bbc_co_uk_food_recipes_billgrangerscaramelc_73143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken thigh fillets, skinless, chopped in half", "1 tbsp vegetable oil", "1 red onion, sliced ", "3 garlic cloves, sliced", "55ml/2fl oz dark soy sauce", "110g/4oz brown sugar", "55ml/2fl oz Thai fish sauce", "steamed rice, to serve", "steamed green vegetables, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken and oil in a bowl and toss to combine. Heat a large frying pan over a high heat until hot. Add half the chicken and cook for two minutes on one side until lightly browned, turn and cook for another minute. Remove from the pan and repeat with the remaining chicken. ", "Reduce the heat to medium and add a little extra oil if needed. Add the onion and garlic and cook for five minutes, stirring occasionally. Return the chicken to the pan, season liberally with black pepper, add the soy sauce and stir to combine. ", "Cover the pan, reduce heat to low and cook for 10 minutes, stirring occasionally. Increase the heat to high, add the sugar and stir to combine. Cook uncovered for 3-4 minutes, or until the sauce is rich, dark and syrupy.", "Add the fish sauce and stir to combine. Place in a serving dish and serve with steamed rice and green vegetables."]}, {"isVegetarian": false, "title": "Sausage rolls", "url": "www_bbc_co_uk_food_recipes_bigsausagerolls_86258", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigsausagerolls_86258_16x9.jpg", "ingredients": ["30g/1oz butter", "100g/3½oz button mushrooms, finely chopped ", "1 tbsp Worcestershire sauce", "1 tbsp Tabasco sauce", "1 tbsp dried thyme", "450g/1lb sausage meat (you can easily push the meat out from the skins of readymade sausages)", "salt and freshly ground black pepper ", "450g/1lb ready-rolled puff pastry", "1 free-range egg, beaten"], "serves": "Makes 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a large frying pan and fry the mushrooms until soft. Transfer to a large bowl.", "Add the Worcestershire sauce, Tabasco sauce, thyme and sausage meat and season well with salt and freshly ground black pepper. Mix until thoroughly combined.", "Roll the puff pastry out into a large rectangle, then cut into two long rectangles.", "Place a layer of sausage meat mixture down the middle of each pastry rectangle, then brush each with beaten egg on one edge.", "Fold the other side of the pastry over onto the egg-washed edge. Press down to seal and trim any excess. Cut each pastry roll into 8-10 small sausage rolls.", "Place the sausage rolls onto a baking tray and transfer to the oven to bake for 15-20 minutes, or until crisp and golden and the sausage meat is completely cooked through."]}, {"isVegetarian": false, "title": "Bill's spicy sausage pasta", "url": "www_bbc_co_uk_food_recipes_billsspicysausageand_73069", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/billsspicysausageand_73069_16x9.jpg", "ingredients": ["4 Italian sausages", "2 tbsp olive oil", "1 red onion, cut into wedges", "2 garlic cloves, crushed", "400g tin chopped tomatoes", "1 red pepper, cut into strips", "½ tsp chilli flakes", "2 tsp dried oregano", "2 tbsp chopped fresh parsley, optional", "200g/7oz whole wheat fusilli, or pasta of your choice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put a medium non-stick pan over a high heat and brown the sausages in 1 tablespoon of olive oil. Set the browned sausages to one side.", "Reduce the heat to a medium flame and sweat the onions and garlic in the remaining oil for 2 minutes. Add the tomatoes, red pepper, chilli, oregano and sausages to the pan. Simmer covered until the red peppers soften (this should take about 10 minutes).", "Cook the fusilli until al dente (with a bite) according to the manufacturer's instructions.", "Drain the pasta well and put into two bowls with the sauce. Serve with a scatter of chopped parsley over the top."]}, {"isVegetarian": true, "title": "Bircher muesli", "url": "www_bbc_co_uk_food_recipes_bircher_muesli_70498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bircher_muesli_70498_16x9.jpg", "ingredients": ["1 apple", "50g/1¾oz rolled oats", "40g/1½oz raisins", "1 tbsp sunflower seeds", "1 tbsp chia seeds", "125ml/4fl oz cashew milk (or other plant-based milk)", "1 tbsp maple syrup, date syrup or honey (optional)", "handful of blueberries, raspberries or strawberries (optional)"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Grate the apple into a large bowl and discard the core. ", "Add the oats, raisins, seeds and cashew milk and mix well. Add the syrup and berries, if using, and mix again. ", "Transfer the mixture to an airtight jar, seal and refrigerate for at least 6 hours, or up to 3 days. This allows the oats to absorb the milk. Return to room temperature before serving."]}, {"isVegetarian": true, "title": "Muesli", "url": "www_bbc_co_uk_food_recipes_birchermuesli_88972", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/birchermuesli_88972_16x9.jpg", "ingredients": ["100g/7oz oats", "25g/1oz dried apricots, chopped", "25g/1oz dried prunes, chopped", "1 tbsp pumpkin seeds", "1 tbsp sunflower seeds", "fresh berry fruits, to serve", "milk, yoghurt or fruit juice, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the oats, dried apricots, dried prunes, pumpkin seeds and sunflower seeds together and spoon into a serving bowl.", "To serve, scatter over a handful of fresh berry fruits and pour over the milk, yoghurt or fruit juice."]}, {"isVegetarian": false, "title": "Biscotti with hot mocha dipping sauce", "url": "www_bbc_co_uk_food_recipes_biscotti_with_hot_mocha_60995", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/biscotti_with_hot_mocha_60995_16x9.jpg", "ingredients": ["250g/9oz plain flour (280g/10oz plain flour, if making the chocolate biscotti)", "½ tsp baking powder", "250g/9oz caster sugar", "3 free-range eggs, beaten", "220g/8oz shelled and chopped pistachios", "125g/4½oz dried cranberries, chopped", "1 lemon, zest only", "200g/7oz shelled and chopped hazelnuts", "125g/4½oz dates, chopped", "1 lemon, zest only", "50g/1¾oz melted dark chocolate, cooled to tepid temperature", "25g/1oz chocolate chips\t", "35g/1¼oz chopped almonds", "1 orange, zest only", "½ tsp vanilla essence ", "150g/5½oz good-quality dark chocolate", "150ml/5fl oz double cream", "100ml/3½fl oz espresso coffee", "100g/3½oz small marshmallows", "100ml/3½fl oz honey"], "serves": "Makes 20 portions per base recipe", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the biscotti base, preheat the oven to 160C/325F/Gas 3 (do not use the fan on your oven).", "Mix together the flour, baking powder and sugar in a bowl and add the eggs slowly to make a dough.", "For the pistachio and cranberry biscotti, add the nuts, cranberries and lemon zest at this point. ", "For the hazelnut and date biscotti add the nuts, dates and lemon zest at this point. ", "For the chocolate, almond and orange biscotti, add the tepid melted chocolate to the base dough and mix in thoroughly before adding the chocolate chips, almonds, orange zest, and vanilla essence.", "Knead the mixture gently and then separate and roll into two logs. Place on a lined baking tray and bake for 25 minutes in the preheated oven.", "Cool slightly and cut into 1-2cm/½-¾in thick slices.", "Return to the tray to the oven and bake for another 10-15 minutes, turn over and continue to bake for another 10-15 minutes until golden-brown. ", "For the mocha sauce, combine all ingredients in a heavy-based saucepan and heat them gently, stirring constantly until all the marshmallows and chocolate have melted. ", "Serve the hot mocha sauce in a cup with the biscotti on the side to dunk in."]}, {"isVegetarian": true, "title": "Biscotti with limoncello", "url": "www_bbc_co_uk_food_recipes_biscotti_with_limoncello_55604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz caster sugar", "3 unwaxed lemons, zest and juice", "350ml/12fl oz eau-de-vie (colourless fruit liqueur), 40-80% proof, or vodka", "250g/9oz plain flour", "250g/9oz caster sugar", "1½ tsp baking powder", "2 free-range eggs, lightly beaten", "90g/3¼oz sultanas", "90g/3¼oz raisins", "90g/3¼oz dried sour cherries", "115g/4oz dried apricots, roughly chopped", "1 lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the limoncello, heat the sugar and 75ml/5 tbsp water in a saucepan over a medium heat. Stir to dissolve the sugar. ", "Bring the mixture up to the boil, then simmer briskly for 3-4 minutes until the bubbles look syrupy. Remove from the heat and leave to cool. ", "Add the lemon zest and juice to the syrup while it is still slightly warm. Then add the eau-de-vie or vodka. ", "Pour the limoncello into a sterilised bottle or jars and seal. Leave in a cool, dark place for 24 hours, shaking occasionally, then strain into a clean bottle.", "Put in the freezer for several hours before serving. The liqueur is best served in frozen shot glasses.", "Method for biscotti, preheat the oven to 180C/350F/Gas 4 and line a baking tray with parchment.", "Mix the flour, sugar and baking powder together in a large bowl. ", "Add half the beaten eggs and mix well, then add half of what’s left and mix again.", "Now add the last quarter a little bit at a time until the dough takes shape but isn’t too wet (you may not need to use all the eggs). ", "Add the dried fruit and lemon zest and mix well.", "Divide the dough in half, and each half into a sausage shape and place on the baking tray, leaving at least a 6cm/2½in gap between them.", "Lightly flatten the ‘sausages’, then bake for 20-30 minutes until golden brown.", "Remove from the oven and leave for 10 minutes to cool and firm up.", "Turn the oven down to 150C/300F/Gas 2.", "Once cooled move the cooked biscotti dough onto a cutting board. Using a serrated knife, cut the biscotti on an angle into 5mm/¼in slices.", "Lay the slices on the baking tray. Return to the oven and cook for eight minutes, then turn the slices over and cook for a further 10-15 minutes or until pale golden brown.", "Remove from the oven and cool the biscotti on wire racks. ", "To serve, pile the biscotti onto a plate and serve with a shot of limoncello."]}, {"isVegetarian": true, "title": "Biscuit and banana bake", "url": "www_bbc_co_uk_food_recipes_biscuit_and_banana_bake_18797", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 amaretti biscuits, crumbled ", "6 shortbread biscuits, crumbled", "3-4 bananas, sliced ", "150ml/5fl oz almond liqueur, such as amaretto ", "50g/1¾oz salted butter", "2 tbsp soft light brown sugar", "150g/5½oz whole almonds, toasted and roughly chopped ", "250g/9oz crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. ", "Roughly crumble nearly all the biscuits into individual ramekins. Set the remainder aside. Slice the banana and spread out over the top of each dish. Pour over the liqueur, dot with butter and sprinkle with sugar.  ", "Bake for 25 minutes, basting frequently. ", "Scatter over the toasted and chopped almonds and some more crumbled biscuits. Serve with crème fraiche."]}, {"isVegetarian": true, "title": "Bitter chocolate and coffee mousse cake served with a coffee anglaise", "url": "www_bbc_co_uk_food_recipes_bitter_chocolate_and_38429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz caster sugar", "2 free-range eggs", "75g/2½oz plain flour, sifted", "20g/1oz butter, melted and cooled", "8 tbsp coffee liqueur", "100g/3½oz dark chocolate, melted", "1 leaf gelatin, soaked in cold water for five minutes", "4 tbsp instant coffee, dissolved in 4 tbsp boiling water", "2 tbsp icing sugar", "2 free-range eggs, separated ", "300ml/10fl oz double cream, softly whipped", "2 free-range egg whites", "175g/6oz chocolate (70% cocoa solids), chopped", "1 free-range egg yolk", "4 free-range egg whites", "25g/1oz caster sugar", "275ml/9¾oz double cream", "1 tbsp instant coffee granules", "3 free-range eggs, yolks only", "2 tbsp caster sugar", "1 tbsp cornflour", "100g/3½oz dark chocolate (70% cocoa solids)", "40g/1½oz caster sugar", "60ml/4 tbsp double cream", "sweetened cocoa powder, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 18 x 30cm/7 x 12in flat baking trays with baking parchment.", "For the sponge cake, beat together the caster sugar and eggs until the mixture is pale and fluffy and the mixture forms ribbons on the surface when drizzled. Fold in the plain flour, then pour in the melted butter and fold through. ", "Pour the mixture onto the lined baking trays and bake for 8-10 minutes, or until golden-brown. Remove from the oven and allow to cool. Once cold, peel off the baking parchment and use a 7cm/2¾in cutter to cut eight discs. ", "Place a disc of sponge into the bottom of a chefs’ ring set on each of four serving plates. Drizzle over a tablespoon of coffee liqueur on each disc. Leave to soak and then brush with a little of the melted chocolate. ", "For the coffee mousse, squeeze out the excess water from the gelatin leaves and stir into the hot coffee.", "Whisk together the icing sugar and egg yolks in a bowl until pale and fluffy. Fold the coffee mixture into the egg yolk mixture. Fold in the whipped cream.", "In a clean mixing bowl, whisk the egg whites until stiff peaks form when the whisk is removed.  Fold the egg whites into the coffee mousse. ", "Pour the coffee mousse onto the soaked bases until the chefs’ rings are half-filled. Soak the remaining discs of sponge in the remaining coffee liqueur and then place on top of the mousse.  Brush with a little more dark chocolate and then make the chocolate mousse.", "For the chocolate mousse, place the chopped chocolate in a bowl set over a pan of gently simmering water. Once melted, remove from the heat and allow to cool slightly. Beat in the egg yolk. ", "In a clean bowl, whisk the egg whites until soft peaks form when the whisk is removed. Gradually whisk in the sugar, a little at a time, until stiff and glossy peaks form. ", "Once the chocolate has cooled to body temperature, fold the egg whites into the chocolate. Spoon the mousse into a piping bag and then pipe it on top of the cakes. Place in the fridge to set. ", "For the coffee anglaise, heat the cream in a saucepan with the coffee granules. ", "In a large bowl, mix together the egg yolks, cornflour and caster sugar, then pour in the hot coffee cream, whisking all the time. Return the mixture to a clean saucepan and place over a low heat.  Stir continuously until the custard has thickened and coats the back of a spoon. Pour into a bowl and set aside to cool. Chill in the fridge.", "For the chocolate sauce, place the chocolate sauce ingredients with five tablespoons water into a saucepan and heat gently.  When all the ingredients have melted, pour into a squeezy bottle or a bowl and allow to cool. ", "Once ready to serve, use a blowtorch to warm the ring around the mousse stack making it easy to remove. Dust the tops with sweetened cocoa powder. Drizzle with a little of the chocolate sauce and serve the cold coffee anglaise in a jug alongside. "]}, {"isVegetarian": false, "title": "Bitterballen", "url": "www_bbc_co_uk_food_recipes_bitterballen_57810", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bitterballen_57810_16x9.jpg", "ingredients": ["2 tbsp olive oil", "300g/10½oz minced pork", "½ onion, very finely chopped", "1 carrot, grated", "vegetable oil, for frying", "1 tsp grated nutmeg", "2 tbsp finely chopped fresh parsley", "1 lemon, juice and zest", "salt and freshly ground black pepper", "50g/1¾oz butter", "75g/2¾oz plain flour", "225ml/8fl oz full-fat milk, warmed", "2 free-range eggs, beaten", "125g/4½oz breadcrumbs"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the minced pork for 4-5 minutes, or until browned all over. Remove the pork from the pan and set aside.", "Add the onion and carrot to the pan and fry for 4-5 minutes. Remove from the pan and add to the fried pork. Set aside to cool.", "Stir in the nutmeg, parsley and lemon juice and zest and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, melt the butter in a saucepan, stir in the flour and cook for 2-3 minutes. Gradually stir in the warm milk to form a thick sauce.", "Add the sauce to the meat mixture and mix until well combined. Set aside to cool.", "Once cool, divide the mixture into small balls.", "Beat the eggs in a bowl and sprinkle the breadcrumbs onto a plate.", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the balls into the egg, then coat in the breadcrumbs. Fry the balls for 3-4 minutes, or until golden-brown. Remove the balls from the pan and set aside to drain on kitchen paper.", "Serve with chutney and pickled onions."]}, {"isVegetarian": true, "title": "Black badger brownies", "url": "www_bbc_co_uk_food_recipes_black_badger_brownies_04899", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_badger_brownies_04899_16x9.jpg", "ingredients": ["handful raisins", "1 tbsp dark rum", "200g/7oz dark chocolate (minimum 70% cocoa solids)", "125g/4½oz unsalted butter", "400g tin carlin peas, drained and rinsed", "3 free-range eggs (preferably organic)", "150g/5oz soft brown sugar", "1½ tsp cocoa powder"], "serves": "Makes 16 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the raisins in the rum for 3 hours, or preferably overnight.", "Preheat the oven to 170C/150C Fan/Gas 3½. Grease and line a 20cm/8in square brownie tin with baking paper.", "Melt the chocolate and butter together in a heatproof bowl placed over simmering water, ensuring the bowl doesn't touch the water. Stir to combine and set aside to cool slightly.", "Blend the peas to a purée in a food processor. Add the eggs, sugar and cocoa powder and blend until smooth. Pour in the chocolate mixture and  blend until smooth. Add the raisins and their soaking liquor and pulse until combined", "Pour into the prepared brownie tin, bake for 20–25 minutes until set, but still a bit squidgy. Allow to cool completely in the tin before cutting."]}, {"isVegetarian": true, "title": "Black banana cake", "url": "www_bbc_co_uk_food_recipes_black_banana_cake_52982", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_banana_cake_52982_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "175g/6oz sugar (half light muscovado, half golden caster) ", "75g/2½oz hazelnuts", "2 free-range eggs", "175g/6oz self-raising flour ", "2 very ripe bananas (about 250g/9oz total weight)", "drop vanilla extract", "175g/6oz good-quality dark or milk chocolate chips", "a little demerara sugar"], "serves": "Serves at least 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line the base and sides of a 20cm x 12cm/8in x 5in loaf tin with baking parchment.", "Beat the butter and sugars until light and coffee-coloured. This is best achieved in a food mixer. ", "Toast the hazelnuts, rub them in a tea towel to remove their skins, then grind quite finely. ", "Slowly add the eggs to the butter and sugar mixture, then mix in the toasted ground hazelnuts and self-raising flour. ", "Peel the bananas and chop them the small pieces. Gently fold the vanilla extract, the bananas and the chocolate chips into the cake mixture, turning gently and taking care not to overmix. ", "Scoop the cake batter into the prepared loaf tin. Dust with a little demerara sugar. Bake for between 1 hour and 1 hour 10 minutes, covering the cake with foil if the top starts to darken too quickly. "]}, {"isVegetarian": true, "title": "Black bean and brown rice bowl with poached eggs", "url": "www_bbc_co_uk_food_recipes_black_bean_and_smoke_29105", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_smoke_29105_16x9.jpg", "ingredients": ["110g/3½oz brown rice, rinsed", "1 tbsp olive oil", "1 x 400g tin black beans, drained and rinsed ", "2 tsp smoked paprika", "1 tsp white wine vinegar", "2 free-range eggs", "50g/2oz spinach ", "1 avocado, halved and sliced", "60g/2oz feta, crumbled", "1 lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil, add the rice and simmer for 30-40 minutes, until tender. Drain and set aside. ", "Place a little olive oil in a small pan, add the black beans and warm through over a low to medium heat. Stir through the smoked paprika.", "Meanwhile, bring another pan of water to the boil, reduce to a simmer and add the white wine vinegar. Gently crack the eggs in one at a time, as close to the water as possible, and poach on a low simmer for 3 minutes. ", "While the eggs are cooking, add the spinach to the beans and wilt for 2 minutes then season with salt and pepper. ", "Place the cooked rice in a large bowl, add the spinach and black beans and mix to combine. Spoon the mixture into two serving bowls and top with the poached eggs, slices of avocado and crumbles of feta. Add lemon juice, salt and pepper to taste. "]}, {"isVegetarian": true, "title": "Black bean and avocado salad", "url": "www_bbc_co_uk_food_recipes_black_bean_and_avocado_32747", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_avocado_32747_16x9.jpg", "ingredients": ["4 tbsp lime juice ", "7 tbsp extra virgin olive oil ", "3-4 jalapeño peppers (or 1 red chilli), finely chopped, to taste", "1 garlic clove, minced", "pinch ground cumin", "salt and freshly ground black pepper", "3 x 400g tins cooked black beans, drained", "large handful chopped fresh coriander", "4 medium tomatoes, chopped into wedges, seeds removed (or 16 cherry tomatoes, halved)", "1 large red pepper, stalk and seeds removed, sliced into thin strips", "1 red onion, thinly sliced", "5 spring onions, trimmed and thinly sliced (or 1 small red onion, thinly sliced)", "200g/7oz fresh watercress, tough stems snipped into half", "2 large ripe avocados, skin and seeds removed, cut into cubes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all of the dressing ingredients in a jam jar, replace the lid and shake until well combined. Season with salt and pepper. Add more chilli if desired.", "For the salad, rinse the black beans under cold running water and drain. Put in a large mixing bowl and pour over half of the dressing.", "Add the remaining salad ingredients, apart from the watercress and avocado and stir well to combine.  ", "To serve, divide the watercress among 4 serving plates. Spoon the salad on top, then cover with the avocado cubes. Drizzle a little more dressing over each portion. "]}, {"isVegetarian": false, "title": "Black bun", "url": "www_bbc_co_uk_food_recipes_black_bun_66755", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bun_66755_16x9.jpg", "ingredients": ["300g/10½oz plain flour", "75g/3oz lard, cubed", "75g/3oz butter, cubed", "pinch of salt", "½ tsp baking powder", "1 free-range egg, beaten, for glazing", "200g/7oz plain flour", "300g/10½oz raisins", "300g/10½oz currants", "½ tsp ground ginger", "½ tsp ground cinnamon", "½ tsp ground allspice", "½ tsp mixed spice", "¼ tsp ground black pepper", "100g/3½oz dark muscovado sugar", "100g/3½oz mixed peel, chopped", "½ tsp bicarbonate of soda", "2 tbsp whisky", "1 free-range egg ", "3 tbsp buttermilk"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, sift the flour into a bowl and rub in the lard and butter until the mixture resembles breadcrumbs.  Add the salt, baking powder and four tablespoons of cold water and mix to a soft dough. Turn out and knead into a ball. Wrap in cling film and leave to chill in the fridge while you make the filling.", "Preheat the oven to 180C/350F/Gas 4 (fan 160C).", "For the filling, mix all the ingredients together in a large bowl. ", "Line a 900g/2lb loaf tin with baking parchment. On a lightly floured surface, roll out two thirds of the pastry to a rectangle large enough to line the tin.  Drape into the tin and press up against the sides. Spoon the filling into the tin, pressing down to compress. ", "Roll out three quarters of the remaining pastry to a rectangle large enough to cover the tin. Dampen the edges of the pastry with water and press the pastry lid on top to seal. Trim the edges and crimp using the tines of a fork. Roll out the remaining pastry, along with any trimmings, and use to make a bow to decorate the top, then attach with a little water. ", "Glaze with beaten egg and bake for two hours. Remove from the oven and leave to cool in the tin before turning out. "]}, {"isVegetarian": true, "title": "Black cherry and hazelnut jam", "url": "www_bbc_co_uk_food_recipes_black_cherry_and_47093", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_cherry_and_47093_16x9.jpg", "ingredients": ["400g/14oz fresh cherries", "200g/7oz (about 2) Bramley apples", "350g/12oz granulated or caster sugar", "1 small lemon, juice only", "50g/2oz chopped, roasted hazelnuts"], "serves": "Makes about 600ml/20fl oz (about 2 jam jars)", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the cherries (either pitted, whole or halved) into a saucepan and cover with 500ml/18fl oz water. Bring to the boil, then cook until the cherries are very tender and the water almost evaporated.", "Peel and grate the Bramley apples, minus the core and pips, and add the grated apple to the pan. Boil again until the apple threads are very soft and falling apart and the liquid has almost disappeared.", "Add the sugar and lemon juice, bring to the boil and cook until the preserve reaches 105C/220C on a sugar thermometer. Stir in the hazelnuts towards the end of cooking.", "Leave to cool for a few minutes, then pour into hot clean jars and seal immediately.", "Leave the jam until the following day before eating, and after opening keep in the refrigerator."]}, {"isVegetarian": false, "title": "Black cod with saikyo miso and sesame spinach", "url": "www_bbc_co_uk_food_recipes_black_cod_with_miso_38131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 black cod fillets, about 150–200g/5½–7oz each, pin-boned", "4 stalks hajikami or 50g/1¾oz pickled ginger, to serve", "50g/1¾oz lotus root or taro chips, to serve, optional", "50ml/2fl oz sake", "100ml/3½fl oz mirin", "400g/14oz white miso paste", "125g/4½oz caster sugar", "200ml/7fl oz dashi stock or fish stock", "2 tbsp dark soy sauce", "1 tbsp caster sugar", "500g/1lb 2oz large leaf spinach", "50g/1¾oz sesame seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the saikyo miso, put the sake, mirin, miso paste and sugar in a medium saucepan and bring to the boil over a high heat. Cook for a few minutes, until the sugar has dissolved. Leave to cool to room temperature. ", "Put the cod in a bowl and cover with the saikyo miso (reserving a little to garnish). Cover and leave to marinate at room temperature for 2–3 hours. ", "When you're ready to cook the cod, preheat the oven to 220C/200C Fan/Gas 7. Heat an ovenproof frying pan over a medium heat. Lift the fish fillets out of the marinade and cook them skin side-down in the pan for 2 minutes. Turn the fish over and roast in the oven for 6–8 minutes, or until cooked through and blackened.", "Meanwhile, for the sesame spinach, bring the dashi stock to the boil in a large saucepan and add the soy sauce and sugar. Once the sugar has dissolved, add the spinach, stir and turn off the heat. Toast the sesame seeds in a dry frying pan until golden, then crush using a mortar and pestle. Drain the spinach, reserving the liquid, and squeeze out any excess moisture. Mix the spinach with almost all the toasted seeds and a little of the cooking liquor.", "To serve, gather the spinach into a ball and top with the remaining sesame seeds. Serve with the cod and hajikami, with a few drops of the reserved saikyo miso on each plate."]}, {"isVegetarian": false, "title": "Black cod with red onion jam and charred lettuce", "url": "www_bbc_co_uk_food_recipes_black_cod_with_red_onion_62871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz liquorice liqueur", "2 tbsp honey", "100ml/3½fl oz prosecco", "½ lemon, peel only (reserve the juice for dressing the lettuce)", "5g chocolate mint leaves, chopped", "1 chilli, seeds removed, cut in half lengthways", "15g tarragon", "4 x 140g/5oz Alaskan black cod fillets", "salt and freshly ground black pepper", "500g/1lb 2oz red onion, chopped (about 6 onions)", "125g/4½oz caster sugar", "20g/¾oz cooked beetroot, chopped", "50ml/2fl oz red wine vinegar", "2 Little Gem lettuce, cut into quarters", "2 tbsp extra virgin olive oil", "handful pea shoots"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the black cod, prepare the marinade the day before you want to eat. Add the liquorice liqueur, honey, prosecco, lemon peel, chocolate mint leaves, chilli and tarragon to large bowl and mix to combine. Add the cod fillets and marinate in the fridge overnight. The next day, remove the cod and discard the marinade. Season the fish with salt and pepper. Set aside until ready to cook.", "For the red onion jam, put the onions, caster sugar, beetroot and vinegar in a pan and simmer over a low heat for approximately 45 minutes. Once the mixture resembles a thin jam, use a spatula to pass it through a strong sieve to remove lumps. Set aside to cool.", "To cook the fish, preheat the grill to a low-medium heat. Grill the cod for 15-20 minutes, or until nicely glazed and firm", "To serve, char the lettuce using a chef’s blow torch then dress with olive oil and the reserved lemon juice.", "Spoon some onion jam onto each plate and top with the cod. Put the lettuce alongside and dress the plate with pea shoots. Serve immediately."]}, {"isVegetarian": true, "title": "Black Forest cupcakes", "url": "www_bbc_co_uk_food_recipes_black_forest_cupcakes_02412", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_cupcakes_02412_16x9.jpg", "ingredients": ["125g/4½oz butter, softened", "175g/6oz caster sugar", "2 free-range eggs", "200g/7oz self-raising flour", "2 tbsp cocoa powder", "125ml/4fl oz milk", "100g/3½oz dark chocolate (minimum 70% cocoa solids), melted, plus extra to serve", "1 x 360g/12½oz  jar black cherries in kirsch", "½ tsp arrowroot or cornflour mixed with a little water to make a smooth paste", "300ml/10fl oz double cream, lightly whipped"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line a 12-hole muffin tray with paper cases.", "Beat the butter and sugar together in a bowl until light and creamy. Gradually add the eggs, one at a time, until well combined.   Sift in the flour and cocoa powder and mix until well combined.  Fold in the milk and melted chocolate.  ", "Spoon or pipe the mixture into the muffin cases and bake for 18-20 minutes, or until well risen and springy to the touch.", "Remove the cakes from the tin and set aside to cool on a cooling rack.", "Drain the cherries in a sieve collecting the kirsch in the bowl below.  Pierce the cakes with a skewer and carefully pour about a teaspoon of the kirsch over each cake.  ", "Heat the kirsch and arrowroot paste in a small saucepan until just boiling. Remove the pan from the heat and beat until thickened. ", "Using a small knife make a well in the top of each cake by removing a disk of cake", "Pipe or spoon a swirl of cream onto the cakes, top with a few cherries and drizzle with the thickened kirsch. Just before serving, grate over some chocolate."]}, {"isVegetarian": true, "title": "Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_black_forest_gateau_43895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gateau_43895_16x9.jpg", "ingredients": ["225g/8oz butter, softened, plus extra for greasing", "225g/8oz caster sugar", "160g/5½oz  self-raising flour", "65g/2¼oz cocoa powder", "½ tsp baking powder", "4 medium eggs", "340g/11¾oz jar of morello cherry jam", "2 x 80g/2¾oz packs of sweetened dried sour cherries", "2–3 tbsp Kirsch", "100ml/3½fl oz cherry brandy (ideally morello cherry brandy)", "500ml/18fl oz double cream", "50g/2oz dark chocolate, coarsely grated", "fresh cherries, to decorate"], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190°C/375F/Gas 5. Grease 2 x 20cm/8 in loose-based sandwich tins and line the bases with baking parchment.", "Put the butter, sugar, flour, cocoa powder, baking powder and eggs into a food processor and blend until smooth and thick. You may need push the mixture down from the sides a couple of times to make sure the mixture is well blended.", "Divide the batter between the prepared cake tins and spread it out evenly with a rubber spatula. ", "Bake for 22–25 minutes or until the cakes are nicely risen and just beginning to shrink away from the sides of the tins. Remove them from the oven and cool for 5 minutes before turning out on to a wire rack. Take off the lining paper and leave the cakes to cool. ", "When the cakes are cold, cut them in half, horizontally, with a long-bladed serrated knife. Take care to keep the knife parallel to the work surface, to get a good even cut. Place the cakes back on the wire rack or a board, cut sides up.", "For the filling, put the jam in a saucepan with the sour cherries and Kirsch and place over a low heat. Bring to a gentle simmer and cook for 6–8 minutes, stirring, until the jam has melted and the cherries are beginning to swell. Leave to cool for 15 minutes.", "Sprinkle the cherry brandy over the chocolate sponges, then spread three of them with the sour cherry mixture and leave to cool. Make sure that the sponge without the cherry topping is from the top half of a cake. ", "Whip 300ml/10fl oz of the cream with an electric hand-whisk until soft peaks form.", "Transfer one of the sponges (with the cherry topping) very carefully to a cake stand or plate – slide a cake tin base under the sponge to help you. Using a couple of pudding spoons, dollop about a third of the whipped cream gently on top of the cherry mixture. There is no need to spread it out, but try to keep the spoonfuls evenly spaced over the cake. Sprinkle with a little of the grated chocolate.", "Top with another sponge and repeat the layers twice more. You should end up with three layers of sponge, cherries, cream and chocolate. Place the final sponge on top, with its top surface facing upwards.", "Whip the remaining 200ml/8fl oz of the cream with an electric hand-whisk until soft peaks form.", "Using the flat side of a palette knife, spread about three tablespoons of the cream over the top of the cake, taking it all the way to the edge. Spoon the remaining cream into a piping bag fitted with a large, plain nozzle and pipe rosettes around the edge of the cake. Tip almost all the remaining grated chocolate into the centre and sprinkle the rest over the rosettes.", "Decorate with fresh cherries if you have some. Keep the cake cool or chill until ready to serve.", "It’s best to eat it the same day as it is made – how could you resist? – but if you need to make the cake in advance, chill it in the fridge for up to 24 hours and allow to stand at room temperature for 30 minutes before serving."]}, {"isVegetarian": true, "title": "Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_01263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range eggs, separated ", "185g/6½oz golden caster sugar", "80g/3oz cocoa powder", "pinch salt", "600ml/20fl oz double cream", "1 vanilla pod, seeds only", "60g/2¼oz icing sugar", "350g/12oz cherries in kirsch", "340g/12oz jar morello cherry jam, 3 tbsp reserved for the topping", "1 tsp cornflour mixed with 2 tsp water", "750g/1lb 10oz cherries, stoned", "3 tbsp morello cherry jam", "50-60 dark chocolate pencils"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and grease and line a 22cm/8½in spring-form cake tin with baking paper. ", "Combine the egg yolks and sugar in a freestanding mixer and whisk over a high speed for 3 minutes until pale, fluffy and doubled in volume. Sift in the cocoa powder and fold in, keeping as much air in as possible. ", "In a separate clean bowl, whisk the egg whites with a pinch of salt until stiff peaks form when the whisk is removed from the bowl. ", "Fold the egg whites into the chocolate mixture a third at a time. Carefully pour the mixture into the lined tin and bake for 40 minutes. Remove from the oven and leave to cool completely.", "For the filling, whisk the cream, vanilla and icing sugar until soft peaks form. Drain the cherries, reserving the kirsch, then fold them into the cream. ", "For the decoration, put the fresh cherries and jam into a saucepan and cook over a high heat for 2 minutes until glossy. Add the cornflour mixture, cook for a further minute and then set aside to cool completely.", "To assemble the cake, using sharp bread knife, cut the sponge into three equal slices. Set one slice on a cake stand or serving board and then spoon over 3 tablespoons of the reserved kirsch. ", "Spread half of the jam over the top and then top with half of the cream. Lay a second sponge on top, press down gently, then repeat the layering process, finishing with a final layer of sponge. Run a palette knife around the edge of the cake to smooth out any cream; this should coat the outside of the cake with a thin layer of cream which will help the chocolate pencils to stick to the cake. ", "Decorate the outside of the cake with a tightly packed line of chocolate pencils, then spoon the glazed cherries into the centre. Chill for at least an hour before serving."]}, {"isVegetarian": true, "title": "Black Forest gâteau trifle", "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_47551", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gteau_47551_16x9.jpg", "ingredients": ["100g/3½oz dark chocolate, broken into pieces", "300ml/10fl oz full-fat milk", "300ml/10fl oz double cream", "1 vanilla pod, split", "6 free-range egg yolks", "100g/3½oz caster sugar", "2 tbsp cocoa powder", "1 tbsp cornflour", "400g/14oz chocolate cake or brownies", "50g/1¾oz black cherry or Morello cherry jam", "100g/3½oz Kirsch or cherry brandy", "300g/10½oz pitted black cherries", "150g/5½oz amaretti biscuits", "300ml/10fl oz double cream", "chocolate curls, to decorate"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["First make the custard as this will need to chill before you make up the trifle. Melt the chocolate - either in the microwave or very carefully in a bain marie (a heatproof bowl placed over a pan of simmering water). Leave to cool.", "Put the milk and cream into a saucepan with the vanilla pod and bring to just-below boiling point. Remove from the heat and leave to infuse until cooled slightly. ", "Put the egg yolks, caster sugar, cocoa powder and cornflour into a bowl and whisk, preferably with electric beaters, until the mixture is very well aerated, pale and stiff enough so that it keeps shape when you trail the beaters through it. ", "Pour the slightly cooled milk and cream mixture over the eggs, mixing as you go, then stir in the melted chocolate. Mix thoroughly, then rinse out the saucepan and return the custard to it. Cook, stirring constantly until the custard thickens – this can take anything between 10 and 20 minutes depending on how high you dare have the heat. Do not have it on too low a heat as it will not thicken, but make sure you do not let the mixture boil and keep stirring. ", "When the custard has thickened to the point of thick double cream, transfer to a jug and cover with clingfilm to stop a skin from forming. When cool, transfer to the fridge – the custard will continue to thicken while it chills.", "To make the trifle, cut the brownies or chocolate cake into fairly thin slices and spread with the jam. Sandwich together and arrange in the bottom of a large trifle bowl. Pour over the kirsch or cherry brandy, then sprinkle over the cherries. ", "Put a layer of the amaretti biscuits over the cherries, then pour over the custard in a thick, even layer. If you have time, place in the fridge until almost ready to serve, again covered in cling film. ", "Whisk the double cream in a bowl until it forms soft peaks, then smooth this over the custard. Decorate with chocolate curls."]}, {"isVegetarian": true, "title": "Black Forest gâteau cream horns", "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_cream_88183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz strong white flour, plus extra for dusting", "60g/2¼oz cocoa powder", "1 tsp fine sea salt", "400g/14oz unsalted butter, cut into cubes", "1 free-range egg, beaten for egg wash", "icing sugar, for dusting", "300ml/10fl oz double cream", "250g/9oz black cherries in kirsch flavoured syrup (drained weight), 12 reserved and the rest chopped ", "2 tbsp syrup from black cherries (see above)", "2 tbsp kirsch", "few drops of almond extract", "50g/1¾oz icing sugar", "50g/1¾oz toasted flaked almonds, plus extra for decoration", "100ml/3½fl oz double cream", "1 tsp unsalted butter", "100g/3½oz plain chocolate"], "serves": "Makes 12 cream horns", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff, sift the flour and cocoa into a mixing bowl and stir in the salt. Add the butter and rub it into the flour using your fingertips (you should have small flakes of butter throughout). Mix in 160ml/5½fl oz water and gently knead together. Bring the dough together and shape into a rectangle. Wrap in cling film and chill for 20 minutes.", "On a lightly floured work surface, roll out the chilled pastry to a rectangle about 60cm/24in long. With the short edge facing you, fold the top third down and the bottom third up. Turn the pastry by 90 degrees (known as a quarter turn) and roll out into a rectangle as before. Repeat the folding process, wrap in cling film and chill again.", "To make the Black Forest gâteau filling, whip the double cream until stiff peaks form when the whisk is removed. Mix in the chopped cherries, syrup, kirsch and almond extract. Stir through then sift in the icing sugar and mix until combined.", "Preheat the oven to 220C/200C Fan/Gas 7.", "Roll out the pastry until it is 3-4mm thick. Cut into long strips about 1cm/½in wide. Wrap each strip around a horn mould starting at the tip and working upwards, with the pastry overlapping slightly. Brush with beaten egg, dust with icing sugar and place on a baking tray seam-side down. Bake for about 15-20 minutes until the pastry is crisp and darkened slightly.", "Once the horns are cooked, set aside cool for a couple of minutes then remove from horn moulds and allow to cool completely on a wire rack.", "For the chocolate ganache, heat the cream, butter and chocolate in a pan. Remove the pan from the heat and whisk the mixture until smooth and thickened. Leave to cool slightly then spoon into a piping bag fitted with a small plain nozzle.", "Stand the horns in mugs to keep them upright and then pipe fine lines of the chocolate ganache inside the horns reaching as far as possible.  ", "Fill the horns with the Black Forest gâteau filling. Top with a cherry and a few almond flakes. Pipe a thin line of chocolate along the top rim of the pastry."]}, {"isVegetarian": true, "title": "Black Forest macaroons", "url": "www_bbc_co_uk_food_recipes_black_forest_macaroons_13462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz icing sugar", "150g/5½oz ground almonds", "10g/¼oz cocoa powder", "4 (125ml/4fl oz) medium free-range egg whites ", "165g/5¾oz granulated sugar", "125g/4½oz dark chocolate, minimum 70% cocoa, finely chopped", "125ml/4fl oz double cream", "1 tsp kirsch (optional)", "100g/3½oz Morello cherry jam or cherry conserve"], "serves": "Makes about 20 macaroons", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Line two large baking trays with baking paper. Put the icing sugar, almonds and cocoa in a food processor and blend to a very fine powder. Sieve the mixture into a large mixing bowl and add half the egg whites. Combine with a fork to make a wet dough.", "Add the remaining egg whites to the freestanding mixer bowl. Heat the granulated sugar and 50ml/2fl oz water in a small pan over a medium heat, stirring occasionally until the sugar dissolves. Stop stirring and bring the mixture to the boil with the sugar thermometer submerged. Once the syrup reaches 112C, start the stand mixer on a high speed. When the syrup reaches 118C the egg whites should be foamy and white. Carefully pour the boiling syrup down the side of the mixing bowl with the stand mixer running (CAUTION: Sugar syrup is very hot. Do not pour the syrup onto the beaters or it may splash back at you.). Keep whisking the meringue until the outside of the bowl is cool to the touch.", "Using a soft spatula, mix half the meringue into the almond mixture – don’t worry about being too gentle. Once the colour is uniform, add the remaining meringue.", "Spoon the mixture into a large piping bag and cut a 1cm/1/2in diameter hole in the tip. Pipe 3cm/1¼in discs onto the prepared baking trays and leave at room temperature for at least half an hour before baking. This allows a skin to form, which helps achieve a good dome.", "Preheat the oven to 170C/150C Fan/Gas 3. Just before the trays go into the oven, sharply drop them from a small height onto the work surface – this helps the “foot” of the macaroon grow when it bakes. Bake for 14-15 minutes. Remove the macaroons from the oven and leave to cool on their trays.", "Meanwhile, make the ganache. Put the chocolate in a small heatproof bowl. Heat the cream in a saucepan until it starts to steam (but before boiling). Pour the cream over the chocolate and leave for a minute. Gently stir until the chocolate melts and the ganache becomes glossy. Add the kirsch, if using, and stir. Set aside to firm-up to a piping consistency.", " Transfer the ganache to a small piping bag and cut a small hole in the tip. Place a blob of cherry jam in the centre of each shell and pipe a ring of ganache around it. Place the other half-shell on top and squeeze gently until the ganache reaches the edge. Repeat with the remaining shells."]}, {"isVegetarian": true, "title": "Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_black_forest_gateau_39909", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gateau_39909_16x9.jpg", "ingredients": ["6 free-range eggs ", "250g/9oz caster sugar ", "100g/3½oz plain flour ", "60g/2¼oz cocoa powder ", "150g/5½oz butter, melted and cooled, plus extra for greasing", "100g/3½oz morello cherry jam ", "425g tin pitted black cherries, drained", "500ml/18fl oz double cream ", "2 tbsp icing sugar ", "100g/3½oz dark chocolate, to decorate"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/160C Fan/Gas 4. Grease and line the base of three 20cm/8in sandwich tins with baking paper. ", "In a bowl, whisk together the eggs and sugar with an electric hand whisk until very light and fluffy. The mixture should leave a visible trail when you lift the whisk (ribbon stage). This will take around 10 minutes. ", "In a separate bowl, sift the flour and cocoa powder together before folding it into the egg mixture, being very gentle so as not to knock the air out.", "Gently pour in the cooled melted butter down the inside of the bowl and carefully fold it in.", "Divide the mixture equally between the three tins and bake for 20–25 minutes, until springy to the touch. Set aside to cool for 5 minutes, then turn out onto a wire rack, peeling off the baking paper, and allow to cool completely. ", "Heat the jam in a small saucepan to melt. Reserve eight of the tinned cherries for the top of the cake, then mix the remainder into the jam. Set aside to cool completely.", "Whisk the cream and icing sugar together until soft peaks form. Set aside in the fridge until you are ready to assemble. ", "When the cake is completely cool, place the whipped cream in a piping bag with a star nozzle and pipe a small amount of cream onto the first layer of sponge and spread evenly. Then pipe a ring around the edge and fill the middle with half the cherry mixture. Place the second layer of sponge on top and repeat the process.", "Pipe eight swirls of cream on top of the cake, topping each with a reserved cherry. ", "Use a vegetable peeler to shave the dark chocolate into curls over the top (alternatively, grate the chocolate and sprinkle over). This cake is best eaten on the day it’s made."]}, {"isVegetarian": true, "title": "Black Forest cranachan", "url": "www_bbc_co_uk_food_recipes_black_forest_cranachan_06130", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_cranachan_06130_16x9.jpg", "ingredients": ["250g/9oz fresh cherries, stones removed, halved", "4 tbsp almond liqueur", "125g/4½oz rolled oats", "30g/1oz flaked almonds", "200g/7oz good-quality dark chocolate (minimum 70% cocoa solids), preferably Fairtrade", "1 tbsp clear honey", "400ml/14fl oz double cream", "50g/1¾oz icing sugar"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cherry halves into a bowl and pour over half of the almond liqueur. Set aside to macerate for 15-20 minutes.", "Meanwhile, preheat the grill to medium. Sprinkle the oats onto a baking tray and toast under the grill for 4-5 minutes, shaking the tray occasionally as the oats cook to ensure they turn golden-brown all over. (Alternatively, preheat the oven to 160C/325F/Gas 3 and toast the oats for 12-15 minutes.)", "Repeat the toasting process with the flaked almonds (these should take less time to turn golden-brown so keep an eye on them). Set aside to cool.", "Bring a little water to the boil in a pan. Reduce the heat until the water is simmering, then suspend a heatproof bowl over the water, making sure that the bottom of the bowl does not touch the water.", "Add the chocolate to the bowl and stir until just melted. Remove from the heat and set aside to cool slightly.", "Drizzle the honey over the toasted oats.  Add the honey-coated oats to the melted chocolate and stir well. ", "Add the remaining almond liqueur and one-third of the double cream to the chocolate mixture and stir until well combined.", "Whip the remaining cream in a bowl with the icing sugar until soft peaks form when the whisk is removed.", "Divide the chocolate-and-oat mixture among four tumblers or individual trifle dishes.", "Next, spoon some of the whipped cream into each dish. Layer in the macerated cherries (saving four to use as a garnish). ", "Spoon in the remaining whipped cream, then sprinkle over the toasted almonds.", "Chill the Black Forest cranachans in the fridge for at least 30 minutes, or until needed, to firm up.", "Just before serving, garnish each dessert with one of the remaining cherries. "]}, {"isVegetarian": true, "title": "Black Forest rolls", "url": "www_bbc_co_uk_food_recipes_black_forest_rolls_94689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz whole milk", "¼ tsp fine sea salt", "75g/2½oz caster sugar", "1 medium free-range egg", "1 orange, zest only", "1 unwaxed lemon, zest only", "600g/1lb 5oz strong white flour, plus extra for dusting", "2 tsp fast-action yeast", "100g/3½oz unsalted butter, softened", "1 tsp rapeseed oil, for greasing", "200g/7oz dried morello cherries", "75g/2½oz dark Belgian chocolate chips, chilled in the fridge", "20 white sugar cubes, halved ", "4 tbsp cherry brandy", "1 large free-range egg, beaten, for egg wash", "20 coloured glacé cherries, cut in half ", "100g/3½fl oz nibbed sugar", "1 tsp ground cinnamon, for dusting", "50g/1¾oz good-quality plain chocolate (70% cocoa solids)"], "serves": "Makes about 18 bread rolls", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, put the milk in a heatproof jug and heat it in a microwave until boiling. Add 150ml/5½fl oz cold water to cool it down. ", "In the bowl of a freestanding mixer with a dough hook attachment, add the salt, sugar, egg, orange zest, lemon zest, flour and yeast.  (Make sure the yeast and salt do not touch.) ", "Add approximately half the milk mixture and, using the dough hook attachment, mix slowly to bring the mixture together. Keep adding the milk mixture until all the flour is incorporated (you may not need all the milk). Increase the mixer speed to medium and mix for three minutes. ", "Slowly add the butter until incorporated and mix for a further six minutes. The dough should be smooth and elastic. ", "Grease a large bowl with rapeseed oil and add the dough. Cover with a shower cap or greased cling film. Prove the dough in a warm place (ideally 27C/80F) for 50 minutes, or until the dough has doubled in size. ", "When the dough has proved, tip it out onto a lightly floured work surface. Knock back the dough and fold over on itself a couple of times. ", "For the filling, gently knead in the cherries and chocolate chips until evenly distributed. Divide the dough into 80g/2¾oz portions and roll into balls.", "Flatten the dough balls slightly and place half a sugar cube in the centre of each ball. Soak each sugar cube with some cherry brandy, using a pipette if available. Pull the dough over the sugar cubes, to seal the cube in the centre. Roll into neat balls.", "Line two large baking trays with non-stick baking parchment. Place the dough balls on the baking tray leaving a 1cm/½in gap between the balls to allow for expansion. Spray with a fine mist of water (if you don’t have a spray bottle, wet your hands and flick droplets of water onto the buns).  Prove for another 25 minutes in a warm place (ideally 27C/80F).", "Preheat the oven to 180C/350F/Gas 4 and place a rack on the third shelf (just below the centre).", "For the decoration, after proving, gently brush the buns all over with egg wash. Place a glace cherry on top of each bun and decorate with nibbed sugar. Using a small sieve, dust the buns with ground cinnamon.", "Bake for around 25–30 minutes, or until well risen and golden-brown. Remove from the oven and place on a wire rack to cool. ", "Meanwhile, melt the dark chocolate in a heatproof bowl suspended over a pan of gently simmering water (do not allow the bowl to touch the water). Spoon the chocolate into a piping bag fitted with a fine writing nozzle.", "When cooled, drizzle the melted chocolate over the buns to decorate. Serve once the chocolate is set."]}, {"isVegetarian": true, "title": "Mini Black Forest meringues with everlasting syllabub", "url": "www_bbc_co_uk_food_recipes_black_fruit_meringues_04123", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225ml/8fl oz Muscat dessert wine", "4 tbsp brandy", "2 lemons, zest and juice ", "115g/4oz caster sugar", "pinch freshly grated nutmeg", "600ml/1 pint double cream", "200g/7oz caster sugar", "3 tbsp blackcurrant fruit powder", "100g/3½oz free-range egg whites", "2 tbsp water", "100g/3½oz caster sugar", "3 tbsp raspberry fruit powder", "100g/3½oz free-range egg whites", "2 tbsp water", "175g/6oz blackberries", "175g/6oz black cherries, stoned, halved", "175g/6oz blackcurrants", "12 small basil leaves"], "serves": "Makes 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the syllabub, place the dessert wine, brandy, lemon zest and juice and sugar in a small bowl and stir until the sugar has dissolved. Cover the bowl with cling film and leave overnight.", "Preheat the oven to 125C/250F/Gas ½. Line two large baking trays with greaseproof paper. Draw 12 x 6cm/2½in circles with pencil on one of sheets of paper.", "For the meringue baskets, mix the sugar and blackcurrant powder and set aside.", "Whisk the egg whites until they form stiff peaks then add the water and continue whisking for two more minutes. Gradually whisk in the sugar mixture, until all of the sugar has been added and  the meringue is firm and glossy.", "Spoon the mixture into a piping bag fitted with a plain 1cm/½in nozzle. Pipe circles onto the paper using the pencil lines to guide you, then pipe a further two rings on top to make the ‘walls’ of the baskets. ", "For the meringue sticks, mix the sugar and raspberry powder and set aside.", "Whisk the egg whites until they form stiff peaks then add the water and continue whisking for two more minutes. Gradually whisk in the sugar mixture, until all of the sugar has been added and  the meringue is firm and glossy.", "Spoon the mixture into a piping bag fitted with a plain 1cm/½in nozzle. Pipe 5cm/2in sticks onto the other baking tray.", "Bake the meringues for 40 minutes then reduce the heat to 110C/225F/Gas ¼ and bake for a further two hours.  Remove the meringues from the oven and carefully transfer to a wire rack to cool.", "Meanwhile, finish the syllabub. Strain the liquid into a large bowl and add a large pinch of nutmeg. Pour in the cream and beat with a wire whisk until it just holds its shape, being careful not to overbeat or it will curdle. Transfer to a clean bowl and chill until ready to use.", "To assemble the meringues, spoon or pipe the syllabub into the meringue baskets and garnish with the fruit and basil leaves. Serve the meringue sticks on the side for 'dipping'."]}, {"isVegetarian": true, "title": "Black Forest trifle", "url": "www_bbc_co_uk_food_recipes_black_forest_trifle_62822", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, cut into cubes", "225g/8oz white chocolate, broken into small pieces", "225g/8oz caster sugar", "4 free-range eggs", "½ tsp vanilla extract", "175g/6oz self-raising flour", "100g/3½oz dark chocolate, chopped", "100g/3½oz glacé cherries, halved", "150ml/5fl oz double cream", "150ml/5fl oz full-fat milk", "4 free-range egg yolks", "100g/3½oz caster sugar", "30g/1oz plain flour", "100g/3½oz dark chocolate, finely chopped ", "3 tbsp kirsch ", "2 x 470g/1lb 1oz jars morello cherries in syrup, drained", "1 x 340g/11¾oz jar cherry conserve or jam", "200g/7oz mascarpone", "200ml/7fl oz double cream", "25g/1oz dark chocolate, grated"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the blondies, preheat the oven to 180C/350F/Gas 4 and line a 20x26cm/8x10½in brownie tin with parchment.", "Put the butter and white chocolate in a bowl set over a pan of simmering water and leave to melt, stirring from time to time. When smooth and melted, leave to cool slightly. ", "Put the sugar, eggs and vanilla in a large bowl and use an electric whisk or a mixer to whisk them together for several minutes until pale and moussey and increased in volume. Slowly pour the melted chocolate mixture onto the eggs and fold in gently.", "Add the flour and fold in lightly. Fold in the chopped dark chocolate. Pour into the lined tin and scatter over the glacé cherries. ", "Bake for about 30 minutes, or until a skewer inserted into the centre comes out almost clean. Leave to cool in the tin.", "For the chocolate custard, put the cream and milk in a pan and heat until just about to boil. Take off the heat. Whisk the egg yolks, sugar and flour together. Pour the hot milk and cream onto the eggs and whisk until smooth. Return this mixture to the pan, and add the chopped chocolate. ", "On a low heat and stirring constantly, cook until all the chocolate has melted and the custard thickens. Remove from the heat, strain into a jug and cover the surface of the custard with cling film (this prevents a skin from forming). Leave to cool completely.", "To assemble the trifle, use around one-third of the blondies, cut into 2-3cm/¾-1¼in cubes, to line the base of a large trifle bowl (you won’t need the remaining blondies for this recipe). Trickle over the Kirsch, so that it soaks into the blondies. Scatter over the drained cherries, then spread over the cherry jam.", "Spoon the cooled chocolate custard over the cherries then put in the fridge for several hours until the custard is set. ", "To finish the trifle, whip the mascarpone with the cream in a bowl until the mixture holds soft peaks when the whisk is removed from the bowl. Swirl or pipe this over the chocolate custard. Finish with grated chocolate. "]}, {"isVegetarian": false, "title": "Black pepper-crusted mackerel with a celery salad", "url": "www_bbc_co_uk_food_recipes_black_pepper-crusted_61117", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper-crusted_61117_16x9.jpg", "ingredients": ["4 fillets fresh mackerel, pin-boned", "2 tsp Dijon mustard", "3 tbsp cracked black pepper", "½ head celery with leaves, sliced", "110g/4oz walnut halves", "2 green apples, cored and cut into wedges", "2 red apples, cored and cut into wedges", "1 tbsp Dijon mustard", "1 lemon, juice only", "3 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the black pepper-crusted mackerel, heat the grill to hot. Brush the mackerel fillets with the mustard and roll the fillets in the black pepper.", "Place on a baking tray and put under the grill for 3-4 minutes.", "For the celery salad, put all the ingredients in a large bowl and mix together.", "For the dressing, put all the dressing ingredients in a small bowl and whisk.", "Just before serving pour the dressing over the salad", "To serve, place the mackerel fillets on each of four plates with the salad alongside."]}, {"isVegetarian": false, "title": "Black pudding with onions", "url": "www_bbc_co_uk_food_recipes_black_pudding_with_31654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 large onion, thinly sliced into crescent moons", "2 garlic cloves, finely chopped", "1 tsp dried oregano", "1 tsp sweet paprika", "½ tsp hot paprika", "½ tsp ground allspice", "½ tsp ground cumin", "pinch ground cloves", "pinch ground cinnamon", "250g/9oz black pudding, peeled and diced", "2 tomatoes, seeds removed, diced", "salt and freshly ground black pepper", "thin slices baguette, toasted", "2 tbsp finely chopped parsley"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the olive oil in a large frying pan. Add the onion and fry gently for around 10 minutes, or until soft and translucent. Add the garlic, oregano and spices. ", "Continue to cook for a couple more minutes then season with salt and pepper. Add 100ml/3½fl oz water and leave to simmer for a couple of minutes.", "In a separate frying pan, heat the remaining olive oil. Add the black pudding and fry briskly on all sides until crisp. Gently toss the black pudding with the onion mixture and the tomatoes.", "Serve the black pudding piled onto the toast and garnished with parsley."]}, {"isVegetarian": false, "title": "Black pudding with a poached egg, crispy pig’s ears and spicy tomato chutney", "url": "www_bbc_co_uk_food_recipes_black_pudding_with_a_94219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pig’s ears", "1 small onion, peeled and cut in half", "1 medium carrot, roughly chopped", "1 stick celery, roughly copped", "½ tsp peppercorns", "75g/2½oz cornflour", "75g/2½oz plain flour", "salt and freshly ground black pepper", "3 shallots, halved lengthwise and then sliced", "2 garlic cloves, finely chopped", "2 tbsp sugar", "good pinch dried chilli flakes, to taste", "1 tsp sea salt", "1 tsp freshly ground black pepper", "50ml/2fl oz red wine vinegar", "8-12 soft tomatoes, roughly chopped", "150g/5½oz golden raisins", "splash white wine vinegar", "4 medium free-range eggs ", "2 tbsp oil", "4 slices black pudding", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crispy pig’s ears, place the pig’s ears in a large saucepan with the onion, carrot, celery and peppercorns. Season with salt and add enough water to cover the ingredients. Cook on a medium heat for 1½-2 hours.", "When cooked, drain the pig’s ears and set aside to dry.", "Preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Mix the two flours together, add salt and pepper and mix well.", "Cut the ears into strips and dredge in the flour. Transfer to the fryer and cook for 2-3 minutes or until golden-brown and crisp. Remove using a slotted spoon and leave to drain on kitchen paper.", "For the spicy tomato chutney, put the shallots and garlic in a sauté pan or frying pan. Add the sugar, chilli flakes, salt, pepper and vinegar. Bring to the boil, then add the tomatoes and raisins. Cook for a further 10-15 minutes until the tomatoes have softened. Set aside.", "For the black pudding and poached egg, bring a pan of water to the boil, add a splash of white wine vinegar, stir the water and crack in the eggs one by one. Poach until the whites are set and the yolks soft (about 1-2 minutes). Remove using a slotted spoon and drain.", "In the meantime heat a large frying pan over a medium heat and add the oil. Add the black pudding and cook on each side until crisp and cooked through. Add the butter at the end and baste the black pudding.", "To serve, place a spoonful of tomato chutney on the serving plates and put the black pudding on top. Top with a poached egg and season with salt and pepper. Garnish with the crispy pig’s ears. "]}, {"isVegetarian": false, "title": "Black pepper shrimp with dried pineapple", "url": "www_bbc_co_uk_food_recipes_black_pepper_shrimp_with_47852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pineapple, peeled, cored, and cut into 2½cm/1in chunks", "3 tbsp grapeseed oil", "3 spring onions, trimmed and thinly sliced", "1 tbsp fresh ginger, finely chopped", "1 tbsp finely chopped garlic", "1¾ tsp black peppercorns, crushed", "1¾ tsp fermented black beans (available from Chinese supermarkets), rinsed, squeezed dry and chopped", "3 tbsp sweet soy sauce", "1 tbsp soy sauce", "1 lime, juice only", "1½  tbsp sugar", "½ tsp salt", "12 large prawns, cleaned, peeled, veins removed and halved", "30g/1oz diced jícama (optional), to garnish", "10g/½oz baby pea shoots, thinly sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the black pepper shrimp with sundried pineapple, preheat the oven to 90C/200F/Gas ¼. Put a rack on top of a rimmed baking tray and line the rack with greaseproof paper.", "Put the pineapple pieces on the greaseproof paper in a single, even layer. Bake for about three hours until the pineapple is dried, shrivelled, and chewy. Remove from the tray and cool completely on a cooling rack.", "Heat one tablespoon of the oil in a large saucepan over medium-high heat. Add the spring onions, ginger and garlic and cook, stirring, until softened and golden-brown. Add the crushed pepper and cook until fragrant, then add the black beans, soy sauces, lime juice, sugar, and salt and bring the mixture to a boil, stirring occasionally. Reduce the heat to medium and simmer for two minutes. Transfer to a blender and purée until coarsely blended. Set aside.", "Heat the remaining two tablespoons oil in a wok or large frying pan over high heat. When the oil is just about smoking, add the prawns and cook, turning the pieces once, until crisp and browned. Remove the oil from the wok, then add the black pepper sauce and two tablespoons water. Cook, stirring, until the prawns are well-coated.", "To serve, decoratively arrange the prawns on your serving plate, garnish with the jicama, pea shoots and pineapple."]}, {"isVegetarian": false, "title": "Balsamic haddock with spicy spinach and balsamic reduction", "url": "www_bbc_co_uk_food_recipes_blackbalsamichaddock_88427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz haddock, skin scored with a sharp knife", "salt and freshly ground black pepper ", "2 tbsp balsamic vinegar", "dash olive oil", "¼ onion, finely sliced", "½ red chilli, chopped", "125g/4½oz baby spinach", "salt and freshly ground black pepper", "3 tbsp balsamic vinegar", "1 tbsp Greek-style yoghurt", "1 sprig fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock, heat the oil in a frying pan, season the haddock with salt and freshly ground black pepper and fry skin-side down for two minutes. Turn over, drizzle over the balsamic vinegar and cook for a further 1-2 minutes, or until just cooked through. Remove from the heat and set aside in a warm place.", "For the spicy spinach, heat the olive oil in a frying pan, add the onion and fry over a low heat until softened but not coloured.", "Add the chilli and fry for one minute. Add the spinach, season with salt and freshly ground black pepper and stir until wilted. Drain off any excess liquid.", "To serve, pour the balsamic vinegar into a small pan and simmer for five minutes, or until reduced and syrupy.", "Pile the spicy spinach onto a serving plate, top with the haddock and pour the balsamic reduction around the plate. Top with a dollop of yoghurt and a sprig of parsley."]}, {"isVegetarian": false, "title": "Black bean, cavolo nero and beef stir fry", "url": "www_bbc_co_uk_food_recipes_blackbeancavoloneroa_89900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 x 300g/10½oz beef fillet, finely sliced", "200g/7oz cavolo nero leaves, washed and trimmed ", "2 garlic cloves, finely sliced", "3cm/1¼in piece ginger, finely sliced", "1 red chilli, seeds removed, flesh finely chopped", "3 tbsp black bean sauce", "3 tbsp hot beef stock", "220g/8oz long grain rice, cooked according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok over a high heat until hot. Add one tablespoon of the vegetable oil, then add the beef slices and stir fry for 1-2 minutes, or until the beef slices have browned on the outside. Transfer the beef slices to a sieve suspended over a bowl and set aside.", "Return the wok to the heat, add the remaining vegetable oil, then add the cavolo nero leaves. Stir fry for 1-2 minutes, or until wilted.", "Add the sliced garlic, ginger and chilli and stir fry for a further 1-2 minutes.", "Add the black bean sauce and hot beef stock, stir well to coat the ingredients, then simmer the mixture over a high heat for 1-2 minutes.", "Return the beef slices to the pan until heated through.", "To serve, spoon the rice into the centre of four serving plates. Spoon over the stir fry and serve immediately."]}, {"isVegetarian": false, "title": "Black pepper pork noodle salad", "url": "www_bbc_co_uk_food_recipes_black_pepper_pork_noodle_13499", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper_pork_noodle_13499_16x9.jpg", "ingredients": ["50g/1¾oz rice vermicelli noodles", "1 tsp vegetable oil", "100g/3½oz pork mince ", "½ tsp freshly ground black pepper", "2 tsp soy sauce", "2 spring onions, chopped", "½ red pepper, thinly sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the kettle. Put the noodles in a pan and pour over boiling water to cover. Allow to soak for 8 minutes until softened.", "Heat a wok or frying pan until very hot. Add the oil, then the pork mince with lots of freshly ground black pepper. Break up the mince with a wooden spoon, giving it time to brown before stirring.", "When browned all over, add the white parts of the spring onion and half of the green. Stir-fry for 1 minute. Add the soy sauce - it will bubble up quickly and thicken. Immediately transfer the pork mince to a serving bowl.", "Drain the noodles and stir into the meat along with the red pepper and remaining spring onion. This can be served warm, at room temperature or cold. "]}, {"isVegetarian": false, "title": "Herby black beans", "url": "www_bbc_co_uk_food_recipes_blackbeans_86387", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, chopped ", "1 green pepper, chopped ", "1 whole dried chilli", "1 whole head of garlic cut into half across the middle", "1 bunch coriander, chopped  ", "1 small handful marjoram, chopped ", "100g/3½oz smoked bacon, or smoked turkey", "500g/1lb 2oz dried black beans, soaked overnight", "1 chicken stock cube", "2 big pinches sea salt and freshly ground black pepper", "coriander and marjoram, chopped, to serve"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the olive oil in a large, heavy-bottomed saucepan. Add the onion, pepper, chilli, garlic, herbs and bacon or turkey and cook until the onions and peppers are softened, about 5-10 minutes.", "Add the black beans, crumble in the stock cube and add enough water to cover. Reduce heat and simmer gently for 2-3 hours.  ", "When the beans have a stew-like consistency they are ready. Season to taste with sea salt and freshly ground black pepper. Remove any branches of herbs and the hunk of bacon, before dishing up.  To serve, garnish with chopped coriander and marjoram."]}, {"isVegetarian": true, "title": "Black-eyed bean salsa", "url": "www_bbc_co_uk_food_recipes_blackbeansalsa_80910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, finely chopped", "¼ red pepper, finely chopped", "1 tbsp chopped coriander", "½ lime, juice only", "½ tin black-eyed beans, rinsed and drained", "½ tsp chilli flakes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together all of the ingredients and serve."]}, {"isVegetarian": false, "title": "Black bean steamed scallops with noodles", "url": "www_bbc_co_uk_food_recipes_blackbeansteamedscal_89273", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackbeansteamedscal_89273_16x9.jpg", "ingredients": ["75g/3oz dried vermicelli noodles", "8 scallops, removed from the shells, de-bearded and coral removed, shells cleaned and reserved ", "6 cloves garlic, finely chopped", "2.5cm/1in piece fresh root ginger, peeled, finely chopped", "1 red chilli, de-seeded, finely chopped", "1 tbsp fermented salted black beans, washed and crushed into a paste (available from Asian grocers)", "1 tbsp Shaoxing rice wine or dry sherry", "2 tbsp light soy sauce ", "3 tbsp water", "2 tbsp finely chopped fresh chives or spring onions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the scallops with noodles, soak the dried vermicelli in a bowl of just-boiled water for 5-6 minutes, or until tender. Drain well, then chop into 10cm/4in lengths and set aside. ", "Place the cleaned scallops back into their shells. ", "For the black bean sauce, mix all of the sauce ingredients together in a bowl. Spoon a teaspoon of the sauce on top of each scallop and gently rub into the scallop flesh.", "Wrap some of the soft vermicelli noodles around each scallop, then spoon one teaspoon of water around the noodles. (This helps to keep the noodles moist and works to create a sauce when combined with the steamed juices of the scallops.)", "Divide the scallop shells between two heatproof serving plates and place each plate into a bamboo steamer, placing one steamer on top of the other. Place the steamers over a pan or wok of boiling water (making sure the water does not touch the base of the steamer), cover, and steam over a high heat for 4-5 minutes, or until the scallops are cooked through. If you do not have a bamboo steamer, place the shells onto a large heatproof plate set on a rack in a roasting tray. Fill the roasting tray with boiling water from the kettle. Pre-heat the oven to 180C/350F/Gas 4, cover the whole roasting tray with foil and place into the oven to steam for 4-5 minutes. ", "To serve, serve the scallops in the bamboo steamers, or remove the plates from the steamer and serve on the plates. Sprinkle over the chopped chives or spring onions and serve immediately."]}, {"isVegetarian": true, "title": "Blackberry and apple crumble smoothie", "url": "www_bbc_co_uk_food_recipes_blackberry_and_apple_39192", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackberry_and_apple_39192_16x9.jpg", "ingredients": ["300g/10½oz frozen mixed berries ", "1 apple, cored and sliced", "200ml/7floz semi-skimmed milk", "150g/5½oz fat-free natural yoghurt", "25g/1oz porridge oats, with extra fibre", "10g/¼oz flaked almonds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the berries, apple, milk, yoghurt, oats and nuts in a blender and blend until smooth. ", "Add 75-100ml/2½-3½floz cold water, a little at a time, to achieve a smooth consistency and blend again. ", "Pour into glasses and serve. "]}, {"isVegetarian": false, "title": "Blackberry and hazelnut meringue roulade", "url": "www_bbc_co_uk_food_recipes_blackberry_and_hazelnut_72381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter", "375g/13oz caster sugar", "4 free-range eggs", "1 tsp baking powder", "1 tsp bicarbonate of soda", "450g/1lb plain flour", "pinch salt", "450ml/16fl oz soured cream", "4 apples, peeled and chopped", "vegetable oil, for greasing", "4 free-range egg whites", "pinch salt", "175g/6oz caster sugar, plus extra to sprinkle", "½ tsp lemon juice", "75g/2¾oz toasted hazelnuts, chopped", "pinch ground cinnamon", "400ml/14fl oz double cream", "caster sugar, to taste", "75g/2¾oz blackberries, whole or chopped", "4 punnets blackberries ", "4 tbsp caster sugar", "570ml/½ pint water", "5 leaves of gelatine, soaked in a bowl cold water", "knob of butter", "4 Bramley apples, peeled and chopped", "5 tbsp caster sugar", "knob of butter", "2 apples, peeled and cut into wedges", "55g/2oz sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple cake, preheat the oven to 180C/350F/Gas 4 and line a 30x40cm/12x16in baking tin, 4cm/2in deep, with greaseproof paper.", "Cream the butter and sugar together until pale and fluffy. Add the eggs one by one and beat to combine. Sieve in the baking powder, bicarbonate of soda, flour and salt and fold to combine. Stir in the soured cream and chopped apples. ", "Pour into the prepared tin and bake for 30 minutes, or until springy to the touch and golden-brown.", "For the roulade, line a 30cm/12in Swiss roll tin with baking paper and brush with vegetable oil. Whisk the egg whites in a bowl with a pinch of salt until you reach soft peaks when the whisk is removed from the bowl. Add the sugar, whisk again and then add the lemon juice and keep whisking until stiff peaks are formed when the whisk is removed from the bowl. ", "Tip the mixture onto the prepared tray and use a palette knife to spread out. Sprinkle with the chopped hazelnuts, cinnamon and a touch of caster sugar. Bake in the oven at 180C/350F/Gas 4 for 8-10 minutes before turning out onto a clean kitchen cloth and leaving to cool. ", "Whisk the cream with the sugar until soft peaks form when the whisk is removed from the bowl. Fold the blackberries through the cream. ", "Once the meringue is cool, spread with the cream mixture and carefully roll the roulade up.", "For the blackberry coulis and blackberry jelly, heat the blackberries, sugar and water in a pan for 6–8 minutes to soften. ", "Remove from the heat and blend the mixture until smooth using a food processor or hand-blender.", "Pass the mixture through a sieve and then divide into two batches. Reserve one batch to use as a coulis (for dressing the dessert). With the other batch, heat again gently, then remove from the heat and stir in the gelatine leaves. Pour into a small container and leave to set. ", "Once set, cut into small cubes to serve.", "For the apple purée, heat the butter in a pan and fry the apple and caster sugar for 8–10 minutes over a gentle heat until softened, adding a splash of water if necessary. Remove from the heat and blend (in a food processor or using a hand-blender) until smooth. ", "For the caramelised apples, heat the butter in a pan and add the apple wedges. Cook for a few minutes to soften, then stir in the sugar. Allow the sugar to dissolve and cook until the apples have caramelised.", "To serve, cut the roulade into slices and arrange on serving plates. Garnish with a sprig of mint. Spoon the apple purée on the plate and smear using a spoon. Cut the apple cake into squares and serve alongside. Arrange the jelly cubes on the plate, and spoon the caramelised apples alongside also. Finish with drops of blackberry coulis to finish."]}, {"isVegetarian": true, "title": "Blackberry and raspberry tart", "url": "www_bbc_co_uk_food_recipes_blackberry_and_raspberry_13546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour", "250g/9oz chilled butter, cubed, plus extra for greasing.", "100g/3½oz icing sugar", "3 free-range egg yolks, lightly beaten.", "3 large free-range egg yolks", "75g/2½oz caster sugar", "20g/¾oz plain flour", "40g/1½oz cornflour", "400ml/13½fl oz milk", "pinch salt", "vanilla pod", "100ml/3½fl oz double cream", "1 tbsp whisky", "400g/14oz raspberries", "200g/7oz blackberries", "2 tbsp apricot jam", "2 tbsp hot water (just boiled)", "50g/1½oz toasted almonds", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, butter and sugar into a bowl, gently and quickly rub into the consistency of bread crumbs. If using a food processor, blend to this consistency.  Drizzle in the egg yolk and use a knife to mix through till the crumb starts to come together.  (If using a food processor blend the egg into the mix for a few seconds till the crumb combines.) If the mixture is too dry you can add small amounts of egg white to the bowl or processor and blend till the crumb comes together.  ", "Form the pastry into a block and chill in a fridge for 20 minutes until hard.", "Grease a 25cm/10in tart tin then dust it with flour.", "Using a rough edged grater grate the cold pastry into the tart tin.  Push the pastry into the corners then grate more pastry and firm down onto the base of the tin until about 6mm/¼in deep. Place in the fridge for approximately 20 minutes while you make the pastry cream.", "To make the pastry cream, place the egg yolks and caster sugar in a bowl.  Whisk until thick and pale in colour then stir in the flour and corn flour.", "Place the milk in a saucepan, add a pinch of salt. Score the vanilla pod down the length with a knife and add it to the milk and bring to the boil.  Remove from the heat and leave the mixture to infuse for 10 minutes.", "Remove the vanilla pod and return the milk to the heat. Bring to the boil and then slowly add the hot milk to the egg mixture whisking all the time. Pour the mixture back into the pan and reduce the heat to low. Whisk constantly and bring to the boil again. After around two minutes the mixture should thicken. Pour into a cold bowl to stop the cooking process.", "Whisk the cream until soft peaks form when the whisk is removed, and then fold it into the pastry cream.  Add the whisky to the mixture and chill it in the fridge.", "To blind bake the pastry, Preheat the oven to 180C/350F/Gas 4. Remove the pastry and tart tin from the fridge.  Cut a piece of greaseproof paper or baking parchment that is larger than the tin and scrunch into a ball and open out again so that it’s soft and less rigid.  Place the paper into the pastry case and gently fill with dried pulses or baking beans.  Blind bake the pastry case in the oven for around 20 minutes until it feels dry to the touch.  Remove the parchment/greaseproof paper and beans, brush the pastry with egg white and return to the oven for 5-8 minutes to seal the pastry.", "To assemble the tart, spoon the cooled pastry cream into the pastry case. Top with raspberries and blackberries.  Dissolve the apricot jam into the just boiled water.  Using a pastry brush, gently coat the fruit with the glaze, sprinkle with toasted almonds and dust with icing sugar.", "To serve remove the outer ring of the tin.  Easy the base off with a knife and slide onto a plate or cake stand."]}, {"isVegetarian": true, "title": "Blackberry bites", "url": "www_bbc_co_uk_food_recipes_blackberry_bites_08399", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, plus extra for greasing", "125g/4½oz self raising flour, plus extra for dusting", "25g/1oz caster sugar", "16 fresh blackberries", "80-100ml/3-3½fl oz buttermilk", "plain yoghurt, to serve"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Grease a baking tray with butter.", "In a bowl, rub the butter and flour together using your fingertips until the mixture resembles breadcrumbs. Stir in the sugar. Gently stir in the blackberries.", "Gradually pour in the buttermilk, stirring well until the mixture starts to come together as a dough without being sticky. You may not need to use all of the buttermilk. ", "Turn the dough out onto a lightly dusted work surface and roll into a ball. Roll out the dough ball to a thickness of 1.5cm/½in.", "Cut circles from the dough using a cookie cutter and arrange onto the baking tray, leaving a gap between each. Bake in the oven for 10-12 minutes, or until golden-brown.", "Serve with a dollop of yoghurt on top."]}, {"isVegetarian": true, "title": "Blackberry crumble overnight oats", "url": "www_bbc_co_uk_food_recipes_blackberry_crumble_15618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackberry_crumble_15618_16x9.jpg", "ingredients": ["50g/1¾oz frozen blackberries", "1 tsp runny honey or agave syrup", "small handful chopped almonds or walnuts", "40g/1½oz porridge oats or toasted rolled oats (use gluten-free oats if required)", "150ml/5fl oz milk or vegan alternative", "3 drops almond extract (optional)"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the ingredients into a jar, stir, put the lid on and chill in the fridge overnight. ", "In the morning, top with extra nuts, if desired."]}, {"isVegetarian": true, "title": "Apple and blackberry charlotte", "url": "www_bbc_co_uk_food_recipes_blackberry_charlotte_96114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 Bramley apples, peeled, 2 cut into chunks and 1 sliced for garnish", "400g/14oz blackberries, 100g/3½ reserved for garnish", "110g/4oz caster sugar", "10 slices white bread, crusts removed", "100g/3½oz butter, melted, plus extra for greasing", "200ml/7fl oz double cream", "200ml/7fl oz full-fat milk", "1 vanilla pod, seeds removed", "4 free-range egg yolks", "75g/2½oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Grease four individual dariole moulds with butter.", "Heat the apples, 300g/10½oz blackberries and sugar with 2-3 tablespoons water in a saucepan for 2-3 minutes, or until the apples are softened and the blackberries have broken down. Remove the pan from the heat.", "Cut out four circles of bread to line the base of the dariole moulds and four larger circles for the tops. Cut the remaining bread into strips.", "Dip each piece of bread into the melted butter and use them to line the bottom and sides of the dariole moulds. Spoon the apples and blackberries into the moulds and top with the larger circles of bread. ", "Bake the charlottes in the oven for 25 minutes or until golden-brown on top.", "Meanwhile for the custard, bring the cream, milk and vanilla pod to a simmer for five minutes over a very low heat. Remove the pan from the heat and remove the vanilla pod.", "Whisk the egg yolks and sugar together in a bowl until well blended. Slowly whisk in the hot milk and cream. Return the mixture to the pan and cook over a gentle heat, stirring continuously, until the custard thickens enough to coat the back of a spoon. Strain through a fine sieve into a bowl.", "For the garnish, heat a medium frying pan and add any remaining melted butter, the reserved sliced apples and blackberries and gently fry for two minutes.", "To serve, carefully turn the apple and blackberry charlottes. Spoon a little custard onto each of four serving plates, place the charlottes on top and spoon the garnish alongside."]}, {"isVegetarian": false, "title": "Blackcurrant delice with mini doughnuts, lemon posset and sugared almonds", "url": "www_bbc_co_uk_food_recipes_blackberry_delice_with_29437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["190g/6¾oz sugar", "1 tbsp liquid glucose", "350g/12oz blackcurrants", "50ml/2fl oz sorbet syrup (from above)", "60g/2¼oz sugar", "1 free-range egg white", "blackcurrant purée (from above)", "12g/½ oz powdered milk", "½ vanilla pod", "3 medium free-range egg yolks", "25g/1oz caster sugar", "4½ gelatine leaves, soaked in cold water for 15 minutes", "Italian meringue (from above)", "200ml/7fl oz crème de cassis", "400ml/14fl oz double cream, lightly whipped to the ribbon stage ", "1 ready-made round sponge flan base, cut in half horizontally (you will only need one half)", "50ml/2fl oz sorbet syrup (from above)", "1 tbsp blackcurrant purée (from above)", "50ml/2fl oz sorbet syrup (from above)", "3 tbsp blackcurrant purée (from above)", "3 gelatine leaves, soaked in cold water for 15 minutes", "600ml/20fl oz double cream", "150g/5½oz caster sugar", "2 large lemons, zest and juice only", "250g/9oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "1 tsp fast-action yeast", "vegetable oil, for deep frying", "1 egg white ", "550g/1lb 4oz blanched almonds ", "200g/7oz caster sugar ", "¼ tsp sea salt ", "mint sprigs"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the sorbet syrup, put the sugar, glucose and 165ml/5½fl oz water in a saucepan and bring to the boil, stirring occasionally with a wooden spoon. Boil for about 2-3 minutes. Pass the syrup through a fine sieve to remove any sugar crystals. (CAUTION: boiling sugar is extremely hot.) Set aside to cool completely. ", "For the blackcurrant purée, place the blackcurrants in a blender with the syrup and blend until smooth. Pass the mixture through a fine sieve into a bowl.", "For the Italian meringue, place the sugar and 5 teaspoons water in a pan. Slowly heat until the syrup reaches 110C/230F on a sugar thermometer. At this stage, place the egg whites in the bowl of a freestanding mixer and whisk until firm peaks form when the whisk is removed. ", "As soon as the sugar reaches 121C/250F, remove the pan from the heat. Immediately resume whisking the egg whites. With the beater at its lowest speed, pour in the melted sugar, in a steady stream, making sure it is clear of the beaters. Continue beating for about 5 minutes, until the meringue is tepid. ", "For the blackcurrant mousse, reserve 4 tablespoons of the blackcurrant purée and set aside. Put the remaining purée in a saucepan with the powdered milk and vanilla pod. Bring to the boil. ", "Put the egg yolks and caster sugar in a large bowl and whisk until the mixture leaves a trail when the whisk is removed (the ribbon stage). Pour the blackcurrant mixture over the egg mixture, whisking continuously, then return the mixture to the pan. Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the spatula. Do not allow it to boil or the custard will split.", "Remove the pan from the heat and stir the drained gelatine into the custard. Discard the vanilla pod, then pass the custard through a fine sieve into a bowl and leave to cool, stirring occasionally to prevent a skin forming.", "For the base, place one half of the sponge flan base on a board. Mix together the syrup and a tablespoon of the reserved blackcurrant purée. Brush the mixture over the sponge. Place a 25cm/10in flan ring (about 6cm/2½in deep) onto the sponge and cut out a circle to form the base. Put the sponge base in the bottom of the flan ring and place on a flat plate or board. ", "When the blackcurrant custard is lukewarm, gently fold in half of the Italian meringue (you do not need the remainder for this recipe). Stir in the crème de cassis, then fold in the whipped cream. Start to assemble the dessert immediately, before the gelatine causes the mousse to set.", "Fill the flan ring with the blackcurrant mousse mixture, leaving a small gap at the top, and carefully smooth the surface using a palette knife. Place in the freezer or a very cold fridge for 2-3 hours, or until the mousse is set. ", "For the glaze, put the syrup and the remaining blackcurrant purée in a pan and heat gently. Remove from the heat and stir in the gelatine. Leave to cool, then spread the glaze over the top of the mousse. Place into the fridge to chill while you make the doughnuts.", "For the lemon posset, slowly bring the double cream and sugar to the boil in a large saucepan set over a low heat, stirring well to dissolve the sugar in the cream. Boil for 3 minutes, then remove from the heat and set aside to cool.", "Once the cream mixture has cooled, whisk in the lemon juice and zest. Pour the posset mixture into a medium bowl and chill in the fridge for at least 3 hours.", "For the mini doughnuts, combine the flour, salt and caster sugar in a large bowl.", "Mix in the butter, 150ml/5fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Line a baking tray with baking parchment and place the dough balls on top, leaving plenty of room between each ball. Cover with a tea towel and set aside in a warm place to prove for a further 20 minutes.", "When the dough has proved, preheat a deep-fat fryer to 150C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "For the sugared almonds, preheat the oven to 130C/110C Fan/Gas 1 and line a baking tray with baking parchment.", "Lightly beat the egg white with a tablespoon water. Add the almonds and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on the tray.", "Bake for 1 hour, stirring occasionally, until golden-brown. Leave to cool. ", "To serve, remove the delice from the mould using a chef’s blow torch and place slices on serving plates. Garnish with the mini doughnuts and sugared almonds. Stir the posset and place a quenelle on each plate. Top with a sprig of mint."]}]