[{"isVegetarian": false, "title": "Côte de boeuf with blue cheese butter and sautéed girolle mushrooms and potatoes", "url": "www_bbc_co_uk_food_recipes_blue_cheese_cote_de_92417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 800g/1lb 12 oz côte de boeuf steaks (bone-in rib-eye steaks)", "salt and freshly ground black pepper", "90g/3½oz butter", "3 tbsp olive oil", "75g/3oz blue Cheshire cheese", "3 tbsp finely chopped fresh chives", "400g/14oz floury potatoes, peeled, cut into 0.5cm/½in cubes, blanched", "250g/9oz girolle mushrooms, cleaned well", "2 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Season the steaks all over with salt and freshly ground black pepper.", "Heat a large ovenproof frying pan over a high heat until very hot. Add a little of the butter and one tablespoon of the oil. When the butter is foaming, add the steaks and fry for 1-2 minutes on each sides, or until browned on both sides.", "Transfer the steaks to the oven and roast for 8-10 minutes (for rare), 12-15 minutes (for medium), or until cooked to your liking.", "Remove the steaks from the oven and set aside to rest for at least 5 minutes.", "Meanwhile, blend 75g/3oz of the butter and all of the blue cheese in a food processor until just smooth. Season, to taste, with salt and freshly ground black pepper.", "Add half of the chives and stir through until combined.", "Heat an ovenproof frying pan over a medium to high heat until hot. Add the remaining butter and olive oil and fry the blanched potatoes for 2-3 minutes, or until golden-brown and crisp. Add the girolle mushrooms and fry for a further 2-3 minutes.", "Season the mixture, to taste, with salt and freshly ground black pepper, then stir through the parsley and the remaining chives.", "To serve, place one côte de boeuf onto each of two serving plates. Spoon some of the cheese butter over the top, then pile the mushrooms and potatoes alongside."]}, {"isVegetarian": true, "title": "Blue corn and cheese quesadillas", "url": "www_bbc_co_uk_food_recipes_blue_corn_quesadillas_93464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz blue corn tortilla flour (or maize flour if unavailable)", "2 tbsp olive oil", "1 onion, finely sliced", "1 green jalapeño chilli, finely chopped or a good pinch dried chilli flakes", "1 garlic clove, finely chopped", "250g/9oz courgette flowers, Swiss chard or spinach, washed and shredded", "200g/7oz mozzarella, grated ", "150g/5½oz Lancashire cheese, crumbled", "salt"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the flour in a large bowl with ½ teaspoon salt and add 275ml/9¾fl oz lukewarm water. Add more if the dough is too dry (you will need roughly 350ml/12fl oz water if using normal maize flour). Knead into a smooth, soft but not sticky dough. Cover and rest for 20–30 minutes.", "Divide the mixture into 12 golfball-sized balls. Place one between two sheets of cling film and roll with a rolling pin to make a tortilla about 15cm/6in in diameter. Repeat and pile the tortillas up, separated with baking paper to prevent them sticking together. ", "Heat a dry frying pan over a medium heat. Cook the tortillas, one or two at a time, until they change colour and start to puff up slightly; this will take about 2 minutes. Flip them over and repeat on the other side. Set aside.", "Heat the oil in a saucepan over a medium heat. Cook the onion, chilli and garlic until soft but not coloured. Add the courgette flowers, chard or spinach to the pan and cook until wilted. Season with salt. ", "Lay a tortilla in a dry frying pan and sprinkle over some mozzarella and Lancashire cheese. Add some courgette flowers (or greens) and fold the tortilla in half to make a semi-circle. Once the cheese is starting to melt, flip the quesadilla over and continue to cook until the cheese is oozing. Remove the quesadilla from the pan and keep warm while you make the rest. Cut into wedges and serve immediately."]}, {"isVegetarian": true, "title": "Blue jewel bake", "url": "www_bbc_co_uk_food_recipes_blue_jewel_bake_50561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "1 free-range egg", "100ml/3½fl oz milk", "1 tsp runny honey", "½ tsp vanilla extract", "½ tsp orange zest (or ½ tsp orange extract)", "45g/1¾oz self-raising flour", "30 blueberries", "plain yoghurt, to serve"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Grease a six-hole muffin tin with vegetable oil using a pastry brush.", "Beat the egg together with the milk in a jug until well combined. Add the honey, vanilla extract and orange zest and beat again.", "Put the flour into a mixing bowl and make a well in the centre. Pour in half of the egg mixture, gradually bringing the edges of the flour into the wet mixture with a fork until the mixture is smooth and thoroughly combined. ", "Pour over the remaining egg mixture and mix again with the fork to form a smooth, runny batter.", "Divide the blueberries equally among the six holes in the muffin tray. Spoon in the batter (about three tablespoons of batter per hole).", "Bake the muffins in the oven for 10-15 minutes, or until they have risen and are golden-brown, and a skewer inserted into the centre of each comes out clean. ", "Set aside to cool slightly, then remove the muffins from the tray and set aside to cool on a wire rack. These are delicious eaten as they are, or served with plain yoghurt."]}, {"isVegetarian": true, "title": "Blueberry, almond butter and cream pancakes", "url": "www_bbc_co_uk_food_recipes_blueberry_almond_butter_10881", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_almond_butter_10881_16x9.jpg", "ingredients": ["100ml/3½fl oz double cream", "4-6 tbsp almond butter", "4 tbsp blueberry conserve", "4 pancakes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whip the cream until soft peaks form when the whisk is removed.", "Dribble the almond butter and blueberry conserve over the pancakes. Top with dollops of whipped cream and enjoy!"]}, {"isVegetarian": true, "title": "Blueberry, blackcurrant and basil curd", "url": "www_bbc_co_uk_food_recipes_blueberry_and_basil_curd_56487", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz mixed blueberries and blackcurrants", "½ lemon", "50g/1¾oz butter", "100g/3½oz caster sugar", "2 small free-range eggs", "3 purple basil leaves"], "serves": "Makes about 2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the blueberries, blackcurrants and one tablespoon of water in a pan for five minutes to release the juices. Set aside while you zest and juice the lemon.", "Add the lemon zest and juice, butter and sugar to a heatproof bowl placed over a pan filled with gently simmering water and heat until the sugar has dissolved, then set aside for a minute or so.", "Whisk the eggs well in a separate bowl, pour through a sieve into the bowl set over water. Add the fruit and the basil leaves. Keep stirring over a low heat for about 25-30 minutes.", "Sieve again into a jug then pour into sterilised jars to serve."]}, {"isVegetarian": false, "title": "Blueberry and buttermilk panna cotta", "url": "www_bbc_co_uk_food_recipes_blueberry_and_buttermilk_71250", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_buttermilk_71250_16x9.jpg", "ingredients": ["300ml/10fl oz double cream", "70g/2½oz caster sugar", "1 tsp vanilla extract ", "2½ sheets gelatine, soaked in a bowl of cold water (or use a vegetarian alternative)", "300ml/10fl oz buttermilk", "90g/3¼oz blueberries", "100g/3½oz caster sugar", "1 star anise", "100g/3½oz blueberries"], "serves": "Makes 5", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Warm the cream, sugar and vanilla in a pan until the sugar has dissolved and the cream just comes to the boil. ", "Remove the pan from the heat. Squeeze the gelatine to remove any excess water. Add it to the pan and stir until dissolved. Add the buttermilk and mix well.", "Divide the blueberries between five ramekins. Pour over the cream mixture to fill the moulds. ", "Place in the fridge to set - this will take at least four hours, or leave overnight.", "For the blueberry sauce, put the sugar, 50ml/2fl oz of water and star anise into a pan. Bring to the boil so that the sugar dissolves and the syrup thickens slightly but doesn’t change colour.", "Remove from the heat and add the blueberries. Leave to cool and the syrup will turn a deep red colour and the blueberries will soften.", "To serve, run a knife around the panna cotta to loosen it. Tip out onto serving plates and pour over a little of the blueberry sauce."]}, {"isVegetarian": true, "title": "Blueberries with yoghurt, honey and caramelised almonds", "url": "www_bbc_co_uk_food_recipes_blueberrieswithyoghu_88682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz blueberries", "2 tbsp Greek-style yoghurt", "1 tsp honey", "100g/3½oz blueberries", "1 lemon, juice only", "1 tbsp water", "1 tbsp icing sugar", "3 tbsp caster sugar", "55g/2oz almonds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the blueberries with yoghurt, place the blueberries into the base of a tall glass, spoon in the yoghurt and drizzle over the honey. ", "For the blueberry coulis, place all the ingredients into the bowl of a food processor and process until smooth. ", "Swirl some of the coulis into the yoghurt and honey. ", "For the caramelised almonds, place the sugar into a small frying pan and heat gently. When it starts to melt, tip in the almonds and cook for 4-5 minutes, until they start to turn golden-brown and the sugar caramelises. Pour onto a sheet of silicone paper or greaseproof paper to cool.", "When cool enough to handle, break into pieces and garnish the top of the yoghurt, honey and coulis with pieces of the caramelised almonds."]}, {"isVegetarian": false, "title": "Blueberry and chilli molasses-glazed belly of pork with whipped feta, yoghurt and cumin salad", "url": "www_bbc_co_uk_food_recipes_blueberry_and_chilli_11759", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb12oz lean belly of pork", "800ml/1 pint 8fl oz rich chicken stock", "½ tsp cumin seeds", "½ tsp fennel seeds", "½ tsp crushed cardamom", "350g/12oz frozen blueberries, defrosted", "125ml/4fl oz water", "2 tbsp caster sugar or honey", "2 tbsp lemon juice", "½ tsp mild chilli flakes", "salt and freshly ground black pepper", "55g/2oz feta cheese, crumbled", "3 tbsp plain yoghurt", "½ tsp ground cumin", "2 Baby Gem lettuces, leaves only", "¼ tsp cumin seeds", "¼ tsp black sesame seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the belly of pork, preheat the oven to 150C/300F/Gas 2.", "Place the pork belly in a deep roasting tin and pour over the chicken stock – it should come about half-way up the pork belly.", "Scatter over the spices, cover the tin with aluminium foil and cook in the oven for 2-4 hours, or until very tender.", "Remove from the oven, drain off the liquid and let the meat cool completely.", "For the blueberry molasses, place the blueberries and water in a food processor or blender and blend to a purée.", "Place the purée in a saucepan and add the sugar, lemon and chilli flakes. Bring to a boil and simmer for 40-60 minutes, or until the mixture becomes thick and syrupy. Season with salt and freshly ground black pepper, adding more chilli if you like a little more spice. ", "Preheat the oven to 240C/475F/Gas 9. Remove the thick layer of skin and fat from the pork belly and discard. Place the pork in a clean roasting tin and glaze the top and side of the meat with the blueberry molasses.", "Place the pork in the oven for 5-6 minutes, or until the top is caramelised and slightly crisp. ", "For the salad, whip the feta, yoghurt and ground cumin together in a bowl. Season with salt and freshly ground black pepper then place in a clean bowl with the salad leaves. Mix well, then sprinkle with the cumin and sesame seeds. ", "Cut the pork into squares and serve with the salad."]}, {"isVegetarian": true, "title": "Blueberry butter", "url": "www_bbc_co_uk_food_recipes_blueberry_butter_07052", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_butter_07052_16x9.jpg", "ingredients": ["500g/1lb 2oz cooking apples (about 3)", "250g/9oz blueberries", "300ml/10fl oz clear apple juice", "1 medium orange, zest only", "350g/12oz sugar"], "serves": "Makes 3 x 250ml/9fl oz jars", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the apples, then chop them into small chunks – there is no need to peel or core them – and put into a preserving pan.", "Wash the blueberries and place into the preserving pan with the apples and apple juice.", "Add the orange zest.", "Bring to the boil, then reduce the heat and simmer for 20 minutes or until the apples have collapsed, stirring occasionally.", "Strain the mixture through a fine sieve, then return the blueberry and apple mixture to the pan.", "Add the sugar and return to the heat.  Stir constantly until the sugar is dissolved.", "Continue to cook until a thick, creamy consistency is achieved – this can take up to an hour. Stir from time to time.", "Pour into sterilised jars. Cover with a lid and label."]}, {"isVegetarian": true, "title": "Blueberry and lemon millefeuille", "url": "www_bbc_co_uk_food_recipes_blueberry_and_lemon_03932", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_lemon_03932_16x9.jpg", "ingredients": ["115g/4oz icing sugar, plus extra for dusting ", "250g/9oz shop-bought puff pastry ", "200g/7oz (or 1 punnet) blueberries ", "165ml/5½fl oz whipping cream ", "25g/1oz icing sugar ", "1 vanilla pod, seeds only (or alternatively 2 drops of vanilla extract)", "1 lemon, finely grated zest and a squeeze of the juice "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Line a large baking tray with greaseproof paper. Dust the work surface with lots of icing sugar and roll out the pastry to a rectangle just larger than 27 x 30cm/10½ x 12in, trimming the edges straight. It should be super thin, as thin as you can get it, without stretching the pastry.", "Cut out 18 rectangles about 9cm/3½in long and 5cm/2in wide and place them on the prepared baking tray. Sprinkle with lots of icing sugar and put in the fridge for 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6. ", "Remove the pastry from the fridge and bake in the oven for five minutes, then remove from the oven and sprinkle the pastry with more icing sugar. Return to the oven and bake for a further five minutes, or until the pastry turns golden-brown. Remove from the oven and set aside. ", "For the sweetened cream, put the cream, icing sugar and vanilla in a large bowl and whip until medium-stiff peaks form when the whisk is removed from the bowl. Fold in the lemon zest and juice, to taste, then scoop the mixture into a piping bag fitted with a 1cm/½in straight nozzle. ", "Place one of the pastry thins on a serving plate. Pipe blobs of cream over the pastry and put the blueberries between the cream, then put another pastry thin on top and repeat with one more layer. Sprinkle the top layer with more icing sugar and repeat until all the pastry and cream is used up. "]}, {"isVegetarian": true, "title": "Blueberry and white chocolate bagels", "url": "www_bbc_co_uk_food_recipes_blueberry_and_white_51475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "1½ tsp salt", "1 tbsp runny honey", "1 tbsp olive oil (not extra virgin), plus extra for greasing", "1 x 7g sachet instant yeast", "240ml/9fl oz tepid water", "1 medium free-range egg, beaten", "75g/2¾oz dried blueberries", "oil, for greasing", "1 free-range egg, lightly beaten, for glazing", "100g/3½oz white chocolate, finely grated "], "serves": "Makes 12 bagels", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the bagel dough, place all the ingredients into a large mixing bowl and mix to a stiff dough. Turn out onto the worktop and knead for 10 minutes, or until smooth and elastic (alternatively use an electric mixer with a dough hook for five minutes).  ", "Divide the dough into 12 equal portions, roll each piece into a neat ball, and place on a floured chopping board. Cover with oiled cling film and set aside to prove for 25 minutes.", "When the dough has doubled in size, make a hole in the centre of each ball using a wooden spoon handle, stretching the hole with your fingers so it doesn’t reseal. Cover and set aside for 35 minutes to prove a second time. ", "Preheat the oven to 230C/450F/Gas 8. Bring a large saucepan of water up to the boil and add the bagels in batches (taking care not to overcrowd the pan) and poach for 1¼ minutes per side. Scoop the bagels out with a slotted spoon and place on a cooling rack to dry slightly, then glaze with egg.", "Line two large baking trays with parchment paper and grease with oil. Place the poached bagels onto the lined baking sheets with plenty of room between them and bake in the preheated oven. After 10 minutes, swap the trays round in the oven (so that the bagels that were at the top are now at the bottom and vice versa) and bake for a further five minutes. Remove the bagels from the oven and transfer to a cooling rack.", "For the topping, place a heatproof bowl over a pan of simmering water and add half the chocolate. Heat until the chocolate reaches 43C/110F (use an electric thermometer for this), continually stirring with a spatula. Remove from the heat and sprinkle in a third of the reserved chocolate. Return the bowl to the pan and allow the chocolate to melt for 30 seconds. Remove from the heat and add another third of the remaining chocolate. Repeat until all the chocolate is used. ", "Spoon the melted chocolate into a piping bag with a very fine nozzle attached (alternatively snip a tiny corner off a plastic food bag) and, using a fluid motion, zig-zag the chocolate over the bagels. "]}, {"isVegetarian": true, "title": "Blueberry and lemon traybake", "url": "www_bbc_co_uk_food_recipes_blueberry_and_lemon_09039", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_lemon_09039_16x9.jpg", "ingredients": ["125g/4½oz butter, softened", "225g/8oz caster sugar", "2 free-range eggs", "250g/9oz soured cream", "1 unwaxed lemon, zest and juice", "300g/10½oz self-raising flour", "½ tsp baking powder", "150g/5½oz blueberries", "50g/2oz butter, softened", "300g/10½oz icing sugar, sieved, plus extra for dusting", "200g/7oz cream cheese", " 1-2  tbsp lemon juice ", "50g/2oz blueberries"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a rectangular baking tin (approximately 26cm x 20cm/10½in x 8in).", "Beat the butter and sugar together in a bowl until light and fluffy, then beat in the eggs, one at a time, until well combined. Stir in the soured cream, lemon juice and zest, flour and baking powder until well combined, then carefully fold in the blueberries.", "Spoon the mixture into the cake tin and bake for 40-45 minutes, or until a skewer inserted into the cake comes out clean. Remove the cake from the oven, and set aside until completely cool.", "Meanwhile for the cream cheese topping, beat the butter and icing sugar together in a bowl until light and fluffy.  Beat in the cream cheese and lemon juice, then spread over the top of the cake.  Sprinkle over the blueberries and dust with icing sugar."]}, {"isVegetarian": true, "title": "Blueberry galette with chocolate peanut ice cream", "url": "www_bbc_co_uk_food_recipes_blueberry_galette_with_46523", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_galette_with_46523_16x9.jpg", "ingredients": ["300ml/10½fl oz full-fat milk", "200ml/7fl oz double cream", "75g/2½oz caster sugar", "6 free-range egg yolks", "3 chocolate and peanut bars, chopped", "200g/7oz plain flour, plus extra for dusting", "150g/5½oz unsalted butter, chopped", "75g/2½oz caster sugar", "2 free-range egg yolks", "400g/14oz fresh blueberries", "1 vanilla pod, split in half lengthways, seeds scraped out ", "2 tbsp cornflour", "1 lemon, juice only", "2 tbsp demerara sugar"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the instant chocolate ice cream, heat the milk and cream in a saucepan until just simmering. Whisk the caster sugar and egg yolks together in a bowl until pale and fluffy.", "Slowly pour the warm cream mixture onto the egg mixture, whisking continuously. ", "Return the mixture to the saucepan and continue to cook over a low heat, whisking continuously, until it thickens enough to coat the back of a spoon. Add the chopped chocolate bars and stir until melted. Set aside to cool, then chill in the fridge. ", "Transfer the chilled custard to an ice cream machine and churn until frozen, then freeze until needed in an airtight container.", "For the galettes, in a bowl, rub together the flour, butter and 25g/1oz of the caster sugar using your fingertips, until the mixture resembles breadcrumbs. ", "Add one of the egg yolks and stir the mixture until it comes together as a dough. Turn the dough out onto a lightly floured work surface and knead until smooth. Flatten the dough to a 2cm/1in-thick disc, then wrap in cling film and chill in the fridge for 30 minutes.", "Meanwhile, in a bowl, stir together the blueberries, vanilla seeds, cornflour, lemon juice and the remaining caster sugar. Set aside.", "Roll the chilled pastry out on a lightly floured surface to a thickness of 5mm/¼in. Cut eight 12cm/5in discs from the pastry and place them onto a baking tray lined with baking parchment. Pinch or fold the edges of each pastry disc to create pastry cases, then brush all over with the remaining egg yolk. Spoon in the blueberries and sprinkle over the demerara sugar. Chill in the fridge for 30 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Bake the galettes in the oven for 20-25 minutes, or until crisp and golden-brown.", "To serve, place the warm galettes on serving plates and place a scoop of ice cream on top of each."]}, {"isVegetarian": true, "title": "Blueberry macaroons, coconut macaroons and strawberry macaroons", "url": "www_bbc_co_uk_food_recipes_blueberry_macaroons_89479", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz blueberries                         ", "400g/14oz jam sugar                                              ", "250g/9oz icing sugar                                       ", "210g/7½oz ground almonds                          ", "40g/1½oz dried blueberries                                                                                                                             ", "175g/6oz free-range egg whites (equivalent to about 5 egg whites)", "225g/8oz caster sugar", "4 tbsp water", "navy blue food colouring", "250g/9oz icing sugar                                       ", "210g/7½oz ground almonds                          ", "40g/1½oz desiccated coconut", "175g/6oz free-range egg whites (equivalent to about 5 egg whites)", "4 tbsp water", "225g/8oz caster sugar", "250g/9oz icing sugar                                       ", "250g/9oz ground almonds ", "175g/6oz free-range egg whites (equivalent to about 5 egg whites)", "4 tbsp water", "225g/8oz caster sugar", "red food colouring paste", "strawberry essence", "284ml/10fl oz double cream", "2 tbsp icing sugar, sifted", "1 x 50g/1¾oz sachet creamed coconut", "6 large ripe strawberries ", "125g/4½oz unsalted butter", "250g/1lb 2oz icing sugar"], "serves": "Makes 60 macaroons", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the blueberry jelly filling, place the blueberries and sugar in a small pan, heat over a gentle heat until the sugar has dissolved then boil over a high heat for 7 – 10 minutes. Pour the jelly through a fine sieve into a large shallow dish and set aside to cool completely. ", "Preheat the oven to 170C/325F/Gas 3. Line 4 large baking trays with greaseproof paper.", "For the blueberry macaroons, place the icing sugar, ground almonds and blueberries into a food processor and pulse until you have a fine dust. Sieve the mixture into a bowl, discarding anything left in the sieve, then return the mixture to the food processor. Weigh out 85g/3oz of the egg whites, add them to the food processor and blend to make a paste.", "Place the sugar and water in a heavy-based saucepan and heat until the sugar has dissolved and the mixture is syrupy. ", "Whisk the remaining egg whites in a food mixer or with an electric whisk until they form soft peaks then add the colouring and gradually mix in the syrup. Continue whisking until the mixture is shiny and stiff then transfer it to a clean mixing bowl.", "Fold the almond mixture into the whisked egg whites with a large metal spoon then spoon the mixture into a piping bag fitted with a 1cm/½in nozzle and pipe circles about 4cm/1½in diameter onto the baking trays. Give the baking trays a couple of slams on the work surface to flatten the macaroons then bake with the oven door slightly ajar for 12 - 15 minutes or until just firm. Leave to cool on wire racks before filling.", "Make the coconut and strawberry macaroons by repeating steps 3 – 6, substituting the dried blueberries with the desiccated coconut for the coconut macaroons, and adding a little strawberry essence and red colouring for the strawberry macaroons.", "For the coconut filling, whip the double cream with the icing sugar until stiff peaks form, then fold in the coconut cream and spoon into a piping bag. Sandwich the coconut macaroons together with a little piped filling.", "For the strawberry filling, chop the strawberries and press them through a fine sieve to make a purée. Beat the butter until soft and fluffy then whisk in the icing sugar and strawberry purée and spoon into a piping bag. Sandwich the macaroons together with a little piped filling.", "To assemble the blueberry macaroons, cut circles of the jelly with a small biscuit cutter slightly smaller than the macaroons. Sandwich the macaroons together with the circles of jelly."]}, {"isVegetarian": true, "title": "Blueberry pain perdu with sautéed blueberries and blueberry ice cream", "url": "www_bbc_co_uk_food_recipes_blueberry_pain_perdu_53274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz double cream", "300ml/10fl oz whole milk", "1 vanilla pod, seeds removed and keep the pod", "100g/3½oz caster sugar", "4 egg yolks", "200g/7oz fresh blueberries", "250g/9oz unsalted butter, softened  ", "250g/9oz caster sugar  ", "4 eggs  ", "250g/9oz self-raising flour  ", "½ tsp vanilla extract", "250g/9oz blueberries  ", "knob of butter", "icing sugar, for dusting", "250g/9oz blueberries", "100g/3½oz caster sugar"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, put the cream, milk and vanilla seeds and pod in a large saucepan and bring to a simmer.", "Whisk together the sugar and egg yolks in a large. Slowly add the warm cream to the eggs and whisk.", "Pour the mixture back in the saucepan and cook on a medium heat until thickened and coats the back of the spoon.", "Pour mixture into an ice cream machine. Just as it starts to set add the blueberries and mix.", "Pour into a freezer-proof container, cover the surface with cling film and freeze until hard.", "Meanwhile, for the blueberry pain perdu, preheat the oven to 180C/160C Fan/Gas 4. Grease a 20x30x3cm/8x12x1in baking tray with butter and line with a sheet of baking parchment.", "In a bowl, beat together the butter and sugar until pale and fluffy. Crack in the eggs, one at a time, beating after each addition, until well combined. Fold in the flour by hand, then stir in the blueberries.", "Pour into the prepared tin and bake for 30-40 minutes, until cooked through (a skewer inserted into the centre should come out clean.) Set aside to cool in the tin. When cooled, cut it into 6 squares, trimming the edges if you like.", "For the sautéed blueberries, heat the blueberries and sugar in a saucepan over a medium heat, stirring continually. Cook until the blueberries have broken down, the sugar has dissolved in the juices, and the mixture has thickened.", "Just before serving, heat a little butter in a frying pan over a medium heat. Add the pain perdu slices in batches, and fry for 2 minutes on each side until golden-brown and heated through.", "To serve, divide the pain perdu slices equally among 4-6 serving plates. Top each with a scoop of ice cream, then spoon a few of the sautéed blueberries alongside. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Blueberry steamed sponge pudding", "url": "www_bbc_co_uk_food_recipes_blueberry_steamed_sponge_48910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, softened, plus extra for greasing", "150g/5½oz golden syrup", "200g/7oz blueberries", "175g/6oz golden caster sugar", "3 free-range eggs", "175g/6oz self-raising flour", "1 tsp baking powder", "pinch salt", "250ml/9fl oz full-fat milk", "250ml/9fl oz double cream", "1 vanilla pod, split in half lengthways, seeds scraped out using a sharp knife", "110g/3¾oz caster sugar", "6 egg yolks"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pudding, grease a 1.2-litre/2 pint heatproof pudding dish with butter. Pour the golden syrup into the bottom and scatter in the blueberries.", "Whisk together the remaining pudding ingredients in a bowl until light and fluffy. Carefully spoon the pudding mixture into the pudding dish.", "Cover the pudding dish with a large square of baking parchment, then cover that with a large square of aluminium foil. Tie the two sheets tightly into place under the rim of the bowl using cook's string, leaving long ends of excess string to make a handle. Loop one of the excess string lengths over the pudding basin and slide underneath the taut string, holding the sheets in place on the other side. Bring up the string and firmly knot with the other piece of excess string, to form a secure handle to lift the pudding in and out of the water. ", "Place a clean tea towel in the bottom of a large, heavy-based saucepan, then put an upside-down saucer or small plate on top of it. Half-fill the pan with water. ", "Sit the wrapped pudding dish on top of the saucer, making sure the string handle is easily accessible. Cover the pan with the lid and bring the water to the boil. Reduce the heat until the water is simmering and cook the pudding for 1½-2 hours.", "Meanwhile, for the custard, bring the milk, cream, vanilla pods and vanilla seeds gently to the boil in a saucepan. ", "Whisk the sugar and egg yolks in a bowl until pale and creamy. ", "When the milk mixture is just about to boil, pour it onto the egg mixture, whisking continuously until all of the liquid has been incorporated. ", "Return the mixture to the pan and cook over a low heat, whisking all the time, until the custard has thickened enough to coat the back of a wooden spoon. ", "Strain the custard into a clean pan and warm through very gently.", "When the pudding has cooked, lift it out of the pan using the string handle. Unwrap the pudding and discard the foil and baking parchment. Turn the pudding out onto a serving plate, then cut into wedges and serve with the custard."]}, {"isVegetarian": true, "title": "Quick blueberry muesli crumble", "url": "www_bbc_co_uk_food_recipes_blueberryalpinecrumb_91327", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "½ cinnamon stick", "640g/1 lb 6½oz fresh blueberries", "1 tbsp unsalted butter", "125ml/4¼fl oz peach liqueur", "50g/1¼oz muesli", "70g/2½oz plain flour", "85g/3oz light brown sugar", "100g/3½oz unsalted butter, cut into cubes", "1 tsp clear honey ", "1 tbsp mascarpone"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, heat the sugar, cinnamon stick, blueberries and butter in a pan, stirring continuously, until the mixture is simmering. Continue to simmer for 3-4 minutes, or until the sugar has melted and has turned golden-brown in places and the blueberries have broken down. ", "Add the peach liqueur and bring to the boil for one minute, stirring well. Remove the pan from the heat and set aside. ", "For the crumble topping, place the muesli, flour, brown sugar and butter into a large mixing bowl. Rub together using your fingertips until the mixture resembles breadcrumbs. ", "Transfer the crumble mixture to a dry frying pan and toast over a medium heat until golden-brown. ", "For the honeyed mascarpone, mix together the honey and mascarpone until smooth and well combined. ", "To serve, divide the filling mixture equally among two ramekins. Sprinkle over the crumble topping. Place the ramekins onto serving plates and spoon the honeyed mascarpone alongside."]}, {"isVegetarian": true, "title": "Blueberry and blackberry pie with clotted cream", "url": "www_bbc_co_uk_food_recipes_blueberryandblackber_83914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz readymade shortcrust pastry", "225g/8oz blueberries", "225g/8oz blackberries", "½ lemon, juice and zest", "½ tsp ground cinnamon", "25g/1oz demerara sugar", "1 free-range egg, lightly beaten", "4 tbsp apricot jam", "4 tbsp water", "150g/5oz clotted cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease and flour four dariole moulds.", "Roll out the pastry and carefully line each of the moulds, retaining enough pastry for a lid for each pie.", "In a mixing bowl, stir together the blueberries, blackberries, lemon juice and zest, cinnamon and sugar. Fill the moulds with this mixture and place on a baking sheet.", "Top and seal with the remaining pastry. Make a slit in the top of each pie to release steam. ", "Brush with egg and cook for about 20 to 30 minutes, until the top is browned.", "Once cooked, allow to rest, before removing from the mould. ", "Boil together the jam and water to make a glaze. Using a pastry brush, smear the glaze over each pie. ", "Serve with clotted cream."]}, {"isVegetarian": true, "title": "Blueberry and lemon fool tarts", "url": "www_bbc_co_uk_food_recipes_blueberryandlemonfoo_81865", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4oz blueberries", "½ lemon, juice only", "3 tbsp lemon curd", "200ml/7fl oz double cream", "200g/7oz ready-made shortbread biscuits", "50g/2oz roasted hazelnuts, chopped ", "50g/2oz butter, melted", "6 x 10cm/4in loose-bottomed tartlet tins", "25g/1oz blueberries", "½ lemon, zest only"], "serves": "Makes 6", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the blueberries and lemon juice into a small saucepan over a gentle heat. Cook until the blueberries are beginning to burst open and are softened. ", "Using a hand blender, blend the blueberries to a smooth purée and leave to cool.", "To make the tart cases, place the biscuits and hazelnuts into a food processor and blend to a fine crumb consistency.", "Add the melted butter and blend until well mixed in. Spoon out the mixture into the tartlet tins and press into the base and sides of the tins. Transfer to the fridge and chill for one hour.", "Meanwhile, in a large bowl, whip the cream until it forms soft peaks.", "Place the lemon curd into a bowl and add the blueberry purée and mix together well.", "Add the blueberry mixture to the whipped cream and fold in gently, leaving a marbled, 'blueberry ripple' effect.", "Carefully turn the chilled shortbread tart cases out of their tins onto plates and spoon the blueberry and lemon cream inside.", "To serve, scatter over the extra blueberries and sprinkle with a little lemon zest to garnish."]}, {"isVegetarian": true, "title": "Blueberry and mascarpone tart", "url": "www_bbc_co_uk_food_recipes_blueberryandmascarpo_4977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["packet of shop bought puff pastry", "2 tubs of mascarpone ", "1 tub of clear honey", "fresh blueberries", "icing sugar to dust"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll out the puff pastry into a large square and cook according to the instructions on the packet (approximately 7 minutes). Once cooked, leave the pastry to cool. ", "Mix the mascarpone and honey together and spread over the cooled pastry. ", "Decorate with blueberries and a light dusting of icing sugar."]}, {"isVegetarian": true, "title": "Blueberry and ricotta soufflé", "url": "www_bbc_co_uk_food_recipes_blueberryandricottas_84783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range egg whites ", "2 tbsp icing sugar", "50g/2oz blueberries", "2 tbsp white wine", "1 tbsp cornflour", "2 tsp vegetable oil", "75g/2¾oz ricotta cheese", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a small ovenproof frying pan in the oven to 200C/400F/Gas 6.", "Place the egg whites into a bowl and whisk until stiff peaks are formed when the whisk is removed from the mixture.", "Add the icing sugar to the egg whites and continue to whisk until the mixture becomes glossy.", "Place the blueberries, white wine, cornflour, vegetable oil and ricotta cheese into the bowl of a food processor and blend until the mixture has combined and has a smooth texture.", "Gradually fold the egg white mixture into the blueberry mixture. Mix the blueberry and egg white with a metal spoon until they have combined and the soufflé mixture is light and airy.", "Remove the frying pan from the oven and spoon the mixture into it. Place the frying pan back into the oven and bake for 10 minutes, or until the soufflé has risen and is golden-brown on top.", "To serve,  serve the soufflé in the frying pan and dust with icing sugar."]}, {"isVegetarian": true, "title": "Blueberry muffin Martini", "url": "www_bbc_co_uk_food_recipes_blueberrymuffinmarti_87590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30ml/2fl oz vodka", "1 tbsp white creme de cacao", "1 tbsp blueberry liqueur", "20ml/½fl oz vanilla vodka", "10 fresh blueberries, plus extra to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a cocktail shaker with a handful of ice. Shake well, then strain into a Martini glass. Garnish with a few extra blueberries."]}, {"isVegetarian": true, "title": "Blueberry muffins", "url": "www_bbc_co_uk_food_recipes_blueberrymuffins_67846", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberrymuffins_67846_16x9.jpg", "ingredients": ["110g/4oz plain flour", "110g/4oz butter", "65g/2½oz caster sugar", "2 free-range eggs", "1½ tsp baking powder", "125g/4½oz blueberries, or equivalent in frozen blueberries", "pinch nutmeg", "double cream, to serve"], "serves": "Makes 8 muffins", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Cream the butter and sugar together then slowly add the eggs, mix for three minutes. Add the flour, baking powder, nutmeg, stir to combine, then refrigerate for at least an hour, preferably overnight. ", "Place a spoonful of muffin mixture into each muffin case, filling each to just over half way. Stud each muffin with about eight blueberries. ", "Bake in an oven set at 200C/400F/Gas 6 for 20 minutes, or until golden on top. Serve with cream."]}, {"isVegetarian": true, "title": "Gluten-free blueberry muffins", "url": "www_bbc_co_uk_food_recipes_blueberrymuffins_74761", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberrymuffins_74761_16x9.jpg", "ingredients": ["175g/6oz rice flour", "50g/2oz tapioca flour", "1 tsp bicarbonate of soda", "2 tsp gluten-free baking powder", "1 rounded tsp xanthan gum", "¼ tsp salt", "150g/5oz caster sugar", "60g/2½oz butter, melted and cooled", "1 egg, preferably free-range, beaten", "60g/2½oz buttermilk", "2 tbsp milk", "150g/5oz fresh blueberries"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/35F/Gas 4. ", "Sift together the rice flour, tapioca flour, bicarbonate of soda, baking powder and xanthan gum in a large mixing bowl. Add the salt and sugar and mix well. ", "Whisk together the cooled melted butter, egg, buttermilk and milk in another large bowl. Make a well in the centre of the dry ingredients and pour in the butter, egg and buttermilk mixture. Stir gently with a wooden spoon to combine and finally gently fold in the blueberries. ", "Divide the batter equally between the 12 muffin cases and bake in the oven for approximately 25 minutes or until a skewer inserted into the centre comes out cleanly. They are nicest served warm."]}, {"isVegetarian": false, "title": "Blueberry pancakes with bacon", "url": "www_bbc_co_uk_food_recipes_blueberrypancakeswit_74503", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz self-raising flour", "1 tsp bicarbonate of soda", "50g/2oz caster sugar", "1 egg", "50g/2oz melted butter", "250ml/9 fl oz milk", "125g/4½oz cottage cheese", "225g/8oz blueberries", "15g/½oz unsalted butter", "8 rashers pancetta or streaky bacon", "4 eggs", "a little extra butter, melted", "maple syrup"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour, bicarbonate of soda and sugar together in a bowl.", "In a separate bowl combine one egg with the 50g (2oz) melted butter, milk and cottage cheese then add this to the flour mix and stir together to make a batter. ", "Stir in the blueberries.", "Lightly oil a frying pan and preheat over a medium heat. Spoon a small ladleful of the pancake batter into the pan and cook for one minute on each side, until golden. ", "Repeat until you have used all the batter.", "Meanwhile, poach the four eggs in boiling water for 3-4 minutes and grill the pancetta until crispy.", "Serve two pancakes per person, topped with a drizzle of melted butter, two slices of pancetta or bacon, one poached egg and  a drizzle  maple syrup."]}]