[{"isVegetarian": false, "title": "Chargrilled lamb steak with rosemary and black pepper and a feta and green bean salad", "url": "www_bbc_co_uk_food_recipes_chargrilledlambsteak_92429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp chopped fresh rosemary leaves", "½ tsp black peppercorns, cracked", "100g/3½oz lamb leg steak", "pinch salt", "1 tbsp olive oil", "85g/3oz green beans, trimmed and blanched", "¼ onion, peeled, finely sliced", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "55g/2oz feta, crumbled", "2 tbsp pistachio nuts"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled lamb, heat  a griddle pan until hot. Rub the rosemary and black pepper into both sides of the lamb leg steak, season with the salt and drizzle over the olive oil. ", "Cook the lamb on the griddle over a medium heat for 4-5 minutes on each side (for medium), or until golden-brown all over and cooked to your liking. Remove the meat from the pan and leave to rest on a warm plate.", "For the feta green bean salad, gently mix together all of the salad ingredients in a bowl. ", "To serve, spoon the feta and green bean salad onto a serving plate and place the lamb leg steak alongside."]}, {"isVegetarian": false, "title": "Chargrilled lamb with rocket pesto, roasted tomatoes and crushed sweet potato", "url": "www_bbc_co_uk_food_recipes_chargrilledlambwitha_88296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz lamb fillet", "dash olive oil", "salt and freshly ground black pepper", "large handful fresh rocket leaves", "55g/2oz feta cheese, crumbled", "2 tbsp sesame seeds, toasted in a hot pan", "2 garlic cloves", "3-4 tbsp olive oil", "salt and freshly ground black pepper", "2 fresh vine tomatoes, halved", "dash olive oil", "salt and freshly ground black pepper", "1 tsp fresh thyme leaves", "½ sweet potato, peeled, finely chopped", "2 tbsp Greek-style yoghurt", "1 tbsp chopped fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/ Gas 4.", "For the chargrilled lamb, rub the lamb with olive oil and season well with salt and freshly ground black pepper. Place onto the hot griddle pan to chargrill for 2-3 minutes on both sides, or until cooked to your liking. Remove from the heat and leave to rest in a warm place for five minutes and then slice.", "For the rocket pesto, place the rocket, feta, olive oil, sesame seeds, garlic, salt and freshly ground black pepper into a food processor and blend until smooth.", "For the roasted tomatoes, place the halved tomatoes onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper. Sprinkle with the thyme leaves and place into the oven to roast for 10-12 minutes.", "For the crushed sweet potatoes, place the sweet potato cubes into a small pan of boiling salted water and boil for five minutes, or until tender. Drain and allow to steam dry.", "Add the yoghurt and coriander and roughly crush the potatoes with a fork. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the crushed sweet potato onto a serving plate and top with the lamb slices. Place the roasted tomatoes alongside and drizzle over the rocket pesto."]}, {"isVegetarian": false, "title": "Chargrilled lamb with curried butternut squash and cabbage", "url": "www_bbc_co_uk_food_recipes_chargrilledlambwithc_77969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/ 5¼oz butternut squash (base section)", "2tbsp olive oil", "salt and freshly ground black pepper ", "50g/1¾oz unsalted butter", "1tbsp curry powder", "1 garlic clove, sliced", "25g/1oz unsalted butter", "200g/7oz cabbage, shredded", "150g/5¾oz lamb (leg steak)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the butternut squash curry, preheat the oven to 200C/400F/Gas 6.", "Leaving the skin on, remove the seeds from the butternut squash and cut into wedges. Toss in the olive oil and season well.", "Heat a griddle pan. Place the butternut squash wedges onto the griddle, cooking for four to five minutes, turning to create grill marks.", "Place the butternut on a baking-sheet. Sprinkle the curry powder over and distribute the unsalted butter in small knobs. Place in the oven and bake for ten minutes.", "To make the cabbage, heat a medium frying pan, melt the butter and add the sliced garlic. Cook for one minute.", "Add the shredded cabbage and cook for ten minutes, allowing to wilt down. ", "To cook the lamb steak, put the griddle pan onto a high heat. Season the lamb steak on both sides, place in the pan and cook for one and a half minutes on each side or until cooked to your liking.", "To serve, arrange a cabbage base on a warm plate. Place the curried butternut on top and serve the lamb steaks on the side."]}, {"isVegetarian": true, "title": "Chargrilled peaches with fresh basil sabayon", "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_84530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz tin peach halves, drained and patted dry", "1 tbsp olive oil", "3 free-range egg yolks", "1 tbsp caster sugar", "1 tbsp white wine", "6-8 fresh basil leaves, shredded"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. Heat a griddle pan until smoking.", "Drizzle the peaches with the olive oil and place cut-side down into a hot griddle pan and chargrill for 2-3 minutes, or until golden-brown. Transfer to serving plates and set aside in a warm place.", "For the sabayon, place the egg yolks, sugar and wine into a bowl placed over a saucepan of simmering water. Whisk vigorously and constantly until the mixture becomes thick and foaming.", "Add the fresh basil and fold through the mixture.", "Place the peaches onto a baking sheet. Spoon the sabayon over the peaches and place under the grill to cook for three minutes, or until golden brown.", "Place the peaches onto a plate and serve."]}, {"isVegetarian": false, "title": "Chargrilled leek, spring onion and halloumi salad with tea-smoked chicken", "url": "www_bbc_co_uk_food_recipes_chargrilledleeksprin_86959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 leeks, trimmed", "12 spring onions", "250g/9oz halloumi cheese, cut into slices", "1 tbsp capers, rinsed, drained and roughly chopped", "20g/¾oz sun-dried tomatoes, roughly chopped", "4 tbsp extra virgin olive oil", "1 tbsp white wine vinegar", "½ lemon, juice only", "2 baby Little Gem lettuces, cut into wedges", "75g/3oz rocket", "1 onion, cut into quarters", "1 carrot, cut into chunks", "2 sprigs fresh thyme", "2 sprigs fresh flatleaf parsley", "4 chicken breasts, boneless and skinless", "100g/4oz basmati rice", "2 tbsp jasmine tea", "2 tbsp demerara sugar", "oil, for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat a pan of water until boiling, then place a steamer on top. Place the leeks and spring onions into the steamer, cover with a lid and steam for 2-3 minutes, until just tender.", "Meanwhile, heat a griddle pan until hot and griddle the halloumi for one minute on each side, or until charred. Remove from the griddle and set aside. Griddle the leeks and spring onions until charred on all sides, then set aside.", "Place the capers and sun-dried tomatoes into a bowl, add the olive oil, vinegar and lemon juice and mix well.", "Cut the charred vegetables and cheese into chunks and place into a large bowl. Add the lettuce and rocket, pour over the dressing and stir to coat.", "For the chicken, fill a large saucepan with water and add the onion, carrot, thyme and parsley. Bring to a simmer, then add the chicken. Bring back to a simmer and poach for 6-8 minutes, or longer for larger chicken breasts. Remove from the water and pat dry with kitchen paper.", "Place a piece of foil in the bottom of a wok, top with the uncooked rice, tea and sugar and cover with a lid. Place on the heat for 3-4 minutes, until the tea starts to smoke. (NB: Tea-smoking generates a lot of smoke. Be sure that you open the windows and get as much ventilation as you can.)", "Place the poached chicken onto an oiled piece of foil in a steamer, then set the steamer inside the wok. Place a lid on the steamer and heat for 2-3 minutes, or until the chicken is lightly smoked and completely cooked through.", "To serve, divide the salad among four serving plates. Cut the chicken into slices and place on top of the salad on each plate."]}, {"isVegetarian": true, "title": "Chargrilled peaches with honey, yoghurt and sugar-glazed pine nuts", "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_92427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 peaches, halved, stones removed", "2 tbsp olive oil", "1 tbsp butter", "3 tbsp pine nuts", "1 tbsp soft brown sugar", "3 tbsp greek-style yoghurt", "2 tbsp honey", "1 sprig fresh mint"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until hot. Drizzle the cut-side of the peaches with the olive oil and fry in the hot pan for 5-6 minutes, or until the peaches have grill marks on the bottom.", "Melt the butter in a small frying pan add the pine nuts and sugar and stir until the sugar is melted and is bubbling and golden-brown. Pour onto a silicone or similar non-stick sheet and leave to cool completely. When cooled, break into small pieces with your fingers.", "To serve, place the peaches on a plate and spoon over the yoghurt. Drizzle over the honey, sprinkle ove the sugar-glazed pine nuts and garnish with the sprig of mint."]}, {"isVegetarian": false, "title": "Chargrilled peach salad", "url": "www_bbc_co_uk_food_recipes_chargrilledpeachsala_84862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz blue cheese", "2 tbsp milk", "1 tbsp olive oil", "1 peach, cut into wedges ", "2 handfuls fresh rocket", "1 tbsp chopped fresh chives", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 slice Parma ham, chopped", "2 tbsp black olives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place all of the dressing ingredients into a mini-food processor and blend until smooth.", "For the salad, heat a griddle pan and cook the peach pieces for 3-4 minutes on each side, or until chargrilled and tender.", "Place the rocket, chives and oil into a bowl, mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the herb salad onto a plate and top with the chargrilled peach pieces, Parma ham and olives. Drizzle over the dressing."]}, {"isVegetarian": true, "title": "Chargrilled pears with herb salad and Stilton port dressing", "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pear, thinly sliced ", "25g/1oz butter ", "3 kumquats, juice only", "1 egg yolk ", "25ml/1fl oz port ", "100ml/4fl oz olive oil ", "50g/5oz crumbled blue cheese ", "1 handful fresh coriander ", "1 handful fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pears, heat a chargrill pan. Add the butter and the slices of pear and chargrill for four minutes until golden.", "To finish, squeeze the kumquat juice on top.", "In a bowl, mix the egg yolk with the port, then whisk in the olive oil gradually. Finish by adding the crumbled cheese and the fresh herbs.", "To serve, place the pears on a plate and top with herb salad and any extra dressing around the plate."]}, {"isVegetarian": true, "title": "Chargrilled pears with spinach and coriander salad and tomato chutney", "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pear, cut into quarters, cored and skin left on", "4 thin slices ciabatta brushed with olive oil", "100g/3½oz baby leaf spinach", "small bunch fresh coriander, roughly chopped", "2 slices toast, cut into thick croutons and tossed in olive oil", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "¼ onion, chopped", "1 garlic clove, finely sliced", "50g/1¾oz brown sugar", "150g/5½oz cherry tomatoes, halved", "3 tbsp white wine vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Add the pear quarters and griddle on both sides for one minute to create grill lines, then remove from the heat and set aside.", "Place the ciabatta bread onto the griddle pan and cook for one minute on each side to create grill lines. Remove and set aside.", "To make the salad, take two of the griddled pear quarters and chop them into small dice.", "Place the spinach, coriander, croutons and diced pear in a large bowl and mix together well.", "Add the olive oil, season, to taste, with salt and freshly ground black pepper and set aside.", "To make the chutney, place the olive oil in a frying pan over a medium heat. Add the onion and garlic and fry for one minute.", "Add the brown sugar and cherry tomatoes and cook for a further minute.", "Add the white wine vinegar and heat to simmer and cook to reduce for five minutes.", "To serve, place the salad on a plate with the remaining chargrilled pear pieces and ciabatta placed around the salad. Pour the chutney into a small bowl and serve beside the salad."]}, {"isVegetarian": false, "title": "Chargrilled steak with beer, mustard and watercress salad", "url": "www_bbc_co_uk_food_recipes_chargrilledribeyeste_91464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledribeyeste_91464_16x9.jpg", "ingredients": ["150ml/5f loz cider vinegar", "5 tbsp caster sugar", "60g/2½oz yellow mustard seeds", "25g/1oz brown mustard seeds", "2 tbsp English mustard powder", "110ml/4fl oz beer", "2 x 250g/9oz ribeye steaks", "2 tbsp olive oil", "salt and freshly ground black pepper", "½ small wholegrain loaf, cut into 1.5cm/3in cubes", "2 tsp cider vinegar", "1½ tbsp rapeseed oil", "salt and freshly ground black pepper", "1 bunch watercress, leaves only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the homemade beer mustard, place the vinegar and sugar into a non-reactive pan and bring to a simmer. Add the yellow and brown mustard seeds and the mustard powder and stir well. Simmer over a high heat for three minutes, until the volume of liquid has reduced by half and the seeds have softened slightly.", "Pour the mustard mixture into the bowl of a food processor and blend to a purée. It will take a few minutes for the seeds to break down and the mustard to become creamy.", "Add the beer to the mustard mixture and blend once more. Season to taste with salt and freshly ground black pepper. Use immediately or spoon into jars, seal and store in the refrigerator. (NB This recipe makes more mustard than required for the dish.)", "For the steak, heat a griddle pan until hot. Rub the steaks with one tablespoon of the olive oil, then season to taste with salt and freshly ground black pepper.", "Place the steaks onto the hot griddle and cook without moving for 1-2 minutes, then turn 90 degrees with tongs and cook for a further minute, to give the steaks a lattice pattern of griddle marks. Turn the steaks over and repeat the process on the other side. Remove the steaks from the pan and place onto a plate to rest; keep warm.", "Meanwhile, for the salad, heat the remaining oil in a frying pan, add the bread cubes and fry for 2-3 minutes, turning occasionally, until crisp and golden-brown. Remove the croûtons with a slotted spoon, drain onto kitchen paper and season to taste with salt and freshly ground black pepper.", "Place one teaspoon of the homemade mustard into a large bowl. Add the cider vinegar, whisk in the rapeseed oil and season to taste with salt and freshly ground black pepper. Add the croutons and watercress and mix well.", "To serve, cut the steaks into thick slices and spoon the mustard into 2 small pots. Pile the salad onto the centre of each plate. Lay the steak over the salad and serve with a mustard pot on the side."]}, {"isVegetarian": false, "title": "Chargrilled salmon with creamed garlic peas and a balsamic reduction", "url": "www_bbc_co_uk_food_recipes_chargrilledsalmonwit_88191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salmon fillet, skin removed", "dash olive oil", "salt and freshly ground black pepper", "100g/3½oz fresh peas", "15g/½oz butter", "1 garlic clove, finely chopped", "3 tbsp double cream", "1 sprig fresh thyme, leaves only", "salt and freshly ground black pepper ", "3 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, rub the salmon with olive oil, salt and freshly ground black pepper. Heat a griddle pan until hot, add the salmon and griddle for 1-2 minutes on each side, or until charred on the outside and just cooked through.", "For the creamed garlic peas, place the peas into a pan of boiling salted water and boil for 2-3 minutes, or until tender and then drain. Place the cooked peas into a small pan, add the butter and garlic and fry gently for 1-2 minutes. Add the cream, thyme, salt and freshly ground black pepper and simmer for two minutes.", "For the balsamic reduction, pour the balsamic vinegar into a small pan and simmer for ten minutes, or until reduced and sticky.", "To serve, spoon the peas onto a serving plate. Top with the chargrilled salmon and drizzle the balsamic reduction onto the plate."]}, {"isVegetarian": false, "title": "Chargrilled sea bass with potato rosti, sautéed vegetables and sauce vierge", "url": "www_bbc_co_uk_food_recipes_chargrilledseabasswi_88624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 sea bass fillet, skin scored", "salt and freshly ground black pepper", "½ lemon, juice only ", "½ large red potato, peeled and grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 tbsp olive oil", "½ carrot, cut into batons", "½ courgette, cut into batons", "salt and freshly ground black pepper", "5 tbsp olive oil", "1 tomato, seeds removed, chopped", "1 garlic clove, finely chopped", "2 tbsp balsamic vinegar", "1 handful fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled sea bass, heat the oil in a griddle pan until hot. Season the fish with salt and freshly ground black pepper and fry for about three minutes, skin-side down. Turn the fillet over and remove from the heat. Squeeze over the lemon juice and allow to continue cooking in the residual heat, until cooked through. ", "For the potato rösti, place the grated potato into a clean tea towel and squeeze out the excess water. Season the potato with salt and freshly ground black pepper. Heat the oil in a small frying pan and pack the seasoned potato into the pan. Allow to cook through without stirring, turning once, until golden-brown on both sides, about 4-5 minutes per side.", "For the sautéed vegetables, heat the oil in a wok and stir fry the carrot and courgette for about 4-5 minutes. Season with salt and freshly ground black pepper.", "For the sauce vierge, place all the ingredients into a small pan and heat gently for about 3-4 minutes.", "To serve, place the rösti in the centre of a serving plate and top with the bass fillet. Arrange the vegetables to one side and spoon the sauce vierge around the edge."]}, {"isVegetarian": false, "title": "Chargrilled sesame tiger prawn skewers with broccoli", "url": "www_bbc_co_uk_food_recipes_chargrilledsesametig_90507", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 raw tiger rawns, shelled but heads and tails left on", "1 lime, half cut into wedges, half juiced", "1 tbsp soy sauce", "1 tbsp honey", "1 tbsp sesame seeds", "½ head broccoli, cut into florets and cooked", "1 pinch chilli flakes", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak a wooden skewer in cold water for 10-15 minutes. Drain.", "For the prawns, thread the prawns onto the skewer, alternating with two wedges of lime. Heat a chargrill pan until smoking and grill the skewers for 1-2 minutes, then turn over. Sprinkle the lime juice, soy sauce, honey and sesame seeds over the prawns and cook for a further 1-2 minutes, or until the prawns are pink and cooked through. ", "For the broccoli, toss the broccoli with the chilli flakes and oil, and season well with salt and freshly ground black pepper.", "To serve, spoon the broccoli arrabiata onto a serving plate and top with the prawn skewer."]}, {"isVegetarian": false, "title": "Chargrilled smoked salmon with rocket and parmesan", "url": "www_bbc_co_uk_food_recipes_chargrilledsmokedsal_10015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz fresh parmesan", "4 tbsp olive oil", "2 tbsp balsamic vinegar", "sea salt and freshly ground black pepper", "200g/7oz rocket leaves", "225g/8oz sliced smoked salmon"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a potato peeler, shave the parmesan into thin strips, set to one side.", "Mix the olive oil together with the vinegar and some seasoning. Mix into the rocket leaves and place on the plates.", "Heat a griddle pan to a high heat. Fold each slice of smoked salmon into three to make one thicker slice. Season with black pepper and drizzle on one side with a little olive oil.", "When the pan is very hot, place the salmon on it, oiled side down, and leave for about 15 seconds and then turn a quarter turn and cook for a further 15 seconds and then remove. Do not turn it over, only cook on one side.", "Sprinkle the rocket with the parmesan shavings and place the salmon, charred side up, on the top. Serve immediately."]}, {"isVegetarian": false, "title": "Chargrilled spiced salmon with sauce vierge and broccoli", "url": "www_bbc_co_uk_food_recipes_chargrilledspicedsal_92387", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp coriander seeds, crushed", "½ tsp cumin seeds, crushed", "salt and freshly ground black pepper", "100g/3½oz salmon fillet, skin removed", "1 tbsp olive oil", "1 tomato, skin and seeds removed, cut into small dice", "½ lemon, juice only", "½ lime, juice only", "salt and freshly ground black pepper", "½ tsp coriander seeds", "handful fresh basil leaves, torn", "handful cooked broccoli florets", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, combine the coriander and cumin seeds in a bowl with the salt and freshly ground black pepper. Press the salmon fillets into the mixture on both sides. ", "Heat the olive oil in  a griddle pan and cook the salmon for 5-7 minutes or until cooked through, turning it over halfway through. (NB The salmon is cooked when the flesh is opaque.)", "For the sauce vierge, heat all the ingredients gently in a pan for 1-2 minutes until warmed through.", "To serve, put the spiced salmon onto a plate with the broccoli florets alongside. Drizzle the sauce vierge around the outside of the plate and garnish with the chopped chives."]}, {"isVegetarian": false, "title": "Chargrilled squid", "url": "www_bbc_co_uk_food_recipes_chargrilledsquid_74747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ squid, cleaned", "drizzle of oil", "squeeze of lime juice", "pinch of chilli flakes", "85g/3oz cooked couscous (cooked weight)", "1 lemon, juice only", "salt and freshly ground black pepper", "handful of dill", "55g/2oz pine nuts, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut slits in the squid flesh to make a criss-cross pattern. Drizzle with oil and the lime juice and sprinkle with a pinch of chilli flakes. Leave to marinate for a few minutes (or longer if time allows).", "Heat a griddle pan until hot. Griddle the squid for 1-2 minutes on each side.", "Place the couscous in a bowl and stir in the lemon juice, seasoning, dill and pine nuts. ", "Spoon onto a serving plate and serve the squid on top."]}, {"isVegetarian": false, "title": "Chargrilled squid with chilli oil and salsa", "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_75828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large tube of squid, skin scored ", "1 tbsp vegetable oil", "1 tbsp dried chilli flakes", "salt and freshly ground black pepper", "1 tbsp dried chilli flakes", "75g/2¾oz pineapple into chunky pieces", "1 lemon, juice only ", "1 lime, juice only ", "1 tbsp icing sugar", "15g/½oz Drunken Lady lettuce (substitute mixed salad leaves or seasonal leaves)", "15g/½oz Lazy Blonde lettuce (substitute mixed salad leaves or seasonal leaves)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the squid, cut it into three equal pieces.", "Place a griddle pan on a high heat.", "Coat the squid with oil and chilli flakes and season with salt and freshly ground black pepper.", "Place onto the hot griddle pan.  Turn off after one minute and take the squid off the heat.", "To make the salsa, combine the chilli, pineapple, lemon and lime juices and the icing sugar in a medium sized bowl.", "Garnish with the lettuce and place the squid on top."]}, {"isVegetarian": false, "title": "Chargrilled squid with sauce vierge", "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_85077", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz squid, cleaned, scored to make a diamond pattern", "1 tbsp olive oil", "salt and freshly ground black pepper ", "100g/3½oz green olives, pits removed, chopped", "1 tomato, chopped", "1 garlic clove, chopped", "pinch chilli flakes", "1 tbsp capers, chopped", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled squid, rub the squid with the olive oil and season with salt and freshly ground black pepper. ", "Heat a griddle pan and cook the squid over a high heat for 1-2 minutes until lightly charred and cooked through.", "For the sauce vierge, place all of the sauce vierge ingredients into a small saucepan and warm through.", "To serve, place the chargrilled squid onto a plate with the sauce in a small bowl alongside."]}, {"isVegetarian": false, "title": "Chargrilled steak kebabs with tomato chutney", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakkeba_88675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rump steak, cut into large cubes", "salt and freshly ground black pepper", "2 tbsp olive oil", "25g/1oz butter", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "1 tbsp red wine vinegar", "1 tsp caster sugar", "1 tbsp tomato purée", "1 beef tomato, seeds removed, chopped", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the steak kebabs, soak two wooden skewers in a bowl of water for about 20 minutes, so that they don't burn during cooking.", "Thread the steak chunks onto the skewers and season well with salt and freshly ground black pepper, then rub with oil. Heat a griddle pan until hot and sear the kebabs until golden-brown on all sides. Transfer to the oven and bake for 5-7 minutes, or until cooked to your liking.", "For the tomato chutney, heat the butter and oil in a pan and gently fry the onion and garlic for 4-5 minutes.", "Stir in the vinegar, sugar, tomato purée and chopped tomato and season, to taste, with salt and freshly ground black pepper. Simmer gently for 6-8 minutes, or until the tomato starts to break down. Stir in the chopped herbs. ", "Serve the kebabs on a plate with the tomato chutney in a bowl on the side for dipping."]}, {"isVegetarian": false, "title": "Chargrilled steak and chips with roasted mushrooms, onion and crisp parsley", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakandc_88816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "125g/4½oz rump steak", "salt and freshly ground black pepper", "½ large baking potato, peeled and cut into chips", "6 cloves garlic, in their skins, crushed", "3 tbsp olive oil", "1 tbsp olive oil", "125g/4½oz closed cup mushrooms, quartered", "½ onion, thickly sliced", "handful flatleaf parsley leaves", "1 tsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the steak, heat a griddle pan until smoking. Rub the oil over the steak and season well with salt and freshly ground black pepper. Fry for 3-4 minutes on each side (for rare), or until cooked to your liking, then remove from the pan and allow to rest on a warm plate.", "For the chips, parboil the potato in boiling water for 4-5 minutes, then drain and place on a baking sheet. Place the crushed garlic on the baking tray and drizzle over the oil, then bake in the oven for about 12-15 minutes, or until the chips are golden-brown and crisp.", "For the mushrooms and onion, heat the oil in an ovenproof frying pan and fry the mushrooms and onion for 3-4 minutes before transferring to the oven to roast for 4-5 minutes.", "For the crisp parsley, rub the parsley leaves with the oil and place on a cling film covered plate. Heat in the microwave on high for 30 seconds, then remove to cool. ", "To serve, pile the chips and garlic onto the serving plate with the steak. Spoon the roasted mushrooms and onions onto the plate, and garnish with the crisp parsley."]}, {"isVegetarian": false, "title": "Chargrilled steak skewers with carrot, coriander and mint salad", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakskew_90316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rump steak", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 carrot, peeled and sliced into ribbons with a peeler", "1 tbsp fresh chopped coriander", "1 tbsp fresh chopped mint", "1 tbsp fresh chopped basil", "½ tsp salt", "½ lime, juice only", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak three wooden skewers in a bowl of cold water for 10-12 minutes, then drain and set aside. ", "For the steak, cut the meat into strips and thread onto the skewers. Season with salt and freshly ground black pepper and drizzle with the oil. Heat a chargrill pan until smoking, then add the skewers and fry for 1-2 minutes on each side, or until browned all over and cooked to your liking.", "For the salad, combine the carrot and herbs in a bowl and add the rest of the ingredients. Toss well to coat, then transfer to a serving plate. ", "Serve the skewers on top of the salad, garnished with the coriander leaves."]}, {"isVegetarian": false, "title": "Char-grilled steak with roast parsnip, sauté potatoes and mayonnaise", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_78946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 parsnip, peeled and quartered", "1 tbsp olive oil", "salt and freshly ground black pepper", "100g/3½oz potato, cut into 1cm rounds and blanched", "1 tbsp olive oil", "1 tbsp rosemary, chopped", "100g/3½oz rump steak medallion", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg yolk", "150ml/¼ pint vegetable oil", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200c/400F/Gas 6.", "For the parsnips, blanch in boiling water for one minute. Drain and transfer to a roasting tin, toss in olive oil and roast in the oven for ten minutes.", "For the potatoes, heat a griddle pan and coat the potatoes in the oil and rosemary. Place on the griddle and cook for two minutes on each side, or until cooked through.", "For the beef, heat a separate griddle pan. Rub the steak with the oil and the seasoning and place on the griddle. Cook for two minutes on each side, or until cooked to your liking. Remove from the heat and allow to rest.", "Meanwhile, for the mayonnaise, blend the egg yolk in a food processor and gradually add the oil and white wine vinegar.", "Once blended into mayonnaise, stir through the mustard and season to taste with salt and freshly ground black pepper.", "To serve, place the potatoes on a warm dish, top with the roast parsnips and then add the steak. Finish with a dollop of mayonnaise."]}, {"isVegetarian": false, "title": "Chargrilled steak with mushroom sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_83609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sirloin steak", "1 tbsp olive oil", "25g/1oz unsalted butter, chopped", "1 tbsp olive oil", "¼ red onion, finely chopped", "1 clove garlic, finely chopped", "1 Portobello mushroom, sliced", "50ml/2fl oz red wine", "50ml/2fl oz hot beef stock", "1 tsp chopped fresh chervil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the steak, heat a griddle pan until smoking. Rub the steak with the oil then season both sides with salt and freshly ground black pepper. Add the steak to the hot griddle and chargrill for 3-4 minutes on each side, or until cooked to your liking. Remove form the heat to rest for 2-3 minutes.", "To make the sauce, melt the butter with the oil in a frying pan over a medium heat. Add the onions and garlic and cook until softened.", "Add the mushroom and sauté until cooked through.", "Add the red wine and beef stock and bring to the boil. Reduce the heat and simmer until the liquid has reduced and thickened, then add the chervil and stir.", "To serve, place the steak in the middle of a warm plate and spoon the sauce around."]}, {"isVegetarian": false, "title": "Chargrilled steak with sweet potato mash, peas and red wine sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_84091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "½ onion, chopped", "½ sweet potato, peeled and chopped into small cubes", "1 tbsp chopped parsley", "1 tbsp chopped chives", "100ml/3½fl oz red wine vinegar", "2 tbsp butter", "1 tbsp honey", "110ml/4fl oz beef stock", "40g/1½oz peas", "140g/5oz rump steak", "oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mash, place the butter into a saucepan to melt. Add the onion and sweet potatoes. Cover and cook for ten minutes, or until softened. Add the parsley and chives and mash until smooth. Keep in a warm place. ", "For the sauce, place the vinegar, butter, honey, and beef stock into a saucepan. Once boiling reduce the heat to simmer, and let sauce thicken. After 5-6 minutes add the peas. ", "Season the steak, with sea salt and freshly ground black pepper. Heat a griddle pan on a high heat and add the steak and cook for 3-4 minutes on each side, or until cooked toyour liking.", "To serve, place the steak on a plate, add the mash and drizzle with the sauce."]}, {"isVegetarian": false, "title": "Chargrilled steak with mustard and peppercorn dressing, tempura shallots and green beans and a rosti", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_92435", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rump steak", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tsp wholegrain mustard", "1 tbsp chopped fresh chives", "1 tbsp green peppercorns, crushed", "3 tbsp olive oil", "1 tbsp water", "1 tsp caster sugar", "salt and freshly ground black pepper", "150g/5oz plain flour", "200ml/7fl oz fizzy water", "vegetable oil, for deep frying", "1 shallot, peeled, cut into thick rings", "1 handful green beans, trimmed", "½ baking potato, peeled, grated", "1 tbsp olive oil", "1 tbsp butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the steak, season the steak with salt and freshly ground black pepper. Heat a griddle pan until hot, brush the steak with the olive oil and fry on the griddle for 3-4 minutes on both sides (for medium), or until cooked to your liking. Remove from the pan and leave to rest on a warm plate covered with foil.", "For the dressing, whisk all of the dressing ingredients together in a bowl and set aside.", "For the tempura, mix the flour with enough water in a bowl to make a batter with the consistency of single cream. ", "Half-fill a deep, heavy-based pan with the oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Dip the shallot rings and beans into the batter before deep-frying in the oil for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the rösti, place the grated potato into a clean tea towel and wring out any excess moisture. Heat the olive oil and butter together in a small frying pan and pack the grated potato into the pan. Season well with salt and freshly ground black pepper and fry over a medium-low heat for 5-7 minutes on both sides, or until golden-brown and cooked through.", "To serve, place the tempura shallots and green beans alongside the steak. Place the rösti next to the steak, then drizzle over the mustard and peppercorn dressing."]}, {"isVegetarian": false, "title": "Chargrilled sweet and sour prawns", "url": "www_bbc_co_uk_food_recipes_chargrilledsweetands_90198", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledsweetands_90198_16x9.jpg", "ingredients": ["6 large prawns, butterflied, shells on, but heads removed", "pinch sea salt", "drizzle vegetable oil", "large handful fresh coriander", "1 lime, juice only", "4-5 tbsp white wine vinegar", "3-4 tbsp caster sugar", "4cm/1in piece fresh ginger, unpeeled", "1 mild red chilli, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To butterfly the prawns, first remove the head by twisting it off, then discard. Don't remove the shell. Place the prawn on its back on a cutting board. Using a small, sharp knife, cut through the centre of the body from below the head down to the tail. Don't cut all the way through the flesh. Repeat with the remaining prawns.", "For the sweet and sour sauce, pour the vinegar into a small pan (not aluminium) over a medium heat. Add the sugar and heat through.", "Slice the ginger into thick slices and add to the sauce in the pan.", "Slice the chilli and add to the pan. Simmer the sauce until the sugar is dissolved and the sauce is reduced and sticky - about five minutes. Taste and adjust flavour as needed by adding a touch more sugar or vinegar, as necessary.", "Meanwhile, heat a ridged grill pan until hot. Sprinkle the sea salt over the prepared prawns. Pour over the oil, then rub it into the prawns.", "Place the prawns on the hot grill pan and grill until cooked through and slightly charred (this will take about 2-3 minutes). Press down lightly with tongs to ensure even cooking. Turn the prawns over and cook for another 2-3 minutes on the other side.", "Chop the fresh coriander. When the prawns are cooked, transfer them into the pan with the reduced sauce.", "Add the coriander and a squeeze of fresh lime juice to the pan.", "Stir together until the prawns are coated in the sauce. Serve straightaway."]}, {"isVegetarian": true, "title": "Chargrilled sweetcorn with chilli jam", "url": "www_bbc_co_uk_food_recipes_chargrilledsweetcorn_85322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomato, seeds removed, chopped", "1 tsp tomato purée", "1 tsp clear honey", "large pinch dried chilli flakes", "splash water", "salt and freshly ground black pepper", "1 corn cob", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli jam, place the tomato, tomato purée, honey, chilli flakes and a splash of water into a small saucepan. Season with salt and freshly ground black pepper and heat gently until combined and thickened.", "For the chargrilled sweetcorn, heat a griddle pan until hot. Rub the corn with olive oil and chargrill for 10-12 minutes, turning occasionally, until tender.", "To serve, carefully chop the corn into chunks and place onto a plate with a spoonful of chilli jam."]}, {"isVegetarian": true, "title": "Char-grilled sweet potato medallions with cauliflower cheese", "url": "www_bbc_co_uk_food_recipes_chargrilledsweetpota_80051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ sweet potato, peeled and cut into 6 1cm/0.5in thick rounds ", "1 tbsp olive oil", "3 egg yolks", "50ml/2fl oz double cream", "100g/3½oz grated cheddar", "50g/1¾oz cauliflower florets, blanched", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the potato, in a large bowl toss the potato rounds in the olive oil and season well.", "Heat a griddle pan until smoking.", "Char-grill the potato medallions for two minutes on each side. Transfer to the oven and roast for 10 minutes.", "Remove from the oven and place on an ovenware dish.", "To make the cauliflower, in a large bowl mix together the yolks, cream, cheese and cauliflower. Season with salt and freshly ground black pepper.", "Place the mixture over the sweet potato and return to the oven to cook for a further five minutes.", "Serve in the ovenware dish."]}, {"isVegetarian": false, "title": "Chargrilled Thai beef salad", "url": "www_bbc_co_uk_food_recipes_chargrilledthaibeefs_73736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp jasmine rice, uncooked", "2 dried red chillies ", "500g/1lb 2oz thick fillet steak", "2 tbsp sesame oil", "75ml/2½fl oz kecap manis (Indonesian sweet soy sauce)", "2 tsp sugar", "4 tbsp lime juice", "3 tbsp Thai fish sauce", "1 small cucumber, peeled, de-seeded, halved lengthways and cut into 1cm/0.5in slices", "4 red shallots, finely sliced", "12 cherry tomatoes, halved", "2 red chillies, finely sliced", "1 handful fresh mint leaves", "1 handful fresh coriander leaves", "2 tbsp fresh basil leaves, ripped", "4 spring onions, finely sliced"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Heat a dry frying pan, add the rice and toast until golden but not burnt. Grind the rice in a clean coffee-grinder or pound to a powder and set aside.", "Reheat the frying pan and add the dried red chillies. Toast until they are smoky, then grind or pound to a powder and set aside.", "Chargrill or pan-fry the beef for around 12 minutes, until well marked outside and rare to medium-rare inside. Place in a bowl and leave to rest for 10 minutes. Meanwhile, combine the sesame oil with the kecap manis and brush over the fillet. Marinate for two hours. ", "Dissolve the sugar in the lime juice and fish sauce. Combine half a teaspoon of the ground dried chilli powder with half a teaspoon of the ground rice and set aside. Combine the cucumber, shallots, cherry tomatoes, red chillies, herbs and spring onions in a large bowl. Add the lime juice and fish sauce mixture and toss to combine. ", "Slice the beef thinly. Toss the beef and ground rice mix through the salad with any cooking juices that have collected  in the be bowl. Pile high on a large platter and serve with a salad of crunchy raw lettuce."]}, {"isVegetarian": false, "title": "Chargrilled tarragon chicken, roast beetroot and crisp pancetta", "url": "www_bbc_co_uk_food_recipes_chargrilledtarragonc_84393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz mini chicken fillets", "1 tbsp olive oil", "1 tbsp chopped fresh tarragon", "salt and freshly ground black pepper", "1 tbsp Dijon mustard", "75ml/3fl oz chicken stock", "75ml/3fl oz double cream", "½ packet of cooked beetroot, rinsed, drained and chopped", "2 tbsp demerara sugar", "1 tsp balsamic vinegar", "1 tbsp olive oil", "75g/3oz pancetta, fried  until crisp", "100g/3½oz ready-made croutons", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, place the chicken fillets, olive oil and tarragon into a bowl and mix together. Season with salt and freshly ground black pepper.", "Heat a griddle pan over a high heat, until smoking, then grill the chicken for three minutes on each side.", "Add the mustard and chicken stock, stir and reduce by half.", "Add the cream and reduce, until thick, then with season with salt and freshly ground black pepper.", "For the beetroot and bacon, place the beetroot into a bowl with the sugar and balsamic vinegar, then season with salt and freshly ground black pepper.", "Heat the olive oil in an ovenproof frying pan over a medium heat and add the beetroot mixture. Fry for two minutes, then place into the oven for five minutes.", "To serve, place the chicken onto a serving plate and pour over the sauce. Garnish with the crisp pancetta and croutons. Serve the beetroot in a serving bowl to the side."]}, {"isVegetarian": false, "title": "Chargrilled Thai-style tuna with courgette ribbons and fragrant rice", "url": "www_bbc_co_uk_food_recipes_chargrilledthaistyle_85305", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ green chilli, seeds removed, finely chopped", "1 garlic clove, chopped", "2 tbsp soft brown sugar", "1cm/½in piece galangal (or ginger), peeled and finely chopped", "¼ stick lemongrass, outer layer removed, finely chopped", "2 tbsp white wine vinegar", "1 tbsp olive oil", "55g/2oz unsalted cashews, crushed", "1 tbsp soy sauce", "1 lime, juice only", "1½ tbsp olive oil", "1 x 150g/5½oz tuna steak", "1 courgette, sliced into very thin ribbons", "2 tsp sesame oil", "2 tsp sesame seeds", "100g/3½oz jasmine rice (Thai rice), cooked according to packet instructions, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the Thai-style tuna, place all the ingredients except the tuna into a bowl and mix well.", "Place the tuna into the bowl and leave to marinate for a few minutes. Remove the tuna and reserve the dressing.", "Heat a griddle pan until hot and chargrill the tuna for 2-3 minutes on each side, or until cooked to your liking.", "Place the dressing into a small saucepan and heat gently until just simmering, then reduce the heat.", "For the courgette ribbons, place the courgette ribbons into a pan with the sesame oil and gently warm through. Sprinkle over the sesame seeds.", "To serve, place the cooked rice onto a serving plate, top with the tuna and courgette ribbons and pour over the warm dressing."]}, {"isVegetarian": false, "title": "Chargrilled tuna with roast red onion, tomato and coriander vinaigrette and shoestring potatoes", "url": "www_bbc_co_uk_food_recipes_chargrilledtunawithr_86657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 plum tomatoes, peeled, cut into quarters", "2 red onions, roughly sliced", "2 tbsp light olive oil", "1 tsp coriander seeds, crushed", "½ tsp salt", "125ml/4½fl oz extra virgin olive oil", "2 tbsp lemon juice", "4 x 175g/6oz tuna steaks", "pinch salt", "1 tbsp coriander seeds, crushed", "1 tbsp black peppercorns, cracked", "2 tbsp light olive oil", "2 large baking potatoes, finely sliced into strips", "salt and freshly ground black pepper", "2 tbsp fresh coriander, roughly chopped", "125g/4½oz rocket leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the tomatoes, red onion, light olive oil, coriander seeds, and salt into a bowl and mix together gently.", "Transfer the tomato mixture onto a baking sheet and place under the grlll for 10-12 minutes, until just turning golden-brown, turning occasionally.", "Transfer the grilled tomato mixture to a large bowl and add the extra virgin olive oil and lemon juice. Mix gently to combine and coat, then set aside.", "For the tuna, preheat a griddle pan until hot.", "Season the tuna lightly with salt.", "Mix the crushed coriander seeds and peppercorns together and sprinkle evenly onto a plate. Press the tuna steaks onto the spice mixture to evenly coat on both sides, then drizzle with the olive oil.", "Place the tuna steaks onto the griddle pan and cook for 1-2 minutes on each side, or until cooked to your liking.", "For the shoestring potatoes, preheat a deep fat fryer to 190C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the potato strips into a bowl of cold water and soak for five minutes, then remove from the water and pat dry with kitchen paper.", "Place the potatoes into the deep fat fryer and cook for 2-3 minutes, or until golden and crisp. Carefully remove with a slotted spoon and drain onto kitchen paper. Season, to taste, with salt and black pepper.", "To serve, add the fresh coriander to the tomato and onion mixture. Spoon the tomato and onion mixture onto warmed plates, then place a pile of rocket leaves in the centre of each plate.", "Top each pile of rocket with a tuna steak, and place a large spoonful of shoestring potatoes on top."]}, {"isVegetarian": false, "title": "Charlotte royale", "url": "www_bbc_co_uk_food_recipes_charlotte_royale_69785", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/charlotte_royale_69785_16x9.jpg", "ingredients": ["1 pack raspberry jelly", "400g/14oz raspberries", "25g/1oz icing sugar", "150ml/5fl oz milk", "100g/3½oz caster sugar", "3 free-range egg yolks", "6 sheets leaf gelatine, soaked in cold water for 5 minutes, drained", "300ml/10½fl oz double cream", "8 free-range eggs", "150g/5½oz caster sugar, plus extra for dusting", "1½ tsp vanilla bean paste", "150g/5½oz plain flour", "150g/5½oz raspberry jam", "4-5 ripe strawberries, halved", "2-3 fresh mint sprigs"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the charlotte, prepare the raspberry jelly according to the packet instructions, and leave to set in a small round bowl in the fridge for 1 hour.", "Blend the raspberries and icing sugar to a purée in a food processor, then strain the purée through a fine sieve into a bowl, discarding the seeds.", "Heat the milk and half of the sugar in a saucepan until just simmering. Meanwhile, whisk the remaining caster sugar and all of the egg yolks in a bowl until pale and thick. ", "Pour the warm milk over the egg yolk mixture, whisking all the time, until well combined. ", "Return the custard mixture to the saucepan and cook, whisking well, until it thickens just enough to coat the back of a spoon — make sure that it doesn’t boil. Add the drained, squeezed gelatine to the custard and stir until dissolved.", "Whisk the hot custard with the raspberry purée until smooth and well combined. Set aside to cool, then chill in the fridge for at least 30 minutes.", "Meanwhile, for the Swiss roll, preheat the oven to 190C/170C Fan/Gas 5. Line 2 x 25x38cm/10x15in Swiss roll tins with baking parchment.", "Whisk the eggs, sugar and vanilla bean paste in a large bowl until very light, fluffy and thickened. Fold the flour into the mixture using your hand, carefully lifting and mixing until it has all been incorporated.", "Divide the Swiss roll mixture between the prepared tins and smooth the top until evenly spread out. Bake for 10-12 minutes, or until springy and just firm to the touch.", "Wet 2 large clean tea towels and wring them out. Place them on a work surface and dust with caster sugar. Turn the sponges out onto the tea towels, then peel away the parchment.", "Spread the raspberry jam all over the sponges, leaving a 2cm/1in border at one of the narrow ends. Tightly roll up the sponges, starting with the end with a border and using the tea towel to help you. ", "Grease a large pudding or trifle bowl with a little vegetable oil and line it with 3 sheets of cling film. ", "Slice the Swiss rolls into 1cm/½in-thick slices and use them to line the sides and base of the pudding bowl, starting at the bottom, and working your way up to cover all of the inside of the bowl, making sure there are no holes.", "Add the set jelly to the pudding bowl, breaking it up if necessary.", "Whisk the double cream until soft peaks form when the whisk is removed. Fold the cream into the chilled raspberry custard, then spoon the mixture on top of the jelly. Chill in the fridge for at least 4 hours. ", "To serve, upturn the pudding bowl onto a serving platter. Remove the cling film and decorate with the strawberries and mint. Serve in slices."]}, {"isVegetarian": true, "title": "Chargrilled vegetables and Aragon olives with Montenebro", "url": "www_bbc_co_uk_food_recipes_chargrilledvegetable_70903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 30g slices of Montenebro or any other goats cheese", "200g/7oz chargrilled aubergines", "200g/7oz chargrilled courgettes", "200g/7oz chargrilled artichokes", "200g/7oz wood roasted red peppers or conventionally roasted red peppers", "30g/1oz Aragon black olives or any other black olives", "20g/¾oz toasted pine nuts", "80g/3oz fresh pesto", "10g/½oz fresh oregano, dill and basil, chopped", "balsamic vinegar", "virgin olive oil", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Place the vegetables into a bowl and add the olives.  ", "Place the herbs, pesto and olive oil into a separate bowl and add the balsamic to make a dressing.  Season and leave to one side.  ", "Place the slices of the cheese on a grill tray and season with olive oil, salt and pepper.  ", "Place under a hot grill for about four minutes until golden brown on top and soft in the middle.  While cooking pour the dressing into the vegetables and mix with some seasoning.  ", "Pile the vegetables onto the four plates and drizzle with the toasted pine nuts.  ", "Top with the goat's cheese and serve with the rest of the dressing drizzled around the edge of the plates."]}, {"isVegetarian": false, "title": "Charlotte royale", "url": "www_bbc_co_uk_food_recipes_charlotte_royale_85654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/charlotte_royale_85654_16x9.jpg", "ingredients": ["400g/14oz strawberries, hulled and roughly chopped", "500g/1lb 2oz jam sugar", "knob of butter", "6 large free-range eggs", "150g/5½oz caster sugar, plus extra for sprinkling", "150g/5½oz self-raising flour", "9 leaves gelatine ", "550g/1lb 4oz raspberries ", "2 tbsp raspberry liqueur", "600ml/20fl oz full-fat milk", "8 free-range egg yolks", "100g/3½oz caster sugar", "450ml/16fl oz double cream", "100g/3½oz small strawberries", "75g/2½oz caster sugar", "1 tbsp arrowroot", "150ml/5fl oz double cream", "25g/1oz icing sugar", "10 medium strawberries "], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the jam, place the strawberries in a small pan with the sugar and cook over a low heat until the sugar has melted. Add the knob of butter. Bring to the boil and boil vigorously for four minutes, or until the temperature on a sugar thermometer reaches 104C/219F (setting point). Remove from the heat and stir in the knob of butter. Transfer to a large bowl and leave to set.", "For the sponge rolls, preheat the oven to 220C/fan 200C/425F/Gas 7. Grease and line two 33cm x 23cm/13 x 9in Swiss roll tins with baking parchment. Whisk the eggs and sugar together in a large bowl until the mixture is light and frothy and the whisk leaves a trail when lifted out. Sift the flour into the mixture and carefully fold it in.  Divide the mixture between the prepared tins and give it a gentle shake so that the mixture finds its own level, making sure that it has spread evenly to the corners.", "Bake in the two Swiss roll tins for 10–12 minutes, or until the sponges are golden-brown and begin to shrink from the edges of the tin.  While the cakes are cooking, place two pieces of baking parchment a little bigger than the size of the tin on the work surface and sprinkle with caster sugar.", "Turn the cakes out onto the sugared parchment and peel off the paper.  Trim the edges of the sponges with a sharp knife and score 2cm/¾in from the short edge, being careful not to cut right through.  ", "Leave to cool slightly, then spread with jam and roll up the cakes firmly from the scored end and set aside.", "For the bavarois, soak the gelatine in cold water until soft. Purée 450g/1lb of the raspberries in the bowl of a food processor. Pass the raspberries through a sieve over a bowl and discard the seeds. Stir the raspberry liqueur into the purée and set aside.", "Pour the milk into a pan and heat until just under boiling point. Whisk the egg yolks and caster sugar together until pale and creamy. Pour the hot milk over the eggs and whisk together.  Drain the gelatine, squeezing out any excess moisture and add it to the custard.  Return the custard to the pan and cook until the mixture coats the back of a spoon.  Do not boil as this will split the custard and prevent the gelatine from setting. Remove from the heat, transfer to a clean bowl and leave to cool slightly before folding in the raspberry purée. Leave to cool for at least 30 minutes.  ", "Meanwhile, line the base of a 2 litre/3½ pint round bowl with cling film, to help turn the Charlotte royale out. Slice the Swiss rolls into 1.5cm/⅝in slices and use to line the base and sides of a bowl. Pack the slices closely together so that no filling can seep through, reserving enough slices to cover the top (which will become the base).", "In a bowl, whip the cream until soft peaks form when the whisk is removed from the bowl and stir into the raspberry bavarois. Fold in the remaining 100g/3½oz of raspberries and the small strawberries and spoon into the lined bowl.  ", "Cover with the remaining cake slices. Cover with cling film and chill in the fridge overnight until set.", "Turn out the Charlotte royale onto a cooling rack.", "To decorate, tip the caster sugar into a pan with 125ml/4fl oz water and bring to the boil.  Dissolve the arrowroot in two tablespoons of cold water and stir into the sugar syrup. Bring to the boil, remove from the heat and leave to cool slightly before spooning over the Charlotte royale to glaze.", "Whip the cream and icing sugar in a bowl until soft peaks form when the whisk is removed from the bowl and spoon into a piping bag fitted with a medium star nozzle.  ", "Pipe a continual scallop design of cream around the base of the Charlotte royale and decorate with fanned and glazed strawberries."]}, {"isVegetarian": false, "title": "Charred hanger steak with asparagus and blue cheese dressing", "url": "www_bbc_co_uk_food_recipes_charred_hanger_steak_99567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large Spanish onion, left whole", "50g/1¾oz caster sugar ", "600g/1lb 5oz piece hanger steak ", "50g/1¾oz caster sugar ", "60g/2¼oz fine sea salt ", "2 juniper berries, crushed ", "1 garlic clove, crushed ", "1 bay leaf ", "50g/1¾oz basil, leaves picked, washed and dried     ", "125g/4½oz vegetable oil or other neutral oil ", "pinch salt ", "25g/1oz salt ", "25g/1oz caster sugar ", "8 spears asparagus, trimmed and stalks scrubbed ", "45g/1½oz blue cheese, preferably Garstang blue cheese, plus extra to garnish", "20g/¾oz goats' curd, preferably Leagram’s goats' curd", "2 tbsp buttermilk ", "25g/1oz soured cream ", "25g/1oz mayonnaise ", "25g/1oz stock syrup (not too sweet; ratio of 30% sugar to 70% water) ", "1 small garlic clove, finely chopped", "salt, to taste ", "Worcestershire sauce, to taste ", "white wine vinegar, to taste", "selection of fresh garden herbs ", "wild garlic or chive flowers"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the caramelised onion glaze, preheat the oven to 240C/220C Fan/Gas 9. Roast the onion on a tray for 1 hour or until the onion has softened and caramelised. ", "Meanwhile, for the hanger steak, put the sugar, salt, juniper berries, garlic, bay leaf and 500ml/18fl oz water into a large saucepan and set over a medium-high heat. Stir continuously while you bring the water to boiling point to help the sugar and salt dissolve. Remove from the heat and leave to cool completely. Put the hanger steak into the brine and leave for 1 hour at room temperature. ", "For the basil oil, roughly chop the basil leaves and place in the blender. Pour the oil into the blender and add a pinch of salt. Blend on full power for a couple of minutes until the basil leaves have completely broken down. Pass the oil through a sieve lined with muslin (cheesecloth) and allow to drain. Transfer to a small squeezy bottle or jar. ", "For the asparagus, pour 1 litre/1¾ pints water into a pan, bring to the boil and heavily season with the salt and sugar. When boiling, drop the asparagus into the water and cook for 1-2 minutes, or until the asparagus is just cooked. You should be able to just slip a small knife through the stem. Remove from the pan using a slotted spoon and plunge into a bowl of ice-cold water (this is to stop it cooking further and retain the colour). ", "For the dressing, put the cheese, curd, buttermilk, soured cream, mayonnaise, stock syrup and garlic in a blender (alternatively place in a jug and process with a stick blender). Pulse until smooth. ", "Season the dressing to taste with a little salt, Worcestershire sauce and white wine vinegar. Mix thoroughly and then store in a jar or a squeezy bottle in the fridge. Use within 4 days.", "When the onion is soft and caramelised, remove from the oven, but leave the oven on. Remove the skin and squeeze as much juice from the onion as you can. Reserve the juice. Add the caster sugar and 25ml/1fl oz water to a small saucepan and heat until a caramel forms. Add the reserved onion juice and reduce until thick enough to coat the back of a spoon. ", "When you’re ready to cook the steak, preheat an ovenproof, heavy-based frying pan over a high heat. Remove the steak from the brine and pat dry using kitchen paper. Drizzle a little oil into the hot pan and sear until the steak is nicely charred. Brush a little onion caramel over the steak and transfer the pan to the oven. Roast for about 4 minutes. ", "Return the pan from the oven back onto a high heat. Pour some more onion caramel over the steak and cook over the high heat until the steak has become caramelised and sticky, basting with onion caramel. Allow to rest in a warm place for 5 minutes before carving. ", "To serve, drizzle some blue cheese dressing in the centre of the plate and arrange the warm asparagus on top. Garnish with a few chunks of blue cheese. ", "Slice the steak into portions and arrange on serving plates. Dress with the cooking juices from the steak, a drizzle of basil oil and the herbs and wild garlic or chive flowers. Serve immediately."]}, {"isVegetarian": true, "title": "Charred bananas and ice cream with passion fruit soufflé and sesame-toffee bananas", "url": "www_bbc_co_uk_food_recipes_charred_bananas_and_ice_46997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ripe bananas, unpeeled", "2 sprigs fresh rosemary", "2 scoops good-quality ready-made vanilla ice cream", "1 passion fruit, seeds scooped out", "vegetable oil, for deep-frying", "75g/2½oz cornflour", "125ml/4½fl oz sparkling water", "1 ripe banana, peeled and cut in half lengthways", "150g/5oz caster sugar ", "2 tbsp sesame seeds ", "25g/1oz butter, softened, for greasing", "2 tbsp caster sugar, for dusting", "3 free-range egg whites", "50ml/2fl oz ready-made vanilla custard, plus extra to serve", "2 passion fruit, seeds scooped out", "1 tbsp icing sugar", "2 scoops good-quality ready-made vanilla ice cream"], "serves": "Serves 4 (2 adults and 2 children)", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the charred bananas and ice cream (the kids' dessert), preheat the oven to 200C/180C Fan/Gas 6.", "Using a sharp knife, make a small slit in one end of each banana. Stick a sprig of rosemary into each slit. ", "Heat a griddle pan over a high heat. Add the bananas and cook for 4-5 minutes on each side, or until blackened on all sides and heated through.", "To serve, split the bananas lengthways and open out slightly, then place onto serving plates (you can return them to their skins to serve, if desired). Top with a scoop of ice cream and sprinkle with the passion fruit seeds.", "For the sesame-toffee bananas (the adults' dessert), heat the oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Meanwhile, prepare a bowl of iced water.", "In a bowl, whisk together the cornflour and sparkling water until smooth and well combined. Add the banana halves and gently mix until coated. ", "Carefully lower the battered bananas into the hot oil and fry for 2-3 minutes, or until very light golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper.", "Meanwhile, heat the sugar, without stirring, in a heavy-based frying pan over a high heat. Swirl the pan until the sugar melts to a light golden-brown caramel. Stir in the sesame seeds, then dip the base of the pan into a sinkful of cold water to stop the caramel from cooking any further.", "Using a spoon, carefully roll the battered banana halves in the hot caramel, one at a time, until completely coated. (CAUTION: melted sugar is extremely hot.) Transfer to the bowl of iced water until completely cold, then set aside to drain. ", "For the soufflé, preheat the oven to 230C/210C Fan/Gas 8. Grease two large ramekins with butter, then dust the insides with a coating of sugar.", "Whisk the egg whites in a clean bowl until firm peaks form when the whisk is removed.", "Fold the custard and passion fruit seeds into the whisked egg whites, then spoon the mixture carefully into the ramekins, smooth the tops using a palette knife and place them on a baking tray.", "Bake the soufflés in the oven for 8-10 minutes, until risen and golden-brown.", "Dust the soufflés with the icing sugar and serve immediately, with a spoonful of custard, one of the sesame-toffee banana halves and a scoop of ice cream alongside. "]}, {"isVegetarian": true, "title": "Charred leeks with girolles and leek mayonnaise", "url": "www_bbc_co_uk_food_recipes_charred_leeks_with_40366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 leeks, cut in half lengthways", "800ml/1⅓ pint vegetable oil", "55g/2oz pasteurized egg yolks", "1 tbsp Dijon mustard", "500g/1lb 2oz leek oil (from above)", "4 tsp white wine vinegar", "2 tsp lemon juice", "1 medium leek, ends trimmed ", "salt and pepper", "1 thin baguette, thinly sliced ", "2-3 tbsp olive oil ", "2 egg yolks ", "vegetable oil or butter, for frying", "50g/1¾oz small girolles (chanterelle mushrooms)", "100ml/3½fl oz vegetable stock ", "vinaigrette (made from 3 tbsp olive oil, 1 tbsp white wine vinegar and 1 tsp Dijon mustard mixed together)", "few sprigs chives, green tops only", "few sprigs chervil, leaves picked ", "salt and pepper "], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the charred leek oil, heat a griddle. When hot, add the leeks cut-side down and cook until charred. Turn the leeks over and cook on the other side until soft. Place in a bowl with the oil and leave in a warm place (ideally around 50C/122F) for 4-5 hours. Then leave overnight to infuse. Strain the oil before using.", "For the leek mayonnaise, in a food processor, blend the egg yolks and mustard to combine. With the motor running add the leek oil in a thin steady stream until the mixture emulsifies to form a mayonnaise. Add the white wine vinegar and pulse to combine. Season with salt, pepper and a little lemon juice, to taste. Store in the fridge until ready to serve.", "For the leeks and girolles, season the whole leek with salt and pepper and place on a hot griddle until charred all over and soft. Transfer to a baking tray and cover with cling film to keep warm. ", "Season the baguette slices with salt and pepper and brush with olive oil. Toast both sides on the griddle to make croûtons.", "Warm the remaining leek oil in a small pan set over a low heat. Gently lower the egg yolks into the oil and poach very gently for about six minutes. ", "Heat the butter in a frying pan and, when foaming, fry the girolles until soft. Add the vegetable stock, then turn off the heat and stir a little vinaigrette into the mixture. ", "To serve, cut the warm leek in half and remove the blackened outer layer. In shallow bowls, toss the leek in the remaining vinaigrette.  Place the egg yolks on top, followed by the mushrooms and a spoonful of leek mayonnaise.  If desired spoon over some of the cooking liquor from the mushrooms. ", "Garnish with the toasted baguette and herbs."]}, {"isVegetarian": false, "title": "Chashu (Japanese braised pork)", "url": "www_bbc_co_uk_food_recipes_chashu_japanese_braised_37473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175ml/6fl oz dark soy sauce", "120ml/4fl oz sake", "3 tbsp mirin", "2 tbsp oyster or teriyaki sauce ", "75g/2½oz sugar", "500g/1lb 2oz skin-on piece pork belly, rolled ", "½ leek, sliced (or 1 small onion, sliced)", "4 whole garlic cloves, peeled ", "4cm/1½in piece ginger, thickly sliced"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the soy sauce, sake, mirin, oyster sauce (or teriyaki sauce) and sugar in a small pan. Bring to a simmer to dissolve the sugar.", "Preheat the oven to 140C/300F/Gas 2. ", "Place the pork into a small deep roasting tin. Pour over the hot liquid. Add the leek (or onion), garlic and ginger. Depending on the width of your tin, add 400-500ml/14-18fl oz of hot water – enough not to completely cover it as it will be turned every so often. ", "Lightly cover with a double layer of foil and leave a small gap for the steam to escape.", "Turn the pork occasionally and cook until the pork is tender – about 2-2½ hours.", "Once cooked, remove from the oven, leave to cool in the liquid and put into a sealed container with the juices. Leave to cool before putting in the fridge - it is easier to carve when it is fridge cold. If using straightaway leave to rest for 20 minutes."]}, {"isVegetarian": true, "title": "Charred corn with cayenne butter and herb salad", "url": "www_bbc_co_uk_food_recipes_charredcornwithcayen_87224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter", "1 corn on the cob, husk removed", "1 tbsp chopped chives ", "½ tsp cayenne pepper", "salt and freshly ground black pepper ", "small handful each flatleaf parsley, basil and dill", "squeeze lemon juice", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a small frying pan. Using a sharp knife, carefully cut the kernels off the corn cob, add to the pan and cook gently for 1-2 minutes.", "Add the chives and cayenne pepper, season well with salt and freshly ground black pepper and cook for a further minute.", "Place the herbs into a bowl, drizzle with the lemon juice and olive oil and stir well.", "To serve, pile the dressed herbs onto a serving plate and top with the corn."]}, {"isVegetarian": false, "title": "Chashu pork ramen", "url": "www_bbc_co_uk_food_recipes_chashu_pork_ramen_90056", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chashu_pork_ramen_90056_16x9.jpg", "ingredients": ["750g/1lb 10oz ramen noodles (alternatively use udon noodles) ", "drizzle sesame oil ", "2.5 litres/4½ pints toridashi stock", "30g/1oz fresh root ginger, cut into 4 thick slices ", "2 garlic cloves, cut into slithers ", "10 fresh shiitake mushrooms, cut into slithers", "1 carrot, cut into matchsticks", "100g/3½oz shimeji mushrooms", "200g/7oz soya beansprouts (or beansprouts)", "50g/1¾oz sliced bamboo shoots", "100g/3½oz enoki mushrooms", "200g/7oz choi sum, ends trimmed and cut in half", "500g/1lb 2oz chashu pork, about 16 slices ", "4 spring onion, cut on the diagonal ", "1 long red chilli, finely sliced on a diagonal", "4 whole tomago eggs, halved ", "Japanese shop-bought chilli oil ", "shichimi togarashi (Japanese seven-spice seasoning)", "dried tuna flakes "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles following the instructions on the packet. Once cooked, drain and drizzle with a little sesame oil to stop the noodles from sticking. ", "Heat the stock in a large pan with the ginger, garlic, shiitake mushrooms and carrots.", "Simmer for 5-8 minutes. Add the shimeji mushrooms.", "Carefully arrange the warm noodles, beansprouts, bamboo shoots, enoki mushrooms, choi sum and sliced pork in four large serving bowls.", "Carefully pour the stock over the pork and vegetables with a ladle. Top with the spring onions and sliced chilli.", "Carefully half the eggs and place on the top of each serving. ", "Serve at once with a drizzle of chilli oil, a sprinkling of shichimi togarashi (Japanese seven-spice seasoning) and a flourish of dried tuna flakes (if liked)."]}, {"isVegetarian": false, "title": "Chateaubriand with béarnaise sauce and fries", "url": "www_bbc_co_uk_food_recipes_chateaubriand_with_80496", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp tarragon vinegar", "50ml/2floz white wine", "1 tsp white peppercorns", "1 small banana shallot, finely diced", "4 eggs, yolks only", "¼ lemon, juice only", "200g/7oz butter, melted", "salt and freshly ground black pepper", "2-3 tbsp chopped tarragon leaves", "2 x 800g/1lb12oz chateaubriand, fully trimmed", "1 tbsp olive oil", "75g/3oz butter", "4 small stems cherry tomatoes on the vine", "4 large chipping potatoes, cut into 1x7.5cm/½x3in batons ", "1 large bunch watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the béarnaise sauce, place the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil.", "Simmer until the liquid has reduced by half.", "Remove the peppercorns then pour into a medium bowl.", "Add the egg yolks and whisk well, then add the lemon juice.", "Place over a pan of simmering water and whisk together until thickened and light in colour.", "Gradually add in the melted butter, whisking constantly.", "Season with salt and black pepper and add the chopped tarragon leaves.", "Turn off the heat and leave the bowl over the pan until ready to use", "For the steak, preheat the oven to 200C/400F/Gas 6.", "Season the chateaubriand with salt and freshly ground black pepper.", "Heat a large ovenproof frying pan until hot, add the oil and half the butter then add the beef and seal on each side until browned, adding the rest of the butter as you go, basting the beef with it.", "Transfer to the oven and roast for 15-20 minutes, (depending how you like your beef).", "Remove from the oven, turn over and allow to rest for at least 15 minutes.", "Meanwhile, place the cherry tomatoes onto a roasting tray and place in the oven for 8-10 minutes until just bursting.", "Heat a deep fat fryer to 160C/320F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Carefully place the potato batons into the fat fryer in batches and fry for 3-4 minutes, or until tender but not coloured.", "Remove the fries then increase the heat on the fat fryer to 190C/375F and return the fries to the fryer and cook for 2-3 minutes until golden-brown and crisp. ", "Remove with a slotted spoon and drain onto kitchen paper then season with salt and a little black pepper.", "To serve, carve the rested beef into thick slices and place onto the serving plate. Pile the fries and tomatoes alongside then finish with a dollop of béarnaise and handful of watercress."]}, {"isVegetarian": true, "title": "Cheat’s chocolate tart", "url": "www_bbc_co_uk_food_recipes_cheats_chocolate_tart_45173", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_chocolate_tart_45173_16x9.jpg", "ingredients": ["175g/6oz plain flour", "40g/1½oz cocoa powder", "80g/3oz icing sugar", "140g/5oz butter, diced", "2 medium free-range egg yolks", "750g/1lb 10oz milk chocolate", "260ml/9½fl oz double cream", "120ml/4fl oz amaretto", "200g/7oz blanched almonds", "250g/9oz caster sugar", "100g/3½oz dark chocolate, finely grated", "75g/2½oz coffee beans", "1 tbsp freeze-dried coffee granules, dissolved in 1 tbsp boiling water", "3 tbsp coffee liqueur", "200ml/7fl oz double cream", "50g/1¾oz caster sugar"], "serves": "Makes 1 large tart", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour, cocoa powder and icing sugar into a bowl. Add the butter and rub together using your fingers until the mixture resembles breadcrumbs. Add the egg yolks and mix together until it forms a dough. Add a little ice-cold water if the pastry feels dry. Wrap the dough in cling film and place in the fridge to rest for at least an hour. ", "Preheat the oven to 170C/340F/Gas 3½.", "When the pastry is rested, lightly flour a work surface and roll out the dough into a circle about the thickness of a £1 coin. Lay the pastry over the tart case and gently push down to line, taking care to get the pastry right into the edges. Line the pastry with baking parchment and fill with baking beans or uncooked rice. Place the tart on a baking tray and bake in the preheated oven for 25 minutes.", "Carefully remove the baking parchment and beans and place the tart back in the oven to cook for a further 10-20 minutes, or until the base looks dry. Remove the tart from the oven and allow to cool. Once cooled, trim the pastry to tidy up the edges.", "For the filling, break up the milk chocolate and place into a bowl over a pan of barely simmering water. Do not let the bowl touch the water. Once melted, remove the bowl from the heat. ", "In a pan over a medium heat, bring the double cream and amaretto to the boil. Pour the cream mixture over the melted chocolate, whisking everything together well. Pour this mixture into the cooked tart case and cool to room temperature before placing the tart in the fridge for 30 minutes, or until set.", "For the topping, preheat the oven to 190C/375F/Gas 5 and place the almonds on a baking tray. Place in the oven and cook for 8-10 minutes, or until they are toasted and lightly browned. Remove from the oven and leave to cool for a few minutes. Line a tray or plate with baking parchment.", "Put the caster sugar and 50ml/2fl oz water in a pan over a medium heat and cook until the sugar starts to colour. Stir in the almonds and mix until the sugar coats the almonds to give a frosted appearance. Transfer the almonds to the lined tray or plate and leave to cool. Once completely cooled, roughly chop the almonds into pieces. ", "For the coffee cream, mix the dissolved coffee granules and coffee liquor to a paste in a large bowl and add the sugar. Pour in the double cream and whisk to firm peaks, being careful not to over-whip it. Cover with cling film and place in the fridge until needed. ", "Check that the tart has set. If not, leave it in the fridge for a further 20 minutes. Once set, cover with grated chocolate and sprinkle with the coffee beans and frosted almonds. Serve with the whipped coffee cream."]}, {"isVegetarian": true, "title": "Cheat’s rough puff pastry", "url": "www_bbc_co_uk_food_recipes_cheats_rough_puff_pastry_91549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "pinch salt", "50g/1¾oz butter, chilled and cut into cubes", "120g/4½oz butter, frozen"], "serves": "Makes 600g/1lb 5oz pastry", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the flour and salt together in a bowl. Rub in the chilled butter using your fingertips until the mixture resembles breadcrumbs. Gradually add enough water to form a dough (about 4-6 tablespoons of water).", "Roll the dough out into a rectangle on a lightly floured work surface. ", "Grate half of the frozen butter over the bottom two thirds of the dough. Fold down the top third and fold up the bottom third as if folding a letter.", "Turn the folded dough through 90 degrees and roll it out into a rectangle again. Repeat the process of adding the remaining frozen butter and fold as before.", "Wrap the dough in cling film and leave to rest in the fridge for 30 minutes before using."]}, {"isVegetarian": false, "title": "Cheat’s salmon coulibiac", "url": "www_bbc_co_uk_food_recipes_cheats_salmon_coulibiac_71143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "500g/1lb 2oz mixed fresh exotic mushrooms, such as shiitake or enoki, cleaned and sliced", "250g/9oz baby spinach leaves", "2 x 375g packets all-butter puff pastry", "plain flour, for dusting", "1 whole salmon (approximately 3kg/6lb 12oz), skin scaled and removed, gutted, pin boned and filleted (alternatively use ready prepared sides of salmon)", "3 free-range egg yolks, beaten", "sea salt and freshly ground black pepper", "1kg/2lb 4oz cooked, buttered new potatoes", "dressed green salad"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8.", "Heat half of the butter in a large frying pan over a medium heat. When the butter is foaming, add the mushrooms and fry for 4-5 minutes, or until they have released most of their water and it has evaporated from the pan. Season, to taste, with salt and freshly ground black pepper, then transfer to a plate lined with kitchen paper.", "Return the frying pan to the heat, add the last of the butter and then wilt the spinach leaves and season, to taste, with salt and freshly ground black pepper. Add to the plate with the mushrooms, set aside until cool, then chill in the fridge.", "Roll out both pieces of pastry onto a lightly floured work surface to create two rectangles about 5cm/2in longer and wider than the salmon fillets. ", "Place one sheet of pastry onto a large flat baking tray and lay one salmon fillet on top, flesh side up. Season well with salt and freshly ground black pepper.", "Top the salmon fillet with the mushrooms and then the spinach, then lay the second salmon fillet on top of that, flesh side down, pressing down gently.", "Brush the edges of the pastry with some of the beaten egg yolk. Carefully roll the second sheet of pastry onto the coulibiac using a rolling pin to transfer it. Press the edges of each sheet of pastry together to seal and crimp at the edges.", "Brush the surface of the pastry parcel all over with the remaining beaten egg yolk. Using a sharp pair of scissors, snip the top of the pastry at intervals to make marks resembling fish scales.", "Bake the salmon coulibiac for 25 minutes, then reduce the oven temperature to 200C/180C Fan/Gas 6 and bake for another 12-15 minutes, or until the salmon fillets are just cooked through and the pastry is risen and golden-brown.", "Remove the salmon coulibiac from the oven and transfer it to a serving platter. Set aside to rest for 10 minutes, then carve into slices at the table and serve with buttered new potatoes and a dressed green salad."]}, {"isVegetarian": true, "title": "Cheat's salted caramel sauce", "url": "www_bbc_co_uk_food_recipes_cheats_salted_caramel_71714", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_salted_caramel_71714_16x9.jpg", "ingredients": ["400g tin readymade condensed milk caramel", "100g/3½oz unsalted butter", "½ tsp salt", "3 tbsp rum (optional)"], "serves": "Makes 2 jam jars of sauce", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["First sterilise the jam jars. Wash the jars in soapy water and rinse in clean warm water. Allow them to drip-dry, upside down, on a rack in the oven set to 140C/120C Fan/Gas 1. Leave them there for at least half an hour while you make the salted caramel.", "Heat the condensed milk caramel, butter and 8 tbsp of water in a pan and bring to a simmer. Stir until the caramel dissolves. Add the salt and the rum (if using), mix, then leave to cool slightly. ", "Pour into a sterilised jar. This will keep in the fridge for 1 week … if you can make it last that long."]}, {"isVegetarian": true, "title": "Cheat's strawberry gâteau", "url": "www_bbc_co_uk_food_recipes_cheats_strawberry_gteau_94997", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheats_strawberry_gteau_94997_16x9.jpg", "ingredients": ["1 large ready-made flan case", "3-4 tbsp whisky liqueur (such as Drambuie)", "800ml/1 pint 8fl oz double cream", "1 tbsp vanilla bean paste", "60g/2¼oz caster sugar", "400g/14oz large strawberries, trimmed and cut in half lengthways", "50g/1¾oz icing sugar, for dusting", "1 punnet small strawberries", "50g/1¾oz each of redcurrants, blueberries and blackberries", "3-4 sprigs mint", "65g/2¼oz caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a 20-25cm/8-10in stainless steel ring onto the flan case and use it to cut through, discarding the outer rim of sponge. Cut the flan in half horizontally so you end up with two thin layers.", "Place the steel ring onto a large, flat serving plate. Place one of the sponge layers inside and press down lightly. Sprinkle half the Drambuie over the sponge then set aside.", "Place the double cream in a bowl with the vanilla bean paste, the remaining Drambuie and the caster sugar. Whip until semi-firm peaks form when the whisk is removed.", "Line the ring with the large strawberry halves, placing the cut-side against the ring – reserve the rest of the strawberries.", "Carefully spoon the whipped cream into the centre of the flan and spread out gently to fill the whole mould – adding as much cream as necessary to cover to the top of the strawberries. Place the remaining flan case on top and press down lightly.", "Remove the ring by carefully warming the edges with a hot cloth and lifting it straight upwards.  ", "Dust the top of the gâteau with the icing sugar. Carefully heat a metal skewer over a direct flame until very hot (use oven gloves). Use the hot skewer to score the top of the cake with lines to create a diamond pattern.  ", "For the spun sugar, if using, place the remaining caster sugar into a very clean frying pan and place on the stove to caramelise. Once it is caramelised remove from the heat to cool slightly. Dip a small spoon into the caramelised sugar and twist around a steel to create curls which will decorate the top of the gâteau.", "Pile the remaining strawberries and berries on top of the cake. Garnish with sprigs of mint and the caramel curls. Serve cut into wedges with pouring cream if desired."]}, {"isVegetarian": false, "title": "Cheats' Goan mackerel curry", "url": "www_bbc_co_uk_food_recipes_cheatsgoanmackerelcu_72061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "2 tbsp Madras curry paste", "2 mackerel, cut across into 4-5 steaks", "small bunch coriander, stalks chopped, leaves to sprinkle", "1 medium red onion, chopped", "2 limes, zest and juice only", "½ can coconut milk", "rice, boiled, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook off the curry paste in a pan with the oil.  ", "Throw in the mackerel steaks and completely cover with paste. ", "Add the coriander stalks to the pan with the red onion and cook for a moment or two.  ", "Add the lime zest and juice and the coconut milk.  ", "On a medium heat, simmer for 15 minutes, turning the mackerel a few times.  ", "Serve with rice."]}, {"isVegetarian": false, "title": "Cheat's coq au vin", "url": "www_bbc_co_uk_food_recipes_cheatscoqauvin_68039", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 cooked joints of chicken, on the bone - a mixture of breasts and thighs or legs", "30g/1oz butter", "1 tbsp olive oil", "4 garlic cloves, chopped", "2 red onions, sliced", "140g/5oz pancetta in one piece, rind removed and chopped", "250g/9oz button mushrooms", "good pinch of dried thyme", "290ml/½ pint red wine", "500ml/17fl oz fresh chicken stock ", "150ml/¼ pint double cream", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Skin the cooked chicken pieces and set aside.", "Heat the butter with the oil in a large cast iron or flameproof casserole dish, add the garlic, onions and pancetta and sauté for about 5 minutes until softened. Add the mushrooms and thyme and sauté for 5 minutes.", "Pour in the wine, bring to the boil and continue boiling, uncovered, for about 5 minutes until the sauce is reduced by half. Pour in the stock and bring back to the boil.", "Season and add the chicken to the sauce. Reduce the heat and simmer for a good 5 minutes until the chicken is thoroughly heated through. Remove the chicken pieces to a warmed serving dish with a slotted spoon.", "Increase the heat and boil the sauce until reduced by about half. Reduce the heat, stir in the cream and gently heat through.", "Pour the sauce over the chicken pieces, sprinkle with parsley. Serve."]}, {"isVegetarian": true, "title": "Cheaty peach ice cream", "url": "www_bbc_co_uk_food_recipes_cheatypeachicecream_14298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large (800g/1¾lb) tin peaches in syrup ", "½ lemon, juice only", "500ml/16fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Empty the contents of the can and the lemon juice into a liquidiser and blend until smooth.", "Stir in the cream. Pour into an ice cream machine, churn and freeze."]}]