[{"ingredients": ["550 g / 1 libra de manteca de 4 oz, más extra para engrasar", "1.15kg / 3lb 5 oz harina natural, más extra para quitar el polvo", "1½ cucharadita de sal", "300ml / ½ pinta de agua", "300ml / ½ pinta de aceite de girasol", "Muslos de pollo de 4 kg / 9 lb, deshuesados ​​y sin piel, carne cortada en pedazos", "100g / 3½oz de tomillo fresco picado", "1kg / 2lb 4oz de champiñones, aproximadamente picados", "100g / 3½oz de estragón fresco picado", "Crema agria de 500ml / 18fl oz", "leche, glasear", "sal y pimienta negra recién molida"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Engrasa cinco platos grandes para pastel con manteca. Agregue una pequeña cantidad de harina, luego gire la lata para cubrir la base y los lados, sacudiendo cualquier exceso.", "Para la masa, pulse la harina, la sal y la manteca de cerdo en un procesador de alimentos grande hasta que la mezcla se asemeje a pan rallado. Agregue el agua, mezcle hasta que se combine, luego incline sobre una superficie de trabajo y amasar hasta que quede suave. Coloque los pasteles en la nevera durante 30 minutos. (Esto produce muchos pasteles, por lo que es posible que deba hacerlo en lotes).", "Mientras tanto, para el relleno, caliente la mitad del aceite en una cacerola grande a fuego medio, agregue las piezas de pollo y cocínelas durante 4-5 minutos, o hasta que se doren (puede que tenga que hacerlo por lotes). Agregue 1,5 litros / 2¾ pintas de agua y el tomillo, y sazone, al gusto, con sal y pimienta negra recién molida. Ponga la mezcla a ebullición, reduzca el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el volumen del líquido se haya reducido en un tercio y el pollo esté bien cocido.", "Caliente el aceite restante en una sartén separada a fuego medio, agregue los champiñones y cocínelos durante 4-5 minutos o hasta que estén dorados, luego sazone al gusto con sal y pimienta negra recién molida. (Lo mejor es no saturar la bandeja, por lo que es posible que deba hacerlo en lotes).", "Agregue los champiñones a la mezcla de pollo junto con el estragón, luego agregue la crema agria hasta que estén bien combinados. Si la mezcla se ve seca, agregue un poco de agua caliente o caldo. Divida la mezcla entre los platos de tarta y reserve.", "Divida la masa en cinco pedazos y enrolle cada pedazo de pastel sobre una superficie de trabajo limpia y enharinada hasta que sea un poco más grande que el diámetro del plato para pastel.", "Coloque la tapa de la repostería en la parte superior del pastel y recorte el exceso de masa. Con un cuchillo, haga dos pequeños orificios en el centro de la tapa de la pastelería para permitir que salga el vapor. Cepille la masa con un poco de leche.", "Repita con los pasteles restantes.", "Hornee los pasteles en el horno durante 30-35 minutos o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_chicken_and_mushroom_pie_48270", "title": "Pastel de pollo y champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 pechugas de pollo alimentadas con maíz, sin piel", "Hígados de pollo de 100g / 3½oz", "Vientre de cerdo 180 g / 6 oz, picado", "1 cucharadita de sal", "2 cucharaditas de pimienta negra recién molida", "1 limón sin cebar, solo cáscara", "2 chalotes, en rodajas finas", "2 ramitas de tomillo de limón, hojas recogidas", "50 g / 1¾oz de pistachos, blanqueados", "20 rebanadas finas de tocino rayado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corte cada pechuga de pollo en tres rebanadas grandes y déjelas a un lado.", "Mezcle los hígados de pollo en el cerdo picado y sazone con sal y pimienta. Agregue la ralladura de limón, chalotes, hojas de tomillo y pistachos.", "Cubra un molde de terrina o una lata de pan con el tocino, dejando suficiente saliente para cubrir la parte superior cuando se llena. Presione los trozos de carne y pollo y cubra completamente con el tocino.", "Coloque el molde en una lata de asar llena con suficiente agua para llegar a la mitad del costado del molde.", "Hornee en el horno precalentado durante 1 hora y 15 minutos.", "Dejar enfriar durante 24 horas en el refrigerador y luego cortar. Sirva con cebollas en vinagre o pepinillos, tostadas y hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_and_pork_pt_with_77226", "title": "Paté de Navidad con pistachos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz de carne picada de pollo", "300g / 10½oz de gambas crudas, desveladas y finamente picadas", "2 dientes de ajo rallados", "Jengibre de raíz fresco de 2cm / 1en pieza, rallado", "1 chile rojo, más o menos picado", "1 varilla de limoncillo, hojas externas eliminadas, más o menos cortadas", "2 hojas de lima", "1 cucharadita de aceite de sésamo", "1 cucharadita de salsa de soja", "aceite vegetal, para freír", "puñado de mangetout", "2 lechugas Little Gem, hojas separadas", "1 manojo de cilantro fresco, hojas recogidas", "1 manojo de menta fresca, hojas recogidas", "1 manojo de eneldo fresco, aproximadamente picado", "1 cebolla roja, finamente cortada en medias lunas", "1 pepino, finamente picado", "¼ de piña, finamente picada", "1 chile verde, finamente picado", "Anacardos de 150 g / 5½ oz, tostados y picados", "2 limas, solo jugo", "2 cucharadas de salsa de pescado", "2 cucharaditas de azúcar en polvo"], "method": ["Para hacer las croquetas, coloque los ingredientes separados del aceite en un procesador de alimentos y mezcle hasta que quede suave. Forme croquetas y colóquelas en la nevera durante 1 hora para prepararlas.", "Para hacer la ensalada, pula el mangetout en agua hirviendo durante 1 minuto. Refrescar en agua fría y rebanar finamente. Mezcle el mangetout con la lechuga, las hierbas y la cebolla en un recipiente y reserve.", "Para hacer que el anacardo disfrute, mezcle los ingredientes en un bol y déjelos a un lado.", "Calentar un poco de aceite vegetal en una sartén a fuego medio y freír las croquetas en lotes durante 8-10 minutos, hasta que estén doradas y cocidas.", "Sirva las croquetas con la ensalada y condimente a un lado."], "url": "www_bbc_co_uk_food_recipes_chicken_and_prawn_99165", "title": "Croquetas de pollo y gambas con salsa de anacardo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de hojas de albahaca", "50g / 1¾oz de piñones tostados", "50 g / 1¾oz de queso parmesano, rallado", "2 dientes de ajo", "75ml-125ml / 2½-4fl oz de aceite de oliva virgen extra", "2 pimientos rojos", "2 pimientos amarillos", "2 pechugas de pollo, cortadas en tiras", "2 cucharadas de aceite de oliva", "1 cebolla roja grande, pelada y cortada en cuñas", "2 calabacines, rebanados longitudinalmente", "1 pan redondo grande de 23cm / 9 pulgadas de ancho", "2 bolas de mozzarella de búfala, desgarrada", "1 tomate de vaca, en rodajas finas", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon", "50g / 1¾oz de hojas de cohete", "2 cabezas de lechuga Little Gem"], "method": ["Para el pesto, coloque todos los ingredientes excepto el aceite en un procesador de alimentos y mezcle. Poco a poco agregue el aceite hasta que tenga una pasta espesa, y deje de lado.", "Para el pan en capas de pollo y vegetales asados, coloque los pimientos rojos y amarillos directamente sobre la llama de un gas y siga girando hasta que todo se vuelva negro. Retire de la placa y coloque en un recipiente de vidrio con la película adhesiva y déjela a un lado. Una vez que se enfríe lo suficiente como para manejarlo, quítele la piel negra y corte la carne en cuartos, quitando las semillas.", "Caliente una sartén grande y coloque las tiras de pollo en un tazón. Agregue el aceite y sazone con sal y pimienta, luego revuelva para cubrir.", "Coloque el pollo en la plancha caliente junto con la cebolla roja y los calabacines y cocine por 2-3 minutos.", "Rebana la parte superior de la barra de pan. Ahueca el pan sacando el pan suave, dejando 3 cm / 1 ¼ de pan alrededor del borde.", "Llene el pan hueco con capas de pimientos, pollo, cebolla roja, calabacines, mozzarella, tomates y pesto, sazonándolo entre cada capa.", "Vuelva a colocar la tapa del pan y empuje hacia abajo, puede envolverlo en una película adhesiva y dejarlo toda la noche o cortar de inmediato.", "Para la ensalada de temporada, mezcle el aceite, el vinagre y la mostaza en un tazón pequeño. Coloque las hojas de ensalada en un tazón grande, vierta sobre el aderezo y mezcle.", "Para servir, cortar el pan y colocar en platos con la ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_and_roasted_70570", "title": "Pan de pollo y vegetales asados ​​en capas con pesto y ensalada de temporada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de yogur natural", "6 dientes de ajo, finamente triturados", "6 cm / 2½ in (30 g / 1 oz) pieza de jengibre, finamente rallado", "3 chiles verdes, finamente picados, con semillas", "1 cucharadita de ají de Kashmiri en polvo", "1 cucharadita de cilantro molido", "½ cucharadita de cúrcuma molida", "500g / 1lb 2oz de muslos de pollo deshuesados ​​y sin piel, cortados por la mitad", "300ml / 10fl oz de aceite vegetal", "3 cebollas medianas, en rodajas finas", "10 dientes enteros", "6cm / 2½in pieza de canela en rama", "5 vainas de cardamomo verde, magulladas con un rodillo", "2 hojas de laurel indias", "1 cucharadita de semillas de comino", "2 tomates medianos, picados", "1 cucharadita de sal", "600 g / 1 lb 5 oz de arroz basmati, empapado en agua fría durante una hora", "1 cucharadita de sal por 1 litro / 1¾ pinta de agua de cocción", "100g / 3½fl oz ghee", "pellizque el azafrán empapado en 4 cucharadas de leche tibia durante 15 minutos", "2 cucharaditas de agua de rosas", "20 g / ½ oz de anacardos y 20 g / ½ oz de pistachos sin cáscara, tostados en seco en una sartén caliente hasta que estén dorados", "raita, para servir"], "method": ["En un tazón poco profundo lo suficientemente grande como para contener todas las piezas de pollo, combine todos los ingredientes de adobo. Revuelva para cubrir bien y luego reservar para macerar durante una hora.", "Para las cebollas crujientes fritas, caliente el aceite vegetal en una sartén resistente o karahi a fuego medio hasta que esté caliente pero no humeante (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Agregue las cebollas y fría por 10-15 minutos. , o hasta un profundo color dorado. Retirar con una espumadera y escurrir sobre un plato forrado con papel de cocina. Dejar de lado. Vierta todas las cucharadas menos del aceite de la sartén, excepto unas tres cucharadas. (Puede verter el aceite en una jarra y reservar para otro uso).", "Agregue las especias enteras a la sartén y fría por un minuto. Agregue el pollo y su adobo, cocine a fuego lento, luego agregue los tomates y la sal. Cocine a fuego medio durante 20 minutos, o hasta que el pollo esté cocido y la salsa se adhiera al pollo (agregue un chorrito de agua a la sartén si se engancha en el fondo). Es importante que la salsa esté casi seca en esta etapa y solo cubra el pollo. Mantenga caliente a fuego lento mientras cocina el arroz.", "Para el arroz, escurra el arroz remojado y la punta en una cacerola grande con agua hirviendo y salada (a una tasa de una cucharadita por litro de agua) durante 5-7 minutos, o hasta que el arroz esté tierno pero firme. Escurrir bien. Pruebe que el arroz esté cocido apretando un grano entre sus dedos; debe ser suave y romperse en los bordes, pero manténgase firme en el medio.", "Reúna el biryani directamente mientras el arroz aún está caliente; apunta a cinco capas: arroz, pollo, arroz, pollo, arroz. Primero vierta aproximadamente tres cucharadas de agua y la mitad del ghee en una olla o cacerola profunda, de base pesada, y luego espolvoree un tercio del arroz. Espolvorea más de un tercio de la leche de azafrán y agua de rosas, luego se extiende con la mitad de la mezcla de pollo y un tercio de las cebollas fritas.", "Agregue otro tercio del arroz y repita como se indicó anteriormente, usando el resto del pollo. Cubra con el arroz restante y salpique con la leche de azafrán restante y agua de rosas. Deja las cebollas fritas restantes a un lado por ahora. Rocíe el ghee restante alrededor de los bordes del arroz para que gotee por el interior de la sartén.", "Cubra con una tapa bien ajustada. Ponga a fuego alto para obtener el ghee caliente y un poco de vapor - levante la tapa para comprobar. Tan pronto como vea subir el vapor, baje a fuego muy bajo y cocine por 30 minutos.", "Coloque la cuchara en un plato grande para servir y esparza con el resto de las cebollas crujientes y los anacardos tostados y los pistachos. Sirve con raita."], "url": "www_bbc_co_uk_food_recipes_chicken_and_rosewater_70042", "title": "Biryani de pollo y agua de rosas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_rosewater_70042_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla", "Harina normal 150g / 5½ oz", "450ml / 16fl de leche en oz", "75g / 2¾oz de jamón serrano, más o menos picados", "75g / 2¾oz de pollo cocido, picado", "1 manojo pequeño de perejil fresco, hojas ásperas picadas", "25g / 1oz de almendras tostadas en copos", "2 huevos de gallinas camperas", "75g / 2¾oz de pan de migas frescas", "aceite vegetal, para freír", "4 cucharadas de aceite de oliva", "Pimientos de padrón de 200g / 7oz (disponibles en tiendas de delicatessen españolas)", "½ cucharadita de copos de sal marina", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola grande a fuego medio. Batir en la mitad de la harina para formar una pasta suave, luego cocinar la mezcla durante 30 segundos.", "Bata lentamente la leche, permitiendo que cada adición de leche se absorba en la mezcla y que la salsa se espese, hasta que tengas una salsa muy espesa, casi con la consistencia del puré de papa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Raspe la mezcla en un tazón grande, luego agregue el jamón serrano, el pollo cocido y el perejil. Sazonar de nuevo con sal y pimienta negra recién molida, luego agregar las almendras en copos. Deja la mezcla a un lado para que se enfríe por completo. Enfriar en el refrigerador, tapado, durante al menos 10 minutos, o durante la noche, hasta que se haya endurecido.", "Tome cucharadas de la mezcla fría y, con las manos mojadas, dóblelas en forma de bolas o cilindros.", "Espolvoree la harina restante en un plato y sazone con sal y pimienta negra recién molida. Batir los huevos en un tazón. Agregue las migas de pan a otro recipiente.", "Espolvoree cada croqueta primero en la harina, luego sumérjalo en el huevo batido, luego enrolle las migas de pan para cubrir.", "Mientras tanto, caliente el aceite vegetal en una freidora a 170 ° C, o caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Baje las croquetas en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas y calientes hasta el final. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repita el proceso con las croquetas restantes.", "Mientras las croquetas se fríen, caliente el aceite de oliva en una sartén separada a fuego alto. Agregue los pimientos del padrón y espolvoree con la mitad de la sal. Freír durante 2-3 minutos, o hasta que estén dorados por ambos lados y suavizados. Transfiera a un tazón para servir y espolvoree con la sal restante.", "Sirva las croquetas con los pimientos del padrón."], "url": "www_bbc_co_uk_food_recipes_chicken_and_serrano_ham_49020", "title": "Croquetas de pollo y jamón serrano con pimientos de padrón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de harina común", "125g / 4oz de mantequilla sin sal", "125g / 4oz de manteca de cerdo", "pizca de sal", "1 cucharadita de vinagre de vino blanco", "1 huevo, golpeado", "75g / 3oz de mantequilla sin sal", "Harina normal de 50g / 2oz", "350ml / 12fl oz de leche entera, calentada", "sal y pimienta negra recién molida", "2 pechugas de pollo de 150 g / 5oz cortadas en trozos", "125g / 4oz de jamón de buena calidad, cortado en tiras", "2 puerros grandes", "5 cucharadas de estragón fresco picado"], "method": ["Tamiza la harina y la sal en un tazón grande y frota la mantequilla y la manteca en la harina hasta que se asemeje a pan rallado.", "Agregue el vinagre y suficiente agua fría para unir la mezcla en una masa suave.", "Divida la masa en dos pedazos, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Mientras tanto, para calentar 25g / 1oz de mantequilla en una sartén y cocine el pollo durante 5-6 minutos, agregue los puerros y continúe cocinando durante 3-4 minutos o hasta que estén blandos. Transfiera la mezcla a un tazón grande, luego sazone y reserve.", "Derrita la mantequilla restante en una cacerola, luego agregue la harina y bata hasta obtener una pasta suave. Cocine por un minuto o dos, luego retírelo del fuego y bata lentamente la leche. Regrese la salsa al fuego y cocine a fuego lento hasta que quede suave y espesa (no hierva).", "Agregue la mezcla de pollo, el jamón y el estragón.", "Precalentar el horno a 180C / 350F / gas 4.", "Enrolle una de las piezas de masa finamente y úsela para revestir una placa para pastel de 25 cm / 10 pulgadas. Recorta los bordes. Vierta la cuchara en la mezcla de pollo y cepille los bordes de la masa con el huevo batido.", "Ruede la segunda pieza de pastel finamente y cubra el pastel. Selle y engarce los bordes. Haga un agujero en la parte superior del pastel y cepille la parte superior con el huevo batido.", "Hornee en el horno durante 35-40 minutos."], "url": "www_bbc_co_uk_food_recipes_chicken_and_tarragon_pie_93074", "title": "Pastel de pollo y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 tomates cherry, picados", "50g / 2oz de pollo sobrante cocinado, desgarrado en trozos pequeños", "2 pizcas de pimentón dulce", "250g / 9oz de pasta de copos salados listos para usar", "harina común, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, mezcle los tomates, el pollo y el pimentón.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada a un espesor de aproximadamente 0.5 cm / ¼ in. Corta cuatro círculos de la masa con un cortador de galletas.", "Usando un pincel de pastelería, aplique un poco de agua alrededor de los bordes de cada círculo de repostería.", "Divida la mezcla de llenado por igual entre los cuatro círculos de repostería.", "Doble cada círculo de masa sobre sí mismo para crear cuatro paquetes, pellizcando los bordes para sellar. Coloque cada paquete en una bandeja para hornear y aplique un poco más de agua. Pincha cada paquete con un tenedor.", "Hornee las sonrisas de pollo y tomate en el horno durante 12-15 minutos, o hasta que la masa esté dorada y el relleno esté bien caliente. Dejar enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_chicken_and_tomato_06581", "title": "Sonrisas de pollo y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 puerro, en rodajas finas", "2 cucharadas de caldo de verduras o pollo", "4 cucharadas de quark sin grasa o requesón natural sin grasa", "1 cucharada de estragón fresco picado", "1 pechuga de pollo cocida, sin piel, cortada en dados pequeños", "aceite en aerosol bajo en calorías", "4 huevos grandes de gallinas camperas, golpeados", "sal y pimienta negra recién molida", "4 tomates de ciruela, cortados por la mitad", "½ pepino, finamente picado"], "method": ["Precalentar el horno a 120C / 100C Fan / Gas ¼.", "Coloque los puerros y el caldo en una olla pequeña y cubra. Cocine por 5-6 minutos, o hasta que estén tiernos y todos los líquidos hayan sido absorbidos. Sazonar e incorporar el quark, el estragón y el pollo.", "Rocíe una sartén de 20cm / 8in con aceite en aerosol bajo en calorías y colóquelo a fuego alto.", "Sazonar los huevos, luego agregar la mitad a la sartén y cocinar, empujando el huevo cocido en el centro de la sartén y permitiendo que el huevo líquido fluya en su lugar hasta que no quede nada de huevo.", "Vierta la mitad de la mezcla de pollo en el centro de la tortilla. Voltee un lado sobre el pollo, luego el otro lado para cubrir el relleno. Coloque la tortilla en un plato y manténgala caliente mientras cocina la segunda.", "Mientras tanto, mezcle los tomates y el pepino. Sirve las tortillas con la ensalada de pepino."], "url": "www_bbc_co_uk_food_recipes_chicken_and_tarragon_88286", "title": "Tortilla de pollo y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_tarragon_88286_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aerosol de aceite de cocina controlado en calorías", "1 cebolla mediana, finamente cortada", "4 muslos de pollo deshuesados ​​y despellejados", "1 pimiento rojo, sin semillas y cortado en trozos de 3cm / 1in", "1 pimiento amarillo, sin semillas y cortado en trozos de 3cm / 1in", "1 cucharada de harina de maíz", "150g / 5½oz de yogur natural sin grasa", "1 cucharada de polvo de curry medio o suave", "2 dientes de ajo, en rodajas finas", "227g / 8oz de tomates picados en lata", "3 cucharadas colmadas de cilantro fresco finamente picado, más extra para decorar", "pimienta negra recién molida"], "method": ["Rocíe una sartén antiadherente grande o profunda o wok con aceite y coloque a fuego medio. Agregue la cebolla y cocine durante cinco minutos, revolviendo regularmente hasta que esté bien ablandada y ligeramente dorada.", "Mientras tanto, corte toda la grasa visible de los muslos de pollo, corte cada uno en cuatro pedazos y sazone con pimienta negra.", "Agregue el pollo y los pimientos en la sartén con la cebolla y cocínelos durante tres minutos, volteándolos de vez en cuando.", "Mientras tanto, en un tazón pequeño, mezcle la harina de maíz con 2 cucharadas de agua fría y mezcle el yogur hasta que esté bien mezclado.", "Espolvoree el polvo de curry sobre el pollo y las verduras, agregue el ajo y cocine durante 30 segundos.", "Incline los tomates en la sartén, agregue la mezcla de yogur, 150 ml / 3½ fl oz de agua y cilantro.", "Llevar a fuego lento y cocinar de 20 a 25 minutos, revolviendo ocasionalmente hasta que el pollo esté tierno y la salsa espesa. Sazonar con pimienta negra recién molida al gusto y decorar con cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_and_vegetable_65850", "title": "Balti de pollo y vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_vegetable_65850_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "½ cucharadita de sal", "45 g / 1½ oz de mantequilla, cortada en cubitos", "50 g / 1¾oz de manteca de cerdo, cortada en cubitos", "1,5 kg / 3 lb 5 oz de pollo entero", "2 cebollas, finamente picadas", "1 hoja de laurel", "sal y pimienta negra", "1 cucharada de aceite de oliva", "75g / 2½oz de mantequilla sin sal", "2 cucharadas de harina normal", "350g / 12oz de setas como chanterelle, ceps, tompette, girolles", "150ml / 5fl oz de vino blanco", "150ml / 5fl oz de crema doble", "4 ramitas de estragón fresco, solo hojas", "1 huevo de gallinas camperas, ligeramente golpeado", "75 g / 2½ oz de mantequilla", "1 cucharadita de azúcar en polvo", "1 manojo de zanahorias baby, lavadas y recortadas", "200g / 7oz de guisantes congelados"], "method": ["Para la masa de pasta brisa, ponga la harina y la sal en un tazón grande y agregue los cubos de mantequilla y manteca.", "Use las puntas de los dedos para frotar la mantequilla en la harina hasta que tenga una mezcla que se asemeje a pan rallado grueso sin grandes trozos de mantequilla restante. Intente trabajar rápidamente para que no se vuelva grasoso.", "Mida cuatro cucharadas de agua fría. Con un cuchillo, agregue la cantidad suficiente de agua fría para unir la masa.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera de 10 a 15 minutos antes de usarla.", "Alternativamente, utilizando un procesador de alimentos, ponga la harina, la mantequilla y la sal en el procesador de alimentos y pulse hasta que la grasa se frote en la harina. Con el motor en funcionamiento, agregue gradualmente el agua a través del embudo hasta que la masa se una. Solo agregue suficiente agua para unirlo y luego deténgase. Envuelva la masa en una película adhesiva como antes y enfríe durante 10-15 minutos antes de usarla.", "Para el pastel, precaliente el horno a 220C / 425F / Gas 7.", "Coloque el pollo en una sartén grande y profunda con la mitad de las cebollas y la hoja de laurel. Sazonar con un poco de sal y pimienta y cubrir con agua. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 45 minutos, o hasta que el pollo esté bien cocido.", "Retire el pollo de la sartén y déjelo enfriar. Regrese la sartén a la placa y cocine el líquido a ebullición rápida durante otros 30 minutos, o hasta que reduzca el volumen a la mitad. Mientras tanto, quite la carne de las patas de pollo, los muslos y la carcasa, luego colóquela en un molde para pastel de 20x30 cm / 8x12 in.", "Caliente el aceite de oliva y la mantequilla en una sartén grande. Agregue las cebollas restantes y cocine a fuego medio-bajo, sin dorar, durante unos cinco minutos, o hasta que se ablanden, luego agregue la harina. Suba el fuego y luego agregue los champiñones y cocine por 3-4 minutos más.", "Colar el caldo reducido, luego agregarlo a las setas y cocinar por un minuto. Vierta el vino y la nata, luego hierva, reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que espese bien. Sazonar, luego verter sobre el pollo y espolvorear hojas de estragón en la parte superior.", "Estire un rectángulo de masa 2cm / ¾in más ancho que el plato para pastel. Cepille los bordes del plato con huevo batido y coloque la masa en la parte superior, prensando los bordes con un tenedor o las yemas de los dedos. Corte cualquier exceso de hojaldre y cepille la parte superior del pastel con el huevo restante. Coloque en una bandeja para hornear y hornee durante 30-35 minutos, o hasta que la masa esté crujiente y dorada.", "Para las zanahorias y los guisantes, caliente una sartén hasta que esté caliente. Agregue la mantequilla, el azúcar y cinco cucharadas de agua y cocine hasta que el volumen del líquido se haya reducido ligeramente. Agregue las zanahorias y cocine por un par de minutos, luego agregue los guisantes y continúe cocinando hasta que estén tiernos y el líquido se haya reducido a un glaseado.", "Para servir, retire el pastel del horno y deje que se enfríe un poco antes de servirlo con las zanahorias y los guisantes."], "url": "www_bbc_co_uk_food_recipes_chicken_and_wild_04700", "title": "Pastel de pollo y setas silvestres con zanahorias y guisantes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 200 g / 7oz 00, más extra para quitar el polvo", "3 huevos de gallinas camperas", "½ pechuga de pollo, picada", "100-200 ml / 3½-7 fl oz crema doble", "trufa fresca, al gusto", "sal y pimienta recién molida", "2 cucharadas de mantequilla sin sal, más extra para terminar", "1 chalote, finamente picado", "1 diente de ajo, picado", "150ml / 5fl oz de vino blanco", "150ml / 5fl oz de caldo de pollo", "2 cucharadas de mantequilla sin sal", "2 cucharadas de cebollín fresco, picado", "virutas de trufa fresca, al gusto", "1 cabeza de col rizada, hojas trituradas", "2 cucharadas de mantequilla sin sal"], "method": ["Para hacer la pasta, ponga la harina y 2 de los huevos en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Coloque la mezcla en una superficie de trabajo enharinada y mezcle la mezcla suavemente para formar una masa.", "Amase ligeramente la masa durante 2-3 minutos, o hasta que esté suave y elástica. Ruede en una bola, cubra con una película adhesiva y déjela enfriar en la nevera durante al menos 20 minutos.", "Retire la masa del refrigerador y deseche la película adhesiva. Ligeramente la harina de su máquina de pasta para evitar que la masa se pegue. Aplane la bola de masa ligeramente con un rodillo, luego comience con la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes. Repita este proceso, enharinando la máquina y cambiando la configuración cada vez, hasta llegar a la configuración más delgada. Puede cortar la pasta en láminas individuales más pequeñas y trabajarlas individualmente, manteniendo la masa restante sin usar cubierta debajo de una película adhesiva para evitar que se sequen.", "Coloque el pollo, la mitad de la crema, virutas de trufa y sal y pimienta en un procesador de alimentos y mezcle hasta que quede suave. Agregue más crema hasta que tenga una textura con cuchara.", "Batir el huevo restante en un recipiente. Recorta los círculos de las hojas de pasta con un cortador de pasteles de 4-5 cm / 1,5-2 pulgadas, luego cepilla cada círculo con el huevo batido. Coloque una cucharada colmada del relleno de pollo y trufa en la mitad de cada círculo, luego doble la otra mitad de la pasta, de modo que forme una forma de media luna. Presione juntos para sellar. Traiga las dos esquinas inferiores de la media luna juntas para crear un círculo y pellizque para sellar. Repita con la pasta restante, colocando cada tortellini terminado en una bandeja forrada con papel resistente a la grasa. Dejar de lado.", "Para la salsa de crema y cebollín, caliente la mantequilla en una cacerola hasta que se derrita. Agregue la chalota y cocine durante 2 minutos, luego agregue el ajo y cocine por un minuto más. Vierta el vino blanco y cocine hasta que el volumen de líquido se reduzca a la mitad. Vierta el caldo y reduzca a la mitad nuevamente. Pase a través de un colador fino y viértalo en una sartén limpia, caliente y agregue un poco de mantequilla.", "Para finalizar, ponga un recipiente con agua salada hirviendo sobre la placa y blanquee la col rizada durante un minuto. Escurrir bien. Derrita la mantequilla en una sartén grande y agregue la col rizada. Freír suavemente hasta que estén tiernos.", "Cocine los tortellini en una olla grande de agua hirviendo con sal durante 2-3 minutos. Escurra bien, luego agregue los tortellini y las cebolletas a la salsa y mezcle. Corte uno de los tortellini para verificar que el pollo esté bien cocido, de lo contrario, continúe calentándolo en la sartén.", "Coloque la col rizada marchita en el centro de los tazones para servir, cubra con los tortellini y la trufa recién rallada."], "url": "www_bbc_co_uk_food_recipes_chicken_and_truffle_55068", "title": "Tortellini de pollo y trufa con salsa de crema y cebolleta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "25g / 1oz de mantequilla", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente cortado", "2 pechugas de pollo grandes sin hueso y sin piel, cortadas en rodajas gruesas de 1cm / ½ in", "150 g / 5½ oz de champiñones mixtos, como chanterelle, girolles y champiñones castaños, castañas cortadas en cuartos, el resto se deja entera", "50 ml / 2 fl oz en Madeira", "150ml / 5fl oz de caldo de pollo", "2 cucharadas de hojas de estragón picadas", "Crema doble de 200 ml / 7 fl oz", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "sal marina y pimienta negra recién molida"], "method": ["Para la pasta de hojaldre basta, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro. Coloque la mantequilla y la sal en el pocillo y trabaje con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano.", "Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, agregue gradualmente el agua helada y mezcle hasta que esté todo incorporado, pero no trabaje demasiado la masa; debe tener un efecto marmoleado con la mantequilla sin mezclarla por completo. .", "Enrolle la mezcla en un rectángulo de 2,5 cm / 1 pulgada de espesor, envuelva en una película adhesiva y refrigere durante 20 minutos.", "Cuando la pastelería esté fría, enharine la superficie de trabajo y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas.", "Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba y sobre eso. Dale un cuarto de vuelta.", "Enrolle el bloque de masa en un rectángulo de 40x20 cm / 16x8 pulgadas como antes y vuelva a doblarlo en tres. Estos son los primeros dos turnos. Descanse la masa en la nevera durante al menos 20 minutos entre turnos. Repite dos veces más para hacer cuatro giros.", "Envuelva la masa en una película adhesiva y refrigere durante al menos 30 minutos antes de usarla.", "Para el pastel, precaliente el horno a 200C / 180C Fan / Gas 6.", "Caliente una sartén grande a prueba de horno hasta que esté caliente, agregue la mantequilla y cuando la mantequilla esté en forma de espuma, agregue la chalota y el ajo y fría por un minuto. Agregue el pollo y freír hasta que esté coloreado.", "Agregue los champiñones y fríalos a fuego alto durante 2-3 minutos, o hasta que se ablanden. Agregue el Madeira y el flameado inclinando la sartén hacia la llama o alumbrándola con cuidado usando fósforos de cocina. (PRECAUCIÓN: asegúrese de que no haya materiales inflamables por encima de la sartén cuando llamea).", "Agregue el caldo de pollo y cocine a fuego lento, luego agregue el estragón y la crema y cocine a fuego lento durante cinco minutos. Agregue sal y pimienta al gusto y luego póngalo a un lado para que se enfríe.", "Estirar los pasteles hasta que estén a 5 cm / 2 pulgadas más anchos que la sartén a prueba de horno y con un grosor aproximado de 4-5 mm. Cepille los bordes de la sartén con huevo batido y luego coloque la masa sobre la parte superior del relleno de pastel y engarce en los bordes. Corte cualquier exceso de hojaldre y cepille la parte superior del pastel con el huevo restante. Use cualquier guarnición de pastelería para hacer hojas para decorar la parte superior del pastel.", "Hornee durante 25 minutos, o hasta que la masa esté crujiente y dorada y el relleno burbujeante."], "url": "www_bbc_co_uk_food_recipes_chicken_and_wild_04860", "title": "Pastel de pollo y setas silvestres", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_wild_04860_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2 kg / 4 lb 8 oz de pollo", "caldo de pollo, suficiente para cubrir el pollo", "1 hoja de azúcar de palma", "80ml / 3fl oz de salsa de soja ligera", "460g / 1lb 1oz de tamarindo", "25 g / 1 oz de semillas de cilantro, lavadas y envueltas en muselina", "Chalotes de 240g / 8½oz, cortados en cubitos y machacados con una mano de mortero", "135ml / 4½fl oz de vinagre de arroz", "Berberechos de 1 kg / 2 lb y 4 onzas, limpios y drenados (deseche los berberechos que permanecen abiertos después de la limpieza)", "1.5kg / 3lb de nabo de 5 oz, descarte las hojas exteriores grandes, manteniendo solo los corazones", "100 g / 3½ oz de mantequilla", "200ml / 7fl oz de caldo de pollo", "4 chalotes de plátano grandes, cortados a la mitad", "100 g / 3½ oz de mantequilla", "25 g / 1 oz de azúcar", "2 ramitas de tomillo", "200ml / 7fl oz de caldo de pollo", "Alas de pollo de 2 kg / 4 libras y 8 onzas, cada ala picada en 3 piezas", "4 cucharadas de aceite de oliva", "carne de berberecho reservada (de arriba)", "2 chalotes, en rodajas", "1 ramita de tomillo", "1 cucharadita de pimienta negra", "50g / 1¾oz de mantequilla", "Licor de cocción de berberecho reservado de 500ml / 18fl oz (de arriba)", "200ml / 7fl oz de caldo de pollo marrón", "hoja de ostra (disponible en línea)", "aceite infundido con cilantro"], "method": ["Para el pollo, ponga el caldo a hervir en una sartén grande. Agregue el pollo y asegúrese de que esté bien cubierto con el caldo. Cocine a fuego lento hasta que esté cocido, esto tomará entre 50 minutos y 1 hora.", "Para la pasta de tamarindo, derrita el azúcar de palma con la salsa de soja en una sartén. Agregue tamarindo, semillas de cilantro y chalotes a diferentes sartenes. Una vez que el azúcar de palma se haya derretido agréguela a la charola. Cocine a fuego lento durante alrededor de 6 horas hasta que espese y reduzca su volumen. Agregue el vinagre de arroz. Cocine por otros 20 minutos y luego déjelo enfriar.", "Agregue los berberechos y 300 ml / 10 fl oz de agua a una sartén grande con tapa. Cubra y cocine a vapor los berberechos hasta que se hayan abierto. Escurrir los berberechos reservando el licor de cocción. Deseche cualquier berberecho que no se haya abierto. Pase el licor de cocción a través de un colador fino y déjelo a un lado. Retire la carne de berberecho de las conchas, enfríe con agua helada y reserve.", "Para las verduras, agregue la mantequilla y el caldo a una sartén grande y mezcle bien. Agregue los nabos y cocine hasta que estén tiernos.", "Para los chalotes, agregue los chalotes, la mantequilla, el azúcar, el tomillo y el caldo de pollo a una sartén grande y cocine a fuego lento hasta que los chalotes estén caramelizados. Esto llevará unos 25 minutos.", "Para la salsa, coloque las alitas de pollo en una bandeja grande para asar con el aceite de oliva y cocine a fuego alto durante 2-4 minutos hasta que estén doradas.", "Agregue la carne de berberecho, chalotes, tomillo y pimienta negra a las alitas de pollo.", "Cuando los chalotes se hayan caramelizado, agregue la mantequilla y el licor de cocción del berberecho reservado y raspe la sartén para glasear. Cuando la salsa se reduzca a un jarabe, agregue el caldo de pollo marrón y cocine durante 20 minutos. Pase a través de un chinois (tamiz fino), regrese a la sartén y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Justo antes de servir, separe el pollo y fríalo con un poco de mantequilla.", "Para servir, coloque el pollo en un plato grande junto con la pasta de tamarindo, chalotes y salsa. Adorne con las tapas de nabo y las hojas de ostra. Rocíe con el aceite infusionado de cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_ayam_sioh_02588", "title": "Pollo 'ayam sioh'", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de yogurt natural", "½ limón, solo jugo", "1 cucharada de hojas de estragón picadas", "2 cebolletas pequeñas, finamente cortadas", "1 cucharada de mostaza Dijon", "1 cucharadita de azúcar en polvo", "2 cucharaditas de vinagre de vino blanco", "sal y pimienta negra recién molida", "1 pollo cocido, sin piel y carne cortada en pedazos", "6 lonchas de tocino rayado ahumado", "2 pequeña gema, hojas separadas", "Cohete 50g / 1¾oz", "2 aguacates pequeños, en rodajas", "25 g / 1 oz de semillas de calabaza, tostadas", "sal y pimienta negra recién molida"], "method": ["Para preparar el aderezo de yogurt y estragón, mida todos los ingredientes en un tazón. Condimentar con sal y pimienta. Agregue el pollo cocido al aderezo y cubra con la mezcla. Cubra y deje marinar en la nevera durante 2 horas o durante la noche.", "Cocine el tocino debajo de la parrilla o en una sartén hasta que esté crujiente y dorado. Ponga a un lado en un pedazo de papel de cocina. Una vez que esté frío, corta en pedazos pequeños.", "Coloque dos o tres hojas de lechuga juntas para formar una copa en un plato grande. Arriba con algunas hojas de cohetes. Repita, para que tenga seis tazas de lechuga dispuestas en un círculo para que parezca una corona de flores.", "Coloque la ensalada de pollo encima. Arregle el aguacate sobre el pollo. Espolvorear con semillas de calabaza y trozos de tocino. Sazone con sal y pimienta y servir."], "url": "www_bbc_co_uk_food_recipes_chicken_avocado_and_08446", "title": "Ensalada de pollo, aguacate y tocino", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_avocado_and_08446_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de cúrcuma molida", "Harina normal de 400 g / 14 oz, más 2 cucharadas de harina, para quitar el polvo", "1 cucharadita de sal", "2 cucharadas de aceite de oliva", "harina de maíz, para quitar el polvo", "250g / 9oz de mantequilla sin sal derretida", "1 ramita de canela", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "1 cucharadita de vainas de cardamomo verde", "½ nuez moscada, recién rallado", "½ cucharadita de pimienta de Jamaica molida", "1 cucharadita de jengibre molido", "1 cucharadita de cúrcuma molida", "2 dientes enteros", "2 cuchillas Maza", "½ cucharadita de semillas de nigella", "½ cucharadita de pimienta de Cayena molida", "1 cucharada de pétalos de rosa", "sal al gusto", "600g / 1lb 5 oz de calabaza, pelada y cortada en cubos de 3cm / 1¼in", "3 cucharadas de aceite de oliva", "3 cebollas rojas grandes, cortadas en medias medias", "botón de mantequilla", "150g / 5½oz de lardons ahumados", "Muslos de pollo de 900 g / 2 libras con la piel retirada y reservada, carne cortada en pedazos del tamaño de un bocado", "100g / 3½oz de piñones, tostados en una sartén seca", "Rasguños de cerdo 20g / ¾oz", "10g de cilantro fresco, hojas picadas", "2 cucharadas de piñones, tostados en una sartén seca", "2 cucharaditas de granos del paraíso (especias de África occidental disponibles a través de proveedores especializados en especias)", "puñado de hojas de espinaca bebé", "¼ de granada, solo semillas"], "method": ["Para la masa, combine la cúrcuma, la harina y la sal en un tazón grande y agregue suficiente agua para unir la masa (aproximadamente 330 ml / 11 fl oz de agua). Agregue el aceite de oliva y amasar hasta que la masa sea flexible. Divida en bolas de 30g / 1oz y colóquelas en una bandeja para hornear. Cubra con película adhesiva y déjela reposar durante dos horas en un lugar fresco (idealmente 15C / 60F).", "Para ras-el-hanout, tuesta la canela, los granos de pimienta, las semillas de cilantro, las semillas de comino y las vainas de cardamomo en una sartén seca. Mezcle las especias tostadas en un molinillo de especias con los ingredientes restantes de la mezcla de especias.", "Para el llenado, precaliente el horno a 180 ° C / 160 ° C (ventilador) / Gas 4. Mezcle la calabaza en un poco del aceite en una lata de asar y hornee hasta que esté tierna (aproximadamente 30 minutos). En una sartén, caliente la mantequilla y el aceite de oliva restante. Cuando esté caliente, freír las cebollas hasta que estén caramelizadas. En una sartén por separado, freír los lardons hasta que estén crujientes. Agregue el pollo y fría por otros cinco minutos, o hasta que esté recién cocinado. Retire del fuego y mezcle con la mezcla de cebolla junto con el ras-el-hanout. Dejar de lado para enfriar.", "Cuando la calabaza esté cocida, retírela del horno y déjela enfriar. Mezcle los piñones tostados en el relleno.", "Mantenga el horno a 200C / horno de ventilador 180C / 400F / Gas 6.", "Para la masa, cubra una mesa con una sábana de algodón limpia y espolvoreada con harina de maíz. Usando sus manos, comience a estirar suavemente la masa hasta que esté muy delgada y translúcida. Coloque las manos debajo de la masa y estire y tire del diluyente con el dorso de las manos. Espolvoree muy ligeramente con harina y deje reposar durante al menos 30 minutos para que se seque ligeramente.", "Cuando esté listo para ensamblar, toque la masa con mantequilla derretida y corte 30 cm / 12 en cuadrados de masa. Disponga los cuadrados de repostería en un molde de savarin bien engrasado, de modo que se superpongan y cubran todo el anillo del molde con muchos restos colgando sobre los bordes exteriores. Empaque la ronda de llenado enfriada dentro del anillo. Levanta los bordes de la masa y dobla para cubrir el relleno. Presione para sellar cualquier unión en la masa. Cubra con una bandeja para hornear bien engrasada y revuelva todo al revés. Retire el molde de savarin. Cepille el exterior de la masa con mantequilla.", "Hornee durante 20-25 minutos, o hasta que la masa esté dorada y crujiente.", "Para decorar, freír la piel de pollo reservada en una sartén hasta que esté crujiente, reservar para enfriar y luego cortar en trozos pequeños. Justo antes de servir, combine la piel del pollo con los ingredientes restantes, aparte de la espinaca y la granada.", "Para servir, espolvorea sobre la mezcla de piel de pollo y rellena el centro con espinaca baby y espolvorea con semillas de granada."], "url": "www_bbc_co_uk_food_recipes_chicken_bacon_butternut_06664", "title": "Pastel de pollo, tocino y calabaza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "4-6 muslos grandes de pollo (alrededor de 750 g / 1 lb 10 oz), sin hueso", "10g / ½ oz de mantequilla", "2 cebollas, finamente picadas", "2 dientes de ajo, finamente picados", "1 cucharadita de jengibre molido", "½ cucharadita de canela molida", "½ cucharadita de cúrcuma molida", "pizca de azafrán", "500ml / 18fl oz de caldo de pollo o agua", "3 huevos grandes de gallinas camperas, golpeados", "75 g / 2½ oz de almendras o pistachos molidos", "75g / 2½oz de dátiles secos, finamente picados", "1 cucharada de agua de azahar", "1 cucharadita de ralladura de naranja finamente rallada", "4 cucharadas de perejil fresco finamente picado", "30g / 1oz de mantequilla, derretida", "6 hojas grandes de pasta filo", "1 huevo, batido, para esmaltar", "sal y pimienta negra recién molida", "1 cucharada de azúcar glas, para decorar", "pizca de canela molida, para adornar"], "method": ["Calentar el aceite en una sartén grande. Agregue el pollo y fría, con la piel hacia abajo durante 2 minutos o hasta que esté crujiente y dorado. Voltee y cocine durante 2 minutos más, luego transfiera a un plato. Agregue la mantequilla a la sartén y, cuando se haya derretido, agregue las cebollas y saltee hasta que estén suaves. Agregue el ajo y las especias (no es necesario remojar el azafrán) y fría por un par de minutos más.", "Devuelve el pollo a la sartén. vierta sobre el caldo y sazone al gusto. Cocine a fuego lento, tapado, durante 30 minutos, o hasta que el pollo esté bien cocido y tierno.", "Retire el pollo nuevamente y déjelo a un lado. Cuando esté lo suficientemente frío como para manipularlo, córtalo finamente. Mientras tanto, reduzca el líquido de cocción a la mitad.", "Agregue los huevos al líquido de cocción y cocine a fuego lento hasta que se asemeje a los huevos revueltos de textura suelta. Agregue las almendras y revuelva, luego agregue las fechas, agua de azahar, cáscara de naranja, pollo y finalmente el perejil. Retirar del fuego y dejar enfriar.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Para ensamblar el pastel, use un plato redondo a prueba de horno de 28 cm / 11 pulgadas; puede usar una quiche de cerámica o un plato de flan o una lata de tarta de metal.", "Cepille una hoja de filo con mantequilla derretida. Cúbralo sobre el plato, empujándolo suavemente hacia las esquinas sin romperlo. Repita con otra hoja de filo, colocándolo en ángulo recto con el primero. Repita con otras 2 hojas de filo, colocándolas en un ángulo diagonal.", "Extiende el relleno sobre la masa. Doble sobre el filo que sobresale, en orden inverso: el relleno debe estar cubierto por el filo. Corte las 2 hojas restantes de filo para que quepan en el plato. Cepíllese con mantequilla derretida, luego cubra la tarta con la masa, metiéndola debajo de cualquier esquina. Hornee durante 30 minutos, o hasta que estén crujientes y marrones. Deje que se enfríe un poco antes de espolvorearlo con azúcar glas y canela."], "url": "www_bbc_co_uk_food_recipes_chicken_bastilla_07910", "title": "Chicken bastilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_bastilla_07910_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 4 oz de pollo, cortado en 8 piezas", "1 zanahoria, partida a la mitad", "1 cebolla pequeña, partida a la mitad", "1 puerro, descuartizado", "1 diente de ajo, aplastado", "1 ramita grande de tomillo", "1 hoja de laurel", "25g / 1oz de mantequilla, más extra para freír", "Harina normal de 25g / 1oz", "1 litro / 1¾ pintas licor de cocina de pollo (desde arriba)", "Cebollas para bebés 110 g / 4 oz", "110g / 4 oz champiñones, descuartizado", "4 yemas de huevo de gallinas camperas", "Crema doble 110ml / 4fl oz", "3 cucharadas de hojas de estragón, recogidas", "4 chalotes de plátano, cortados por la mitad", "2 cucharadas de aceite de oliva", "Guisantes de jardín frescos de 400g / 14oz, envainados", "50g / 1¾oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para pochar el pollo, coloque las piezas de pollo en una cacerola grande y cubra con 2 litros / 3½ litros de agua.", "Agregue la zanahoria, la cebolla, el puerro, el ajo, el tomillo y la hoja de laurel. Llevar a ebullición suave, bajar a fuego lento y cocinar durante 1 ¼ horas.", "Cuando la carne esté tierna, retírela del fuego. Escurra el pollo, reservando 1 litro / 1¾ pintas del licor de cocción para hacer la salsa. Dejar de lado.", "Para hacer la salsa, caliente una cacerola a fuego medio, agregue la mantequilla. Cuando se derrita, agregue la harina y siga revolviendo hasta que se haya absorbido por completo.", "Poco a poco mezcle el licor de caza furtiva reservado, revolviendo hasta que se haya incorporado todo el licor.", "Escurra la carne nuevamente y deseche el licor restante junto con la zanahoria, la cebolla, la hoja de laurel, el clavo de olor y el tomillo.", "Coloque la carne en la salsa.", "Calentar una sartén a fuego medio, agregar un poco más de la mantequilla y las cebollas bebé. Cocine hasta que esté ligeramente coloreado, luego agregue los champiñones y cocine por otros dos minutos.", "Incline las cebollas y los champiñones en el pollo y la salsa.", "Batir las yemas de huevo y la crema juntas en un bol y luego agregar gradualmente a la sartén, batiendo sobre la marcha.", "Retire del fuego y continúe batiendo por un par de minutos.", "Agregue el estragón y sazone al gusto con sal y pimienta. Mantenga caliente hasta que esté listo para servir.", "Para los chalotes tostados y guisantes de jardín frescos, precaliente el horno a 200C / 400F / Gas 6.", "Caliente una sartén grande de la plancha y rocíe el aceite sobre el lado cortado de los chalotes. Coloque sobre la plancha con la parte de corte hacia abajo y cocine durante 2-3 minutos, o hasta que esté coloreado y carbonizado. Cambie de volumen y cocine durante unos minutos más, luego colóquelo en el horno durante 15-20 minutos.", "Mientras tanto, caliente una olla de agua hirviendo y sazone con sal. Una vez que hierva, agregue los guisantes y cocine durante 3-4 minutos y luego escurra.", "Calentar una sartén y agregar la mantequilla y los guisantes, sazonar con sal y pimienta y cocinar suavemente durante unos minutos.", "Para servir, coloque un par de trozos de pollo en cada plato y cuchara sobre la salsa. Coloque los chalotes y guisantes asados ​​al lado del pollo."], "url": "www_bbc_co_uk_food_recipes_chicken_blanquette_with_65245", "title": "Blanquette de pollo con chalotes asados ​​y guisantes frescos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "4 patas de pollo enteras (muslo y muslo separados)", "225g / 8oz de chorizo, cortado en cubitos", "6 chalotes, pelados, finamente picados", "2 cucharadas de harina normal", "600 ml / 1 pinta de sidra seca", "150ml / ¼ pinta de caldo de pollo", "1 cucharada colmada de mostaza Dijon", "sal y pimienta negra recién molida", "3 cucharadas de crema doble", "1 apionabo, pelado, picado", "exprimir jugo de limón fresco", "25g / 1oz de mantequilla", "1-2 cucharadas de crema individual", "sal y pimienta blanca recién molida", "alubias al vapor, para servir"], "method": ["Para el pollo, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Caliente el aceite en una sartén grande a prueba de horno y agregue todas las piezas de pollo a la sartén. Cocine por 10-12 minutos, volteándolo frecuentemente hasta que se dore uniformemente. Retire con una espumadera y déjelo a un lado.", "Agregue el chorizo ​​y los chalotes a la sartén y fríelos, revolviendo con frecuencia durante cinco minutos, o hasta que se ablanden y la grasa comience a correr desde el chorizo. Espolvorea la harina y revuelve para cubrir.", "Vierta gradualmente la sidra y el caldo, revolviendo continuamente hasta que hierva y espese ligeramente. Agregue la mostaza, sazone bien con sal y pimienta y devuelva el pollo a la sartén.", "Cubra la sartén con papel de aluminio y cocine en el horno durante 35-40 minutos, o hasta que los jugos del pollo salgan limpios cuando se perforan con una brocheta.", "Para el puré de apio, coloque el apionabo en una olla y cúbralo con agua y un chorrito de jugo de limón. Llevar a ebullición, luego reduzca el fuego, cubra y cocine a fuego lento durante unos 15 minutos, o hasta que estén tiernos.", "Escurra bien el apionabo y vuelva a colocarlo en la sartén. Mash a fuego lento con la mantequilla y la crema individual. Sazonar con sal y pimienta blanca.", "Para servir, mezcle la crema doble en el licor de pollo y sirva el pollo y la salsa con el puré de apio y las alubias al vapor."], "url": "www_bbc_co_uk_food_recipes_chicken_braised_in_cider_22812", "title": "Pollo estofado en sidra y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_braised_in_cider_22812_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["180g / 6oz de sal marina", "Azúcar en polvo 180g / 6oz", "4 pechugas de pollo", "harina común, para quitar el polvo", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "4 alcachofas globo", "1 limón, cáscara y jugo sin cera", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 chalote, finamente picado", "2 dientes de ajo, aplastados", "200 g / 7 oz de champiñones, en rodajas", "200ml / 7fl oz de vino blanco seco", "1 manojo de albahaca fresca, toscamente picada"], "method": ["Para salmuera del pollo, disuelva la sal y el azúcar en 1.4 litros / 2½ litros de agua tibia. Agregue el pollo, cubra y transfiera a la nevera. Deja salmuera durante al menos 2 horas.", "Para preparar las alcachofas, corte el tallo a aproximadamente 1 cm / ½ pulgada del globo. Despegue las hojas exteriores, cepillando el corazón blanco con jugo de limón sobre la marcha para evitar que se ponga negro. Cuando hayas alcanzado el corazón, corta la parte superior aproximadamente un tercio del camino hacia arriba desde la base y descarta los dos tercios superiores. Raspe el choke peludo del centro de la alcachofa con una cuchara.", "Con un cuchillo pequeño, corte la piel exterior del corazón, aplicando generosamente jugo de limón sobre la marcha. Cortar en aproximadamente seis rebanadas y cocine a fuego lento en agua hirviendo durante 5 minutos, o hasta que estén cocidos. Cubra y reserve.", "Deseche la salmuera y seque el pollo con papel de cocina. Coloque entre dos pedazos de película adhesiva y, usando un rodillo, golpee las pechugas de pollo hasta que todas tengan un grosor uniforme. Sazonar bien con sal y pimienta y cubrir con la harina.", "En una sartén con tapa, derretir la mantequilla y el aceite de oliva a fuego medio. Agregue el pollo y cocine durante 2 minutos en cada lado, o hasta que estén doradas. Coloque la tapa y cocine suavemente durante diez minutos. Levante el pollo de la sartén, envuélvalo en papel de aluminio y déjelo reposar durante 10 minutos.", "Para terminar las alcachofas, agregue el aceite de oliva y la mantequilla a la sartén. A fuego medio, cocine suavemente la chalota hasta que esté suave y translúcida. Agregue el ajo y cocine por un minuto más. Revuelva las alcachofas y los champiñones y cocínelos hasta que comiencen a colorear.", "Agregue el vino y el jugo de limón restante y cocine hasta que el volumen del líquido se haya reducido a la mitad. Retirar del fuego y doblar a través de la ralladura de limón y la albahaca. Para servir, coloque las verduras en el medio de cuatro platos, cubra con una pechuga de pollo y una llovizna de los jugos de reposo."], "url": "www_bbc_co_uk_food_recipes_chicken_breast_served_18110", "title": "Muy elegante pechuga de pollo fricassée con alcachofas al limón y champiñones", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]