[{"isVegetarian": true, "title": "Fennel remoulade", "url": "www_bbc_co_uk_food_recipes_fennelremoulade_83624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg yolk", "1 tsp white wine vinegar", "1 tsp Dijon mustard ", "½ tsp dried chilli flakes", "1 tsp chopped fresh chives", "50ml/2fl oz hot water", "200ml/7fl oz vegetable oil", "salt and freshly ground black pepper ", "¾ fennel bulb, finely sliced", "½ banana shallot, finely sliced", "1 tbsp chopped parsley ", "½ lemon, juice only", "fresh chervil leaf to garnish", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mayonnaise, place the yolk, vinegar, mustard, chilli flakes, chives and hot water into a food processor and blend.", "Whilst the food processor is running, gradually add the vegetable oil in a constant flow. ", "When all the vegetable oil has been added, season with salt and freshly ground black pepper.", "To make the remoulade, place the fennel, shallot, parsley and lemon juice into a large bowl and mix well.", "Add some of the mayonnaise and mix once more to coat, then season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the remoulade into the centre of a plate and garnish with the chervil leaf."]}, {"isVegetarian": false, "title": "Fennel sausages braised with lemony potatoes and bay leaves", "url": "www_bbc_co_uk_food_recipes_fennelsausagesbraise_86774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelsausagesbraise_86774_16x9.jpg", "ingredients": ["450g/1lb luganega sausages (available from specialist Italian or Continental grocers), or other nice meaty pork chipolatas", "4 tbsp extra virgin olive oil", "1 small onion, halved and thinly sliced", "2 garlic cloves, thinly sliced", "750g/1½lb small waxy potatoes, peeled and each cut into quarters", "½ lemon, pared zest and juice only", "4 fresh bay leaves", "2 tbsp fresh parsley, chopped ", "salt and freshly ground black pepper", "120ml/4fl oz water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Twist the sausages into 7.5cm/3in lengths and separate them into individual sausages. ", "Heat one tablespoon of the oil in a 26cm/10in shallow flameproof casserole dish. Add the sausages and fry until nicely browned all over. Lift them onto a plate and set aside. ", "Add the onion, garlic and another tablespoon of oil to the casserole dish and fry until soft and lightly golden. Stir in the potatoes, browned sausages, lemon zest and juice, bay leaves, half the chopped parsley, ½ teaspoon salt and ten turns of the black pepper mill. ", "Pour over the rest of the oil along with the water, cover tightly with the lid and bake for 30-40 minutes until the potatoes are tender. ", "Remove the lemon zest and sprinkle with the rest of the parsley before serving."]}, {"isVegetarian": true, "title": "Fennel seed drop-biscuits", "url": "www_bbc_co_uk_food_recipes_fennelseeddropbiscui_86436", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelseeddropbiscui_86436_16x9.jpg", "ingredients": ["80g/2¾oz plain flour, sifted", "70g/2½oz caster sugar", "2 tbsp skimmed milk powder", "140ml/5fl oz milk", "1 brown cardamom pod, seeds removed and ground to a powder in a pestle and mortar", "1½ tsp fennel seeds, ground to a powder in a pestle and mortar", "pinch of salt", "1 tbsp ground almonds ", "2 tbsp butter, melted ", "4 tbsp ghee or vegetable oil, for frying"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the flour, sugar, powdered and whole milk, spices, salt, almonds and melted butter in a bowl. Leave to rest for ten minutes.", "Heat the oil or ghee in a non-stick frying pan and drop small tablespoons of the batter into the pan. Fry over a moderate heat for about 1-2 minutes, turning once, until golden on both sides.", "Remove from the pan and drain on kitchen paper. Serve while still slightly warm."]}, {"isVegetarian": true, "title": "Fennel soup", "url": "www_bbc_co_uk_food_recipes_fennelsoup_85861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "½ shallot, finely chopped", "100g/3½oz new potatoes, peeled and chopped", "½ large fennel bulb, chopped", "150ml/¼ pint hot chicken stock (vegetarians can substitute vegetable stock)", "salt and freshly ground black pepper ", "small handful fresh dill, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan and gently fry the shallot until softened but not coloured.", "Add the new potatoes and fennel and sauté for 2-3 minutes.", "Add the stock and bring to the boil. Reduce the heat and simmer for 8-10 minutes, or until the vegetables are tender. Season, to taste, with salt and freshly ground black pepper and allow to cool slightly.", "Pour the soup into a blender, add the dill and blend until smooth. If necessary, gently reheat the soup before serving.", "To serve, pour the soup into a serving bowl."]}, {"isVegetarian": false, "title": "Fennel tarte tatin with pan-fried scallops and Sauternes beurre blanc", "url": "www_bbc_co_uk_food_recipes_fenneltartetatinwith_86660", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fennel bulb, cut into 1cm/½in thick slices, top fronds reserved for garnish", "1 orange, juice only", "2 sprigs fresh thyme", "75ml/3fl oz vegetable stock", "50ml/2fl oz water", "75g/3oz caster sugar", "20g/¾oz butter", "200g/7oz ready-made puff pastry, rolled to 5mm/¼in thick", "corals from 3 scallops (see below)", "55ml/2fl oz water", "2 shallots, finely chopped", "90ml/3½fl oz Sauternes wine", "150g/5oz chilled butter, cut into pieces", "salt and freshly ground black pepper ", "25g/1oz butter", "6 hand-dived scallops, shells removed, corals separated", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the fennel, orange juice, thyme, vegetable stock and water into a pan and bring to the boil. Reduce the heat and simmer for five minutes, or until the fennel is just tender. Drain the fennel, discarding the cooking liquid, and pat dry.", "Divide the sugar between two small blini pans and heat gently without stirring until the sugar caramelises and turns golden-brown. Remove from the heat, then divide the butter between the two pans and stir. Divide the fennel slices between the pans.", "Cut out two circles of pastry slightly larger than the circumference of the pans. Place the pastry over the fennel, pressing down around the edges to enclose the filling.", "Place in the oven and bake for 10-12 minutes, or until the pastry is golden-brown and cooked through.", "For the Sauternes beurre blanc, place three of the scallop corals into a blender with the water and blend until smooth (you can freeze the remaining three corals for use in another dish, but only if the scallops have not been previously frozen).", "Place the shallots, the coral purée and the Sauternes into a frying pan. Bring to the boil, then reduce the heat and simmer until reduced by half.", "Whisk in the butter, a little at a time, until well combined, then season, to taste, with salt and freshly ground black pepper.", "For the scallops, heat the butter in a frying pan until foaming. Season the scallops with salt and freshly ground black pepper, then place in the frying pan and cook on each side for 1-2 minutes, or until just cooked through.", "To serve, carefully turn the tarte tatins out onto serving plates. Place three scallops onto the centre of each tarte tatin, then spoon the beurre blanc over the scallops and around the edge. Top with a sprig of fennel top."]}, {"isVegetarian": true, "title": "Festive chocolate flapjacks", "url": "www_bbc_co_uk_food_recipes_festive_chocolate_94638", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/festive_chocolate_94638_16x9.jpg", "ingredients": ["50g/2oz walnuts", "4 dried figs", "30g/1oz sour cherries", "30g/1oz cranberries", "30g/1oz pumpkin seeds", "1 tbsp ground almonds", "50g/2oz butter", "100g/3½oz golden caster sugar", "2 tbsp golden syrup", "100g/3½oz porridge oats", "100g/3½oz rolled oats ", "100g/3½oz dark chocolate "], "serves": "Makes 8 flapjacks", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Turn the oven on to 180C/350F/Gas 4.", "Roughly chop the walnuts and figs then add to a food processor along with the sour cherries, the cranberries and half the pumpkin seeds. Add a spoonful of ground almonds and blitz together - but not for long - leaving nice sizable chunks of the nuts and fruit. Tip into a large mixing bowl along with the rest of the whole pumpkin seeds. ", "In a pan melt the butter with the sugar and golden syrup, trying not to stir it too much and allowing it to melt together gradually.", "Once melted mix in the oats and the fruit and nuts and spread the mixture out evenly in an oven tray then bake for 25 minutes.", "Melt the chocolate in a bowl over simmering water. When the flapjacks are baked, cut them into small rectangles and dip them as far as you dare into the melted chocolate.", "Allow to chill for 20 minutes in the fridge and then serve."]}, {"isVegetarian": true, "title": "Fennel and feta linguine", "url": "www_bbc_co_uk_food_recipes_fennel_and_feta_linguini_59137", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_feta_linguini_59137_16x9.jpg", "ingredients": ["200g/7oz linguine", "1 fennel bulb", "1 banana shallot", "2 tbsp olive oil", "15 basil leaves", "100g/3½oz feta cheese"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in a pan of boiling, salted water, according to packet instructions.", "Slice the fennel and shallot, and fry in the oil until soft.", "Tear the basil over the fennel and shallot and crumble in the feta.", "When the pasta is cooked, drain and combine with the shallot and fennel."]}, {"isVegetarian": true, "title": "Festive fruit salad with brandy snap", "url": "www_bbc_co_uk_food_recipes_festive_fruit_salad_with_97182", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/festive_fruit_salad_with_97182_16x9.jpg", "ingredients": ["60g/2¼oz butter, plus extra for greasing", "2 tbsp caster sugar", "2 heaped tbsp golden syrup", "4 tbsp plain flour", "1 tsp ground ginger", "1 tsp brandy", "2 tbsp chopped pistachios", "1 orange, juice only", "1 lime, juice only", "1 lemon, juice only", "1 mango, cut into cubes", "4 clementines, separated into segments", "1 pomegranate, seeds only", "6 cape gooseberries (physalis)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Grease two baking trays with butter.", "For the brandy snaps, melt the butter with the sugar and golden syrup in a saucepan. As soon as it starts to bubble, add the flour, ginger, brandy and pistachios and stir until well combined.", "Using a teaspoon, place six walnut-sized blobs of the mixture onto the buttered baking tray. No need to flatten, as they will spread naturally.", "Bake for 10-12 minutes until golden-brown. Leave to cool on the baking tray for five minutes, and then lift them off with a palette knife. Lay them on a rolling pin to set.", "For the fruit salad, combine the orange, lime and lemon juice in a large bowl.", "Add the mango and the clementines, scatter over the pomegranate seeds and serve with the brandy snaps and a few physalis."]}, {"isVegetarian": false, "title": "Festive duck breast with pancetta, Savoy cabbage and mash", "url": "www_bbc_co_uk_food_recipes_festiveduckbreastwit_87820", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts, skin on", "salt and freshly ground black pepper", "2 star anise", "1 cinnamon stick", "2 cloves", "½ orange, zest only", "150ml/5fl oz port", "110ml/4fl oz fresh chicken stock", "25g/1oz butter", "4 slices black pudding", "1 pear, peeled and cut into wedges", "500g/1lb 2oz King Edward potatoes, peeled and cut into cubes", "pinch salt", "50g/2oz butter", "75ml/3fl oz milk", "salt and freshly ground black pepper", "110g/4oz pancetta, cut into small cubes", "2 tbsp maple syrup", "½ Savoy cabbage, finely shredded", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the duck, score a diamond pattern across the duck skin then season both sides with salt and freshly ground black pepper.", "Heat a frying pan until hot and add the duck breasts, skin-side down.", "Turn the heat down to low and cook for six minutes on each side for pink (or eight minutes on both sides for well-done).", "Remove the duck from the pan and rest on a warm plate, covered with aluminium foil.", "Pour off most of the excess duck fat from the pan and turn up the heat (the duck fat can be reserved for roasting potatoes).", "Add the star anise, cinnamon, cloves and orange zest to the pan and fry for one minute.", "Add the port and bring to a simmer, stirring to remove any residual duck juices from the pan. Add the chicken stock and boil for three minutes over a high heat, until the sauce has reduced and thickened.", "Season with salt and freshly ground black pepper, to taste.", "Heat a separate frying pan until hot and add the butter, black pudding and pear and fry for 1-2 minutes on each side until golden-brown. Keep warm while you prepare the potatoes.", "For the mash, place the potatoes into a saucepan and cover with water, then add a pinch of salt. Bring to the boil, reduce the heat and simmer for 15-18 minutes, until tender.", "Drain the potatoes and return them to the pan over a low heat to remove any excess moisture.", "Using a potato masher or ricer, mash the potatoes well. Fold in the butter and milk and season with salt and freshly ground black pepper, to taste. Cover to keep warm while you prepare the cabbage.", "For the cabbage, heat a frying pan until hot, add the pancetta and cook for two minutes until golden-brown.", "Add the maple syrup and stir to coat the pancetta. Add the cabbage and stir again. Cook for 2-3 minutes, until the cabbage has wilted. Season with salt and freshly ground black pepper, to taste. Keep warm.", "To serve, carve the duck into thick diagonal slices. Spoon the mash onto each plate and top with the duck. Spoon a pile of cabbage alongside. Top the cabbage with the black pudding and pear and spoon the sauce over."]}, {"isVegetarian": true, "title": "Festive sponge with cranberry crown and cream", "url": "www_bbc_co_uk_food_recipes_festivespongewithcra_87782", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, softened, plus extra for greasing", "100g/3½oz self-raising flour", "100g/3½oz caster sugar", "85g/3oz cranberries", "½ orange, juice only", "2 free-range eggs", "30g/1oz cranberries", "1 orange, juice and zest only", "1 tbsp honey", "double cream, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge, place all the sponge ingredients into a food processor and blend briefly until smooth.", "Pour the mixture into a greased 570ml/1 pint pudding basin. Cover with cling film and microwave on high for five minutes, or until well risen and springy to the touch.", "For the cranberry crown, place the cranberries, orange juice and zest and honey into a small pan and simmer for five minutes.", "To serve, turn the sponge out onto a plate. Pour over the cranberries and serve with double cream."]}, {"isVegetarian": true, "title": "Feta cheese bread", "url": "www_bbc_co_uk_food_recipes_fetacheesebread_90173", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp fast action dried yeast", "600ml/20fl oz warm water, plus extra for the yeast", "1 tsp caster sugar", "1kg/2lb 4oz strong bread flour", "30g/1oz salt", "olive oil, for greasing", "knob of butter, for greasing", "60ml/2fl oz extra virgin olive oil", "350g/12oz feta, crumbled ", "pinch freshly ground black pepper", "handful fresh mint, chopped ", "1 free-range egg, beaten", "75g/2¾oz unsalted butter", "100g/3½oz honey", "250g/9oz medjool dates", "1 tbsp shelled pistachios"], "serves": "Makes 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the yeast in a little of the warm water. Add the sugar and gently mix.", "Mix the flour and salt, then place in a pile onto a clean work surface. Make a well in the centre of the flour.", "Add the remaining water and the yeast mixture to the well in the flour and mix, from the centre outwards, to form a dough.", "Knead the dough for 7-8 minutes, until it stops being sticky. (The dough is ready when it stretches out between your hands without breaking.)", "Oil a bowl with the olive oil and place the dough into it. Cover with a damp cloth and leave for at least two hours. The mixture should double in size during this time.", "Turn out the dough onto a clean work surface and, using your hands, knock it back, to reduce the size of the dough.", "Add the oil, feta, freshly ground black pepper and mint and knead into the dough, until completely combined.", "Divide the dough into four equal-sized portions, then shape into loaves.", "Place the loaves onto a floured baking tray. Cover with a damp cloth and leave to rise at room temperature for 40-60 minutes. ", "Preheat the oven to 180C/360F/Gas 4.", "Brush the loaves with the beaten egg.", "Place into the oven to bake for 20-30 minutes, or until cooked through and golden-brown. Remove and leave to cool.", "For the honeyed dates, place the butter and honey into a pan over a medium heat. Bring to the boil and add the dates and pistachios and cook for two minutes.", "To serve, slice the loaves and serve the honeyed dates in a bowl alongside."]}, {"isVegetarian": false, "title": "Feta-crusted lamb with coriander and raisin couscous", "url": "www_bbc_co_uk_food_recipes_fetacrustedlambwithc_86808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¾oz  lamb chop", "½ tbsp olive oil", "1 lemon, juice only", "55g/2oz feta cheese, crumbled", "salt and freshly ground black pepper", "150g/5oz couscous", "200ml/7fl oz hot vegetable stock", "1 lemon, juice only", "5 tbsp olive oil", "100g/3½oz raisins", "handful of fresh coriander, chopped"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to the highest setting.", "Rub the lamb with olive oil and fry in a hot griddle pan for three minutes on each side.", "Squeeze the lemon juice over the lamb and top with the feta cheese. Season with salt and freshly ground black pepper.", "Place under the hot grill for two minutes or until the cheese turns golden.  Remove from the grill and leave to rest for five minutes.", "For the couscous, place the couscous in a heatproof bowl and pour over the hot stock. Cover with a plate and leave to stand for five minutes.", "Remove the plate and fluff up the couscous using a fork.  ", "Add the lemon juice and oil and season well.", "Stir through the raisins and coriander and pile onto a serving plate. Arrange the lamb on the bed of couscous and serve."]}, {"isVegetarian": true, "title": "Feta, olive and sun-dried tomato scones", "url": "www_bbc_co_uk_food_recipes_fetaoliveandsundried_67260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz feta, cubed small ", "10 black olives, pitted and roughly chopped ", "50g/2oz  sun-dried tomatoes, drained of oil and chopped (reserve 1 tbsp oil) ", "175g/6oz  self-raising flour ", "50g/2oz  wholewheat flour ", "¼ level tsp baking powder ", "¼ level tsp cayenne pepper ", "¼ level tsp mustard powder ", "2 tbsp extra virgin olive oil ", "1½ level tsp fresh thyme, chopped ", "1 egg ", "2 tbsp milk ", "milk, for brushing ", "50g/2oz feta, crumbled"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Sift the flours and baking powder into a large, roomy bowl, tip in any bran left ", "in the sieve, then add the cayenne and mustard powder and, using a knife, work in the 2 tbsp of olive oil, plus the reserved tbsp of oil from the sun-dried tomatoes. ", "When the mixture looks like lumpy breadcrumbs stir in the chopped thyme, cubed feta, olives and sun-dried tomatoes.", "Now in a separate bowl beat the egg with the 2 tbsp of milk and add half this mixture to the other ingredients. Using your hands, bring the mixture together to form a dough, adding more of the egg and milk as it needs it - what you should end up with is a dough that is soft but not sticky.", "Now on a floured board, roll the dough out to a depth of 2.5cm/1in. Then stamp out the scones using a 5cm/2in cutter, either plain or fluted. Put the cut-out pieces on a baking tray and brush them with the milk. ", "Finally top each scone with the crumbled feta, and put the tray on the highest shelf of the oven to bake for 12-15 minutes or until they've turned a golden colour. Then remove them to a wire rack until they are cool enough to eat."]}, {"isVegetarian": false, "title": "Fettuccine Alfredo", "url": "www_bbc_co_uk_food_recipes_fettuccine_alfredo_47554", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fettuccine_alfredo_47554_16x9.jpg", "ingredients": ["500g/1lb 2oz dried fettuccine pasta", "300ml/10½fl oz double cream", "30g/1oz butter", "freshly grated nutmeg, to taste", "200g/7oz freshly grated parmesan cheese", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in a large pan of boiling salted water for 10-12 minutes, until al dente. Meanwhile, put the cream in a saucepan with the butter and a little grated nutmeg and warm through gently. Stir in the parmesan.", "Drain the pasta, reserving about three tablespoons of the cooking water, then tip it straight into the cream sauce. Add as much of the reserved water as needed to loosen the consistency of the sauce to your liking. Mix gently, adding plenty of freshly ground black pepper. Serve immediately."]}, {"isVegetarian": true, "title": "Feta, roasted red pepper and pine nut pancakes", "url": "www_bbc_co_uk_food_recipes_feta_roasted_red_pepper_90674", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/feta_roasted_red_pepper_90674_16x9.jpg", "ingredients": ["1 large free-range egg", "50g/1¾oz plain flour", "pinch salt", "100ml/3½fl oz milk", "knob of butter, for frying", "handful rocket leaves", "30g/1oz roasted red pepper from a jar, drained and cut into strips", "½ small red onion, thinly sliced ", "50g/1¾oz feta, crumbled", "30g/1oz pine nuts, toasted", "handful flatleaf parsley, roughly chopped", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pancake batter, place the eggs, flour and salt into a bowl and beat together with a whisk. Pour in the milk and whisk again until smooth.", "Melt the butter in a frying pan over a medium heat. Pour in a ladle of pancake batter and cook for 1–2 minutes. Flip over and cook for another 1–2 minutes. Repeat to cook the second pancake.", "For the topping, scatter a few rocket leaves over each pancake. Top with the red pepper, onion, feta and pine nuts, then the parsley. ", "Season well with salt and freshly ground black pepper and squeeze over lemon juice. Roll up to serve."]}, {"isVegetarian": false, "title": "Fettuccine with purple sprouting broccoli", "url": "www_bbc_co_uk_food_recipes_fettuccinewithpurple_67561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely diced", "1 organic garlic clove, finely chopped", "4 anchovy fillets, finely chopped", "2 tsp capers, rinsed and chopped", "1 tsp rosemary leaves", "1 tsp chopped flat leaf parsley", "4 tsp extra virgin olive oil", "285g/10oz purple sprouting broccoli", "450g/1lb fresh fettuccine", "½  lemon, juice only", "salt and freshly ground black pepper", "parmesan shavings, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the hot dressing, heat the olive oil in a frying pan and when hot add the onions, garlic, anchovies, capers, rosemary and parsley. Fry gently until the onions have softened, without colouring them. Keep warm until ready to serve.", "Meanwhile, cook the broccoli in plenty of boiling water with a little salt for two minutes, then add the fettuccine and stir and cook for another three minutes. Drain when the pasta is cooked (the broccoli will have broken up slightly).", "To serve, place the pasta and broccoli in a bowl and combine with the hot dressing. Add lemon juice and season to taste with salt and pepper. Serve with shavings of parmesan."]}, {"isVegetarian": true, "title": "Festive pilau rice", "url": "www_bbc_co_uk_food_recipes_festivepilaurice_84852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil, plus extra for oiling", "½ large onion, chopped", "½ red pepper, chopped ", "1 garlic clove, chopped", "50g/1¾oz walnuts, shelled, chopped ", "75g/2¾oz canned red kidney beans, rinsed and drained", "200g/7oz basmati rice, cooked in vegetable stock or according to packet instructions", "salt and freshly ground black pepper ", "1 large bunch fresh chervil, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan and fry the onion, red pepper and garlic until soft.", "Add the walnuts and kidney beans to the pan and cook for a further 2-3 minutes.", "Add the rice to the pan, warm through and season with salt and freshly ground black pepper.", "Remove the pan from the heat and stir in the chopped chervil.", "Lightly oil a large bowl and pack the rice mixture into the bowl.", "To serve, turn the rice out onto a plate to make a dome shape."]}, {"isVegetarian": true, "title": "Feuillete of mango mousse", "url": "www_bbc_co_uk_food_recipes_feuilleteofmangomous_84505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sheet ready-made puff pastry, rolled out to ½cm/¼in thickness", "1 free-range egg, lightly whisked, to glaze", "½ mango, stone removed", "100ml/3½fl oz double cream, whipped until stiff peaks are formed when the whisk is removed", "1 vanilla pod, seeds scraped out", "1 tbsp icing sugar, plus extra for dusting ", "6-8 fresh mint leaves, finely chopped", "sprig of fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Cut a diamond shape from the pastry and lay onto an oiled baking sheet.", "Use a sharp knife to score a smaller diamond 1cm/½in inside the edge of the pastry, making sure that the cut is not made all the way through the pastry.", "Brush the pastry with the beaten egg and place into the oven to bake for 10 minutes, or until the pastry is risen and golden. Remove from the oven and allow to cool. ", "For the mango mousse, place the mango into a food processor and blend until smooth. Spoon a small amount of this mango purée around the edge of a plate.", "In a bowl, fold the remaining mango purée into the whipped double cream. ", "Add the vanilla seeds, icing sugar and chopped fresh mint and fold into the cream mixture to combine.", "Using a sharp knife, carefully slice off the bottom of the pastry case and use a little of the mousse to secure it to the centre of a serving plate.", "Spoon a generous amount of the mango mousse on top of the pastry base, then place the pastry lid on top.", "To serve, dust with icing sugar and garnish with a fresh mint sprig."]}, {"isVegetarian": false, "title": "Field mushroom soup with crisp red mullet and shallot herb crème fraîche", "url": "www_bbc_co_uk_food_recipes_fieldmushroomsoupwit_86160", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz wide-cap flat mushrooms", "3 tbsp olive oil", "3 large shallots, chopped", "2 garlic cloves, sliced", "salt and freshly ground black pepper", "½ lemon, juice only", "1 litre/1¾ pints hot vegetable or chicken stock ", "250ml/9fl oz double cream", "150g/5oz unsalted butter, cubed (optional)", "6 tbsp olive oil", "100g/3½oz mixed wild mushrooms", "salt and freshly ground black pepper", "4 small fillets fresh red mullet, de-scaled and boned", "75ml/2½fl oz crème fraîche ", "2 shallots, finely chopped", "1 sprig fresh chervil, chopped", "1 sprig fresh tarragon, chopped", "1 sprig fresh coriander, chopped", "few chives, chopped", "salt and freshly ground black pepper", "few drops lemon juice", "drizzle extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the soup, remove the dark gills from the mushrooms and discard them. Wash and dry the mushrooms, then cut into 2mm slices.", "Heat the olive oil in a large heavy-based pan, add the shallots and cook until just coloured. Add the garlic and cook until soft, then add the mushrooms. ", "Season with salt and freshly ground black pepper to taste, and cook for 5-8 minutes or until the mushrooms are golden.", "Add the lemon juice and the stock. Bring to a rapid simmer and then turn down to a low heat to gently simmer for 15 minutes.", "Check the seasoning again, adding more salt and freshly ground black pepper, to taste, if necessary. ", "Ladle the soup into a blender or food processor and allow to cool for two minutes. Blend until smooth, then strain through a fine sieve back into a clean pan.", "To finish, add the cream and stir it in over a medium heat - you can also stir in cubed butter for a silkier finish. Keep warm.", "For the red mullet and mushrooms, heat a frying pan until hot then add three tablespoons of olive oil, the wild mushrooms and a pinch of salt.", "Stir-fry the mushrooms until cooked through, then remove them with a slotted spoon and transfer onto a plate lined with kitchen paper.", "Season both sides of the red mullet with salt and freshly ground black pepper.", "Heat a second frying pan until hot then add the remaining olive oil and the red mullet skin-side down.", "Give the pan a little shake to ensure that the fish doesn't stick. The fish may curl up, but do not press it down as this will zip back the skin - leave the fish be and the fillets should flatten out naturally. ", "Cook for 1½ minutes on the skin side, then turn over and cook for a further minute, or until completely cooked through. ", "Remove the fish from the pan and transfer to a plate lined with kitchen paper.", "For the shallot and herb crème fraîche, place the crème fraîche into a small bowl and add the shallots and chopped herbs. Add salt, freshly ground black and lemon juice to taste and stir to combine.", "To serve, put a small mound of the cooked wild mushrooms in the middle of four wide-rimmed soup bowls. Place a fillet of red mullet on top of each serving and pour the soup around. Spoon the crème fraîche mixture on top of the fish, so it melts into the soup. Drizzle extra virgin olive oil around to taste."]}, {"isVegetarian": true, "title": "Fiery red rice salad", "url": "www_bbc_co_uk_food_recipes_fiery_red_rice_salad_91889", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb Camargue red rice ", "1 tsp salt", "6 carrots", "8 spring onions ", "small bunch coriander leaves, chopped ", "4 limes, finely grated zest and juice only", "4 tsp honey", "2 red chillies, finely chopped", "4 tbsp light olive oil", "2 tbsp cider vinegar", "salt and pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Measure the rice in a jug, then place in a pan with double the volume of boiling water. Add the salt. Bring to the boil, then cover and reduce the heat to a low simmer and cook for 20-30 minutes, or until the grains are tender but still have a little bite.", "Meanwhile, coarsely grate the carrots (use the thick grating blade of a food processor if you have one) and thinly slice the spring onions. Tip into a bowl and add half of the chopped coriander.", "For the dressing, make the dressing by mixing all the ingredients together in a jam jar and shake.", "Drain the rice if necessary and add to the bowl with the vegetables.  Add the dressing, taste and season with more salt and pepper if necessary. Serve with the remaining coriander scattered on top."]}, {"isVegetarian": false, "title": "Fiery octopus (Ojingeo bokkeum)", "url": "www_bbc_co_uk_food_recipes_fiery_octopus_ojingeo_90139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz baby octopus (fresh or frozen, if frozen defrost thoroughly)", "½ tbsp vegetable oil ", "½ small onion, sliced", "5 shiitake mushrooms, stalks removed, sliced thinly", "2 spring onions, cut in half lengthways", "1 small red chilli, thinly sliced on a slant ", "1 tsp sesame oil", "sprinkle of sesame seeds", "10g fresh root ginger (about the size of a £2 coin)", "3 garlic cloves, grated or chopped", "2 tsp gochujang (Korean red chilli paste) ", "1 tsp soy sauce ", "2 tsp gochugaru (Korean red chilli powder)", "½ tsp golden syrup", "1 tsp mirin"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean and rinse the octopus in cold water and remove the beak (you can get your fishmonger to prepare it for you). ", "For the spice paste, peel and grate the ginger and put it in a medium bowl with the garlic, chilli paste, soy sauce, chilli powder, golden syrup and mirin. Mix well and then set aside.", "Heat a medium pan of boiling water, add the octopus to the boiling water and blanch for 1½ minutes, then drain.  Put the octopus into a bowl of ice-cold water and drain again once cool. Remove the skin from the octopus. Cut into quarters or just remove the tentacles if very small. Cut into bite-sized pieces. ", "Heat a frying pan or wok, add the oil and fry the onion for a couple of minutes. Add the octopus and paste to the onions and cook for a minute. Add the mushrooms, cook for another minute and then add the spring onions, chillies and sesame oil.  Sprinkle sesame seeds into and over and serve."]}, {"isVegetarian": false, "title": "Fiery filled peppers", "url": "www_bbc_co_uk_food_recipes_fieryfilledpeppers_89169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "700g/1lb 9oz rump steak, cubed", "2 red onions, finely chopped", "4 garlic cloves, crushed ", "50g/2oz tomato purée", "3 small red chillies, chopped", "2 x 400g/14oz cans chopped tomatoes", "1 tsp ground coriander", "pinch ground cumin", "pinch ground cinnamon", "1 bay leaf", "450g/1lb canned black beans", "salt and freshly ground black pepper", "30g/1oz high quality dark chocolate, grated", "4 large green peppers", "175g/6oz cheddar, grated", "rice, cooked according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Heat the oil in a deep, heavy-based pan over a medium heat.", "Add the steak and fry in batches for 3-4 minutes, or until golden-brown all over. Place the steak into a colander over a bowl to drain off any excess fat. Discard the collected fat.", "Add the onion and garlic to the same pan and fry until soft.", "Add the tomato purée and cook for six minutes.", "Add the chillies and cook for one minute.", "Add the canned tomatoes, coriander, cumin, cinnamon and the bay leaf.", "Return the meat to the pan and stir well. Simmer for 5-6 minutes.", "Add the beans and cook for 15 minutes.", "Season, to taste, with salt and freshly ground black pepper and stir in the chocolate.", "Cut off the tops of the green peppers and scrape out the seeds.", "Level the bottom of each pepper with a knife to allow them to stand upright on a baking tray.", "Place the peppers into a pan of boiling water to blanch for three minutes. Remove with a slotted spoon and plunge into a bowl of cold water to stop the cooking process, then drain.", "Set half of the cheddar aside. Divide the other half of the cheddar equally among the peppers.", "Spoon chilli beef mixture into each pepper to fill to the brim.", "Top with equal amounts of the reserved grated cheddar and arrange, standing upright, onto a baking tray.", "Transfer to the oven and cook for 15 minutes.", "Remove from the oven and place onto plates with a spoonful of rice alongside."]}, {"isVegetarian": false, "title": "Fiery pork patties with pickled cucumber", "url": "www_bbc_co_uk_food_recipes_fieryporkpattieswith_10413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz pork sausage, removed from its casing", "3 spring onions,  finely chopped", "2 cloves garlic,  finely chopped", "1 red chilli,  finely chopped", "2 tbsp light soy sauce", "1 tsp sesame oil ", "1 tsp caster sugar", "½ tsp cornflour", "2tsp coriander, chopped", "pinch of salt", "seasoned flour", "vegetable oil for frying", "½ cucumber, halved, de-seeded and sliced thinly", "1 tbsp sesame seeds, toasted", "4 tbsp white wine vinegar", "2 tbsp caster sugar", "salt to taste", "small bunch coriander, chopped"], "serves": "Serves 4 as a starter", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the patties, simply tip all of the ingredients (except the seasoned flour and vegetable oil) into a large bowl and mix well with clean hands. ", "With slightly moist hands, divide the mixture in six to eight small round patties. ", "Dip the patties in seasoned flour until evenly coated, shaking off any excess. ", "Place on a baking tray and refrigerate for about 30 minutes or until ready to use.", "Just before you cook the patties, prepare the pickled cucumber by simply mixing together all the ingredients. Set to one side.", "Heat the vegetable oil in a large frying pan and shallow-fry the patties in batches for four to five minutes, turning once, until cooked through and golden brown. Drain on kitchen paper.", "To serve, place the drained pickled cucumber in the centre of the plate and top with the patties. Garnish with coriander. "]}, {"isVegetarian": true, "title": "Fig and fudge biscuits", "url": "www_bbc_co_uk_food_recipes_fig_and_fudge_biscuits_75339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz plain flour ", "40g/1¾oz butter, softened", "1 ready-to-eat dried fig  ", "20g/1oz caster sugar", "1 tbsp chopped fudge"], "serves": "Makes 8 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 180C/350/Gas 4. Place a sheet of baking paper onto a baking tray.", "Put the flour and butter into a mixing bowl and rub the two together to make a crumbly mixture.", "Snip the stalk off the dried fig then cut the fruit into small pieces using the scissors (ask a grown-up to help you). Add to the bowl with the sugar and the fudge pieces. ", "Use your hands to start to squeeze it all together – you can push down with your knuckles into the bowl. As it starts to make a lump, turn the bowl out onto the work surface and continue squeezing to make a long, fat sausage shape. ", "Tear the mixture in half. Pull each piece into half again then each smaller piece into two, trying to keep them about the same size. This makes eight pieces of biscuit dough.", "Roll each piece into a round ball then put onto the lined tray and flatten a little with your hand – repeat with the other seven biscuits.    \t", "Ask a grown-up to put the baking tray in a preheated oven for 12-15 minutes or until the biscuits are light golden-brown. Leave to cool on the paper. Serve with some red grapes or more dried fig."]}, {"isVegetarian": true, "title": "Fig and black pepper flatbreads", "url": "www_bbc_co_uk_food_recipes_fig_and_black_pepper_74560", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "1 tsp fine salt", "1 x 7g sachet fast-action yeast", "180ml/6fl oz warm milk", "4 tbsp warm water", "1 tsp honey", "4 tbsp natural yoghurt", "2 tbsp sunflower oil, plus extra for greasing", "225g/8oz dried figs, roughly chopped", "1 tbsp cracked black pepper"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flour and salt in a bowl. Add the fast action yeast and stir well. ", "In a jug, mix together the milk, water and honey. ", "Pour the contents of the jug into the dry ingredients. Add the yoghurt and oil and bring together with your hands to form a soft dough. Turn out onto a lightly floured work surface and knead for about five minutes, or until the dough is smooth and elastic. ", "Place the dough in an oiled bowl, cover and leave to prove in a warm place for 1½ hours. After proving, knead the dough again to knock it back. ", "Push the dried figs and black pepper into the dough and knead firmly to incorporate into the dough. ", "Divide the dough into eight equal portions and roll out on a floured surface to approximately 1cm/½in thick.", "Lightly dust two baking trays with flour and arrange the flatbreads next to each other on the trays, leaving plenty of room between each one. Cover with a clean cloth and leave to prove for a further 15-20 minutes. ", "Preheat the grill to a medium setting and grill the flatbreads for about 2-3 minutes each side, or until lightly browned. Do not move away from the grill while they are cooking or you could end up with singed flat breads!"]}]