[{"isVegetarian": true, "title": "Glamorgan sausages", "url": "www_bbc_co_uk_food_recipes_glamorgansausages_67636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 leek, finely sliced", "1 garlic clove, crushed", "butter, for sweating", "140g/5oz cheddar cheese, grated", "140g/5oz fresh white breadcrumbs", "2 tbsp finely chopped parsley", "½ tsp English mustard powder", "1 egg, beaten", "oil, for frying", "salt and freshly ground black pepper"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Sweat the leeks in the butter until soft. Add the garlic and cook for another 5 minutes", "Mix all the ingredients together in a bowl. Check for seasoning. ", "Shape into balls, cover with cling film and chill for 30 minutes.", "Preheat the oil in a frying pan and cook the balls until browned and serve with a green salad"]}, {"isVegetarian": false, "title": "Glass noodle salad with crab and chicken", "url": "www_bbc_co_uk_food_recipes_glass_noodle_salad_with_39907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet glass noodles ", "200g/7oz finely minced chicken breast", "salt", "4 tsp lime juice", "100g/3½oz crabmeat", "small handful coriander, Thai basil and mint leaves", "3 limes, juice only", "2 garlic cloves, peeled but left whole", "3 Thai shallots, peeled", "2 long red chillies, seeds removed from one", "40g/1½oz palm sugar", "40ml/1½fl oz fish sauce", "20g/1oz corainader stalks", "50g/1¾oz Thai shallots, thinly sliced ", "2 garlic cloves, sliced", "2 red chillies, thinly sliced", "50g/1¾oz ground roast rice (available online and in Thai groceries)", "5 shallots (preferably Thai), sliced ", "chilli powder, to taste", "1 red chilli, seeds removed, sliced", "1 cucumber, diced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Reconstitute the noodles according to the packet instructions.", "Bring a saucepan of water to the boil, season with a little salt and cook the minced chicken for three minutes, or until cooked, breaking up with a whisk. Drain and allow to cool on a baking tray.", "For the nam jim, use a pestle and mortar to pound the lime juice, garlic, shallots, chilli, palm sugar, fish sauce and coriander roots to make a smooth sauce.", "For the crispy topping, heat the vegetable oil in a frying pan. Fry the shallots, garlic and chilli until crisp. ", "In a large dish, combine the drained chicken, fish sauce, lime juice, crabmeat, drained noodles, herbs and nam jim. Sprinkle with the ground roast rice, shallots, chilli powder, red chilli and cucumber. Finish with the crispy topping and serve immediately."]}, {"isVegetarian": false, "title": "Glazed brisket steaks with broccoli salad", "url": "www_bbc_co_uk_food_recipes_glazed_brisket_steaks_27835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2kg/4lb 8oz piece flat brisket", "2 large carrots, sliced", "2 large onions, sliced", "bunch fresh parsley stalks", "12 peppercorns", "1 bay leaf", "2 tbsp oil", "4 tbsp sweet sherry", "2 tbsp ground ginger", "3 tbsp dark soy sauce", "1 tbsp lemon juice", "1 tbsp brown sugar", "2 tbsp groundnut oil", "Tabasco, to taste", "1 tbsp wholegrain mustard", "2 tbsp sherry vinegar", "8 tbsp rapeseed oil", "500g/1lb 2oz Tenderstem broccoli, cut into florets", "2 heads Little Gem Lettuce", "sea salt "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the brisket in a large pot with the carrots and onions. ", "Tie up the parsley stalks, peppercorns and bay leaf in a muslin bag and add to the pot.", "Cover well with cold water and bring to the boil. Turn down the heat to a low simmer. The water should just be ‘trembling’.", "Cook, uncovered, for up to three hours, depending on the thickness of the meat. Top up the water as it evaporates to ensure the meat doesn't dry out. To check the meat is cooked, pierce with a roasting fork and lift, the meat should just start to slide off the fork. ", "Transfer the meat to a large container. Strain the cooking liquor and pour it over the meat, then leave to cool.", "Pour away the cooking liquor, cover the meat with cling film and then put a tray on top with weights on it to press the meat. ", "When cold, slice the brisket into nice steak-sized pieces.", "For the marinade, mix all the ingredients together.", "To grill the steaks, heat the oil in a ridged griddle pan or preheat a barbecue. Grill the steaks, brushing frequently with the marinade, until hot through.", "For the dressing, mix together all the ingredients.", "For the salad, blanch the broccoli in boiling salted water, then drain and refresh in cold water.", "Separate the outer leaves of the Little Gems, toss them in the dressing and lay them on serving plates, then repeat with the hearts. Toss the broccoli in the dressing and lay on top of the leaves. Place the meat on top and serve."]}, {"isVegetarian": false, "title": "Glazed duck, spiced quince and pancetta pinchos", "url": "www_bbc_co_uk_food_recipes_glazed_duck_spiced_80525", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 quince, peeled and cut in half", "200g/7oz caster sugar", "1 star anise", "2 cloves", "1 cinnamon stick", "1 bay leaf", "¼ orange, zest only ", "100g/3½oz membrillo (quince paste)", "8 wooden skewers, soaked in water for a few hours", "2 small duck breasts, trimmed", "60g/2¼oz smoked pancetta", "salt and pepper", "olive oil, for cooking"], "serves": "Makes 8 skewers", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place all the ingredients for the poached quince, except the membrillo, in a saucepan and add 450ml/16fl oz water. Bring slowly to the boil, then turn down to a simmer and cook for 1½-2 hours, or until the quince is cooked and has turned a deep red. Do not overcook otherwise the quince will fall from the skewers. ", "Leave the quince to cool in the poaching liquid, then remove and cut into 1.5cm cubes. Bring the poaching liquid to the boil and cook until the volume of liquid has reduced by half to a glaze. Whisk in the membrillo until dissolved.", "For the pinchos, heat a non-stick pan over a medium heat and then add the duck breasts skin-side down to render the fat and brown the skin. Pour off the fat 2-3 times as it cooks.", "Turn the breasts over and cook for 1-2 minutes before removing from the pan to cool and rest. When cool enough to handle cut the duck into 1.5cm cubes.", "Cut the pancetta into pieces the same size as the duck but half as thick. Thread a piece of duck onto each skewer followed by the pancetta and then the quince. Repeat this on each skewer.", "Heat a grill to medium; season the skewers and brush with a little oil. Grill for 2-3 minutes, turning as you go. One minute before they are ready brush with some of the quince glaze. The duck should still be pink, pancetta cooked through and there should be a sticky-glazed appearance.", "Serve the skewers along with a pot of the remaining glaze to dip into."]}, {"isVegetarian": false, "title": "Glazed ham with redcurrant and citrus jelly", "url": "www_bbc_co_uk_food_recipes_glazed_ham_with_56539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz redcurrants", "preserving sugar", "3 oranges, juice and zest", "3 lemons, juice and zest", "150ml/5fl oz red port", "50ml/2fl oz red wine vinegar", "2 cloves", "1 cinnamon stick", "pinch ground ginger", "150g/51/2oz runny honey", "100g/31/2oz demerera sugar", "leaves from 2 sprigs fresh thyme", "50ml/2fl oz redcurrant juice", "1/2 tsp English mustard", "1 cooked corner of ham"], "serves": "Makes 1 ham", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the jelly, place the redcurrants into a pan with a little water, bring to a simmer and cook until the fruit bursts. Tip into a jelly bag and strain overnight into a large bowl.", "Next day, measure the juice, place in a pan and add 450g/1lb of preserving sugar for every 600ml/20fl oz of juice. Dissolve the sugar over a high heat and boil for 5-10 minutes then remove the pan from the heat.", "Preheat the oven to 190C/375F/Gas 5. Place the orange and lemon juice and zest in a clean pan, bring to a boil then reduce the heat and add the port, wine, vinegar and spices. Simmer for 20 minutes then add 300g/10½oz of the redcurrant jelly mixture and simmer for a further 10 minutes. Remove the pan from the heat and set aside to cool.", "For the ham, mix together the honey, sugar, thyme, redcurrant juice and mustard to make the glaze. Slash the surface of the ham in a diamond pattern and rub in the glaze. Place the ham in a roasting tin and roast for 40-50 minutes, basting from time to time.", "Allow the ham to cool to room temperature then cut into slices. Serve with the jelly, chunks of bread and a celery, apple and fresh parsley salad."]}, {"isVegetarian": true, "title": "Glazed pak choi with crispy shallots", "url": "www_bbc_co_uk_food_recipes_glazedbokchoiwithcri_82542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil, plus more for deep frying", "2 pak choi, quartered", "1 garlic clove, crushed", "2 tbsp soy sauce", "2 shallots, peeled and thinly sliced", "50g/1¾oz cashew nuts, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the vegetable oil in a wok and sauté the pak choi for one minute. Add the garlic and cook for another minute. Add the soy sauce and stir well. ", "Heat the oil in a deep, heavy-bottom saucepan. It is ready when a breadcrumb sizzles gently in it. (CAUTION: hot oil can be dangerous; do not leave unattended.) Deep fry the shallots in the oil until golden. Remove with a slotted spoon and drain on kitchen paper.", "To serve, spoon the pak choi onto a plate and sprinkle over the crispy shallots and cashew nuts."]}, {"isVegetarian": false, "title": "Glazed pork cheeks with mushroom ketchup", "url": "www_bbc_co_uk_food_recipes_glazed_pork_cheeks_with_59624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 pork cheeks, trimmed", "1 onion, chopped ", "1 carrot, peeled and chopped", "1 celery stick, chopped", "1 tbsp honey ", "500ml/18fl oz chicken or veal stock ", "1 bay leaf", "2 garlic cloves", "thyme sprig", "1 star anise", "2 cloves", "1 pear, julienned, to serve", "1 slice of celeriac, julienned, to serve", "splash of olive oil, to serve", "1 lemon, juice only, to serve", "salt and freshly ground black pepper", "2 tbsp dried porcini mushrooms", "1 tbsp olive oil", "1 shallot, chopped", "1 garlic clove, chopped ", "3 field mushrooms, chopped", "6 chestnut mushrooms, chopped", "1 tsp brown sugar", "1 tsp white wine vinegar", "dash of Worcestershire sauce ", "salt and freshly ground black pepper", "100ml/3½fl oz white wine vinegar ", "100ml/3½fl oz boiling water ", "6 chestnut mushrooms, cut into quarters", "1 tsp Dijon mustard", "1 tsp chopped fresh tarragon "], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Place the cheeks in a large casserole dish and season well with salt and pepper. Place the casserole on the hob over a medium heat and cook until the cheeks are browned. Remove from the heat, add the onion, carrot, celery and honey and stir to cover the cheeks and vegetables in the honey glaze. Pour the stock into the dish and stir in the bay leaf, garlic, thyme, star anise and cloves. Simmer for 2 hours, or until the cheeks are just tender. Remove the cheeks, strain the liquor and return this liquid to the dish. Simmer and reduce the liquor down until it is a thick consistency. Set aside the cheeks and liquor.", "For the mushroom ketchup, put the ceps in a small bowl and cover with boiling water. Leave to soften then remove the ceps, reserving the water. Heat the oil in a small frying pan and sweat the shallot and garlic until soft. Add the mushrooms, ceps and its liquor and cook until soft. Season with salt and pepper and stir in the sugar, vinegar and Worcestershire sauce. Place in a blender and blitz, then set aside.", "For the pickled mushrooms, mix the vinegar and boiling water in a small bowl. Add the mushrooms to the vinegar water and leave for 2 hours to soften and pickle. Remove the mushrooms and mix with the mustard, a few spoons of the pickling liquor and tarragon. Set aside. ", "To serve, divide the glazed cheeks and ketchup between two warmed plates and spoon over some of the cheek liquor. Scatter over the pickled mushrooms. Place the pear, celeriac, oil and lemon juice in a bowl and season with salt and pepper. Spoon the pear mixture evenly over the plates and serve immediately. "]}, {"isVegetarian": true, "title": "Glazed goats' cheese and beetroot, with salad of Welsh herbs and beetroot dressing", "url": "www_bbc_co_uk_food_recipes_glazedgoatscheeseand_82161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Welsh goats' cheeses, each 120g/4oz", "olive oil", "thyme leaves", "120g/4oz sugar", "3 large beetroots, cooked, peeled and roughly chopped", "2 tsp balsamic vinegar", "salt and freshly ground black pepper ", "12 raw baby beetroots", "2 sprigs thyme", "150g/5½oz Snowdon mountain herbs, such as wood sorrel, hairy bittercress, pennywort (or other wild herbs)", "20g/1oz pine nuts, toasted, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1.", "Put the cheeses in a bowl with a little olive oil and thyme and leave to marinate while you prepare the beetroot. ", "Melt the sugar in a heavy-bottomed saucepan on a moderate heat, then cook until the sugar has turned golden brown. Add the cooked beetroot and cook for a further three minutes, stirring until the beetroot are completely coated with the caramel. Remove from the heat and add the balsamic vinegar. Transfer to a food processor and blend to a smooth consistency. ", "Pour the purée into a muslin-lined colander set in a bowl and allow the liquid to drain through. Season the liquid to taste with salt and freshly ground black pepper and double the volume with olive oil to create a dressing. Season the purée with salt and freshly ground black pepper. Set both the dressing and purée aside.", "Wrap the baby beetroots and sprigs of thyme in foil to create an envelope. Place in the oven and bake for 10-12 minutes. Peel the beetroots and leave to cool.", "Remove the cheeses from the marinade and blot off any excess oil with kitchen towel. Glaze the tops of the cheeses using a mini blow torch (or under a hot grill) until golden brown. ", "Dress the Welsh herbs in the beetroot dressing. ", "To assemble, spread a tablespoon of beetroot purée on each plate. Add the dressed herbs and place the glazed cheeses on top. Drizzle over the remainder of the beetroot dressing and sprinkle with toasted pine nuts."]}, {"isVegetarian": false, "title": "Glazed grapefruit salad with salmon and sea bream", "url": "www_bbc_co_uk_food_recipes_glazedgrapefruitsala_91224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 pink grapefruit", "3 white grapefruit", "1 tsp caster sugar", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "1 vanilla pod, split, seeds scraped out with a knife (the empty pod can be reserved for another recipe)", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "60g/2½oz red chard", "60g/2½oz mizuna leaves", "60g/2½oz rocket leaves", "1 tbsp olive oil", "200g/7oz salmon fillet, skin removed, pin bones removed, cut into 4 pieces", "250g/9oz sea bream fillet, skin on, cut into 4 pieces", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the glazed grapefruit salad, remove the skins from the pink and white grapefruits, then segment them, catching any excess juice in a bowl (reserve the juice). ", "Arrange the segments alternately in a hollow circle around the edge of four serving plates.", "Using a chefs' blow torch or a hot grill, heat the grapefruit segments until slightly coloured, then set aside.", "In a large mixing bowl, whisk together five tablespoons of the reserved grapefruit juice with the caster sugar, white wine vinegar, Dijon mustard and the vanilla seeds until well combined. (Any remaining juice will not be required for this recipe.)", "Gradually whisk in the extra virgin olive oil in a thin stream, until it is well incorporated into the salad dressing. Season, to taste, with salt and freshly ground black pepper.", "Place the salad leaves into a bowl, add a little of the salad dressing, to taste, then mix well until the leaves are coated. Divide the salad and place equally into the centre of each of the serving plates.", "For the fish, heat a griddle pan over a medium heat until hot. Rub the oil all over the salmon and sea bream fillets. Season on both sides, to taste, with salt and freshly ground black pepper. ", "Place the salmon fillet into the hot griddle pan. Fry for 60 seconds on each side.", "Add the sea bream fillet, skin-side down, and fry for 45-60 seconds on each side.", "To serve, place one piece of salmon fillet on top of each portion of salad, then place one piece of sea bream fillet on top. Drizzle over the remaining salad dressing."]}, {"isVegetarian": true, "title": "Glazed mango with a white wine sabayon", "url": "www_bbc_co_uk_food_recipes_glazedmangowithawhit_87948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range egg yolks", "55g/2oz caster sugar", "150ml/¼ pint white wine", "150ml/¼ pint double cream, whipped", "1 mango, peeled and sliced", "½ lime, zest only", "½ orange, zest only", "fresh mint sprigs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sabayon, place the egg yolks, sugar and wine into a large bowl over a pan of gently simmering water. Whisk with an electric whisk for 15 minutes, or until the mixture is thick. Remove from the heat and continue to whisk until cooled slightly.", "Fold the sabayon into the whipped cream in a large bowl.", "To serve, fan the mango slices out on a serving plate and pour over the sabayon. Use a mini-blowtorch to glaze the top and garnish with lime and orange zest and mint sprigs."]}, {"isVegetarian": true, "title": "Ginger wine and whisky fruit cake", "url": "www_bbc_co_uk_food_recipes_glendale_ginger_wine_and_17310", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz raisins", "150g/5½oz currants", "150g/5½oz sultanas", "200ml/7fl oz ginger 'wine' (preferably a non-alcoholic version, such as Glendale)", "50ml/2fl oz whisky, plus extra for feeding the cake", "200g/7oz butter, plus extra for greasing", "200g/7oz dark brown sugar", "4 free-range eggs", "50g/1¾oz ground almonds", "200g/7oz plain flour", "1 tbsp finely chopped stem ginger", "1 tsp mixed spice", "2 tsp ground ginger"], "serves": "Makes 1 x 20cm/8in cake", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the raisins, currants and sultanas in the ginger wine and whisky in a bowl overnight, or preferably for two days.", "Preheat the oven to 160C/325F/Gas 3. Grease and line a 20cm/8in cake tin with butter and greaseproof paper.", "Beat the butter until pale and fluffy. Add the sugar and mix thoroughly.", "Add an egg and the ground almonds and some of the flour, then alternate adding the remaining eggs and flour until all incorporated.", "Stir in the soaked fruits and extra liquid along with the stem ginger mixed spice and ground ginger. Mix well.", "Spoon the mixture into the prepared tin and bake for approximately one hour 30 minutes, or until a wooden skewer comes out clean. (Check the cake after an hour - you may want to cover the tin with foil to prevent the cake from colouring too much.)", "Once the cake has cooled, prick the cake all over with a skewer and feed the cake with a little whisky. The cake can be served immediately, but for an extra rich, moist cake repeat the feeding at least twice over a two-week period. ", "Wrap the cake in baking parchment or cling film and store in a dark dry place until, ready to serve. The cake will keep for at least six months."]}, {"isVegetarian": false, "title": "Glazed pot roast shoulder of lamb with kasha", "url": "www_bbc_co_uk_food_recipes_glazedpotroastshould_86163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium onions, peeled and cut into thick slices", "1 large stalk celery, trimmed and cut into large chunks", "1 large carrot, peeled, trimmed and cut into large chunks", "1 large head garlic, cut in half", "1 sprig fresh rosemary", "1 x 1.5kg/3lb 5oz shoulder of lamb, boned, trimmed of excess fat, rolled and tied", "6 canned anchovy fillets in olive oil, halved", "250ml/9fl oz dry white wine", "300ml/½ pint chicken stock", "salt and freshly ground black pepper ", "150ml/5fl oz double cream", "1 lemon, juice only", "1 tbsp tomato ketchup", "1 tbsp tomato purée", "1 tbsp clear honey", "1 tbsp dark soy sauce", "1 tbsp malt vinegar", "1 tbsp Worcestershire sauce", "1 tbsp syrup from a jar of preserved ginger", "250g/9oz bulgar wheat", "450ml/16fl oz hot chicken stock", "salt and freshly ground black pepper ", "90g/3½oz unsalted butter", "green salad"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, preheat the oven to 160C/320F/Gas 2.", "Place all the vegetables and the rosemary in a deep lidded casserole.  ", "With the point of a sharp knife, make twelve incisions in the lamb shoulder.", "Push the anchovies into the incisions in the lamb.  ", "Place the joint on top of the vegetables in the pan, pour over the olive oil from the canned anchovy fillets and rub in well.  ", "Season with freshly ground black pepper.", "Pour the wine and chicken stock around the lamb.", "Cover the pan with a tightly fitting lid.", "Place on a medium heat on the stovetop and bring to the boil. Transfer to the oven and cook for about 1¾ hours, or until the meat is tender and cooked through.", "When the meat is cooked, remove from the oven and carefully lift the meat out of the pan onto a shallow roasting tray.  ", "Increase the oven temperature to 225C/440F/Gas 8.", "For the glaze, place all the glaze ingredients into a bowl and mix well.", "Brush the glaze over the joint. Place the joint into the oven and cook for 12-15 minutes, or until the glaze has become sticky and browned - reduce the heat if the meat is colouring too quickly.", "Remove the meat from the oven and set aside to rest for 10-15 minutes, keeping warm.", "Meanwhile, pour the initial cooking juices through a sieve into a clean pan. Using a spoon, skim any fat which will have risen to the surface and discard. Boil rapidly to reduce the liquid by half.", "When the cooking juices have reduced, remove from the heat and add the cream and a squeeze of lemon juice. Check the seasoning, adding salt and freshly ground black pepper to taste. Keep warm.", "For the kasha, set the oven temperature back to 200C/400F/Gas 6. ", "Heat a large lidded ovenproof pan over a medium heat, then add the bulgur wheat and toast for a few minutes, stirring occasionally, to avoid burning.", "Pour the stock into the pan with the bulgar wheat, season with salt and black pepper and add one-third of the butter.", "Cover with a lid, place in the oven and cook for 15-20 minutes, until the stock is all absorbed and the bulgar wheat is tender.", "Remove the kasha from the oven and fork through the remaining butter.", "To serve, remove the string from the joint and cut into thick slices. Spoon the kasha onto the centre of each plate and top with a couple of slices of lamb. Spoon the cream sauce over the top and serve with a handful of green salad."]}, {"isVegetarian": true, "title": "Glögg", "url": "www_bbc_co_uk_food_recipes_glgg_99266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bottle of red wine", "100g/3½oz demerara sugar", "1 tbsp honey", "1 vanilla pod, seeds scraped out", "2 cinnamon sticks", "1 tsp cloves", "raisins", "crushed hazelnuts"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all ingredients (except the raisins and hazelnuts) in a pan and warm up very slowly, never allowing it to boil. ", "Place two tablespoons each of raisins and hazelnuts into each glass and ladle in the glögg."]}, {"isVegetarian": true, "title": "Globe artichoke with Dijon mustard", "url": "www_bbc_co_uk_food_recipes_globeartichokewithdi_83912", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium globe artichoke ", "½ lemon", "2 tbsp red wine vinegar", "1 heaped tbsp Dijon mustard", "salt and freshly ground black pepper", "5 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut off the stalk of the artichoke and remove any hard outer leaves. Rub with half a lemon.", "Squeeze the remaining lemon juice into a pan of rapidly boiling, salted water. Plunge the artichoke into the water and boil uncovered for 25 to 30 minutes, until the outer leaves are easily detached. Drain well. ", "Turn the artichoke upside down and squeeze out the water.", "While you are cooking the artichoke, make the vinaigrette. Combine the vinegar and mustard in a small lidded-jar and season to taste.", "Pour in the olive oil, before screwing on the lid and shaking vigorously to make a thick dressing. Taste, adding more mustard, vinegar and seasoning if necessary. The dressing will keep in the fridge for several days", "Remove the artichoke chokes carefully using a spoon, and serve straight away with the vinaigrette, before they discolour."]}, {"isVegetarian": false, "title": "Gloucestershire hotpot", "url": "www_bbc_co_uk_food_recipes_gloucestershire_hotpot_93488", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5 litres/2½pints vegetable stock", "500g/1lb 2oz pork bones", "2 tbsp sea salt flakes", "2 tbsp black peppercorns", "1 tbsp juniper berries", "100g/3½oz plain flour", "1.5kg/3lb 5oz cubed pork", "5 tbsp olive oil", "4 medium onions, roughly chopped", "2 large Bramley apples, sliced into 1cm/½in discs", "2 turnips, sliced into 1cm/½in discs", "60g/2¼oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.", "Bring a large pan of stock to the boil, add the pork bones and allow to bubble for 45 minutes on a very low heat.", "Using a mortar and pestle, crush the salt, pepper and juniper berries together. Mix them with the flour in a large mixing bowl.", "Heat the olive oil in a large casserole and brown the pork in batches, transferring the meat each time to the bowl with the seasoned flour. Mix the meat well.", "Fry the onions in the same casserole until softened and translucent. Shake off any excess flour from the pork and return to the casserole. Fry for three minutes to cook the flour through.", "Ladle the stock (without the bones) over the casserole and stir well, ensuring that there are no lumps of flour. ", "Take the sliced discs of apple and turnip and layer them over the casserole alternating between the two. Scatter little knobs of the butter over the top. Place the lid over the casserole or cover with foil. Bake for two hours, removing the lid or foil, for the last 30 minutes.", "Serve in deep bowls with crusty bread."]}, {"isVegetarian": false, "title": "Lamb pie", "url": "www_bbc_co_uk_food_recipes_gloucestershiresquab_92233", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp plain flour", "½ tsp flaked sea salt, plus extra, to taste", "freshly ground black pepper, to taste", "1kg/2lb 2oz lamb neck fillet (preferably Gloucestershire) excess fat trimmed, cut into bite-sized pieces", "2-3 tbsp rapeseed oil", "2 onions, peeled, halved and sliced", "½ tsp freshly grated nutmeg", "¼ tsp ground allspice", "1 sprig fresh rosemary, leaves only, finely chopped ", "500ml/17½fl oz fresh chicken or lamb stock", "300ml/10½fl oz cold water", "1 Bramley apple, peeled, quartered, core removed, sliced", "2 crisp eating apples, such as Cox, peeled, quartered, core removed, sliced", "4-5 large fresh sage leaves, finely sliced", "300g/10½oz plain flour, plus extra for dusting", "good pinch salt", "75g/2½oz cold lard, cut into small pieces", "75g/2½oz cold butter, cut into small pieces", "1 free-range egg ", "1 tbsp cold water", "mashed potatoes", "seasonal vegetables"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the filling, place the flour, sea salt and a good grinding of black pepper into a large bowl and mix well. Add the lamb pieces and toss well together until the meat is lightly coated with the seasoned flour.", "Heat the rapeseed oil in a large frying pan and fry the lamb pieces for 3-4 minutes, in small batches, until golden-brown all over. Transfer the seared lamb meat to a large, heavy-based pan or flame-proof casserole and set aside. ", "Return the frying pan to the heat, adding more oil if necessary, then fry the onions for 5-6 minutes, or until golden-brown. Add the onions to the casserole with the lamb. ", "Add the nutmeg, allspice and rosemary to the casserole, then pour over the stock and the water. Bring to the boil, then reduce the heat and leave to simmer for 40 minutes, or until the lamb is just tender and the liquid has reduced to a the consistency of gravy. Season, to taste, with salt and freshly ground black pepper, then remove the pan from the heat, cover and leave to cool for 30 minutes.", "Mix the apples together with the chopped sage and season with freshly ground black pepper. Set aside. ", "Meanwhile, for the pastry, sift the flour and salt into a bowl and rub in the lard and butter with your fingertips until the mixture resembles breadcrumbs. ", "Lightly whisk the egg together with the water, then place two tablespoons of the mixture into a separate bowl to use as a glaze for the pastry. ", "Make a well in the centre of the flour, lard and butter mixture and add the egg. Stir with a wooden spoon until the mixture comes together to form a dough, then shape into a ball. Lightly flour the work surface and knead the dough lightly, then flatten slightly into a round and wrap in cling film. Chill in the fridge for 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6. ", "For the pie, spoon half of the lamb mixture into a 2.2 litre pie dish. Top with half the apples and cover with the remaining lamb mixture. Finish with a final layer of apples, piling them up above the edge of the dish. Ease a pie funnel into the centre of the pie to help support the pastry and set aside.", "Unwrap the pastry and roll out into a large oval shape roughly 5cm/2in larger than the pie dish. Cut a 2cm/1in wide ring of pastry from around the edge of this oval. ", "Brush the rim of the pie dish with the reserved egg and water mixture. Press the pastry ring onto the rim of the pie dish, overlapping slightly at the end join. Brush lightly with a little more egg and then cover the pie completely with the rolled pastry, making a small hole for the top of the pie funnel.", "Press the edges firmly to seal, then trim the pastry and flute all the way around. Brush the pastry with the remaining egg mixture and place the pie dish on a baking tray. Bake the pie in the centre of the oven for 25 minutes, or until the pastry is golden-brown and crisp.", "Serve the pie piping hot with creamy mashed potatoes and seasonal vegetables."]}, {"isVegetarian": true, "title": "Gluhwein", "url": "www_bbc_co_uk_food_recipes_gluhwein_2495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre bottle cheap red wine", "30z/75g sugar (to taste)", "1 tsp whole cloves", "1 tsp ground cinnamon or stick cinnamon", "juice of 1 orange and 1 lemon"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour wine into a saucepan and add remaining ingredients (you can put whole spices in muslin). ", "Heat until nearly boiling and strain (if necessary) into a warm bowl.", "Serve warm."]}, {"isVegetarian": true, "title": "Gluten-free apple and almond cake", "url": "www_bbc_co_uk_food_recipes_gluten-free_apple_and_22345", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_apple_and_22345_16x9.jpg", "ingredients": ["3 sharp eating apples, peeled, cored and chopped", "1 lemon, juice only", "300g/10½g golden caster sugar", "8 free-range eggs", "325g/11½oz ground almonds", "½ tsp almond essence", "50g/2oz flaked almonds", "icing sugar, for sprinkling"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/375F/Gas 4.  Lightly grease and line the base of a 25cm/10in springform tin with a little oil. ", "Place the apples into a pan with half the lemon juice and two tablespoons of the  caster sugar. Bring to a simmer, cover and cook on a low heat for about 7-9 minutes or until the apples are soft enough to roughly mash with a fork. Do not over-mash, though. You still want a little bite and texture. Leave to cool.", "Put the cooled purée, eggs, ground almonds, almond essence, remaining caster sugar and approximately one tablespoon of the remaining lemon juice into a food processor and blend together.  Pour into the prepared cake tin and sprinkle with the flaked almonds.  ", "Bake for about 40 minutes or until a skewer inserted into the cake comes out clean.  Check the cake after about 30 minutes, and if the cake is getting too brown cover the top with parchment paper or foil.", "Leave to cool slightly before you remove the cake from the tin. This is delicious served warm or cold with a generous sprinkling of icing sugar."]}, {"isVegetarian": true, "title": "Gluten-free Venetian carrot cake", "url": "www_bbc_co_uk_food_recipes_gluten-free_and_11807", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_and_11807_16x9.jpg", "ingredients": ["3 tbsp pine nuts", "2 medium carrots (approx. 200-250g/7-9oz)", "75g/3oz golden sultanas", "60ml/2¼fl oz rum", "150g/5oz caster sugar", "125ml/4½fl oz regular olive oil, plus extra for greasing", "1 tsp vanilla extract", "3 free-range eggs", "250g/9oz ground almonds", "½ tsp ground nutmeg, or to taste", "½ lemon, finely grated zest and juice", "250g/9oz mascarpone", "2 tsp icing sugar", "2 tbsp rum"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the carrot cake, preheat the oven to 180C/350F/Gas 4. Line the base of a 23cm/9in round springform cake tin with re-usable non-stick silicone liner or baking parchment and grease the sides with olive oil.", "Toast the pine nuts by browning in a dry frying pan; the oven alone is not enough to scorch out the paleness. Set aside.", "Grate the carrots in a processor (for ease) or with a coarse grater, then sit them on a double layer of kitchen paper and wrap them, to soak up excess liquid. Set aside.", "Put the golden sultanas in a small saucepan with the rum, bring to the boil, then turn down and simmer for 3 minutes.", "Whisk the sugar and oil until creamily and airily mixed.", "Whisk in the vanilla extract and eggs and, when well whisked, fold in the ground almonds, nutmeg, grated carrots, golden sultanas (with any rum that clings to them) and, finally, the lemon zest and juice.", "Scrape the mixture into the prepared cake tin and smooth the surface with a rubber spatula. The batter will be very shallow in the tin.", "Sprinkle the toasted pine nuts over the cake and put it into the oven for 30–40 minutes, or until the top is risen and golden and a skewer inserted into the centre comes out sticky but more or less clean.", "Remove from the oven and let the cake sit in its tin on a wire rack for 10 minutes, then unspring and leave it on the rack to cool.", "For the mascarpone cream, mix the mascarpone with the icing sugar and rum. ", "To serve, transfer the cake to a plate. Put the mascarpone cream in a bowl to spoon alongside the cake, for those who want."]}, {"isVegetarian": false, "title": "Gluten-free fish and chips with minty peas", "url": "www_bbc_co_uk_food_recipes_gluten-free_fish_and_75524", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_fish_and_75524_16x9.jpg", "ingredients": ["2 large/3 medium King Edward potatoes, scrubbed", "4 tbsp rapeseed oil", "130g/4½oz gluten-free flour ", "155-175ml/5-6fl oz chilled sparkling water", "4 x 175g/6oz boneless skinless haddock fillet", "320g/11oz frozen peas", "1 tbsp roughly chopped mint leaves ", "50g/1¾oz half-fat crème fraîche", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Line a large baking tray with greaseproof paper.", "Cut the potatoes into 1cm/½in thick slices, then into 1cm/½in wide sticks.", "Place in a saucepan and pour on enough cold water to just cover. Bring to the boil and simmer for 5 minutes until just tender but still firm. (This means the finished chips will be cooked through and slightly fluffy in the middle, but crispy on the outside.)", "Drain carefully and tip out onto kitchen roll or a tea towel and pat dry.", "Pour 4 teaspoons of the oil onto a large roasting tray, season with salt and pepper then add the potatoes and toss gently until they are fully coated.", "Roast for 15-20 minutes until golden-brown, crisp and cooked through.", "While the chips cook, prepare the fish. Tip the flour into a bowl and season with salt and pepper. Add the water gradually, stirring all the time – you want a thick batter, about the consistency of double cream. Once it comes together, don’t keep mixing it – you want it to be lovely and light.", "Dip the fish into the batter, coating both sides, making sure that the fish is totally coated. ", "Heat a large frying pan until hot, add the remaining rapeseed oil and when it is very hot, add the fish, laying it down away from you so the oil doesn’t spray up at you. Cook on one side until the batter has just puffed up and turned light golden-brown then flip over and cook on the other side. You will need to cook for 2-3 minutes on each side then lift the fish out onto parchment paper to drain – not kitchen roll as it will stick!", "Bring a small pan of water to the boil, add the peas and simmer for 2-3 minutes until hot through. Drain and return to the saucepan with the chopped mint, then, using a potato masher, mash the peas gently a little until they burst.", "Stir in the crème fraîche and season with salt and pepper.", "Drain both the chips and fish onto kitchen paper to remove any excess oil then serve straightway with the minted peas alongside."]}, {"isVegetarian": false, "title": "Gluten-free blackberry and ginger cheesecake", "url": "www_bbc_co_uk_food_recipes_gluten-free_blackberry_52734", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_blackberry_52734_16x9.jpg", "ingredients": ["150g/5½oz gluten-free ginger biscuits, finely crushed", "30g/1oz unsalted butter, melted", "400g/14oz soft curd cheese ", "100g/3½oz quark", "2 large free-range eggs", "4 tbsp green ginger wine ", "4 tbsp maple syrup", "4 pieces preserved stem ginger, finely chopped", "300g/10½oz fresh blackberries (or frozen, defrosted)", "30g/1oz caster sugar", "1 tsp vanilla extract or vanilla bean paste", "9 blackberries ", "9 gluten-free gingerbread biscuits, cut into house shapes", "icing sugar, for dusting"], "serves": "Serves 9", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cheesecake bases, mix the crushed biscuits with the melted butter. Press this firmly into a 20cm/8in square baking tin and pop it into the freezer while you make the filling.", "To make the filling, whisk the curd cheese, quark, eggs, green ginger wine and maple syrup together until smooth and light. ", "Remove the biscuit base from the freezer and sprinkle over the chopped stem ginger. Pour the filling on top and bake for 35-40 minutes until just set. Leave to cool in the tin and then chill until you’re ready to assemble.", "Make a blackberry coulis by putting the blackberries, sugar and 5 tablespoons water in a small pan. Bring to the boil, then simmer for 5 minutes. Stir in the vanilla, blend with a stick blender and strain through a sieve. Leave to cool then chill until needed.", "To serve, cut the cheesecake into 9 squares. Lift carefully out of the tin onto a serving plate. Press a biscuit house upright against each cheesecake slice firmly. Place a blackberry on top of the cheesecake and dust with icing sugar. Serve with the blackberry coulis."]}, {"isVegetarian": true, "title": "Gluten-free bread", "url": "www_bbc_co_uk_food_recipes_gluten-free_olive_oil_42050", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_olive_oil_42050_16x9.jpg", "ingredients": ["25g-50g/1oz-1¾oz golden linseeds", "475ml/17fl oz warm water", "1 sachet fast-action yeast (about 2½ tsp)", "100ml/3½fl oz natural yoghurt", "450g/1lb cornflour", "1 tsp salt", "1 tsp caster sugar", "50g/1¾oz psyllium husk powder", "50ml/1¾oz olive oil", "extra olive oil and cornflour, to finish"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/gas 4 and bake the linseeds on a tray for 10-12 minutes, or until they darken slightly (toasting will burst the husks slightly and allow the seeds to release a sticky gluten-like gum when wet, making the crumb softer and adding a wheatgerm-like flavour).", "In a bowl, mix the water and yeast and then stir in the yoghurt and seeds. In a large mixing bowl toss together the cornflour, salt, sugar and psyllium husk powder. Pour in the yeast mixture and olive oil and mix well to make a smooth thin batter.", "Over the next five minutes this liquid will turn into a sticky dough, as the linseed, cornflour and psyllium husk powder together absorb liquid and become gel-like. Once the mixture is firm enough, knead it for 10 seconds on the worktop to mix everything again, then return the dough to the bowl, cover and leave for 30 minutes.", "Line a tray with non-stick baking paper. Shape the dough into a fat sausage, the length of the tray, then brush with extra olive oil, cover and leave to rise for 30 minutes.", "Heat the oven to 240C/465F/Gas 9, uncover the dough and slash the top with a small sharp knife, sprinkle with a little cornflour to give it a floured look and bake for about 40 minutes, or until rich golden-brown in colour. Leave to cool on a wire rack before slicing."]}, {"isVegetarian": true, "title": "Gluten-free passion fruit and coconut cake", "url": "www_bbc_co_uk_food_recipes_gluten-free_passion_23138", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_passion_23138_16x9.jpg", "ingredients": ["350g/12oz unsalted butter, softened", "350g/12oz caster sugar", "4 passion fruit, pulp and seeds scooped out ", "250g/9oz rice flour ", "2 tsp xanthan gum, available in many large supermarkets or online", "4 tsp gluten-free baking powder", "6 large free-range eggs", "100g/3½oz desiccated coconut", "150g/5½oz unsalted butter, softened", "200g/7oz icing sugar", "2 unwaxed limes, zest only, grated", "2 tbsp coconut cream", "2 tsp white coconut-flavoured rum (optional)", "2 passion fruit, pulp and seeds scraped out", "2 limes, juice only", "100g/3½oz caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C (fan)/Gas 4. Lightly butter 2 x 20cm/8in springform cake tins and line with baking parchment.", "Using an electric hand-held whisk, cream the butter, sugar and passion fruit in a large mixing bowl.", "In a separate bowl, sift together the rice flour, xanthan gum and baking powder.", "Add a spoonful of the flour mixture and one egg to the butter and sugar mixture, beating in thoroughly. Add the rest of the eggs, one by one, adding a spoonful of the flour mixture each time. Fold in the rest of the flour, and then fold in the desiccated coconut.", "Divide the mixture equally between the two tins and bake for 40-45 minutes, or until the top is golden-brown and a wooden skewer inserted into the centre of the cake comes out clean.", "While the cakes are in the oven, make the buttercream by creaming together the butter, icing sugar and lime zest in a bowl until light and fluffy.", "Add the coconut cream and coconut rum (if using) and beat until thoroughly combined. Set aside.", "Shortly before the cakes are ready, make the syrup. Combine the passion fruit juice with the lime juice, then add the sugar, stirring to dissolve. ( You may need to heat in a small pan or give it a blast in the microwave in a heatproof jug.) Strain the syrup but reserve the passion fruit seeds.", "When the cakes are baked, remove from the oven and prick them all over with a wooden skewer. Pour over the strained syrup and leave to cool in the tins.", "When the cakes are cool, turn out one of the layers onto the serving plate and spread or pipe over the coconut buttercream. Place the other cake layer on top.", "Scatter the passion fruit seeds in the middle of the cake, and cut into slices to serve."]}, {"isVegetarian": true, "title": "Gluten-free pitta bread", "url": "www_bbc_co_uk_food_recipes_gluten-free_pitta_bread_09625", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_pitta_bread_09625_16x9.jpg", "ingredients": ["30g/1oz psyllium powder (available from whole food shops or specialist stores online)", "750g/1lb 10oz gluten-free strong bread flour blend (such as Doves Farm), plus extra for flouring", "3 tbsp nigella seeds", "15g/½oz sugar", "1 tbsp salt", "21g/¾oz instant yeast", "3 large free-range eggs", "1 tbsp white wine vinegar", "6 tbsp olive oil"], "serves": "Makes 12 pittas", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the psyllium powder with 300ml/10fl oz water. Set aside to allow the mixture to thicken.", "Tip the flour and nigella seeds into a mixing bowl. Add the sugar and salt to one side of the bowl and the yeast to the other. Crack the eggs into the centre of the flour, add the vinegar, olive oil and the psyllium mixture. Combine the ingredients to form a soft dough. Gradually add about 300ml/10fl oz water - you may not need it all, although the dough should be soft and slightly sticky.", "Place onto a floured surface and knead to form a smooth dough. Place back in the bowl, cover and leave to rest for 1½ hours, or until doubled in size.", "Heat the oven to 220C/200C Fan/Gas 9 and place 3 heavy baking trays in the oven to heat up.", "Dust your work surface with flour. Divide the dough into 12 equal pieces and shape each one into a ball. Roll or press the pieces into oval shapes about 4mm thick. ", "Remove the baking tray from the oven and dust with a little flour. Lay four pittas on each tray and bake for 10-12 minutes, or until puffed up and cooked through. The pittas should have a slight colour to them. Remove from the oven and wrap in a clean tea towel - this helps keeps them soft."]}, {"isVegetarian": true, "title": "Swiss chard gnocchi", "url": "www_bbc_co_uk_food_recipes_gnocchi_82901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2¼lb potatoes, unpeeled", "olive oil, for frying", "1 onion, finely chopped", "100g/3½oz Swiss chard, boiled, squeezed of water and chopped", "1 free-range egg", "300g/10½oz '00' flour, plus extra for dusting", "1 tsp salt"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Boil the potatoes, with their skins on, until tender. ", "Heat the olive oil in a frying pan and fry the onion until golden.", "Peel the potatoes while they are still hot, then pass the potatoes, onion and Swiss chard through a food mill or ricer. Place the mixture in a bowl.", "Stir in the egg and flour to form a soft, pliable dough.", "Divide the dough into pieces the size of a small fist and roll them out into lengths about 2cm/¾in thick. Cut the lengths into 2cm/¾in long pieces. The gnocchi can be frozen at this stage; spread them out on a well-floured tray and put them in the freezer. When frozen, shake off any excess flour and put them in a bag. Use within 3 months. ", "To cook, boil the gnocchi in salted water for about two minutes (allowing 1-2 minutes extra cooking time if cooking from frozen). When they're cooked they will bob up to the surface. ", "Drain well and serve immediately with the sauce of your choice."]}]