[{"ingredients": ["24 langostinos", "250ml / 9fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "110g / 4oz de mantequilla", "1 limón, solo jugo", "sal y pimienta negra recién molida", "2 cabezas de lechuga Little Gem, hojas separadas", "110g / 4oz hojas de ensalada surtidas", "4 cucharadas de hierbas frescas mezcladas picadas (cebolletas, perifollo, perejil de flatleaf)", "1 cucharada de vinagre de vino tinto", "3 cucharadas de aceite de oliva virgen extra"], "method": ["Ponga a hervir una olla grande de agua con sal, luego agregue las langostinas y cocine por un minuto. Escurra los langostinos y déjelos a un lado para que se enfríen un poco antes de quitar la carne de la cola. (Reserve las cáscaras para otra receta, como para hacer inventario).", "Coloque el caldo de pollo en una sartén y llévelo a ebullición. Cocine durante 6-8 minutos a fuego alto, o hasta que el caldo se haya reducido a la mitad. Agregue la crema y cocine durante 6-8 minutos más, o hasta que el líquido se reduzca en volumen a la mitad otra vez.", "Agregue dos tercios de la mantequilla un poco a la vez, hasta que la mantequilla se incorpore a la salsa, luego mezcle el zumo de limón y sazone al gusto con sal y pimienta negra recién molida. Mantener caliente", "Derrita la mantequilla restante en una sartén hasta que haga espuma, luego agregue la carne de la cola de langostino y fría por 2-3 minutos, o hasta que se dore bien y caliente hasta el final. Sáquelo del fuego y apártelo.", "En un tazón grande, mezcle las hojas de lechuga Little Gem, hojas de ensalada y hierbas. Mezcle el vinagre de vino tinto y el aceite de oliva en un tazón hasta que estén bien combinados, luego rocíe sobre la ensalada y las hierbas y mezcle ligeramente para cubrir uniformemente.", "Para servir, divida la ensalada entre cuatro platos para servir, luego coloque los langostinos al costado y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_langoustineswithlitt_91763", "title": "Langoustines con ensalada Little Gem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de semilla de uva, más extra para engrasar", "3 huevos grandes de gallinas camperas, separados", "180g / 6¼ oz de azúcar", "1 cucharada de licor de frambuesa", "colorante de comida de gel rojo", "Harina normal 175g / 6oz", "½ cucharadita de bicarbonato de soda", "50 g / 1¾oz de frambuesas liofilizadas, trituradas", "3 huevos grandes de gallinas camperas", "225g / 8oz de azúcar en polvo de oro", "Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "225 g / 8oz de mantequilla sin sal, ablandada", "pizca de sal", "1 naranja, solo ralladura", "algunas gotas de extracto de naranja", "85g / 3oz de almendras molidas", "color de comida de gel de naranja", "3 huevos grandes de gallinas camperas", "225g / 8oz de azúcar en polvo de oro", "Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "225 g / 8oz de mantequilla sin sal, ablandada", "pizca de sal", "85 g / 3 oz de pistachos, conchas eliminadas, molidas", "20 g / 1 oz de pistachos nibbed", "algunas gotas de extracto de almendra", "1 naranja, solo jugo", "1 cucharada de azúcar glas", "5 cucharadas de mermelada lisa", "175g / 6oz de mantequilla sin sal, derretida, más extra para engrasar", "2 huevos grandes de gallinas camperas", "175g / 6 oz de azúcar", "Harina de 175g / 6oz de auto crianza", "pizca de sal", "1 limón, cáscara y jugo sin cera", "185g / 6½oz de mantequilla sin sal", "250 g / 9 oz de chocolate negro", "375g / 13oz de azúcar en polvo de oro", "pizca de sal", "3 huevos grandes de gallinas camperas", "1 cucharadita de gránulos de café instantáneo", "Harina self-raising de 220g / 8oz", "40 g / 1½ oz de cacao en polvo", "50g / 1¾oz de frambuesas frescas", "400g / 14oz de mantequilla sin sal", "800g / 1lb 12oz de azúcar glas", "1-2 cucharadas de leche", "300g / 10½ oz mini malvaviscos", "600g / 1lb 5oz de azúcar glasé, más extra para quitar el polvo", "1kg / 2lb 4oz de glaseado de fondant blanco listo para enrollar", "pintura de comida de plata", "color de la comida del gel del trullo", "300g / 10½oz de pasta de azúcar blanca, para modelar", "Mazapán de 400g / 14oz", "50ml / 2fl oz de flor de saúco cordial", "50g / 1¾oz semillas de amapola", "algunas gotas de extracto de limón", "125g / 4½oz de azúcar glas real", "bolas de plata comestibles"], "method": ["Para la tarta de frambuesa, precaliente el horno a 160 ° C / 325 ° F / Gas 3 y engrase 12 moldes para tarta.", "En un tazón, combine el aceite, las yemas de huevo, el azúcar y 100 ml / 3½ fl oz de agua. Agregue el licor y el colorante alimenticio de gel rojo. Tamizar la harina y el bicarbonato de soda.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Dobla las claras de huevo y las frambuesas liofilizadas en la mezcla de tortas.", "Llene los moldes para pasteles y hornee durante aproximadamente 10 minutos, o hasta que un pincho insertado en un pop cake salga limpio. Dejar de lado para enfriar.", "Para hacer las tortas de naranja y pistacho, engrase y alinee dos moldes para pasteles con forma de resorte de 18cm / 7in y precaliente el horno a 160C / 325F / Gas 3.", "Para la torta de naranja, divide los huevos en un tazón grande para mezclar, luego agrega el azúcar, la harina, el polvo de hornear y la mantequilla. Mezcle para combinar, luego agregue los ingredientes restantes y vuelva a mezclar hasta que estén bien combinados (la manera más fácil de hacerlo es con un mezclador de manos eléctrico, pero una cuchara de madera es suficiente). Vierta la mezcla en una de las latas de torta preparadas y déjela a un lado mientras prepara la torta de pistacho.", "Para la torta de pistacho, rompa los huevos en un tazón grande para mezclar, luego agregue el azúcar, la harina, el polvo de hornear y la mantequilla. Mezcle para combinar, luego el resto de los ingredientes y vuelva a mezclar hasta que estén bien combinados. Vierta la mezcla en el molde para pastel restante de 18cm / 7 pulgadas.", "Hornee las dos tortas por 30 minutos, o hasta que estén livianas y elásticas al tacto. Cuando esté cocido, quite los pasteles del horno y colóquelos en una rejilla para que se enfríen por completo.", "Cuando las tortas de naranja y pistacho estén completamente frías, aplana las partes superiores (no te preocupes por despegar demasiado, ya que las tortas se unirán para formar un solo nivel de la última tarta). Usando el cortador de 12cm / 5in, corte una ronda desde el centro de cada torta de 18cm / 7 pulgadas. Luego, usando el cortador de 6cm / 2½ pulgadas, corte 6cm / 2½ pulgadas en el centro de los pasteles de 12cm / 5 pulgadas. Cambia los círculos y vuelve a armar los pasteles para que termines con dos tortas de 18cm / 7 pulgadas que parecen objetivos.", "Para el jarabe de naranja, caliente el jugo de naranja y el azúcar glas en una sartén pequeña para hacer un jarabe. Cepille los pasteles de naranja y pistacho con el jarabe de naranja. Caliente la mermelada y cepille sobre los pasteles para glasear. Apila los pasteles uno encima del otro.", "Para la tarta de limón, amapola y sauco, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase y forme dos latas de rollo suizo.", "Batir los huevos y el azúcar en un tazón grande con un batidor eléctrico hasta que la mezcla tenga un color amarillo muy pálido, espumoso y parecido a un mousse. Agregue la mantequilla derretida. Doble la harina, la sal, la ralladura de limón y el jugo. Divida la mezcla entre las latas de rollo suizo preparadas y hornee durante aproximadamente 12 minutos. Poner aparte para enfriar, luego usar un anillo de mousse de 15cm / 6in cortar tres círculos de pastel.", "Para la torta de chocolate, precaliente el horno a 160 ° C / 325 ° F / Gas 3 y engrase y forme una lata de torta con forma de resorte de 23 cm / 9 pulg.", "Derrita la mantequilla y el chocolate en un microondas o en un recipiente resistente al calor suspendido sobre una fuente de agua hirviendo a fuego lento. Una vez derretido verter en un tazón grande y agregar el azúcar, la sal, los huevos, el café y 250 ml / 9 fl oz de agua.", "Tamizar la harina y el cacao en polvo. Mezcle para combinar.", "Vierta una capa de la mezcla de torta en el fondo de la lata de torta preparada, luego agregue los cake pops cocidos y las frambuesas frescas. Rellene con la masa de pastel de chocolate restante. Hornee durante 90 minutos y luego déjelos enfriar por completo.", "Mientras tanto, haz la crema de mantequilla. Batir la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave. Agregue el azúcar glas restante y una cucharada de leche y bata la mezcla hasta que quede cremosa y suave. Agregue la leche restante, si es necesario, para aflojar la mezcla.", "Para decorar los pasteles, haga un glaseado de fondant de malvavisco derritiendo los mini malvaviscos durante aproximadamente 30 segundos en un microondas. Mezcle el azúcar glas y amasar hasta que tenga una pasta suave (tenga cuidado - los malvaviscos estarán calientes). Dejar de lado para enfriar por completo.", "Coloque el pastel de chocolate enfriado en el tablero de pastel de 23 cm / 9 pulgadas. Cubra el pastel con una capa migaja de crema de mantequilla. Aplique un poco de polvo a la superficie de trabajo con azúcar glasé y extienda la mitad del glaseado de fondant listo para rodar al grosor de una moneda de una libra. Haga un patrón en el fondant presionando una de las alfombras de impresión en la formación de hielo. Coloque el fondant sobre el pastel, con la estera todavía unida para que el patrón no se estire. Retire la estera y presione suavemente el glaseado en los bordes de la torta. Cepille el glaseado suave con pintura de alimentos de plata para un efecto de relieve.", "Agregue un poco de gel de color verde azulado a la pasta de azúcar y amasar hasta que el color se distribuya uniformemente. Espolvoree ligeramente una superficie de trabajo con azúcar glas y extienda la pasta de azúcar hasta el grosor de una moneda de una libra. Recorta las letras para deletrear \"AMOR\" (estas se ubicarán en la parte superior del pastel de 15 cm / 6 pulgadas) y reserva.", "Para el pastel de naranja y pistacho, coloque el pastel sobre el tablero para pasteles de 18cm / 7 pulgadas. En una superficie de trabajo ligeramente espolvoreada con azúcar glasé, extienda la mitad del mazapán al grosor de una moneda de una libra. Cubre el pastel y alisa los lados. Estire el glaseado de fondant restante de la misma manera, luego coloque la segunda alfombra de impresión en la parte superior y presione en el fondant. Con la estera todavía pegada, coloque el fondant sobre el pastel. Retire con cuidado la esterilla y presione el fondant en los lados de la torta. Cepille con pintura para alimentos de plata y reserve.", "Para terminar la tarta de limón, amapola y sauco, cepille los pasteles con flor de saúco. Haga una crema de mantequilla de semillas de amapola mezclando las semillas de amapola, el extracto de limón y la crema de mantequilla restante. Emparede las tres capas de pastel con la crema de mantequilla y colócalas en la tarta de 15cm / 6 pulgadas. Para decorar, despliegue el mazapán restante y cubra el pastel.", "Estirar el fondant de malvavisco enfriado y cubrir la torta de limón, amapola y sauco. Puntuación cuidadosamente la formación de hielo para crear un efecto de acolchado. Compense un poco de glaseado real según las instrucciones del paquete. Donde sea que se crucen las líneas de la colcha de acolchado, coloque una bola de plata comestible con un poco de hielo real para ayudarlos a pegarse.", "Apila el pastel de naranja y pistacho encima de la torta de chocolate, usando pajitas o tacos para sostener las capas.", "Cubra la tarta de limón con las letras, usando un poco de glaseado real para ayudarlos a pegarse. Apila sobre las otras tortas, nuevamente usando pajitas o tacos para sostener las capas.", "Si tiene tiempo, haga un libro usando cualquier pasta de azúcar sobrante en forma de un cuaderno con una historia de amor escrita en el interior."], "url": "www_bbc_co_uk_food_recipes_languages_of_love_35067", "title": "Idiomas del amor pastel de bodas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 pastel de bodas de tres niveles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de azúcar glas, cernida", "125g / 4½oz de harina común, tamizada", "pizca de sal", "1 cucharadita de extracto de vainilla", "3 claras de huevo grandes"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee dos bandejas para hornear con papel para hornear.", "Coloque la mantequilla y el azúcar glas en un bol y bata con un batidor de mano eléctrico hasta que esté pálido y suave. Batir la harina, medio a la vez. Agregue la sal y el extracto de vainilla y luego bata las claras de huevo.", "Coloque la mezcla en una bolsa para tubos con una boquilla redonda de 1 cm / ½ pulgadas y pinte con líneas rectas de la mezcla, de unos 8 cm de largo, sobre el papel. Deje 5 cm / 2 in entre cada galleta, ya que se extenderán durante la cocción.", "Transfiera las bandejas al refrigerador por 15-20 minutos, o hasta que la masa esté firme al tacto.", "Hornee los bizcochos por 10 minutos o hasta que estén dorados por los bordes. Use una espátula para transferir a una rejilla para que se enfríe (para que no se peguen a la bandeja)."], "url": "www_bbc_co_uk_food_recipes_langues_de_chat_biscuits_51182", "title": "Lenguajes de chat de cookies", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace alrededor de 20-25 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/langues_de_chat_biscuits_51182_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 ml / 9 fl oz de leche semidesnatada o desnatada", "8 bolsitas de té Lapsang Souchong", "220 g / 8oz de mantequilla sin sal", "450g / 1lb de azúcar granulada", "2 huevos grandes de gallinas camperas", "Harina de auto aumento 250g / 9 oz", "240g / 8½oz de harina natural", "230 g / 8¼ oz de mantequilla sin sal, a temperatura ambiente", "120ml / 4fl oz de leche semidesnatada", "2 cucharaditas de extracto de vainilla de buena calidad", "500g / 1lb 2oz de azúcar glas", "3 cucharadas de whisky, más extra para el gusto", "100 g / 3½ oz de chocolate negro, finamente rallado, para decorar"], "method": ["Precaliente el horno a 180 ° C / 170 ° Ventilador / Gas 4 y alinee dos bandejas de magdalenas de 12 hoyos con fundas de magdalenas.", "Para los cupcakes, caliente la leche en una cacerola hasta que comience a hervir, luego retire la sartén del fuego y agregue las bolsitas de té. Cubra y reserve por unos 30 minutos.", "En una batidora eléctrica independiente o de mano, bata la mantequilla y el azúcar hasta que estén suaves y esponjosos. Agregue los huevos uno a la vez, mezclando bien después de cada adición. Tamiza las harinas en un recipiente aparte.", "Agregue un tercio de las harinas y un tercio de la leche infundida con té a la mezcla de manteca y azúcar. Mezcle bien hasta que se combinen, luego agregue la harina restante y la leche en tandas, mezclando entre cada adición, hasta que toda la harina y la leche se hayan combinado.", "Divida la mezcla en partes iguales entre las 24 cajas de cupcake (use una bola de helado para hacer esto más fácil). Hornee durante unos 22-25 minutos, o hasta que estén suaves al tacto.", "Enfríe los cupcakes en sus latas durante aproximadamente 5 minutos, luego colóquelos en una rejilla para que se enfríen completamente.", "Para hacer la crema de whisky, bata la manteca, la leche, la vainilla y la mitad del azúcar glas hasta que quede suave usando una batidora eléctrica. Agregue el resto del azúcar glas y bata hasta que quede glaseado suave. ¡Mezcla el whisky y añade más sabor si lo deseas! Transfiera la crema de mantequilla a una manga pastelera equipada con una boquilla de estrella grande.", "Cuando los cupcakes estén completamente fríos, hiérvelos con la crema de whisky y ralla un poco de chocolate negro sobre cada uno para decorar."], "url": "www_bbc_co_uk_food_recipes_lapsang_souchong_50355", "title": "Lapsang souchong cupcakes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24 magdalenas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de harina blanca fuerte", "1 cucharadita de sal", "2 bolsitas de 7 g de levadura instantánea", "75 g / 2½ oz de manteca de cerdo", "300ml / 10½fl oz de agua", "75 g / 2½ oz de mantequilla", "225g / 8oz de frutas secas mezcladas, incluyendo cáscara mixta", "50g / 1¾oz de azúcar morena suave", "harina extra para quitar el polvo"], "method": ["Mezcle la harina, la sal y la levadura en un tazón. Frote 20 g / ¾oz de la manteca de cerdo usando las puntas de los dedos hasta que no haya pedazos de manteca visibles.", "Agregue tres cuartas partes del agua y mezcle manualmente la harina en el agua para formar una masa. Agregue tanta agua restante como sea necesario para obtener una masa blanda y que deje limpios los lados del recipiente.", "Incline la masa sobre una superficie ligeramente enharinada y amase durante 5-10 minutos, o hasta que la masa esté suave. Coloque en un recipiente limpio, cubra y deje crecer hasta que duplique su tamaño. Esto depende de la temperatura de la habitación, pero debe tomar 1-2 horas.", "Incline la masa sobre una superficie de trabajo enharinada y enrolle en un rectángulo de aproximadamente 20x50 cm / 8x20 pulgadas y aproximadamente ½ cm de grosor.", "Ponga un tercio de la manteca restante y un tercio de la mantequilla sobre la superficie de la masa. Distribuye más de un tercio de la fruta y un tercio del azúcar. Doble el tercio superior de la masa hacia abajo y el tercio inferior hacia arriba para que la masa se pliegue en tres y aproximadamente cuadrada. Gire la masa un cuarto de vuelta. Estire y repita el proceso dos veces más, para agotar toda la manteca y la fruta.", "Alinee una lata cuadrada de 23x23cm / 9x9 pulgadas con pergamino para hornear. Estirar la masa para que quepa en la lata y colocarla dentro. Cúbralo con film transparente o colóquelo dentro de una bolsa de plástico grande y déjelo reposar durante 30 minutos. Precalentar el horno a 220C / 425F / Gas 7.", "Hornee por 30-35 minutos, o hasta que estén doradas.", "Deje que se enfríe un poco antes de quitarlo de la lata. Cortar en cuadrados y servir caliente o frío, con mantequilla."], "url": "www_bbc_co_uk_food_recipes_lardy_cake_80839", "title": "Pastel Lardy", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lardy_cake_80839_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de harina blanca fuerte", "5g de sal", "14 g / ½ oz de levadura de acción rápida", "75 g / 2½ oz de mantequilla, en cubos, más extra para engrasar", "75 g / 2½ oz de manteca de cerdo, en cubos", "50g / 1¾oz de azúcar morena oscura", "225 g / 8oz de fruta seca mixta"], "method": ["Pon la harina en un tazón grande. Agregue la sal a un lado y la levadura a la otra. Mezcle y frote la mantequilla con la punta de los dedos. Vierta 225ml / 7½fl oz de agua y mezcle para formar una masa. Agregue un poco de agua extra para formar una masa suave que deja limpios los lados del recipiente.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante 5-10 minutos, o hasta que la masa esté suave. Coloque en un recipiente limpio y deje que se levante durante al menos 3-4 horas, o hasta que duplique su tamaño.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase una lata con forma de resorte de 20cm / 8in con mantequilla.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada. Presione con los dedos para aplanar en un rectángulo, aproximadamente 50x20cm / 20x8in. Esparza la manteca de cerdo para cubrir dos tercios de la masa y espolvorear el azúcar sobre la manteca de cerdo. Cubra el azúcar con la fruta seca. Traiga la sección descubierta al centro, luego doble el otro tercio en la parte superior.", "Gire la masa para que un borde largo quede hacia usted y gire hacia un rectángulo grande. Clave la parte inferior de la masa en la superficie de trabajo presionando el borde con los dedos. Enrolle la masa en forma de una salchicha larga, empezando por el borde más alejado de usted. Corta toda la longitud del rollo, para formar dos tiras largas y revela la fruta en el interior.", "Sostenga las piezas firmemente en cada extremo y gírelas firmemente, moviendo sus manos en direcciones opuestas. Ahora enrolle la masa retorcida en un círculo y presione los extremos firmemente juntos.", "Coloque la corona en la lata preparada. Deja probarlo hasta que llegue a la parte superior de la lata. Esto tomará aproximadamente 1½ horas.", "Hornee por 25-30 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_lardy_cake_crown_97389", "title": "Corona de pastel Lardy", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lardy_cake_crown_97389_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["170ml / 6fl de leche en oz", "40 g / 1½ oz de mantequilla sin sal, en cubos más extra para engrasar estaño", "Harina de pan fuerte 340g / 12oz", "1 cucharadita de sal", "2 cucharadas de azúcar en polvo, más extra para espolvorear estaño", "9 g / ¼ oz de levadura seca", "1 huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo, más extra para rociar sobre los pasteles después de hornear", "Manteca de cerdo 250 g / 9 oz, en cubos", "canela molida, al gusto", "150 g / 5½ oz mezcla de frutas secas (grosellas, pasas, pasas sultanas), empapado en un poco de agua"], "method": ["Calienta la leche con la mantequilla hasta que la mantequilla se derrita. Retire del fuego y deje que se enfríe a 45 ° C / 113 ° F. Mientras tanto, mezcle la harina, la sal, el azúcar y la levadura en un recipiente para mezclar para una batidora independiente.", "Bate el huevo en la leche, luego vierte el líquido gradualmente en la mezcla de harina y mézclalo en una masa que no sea demasiado pegajosa, es posible que no necesites todo el líquido. Amasar la masa en una batidora independiente con un gancho de masa durante cinco minutos.", "Cubra la masa con film transparente y déjela a un lado para que se levante hasta que tenga el doble de tamaño (aproximadamente una hora).", "Mientras tanto, para la mezcla de manteca de cerdo y azúcar, combine el azúcar y la manteca de cerdo en cubos para formar una pasta suave. Agregue canela molida al gusto.", "Precalienta el horno a 200C / 400F / Gas 6. Pasa dos bandejas para hornear con pergamino para hornear. Haga la línea 10 de los anillos de los chefs, 8cm / 3¼ pulgadas de diámetro, con papel de pergamino, y luego ponga mantequilla y azúcar en el papel y déjelo a un lado.", "Corta la masa en 10 pedazos iguales, pésalos para asegurar que sean del mismo tamaño. Ruede cada pieza en una bola con sus manos, luego despliegue cada bola en un círculo de 14cm / 6 pulgadas. Cepille un poco de manteca y pasta de azúcar en la parte superior. Dobla un borde del círculo hacia el centro, gira y repite para que se forme un pequeño hexágono. Avance nuevamente a un círculo de 14cm / 6 pulgadas. Repita para los 10 y déjelos a un lado para descansar durante 10 minutos. Una vez descansado, cepille más manteca y mezcla de azúcar y espolvoree la fruta seca. Repita el plegado en un procedimiento hexagonal. Coloque cada hexágono en un anillo de cocinero en la bandeja de hornear, con los lados doblados hacia arriba. Cúbralo en una película adhesiva y déjelo a un lado para que descanse hasta que tenga el doble de tamaño (aproximadamente 40 minutos).", "Cepille los pasteles lardy con leche y colóquelos en la parte más caliente del horno. Hornee por 20 minutos o hasta que estén doradas.", "Retire del horno y descanse en la lata durante 15 minutos. Saque los pasteles de lardy y espolvoree una mezcla de media azúcar y canela molida sobre los pasteles de lardy."], "url": "www_bbc_co_uk_food_recipes_lardy_cakes_15603", "title": "Tortas Lardy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 10 pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8oz sultanas", "90 g / 3½ oz de manteca de cerdo, más 1 cucharada extra para engrasar", "125g / 4½oz de azúcar mascabado ligero", "2 cucharadas de jarabe de oro", "225ml / 8fl oz de agua", "Harina integral 225g / 8oz", "1 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "¼ cucharadita de nuez moscada molida", "1 cucharadita de pimienta de Jamaica molida", "4 huevos de gallinas camperas, ligeramente golpeados", "600 g / 1 libra de azúcar de mermelada de 5 oz (no debe confundirse con azúcar conservada)", "1 limón, cáscara y jugo solamente", "1kg / 2lb 4 oz de fresas, enteras, mondadas", "1 cucharadita de pimienta negra molida"], "method": ["Para la torta, precaliente el horno a 180C / 350F / Gas 4.", "Coloque las pasas sultanas, la manteca, el azúcar mascabado, el sirope dorado y el agua en una cacerola y deje que hiervan, revolviendo constantemente. Retirar del fuego y enfriar, idealmente durante la noche.", "Engrase y forre una lata pequeña de pan con manteca de cerdo. Tamiza la harina, el polvo de hornear, el bicarbonato de soda y las especias en un tazón grande. Mezcle la mezcla de fruta enfriada en los ingredientes secos junto con los huevos, batiendo bien para combinar.", "Incline la mezcla de torta en el molde de torta preparado y nivele la parte superior. Coloque en el horno para hornear durante 1-1 ¼ horas hasta que la parte superior esté dorada y un pincho insertado en el centro salga limpio.", "Enfríe en la lata durante 30 minutos, antes de apagar y enfriar completamente en una rejilla de alambre.", "Para la mermelada de fresa de pimienta negra, coloque el azúcar, la ralladura de limón y el jugo en una sartén grande y caliente hasta que el azúcar se haya disuelto. Agregue las fresas y la pimienta negra, lleve a ebullición y cocine durante cinco minutos.", "Apague el fuego y deje que se enfríe el atasco, antes de quitar espuma. Coloque la cuchara en frascos esterilizados (alrededor de 2-3 jarras, dependiendo de su tamaño).", "Para servir, cortar el pastel y extender generosamente con un poco de mermelada."], "url": "www_bbc_co_uk_food_recipes_lardycakewithblackpe_88763", "title": "Pastel de Lardy con mermelada de fresa de pimienta negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas grandes", "Aceite de orujo de ½ litro / 17½ fl oz, para freír (o aceite de oliva)", "1 diente de ajo, finamente picado", "2 cucharadas de aceite de oliva italiano", "400g / 14¼ oz de tomates picados italianos en lata", "3 cucharadas de albahaca fresca en rodajas", "Pasta conchiglioni 300g / 10½oz (conchas de pasta)", "100g / 3½oz de queso pecorino romano", "sal y pimienta negra recién molida, al gusto", "ensalada verde"], "method": ["Cortar la berenjena en cubos de aproximadamente 2 cm (0,75 in), colocar en un colador, espolvorear con 3-4 pellizcos de sal y dejar reposar, dejando que se drene el exceso de agua.", "Una vez listo, precalienta el orujo o el aceite de oliva en una olla alta y freír las berenjenas hasta que estén doradas y crujientes (aproximadamente tres minutos).", "Escurra el exceso de aceite y coloque las berenjenas en un recipiente listo para usar.", "En una cacerola, sofreír el ajo en el aceite de oliva, agregar las berenjenas y los tomates picados y mezclar bien.", "Agregue la albahaca, sazone con sal y pimienta y deje cocer a fuego lento durante aproximadamente 20 minutos.", "Mientras tanto, cocine la pasta en agua hirviendo con sal hasta que esté al dente.", "Escurra la pasta y coloque de nuevo en la misma cacerola grande.", "Agregue la salsa de berenjena a la pasta, mezcle bien y sirva inmediatamente con virutas de pecorino romano y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_largeshellpastawitha_73734", "title": "Pasta de concha grande con berenjenas y tomates", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva", "1 cebolla, finamente picada", "1 zanahoria, picada", "2 palitos de apio, picados", "1 hoja de laurel", "3 dientes de ajo, aplastados", "500 g / 1 libra de carne picada 2 oz", "2 cucharadas de puré de tomate", "125ml / 4fl oz de vino tinto", "1 x 400g / 14oz de tomates picados en lata", "400-500ml / 14-18fl oz de caldo de carne", "sal marina y pimienta negra recién molida", "75g / 2½oz de mantequilla sin sal", "Harina normal de 75 g / 2½ oz", "1 litro / 1¾ pinta de leche entera", "¼ cucharadita de nuez moscada recién rallada", "250-300 g / 9-10½ oz de hojas de lasaña secas que no requieren remojo", "150 g / 5½ oz parmesano, para servir", "aceite de oliva virgen extra, para lloviznar"], "method": ["Para la salsa, caliente una cacerola o cacerola a fuego medio-alto. Una vez caliente, agregue un glug de aceite y luego agregue la cebolla, la zanahoria, el apio y la hoja de laurel y cocine durante 5-6 minutos, o hasta que se ablanden. Agregue el ajo y continúe cocinando durante dos minutos.", "Encienda el fuego y agregue la carne picada a la sartén y continúe freír, rompiendo los trozos grandes, hasta que la carne esté dorada por completo. Condimentar con sal y pimienta. Una vez dorado por completo, agregue el puré de tomate y mezcle bien. Cocine por dos minutos y luego vierta el vino tinto y suba el fuego para hacer burbujear el vino. Cocine por 3-4 minutos, raspando cualquier trozo pegado al fondo de la sartén.", "Agregue los tomates a la sartén, mezcle bien y cocine a fuego lento y luego vierta en 400 ml / 14 fl oz de la acción. Deje que hierva a fuego lento, reduzca el fuego a un nivel bajo y deje cocer suavemente durante una hora, revolviendo de vez en cuando hasta que esté espeso y reducido, pero aún húmedo. Si en algún momento la mezcla se ve demasiado seca, agregue el material restante junto con un poco de agua, si es necesario, para rellenar. Pruebe y ajuste el condimento según sea necesario, luego déjelo a un lado mientras prepara la salsa bechamel.", "Precaliente el horno a 190C / 375F / Gas 5. En una cacerola mediana de base gruesa, derrita la mantequilla, agregue la harina y cocine durante 3-4 minutos, o hasta que la mezcla se torne de un color dorado claro que se asemeje a almendras molidas. Poco a poco batir la leche en lotes hasta que quede suave. Pruebe y sazone según sea necesario con sal y pimienta. Agregue la nuez moscada y luego cocine a fuego lento durante 4-5 minutos hasta que espese, revolviendo de vez en cuando.", "Extienda un tercio de la salsa de carne en el fondo de un plato mediano de lasaña (aproximadamente 2-2.5 litros / 3½-4½ pintas en volumen) y cubra con una cuarta parte de la bechamel, luego cubra con láminas de lasaña, rompiendo cualquiera como sea necesario para ajuste para que todo esté cubierto. (No importa si las hojas se superponen un poco.) Espolvorea más de un cuarto del queso parmesano.", "Repite el proceso para crear otras dos capas. Termine con una capa final de hojas de lasaña y el resto de bechamel, asegurándose de que todas las hojas de lasaña estén completamente cubiertas. Espolvorea sobre el queso parmesano restante.", "Rocíe con un poco de aceite de oliva virgen extra, colóquelo en una bandeja para hornear y colóquelo en el horno precalentado para hornear durante 30-40 minutos, o hasta que se dore y burbujee. Servir en trozos abundantes con una ensalada verde crujiente."], "url": "www_bbc_co_uk_food_recipes_lasagne_22392", "title": "Cómo hacer lasaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lasagne_22392_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "4 palitos de apio, finamente picados", "2 zanahorias, finamente picadas", "1 cebolla mediana, finamente picada", "2 dientes de ajo, pelados y triturados", "1 ramita de romero", "700 g / 1 lb 9 oz carne picada", "Carne picada de cerdo a 340 g / 12 oz", "1 botella de vino tinto (750 ml / 26½ fl oz)", "2 x 400g / 14oz latas de tomates, toscamente picados", "200ml / 7fl oz de caldo de carne", "sal y pimienta negra recién molida", "1 litro / 1¾ pintas de leche entera", "2 hojas de laurel", "¼ de cebolla", "pizca de nuez moscada recién rallada", "50g / 2oz de mantequilla", "Harina normal de 50g / 2oz", "14 hojas de pasta fresca de lasaña", "3 mozzarella de bolas de 125g / 4½oz, cortadas en cubos pequeños", "pequeño puñado de parmesano rallado", "pimienta negra recién molida", "2 cucharadas de mantequilla"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los ragu, caliente el aceite de oliva en una sartén a fuego lento y fría el apio, las zanahorias y la cebolla durante aproximadamente 15 minutos, hasta que estén suaves y dorados. Agregue el ajo y el romero y fría por dos minutos más.", "Agregue la carne de res y la carne de cerdo picada y cocine hasta que el líquido de la carne haya sido absorbido.", "Vierta aproximadamente 400 ml / 14 fl oz de vino tinto y mezcle bien. Cocine por aproximadamente 45 minutos.", "Una vez que el vino se haya evaporado, agregue los tomates y el caldo. Deje la mezcla descubierta para cocinar lentamente durante dos horas. Rellene con más caldo caliente si es necesario. Sazonar con sal y pimienta negra recién molida al gusto.", "Para hacer la salsa bechamel, coloque la leche en una cacerola antiadherente grande, agregue las hojas de laurel, la cebolla y la nuez moscada y suavemente llevar a ebullición.", "En una olla aparte, derrita la mantequilla y agregue la harina. Batir bien y cocinar por dos minutos. Retire la leche del fuego y agregue un poco a la mezcla de harina. Combine bien, y cuando toda la leche haya sido absorbida, agregue un poco más. Continúe haciendo esto hasta que se haya agregado toda la leche, batiendo continuamente.", "Para la lasaña, pula la pasta en agua hirviendo con sal durante tres minutos. Ponga un tercio de la salsa bechamel en el fondo de un plato de lasaña en una capa, luego coloque algunas de las tiras de pasta sobre la parte superior. Siga esto con un poco de mozzarella y parmesano, y espolvoree sobre pimienta negra recién molida. Sigue con una capa de ragu. Repita este paso dos veces hasta que se hayan agotado todos los ingredientes. Coloque las perillas de mantequilla sobre la superficie y cocine en el horno durante 30 minutos, o hasta que estén doradas en la parte superior y completamente cocidas."], "url": "www_bbc_co_uk_food_recipes_lasagne_82381", "title": "lasaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lasagne_82381_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Carne picada de carne 250 g / 9 oz", "1 cebolla, cortada en cubitos", "3 zanahorias, ralladas", "75 g / 2½ oz de mantequilla", "Harina normal de 75 g / 2½ oz", "1 cucharadita de mostaza inglesa", "750ml / 1⅓ pinta de leche", "2 dientes de ajo, aplastados", "2 x 400 g / 14 oz de tomates de hojalata", "Hojas de lasaña 250 g / 9 oz", "sal y pimienta"], "method": ["Precalentar el horno a 200C / 400F / Gas 6", "Calentar una sartén grande a fuego medio y agregar el aceite de oliva. Una vez caliente, agregue la carne picada junto con una buena pizca de sal y pimienta. Dorar la carne picada durante 5-6 minutos hasta que se coloree por completo y comience a crujiente. Retire la carne picada de la sartén y colóquela a un lado.", "Agregue la cebolla y la zanahoria a la sartén junto con una pizca de sal. Cocine suavemente durante 10 minutos, o hasta que todo esté blando.", "Mientras tanto, derrita la mantequilla en una cacerola a fuego medio. Una vez derretido, agregue la harina y la mostaza, revuelva para mezclar bien. Deja cocinar a fuego medio durante dos minutos, o hasta que la mezcla haga una pasta.", "Vierta la leche en tandas en la cacerola, batiendo a medida que agrega para crear una salsa blanca y suave. Una vez que se haya agregado toda la leche, sazone con una pizca de sal y pimienta negra, baje el fuego y déjelo hervir a fuego lento durante siete minutos.", "Una vez que las cebollas y las zanahorias se ablanden, agregue el ajo a la sartén y cocine durante dos minutos. Devuelva la carne (más los jugos) a la sartén y agregue los tomates. Mezcle todo junto, cubra con una tapa y cocine a fuego lento la salsa durante 10 minutos hasta que espese un poco.", "Para ensamblar la lasaña, coloque un cuarto de salsa de tomate en el fondo de una fuente de horno pequeña / mediana. Cubra con una capa de hojas de lasaña. Vierta la otra mitad de la salsa de tomate y cubra con un tercio de la salsa blanca. Repita esto dos veces más, terminando en la parte superior con la última capa de salsa blanca. (Debe tener tres juegos de capas de lasaña, tomate y salsa blanca, todo en una cama de salsa de tomate).", "Coloque en el horno precalentado y hornee durante 30 minutos o hasta que burbujee y la parte superior esté dorada. Sirve la lasaña en rodajas mientras está caliente."], "url": "www_bbc_co_uk_food_recipes_lasagne_40419", "title": "lasaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de leche entera", "75g / 3oz de mantequilla sin sal", "125g / 4½oz 00 de harina", "1 hoja de laurel", "125 g / 4½ oz de queso parmesano rallado", "2 yemas de huevos de gallinas camperas", "110g / 4oz de mantequilla sin sal", "2 cucharadas de apio picado", "2 cucharadas de zanahorias picadas", "2 cucharadas de cebolla roja picada", "Panceta ahumada 110 g / 4 oz", "1 ramita de romero fresco, hojas recogidas, picadas", "1 kg / 2lb 2 oz de carne de ternera cortada o flanco de res, finamente picada", "Prosciutto 50g / 2oz, aproximadamente picado", "1 x 400 g / 14 oz de tomates picados de buena calidad", "125ml / 4½fl oz de vino blanco", "110ml / 4fl oz de leche entera", "1 paquete de 250 g / 9 oz hojas frescas de lasaña", "aceite de oliva, para engrasar", "gran puñado de parmesano rallado"], "method": ["Para el bechamel verter la leche en una cacerola y llevar a fuego lento, apagar el fuego y reservar.", "En una cacerola pesada, derrita la mantequilla, luego mezcle la harina y la leche caliente. Batir rigurosamente hasta que quede suave. Agregue la hoja de laurel, cubra con un círculo de papel a prueba de grasa y cocine lentamente durante 30-40 minutos. Retire el papel y la hoja de laurel y sazone con sal y pimienta negra recién molida. Agregue el parmesano y las yemas de huevo y deje enfriar.", "Para los ragu, derrita la mantequilla en una cacerola grande hasta que forme espuma. Agregue el apio, las zanahorias, la cebolla, la panceta y el romero y fría por cinco minutos. Agregue la ternera y el jamón y cocine por otros cinco minutos.", "Agregue los tomates, el vino blanco y la leche y deje que hierva. Reduzca el fuego y cocine lentamente durante 1 hora y media. La carne se debe desmenuzar en trozos pequeños y la salsa debe tener una consistencia rica y espesa.", "Precalentar el horno a 170C / 325F / Gas 3", "Blanquee las hojas de pasta en agua hirviendo con sal durante un minuto, luego revuelva en agua fría.", "Frote el aceite de oliva en los lados de una fuente para horno. Coloque una capa de pasta en la base del plato y luego agregue una capa uniforme de ragu de carne de vacuno, seguido de una capa de salsa bechamel. Repita este proceso hasta que haya usado toda la pasta y termine con una gruesa capa de bechamel en la parte superior. Espolvorea la parte superior con una generosa capa de queso parmesano.", "Hornee en el horno durante 40-45 minutos, o hasta que burbujee y dore en la parte superior.", "Cortar la lasaña en cuadrados y servir."], "url": "www_bbc_co_uk_food_recipes_lasagne_99783", "title": "lasaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de cebada, enjuagada", "1 cucharada de aceite de oliva", "2 puñados grandes de hojas oscuras de ensalada, incluidas las espinacas", "Frijoles verdes de 200g / 7oz, coronados y adosados", "4 rábanos, en rodajas", "2 remolachas cocidas, cortadas en cubitos", "pequeño racimo de eneldo, solo hojas", "pequeño racimo de perejil, solo hojas", "pequeño manojo de menta, solo hojas", "100g / 3½oz de queso letón desmenuzable o queso feta", "50g / 2oz de nueces, ligeramente tostadas", "100ml / 3½fl oz de suero de leche", "1 cucharada de crema agria", "1 cucharada de jugo de limón o vinagre de vino", "½ diente de ajo, triturado o finamente picado", "1 cucharadita de miel", "sal y pimienta negra recién molida", "1 granada, solo semillas"], "method": ["Ponga la cebada en una cacerola, cubra con agua fría. Sazonar con sal y llevar a ebullición. Cocine a fuego lento durante unos 30 minutos hasta que la cebada esté recién hecha, aún así debe comer algo. Escurrir, rociar con aceite de oliva y dejar enfriar.", "Ponga a hervir una olla de agua y blanquee las judías verdes durante unos minutos. Escurrir y colocar en un recipiente con agua fría.", "Para el aderezo, mezcle los ingredientes y sazone con sal y pimienta.", "Arregle las hojas de ensalada en un plato grande. Agregue los frijoles, los rábanos y la remolacha, luego espolvoree sobre las hierbas, la cebada, el queso y las nueces, y agite ligeramente para combinar bien.", "Rocíe sobre el aderezo de ensalada, decore con las semillas de granada y sirva."], "url": "www_bbc_co_uk_food_recipes_latvian_salad_50575", "title": "Ensalada letona", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/latvian_salad_50575_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "2 cebollas rojas, en rodajas", "2 dientes de ajo, finamente picados", "2 cucharaditas de jengibre fresco de raíz finamente picado (o tallo de jengibre en almíbar, escurrido y finamente picado)", "200 g / 7 oz listos para comer albaricoques secos, en cuartos", "150g / 5½oz de higos secos, descuartizados", "100g / 3½oz de uva", "150g / 5½ oz demerara azúcar", "Vinagre de vino blanco 150ml / 5fl oz", "¼ de nuez moscada entera, finamente rallada", "1 ramita de canela", "1 cucharadita de copos de sal marina", "pimienta negra recién molida"], "method": ["Calentar el aceite en una olla grande no reactiva y freír las cebollas a fuego lento durante 10 minutos o hasta que estén muy suaves pero no coloreadas.", "Agregue el ajo y el jengibre, y cocine durante 2-3 minutos más.", "Aumenta el fuego ligeramente y freír durante 4-5 minutos más, hasta que las cebollas comiencen a dorarse, revolviendo constantemente.", "Agregue los albaricoques, los higos y las pasas a la sartén y cocine por 2-3 minutos, o hasta que la fruta seca comience a engordar un poco.", "Espolvorea sobre el azúcar, agrega el vinagre, las especias y condimenta al gusto con sal y pimienta negra recién molida.", "Revuelva bien y cocine a fuego lento, y cocine, sin tapar, durante 30 minutos, revolviendo ocasionalmente. (Es más probable que la salsa picante se adhiera hacia el final del tiempo de cocción, así que preste especial atención a la agitación).", "El chutney está listo cuando el líquido se ha reducido a solo 4-5 cucharadas, y la fruta se ve grumosa y brillante. Retirar del fuego y reservar para enfriar. A medida que el chutney se enfría, agítelo un poco para distribuir la humedad.", "Vierta la salsa picante en frascos esterilizados."], "url": "www_bbc_co_uk_food_recipes_last_minute_christmas_08523", "title": "Chutney de Navidad de último minuto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1-2 jarras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/last_minute_christmas_08523_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400ml / 15fl oz de leche entera", "675g / 1¼lb de harina común", "pizca de sal", "75g / 3oz de mantequilla sin sal", "75g / 3oz de azúcar en polvo", "80 g / 3¼ oz de sultanas", "2 sobres de levadura seca", "5g / ¼ oz de azafrán, molido", "2 huevos medianos", "fina ralladura de ½ limón", "50g / 2oz de almendras troceadas o picadas", "yemas de huevo batidas para esmaltar", "cardamomo, recién molido", "glaseado de azúcar para dragar"], "method": ["Lleva la leche y la mantequilla a temperatura ambiente.", "Disuelva la levadura en la mitad de la leche con 5 g / 1 cucharadita del azúcar pesada, deje en un lugar tibio para que se forme espuma (debe tomar aproximadamente 15 minutos).", "Batir los ingredientes restantes, excepto la harina y las almendras.", "Mezcle la harina hasta que tenga una masa suave y elástica. Cubra bien con una película plástica y coloque en la nevera durante la noche.", "Retire del refrigerador y divida la masa en tres. Derribar, en una tabla ligeramente enharinada, y rodar en longitudes iguales, de unos pocos pies de largo.", "Trenza la masa y pellizca los extremos para sellar. Forme un anillo y colóquelo en un pergamino para hornear en una bandeja, cúbralo ligeramente con una película plástica y demuéstrelo hasta que tenga el doble de tamaño.", "Cepillar con la yema batida (bañada con un poco de leche), luego esparcir sobre las almendras y una buena pizca de cardamomo molido.", "Coloque en el horno que ha sido precalentado a 190 ° C / 375 ° F / Gas 5 y hornee durante aproximadamente 30 minutos hasta que estén dorados. Cuando la base se toca y suena hueca, el pan está hecho.", "Retire del horno y drague generosamente con el azúcar glas."], "url": "www_bbc_co_uk_food_recipes_latvianchristmasyell_9353", "title": "Pan amarillo letón de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["335g / 11¾oz de harina común", "65 g / 2¼ oz de mantequilla sin sal, refrigerada", "10 g / ¼ oz de sal", "Vinagre de vino blanco 10g / ¼ oz, frío", "250 g / 9 oz de mantequilla, refrigerada", "200 g / 7 oz de azúcar en polvo de oro", "2 cucharaditas de flores secas de lavanda (disponible en la sección de especias de los grandes supermercados)", "8 manzanas (preferiblemente Russet o Braeburn), peladas y sin corazón", "1 limón, solo jugo", "50 g / 1¾oz de mantequilla sin sal", "pizca de sal", "crema coagulada, para servir"], "method": ["Para hacer la masa, frote la mantequilla de 65 g / 2¼ oz en la harina y la sal con las puntas de los dedos hasta que se asemeje a pan rallado. En un recipiente aparte, mezcle ligeramente el vinagre con 150 g / 5½ oz de agua, luego agregue esto a la mezcla seca y combine para hacer una masa. Transfiera al congelador por 10 minutos.", "Mientras la masa se enfría en el congelador, aplaste la mantequilla restante de 250 g / 9 oz colocándola entre dos hojas de papel resistente a la grasa y usando un rodillo para aplastarla en forma cuadrada con menos de 1 cm / ½ pulgada de grosor.", "Extienda la masa de hojaldre fría para formar un rectángulo dos veces más grande que el cuadrado aplanado de mantequilla. Dobla la masa sobre la mantequilla, luego gírala 90 grados y extiéndela hasta que duplique su longitud. Doble ambos extremos en el medio, luego doble una vez más (para 'cerrar el libro'). Transfiera a la nevera por 20 minutos.", "Para el relleno, mezcle la lavanda con el azúcar impalpable para infundir. Toma cuatro de las manzanas, córtalas en rodajas y reserva. Corte las manzanas restantes en mitades y colóquelas en una rejilla para enfriar. Transfiera al refrigerador para oxidar levemente.", "Para la masa, repita el proceso de laminado y plegado otras tres veces y vuelva a la nevera.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, agregue el azúcar de lavanda, 20 g / ¾ oz de agua y jugo de limón a una sartén resistente al horno y caliente hasta que el azúcar se haya disuelto y se haya formado un caramelo ligero. Retire del fuego, agregue la mantequilla y la sal y agite la sartén de vez en cuando hasta que se combinen (no revuelva ya que esto puede hacer que el caramelo se cristalice).", "Coloque las manzanas a la mitad en el centro de la cacerola, corte el lado hacia abajo. Coloque las rebanadas de manzanas alrededor de las mitades y devuelva la sartén a fuego lento durante cinco minutos, luego déjela reposar para que se enfríe un poco.", "Para la masa, repita el proceso de enrollado y plegado una vez más, luego, con cuidado, extiéndalo para que se ajuste al molde. Coloque la masa en la parte superior de la sartén, recortar cualquier exceso, dejando un pequeño voladizo para meter el interior de la sartén.", "Hornee durante 30 minutos o hasta que la masa esté dorada y crujiente. Retire la tarta tatina del horno y colóquela en un plato (tenga cuidado con esto ya que el caramelo todavía estará muy caliente) y deje enfriar durante cinco minutos antes de servir con una cucharada de crema coagulada."], "url": "www_bbc_co_uk_food_recipes_lavender_and_apple_tarte_90753", "title": "Tarta tatin de lavanda y manzana", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz '00' harina de pasta, más harina extra para quitar el polvo", "10 huevos de gallinas camperas", "aproximadamente 5 cucharadas de aceite de oliva", "6 cebollas, muy finamente picadas", "8 zanahorias, muy finamente picadas", "8 dientes de ajo, toscamente picados", "2kg / 4lb 8 oz de carne picada", "1kg / 2lb 4oz costillas de cerdo", "2 litros / 3½ pintas de caldo de carne", "4 x 400 g / 14 oz de tomates cortados en trozos", "puñado de orégano fresco", "algunas hojas de laurel", "1 litro / 1¾ pintas de crema doble", "300g / 10½oz de queso cheddar, rallado", "2 cucharadas de mostaza inglesa", "50 g / 1¾oz de hojas de albahaca", "400ml / 14fl oz de aceite de oliva", "300g / 10½oz de pan rallado"], "method": ["Para la pasta, ponga la harina en un tazón grande para mezclar, haga un pozo en el medio y rompa los huevos en él. Reunir con una cuchara de madera hasta que se combina en una sola masa.", "Amasar sobre una superficie enharinada durante unos buenos diez minutos, o hasta que la masa esté suave y brillante por todos lados y no haya zonas secas o húmedas.", "Corta un pedazo de masa, aproximadamente del tamaño de un huevo y mantén la masa restante debajo de un paño ligeramente húmedo.", "Alimente la pieza de masa a través de una máquina de pasta en la configuración más grande. Hay nueve configuraciones que van de gruesas a muy finas, por lo tanto, repita el proceso nueve veces disminuyendo gradualmente la configuración. Cuelgue las hojas de pasta, un tendedero funciona bien para esto.", "Repita este proceso hasta que haya convertido toda su masa en hojas", "Deje secar durante dos horas; las hojas serán firmes pero ligeramente flexibles.", "Use la base de las bandejas de aluminio como plantilla y corte la pasta en rectángulos para que quepa en la bandeja. Deberías cortar unos 60 en total.", "Para el ragù, caliente cinco cucharadas de aceite de oliva en una sartén grande a fuego moderado.", "Freír las cebollas, las zanahorias y el ajo hasta que se doren y luego transferir a una olla grande.", "En la misma sartén, dore la carne picada en tandas agregando la carne dorada a la olla sobre la marcha.", "Cortar las costillas en tamaños manejables y luego dorarlas en la sartén con un poco más de aceite si es necesario. Transfiere las costillas a la olla.", "Desglasar la sartén con un poco de caldo de carne y agregar a la olla.", "Finalmente agregue los tomates enlatados, el caldo restante y el orégano y las hojas de laurel.", "Llevar a ebullición y luego cocine a fuego lento durante dos horas", "Deslice la carne fácilmente fuera de las costillas con un juego de tenazas y un tenedor. Descarta los huesos.", "Para la salsa de queso, ponga la crema doble, la mostaza y 200 g / 7 oz de queso cheddar rallado en una sartén. Deje que se derrita durante cinco minutos a fuego lento, revolviendo de vez en cuando.", "Para el aceite de albahaca, procesa el aceite y la albahaca en un procesador de alimentos y reserva.", "Para ensamblar la lasaña, coloque un cucharón pequeño de ragù (aproximadamente tres cucharadas colmadas) en la base de cada bandeja de aluminio. Coloque una hoja de pasta en la parte superior. Cepille la hoja de pasta con aceite de albahaca.", "Agregue otro cucharón de ragù y una segunda hoja de pasta y cepille nuevamente con aceite. Agregue un tercer cucharón de ragù y coloque una hoja de pasta más en la parte superior.", "Vierta sobre un cucharón de salsa de queso.", "Dispersar sobre un puñado pequeño del queso rallado restante, luego un pequeño puñado de pan rallado. Termine con un poco de llovizna de aceite de albahaca.", "Para cocinar inmediatamente, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y cocine por 25 minutos.", "Para preparar la lasaña para la congelación, deje que se enfríe, cubra cada parte con la tapa y luego congélela. Se mantendrán hasta por un mes.", "Para cocinar congelado, precaliente el horno a 180 ° C / 350 ° F / Gas 4, pero cocine durante una hora."], "url": "www_bbc_co_uk_food_recipes_lasagne_95631", "title": "Hacer y congelar lasaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Rinde 20 porciones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 2¾oz semillas de girasol", "splash light salsa de soja", "115g / 4oz de mantequilla sin sal", "225g / 8oz de azúcar granulada", "100g / 3½oz de azúcar moreno claro", "pizca de sal", "1-2 cucharaditas de flores de lavanda, finamente picadas"], "method": ["Calentar una sartén a fuego lento. Agregue las semillas de girasol y fría por 1-2 minutos o hasta que estén tostadas. Agregue la salsa de soja y cocine hasta que se evapore. Retire las semillas y reserve.", "Caliente la mantequilla, los azúcares, la sal y 2 cucharadas de agua en una cacerola a fuego lento hasta que la mantequilla se haya derretido y el azúcar se haya disuelto.", "Ponga la mezcla a ebullición, luego reduzca el fuego a moderado y continúe cocinando hasta que la temperatura alcance los 150ºC. Retire la sartén del fuego y agregue las flores de lavanda, luego déjelas a un lado para que se enfríen un poco.", "Vierta la mezcla frágil en bandejas de cubitos de hielo de silicona, luego espolvoree sobre las semillas de girasol. Poner a un lado para endurecer, luego retirar de los moldes y servir."], "url": "www_bbc_co_uk_food_recipes_lavender_and_sunflower_27355", "title": "Lavanda y semillas de girasol quebradizas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16-20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 250g / 9oz, más extra para espolvorear", "40 g / 1½ oz de arroz molido", "pizca de sal", "1½ cucharadita de lavanda seca, molida (asegúrese de que haya sido producida específicamente para comer)", "2 bolsitas de té Lady Gray, solo hojas (o 1 cucharadita de hojas de té, molidas)"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "En un tazón, bata la mantequilla con una batidora eléctrica de mano hasta que esté suave y cremosa. Agregue el azúcar un poco a la vez hasta que esté bien mezclado.", "Tamiza la harina, el arroz molido y la sal en otro recipiente. Revuelva la lavanda y las hojas de té Lady Grey en la mezcla de harina.", "Ligeramente trabaje la harina de lavanda en la crema de mantequilla con los dedos hasta que la masa se una.", "Forma la masa en una bola y cúbrela con film transparente. Dejar en la nevera durante 15 minutos.", "Cuando la masa esté fría, retire la película adhesiva y extiéndala sobre una superficie enharinada a un grosor de aproximadamente ¾cm / ¼ pulgada. Cortar galletas en forma de corazón con un cortador.", "Coloque los bizcochos en una bandeja para hornear y colóquelos en la nevera durante 30 minutos.", "Hornea los bizcochos en el horno durante 20 minutos o hasta obtener un color dorado muy pálido. Deje que se enfríe en la bandeja durante diez minutos antes de transferirla a una rejilla para que se enfríe por completo."], "url": "www_bbc_co_uk_food_recipes_lavender_and_tea_43954", "title": "Galletas de manteca de lavanda y té", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 18 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]