[{"ingredients": ["4 pequeñas pechugas de pato de Berbería", "sal al gusto", "granos de pimienta verde recién molida", "4 cucharadas de cebolla roja, finamente picada", "2 mangos maduros, pelados y cortados en dados de 1 cm (½ pulgadas)", "4 cucharadas de limón o jugo de limón", "1-2 chiles rojos, finamente cortados en cubitos", "1 cucharada de azúcar", "2 cucharadas de menta fresca picada", "½ cucharadita de sal", "granos de pimienta verde recién molida", "perejil de hoja plana, para adornar"], "method": ["Sazone las pechugas de pato con sal y granos de pimienta recién molida, luego colóquelos, con la piel hacia abajo, en una sartén caliente.", "Gire los pechos de pato.", "Cocine por unos minutos, con la piel hacia arriba, luego gírelos nuevamente para que la piel quede crujiente.", "Continúe este proceso hasta que el pato esté cocido a su gusto.", "Para hacer la salsa, primero escalde la cebolla roja vertiéndola sobre ella y drenándola inmediatamente (esto suaviza el sabor crudo de la cebolla, que puede dominar ligeramente a los otros ingredientes).", "Mezcle con los ingredientes de salsa restantes y permita que los sabores se combinen durante media hora.", "Pruebe la salsa, agregue un poco más de lima, azúcar o sal si lo desea.", "Adorne las pechugas de pato con perejil y sirva con mucha salsa en el costado. Sirve con fideos crujientes asiáticos."], "url": "www_bbc_co_uk_food_recipes_duckwithmangosalsa_72997", "title": "Pato con salsa de mango", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, corte de piel entrecruzado", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "4 cucharadas de azúcar moreno", "4 brotes de bambú enlatados enteros", "Fideos de arroz 100g / 3½oz, sin cocer", "250ml / 8¾ fl oz de aceite vegetal, para freír"], "method": ["Precalentar el horno a 200C / 400F / Gas 6", "Coloque el pato con la piel hacia abajo en una sartén y sazone con sal y pimienta negra recién molida. Cocine por 3-4 minutos.", "Cuando la piel del pato se dore, colócala en el horno precalentado durante cinco minutos y cocina. Retire y deje descansar.", "Para hacer los brotes de bambú, en una sartén pequeña caliente el aceite de oliva con el azúcar moreno y agregue los brotes de bambú.", "Coloque en el horno precalentado durante cinco minutos.", "Para hacer los fideos, caliente el aceite en una cacerola de fondo grueso (PRECAUCIÓN: el aceite caliente puede ser muy peligroso. No lo deje desatendido). Coloque los fideos de arroz en el aceite caliente. Ellos soplarán inmediatamente. Retire y escurra sobre papel de cocina.", "Para servir coloque la pechuga de pato en el plato. Agregue los brotes de bambú alrededor del pato y cubra con los fideos."], "url": "www_bbc_co_uk_food_recipes_duckwithnoodlesandba_77705", "title": "Pato con fideos y brotes de bambú", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pato 227g-283½g / 8-10oz (o 2 más pequeñas)", "1 cucharada de comino", "2 cucharadas de miel clara", "1 cucharada de aceite de maíz", "sal y pimienta", "salsa de ciruela en botella", "paquete de algas crujientes"], "method": ["Precalentar el horno a 200C / 400F / Gas6.", "Retire el tendón de la pechuga de pato para evitar que la carne se encoja durante la cocción.", "Coloque el comino, la miel y el aceite en una sartén antiadherente caliente y caliente hasta que se forme espuma y se ponga marrón.", "Coloque el pato preparado previamente, con la piel hacia abajo, en la sartén y sazone bien. Cocine el pecho hasta que la piel esté oscura y crujiente. Es importante colorear la piel en esta etapa ya que no coloreará en el horno. También elimina parte de la grasa.", "Voltee el pato en la sartén, o extráigalo a una bandeja para hornear, y colóquelo en el horno. Cocine por 5-6 minutos por medio, 8-12 minutos por bien hecho.", "Retire el pato y déjelo descansar.", "Mientras se cocina el pato, vierta aproximadamente 6 cucharadas de salsa de ciruela en el centro de un plato para servir y esparza las algas crujientes por el borde.", "Cortar el pato y ponerlo en la piscina de salsa. Servir con arroz o fideos."], "url": "www_bbc_co_uk_food_recipes_duckwithplumsauceand_4849", "title": "Pato con salsa de ciruelas y algas crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, marinada en salsa Hoisin y cinco especias", "sal", "pimienta negra recién molida", "2 cucharadas de aceite", "2 cebollas de primavera", "2 Gema de bebé, recogido, lavado y secado", "1 pepino", "3 cucharadas de salsa de maní simple", "1 cucharada de cacahuetes tostados y triturados"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Sazone la pechuga de pato con sal y pimienta. Caliente el aceite en una sartén a fuego alto y cocine el pato durante unos minutos.", "Transfiera al horno y cocine hasta mediano, 10-15 minutos. Permita descansar por diez minutos.", "Mientras tanto, corta las cebolletas en juliana y corta el pepino en bastones delgados.", "Toma las hojas de la gema del bebé y extiende una pequeña salsa de maní en cada una.", "Corta el pato en rebanadas finas y delgadas. Coloque dos rebanadas en cada hoja de gema de bebé y agregue un poco de cebolleta y pepino.", "Espolvorear con maní y servir."], "url": "www_bbc_co_uk_food_recipes_duckwraps_71806", "title": "Pato envuelve", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Quinua de 200g / 7oz, cocida según las instrucciones del paquete", "puñado de perejil fresco, picado", "1 cucharada de menta fresca picada", "1 pimiento rojo, finamente cortado en cubitos", "1 pepino, finamente cortado en cubos", "1 cebolla roja, finamente picada", "2 cucharadas de aceite de oliva virgen extra", "1 limón, solo jugo", "sal y pimienta negra recién molida", "½ cucharadita de clavo de olor", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "1 cucharadita de pimentón", "pizca de cúrcuma", "½ cucharadita de copos de chile", "Avellanas 50g / 2oz, picadas", "Pistachos 30 g / 1 oz, picados", "1 cucharada de semillas de sésamo", "4 cucharadas de miel", "1 naranja, solo jugo", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "12 chuletas de cordero"], "method": ["Para la ensalada de quinua, mezcle la quinua, las hierbas y las verduras en un bol y viértalas con aceite de oliva y jugo de limón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la dukkah, caliente una sartén y fría los dientes de ajo, hinojo, cilantro y comino hasta que estén fragantes. Coloque en un mortero y mortero y moler hasta que quede suave.", "Combine las especias con el resto de los ingredientes dukkah en un tazón y mezcle hasta que estén bien combinados.", "Frote cada chuleta de cordero con la mezcla de dukkah y jugo de naranja y ase a la parrilla sobre una plancha caliente, en una barbacoa o debajo de una parrilla precalentada, durante 2-3 minutos en cada lado, o hasta que se cocinen a su gusto.", "Para servir coloque parte de la ensalada de quinua en cuatro platos y coloque tres chuletas de cordero encima de cada una."], "url": "www_bbc_co_uk_food_recipes_dukkah_lamb_cutlets_with_80089", "title": "Chuletas de cordero Dukkah con ensalada de quinoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dukkah_lamb_cutlets_with_80089_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla ablandada, más extra para engrasar", "175g / 6oz azúcar moreno claro y suave", "3 cucharadas de mermelada de naranja", "3 huevos de gallinas camperas, golpeados", "Harina de levante 225g / 8oz", "25g / oz de almendras molidas", "1 cucharada colmada de especias mixtas molida", "400g / 14oz de fruta seca mixta", "75g / 3oz de cerezas glace, reducidas a la mitad", "2 cucharadas de whisky o leche", "Almendras blanqueadas de 40 g / 1½ oz para decorar", "1 cucharadita de azúcar granulada o en polvo, para decorar (opcional)"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Engrase y doble línea una lata de torta profunda suelta de 20 cm / 8 in con papel resistente a la grasa.", "Batir la mantequilla y el azúcar en un procesador de alimentos durante 3-4 minutos, o hasta que esté muy ligero y esponjoso.", "Agregue la mermelada y mezcle durante unos segundos más. Lentamente agregue los huevos, uno por vez, batiendo bien después de cada adición.", "Agregue la harina, las almendras y las especias a la mezcla. Mezcle lentamente hasta que esté bien combinado, luego agregue la fruta seca mezclada y las cerezas con una cuchara grande de metal. Agregue el whisky o la leche y mezcle hasta que estén bien combinados.", "Vierta la mezcla en la lata de la torta, alise la superficie y coloque con cuidado las almendras blanquecinas en círculos en la parte superior.", "Hornee por 1½-2 horas, o hasta que esté bien levantado, firme y dorado. (Pruebe el pastel insertando un pincho en el centro. Si el pincho sale limpio, el pastel está hecho).", "Deje que la torta se enfríe durante 10 minutos, luego retírela de la lata, retire el papel de revestimiento y déjela a un lado para que se enfríe en una rejilla de alambre. Espolvorear con azúcar granulada. Almacene en una lata de pastel y coma dentro de 4-5 días."], "url": "www_bbc_co_uk_food_recipes_dundee_cake_22157", "title": "Pastel de Dundee", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dundee_cake_22157_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de mantequilla, más extra para engrasar", "50 g / 2 oz de azúcar morena clara", "150 g / 5½ oz de mantequilla", "175g / 6oz azúcar moreno claro y suave", "4 huevos medianos de granja", "½ vaina de vainilla, solo semillas (o un par de gotas de extracto de vainilla)", "100g / 3½ oz de harina de auto crianza", "Harina integral de 75g / 2½oz", "1 cucharadita de polvo de hornear", "3 cucharaditas de jengibre molido", "1 cucharadita de canela molida", "1 cucharada de melaza", "puñado de nueces de pacana (opcional)", "pizca de sal", "2 plátanos pequeños y firmes", "1 cucharada de calvados (opcional)", "crema batida o helado suavemente, para servir"], "method": ["Engrase y forre una lata cuadrada de 20 cm / 8 pulgadas con pergamino para hornear y vuelva a engrasar. Precalentar el horno a 180C / 350F / Gas 4.", "Primero haga la cobertura pegajosa. Coloque la mantequilla y el azúcar moreno claro en una sartén pequeña a fuego medio. Una vez que la mantequilla se derrita, suba el fuego y deje que la mezcla burbujee durante unos minutos, hasta que comience a espesarse ligeramente. Revuelva con frecuencia para que no se enganche en la parte inferior.", "Vierta la mezcla en el fondo de la lata forrada e incline la lata hacia adelante y hacia atrás para extenderla uniformemente. La mezcla eventualmente se solidificará en la lata, así que asegúrese de extenderla ahora.", "A continuación, incline las pacanas (si está usando) en una bandeja para hornear y tueste en el horno durante cinco minutos. Dejar de lado para enfriar.", "Ahora haz la mezcla de esponja. Crema la mantequilla y el azúcar en un tazón grande (o mezclador de alimentos) hasta que esté suave y esponjoso. Agregue los huevos uno a la vez, golpeando duro entre cada adición. Divida la vaina de vainilla abierta, raspe las semillas en la mezcla (o agregue el extracto de vainilla). Luego doble las dos harinas, el polvo de hornear, el jengibre, la canela, la melaza y la sal y déjelas a un lado.", "Corta los plátanos en trozos de 5 mm / ¼ de grosor. Acomódalos en una sola capa en el fondo de la lata. Los alineé para que sean agradables y directos, pero por supuesto está bien hacerlos en cualquier orden anterior también. Acomódalos bien para que no se muevan una vez que la mezcla de pastel se haya terminado. Luego rocíe sobre los calvados (si se usa).", "Cortar las pacanas y revolverlos a través de la mezcla de pastel. Ahora, con cuidado vierta la mezcla de tortas sobre los plátanos y extiéndela suavemente con la parte posterior de una cuchara o un cuchillo para el paladar, nivelando la parte superior. Pop dentro del horno por unos 45 minutos.", "Después de 35 minutos, retire la torta del horno e inserte un pincho de metal o la cuchilla de un cuchillo pequeño justo en el centro (pero sin tocar el fondo. Debe salir completamente limpio. Si queda algo pegajoso en el mismo, simplemente vuelva a colocarlo en el horno durante otros cinco minutos más o menos.", "Una vez que la torta esté cocida, sáquela del horno y déjela enfriar en la lata durante aproximadamente 10 minutos. Luego coloque una gran placa plana sobre la parte superior de la lata y sosteniendo la lata y la placa, voltee todo para que la lata quede boca abajo. Retire suavemente la lata y retire con cuidado el pergamino para hornear.", "Cortar en cuadrados y servir caliente o frío con su elección de crème anglaise, crema batida o helado."], "url": "www_bbc_co_uk_food_recipes_dulce_and_banana_13248", "title": "Dulce y Banana traybake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 9 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dulce_and_banana_13248_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla", "½ manojo de menta fresca, más 2-3 cucharadas de hojas de menta fresca picada", "2 cucharadas de vinagre de vino blanco", "Vino blanco 50ml / 2floz", "1 cucharadita de granos de pimienta blanca", "1 chalote de plátano pequeño, finamente cortado en cubos", "4 huevos de gallinas camperas, solo yemas", "¼ limón, solo jugo", "400g / 14oz nuevas patatas", "200g / 7oz de frijoles franceses", "75g / 2½ oz de mantequilla", "2 x 150-200 g / 5-7 onzas de filetes de cordero", "sal y pimienta negra recién molida", "aceite de oliva", "8 chuletas de cordero, recortadas"], "method": ["Para la salsa de paloise, derrita la mantequilla en una cacerola mediana a fuego suave. Desnata la espuma blanca que flota en la parte superior de la mantequilla. Luego vierta la mantequilla en un tazón limpio, dejando atrás los sólidos de leche que se hayan hundido en el fondo de la sartén. Agregue el manojo de menta a la mantequilla.", "Coloque el vinagre, el vino blanco, los granos de pimienta y la chalota en una cacerola pequeña y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Retire los granos de pimienta y luego vierta la mezcla en un tazón mediano a prueba de calor. Deje que se enfríe un poco.", "Batir las yemas de huevo en la reducción de vino blanco.", "Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento (asegúrese de que el fondo del recipiente no toque el agua) y mezcle los huevos hasta que estén espesos y de color claro.", "Cuele la mantequilla con sabor a menta a través de un colador en la mezcla de huevo, batiendo constantemente.", "Sazone con sal y pimienta negra recién molida, luego agregue el jugo de limón y las hojas de menta picadas.", "Apague el fuego y deje el recipiente sobre la sartén hasta que esté listo para usar.", "Para las papas nuevas aplastadas y las judías verdes, coloque las papas en una cacerola mediana y agregue agua fría hasta que hierva y cocine por 10 a 15 minutos hasta que las papas estén cocidas. Desagüe.", "Ponga a hervir una cacerola mediana de agua y agregue los frijoles. Hervir durante un minuto, luego escurrir.", "Caliente una sartén pequeña y agregue la mitad de la mantequilla. Agregue los frijoles blancos a la sartén y cocine por un minuto.", "Triture las patatas nuevas ligeramente con un tenedor y agregue la mantequilla restante. Condimentar con sal y pimienta.", "Precaliente el horno a 200C / 400F / Gas 6.", "Para el dúo de cordero, calentar una sartén grande y agregar el aceite, sazonar los filetes con sal y freír hasta que se dore por todas partes. Transfiera al horno por 8-10 minutos. Retire del horno y deje reposar.", "Mientras tanto, caliente una sartén hasta que esté caliente. Cepille las chuletas con aceite y sazone con sal y pimienta negra recién molida. Coloque en la plancha y cocine por un par de minutos en cada lado. Reserve para descansar por unos minutos.", "Para servir, corte los filetes de cordero y colóquelos en un plato con una chuleta de cordero, sirva con las papas nuevas, las judías verdes al lado y la salsa rociada."], "url": "www_bbc_co_uk_food_recipes_duo_of_lamb_with_paloise_18894", "title": "Dúo de cordero con salsa de paloise y patatas trituradas y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz pasas de Corinto", "175g / 6oz sultanas", "300ml10fl oz de té caliente fuerte Earl Grey", "275g / 9¾oz de harina de auto crianza", "225g / 8oz de azúcar mascabado ligero", "1 huevo grande de gallinas camperas, golpeado", "mantequilla, para engrasar, más extra para servir"], "method": ["Pon las grosellas y pasas en un tazón y vierte sobre el té caliente. Agitar, cubrir y dejar en remojo toda la noche para que el líquido absorba.", "Precaliente el horno a 150C / 130C Fan / Gas 3½. Engrase una lata de hogaza de 900g / 2lb y haga una línea con papel para hornear antiadherente.", "Agregue la harina, el azúcar y el huevo a la taza de fruta empapada (si hay un poco de exceso de líquido, esto está bien) y mezcle bien.", "Coloque la lata preparada y nivele la parte superior. Hornee por 1 o 2 horas, o hasta que la tarta se levante y firme al tacto, pero revísela después de 1 ¼ horas para ver cómo le está yendo. Dejar enfriar en la lata durante unos 10 minutos.", "Saca la tarta y quita el papel. Para servir, cortar en rodajas bastante gruesas y untar con mantequilla para servir."], "url": "www_bbc_co_uk_food_recipes_earl_grey_tea_bread_48452", "title": "Pan de té Earl Grey", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earl_grey_tea_bread_48452_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de ginebra", "35ml / 1½fl oz fuerte frío té Earl Grey", "20ml / ¾fl oz de jugo de limón", "12.5 ml / ½ fl oz de jarabe de azúcar (vendido como jarabe Gomme)", "½ huevo blanco de corral", "tuerza la cáscara de limón para adornar"], "method": ["Coloque la ginebra, el té Earl Grey, el jugo de limón, el jarabe de azúcar y la clara de huevo en una coctelera y agite bien.", "Doble el líquido en un vaso de Martini y decore con un toque de limón."], "url": "www_bbc_co_uk_food_recipes_earlgreymarteani_87394", "title": "Earl Grey martini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreymarteani_87394_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz Earl Grey hojas de té", "300 g / 10 oz de azúcar en polvo", "1 limón, solo jugo", "1 litro / 1¾ pintas de agua hirviendo", "Peras 700g / 1.5lb, peladas", "1 cucharada de hojas de té Earl Grey", "3 cucharadas de azúcar en polvo", "½ limón, solo jugo", "150 g / 5½ oz sultanas", "100g / 3½oz de almendras en copos, tostadas", "100g / 3½oz de azúcar moreno claro y suave", "1½ cucharadita de canela molida", "275g / 10oz de pasta de filo lista para usar", "1 cucharada colmada de azúcar glasé, más extra para quitar el polvo", "100 g / 3½ oz de mantequilla, derretida", "2-3 galletas de té ricas, desmenuzadas, para servir (opcional)"], "method": ["Para el sorbete, mezcle las hojas de té, el azúcar impalpable y el jugo de limón en un recipiente resistente al calor. Vierta sobre el agua hirviendo y déjela reposar durante al menos 30 minutos.", "Cuando la mezcla se haya mojado, cuela a través de un colador fino en una máquina para hacer helados. Revuelva la mezcla, de acuerdo con las instrucciones del fabricante, hasta que esté casi congelada, luego transfiera a un recipiente congelable y colóquelo en el congelador hasta que esté listo.", "(NB: Para hacer el sorbete sin una máquina para hacer helados, congele la mezcla en un recipiente freezable durante una hora, luego retírela y revuelva para romper los cristales de hielo. Repita el proceso de congelación y remoción 2-3 veces, hasta que el sorbete esté sólido congelado.)", "Mientras tanto, para el strudel, precaliente el horno a 190C / 375F / Gas 5.", "Coloque las peras en el fondo de una cacerola. Agregue las hojas de té, el azúcar impalpable y el jugo de limón, luego vierta suficiente agua fría para cubrir las peras. Llevar la mezcla a ebullición, revolviendo con cuidado.", "Cuando el líquido esté hirviendo, reduzca el fuego hasta que esté hirviendo a fuego lento. Cueza las peras durante 15-20 minutos o hasta que estén tiernas. Escurra las peras, enjuague las hojas de té que se peguen a ellas, luego déjelas a un lado para que se enfríen un poco.", "Cuando las peras se hayan enfriado, córtelos en cuartos, retire los núcleos, luego pique aproximadamente.", "En un tazón, mezcle las peras pochadas picadas, sultanas y almendras hasta que estén bien combinadas.", "Mezcle el azúcar morena suave y la canela molida, luego doble la mezcla en la mezcla de pera hasta que esté bien combinada.", "Coloque la masa de filo sobre una superficie de trabajo ligeramente espolvoreada con azúcar glas. Superponga las hojas de los pasteles ligeramente para formar un rectángulo de aproximadamente 40 cm x 30 cm / 16 pulgadas x 12 pulgadas. A medida que capas las hojas de hojaldre, cepilla cada hoja con la mantequilla derretida.", "Continúe agregando las capas restantes de pasta filo en capas, cepillando cada hoja con más de la mantequilla derretida, hasta que se use toda la masa y la mantequilla de filo.", "Espolvoree la mezcla de pera en el rectángulo de pasta filo, dejando 2,5 cm / 1 in libre en los bordes del rectángulo.", "Doble los bordes libres de los lados largos del rectángulo hacia atrás sobre la mezcla de pera. Comenzando en un extremo de los lados más cortos del rectángulo, enrolle la masa de filo y el relleno de pera para formar un rollo suizo.", "Transfiera el rollo de pasta filo a una bandeja para hornear y espolvoree todo con el azúcar glasé. Hornee en el horno durante 40-45 minutos, o hasta que la masa esté crujiente y dorada.", "Para servir, corte el strudel de canela y coloque una rebanada en el centro de cada plato de servir. Espolvoree algunos de los ricos bizcochos de té en una pila junto con el strudel. Coloque una bola del sorbete Earl Grey en la parte superior de las galletas ricas desmenuzadas de té."], "url": "www_bbc_co_uk_food_recipes_earlgreysorbetwithpe_92106", "title": "Sorbete Earl Grey con pera, Earl Grey y sándalo de canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreysorbetwithpe_92106_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 8oz de mantequilla ablandada", "150 g / 6 oz de azúcar en polvo", "2 yemas de huevo grandes de gallinas camperas", "Harina simple de 400g / 14oz, más extra para hacer harina", "1 cucharadita de especias mixtas", "1 cucharadita de canela molida de nivel", "2-4 cucharadas de leche", "100 g / 4 oz de grosellas", "un poco de azúcar en polvo, para rociar", "1-2 cucharaditas de jugo de limón", "250 g / 9 oz de azúcar glas", "aproximadamente 2 cucharadas de agua fría", "colorante de alimentos de diferentes colores"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente dos bandejas de hornear forradas con pergamino para hornear.", "Mida la mantequilla y el azúcar en un bol y bata hasta que estén suaves y esponjosos. Batir la yema de huevo. Tamizar en la harina y las especias y agregar suficiente leche para dar una masa bastante suave. Reúna, usando sus manos, para hacer una masa suave.", "Reduce a la mitad la mezcla y pon medio lado.", "Para las galletas de grosella tradicionales, agregue las pasas de Corinto a la mitad restante de la mezcla y amasar ligeramente en una superficie de trabajo ligeramente enharinada. Despliegue hasta un grosor de aproximadamente 5 mm / ¼ in. Cortar en rondas con un cortador circular. Coloque en las bandejas de hornear preparadas. Espolvorear con azúcar en polvo.", "Hornee en el horno precalentado durante 15 minutos, o hasta que estén pálidas doradas. Observe cuidadosamente los bizcochos, no importa si abre la puerta del horno para verificar. Espolvoree con azúcar en polvo y levante sobre una rejilla para que se enfríe. Almacenar en un recipiente hermético.", "Para las galletas heladas, amase la mitad restante de la mezcla de masa de galletas ligeramente en una superficie de trabajo ligeramente enharinada. Despliegue hasta un grosor de 5 mm / ¼ in. Corta galletas de Pascua con una variedad de cortadores en forma, como conejitos, huevos de Pascua, pollitos, flores de primavera.", "Engrase ligeramente dos bandejas para hornear forradas con pergamino para hornear.", "Coloque las formas de galletas en las bandejas de hornear preparadas y hornee en el horno precalentado durante 10-15 minutos. Retire del horno y levante sobre una rejilla para enfriar.", "Para hacer la formación de hielo, pasa una cucharadita de jugo de limón por un colador fino, para eliminar cualquier pepita o trocitos. Mezcle el azúcar glasé con el jugo de limón, y luego agregue aproximadamente dos cucharadas de agua, agregando poco a poco hasta que tenga un glaseado relativamente rígido pero suave. Agregue un poco de zumo de limón tamizado más si es necesario.", "Divida el glaseado en recipientes separados y mezcle los colorantes de alimentos de su elección en los cuencos de glaseado por separado, hasta que obtenga el tono deseado.", "Ponga un poco de glaseado en una manga pastelera y coloque sus decoraciones en los bizcochos. Para un acabado suave, puede canalizar el contorno de su diseño en la formación de hielo más firme, luego aflojarlo un poco mezclando un poco más de agua, dando a la formación de hielo más consistencia líquida, y utilizar esto para completar los diseños."], "url": "www_bbc_co_uk_food_recipes_easter_biscuits_37686", "title": "Galletas de Pascua", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace alrededor de 30 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_biscuits_37686_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "2 cucharaditas de jengibre molido", "2 cucharaditas de especias mixtas", "250 g / 9 oz de azúcar en polvo", "100ml / 3½fl oz de aceite de girasol", "4 huevos medianos de granja", "1-2 manzanas pequeñas de postre, aproximadamente 100 g / 3½ oz", "100 g / 3½ oz de jengibre cristalizado", "100 g / 3½ oz de grosella", "100g / 3½oz de fruta seca mixta", "Harina normal 300g / 10½ oz", "2 cucharaditas de polvo de hornear", "medio lote de glaseado de queso crema (vea la sugerencia de la receta superior a continuación)", "25 g / 1 oz de azúcar en polvo", "25 ml / 1 fl oz de agua"], "method": ["Alinee los bolsillos de una bandeja de muffins con fundas para muffins o envoltorios de papel, y precaliente el horno a 180C / 350F / Gas 4.", "Derrita la mantequilla con las especias en una sartén pequeña a fuego lento, luego vierta esto en un tazón con el azúcar y el aceite y mezcle bien. Batir los huevos hasta que estén suaves.", "Pelar las manzanas y rallarlas, descartando el núcleo y mezclar las manzanas con los otros ingredientes, seguido del jengibre cristalizado, las grosellas y la fruta seca mixta. Agregue la harina y el polvo de hornear de manera uniforme.", "Tres cuartos llene cada papel de muffin con cucharadas de la mezcla y hornee durante unos 25 minutos, o hasta que un pincho se salga casi limpio.", "Haga el jarabe hirviendo el azúcar con el agua en una olla pequeña hasta que se disuelva, luego deje que se enfríe. Cepíllalo sobre los pastelitos calientes.", "Cuando esté frío, pique cruza sobre los cupcakes con glaseado de queso crema antes de servir."], "url": "www_bbc_co_uk_food_recipes_easter_fruit_cupcakes_75736", "title": "Cupcakes de fruta de Pascua", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace alrededor de 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_fruit_cupcakes_75736_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz hueso de cordero deshuesado, cortado en trozos grandes", "150ml / 5fl oz de aceite de oliva virgen extra", "2 cebollas, más o menos picadas", "1 zanahoria grande, en rodajas", "1 tallo de apio, aproximadamente picado", "5 dientes de ajo, aplastados", "Filetes de anchoa de lata ½ x 50g / 2oz", "puñado de ramitas de tomillo", "1 chile rojo, en rodajas", "250ml / 9fl oz de vino blanco", "25ml / 1fl oz de vinagre de vino blanco", "250g / 9oz de guisantes frescos o congelados", "Papas de 400g / 14oz cortadas en cuartos", "200g / 7oz de tomates cherry, cortados a la mitad", "sal y pimienta negra recién molida", "6 porciones de pan fresco, para servir"], "method": ["Sazonar los trozos de cordero con sal y pimienta negra. Dejar de lado.", "Calentar el aceite de oliva en una sartén con tapa grande y freír las cebollas, la zanahoria y el apio durante 4-5 minutos, o hasta que se ablanden. Agregue el ajo, las anchoas, el tomillo y el chile, y continúe cocinando, revolviendo, hasta que las anchoas casi se hayan disuelto en el aceite. Agregue los trozos de cordero y fría por otros 4-5 minutos, o hasta que se doren por todos lados.", "Agregue el vino y continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el vinagre. Reduzca el fuego a bajo, tape y cocine a fuego lento por 20 minutos.", "Agregue los guisantes, las papas y los tomates, cubra nuevamente y continúe cocinando durante aproximadamente una hora, hasta que la salsa se haya reducido a la mitad.", "Sirva caliente con abundante pan para limpiar la salsa."], "url": "www_bbc_co_uk_food_recipes_easter_lamb_with_peas_10766", "title": "Cordero de Pascua con guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lamb_with_peas_10766_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "Azúcar en polvo 350g / 12oz", "2 cucharaditas de vinagre de vino blanco", "Harina de maíz de 2 niveles de cucharadita", "6 yemas de huevo de gallinas camperas", "Azúcar en polvo 350g / 12oz", "4 limones, solo jugo", "225g / 8oz de mantequilla", "Crema doble 450ml / ¾pint", "30 mini-huevos de chocolate", "100 g / 3½ oz de azúcar en polvo, más extra para cubrir la ralladura", "4 limones, solo cáscara (en tiras largas y delgadas)"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Coloque un trozo de papel de hornear en una bandeja para hornear y dibuje un círculo de 25 cm.", "Coloque las claras de huevo en un recipiente y bata a la velocidad más rápida con un batidor de mano eléctrico o en una batidora eléctrica hasta que estén firmes. Poco a poco, batiendo a máxima velocidad, agregue generosas cucharaditas de azúcar hasta que la mezcla esté tieso y brillante y se encuentre en picos.", "Mezcle el vinagre y la harina de maíz en una taza y mezcle hasta que quede suave. Revuelva esto en la mezcla de merengue.", "Extienda la mitad de la mezcla de merengue sobre el papel para obtener un círculo de 25 cm. Llene una manga pastelera, equipada con una boquilla rosa, con el resto de la mezcla de merengue. Cuidadosamente canalice alrededor de 10 pequeños nidos separados colocados igualmente alrededor del borde del círculo.", "Deslice el merengue en el medio del horno, baje la temperatura a 150C / 300F / Gas 2 y hornee durante 1½-2 horas (verifique después de una hora), o hasta que se desprenda fácilmente del papel. El pavlova será de un color cremoso pálido en lugar de blanco. Apague el horno y deje el pavlova en el horno para que se enfríe.", "Mientras tanto, haz la cuajada de limón para el relleno. Coloque un recipiente resistente al calor sobre una fuente de agua caliente, hirviendo a fuego lento sobre la estufa. Agregue las yemas de huevo, el azúcar y el jugo de limón al bol y mezcle. Poco a poco agregue la mantequilla, batiendo continuamente hasta que empiece a espesar. Debe cubrir la parte posterior de una cuchara cuando alcanza la consistencia correcta. Se consolidará aún más una vez que se haya enfriado.", "Batir la crema doble en un tazón grande hasta que espese, luego agitar a través de la cuajada de limón enfriada.", "Con una cuchara, coloque la mezcla de requesón y crema de limón en el centro de la pavlova y extiéndala sobre la base del nido de merengue. Coloque un relleno de limón en cada uno de los mini nidos. Decora colocando tres mini-huevos de chocolate en cada uno de los 10 mini-nidos alrededor del borde del postre.", "Ponga 100 ml / 3½ fl oz de agua y el azúcar impalpable en una sartén. Llevar a ebullición, revolviendo. Agregue la ralladura y hierva por 2-3 minutos, o hasta que esté almibarado. Escurra en papel pergamino, agregue azúcar extra y deje secar en un lugar cálido durante un par de horas o durante la noche. Coloque un delicado montículo de cáscara confitada en el medio de la pavlova y sirva."], "url": "www_bbc_co_uk_food_recipes_easter_lemon_pavlova_99601", "title": "Pavlova de limón de Pascua", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lemon_pavlova_99601_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 ml / 20 fl oz de leche.", "900g / 2lb de harina blanca fuerte", "pizca de sal", "Levadura de acción rápida de 14 g / ½ oz (2 sobres)", "30g / 1oz de mantequilla", "aceite, para engrasar", "6 huevos de gallinas camperas, más 1 huevo batido para glasear", "18 grosellas"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6. Línea 3 bandejas para hornear con papel de hornear antiadherente.", "Calienta suavemente la leche hasta que esté tibia. Mida la harina en un tazón grande, agregue la sal a un lado del tazón y la levadura en el lado opuesto. Frote la mantequilla con la punta de los dedos. Vierta la leche tibia y mezcle para combinar. Transfiera la mezcla a un mezclador independiente equipado con un gancho de masa. Amasar hasta que salga del lado del recipiente y forme una bola de masa. Alternativamente, incline la mezcla sobre una superficie de trabajo enharinada y amasar la masa durante 10 minutos, o hasta que esté suave y elástica al tacto.", "Coloque la masa en un recipiente ligeramente engrasado y cúbralo con una película adhesiva. Dejar de lado hasta duplicar su tamaño. Esto llevará menos de una hora en un lugar cálido.", "Una vez que la masa haya demostrado, quítela cuidadosamente del cuenco (espere que la masa se colapse una vez que se haya tocado). Coloque sobre una superficie ligeramente enharinada y divídala en 6 piezas iguales.", "Con los dedos o un rodillo, enrolle la masa en forma de rectángulo más plano (aproximadamente 2.5 cm / 1 pulgada de grosor). Coloque un huevo (todavía en su caparazón) en el medio presionando ligeramente hacia abajo. Imagine la masa como un reloj, hace hendiduras cortas a las 2, 4, 6, 8 y 10 en punto. Estire la masa para formar las piernas y los brazos y forme la parte superior en un círculo para formar una cabeza. Levante los brazos y asegure sobre el huevo. Usa las grosellas para hacer ojos y una sonrisa. Glaseado con huevo batido. Repita con la masa restante.", "Coloque cada 'hombre' en la bandeja de horneado preparada (se expandirán a medida que se cocinen, así que es mejor colocar 2 en cada bandeja). Hornee por 25 minutos, o hasta que estén doradas.", "Sirve caliente. Retire el huevo y rompa la cáscara para liberar el huevo duro. Sirve con un poco de mantequilla."], "url": "www_bbc_co_uk_food_recipes_easter_men_31265", "title": "Hombres de Pascua", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 6 pan 'hombres'", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 4oz de cerezas heladas", "225g / 8oz de mantequilla, ablandada", "225g / 8oz de azúcar mascabado ligero", "4 huevos grandes", "Harina de levante 225g / 8oz", "225 g / 8oz sultanas", "100 g / 4 oz de grosellas", "50g / 2oz de cáscara confitada picada", "2 limones, ralladura ralladura solamente", "2 cucharaditas de especias mixtas molidas", "Mazapán de 450g / 1lb", "1-2 cucharadas de mermelada de albaricoque, calentado"], "method": ["Precaliente el horno a 150 ° C / 280 ° F / Gas 2. Engrase y forme una lata de torta de 20 cm / 8 in.", "Cortar las cerezas en cuartos, poner en un colador y enjuagar con agua corriente. Escurra bien, luego séquese bien en papel de cocina.", "Coloque las cerezas en un tazón con la mantequilla, el azúcar, los huevos, la harina, las pasas, la cáscara confitada, la ralladura de limón y la mezcla de especias, y batir bien hasta mezclar bien. Vierta la mitad de la mezcla en la lata preparada.", "Tome un tercio del mazapán y extiéndalo en un círculo del tamaño de la lata y luego colóquelo sobre la mezcla de la torta. Vierta la mezcla restante de la torta en la parte superior y nivele la superficie.", "Hornee en el horno precalentado durante aproximadamente 2 horas y media o hasta que esté bien levantado, uniformemente dorado y firme al tacto. Cubra con papel de aluminio después de una hora si la parte superior se está dorando demasiado rápido. Deje que se enfríe en la lata durante 10 minutos, luego sáquelo, despegue el pergamino y termine de enfriar en una rejilla de alambre.", "Cuando el pastel esté frío, cepille la parte superior con un poco de mermelada de albaricoque caliente y extienda la mitad del mazapán restante para que se ajuste a la parte superior. Presione firmemente en la parte superior y engarce los bordes para decorar. Marque un patrón entrecruzado en el mazapán con un cuchillo afilado. Forme el mazapán restante en 11 bolas.", "Cepille el mazapán con huevo batido y coloque las bolas de mazapán en el borde del pastel. Cepille la parte superior de las bolas con huevo batido y luego coloque cuidadosamente la torta debajo de una parrilla caliente hasta que la parte superior esté ligeramente tostada."], "url": "www_bbc_co_uk_food_recipes_easter_simnel_cake_82449", "title": "Pastel de Pascua simnel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace un pastel", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_cake_82449_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de sal", "½-1 naranja, solo ralladura", "6 bayas de enebro, aplastadas", "1 palo de canela, aplastado", "2 cucharaditas de pimienta de Jamaica", "azúcar pizca", "700g / 1lb 9oz de cerdo lejos", "1 pastinaca grande, pelada y cortada en dados grandes", "600ml / 21fl oz de caldo de pollo, más extra para la salsa", "1 cucharada de azúcar glas", "harina de patata (harina de patata)", "1 budín negro (2cm / ¾pulg. Grueso, 12cm / 4½pulgada), cortado en cubitos", "botón de mantequilla", "pizca de crema", "2 cucharadas de perejil picado", "8 lanzas de espárragos de la nueva temporada", "4 piezas de corteza de cerdo frita, para adornar", "300g / 11oz repollo de enero rey, en rodajas finas", "30 g / 1 oz de sal", "50g / 1¾oz de tocino ahumado lardons", "5g de ajo asado", "25ml / 1fl oz de vinagre de arroz", "2 pizcas de comino", "pizca de sal, al gusto"], "method": ["Para el lomo de cerdo, mezcle la sal, la ralladura de naranja, el enebro, la canela, la pimienta de Jamaica y una pizca de azúcar. Frota esto sobre el lomo de cerdo. Envuélvela bien en film transparente y déjala marinar en la nevera durante tres días.", "Para el repollo picante, cuando esté listo para cocinar, mezcle los 30g / 1oz de sal con el repollo en rodajas y deje a un lado durante 30 minutos.", "Mientras tanto, ponga el cerdo en una olla a presión con la chirivía y el caldo en cubos y cocínelo durante 25 minutos.", "Retire la carne de cerdo de la olla. Permita que descanse durante cinco minutos, luego espolvoree con azúcar glas y glasee con un soplete.", "Para hacer la salsa, vierta los jugos de cocción extra del cerdo en una sartén pequeña, agregue un poco más de caldo y lleve a ebullición, espese ligeramente con la fécula (almidón de patata) y pase por un colador fino. Agregue la morcilla en cubitos. Reserva.", "Retire las chirivías y aplastar con un tenedor, agregue un poco de mantequilla y unas gotas de crema. Mezcle el perejil y reserve.", "Cocine las lanzas de espárragos en agua hirviendo con una pizca de sal y azúcar.", "Para cocinar el repollo picante, lave bien el repollo y séquelo bien.", "En una sartén de fondo grueso, fríe con cuidado el tocino, agrega el ajo asado, luego la col, el vinagre de arroz y el comino. Mezcle bien y sazone al gusto con sal.", "Revuelva bien y cocine durante dos minutos, o hasta que el repollo esté tierno. Verifique el condimento de nuevo y reserve.", "Para servir, coloque el repollo picante en el centro del plato. Tallar la carne de cerdo en dos rebanadas por porción y colocarla en la parte superior. Coloque la chirivía triturada a la derecha y adorne con espárragos. Cuchara en la salsa y black pudding. Adorne con la corteza de cerdo y sirva."], "url": "www_bbc_co_uk_food_recipes_easter_spiced_pork_loin_42095", "title": "Lomo de cerdo con especias con salsa de budín negro, espárragos y repollo sazonado de enero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche entera o doble crema", "1 palito de canela, aplastado", "media nuez moscada, rallada", "75g / 2¾oz de azúcar mascabado", "300 g / 10% C2% BDoz% 20dark% 20chocolate% 20 (preferiblemente% 20 con% 2062 %% 20 o% 20more% 20cocoa% 20solids),% 20finely% 20chopped", "5 cucharaditas de brandy", "Mazapán 100g / 3½ oz", "100 g / 3½ oz de cacao en polvo", "100g / 3½oz de azúcar glasé", "25 g / 1 oz de canela molida", "10g / ¼ oz de nuez moscada molida", "400 g / 14 oz de chocolate negro, derretido y templado"], "method": ["Para el ganache, ponga la leche o la crema, las especias y el azúcar en una cacerola y cocine a fuego lento. Coloque el chocolate picado en un recipiente resistente al calor. Retire la leche especiada del fuego y cuele a través de un colador fino sobre el chocolate picado. Batir hasta que quede suave, luego agregar el brandy y batir de nuevo. Vierta en un recipiente de plástico y refrigere por una hora, o hasta que esté listo.", "Ruede el mazapán en pequeñas bolas del tamaño de una avellana. Cubra las bolas de mazapán en el ganache establecido y colóquelas en una bandeja.", "Para el recubrimiento, coloque el cacao en polvo, el azúcar glas, la canela y la nuez moscada molida en un bol.", "Derrite y atempere el chocolate oscuro, rompiendo el chocolate en trozos pequeños y parejos y derretiéndolo suavemente en un recipiente sobre una cacerola de agua caliente, no hirviendo. Coloque un termómetro de cocción en el chocolate y continúe calentando hasta que alcance los 43 ° C / 110 ° F. Retirar del fuego y enfriar a 35C / 95F. Ahora está listo para usar.", "Con los dedos, sumerja cada trufa en el chocolate derretido y templado y sumérjala en la mezcla de cacao en polvo, rodando hasta que la trufa esté completamente cubierta. Dejar de lado para enfriar en un plato.", "Coma las trufas a temperatura ambiente, por lo que son muy suaves por dentro."], "url": "www_bbc_co_uk_food_recipes_easter_simnel_truffles_05358", "title": "Trufas de Pascua simnel", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace aproximadamente 30 trufas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_truffles_05358_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar en polvo de 110 g / 4 oz, más extra para quitar el polvo", "110g / 4oz de mantequilla, ablandada a temperatura ambiente", "1 huevo de corral, separado", "Harina normal 225g / 8oz, tamizada", "buena pizca de especias mixtas", "55g / 2oz pasas de Corinto", "30g / 1oz de cáscara confitada", "3 cucharadas de leche"], "method": ["Precaliente el horno 160C / 325F / Gas 3. Cubra una bandeja de hornear con papel resistente a la grasa.", "Bata la mantequilla y el azúcar en un tazón hasta que estén suaves y esponjosos. Batir la yema de huevo hasta que esté bien combinada.", "Dobla la harina en la mezcla, luego agrega la mezcla de especias, grosellas y cáscara confitada. Agregue suficiente leche para formar una masa dura.", "Ruede la masa sobre una superficie enharinada y corte los bizcochos con un cortador acanalado. Coloque en la bandeja para hornear y hornee durante 10 minutos.", "Retire las galletas del horno, cepille con la clara de huevo reservada, espolvoree con azúcar y vuelva al horno de 5 a 10 minutos, o hasta que esté pálido dorado.", "Retire los bizcochos de la bandeja y déjelos a un lado para que se enfríen en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_easterbiscuits_67742", "title": "Bizcochos de Pascua garibaldi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 20-25 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easterbiscuits_67742_16x9.jpg", "isVegetarian": true, "recommendations": 0}]