[{"isVegetarian": false, "title": "Indian stuffed sea bass with a tomato patia", "url": "www_bbc_co_uk_food_recipes_kolmi_ni_bharaei_34818", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lime, juice only", "2 tbsp turmeric powder", "4 small whole sea bass or brill, weighing approximately 300-350g/10½ -12oz each, butterflied, head left on (preferably), you can ask your fishmonger to do this for you", "500g/1lb 2oz prawns, deveined and chopped", "2-3 green chillies, chopped", "5cm/2in piece ginger, finely chopped", "15-20 fresh mint leaves, chopped", "6-8 coriander stalks with leaves, chopped", "½ tsp salt\t", "vegetable oil, for frying", "3 tbsp vegetable oil", "cinnamon stick, approximately 7cm/2¾in ", "2 onions, finely chopped", "1 heaped tsp red chilli powder", "2 tsp cumin powder", "1 tbsp coriander powder", "2 tbsp cider vinegar", "5cm/2in piece ginger, chopped", "3 garlic cloves, chopped", "3 fresh green chilli, roughly chopped", "4 medium tomatoes, chopped", "2-3 tbsp tamarind pulp", "5cm/2in piece jaggery or cane sugar", "2 tbsp chopped coriander", "steamed rice", "chapattis", "4 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Blend half of the lime juice with the turmeric. Apply inside all of the fish and set aside.", "Put the prawns and the remaining ingredients (apart from the oil) in a blender and blend together. Season with more salt if required and add the remaining lime juice. Fill each fish with the prawn mixture. Press the fish down to get a straight shape and transfer to the fridge.", "Meanwhile, make the patia. Heat the oil in a deep saucepan and add the cinnamon and cook for 30 seconds. Add the onions and sauté until soft and brown, stirring regularly.", "Meanwhile blend the dry powders in a small bowl with the vinegar and a little water to make a smooth paste. Cover and set aside.", "When the onions are brown add the ginger, garlic and chillies. Sauté for 2-3 minutes. Add a little water to the pan to release any sugars from the onion stuck to the bottom of the pan.", "Add the blended powders to the pan. When the mixture becomes dry add the tomatoes, tamarind and jaggery and cook gently for a further 4-5 minutes. Season with salt, add the coriander and remove from the heat. ", "Preheat the oven to 160C/140C Fan/Gas 3.  ", "To cook the fish, heat the oil in a large frying pan with an oven-proof handle. Carefully add the fish to the pan and cook over a medium heat. When the fish has browned on one side, turn it over. The best way is to turn the fish from the centre and keep either a fork or a spatula on top and a flat fish slice or spatula at the bottom.", "When both sides of the fish are brown, place in the oven for 10-12 minutes until cooked through. ", "Divide the fish between 4 plates and pour over the patia. Sprinkle the coriander on top and serve with steamed rice or warm chapattis."]}, {"isVegetarian": false, "title": "Korean bulgogi chicken stir-fry", "url": "www_bbc_co_uk_food_recipes_korean_bulgogi_chicken_43080", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/korean_bulgogi_chicken_43080_16x9.jpg", "ingredients": ["3 garlic cloves, peeled ", "½ onion ", "½ pear, cored", "5 tbsp soy sauce", "3 tbsp caster sugar", "2 tbsp sesame oil", "3 tbsp mirin ", "pinch cracked  black pepper", "2 large chicken breasts, cut into thin strips", "220g/8oz brown rice", "2 tbsp groundnut oil", "4 free-range eggs", "200g/7oz ready-made kimchi, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the marinade, blitz the garlic, onion and pear in a food processor and place in a bowl. Add the soy, sugar, 5 tablespoons water, sesame oil, mirin and pepper and mix well. Add the chicken and stir to combine. Cover and leave to marinate in the fridge for an hour.", "After half an hour, bring a pan of water to the boil, add the rice and cook for 25 - 30 minutes, or until tender. Drain and set aside. ", "Heat a wok on a high heat and stir-fry the chicken for 4 - 5 minutes, until cooked through and browned. ", "Meanwhile, heat the oil in a large frying pan and break the eggs in. Fry to your liking, basting the yolk with the oil to make sure it’s cooked. ", "To serve, place the rice in a bowl and top with the chicken, fried egg and a spoonful of kimchi. "]}, {"isVegetarian": false, "title": "Korean fried chicken", "url": "www_bbc_co_uk_food_recipes_korean_fried_chicken_51459", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/korean_fried_chicken_51459_16x9.jpg", "ingredients": ["8–10 chicken pieces (thighs work best), boneless, skin removed", "100g/3½oz caster sugar", "75g/2½oz sea salt", "200ml/7fl oz hot water", "2 heaped tbsp plain flour ", "1 tbsp cornflour", "1 tsp baking powder", "1 tsp salt", "125g/4½oz plain flour", "25g/1oz cornflour", "½ tsp salt", "½ tsp baking powder", "100ml/3½fl oz vodka", "100ml/3½fl oz soy sauce", "25ml/1fl oz mirin", "25ml/1fl oz rice wine vinegar", "2cm/¾in piece fresh root ginger, grated", "2 garlic cloves, grated", "50g/1¾oz brown sugar", "few drops of sesame oil", "1 tsp cornflour", "sesame seeds, for sprinkling", "2 tbsp Korean chilli paste (gochujang if you can get it)", "1 tbsp hot sauce", "1 tsp rice wine vinegar", "1 tbsp honey", "few drops of sesame oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Start by brining the chicken. Dissolve the sugar and salt in the hot water, then mix1 litre/1¾ pint cold water into the brine solution. Submerge the chicken and leave to stand, covered, for 2 hours. Meanwhile, make the sauces.", "For the sweet soy sauce, put the soy, mirin, rice wine vinegar, ginger, garlic and sugar into a saucepan. Stir over a low heat until the sugar is dissolved and simmer for 2 minutes. Taste for seasoning and add a little salt if necessary. Add sesame oil to taste. Whisk the cornflour with a little cold water until you have a smooth but very runny paste, then whisk this into the sauce over a low heat, until the sauce thickens very slightly. Set aside.", "For the chilli sauce, whisk all the ingredients together, thinning with a little water if too thick. Taste and add salt if necessary.", "To cook the chicken, drain and rinse the brined chicken thoroughly, then pat dry. Make the first coating (this is the coating the batter will stick to, otherwise it tends to fall off) by whisking the flour, cornflour, baking powder and salt together. Dust the chicken in this mixture, patting off any excess, and leave to stand while you make the batter.", "For the batter, whisk together the dry ingredients, then whisk in 100ml/3½ cold water and the vodka – the texture should be quite thin, like double cream.", "Add oil to your fryer, large saucepan or wok, making sure you don’t fill it beyond half way. Heat the oil to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the chicken pieces in the batter one at a time. Allow any excess to drip off over the bowl, then slowly lower into the hot oil, letting go when the chicken piece is almost submerged. Fry for 8–10 minutes, then drain and put on kitchen paper – the chicken should be cooked through but have barely taken on any colour. Turn the heat up to 190C, or if using a saucepan, turn the heat up and leave for around 5 minutes to reach the right temperature. Fry the chicken for another 2 minutes, or until it has darkened. Remove and drain thoroughly on kitchen paper. It should be beautifully crisp. You can serve it with the sauces, or you can brush some of the soy-based sauce over it and serve with the chilli sauce. "]}, {"isVegetarian": false, "title": "Korean grilled beef short ribs (galbi gui)", "url": "www_bbc_co_uk_food_recipes_korean_grilled_beef_72703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz beef short ribs, LA or flanken cut, rinsed", "5 tbsp soy sauce", "2 tbsp roasted sesame seed oil", "3 tbsp runny honey", "2 tbsp mirin", "½ Asian or 1 regular pear, peeled, cored and roughly chopped", "½ onion, roughly chopped", "6 garlic cloves, crushed", "4cm/1½in piece fresh root ginger, peeled and finely grated", "½ tsp freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the ribs in a deep baking tray. Fill with enough water to submerge them, cover, then soak for 30–45 minutes, changing the water once or twice. Drain.", "Meanwhile, put all the remaining ingredients in a food processor and blend until smooth. Put the soaked ribs and marinade in a baking tray or wide, flat bowl. Using your hands, massage the sauce into the meat. Cover and refrigerate overnight.", "If cooking on the hob, put a heavy grill pan over a medium-high heat. When hot, add the ribs to the pan in batches and cook for 6 minutes on each side. ", "If barbecuing, place the grill 12–15cm/5–6in above the flame. Cook the ribs for 6 minutes on each side, turning every now and again to cook them evenly, until they are caramel-brown and slightly charred in places.", "Once cooked, use a pair of scissors to cut off the strip of bones and discard, then snip the meat into bite-size pieces. Serve immediately."]}, {"isVegetarian": false, "title": "Kotlets with herb salad", "url": "www_bbc_co_uk_food_recipes_kotlets_with_herb_salad_24141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kotlets_with_herb_salad_24141_16x9.jpg", "ingredients": ["750g/1lb 10oz potatoes, ideally Desiree, unpeeled and washed", "2 free-range eggs", "400g/14oz beef mince", "1 onion, grated", "1 tsp ground turmeric", "1 tsp ground cumin", "good grating fresh nutmeg", "½ tsp ground cinnamon ", "vegetable oil, for shallow frying", "50g/1¾oz plain flour", "100g/3½oz sesame seeds ", "salt and freshly ground black pepper", "15g/½oz fresh basil, leaves picked", "25g/1oz fresh parsley, leaves picked", "15g/½oz fresh mint, leaves picked ", "4 tomatoes, deseeded and roughly chopped", "175g/6oz gherkins, chopped ", "½ cucumber, deseeded and sliced ", "½ lemon, juice only", "4 tbsp extra virgin olive oil "], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the potatoes in a medium saucepan. Cover with boiling water and simmer for 35–50 minutes, or until tender to the tip of a knife.", "Remove from the heat, drain and leave to cool. Peel off the skins and discard. Grate the potatoes into a large bowl, crack in the eggs and add the beef, onion and spices. Season well and mix with your hands.", "Divide the mixture into 20 balls, then flatten and shape each one into a teardrop. ", "Heat the oil in a large frying pan over a medium heat. ", "Combine the flour and sesame seeds on a plate. Coat each kotlet in the floury mixture, shaking off any excess, then fry in batches for 3–4 minutes on each side, or until golden brown and cooked through. Drain on kitchen paper. ", "To make the salad, mix all the ingredients together. Serve alongside the kotlets."]}, {"isVegetarian": false, "title": "Kozani chicken with prunes, saffron and paprika", "url": "www_bbc_co_uk_food_recipes_kozani_chicken_with_86508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kozani_chicken_with_86508_16x9.jpg", "ingredients": ["8 chicken thighs, skin removed", "pinch of Kozani saffron (or Spanish saffron)", "4 tbsp olive oil", "3 red onions, thinly sliced", "1½ tbsp sweet paprika", "20 pitted prunes", "1 tsp salt", "6 turns black peppermill"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken thighs in a large saucepan with 1 litre/1¾ pint water and the saffron. Bring to the boil, then reduce the heat and poach for 10–15 minutes. Drain, reserving the cooking liquid.", "Heat the oil in a large saucepan over a medium-low heat and sweat the onion gently until very soft, about 10 minutes. ", "Add the paprika, cook for 2 minutes. Add the chicken thighs, about 700ml/1¼ pint of the cooking liquid and the prunes. Season with the salt and pepper and simmer for about 20 minutes, until heated through.", "If the sauce is very watery, remove the chicken, prunes and onions with a slotted spoon and keep warm while you reduce down the sauce, so that you have a small amount to spoon over each portion.", "Serve with pilaf rice. "]}, {"isVegetarian": true, "title": "Kouign amann", "url": "www_bbc_co_uk_food_recipes_kouign_amann_09102", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kouign_amann_09102_16x9.jpg", "ingredients": ["300g/10½oz strong plain flour, plus extra for dusting", "5g fast-action yeast ", "1 tsp salt", "200ml/7fl oz warm water", "25g/1oz unsalted butter, melted", "250g/9oz cold unsalted butter, in a block", "100g/3½oz caster sugar, plus extra for sprinkling"], "serves": "Makes 12 pastries", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour into the bowl of a freestanding mixer fitted with a dough hook. Add the yeast to one side of the bowl and the salt to the other. Add the water and melted butter and mix on a slow speed for two minutes, then on a medium speed for six minutes.", "Tip the dough onto a lightly floured work surface and shape into a ball. Put into a lightly oiled bowl. Cover with cling film and leave to rise for one hour.  ", "Sandwich the butter between two sheets of greaseproof paper and bash with a rolling pin, then roll out to a 14cm/5½in square. Place in the fridge to keep chilled. ", "On a lightly floured surface, roll out the dough to a 20cm/8in square. Place the butter in the centre of the dough diagonally, so that each side of butter faces a corner of the dough. Fold the corners of the dough over the butter to enclose like an envelope.", "Roll the dough into a 45x15cm/18x6in rectangle. Fold the bottom third of dough up over the middle, then fold the top third of the dough over. You will now have a sandwich of three layers of butter and three layers of dough. Wrap in cling film and place in the fridge for 30 minutes. This completes one turn. ", "Repeat this process twice more, so you have completed a total of three turns, chilling the dough for 30 minutes between turns.  ", "Roll the dough into a rectangle as before. Sprinkle the dough with the caster sugar and fold into thirds again. Working quickly, roll the dough into a large 40x30cm/16x12in rectangle. Sprinkle the dough with caster sugar and cut the dough into 12 squares. ", "Grease a 12-cup muffin tin well with oil. Gather the dough squares up by their four corners and place in the muffin tins, pulling the four corners towards the centre of the muffin tin, so that it gathers up like a four-leaf clover. Sprinkle with caster sugar and leave to rise, covered with a clean tea towel, for 30 minutes until slightly puffed up.  ", "Preheat oven to 220C/200C(fan)/425F/Gas 7. Bake the pastries for 30-40 minutes, or until golden-brown. Cover with foil halfway through if beginning to brown too much. Remove from the oven and leave to cool for a couple of minutes before turning out onto a wire rack. Be careful not to burn yourself on the caramelised sugar, but don’t leave them to cool for too long, or the caramelised sugar will harden and they will be stuck in the tin.", "Serve warm or cold. "]}, {"isVegetarian": true, "title": "Kroppkakor (Swedish dumplings)", "url": "www_bbc_co_uk_food_recipes_kroppkakor_swedish_32501", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kroppkakor_swedish_32501_16x9.jpg", "ingredients": ["900g/2lb potatoes (about 10 medium-sized potatoes)", "200g/7oz plain flour", "1 free-range egg and 2 egg yolks", "1 tbsp sea salt", "knob of butter", "400g/14oz button mushrooms, finely chopped", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "1 sprig of thyme, leaves only, finely chopped", "pinch allspice", "salt and freshly ground black pepper ", "50g/1¾oz butter, plus extra for frying", "100g/3½oz frozen lingonberries, defrosted ", "2 tsp sugar", "400g/14oz wild mushrooms"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Bake the potatoes on a tray for 1 hour until cooked through. (Test by piercing a small knife or fork into the centre of the potato. When soft they are done.) ", "Meanwhile, to make the mushroom duxelle filling, heat the butter in a pan. Gently fry the mushrooms, shallots, garlic, thyme and allspice. Season with salt and pepper to taste. Cook until the liquid that comes out of the mushrooms has evaporated and the mixture is almost dry. Set aside and leave to cool.", "Once cool enough to handle, roll into 2cm/¾in balls. Chill in the fridge until the potatoes are cooked. ", "Once the potatoes are cooked, peel them and pass through a potato ricer or use a potato masher to create a smooth mash.", "Add the flour, egg, egg yolks and salt, and mix. Divide the dough into walnut-sized portions. Place the prepared mushroom filling into the centre of each dough ball. Cover your hands in flour, and carefully work the dough around the mushroom mixture until it is completely encased within the dough. Each dumpling should be about the size of a golf ball. ", "Cook the dumplings in a large pan of boiling water. Simmer until they start to float to the surface. This can be a little tricky if some of them have air pockets, but they should be ready in around 6–8 minutes. Once cooked, strain the dumplings and leave to cool slightly. ", "Heat a knob of butter in a large pan and carefully sear the dumplings. Remove from the pan and set aside.", "Mix the defrosted lingonberries with the sugar and set aside. ", "Heat a little more butter in a pan and gently fry the mushrooms for a couple of minutes. Remove from the pan and set aside. ", "In the same pan, melt 50g/1¾oz of butter over a high heat until it starts to smell nutty and turn brown. Turn off the heat and remove from the pan so it doesn’t burn.", "Divide the dumplings between 4 plates, garnish generously with the wild mushrooms and lingonberries, and pour the brown butter over to finish."]}, {"isVegetarian": true, "title": "Lace pancakes", "url": "www_bbc_co_uk_food_recipes_lace_pancakes_20045", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lace_pancakes_20045_16x9.jpg", "ingredients": ["175g/6oz plain flour ", "1 large free-range egg ", "1 large egg yolk ", "300ml/10fl oz milk ", "25g/1oz unsalted butter, melted "], "serves": "Makes 12 pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour into a large bowl and make a well in the middle. In a separate bowl or jug, whisk together the egg, egg yolk and a few tablespoons of the milk, then pour into the well. ", "Whisk gently, gradually whisking in half of the remaining milk, drawing in the rest of the flour a little at a time, to make a smooth batter. Stir in the remaining milk. Cover and leave to stand for about 15 minutes. Pour the batter into a plastic squeezy bottle. ", "Heat a frying pan over a medium heat and brush with a little melted butter. Tilt the squeezy bottle and draw a freehand lace heart pattern in the pan using the batter. ", "Cook the pancake over a medium-high heat for 45-60 seconds until small holes appear on the surface and the underside is lightly browned. Loosen the pancake and turn it over by flipping it with a palette knife or fish slice. ", "Cook the other side for about 30 seconds until golden-brown. Slide the pancake out of the pan. ", "Lightly grease the pan again before making the next pancake. Serve the pancakes as they are made, or stack them on a plate and reheat before serving. (If the pancakes are hot when you stack them they will not stick together; there is no need to interleave them with greaseproof paper.)"]}, {"isVegetarian": true, "title": "Lacy pancakes with fruit compôte and vanilla cream", "url": "www_bbc_co_uk_food_recipes_lacypancakeswithfrui_65537", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz plain flour ", "pinch of salt ", "2 large eggs ", "200ml/7fl oz milk mixed with 75ml/2fl oz water ", "2 tbsp melted butter ", "290ml/½ pint double cream whipped ", "1 vanilla pod seeds removed ", "2 tsp icing sugar ", "200g/7oz frozen mixed fruits ", "30g/1oz icing sugar ", "1 tsp dark rum"], "serves": "Makes 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and add the salt. ", "Mix in the eggs, then the milk and water mixture. ", "Add the butter just before using the batter. ", "Heat a frying pan and rub with oil. Using the batter, for each pancake, make a circle around the edge of the pan and then drizzle the mixture all over the middle of the pan to form a lacy pancake. When cooked, keep warm. Separate the pancakes with layers of greaseproof paper. ", "Make the compote: place the fruits, sugar and rum in a pan and cook for few minutes. Use a slotted spoon to remove the fruit from the pan, leaving behind the juices ", "Whip the cream with the vanilla seeds. ", "Place the fruits in the centre of each pancake and roll. ", "Serve with vanilla cream and drizzle over some of the remaining fruit juices."]}, {"isVegetarian": false, "title": "La gran lasagna", "url": "www_bbc_co_uk_food_recipes_lagranlasagna_87680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lagranlasagna_87680_16x9.jpg", "ingredients": ["125ml/4½fl oz olive oil", "2 medium onions, finely chopped", "4 x 400g/14oz cans whole plum tomatoes", "salt and freshly ground black pepper ", "large handful fresh basil leaves, roughly torn", "250g/9oz minced beef", "250g/9oz minced pork", "4 garlic cloves, finely chopped", "3 tbsp roughly chopped fresh parsley", "1 free-range egg, beaten", "olive oil, for frying", "flour, for dusting", "500g/1lb 2oz fresh lasagne sheets", "200g/7oz parmesan, grated", "4 hard-boiled free-range eggs, sliced", "200g/7oz ricotta cheese", "4 mozzarella balls, roughly chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the olive oil in a large pan, add the onions and fry gently until softened.", "Add the tomatoes, season with salt and freshly ground black pepper and stir in the basil. Reduce the heat and simmer gently for about 25 minutes, or until the tomatoes have broken down and the sauce is reduced. Set aside.", "For the meatballs, place all the meatball ingredients, except the oil and flour, into a bowl and mix well. Using your hands, shape the mixture into walnut-sized balls.", "Heat a generous amount of olive oil in a large frying pan. Dust the meatballs in flour, then fry in the hot oil until golden-brown on all sides. Do this in batches, depending on the size of your frying pan. Drain on kitchen paper and set aside.", "Preheat the oven to 200C/400F/Gas 6.", "For the lasagne, spread a little of the tomato sauce over the base of a large ovenproof dish.", "Cover with a layer of lasagne sheets, then spoon over some more tomato sauce.", "Sprinkle with parmesan, followed by some egg slices and a few meatballs. Dot over some ricotta and pieces of mozzarella.", "Top with more sheets of pasta and repeat the layers with the remaining ingredients, finishing with tomato sauce, meatballs, eggs and both cheeses.", "Cover the dish with foil and bake in the oven for about 30 minutes.", "Remove the foil and cook for a further five minutes, or until the cheese has melted and the top is golden-brown. Serve immediately."]}, {"isVegetarian": false, "title": "Lamb and apricot Cape Malay curry", "url": "www_bbc_co_uk_food_recipes_lamb_and_apricot_cape_72967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shoulder of lamb (approximately 1kg/2lb 4oz), diced", "1 tsp ground coriander", "1 tsp ground cumin", "1 tsp garam masala", "2 tsp ground turmeric", "1 tbsp tamarind paste", "2 tsp dried chillies ", "1 tsp fennel seeds", "3 garlic cloves ", "1 cinnamon stick", "3 garlic cloves, finely grated", "1 red chilli, finely chopped", "1cm/½in piece fresh root ginger, finely grated", "2 tbsp sunflower oil", "2 onions, thinly sliced", "2 tsp dried chilli flakes", "1 tsp fennel seeds", "3 garlic cloves", "1cm/½in piece fresh root ginger, finely grated", "2 tbsp tomato purée", "400g tin chopped tomatoes", "large handful dried apricots, roughly chopped", "2 tbsp apricot chutney", "100g/3½oz desiccated coconut", "bunch fresh coriander, roughly chopped, to serve", "50g/1¾oz fresh coconut, grated, to serve", "500g/1lb 2oz dried couscous", "1 small cucumber, diced", "1 pomegranate, seeds only", "bunch fresh basil, roughly chopped", "bunch flatleaf parsley, roughly chopped", "bunch fresh coriander, roughly chopped", "handful dried apricots, roughly chopped ", "4 spring onions, roughly chopped "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lamb, mix all the marinade ingredients together in a large bowl. Add the lamb and gently massage until completely covered in the marinade. Cover and leave to marinate in the fridge for at least 1 hour.", "To make the curry, heat the oil in a frying pan over a medium heat. Fry the onions, chilli, fennel, garlic and ginger until soft and then stir in the tomato purée.", "Stir in the tinned tomatoes and add the marinated lamb. Pour in enough water so the lamb is just covered and simmer for about 1 hour.", "Add the dried apricots, chutney and desiccated coconut and simmer for 10 minutes. ", "Meanwhile, cook the couscous according to the packet instructions and stir in the remaining ingredients", "Sprinkle the coriander and grated fresh coconut over the curry and serve alongside the couscous. "]}, {"isVegetarian": false, "title": "Lamb-stuffed aubergines with Moorish spices and Manchego cheese", "url": "www_bbc_co_uk_food_recipes_lamb-stuffed_aubergines_99219", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb-stuffed_aubergines_99219_16x9.jpg", "ingredients": ["4 aubergines", "6 tbsp olive oil", "1 onion, chopped", "4 garlic cloves, finely chopped", "1 large red pepper, seeds removed, chopped", "1½ tsp freshly ground cumin seeds", "1 tsp ground cinnamon", "½ tsp freshly grated nutmeg", "1 tsp pimentón dulce (smoked sweet Spanish paprika)", "large pinch of crushed dried chillies", "500g/1lb 2oz lamb mince", "6 tbsp tomato sauce (see Top recipe tip below)", "100g/3½oz Manchego cheese, coarsely grated", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Cut each aubergine lengthways through the stalk, then score the flesh in a tight criss-cross pattern, taking the knife through the flesh down to the skin, but taking care not to cut through the skin. Place them side by side on a baking tray and drizzle each half with half a tablespoon of the oil, season with salt and bake for 30-40 minutes or until the flesh is soft and tender but not browned.", "Meanwhile, heat the remaining two tablespoons of oil in a large non-stick frying pan. Add the onion, garlic, red pepper and spices and fry gently for 10 minutes. Add the lamb mince and fry for 3–4 minutes or until all the meat is lightly browned. Stir in the tomato sauce and simmer for five minutes. ", "Remove the aubergines from the oven and increase the temperature to 220C/425F/Gas 7. Carefully scoop most of the flesh out of the baked aubergine halves, leaving the skins with a layer of flesh about 1cm/½in thick. Stir the scooped-out flesh into the lamb mixture with half a teaspoon of salt and some pepper to taste. Spoon the mixture into each aubergine shell and sprinkle with the grated cheese. Bake in the oven for 8–10 minutes, or until the cheese is bubbling and golden-brown. "]}, {"isVegetarian": false, "title": "Lamb and flageolet bean stew", "url": "www_bbc_co_uk_food_recipes_lamb_and_flageolet_bean_62432", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_and_flageolet_bean_62432_16x9.jpg", "ingredients": ["1 tsp olive oil", "350g/12oz lean lamb, cubed", "16 pickling onions", "1 garlic clove, crushed", "600ml/20fl oz lamb stock (made with concentrated liquid stock)", "200g can chopped tomatoes", "1 bouquet garni", "2 x 400g cans flageolet beans, drained and rinsed", "320g/11oz green beans", "250g/9oz cherry tomatoes", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a flameproof casserole or saucepan, add the lamb and fry for 3-4 minutes until browned all over. Remove the lamb from the casserole and set aside.", "Add the onions and garlic to the pan and fry for 4-5 minutes, or until the onions are beginning to brown.", "Return the lamb and any juices to the pan. Add the stock, tomatoes, bouquet garni and beans. Bring to the boil, stirring, then cover and simmer for 1 hour, or until the lamb is just tender.", "Meanwhile, bring a pan of water to the boil and blanch the green beans. Place in bowl of ice-cold water. ", "Add the cherry tomatoes to the stew and season well with freshly ground black pepper. Continue to simmer for 10 minutes. ", "Divide the stew between four plates, place the green beans alongside and serve. "]}, {"isVegetarian": false, "title": "Lamb and kidney suet pudding with rosemary", "url": "www_bbc_co_uk_food_recipes_lamb_and_kidney_suet_94115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_and_kidney_suet_94115_16x9.jpg", "ingredients": ["30g/1oz unsalted butter ", "vegetable oil, for frying", "2 banana shallots, sliced", "2 garlic cloves, sliced", "1 tbsp plain flour", "1 tbsp finely chopped fresh rosemary ", "500g/1lb 2oz lamb shoulder, trimmed and cut into bite-size pieces", "3 lambs’ kidneys, halved, tough white core removed, cut into bite-size pieces", "150ml/5fl oz red wine", "150ml/5fl oz rich beef stock", "salt and freshly ground black pepper", "butter, for greasing", "285g/10oz self-raising flour", "125g/4½oz suet", "1 tsp baking powder", "1 tbsp finely chopped fresh rosemary"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, melt the butter with one tablespoon of oil in a large, heavy-based saucepan over a medium-low heat. When the butter is foaming, add the shallots and garlic and cook for a few minutes until they begin to soften, but not colour.", "Meanwhile, in a large bowl, mix the tablespoon of flour with the chopped rosemary and some salt and pepper. Add the lamb and kidneys and toss them thoroughly in the seasoned flour.", "Transfer the softened shallots and garlic to a large bowl and set to one side. Add a little more oil to the pan and increase the heat. Add a third of the lamb and kidney and cook until browned all over.", "Set aside with the shallots and repeat with the remaining meat, adding more oil if needed. Return all the meat and the shallots to the pan.", "Add the wine to the pan and let it bubble and reduce for a couple of minutes, scraping the base of the pan with a spatula to help release any caramelised bits. Add the stock and simmer for five minutes. If the sauce looks too thick, add a little more stock. Taste the sauce and season with salt and pepper. Set aside to cool completely. ", "When you are ready to cook the pudding, first generously butter a 1.2 litre/2 pint pudding basin. ", "To make the pastry, mix the ingredients together thoroughly and season with salt and pepper. Gradually stir in water until you have a soft, slightly sticky dough (you’ll need about 225ml/8fl oz of water). ", "Divide off about a quarter of the dough, to be used for the pastry lid. Dust your work surface with flour and roll out the larger piece of dough into a circle roughly 30cm/12in in diameter. Use this to line the pudding basin, leaving the excess pastry hanging over the edge. Roll out the small piece of dough large enough to form a lid for the basin. ", "Spoon the cooled filling into the pastry-lined basin. Dampen the edges with water and add the pastry lid. Press the edges together to seal and trim away the excess pastry neatly.", "Place a piece of baking parchment over a sheet of foil and make a large pleat in the middle, folding both sheets together (this allow the pudding to expand as it cooks). Put the parchment and foil on top of the pudding, foil side up, and secure with string, looping the end of the string over the top of the pudding and tying it to form a handle that will enable you to lift the pudding in and out of the saucepan.", "Place the basin in a large pan, and pour in enough boiling water to come halfway up the side of the basin. Put a lid on the pan and bring to a simmer. Turn the heat low and let the pudding steam for 2-2½ hours. Top up the boiling water during this time if necessary so the pan doesn’t boil dry.", "Remove the pudding from the pan, take off the foil and parchment and leave to rest for five minutes. Then use a small, sharp knife to release the sides of the pudding from the basin. Put a large plate over the pudding and invert it, so the pudding comes out on to the plate. Serve straight away."]}, {"isVegetarian": false, "title": "Lamb and lentil curry", "url": "www_bbc_co_uk_food_recipes_lamb_and_lentil_curry_83678", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_and_lentil_curry_83678_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "500g/1lb 2oz lamb neck fillets, trimmed, cut into 3cm/1¼in chunks", "2 onions, roughly chopped", "3 large garlic cloves, roughly chopped", "3 tbsp medium curry paste ", "1 x 400g tin chopped tomatoes", "150g/5½oz dried split red lentils, rinsed and drained", "1 tsp salt, plus extra to season", "75g/2½oz curly kale (or mature spinach leaves), rinsed, shredded, any tough stalks discarded", "freshly ground black pepper", "steamed rice or naan bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, lidded, non-stick saucepan over a medium heat. Add the lamb, onions and garlic and fry for 5-6 minutes until lightly browned, stirring regularly.", "Add the curry paste and stir well to coat the lamb and onions. Continue to cook for 1-2 minutes, stirring well, then add the tomatoes, lentils, 500ml/18fl oz water and salt. Bring the mixture to the boil. Reduce the heat until the mixture is simmering, then half-cover the pan with the lid and simmer very gently for 45-50 minutes, stirring regularly, until the lamb is very tender. (Add a little extra water if the curry is beginning to look dry before the lamb is tender.)", "Season with salt and pepper, stir in the kale and simmer for a further 2-3 minutes, or until tender. ", "Serve in bowls with steamed rice or warm naan bread."]}, {"isVegetarian": false, "title": "Lamb and mint sausages", "url": "www_bbc_co_uk_food_recipes_lamb_and_mint_sausages_48512", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb lamb mince", "450g/1lb pork mince", "1½ tbsp honey", "1 garlic clove, finely chopped", "30g/1oz breadcrumbs", "3 tbsp chopped fresh mint", "1 free-range egg", "sea salt and freshly ground black pepper", "oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients except the oil in a large bowl and mix well with clean hands.  Shape the mixture into about eight sausages.", "Heat the oil in a wide pan and gently fry the sausages for 6-8 minutes or until cooked through."]}, {"isVegetarian": false, "title": "Lamb and mint pasties with quick apple pickle", "url": "www_bbc_co_uk_food_recipes_lamb_and_mint_pasties_93646", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_and_mint_pasties_93646_16x9.jpg", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "1 tbsp baking powder ", "½ tsp fine salt ", "125g/4½oz unsalted butter, chilled and cubed ", "2 large free-range egg yolks ", "130ml/4fl oz–140ml/4½fl oz cold water ", "1 free-range egg, beaten, for brushing", "300g/10½oz potatoes, cut into 1cm/½in cubes", "150g/5½oz frozen peas, defrosted and drained ", "1 onion, finely chopped ", "2 small green apples, peeled, cored and cut into 1cm/½in cubes", "300g/10½oz boneless lamb (ideally leg), cut into 1cm/½in cubes", "2 tbsp dried mint ", "1 tsp fine sea salt ", "40g/1½oz butter ", "2 tbsp plain flour ", "5 tbsp olive oil ", "1 tsp brown mustard seeds ", "1 tsp garlic granules ", "½ tsp ground ginger ", "¼ tsp ground turmeric ", "½ tsp fenugreek seeds ", "2 green chillies, thinly sliced ", "¼ tsp asafoetida ", "½ tsp onion seeds ", "2 tbsp apple cider vinegar ", "1 tsp caster sugar", "½ tsp salt ", "4 green apples, cored and chopped "], "serves": "Makes 6 pasties and about 450ml/16fl oz pickle", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, put the flour, baking powder and salt in a large bowl and mix. Rub in the butter using your fingertips until the mixture resembles breadcrumbs.", "Add the egg yolks and stir using a palette knife. Add the water a little at a time, still mixing with your palette knife. You may not need all the water, so add it gradually until the dough just starts to come together. Bring the dough together with your hands. Flatten the pastry and wrap it in cling film, then put it in the fridge for 1 hour to chill.  ", "To make the filling, put the potatoes, peas, onion, apples, lamb, mint and salt in a large bowl and mix well. Melt the butter over a low heat and pour in, then add the flour and mix. ", "Preheat the oven to 180C/160C Fan/Gas 4 and line two baking trays with baking paper. ", "Roll the pastry out on a lightly floured work surface to a thickness of 3–4mm. Cut around an 18cm/7in dinner plate with a sharp knife to create six pastry circles. If they shrink a little after cutting, gently re-roll them. ", "Place a sixth of the filling on one side of one of the circles. Brush the edge of half the circle with beaten egg, then fold over the other half to make a D shape. Crimp the edge using a fork or the back of a knife. Make a hole in the top to allow some air to escape and place on a lined baking tray. Repeat with the other five circles. Brush with the beaten egg and bake on a baking tray for 50 minutes. Leave to stand for 10 minutes before eating. ", "Meanwhile, to make the apple pickle, put the oil in a saucepan over a low heat. Add the mustard seeds and, as soon as they begin to pop, add the other spices. Cook for a few minutes, being careful not to burn them. Stir in the vinegar, sugar and salt. Add the apples and 200ml/7fl oz water and cook gently for 20 minutes, or until they have mostly broken down. Leave to cool in the pan.", "Serve the pasties with the pickle. Any leftover pickle can be stored in a clean jar in the fridge for up to a month. "]}, {"isVegetarian": false, "title": "Lamb tagine with couscous", "url": "www_bbc_co_uk_food_recipes_lamb_and_vegetable_30192", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_and_vegetable_30192_16x9.jpg", "ingredients": ["1 x 1kg/2lb 4oz boned leg of lamb, cut into large pieces ", "1 tsp ground ginger ", "1 tsp ground cumin", "6 tbsp olive oil", "1 large onion, thinly sliced", "2 large carrots, finely chopped", "3 sage leaves", "1 cinnamon stick", "1 tsp black peppercorns", "500ml/18fl oz hot chicken stock ", "2 courgettes, sliced", "1 large aubergine, cut into 2cm/¾in pieces", "3 large potatoes, cut into 2cm/¾in pieces", "400g tin chickpeas, drained and rinsed", "flaked sea salt and freshly ground black pepper", "400g/14oz couscous", "1 tbsp butter", "800ml/1 pint 8fl oz boiling chicken stock", "small handful fresh coriander, roughly chopped, to garnish ", "small handful fresh parsley, roughly chopped, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the lamb with the ginger and cumin and season with about tablespoon flaked sea salt and plenty of black pepper. Place a large casserole over a high heat and add 2 tablespoons oil. Sear the lamb all over, then set aside. ", "Heat another tablespoon oil in the pan and fry the onion and carrots for 5 minutes, until soft. ", "Return the lamb to the pan and add the sage, cinnamon and black peppercorns. Pour in the stock. Bring to the boil, then cover and gently simmer for 45 minutes. ", "Meanwhile, heat 1½ tablespoons oil in a saucepan and fry the courgette over a high heat until coloured and tender. Scoop out with a slotted spoon and put to one side. Add the remaining 1½ tablespoons oil to the pan and fry the aubergine until tender. Remove from the pan and add to the courgette. ", "Add the potatoes to the lamb and cook for a further 15 minutes. ", "Finally, stir in the fried courgette and aubergine, and the chickpeas and cook for another 15 minutes. ", "When ready to serve, make the couscous. Put the couscous in a large, heatproof bowl with the butter. Pour the boiling stock over the top, stir with a fork, then set aside for 5 minutes, or until all the liquid has been absorbed. Transfer to a platter and garnish with the herbs. ", "Serve the tagine with the couscous."]}, {"isVegetarian": false, "title": "Lamb belly in ale with flageolet bean and cauliflower mash", "url": "www_bbc_co_uk_food_recipes_lamb_belly_in_ale_with_97447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["rapeseed oil, for frying ", "3 white onions, finely chopped ", "12 garlic cloves, crushed", "2kg/4lb 8oz lamb belly (bone in)", "568ml/1 pint India pale ale", "3 fresh bay leaves", "12 cloves", "1 tbsp ground mace", "10g fresh thyme leaves", "40g/1½oz treacle", "2 roasted onions", "8 cloves roasted garlic", "½ bunch parsley, roughly chopped", "2 x 400g tins flageolet beans", "½ head roasted cauliflower florets ", "200ml/7fl oz vegetable or chicken stock  ", "60g/2¼oz unsalted butter", "salt and freshly ground black pepper", "200ml/7fl oz milk", "1 white onion, sliced very thinly on a mandoline", "200g/7oz plain flour", "1 tsp paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2.", "Heat a splash of oil to an ovenproof casserole. Fry the onion and garlic and until soft. Add the lamb belly and brown on both sides, then add the remaining ingredients. ", "Cook in the oven for 4–5 hours until the lamb pulls away easily from the bone. Remove the lamb and reserve the cooking liquor. Pull the lamb from the bones and set aside. ", "Return the cooking liquor to the heat and reduce until you have a thick consistency that will coat the meat. Mix together and transfer to a serving dish. Keep warm until ready to serve.", "For the mash, pulse the roasted onion, garlic and parsley in a blender. Transfer to a saucepan and add the remaining ingredients, except the stock and butter. ", "Stir in the stock a little at a time until you reach the desired soft consistency. Add the butter a little at a time until the mixture is rich in taste. Season with salt and pepper and keep warm until ready to serve.", "For the crispy onions, heat the oil in a deep-fat fryer or a deep-sided, heavy bottomed pan to 190C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Pour the milk into a bowl and soak the onions for a couple of minutes. Put the flour and paprika in another bowl and season with salt and black pepper. Drain the onions thoroughly, then dredge them in the flour. Fry in the hot oil until crisp and golden-brown. Drain on kitchen paper.", "Serve the lamb with the mash on the side and crispy onions on top."]}, {"isVegetarian": false, "title": "Lamb breast with vegetables and an egg vinaigrette", "url": "www_bbc_co_uk_food_recipes_lamb_breast_with_08232", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb breast", "1 bay leaf", "1 onion, chopped", "1 carrot, chopped", "1 celery stick, chopped", "vegetable oil, for deep frying", "75g/2¾oz plain flour", "2 medium free-range eggs, beaten", "100g/3½oz Japanese panko breadcrumbs", "2 soft boiled free-range eggs, egg yolk and white separated", "1 garlic clove, chopped", "1 tsp Dijon mustard", "4-5 tbsp vegetable oil", "1 bunch baby leeks, trimmed ", "1 bunch asparagus, trimmed", "2 tbsp unsalted butter", "8 anchovies, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb breast, put the lamb in a large saucepan or casserole and add the bay leaf, onion, carrot and celery and enough water to cover the lamb breast. Cook over a medium heat for 1-2 hours or until cooked through.", "For the egg vinaigrette, put the soft egg yolks in a food processor. Add the garlic and mustard and blend. Gradually add the oil until you have a runny dressing (you may need more oil if the dressing isn't coming together). Remove the dressing from the machine and put in a bowl. Dice the egg whites and stir into the dressing. Season with salt and pepper.", "When the lamb is almost cooked, preheat a deep-fat fryer to 180C or heat the oil in a deep-sided, heavy bottomed pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Remove the lamb from the liquid and discard the bones and sinew. Cut the lamb breast into fingers and pass through the flour, then egg and then coat in breadcrumbs.", "Just before serving, deep fry the lamb fingers for 2-3 minutes or until golden-brown and crisp.", "Meanwhile, for the vegetables, heat a large saucepan of salted boiling water and blanch the baby leeks and asparagus for 1-2 minutes. Drain and set aside until ready to serve.", "Heat the butter in a frying pan. Once hot and melted, gently fry the leeks and asparagus for 1-2 minutes.", "To serve, put the lamb on a serving plate and pour the vinaigrette over the top. Garnish with the vegetables and anchovies."]}, {"isVegetarian": false, "title": "Lamb bhuna with garlic naan", "url": "www_bbc_co_uk_food_recipes_lamb_bhuna_with_garlic_27184", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_bhuna_with_garlic_27184_16x9.jpg", "ingredients": ["100ml/3½fl oz olive oil", "1 tsp salt", "5 garlic cloves, peeled", "25g/1oz fresh root ginger, sliced", "2 small onions, roughly chopped", "1 large green pepper, seeds removed, roughly chopped", "2 large red chillies, roughly chopped", "½ tsp ground cinnamon", "½ tsp ground turmeric", "2 tsp curry powder", "800g/1lb 12oz boneless diced lamb leg", "15g/½oz fresh coriander, chopped", "200g/7oz self-raising flour, plus extra for dusting", "2 tbsp garlic granules", "1 tsp caster sugar", "1 tsp salt", "25g/1oz unsalted butter, softened, cut into cubes, plus extra for melting"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the curry paste, put the oil, salt, garlic cloves, ginger, onions, pepper, chillies, cinnamon, turmeric, curry powder and 50ml/2fl oz water in a food processor. Blend to a smooth paste and set aside.", "To make the naan, put the flour, garlic granules, sugar, salt and softened butter in a bowl and mix together. Rub in the butter.", "Make a well in the centre and add 100ml/3½fl oz of water. Mix with a palette knife, then bring the dough together using your hands. Knead the dough on a lightly floured surface for 3–4 minutes. Wrap in cling film and leave to rest at room temperature for 20 minutes. ", "Meanwhile, to make the curry, add the curry paste to a large saucepan over a medium heat and cook for 10 minutes. Add the lamb and cook for another 10 minutes. Add 200ml/7fl oz water and simmer gently for 30 minutes with the lid on.", "Meanwhile, divide the dough into four equal pieces and roll each one out to the thickness of a pound coin.", "Put a griddle pan on a high heat and cook the breads one at a time for 3 minutes on each side. Cover with foil and keep warm while you griddle the rest.", "When the bhuna is cooked, remove from the heat and add the coriander. Melt some butter and brush the naans with it on both sides. Serve with the bhuna."]}, {"isVegetarian": false, "title": "Lamb burger with mint mayonnaise and tomato chutney in a homemade brioche bun", "url": "www_bbc_co_uk_food_recipes_lamb_burger_with_mint_25476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/¼oz fresh yeast", "50ml/2fl oz full-fat milk, at room temperature", "300g/10½oz strong white flour, plus extra for dusting", "30g/1oz caster sugar", "10g/¼oz fine sea salt", "4 medium free-range eggs, beaten ", "125g/4½oz butter, softened, plus extra for greasing", "2 free-range egg yolks, beaten, for glazing", "500g/1lb 2oz lamb mince", "2 tbsp vegetable oil", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz vegetable oil", "1 bunch mint, leaves picked and chopped", "1 tbsp olive oil", "1 shallot, chopped", "4 tomatoes, chopped", "1 garlic clove, crushed", "2 tbsp balsamic vinegar", "2 tsp brown sugar", "500g/1lb 2oz chipping potatoes, cut into skinny fries", "vegetable oil, for deep-fat frying", "8 gherkins, sliced", "4 beef tomatoes, sliced", "2 Little Gem lettuce, leaves separated", "1 red onion, sliced", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the brioche, put the yeast in a small bowl. Put the milk in a small saucepan and warm through. Pour the milk over the yeast and mix. Leave in a warm place for 10 minutes, or until a light foam forms on the surface.", "Put the flour, caster sugar and salt in a food processor with a dough hook attachment. Start the mixer and pour in the yeast mixture and the beaten eggs gradually. Knead for 5 minutes in the food processor.", "Gradually add the softened butter, a teaspoon at a time, kneading well between each addition. It will take about 10 minutes to incorporate the butter and the dough will be very sticky.", "Sprinkle the dough with flour and continue to knead lightly for 10 minutes or until the dough is very pliable, smooth and no longer sticky. Put it in a large greased bowl and cover with a clean cloth. Leave in a warm place for 1½ hours until well risen and spongy.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Turn the dough out onto a lightly floured surface and knock it back with your knuckles. Shape into 6 round brioche rolls and leave in a warm place to prove for 45 minutes, or until the dough is well risen.", "Meanwhile, make the lamb burgers. Put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into 4 burger-shaped patties. Wrap the patties in cling film and put in the fridge for an hour.", "Once the brioche dough has proved, brush the brioche rolls lightly but generously with the beaten egg yolk. Bake for 15-20 minutes until risen and golden-brown. ", "Meanwhile make the mint mayonnaise. Put the egg yolks, white wine vinegar and mustard in a food processor and blend until pale and creamy. With the motor running, pour in the oil in a very thin, steady stream until the mayonnaise thickens. Add the mint, mix and set aside.", "For the tomato chutney, heat the oil in a small pan. Add the shallot, tomatoes and garlic. Cook for 5-8 minutes until softened. Stir in the vinegar and sugar and cook for 3-5 minutes, or until the chutney has caramelised slightly.", "To cook the lamb burgers, heat a large frying pan and add the oil. Once hot, add the burgers and cook each side for 2-3 minutes, or until cooked through. Set aside to rest in a warm place.", "For the homemade chips, heat the oil in a deep fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully put the chips in the deep fat fryer and cook for 3-4 minutes, or until golden-brown and crisp. Remove and drain on kitchen paper. Season with salt.", "Halve the brioche buns and lightly toast. Spoon the tomato chutney on the base of the bun and top with the burger, gherkins, tomato slices, onion, lettuce, mayonnaise and place the other half on top. Secure with a cocktail stick if needed. Serve the burger with the fries alongside."]}, {"isVegetarian": false, "title": "Lamb burgers", "url": "www_bbc_co_uk_food_recipes_lamb_burgers_69009", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_burgers_69009_16x9.jpg", "ingredients": ["120g/4½oz hard sheep’s cheese, preferably a Berkswell, coarsely grated", "800g/1lb 12oz coarse lamb mince, fattier the better", "1 red onion, finely chopped", "4 anchovy fillets, finely chopped", "8 small gherkins, finely chopped", "4 tsp capers, drained", "salt and freshly ground black pepper", "2 tbsp olive oil", "4 burger buns"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Divide the cheese into four piles, and roll each one into a tight ball. Set aside.", "Place the lamb mince in a large mixing bowl. Add the onion, anchovies, gherkins and capers and season with salt and freshly ground black pepper. Mix the contents of the bowl together, ideally by hand. Divide the mince mixture into four. ", "One by one flatten each pile of mince into the palm of your hand, leaving a little well in the centre. Place the cheese ball in the well and mould the mince around the cheese to form a tight, plump burger shape that is almost spherical. ", "Heat the olive oil in a frying pan over a moderate heat and brown the burgers.", "If the panhandle is ovenproof, transfer the pan to the oven to bake. If not, carefully transfer the burgers to an oven tray and bake for 30 minutes.", "Slice the buns and when the burgers are cooked, soak the cut side of the bread in the pan juices. Fill the buns and serve."]}, {"isVegetarian": false, "title": "Lamb burgers with mint mayo and tomato relish", "url": "www_bbc_co_uk_food_recipes_lamb_burgers_with_mint_21643", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_burgers_with_mint_21643_16x9.jpg", "ingredients": ["50g/1¾oz fresh white breadcrumbs", "1 garlic clove, crushed", "1 small bunch fresh coriander, chopped", "1½ tsp mint sauce", "1 large red onion, roughly chopped", "500g/1lb 2oz lean lamb mince", "1 tbsp olive oil, for frying", "8 lettuce leaves, to serve", "8 brioche buns, to serve", "3 gherkins, thinly sliced, to serve", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 onion, roughly chopped", "1 garlic clove, crushed", "1 x 400g tin chopped tomatoes", "1 tbsp balsamic vinegar", "1 tbsp Worcestershire sauce", "1 tbsp tomato ketchup, or a pinch of sugar", "2 tbsp mayonnaise", "2 tsp chopped mint", "1 tsp mint sauce"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the burgers, put the breadcrumbs, garlic, coriander, mint sauce, onion and salt and black pepper in a food processor. Blend until it’s just combined with a fairly coarse texture. Tip into a bowl, add the mince and mix together. Using wet hands, shape into 8 burgers, then place on a baking tray, cover and chill in the fridge until needed.", "For the tomato relish, heat the oil in a saucepan, add the onion and garlic, then cover with a lid and fry over a medium heat for 5–7 minutes, or until soft. Add all the remaining ingredients to the pan, stir, bring to the boil and cook for 2–3 minutes. Season with salt and pepper, then cover again with the lid, reduce the heat and leave to simmer for about 10 minutes.", "For the mint mayonnaise, mix all the ingredients together in a small bowl.", "To cook the burgers, heat the oil in a large frying pan, or alternatively light the barbecue and let the flames flare up and die down. Fry or barbecue the burgers for about 3–4 minutes on each side or until browned and cooked through.", "To serve, slice the buns in half and toast the cut side. Spread one half of each bun with the tomato relish and add a lettuce leaf, a burger, a dollop of mint mayonnaise and a few slices of gherkin before popping on the top half of the bun."]}]