[{"ingredients": ["235g / 8⅓oz de mantequilla", "330ml / 11½fl oz de leche entera", "1½ cucharada de azúcar en polvo", "Harina normal de 275g / 10oz", "8 huevos de gallinas camperas", "sal", "1 litro / 1¾ pintas de crema doble", "100g / 3½oz de azúcar glasé", "1½-2 cucharadas de extracto de café", "1 cucharadita de cardamomo molido", "500 g / 1 lb 2 oz de azúcar en polvo", "semillas de azúcar blanco"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque la mantequilla, la leche y el azúcar en una cacerola, vierta sobre 330 ml / 11½ fl oz de agua y agregue una pizca de sal. Lentamente llevar a ebullición, luego baje el fuego y cocine a fuego lento hasta que la mantequilla se haya derretido. Tamice y agregue la harina hasta que la mezcla se desprenda de los lados y forme una bola. Batir durante 30 segundos, luego dejar de lado para enfriar.", "Batir los huevos en la mezcla de a uno por vez con un batidor eléctrico o manual, hasta que estén brillantes.", "Usando una manga pastelera con una boquilla de 1-1½ cm / ½ pulgada, pinte 3 cm / 1¼ pulgada de diámetro en tres o cuatro bandejas para hornear (o cocine en lotes). Hornee durante 10 minutos, luego baje el fuego a 180C / 160C Fan / Gas 4 y cocine durante 20-25 minutos. Haga una pequeña hendidura en el costado de cada panecillo, luego hornee por otros 5 minutos.", "En este punto puede continuar con la receta, almacenarla en un recipiente hermético o congelarla hasta que esté lista para usar (si está haciendo esto último, recaliente los panecillos en el horno durante unos minutos antes de enfriarlos y llenarlos).", "Para hacer la crema especiada, bate la crema hasta que esté bien firme. Tamiza y agrega el azúcar glas con el extracto de café y cardamomo. Cubra con película adhesiva y refrigere durante 30 minutos. Usando una manga pastelera, vierta la crema en la ranura de cada moño. Limpie cualquier exceso y refrigere los panecillos hasta que esté listo para ensamblar.", "Para hacer el caramelo, coloque el azúcar en una cacerola de fondo grueso a fuego medio. Caliente hasta 154C cuando todo el azúcar se habrá disuelto y caramelizado. (Mueva la cacerola si parece que un borde se está oscureciendo antes que el otro y use un cepillo mojado en agua para limpiar los cristales que se forman en los lados).", "Sumerja la parte superior de los panecillos en el caramelo, luego espolvoree con semillas de azúcar. Repite con todos los bollos que quieras decorar.", "Para ensamblar, sumerja ambos lados de los panecillos en el caramelo. Un lado se pegará al fondo, un lado se pegará a la parte superior (las puntas de azúcar mirarán hacia afuera). Continúe armando los panecillos hasta llegar a la parte superior del cono. Si el caramelo se vuelve demasiado pegajoso para trabajar, colóquelo a fuego lento para calentarlo.", "Deje que se seque por completo, luego retire el cono. Las bengalas de interior agregarán un destello adicional."], "url": "www_bbc_co_uk_food_recipes_christmas_croquembouche_13159", "title": "Croquembouche de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["550 / 1lb 4oz de fruta seca mixta", "100 g / 3½oz de cerezas secas, cortadas a la mitad", "100g / 3½oz de higos secos, picados", "100ml / 3½fl oz de jerez dulce", "240ml / 8½fl oz de aceite de almendras", "120ml / 3¾fl oz de melaza", "120ml / 3¾fl oz de jarabe de oro", "200g / 7oz de azúcar morena oscura", "1½ cucharadita de bicarbonato de soda", "160ml / 5½fl oz de agua hirviendo", "Harina normal de 350g / 12oz", "50 g / 1¾oz de cacao en polvo", "3 cucharaditas de especias mixtas", "pizca de sal de mesa", "6 huevos de gallinas camperas", "435 g de piña triturada en jugo, escurrida", "Mantequilla de almendra 85g / 3oz", "200g / 7oz de mantequilla sin sal", "400g / 14oz de azúcar glas dorado", "1 cucharadita de extracto de almendra", "salpicar leche", "250g / 9oz mini blancos malvaviscos", "65g / 2¼oz de caramelo azul o morado se derrite, picado", "colorante de comida de gel azul marino", "500g / 1lb 2oz de azúcar glasé, más extra para espolvorear", "25g / 1oz de manteca vegetal, más extra para amasar", "125g / 4½oz de azúcar glas real", "pastas para colorear de alimentos amarillas o anaranjadas", "3 cucharadas de jarabe de agave mezclado con 1 cucharada de agua hirviendo", "200 g / 7 oz de glaseado de fondant negro listo para el rodaje", "brillo comestible plateado (opcional)", "rocía blanca (opcional)"], "method": ["Mezcle la fruta seca y el jerez en un recipiente y déjelos en remojo durante al menos 30 minutos, pero preferiblemente durante unas horas.", "Precalentar el horno a 170C / 150C Fan / Gas 3½. Engrase y forre una lata de pastel de 25 cm / 10 in con papel de hornear.", "Ponga el aceite, la melaza, el jarabe y el azúcar en un tazón grande y bata hasta que se unan (el aceite seguirá estando separado).", "Mezcle el bicarbonato de soda con el agua hirviendo y revuelva hasta que burbujee y se disuelva. Verter en la mezcla de aceite y mezclar.", "Agregue la harina, el cacao en polvo, las especias mixtas y la sal y bata hasta que quede suave. Agregue los huevos y bata hasta que estén suaves y brillantes. Incline la piña, la fruta seca y el jerez que no haya sido absorbido. Mezcle hasta que esté bien combinado y luego viértalo en la lata preparada.", "Hornee por 2 horas, luego inserte un pincho en el centro, si sale casi limpio, la torta está cocida, si no hornea por 10-15 minutos y vuelva a probar.", "Mientras tanto, para la crema de mantequilla, bate las mantequillas juntas hasta que estén suaves y esponjosas. Agregue el azúcar glas, el extracto de almendras y un poco de leche y bata nuevamente, cubra con una película adhesiva y déjela a un lado.", "Para el fondant, ponga los malvaviscos y 2½ cucharadas de agua en un recipiente apto para microondas y caliente a potencia máxima durante 40 segundos, retire y revuelva. Repita este proceso, removiendo y revolviendo nuevamente a intervalos de 30 segundos hasta que los malvaviscos se hayan derretido. Ponga a un lado algunas cucharadas de los malvaviscos derretidos y agregue el caramelo se derrite al resto. Revuelva hasta que se derrita, luego agregue el colorante de alimentos de gel azul marino.", "Tamice 450g / 1lb del azúcar glas en un tazón grande y agregue la mezcla azul de malvaviscos. Usando un batidor de mano eléctrico hasta que se una, comenzando a baja velocidad para evitar una nube de polvo. Engrase sus manos con la manteca vegetal y amase el resto en la formación de hielo durante 5 minutos, o hasta que esté suave (la formación de hielo será muy pegajosa para empezar). Agregue más colorante para alimentos, si es necesario, y amasar nuevamente hasta que quede suave. Envuelva la película adhesiva y déjela descansar.", "En un tazón más pequeño, repita el proceso con los malvaviscos reservados batiendo en el restante 50 g / 1¾oz de azúcar glasé (esto hará que el círculo blanco que se encuentra en la parte superior de la torta).", "Cuando el pastel esté cocido, sáquelo de la lata y déjelo enfriar sobre una rejilla de alambre. Cuando el pastel esté completamente frío, recorte la parte superior para quitar el domo, si es necesario. Divida la torta en dos horizontalmente y luego colóquela sobre una tabla para pasteles con la parte inferior de la torta hacia arriba (para que tenga una parte superior limpia y plana).", "Extienda una capa uniforme de crema de mantequilla en la torta inferior, sándwich y cubrir la parte exterior de la torta en una capa generosa de crema de mantequilla con un pequeño cuchillo de paleta. Tenga cuidado de obtener un acabado uniforme y liso, ya que esto marcará una gran diferencia en cuanto a la suavidad de la formación de hielo final. Coloque el pastel en la nevera hasta que la formación de hielo se haya endurecido.", "Amasar el fondant azul hasta que esté suave y flexible (microondas por intervalos de 10 segundos, si es necesario) y amase en un poco más de manteca vegetal si es necesario. Polvo una worktop liberalmente con azúcar glas y extender la formación de hielo en un círculo lo suficientemente grande como para cubrir la torta.", "Cepille todo el pastel con el jarabe de agave y use un rodillo para levantar la guinda del pastel. Con cuidado, empuja hacia abajo el glaseado para cubrir los lados del pastel, incluido el tablero. Use un alisador de torta para alisar y terminar, luego recorte cualquier exceso de formación de hielo. Cepille la parte superior con brillo comestible, si se usa. Moja el reverso del círculo blanco y pégalo en la parte superior del pastel.", "Enrolle el fondant negro en forma de salchicha con sus manos. Espolvoree ligeramente la superficie de trabajo con azúcar glas y extiéndala en un rectángulo largo y delgado de aproximadamente 80 cm de largo. Usando un pequeño cuchillo afilado, corte un borde recto a lo largo de un largo y corte el otro en una silueta de tejados, asegurándose de que no sea más profundo que la altura del pastel. Mantenga cualquier recorte para usar para hacer a Santa y sus renos más tarde. Cepille los lados de la torta con el jarabe de agave diluido y pegue los techos de fondant negro (para hacerlo más fácil, corte la tira en trozos más pequeños que sean más fáciles de manejar).", "Vuelva a enrollar los recortes y corte cuidadosamente una silueta de Papá Noel y sus renos (haga esto más fácil imprimiendo una imagen de tamaño adecuado de Internet, colocándola sobre el fondant y usando un alfiler para marcar los bordes).", "Estirar el fondant blanco y usar un cortador de galletas grande para cortar en un círculo ordenado. Esto hará que la luna esté en la parte superior del pastel. Moje la parte trasera del fondant negro Santa y colóquelo sobre la torta pasando por la luna fondant.", "Para el glaseado real, bata el azúcar glas y una cucharada de agua juntos hasta que esté espeso y suave, agregando agua extra si es necesario. Coloque un tercero en un recipiente aparte y mezcle un poco de color amarillo (esto se usará para formar las ventanas). Coloque el glaseado blanco en una manga pastelera equipada con una pequeña boquilla simple.", "Use una plantilla para pintar ventanas en los tejados de fondant negro. Usando el glaseado real amarillo y una pequeña cuchilla flexible, sostenga la plantilla en su lugar y pase el glaseado sobre ella. Limpie la parte posterior de la plantilla entre las ventanas. Si se vuelve un poco desordenado, deje que se seque el hielo y luego elimine cualquier exceso con un cuchillo de punta redonda.", "Pinte el glaseado real blanco sobre los tejados para que parezca nieve. Si lo desea, decore el cielo con pequeños puntos blancos para que parezcan nieve que cae (alternativamente, utilice salpicaduras blancas). Transfiera a un puesto de pasteles o plato para servir."], "url": "www_bbc_co_uk_food_recipes_christmas_eve_cake_64830", "title": "Torta Navideña de último minuto", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 x 25cm / pastel de 10 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_eve_cake_64830_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400ml / 14fl oz de vino tinto Cabernet Sauvignon", "1 barra de canela entera", "1 g de nuez moscada molida", "1 diente", "2 g de pimienta de Jamaica molida", "100 g / 3½ oz de azúcar en polvo", "1 naranja, pelada y partida en dos", "3 peras maduras (peras Bosc o Conference), peladas, sin corazón y cortadas a la mitad", "Harina normal de 250g / 9oz", "50g / 1¾oz de azúcar glas", "100 g / 3½ oz de mantequilla sin sal, cortada en cubitos", "1 yema de huevo grande de gallinas camperas", "1 cucharada de agua helada", "175g / 6oz de mantequilla sin sal ablandada", "175g / 6oz de azúcar en polvo", "3 huevos grandes de gallinas camperas", "175gr / 6 oz de almendras molidas", "1 cucharadita de extracto de almendra", "25 g / 1 oz de almendras molidas", "50g / 1¾oz de almendras rebanadas blanqueadas", "2 cucharadas de mermelada de albaricoque, tamizada", "100g / 3½oz de azúcar glasé", "2 cucharaditas de jugo de limón"], "method": ["Para las peras, agregue el vino tinto, las especias, el azúcar impalpable y la naranja en una cacerola y caliente con cuidado. Coloque las peras en la cacerola y lleve a ebullición, reduzca a fuego lento y cocine durante 15 minutos, o hasta que las peras estén tiernas.", "Retire las peras y séquelas con papel de cocina. Para decorar las peras (opcional), coloque las mitades con el lado del corte hacia abajo y use un cuchillo afilado para hacer 5-6 cortes a lo ancho, aproximadamente 1 cm / ½ en profundidad y 5 mm de ancho. Deja enfriar.", "Para la repostería dulce, agregue la harina, el azúcar glas y la mantequilla a la licuadora. Mezcle hasta que la mezcla se asemeje a pan rallado. Agregue la yema de huevo y pulse brevemente. Vierta suficiente agua helada para unir la mezcla como una bola en la licuadora. Retire y coloque sobre una superficie ligeramente enharinada. Amasar lo suficiente como para formar una bola, envolver en una película adhesiva y colocar en la nevera durante 15-20 minutos.", "Retire la masa de la nevera y deje a un lado una pequeña porción de la masa. En una superficie de trabajo ligeramente enharinada, extender la masa restante en un círculo y forrar una lata de flan de 23 cm / 9 pulg. Use la masa reservada para empujar la masa en los lados acanalados. Pincha la base con un tenedor y déjalo en la nevera durante 15 minutos.", "Para el frangipane, bata la mantequilla y el azúcar usando una batidora eléctrica hasta que esté suave y esponjosa. Batir los huevos uno por uno y luego batir en las almendras molidas y la esencia.", "Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra la caja de pastelería con papel para hornear y llénela con alubias para hornear o arroz sin cocer. Hornee por 10 minutos, luego quite los frijoles para hornear y el papel de hornear y vuelva al horno por otros 5 minutos, o hasta que la masa esté seca.", "Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el relleno, espolvorear un puñado de almendras molidas en la base de la caja de pastelería. Cuchara del frangipane en el caso de pastelería. Agregue las peras, con el lado del corte hacia abajo en un patrón de estrella. Presione suavemente en el frangipane y espolvorear las almendras en rodajas entre las peras.", "Hornee por 45 minutos, o hasta que la masa esté dorada y la frangipane firme al tacto. Retire del horno y cepille todo con la mermelada de albaricoque.", "Para la guinda, mezcle el azúcar glas con el jugo de limón hasta que tenga una pasta suave que rocía con una cuchara. Agregue un poco de agua si la formación de hielo es demasiado espesa.", "Enfríe en una rejilla de alambre de 5 a 10 minutos antes de retirar la caja de tarta. Cuando esté frío, rocíe el glaseado y sirva caliente o frío."], "url": "www_bbc_co_uk_food_recipes_christmas_frangipane_23040", "title": "Tarta de frangipane de Navidad", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace tarta de 1 x 25 cm / 10 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para el despliegue", "1 cucharadita de bicarbonato de soda", "2 cucharaditas de jengibre molido", "1 cucharadita de canela molida", "125 g / 4½ oz de mantequilla", "175g / 6oz de azúcar morena suave y ligera", "1 huevo de gallinas camperas", "4 cucharadas de jarabe de oro", "escribir glaseado", "decoraciones para pasteles"], "method": ["Tamizar la harina, el bicarbonato de soda, el jengibre y la canela y verter en el tazón de un procesador de alimentos. Agregue la mantequilla y mezcle hasta que la mezcla se vea como pan rallado. Agregue el azúcar.", "Batir ligeramente el huevo y el sirope dorado, agregar al procesador de alimentos y pulsar hasta que la mezcla se aglutine. Incline la masa, amasar brevemente hasta que quede suave, envolver en clingfim y dejar enfriar en la nevera durante 15 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con papel antigrasa.", "Ruede la masa a un espesor de 0.5cm / ¼ en una superficie ligeramente enharinada. Usando cortadores, corte las formas de los hombres de jengibre y colóquelas en la bandeja de hornear, dejando un espacio entre ellas. Para las decoraciones, use un pincho para hacer un pequeño orificio en la parte superior de cada galleta.", "Hornea de 12 a 15 minutos o hasta que esté ligeramente dorado. Déjela en la bandeja por 10 minutos y luego muévala a una rejilla para terminar de enfriar. Cuando se enfríe decorar con la escritura guinda y decoraciones de la torta."], "url": "www_bbc_co_uk_food_recipes_christmas_gingerbread_84244", "title": "Hombres de jengibre de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_gingerbread_84244_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["cubos de hielo", "Vodka de 50ml / 2fl oz", "25ml / 1fl oz Chambord", "25 ml / 1 fl oz de licor de cacao (como Creme de cacao blanc)", "1 ramita de romero"], "method": ["Coloque los cubitos de hielo generosamente en una coctelera. Agregue el vodka, Chambord y el licor de cacao y agite bien. Vierta en un vaso de martini (dejando el hielo en la coctelera) y agregue una ramita de romero. Beba, lleno de alegría navideña."], "url": "www_bbc_co_uk_food_recipes_christmas_martini_77981", "title": "Navidad Martini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_martini_77981_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 claras de huevo de rango medio", "Azúcar en polvo de 110 g / 4 oz", "50g / 1¾oz de azúcar glas", "1 cucharadita de agua de rosas", "par de gotas de colorante de comida roja o rosa", "2 cucharadas de crema doble", "50g / 1¾oz de chocolate blanco, roto en pedazos", "Frambuesas de 25 g / 1 oz, finamente picadas", "40 g / 1½ oz de chocolate negro (opcional)", "1 cucharada de cuajada de limón (opcional)", "150ml / 5fl oz de crema batida"], "method": ["Para hacer los merengues, precaliente el horno a 120C / 100C Fan / Gas ½. Línea 2 bandejas para hornear con papel de hornear.", "Batir las claras de huevo en un recipiente de vidrio limpio hasta que se formen picos suaves.", "Agregue el azúcar una cucharada a la vez hasta que la mezcla esté espesa, lisa y brillante. Tamizar el azúcar glas y luego doblar. Doblar el agua de rosas y colorante de alimentos.", "Coloque cucharaditas de la mezcla en las bandejas preparadas para hacer unos 40 merengues pequeños. Hornee durante 2 horas, luego retírelo del horno y déjelo enfriar.", "Para hacer el relleno de frambuesa, caliente la crema en una olla pequeña hasta que hierva. Retirar del fuego y agregar el chocolate blanco. Mezcle las frambuesas. Deja enfriar un poco.", "Haz los besitos de merengues usando una cucharadita de relleno de frambuesa para emparedar 2 merengues.", "También puede usar chocolate o crema de limón para unir los merengues. Para el chocolate, derrita el chocolate en el microondas o en un recipiente de vidrio sobre una olla con agua hirviendo. Deje que se enfríe un poco, luego sumerja un lado plano de un merengue en el chocolate y coloque 2 merengues juntos. Para la cuajada de limón, revuelva la cuajada de limón en la crema batida y úsela para unir los merengues."], "url": "www_bbc_co_uk_food_recipes_christmas_mini_meringues_81206", "title": "Mini merengues de frambuesa y chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 38 besos de merengue", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_mini_meringues_81206_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g-150g / 4½-5½ oz de mantequilla", "Harina normal de 250g / 9oz", "425 ml / 15 fl oz de leche", "3 huevos de gallinas camperas", "1½ cucharadita de polvo de hornear", "1 cucharadita de sal", "4 cucharadas de cebollines frescos finamente picados", "1 cucharada de vinagre de vino blanco", "4 huevos de pato", "150g / 5½oz de hojas de espinaca baby", "200g / 7oz de crema fresca", "150 g / 5½ oz de salmón ahumado en rodajas, para servir"], "method": ["Precaliente un wafle maker en un ajuste medio y precaliente el horno a 140C / 120C Fan / Gas 1.", "Derrita la mantequilla en una cacerola a fuego lento, luego déjela enfriar un poco.", "En un tazón, mezcle la harina, la mitad de la leche, 3 huevos, polvo de hornear y sal. Agregue la mayor parte de la mantequilla derretida y la leche restante hasta que estén suaves y bien combinados, luego agregue 3 cucharadas de cebollín.", "Engrase la máquina de hacer gofres con algo de la mantequilla derretida restante. Vierte un poco de la masa de waffle en cada pocillo de la máquina para hacer gofres, cierra la tapa y cocina durante 4-5 minutos, o hasta que estén dorados y crujientes. Retire de la máquina para hacer gofres y transfiéralo a una bandeja para hornear, luego manténgalo caliente en el horno. Repita el proceso con la mantequilla restante y la masa.", "Mientras tanto, ponga a hervir un recipiente con agua y prepare un recipiente con agua helada. Agregue el vinagre de vino blanco a la sartén, luego agite el agua hirviendo y agregue un huevo de pato en el vórtice. Reduzca el fuego hasta que el agua hierva a fuego lento y cocine por 2-3 minutos, o hasta que esté firme en el exterior, pero moqueando en el medio. Retire de la sartén con una espumadera y baje al agua helada. Repita el proceso con los huevos restantes.", "Cuando esté listo para servir, caliente la sartén que contiene la mantequilla derretida restante y agregue la espinaca; cocina hasta que se marchite. Sazonar con sal y pimienta, luego reservar para escurrir sobre papel de cocina.", "Regrese la sartén del agua de cocción furtiva a ebullición, luego devuelva los huevos escalfados al agua durante 1 minuto para que se caliente.", "Mientras tanto, mezcle la crème fraîche con la cucharada restante de cebollines picados, y sazone con sal y pimienta.", "Para servir, divida los waffles entre 4 platos. Cubra cada uno con algunas de las espinacas, unas rodajas de salmón ahumado y un huevo de pato, además de una cucharada de la cebolleta crème fraîche."], "url": "www_bbc_co_uk_food_recipes_christmas_morning_26289", "title": "Gofres de la mañana de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de arándanos rojos, frescos o congelados", "200ml / 7fl oz de jugo de naranja", "1 pizca bayas de enebro molido", "100 g / 3½ oz de azúcar en polvo", "1 gran pan blanco crujiente, como pugliese, masa fermentada o pain de campagne", "2 cebollas rojas, finamente rebanadas", "Hojas de cohete de 70 g / 2½ oz", "500g / 1lb 2oz de relleno sobrante, aproximadamente picado", "750g / 1lb 10oz de carne fría cocida, como pollo, pavo, jamón o cerdo", "3 bolas de mozzarella, escurridas y en rodajas finas", "sal marina y pimienta negra recién molida"], "method": ["Caliente los arándanos, el jugo de naranja y el enebro en una cacerola hasta que la mezcla esté hirviendo. Agregue el azúcar y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, revolviendo bien hasta que el azúcar se haya disuelto. Cocine a fuego lento durante 5-8 minutos, revolviendo ocasionalmente, hasta que los arándanos se rompan y la mezcla se espese. Sazonar con sal y pimienta negra y reservar para enfriar.", "Mientras tanto, corte una cuarta parte de la parte superior del pan, aparte esta \"tapa\". Saque todo el pan del interior del pan y reserve para hacer migas de pan que puedan congelarse para usar en otra receta. Extiende un poco de salsa de arándanos en el fondo del pan ahuecado.", "Agregue la cebolla roja, el cohete, el relleno, la carne sobrante y las rodajas de mozzarella al pan en capas hasta que todo se haya agotado. Sazone cada capa con un poco de sal y pimienta negra. Termine con una capa de salsa de arándano.", "Coloque la \"tapa\" sobre la barra. Envuelva el pan con la película adhesiva y déjelo enfriar en la nevera durante al menos 1 hora, pero preferiblemente durante la noche (se mantendrá durante hasta 5 días). Desenvuelva y corte en cuñas para servir."], "url": "www_bbc_co_uk_food_recipes_christmas_pan_bagnat_43210", "title": "Pan de navidad bagnat", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de pasas", "1 naranja grande, ralladura fina y jugo", "Ron con especias 75ml / 2½fl oz", "1 cucharadita de pimienta de Jamaica molida", "½ cucharadita de nuez moscada recién rallada", "1 cucharadita de canela molida", "¼ cucharadita de clavo de olor molido", "125g / 4½oz de azúcar morena oscura", "4 huevos de gallinas camperas, separados", "Crema doble 600ml / 21fl oz"], "method": ["Alinee una lata de pan grande con film transparente.", "Coloque las pasas, el jugo de naranja y la ralladura, el ron y las especias en una cacerola a fuego alto. Llevar a ebullición, luego baje el fuego y cocine a fuego lento hasta que las pasas estén llenas y la mayor parte del líquido haya sido absorbido. Dejar de lado para enfriar.", "Mientras tanto, bata el azúcar y las yemas de huevo juntas en un tazón grande hasta que estén esponjosas y firmes.", "En un recipiente aparte, bata la crema en picos suaves y revuelve en la mezcla de huevo y azúcar con las pasas y cualquier líquido de caza furtiva restante.", "En un tazón limpio, bate las claras de huevo a picos suaves. Agregue la crema y la mezcla de pasas suavemente, una cuchara a la vez.", "Verter en la lata de pan, alisar con el dorso de una cuchara y envolver en film transparente. Congele por 45 minutos, luego bata para distribuir uniformemente las pasas. Congelar durante varias horas, hasta que esté firme. Cortar en rodajas y servir."], "url": "www_bbc_co_uk_food_recipes_christmas_parfait_38775", "title": "Navidad perfecta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo grandes de gallinas camperas", "Azúcar en polvo 350g / 12oz", "1 cucharadita de vinagre de vino blanco", "1 cucharada de harina de maíz", "Crema doble 600ml / 20fl oz", "1 cucharadita de pasta de frijoles de vainilla", "50g / 1¾oz de azúcar glas, tamizado", "Fresas de 200g / 7oz, descascadas y descuartizadas", "Frambuesas 300g / 10½ oz", "Arándanos 200g / 7oz", "50g / 1¾oz de semillas de granada", "algunas hojas de menta, para decorar (opcional)", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 160 ° C / 140 ° Ventilador / Gas 3. Cubra una bandeja grande para hornear con un pergamino para hornear y dibuje un círculo de 30 cm en el medio del papel. Dibuja un círculo de 15 cm en el centro del círculo más grande para hacer un anillo.", "Coloque las claras de huevo en un tazón para mezclar limpio y bata con un batidor eléctrico hasta que se formen picos suaves cuando se quite el batidor. Poco a poco agregue el azúcar un poco a la vez, batiendo a la máxima velocidad hasta que estén rígidos y brillantes. Mezcle el vinagre y la harina de maíz en una taza hasta que quede suave, luego mezcle con las claras de huevo.", "Vierta el merengue en el anillo dibujado en el pergamino para hornear. Usando una cuchara grande, haga una zanja poco profunda en el merengue para que la crema y la fruta se asienten.", "Transfiera al horno y reduzca inmediatamente la temperatura a 140 ° C / 120 ° Ventilador / Gas 1. Hornee durante 1 hora-1 hora y 15 minutos, hasta que el exterior esté duro pero aún blanco. Apague el horno y deje el pavlova adentro durante una hora o toda la noche para que se enfríe y seque.", "Para ensamblar, batir la crema, la pasta de vainilla y el azúcar glas hasta que se formen picos rígidos cuando se quite la batidora. Con una cuchara, coloca la crema en la trinchera del merengue. Coloque las fresas, las frambuesas, los arándanos y la granada en la parte superior y decore con algunas hojas de menta, si las usa. Para servir, espolvorear con azúcar glas y cortar en trozos."], "url": "www_bbc_co_uk_food_recipes_christmas_pavlova_20589", "title": "Pavlova de navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pavlova_20589_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite vegetal", "50g / 1¾oz de palomitas de maíz", "2 cucharadas de cacao", "1 cucharadita de jengibre molido", "3 naranjas, solo cáscara", "3 cucharadas de miel líquida"], "method": ["Calentar el aceite durante 20-30 segundos a fuego medio en una olla grande con tapa. Agregue las palomitas de maíz, cubra con una tapa y cocine por unos minutos, hasta que todo se haya reventado, dándole un batido hasta la mitad.", "Incline las palomitas de maíz en un tazón. Mientras todavía esté caliente, tamiza el cacao y el jengibre, luego espolvorea la cáscara de naranja y rocía la miel. Mezcle bien y sirva."], "url": "www_bbc_co_uk_food_recipes_christmas_popcorn_55253", "title": "Palomitas de maíz de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_popcorn_55253_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Lomo de cerdo de 3 kg / 6 libras y 8 onzas, deshuesado y con mariposa (alternativamente, use panceta o paleta de cerdo)", "sal y pimienta negra recién molida", "2 limones, solo cáscara", "15g / ½ oz de parmesano rallado", "175g / 6oz de carne picada de cerdo", "Hígados de pollo de 175g / 6oz, más o menos picados", "150 g / 5½ oz cebollas, finamente picadas", "5g de salvia fresca, hojas recogidas y picadas", "8g de romero fresco, hojas recogidas y picadas", "8g de tomillo fresco, hojas recogidas", "Pan de 350g / 12oz, remojado en 200 ml / 7 fl oz de agua y roto en trozos pequeños", "15 g / ½ oz de piñones", "Sultanas 30g / 1oz", "6 rebanadas de mortadela con pistachos (aproximadamente 200 g / 7 oz)", "dash aceite de oliva", "4 zanahorias", "1 cebolla", "250ml / 9fl oz de vino blanco", "70ml/2¼fl oz Vin Santo", "3 cucharadas de aceite de oliva", "1kg / 2lb 4oz de papas, peladas y cortadas en cuartos, hervidas por par", "4 ramitas de romero fresco", "6 dientes de ajo, con piel, aplastados"], "method": ["Precalentar el horno a 220C / 450F / Gas 7. Sazonar el cerdo con sal y pimienta y frotarlo en el cerdo, junto con la ralladura de limón.", "Coloque el parmesano, carne picada de cerdo, hígados de pollo, cebollas, salvia, romero, tomillo, pan, piñones y pasas, en un tazón grande y mezcle.", "Extiende el relleno en la parte superior del lomo y rueda hacia un lado. Cubra con dos rebanadas de mortadela y luego ruede hasta la mitad.", "Tire del otro lado del león, agregue el resto del relleno, luego presione y coloque cuatro rodajas de mortadela. Rollo para asegurar y atar con hilo de cocina. Frote con aceite de oliva y sazone con sal y pimienta.", "Coloque las zanahorias y la cebolla entera, el vino, Vin Santo y 125 ml / 4 fl oz de agua en el fondo de la bandeja de horno y coloque el cerdo en la parte superior.", "Cocine en el horno por 30 minutos y luego baje el horno a 150C / 300F / Gas 3 por tres horas.", "Para las patatas salteadas con romero y ajo, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue las papas y cocine por un par de minutos. Agregue el romero y el ajo y cocine hasta que las papas estén crujientes y cocidas.", "Para servir, coloque el cerdo y las papas en el centro de la mesa y deje que las personas se ayuden a sí mismas."], "url": "www_bbc_co_uk_food_recipes_christmas_porchetta_19448", "title": "Porchetta de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de frutas secas mezcladas (pasas, grosellas, pasas sultanas)", "100 g / 3½ oz de ciruelas pasas listas para comer, picadas o dejadas enteras", "100g / 3½oz de azúcar moreno oscuro", "4 cucharadas de ron oscuro", "100ml / 3½fl oz de grasa", "100g / 3½oz de nueces picadas", "100 g / 3½ oz de almendras blanqueadas", "100 g / 3½ oz de almendras molidas", "100g / 3½ oz de pan blanco fresco", "50g / 1¾oz de harina natural", "100g / 3½oz de mantequilla congelada, rallada, más un poco extra para engrasar", "½ cucharadita de nuez moscada recién rallada", "1 cucharadita de canela molida", "2 cucharaditas de especias mixtas", "100 g / 3½ oz de cerezas glaseadas picadas (o dejadas enteras si lo prefieres)", "3 huevos grandes de gallinas camperas, golpeados"], "method": ["Combine la fruta mixta, las ciruelas pasas, el azúcar mascabado, el ron y la cerveza en un tazón. Revuelva bien para mezclar, cubra y deje reposar durante 24 horas.", "Después de 24 horas, mezcle las nueces, almendras, almendras molidas, pan rallado, harina, mantequilla, especias, cerezas y huevos junto con la mezcla de fruta empapada en un tazón grande para mezclar, asegurándose de incluir todo el licor de remojo de la fruta empapada. Mezcle bien hasta que esté completamente combinado (permita que todos los miembros de la familia se muevan y pidan un deseo).", "Cubra con film transparente y déjelo reposar en un lugar fresco durante 24 horas.", "Después de 24 horas, engrase un recipiente de pudín de 1,2 litros / 2 pinta con mantequilla. Corta un círculo de papel para hornear y colócalo en el fondo del cuenco del pudín y luego enjuágate con un poco más de mantequilla. Empaque la mezcla de budín en el recipiente de budín, presionando mientras lo agrega. Doble un pliegue en el medio de un pedazo grande de papel para hornear y colóquelo sobre el pudín. Cubra con una hoja grande de papel plisado, asegurándose de que los pliegues estén uno encima del otro. Asegúrelo firmemente con una cuerda de cocina atada debajo del borde del recipiente de budín.", "Coloque un platillo revuelto en una cacerola grande con un cuarto de agua. Dobla un pedazo largo de papel de aluminio en cuartos a lo largo para crear una tira larga y coloca el recipiente de budín en el medio de la tira. Lleva los lados de la tira a los costados del recipiente de budín y baja a la cacerola. Asegúrese de que el agua en la cacerola se encuentre a un tercio del camino hacia el costado de la fuente del pudín, pero no cerca de la parte superior del lavabo. Deje los extremos de la tira de papel aluminio colgando sobre el costado para que sea más fácil quitar el pudín más tarde.", "Ponga el agua a hervir y luego reduzca el fuego a fuego lento. Cocine a fuego lento durante 5-6 horas, completando el nivel del agua según sea necesario durante la cocción (no permita que la bandeja se seque).", "Una vez que el budín esté cocido, retíralo de la sartén y déjalo a un lado para que se enfríe. El postre se puede almacenar hasta dos años en un lugar fresco y seco. Para servir, recaliente el pudín cociendo al vapor de nuevo (de la misma manera) durante dos horas, o hasta que esté caliente todo el tiempo. Alternativamente, retire la lámina y vuelva a calentar en el microondas."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_41498", "title": "pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 1 x 1.2 litro / 2 pinta de pudín", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_41498_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz sobrantes de pudin de Navidad", "8 higos negros frescos, cortados en cuartos", "250ml / 9fl oz de jerez Pedro Ximénez", "250g / 9oz de mascarpone", "Crema doble 250ml / 9fl oz", "azúcar glas, al gusto", "Pacanas desmenuzadas mezcladas 150g / 5½oz y almendras copos tostadas", "pellizcar canela molida", "Virutas de chocolate 100g / 3½oz, para decorar", "500ml / 18fl oz de leche entera", "100ml / 3½ fl oz crema doble", "1 vaina de vainilla, dividida por la mitad longitudinalmente", "6 yemas de huevo", "2 cucharadas de harina de maíz", "50g / 1¾oz de azúcar moreno"], "method": ["Por un momento, divide el pudin en el fondo de un plato de servir grande o vasos para servir individuales. Cubra con los higos en cuartos y salpique el jerez.", "Para la crema pastelera, caliente la leche, la crema y la vainilla en una cacerola hasta que hierva. Retirar del fuego y reservar para enfriar un poco. En un recipiente, mezcle las yemas, la harina de maíz y el azúcar y luego vierta la mezcla de leche tibia (si la leche está demasiado caliente, los huevos revolverán). Vuelva a colocar en la sartén y bata a fuego lento hasta que espese. Retirar del fuego y colar. Cubra la superficie de la crema pastelera con papel de hornear para evitar que se forme una piel y deje que se enfríe.", "Batir el mascarpone y la crema doble con el azúcar glas, al gusto.", "Vierta la crema enfriada sobre el pudín mojado y cubra con la crema de mascarpone. Decorar con nueces desmenuzadas, almendras, canela y virutas de chocolate. Enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_and_px_59638", "title": "Pudín de Navidad y bagatela de jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas 250g / 8oz", "150g / 5oz de chocolate con leche", "150g / 5oz de chocolate negro", "100g / 3½oz de mantequilla sin sal", "150g / 5oz de jarabe dorado", "100 g / 3½ oz de albaricoques secos, picados", "75 g / 2½ oz pasas", "Pacanas de 60g / 2oz, picadas", "Malvaviscos de 200g / 7oz, cortados en trozos pequeños", "100g / 3½oz de chocolate blanco, roto en pedazos", "2 cerezas heladas", "ramita acebo deja"], "method": ["Use película adhesiva para revestir un tazón de pudín de 1,2 litros / 2 pinta, dejando una película adhesiva adicional colgando sobre los lados.", "Bash las galletas en pedazos usando un rodillo. (¡Póngalos en una bolsa de plástico primero para que no vayan a todas partes!)", "Derrita el chocolate, la mantequilla y el sirope dorado en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. Revuelva de vez en cuando.", "Retire el tazón del fuego y agregue los bizcochos, albaricoques, pasas, nueces y malvaviscos rotos.", "Coloque la mezcla en el cuenco y empuje hacia abajo para minimizar las bolsas de aire.", "Dejar enfriar, luego poner en la nevera durante la noche para establecer.", "Al día siguiente, coloque el bol con leche en un plato de agua caliente durante unos segundos para soltarlo del bol con leche. Coloque boca abajo en un plato para servir.", "Derretir el chocolate blanco en un recipiente a prueba de calor sobre una olla de agua hirviendo. Deje que se enfríe y espese un poco antes de verter un poco en la parte superior del budín y empuje suavemente hacia abajo para formar una forma de flan.", "Cubra con las cerezas glaseadas y el acebo y sirva."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_fridge_58372", "title": "Tarta de helado de pudín de Navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 1 x 1.2 litro / 2 pinta de pudín", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_fridge_58372_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 yemas de huevo de gallinas camperas", "120 g / 4½ oz de azúcar en polvo", "Leche 250ml / 9fl oz", "Crema doble 250ml / 9fl oz", "2 vainas de vainilla, partidas abiertas y semillas raspadas", "200 g / 7 oz de pudín de Navidad cocido, desmenuzado", "Azúcar en polvo de 110 g / 4 oz", "1 estrella de anís", "1 ramita de canela", "pellizcar la nuez moscada fresca", "110g / 4oz de mantequilla sin sal", "Crema doble 175ml / 6fl oz", "50 g / 1¾oz de mantequilla sin sal", "1 piña, pelada, sin corazón y cortada en rodajas"], "method": ["Para el helado con leche de Navidad, bata las yemas de huevo con 60 g / 2¼ oz de azúcar en polvo hasta que quede espeso y cremoso.", "Coloque el resto del azúcar impalpable, la leche, la crema y las semillas y vainas de vainilla en una sartén y deje que hierva. Vierta la leche caliente en las yemas batidas y revuelva bien.", "Regrese la mezcla a la sartén y cocine a fuego muy lento, revolviendo constantemente con una espátula, hasta que la mezcla tenga un grosor suficiente como para cubrir la parte posterior de una cuchara.", "Enfríe la mezcla de vainilla, luego refrigérela durante al menos una hora. Cuele la mezcla en una máquina para hacer helados y revuelva según las instrucciones del fabricante. Así como el helado es lo suficientemente suave para mezclar, agregue el pudín de Navidad y congélelo.", "Para el caramelo especiado, coloque el azúcar, el anís estrellado, la canela y la nuez moscada en una sartén y cocine, sin revolver, hasta que el azúcar se derrita y quede dorado.", "Agregue la mantequilla y la crema doble y cocine a fuego lento. Cocine por 3-5 minutos, o hasta que se espese, luego pase a través de un colador fino en una sartén limpia.", "Para la piña salteada, caliente una sartén grande y agregue la mantequilla. Una vez caliente y derretido, agregue la piña y cocine por un par de minutos en cada lado.", "Para servir, coloque la piña cocida en platos para servir con una cucharada de helado. Rocíe la salsa de caramelo."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_ice_86469", "title": "Helado de pudín de Navidad con piña salteada y un caramelo especiado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "500g / 1lb 2oz de pudín de Navidad cocido", "Leche entera con 400ml / 14oz", "6 yemas de huevo grandes de gallinas camperas", "8 claras de huevo grandes de gallinas camperas", "azúcar en polvo, para quitar el polvo", "helado de mantequilla de brandy, para servir"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Derrita la mitad de la mantequilla y úsela para untar un plato de soufflé de 2 litros / 3½ pinta.", "Pon el pudín de Navidad en un procesador de alimentos y pulsa para romperlo todo. Déjalo en el procesador de alimentos.", "Llevar la leche a ebullición en una olla pequeña. Agregue al pudín de Navidad, mezclándolo hasta que esté bien combinado. Agregue las yemas a la mezcla de a una por vez, mezclando cada adición.", "Batir las claras de huevo con una pizca de sal en un bol hasta que se formen picos rígidos cuando se quite el batidor del bol.", "Doble las claras de huevo batidas con cuidado en la mezcla de pudín de Navidad.", "Coloca la mezcla en el plato y hornea por 40 minutos. Tenga cuidado de no quemar la parte superior.", "Retirar del horno, espolvorear con azúcar glas y servir con helado de mantequilla de brandy."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_souffl_48184", "title": "Soufflé de pudín de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 270 g / 9½ oz", "150g / 5½oz de mantequilla sin sal, fría", "50 g / 1¾oz de almendras molidas", "1 limón o naranja, ralladura rallada solamente", "1 vaina de vainilla, solo semillas", "100g / 3½oz de azúcar glasé", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "175ml / 6fl de leche en oz", "Crema doble de 75 g / 2½ oz", "½ vaina de vainilla, semillas retiradas", "90g / 3¼ oz de azúcar en polvo", "75 g / 2½ oz de yemas de huevo de gallinas camperas (alrededor de 4-5 yemas)", "15g / ½ oz de harina de maíz", "15g / ½ oz de harina natural", "15 g / ½ onza de mantequilla, derretida", "150 g / 5½ oz de almendras molidas", "Azúcar demerara 115 g / 4 oz", "175g / 6oz de mantequilla sin sal", "Harina normal de 85g / 3oz", "1 limón, ralladura solamente", "100 g / 3½ oz de almendras blanqueadas", "25 g / 1 oz de piñones", "125g / 4½oz de azúcar glasé", "30ml / 1fl oz de licor de naranja", "Salsa de arándanos 250 g / 9 oz", "25 g / 1 oz de azúcar en polvo", "125 g / 4½ oz de queso mascarpone", "100ml / 3½ fl oz crema doble", "25g / 1oz de azúcar glas", "2 cucharadas de licor italiano con sabor a almendra, como Amaretto", "pizca de nuez moscada recién rallada", "250g / 9oz de pudín de Navidad", "30g / 1oz de almendras rebanadas", "azúcar en polvo, para quitar el polvo"], "method": ["Para hacer la masa, separar todos los ingredientes de la masa de los huevos en un procesador de alimentos y pulsar hasta que la masa tenga una textura como pan rallado.", "Agregue los huevos y el pulso hasta que la mezcla comience a formar una bola. Dale la vuelta a una superficie enharinada y trabaja lo menos posible hasta que esté suave. Forma en una bola y aplana. Envuelva la película adhesiva y relájese durante al menos tres horas.", "Para la crema pastelera, coloque la leche, la crema, la vaina de vainilla y 60 g / 2¼ oz del azúcar en una sartén y deje que hierva.", "En un tazón limpio, batir las yemas con el azúcar restante hasta que estén pálidas.", "Mezcle la harina de maíz y la harina en la mezcla de yema. Vierta la mitad de la leche en la mezcla de yema y mezcle bien.", "Agregue la leche restante, coloque de nuevo en la cacerola y cocine hasta que se espese.", "Agregue la mantequilla y mezcle. Pasa a través de un tamiz fino y frío. Cubra con una película adhesiva y perfore con un tenedor para dejar salir el vapor. Dejar de lado en la nevera.", "Para la cobertura de crumble, en un tazón, frote todos los ingredientes con las manos hasta que se asemeje a pan rallado. Ponlo a un lado.", "Para las almendras cristalizadas y los piñones, coloque todos los ingredientes en una cacerola de fondo grueso.", "Coloque a fuego moderado y revuelva hasta que el azúcar se cristalice y cubra todas las almendras y los granos de pino. Notarás un polvo blanquecino que se forma a los lados de la sartén. Revuelva esto en la sartén ya que esto inicia el proceso de cristalización. Revuelva hasta que todas las nueces estén cubiertas.", "Dispersar en un plato o bandeja de horno y dejar hasta que esté frío. Almacene en un recipiente hermético hasta que lo necesite.", "Para el puré de salsa de arándano, coloque todos los ingredientes con 75ml / 2½fl de agua en una cacerola y llévelo a ebullición. Pruebe, asegúrese de que esté lo suficientemente dulce y luego licúe con una licuadora. Pasar a través de un tamiz fino y dejar enfriar, luego almacenar en una botella squeezy hasta que esté listo para usar.", "Para la crema de mascarpone y amaretto, coloque todos los ingredientes en un tazón y revuelva hasta que el azúcar se disuelva.", "Bata hasta que se formen picos medio rígidos cuando se retire la batidora de la taza. Cubra y guarde en el refrigerador hasta que lo necesite.", "Para hacer la caja de tarta, precaliente el horno a 180C / 350F / Gas 4.", "Engrase cuatro 12cm / 4½ en latas agrias de fondo suelto. Use la masa de hojaldre para revestir la lata y pinche la base con un tenedor y déjela reposar en la nevera durante aproximadamente 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Cubra la masa con papel pergamino y pese con arroz crudo o granos de cerámica para hornear. Hornee la persiana de pastelería durante 15 minutos, retire el papel y el arroz o los frijoles y devuelva las cajas de repostería al horno durante unos minutos más, hasta que estén doradas.", "Para hacer el relleno, caliente el pudin de Navidad y agregue a la crema de pastelería fresca con las almendras. Pipe la mezcla en las tartas.", "Espolvorear con el crumble de almendras. Regrese al horno y cocine durante 15 minutos o hasta que el crumble se dore.", "Dejar enfriar un poco, retirar de latas y polvo con azúcar glas", "Para servir, colóquelo en el plato, vístelo con un poco de puré de salsa de arándanos, nueces cristalizadas y una bola de crema de mascarpone."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_tart_59676", "title": "Tarta de pudín de Navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pastel de maderas 250 g / 9 oz, en rodajas", "100-150ml / 3½-5fl oz de vino de jengibre o jerez", "250g / 9 oz de pudín de Navidad, cortado en trozos.", "1 mango maduro, pelado y en rodajas finas", "½ piña pequeña, o 227g de piña de estaño en jugo propio, cortado en cubitos", "Flan de calidad de 500 ml / 18 fl oz", "1 cucharada de azúcar glas", "300 ml / 10 fl oz doble crema", "50g / 1¾oz de almendras en copos", "1 naranja, piel recién cortada"], "method": ["Coloque la torta de madeira alrededor de la base de un tazón pequeño. Vierta más de la mitad del vino de jengibre, luego presione el budín de Navidad en la parte superior en cualquier espacio. Agregue el vino restante, pero asegúrese de que la bagatela no se moje demasiado. Arregle el mango por encima, luego la piña.", "Verter sobre la crema y suavizar con el dorso de una cuchara. Refrigere por 2 horas para permitir que la natilla se asiente.", "Mientras tanto, tamiza el azúcar glas en la crema doble y bate hasta obtener picos suaves. Vierta sobre la bagatela y alise.", "Tueste ligeramente las almendras en una sartén seca y déjelas enfriar. Decora la bagatela con las almendras y la cáscara de naranja."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_47025", "title": "Pastelito de Navidad", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz sobra el pudin navideño (aproximadamente medio budín grande)", "2 cucharadas de jerez seco", "400 g de mitades de pera de lata en jugo", "500g / 1lb 2 oz de crema lista para usar", "150 g / 5½ oz de mascarpone", "300 ml / 10 fl oz oz o crema doble", "1 cuadrado de chocolate negro", "puñado de almendras en copos (opcional)"], "method": ["Rompa el pudín de Navidad en trozos y colóquelo en el fondo de un bol pequeño en una capa pareja. Espolvorea sobre el jerez y 1 cucharada de jugo de pera.", "Escurra las peras y córtelas a la mitad, luego póngalas sobre la torta.", "Batir la crema y el mascarpone y una cuchara encima de las peras.", "Bata la crema hasta que se formen picos suaves, luego cúbrela con la crema pastelera. Rallar finamente sobre el chocolate y espolvorear sobre las almendras copos, si se usa."], "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_58574", "title": "Pastelito de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_trifle_58574_16x9.jpg", "isVegetarian": true, "recommendations": 0}]