[{"ingredients": ["500g / 1lb 2 oz papa para hornear (preferiblemente Marfona), pelada, cortada en piezas de 1cm / ½ en trozos", "750ml / 1pint 10 fl oz de agua", "3 cucharadas de aceite de oliva", "3 chalotes de plátano, pelados, en rodajas", "3 dientes de ajo, pelados, picados", "750ml / 1pint 10fl oz de caldo de pollo", "Leche de 110 ml / 4 fl oz", "4 ramitas de tomillo frescas, solo hojas", "sal y pimienta negra recién molida", "4 salchichas pequeñas de chorizo, sin piel, en rodajas", "8 vieiras, limpiadas, huevas removidas, cada vieira cortada a la mitad horizontalmente para formar dos vieiras más finas", "½ limón, solo jugo", "200 g / 7 oz hojas de espinaca bebé", "restos de piel de pollo asado, en rodajas, para servir"], "method": ["Coloque las papas picadas en un recipiente, cúbralas con el agua y déjelas a un lado para remojarlas.", "Mientras tanto, caliente una cucharada de aceite en una sartén a fuego medio y fría los chalotes y la mitad del ajo picado durante 2-3 minutos, o hasta que se ablanden.", "Agregue la papa picada y el agua empapada a la sartén y deje que hierva. Agregue el caldo de pollo y devuelva la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante 20-25 minutos, o hasta que las papas estén tiernas.", "Vierta la leche, luego transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave.", "Regrese la sopa mezclada a la cacerola y agregue el ajo restante y la mitad del tomillo. Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar enfriar un poco.", "Mientras tanto, caliente una cucharada de aceite restante en una sartén a fuego medio y fría las rodajas de chorizo ​​durante 30 segundos, 1 minuto en cada lado, o hasta que estén doradas por ambos lados.", "Sazonar las vieiras, al gusto, con sal y pimienta negra recién molida. Caliente el aceite de oliva restante en una sartén grande separada y fríe las vieiras durante 1-2 minutos en cada lado, o hasta que estén doradas por ambos lados y apenas cocidas. Agregue el jugo de limón, al gusto.", "Para servir, cuela la sopa en cada uno de los 4 tazones para servir. Con cuidado, flote 4 pedazos de vieiras en cada porción de souplo, cubra con algunas rodajas de chorizo ​​y un puñado de hojas de espinaca. Espolvoree sobre la piel de pollo rebanada, las hojas de tomillo restantes y rocíe sobre el aceite de chorizo ​​de la sartén que se usa para cocinar el chorizo."], "url": "www_bbc_co_uk_food_recipes_chickenandpotatosoup_93444", "title": "Sopa de patata con vieiras, chorizo ​​y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pollo 225g / 8oz cortada en 16 rebanadas", "48 gambas, descongelar si está congelado", "4 grandes racimos de cilantro, lavados y picados aproximadamente", "5 chiles rojos grandes, cortados en julianas finas", "sal y pimienta para probar", "8 rollos de rollitos de primavera", "aceite para freír"], "method": ["Sazonar el pollo con sal y pimienta. Coloque una rebanada de pollo en diagonal sobre la masa del rollo de primavera.", "Coloque 6 gambas sobre la rebanada de pollo. Cubra con dos o tres tiras de chile y un puñado de cilantro.", "Coloque otra rebanada de pollo sobre el cilantro.", "Doble los extremos de la masa y enrolle en forma de sobre. Seguro con un palito de cóctel.", "Freír los rollos de pollo y gambas en aceite caliente hasta que estén dorados y cocidos, aproximadamente 2-3 minutos. No tenga aceite demasiado caliente o los panecillos se dorarán antes de que el relleno esté bien cocido.", "Escurrir en toallas de cocina absorbentes.", "Retire el palito de cóctel de cada rollo."], "url": "www_bbc_co_uk_food_recipes_chickenandprawnrolls_11053", "title": "Rollos de pollo y gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo, sin piel", "4 rebanadas de jamón", "1 cucharadita de aceite de oliva", "8 tallos de espárragos", "1 limón, ralladura y jugo", "sal y pimienta negra recién molida"], "method": ["Remoje cuatro palos de kebab en agua fría durante diez minutos. Agitar para secar", "Corta el pollo en cuatro tiras largas y delgadas. Envuelva una loncha de jamón alrededor de cada tira de pollo. Con cuidado, pase una tira, lenthways en zigzag, en cada palo de kebab.", "Caliente una sartén a fuego medio. Vierta el aceite de oliva. Cocine los kebabs en la plancha durante 8-10 minutos, hasta que el jamón esté crujiente y el pollo esté cocido, volteándolos después de cinco minutos. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho). Mantenga el pollo en un lugar tibio y mantenga la plancha en el fuego.", "Para los espárragos, quítese el resistente extremo de madera de los tallos. Frote el resto de los tallos de espárragos con aceite de oliva, espolvoree la ralladura de limón y sazone con sal y pimienta negra recién molida, al gusto.", "Cocine los espárragos en la sartén de la plancha caliente, volteándolos cada pocos minutos, hasta que los espárragos estén ligeramente chamuscados y tiernos. Vierta el jugo de limón.", "Coloque los pinchos de pollo y jamón en un plato con los espárragos a la plancha de limón al lado y servir."], "url": "www_bbc_co_uk_food_recipes_chickenandprosciutto_92360", "title": "Brochetas de pollo y jamón serrano con espárragos a la plancha de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2½ cm / 1 en pieza de jengibre fresco, pelado", "2 dientes de ajo, pelados", "¼ cucharadita de sal", "1 lima, solo jugo", "½ cucharadita de cilantro molido", "½ cucharadita de chile en polvo", "½ cucharadita de cúrcuma molida", "½ cucharadita de comino molido", "2 pechugas de pollo, cortadas en pedazos del tamaño de un bocado", "75 ml / 2½ fl oz oz yogur", "1 cucharada de aceite de girasol", "1 cebolla roja, pelada y finamente cortada", "2 tomates, semillas eliminadas, carne picada finamente", "1 cucharada de puré de tomate", "salpicar agua", "75ml / 2½ fl oz crema doble", "150g / 5oz de hojas de espinaca baby", "pequeñas hojas de cilantro fresco, picadas", "100g / 3½oz de arroz basmati, enjuagado y escurrido, luego cocido de acuerdo con el paquete"], "method": ["Para el adobo, picar finamente el jengibre y el ajo. Espolvorea la sal sobre la sal y pica un poco más, luego colócala en un bol.", "Agregue el jugo de lima, el cilantro molido, el chile en polvo, la cúrcuma molida y el comino molido a la taza y mezcle bien.", "Agregue las piezas de pollo y el yogur y revuelva para cubrir el pollo. Deje marinar durante al menos 10-15 minutos (o durante una hora si es posible, cubiertos en la nevera).", "Para el curry, caliente el aceite en una sartén a fuego lento y agregue la cebolla. Fría durante 1-2 minutos, luego agregue los tomates y el puré de tomate y cocine suavemente durante aproximadamente un minuto.", "Agregue el pollo a la sartén junto con el adobo y un chorrito de agua.", "Vierta la crema, suba el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que el pollo esté bien cocido. No debe haber rosado cuando lo corte. Si es rosado, cocine por más tiempo.", "Agregue las espinacas a la sartén y revuelva hasta que se marchiten.", "Espolvorea sobre el cilantro.", "Para servir, escurra el arroz y divídalo entre dos platos. Arriba con el curry"], "url": "www_bbc_co_uk_food_recipes_chickenandspinachbal_86977", "title": "Balti de pollo y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandspinachbal_86977_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "½ pechuga de pollo pelada, cortada en tiras", "100g / 3½oz de maíz dulce enlatado", "Mangetout 55g / 2oz", "½ pimiento naranja, cortado en tiras", "300ml / 10fl oz de caldo de pollo", "pan para servir"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por 2-3 minutos para ablandar.", "Agregue las piezas de pollo y freír durante 3-4 minutos hasta que comiencen a colorear, luego agregue el maíz dulce, mangetout y pimienta, freír durante 2-3 minutos más.", "Agregue el caldo y deje hervir a fuego medio durante 8-10 minutos, hasta que todo esté cocido y el líquido se haya reducido un poco.", "Para servir, colóquelo en un cuenco y coma caliente con pan."], "url": "www_bbc_co_uk_food_recipes_chickenandsweetcorns_89352", "title": "Pollo y maíz dulce sofría sopa de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7¼oz de arroz basmati", "1 cucharadita de sal", "2 cucharadas de aceite vegetal", "8 chalotes, picados", "2 cebollas medianas, picadas", "4 dientes de ajo, finamente picados", "2 cucharaditas de jengibre fresco de raíz, rallado", "6 filetes de pechuga de pollo o 2 pechugas de pollo, finamente cortadas en tiras (los filetes de pechuga de pollo son los pequeños filetes tiernos en la parte inferior de la pechuga de pollo, disponibles en algunos supermercados)", "1 cucharadita de chile en polvo", "1 cucharadita de comino molido", "2 cucharaditas de cilantro molido", "½ cucharadita de canela molida", "½ cucharadita de cúrcuma molida", "pizca de nuez moscada recién rallada", "¾ taza de yogurt natural", "2 cucharaditas de azúcar en polvo", "4 o 5 puñados de pasas"], "method": ["Lave el arroz en varios cambios de agua hasta que el agua salga limpia, luego déjelo remojar en agua tibia con la sal durante 30 minutos.", "Escurra el arroz y colóquelo en una sartén con suficiente agua fría para que quede a unos 2 cm / pulgada por encima de la parte superior del arroz.", "Ponga a hervir el agua, luego reduzca el fuego lo más bajo posible, cubra y cocine durante unos diez minutos, o hasta que aparezcan 'agujeros' en la parte superior del arroz y toda el agua haya sido absorbida.", "Calentar el aceite en una sartén, agregar los chalotes, la cebolla, el ajo y el jengibre y freír durante un par de minutos, hasta que estén dorados. Retire una cucharada y reserve para decorar.", "Agregue el pollo y saltee durante cuatro minutos.", "Agregue las especias y revuelva durante un minuto, luego mezcle el yogur y cocine a fuego lento durante 1-2 minutos. Agregue el azúcar, las pasas y el arroz parcialmente cocido. Cubra la sartén con una toalla de té limpia y cubra con una tapa (esto mantendrá todo el vapor).", "Coloque a fuego muy lento y cocine por diez minutos.", "Retirar del fuego y dejar reposar durante cinco minutos.", "Sirva cucharadas grandes con la mezcla de cebolla y chalota reservada."], "url": "www_bbc_co_uk_food_recipes_chickenbiriyani_89035", "title": "Pollo biryani", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbiriyani_89035_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / ½lb de pechuga de pollo en rodajas", "1 cucharada de aceite vegetal", "1 cucharada de aceite de oliva", "1 cucharadita de sal masala", "6 cucharadas de yogurt natural", "1 limón, jugo", "2 dientes de ajo, finamente picados", "½ cucharadita de cúrcuma", "1 cucharada de pimentón", "3 cardamomos, aplastados con cáscara eliminada", "½ cucharada de sal", "1 cucharada de chile molido", "1 cucharada de comino", "puñado de cilantro fresco", "2 tazas de arroz basmati, bien lavado", "1 cebolla picada", "1 diente de ajo, picado", "½ ramita de canela", "2 vainas de cardamomo", "1 cucharada de semillas de hinojo", "1 cucharada de aceite vegetal"], "method": ["Mezcle los ingredientes del adobo y marinadee el pollo durante 2 horas.", "Calienta 1 cucharada de aceite vegetal en una sartén y freír la cebolla en una sartén.", "Agregue el arroz, el ajo, la canela, el cardamomo y las semillas de hinojo.", "Agregue agua fría a 1 pulgada por encima del nivel del arroz y lleve a ebullición.", "Hervir durante 5 minutos y cubrir con una tapa.", "Apague el fuego y déjelo por 20 minutos.", "En una sartén antiadherente, calienta los aceites y fríe el pollo hasta que estén tiernos y cocidos.", "Cuando el pollo esté cocido, agregue el garam masala y el cilantro picado y sirva con el arroz y un pan naan tibio."], "url": "www_bbc_co_uk_food_recipes_chickenbhunawithpila_67271", "title": "Bhuna de pollo con arroz pilaf", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, piel eliminada, cortada en tiras", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de miel", "Harina de 55g / 2oz", "1 cucharadita de polvo de hornear", "pizca de sal", "2 huevos de gallinas camperas", "2-4 cucharadas de leche", "100g / 3½oz de maíz dulce enlatado, escurrido", "2 cucharadas de aceite de oliva", "aceite vegetal para freír", "1 patata, en rodajas", "2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "½ pimiento naranja picado", "1 tomate de vid, semillas eliminadas, picadas", "½ cucharadita de copos de chile", "2 cucharadas de vinagre de vino blanco", "2 cucharaditas de azúcar en polvo", "1 cucharada de ketchup de tomate", "Mangetout de 55 g / 2 oz, en rodajas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, frote el aceite en la carne y sazone con la sal y la pimienta.", "En una sartén a prueba de horno, caliente una pequeña cantidad de aceite a fuego medio y agregue las piezas de pollo, girándolas hasta que estén doradas por completo. Rocíe la miel sobre el pollo y transfiera la sartén al horno durante 7-8 minutos para cocinar el pollo.", "Para los buñuelos de maíz dulce, mezcle la harina, el polvo de hornear y la sal en un tazón grande. Usando un batidor eléctrico, mezcle los huevos y agregue la leche poco a poco hasta que la mezcla tenga la consistencia de una masa espesa. Dobla el maíz dulce.", "En una sartén grande, caliente el aceite a fuego medio. Con una cuchara grande, vierta la mezcla en la sartén y mantenga separadas las cucharadas de masa para que se formen frituras.", "Freír los buñuelos durante 3-4 minutos por cada lado, o hasta que estén dorados y cocidos.", "Para las papas salteadas, caliente el aceite vegetal en una sartén grande a fuego medio y agregue las rodajas de patata al aceite. Cocine por dos minutos hasta que se hayan ablandado pero no estén cocidos. Retire y escurra sobre papel de cocina.", "Regrese las rodajas de papa al aceite caliente por otros cinco minutos hasta que estén cocidas, o hasta que estén doradas y crujientes. Retire y reserve para drenar en papel de cocina.", "Para la mermelada de ají amarillo, caliente el aceite en una sartén a fuego medio. Agregue las cebollas y el ajo y fría por 2-3 minutos, o hasta que estén blandos. Agregue la pimienta, el tomate, los copos de chile, el vinagre de vino, el azúcar y el ketchup de tomate y cocínelos durante 8-10 minutos hasta que los vegetales se hayan suavizado visiblemente, luego agregue el mangetout rebanado.", "Para servir, coloque los goujons de pollo en un plato con los buñuelos de maíz dulce y las papas, y decore con una cucharada de mermelada de chile picante."], "url": "www_bbc_co_uk_food_recipes_chickenandsweetcorns_89353", "title": "Goujons de pollo con buñuelos de maíz dulce, patatas salteadas y mermelada de chile picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní, más extra para freír", "Filetes de pechuga de pollo sin piel de 200g / 7oz, cortados en trozos pequeños del tamaño de un guisante", "4 hongos chinos secos, remojados en agua caliente durante 20 minutos, escurridos y finamente picados", "1 cucharada de salsa de soja ligera", "1 cucharada de polvo de cinco especias", "1 cucharadita de jengibre fresco rallado", "75g / 3oz de soja", "2 cebollas grandes de primavera, finamente cortadas longitudinalmente", "1 zanahoria pequeña, en juliana", "1 cucharada de salsa de ostras", "½ cucharada de salsa de soja ligera", "sal marina y pimienta blanca molida", "16 envolturas de rollitos de primavera listas para usar, descongeladas si están congeladas (disponibles en los supermercados asiáticos)", "1 yema de huevo, batida"], "method": ["Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue el pollo y las setas y saltee durante 1-2 minutos. Sazonar con salsa de soja y polvo de cinco especias, luego retirar del wok y reservar para enfriar durante diez minutos. Limpie el wok limpio con papel de cocina.", "Coloque el jengibre rallado, los brotes de soja, las cebolletas y la zanahoria en un bol, luego agregue el pollo y los champiñones y sazone con la salsa de ostras, la salsa de soja, la sal marina y la pimienta blanca molida. Revuelva bien para combinar.", "Coloque dos envoltorios de rollitos de resorte uno encima del otro (el grosor adicional evitará que la piel se rompa) y colóquelos de manera que las esquinas apunten hacia arriba, hacia abajo y hacia los lados.", "Coloque dos cucharadas de relleno en el centro del envoltorio. Cepille cada esquina de la envoltura con la pasta de harina de maíz, luego junte las dos esquinas opuestas en los lados y, manteniendo el dedo sobre esos bordes, lleve la esquina inferior hacia el centro y luego enrolle la masa con fuerza hacia la esquina superior. Meta el borde superior y selle con un poco de yema de huevo batida. Repita con las envolturas y el relleno del rodillo de resorte restante.", "Calentar el wok a fuego alto y llenar el wok hasta un cuarto de profundidad con aceite de cacahuete. Caliente hasta que un cubo de pan caiga en chispas y se vuelva dorado en 15 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Con cuidado, baje los rollos de primavera en pequeños lotes en el aceite y fríalos durante 2-3 minutos o hasta que estén dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Transfiera los rollitos de primavera a un plato y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenandvegetables_89282", "title": "Rollitos de primavera de pollo y vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandvegetables_89282_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete, más extra si es necesario", "30 g / 1 oz de mantequilla, más extra si es necesario", "6 piezas grandes de pollo de corral (muslos, muslos, pechos)", "3 cabezas de achicoria, cortadas por la mitad a lo largo", "2 cucharaditas de azúcar moreno", "sal y pimienta negra recién molida", "3 chalotes, finamente picados", "1 limón, solo jugo", "125ml / 4fl oz de vino blanco medio seco", "180 ml / 6½ fl oz crema fresca", "pequeño puñado de perejil fresco, picado", "papas hervidas, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite de maní y la mantequilla en una cazuela grande y profunda con tapa a fuego medio.", "Cuando la mantequilla comience a burbujear, agregue con cuidado las piezas de pollo (en dos tandas si es necesario para no saturar la bandeja) y frítelas hasta que estén doradas en cada lado.", "Levante el pollo de la sartén y déjelo a un lado. Si la mezcla de mantequilla y aceite en la sartén aún está en condiciones razonables, consérvela para cocinar más. Si se ve un poco oscuro, viértalo y agregue un poco más, pero de ninguna manera elimine los pedazos pegajosos en la parte inferior, ya que es ahí donde se encuentra gran parte del sabor.", "Coloque la achicoria en la sartén y vuelva a calentar a fuego medio. Agregue el azúcar y sazone con sal y pimienta negra recién molida. Cocine a fuego moderado durante 5-6 minutos, hasta que las hojas del exterior comiencen a caramelizarse y ablandarse.", "Agregue los chalotes y el jugo de limón, luego devuelva el pollo a la sartén. Agregue el vino a la sartén, cocine a fuego lento, luego baje la temperatura y cocine durante diez minutos, o hasta que el vino y los jugos de cocina se hayan reducido.", "Agregue la crème fraîche, sazone con sal y pimienta negra recién molida y mezcle los jugos de la sartén con la crema. Cubra con una tapa y transfiera al horno para cocinar por 50-60 minutos. Revuelva los pedazos de pollo y achicoria a la mitad de este tiempo de cocción.", "Levante el pollo y la achicoria de la salsa con una espumadera, colóquelo en un plato para servir y manténgalo caliente.", "Agregue la mitad del perejil a la salsa y coloque a fuego moderado. Llevar a ebullición, luego cocine a fuego lento hasta que la salsa comience a espesar un poco - debe ser la consistencia de la crema doble.", "Agregue el perejil restante y mezcle bien. Vierta la salsa sobre el pollo y la achicoria en el plato de servir.", "Para servir, coloca los trozos de pollo y la salsa en los platos y sirve con papas hervidas para absorber los jugos."], "url": "www_bbc_co_uk_food_recipes_chickenbraisedwithch_85937", "title": "Pollo estofado con achicoria y crème fraîche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de yogur natural bajo en grasa", "1 cucharadita de garam masala o polvo de curry", "1 cucharadita de chile en polvo", "2 cucharaditas de lima o jugo de limón", "2 cucharaditas de cilantro picado fresco, opcional", "1 chile rojo fresco, finamente picado (opcional)", "4 x 150 g / 5½ pechugas de pollo, en cubos", "ensalada verde", "pan de pita"], "method": ["Mezcle el yogur, el garam masala, el chile en polvo, el jugo de lima, el cilantro y el chile rojo.", "Marinar el pollo en la mezcla de yogur durante 5 minutos.", "Precalentar la barbacoa a caliente. Alternativamente, puedes cocinar el pollo debajo de una parrilla caliente.", "Ensarte el pollo en los pinchos de kebab y cocine en la barbacoa hasta que el pollo esté tierno y cocido completamente.", "Sirve con ensalada y pan pitta."], "url": "www_bbc_co_uk_food_recipes_chickenbreastmarinat_83749", "title": "Kebabs de pollo picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastmarinat_83749_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["900 ml / 1½ pintas de caldo de pollo", "4 pechugas de pollo sin hueso", "40 g / 1½ oz de mantequilla", "1 x 225 g / 8-9 onzas de pudin negro", "175ml / 6fl oz de vino dulce de Moscatel, como Muscat Beaumes de Venise", "1½ cucharadita de jugo de limón", "1½ cucharadita de hojas de estragón", "sal", "pimienta negra recién molida", "900 g / 2lb de espinaca fresca, tallos grandes retirados", "25g / 1oz de mantequilla", "nuez moscada recién rallada", "sal", "pimienta negra recién molida"], "method": ["Coloque el caldo en un sartén de base ancha y hiérvalo vigorosamente hasta que se haya reducido a 175 ml / 6 fl oz.", "Sazone las pechugas de pollo en ambos lados con sal y pimienta.", "Caliente una pequeña perilla de la mantequilla en una sartén grande y, cuando esté espumante, agregue las pechugas de pollo, con la piel hacia abajo, y cocine a fuego medio durante seis minutos hasta que la piel esté crujiente y dorada. Dé la vuelta a las pechugas de pollo y continúe cocinando durante 6-7 minutos hasta que estén cocidas.", "Corta finamente la morcilla en 16 rebanadas. Retire el pollo de la sartén y manténgalo caliente. Agregue las rodajas de morcilla a la sartén y fríalos por un minuto en cada lado. Ponlos a un lado con el pollo.", "Agregue el vino dulce a la sartén y hiérvalo, raspando todos los trozos dorados del fondo de la sartén con una cuchara de madera, hasta reducir a aproximadamente tres cucharadas. Agregue el caldo de pollo reducido y hierva durante 1-2 minutos. Agregue el resto de la mantequilla una pieza pequeña a la vez, luego agregue el jugo de limón y un poco de condimento al gusto.", "Deje caer las espinacas, un puñado grande a la vez, en una sartén caliente grande, agregando otra a medida que cada uno se marchita. Cuando se hayan agregado todas las espinacas, cocine durante un minuto, hágalo en un colador y presione ligeramente el exceso de líquido.", "Derrita la mantequilla en la sartén, agregue las espinacas y sazone con nuez moscada recién rallada y algo de sal y pimienta. Mezcle brevemente a fuego alto para combinar.", "Para servir, corte las pechugas de pollo en diagonal y en un ligero ángulo y coloque las rebanadas en el centro de cada plato calentado con la morcilla.", "Revuelva las hojas de estragón en la salsa y espolvoree un poco sobre el pollo y un poco alrededor del borde exterior de los platos. Sirve con la espinaca al vapor."], "url": "www_bbc_co_uk_food_recipes_chickenbreastsmuscat_71186", "title": "Pechugas de pollo, vino moscatel y morcilla servidos con espinacas al vapor", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 hojas frescas de salvia", "100 g / 3½ oz de mantequilla, ablandada", "4 cucharaditas de mostaza integral", "sal y pimienta negra recién molida", "4 pechugas de pollo", "8 rebanadas de jamón", "1 cucharadita de aceite de oliva", "125ml / 4½fl oz de vino blanco", "1 diente de ajo", "1 hoja de salvia fresca", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170C / 340F / Gas 3.", "Para la mantequilla de salvia, cortar las hojas de salvia finamente.", "Coloque la mantequilla en un recipiente, agregue las hojas de salvia picadas y la mostaza, y sazone al gusto con sal y pimienta negra recién molida. Mezclar bien", "Para el pollo, usando un cuchillo afilado, corte en el lado de cada pechuga de pollo para formar un bolsillo.", "Coloque una cuarta parte de la mezcla de mantequilla en cada bolsillo y doble para encerrar. Si le queda alguna de la mantequilla saborizada, puede enrollarla en forma de salchicha, congelarla y usarla (dentro de un mes) en otro plato.", "Coloque dos rodajas de jamón sobre una tabla limpia para que se superpongan ligeramente. Envuelva una de las pechugas de pollo en las rebanadas y ruede para encerrar. Repita con las rodajas de jamón restantes y las pechugas de pollo.", "Caliente el aceite de oliva en una sartén de fondo grueso. Cuando esté caliente, agregue las pechugas de pollo envueltas.", "Cocine a fuego medio hasta que el jamón esté ligeramente dorado, aproximadamente dos minutos.", "Voltea los senos y dora el otro lado por otros dos minutos.", "Usando pinzas o una rebanada de pescado, coloque las pechugas de pollo en una bandeja para hornear y colóquelas en el horno precalentado. Guarde los jugos de cocción en la sartén, ya que estos se usarán para hacer la salsa.", "Cocine las pechugas de pollo durante 20 minutos o hasta que el pollo esté completamente cocido (el pollo se sentirá firme al tacto y los jugos se mantendrán limpios cuando el pollo esté perforado con un pincho en la parte más gruesa).", "Cuando el pollo esté cocido, retíralo del horno y pon los pechos a un lado para que descansen durante diez minutos. Mantener caliente", "Mientras el pollo está en reposo, prepare la salsa. Caliente los jugos de cocción retenidos en la sartén donde se cocinaron las pechugas de pollo y agregue el vino blanco. Aplastar el diente de ajo y agregar a la sartén. Agrega una hoja de salvia.", "Suba el fuego y cocine, raspando los trozos marrones del fondo de la sartén. Cocine por un par de minutos hasta que la salsa se reduzca. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, corte cada pechuga en cinco rebanadas en la diagonal, luego vierta la salsa mostaza, mantecosa. Sirva con puré de papa."], "url": "www_bbc_co_uk_food_recipes_chickenbreastsstuffe_90199", "title": "Pechugas de pollo rellenas de salvia y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastsstuffe_90199_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo regordetas de corral", "175g / 6oz de salchicha Cumberland", "2 hojas de albahaca, rasgadas por la mitad", "2 tomates secados al sol, cortados en mitades", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida", "150g / 5oz de jamón cumbriano secado al aire (use jamón de Parma si no hay ninguno disponible)", "simple ensalada verde, para servir", "500 g / 1 lb papas 1½ oz, ralladas", "½ cebolla rallada", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Use un cuchillo afilado para cortar un bolsillo en el costado de cada pechuga de pollo.", "Rellene un cuarto de la carne de salchicha en cada bolsillo de pollo y presione un trozo de albahaca y tomate en cada seno.", "Rocíe un poco de aceite de oliva, jugo de limón y sal y pimienta negra recién molida, al gusto, sobre las pechugas de pollo y envuelva cada pechuga en el jamón secado al aire para formar un rollo ordenado. Envuelva cada paquete en papel de aluminio, sellando cada paquete de aluminio.", "Hornee en el horno precalentado durante aproximadamente 30 minutos - para verificar que el pollo esté cocido, cuidadosamente desenvuelva las parcelas y atraviese el pollo con un pincho de metal, si los jugos son claros, la carne se cuece hasta el final. Descansa la carne, aún tapada, durante al menos cinco minutos antes de servir.", "Mientras tanto, haz el rösti. Coloque la papa rallada y la cebolla en un tazón grande y sazone bien con sal y pimienta negra recién molida. Incline la mezcla en un paño de cocina y exprima el exceso de humedad con sus manos.", "Divida la mezcla en cuatro hamburguesas del mismo tamaño.", "Engrase ligeramente los anillos de cuatro cocineros con mantequilla y derrita la mantequilla restante en una sartén grande. Divida la mezcla rösti entre los anillos de los cocineros y fría a fuego medio durante unos diez minutos hasta que se doren por un lado. Retire los anillos de los chefs, voltee y cocine hasta que ambos lados estén dorados por ambos lados.", "Sirva cada paquete de pollo con un rösti y vierta sobre los jugos del paquete de aluminio. Sirva con una ensalada verde simple en el lado."], "url": "www_bbc_co_uk_food_recipes_chickenbreaststuffed_87822", "title": "Pechuga de pollo rellena de salchicha de Cumberland, tomate seco al sol y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin hueso", "2 bulbos de hinojo", "2 zanahorias grandes, peladas", "2 cucharadas de aceite de oliva", "30g / 1oz de mantequilla", "2 cucharadas de semillas de hinojo frescas", "sal y pimienta negra recién molida", "2 cucharadas de miel clara", "2 limones, solo jugo", "4 cucharadas de aceite de oliva", "pizca de sal", "pizca de cayena"], "method": ["Mezcle todos los ingredientes del adobo en un recipiente ancho y poco profundo, agregando un poco de sal. Agregue las pechugas de pollo y gírelas para cubrirlas completamente. Cubra con película adhesiva y déjela durante 1 hora, girándolas hasta la mitad.", "Cortar el hinojo longitudinalmente en rodajas de 5 mm / ¼ de grosor. Blanquee en agua hirviendo con sal durante 5 minutos, revuelva y drene.", "Corta las zanahorias en rebanadas diagonales de 5 mm / ¼. No cocines las verduras juntas. Anota la superficie, luego blanquea durante 3 minutos, actualiza y drena. Ligeramente cepille el hinojo y las zanahorias con aceite de oliva.", "Caliente una sartén hasta que esté caliente. Agregue el hinojo primero, luego las zanahorias y la plancha durante 5-10 minutos, dándoles un cuarto de vuelta para marcar atractivamente. Déles la vuelta y repita en el otro lado. Sazonar, colocar en un plato y mantener caliente.", "Coloque las pechugas de pollo en la sartén de la plancha caliente, con la piel hacia abajo. Una vez que están marcados con líneas, cuarto de vuelta para hacer un patrón de celosía. Déles la vuelta, baje el fuego y déles un cuarto de vuelta como antes. Cocine por 12-15 minutos en total, dependiendo del grosor.", "Coloque las rodajas de hinojo en los platos y cubra con el pollo. Coloque las zanahorias al lado. Ponga un trozo de mantequilla en cada pechuga de pollo y cubra con semillas de hinojo."], "url": "www_bbc_co_uk_food_recipes_chickenbreastswithfe_65543", "title": "Pechugas de pollo con hinojo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, pieles dejadas en", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva virgen extra", "1 limón, ralladura solamente", "3 limones, solo jugo", "175ml / 6fl oz de vino blanco", "2 cucharadas de vinagre de vino blanco", "1 chile rojo pequeño, finamente picado", "2 hojas de laurel frescas, rotas", "120ml / 4fl oz de aceite de oliva virgen extra", "4 chalotes grandes, cortados en cuartos", "2 zanahorias, cortadas en fósforos", "150g / 5oz de guisantes frescos", "pellizque los hilos de azafrán, empapados en 5 cucharadas de agua tibia", "1 limón, ralladura solamente, para adornar"], "method": ["Para el pollo, sazone las pechugas de pollo con sal y pimienta negra recién molida.", "Coloque en un plato junto con el resto de los ingredientes del adobo. Mezcle bien, cubra y coloque en el refrigerador para marinar durante dos horas, volteando las pechugas de pollo de vez en cuando.", "Para cocinar el pollo, precaliente el horno a 180 ° C / 365 ° F / Gas 4.", "Caliente una sartén grande a prueba de horno hasta que esté caliente, luego agregue 90 ml / 3 fl oz del aceite virgen extra, los chalotes, las zanahorias y los guisantes y fría a fuego lento hasta que las verduras se ablanden.", "Retire las verduras de la sartén con una espumadera y déjelas a un lado.", "Agregue los 30ml / 1fl oz restantes de aceite de oliva a la sartén y caliente.", "Retire el pollo del adobo y seque. Agregue las pechugas de pollo a la sartén y freír durante 2-3 minutos en ambos lados, hasta que estén doradas por todas partes.", "Retire del fuego y agregue las verduras, luego, con un colador, cuele el adobo sobre el pollo. Deseche los ingredientes sólidos del adobo.", "Transfiera al horno y cocine durante una hora, o hasta que el pollo esté cocido y la salsa se haya reducido a la mitad.", "Aproximadamente 15 minutos antes del final del tiempo de cocción, vierta el azafrán y su líquido de remojo.", "Para servir, retire el pollo del horno y colóquelo en los platos. Coloque cucharadas de vegetales al costado y ponga la salsa sobre la salsa. Adorne con la ralladura de limón recién rallado espolvoreado sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickenbreastswithle_86699", "title": "Pechugas de pollo con limón y azafrán", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "2 cebollas en rodajas", "Arroz risotto arborio 400 g / 14 oz", "salpicar vino blanco", "1 litro / 1¾ pinta de caldo de verduras calientes", "sal y pimienta negra recién molida", "200g / 7oz de guisantes frescos, blanqueados", "200g / 7oz de espárragos blanqueados", "400 g / 14 oz espinaca bebé", "1 cucharada de albahaca fresca picada", "75ml / 2½ fl oz crema doble", "Aceite para freír", "sal y pimienta negra recién molida", "4 pechugas de pollo, con la piel puesta", "pollo o caldo de verduras, para cubrir", "virutas de parmesano, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el risotto, caliente el aceite en una sartén y fría la cebolla hasta que esté suave. Agregue el arroz y revuelva bien, luego agregue el vino y cocine a fuego lento hasta que se reduzca por completo. Agregue una buena cucharada del caldo caliente y revuelva continuamente. Cuando todo esto haya sido absorbido, agregue más stock. Continúe agregando más caldo, revolviendo continuamente, hasta que el arroz esté cocido.", "Sazonar con sal y pimienta negra recién molida y agregar los guisantes, espárragos, espinacas, albahaca y crema", "Para el pollo, sazone bien las pechugas de pollo con sal y pimienta negra recién molida. Calentar el aceite en una sartén y colocar las pechugas de pollo con la piel hacia abajo. Freír las pechugas de pollo en ambos lados hasta que estén ligeramente doradas.", "Coloque las pechugas de pollo en un plato resistente al horno y vierta suficiente caldo para llegar un tercio del camino hasta los lados de las pechugas de pollo. Coloque en el horno durante 15 minutos o hasta que esté completamente cocido.", "Para servir, coloca el risotto en tazones para servir. Cortar el pollo y colocar sobre el risotto, luego espolvorear con virutas de parmesano."], "url": "www_bbc_co_uk_food_recipes_chickenbreastwithpea_87568", "title": "Risotto de pollo y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastwithpea_87568_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 envolturas de tortilla listas para usar", "125 g / 4½ oz Brie, en rodajas", "puñado de cohetes", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 filetes de pollo picados", "Pimientos rojos asados ​​140g / 5oz (de un tarro), escurridos", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque una tortilla en una sartén a prueba de horno y cubra con el Brie, el cohete, el aceite de oliva, el aderezo y el pollo.", "Coloque la otra tortilla en la parte superior y cocine en la sartén durante tres minutos por cada lado.", "Coloque en el horno y cocine durante cinco minutos o hasta que el pollo esté completamente cocido.", "Corta la quesadilla en trozos.", "Para el aderezo de pimiento rojo, coloque los pimientos rojos asados ​​(reservar uno) en una licuadora con el aceite de oliva y un poco de jugo de la jarra y mezcle hasta que esté casi suave.", "Picar el pimiento rojo asado reservado y mezclar en la mezcla.", "Sirva los trozos de tortilla amontonados en un plato con la salsa de pimiento rojo en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickenbrieandrocket_85651", "title": "Quesadilla de pollo, brie y rúcula con aderezo de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo sin piel, cortada por la mitad a lo largo", "2 rebanadas de queso fontina, la misma longitud que la pechuga de pollo", "2 rebanadas de Jamón de Prosciutto, la misma longitud que la pechuga de pollo", "2 ramitas de romero fresco, la misma longitud que la pechuga de pollo", "harina común, para quitar el polvo", "10g / ½ oz de mantequilla", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "¼ de vino blanco de vidrio", "3 cucharadas de aceite de oliva virgen extra", "2 calabacines, cortados en rondas", "2 tomates, en rodajas", "2 ramitas de mejorana fresca, hojas recogidas", "2 cucharadas de queso parmesano rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 230C / 445F / Gas 8.", "Para el pollo, quite las agujas del romero y pique finamente. Tome el tallo de romero leñoso desnudo y afile el punto más grueso para crear un pincho.", "Aplane las mitades de pollo ligeramente con un mazo de carne o rodillo, luego sazone con sal y pimienta negra recién molida y espolvoree con las agujas de romero picadas.", "Coloque una rebanada de fontina en la parte superior de cada pieza de pollo, seguido del jamón.", "Asegure la pila con la rama de romero como lo haría con un pincho o palillo de madera.", "Para los calabacines rocíe una cucharada de aceite de oliva en un plato pequeño a prueba de horno.", "Arregle rodajas alternas de tomate y calabacín superpuestas en el plato y sazone con sal y pimienta negra recién molida.", "Rocíe con otra cucharada de aceite de oliva, espolvoree con las hojas de mejorana y cubra con queso parmesano.", "Coloque en el horno para hornear durante 4-5 minutos, hasta que el queso comience a derretirse y se ponga dorado.", "Mientras tanto, draga el lado desnudo del pollo con harina común y sacude cualquier exceso.", "Caliente la mantequilla y el aceite de oliva en una sartén a fuego medio. Cuando la mantequilla esté espuma, agregue primero el pollo con la carne hacia abajo y cocine a fuego medio durante unos dos minutos, o hasta que se dore, luego voltee la pechuga y cocine durante un minuto en el lado del jamón, hasta que se dore.", "Voltee la pechuga de pollo otra vez y agregue el vino a la sartén. Calentar para hervir y reducir el líquido hasta que se evapore casi por completo. Verifique que la pechuga de pollo esté completamente cocida, luego retire el pollo y colóquelo en un plato para que descanse.", "Agregue un poco de mantequilla a la sartén y derrita para espesar la salsa.", "Retire los calabacines y los tomates del horno y rocíe con la cucharada restante de aceite de oliva antes de servir.", "Vierta la salsa sobre el pollo descansado y sirva inmediatamente con calabacín al horno y tomate."], "url": "www_bbc_co_uk_food_recipes_chickenbreastwithros_83819", "title": "Pollo con queso, prosciutto y calabacines asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbreastwithros_83819_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "120 g / 4½ oz de mantequilla sin sal, más extra para engrasar", "1 yema de huevo de gallinas camperas", "120ml / 4fl oz de agua", "4 cucharadas de aceite de oliva", "2 pechugas de pollo, hueso y piel retirados, carne cortada en pedazos", "Muslos de pollo de 500 g / 1 lb 2 oz, sin hueso y sin piel, carne cortada en pedazos", "100 ml / 3½ fl oz de vino blanco seco", "100 ml / 3½ fl oz de agua", "2 cucharaditas de estragón fresco picado", "2 cucharaditas de tomillo fresco picado", "sal y pimienta negra recién molida", "200 g / 7 oz de champiñones frescos, picados", "50ml / 2fl oz de crema agria", "1 huevo de gallinas camperas, golpeado"], "method": ["Para la masa, pulse la harina, el polvo de hornear, la sal, la mantequilla y la yema de huevo en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Poco a poco agregue el agua, una cucharada a la vez, mezclando continuamente hasta que la mezcla se una como una masa. (Puede que no necesite usar toda el agua.) Haga rodar la masa en forma de bola, luego envuélvala en una película adhesiva y déjela enfriar en la nevera durante una hora.", "Mientras tanto, para el relleno, caliente dos cucharadas de aceite de oliva en una cacerola a fuego medio, agregue las piezas de pollo y cocine durante 4-5 minutos, o hasta que se doren. Agregue el vino, el agua, el estragón y el tomillo, y condimente, al gusto, con sal y pimienta negra recién molida. Ponga la mezcla a ebullición, reduzca el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el volumen del líquido se haya reducido a la mitad y el pollo esté bien cocido.", "Caliente el aceite de oliva restante en una sartén separada a fuego medio, agregue los champiñones y cocínelos durante 4-5 minutos, o hasta que estén dorados, luego sazone al gusto con sal y pimienta negra recién molida.", "Retire el pollo cocido de la sartén con una cuchara ranurada y colóquelo en un bol, luego agregue dos cucharadas de los jugos residuales de esa sartén. Agregue los champiñones, luego agregue la crema agria hasta que estén bien combinados. Dejar de lado para enfriar.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pastel profunda de 20 cm con mantequilla. Agregue una pequeña cantidad de harina, luego gire la lata para cubrir la base y los lados, sacudiendo cualquier exceso.", "Cuando la masa se haya enfriado, extienda dos tercios de ella sobre una superficie de trabajo enharinada limpia, hasta que sea casi dos veces más ancha que el diámetro de la lata. Usando el rodillo, levante la masa y colóquela sobre el molde para rellenar la base y los lados. Presione suavemente la masa en las esquinas de la lata, recortando cualquier exceso, luego pinche la base de la caja de pastelería varias veces con un tenedor.", "Cubra la masa con una hoja de papel resistente a la grasa y llénela con arroz o frijoles secos. Hornee en el horno durante 10-15 minutos o hasta que la masa esté dorada. Retire del horno, deseche los frijoles y el papel resistente a las grasas y deje la masa a un lado para que se enfríe. Cuando esté frío, vierta el relleno de pastel en la caja de pastelería.", "Pase el tercio restante de la masa sobre una superficie de trabajo enharinada limpia hasta que sea un poco más grande que el diámetro del molde para pastel. Cepille el borde de la caja de pastelería cocida con un poco del huevo batido y coloque la tapa de la pastelería encima del pastel. Recorte cualquier exceso de pastelería. Selle la tapa de la pastelería en la caja de pastelería doblando los bordes de la tapa de la pastelería con un tenedor.", "Con un cuchillo, haga dos pequeños orificios en el centro de la tapa de la pastelería para permitir que salga el vapor. Cepille la tapa de la pastelería con el huevo batido restante, luego transfiéralo al horno y hornee durante 30-35 minutos o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_chickenandwildmushro_89626", "title": "Pastel de pollo y setas silvestres", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]