[{"isVegetarian": false, "title": "Dover sole with shrimps and steamed asparagus", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_shrimps_19440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 shallot, finely chopped", "1 tsp chopped blade of mace", "½ tsp cayenne pepper", "½ lemon, juice only", "10g capers", "5g fresh chives, chopped", "5g fresh parsley, chopped", "50g/1¾oz brown shrimp", "salt and black pepper", "1 dover sole, filleted ", "25g/1oz plain flour, seasoned with salt and pepper", "2 tbsp olive oil", "1 bunch asparagus, trimmed", "2 tbsp unsalted butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the shrimps, melt the butter In a frying pan. Add the shallot and cook until soft and translucent and the butter is a nut-brown colour. Stir in the mace and caynenne pepper. Cook for a couple of minutes then drain through a fine sieve or muslin. Return the liquid to the pan and add the lemon juice (take care as the fat will spit).", "Stir the capers, chives, parsley and shrimps through the flavoured butter and season with salt and pepper to taste. Set aside and keep warm.", "For the dover sole, dust the sole in the seasoned flour. Heat a large frying pan until hot, add the oil and fry the sole on both sides for 2-3 minutes.", "For the steamed asparagus, heat a saucepan with a small about of water in the bottom and place a bamboo steamer on top. Once the water is simmering, add the asparagus to the steamer and steam for 3-4 minutes.", "Heat a medium frying pan and add the butter, once melted, add the steamed asparagus and season with salt and pepper. Toss to coat the asparagus in the butter.", "To serve, spoon the sauce over the sole and place the asparagus on the side."]}, {"isVegetarian": false, "title": "Dover sole with shrimps, French beans and steamed new potatoes", "url": "www_bbc_co_uk_food_recipes_dover_sole_with_shrimps_42943", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole Dover sole, filleted and pin boned ", "25g/1oz plain flour, seasoned with salt and pepper", "25ml/1fl oz olive oil ", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 lemon, juice only", "2 tbsp finely chopped parsley", "100g/3½oz brown Morecambe Bay shrimps", "600g/1lb 5oz new potatoes, cleaned and peeled", "4 tbsp unsalted butter", "2 tbsp flatleaf parsley, chopped", "400g/14oz French beans", "2 tbsp unsalted butter", "200g/7oz flaked almonds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Dover sole, dust the fish in the seasoned flour. Heat a large frying pan and add the oil. Once hot, add the fish skin-side down and cook for a couple of minutes. Turn over and cook for a further minute.", "Remove the fish from the pan and set aside to rest.", "Heat the butter in a separate frying pan, add the shallot and fry for a few minutes. One it has reached the nut brown stage (or beurre noisette), add the lemon juice, parsley and shrimps and cook for a couple of minutes. ", "For the beans and potatoes, place the potatoes in a steamer above a large saucepan of salted water. Cook for 15-20 minutes, until done. ", "Just before serving add the butter, parsley and season with salt and pepper.", "Cook the French beans in a separate pan of boiling salted water for 4-5 minutes. Drain and just before serving add the butter and season with salt and pepper.", "Heat a small frying pan and add the almonds, toast on a low heat for 2-3 minutes or until golden-brown.", "To serve, place the dover sole onto a serving plate, along with the new potatoes and French beans. Top the beans with the toasted almonds."]}, {"isVegetarian": false, "title": "'Dragon prawn' noodles", "url": "www_bbc_co_uk_food_recipes_dragonprawnnoodles_89298", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dragonprawnnoodles_89298_16x9.jpg", "ingredients": ["650g/1lb 6oz live lobster", "2 tbsp groundnut oil", "5 cloves garlic, crushed", "2.5cm/1in piece fresh root ginger, peeled, finely chopped", "4 tbsp yellow bean sauce (available from Asian grocers)", "4 tbsp light soy sauce", "2 tbsp Shaoxing rice wine or dry sherry", "350g/12oz yellow shi whole wheat noodles or medium egg noodles, cooked according to packet instructions", "4 spring onions, sliced lengthways", "dash toasted sesame oil (optional)"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Freeze the lobster for 30 minutes. Heat a large pan of boiling water, then very quickly plunge the lobster in the water and cook for 7-8 minutes, or until pink and cooked through.", "Lift the lobster out with tongs and reserve the cooking liquid. Using a large cleaver or knife, chop off the tail and cut into three sections. Chop off the claws. Divide the body in half lengthways. Chop each half into two pieces. Using the back of the cleaver, crack the shell of the claws and all the other pieces - this helps to let the sauce seep through and flavour the meat as the lobster cooks.  Discard the rest of the lobster.", "Heat a wok until smoking and add the groundnut oil, then add the garlic and ginger and fry for a few seconds. Stir in the yellow bean sauce, soy sauce and rice wine or sherry and cook for 30 seconds.", "Add the lobster pieces and stir well to coat the lobster in the sauce. Add the cooked noodles and toss through well. Add 3-4 tablespoons of the reserved cooking liquid (keep the rest to make a good seafood stock). Finally, add the spring onions, toss through well and serve immediately on a large serving plate."]}, {"isVegetarian": true, "title": "Dragon fruit and lychees pavlova", "url": "www_bbc_co_uk_food_recipes_dragon_fruit_and_lychees_83501", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 organic eggs, separated", "120g/4½oz caster sugar", "120g/4½oz icing sugar", "1 tsp cornflour", "pinch sea salt", "200ml/7fl oz double cream", "1 tbsp caster sugar", "200ml/7fl oz fat-free plain yoghurt", "1 vanilla pod, seeds removed", "2 dragon fruit, sliced", "400g/14oz fresh lychees", "fresh mint leaves", "icing sugar, for dusting", "1 lime, zest only"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½. ", "Line two baking trays with baking paper.", "To make the meringues Tip the egg whites into a clean mixing bowl and season with a pinch of sea salt.", "Beat the eggs with an electric hand whisk to stiff peaks.", "Increase the speed and add the caster sugar, one spoonful at a time, beating in between each spoonful, for 7 –8 minutes until shiny and thick.", "Sift the icing sugar and cornflour and fold in a third at a time until the mixture is smooth. ", "Use a tablespoon to gently coax out the mixture into a spiral round.", "Bake for 1 hour and 15 minutes. Switch off the oven and allow to cool completely. ", "Whip the cream with the caster sugar until it forms soft peaks.  Fold in the yoghurt and mix in the vanilla seeds.", "Spoon the cream mixture over cooled meringue, decorate with dragon fruit and lychees. Grate over the lime zest, scatter with fresh mint leaves and a dusting of icing sugar. "]}, {"isVegetarian": true, "title": "Dreamlike shortbread", "url": "www_bbc_co_uk_food_recipes_dreamlike_shortbread_99343", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dreamlike_shortbread_99343_16x9.jpg", "ingredients": ["130g/4½oz butter, softened ", "60g/2½oz caster sugar, plus extra for sprinkling ", "130g/4½oz plain flour ", "60g/2½oz rice flour ", "pinch salt "], "serves": "Makes 8 dainty pieces", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Cream the butter and sugar together in a large bowl until pale and fluffy. Add the plain flour, rice flour and salt, and stir well until the mixture is smooth and uniform. (I find it easiest to keep pressing the mixture against the side of the bowl to mix it.)", "Bring the mixture together and press into a 20cm/8in loose-bottomed cake tin, smoothing it with the back of a spoon. Crimp the edges by pressing with the tips of two fingers, then score into eight pieces with a knife and prick each triangle three times with a fork. Put in the fridge for 30 minutes to firm up. ", "Preheat the oven to 170C/325F/Gas 3. ", "Remove the shortbread from the fridge and bake in the oven for 30–35 minutes, or until pale golden-brown. ", "Remove the shortbread from the oven and sprinkle over some caster sugar. Leave to cool in the tin for a few minutes before removing it from the tin and cooling on a wire rack. "]}, {"isVegetarian": false, "title": "How to dress a crab", "url": "www_bbc_co_uk_food_recipes_dressedcrab_90206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dressedcrab_90206_16x9.jpg", "ingredients": ["1 large cooked crab, weighing about 1kg-1.5kg/2lb-3lb or one live crab of the same weight", "slices of brown bread", "good-quality mayonnaise", "lemon wedges", "fresh parsley, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["If you're cooking a live crab, first bring a large pot of well-salted water to the boil. (If using a ready-cooked fresh crab, proceed to the next step.) Add the crab to the pan and boil for 20-30 minutes. Remove from the water and stand on its nose to allow the water to drain away as the crab cools. ", "To prepare the cooked, cooled crab, first remove the legs by twisting them off where they meet the body.", "Remove the claws by pulling them off from the body.", "Separate the crab body from the central part of the crab by placing the crab on its back (hard shell-side down). Put your hands under the edge of the crab and push upwards until you hear it break. You may need to use a heavy knife to help you lever the crab apart.", "Remove all ten of the spongy 'dead men's fingers' and discard.", "Drain any excess water from the shell of the crab and remove the stomach sac and hard membranes inside the shell.", "Use a spoon to remove the brown meat from the shell and any soft shell that has formed. Place it into a clean bowl and mash with a fork.", "Press down on the edges of the crab shell, breaking away the outer edges to form a 'dish' for serving.", "Break each claw in half. Use the handle of a teaspoon to scrape the white meat out of the thick end of the claw. Place into a separate clean bowl.", "Use the back of a heavy-bladed knife to crack open the remaining piece of claw and the pincers. Remove all the white meat and flake into the bowl. Remove the piece of cartilage inside each of the claws, pick off the meat and discard the cartilage.", "To remove the meat from the body of the crab, take a sharp knife and cut the crab body in half then in half again. Pick out the meat using your fingers.", "If the legs are large enough, it's worth picking the meat out of them. Snap them in half and discard the thin end of the leg. Using the back of a heavy-bladed knife, smash the shell on the thicker part of the leg. Pull the meat out and add to your bowl.", "Run your fingers through the white meat in the bowl to break up the meat and to pick out any remaining bits of shell.", "Return the prepared white and brown meat to separate halves of the prepared crab shell.", "Serve on a plate with some good-quality mayonnaise, some brown bread and a wedge of lemon. Garnish with fresh parsley, if you like."]}, {"isVegetarian": false, "title": "Dressed crab with fresh yoghurt and coriander", "url": "www_bbc_co_uk_food_recipes_dressedcrabwithfresh_86531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz white crabmeat", "salt, to taste", "pinch smoked paprika", "50g/2oz mayonnaise", "50g/2oz plain live yoghurt", "small handful fresh coriander, chopped", "½ lemon, juice only", "5 free-range eggs", "75g/2¾oz capers", "½ lemon, zest only", "small handful fresh flatleaf parsley, coarsely chopped", "50g/2oz salad cream", "salt and freshly ground black pepper ", "50g/2oz rocket", "crusty loaf, sliced, drizzled with olive oil and toasted"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the dressed crab, place the crabmeat in a bowl, season with salt and smoked paprika. Mix in the mayonnaise, yoghurt, coriander and lemon juice to taste.", "Place four metal chef rings onto a tray lined with cling film and spoon the mixture into them. Chill in the fridge until needed.", "For the caper and egg salad, place the eggs into boiling water and cook for six minutes, or until hard boiled. Remove the eggs from the water and refresh in cold water. Peel and coarsely chop. ", "In a bowl, mix the chopped eggs, capers, lemon zest and parsley. Bind the mixture together with the salad cream and season with salt and freshly ground black pepper.", "To serve, place the metal rings with the dressed crab onto serving plates then carefully remove the rings. Garnish with the egg and caper salad and rocket and serve with the toasted bread."]}, {"isVegetarian": true, "title": "Honey and soy dressing", "url": "www_bbc_co_uk_food_recipes_dressing_76414", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp honey", "4 tbsp soy sauce", "1 tbsp sesame seeds", "4 tsp sesame oil", "2 tsp fresh coriander, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together and serve."]}, {"isVegetarian": true, "title": "Dried fruit compote with yoghurt", "url": "www_bbc_co_uk_food_recipes_dried_fruit_compote_with_78675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz dried apricots, roughly chopped", "15g/½oz dried apple, roughly chopped ", "15g/½oz dried prunes, roughly chopped", "pinch ground cinnamon (optional)", "100ml/3½fl oz boiling water", "100ml/3½fl oz orange juice ", "100g/3½oz fat-free Greek-style yoghurt "], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place the dried fruit and cinnamon, if using, in a heatproof bowl. ", "Pour over the boiling water and orange juice. Cover and refrigerate overnight. ", "When ready to eat, serve with the yoghurt."]}, {"isVegetarian": true, "title": "Dried fruit and almond buns", "url": "www_bbc_co_uk_food_recipes_dried_fruit_and_almond_47710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb plain flour", "50g/2oz butter", "2 tsp salt", "65g/2½oz caster sugar", "75g/3oz ground almonds", "1 x 7g/¼oz sachet fact-action dried yeast", "300ml/10fl oz milk, warmed", "vegetable oil, for greasing ", "125g/4oz flaked almonds", "150g/5oz mixed dried berries", "75g/3oz dried apricots, roughly chopped"], "serves": "Makes 12 rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the flour into a mixing bowl and, using your fingertips, rub in the butter until the mixture resembles fine breadcrumbs. Add the, salt, sugar, ground almonds, and yeast and stir until well combined.", "Add the milk and mix together with a fork until the mixture comes together as a sticky dough.", "Tip the dough onto a lightly floured work surface and knead for five minutes, or until the dough is smooth and elastic.", "Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size. ", "Lightly grease two baking trays.", "Knock the dough back to its original size and turn out onto a lightly floured work surface. Knead in half of the flaked almonds and all of the dried fruit. ", "Sprinkle the remaining flaked almonds onto a plate.", "Divide the dough into 12 portions and shape them into rounds. Roll each round in the flaked almonds and place onto the baking trays, cut-side facing upwards, ensuring that the rolls are well spaced. Cover with a tea towel and set aside to prove for one hour.", "Preheat the oven to 220C/425F/Gas 7. ", "Bake the almond buns for 15-20 minutes, or until risen and golden-brown. Remove the buns from the oven and set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Dried cherry and cranberry flapjacks", "url": "www_bbc_co_uk_food_recipes_driedcherryandcranbe_88993", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/driedcherryandcranbe_88993_16x9.jpg", "ingredients": ["150g/5oz butter, cubed ", "80g/3oz soft light brown sugar", "80ml/3fl oz clear honey", "250g/9oz rolled porridge oats", "80g/3oz dried cherries", "80g/3oz dried cranberries", "1 tbsp desiccated coconut", "50g/2oz hazelnuts, shells removed, chopped", "100ml/3½fl oz double cream ", "100g/3½oz white chocolate, broken into pieces ", "25ml/1fl oz cherry brandy"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Melt the butter, sugar and honey together in a pan over a medium heat.", "Add the rolled oats, dried cherries, dried cranberries, desiccated coconut and hazelnuts and stir well.", "Pour the flapjack mixture into a greased 30cm/12in x 20cm/8in square baking tin. Press the mixture into the corners and smooth the top.", "Place into the oven to bake for 20 minutes, or until golden-brown and bubbling.", "Remove from the oven and allow to cool. Turn out of the tin and cut into equal-sized squares.", "For the chocolate dipping sauce, heat the cream in a pan until warmed through. Stir in the chocolate pieces until melted and smooth, then stir in the brandy.", "Serve the flapjacks with the dipping sauce in a small bowl alongside."]}, {"isVegetarian": true, "title": "Drop scones", "url": "www_bbc_co_uk_food_recipes_drop_scones_38257", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/drop_scones_38257_16x9.jpg", "ingredients": ["175g/6oz self-raising flour", "1 tsp baking powder", "40g/1½oz caster sugar", "1 small orange, zest only", "1 free-range egg ", "200ml/7fl oz milk", "little sunflower oil, for greasig", "butter or maple syrup or honey", "Greek-style yoghurt", "fresh blueberries and raspberries"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Measure the flour, baking powder, sugar and orange zest into a mixing bowl. Make a well in the centre and then add the egg and half of the milk. Beat well, with a whisk, until you have a smooth, thick batter. Beat in enough of the milk to make a batter the consistency of thick pouring cream – you may not need all the milk. ", "Heat a large non-stick frying pan and grease with a little oil. Drop the mixture in dessertspoonfuls onto the hot frying pan, spacing the mixture well apart to allow for them to spread. When bubbles appear on the surface, turn the scones over with a palette knife or spatula and cook on the other side for a further 30 seconds to 1 minute, or until they are lightly golden-brown. ", "Lift the pancakes on to a wire rack and cover with a clean tea towel to keep them soft. Continue cooking the batter in the same way. ", "Serve at once with butter, or syrup, or honey, and yoghurt and blueberries, raspberries or other seasonal fruits."]}, {"isVegetarian": false, "title": "Dry cured smoked bacon chop, broad beans and marjoram leaves", "url": "www_bbc_co_uk_food_recipes_dry_cured_smoked_bacon_38129", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz broad beans, podded", "2 tbsp olive oil", "2 x 150g/5½oz bacon chops", "30ml/1fl oz malt vinegar", "50g/1¾oz butter", "2 tbsp white wine vinegar", "salt and pepper", "1 tsp fresh marjoram leaves", "10 broad bean flowers"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a medium pan of water to the boil and add the broad beans. Cook for 2-3 minutes, then plunge them into a bowl of cold water.", "Heat a frying pan and add the oil. Once hot, add the bacon chops. Brush them with a little of the oil while cooking (using a silicone brush).", "Cook for four minutes and then turn over and cook for a further three minutes.", "Deglaze the pan with the vinegar and a knob of butter. Cook until the volume of liquid has reduced to thick glaze. Brush the sauce onto the chop.", "Remove the pan from the heat, then rest for two minutes. Wipe the pan free from the vinegar.", "In the same pan, heat the remaining butter with splash of water warm. Add the broad beans and season with salt and pepper. Add the marjoram leaves and remove from the heat. ", "To serve, lay each chop in the middle of a plate, pour on the broad beans and top with the broad bean flowers."]}, {"isVegetarian": true, "title": "Dry curry of cabbage, carrot and coconut (Thoran)", "url": "www_bbc_co_uk_food_recipes_dry_curry_of_cabbage_71527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dry_curry_of_cabbage_71527_16x9.jpg", "ingredients": ["3 tbsp coconut oil or vegetable oil", "2 tsp black mustard seeds", "2 tbsp chopped fresh curry leaves", "1 tsp cumin seeds", "2 dried Kashmiri chillies, each broken into 3 or 4 pieces", "30g/1oz (or 6cm/2½in) fresh root ginger, finely grated into a paste", "½ tsp ground turmeric", "1 tsp salt", "½ tsp coarsely ground black pepper", "250g/9oz hispi or pointed spring cabbage (or spring greens), shredded into 5mm pieces", "2 carrots, diced", "2 fresh green chillies, sliced into thin rounds, with seeds", "100g/3½oz fresh or frozen coconut flesh, blended in a food processor or grated", "boiled basmati rice ", "poppadoms"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based saucepan or karahi set over a medium heat, and, when hot, add the mustard seeds followed by the curry leaves, cumin seeds and dried chillies. Stir for about 30 seconds, then add the ginger paste, turmeric, salt and black pepper and fry for 30 seconds.", "Stir in the cabbage and carrots and cook, covered, over a medium heat for 5-7 minutes, or until the vegetables are tender, adding a splash of water if they start to stick to the pan.", "Stir in the green chillies and coconut, heat through for a minute and serve. Serve with rice and poppadoms."]}, {"isVegetarian": false, "title": "Fish curry with spinach salad and sweet potato", "url": "www_bbc_co_uk_food_recipes_dryfishcurrywithspin_89978", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz cashew nuts", "½ tsp ground turmeric", "1 tsp coriander seeds", "1 tsp curry powder", "1 tsp cumin seeds", "½ red chilli, chopped", "85g/3oz pollack fillet, skinned and chopped", "1 free-range egg, beaten", "2 tbsp vegetable oil", "½ lemon, juice only", "1 handful baby spinach", "2 tbsp fresh coriander, chopped", "1 sweet potato, thinly sliced on a mandoline", "1 tbsp olive oil", "½ lemon, juice only", "½ tsp curry powder"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish curry, place the cashew nuts, spices and chilli into a food processor and blend until smooth. Transfer to a shallow dish and reserve a tablespoon of the mixture for the spinach salad.", "Coat the fish in the beaten egg, then roll in the spice mix. Heat the vegetable oil in a frying pan and fry the fish for 5-6 minutes, or until golden-brown all over and cooked through. ", "For the spinach salad, mix the reserved spice mixture with the lemon juice. Place the baby spinach and coriander into a bowl and pour over the lemon and spice mixture, then toss well to combine. ", "For the sweet potatoes, place the sweet potato slices into a saucepan with the oil, lemon juice and curry powder, and enough boiling water to cover. Simmer gently with a lid on for 7-8 minutes, or until the sweet potato is tender.", "To serve, spoon the sweet potato slices onto a serving plate and arrange the spinach salad alongside. Spoon the fish curry on top of the sweet potato slices."]}, {"isVegetarian": false, "title": "Mussels stuffed with smoked duck", "url": "www_bbc_co_uk_food_recipes_duck-stuffed_mussels_26303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "½ tsp sea salt", "2 tsp coriander seeds, cracked in a pestle and mortar", "100g/3½oz butter, melted", "100g/3½oz butter, melted", "1kg/2lb 4oz fresh mussels, beards removed, cleaned (discard any mussels that do not close tightly when gently tapped)", "150ml/5fl oz white wine", "2 tbsp finely chopped fresh coriander", "1 smoked duck breast, skin removed, finely chopped ", "200g/7oz fresh white breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the flatbreads, place the flour, salt and coriander seeds into a large mixing bowl and gradually add water to form a dough.", "Roll the dough out onto a floured surface and shape into rounds.", "Heat a frying pan over a medium heat. Add the flatbreads to the pan and cook on each side for 2–3 minutes. Keep warm. ", "Heat a large saucepan over a medium heat. Add the mussels and wine, cover and cook for 2–3 minutes, shaking the pan occasionally.", "Once the mussels have opened, strain, reserving the cooking liquor. Discard any mussels that haven’t fully opened. ", "Once the mussels are cool enough to handle, remove them from their shells, reserving half of the shells.", "Place the fresh coriander into a small food processor with a little of the cooking liquor and blend until smooth.", "Preheat the grill to high.", "Lay the mussel shells on a grill tray and spoon a little of the coriander purée into each shell and top with the cooked mussel meat.", "In a bowl, mix the chopped duck with the breadcrumbs.", "Sprinkle the breadcrumb mix over the mussels and place under the grill for 3–5 minutes.", "Brush the flatbreads with the melted butter and serve with the mussels."]}, {"isVegetarian": false, "title": "Duck à la rhubarb", "url": "www_bbc_co_uk_food_recipes_duck__la_rhubarb_67136", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duck__la_rhubarb_67136_16x9.jpg", "ingredients": ["1 tbsp brown sugar", "100ml/3½fl oz red wine vinegar", "500ml/18fl oz chicken stock", "20g/¾oz butter ", "3–4 sticks rhubarb, roughly chopped", "2 tbsp brown sugar", "splash of grenadine (optional)", "2 tsp Chinese five spice", "2 tsp salt", "2 large duck breasts, trimmed and fat scored", "groundnut oil, for frying", "1 red chilli, chopped", "4 pak choi, quartered", "soy sauce, to taste", "fish sauce, to taste", "50g/1¾oz brown sugar", "½ stick rhubarb, cut into 1¾cm/2in batons", "20g/¾oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, put the sugar and vinegar in a saucepan and bring to a boil, then reduce the heat and cook until it begins to thicken and caramelise. Add the chicken stock. Cook until the sauce has reduced in volume by half. Add the butter to finish the sauce.", "Meanwhile, for the rhubarb, place the chopped pieces into a pan with the sugar, two tablespoons water and grenadine, if using. Cook until the rhubarb has softened. Allow to cool slightly then tip into a blender and pulse to form a purée. ", "For the duck, place the Chinese five spice on a plate along with a good pinch of salt. Mix together and then rub the duck breasts with the mixture.", "Lay the duck breasts, skin-side down in a cold frying pan. Turn on the heat and cook until the skin is golden-brown and the duck is almost cooked through. Turn the breasts over and remove the pan from the heat. The duck will continue to cook with the residual heat from the pan, but this method ensures it won’t overcook. It also allows the duck to rest before serving.", "Meanwhile, for the pak choi, add a little groundnut oil to a wok and stir fry the chilli for 1–2 minutes. Throw in the pak choi and stir fry for another two minutes before adding the soy sauce and fish sauce. Cook for 1–2 minutes, or until the pak choi is tender.", "For the garnish, simply melt the sugar in a pan, add the rhubarb batons and the butter, toss to coat the rhubarb in the caramel.", "To serve, slice the duck breasts in half lengthways and share them out between four serving plates. Garnish the duck with the rhubarb batons, put some pak choi alongside and pour a little of the sauce over the duck."]}, {"isVegetarian": false, "title": "Duck à l'orange", "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_20145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz potatoes, left unpeeled, cut into small chunks", "1 tbsp duck fat (optional, can use 2 tbsp olive oil instead)", "1 bulb garlic, broken up into cloves", "few sprigs rosemary", "salt and freshly ground black pepper", "50g/1¾oz granulated sugar", "12 kumquats, sliced, pips removed", "200ml/7fl oz red wine", "1 tbsp red wine vinegar", "2 large shallots, finely chopped", "2 star anise", "2 oranges, juice only", "500ml/18fl oz chicken stock", "salt and freshly ground black pepper", "4 duck breasts", "dash oil or duck fat", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the roast potatoes, preheat the oven to 220C/200C Fan/Gas 7. Put the potatoes into a saucepan and cover with cold water. Add a generous pinch of salt and bring to the boil. Simmer for 5 minutes, then drain and leave to dry out for a minute.", "Put the duck fat (or oil) in a large roasting tin and heat in the oven until smoking. Add the potatoes and shake the tin so that the potatoes get well coated with the fat or oil. Season with plenty of salt and pepper. ", "Crush the garlic cloves, leaving their skins on, then add to the tin along with the rosemary. Roast in the oven for around 30 minutes, checking and turning over every so often until the potatoes are crisp and brown around the edges. The garlic may cook through sooner, in which case, remove it and set aside until the potatoes are cooked.", "To make the sauce, put the sugar and 50ml/2fl oz of water in a saucepan and cook on a low heat, stirring regularly, until the sugar has dissolved. Add the kumquats and simmer for around 5 minutes until the kumquats are tender. Remove the kumquats from the syrup and set aside.", "Turn up the heat and boil the syrup until it turns the colour of caramel. Add the red wine, red wine vinegar, shallots and star anise and return to the boil. Simmer until the volume of the liquid has reduced by half, then add the orange juice and chicken stock. ", "Again, simmer until the volume of the sauce has reduced by half. The sauce should be rich and syrupy. Taste for seasoning and add plenty of black pepper and salt if necessary. Return the kumquats to the sauce and set aside.", "For the duck, score a criss-cross pattern through the skin and fat of the duck breasts, stopping just short of the flesh. Sprinkle with salt and pepper. Heat the oil (or duck fat) in a large oven-proof frying pan. When close to smoking point, add the duck breasts, skin-side down and fry until the skin is a rich golden brown and a great deal of fat has rendered out – around 6–7 minutes. Flip over and sear for a further 4 minutes. Remove from the pan and leave to rest.", "Strain off most of the fat from the frying pan, then pour it in the sauce. Deglaze the pan and add back any juices which may have collected under the strained off fat. Finally add any juices from the resting duck. Simmer until piping hot and very syrupy, then serve the sauce over the sliced duck breasts."]}, {"isVegetarian": false, "title": "Duck a l’orange", "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_58409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large orange", "1.8kg/4lb whole ready-to-roast duck", "2 tsp flaked sea salt, plus extra to season", "2 bay leaves", "½ onion, cut into four wedges", "freshly ground black pepper", "½ onion, peeled and thinly sliced ", "4 tbsp orange liqueur, such as Cointreau", "75ml/2½fl oz red wine", "1½ large oranges, freshly squeezed juice only (around 150ml/5fl oz)", "3 tbsp orange marmalade", "2 tsp cornflour (if you want a thinner sauce only use 1 tsp)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/400F/Gas 6½. Use a vegetable peeler to peel the skin off the half orange in wide strips. Place a stack of three strips on top of each other and trim the sides. Cut the strips into very thin julienne strips. Set aside.", "Prick the duck skin all over with the tip of a skewer to help release the fat. Don’t prick too deeply. Place on a rack set inside a sturdy, medium roasting tin. Place the orange half inside the duck, pushing towards the neck end to help support the breast. Add the bay leaves and onion wedges. Season the duck with the salt and lots of freshly ground black pepper. Roast for 45 minutes. ", "Take the duck out of the oven and carefully take the rack off the roasting tin using oven gloves to hold it. Tip any fat that has collected in the tin into a heatproof bowl. (Cool, then keep in a pot in the fridge and use for roast or sautéed potatoes.) Place the rack back into the tin and return the duck to the oven for a further 35-45 minutes, or until the skin is golden-brown and crisp. ", "Remove the duck from the oven and wiggle one of its legs. If the duck is ready, the leg will be fairly loose and easy to wiggle. If not, return the duck to the oven for a further 10 minutes, or until cooked. Transfer to a board or warmed serving platter. Cover very loosely with foil and leave to rest for 15 minutes. ", "While the duck is resting, make the sauce. Drain all but one tablespoon of the duck fat from the roasting tin into the heatproof bowl with the rest. Return the tin to the hob and add the onion. Fry over a medium heat for five minutes, stirring regularly until beginning to soften and colour.", "Pour the orange liqueur and wine into the pan with the softening onion and allow to bubble for a few seconds. Add the orange juice and 150ml/5fl oz cold water and simmer together for about two minutes, stirring to lift any of the meat sediment from the bottom of the tin. Carefully strain the liquid through a fine sieve into a small non-stick saucepan.", "Stir the reserved julienne orange strips and marmalade into the jus and bring to a simmer. Mix the cornflour with one tablespoon of cold water in a small bowl until smooth. Stir it into the orange sauce and cook for 1-2 minutes more, stirring regularly until the sauce is thickened and glossy. Pour any juices that have collected from the resting duck into the sauce and simmer for a few seconds, stirring.  Pour into a warmed jug. Carve the duck at the table with an onion wedge for each person, pour a little of the sauce over and serve the rest separately. "]}, {"isVegetarian": false, "title": "Duck a l’orange with smoked garlic mash, cardamom-glazed carrots and creamed chard", "url": "www_bbc_co_uk_food_recipes_duck_a_lorange_with_56899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4oz white potatoes, peeled and quartered", "4 smoked garlic cloves, peeled and left whole", "150ml/5fl oz whole milk", "110ml/3½fl oz butter, softened", "2 green cardamom pods, smashed", "2 tbsp caster sugar", "2 tbsp unsalted butter", "4 sweet young carrots with leaves cut in half, leave a small amount of green stalk on the end", "1 bunch Swiss chard leaves, separated and stalks finely chopped", "25g/1oz unsalted butter", "1 garlic clove", "250ml/9fl oz double cream", "100g/3½oz breadcrumbs", "100g/3½oz parmesan cheese, grated", "50g/1¾oz caster sugar", "2 oranges, zest and juice only", "2 tbsp white wine vinegar ", "350ml/12fl oz chicken stock", "2 tbsp olive oil", "4 duck breasts, trimmed and scored"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the potatoes in a saucepan and cover in cold water. Heat to a simmer and cook for 15-20 minutes, or until the potatoes are soft. Drain and then put through a potator ricer or mash in the pan.", "Meanwhile put the smoked garlic in a medium saucepan with the milk and cook for 10-15 minutes, strain and retain the milk. Add the milk and butter to the potatoes and mix until you have a very runny mash potato. Set aside until ready to serve.", "To make the glazed carrots, place a roasting tin on the hob. Once hot, add the cardamom, sugar and butter and melt. Add the carrots and place in the oven for 30 minutes.", "For the creamed chard, place a pan of water on the hob, fill with water and bring to the boil. ", "Blanch the leaves and the stalks separately, drain each and refresh in cold water to keep the colour.", "Heat a deep frying pan that fits in the oven, add the butter and fry the garlic. Add the cream and chard. Cook for 4-6 minutes, or until the volume of cream has reduced. ", "In a medium bowl, mix the breadcrumbs and parmesan cheese. Sprinkle this mixture over the top of the chard and place in the oven for 20 minutes, or until the top is brown.", "To make the sauce, place the sugar in a medium frying pan and heat it. Once it turns to a caramel, add the orange zest and juice, white wine vinegar and stock and cook until the volume of liquid has reduced by half.", "Heat a large ovenproof frying pan and add the oil. Once hot, add the duck skin-side down and cook for four minutes. Turn the duck over and place in the oven for eight minutes.", "To serve, place a spoon of the potatoes on each plate. Slice the duck on an angle and lay half of it on the mash. Sit a pile of the chard next to it and the carrots on the other side in a cross shape. Spoon the orange sauce over the duck."]}, {"isVegetarian": false, "title": "Duck and crumpets", "url": "www_bbc_co_uk_food_recipes_duck_and_crumpets_24221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "10g/½oz caster sugar", "15g/½oz fresh yeast, crumbled", "pinch bicarbonate of soda", "30g/1oz duck fat", "20g/¾oz panko breadcrumbs", "20g/¾oz butter", "20g/¾oz shiitake mushrooms", "2 tsp light soy sauce", "dash Tabasco sauce", "1 tsp mirin", "1 tsp rice wine vinegar", "300ml/10fl oz chicken stock", "150g/5½oz duck hearts, sliced", "20g/¾oz smoked duck breast, thinly sliced", "50ml/2fl oz sherry vinegar", "1 tsp yeast extract", "200ml/7fl oz demi-glace ", "sea salt ", "150g/5½oz firm goats’ cheese", "10g/½oz iceberg lettuce"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly grease the insides of six crumpet rings. ", "To make the crumpets, sieve the flour, add the sugar into a bowl. Dissolve the yeast in 270ml/9fl½ oz warm water. Make a well in the centre of the flour and add the yeast mixture. Gradually incorporate the flour into the centre and beat until you have a smooth batter. Allow to rest for 1 hour.", "Add the bicarbonate of soda to the batter and mix in a further 90ml/3fl oz water.", "Put the rings on a griddle pan placed over a medium heat. Fill three-quarters with the batter. Cook the crumpets for 4 minutes, then remove the rings. There should be a large number of very small holes on the surface. ", "Turn the crumpets over and cook until light in colour. Take off the griddle and allow to cool. ", "Heat a little duck fat in a frying pan and fry the panko breadcrumbs until golden. Drain on kitchen paper and season with salt.  ", "Heat the butter in a frying pan and fry the shiitake. Add the soy, Tabasco sauce, mirin, rice wine vinegar and stock.", "Heat a little duck fat in a frying pan and fry the duck hearts for 2–3 minutes, or until cooked through. Deglaze the pan with the sherry vinegar then add the yeast extract demi-glace. Allow to bubble until you have a smooth sauce.", "Divide the crumpets between four plates. Top with a duck hearts and shiitake mushrooms and pour over the duck sauce. Top with slices of smoked duck breast, shavings of goats’ cheese and the lettuce leaves. Sprinkle with the breadcrumbs and serve."]}, {"isVegetarian": false, "title": "Duck and lemongrass kebabs", "url": "www_bbc_co_uk_food_recipes_duck_and_lemongrass_18615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts, skin on", "75ml/2½fl oz vegetable oil", "75ml/2½fl oz dark soy sauce", "2 tbsp clear honey", "2 limes, juice only", "3 garlic cloves, grated", "1 red chilli, finely chopped", "3cm/1in fresh ginger, grated", "2 large field mushrooms, each cut into 6 pieces", "1 large head of broccoli, broken into large florets", "1 green pepper, deseeded and cut into squares", "2 red onions, each cut into 8 chunks", "8 lemongrass stalks"], "serves": "Makes 8 skewers", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Score the duck breast skin using a sharp knife (do not cut into the meat). Cut lines about 5mm apart on a slight angle, then cut the other way to form diamond shapes in the skin. ", "Place the breasts skin-side down in a dry, non-stick frying pan over a medium heat. Slowly cook for about 5-10 minutes, or until the fat has rendered from the breast and seeped into the pan. When the skin is golden-brown and crisp, remove the duck breasts and drain on kitchen paper. Allow to cool, then place in the fridge until needed.   ", "To make a marinade, mix the oil, soy sauce and honey together in a bowl. Add the lime juice, garlic, chilli and grated ginger and mix again. ", "Cut the duck into 12-16 evenly-sized cubes, then pierce each piece of duck and the vegetables using a skewer. Thread them onto the lemongrass stalks, trying not to put the same ingredients next to each other. When all eight lemongrass stalks are full, place them in a plastic container and pour over the marinade. Place the kebabs into the fridge to marinate for at least two hours, but overnight will be fine.", "Remove the kebabs from the fridge 30 minutes before you want to cook them. Heat a griddle pan or barbecue until hot. ", "Place the kebabs on the hot griddle pan or barbecue. Baste them with the marinade every 3-4 minutes, turning frequently so they cook evenly. Cook for about 8-10 minutes, then remove from the heat and leave to rest for 4-5 minutes before serving."]}, {"isVegetarian": false, "title": "Duck and sorrel broth (green borscht)", "url": "www_bbc_co_uk_food_recipes_duck_and_sorrel_broth_30291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck carcasses (preferably organic)", "1 large onion, roughly chopped", "2 leeks, roughly chopped", "2 celery sticks, roughly chopped", "3 carrots, 2 roughly chopped, 1 grated ", "2 fresh bay leaves, torn", "2 banana shallots, finely chopped", "50g/1¾oz sorrel leaves, sliced", "1 small bunch dill, roughly chopped", "4 spring onions, thinly sliced", "6 hard-boiled quails' eggs, halved", "red veined or green micro sorrel (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the broth, put the duck carcasses, onion, leek, celery, roughly chopped carrots and bay leaves in a very large saucepan and pour over cold water until the carcasses are just covered. Bring to the boil, skim any scum that naturally comes to the surface and lower the temperature. Simmer gently for 2 hours, or until the liquid has reduced by half and the stock is rich and fragrant. ", "Remove the carcasses from the pan, pick off any meat and set aside, discarding the bones.", "Strain the broth into a large bowl through a sieve and discard the vegetables. Season the broth well.", "Skim a tablespoon of the duck fat off the stock and place in a frying pan set over a high heat for about a minute or until the water has evaporated, leaving just the fat. Add the shallots and cook for 5 minutes or until softened. Add the grated carrots and cook over a medium heat until soft and starting to caramelise. Tip the fried vegetables into the broth and stir well.", "To serve, put a little of the reserved meat in the bottom of each bowl, pour over the broth and top with the remaining ingredients. "]}, {"isVegetarian": false, "title": "Duck breast and courgette tournedos", "url": "www_bbc_co_uk_food_recipes_duck_breast_and_zucchini_65488", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz dried cep or porcini mushrooms", "2 tbsp coarsely ground black pepper ", "1 tbsp herbs de Provence (usually marjoram, oregano, rosemary, thyme)", "3 duck breasts", "6 young courgettes", "salt", "½ onion, finely diced", "2 tbsp mint, finely shredded", "1 lemon, juice only", "2 tbsp extra virgin olive oil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the dried cep mushrooms in a food processor until finely ground, then combine them with the black pepper and herbs de Provence.", "Cut the duck breasts lengthways into 3mm/1/8in thick slices. ", "Cut three of the young courgettes into thin slices using a vegetable peeler. ", "Assemble the tournedos by dividing the duck slices into six portions. For each portion, lay two slices of duck breast alongside each other, and stack the rest of the slices for that portion on top,  alternating layers of fat and lean meat. ", "Divide the courgette strips into six portions. For each portion, lay the strips of courgette on top of the duck, season with the mushroom powder and season with salt. ", "Roll up the duck slices and courgette strips tightly to make tournedos and tie with string, to keep the cylinder shape in place. ", "Make six tournedos in this way. ", "Cook gently on the barbecue, or griddle pan, for five minutes each side. ", "Finely dice the remaining courgettes and toss with the onion, mint, lemon juice and olive oil.", "To serve, cut the tournedos into thick slices and place on serving plates with the salad."]}, {"isVegetarian": false, "title": "Duck breast with umeboshi sauce and steamed bok choi", "url": "www_bbc_co_uk_food_recipes_duck_breast_with_30241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp mild curry powder", "1 tsp ground ginger", "1 tsp Chinese five-spice powder", "2 tsp sansho pepper", "4 x 175g/6oz duck breasts", "4 tbsp honey", "1 head of bok choi, root removed, leaves separated", "3cm/1¼in root ginger, peeled, finely diced", "1 garlic clove, crushed", "1 red chilli, finely sliced", "½ red onion, finely sliced", "200g/7oz umeboshi plums, stones removed (available from health food shops and online specialists)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "In a bowl, mix together the curry powder, ground ginger, Chinese five-spice and sansho pepper. Set aside a teaspoon of the spice mixture for the plums. Sprinkle the rest of the spice mixture over the skin and flesh of the duck breasts.", "Place the duck breasts, skin-side down, into a large, cold, non-stick, ovenproof frying pan.Turn on the heat to high and leave for 3-4 minutes, until the pan is hot and the fat has rendered. ", "Turn over the duck breasts and drizzle half of the honey over the skins. Transfer the pan to the oven and roast the duck breasts for 8-10 minutes (for medium), or longer until cooked to your liking, basting the duck breasts with the pan juices halfway through cooking.", "When the duck is cooked to your liking, remove from the pan and set aside to rest on a warm plate for 8-10 minutes.", "Meanwhile, steam the bok choi leaves with the ginger, garlic, chilli and red onion in a steamer suspended over a pan of barely simmering water for 5-6 minutes, or until wilted and tender.", "Blend the plums to a fine purée with 1 teaspoon of the remaining spice mixture and all of the remaining honey, using a food processor or hand-held blender. Warm the mixture in a small saucepan, then add it to the juices released from the duck. Season with more honey if needed.", "To serve, divide the steamed vegetables equally among four serving plates. Carve the duck breasts into thick slices and arrange them alongside. Finish with a dollop of the umeboshi sauce."]}]