[{"ingredients": ["2 cucharadas de aceite vegetal", "2 chalotes de plátano, pelados y finamente cortados en cubitos", "2 dientes de ajo, picados", "Jengibre fresco de raíz de 5cm / 2in, cortado en juliana", "1 varita de limoncillo, finamente picada", "1 hoja de lima, finamente picada", "2 cucharadas de salsa de pescado tailandesa", "3 cucharadas de azúcar de palma (alternativamente, use azúcar morena suave)", "2 cucharadas de vinagre de vino de arroz", "2 cucharadas de jugo de lima", "150ml / 5fl oz de caldo de verduras", "3 cucharadas de menta fresca picada", "3 cucharadas de cilantro fresco tostado", "2 cucharadas de aceite vegetal", "4 x 150g-200g / 5½-7oz filetes de rodaballo, con piel, deshuesada", "4 libros choi, reducido a la mitad", "150g / 5½oz Tenderstem brócoli", "Jengibre fresco de 2cm / ¾in en rodajas finas", "2 palitos de limoncillo, magullados y picados por la mitad", "2 cucharadas de aceite de sésamo", "2 cucharadas de salsa de soja"], "method": ["Para la salsa de jengibre y lima, caliente una sartén y agregue el aceite. Una vez caliente, agregue los chalotes y cocine durante 1-2 minutos. Agregue el ajo, el jengibre, el limoncillo y la hoja de lima y cocine durante 2-3 minutos más. Agregue la salsa de pescado, el azúcar de palma, el vinagre de vino de arroz, el jugo de lima y el caldo y cocínelos durante 2-3 minutos. Mantenga caliente mientras cocina el pescado y las verduras.", "Para el rodaballo, caliente una sartén grande y agregue el aceite, una vez caliente agregue el pescado con la piel hacia abajo. Cocine por 2-3 minutos en cada lado y déjelo reposar en un plato caliente. (Dependiendo del tamaño de su sartén, puede que necesite cocinar el pescado en tandas).", "Para los verdes al vapor, coloque un recipiente de vapor sobre una olla de agua hirviendo y agregue el bok choi, el brócoli, el jengibre, el limoncillo, el aceite de sésamo y la salsa de soja. Cubra con una tapa y cocine durante 4-5 minutos.", "Justo antes de servir, agregue la menta fresca y el cilantro a la salsa.", "Para servir, coloque las verduras al vapor en el centro de cuencos poco profundos y coloque el pescado encima. Retire la piel y vierta sobre el jengibre y la salsa de lima."], "url": "www_bbc_co_uk_food_recipes_turbot_with_a_ginger_and_48467", "title": "Rodaballo con salsa de jengibre y lima y verduras al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Coliflor 500g / 1lb 2 oz, picada", "600 ml / 1 litro de leche", "500 g / 1lb 2 oz almejas", "1 cucharada de aceite de girasol", "media cebolla pequeña, finamente picada", "250ml / 9fl oz de vino blanco", "50g / 1¾oz de mantequilla", "Harina de 75g / 2½oz", "200g / 7oz de queso cheddar fuerte, rallado", "1 coliflor, hojas externas eliminadas", "50g / 1¾oz de mantequilla", "1 brócoli, cortado en floretes (manteniendo tanto tallo sobre ellos como sea posible)", "4 zanahorias pequeñas, enteras", "2 hojas de nori", "20g / ¾oz de sal marina", "1 cucharada de aceite de oliva", "4 x 120 g / 4 oz de filetes de rodaballo, piel en"], "method": ["Agregue la coliflor picada a una cacerola grande y cubra con la leche. Llevar a fuego lento y cocinar durante cinco minutos. Cepa y tamiz, conservando tanto la leche como la coliflor.", "Frote las conchas de almeja en agua fría. Deseche las almejas que tengan conchas rotas y deseche las almejas abiertas que no se cierren cuando se da un golpecito fuerte. Calienta una olla mediana con tapa y agrega el aceite. Una vez caliente, agregue la cebolla y las almejas, mezcle y agregue el vino blanco y colóquelo. Una vez que las almejas se hayan abierto, escurra y reserve el líquido de cocción. (Deseche cualquier almeja que no se haya abierto).", "Caliente una olla grande y una vez caliente agregue la mantequilla. Una vez que la mantequilla se derrita, agregue la harina y cocine por 2-3 minutos.", "Poco a poco agregue el licor de cocción de almejas y la leche de la coliflor, batiendo continuamente hasta lograr una salsa suave. Agregue el queso y la coliflor cocida y coloque en un procesador de alimentos. Mezcle, agregue más leche y licor de cocina de almejas si es necesario, hasta que obtenga una salsa suave.", "Para las verduras, corte toda la coliflor por la mitad. Corta la mitad en florecillas grandes manteniendo la mayor cantidad de tallo como sea posible. Mantenga la otra media coliflor sin cortar, para cortar una mandolina más tarde.", "Caliente una sartén grande y una vez caliente agregue la mantequilla. Cuando la mantequilla esté espumante, agregue las flores de coliflor, el brócoli y las zanahorias y cocine a fuego lento durante cinco minutos. Agregue las almejas en sus cáscaras y continúe cocinando por unos minutos más hasta que las verduras estén doradas.", "Afeite la coliflor restante en una mandolina, colóquela en agua helada y déjela a un lado.", "Haga sal de nori, colocando las hojas de nori en un molinillo de especias y licuando. Retire del molino y mezcle con la sal marina.", "Escurrir la coliflor afeitada y sazonar con la sal de nori.", "Para el rodaballo, caliente una sartén grande, una vez caliente agregue el aceite y coloque los filetes de rodaballo con la piel hacia abajo y cocine durante 3-4 minutos. Déles la vuelta y cocine por otro minuto.", "Para servir, coloque una cucharada del puré en cada una de las cuatro placas. Coloque el pescado encima, coloque algunas florecillas de coliflor, brócoli, una zanahoria y unas almejas al lado del pescado. Adorne con las virutas de coliflor y la sal de nori. Rocíe un poco de aceite de oliva alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_turbot_with_cauliflower_17937", "title": "Rodaballo con puré de coliflor y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x filetes de rodaballo, sin piel", "4 hojas de verbena de limón", "4 girolles secos", "1 ramita de tomillo", "1 ramita de hinojo de bronce", "1 ramita de mejorana", "10 vainas de guisantes, envasadas", "2 calabacines pequeños, cortados en cubos de 2cm / ¾in", "4 rábanos, cortados en cubos de 2cm / ¾in", "4 nabos para bebés, cortados en cubos de 2cm / ¾in", "1 zanahoria dulce, pelada, cortada en cubos de 2cm / ¾in", "6 hongos girolle", "1 cebolla tierna, finamente picada", "250g / 9oz de mantequilla sin sal", "1 limón, solo jugo", "flores de cebollino, para servir (opcional)", "perifollo picado, para servir"], "method": ["Para hacer el caldo, coloque todos los ingredientes en una olla grande. Hervir 100 ml / 3½ fl oz de agua y verter sobre.", "Calentar una sartén a fuego medio. Agregue el calabacín y los girolles y cocine por unos minutos. Agregue las verduras y la mantequilla restantes y sude unos minutos más. Verter sobre el caldo, llevar a ebullición y reducir durante unos minutos.", "En otra sartén, caliente un poco de mantequilla hasta que forme espuma. Agregue el rodaballo y cocine por 2- 3 minutos en cada lado, o hasta que esté dorado por todas partes.", "Termine las verduras con un poco de mantequilla para emulsionar el caldo, agregue una pizca de jugo de limón y un perifollo picado.", "Para servir, coloque las verduras en el fondo de un tazón, cubra con el rodaballo y esparza sobre las flores de cebollino."], "url": "www_bbc_co_uk_food_recipes_turbot_with_garden_01840", "title": "Rodaballo con verduras de jardín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de patatas nuevas, cortadas en cuartos", "150g / 5½oz de brócoli, cortado en pequeños floretes", "8 lanzas de espárragos, recortadas", "100 g / 3½ oz de habas frescas, envasadas", "100g / 3½oz de guisantes frescos", "2 cucharadas de aceite de oliva", "75g / 2¾oz de mantequilla", "sal y pimienta negra recién molida", "75g / 2¾oz de mantequilla", "Filete de rodaballo de 4 x 200 g / 7oz, deshuesado, piel en", "50g / 1¾oz de mantequilla", "2 chalotes medianos, en rodajas finas", "150ml / 5fl oz de vino blanco seco", "150ml / 5fl oz de caldo de pescado", "150ml / 5fl oz de crema doble", "110ml / 3¾ fl oz de champán", "2 cucharadas de cebollines picados", "ramitas de perifollo fresco"], "method": ["Poner a hervir un recipiente con agua con sal y cocinar las papas durante 10-15 minutos. Escurrir y apartar.", "Traiga una olla separada de agua con sal al hervor y cocine las verduras, comenzando con el brócoli, luego los espárragos, luego las habas y luego los guisantes. Cocine el brócoli durante 8-10 minutos, dependiendo del tamaño, luego agregue las otras verduras en intervalos de 2 minutos.", "Para el rodaballo, caliente una sartén hasta que esté caliente. Agregue la mantequilla y el pescado, con la piel hacia abajo. Cocine a fuego medio durante 2 minutos hasta que la piel esté crujiente y el pescado esté cocido a dos tercios del proceso. Dé la vuelta y cocine por otro minuto, luego retírelo del fuego y déjelo reposar en un lugar cálido por un minuto.", "Para la salsa, caliente una sartén hasta que esté a fuego medio, agregue la mantequilla y las chalotas y fría por un par de minutos, o hasta que se ablanden, pero no se doren.", "Agregue el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo de pescado y cocine hasta que se reduzca a la mitad nuevamente. Agregue la crema y cocine una vez más hasta que se reduzca en un tercio. Cuele a través de un colador fino en una sartén limpia, revise el condimento, agregue sal y pimienta al gusto y reserve.", "Para las verduras, caliente una sartén y agregue el aceite, una vez caliente agregue las papas cocine por 2-3 minutos, luego agregue las verduras. Agregue la mantequilla y sazone con sal y pimienta y revuelva.", "Justo antes de servir, regrese la salsa al fuego y caliente hasta que hierva a fuego lento, luego agregue el champán y el cebollín y revuelva.", "Coloque las verduras en el centro de un tazón para servir y cubra con el pescado. Vierta sobre la salsa de champán y adorne con perifollo."], "url": "www_bbc_co_uk_food_recipes_turbot_with_new_potatoes_63568", "title": "Rodaballo con salsa de champán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz huesos de pescado", "1 cebolla grande, más o menos picada", "1 puerro grande, picado", "1 zanahoria grande, picada", "1 barra de apio, incluida la parte superior con hojas, en rodajas", "1 cucharadita de granos de pimienta", "2 hojas frescas de laurel", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "1 chalote, picado", "1 calabaza, pelada y cortada en cubos de 2cm / ¾in", "Anís de 2 estrellas", "110g / 3¾oz de mantequilla", "4 x 200 g / 7 oz de filetes de rodaballo, deshuesados, piel en", "2 chalotes medianos, en rodajas finas", "150ml / 5fl oz Prosecco", "150ml / 5fl oz de caldo de pescado (desde arriba)", "150ml / 5fl oz de crema doble", "200 g / 7 oz de samphire (alternativamente, use puntas de espárragos)", "Setas de rebozuelo 300g / 10½oz, limpiadas", "sal y pimienta negra recién molida", "2 cucharadas de perifollo", "trufa fresca, rallada"], "method": ["Para el caldo de pescado, coloque todos los ingredientes en una olla grande, cubra con 850ml / 1½ pintas de agua y cocine a fuego lento durante 20-40 minutos, con frecuencia rozando la parte superior para eliminar las impurezas. Pasar a través de un tamiz en una jarra. Descarta los huesos.", "Para la calabaza asada y el hinojo, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el ajo y la chalota y cocine por 2-3 minutos. Agregue la calabaza y el anís estrellado y cocínelos durante 5-8 minutos, o hasta que la calabaza se haya cocinado. Retire el anís estrellado y deséchelo.", "Para el rodaballo, derrita un poco de mantequilla en una sartén grande a fuego medio. Agregue el pescado, con la piel hacia abajo y cocine por 2 minutos, o hasta que la piel esté crujiente y el pescado esté cocido a dos tercios del proceso (es posible que deba cocinar el pescado en tandas). Dé la vuelta y cocine por otro minuto, luego retírelo del fuego y déjelo reposar en un lugar tibio hasta que esté listo para servir.", "Caliente una sartén hasta que esté a fuego medio, agregue 50 g / 2 oz de mantequilla y las chalotas y fría por un par de minutos, o hasta que se ablanden pero no se doren. Agregue el Prosecco y cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo de pescado y cocínelo hasta que se reduzca a la mitad nuevamente. Agregue la crema y cocine hasta que se reduzca en un tercio. Colar a través de un colador fino en una sartén limpia, agregar sal y pimienta al gusto y dejar de lado.", "Blanquee la hierba en una olla grande de agua hirviendo durante un minuto y luego escurra.", "Caliente otra sartén hasta que esté caliente, agregue la mantequilla restante, los níscalos y el hinojo. Freír a fuego alto hasta que el hinojo se marchite, pero aún de color verde brillante. Sazonar con un poco de sal y pimienta negra.", "Para servir, amontone la calabaza en el centro de los tazones para servir y cubra con un filete de rodaballo, con la piel hacia arriba. Con una cuchara, coloca la salsa Processco encima y decora con los champiñones, el hinojo, el perifollo y la trufa fresca."], "url": "www_bbc_co_uk_food_recipes_turbot_with_prosecco_98770", "title": "Rodaballo con salsa Prosecco, champiñones, calabaza asada y hinojo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz de pavo picada", "500g / 1lb 2oz de calabacín rallado", "2 cucharaditas de hierbas italianas secas", "2 cucharaditas de bicarbonato de soda", "½ cucharadita de hojuelas de chile seco", "2 cucharadas de alcaparras escurridas, más o menos picadas", "aceite de oliva en aerosol", "sal marina y pimienta negra recién molida", "Col roja de 100 g / 3½ oz, finamente triturada", "200g / 7oz de col blanca, finamente rallada", "1 cucharadita de sal", "1 zanahoria grande, pelada y rallada", "1 cucharadita de semillas de hinojo tostadas, molidas", "1 cucharada de vinagre de vino blanco", "60g / 2% C2% BCoz% 200 %% 20fat% 20Greek-style% 20yoghurt% 20% 20", "2 cucharadas de mayonesa con grasa", "4 rodajas de mozzarella semicama (30 g / 1 oz cada uno)", "4 bollos de hamburguesas integrales grandes, tostados (opcional)", "4 rebanadas gruesas de tomate de ternera", "50g / 1¾oz de hojas de cohete"], "method": ["Pon la carne de pavo en un tazón grande. Tome el calabacín rallado en puñados y exprímalo bien para eliminar el exceso de agua, antes de agregarlo al tazón. Agregue las hierbas secas, el bicarbonato de soda, los copos de chile y las alcaparras, sazone con sal y pimienta y mezcle bien.", "Divida la mezcla en cuatro porciones iguales y forme hamburguesas. Coloque en una bandeja para hornear forrada con pergamino para hornear, cubra y refrigere mientras prepara el repollo.", "Coloque todo el repollo en un recipiente, espolvoréelo con sal y mezcle bien. Deje reposar durante 20 minutos, luego enjuague bien y escurra bien. Mezcle los otros ingredientes de la ensalada de col.", "Precalentar el horno a Ventilador Ventilador / Gas de 240C / 220C. Retire las hamburguesas de la nevera y rocíe cada una con un par de aerosoles de aceite. Cocine en el estante superior del horno durante aproximadamente 12 minutos, o hasta que estén dorados y cocidos.", "Coloque una rebanada de mozzarella en cada hamburguesa y cocine por otros 4-5 minutos, o hasta que el queso se haya derretido.", "Coloque una hamburguesa de pavo dentro de cada panecillo, si sirve. Cubra con una rodaja de tomate y un puñado de hojas de rúcula, luego cierre las tapas de los panecillos. Sirve con la ensalada de col en un lado."], "url": "www_bbc_co_uk_food_recipes_turkey_and_courgette_65781", "title": "Hamburguesas de pavo y calabacín con mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_and_courgette_65781_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 maíz en la mazorca", "Harina de auto crianza de 200g / 7oz", "60 g / 2¼ oz de mantequilla", "1 cucharada de cebollines finamente picados", "sal y pimienta negra recién molida", "8 ostras de pavo o 1 pechuga de pavo grande", "1 zanahoria, pelada y picada", "1 cebolla, más o menos picada", "1 diente de ajo, aproximadamente picado", "1 ramita de tomillo", "1 hoja de laurel", "225 g / 8 oz espinaca bebé", "nuez moscada, para rallar", "sal y pimienta negra recién molida", "pizca de pimentón ahumado"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Cepille el maíz en las mazorcas con aceite y tueste durante 20 minutos hasta que esté suave. Una vez que esté lo suficientemente frío para manipularlo, corte los granos y déjelos a un lado.", "Para hacer las albóndigas, mezcle la harina con la mantequilla, el cebollín y la mitad de los granos de maíz. Sazone con sal y pimienta y agregue suficiente agua para hacer una masa. Divide la masa en 12 y dale forma de albóndigas. Dejar de lado.", "Para hacer la sopa, la zanahoria, la cebolla, el ajo, el tomillo, la bahía y una pizca de sal en una sartén. Cubra con agua fría y lleve a ebullición. Retirar del fuego y reservar para enfriar.", "Cuele el caldo y deseche las verduras. Pase el caldo por un tamiz. Agregue 200 ml / 7 fl oz del caldo a una olla limpia, cocine a fuego lento y cocine las albóndigas hasta que estén cocidas y esponjosas.", "Cocine las espinacas en el caldo restante hasta que se marchiten. Verifique el condimento y luego mezcle hasta que quede suave, agregando un poco de agua si es necesario.", "Precaliente la parrilla a fuego medio y cocine el pavo durante 10 minutos en cada lado, hasta que esté bien cocido. Cortar finamente.", "Vierta la sopa en cuencos hondos y cubra con el pavo, las albóndigas y el resto del maíz. Agregue una ralladura de nuez moscada y una pizca de pimentón y servir."], "url": "www_bbc_co_uk_food_recipes_turkey_and_spinach_soup_88388", "title": "Sopa de espinacas y pavo con albóndigas de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pierna de pavo (aproximadamente 700-800 g / 1 lb 9 oz -1 lb 12 oz)", "sal y pimienta", "2 cebollas en rodajas", "2 dientes de ajo, golpeados", "2 zanahorias, cortadas en cubitos", "1 litro / 1¾ pintas de caldo de pollo, hecho de cubo común", "Papas de 500 g / 1 libra y 2 onzas, peladas y cortadas en trozos del tamaño de un bocado", "1 manojo de perejil, aproximadamente picado"], "method": ["Caliente una cacerola grande a fuego alto. Agregue el aceite, sazone la pierna de pavo en todos los lados y dore en la sartén caliente durante 7-8 minutos, volteándolo de vez en cuando para asegurarse de que todos los lados estén coloreados.", "Baje la temperatura a medio y agregue las cebollas, el ajo y las zanahorias y revuelva.", "Verter en el caldo, mezclar bien para combinar. Reduzca el fuego para que el caldo hierva a fuego lento. Cubra con una tapa y cocine durante una hora, revolviendo ocasionalmente.", "Una vez que la pierna de pavo esté cocida, retírela del estofado y déjela reposar ligeramente. Agregue las papas al estofado, cubra nuevamente y continúe cocinando por 20 minutos, o hasta que las papas estén tiernas.", "Mientras tanto, una vez que se haya enfriado lo suficiente, quite la piel del pavo y use un tenedor para ayudar a triturar la carne, descartando cualquier hueso o tendón. Agregue la carne a la sartén con las papas cocidas y la mezcla de guisado. Mezcle bien, pruebe y ajuste el condimento según sea necesario.", "Una vez listo para servir, remueva el perejil picado y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_turkey_and_vegetable_58284", "title": "Pavo y guiso de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pavo, cortadas en muslos y baquetas", "2 alas de pavo", "1 botella de vino tinto, preferiblemente Pinot Noir o Borgoña", "2 cebollas pequeñas, más o menos picadas", "2 palitos de apio, más o menos picados", "2 zanahorias medianas, aproximadamente picadas", "4 dientes de ajo, toscamente picados", "hojas de tomillo", "granos de pimienta negra", "1 hoja de laurel", "mantequilla, para freír", "150 g / 5½ oz de panceta, cortada en dados gruesos", "15 champiñones", "15 cebollas baby, peladas", "100 g / 3½ oz de harina natural, sazonado con sal marina y pimienta negra recién molida", "1 zanahoria, en rodajas", "1 barra de apio, en rodajas", "ramitas de tomillo", "1 hoja de laurel", "perejil de hoja plana, picado"], "method": ["Coloque todos los ingredientes del adobo en un tazón, agregue los pedazos de pavo y deje marinado durante al menos seis horas o, preferiblemente, durante la noche.", "Caliente una cacerola grande o una cazuela a prueba de fuego y agregue un pomo de mantequilla. Agregue la panceta y ligeramente marrón, luego retírela de la sartén y déjela a un lado. En la misma sartén, cocine los champiñones y las cebollas durante unos minutos hasta que se coloreen, luego retírelos de la sartén y deje la sartén a un lado.", "Retire el pavo del adobo, cuele el líquido sobre un recipiente y deseche las verduras. Sumerja el pavo en la harina sazonada, sacudiendo el exceso. Regrese la sartén a la placa a fuego alto y dore las piezas de pavo en todos los lados. Baje el fuego y agregue los champiñones, las cebollas, la zanahoria y el apio junto con el tomillo y la hoja de laurel. Vierta el adobo colado y cocine a fuego lento durante una hora. Deje que la cacerola descanse durante unos 15 minutos, luego agregue el perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_turkey_braised_in_red_26688", "title": "Pavo estofado en vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de arándanos secos", "100 ml / 3½ fl oz oz Marsala", "2 cucharadas de aceite de oliva", "2 chalotes de plátano, finamente picados", "¼ cucharadita de clavo de olor molido", "½ cucharadita de pimienta de Jamaica molida", "2 cucharaditas de salvia fresca picada", "1kg / 2lb 4oz de salchichas italianas", "2 huevos de gallinas camperas, golpeados", "Parmesano 50 g / 2 oz, rallado", "60g / 2¼ oz de pan rallado", "5kg / 11lb pechuga de pavo doble conjunta, deshuesada, mariposa, con la piel dejada en", "4 cucharadas de grasa de pato o ganso"], "method": ["Coloque los arándanos y Marsala en una olla pequeña y deje hervir, luego quite el fuego y déjelo a un lado.", "Ponga el aceite en una sartén grande o una sartén similar de base pesada, y fríe las chalotas por un minuto o más, luego agregue las especias y la salvia triturada, convirtiéndolas en chalotes blandos.", "Exprima la carne de salchicha de sus pieles, agréguela a la sartén y divídala, utilizando un tenedor de madera y una espátula para facilitarla, girándola en la sartén caliente hasta que pierda su color rosado. Esto llevará unos cinco minutos.", "Saque la sartén del fuego y convierta el contenido en un tazón grande, mezcle los arándanos rellenos y cualquier Marsala que se adhiera a ellos, y deje que se enfríe. Puede cubrir con película adhesiva y poner en la nevera durante un máximo de dos días en esta etapa.", "Cuando esté listo para rellenar la pechuga de pavo, saque el tazón de salchicha de la nevera.", "Precalentar el horno a 200C / 400F / Gas 6.", "Destape el plato de carne de salchicha, agregue los huevos, parmesano y pan rallado y - Yo uso mis manos para esto - mezcle bien.", "Coloque la articulación de pavo con mariposa delante de usted. Realmente se parece a una mariposa, aunque es cierto que es carnosa. Extienda el relleno primero en la pequeña cavidad en el centro de la mariposa y luego hacia afuera sobre las alas, aunque no vaya directo al borde (o se escabullerá cuando se cocina) pero lo más uniformemente posible sobre toda la articulación.", "Con cuidado, con un movimiento rápido pero constante, doble una 'ala' sobre la otra para cerrar la articulación, y luego siéntela en una lata grande para asar, con el hueso del pecho (o donde esté el esternón) más arriba de lo que se vería es el pájaro entero, con el bit más alejado más lejos de ti. Pase dos pinchos por la base, es decir, la parte más ancha que esté más cerca de usted, para mantenerlo cerrado y untarlo con pato o grasa de ganso.", "Ase la pechuga de pavo durante 2-2½ horas, luego verifique que esté cocida con un termómetro de pavo o carne. Cuando esté cocinado, debería leer 75C. (Si lo deja para descansar, como debe o para que se enfríe, puede sacarlo a 73 ° C - retendrá el calor y continuará cocinando por un tiempo corto una vez que salga del horno).", "Flexione los músculos, luego levante sobre una tabla de tallado y déjelos descansar durante al menos 20 minutos. O deje que se enfríe si lo está comiendo como parte de un buffet.", "Corta toda la unión en rebanadas anchas; necesitarán ser bastante gruesos, al menos 1-2 cm / 1 1/2 pulgadas, para mantener el relleno intacto dentro de la rebanada.", "Cuando lo coloques en la mesa o en el aparador, salpícalo con los condimentos que elijas: vuelvo a la Navidad en Italia colocando una olla deliciosamente extravagante o dos de Mostarda di Cremona italiana sobre la mesa al lado: esta es una cáscara caliente y dulce de frutas confitadas mustardy que brillan maravillosamente y prueban festivo y fabuloso."], "url": "www_bbc_co_uk_food_recipes_turkey_breast_stuffed_43707", "title": "Pechuga de pavo rellena con salchicha italiana y arándanos empapados en Marsala", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_breast_stuffed_43707_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pavo de 5.5kg / 12lb, dividido en coronas y patas deshuesadas, completamente descongelado si está congelado", "100g / 3½ oz de mantequilla ablandada", "sal y pimienta negra recién molida", "15g / ½ oz de mantequilla", "1 cebolla, finamente picada", "600g / 1lb 5oz de carne de salchicha", "Castañas 200g / 7oz, desmenuzadas", "1 pera, pelada, sin corazón y finamente picada", "2 albaricoques, piedras removidas, finamente picadas", "1 cucharadita de bayas de pimienta de Jamaica, molidas", "pizca de nuez moscada recién rallada", "2 ramitas grandes de tomillo fresco, hojas recogidas y picadas", "1 limón sin cebar, ralladura fina solamente", "2 cucharadas de harina normal", "600ml / 20fl oz de caldo de pavo", "100 ml / 3½ fl oz de vino blanco seco"], "method": ["El día antes de que desee cocinar el pavo, póngalo en un plato y espolvoréelo con sal. Refrigere durante la noche, cubierto, asegurándose de que los jugos no goteen sobre otros alimentos en su refrigerador.", "El día que quieras cocinar el pavo, sécalo con papel de cocina. Deje reposar durante una hora para volver a la temperatura ambiente. Precaliente el horno a 190C / 170C Fan / Gas 5.", "Mientras tanto, para hacer el relleno, caliente la mantequilla en una sartén, agregue la cebolla y fría hasta que esté suave y translúcida. Deje que se enfríe a temperatura ambiente.", "Coloque la carne de salchicha y todos los ingredientes de relleno restantes en un recipiente y sazone con sal y pimienta. Agregue la cebolla y mezcle bien.", "Coloque las piernas deshuesadas, con la piel hacia abajo. Coloque un puñado del relleno en el centro de la parte más gruesa de cada pierna, luego envuelva los lados alrededor de él. Cuando se coloca boca abajo, se verá como un muslo corto y gordo. Rellena la corona de pavo con el resto del relleno, teniendo cuidado de no empacarlo.", "Pese la corona rellena y anote el peso. Coloque la corona en una bandeja de asar. Unta la mayor parte de la mantequilla sobre los senos, reservando un poco para las piernas. Cubra la bandeja con papel de cocina.", "Calcular el tiempo de cocción; serán 15 minutos por kg / 2lb 4oz, más 90 minutos (por ejemplo, para una corona de 3kg / 6lb 8oz, incluido el relleno, será de 2¼ horas). Unta la mantequilla sobre las patas y agrégalas 45 minutos antes de que finalice el tiempo de cocción, retirando la lámina al mismo tiempo para que la piel se ponga dorada y crujiente.", "Para verificar si el pavo está cocinado, use un termómetro de carne o sonda: la parte más gruesa de la carne y el relleno debe registrar 71C / 160F. Los jugos también deberían quedar claros cuando la parte más gruesa del pavo se perfora con un pincho.", "Coloque la corona y las patas en un plato calentado para descansar.", "Mientras tanto, para hacer la salsa, cuela todo el líquido de la lata de asar. Espolvorea la lata con la harina y ponla a fuego medio. Revuelva hasta que la harina haya recogido la mayor parte del sedimento del fondo de la lata. Agregue un poco del caldo y revuelva hasta que haya desglaseado el estaño.", "Transfiera la salsa a una cacerola. Agregue el caldo restante y el vino. Llevar a ebullición, luego baje el fuego y cocine a fuego lento durante unos minutos. Verifique el condimento y ajuste si es necesario.", "Tallar la corona y las patas en rodajas y servir con la salsa."], "url": "www_bbc_co_uk_food_recipes_turkey_crown_and_legs_32901", "title": "Corona de pavo y patas con relleno de castaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla picada", "4 aves frescas ojo chiles, semillas quitadas, picadas", "1 cucharadita de semillas de cilantro", "2 cucharaditas de pasta de tamarindo", "1 cucharada de azúcar en polvo", "2 dientes de ajo, magullados", "1 jengibre con raíz pequeña, pelado y picado", "1 cucharada de aceite de girasol, para freír", "Pechuga de pavo de 500 g / 1 lb 2 oz, en rodajas", "3 ramitas de tomillo, solo hojas", "Leche de coco 400ml / 14fl oz", "150ml / 5fl oz de caldo de pollo o pavo", "2 papas cerosas grandes, peladas y cortadas en cubitos", "250 g / 9 oz de espinacas frescas, picadas", "1 manojo de cilantro fresco, picado", "50 g / 1¾oz de almendras peladas enteras"], "method": ["Coloque la cebolla picada, los chiles, las semillas de cilantro, el tamarindo, el azúcar y un diente de ajo en una licuadora o procesador de alimentos con jengibre. Pulso hasta que se mezcle en una pasta.", "Caliente el aceite en una sartén grande y dore el pavo, en tandas si es necesario, con el diente de ajo restante y el tomillo. Retire el pavo de la sartén y deseche el ajo. En la misma sartén, cocine la pasta mezclada durante unos minutos y luego devuelva el pavo a la sartén y agregue la leche de coco, el caldo y las papas.", "Cocine suavemente durante 20 minutos hasta que el pavo se haya cocinado y la salsa se haya espesado. Finalmente, agregue la espinaca, el cilantro fresco y las almendras y caliente. Retirar del fuego y servir."], "url": "www_bbc_co_uk_food_recipes_turkey_curry_45626", "title": "Pavo con curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_curry_45626_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2.2kg / 4lb 14oz pavo corona", "2 cucharaditas de hojas de tomillo picadas", "50g / 1¾oz de mantequilla, ablandada", "2 naranjas pequeñas, una delgada en rodajas, una cortada a la mitad", "1-2 cucharadas de aceite vegetal", "3 cucharadas de harina común", "6 cucharadas de puerto", "450 ml / ¾ pinta de pavo caliente o caldo de pollo", "splash salsa Worcestershire", "2 cucharadas de salsa de soja", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Afloje la piel de la corona de pavo empujando los dedos (o la espátula de goma) entre la piel y la carne, moviéndola para llegar a los lugares difíciles y teniendo cuidado de no rasgar la piel.", "Mezcle las hojas de tomillo con la mantequilla ablandada hasta que estén bien combinadas, luego unte la mezcla debajo de la piel del ave. Coloque las rodajas de naranja en dos filas ordenadas debajo de la piel, encima de la mantequilla de hierbas.", "Coloque una de las mitades de naranja debajo de la piel en el extremo del cuello del ave, y cualquier recorte de naranja en la cavidad del cuello.", "Transfiera la corona de pavo a una bandeja pequeña para asar. Frote todo con el aceite y sazone con sal y pimienta negra recién molida. Asar en el horno durante aproximadamente 1½-2 horas, o hasta que los jugos se aclaren cuando el pavo se perfora en la parte más gruesa con un pincho y no quedan rastros de color rosa. Durante la cocción, verifique el pavo cada 30 minutos, hilvane ocasionalmente y cubra con papel de aluminio si se dora demasiado rápido.", "Aproximadamente 15 minutos antes del final de la cocción, exprime el jugo de la mitad naranja restante sobre el pavo. Regrese el pavo al horno, sin tapar, para que la piel quede crujiente.", "Transfiera la corona de pavo a un plato de servir y déjelo reposar cubierto con papel de aluminio durante 30 minutos. Reserve los jugos de carne que quedan en la bandeja de asar.", "Para la salsa, vierta los jugos de la bandeja de tostado en una jarra y deje que se asienten. Elimine todo menos 4 cucharadas de grasa de la parte superior, luego incline la salsa restante en una cacerola y caliéntela a fuego medio hasta que la salsa hierva a fuego lento.", "Batir la harina hasta que la mezcla esté suave y bien combinada, luego verter en el puerto y el caldo y batir de nuevo hasta que quede suave. Continúe cocinando a fuego lento la salsa hasta que empiece a espesar, luego agregue unas gotas de salsa Worcestershire y la salsa de soja.", "Llevar la salsa a ebullición, agregando los jugos restantes de pavo liberados mientras la carne estaba en reposo. Sazonar, al gusto, con sal y pimienta negra recién molida, luego decantar en una jarra de servir caliente y servir con el pavo."], "url": "www_bbc_co_uk_food_recipes_turkey_crown_with_orange_47645", "title": "Corona de pavo con naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_crown_with_orange_47645_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 tomates, sin semillas, picados", "½ pepino, desollado, sin semillas, picado", "1 cebolla roja grande, finamente picada", "1 chile verde, sin semillas, finamente picado", "1 cucharada de mejorana picada", "2 cucharadas de perejil picado", "3 cucharadas de aceite de oliva", "1 limón, solo jugo", "sal y pimienta", "1 pechuga de pavo (aproximadamente 2kg / 4lb 8oz), sin piel", "1 cucharada de aceite, más extra para freír los panqueques", "25g / 1oz de mantequilla", "sal y pimienta", "2 huevos de gallinas camperas", "Harina natural 170g / 6oz", "425 ml / ¾ pinta de leche", "1 cucharada de perejil fresco picado", "50g / 2oz de mantequilla, derretida", "1 chalote, finamente picado", "Setas botón de 340g / 11¾oz, muy finamente picadas", "450 g / 1 libra de hojaldre", "2 huevos de gallinas camperas, batidos, para lavar huevos"], "method": ["Para la salsa, mezcle todos los ingredientes y déjelos reposar durante dos horas.", "Para el pavo en croute, doble la parte delgada de la pechuga de pavo debajo y átela con la cuerda del cocinero para hacer una forma pareja.", "Caliente una cucharada de aceite y mantequilla en una sartén grande. Cuando esté caliente, agregue el pavo y fría para sellar y colorear la carne por todos lados.", "Sazonar con sal y pimienta y dejar enfriar. Cuando esté frío, quita la cuerda.", "Haga los panqueques mezclando los huevos y la harina en un tazón. Agregue lentamente la leche, batiendo todo el tiempo hasta que quede suave. Agregue el perejil picado y la mitad de la mantequilla derretida. Condimentar con sal y pimienta.", "Caliente un poco de aceite en una sartén grande (aproximadamente 25 cm). Cuando esté caliente, agregue un cucharón de masa de panqueque y de inmediato comience a girar alrededor de la sartén para obtener una buena capa uniforme. Cocine el panqueque por aproximadamente 30-40 segundos. Use una espátula para levantar la tortita con cuidado para mirar la parte inferior y verifique que esté dorada antes de dar la vuelta. Cocine el otro lado durante aproximadamente 30-40 segundos y transfiéralo a un plato. Repita hasta que se haya usado toda la masa.", "Agregue la mantequilla derretida restante a una sartén. Suavemente fríe los chalotes picados sin colorear. Agregue los champiñones y cocine lentamente hasta que toda la humedad se haya evaporado. Sazonar y reservar para enfriar.", "En una superficie de trabajo ligeramente enharinada, extienda la masa de hojaldre en un rectángulo, al menos tres veces más ancho que el pavo y 15 cm / 6 pulgadas más. La masa debe tener un grosor de aproximadamente 3 mm.", "Cepille la colada de huevo alrededor de los bordes de la masa.", "Coloque los panqueques en una superficie de trabajo para que se superpongan y formen una sábana. Unte un poco de la mezcla de chalote y champiñones por el medio y coloque el pechuga de pavo encima. Unte el pavo con la mezcla restante de chalote y champiñones.", "Dibuja los panqueques sobre el pavo para envolverlos como un paquete. Coloque el paquete de pavo en la masa de hojaldre, luego tire de la masa y selle con un lavado de huevos. Dale la vuelta a una bandeja de asar (para que las costuras de los pasteles estén escondidas) y haz una pequeña incisión en la masa para permitir que salga el vapor.", "Cepille con un lavado de huevos y descanse durante 30 minutos en la nevera. Luego retírelo de la nevera y déjelo a temperatura ambiente antes de cocinarlo. Precalentar el horno a 220C / 425F / Gas 7.", "Cepille la masa nuevamente con un lavado de huevo y hornee durante 10 minutos.", "Reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y cocine por otros 50 minutos o hasta que la masa esté crujiente y dorada.", "Deje reposar por 15 minutos, luego corte y sirva con la salsa."], "url": "www_bbc_co_uk_food_recipes_turkey_en_croute_with_78858", "title": "Turquía 'en croute' con salsa de tomate y pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalote, picado", "4 cebolletas, picadas", "2 dientes de ajo, aplastados", "½ cucharadita de jengibre picado", "1 chile rojo, sin semillas y picado", "6 botones de champiñones, picados", "350g / 12oz de pavo picado", "2 cucharadas de salsa Worcestershire", "1 limón, ralladura finamente rallada solamente", "sal y pimienta", "2 cucharadas de aceite vegetal", "3 cucharadas de salsa de soja", "½ vaso de vino blanco seco", "150ml / ¼ pinta de caldo de pollo", "2 cucharadas de harina de maíz", "guión de aceite vegetal", "1 chile rojo, sin semillas, finamente picado", "1 diente de ajo, aplastado", "½ col verde pequeña, rallada"], "method": ["En una licuadora, combine la chalota, la cebolleta, el ajo, el jengibre, el chile y los champiñones. Pulse para formar un puré suave y luego transfiéralo a un tazón. Agregue el pavo, la salsa Worcestershire y la ralladura de limón, y mezcle bien. Condimentar con sal y pimienta.", "Calentar un poco de aceite vegetal en una sartén grande o wok y cocinar una pequeña cantidad de la mezcla de pavo. Pruebe verificar el condimento y ajuste según sea necesario.", "Enrolla la mezcla restante en 28 bolas de tamaño uniforme y freír en aceite vegetal hasta que se dore por todas partes. Cocine por otros 2-3 minutos, luego retírelo de la sartén y manténgalo caliente.", "Para el repollo, mezcle la salsa de soja, el vino blanco, el caldo y la harina de maíz hasta que quede suave.", "Agregue el chile y el ajo a una sartén con una pizca de aceite vegetal y fría rápidamente a fuego alto. Agregue el repollo y cocine por dos minutos. Agregue las bolas de pavo y cocine por 30 segundos.", "Vierta la mezcla de harina de maíz, hierva y cocine durante dos minutos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_turkey_dumplings_with_21880", "title": "Albóndigas de pavo con repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 gambas grandes, peladas y desveladas", "2 cucharadas de condimento cajún", "2 cucharadas de aceite de oliva", "Pavo sobrante de 400g / 14oz, tirado en trozos", "Chorizo ​​200g / 7oz, o restos de chipolatas, despellejados y cortados en rondas", "2 cebollas, finamente picadas", "2 pimientos verdes, aproximadamente en cubitos", "2 palitos de apio, cortados en cubitos", "4 dientes de ajo, finamente picados", "2 hojas de laurel", "4 tomates frescos, pelados y picados, o 200g / 7oz de tomates picados", "Arroz de grano largo de 400 g / 14 oz, bien enjuagado de almidón (no es fácil ni rápido)", "1 litro / 1¾ pinta de caldo de pavo", "sal y pimienta negra recién molida", "Rodajas de limón", "salsa picante, al gusto", "2 cucharadas de perejil finamente picado", "1 cucharada de hoja de apio finamente picada (opcional), que se encuentra en el centro de un corazón de apio"], "method": ["Coloque las gambas en un recipiente y espolvoree una cucharada de condimento de Cajun. Frote bien para que estén completamente cubiertos. Caliente una cucharada de aceite de oliva en una sartén y agregue el pavo. Espolvorea sobre el condimento Cajun restante y freír brevemente. Sáquelo del fuego y apártelo.", "Calentar otra cucharada de aceite de oliva en una cazuela grande. Agregue la salchicha y fría hasta que estén crujientes y doradas. Retire de la cazuela y agregue las cebollas, los pimientos y el apio. Cocine a fuego medio hasta que se ablanden y comience a caramelizar alrededor de los bordes, luego agregue el ajo y cocine por otro minuto.", "Agregue la hoja de laurel y los tomates. Espolvorea sobre el arroz, luego vierte sobre el caldo. Regrese la salchicha a la cazuela y sazone con sal y pimienta. Cubra y cocine a fuego lento durante 15 minutos.", "Revuelva ligeramente el pavo cocido, luego coloque las gambas en la parte superior. Cubra de nuevo y cocine a fuego lento durante otros cinco minutos para que las gambas puedan cocer al vapor. Si crees que el arroz ya está cocido, apaga el fuego y déjalo reposar; las gambas seguirán cocinando con el vapor residual.", "Sirva con rodajas de limón, salsa picante y una buena pizca de perejil y hojas de apio si le gusta."], "url": "www_bbc_co_uk_food_recipes_turkey_jambalaya_96737", "title": "Turquía jambalaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_jambalaya_96737_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para freír", "1 cebolla grande, picada", "2 zanahorias grandes, cortadas en rombos", "2 puerros grandes, cortados en trozos de 2cm / ¾en piezas, lavados", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl oz de caldo de pollo o pavo", "500 g / 1 libra de pavo cocido de 2 onzas, cortado en trozos pequeños", "200 g / 7oz de jamón cocido, cortado en trozos pequeños", "10 setas de botón", "pizca de cayena", "2 cucharadas de estragón picado", "hojas de tomillo", "sal marina y pimienta negra recién molida", "225 g / 8 oz de hojaldre congelado, descongelado", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de queso parmesano, finamente rallado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Caliente una sartén grande a fuego medio. Agregue un poco de mantequilla y cocine suavemente la cebolla hasta que esté suave pero no dorada. Agregue las zanahorias y el puerro y continúe cocinando durante cinco minutos hasta que las zanahorias comiencen a ablandarse. Cubra con la crema y el caldo y cocine a fuego lento hasta que la salsa comience a espesar. Agregue el pavo, el jamón, los champiñones, la cayena y las hierbas, sazone al gusto con sal y pimienta negra recién molida y retire la sartén del fuego.", "Vierta el relleno en un plato de pastel de cerámica. Estirar la masa para hacer una tapa para el pastel y tiras para revestir el borde del plato. Presione las tiras sobre el borde, humedeciéndolas con un poco de agua, luego presione la tapa firmemente y cepille con el huevo batido. Espolvoree con el parmesano y cocine en el horno durante 20 minutos hasta que la masa esté dorada."], "url": "www_bbc_co_uk_food_recipes_turkey_leek_and_ham_pie_79037", "title": "Pastel de pavo, puerro y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_leek_and_ham_pie_79037_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "125g / 4½oz de mantequilla, refrigerada y en cubos", "75 g / 2½ oz de manteca de cerdo, refrigerada y cortada en cubitos", "pizca de sal", "agua con hielo", "1 huevo de gallinas camperas, golpeado", "15g / ½ oz de mantequilla", "3 puerros, en rodajas gruesas", "sal y pimienta negra recién molida", "100ml / 3½fl oz de vino blanco", "500g / 1lb 2 oz de carne de pavo cocida, cortada en cubitos", "200 g / 7 oz de jamón cocido, cortado en cubitos", "Relleno de 200g / 7oz, roto", "50g / 1¾oz de mantequilla", "50g / 1¾oz de harina natural", "400ml / 14fl oz de pavo o caldo de pollo", "200ml / 7fl oz de leche entera", "100 ml / 3½ fl oz de crema individual", "pocas hojas de estragón, finamente picadas"], "method": ["Primero haz la masa. Frote la harina, la mantequilla y la manteca de cerdo juntas hasta que se asemeje a migas de pan finas y agregue una buena pizca de sal.", "Agregue suficiente agua helada para unir la masa sin que se desmorone demasiado, luego forme una bola, envuélvala en una película adhesiva y déjela enfriar en la nevera.", "Para hacer el relleno, caliente la mantequilla en una cazuela y agregue los puerros. Sazonar con sal y pimienta y agregar el vino. Cubra y deje a fuego lento hasta que los puerros estén tiernos, luego retire los puerros con una cuchara ranurada y reserve cualquier líquido.", "Para la salsa, derrita la mantequilla en una olla aparte y agregue la harina. Revuelva hasta que tenga un roux grueso, luego agregue gradualmente el caldo, la leche y la crema, revolviendo a fondo con cada adición para hacer una bechamel cremosa. Agregue el líquido reservado de cocinar los puerros.", "Agregue el pavo, el jamón, el relleno y los puerros a la bechamel y revuelva muy suavemente para combinar, tenga cuidado ya que no quiere que la carne o los puerros se rompan. Deje que se enfríe completamente.", "Precaliente el horno a 200C / 180C Fan / Gas 6 y coloque una bandeja para hornear en el horno para calentar.", "Para armar el pastel, toma dos tercios del pastel. Extiéndalo para alinear un plato para pastel grande - alrededor de 25 cm de diámetro. Agregue el relleno: encontrará que va a llenar el plato de pastel y le dará una parte superior ligeramente abovedada.", "Estirar los pasteles restantes. Cepille los bordes de la pieza inferior de masa con huevo batido, luego coloque sobre la pieza superior. Recorta los bordes y engarce juntos. Usa los adornos para hacer cualquier decoración que te guste, luego cepilla todo con un lavado de huevos. Corta dos pequeños agujeros en el centro de la corteza.", "Hornee en el horno durante 35-40 minutos o hasta que el pastel tenga un color dorado intenso y el relleno esté bien caliente."], "url": "www_bbc_co_uk_food_recipes_turkey_ham_and_stuffing_59799", "title": "Pavo, jamón y pastel de relleno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharaditas de aceite de oliva o aceite de girasol", "1 cebolla, finamente picada", "sal marina y pimienta negra recién molida", "2 dientes de ajo, finamente picados", "1 cucharadita de pimentón ahumado (variedad dulce o caliente, al gusto)", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "400 g / 14 oz de carne picada de pavo", "½ manojo de cilantro fresco, solo hojas, finamente picado", "2 tomates maduros, sin semillas, picados", "2 cebollas tiernas cortadas en diagonal", "1 aguacate, pelado, removido de piedra, picado", "1 lima, jugo y ralladura solamente", "½ manojo de cilantro fresco, solo hojas, finamente picado", "1 chile verde, finamente picado", "rociar aceite de oliva", "rodajas de limón", "Hojas de lechuga"], "method": ["Calienta la mitad del aceite en una sartén pequeña a fuego medio. Agregue la cebolla y una pizca de sal y cocine por cinco minutos, o hasta que se ablanden. Agregue el ajo y las especias y cocine por otros dos minutos. Retirar del fuego, verter en un recipiente y dejar enfriar.", "Mientras tanto, para la salsa, combine los tomates, las cebolletas, el aguacate, la lima y el cilantro en un tazón. Mezcle la mitad de la guindilla, pruebe y agregue más chile si es necesario. Agregue un chorrito de aceite de oliva y sazone al gusto con pimienta, luego reserve.", "Una vez que la mezcla de cebolla se haya enfriado, agregue el pavo y el cilantro y mezcle bien. Con las manos mojadas, dé forma a la mezcla en 16 bolas del tamaño de una pelota de golf y luego transfiérala a una bandeja para hornear y cubra con una película adhesiva.", "Refrigere por 15-30 minutos; esto ayudará a que las albóndigas se afirmen y evitará que se caigan a pedazos durante la cocción.", "Precaliente el horno a 200C / 400F / Gas 6. Caliente el aceite restante en una sartén grande y antiadherente y fríe las albóndigas durante 2-3 minutos, volteándolas de vez en cuando, hasta que se doren por todos lados. Es posible que deba hacer esto en lotes para evitar la sobrepoblación de la sartén.", "Transfiera las albóndigas a una bandeja de horno limpia y cocine en el horno durante 10-12 minutos, o hasta que estén bien cocidas. Deje reposar unos minutos antes de servir con la salsa, las rodajas de lima y las hojas de lechuga."], "url": "www_bbc_co_uk_food_recipes_turkey_meatballs_26601", "title": "Albóndigas de pavo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_meatballs_26601_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, pelada", "1 palo de apio", "2 cucharadas de aceite de ajo", "1 cucharadita de tomillo seco", "2 x 400 g / 14 onzas de latas de tomate picado, más aproximadamente 2 latas de agua llenas", "1 cucharadita de azúcar", "1 cucharadita de copos de sal marina o ½ cucharadita de sal", "pimienta negra, al gusto", "500 g / 1lb 2 oz de pavo picada", "1 huevo de gallinas camperas", "3 cucharadas de pan rallado", "3 cucharadas de queso parmesano rallado", "1 cucharadita de salsa Worcestershire", "½ cucharadita de tomillo seco"], "method": ["Para la salsa, coloque la cebolla y el apio en un procesador de alimentos y rellene una papilla. (O puede cortar lo más finamente posible a mano). Reserve 2 cucharadas de la mezcla para las albóndigas.", "Caliente el aceite de ajo en una cacerola o cazuela grande de base pesada, agregue la mezcla de cebolla y apio, junto con el tomillo, y cocine a fuego moderado a bajo, revolviendo de vez en cuando, durante aproximadamente 10 minutos.", "Agregue las latas de tomates de ciruela, llenando cada lata vacía con agua para agregar a la sartén. Sazone con el azúcar, sal y pimienta, revuelva bien y deje que la mezcla se convierta en una burbuja, luego baje la temperatura y cocine a fuego lento la salsa suavemente mientras se lleva las albóndigas.", "Para las albóndigas, coloque todos los ingredientes de las albóndigas, incluida la cebolla y el apio picados reservados, y la sal según sus preferencias, en un tazón grande y mezcle suavemente con las manos. No mezcle demasiado, ya que eso hará que las albóndigas sean de textura densa y pesadas.", "Cuando todos los ingredientes de la albóndiga no se fusionen demasiado oficiosamente, empiece a hacer bolas. La manera más fácil es extraer una cantidad equivalente al tamaño de una cucharilla generosamente apilada y enrollarla en forma de bola entre las palmas de sus manos. Coloque cada albóndiga en una bandeja para hornear forrada con pergamino para hornear o papel resistente a la grasa. Deberías obtener unas 50 albóndigas.", "Coloque las albóndigas suavemente en la salsa hirviendo a fuego lento; Intento dejar que estos caigan en círculos concéntricos trabajando alrededor de la sartén desde el borde exterior hacia adentro, en la más vaga de las modas.", "Deje que las albóndigas hiervan a fuego lento en la salsa durante 30 minutos, o hasta que estén cocidas. Sirve con arroz, pasta, cuscús o como quieras."], "url": "www_bbc_co_uk_food_recipes_turkey_meatballs_in_16570", "title": "Albóndigas de pavo en salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_meatballs_in_16570_16x9.jpg", "isVegetarian": false, "recommendations": 0}]