[{"ingredients": ["2 rebanadas de pan de centeno", "1 tomate", "50g / 2oz de jamón curado", "2 cucharaditas de aceite", "2 huevos", "1 pepinillo encurtido grande"], "method": ["Toma el pan de centeno y colócalo en un plato.", "Rebane el tomate, colóquelo en el pan de centeno.", "Toma el jamón y colócalo sobre el tomate.", "Precalienta la sartén con el aceite - asegúrate de que la sartén no esté demasiado caliente, rompe los huevos en la sartén y freír hasta que estén cocidos.", "Retire los huevos, coloque encima del jamón y sirva con el pepinillo."], "url": "www_bbc_co_uk_food_recipes_breakfaststack_72030", "title": "Pila de desayuno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 patata pequeña, pelada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "15g / ½ oz de mantequilla", "2 huevos de gallinas camperas, fritos", "1 cucharada de cebolletas frescas picadas, para adornar"], "method": ["Rallar la papa en una toalla de té limpia sobre un recipiente y exprimir el exceso de líquido. Sazone la papa rallada con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén pequeña. Coloque la papa rallada en la sartén, presione hacia abajo y fríe durante 3-4 minutos. Empuja la mitad de la mantequilla por los bordes del rösti para hacer crujientes los bordes.", "Con cuidado, gire el rösti sobre el uso de una rebanada de pescado y cocine por 2-3 minutos más, o hasta que comience a dorarse. Empuja la mantequilla restante por los bordes del rösti y cocina durante un minuto más.", "Para servir, coloque el rösti en un plato, cubra con dos huevos fritos y espolvoree sobre las cebolletas."], "url": "www_bbc_co_uk_food_recipes_breakfastrosti_85073", "title": "El desayuno habla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pechuga de cordero deshuesada", "2 cucharadas de romero picado", "sal y pimienta", "Aceite para freír", "2 chalotes de plátano, en rodajas", "75g / 2½ oz de champiñones, en rodajas", "150ml / 5fl oz de vino tinto", "568ml / 1 pinta de caldo de pollo", "harina común, para quitar el polvo", "75 g / 2½ oz de mantequilla", "2 tallos de brócoli, en cuartos", "pizca de sal", "6 anchoas saladas, picadas", "2 cucharadas de alcaparras superfinas, escurridas", "2 cucharadas de vinagre de cabernet sauvignon", "6 cucharadas de aceite de oliva virgen extra", "1 cucharada de menta picada", "1 cucharada de perejil picado", "1 cucharada de estragón picado", "1 chile rojo, finamente picado", "hojas de apio picadas"], "method": ["Precaliente el horno a 140C / 280F / Gas 1. Extienda la pechuga de cordero a lo largo y califíquela con un cuchillo afilado. Frote en el romero picado y sazone con sal y pimienta. Cortar por la mitad en dos piezas iguales. Ruede cada mitad apretadamente como un rollo suizo y ata con una cuerda.", "En una cazuela, caliente el aceite. Agregue los chalotes a la sartén. Cocine hasta que esté caramelizado. Agregue los champiñones y luego el vino y el caldo. Llevar a ebullición y luego baje a fuego lento.", "Calentar un poco más de aceite en otra sartén y freír los rollos de cordero para dorar por todas partes, luego agregarlos al caldo. Coloque una tapa en la parte superior y colóquela en el horno precalentado para cocinar durante tres horas. Retire del horno, transfiera a un recipiente limpio y deje enfriar a temperatura ambiente. Saca el cordero y retira cuidadosamente el cordel.", "Haga rodar el cordero muy apretado en una película adhesiva para mantener su forma. Póngalos en la nevera para enfriar durante ocho horas. Pase la salsa a través de un colador fino en una cacerola y cocine a fuego medio para reducir el caldo hasta obtener una consistencia de salsa. Guárdelo en la nevera hasta que lo necesite.", "Cuando esté listo para servir, quite la película adhesiva del cordero y corte los discos y el polvo en un poco de harina. Calentar un poco de aceite en una sartén y freír hasta que esté crujiente y dorar por todos lados.", "Para el brócoli, en una sartén grande, traiga 150 ml / 5 fl oz de agua y la mantequilla hasta que hierva y agregue los tallos de brócoli. Sazonar con sal y cocinar hasta que esté tierno. El agua y la mantequilla deben emulsionarse para obtener un delicioso glaseado.", "Mezcle todos los ingredientes del aderezo en un tazón y déjelo a un lado. Vuelva a calentar la salsa de cordero y sirva los discos de cordero con el brócoli y el aderezo al costado."], "url": "www_bbc_co_uk_food_recipes_breast_of_lamb_with_53662", "title": "Maíz de cordero con brócoli, anchoa y salsa de alcaparras", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breast_of_lamb_with_53662_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1.35kg / 3 lb pieza de pechuga de cordero", "2 zanahorias", "2 cebollas", "1 ramita de tomillo", "280 ml / ½ de stock de pollo picado", "1 cucharada de salsa Worcestershire", "1 vaso de vino blanco", "sal y pimienta negra recién molida", "Harina sasonada", "1 cucharada de mostaza Dijon", "2 huevos de gallinas camperas", "Pan rallado blanco fresco de 340g / 12oz", "1 manojo de menta fresca picada", "aceite vegetal, para freír", "Mayonesa de 280 ml / ½ pinta", "Alcaparras picadas de 60g / 2oz", "85g / 3oz de pepinillos picados", "2 cucharadas de perejil fresco picado", "medio limón, solo jugo"], "method": ["Precalentar el horno a 160C / 320F / Gas Mark 2.", "Coloque el trozo de cordero en un plato resistente al horno que tenga una tapa ajustada.", "Corta las zanahorias en cuartos a la mitad y corta las cebollas en cuartos. Ponlo en el plato con el cordero.", "Agregue el tomillo, caldo de pollo, salsa Worcestershire y vino.", "Sazonar y cubrir el plato con su tapa. Transfiera al horno y cocine por alrededor de tres horas, hilvanando cada 30 minutos y volteando la carne regularmente. La carne debe estar completamente tierna cuando esté bien cocida.", "Retire del horno y deje reposar. Después de 15 minutos, retire la carne del caldo. Empuja los huesos y descarta.", "Envuelva sin apretar la carne en una película adhesiva y colóquela entre dos tablas de cortar pesadas. Coloque en la nevera y déjelas durante unas horas o preferiblemente durante la noche.", "Retire la carne de la película adhesiva y corte en tiras.", "En un tazón limpio, bata ligeramente los huevos con la mostaza. En un recipiente aparte, coloque la harina sazonada. En otro tazón mezcle las migas de pan junto con la menta.", "Sumerja las tiras de cordero en la harina sazonada y luego en la mezcla de mostaza y huevo y finalmente en las migas de pan.", "Haga rodar cada tira con cuidado en sus manos para asegurarse de que las migas de pan estén bien pegadas.", "En una olla de fondo grueso, caliente suficiente aceite vegetal para freír (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír las tiras hasta que estén crujientes y doradas. Retire con una espumadera y escurra sobre la toalla de cocina.", "Para la salsa tártara (si se usa), mezcle todos los ingredientes.", "Sirva las tiras de cordero crujientes calientes con la salsa tártara (si se usa)."], "url": "www_bbc_co_uk_food_recipes_breastoflambwithtart_79286", "title": "Pechuga de cordero con salsa tártara", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,6 kg / 3lb 8 oz de pechuga de cordero, deshuesada, enrollada y atada con cuerda de cocina", "sal fina y pimienta blanca recién molida", "2 cucharadas de goteo o aceite vegetal", "1,6 kg / 3 lb cebollas de 8 oz, en rodajas finas", "1 hoja de laurel", "1 cucharada de vinagre de vino tinto", "2-3 cucharadas de esencia de anchoas (o varias anchoas picadas finamente), o al gusto", "2 cucharadas de perejil fresco picado"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Sazonar el cordero con sal y pimienta blanca recién molida. Derrita el goteo o el aceite en una cazuela grande con tapa y espaciosa hasta que esté caliente. Coloque la pechuga de cordero en la cazuela, baje el fuego y coloree bien por todos lados, hasta que se dore. Levante la carne y retire toda la grasa del plato con una cuchara.", "Agregue la mitad de las cebollas para hacer un lecho de cebollas sobre el cual descansar el cordero y agregue el cordero nuevamente al plato. Meta la hoja de laurel y cubra con las cebollas restantes.", "Corta un círculo de papel resistente a la grasa un poco más grande que el diámetro del plato. Humedezca, engrase ligeramente un lado y presiónelo sobre las cebollas (con el lado engrasado hacia abajo). Coloque la tapa cocine en el horno durante aproximadamente tres horas. Después de una hora, retire el plato para ver si la mezcla de cebolla se ha reducido y para verificar que los jugos naturales estén en funcionamiento. Raspe el lado del plato si las cebollas se han pegado. Vuelva a colocar el papel y la tapa y coloque el plato en el horno de nuevo.", "Después de aproximadamente tres horas de cocción (verifique después de otra hora), inserte un pincho en el cordero para ver qué tan tierno es; debería haber poca resistencia. Levante la carne, colóquela en una lata pequeña para asar y cubra con papel de aluminio. Baje el horno a 140C / 275F / Gas 1, y devuelva la carne al horno mientras termina las cebollas.", "Retire la hoja de laurel de las cebollas y drene las cebollas, reservando los jugos de cocción. Vuelve a colocar las cebollas en la cazuela. Elimine cualquier grasa que se haya asentado en la superficie de los jugos de cocción. Vierta nuevamente el líquido con las cebollas y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Agregue la esencia de vinagre y anchoa.", "Sazonar las cebollas al gusto con sal y pimienta negra recién molida. Finalmente, agregue el perejil.", "Retire el cordero del horno (si ha emanado jugo de carne del cordero en reposo, agréguelos a las cebollas), corte las cuerdas y corte la carne gruesamente. Coloque las rebanadas en un plato caliente y apile las cebollas al lado."], "url": "www_bbc_co_uk_food_recipes_breast_of_lamb_baked_80591", "title": "Pechuga de cordero al horno con cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breast_of_lamb_baked_80591_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pecho de cerceta", "rociar aceite de oliva", "sal y pimienta negra recién molida", "1 carcasa verde azulado", "1 cubo de caldo de carne", "75ml / 2½fl oz de vino tinto", "1 diente de ajo", "1 cucharadita de vinagre de vino blanco", "1-2 cucharadas de agua hirviendo", "15 g / ½ onza de mantequilla", "1 camote pequeño, pelado y picado", "25g / 1oz de mantequilla", "2 cucharaditas de salsa de soja", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la pechuga de teja, cubra la pechuga de teal con un poco de aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén pequeña a prueba de horno y agregue la pechuga de teal. Cocine por 2-3 minutos en cada lado y luego transfiera la sartén al horno. Cocine la pechuga en el horno durante ocho minutos o hasta que esté cocida. Retire del horno y deje reposar por dos minutos.", "Para el jus del juego, coloca los huesos de trullo y el cadáver en una olla pequeña con el resto de los ingredientes jus del juego, excepto la mantequilla. Calentar la cacerola a fuego alto y hervir durante diez minutos, agregando un poco más de agua hirviendo si la mezcla se vuelve demasiado espesa y seca.", "Agregue la mantequilla al jus del juego y mezcle bien. Una vez que la mantequilla se haya derretido, cuela la mezcla en una salsera.", "Para el puré de batata, coloque la batata en una olla pequeña llena de agua hirviendo y cocine durante diez minutos, o hasta que la papa se haya vuelto suave.", "Escurra el exceso de agua de las batatas y agregue la mantequilla, la salsa de soja y la pimienta negra y haga un puré con un mezclador de papas, hasta que la mezcla se suavice.", "Para servir, coloca el puré en un plato limpio. Corta la pechuga de liana y colócala en la parte superior del puré. Vierta el jus del juego sobre la parte superior de la pechuga de trullo."], "url": "www_bbc_co_uk_food_recipes_breastoftealwithswee_84611", "title": "Pechuga de trullo con puré de batata y juego jus", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 rebanadas de pan", "2 cucharadas de aceite de oliva virgen extra", "4 cucharadas de aceite de oliva virgen extra", "2 cucharadas de vinagre de vino blanco", "sal y pimienta negra recién molida", "1 diente de ajo, dejado entero y perforado con un cuchillo", "2 pequeñas gemas de lechuga, hojas separadas", "pequeño puñado de cohetes salvajes", "100g / 3½ oz de rábanos, en rodajas", "20 aceitunas negras", "2 huevos de gallinas camperas, hervidos y descuartizados", "Bresaola de 80 g / 3 oz, en rodajas finas", "2 cucharadas de parmesano fresco finamente afeitado, para servir"], "method": ["Retire las cortezas del pan y corte en pequeños triángulos. Calentar el aceite en una sartén, agregar el pan y freír en ambos lados hasta que estén dorados. Retire de la sartén y escurra sobre papel de cocina.", "Mientras tanto, haz el vendaje. Combine todos los ingredientes del aderezo y mezcle con un tenedor hasta obtener una consistencia cremosa. Retire el diente de ajo del aderezo.", "Coloque las hojas de lechuga, rúcula, rábanos y aceitunas en un plato para servir, vierta sobre el aderezo y mezcle bien. Coloque los huevos, bresaola y pan frito en el plato y esparza sobre las virutas de parmesano."], "url": "www_bbc_co_uk_food_recipes_bresaola_salad_04379", "title": "Ensalada Bresaola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bresaola_salad_04379_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina fuerte", "1 cucharadita de sal", "25 g / 1 oz de azúcar en polvo", "5 g de levadura instantánea", "70 ml / 2½ fl oz de leche", "3 huevos medianos de granja", "125g / 4½oz de mantequilla sin sal, ablandada", "280 g / 9½ oz de jamón", "3 cucharadas de salsa de arándanos", "1 brie grande (aproximadamente 750 g / 1 libra 10 onzas), cortado en rodajas", "1 huevo de gallinas camperas, batido, para glasear"], "method": ["Coloque la harina en el tazón de un mezclador de alimentos equipado con un gancho de masa. Agregue la sal y el azúcar a un lado y la levadura al otro. Agregue la leche y los huevos y mezcle a baja velocidad durante dos minutos. Aumente la velocidad y mezcle por 6-8 minutos más. La masa debe ser brillante y elástica.", "Agregue la mantequilla ablandada y continúe mezclando durante cinco minutos, raspando el recipiente periódicamente para asegurarse de que la mantequilla esté completamente incorporada. La masa será muy suave en esta etapa.", "Coloque la masa en un recipiente, cubra y enfríe toda la noche para permitir que la masa se endurezca.", "Cuando esté listo para armar el pastel, precaliente el horno a 200C / 400F / Gas 6.", "Incline la masa sobre una superficie ligeramente enharinada y dóblela unas cuantas veces para quitar el aire. Haga rodar la masa hasta 5 mm / ¼ de grosor y en un círculo grande. Coloque la mitad del jamón en la base. Extiende la salsa de arándanos sobre la parte superior. Coloque el brie en la parte superior de la salsa de arándano. Use el jamón restante para cubrir el brie.", "Estire la masa sobre el jamón para cubrir el brie y selle los bordes.", "Voltee su paquete brie y colóquelo en una bandeja para hornear. Esmaltar la masa con el huevo batido. Usando la parte posterior de un cuchillo, anota un patrón entrecruzado sobre el paquete.", "Hornee durante 20-25 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_brie_brioche_pie_75406", "title": "Brie brioche pie", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Brie de 75 g / 2½ oz", "1 cucharadita de hojas frescas de tomillo", "¼ pera, sin corazón, en rodajas", "dash aceite de oliva", "sal y pimienta negra recién molida", "15g / ½ oz de mantequilla", "½ pera, sin corazón, picada", "1 cucharada de azúcar en polvo", "2 cucharaditas de vinagre de vino blanco", "pizca de copos de chile", "dash aceite de oliva", "pan, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase un trozo de papel de aluminio de 20 cm / 8 pulgadas x 20 cm / 8 pulgadas o pergamino para hornear. Coloque el Brie en el medio del papel de aluminio o pergamino, agregue el tomillo, la pera y un poco de aceite de oliva y sazone con sal y pimienta negra recién molida.", "Selle la lámina o el pergamino en los bordes para hacer una bolsa que contenga los ingredientes. Coloque en una bandeja para hornear, transfiéralo al horno y hornee por 6-7 minutos.", "Para el aderezo de pera y chile picante, derrita la mantequilla en una cacerola pequeña, agregue la pera picada y cocine por 2-3 minutos. Agregue el azúcar, el vinagre, las hojuelas de chile y el aceite de oliva y cocine durante 1-2 minutos más.", "Para servir, coloque el paquete Brie en un plato para servir, ábralo y vierta sobre el aderezo. Sirva con pan para sumergirlo en el queso caliente."], "url": "www_bbc_co_uk_food_recipes_brieenpapillotewiths_84990", "title": "Brie en papillote con salsa picante de pera y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "25g / 1oz de tomates enrojecidos por el sol", "Brie 50g / 2oz", "2 rebanadas de jamón de mota", "salpicaduras de aceite vegetal", "1 cucharadita de orégano", "pizca de curry en polvo", "pizca de cúrcuma", "1 cucharada de aceite de oliva", "200 g / 8 oz de calabaza, peladas y cortadas en chips", "2 cucharadas de cebolla roja, finamente cortada", "50ml / 2fl oz de vino tinto", "50ml / 2fl oz de caldo de carne", "25 g / 1oz de mantequilla sin sal"], "method": ["Precalentar el horno a 225C / 425F / Gas 7.", "Para el pollo, con un cuchillo afilado, corte con cuidado en el lado de la pechuga de pollo para crear un bolsillo. Rellene el bolsillo con el Brie y los tomates. Presione hacia abajo para sellar el relleno dentro.", "Envuelva la pechuga de pollo rellena con las rodajas de mota.", "Coloque un chorrito de aceite en una sartén a prueba de horno a fuego alto. Coloque la pechuga de pollo envuelta en mota en la sartén y cocine el pollo por un minuto en cada lado, para dorar. Transfiera al horno para asar durante 15-20 minutos, o hasta que esté cocido.", "Para las rodajas de calabaza, coloca el orégano, la cúrcuma, el polvo de curry y el aceite en un tazón grande. Agregue la calabaza y mezcle bien para cubrir. Coloque en una bandeja de asar y coloque en el horno para asar durante 15 minutos, o hasta que esté bien cocido. Gire la calabaza de vez en cuando, para que se dore uniformemente.", "Para la salsa, coloque la cebolla roja en una cacerola a fuego alto. Agregue el vino tinto y el caldo de carne y deje que hierva. Reduzca el fuego a fuego lento y cocine hasta que el líquido se haya reducido a la mitad.", "Agregue la mantequilla a la salsa y quite del fuego. Revuelva la mantequilla en la salsa para darle un acabado brillante.", "Para servir, coloque el pollo en un plato con una pila de trozos de calabaza y rocíe la salsa alrededor."], "url": "www_bbc_co_uk_food_recipes_briestuffedchickenwi_79901", "title": "Pollo relleno de brie con cuñas de calabaza con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "25g / 1oz Brie, en rodajas", "4 hojas de albahaca fresca", "sal marina y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "½ papa dulce cocida, hervida hasta que esté cocida", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "25g / 1oz de anacardos sin sal, picados", "Mangetout 50g / 2oz, blanqueado", "1 cucharadita de aceite de oliva", "algunas hojas frescas de albahaca"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para el pollo, corte un bolsillo en el costado de la bestia con un cuchillo afilado y cosas con el Brie y la albahaca, y sazone con sal marina y pimienta negra recién molida.", "Caliente el aceite en una sartén a prueba de horno a fuego alto. Coloque la pechuga de pollo en la sartén y cocine por dos minutos, en cada lado, hasta que esté dorado.", "Coloque la sartén en el horno y tueste durante 15-20 minutos, o hasta que esté completamente cocida.", "Para la batata, coloque la papa cocida, el aceite y la mantequilla en un tazón y aplaste, luego doble los anacardos.", "Para servir, mezcle el mangetout con el aceite en un recipiente y colóquelo en un plato para servir. Coloque la pechuga de pollo y el puré de papa en el plato. Adorne con algunas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_briestuffedchickenwi_84023", "title": "Pollo relleno de brie con puré de camote crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de coco fresco de paimpol (frijoles Paimpol blancos franceses)", "1 litro / 1¾ pinta de caldo de pollo", "1 bouquet garni (tomillo, laurel, ajo, granos de pimienta negra envueltos con hilo de cocina)", "200g / 7oz palourde almejas", "75ml / 2½fl oz de vino blanco", "2 chalotes de plátano, finamente picados", "50g / 1¾oz dulse", "50 g / 1 oz de nubes", "50 g / 1¾oz de lechuga de mar", "150 g / 5½ oz de mantequilla", "1 porción x 180g-200g / 6-7oz de brill", "1 cucharada de alcaparras finas, escurridas y picadas", "5 ramitas de eneldo, picadas", "1 limón, solo jugo", "1 bulbo de hinojo, ½ corte en cubitos y ½ afeitado en una mandolina, mantenga las tapas de hinojo", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 220C / 450F / Gas 7.", "Cocine los frijoles durante 15-20 minutos en 1 litro / 1¾ litro de agua y el caldo de pollo con el bouquet garni. Cocine suavemente y no hierva; de lo contrario, los granos se romperán.", "Caliente una cacerola con tapa y cocine las almejas con el vino blanco y una de las chalotas, hasta que las almejas se abran, luego escurra en un colador, reservando el jugo. Elige la carne de las almejas y descarta las conchas.", "Cubra una pequeña cacerola de base pesada con los tres tipos de algas (reserve algunas piezas de dulse para la guarnición).", "Calentar una sartén con un poco de mantequilla y freír el pescado por un lado hasta que se dore. Dar la vuelta, sacar de la sartén y colocar en la sartén con las algas marinas.", "En la misma sartén caliente que solía freír el pescado, pon una cucharada de mantequilla de buen tamaño y la otra chalota finamente picada, las alcaparras, la mitad del eneldo picado, los jugos de almejas y unas gotas de jugo de limón. Llevar a ebullición y luego verter la mezcla sobre el pescado. Coloque la tapa sobre la sartén y cocine en el horno durante 5-6 minutos.", "Agregue las virutas de hinojo (reservando el hinojo cortado en cubitos), el eneldo picado restante y las tapas de hinojo si las tiene. Sazone con sal, jugo de limón y aceite de oliva y agregue la mitad de la dulse reservada. Dejar de lado.", "Coloque la mitad de los granos de coco en una licuadora y puré; termine con unas gotas de aceite de oliva, un poco de mantequilla (reservar unas perillas) y el jugo de limón. Escurra los granos de coco restantes, agregue el hinojo picado y un poco de dulse picado.", "Retire el pescado de la cazuela y reserve. Cuele los jugos de las algas y agregue un toque especial a los granos de coco. Vuelva a colocar los frijoles en el fuego y deje que hierva, agregue un par de perillas de mantequilla y revuelva hasta que los granos estén glaseados con mantequilla. Agregue la carne de almeja reservada. Pruebe y agregue algunas gotas más de jugo de limón si es necesario.", "Para servir, coloque una cucharada de puré de buen tamaño en el centro de cada plato, haga un pozo con la cuchara, coloque los frijoles encima con el pescado y una pequeña cantidad de ensalada de hinojo raspado."], "url": "www_bbc_co_uk_food_recipes_brill_baked_in_seaweed_42689", "title": "Brill horneado en algas marinas con almejas, hinojo y granos de cacao", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalote de plátano, finamente picado", "50g / 1¾oz de mantequilla", "8 almejas, enjuague con agua corriente fría", "½ diente de ajo, picado", "100ml / 3½fl oz de sidra", "1 brillo completo (alrededor de 2 kg / 4 lb 8 oz)", "25g / 1oz de guisantes recién preparados", "aceite vegetal, para freír", "10 girolles pequeños (también conocidos como champiñones)", "Crema doble 50ml / 2fl oz", "1 cucharada de crema fresca", "8 hojas de col rizada de mar", "4 cintas de calabacín, cortadas en tiras largas utilizando un pelador de verduras", "pizca de estragón recién picado", "eneldo y flores comestibles, para adornar", "sal y pimienta negra recién molida"], "method": ["Suavemente fríe una pizca de chalotes en un poco de mantequilla. Agregue las almejas, el ajo y la sidra, cubra y haga un poco de vapor. Una vez que las conchas de almeja estén abiertas, pase a través de un colador que reserva la reserva (deseche las almejas que no se abran).", "Filete el brill y luego quite la piel, parte en filetes de 140g / 5oz.", "Escalde los guisantes en agua hirviendo con sal durante 1-2 minutos, luego revuelva en agua fría y reserve.", "Caliente una sartén antiadherente a fuego lento. Agregue un poco de aceite vegetal, sal, pimienta y el pescado. Cocine lentamente hasta que se dore.", "Mientras tanto, agrega un pomo de mantequilla y una pizca de chalotes a una sartén por separado. Freír suavemente hasta que se ablanden, luego agregar los champiñones y cocinar por un minuto, pero no colorear. Agregue los jugos de cocción reservados de los berberechos y cocínelos hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema y la crème fraîche y brevemente vuelva a hervir. Reduce el calor al mínimo.", "El pez debe estar listo para dar la vuelta ahora, así que sazone el lado expuesto y dé la vuelta.", "Coloque los guisantes y los berberechos en la salsa para calentarlos.", "En una sartén o en una sartén grande, agregue 50 ml / 2 fl oz de agua y un pomo de mantequilla. Cuando la mantequilla se derrita, agregue la col rizada y los calabacines, más un poco de sal y pimienta. Revuelva freír durante 2 minutos o hasta que las verduras estén tiernas.", "Coloque el pescado cocinado en platos para servir y apile el calabacín y la col rizada al lado del mar. Poner el estragón en la salsa, probar para comprobar el condimento y agregar a los platos. Adorne con eneldo y flores comestibles."], "url": "www_bbc_co_uk_food_recipes_brill_fillet_with_clams_89947", "title": "Filete de solomillo con almejas cocinadas a la sidra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 patata Maris Piper", "2 x 180g / 6oz filetes brillantes sin hueso, sin piel", "2g de polen de hinojo", "sal marina y pimienta negra recién molida", "dash oil", "botón de mantequilla", "1 limón, solo jugo", "dash oil", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "250ml / 9fl oz de caldo de verduras", "250ml / 9fl oz de crema batida", "1 gran puñado de perejil de flatleaf, solo hojas", "3 tomates de herencia mixta, en rodajas", "rociar aceite extra virgen"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pescado, pele y cubra la patata con un cuento y póngalo en una espátula de fruta y verdura con una cuchilla fina. Use de acuerdo con las instrucciones del fabricante, girando el mango para crear hebras finas de papa.", "Sazone los filetes de pescado con polen de hinojo y sal y pimienta. Envuelva las hebras de patata prolijamente alrededor de las porciones de pescado.", "Caliente una sartén antiadherente a fuego medio, agregue un chorrito de aceite y un pomo de mantequilla y fría el pescado en ambos lados durante unos dos minutos o hasta que se dore. Cubra una bandeja para hornear con papel resistente a la grasa. Transfiera el pescado a la bandeja de horno forrada y cocine en el horno precalentado por otros seis minutos.", "Para la salsa, caliente una pizca de aceite en una cacerola y fría la chalota y el ajo hasta que se ablanden. Agregue el caldo y cocine hasta que el volumen se haya reducido a la mitad, agregue la crema y cocine hasta que se reduzca a la mitad nuevamente.", "Vierta la base de salsa en una licuadora o procesador de alimentos y mezcle con hojas de perejil a máxima potencia para lograr una salsa verde vibrante.", "Para los tomates coloque los tomates en una bandeja para hornear, sazone con sal y pimienta y rocíe con un poco de aceite virgen extra. Pop en el horno para calentar durante un minuto.", "Retire el pescado del horno y exprima un poco de jugo de limón. Coloque las rodajas de tomate en cada una de las dos placas para servir, coloque el pescado encima y rocíe alrededor de la salsa."], "url": "www_bbc_co_uk_food_recipes_brill_with_fennel_pollen_78515", "title": "Brill con polen de hinojo envuelto en 'spaghetti' de patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de caldo de pollo", "1 cucharada de vadouvan (una mezcla de especias similar a masala)", "12 zanahorias baby, lavadas y peladas", "50g / 1¾oz de mantequilla", "8 cucharadas de aceite de oliva", "2 cucharaditas de vinagre balsámico envejecido", "2 zanahorias grandes, trituradas en tiras finas", "1 limón, ralladura finamente rallada solamente", "300 ml / 10 fl oz de leche de coco con toda su grasa", "250ml / 9fl oz de leche entera", "1 cucharadita de vainas de cardamomo, agrietadas", "5 hojas de lima", "10g de jengibre molido", "1 pizca de sal de roca", "4 x 150 g / 5½ oz de filetes brillantes", "1 cucharada de berro de coriandro", "hojas de las zanahorias bebé"], "method": ["Para las zanahorias con especias, agregue la especia vadouvan al caldo de pollo y cocine a fuego lento. Coloque las zanahorias en el caldo y cocine durante 5-7 minutos hasta que estén tiernas. Retire las zanahorias, aumente el calor y reduzca el volumen del líquido a la mitad. Agregue la mantequilla y deje el caldo y las zanahorias a un lado.", "Para la vinagreta, mezcle todos los ingredientes en un bol hasta que estén bien combinados. Dejar de lado.", "Para el pescado, vierta la leche de coco y la leche en una olla grande. Agregue el jengibre, las vainas de cardamomo, las hojas de lima y la sal. Lleve a fuego lento a fuego medio, luego agregue los filetes brillantes y cocínelos suavemente durante 3-4 minutos. Apague el fuego, pero deje el pescado en el líquido de la caza furtiva para mantener el calor.", "Para servir, devuelva las zanahorias con especias al caldo reducido y caliente hasta que las zanahorias estén calientes y glaseadas.", "Usando una rebanada de pescado, retire los filetes de pescado del líquido de caza furtiva y transfiera a los platos de servir. Coloque las zanahorias con especias al lado. Viste el pescado y las zanahorias con la vinagreta y decora con berros y hojas de zanahoria baby."], "url": "www_bbc_co_uk_food_recipes_brill_with_toffee_and_85667", "title": "Brill con zanahorias con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de salsa de soja", "50ml / 2fl oz sake", "50ml / 2fl oz", "1 cucharada de aceite de sésamo", "2 hojas grandes de plátano, al vapor y suavizadas, el borde duro retirado para que se enrollen (disponible en algunas tiendas de comestibles asiáticas)", "2 zanahorias, cortadas en finas tiras", "3 cebolletas, cortadas en finas tiras", "1 albahaca pequeña", "2 ramitas de tomillo fresco, solo hojas", "Jengibre de raíz de 5cm / 2in, pelado, cortado en finas tiras", "4 piezas de 200 g / 7oz con el hueso"], "method": ["Precalentar el horno a 220C / 425F / Gas 8.", "Batir la salsa de soja, el sake y el mirin y el aceite de sésamo en un bol y dejar este aderezo a un lado.", "Coloque cada hoja de plátano en un recipiente para que siga la forma del recipiente. Coloque las zanahorias, las cebolletas, la albahaca, las hojas de tomillo y el jengibre en un tazón limpio y mezcle bien. Coloque un poco de la mezcla de vegetales, hierbas y jengibre en la salsa de cada hoja de plátano (reservando la mitad de las verduras para más adelante), luego cubra con una pieza de brill.", "Ponga un poco de aderezo sobre la parte superior, luego cubra con la mezcla reservada de vegetales, hierbas y jengibre y cualquier aderezo restante.", "Dobla la hoja de plátano para cubrir el relleno y ata con la cuerda del cocinero para sellar completamente como un paquete.", "Coloque los paquetes de hojas de plátano en una bandeja de horno y transfiéralos al horno para cocinar durante 10-12 minutos.", "Para servir, coloque cada paquete en un plato y ábralos en la mesa frente a sus invitados."], "url": "www_bbc_co_uk_food_recipes_brillenpapillote_88911", "title": "Brill en papillote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalota, en rodajas", "1 ramita de tomillo fresco", "2 tallos de perejil fresco", "1 diente de ajo", "200ml / 7fl oz de vino tinto", "4 x filetes brillantes, aproximadamente 150 g / 5 oz cada uno", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla fría", "Crema doble 50ml / 2fl oz", "100 g / 3½ oz de mantequilla", "Papas 400g / 14oz, hervidas, escurridas, en puré", "Repollo savoy 150g / 5oz, rallado, hervido", "8 cebollas de primavera, picadas", "pizca de nuez moscada recién rallada"], "method": ["Para el brillo, coloque la chalota, el tomillo, el perejil, el ajo y el vino en una sartén grande y profunda y deje que hierva.", "Baje el fuego a fuego lento. Agregue el brill y poach durante 5-6 minutos, o hasta que esté recién cocinado. Retirar de la sartén, reservar y mantener caliente.", "Colar el licor de cocina en una sartén por separado y llevar a ebullición. Hierva rápidamente para reducir el volumen del líquido en aproximadamente dos tercios.", "Sazone la salsa con sal y pimienta negra recién molida, luego mezcle con la mantequilla fría. No vuelva a hervir la salsa.", "Para el colcannon, coloca la crema y la mantequilla en un tazón grande con el puré de patatas tibias y mezcla bien.", "Agregue el repollo y la cebolleta y dóblelos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca una cucharada de colcannon en cuatro platos. Coloque un pedazo de brill en cada una, ponga una cucharada sobre la salsa y termine con un poco de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_brillpoachedinredwin_85659", "title": "Brill escalfado en vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de sal", "250g / 9oz de azúcar moreno", "2 palitos de canela", "5 dientes", "1 manojo de tomillo", "4 hojas de laurel", "2-3 cabezas de ajo", "1 cucharadita de pimienta negra", "3 clementinas, cortadas a la mitad para exprimir", "2 cebollas blancas picadas", "algunos anís estrellado", "1 x 5kg / 11lb de buena calidad pavo de corral", "dash aceite de oliva", "50g / 1¾oz de mantequilla, ablandada", "algunas lonchas tocino rayado"], "method": ["Para la salmuera, combine todos los ingredientes en una sartén grande con 6 litros / 10½ pintas de agua. Lentamente llevar a ebullición, revolviendo, para disolver el azúcar y la sal. Retirar del fuego y dejar enfriar por completo.", "Vierta la salmuera en un cubo grande y esterilizado. Agregue el pavo y déjelo durante dos días en el refrigerador o en una habitación muy fría. El pavo debe estar completamente sumergido debajo de la salmuera. Use pesas para evitar que flote (las botellas de agua de plástico funcionan bien).", "Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Retire el pavo de la salmuera y seque.", "Frote el pavo con aceite de oliva y sazone con sal y pimienta. Unta con la mantequilla y la tapa con tocino rayado. Cocine durante aproximadamente tres horas, o hasta que los jugos se aclaren cuando la carne se perfora en la parte más gruesa. Deje reposar durante al menos quince minutos y sirva en rodajas."], "url": "www_bbc_co_uk_food_recipes_brined_roast_turkey_29599", "title": "Pavo asado a la parrilla", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, finamente picada", "3 dientes de ajo, aplastados", "½ cucharadita de cúrcuma molida", "1 cucharada de puré de tomate", "200ml / 7fl oz de caldo de verduras", "100ml / 3½fl oz de vino blanco", "1 cucharadita de azúcar en polvo", "1 berenjena pequeña, cortada en cubos de 2 cm / 1 in", "½ pinta de aceite vegetal, para freír", "2 cucharadas de cilantro fresco picado", "1 cucharadita de cúrcuma molida", "1 cucharadita de comino molido", "sal y pimienta negra recién molida", "1 filete de caballa, piel anotada", "1 cucharada de aceite de oliva", "cebollino fresco pequeño, cortado en trozos de 5cm / 2in", "½ limón, cortado en cuñas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los buñuelos de berenjena, caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 2-3 minutos. Agregue la cúrcuma, el puré de tomate, el caldo, el vino y el azúcar y deje hervir a fuego lento durante unos cinco minutos.", "Mientras tanto, caliente el aceite vegetal para freírlo en una sartén grande y caliente hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: no deje el aceite sin supervisión ya que el aceite caliente puede ser peligroso). Agregue con cuidado los cubos de berenjena y fríalos durante 4-5 minutos, o hasta que estén dorados.", "Retire con una espumadera y escurra sobre la toalla de cocina antes de removerlos suavemente en la cebolla y las especias. Finalmente, agregue el cilantro.", "Para el comino y la cigala con costra de caballa, combine las especias en un recipiente y cubra el pescado con la mezcla. Sazonar, al gusto, con sal y pimienta negra recién molida. Calentar el aceite en una sartén y freír la caballa hasta que se dore por ambos lados, alrededor de 3-4 minutos. Transfiera la sartén al horno para continuar cocinando durante 8-10 minutos.", "Para servir, coloque el pescado en el centro de un plato de servir y rodee con los buñuelos de berenjena. Adorne con cebolletas frescas picadas y rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_brinjalbharjiewithac_88615", "title": "Buñuelos de berenjena con comino y caballa con costra de cúrcuma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, finamente picada", "3 dientes de ajo, aplastados", "½ cucharadita de cúrcuma molida", "1 cucharada de puré de tomate", "200ml / 7fl oz de caldo de verduras", "100ml / 3½fl oz de vino blanco", "1 cucharadita de azúcar en polvo", "1 berenjena pequeña, cortada en cubos de 2 cm / 1 in", "½ pinta de aceite vegetal, para freír", "2 cucharadas de cilantro fresco picado", "1 cucharada de aceite de oliva", "225 g / 8 oz de espinacas", "nuez moscada recién rallada, al gusto", "1 cucharada de yogur griego", "pimentón, para rociar"], "method": ["Para los buñuelos de berenjena, caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 2-3 minutos. Agregue la cúrcuma, el puré de tomate, el caldo, el vino y el azúcar y deje hervir a fuego lento durante unos cinco minutos.", "Mientras tanto, caliente el aceite vegetal para freírlo en una sartén grande y caliente hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: no deje el aceite sin supervisión ya que el aceite caliente puede ser peligroso). Agregue con cuidado los cubos de berenjena y fríalos durante 4-5 minutos, o hasta que estén dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Revuelva suavemente los buñuelos de berenjena en la mezcla de cebolla y especias. Revuelva en el cilantro.", "Para la espinaca salteada, caliente el aceite en un wok y agregue las espinacas. Cocine por 1-2 minutos, hasta que se marchite. Rallar sobre la nuez moscada y revuelva para combinar.", "Para servir, coloque la espinaca en un anillo en un plato de servir y apile los buñuelos de berenjena en el centro. Cubra con el yogur y espolvoree con pimentón."], "url": "www_bbc_co_uk_food_recipes_brinjalbharjiewithsa_88614", "title": "Buñuelos de berenjena con salteado de espinacas, yogur y pimentón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]