[{"ingredients": ["2 cucharadas de aceite de oliva", "4 chalotes, en rodajas finas", "1 cebolla roja, finamente rebanada", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "150 g / 5½ oz de setas, a la mitad", "1 diente de ajo ahumado, finamente picado", "125g / 4½oz de cuscús", "perejil fresco picado, para adornar"], "method": ["Calentar el aceite de oliva en una sartén, agregar los chalotes y las cebollas y sazonar al gusto con sal y pimienta negra recién molida. Cocine a fuego lento durante ocho minutos, revolviendo con frecuencia, hasta que esté suave y ligeramente caramelizado.", "En una sartén por separado, caliente la mantequilla, agregue los champiñones y el ajo y cocine a fuego medio durante 2-3 minutos.", "Coloque el cuscús en un recipiente y vierta suficiente agua hirviendo para cubrir el cuscús por un centímetro. Cúbralo con una película adhesiva y déjelo hasta que se haya absorbido toda el agua.", "Retire la película adhesiva y esponje los granos con un tenedor y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, amontone el cuscús en un plato para servir y cubra con las cebollas y hongos caramelizados. Adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_couscouswithcarameli_87146", "title": "Cuscús con cebolla caramelizada y setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de cuscús", "½ cucharadita de sal", "100 g / 3½ oz de piñones", "570ml / 20fl oz / 1 pinta de agua hirviendo"], "method": ["Coloque el cuscús, la sal y los piñones en una olla con tapa y revuelva bien.", "Vierta el agua (debe estar a unos 2 cm / ¾ pulgada sobre el cuscús).", "Coloque la tapa del recipiente y déjelo hasta que esté listo para servir.", "Doble suavemente el cuscús para romper los granos, antes de transferirlo a un tazón para servir.", "Esto es una excelente comida para ensaladas si deja que el cuscús se enfríe y lo guarde en la nevera. Si está sirviendo el cuscús con una fuente picante, deje este plato como está y sirva caliente. Si lo sirve con una carne más clara, como las chuletas de cordero, puede ablandar un poco de cebolla en aceite de oliva y agregar el jengibre fresco, el chile y el ajo antes de agregar el cuscús a la sartén."], "url": "www_bbc_co_uk_food_recipes_couscouswithpinenuts_83713", "title": "Cuscús con piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Cuscús 250 g / 9 oz", "600ml / 20fl oz / 1 pinta de caldo de pollo o caldo de verduras", "2 cucharadas de aceite vegetal", "1 aguacate, en cubos", "½ lima, solo jugo", "2 cucharadas de cilantro fresco, picado", "2 cucharadas de menta fresca picada", "1 chile rojo, picado", "1 cebolla roja, finamente rebanada"], "method": ["Coloque el cuscús en un recipiente grande y agregue caldo de pollo o verduras calientes. Cubra y deje reposar durante cinco minutos.", "En una sartén, agrega el aceite vegetal. Una vez caliente, agrega la cebolla roja. Freír por 2-3 minutos y retirar del fuego.", "Agregue el aguacate, el jugo de lima, las hierbas frescas, el chile y la cebolla roja al cuscús y mezcle bien.", "Servir."], "url": "www_bbc_co_uk_food_recipes_couscouswithredonion_75830", "title": "Cuscús con cebolla roja y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "2kg / 4lb 8 oz de carne en cubos (mezcla de mandril, falda y espinilla)", "aproximadamente 500ml / 18fl oz de caldo de carne", "3 zanahorias, más o menos picadas", "3 palitos de apio, más o menos picados", "3 cebollas blancas, más o menos picadas", "3 cucharadas de harina común", "sal y pimienta negra recién molida", "8 ramitas de tomillo", "2 hojas de laurel", "Hueso de la espinilla de la carne de la pieza de los 20cm / 8in", "2 papas grandes", "4 chirivías grandes, peladas", "125 g / 4½ oz de mantequilla", "2 cucharadas de semillas de mostaza negra"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Caliente cuatro cucharadas de aceite de oliva en un plato grande a prueba de horno.", "Dore la carne en cubos a fuego moderado a alto, en aproximadamente cuatro tandas, reservando la carne en un tazón sobre la marcha.", "Agregue un par de cucharadas de caldo al plato y raspe la base del plato con una cuchara de madera para liberar el sedimento caramelizado. Vierta en el tazón con la carne dorada.", "Calienta dos cucharadas más de aceite de oliva en el mismo plato y suaviza las zanahorias, el apio y la cebolla picados.", "Regrese la carne al plato y esparza sobre la harina. Deje cocinar por un par de minutos.", "Vierta suficiente caldo para cubrir casi la carne, sazone con sal y pimienta negra recién molida y luego revuelva bien el contenido.", "Agregue el tomillo y la hoja de laurel y deje hervir a fuego lento.", "Para la corteza, utilizando un rallador de platos o el rallador de un procesador de alimentos, ralle las papas y las chirivías peladas.", "En otra sartén, derrita la mantequilla con las semillas de mostaza.", "Mezcle las papas y la chirivía en la mantequilla derretida y las semillas de mostaza, cubriendo uniformemente cada filamento.", "Extienda la costra de patata de chirivía sobre el guiso.", "Haga un pequeño espacio en el medio de la corteza y meta el hueso en él para que quede de pie.", "Cubra en papel de aluminio y hornee por dos horas, quitando la lámina después de una hora para que la masa quede crujiente."], "url": "www_bbc_co_uk_food_recipes_cow_crumble_76025", "title": "Crumble de vaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de patatas harinas, peladas y cortadas en cubitos", "Lomo de bacalao 500 g / 1lb 2 oz, pelado", "6 cebolletas, finamente picadas", "2 cucharadas de mayonesa entera", "2 cucharaditas de mostaza Dijon", "130g / 4¾oz de cangrejo disfrazado o 100g / 3½oz de carne de cangrejo fresca mixta", "2 cucharadas de perejil fresco picado", "pizca de salsa picante, como Tabasco", "Pan rallado pancho japonés de 100 g / 3½ oz", "botón de mantequilla, más extra para engrasar", "1 cucharada de aceite", "sal y pimienta negra recién molida", "6 tomates firmes, sin semillas, cortados en cubitos", "1 cebolla roja pequeña, finamente picada", "1 cucharada de vinagre de vino blanco", "4 cucharadas de aceite de oliva", "2 cucharadas de perejil fresco picado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque las papas en una cacerola con agua con sal y deje que hiervan. Hervir durante 15 minutos, o hasta que estén tiernos. Escurrir bien y macerar. Sazonar con sal y pimienta y reservar para enfriar.", "Engrase una hoja de papel de aluminio con la mantequilla y coloque el lomo de bacalao en el centro, sazone con sal y pimienta y envuelva en papel de aluminio para hacer un paquete. Ponga en una bandeja para hornear y cocine por 20 minutos, o hasta que esté recién cocido. Dejar de lado para enfriar. Cuando esté completamente frío, con cuidado desmenuce el pescado en trozos grandes. Reserve los jugos de cocina.", "Coloque la mezcla fría en un bol, mezcle las cebolletas, la mayonesa y la mostaza. Agregue 2 cucharadas de jugo de pescado para cocinar, luego agregue el bacalao copos y agregue la carne de cangrejo. Agregue el perejil y la salsa de ají picante y revuelva hasta que se combinen. Sazone al gusto.", "Forme la mezcla en 8 pasteles de pescado, de aproximadamente 9 cm / 3½ de diámetro, esto es más fácil con las manos húmedas. Coloque en una bandeja y enfríe en la nevera durante al menos 15 minutos.", "Espolvoree las migas de pan en un plato y cubra cada torta de pescado. Regrese a la bandeja y vuelva a enfriar en la nevera durante 30 minutos.", "Mientras tanto, para la salsa, mezcle todos los ingredientes y sazone con sal y pimienta.", "Caliente una sartén grande de base pesada, agregue la mantequilla y el aceite y fríe las tartas de pescado a fuego alto durante 4 minutos en cada lado, o hasta que estén doradas por todas partes. Al freír, es mejor no sobrecargar la sartén, cocinar en dos tandas, si es necesario.", "Sirva caliente con la salsa de tomate y una ensalada sencilla."], "url": "www_bbc_co_uk_food_recipes_crab_and_cod_fishcakes__15634", "title": "Cangrejo y bacalao con salsa de tomate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_and_cod_fishcakes__15634_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de espagueti o linguini", "Calabacines de 600 g / 1 lb 5 oz, cortados en cintas con un pelador de verduras", "2 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "2 x 240 g de carne de cangrejo, escurrida", "½ limón no encerado, ralladura fina y jugo", "2 cucharadas de eneldo seco", "sal y pimienta negra recién molida", "4 cucharadas de parmesano recién rallado, para servir"], "method": ["Llevar a ebullición una sartén grande de agua salada. Cocine la pasta por 8 minutos o hasta que esté al dente.", "Coloque los calabacines en un vaporizador o colador y siéntese sobre la fuente de pasta. Cubra y caliente durante 1-2 minutos, o hasta que estén tiernos.", "Escurra la pasta, retenga un poco del agua de cocción y lade en un tazón grande.", "Vierta el aceite en la bandeja de pasta a fuego lento. Agregue el ajo y cocine brevemente, para dar sabor al aceite. Vierta el aceite sobre la pasta.", "Mezcle la pasta con el cangrejo, la ralladura de limón y el jugo, el eneldo y los calabacines. Sirva cada porción con 1 cucharada de queso parmesano y una pizca de pimienta."], "url": "www_bbc_co_uk_food_recipes_crab_and_courgette_pasta_55917", "title": "Pasta de cangrejo y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_and_courgette_pasta_55917_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 zanahoria, pelada y finamente picada", "1 cebolla, finamente picada", "1 apio en barra, finamente picado", "½ puerro, lavado y finamente picado", "1 pimiento rojo, sin semillas y finamente picado", "3 tomates medianos, finamente picados", "½ bulbo de hinojo, finamente picado", "1 hoja de laurel", "6 granos de pimienta", "1 primavera de tomillo", "1 cucharadita de semillas de cilantro", "500g / 1lb 2 oz de mezcla de cabezales y cáscaras de cangrejo y langostinos", "1 cucharada de puré de tomate", "12 cucharadas de arroz blanco", "Brandy 175ml / 6fl oz", "1 litro / 1¾ pintas de cangrejo o caldo de pescado", "sal y pimienta negra recién molida", "1 cucharada de crème fraîche, para servir", "aceite vegetal, para freír", "120 g / 4½ oz de carne de cangrejo blanca", "1 chile, finamente picado", "1 cucharada de cebollino picado", "exprimir jugo de lima", "1 huevo de gallinas camperas, golpeado", "6 envolturas de wonton"], "method": ["Para hacer la sopa, caliente el aceite en una olla grande y cocine la zanahoria, la cebolla, el apio y el puerro a fuego lento durante 5-7 minutos. Agregue la pimienta, los tomates, el hinojo, la hoja de laurel, la pimienta en grano, el tomillo y las semillas de cilantro.", "Aplastar las conchas de cangrejo y langostinos y agregar a la sartén con el puré de tomate y el arroz. Agregue el brandy y flambeado. (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Vierta sobre el caldo y cocine a fuego lento durante 30 minutos. Sazonar con sal y pimienta y pasar a través de un tamiz fino en una sartén limpia. Cocine a fuego lento hasta que el volumen del líquido se haya reducido en dos tercios y la sopa sea gruesa.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 175 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Para hacer los wontons, mezcle la carne de cangrejo con el chile, el cebollín y el jugo de lima.", "Huevo lavar los bordes de cada envoltorio wonton. Divida la mezcla de cangrejo entre cada wonton y sello.", "Freír los wontons durante 5 minutos hasta que estén dorados. Escurra los wonton sobre papel de cocina y sirva junto a la sopa en tazones con una cucharada de crème fraîche."], "url": "www_bbc_co_uk_food_recipes_crab_and_langoustine_83597", "title": "Bisque de cangrejo y langostinos con wontons de cangrejo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta 100 g / 3½ oz '00'", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas", "3 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, en rodajas finas", "1 chile rojo, en rodajas finas", "100ml / 3½fl oz de caldo de verduras", "Carne de cangrejo blanca 250 g / 9 oz", "½ limón, solo ralladura", "10g / ⅓oz de flatleaf perejil, aproximadamente picado", "10g / ⅓oz de eneldo, aproximadamente picado, más extra para decorar", "sal y pimienta negra recién molida"], "method": ["Mezcle las harinas en un bol. Agregue los huevos y mezcle suavemente para formar una masa, agregando un poco de agua si es necesario.", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y amasar hasta que quede suave. Envuelva la película adhesiva y déjela reposar en la nevera durante al menos 1 hora.", "Con una máquina de pasta, extienda la masa de pasta hasta aproximadamente 1 mm de grosor. Corta la masa en hojas y corta en tiras delgadas de unos 3 mm de ancho. Polvo con un poco de harina, cubra y deje en la nevera hasta que esté listo para cocinar.", "Para hacer la salsa, caliente 2 cucharadas de aceite en una cacerola a fuego medio. Agregue el ajo y el chile y cocine hasta que el ajo esté dorado. Agregue la mitad del caldo de verduras y deje que burbujee.", "Mientras tanto, ponga a hervir una cacerola grande de agua con sal, agregue el tagliolini y cocine durante 1 minuto.", "Escurrir el tagliolini y agregar al ajo y el chile. Agregue la carne de cangrejo blanca a la pasta con el caldo restante y caliéntela durante un par de minutos.", "Agregue la ralladura de limón, el perejil, el eneldo y el aceite de oliva restante. Controle el condimento, adorne con un poco más de eneldo y sirva."], "url": "www_bbc_co_uk_food_recipes_crab_and_lemon_80562", "title": "Tagliolini de cangrejo y limón", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 caja de tarta de hojaldre con pasta corta de corteza corta lista para el desayuno, cocida hasta que se dore", "4 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "Crema doble de 425 ml / ¾ de pinta", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "75g / 2½oz de queso parmesano rallado", "250 g / 9 oz de carne de cangrejo blanco", "1 langosta cocida, carne picada", "racimo de cebollas", "mantequilla, para freír"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Mezcle los huevos, la crema y la nuez moscada en un bol. Sazonar bien con sal y pimienta y agregar la carne de parmesano, cangrejo y langosta.", "Freír las cebolletas en mantequilla en una sartén y una cuchara en la caja. Coloque la langosta y la mezcla de cangrejo en la caja de flan preparada y hornee durante aproximadamente 40 minutos, o hasta que se tambalee en el centro.", "Sacar del horno y dejar enfriar. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_crab_and_lobster_tart_87817", "title": "Tarta de cangrejo y langosta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tapioca 100 g / 3½ oz", "568ml / 1 pinta stock de langosta", "sal al gusto", "300g / 10½oz de harina blanca fuerte, más extra para quitar el polvo", "100ml / 3½oz de yemas de huevo pasteurizadas (alrededor de 5-6 yemas) más extra para glaseado", "200 g / 7 oz de carne de salmón", "1 huevo blanco de corral", "400 ml / 14 fl oz crema doble", "250 g / 9 oz de carne de cangrejo blanca fresca", "1 cucharada de eneldo fresco finamente picado", "Jengibre fresco de raíz de 2cm / 1 en pieza, finamente picado", "sal y pimienta negra recién molida", "Mejillones frescos de 500g / 1lb 2oz", "1 chalote, picado", "1 diente de ajo, picado", "1 ramita de tomillo", "1 vaso pequeño de vino blanco", "300ml / 10½ fl oz crema doble", "1 patata grande y harinosa, pelada, picada en cuadritos y blanqueada", "1 cucharada de cebollino picado", "25 g / 1 oz espinaca bebé", "sal al gusto", "brotes de guisantes, para adornar", "2 cucharaditas de caviar, para decorar"], "method": ["Para la guarnición de tapioca de langosta, coloque la tapioca en una sartén con el caldo de langosta y caliente hasta que la tapioca se vuelva translúcida. En este punto, retire la tapioca del fuego y drene el líquido en un recipiente. Pruebe la tapioca y agregue sal según sea necesario. Agregue un poco del líquido de cocción a la tapioca y esparza la mezcla uniformemente sobre una estera de silicona y seque en un deshidratador o en un horno muy bajo hasta que esté crujiente (esto tomará algunas horas).", "Para la guarnición, parta unos trocitos de la tapioca crujiente y fría en aceite hasta que estén crujientes e hinchados. Ponga a un lado hasta que esté listo para servir.", "Para hacer la pasta, en un procesador de alimentos, mezcle la harina y las yemas de huevo hasta que se unan para formar una masa áspera. Exprime un trozo de la masa, si se siente duro agrega un poco más de yema de huevo y vuelve a mezclar. La masa debe ser firme pero flexible.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase la masa durante cinco minutos. Envuelva la película adhesiva y colóquela en la nevera para que descanse durante 30 minutos.", "Para la mousse de cangrejo, coloque el salmón y la clara de huevo en un procesador de alimentos y pulse hasta que quede suave y luego agregue lentamente la crema, pulsando para combinar. Transfiera la mousse a un recipiente y agregue la carne de cangrejo blanca, el eneldo picado y el jengibre picado. Sazonar, al gusto, con sal y pimienta. Coloque la mousse en una bolsa de plástico con una boquilla grande y plana y déjela a un lado.", "Saca la pasta del refrigerador y córtala en dos pedazos. Pase la masa a través de la máquina de pasta una configuración a la vez, comenzando por la más grande y trabajando hasta la última y más pequeña configuración. Pon la otra pieza a través de la máquina. Ahora tiene dos hojas largas de pasta.", "Cepille una hoja de pasta con un poco de yema de huevo y pinte cuatro bolas del mismo tamaño de la mousse de cangrejo, a unos 6 cm de separación, en una línea a lo largo de un lado de la pasta. Baje la otra hoja de pasta sobre la mousse y palmee suavemente con los dedos para sellar todo alrededor de cada bola de relleno.", "Usando un cortador de 4-6cm / 2-3in, corte los raviolis en rondas ordenadas.", "Para los mejillones, limpia y debesard los mejillones. Si se abren algunos mejillones, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos.", "Caliente una sartén de fondo grueso y agregue los mejillones. Cubra con una tapa. Después de un minuto, agregue los chalotes, el ajo, el tomillo y el vino blanco. Vuelva a colocar la tapa y vapor los mejillones hasta que estén todos abiertos (deseche los que no se abren). Agregue la crema y hierva. Cuele los mejillones, reservando la salsa y deje que se enfríe un poco hasta que sea segura de manejar y saque la carne de mejillón de las conchas.", "Agregue la carne de mejillón, las patatas cocidas en cubitos y el cebollín a la salsa de crema y caliente. En una sartén por separado, la espinaca con dos cucharadas de agua y un poco de sal. Mantenga caliente hasta que esté listo para servir.", "Para servir, traiga una sartén con agua con sal a fuego lento y agregue los raviolis. Cocine por cuatro minutos.", "Coloque un pequeño montículo de la espinaca marchita en el centro de cada tazón de servir y luego cuchara sobre el mejillón y la salsa de papa. Retire los ravioles del agua con una cuchara ranurada y coloque uno en la parte superior de cada montículo de espinacas. Con una batidora de mano, espumilla el resto de la salsa de mejillón y espárcela alrededor de los raviolis.", "Cubra los raviolis con caviar y patatas fritas de tapioca y adorne con algunos brotes de guisantes y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crab_and_mussel_ravioli_51406", "title": "Ravioles de cangrejo con mejillones con mariniere de patata, espinacas marchitas y caviar", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de harina '00'", "3 huevos grandes de gallinas camperas, batidos, más 2 yemas", "1 limón sin cebar, ralladura fina solamente", "sal", "harina de sémola, para quitar el polvo", "1 cucharada de aceite de oliva", "150g / 5½ oz de gambas crudas en sus caparazones", "exprimir jugo de limón", "Carne de cangrejo blanca 150 g / 5½ oz", "50g / 1¾oz de carne de cangrejo marrón", "1 clara de huevo de gallinas camperas, más 1 huevo batido", "1 cucharada de cebollines frescos finamente picados", "pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cebolla pequeña, más o menos picada", "1 diente de ajo, aplastado", "3 cucharadas de brandy", "2 tomates, toscamente picados", "1 hoja de laurel", "1 cucharada de puré de tomate", "1 estrella de anís", "300 ml / 10 fl oz existencias de mariscos (o pescado)", "125ml / 4fl oz de crema doble", "puñado de cebollín fresco, finamente picado", "aceite de oliva virgen extra"], "method": ["Para hacer la pasta, coloca la harina en un tazón grande y haz un pozo en el centro. Agregue los huevos y las yemas, la ralladura de limón y una pizca de sal, y gradualmente trabaje en una masa. Amasar durante 10 minutos, luego envolver en film transparente y refrigerar durante 30 minutos.", "Mientras tanto, para hacer el relleno, coloque una sartén a fuego medio. Agregue una pizca de aceite y fría las gambas con una pizca de sal y pimienta y el jugo de limón. Dejar enfriar un poco, luego quitar las gambas de sus caparazones, reservando los caparazones para más adelante.", "Coloque la gamba y las carnes de cangrejo en un procesador de alimentos y mezcle hasta que quede suave. Agregue la clara de huevo y el condimento y vuelva a mezclar hasta que esté mezclado. Agregue las cebolletas, cubra y reserve.", "Para hacer la sopa, caliente el aceite en una cacerola de base pesada y fría la cebolla hasta que se dore. Agregue las cáscaras de ajo y gambas y cocine por otros 30 segundos. Agregue el brandy, los tomates, la hoja de laurel, el puré de tomate y el anís estrellado. Agregue el caldo y cocine a fuego lento durante 20 minutos.", "Colar la salsa con un embudo y tela de muselina y volver a la sartén. Agregue la crema y cocine a fuego medio hasta que tenga la consistencia de una crema individual. Sazone al gusto.", "Para hacer los raviolis, corte la pasta en cuatro pedazos y despliegue cada pieza con una máquina de pasta, trabajando a través de los ajustes hasta que esté en el ajuste más delgado. Espolvoree la harina de sémola en una superficie de trabajo y coloque una hoja de la pasta encima. Cuchara de cucharadas del relleno en el centro de la pasta, dejando un espacio de 4 cm / 1½ in entre cada cucharada. Cepille alrededor del relleno con huevo batido, coloque una segunda hoja de pasta sobre la parte superior y selle cada una ahuecando y expulsando el aire. Use un cortador para cortar los raviolis individuales. Repita con las dos últimas hojas de pasta hasta que tenga 12-16 ravioles individuales.", "Ponga a hervir una olla grande de agua y cocine los raviolis durante 3-4 minutos. Transfiera a la bandeja de sopa para cubrir.", "Coloque tres o cuatro raviolis en cada plato, ponga una cuchara sobre la salsa y decore con el cebollino y una pequeña llovizna de aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_crab_and_prawn_ravioli_10855", "title": "Ravioles de cangrejo y gambas con sopa de marisco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de salmón, pin deshuesado y desollado", "Una pizca de sal marina", "Crema doble 25ml / 1fl oz", "120 g / 4¼ oz de carne de cangrejo blanca", "1 cucharada de cilantro picado", "1 cucharada de albahaca picada", "1 cucharada de perejil picado", "¼ de lima, solo ralladura", "¼ de limón, solo cáscara", "450 g / 1 libra de hojaldre confeccionado", "1 huevo de gallinas camperas, batido para lavar huevos", "½ gelatina de hoja, empapada en agua fría durante 10 minutos", "½ limón, solo jugo", "110 g / 4 oz de carne de cangrejo marrón", "pizca de salsa Worcestershire", "1 cucharadita de mostaza inglesa", "1 cucharadita de esencia de anchoa", "2 cucharaditas de ketchup de tomate", "1 yema de huevo", "1 cucharada de pan rallado blanco fresco", "Aceite vegetal 110ml / 4oz", "4 cucharadas de aceite de colza", "sal y pimienta negra recién molida"], "method": ["Para el rollo de cangrejo y salmón, prepare un mousse de salmón mezclando la mitad del salmón con una pizca de sal marina en un procesador de alimentos. Agregue la crema doble y procese hasta que quede suave. Dobla la carne de cangrejo en la mousse y mezcla las hierbas y los cítricos. Pesar en 4 porciones (aproximadamente 100 g / 3½ oz cada una) y moldear en formas de salchichas.", "Corta la masa en cuatro rectángulos de 17x15cm / 6½x6in. Coloque las salchichas en los pasteles a lo largo. Cepille los bordes de la pastosa con la colada de huevo. Doble sobre la masa para cubrir el relleno y ribete los bordes con un tenedor para sellar. Corte cualquier exceso de masa y cepille con dos manos de huevo. Guarde en el refrigerador hasta que esté listo para cocinar (se pueden preparar con un día de anticipación).", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel de hornear.", "Hornee los pasteles por 11 minutos, o hasta que estén dorados e hinchados.", "Para el ketchup de cangrejo marrón, exprima el exceso de agua de la gelatina y luego agregue a una sartén con el jugo de limón. Disuelva a fuego muy lento y luego transfiera a una licuadora. Agregue el cangrejo marrón, la salsa Worcestershire, la mostaza, la esencia de anchoa, el ketchup y la yema de huevo, y luego procese hasta que quede suave. Agregue las migas de pan y continúe mezclando hasta que esté suave de nuevo. Con el motor funcionando lentamente, agregue los aceites en una corriente de agua fina. Detenga la máquina y raspe los lados cada cierto tiempo. Condimentar con sal y pimienta. Pasar a través de un tamiz fino en una jarra pequeña o tazón.", "Sirva los panecillos calientes en una tabla de servir con el ketchup al lado."], "url": "www_bbc_co_uk_food_recipes_crab_and_salmon_roll_81622", "title": "Rollo de cangrejo y salmón con ketchup de cangrejo marrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "475 g / 1lb 1 oz de apionabos, pelados y cortados en cubos", "2 chalotes, en rodajas", "1 diente de ajo, picado", "50ml / 2fl oz de vino blanco seco", "1 litro / 1¾ pintas de caldo de pollo", "75ml / 2½ fl oz crema doble", "aceite vegetal, para freír", "50g / 1¾oz de mantequilla, cortada en cubitos", "Harina normal de 75 g / 2½ oz", "½ cucharadita de pimienta de cayena", "2 huevos de gallinas camperas", "55g / 2oz de carne de cangrejo blanca", "25g / 1oz de carne de cangrejo marrón", "25g / 1oz de maíz dulce enlatado", "sal y pimienta negra recién molida", "aceite de oliva", "2 cucharaditas de berros de bebé", "1 manzana comiendo, cortada en tiras finas"], "method": ["Para la sopa de apio nabo, caliente el aceite en una sartén grande a fuego medio. Agregue el apio nabo, los chalotes y el ajo y fría con cuidado durante unos minutos, para suavizar sin dorar.", "Agregue el vino blanco, hierva y cocine para reducir el volumen del líquido a la mitad.", "Agregue el caldo de pollo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento durante 10-15 minutos, hasta que el apionabo esté suave. Retirar del fuego y dejar enfriar durante cinco minutos.", "Transfiera la sopa a una licuadora y mezcle hasta que quede suave.", "Regrese la sopa a la cacerola, agregue la crema y caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para los beignets de cangrejo y maíz dulce, caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Derrita la mantequilla y 125ml / 4fl de agua en una olla hasta que la mezcla hierva, luego hierva por otro minuto.", "Retire la sartén del fuego y bata en la harina y pimienta de cayena con una cuchara de madera hasta que quede suave, o hasta que la mezcla se desprenda del costado de la sartén. Regrese la sartén al fuego y cocine por 1-2 minutos, revolviendo continuamente.", "Retire la sartén del fuego y bata en los huevos, uno a la vez, batiendo bien antes de agregar el otro huevo.", "Agregue la carne de cangrejo y el maíz dulce blanco y marrón hasta que estén bien combinados, luego sazone con sal y pimienta negra recién molida.", "Coloque la mezcla en una bolsa para tubos con una boquilla grande y lisa. Con cuidado, pipetee 1,5 cm / ½ en secciones largas en el aceite y fría por 1-2 minutos, o hasta que estén doradas y crujientes. Retire los beignets de la sartén con una espumadera y déjelos a un lado para escurrirlos sobre papel de cocina y sazone con sal.", "Para servir, ponga la sopa en cuencos, esparza algunos beignets de cangrejo y maíz dulce. Rocíe la sopa con aceite de oliva y decore con berro de bebé y manzana."], "url": "www_bbc_co_uk_food_recipes_crab_and_sweetcorn_26371", "title": "Beignets de cangrejo y maíz dulce con sopa de apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 vieiras grandes capturadas por buzos, descascaradas (mantener las conchas)", "botón de mantequilla", "100g / 3½oz blanco o marrón (o una mezcla) de carne de cangrejo seleccionada a dedo", "500ml / 18fl oz de leche entera", "1 hoja de laurel", "½ cebolla pequeña, finamente rebanada", "30g / 1oz de mantequilla, más extra para engrasar", "Harina normal de 30g / 1oz", "1½ cucharadita de mostaza inglesa en polvo", "3 cucharadas de vino blanco", "2 cucharadas de crema individual", "Queso Gruyère de 25 g / 1 oz, finamente rallado", "2 cucharadas colmadas de cebollines cortados", "Pan rallado blanco de 25g / 1oz, hecho con pan de un día sin costra", "Queso Gruyère de 25 g / 1 oz, finamente rallado", "3 cucharadas colmadas de perejil rizado finamente picado (opcional)", "sal marina escamada y pimienta negra recién molida"], "method": ["Corte cada vieiras en tres discos, colóquelas en un plato, cúbralas con una película adhesiva y déjelas enfriar en la nevera mientras se prepara la salsa. Frote la parte más profunda de cada concha de vieira con agua caliente y colóquela en un estante sobre una bandeja para hornear, y engrase el interior con mantequilla. Si no tiene conchas de vieira disponibles, utilice platos de gratinado poco profundos en su lugar. Precalentar el horno a 220C / 425F / Gas 7.", "Para hacer la salsa, vierta la leche en una olla pequeña y agregue la hoja de laurel y la cebolla. Revuelva bien y cocine a fuego lento. Retire del fuego y deje reposar durante 15 minutos. Colar a través de un tamiz fino en una jarra.", "Derrita la mantequilla en una olla antiadherente y agregue la harina y el polvo de mostaza. Cocine por 30 segundos, revolviendo constantemente. Poco a poco comience a agregar la leche infundida, revolviendo bien entre cada adición. Cuando se haya agregado toda la leche, mezcle el vino, la crema y el queso y cocine a fuego lento. Cocine por 3-4 minutos, revolviendo constantemente hasta que la salsa esté espesa y suave. Use un batidor de silicona para remover la salsa si tiene grumos.", "Retire la sartén del fuego y agregue las vieiras y el cebollín y sazone al gusto. Divida la carne de cangrejo entre las conchas untadas con mantequilla o los platos gratinados. Coloque la mezcla de vieiras de manera uniforme en las conchas preparadas, asegurándose de que cada una reciba tres rebanadas de vieiras.", "Mezcle las migas de pan con el queso rallado y el perejil, si se usan, y sazone con sal y pimienta. Espolvoree las migas de pan sobre la mezcla de vieiras. Hornee en el horno caliente durante 18-20 minutos hasta que estén dorados y burbujeantes. (Las vieiras deberían haberse vuelto opacas, pero permanecer dulces y tiernas).", "Sirve las vieiras y el cangrejo Mornay con una ensalada verde crujiente y un vaso de vino blanco frío."], "url": "www_bbc_co_uk_food_recipes_crab_and_scallop_mornay_42821", "title": "Cangrejo y vieira Mornay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para cubrir una pequeña sartén", "4 cucharadas de vinagre balsámico blanco", "500g / 1lb 1 oz tomates cherry en tallo", "1 cucharadita de azúcar", "sal al gusto", "½ cucharadita de pimienta negra", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 chile rojo, finamente picado", "2 dientes de ajo, finamente picados", "1 cucharada de puré de tomate", "3 tomates pelados", "2 cucharadas de vinagre de jerez", "buen azúcar pizca", "2 cucharadas de aceite de oliva", "1 chalote de plátano, finamente picado", "1 chile rojo, finamente picado", "1 jengibre raíz de la pieza del tamaño de un pulgar, pelado y finamente rallado", "2 patatas grandes, al horno", "2 cucharadas de carne de cangrejo marrón", "250 g / 9 oz de carne de cangrejo blanco", "1 limón, ralladura solamente", "1 cucharada de cebollino picado", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla ablandada", "aceite vegetal, para freír en grasa", "75g / 2½oz de harina blanca, sazonada con sal y pimienta", "2 huevos enteros de granja, golpeados", "100g / 3½oz de pan rallado"], "method": ["Para el confitado de tomate, ponga el aceite de oliva y el vinagre balsámico blanco en una sartén y caliente. Agregue los tallos de los tomates cherry, una pizca de azúcar y un poco de sal y cocine a fuego lento durante unos minutos.", "Agregue los tomates cherry y apague el fuego. Retire con cuidado los tallos. Agregue el azúcar restante y la pimienta negra y cocine a fuego lento durante 8-12 minutos, o hasta que se suavice un poco.", "Transfiera a un recipiente esterilizado y deje enfriar.", "Para la salsa de tomate, caliente el aceite de oliva en una sartén, agregue la cebolla, el chile y el ajo y fríalos hasta que se ablanden pero no se doren.", "Agregue el puré de tomate y revuelva para combinar. Agregue los tomates, sal y pimienta al gusto y luego cocine hasta que los tomates se hayan suavizado por completo. Agregue el vinagre de jerez y el azúcar y cocine hasta que quede pulposo.", "Retire del fuego y deje enfriar un poco y mezcle hasta que quede suave en un procesador de alimentos o licuadora. Pase a través de un colador en un tazón limpio para hacer una salsa suave.", "Para las bolas de cangrejo, caliente el aceite de oliva en una sartén y fría la chalota, el chile y el jengibre hasta que estén suaves. Sáquelo del fuego y apártelo.", "Empuje las papas al horno a través de un colador en un recipiente, descartando las pieles y agregue la carne de cangrejo marrón y blanca.", "Agregue los chalotes fritos, el chile y el jengibre.", "Agregue la ralladura de limón, el cebollín, la sal, la pimienta negra recién molida y la mantequilla y mezcle bien.", "Una vez que esté firme, humedezca sus manos y luego forme bolas. Coloque las bolas de cangrejo en un plato y déjelo reposar en el refrigerador.", "Caliente el aceite en una cacerola o freidora de grasa pesada a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina, el huevo y las migajas de pan en platos separados y sumerja suavemente cada bola primero en la harina, seguida por el huevo y luego las migas de pan.", "Freír las bolas de cangrejo en el aceite hasta que estén doradas y cocidas. Retire con una espumadera y transfiera a un plato forrado con papel de cocina.", "Sirva la salsa de tomate y confite el tomate con las bolas de cangrejo."], "url": "www_bbc_co_uk_food_recipes_crab_balls_with_tomato_02638", "title": "Bolas de cangrejo con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 patatas Maris Piper, peladas y cortadas en trozos", "sal y pimienta negra recién molida", "4 pinzas de cangrejo araña frescas, solo carne", "2 puñados de queso cheddar maduro", "1 huevo de gallinas camperas", "4 cebolletas, finamente picadas", "puñado de cebollín fresco, finamente picado", "½ limón, solo ralladura", "1 cucharada de salsa de chile dulce", "1 cucharada de mantequilla", "harina, para quitar el polvo"], "method": ["Llenar una sartén grande con agua con sal y llevar a ebullición. Agregue las papas y cocine hasta que estén suaves. Escurrir y macerar.", "En un tazón, combine la carne de cangrejo, el puré de papas, el queso, el huevo, la cebolleta, el cebollín y la ralladura de limón. Sazone al gusto con sal y pimienta negra recién molida. Agregue la salsa de chile dulce y revuelva.", "Espolvorea tus manos y una superficie de trabajo con harina. Use sus manos para acariciar la mezcla en pequeños pasteles circulares.", "Freír los pasteles en la mantequilla hasta que estén dorados en cada lado. Esto debería tomar unos 2-3 minutos en cada lado", "Sirva inmediatamente con una ensalada."], "url": "www_bbc_co_uk_food_recipes_crab_cakes_61455", "title": "Pasteles de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jengibre fresco de la raíz de los 2cm / 1in, pelado", "2 chiles rojos, semillas retiradas", "250 g / 9 oz de carne de cangrejo blanco", "1 cucharada de cilantro fresco tostado", "2 cebollas tiernas, finamente cortadas", "2 huevos de gallinas camperas", "7-8 cucharadas de pan rallado", "harina común, para quitar el polvo", "25ml / 1fl oz de aceite de oliva", "dulce de ají", "algunas hojas de ensalada de puñados", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida"], "method": ["Coloque el jengibre y el chile en un mini procesador de alimentos y pulse hasta que esté finamente picado.", "En un tazón, combine el chile y el jengibre con la carne de cangrejo blanca, el cilantro y las cebolletas. Agriete en un huevo y mezcle bien, luego agregue 4 cucharadas de pan rallado.", "Divida la mezcla de pastel de cangrejo en 6 porciones iguales y moldee en empanadas. Coloque en una bandeja y enfríe en la nevera durante aproximadamente 20 minutos antes de cocinar.", "Precalentar el horno a 180C / 365F / Gas 4.", "Batir el huevo restante en un tazón pequeño con una cucharada de agua para hacer un eggwash. Coloque un poco de harina y las migas de pan restantes en platos separados poco profundos.", "Draga un pastel de cangrejo en la harina, luego sumérgete en el huevo y cúbrelo con las migas de pan. Agite suavemente para eliminar el exceso de pan rallado. Repita con los pasteles de cangrejo restantes.", "Calentar el aceite de oliva en una sartén y freír los pasteles de cangrejo durante 2-3 minutos en cada lado, o hasta que estén crujientes y doradas por todas partes. Transfiera los pasteles de cangrejo a una bandeja para hornear y hornee durante 5-10 minutos, o hasta que la tubería esté caliente hasta el final.", "Sirva los pasteles de cangrejo con mermelada de chile dulce y una ensalada de hojas mixtas, ligeramente vestida con aceite de oliva, sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_crab_cakes_80855", "title": "Pasteles de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_cakes_80855_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "50g / 1¾oz de mantequilla, cortada en cubitos", "Harina normal de 75 g / 2½ oz", "½ cucharadita de pimienta de cayena", "2 huevos de gallinas camperas", "75g / 2½oz de carne de cangrejo blanca", "25g / 1oz de carne de cangrejo marrón", "sal y pimienta negra recién molida", "75 g / 2½ oz de azúcar en polvo", "2 chiles rojos, más o menos picados", "3 tomates de ciruela, toscamente picados", "8 hojas de lima", "2 tallos de limoncillo, hojas externas duras retiradas, finamente picadas", "25 g / 1 oz de jengibre fresco picado", "2 dientes de ajo, pelados, dejados enteros", "2 chalotes pequeños, toscamente picados", "4 cucharadas de salsa de pescado tailandés (nam pla)", "40ml / 1½fl oz de aceite de sésamo", "50ml / 2fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "3 limas, jugo y ralladura", "110 g / 4 oz de crema fresca", "2 yemas de huevo", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10 fl oz aceite de colza", "1 lima, ralladura y jugo", "Carne de cangrejo blanca 200 g / 7 oz", "50 g / 1¾oz de hojas de mizuna", "50g / 1¾oz de acedera roja", "½ manojo de menta fresca, hojas recogidas"], "method": ["Para los churros, caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente la mantequilla con 125ml / 4fl de agua en una olla hasta que la mezcla hierva, luego hierva por otro minuto.", "Retire del fuego y bata la harina y la pimienta con una cuchara de madera hasta que quede suave, o hasta que la mezcla se desprenda del costado de la sartén. Regrese la sartén al fuego y cocine por 1-2 minutos, revolviendo continuamente.", "Retire la sartén del fuego y bata en los huevos, uno a la vez, batiendo bien antes de agregar el otro huevo.", "Agregue la carne de cangrejo blanca y marrón hasta que esté bien combinada, sazone con sal y pimienta.", "Coloque la mezcla en una bolsa de plástico y pinte 1,5 cm / ½ en secciones largas en el aceite y fría por 1-2 minutos, o hasta que estén doradas y crujientes. Retire los churros y déjelos a un lado para escurrirlos sobre papel de cocina, sazone con sal.", "Para la mermelada de chile, caliente el azúcar en una cacerola de base pesada a fuego medio hasta que se derrita y forme un caramelo dorado (PRECAUCIÓN: el azúcar en ebullición es extremadamente caliente. Maneje con mucho cuidado).", "Mezcle todos los ingredientes restantes de mermelada de chile, excepto la crème fraîche, en un procesador de alimentos para obtener un puré suave.", "Una vez que el azúcar se haya caramelizado, agregue el puré y mezcle bien. Ponga la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que esté pegajoso y atascado. Retirar del fuego y reservar para enfriar. Una vez que esté frío, mezcle la crema fresca hasta que esté bien combinada.", "Para el cangrejo vestido coloque las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos y mezcle hasta que esté pálido y cremoso. Con el motor en marcha, vierta suficiente aceite, en un flujo constante, para hacer una mayonesa espesa. Mezcle la ralladura de lima y el jugo. Mezcle 4 cucharadas de la mayonesa en el cangrejo blanco fresco.", "Para la ensalada, mezcle las hojas en un tazón grande y cúbralas con un poco de mermelada de chile.", "Sirva las hojas de ensalada en un plato con el cangrejo, churros y mermelada de chile."], "url": "www_bbc_co_uk_food_recipes_crab_churros_with_chilli_14019", "title": "Cangrejo churros con mermelada de chile, cangrejo y mayonesa de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de carne de cangrejo marrón", "4 yemas de huevo de gallinas camperas", "1 cucharadita de nuez moscada recién molida", "200ml / 7fl de leche en oz", "Crema doble de 60 ml / 4 cucharadas", "125 g / 4½ oz de carne de cangrejo blanca", "1 cebolleta, finamente cortada", "2 cucharadas de aceite de oliva", "1 limón, solo jugo", "400g / 14oz de tomates pequeños, descuartizados", "sal y pimienta negra recién molida", "2 cucharadas de micro albahaca finamente picada, para servir"], "method": ["Precalentar el horno a 160C / 140 Fan / Gas 3.", "En un tazón, bata la carne de cangrejo marrón, las yemas de huevo, la nuez moscada, la leche y la crema. Condimentar con sal y pimienta.", "Pasar la mezcla a través de un colador en un recipiente limpio y grande, presionando todo el líquido fuera de la carne de cangrejo.", "Vierta la mezcla en cuatro platos de ramekin. Hornee durante 20 minutos o hasta que estén listos. Dependerá del tamaño de la cazuela. Deja enfriar.", "En un tazón limpio, mezcle la carne blanca de cangrejo con la cebolla tierna y el aceite de oliva.", "Coloque los tomates alrededor de las ollas de las natillas, cubra con una cuchara la mezcla blanca de carne de cangrejo, exprima el limón, espolvoree con la micro albahaca y sirva."], "url": "www_bbc_co_uk_food_recipes_crab_custard_and_salad_25711", "title": "Ollas de cangrejo al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de hojaldre laminado", "1 cebolla roja, finamente picada", "1 chile rojo, finamente picado", "1 cucharada de bálsamo de limón fresco picado", "1 papa, cocinada, finamente picada", "1 lima, ralladura solamente", "450g / 1lb de carne de cangrejo", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, golpeados", "200 g / 7 oz de cebollas bebé", "Azúcar demerara 100 g / 3½ oz", "10g / ¼ oz de mostaza en polvo", "125ml / 4½fl oz de vinagre de sidra", "1 diente de ajo, aplastado", "2 hojas de lima"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta la masa de hojaldre en seis cuadrados de 20cm / 8 pulgadas.", "Para el relleno, mezcle la cebolla roja, el chile, el bálsamo de limón, la patata, la ralladura de lima y la carne de cangrejo en un bol. Sazonar bien, luego cuchara la mezcla en la mitad de cada uno de los cuadrados de repostería.", "Cepille los bordes con huevo batido y doble para formar un triángulo, selle los bordes con los dientes de un tenedor y cepille todo con más huevo batido.", "Hornee en el horno por 25 minutos, o hasta que la masa esté dorada.", "Para el gusto, caliente las cebollas, el azúcar, la mostaza en polvo, el vinagre de sidra, el ajo y las hojas de lima en una olla hasta que hierva. Reduzca el fuego a fuego lento y cocine durante 30-40 minutos, revolviendo ocasionalmente, o hasta que espese.", "Sirve el condimento con los pastelitos de cangrejo."], "url": "www_bbc_co_uk_food_recipes_crab_pasty_34505", "title": "Pasteles de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]