[{"ingredients": ["4 filetes de caballa, pin-bones eliminados", "2 pak choi, cortado por la mitad", "200g / 7oz de judías verdes, coronadas y cocidas y cortadas en tres partes", "2 chiles rojos, más o menos picados", "3 tomates de ciruela, toscamente picados", "8 hojas de lima", "2 tallos de limoncillo, hojas exteriores duras retiradas, finamente picadas", "Jengibre de raíz 25g / 1oz, más o menos picado", "2 dientes de ajo, pelados", "2 chalotes pequeños, toscamente picados", "4 cucharadas de salsa de pescado tailandés", "40ml / 3 cucharadas de aceite de sésamo", "50ml / 2 fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "3 limas, jugo y ralladura", "150 g / 5½ oz de azúcar en polvo", "110g / 3oz de crema fresca", "4 cucharadas de berro de coriandro"], "method": ["Coloque la caballa en una bandeja para hornear y use un soplete de chef para cocinar rápidamente la caballa (o cocínelos bajo una parrilla muy caliente por unos minutos).", "Ponga a hervir una olla grande de agua, luego agregue el pak choi y los frijoles para blanquear durante 30 segundos. Drene, luego transfiera a agua muy fría para detener la cocción. Drene nuevamente y seque.", "Caliente una sartén grande y rocíe un poco de aceite sobre el pak choi. Cocine en la plancha caliente durante unos minutos en cada lado hasta que esté ligeramente carbonizado. Retire el pak choi y manténgalo caliente. Rocíe un poco de aceite sobre los frijoles y cocínelos por unos minutos hasta que estén ligeramente carbonizados.", "Para la mermelada de chile, ponga todos los ingredientes de mermelada de chile, excepto el azúcar y la crème fraîche, en un procesador de alimentos y mezcle hasta conseguir un puré suave.", "Caliente el azúcar en una cacerola de base pesada a fuego medio o bajo, hasta que se derrita y forme un caramelo dorado. No revuelva y vigílelo para que no se queme.", "Una vez que el azúcar se haya caramelizado, vierta cuidadosamente la mezcla de mermelada de chile picado y mezcle bien (la mezcla burbujeará mucho, así que tenga cuidado). Ponga la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que esté pegajoso y atascado. Retirar del fuego y reservar para enfriar un poco.", "Para servir, coloque un filete de caballa en un lado del plato y sirva el pak choi y los frijoles en el lateral. Rocíe la mermelada de chile sobre el pescado y decore con el berro de coriandro y una cuchara de crema fresca."], "url": "www_bbc_co_uk_food_recipes_fillet_of_mackerel_with_51845", "title": "Filete de caballa con pak choi caliente, frijoles y mermelada de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas 350g / 13oz", "1 bulbo pequeño de hinojo", "Panceta de 200 g / 7oz, cortada en tiras delgadas de aproximadamente 0.5 cm / ¼ de grosor, luego en juliana", "sal y pimienta negra recién molida", "4 x 150g / 5oz de filetes de lubina, pin boned", "echar aceite de oliva, para freír", "1 manojo de cebollas tiernas, peladas, finamente cortadas", "4 cucharadas de aceite de oliva virgen extra", "1 chalote, picado", "1 tomate mediano, sin semillas, cortado en cubitos", "½ lima, solo jugo", "1 cucharada de vinagre balsámico", "1 puñado de perejil fresco de flatleaf, picado"], "method": ["Para la lubina, precaliente el horno a 180C / 350F / Gas 4.", "Cocine las papas y el bulbo de hinojo en una sartén con agua hirviendo con sal durante 15 minutos o hasta que estén cocidos pero firmes.", "Cuele, pele y corte las papas y el hinojo en rodajas gruesas. Dejar de lado.", "Blanquee la panceta en una olla de agua hirviendo, luego drene y revuelva en agua fría. Escurrir una vez más y colocar sobre papel de cocina para secar.", "Sazone la lubina con sal y pimienta negra recién molida. Caliente una pizca de aceite de oliva en una sartén hasta que esté caliente y cocine el pescado con la piel hacia abajo durante cuatro minutos, o hasta que la piel comience a estar crujiente. Voltee el pescado y colóquelo en la bandeja del horno con la cara hacia arriba, luego colóquelo en el horno por otros seis minutos.", "Mientras tanto, agrega las papas, el hinojo y la panceta al mismo sartén que usaste para cocinar el pescado y freír durante un par de minutos, o hasta que las papas estén un poco doradas.", "Agregue las cebollas tiernas y fría por otros dos minutos - tenga cuidado de no romper las papas.", "Para salsa vierge, caliente brevemente el aceite de oliva en una cacerola pequeña a fuego lento durante unos 30 segundos. Agregue la chalota y fría por dos minutos. Retire del fuego, agregue el tomate, la lima y el vinagre balsámico y revuelva.", "En el último minuto agregue el perejil de flatillo picado y la sal y pimienta negra recién molida, al gusto.", "Para servir, vierta el ragoût en el plato, cubra con el pescado y luego vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_fillet_of_sea_bass_with_81407", "title": "Filete de lubina con ragoût de cebolleta y salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "Chalotes de 40 g / 1½ oz, finamente picados", "20g / ¾oz de champiñones, finamente picados", "10g de apio, finamente picado", "10g de apio nabo, pelado y finamente picado", "½ botella de champán", "200ml / 7fl oz de caldo de pollo", "200ml / 7fl oz crema", "1 ramita de perejil", "1 ramita de tomillo", "sal y pimienta", "1 limón, solo jugo", "½ coliflor pequeña", "Leche 250ml / 9fl oz", "75 g / 2½ oz de mantequilla", "75ml / 2½ fl oz crema", "4 x 150g / 5½oz de filetes de trucha de mar, deshuesados", "1 cucharada de aceite de oliva", "20g / ¾oz de mantequilla, más extra para freír", "60ml / 2¼fl oz de caldo de verduras", "12 lanzas de espárragos, peladas y cortadas en tres pedazos en un ángulo", "12 puerros tiernos, cortados en longitudes de 5cm / 2in", "50g / 1¾oz de mantequilla", "8 cebollas de grelot o cebollas de primavera", "2 cucharaditas de azúcar", "sal y pimienta negra recién molida", "40 g / 1½ oz de habas, blanqueadas y sin cáscara", "1 cucharada de cebollines finamente picados", "1 cucharada de perifollo finamente picado", "sal y pimienta negra recién molida", "1 limón, solo jugo"], "method": ["Para la salsa, freír las verduras suavemente en un poco de la mantequilla hasta que estén suaves pero no coloreadas.", "Agregue el champán y caliente hasta reducir el volumen a un jarabe. Luego agregue el caldo de pollo y cocine hasta que se reduzca a la mitad del volumen.", "Agregue la crema y las hierbas, deje hervir y cocine a fuego lento durante 5-10 minutos.", "Pase a través de un colador fino y sazone con sal y pimienta y termine con jugo de limón.", "Para hacer el puré de coliflor, corte los floretes de coliflor en rodajas finas, coloque en una sartén con la leche y 250 ml / 9 fl oz de agua. Llevar a ebullición, y cocine a fuego lento hasta que la coliflor esté tierna. Escurra y coloque en una licuadora con un par de cucharadas de líquido de cocción, la mantequilla y la crema, y ​​mezcle hasta obtener un puré. Sazonar con sal y pasar por un colador. Mantener caliente", "Para la trucha, corte el pescado en cuadrados y sazone con las sales.", "Caliente el aceite de oliva y un poco de mantequilla en una sartén y cocine el pescado con la piel hacia abajo hasta que quede dorado y apenas cocido. Agregue 20 g / oz de mantequilla y la mitad del caldo de verduras. Estofar el pescado en el caldo hasta que esté cocido.", "Para las habas, los puerros y los espárragos, cocine los puerros y los espárragos en los 30ml / 1fl oz restantes de caldo de verduras con la mantequilla, las cebollas, el azúcar, la sal y la pimienta hasta que estén casi cocidos. Agregue las habas y cocine en el glaseado por unos minutos más.", "Para servir, cuchara el puré de coliflor en el centro de las placas. Viste a la trucha en la parte superior. Coloque las verduras encima. Mezcle la salsa con una batidora para airear y espolvoree la espuma resultante sobre el pescado. Adorne con las hierbas frescas y sazone al gusto con sal, pimienta y jugo de limón."], "url": "www_bbc_co_uk_food_recipes_fillet_of_sea_trout_with_74118", "title": "Filete de trucha de mar con puerros tiernos, habas y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de suela de limón 4 x 250 g / 9 oz, piel quitada", "400g / 14oz de patatas nuevas, fregadas", "200g / 7oz de harina, condimentada con sal", "200ml / 7fl oz de mantequilla clarificada", "Pan rallado de 200 g / 7 oz panko", "110g / 4oz de mantequilla, cortada en cubitos", "2 cucharaditas de perejil de hoja plana finamente picado", "2 limones, cortados en cuñas, para adornar", "2 huevos de gallinas camperas, solo yemas", "pizca de sal", "20mls / 1fl oz de vinagre de vino blanco", "2 cucharaditas de mostaza inglesa en polvo", "100g / 3½oz de aceite de girasol", "100 g / 3½ oz de cebolla, finamente picada,", "100g / 3½oz de cornichons o pepinillos, finamente picados", "Anchoas de 30g / 1oz, finamente picadas", "2 cucharaditas de perejil, finamente picado", "10 g / ½ onza de cebollín, finamente picado", "Alcaparras finas de 30 g / 1 oz, finamente picadas", "pizca de cayena", "sal y pimienta blanca recién molida", "2 limones, solo jugo", "Alcaparras de 110 g / 4 oz, finamente picadas", "Pepinillos 150g / 5oz, finamente picados", "½ chalota, finamente picada", "1 manojo pequeño de eneldo fresco, finamente picado", "2 cucharadas de perejil fresco de hoja plana, finamente picado", "½ limón, solo jugo", "1 bolsa de ensalada fresca"], "method": ["Para el pescado, precaliente la parrilla a un nivel alto y engrase ligeramente una bandeja para hornear.", "Coloque una olla con agua sobre la placa y agregue las papas nuevas, lleve a ebullición y cocine durante 10-12 minutos hasta que estén suaves.", "Coloque el pescado hacia abajo y marque suavemente la parte posterior del pescado donde estaba la piel, esto ayudará a evitar que se encrespe mientras se cocina.", "Coloque la harina sazonada y la mantequilla clarificada en platos separados. Ahora ponga el pescado en la harina sazonada, sacuda el exceso y luego sumérjalo en la mantequilla clarificada. Asegúrese de que ambos lados del filete estén cubiertos. Ahora draga el pescado a través de las migas de pan.", "Coloque el pescado en la bandeja de horno preparada, espolvoree con un poco más de mantequilla clarificada y póngalo debajo de la parrilla para cocinar. No tomará mucho tiempo, tal vez cinco minutos como máximo.", "Escurra las papas y mezcle con la mantequilla picada, sal y pimienta y el perejil picado.", "Para la base de salsa, coloque las yemas de huevo en un tazón grande, agregue una pizca de sal y el vinagre y bata con la mostaza hasta que luzca de color, esponjoso y espeso un poco.", "Lentamente rocíe el aceite de girasol de manera constante, batiendo todo el tiempo. Cuando todo esté mezclado, revise el condimento y divídalo entre dos cuencos.", "Para la salsa Remoulade, agregue los ingredientes remoulade a uno de los tazones de huevo y la mezcla de aceite, mezcle bien y sazone al gusto con sal y pimienta negra recién molida.", "Para la salsa tártara, agregue los ingredientes tártaros al otro tazón, mezcle bien y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque el pescado en platos para servir con una cucharada de patatas nuevas y una rodaja de limón. Agregue las salsas en el lado. Muy bien servido con una ensalada verde simple."], "url": "www_bbc_co_uk_food_recipes_fillet_of_sole_98546", "title": "Filete de lenguado Saint-Germain con salsa remoulade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, ablandada", "1 chalote pequeño, finamente picado", "1 diente de ajo, finamente picado", "2 cucharaditas de alcaparras, finamente picadas", "2 cucharaditas de pepinillos finamente picados", "1 cucharadita de anchoas finamente picadas", "1 cucharadita de cebollines finamente picados", "1 cucharadita de perifollo finamente picado", "1 cucharadita de estragón finamente picado", "1 cucharadita de perejil de flatleaf finamente picado", "1 cucharadita de hojas de tomillo", "1 hoja de laurel", "2 cucharaditas de curry en polvo", "4 papas medianas Maris Piper, peladas", "50 g / 1¾oz de mantequilla sin sal", "300ml / 10fl oz de caldo de pollo fresco", "Zanahorias baby 150g / 5½ oz", "50 g / 1 oz de azúcar en polvo", "50ml / 1¾fl oz de caldo de pollo", "75g / 2½oz de mantequilla sin sal", "Guisantes rápidos del azúcar 150g / 5½oz", "2 cucharadas de aceite de oliva", "4 x 140g-175g / filetes de filete 5-6oz"], "method": ["Para la mantequilla de hierbas con especias, coloque todos los ingredientes en un procesador de alimentos grande y mezcle hasta que quede suave. Coloque un trozo de papel de aluminio sobre la superficie de trabajo y coloque la mantequilla mezclada en una línea a lo largo de la lámina. Enrolla la mantequilla en papel de aluminio en un cilindro, aprieta en ambos extremos y colócalo en el refrigerador para ponerlo.", "Para las papas fondant, recorte ambos extremos de las papas y use un pelador para darles forma de barril. Caliente una sartén grande y agregue la mantequilla. Una vez derretido, agregue las papas y fría hasta que estén doradas.", "Agregue el caldo de pollo y cocine durante 20-30 minutos hasta que estén blandos, pero sin deshacerte, deben mantenerse juntos.", "Para hacer las verduras glaseadas, coloque las zanahorias, el azúcar, el caldo de pollo y la mantequilla en una cacerola a fuego medio y cocine durante 10 minutos. Sáquelo del fuego y apártelo.", "Mientras tanto, coloque una olla pequeña sobre el fuego y agregue agua. Una vez que hierva, agregue las brochetas de azúcar. Cocine por 4-5 minutos, escurra y refresque en agua fría antes de dejar de lado.", "Para el bistec, coloque una sartén grande a fuego alto. Una vez caliente, agregue el aceite y luego cocine el bistec durante dos minutos en cada lado, o hasta que esté cocido a su gusto. Coloque una rebanada de mantequilla especiada en la parte superior de los filetes y colóquela debajo de la parrilla durante 1-2 minutos, o hasta que la mantequilla se haya derretido.", "Para servir, coloque una sartén a fuego medio y agregue un poco del licor de cocina de zanahoria. Agregue las zanahorias y los chícharos con azúcar y cocine durante unos minutos o hasta que estén calientes.", "Coloque las verduras en un lado de cada plato y una patata fondant en el lado opuesto. Coloque el bistec en el medio y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fillet_steak_with_a_94163", "title": "Solomillo con mantequilla de hierbas especiadas y patatas fondant", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["550ml / 1 pinta de leche entera", "250g / 9oz de apio nabo, pelado, rallado", "Salto 4g / ⅛oz", "1 hoja de laurel", "Agar agar 8g / ¼ oz", "20g / ¾oz de avellanas peladas", "20 g / ¾ oz de parmesano, rallado", "40ml / 1½ fl oz aceite de avellana", "Aceite de semilla de uva 10ml / ½floz", "1 g de sal", "pimienta blanca recién molida", "1 apio nabo medio, cortado en ocho piezas", "8 gotas de aceite de trufa negra", "1 cucharada de aceite de semilla de uva", "1 repollo savoy medio, rallado", "75g / 3oz de mantequilla", "250ml / 9fl oz de caldo de pollo", "Filetes de rodaballo de 8 x 110 g / 4 oz", "4 cucharadas de aceite de semilla de uva"], "method": ["Coloque el apio nabo rallado en una cacerola con la leche, la sal y la hoja de laurel y deje que hierva. Baje el fuego y cocine a fuego lento durante 30 minutos, revolviendo regularmente. Pase la mezcla a través de un colador, deseche el apionabo y luego pase la leche a través de un colador fino en una olla limpia. Transfiera la leche infundida a un plato poco profundo.", "Coloque el plato sobre una rejilla de alambre. Coloque el estante sobre astillas de madera de roble en un ahumador casero o en una barbacoa de tetera, cúbralo con una tapa y ponga a fuego medio durante cinco minutos.", "Retire la leche del ahumador y mida 500 ml / 17 fl oz de líquido. Transfiera la leche a una cacerola mediana. Agregar el agar agar, llevar a ebullición, batiendo continuamente, durante dos minutos. Vierta el contenido de la sartén en un plato poco profundo y déjelo a un lado para enfriarlo y ponerlo.", "Una vez enfriado y completamente preparado, transfiera la mezcla a un procesador de alimentos y mezcle hasta obtener un puré suave. Sazone, al gusto, con sal, transfiera la mezcla a un recipiente y cubra con film transparente. Enfriar en la nevera hasta que se requiera.", "Precalentar el horno a 150C / 300F / Gas 2.", "Para el pesto de avellana y parmesano, coloque las avellanas en una bandeja de asar y tueste en un horno durante 10 minutos.", "Retire del horno, transfiera a un recipiente de acero inoxidable y triture hasta obtener una miga fina con un rodillo. Agregue el parmesano, los aceites, la sal y la pimienta blanca recién molida. Revuelva hasta que esté bien combinado y déjelo a un lado.", "Para el apio nabo cocido, pele los bordes para limpiar los trozos de apio nabo y colóquelos en un tazón. Mezcle los dos aceites y agregue al tazón de apio. Revuelva hasta que todas las piezas de apio estén bien cubiertas y agregue una generosa pizca de sal y pimienta blanca recién molida.", "Coloque una hoja grande de papel de aluminio sobre una superficie de trabajo y cubra con otra pieza del mismo tamaño. Coloque el apionabo en el centro de la lámina. Dobla un extremo sobre el otro y dobla sobre la reunión para sellar. Doble sobre los bordes laterales para crear una bolsa sellada.", "Transfiera la bolsa a una bandeja para hornear y cueza al horno por 40 minutos. Retire del horno, abra la bolsa y verifique que el apionabo esté suave insertando un pincho o un palillo de dientes.", "Coloque una cacerola grande de base pesada a fuego medio durante un minuto. Agregue la mantequilla, permita que se derrita y luego agregue el repollo y una pizca de sal. Cocine por 3-4 minutos, revolviendo frecuentemente, hasta que el repollo se ablande.", "Agregue 100 ml / 3½ fl oz de caldo de pollo, tape y cocine por 3-4 minutos más, o hasta que el repollo esté solo tierno. Dejar de lado a temperatura ambiente.", "Coloque dos sartenes grandes y pesadas a fuego alto durante un minuto. Agregue dos cucharadas de aceite de semilla de uva a cada uno. Sazonar el lado de la piel del rodaballo con sal y freír el pescado durante 1-2 minutos hasta que se dore.", "Agregue la mitad de la mantequilla a cada sartén, voltee el pescado, agregue 75 ml / 3 fl oz de caldo de pollo a cada bandeja y transfiéralo al horno. Cocine por tres minutos junto con el apionabo.", "Retire el pescado del horno, cubra cada porción con una cucharada de pesto y déjelo reposar durante cinco minutos.", "Caliente a través del puré de leche de apio nabo y la col.", "Coloque ocho grandes placas precalentadas. Coloque una cucharada de puré en la parte superior de cada plato y arrastre la cuchara para untar el puré alrededor de la mitad del plato.", "Desenvuelva el apio nabo cocido y transfiera una pieza a cada plato.", "Coloque un lecho plano de repollo en el centro del plato, coloque un pedazo de rodaballo en la parte superior y espolvoree algunos de los jugos mantecosos alrededor del pescado."], "url": "www_bbc_co_uk_food_recipes_fillet_of_turbot_with_33580", "title": "Filete de rodaballo con puré de apio ahumado, repollo con mantequilla y pesto de avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 chalotes, pelados, raíces cortadas", "60 g / 2¼ oz de mantequilla", "1 cucharada de azúcar en polvo", "75 ml / 2 ½ fl oz de vino tinto", "50ml / 2fl oz puerto", "50ml / 2fl oz de crème de cassis", "250 ml de caldo de carne", "1 hoja de laurel", "½ cucharadita de tomillo seco", "½ limón, solo ralladura", "4 filetes gruesos de filete (pregunte a su carnicero por filetes cortados del centro del filete)", "150g / 5½oz de queso de cabra suave", "1 cucharadita de romero finamente picado", "1 limón, ralladura solamente", "1 diente de ajo, aplastado", "4 lonchas de tocino rayado, sin corteza", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para los chalotes confitados, hierva una olla de agua. Cocine a fuego lento las chalotas en el agua durante 5 minutos, luego escurra. Caliente la mantequilla en una sartén, agregue los chalotes y cocine a fuego medio hasta que estén ligeramente dorados. Agregue el azúcar, caliente suavemente y revuelva hasta que el azúcar comience a caramelizar.", "Mezcle el vino, el puerto, la casis y el caldo en una jarra. Agregue aproximadamente una cuarta parte de esto a la sartén de chalotes, deje hervir, luego agregue la hoja de laurel, el tomillo y la ralladura de limón. Continúe agregando el líquido restante gradualmente, reduciéndolo cada vez, hasta que los chalotes estén cubiertos con un glaseado pegajoso precioso, luego déjelos a un lado hasta que los necesite.", "Para los filetes, saque los filetes de la nevera una hora más o menos antes de cocinarlos para que estén a temperatura ambiente.", "Desmenuce el queso en un tazón, luego agregue el romero, la ralladura de limón y el ajo.", "Con un cuchillo afilado, corte un bolsillo horizontalmente en cada filete, teniendo cuidado de no cortar todo el filete. Coloque una cuarta parte del relleno de queso en cada bolsillo. Cierre la tapa, y envuelva una loncha de tocino alrededor de cada filete, ayudando a sellar el bolsillo. Seguro con un palito de cóctel.", "Frote el aceite de oliva sobre los filetes, luego espolvoree sal y pimienta para sazonar.", "Caliente la sartén hasta que esté caliente y fría los filetes durante 3-4 minutos por cada lado (por el medio) o hasta que estén cocidos a su gusto. Para un bistec grueso de 2,5 cm / 1 pulgada, 2-3 minutos por cada lado le dará un bistec raro, 3-4 minutos por lado le dará un bistec medio raro; y 4-5 minutos por lado le dará un bistec de mediano a bien hecho.", "Permita que los filetes descansen por 5 minutos. Mientras tanto, calienta suavemente los chalotes. Sirva los filetes con los chalotes confitados."], "url": "www_bbc_co_uk_food_recipes_fillet_steaks_stuffed_22262", "title": "Filetes rellenos de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fillet_steaks_stuffed_22262_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 400 g / 14¼ oz, cortado en 6 medallones", "600g / 1lb 5oz de tomate picado en lata italiano", "2 dientes de ajo, finamente picados", "90ml / 3¼fl oz de aceite de oliva", "1 bola de mozzarella, escurrida y finamente cortada", "pizca de orégano seco", "6 rebanadas de pan de ciabatta, tostadas", "sal y pimienta negra recién molida"], "method": ["En una sartén caliente, dore el filete por ambos lados (aproximadamente dos minutos por lado para el medio raro).", "En una sartén separada (30 cm / 12 pulgadas de diámetro) freír el ajo en el aceite de oliva hasta que esté dorado. Agregue los tomates, sazone con sal, pimienta y orégano.", "Agregue el bistec cocinado a la salsa y continúe cocinando durante aproximadamente tres minutos hasta que se haya evaporado algo del agua de los tomates.", "En la misma sartén en la que cocinó el bistec, ase la chapata.", "Coloque tres rebanadas de chapata en un triángulo en un plato. Luego coloque tres medallones en el medio.", "Cubra con unas rodajas de mozzarella y luego vierta un poco de la salsa de pizza. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_filletoalapizzaiola_72229", "title": "Filleto à la pizzaiola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de res (aproximadamente 360 ​​g / 13 oz)", "1 clara de huevo", "1 cucharada de mostaza inglesa", "2 huevos", "290ml / ½pt de leche", "2 cucharadas de harina, tamizada", "puñado de hierbas del bosque picadas (como perifollo, estragón, cebollín)]", "sal y pimienta", "1 pedazo de hojaldre", "1 huevo (para lavar huevos)", "2 puñados de espinaca", "8 cucharadas de crema doble", "nuez moscada"], "method": ["Batir los huevos y la leche para los panqueques. Bata lentamente un poco de harina tamizada hasta que tengas una consistencia de rebozado.", "Justo antes de hacer los panqueques, agregue las hierbas picadas y un poco de aderezo a la mantequilla. Hacer tres panqueques y freír. Dejar enfriar.", "Selle el filete de res en una sartén caliente con un poco de aceite. Dejar enfriar y luego aplicar una mezcla de clara de huevo cruda y mostaza inglesa.", "Envuelva la carne en los panqueques de hierbas (una capa de espesor en todos los sentidos).", "Estirar un pedazo de hojaldre lo suficientemente grande como para envolver generosamente la carne. Cepille con la colada de huevo y selle la masa alrededor de la carne.", "Cepille la parte superior con un lavado de huevos antes de hornear.", "Hornee sobre papel de silicona durante aproximadamente 12 minutos a 180 ° C / 350 ° F / Gas 4 y déjelo reposar durante 5 minutos.", "Escalde las espinacas en agua caliente y revuelva en agua fría. Reduzca la crema doble a fuego lento y agregue las espinacas.", "Cuando la mezcla sea espesa y rica, retírela del fuego y déjela reposar.", "Cortar la carne y cubrir con la espinaca. Servir."], "url": "www_bbc_co_uk_food_recipes_filletofbeefencroute_67684", "title": "Filete de carne en croute con crema de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de vinagre de sidra o vinagre de vino blanco", "250ml / 9fl oz de agua", "5-6 piezas de tallos de cilantro, lavados", "40 g / 1½ oz de azúcar en polvo", "35g / 1¼ oz cebolla roja, finamente rebanada", "½ cucharadita de granos de pimienta rosa enteros", "3-4 rodajas de limón", "2 caballas enteras, fileteadas, sin espinas", "1 cucharada de aceite", "1 cucharada de salsa de soja", "1 cucharada de agua", "1 lima, solo jugo", "1 cucharadita de jengibre fresco, pelado, finamente cortado en cubos", "½ cucharadita de azúcar moreno oscuro", "1 cucharadita de semillas de hinojo, remojadas en agua durante 2 horas, escurridas y tostadas en una sartén seca", "1 bulbo de hinojo, finamente cortado en una mandolina, rodajas remojadas en agua helada durante 20 minutos, escurridas", "1 cucharada de aceite de oliva", "½ lima, solo jugo", "1 manojo de cohetes", "2 pizcas de sal marina", "1 pizca de pimienta de cayena"], "method": ["Para la caballa, caliente el vinagre de sidra, el agua, los tallos de cilantro, el azúcar impalpable, la cebolla roja, los granos de pimienta y las rodajas de limón en una cacerola mediana a fuego medio. Caliente la mezcla hasta que esté tibia (aproximadamente 60 ° C), luego retírela del fuego. Transfiera el contenido de la bandeja a un recipiente plano y poco profundo y déjelo enfriar.", "Cuando la mezcla se haya enfriado, coloque los filetes de caballa en el recipiente con la carne hacia abajo. Dejar de lado para marinar durante 20 minutos.", "Para el aderezo de soja y lima, combine todos los ingredientes del aderezo en una sartén pequeña y caliente hasta que el azúcar se haya disuelto. Establecer a un lado.", "Precalentar la parrilla a su configuración más alta.", "Cuando los filetes de caballa se hayan marinado, quítelos del adobo y séquelos con papel de cocina. Haga varios puntajes diagonales en la piel, recorriendo la longitud de cada filete para evitar que se encrespen durante la cocción.", "Cepille una bandeja para hornear con aceite. Coloque los filetes de caballa en la bandeja engrasada, con los costados hacia arriba. Coloque debajo de la parrilla y cocine durante 4-5 minutos, o hasta que la piel esté crujiente y la carne esté bien cocida.", "Para la ensalada, combinado. todos los ingredientes de la ensalada en un tazón grande.", "Para servir, divida la ensalada de hinojo en partes iguales entre cuatro platos para servir. Coloque un filete de caballa a la parrilla en la parte superior de cada porción. Coloque el aderezo de ensalada alrededor del borde del plato. Dispersar sobre las semillas de hinojo tostadas restantes."], "url": "www_bbc_co_uk_food_recipes_filletofmackerelwith_93673", "title": "Caballa a la parrilla con salsa de soja y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletofmackerelwith_93673_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / fl oz aceite de oliva ligero", "puñado de hojas de romero fresco, finamente picado", "2 cucharadas de miel de azahar", "2 chalotes, muy finamente picados", "110 g / 4½ oz de lomo de cordero o filete", "10 largos y robustos tallos de romero, despojados de dos tercios de las hojas, dejando un chorro de hojas en la punta", "sal marina y pimienta negra recién molida"], "method": ["Para hacer el adobo de aceite de romero, calentar suavemente el aceite de oliva en una sartén a fuego lento hasta que esté tibia y luego agregar las hojas de romero, miel y chalotes. Retire del fuego y reserve para infundir hasta que se enfríe.", "Cuando el aceite esté completamente frío, cuele a través de un colador y viértalo sobre el cordero. Cubra y coloque en el refrigerador para marinar durante 24 horas.", "Precaliente el horno a 180C / 355F / Gas 4.", "Retire el cordero del adobo y sazone, al gusto, con sal marina. Caliente una sartén a fuego alto y cocine el cordero durante 2-3 minutos, volteándolo ocasionalmente, hasta que se dore por todos lados. Transfiera a una bandeja para hornear y tueste en el horno durante 5-7 minutos, o hasta que el cordero esté cocido pero todavía rosado en el medio.", "Retire del horno y deje reposar por 10 minutos.", "Para servir, esculpe el cordero en 10 rebanadas y ensarte cada rebanada en un \"pincho\" de romero. Sazonar, al gusto, con pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_filletoflambmarinate_92826", "title": "Filete de cordero marinado en chalotas y miel, rosado asado y servido en ramas de romero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["275ml / 10fl oz de jugo de zanahoria recién exprimido", "1 pedazo grande de jengibre fresco, pelado, finamente picado, exprimido en una toalla de té limpia para recoger el jugo", "110g / 4oz de mantequilla salada", "sal y pimienta negra recién molida", "4 King Edward u otras patatas harinosas, peladas, cortadas en cubos", "2 cucharadas de aceite de oliva", "1 ramita de romero fresco", "1 ramita de tomillo fresco", "12 dientes de ajo, piel sobre", "2 filetes de cerdo de 375 g / 13 onzas, recortados", "25 g / 1 fl oz aceite de colza", "2 cucharadas de miel clara", "4 cucharadas de semillas de sésamo"], "method": ["Precalentar el horno a gas 200C / 400F / Gas 6.", "Coloque el jugo de zanahoria y el jugo de jengibre en una sartén a fuego medio y deje que hierva. Cocine para reducir a aproximadamente 150 ml / 5 fl oz de líquido, luego bata lentamente en 30 g / 1 oz de la mantequilla. Sazonar, al gusto, con sal y pimienta negra recién molida y dejar de lado.", "Calentar una sartén y agregar 50 g / 2 oz de la mantequilla y el aceite de oliva. Agregue las papas y fría a fuego alto hasta que comiencen a dorarse.", "Agregue las hierbas y el ajo y continúe freír hasta que las papas estén cocidas.", "Caliente una sartén limpia hasta que esté caliente, agregue el aceite de colza y la mantequilla restante 30 g / 1 oz. Una vez que la mantequilla esté espumosa, agregue los filetes de cerdo y fría, volteándolos ocasionalmente, hasta que estén dorados por cada lado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Retire de la sartén y colóquelo en un plato. Rocíe con la miel y cubra bien con las semillas de sésamo.", "Transfiera la miel y los filetes de cerdo recubiertos de sésamo a un salvamanteles en una bandeja de asar y colóquelos en el horno para cocinar durante 10-12 minutos o hasta que estén completamente cocidos. Retire del horno y deje reposar en un lugar cálido durante cinco minutos.", "Para servir, esculpe el cerdo en rebanadas diagonales gruesas. Coloque las papas en el centro de cada plato. Cubra con la carne de cerdo y cuchara sobre la salsa de zanahoria y jengibre."], "url": "www_bbc_co_uk_food_recipes_filletofporkwithhone_88831", "title": "Filete de cerdo con miel y semillas de sésamo, salsa de zanahoria y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 250ml / fl oz", "1 cucharadita de mostaza Dijon", "1 cucharadita de mostaza inglesa", "1 cucharadita de rábano picante cremado", "1-2 cucharaditas de jugo de limón", "sal", "1 cucharada de cebolletas frescas cortadas", "750 g / 1 libra de filete de salmón sin piel de 10 oz", "sal", "pimienta negra recién molida", "harina blanca lisa, para dragado", "1 cucharada de aceite vegetal", "1 bsp de mantequilla", "verduras cocidas con mantequilla, como las espinacas, para servir (opcional)", "2 cucharadas de rábano picante a la crema", "1 yema de huevo", "100g / 4oz de pan rallado grueso", "1 cucharada de perejil fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Primero prepare la salsa de crema de cebollino. Hervir la crema en una cacerola durante dos minutos o hasta que se espese un poco.", "Retire del fuego y mezcle las mostazas, el rábano picante y el jugo de limón y pruebe el condimento, agregue un poco más de sal o jugo de limón si es necesario. Mantenga la salsa caliente, pero no la deje hervir nuevamente o los sabores de la mostaza y el rábano picante se echarán a perder.", "Para preparar el salmón, verifique que haya sido cortado adecuadamente y que no tenga hueso. Si quedan huesos, quítelos con un par de pinzas. Corta el salmón en cuatro porciones iguales. Sazone cada pieza con sal y pimienta y luego drague ligeramente con harina.", "Para la corteza de rábano picante, mezcle el rábano picante y la yema de huevo. Sumerja la parte superior de cada pieza de salmón en la mezcla de rábano picante / yema de huevo, asegurándose de que cada filete esté generosamente cubierto.", "Mezcle las migas de pan y el perejil y luego sumerja cada trozo de pescado en el pan rallado. Forme la costra presionando esta mezcla sobre los filetes suavemente pero con firmeza, con sus manos.", "Para cocinar el salmón, caliente el aceite en una sartén pesada hasta que esté muy caliente. Agregue los filetes, con la corteza hacia abajo, con la mantequilla y cocine durante tres minutos o hasta que las migas de pan estén comenzando a crujir bien. Voltee los filetes y termine de cocinar en el horno por cinco minutos.", "Para servir, agrega las cebolletas a la salsa. Coloque cada filete en un plato caliente, colóquelo en una cama de verduras cocidas con mantequilla, si lo desea (las espinacas son una buena opción) y rodee con un poco de la salsa."], "url": "www_bbc_co_uk_food_recipes_filletofsalmonwithah_72028", "title": "Filete de salmón con salsa de rábano picante", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "puñado de tomates cherry", "2 cucharadas de azúcar", "Filete de lubina de 170g / 6oz", "sal marina y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "Cohete de 25g / 1oz", "3 cucharadas de vinagre balsámico", "Cohete de 25g / 1oz", "aceite de oliva", "pequeño manojo de cebollín fresco, finamente picado, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los tomates, caliente el aceite a fuego lento en una sartén a prueba de horno. Agregue los tomates y el azúcar y colóquelos en el horno durante 10-12 minutos. Retire del horno y reserve.", "Mientras tanto, para la lubina, condimente el filete con sal y pimienta negra recién molida, y calce el lado de la piel con un cuchillo.", "Caliente el aceite y la mantequilla en una sartén grande a fuego medio. Agregue el filete de lubina, con la piel hacia abajo y cocine durante dos minutos.", "Voltee el filete y cocine por otros 30 segundos, o hasta que esté cocido, luego retírelo de la sartén y déjelo a un lado en un lugar cálido.", "Rasgue las hojas del cohete y agregue a la misma sartén con el vinagre balsámico. Cocine por cinco minutos para reducir el vinagre balsámico a una salsa espesa.", "Para la ensalada, coloque el cohete en un recipiente y rocíe con aceite de oliva.", "Para servir, coloque la ensalada de cohetes en un plato grande y cubra con la lubina. Rocíe la lubina con los jugos de pan balsámico y de rúcula y espolvoree cebollino. Coloque los tomates tostados alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_filletofseabasswiths_79881", "title": "Filete de lubina con tomates agridulces y vinagre balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de hinojo, trituradas", "2 cucharadas de hojas de hinojo picado, desde la parte superior de las bombillas de hinojo", "4 x 175 g / 6 oz de filetes de salmón", "1-2 cucharadas de aceite de oliva ligero", "sal y pimienta negra recién molida", "150ml / 5fl oz de vino tinto", "4 chalotes, pelados y finamente picados", "125g / 4½oz de mantequilla sin sal", "1 cucharada de azúcar", "sal", "Patata harinosa de 400g / 14oz (como King Edwards), pelada, picada", "60g / 2½oz de mantequilla sin sal", "Bulbo de hinojo 750g / 1lb10oz, cortado y más o menos picado", "2 cucharaditas de semillas de hinojo, trituradas", "400ml / 14fl oz de crema individual", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta.", "Para el salmón, mezcle las semillas de hinojo y las hojas de hinojo picadas en un tazón.", "Cepille cada filete de salmón con un poco de aceite y sazone bien con sal y pimienta negra recién molida.", "Frote una buena capa de la mezcla de hinojo en los filetes de salmón, presionando suavemente pero con firmeza en cada filete para asegurar que el recubrimiento se adhiera.", "Coloque los filetes de salmón, con el lado recubierto hacia abajo, en una bandeja para hornear ligeramente engrasada. Coloque debajo de la parrilla y cocine durante 3-4 minutos, dependiendo del grosor del filete de pescado. Con cuidado, voltee los filetes y ase el lado recubierto del salmón (el recubrimiento se dorará y se dorará ligeramente). Ase a la parrilla durante otros 3-4 minutos o hasta que esté completamente cocida.", "Para la vinagreta, coloque el vino tinto y los chalotes en una sartén pequeña a fuego medio y deje que hierva. Baje el fuego ligeramente y cocine a fuego lento hasta que el vino se haya reducido a la mitad.", "Baja la temperatura y bate la mantequilla un poco a la vez. No permita que esta salsa vuelva a hervir.", "Sazonar, al gusto, con el azúcar y la sal, y mantener en un lugar cálido hasta que esté listo para servir.", "Para el puré de hinojo, coloque las papas en una cacerola a fuego alto, cúbralas con agua y deje que hiervan. Reduzca el fuego y cocine a fuego lento, hasta que esté cocido, luego drene y regrese a la sartén. Aplaste las papas hasta que queden suaves, luego déjelas a un lado.", "Caliente una sartén grande hasta que esté caliente, luego agregue la mantequilla, el hinojo y las semillas de hinojo y freír suavemente durante unos 10-15 minutos, a fuego lento, con la tapa puesta, hasta que todas las piezas de hinojo estén blandas.", "Agregue la crema, aumente el fuego y hierva. Reduzca el fuego a fuego lento durante 4-5 minutos, hasta que la crema se espese un poco y el hinojo esté completamente cocido.", "Transfiera la mezcla de hinojo a un procesador de alimentos y mezcle hasta obtener un puré suave, luego vierta en la sartén de puré de papas. Revuelva bien y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada del puré de patatas en el centro de cada plato. Cubra cada uno con un filete de salmón y ponga la vinagreta alrededor."], "url": "www_bbc_co_uk_food_recipes_filletofsalmonwithfe_85070", "title": "Filete de salmón con puré de hinojo y patatas y vinagreta de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de carne de venado de 500 g / 1 lb 2 oz, cortado y cortado en medallones gruesos de 2.5 cm", "5 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre balsámico", "1 zanahoria, finamente picada", "1 cebolla, finamente picada", "sal y pimienta negra recién molida", "100g / 3½oz de mantequilla sin sal", "2 cebollas pequeñas, muy finamente cortadas", "40 g / 1½ oz de colmenillas secas, empapadas en agua tibia durante 2 horas, escurridas (reservar el agua)", "150g / 5oz de hongos porcini frescos, rebanados gruesos", "2 cucharadas de vinagre balsámico (envejecido por 10-15 años)", "4 cucharadas de jerez seco", "6 cucharadas de crema doble", "sal y pimienta negra recién molida", "1 trufa de verano, opcional"], "method": ["Para la carne de venado, el día antes de cocinar, coloque el venado en un plato y cúbralo con tres cucharadas de aceite de oliva y todo el vinagre balsámico, la zanahoria y la cebolla. Sazonar bien con sal y pimienta negra recién molida y colocar en la nevera para marinar durante la noche.", "Para la salsa, caliente una sartén no reactiva hasta que esté caliente. Agregue la mantequilla y las cebollas y fría la cebolla durante 2-3 minutos, hasta que se ablanden.", "Agregue las colmenillas y cocine por 10 minutos.", "Agregue los porcini y fría por otros 3-5 minutos.", "Agregue el vinagre balsámico, el jerez y la crema y cocine a fuego lento durante 10 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. (La salsa puede volverse bastante espesa, así que agregue un poco de agua en remojo a la sartén).", "Para cocinar la carne de venado, quite la carne de venado del adobo, seque con papel de cocina y sazone bien con sal y pimienta negra recién molida.", "Calentar una sartén por separado hasta que esté caliente. Agregue las dos cucharadas restantes de aceite de oliva y los filetes de carne de venado. Freír la carne de venado en cada lado durante 3-4 minutos, hasta que se dore por fuera, pero aún rosado por dentro, o hasta que esté cocido a su gusto.", "Para servir, espolvorea la salsa de champiñones sobre los platos calentados, luego completa con los filetes de carne de venado. Afeite un poco de trufa de verano en la parte superior, si lo usa."], "url": "www_bbc_co_uk_food_recipes_filletofvenisonandwi_89763", "title": "Filete de venado y salsa de champiñones", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletofvenisonandwi_89763_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de nabos bebé", "1 manojo de zanahorias", "50ml / 1¾fl oz de aceite de oliva", "1 cebolla roja cortada en pétalos", "400g / 7oz de quinua", "2 cucharadas de azúcar en polvo", "150ml / 5¼fl oz de vinagre de vino de arroz", "75g / 2½oz sultanas", "¼ manojo de albahaca", "¼ de coriandro", "¼ manojo de menta", "1 limón, solo jugo", "3 racimos de cilantro, hojas recogidas", "Cubos de hielo de 200 g / 7 oz", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10fl oz de aceite vegetal", "1 cucharada de Yuzuji", "2 huevos de gallinas camperas, golpeados", "3 cebollas, cortadas en anillos", "Harina normal de 60g / 4oz", "60g / 4oz de harina de gramo", "1 cucharadita de cilantro molido", "4 cucharadas de cilantro fresco picado", "2 cucharadas de semillas de comino, tostadas", "3 cucharadas de aceite vegetal, más extra si es necesario", "2 filetes de lubina, sin piel", "50g / 2oz de mantequilla sin sal", "2 cucharadas de berro de coriandro", "2 cucharadas de berro de albahaca"], "method": ["Coloque una olla mediana de agua hirviendo sobre la placa y blanquee los nabos y las zanahorias. Escurrir y apartar.", "Coloque una sartén mediana al fuego y agregue el aceite, una vez caliente agregue los pétalos de la cebolla. Cocine por un par de minutos hasta que los colores de cebolla, retire de la sartén y coloque las cebollas a un lado y mantenga la sartén para el pescado.", "Cocine la quinoa en agua o en remojo de acuerdo con las instrucciones del paquete y colóquela en un tazón de vidrio grande.", "Coloque el azúcar y el vinagre en una olla mediana y caliente hasta que el azúcar se haya disuelto. Agregue las pasas y la cebolla y caliente hasta que las pasas se hayan hinchado y la cebolla se haya marchitado. Coloque las pasas y la cebolla en la ensalada de quinua y agregue las hierbas. Sazone con sal y pimienta y el jugo de limón.", "Para la mayonesa de cilantro, mezcle el cilantro con 2½ litros / 4½ pintas de agua en una licuadora o en un procesador de alimentos.", "Alinee un colador con una capa triple de tela de muselina. Coloque el hielo en un tazón grande en el que se ajustará el colador.", "En una sartén grande de base pesada, caliente el agua de cilantro, batiendo continuamente. Cuando la temperatura alcanza los 80 ° C / 176 ° F, la clorofila se separará del agua.", "Vacíe el agua de cilantro a través del colador forrado de muselina, luego coloque el colador en el tazón de hielo para enfriar. Deja hasta que quede un puré de cilantro espeso en la muselina. Raspe esto y reserve para la mayonesa.", "Para hacer la mayonesa, coloque las yemas de huevo, el vinagre de vino blanco y la mostaza en un procesador de alimentos y mezcle hasta que quede pálido y cremoso.", "Con el motor en marcha, vierta el aceite, en un flujo constante muy fino, hasta que la mayonesa se espese.", "Agregue el jugo de yuzu y el puré de cilantro a la mayonesa y mezcle, reserve.", "Para los anillos de cebolla crujientes, calentar una freidora a la TEMPERATURA? (PRECAUCIÓN: el aceite caliente es peligroso. No lo deje sin supervisión).", "Combine los aros de cebolla con el huevo batido en un tazón grande y mezcle bien.", "Agregue las harinas, cilantro molido, cilantro fresco y semillas de comino y revuelva bien para combinar.", "Cuando el aceite esté caliente, agrega una cucharada grande de los aros de cebolla y freír durante 30-45 segundos, hasta que se doren.", "Con una cuchara ranurada, dale la vuelta y fríe por otros 30 segundos, hasta que esté crujiente y dorado por todas partes. Retire con una espumadera y déjelo a un lado para escurrir sobre papel de cocina. Sazonar con sal.", "Repita con los aros de cebolla restantes, reponiendo el aceite en la freidora si está baja y permitiendo que se caliente nuevamente después de una nueva adición.", "Calentar una sartén mediana y agregar la mantequilla. Sazone los filetes de lubina con sal y pimienta negra recién molida.", "Freír los filetes de lubina y cocinar por unos minutos a cada lado.", "Para servir, coloque un conjunto de la mayonesa de cilantro en el plato y coloque la ensalada de quinoa encima. Coloque los filetes de lubina en la parte superior y luego algunos aros de cebolla crujientes. Adorne con cilantro y berro de albahaca."], "url": "www_bbc_co_uk_food_recipes_fillets_of_seabass_with_42234", "title": "Lubina con ensalada de quinoa y hierbas, mayonesa de cilantro y cebollas crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla sin sal", "Recortes de salmón ahumado de 50 g / 2 oz", "3 dientes de ajo, aplastados", "1 pequeño manojo de perejil fresco", "3 cucharadas de jugo de limón", "sal y pimienta negra recién molida", "140 g / 5 oz de zanahorias, cortadas en cubitos", "Puerros 140g / 5oz, lavados, cortados y cortados en cubitos", "Papas 140g / 5oz, peladas y cortadas en cubitos", "4 porciones de filetes de bacalao gruesos, deshuesados ​​y sin piel, con un peso de 200 g / 8 oz cada uno", "sal y pimienta negra recién molida", "Harina blanca normal 100g / 4oz, para dragado", "2 cucharadas de aceite vegetal", "botón de mantequilla"], "method": ["Para la mantequilla de perejil, derrita la mantequilla en una cacerola pequeña, con los restos de salmón ahumado y el ajo picado.", "Calentar suavemente durante unos diez minutos o hasta que la mantequilla se haya aclarado. Cuele la mantequilla a través de un colador y vuelva a la sartén.", "Permita que la mantequilla descanse sobre el fuego durante unos 30 minutos, para dejar que los sabores se infundan.", "Mientras tanto, retire las hojas de perejil de sus tallos y póngalas en agua hirviendo durante un minuto.", "Refresque bajo agua muy fría, escurra, seque con papel de cocina y pique aproximadamente. Dejar de lado.", "Cuele la mantequilla clarificada a través de un colador fino y agregue el jugo de limón y la sal y la pimienta.", "Blanquee o cocine al vapor las verduras hasta que estén tiernas, luego repárelas con agua fría y reserve.", "Para cocinar los filetes de bacalao, sazonar con sal y pimienta y dragarlos en harina. En una sartén grande, caliente el aceite vegetal hasta casi fumar, luego agregue el pomo de mantequilla y los filetes de bacalao. Cocine los filetes a fuego medio durante aproximadamente cuatro minutos en cada lado. Tenga cuidado de no tratarlos bruscamente o pueden romperse.", "Para servir, caliente las verduras y las hojas de perejil en la mantequilla clarificada. Divida esta mezcla entre platos calientes y agregue un filete de bacalao a cada porción."], "url": "www_bbc_co_uk_food_recipes_filletsofcodwithasmo_74450", "title": "Filetes de bacalao con ajo ahumado y mantequilla de perejil con zanahoria en cubitos, puerros y patatas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20g / ¾oz de alcaparras, escurridas", "¼ diente de ajo, finamente picado", "1 cucharada de aceite de oliva extra virgen", "8 rebanadas de jamón", "8 filetes de lenguado de limón, que pesan aproximadamente 100 g / 3¾ oz cada uno (o 4 filetes de lenguado, que pesan aproximadamente 200 g / 7 oz cada uno, cortados por la mitad a lo largo)", "8 ramitas pequeñas de perejil fresco", "sal y pimienta negra recién molida", "8 cebolletas frescas", "4 cucharadas de aceite de oliva extra virgen", "6 hojas frescas de laurel, finamente picadas", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 puñado de perejil fresco, finamente picado", "200ml / 7fl oz de vino blanco", "½ cucharadita de harina de maíz", "500g / 1lb 2oz de papas baby, hervidas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la pasta, coloque las alcaparras, el ajo y el aceite de oliva en un mortero y muela con un mortero para hacer una pasta.", "Para la suela, alinee las rebanadas de jamón sobre una superficie de trabajo limpia, bien espaciadas.", "Coloque un solo filete en cada rebanada de jamón, cepille el pescado con una capa ligera de la pasta de alcaparras, luego cubra con una ramita de perejil. Sazonar con sal y pimienta negra recién molida, al gusto.", "Con cuidado, enrolle cada filete en la rodaja de jamón y átelo para abrocharlo con un cebollino.", "Cubra una bandeja para hornear o un plato resistente al horno con papel resistente a la grasa y coloque los filetes de pescado envueltos y enrollados en el plato. Hornee en el horno por aproximadamente 10-15 minutos, o hasta que el pescado esté recién cocinado.", "Para la salsa, caliente el aceite de oliva en una sartén pequeña y agregue las hojas de laurel, el chalote, el ajo y el perejil. Freír a fuego medio durante unos siete minutos, o hasta que la chalota se haya suavizado.", "En un tazón pequeño, mezcle el vino y la harina de maíz. Agregue la mezcla de harina de maíz a la sartén. Revuelva bien y sazone al gusto con sal y pimienta negra recién molida. Cocine por otros cinco minutos o hasta que la salsa se espese.", "Retire los filetes de lenguado del horno y transfiéralos a un plato de servir grande, o en cuatro platos individuales, y vierta sobre la salsa antes de servir. Sirve con las papas hervidas."], "url": "www_bbc_co_uk_food_recipes_filletsofsolewrapped_90825", "title": "Suela envuelta en jamón con salsa de hojas de laurel (lenguado con jamón en salsa de laurel)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["buen tamaño palo de rábano picante fresco, alrededor de 1.5 cm / ½ pulgada de ancho x 5 cm / 2 pulgada de largo (más tiempo si te gusta caliente)", "2-3 cucharaditas de azúcar en polvo", "2 cucharadas de vinagre de vino blanco", "Crema doble de 200 ml / 7 fl oz", "4 filetes de filete, cada uno de 250 g / 9 oz, recortados de cualquier tendón", "sal y pimienta negra recién molida", "4 cucharadas de aceite de cacahuete", "80ml / 2½fl oz Madeira", "225ml / 8fl oz de caldo de buey de buena calidad", "9-12 nueces en escabeche, más 1 cucharada de líquido decapado", "50g / 2oz de mantequilla sin sal"], "method": ["Para hacer la crema de rábano picante, pelar el rábano picante rápidamente y luego rallar finamente. Ralla rápidamente ya que el rábano picante hará que tus ojos se llenen de agua. El calor del rábano picante fresco es vital para este plato. Revuelva el azúcar en el vinagre para disolver, luego vierta el rábano picante. Deje esto sentado durante media hora más o menos. Muy ligeramente azota la crema; luego revuelva en el rábano picante. Cubre bien, luego seca tus ojos. (La salsa se puede preparar unas horas antes y se puede enfriar, pero no demasiado lejos o el sabor se desvanecerá de forma espectacular).", "Sazone los filetes de manera liberal y uniforme con sal marina y pimienta recién molida. Caliente una sartén de fondo grueso; luego agrega el aceite. Caliente hasta que humee suavemente, luego coloque cuidadosamente los filetes en la sartén y no los toque en absoluto. Deje que la carne se cocine suavemente hasta que los bordes se vuelvan de un color marrón oscuro rico y rico, moviendo la sartén si los filetes se cocinan de manera irregular. Después de 7-8 minutos, voltee los filetes en el otro lado y debe revelar una espléndida corteza. Continúe cocinando por unos minutos más, luego quite los filetes para calentar los platos y déjelos a un lado.", "Revuelva el Madeira en la sartén y hierva hasta que quede una cucharadita. Agregue el caldo y la cucharada de líquido decapante, luego cocine a fuego lento hasta que espese un poco. Agregue la mantequilla a la vez y revuelva hasta que esté bien combinada. Volver a hervir; luego vierte la salsa a través de un colador fino en una sartén pequeña y mantén el calor.", "Para servir, corte las nueces en vinagre por la mitad y apile sobre los filetes. Vierta la salsa y agregue una cucharada de crema de rábano picante al lado."], "url": "www_bbc_co_uk_food_recipes_filletsteakpickledwa_86083", "title": "Solomillo, nueces encurtidas y rábano picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]