[{"ingredients": ["4 asas de cordero", "1 cucharada de cúrcuma molida", "Jengibre de raíz de 3cm / 1in, rallado", "3 dientes de ajo, aplastados", "pizca de sal", "2 cucharadas de aceite de girasol", "1 hoja de laurel", "1 ramita de canela", "5 dientes", "6 vainas de cardamomo, ligeramente trituradas", "2 cebollas en rodajas", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharaditas de comino molido", "3 cucharaditas de cilantro molido", "2 chiles verdes, cortados a la mitad", "1 cilantro pequeño racimo", "50g / 2oz de coco desecado", "3 cucharadas de semillas de cilantro", "5 cucharadas de semillas de amapola", "2 cucharadas de semillas de hinojo", "1 cucharada de pimienta negra", "5 chiles rojos", "2 cucharadas de aceite de girasol", "1 cucharadita de semillas de mostaza", "2 cucharaditas de chana dal (un tipo de lenteja de la India, disponible en tiendas especializadas en India)", "3 cucharadas de anacardos", "1 cucharadita de hojas de curry", "1 cucharadita de cúrcuma", "1 cucharadita de asafoetida en polvo", "1 cucharadita de jengibre molido", "500 g / 1 libra de arroz basmati cocido (aproximadamente 350 g / 12 oz de peso seco)", "1 limón, jugo", "1 manojo de cilantro, más o menos picado"], "method": ["Coloque los dientes de cordero en una olla grande con la cúrcuma, el jengibre, el ajo y un poco de sal.", "Agregue suficiente agua para cubrir y cocine a fuego lento durante 1 hora y media o hasta que la carne esté tierna.", "Mientras tanto, muela todos los ingredientes de la pasta de curry juntos en un molinillo de especias o una mano de mortero. Dejar de lado hasta que se requiera.", "Para el curry, caliente dos cucharadas de aceite de girasol en una sartén grande y profunda y agregue la hoja de laurel, canela, clavo de olor y cardamomo y fría hasta que esté aromático.", "Agregue la cebolla y fría hasta que esté blanda, pero no coloreada.", "Agregue el tomate y cocine durante cinco minutos, luego agregue el comino, el cilantro y los chiles verdes y cocine por otros tres minutos.", "Agregue la pasta de curry a la sartén y cocine por otros dos minutos, antes de agregar el cordero cocido, sal al gusto y suficiente agua de cocción de cordero para llegar hasta la mitad de los tallos. Cocine por otros 20 minutos, girando las espigas varias veces durante la cocción y agregando más agua de cocción de cordero si la salsa se vuelve demasiado espesa.", "Para el arroz, caliente una sartén hasta que esté caliente y agregue el aceite de girasol.", "Agregue las semillas de mostaza y chana dal y fría hasta que empiecen a reventar, teniendo cuidado ya que el aceite puede salpicar.", "Agregue los anacardos, las hojas de curry, la cúrcuma, la asafétida y el jengibre y saltee durante 1-2 minutos.", "Finalmente agregue el arroz cocido y el jugo de limón y cocine hasta que esté caliente todo el tiempo.", "Sirva el cordero con una cucharada de arroz y espolvoree con cilantro."], "url": "www_bbc_co_uk_food_recipes_masalamuttonshankswi_85025", "title": "Rajas de cordero Masala con arroz limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450ml / 16fl oz azotes o crema doble", "100g / 3½ oz de mascarpone", "1 vaina de vainilla, solo semillas (o 2 cucharaditas de extracto de vainilla)", "Jengibre fresco de la raíz de los 10cm / 4in, pelado, muy rallado fino", "6 yemas de huevo de gallinas camperas", "60g / 2½oz de azúcar morena blanda, más alrededor de 4-6 cucharadas para el aderezo"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Coloque los moldes en una lata para asar y vierta suficiente agua caliente para llegar hasta la mitad de los lados de los moldes.", "Ponga las semillas de crema, mascarpone y vainilla (o extracto) en una sartén y caliente hasta que esté casi hirviendo, luego retire la sartén del fuego y agregue el jengibre hasta que estén bien combinados.", "Batir las yemas de huevo y el azúcar juntos en un bol hasta que estén pálidos y esponjosos.", "Poco a poco agregue la crema de jengibre, batiendo todo el tiempo. (Me gusta incluir los trozos de jengibre en la crème brûlée, pero si no los quiere, coloque un colador sobre una jarra de medir y vierta la mezcla de crema en ella para tamizar el jengibre. Con una cuchara de madera, presione el mezcla de jengibre en el colador para obtener todo el sabor que puedas, luego descarta los trozos de jengibre).", "Divida la mezcla de crema por igual entre los moldes, luego colóquelos (todavía en la lata de asar) en el horno durante aproximadamente 30 minutos, o hasta que los brûlées comiencen a fraguar. Todavía deberían tambalearse como gelatina en el centro mismo, pero no deberían ser demasiado líquidos ni estar completamente colocados. Es muy fácil sobrecocer estos, así que revise después de 20 minutos para ver cómo están. Luego revise cada cinco minutos después de eso ya que algunos hornos son mucho más poderosos que otros.", "Retire los brûlées del horno y de la lata de tostado y deje enfriar, luego coloque en la nevera durante al menos una hora.", "Espolvoree aproximadamente una cucharada de azúcar moreno uniformemente en la parte superior de cada brûlée, asegurándose de que las tapas estén completamente cubiertas. Usando un soplete de cocina, caramelizar el azúcar hasta que esté marrón oscuro y crujiente. Una parrilla muy caliente también funciona. Dejar enfriar un poco y luego servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mascarpone_and_ginger_88784", "title": "Mascarpone y jengibre crème brûlée", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mascarpone_and_ginger_88784_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pandoro (pan italiano dulce)", "Crema doble de 300 ml / ½ pinta", "250 g / 9 oz de queso mascarpone", "1 limón, ralladura finamente rallada solamente", "splash licor de marrasquino", "2 cucharadas de azúcar glas, más extra para polvo", "Velas de oro, para decorar (opcional)"], "method": ["Corta el pandoro horizontalmente en cuatro.", "En un tazón grande, mezcle la crema, el mascarpone, la ralladura de limón, el marrasquino y el azúcar glas, hasta que se formen picos suaves cuando se quite el batidor.", "Divida la mezcla entre las capas de pandoro y extiéndala cuidadosamente hacia los bordes.", "Reconstruya el pandoro en capas en un plato para servir y espolvoree abundantemente con azúcar glas y sirva. Decora con velas de oro, si quieres."], "url": "www_bbc_co_uk_food_recipes_mascarponefilledpand_87752", "title": "Pandoro lleno de mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Papas de 500 g / 1 lb 2 oz, como Maris Piper", "50g / 2oz de mantequilla", "Crema doble 25ml / 1fl oz", "sal y pimienta negra recién molida, al gusto"], "method": ["Pele las papas y pártelas a la mitad.", "Coloque las papas en una olla grande de agua a fuego alto. Agregue una pizca de sal y deje que hierva.", "Hervir las papas suavemente hasta que estén tiernas. Cuando puedes romper las papas con un tenedor o cortarlas fácilmente con un cuchillo, ya están hechas. Escurrirlos en un colador.", "Deje las papas en el colador hasta que el vapor se haya evaporado (alrededor de 3-4 minutos). Si las papas todavía están mojadas cuando comiences a macerar, terminarás con puré acuoso.", "Coloque las papas en un tazón grande y revuelva con un machacador de papas. Cuanto más los trabaje, más livianos y esponjosos serán. No use nada eléctrico. Las batidoras eléctricas o los procesadores de alimentos arruinarán la textura. Si se cansa, deténgase un momento, sacuda sus brazos y luego vuelva a él.", "Una vez que esté seguro de que no hay más bultos en las papas, agregue la mantequilla.", "Mash la mantequilla en la papa. Una vez que se haya derretido en el puré, agrega un toque de crema. Mash de nuevo y verificar la consistencia, agregando más crema si es necesario. Pruebe y agregue un poco de sal y pimienta negra recién molida, a su gusto. Puede agregar ingredientes a su puré para complementar su plato. Pruebe la mostaza integral con costillas de cordero, el cebollino picado con dorada y las cebollas rojas caramelizadas con bangers."], "url": "www_bbc_co_uk_food_recipes_mashedpotatoes_90230", "title": "Puré", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mashedpotatoes_90230_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Patatas de 1 kg / 2¼ lb, peladas y cortadas en trozos grandes del mismo tamaño", "25g / 1oz de mantequilla", "100 ml / 3½ fl oz crema o leche, aproximadamente", "1kg / 2¼lb de carne de salchicha", "1 cebolla grande, cortada en cubitos", "1 cucharadita de aceite de oliva", "2 x 400 g / 14 onzas de latas de tomates picados, escurridos", "2 cucharaditas de hierbas mezcladas", "sal y pimienta recién molida", "Queso cheddar 75g / 3oz (opcional)", "chícharos", "maíz dulce"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una olla grande de agua salada hirviendo, hervir las papas durante unos 15-20 minutos, hasta que estén tiernas. Desagüe.", "Agregue la mantequilla y una pizca de sal a las papas. Mash bien, usando un ricer de patata, mouli o triturador tradicional, agregando suficiente leche o crema para darle una consistencia cremosa.", "Enrolle la carne de salchicha en bolas del tamaño de una nuez y colóquela en un plato para hornear a prueba de horno. Transfiera al horno y hornee por 20-25 minutos hasta que chisporrotea, pero no se dore.", "Coloque las cebollas en una sartén con aceite de oliva y cocine hasta que se ablanden. Agregue los tomates, las hierbas y la sal y la pimienta al gusto. Llevar a ebullición, antes de hervir a fuego lento durante 10 minutos.", "Vierta la salsa de tomate sobre las bolas de salchicha cocidas y cubra con el puré de patatas.", "Espolvorea con queso rallado si te gusta. Regrese al horno y cocine durante 30 minutos, hasta que estén dorados. Sirve con guisantes y maíz dulce."], "url": "www_bbc_co_uk_food_recipes_mashedpotatotoppedsa_83707", "title": "Pastel de salchicha con puré de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas 900g / 2lb (Désirée o King Edward)", "50g / 2oz de mantequilla", "3 dientes de ajo grasos, cortados a la mitad longitudinalmente", "8 cucharadas de aceite de oliva virgen extra de mejor calidad", "sal y pimienta negra recién molida"], "method": ["Primero coloque el ajo y el aceite de oliva en una cacerola pequeña sobre el calor más suave posible - un difusor de calor es bueno para esto - y déjelo durante 1 hora para que el ajo se infunda y se vuelva muy suave.", "Use un pelador de patatas para cortar las pieles lo más finamente posible y luego corte las papas en trozos de tamaño uniforme, no demasiado pequeños. Si son grandes, córtelos y si son pequeños, divídalos a la mitad.", "Coloque los trozos de papa en una cacerola grande, luego vierta agua hirviendo sobre ellos, agregue 1 cucharada de sal, ponga una tapa y cocine a fuego lento hasta que estén completamente tiernos, deben tomar aproximadamente 25 minutos. La forma de saber si están listos es atravesándolos con un pincho en la parte más gruesa; la papa no debería ser dura en el centro. Y debe tener cuidado aquí, porque si son un poco infrautilizados se acumulan grumos.", "Cuando las papas estén cocidas, escúrralos. Cúbralos con un trapo de té limpio para absorber parte del vapor durante unos 5 minutos, luego use un batidor eléctrico a baja velocidad, comience a romperlos usando la mitad del ajo y el aceite. Tan pronto como todo esté incorporado, agregue el resto del ajo y el aceite y bata hasta que quede suave, sazonándolo bien con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_mashedpotatowithgarl_67177", "title": "Puré de patata con aceite de oliva con ajo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mashedpotatowithgarl_67177_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas rojas, cortadas a la mitad, cortadas en rodajas", "2 pimientos rojos, sin semillas, cortados en trozos", "1-2 cucharadas de aceite de oliva virgen extra", "120 g / 4½ oz de nueces de macadamia", "½ pepino, pelado", "3 cebolletas, finamente picadas", "2 chalotes, finamente picados", "2 cabezas de achicoria, corazón eliminado, picado grueso", "½ bulbo de hinojo, picado", "1 manzana verde agria (como Braeburn o Granny Smith) pelada, picada", "3 lechugas Baby Gem, picadas", "sal marina y pimienta negra recién molida", "3 chalotes, muy finamente en rodajas", "1 cucharadita de mostaza integral", "1 cucharada de azúcar moreno", "2 cucharadas de vinagre de vino blanco", "gran pizca de sal marina Maldon", "pimienta negra recién molida", "75ml / 3fl oz de aceite de oliva virgen extra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle la cebolla y el pimiento rojo en el aceite de oliva y tueste en el horno durante 30 minutos.", "Tueste las nueces de macadamia en una lata pequeña para hornear durante 5-7 minutos en el mismo horno, hasta que tengan un color caramelo delicioso. Retire las macadamias del horno y páselas en trozos grandes, luego póngalas a un lado para que se enfríen mientras la cebolla y el pimiento terminan de cocinarse.", "Cortar el pepino en cuartos a lo largo. Ahora corta cada trozo, cortando las semillas (que son acuosas y harían que tu ensalada se ablandara). Picar la carne restante.", "Para el aderezo francés, mezcle todos los ingredientes del aderezo, excepto el aceite de oliva, en un frasco de vidrio con tapa a rosca. Agite bien para disolver el azúcar y déjelo reposar durante diez minutos (esto quita el ponche de cebolla de la chalota y suaviza su sabor). Agregue el aceite y agite de nuevo.", "Para servir, mezcle todos los ingredientes de la ensalada en un tazón, sazone con sal y pimienta negra recién molida, luego mezcle el aderezo francés."], "url": "www_bbc_co_uk_food_recipes_masmacadamiasalad_85171", "title": "Ensalada de macadamia de Ma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/masmacadamiasalad_85171_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de hilos de azafrán", "600g / 1 lb 5 oz de arroz basmati (peso sin cocer)", "50 g / 2 oz de lentejas rojas o lentejas, empapadas según las instrucciones del paquete o lentejas verdes en lata", "150ml / 5fl oz de aceite vegetal", "4 cebollas, en rodajas finas", "4 palitos de canela enteros", "6 a 8 vainas de cardamomo", "2 cucharaditas de jengibre fresco de raíz, finamente rallado", "1 cucharadita de ajo, aplastado", "2 tomates medianos, picados", "2 chiles verdes, cortados a la mitad", "1 cucharadita de sal masala", "1 cucharadita de comino molido", "1 cucharadita de chile rojo en polvo", "450 g / 1 lb de cordero picado", "1 cucharada de yogur natural", "puñado de hojas de cilantro fresco, picado", "hojas de menta pequeñas, picadas", "3 huevos duros, sin cáscara y cortados a la mitad"], "method": ["Haga el agua de azafrán empapando los filamentos de azafrán en 200 ml / 7 fl oz de agua caliente. Deje reposar hasta que sea necesario.", "Lave el arroz en agua tibia y caliente y déjelo remojar en un recipiente con agua mientras prepara los otros ingredientes.", "Agregue las lentejas a una sartén grande llena de 400ml / 14fl oz de agua caliente (puede usar un poco de caldo de pollo en lugar del agua para darle más sabor si lo prefiere). Coloque a fuego medio o bajo y cocine durante aproximadamente 30-45 minutos, hasta que las lentejas estén blandas. Si es necesario, agregue más agua caliente durante la cocción. Si usa lentejas enlatadas, puede omitir este paso.", "Caliente dos tercios del aceite vegetal en otra sartén grande y caliente hasta que esté caliente. Agregue la mitad de las cebollas y fría hasta que estén doradas y crujientes. Retire con una cuchara ranurada y colóquelo en papel de cocina para drenar. Dejar de lado.", "Deje el aceite en la sartén y agregue los palitos de canela y las cápsulas de cardamomo. Deje que las especias chisporrotean por unos segundos, luego agregue las cebollas crudas restantes y fría hasta que estén doradas.", "Ahora agregue el ajo y el jengibre y revuelva por unos segundos.", "Agregue los tomates picados, los chiles verdes, el comino molido, el garam masala y el chile rojo en polvo y revuelva por un minuto o dos.", "Agregue el cordero picado y cocine hasta que se dore, luego agregue el yogur y revuelva. Cubra la sartén y cocine a fuego lento durante 30 minutos.", "Mientras tanto, ponga a hervir una olla grande de agua y agregue el arroz. Agregue tres cucharaditas de sal y un chorrito de aceite para evitar que el arroz se pegue. Cocine hasta que el arroz se ablande pero no completamente cocido, aproximadamente tres minutos. Escurrir bien y dejar reposar.", "Agregue el aceite restante al molde de arroz vacío y agregue una capa de cebollas fritas crujientes y un chorrito de agua con azafrán.", "A continuación, agregue una capa fina de arroz, luego una capa delgada de lentejas y algo de la mezcla de cordero.", "Repita lo anterior varias veces hasta que todos los ingredientes se hayan agotado y tenga varias capas. Termine con una capa de cebollas fritas y espolvoree sobre el cilantro picado y la menta.", "Cubra la sartén con un paño limpio y seco y cocine a fuego lento durante 10 - 15 minutos.", "Transfiera a un plato grande y adorne con las mitades de huevo hervidas. Servir."], "url": "www_bbc_co_uk_food_recipes_masourpulaolayeredmi_74823", "title": "Masoor pulao (cordero picado en capas con arroz)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 chiles rojos secos", "1 cucharada de semillas de cilantro, molido", "1 cucharadita de semillas de comino molidas", "1 palo de canela, molido", "3 dientes, molidos", "4 granos de pimienta, molidos", "4 cucharadas de ajo, picado", "4 cucharadas de chalotes picados", "1 cucharada de pasta de gambas apilada", "1 - 2 palitos de limoncillo, picados", "1 cucharadita de raíz de galanga, picada", "1 cucharadita de salsa de pescado"], "method": ["Remoje los chiles en agua durante 10 minutos y luego elimine el fuego.", "Freír en seco las especias secas en un wok para liberar los sabores y luego moler hasta obtener un polvo en una mano de mortero o en un procesador / licuadora.", "Agregue todos los demás ingredientes y muela o blitz en una pasta fina.", "Guárdelo en el refrigerador por hasta 2-3 meses."], "url": "www_bbc_co_uk_food_recipes_massamancurrypaste_4953", "title": "Pasta de curry Massaman", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace una jarra", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 mango maduro, pelado, sin hueso, carne picada", "2 kiwis, pelados, cortados en cuartos, corazones removidos, carne cortada finamente", "2 maracuyá madura, pulpa y semillas", "1 pedazo grande de jengibre conservado en tallo (de un tarro), finamente picado", "1½ cucharada de jarabe de jengibre (del frasco de jengibre conservado)", "½ lima, solo jugo", "crema doble o helado, para servir"], "method": ["Mezcle el mango picado, el kiwi rebanado y la pulpa de la fruta de la pasión y las semillas en un tazón grande.", "Espolvorea sobre el jengibre tallo picado y mezcla bien.", "Rocíe el jarabe de jengibre y exprima el jugo de lima. Mezcle cuidadosamente hasta que la fruta esté cubierta con jengibre y jugo de lima.", "Para servir, vierta el matrimonio de lujo en cuatro tazones para servir poco profundos. Rocíe sobre la crema doble o agregue una bola de helado."], "url": "www_bbc_co_uk_food_recipes_matrimonydeluxe_91693", "title": "Jamaican fruit salad (Matrimony de luxe)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1x225g / 8oz de tomates picados en lata", "1 cuchara de postre puré de tomate", "1 naranja, solo jugo", "25g / 1oz de azúcar morena suave", "25g / 1oz de azúcar blanco", "90ml / 3fl oz de vinagre de malta", "2 cucharadas de harina de maíz", "4 cucharadas de agua", "2 cucharadas de licor de brandy de albaricoque o Grand Marnier - opcional"], "method": ["Tamizar los tomates picados en una cacerola y trabajar con una cuchara de madera hasta que quede un poco de pulpa en el tamiz. Deseche la pulpa.", "Agregue el puré de tomate, el jugo de naranja, el azúcar morena, el azúcar blanco, el vinagre de malta y revuelva bien.", "Llevar la mezcla a ebullición.", "Disuelva la harina de maíz con agua y agregue a la salsa. Llevar esto a ebullición hasta que espese.", "Agregue el brandy de albaricoque o Grand Marnier si lo desea."], "url": "www_bbc_co_uk_food_recipes_mayorchidsweetandsou_11032", "title": "Orquídea, salsa agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 350ml / 12fl oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de jugo de arándano", "150ml / 5fl oz de limón amargo", "2 cucharadas de aguardiente", "1 lima, a la mitad y en rodajas", "hojas de menta, para adornar"], "method": ["Mezcle el jugo de arándano, el limón amargo y el brandy en una jarra grande y vierta sobre hielo en vasos de su elección. Adorne con lima y menta y sirva enseguida."], "url": "www_bbc_co_uk_food_recipes_mb_zinger_61787", "title": "MB Zinger", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mb_zinger_61787_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de comino", "1 cucharada de aceite de colza o aceite vegetal, más extra para engrasar", "2 cebollas rojas medianas, finamente picadas", "6 dientes de ajo, aplastados", "3 chiles verdes, semillas retiradas (opcional), finamente picadas", "1 pimiento rojo grande, sin semillas, finamente picado", "1 cucharadita de macla molida o nuez moscada rallada", "2 cucharaditas de cilantro molido", "1kg / 2lb 4oz cordero picado", "1 cucharadita de pimienta blanca recién molida", "3 cucharadas de cilantro fresco picado", "sal", "Harina normal de 340g / 12oz, más extra para espolvorear", "½ cucharadita de sal", "90ml / 3fl de leche en oz", "Manteca de cerdo de 150 g / 5½ oz, picada en cubos, más extra para engrasar", "1 huevo de gallina, solo yema, golpeado, para cepillar"], "method": ["Caliente una sartén grande y tueste las semillas de comino por unos minutos, luego déjelas a un lado. Calentar el aceite en la misma sartén y freír la cebolla, el ajo, el chile, la pimienta y una buena pizca de sal durante unos ocho minutos, hasta que no quede humedad. Retire del fuego, agregue las semillas de comino tostadas, macis molidas (o nuez moscada) y cilantro molido. Deja enfriar.", "En un tazón grande mezcle el cordero picado, la pimienta blanca, el cilantro fresco y la mezcla de cebolla condimentada hasta que se combinen. Dejar de lado, cubierto, en la nevera.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase generosamente una lata de pastel de 20 cm / 8 pulgadas de diámetro con fondo holgado o de forma redonda con manteca de cerdo.", "Para hacer la masa, tamiza la harina y la sal en un tazón grande y haz un pozo en el centro.", "Ponga la leche, la manteca de cerdo y 90 ml / 3 fl oz de agua en una olla y caliente suavemente. Cuando la manteca se haya derretido, aumenta el fuego y lleva a ebullición.", "Vierta el líquido hirviendo en la harina y use una cuchara de madera para combinar hasta que se enfríe lo suficiente como para manipularla. Reunir en una bola.", "Polvore una superficie de trabajo con harina y, trabajando rápidamente, amasar la masa brevemente; será suave y húmeda. Reserve un tercio de la masa y enrolle el resto sobre una superficie bien enharinada. Alinee el plato de tarta con la masa, presionándola hacia los lados hasta que toque ligeramente la parte superior de la lata.", "Agregue el relleno en la lata revestida de pastelería poco a poco. Al llegar a la cima, forma un ligero pico. Estirar la masa reservada y cubrir el pastel con ella. Pellizque los bordes para sellar y recortar el exceso. Haga un agujero en la parte superior del pastel e inserte un pequeño tubo hecho de papel de aluminio para permitir que escape el vapor.", "Cepille la parte superior del pastel con un poco de yema de huevo batida, y hornee en el horno precalentado durante 30 minutos (coloque una bandeja en el estante de abajo para recoger los goteos). Luego reduzca la temperatura a 160 ° C / 325 ° F / Gas 3 y cocine por 1 hora más hasta que se dore. Deje que se enfríe completamente antes de refrigerar durante dos horas o durante la noche.", "Pase un cuchillo por el borde del pastel, retírelo de la lata y sirva con chutneys, ensaladas o encurtidos."], "url": "www_bbc_co_uk_food_recipes_mcsinghs_scotch_pie_98356", "title": "Pastel escocés de McSingh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de colza", "1 cebolla grande, finamente picada", "2 dientes de ajo, finamente picados", "1 chile rojo, finamente picado", "½ cucharadita de comino molido", "1 cucharada de pimentón", "1 cucharadita de chile en polvo", "250 g / 9 oz de carne picada de soja", "400g de tomates cortados en lata", "3 cucharadas de puré de tomate", "300ml / ½ pinta de caldo de verduras", "1 pimiento verde, semillas removidas y en cubos", "1 pimiento amarillo, sin semillas y en cubos", "1 zanahoria, rallada", "400 g de frijoles de lata en agua, escurridos", "1 cucharada de harina de maíz", "puñado de cilantro fresco, finamente picado", "2 panes pitta integrales, cortados a la mitad", "4 cucharadas de crema agria", "50g / 1¾oz de queso cheddar rallado"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue la cebolla y el ajo y cocínelos durante 4-5 minutos, o hasta que estén suaves.", "Agregue el chile rojo, comino, pimentón y chile en polvo y cocine por 1 minuto. Agregue la carne picada de soja y cocine por 2-3 minutos.", "Agregue los tomates picados, puré de tomate, caldo de verduras, pimientos y zanahoria y deje que hierva. Reduzca el fuego a medio-bajo y cocine a fuego lento durante 10 minutos, revolviendo ocasionalmente.", "Agregue los frijoles y cocine por 5 minutos. Mezcle la harina de maíz con 1 cucharada de agua, luego agréguela a la sartén y cocine por otros 5 minutos. Revuelva en el cilantro.", "Sirve el chile con mitades de pitta, crema agria y queso rallado."], "url": "www_bbc_co_uk_food_recipes_meat-free_chilli_con_30042", "title": "Chili con carne sin carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat-free_chilli_con_30042_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de azúcar en polvo", "300ml / ½ pinta de agua tibia", "1 x 7 g / ¼ onza de sazón de levadura seca de acción rápida", "500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "1 cucharadita de sal marina fina", "1 cucharada de aceite de girasol, más extra para engrasar", "2 cucharadas de aceite de girasol", "500 g / 1 libra de carne picada magra de 2 oz", "2 cebollas grandes, finamente picadas", "1 col blanca pequeña", "1 cucharada de sal marina fina", "½ cucharada de pimienta blanca molida", "1 cucharadita de pimienta negra molida", "1 cucharada de semillas de alcaravea", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de hinojo", "1 cucharadita de comino molido", "50g / 2oz de mantequilla, derretida", "mostaza y pepinillos"], "method": ["Para la masa, mezcle el azúcar en agua tibia en un tazón. Espolvorea sobre la levadura y revuelve ligeramente, luego déjalo por 10 minutos hasta que una espuma ligera flote en la superficie.", "Mezcle la harina y la sal en un bol y haga un pozo en el centro. Revuelva el aceite en la mezcla de levadura y vierta lentamente todo en la harina, mezcle con una cuchara de madera y luego con las manos para formar una masa suave.", "Amasar la masa en una superficie enharinada durante unos 10 minutos hasta que quede suave y elástica. Coloque la masa en un recipiente ligeramente engrasado, cubra con una película adhesiva engrasada y déjela reposar en un lugar cálido durante 30-45 minutos.", "Para preparar el relleno, caliente el aceite en una sartén antiadherente grande a fuego medio y fría la carne y las cebollas hasta que estén ligeramente doradas, revolviendo regularmente.", "Retire las hojas dañadas del repollo, córtelo en cuartos y deseche el núcleo duro. Triturar finamente las hojas.", "Mezcle las hojas de col, sal, pimienta y todas las especias en la sartén con la carne. Continúe freír y revuelva durante 3 o 4 minutos más. Agregue 100 ml / 3½ fl oz de agua, cubra la olla y cocine suavemente durante 5 minutos hasta que el repollo esté muy suave. Retire la sartén del fuego, mezcle bien la mezcla y deje enfriar.", "Regrese la masa a la superficie de trabajo y retírela con los nudillos. Amasar ligeramente, luego divídalo en 20 porciones iguales y enrolle cada una en una bola. Estirar las bolas en una superficie ligeramente enharinada en rondas que miden aproximadamente 12 cm / 4½ pulgadas, aproximadamente el diámetro de un platillo.", "Necesitarás dos bandejas grandes para hornear, forradas con papel para hornear. Coloque dos cucharadas de relleno en el medio de una ronda de masa, dejando un borde pequeño alrededor del borde. Cepille el borde con agua y coloque los lados de la masa sobre el relleno en el centro y péguelos para sellar. Coloque el bollo relleno en una bandeja para hornear, con la costura debajo. Repita hasta que haya usado toda la masa y el relleno, luego deje los bollos en un lugar cálido durante unos 20 minutos hasta que hayan duplicado su tamaño.", "Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Hornea los bierocks durante unos 20 minutos hasta que estén bien elevados y dorados. Cepíllalas con la mantequilla derretida y sirve caliente con mostaza y encurtidos, ¡y cerveza, por supuesto!"], "url": "www_bbc_co_uk_food_recipes_meat_and_cabbage_buns_80117", "title": "Bollos de carne y col (Bierocks)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas grandes, picadas", "700g / 1lb 9oz chuck steak (bistec estofado), cortado en trozos de 4-5cm / 1½-2in", "Papas cerosas de 400g / 14oz, como Charlotte, peladas y cortadas en trozos de 4cm / 1½ oz", "Patatas harinas de 400g / 14oz, como Desiree, peladas y cortadas en trozos de 4cm / 1½ oz", "sal y pimienta", "Harina normal de 375g / 13oz", "175g / 6oz de carne de res desmenuzada sebo"], "method": ["Primero haga el relleno, coloque las cebollas y el bistec en una sartén grande. Agregue suficiente agua para cubrirlos y cocine a fuego lento. Cubra con una tapa, reduzca el fuego y cocine a fuego lento por 1 hora y media.", "Agregue las papas a la sartén, junto con un poco de sal y pimienta, y cocine durante 30-35 minutos más o hasta que las papas estén suaves y la carne tierna. La salsa debe espesarse bien con las papas.", "Controle el condimento y agregue sal y pimienta al gusto.", "Vierta 300-600 ml / 10-20 fl oz de líquido de la sartén, suficiente para dejar el relleno bien humedecido pero no nadando en líquido, y guárdelo para usar como salsa con el pastel. Transfiera el relleno a un plato de tarta de 1,2 litros / 2 pinta y deje enfriar por completo.", "Caliente su horno a 200C / 400F / Gas 6.", "Para la corteza de sebo, combine la harina y el sebo en un tazón grande con un poco de sal y pimienta. Mezcle gradualmente suficiente agua fría para formar una masa suave y ligeramente pegajosa. Deje reposar durante cinco minutos.", "En una superficie ligeramente enharinada, extienda la masa a un grosor de 7-8 mm / 1/3 pulgadas. Corta una tira de hojaldre de 2cm / ¾in. Humedece los bordes del borde del plato para pastel con agua. Pega la tira de pastelería en el borde y humedece esto también. Coloque la masa restante en la parte superior. Presione hacia abajo para sellar los bordes, engarce o agite los bordes de la masa y recorte el exceso.", "Hornee el pastel durante 30-40 minutos, o hasta que la masa esté dorada. Deje reposar de 10 a 15 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_meat_and_potato_pie_22149", "title": "Pastel de carne y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat_and_potato_pie_22149_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de estofado de 2.75kg / 6lb, cortado en cubos", "3 cebollas medianas, picadas", "2.75kg / 6lb patatas, peladas, cortadas en trozos", "1 cucharada de extracto de carne", "4 cucharadas de gránulos de salsa", "500g / 1lb 2 oz de harina común", "2 cucharaditas de sal", "125g / 4½oz de margarina, cortada en cubos pequeños", "125 g / 4½ oz de manteca de cerdo, cortadas en cubos pequeños", "125ml / 4fl oz de agua fría", "1 huevo de gallinas camperas, golpeado"], "method": ["Para el relleno del pastel, coloque la carne y las cebollas en una olla grande con tapa y sazone con sal. Vierta suficiente agua para cubrir el contenido de la sartén y deje que hierva. Una vez que hierva, cubra la olla con una tapa, reduzca el fuego y cocine a fuego lento durante 2½-3 horas, o hasta que la carne esté tierna.", "Mientras tanto, para la masa, vierta la harina y la sal en un tazón y agregue los cubos de margarina y manteca. Con las yemas de los dedos, frote la grasa en la harina hasta que la mezcla tenga la textura de pan rallado, y no queden grumos grandes de grasa. Agregue el agua y mezcle con un cuchillo para cubiertos hasta que la pasta comience a juntarse. Agregue más agua muy gradualmente si es necesario. Amasar la masa ligeramente, formar una bola, envolver en film transparente y enfriar en la nevera durante 30 minutos, o hasta que la mezcla de carne esté cocida. (Alternativamente, mezcle la harina, la sal, la margarina y la manteca de cerdo en un procesador de alimentos hasta que la mezcla tenga la textura de pan rallado. Con el motor funcionando lentamente, agregue el agua a través del embudo, hasta que la mezcla comience a juntarse).", "Una vez que la carne ha estado cocinando por dos horas, precaliente el horno a 200C / 400F / Gas 6.", "Cocine las papas en agua con sal hasta que estén tiernas. Escurrir y apartar.", "Cuando la carne esté tierna, retire la sartén del fuego. Vierte un poco del líquido de la carne en una jarra para que se enfríe. Mezcle los gránulos de salsa y el extracto de carne, y agregue gradualmente al líquido enfriado, mezclándolo bien. Verter sobre la carne y calentar suavemente hasta hervir a fuego lento. Una vez que hierva a fuego lento, retírelo del fuego y déjelo enfriar levemente.", "Retire la masa de la nevera. Corte una pequeña cantidad de masa y extiéndala en una superficie de trabajo ligeramente enharinada hasta obtener un grosor de 3 mm / ⅛ pulgadas. Corta la masa en tiras finas. Humedezca el borde de un plato para pastel de 28 x 38 cm / 11 pulg. X 15 pulg con agua, y forre el borde con las tiras de masa.", "Cuele la carne y la cebolla, reservando la salsa. Extiende la carne y la cebolla en una capa pareja en la base del plato. Coloque las papas en la parte superior de la carne y la cebolla. Vierta la salsa reservada sobre el relleno, hasta justo debajo de la parte superior de las papas. Reserva cualquier salsa restante.", "Extienda los pasteles restantes en una superficie de trabajo enharinada a un grosor de 3 mm / ⅛ pulgadas, y córtelos al tamaño del molde para pasteles. Cepille las tiras de hojaldre en el borde del plato con huevo batido y coloque la tapa de la pastelería encima. Presione los bordes para sellar y cepille la tapa del pastel con el huevo batido restante. Corte unas cuantas ranuras en la tapa del pastel para permitir que salga el vapor.", "Cocine en el horno precalentado durante 50-60 minutos, o hasta que la masa esté dorada y el relleno burbujee dentro.", "Sirve el pastel caliente con la salsa reservada en un lado."], "url": "www_bbc_co_uk_food_recipes_meat_and_potato_pie_66778", "title": "Pastel de carne y patata", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat_and_potato_pie_66778_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tocino de 40 g / 1½ oz", "40 g / 1½ oz de mantequilla", "Harina normal 175g / 6oz", "pizca de sal", "1 huevo de gallina, batido con una gota de leche", "1 cebolla pequeña, picada", "1 cucharada de aceite o mantequilla", "1 rebanada gruesa de pan", "125 g / 4½oz de carne asada u otra carne cocida", "salsa sobrante", "sal marina y pimienta negra recién molida"], "method": ["Primero haz la masa. Frote la grasa en la harina, o pulse en un procesador de alimentos, hasta que la mezcla se asemeje a pan rallado. Agregue la sal y mezcle con suficiente agua para formar una masa.", "Envuelva la masa en una película adhesiva y déjela reposar en la nevera mientras realiza el relleno.", "Calentar el aceite en una sartén y freír la cebolla durante 4-5 minutos, o hasta que esté suave, luego dejar enfriar.", "Mezcle el pan en un procesador de alimentos para hacer migas de pan, luego agregue la carne y la cebolla y el pulso hasta que se corte picado.", "Incline la mezcla en un recipiente y agregue suficiente salsa para hacer una mezcla suave. Sazonar, al gusto, con sal marina y pimienta negra recién molida.", "Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata de patty de 12 hoyos (o lata de pastel de hadas).", "Estirar la masa y cortar 10 círculos grandes para las bases de los pasteles y 10 círculos más pequeños para las tapas.", "Coloque las rondas de masa más grandes en latas de hamburguesas engrasadas y agregue una cucharadita de relleno a cada una. Humedezca los bordes de las hamburguesas con agua y cubra con los párpados, asegurándose de que los bordes estén bien sellados.", "Cepille las empanadas con el huevo batido y perfore un orificio en cada una para permitir que escape el vapor. Hornee las hamburguesas en el horno precalentado durante 20-30 minutos o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_meat_patties_12781", "title": "Empanadas de carne", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz '00' de harina, más extra para la elaboración", "100 g / 3½ oz de sémola, más extra para quitar el polvo", "4 huevos de gallinas camperas", "½ cebolla pequeña, finamente picada", "125 g / 4½ oz de carne picada de cerdo", "125 g / 4½ oz de carne picada", "4 cucharadas de vino blanco", "1 huevo de gallinas camperas, golpeado", "60 g / 2¼ oz de pan rallado fresco", "puñado de perejil fresco, finamente picado", "2 cucharadas de aceite de oliva", "1 diente de ajo, en rodajas finas", "½ chile rojo, picado", "10 tomates cherry, cortados a la mitad", "puñado de albahaca fresca"], "method": ["Para la pasta, mezcle la harina y la sémola juntas en una superficie de trabajo limpia o en un tazón grande. Haz un pozo en el centro y rompe los huevos. Con un tenedor o con las manos, mezcle gradualmente la harina con los huevos para formar una masa suave. Amasar la masa durante 5 minutos, o hasta que quede suave. Forme la masa en forma de bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante al menos 30 minutos.", "Harina la máquina de pasta con sémola y divida la pasta en 4 pedazos iguales. Comenzando por el ajuste más bajo (más grueso), introduzca una pieza de la masa en la máquina, gire el mango con una mano y sostenga la masa con la otra a través de la máquina. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. La pasta debe ser bastante delgada, pero aún así fácil de manejar sin romperse. No tengas la tentación de saltear las configuraciones o la masa puede romperse. Repita con las otras piezas de masa.", "Una vez que las hojas de pasta hayan alcanzado el grosor ideal, espolvorea con sémola y reserva.", "Para la salsa de tomate, agregue el aceite de oliva a una sartén y agregue el ajo y el chile. Cocine por 2-3 minutos, hasta que el ajo comience a colorear un poco. Agregue los tomates y caliente en la sartén. Condimentar con sal y pimienta.", "Para hacer los raviolis, coloque una hoja de pasta en su tablero y coloque una cucharadita colmada de la mezcla de ricotta a intervalos iguales a lo largo de la pasta. Cepille un poco del huevo batido alrededor de cada relleno y luego coloque otra hoja de pasta en la parte superior y presione con cuidado hacia abajo alrededor de cada bola de relleno para eliminar el aire. Cortar en cuadrados con su cortador de ravioli o cuchillo, luego polvo con harina de sémola y reservar. Repita el proceso con el relleno de carne.", "Para cocinar los ravioles, hierva un poco de agua y una buena cucharada de sal (el agua debe ser tan salada como el mar). Coloque los ravioles en el agua en pequeños lotes y cocine hasta que floten en la superficie, luego agréguelos a la salsa de tomate. Puede agregar un poco de agua de pasta a la salsa para obtener la consistencia adecuada.", "Esparce algunas hojas de albahaca sobre la parte superior y sirve."], "url": "www_bbc_co_uk_food_recipes_meat_ravioli_19110", "title": "Ravioles de carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, cortada en cubitos", "4 zanahorias, cortadas en cubitos", "1 diente de ajo, en rodajas finas", "1 litro / 1¾ pintas de caldo de carne (hecho con un cubo común)", "½ cucharadita de hierbas secas mezcladas", "175g / 6oz de cebada perlada, bien enjuagada", "sal y pimienta negra", "400 g / 14 oz de carne picada", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "½ cucharadita de hierbas secas mezcladas", "1 cucharada de aceite de oliva"], "method": ["Caliente una cacerola grande o una cazuela a fuego medio. Agregue el aceite de oliva a la sartén junto con la cebolla, las zanahorias y una pizca de sal. Freír durante 5-6 minutos, o hasta que las cebollas estén blandas y translúcidas. Agregue el ajo y cocine durante 1-2 minutos más, o hasta que esté aromático.", "Vierta 750ml / 1¼pint de la acción y agregue las hierbas secas y la cebada perlada. Lleve justo por debajo del punto de ebullición y luego reduzca el fuego hasta que hierva a fuego lento. Cocine por 30 minutos.", "Para las albóndigas, mezcle la carne picada, la cebolla, el ajo y las hierbas junto con una generosa pizca de sal y pimienta. Usando tus manos, rueda en 16 bolas.", "Calentar una sartén a fuego medio y agregar una cucharada de aceite de oliva. Una vez caliente, fríe las albóndigas por todos lados hasta que estén bien coloreadas, teniendo cuidado de no quemarlas. Es posible que deba hacer esto en lotes.", "Transfiera las albóndigas de colores a la sartén con la cebada y mezcle suavemente. Coloque la sartén a fuego medio y vierta 100 ml / 3½ fl oz de agua en la sartén. Use una cuchara de madera para raspar el fondo y atrape todos los sabores de freír las albóndigas y luego vierta este líquido en la sartén con la cebada.", "Agregue el caldo restante a la bandeja de cebada, cubra y cocine por otros 10 minutos o hasta que las albóndigas estén cocidas. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_meatball_and_pearl_84927", "title": "Albóndiga y guiso de cebada perlada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]