[{"ingredients": ["15 tomates cherry maduros", "1 taza de guisantes (cocida suavemente durante 15 minutos en aceite de oliva virgen extra, anchoas y sal)", "3 papas bintje, peladas y cocidas al vapor (también puedes usar papas Yukon Gold o Yellow Finn)", "1 manojo grande de menta", "vinagre balsámico", "aceite de oliva virgen extra", "sal marina y pimienta negra recién molida"], "method": ["Cortar los tomates cherry por la mitad, cortar las papas en trozos grandes y cortar aproximadamente la menta.", "Simplemente mezcle los tomates, guisantes, patatas y menta juntos.", "Agregue 1 parte de vinagre balsámico a 2 partes de aceite de oliva y sazone con una pizca de sal y mucha pimienta negra recién molida. (Tenga cuidado de no sobrepasar la ensalada ya que las anchoas cocidas con los guisantes son bastante saladas)."], "url": "www_bbc_co_uk_food_recipes_cherrytomatosaladwit_12163", "title": "Ensalada de tomate cherry con guisantes y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14¼ oz pueden tomates cherry", "½ cebolla mediana, finamente picada", "100 g / 3½ oz de champiñones en rodajas", "5 cucharadas de aceite de oliva italiano", "pizca de chile seco triturado", "hojas de albahaca", "sal y pimienta negra recién molida al gusto"], "method": ["En una sartén, freír la cebolla en el aceite de oliva y justo antes de dorar agregar los champiñones y el chile.", "Agregue los tomates, agregue la sal y la pimienta negra recién molida y luego las hojas de albahaca.", "Cocine por aproximadamente 1 minuto y sirva inmediatamente sobre la carne, el pescado o las verduras."], "url": "www_bbc_co_uk_food_recipes_cherrytomatosauce_70568", "title": "Salsa de tomate cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "15g / ½ oz de mantequilla", "85 g / 3 oz de setas, recortadas y limpiadas", "55g / 2oz de tomates cherry", "2 cucharadas de vinagre balsámico", "1 huevo de gallinas camperas", "2 cucharadas de vinagre de vino blanco", "2 rebanadas de jamón", "1 rebanada de pan tostado de estilo campestre", "sal y pimienta negra recién molida"], "method": ["Caliente una cucharada de aceite de oliva junto con la mantequilla en una sartén y fríe los champiñones durante 4-5 minutos o hasta que se ablanden.", "En una sartén separada, no reactiva, caliente otra cucharada de aceite y fríe los tomates con el vinagre balsámico durante 4-5 minutos, o hasta que se ablanden.", "Pon a hervir una olla de agua, luego reduce el fuego y agrega el vinagre. Con una cuchara de madera, agite el agua para crear una bañera de hidromasaje y luego rompa el huevo en el medio de la bañera de hidromasaje. Cocina durante 2-3 minutos, o hasta que la clara de huevo esté lista. Retire con una espumadera y escurra sobre papel de cocina.", "Caliente el aceite restante en una sartén y fría el jamón durante 1-2 minutos, o hasta que esté crujiente.", "Para servir, coloque el pan tostado en un plato de servir y cuchara sobre los champiñones, seguido por el tomate y el huevo. Coloque el prosciutto crujiente sobre la parte superior, luego sazone con sal y pimienta negra recién molida. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cherrytomatowildmush_90736", "title": "Tomate cherry, hongos silvestres, prosciutto crujiente y bruschetta de huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla ablandada, para engrasar", "6 huevos grandes de gallinas camperas, separados", "150 g / 5½ oz de azúcar en polvo", "50 g / 1¾oz de cacao en polvo", "150g / 5½oz de chocolate negro liso, roto en cuadrados", "300 ml / 10 fl oz doble crema", "XXX puré de castañas (de una lata)", "40 g / 1½ oz de azúcar en polvo", "50g / 1¾oz de chocolate negro liso, roto en cuadrados", "50g / 1¾oz de chocolate blanco, dividido en cuadrados", "1 cucharadita de azúcar glas"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Cubra una lata de rollo suizo de 23 x 33 cm / 9 x 13 pulgadas con papel pergamino para hornear, engrase con un poco de mantequilla y déjela a un lado. Coloque las yemas de huevo y el azúcar en un tazón grande y bata con un batidor eléctrico hasta que quede espeso y cremoso.", "Tamice el polvo de cacao sobre la mezcla de huevo y mezcle bien. Lave y seque los batidores.", "Batir las claras de huevo en un recipiente limpio hasta que estén firmes, pero no secos. Dobla un tercio de las claras de huevo en la mezcla de cacao, luego dóblalas suavemente hasta que estén distribuidas uniformemente. Verter en la lata preparada y extender suavemente con una espátula.", "Hornee en el centro del horno durante 20-25 minutos, o hasta que se levante y apenas comience a encogerse a los lados de la lata. Retire del horno, afloje los bordes con un cuchillo de hoja redonda y déjelo reposar durante unos minutos: el pastel se hundirá en la lata. Coloque un trozo de pergamino para hornear en la superficie de trabajo, coloque la torta en el pergamino y deje que se enfríe por completo.", "Para hacer el relleno, derrita el chocolate con 150ml / 5fl oz de la crema en una sartén antiadherente a fuego lento, revolviendo ocasionalmente hasta que quede suave. Retire del fuego.", "Coloque el puré de castañas en un procesador de alimentos con el azúcar. Con el motor en marcha, agregue lentamente el chocolate derretido y la crema y mezcle hasta que quede suave y liviano. Recorte los bordes de la esponja de chocolate enfriada y extienda suavemente con la mezcla de castaña.", "Batir el resto de la crema hasta que se formen picos suaves cuando se retire la batidora de la taza y extenderla sobre el relleno de castaña y chocolate. Usando el papel de pergamino para ayudarlo, enrolle la torta desde uno de los lados cortos y con cuidado la levante sobre una rejilla de alambre.", "Para hacer el relleno, derrita el chocolate blanco y el chocolate negro en dos tazones a prueba de calor colocados sobre fuentes de agua hirviendo a fuego lento, revolviendo ocasionalmente. Usando una cucharilla, rocíe el chocolate derretido sobre el rollo y déjelo reposar durante al menos 30 minutos.", "Enfríe en la nevera hasta que esté listo para servir, y retire de la nevera 30 minutos antes de servir. Polvo con un poco de azúcar glas tamizada."], "url": "www_bbc_co_uk_food_recipes_chestnut_and_chocolate_41539", "title": "Rollo de castaña y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,5 litros / 2½ pintas de pollo o verdura", "3 patatas grandes, peladas, picadas", "4 zanahorias, peladas, ralladas", "4 puerros, cortados, cortados por la mitad a lo largo, finamente cortados, más extra para servir", "6 cucharadas de avena de cocción rápida", "Queso Cheshire 400 g / 14 oz (preferiblemente una mezcla de blanco y azul), rallado", "sal y pimienta negra recién molida", "1 pan blanco de hogaza, finamente cortado en 12-16 rodajas", "Mantequilla 110g / 4oz, ablandada", "Queso Cheshire de 300g / 11oz, finamente cortado en 6-8 rebanadas", "3 cucharadas de aceite de oliva", "1 pequeño racimo de berros, solo hojas, para servir"], "method": ["Para la sopa de Cheshire, lleva el caldo a ebullición. Agregue las papas y cocine a fuego lento durante 4-5 minutos, luego agregue las zanahorias, los puerros y la avena y continúe hirviendo durante 4-5 minutos más, o hasta que los vegetales estén tiernos.", "Con un triturador de papas, triture cuidadosamente las verduras en la sartén hasta que se descompongan.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Agregue todo el queso y revuelva hasta que se derrita, luego sazone, al gusto, con sal y pimienta negra recién molida. Continúe cocinando a fuego lento durante 3-4 minutos más.", "Mientras tanto, para los sarnies de queso frito, extiende un lado de cada rebanada de pan con un poco de mantequilla. Empareda cada rebanada de queso entre dos rebanadas de pan, untadas con mantequilla hacia afuera.", "Caliente la mantequilla restante y todo el aceite de oliva en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue uno de los sándwiches de queso y fríalos por 2-3 minutos en ambos lados, o hasta que el pan esté tostado y dorado por ambos lados y el queso comience a derretirse. Retire de la sartén y mantenga caliente hasta que esté listo para servir. Repita el proceso con los sándwiches de queso restantes.", "Para servir, ponga la sopa de Cheshire en seis a ocho tazones para servir. Espolvorea sobre los puerros en rodajas y el berro. Cortar los sarnies de queso frito en cuadrados y servir al lado."], "url": "www_bbc_co_uk_food_recipes_cheshiresoupwithfrie_92118", "title": "Sopa de Cheshire con queso sarnies fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "200g / 7oz de mantequilla, refrigerada", "pizca de sal", "1 yema de huevo de gallinas camperas", "agua helada", "50g / 1¾oz de mantequilla", "2 puerros, en rodajas", "Setas de 350g / 12oz (como castañas o champiñones)", "2 dientes de ajo, en rodajas", "Tomillo de ramita grande, solo hojas", "Setas secas 15 g / ½ onzas (opcional), empapadas en 150 ml / 5 fl oz de agua recién hervida", "50g / 1¾oz de harina natural", "1 cucharadita de mostaza Dijon", "100 ml / 3½ fl oz marsala", "200-300ml / 7-10fl oz de caldo de verduras o pollo (cantidad dependiendo de si usa hongos secos o no)", "Castañas envasados ​​al vacío de 200g / 7oz, dejados enteros"], "method": ["Para hacer la masa, coloque la harina común y la mantequilla en un procesador de alimentos con una generosa pizca de sal y pulse hasta que se asemeje a pan rallado, o frótelo a mano. Agregue todo menos una cucharada de yema de huevo y suficiente agua fría para unirlo. Forme una pelota, envuélvala en una película adhesiva y relájese en la nevera hasta que esté listo para enrollarla. Reserve la yema de huevo restante para el lavado de huevos más tarde.", "Para hacer el relleno, ponga la mantequilla en una olla grande y derrita a fuego lento. Agregue los puerros y cubra. Freír por 5 minutos.", "Suba ligeramente el fuego y agregue los champiñones. Cocine por otros 4-5 minutos, luego agregue el ajo y el tomillo. Si se usa, escurra los champiñones rehidratados, reservando el licor de remojo y picar toscamente. Agregar a la olla.", "Agregue la harina y revuelva hasta que pueda ver que se ha formado un roux alrededor de las verduras.", "Agregue la mostaza, luego agregue el marsala y revuelva hasta que esté bien incorporado. Poco a poco agregue el caldo y el licor de hongos, si lo usa. (Si no usa el licor de champiñones, use la mayor cantidad de caldo). Lleve la mezcla a ebullición, baje y hierva a fuego lento, continuando hasta que se espese. Agregue las castañas, tape y retire del fuego. Deja enfriar.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Divida la masa en dos piezas, una ligeramente más grande que la otra. Extiende la pieza más grande de masa y úsala para alinear un plato de tarta. Agregue el relleno enfriado.", "Extienda la porción restante de pastel y cubra el pastel, mojando los bordes con el lavado de huevos, asegurándose de que estén bien apretados. Corta un par de hendiduras en el pastel para que salga el vapor y cepíllalas con un lavado de huevos.", "Hornee en el horno por alrededor de 40-45 minutos, o hasta que la masa esté dorada. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_chestnut_and_mushroom_43005", "title": "Pastel de castañas y champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnut_and_mushroom_43005_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 tomate grande, toscamente picado", "½ cebolla roja, más o menos picada", "8 dientes de ajo, pelados y dejados enteros", "splash salsa de soja", "1 cucharadita de pasta de chile chipotle", "salpicar vinagre de vino tinto", "100g / 3½oz de fechas picadas", "100 g / 3½ oz de castañas cocidas y peladas", "500g / 1lb 2oz de puré de papa", "2 huevos medianos de granja", "Harina de papa 250 g / 9 oz", "150g / 5½oz de pan rallado seco", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la salsa de chipotle picante, mezcle todos los ingredientes en una lata de asar. Hornee durante 20 minutos, o hasta que estén blandos. Dejar de lado para enfriar.", "Mientras tanto, para el kofta, ponga las fechas y las castañas en un procesador de alimentos y mezcle con una pasta grumosa. Dejar de lado.", "En un tazón grande, mezcle el puré de papa con los huevos y la harina de papa para formar una masa suave. Condimentar con sal y pimienta.", "Divida la masa de patata en 12-16 porciones iguales y enrolle en bolas. Aplaste la bola en un disco en su palma y presione una gran pizca de la mezcla de fecha de castaño en el centro, cerrando la masa de patata sobre la parte superior. Use sus manos para enrollar en un kofta pequeño y lleno, luego enrolle el kofte en las migas de pan. Repita con la mezcla restante.", "Caliente una freidora a 180 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Con cuidado, con una cuchara ranurada, baje el kofta en la freidora en pequeños lotes. Cocine por 2-3 minutos, o hasta que estén doradas. Levante el kofta con una espumadera y escurra sobre un plato forrado con papel de cocina, luego transfiéralo a un plato para servir.", "Coloque la mezcla de salsa tostada en un procesador de alimentos y mezcle hasta que quede suave pero con un poco de textura. Poner en un bol y servir con kofta."], "url": "www_bbc_co_uk_food_recipes_chestnut_and_date_kofte_88106", "title": "Castaño y kofta con salsa chipotle picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10-12 kofta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Castañas envasados ​​al vacío de 200g / 7oz, dejados enteros", "1 perejil pequeño de hojaldre, picado", "1 yema de huevo de gallinas camperas", "1 cucharadita de hojas de tomillo", "1 x 400 g / 14 oz de garbanzos cocidos de estaño, escurridos", "1 diente de ajo, aplastado", "algunas gotas de aceite de trufa, al gusto", "50-100 g / 1¾-3½ oz de queso parmesano (o alternativa vegetariana), rallado", "300-400 g / 10½-14oz puré de papa", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva"], "method": ["Combine todos los ingredientes, excepto el aceite de oliva, un procesador de alimentos; la cantidad de queso y papa variará de acuerdo con el gusto, cómo se cocinó la papa y la consistencia preferida. Condimentar con sal y pimienta", "Forme la mezcla en bolas y aplaste ligeramente. Déjalo reposar en la nevera durante 1 hora.", "Caliente el aceite de oliva en una sartén grande y cocine los falafels en ambos lados durante 2-3 minutos, hasta que se doren. Servir caliente con pittas y salsas."], "url": "www_bbc_co_uk_food_recipes_chestnut_falafels_26436", "title": "Falafels castaños", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas, más o menos picadas", "75 g / 2½ oz de mantequilla", "1 gran salvia hojas, finamente en rodajas", "400 g / 14oz de castañas cocidas, más o menos picadas", "300 g / 10½ oz de pan blanco fresco", "sal marina y pimienta negra recién molida", "Lomo de cerdo deshuesado de 5.5kg / 12lb con el vientre adjunto", "2 dientes de ajo, cortados por la mitad", "75 g / 2½ oz de mantequilla", "2 kg / 4 libras 6 onzas de papas King Edward, peladas y en rodajas finas", "pizca de nuez moscada recién rallada", "sal marina y pimienta negra recién molida", "Crema doble 600ml / 21fl oz", "600ml / 21fl oz de leche entera"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Coloque las cebollas en un procesador de alimentos y procese hasta que estén finamente picadas.", "Caliente una sartén hasta que esté medianamente caliente, agregue 25 g / 1 oz de la mantequilla y, cuando esté espumante, agregue la cebolla picada y cocine durante cinco minutos hasta que se ablande.", "Coloque la salvia, las castañas y las migas de pan en un tazón con las cebollas, sazone con abundante sal y pimienta negra, luego mezcle bien para combinar.", "Coloque la carne de cerdo, con la carne hacia arriba, en una tabla de cortar con la barriga alejada de usted.", "Con un cuchillo filoso, haga una incisión en el ojo del lomo a la mitad hacia abajo, paralela a la tabla, cortando casi todo el cuerpo. Abra el lomo y repita varias veces, cortando para que el lomo se abra y quede tan plano como la parte del vientre del cerdo.", "Sazone con sal y pimienta negra, luego vierta el relleno en el lomo y extiéndalo a lo largo del lomo, luego enrolle en una salchicha grande.", "Asegúrelo con la cuerda del cocinero a 5-6 puntos a lo largo del lomo y luego transfiera a una lata de asar.", "Frote el resto de la mantequilla sobre la parte superior de la carne de cerdo y sazone con abundante sal marina.", "Poner en el horno y asar durante cinco horas. El crujiente debe ser crujiente y el cerdo muy tierno.", "Para las patatas dauphinoise, cuando el cerdo se haya cocinado durante aproximadamente 3 horas, comience a preparar las papas. Frote un plato a prueba de horno con el ajo, luego frote alrededor de una cucharadita de la mantequilla en el interior y coloque las papas en el plato en capas, superponiendo un poco, hasta que el plato esté lleno. Sazone con sal, pimienta y nuez moscada entre cada capa.", "Vierta la crema y la leche sobre las papas para cubrir, luego sazone con sal y pimienta negra y salpique con la mantequilla restante. Cúbralo bien con papel de aluminio y colóquelo en el horno cuando la carne de puerco se haya asado durante cuatro horas.", "Una vez que las papas hayan estado cocinando por 30 minutos, encienda el horno a 200C / 400F / Gas 6, retire la lámina y cocine por otros 30 minutos, o hasta que las papas estén tiernas y el crujiente de cerdo esté crujiente.", "Retire las papas y la carne de cerdo del horno y deje reposar la carne de cerdo durante 30 minutos (deje las papas por más tiempo si necesitan más cocción mientras la carne de cerdo está en reposo).", "Para servir, esculpe la carne de cerdo en rodajas y sírvala con los jugos para asar y las patatas dauphinoise."], "url": "www_bbc_co_uk_food_recipes_chestnut_sage_and_onion_10683", "title": "Castaño, salvia y cebolla relleno de lomo de cerdo con patatas dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12-16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 hongos grandes", "80g / 2oz de mantequilla", "3 cucharadas de aceite de oliva", "6 ramitas de tomillo, recogido", "3 cucharadas de madeira", "2 cebollas medianas", "6 salchichas de Lincolnshire", "2 ramitas de romero, recogidas", "200g / 7oz de pan rallado", "200g / 7oz de lata de castañas picadas"], "method": ["Pre caliente el horno a 180C / 350F / Gas 4.", "Retire los tallos de las setas para permitir que se rellene y coloque en un plato de horno grande. Coloque un poco de mantequilla en cada uno y luego rocíe el aceite de oliva por todas partes. Espolvoree el tomillo en los champiñones y termine con unos generosos glugs de vino de Madeira. Pop en el horno durante 20 minutos.", "Ahora para el relleno, pique sus cebollas y ablande en una sartén con un poco de mantequilla hasta que estén doradas. Retire la piel de salchicha y rompa la carne en la sartén con las cebollas ahora doradas. Rasgue las hierbas restantes, agregue las migas de pan y deje que se cocinen un poco. Picar las castañas y agregar a la sartén y mezclar bien el contenido.", "Después de aproximadamente 20 minutos, quite los champiñones y apile generosamente su relleno en los champiñones, apilándolos lo más posible. No te preocupes por el relleno extra, simplemente dales forma de bolitas y colócalas alrededor de los hongos.", "Ahora devuelva el plato al horno durante media hora más. Sirve cuando el relleno esté crujiente y dorado."], "url": "www_bbc_co_uk_food_recipes_chestnut_stuffed_83323", "title": "Setas rellenas de castañas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnut_stuffed_83323_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "Castañas 100g / 3½oz, fuera de sus conchas", "200ml / 7fl de leche en oz", "2 cucharadas de miel", "pellizcar canela molida", "2 ramitas de menta fresca"], "method": ["En un recipiente, batir la crema hasta que se formen picos suaves cuando se quite la batidora.", "Coloque las castañas y la leche en un procesador de alimentos y mezcle hasta que quede suave. Dobla esta mezcla en la crema, junto con la mitad de la miel.", "Para servir, cuchara la mezcla en dos vasos para servir. Rocíe con la miel restante, espolvoréelo con canela y adorne con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_chestnutandhoneymous_88707", "title": "Mousse de castañas y miel, espolvoreado con canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 castañas cocidas (de un paquete), en rodajas", "5 cucharadas de yogur griego", "2 cucharadas de miel", "1 higo, en rodajas", "1 naranja, segmentado"], "method": ["Coloque las castañas, el yogur griego y la miel en un procesador de alimentos y mezcle.", "Colóquelo en el anillo de un cocinero y déjelo enfriar en la nevera durante diez minutos.", "Para servir, sacar de la nevera y quitar cuidadosamente el anillo de los cocineros.", "Decora el exterior con las rebanadas de higos y coloca segmentos de naranja en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chestnutandorangemou_78466", "title": "Mousse de castaño y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 lb 2 oz de hojaldre con mantequilla, extendido sobre una superficie de trabajo ligeramente espolvoreada con un grosor de 3 mm, cortado en 12 rectángulos de 16 cm x 8 cm / 6 pulg. X 3 pulg.", "2 peras pequeñas, peladas, sin núcleo, cortadas en rodajas finas a lo largo", "3 cucharadas de azúcar glas, más extra para quitar el polvo", "Crema doble 110ml / 4fl oz", "1 cucharada de ron oscuro", "250g / 9oz de puré de castañas endulzado en conserva", "110 g / 4 oz de castañas cocidas, finamente picadas", "200 g / 7 oz de azúcar en polvo", "400 ml / 14 fl oz crema doble"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para las milhojas, coloque los rectángulos de hojaldre sobre una bandeja para hornear y coloque otra bandeja para hornear encima (esto es para mantener la masa de hojaldre plana mientras se cocina). Transfiera al horno y hornee durante 10-15 minutos, o hasta que la masa se haya levantado y esté dorada. Retire del horno, retire la bandeja de horno superior y déjela a un lado para que se enfríe.", "Espolvoree dos cucharadas y media de azúcar glas en un plato. Dragar las rodajas de pera en el azúcar glas. Caliente una sartén a fuego medio hasta que esté caliente, luego cocine las rodajas de pera azucarada durante 1-2 minutos en cada lado, o hasta que aparezcan marcas de la plancha doradas en las peras. (Puede necesitar hacer esto en lotes).", "Coloque la crema doble, el ron y la otra mitad de cucharada de azúcar glas en un bol y bata hasta que se formen picos firmes cuando se quite el batidor.", "Agregue el puré de castañas y doble las castañas picadas.", "Para el caramelo, caliente suavemente el azúcar en una sartén antiadherente hasta que el azúcar se disuelva y se haya caramelizado. Continúe cocinando durante 4-5 minutos, o hasta que la mezcla esté dorada oscura. Retire del fuego y mezcle con la mitad de la crema doble.", "En un recipiente aparte, mezcle la crema doble restante hasta que se formen picos firmes cuando se quite la batidora.", "Vierta la mezcla de caramelo sobre la crema batida y dóblela.", "Para ensamblar los millefeuilles, extiende una fina capa de crema de castaña sobre cuatro de los rectángulos de hojaldre. Cubra cada uno con unas rodajas de pera.", "Coloque otra pieza de hojaldre en la parte superior de cada milhojas. Extienda otra capa de crema de castaña en la masa de hojaldre, y luego agregue algunas rodajas más de pera. Termine cada milhojas con un tercer rectángulo de hojaldre. Polvo con azúcar glas.", "Para servir, vierta la salsa de crema de caramelo en el centro de las cuatro placas para servir y coloque una milhoja en el centro de cada plato."], "url": "www_bbc_co_uk_food_recipes_chestnutandpearmille_92786", "title": "Millefeuille de castaña y pera", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva o maní", "1 cebolla pequeña, finamente picada", "1 diente de ajo, aplastado", "pizca de tomillo seco", "Vino tinto 150ml / ¼pt", "150ml / ¼pt de caldo de verduras", "Castañas picadas 100g / 4oz (peso cocido)", "Puré de castañas 100g / 4oz", "Migajas de pan integral de 75g / 3oz", "1 cucharada de aguardiente", "10-15 ml / 2-3 cucharaditas de salsa de soja", "sal y pimienta negra recién molida", "hierbas frescas, galletas y una ensalada verde fresca"], "method": ["Calentar el aceite en una olla, cocinar suavemente la cebolla y el ajo con el tomillo seco hasta que estén suaves.", "Agregue el vino tinto y el caldo de verduras y deje que hierva.", "Retirar del fuego y agregar las castañas picadas, el puré de castañas, el pan rallado, el brandy y la salsa de soja. Sazonar con sal y pimienta al gusto.", "Cocine a fuego lento hasta que espese. Coloque la pate en moldes individuales, alise la superficie y luego enfríe en el refrigerador hasta que se requiera.", "Sirva adornado con hierbas frescas, con galletas saladas y crujientes hojas de ensalada verde."], "url": "www_bbc_co_uk_food_recipes_chestnutandredwinepa_8837", "title": "Paté de castañas y vino tinto", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Castañas de 300g / 11oz", "50g / 2oz de mantequilla", "2 chalotes, finamente picados", "200 g / 7 oz de setas silvestres, limpiadas", "50ml / 2fl oz de brandy", "Crema doble 175ml / 6fl oz", "500g / 1lb2oz de pasta fresca de tagliarini", "2 cucharadas de perejil de flatillo, finamente picado", "2 cucharadas de perifollo, finamente picado", "25 g / 1 oz de queso parmesano, recién rallado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Perfore cada castaña con un cuchillo, haciendo una pequeña hendidura en el caparazón, esto evita que exploten en el horno. Coloque las castañas en una bandeja para hornear y tueste en el horno durante 20-25 minutos, hasta que estén tiernas. Retire del horno y deje enfriar, luego pele y corte aproximadamente.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y los chalotes y cocine durante 1-2 minutos.", "Agregue los champiñones y fría por un minuto más.", "Agregue el brandy y cuidadosamente coloque la luz en el brandy con un fósforo o inclinando la sartén hacia la llama. Tenga cuidado de no hacer esto debajo de los accesorios bajos y tenga cuidado con la ropa suelta.", "Agregue la crema y las castañas y deje que hierva. Reduzca el fuego y cocine a fuego lento durante dos minutos.", "Mientras tanto, lleve una olla grande de agua salada a ebullición, agregue la pasta y cocine según las instrucciones del paquete. Escurra la pasta, luego agregue a la salsa.", "Agregue el perejil, el perifollo y el parmesano y sazone al gusto con sal y pimienta negra recién molida. Mezcle bien y sirva en tazones."], "url": "www_bbc_co_uk_food_recipes_chestnutandwildmushr_89983", "title": "Castaño y tagliarini de setas silvestres", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4 oz de castañas secas, empapadas durante 6-8 horas", "2 hojas de laurel", "1 ramita de romero fresco o 1 cucharadita / 5 ml de romero seco", "210ml / 7fl oz de vino tinto vegetariano", "300ml / 10fl oz de caldo de verduras o agua", "25g / 1oz de mantequilla o margarina de soja", "8 cebollas pequeñas en escabeche o chalotes, pelados", "125 g / 4 oz de champiñones castaños, limpios", "125g / 4 oz de champiñones, limpios", "2 cucharaditas de mostaza Dijon", "2-3 cucharadas de tamari o salsa de soja", "pimienta negra recién molida", "perejil fresco, finamente picado", "225 g / 8 oz de hojaldre vegetariano, descongelado si está congelado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las castañas remojadas, las hierbas y 150 ml / 5 fl oz de vino en una olla con caldo de verduras para cubrir y cocine hasta que estén tiernas, aproximadamente 50-60 minutos. Escurre las castañas, reservando el líquido.", "Derrita la mantequilla en una sartén y saltee las cebollas hasta que estén ligeramente doradas.", "Agregue los champiñones y cocine por otros 4-5 minutos.", "Agregue las castañas, el vino tinto restante y suficiente licor de cocción de castañas para cubrir.", "Llevar a ebullición y cocine a fuego lento durante 20-30 minutos para reducir un poco el líquido.", "Agregue la mostaza, el tamari y la pimienta negra al gusto. Cocine por otros 5 minutos.", "Controle el condimento y ajuste según sea necesario.", "Vierta la mezcla en un plato para pastel. Estirar la masa en una superficie enharinada y colocar encima del relleno.", "Hornee durante unos 20 minutos hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_chestnutbourgignonpi_3042", "title": "Pastel de castaña Bourguignon", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de hojaldre listo para usar (descongelado si se congela)", "55g / 2oz de arroz salvaje", "2 cucharadas de aceite de oliva", "15g / ½oz de margarina vegana", "Puerros de 370 g / 13 oz, finamente picados", "110g / 4oz de setas de ostra, en rodajas", "200g / 7oz lleno de castañas cocidas y peladas, picadas", "2 ramitas de romero fresco, solo hojas, picadas", "1 cucharada de salvia fresca, finamente picada", "sal y pimienta negra recién molida", "1-2 cucharadas de salsa de soja"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Estirar la masa en una tabla ligeramente enharinada. Úselo para alinear cuatro anillos de flanco sueltos de 10 cm / 4 pulgadas individuales o uno grande de 20 cm / 8 pulgadas. No recorte el exceso de pastel todavía. Pincha la base por completo y deja reposar en la nevera durante 30 minutos. Hornee a ciegas durante 15-20 minutos hasta que la pasta esté cocida, luego recorte el exceso.", "Cocine el arroz en agua hirviendo hasta que los granos se separen (aproximadamente 30-40 minutos). Escurrir y dejar enfriar.", "Caliente el aceite de oliva y la margarina en una sartén y fríe los puerros por unos cinco minutos hasta que estén blandos.", "Agregue los champiñones y fríalos por otros cinco minutos, luego mezcle las castañas, el romero, la salvia y el arroz salvaje cocido y sazone bien con sal y pimienta negra recién molida.", "Agregue la salsa de soja y cocine por otros dos minutos. Eche el relleno en la (s) caja (s) de repostería y vuelva al horno para hornear por 5-10 minutos, hasta que se caliente."], "url": "www_bbc_co_uk_food_recipes_chestnutleekandmushr_66048", "title": "Tartaletas de castaña, puerro y champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnutleekandmushr_66048_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 panettone mediano", "1 cucharada de ron (opcional)", "450 g / 1lb de mascarpone", "285 g pueden endulzar el puré de castañas", "290ml / 10fl oz de crema doble, ligeramente azotada", "4 cucharadas de azúcar glas", "85 g / 3 oz de chocolate negro, rallado"], "method": ["Coloque un molde de anillo engrasado de 22 cm / 8 pulgadas en una bandeja para hornear.", "Corta una rebanada de la parte inferior del panettone para alinear la base del molde.", "Cuchara sobre el ron.", "Procesar juntos el mascarpone y el puré de castañas. Coloque en un tazón grande y doble la crema ligeramente batida.", "Extendido sobre la base del panettone. Enfríe en la nevera.", "Retire el anillo colocando una toalla de té caliente alrededor del borde y levantándolo.", "Espolvorea sobre el chocolate rallado, espolvorea un poco de azúcar glas, corta y sirve."], "url": "www_bbc_co_uk_food_recipes_chestnutmoussewithpa_65666", "title": "Mousse de castañas con panettone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Calabaza de 1.5kg / 3lb 5oz, sin semillas, carne cortada en grandes cuñas", "5 cucharadas de aceite de oliva", "1 cebolla picada", "1 diente de ajo, finamente picado", "2 papas, cortadas en cubos", "1 manzana Bramley, pelada, sin núcleo, carne picada", "2 litros / 3½ pintas de pollo caliente o caldo de verduras", "1 ramita de tomillo fresco", "2 hojas de laurel", "Castañas de 500 g / 1 lb 2 oz, asadas y peladas, más extra, en rodajas, para servir", "400g / 14oz de puré de castañas listo para usar", "sal y pimienta negra recién molida", "aceite de trufa, para lloviznar", "crema doble, para rociar (opcional)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las piezas de calabaza en una lata de tueste y rocíe sobre tres cucharadas de aceite de oliva. Transfiera al horno y tueste durante 25-30 minutos, o hasta que la calabaza esté tierna y dorada. Dejar de lado para enfriar.", "Cuando la calabaza se haya enfriado, escurra el aceite y quítele la piel, teniendo cuidado de no quemarse los dedos.", "Caliente el aceite de oliva restante en una sartén grande a fuego medio, agregue la cebolla, el ajo, las papas y la manzana y fría por 4-5 minutos, revolviendo regularmente, hasta que se ablanden.", "Agregue el caldo, la calabaza asada, el tomillo, las hojas de laurel, las castañas y el puré de castañas. Revuelva bien y condimente, al gusto, con sal y pimienta negra recién molida.", "Ponga la mezcla a ebullición, baje el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que las papas estén tiernas. Dejar de lado para enfriar.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave. Regrese a la sartén y caliente hasta que se caliente.", "Para servir, divida la sopa por igual entre diez tazones para servir. Adorne cada porción con unas gotas de aceite y crema de trufa (si se usa) y espolvoree sobre las castañas asadas en rodajas."], "url": "www_bbc_co_uk_food_recipes_chestnutroastedbutte_90627", "title": "Castaño, calabaza tostada y sopa de manzana Bramley", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnutroastedbutte_90627_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 750 g / 1 lb 10 oz de cangrejo marrón cocido", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de comino", "25 g / 1 oz de carne de coco fresca o congelada, mezclado en un procesador de alimentos o rallado", "2 cucharadas de aceite vegetal", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de fenogreco", "10 dientes de ajo, finamente picados", "3 chalotes, en rodajas finas", "1 cebolla, finamente rebanada", "10-14 hojas frescas de curry", "2 cucharaditas de chile en polvo Kashmiri", "1 cucharadita de cúrcuma molida", "4-5 tomates, finamente picados", "2 cucharadas de kokum seco picado (disponible en tiendas especializadas en India)", "1 cucharadita de tamarindo líquido", "1 cucharada de cilantro molido", "1 cucharadita de azúcar morena o azúcar morena", "1 cucharadita de sal"], "method": ["Para el cangrejo, rompa las aletas de cola y deseche. Rompe las garras, luego toma un cuchillo de hoja grande y córtalo por la mitad en la articulación; romper las conchas de cada pieza con un martillo o la parte posterior de un cuchillo. Corta la sección del cuerpo por la mitad, luego tira suavemente de las patas para sacar las piezas del cuerpo de la carcasa posterior. Use un cuchillo como una palanca adicional si es necesario, pero las piezas del cuerpo deben salir con bastante facilidad con las piernas aún unidas. Voltee cada pieza y quite los dedos del muerto (branquias suaves), luego corte a la mitad una vez más para que tenga dos patas unidas a cada pieza.", "Para la pasta de coco, moler el hinojo y las semillas de comino en un almirez y mortero, luego agregar a un procesador de mini alimentos con el coco y un chorrito de agua y mezclar hasta obtener una pasta homogénea.", "Para el masala, caliente el aceite en una sartén de base pesada o karahi a fuego medio, agregue las semillas de hinojo y alholva, el ajo, los chalotes y la cebolla y fría por 10 minutos, o hasta que la cebolla esté dorada.", "Agregue las hojas de curry, el chile en polvo y la cúrcuma, fríe durante 30 segundos y luego agregue los tomates. Cocine a fuego lento durante 5-10 minutos, revolviendo ocasionalmente, hasta que los tomates se hayan reducido a una pulpa.", "Agregue la pasta de coco y fría por 2-3 minutos. Agregue 200 ml / 7 fl oz de agua y el kokum, líquido de tamarindo, cilantro, azúcar y sal y llevar a ebullición. Agregue el cangrejo, cubra la sartén y cocine a fuego alto durante 3-4 minutos, o hasta que la salsa sea rica y bastante espesa, agregando un chorrito de agua si parece que se engancha en el fondo de la sartén. Servir."], "url": "www_bbc_co_uk_food_recipes_chettinad_crab_curry_53083", "title": "Chettinad cangrejo al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]