[{"ingredients": ["80ml / 3fl oz de aceite de oliva", "2 dientes de ajo, pelados, aplastados", "24 tomates cherry", "2 cucharaditas de pimentón ahumado", "1 guindilla, finamente picada", "2 chipirones, limpios, cuerpo cortado en anillos, tentáculos picados", "1 pimiento rojo, muy finamente cortado", "1 lima, solo jugo", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Caliente el aceite y el ajo en una sartén a fuego medio hasta que el ajo comience a colorear. Retire el ajo con una cuchara ranurada y deséchelo.", "Agregue los tomates, el pimentón y los chiles y cocínelos durante 4-6 minutos, o hasta que los tomates se rompan.", "Agregue el calamar y cocine, revolviendo bien, durante 2-3 minutos, o hasta que el calamar esté recién cocido, pero todavía tierno.", "Agregue el pimiento rojo, el jugo de lima y el perejil y sazone bien con sal y pimienta negra recién molida.", "Servir en cuencos pequeños con una cesta de pan crujiente al lado."], "url": "www_bbc_co_uk_food_recipes_tapasstylespicytomat_89039", "title": "Calamar de tomate picante estilo Tapas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de caballa cocinado", "55g / 2oz de queso crema", "2 cucharadas de eneldo fresco, picado", "½ cucharadita de salsa Tabasco", "2 rebanadas de pan tostado", "2 cebollas de primavera, picadas", "100g / 3½oz de aceitunas negras, picadas", "3 cucharadas de perejil de flatillo, picado", "½ diente de ajo, picado", "55ml / 2fl oz de aceite de oliva"], "method": ["En un tazón, mezcle la caballa con el queso crema, el eneldo y la salsa Tabasco.", "Extienda la mezcla de caballa sobre la tostada y espolvoree con la cebolla picada.", "En una licuadora, acelera las aceitunas con el perejil y el ajo.", "Continúa mezclando, agregando lentamente el aceite de oliva para formar una pasta suave.", "Para servir, coloque la tostada en un plato y rocíe con la salsa Tapenade."], "url": "www_bbc_co_uk_food_recipes_tapenadeandmackerelo_78292", "title": "Tapenade y caballa en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 25 g / 1 oz de salmón fresco, cortado en cubos", "3 cucharadas de cilantro fresco picado", "3 cucharadas de cebolletas frescas picadas", "1 cucharadita de aceite vegetal", "2 cucharadas de semillas de sésamo", "1 diente de ajo, picado", "3 cucharadas de agua", "½ limón, solo jugo", "150g / 5½oz de repollo Savoy, rallado"], "method": ["Coloque el salmón, el cilantro y el cebollín en un tazón y mezcle suavemente.", "Caliente el aceite en una olla pequeña y cuando esté caliente agregue el salmón y cocínelo durante 1-2 minutos, o hasta que esté cocido y dorado por todos lados.", "Para la ensalada de repollo Savoy, coloque las semillas de sésamo, el ajo, el agua y el jugo de limón en un procesador de alimentos y mezcle hasta obtener un aderezo suave.", "Coloque la col Savoy rallada en un recipiente grande y agregue el aderezo, revolviendo bien para cubrir.", "Para servir, coloque la ensalada de repollo en el centro de un plato y cubra con las piezas de salmón."], "url": "www_bbc_co_uk_food_recipes_taretakkirolledherbs_80609", "title": "Salmón de hierbas en ensalada de repollo Savoy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lentejas rojas de 400 g / 14oz, enjuagadas en un colador con agua corriente fría", "2 cucharaditas de cúrcuma molida", "25g / 1oz de mantequilla", "2 cucharaditas de semillas de comino", "3 dientes de ajo, finamente picados", "1-2 chiles verdes, finamente picados, al gusto", "sal y pimienta", "200g / 7oz de arroz, cocinado de acuerdo con las instrucciones del paquete"], "method": ["Coloque las lentejas en una cacerola y cúbralas con suficiente agua para que queden 3 cm / 1 ¼ pulgadas por encima de las lentejas. Llevar a ebullición, rozando cualquier espuma a medida que la llevas a ebullición. Una vez que hierva a fuego lento, agregue la cúrcuma junto con la mitad de la mantequilla. Cocine a fuego lento durante 20 minutos, o hasta que las lentejas estén completamente blandas y el agua se absorba, pero la mezcla no esté seca.", "Mientras tanto, caliente una sartén pequeña a fuego medio. Agregue las semillas de comino y fría hasta que estén tostadas y aromáticas (alrededor de 1-2 minutos). Retire las semillas de comino de la sartén y póngalo a un lado. Agregue la mantequilla restante a la sartén y, una vez derretida, fría el ajo y pique la guindilla verde durante 1-2 minutos, o hasta que el ajo se ponga dorado claro, y la guindilla se ablanda. Agregue las semillas de comino tostadas a la sartén y retírelas del fuego.", "Una vez que las lentejas estén blandas, dales un fuerte revuelo para separarlas un poco. Mezcle la mezcla de chile y ajo (incluida cualquier mantequilla) en la sartén con las lentejas y mezcle bien. Pruebe y ajuste el condimento según sea necesario.", "Sirve el tarka dal junto con el arroz cocido."], "url": "www_bbc_co_uk_food_recipes_tarka_dahl_with_rice_01844", "title": "Tarka dal con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarka_dahl_with_rice_01844_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de frijol mungo dividido (mung dal), lavado", "Lentejas rojas 175g / 6oz (masoor dal)", "2 cucharaditas de chiles verdes picados (o al gusto)", "1 cucharadita de cúrcuma molida", "2 cucharaditas de sal (o al gusto)", "2 cucharadas de aceite de girasol", "30g / 1oz de mantequilla", "2½ cucharaditas de semillas de comino", "5 dientes de ajo, finamente picados", "Jengibre fresco de la raíz 3cm / 1¼, finamente rallado", "1 cebolla, finamente picada", "2 tomates, picados", "2 cucharaditas de sal masala", "puñado de cilantro fresco, toscamente picado, para adornar", "275g / 9¾oz de harina de chapati media, más extra para espolvorear", "1 cucharadita de sal", "25g / 1oz de mantequilla, para servir"], "method": ["Para hacer el dal, coloque ambos dal en una olla grande y vierta más de 1.7 litros / 3 pintas de agua. Agregue los chiles, la cúrcuma y la sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que esté cocido.", "Mientras tanto, caliente el aceite y la mantequilla en una cacerola pequeña a fuego medio. Agregue el comino, el ajo, el jengibre, la cebolla y los tomates y cocínelos durante 12-15 minutos.", "Para hacer los chapatis, combine la harina con la sal y 100-150 ml / 3½ -5 fl oz de agua para formar una masa. Amasar bien, formar bolitas del tamaño de una pelota de golf y reservar en una superficie ligeramente enharinada.", "Caliente un tava o sartén a fuego medio. Extiende cada bola de masa y plancha cada chapati por unos minutos en ambos lados. Unte con un poco de mantequilla y manténgalo caliente hasta que esté listo para servir.", "Cuando el dal esté cocido, agregue la mezcla de cebolla y tomate y el garam masala, vuelva a hervir y luego retírelo del fuego. Adorne con cilantro antes de servir con los chapatis."], "url": "www_bbc_co_uk_food_recipes_tarka_dal_with_chapattis_03213", "title": "Tarka dal con chapatis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de chana dal (guisantes amarillos secos), enjuagados hasta que el agua salga clara", "3 cucharadas de aceite vegetal", "1 cucharada de semillas de comino", "1 cebolla pequeña, picada", "3-4 chiles verdes enteros, pinchados con un cuchillo", "2cm / ¾ en pieza de jengibre fresco, pelado y cortado en tiras finas", "3 dientes de ajo, pelados y dejados enteros", "3 tomates", "¾ cucharadita de cúrcuma molida", "¾ cucharadita de sal masala", "1½ cucharadita de cilantro molido", "sal y pimienta negra recién molida", "puñado de hojas de cilantro fresco picado"], "method": ["Coloque las lentejas y 900ml / 1¾ pintas del agua en una sartén, revuelva bien y lleve a ebullición. Elimine cualquier espuma que se forme en la superficie del agua con una cuchara. Cubra la olla con una tapa y reduzca el fuego a fuego lento. Cocine a fuego lento, revolviendo regularmente, durante 35-40 minutos, o hasta que las lentejas estén tiernas, agregando más agua según sea necesario.", "Cuando las lentejas se hayan cocinado, retire la sartén del fuego y use un batidor para romper las lentejas. Deja la mezcla a un lado para espesar y enfriar.", "Mientras tanto, caliente el aceite en una sartén a fuego medio. Agregue las semillas de comino y fría por 20-30 segundos, o hasta que estén fragantes.", "Agregue la cebolla, los chiles y el jengibre y fría por 4-5 minutos, o hasta que estén dorados.", "Mezcle el ajo y los tomates con un puré en un procesador de alimentos. Agregue el puré a la sartén y mezcle bien para combinar.", "Agregue las especias molidas y 100 ml / 3½ fl oz de agua a la sartén y revuelva bien para combinar. Sazonar, al gusto, con sal y hervir a fuego medio durante 15-20 minutos, o hasta que el aceite de la salsa haya subido a la superficie de la salsa.", "Agregue las lentejas cocidas a la salsa y mezcle bien, agregando más agua según sea necesario para aflojar la mezcla. Llevar la mezcla a ebullición y sazonar, al gusto, con sal y pimienta negra recién molida. Agregue el cilantro picado justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_tarkadal_90055", "title": "Tarka dal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6 como un lado, 2 como principal", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarkadal_90055_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 papas para hornear grandes", "25g / 1oz de mantequilla", "3 yemas de huevo de gallinas camperas", "1 cebolla pequeña", "25g / 1oz de mantequilla, más extra para engrasar", "300g / 10½ oz champiñones", "1 pequeño manojo de estragón recogido, finamente picado", "50g / 1¾oz de pan blanco fresco", "75g / 2½oz de carne picada de cordero", "sal y pimienta negra recién molida", "2 x 7 huesos francés recortado bastidores de cordero"], "method": ["Para las papas Duquesa, precaliente el horno a 200C / 400F / Gas 6.", "Hornee las papas en el horno durante aproximadamente 1-1¼ horas, o hasta que estén tiernas cuando las atraviese un cuchillo.", "Para la corona de cordero rellena de estragón, coloca la cebolla en un procesador de alimentos y pulsa hasta que esté muy finamente picada.", "Calentar una sartén hasta que esté tibia, agregar la mantequilla y las cebollas y freír suavemente durante unos minutos.", "Agregue los champiñones al procesador de alimentos y mezcle hasta lograr un puré realmente fino, luego agréguelos a la sartén. Encienda el fuego y fríalo durante 2-3 minutos, o hasta que toda la humedad de los champiñones haya desaparecido.", "Incline en un recipiente con estragón, pan rallado y carne picada. Sazonar generosamente con sal y pimienta negra.", "Frote un poco de mantequilla sobre una hoja de papel de aluminio. Coloque la lámina en una bandeja de horno, con la mantequilla hacia arriba.", "Ate los dos bastidores de cordero para formar un círculo y colóquelo sobre la lámina untada con mantequilla. Coloque el relleno en el centro, empacando bien. Coloque en el horno (ajustado a 200C / 400F / Gas 6) durante 50-60 minutos, luego retírelo y descanse durante 10 minutos.", "Mientras tanto, para las papas duquesa, retire las papas del horno y, cuando estén lo suficientemente frías para manipularlas, saque la carne y páselo por un colador fino en un recipiente.", "Batir hasta obtener un puré suave y esponjoso, luego agregar la mantequilla y las yemas de huevo. Condimentar con sal y pimienta.", "Coloque una cuchara en una manga pastelera y coloque pequeñas pirámides en una bandeja para hornear y colóquelas en el horno de 5 a 10 minutos o hasta que estén doradas.", "Para servir, esculpe el cordero y sirva con las papas de duquesa."], "url": "www_bbc_co_uk_food_recipes_tarragon_stuffed_crown_01121", "title": "Tarragon relleno corona de cordero con duquesa patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de lubina, piel sobre", "40 g / 1½ oz de mantequilla", "Pan rallado panko de 60 g / 2¼ oz", "1 limón sin cebar, ralladura finamente rallada", "1 cucharada de estragón fresco picado", "40 g / 1½ oz de queso parmesano, rallado grueso", "sal y pimienta negra recién molida", "200g / 7oz de crema fresca", "dash caster sugar", "1 cucharada de jugo de limón"], "method": ["Precaliente el horno Ventilador / Gas 200C / 180C 6. Cubra una bandeja grande para hornear con papel de hornear.", "Sazonar bien los filetes de lubina en ambos lados con sal y pimienta.", "Derrita la mantequilla en una sartén poco profunda. Retire del fuego, agregue el pan rallado, la ralladura de limón y la mitad del estragón. Mezcle y reserve.", "Coloque la mitad de la mezcla de pan rallado en cuatro filas en la bandeja preparada. Coloque los filetes en la parte superior, con la piel hacia abajo y presione firmemente en las migas. Cubra cada filete con las migas restantes y espolvoree con queso parmesano. Hornee durante 12-15 minutos hasta que estén cocidos. Corta el limón en trozos.", "Para hacer la salsa, mezcle la crema fresca, el estragón restante, el azúcar y el jugo de limón en un tazón. Condimentar con sal y pimienta.", "Sirva el pescado con una cucharada de salsa y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_tarragon_crusted_sea_93411", "title": "Lubina en costra de estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarragon_crusted_sea_93411_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo sin piel, aplastada con un rodillo", "Zumo de 1 lima", "1 diente de ajo, triturado y cortado en cubitos", "2 cucharadas de aceite de oliva", "1 cebolla roja picada", "Vino blanco 150ml", "½ cubo de caldo de pollo", "1 cucharada de crema doble", "1 cucharadita de mostaza integral", "1 cucharada de estragón, picado", "1 cabeza de achicoria", "1 zanahoria, pelada y rallada", "montón de cebolletas, picadas", "1 cucharada de aceite de oliva", "1 cucharada de jugo de limón", "1 cucharadita de vinagre balsámico"], "method": ["Cortar el pollo en tiras y echar en un bol con el jugo de lima, el ajo y una cucharada de aceite de oliva.", "Caliente el aceite restante en una sartén honda. Agregue la cebolla roja y el vino blanco y cocine a fuego lento.", "Agregue el pollo, desmenuce en el cubo de la acción y cocine a fuego lento durante aproximadamente diez minutos, o hasta que el pollo esté bien cocido.", "Agregue la crema y la mostaza integral a la sartén y continúe cocinando a fuego lento durante dos minutos, hasta que se reduzca y espese un poco.", "Agregue el estragón picado y revuelva.", "Para la ensalada, mezcle la achicoria, la zanahoria y el cebollín. Agregue el aceite, el jugo de limón y el vinagre balsámico y mezcle bien.", "Para servir, espolvorea el pollo sobre la ensalada y rocía con la crema y la salsa de mostaza."], "url": "www_bbc_co_uk_food_recipes_tarragonchickenoncar_78548", "title": "Pollo de estragón en ensalada de zanahoria y achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "100g / 3½oz de mantequilla fría, cortada en cubos pequeños", "25g / 1oz de azúcar glas", "1 yema de huevo de gallinas camperas", "1 cucharada de agua fría", "5 huevos de gallinas camperas", "125ml / 4fl oz de crema doble", "225 g / 8 oz de azúcar en polvo", "4 limones, jugo y ralladura", "azúcar en polvo, para quitar el polvo"], "method": ["Para hacer la masa, coloque la harina, la mantequilla y el azúcar glas en un procesador de alimentos. Pulsar brevemente hasta que la mezcla se asemeje a pan rallado, luego agregar la yema de huevo y el agua.", "Pulse de nuevo hasta que la mezcla se adhiera en grupos, luego incline sobre una superficie de trabajo y júntela con sus manos. Amasar la masa solo dos o tres veces para que quede suave. Si tu mantequilla estaba demasiado blanda, la masa también podría estarlo. Si es así, envuélvala en papel pergamino y déjela enfriar por 15 minutos.", "Engrase una lata agria acanalada de 23cm / 9in de fondo suelto.", "Coloque un pedazo de papel de pergamino en la superficie de trabajo. Retire la base de la tarta de estaño y colóquela en el papel. Con un lápiz, dibuja un círculo sobre el papel 4 cm / 1½ pulgadas más grande que la base de estaño.", "Espolvorea la base de la lata con harina. Coloque la bola de repostería en el centro de la base de estaño y aplánela ligeramente. Estirar la masa, aún en la base, hasta que se encuentre con la marca del círculo. A medida que va desplegando, gire la masa girando el papel. Doble suavemente la masa que rodea la base de estaño hacia el centro.", "Levante con cuidado la base de estaño de la superficie de trabajo, colóquela en la lata, luego coloque la masa en las esquinas y hacia los lados de la lata, presionando ligeramente el saliente sobre el borde. Si la masa se ha agrietado, simplemente presiónela para sellarla. Presione la masa dentro de las ranuras de la lata y luego toque ligeramente la base con un tenedor, pero no del todo. Coloque la lata revestida de pastelería en una bandeja para hornear, cúbrala con film transparente y deje enfriar en la nevera durante 30 minutos. Precalentar el horno a 200C / 400F / Gas 6.", "Retire la película adhesiva de la caja de pastelería y alinee con papel de aluminio para que apoye los lados, luego llene con alubias para hornear. Hornee a ciegas por 12-15 minutos, hasta que la masa esté lista, luego levante la hoja y los frijoles. Cuidadosamente recorte el exceso de masa de los lados con un cuchillo afilado, sosteniendo el cuchillo en un ángulo agudo y cortando lejos de usted. Retire los adornos de la hoja. Devuelva la caja de repostería vacía al horno durante otros 10-12 minutos o hasta que esté dorada y completamente seca. Déjalo enfriar mientras haces el relleno. Reduzca la temperatura del horno a 170 C / 325 F / Gas 3.", "Para el relleno, rompa los huevos en un tazón grande y mezcle con un batidor de alambre. Agregue el resto de los ingredientes de relleno y bata de nuevo hasta que estén bien combinados. Vierta la mezcla de relleno en una jarra, luego en la caja de repostería recién horneada. Para evitar que se derrame mientras entra al horno, vierta la mayor parte del relleno de modo que casi llene la tarta, coloque con cuidado la bandeja para hornear y tarta en el estante del horno, luego rellene con el resto del relleno para llenarlo por completo. Hornee por unos 30-35 minutos o hasta que esté listo, pero con un ligero bamboleo en el centro.", "Deja enfriar un poco, cuando la masa parezca lo suficientemente firme, retira la tarta de la lata. La forma más fácil de hacerlo es colocar la base de la lata sobre una lata volcada o un tarro de mermelada y dejar que el anillo externo caiga a la superficie de trabajo. Transfiera la tarta a un plato para servir y sirva caliente o fría, espolvoreada con azúcar glas tamizada."], "url": "www_bbc_co_uk_food_recipes_tarte_au_citron_94480", "title": "Tarta de limón", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_au_citron_94480_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de masa de pasta corta", "harina común, para quitar el polvo", "Queso Cheshire 200 g / 7 oz, rallado", "Crema doble 225ml / 8fl oz", "2 huevos de gallinas camperas, golpeados", "100g / 3½oz de queso crema", "sal marina y pimienta negra", "1 yema de huevo de gallinas camperas", "1 cucharadita de leche"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y use dos tercios de ella para revestir una lata de tarta acanalada de 23 cm / 9 pulg. Coloque la caja de repostería en la nevera para enfriar mientras prepara el relleno y luego junte los restos y la masa restante, enrolle una bola, envuélvala en una película adhesiva y déjela a un lado.", "Pon el queso Cheshire en un procesador de alimentos y mézclalo con una miga fina. Poco a poco agregue la crema, mezcle hasta que la mezcla esté suave, luego agregue los huevos, queso crema y una pizca de sal y pimienta y mezcle de nuevo para combinar.", "Vierta la mezcla en la caja de repostería, luego despliegue el exceso de masa para hacer una tapa. Cepille el borde de la caja de pastelería con un poco de agua, cubra con la tapa y pellizque para sellar.", "Para el glaseado, mezcle la yema de huevo y la leche en un tazón pequeño. Recorte los bordes de la tarta y luego cepille la parte superior con el glaseado. Hornee durante 30 minutos o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_tarte_owt_of_lente_36277", "title": "Tarte owt de lente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Manzanas de postre de 2kg / 4½lbs, aproximadamente 12, peladas", "3 cucharadas de agua", "100 g / 3½ oz de azúcar en polvo", "60 g / 2½ oz de mantequilla sin sal fría, cortada en cubitos", "30 g / 1 oz de mantequilla sin sal, derretida, para agregar riqueza", "Hojaldre de mantequilla de 300g / 11oz, laminado hasta un grosor de 3 mm / ⅛in, cortado muy ligeramente más grande que el diámetro de la tarta de estaño, pinchado con un tenedor y congelado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corta las manzanas por la mitad horizontalmente, quita los núcleos y corta las partes superior e inferior redondeadas de las manzanas para que queden planas en la lata.", "Pon el agua en el fondo de la lata y espolvorea sobre el azúcar. Deje reposar durante dos minutos para permitir que el agua absorba el azúcar.", "A fuego medio, cocine el jarabe hasta que se convierta en un caramelo rubio pálido (no lo deje demasiado oscuro o el sabor dominará las manzanas), luego agregue la mantequilla picada, esto evitará que el caramelo se cocine y le dará una mayor riqueza al plato.", "Coloque las manzanas, los medios arriba, alrededor del borde de la lata y luego llene el centro con las manzanas restantes. Es importante empacarlos lo más apretado posible - presione hacia abajo con las manos sobre la marcha.", "Cepille las manzanas con la mantequilla derretida y coloque la lata en una bandeja para hornear. Hornee en el horno por 30 minutos.", "Retire del horno y coloque el disco de masa congelada en la parte superior. Meta los bordes de la masa en el plato y pinche algunos agujeros con un cuchillo afilado para dejar salir el vapor mientras se cocina el plato.", "Regrese al horno por otros 40-45 minutos, o hasta que la masa esté crujiente y dorada.", "Dejar enfriar a temperatura ambiente durante una hora antes de sacar la lata y servir caliente. Alternativamente, haga la tarta el día anterior y vuelva a calentar como arriba."], "url": "www_bbc_co_uk_food_recipes_tarte_tatin_72509", "title": "Tarta tatin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_tatin_72509_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200 g / 7 oz, tamizada", "1 pizca de sal", "100 g / 3½ oz de mantequilla, refrigerada y en cubos", "2 cucharadas de crema agria o crème fraîche", "4 comiendo manzanas, Granny Smith o Golden Delicious; si usa una variedad pequeña, como Cox's Orange Pippin, necesitará alrededor de 6 manzanas", "125 g / 4½ oz de azúcar en polvo", "100ml / 3½ oz de agua", "25g / 1oz de mantequilla", "1 huevo de gallinas camperas, golpeado", "crema batida, helado o crema batida con un poco de azúcar glas", "canela molida o Calvados"], "method": ["Para la masa agria de crema pastelera, coloque la harina, la sal y la mantequilla en un procesador de alimentos y mezcle brevemente. Agregue la mitad de la crema agria y continúe mezclando. Puede agregar un poco más de crema agria, pero no demasiado, ya que la mezcla debe estar lo suficientemente húmeda como para unirse. Si se hace a mano, frote la mantequilla en la harina hasta que se asemeje a migas de pan gruesas y luego, con las manos, agregue suficiente crema agria para unirla.", "Con las manos, aplana la bola de masa hasta que tenga unos 2 cm / ¾ de grueso, luego envuélvela en una película adhesiva o colócala en una bolsa de plástico y déjala en la nevera durante al menos 30 minutos o, si te piden tiempo, entra el congelador por 10-15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno: prepare las manzanas peinándolas con un pelador para mantenerlas en una forma redondeada y luego córtelas en cuartos. Retire el núcleo de cada cuarto y déjelo a un lado. No se preocupe si se vuelven marrones, y no se cubren con agua o estarán demasiado húmedos.", "Coloque el azúcar y el agua en una olla de horno de tamaño mediano colocada a fuego medio-bajo y revuelva hasta que el azúcar se disuelva.", "Aumente el fuego y hierva el almíbar hasta que comience a caramelizar alrededor de los bordes, unos cinco minutos. No revuelva una vez que ha llegado a punto de ebullición, de lo contrario el jarabe se cristalizará. Una vez que el jarabe comience a dorarse, es posible que deba agitar ligeramente la sartén para igualar la caramelización.", "Una vez que el jarabe es de color dorado-caramelo, agregue la mantequilla y agite la sartén otra vez para distribuirlo a través del caramelo.", "Retire la sartén del fuego y coloque los cuartos de manzana en un círculo concéntrico alrededor del exterior y cualquier pieza restante en el centro, teniendo en cuenta que la tarta se volteará cuando se sirva. Las manzanas deben cubrir completamente la base de la sartén; ¡puede necesitar una manzana extra!", "Coloque la sartén a fuego medio y cocine durante 10 minutos para que las manzanas estén ligeramente caramelizadas, mientras extiende la masa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada en un disco de aproximadamente 2 cm de diámetro más ancho que la sartén. Retire la sartén del fuego y coloque la masa en la parte superior de las manzanas casi cocidas. Usando la base de una cuchara o un tenedor, coloque la masa alrededor de los bordes de las manzanas. Cepille la masa con huevo batido y, con un pincho o tenedor, haga unos agujeros en la masa.", "Hornee en el horno durante 25 minutos o hasta que la masa esté dorada y las manzanas se sientan cocidas cuando inserte un pincho en el centro.", "Retire del horno y deje reposar durante unos minutos antes de colocar un plato encima de la sartén y cuidadosamente (¡está caliente!) Pero rápidamente voltéelo. Use un plato con un ligero labio para atrapar los deliciosos jugos. Cortar en rodajas para servir. Sirva con crema batida, helado o crema batida con un poco de azúcar glas y canela o calvados mezclados."], "url": "www_bbc_co_uk_food_recipes_tarte_tatin_05826", "title": "Tarta tatin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz Patatas Charlotte, peladas", "Tocino tocino 250 g / 8 oz", "2 chalotas", "1 diente de ajo", "100ml / 3½fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "sal marina y pimienta negra recién molida", "1 queso Reblochon entero (aproximadamente 450 g / 1 libra), rebanado"], "method": ["Para tartiflette, precaliente el horno a 200C / 400F / Gas 7.", "Cocine las papas en una olla con agua hirviendo con sal durante 5-10 minutos, o hasta que estén tiernas.", "Escurrir y dejar a un lado para que se enfríe un poco.", "Mientras tanto, caliente una sartén hasta que esté caliente y fría el tocino, los chalotes y el ajo durante 4-5 minutos, o hasta que estén dorados. Desglaze la sartén con el vino blanco y continúe cocinando hasta que la mayoría del líquido se haya evaporado.", "Cortar las papas finamente y colocarlas en un plato gratinado a prueba de horno con la mezcla de tocino. Vierta sobre la crema doble. Sazonar con sal y mucha pimienta negra recién molida. Coloque las rebanadas Reblochon en la parte superior.", "Hornee en el horno durante 10-15 minutos o hasta que el queso esté dorado y burbujeante."], "url": "www_bbc_co_uk_food_recipes_tartiflette_59096", "title": "tartiflette", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tartiflette_59096_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de hojaldre listo para usar", "poca harina común, para quitar el polvo", "100 g / 3½ oz de azúcar en polvo", "60 g / 2¼ oz de mantequilla sin sal, en cubos, más extra, derretida, para cepillar", "600 g / 1 lb 5 oz manzanas Braeburn, peladas, sin corazón y cortadas en cuartos", "Crema doble 175ml / 6fl oz", "½ cucharada de azúcar glas", "1 cucharada de calvados", "1 ramita de menta fresca, para decorar"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Extienda la masa en una superficie de trabajo ligeramente enharinada hasta formar un círculo un poco más grande que el borde de una sartén a prueba de horno de 20 cm / 8 pulgadas.", "Coloque la sartén a fuego medio, vierta el azúcar y cocine hasta que se vuelva marrón claro y comience a humear un poco. No se mueva, simplemente mueva la sartén un poco si es necesario; demorará aproximadamente 5 minutos.", "Retire la sartén del fuego y agregue la mantequilla en cubos. Revuelva hasta que esté combinado, luego coloque las manzanas en la sartén, comenzando desde el borde exterior y trabajando hacia el centro. Cepille las manzanas con la mantequilla derretida y coloque la masa en la parte superior, metiéndola en los lados. Pinche la masa varias veces con un tenedor. Hornea la tarta durante 20-25 minutos, o hasta que se levante y dore. Deja enfriar por 10 minutos.", "Mientras tanto, haz la crema calvados. Coloque la crema y el azúcar en un bol y bata hasta que comience a formar picos suaves. Agregue los calvados y revuelva suavemente.", "Sirve la tarta tatin con la crema calvados en un tazón pequeño, cubierto con menta."], "url": "www_bbc_co_uk_food_recipes_tarte_tatin_with_27177", "title": "Tarta tatin con crema calvados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_tatin_with_27177_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 320g / 11oz", "225g / 8oz de mantequilla helada", "Azúcar glas de 110g / 4oz", "3 yemas de huevo de gallinas camperas", "6 manzanas Cox o 4 manzanas Granny Smith, peladas, sin corazón y cortadas en cuñas de 8-12", "¼ limón", "Azúcar en polvo de 110 g / 4 oz", "110g / 4oz de mantequilla", "crema doble o helado de vainilla"], "method": ["Precalentar el horno a 250C / 500F / Gas 9.", "Primero, haz la masa. En un procesador de alimentos, mezcle la harina, la mantequilla y el azúcar glas hasta que se asemejen a pan rallado. Agregue las yemas de huevo y, usando el botón de pulso, mezcle hasta que se juntan en una masa.", "Retire la masa de la taza del mezclador y divídala en dos pedazos. Envuélvete en film transparente y ponlo en el congelador para que se enfríe durante al menos una hora.", "Para el relleno, coloque las rodajas de manzana en un recipiente, exprima el jugo de limón sobre ellas y agréguelo suavemente.", "Espolvoree 85 g / 3 oz del azúcar en una sartén de fondo grueso y colóquela sobre la placa a fuego medio, girando la sartén con frecuencia y asegurándose de que el azúcar no se queme. Deje que el azúcar se caramelice un poco y se vuelva dorado pálido, luego retire del fuego y coloque los trozos de manzana escurridos en una capa sobre el fondo de la sartén.", "Coloque la sartén en el horno y hornee hasta que las manzanas se hayan ablandado un poco y haya comenzado a liberar un poco de líquido, unos 10 minutos.", "Retire del horno y espolvoree sobre el azúcar restante y salpique la mantequilla en la parte superior. Retire la masa del congelador y, usando el lado grueso de un rallador de queso, ralle la masa con trazos largos y uniformes sobre las manzanas hasta que forme una capa uniforme de al menos 2.5 cm / 1 pulgada de grosor. No presionar hacia abajo. Regrese al horno, baje la temperatura a 220C / 425F / Gas 7 y hornee hasta que la masa esté dorada, aproximadamente 20 minutos. Retire del horno y deje reposar por un minuto o dos.", "Tome una fuente para servir a prueba de calor que sea generosamente más grande que la bandeja en todos los lados y colóquela sobre la bandeja. Proteja sus manos con una toalla de té doblada y seca, y sosteniendo firmemente el plato y la sartén juntos, voltee la sartén y el platillo rápidamente y con cuidado para que la sartén esté encima. Golpee ligeramente la sartén unas cuantas veces con una cuchara de madera y luego levántela. La tarta se debe dejar en el plato con la manzana en la parte superior.", "Sirve caliente con crema doble, crème fraîche o helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_tartetatin_80584", "title": "Tarta tatin", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tartetatin_80584_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 lb 5 oz de tamaño mediano, papas de piel roja, como Désirée", "75g / 3oz de mantequilla, más extra para servir", "1 cebolla blanca grande, finamente rebanada", "1 cucharadita de hojas frescas de tomillo", "1 bulbo de ajo, cortado por la mitad horizontalmente", "10 rebanadas gruesas ahumado tocino rayado curado en seco", "1 x 250 g / 9 oz enteros de queso Reblochon pequeño, corteza eliminada", "1 cucharadita de mostaza Dijon", "1½ cucharadas de vinagre de vino blanco", "1 yema de huevo de gallinas camperas", "2 cucharadas de aceite vegetal", "100 g / 3½ oz de hojas de ensalada mixtas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las papas enteras en una sartén grande, cúbralas con agua y deje que hiervan. Cocine por 10 minutos.", "Mientras cocina, caliente una sartén hasta que esté a fuego medio, agregue un poco de mantequilla, cebolla y tomillo y fría a fuego lento durante 5-8 minutos, o hasta que se ablanden, pero no coloreados.", "Escurra las papas y, cuando estén lo suficientemente frías para manipularlas, raspe las pieles con un cuchillo de mesa y córtelas en rodajas gruesas (de aproximadamente 5 mm de grosor).", "Frote el lado cortado del ajo en el interior de un plato resistente al horno, luego unte un poco de mantequilla.", "Coloque las cebollas rebanadas en el plato y extiéndalas sobre la base, luego coloque seis rebanadas de tocino en la parte superior. Coloque las papas en círculos concéntricos sobre la parte superior, luego coloque el queso en el centro. Cubra con la mitad de la mantequilla restante y sazone con pimienta negra recién molida y un toque de sal.", "Hornee en el horno durante 45 minutos, o hasta que las papas estén tiernas y crujientes alrededor de los bordes y el queso esté completamente derretido.", "Mientras se cocina la tartiflette, derrita la mantequilla restante y pique las rebanadas restantes de tocino en trozos pequeños. Caliente una sartén, agregue el tocino y cocine a fuego medio hasta que la grasa comience a desmenuzarse, luego caliente y cocine hasta que esté crujiente y dorado.", "Para hacer el aderezo, mezcle la mostaza Dijon, el vinagre y la yema de huevo juntos hasta que estén pálidos, luego muy lentamente agregue el aceite vegetal, batiendo todo el tiempo hasta que la mezcla se emulsione. Vierta la mezcla en la grasa caliente de la bandeja de tocino y bata para combinar. Sazone al gusto con sal y pimienta.", "Mezcle el tocino crujiente con las hojas de ensalada y mezcle con un poco del aderezo.", "Retire la tartiflette del horno y cepille con un poco de mantequilla derretida. Servir en rebanadas con la ensalada vestida."], "url": "www_bbc_co_uk_food_recipes_tartiflette_and_bacon_21649", "title": "Tartiflette con ensalada de grasa y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina blanca fuerte, más extra para enrollar", "½ cucharadita de sal fina", "200ml / 7fl oz de agua hirviendo", "1 cucharada de aceite vegetal, para freír", "1 cucharada de aceite de sésamo", "500 g / 1 lb 2 oz de cerdo o pollo picado", "1 cabeza pak choi, muy finamente rallada", "¾in / 2cm pieza de raíz fresca de jengibre, pelado, rallado", "3 dientes de ajo, pelados, rallados", "½ cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "1 cucharada de cebolleta picada (solo parte verde)", "½ cucharadita de hojuelas de chile molido", "1 cucharadita de aceite de sésamo", "1 cucharada de salsa de ostras", "azúcar pizca", "1 cangrejo vestido (carne oscura y blanca)", "200g / 7oz de langostinos cocidos, pelados del Atlántico Norte, picados", "½ cucharadita de sal fina", "½ cucharadita de pimienta negra recién molida", "1 cucharada de aceite de sésamo", "½ limón, ralladura solamente, finamente rallado", "1 cucharada de salsa de ostras", "1 cucharada de cebolleta picada (solo parte verde)", "Jengibre fresco de la raíz de 2cm / ¾in, pelado, rallado", "splash salsa de soja", "salpicar jugo de limón", "salpicaduras de aceite de chile"], "method": ["Para las pieles de gyoza, tamiza la harina en un tazón grande y mezcla la sal.", "Agregue el agua hirviendo con un cuchillo o un par de palillos hasta que la mezcla se una como masa. (Muchos no necesitan usar toda el agua).", "Haga rodar la masa en forma de bola, cúbrala con una película adhesiva y déjela reposar durante una hora.", "Mientras tanto, para el relleno de pollo o cerdo, mezcle todos los ingredientes de relleno de pollo o cerdo en un tazón grande hasta que estén bien combinados (los ingredientes formarán una pasta espesa). Sazonar bien con sal y pimienta negra recién molida. Enfriar en la nevera hasta que sea necesario.", "Para el relleno de cangrejo y gambas, mezcle todos los ingredientes para el cangrejo y la gamba en un tazón grande hasta que estén bien combinados (los ingredientes formarán una pasta espesa). Sazonar bien con sal y pimienta negra recién molida. Enfriar en la nevera hasta que sea necesario.", "Para la piel de gyoza, coloca la masa sobre una superficie de trabajo ligeramente enharinada y amasa durante cinco minutos hasta que quede suave y elástica. (Para esto, puede usar el accesorio de gancho de masa de un procesador de alimentos).", "Corta la masa en tres trozos del mismo tamaño y enrolla cada uno en una bola. Extiende una de las bolas sobre una superficie de trabajo ligeramente enharinada, estirando y girando la masa sobre la marcha, hasta que la masa de gyoza sea lo más fina posible.", "Usando un cortador de galletas de 10cm / 4in, corte los discos de la masa de gyoza y apílelos uno encima del otro, espolvoree la parte superior de cada uno con un poco de harina antes de agregar el siguiente. Repita el proceso de laminado y corte hasta que toda la masa se haya utilizado.", "Para armar las albóndigas, sostenga una piel de gyoza en la palma de su mano y agregue una cucharadita de la mezcla de relleno. Humedezca los bordes con un poco de agua usando la yema del dedo y selle la bola de masa, pellizcándola a lo largo de los bordes para crear un efecto de ventilador plisado (el resultado final debe parecerse a un mini pastel de Cornish). Repita el proceso hasta que toda la mezcla de relleno y las pieles de gyoza se hayan agotado, dejando cada bola de masa en un plato espolvoreado con harina.", "Para cocinar las albóndigas, caliente el aceite vegetal en una sartén grande con tapa a fuego alto. Coloque el gyoza en la sartén, en tandas si es necesario, dejando espacio entre cada una, y fríe durante 2-3 minutos, o hasta que los fondos estén dorados. Tenga cuidado ya que se quemarán rápidamente.", "Agregue 100 ml / 3½ fl oz de agua a la sartén, cubra con la tapa y cocine al vapor las albóndigas por otros dos minutos.", "Agite la sartén para liberar la gyoza del fondo de la sartén y continúe cocinando durante dos minutos más con la tapa cerrada, hasta que el relleno esté completamente cocido.", "Mientras tanto, para la salsa de inmersión, mezcle todos los ingredientes de la salsa de inmersión en un tazón pequeño, al gusto. Dejar de lado.", "Cuando la gyoza esté cocida, vierta el aceite de sésamo en los bordes de la sartén y sacuda la sartén.", "Sirve la gyoza inmediatamente con la salsa."], "url": "www_bbc_co_uk_food_recipes_tasty_gyoza_japanese_16947", "title": "Gyoza (japonés mp) gs", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 30-40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mascarpone", "100 g / 3½ oz de azúcar en polvo", "pizca de sal", "150ml / 5½ fl oz de leche", "Crema doble 225ml / 8fl oz", "½ vaina de vainilla, semillas raspadas", "Mantequilla 250g / 9oz, ablandada", "100 g / 3½ oz de azúcar en polvo", "pizca de sal", "Harina normal de 250g / 9oz, más extra para espolvorear", "Copos de salvado 190g / 6¾oz, mezclados a un polvo", "2 huevos de gallinas camperas, golpeados", "225g / 8oz de mantequilla", "675 g / 1 libra de jarabe de oro de 8 oz", "190 g / 6¾oz de brioche migas", "75ml / 2½ fl oz crema doble", "½ cucharadita de sal", "2 huevos de gallinas camperas, golpeados", "1 yema de huevo grande de gallinas camperas", "sal marina escamosa, para terminar"], "method": ["Para el helado, mezcle todos los ingredientes en un bol y revuelva en la máquina de hacer helados. Coloque la mezcla congelada en un recipiente congelador y guárdela en el congelador hasta que la necesite.", "Para hacer la masa, mezcle la mantequilla blanda y el azúcar impalpable. Agregue una pizca de sal, la harina común y los copos de salvado en polvo. Revuelve para combinar. Agregue los huevos batidos y mezcle para formar una masa suave y pegajosa. Cubra con film transparente y colóquelo en la nevera para que descanse durante al menos una hora.", "Precalentar el horno a 170C / 340F / Gas 3½.", "Cuando la masa repose, aplique un poco de polvo a la superficie de trabajo con harina y extienda la masa al grosor de una moneda de una libra. Alinee una caja agria de fondo suelto de 23 cm / 9 pulgadas con la masa, empujándola suavemente hacia los bordes y dejando cualquier exceso que sobresalga por los lados.", "Alinee los pasteles con el pergamino para hornear. Rellene con frijoles para hornear de cerámica o arroz crudo y hornee por 20-25 minutos. Retire los frijoles y el papel de revestimiento, vuelva a colocarlo en el horno y cocine por otros 10 minutos para asegurarse de que la masa esté bien cocida y seca. Retirar del horno y reservar para enfriar. Baje la temperatura del horno a 160C / 325F / Gas 3.", "Para hacer el relleno, derrita la mantequilla en una cacerola a fuego medio hasta que se espume y se ponga marrón. Agregue el jarabe, retire la sartén del fuego y mezcle para que se mezcle (si la mezcla es granulosa, páselo por un colador). Coloque las migas de brioche en un recipiente mediano y agregue la mezcla de mantequilla y jarabe. Agregue la crema, la sal, los huevos y la yema de huevo y déjelos enfriar durante 10-15 minutos. Una vez que se haya enfriado, vierta el relleno en la caja agria enfriada y hornee durante 25 minutos. Reduzca la temperatura del horno a 140 ° C / 275 ° F / Gas 1 y cocine durante 30 minutos más, hasta que la tarta recién se haya puesto, todavía debería oscilar en el centro. Retire la tarta del horno y deje enfriar y deje reposar durante 30 minutos.", "Cuando esté listo para servir, espolvoree un poco de sal marina sobre la parte superior de la tarta, recorte los bordes superiores de la tarta y suelte el anillo. Cortar en rodajas y servir con el helado de mascarpone."], "url": "www_bbc_co_uk_food_recipes_tasty_treacle_tart_68276", "title": "Sabrosa tarta de melaza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 tarta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz salsa Worcestershire", "4 tomates de ciruela, cortados a la mitad longitudinalmente, sin semillas ni núcleo", "75g / 3oz de mantequilla", "sal y pimienta negra recién molida", "12 lonchas de tocino rayado", "8 setas de campo, peladas y rebanadas gruesas", "300g / 10oz de puré de papa cocido, tibio", "Harina normal de 75g / 3oz", "1 yema de huevo de gallinas camperas", "maza pizca de tierra", "4 huevos de gallinas camperas", "50ml / 2fl oz de aceite de girasol"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Vierta la salsa Worcestershire en una sartén y coloque a fuego medio. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que se reduzca en poco más de un tercio de su volumen original.", "Coloque los tomates en una bandeja para hornear y salpique con 25 g / 1 oz de la mantequilla, y sazone bien con sal y pimienta negra recién molida. Transfiera al horno para cocinar por 20-25 minutos.", "Coloque el tocino en una bandeja para hornear limpia y colóquelo en el horno durante 5-6 minutos, o hasta que esté crujiente y dorado.", "Calentar una sartén hasta que esté caliente, agregar 25 g / 1 oz de la mantequilla y los champiñones y freír durante 2-3 minutos. Sazonar bien con sal y pimienta negra recién molida.", "Coloque el puré de papa caliente en un tazón y mezcle con la mantequilla restante y la harina para formar una masa suave. Sazonar con la maza de tierra y sal y pimienta negra recién molida.", "Estirar la masa de papa a 1.5cm / ½ in de espesor. Cortar rectángulos de aproximadamente 9.5 cm / 4 pulgadas por 6 cm / 2 pulgadas de ancho.", "Caliente una sartén hasta que esté muy caliente. Cepille la plancha muy ligeramente con aceite y agregue los bollos de patata. Cocine durante 20-30 segundos en cada lado, o hasta que estén dorados y crujientes por todos lados.", "Agriete los huevos en una sartén pequeña y cocine a fuego lento tratando de evitar la clara de huevo. Cocine a su preferencia.", "Para servir, coloque un bollo tattie en el centro de cada plato calentado, luego coloque algunos de los champiñones en la parte superior.", "Coloque los tomates cocidos en la misma sartén que la salsa Worcestershire para que absorban el sabor, luego colóquelos encima de cada pila de hongos.", "Coloque una loncha de tocino crujiente y cocido en la parte superior, luego agregue un huevo frito sobre eso.", "Coloque un segundo bollo tattie en la parte superior para formar una tapa. Vierta cualquier exceso de salsa Worcestershire alrededor del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_tattiesconewithbacon_88635", "title": "Bizcocho de Tattie con tocino y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]