[{"ingredients": ["½ mango, pelado y rebanado", "azúcar glas, al polvo", "½ lima, en jugo y zested", "crema doble, para servir"], "method": ["Coloque el mango en un tazón y espolvoree abundantemente con azúcar glasé.", "Agregue el jugo de limón y la ralladura al bol y mezcle. Poner a un lado y dejar marinar durante hasta diez minutos.", "Mientras tanto, bate la crema en un tazón limpio para espesar.", "Transfiere el mango a un plato para servir y coloca la crema batida encima para servir"], "url": "www_bbc_co_uk_food_recipes_mangowithlime_76371", "title": "Mango con lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite vegetal", "1 canela grande", "5 vainas de cardamomo", "3 hojas de laurel", "Jengibre fresco de raíz de 5 cm / 2 pulgadas, finamente picado", "5 dientes de ajo, aplastados", "1 cebolla grande, picada", "1 cucharadita de cúrcuma molida", "1 cucharadita de chile en polvo", "1 cucharadita de comino molido", "2 cucharaditas de curry en polvo", "500 g / 1 libra de carne de vaca 2 oz, sin hueso, en cubos", "3 chiles, cortados longitudinalmente (quita las semillas si quieres menos calor)", "puñado de cilantro fresco", "sal", "250 g / 9 oz de harina de arroz, más extra para quitar el polvo", "pizca de sal", "2 cucharaditas de pimentón", "2 cucharaditas de ajo en polvo", "1 cucharadita de hojuelas de chile", "Okra 300 g / 10½ oz, reducido a la mitad longitudinalmente", "4 cucharadas de aceite vegetal, para freír"], "method": ["Para el curry, caliente el aceite en una sartén grande. Agregue la canela, el cardamomo y las hojas de laurel y cocine durante 1 minuto. Agregue el jengibre, el ajo, la cebolla y cocine durante 10 minutos. Agregue las especias molidas y cocine durante 1 minuto, teniendo cuidado de no quemarlas. Agregue la carne y cocine a fuego medio-alto durante 30 minutos.", "Agregue 200 ml / 7 fl oz de agua, sazone con sal. Cocine a fuego medio durante 30 minutos. Retire del fuego y agregue los chiles y el cilantro (reserve un cilantro para decorar).", "Mientras tanto, para la fita, ponga a hervir 750 ml / 26 fl oz de agua en una sartén grande con un poco de sal. Retire del fuego y agregue la harina de arroz. Deja durante 10 minutos, cubierto, para cocinar el arroz. Retire la masa mientras aún está caliente y extiéndala sobre una superficie espolvoreada con harina de arroz. Cortar en rondas pequeñas.", "Caliente una sartén plana a fuego medio. Cocine la fita por aproximadamente 1 minuto en cada lado, hasta que estén cocidas pero no coloreadas.", "Para la okra, ponga el pimentón, el ajo en polvo, los copos de chile y ½ cucharadita de sal en la okra. Caliente el aceite vegetal en una sartén grande a fuego alto. Fríe brevemente la okra, debe mantener su color y darle un mordisco suave.", "Para servir, saque el curry de carne y sirva con fita y okra. Adorne con el cilantro."], "url": "www_bbc_co_uk_food_recipes_mangsho_fita_shinni_36848", "title": "Hombre G SHO FI él es (curry de carne)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangsho_fita_shinni_36848_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de bourbon", "25ml / 1fl oz dulce de vermut rojo", "2 guiones Angostura amargos", "1 cucharadita de jarabe de un tarro de cerezas al marrasquino", "tuerza la cáscara de naranja, para adornar", "cereza marrasquino, para adornar"], "method": ["Coloque el bourbon, el vermut, los amargos y el jarabe en un vaso mezclador lleno de hielo y mezcle bien.", "Colar en una copa de cóctel y decorar con un toque de naranja y una cereza marrasquino."], "url": "www_bbc_co_uk_food_recipes_manhattan_87544", "title": "Manhattan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla pequeña, picada", "2 zanahorias, cortadas en cubitos", "½ pimiento rojo, semillas removidas y picadas", "½ pimiento amarillo, semillas retiradas y picadas", "½ pimiento verde, semillas removidas y picadas", "100 g / 3½ oz de judías verdes picadas", "2 tomates, picados", "3-4 chiles, semillas retiradas y carne picada", "sal y pimienta negra recién molida", "Harina de maíz blanca 375 g / 13 oz (mealie meal)", "½ repollo pequeño (o cualquier vegetal estacionalmente), rallado", "1 cebolla pequeña, picada", "1 tomate, picado", "4 cucharadas de mantequilla de maní"], "method": ["Para la guindilla, caliente el aceite en una sartén grande y fría la cebolla hasta que esté suave pero no dorada.", "Agregue las zanahorias, los pimientos y las judías verdes, fríe brevemente y luego agregue los tomates y los chiles y cocine a fuego lento el guiso hasta que las verduras estén tiernas. Sazone al gusto con sal y pimienta negra recién molida.", "Para la sadza, mezcle 225 g / 8 oz de la harina de maíz con 250 ml / 9 fl oz de agua.", "Traiga 750ml / 1¼ pintas de agua hasta que hierva en una sartén, luego baje el fuego y agregue la mezcla de harina de maíz, revolviendo todo el tiempo. Cocine por cinco minutos, luego agregue gradualmente la harina de maíz restante. Transfiera a un tazón o plato y aplaste en forma redonda con una cuchara de madera.", "Para la col de mantequilla de maní, verter aproximadamente 125 ml / 4 fl oz de agua en una sartén y llevar a ebullición. Agregue el repollo y cocine hasta que esté ligeramente ablandado pero aún crujiente.", "Agregue la cebolla y el tomate, agregue la mantequilla de maní y agregue más agua si la mezcla parece demasiado espesa. Sazonar con sal y pimienta negra recién molida. Sirve con la sadza y el chile vegetal."], "url": "www_bbc_co_uk_food_recipes_manyatis_vegetable_35397", "title": "Chiles vegetales con col y sadza de mantequilla de maní", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 1.8-2kg / 4-4lb 8 oz gammon, deshuesado", "2 hojas de laurel", "1 cebolla, partida por la mitad", "6 granos de pimienta", "3 cucharadas de jarabe de arce", "1 cucharadita de mostaza inglesa en polvo", "3 cucharadas de azúcar mascabado ligero", "2 cucharadas de aceite de oliva", "2 cebollas, finamente picadas", "1 diente de ajo, aplastado", "Albaricoques secos listos para comer 400 g / 14 oz, cortados en cubitos", "2 manzanas crujientes comiendo, peladas, sin corazón y cortadas en cubitos", "100g / 3½oz de azúcar mascabado ligero", "200ml / 7fl oz de vinagre de sidra", "5 cucharadas de jengibre rallado", "2 chiles rojos, finamente picados", "2 naranjas, cáscara y jugo", "8 cucharadas de jarabe de arce"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3 (ventilador de 140 ° C).", "Coloque el jamón en una cacerola profunda que simplemente se ajusta, agregue las hojas de laurel, cebolla y granos de pimienta. Agregue suficiente agua para cubrir el gammon, luego lleve a ebullición y cubra con una tapa. Transfiera al horno precalentado y cocine durante aproximadamente dos horas, o hasta que estén tiernos.", "Aumente la temperatura del horno a 220C / 425F / Gas 7 (ventilador de 200C).", "Cuando el jamón esté cocido, retírelo de la sartén y, con un cuchillo afilado, corte la piel y deje una capa de grasa debajo. Coloque el jamón en una pequeña lata de asar.", "Mezcle los ingredientes del glaseado y vierta sobre la capa de grasa. Califique la grasa en forma de diamante y tueste durante unos 20-25 minutos, o hasta que se dore, hilvanando a la mitad del tiempo de cocción.", "Mientras el jamón se cocina, puedes preparar el chutney. Calentar el aceite en una sartén de tamaño mediano y freír las cebollas a fuego lento hasta que estén realmente tiernas y transparentes, pero no doradas. Agregue todos los ingredientes restantes, lleve a ebullición, luego cocine a fuego lento durante aproximadamente 10 minutos, o hasta que los albaricoques se hayan suavizado y todo esté suave y pulposo.", "Sirva la salsa picante caliente o fría. Si está frío, póngalo en jarras esterilizadas, etiquete y selle la parte superior."], "url": "www_bbc_co_uk_food_recipes_maple-glazed_gammon_with_52545", "title": "Gammon glaseado de arce veraniego con albaricoque fresco y chutney de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["gran puñado de ramitas de tomillo fresco, hojas recogidas", "sal y pimienta", "8 chuletas de cordero o chuletas", "aceite vegetal", "1 manojo de cebollas de primavera, cortadas y cortadas", "50g / 2oz de almendras en copos", "puñado de menta fresca", "1 granada, solo semillas", "300g / 10½oz de cuscús", "200g / 7oz hecha", "llovizna de aceite de oliva virgen extra", "25g / 1oz de mantequilla", "2 cucharadas de jarabe de arce", "1 cucharada de vinagre balsámico", "Sal y pimienta negra recién molida, al gusto"], "method": ["Espolvorea las hojas de tomillo sobre un plato grande con un poco de sal y pimienta, luego aplasta las chuletas de cordero o las chuletas en la mezcla, dándoles la vuelta para cubrir los dos lados. Esto le dará una hermosa costra cuando esté cocinado.", "Coloque una sartén grande a fuego medio con un buen glug de aceite. Freír las chuletas de cordero durante aproximadamente 3-4 minutos en el primer lado o hasta que estén doradas. Dale la vuelta al cordero y déjalo cocer durante otros 3-4 minutos dependiendo de cómo te gusten los cocidos.", "Mientras tanto, incline el cuscús en un tazón mediano, vierta agua hirviendo de un hervidor para cubrir un poco la parte superior, cúbralo con una película adhesiva y déjelo a un lado durante unos cinco minutos.", "Para el glaseado, ponga la mantequilla, el jarabe de arce y el vinagre balsámico en una cacerola pequeña a fuego alto. Llevar a ebullición y luego reducir a fuego lento, dejándolo burbujear durante unos tres minutos, revolviendo de vez en cuando. Cuando el glaseado esté espeso y almibarado (un poco más fino que el jarabe dorado) retírelo del fuego y manténgalo caliente.", "Comprueba que los granos de cuscús hayan absorbido toda el agua y que estén tiernos y luego esponja con un tenedor. Desmenuce el queso feta, sazone con sal y pimienta y agregue una buena llovizna de aceite de oliva virgen extra. Revuelva y vuelva a tapar para mantenerse caliente.", "Corte en el centro de una de las chuletas de cordero o chuletas para comprobar que estén cocidos a su gusto. Cuando esté listo, quítelos en un plato para descansar durante unos minutos, cubiertos con papel de aluminio (esto hará que las chuletas sean más tiernas y jugosas).", "Agregue las cebolletas y las almendras en copos a la sartén en la que cocinó el cordero y fría a fuego medio durante 1-2 minutos, revolviéndolos un poco de vez en cuando. Retire del fuego cuando las cebolletas estén marchitas y las almendras doradas.", "Divida el cuscús entre cuatro platos para servir. Coloque dos chuletas de cordero en la parte superior de cada plato y rocíe el glaseado (y los jugos de reposo) sobre. Esparce sobre la mezcla de cebolla y almendras y rasga sobre las hojas de menta. Cubra con las semillas de granada y sirva."], "url": "www_bbc_co_uk_food_recipes_maple_and_balsamic_26200", "title": "Tajadas de arce glaseadas de arce y balsámico con cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_and_balsamic_26200_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1-2 lonchas de tocino rayado sin ahumar", "Pacanas 10g, tostadas y picadas", "150 g / 5½ oz de azúcar en polvo", "25g / 1oz de jarabe dorado", "2 cucharadas de jarabe de arce", "4 palos de polo"], "method": ["Calienta tu parrilla a fuego alto.", "Coloque una hoja de pergamino para hornear en un tablero, luego dibuje cuatro círculos de 6.5cm / 2½ pulgadas, espaciados. Voltee el papel para que el lápiz esté en el otro lado pero puede verlo a través del papel. Cepille cada área del círculo con aceite vegetal.", "Corta la corteza de las lonjas de tocino, luego cocina hasta que estén crujientes y doradas. Deje que se enfríen y córtelos en pedacitos.", "Divida el tocino refrigerado entre los círculos, junto con las nueces de pacana. Coloque los palos de piruleta cerca del círculo, también.", "Ponga el azúcar y 75ml / 2½ fl oz de agua en una sartén pequeña de base pesada y caliente suavemente para disolver el azúcar. Agregue el jarabe dorado y el jarabe de arce. Suba ligeramente el calor y use un termómetro de azúcar para observar cuidadosamente la temperatura hasta que alcance los 150 ° C / 300 ° F (la etapa de \"crack duro\"). (PRECAUCIÓN: el azúcar en ebullición puede ser extremadamente caliente. Manipúlelo con cuidado. Use una sartén profunda para evitar burbujear).", "Mientras tanto, llena el fregadero con 10 cm / 4 en agua fría.", "Cuando la mezcla de azúcar y jarabe alcance los 150 ° C / 300 ° F, quítelo del fuego y sumerja la base de la sartén en el fregadero de agua fría para evitar que siga cocinando. Dejar enfriar por un minuto o dos, luego coloque cuidadosamente una cucharada de jarabe en cada círculo sobre el tocino / nueces. El jarabe correrá, pero se espesará ligeramente al enfriarse. Presione los palillos, luego continúe cucharando el almíbar en el círculo en la parte superior de la primera cucharada de jarabe.", "Permita que se establezca durante aproximadamente 30 minutos y luego levante cuidadosamente el pergamino.", "Sorprende a tus amigos con esta deliciosa combinación de sabores."], "url": "www_bbc_co_uk_food_recipes_maple_bacon_lollies_81721", "title": "Paletas de tocino de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 4-6 paletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_bacon_lollies_81721_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "1 cebolla roja, finamente picada", "2 dientes de ajo, aplastados", "1 pimiento verde, finamente picado", "2 cucharadas de jerez seco", "½ vaso de vino blanco seco", "sal y pimienta", "225g / 8oz de carne de salchicha", "1 x 280 g / 10 oz de maíz dulce de hojalata", "2 cucharadas de perejil picado", "1 pavo de 5.4kg / 12lb", "175g / 6oz de mantequilla derretida", "2 cucharadas de jarabe de arce", "1 cucharada de jugo de limón", "sal y pimienta", "½ cebolla, picada", "1 vaso de vino blanco seco", "300 ml / ½ pinta de caldo de pollo", "harina de patata, para espesar (opcional)"], "method": ["Para el relleno, caliente un poco de aceite en una sartén grande. Agregue la cebolla, el ajo y el pimiento verde. Freír suavemente durante dos minutos sin colorear. Vierta el jerez y el vino blanco. Llevar a ebullición y cocinar hasta que el volumen de líquido se haya reducido en dos tercios. Retirar del fuego y reservar para enfriar. Sazone al gusto con sal y pimienta.", "Cuando la mezcla de cebolla esté fría, mezcle la salchicha con la carne, el maíz dulce y el perejil. Dejar de lado.", "Para el pavo glaseado, retire la horquilla del pavo. Voltea el pavo de costado y aplasta para romper la espina dorsal.", "Empuje el relleno en la cavidad del cuello y vuelva a dar forma al pavo en su forma original. Asegure la cavidad abierta con una cuerda o un pincho.", "Precalentar el horno a 220C / 425F / Gas 7.", "Coloque el pavo en un lado en una bandeja de asar y hilvane con mantequilla derretida. Asar en el horno durante 30 minutos.", "Convierta el pavo en el otro lado y hilvane con los jugos en la bandeja de asar.", "Reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y cocine por otros 30 minutos.", "Coloque el pavo sobre su espalda, de modo que los senos estén apuntando hacia arriba.", "Para el glaseado, caliente lentamente el jarabe de arce y el jugo de limón. Cepille las pechugas de pavo con el glaseado y los jugos de la lata de asar. Regrese al horno por aproximadamente cuatro horas.", "Comprueba que el pavo esté cocido perforando una pierna: si los jugos son claros, está listo. Retire de la bandeja de tostado y déjelo a un lado, cubierto en un lugar cálido, para descansar durante 15 minutos antes de tallar.", "Para la salsa, coloque la bandeja de asar a fuego medio y agregue la cebolla picada. Cocine por 3-4 minutos o hasta que esté suave y dorado.", "Cuele el exceso de grasa, coloque las cebollas en la lata de asar (si se retira durante el colado) y agregue el vino blanco y el caldo de pollo. Llevar a ebullición, sazonar con sal y pimienta, y agregar un poco de harina de patata para espesar (si lo desea). Colar y verter en una jarra. Sirva el pavo en rodajas con la salsa."], "url": "www_bbc_co_uk_food_recipes_maple_glazed_turkey_with_15074", "title": "Pavo glaseado de arce con relleno de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de jarabe de arce", "25 g / 1 oz de azúcar en polvo", "25ml / 1fl oz de aceite de girasol", "½ cucharadita de extracto de vainilla", "500 g / 1 libra de 2 onzas de avena jumbo", "175g / 6oz de semillas mezcladas (como calabaza, girasol, sésamo o linaza)", "Pacanas (o nueces) 150g / 5oz", "50g / 2oz de almendras enteras", "Almendras en copos de 25g / 1oz", "75g / 2¾oz de coco desecado", "pizca de sal (opcional)", "2 cucharaditas de canela (opcional)", "150g / 5½oz de arándanos secos"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Coloque dos bandejas de asar grandes con papel pergamino y déjelas a un lado.", "Coloque el jarabe de arce, el azúcar, el aceite y el extracto de vainilla en un tazón grande y mezcle bien. Luego mezcle la avena, mezcle las semillas, nueces (o nueces), almendras enteras, almendras en copos, coco y sal y canela (si se usa). Dale un buen revolcón y luego pon las manos dentro, retirándolo y dejándolo caer para cubrirlo y humedecerlo todo muy bien.", "Vierta la mezcla en las bandejas de tostado y extiéndala de manera uniforme. Hornee en el horno por unos 15 minutos, revolviéndolo bien y cambiándolos en sus estantes a la mitad.", "La granola debe ser dorada cuando se cocina. Retirar y dejar enfriar por completo antes de remover los arándanos. Almacene en un recipiente hermético por hasta un mes."], "url": "www_bbc_co_uk_food_recipes_maple_pecan_and_40192", "title": "Arce, pacana y granola de arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1.3kg / 3lb de granola", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_pecan_and_40192_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "1 cucharadita de canela molida", "1 cucharadita de pimentón ahumado", "1 cucharada de puré de tomate", "50ml / 2fl oz de vinagre de sidra", "50g / 1¾oz de azúcar morena suave", "400g / 14oz de tomates picados en lata", "150ml / 5fl oz de jarabe de arce", "1 kg / 2 libras 4 oz de cerdo de vientre", "1 cucharada de sal", "1 cucharada de pimienta negra recién molida", "4 cucharadas de mantequilla", "Harina de maíz 200 g / 7 oz", "Harina normal de 65 g / 2¼ oz", "1½ cucharadita de polvo de hornear", "1 cucharadita de sal", "35 g / 1 oz de azúcar en polvo", "1 chile rojo, finamente picado", "1 manojo de cebolletas, finamente picado", "3 huevos medianos de granja, golpeados", "160g / 5½ oz de leche entera", "1 cucharada de aceite vegetal", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 chile rojo, finamente picado", "400g / 14oz de tomates picados en lata", "2 cucharadas de ketchup de tomate", "2 cucharadas de salsa barbacoa", "1 cucharadita de mostaza inglesa en polvo", "Frijoles enlatados de 300g / 10½oz, escurridos", "300g / 10½oz de frijoles negros enlatados, escurridos", "Frijoles enlatados 300g / 10½oz, escurridos", "450 g / 1 libra de batatas, con piel, cortada en rodajas de 2cm / ¾in", "2 cucharadas de aceite de oliva", "4 manzanas Granny Smith, sin corazón y en rodajas finas", "4 achicoria blanca, hojas separadas", "120 g / 4¼ oz de nueces de pacana", "200 ml / 7 fl oz crema fresca", "1 limón, solo jugo", "50ml / 2fl oz de aceite de oliva", "4 ramitas de cilantro fresco"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Mientras tanto calienta una sartén grande y agrega el aceite. Una vez caliente, freír la cebolla durante 3-4 minutos.", "Agregue el ajo, el comino, el cilantro, la canela, el pimentón ahumado y el puré de tomate y cocínelos durante tres minutos.", "Agregue el vinagre, el azúcar, los tomates, el jarabe de arce y 250 ml / 9 fl oz de agua, y cocine durante 20-30 minutos.", "Marca el cerdo con un cuchillo afilado y frota con sal y pimienta. Caliente una sartén de plancha y fría en el lado de la piel durante 4-5 minutos.", "Coloque el cerdo rayado en una lata de asar profunda y agregue la mezcla de jarabe de arce. Deja de lado mientras preparas el pan de maíz", "Para hacer el pan de maíz con chile, coloque la mantequilla en una cacerola pequeña y derrita. Viértalo en una lata cuadrada de 20cm / 8in.", "Vierta la harina de maíz, la harina, el polvo de hornear y la sal en un tazón grande para mezclar y agregue el azúcar, el chile y las cebolletas y revuelva.", "En otro recipiente, mezcle los huevos y la leche.", "Poco a poco, agregue los ingredientes húmedos al secado y mezcle con una cuchara de madera.", "Vierta la mezcla en la lata de pastel preparada y hornee durante 20 minutos. Cuando el pan de maíz esté dorado y esponjoso al tacto, quítelo y déjelo enfriar.", "Al mismo tiempo, coloque la barriga de cerdo glaseada en el horno caliente durante 30 minutos, luego reduzca la temperatura del horno a 150 ° C / 300 ° F / Gas 3 y cocine durante 3 horas y media.", "Para los frijoles, coloque una cacerola a fuego medio y agregue el aceite. Una vez caliente, agregue la cebolla y fría por tres minutos.", "Agregue el ajo y el chile rojo y cocine por otros tres minutos, revolviendo frecuentemente para que el ajo no se queme.", "Agregue los tomates picados, el ketchup, la salsa para asar, la mostaza y los frijoles escurridos. Llevar a ebullición, reducir el fuego y cocinar durante 40 minutos.", "Para las batatas, caliente una sartén de plancha, agregue las batatas en rodajas a la sartén y cocine a cada lado durante 4-5 minutos para obtener marcas de carbón. Coloque en el horno durante 20-30 minutos o hasta que estén tiernos.", "Para la manzana y la ensalada de nueces, coloca las manzanas, la achicoria y las pacanas en un tazón grande. Bata la crème fraîche, el zumo de limón y el aceite en un recipiente aparte. Dejar de lado.", "Retire la carne de cerdo del horno y deje hasta que esté lo suficientemente fría para manipularla. Vierta la salsa en una cacerola, coloque en el fuego y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Retire toda la grasa del cerdo y tire en pedazos.", "Justo antes de servir, agregue el aderezo a la manzana y al repollo de nueces y mezcle bien. Sirva el cerdo con pan de maíz, frijoles, ensalada y salsa. Cubra cada porción de carne de cerdo con una ramita de cilantro."], "url": "www_bbc_co_uk_food_recipes_maple_pulled_pork_with_23642", "title": "Maple sacó cerdo con frijoles al estilo barbacoa, pan de maíz con chile y una manzana y ensalada de nueces", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "2 cucharadas de jarabe de arce", "100 g / 3½ oz de harina, tamizada", "1½ cucharadita de polvo de hornear", "2 huevos grandes de gallinas camperas", "100g / 3½oz de azúcar moreno", "85g / 3oz de margarina", "1 cucharada de whisky", "100ml / 3½ fl oz de leche", "Crema doble de 200 ml / 7 fl oz", "1 vaina de vainilla, dividida longitudinalmente", "3 huevos de gallinas camperas, solo yemas", "Azúcar en polvo de 55 g / 2 oz", "Licor de almendra 20ml / 1fl oz", "150 g / 5½ oz de arándanos", "50g / 1¾oz de azúcar", "½ limón, solo jugo"], "method": ["Para el budín de esponja de jarabe, engrase generosamente el interior de un recipiente de pudín de 850ml / 1½pt con la mantequilla y colóquelo en la nevera durante cinco minutos.", "Retire de la nevera y agregue el jarabe de arce a la base del lavabo con leche.", "Coloque todos los ingredientes restantes en un tazón grande y mezcle hasta que estén bien combinados. Vierta en el recipiente sobre el jarabe de arce. Cubra con un trozo doblado de papel de aluminio con mantequilla, haciendo unos pliegues en la lámina antes de presionar firmemente alrededor del borde del lavabo. Asegure la lámina alrededor del borde con una cuerda.", "Coloque el recipiente en un recipiente a vapor sobre una olla grande de agua hirviendo y cocine a fuego moderado durante una hora y media, asegurándose de que la cacerola no hierva en seco. Si necesita recargar, use agua hirviendo.", "En una cacerola de base pesada calienta la leche, la crema doble y la vaina de vainilla.", "En un tazón grande, mezcle las yemas de huevo y el azúcar impalpable hasta que estén ligeros y aireados. Batir el licor de almendras.", "Batir la mitad de la mezcla de leche caliente en la mezcla de huevo, luego vierta la mezcla de huevo en la olla con la leche caliente restante.", "A fuego muy lento, cocine la mezcla, revolviendo constantemente, hasta que se espese en una crema suave. Dejar de lado.", "Para la compota de arándanos, ponga todos los ingredientes en una cacerola con cuatro cucharadas (60 ml / 2 fl oz) de agua y deje que hierva. Hervir a fuego lento durante cinco minutos y retirar del fuego.", "Para servir, una vez que los postres estén cocidos, retire la lámina, cocine el pudín y sirva en rebanadas con crema de almendras caliente y compota de arándanos."], "url": "www_bbc_co_uk_food_recipes_maple_syrup_sponge_37946", "title": "Pudín de esponja de jarabe de arce con crema de almendras y compota de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 pastinacas, cortadas longitudinalmente en ocho piezas", "pizca de copos de chile seco", "llovizna jarabe de arce", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Rocíe el aceite de oliva en una lata para asar y colóquelo en el horno hasta que esté caliente.", "Escalde las chirivías en una sartén de agua hirviendo con sal durante 2-3 minutos, luego escurra bien.", "Retire la lata de asar del horno, agregue las chirivías y revuelva para cubrir con el aceite caliente. Sazone con sal y pimienta negra recién molida y luego agregue el chile y el jarabe de arce. Revuelva hasta que esté bien cubierto, luego tueste en el horno durante 15-20 minutos hasta que esté tierno en el medio y dorado en el exterior.", "Transfiera a un plato caliente y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_mapleandchilliroaste_87749", "title": "Arce y chiles pastinacas asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de crema doble, suavemente batida", "3 cucharadas de yogur al estilo griego", "½ lima, solo jugo", "1 cucharada de jarabe de arce, más extra para servir", "½ mango, pelado y picado", "cuñas de lima, para adornar"], "method": ["En un tazón, mezcle la crema batida, el yogur, el jugo de lima y el jarabe de arce.", "Para servir, vierta la mezcla en un vaso de postre. Cubra con el mango picado, rocíe con jarabe de arce extra y decore con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_maplelimeandmangosyl_88335", "title": "Silabú de arce, lima y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb pastinacas", "125ml / 4fl oz de aceite vegetal", "80 ml / 3½ fl oz de jarabe de arce"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Pele las chirivías y luego divídalas a la mitad transversalmente, luego divida a la mitad o corte cada pieza a lo largo.", "Coloque las chirivías en una lata de asar. Vierta el aceite sobre las chirivías y mezcle bien para que el aceite cubra todas las piezas.", "Vierta el jarabe de arce sobre las chirivías y transfiera la lata de asar al horno. Tueste las chirivías durante 35 minutos, o hasta que estén tiernas y doradas.", "Para servir el lugar en un plato limpio."], "url": "www_bbc_co_uk_food_recipes_mapleroastparsnips_84758", "title": "Chirivías asadas al arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mapleroastparsnips_84758_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175 g / 6 oz de mantequilla o untar para hornear", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "½ cucharadita de extracto de vainilla", "Harina de levante 225g / 8oz", "pizca de sal", "2 cucharadas de leche", "2 cucharadas de cacao en polvo", "2 cucharadas de café negro fuerte, enfriado"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Engrase y forme una lata pequeña de pan o una lata redonda de 20cm / 8 pulgadas.", "Bata la mantequilla y el azúcar con un batidor eléctrico en un tazón grande hasta que esté muy pálido y esponjoso.", "Agregue el huevo batido, poco a poco, batiendo bien después de cada adición. A continuación, mezcle el extracto de vainilla.", "Tamiza la harina y la sal en un tazón grande, luego dobla suavemente en la mantequilla y la mezcla de huevo.", "Divida la masa de la torta en dos porciones iguales (alrededor de 350 g cada una).", "Agregue la leche a una porción de la mezcla, revolviendo suavemente hasta que esté bien combinada.", "Mezcle el cacao en polvo y el café en una taza para formar una pasta suave. Revuelva esta pasta en la otra porción de la mezcla de pastel hasta que esté bien combinada.", "Con una cuchara, aplique grandes gotas de cada mezcla de torta en la lata preparada, alternando los sabores para dar un efecto de mármol. Hornee durante 50-60 minutos hasta que la torta esté floja al tacto y un pincho de madera insertado en el centro del pastel salga limpio.", "Deje que la torta se enfríe en la lata durante diez minutos, luego colóquela sobre una rejilla de alambre y deje que se enfríe completamente antes de cortarla."], "url": "www_bbc_co_uk_food_recipes_marble_cake_64138", "title": "Pastel marmoleado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 tomates rallados", "3 dientes de ajo, pieles dejadas, aplastadas", "2 cebollas, más o menos picadas", "2 pimientos de ñora secos", "rape y huesos de rape (u otros huesos de pescado blanco)", "1.5 litros / 3¼ pintas de agua hirviendo", "1 limón, solo jugo", "pizca de sal", "4 cucharadas de aceite de oliva", "1 cola de rape entera, cortada en trozos grandes", "12 langostinos", "2 cebollas, finamente picadas", "4 dientes de ajo, finamente picados", "2 calamar, limpio, espinas eliminadas, carne picada", "2 pimientos de ñora secos, finamente picado (disponible en tiendas de delicatessen y especialistas en línea)", "Fideos de vermicelli cortos de 500 g / 1 lb 2 oz (llamado 'fideo' en España)", "2 cucharadas de pimentón ahumado", "Mejillones de 400g / 14oz, frotados y sin barba (deseche los mejillones que no se cierran herméticamente cuando se golpean firmemente)", "sal y pimienta negra recién molida", "100 g / 3½ oz de almendras", "4 cucharadas de perejil fresco picado", "2 limones, cortados en cuñas, para adornar"], "method": ["Para el caldo, coloque las cáscaras de tomate ralladas en una cacerola grande, reservando la carne para después, con el resto de los ingredientes de la reserva y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 30 minutos. Cuele el caldo y reserve el líquido.", "Para el fideuà, caliente la mitad del aceite en una paella o en una sartén grande, de base pesada y poco profunda a fuego medio. Agregue el rape y las gambas y fría por 1-2 minutos en cada lado, hasta que se doren por ambos lados, agregando más aceite si es necesario. Retire de la sartén y reserve.", "Caliente el aceite restante en la sartén, agregue las cebollas y fría por 3-4 minutos, o hasta que se ablanden. Agregue el ajo, la pulpa de tomate y el calamar y continúe cocinando a fuego lento durante 6-7 minutos, o hasta que el calamar esté opaco.", "Agregue los pimientos de la ñora y los fideos, mezcle bien y continúe cocinando por otros 2-3 minutos, o hasta que los fideos estén cubiertos en el aceite. Espolvorea sobre el pimentón ahumado.", "Vierte el caldo y lleva la mezcla a fuego lento. Cocine a fuego lento durante 10 minutos.", "Regrese el rape y las gambas a la sartén, luego coloque los mejillones sobre la parte superior de la fideuá. Sazone al gusto, con sal y pimienta negra recién molida, luego cubra la sartén con papel de aluminio o papel resistente a la grasa y continúe cocinando a fuego lento por otros 4-5 minutos, o hasta que los mejillones se hayan abierto (deseche los mejillones cuyas cáscaras no abierto durante la cocción).", "Mientras tanto, para la picada, muela las almendras y el perejil picado en un mortero lo más finamente posible.", "Para servir, espolvorea la picada sobre la fideuá, decora con trozos de limón y una cuchara en platos para servir."], "url": "www_bbc_co_uk_food_recipes_marias_fideu_61565", "title": "fideuá", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marias_fideu_61565_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina de auto crianza", "100 g / 3½ oz de avena mediana, más extra para quitar el polvo", "100g / 3½oz de harina integral", "50 g / 2 oz de azúcar en polvo", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "160 g / 5½ oz de mantequilla sin sal, ablandada, más extra para engrasar", "100 g / 3½ oz de nueces, aproximadamente picadas", "125ml / 4fl oz de suero de leche", "150ml / 5fl oz de jarabe de arce"], "method": ["Precalentar el horno a 200C / 400F / Gas 4.", "Mezcle la harina, la avena, la harina integral, el azúcar en polvo, el polvo de hornear y la sal en un recipiente.", "Agregue la mantequilla y frote en la mezcla de harina hasta que se asemeje a pan rallado.", "Dobla las nueces.", "Coloque el suero de leche y el jarabe de arce en un recipiente aparte y mezcle bien.", "Agregue la mezcla de suero de leche y jarabe de arce a la mezcla seca y mezcle bien para hacer una masa.", "Haga rodar la masa sobre una superficie de trabajo enharinada de 3 cm / 1½ pulgadas de espesor. Usando un cortador de pasteles, corte 12 bollos (o tantos como la masa proporcionará).", "Coloque en una bandeja de horno engrasada y transfiera al horno para hornear durante 10-12 minutos, o hasta que estén doradas.", "Coma cuando todavía esté caliente del horno."], "url": "www_bbc_co_uk_food_recipes_maplesyrupwalnutbutt_89621", "title": "Bollos integrales de jarabe de arce, nuez y suero de leche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Almendras molidas 250 g / 9 oz", "200g / 7oz de azúcar glas, más extra para quitar el polvo", "2 cucharadas de agua de rosas", "4-5 cucharadas de agua fría", "200g / 7oz de azúcar glasé", "1 cucharada de agua de rosas", "spray de brillo de oro comestible", "spray de brillo rojo comestible"], "method": ["Precaliente el horno a 150C / 130C Fan / Gas 2 y alinee dos bandejas para hornear con papel resistente a la grasa.", "Combine las almendras molidas y el azúcar glas en un tazón grande y bata con un batidor de globo. Agregue el agua de rosas con una espátula de goma, luego agregue gradualmente el agua para obtener una pasta suave y tersa. Rocíe ligeramente una superficie de trabajo limpia con azúcar glasé, abra la masa y extienda la mezcla en una hoja de menos de 1 cm / ½ pulgada de espesor.", "Use una lata agria acanalada de 20cm / 8in para cortar un círculo grande de la masa. Transfiera a una bandeja de horno preparada y hornee por 20 minutos, o hasta que esté dorado y firme.", "Reúna los restos de pasta, vuelva a enrollar y luego recorte formas decorativas como corazones, flores y estrellas. Transfiera a la segunda bandeja de horneado y hornee durante 15 minutos. Deje que el disco cocido y las formas se enfríen por completo.", "Mezcle el azúcar glas, agua de rosas y suficiente agua para hacer una formación de hielo vertible en un tazón. Coloque el disco en un estante de enfriamiento de alambre colocado sobre una bandeja de horno, luego vierta el glaseado para cubrir completamente el disco, incluidos los lados. Deja un poco de hielo a un lado. Sacuda suavemente la rejilla para igualar la superficie y luego déjela a un lado por una hora para que se asiente.", "Rocíe las formas decorativas con los aerosoles dorados y rojos y luego péguelas a la superficie del disco con puntos del exceso de hielo. Déjalo reposar durante 30 minutos."], "url": "www_bbc_co_uk_food_recipes_marchpane_petticoat_07592", "title": "Enagua de Marchpane", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de salsa de tomate", "7gm de mostaza Dijon (aproximadamente 1 cucharadita)", "algunas gotas salsa Worcestershire", "6 gotas de Tabasco", "50ml / 2fl oz de aceite de colza", "2 tomates de ciruela, sin piel, sin semillas y cortados en cubitos", "gran pizca finalmente cebollino picado", "175 g / 6oz filete de res añejado, finamente picado", "1 chalote de plátano pequeño, pelado y finamente picado", "1 pepinillo pequeño, finamente picado", "1 cucharadita de mini alcaparras, lavadas", "pizca de perejil plano de hoja finamente picado", "1 cucharadita de tomates condimentados (ver arriba)", "1kg / 2lb 4 oz tomates ciruela", "20g / ¾oz de apio, aproximadamente picado", "5g / ⅛ de ajo (alrededor de 1 diente), más o menos picados", "10g / ¼ oz chalotes, más o menos picados", "tomillo de ramita", "ramito de estragón", "2 ramitas de albahaca", "pizca de sal", "una pizca de azúcar", "pizca de pimienta de cayena", "Salsa de salsa Worcestershire", "4 gotas de Tabasco", "10 g de gelatina", "¼ de pan de masa fermentada, finamente rebanada", "aceite de oliva, para lloviznar", "Oscietra caviar", "berro micro-cohete", "cohete bebé", "bálsamo de limón bebé"], "method": ["Para la gelatina de tomate, coloque todos los ingredientes, excepto la gelatina, en un bol y mezcle hasta que estén bien combinados. Transfiera la mezcla a una licuadora y rellene con una pulpa.", "Vierta la pulpa en una tela de muselina. Ate la tela y cuélguela sobre un recipiente durante la noche. Mida 250 ml / 8½ del agua recogida en el recipiente y caliente ligeramente en una olla. Agregue la geletina y revuelva.", "Alinee una bandeja plana con una película adhesiva y vierta la mezcla de agua. Coloque en la nevera para establecer.", "Para los tomates especiados, mezcle el ketchup, la mostaza, la salsa Worcestershire, el Tabasco y el aceite de colza hasta que se emulsionen. Coloca los tomates de ciruela y el cebollín en un tazón y únelos con un poco de la mezcla de salsa de tomate, la mezcla restante se puede usar para hacer una salsa.", "Para el tartar de ternera, coloque el filete de res en un tazón. Agregue la chalota, el pepinillo, las alcaparras y el perejil. Agregue un poco de la salsa de tomate y sazone con sal y pimienta.", "Para las patatas crujientes de masa fermentada, precaliente el horno a 150C / 130C Fan / Gas 2.", "Coloque las rodajas de masa fermentada en una bandeja para hornear y rocíe con el aceite. Condimentar con sal y pimienta. Hornee hasta que estén crujientes, luego retírelo y déjelo enfriar. Mientras tanto, corta 6 círculos de la jalea establecida.", "Para servir, coloque 3 círculos de gelatina en un plato y cubra con el tartar de carne y los tomates con especias. Coloque los círculos de gelatina restantes en la parte superior y cuchara sobre el caviar. Viste el plato con las crujientes de masa fermentada, las hojas y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_marinated_beef_tartare_10869", "title": "Tartar de buey, jalea de tomate y crujientes de masa fermentada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4lb 8oz anguilas, cabezas eliminadas, piel y tripas eliminadas, cortadas en longitudes de 10cm / 4in", "harina común, condimentada con sal y pimienta negra recién molida", "150ml / 5fl oz de aceite de oliva", "4-5 dientes de ajo, en rodajas", "6 cucharadas de vinagre de vino blanco", "puñado de hojas de menta fresca"], "method": ["Coloque la anguila y la harina sazonada en una bolsa de comida. Selle y sacuda la bolsa para cubrir la anguila en la harina. Retire la anguila de la bolsa y sacuda el exceso.", "Calienta la mitad del aceite en una sartén grande a fuego medio. Agregue la anguila enharinada y fría, en lotes si es necesario, durante 1-2 minutos en cada lado, o hasta que se dore por todos lados. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Limpie la sartén con una hoja de papel de cocina. Caliente el aceite restante a fuego medio, luego agregue el ajo y fría por 1-2 minutos, o hasta que se ablanden pero no se coloreen.", "Agregue el vinagre a la sartén, sazone el ajo, al gusto, con sal y pimienta negra recién molida. Retire la sartén del fuego y reserve hasta que el contenido se haya enfriado.", "Revuelva las hojas de menta en la mezcla enfriada de vinagre y ajo.", "Coloque las piezas drenantes de anguila frita en el fondo de un plato de servir de vidrio. Vierta sobre la mezcla de adobo enfriada. Cubra y deje enfriar en el refrigerador durante 5-6 horas, o preferiblemente durante la noche, volteando los trozos de anguila en el adobo de vez en cuando.", "Sirva frío con ensalada verde y rebanadas de pan crujiente de buena calidad."], "url": "www_bbc_co_uk_food_recipes_marinated_eels_anguilla_70975", "title": "Anguilas marinadas (anguilla alla scapece)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]