[{"isVegetarian": true, "title": "Crumble-topped tarts", "url": "www_bbc_co_uk_food_recipes_crumble-topped_tarts_57648", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz shortcrust pastry ", "4 rounded tsp lemon curd ", "30g/1oz butter ", "2 tbsp rolled oats ", "2 dessertspoons caster sugar", "2 tbsp self-raising flour, plus extra for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash your hands and put on an apron. Weigh and measure all the ingredients. Preheat the oven to 200C/400F/Gas 5. ", "Roll out the pastry onto a lightly floured surface and cut out four circles using a 8cm/3¼ in cutter. Line four holes in a muffin tin with the pastry circles.", "Spoon the lemon curd into the pastry cases. ", "Melt the butter in a small saucepan and leave it to cool a little. Next add the oats, sugar and flour to the butter and mix with a fork, breaking it up into crumbs. ", "Sprinkle the crumbs onto the top of the tarts. Place the muffin tin onto a baking tray and bake for 15-20 minutes. Serve with fresh raspberries or strawberries."]}, {"isVegetarian": true, "title": "Crumble pot topping", "url": "www_bbc_co_uk_food_recipes_crumble_pot_topping_48476", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crumble_pot_topping_48476_16x9.jpg", "ingredients": ["3 large handfuls of rolled oats", "1 small handful mixed seeds or chopped mixed nuts", "knob of butter ", "3 tbsp brown sugar", "1 tsp cinnamon"], "serves": "Makes 10-12 servings", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Put the oats and seeds into a bowl. Melt the butter, brown sugar and cinnamon gently in a pan. When melted, pour into the oats and seeds and stir until completely coated. ", "Pour the mixture onto a baking tray lined with foil or baking paper, spread it out into an even layer. Bake in the oven for 10 minutes, stirring twice, until it is golden brown. Allow to cool completely, then store in an airtight container. It will keep for about a week."]}, {"isVegetarian": false, "title": "Crumpet eggs Benedict", "url": "www_bbc_co_uk_food_recipes_crumpet_eggs_benedict_35751", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large free-range eggs, yolks only", "½ lemon, juice only", "250g/9oz butter, melted", "pinch white pepper and salt", "2 tbsp white wine vinegar", "4 large free-range eggs", "4 toasted crumpets", "4 rashers of grilled maple smoked bacon"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the hollandaise, place the egg yolks, lemon juice and one tablespoon of water in the bowl of a food processor.  Turn on and mix for one minute.  With the motor still running very slowly, trickle the warm melted butter through the funnel on the lid of the processor. The sauce with slowly start to thicken.  When all the butter has been incorporated, scrape the side of the bowl and give one final pulse. Season with salt and a little white pepper. You should have a rich buttery sauce.", "To poach the eggs bring two litres of water to the boil with the vinegar.  Lower the heat so the water is not bubbling.", "Break the eggs into separate ramekins or cups. Slide the eggs into the water and leave to poach 2-3 minutes.  Alternatively, stir the water to form a vortex before you slide the first egg in and cook them one at a time. Cook for 2-3 minutes them remove and drain. ", "To serve, place a crumpet on a plate and top with a poached egg, spoon over some sauce and arrange the bacon on the side."]}, {"isVegetarian": true, "title": "Crumpets", "url": "www_bbc_co_uk_food_recipes_crumpets_61013", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crumpets_61013_16x9.jpg", "ingredients": ["175g/6oz strong white flour", "175g/6oz plain flour", "2 x 7g sachets instant yeast", "1 tsp caster sugar", "350ml/12fl oz warm milk", "150-200ml/5-7fl oz warm water", "½ tsp bicarbonate of soda", "1 tsp salt", "sunflower oil for cooking"], "serves": "Makes 10-12 crumpets", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Weigh the flours in to a bowl. Add the yeast and stir through the flour.", "Dissolve the sugar in the warm milk and pour onto the flour. Using a wooden spoon beat until you have a smooth batter. This will take 3-4 minutes and is hard work, but is essential to produce the holes in the crumpets. ", "Cover and leave for at least 20 minutes and up to an hour. The batter will rise and then begin to fall. You will see marks on the side of the bowl where the batter was before it dropped. ", "Mix the bicarbonate of soda and salt with the warm water and beat it into the batter.  Add about ¾ of the water and keep adding it until you get a double cream consistency. Cover and rest for 20 minutes.", "Heat a flat griddle or heavy based pan. Lightly grease the inside of four metal crumpet rings. Lightly grease the griddle. Sit the rings on the griddle over a medium heat. ", "Drop two dessert spoons of mixture into each ring. After 4-5 minutes bubbles should appear and the surface should be set. Carefully turn the crumpets in their rings and cook for a further three minutes. ", "Serve immediately or leave to cool and then toast before eating with plenty of butter. "]}, {"isVegetarian": true, "title": "Crumpets", "url": "www_bbc_co_uk_food_recipes_crumpets_93122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350ml/12¼fl oz whole milk", "225g/8oz strong white flour", "125g/4½oz plain flour", "1 x 7g/¼oz sachet fast-action dried yeast", "½ tsp fine sea salt", "1 tsp caster sugar", "1 level tsp bicarbonate of soda", "150ml/5¼fl oz warm water", "butter, for greasing, plus extra to serve"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Warm the milk in a saucepan very gently until tepid. ", "Sift the flours into a large bowl and stir in the yeast, salt and sugar until well-combined. ", "Make a well in the centre of the mixture and stir in the warm milk. Beat well with a wooden spoon for 3-4 minutes, or until the batter is thick and elastic. ", "Cover the bowl with cling film and set aside in a warm place for an hour, or until the batter has doubled in size.", "When the batter has risen, mix the bicarbonate of soda with the warm water, and beat the mixture into the batter for a couple of minutes. Set aside to rest in a warm place for a further 30 minutes. By this time the mixture should have risen and be covered with tiny bubbles. ", "Heat a flat griddle pan or large heavy-based non-stick frying pan over a medium-high heat. ", "Generously butter the insides of four crumpet rings or 9cm/3½in chefs' rings and place them onto the griddle or into the frying pan. Warm the rings for a minute or two. ", "Using a dessertspoon, drop three large spoonfuls of the crumpet batter into each ring. It should come around 1.5cm/½in up the sides of each ring, but no more. Cook for 9-12 minutes, or until lots of tiny bubbles have risen to the surface and burst and the tops look dry and set. ", "Carefully lift off the rings - it shouldn't be too difficult as the crumpets will ease back from the sides when they are ready. (Use an oven glove and take care as the crumpet rings will be hot.) ", "Flip the crumpets over with a spatula and cook on the other side for a further two minutes, or until golden-brown. You can keep these crumpets warm while the remaining batter is prepared, or serve immediately spread with lots of butter. ", "Cook the remaining crumpets in exactly the same way as the first, washing and buttering the rings well before re-using. The crumpets can also be cooled and then toasted."]}, {"isVegetarian": true, "title": "Crunchy banana yoghurt", "url": "www_bbc_co_uk_food_recipes_crunchy_banana_yoghurt_48211", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_banana_yoghurt_48211_16x9.jpg", "ingredients": ["340g/12oz fat-free natural Greek-style yoghurt", "1 banana, peeled and sliced", "15g/½oz mixed seeds (pumpkin, sesame and sunflower) (or use toasted flaked almonds) "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Divide the yoghurt between two small bowls. Scatter the banana on top.", "Sprinkle with seeds or nuts and serve."]}, {"isVegetarian": false, "title": "Crunchy chicken cutlets", "url": "www_bbc_co_uk_food_recipes_crunchy_chicken_cutlets_21611", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_chicken_cutlets_21611_16x9.jpg", "ingredients": ["2 chicken escalopes or breast fillets (200–300g/7-10½oz total), preferably organic", "70g/2½oz Dijon mustard", "1 garlic clove, finely grated or minced", "½ tsp ground cinnamon", "1 free-range egg", "75g/2¾oz cornflakes", "1½ tsp pimentón picante or paprika", "2 tbsp sunflower oil", "cherry tomatoes", "rocket or salad leaves of your choice", "1 lemon, cut into wedges", "cherry tomatoes", "rocket or salad leaves of your choice", "1 lemon, cut into wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Take the chicken out of the fridge so that it isn’t too cold by the time you get frying. If you are using filleted chicken breasts, rather than escalopes, then proceed as described in the tips section.", "Get out a shallow dish that, preferably, you can get both escalopes in, and spoon in the mustard and garlic. Add the cinnamon and egg and whisk to combine. Put the escalopes in, turn them, and leave to sit in the mixture while you prepare the \"crumbs\".", "Put the cornflakes in a bowl and crush them by hand. This, sadly, is not as brutal as it sounds: merely break them up with your fingers to get coarsely crushed flakes, but not dust. Add the pimentón or paprika and use a fork to mix in.", "Dredge the egg-and-mustard-soaked escalopes, one by one, in the cornflake crumbs, so that they are well covered, and then transfer to a wire rack for 5–10 minutes so they can dry out.", "Heat the oil in a cast-iron pan or heavy-based frying pan in which the chicken pieces will fit neatly. Once hot, fry the chicken for 3 minutes on the first side, then turn them over carefully and give them another 3 minutes, by which time the chicken should be cooked through in the middle, though do check. Remove to waiting plates, already strewn with tomatoes and rocket or salad leaves of your choice."]}, {"isVegetarian": true, "title": "Crunchy palak paneer", "url": "www_bbc_co_uk_food_recipes_crunchy_palak_paneer_42857", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_palak_paneer_42857_16x9.jpg", "ingredients": ["2 tbsp ghee or clarified butter", "2 onions, finely chopped", "5cm/2in fresh root ginger, peeled and finely chopped", "3 garlic cloves, chopped", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp ground turmeric", "½ tsp fenugreek seeds", "1 hot red chilli", "1 tsp salt", "400g tin chopped tomatoes", "1 tsp caster sugar", "2 tsp garam masala", "50g/1¾oz semolina", "200g/7oz paneer, cut into 2cm/¾in cubes", "1 tbsp vegetable oil", "500g/1lb 2oz spinach, washed", "small handful chopped fresh coriander leaves", "squeeze lemon juice"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the ghee in a saucepan, add the onions and cook for 3 minutes, or until soft. Add the ginger and garlic and cook for 1 minute.", "Add the cumin, ground coriander, tumeric, fenugreek, chilli and salt. Cook, stirring, for 1 minute to infuse all the spices. Add the tomatoes and sugar, stir and simmer for 10 minutes.", "Meanwhile, in a mixing bowl, combine the garam masala and semolina. Mix in the paneer to coat it. Heat the oil in a frying pan and cook the paneer for a few minutes until crisp and golden on all sides.", "Add the spinach to the tomato sauce with 2 tablespoons water, stir and cook until wilted. Fold in the crunchy paneer. Remove the whole chilli.", "Serve garnished with the fresh coriander and lemon juice."]}, {"isVegetarian": true, "title": "Crunchy apple and blackberry crumble", "url": "www_bbc_co_uk_food_recipes_crunchyappleandblack_7679", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchyappleandblack_7679_16x9.jpg", "ingredients": ["900g/2lb bramley apples", "350-400g/12oz-1lb blackberries", "175g/6oz demerara sugar", "2 lemons", "225g/8oz plain flour", "175g/6oz butter", "55g/2oz demerara sugar", "125g/4oz muesli or a mixture of oats, seeds and chopped nuts"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Peel, core and chop the apples into small chunks. Cut the lemons in half and squeeze the juice over the apple and mix well. This not only adds flavour but prevents the freshly peeled apples from discolouring.", "Layer the apples, blackberries, and sugar in a large pie dish (a lasagne dish is ideal).", "Place the flour in a large bowl and then rub in the butter until it resembles breadcrumbs - leave a few lumps of butter so that the topping is not too fine. Add the muesli or oat/seed/nut mixture and the sugar and mix through.", "Use a spoon to sprinkle the crumble topping evenly over the fruit. Bake for 45 minutes or until the fruit is cooked and bubbling juices seep through the topping.", "Cool for a few minutes and then serve with custard or fresh cream."]}, {"isVegetarian": false, "title": "Crunchy chilli chicken with rocket pesto", "url": "www_bbc_co_uk_food_recipes_crunchychillichicken_74008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 225g/8oz chicken breasts", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 plum tomatoes", "¼ fresh red chilli, de-seeded", "2 anchovy fillets, from a can", "¼ red pepper, de-seeded", "¼ small red onion peeled", "½ garlic clove, peeled", "2 tbsp olive oil", "115g/4oz instant polenta", "115g/4oz rocket leaves", "½ garlic clove, peeled", "1 tbsp pine kernels, toasted", "8 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the topping, place the tomatoes, chilli, anchovy, red pepper, onion and garlic into a blender and purée to a rough paste.", "Add the olive oil and season well with salt and pepper.", "Combine this purée with the instant polenta in a bowl.", "Place all the pesto ingredients in the blender and blend into a fine purée. Remove from the blender and leave to one side.", "Preheat the oven to 200C/400F/Gas 6.", "Season the chicken breasts with salt and pepper. Heat the olive oil in a pan and seal the chicken breasts for a few minutes on each side to colour the flesh. ", "Place the chicken breasts on an oven tray and top each with a thick coating of the polenta mixture.", "Bake in the oven for about 20 minutes to cook the chicken through and allow the topping to go crunchy. ", "Place the chicken breasts on a plate and serve with a dollop of the rocket pesto on the side."]}, {"isVegetarian": true, "title": "Peanut butter cookies", "url": "www_bbc_co_uk_food_recipes_crunchypeanutbutterc_87012", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchypeanutbutterc_87012_16x9.jpg", "ingredients": ["8 tbsp plain flour", "2 tbsp caster sugar", "2 tbsp crunchy peanut butter", "1 free-range egg yolk", "50g/1¾oz butter, softened", "icing sugar, for dusting"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the flour, sugar, peanut butter, egg yolk and butter into a large bowl and mix together until combined to a smooth dough. ", "With lightly floured hands, break off evenly sized pieces of the dough and roll into walnut sized balls. ", "Place the dough balls onto a baking sheet lined with silicon paper or baking parchment and gently press each ball with the back of a fork to flatten slightly. ", "Place in the oven and bake for ten minutes, or until just turning golden-brown. ", "Transfer the cookies to a wire rack and allow to cool for ten minutes. ", "To serve, place on a serving plate and dust with icing sugar."]}, {"isVegetarian": true, "title": "Crunchy pepper salad with lemon and olive oil dressing", "url": "www_bbc_co_uk_food_recipes_crunchypeppersaladwi_90718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ iceberg lettuce, shredded", "¼ red pepper, seeds removed, finely sliced", "¼ yellow pepper, seeds removed, finely sliced", "¼ onion, finely sliced", "2 tbsp chopped fresh parsley", "½ lemon, zest and juice", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix together the lettuce, red and yellow pepper, onion and parsley.", "In a small bowl, whisk together the lemon zest, lemon juice and olive oil, then season with salt and freshly ground black pepper. ", "To serve, drizzle the dressing over the salad and mix well to coat. Serve piled on a serving plate."]}, {"isVegetarian": false, "title": "Crushed Cornish potatoes", "url": "www_bbc_co_uk_food_recipes_crushedcornishpotato_11368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz Cornish new potatoes (if you cannot get Cornish use Jersey)", "2L/3½pt water to cover ", "2 heads of garlic, cut in half", "2 large bay leaves ", "20 sprigs of thyme", "1 tsp chicken bouillon ", "40g/1½oz salt ", "100g/3½ unsalted butter ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Scrub and wash the new potatoes and place into a saucepan. ", "Cover with the water and then add the rest of the ingredients, except the butter and final seasoning.", "Bring to the boil and reduce to a simmer. ", "Cook for approximately 20 minutes. ", "Once cooked, drain and using a fork or a potato masher, crush the potatoes lightly, add the butter and season with salt and pepper. "]}, {"isVegetarian": true, "title": "Crushed new potatoes", "url": "www_bbc_co_uk_food_recipes_crushednewpotatoes_88411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1 lb 5oz new potatoes", "1 tbsp butter", "1 tbsp crème fraîche", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil and add the new potatoes. Boil until tender", "Drain and crush them with the back of a fork.", "Stir in the butter and crème fraîche and season, to taste, with salt and freshly ground black pepper.", "Serve."]}, {"isVegetarian": false, "title": "Crushed potato and leek cake, with crispy parma ham", "url": "www_bbc_co_uk_food_recipes_crushedpotatoandleek_76109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz new potatoes", "¼ leek, chopped", "25g/1oz butter", "1 slice parma ham"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato cake, cook the new potato in boiling water for five minutes, crush with a fork.", "Add the potato to the leeks and fry in the butter for five minutes until golden and crispy.", "Serve upside down on a plate.", "Crisp the Parma ham in a hot pan on a high heat and turn over, cook for 2-3 minutes.", "Drain off the fat on kitchen paper.", "Serve the crispy parma ham with the potato cake."]}, {"isVegetarian": true, "title": "Crêpes suzette", "url": "www_bbc_co_uk_food_recipes_crpes_suzette_27204", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz plain flour", "1 free-range egg", "1 tsp melted butter", "300ml/10½fl oz milk", "butter, for frying", "50g/1¾oz unsalted butter", "1 orange, zest and juice", "2 oranges, juice only", "1 lemon, zest and juice", "3 tbsp caster sugar", "2 tbsp orange liqueur", "2 tbsp brandy"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crêpes, place the flour into a bowl. Add the egg, melted butter and milk and whisk to a smooth batter. Set aside for at least one hour, preferably overnight.", "Heat a frying pan until medium hot, melt a little butter in the pan, then add a ladle of batter and swirl to coat the bottom of the pan. Cook for 1-2 minutes, then flip and cook for a further minute.", "Slide the crêpe from the pan and place on greaseproof paper. Repeat with the remaining batter, layering the crêpes with greaseproof paper as you go. The crêpes can be chilled or frozen at this point and used later.", "For the sauce, heat a frying pan until hot, add the butter, orange zest and juice, lemon zest and juice and the caster sugar.", "Cook for a few minutes until just thickened and bubbling, then remove the pan from the heat.", "Fold the crêpes into quarters and carefully lay into the hot sauce. Return the pan to the heat then add the orange liqueur and brandy and flame to burn off the alcohol. (CAUTION: Keep your face and hair away from the flames. Do not leave the pan unattended.)", "Cook for a couple of minutes until the crêpes are heated through.", "To serve, spoon the crêpes onto serving plates and spoon the sauce over the top."]}, {"isVegetarian": false, "title": "Crushed potatoes with hot smoked salmon, poached egg and hollandaise", "url": "www_bbc_co_uk_food_recipes_crushedpotatoeswithh_84388", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz new potatoes, cooked hot", "1 tsp wholegrain mustard", "small bunch of fresh chervil, chopped", "55g/2 oz smoked salmon", "15g/¼oz butter", "100g/3½oz baby spinach leaves", "1 free-range egg, for poaching", "1 tbsp white wine vinegar", "2 free-range egg yolks", "3 tbsp white wine vinegar", "110g/4oz butter, melted", "salt and freshly ground black pepper", "2 tsp lumpfish roe"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a clean bowl, crush the potatoes with the back of a wooden spoon until mashed.  ", "Add the mustard and chervil and season to taste with salt and freshly ground black pepper.  ", "Placea 10cm/4in chefs' rings onto a plate and top the potato with the smoked salmon.", "For the spinach, gently melt the butter in a frying pan over a medium heat, add the spinach and cook for 1-2 minutes or until the spinach has wilted.", "For the poached egg, bring a large pan of water to the boil and add the white wine vinegar. Whisk the centre of  the water to create a whirlpool. Crack the egg into the whirlpool and leave to poach gently for four minutes, or  until set. Carefully remove with a slotted spoon.", "For the hollandaise sauce, place the egg yolks into a food processor. Place the vinegar into a saucepan over a  high heat and reduce down to one tablespoonful.", "Add the vinegar to the egg yolks in the food processor and blend, while gradually pouring in the melted butter  with the motor running, to form a thick sauce.", "Season with salt and freshly ground black pepper. Add the lumpfish roe and stir. ", "Place the spinach into the centre of a serving plate.  Place the chefs' ring with potato and spinach on top, then  carefully remove the ring.  Place the poached egg on top and spoon over the lumpfish hollandaise.", "Serve immediately."]}, {"isVegetarian": true, "title": "Crushed truffle potatoes", "url": "www_bbc_co_uk_food_recipes_crushedtrufflepotato_86931", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz new potatoes", "salt and freshly ground black pepper ", "½ tbsp olive oil", "1 tbsp butter ", "½ tsp chopped truffle (from a jar) ", "sprig fresh basil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in salted water for 12-15 minutes, or until tender. Drain and season with salt and freshly ground black pepper.", "Add the olive oil and butter and lightly crush with a fork or potato masher. Stir in the chopped truffle.", "To serve, place onto a serving plate with a sprig of basil, to garnish."]}, {"isVegetarian": false, "title": "Crusted lamb cutlets with crushed Roquefort potatoes", "url": "www_bbc_co_uk_food_recipes_crustedlambcutletswi_88338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fresh white breadcrumbs", "salt and freshly ground black pepper", "4 lamb cutlets", "1 free-range egg, beaten", "1 tbsp olive oil", "25g/1oz butter", "1 tbsp chopped fresh mint leaves", "½ lemon, juice only", "250g/9oz new potatoes, cooked, still warm", "55g/2oz Roquefort cheese, crumbled", "small handful fresh mint leaves, chopped", "salt and freshly ground black pepper", "50ml/2fl oz double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crusted lamb cutlets, place the breadcrumbs, salt and freshly ground black pepper into a mini blender and process until well combined. Dip the lamb cutlets into the beaten egg and then roll in the breadcrumbs.", "Heat the olive oil in a frying pan, add the cutlets and fry on both sides until golden-brown and cooked through. Remove the lamb cutlets from the pan and set aside to rest in a warm place.", "Add the butter, mint and lemon juice to the pan and simmer together.", "For the crushed Roquefort potatoes, place the hot cooked potatoes into a saucepan, add the Roquefort, mint, salt, freshly ground black pepper and cream and crush roughly with the back of a fork.", "To serve, divide the crushed potatoes between two serving plates and top with the lamb cutlets. Pour over the mint and butter sauce from the pan and serve."]}, {"isVegetarian": false, "title": "Crusted pistachio chicken with pea mash, fennel salad and herb vinaigrette", "url": "www_bbc_co_uk_food_recipes_crustedpistachiochic_88352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, cut in half to make 2 thin escalopes", "dash olive oil", "55g/2oz pistachios, shells removed, chopped", "salt and freshly ground black pepper", "150g/5½oz frozen peas, defrosted", "25g/1oz butter", "salt and freshly ground black pepper", "½ fennel bulb, finely sliced", "¼ red pepper, finely sliced", "1 tbsp balsamic vinegar", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crusted pistachio chicken, rub the chicken in olive oil, roll in the chopped pistachios and season with salt and freshly ground black pepper. Drizzle with a little more olive oil, heat a griddle pan and griddle the chicken for 3-4 minutes on each side, or until completely cooked through.", "For the pea mash, cook the peas in a pan of boiling salted water for 2-3 minutes. Drain and return to the pan with the butter, salt and freshly ground black pepper. Process with a hand blender until smooth, adding a little water if the mixture is too thick.", "For the fennel salad, place all the salad ingredients into a large bowl and stir well.", "To serve, place the pea mash onto a serving plate, top with the spiced chicken and place the salad on the side."]}, {"isVegetarian": false, "title": "Crusted rack of lamb with red wine jus and chargrilled baby carrots", "url": "www_bbc_co_uk_food_recipes_crustedrackoflambwit_88898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 4-chop rack of lamb", "salt and freshly ground black pepper", "55g/2oz white breadcrumbs", "2 tbsp chopped fresh chives", "2 tbsp chopped fresh parsley", "85g/3oz pine nuts, toasted", "2 tbsp olive oil", "250ml/9fl oz red wine", "½ beef stock cube", "1 tbsp tomato purée", "25g/1oz butter", "salt and freshly ground black pepper", "4 baby carrots, whole with tops", "2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lamb, season the lamb with salt and freshly ground black pepper. Heat a dry ovenproof frying pan then add the lamb rack, skin-side down. Sear the meat on all sides then transfer to the oven to cook for 8-10 minutes.", "Meanwhile, place the breadcrumbs, chives, parsley, pine nuts and oil into a food processor and pulse until smooth.", "Remove the lamb from the oven and press the crust mixture onto the outside of the rack. Return to the oven for 3-5 minutes, or until the crust is golden-brown and the lamb is cooked to your liking.", "For the red wine jus, heat the wine in a small frying pan over a medium heat. Crumble in the beef stock cube and add the tomato purée. Bring to the boil and reduce for 4-5 minutes.", "Remove from the heat, add the butter and stir to create a glossy sauce.", "For the chargrilled carrots, heat a griddle pan until hot, then add the carrots and oil and cook for 8-10 minutes, turning occasionally, until the carrots are tender and cooked through. ", "To serve, cut the lamb into separate cutlets and place onto a plate. Place the carrots alongside and spoon the red wine jus around the edge of the plate."]}, {"isVegetarian": false, "title": "Côte de boeuf with béarnaise sauce", "url": "www_bbc_co_uk_food_recipes_cte_de_boeuf_with_93932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kg/4lb côte de boeuf", "300g/10½oz butter", "4 large potatoes, peeled and cut into 1cm/½in-thick chips", "dripping or vegetable oil, for deep-frying", "3 tbsp tarragon vinegar", "½ tsp whole white peppercorns", "1 small banana shallot, finely chopped", "2 free-range egg yolks", "sea salt and freshly ground black pepper", "1 small bunch fresh tarragon, leaves only, finely chopped ", "1 bunch fresh watercress, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Place the côte de boeuf into a roasting tray and roast for 30-40 minutes, until cooked to your liking. ", "While the meat is cooking, prepare the chips.", "Heat the oil in a deep-fat fryer to 140C/285F. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns very pale golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the chips into the hot oil, in batches, and fry for 4-5 minutes, or until pale golden-brown but tender. Remove from the hot oil using a slotted spoon and set aside to drain on kitchen paper.", "Remove the pan of oil from the heat but do not discard the oil.", "When the côte de boeuf is cooked to your liking, remove it from the oven and set aside to rest for 5-10 minutes.", "Heat 50g/1¾oz of the butter in a large frying pan over a high heat. When the butter is foaming, add the beef and fry for 1 minute on each side, or until browned all over, spooning the melted butter over the meat as it fries. Set aside to rest again. ", "For the béarnaise, melt the remaining butter in a saucepan over a medium heat. Skim off any milk solids that rise to the surface, to clarify the butter.", "Bring the vinegar to the boil in a separate, non-reactive saucepan with the peppercorns and shallots. Reduce the heat until the mixture is simmering and simmer over a low heat for 3-4 minutes, or until most of the liquid has evaporated, leaving only about 1 tablespoon in the pan.", "Whisk the egg yolks in a bowl, then gradually add the melted butter a little at a time, whisking after each addition – the aim is for the mixture to emulsify and thicken slightly. Discard any milk solids at the bottom of the pan.", "When all of the butter has been incorporated into the eggs, spoon in the shallots and any liquid remaining in the pan, then stir in the chopped tarragon and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Just before serving, return the pan of oil to the heat and heat to 190C/375F (a bread crumb will sizzle and go dark brown in 1 minute). Lower the cooked chips into the hot oil and cook for 3-4 minutes, or until golden-brown and crisp. Remove from the pan using a slotted spoon, set aside to drain on kitchen paper, and sprinkle with salt.", "To serve, carve the côte de boeuf into slices and divide them among the serving plates. Pile the chips alongside, then finish with a dollop of béarnaise and garnish with the watercress leaves."]}, {"isVegetarian": true, "title": "Crystallised flowers", "url": "www_bbc_co_uk_food_recipes_crystallisedflowers_4785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large egg white", "1 tbsp water", "fresh pansies, violas or rose petals", "55g/2oz superfine caster sugar"], "serves": "Makes flowers for 4 Servings", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["In a small bowl, stir together the egg white and water. Grasp the petals with a pair of tweezers and carefully brush the egg mixture onto the petals, lightly coating both sides. ", "In another bowl, toss the petals with the sugar and transfer to a rack. Allow the petals to dry at least 6 hours, longer if necessary."]}, {"isVegetarian": true, "title": "Cuba libre", "url": "www_bbc_co_uk_food_recipes_cubalibre_85336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["handful ice", "50ml/2fl oz white rum", "1 lime, cut into quarters", "cola, to top up", "lime wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ice into a highball glass and pour over the rum.", "Squeeze over the lime wedges and add the wedges to the glass.", "Top up with the cola, garnish with a lime wedge and serve."]}, {"isVegetarian": true, "title": "Cuban summer", "url": "www_bbc_co_uk_food_recipes_cubansummer_86600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/10½fl oz Cuban white rum ", "700ml/1 pint 5fl oz apple juice ", "50ml/2fl oz elderflower cordial ", "2 lemons, halved ", "1 lime, cut into wedges", "cloudy lemonade, to top up"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the rum, apple juice and elderflower cordial into a large jug.", "Squeeze in the juice of the two lemons, then add the lemon pieces and lime wedges. Mix with a wooden spoon.", "Half-fill a plastic cup filled with ice with the rum mixture, then top up with cloudy lemonade."]}]