[{"isVegetarian": true, "title": "Caramel and coffee choux buns", "url": "www_bbc_co_uk_food_recipes_caramel_and_coffee_choux_37354", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramel_and_coffee_choux_37354_16x9.jpg", "ingredients": ["75g/2¾oz butter, diced", "100g/3½oz plain flour", "3 free-range eggs", "280ml/9¾fl oz milk", "3 free-range egg yolks", "60g/2¼oz caster sugar", "2 tbsp instant coffee granules", "30g/1oz plain flour", "1 x 397g/14oz tin caramel condensed milk", "300ml/10½fl oz double cream", "75g/2½oz icing sugar", "70ml/2½fl oz coffee liqueur", "200g/7oz soft light brown sugar", "60ml/2¼fl oz full-fat milk", "75g/2½oz butter", "75g/2½oz plain flour", "8g whole edible coffee beans, roughly chopped ", "80g/3oz caster sugar", "80g/3oz pecans"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a large baking tray with baking parchment. ", "For the choux pastry, bring 110ml/4fl oz  water to the boil in a saucepan with the butter. ", "Add the flour all at once and, using a wooden spoon, immediately beat it into the water until smooth. Remove the pan from the heat and continue to beat the mixture until it has cooled slightly. ", "Add the eggs one at a time, beating each one into the mixture, until the eggs are fully incorporated and the mixture is glossy. Set aside to cool slightly.", "Spoon the choux pastry into a piping bag. Pipe balls or short lines of the choux pastry onto the prepared baking tray, leaving a generous gap between each.", "Bake the choux buns in the oven for 10-15 minutes until risen, then reduce the oven temperature to 180C/160C Fan/Gas 4 and bake for a further 30-35 minutes, or until golden-brown (keep checking towards the end of the cooking time. If your oven has hot spots you may need to move the buns around to ensure they all cook evenly). Prop the oven door open a little (wedge the handle of a wooden spoon into it) and turn off the heat. Leave the choux buns in the oven to ‘dry’ out. ", "For the filling, bring the milk just to the boil in a saucepan. ", "In a bowl, whisk together the egg yolks, caster sugar and coffee granules until pale and fluffy. Add the flour to the egg mixture and whisk again until well combined. ", "Pour the warm milk over the egg mixture and whisk well to combine, then return the filling mixture to the saucepan and simmer over a medium heat for 5-8 minutes, or until the mixture has thickened. ", "Strain the filling mixture through a fine sieve into a clean bowl. Cover the bowl with cling film and set aside to cool, then chill the mixture in the fridge until completely cold.", "Whisk the caramel condensed milk into the cold filling mixture until well combined. Chill in the fridge until needed.", "For the coffee whipped cream, whisk together the double cream, icing sugar and coffee liqueur until stiff peaks form when the whisk is removed. Spoon the mixture into a piping bag and chill in the fridge until needed.", "For the glaze, melt the sugar, milk, butter and flour together in a saucepan, stir well, then bring the mixture to the boil. Remove from the heat and set aside for 5 minutes to cool, then stir well; it should have the consistency of honey. ", "Spread a little of the glaze on the top of each choux bun, then sprinkle some of the chopped coffee beans over each. Leave to set.", "For the sugared pecans, heat the sugar in a frying pan over a low to medium heat until it melts and turns light golden-brown (do not stir the sugar at all). Add the pecans and stir to completely coat them in the syrup.", "Scrape the sugared pecans onto a baking tray lined with baking paper, then set aside to cool and harden. Once hardened, roughly chop the sugared nuts.", "To assemble the choux buns, cut the choux buns in half horizontally and spread some of the caramel filling mixture and then the coffee whipped cream over the bases. Sprinkle over a few of the sugared pecans, then top with the glazed part of the choux buns. Serve immediately."]}, {"isVegetarian": true, "title": "Spinach, caramelised garlic, red pepper and potato pithivier", "url": "www_bbc_co_uk_food_recipes_caramelised_garlic_red_75054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz strong white flour", "375g/13oz butter – firm but not hard", "1½ tsp fine salt", "1 x 450g/1lb bag baby potatoes ", "6 sweet red Romano peppers, thinly sliced", "1 tbsp olive oil", "knob of butter", "1½ tsp ground cumin", "2 tsp caster sugar", "5 garlic cloves, peeled", "2 tbsp olive oil ", "2 tbsp balsamic vinegar", "1¼ tsp caster sugar", "1½ tsp chopped rosemary", "1½ tsp chopped thyme", "2 tbsp chopped tarragon", "500g/1lb 2oz spinach, washed", "200g/7oz soft goat’s cheese", "130g/4½ oz mature cheddar cheese, grated", "2 free-range eggs", "salt and freshly ground pepper"], "serves": "Makes 1", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, sift the flour and salt into a large bowl.  Add the butter and rub it into the flour. Do not take it to the fine breadcrumbs stage, as we want squashed pieces of butter showing in the mix.  Add 140-150ml water to bring it all together.  This dough does not require kneading. ", "Flour a work surface and roll out the dough into a neat rectangle that is three times longer than its width.  Fold one-third of the dough towards the centre and cover this with the other third, so it is neatly folded, like a letter. Cover the dough and rest in the fridge for 20 minutes. ", "Remove the dough from the fridge and with the long side towards you, roll it out again to three times as long as it is wide, and fold as before. Turn the folded dough 90 degrees and repeat the rolling and folding. Cover the dough and let it rest again for a minimum of 20 minutes in the fridge (up to an hour if you have the time). The dough is now ready to use.", "For the potato layer, cook the new potatoes in salted, boiling water until tender. Drain the potatoes and set aside to cool. Once cool, cut the potatoes into 5mm/¼ in slices. Place the potato slices onto a plate, season with freshly ground black pepper, and set aside.", "For the red pepper layer, heat olive oil and butter in a large frying pan. Cook the sliced peppers for five minutes, or until soft.  Add the ground cumin, sugar and season with salt and freshly ground black pepper and mix well. Remove from the heat and set aside to cool.", "For the spinach and caramelised garlic layer, simmer the garlic cloves in boiling water for three minutes. Drain well. Transfer the garlic cloves to a large saucepan and fry in olive oil for four minutes, until gently browned. ", "Add the balsamic vinegar and 240ml/9fl oz water to the garlic cloves and simmer for 10 minutes.  ", "Add the sugar, rosemary, thyme, tarragon and season with salt. Simmer until most of the liquid has evaporated and the garlic cloves are coated with the dark caramel. ", "Heat the spinach in a large saucepan, until it starts to wilt. Season the spinach, then drain and press out as much water as possible. Mix the spinach into the garlic mixture. Whisk together the soft goat’s cheese and one of the eggs. Add this to the spinach and mix thoroughly. Set aside until needed.", "Preheat oven to 220C/425F/Gas 7.", "To assemble the pithivier, roll out two discs of pastry, one 32cm/13in diameter for the base, and one 35cm/14in diameter for the top and 3mm/ 1/8in thick.", "Whisk the remaining egg to use as egg-wash. Place the pastry disc for the base onto non-stick parchment lined baking tray. Brush the edges with egg-wash, leaving an unwashed area in the centre the size of a saucer or side plate. ", "Layer on the sliced potatoes, leaving a 4cm/1½in border around edge. Season with freshly ground black pepper. ", "Next, layer on the prepared red peppers, covering  the potatoes. ", "Then lay the garlic and spinach mixture, over the red peppers. ", "Sprinkle the grated cheddar cheese on top. Using your hands, neaten the filling into a mound.", "Place the larger pastry disc on top of the filling and let it join up with the base. Press both together to seal. Cut off excess pastry. ", "Create a scalloped edge using the back of a knife by pressing the pastry between your thumb and forefinger.  Transfer to the fridge to rest for 15 minutes.", "Remove the pithivier from the fridge and brush with egg-wash.  Make a small hole in the centre and four other small openings around the upper edge to allow steam to escape. ", "Using a small knife, decorate the pithivier with a radiating sunbeam pattern; start at the centre of the pastry, mark lines running out the edge. Avoid cutting all the way through. You can also score the scalloped edge. ", "Bake the pithivier in the preheated oven for 10 minutes, then reduce the temperature to 200C/400F/Gas 6 and continue to bake for another 15-20 minutes. ", "When cooked, cool the pithivier on a wire rack and serve warm or at room temperature."]}, {"isVegetarian": false, "title": "Caramelised onion and feta tartlets", "url": "www_bbc_co_uk_food_recipes_caramelised_onion_and_37169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2½oz salted butter, plus extra for greasing", "70g/2½oz lard", "300g/10½oz plain flour ", "1 tbsp olive oil", "3 red onions, thinly sliced", "1 tbsp brown sugar", "2 tbsp balsamic vinegar", "100g/3½oz feta ", "2 free-range eggs", "200ml/7fl oz double cream ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease 4 x 10cm/4in loose-bottomed tartlet tins with a little butter.", "Rub the butter and lard into the flour in a large bowl until it resembles fine breadcrumbs. Add 2–3 tablespoons of cold water and use your hands to bring it into a rough dough (do not kneed). Split the pastry into 4 pieces and roll each quarter into a circle slightly larger than the tin. Carefully line the tins with the pastry. Refrigerate for 10–20 minutes or until needed.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Put the oil in a large frying pan over a medium heat and add the onions. Cook for 10 minutes.  Add the sugar, vinegar and season with salt and pepper. Cover and cook on a low heat for 20–30 minutes, until really soft and sticky. Set aside. ", "Meanwhile, line the chilled pastry cases with greaseproof paper and add ceramic baking beans or rice, and bake for 12–15. Remove the paper and beans and bake for a further 5 minutes, until lightly golden. Set aside to cool slightly. ", "Reduce the oven temperature to 160C/140C Fan/Gas 3.", "Divide the onion and feta between the tins. Mix the eggs and cream together and season well with salt and pepper. Pour the egg equally into each tin and cook in the oven for 30 minutes, or until the egg mixture is cooked and golden-brown.  ", "Cool the tartlets in their tins and then remove carefully. Serve."]}, {"isVegetarian": false, "title": "Caramelised onion, goats' cheese and Parma ham pizza", "url": "www_bbc_co_uk_food_recipes_caramelised_onion_goats_96877", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_onion_goats_96877_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "1 tsp fast action dried yeast", "1 small garlic clove, crushed", "½ tsp salt", "1 tbsp olive oil", "1 tbsp olive oil, plus extra for drizzling", "2 onions, thinly sliced", "1 tbsp light brown muscovado sugar", "1 tbsp balsamic vinegar", "200ml/7fl oz passata, seasoned with salt and pepper", "8 slices Parma ham", "200g/7oz soft goats’ cheese", "basil leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough, put the flour, yeast, garlic and salt into a bowl. Add 150–175ml/5–6fl oz water and stir with a wooden spoon until combined and a soft dough is formed. Tip out onto a floured surface and knead for 10 minutes until a smooth dough is formed.  ", "Oil a large, clean bowl, add the dough and cover with cling film. Put in a warm place and leave to prove for about 1–1½ hours or until doubled in size.", "Meanwhile, for the topping, heat the oil in a lidded frying pan over a medium heat. Add the onions and fry for a few minutes until they are beginning to soften. Cover and simmer for 15 minutes until soft. Add the sugar and vinegar, turn up the heat and stir for a few minutes until golden. Set aside to cool.", "Preheat the oven 240C/220 Fan/Gas 8. Preheat a large baking tray in the oven.", "Tip the proven dough out onto a floured work surface and knead into a ball to lightly knock back. Using your fingers or knuckles, push the dough to about a 30cm/12in circle, with slightly thicker edges to form the crust.  ", "Put the base onto baking paper. Spread the passata on top of the dough, scatter with the cooked onions, scrunch up the Parma ham, place on top and finish with dollops of goats’ cheese. Slide onto the preheated tray and bake for 12–15 minutes, or until golden and the dough is cooked.", "Garnish with basil leaves, drizzle witha little olive oil and serve with dressed salad leaves."]}, {"isVegetarian": true, "title": "Caramelised red onion and goats’ cheese swirls", "url": "www_bbc_co_uk_food_recipes_caramelised_red_onion_99976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_red_onion_99976_16x9.jpg", "ingredients": ["125g/4½oz strong white flour, plus extra for dusting", "125g/4½oz cold unsalted butter", "oil, for frying", "2 large red onions (or 3 small), thinly sliced", "flaky sea salt, to taste ", "3-4 tbsp dark brown sugar ", "1-2 tsp grainy mustard", "2 tsp beer vinegar (alternatively use red wine vinegar) ", "1 cucumber", "1 tsp flaky sea salt", "1 tbsp caster sugar", "4 tbsp white wine vinegar", "1 wheel of goats’ cheese (not too soft)", "few sprigs fresh rosemary, torn into small pieces, to garnish"], "serves": "Makes 12 canapés", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the flour and 5 tablespoons cold water in a freestanding mixer and knead with a dough hook. Alternatively knead by hand until the dough comes together. Add another tablespoon water if necessary. Knead until smooth then set aside to rest.", "Place the butter between two pieces of baking paper. Hit it with a rolling pin to flatten, then roll out into a large square and place in the freezer. ", "On a lightly floured work surface, roll out the dough as thin and large as you can. Rest for 5 minutes in the fridge, then roll into a rectangle twice the size of the flattened butter.", "Take the butter out of the paper and put on the dough. Bring the corners of the dough together to encase the butter. Roll out the pastry envelope on a floured surface to make a rectangle that is approximately three times longer than it is wide. Fold one third into the middle and then the other third on top. Seal the edges lightly using a rolling pin. Turn the dough 90 degrees, roll out and fold over again. Place the dough in the fridge while you make the caramelised onions. ", "For the caramelised onion, gently fry the onions over a low heat until soft. Add the salt, sugar, mustard and vinegar and cook until very soft. Set aside to cool.", "Remove the pastry from the fridge and roll out and fold as before. Return to the fridge while you make the pickled cucumber.", "For the pickled cucumber, peel half the cucumber and chop into 1cm/½in cubes. Toss these in salt and leave for 20 minutes. Squeeze the cubes and mix with the sugar and vinegar. Chop the remaining cucumber into cubes and set aside. ", "Remove the pastry from the fridge and roll out and fold one final time. Chill for 10 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4. Line a large baking tray with baking paper.", "Roll the pastry into a large rectangle and spread with the cooled red onion mixture, reserving a little to serve. Roll up the pastry (like a Swiss roll) starting at a long side and keeping the roll as tight as possible. Slice into 1½–2cm/½–¾in-thick swirls. ", "Transfer to the baking tray, leaving room for the swirls to expand a little. Bake for 25–35 minutes until the pastry is risen and golden-brown. ", "Meanwhile, slice the goats’ cheese wheel into quarters, then slice the quarters into 5mm-thick slices. Place on a heatproof surface and use a chef’s blowtorch to lightly char them. ", "To serve, scoop half a teaspoon of the red onion mixture on top of each swirl. Top with a cube of raw and pickled cucumber, before leaning the goats’ cheese on top. Garnish with small sprigs of rosemary."]}, {"isVegetarian": false, "title": "Caramelised scallops, shrimps and grits with pork jowl bacon", "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_15929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped", "1 tbsp olive oil", "50g/1¾oz unsalted butter", "2 garlic cloves, finely chopped", "2 tsp turmeric powder", "600ml/20fl oz vegetable stock", "200g/7oz grits", "200ml/7fl oz double cream", "salt", "4 tbsp olive oil", "2 raw prawns, shells on", "100g/3½oz butter", "1 lemon, juice only", "2 leaves of Chinese cabbage cut into medium size squares", "4 scallops, hand-dived", "100g/3½oz hominy, from a can, drained", "4 small pieces of cooked crispy pork jowl or streaky bacon", "2 breakfast radish, sliced thinly lengthwise and kept in ice cold water", "white pepper", "fresh or dried oregano, borage flowers and forage herbs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the grits, fry the onion in the oil over a low-medium heat until softened but not browned. Add the butter and garlic and fry for 2-3 minutes. Add the turmeric and fry for 1 minute. Add the stock and grits and simmer, stirring continuously, for 30-40 minutes.", "When the grits are almost cooked, bring the cream and a pinch of salt to the boil in a heavy-based saucepan. Pour on to the cooked grits, stir well, then remove from heat. Cover and leave to rest.", "For the scallops, heat a little oil in a saucepan over a high heat. Cook the prawns for 2 minutes, then turn over, add a little butter and a squeeze of lemon juice and cook for 1-2 minutes more. Peel off the shells.", "Toast the Chinese cabbage on a very hot, dry grill or frying pan until the edges are charred and leaf slightly wilted.", "Remove the scallops from their shells and discard the roes. Season with salt and white pepper.", "Heat a little oil in a pan over a high heat. Fry the scallops for 2-3 minutes. Turn them over, add a knob of butter and a squeeze of lemon juice to the pan, then cook for 2 minutes more.", "To serve, spread the cooked grits on two plates. Scatter over the hominy, cooked scallops, prawns, charred cabbage, crispy pork jowl and radishes. Garnish with the herbs and flowers."]}, {"isVegetarian": false, "title": "Caramelised scallops with Ibérico ham and butternut squash purée", "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_94303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, peeled and roughly chopped", "1 butternut squash, peeled and roughly chopped", "75ml-100ml/2½-3½fl oz chicken stock", "50ml-75ml/2- 2½fl oz double cream", "12 scallops, cleaned", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "knob of butter", "4 slices of Ibérico ham", "50g/1¾oz whole almonds, toasted and roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the squash purée, heat the oil and butter in a large pan and gently fry the onion for a few minutes until softened.  Add the butternut squash and roast in the pan for five minutes. Pour in the chicken stock and simmer gently for a further 10–12 minutes until tender. Pour in the double cream and season well to taste. ", "In a food processor, blend the squash until smooth and then pass through a sieve into a clean pan (ready to warm gently just before serving). ", "For the scallops, season them with salt and pepper. Heat the olive oil in a non-stick frying pan and, once hot, fry the scallops for 1–1½ minutes on each side, until caramelised. Towards the end of cooking add a knob of butter and baste the scallops until golden-brown.", "To serve, spoon the butternut squash purée into the centre of each plate. Top with the pan-fried scallops and arrange the Ibérico ham slices among them. Scatter over the chopped almonds to finish. "]}, {"isVegetarian": false, "title": "Caramelised scallops on cauliflower purée with pancetta", "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_on_73214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_scallops_on_73214_16x9.jpg", "ingredients": ["2 tsp butter", "3 tbsp dried breadcrumbs ", "25g/1oz butter ", "1 small head cauliflower (about 750g/1lb 10oz before trimming), cut into small florets ", "200ml/7fl oz full-fat milk", "100ml/3½fl oz single cream", "½ bunch chives (about 10g)", "25ml/1fl oz extra virgin olive oil", "2 tsp sunflower oil (if necessary)", "6 slices pancetta ", "12 large scallops, shelled and coral removed", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the brown butter breadcrumbs, put the butter in a large, non-stick frying pan over a medium heat and cook until it starts to turn golden-brown. Add the breadcrumbs and, keeping them moving in the pan, cook for 1-2 minutes, or until crisp and golden-brown. Tip onto a plate lined with kitchen towel and set aside. Wipe the pan out with kitchen towel and set aside.", "For the cauliflower purée, melt the butter in a large pan over a low to medium heat and add the cauliflower florets. Allow to cook for 2-3 minutes, stirring regularly until they are just beginning to colour. ", "Add the milk and cream, season well with salt and bring to the boil. Cover with a lid and simmer gently for 8-12 minutes, depending on their size, or until the cauliflower is really soft.", "While the cauliflower is cooking, make the chive oil. Reserve eight chive sticks for serving and then put the remaining chives in a small, wide bowl and pour over enough boiling water (from the kettle) to cover. Leave for 20 seconds. ", "Drain and run the chives under the cold tap for 20 seconds or so to refresh and stop them from cooking. This will ensure they stay nice and bright green rather than turning an icky brown. Drain well, squeeze them dry and pop into a mini-blender (or tall jug if using a stick blender). Add the oil and a little salt and blitz for 1-2 minutes, or until the chives are chopped as small as they will go.", "For the pancetta, return the pan used for the breadcrumbs to a medium to high heat and add a little oil. Add the pancetta slices in a single layer and fry for two minutes each side until crisp and golden-brown. Remove from the heat and transfer the pancetta to a plate lined with kitchen towel to drain. If the pan has become quite dirty from frying the pancetta, then drain off the residual fat and wipe it out with kitchen paper. Otherwise, leave the fat in the pan and set aside.", "Once the cauliflower is cooked, drain it really well, transfer it to a blender and blend until really smooth. Season to taste with some salt and pepper. Set aside, keeping it warm.", "Return the frying pan to a high heat. If you have had to drain off the pancetta fat, add more oil. Otherwise you should have enough fat there to cook the scallops. Pat the scallops dry with kitchen paper and season on both sides with salt and pepper. Add the scallops to the pan and cook them, without moving them, for about two minutes. ", "Meanwhile, to keep you from moving the scallops, prepare four warm plates for serving. Spoon three dollops of the hot cauliflower purée in a straight line across the centre of each plate. Spoon drops or a squiggle of the chive oil over or around to decorate. Sprinkle over the breadcrumbs. ", "The scallops should now be really nice and brown on their bottoms. Flip them over and cook for a further two minutes. Place each one on top of each spoonful of the purée. Snap each piece of pancetta in half and place a piece resting against each of the scallops. Trim the reserved chives and place two pieces on top of, or leaning against, the middle scallop on each plate and serve."]}, {"isVegetarian": false, "title": "Caramelised, slow-cooked lamb with green vegetables", "url": "www_bbc_co_uk_food_recipes_caramelised_slow_cooked_87172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp ground cumin ", "1 tbsp ground ginger", "1 tsp chilli ﬂakes ", "½ tbsp garam masala ", "½ tbsp ground cinnamon", "1 lamb shoulder on the bone (about 1.8kg/4lb) ", "2 bulbs garlic, split into cloves", "2 onions, quartered ", "20g/¾oz fresh rosemary ", "25g/1oz light brown sugar ", "200ml/7fl oz sunﬂower oil ", "50ml/2fl oz white wine vinegar ", "1 tsp Dijon mustard ", "2 heads Little Gem lettuce ", "50g/1¾oz baby spinach ", "200g/7oz trimmed ﬁne green beans, trimmed", "200g/7oz mangetout ", "50g/1¾oz watercress "], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mix all the spices together and rub all over the lamb. Marinate in the fridge overnight so the lamb takes on all the ﬂavour of the spices.", "The next day, take the lamb out of the fridge and allow to return to room temperature. Preheat the oven to 180C/160C Fan/ Gas 4. ", "Put the garlic, onions and rosemary in a roasting tin. Place the lamb on top and roast for 2-2½ hours.", "When the meat is cooked through and very tender, remove from the oven, cover with aluminium foil and leave to rest for 10-15 minutes. ", "For the vegetables, whisk together the sunﬂower oil, vinegar and mustard to create a vinaigrette. ", "Separate the leaves of the Little Gem lettuce and put in a bowl with the baby spinach. ", "Bring a saucepan of salted water to the boil. Add the green beans. After 2 minutes add the mangetout and boil for a further minute.", "Drain the vegetables and immediately add to the bowl containing the spinach and lettuce. Add the watercress and toss gently in the vinaigrette just before serving.", "Once the meat is rested, sprinkle the fat side of the lamb with the brown sugar and, using a chef’s blow torch (or under a very hot grill), caramelise the sugar and the fat.", "Serve the lamb with the vegetables."]}, {"isVegetarian": true, "title": "Brioche with caramelised apples and almond brittle", "url": "www_bbc_co_uk_food_recipes_caramelisedappleanda_87364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 apple, peeled, cored and cut into wedges", "2 tbsp clear honey", "200g/7oz caster sugar", "100g/3½oz almonds, roughly chopped", "2 slices brioche, griddled", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the caramelised apples, melt the butter in a frying pan, add the apples and honey and sauté until golden-brown. ", "For the brittle, place the sugar into a frying pan and leave to melt over a low heat, shaking the pan from time to time, but not stirring. When all the sugar has dissolved and the liquid turns golden-brown, add the almonds and then pour onto a non-stick mat. Leave to cool and then break up into pieces.", "To serve, place the griddled brioche onto a serving plate and top with the caramelised apples and almond brittle. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Caramelised apples with duck egg sabayon", "url": "www_bbc_co_uk_food_recipes_caramelisedappleswit_86835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter ", "2 tbsp caster sugar", "3 apples, cored, quartered", "½ lemon, juice and zest", "1 tsp vanilla extract", "1 slice white crusty bread", "icing sugar, to dust", "2 duck egg yolks", "2 tbsp caster sugar", "1 tbsp cognac", "2 tbsp water", "vanilla ice cream, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the caramelised apples, place 70g/2½oz butter and all the sugar into a frying pan and heat gently until melted together and combined. ", "Add the apples and a squeeze of lemon juice, vanilla and lemon zest and cook gently for five minutes, or until the apples are beginning to turn golden. Set aside and keep warm.", "Melt the remaining 15g/½oz of butter in a clean small frying pan, add the slice of bread and fry for two minutes on each side. Dust with icing sugar and fry for another minute on each side.", "For the sabayon, place the egg yolks, caster sugar, brandy and water into a small heatproof bowl that fits snugly over a pan of gently simmering water. Whisk continuously until thickened. Add more water if the mixture is too thick. It should be the consistency of double cream.", "To serve, place the sugared toast onto the base of a plate and pile the apples on top. Spoon on a dollop of ice cream and pour over the sabayon."]}, {"isVegetarian": true, "title": "Caramelised apricot and sultana tarte tatin", "url": "www_bbc_co_uk_food_recipes_caramelisedapricotan_87073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp caster sugar", "30g/1oz butter", "4 apricots, halved, stones removed", "2 tbsp sultanas", "flour, for dusting", "100g/3½oz ready-made puff pastry", "85g/3oz caster sugar", "50g/2oz whole almonds", "4 scoops vanilla ice cream, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the tarte tatin, heat the sugar in a small ovenproof frying pan over a low heat until melted.", "Add the butter and heat until the mixture is caramel coloured.", "Add the apricot halves cut-side up, scatter with the sultanas and cook gently for 2-3 minutes, or until softened.", "Roll the pastry out on a lightly floured surface to the thickness of a one pound coin.", "Cut out a circle of pastry the same size as the circumference of the frying pan. Place the pastry on top of the apricots and press down around the edges to seal in the filling.", "Transfer to the oven and bake for 12-15 minutes, or until the pastry is golden-brown on top. Remove from the oven and leave to cool slightly.", "Slide a palette knife around the edge of the tart, then carefully turn out onto a serving plate.", "For the almond brittle, place the sugar into a non-stick frying pan and heat gently. When the sugar has melted and is beginning to turn a caramel colour, add the almonds and stir well to coat them all.", "Pour onto a non-stick mat or baking sheet and leave to cool. When cool, break into pieces.", "To serve, cut the tarte tatin into generous wedges and place onto serving plates with a scoop of ice cream and a sprinkling of almond brittle."]}, {"isVegetarian": true, "title": "Caramelised balsamic beetroot", "url": "www_bbc_co_uk_food_recipes_caramelisedbalsamicb_85192", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 ready-cooked beetroot, quartered", "2 tbsp balsamic vinegar", "1 tsp cumin seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat and cook the beetroot for 2-3 minutes.", "Add the balsamic vinegar and cumin seeds, turn up the heat and cook for 3-4 minutes, or until the vinegar has reduced by half and the beetroot is caramelised and sticky.", "To serve, place the caramelised beetroot onto a plate."]}, {"isVegetarian": true, "title": "Caramelised bananas", "url": "www_bbc_co_uk_food_recipes_caramelisedbananas_76757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz caster sugar", "½ tsp vanilla essence", "1-2 tbsp hot water", "2 bananas, peeled and sliced", "knob of butter", "double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sugar, vanilla essence and water in a pan, until it forms a caramel. ", "Add the banana slices to the pan, shaking to coat. ", "Add the butter to the pan and heat for another 1-2 minutes.", "Transfer the caramelised bananas to a serving plate, and drizzle with cream to serve."]}, {"isVegetarian": true, "title": "Caramelised apple with brandy sauce", "url": "www_bbc_co_uk_food_recipes_caramelisedbrandywit_84166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp brown sugar", "½ Bramley apple, core removed", "½ miniature bottle brandy", "50ml/2fl oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sugar in a frying pan until melted and bubbling, then add the apple, cut-side down.", "Allow the sugar to begin to caramelise, then add the brandy and cream, stirring a little to coat the apple. ", "Boil the sauce for 2-3 minutes, or until thickened, then remove from the heat. ", "To serve, place the apple cut-side down on a plate and pour over the brandy sauce."]}, {"isVegetarian": true, "title": "Caramelised chestnut cheesecake", "url": "www_bbc_co_uk_food_recipes_caramelisedchestnutc_84940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "100g/3½oz vacuum-packed chestnuts", "pinch salt", "200ml/7¼fl oz double cream", "150g/5½oz cream cheese", "1 orange, peeled and finely chopped", "butter, for greasing", "pinch chilli powder", "pinch black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the caster sugar into a frying pan and cook over a medium heat until the sugar has turned a golden-brown  colour, shaking the pan to help the sugar dissolve. ", "Add the chestnuts to the pan and stir the mixture to coat the chestnuts in caramelised sugar. ", "Pour the chestnuts onto a non-stick silicon mat and leave to cool.", "In a large bowl, mix together the double cream, cream cheese and chopped orange. ", "Grease two 6cm/2½in chefs' rings with butter and place them on a serving plate. Spoon the cream mixture into the chefs' rings.", "Use a blowtorch to heat the outside of the chefs' rings; this will help release the cheesecake - you'll be able to slide each one off the chefs' rings easily. ", "Top with the caramelised chestnuts and sprinkle with chilli powder and a grinding of black pepper. ", "Serve straightaway or store in the fridge until you are ready to serve."]}, {"isVegetarian": true, "title": "Caramelised butternut squash tart with pine nut pastry and chive yoghurt", "url": "www_bbc_co_uk_food_recipes_caramelisedbutternut_87223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp brown sugar", "55g/2oz butter", "150g/5½oz butternut squash, peeled and roughly chopped", "100g/3½oz pine nuts, crushed", "100g/3½oz plain flour, plus extra for dusting", "85g/3oz cold butter, cut into cubes", "1 free-range egg, beaten", "splash milk", "2 tbsp Greek-style yoghurt", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/250F/Gas 4.", "For the caramelised butternut squash, place the sugar into a small ovenproof frying pan and heat gently until melted and caramel-coloured. Add the butter and stir to combine.", "Add the butternut squash pieces, stir well and cook gently for 3-4 minutes, until softened.", "For the pastry, place the crushed pine nuts, plain flour and cold butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the beaten egg and a splash of milk if the mixture is still too dry and blend to combine.", "Turn the dough out onto a floured surface and roll out to the thickness of a pound coin.", "Place the pastry over the cooked butternut squash in the pan, pressing down around the edges to enclose the filling and trimming off any excess pastry.", "Transfer to the oven and bake for 12-14 minutes, or until golden-brown.", "Remove the tart from the oven and allow to cool slightly. Slide a knife around the edges of the frying pan and turn the tart out onto a serving plate.", "To serve, mix the yoghurt and chives together in a bowl and place a dollop of chive yoghurt on top of the tart."]}, {"isVegetarian": false, "title": "Caramelised lamb with a vegetable medley", "url": "www_bbc_co_uk_food_recipes_caramelisedlambwitha_72111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb chump steak", "2 tbsp olive oil", "1 tbsp plain flour", "3-4 tbsp red wine", "2 tbsp brown sugar", "oil for deep-frying", "½ sweet potato", "2 sprigs rosemary", "2 cloves garlic", "bunch baby carrots", "handful of mangetout", "3-4 tbsp olive oil", "3 baby courgettes", "2-3 tbsp milk", "55g/2 oz plain flour", "1 egg, lightly beaten"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the deep fat fryer to 190C/375F/Gas 5 or fill a large pan a third full with vegetable oil. To test if the oil is at the correct temperature, drop a small cube of bread in the oil. If it sizzles and turns golden, the oil is ready to use. (CAUTION: hot oil is very dangerous. Do not leave unattended.) ", "Cut the lamb steak into strips.", "Sear the lamb in the olive oil for one minute.", "Add the flour and fry for one minute.", "Add the wine and simmer for one minute.", "Add the sugar and simmer for two minutes.", "Peel the sweet potato and boil in one piece until tender.", "Slice into 1.5cm/¾in thick slices.", "Season and sauté with the rosemary and garlic for five to six minutes until golden.", "Wash and trim the carrots and mangetout.", "Drizzle in olive oil and griddle for two to three minutes until just tender.", "To make the deep-fried courgesttes, cut the courgettes in half lengthways.", "Stir the milk and egg into the flour to make a batter.", "Dip the courgette into the batter and deep-fry for two to three minutes until golden.", "Serve with the sauce from the lamb."]}, {"isVegetarian": true, "title": "Caramelised chicory", "url": "www_bbc_co_uk_food_recipes_caramelisedchicory_85616", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter ", "4 heads chicory, trimmed and halved lengthways", "2 tsp clear honey", "½ large orange, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Rub half the butter thickly over the bottom of an ovenproof dish, then pack the chicory halves, in a single layer, into the dish. Drizzle over the honey and orange juice and season with salt and freshly ground black pepper. Dot with the remaining butter.", "Transfer to the oven and roast, uncovered, for about an hour, turning and basting the chicory every 15 minutes. Keep a close eye on proceedings towards the end of the cooking time and take the dish out of the oven when the juices have reduced to a few spoonfuls of thick syrup and the chicory is looking suitably caramelised. Serve warm."]}, {"isVegetarian": true, "title": "Caramelised mango wedges", "url": "www_bbc_co_uk_food_recipes_caramelisedmangowedg_92733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp icing sugar", "½ mango, skin on, stone removed, sliced into wedges lengthways"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the icing sugar onto a plate and dredge the cut sides of the mango in the sugar until coated. ", "Using a chefs' blow torch, heat the sugar-coated mango wedges until golden-brown and caramelised . (Alternatively, preheat the grill to its highest setting and heat the mango wedges for 2-3 minutes, or until golden-brown.) Serve immediately."]}, {"isVegetarian": true, "title": "Caramelised mango tart with Chantilly cream", "url": "www_bbc_co_uk_food_recipes_caramelisedmangotart_86915", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "100g/3½oz butter", "1 free-range egg", "30g/1oz butter", "30g/1oz caster sugar", "½ mango, peeled and sliced", "150ml/¼ pint double cream", "2 tbsp icing sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the flour and butter in a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg and pulse again until the mixture comes together to form a soft but not sticky dough.", "Roll the dough out on a lightly floured surface to 0.5cm/¼in thick and trim the edges.", "Place the dough onto a baking sheet dusted with flour and bake in the oven for 8-10 minutes, or until crisp and golden-brown.", "For the mango, heat the butter and sugar together in a small non-stick frying pan until the sugar melts.", "Add the mango and cook for 2-3 minutes, or until the mango is well coated and caramelised.", "For the Chantilly cream, whip the cream and icing sugar together in a bowl until the cream forms soft peaks when the whisk is removed.", "To assemble the tart, arrange the mango in overlapping slices on top of the cooked pastry and drizzle over any pan juices.", "To serve, cut the tart into wedges and serve with a dollop of Chantilly cream."]}, {"isVegetarian": true, "title": "Caramelised onion and mustard tart", "url": "www_bbc_co_uk_food_recipes_caramelisedonionandm_85435", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz flour, plus extra for dusting", "100g/3½oz butter", "25g/1oz sugar", "1 free-range egg", "dash milk, optional, to help bind the pastry", "50g/2oz butter", "1 tbsp vegetable oil", "4 large Spanish onions, sliced", "1 clove garlic, crushed ", "salt and freshly ground black pepper", "2 free-range eggs", "2 free-range egg yolks", "50g/2oz wholegrain mustard", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "150g/5oz borlotti beans from a can, rinsed and drained", "150g/5oz butterbeans from a can, rinsed and drained ", "150g/5oz broad beans from a can, rinsed and drained ", "150g/5oz cannellini beans from a can, rinsed and drained ", "1 tbsp chopped fresh mint", "2 tsp Dijon mustard", "1 lemon, juice only", "1 tbsp white wine vinegar", "salt and freshly ground black pepper", "100ml/3½fl oz extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, butter, sugar and egg into a food processor and pulse until just coming together as a dough (add a little milk if necessary to bring the dough together).", "Bring the dough together into a ball, wrap in cling film and place into the fridge to chill for at least an hour.", "Unwrap and roll out the pastry onto a floured work surface to fit a 20cm/8in tart case. Press the pastry into the case and place into the fridge to chill for 45 minutes.", "Preheat the oven to 200F/400F/Gas 6.", "Place the chilled tart case into the oven to bake for 10-15 minutes, until golden-brown. Remove from the oven and leave to cool.", "Reduce the oven temperature to 180C/355F/Gas 4.", "Meanwhile, for the filling, heat the butter and oil together in a large, heavy-bottomed saucepan over a low heat.", "Add the onions and garlic and season well with salt and freshly ground black pepper. Cook the onions very gently for about 30-40 minutes until very soft and golden, but not browned.", "Whisk together the eggs, egg yolks, mustard and cream in a clean bowl.", "Add the slow-cooked onions to the egg mixture, then spoon the mixture into the cooked tart case. Transfer to the oven to bake for 20-25 minutes, or until the filling is set and golden-brown.", "For the bean salad, place all of the beans and the chopped mint into a large clean bowl and mix to combine.", "For the dressing, place the mustard, lemon juice and white wine vinegar into a clean bowl. Season, to taste, with salt and freshly ground black pepper and slowly pour in the oil, whisking constantly.", "Pour the dressing over the bean mixture and mix well.", "To serve, cut out four wedges of warm onion tart and place onto plates. Place a spoonful of bean salad alongside each."]}, {"isVegetarian": true, "title": "Caramelised oranges with amaretti and cream", "url": "www_bbc_co_uk_food_recipes_caramelisedorangeswi_86870", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "2 tbsp brown sugar", "1 orange, peel and pith removed, sliced into rounds", "½ miniature bottle of brandy", "2 tbsp amaretti biscuits, crushed", "1 tbsp grated dark chocolate", "fresh mint sprig, to garnish", "double cream, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and sugar together in a small frying pan until the sugar has dissolved.", "Add the sliced oranges and cook for 2-3 minutes, until they are coated and caramelised.", "Add the brandy and carefully allow to flame. ", "When the flames have died out, remove from the heat and arrange the orange slices around a shallow serving dish.", "Pour the sauce from the frying pan over the oranges.", "Sprinkle over the crushed biscuits, grated chocolate and garnish with a sprig of mint.  ", "To serve, drizzle over some double cream."]}, {"isVegetarian": true, "title": "Caramelised oranges with honeyed ricotta", "url": "www_bbc_co_uk_food_recipes_caramelisedorangeswi_90379", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelisedorangeswi_90379_16x9.jpg", "ingredients": ["6-8 large oranges", "250g/9oz white caster sugar or granulated sugar", "200ml/7fl oz hot water", "400g/14oz ricotta", "1 tbsp runny honey", "icing sugar (optional)", "50g/2oz flaked almonds, lightly toasted on a baking sheet in a moderate oven for ten minutes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pare the zest from two oranges and cut into very fine shreds (or use a zester). Set aside.", "Peel all the oranges by cutting the skin and white pith away, to reveal the naked orange flesh.", "Using a small, very sharp knife, cut the first segment out of the orange, sliding the knife down between its fine papery skin and its flesh on either side, then easing it out. Carry on working your way around the orange, cutting out the segments.", "Put the segments and any juice from the oranges into a shallow serving bowl. Repeat the process with the remaining oranges until all are segmented.", "Heat a small pan of water until boiling. When boiling, drop the orange zest into the water, simmer for two minutes then drain well through a sieve into a small bowl. Set aside.", "Heat a wide, heavy-based pan (preferably one with a pale-coloured bottom) over a moderate heat. Add the sugar and leave for a few minutes, keeping a careful eye over it, until the sugar begins to melt. Don't stir. Restrain yourself and do no more than tip and tilt the pan to get the sugar to melt evenly.", "Once the sugar is liquid, let it bubble gently, then more strongly, until it begins to brown (this may take as little as 2-3 minutes), still tilting and swirling the pan occasionally.", "Once the sugar has caramelised to a hazelnut brown, pour the measured hot water into the pan. Do this at arm's length, wearing an oven glove. Be very careful, as the caramel will spit and hiss when you first add the water.", "Swirl and stir the caramel syrup and turn the heat to low. Drop in the blanched shreds of orange zest and leave to simmer for 5-10 minutes, until the zest is translucent. You may need to add a bit more water if the caramel thickens too much.", "Pour the hot syrup and shreds over the orange segments and leave to cool.", "Meanwhile, make the honeyed ricotta. In a clean bowl, beat the ricotta with the honey, then taste. If you'd like it sweeter add either a little icing sugar, if the honey has a strong flavour, or a little more honey if it's mild. Fold two-thirds of the almonds into the mixture and scatter the rest on top.", "Serve the caramelised oranges with the honeyed ricotta on the side."]}, {"isVegetarian": true, "title": "Caramelised peaches with toast and cream", "url": "www_bbc_co_uk_food_recipes_caramelisedpeacheswi_90485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "3 tbsp brown sugar", "4 canned peach halves, drained", "2 tbsp double cream", "2 free-range eggs", "150ml/5fl oz double cream", "2 tbsp caster sugar", "1 thick slice white bread", "2 tbsp double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the peaches, melt the butter and sugar in a frying pan and add the peach halves. Cook for 4-5 minutes, turning once, or until the peaches are caramelised. Remove the peaches from the pan, then stir in the cream to make a butterscotch sauce. ", "For the toast, whisk together the eggs, cream and sugar until smooth and creamy and soak the slice of bread in the mixture. Place the bread onto a baking tray and bake in the oven for 6-7 minutes, or until golden-brown and crisp. ", "Serve the peach halves on top of the toast, with the butterscotch sauce spooned over the top and a drizzle of cream."]}]