[{"ingredients": ["250ml / 9fl oz de vinagre de vino blanco", "75g / 2¾oz de azúcar en polvo (opcional)", "3 dientes de ajo, en rodajas finas", "2 cucharaditas de cilantro molido", "2 cucharaditas de comino molido", "1 cucharadita de cúrcuma molida", "12 granos de pimienta blancos enteros", "1 hoja de laurel", "2 cebollas rojas, muy finamente cortadas", "Filetes de salmón 6 x 100 g / 3½ oz, sin piel", "1 calabacín, cortado en bastones", "100 g / 3½ oz de habas frescas, fuera de sus vainas", "100g / 3½oz de mantequilla fresca en frijoles, fuera de sus vainas", "100g / 3½oz de tomates cherry, cortados por la mitad", "pequeño puñado de berros mostaza, para servir"], "method": ["Llevar el vinagre de vino blanco, el azúcar, el ajo, las especias, los granos de pimienta, laurel y la cebolla a ebullición en una sartén grande no reactiva. Reduzca el fuego a fuego lento y cocine a fuego lento la mezcla durante 4-5 minutos.", "Retire la sartén del fuego, luego agregue los filetes de salmón y los bastones de calabacín y revuelva para cubrirlos en la mezcla de marinado. Dejar de lado hasta que esté completamente frío. Cubra la sartén y enfríe en la nevera durante 1½-2 horas.", "Cuando el salmón en escabeche se haya enfriado y marinado, mezcle las habas, los frijoles y las mitades de tomate cherry en un bol. Vierta un poco del líquido de adobo frío, al gusto, y mezcle bien para combinar.", "Para servir, divida la mezcla de frijoles y tomate por igual entre seis platos para servir. Coloque un filete de salmón en escabeche encima de cada uno. Cuchara sobre algunas de las piezas marinadas de cebolla, ajo y calabacín. Rocíe un poco del líquido de adobo restante alrededor del borde de cada plato. Espolvorea sobre el berro de mostaza."], "url": "www_bbc_co_uk_food_recipes_pickledsalmonwithgre_91478", "title": "Salmón encurtido con verduras", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de sal de roca", "2 litros / 3½ pinta de agua", "1.35kg / 3lb chalotes, pelados y recortados", "Vinagre de vino blanco de 2 litros / 3½ pinta", "1 cucharada de bayas de pimienta, bayas de enebro, pimienta negra y semillas de mostaza", "2 hojas de laurel", "170g / 6oz de azúcar mascabado ligero", "frascos esterilizados grandes con tapa roscada - prepare los frascos lavándolos en agua jabonosa caliente y déjelos secar y calentar en un horno frío - 130 ºC / 250 F / Gas ½ por 10 a 15 minutos."], "method": ["Pon la sal y el agua en una olla grande, disuelve a fuego lento y luego deja que la salmuera se enfríe.", "Coloque los chalotes preparados en la salmuera, baje el peso con un plato y déjelos en un lugar fresco durante 24 horas.", "Al día siguiente, coloque el vinagre y todas las especias y el azúcar en una cacerola, deje que hierva y deje que se infunda y se enfríe.", "Escurre las chalotas y cuidadosamente empacar en los frascos. Vierta sobre el vinagre infundido y las especias. Cubra los frascos con una tapa de rosca y déjelos en un lugar fresco y oscuro durante 3-4 semanas antes de comer."], "url": "www_bbc_co_uk_food_recipes_pickledshallots_13699", "title": "Chalotes en escabeche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace tarros de 2x450g / 1 lb", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 600g / 1lb 5oz", "300g / 10½oz de mantequilla sin sal, a temperatura ambiente pero no suave", "sal", "½ cucharadita de polvo de hornear", "50ml / 2fl oz de leche, para cepillar", "1 huevo de gallinas camperas, batido, para esmaltar", "2 cucharadas de aceite de girasol", "2 cebollas rojas medianas, picadas", "2 dientes de ajo, en clavos de olor enteros, piel sobre, ligeramente triturada bajo tenedor", "3 pimientos rojos Romano, picados", "1 gran calabacín, picado", "1 berenjena, picada en cubos de 1cm / ½ en cubitos", "sal y pimienta negra recién molida", "100g / 3½oz de cuscús", "90g / 3¼oz de pasta de tomate secada al sol", "Halloumi 250 g / 9 oz", "Mozzarella 100 g / 3½ oz, rallado", "pequeño racimo de orégano fresco", "pequeño manojo de albahaca fresca", "100 g / 3½ oz de azúcar en polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, frote la mantequilla en la harina con las manos hasta que se asemeje a migas de pan finas. Agregue 150ml / 5fl oz de agua y junte la mezcla para formar una masa (tenga cuidado de no trabajar en exceso). Envuelva la masa en una película adhesiva y déjela reposar en la nevera mientras prepara el relleno.", "Para las verduras asadas, engrase ligeramente una bandeja de asar con aceite de girasol y coloque las cebollas, el ajo, los pimientos, el calabacín y la berenjena en la bandeja. Mezcle para cubrir las verduras en aceite.", "Asar durante 30-40 minutos, o hasta que las verduras estén tiernas. Sazonar con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Para el relleno, ponga el cuscús en un recipiente y agregue suficiente agua hirviendo para cubrirlo. Cubra el recipiente y déjelo reposar de 5 a 10 minutos.", "Cuando el agua haya sido absorbida, use una licuadora de mano para mezclar la mitad del cuscús con la pasta de tomate secada al sol. Combine con el cuscús sin mezclar. Sazone con sal y pimienta y reserve en la nevera.", "Cortar el halloumi, secar con papel de cocina y freír hasta que aparezcan manchas marrones. Dale la vuelta y fríe el otro lado de la misma manera. Deja enfriar.", "Para hacer la canasta de repostería, divida la masa de hojaldre en cuatro porciones: 350 g / 12oz para la caja, 300 g / 10½oz para la canasta de celosía, 150 g / 5½ oz para la tapa de celosía y 100 g / 3½ oz para la manija y otros extras.", "Estirar la masa de hojaldre para el enrejado a aproximadamente 3 mm de grosor, manteniendo fría la masa (devuélvala a la nevera durante cinco minutos para enfriarla si es necesario).", "Corta cinco tiras de 2cm / 1 de ancho. Las tiras deben ser lo suficientemente largas como para pasar por un lado de la lata, a lo largo del ancho de la base y por el otro lado del estaño, dejando un pequeño voladizo a cada lado. Las tiras serán de aproximadamente 25-30 cm / 10-12 pulgadas de largo (dependiendo del tamaño de la lata).", "Coloque las tiras dentro de la lata, espaciando las tiras uniformemente a lo largo de la lata.", "Corta cuatro tiras también de 2 cm / 1 pulgada de ancho y la misma longitud que la lata (dos tiras para cada lado largo de la lata). Coloque una tira al ras con la base de estaño y la otra aproximadamente dos tercios del camino hacia arriba. Teje las tiras en una de las tiras verticales para hacer un enrejado. Cuando las tiras se superponen, cepille con un poco de agua o leche y presione en su lugar.", "Congele la lata con el enrejado dentro.", "Mientras tanto, despliegue la masa para la caja en un rectángulo lo suficientemente grande como para forrar la base y los lados de la lata. Transfiera la masa de hojaldre al refrigerador para descansar.", "Haga un enrejado rectangular para la tapa del cesto, cortando largas tiras de masa y entretejiéndolas (lo mejor es hacerlo en una bandeja para hornear forrada con papel antigrasa). Deje espacios pequeños entre las filas para que haya agujeros en la tapa donde pueda escapar cualquier vapor durante la cocción. Descanse la masa en la nevera.", "Haga una manija de la cesta y dos hebillas de la masa restante (puede moldear la manija sobre un trozo de papel de aluminio arrugado). Transfiera a la nevera para descansar.", "Cepille el interior de la rejilla congelada con leche y colóquelo con la caja de pastelería enrollada, presionando ligeramente para pegar la caja al enrejado. Descanse en la nevera durante 15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire los dientes de ajo de los vegetales tostados y desechados.", "Para llenar el pastel, coloque la mitad del cuscús en la parte inferior (esto absorberá cualquier líquido) y empáquelo firmemente presionándolo hacia abajo. Coloque las verduras, el halloumi y la mozzarella rallada en la parte superior. Espolvorea sobre el orégano y la albahaca. Cubra con el cuscús restante, otra vez presionando hacia abajo. Asegúrese de que todas las capas estén bien compactas.", "Cepille los bordes de la masa con leche, luego deslice la tapa de celosía en su lugar desde el papel resistente a la grasa. Presione los bordes para sellar. Cepille la parte superior del pastel con huevo batido.", "Hornea por 50 minutos.", "Hornee las hebillas de los pasteles, las bisagras y las manijas por separado durante 10-15 minutos hacia el final del tiempo de cocción del pastel.", "Retire la tarta de la lata y cepille los lados con huevo batido. Regrésalo al horno y hornea por otros tres minutos. Sacar del horno y dejar enfriar.", "Para el caramelo, derrita el azúcar en una sartén con un par de cucharadas de agua. No te muevas Deje que alcance un color dorado claro.", "Sumerja los extremos del mango y las hebillas en el caramelo y péguelas en el pastel (precaución: el azúcar derretido está muy caliente. Tenga cuidado de no quemarse). Manténgalo en su lugar mientras se pone el caramelo."], "url": "www_bbc_co_uk_food_recipes_picnic_basket_pie_50454", "title": "Pastel de picnic", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pan redondo grande de pan (mazorca rústico)", "2 cucharadas de aceite de oliva", "2 hojas de ensalada", "4 rebanadas de queso cheddar maduro", "4 rebanadas de salami", "4 rebanadas de jamón", "pequeña albahaca fresca puñado, rallado", "400g / 14oz de tomates cherry, descuartizados"], "method": ["Corta el pan en tres rebanadas horizontales del mismo ancho.", "Pon la porción superior a un lado. Cepille los otros dos pedazos de pan con un poco del aceite.", "Cubra cada rebanada de pan engrasado con un puñado de hojas de ensalada, el cheddar, el salami y el jamón. Espolvoree sobre la albahaca y los tomates y sazone con pimienta negra recién molida.", "Vuelve a colocar el pan colocando las dos rebanadas de pan cubiertas una encima de la otra. Vuelva a poner la pieza superior como una tapa. Envuelva el pan con fuerza en una película adhesiva.", "Ponga el pan en la nevera, cubra con un plato grande y coloque un par de latas encima para pesarlo. Enfríe por 1-2 horas.", "Para servir, corta el pan en trozos."], "url": "www_bbc_co_uk_food_recipes_picnic_loaf_86630", "title": "Pan de picnic", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal, más algunas para engrasar", "Harina normal de 50g / 2oz", "1 cucharadita de polvo de hornear", "1 cucharada de azúcar morena oscura", "½ cucharadita de jengibre molido", "40 g / 1½ oz de avena", "4 cucharadas de leche", "5 cucharadas de oro jarabe"], "method": ["Antes de cocinar, lávese las manos y colóquese un delantal. Pesar o medir todos los ingredientes. Cepille un poco de aceite dentro de una lata de hogaza de 500 g y colóquelo en una bandeja para hornear. Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la harina en un tazón limpio con el polvo de hornear, azúcar y jengibre.", "Coloque la avena y la leche juntas en otro recipiente y déjelas a un lado durante 5-10 minutos para que la avena absorba la leche y la ablande.", "Revuelva el aceite y el jarabe dorado en la avena y la leche. Si mide primero el aceite, el sirope dorado se deslizará de la cuchara más fácilmente.", "Revuelva la mezcla de harina en la mezcla de leche oaty hasta que todos los ingredientes estén bien mezclados.", "Vierta la mezcla en la lata de pan engrasada. Coloque la lata en una bandeja para hornear y hornee durante 25-30 minutos. Dejar enfriar y servir en rodajas con un vaso de leche."], "url": "www_bbc_co_uk_food_recipes_picnic_parkin_46362", "title": "Picnic parkin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Formas de pasta de 300 g / 10½ oz como penne o macarrones", "250g / 9oz de tomates cherry, cortados a la mitad", "sal marina", "100g / 3½oz de aceitunas negras, apedreado, reducido a la mitad", "200g / 7oz de queso feta, desmenuzado", "225 g / 7 oz espinaca bebé", "3 cucharadas de aceite de oliva con limón", "2 cucharadas de piñones, tostados", "gran puñado de albahaca rasgada"], "method": ["Cocine la pasta en una olla grande de agua hirviendo con sal hasta que esté al dente. Escurra la pasta, enjuague con agua fría y hágalo en un tazón grande.", "Agregue los tomates partidos a la mitad a la pasta y espolvoree con sal marina. Agregue las aceitunas, el queso feta y las espinacas y rocíe con el aceite de oliva de limón. Agregue los piñones y la albahaca y mezcle suavemente antes de servir."], "url": "www_bbc_co_uk_food_recipes_picnic_pasta_salad_47257", "title": "Ensalada de pasta de picnic", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picnic_pasta_salad_47257_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pan de granja blanco crujiente rancio", "2 yemas de huevo grandes de gallinas camperas", "1 cucharadita colmada de mostaza Dijon", "¼ cucharadita de azúcar en polvo", "1½ cucharada de vinagre de vino blanco o jugo de limón", "200ml / 7fl oz de aceite de girasol", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas", "verduras variadas (como rábanos, zanahorias pequeñas, tomates cherry, palitos de apio y", "pepino), lavado, cortado y cortado en porras"], "method": ["Rebane la parte superior del pan y reserve. Coloque el pan en posición vertical sobre una superficie de trabajo y realice incisiones profundas en la miga, dejando un borde de pan de 2,5 cm en los bordes. Ahueca el pan con las manos (la miga se puede usar en otra receta).", "Para la mayonesa, mezcle las yemas de huevo, la mostaza, el azúcar y el vinagre de vino blanco o el jugo de limón en un procesador de alimentos hasta que quede suave. Poco a poco agregue el aceite de girasol en una corriente delgada, batiendo continuamente hasta que la mezcla esté suave y bien combinada y se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la mayonesa en un pequeño recipiente de mermelada esterilizado y ajústelo bien. Coloque la jarra dentro de la barra de pan ahuecada. Agregue los huevos duros y los bastoncillos de verduras. Enrolla pellizcos de sal y pimienta negra recién molida en sobres individuales de papel de aluminio y agrégalos al molde ahuecado. Cubra el pan con la rebanada de pan superior reservada, o 'tapa'. Envuelva en papel de aluminio o asegúrelo con una cuerda y llévelo consigo en su picnic."], "url": "www_bbc_co_uk_food_recipes_picniccruditeloaf_91686", "title": "Pan de crudite de picnic", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picniccruditeloaf_91686_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de sal de mesa", "2 litros / 3½ pintas de agua", "Florecillas de coliflor de 300g / 11oz", "Cebollas de bebé 225g / 8oz, peladas", "225g / 8oz de pepino, sin semillas, cortadas en trozos grandes", "2 cucharaditas de alcaparras, enjuagadas y escurridas", "60 g / 2½ oz de mantequilla", "4 cucharadas de harina", "200ml / 7fl oz de vinagre de malta", "200ml / 7fl oz de vinagre de vino blanco", "50 g / 2 oz de azúcar en polvo", "2 cucharaditas de cúrcuma molida", "1¼ cucharadita de polvo de mostaza", "pimienta negra recién molida", "1 kg / 2,2 libras de gammon crudo", "1 cebolla, cortada en cuartos", "4 dientes", "2 hojas de laurel", "2 ramitas de tomillo fresco", "2 ramitas de perejil fresco de hoja plana", "4 anchoas en conserva, escurridas", "1 limón, ralladura solamente", "1 diente de ajo, pelado", "4 cucharadas de crema doble", "75ml / 3fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "250g / 8¾oz de queso cheddar maduro", "4 pasteles de cerdo confeccionados", "1 coliflor, cortada en florecillas", "1 manojo de zanahorias baby, lavadas y recortadas", "200g / 7oz de tomates cherry maduros"], "method": ["Para los piccalilli, disuelve la sal en el agua en un tazón grande. Agregue la coliflor y las cebollas y mezcle bien para mezclar, asegurándose de que estén completamente sumergidos en el agua. Cubra y coloque en la nevera durante 24 horas.", "Cuando esté listo para cocinar los piccalilli, retire el tazón del refrigerador y drene el agua salada. Enjuague bien las verduras.", "Coloque la coliflor, la cebolla, el pepino y las alcaparras en una sartén y cúbralas con agua fresca. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante diez minutos. Escurrir una vez más y dejar las verduras a un lado.", "Mientras tanto, caliente una sartén y cocine la mantequilla y la harina durante 2-3 minutos, revolviendo con frecuencia.", "Agregue lentamente los dos vinagres, revolviendo constantemente, y cocínelos suavemente durante 2-3 minutos, o hasta que espesen. Agregue el azúcar, la cúrcuma y la mostaza en polvo y sazone con pimienta negra recién molida.", "Vierta la mezcla de mostaza sobre las verduras y revuelva para combinar, asegurándose de que todas las verduras estén cubiertas en la salsa.", "Vierta en frascos y sello esterilizados. Deje en la nevera durante al menos cinco días antes de comer para que las verduras puedan absorber todos los sabores. El pepinillo se puede guardar en la nevera por hasta dos semanas.", "Para el jamón, coloque el jamón en una sartén grande con tapa y cúbralo con agua fría. Stud la cebolla con los clavos de olor y agregar al agua con las hojas de laurel, el tomillo y el perejil. Haga hervir el agua rápidamente, baje el fuego, tape la olla y cocine a fuego lento durante dos horas.", "Cuando el jamón esté cocido, retire la sartén del fuego y deje que el jamón se enfríe en el líquido de cocción. Cuando esté frío, retíralo del líquido de cocción, corta el exceso de grasa y corta.", "Para la salsa de anchoa, coloque las anchoas, la ralladura de limón, el ajo y la crema en una licuadora y mezcle hasta que quede suave. Poco a poco agregue el aceite de oliva hasta que la salsa se espese y se emulsione. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva los piccalilli con el jamón rebanado, queso cheddar y pastel de cerdo, las verduras crudas y la salsa de anchoa."], "url": "www_bbc_co_uk_food_recipes_picnicofpiccalilliha_86566", "title": "Picnic de piccalilli, jamón, dip de anchoa y pasteles de carne de cerdo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla salada, ablandada", "175g / 6oz de mantequilla sin sal ablandada", "Azúcar en polvo 350g / 12oz", "6 huevos de gallinas camperas, ligeramente golpeados", "Harina de auto crianza 350 g / 12 oz, tamizada", "2 limones no encerados, solo ralladura", "2 cucharaditas de polvo de hornear", "175g / 6oz de mantequilla salada, ablandada", "175g / 6oz de azúcar en polvo", "3 huevos medianos de granja, ligeramente golpeados", "Harina de 175g / 6oz de auto crianza", "½ cucharadita de polvo de hornear", "colorante alimentario en color amarillo huevo, rosa / carne y negro", "125g / 4½oz de mantequilla sin sal, ablandada", "125g / 4½oz de mantequilla salada, suavizada", "350g / 12oz de azúcar glasé", "1 limón, ralladura y jugo", "algunas gotas de colorante negro", "Paquete de 1 x 500 g de glaseado de fondant listo para enrollar", "150g / 5oz de azúcar glasé", "algunas gotas de colorante de comida azul", "1 o 2 paquetes de pasta de modelar, de color crema", "1 paquete de 250 g de pasta de azúcar, color crema", "pasta de azúcar coloreada, negra y amarilla"], "method": ["Para las tortas de bizcocho de limón, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre las bases de cuatro moldes para pasteles de 23 cm / 9 pulg. En un tazón grande, bata las mantequillas con el azúcar hasta que estén pálidas y esponjosas. Poco a poco agregue los huevos, batiendo bien después de cada adición. Mezcle un poco de harina y la ralladura de limón. Tamizar la harina restante y el polvo de hornear y doblar en la mezcla de mantequilla con una cuchara de metal. Divida la mezcla entre las cuatro latas y suavemente alise la superficie. Hornee por 20-25 minutos, o hasta que el pincho salga limpio, luego póngalo a un lado para que se enfríe en los bastidores de alambre.", "Para las esponjas pequeñas y de color, engrase tres moldes para pasteles pequeños (las latas redondas de 8 cm / 3 pulg. Son ideales). En un tazón grande, bata la mantequilla con el azúcar. Poco a poco agregue los huevos, batiendo bien después de cada adición y luego mezcle un poco de harina. Tamizar la harina restante y el polvo de hornear y doblar en la mezcla de mantequilla con una cuchara de metal. Divida la mezcla en tres cuencos y agregue el colorante negro de alimentos a uno, el amarillo a otro y el color rosa / carne a la tercera. Vierta las mezclas en las latas preparadas y hornee durante 15-20 minutos, o hasta que la brocheta salga limpia. Enfriar en latas en una rejilla de alambre.", "Para la crema de mantequilla, bata la mantequilla hasta que esté suave, luego agregue el azúcar glas por tandas hasta que esté completamente incorporada. Mezcle la ralladura de limón y el jugo. Transfiera una cucharada de crema de mantequilla a un recipiente aparte y mezcle el colorante negro para alimentos unas gotas a la vez hasta que la crema de mantequilla se haya puesto de un color negro uniforme.", "Cuando las esponjas pequeñas de color estén completamente frías, tome la esponja amarilla y córtela en forma de pico abierto de aproximadamente 5 cm de largo. Use la torta rosada para hacer una forma de nariz que pueda sentarse dentro del 'pico' abierto.", "Para armar el pastel, coloque tres pasteles de esponja de limón junto con crema de mantequilla. Para crear una cavidad para el \"pico\" y la \"nariz\" en la que sentarse, marque el centro del pastel y recorte una forma cónica de cilindro. Inserte la \"nariz\" rosa y el \"pico\" amarillo (use una pequeña cantidad de crema de mantequilla para fijar en su lugar y rellene los huecos).", "Extienda la crema de mantequilla sobre la parte superior de la torta y agregue la capa final de la torta. Para formar la cavidad de la cabeza del mirlo, marque el centro del pastel y dibuje un círculo de 10 cm alrededor de él. Raspe una cúpula que sea lo suficientemente profunda como para alcanzar la siguiente capa de pastel (para que la cabeza del mirlo se siente inmediatamente en la parte superior del pico). Recorta el domo del mismo tamaño de la torta negra e inserta en la cavidad en forma de domo.", "Para decorar, corte el borde de la capa de torta inferior un poco para crear un efecto de \"plato circular\". Corta y da forma a la parte superior de la tarta para que se parezca a la parte superior de una tarta (no es necesario que sea perfecta en esta etapa, ya que estará cubierta con glaseado de fondant más adelante). Cubra todo el pastel con una capa de crema de mantequilla.", "Para congelar el pastel, primero coloca el fondant blanco en una tira lo suficientemente grande como para envolver el borde del pastel y formar la base del plato para pastel. Corte para ajustar y aplicar en una tira. Asegure los extremos cepillándolos con agua para que se peguen. Mezcle el azúcar glas con agua para hacer una pasta y agregue gotas de colorante azul hasta que el glaseado sea de color azul oscuro. Pipe grupos de tres puntos alrededor del plato de pastel para crear un efecto de cerámica azul y blanco.", "Estirar el glaseado fondant de color crema lo suficientemente grande como para hacer una \"tapa de pastelería\". Tome una de las latas para pasteles usadas para la esponja de limón y úsela como guía para cortar un círculo en la crema de glaseado de fondant. Aplique en la parte superior de la torta y engarce el borde para que se asemeje a una superficie de repostería. Corta una cruz en la parte superior del pastel y gira las esquinas", "Para las decoraciones, use el fondant de color negro y amarillo para hacer algunas cabezas pequeñas de mirlo y siéntelas dentro de la cruz de la \"tapa de pastelería\"."], "url": "www_bbc_co_uk_food_recipes_pie-shaped_hidden_design_24020", "title": "Tarta de diseño escondido en forma de pastel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8-12 tomates ciruela maduros", "4 pimientos rojos, tallos restantes (para decoración), cortados longitudinalmente por la mitad, sin semillas", "4 dientes de ajo, en rodajas", "5-6 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "8 anchoas en conserva grandes, cortadas a la mitad", "pequeño puñado de albahaca fresca"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Vierta agua hirviendo sobre los tomates de ciruela, déjelos durante 10 segundos, retire con cuidado del agua y revuelva en un recipiente con agua fría. Despegue las pieles de tomate.", "Coloque los pimientos a la mitad en un plato resistente al horno (preferiblemente uno que sea lo suficientemente bueno como para presentarlo más adelante), con el lado cortado hacia arriba.", "Coloque el ajo dentro de los pimientos y luego coloque los tomates dentro, empujándolos suavemente hacia el espacio. Agregue una pizca de sal y una molienda de pimienta negra recién molida. Cuchara sobre el aceite de oliva y luego coloque en el horno. Hornee durante aproximadamente 45 minutos a una hora, baje la temperatura un poco si nota un chamuscado excesivo de los pimientos.", "Una vez que estén bien suavizados y se hayan derrumbado un poco, retire los pimientos del horno. Entrecruzar cada mitad de pimienta con una anchoa, rociar con los jugos de aceite y dejar enfriar a temperatura ambiente.", "Cubra con hojas de albahaca y sirva."], "url": "www_bbc_co_uk_food_recipes_piedmontese_peppers_40938", "title": "Pimientos piamonteses", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piedmontese_peppers_40938_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más extra para engrasar", "1 cebolla, finamente picada", "3 ramitas de tomillo fresco, solo hojas, finamente picadas", "350 g / 12 oz de carne magra picada", "1 cucharadita de mostaza en polvo", "80ml / 3fl oz de caldo de carne", "sal y pimienta negra recién molida", "500 g / 1 libra de hojaldre listo para el uso de 2 oz", "2 huevos de gallinas camperas, golpeados"], "method": ["Precalentar el horno a 230C / 445F / Gas 8.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva, la cebolla y el tomillo y freír, durante 2-3 minutos, hasta que las cebollas estén doradas y suavizadas.", "Coloque la carne picada en un tazón con el polvo de mostaza y caldo de carne. Agregue la mezcla de cebolla frita y sazone bien con sal y pimienta negra recién molida. Mezcle bien para combinar.", "Estire la masa de hojaldre sobre una superficie limpia y enharinada de 5 mm / ¼ de grosor y corte cuatro círculos de 15 cm de diámetro.", "Coloque una cucharada de la mezcla de carne picada en el centro de cada círculo de repostería. Cepille el borde exterior de cada círculo de repostería con los huevos batidos. Dobla la masa por la mitad, para crear una forma pastosa y unir los bordes para sellar.", "Cepille la masa con los huevos batidos y sazone con sal y pimienta negra recién molida.", "Coloque en una bandeja para hornear ligeramente engrasada y coloque en el horno para hornear durante 15 minutos.", "Reduzca el calor del horno a 180 ° C / 385 ° F / Gas 4 y cocine por 45 minutos, o hasta que esté dorado y completamente cocido.", "Estos pasteles se pueden servir calientes, calientes o fríos."], "url": "www_bbc_co_uk_food_recipes_piesbridie_84423", "title": "Pasteles de Bridie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 paloma pichón", "1 cucharada de aceite de oliva", "225 g / 8oz de hojaldre listo para usar", "1 huevo de gallinas camperas, batido para lavar huevos", "1 cucharada de aceite de oliva", "1 zanahoria, picada", "1 cebolla pequeña, picada", "pocos tallos de perejil", "200ml / 7fl oz de caldo de pollo", "200ml / 7fl oz puerto", "200ml / 7fl oz de vino tinto", "50g / 1¾oz de carne de salchicha", "1 cucharadita de orégano", "1 cucharadita de estragón", "1 cucharadita de hojas de tomillo recogidas", "10 pistachos, sin cáscara y picados", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "100g / 3½ oz chalotes, pelados", "caldo de pollo, para cubrir", "algunas ramitas de tomillo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Retire los senos, las patas, las alas y los menudos de la paloma. Retire la carne de las piernas y los muslos y picar junto con las menudencias para usar para el relleno.", "Para la salsa, caliente el aceite de oliva en una sartén grande. Agregue los huesos de paloma junto con los tallos de zanahoria, cebolla y perejil. Cuando esté dorado, agregue el caldo, el puerto y el vino tinto. Regrese a ebullición y luego reduzca a fuego lento. Continúe cocinando hasta que el líquido se reduzca a una salsa pegajosa.", "En una sartén, caliente un poco de aceite de oliva y dore los pechos de las palomas, con la piel hacia abajo, hasta que la piel esté dorada. Sáquelo del fuego y apártelo.", "Luego haga el relleno, mezcle la carne de salchicha con las hierbas, pistachos, pierna de paloma y muslos y menudencias. Sazone al gusto con sal y pimienta negra recién molida. Sandwich el relleno entre los senos de paloma chamuscada. Dejar de lado.", "Mientras tanto, para los chalotes glaseados, derrita la mantequilla en una sartén pequeña a prueba de horno. Agregue las chalotas y fría hasta que comiencen a caramelizar. Cubra con caldo de pollo, agregue las ramitas de tomillo y sazone con sal y pimienta. Cubra con un círculo de papel a prueba de grasa y cocine en el horno durante 30 minutos, o hasta que estén tiernos.", "Estire la masa al grosor de una moneda de una libra y lo suficientemente grande como para envolver a la paloma; es posible que no lo necesite todo. Envuelva el paquete de squab en la masa y selle los bordes. Coloque en una bandeja para hornear y cepille con un lavado de huevos. Transfiera al horno por 30 minutos, o hasta que la pasta esté dorada.", "Cuando los chalotes estén cocidos, quítelos del líquido de cocción y déjelos a un lado. Agregue la salsa reducida a la charola y caliente de nuevo para reducirla. Regrese los chalotes cocidos a la sartén y caliente.", "Cuando esté cocido, retire el paquete de pichón del horno y déjelo reposar durante unos minutos.", "Sirva el Wellington en rodajas con los chalotes glaseados."], "url": "www_bbc_co_uk_food_recipes_pigeon_wellington_with_25328", "title": "Pigeon Wellington con chalotes glaseados", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 palomas pichones, limpiadas, con hígados", "40 g / 1½ oz de mantequilla clarificada, más extra para servir", "1 kg / 2 libras 3 oz harina blanca fuerte, más extra para quitar el polvo", "Sal de mesa fina 600g / 1lb 5oz", "9 claras de huevo de gallinas camperas", "300ml / 10½fl oz de agua", "8 dientes", "2 yemas de huevo de gallinas camperas", "1 cucharada de leche", "pizca de azúcar en polvo", "1 puñado de sal de roca", "20g / 1oz de mantequilla sin sal", "4 chalotes, finamente picados", "Setas de botón 100g / 3½, finamente cortadas", "1 cucharada de aceite de oliva", "palos y alas de pichón de paloma reservados (ver arriba)", "4 cucharadas de vino seco de Madeira", "100ml / 3½fl oz de caldo de pollo marrón", "sal y pimienta negra recién molida", "2 coles puntiagudas, descuartizadas", "30 g / 1½ oz de mantequilla sin sal", "½ chalote de plátano o ¼ de cebolla, pelado, picado", "1 diente de ajo, pelado, puré", "400g / 14oz de setas silvestres mezcladas (cordero, rebozuelo y trompeta de la muerte)", "100 ml / 3½ fl oz de vino blanco seco", "Hojas de perejil fresco de hojas planas de 10g / ½oz, aproximadamente picadas", "15ml / 1fl oz de jugo de limón", "4 pizca de sal marina", "4 pizca de pimienta negra recién molida", "Equipo especial: cadena de cocina, batidora eléctrica con un gancho de masa"], "method": ["Para las palomas pichones, chamusque cualquier pluma o rastrojo restante haciendo girar las palomas sobre una llama abierta (use pinzas resistentes al calor para hacer esto). Corta los huesos y las alas del cuello (recortando tan cerca del pecho como sea posible) y reserva para hacer la salsa. Retire los frenos para facilitar el tallado.", "Caliente la mantequilla clarificada en una sartén y cocine las palomas por 2-3 minutos por todos lados, o hasta que se doren por todas partes. Dejar de lado. No necesita sazonar las aves en esta etapa, ya que la masa de la corteza de sal sazonará la carne mientras se cocina.", "Para la masa de sal pastelería, combine la harina, la sal, las claras de huevo y el agua en una batidora eléctrica equipada con un gancho de masa. Mezcle a baja velocidad durante 1-2 minutos, luego raspe los lados con una espátula. Vuelva a encender la batidora y mezcle durante 5-7 minutos más, o hasta que la masa comience a desprenderse de los lados del bol.", "Amasar ligeramente con las manos, luego divida la masa en cuatro partes iguales y envuélvala por separado en una película adhesiva. Enfriar en la nevera durante 20 minutos.", "Después de 20 minutos, retire la masa de la nevera. En una superficie de trabajo enharinada, enrolle cada pieza de masa con un grosor de 5 mm y un diámetro de aproximadamente 28 cm. Con un cuchillo pequeño, corte un círculo de cada pieza de masa que mide 23 cm de diámetro y déjelo a un lado.", "Reúna todos los recortes de repostería y extiéndalos en una hoja de 5 mm de grosor. Recorta ocho piezas de paloma en forma de ala y ponlas a un lado en papel pergamino.", "Enrolle los recortes de pastelería y divídalos en 4 pedazos iguales. Moldea cada pieza en una cabeza redonda de pichón, pellizcando un extremo para formar un \"pico\". Presiona 2 clavos en cada \"cabeza\" para los ojos, luego ponlos a un lado en papel pergamino.", "Coloque una paloma, con la pechuga hacia abajo, en el medio de cada círculo de masa y levante los bordes para envolver completamente a la paloma. Pellizque los bordes para sellar, asegurándose de que no haya espacios.", "En un tazón pequeño, bata juntas las yemas de huevo, la leche y el azúcar impalpable para el lavado de huevos. Cepille las 'alas' de los pasteles con algo de la lava de huevo y coloque 2 a los lados de cada paloma envuelta. Cepille la base de las cabezas de los pasteles y presione firmemente sobre la paloma envuelta.", "Cepille las palomas completas con el resto de la lavativa, excepto las bases. Espolvorea sal de roca sobre el pecho, coloca las palomas en una bandeja para hornear forrada con papel de aluminio y enfría en la nevera hasta que esté lista para hornear.", "Para la salsa, derrita la mantequilla en una sartén hasta que forme espuma y fríela suavemente durante 2-3 minutos, o hasta que esté blanda pero no coloreada. Agregue los champiñones durante el último minuto de cocción.", "Mientras tanto, caliente el aceite de oliva en una sartén por separado y cocine los pabellones y las alas de las palomas durante 3-4 minutos, hasta que se doren por todas partes. Agregue el Madeira a la sartén, raspando cualquier trozo dorado del fondo de la sartén para desglasar, luego agregue el contenido de la sartén a los chalotes y champiñones y el caldo de pollo marrón, llevar a ebullición y cocine a fuego lento durante 10 minutos", "Cuele a través de un fino tamiz cónico, presionando hacia abajo con un cucharón para extraer el mayor sabor posible. Sazonar, al gusto, con sal y pimienta negra recién molida. Vuelva a calentar la salsa para pedir y sirva en un barco de salsa justo antes de servir.", "Precalentar el horno a 220C / 425F / Gas 7.", "Hornee las palomas en el horno durante 20-22 minutos (para el medio, cocínelas durante 18 minutos para las de tamaño medio o 12 minutos para las menos frecuentes). Retire del horno y deje reposar durante 5 minutos. La masa de la corteza de sal no es solo para efectos visuales, sino que también mejora enormemente el sabor y la textura; los jugos y el sabor están sellados y la lenta acumulación de calor mantiene la carne húmeda y tierna.", "Para la guarnición, ponga a hervir un recipiente con agua y coloque un recipiente de vapor sobre la parte superior. Agregue el repollo al vaporizador y cocine al vapor durante 2-3 minutos, o hasta que esté tierno. Corta el repollo en tiras y colócalo en un tazón pequeño.", "Calentar la mantequilla en una sartén a fuego medio hasta hacer espuma, luego freír los chalotes y el ajo durante 30 segundos. Aumente el fuego a alto, luego agregue el pied de mouton y cocine por un minuto. Agregue el vino blanco y cocine durante un minuto, luego agregue los girolles y cocine por un minuto más. Agregue los trompettes de la mort y las hierbas y revuelva bien, luego exprima el jugo de limón y sazone, al gusto, con sal y pimienta negra recién molida. Cuchara en un tazón pequeño.", "Presente las palomas cocidas al horno, cepilladas con mantequilla derretida, sobre una gran tabla de servir con los tazones de col y los champiñones a cada lado. Para servir, primero quite la \"cabeza\" de los pasteles, luego corte la costra de sal para revelar la paloma. Coloque una horquilla larga dentro de la paloma y levántela sobre la tabla de tallado, dejando atrás la corteza. Cortar el hilo de truss y servir la paloma en un plato, lo que permite a los huéspedes a sí mismos a la salsa, el repollo y los acompañamientos fricassee de setas."], "url": "www_bbc_co_uk_food_recipes_pigeonsbakedinasaltp_93491", "title": "Las palomas al horno en una corteza de sal pastelería con col y hongos fricassée", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 rebanadas finas de tocino rayado", "16 salchichas de chipolata", "palitos de cóctel, para asegurar el tocino"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el tocino en una tabla de cortar, luego use el lado del cuchillo, estire y aplaste el tocino hasta aproximadamente la mitad del largo de nuevo.", "Corte cada tira de tocino por la mitad, luego envuelva cada pieza alrededor de una chipolata, asegurando con palitos de cóctel.", "Coloque en una bandeja para asar y tueste durante 15 minutos hasta que estén dorados y cocidos."], "url": "www_bbc_co_uk_food_recipes_pigs_in_blankets_63316", "title": "Cerdos en mantas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pigs_in_blankets_63316_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 chile rojo, finamente picado", "¼ cucharadita de cúrcuma molida", "sal y pimienta negra recién molida", "300g / 10½oz de arroz basmati", "600ml / 1 pinta de caldo de verduras", "85g / 3oz de guisantes frescos, fuera de sus vainas", "25g / 1oz de mantequilla", "25 g / 1 oz de raíz fresca de jengibre"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite de oliva en una sartén, agregar la cebolla y el chile y freír durante 1-2 minutos, o hasta que se ablanden. Agregue la cúrcuma molida, la sal y la pimienta negra recién molida y fría por otro minuto.", "Con una cuchara mezcle la cebolla y el chile en un plato hondo para horno, agregue el arroz, vierta sobre el caldo y revuelva bien. Cubra con papel de aluminio y colóquelo en el horno para hornear por diez minutos, o hasta que toda el agua haya sido absorbida por el arroz y el arroz esté tierno.", "Escalde los guisantes en una sartén de agua hirviendo con sal durante 2-3 minutos, luego escurra y agregue al arroz junto con la mantequilla. Revuelva hasta que la mantequilla se derrita y la mezcla esté bien combinada.", "Rallar la raíz de jengibre en una toalla de té limpia y luego exprimir el jugo de jengibre en el arroz. Deseche la carne de jengibre. Revuelva bien.", "Para servir, cuchara el pilaf en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_pilafwithgingerchill_89131", "title": "Pilaf con jengibre, guindilla y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["sal pizca generosa", "2 cucharadas de granos de pimienta negra, aplastados", "250ml / 8¼fl oz de vinagre de vino blanco", "2 palitos de canela", "1 cabeza de cerdo (disponible de buenos carniceros), pelos quemados usando soplete de cocineros", "1 lengua de buey (disponible en buenos carniceros)", "2 hojas de laurel", "4 palitos de canela", "Anís de 4 estrellas", "sal pizca generosa", "1-2 cucharadas de granos de pimienta negra, aplastados", "150 g / 5¼ oz de azúcar en polvo", "250ml / 8¼fl oz de vinagre de vino blanco", "400g / 14¼ oz de harina común", "½ cucharadita de sal", "4 huevos de gallinas camperas, golpeados", "1-2 cucharadas de aceite de oliva", "1 cebolla roja pequeña, pelada, finamente picada", "pequeño puñado de perejil o albahaca, rallado", "1 huevo de gallinas camperas, batido, para lavar huevos", "1 cebolla, pelada, en rodajas", "1 pimiento rojo, sin semillas, en rodajas", "1 pimiento amarillo, sin semillas, en rodajas", "2 dientes de ajo, pelados, aplastados", "6 berenjenas", "1 cucharada de aceite de oliva", "½ cucharadita de semillas de comino", "½ cucharadita de hojas secas de tomillo", "6 tomates maduros, cortados en cubitos", "1 camote, pelado, cortado en cubitos", "1 coliflor pequeña, cortada en pequeños floretes", "½ repollo verde, rallado", "1 cucharada de albahaca fresca finamente picada", "6 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino blanco", "1- 2 cucharaditas de mostaza Dijon", "1 diente de ajo, pelado y aplastado", "sal y pimienta negra recién molida", "2 orejas de cerdo cocidas (de la cabeza, ver arriba), finamente trituradas", "harina común, para quitar el polvo", "sal y pimienta negra recién molida", "aceite vegetal, para freír"], "method": ["Para la salmuera, coloca la sal, la pimienta, el vinagre de vino blanco y los palitos de canela en una olla grande de agua fría (usa una sartén que sea lo suficientemente profunda como para cubrir la cabeza del cerdo).", "Para la cabeza y los despojos de cerdo, agregue la cabeza de cerdo a la salmuera y déjela a un lado durante dos horas para remojarla.", "Retire la cabeza de cerdo de la salmuera y transfiera a una olla nueva de agua hirviendo. Agregue la lengua de buey, las hojas de laurel, los palitos de canela, el anís estrellado, la sal, los granos de pimienta, el azúcar y el vinagre de vino blanco y vuelva a hervir. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante seis horas, o hasta que la carne de la cabeza apenas comience a caer del hueso.", "Retire la cabeza del cerdo y la lengua de buey de la sartén y deje a un lado para que se enfríe. Cuando la lengua del buey esté lo suficientemente fría como para manipularla, quítela y déjela a un lado para que se enfríe por completo. Una vez frío, triture finamente la lengua del buey.", "Una vez que la cabeza del cerdo se haya enfriado, recoja toda la carne de ella, descartando la grasa.", "Retire las orejas del cerdo y corte finamente la carne. Reserve para usar como guarnición.", "Para los ravioles, incline la harina sobre una superficie limpia (o en un recipiente grande) y agregue la sal. Batir los huevos y el aceite.", "Haga un pozo en el centro de la harina y agregue la mezcla batida de huevo y aceite en una corriente fina, mezclando más de la harina en los ingredientes húmedos a medida que los agrega hasta que la mezcla se una como masa. (Puede que no necesite agregar todos los huevos y la mezcla de aceite de oliva).", "Amasar la masa de pasta durante 10 minutos, o hasta que quede suave y elástica. Envuelva con film transparente y deje enfriar en la nevera durante al menos 30 minutos.", "Ponga la masa de pasta fría en una superficie de trabajo ligeramente enharinada. Harina los rodillos en su máquina de pasta.", "Ruede la pasta usando la máquina de pasta. Comience configurando la máquina en su ajuste más amplio (generalmente el número más bajo) y pase la pasta a través de los rodillos, cada vez ajustando la máquina a su configuración más amplia siguiente, hasta que haya alcanzado el grosor requerido.", "Para el relleno de ravioles, mezcle la lengua de buey triturada con la carne de la cabeza de cerdo (excepto las orejas). Mezcle el perejil picado (o albahaca) y la cebolla hasta que estén bien combinados, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Corta rondas de 10 cm / 4 pulgadas de la masa de pasta enrollada con un cortador de hojaldre. Coloque una cucharada de la mezcla de relleno en el centro de la mitad de las rondas de pasta. Cepille los bordes con un lavado de huevo, luego coloque una de las rondas de pasta vacías en la parte superior, presionando los bordes para sellar a fondo y expulsar las burbujas de aire.", "Repita el proceso con los ravioles restantes y la mezcla de relleno restante. Espolvoree los ravioles con harina y separe las capas de ravioles con papel pergamino para evitar que se peguen, luego enfríe en la nevera hasta que sea necesario.", "Para la peperonata, caliente dos cucharadas de aceite de oliva en una sartén a fuego medio. Agregue la cebolla, los pimientos rojos y amarillos y el ajo, luego condimente, al gusto, con sal y pimienta negra recién molida y cocínelos durante 18-20 minutos, o hasta que se ablanden. Mantener caliente", "Para el puré de berenjena, usando pinzas, sostenga cada berenjena directamente sobre un quemador de gas, girando hasta que la piel tenga ampollas y la berenjena esté suave al tacto. (Alternativamente, coloque las berenjenas debajo de una parrilla caliente, volteándolas de vez en cuando.) Póngalas a un lado para que se enfríen un poco, luego despegue la piel. Corta bastante la carne. Repita el proceso con las berenjenas restantes.", "Caliente una cucharada de aceite de oliva en una sartén a fuego medio. Agregue las semillas de comino y el tomillo y fría por un minuto, o hasta que estén fragantes.", "Agregue los tomates picados y continúe cocinando por 6-8 minutos más.", "Agregue la pulpa de berenjena picada. Sazonar, al gusto, con sal y pimienta negra recién molida y continuar cocinando por otros 5-6 minutos.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave. Regrese la mezcla a la sartén por unos minutos más y cocine a fuego medio hasta que se haya secado. Apartar y mantener caliente.", "Para las verduras a la Grècque, hierva la batata en una sartén con agua con sal durante 6-8 minutos, o hasta que esté tierna. Retire de la sartén con una cuchara ranurada y transfiera a un tazón.", "Agregue las flores de coliflor a la sartén y cocínelas durante 6-8 minutos hasta que estén tiernas. Retire de la sartén con una espumadera y agregue al tazón.", "Agregue el repollo rallado a la sartén y blanquee durante 2-3 minutos, luego drene bien. Agregue el repollo al recipiente que contiene la batata y la coliflor. Apartar y mantener caliente.", "Caliente una freidora a 180 ° C. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje sin supervisión.) Espolvoree un poco de harina en un plato. Separe las rodajas de la oreja del cerdo en la harina, sacudiendo cualquier exceso. Freír las orejas de cerdo recubiertas en aceite caliente durante 2-3 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra recién molida. Apartar y mantener caliente.", "Justo antes de servir, ponga a hervir un sartén con agua con sal y cocine los raviolis durante 3-4 minutos o hasta que esté al dente.", "Para la vinagreta, mezcle todos los ingredientes de la vinagreta hasta que estén bien combinados. Coloque tres cuartos de la vinagreta en el recipiente que contiene las verduras a la Grècque, agregue la albahaca y mezcle hasta que las verduras estén cubiertas con la vinagreta.", "Para servir, espolvorea un poco del puré de berenjena en el centro de cada uno de los seis platos y arrastra la cuchara para crear un remolino. Coloque una cucharada grande de la peperonata en el centro de cada plato. Arregle los raviolis en la parte superior. Vierta las verduras a la Grècque al lado, luego rocíe los raviolis con la vinagreta restante. Adorne con algunas de las orejas de cerdo fritas."], "url": "www_bbc_co_uk_food_recipes_pigs_head_and_offal_23668", "title": "Raviolis de cabeza de cerdo y despojos con puré de berenjena ahumada y peperonata", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas de cilantro", "6 cápsulas de cardamomo", "1 cucharadita de semillas de comino", "8 dientes", "1 ramita de canela", "2 hojas de laurel", "75 g / 2½ oz de mantequilla", "1 cebolla pequeña, finamente picada", "1 diente de ajo, finamente picado", "½ cucharadita de cúrcuma molida", "½ cucharadita de semillas de mostaza negra", "Arroz basmati a 300 g / 10½ oz, enjuagado y escurrido", "500ml / 18fl oz de caldo de pollo o verdura, fresco o hecho de 1 cubo en existencia", "sal marina y pimienta negra recién molida"], "method": ["Usando una mano de mortero, machaque las semillas de cilantro en un polvo grueso. Agregue las vainas de cardamomo y muela hasta que las cáscaras se partan y las semillas se trituren ligeramente. Agregue el comino, los clavos de olor, la canela y el laurel y golpéelos ligeramente durante unos segundos, para mezclarlos.", "Derretir la mitad de la mantequilla en una sartén o en una sartén de fondo ancho a fuego medio. Freír la cebolla y el ajo durante 5 minutos, o hasta que se ablanden, revolviendo regularmente. Espolvoree las semillas de cúrcuma y mostaza, además de todos los ingredientes del almirez y el mortero. Freír suavemente durante 2 minutos, revolviendo.", "Mezcle el arroz para cubrirlo con especias mantecosas. Agregue el caldo y una buena pizca de pimienta negra. Agregue una pizca de sal si es necesario (las existencias de un cubo ya contienen sal). Remover bien y llevar a ebullición. Dar un revuelo final y luego cubrir la sartén con una tapa ajustada. Reduzca el fuego a su configuración más baja y cocine por 15 minutos.", "Cuando el arroz esté cocido, corte el resto de la mantequilla en trozos pequeños. Retire la tapa de la sartén y salpique la mantequilla sobre el arroz caliente. Deje que se derrita durante unos segundos, luego esponje rápidamente el arroz con un tenedor, teniendo cuidado de no romper los granos.", "Vuelva a colocar la tapa y deje reposar durante 5 minutos antes de servir. (Advierta a sus invitados que no deben comer el cardamomo, la canela ni los dientes de ajo)."], "url": "www_bbc_co_uk_food_recipes_pilau_rice_81725", "title": "Arroz pilau", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pilau_rice_81725_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pimms de 300 ml / ½ pinta, o \"copa de fruta\" similar", "Limonada de 850 ml / 1½ pintas", "puñado de fresas frescas, castrado, reducido a la mitad", "algunas ramitas de menta fresca, solo hojas", "1 naranja, solo ralladura"], "method": ["Mezcle los Pimms y la limonada en una jarra grande.", "Coloque un par de mitades de fresa, algunas hojas de menta y un poco de ralladura de naranja en cada molde de polo.", "Vierta la mezcla de Pimm en cada molde de polo de hielo hasta que esté lleno en tres cuartas partes. Inserte el polo y la tapa y congélelos durante 2-3 horas, o hasta que se solidifiquen.", "Alternativamente, puede usar vasos grandes como moldes: coloque la fresa, la menta y la ralladura de naranja en el vaso y llénelos con la mezcla Pimms. Congele por una hora, o hasta que los caramelos estén parcialmente congelados, luego inserte los palos de colores y continúe congelando hasta que estén completamente congelados.", "Para quitar los caramelos, sumerja los moldes brevemente en agua caliente y retire cuidadosamente los caramelos."], "url": "www_bbc_co_uk_food_recipes_pimms_lollies_94967", "title": "Paletas de Pimms", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pimms_lollies_94967_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Limonada de 750ml / 26fl oz", "250ml / 9fl oz Pimm's", "1 pepino, más o menos picado", "Fresas de 200g / 7oz, mondadas y partidas a la mitad", "puñado de hojas y flores de borraja", "puñado de hojas de menta", "puñado de bálsamo de limón", "1 limón, en rodajas", "1 naranja, en rodajas", "hielo"], "method": ["Coloque todos los ingredientes, excepto el hielo, en un tazón grande y mezcle. Deje reposar por 1 hora antes de servir.", "Vierta en vasos para servir, cubiertos con hielo, para una deliciosa bebida de verano."], "url": "www_bbc_co_uk_food_recipes_pimms_84859", "title": "Pimm", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["35ml / 1¼fl oz de ron de oro", "1 cucharada de ron con sabor a coco", "50ml / 2fl oz crema de coco", "50ml / 2fl oz de jugo de piña", "3-4 trozos de piña", "2 hojas de piña", "1 cereza al marrasquino"], "method": ["Vierta los dos rones, la crema de coco, el jugo de piña y trozos de piña en una licuadora y mezcle hasta que quede suave.", "Para servir, vierta en una copa de cóctel y adornar con hojas de piña y una cereza marrasquino."], "url": "www_bbc_co_uk_food_recipes_pinacolada_86525", "title": "Pina colada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]