[{"isVegetarian": false, "title": "Couscous-coated goujons of salmon with warm tomato and herb salsa", "url": "www_bbc_co_uk_food_recipes_couscouscoatedgoujon_87775", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "100g/3½oz salmon fillet, skin removed", "1 free-range egg, beaten", "55g/2oz couscous", "1 tbsp olive oil", "1 garlic clove, finely chopped", "2 tomatoes, chopped", "¼ tsp dried chilli flakes", "1 tbsp balsamic vinegar", "chopped fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon goujons, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Slice the salmon into four long strips. Dip the salmon strips in the beaten egg.", "Sprinkle the couscous onto a plate and coat the salmon slices in the couscous.", "Carefully place the salmon into the hot oil and deep fry for about 3-4 minutes, or until crisp and cooked through. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the tomato salsa, heat the oil in a frying pan. Add the garlic, tomatoes and chilli flakes and simmer for 2-3 minutes. Stir in the balsamic vinegar.", "Serve the salmon goujons on a plate with the salsa and garnish with parsley."]}, {"isVegetarian": true, "title": "Couscous salad", "url": "www_bbc_co_uk_food_recipes_couscoussalad_1921", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/couscoussalad_1921_16x9.jpg", "ingredients": ["225g/8oz couscous", "1 bunch fresh parsley, chopped", "1 bunch fresh coriander, chopped", "1 red onion, very finely chopped", "1 lemon, zest and juice", "½ cucumber, de-seeded and finely diced", "30g/1oz sunflower seeds, toasted", "30g/1oz sesame seeds, toasted", "4 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cover the couscous with twice its volume of hot water and leave to soak for 10 minutes. ", "Mix together with the remaining ingredients and leave to stand for 30 minutes to let the flavours develop.", "Serve at room temperature."]}, {"isVegetarian": false, "title": "Couscous fried chicken with couscous and spiced tomato sauce", "url": "www_bbc_co_uk_food_recipes_couscousfriedchicken_80610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700ml/1¾pints vegetable oil", "1 skinless chicken breast, trimmed into strips", "150g/5½oz flour, seasoned with salt and freshly ground black pepper", "1 free-range egg, beaten", "100g/3½oz couscous ", "1 tbsp olive oil", "50g/2oz leeks, chopped", "pinch of chilli powder", "1 beef tomato, roughly chopped", "1 tbsp tomato purée", "2 tbsp tomato ketchup", "1 tbsp red wine vinegar", "1 tbsp caster sugar", "75g/3oz coriander, roughly chopped", "200g/7oz cooked couscous", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat the vegetable oil in a heavy-bottomed saucepan. The oil is ready when a breadcrumb dipped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Coat the chicken in the flour, dip in the egg, then coat in couscous. Deep fry the chicken for 5 minutes until golden and thoroughly cooked through. Remove with a slotted spoon and drain on kitchen towels.", "To make the sauce, heat the oil in a frying pan. Add the leek and chilli and fry for 1 minute. Add the chopped tomato, tomato purée, ketchup, vinegar, sugar and half the coriander. Cook for 2 minutes.", "Mix the cooked couscous with the tomato sauce and season well with salt and freshly ground black pepper.", "To serve, spoon the spicy couscous into the centre of a warm plate, place the chicken on top and sprinkle with the remaining chopped coriander."]}, {"isVegetarian": false, "title": "Couscous salad with pan-fried salmon", "url": "www_bbc_co_uk_food_recipes_couscoussaladwithpan_93103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz couscous", "400ml/14fl oz hot chicken stock", "½ pomegranate, seeds only", "2 tbsp chopped fresh coriander, plus extra for serving", "2 tbsp chopped fresh chervil, plus extra for serving", "400g/14oz salmon fillet", "1 lemon, cut into thin wedges", "2 garlic cloves, sliced", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh dill", "splash fish or chicken stock"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the couscous, heat the olive oil in a pan. Pour in the couscous, and allow to roast and colour slightly in the pan for 3-4 minutes. Transfer to a bowl and pour over the hot stock. Cover with cling film set aside for 5-6 minutes, or until the couscous has absorbed all of the liquid. ", "Fluff up the grains with a fork and stir in the pomegranate seeds and chopped fresh herbs.", "Preheat the oven to 180C/350F/Gas 4.", "For the fish, make three deep incisions in the fish and place a wedge of lemon and a slice of garlic into each. Season with salt and freshly ground black pepper. ", "Heat the olive oil in a frying pan and fry the salmon, skin-side down, for 2-3 minutes, or until the skin is golden-brown and crisp. Transfer the fish to an ovenproof dish, sprinkle with half the herbs and add a splash of stock. Place into the oven to roast for 8-10 minutes, or until the fish is cooked through.", "To serve, spoon the couscous onto a serving plate and lay the fish fillet on top. Garnish with more fresh herbs."]}, {"isVegetarian": true, "title": "Couscous with apricots, lemon and brazil nuts", "url": "www_bbc_co_uk_food_recipes_couscouswithapricots_88958", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil, plus extra for greasing", "200g/7oz couscous", "30g/1oz dried apricots, chopped", "2 tbsp chopped fresh coriander", "squeeze lemon juice", "salt and freshly ground black pepper ", "300ml/10½fl oz hot chicken or vegetable stock", "30g/1oz brazil nuts, chopped", "small handful fresh basil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the couscous, heat the olive oil in a saucepan, add the couscous and stir well to coat in the oil. Keep stirring over a medium heat for 2-3 minutes, then add the rest of the ingredients and cook over a low heat, stirring occasionally, until the stock has been absorbed and the couscous is tender. Fluff up the couscous with a fork. ", "Press the couscous into a lightly oiled ramekin, and turn out onto a serving plate. Garnish with the basil leaves and serve."]}, {"isVegetarian": true, "title": "Couscous with caramelised onions and wild mushrooms", "url": "www_bbc_co_uk_food_recipes_couscouswithcarameli_87146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "4 shallots, finely sliced", "1 red onion, finely sliced", "salt and freshly ground black pepper", "25g/1oz butter", "150g/5½oz wild mushrooms, halved", "1 smoked garlic clove, finely chopped", "125g/4½oz couscous", "chopped fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the shallots and onions and season, to taste, with salt and freshly ground black pepper. Cook over a gentle heat for eight minutes, stirring frequently, until soft and lightly caramelised. ", "In a separate pan, heat the butter, add the mushrooms and garlic and cook over a medium heat for 2-3 minutes. ", "Place the couscous in a bowl and pour over enough boiling water to cover the couscous by a centimetre. Cover with cling film and leave until all the water has been absorbed. ", "Remove the cling film and fluff up the grains with a fork and season, to taste, with salt and freshly ground black pepper.", "To serve, pile the couscous onto a serving plate and top with the caramelised onions and mushrooms. Garnish with parsley."]}, {"isVegetarian": true, "title": "Couscous with pine nuts", "url": "www_bbc_co_uk_food_recipes_couscouswithpinenuts_83713", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz couscous", "½ tsp salt", "100g/3½oz pine nuts", "570ml/20fl oz/1 pint boiling water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the couscous, salt and pine nuts in a lidded saucepan and stir well.", "Pour the water over (it should be about 2cm/¾in above the couscous).", "Put the pan lid on and leave until ready to serve. ", "Gently fork the couscous to break up the grains, before transferring to a bowl to serve.", "This makes a great salad meal if you let the couscous go cold and keep in the fridge. If you are serving the couscous with a spicy main, leave this dish the way it is and serve hot. If you're serving it with a plainer meat, such as lamb chops, you could soften some onion in olive oil, and add fresh ginger, chilli and garlic before adding the couscous to the pan."]}, {"isVegetarian": true, "title": "Couscous with red onion and herbs", "url": "www_bbc_co_uk_food_recipes_couscouswithredonion_75830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz couscous ", "600ml/20fl oz/1 pint chicken stock or vegetable stock", "2 tbsp vegetable oil", "1 avocado, cubed", "½ lime, juice only", "2 tbsp fresh coriander, chopped ", "2 tbsp fresh mint, chopped", "1 red chilli, chopped", "1 red onion, finely sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the couscous into a large bowl and add hot chicken or vegetable stock. Cover and leave to stand for five minutes.", "In a frying pan add the vegetable oil. Once hot add the red onion.  Fry for 2-3 minutes and remove from the heat.", "Add the avocado, the lime juice, fresh herbs, chilli and the red onion to the couscous and mix thoroughly.", "Serve."]}, {"isVegetarian": false, "title": "Cow crumble", "url": "www_bbc_co_uk_food_recipes_cow_crumble_76025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp olive oil", "2kg/4lb 8oz cubed beef (mixture of chuck, skirt and shin)", "about 500ml/18fl oz beef stock", "3 carrots, roughly chopped", "3 celery sticks, roughly chopped ", "3 white onions, roughly chopped", "3 tbsp plain flour", "salt and freshly ground black pepper", "8 sprigs thyme", "2 bay leaves", "20cm/8in piece beef shin bone", "2 large potatoes", "4 large parsnips, peeled", "125g/4½oz butter", "2 tbsp black mustard seeds"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.", "Heat four tablespoons of olive oil in a large oven-proof dish.", "Brown the cubed beef on a moderate to high heat, in roughly four batches, reserving the meat in a bowl as you go.", "Add a couple of ladlefuls of stock to the dish and scrape the base of the dish with a wooden spoon to release the caramelised sediment. Pour into the bowl with the browned meat.", "Heat two more tablespoons of olive oil in the same dish and soften the roughly chopped carrots, celery and onion.", "Return the meat to the dish and scatter over the flour. Allow to cook for a couple of minutes.", "Pour over enough stock to almost cover the meat, season with salt and freshly ground black pepper and then stir the contents well.", "Add the thyme and bay leaf and leave to simmer on a low heat.", "For the crust, using a course grater or the grater setting of a food processor, grate the potatoes and peeled parsnips.", "In another pan, melt the butter with the mustard seeds.", "Toss the potatoes and parsnip in the melted butter and mustard seeds, evenly coating every strand.", "Spread the parsnip potato crust over the stew.", "Make a little gap in the middle of the crust and poke the bone into it, so that it stands upright.", "Cover in foil and bake for two hours, removing the foil after one hour so to allow the crust to go crisp."]}, {"isVegetarian": false, "title": "Crab and cod fishcakes with tomato salsa", "url": "www_bbc_co_uk_food_recipes_crab_and_cod_fishcakes__15634", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_and_cod_fishcakes__15634_16x9.jpg", "ingredients": ["500g/1lb 2oz floury potatoes, peeled and diced", "500g/1lb 2oz cod loin, skinned", "6 spring onions, finely chopped", "2 tbsp full-fat mayonnaise", "2 tsp Dijon mustard", "130g/4¾oz dressed crab or 100g/3½oz mixed fresh crabmeat", "2 tbsp chopped fresh parsley", "dash of hot pepper sauce, such as Tabasco", "100g/3½oz Japanese panko breadcrumbs", "knob of butter, plus extra for greasing", "1 tbsp oil", "salt and freshly ground black pepper", "6 firm tomatoes, deseeded, diced", "1 small red onion, finely chopped", "1 tbsp white wine vinegar", "4 tbsp olive oil", "2 tbsp chopped fresh parsley"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Put the potatoes in a saucepan of salted water and bring to the boil. Boil for 15 minutes, or until tender. Drain well and mash. Season with salt and pepper and set aside to cool.", "Grease a sheet of foil with the butter and put the cod loin in the centre, season with salt and pepper and wrap in the foil to make a parcel. Put on a baking tray and cook for 20 minutes, or until just cooked through. Set aside to cool. When completely cool, carefully flake the fish into large pieces. Reserve the cooking juices. ", "Spoon the cold mash into a bowl, mix in the spring onions, mayonnaise and mustard. Add 2 tablespoons of the fish cooking juice, then add the flaked cod and stir in the crabmeat. Add the parsley and hot pepper sauce and stir until combined. Season to taste. ", "Shape the mixture into 8 fishcakes, roughly 9cm/3½ in diameter, this is easiest with damp hands. Place on a tray and chill in the fridge for at least 15 minutes. ", "Sprinkle the breadcrumbs on a plate and coat each fishcake. Return to the tray and chill again in the fridge for 30 minutes.", "Meanwhile for the salsa, mix all the ingredients together and season with salt and pepper.", "Heat a wide, heavy-based frying pan, add the butter and oil and fry the fishcakes over a high heat for 4 minutes on each side, or until golden-brown all over. When frying, it’s best not to overcrowd the pan, cook in two batches, if necessary. ", "Serve hot with the tomato salsa and a simple dressed salad."]}, {"isVegetarian": false, "title": "Crab and courgette pasta", "url": "www_bbc_co_uk_food_recipes_crab_and_courgette_pasta_55917", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_and_courgette_pasta_55917_16x9.jpg", "ingredients": ["350g/12oz spaghetti or linguine", "600g/1lb 5oz courgettes, cut into ribbons using a vegetable peeler", "2 tbsp olive oil", "2 garlic cloves, finely chopped", "2 x 240g tins crab meat, drained", "½ unwaxed lemon, finely grated zest and juice ", "2 tbsp dried dill", "salt and freshly ground black pepper", "4 tbsp freshly grated Parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil. Cook the pasta for 8 minutes, or until al dente. ", "Place the courgettes in a steamer or colander and sit above the pan of pasta. Cover and steam for 1–2 minutes, or until tender. ", "Drain the pasta, retaining a little of the cooking water, and tip into a large bowl. ", "Pour the oil into the pasta pan over a low heat. Add the garlic and cook briefly, to flavour the oil. Pour the oil over the pasta.", "Toss the pasta with the crab, lemon zest and juice, dill and courgettes. Serve topping each portion with 1 tablespoon Parmesan and a grind of pepper."]}, {"isVegetarian": false, "title": "Crab and langoustine bisque with crispy crab wontons", "url": "www_bbc_co_uk_food_recipes_crab_and_langoustine_83597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 carrot, peeled and finely chopped", "1 onion, finely chopped", "1 stick celery, finely chopped", "½ leek, washed and finely chopped", "1 red pepper, deseeded and finely chopped", "3 medium tomatoes, finely chopped", "½ bulb fennel, finely chopped", "1 bay leaf", "6 peppercorns", "1 thyme spring", "1 tsp coriander seeds", "500g/1lb 2oz mix of crab and langoustine heads and shells", "1 tbsp tomato purée", "12 tbsp white rice", "175ml/6fl oz brandy", "1 litre/1¾ pints crab or fish stock", "salt and freshly ground black pepper", "1 tbsp crème fraîche, to serve", "vegetable oil, for deep-frying", "120g/4½oz white crab meat ", "1 chilli, finely chopped", "1 tbsp chopped chives", "squeeze lime juice", "1 free-range egg, beaten", "6 wonton wrappers"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the bisque, heat the oil in a large saucepan and cook the carrot, onion, celery and leek over a low heat for 5–7 minutes. Add the pepper, tomatoes, fennel, bay leaf, peppercorns, thyme and coriander seeds.", "Crush the crab and langoustine shells and add to the pan with the tomato purée and rice. Add the brandy and flambé. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.)", "Pour over the stock and simmer for 30 minutes. Season with salt and pepper and pass through a fine sieve into a clean pan. Simmer until the volume of the liquid has reduced by two thirds and the bisque is thick. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 175C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "To make the wontons, mix the crab meat with the chilli, chives and lime juice.", "Egg wash the edges of each wonton wrapper. Divide the crab mixture between each wonton and seal.", "Deep-fry the wontons for 5 minutes until golden-brown. Drain the wontons on kitchen paper and serve alongside the bisque in bowls topped with a spoonful of crème fraîche."]}, {"isVegetarian": false, "title": "Crab and lemon tagliolini", "url": "www_bbc_co_uk_food_recipes_crab_and_lemon_80562", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz ‘00’ pasta flour", "100g/3½oz plain flour", "2 free-range eggs", "3 tbsp extra virgin olive oil", "1 garlic clove, thinly sliced", "1 red chilli, thinly sliced", "100ml/3½fl oz vegetable stock", "250g/9oz white crab meat", "½ lemon, zest only", "10g/⅓oz flatleaf parsley, roughly chopped", "10g/⅓oz dill, roughly chopped, plus extra for garnish", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flours together in a bowl. Add the eggs and mix gently to form a dough, adding a little water if necessary.", "Transfer the dough to a lightly floured work surface and knead until smooth. Wrap in cling film and leave to rest in the fridge for at least 1 hour.", "Using a pasta machine, roll out the pasta dough until roughly 1mm thick. Cut the dough into sheets and slice into thin strips about 3mm wide. Dust with a little flour, cover and leave in the fridge until ready to cook. ", "To make the sauce, heat 2 tablespoons of the oil in a saucepan over a medium heat. Add the garlic and chilli and cook until the garlic is golden brown. Add half of the vegetable stock and allow to bubble. ", "Meanwhile, bring a large saucepan of salted water to the boil, add the tagliolini and cook for 1 minute. ", "Drain the tagliolini and add to the garlic and chilli. Add the white crab meat to the pasta with the remaining stock and heat through for a couple of minutes.", "Add the lemon zest, parsley, dill and remaining olive oil. Check the seasoning, garnish with a little more dill and serve. "]}, {"isVegetarian": false, "title": "Crab and lobster tart", "url": "www_bbc_co_uk_food_recipes_crab_and_lobster_tart_87817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pastry tart case lined with readymade savoury short crust pastry, baked blind until golden-brown", "4 free-range eggs", "2 free-range egg yolks", "425ml/¾ pint double cream", "pinch freshly grated nutmeg ", "salt and freshly ground black pepper ", "75g/2½oz grated parmesan", "250g/9oz white crabmeat", "1 cooked lobster, meat chopped", "bunch spring onions ", "butter, for frying"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Mix together the eggs, cream and nutmeg in a bowl. Season well with salt and pepper and add the parmesan, crab and lobster meat.  ", "Fry the spring onions in butter in a frying pan and spoon into the case. Spoon the lobster and crab mixture into the prepared flan case and bake for approximately 40 minutes, or until wobbly in the centre.", "Remove from the oven and leave to cool. Serve in slices."]}, {"isVegetarian": false, "title": "Crab ravioli with mussel with potato mariniere, wilted spinach and caviar", "url": "www_bbc_co_uk_food_recipes_crab_and_mussel_ravioli_51406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz tapioca", "568ml/1 pint lobster stock", "salt, to taste", "300g/10½oz strong white flour, plus extra for dusting", "100ml/3½oz pasteurised egg yolks (about 5-6 yolks) plus extra for glazing ", "200g/7oz salmon flesh", "1 free-range egg white", "400ml/14fl oz double cream", "250g/9oz fresh white crab meat", "1 tbsp finely chopped fresh dill", "2cm/1in piece fresh root ginger, finely chopped ", "salt and freshly ground black pepper", "500g/1lb 2oz fresh mussels ", "1 shallot, chopped", "1 garlic clove, chopped", "1 sprig thyme", "1 small glass white wine", "300ml/10½fl oz double cream", "1 large floury potato, peeled, diced and blanched", "1 tbsp chopped chives", "25g/1oz baby spinach", "salt, to taste", "pea shoots, to garnish", "2 tsp caviar, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the lobster tapioca garnish, place the tapioca in a pan with the lobster stock and heat until the tapioca becomes translucent. At this point, remove the tapioca from the heat and drain off the liquid into a container. Taste the tapioca and add salt as required.  Add a little of the cooking liquid back to the tapioca and spread the mix evenly over a silicon mat and dry in a dehydrator or a very low oven until crisp (this will take a few hours).", "For the garnish, snap off a few pieces of the tapioca crisp and fry in oil until crisp and puffed up. Set aside until ready to serve.", "To make the pasta, in a food processor, mix the flour and egg yolks until they come together to form a rough dough. Squeeze a piece of the dough, if it feels hard add some more egg yolk and mix again. The dough should be firm but pliable. ", "Tip the dough out onto a lightly floured work surface and knead the dough for five minutes. Wrap in cling film and place in the fridge to rest for 30 minutes.", "For the crab mousse, put the salmon and egg white into a food processor and pulse until smooth then slowly add the cream, pulsing to combine. Transfer the mousse to a bowl and add the picked white crab meat, chopped dill and chopped ginger. Season, to taste, with salt and pepper. Spoon the mousse into a piping bag fitted with a large plain nozzle and set aside.", "Take the pasta out of the fridge and cut it into two pieces. Put the dough through the pasta machine one setting at a time, starting at the largest and working down to the last and smallest setting. Put the other piece through the machine. You now have two long sheets of pasta.", "Brush one pasta sheet with some egg yolk and pipe four equally-sized balls of the crab mousse, about 6cm/2½in apart, in a line along one side of the pasta. Lower the other sheet of pasta over the mousse and gently pat it down using your fingers to seal all around the each ball of filling.", "Using a 4-6cm/2-3in cutter, cut out the ravioli into neat rounds.", "For the mussels, clean and debeard the mussels. If any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them.", "Heat a heavy-bottomed pan and add the mussels. Cover with a lid. After a minute, add the shallots, garlic, thyme and the white wine. Replace the lid and steam the mussels until they are all open (discard any that don't open).  Add the cream and bring to a boil. Strain the mussels, reserving the sauce and leave to cool slightly until safe to handle and pick out the mussel meat from the shells. ", "Add the mussel meat, diced cooked potatoes and chives to the cream sauce and warm through. In a separate pan wilt the spinach with two tablespoons of water and a little salt. Keep warm until ready to serve.", "To serve, bring a pan of salted water to a simmer and add the ravioli. Cook for four minutes. ", "Place a small mound of the wilted spinach into the centre of each serving bowl then spoon over the mussel and potato sauce. Remove the ravioli from the water using a slotted spoon and place one on top of each mound of spinach. Using a hand-held blender, foam the rest of the mussel sauce and spoon it around the ravioli. ", "Top the ravioli with caviar and tapioca crisps then garnish with some pea shoots and serve immediately."]}, {"isVegetarian": false, "title": "Crab and prawn ravioli with seafood bisque", "url": "www_bbc_co_uk_food_recipes_crab_and_prawn_ravioli_10855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb ‘00’ flour", "3 large free-range eggs, beaten, plus 2 yolks", "1 unwaxed lemon, finely grated zest only", "salt", "semolina flour, for dusting", "1 tbsp olive oil ", "150g/5½oz raw prawns in their shells", "squeeze lemon juice", "150g/5½oz white crab meat", "50g/1¾oz brown crab meat", "1 free-range egg white, plus 1 egg, beaten", "1 tbsp finely chopped fresh chives", "freshly ground black pepper", "1 tbsp olive oil ", "1 small onion, roughly chopped", "1 garlic clove, crushed", "3 tbsp brandy", "2 tomatoes, roughly chopped", "1 bay leaf", "1 tbsp tomato purée", "1 star anise ", "300ml/10fl oz shellfish (or fish) stock", "125ml/4fl oz double cream", "handful fresh chives, finely chopped", "extra virgin olive oil"], "serves": "", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pasta, put the flour into a large bowl and make a well in the centre. Stir in the eggs and yolks, lemon zest and a pinch of salt, and gradually work into a dough. Knead for 10 minutes, then wrap in cling film and refrigerate for 30 minutes.", "Meanwhile, to make the filling, place a frying pan over a medium heat. Add a dash of oil and fry the prawns with a pinch of salt and pepper and the lemon juice. Leave to cool slightly, then remove the prawns from their shells, reserving the shells for later.", "Place the prawn and crab meats in a food processor and blend until smooth. Add the egg white and seasoning and blend again until just mixed. Stir in the chives, cover and set aside.", "To make the bisque, heat the oil in a heavy-based saucepan and fry the onion until brown. Add the garlic and prawn shells and cook for another 30 seconds. Stir in the brandy, tomatoes, bay leaf, tomato purée and star anise. Stir in the stock and simmer for 20 minutes.", "Strain the sauce using a funnel and muslin cloth and return to the pan. Stir in the cream and cook over a medium heat until it is the consistency of single cream. Season to taste. ", "To make the ravioli, cut the pasta into four pieces and roll out each piece using a pasta machine, working it through the settings until it is on the thinnest setting. Sprinkle semolina flour onto a work surface and lay a sheet of the pasta on top. Spoon tablespoons of the filling up the centre of the pasta, leaving a 4cm/1½in gap between each spoonful. Brush around the filling with beaten egg, lay a second sheet of pasta over the top and seal each one by cupping and expelling any air. Use a cutter to cut out the individual ravioli. Repeat with the last two sheets of pasta until you have 12–16 individual ravioli.", "Bring a large saucepan of water to the boil and cook the ravioli for 3–4 minutes. Transfer to the bisque pan to coat.", "Place three or four ravioli on each plate, spoon over the sauce and garnish with the chives and a small drizzle of extra virgin olive oil."]}, {"isVegetarian": false, "title": "Crab and salmon roll with brown crab ketchup", "url": "www_bbc_co_uk_food_recipes_crab_and_salmon_roll_81622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz salmon, pin boned and skinned ", "pinch sea salt ", "25ml/1fl oz double cream ", "120g/4¼oz white crab meat", "1 tbsp chopped coriander ", "1 tbsp chopped basil", "1 tbsp chopped parsley", "¼ lime, zest only ", "¼ lemon, zest only", "450g/1lb ready-made puff pastry ", "1 free-range egg, beaten for egg wash", "½ leaf gelatine, soaked in cold water for 10 minutes", "½ lemon, juice only", "110g/4oz brown crab meat", "dash of Worcestershire sauce", "1 tsp English mustard", "1 tsp anchovy essence", "2 tsp tomato ketchup", "1 egg yolk", "1 tbsp fresh white breadcrumbs", "110ml/4oz vegetable oil", "4 tbsp rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab and salmon roll, make a salmon mousse by blending half the salmon with a pinch of sea salt in a food processor. Add the double cream and process until smooth. Fold the crab meat into the mousse then mix in the herbs and citrus zests. Weigh into 4 portions (about 100g/3½oz each) and mould into sausage shapes. ", "Cut the pastry into four 17x15cm/6½x6in rectangles. Place the sausages on the pastry lengthways. Brush the edges of the pasty with egg wash. Fold over the pastry to encase the filling and crimp the edges with a fork to seal. Trim off any excess pastry and brush with two coats of egg wash. Store in the fridge until ready to cook (they can be made a day ahead).", "Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.", "Bake the pastries for 11 minutes, or until golden-brown and puffed up.", "For the brown crab ketchup, squeeze out any excess water from the gelatine then add to a pan with the lemon juice. Dissolve over a very low heat then transfer to a blender. Add the brown crab, Worcestershire sauce, mustard, anchovy essence, ketchup and egg yolk then process until smooth. Add the breadcrumbs and continue to blend until smooth again. With the motor running slowly add the oils in a thin stead stream. Stop the machine and scrape the sides every so often. Season with salt and pepper. Pass through a fine sieve into a small jug or bowl. ", "Serve the warm rolls on a serving board with the ketchup alongside."]}, {"isVegetarian": false, "title": "Crab and sweetcorn beignets with celeriac soup", "url": "www_bbc_co_uk_food_recipes_crab_and_sweetcorn_26371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "475g/1lb 1oz celeriac, peeled and cut into cubes", "2 shallots, sliced", "1 garlic clove, chopped", "50ml/2fl oz dry white wine", "1 litre/1¾ pints chicken stock", "75ml/2½fl oz double cream", "vegetable oil, for frying", "50g/1¾oz butter, diced", "75g/2½oz plain flour", "½ tsp cayenne pepper", "2 free-range eggs", "55g/2oz white crabmeat", "25g/1oz brown crabmeat", "25g/1oz tinned sweetcorn", "salt and freshly ground black pepper", "olive oil", "2 tsp baby watercress", "1 eating apple, cut into thin strips"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the celeriac soup, heat the oil in a large pan over a medium heat. Add the celeriac, shallots and garlic and gently fry for a few minutes, to soften without browning.", "Add the white wine, bring to the boil and cook to reduce the volume of liquid by half.", "Add the chicken stock and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until the celeriac is tender. Remove from the heat and allow to cool for five minutes.", "Transfer the soup to a blender and blend until smooth.", "Return the soup to the saucepan, add the cream and heat through. Season, to taste, with salt and freshly ground black pepper.", "For the crab and sweetcorn beignets, heat the oil in a deep-fat fryer to 180C/350F. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Melt the butter and 125ml/4fl oz water in a saucepan until the mixture boils, then boil for another minute.", "Remove the pan from the heat and beat in the flour and cayenne pepper with a wooden spoon until smooth, or until the mixture comes away from the side of the pan. Return the pan to the heat and cook for 1-2 minutes, stirring continuously.", "Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the other egg.", "Stir in the white and brown crabmeat and sweetcorn until well combined, then season with salt and freshly ground black pepper.", "Spoon the mixture into a piping bag fitted with a large plain nozzle. Carefully pipe 1.5cm/½in long sections into the oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove the beignets from the pan with a slotted spoon and set aside to drain on kitchen paper and season with salt.", "To serve, ladle the soup into bowls, scatter over some crab and sweetcorn beignets. Drizzle the soup with olive oil and garnish with the baby watercress and apple."]}, {"isVegetarian": false, "title": "Crab and scallop Mornay", "url": "www_bbc_co_uk_food_recipes_crab_and_scallop_mornay_42821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large diver-caught scallops, shucked (keep the shells)", "knob of butter", "100g/3½oz white or brown (or a mixture) handpicked crabmeat", "500ml/18fl oz whole milk", "1 bay leaf", "½ small onion, finely sliced", "30g/1oz butter, plus extra for greasing", "30g/1oz plain flour", "1½ tsp English mustard powder", "3 tbsp white wine", "2 tbsp single cream", "25g/1oz Gruyère cheese, finely grated", "2 heaped tbsp snipped chives", "25g/1oz white breadcrumbs, made with crust-less day-old bread", "25g/1oz Gruyère cheese, finely grated", "3 heaped tbsp finely chopped curly parsley (optional)", "flaked sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Slice each scallop into three discs, put on a plate, cover with cling film and chill in the fridge while the sauce is being prepared. Scrub the deeper part of each scallop shell well with hot water and place on a rack over a baking tray, and grease the inside with butter. If you don’t have scallop shells available, use shallow gratin dishes instead. Preheat the oven to 220C/425F/Gas 7.", "To make the sauce, pour the milk into a small saucepan and add the bay leaf and onion. Stir well and bring to a gentle simmer. Remove from the heat and leave to stand for 15 minutes. Strain through a fine sieve into a jug.", "Melt the butter in a non-stick saucepan and stir in the flour and mustard powder. Cook for 30 seconds, stirring constantly. Gradually start adding the infused milk, stirring well between each addition. When all the milk is added, stir in the wine, cream and cheese and bring to a gentle simmer. Cook for 3-4 minutes, stirring constantly until the sauce is thick and smooth. Use a silicone whisk to stir the sauce if it has any lumps appearing.", "Remove the pan from the heat and stir in the scallops and chives and season to taste.  Divide the crabmeat between the buttered shells or gratin dishes. Spoon the scallop mixture evenly into the prepared shells, making sure each one gets three slices of scallop.", "Mix the breadcrumbs with the grated cheese and parsley, if using, and season with salt and pepper. Sprinkle the breadcrumbs over the scallop mixture. Bake in the hot oven for 18-20 minutes until golden-brown and bubbling. (The scallops should have turned opaque, but remain sweet and tender.)", "Serve the scallops and crab Mornay with a crisp green salad and a glass of chilled white wine."]}, {"isVegetarian": false, "title": "Crab balls with tomato sauce", "url": "www_bbc_co_uk_food_recipes_crab_balls_with_tomato_02638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, to cover a small pan ", "4 tbsp white balsamic vinegar", "500g/1lb 1oz cherry tomatoes on stalk ", "1 tsp sugar ", "salt, to taste", "½ tsp black pepper", "2 tbsp olive oil", "1 onion, finely chopped", "1 red chilli, finely chopped", "2 garlic cloves, finely chopped", "1 tbsp tomato purée", "3 skinned tomatoes ", "2 tbsp sherry vinegar ", "good pinch sugar ", "2 tbsp olive oil", "1 banana shallot, finely chopped", "1 red chilli, finely chopped", "1 thumb-sized piece root ginger, peeled and finely grated ", "2 large potatoes, baked ", "2 tbsp brown crabmeat", "250g/9oz white crabmeat", "1 lemon, zest only", "1 tbsp chopped chives ", "salt and freshly ground black pepper ", "50g/2oz softened butter ", "vegetable oil, for deep fat frying", "75g/2½oz plain white flour, seasoned with salt and pepper", "2 whole free-range eggs, beaten", "100g/3½oz breadcrumbs"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato confit, put the olive oil and white balsamic vinegar in a pan and heat. Add the stalks from the cherry tomatoes, a pinch of the sugar and a little salt and simmer for a few minutes. ", "Add the cherry tomatoes and the turn off the heat. Carefully remove the stalks. Add the remaining sugar and the black pepper and gently simmer for 8-12 minutes, or until softened slightly.", "Transfer to a sterilised jar and leave to cool.", "For the tomato sauce, heat the olive oil in a frying pan, add the onion, chilli and garlic and fry until softened but not browned. ", "Add the tomato purée and stir to combine. Add the tomatoes, salt and pepper to taste and then cook until the tomatoes have softened completely. Add the sherry vinegar and sugar and cook until pulpy.", "Remove from the heat and cool slightly and blend until smooth in a food processor or blender. Pass through a sieve into a clean bowl to make a smooth sauce.", "For the crab balls, heat the olive oil in a frying pan and fry the shallot, chilli and ginger until soft. Remove from the heat and set aside.", "Push the baked potatoes through a sieve into a bowl, discarding the skins and add the brown and white crabmeat.", "Add the fried shallots, chilli and ginger.", "Stir in the lemon zest, chives, salt and freshly ground black pepper and butter and mix well.", "Once firm, wet your hands and then form into balls. Place the crab balls on a plate and leave to set in fridge. ", "Heat the oil in a heavy-based saucepan or deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the flour, egg and breadcrumbs on separate plates and gently dip each ball first into the flour, followed by the egg and then the breadcrumbs.", "Deep fry the crab balls in the oil until golden-brown and cooked through. Remove with a slotted spoon and transfer to a plate lined with kitchen paper. ", "Serve the tomato sauce and confit tomato with the crab balls."]}, {"isVegetarian": false, "title": "Crab cakes", "url": "www_bbc_co_uk_food_recipes_crab_cakes_61455", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 Maris Piper potatoes, peeled and cut into chunks", "salt and freshly ground black pepper", "4 fresh spider crab claws, meat only", "2 handfuls mature cheddar cheese ", "1 free-range egg", "4 spring onions, finely chopped", "handful fresh chives, finely chopped", "½ lemon, zest only", "1 tbsp sweet chilli sauce", "1 tbsp butter", "flour, for dusting"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large pan with salted water and bring to the boil. Add the potatoes and cook until soft. Drain and mash.", "In a bowl, combine the crab meat, mashed potatoes, cheese, egg, spring onion, chives and lemon zest.  Season to taste with salt and freshly ground black pepper. Add the sweet chilli sauce and stir through.", "Dust your hands and a work surface with flour. Use your hands to pat the mixture into little circular cakes.", "Fry the cakes in the butter until golden-brown on each side. This should take about 2-3 minutes on each side", "Serve immediately with a side salad."]}, {"isVegetarian": false, "title": "Crab cakes", "url": "www_bbc_co_uk_food_recipes_crab_cakes_80855", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_cakes_80855_16x9.jpg", "ingredients": ["2cm/1in piece fresh root ginger, peeled ", "2 red chillies, seeds removed", "250g/9oz white crabmeat", "1 tbsp roughly chopped fresh coriander", "2 spring onions, finely sliced", "2 free-range eggs", "7-8 tbsp breadcrumbs ", "plain flour, for dusting", "25ml/1fl oz olive oil", "sweet chilli jam", "few handfuls salad leaves", "olive oil, for drizzling", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ginger and chilli into a mini food processor and pulse until finely chopped. ", "In a bowl combine the chilli and ginger with the white crabmeat, coriander and spring onions. Crack in one egg and mix well, then stir in 4 tablespoons of the breadcrumbs. ", "Divide the crab cake mixture into 6 equal portions and mould into patties. Place on a tray and chill in the fridge for about 20 minutes before cooking. ", "Preheat the oven to 180C/365F/Gas 4.", "Beat the remaining egg in a small bowl with one tablespoon of water to make an eggwash. Place some plain flour and the remaining breadcrumbs in separate shallow dishes. ", "Dredge a crab cake in the flour, then dip into the egg  and coat in the breadcrumbs. Shake gently to remove any excess breadcrumbs. Repeat with the remaining crab cakes.", "Heat the olive oil in a frying pan and fry the crab cakes for 2-3 minutes on each side, or until crisp and golden-brown all over. Transfer the crab cakes to a baking tray and bake for 5-10 minutes, or until piping hot all the way through. ", "Serve the crab cakes with sweet chilli jam and a mixed leaf salad, lightly dressed with olive oil, salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Crab churros with chilli jam, dressed crab and lime mayonnaise", "url": "www_bbc_co_uk_food_recipes_crab_churros_with_chilli_14019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "50g/1¾oz butter, diced", "75g/2½oz plain flour", "½ tsp cayenne pepper", "2 free-range eggs", "75g/2½oz white crabmeat", "25g/1oz brown crabmeat", "salt and freshly ground black pepper", "75g/2½oz caster sugar", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 lime leaves", "2 lemongrass stems, tough outer leaves removed, finely chopped", "25g/1oz roughly chopped fresh ginger", "2 garlic cloves, peeled, left whole", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce (nam pla)", "40ml/1½fl oz sesame oil", "50ml/2fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest", "110g/4oz crème fraîche", "2 egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz rapeseed oil ", "1 lime, zest and juice", "200g/7oz white crab meat", "50g/1¾oz mizuna leaves", "50g/1¾oz red sorrel", "½ bunch fresh mint, leaves picked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the churros, heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Heat the butter with 125ml/4fl oz water in a saucepan until the mixture boils, then boil for another minute. ", "Remove from the heat and beat in the flour and cayenne with a wooden spoon until smooth, or until the mixture comes away from the side of the pan. Return the pan to the heat and cook for 1-2 minutes, stirring continuously.", "Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the other egg.", "Stir in the white and brown crabmeat until well combined, season with salt and pepper.", "Spoon the mixture into a piping bag and pipe 1.5cm/½in long sections into the oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove the churros and set aside to drain on kitchen paper, season with salt.", "For the chilli jam, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel (CAUTION: boiling sugar is extremely hot. Handle very carefully.)", "Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée.", "Once the sugar has caramelised, add in the purée and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool. Once cool, stir in the crème fraîche until well combined.", "For the dressed crab place the egg yolks, vinegar and mustard in a food processor and blend until pale and creamy. With the motor running, pour in enough oil, in a steady stream, to make a thick mayonnaise. Mix in the lime zest and juice. Mix 4 tablespoons of the mayonnaise into the fresh white crab.", "For the salad, mix the leaves in a large bowl and dress with a little of the chilli jam.", "Serve the salad leaves on a serving plate with the dressed crab, churros and chilli jam."]}, {"isVegetarian": false, "title": "Baked crab custard pots", "url": "www_bbc_co_uk_food_recipes_crab_custard_and_salad_25711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz brown crab meat", "4 free-range egg yolks", "1 tsp freshly ground nutmeg ", "200ml/7fl oz milk", "60ml/4 tbsp double cream", "125g/4½oz white crab meat ", "1 spring onion, thinly sliced", "2 tbsp olive oil", "1 lemon, juice only", "400g/14oz small tomatoes,quartered", "salt and freshly ground black pepper", "2 tbsp finely chopped micro basil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140 Fan/Gas 3.", "In a bowl, beat together the brown crab meat, egg yolks, nutmeg, milk and cream. Season with salt and pepper.", "Pass the mixture through a sieve into a clean, large bowl, pressing all of the liquid out of the crab meat.", "Pour the mixture into four ramekin dishes. Bake for 20 minutes, or until set. It will depend on the size of the ramekin. Leave to cool.", "In a clean bowl, toss the white crab meat with the spring onion and olive oil.", "Place the tomatoes around the outside of the custard pots, spoon over the white crab meat mixture, squeeze over the lemon, sprinkle with the micro basil and serve."]}, {"isVegetarian": false, "title": "Crab pasties", "url": "www_bbc_co_uk_food_recipes_crab_pasty_34505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-rolled puff pastry", "1 red onion, finely chopped", "1 red chilli, finely chopped", "1 tbsp chopped fresh lemon balm", "1 potato, cooked, finely diced", "1 lime, zest only", "450g/1lb crabmeat", "salt and freshly ground black pepper", "2 free-range eggs, beaten", "200g/7oz baby onions", "100g/3½oz demerara sugar", "10g/¼oz mustard powder", "125ml/4½fl oz cider vinegar", "1 garlic clove, crushed", "2 lime leaves"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut the puff pastry into six 20cm/8in squares.", "For the filling, mix the red onion, chilli, lemon balm, potato, lime zest and crabmeat together in a bowl. Season well, then spoon the mixture onto one half of each of the pastry squares. ", "Brush the edges with beaten egg and fold over to make a triangle, seal the edges with the tines of a fork and brush all over with more beaten egg.", "Bake in the oven for 25 minutes, or until the pastry is golden-brown.", "For the relish, heat the baby onions, sugar, mustard powder, cider vinegar, garlic and lime leaves in a saucepan until boiling. Reduce the heat to a simmer and cook for 30-40 minutes, stirring occasionally, or until thickened.", "Serve the relish with the crab pasties."]}]