[{"isVegetarian": false, "title": "Carne de res, espárragos y mangetout salteados", "url": "www_bbc_co_uk_food_recipes_beefasparagusandmang_85921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150 g / 5 oz de filete de ternera escocés, en rodajas finas", "20ml / ¾fl oz de sake", "20ml / ¾fl oz de salsa de soja", "1 cucharadita de jengibre fresco rallado", "½ cucharadita de azúcar moreno", "½ diente de ajo, finamente picado", "1 chile rojo pequeño, finamente picado", "110g / 4oz de espárragos picados en palitos delgados (juliana)", "Mangetout 75g / 3oz, picado en palos delgados (juliana)", "2 cucharaditas de aceite de sésamo", "sal y pimienta negra recién molida", "2 cucharaditas de semillas de sésamo, para servir", "2 ramitas de cilantro fresco, para adornar"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el filete de ternera, el sake, la salsa de soja, el jengibre, el azúcar, el ajo y el chile en un bol y mezcle bien. Guarde y marinado durante 30 minutos.", "Calentar un wok hasta que esté caliente y agregar la mezcla de carne. Revuelva-fríe durante dos minutos, hasta que la carne esté dorada por todos lados.", "Agregue los espárragos y el mangetout y continúe revolviendo por otros 2-3 minutos, hasta que los vegetales estén tiernos y la carne esté bien cocida.", "Agregue el aceite de sésamo y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, espolvorea el salteado en dos platos y espolvoréalos con las semillas de sésamo y adorna con una ramita de cilantro."]}, {"isVegetarian": false, "title": "Curry de carne de vaca con puré de limón y camote", "url": "www_bbc_co_uk_food_recipes_beefcurrywithlemonan_86071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "150 g / 5½ oz de filete de lomo, cortado en trozos del tamaño de un bocado", "½ cebolla roja picada", "1 cucharadita de curry en polvo", "1 hoja de laurel", "¼ cucharadita de copos de chile", "4 cucharadas de vino tinto", "sal y pimienta negra recién molida", "1 cucharada de cilantro fresco picado", "1 batata, pelada y cortada en cubos, hervida hasta que esté tierna y escurrida", "2 cucharadas de crema doble", "½ limón, solo jugo", "sal y pimienta negra recién molida", "55 g / 2 oz de judías verdes, coronadas y atado, blanqueadas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el curry de ternera, caliente el aceite en una sartén grande y fría los trozos de carne, revolviendo con frecuencia, hasta que se dore por todas partes.", "Agregue la cebolla y cocine hasta que se ablande.", "Agregue las especias y cocine por un minuto más.", "Agregue el vino tinto y cocine durante 8-10 minutos, o hasta que la carne esté bien cocida. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el cilantro.", "Para el puré de boniato, coloca la batata cocida en un bol con la crema y el jugo de limón. Sazonar, al gusto, con sal y pimienta negra recién molida y macerar con un machacador de papas hasta que quede suave.", "Para servir, coloque el puré en un plato para servir con las judías verdes blanqueadas y cubra con el curry."]}, {"isVegetarian": false, "title": "Curry de carne con arroz jazmín", "url": "www_bbc_co_uk_food_recipes_beefcurrywithjasmine_83224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "Filete de costilla de 100 g / 3½ onzas, cortado en trozos de 5 cm / 2 in", "sal y pimienta negra recién molida", "3 chalotes, en rodajas finas", "1 diente de ajo, picado", "1 cucharadita de puré de tomate", "1 cucharadita de chile en polvo", "½ cucharadita de polvo de cúrcuma", "200ml / 7fl oz de leche de coco", "250 g / 9 oz de arroz jazmín, hervidas hasta que estén tiernas", "20g / 1oz de cilantro fresco picado, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite de oliva en una sartén hasta casi fumar. Sazone el bistec con sal y pimienta negra recién molida y agregue a la sartén. Marrón por todos lados, luego eliminar.", "Agregue dos de los chalotes en rodajas junto con el ajo y cocine hasta que estén suaves pero no coloreados. Agregue el puré de tomate y las especias, mezcle bien y cocine por un minuto.", "Vuelva a poner el bistec en la sartén y agregue la leche de coco. Llevar a ebullición, luego baje el fuego y cocine a fuego lento durante 10 minutos.", "Agregue la chalota restante al arroz jazmín cocido y escurrido.", "Para servir, revuelva el cilantro a través del curry y sirva con el arroz jazmín."]}, {"isVegetarian": false, "title": "Empanadas de carne", "url": "www_bbc_co_uk_food_recipes_beefempanadas_86767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "1 diente de ajo, aplastado", "1 zanahoria, finamente picada", "225 g / 8 oz de carne picada extra magra", "1 cucharada de puré de tomate", "¾ cucharadita de comino molido", "1 cucharadita de chile en polvo", "1 patata mediana, pelada, cortada en cubos", "100ml / 3½fl oz de cerveza mexicana oscura, cerveza dorada o cerveza negra", "sal y pimienta negra recién molida", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "½ cucharadita de cúrcuma", "½ cucharadita de copos de chile", "75g / 3oz de mantequilla fría, cortada en cubos", "pizca de sal", "50ml / 2fl de leche en oz", "1 yema de huevo de gallinas camperas", "1 huevo de gallinas camperas, golpeado", "salsa dulce de chile"], "serves": "Hace 12", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la cebolla, el ajo y la zanahoria y fría hasta que se ablanden.", "Agregue la carne picada y fría por 3-4 minutos, hasta que se dore por todas partes.", "Agregue el puré de tomate, el comino y el chile en polvo, mezcle bien y cocine durante 3-4 minutos.", "Agregue las papas y la cerveza y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 25 minutos, o hasta que las papas estén cocidas.", "Retirar del fuego y dejar enfriar.", "Para la repostería, coloque la harina, la cúrcuma, los copos de chile, la mantequilla y la sal en un procesador de alimentos y emita un pulso con la consistencia de una miga de pan.", "Agregue la leche y la yema de huevo y pulse juntos hasta que la mezcla se una como una masa.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar durante unos minutos, luego envuélvala en una película adhesiva y transfiérala a la nevera para que se enfríe durante una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y corte 12 círculos de 10 cm de diámetro.", "Coloque una cucharada del relleno en el centro de cada círculo de repostería.", "Cepilla el borde de la mitad de cada uno de los círculos con algo del huevo batido, luego dobla sobre el otro lado y sella, asegúrate de no atrapar ningún aire en el interior.", "Marque los bordes de la masa sellada con los dientes de un tenedor.", "Coloque las empanadas en una bandeja para hornear y transfiéralas al horno para cocinar durante 10 minutos o hasta que la masa esté cocida y el relleno esté caliente.", "Para servir, coloca las empanadas en un plato grande con salsa dulce de chile en un bol en el centro."]}, {"isVegetarian": false, "title": "Filete de res en leche de coco con fideos crujientes y salsa para mojar", "url": "www_bbc_co_uk_food_recipes_beeffilletwithcoconu_87454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7 oz de filete de res, en rodajas finas", "sal y pimienta negra recién molida", "aceite de oliva", "75ml / 3fl oz de leche de coco", "2.5cm / 1 en pieza de jengibre fresco", "Vinagre de vino de arroz de 110ml / 4fl oz", "Azúcar en polvo de 110 g / 4 oz", "50ml / 2fl oz de salsa de pescado tailandés (nam pla)", "2 cucharaditas de copos de chile seco", "50g / 2oz anacardos, finamente picados", "1 cilantro fresco de racimo pequeño, aproximadamente picado", "aceite vegetal para freír", "40g / 1½oz de fideos de arroz listos para usar", "2 lechugas con gemas pequeñas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las rodajas de carne, sal y pimienta negra recién molida y aceite de oliva en un tazón y mezcle bien.", "Calentar una sartén y agregar la carne. Evite voltearse la carne demasiado; desea que desarrolle una buena corteza.", "Una vez que la carne esté dorada por completo, agrega la leche de coco. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, revolviendo ocasionalmente. La leche de coco se reducirá hacia abajo para dar una consistencia pegajosa, cubriendo la carne. Sáquelo del fuego y apártelo.", "Ralla el jengibre en el medio de una sábana de muselina. Doble sobre la muselina para sellar alrededor del jengibre, luego exprima el jugo sobre un recipiente limpio girando lentamente la muselina con el jengibre dentro.", "Coloque el vinagre de vino de arroz y el azúcar impalpable en una sartén a fuego medio y revuelva hasta que el azúcar se haya disuelto.", "Agregue la salsa de pescado tailandés, los copos de chile y el jugo de jengibre exprimido y cocine a fuego lento durante cinco minutos.", "Agregue las nueces picadas y caliente por un minuto.", "Agregue el cilantro picado y caliente por un minuto.", "Caliente una freidora a 180 ° C / 350 ° F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue los fideos al aceite: se expandirán rápida y dramáticamente. Una vez que los fideos estén crujientes y dorados elimínelos del aceite con una espumadera y transfiéralo a una bandeja para hornear forrada con toallas de papel para drenar.", "Divida las hojas de las lechugas Little Gem y coloque los platos para servir.", "Para servir, vierta la carne de res en las \\\"copas\\\" de las hojas Baby Gem, y luego rocíe la salsa de inmersión. Desmenuza suavemente un puñado de fideos crujientes sobre cada plato y sirve."]}, {"isVegetarian": false, "title": "Filetes de res con piquillos de wasabi y remolacha picante", "url": "www_bbc_co_uk_food_recipes_beeffilletwithwasabi_67767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4x170g / 6oz filetes de carne", "4 remolachas pequeñas cocidas", "½ cucharadita de semillas de hinojo", "700ml / 1¼ pintas de vinagre de malta", "55g / 2oz de azúcar moreno oscuro", "1 diente de ajo picado", "1 cucharada de jengibre picado", "2 papas grandes", "1 cucharada de salsa de rábano picante", "1 cucharadita de wasabi", "2 huevos, solo yemas", "1 cucharada de cebollino picado", "sal y pimienta"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Rallar la remolacha en un recipiente de metal.", "Freír las semillas de hinojo en una sartén y moler hasta obtener un polvo en un molinillo de especias. Mezcle con el vinagre, el azúcar, el ajo, el jengibre y el chile.", "Hervir juntos durante 20 minutos y verter sobre la remolacha rallada. Dejar enfriar. Hervir las papas en sus pieles hasta que estén suaves, dejar enfriar un poco y pelar.", "Aplastar las papas con un tenedor y agregar el wasabi, el rábano picante, las yemas y el cebollín, mezclar bien y sazonar.", "Calentar una sartén antiadherente y ligeramente aceite. Vierta la mezcla en 4 anillos de huevo engrasados ​​y cocine a fuego moderado hasta que estén dorados, voltee y repita.", "Caliente una sartén de la parrilla, cepille los filetes de carne con un poco de aceite y cocine durante 3-4 minutos en cada lado y déjelos reposar en un lugar cálido.", "Coloque un pastel de papa en un plato caliente; cortar la carne y colocar encima. Coloque la mezcla de remolacha encima y vierta un poco de jugo y sirva."]}, {"isVegetarian": false, "title": "Filetes de ternera con chalotes crujientes y ensalada de champiñones y berros", "url": "www_bbc_co_uk_food_recipes_beefflankwithcrispsh_89942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para freír", "Harina común 110g / 4oz, para quitar el polvo", "sal y pimienta negra recién molida", "5-6 chalotes, pelados y cortados en finos anillos", "Leche de 110 ml / 4 fl oz", "2 filetes de flanco de carne de ternera de 300 g / 10 oz", "2 cucharadas de aceite de oliva", "150 g / 5oz de setas silvestres mezcladas, limpiadas", "1 cucharada de vinagre de sidra de buena calidad", "3 cucharadas de aceite de colza", "1 cucharadita de mostaza inglesa", "sal y pimienta negra recién molida", "110g-150g / 4oz-5oz de berro, lavados y gruesos tallos eliminados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sazone la harina con sal y pimienta negra recién molida.", "Dragar los anillos de chalote en la harina sazonada para cubrir, sacudiendo cualquier exceso. Sumérgete en la leche y luego draga en la harina de nuevo, sacudiendo cualquier exceso.", "Fríe los anillos de chalota en el aceite caliente en lotes durante 3-4 minutos, hasta que estén crujientes y dorados, luego retíralos con cuidado con una cuchara ranurada y escurre sobre papel de cocina.", "Caliente una sartén de plancha (o, idealmente, una barbacoa).", "Sazone los filetes con sal y pimienta negra recién molida y coloque en la sartén de la plancha. Cocine por 3-4 minutos en cada lado por raro, o hasta que esté cocido a su gusto. Retirar del fuego y dejar reposar durante cinco minutos.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y los champiñones y saltee durante 2-3 minutos, hasta que se ablanden y se pongan dorados.", "Mientras tanto, para la ensalada de berros, mezcle el vinagre de sidra, el aceite de colza y la mostaza en un bol y sazone al gusto con sal y pimienta negra recién molida. Rocíe el aderezo sobre el berro en un recipiente y mezcle bien.", "Para servir, coloque partes iguales de la ensalada de berros en cuatro platos. Cortar los filetes y colocar una cantidad igual de rebanadas en cada una de las cuatro porciones de berros. Coloque las setas silvestres y los chalotes crujientes encima de cada uno y sirva."]}, {"isVegetarian": false, "title": "Estofado de res", "url": "www_bbc_co_uk_food_recipes_beefgoulash_10656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de solomillo de 500g / 1lb, cortado y cortado en tiras", "aceite de oliva", "1 cebolla mediana, pelada y cortada finamente", "½ pimiento rojo, sin semillas y en rodajas", "½ pimiento verde, sin semillas y en rodajas", "25g / 1oz de mantequilla", "sal marina y pimienta negra", "2 cucharadas de puré de tomate", "200ml / 7fl oz de caldo de carne", "3 cucharadas de pimentón", "perejil pequeño de hojas planas", "100ml / 3½ fl oz crema agria"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén sobre la estufa hasta que esté muy caliente, luego dore la carne (en tandas) en un poco de aceite de oliva.", "Colorea las cebollas y los pimientos en la mantequilla y condimenta. Coloque en una sartén grande, junto con el bistec dorado.", "Verter el puré de tomate, el caldo y el pimentón, sazonar y llevar a ebullición. Cocine por entre 20 y 40 minutos. Adorne con crema agria y el perejil de hoja plana."]}, {"isVegetarian": false, "title": "Carne de vaca en cerveza de diseño", "url": "www_bbc_co_uk_food_recipes_beefindesignerbeer_67198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de estofado 900g / 2lb cortado en cuadrados de 2 pulgadas (5 cm)", "425ml / 15fl oz de cerveza de diseño", "1 cucharada de aceite de oliva", "350g / 12oz de cebollas, peladas y cortadas en cuartos", "2 dientes de ajo, aplastados", "1 cucharada de harina normal", "algunas ramitas de tomillo fresco", "2 hojas de laurel", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "6x2.5 cm / 1 en rebanadas gruesas de pan francés cortado ligeramente en diagonal", "Mostaza integral de 6 niveles de cucharadita", "110g / 4oz de queso Gruyère rallado"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Puedes hacer los croûtons con bastante anticipación y, para ello, precalentar el horno a 180ºC / 350ºF / Gas 4. Vierte el aceite de oliva sobre la bandeja para hornear, agrega el ajo triturado y luego usa las manos o un trozo de cocina. papel, extender el aceite y el ajo por toda la bandeja para hornear. Ahora coloque las rebanadas de pan sobre el aceite, luego gírelas de manera que ambos lados hayan sido ligeramente recubiertos con aceite. Hornee durante 20-25 minutos hasta que estén crujientes y crujientes.", "Cuando esté listo para cocinar la carne, baje la temperatura del horno a 150C / 300F / Gas 2. Tome la cazuela a prueba de fuego, colóquela sobre fuego directo, luego caliente el aceite hasta que esté hirviendo y fríe la carne, 3 o 4 piezas en un tiempo, hasta que se vuelven de color caoba oscuro por todos lados. Asegúrate de no sobrecargar la sartén o crearán vapor y nunca se volverán marrones. Mientras doras la carne, retírala a un plato y luego, cuando toda la carne esté lista, agrega las cebollas a la sartén, manteniendo el fuego alto. Revuélvalos hasta que se tiñen de oscuro en los bordes, esto tomará aproximadamente 5 minutos. Después de eso agregue el ajo triturado, deje que se cocine durante unos 30 segundos más o menos, luego baje el fuego, coloque la carne en la cazuela y espolvoree la harina. Con una cuchara de madera, revuelva hasta que toda la harina haya sido absorbida por los jugos. En esta etapa parecerá bastante pesado y poco prometedor, pero no se preocupe: la cocción lenta y larga transformará su apariencia.", "Ahora mezcle gradualmente la cerveza y, cuando todo esté listo, deje que todo se caliente suavemente y, mientras eso sucede, agregue sal, pimienta negra recién molida y el tomillo y las hojas de laurel. Luego, justo cuando comienza a burbujear, colóquela, transfiérala al estante central del horno y déjela allí durante 2 horas y media. No se sienta tentado a probarlo ahora o a mitad de la cocción, ya que toma 2 horas y media para que la cerveza se suavice y se convierta en una exquisita salsa.", "Justo antes de que desee servir la carne, precaliente la parrilla, esparza los croûtons con la mostaza y espolvoréelos con el gruyère rallado, luego colóquelos encima de la carne y revuelva la cazuela debajo de la parrilla hasta que el queso burbujee. Entonces sirva enseguida."]}, {"isVegetarian": false, "title": "Carne de res en salsa de ostras", "url": "www_bbc_co_uk_food_recipes_beefinoystersauce_89263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefinoystersauce_89263_16x9.jpg", "ingredients": ["Filete de res 350g / 12oz", "1 cucharadita de salsa de soja ligera", "1½ cucharada de salsa de ostras", "azúcar pizca", "sal y pimienta negra recién molida", "2 cucharadas de aceite de cacahuete", "3 dientes de ajo, finamente picados", "1 chile, sin semillas, finamente picado", "200 g / 7 oz hojas de espinaca bebé", "1 cucharada de vino de arroz Shaoxing o jerez seco", "pizca de copos de chile seco", "1 cucharadita de aceite de maní", "100g / 3½oz de champiñones de ostra", "dash vinagre de arroz negro chino o vinagre balsámico", "dash light salsa de soja"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne de vacuno, coloque el filete entre dos hojas de película adhesiva y golpee con un mazo de carne o un rodillo hasta que la mitad del grosor. Cortar la carne en trozos finos y colocar en un recipiente, luego sazone con la salsa de soja ligera, salsa de ostras, azúcar y sal y pimienta negra recién molida. Dejar de lado.", "Caliente un wok hasta que esté humeando y agregue una cucharada de aceite de cacahuete, luego agregue el ajo y el chile. Revuelva freír durante unos segundos, luego agregue las hojas de espinaca y mezcle durante unos segundos, hasta que se caliente. Apila en un plato grande.", "Vuelva a poner el wok en el fuego y agregue el aceite restante, luego agregue las rodajas de carne y saltee durante 2-3 minutos, o hasta que la carne esté cocida a su gusto. Vierta el vino de arroz Shaoxing y espolvoree sobre los copos de chile seco. Apila la carne sobre las hojas de espinaca.", "Para las setas de ostra, caliente el aceite en el wok y agregue las setas de ostra, revuelva freír durante un minuto. Agregue un pequeño chorrito de agua para crear un poco de vapor para ayudar a que los hongos se cocinen, luego sazone al gusto, con el vinagre de arroz negro y la salsa de soja liviana.", "Coloque las setas de ostra sobre la carne y sirva."]}, {"isVegetarian": false, "title": "Brochetas de carne con harissa y arroz limón", "url": "www_bbc_co_uk_food_recipes_beefkebabswithhariss_90875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 g / ½ oz de chiles rojos secos, empapados en agua fría, escurridos y toscamente picados", "50g / 2oz de chiles rojos frescos, sin semillas, picados", "2 cucharaditas de comino molido", "2 cucharaditas de semillas de alcaravea molidas", "1 cucharada de pimentón dulce ahumado", "2 dientes de ajo", "2 cucharadas de puré de tomate", "3 cucharadas de vinagre de vino tinto", "4 cucharadas de aceite de oliva", "800 g / 1 libra de filete de rape de 12 oz, cortado en cubos grandes", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cebollas rojas, cortadas en rodajas", "1 limón, solo jugo", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "275g / 10oz de arroz basmati", "1 limón, ralladura y jugo", "450ml / 16fl oz de caldo de pollo", "sal y pimienta negra recién molida", "3 cucharadas de hojas de cilantro, más o menos picadas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el Harissa, coloque todos los ingredientes Harissa en un procesador de alimentos y mezcle para hacer una pasta suave. Dejar de lado.", "Para los kebabs, caliente una sartén hasta que esté caliente. Coloque los cubos de carne en un recipiente y agregue el aceite de oliva y la sal y pimienta negra recién molida, al gusto. Mezcle para cubrir el bistec en el condimento y el aceite.", "Ensarte la carne en brochetas de metal, alternando con las rodajas de cebolla roja.", "Coloque los pinchos en la plancha y cocine en cada lado durante 1-2 minutos, o hasta que se cocinen a su gusto. Hilvanar con un poco de harissa cada 30 segundos más o menos. Una vez que la carne esté cocida, aprieta el jugo de limón.", "Para el arroz con limón, caliente una sartén con tapa a fuego medio, agregue la mantequilla, el aceite de oliva, la cebolla y el ajo y saltee durante dos minutos hasta que la cebolla y el ajo se ablanden, pero no se doren.", "Agregue el arroz, la ralladura de limón y el jugo a la sartén y mezcle bien. Agregue el caldo de pollo y cocine a fuego lento.", "Cubra, reduzca el fuego y cocine a fuego lento durante 12-15 minutos hasta que el arroz esté tierno y todo el líquido haya sido absorbido. Sazone con sal y pimienta negra recién molida, al gusto, luego agregue el cilantro.", "Sirva los pinchos con el arroz al lado y con una cucharada de harissa."]}, {"isVegetarian": false, "title": "Envolturas de tortilla de carne", "url": "www_bbc_co_uk_food_recipes_beefkoftasandguacamo_89140", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefkoftasandguacamo_89140_16x9.jpg", "ingredients": ["150 g / 5½oz de carne magra picada", "1 diente de ajo, finamente picado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 aguacate maduro, pelado, sin hueso, picado", "½ lima, solo jugo, más extra para servir", "1½ cucharadas de hojas de cilantro fresco picado", "2 tortillas de harina", "3 cucharadas de yogur natural", "1 lechuga Little Gem, hojas separadas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle la carne picada, el ajo, la sal y la pimienta en un bol. Luego, enrolle la carne en aproximadamente 6 bolas con sus manos. Frote la carne con aceite de oliva. Cocine en una sartén caliente durante 8-10 minutos, volteándolas regularmente, hasta que estén doradas y cocidas.", "Para el guacamole, coloque todos los ingredientes de guacamole en un tazón y mezcle hasta obtener una mezcla áspera con un tenedor.", "Unte las tortillas con el guacamole, rellene con la carne caliente y agregue un poco de yogur. Exprima un poco más de jugo de lima al gusto, agregue unas cuantas hojas de lechuga y luego enrolle la tortilla."]}, {"isVegetarian": false, "title": "Koftas de ternera con ensalada de higo y halloumi a la parrilla", "url": "www_bbc_co_uk_food_recipes_beefkoftaswithgrille_89762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["475 g / 1 libra de carne picada de 1 oz", "1 diente de ajo, picado", "½ cucharadita de cilantro molido", "1 cucharadita de comino molido", "sal y pimienta negra recién molida", "4 higos, en rodajas gruesas", "Halloumi de 200g / 7oz, rebanado grueso", "½ limón, solo jugo", "3 cucharadas de aceite de oliva virgen extra", "1 manojo de ensalada mixta de su elección"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remoje ocho pinchos de madera pequeños durante diez minutos en agua fría.", "Coloque la carne picada, el ajo, el cilantro y el comino en un recipiente y sazone bien con sal y pimienta negra recién molida. Mezcle bien, luego divida la mezcla en ocho porciones iguales.", "Presione cada porción de la mezcla de carne picada alrededor de un pincho de madera para formar una salchicha, tres cuartos de la longitud del pincho, luego coloque en un plato en la nevera para enfriar.", "Caliente una sartén hasta que esté caliente. Coloque los pinchos en la plancha y cocine durante 2-3 minutos en cada lado, o hasta que estén completamente cocidos.", "Calentar una sartén por separado hasta que esté caliente. Agregue las rodajas de higo y fría en cada lado durante 30 segundos.", "Retire los higos y déjelos a un lado, luego agregue el halloumi y cocine a cada lado por un minuto, o hasta que estén dorados por todas partes.", "Batir el jugo de limón, el aceite de oliva, la sal y la pimienta negra recién molida en un tazón limpio, luego agregar las hojas de la ensalada. Mezcle bien para cubrir.", "Para servir, coloque rodajas de higo y halloumi en el centro de cada plato. Coloque un montón de hojas de ensalada en la parte superior, luego cubra cada plato con dos koftas. Rocíe un poco del aderezo restante y sirva."]}, {"isVegetarian": false, "title": "Pastel de carne, cebolla y patata", "url": "www_bbc_co_uk_food_recipes_beefonionandpotatopa_77606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500 g / 1lb2oz de patatas", "sal", "Filete de grupa de 300g / 10oz, cortado en dados de 1cm / 0.5in o tiras", "2 cebollas, peladas y picadas", "4 ramitas de tomillo, hojas retiradas", "1 diente de ajo, picado", "200ml / 7fl oz de caldo de carne", "1 cucharada de ketchup de tomate", "salpicaduras de vino tinto", "2 x 28cm / 11 en círculos de masa de pasta brisa (los pasteles listos están bien)", "sal y pimienta negra recién molida", "2 huevos, golpeados"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Pele y corte las papas y hiérvalas en agua con sal durante 10 minutos hasta que estén sancochadas. Escurrir y poner a un lado.", "En una sartén caliente, dore la carne hasta que se dore bien, luego retírela de la sartén. Cocine las cebollas, el tomillo y el ajo hasta que se ablanden y agregue la carne.", "Vierta el caldo, el ketchup de tomate y un chorrito de vino tinto y deje que la mayor parte de la humedad hierva. Asegúrate de que la mezcla no esté demasiado líquida.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque las papas en rodajas en el círculo inferior de la masa, dejando un margen de 3.5cm / 1½ pulgadas alrededor del borde.", "Sazone las rodajas de patata mientras las coloca encima de la masa, debe terminar con una capa de papas de aproximadamente 2.5 cm / 1 pulgada de grosor. Ahora espolvoree la mezcla húmeda de carne y cebolla sobre la parte superior y extiéndala. Si lo ha reducido lo suficiente, los jugos no se escurrirán por los bordes.", "Coloque el otro círculo de masa en la parte superior y doble bien los bordes.", "Cepille generosamente con huevo lavado y marque cualquier patrón que desee en la masa. Corta un pequeño agujero en la parte superior para permitir que escape el vapor y hornea por 30 minutos."]}, {"isVegetarian": false, "title": "Carne de vaca Madras", "url": "www_bbc_co_uk_food_recipes_beefmadras_67360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de cacahuete", "2 cardamomos verdes (o negros si puedes conseguirlos)", "Corteza de cassia de 5 cm / 2 in de longitud o palito de canela", "1 cebolla mediana, pelada y en rodajas", "Filete de costilla de 255g / 9oz, cortado y cortado en tiras finas", "1 chile verde, picado", "2 dientes de ajo, pelados y en rodajas", "¼ cucharadita de cúrcuma", "¼ cucharadita de sal", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "2 cucharaditas de puré de tomate", "½ cucharadita de jengibre rallado pelado y rallado", "pizca de garam masala", "30 g / 1 oz de hojas frescas de cilantro, lavadas y picadas, para adornar"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en un wok o en una sartén grande, luego agregue los cardamomos y la cassia. Freír por 1 minuto.", "Incline las cebollas y fría por 1 minuto.", "Agregue la carne de res, seguido de la guindilla y el ajo, y fría a fuego medio durante 4 minutos.", "Luego agrega la cúrcuma, la sal, el comino y el cilantro y revuelve por un minuto más.", "Mezcle el puré de tomate con 150ml / 5fl oz de agua caliente (el doble de esta cantidad si desea más salsa) del hervidor y agregue a la sartén. Cocine por 3 minutos.", "Mezcle el jengibre y espolvoree sobre el garam masala y las hojas de cilantro.", "Sirva inmediatamente con un naan o en pan de pitta caliente."]}, {"isVegetarian": false, "title": "Carne picada", "url": "www_bbc_co_uk_food_recipes_beefrendang_78767", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefrendang_78767_16x9.jpg", "ingredients": ["1 cebolla, más o menos picada", "1 cucharada de jengibre fresco picado", "1 cucharada de galangal picado (u otra cucharada de la anterior)", "1 cucharada de ajo picado", "1 tallo de limoncillo, capa exterior dura eliminada y toscamente picada", "1 cucharadita de cúrcuma", "6 largos chiles secos rojos, remojados en agua y picados", "2 cucharadas de aceite de girasol", "1 ramita de canela", "6 cápsulas de cardamomo", "Filete de estofado de 650 g / 1 lb 7 oz, cortado en cubos de 2 cm / 1 pulgada", "4 hojas de lima kaffir", "ralladura de lima kaffir o lima", "Leche de coco 400ml / 14fl oz", "1 cucharada de pasta de tamarindo o jugo de lima", "Copos de coco desecados de 50g / 2oz", "ramitas de cilantro para decorar", "1 cucharada de aceite de girasol", "1 ramita de canela", "4 vainas de cardamomo", "250g / 9oz de arroz basmati", "600ml / 1pint 1½fl oz de agua", "2 cucharadas de cilantro fresco picado", "sal marina", "chalotes fritos", "1 chile rojo frito"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la pasta de rendang, coloca la cebolla, el jengibre, el galangal, el ajo, la hierba de limón, la cúrcuma y los chiles en un procesador de alimentos. Mezcle para formar un puré suave.", "Calentar un wok y agregar el aceite. Freír la pasta a fuego alto hasta que la pasta se vuelva más oscura y altamente aromática.", "Agregue las vainas de cardamomo (triture suavemente las vainas de cardamomo con el dorso de una cuchara antes de freírlas) y la rajita de canela partida por la mitad y cocine por un minuto más y luego agregue la carne.", "Freír la carne en la pasta revolviendo todo el tiempo, hasta que esté bien dorada.", "Verter sobre la leche de coco y el puré de tamarindo y llevar a fuego lento, agregar las hojas de lima kaffir y la ralladura.", "Sazone con sal, mezcle bien y luego reduzca a fuego lento.", "Cocine por entre una hora y una hora y media, revolviendo frecuentemente durante este tiempo. La carne debe ser muy tierna y la salsa realmente reducida y rica.", "Mientras tanto, tueste los copos de coco en una sartén seca. Mantén una estrecha vigilancia sobre esto, ya que se quemará muy rápido. Debería ser un precioso color marrón oscuro cuando esté listo. Mezcle hasta obtener un polvo en una licuadora pequeña o en una maza con mortero. Cuando el rendang esté listo mezcle con la mezcla asegurándose de que esté bien mezclado.", "Para el arroz Herby, lave muy bien el arroz con agua fría, el agua correrá limpia cuando se lave lo suficiente. Deje secar por goteo Caliente el aceite en una cacerola de base pesada que tenga una tapa ajustada.", "Agregue las especias y fría por un minuto.", "Agregue el arroz y fría hasta que los granos comiencen a ponerse blancos opacos.", "Agregue el agua y una buena pizca de sal.", "Llevar a ebullición y luego dejar burbujear hasta que casi toda el agua haya sido absorbida y los agujeros de aire comiencen a aparecer.", "En este punto, abre la tapa. Deje el calor debajo durante un minuto (esto creará mucho vapor) y luego déjelo reposar por cinco minutos (no quite la tapa).", "Mantenga caliente hasta que todo lo demás esté listo. Puedes sostener el arroz así por hasta media hora.", "Para servir, mezcle las hierbas en el arroz y divida entre cuatro platos que sirven calientes. Siguiente cuchara en el rendang, terminar con unas ramitas de cilantro y servir inmediatamente, adornado con los chalotes fritos y el chile."]}, {"isVegetarian": false, "title": "Pastel de carne de res, ostras y cerveza", "url": "www_bbc_co_uk_food_recipes_beefoysterandalepie_92453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2lb filete de carne de vaca 2 oz, picado", "sal y pimienta negra recién molida", "Aceite vegetal 50ml / 2floz", "Tocino ahumado de 175g / 6oz, cortado en lardons grandes", "125g / 4½oz de cebolla picada", "125g / 4½oz de zanahorias, peladas, cortadas en porras", "1-2 dientes de ajo, pelados, picados", "125g / 4½ oz de champiñones para bebés", "Harina normal de 25g / 1oz", "500ml / 17½fl oz de cerveza oscura", "1 cucharada de caldo de pollo en polvo", "2 litros / 3½ pintas de agua hirviendo", "1 ramo grande de garni (hojas de laurel, perejil y tomillo, atados con hilo de cocina)", "1 cucharada de mostaza integral", "350g / 12oz de patatas nuevas, las más grandes se redujeron a la mitad", "1 cucharadita de estragón, hojas solo, picadas", "12 ostras frescas grandes, descascaradas", "250 g / 9 oz de hojaldre laminado", "1 huevo de gallinas camperas, más 1 yema de huevo, batidos juntos con una pizca de sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sazonar la carne con sal y pimienta negra recién molida. Caliente una sartén grande hasta que esté caliente, luego agregue el aceite vegetal y fría la carne durante 2-3 minutos, volteándola de vez en cuando, hasta que se dore por todas partes.", "Agregue el tocino ahumado y fría por otros 1-2 minutos, luego agregue la cebolla, zanahorias, ajo y champiñones. Freír por 2-3 minutos, luego agregar la harina y mezclar bien para evitar que se formen grumos. Cocine por un minuto más.", "Vierta la cerveza oscura, hierva y cocine por 8-10 minutos, o hasta que se reduzca a la mitad. Disuelva el caldo de pollo en polvo en el agua, luego agregue a la sartén junto con el bouquet garni, la mostaza integral y las papas nuevas. Llevar a ebullición y sazonar con sal y pimienta negra recién molida, luego reducir a fuego lento y cocinar durante dos horas, o hasta que la carne esté tierna.", "Agregue el estragón picado a la sartén y sazone al gusto, si es necesario. Retire la sartén del fuego y déjela enfriar. Deseche el ramo garni.", "Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la mezcla de carne de res en un molde para pastel de 20cm x 15cm / 8in x 6in y agregue las ostras, doblándolas suavemente en la mezcla de carne.", "Estire la masa de hojaldre hasta que tenga un grosor de 3 mm, luego corte pedazos de masa lo suficientemente grandes para que quepan sobre la parte superior de los platos de tarta como una tapa, con un poco de saliente. Prensar los bordes con los dedos, asegurando la masa al plato.", "Pinche la superficie de la masa con un tenedor, luego cepille con el huevo batido. Coloque los pasteles en una bandeja para hornear y hornee en el horno durante 20 minutos, o hasta que la masa esté dorada y crujiente.", "Sirva los pasteles con los lados de vegetales verdes de temporada ligeramente hervidos, como las judías verdes, el brócoli o las espinacas."]}, {"isVegetarian": false, "title": "Rendang de carne con ensalada de hierbas tailandesas y arroz pegajoso", "url": "www_bbc_co_uk_food_recipes_beefrendangwithlemon_90061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tallos de limoncillo, toscamente picados", "20g / ¾oz semillas de cilantro", "½ cucharadita de semillas de comino", "½ cucharadita de polvo de cúrcuma", "50g / 2oz bloque crema de coco", "1½ cebollas grandes, en rodajas", "3 dientes de ajo picados", "3 chiles rojos, sin semillas, picados", "1 pedazo de jengibre, pelado y picado", "1 hoja de laurel", "Espinilla de buey deshuesada de 750 g / 1 lb 10 oz, cortada en cubos de 2.5 cm / 1 in", "400 g / 14 oz de leche de coco enlatada", "250ml / 8¾fl oz de ternera fuerte o caldo de carne, calentado", "Col de China 110g / 4oz, rallado", "2 hojas de lima, cortadas en tiras finas", "2 chiles rojos, semillas eliminadas, cortadas en tiras finas", "Brotes de 25 g / 1 oz de guisantes", "50 g / 2 oz de hojas de mizuna", "pequeñas hojas de menta", "1 cebolleta, cortada diagonalmente", "50g / 2oz de judías verdes, cortadas en pedazos de 2cm / 1in", "pequeñas hojas de cilantro fresco", "pequeñas hojas frescas de albahaca tailandesa (o hojas de albahaca normales)", "pequeños brotes de soja puñado", "1 lima, solo jugo", "1 cucharadita de aceite de girasol", "1 cucharadita de salsa de pescado", "1 chile rojo, finamente cortado en cubos", "1 diente de ajo, finamente cortado", "200g / 7oz de arroz jazmín tailandés", "Arroz pegajoso tailandés 200g / 7oz", "1 cucharadita de sal"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para el desgarro de la carne, machaque la hierba de limón hasta obtener una pulpa usando un mortero y un mortero. Incline el lemongrass en un tazón pequeño.", "Calentar la sartén a fuego medio. Agregue el cilantro, las semillas de comino y la cúrcuma y fría hasta que estén fragantes. Incline las especias en un molinillo de especias o la mano de mortero. Muela las especias hasta obtener un polvo si usa un molinillo, o machaque en un mortero hasta que las especias estén lo más lisas posible. Dejar de lado.", "En una sartén ancha o wok de hierro fundido, caliente el bloque de crema de coco hasta que se derrita, manteniendo el fuego bajo para que no se queme.", "Agregue las cebollas, el ajo, los chiles, el jengibre y el limoncillo machacado a la sartén y cocine suavemente hasta que las cebollas se hayan suavizado y la mezcla esté fragante.", "Agregue las especias molidas reservadas y la hoja de laurel y fría por unos minutos más.", "Agregue la carne y aumente el calor para que se dore por todos lados. Revuelva hasta que la carne esté completamente cubierta con las especias; esto llevará unos minutos.", "Agregue la leche de coco, lleve a ebullición, luego agregue el caldo caliente.", "Encienda el fuego y continúe cocinando durante al menos 1- 1½ horas, revolviendo ocasionalmente hasta que la salsa se espese y cubra bien la carne.", "Para la ensalada, combine todos los ingredientes de la ensalada en una ensaladera y mezcle bien. Dejar de lado.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón. Dejar de lado.", "Para el arroz pegajoso, incline el arroz en un colador y lave las dos variedades de arroz tres veces, drenando cada vez.", "Coloque el arroz en una cacerola y cúbralo con agua para dejar 1 cm / ½ en agua por encima del nivel del arroz. Agregue la sal y cubra con una tapa. Coloque a fuego alto y lleve a ebullición.", "Hierva el arroz por cinco minutos, luego, sin quitar la tapa, apague el fuego y déjelo hervir durante 20 minutos.", "Para servir, vierta el aderezo en la ensalada y mezcle para combinar. Acumule el arroz en cuatro platos y espolvoree la carne desgarrada al costado. Sirve la ensalada por separado."]}, {"isVegetarian": false, "title": "Rollitos de carne en tomate ragù", "url": "www_bbc_co_uk_food_recipes_beefrollsintomatorag_67356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 solomillo pequeño", "30 g / 1 oz de queso parmesano, rallado", "4 dientes de ajo, finamente picados", "puñado de perejil, desgarrado", "sal y pimienta recién molida", "6 cucharadas de aceite de oliva", "150ml / ¼ de pinta de vino tinto", "1 cebolla, finamente picada", "1 tallo de apio, muy finamente picado", "2 cucharadas de puré de tomate diluido en 400ml / 14fl oz de agua tibia", "2x400g latas de tomates picados", "puñado de hojas de albahaca fresca, rasgada"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las rebanadas de carne en una tabla de cortar o en una superficie de trabajo limpia y aplánelas con un ablandador de carne (si no tiene una, coloque una espátula plana de madera sobre la carne y golpee con la palma de su mano). Sazone con sal y pimienta, luego espolvoree con parmesano rallado, ajo y perejil. Ruede cada rebanada con fuerza y ​​asegúrala bien con palillos de dientes.", "Para la salsa, caliente el aceite de oliva en una olla grande. Cuando esté caliente, baje el fuego, agregue los rollos de carne y selle bien en todos los lados. Aumente el fuego otra vez, agregue el vino y cocine a fuego lento hasta que se haya reducido a la mitad. Retire la carne y reserve.", "Agregue la cebolla y el apio a la sartén y mezcle bien. Cocine hasta que el resto del vino casi se haya evaporado, luego coloque la carne en la sartén y vierta sobre el concentrado de tomate diluido y los tomates picados. Sazonar con sal y pimienta y agregar la albahaca. Baje el fuego y cubra con una tapa, pero no completamente, para que parte del vapor pueda escapar. Cocine suavemente durante 2 horas, revolviendo de vez en cuando. Verifica el condimento.", "Sirva la salsa de tomate con pasta cocida como tallarines o rigatoni grande. Luego sirva los rollos de carne como plato principal con una ensalada mixta de hojas."]}, {"isVegetarian": false, "title": "Satay de carne con fideos crujientes", "url": "www_bbc_co_uk_food_recipes_beefsataywithcrispyn_87139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7oz de costilla de res cortada en tiras", "½ cucharada de salsa de soja", "2 cucharadas de miel", "½ cucharadita de copos de chile", "1 cucharada de aceite de sésamo", "1 lima, ralladura y jugo", "1 cucharada de aceite de oliva", "300ml / ½ pinta de aceite vegetal, para freír", "Fideos de arroz de 50g / 2oz", "1 cucharada de cacahuetes picados, para adornar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para la satay de carne, coloque la carne en un tazón pequeño con la salsa de soja, miel, hojuelas de chile, aceite de sésamo, jugo de limón y ralladura y déjelo marinar durante diez minutos.", "Ensarte la carne en brochetas que hayan sido remojadas en agua. Calentar el aceite de oliva en una sartén, agregar los pinchos y dorarlos por todos lados durante 1-2 minutos.", "Para los fideos, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, deje caer los fideos y cocine durante dos minutos, o hasta que estén hinchados y crujientes. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para servir, amontone los fideos en un plato para servir, cubra con los kebabs satay de carne de res y espolvoree con cacahuates picados."]}]