[{"isVegetarian": true, "title": "Cocktail nachos", "url": "www_bbc_co_uk_food_recipes_cocktailnachos_73331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/3½oz cheddar cheese", "50g/2oz pickled green jalapeno chillies", "20 salted corn tortilla chips", "2 tbsp chilli salsa", "fresh coriander leaves, for serving"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Coarsely grate the cheddar cheese and finely slice the jalapeno chillies. ", "Lay out the unbroken corn chips on a baking tray, and top each one with a little grated cheese and two slices of jalapeno chilli.", "Bake for 5-10 minutes or until the cheese melts and the corn chips are hot and crisp.", "Add a dab of chilli salsa and a coriander leaf, and serve hot."]}, {"isVegetarian": true, "title": "Cocoa cinnamon bread and butter pudding with butterscotch pears, Chantilly cream and a warm chocolate sauce", "url": "www_bbc_co_uk_food_recipes_cocoa_cinnamon_bread_and_32214", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 loaf sliced white bread", "110g/4oz unsalted butter, softened", "300ml/10fl oz full-fat milk", "300ml/10fl oz double cream", "1 drop vanilla extract ", "1 tsp ground cinnamon", "20g/1oz cocoa powder", "5 free-range eggs", "100g/3½oz caster sugar", "100g/3½oz caster sugar", "100g/3½oz unsalted butter", "100ml/3½fl oz double cream", "2 pears, core removed and sliced  ", "200ml/7fl oz double cream", "25g/1oz icing sugar", "1 drop vanilla extract ", "50g/2oz cocoa powder", "100ml/3½fl oz water", "2 tsp double cream"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cocoa bread and butter pudding, remove all the crusts from the bread and spread one side of each slice with butter. Cut into triangles and lay them, overlapping, in the bottom of an ovenproof dish lightly greased with butter.", "Place the milk, cream, vanilla, cinnamon and cocoa powder in a large saucepan and warm through.", "Put the eggs and sugar in a large bowl and whisk until pale and doubled in size.", "Gradually add the liquid to the eggs whisking all the time. Pour back in to the pan and gently cook until the custard is thick enough to coat the back of a spoon.", "Pour the custard mixture over the bread and leave to sit for 30 minutes, then bake in the oven for 20-30 minutes.", "For the butterscotch roasted pears, place the sugar and butter in a medium frying pan and heat until melted.", "Add the cream and cook for 3-4 minutes, then add the pears and cook for a further 10 minutes.", "To make the Chantilly cream put in the cream, icing sugar and vanilla extract in a large bowl and whisk until stiff peaks form when the whisk is removed.", "For the chocolate sauce, place the cocoa and water in a small saucepan and cook until it thickens. Add the cream. ", "To serve, place a square of the pudding in bowl, pour over the sauce and top with a spoonful of the cream."]}, {"isVegetarian": true, "title": "Coconut-curried vegetables", "url": "www_bbc_co_uk_food_recipes_coconut-curried_82286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "1 small red onion, peeled, finely sliced", "1 small aubergine, trimmed, diced into 2cm/¾in cubes", "1 tbsp garam masala", "1 tsp ground cumin", "1 tsp coriander seeds", "150g/5oz okra", "150g/5oz cauliflower florets", "75g/3oz frozen peas", "1 tsp ground turmeric", "50g/2oz dried coconut, grated", "½ vegetable stock cube, dissolved in 200ml/7fl oz water", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of vegetable oil in a large lidded saucepan over a medium heat. Add the red onion, aubergine and garam masala and fry until starting to brown, about 8-10 minutes.", "Dry fry the cumin and coriander seeds in a small frying pan until fragrant, then add to the onion mixture and stir well.", "Add the remaining ingredients, stirring well to combine, then cover the pan with a lid.", "Bring the mixture to a simmer and cook for 15-20 minutes, stirring occasionally, until the cauliflower florets are tender. Season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Coconut and citrus tart with cherry, pineapple, raspberry and coconut fruit salad", "url": "www_bbc_co_uk_food_recipes_coconut_and_citrus_tart_19669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 readymade (22cm/8½in) pastry case ", "25g/1oz fresh coconut, finely grated, to decorate", "small fresh mint leaves, to decorate", "200g/7oz caster sugar", "370ml/13fl oz double cream", "3 free-range eggs, beaten", "2 limes, juice and finely grated zest", "2 unwaxed lemons, juice and finely grated zest", "200g/10½oz desiccated coconut", "100g/3½oz fresh cherries, pitted", "100g/3½oz raspberries", "100g/3½oz pineapple, cut into bite-sized pieces", "100ml/3½fl oz vanilla syrup", "2 dashes angostura bitters"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking paper and put the pastry case on top. ", "Beat all the tart filling ingredients together and pour into the pastry case. Bake for 40–50 minutes, or until set. ", "To make the fruit salad, put all the fruit in a large bowl and stir in the vanilla syrup and angostura bitters. ", "Serve the tart sliced, with the fruit salad on the side, decorated with the coconut and mint leaves. "]}, {"isVegetarian": false, "title": "Coconut and lime traybake", "url": "www_bbc_co_uk_food_recipes_coconut_and_lime_56467", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 limes, juice and zest only", "1 tsp ground cinnamon", "1 tsp ground mixed spice", "½ tsp ground cloves", "100g/3½oz desiccated coconut", "230g/8oz self-raising flour", "2 tsp baking powder", "230g/8oz golden caster sugar", "230g/8oz butter", "70g/2½oz coconut butter", "4 large free-range eggs, lightly whisked", "50g/1¾oz unsalted butter", "175g/6oz icing sugar", "250g/9oz mascarpone cheese", "green fondant icing", "brown fondant icing", "chocolate beans", "1 lime, zest only"], "serves": "Makes 1 x 12-slice traybake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C Fan/Gas 4 and line a 30x23x4cm/12x9x1½in baking tin with two pieces of aluminium foil, overlapping in the middle.", "In a bowl, mix the lime juice, zest, the spices and desiccated coconut together and leave to soak.", "Sift the flour and baking powder into a separate large bowl and set aside.", "Put the sugar, butter and coconut butter in a food processor and pulse until smooth. Transfer to the bowl of dry ingredients and mix until well combined. Fold in the eggs and soaked coconut mixture.    ", "Spoon the mixture into the prepared tin and bake for about 30 minutes, or until a skewer inserted into the middle comes out clean.", "Leave to cool in the tin for about 5 minutes then turn out onto a wire rack. Remove the foil and leave to cool completely.", "For the icing, put all the ingredients into a food processor and pulse until smooth.", "When the cake is completely cool, spread the icing all over the top. Trim the cake and cut into 12 equally-sized squares.", "For the decoration, roll out both coloured fondants.  Use the green to cut out 48 ‘leaves’ and the brown to cut out 12 ‘trunks’.", "Decorate each square of cake with the fondants to make a palm tree ‘trunk’ and ‘leaves’. Use the chocolate beans to represent coconuts and finish by sprinkling over a little lime zest."]}, {"isVegetarian": true, "title": "Coconut and sticky rice pudding with lime and papaya salad", "url": "www_bbc_co_uk_food_recipes_coconut_and_sticky_rice_52999", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Thai sticky rice", "1 x 400ml/14fl oz can coconut milk ", "¼ tsp salt", "50g/1¾oz palm sugar, roughly chopped if from a block", "5 kaffir lime leaves", "1 ripe medium papaya, seeds removed, peeled, cut into 5mm/¼in neat slices", "2 limes, zest and juice only", "4 sprigs mint, for garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Soak the rice in 300ml/10fl oz of water for at least 30 minutes, but for up to four hours before using. ", "Drain the rice and wash thoroughly.", "Line a bamboo steamer (with a lid)  with either greaseproof paper, a banana leaf or a clean sheet of muslin. If using greaseproof paper or a banana leaf, pierce some holes using a skewer (don’t make the holes too large, but you do want them to allow the steam through).", "Place about 425ml/¾ pint of water (5cm/2in depth) into a saucepan or a wok and place the rice in the steamer. Put on the lid, bring the water to the boil and then reduce the heat to low-medium and steam for about 20 minutes.", "In the meantime, add the coconut milk, salt, palm sugar and kaffir lime leaves to a saucepan. Warm through over a medium heat - do not boil. ", "Stir frequently for a good 5-7 minutes to infuse the flavours. Once infused, remove from the heat.", "Arrange the prepared papaya onto four plates or a suitable serving dish and pour over the zest and juice of the limes.", "Once the rice is cooked, put it into a mixing bowl and gradually add three-quarters of the infused coconut milk. Reserve the remaining quarter.  ", "Mix well and leave to cool for 10-15 minutes. Transfer the rice into individual serving bowls or a suitable dish and drizzle over the remaining infused coconut milk.", "Serve the papaya salad along with the rice. Garnish with a sprig of mint if liked."]}, {"isVegetarian": false, "title": "Coconut chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_coconut_chicken_noodle_20610", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_chicken_noodle_20610_16x9.jpg", "ingredients": ["1 nest medium egg noodles", "3 spring onions, chopped", "200ml/7fl oz coconut milk", "200ml/7fl oz chicken stock made with ½ a stock cube", "1-2 chicken thighs or drumsticks, skin removed", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the kettle. Break up the noodles and put into a bowl. Cover with boiling water, set aside, and allow the noodles to soften completely - about 10 minutes. ", "Meanwhile, add the white part of the spring onion to a saucepan with the coconut milk, stock and a twist of black pepper. Bring to a simmer, add the chicken thighs and cook for 15-20 minutes. Don’t boil it or the chicken will be tough and the coconut milk will separate (If you use boneless chicken thighs simmer for 8-10 minutes).", "Remove the chicken from the saucepan and check that it is completely cooked. If it’s pink near the bone, return it to the stock for another 5 minutes. When cooked, set the chicken thighs aside to cool slightly.", "Drain the noodles and add them to the coconut liquid. Chop the chicken from the bone and stir into the soup with the green part of the spring onion. Season with salt and black pepper."]}, {"isVegetarian": true, "title": "Coconut pancakes with mango and passion fruit curd", "url": "www_bbc_co_uk_food_recipes_coconut_pancakes_with_70485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½ plain flour", "15g/½oz caster sugar", "pinch of salt ", "4 medium free-range eggs", "350ml/12fl oz full-fat milk", "2 tbsp desiccated coconut, toasted", "butter, for frying", "8 large free-range egg yolks", "120g/4½oz caster sugar", "160ml/5½fl oz mango juice", "110ml/3½fl oz passion fruit juice", "250g/9oz unsalted butter", "fresh pineapple, thinly sliced", "fresh mint, leaves picked", "dusting of icing sugar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, combine the flour, sugar and salt together, then mix in the eggs with a whisk. Add the milk gradually to avoid any lumps, then stir in the toasted coconut. Leave to rest while you make the curd.", "To make the curd, whisk the eggs, sugar, mango and passion fruit juices together in a saucepan. Place over a medium heat and stir continuously until the mixture thickens - do not boil. Whisk in the butter, cut into small pieces. Cover and leave to cool. ", "To cook the pancakes, add a smear of melted butter to a non-stick pan and ladle in some batter, swirling around to coat the pan - it might take one or two test pancakes before you’ve got the amount of batter just right. Cook each pancake on both sides until golden-brown and then remove to a plate while you cook the next pancake.", "To assemble, spread each pancake with the fruit curd and then roll up into cigars. Serve with fresh pineapple, mint leaves and a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Coconut kisses with ginger filly Chantilly and a strawberry slice", "url": "www_bbc_co_uk_food_recipes_coconut_kisses_with_93280", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_kisses_with_93280_16x9.jpg", "ingredients": ["100g/3½oz desiccated coconut", "200g/7oz caster sugar", "4 free-range egg whites", "200g/7oz low-fat cream cheese", "2½ tsp icing sugar", "1 vanilla pod, seeds only", "2 knobs stem ginger (from a jar in syrup), really finely diced, plus 1 tbsp of the ginger syrup", "8 medium-large strawberries, hulled, pointed ends trimmed and each one cut into 3 discs"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringues, preheat the oven to 110C/225F/Gas ¼ (80C fan). Line two large baking trays with parchment paper and set aside.", "Heat a large frying pan (without any oil in it) over a medium heat and toast the coconut for a few minutes until golden-brown and toasty. Tip into a bowl and set aside. ", "Meringues can be made by hand but it does take a long time. Using a hand whisk or a freestanding mixer makes the whole thing far more enjoyable. Put the sugar and one of the egg whites into a clean bowl and whisk for about 30 seconds on a high speed. Add another egg white and whisk for about two minutes more. The mixture will start to become quite thick. Add the remaining egg whites, one at a time beating really well between each addition. Whisk until the mixture is really, really stiff, white and shiny. It should become so stiff that if you turned the bowl upside down the meringue would not come out! It does take slightly longer to whisk it this way and it is a backward way of making meringues but the beauty of it is you cannot over-whisk this mixture even if you went off and left it for 15 minutes or so, so this method seems to work well for me! Finally, gently fold in the coconut until well combined. ", "Using a large spoon, scoop the mixture into a piping bag which has been fitted with a 1½cm/¾in plain nozzle. Pipe out 48 blobs spaced apart on the baking trays with each one measuring 3-4cm/1¼-1½in wide and with a little peak on the top (to be about 2cm/¾in in height). Bake for around 1 hour 30 minutes, or until the meringues are crisp on the outside but still a little soft on the inside. Swap the trays around on the shelves half way through the cooking time to ensure even cooking.", "When the meringues are cooked, take them out of the oven and set aside to cool down. As they cool, make the ginger filly Chantilly. Mix all of the ingredients, except the strawberries, together well in a bowl and spoon the mixture into a piping bag fitted with a 1½cm/¾in plain nozzle. Pop into the fridge until ready to assemble.", "Once the meringues are completely cool, pipe a small blob of the ginger filly on the bottom of two meringue pieces. Place a slice of strawberry on one of the filly Chantillys and then sandwich it together with the other meringue. Repeat with the remaining meringues and filling to make 24 in total, arranging them on a large platter as you go. Serve straight away. "]}, {"isVegetarian": true, "title": "Coconut, fennel and pistachio biscotti", "url": "www_bbc_co_uk_food_recipes_coconut_fennel_and_40895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35g/1¼oz coconut chips", "120g/4½oz unsalted pistachios, shelled", "4 tbsp fennel seeds", "110g/4oz unsalted butter, at room temperature ", "200g/7oz caster sugar", "2 large free-range eggs ", "1 tsp coconut essence ", "440g/15½oz plain flour", "1 tsp baking powder", "½ tsp table salt", "200g/7oz dark chocolate (minimum 70% cocoa powder)", "330g/11½oz caster sugar", "50g/1¾oz unsalted butter", "200g/7oz desiccated coconut, toasted", "½ tsp bicarbonate of soda"], "serves": "Makes 24 biscotti", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Put the coconut chips in a dry frying pan and toast them until golden-brown, stirring regularly. Toast the pistachios and fennel seeds in the same way, then transfer the pistachios and fennel seeds to a food processor and pulse until they are just broken.  Set aside to cool.", "In a large bowl, cream together butter and sugar until pale and fluffy. Mix in the eggs and coconut essence.", "Combine the flour, baking powder, salt, toasted coconut, pistachios and three-quarters of the fennel seeds. Add to the butter mixture and mix until well combined (the mixture will be quite stiff so you will find it easier to use an electric mixer). Divide the dough into 2 equal mounds.", "Line 2 baking trays with baking parchment. Place a mound of dough onto each tray and shape them into a rectangle approximately 25x8cm/10x3¼in. Bake for 35 minutes.", "Remove the dough from the oven and set aside to cool on the tray for 15 minutes. Reduce the oven temperature to 160C/140C Fan/Gas 2.", "Slice each log into pieces about 1cm/½in thick. Each log should produce about 12 biscotti. ", "Place the pieces cut-side down on the baking trays and return them to the oven. Bake for 10 minutes on each side, or until they are golden-brown and crisp. Leave to cool on a wire rack.", "For the coconut brittle, line a baking tray with non-stick baking paper.", "Add the sugar, butter and 125ml/4½oz water to a large saucepan. Heat gently until the sugar dissolves. Using a sugar thermometer, continue to heat the mixture to 160C, or until a caramel forms. Remove from the heat immediately and stir in the coconut. Stir in the bicarbonate of soda – the caramel will start to foam so take care not to burn yourself, melted sugar is very hot. Pour onto the prepared tray and leave to cool. ", "When cool, break the brittle into large pieces and add to a food processor. Add the reserved fennel seeds and pulse until broken into a coarse powder.  Transfer to a shallow dish.", "Melt the dark chocolate in a heatproof bowl over a pan of simmering water. Dip the long side of the biscotti in the melted chocolate and then into the coconut brittle. Set aside until the chocolate is set, then serve."]}, {"isVegetarian": false, "title": "Coconut crab with stone bass", "url": "www_bbc_co_uk_food_recipes_coconut_crab_with_stone_52229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz desiccated coconut", "4 cloves", "2 sprigs curry leaves, leaves picked", "1 tsp turmeric", "2 tbsp vegetable oil", "2 onions, finely sliced", "2 green chillies, finely sliced", "2 tbsp tamarind paste", "2 tbsp palm sugar", "400ml/14fl oz coconut milk", "300g/11oz fresh white crab meat, picked", "2 tbsp coriander leaves, roughly chopped", "1 lime, juice only", "4 x 200g/7oz stone bass fillet, skin on", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until medium hot, add two thirds of the coconut, with the cloves, curry leaves and turmeric and fry until golden-brown.", "Place into a small food processor or grinder and blitz to a fine powder.", "Heat a sauté pan or wok until hot, add the vegetable oil and onions and fry until golden-brown.", "Add the chillies and the remaining desiccated coconut and fry for one minute.", "Add the tamarind paste, palm sugar and coconut milk and bring to a simmer.", "Cook for 2-3 minutes until thickened then stir in the crab meat and coriander and season with a little lime juice, salt and black pepper.", "Season the stone bass fillet with salt and black pepper.", "Heat a frying pan until medium hot, add the stone bass skin side down and cook for two minutes, then turn over and cook the other side for two more minutes.", "To serve, spoon the crab curry onto the plate, then top with the stone bass and finish with a sprinkling of coriander cress."]}, {"isVegetarian": false, "title": "Coconut panna cotta with blood oranges and doughnuts", "url": "www_bbc_co_uk_food_recipes_coconut_panna_cotta_with_35812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "225ml/8fl oz coconut milk", "2 gelatine leaves, soaked in water for at least five minutes", "300ml/10fl oz buttermilk", "250g/9fl oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "1 tsp fast-action yeast", "vegetable oil, for deep frying", "50g/1¾oz unsalted butter", "3 blood oranges, 1 zested, then peeled and cut into slices, and 2 juiced", "1 lemon, zest and juice only", "3 tbsp caster sugar", "2 tbsp orange liqueur ", "2 tbsp icing sugar", "2 tbsp brandy ", "25g/1oz fresh coconut, grated", "25g/1oz caster sugar", "4 sprigs fresh mint"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the coconut panna cotta, heat the double cream, vanilla pod and seeds and the coconut milk in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk. Whisk until well combined.", "Pass the mixture through a fine sieve then pour the mixture into dariole moulds or ramekins and chill in the fridge for at least two hours.", "For the mini doughnuts, combine the flour, salt and caster sugar in a large bowl. Mix in the butter, 150ml/5½fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Heat the oil in a deep-fat fryer to 150C/320F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: do not leave hot oil unattended.) ", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Meanwhile, for the oranges and sauce, heat a frying pan until hot, add the butter, orange zest and juice, lemon zest and juice and the caster sugar. Stir in the orange liqueur and brandy. Cook for a few minutes until just thickened and bubbling, then remove the pan from the heat.", "Dust the sliced oranges with icing sugar and char using a blow torch or hot grill until caramelised.", "To serve, when the excess oil has drained off the doughnuts, place them onto a plate and dust with the caster sugar and coconut until completely coated.", "Remove the panna cotta from the moulds and turn out into the centre of serving plates. Serve with the mini doughnuts and charred oranges and sauce. Garnish with fresh mint."]}, {"isVegetarian": false, "title": "Coconut prawn curry with cauliflower 'rice'", "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_with_58477", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_with_58477_16x9.jpg", "ingredients": ["1 tbsp light olive oil", "1 onion, roughly chopped", "2 garlic cloves, finely chopped", "2 level tbsp medium curry paste", "2 tbsp tomato purée", "200ml/7fl oz chicken or vegetable stock", "200ml tin reduced fat coconut milk", "1 courgette, cut into 1cm/½in cubes", "400g/14oz raw tiger prawns, peeled (defrosted if frozen)", "salt and freshly ground black pepper", "800g/1lb 12oz cauliflower florets", "1 tsp light olive oil", "1 tbsp pilau spice seasoning ", "6 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan. Add the onion and garlic and cook over a medium heat for 2–3 minutes, or until softened. Add the curry paste and fry for 30 seconds. Add the tomato purée, stock, coconut milk and courgette and simmer for 10 minutes.", "Add the prawns and cook for 4–5 minutes, or until pink and cooked through. Season.", "Meanwhile, to make the pilau, pulse the cauliflower in a food processor until the size of rice. Place in a large, heatproof bowl, cover with cling film, then pierce and microwave on high for 6–8 minutes.", "Heat the oil in a wide frying pan over a medium heat. Fry the pilau seasoning and cauliflower ‘rice’ for 6–7 minutes, or until piping hot. Remove from the heat and stir in the coriander. ", "Serve the curry with the 'rice'."]}, {"isVegetarian": false, "title": "Prawns with freshly grated coconut, green chillies and mustard seeds (Chingri daab)", "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_69561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_69561_16x9.jpg", "ingredients": ["2 tbsp black mustard seeds", "4–6 tbsp vegetable oil", "1 onion, thinly sliced", "1 tsp ground turmeric", "250ml/9fl oz coconut milk", "250g/9oz fresh or frozen coconut flesh, blitzed in a food processor or grated", "1 tsp salt", "350g/12oz peeled raw prawns", "4 fresh green chillies, with seeds, cut lengthways into sixths", "handful chopped coriander, to finish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the mustard seeds into a mini-food processor and add two tablespoons of water. Blend for a minute and then add another two tablespoons of water and continue blending until the seeds start to break up (this can take a minute or two of persistent blending; add more water if you’re having trouble). Keep blending until you have a rough paste that resembles wholegrain mustard, adding a splash more water if needed. Set aside.", "Heat the vegetable oil in a heavy-based saucepan or karahi over a low-medium heat. Add the onion and fry for 10 minutes. Add the blended mustard paste, turmeric, coconut milk, grated coconut and salt. Bring to a boil then simmer for 4-5 minutes.", "Add the prawns and green chillies and simmer for a further 3-4 minutes, or until the prawns are pink and cooked through. Scatter with coriander and serve."]}, {"isVegetarian": false, "title": "Coconut, raspberry and lemon meringue trifle", "url": "www_bbc_co_uk_food_recipes_coconut_raspberry_and_77291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium free-range eggs, separated", "250g/9oz caster sugar", "½ tsp salt ", "230g/8oz plain flour", "1 tsp baking powder", "50g/1¾oz raspberries, crushed ", "2 tbsp desiccated coconut", "butter, for greasing", "4 unwaxed lemons", "100g/3½oz unsalted butter", "200g/7oz unrefined caster sugar ", "3 whole free-range medium eggs, plus 1 free-range egg yolk", "50g/1¾oz sugar ", "3 punnets raspberries, chopped", "3 punnets strawberries, chopped ", "600ml/20fl oz full-fat milk", "600ml/20fl oz double cream", "1 vanilla pod", "3 tbsp cornflour", "4 large free-range egg yolks", "75g/2½oz caster sugar", "600ml/20fl oz double cream", "1 punnet raspberries", "50ml/2fl oz coconut milk", "13 tbsp icing sugar", "10 tbsp ground almonds", "2 medium free-range egg whites", "pinch cream of tartar", "3⅓ tbsp caster sugar ", "yellow gel colouring", "2 free-range egg whites", "100g/3½oz caster sugar", "10-15 raspberries, to decorate "], "serves": "Makes 1 large trifle", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the raspberry and coconut lady fingers, preheat the oven to 190C/170(fan)/Gas 5. ", "In a large bowl, whisk the egg yolks with half of the sugar until light and fluffy.", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Gradually add the salt and remaining sugar until firm peaks form when the whisk is removed.", "Fold the egg whites into the egg yolk mixture. Sieve the flour and baking powder over the mixture and fold until just incorporated. Fold in the crushed raspberries and the coconut.", "Fill a piping bag with the mixture and pipe 10cm/4in lengths onto a greased baking tray. ", "Bake for 15 minutes, or until golden-brown. Remove from the oven and cool on a wire rack.", "For the lemon curd, zest and juice the lemons. Add the zest and juice, butter and sugar to a heatproof bowl. Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl. Stir until the butter is melted.", "Lightly whisk the eggs and yolk in a bowl. Whisk them into the lemon mixture and then cook for 10-13 minutes, or until thickened, stirring occasionally. Remove the lemon curd from the heat and set aside to cool. Any lemon curd that isn’t used for this recipe can be spooned into sterilised jars, sealed and stored in the fridge.", "For the strawberry and raspberry glaze, add the sugar to 50ml/1¾fl oz of water in a pan and dissolve the sugar over a simmering heat. Simmer until the mixture has thickened, then pour it over the soft fruit in a bowl. Set aside.", "For the custard, heat the milk, cream and vanilla in pan until just below the boiling point..", "Mix together the cornflour and two tablespoons of cold water together in a small bowl. Set aside.", "Whisk the egg yolks and sugar in large bowl. Slowly add the milk mixture and, once combined, pour the mixture back into the pan and return to the heat.", "Cook for 8-10 minutes, or until thick enough to coat the back of a spoon. Quickly whisk in the cornflour mixture. Cook for 1-2 minutes more, or until really thick. Set aside to cool.", "For the coconut and raspberry cream, whisk the cream in a large bowl. Crush in the raspberries and stir in the coconut milk.", "For the lemon and raspberry macaroons, blend the icing sugar and ground almonds in a food processor.", "Whisk the egg whites on high in a large bowl using an electric whisk. When frothy, add a pinch of cream of tartar. Slowly add the caster sugar, whisking with each addition, until firm peaks form when the whisk is removed from the bowl.", "Fold in the food colouring and blended icing sugar and ground almonds. Pipe circles of the mixture onto a baking tray lined with baking paper, about the size of a 50p coin.", "Allow to sit at room temperature (in a non-humid setting) for at least half an hour, until a skin forms over the macaroons. Preheat the oven to 160C/325F/Gas 3.", "Bake for 5-12 minutes (depending on size). The macaroons should not catch any colour.", "For the meringue topping, whisk the egg whites in a bowl on high and then gradually add the caster sugar, whisking as you go, until stiff peaks are formed when the whisk is removed from the bowl.", "To assemble, arrange half the lady fingers in the bottom of a glass trifle bowl. Top with half the lemon curd, followed by all the custard, the remaining half of the lady fingers, the strawberry and raspberry glaze, coconut and raspberry cream and the remaining lemon curd. Finish with the meringue topping. Use a blowtorch to brown the meringue topping. Place the macaroons around the top and add some raspberries in the centre to decorate."]}, {"isVegetarian": true, "title": "Coconut rice", "url": "www_bbc_co_uk_food_recipes_coconut_rice_40744", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz rice", "170ml/6fl oz coconut milk ", "170ml/6fl oz stock", "salt, to taste", "sugar, to taste", "pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice well under cold running water to remove any excess starch and transfer to a saucepan which has a tight-fitting lid.", "Mix the coconut milk and stock together and pour it over the washed rice.", "Cover the saucepan with a lid and bring the rice to boil on high heat.", "Once vigorously boiling, change to a low heat, cover with the lid and allow to simmer for 10 minutes, or until the water level is the same as the top of the rice.", "At this point, turn the heat completely off and allow to rest for a further 10 minutes, keeping the lid on at all times. Use a wooden spoon to fluff up the rice before serving. Add salt, sugar and pepper to taste."]}, {"isVegetarian": true, "title": "Coconut samosas", "url": "www_bbc_co_uk_food_recipes_coconut_samosas_81366", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_samosas_81366_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "200g/7oz shredded or grated coconut", "15g/½oz clarified butter (ghee)", "1½ tsp fennel seeds", "vegetable oil, for deep frying", "salt"], "serves": "Makes 15–20 samosas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour, 200ml/7fl oz water and a pinch of salt in a large bowl and mix together to form a dough. Knead it for 1–2 minutes. Flour a work surface and roll out the dough until it is very thin. Cut out circles using a 6cm/2½in round cutter.", "Put the coconut, clarified butter, fennel and a pinch of salt in a large pan. Bring to a simmer, then cook for 4–5 minutes, or until it’s completely dry. Set aside to cool. ", "Divide the filling between the dough circles. Fold the dough over the filling to enclose it, pinching the edges to seal. Roll and fold the edges.", "Heat the oil in a heavy-bottomed frying pan or deep-fat fryer until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the samosas in batches for 4–5 minutes, or until they turn golden-brown. Remove with a slotted spoon and drain on kitchen paper. Sprinkle with salt and serve."]}, {"isVegetarian": false, "title": "Coconut and green chilli prawns", "url": "www_bbc_co_uk_food_recipes_coconutandgreenchill_74808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz can coconut milk", "5-10 hot green chillies, sliced thickly", "1 tsp ground turmeric", "2 tbsp coriander leaves, finely chopped", "1 tsp freshly ground black pepper", "3 tbsp ground coriander", "1½ tsp ground cumin", "4 tbsp vegetable oil", "2 onions, finely sliced", "2 garlic cloves, cut into fine slivers", "1cm/½in ginger root, cut into small matchsticks", "1 lime, juice only", "1 tsp salt", "120ml/4fl oz water", "900g/2lb raw peeled king prawns", "Thai jasmine rice, cooked, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Open the coconut can without shaking it. ", "Remove the cream at the top and set to one side.", "Now add enough water to the can to fill it to the top again. ", "Swill to combine and pour into a bowl.", "Put the chillies, turmeric, coriander leaves, pepper, ground coriander and ground cumin into a food processor along with four tablespoons of the thinned coconut milk, then blend until smooth.", "Add this mixture to the bowl of thinned coconut milk and stir.", "Heat a deep frying-pan until hot then add the oil, onions, garlic and ginger. ", "Stir fry for 6-7 minutes until brown at the edges. ", "Pour in the seasoned thinned coconut milk, salt and water.", "Bring to the boil then reduce the heat, cover and simmer gently for 10 minutes.", "Add the prawns and reserved thick coconut cream. ", "Stir to combine and return to a simmer.", "Cook until the prawns turn pink.", "Serve immediately with rice."]}, {"isVegetarian": true, "title": "Coconut tart with spiced rum pineapple", "url": "www_bbc_co_uk_food_recipes_coconut_tart_with_spiced_06324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "100ml/3½fl oz dark rum", "1 red chilli, seeds removed, cut into thin strips", "1 vanilla pod, seeds only", "1 star anise", "1 pineapple, peeled and cut into small dice", "250g/9oz sweet shortcrust pastry", "plain flour, for rolling out", "2 free-range eggs, beaten ", "2 unwaxed lemons, juice and finely grated zest ", "200g/7oz caster sugar", "375ml/13fl oz double cream", "180g/6oz freshly grated coconut "], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the spiced rum pineapple, put the sugar in an even layer in a heavy-bottomed pan. Warm on a medium heat, without stirring. When the sugar starts to melt at the edges, shake the pan, then continue to heat. Stir with a wooden spoon until all the sugar has melted and turned to caramel. Carefully add the rum, chilli, vanilla seeds and star anise.", "Put the pineapple in a bowl and pour over the caramel. Cover and set aside for at least an hour.", "For the coconut tart, preheat the oven to 180C/160C Fan/Gas 4.", "Roll out the pastry on a floured surface to the thickness of a pound coin. Use it to line a 25cm/10in fluted, loose-bottomed tart tin. Prick the base with a fork. Line with baking paper and fill with baking beans.", "Bake for 15–20 minutes. Remove the beans and paper and bake for 5–10 minutes more, or until cooked through. Reduce the oven temperature 160C/140C Fan/Gas 3.", "In a large bowl, mix together the eggs, lemon juice and zest, sugar, cream and coconut. Pour into the pastry case and bake for 40 minutes, or until just set.", "Serve slices of the tart with the spiced rum pineapple."]}, {"isVegetarian": true, "title": "Coconut and lime macadamia cake", "url": "www_bbc_co_uk_food_recipes_coconutandlimemacada_73762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz macadamia nuts", "40g/1½oz self-raising flour", "pinch of salt", "6 eggs, separated", "165g/5¾oz sugar", "1 lime, zest only, finely grated", "45g/1½oz desiccated coconut", "125g/4½oz icing (confectioners') sugar, sifted", "2 tbsp lime juice", "1 tsp lime zest, finely grated"], "serves": "Makes 1 x 23cm (9in) cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Place the nuts, flour and salt in the bowl of a food processor and process until the nuts are ground.", "Place the egg yolks and sugar in a separate bowl and beat for three minutes, or until the mixture is pale and creamy. Fold through the zest and coconut, then the nut mixture.", "Place the egg whites in a clean, dry, stainless steel bowl and whisk until stiff peaks form. Using a large metal spoon, fold lightly through the nut batter.", "Spread the batter evenly into a 23cm (9in) greased or non-stick springform cake tin. Bake for 40 minutes, or until the cake is lightly golden.", "Meanwhile, make the icing. Combine all the icing ingredients in a bowl and mix until smooth and glossy.", "Remove from the oven and leave to sit for 10 minutes in the tin. Turn the cake out onto a serving plate. Spread the lime icing over the warm cake, allowing it to drizzle down the sides.", "Serve."]}, {"isVegetarian": true, "title": "Coconut and mango smoothie", "url": "www_bbc_co_uk_food_recipes_coconutandmangosmoot_80089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz mango, peeled and chopped ", "2 tbsp runny honey", "50g/1¾oz soya yoghurt ", "100ml/3½floz soya milk", "100ml/3½floz coconut milk", "1 small handful ice", "½ lime, juice only", "sprig of mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the mango, honey, yoghurt, soya milk, coconut milk, ice and lime juice in a liquidiser until smooth.", "Pour into a tall smoothie glass and garnish with a mint sprig."]}, {"isVegetarian": false, "title": "Coconut and prawn broth with rice, spinach and chilli", "url": "www_bbc_co_uk_food_recipes_coconutandprawnbroth_87354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "5 large prawns, shells and heads only", "½ fresh green chilli, chopped", "25g/1oz fresh ginger, sliced", "¼ onion, finely chopped", "1 garlic clove, finely chopped", "300ml/½ pint boiling water", "1 tsp curry powder", "1 tsp tomato purée", "1 tbsp grated fresh coconut", "1 lime, juice only", "handful fresh spinach", "25g/1oz basmati rice, cooked", "small handful fresh coriander leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a medium saucepan, add the prawn shells and heads, chilli, ginger, onion and garlic and sauté for 2-3 minutes. ", "Add the water, curry powder, tomato purée, grated coconut and lime juice. Bring to the boil and cook for ten minutes. ", "Place a fine sieve over another clean pan, pass the mixture through the sieve and discard everything that is left in the sieve. Add the spinach and rice to the broth and stir. ", "To serve, pour into a bowl and garnish with coriander leaves."]}, {"isVegetarian": true, "title": "Coconut and raspberry biscuits", "url": "www_bbc_co_uk_food_recipes_coconutandraspberryb_74768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/4½oz butter, softened", "60g/2½oz caster sugar", "1 egg, preferably free-range, beaten", "1 tsp pure vanilla extract", "100g/3½oz rice flour", "75g/3oz tapioca flour", "1 tsp gluten-free baking powder", "1 tsp xanthan gum", "50ml/2fl oz milk", "175g/6oz raspberry jam", "250g/9oz raspberries", "100g/3½oz butter, softened", "150g/5oz caster sugar", "2 eggs, preferably free-range, lightly beaten", "225g/8oz desiccated coconut", "60g/2½oz rice flour", "Swiss roll tin, 20x30cm/8x12in, lined with parchment paper"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "To make the base, cream the butter and gradually add the caster sugar. Beat until pale, soft and light. Add the egg, a little at a time, beating well after each addition, before adding the vanilla extract.", "Sift together the dry ingredients and stir gently into the creamed mixture. ", "Mix everything together lightly and add the milk to moisten. Spread the mixture into the prepared tin, smoothing it out to the edges. Spread the jam gently over the cake mixture and sprinkle with the raspberries. You may need to press them down gently into the cake mixture.", "Make the topping. Cream the butter and sugar together as before until pale, soft and light. Add the beaten eggs gradually, beating well after each addition. Mix together the coconut and rice flour and fold into the mixture. Spread gently but evenly over the raspberries and bake in the oven for about 35-40 minutes or until a skewer comes out cleanly. ", "Leave to cool in the tin and cut into 24 biscuits."]}, {"isVegetarian": false, "title": "Coconut prawns with spicy mango relish", "url": "www_bbc_co_uk_food_recipes_coconutandvelvetpraw_86842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp arrowroot", "1 tbsp sesame oil", "1 free-range egg white", "pinch salt", "100g/3½oz raw king prawns, peeled", "vegetable oil", "1 lime, juice only", "2 tbsp white wine", "½ tsp curry powder", "½ mango, peeled, stoned, chopped", "100ml/3½fl oz coconut cream", "½ tsp chilli flakes", "dash olive oil", "salt and freshly ground black pepper", "1 tsp caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, mix together the arrowroot, sesame oil, egg white and salt in a medium bowl. Add the prawns and stir until they are all coated. ", "Heat a little vegetable oil in a wok. Add the prawns and cook for 1-2 minutes, or until pink and completely cooked through. Remove from the heat and add the lime juice, white wine and curry powder. Spoon onto a serving plate.", "For the mango relish, put all the ingredients into a small blender or food processor and blend until smooth. Pour into a small bowl and serve as a dipping sauce alongside the prawns."]}, {"isVegetarian": true, "title": "Coconut butternut squash stew", "url": "www_bbc_co_uk_food_recipes_coconutbutternutsqua_65609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 dried hot red chillies (¾-1¼cm/2-3in), seeded and cut in pieces and soaked in warm water for 10 minutes, drained ", "6 spring onions, roughly chopped ", "2 tsp chopped garlic ", "2 stalks lemongrass, outer leaves discarded, chopped (lemon juice could be used instead) ", "1½ tbsp peanut oil, extra if required ", "2 tsp ground coriander ", "½ tsp ground turmeric ", "1 tsp paprika ", "290ml/½ pint of canned unsweetened coconut milk, well stirred ", "150ml/¼ pint hot vegetable stock or water ", "750g/1½lb butternut squash, peeled, seeded and cut into 5cm/2in chunks ", "2 green cardamom pods, crushed ", "1 cinnamon stick ", "1 red pepper, seeded and julienned ", "salt to taste ", "1½ tbsp soy sauce ", "1½ tsp light brown sugar ", "1½ tsp lemon juice ", "2 tbsp fresh coriander leaves"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the chillies, spring onions, garlic and lemongrass to a paste in a processor, adding a little oil if necessary. Heat 1½ tbsp oil in a heavy saucepan over a medium-low heat. Add the chilli paste and cook, stirring until it is fragrant and no longer tastes raw. ", "Add the coriander, turmeric, and paprika and stir for 1 minute. Add the coconut milk and simmer, stirring for 5 minutes. ", "Stir in the stock and bring to a simmer. ", "Reduce the heat to low and add the butternut squash, red pepper, cardamom, cinnamon stick and salt to taste. Simmer, partially covered until the butternut squash is tender and the sauce is reduced, about 20-25 minutes. ", "Stir in the soy sauce, sugar and lemon juice and simmer for another 2 minutes. Serve garnished with coriander leaves. ", "This is quite a wet stew. It can be thickened with cornflour paste if required. Serve with plain rice."]}]