[{"ingredients": ["30g / 1oz de mantequilla", "Tocino de tocino rayado 150 g / 5½ oz", "1 chalota de plátano, en rodajas finas", "110ml / 3½fl oz de vino de Madeira", "175ml / 6fl oz de caldo de carne", "sal y pimienta negra recién molida", "2 cucharadas de perifollo fresco finamente picado", "Patatas King Edward de 300g / 11oz, peladas y cortadas en trozos", "50g / 1¾oz de mantequilla", "Crema doble de 110 ml / 3½ fl oz", "4 x 150 g / 5½ oz rebanadas hígados de terneros, recortados", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "50 g / 1¾oz de mantequilla sin sal", "1 cabeza de col negra", "10g de ajo silvestre"], "method": ["Para la reducción de Madeira, caliente una sartén a fuego medio y agregue la mantequilla. Cuando la mantequilla esté espumosa, agregue los lardones y la chalota. Freír durante 3-4 minutos, o hasta que los lardones y chalotes estén dorados.", "Agregue el Madeira y cuidadosamente incline la sartén hacia la llama de la placa, para que el alcohol se prenda. Cuando la llama se haya apagado, cocine hasta que el líquido haya reducido su volumen en tres cuartas partes.", "Agregue el caldo de carne, revuelva bien, y cocine por 3-4 minutos, o hasta que reduzca el volumen a la mitad. Luego sazone, al gusto, con sal y pimienta negra recién molida. Revuelva en el perifollo.", "Para las puré de papas, cocine las papas en una sartén con agua hirviendo con sal durante 12-15 minutos, o hasta que estén tiernas. Desagüe.", "Empuja la papa a través de un ricer de papa en una olla. Alternativamente, machaque con un triturador de papas, pero el acabado será menos liso. Regrese al fuego, luego agregue la mantequilla y la crema y bata hasta obtener un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida. Coloque en una manga pastelera y reserve.", "Para el hígado de los terneros, sazone los hígados, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén grande a fuego alto y la mantequilla. Cuando la mantequilla esté espumante, agregue los hígados y frítelos en ambos lados durante 1 a 2 minutos, o hasta que se doren por completo, pero aún un poco de color rosa en el centro. Retire de la sartén y reserve para descansar.", "Para el cavolo nero y el ajo silvestre, agregue la mantequilla a una sartén caliente y, una vez caliente, agregue el cavelo nero y cocine por un minuto. Agregue el ajo silvestre y cocine por otros dos minutos, luego sazone con sal y pimienta.", "Para servir, vierta el puré en cuatro cuencos poco profundos y coloque el hígado y el cavolo nero y el ajo a un lado, y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_pan_fried_calves_liver_39817", "title": "Hígado de ternera con puré de patata, cavolo nero, ajo silvestre y reducción de Madeira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vinagre de vino tinto de 110ml / 4fl oz", "Azúcar en polvo de 110 g / 4 oz", "12 puerros tiernos", "2 cucharadas de aceite de colza", "sal y pimienta negra", "110g / 4oz de mantequilla sin sal", "4 x 150-200g / 5½-7oz de filetes de bacalao, piel sobre", "2 cucharadas de alcaparras", "½ limón, solo jugo", "2 cucharadas de perejil fresco finamente picado"], "method": ["Para la reducción de vino tinto, coloque el vinagre de vino tinto, el azúcar y 110 ml / 4 fl oz de agua en una olla y cocine hasta que se reduzca a una consistencia de jarabe.", "Para los puerros tiernos a la plancha, ponga a hervir un sartén con agua con sal, agregue los puerros y cocínelos hasta que estén tiernos, luego escurra y seque. Caliente una sartén hasta que esté caliente, mezcle los puerros con un poco de aceite, sal y pimienta negra y carbonilla a cada lado hasta que quemen.", "Para el bacalao con beurre noisette y alcaparras, precalentar el horno a 220C / 425F / Gas 7.", "Caliente un poco de mantequilla en una sartén a fuego medio-alto. Cuando la mantequilla esté espumosa, agregue el bacalao y fríalos durante 1-2 minutos en cada lado. Transfiera al horno para terminar de cocinar (2-3 minutos).", "Agregue la mantequilla restante y, una vez marrón, agregue las alcaparras y el jugo de limón.", "Para servir, coloque los puerros en el centro del plato y coloque el bacalao en la parte superior. Verter las alcaparras y la reducción de vino tinto sobre y alrededor del pescado. Adorne con perejil picado."], "url": "www_bbc_co_uk_food_recipes_pan_fried_cod_with_73108", "title": "Bacalao frito con beurre noisette, puerros tiernos a la plancha y reducción de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "1 trufa", "200g / 7oz de arroz basmati", "4 filetes de fletán de x 200 g / 7 oz, pin boned", "sal", "75g / 3oz de mantequilla", "1 cucharada de aceite de oliva light", "2 cucharadas de vinagre de vino blanco", "350g / 13oz caballo nero, recogido", "125g / 4½oz de mantequilla, derretida", "2 cucharaditas de jugo de limón", "2 cucharaditas de vinagre de vino blanco", "2 huevos de gallinas camperas, solo yemas", "sal y pimienta negra recién molida"], "method": ["Coloque los huevos enteros, sin romper, con la trufa y el basmati en un bol y déjelos durante al menos 24 horas para que la trufa se infunda a través de las cáscaras en los huevos. (El basmati es para absorber la humedad. No se cocina en esta receta, pero se puede guardar y cocinar más tarde).", "Sazonar el fletán con un poco de sal.", "Calentar una sartén hasta que esté medio caliente, agregar un poco de mantequilla y el aceite de oliva. Cocine el fletán, con la piel hacia abajo, a fuego medio durante cuatro minutos hasta que la carne se haya vuelto opaca.", "Dé la vuelta y cocine por un minuto más, luego retírelo del fuego y descanse en la sartén por un par de minutos.", "Ponga a hervir una olla de agua con sal y agregue el vinagre. Batir el agua para crear un remolino y, una vez asentado, romper un huevo. Cocine a fuego lento durante 2-3 minutos, retire el huevo escalfado con cuidado con una cuchara ranurada y colóquelo en un plato para drenar. Repita el proceso con los huevos restantes.", "Calentar otra sartén con la mantequilla restante y el calor hasta que forme espuma. Agregue el cavalo nero y 75ml / 3floz de agua y cocine por 2-3 minutos hasta que se suavice y el agua y la mantequilla se emulsionen.", "Para el holandés, coloque la mantequilla en una olla y cocine a fuego lento.", "Coloque el jugo de limón y el vinagre en una sartén pequeña y caliente hasta que hierva.", "Coloque las yemas de huevo en un procesador de alimentos con una pizca de sal y enciéndalo.", "Con el motor en marcha, agregue el limón caliente y el vinagre. Luego, lentamente, agregue la mantequilla derretida hasta que esté todo incorporado. Retire del procesador y sazone con un poco de sal y pimienta negra.", "Para servir, levante la piel del fletán y deseche. Divida el cavalo nero entre cuatro platos y cubra con un filete de fletán. Coloque los huevos escalfados en la parte superior, luego coloque la holandesa y termine con una ralla de trufa fresca."], "url": "www_bbc_co_uk_food_recipes_pan_fried_halibut_with_48265", "title": "Fletán frito con trufa, huevo escalfado, holandesa y cavolo nero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes pequeños de rape, completamente recortados, cortados en escalopes gruesos de 1 cm / ½ \"", "pizca de sal", "125g / 4½oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "50ml / 2fl oz buen vino tinto", "50ml / 2fl oz de vinagre de vino tinto", "50 g / 2 oz de azúcar en polvo", "1 chalote, finamente cortado en cubitos", "1 diente de ajo, pelado", "1 ramita de tomillo fresco"], "method": ["Sazonar el rape con un poco de sal.", "Caliente una sartén grande hasta que esté medio caliente, agregue un poco de mantequilla y todo el aceite. Cocine el rape en cada lado hasta que esté dorado, alrededor de un minuto a cada lado.", "Retire el pescado y descanse en un plato cubierto de película adhesiva.", "Coloque el vino tinto, el vinagre, el azúcar, 50 ml / 2 fl oz de agua y chalote en una olla y cocine hasta que se reduzca a un jarabe.", "Caliente una sartén a fuego alto y cocine la mantequilla restante, el tomillo y el diente de ajo entero hasta obtener un color marrón rojizo.", "Mezcle el jarabe de vino tinto y la mantequilla juntas, debe haber el doble de la cantidad de mantequilla que el vino tinto, revise el condimento y luego retire el diente de ajo.", "Para servir, coloque el rape en los platos y luego espolvoree el aderezo de vino tinto sobre la superficie."], "url": "www_bbc_co_uk_food_recipes_pan_fried_monkfish_with_45947", "title": "Rape frito con salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ col blanca pequeña, finamente cortada usando una mandolina", "½ col roja pequeña, finamente cortada usando una mandolina", "3 zanahorias, ralladas gruesas", "racimo pequeño de uva blanca, preferiblemente uvas sultana, cortadas a la mitad", "puñado de menta fresca, más o menos picada", "sal al gusto", "azúcar al gusto", "rociar vinagre de vino blanco (preferiblemente envejecido como Moscatel)", "4 x salmonete entero mediano, a escala, eviscerado y lavado en agua fría", "aceite de oliva virgen extra, preferiblemente griego, para freír", "1 manojo de romero fresco", "dash vinagre de vino blanco (preferiblemente envejecido como Moscatel)", "sal marina", "un poco de harina, para quitar el polvo"], "method": ["Para hacer la ensalada, coloque todos los ingredientes en un recipiente y sazone al gusto con sal, azúcar y vinagre. Mezcle bien para combinar.", "Caliente una sartén ancha a fuego medio. Cuando esté caliente, agregue suficiente aceite de oliva para cubrir los lados de la sartén en aproximadamente 1 cm / ½ pulgada.", "Espolvorea cada pescado con sal y harina y colócalo cuidadosamente en la sartén. Agregue el romero y cocine por 3-5 minutos o hasta que estén dorados y crujientes por un lado, voltéelos y repítalos hasta que estén cocidos. Justo antes de quitar el salmonete, agregue un vinagre de tablero y apague el fuego.", "Divida el pescado entre cuatro platos y sirva con la ensalada de repollo."], "url": "www_bbc_co_uk_food_recipes_pan_fried_red_mullet_48324", "title": "Salmonetes con romero y una ensalada de repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "8 lonchas finas de salmón, aproximadamente 1 cm / ½ pulgada de grosor", "120ml / 4fl oz de aceite de oliva virgen extra", "1 limón, solo jugo", "2 tomates, pieles y semillas retiradas, carne cortada en cubitos", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "2 calabacines, cortados en cubitos", "2 cucharadas de estragón fresco picado", "2 cucharadas de eneldo fresco picado", "2 cucharadas de perejil fresco picado", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Calentar una sartén hasta que esté caliente, agregar la mantequilla y luego agregar el salmón y freír en cada lado durante dos minutos.", "Vierta el aceite de oliva en una sartén no reactiva. Batir el jugo de limón hasta que esté bien combinado. Agregue los tomates picados, chalota, ajo y calabacín.", "Calentar la sartén a fuego medio hasta que la mezcla se caliente por completo.", "Agregue el estragón, el eneldo, el perejil y el cebollín y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, divide el salmón entre cuatro platos y luego coloca la salsa vierge sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_pan_fried_salmon_with_51607", "title": "Salmón frito con salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 500 g / 1 libra y 2 onzas, fregados y rellenos", "4 cucharadas de aceite de oliva", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "2 ramitas de tomillo", "25ml / 1fl oz de vino blanco", "100ml / 3½fl oz de caldo de pescado", "1 puerro, finamente picado", "¼ de apio nabo, aproximadamente picado", "1 zanahoria, más o menos picada", "1 cucharada de crema", "1 cebollín pequeño, finamente picado", "2 filetes de dorada (aproximadamente 180-200 g / 6½-7¼ oz cada uno), piel sobre", "1 bulbo de hinojo, descuartizado, sin núcleo, en juliana", "2 cucharadas de aceite de oliva virgen extra", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos.", "Agregue 1 cucharada de aceite de oliva en una olla grande con tapa a fuego medio-alto. Agregue la chalota y el ajo y el sudor durante 1 minuto. Agregue el tomillo, el vino blanco y el caldo de pescado y cocine a fuego lento. Agregue los mejillones, tapar y vaporizar durante 3-4 minutos, revolviendo hasta la mitad. Cuele los mejillones, reserve el licor de cocción y reserve. Deseche cualquier mejillón que permanezca cerrado.", "Agregue 1 cucharada de aceite de oliva en una cacerola a fuego medio. Agregue el puerro, el apionabo y la zanahoria y cocine durante 2 minutos hasta que estén suaves. Agregue la mitad del licor de cocción del mejillón y cocine a fuego lento. Agregue la crème fraîche, las cebolletas y los mejillones cocidos y cocínelos hasta que estén bien calientes.", "Califique las pieles de los peces y sazone con sal. Coloque una sartén grande a fuego medio y agregue 2 cucharadas de aceite de oliva. Una vez caliente, agregue el pescado, con la piel hacia abajo y cocine por 2-3 minutos, luego voltee y cocine la carne durante 1 minuto o hasta que esté cocido (una barra de cóctel debe ingresar al pescado sin resistencia).", "Mezcle el hinojo con el aceite de oliva virgen extra y el jugo de limón. Temporada.", "Para servir, divida el hinojo entre dos platos, espolvoree los mejillones y las verduras, coloque el filete de besugo encima y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_pan_fried_sea_beam_with_87333", "title": "Dorada frita con mejillones e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 chalota, en rodajas", "1 tomillo de ramita grande", "1 hoja de laurel", "90g / 3¼ oz de miel", "2½ cucharadas de vinagre de vino blanco", "15g / ½ oz de sal", "pellizcar granos de pimienta blanca", "1 coliflor, cortada en florecillas", "50g / 2oz de mantequilla", "2 coliflores grandes, cortadas en florecillas", "50g / 2oz de mantequilla sin sal", "rociar aceite de trufa blanca", "sal y pimienta negra recién molida", "75 g / 2½ oz de mantequilla", "Chalotes de 110 g / 4 oz, finamente cortados", "8 g de semillas de comino, tostadas y ligeramente rellenadas en un procesador de alimentos", "250g / 9 oz de champiñones, en rodajas", "500ml / 18fl oz de caldo de pescado", "Vino Gewürztraminer 500ml / 18fl oz", "Crema doble 500ml / 18fl oz", "8 vieiras grandes", "2 cucharadas de aceite de oliva", "1 limón, solo jugo", "1 cucharada de cebollino picado", "1 cucharada de micro hierbas", "1 cucharada de aceite de trufa blanca"], "method": ["Para el líquido soused, agregue el aceite de oliva a una cacerola grande y sude la chalota sin colorear. Agregue el tomillo y la hoja de laurel y continúe cocinando por otro minuto.", "Agregue la miel, el vinagre de vino blanco, la sal, los granos de pimienta y 600 ml / 20 fl oz de agua. Llevar a ebullición durante 10 minutos, luego pasa a través de un colador en una olla limpia y se deja enfriar.", "Agregue las florecillas de coliflor al líquido enfriado y lleve a ebullición, luego reduzca a fuego lento. Cocine durante 20 minutos, o hasta que los flósculos estén suaves, luego déjelos enfriar en el líquido.", "Retire la coliflor del líquido y seque. Caliente una sartén antiadherente hasta que esté caliente. Agregue la mantequilla y la coliflor y cocine hasta que esté caramelizado. Ponga a un lado hasta que esté listo para servir.", "Para el puré de coliflor caramelizado, coloque la coliflor en una olla y cúbrala con agua. Llevar a ebullición y cocine a fuego lento hasta que esté completamente cocido.", "Cuele la coliflor sobre un recipiente, reservando el licor de cocción.", "Coloque la coliflor en una licuadora y mezcle hasta obtener un puré fino.", "Coloque las sartenes sobre el fuego y agregue la mantequilla. Agregue el puré y fríelo hasta que este empiece a caramelizar, batiendo ocasionalmente.", "Cuando la mezcla esté suave y dorada, devuelva el puré a la licuadora y vuelva a licuar hasta que esté muy fino y suave.", "Agregue un poco de aceite de trufa y, si es necesario, diluya el puré agregando un poco de licor de cocción. Sazone al gusto con sal y pimienta negra recién molida.", "Para el comino velouté, agregue un tercio de la mantequilla a una sartén a fuego medio. Agregue los chalotes, el comino y una pizca de sal. Freír hasta que estén suaves pero no coloreados. Agregue los champiñones y cocine hasta que estén resbaladizos.", "Agregue el caldo de pescado, lleve a ebullición y cocine hasta que el volumen de líquido se haya reducido a la mitad. Agregue el vino y reduzca en un tercio.", "Agregue la crema, lleve a ebullición y cocine hasta que espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Pase a través de un colador fino en una olla limpia, luego mezcle con la mantequilla restante y sazone al gusto con sal y pimienta negra recién molida.", "Para las vieiras, sazone las vieiras en ambos lados con sal y pimienta negra recién molida. Calentar el aceite en una sartén antiadherente y freír las vieiras durante dos minutos por cada lado. Retire del fuego y exprima un poco de jugo de limón en la parte superior.", "Para el comino velouté, use una batidora de mano para formar una espuma.", "Para servir, unte un poco de puré de coliflor en el centro de cada plato y coloca las vieiras y la coliflor caramelizada alrededor. Vierta las cebolletas y las micro hierbas con jugo de limón, aceite de oliva, sal y pimienta negra y póngalas sobre las vieiras. Rocíe con un poco de aceite de trufa y puntos de espuma de velouté, luego sirva."], "url": "www_bbc_co_uk_food_recipes_pan_fried_scallops_with_48595", "title": "Vieiras fritas con puré de coliflor caramelizado y velouté de comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 remolacha cocida, pelada y picada", "1 cucharada de mostaza Dijon", "1 yema de huevo de rango medio", "2 cucharadas de vinagre balsámico", "100ml / 3½fl oz de aceite de oliva", "sal y pimienta negra recién molida", "1 corazón de apio, rallado en una mandolina, hojas reservadas", "100 g / 3½ oz de lechuga de cordero", "100g / 3½oz de hojas de ensalada de remolacha", "dash aceite de oliva", "1 limón, solo jugo", "6 ostras medianas", "2 cucharadas de harina normal", "1 huevo mediano de granja, golpeado", "2 cucharadas de panco breadcrumbs", "2 cucharadas de coco desecado", "dash aceite de oliva", "botón de mantequilla"], "method": ["Para la mayonesa de remolacha, mezcle la remolacha con la mostaza, la yema de huevo y el vinagre en un procesador de alimentos, agregando gradualmente el aceite para hacer un puré. Sazonar con sal y pimienta y reservar.", "Para la ensalada, mezcle todos los ingredientes en un tazón grande y sazone.", "Abra las conchas de ostra con un shucker. Afloje cada ostra de la base y deseche el caparazón. Seque las ostras en papel de cocina.", "Pon la harina y el huevo en tazones poco profundos separados. Combine las migas de pan y el coco en un tercer tazón. Uno a la vez, sumerja las ostras en la harina, luego el huevo y finalmente la mezcla de pan rallado, cubriéndose abundantemente.", "Freír las ostras inmediatamente en un poco de aceite y untar a fuego medio durante 2-3 minutos en cada lado, o hasta que estén doradas.", "Para servir, salpique la mayonesa de remolacha en dos platos para servir, coloque la ensalada en el centro con las ostras alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_pan_fried_oysters_in_01256", "title": "Ostras en miga de coco con mayonesa de remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechos de pato", "75g / 3oz de azúcar en polvo blanco", "2 naranjas, cáscara y jugo", "2 cucharadas de vinagre de jerez", "300ml / 11fl oz de caldo de pollo reducido", "3 zanahorias, peladas y en rodajas", "3 calabacines, en rodajas gruesas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén a prueba de horno hasta que esté muy caliente, agregue las pechugas de pato, con la grasa hacia abajo y cocine durante 3-4 minutos, o hasta que estén doradas. Dé vuelta y cocine por 1-2 minutos más.", "Coloque en el horno durante 8-10 minutos.", "Retire del horno y ponga el pato a un lado para que descanse durante cinco minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue el azúcar impalpable y cocine a un caramelo.", "Retirar del fuego y luego agregar el jugo de naranja y el vinagre, volver al fuego y cocinar por unos minutos.", "Agregue el caldo de pollo, vuelva a hervir a fuego lento y cocine por 3-4 minutos hasta que se espese.", "Agregue la ralladura de naranja y sazone con sal y pimienta negra recién molida.", "Poner a hervir una olla de agua con sal, cubrir con un inserto de vapor y luego agregar las zanahorias, la cubierta y el vapor durante dos minutos.", "Agregue los calabacines y el vapor durante otros tres minutos hasta que estén tiernos.", "Para servir, esculpe el pato en rebanadas gruesas. Coloque las zanahorias y los calabacines en el plato y coloque el pato en rodajas sobre la parte superior. Termine con una cucharada de salsa de naranja."], "url": "www_bbc_co_uk_food_recipes_pan_roasted_duck_breast_88974", "title": "Pechuga de pato asada con salsa de naranja, zanahorias y calabacines", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "40 g / 1½ oz de mantequilla", "2 patas de pollo entero, cortadas en muslos y muslos", "2 chalotas", "1 limón, cortado por la mitad", "1 bulbo de ajo, cortado por la mitad", "200g / 7oz de chorizo, cortado en pequeños trozos", "2 tomates, pelados, sin semillas, finamente picados", "660g / 1lb 8oz de alubias blancas en conserva, escurridas", "2 ramitas de romero, finamente picadas", "4 ramitas de tomillo, finamente picado", "250ml / 9fl oz de caldo de pollo", "2 cucharadas de perejil de flatleaf tostado", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Caliente una sartén a prueba de horno hasta que esté caliente, agregue la mitad del aceite de oliva y la mitad de la mantequilla. Cuando la mantequilla esté espumosa, agregue el pollo y fría hasta que esté dorado.", "Cortar una chalota por la mitad a lo largo y agregar a la sartén junto con el limón y la mitad del romero y el tomillo. Agregue el ajo, reservando dos dientes de ajo.", "Asar en el horno durante 15 minutos, o hasta que estén dorados y el pollo esté bien cocido.", "Mientras tanto, pique finamente la chalota restante y los dientes de ajo reservados.", "Caliente una sartén grande o saltee la sartén hasta que esté a fuego medio. Agregue el resto del aceite de oliva y el chorizo ​​y cocine durante cinco minutos, o hasta que el aceite haya cambiado de color y el chorizo ​​esté crujiente alrededor de los bordes.", "Agregue los tomates, el ajo picado y el chalote. Freír suavemente durante un minuto, luego agregar los frijoles y el resto del romero y el tomillo y cocinar por otros dos minutos.", "Agregue el caldo y caliente a fuego lento. Cocine durante 4-5 minutos, o hasta que la chalota se haya suavizado y el volumen del líquido se haya reducido ligeramente.", "Agregue lo último de la mantequilla y el perejil. Sazone al gusto con abundante pimienta negra.", "Coloque los frijoles en el medio de dos platos hondos, cubra con un poco de pollo, luego coloque un trozo de limón, chalota y ajo al lado."], "url": "www_bbc_co_uk_food_recipes_pan_roasted_chicken_with_06765", "title": "Pollo con guiso de frijoles de chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan_roasted_chicken_with_06765_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2½ cucharadas de aceite de colza", "1 cucharadita de semillas de comino", "2 cucharaditas de semillas de sésamo", "200 g / 7 oz de raíz de jengibre fresco, en rodajas finas", "1 chile verde, rebanado abierto", "sal al gusto", "1 cucharadita de chile rojo en polvo", "100g / 3½oz de pasta de tamarindo", "Azúcar de palma 100g / 3½oz", "pellizcar asafoetida", "1 chile rojo seco", "½ cucharadita de semillas de mostaza", "5-6 hojas de curry", "4 pechos de pato, recortados y anotados", "12 espárragos de lanzas, recortados", "12 lanzas Tenderstem brócoli", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de berro de coriandro"], "method": ["Para la salsa picante, caliente dos cucharadas de aceite en una sartén, fría las semillas de comino durante 1-2 minutos y luego agregue las semillas de sésamo, el jengibre y el chile verde y sazone con un poco de sal.", "Revuelva durante 2-3 minutos y luego cubra la mezcla con un círculo de papel resistente a la grasa y deje que se cocine lentamente durante 40-45 minutos hasta que el jengibre esté casi cocinado.", "Deje que la mezcla se enfríe y luego transfiéralo a un procesador de alimentos con la pasta de tamarindo, azúcar de palma y 50 ml / 2 fl oz de agua y mezcle hasta obtener una pasta fina.", "Caliente el aceite restante en una sartén por separado, agregue la asafétida, el chile rojo y las semillas de mostaza. A medida que estallen las semillas de mostaza, agregue las hojas de curry, revuelva por 30 segundos y luego viértalo en la mezcla de chutney de jengibre y mezcle bien. Dejar de lado.", "Para el pato, precaliente el horno a 200C / 400F / Gas 6.", "Caliente una sartén hasta que esté muy caliente, agregue las pechugas de pato, con la grasa hacia abajo y cocine hasta que estén doradas.", "Voltee las pechugas de pato para sellar el otro lado, luego transfiera la cacerola al horno y tueste durante 10-12 minutos. Retire el pato del horno y descanse durante 5-6 minutos.", "Mientras tanto, ponga a hervir un sartén con agua con sal, agregue los espárragos y el brócoli y hierva por 2-3 minutos hasta que estén tiernos.", "Escurrir los espárragos y el brócoli y mezclar con el aceite de oliva.", "Calentar una sartén hasta que esté caliente, agregar los espárragos y el brócoli y dorar a cada lado hasta que queden carbonizados.", "Retirar y sazonar con sal y pimienta negra recién molida.", "Para servir, coloque los espárragos y el brócoli en el plato. Espolvoree el pato en rodajas y póngalo encima, luego coloque una cucharada de chutney al lado. Termina con una dispersión de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_pan_roasted_duck_with_89879", "title": "Pato asado con jengibre, chutney, espárragos y brócoli Tenderstem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates de ciruela, cortados a la mitad longitudinalmente", "2 ramitas de tomillo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "Hojas de cohete de 125 g / 4½ oz", "50 g / 2 oz de queso parmesano, finamente rallado", "40g / 1½ oz de piñones, ligeramente tostados", "1 diente de ajo, finamente picado", "4-5 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva", "Papas cerosas de 450 g / 1 lb, peladas y en rodajas finas", "8 sardinas frescas, a escala y fileteadas", "2 cucharaditas de hojas de orégano recogidas", "aceite vegetal, para freír las alcaparras", "2 cucharadas de alcaparras", "virutas de pecorino"], "method": ["Para los tomates, precaliente el horno a 150C / 300F / Gas 2.", "Coloque los tomates, con el lado cortado hacia arriba, en una bandeja de asar.", "Espolvorear con el tomillo, la sal y la pimienta negra recién molida, al gusto, y el aceite de oliva.", "Asar durante 1-2 horas hasta que la humedad se haya evaporado principalmente y los tomates se hayan secado.", "Retire los tomates del horno y déjelos a un lado para que se enfríen.", "Para el pesto, coloque todos los ingredientes, excepto el aceite y el condimento, en un mortero o procesador de alimentos y mezcle hasta obtener un puré grueso. A continuación, agregue gradualmente el aceite y continúe mezclando hasta que tenga un puré espeso.", "Sazonar el pesto al gusto con sal y pimienta negra recién molida.", "Para la tarta, precalentar el horno a 200C / 400F / Gas 6.", "Calienta dos sartenes para horno pequeñas (18-20 cm / 7-8 in) a fuego medio y agrega unas cucharadas de aceite de oliva a cada una.", "Coloque las papas en rodajas en círculos superpuestos para que cubran el fondo de las fuentes.", "Sazonar con sal y pimienta negra recién molida y reducir el fuego a bajo.", "Cocine durante unos cinco minutos hasta que las papas se doren en los bordes y son translúcidas en el medio.", "Extienda el pesto de rúcula sobre la capa de patata.", "Coloque las sardinas en la parte superior, con la cola apuntando hacia el centro, en forma de abanico alrededor de la bandeja y luego espolvoree el orégano sobre la parte superior.", "Coloque los moldes en el horno y hornee durante 15-20 minutos hasta que estén dorados en la base.", "Cuando las papas estén cocidas y la superficie esté dorada, retire las tartas del horno y deje enfriar un poco antes de verterlas fuera de la sartén.", "Mientras tanto, caliente una sartén con aproximadamente 2 cm / 1 in de aceite vegetal, hasta que brille.", "Agregue las alcaparras y cocine hasta que estén crujientes, luego retírelas y escurra sobre papel de cocina.", "Para servir, coloque cada tarta en un plato de servir y coloque unos tomates asados ​​en la parte superior. Termine con algunas de las alcaparras fritas y virutas de pecorino."], "url": "www_bbc_co_uk_food_recipes_pan_roasted_potato_and_16177", "title": "Cacerola asada de patata y sardina con tomates Sun Blush", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla roja picada", "1 pimiento rojo, cortado en dados de 1cm / ½in", "1 pimiento amarillo, cortado en dados de 1 cm / ½ pulgadas", "2 dientes de ajo, pelados, más o menos picados", "1 berenjena, cortada en dados de 1 cm / ½ en", "2 calabacines, cortados en dados de 1 cm / ½ pulgadas", "3 tomates, cortados en dados de 1 cm / ½ pulgadas", "2 cucharadas de hojas de albahaca fresca, finamente picada", "sal y pimienta negra recién molida", "2 chalotes, pelados, finamente cortados", "1 cucharada de vinagre de vino blanco", "4 cucharadas de vino blanco", "1 cucharada de agua fría", "225g / 8oz de mantequilla salada, cortada en cubos", "sal y pimienta negra recién molida", "4 cucharadas de cebollín, picado", "4 x 175 g / 6oz de filetes de rodaballo", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "75ml / 3fl oz de vino blanco"], "method": ["Para el pisto, caliente una sartén a fuego medio a alto, agregue el aceite de oliva y, cuando esté caliente, agregue la cebolla y los pimientos. Freír por 2-3 minutos, o hasta que se ablanden.", "Agregue el ajo, la berenjena y los calabacines y fría por otros 2-3 minutos, revolviendo ocasionalmente.", "Agregue los tomates y continúe cocinando por un minuto más.", "Espolvorear sobre las hojas de albahaca y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la cebolleta beurre blanc, ponga las chalotas en rodajas finas, el vinagre de vino blanco y el vino blanco a ebullición en una olla no reactiva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que solo queden dos cucharadas de líquido en la sartén.", "Agregue el agua fría y continúe cocinando a fuego lento hasta que el volumen de líquido restante en la sartén sea de aproximadamente una cucharada.", "Reduzca el fuego a bajo, luego bata gradualmente en la mantequilla, 25 g / 1 oz a la vez, esperando hasta que toda la mantequilla se haya derretido e incorporado a la mezcla antes de agregar más.", "Una vez que toda la mantequilla se ha agregado a la reducción, retire la mezcla del fuego y cuele en una olla limpia. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar el cebollino. Dejar de lado a temperatura ambiente hasta que se necesite (no refrigerar ya que la salsa se separará).", "Para el rodaballo, precalentar el horno a 200C / 400F / Gas 6. Sazonar los filetes de rodaballo con sal y pimienta negra recién molida.", "Caliente una sartén a fuego medio, agregue la mantequilla y, cuando esté espumante, agregue los filetes de rodaballo con la piel hacia abajo (en tandas si es necesario). Freír durante 1-2 minutos, o hasta que la piel esté crujiente y dorada, luego voltee el pescado y agregue el vino.", "Cubra el pescado con el cartucho y transfiera la sartén al horno durante 3-4 minutos, o hasta que esté recién cocida (el pescado se cuece cuando la carne esté opaca).", "Retire el pescado de la sartén y déjelo a un lado para que descanse durante 1-2 minutos.", "Para servir, coloque una cuarta parte del pisto en el centro de cada una de las cuatro placas para servir. Coloque un filete de rodaballo en la parte superior de cada porción. Cuchara sobre la cebolleta beurre blanc."], "url": "www_bbc_co_uk_food_recipes_pan_roasted_turbot_with_97893", "title": "Rodaballo asado con ratatouille y cebolleta beurre blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de arroz de grano largo", "2 cucharadas de aceite de oliva", "2 pechugas de pollo, cortadas en tiras muy delgadas", "1 cucharada de miel clara", "1 cebolla, finamente picada", "1 calabacín, finamente picado", "1 pimiento rojo, finamente picado", "2 palitos de apio, finamente picado", "Jengibre fresco de 2cm / ¾in de la pieza, finamente rallado", "2 dientes de ajo, aplastados", "1 cucharada de polvo de curry medio", "3 cucharadas de salsa de soja", "1 cucharada de salsa de chile dulce", "½ lima, solo jugo", "sal y pimienta negra recién molida", "4 cuñas de lima, para servir"], "method": ["Ponga a hervir una olla de agua y cocine el arroz de acuerdo con las instrucciones del paquete (aproximadamente de 10 a 12 minutos). Escurra bien, enjuague y deje a un lado para que se enfríe por completo.", "Cuando el arroz esté frío, caliente el aceite en una sartén, sazone el pollo con sal y pimienta y agregue a la sartén. Rocíe con la miel y freír rápidamente a fuego alto durante unos minutos hasta que estén dorados y recién cocinados. Retire de la sartén y reserve.", "Agregue la cebolla, el calabacín, el pimiento rojo y el apio a la sartén. Freír durante 4-5 minutos, revolviendo. Agregue el jengibre, el ajo y el polvo de curry y fría por otro minuto. Agregue el arroz, la salsa de soya, la salsa de chile y el jugo de lima. Mezcle y sazone con poca sal y pimienta. Devuelve el pollo a la sartén.", "Poner en recipientes calientes y servir con las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_panang_chicken_stir-fry_00869", "title": "Panang chicken stir-fry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panang_chicken_stir-fry_00869_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 120g / 4oz", "pizca de sal", "2 huevos de gallinas camperas", "210ml / 7fl de leche en oz", "90ml / 3fl oz de agua", "1 cucharada de aceite vegetal", "mantequilla, para freír", "azúcar glas", "jugo de limon", "Rodajas de limón"], "method": ["Mezcle la harina y la sal juntas en un tazón grande.", "Haz un pozo en el centro y rompe los huevos.", "En otro recipiente, mezcle la leche y el agua.", "Batir los huevos en la harina con una cuchara de madera y poco a poco batir en la mezcla de leche y agua para obtener un líquido suave y la consistencia de una sola crema.", "Agregue el aceite y deje reposar por 30 minutos antes de usar.", "Caliente una sartén antiadherente hasta que esté muy caliente, luego agregue un poco de mantequilla. Coloque un cucharón en un cucharón de la mezcla, girando rápidamente la sartén para cubrir la base de manera uniforme con la mezcla. Cocine por 30 segundos a un minuto, hasta que la base esté ligeramente dorada.", "Con una espátula, voltee suavemente la tortita y cocine en el otro lado durante unos segundos, hasta que se dore. Deslice el panqueque en un plato, cubra con papel a prueba de grasa y manténgalo caliente. Repita el proceso con la masa restante.", "Para servir, espolvorear los panqueques con azúcar en polvo y jugo de limón, luego doblar dos veces para formar triángulos. Sirva las rodajas de limón al lado."], "url": "www_bbc_co_uk_food_recipes_pancakebatter_13556", "title": "Panqueques del día de panqueque", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "6 panqueques", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakebatter_13556_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de harina natural", "pequeña pizca de sal", "1 huevo mediano de gallinas camperas", "150ml / 5fl de leche en oz", "2 cucharaditas de aceite vegetal o mantequilla derretida, más extra para freír", "100 g / 3½ oz de chocolate blanco, roto en pequeños trozos", "200 g / 7 oz de bayas congeladas"], "method": ["Pon la harina y la sal en un tazón grande. Haga un pozo en el centro, vierta la leche y rompa el huevo. Usando un batidor, incorpore gradualmente la harina en los ingredientes húmedos hasta que tenga una mezcla suave. Agregue el aceite vegetal y mezcle bien.", "Caliente una sartén grande a fuego medio. Agregue un poco de aceite y use papel de cocina para untarlo por toda la base de la sartén. Agregue un cucharón pequeño de masa y agítelo alrededor de la sartén para crear una capa delgada y uniforme. Cocine durante 1-2 minutos, o hasta que la mezcla esté un poco más oscura y colocada en el centro (para verificar, levante el borde del panqueque y verifique que la parte inferior esté ligeramente dorada). Voltéelo y cocine el otro lado durante 30-40 segundos. Transfiera a un plato caliente y cubra con una toalla de té limpia para mantenerlo caliente. Cocine la mezcla restante de la misma manera para hacer 3 panqueques más.", "Para el aderezo, derrita el chocolate en un tazón resistente al calor colocado sobre una sartén de agua hirviendo a fuego lento. Alternativamente, derrita el chocolate en ráfagas cortas en un microondas.", "Coloque un panqueque en cada plato y divida las bayas congeladas entre ellos. Rocíe el chocolate derretido sobre la parte superior y sirva inmediatamente. El calor de los panqueques y el chocolate descongelarán las bayas rápidamente, pero querrás que se enfríen (es el contraste de temperaturas lo que lo hace tan especial)."], "url": "www_bbc_co_uk_food_recipes_pancakes_with_berries_54226", "title": "Panqueques con bayas y chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakes_with_berries_54226_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "15 g / ½ oz de azúcar en polvo", "pizca de sal", "4 huevos medianos de granja", "350ml / 12fl oz de leche entera", "50 g / 1¾oz de mantequilla derretida, para freír", "1 lechuga romana, cortada en cuartos", "4 cucharadas de aceite de oliva", "2 naranjas, solo jugo", "1 palito de canela, partido por la mitad", "2 cucharadas de miel clara", "pellizcar el azafrán", "150 g / 5½ oz de queso feta, desmenuzado"], "method": ["Para los panqueques, combine la harina, el azúcar y la sal, luego mezcle los huevos con un batidor. Agregue la leche gradualmente para evitar grumos.", "Para cocinar los panqueques, agregue una mancha de mantequilla derretida a una sartén antiadherente, usando un pincel de pastelería. Ponga un cucharón en un poco de masa, revolviéndolo para cubrir la sartén; podría tomar uno o dos panqueques de prueba antes de que tenga la cantidad justa de masa. Cocine cada panqueque en ambos lados hasta que estén dorados y luego retírelos a un plato mientras cocina el próximo panqueque.", "Para la ensalada, coloque la lechuga cortada en agua helada y déjela por un par de minutos. Justo antes de servir, retirar del agua y rociar con aceite de oliva.", "Para el glaseado, caliente una cacerola mediana y agregue el jugo de naranja y la rama de canela. Agregue la miel y el azafrán y cocine hasta que se reduzca a un glaseado almibarado.", "Espolvoree el queso feta en los panqueques y dóblelos en cuartos. Regrese los panqueques doblados a la sartén y vierta sobre el glaseado. Calienta suavemente por unos minutos.", "Sirva los panqueques con el glaseado restante vertido en la parte superior. Sirve la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_pancakes_with_feta_47079", "title": "Panqueques con queso feta glaseado con canela, miel, naranja y azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "Harina normal de 200g / 7oz", "350 ml / 12 fl oz de leche", "pizca de sal", "2 cucharaditas de aceite vegetal", "55g / 2oz de mantequilla sin sal", "2 ramitas de lavanda fresca", "3½ cucharadas de miel", "2 melocotones, descuartizados y piedras quitadas", "2 nectarinas, en cuartos y piedras removidas", "1 naranja, solo jugo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Para los panqueques, rompe los huevos en un tazón y bate la harina hasta que esté suave. Agregue la leche, la sal y una cucharadita de aceite vegetal.", "Usando una toalla de cocina de papel, unte la base de una sartén antiadherente con el aceite restante antes de dejar que se caliente suavemente.", "Cuando la sartén esté caliente, vierta un poco de la mezcla de panqueque hasta que cubra uniformemente la base de la sartén.", "Permita que el panqueque se coloree hasta que se dore por debajo antes de girar y cocinar por el otro lado. Una vez dorado, retirar de la sartén y colocar en un plato. Es útil separar los panqueques con pequeños trozos de papel para hornear. Repita el proceso hasta que haya ocho panqueques. Coloque los panqueques en el horno para mantenerlos calientes.", "Para las frutas tostadas, coloca la mantequilla, una ramita de lavanda y la miel en una sartén antiadherente, a prueba de horno y calienta suavemente. Agregue la fruta a la sartén y caramelice ligeramente antes de colocar la sartén en el horno y cocinar durante aproximadamente cinco minutos.", "Retire las frutas del horno. Agregue el jugo de naranja a las frutas y use una cuchara de madera para raspar los jugos caramelizados del fondo y los lados de la sartén. Agregue otra ramita de lavanda fresca. Déjalo descansar.", "Retire los panqueques del horno. Para servir, coloque un panqueque en un plato, espolvoree parte de la fruta y su jugo y doble o enrolle el panqueque. Repite esto por el resto de los panqueques."], "url": "www_bbc_co_uk_food_recipes_pancakesservedwithro_86540", "title": "Panqueques con melocotones y nectarinas tostados y miel de lavanda", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza 110g / 4oz", "1 cucharadita de polvo de hornear", "1 cucharada de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "100-125ml / 4-1½ fl oz de leche", "Aceite para freír", "100 g / 3½ oz de arándanos frescos", "100 ml / 3½ fl oz de vino tinto", "Pizca de canela", "1 cucharada de azúcar en polvo", "½ cucharadita de extracto de vainilla", "1 cucharada de almendras en copos", "50ml / 1¾fl oz de crema doble"], "method": ["Para los panqueques mezcle la harina, el polvo de hornear y el azúcar.", "Agregue el huevo y la leche gradualmente para formar una masa espesa.", "Calentar una sartén, cubierta con aceite. Coloque la masa en rondas en lotes, cocinando 2-3 minutos por cada lado. Mantener caliente", "Para la salsa de arándanos, agregue todos los ingredientes a una cacerola pequeña y cocine a fuego lento durante diez minutos, hasta que estén reducidos y almibarados.", "Para servir, coloque los panqueques en un plato, rocíe con salsa de arándanos, cubra con almendras copos y vierta la crema por el exterior."], "url": "www_bbc_co_uk_food_recipes_pancakeswithblueberr_78069", "title": "Panqueques con salsa de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]