[{"isVegetarian": true, "title": "Orange Catalonian crème brûlée", "url": "www_bbc_co_uk_food_recipes_orangecataloniancreg_7101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oranges, peeled with a knife and cut into pithless segments, soaked in ", "1 tbsp Grand Marnier, or similar", "590ml/1pint double cream", "1 vanilla pod, cut in half and scraped ", "6 egg, yolks only", "50g caster sugar, plus 4 tbsp for sprinkling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 140C/275F/Gas1. ", "Divide the orange segments between each terracotta dish. Put the cream and vanilla pod into a saucepan and heat to boiling point. Cover and allow to infuse for 10 minutes.", "Whisk the egg yolks and sugar together until pale and thick and add the cream. Stir well, strain and pour over the orange segments.", "Cook in a water bath for about 20 minutes, until just set. Leave to chill overnight if time allows or for at least 2-3 hours.", "Sprinkle sugar thinly and evenly over each dish and caramelise with a blowtorch (or under a very hot grill), repeat this process until you have golden crackling topping. ", "Leave to cool and serve within 2 hours.", ""]}, {"isVegetarian": false, "title": "Orange jelly with strawberry coulis and vanilla cream", "url": "www_bbc_co_uk_food_recipes_orangejellywithstraw_87443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 125g/4½oz packet ready-made orange jelly", "30g/1oz chocolate buttons", "85g/3oz fresh strawberries", "1 tbsp icing sugar", "1 tsp balsamic vinegar", "100ml/3½oz double cream", "1 vanilla pod, seeds removed", "sprig fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the orange jelly onto the middle of a serving plate. ", "Grate the chocolate around the jelly. ", "Place 55g/2oz of the strawberries in a small food processor with the icing sugar and balsamic vinegar and blend together to a smooth consistency. Pour into a small bowl. ", "Slice the remaining strawberries and arrange on the plate, around the jelly. Spoon the coulis over the strawberries. ", "Whip the cream in a bowl until soft peaks form when the whisk is removed and stir in the vanilla seeds. Spoon the vanilla cream on top of the jelly. Garnish with a sprig of fresh mint."]}, {"isVegetarian": true, "title": "Orange olives", "url": "www_bbc_co_uk_food_recipes_orangeolives_79055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 clove garlic, peeled and finely chopped", "1 orange, grated zest only", "¼ tsp chilli flakes", "110g/4oz black olives, pitted", "cumin seeds, to serve"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the olive oil into a bowl and stir in the garlic and orange zest.", "Stir in the chilli flakes then add the black olives. Stir again to coat in the oil.", "Transfer the olives to a serving dish and sprinkle with a few cumin seeds, to serve."]}, {"isVegetarian": true, "title": "Orange soufflé", "url": "www_bbc_co_uk_food_recipes_orangesouffle_89078", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "3 tbsp caster sugar, plus extra for sprinkling", "2 large sugar cubes", "1 orange", "250ml/8 fl oz milk", "1 vanilla pod, split", "25g/1oz plain flour", "4 free-range eggs, separated", "4 tbsp orange liqueur", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Butter the inside of a large oven-proof pudding dish and dust with caster to coat the inside evenly with sugar.", "Rub the sugar cubes over the skin of the orange to extract the oil, then crush the sugar cubes in a pestle and mortar. ", "Grate the orange peel to remove the orange zest (do not grate the white pith) and reserve the zest.", "Pour the milk into a pan over a low heat and add the vanilla pod, the sugar cubes and the orange zest. Bring to the boil, stirring occasionally, then cover and remove from the heat. Leave to cool then remove the vanilla pod.", "Place the flour into a clean pan and add a splash of the cooled vanilla and orange-infused milk. Add the caster sugar and mix well. Place over a low heat and gradually stir in the remaining milk infusion, mixing well to avoid lumps. Bring to the boil, then reduce the heat to simmer for 30 seconds, stirring continuously, until smooth and thickened. Remove from the heat and stir well for a couple of minutes.", "Whisk the egg yolks into the cooled sauce one at a time, then cover the mixture with cling film and leave to cool.", "When the mixture is cold, stir in the orange liqueur.", "Place the egg whites into a clean bowl and whisk until soft peaks form when the whisk is removed.", "Fold the whisked egg whites into the milk and egg yolk mixture.", "Transfer the soufflé mixture to the prepared pudding dish and run the handle of a spoon around the inside of the rim of the dish to make a shallow channel in the mixture.", "Place the soufflé into the oven to bake for 15-20 minutes.", "Remove from the oven and dust the surface of the soufflé with icing sugar, then return to the oven to cook for another 5-10 minutes, or until risen and golden-brown.", "Serve immediately at the table in the dish."]}, {"isVegetarian": true, "title": "Orangey honey buns", "url": "www_bbc_co_uk_food_recipes_orangeyhoneybuns_91684", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp caster sugar", "150g/5½oz plain flour", "½ tsp sea salt flakes", "1 x 7g/¼oz sachet easy-blend dried yeast", "3 large free-range eggs, lightly beaten", "75g/2¾oz butter, slightly softened, cut into cubes, plus extra for greasing", "500g/1lb 2oz caster sugar", "1 orange, rind only, rind cut into 4 long strips", "500ml/17fl oz cold water", "100g/3½oz clear honey", "4 tbsp orange liqueur", "½ tsp orange-flower water (optional)", "whipped cream, to serve"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease the wells of a 12-hole muffin tray with butter.", "Mix together the sugar, flour, salt and yeast in a large bowl until well combined. Add half of the beaten eggs, then whisk using an electric whisk until the mixture is well combined and forms a sticky paste.", "Gradually whisk in a little of the remaining beaten egg. When the egg is fully incorporated into the mixture, add 1-2 butter cubes and whisk in until fully incorporated into the mixture.", "Whisk the remaining beaten egg and remaining butter cubes into the mixture in alternate turns, until the mixture comes together as a soft dough. Using a wooden spoon, beat the dough until smooth.", "Divide the dough mixture equally among the wells in the prepared muffin tray. Set aside in a warm place for about an hour, or until the portions of dough have proved (ie. doubled in size and filled the wells in the tray).", "Meanwhile, preheat the oven to 220C/425F/Gas 7.", "When the dough has proved, bake the buns in the oven for 12-15 minutes, or until well risen and pale golden-brown. Set aside to cool on a wire rack.", "Meanwhile, for the syrup, heat the sugar, orange rind and cold water in a pan over a low heat, stirring well. When the sugar has dissolved, bring the mixture to the boil and continue to boil for three minutes, or until the mixture has thickened and resembles syrup.", "Remove the pan from the heat and stir in the honey, orange liqueur and orange-flower water, if using, until well combined. Set aside until cooled slightly.", "Dip six of the buns into the cooled syrup and serve straightaway on serving plates with a spoonful of whipped cream.", "Pack the remaining buns into a 1 litre/1¾ pints sterilised jar. Pour in the remaining syrup and set aside for 20 minutes, then cover the jar and seal tightly. The buns can be kept in the fridge for up to one month."]}, {"isVegetarian": false, "title": "Organic salmon and brassicas", "url": "www_bbc_co_uk_food_recipes_organic_salmon_and_58694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz chives", "50g/1¾oz leek tops ", "50g/1¾oz spring onion tops", "300ml/10fl oz sunflower oil", "pinch salt", "100ml/3½fl oz white wine vinegar", "75g/2¾oz caster sugar", "1 tsp salt", "1 turnip, peeled and sliced", "400ml/14fl oz extra virgin olive oil", "4 sprigs thyme", "10 juniper berries", "10 coriander seeds ", "4 sprigs pine ", "4 spears purple sprouting broccoli, blanched and roasted", "4 cauliflower florets, blanched and roasted", "4 tbsp chicken stock", "4 x 150g/5½oz organic salmon fillets", "2 heads broccoli, stems removed and broken into florets", "salt, to taste", "½ red cabbage, juiced, to yield 250g cabbage juice", "5 tsp soy sauce", "5 tsp mirin", "½ tsp agar agar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the onion oil, blend all the ingredients, except the chicken stock, in a food processor for five minutes. Pour the mixture into a cheesecloth set over a clean bowl and leave to drain overnight. Season the oil with salt and store in an airtight container until needed.", "For the pickled turnip, place the vinegar, sugar and salt into a saucepan and bring to the boil. Leave to cool then place the turnip slices into a bowl or preserving jar and pour the liquid over the top. Leave to marinade for at least one hour.", "For the salmon, place the extra virgin olive oil, thyme, juniper, coriander and pine into a saucepan and heat to 80C/175F. Allow to cool. ", "When you are ready to cook the salmon, heat the infused oil in a wide pan to 46C/115F. Drop in the salmon, remove the pan from the heat and leave for 30 minutes.", "For the broccoli purée, bring a large pan of salted water to the boil, add the broccoli florets and blanch for 90 seconds. Drain well, reserving the liquid, then place the broccoli into a food processor and blend until smooth - if the mixture seems a little thick add a little of the cooking water. Season the purée with a little salt then pass through a fine sieve into a bowl set over an ice bath.\t", "For the red cabbage purée, mix the cabbage juice with the soy and mirin in a saucepan. Season with a little salt, if necessary, then whisk in the agar agar. Bring to a boil, let the mixture bubble for 10 seconds then remove from the heat and pour into a bowl set over an ice bath. When cool and set, blend the mixture to a smooth purée, pass through a fine sieve and chill in the fridge until needed.", "To serve, when the salmon is a few minutes off being cooked, start dressing the plate. Spoon the red cabbage purée into the centre of the plate. Scatter over some of the cauliflower florets then top with the salmon. Place the purple-sprouting broccoli alongside with a spoonful of the broccoli purée. Pile the pickled turnip at the edge of the salmon. Whisk the chicken stock into three tablespoons of the onion oil and quickly warm through in a saucepan. Drizzle the warmed oil around the edge of the food and serve immediately. "]}, {"isVegetarian": false, "title": "Organic new season lamb with rosemary, lemon and zucchero rosato", "url": "www_bbc_co_uk_food_recipes_organicnewseasonlamb_74899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 leg of new season organic lamb, boned and butterflied (you can ask your local butcher to do this for you)", "1 small jar zucchero rosato (rose petal jam) ", "3 tbsp Dijon mustard", "2 unwaxed lemons, grated zest only", "generous bunch of fresh rosemary, stalks removed and leaves roughly chopped", "2 tbsp extra virgin olive oil", "sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/356F/Gas 4. ", "For the rose coating, blend all of the ingredients together in a bowl, adding the olive oil last.", "Season the lamb generously with sea salt and freshly ground black pepper and spread the rose coating all over the skin, using it all up.", "Place the lamb in the preheated oven for 35 minutes.", "Remove from the oven and allow to sit for 20 minutes before slicing and serving."]}, {"isVegetarian": false, "title": "Oriental-style marinated rump of lamb", "url": "www_bbc_co_uk_food_recipes_oriental-style_marinated_79700", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece fresh ginger, peeled, finely grated", "4 garlic cloves, peeled", "3 tbsp soy sauce", "2 tbsp ketjap manis", "2 tbsp ready-made sweet-and-sour plum sauce", "2 tbsp mirin", "2 tbsp sesame oil", "extra virgin olive oil", "6 x 160-180g/5-6oz lamb rumps"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, blend all of the marinade ingredients except the olive oil to a smooth paste in a food processor (Alternatively, grind to a paste in a pestle and mortar.) Gradually add a drizzle of olive oil to loosen the marinade mixture as necessary.", "For the lamb, transfer the marinade to a resealable freezer bag and add the lamb rumps. Seal the bag, removing as much air as possible as you do so, then massage the mixture into the meat and set aside in the fridge to marinate for between 2 hours and 24 hours.", "When the meat has marinated, either preheat the oven to 190C/375F/Gas 5, or prepare a barbecue.", "Remove the marinated lamb rumps from the freezer bag and shake off any excess marinade. Place the marinated lamb rumps into a roasting tray and roast in the oven for 20-25 minutes (for medium, depending on the size of the rumps), or until cooked to your liking. Alternatively, cook the lamb rumps on the hot barbecue grill."]}, {"isVegetarian": false, "title": "Asian-inspired cod with stir fry", "url": "www_bbc_co_uk_food_recipes_oriental_cod_with_stir_72954", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_cod_with_stir_72954_16x9.jpg", "ingredients": ["150g/5½oz cod or haddock fillet, boneless", "1 tbsp soy sauce", "1 tbsp mirin ", "1 tsp rice vinegar ", "2 tsp sunflower oil ", "½ red pepper (60g/2¼oz), thinly sliced", "1 small carrot (50g/1¾oz), thinly sliced", "50g/1¾oz mangetout, thinly sliced ", "1 tsp toasted sesame seeds", "few sprigs fresh coriander (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the fish in a plastic food bag, add the soy, mirin and rice vinegar. Give it a good shake and refrigerate or freeze until ready to cook.", "Preheat the grill to its hottest setting and line a small roasting tin with foil. Drain the fish, reserving the marinade. Put the fish on the foil and grill for 5 minutes, or until cooked through.", "Meanwhile, heat a small wok or frying pan over a high heat and add the oil. Add the vegetables and stir-fry for 30 seconds. Add 2 tablespoons water and the reserved marinade and cook for 1–2 minutes, or until hot through. ", "Place the vegetables on a warm plate and top with the fish. Scatter over the sesame seeds and coriander, if using. "]}, {"isVegetarian": false, "title": "Vietnamese-style crayfish and noodle salad", "url": "www_bbc_co_uk_food_recipes_oriental_vegetable_99308", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_vegetable_99308_16x9.jpg", "ingredients": ["200g/7oz extra-fine dried rice noodles", "½ cucumber, halved lengthways", "150g/5½oz cooked and peeled crayfish tails", "1 red pepper, deseeded and thinly sliced", "150g/5½oz beansprouts", "6 spring onions, thinly sliced on the diagonal", "1 small carrot, cut into fine matchsticks", "½–1 fresh red chilli, deseeded and finely chopped", "1 small bunch fresh coriander, chopped", "1 small bunch fresh mint, chopped", "3cm/1¼in piece fresh root ginger, peeled and finely grated", "1 garlic clove, crushed ", "30g/1oz salted peanuts, chopped, to serve (optional)", "salt and freshly ground black pepper", "3 tbsp Thai fish sauce", "3 tbsp lime juice (1–2 limes)", "3 tbsp light muscovado sugar", "1 tbsp sesame oil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice noodles in boiling water according to the packet instructions, or until they are al dente, then drain and refresh in cold water. Drain again and snip into shorter lengths.", "Using a teaspoon, scoop out the cucumber seeds along the middle of the half and discard. Thinly slice the cucumber on the diagonal and tip into a large salad bowl. ", "Add all the remaining salad ingredients, including the cooked noodles, season with salt and pepper, and toss together.", "For the dressing, mix all the ingredients together in a small bowl. Just before serving, pour the dressing over the salad and toss together. Scatter with the peanuts, if using."]}, {"isVegetarian": false, "title": "Oriental salmon broth", "url": "www_bbc_co_uk_food_recipes_orientalbroth_84531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp sesame oil", "1 garlic clove, chopped", "½ stick lemongrass, outer leaves discarded, finely chopped", "300ml/10½fl oz hot vegetable stock", "100g/3½oz salmon fillet, cubed", "55g/2oz ready-made thin rice noodles, cooked according to packet instructions", "2 lime wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sesame oil in a wok over a low heat. Add the garlic and lemongrass and fry for 3-5 minutes.", "Add the vegetable stock and salmon pieces. Bring to the boil, then reduce the heat to simmer gently for 5-10 minutes, or until the salmon is cooked. ", "Add the noodles and stir well.", "To serve, pour the broth into a bowl and add the lime wedges."]}, {"isVegetarian": true, "title": "Oriental broth with noodles", "url": "www_bbc_co_uk_food_recipes_orientalbrothwithnoo_77710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz plain flour", "2 free-range eggs ", "25ml/1oz water ", "500ml/17fl oz chicken or vegetable stock ", "1 tbsp soy sauce ", "½ tsp chilli flakes", "1 lime, juice only ", "2 tbsp coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the plain flour with the eggs and water and mix to form a smooth dough.", "Using a pasta machine, place the noodle dough onto the fine noodle setting.  Create your noodles by feeding the pasta through slowly.", "To make the broth, place the chicken or vegetable stock in a deep saucepan with the soy, chilli flakes, lime juice and coriander.  Simmer for five minutes then add the noodles. Cook for a further three minutes and serve in a large bowl."]}, {"isVegetarian": false, "title": "Oriental chicken noodle broth", "url": "www_bbc_co_uk_food_recipes_orientalchickennoodl_84515", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, chopped", "1 garlic clove, chopped", "1 red chilli, sliced", "150ml/5fl oz hot chicken stock", "75g/2½oz chicken breast, cut into strips", "50g/1oz ready-made egg noodles, cooked according to packet instructions", "2 spring onions, chopped", "handful bean sprouts", "salt and freshly ground black pepper", "1 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a medium saucepan over a medium heat. Add the onion and cook for 2-3 minutes, until softened.", "Add the garlic and chilli and cook for another minute.", "Add the chicken stock and chicken breast. Bring to the boil, then reduce the heat to simmer for four minutes, or until the chicken is completely cooked through.", "Add the noodles, spring onions and beans sprouts and season, to taste, with salt and freshly ground black pepper.", "To serve, pour into a bowl and sprinkle with sesame seeds."]}, {"isVegetarian": false, "title": "Oriental chicken pie", "url": "www_bbc_co_uk_food_recipes_orientalchickenpie_67963", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 fresh or dried shiitake mushrooms", "½ roasted or poached chicken", "4 shallots, or 1 small onion", "2 tbsp vegetable oil", "1 tbsp plain flour", "110ml/4fl oz chicken stock ", "1 tbsp soy sauce", "1 tbsp oyster sauce", "1 tbsp hoi sin or plum sauce", "2 tbsp coriander leaves", "500g/1lb 2oz packet frozen puff pastry", "1 egg, yolk only, beaten with", "1 tbsp milk", "110g/4oz mange tout, julienned"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the dried mushrooms in hot water for 30 minutes. ", "Heat the oven to 200C/400F/Gas 6. ", "Shred the meat from the chicken and finely chop.", "Finely slice the shallots or onion. Drain the dried mushrooms, trim off the stalks and finely slice. Trim and finely slice the fresh mushrooms if using.", "Heat the oil, and cook the shallots gently until soft. Sprinkle with the flour, and cook, stirring constantly, for 2 minutes, then gradually add the chicken stock, stirring. ", "Add the mushrooms and soy sauce, oyster and hoi sin sauces and simmer for 5 minutes. Remove from the heat, stir in the chicken and coriander leaves, and leave to cool. ", "Thaw the pastry, roll out, and cut into 8x15 cm squares. Plop 1 hearty tbsp of the mixture on four of the squares, top with the remaining squares, and press down around the filling. Place a large glass or small Chinese bowl over the top, and trim into a circle. ", "Brush with egg yolk, cut a small slash in the top, and bake for 20 minutes or until golden. ", "Serve with julienned mange tout on the side."]}, {"isVegetarian": false, "title": "Oriental chicken salad", "url": "www_bbc_co_uk_food_recipes_orientalchickensalad_68063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalchickensalad_68063_16x9.jpg", "ingredients": ["4 skinless, boneless chicken breasts", "4 tbsp clear honey", "2 tbsp rice vinegar", "2 tbsp soy sauce", "1 tbsp sesame oil", "1 garlic cloves, crushed", "2.5cm/1in piece fresh ginger, peeled and grated", "2 tbsp sesame seeds, toasted", "small bunch of fresh coriander, roughly chopped", "1 large carrot, cut into fine matchsticks", "1 bunch of spring onions, shredded", "½ cucumber, peeled, halved, de-seeded and cut into matchsticks", "½ Chinese lettuce, finely shredded"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the chicken into thin strips and mix with the honey, vinegar and soy sauce. Leave to marinate in a non-metallic bowl for about 30 minutes. ", "Heat the sesame oil in a frying pan and cook the chicken over a high heat with any marinade for about 5 minutes until the chicken is cooked through, leaving some cooked marinade in the pan to use as the salad dressing.", "To serve warm, toss in a large bowl with the remaining ingredients and eat immediately. To serve cold, leave the cooked chicken and marinade to cool and then toss with the remaining ingredients."]}, {"isVegetarian": false, "title": "Oriental lamb cutlets with soy, honey and chilli on hot bean salad", "url": "www_bbc_co_uk_food_recipes_orientallambcutletsw_87032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz green beans, trimmed", "1 tbsp olive oil", "1 garlic clove, crushed", "½ onion, finely sliced", "¼ tsp caster sugar", "½ tsp chilli flakes", "2 lamb cutlets", "½ tsp chilli flakes", "2 tbsp soy sauce", "1 tbsp clear honey", "½ lime, juice only", "½ orange, juice only", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, bring a pan of salted water to the boil and blanch the green beans for two minutes. Drain.", "Heat the olive oil in a non-stick frying pan and add the garlic, onion, sugar and chilli flakes and sauté until the onion is soft but not coloured. ", "Add the drained green beans to the pan and fry for a further one minute. Set aside to keep warm.", "For the oriental lamb cutlets, heat a small non-stick frying pan and place the lamb cutlets, fat-side down, into the pan until the fat has melted and is crisp and golden-brown. Turn the lamb cutlets over and brown on the other side, until the lamb is almost cooked through.", "Add the remaining ingredients to the pan, stir well, and fry the lamb for a further two minutes on each side until the juices have reduced to half the volume.", "To serve, place the lamb cutlets on a bed of the warm beans and garnish with chervil."]}, {"isVegetarian": false, "title": "Oriental marinade", "url": "www_bbc_co_uk_food_recipes_orientalmarinade_5313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp groundnut oil", "4 tbsp pale sherry or rice wine", "2 tbsp light soy sauce", "2 cloves garlic, crushed", "2.5cm fresh ginger, finely grated", "freshly ground black pepper"], "serves": "Makes 175ml/6fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all ingredients. Cover the meat, poultry, fish or shellfish and leave for 2-3 hours. "]}, {"isVegetarian": true, "title": "Oriental-style omelette with shiitake mushrooms", "url": "www_bbc_co_uk_food_recipes_orientalomelettewith_86859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp soy sauce", "3 free-range eggs", "1 tbsp olive oil", "100g/3½oz shiitake mushrooms, sliced", "2 choy sum leaves, roughly chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly whisk the eggs and soy sauce together in a bowl.", "Heat the olive oil in a non-stick frying pan and sauté the mushrooms until tender. ", "Stir in the choy sum leaves and cook for one minute, until just wilted.", "Pour in the egg mixture and cook gently until the base sets, then turn over and cook for a further minute. Serve immediately."]}, {"isVegetarian": false, "title": "Sticky barbecue chicken wings and drumsticks", "url": "www_bbc_co_uk_food_recipes_orientalstickychicke_67594", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalstickychicke_67594_16x9.jpg", "ingredients": ["6 chicken drumsticks, preferably free-range ", "6 chicken wings, preferably free-range", "2 tbsp clear honey", "3cm/1¼in piece of fresh ginger, peeled and grated", "1 garlic clove, crushed", "1½ tsp Chinese five spice ", "2 tsp soy sauce", "3 tbsp orange marmalade", "½ tsp grated orange zest", "1 tbsp sesame oil"], "serves": "Makes 12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Slash the chicken drumsticks three to four times each with a sharp knife and place in a non-metallic bowl with the chicken wings. Mix together all of the marinade ingredients and pour over the chicken. Leave to marinate for at least 2 hours, or overnight if you can, turning occasionally. ", "Once it has marinated, place the chicken on the barbecue over medium-hot coals and cook for about 20 minutes, brushing with any marinade left in the dish as it cooks. If it's colouring too quickly, move to a cooler part of the barbecue to cook more gently. It's important you cook the chicken all the way through. ", "If you're unsure, pierce a drumstick with a skewer: if the juices are still pink, carry on cooking. Eat as soon as they're cool enough to handle, with the sticky sauce all around your mouth and fingers. Isn't that what barbecues are all about?", "The chicken can also be cooked in the oven for perfect picnic food. Preheat the oven to 200C/400F/Gas 6.", "Transfer the chicken into a roasting tray with a couple of spoonfuls of marinade. Place in the oven for about 50 minutes, turning occasionally and basting with the marinade and juices until thoroughly sticky and golden, adding extra marinade to the tray if necessary. Once the chicken pieces are cooked, eat them when fresh and hot, or leave to cool before packing up for a picnic or packed lunch."]}, {"isVegetarian": false, "title": "Oriental salad cups", "url": "www_bbc_co_uk_food_recipes_orientalsaladcups_88819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp tinned chickpeas, rinsed and drained", "100g/3½oz flaked cooked salmon", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh coriander ", "1 tbsp chopped fresh mint", "½ tsp chilli flakes", "1 tbsp soy sauce", "1 lime, zest and juice only", "1 tsp honey", "1 tbsp sesame seeds", "1 tbsp sesame oil", "4 whole iceberg lettuce leaves", "1 orange, cut into wedges", "1 tbsp chopped fresh parsley leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together in a bowl and stir until well combined.", "Divide the mixture evenly and spoon into four lettuce cups placed on a serving plate. Garnish with the orange wedges and sprinkle over the parsley."]}, {"isVegetarian": false, "title": "Oriental-style citrus mackerel with rocket salad", "url": "www_bbc_co_uk_food_recipes_orientalstylecitrusm_88381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange, juice only", "2 tsp soy sauce", "pinch dried chilli flakes", "1 tsp sesame seeds", "1 mackerel fillet, cut in half", "½ lime, juice only", "2 tbsp chopped fresh coriander leaves", "handful fresh rocket", "1 orange, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the orange juice, soy sauce, chilli flakes and sesame seeds into a frying pan and simmer for 3-4 minutes.", "Add the mackerel and cook for two minutes on each side, or until cooked through. Remove from the heat, squeeze in the lime juice and scatter with coriander.", "Place the rocket leaves into a bowl, pour over the juices from the mackerel pan and stir.", "To serve, pile the rocket salad onto a serving plate. Top with the mackerel and garnish with orange wedges."]}, {"isVegetarian": false, "title": "Oriental-style chicken with guacamole", "url": "www_bbc_co_uk_food_recipes_orientalstylechicken_85425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "2 tbsp sesame oil", "1 lime, juice only ", "1 piece fresh ginger, peeled, grated", "2 red chillies, finely chopped", "1 bunch of coriander, leaves removed, roughly chopped", "2 tbsp soy sauce", "2 tbsp honey", "1 tbsp Worcestershire sauce", "4 boneless skinless chicken breasts, cut into 1cm/½in strips", "sea salt and freshly ground black pepper", "6 spring onions, sliced on the diagonal", "2 tbsp sesame seeds, toasted", "2 ripe avocados, skinned and chopped", "2 limes, juice only", "1 clove garlic, crushed to a paste", "4 tbsp fresh coriander, chopped", "1 red chilli, finely chopped", "1 shallot, finely chopped", "150ml/5fl oz olive oil", "splash Tabasco sauce", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, place all the marinade ingredients into a bowl and mix to combine.", "For the chicken, place the chicken into the bowl of marinade. Stir well and leave to marinate in the fridge, covered in cling film for at least one hour.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a griddle pan until hot then add the marinated chicken strips. Cook over a high heat for 1-2 minutes, turning once so they brown nicely on both sides.", "Transfer the chicken strips to a baking sheet and place into the oven to cook for a further five minutes, or until completely cooked through. ", "Remove the chicken from the oven and season with coarse sea salt and freshly ground black pepper. Sprinkle with the spring onions and toasted sesame seeds.  ", "For the guacamole, place the chopped avocados into a bowl and add the lime juice.", "Add the remaining guacamole ingredients, mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the chicken onto six plates with a spoonful of guacamole served alongside each."]}, {"isVegetarian": true, "title": "Oriental-style noodle stir-fry", "url": "www_bbc_co_uk_food_recipes_orientalstylenoodles_85589", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ onion, finely sliced", "1cm/½in piece root ginger, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz wild mushrooms", "50g/2oz spinach", "100g/3½oz ready-cooked udon noodles", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan, add the onion, ginger and garlic and stir fry for 1-2 minutes.", "Add the wild mushrooms and spinach and stir fry until softened. Add the noodles, season, to taste, with salt and freshly ground black pepper, and stir well.", "To serve, place the noodle stir-fry into a serving dish and sprinkle with chives."]}, {"isVegetarian": false, "title": "Oriental-style salmon and noodle broth", "url": "www_bbc_co_uk_food_recipes_orientalstylesalmona_85347", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp sesame oil", "200ml/7fl oz hot vegetable stock", "1 tbsp soy sauce", "2 x 50g/1½oz pieces salmon fillet, skinned ", "50g/1¾oz rice noodles", "1 tbsp sesame seeds, to garnish", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive and sesame oil, stock and soy sauce into a saucepan and bring to the boil.", "Reduce the heat to a simmer. Add the salmon pieces to the pan and poach for 3-4 minutes, or until almost cooked through.", "Add the noodles to the pan and remove from the heat. Cover with a lid and leave for a few minutes, until the noodles have softened.", "To serve, pour the broth into a bowl and sprinkle over the sesame seeds and chives."]}, {"isVegetarian": false, "title": "Thai-style beef salad with tagliatelle", "url": "www_bbc_co_uk_food_recipes_orientalthaibeefsala_78245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½ sirloin steak", "½ banana shallot, diced", "100g/3½ mangetout, thinly sliced", "55g/2oz cooked egg tagliatelle", "1 tbsp soy sauce", "1 tbsp oil", "handful fresh mint", "handful fresh basil", "handful fresh coriander", "2 tbsp caster sugar", "splash of water", "½ red chilli, diced", "1 clove garlic, crushed", "1 tsp sesame oil", "2 tsp white wine vinegar", "1 tbsp fresh coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Add the steak and cook to your liking. Remove from the pan and leave to rest.", "Add the shallot to the pan and cook to soften for two minutes.", "Add the mangetout and stir fry for a further minute.", "Add the soy sauce, olive oil and tagilatelle to heat through.", "Stir through the fresh herbs, and put onto a warm plate.", "For the dressing place the sugar and a splash of water into a pan and melt the sugar over a gentle heat.", "Add the remaining dressing ingredients and stir well over the heat for one minute and remove from the heat.", "To serve, cut the steak into thin strips, serve on top of the pasta salad and drizzle over the dressing."]}]