[{"ingredients": ["350g / 12oz de remolacha cocida y pelada, picada", "1 cebolla rallada", "1 cucharadita de rábano picante rallado", "750g / 1lb 10oz de yogur griego bajo en grasa", "½ cucharadita de sal de apio", "1 cucharada de vinagre de sidra", "½ cucharadita de pimienta negra molida", "hasta 300 ml / ½ pinta de caldo de verduras o leche", "4 cebolletas, finamente picadas"], "method": ["Mezcle la remolacha cocida, la cebolla, el rábano picante, el yogur al estilo griego, la sal de apio, el vinagre de sidra y la pimienta negra en un procesador de alimentos hasta que quede suave.", "Una vez que tenga la consistencia deseada, use caldo de verduras o leche para adelgazar la mezcla.", "La sopa se puede servir caliente o fría. Si prefiere, caliente, caliente a fuego lento, teniendo cuidado de no hervir.", "Verifica el condimento.", "Para servir, vierta en un tazón calentado y espolvoree con cebollas picadas."], "url": "www_bbc_co_uk_food_recipes_beetrootsouponthequi_72798", "title": "Sopa de remolacha en la rápida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3-4 remolachas medianas (del tamaño de una manzana) (aproximadamente 500-600g / 1lb 2oz-1lb5oz, ralladas groseramente, o cogidas en dados pequeños)", "500g / 1lb 2oz de tomates maduros, cortados a la mitad", "1 diente de ajo, picado aproximadamente", "1 cebolla mediana, pelada y finamente picada", "2 cucharadas de aceite de oliva o girasol", "500ml / 16½fl oz buen caldo fuerte (la carne de res es mejor, pero la de pollo o verdura)", "sal y pimienta negra recién molida", "125g / 4oz de queso feta real (es decir, griego no danés)"], "method": ["Coloque los tomates partidos por la mitad en un plato resistente al horno. Tira el ajo y rocía más de la mitad del aceite de oliva.", "Asar durante 25-30 minutos en un horno bastante caliente (190C / 375F / Gas 5) hasta que esté suave y pulposo. Frote a través de un colador para eliminar la piel y las pepitas.", "Calentar el aceite restante en una sartén y sudar la cebolla durante unos minutos hasta que esté suave. Agregue la remolacha y el caldo y deje que hierva. Sazonar ligeramente con sal y pimienta negra recién molida. Cocine a fuego lento durante 7-10 minutos hasta que la remolacha esté tierna.", "Agregue el puré de tomate, transfiera la sopa a una licuadora y procese hasta que esté completamente suave. Pruebe y ajuste el condimento si es necesario", "Para servir frío, enfríe la sopa en el refrigerador, luego divídala entre seis tazones. Con los dedos, desmenuce un poco de queso feta en cada tazón. Una pizca de remolacha cruda rallada es una buena guarnición para la versión fría", "Para servir caliente, recaliente la sopa hasta que esté bien caliente pero no hirviendo. Divida entre los cuencos tibios y desmenuce con un poco de queso feta en cada plato. Sirve con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_beetrootsoupwithfeta_13774", "title": "Sopa de remolacha con queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetrootsoupwithfeta_13774_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 remolachas crudas medianas", "aceite de oliva", "sal marina de escamas grandes", "puñado de menta fresca, finamente picado", "puñado de perejil fresco, finamente picado", "2 cucharadas de alcaparras para bebés, enjuagadas y escurridas", "½ chalote de plátano (o 1 chalota común), finamente picado", "1 diente de ajo, finamente picado", "6 filetes de anchoa en conserva en aceite, escurridos, picados", "½ cucharadita de mostaza Dijon", "4 cucharadas de aceite de oliva", "½ limón, solo jugo"], "method": ["Coloque la remolacha en una sartén grande y cúbrala con agua. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 40 minutos, o hasta que esté tierno. Escurra y deje a un lado hasta que esté lo suficientemente frío como para manipularlo, luego frote con cuidado las pieles de remolacha. Desecha las pieles.", "Coloque la menta, el perejil, las alcaparras, la chalota y el ajo en un tazón.", "Agregue las anchoas y la mostaza y mezcle bien.", "Agregue el aceite de oliva y el jugo de limón con moderación, agregando más según sea necesario. Mezcle bien y déjelo reposar.", "Pica cada remolacha en ocho cuñas iguales y colócalas en un tazón. Espolvoree con un poco de sal y rocíe con la salsa verde.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_beetrootwithgreensau_89906", "title": "Remolacha con salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate belga oscuro, roto en pedazos", "500g / 1lb 2oz de queso blando con toda su grasa", "Crema agria de 200 ml / ⅓ de pinta", "150 g / 5½ oz de azúcar en polvo", "3 huevos grandes", "aceite de girasol, para engrasar", "300 g / 10½ oz galletas de avena de chocolate", "50g / 2oz de mantequilla, derretida", "Trufas de chocolate belgas", "100g / 4oz de chocolate blanco para cocinar, para rallar, o azúcar glas"], "method": ["Engrase ligeramente una lata de pastel con resorte de clip de 23cm y forre la base con papel para hornear.", "Coloque el chocolate para el relleno en un recipiente resistente al calor y colóquelo sobre una fuente de agua hirviendo. Verifique que el fondo del recipiente no toque el agua. Cuando el chocolate se haya derretido, quítelo del fuego y revuelva hasta que quede suave, luego déjelo enfriar por unos minutos.", "Para hacer la masa, divida los bizcochos aproximadamente, luego póngalos en un procesador de alimentos y blitzelos en migas.", "Agregue la mantequilla derretida y mezcle hasta que esté mezclado.", "Incline la mezcla en la lata y presione firmemente sobre la base.", "Pop la lata en el congelador para endurecer.", "Precalentar el horno a 180 ° C / Fan 160 ° C / Gas 4.", "Pon a hervir un hervidor de agua.", "Coloque el queso, la crema agria, el azúcar y los huevos en un procesador de alimentos y mezcle hasta que quede suave. Con el motor en marcha, agregue lentamente el chocolate derretido y mezcle hasta que esté bien combinado.", "Retire la base de galletas del congelador. Tome 2 hojas grandes de papel de aluminio y colóquelas en la superficie de trabajo, una al otro lado. Saque la lata de la torta del congelador y colóquela en el centro de la lámina y colóquela alrededor para crear una forma de cuenco. Coloque todo en una lata de asar. Vierta la mezcla de chocolate en la base de galletas. Luego vierta cuidadosamente el agua caliente de la tetera en la lata de asar hasta que se eleve casi hasta la mitad de los lados de la tarta de queso.", "Hornee la tarta de queso en el centro del horno durante 35-45 minutos. Está listo cuando la mezcla de chocolate está casi firme pero retiene una ligera oscilación.", "Apague el horno, pero coloque una toalla de té doblada en la puerta y deje que se enfríe en el horno con la puerta entreabierta durante al menos 1 hora. Retire, cubra con película adhesiva y deje enfriar durante al menos 4 horas o toda la noche antes de servir.", "Para servir, afloje los lados de la lata con un cuchillo y suelte el clip de resorte. Deslice el postre de la base de la lata a un plato.", "Decore con trufas de chocolate y polvo con chocolate blanco rallado o azúcar glas. Para mayor lujo, servir con un poco de crema. ¡Yum Yum!"], "url": "www_bbc_co_uk_food_recipes_belgian_chocolate_02043", "title": "Tarta de queso de trufa de chocolate belga", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 melocotones maduros, pelados, cortados a la mitad y removidos de piedra, o el equivalente usando melocotones en conserva en jugo natural", "champán helado o vino espumoso", "2 copas de champán refrigeradas"], "method": ["Coloque los duraznos en una licuadora pequeña y puré hasta que estén totalmente suaves. Esto se puede hacer con bastante anticipación y guardar en la nevera. Vierte la mitad en las copas de champán heladas y rellena lentamente con champaña, revolviendo mientras viertes. Lo ideal es que tengas un tercio de puré de durazno en dos tercios de champán. Sirva enseguida como una bebida antes de la cena con el Caviar de Cupido, dejando suficiente tiempo para un segundo vaso cada uno."], "url": "www_bbc_co_uk_food_recipes_bellinicocktail_67941", "title": "Cóctel Bellini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bellinicocktail_67941_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["650g / 1lb 6 oz de vientre de cerdo", "150g / 5oz de sal", "50ml / 2fl oz de salsa de soja", "50g / 2 oz de miel", "25ml / 1fl oz", "25ml / 1fl oz de aceite de sésamo", "4 rebanadas de jamón shonka (disponible en carniceros especializados)", "½ cabeza de coliflor, más o menos picada", "1 cebolla grande, más o menos picada", "Sal 50g / 2oz", "600ml / 1pint 1fl oz de vinagre de vino blanco", "300ml / 11fl oz de vinagre de malta", "pizca de chile seco", "2 cucharadas de harina de maíz", "15g / ½ oz de cúrcuma", "25 g / 1 oz de mostaza en polvo inglesa", "125g / 4½ oz de azúcar", "½ pepino, pelado, sin semillas", "2 manzanas Granny Smith", "2 cucharaditas de jugo de limón", "pizca de sal", "1 cucharada de vinagre balsámico de manzana", "4 floretes grandes de coliflor, finamente cortadas en una mandolina", "1 limón, solo jugo", "sal marina", "3 cucharadas de berro de coriandro", "1 cucharadita de comino molido"], "method": ["Frote el lado de la carne del vientre de cerdo con la sal. Cubra con film transparente y enfríe en la nevera durante 24 horas.", "Retire la carne de cerdo de la nevera y enjuague con agua fría durante al menos 20 minutos.", "Coloque el cerdo en una bolsa sous vide y aspire el sello.", "Caliente un baño de agua a 72 ° C / 160 ° F y coloque el cerdo en la bañera durante 24 horas. Alternativamente, coloque en una olla a presión, cubra y cocine por una hora.", "Una vez cocinado, coloque el cerdo sellado entre dos bandejas para hornear. Presione suavemente con un peso y enfríe en el refrigerador por un mínimo de 12 horas. Una vez presionado, corta el cerdo en cuadrados.", "Coloque la soja, la miel, el mirin y el aceite de sésamo en un tazón y mezcle hasta que esté totalmente emulsionado en una salsa teriyaki.", "Calentar una sartén hasta que esté caliente. Agregue el lado de la piel de cerdo hacia abajo y freír en cada lado hasta que esté caramelizado. Vierta la salsa teriyaki para esmaltar el cerdo. Retire la carne de la sartén y colóquela en una tabla de cortar. Coloque el jamón shonka sobre la parte superior y doble los bordes.", "Para los piccalilli, coloque la coliflor y la cebolla en un colador. Cubra con la sal y reserve por 24 horas. Enjuague bien la sal con agua corriente fría.", "Mezcle la coliflor y la cebolla con el pepino hasta que estén bien combinados.", "Deje hervir los vinagres con el chile, apague el fuego y déjelos a un lado para infundir durante 20 minutos.", "Vuelva a hervir la mezcla de vinagre. Agregue la harina de maíz, la cúrcuma, la mostaza y el azúcar y cocine a fuego lento durante tres minutos.", "Vierta el líquido a fuego lento sobre las verduras, transfiéralo a un procesador de alimentos y mezcle hasta que quede suave. Pase a través de un colador fino y deje enfriar en la nevera hasta que se requiera.", "Mientras tanto, corte las manzanas en cubos de 1.5cm / ½ en cubitos. Viste los cubos con el jugo de limón, la sal y una gota de manzana balsámica.", "Para la ensalada de coliflor, mezcle la coliflor con jugo de limón y sal marina.", "Para servir, cepille los piccalilli en el plato. Agregue un pedazo de carne de cerdo en la parte superior y esparza sobre la manzana y termine con la ensalada de coliflor."], "url": "www_bbc_co_uk_food_recipes_belly_pork_with_75994", "title": "Cerdo del vientre con puré de piccalilli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de lubina o besugo (cada uno alrededor de 200 g / 7oz), sin escamas pero con piel", "1 cucharadita de sal marina en copos, más extra para sazonar", "¼ cucharadita de pimienta de cayena", "2½ cucharadita de mostaza inglesa en polvo", "pimienta negra recién molida", "4 cucharadas de aceite de girasol", "1 cucharada colmada de semillas de mostaza amarilla", "¾ cucharadita de semillas de mostaza negra", "¾ cucharadita de semillas de comino", "1 cebolla mediana, finamente rebanada", "2 chiles verdes largos, tallo cortado y cortado por la mitad sin deseeding", "1 hoja de laurel", "½ cucharadita de cúrcuma molida", "½ cucharadita de sal masala", "150g / 5½ oz de tomates maduros, picados", "150 g / 5½ oz de arroz, cocido de acuerdo con las instrucciones del paquete"], "method": ["Cortar los filetes de pescado en tiras de aproximadamente 7cm / 3in de ancho. Poner en un bol y mezclar con la sal, pimienta de cayena, media cucharadita de polvo de mostaza y mucha pimienta negra recién molida.", "Mezcle el polvo de mostaza restante con 300 ml / 10 fl oz de agua, agregándolo gradualmente y revolviendo constantemente hasta que tenga un líquido amarillo delgado. Dejar de lado.", "Caliente el aceite en una sartén antiadherente grande y fría el pescado a fuego alto, con la piel hacia abajo por un minuto, o hasta que la piel comience a crujir. Con cuidado voltee y cocine en el otro lado por un minuto más. Saca el pescado de la sartén y pon en un plato. (No permita que los peces se amontonen en la sartén o serán difíciles de voltear. Si su sartén no es lo suficientemente grande, cocínelos en dos lotes. Es bueno tener la piel sobre el pescado pero puede hacerlo fácilmente eliminarlo después de freír si lo prefiere).", "Tan pronto como el pescado esté cocido, devuelva la sartén al fuego y agrega las semillas de mostaza y de comino. Cocine por unos segundos, revolviendo constantemente. Agregue la cebolla rebanada, los chiles y la hoja de laurel. Cocine durante unos cinco minutos, revolviendo constantemente, hasta que la cebolla esté suave y dorada. ¡Asegúrate de cocinar con el extractor a toda velocidad ya que las especias pueden hacerte estornudar! Espolvoree la cúrcuma y el garam masala, agregue los tomates picados y cocine durante dos minutos más, revolviendo constantemente.", "Agregue el líquido de mostaza reservado y cocine a fuego lento. Cocine por tres minutos, o hasta que la salsa se haya espesado y el volumen del líquido se haya reducido en aproximadamente un tercio. Las especias deben haberse suavizado y la salsa debe cubrir la parte posterior de una cuchara. Regrese el pescado a la sartén y caliente en la salsa burbujeante durante dos minutos hasta que esté caliente.", "Sirve inmediatamente con arroz."], "url": "www_bbc_co_uk_food_recipes_bengali_fish_curry_44820", "title": "Curry de pescado bengalí", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "gran pizca asafoetida", "1 hoja de laurel", "½ cucharadita de panch phoran (una mezcla de cantidades iguales de fenogreco, semillas de nigella, semillas de hinojo, semillas de comino y mostaza), disponible en los supermercados asiáticos, también conocido como cinco especies bengalíes", "1-2 chiles rojos secos y suaves", "1 cebolla pequeña, picada", "½ cucharadita de cúrcuma molida", "Comino molido de 2 niveles de cucharadita", "1 cucharadita de cilantro molido", "2 cucharaditas de pasta de jengibre (disponible en los supermercados asiáticos, o haz los tuyos aplastando o mezclando el jengibre fresco en una pasta áspera, añadiendo agua si es necesario para aflojarlo)", "500g / 1lb 2 oz de calabaza, peladas, sin semillas, carne cortada en cubos de 4 cm / 1½ pulgadas", "200ml / 7fl oz de agua hirviendo", "Garbanzos enlatados 200g / 7oz, drenados y lavados", "1 cucharadita de tierra garam masala", "1 cucharadita de semillas de hinojo molido", "sal al gusto", "azúcar al gusto"], "method": ["Caliente el aceite en una sartén antiadherente grande a fuego medio. Agregue la asafétida, la hoja de laurel, el phoran panch y los chiles y fríe durante 1-2 minutos, revolviendo bien para combinar.", "Agregue la cebolla, revuelva para cubrir las especias, y fríe durante 2-3 minutos, o hasta que estén suaves y doradas.", "Agregue la cúrcuma molida, el comino y el cilantro, la sal, el azúcar y la pasta de jengibre y mezcle bien. Agregue un poco de agua, mezcle y cocine durante 1-2 minutos más.", "Agregue las piezas de calabaza y el agua hirviendo. Llevar la mezcla a ebullición, luego reducir el fuego a fuego lento, cubrir la olla con una tapa y hervir a fuego lento durante 10-15 minutos, o hasta que la calabaza esté tierna.", "Agregue los garbanzos, garam masala molido y semillas de hinojo y otra salpicadura de agua si es necesario para mantener la mezcla suelta. Agregue la sal y el azúcar, si usa. Revuelva bien y continúe cocinando por 1-2 minutos, o hasta que se caliente. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bengalibutternutsqua_89988", "title": "Calabaza bengalí con garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bengalibutternutsqua_89988_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g / 14 oz pequeñas berenjenas de estilo japonés, finamente cortadas en rodajas", "buena pizca de cúrcuma molida", "sal al gusto", "½ cucharadita de chile rojo en polvo", "2 cucharadas de aceite vegetal", "250 ml / 9 fl oz oz yogur", "1-1½ cucharadita de azúcar", "1 cucharadita completa de semillas de comino, tostadas en una sartén y molidas en un molinillo de café limpio o una mano de mortero", "puñado de hojas de cilantro fresco, picado, para adornar"], "method": ["Espolvorea las rodajas de berenjena con la cúrcuma, la sal y la mitad del chile en polvo rojo.", "Caliente el aceite en una sartén grande y antiadherente y fría las piezas de berenjena hasta que estén blandas (puede que tenga que hacerlo en dos lotes). Dejar de lado.", "En un tazón, bata 200 ml / 7 fl oz del yogur con el azúcar, la sal y el resto de chile rojo en polvo. Viértalo en una olla pequeña y caliéntelo suavemente, revolviendo a menudo para evitar que se parta, durante unos cinco minutos.", "Agregue el comino molido y las rodajas de berenjena. Calienta suavemente y revuelve para combinar.", "Agregue el yogur restante, revise el condimento y sirva adornado con el cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_bengalistyleaubergin_86619", "title": "Berenjena de estilo bengalí cocinada en yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pinta de jugo de tomate", "1 manojo de hojas de apio (lavadas y recogidas de ½ racimo de apio)", "guisar salsa Tabasco (al gusto)", "dash crema de rábano picante", "dash HP salsa (al gusto)", "2 limas, solo jugo", "hielo picado (opcional)"], "method": ["Pon todo en una jarra grande y mezcla", "¡Agregue un puñado de hielo picado si quiere, pero Ben tiene el suyo sin él!"], "url": "www_bbc_co_uk_food_recipes_bensbloodymary_11199", "title": "Bloody Mary sin alcohol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace una jarra de 1 litro", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechuga de res de 1.5kg / 3lb 5oz, cortada de exceso de grasa y cortada en trozos grandes de 6cm / 2½ pulgadas", "sal al gusto", "2 cebollas grandes, finamente cortadas", "4 zanahorias, peladas y cortadas en rondas de 1cm / ½", "2 palitos de apio, cortados en rodajas de 1cm / ½", "6 dientes de ajo, finamente picados", "1 botella de vino tinto", "100ml / 3½fl oz de brandy o coñac", "50ml / 2fl oz de vinagre de vino tinto", "4 hojas de laurel", "2 ramitas grandes de tomillo", "algunas ramitas de perejil", "2 piezas de cáscara de naranja", "4 dientes", "1 cucharadita de pimienta negra", "2 x 4cm / 1½ en pedazos de canela en rama", "4 cucharadas de aceite de oliva", "Tocino de tocino 150 g / 5½ oz", "1 cebolla, finamente picada", "2 cucharadas de puré de tomate", "600ml / 20fl oz de caldo de carne", "Aceitunas negras 150 g / 5½ oz", "300 g / 10½oz de arroz de camargue rojo, cocido de acuerdo con las instrucciones del paquete"], "method": ["Coloque la carne en un recipiente grande apto para la nevera. Espolvorea con sal, luego agrega todos los ingredientes del adobo.", "Divida los ingredientes para el bouquet garnis por la mitad y átelos en dos paquetes separados de muselina. Agregue uno de estos al adobo y coloque el otro a un lado. Cubra y ponga en la nevera. Deje por lo menos seis horas, pero preferiblemente durante la noche.", "Para la cacerola, drene la carne, reservando el líquido y el resto de los ingredientes del adobo. Seque la carne y quite el ajo.", "Caliente la mitad del aceite de oliva en una sartén grande y fría la carne en tandas hasta que se dore bien. Desglasar la base de la sartén con un poco del líquido de adobo y dejar de lado.", "En una cazuela grande, agregue el aceite de oliva restante. Agregue los lardons y fría a fuego alto durante unos minutos hasta que estén crujientes y dorados. Agregue la cebolla y reduzca el fuego a medio. Freír por unos 10 minutos o hasta que la cebolla se haya suavizado y tenga un color ligeramente colorado. Agregue el puré de tomate. Agregue la carne a la cazuela y revuelva para cubrir.", "Cuele el adobo y vierta sobre el líquido junto con el líquido desglazing de la sartén y el segundo bouquet garni.", "Llevar a ebullición y cocine a fuego lento hasta que el volumen de líquido se haya reducido en alrededor de un tercio.", "Agregue suficiente caldo de carne para que la carne esté recién cubierta. Vuelva a hervir, luego baje el fuego a bajo. Cubra y cocine a fuego lento durante alrededor de tres horas.", "Si puede, déjelo toda la noche, deje que se enfríe y déjelo en la nevera para que se enfríe. Una vez que esté frío, hará que desnatar cualquier grasa sea mucho más fácil. De lo contrario, simplemente elimine parte de la grasa que se acumulará en la parte superior.", "Agregue las aceitunas, luego cocine a fuego lento destapado por una hora más para reducir la salsa. Sirve con arroz rojo de camargue."], "url": "www_bbc_co_uk_food_recipes_beouf_en_daube_provenale_77740", "title": "Carne de vaca en estofado provenzal", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beouf_en_daube_provenale_77740_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 rebanadas de pan blanco", "50g / 1¾oz de mantequilla", "2 cucharaditas de mostaza integral", "4 rebanadas de jamón listo para comer", "2 cucharadas de cerveza, opcional", "Crema doble de 150 ml / 1/4 de pinta", "1 cucharadita de salsa Worcestershire", "2 yemas de huevo de gallinas camperas", "Queso Berkswell 280 g / 10 oz, rallado", "sal y pimienta negra recién molida", "hojas de ensalada vestidas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Unte con mantequilla el pan, extiéndalo con la mitad de la mostaza y prepare cuatro sándwiches de jamón.", "Usando un cortador circular grande, corte cada emparedado en un círculo (si no tiene un cortador, quite las cortezas y corte los emparedados en triángulos). Coloque en un plato pequeño y ovalado para horno y vierta un poco de cerveza sobre cada bocadillo, si lo usa.", "En una sartén, llevar la crema a ebullición. Cuando empiece a espesar, retírelo del fuego. Agregue la mostaza restante, la salsa Worcestershire, las yemas de huevo y 225 g / 8 oz del queso. Condimentar con sal y pimienta.", "Vierta la salsa sobre los sándwiches y esparza el queso restante sobre la parte superior.", "Hornee durante 12 minutos, o hasta que estén dorados y burbujeantes. Sirve con ensalada de hojas."], "url": "www_bbc_co_uk_food_recipes_berkswell_toasty_pudding_03447", "title": "Berkswell toasty pudding", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de bayas congeladas (frambuesas, moras, cerezas, arándanos, grosellas negras funcionan bien, o una mezcla)", "50 g / 2 oz de azúcar en polvo", "2 cucharadas de harina de maíz", "Harina común 110g / 4oz", "70g / 2½oz de mantequilla fría sin sal, cortada en cubos pequeños", "30 g / 1 oz de azúcar en polvo", "Harina normal 220g / 8oz", "¾ cucharadita de polvo de hornear", "½ cucharadita de canela", "50 g / 2 oz de almendras molidas", "200 g / 7 oz de azúcar en polvo", "80g / 3oz de mantequilla, derretida", "2 huevos de gallinas camperas", "40 g / 1½ oz yogur adelgazado con 2 cucharadas de leche"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee una lata rectangular para hornear (aproximadamente 26 cm x 20 cm / 10½ pulgadas x 8 pulgadas).", "En una olla, combine la fruta con 50 ml / 2 fl oz de agua. Ponga la fruta a punto de ebullición, reduzca el fuego y cocine a fuego lento durante 2-3 minutos.", "En un recipiente para mezclar combine el azúcar impalpable con la harina de maíz. Revuelva en la fruta y continúe cocinando por 2-3 minutos, revolviendo con frecuencia, hasta que la mezcla esté espesa y atascada. Dejar de lado para enfriar.", "Para la cobertura de crumble, agregue la harina a un recipiente para mezclar y frote la mantequilla hasta que la mezcla se asemeje a finas migas de pan y no queden grandes trozos de mantequilla. Agregue el azúcar y reserve.", "Para la torta, en un tazón grande, tamiza la harina, el polvo de hornear y la canela. Agregue las almendras molidas hasta que estén bien combinadas.", "En otro tazón, bata el azúcar con la mantequilla derretida, los huevos, el yogur y la mezcla de leche hasta que esté bien mezclado. Mezcle en la mezcla de harina solo para combinar. No mezcle demasiado, pero tenga cuidado con los grandes trozos de harina sin mezclar.", "Coloca dos tercios de la mezcla en la lata forrada, extendiéndola suavemente por las esquinas. Cuchara la mezcla de fruta enfriada uniformemente en la parte superior.", "Con una cucharilla, salpique la pasta restante sobre la fruta. Esto no cubrirá todo el pastel, sino que formará pequeños montículos con espacios intermedios.", "Espolvoree la mezcla de la migaja sobre la parte superior, llenando todos los huecos para cubrir la fruta.", "Hornee en el horno durante 45-50 minutos, hasta que la cobertura de crumble se dore. Deje que se enfríe durante diez minutos en la lata, luego transfiera la torta en su papel a una rejilla para enfriar. Este es un pastel que se come muy bien mientras aún está caliente, con una cucharada de crème fraîche o yogur, pero también es agradable al día siguiente con una taza de café."], "url": "www_bbc_co_uk_food_recipes_berry_crumble_traybake_59984", "title": "Berry crumble traybake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_crumble_traybake_59984_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5¼ oz de bayas de temporada mezcladas (como moras, arándanos o fresas)", "1 cucharada de azúcar en polvo de oro", "1 limón, ralladura y jugo", "4 galletas de jengibre", "1 cucharada de mantequilla", "2 cucharadas de azúcar glas", "125g / 4½ oz de mascarpone"], "method": ["Caliente las bayas, el azúcar impalpable y una cucharada de jugo de limón en una sartén pequeña, revuelva bien para combinar, durante 3-4 minutos, o hasta que el azúcar se haya disuelto y las bayas se hayan descompuesto. Dejar de lado para enfriar.", "Coloque los bizcochos en una bolsa de congelador y aplaste con un rodillo hasta que se asemejen a pan rallado.", "Derrita la mantequilla en una olla pequeña a fuego medio o bajo.", "Mezcle los bizcochos machacados y la mantequilla derretida en un bol hasta que estén bien combinados. Coloque la mezcla en el fondo de dos vasos grandes para servir.", "Coloque el mascarpone en un tazón grande y agregue la ralladura de limón, el jugo de limón restante y el azúcar glas.", "Coloque el mascarpone en las copas y luego espolvoree las bayas y el jugo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_berrycheesecakeinagl_92447", "title": "Tarta de queso Berry en un vaso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berrycheesecakeinagl_92447_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "300g / 10½oz de chocolate oaty biscuits", "115g / 4oz de mantequilla", "115g / 4oz azúcar morena oscura", "397 g / 14 oz pueden endulzar leche condensada", "Crema doble 450ml / 16fl oz", "5 plátanos medianos maduros pero firmes", "1 cucharadita de jugo de limón fresco", "25g / 1oz de rizos gruesos rallados de chocolate negro o chocolate rallado"], "method": ["Para hacer la base, derrita la mantequilla en una sartén pequeña. Rompe los bizcochos en pedazos gruesos y ponlos en un procesador de alimentos. Mézclese en migajas, luego agregue la mantequilla derretida y, con el motor en marcha, mezcle hasta que esté bien mezclado. Alternativamente, coloque los bizcochos en una bolsa de comida de polietileno fuerte y golpee con un rodillo. Incline en un recipiente y agregue la mantequilla derretida.", "Incline las migajas en el centro de un plato de quiche o quiche con base aflautada de 23 cm / 9 pulg. Y presione firmemente en la base y los lados. (Asegúrese de que la base de la galleta esté distribuida uniformemente, especialmente donde la base se encuentra con los lados.) Enfríe en la nevera durante 30 minutos o hasta que se endurezca.", "Para hacer el relleno, derrita la mantequilla en una olla mediana antiadherente y agregue el azúcar. Cocine a fuego lento mientras el azúcar se disuelve, revolviendo constantemente hasta que la mantequilla y el azúcar se vean suaves y el aceite no flote hacia la superficie. Agregue la leche condensada y cocine a fuego lento, revolviendo constantemente. Cocine por tres minutos, revolviendo hasta que la mezcla se torne de color caramelo oscuro y cremoso.", "Vierta el toffee suavemente sobre la base de la galleta y alise rápidamente la superficie. Dejar enfriar durante una hora (y hasta ocho horas) antes de cubrir.", "Justo antes de servir, batir ligeramente la crema en un bol. Debería estar en picos suaves, más gruesos y se verá demasiado batido cuando se mezcle con los plátanos. Corta en diagonal cuatro de los plátanos y esparce la mitad sobre el toffee. Doble el resto ligeramente en la crema y la cuchara suavemente en la parte superior.", "Corta el plátano restante y ponlo en un bol. Vierta el jugo de limón y mezcle muy suavemente (esto evitará que el plátano se ponga marrón). Decora la parte superior con el plátano al limón, metiéndote en la crema aleatoriamente y espolvorea la tarta con chocolate rallado o decora con rizos de chocolate. Servir en rodajas bastante finas ya que es muy rico."], "url": "www_bbc_co_uk_food_recipes_best-ever_banoffee_pie_75984", "title": "El mejor pastel de banoffee", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/best-ever_banoffee_pie_75984_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175 g / 6 oz de bayas mixtas congeladas, descongeladas", "340g / 12oz de yogur griego sin grasa", "Almendras en copos de 10 g / ¼ oz, tostadas"], "method": ["Coloque el yogur en dos vasos, cubra con la mitad de las bayas y repita las capas.", "Espolvorear con las almendras en copos y servir."], "url": "www_bbc_co_uk_food_recipes_berry_yoghurt_95274", "title": "Yogur de bayas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_yoghurt_95274_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "450 g / 1 lb de carne de res magra", "Hígados de pollo 100g / 3½oz, recortados", "1 cebolla, finamente picada", "2 dientes de ajo picados", "1 pimiento rojo, finamente picado", "1 pimiento verde, finamente picado", "150g / 5 oz champiñones, en rodajas", "2 hojas de laurel", "200g / 7oz de puré de tomate", "100 ml / 3½ fl oz de vino tinto", "1 x 400 g / 14 oz pueden cortar tomates", "sal y pimienta blanca recién molida", "1 cucharadita de hojas frescas de tomillo", "1 cucharadita de perejil fresco", "1 cucharadita de orégano fresco (o media cucharadita de orégano seco)", "Espagueti 400 g / 14 oz, cocinado de acuerdo con las instrucciones del paquete", "parmesano, finamente rallado"], "method": ["Caliente el aceite vegetal en una sartén grande a fuego medio.", "Agregue la carne picada y cocine hasta que se dore por todas partes. Retire la carne picada de la sartén con una espumadera y déjela a un lado.", "Agregue los hígados de pollo a la misma sartén y cocínelos hasta que se doren por todos lados. Retire los hígados de la sartén y corte en pedazos del tamaño de un bocado y déjelos a un lado.", "Agregue la cebolla a la sartén y fríe durante 4-5 minutos, para suavizar y colorear.", "Agregue el ajo, pimientos rojos y verdes y champiñones y freír durante 5-6 minutos, o hasta que estén suaves y ligeramente coloreados.", "Agregue la carne picada cocida, los hígados cocidos, el puré de tomate y las hojas de laurel y continúe cocinando durante ocho minutos.", "Agregue el vino y los tomates y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 30-45 minutos.", "Sazonar, al gusto, con sal y pimienta blanca recién molida.", "Agregue el tomillo, el perejil y el orégano y revuelva bien para combinar.", "Para servir, coloque porciones iguales de espagueti cocido en cuatro tazones para servir. Ponga la misma cantidad de salsa boloñesa en cada porción y espolvoree con parmesano rallado fino."], "url": "www_bbc_co_uk_food_recipes_besteverspaghettibol_89567", "title": "El mejor espagueti a la boloñesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 calabaza de tamaño mediano, carne cortada y picada, fibras retiradas; semillas eliminadas, tostadas y reservadas para decorar", "1 litro / 1¾ pintas de jugo de naranja recién exprimido", "2 cucharaditas de pimienta de Jamaica", "2 cucharadas de miel clara", "35ml / 1¼fl oz de whisky bourbon", "1 cucharada de licor de cereza amarga", "2 cucharaditas de licor de hierbas", "3 cucharadas de puré de calabaza con especias (ver arriba)", "hielo", "semillas de calabaza, tostadas", "pizca de nuez moscada recién rallada"], "method": ["Para el puré de calabaza con especias, lleve una pequeña cantidad de agua a fuego lento en una sartén. Suspenda una canasta humeante sobre el agua (no permita que la base de la canasta toque el agua). Agregue la calabaza picada y el vapor durante 15-20 minutos, o hasta que estén tiernos. Retire de la canasta humeante y déjela enfriar.", "Cuando la calabaza se haya enfriado, transfiérala al recipiente de un procesador de alimentos. Agregue el jugo de naranja, la pimienta de Jamaica y la miel y mezcle hasta que esté suave y bien combinado.", "Para el cóctel, vierta el bourbon, el licor de guindas, el licor de hierbas y el puré de calabaza en una coctelera. Agregue hielo y agite bien.", "Para servir, cuele la mezcla en un vaso de flauta. Adorne la superficie del cóctel con algunas semillas de calabaza tostadas. Polvo con un poco de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_bewitched_92643", "title": "Embrujado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 1 más puré extra", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de harina de pan blanco, más extra para espolvorear", "1 x 7 g / oz de sachet levadura seca de acción rápida", "1½ cucharadita de sal", "250-275ml / 9-10fl oz de agua tibia", "aceite vegetal o aceite en aerosol, para engrasar", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de sal marina", "2 cucharadas de pimienta negra recién molida"], "method": ["Espolvorea dos bandejas grandes para hornear con harina.", "Ponga la harina, la levadura y la sal en un tazón grande y agregue suficiente agua para hacer una masa suave pero no pegajosa. Amasar bien durante 10 minutos a mano sobre una superficie de trabajo ligeramente enharinada o durante cinco minutos si se usa una batidora eléctrica equipada con un gancho de masa.", "Divida la mezcla en 12 porciones iguales, cada una pesando aproximadamente 60 g / 2½ oz. Enrolle las porciones en bolas, luego coloque cada bola en una superficie enharinada y enrolle en forma de salchicha larga de aproximadamente 25cmx2cm / 10inx1in. (Para obtener los mejores resultados visuales, haga que la salchicha tenga un grosor uniforme).", "Me gusta dar forma a la mitad de ellos en giros. Pase un cuchillo por el centro para dividir la masa, dejando un poco en un extremo sin cortar. Trenza o trenza las dos mitades una encima de la otra para dar un efecto retorcido.", "Coloque los palitos de pan en las bandejas de hornear preparadas, separándolos a 4cm / 1½ pulgadas. Cubra los palitos de pan sin apretar con film transparente aceitado, asegurándose de que sea hermético. Déjelo en un lugar cálido durante 30 minutos o hasta que los palitos de pan casi hayan duplicado su tamaño.", "Precalentar el horno a 200C / 400F / Gas 6.", "Quite la película adhesiva y cepille cada barra de pan con el aceite de oliva virgen extra. Espolvoree la mitad de los palitos de pan con la sal marina y el resto con la pimienta negra recién molida. Hornee en el tercio superior del horno durante unos 20 minutos, o hasta que los palitos de pan estén ligeramente dorados y se sientan firmes al tacto. Retire los palitos de pan del horno y deje que se enfríen en las bandejas para hornear."], "url": "www_bbc_co_uk_food_recipes_big_fat_salt_and_pepper_59413", "title": "Palitos de sal grandes y gruesos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/big_fat_salt_and_pepper_59413_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de girasol o aceite vegetal", "1 cebolla picada", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "½ cucharadita de chile en polvo", "¼ cucharadita de cúrcuma molida", "Tomates 150g / 5¼ oz, picados", "Okra de 450g / 16oz, cortado en pedazos de 1in / 3cm"], "method": ["Calienta el aceite en un wok. Agregue las cebollas y las especias y fría por 3-5 minutos hasta que las cebollas sean transparentes. Incline los tomates y cocine por un minuto o dos.", "Eche la okra y cocine a fuego lento durante 8-10 minutos o hasta que la okra esté cocida.", "Sazonar bien y servir."], "url": "www_bbc_co_uk_food_recipes_bhindibhajji_74849", "title": "Bhandi Bhaji", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]