[{"ingredients": ["Filete de lubina muy fresco de 150g / 5½oz, sin piel, en rodajas finas", "1 lima, cáscara y jugo solamente", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "½ mango, piel y piedra eliminados, picados", "1 cucharadita de hojuelas de chile seco", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 cucharada de cilantro fresco, picado", "2 cucharadas de aceite de oliva"], "method": ["Para el ceviche, coloque la lubina en rodajas finas en un plato para servir y espolvoree la ralladura de lima, luego rocíe sobre el jugo de lima, el aceite de oliva y sazone con sal y pimienta negra recién molida. Cubra y deje marinar durante diez minutos (ya no) en la nevera.", "Para la salsa de lima y mango, mezcle todos los ingredientes en un bol y luego transfiera a un plato pequeño.", "Para servir, transfiera la lubina marinada a un plato y sirva con la salsa."], "url": "www_bbc_co_uk_food_recipes_cevicheofseabasswith_88780", "title": "Ceviche de lubina con salsa de lima y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de té chai", "100g / 3½oz de fechas picadas", "60 g / 2¼ oz de mantequilla sin sal, más extra para engrasar", "135ml / 4½fl oz de leche entera, preferiblemente orgánica", "60g / 2¼ oz de azúcar moreno oscuro", "2 huevos grandes de gallinas camperas, golpeados", "Levadura seca de acción rápida de 15 g / ½ oz", "450 g / 1 libra de harina blanca fuerte", "pizca de sal", "50g / 1¾oz de jengibre en almíbar, picado, más 2-3 cucharadas de jarabe del tallo de jengibre para el glaseado", "1 cucharada de vainas de cardamomo verde, solo semillas", "3 vainas de cardamomo negro, solo semillas", "pellizcar granos de pimienta negra", "1 vaina de anís de estrella entera", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de azúcar moreno (o azúcar de palma)", "1 cucharada de canela molida", "1 cucharadita de jengibre molido", "1 cucharada de pasta de frijoles de vainilla"], "method": ["Para las fechas, en una cacerola pequeña ponga a hervir 150 ml / 5 fl oz de agua. Agregue el té y hierva por un minuto. Coloque el té en un tazón y agregue las fechas picadas. Reserve durante diez minutos y luego drene las fechas con un tamiz.", "Engrase y forre una lata para pastel en forma de resorte redonda, redonda y suelta de 20cm / 8in.", "Para la masa, derrita la mantequilla en una sartén pequeña y caliente la leche en una sartén por separado.", "En un tazón, combine la leche tibia, la mantequilla, el azúcar y los huevos. Agregue la levadura hasta que esté bien mezclada. Dejar de lado por cinco minutos.", "Ponga la harina y la sal en el tazón de un mezclador independiente fijado con un gancho de masa. Agregue la mezcla de levadura, las fechas drenantes y el jengibre tallo picado y mezcle con una masa suave, lisa y brillante.", "Para la mezcla de especias, mientras la masa se está mezclando, triture las semillas de cardamomo verde y negro con la pimienta negra y el anís estrellado en un mortero y un mortero. Transfiera a un tazón pequeño y combínelo con la mantequilla, el azúcar moreno (o azúcar de palma), la canela, el jengibre y la pasta de vainilla para hacer una mantequilla especiada untable. Dejar de lado.", "Cuando la masa esté lista, hágalo rodar bastante fino y al menos 60 cm / 23½ pulgadas de largo. Con los dedos o el dorso de una cuchara, unte la mantequilla especiada en la parte superior de la masa. Enrollar, bastante apretado, desde el lado largo, como un rollo suizo.", "Corta en pedazos largos de 3 x 20cm / 8in y colócalos verticalmente en el mostrador. Trenza las piezas en una simple trenza de tres trenzas. Levante con cuidado la trenza y colóquela en un círculo alrededor del interior de la lata de pastel preparada. Puede haber un pequeño espacio en el centro, pero esto se llenará como lo prueba el pan. Cubra la parte superior de la lata con film transparente y colóquelo en un lugar cálido para comprobar durante una hora.", "Precaliente el horno a 180 ° C / horno de ventilador 160 ° C / 350 ° F / Gas 4.", "Coloque la lata en el horno y hornee durante aproximadamente 35 minutos, o hasta que estén doradas. Mientras aún esté caliente, cepilla la parte superior generosamente con el jarabe de jengibre. Deje que se enfríe en la lata durante 10 minutos antes de deslizar un cuchillo de mantequilla alrededor del borde de la lata para soltarlo.", "Retire el papel de hornear y deje en una rejilla de enfriamiento hasta que esté completamente frío."], "url": "www_bbc_co_uk_food_recipes_chai-spiced_ginger_and_38256", "title": "Chai-spiced jengibre y té de la fecha", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15 vainas de cardamomo verde", "8 dientes", "1 cucharadita de nuez moscada recién rallada (aproximadamente la mitad de nuez moscada entera)", "1½ cucharadita de jengibre molido", "½ cucharadita de sal marina en copos", "400ml / 14fl oz de leche entera", "150 g / 5½ oz de azúcar en polvo dorado, más 1 cucharada colmada para rociar", "1 cucharadita de extracto de vainilla", "2 cucharadas de té de hojas de la India, preferiblemente Assam", "1 tira larga de cáscara de naranja", "1 palito de canela, partido por la mitad", "Pan de brioche de 300 g / 10½oz, en rodajas gruesas (o 10 rebanadas de pan blanco crujiente sin corteza)", "50g / 1¾oz de mantequilla ablandada, más extra para engrasar", "125g / 4½oz de fruta seca mixta", "4 yemas de huevo grandes de gallinas camperas", "2 huevos grandes de gallinas camperas", "300 ml / 10 fl oz doble crema"], "method": ["Coloque las vainas y los clavos de cardamomo en un almirez y mortero y aplaste durante aproximadamente un minuto, o hasta que las vainas se separen y los dientes se trituren aproximadamente. Incline en una cacerola mediana antiadherente y agregue la nuez moscada, el jengibre, la sal y la leche. Agregue el azúcar, la vainilla, el té de hojas, la cáscara de naranja y la ramita de canela. Deje que hierva a fuego lento y cocine a fuego lento durante cinco minutos, revolviendo ocasionalmente. Retire la sartén del fuego y déjela reposar durante 10 minutos.", "Unte con mantequilla un plato refractario de 1.75-2 litros / 3-3½ pinta para horno; un redondo se ve bien. Extienda un lado de cada rebanada de brioche con mantequilla ablandada. Coloque las rebanadas de brioche en el plato, la mantequilla hacia arriba y ligeramente vertical, pero apoyándose una contra la otra, esparciendo la fruta seca mixta entre las rebanadas sobre la marcha.", "Batir las yemas de huevo, los huevos enteros y la crema juntos en una jarra grande o en un tazón hasta que quede suave. Cuele la leche infundida a través de un tamiz fino en la mezcla de huevo y revuelva bien para combinar. Deseche las especias y la cáscara.", "Vierta el líquido cremoso lentamente sobre el brioche con mantequilla. (El pan flotará, así que presione suavemente con una espátula durante unos segundos para ayudarlo a absorber la crema.) Deje reposar durante 15 minutos.", "Mientras tanto, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque el plato en una lata de asar. Vierta agua hervida en la lata de asar alrededor de la parte exterior del plato para que quede a mitad de los lados. Espolvorea el pudín con azúcar y hornea por 35-40 minutos, o hasta que la natilla esté lista, pero aún un poco cremosa en el centro, y el pan es dorado y crujiente en la parte superior.", "Retire del horno y levante con cuidado de la lata de asar. Sirva caliente con crema, natillas o un buen helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_chai_bread_and_butter_75754", "title": "Budín de pan y mantequilla chai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225ml / 8fl oz de leche de almendra sin azúcar", "2 bolsitas de té Chai", "1 cucharadita de canela molida", "Harina de espelta blanca 400g / 14oz", "2½ cucharaditas de polvo de hornear", "150g / 5½oz de azúcar moreno claro y suave", "Almendras naturales con piel, 75g / 2½ oz, más o menos picadas", "2 huevos grandes de gallinas camperas", "150ml / 5fl oz de aceite de girasol"], "method": ["Caliente la leche de almendras con el contenido de las 2 bolsitas de té (solo las raspe sobre la sartén) y la canela - revuelva para mezclar - y deje que se enfríe.", "Mientras se enfría la leche, precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6 y alinee un molde para moldes de 12 hoyos con cajas de papel.", "En un tazón grande, mida la harina, el polvo de hornear, el azúcar y todas menos 2 cucharadas de almendras picadas, y combine bien.", "Cuando la leche se haya enfriado, agregue los huevos y el aceite, luego batir bien.", "Agregue los ingredientes líquidos a los ingredientes secos, usando una cuchara de madera. No seas demasiado eficiente con esto: una pasta ligeramente grumosa produce muffins más livianos. Divida la mezcla entre las cajas de muffins (las llenará bien), luego espolvoree por igual con las almendras restantes y hornee por 20-25 minutos, o hasta que el probador de tortas salga limpio y los muffins estén ligeramente levantados y agradablemente dorados en parte superior.", "Retire a una rejilla para enfriar durante unos 10 minutos antes de devorar."], "url": "www_bbc_co_uk_food_recipes_chai_muffins_06244", "title": "Magdalenas Chai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 muffins", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chai_muffins_06244_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 bolsitas de té de manzanilla", "2 cucharadas de hojas de menta fresca, más extra por servir", "1 cucharada de hojas de hisopo, más extra para servir", "1 litro / 1¾ pintas de agua recién hervida"], "method": ["Coloque las bolsitas de té, la menta y las hojas de hisopo en una tetera y agregue el agua caliente. Empinado por al menos 5 minutos.", "Sirve el té con la menta extra y las hojas de hisopo."], "url": "www_bbc_co_uk_food_recipes_chamomile_and_mint_tea_05991", "title": "Manzanilla y té de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Papas de 1.35kg / 3lb, bien lavadas y dejadas enteras en sus chaquetas", "290ml / ½ litro de leche", "85g / 3oz de mantequilla", "sal y pimienta blanca", "1 cebolleta grande de racimo, finamente picada"], "method": ["Hervir las papas en agua con sal hasta que estén suaves. Drene y retire de la sartén. Deja hasta que esté lo suficientemente frío como para pelar. Mash a fondo.", "Hervir la leche y agregar a la papa, junto con las cebolletas.", "Sazonar y revolver bien.", "Pila en un plato de servir.", "Haz un pozo en el centro y agrega la mantequilla. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_champ_67444", "title": "campo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/champ_67444_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de semillas de comino", "2 cucharadas de semillas de cilantro", "10 vainas de cardamomo verde, magulladas", "4 vainas de cardamomo negro, magulladas", "8 dientes", "½ cucharadita de nuez moscada en polvo", "4 cuchillas de maza", "1 cucharada de pimienta negra", "Anís de 2 estrellas", "4 hojas de laurel", "1 chile rojo seco", "150 g / 5½ oz de garbanzos secos, remojados en agua durante la noche", "1 hoja de laurel", "1 vaina de cardamomo negro", "1 diente", "1 cucharadita de sal", "100ml / 3½fl oz vegetal", "6 dientes", "2 hojas de laurel", "3 vainas de cardamomo negro", "200 g / 7 oz cebollas, en rodajas", "15 g de pasta de jengibre y ajo", "1 cucharada de polvo de cilantro", "1 cucharadita de chile rojo en polvo", "1 cucharadita de comino en polvo", "1 cucharadita de sal", "Tomates 200g / 7oz, picados", "2 cucharadas de hojas de cilantro picadas", "½ cucharadita de Punjabi garam masala", "1 cucharada de azúcar", "1 huevo mediano de gallinas camperas", "300ml / 10fl oz de leche entera", "Harina normal de 375g / 13oz", "1 cucharadita de polvo de hornear", "½ cucharada de sal", "2 cucharadas de aceite vegetal", "3 cucharadas de ghee derretido", "4 filetes de grupa de cordero 4 x 100 g / 3½ oz", "1½ cucharada de Punjabi garam masala", "sal al gusto", "1 cebolla roja, en rodajas", "100g / 3½oz de tomates baby ciruela en rodajas", "¼ de pepino, en rodajas", "2 cucharadas de hojas de cilantro fresco picado", "1 lima, solo jugo"], "method": ["Para hacer el garam masala, ponga todos los ingredientes en una sartén seca a fuego medio, agite la sartén para tostar las especias de manera uniforme.", "Enfríe las especias por un minuto y colóquelas en una licuadora eléctrica y mézclelas en polvo fino, o use un almirez y mortero. Pasar a través de un tamiz y reservar.", "Para cocinar los garbanzos, drene el agua de remojo. Ponga los garbanzos en una olla de agua limpia con la hoja de laurel, el cardamomo, el clavo y la sal y hierva hasta que estén cocidos. Dejar de lado hasta que se requiera.", "Para la salsa, en una sartén limpia, caliente el aceite y fría los dientes, la hoja de laurel y el cardamomo negro. Agregue las cebollas y cocine hasta que estén transparentes. Agregue la pasta de jengibre y ajo y cocine bien. Agregue las especias secas en polvo, la sal, los tomates y suficiente agua para cubrir la mezcla, agregue los garbanzos y cocine a fuego lento durante 30 minutos, o hasta que la salsa se espese.", "Para el pan naan, precaliente el horno a 225C / 200C ventilador / Gas 8 y coloque una bandeja de horno gruesa en el horno para calentar.", "Batir el azúcar, el huevo y la leche en un tazón. En un recipiente aparte, combine la harina, el polvo de hornear y la sal.", "Agregue la mezcla de leche a la mezcla de harina y amasar ligeramente para hacer una masa suave: tenga cuidado de no trabajar demasiado la masa o se pondrá demasiado elástica.", "Cuando todos los ingredientes estén bien mezclados, cúbralos con un paño húmedo y déjelos reposar, en un lugar cálido, durante 15 minutos.", "Una vez que haya descansado, vierta sobre el aceite y elimine el aire de la masa.", "Divida la masa en 8 bolas del mismo tamaño y extiéndalas en un círculo de aproximadamente 10 cm de diámetro.", "Extiende los círculos en la bandeja caliente en el horno. Hornee durante 4-5 minutos; es posible que deba doblar el pan para asegurarse de que esté todo cocido. También es muy probable que necesite cocinar el pan en tandas. Cepillo con ghee derretido.", "Para el cordero, baje el horno a 200C / 180C Fan / Gas 6.", "Escuche la grupa en una sartén caliente para colorearla por todos lados. Espolvorea la grupa con el garam masala mezclado con sal. Asar en el horno durante 5-7 minutos, retirar y descansar durante 3-4 minutos y luego cortar.", "En un tazón, mezcle los ingredientes de la guarnición.", "Pon los garbanzos en un plato para servir y coloca el cordero en rodajas encima. Cubra con la guarnición y sirva caliente con pan naan."], "url": "www_bbc_co_uk_food_recipes_chana_gosht_-_lamb_rump_99176", "title": "Chana gosht (grupa con garbanzos con pan naan)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 rebanadas de jamón", "1 melón charentais", "8-12 hojas de cohetes salvajes", "75ml / 2½fl oz de aceite de oliva virgen", "sal marina y pimienta negra recién molida", "Queso de oveja 100 g / 3½ oz"], "method": ["Retire la piel externa del melón. Corta por la mitad y quita y descarta las semillas. Cortar el melón fino y colocar en el plato de servir, junto con el jamón rebanado. Lave y drene el cohete silvestre, y rocíe algunas hojas sobre la parte superior.", "Usando un pelador de patatas, afeite el queso de oveja sobre la ensalada, rocíe con aceite de oliva y un poco de sal marina antes de servir."], "url": "www_bbc_co_uk_food_recipes_charentaismelonprosc_7353", "title": "Charentais melón, prosciutto, rúcula salvaje y ensalada de pecorino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Hojas de acelga de 150 g / 5½ oz, picadas", "3 puerros tiernos, picados", "200ml / 7fl oz de caldo de pollo", "Crema doble 55ml / 2fl oz", "2 rebanadas de panceta, picadas y fritas hasta que estén doradas"], "method": ["Calentar el aceite en una olla. Agregue las acelgas y los puerros y cocine durante tres minutos.", "Agregue el caldo de pollo, lleve a ebullición y cocine por otros cinco minutos.", "Agregue la crema doble y mezcle bien.", "Para servir, coloque la sopa en un tazón y cubra con la panceta cocida."], "url": "www_bbc_co_uk_food_recipes_chardandleeksoup_79330", "title": "Sopa de acelgas y puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de carne de melón Charentais, sin piel, picada", "225ml / 8fl oz de leche de coco fresca o enlatada", "2 cucharadas de azúcar, o al gusto", "1 granada, solo semillas carnosas", "2 puñados de hielo picado", "1 puñado de almendras en escamas, ligeramente tostadas en el horno hasta que estén doradas"], "method": ["Coloque las piezas de melón en un recipiente hondo. Usando los dedos, tritúrelos para que ya no tengan una forma regular y empiece a filtrar su maravilloso jugo, pero no los deje ser blandos.", "Agregue la leche de coco y el azúcar y mezcle bien. El color debe ser un hermoso melocotón pálido.", "Agregue las semillas de granada y deje enfriar en el refrigerador hasta que esté listo para servir.", "Para servir, coloque una cucharada de hielo picado en el fondo de cada uno de los seis tazones para servir y cubra con el rasayana. Espolvorea sobre las almendras copos."], "url": "www_bbc_co_uk_food_recipes_charantaismelonrasay_86646", "title": "Charentais melon rasayana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 x 180-200g / 6-7oz pedazos de filete de res, idealmente cortado como un círculo desde el centro del filete", "2 cucharadas de aceite de oliva", "1 manojo de tomillo fresco, finamente picado", "1 ramita de romero, solo hojas", "2 dientes de ajo, finamente picados", "sal y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "1 chalote, finamente picado", "5 granos de pimienta negra", "300ml / 10fl oz Puerto", "1 litro / 1¾ pintas de caldo de carne", "15g / ½ onza de mantequilla, picada", "Trufas negras de invierno 10g, en rodajas", "350g / 12oz de hojaldre listo para enrollar", "1 yema de huevo de gallinas camperas, golpeada", "15g / ½ oz de mantequilla", "250g / 9oz de setas de castaña, descuartizado", "½ cucharadita de aceite de oliva", "1 repollo savoy, finamente triturado", "Crema doble 50ml / 2fl oz", "1kg / 2lb 4oz de patatas, peladas y picadas", "100 g / 3½ oz de mantequilla", "Crema doble 250ml / 9fl oz", "Leche 250ml / 9fl oz", "4 ramitas de tomillo fresco", "4 cucharadas de aceite de oliva", "40 g / 1½ oz de hígado de pollo perfecto"], "method": ["Frote la carne con el aceite y sazone con sal y pimienta. Poner en un recipiente sellable con el tomillo, el romero y el ajo. Frote la carne con el adobo. Selle el contenedor y déjelo en la nevera durante 1-2 horas.", "Para hacer la salsa, caliente el aceite y cocine suavemente la chalota hasta que se ablande. Agregue los granos de pimienta y el Puerto. Cocine hasta que se reduzca en volumen en un tercio.", "Agregue el caldo y cocine a fuego lento durante 20 minutos, o hasta que se reduzca a una consistencia similar a la salsa. Pase a través de un colador en una olla limpia. Sazone y mezcle con la mantequilla. Agregue las rodajas de trufa.", "Para los pasteles y las setas, precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Corte cuatro círculos de 7 cm / 2½ pulgadas de diámetro de la masa. Cepille con el huevo y hornee durante 10 minutos, o hasta que estén dorados.", "Calentar la mantequilla en una sartén y cocinar los champiñones hasta que estén suaves. Sazone al gusto.", "Para el repollo, caliente el aceite en una olla limpia y cocine suavemente el repollo hasta que esté tierno. Mezcle en la crema y la temporada. Dejar de lado.", "Para el puré de papas, poner las papas en una sartén de agua fría y salada y llevar a ebullición. Cocine a fuego lento durante 15-20 minutos, o hasta que esté cocido. Escurra y vuelva a colocar en la sartén para que se seque al calor.", "Mash las patatas. Calienta la mantequilla y la crema en una olla. Cuando esté caliente, agregue a las papas con la leche. Mash y temporada.", "Saque la carne de la nevera y llévela a temperatura ambiente. Limpie el adobo.", "Caliente una sartén hasta que esté muy caliente. Frote la carne con un poco más de aceite y cocine en la sartén por unos minutos, luego gire y cocine por unos minutos más para hacer un patrón entrecruzado. Voltee la carne de nuevo, cocine por unos minutos y repita, hasta que esté hecho a su gusto. Retire de la sartén y descanse en un plato limpio durante 3-5 minutos.", "Para la guarnición, freír las ramitas de tomillo en el aceite o hasta que estén crujientes.", "Para servir, coloque una cuchara grande de repollo con crema en el centro de cada plato de servir. Coloque una cantidad generosa de salsa alrededor del repollo. Encima de la col, apila un disco de hojaldre, luego los champiñones y luego la carne. Adorne con una quenelle de parfait de hígado de pollo y el tomillo crujiente y sirva con puré de papa."], "url": "www_bbc_co_uk_food_recipes_chargrilled_beef_fillet_50966", "title": "Filete de ternera a la brasa con puré de col y trufa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Espagueti 100g / 3½oz", "3 cucharadas de aceite de oliva", "100g / 3½oz de brócoli, cortado en pequeños floretes", "1 diente de ajo, finamente cortado", "½ chile rojo, finamente cortado", "1 cucharada de almendras en copos", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir un sartén grande de agua con sal y cocine los espaguetis durante 8 minutos, hasta que estén al dente.", "Mientras tanto, caliente el aceite de oliva en una cacerola a fuego alto y agregue el brócoli. Déjalo por 1 minuto antes de moverlo para que el brócoli se calcine, luego gira y chamusca en los otros lados por unos 3 minutos.", "Agregue el ajo, el chile y las almendras y saltee por 3 minutos más. Condimentar con sal y pimienta.", "Escurra los espaguetis y agregue a la bandeja de brócoli, revuelva bien para combinar y servir."], "url": "www_bbc_co_uk_food_recipes_chargrilled_broccoli_69096", "title": "Pasta de brócoli a la parrilla con chile y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_broccoli_69096_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 lonchas de tocino", "1 patata, rallada", "1 chirivía, sin corazón y rallado", "1 cucharada de perejil fresco picado", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "1 yema de huevo de gallinas camperas", "1 limón, solo jugo", "110g / 4oz de mantequilla", "1 cucharada de mostaza integral", "½ cucharadita de sal", "2 rebanadas gruesas gammon", "2 cucharadas de aceite de girasol", "1 cucharadita de sal", "1 cucharadita de vinagre de vino blanco", "2 huevos de gallinas camperas"], "method": ["Freír el tocino en una sartén seca hasta que esté crujiente. Escurrir sobre papel de cocina y cortar aproximadamente.", "Coloque la papa y la chirivía en una toalla de té limpia y exprima sobre un recipiente para eliminar el exceso de líquido. Coloque en un recipiente aparte y mezcle el tocino y el perejil.", "Derrita la mantequilla y el aceite en una sartén a fuego medio. Agregue la mezcla de papa y presione hacia abajo con el reverso de una cuchara. Condimentar con sal y pimienta. Freír por 2-3 minutos en cada lado, usando una rodaja de pescado para dar vuelta cuidadosamente, hasta que esté crujiente y dorado.", "Para el holandés, derrita la mantequilla en una cacerola a fuego lento, luego quite la espuma para dejar un líquido amarillo claro. Coloque la yema de huevo, el jugo de limón y una cucharada de agua en una licuadora. Encienda la máquina y vierta lentamente la mantequilla caliente clarificada a través de la tapa. Agregue la mostaza y la sal y mezcle.", "Para el jamón, caliente una sartén grande a fuego medio-alto y cocine el jamón durante 2-3 minutos en cada lado, hasta que esté bien cocido.", "Para el huevo escalfado, caliente una olla grande de agua hirviendo a fuego lento, agregue la sal y el vinagre y centrifugue el agua. Rompe un huevo en el charco de agua y cocina por 2-3 minutos, o hasta que te guste. Repita con el segundo huevo.", "Coloque un rösti en un plato. Cubra con gammon a la parrilla y un huevo escalfado y vierta sobre el holandés."], "url": "www_bbc_co_uk_food_recipes_chargrilled_gammon_with_65680", "title": "Jamón a la parrilla con chirivía, papas y tocino rösti, huevo escalfado y holandesa a la mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de almendras tostadas", "Nueces tostadas 30g / 1oz", "200g / 7oz de pimientos rojos asados ​​y despellejados de una jarra como el piquillo", "¼ cucharadita de pimentón ahumado en caliente", "¼ cucharadita de pimienta de cayena", "1 rebanada de pan de masa fermentada rancia", "1 cucharadita de pasta de tomate", "vinagre de Jerez al gusto (alrededor de 2 cucharaditas)", "2 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida", "aceite de oliva", "1/5 pequeñas calabazas de temporada, como Ironbark, quitar la piel y las semillas, cortar en dados de 1cm / ½", "8 hongos porcini pequeños, limpiados y cortados y cortados en rodajas gruesas", "1 col hispi pequeña, cortada en cuñas y el núcleo eliminado", "jugo de medio limón", "4 filetes gruesos de caballa, cortados en 2 en el ángulo y piel anotada"], "method": ["Para la salsa romesco ponga todos los ingredientes en una licuadora, sazone y mezcle hasta que tenga un puré grueso. Dejar de lado.", "Calentar un chorrito de aceite de oliva en una sartén a fuego medio. Agregue la calabaza y sazone bien. Cocine lentamente durante 5-6 minutos hasta que estén ligeramente dorados y tiernos. Dejar de lado.", "Caliente una sartén grande a fuego medio. Rocíe los porcini y las rodajas de repollo con aceite y cocine en la sartén de la parrilla, girando sobre la marcha, hasta que esté cocido y ligeramente chamuscado. Retire de la sartén, exprima un poco de jugo de limón y reserve.", "Limpie la bandeja de la plancha y enciéndala al máximo de calor. Frote la caballa con aceite de oliva y sazone bien. Coloque la piel hacia abajo y cocine por 3 minutos para que quede ligeramente charola antes de encenderla y cocinar por otros 2 minutos. La caballa aún debe ser un poco rosa.", "Para servir, amontone el porcini, la calabaza y el repollo en un plato y luego cubra con la caballa a la parrilla y la cuchara alrededor de la salsa romesco."], "url": "www_bbc_co_uk_food_recipes_chargrilled_mackerel_93477", "title": "Caballa a la brasa con nueva calabaza de temporada y salsa romesco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de pulpo", "3 ramitas de tomillo fresco", "1 cebolla, rebanada gruesa", "2 hojas de laurel", "1 zanahoria, más o menos picada", "1 tallo de apio, más o menos picado", "1 bulbo de ajo, cortado por la mitad horizontalmente", "8 granos de pimienta negra, dejados enteros", "4 cucharadas de aceite de oliva", "1 chile rojo, semillas retiradas y rebanadas", "1 limón, cáscara y jugo solamente", "2 cucharadas de menta fresca, picada", "2 cucharadas de perejil fresco, aproximadamente picado", "2 ramitas de tomillo fresco", "250ml / 9fl oz de caldo de pollo", "6 alcachofas para bebés, peladas y estranguladas, cortadas", "1 bulbo de hinojo, finamente cortado en una mandolina, frondas reservadas", "15g / ½oz de hojas de cohete", "15 g / ½ oz de espinaca baby", "1 cucharada de vinagre de Cabernet Sauvignon", "1 cucharadita de miel clara", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de perejil fresco, picado", "1 chile rojo, en rodajas finas"], "method": ["Para el pulpo a la brasa, coloca todos los ingredientes en una olla grande y cúbrelos con agua. Llevar a ebullición y cocine a fuego lento durante 1½-2 horas.", "Retire de la sartén y deseche las verduras, deje a un lado el pulpo para que se enfríe.", "Una vez frío, corta el pulpo en pedazos y colócalo en un tazón grande. Agregue los ingredientes del adobo y deje por lo menos dos horas.", "Para la ensalada de alcachofas, caliente una sartén grande o una sartén y agregue el tomillo, el caldo y la alcachofa. Cubra con una tapa y cocine durante 5-6 minutos.", "Caliente una sartén grande hasta que esté caliente. Coloque el pulpo marinado en la plancha y cocine durante 1-2 minutos en cada lado, o hasta que aparezcan las marcas de la barra.", "Coloque las alcachofas bebé cocidas y las rodajas de hinojo y las hojas en un tazón grande junto con el cohete y las espinacas.", "Coloque el vinagre, la miel y el aceite en un tazón pequeño y mezcle.", "Agregue el pulpo y el aderezo a la ensalada y mezcle.", "Para servir, coloque la ensalada en tazones poco profundos y espolvoree sobre el perejil y el chile."], "url": "www_bbc_co_uk_food_recipes_chargrilled_octopus_with_73135", "title": "Pulpo a la brasa con ensalada de alcachofas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 remolachas crudas grandes", "aceite de oliva", "sal y pimienta", "4 cucharadas de vinagre balsámico", "150ml / 5fl oz de vino Cabernet Sauvignon", "1 cucharada de azúcar", "25g / 1oz de mantequilla", "500g / 1lb 2oz de papas cerosas grandes", "1 bombilla de ajo ahumado", "mantequilla derretida, para cubrir", "sal y pimienta", "100ml / 3½ fl oz crema doble", "50 ml / 2 fl oz crema fresca", "½ cucharadita de mostaza inglesa", "2 cucharaditas de raíz de rábano picante recién rallado", "1-2 cucharadas de jugo de limón", "sal y pimienta blanca, al gusto", "200g / 7oz de judías verdes, finamente rebanadas", "25g / 1oz de mantequilla", "sal y pimienta", "4 filetes de grupa de ternera de 4 x 200 g / 7 oz", "sal y pimienta", "aceite de oliva"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Para la remolacha, arriba, la cola y lavar la remolacha. Frotar con aceite, sazonar con sal y pimienta, al gusto, envolverlo en papel de aluminio y hornear hasta que esté tierno - esto tomará aproximadamente dos horas y media. Deje que se enfríe y luego empuje la piel con los dedos (use guantes de goma si no quiere las manos moradas). Cortar en cuñas y reservar.", "Ponga el vinagre balsámico, el vino y el azúcar en una sartén. Hierva hasta que el volumen del líquido se haya reducido a la mitad. Agregue la remolacha, sazone con sal, pimienta y la mantequilla, y manténgalos calientes.", "Para las papas, pele las papas y hiérvalas en una sartén de agua hirviendo con sal hasta que estén tiernas. Escurrir bien.", "Coloque el bulbo de ajo ahumado en una cacerola y cúbralo con mantequilla derretida. Cocine a fuego lento durante 45 minutos y luego deje enfriar. Pele los dientes de ajo y coloque de nuevo en la mantequilla y luego mezcle hasta que quede suave con una batidora manual.", "Aplastar las patatas ligeramente con un folk. Mezcle el puré de mantequilla con ajo y sazone con sal y pimienta, teniendo cuidado de no convertir las patatas en puré.", "Para la crema de rábano picante, azote ligeramente la crema doble en un tazón y mezcle la crème fraîche, la mostaza inglesa, el rábano picante fresco y el zumo de limón. Mezcle bien y sazone al gusto con sal y pimienta. Dejar de lado.", "Para los frijoles, blanquee los frijoles en una sartén de agua salada hirviendo durante dos minutos, luego drene y revuelva en un tazón con agua helada. Drenar de nuevo.", "Calentar la mantequilla en una sartén y agregar los frijoles. Sazonar con sal y pimienta y freír durante un minuto para calentar. Dejar de lado.", "Para el bistec, precaliente una plancha en caliente. Sazone el filete generosamente con sal y pimienta, rocíe con un poco de aceite de oliva y luego coloque sobre la plancha caliente. Cocine por unos dos minutos en cada lado para raro, 3½ por medio y luego déjelo reposar por un minuto antes de servir.", "Para servir, coloque una cucharada de papa en cada plato junto con el bistec, rodee con 3-4 porciones de remolacha y un poco de jarabe, algunos frijoles y una cucharada de crema de rábano picante."], "url": "www_bbc_co_uk_food_recipes_chargrilled_rump_steak_15191", "title": "Filete de rape a la brasa con remolacha asada, ajo ahumado, papas machacadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, pelado y picado", "1 guindilla roja, finamente picada", "50 g / 2 oz de jengibre fresco, pelado, más o menos picado", "2-4 ramitas de eneldo fresco, picado", "1 cucharada de azúcar", "4 cucharadas de jugo de limón", "2 cucharadas de salsa de pescado", "1-2 tallos de limoncillo, ligeramente triturados", "1 lubina entera, desescamada, limpiada", "10 envolturas de rollitos de arroz", "Fideos de arroz 100 g / 3 oz, cocidos de acuerdo con las instrucciones del paquete", "200 g / 6 oz de zanahorias, ralladas", "½ piña, cáscara y núcleo retirados, cortados en fósforos finos", "1 pepino, sin semillas, cortado en fósforos finos", "1 calabacín, cortado en fósforos delgados", "1 manojo de eneldo fresco, desgarrado en pequeñas ramitas", "250g / 8oz de piña fresca, triturada o mezclada para obtener un puré rugoso", "2 cucharadas de salsa de pescado", "1 cucharada de jugo de limón", "1 guindilla roja, finamente picada"], "method": ["Encienda una barbacoa de carbón o precaliente una parrilla en alto.", "Para el adobo, combine el ajo, el chile, el jengibre, el eneldo, el azúcar y el jugo de limón con cuatro cucharadas de agua. Agregue la salsa de pescado, al gusto.", "Haga tres ranuras a través de la piel del pez en cada lado. Vierta unas cucharaditas de adobo dentro del pescado y coloque los tallos de limoncillo, luego frote el resto del adobo por toda la piel. Deje marinar durante 20-30 minutos.", "Ase el pescado a fuego medio o bajo una parrilla caliente durante diez minutos a cada lado, o hasta que esté bien cocido. Dejar de lado para enfriar.", "Para la salsa de inmersión, combine la piña, la salsa de pescado, el jugo de limón y cuatro cucharadas de agua. Agregue el chile al gusto. Dejar de lado.", "Para los rollos de verano, coloque la hoja de papel de arroz en una tabla de cortar. Coloque un recipiente con agua fría al lado y con los dedos húmedos, golpee la hoja de papel de arroz hasta que esté flexible. Deben estar húmedos pero no demasiado húmedos ya que se romperán.", "Coloque una pizca de fideos cocidos en el centro del papel de arroz. Cortar aproximadamente una cucharada de carne de la lubina, quitar los huesos con los dedos y colocar sobre el papel de arroz con los fideos.", "Doble el papel de arroz una vez. Coloque una pizca de zanahoria rallada al lado del paquete de pescado y fideos. Luego agregue una o dos piezas de pepino, calabacín, piña y eneldo. Doble los lados del papel de arroz y enrolle el pescado y las verduras. Repita hasta que todas las envolturas del rollo de primavera estén agotadas.", "Sirve con la salsa para mojar."], "url": "www_bbc_co_uk_food_recipes_chargrilled_seabass_62243", "title": "Rollitos de verano de lubina a la brasa con salsa de piña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Hace 10 rollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_seabass_62243_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["azúcar impalpable, medido a la marca de 850 ml / 1½ pinta en una jarra medidora", "3 limones no encerados", "9 huevos de gallinas camperas", "150 g / 5 oz de mantequilla, cortada en trozos pequeños", "3 cucharadas de cebollines cortados", "2 cucharadas de perejil picado", "1 cucharada de estragón picado", "1 cucharada de menta picada", "sal y pimienta negra recién molida", "Salmón ahumado de 450 g / 1 libra, cortado en filetes gruesos de 1-2 cm / ½ pulgada"], "method": ["Para el puré de limón, ponga el azúcar y 850ml / 1½ pinta de agua en una cacerola.", "A fuego lento, permita que el azúcar se disuelva y luego llévelo a fuego lento durante 10 minutos. Retirar del fuego y dejar enfriar. Este jarabe común se mantendrá en la nevera por hasta una semana.", "Pinche los limones bastante profundamente y colóquelos en una cacerola con suficiente agua fría para cubrirlos. Llevar a ebullición, retirar del fuego y dejar que los limones se enfríen en el agua. Repita esto dos veces más usando agua fresca cada vez.", "Vuelva a colocar los limones en la cacerola y cubra con un tercio del sirope común. Llevar a ebullición, retirar del fuego y dejar que los limones se enfríen en el sirope.", "Repita esto dos veces más usando jarabe de reserva fresca cada vez.", "Coloque los limones junto con unas pocas cucharadas de sirope de reserva (retenga el sirope de reserva restante) y mezcle en una licuadora hasta que quede suave.", "Pase a través de un colador, pruebe y agregue un poco más del sirope retenido si es necesario, guárdelo en una botella apretada en el refrigerador.", "Para los huevos revueltos hervidos, rompa los huevos en un tazón grande, golpéelos bien y luego empújelos a través de un colador en una sartén antiadherente de base pesada. Agregue los pedazos de mantequilla y reserve.", "Coloque el cebollín, el perejil, el estragón y la menta en un bol.", "Aproximadamente 20 minutos antes de servir, caliente los huevos con el menor calor posible, revolviendo continuamente.", "Una vez que la mantequilla se haya derretido, los huevos comenzarán a cocinarse: obsérvalos con cuidado ya que deben estar bastante líquidos cuando se sirven y continuarán cocinando después de haberlos quitado del fuego.", "Justo antes de servir, agregue las hierbas y sal y pimienta al gusto.", "Para el salmón, caliente una sartén de base gruesa hasta que esté casi a punto de ahumar.", "Coloque los filetes de salmón en las crestas de la sartén y presione por no más de 30 segundos.", "Voltea los filetes y repite del otro lado.", "Para servir, coloque el salmón en cada plato, apile los huevos junto con un chorrito de puré de limón."], "url": "www_bbc_co_uk_food_recipes_chargrilled_smoked_97760", "title": "Salmón ahumado a la parrilla con huevos revueltos con hierbas y puré de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x calamar (aproximadamente 250 g / 9 oz cada uno), limpiado y cortado en triángulos", "sal y pimienta negra recién molida", "aceite de oliva virgen extra", "1 lima, solo jugo", "2 huevos de gallinas camperas, solo yemas", "½ cucharadita de sal marina", "pizca de pimienta blanca", "2 cucharaditas de vinagre de vino de arroz", "4 cucharaditas de salsa de chile picante", "2 cucharaditas Yuzuji", "Aceite vegetal 200ml / 7floz", "3 cucharadas de berro de coriandro", "2 cucharadas de berro de apio", "2 cucharadas de hojas de menta, recogidas", "1 puñado de berros, hojas recogidas"], "method": ["Para el calamar, caliente una sartén hasta que esté caliente.", "Sazonar el calamar con sal y pimienta negra y un chorrito de aceite.", "Coloque sobre la plancha y cocine en cada lado durante 30 segundos hasta que esté cocido y cocinado.", "Retire y exprima la cal sobre la parte superior.", "Para el aderezo Ponzu cremoso, coloque todos los ingredientes, excepto el aceite vegetal en un procesador de alimentos pequeño y mezcle hasta obtener un puré.", "Agregue gradualmente el aceite vegetal hasta que se forme una mayonesa fina.", "Controle el condimento y agregue más jugo de yuzu si lo desea.", "Para servir, esparza el berro y las hojas sobre cada plato, luego coloque un calamar encima y rocíe con el cremoso aderezo Ponzu."], "url": "www_bbc_co_uk_food_recipes_chargrilled_squid_with_93505", "title": "Calamar a la parrilla con aderezo ponzu cremoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["275ml / 9½fl oz de vinagre de malta", "225g / 8oz de azúcar morena suave", "1,5 kg / 3 lb 5 oz de tomates rojos maduros, muy toscamente picados", "Cebollas de 200g / 7oz, aproximadamente picadas", "4 chiles rojos, picados", "2 dientes de ajo, finamente picados", "1 cucharada de jengibre de raíz finamente picado", "1 cucharadita de cilantro molido", "sal marina y pimienta negra recién molida", "4 filetes de T-bone, a temperatura ambiente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 chalotes de plátano, con piel, cortados por la mitad a lo largo", "4 higos frescos, cortados por la mitad a lo largo", "1 lechuga redonda, separada en hojas", "1 cucharada de vinagre balsámico", "½ limón, solo jugo", "3 cucharadas de aceite de oliva virgen extra"], "method": ["Para la salsa picante, coloque el vinagre y el azúcar en una olla grande y deje que hierva, luego cocine durante 3-4 minutos hasta que el azúcar se derrita.", "Agregue todos los demás ingredientes, lleve a ebullición y cocine durante unos 20-30 minutos, revolviendo con frecuencia. Si los tomates son muy jugosos, es posible que tenga que cocinar un poco más hasta que la mezcla comience a espesarse.", "Deje la salsa picante con una textura gruesa y no cocine demasiado tiempo para que los ingredientes comiencen a descomponerse en un puré.", "Enfríe la salsa picante antes de servir con el bistec y colóquela en frascos esterilizados para almacenar durante dos o tres semanas en la nevera, el sabor mejorará con el tiempo.", "Para el bistec, caliente una sartén hasta que esté caliente.", "Frote los filetes con un poco de aceite de oliva y sazone con sal y pimienta negra.", "Coloque en la plancha y espere dos minutos, luego gire los filetes 90 grados y dore el mismo lado por otros dos minutos.", "Voltee los filetes y repítelos, abrasándolos y volteándolos.", "Retire los filetes de la plancha y déjelos a un lado, para descansar, en un plato.", "Mientras tanto, frote las chalotas con el resto del aceite de oliva y coloque el lado cortado sobre la plancha y cocine durante 3-4 minutos. Luego agregue los higos, boca abajo, y cocine por otro minuto hasta que estén tiernos y carbonizados.", "Batir el vinagre balsámico, el jugo de limón y el aceite de oliva virgen extra juntos y luego sazonar con sal y pimienta negra recién molida.", "En el último minuto, mezcle la lechuga, los chalotes y los higos en un bol con el aderezo.", "Para servir, para cada persona, coloque un filete en un tablero, amontone la ensalada junto con una cucharada de chutney."], "url": "www_bbc_co_uk_food_recipes_chargrilled_t-bone_steak_64791", "title": "Filete de ternera a la brasa con chutney de chile de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_t-bone_steak_64791_16x9.jpg", "isVegetarian": false, "recommendations": 0}]