[{"ingredients": ["1 cucharada de aceite de oliva", "Calamar 200 g / 7 oz, limpiado y cortado en anillos", "sal y pimienta negra recién molida", "2 dientes de ajo, finamente picados", "½ chile rojo, finamente picado", "½ tallo de limoncillo, finamente picado", "1 lima, solo jugo", "1 cucharada de salsa de soja", "2 cucharaditas de aceite de sésamo", "Fideos de huevo 100g / 3½ oz, cocidos y escurridos", "1 huevo de gallinas camperas, golpeado", "1 cucharadita de azúcar en polvo", "2 cucharadas de cilantro fresco picado (reservar algunas para decorar)"], "method": ["Frote el calamar en aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté humeante, agregue el calamar y cocínelo durante 1-2 minutos, agitando la sartén continuamente, hasta que se cocine a la parrilla por todos lados. Retirar del fuego y mantener caliente.", "Caliente un poco de aceite de oliva en una sartén, agregue el chile, el ajo y la hierba de limón y cocínelos suavemente durante un minuto.", "Agregue el jugo de lima, la soja, el aceite de sésamo y los fideos de huevo. Revuelva bien, y luego agregue el huevo batido y el azúcar. Cocine durante 1-2 minutos, revolviendo para cubrir los fideos en el huevo. Agregue la mayor parte del cilantro.", "Para servir, coloque una pila de fideos en un plato y cubra con el calamar. Adorne con el cilantro restante."], "url": "www_bbc_co_uk_food_recipes_honeycombsquidwithno_82145", "title": "Calamares a la plancha con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pato, confitadas en su propia grasa, hechas en casa o de una lata o tarro", "4 cucharadas de miel clara", "3 cucharadas de aceite de oliva", "2-3 ramitas de tomillo fresco, hojas peladas", "310g / 11oz de puré de papas, peladas y picadas", "3 cucharadas de leche caliente", "120ml / 4fl oz de vino tinto", "250ml / 9fl oz de caldo de pollo", "55g / 2oz de algas crujientes", "mantequilla pequeña perilla", "sal marina y pimienta negra recién molida"], "method": ["Para hacer confit de pato, toma 2 patas de pato y pésalos. Mida 15 g de sal por 1 kg de carne y espolvoree la sal con tomillo fresco sobre las patas. Almacene en un refrigerador por al menos 12 horas. Derrita la grasa de pato (disponible en lata de delis) en una sartén a fuego lento y deje hervir a fuego lento. Coloque las patas de pato frío en la grasa y cocine muy suavemente durante 1 ½-2 horas, no hierva. Quítate el fuego y deja enfriar en la grasa.", "Caliente el horno a 180 ° C / 350 ° F / Gas 4. Raspe la grasa de las patas y colóquela en una fuente para asar. (Reserve la grasa, es bueno para papas asadas o huevos para freír).", "Batir la miel y el aceite y untar las patas de pato. Espolvorea sobre las hojas de tomillo. Ase las piernas en el horno por unos 20 minutos, espolvoreando el glaseado de miel sobre las piernas 2-3 veces.", "Mientras tanto, hierva las papas en una sartén con agua ligeramente salada durante aproximadamente 15 minutos o hasta que estén tiernas. Escurrir, luego machacar con un tenedor, batiendo gradualmente en la leche caliente, la mantequilla y un montón de condimentos.", "Coloque el vino y el caldo en la cacerola, lleve a ebullición y continúe hirviendo hasta que se reduzca en dos tercios. Sazonar bien", "Coloque el puré de patatas en el centro de platos tibios, espolvoree las algas marinas alrededor del puré y coloque las patas de pato encima. Raspe cualquier trozo de carne de la bandeja de asar y espolvoree, luego vierta sobre la salsa de vino tinto reducido y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_honeyedduckconfitwit_68106", "title": "Confit de pato a la miel con algas crujientes y puré de crema", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 20z de azúcar en polvo", "1 cucharada de agua de rosas", "4 melocotones", "Yogur griego 360ml / 13oz", "3 cucharadas de miel"], "method": ["Ponga el azúcar impalpable y el agua de rosas en una sartén con 1 litro / 1¾ pintas de agua y deje que hierva. Corta una cruz pequeña en la parte superior de cada melocotón, luego agrégala a la sartén y cocina a fuego lento durante 5 minutos. Saca los melocotones del almíbar y quítales las pieles, luego vuelve al almíbar y cocina durante 10 minutos hasta que el jarabe se haya reducido a la mitad. Tensión y genial.", "Prepare el yogurt con miel mezclando el yogurt y la miel, luego sirva con los melocotones perfumados con rosa y rocíe sobre el resto del jarabe."], "url": "www_bbc_co_uk_food_recipes_honeyedyoghurtwithro_70433", "title": "Yogur con miel con melocotones perfumados de agua de rosas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7¼ oz de mantequilla sin sal", "200g / 7¼ oz de azúcar demerara", "200g / 7¼ oz de miel", "Avena de avena 400g / 14¼oz", "50g / 1¾oz de nueces, frutas secas o glacé jengibre, coco picado o desecado (opcional)", "También necesitará una lata de pastel de 20 cm x 30 cm (8 pulg. X 12 pulg.), Engrasada"], "method": ["Coloque la mantequilla, el azúcar y la miel en una cacerola y caliente, revolviendo ocasionalmente, hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Agregue la avena y los frutos secos, la fruta, el jengibre o el coco, si los usa, y mezcle bien.", "Transfiera la mezcla de avena a la lata de torta preparada y extiéndala hasta aproximadamente 2 cm (¾in) de grosor. Alise la superficie con el dorso de una cuchara. Hornee en un horno precalentado a 180 ° C / 350 ° F / Gas 4 durante 15-20 minutos, hasta que quede ligeramente dorado alrededor de los bordes, pero aún ligeramente suave en el medio. Deje enfriar en la lata, luego gire y corte en cuadrados."], "url": "www_bbc_co_uk_food_recipes_honeyflapjacks_73203", "title": "Flapjacks de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeyflapjacks_73203_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo, picado", "2 dientes de ajo picados", "4 cucharaditas de miel clara", "sal y pimienta", "1 taza de agua caliente", "aceite de oliva, para mezclar"], "method": ["Sudor el pimiento rojo y el ajo en una sartén caliente durante 2-3 minutos.", "Agregue la miel y luego el agua caliente, cocine a fuego lento durante aproximadamente 1 minuto.", "Mezcle la mezcla y agregue lentamente el aceite de oliva a una consistencia de salsa suave. Pase el aderezo a través de un colador, sazone y use."], "url": "www_bbc_co_uk_food_recipes_honeygarlicandredpep_67768", "title": "Aderezo de miel, ajo y pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, cortada en tiras", "aceite de oliva", "2 cucharadas de miel clara", "sal y pimienta negra recién molida", "dash aceite de oliva", "2 cebollas de primavera, en rodajas", "¼ de pimiento verde, en rodajas", "½ chile rojo fresco, picado", "Fideos de huevo de 150 g / 5½ onzas, cocidos y escurridos", "3 cucharadas de cilantro fresco picado", "1 cucharada de salsa de soja", "salpicar agua hirviendo"], "method": ["Para los pinchos de pollo, ensarte el pollo en dos brochetas y rocíe con aceite de oliva. Caliente una sartén de plancha, agregue los pinchos y cocine a la parrilla hasta que estén dorados por todos lados y completamente cocidos. Rocíe con miel, sal y pimienta negra recién molida y reserve.", "Para los fideos, caliente el aceite de oliva en una sartén, agregue las cebolletas, el pimiento verde y el chile y fría por 2-3 minutos. Agregue los fideos cocidos y agregue el cilantro y la salsa de soja y un chorro de agua hirviendo.", "Para servir, apile los fideos en un plato para servir y cubra con los pinchos de pollo."], "url": "www_bbc_co_uk_food_recipes_honeyglazedchickensk_88316", "title": "Pinchos de pollo glaseado con miel y fideos picantes salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla", "2 cucharadas de miel", "1 naranja, pelada y cortada en cuñas", "1 cucharada de azúcar moreno", "½ vaina de vainilla", "2 yemas de huevo de gallinas camperas", "2 cucharadas de vino blanco", "2 cucharadas de azúcar"], "method": ["Para las naranjas con miel, derrita la mantequilla en una cacerola. Agregue la miel y cocine hasta que se dore, por un minuto.", "Agregue las rodajas de naranja, el azúcar morena y la vaina de vainilla y cocínelas durante dos minutos más, hasta que estén caramelizadas.", "Para el sabayon, en un recipiente bata las yemas de huevo con el vino blanco y el azúcar sobre una fuente de agua hirviendo, hasta que duplique su tamaño.", "Sirve el sabayon con miel de naranja."], "url": "www_bbc_co_uk_food_recipes_honeyorangesservedwi_76271", "title": "Naranjas con miel servidas con sabayón de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de chuleta de cerdo", "2 cucharadas de aceite de oliva", "1 hongo plano grande, rebanado", "pizca de copos de chile seco", "2 cucharaditas de salsa de soja", "1 cucharada de miel clara", "1 cucharada de aceite vegetal", "1 batata, pelada y cortada en discos", "1 diente de ajo, en rodajas", "1 ramita de romero fresco, hojas recogidas", "sal y pimienta negra recién molida"], "method": ["Para el cerdo relleno, quite un poco de la grasa y la corteza de la picadura con un cuchillo afilado.", "Coloque la chuleta de cerdo entre dos pedazos de película adhesiva. Aplanar la carne de cerdo con un mazo de carne o el extremo de un rodillo hasta 1 cm / ¼ de grosor.", "Con un cuchillo afilado, corte una hendidura en el lado de la corteza de la chuleta de cerdo para hacer un bolsillo.", "Caliente una cucharada de aceite de oliva en una sartén pequeña, agregue los champiñones rebanados y las hojuelas de chile y cocínelos durante tres minutos.", "Retire la sartén del fuego y deje que la mezcla de hongos se enfríe. Una vez que esté lo suficientemente frío como para manejar, rellene el bolsillo del cerdo con la mezcla de champiñones.", "Caliente la cucharada restante de aceite de oliva en la sartén. Agregue el cerdo y cocínelo en ambos lados durante cinco minutos o hasta que se dore.", "Agregue la salsa de soja y la miel limpia y cocine durante 1-2 minutos, o hasta que la carne de cerdo esté completamente cocida. Retire la sartén del fuego, cúbrala con papel de aluminio y deje reposar la carne de cerdo durante cinco minutos.", "Para las batatas fritas, caliente el aceite vegetal en una sartén pequeña, agregue las batatas y fría por seis minutos.", "Agregue el ajo y el romero y sazone bien con sal y pimienta negra recién molida y cocine durante 1-2 minutos o hasta que estén dorados y cocidos.", "Para servir, coloque las papas en un plato limpio y cubra con la chuleta de cerdo rellena."], "url": "www_bbc_co_uk_food_recipes_honeyglazedporkstuff_84594", "title": "Cerdo glaseado de miel relleno de champiñones con romero frito y patatas dulces de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de hojaldre laminado", "1 huevo de gallinas camperas, golpeado", "4 cucharadas de miel", "azúcar glas, al polvo", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de azúcar glas", "1 cucharada de miel de flores silvestres"], "method": ["Para las palmisteras, precalentar el horno a 200C / 400F / Gas 6.", "Coloque la masa en una superficie limpia, cepille los bordes con huevo batido y rocíe la mitad de la miel sobre la masa. Dobla los bordes laterales de la masa hacia dentro hasta que se encuentren en el centro. Rocíe con el resto de la miel.", "Cortar la 'salchicha' del pastel en pedazos de 2,5 cm / 1 in y colocar cada uno plano en una bandeja para hornear. Hornee por 8-10 minutos, o hasta que se hinche y se dore. Deslice en un plato de servir y el polvo generosamente con azúcar glasé.", "Para la crema de miel batida, bate la crema doble hasta que forme picos suaves cuando se quite la batidora. Dobla el azúcar glas y la miel.", "Para servir, vierta la crema de miel en un tazón para servir al lado de las palmisteras."], "url": "www_bbc_co_uk_food_recipes_honeyparmierswithwhi_86213", "title": "Palmeras de miel con crema de miel batida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de patatas nuevas", "1 cucharada de aceite de oliva", "2 dientes de ajo, toscamente picados", "25g / 1oz de hojas frescas de romero", "1 cucharada de aceite de oliva", "½ cebolla roja, finamente rebanada", "1 cucharada de azúcar moreno", "2 ciruelas, piedras removidas y picadas", "100 ml / 2½ fl oz de vino tinto", "1 lima, solo jugo", "sal y pimienta negra recién molida", "1 pechuga de pato, piel anotada", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de miel", "75g / 2¾oz de espinaca", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "pizca de copos de chile seco", "½ cebolla roja, finamente rebanada"], "method": ["Para hacer las papas salteadas, hierva las papas durante diez minutos, hasta que estén suaves, luego escurra y corte por la mitad a lo largo.", "Calentar el aceite en una sartén a fuego medio. Agregue el ajo y el romero y fría por un minuto.", "Agregue las rodajas de papa y saltee durante ocho minutos, volteándolas una vez, hasta que estén doradas por ambos lados.", "Para hacer el chutney, caliente el aceite en una sartén a fuego medio. Agregue las cebollas y fría por cinco minutos hasta que se ablanden.", "Agregue el azúcar morena y las ciruelas y cocine para que se caramelice con las cebollas durante dos minutos.", "Agregue el vino tinto y el jugo de lima, lleve a ebullición y cocine a fuego lento para reducir a una consistencia gruesa de chutney.", "Para el pato, frote el pato con el aceite y sazone bien con sal y pimienta negra recién molida.", "Coloque una sartén a fuego medio. Cuando esté caliente, agrega el pato con la piel hacia abajo y freír durante cinco minutos, para liberar parte de la grasa de pato.", "Cuando la piel se haya dorado, vierta el exceso de grasa de pato, luego revuelva el pecho y cocine por otros tres minutos. Rocíe la miel y cocine por otros dos minutos, o hasta que esté cocida a su gusto. Retirar del fuego y dejar reposar en un plato caliente durante dos minutos.", "Para las espinacas, caliente el aceite en una sartén a fuego medio. Agregue las cebollas, el ajo y el chile y fría por 3-4 minutos, hasta que estén blandos.", "Agregue las espinacas y saltee durante 4-5 minutos, hasta que se marchiten. Escurrir el exceso de humedad de la espinaca y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca la espinaca en el centro de un plato caliente. Coloque la pechuga de pato encima de la espinaca, coloque las papas salteadas alrededor del plato y vierta sobre la salsa picante."], "url": "www_bbc_co_uk_food_recipes_honeyroastduckwithsa_80925", "title": "Pato asado con papas salteadas, espinaca con chile y chutney de ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas de agua de 250 g / 9 oz, aplastadas", "Azúcar demerara 75 g / 2½ oz", "125g / 4½oz de mantequilla, derretida", "1kg / 2¼lb de ricotta", "6 huevos de gallinas camperas", "100g / 3½ oz de azúcar", "100 ml / 3½ fl oz miel", "200 g / 7 oz de pistachos, conchas eliminadas, ligeramente trituradas", "200 g / 7oz de pasas doradas", "100 ml / 3½ fl oz miel", "100 g / 3½ oz de pistachos", "Yogur de estilo griego, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la base, mezcle los bizcochos de agua, el azúcar y la mantequilla derretida en un bol, luego presione la mezcla en la base de un molde de 25cm / 10 pulg.", "Para el aderezo, bata la ricota, los huevos, el azúcar y la miel en un bol.", "Dobla los pistachos triturados y las pasas doradas, luego coloca la mezcla sobre la base.", "Transfiera al horno y hornee por una hora, o hasta que estén ligeramente dorados. Retirar del horno y dejar enfriar por completo.", "Para la salsa, coloque la miel y los pistachos en una sartén y caliente suavemente para calentarlos.", "Para servir, corte el pastel en trozos, vierta sobre la salsa y sirva con yogur grueso de estilo griego."], "url": "www_bbc_co_uk_food_recipes_honeyricottaandraisi_86780", "title": "Pastel de miel, ricota y pasas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 12-14", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mostaza integral", "1 cucharadita de miel líquida", "2 chuletas de cerdo", "50g / 2oz de mantequilla", "1 cebolla roja, partida en dos y rebanada", "2 manzanas Golden Delicious, peladas, sin corazón y cortadas en 8 rebanadas", "200g / 7oz de papas nuevas, ligeramente cocidas y partidas por la mitad", "1 cucharadita de mostaza integral", "6 hojas de salvia fresca trituradas", "3 chalotes finamente picados", "1 cucharada de granos de pimienta verde", "pequeña sidra de vidrio", "100ml / 3½ fl oz crema doble"], "method": ["Mezcle la mostaza integral con la miel líquida. Corta la grasa de la parte posterior de las chuletas en tres lugares para evitar que se encrespen, luego unta generosamente con la mostaza de miel.", "Coloque entonces en una sartén mediana de la plancha caliente y cocine durante seis minutos por cada lado.", "En otra sartén, derrita un poco de mantequilla y agregue las cebollas y las manzanas, y cocínelas durante dos o tres minutos.", "A continuación, agregue las papas y otra cucharadita de mostaza. La idea es calentar todo junto. Justo antes de servir agregue el sabio y la temporada.", "Prepara la salsa de pimienta. En una sartén caliente coloque una perilla de mantequilla y déjela espuma.", "Agregue los chalotes y los granos de pimienta y cocine por un minuto. Agregue un poco de sidra y deje que hierva.", "Agregue la crema doble y cocine hasta que espese y coloree. Temporada.", "Para servir, coloque la tajada en el plato, apile la manzana y las papas y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_honeymustardporkchop_71672", "title": "Chuletas de cerdo con mostaza y pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, piel anotada", "sal y pimienta negra recién molida", "1 cucharada de miel clara", "3 dientes", "1 cucharada de aceite de oliva", "150g / 5½oz de cuscús", "300ml / ½ litro de caldo de pollo caliente", "pizca de copos de chile", "½ mango, pelado, removido de piedra, cortado en cubitos", "2 cucharadas de cilantro fresco picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazone la pechuga de pato marcada con sal y pimienta negra recién molida. Caliente una sartén a prueba de horno hasta que esté humeante, agregue la pechuga de pato con la piel hacia abajo y fría durante 3-4 minutos o hasta que se dore. Voltee la pechuga de pato y transfiera la sartén al horno para asar durante cinco minutos más.", "Retire del horno y rocíe la pechuga de pato con la miel e inserte los dientes en la piel. Vuelve al horno durante cinco minutos, o hasta que el pato esté cocido pero ligeramente rosado en el medio. Retire del horno y descanse en un lugar cálido durante cinco minutos, deseche los dientes y corte la carne finamente.", "Para el cuscús y el cuscús de mango, caliente el aceite de oliva en una cacerola, agregue el cuscús y fría por 2-3 minutos. Agregue suficiente caldo a la sartén para cubrir el cuscús y agregue las hojuelas de chile, el mango y el cilantro. Sazonar, al gusto, con sal y pimienta negra recién molida y remover bien. Deja durante 2-3 minutos o hasta que los granos de cuscús hayan absorbido el líquido y sean livianos y esponjosos. Pelusa el cuscús con un tenedor.", "Para servir, espolvorear el cuscús en el centro de un plato para servir y colocar el pato en rodajas finas en forma de abanico alrededor del costado. Rocíe cualquier zumo de pan sobre el pato."], "url": "www_bbc_co_uk_food_recipes_honeyglazedduckserve_88148", "title": "Pato glaseado de miel servido con cuscús de cilantro y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja pequeña, finamente picada", "1 cucharadita de jengibre fresco finamente picado", "2 dientes de ajo, finamente picados", "½ chile rojo, picado", "½ cucharadita de jengibre molido", "½ cucharadita de chile molido", "½ cucharadita de clavo de olor molido", "½ cucharadita de maceta de tierra", "botón de mantequilla", "100g / 3½oz de lentejas Puy", "150ml / 5fl oz de vino tinto", "2 limas, cáscara y jugo", "1 cucharada de salsa de soja", "25g / 1oz de cilantro fresco, picado", "sal y pimienta negra recién molida", "cremoso puré, para servir", "2-3 cucharadas de miel que moquea", "4-6 pechos de pato", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para hacer las lentejas, coloca la cebolla, el ajo, el jengibre y el chile en una licuadora con las especias molidas y una gota de agua. Mezclar para untar, luego freír la pasta en un poco de mantequilla durante unos minutos, revolviendo todo el tiempo.", "Agregue las lentejas y el vino y cocine a fuego lento durante 20-25 minutos hasta que las lentejas estén cocidas.", "Mientras tanto, para el pato, coloque una sartén grande y seca al fuego. Agregue la miel y cocine a fuego lento hasta que esté dorado y burbujeante.", "Coloque las pechugas de pato en la sartén, con la piel hacia abajo. Sazonar con sal y pimienta negra recién molida y moverse en la sartén, utilizando pinzas, para cubrir los pechos de pato en la miel.", "Transfiera los pechugas de pato a una lata para asar, con la piel hacia arriba. Vierta la miel de la sartén por encima. Coloque en el horno durante 8 minutos o más, hasta que esté cocido a su gusto, luego retírelo y déjelo reposar antes de cortarlo.", "Retire las lentejas del fuego y agregue la ralladura de limón y el jugo, la soja y el cilantro picado. Sazonar con sal y pimienta negra recién molida.", "Sirva el pato en rodajas en una cama de puré cremoso con las lentejas una cuchara alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_honeyroastduckwithsp_81021", "title": "Pato asado de miel con lentejas de Puy con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ batata, pelada y cortada en cubos", "sal y pimienta negra recién molida", "30g / 1oz de mantequilla", "1 x 100 g / 3½ oz de pieza de filete de cerdo", "sal y pimienta negra recién molida", "2 cucharaditas de aceite de oliva", "1 diente de ajo, picado", "1 cucharada de salsa de soja", "1 cucharada de miel clara", "pizca de chile en polvo", "pequeño puñado de cebollín fresco, picado, para adornar"], "method": ["Para el puré de boniato, hierva la batata en una sartén con agua con sal durante 6-8 minutos hasta que esté tierna. Escurrir, volver a la sartén y sazonar con sal y pimienta negra recién molida. Agregue la mantequilla y el puré con un triturador de patatas o empuje a través de un ricer de patata hasta que quede suave. Cubra y reserve para mantener el calor.", "Para el cerdo, sazone el cerdo con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén y freír el cerdo durante 4-5 minutos. Agregue el ajo y cocine por un minuto más.", "Agregue la salsa de soya, la miel y el chile y cocine durante 3-4 minutos más, o hasta que el cerdo esté completamente cocido y la salsa se haya reducido un poco.", "Para servir, corte el cerdo en tres pedazos y colóquelo en un plato con el puré de camote. Verter sobre los jugos de pan y decorar con cebolletas."], "url": "www_bbc_co_uk_food_recipes_honeyroastedchillipo_85398", "title": "Cerdo de chile asado con miel y puré de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pato de 175g / 6oz, recién sacadas de la nevera", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "4 cucharadas de miel clara", "2 cucharaditas de polvo chino de cinco especias", "115g / 4oz de mantequilla sin sal", "1 chalote, finamente picado", "sal y pimienta negra recién molida", "150g / 5oz de setas", "1 cucharada de jugo de limón", "75ml / 3fl oz de agua", "1 cucharada de estragón, finamente picado", "1 cucharada de aceite de oliva", "200 g / 7 oz espinaca bebé"], "method": ["Primero marque la piel de cada pechuga de pato con un cuchillo muy afilado: puede sacar el cuchillo en el congelador por unos minutos para hacerlo más fácil. Calce la piel grasa de la pechuga de pato de forma cruzada, pero tenga cuidado de no cortar toda la carne.", "Sazonar el pato con sal y pimienta negra recién molida al gusto. Vierta el aceite en una sartén gruesa de base plana y caliente a una temperatura alta. Coloque los senos en la sartén, con la piel hacia abajo. Cocine a una temperatura bastante alta durante aproximadamente un minuto, hasta que la piel se seque, teniendo cuidado de no quemar la grasa.", "Una vez que la piel esté dorada y crujiente, voltee los senos con unas tenacillas y dore el otro lado durante aproximadamente un minuto. Regréselo una vez más a la sartén, con el lado de la piel hacia abajo, y cocínelo durante unos 5-8 minutos hasta que esté cocido completamente.", "Mientras tanto, mezcle la miel y el polvo chino de cinco especias en un tazón pequeño.", "Cuando el pato esté cocido, retíralo de la sartén, cepilla con la miel y las especias y déjalo reposar en un lugar cálido durante al menos 5-8 minutos.", "Para la salsa, caliente una sartén con tapa a fuego medio y agregue 25 g / 1 oz de la mantequilla, las chalotas y una pizca de sal.", "Cocine los chalotes sin la tapa hasta que estén blandos, pero no coloreados, aproximadamente 2-3 minutos.", "Agregue los champiñones silvestres y el jugo de limón y cubra con una tapa. Cocine por un minuto más.", "Agregue el agua, hierva y mezcle con la mantequilla restante.", "Sazone con sal y pimienta negra recién molida y luego agregue el estragón.", "Caliente el aceite en una sartén aparte y agregue las espinacas. Cocine hasta que la espinaca se haya marchitado.", "Para servir, divida la espinaca entre cuatro platos, corte los pechugas de pato por la mitad a lo largo y colóquelos sobre la espinaca, y espolvoréese la salsa de champiñones."], "url": "www_bbc_co_uk_food_recipes_honeyroastedduckwith_85538", "title": "Pato a la miel con estragón silvestre y salsa de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ cebolla roja, finamente rebanada", "1 diente de ajo, picado", "1 cucharadita de azúcar morena suave", "2 cucharaditas de vinagre balsámico", "1 higo, reducido a la mitad", "1 cucharada de miel clara", "2 rebanadas de baguette, tostadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite de oliva en una sartén, agregar la cebolla roja y freír a fuego lento durante cinco minutos hasta que se ablande.", "Agregue el ajo y el azúcar y cocine durante 1-2 minutos. Agregue el vinagre balsámico y cocine durante tres minutos.", "Coloque la figura a la mitad en una bandeja para hornear y rocíe con miel. Asar durante cinco minutos en el horno.", "Para servir, unte las cebollas caramelizadas en las rebanadas de baguette tostadas y cubra con los higos tostados con miel."], "url": "www_bbc_co_uk_food_recipes_honeyroastedfigandre_88010", "title": "Crostini de higo asado y cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vientre de cerdo 1.2kg / 2½lb", "1 cebolla, más o menos picada", "2 ramitas de tomillo fresco", "200ml / 7fl oz de vino blanco seco", "sal y pimienta negra recién molida", "4 cucharadas de miel clara", "4 x 85 g / 3 oz de filete de salmón, pelado", "1 cucharada de aceite de oliva", "½ col de col rizada, finamente picada", "2 cucharadas de perejil fresco de flatleaf"], "method": ["Precalentar el horno a 170C / 340F / Gas 3.", "Marca la grasa del vientre de cerdo en diagonal de manera cruzada.", "Vierta una tetera llena de agua hirviendo sobre el cerdo para apretar la piel, luego drene y seque con papel de cocina.", "Coloque la cebolla, el tomillo y el vino blanco en una bandeja honda profunda y sazone bien con sal y pimienta negra recién molida.", "Coloque el cerdo en la bandeja de asar y transfiéralo al horno para asar durante dos horas, rociándolo de vez en cuando.", "Retire la carne de cerdo y aumente el calor del horno a 220C / 425F / Gas 7.", "Saca la carne de cerdo de la bandeja y colócala en una tabla de cortar. Guarde la bandeja que contiene el licor de cocción. Corte la carne de cerdo en cuadrados de 10cm / 4 pulgadas y colóquela en una bandeja de asar limpia.", "Vierta la mitad de la miel sobre los cuadrados de la panceta de cerdo y luego coloque la bandeja en el horno y cocine durante 15 minutos, o hasta que la carne de cerdo esté dorada y crujiente, y la carne completamente cocida.", "Mientras tanto, cuele el licor de cocción en una sartén a fuego medio y agregue la miel restante. Llevar a ebullición, sazonar bien con sal y pimienta negra recién molida, y reducir el volumen de líquido en un tercio.", "Caliente una sartén a prueba de horno hasta que esté caliente. Sazonar el salmón con sal y pimienta negra recién molida y colocar en la sartén. Cocine durante 1-2 minutos en cada lado, hasta que se dore por todas partes, luego coloque la sartén en el horno junto con la carne de cerdo y cocine durante 5-6 minutos, o hasta que esté recién cocida.", "Caliente una sartén grande y limpia hasta que esté caliente y agregue el aceite de oliva, el repollo y el perejil. Revuelva-fríe durante 3-4 minutos, hasta que el repollo se haya suavizado, pero retiene un poco de mordida. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada de repollo en el centro de cada plato. Cubra con un pedazo de carne de cerdo y luego coloque un trozo de salmón encima del cerdo. Con una cuchara, cubra los jugos de cacerola reducidos alrededor del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_honeyroastedporkbell_86161", "title": "Vientre de cerdo asado con miel con salmón asado y repollo savoy salteado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero 2.2kg / 41b 13½oz", "2 cucharadas de aceite vegetal", "5 cucharadas de jugo de limón", "15g / ½ oz de jengibre fresco, pelado y más o menos picado", "6 dientes grandes de ajo, pelados y toscamente picados", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "¼tsp de chile rojo en polvo", "sal al gusto", "1 cucharada de sal masala", "½ pizca de pimienta negra recién molida", "2 cucharadas de agua", "100 g / 3½ oz de almendras blanqueadas", "100ml / 3½fl oz de yogur griego", "1½ cucharada de miel"], "method": ["Mezcle todos los ingredientes para el adobo en una licuadora o procesador de alimentos.", "Recorte el exceso de grasa y las membranas de la pierna de cordero. Haga cortes profundos y regulares en toda la carne con un cuchillo corto y afilado. Frote en el adobo, asegurándose de meterlo en los cortes profundos. Coloque el cordero en una bolsa de plástico para alimentos con el adobo y déjelo en el refrigerador, idealmente durante 24 horas o durante un mínimo de 6-8 horas.", "Para el frotamiento con miel, mezcle 70 g / 2½ oz de las almendras, el yogur y la mitad de la miel en una licuadora o procesador de alimentos. Saca el cordero de la nevera y quita la bolsa de plástico. Frote la mezcla de miel en el cordero e idealmente deje el cordero durante otras dos horas (o al menos 30 minutos), cubierto, en la nevera. Retire el cordero del refrigerador y déjelo a temperatura ambiente antes de cocinarlo.", "Precaliente el horno a 225 ° C / 425 ° F / Gas 7 y coloque el cordero sobre una rejilla con una bandeja de asar debajo. Cocine durante 15 minutos, luego baje el fuego a 180 ° C / 350 ° F / Gas 4 y cocine durante 1 hora y 40 minutos más, o hasta que los jugos de la carne se vuelvan bastante rosados ​​cuando se perforen, rociando cada 20-30 minutos.", "Esparcir sobre las almendras restantes y rociar sobre la miel restante y asar durante otros diez minutos. Verifique si la carne se cocina con un termómetro para carne. La temperatura debe ser 130-150C. Cuanto mayor sea la temperatura, más bien cocida estará la carne.", "Retire el cordero del horno. Cúbralo con papel de aluminio y déjelo reposar durante 15 minutos. Vierta los jugos, saque el exceso de grasa y sírvalo en un costado. Sirve el cordero con patatas asadas y un vegetal de tu elección."], "url": "www_bbc_co_uk_food_recipes_honeyroastedspicyleg_86764", "title": "Pierna de cordero picante asada con miel", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pastinaca grande", "35 g / 1¼ oz de mantequilla", "1 cucharada de miel clara", "1 cucharada de azúcar moreno"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Pele y base la chirivía y córtela en rodajas.", "Caliente la mantequilla en una sartén a prueba de horno y agregue las pastillas de chirivía. Freír hasta que comiencen a colorear. Rocíe la miel y espolvoree el azúcar.", "Revuelva para combinar y luego coloque la sartén en el horno. Asar durante 15-20 minutos, o hasta que las chirivías estén doradas y tiernas. Servir."], "url": "www_bbc_co_uk_food_recipes_honeyroastparsnips_88223", "title": "Chirivías asadas con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]