[{"ingredients": ["1 cucharada de semillas de comino", "1 cucharada de semillas de cilantro", "2 dientes enteros", "½ cucharadita de pimienta negra", "½ cucharadita de fenogreco molido", "1½ cucharadita de cúrcuma molida", "2 cucharaditas de pimentón", "½ cucharadita de chile en polvo", "¼ cucharadita de canela molida", "1 cucharadita de sal marina en copos", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz de 20g / ¾oz, finamente rallado", "4 cucharadas de yogur natural", "4 pechos de pato, sin piel", "Ensalada pequeña de cebolla roja en rodajas, cilantro fresco y rodajas de lima, para servir"], "method": ["Ponga las semillas de comino y cilantro, clavos de olor y pimienta negra en una sartén seca a fuego medio. Cocine durante 1-2 minutos, revolviendo regularmente hasta que estén ligeramente tostados, usted sabe que están listos cuando puede oler las especias.", "Incline las especias tostadas en un mortero o un molinillo de especias eléctrico. Agregue la alholva, la cúrcuma, el pimentón, el chile en polvo, la canela y la sal a las especias calientes y enteras, y mézclelas en un polvo fino.", "Incline en un recipiente para mezclar y agregue el ajo, el jengibre y el yogurt. Mezclar bien y dejar reposar mientras se prepara el pato. Corta cada una de las pechugas de pato en 7-8 pedazos del tamaño de un bocado. Revuelva en el yogur con especias, cubra con una película adhesiva y colóquelo en el refrigerador para marinar durante al menos cuatro horas, o idealmente durante la noche.", "Saque los trozos de pato del refrigerador y ensarte varios trozos en los pinchos largos de metal, manteniendo 1-2 cm / ½ pulgada entre cada pieza. Debería poder colocar aproximadamente cinco trozos de pato en cada pincho. (Tira cualquier adobo que no esté cubriendo el pato).", "Precaliente la parrilla a su temperatura más alta y coloque los pinchos en una rejilla sobre una rejilla cubierta con papel de aluminio. Deslice sobre un estante lo más cerca posible del fuego y cocine durante tres minutos. Dé vuelta a cada brocheta, sosteniéndola con un paño y cocine en el otro lado por otros 2-3 minutos, o hasta que el pato esté ligeramente carbonizado por fuera pero caliente y jugoso en el centro.", "Sostenga los pinchos calientes con un paño y use un tenedor para deslizar los trozos de tikka de pato de los pinchos y divídalos entre seis platos. Agregue una guarnición de ensaladas de aros de cebolla roja fresca y cilantro. Sirva con rodajas de limón para exprimir sobre el pato."], "url": "www_bbc_co_uk_food_recipes_duck_tikka_94383", "title": "Duck Dick", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, corte de grasa y piel anotada", "2 puñados grandes de espinaca", "½ naranja, pelada, segmentada y picada", "½ chalote, cortado en anillos", "1 cucharadita de aceite de sésamo", "½ naranja, solo jugo", "splash salsa de soja", "1 chile rojo, finamente cortado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque una sartén a fuego medio. Una vez caliente, coloque la pechuga de pato con la piel hacia abajo en la sartén. Cocine por cinco minutos, hasta que la piel esté dorada y crujiente.", "Drene un poco de la grasa liberada del pato y luego voltee la pechuga y cocine durante otros tres minutos, hasta que la carne se dore y luego transfiera al horno para asar durante diez minutos, o hasta que esté bien cocida.", "Mientras tanto, coloque los ingredientes de la ensalada en un tazón grande y mezcle bien.", "Para servir, cortar la pechuga de pato y colocar sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_duckandorangespinach_79909", "title": "Ensalada de pato, naranja y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón, solo jugo", "100g / 3½ oz de rábano, rallado", "50g / 2oz de pato ahumado, picado", "2 cucharadas de hojas de albahaca fresca, desgarrada", "½ pan de ciabatta", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "hojas frescas de perejil, para adornar", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "5 hojas de lechuga Little Gem", "100 g / 3½ oz de queso feta, desmenuzado", "1 cucharada de perifollo picado", "Pechuga de pato ahumada de 50 g / 2 oz, rallada", "4 rábanos", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer el crostini, calienta una sartén pequeña. Agregue el jugo de limón y el rábano rallado y saltee durante 2 minutos. Agregue el pato y la albahaca y cocine por unos minutos más.", "Caliente una sartén hasta que fume. Cortar la chapata por la mitad horizontalmente, rociar con el aceite y sazonar con sal y pimienta negra recién molida. Chargrill por 1 minuto en cada lado, luego coloque la mezcla de rábano tibia en las rodajas de ciabatta y adorne con perejil.", "Para la ensalada de queso feta, mezcle el aceite de oliva y el jugo de limón en un tazón grande. Mezcle la lechuga, el queso feta, el perifollo, el pato y los rábanos. Sazonar con sal y pimienta negra recién molida.", "Sirva el crostini en un plato con la ensalada."], "url": "www_bbc_co_uk_food_recipes_duckandradishcrostin_81164", "title": "Crostini de pato y rábano con ensalada de queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ litro de caldo de pollo caliente", "½ cebolla roja, finamente rebanada", "½ pechuga de pato, sin piel, finamente cortada", "40 g / 1½ oz de maíz dulce, picado", "sal y pimienta negra recién molida", "pequeñas hojas de cilantro fresco"], "method": ["Vierta el caldo de pollo caliente en una cacerola pequeña, agregue la cebolla y la pechuga de pato y cocine a fuego lento durante 3-4 minutos o hasta que la cebolla se haya suavizado y el pato se haya cocinado hasta el final.", "Agregue el maíz dulce y sazone, sazone, sal y pimienta negra recién molida. Cocine a fuego lento durante 2-3 minutos más.", "Vierta en un recipiente para servir, agregue las hojas de cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_duckandsweetcornbrot_88150", "title": "Caldo de pato y maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, exceso de grasa recortada y piel anotada", "Hojaldre de 150g / 5oz, extendido sobre una superficie enharinada al grosor de una moneda de una libra", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "25 g / 1 oz de setas, como los níscalos, cuidadosamente limpiados", "1 chalote, finamente cortado", "50ml / 2fl oz de vino tinto", "½ cubo de caldo de carne", "botón de mantequilla", "2 puñados de espinaca, marchita en una sartén"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque una sartén a fuego medio. Una vez caliente, coloque la pechuga de pato con la piel hacia abajo en la sartén. Cocine por cinco minutos, hasta que la piel esté dorada y crujiente.", "Drene un poco de la grasa liberada del pato y luego voltee la pechuga y cocine durante otros tres minutos, hasta que la carne se dore y luego transfiera al horno para asar durante diez minutos, o hasta que esté bien cocida.", "Con un cortador de pasteles de 10 cm / 4 pulgadas, corte una ronda de repostería. Cepille la masa con el huevo batido y colóquela en una bandeja para hornear. Coloque en el horno y hornee durante diez minutos, o hasta que estén dorados y elevados.", "Para la salsa, coloque el aceite en una sartén a fuego medio a alto. Agregue los champiñones y los chalotes y saltee durante tres minutos.", "Agregue el vino tinto, el caldo y la mantequilla y cocine a fuego lento hasta que la salsa se espese.", "Para servir, coloque el pato sobre una cama de espinacas marchitas, rocíe sobre la salsa y cubra con la masa de hojaldre."], "url": "www_bbc_co_uk_food_recipes_duckandpuffpastrywit_79908", "title": "Pato y hojaldre con champiñones silvestres y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pato, piel marcada con un cuchillo afilado", "sal y pimienta negra recién molida", "50ml / 2fl oz de vino tinto", "100ml / 3½ fl oz crema doble", "1 cucharadita de pimienta negra, aplastada", "100g / 3½oz de arroz basmati", "1 cucharada de mantequilla derretida", "1 cucharada de perejil fresco finamente picado", "75g / 2¾oz Tentedtem brócoli, blanqueado, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sazonar bien el pato con sal y pimienta negra recién molida y colocar el lado de la piel hacia abajo en una sartén pequeña a prueba de horno. Colocar a fuego medio y freír en ambos lados hasta que se dore.", "Transfiera al horno y tueste durante 8-10 minutos, o hasta que esté cocido a su gusto. Retire el pato de la sartén y transfiéralo a una tabla para descansar.", "Regrese la sartén al fuego y vierta el vino. Traiga a fuego lento, raspando los pedazos del fondo de la sartén con una cuchara de madera. Cocine a fuego lento hasta que se reduzca a la mitad, luego mezcle la crema y la pimienta negra. Cocine a fuego lento hasta que se necesite.", "Para la hierba de arroz, coloque el arroz basmati en una olla pequeña y cúbralo con agua fría. Llevar a ebullición y cocinar a fuego lento durante 8-10 minutos, o hasta que estén tiernos. Drene cualquier exceso de líquido.", "Cepille el interior de un plato hondo hondo con la mantequilla derretida. Coloque el perejil picado en el molde y colóquelo alrededor para cubrir los lados con mantequilla con el perejil.", "Incline el exceso de hierbas y mantequilla en el arroz escurrido y mezcle bien, luego empaquete el arroz en el molde.", "Para servir, cortar el pato en cuatro y disponer en un plato de servir. Pon la ramekin de arroz con hierbas en el plato. Sirva con brócoli y vierta la salsa sobre el pato."], "url": "www_bbc_co_uk_food_recipes_duckaupoivrewithherb_88561", "title": "Duck au poivre con arroz de hierbas y brócoli Tenderstem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pato sin hueso", "2 limones grandes o frutas relacionadas con el licor utilizado", "250ml / 8fl oz limoncello", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "sal", "pimienta negra recién molida", "4 zanahorias, peladas y picadas", "1 apio nabo, pelado y picado en trozos", "aceite de oliva al gusto", "sal", "pimienta negra recién molida"], "method": ["Seque las pechugas de pato y colóquelas en un plato poco profundo.", "Pele los limones con un pelador de patatas para obtener rizos de ralladura de limón y luego exprímalos.", "Esparce los rizos de limón sobre el pato, vierte sobre el jugo y el limoncello y déjalo marinar durante aproximadamente 30 minutos.", "Retire el pato del adobo, seque sobre papel de cocina y sazone bien con sal y pimienta. No deseche el adobo.", "Aclare la mantequilla en una sartén grande dejándola derretir, luego, cuando comience a formar espuma, levante con cuidado la espuma con una cucharada, dejando solo el líquido claro y dorado. Agregue el aceite de oliva.", "Cuando esté caliente, coloque las pechugas de pato en la sartén, con la piel hacia abajo, y selle bien en ambos lados.", "Reduzca el fuego y cocine durante unos 12 minutos, volteando el pato de vez en cuando. Esto le dará pato medio cocido, que creo que es ideal para este plato.", "Ahora suba el fuego, vierta el adobo y deje que se evapore, voltee el pato y agite la sartén de vez en cuando, esto ayudará a que la salsa se espese.", "Tan pronto como la salsa se espese, retire la sartén del fuego y coloque los pechugas de pato sobre una tabla de cortar. Deje reposar durante unos cinco minutos, luego córtelas en rodajas, coloque en cuatro platos o un plato para servir y vierta sobre la salsa.", "Para hacer la mezcla de zanahoria y apio nabo, hierva las verduras y cuele el líquido con un trozo de muselina.", "Regrese a la sartén, sazone con sal y pimienta y un chorrito de aceite de oliva, y haga puré con una batidora de mano.", "Sirve con el pato limoncello."], "url": "www_bbc_co_uk_food_recipes_duckbreastsinlimonce_71300", "title": "Pechugas de pato en limoncello con puré de zanahoria y apio nabo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "8 dientes de ajo, con la piel puesta, dejados enteros, aplastados", "1kg / 2lb 3¼oz de patatas Jersey Royal, o papas nuevas similares", "75 g / 2½ oz de mantequilla", "1 cucharada de mantequilla", "2 chalotes, finamente picados", "100 g / 3½ oz de champiñones silvestres, limpios y toscamente picados", "25ml / 1fl oz de coñac", "250ml / 8¾fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "2 cucharadas de granos de pimienta verde triturado", "2 cucharadas de pimienta negra molida", "4 pechos de pato, grasa marcada en un patrón entrecruzado con un cuchillo afilado", "1 cucharada de mantequilla", "2 cucharadas de aceite de oliva", "400g / 14¼ oz de setas silvestres", "1 manojo de acelga, tallos resistentes, hojas blanqueadas y refrescadas en agua fría", "250 g / 8¾oz de hojas de espinaca baby, blanqueadas y refrescadas en agua fría", "1 cucharada de mantequilla", "1 cucharada de aceite de oliva"], "method": ["Para las papas, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Vierta el aceite en una bandeja de asar pesada y caliente en el horno durante 8-10 minutos, o hasta que fume.", "Agregue los dientes de ajo y las papas nuevas al aceite caliente y vuelva al horno. Asar durante 18-20 minutos, o hasta que las papas estén tiernas. Ponga la mantequilla sobre las papas, luego continúe asando durante 4-5 minutos o hasta que las pieles estén doradas.", "Mientras tanto, para la salsa de crema de pimiento, caliente la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue los chalotes y fría por 3-4 minutos, o hasta que estén suaves pero no coloreados. Aumente el fuego y agregue los hongos silvestres. Continúe freír durante 2-3 minutos, o hasta que los champiñones se hayan suavizado y estén dorados.", "Agregue el coñac y continúe cocinando hasta que casi se haya evaporado.", "Agregue el caldo y caliente a fuego lento. Continúe cocinando a fuego lento durante 4-6 minutos, o hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema y cocine a fuego lento hasta que el volumen de líquido se haya reducido a la mitad nuevamente.", "Cuele la salsa de pimienta a través de un colador fino. Agregue los granos de pimienta triturados verdes y negros y revuelva para combinar. Mantener caliente", "Para el pato, aumente la temperatura del horno a 200C / 400F / Gas 6.", "Coloque la pechuga de pato, con la grasa hacia abajo, en una sartén fría a prueba de horno. Encienda el fuego al máximo (la grasa del pato se volverá lentamente, dando como resultado una piel crujiente y dorada).", "Cuando la sartén esté caliente y la grasa esté chisporroteando, freír la pechuga de pato durante 6-8 minutos o hasta que la grasa esté crujiente y dorada. Escurra el exceso de grasa, luego voltee el seno y continúe freír durante 6-8 minutos, o hasta que se dore.", "Transfiera la sartén al horno y tueste durante 6-8 minutos más (por el medio) o más si prefiere que la carne esté bien hecha.", "Cuando el pato esté cocido a su gusto, déjelo reposar durante 4-5 minutos en un plato tibio.", "Mientras tanto, para las setas silvestres, caliente la mantequilla y el aceite en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue los champiñones (haga esto en tandas si es necesario). Freír durante 4-5 minutos, o hasta que estén blandos y dorados, luego retírelos de la sartén con una espumadera y déjelos a un lado para escurrirlos sobre papel de cocina. Mantener caliente", "Mientras tanto, para la acelga y las espinacas, caliente la mantequilla y el aceite de oliva en una sartén. Cuando la mantequilla esté espumosa, agregue la acelga blanda y las espinacas y revuelva para cubrir con mantequilla y aceite. Caliente hasta que se marchite, luego retírelo del fuego y manténgalo caliente.", "Para servir, divida la mezcla de espinacas y acelgas marchita por igual entre cuatro platos para servir. Rocíe un poco de la salsa de pimienta. Coloque una pechuga de pato encima de cada porción. Espolvoree los champiñones fritos en el borde de los platos. Rocíe sobre la salsa de pimienta restante."], "url": "www_bbc_co_uk_food_recipes_duckbreastswithpeppe_91398", "title": "Pechugas de pato con salsa de crema de pimientos, champiñones, espinacas, acelgas y patatas en cocotte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechos de pato", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "pizca de tomillo fresco, finamente picado", "5 tomates cherry, picados por la mitad", "2 cucharadas de vinagre balsámico", "¼ vaso de vino tinto", "30g / 1oz de mantequilla", "55 g / 2 oz de grosellas rojas (o 3 cucharadas de grosella roja)"], "method": ["Cortar la grasa en la pechuga de pato y luego dorarla por ambos lados en una sartén muy caliente.", "Retire de la sartén y coloque en el horno a 180 ° C / 350 ° F / Gas 4 durante aproximadamente 10 minutos.", "Mientras tanto, escurra el exceso de grasa de la sartén. Poner los chalotes, el ajo, el tomillo y los tomates y cocinar por un minuto o dos.", "Desglasar la sartén con el vinagre balsámico y el vino tinto. Agregue la mantequilla y las grosellas rojas y reduzca la salsa por un par de minutos.", "Retire el pato del horno para descansar, luego corte la diagonal. Sirva con la salsa rociada sobre ella y un poco de pan francés crujiente."], "url": "www_bbc_co_uk_food_recipes_duckbreastwithredcur_67442", "title": "Pechuga de pato con salsa de grosellas rojas y vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de miel clara", "1 cucharada de pasta umeboshi / pasta de ciruela (disponible en supermercados japoneses especializados)", "½ cucharadita de jengibre fresco, finamente picado", "¼ cucharadita de pimienta sansho (disponible en supermercados japoneses especializados)", "¼ cucharadita de polvo de curry suave", "¼ cucharadita de polvo de cinco especias", "¼ cucharadita de jengibre molido", "4 pechos de pato de 175g / 6oz", "Rábano daikon de 110g / 4oz, finamente cortado en juliana", "1 mango, pelado, sin hueso, finamente cortado", "Raíz de loto de 50g / 2oz, finamente rebanada y frita hasta que esté crujiente (disponible en comestibles asiáticos)", "75g / 3oz de berro", "1 hojas de shiso de cilantro (también llamadas hojas de perilla)", "1 chalote, finamente cortado", "½ limón, solo jugo"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Coloque la miel en un tazón junto con la pasta de umeboshi y el jengibre fresco y mezcle bien.", "Agregue la pimienta sansho, el polvo de curry, el polvo de cinco especias y el jengibre molido y mezcle bien.", "Caliente una sartén a prueba de horno hasta que esté tibia y agregue la pechuga de pato, con la piel hacia abajo, y cocine suavemente durante 3-4 minutos para eliminar la grasa.", "Voltee el pato y hilvane con la mezcla de miel y especias, luego transfiéralo al horno para asar durante 5-6 minutos, o hasta que esté cocido a su gusto.", "Retire el pato del horno, hilvane con la mezcla de miel y especias y deje reposar.", "Para servir, lanza un puñado de daikon en una bola. Repita para crear 28 bolas de daikon y coloque siete alrededor del borde de cada una de las cuatro placas.", "Coloque dos rebanadas finas de mango encima de cada bola de daikon.", "Corte el pato en rodajas muy finas y coloque dos pedazos encima de cada pila de daikon y mango.", "Coloque un pedazo de raíz de loto frita al costado de cada montón.", "Coloque cualquier daikon restante, el berro, hojas de shiso, chalote y jugo de limón en un tazón y mezcle bien. Coloque un puñado de esta ensalada en el centro de cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_duckbreastwithhoneya_86320", "title": "Pechuga de pato con miel y pimienta sansho, mango, shiso y daikon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pato", "1 cucharada de sal por kilo de patas de pato", "2-3 ramitas de tomillo fresco, hojas peladas", "300g / 11oz de grasa de pato", "4 cucharadas de miel clara", "6 cucharadas de aceite de oliva virgen extra", "600g / 1lb 5oz papas King Edward, peladas y cortadas en trozos", "1 x 400 g / 14 oz puede mantequilla frijoles, enjuagados y drenados", "2 cucharadas de aceite de oliva virgen extra", "75ml / 3fl de leche en oz", "sal", "pimienta blanca recién molida", "1 cucharada de aceite de oliva", "1 cebolla picada", "2 dientes de ajo picados", "2 ramitas de tomillo fresco", "2 x 400 g / 14 onzas de latas de tomates picados", "110ml / 4fl oz de vino blanco", "1 x 400g / 14oz de judías en conserva, enjuagadas y escurridas", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco de flatleaf, aproximadamente picado", "25g / 1oz de mantequilla", "½ cebolla roja, espesamente rebanada", "250ml / 9fl oz de vino tinto", "750ml / 1pt 6fl oz de caldo de carne fresca", "sal y pimienta negra recién molida"], "method": ["Para el confit de pato, pese las patas de pato y espolvorea con una cucharada de sal por kilo de pato. Coloque en una bandeja y espolvoree con el tomillo. Envuelva con una película adhesiva y colóquelo en la nevera durante la noche.", "Caliente una sartén pesada y agregue las patas de pato. Agregue la grasa de pato para cubrir completamente las piernas. Llevar la grasa a fuego lento y cocinar lentamente durante aproximadamente dos horas y media, o hasta que la carne de pato esté muy tierna.", "Mientras tanto, precalentar el horno a 180 ° C / 355 ° F / Gas 4.", "Usando un par de tenazas, retire las patas de pato de la grasa y colóquelas en una bandeja para asar, drenando el exceso de grasa.", "Batir la miel y el aceite juntos en un bol, luego untar generosamente sobre las patas de pato.", "Transfiera las patas de pato al horno para asar durante 18-25 minutos, agregando más glaseado de miel sobre las patas 2-3 veces durante la cocción. Retire del horno y deje reposar.", "Para el puré de frijoles de mantequilla, coloque las papas y los frijoles en una cacerola de agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Escurra las papas y los frijoles y colóquelos en un tazón grande. Agregue el aceite de oliva y la leche y mezcle hasta obtener un puré. Sazonar, al gusto, con sal y pimienta blanca recién molida.", "Para la compota de frijoles de mantequilla y tomate, caliente una sartén de lados profundos hasta que esté caliente, luego agregue el aceite de oliva, las cebollas y el ajo y sofríalos por tres minutos.", "Agregue el tomillo, los tomates y el vino blanco y deje que hierva, luego reduzca el fuego a fuego lento durante 15-20 minutos, hasta que la salsa se espese.", "Agregue los frijoles y cocine a fuego lento por otros 15 minutos, luego sazone, al gusto, con sal y pimienta negra recién molida y agregue el perejil picado.", "Para la salsa de vino tinto, derrita la mitad de la mantequilla en una sartén y agrega las cebollas. Freír las cebollas hasta que estén doradas, luego agregar el caldo y el vino tinto. Llevar a ebullición, luego reduzca el fuego para cocinar a fuego lento la salsa hasta que se haya reducido a la mitad y ligeramente espesa. Pasar a través de un tamiz en una sartén limpia.", "Agregue la mantequilla restante y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada del puré de frijoles de mantequilla en el centro de las cuatro placas. Cubra con el confit de pato y coloque una cucharada de la compota en el lateral. Vierta la salsa de vino tinto y sirva."], "url": "www_bbc_co_uk_food_recipes_duckconfitwithbutter_85813", "title": "Confitado de pato con puré de frijoles, compota de tomate y compota de judías y salsa de vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patas de pato", "5 cucharadas de aceite de oliva", "50g / 1¾oz llano \"OO\" o harina fuerte", "1 bolsita pequeña de polvo de azafrán o algunas hebras de azafrán", "1 puñado de uvas blancas, sin semillas", "1 disparo de Grappa", "2 patatas dulces grandes", "½ vaso de leche entera", "75g / 2½oz de queso taleggio", "sal", "pimienta negra recién molida"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Tome una bandeja de respaldo pesado, agregue aceite de oliva y colóquelo directamente sobre la placa para que se caliente.", "Mientras tanto, ponga la harina en un recipiente, agregue el azafrán y sazone.", "Toma las patas de pato y cúbrelas con la harina.", "Coloque el pato en la bandeja y dore hasta dorar.", "Cubra en papel de aluminio y coloque la bandeja en el horno para asar durante aproximadamente 20-30 minutos, será media / bien hecho.", "Después de 15 minutos, retire la lámina y continúe tostando", "Retire la bandeja del horno y colóquela sobre la placa. Agregue las uvas y luego la grappa. Déjalo cocer a fuego lento durante 30 segundos. Coloque a un lado para descansar.", "Prepare el puré dulce hirviendo las papas hasta que estén al denté. Vigílalos para que no se cocinen demasiado ni se rompan. Mash en una sartén.", "Coloque la sartén a fuego lento, sazone y luego agregue la leche. Rompa el queso. Revuelva constantemente permitiendo que el queso se derrita y cree una textura suave y cremosa.", "Para servir, coloca una cucharada grande de puré en el centro del plato y luego coloca una pierna de pato encima. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_duckingrappasauceser_72221", "title": "Pato en salsa de grappa servido con puré de papa dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cabeza de col roja, finamente rebanada", "15 g / 1 oz de sal marina gruesa", "100ml / 3½fl oz de aceite de sésamo", "50g / 2oz de azúcar glasé", "50ml / 2fl oz de jerez seco", "50ml / 2fl oz de vinagre de vino blanco", "10g / ½ oz de raíz de jengibre fresco, finamente rallado", "1 chile rojo, finamente picado", "25 g / 1 oz de grasa de pato", "2 pechugas de patito, recortadas y piel anotada", "2 patas de pato confitadas, carne desmenuzada", "40g / 2oz de grasa de pato", "18 granos de pimienta verde, aplastados", "pizca de sal", "4 envoltorios grandes de rollitos de primavera (disponibles en tiendas de comestibles asiáticas)", "Harina normal de 50g / 2oz", "50 ml / 2 fl oz de agua", "aceite vegetal, para freír", "4 nabos bebé", "100 ml / 3½ fl oz de agua", "40g / 2oz de mantequilla", "azúcar pizca", "25g / 1oz de mantequilla", "1 chalote, pelado, finamente cortado", "100 g / 3½ oz champiñones, en rodajas", "200 ml / 7fl oz de hidromiel", "400ml / 14fl oz de caldo de pollo", "25g / 1oz de mantequilla", "200 ml / 7fl oz de hidromiel"], "method": ["Para el repollo rojo picante, coloque la col roja en un tazón grande y espolvoree con sal marina. Mezcle bien para cubrir con la sal, luego reserve por 4 horas. Enjuague con agua fría para lavar la sal, luego deje de lado hasta que sea necesario.", "Precalentar el horno a 220C / 425F / gas 7.", "Para el pecho del patito, caliente una sartén a prueba de horno hasta que esté caliente y agregue la grasa del pato. Cuando la grasa se haya derretido, agregue los pechugas de los patitos con la piel hacia abajo y fríe durante 4-5 minutos, o hasta que la piel esté crujiente y dorada. Escurra la grasa, voltee la pechuga de los patitos y tueste en el horno durante 7-8 minutos, o hasta que se dore por todas partes, pero aún ligeramente rosado en el medio. Reservar para descansar", "Para las pajas de pato, mezcle la carne de pato confitada, la grasa de pato, los granos de pimienta verde y la sal en un tazón.", "Coloque las envolturas de rollos de primavera en una tabla de cortar y corte cada una a la mitad a lo largo. Mezcle la harina en un recipiente con el agua para hacer una pasta espesa. Cepille el lado largo de un extremo de la hoja con la pasta de harina.", "Coloque la mezcla de pato a lo largo de la envoltura y enrolle, engarzando los extremos para sellar. Repita con las envolturas restantes del rodillo de resorte y la mezcla de pato.", "Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente hasta que un cubo de pan caiga en chispas y se vuelva marrón dorado en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las pajas de pato durante 1-2 minutos o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Dejar de lado.", "Para la col roja picante, caliente el aceite de sésamo en una sartén grande y agregue el repollo rallado drenado. Freír durante 2 minutos, o hasta que se suavice un poco pero no se coloree.", "Empuje la col a un lado de la sartén y agregue el azúcar glas al otro lado. Una vez que el azúcar se haya derretido y comience a caramelizar, agregue el jerez, el vinagre de vino blanco, el jengibre y el chile y mezcle con el repollo. Freír por 2-3 minutos o hasta que el repollo esté tierno. Dejar de lado.", "Para los nabos de bebé, coloque todos los ingredientes de nabo bebé en una sartén y deje que hierva. Cocine por 5-6 minutos, o hasta que los nabos estén tiernos pero ligeramente crujientes. Escurrir y apartar.", "Para la salsa de pato, derrita la mantequilla en una sartén hasta que esté espumosa, luego agregue los chalotes y los champiñones y fría por 2-3 minutos, o hasta que se ablanden. Agregue el hidromiel y cocine hasta que el volumen del líquido se haya reducido en dos tercios, luego agregue el caldo de pollo y cocínelo hasta que el volumen del líquido se haya reducido a la mitad.", "Cuele la salsa a través de un colador fino, coloque de nuevo en la sartén y bata la mantequilla a fuego medio. Mantener caliente", "Para el jarabe de aguamiel, coloque el hidromiel en una olla pequeña y cocine a fuego lento a fuego medio hasta que el líquido se haya reducido a aproximadamente 50 ml / 2 fl oz y es espeso y almibarado.", "Para servir, divida la col roja picante entre 4 platos para servir. Tallar los pechos de los patitos por la mitad a lo largo y colocar una pieza encima de cada porción de repollo. Pon dos pajitas de pato contra el pato y el repollo, coloca los nabos de bebé al lado y rocía la salsa de pato sobre el pato y alrededor del plato. Termine rociando el jarabe de aguamiel sobre el pato."], "url": "www_bbc_co_uk_food_recipes_ducklingbreastduckst_93932", "title": "Pechuga de pato, pajas de pato con repollo rojo picante, nabos y jarabe de hidromiel", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hígados de pato de 500 g / 1 lb 2 oz, cortados con grasa y tendones", "3 cucharadas de coñac", "1 diente de ajo, picado", "puñado de hojas de albahaca fresca", "175g / 6oz de mantequilla sin sal ablandada", "sal y pimienta negra recién molida", "tostada delgada", "hojas de ensalada"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Coloque los hígados enteros en una bandeja para hornear y vierta sobre el coñac. Mezcle bien para que ambos lados del hígado absorban el coñac. Espolvorear sobre el ajo y la albahaca, conservando unas pocas hojas y sazonar al gusto con sal y pimienta negra.", "Coloque en el horno durante 6-8 minutos o hasta que esté cocido. Los hígados deben verse ligeramente rosados ​​por dentro. Retire del horno y coloque en una licuadora junto con 110 g / 4 oz de la mantequilla y mezcle hasta que quede suave.", "Controle el condimento y luego espolvoréelo en los moldes.", "Coloque la mantequilla restante en una olla y caliente hasta que se derrita. Vierta la mantequilla transparente sobre la superficie del paté, dejando los sólidos de leche en la olla. Coloque las hojas de albahaca restantes en la superficie del paté y colóquelas en el refrigerador para prepararlas.", "Sirva paté con pan tostado y ensalada de hojas."], "url": "www_bbc_co_uk_food_recipes_duckliverandbasilpat_84101", "title": "Paté de hígado de pato y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pato, aproximadamente 175 g / 6 oz cada una, sin piel", "½ cucharadita de cinco especias chinas", "pimienta negra recién molida", "2 cucharadas de aceite de sésamo", "100 ml / 3½ fl oz salsa hoisin", "8-10 tortitas de estilo chino preparadas (o mini tortillas de harina), calentadas", "1 manojo de cebollas de primavera, cortado en fósforos", "½ pepino, reducido a la mitad, sin semillas y cortado en cerillas"], "method": ["Corta el pato en tiras finas y agrega las cinco especias y la pimienta. Caliente el aceite de sésamo en una sartén o wok y agregue el pato. Revuelva-fríe durante 3-4 minutos hasta que esté cocido, luego agregue la salsa hoisin. Continúe cocinando durante aproximadamente 1 minuto, hasta que el pato esté cubierto densamente con la salsa.", "Transfiera el pato a un plato calentado, coloque las cebolletas y el pepino en un bol, desenvuelva los panqueques calientes y permita que todos caven y se ayuden a sí mismos. Los panqueques se deben cubrir con un poco de pato, cebolletas y pepino, luego se enrollan para que se asemejen al clásico chino."], "url": "www_bbc_co_uk_food_recipes_duckpancakeswithhois_67779", "title": "Panqueques de pato con salsa hoisin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duckpancakeswithhois_67779_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "Hígados de pato de 450 g / 1 lb, recortados y limpiados", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "2 cucharaditas de jugo de naranja", "1 cucharada de ralladura de naranja", "½ cucharadita de pimienta negra recién molida", "2 cucharadas de licor de naranja", "55 g / 2 oz de mantequilla clarificada, derretida"], "method": ["Caliente 15 g / ½ oz de la mantequilla en una sartén hasta que forme espuma.", "Agregue la mitad de los hígados y fríe rápidamente por todos lados hasta que estén dorados, pero aún rosado en el medio, alrededor de 4-5 minutos.", "Repita con un segundo lote de mantequilla e hígados.", "Coloque el hígado y los jugos en un procesador de alimentos.", "En la misma sartén caliente otra mantequilla de 15 g / ½ onza, agregue el chalote, el ajo y el jugo de naranja y la ralladura y cocine a fuego moderado hasta que la chalota esté suave pero no coloreada.", "Agregue el licor de naranja y la pimienta negra recién molida, y raspe el fondo de la sartén para liberar los jugos coagulados.", "Coloque todo en el procesador de alimentos, incluida la mantequilla restante sin sal. Mezclar hasta que esté suave.", "Si quieres un paté muy suave, pasa la mezcla a través de un colador fino y colócalo en un tazón. Cubra con la película adhesiva, fría y luego refrigere. Si no lo usa dentro de las 48 horas, cubra la parte superior con mantequilla clarificada."], "url": "www_bbc_co_uk_food_recipes_duckliverandorangepa_71658", "title": "Paté de hígado de pato y naranja", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pato confitado", "150g-175g / 5oz-6oz de grasa de pato", "5 cucharadas de perejil de flatleaf tostado"], "method": ["Retire toda la carne de las patas de pato, descartando la piel, los huesos y los tendones.", "Coloque la carne de pato en un tazón y mezcle con un tenedor.", "Poco a poco agrega la grasa de pato mientras continúas macerando.", "Agregue el perejil picado y sazone con sal y pimienta negra recién molida.", "Coloca la mezcla en cuatro moldes pequeños y colócalos en la nevera para prepararlos.", "Retire de la nevera diez minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_duckrillettes_83817", "title": "Rillettes de pato", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 zanahorias, cortadas en tiras finas", "1 manojo de cebollas de primavera, cortado en tiras finas", "½ pepino, sin semillas, cortadas en tiras finas", "1 lechuga crujiente, como cos o iceberg, en rodajas", "2 pechugas de pato precocinadas, trituradas en pequeñas rebanadas", "salsa hoisin, de un tarro, al gusto", "puñado de semillas de sésamo"], "method": ["Combine todas las verduras preparadas en una ensaladera.", "En un tazón separado, mezcle los trozos de pato cocido en la salsa hoisin.", "Coloque el pato hoisin encima de la ensalada y espolvoree con semillas de sésamo. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_ducksalad_85724", "title": "Ensalada de pato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Mangetout de 100 g / 3½ oz, cortado por la mitad a lo largo", "100 g / 3½ oz de maíz dulce para bebés, cortado por la mitad a lo largo", "55g / 2oz anacardos", "Pechuga de pato de 150g / 5oz cortada en rodajas finas", "1 cucharada de miel", "2 cucharaditas de salsa de soja", "½ cucharadita de pimienta negra recién molida", "2 cucharadas de semillas de sésamo"], "method": ["Calienta el aceite en un wok hasta que fumes. Agregue el mangetout, el maíz dulce y los anacardos y fríe durante 3-4 minutos, o hasta que los vegetales estén tiernos pero retengan un poco de mordida.", "Agregue las rebanadas de pechuga de pato al wok y saltee durante 1-2 minutos, luego agregue el resto de los ingredientes. Cocine hasta que la salsa esté reducida y pegajosa, y el pato se cuece a su gusto.", "Coloque la salteada en un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_duckstirfrywithbabyc_89252", "title": "Pato salteado con maíz, anacardos y mangetout", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pepino grande", "1 cucharadita de mostaza Dijon", "½ cucharadita de sal", "1 cucharada de azúcar", "2 cucharadas de vinagre de vino de arroz", "4 pechugas de pato, deshuesadas y sin piel", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "100 ml / 4 fl oz salsa de soja", "100ml / 4fl oz sake", "3 cucharadas de azúcar", "aceite vegetal, para freír", "1 yema de huevo de gallinas camperas", "250ml / 8fl oz de agua helada", "125g / 4½ oz de harina natural, más extra para espolvorear", "8 ramitas de hojas de apio pálido", "sal"], "method": ["Para el pepino encurtido, pele y siembre el pepino y corte en pedazos de 1cm / ½. En un recipiente, mezcle la mostaza, la sal, el azúcar y el vinagre. Marinar las rodajas de pepino en la mezcla durante al menos 15 minutos y hasta una hora.", "Para el pato, revise las pechugas de pato y elimine cualquier grasa y tendón. Sazonar con sal y pimienta negra recién molida.", "Caliente una sartén grande y pesada a fuego alto y saltee los pechugas de pato en aceite vegetal a fuego medio a alto hasta que estén dorados, pero aún rosado en el medio. Esto tomará aproximadamente cuatro minutos en cada lado.", "Retire las mamas de pato. Agregue todos los ingredientes del glaseado teriyaki a la sartén y hierva la mezcla hasta que se vuelva espesa y almibarada. Agregue el pato al glaseado, y gire con frecuencia durante aproximadamente un minuto. Cuando esté bien glaseado en ambos lados, coloque los pechitos sobre una tabla de cortar y corte en 4-5 pedazos cada uno.", "Mientras tanto, para la tempura de apio, caliente el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un tazón pequeño, bata la yema de huevo con el agua hasta que se mezcle. Agregue la harina y revuelva solo cinco veces con un tenedor y nada más. La mezcla será muy grumosa, y esto es parte del secreto de la buena tempura.", "Sumerja las hojas de apio en la harina para espolvorear, y luego en la masa de tempura. Freír en el aceite caliente durante unos tres minutos hasta que estén doradas, volteando las hojas en el aceite para asegurar una cocción pareja. Retirar con una cuchara ranurada y sazonar ligeramente con sal.", "Sirva el pato con el pepinillo en vinagre y decore con la tempura de hojas de apio."], "url": "www_bbc_co_uk_food_recipes_duckteriyakiwithpick_83001", "title": "Teriyaki de pato con pepino encurtido servido con tempura de hojas de apio", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]