[{"isVegetarian": false, "title": "Ever-so-easy cottage pie", "url": "www_bbc_co_uk_food_recipes_ever-so-easy_cottage_pie_77158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ever-so-easy_cottage_pie_77158_16x9.jpg", "ingredients": ["400g/14oz lean minced beef (10% fat or less)", "1 onion, chopped", "2 celery sticks, trimmed and thinly sliced", "2 carrots, peeled and diced", "400g tin chopped tomatoes", "2 tbsp tomato purée", "1 beef stock cube", "1 tbsp Worcestershire sauce", "1 tsp dried mixed herbs", "100g/3½oz frozen peas", "sea salt and freshly ground black pepper", "700g/1lb 9oz floury potatoes, such as King Edwards or Maris Piper, peeled and cut into 4-cm/1½-in chunks", "2 leeks, trimmed and cut into 1-cm/½-in slices", "25g/1oz mature Cheddar, grated"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large, non-stick saucepan or flameproof casserole over a medium heat. Add the beef, onion, celery and carrots to the pan and cook for 5 minutes. Use a couple of wooden spoons to break up the meat as it cooks. ", "Stir in the tomatoes, tomato purée, stock cube, Worcestershire sauce and mixed herbs. Refill the tomato tin with water and pour into the pan. Season with a good pinch of salt and plenty of pepper. Bring to a simmer, then reduce the heat, cover loosely and simmer gently for about 25 minutes, stirring regularly. ", "Meanwhile, to make the topping, put the potatoes into a large saucepan and cover with cold water. Bring to the boil, then reduce the heat slightly and simmer for 10 minutes. Add the leeks, return to a simmer and cook for 2 minutes more, or until the potatoes are tender but not falling apart.", "Preheat the oven to 220C/200C Fan/Gas 7. Drain the potatoes and leeks and return to the pan. Roughly crush the potatoes with a fork. Season with a little salt and lots of pepper.", "Stir the peas into the beef mixture then spoon into a 2 litre/3½ pint shallow ovenproof dish. Using a large spoon, top the beef mixture with the crushed potatoes. There is no need to do it too neatly. Scatter the cheese over the top.", "Bake for 25–30 minutes, or until the topping is golden brown and the filling is bubbling. Serve."]}, {"isVegetarian": false, "title": "Everyday roast chicken", "url": "www_bbc_co_uk_food_recipes_everyday_roast_chicken_91003", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/everyday_roast_chicken_91003_16x9.jpg", "ingredients": ["a small, free-range roasting chicken", "75ml/3fl oz olive oil", "4 cloves of garlic, squashed", "a large lemon", "6 sprigs thyme", "salt and freshly ground black pepper"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 8.", "Place the chicken onto a chopping board and cut in half down the backbone using a large and very sharp cooks’ knife. Flatten the chicken as much as you can buy pressing down with the palm of your hand.", "Pour the olive oil into a mixing bowl large enough to take the chicken, add the squashed garlic cloves, the juice from the lemon and then the squeezed lemon shells. Put in the sprigs of thyme, a good seasoning of salt and black pepper, then turn the chicken over in the oil. (If you have the time, you can leave the chicken like this for an hour or so in the fridge.) ", "Place the chicken in a roasting tin, skin-side up. Roast for about 30 minutes or until the skin is golden and the bird cooked right through. "]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_eves_pudding_91583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb cooking apples, peeled, cored and sliced", "15g/1/2oz butter", "85g/3oz sugar", "½ lemon, juice and zest", "115g/4oz flour", "pinch salt", "½ tsp baking powder", "55g/2oz butter, softened", "55g/2oz sugar", "1 free-range egg", "1 tbsp milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the filling, place the apples, butter, sugar and lemon juice and zest in a saucepan with a little water and cook gently until the apples have softened. ", "Put the apple mixture in the bottom of a pie dish, packing the apples down to provide a firm base for the topping (this helps it rise evenly during baking).", "For the topping, sieve the flour together with a pinch of salt and the baking powder.  In a separate bowl, cream together the butter and sugar, beat in the egg and then lightly fold in the flour. Add a little milk if the mixture is too stiff.  ", "Pour the mixture on top of the apples and bake in the oven for 45-55 minutes or until the top is golden-brown and cooked through. "]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_eves_pudding_99739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40 large Bramley apples, peeled, cored and sliced ", "1kg/2lb 4oz unsalted butter, softened", "550g/1lb 4oz brown sugar ", "150ml/5fl oz golden syrup ", "1 tbsp ground cinnamon ", "700g/1lb 10oz raisins ", "20 eggs", "1kg/2lb 4oz self-raising flour"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease a very large ovenproof serving dish with 125g/4oz of the butter then scatter in the apple slices. Sprinkle over 150g/5½oz of the brown sugar, the golden syrup, cinnamon and finally the raisins.", "In a mixing bowl, beat together the remaining butter and sugar in a large mixer (or with a wooden spoon) until pale and fluffy. Beat in the eggs, one at a time, then use a large metal spoon to gently fold in the flour.", "Spoon the batter over the apples and gently even out with the back of the spoon.", "Bake for 45-50 minutes, or until golden-brown and cooked through. Serve with custard."]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_evespudding_83911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large cooking apples (about 500g/1lb2oz in total)", "1 tbsp lemon juice", "2 tbsp water", "20g/¾oz butter ", "2 tbsp caster sugar", "75g/3oz butter", "100g/3½oz caster sugar ", "100g/3½oz self-raising flour", "2 free-range eggs, lightly beaten", "1 tbsp boiling water", "cream or custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350/Gas 4.", "Peel, core and roughly chop the apples.", "Add the apples to a saucepan with the lemon juice and water.", "Stir, cover and cook briskly for five minutes until the apples are soft.", "Add the butter and caster sugar and stir. ", "Transfer to a 900ml/1½ pint capacity ceramic gratin dish, about 5cm/2in deep. ", "Leave to cool while you prepare the topping. ", "For the topping, cream together the butter and caster sugar until fluffy and light.  ", "Fold the flour and egg in alternate spoonfuls into the sugar mixture until blended, being careful to keep folding rather than stirring energetically - this will keep air in the mixture and fold in.", "Add a spoonful of boiling water to the mix.", "Spoon the mixture over the apples. Cook in the oven for 30-35 minutes or until the topping is puffy and golden. Serve with cream or custard."]}, {"isVegetarian": false, "title": "Ewes' milk cheese and hot-smoked trout on toast", "url": "www_bbc_co_uk_food_recipes_ewesmilkcheeseandhot_86832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large slices bread", "olive oil", "100g/3½oz ewes' milk cheese, sliced", "salt and freshly ground black pepper, to taste", "1 hot-smoked trout fillet, flesh flaked with a fork", "parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium-hot.", "Heat a griddle pan. Drizzle the bread with olive oil and griddle for two minutes on each side. ", "Slide the griddled bread onto a baking sheet, top with sliced cheese, season with salt and freshly ground black pepper and place under the grill for 2-3 minutes. ", "Slide onto a plate, top with the flaked hot-smoked trout flakes and garnish with parsley. Serve."]}, {"isVegetarian": false, "title": "Exceptional gammon with cider and cinnamon", "url": "www_bbc_co_uk_food_recipes_exceptional_gammon_with_50001", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/exceptional_gammon_with_50001_16x9.jpg", "ingredients": ["1.2kg/2lb 10oz boneless gammon joint (we used unsmoked but smoked would work too)", "500ml/17fl oz cider", "1 litre/1¾ pints cloudy apple juice", "2 sharp green apples, cored and cut into rough chunks", "2 x 8cm/3¼in pieces cinnamon stick", "3-4 fresh red chillies, seeds removed, cut into quarters", "1 tbsp coarsely crushed coriander seeds", "1 tbsp demerara sugar, or to taste", "¼ tsp chilli powder", "1 heaped tbsp cornflour", "sautéed red cabbage with cumin seeds and lemon juice", "green chilli mashed potatoes"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the gammon in plenty of cold water in the fridge for at least two hours, or overnight. Drain well. ", "Place the gammon along with all the other gammon ingredients in a casserole dish. The liquid should cover the meat; if not, add a little water to just cover. Bring to the boil, then reduce the heat to low and simmer gently, partly covered with a lid, for 1¼ hours. Turn the gammon carefully in the liquid every 20 minutes or so.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the gammon from its cooking stock, transfer to a small roasting tin. Reserve the cooking liquid for making the sauce. ", "Cut the rind from the gammon, leaving a thin layer of fat, and discard the rind. With a small sharp knife, score the fat into diamonds.", "For the glaze, put a ladleful of cooking liquid into a large clean pan. Add the sugar and chilli powder and cook until a glaze-like consistency. Pour this over the gammon and roast for 15 minutes, until browned and caramelised. Set aside in a warm place while you make the sauce", "For the sauce, boil the cooking liquid in a pan, uncovered, over a high heat until it has reduced to about 500ml/17fl oz; this could take about 10 minutes of boiling.", "Strain the liquid through a sieve into a clean pan, rubbing any pieces of apple through the sieve too so that the flesh is in the sauce; leave behind only the skins. Taste the sauce and adjust seasoning to taste. If you want it sweeter, add a pinch of demerara sugar; you almost certainly won’t need any salt.", "Reheat the remaining strained sauce gently until it reaches a simmer. Blend the cornflour in a little cold water to a smooth paste, and stir into the sauce, stirring continuously. A creamy consistency is better than a very thick sauce, but if you prefer yours thicker, add a little more blended cornflour. To serve, place gammon slices on individual plates and pour over the sauce. Serve with spiced red cabbage and green chilli mash. "]}, {"isVegetarian": true, "title": "Exotic fruit salad", "url": "www_bbc_co_uk_food_recipes_exoticfruitsalad_72345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Charentais melon", "1 paw-paw", "1 Asian pear, peeled and sliced", "8 lychees, peeled and stoned", "150ml/5¼fl oz fresh fruit juice, orange or any you like"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Use a melon baller to scoop balls from the melon and the paw-paw. Place these in a bowl, add the remaining fruit and the juice.", "Cover and chill until needed, making sure you take it out of the fridge 30 minutes before serving."]}, {"isVegetarian": false, "title": "Express bacon and pesto pasta", "url": "www_bbc_co_uk_food_recipes_express_bacon_and_pesto_15099", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_bacon_and_pesto_15099_16x9.jpg", "ingredients": ["150g/5½oz broccoli head, thick stem removed", "1 onion, roughly chopped", "350g/12oz penne", "300g/10½oz smoked back bacon, cut into small pieces", "150g/5½oz basil pesto", "150g/5½oz cherry tomatoes, halved", "25g/1oz pine nuts, to serve", "salt and freshly ground black pepper", "25g/1oz Parmesan shavings, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the broccoli into florets and chop the green stems into small chunks.", "Heat a small frying pan until hot. Add the pine nuts and dry fry over a medium-low heat for a few minutes, until toasted and golden brown.", "Bring a pan of salted water to the boil, then add the onion and penne. Cook according to the pasta packet instructions, adding the broccoli 3 minutes before the end. Drain the pasta and vegetables, refreshing the broccoli separately in cold water to stop the cooking and to set the colour.", "Meanwhile, fry the bacon in a large, dry pan over a medium-high heat for about 10 minutes, or until crisp and golden-brown, stirring often. Reserve 2 tablespoons of the cooked bacon and add the remainder to the pasta.", "Add the pesto, tomatoes and broccoli to the cooked pasta mixture. Season with black pepper and stir.", "Tip into a serving dish, scatter with toasted pine nuts, the reserved bacon and Parmesan and serve."]}, {"isVegetarian": false, "title": "Express lasagne", "url": "www_bbc_co_uk_food_recipes_express_lasagne_51375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_lasagne_51375_16x9.jpg", "ingredients": ["butter, for greasing", "6 large dried lasagne sheets", "75g/2¾oz mature Cheddar cheese, grated", "1 tbsp oil", "450g/1lb pork sausage meat", "1 tbsp plain flour", "1 red chilli, deseeded and finely chopped", "2 fat garlic cloves, crushed", "250g/9oz chestnut mushrooms, sliced", "200ml/7fl oz full-fat crème fraîche", "100g/3½oz baby spinach, roughly chopped", "salt and freshly ground black pepper", "500g/1lb 2oz passata", "2 tbsp sun-dried tomato paste", "1 tsp light muscovado sugar", "1 tbsp chopped fresh thyme leaves", "1 tbsp chopped fresh sage"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease the ovenproof dish with butter. ", "Soak the lasagne sheets in recently boiled warm water to soften while you prepare the two sauces. ", "For the pork and spinach sauce, heat the oil in a large, non-stick frying pan. Add the sausage meat and brown over a high heat for 5–10 minutes until golden-brown, breaking up the mince with two wooden spoons. Sprinkle in the flour and fry for a minute.", "Add the chilli, garlic and mushrooms and fry for about 5 minutes. Stir in the crème fraîche and spinach. Bring to the boil and allow to bubble for a couple of minutes. Season well with salt and pepper and set aside. ", "For the tomato sauce, mix all the ingredients together in a jug or bowl and season well with salt and pepper. ", "Drain the lasagne sheets.", "Spoon one-third of the spinach sauce into the base of the ovenproof dish. Spoon one-third of the tomato sauce on top and arrange half the lasagne sheets over the tomato sauce. Repeat using two more layers of spinach and tomato sauce and one of lasagne sheets. Sprinkle over the grated cheese.", "Bake for 30–35 minutes, or until the pasta is tender and the top of the dish is golden-brown and bubbling around the edges. Serve immediately."]}, {"isVegetarian": false, "title": "Extra-lean burger and salad", "url": "www_bbc_co_uk_food_recipes_extra_lean_burger_and_59164", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_lean_burger_and_59164_16x9.jpg", "ingredients": ["low-calorie cooking spray", "½ small onion, finely chopped", "100g/3½oz Portobello mushrooms, finely chopped", "250g/9oz extra-lean beef mince (under 5% fat)", "2 tsp finely chopped fresh thyme (or ½ tsp dried thyme)", "freshly ground black pepper", "1 Little Gem lettuce, leaves separated", "120g/4½oz cherry tomatoes, sliced", "1/3 cucumber, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a small frying pan with oil and cook the onion and mushrooms over a medium heat for five minutes, or until well softened, stirring regularly. Tip into a heatproof bowl and leave to cool for five minutes.", "Add the beef, thyme and lots of ground black pepper. Mix well and form into two balls. Flatten into burger shapes, each around 2cm/¾in thick.", "Clean the pan and return to the hob. Spray with a little more oil and cook the burgers over a medium-low heat for 10 minutes, turning occasionally, until browned on the outside and cooked through inside. ", "Serve the burgers with lettuce, tomatoes and cucumber."]}, {"isVegetarian": false, "title": "Extra special beef biryani", "url": "www_bbc_co_uk_food_recipes_extra_special_beef_27357", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_special_beef_27357_16x9.jpg", "ingredients": ["100ml/3½oz full-fat milk", "1 heaped tsp saffron strands", "1kg/2lbs 2oz braising steak, cut into bite-sized chunks", "4 onions, peeled", "4 garlic cloves, peeled", "25g/1oz fresh root ginger, peeled and roughly chopped", "2 fresh red chillies, deseeded and roughly chopped", "5 cloves", "2 tsp cumin seeds", "2 tsp coriander seeds", "¼ cinnamon stick", "12 cardamom pods", "2½ tsp sea salt flakes, plus extra to season", "½ whole nutmeg, finely grated", "135ml/4¾fl oz sunflower oil", "200ml/7fl oz natural yoghurt", "2 bay leaves", "2 tsp caster sugar", "325g/11½oz basmati rice", "4 tbsp chopped fresh coriander", "50g/2oz butter", "50g/2oz sultanas", "40g/1½oz flaked almonds", "3 large free-range eggs", "freshly ground black pepper", "fresh coriander"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pour the milk into a small saucepan, add the saffron threads and heat gently for two minutes without boiling. Remove from the heat and set aside for 2-3 hours, preferably overnight.", "Trim the beef of any hard fat and cut into bite-sized pieces. Heat two tablespoons of oil in the frying pan. Season the beef with salt and freshly ground black pepper and fry in 2-3 batches over a medium-high heat until browned on all sides. Transfer to a large, lidded saucepan.", "While the beef is frying, roughly chop two of the onions and put in a food processor with the garlic, ginger and chillies. Add 50ml/2fl oz cold water and blend to a smooth paste.", "Put the cloves, cumin, coriander, cinnamon, 1½ teaspoons salt and seeds from the cardamom pods into a pestle and mortar. Grind until a fine powder. Grate the nutmeg into the mixture and tip into the onion paste. Add plenty of freshly ground black pepper. Mix until all the ingredients are combined.", "Add a further three tablspoons of oil into the same frying pan that was used to cook the beef and fry the spiced onion paste over a medium heat for around 10 minutes until lightly browned, stirring often. Place the mixture into the pan with the beef. Stir in the yoghurt, 450ml/16fl oz water and bay leaves. Place the pan over a low heat and bring to a gentle simmer. Cover with a lid and simmer gently for 1½ hours or until the beef is tender, stirring occasionally. ", "Remove the lid from the pan and stir in the sugar. Increase the heat and simmer the sauce for 10 minutes, or until reduced and thick. Add a little more salt and pepper to taste.", "Toast the almonds in a non-stick frying pan and cook over a medium heat for 4-6 minutes. Stir the sultanas into the almonds and immediately tip into a heatproof bowl. Set aside to cool.", "Cut the remaining two onions in half and slice thinly. Pour two tablespoons of oil into a frying pan and fry the onions for 6-8 minutes over a fairly high heat until softened and golden-brown, stirring frequently. Set aside.", "Preheat the oven to 180C/350F/Gas 4. ", "Half-fill a large pan with water, add one teaspoon of salt and bring to the boil. Put the rice in a sieve and rinse under plenty of cold water. Stir the rice into the hot water and return to the boil. Cook for five minutes and drain well. Add the coriander and stir until well combined.", "Transfer half the meat and sauce into a large, ovenproof dish. Spoon over half of the part-cooked rice and drizzle with half the soaked saffron threads and milk. Top with half the fried onions. Repeat the layers once more. Dot with the butter. Cover the dish with two layers of tightly fitting foil and bake for 30 minutes. ", "Hard-boil the eggs for nine minutes until firm and drain in a sieve under running water until cool enough to handle. Peel the eggs and cut into quarters. ", "Remove the dish from the oven and discard the foil. Use a fork to lightly fluff the rice. Garnish with the freshly boiled eggs, scatter with toasted almonds and sultanas. Add a few fresh coriander leaves and serve."]}, {"isVegetarian": true, "title": "Extravagant five-tiered wedding cake", "url": "www_bbc_co_uk_food_recipes_extravagant_five-tiered_21283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extravagant_five-tiered_21283_16x9.jpg", "ingredients": ["one quantity Rich moist fruit cake", "one quantity Rich moist fruit cake", "one quantity Rich moist fruit cake", "1 x 340g/12oz jar apricot jam", "5.5kg/10lb marzipan", "icing sugar, for dusting", "2.5kg/5lb royal icing", "ribbons, fresh flowers or fondant flowers, to decorate"], "serves": "Serves 200", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the 25cm/10in cake, bake the fruit cake according to the recipe. Remove the cake from the oven and set aside to cool.", "For the 22cm/8½in and 10cm/4in cakes, make the cake mixture according to the recipe, divide between the two tins and cook according to the recipe. Remove the cakes from the oven and set aside to cool.", "For the 18cm/7in and 15cm/6in cakes, make the cake mixture according to the recipe, divide between the two tins and cook according to the recipe. (There will slightly too much cake mixture, and leftover mixture can be baked in a muffin tin). Remove the cakes from the oven and set aside to cool.", "When the cakes are cold, spoon the top liberally with brandy, whisky or boiled orange juice, wrap well and leave for 3-4 days before icing.", "To cover the cakes in marzipan, thin the apricot jam with a little water so it’s the consistency of double cream and bring this to the boil. Pour the hot jam through a sieve into a bowl, pressing any fruit pieces through to extract the liquid, then leave until warm before using.", "If the cakes have peaked in the middle during baking you will want to carefully slice it flat. But if the cake is just gently domed then there’s no need.", "Cover the 10cm/4in cake with marzipan. Smooth the edges with a cake smoother and set aside to dry in a cool, dark place for 4-5 days. Repeat with the 15cm/6in, 18cm/7in, 22cm/8½in, and 25cm/10in cakes. ", "Apply a thin layer of royal icing to each cake and leave to dry for 2-3 days, then apply another coat and leave to dry for a further 2-3 days. Sand the cakes with sandpaper for a really smooth finish.", "Spoon the leftover royal icing into a piping bag fitted with a small plain nozzle. Pipe small dots around top and bottom edge of each cake. For more elaborate decoration, you can cover the cake in small dots.", "To assemble the cake, place the 25cm/10in cake onto the 30cm/12in cake drum. Place the 12cm/4½in cake board into the middle of the 25cm/10in and mark four points around the edge in a square. Push a dowelling rod into the cake and mark where it reaches the top of the cake. Cut the rod and three others to the same length and insert them into the cake at the four points.", "Place the 12cm/4½in cake board onto the top of the dowelling rods and top with the 12cm/4½in polystyrene cake spacer. Place the 22cm/8½in cake on top. ", "Repeat with the 22cm/8½in cake and 18cm/7in cakes, finishing with the 15cm/6in cake. Insert dowelling rods into the 15cm/6in and finally place the 10cm/4in cake on top. Decorate with fresh or fondant flowers."]}, {"isVegetarian": false, "title": "Fabulous fish pie", "url": "www_bbc_co_uk_food_recipes_fabulous_fish_pie_89662", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fish_pie_89662_16x9.jpg", "ingredients": ["600ml/1 pint 1fl oz full-fat milk", "1 onion, peeled and cut into sixths (keep the root intact)", "2 bay leaves", "500g/1lb 2oz thick white fish fillets, such as cod, haddock or pollock", "500g/1lb 2oz smoked haddock fillet, preferably undyed", "500g/1lb 2oz thick salmon fillet", "6 free-range eggs (optional)", "75g/3oz butter", "75g/3oz plain flour", "3 tbsp white wine", "100ml/3½fl oz double cream", "small bunch fresh dill, leaves removed ", "sea salt flakes and freshly ground black pepper", "1.25kg/2½lb potatoes, peeled and cut into even-sized pieces", "75g/3oz butter, cubed", "75ml/3fl oz double cream", "150g/5oz mature Cheddar, coarsely grated"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, pour the milk into a large saucepan and add the onion and bay leaves. Season with salt and freshly ground black pepper. Place the fish fillets in the pan and bring to a very gentle simmer. Cover with a lid and cook for two minutes. Remove from the heat and set aside to stand and infuse for five minutes until the fish is almost cooked. Drain the fish through a colander into a bowl, then pour the milk into a jug. ", "Meanwhile, for the topping, cook the potatoes in simmering water for 15 minutes or until the potatoes are soft. Drain in a colander then return to the pan and mash with the butter, cream and three-quarters of the grated cheese. Season to taste with salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6. ", "Fill a saucepan one-third full with water and bring to the boil. Gently add the eggs to the water and cook for nine minutes. Drain in a colander under running water for 1-2 minutes then transfer to a bowl of very cold water and set aside. ", "Melt the butter in a medium saucepan and stir in the flour. Cook for a few seconds, and then gradually add the infused milk, wine and cream, stirring over a medium heat for five minutes until the sauce is smooth and thick. Season with salt and freshly ground black pepper. ", "Remove the sauce from the heat and add the dill fronds into the sauce. Peel the eggs and cut in half.", "Spoon a third of the sauce into the base of a large ovenproof dish or 6-8 individual dishes. Scatter half the fish fillets over the sauce, breaking them into chunky pieces as you go, discarding the skin, onion and bay leaves. Place half the eggs on top and pour over another third of the sauce. Continue with the layering process until the ingredients are used up.", "Spoon the potato over the fish mixture, starting at the edges before making your way into the centre. Fluff up the potato with a fork and sprinkle with the remaining cheese. Place the dish on a baking tray and bake in the centre of the oven for about 45 minutes or until the top is golden-brown and the filling is bubbling. "]}, {"isVegetarian": true, "title": "Fabulous fruity jewelled tarts", "url": "www_bbc_co_uk_food_recipes_fabulous_fruity_jewelled_62910", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fruity_jewelled_62910_16x9.jpg", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "115g/4oz icing sugar, sifted", "pinch salt", "225g/8oz cold unsalted butter, cut into cubes", "1 free-range egg, plus 2 egg yolks, lightly beaten", "6 egg yolks", "90g/3¼oz caster sugar", "40g/1½oz cornflour", "450ml/16fl oz full-fat milk", "2 vanilla pods, split lengthwise", "50ml/2fl oz double cream", "45g/1½oz unsalted butter, cut into small pieces", "1-2 tbsp elderflower cordial, preferably homemade ", "400g/14oz mixed berries, such as redcurrants, blueberries, raspberries and strawberries", "170g/6oz redcurrant jelly, to glaze"], "serves": "Makes 12 individual tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the flour, icing sugar and salt in a food processor and pulse briefly to combine. Add the butter and pulse briefly until the mixture resembles fine breadcrumbs. Add the beaten eggs and yolks and pulse until the mixture comes together. Turn out onto the work surface, knead very briefly and shape into a thick disc. Wrap the pastry in cling film and refrigerate for at least an hour.", "For the custard, put the egg yolks, caster sugar and cornflour in a bowl and mix well until combined. ", "Put the milk and split vanilla pods into a saucepan and bring just to the boil. Remove from the heat and carefully fish out the vanilla pods. Slowly pour the hot milk into the egg mixture, whisking all the time. ", "Return the custard to the saucepan and cook over a medium heat, stirring constantly until the mixture is very thick. Remove from the heat and transfer the custard to a large bowl. Stir in the cream and butter until completely combined, then add elderflower cordial to taste (you do not want it to be overpowering). Press baking parchment down onto the surface of the custard to prevent a skin forming and cool to room temperature, then chill in the fridge until needed.", "Grease twelve 10cm/4in fluted tart tins. On a lightly floured work surface, roll out the pastry to a 4mm thickness. Cut 11cm/4¼in circles from the pastry to line the tins, rerolling as necessary. Prick the bases with a fork and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Put a piece of baking parchment into each pastry case and fill with baking beans. Bake in a preheated oven for 15 minutes, then remove the beans and parchment and return to the oven for 5–8 more minutes, or until lightly golden-brown. Remove from oven and allow to cool.", "Heat the redcurrant jelly in a saucepan until melted. Brush the insides of the pastry shells with a thin layer of jelly.", "Fill the cases with the custard and top with a generous amount of fruit. Brush the fruits with jelly to give them a shine."]}, {"isVegetarian": true, "title": "Eton mess", "url": "www_bbc_co_uk_food_recipes_etonmess_81082", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/etonmess_81082_16x9.jpg", "ingredients": ["500g/1lb 2oz strawberries, hulls removed", "400ml/14fl oz double cream", "3 x 7.5cm/3in ready-made meringue nests, crushed", "1 tbsp ginger cordial (optional)", "sprigs of fresh mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration.", "Whip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using. ", "Spoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint."]}, {"isVegetarian": false, "title": "Faggots with onion gravy", "url": "www_bbc_co_uk_food_recipes_faggotswithoniongrav_3899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 medium onion, peeled and finely chopped ", "175g/6oz minced pigs' liver ", "2 lamb or pigs' heart, trimmed and cut into chunks ", "450g/1lb belly of pork, trimmed and rind removed ", "½ tsp mace", "4tbsp freshly chopped chives ", "1 tsp freshly chopped sage ", "1 egg, beaten ", "salt and freshly ground pepper ", "115g/4oz fresh white bread crumbs ", "25g/1oz beef dripping or 3 tbsp olive oil ", "4 red onions, peeled and each onion cut into 8 wedges ", "4 sprigs of fresh thyme ", "1 tbsp olive oil ", "900ml/1½pt fresh beef stock ", "290ml/½ pint red wine ", "salt and freshly ground black pepper"], "serves": "Makes 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a small saucepan and add the onions. Cook until soft and transparent. Cool slightly", "Place the belly pork onto a chopping board and cut into portions. ", "Place the minced pigs' liver into a large glass bowl and place under the blade of a mincer. Using a fine blade of a mincer, mince the pork belly and lambs heart directly into the bowl with the pig s liver. If you do not have a mincer at home ask your butcher to mince all your meat for you. ", "Add the cooled chopped onions, mace, chives, sage, beaten egg and salt and pepper. Stir in the breadcrumbs. ", "Using your hands shape the mixture into 12 patties. Place on a plate and chill for about 1 hour. ", "Preheat the oven to 200C/400F/Gas 6. 7. For the gravy: place the onion wedges into a large roasting pan or ovenproof dish. Add the thyme and drizzle over the olive oil. Place in the oven and roast uncovered for 40 minutes until the onions are caramelised. ", "Meanwhile heat the dripping or olive oil in a large frying pan. Fry the faggots until golden brown on both sides. ", "Place the stock and wine in a small saucepan, bring to the boil and reduce by a third. ", "Remove the roasted onions from the oven and lay the faggots on top. Pour over the gravy liqueur. Reduce the oven temperature to 180C/350F/Gas 4 and cook the faggots for 40 minutes. ", "Place two to three faggots onto a plate. Top with a spoonful of the onions and pour over the gravy. Serve the faggots with mashed potatoes and green vegetables."]}, {"isVegetarian": true, "title": "Chocolate fairy cakes", "url": "www_bbc_co_uk_food_recipes_fairycakes_83889", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_83889_16x9.jpg", "ingredients": ["4 free-range eggs", "225g/8oz sugar", "225g/8oz self-raising flour", "225g/8oz butter, melted", "110g/4oz butter, softened", "170g/6oz icing sugar", "55g/2oz cocoa powder, sifted", "1-2 tbsp milk", "white chocolate buttons", "milk chocolate buttons"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and lin 2 x 12-hole fairy cake tins with paper cases.", "Whisk the eggs and sugar together in a bowl until light and fluffy.", "Carefully fold in the flour and butter.", "Pour the mixture carefully into the paper cases.", "Bake the cakes for 15-20 minutes, or until golden-brown on top and a skewer inserted into one of the cakes comes out clean. Set aside to cool for 10 minutes on a wire rack before removing from the tin.", "To make the buttercream, beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth.", "Add the remaining icing sugar, cocoa powder and one tablespoon of the milk and beat until creamy. Beat in more milk if necessary to loosen the icing.", "Once the cakes are cool, spread the buttercream icing on top of the cakes.", "Decorate the cakes with the chocolate buttons."]}, {"isVegetarian": true, "title": "Fairy cakes", "url": "www_bbc_co_uk_food_recipes_fairycakes_93711", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_93711_16x9.jpg", "ingredients": ["110g/4oz butter or margarine, softened at room temperature", "110g/4oz caster sugar", "2 free-range eggs, lightly beaten", "1 tsp vanilla extract", "110g/4oz self-raising flour", "1-2 tbsp milk", "300g/10½oz icing sugar", "2-3 tbsp water", "2-3 drops food colouring", "hundreds and thousands, or other cake decorations"], "serves": "24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line 2 x 12-hole fairy cake tins with paper cases.", "Cream the butter and sugar together in a bowl until pale. Beat in the eggs, a little at a time, and stir in the vanilla extract.", "Fold in the flour using a large metal spoon. Add a little milk until the mixture is a soft dropping consistency and spoon the mixture into the paper cases until they are half full.", "Bake in the oven for 8-10 minutes, or until golden-brown on top and a skewer inserted into one of the cakes comes out clean. Set aside to cool for 10 minutes, then remove from the tin and cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring. ", "To ice the fairy cakes, drizzle the icing over the cakes, sprinkle with decorations and set aside until the icing hardens."]}, {"isVegetarian": true, "title": "Veggie bean fajitas", "url": "www_bbc_co_uk_food_recipes_fajitas_8651", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fajitas_8651_16x9.jpg", "ingredients": ["2 tbsp vegetable oil ", "1 onion, chopped ", "1 red chilli, seeds removed and chopped ", "1 garlic clove, chopped ", "2 x 110g tins kidney beans, washed and drained ", "vegetable stock or water", "4 tomatoes, seeds removed and chopped", "½ red onion, chopped", "small bunch coriander, chopped ", "1 lime ", "1 packet of wheat tortillas ", "250ml/9fl oz plain yoghurt or soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, add the oil to a pan and cook the onion, chilli and garlic until softened. Add the beans and cook for a further 10 minutes, stirring occasionally. Add a little vegetable stock, about half a small glass, cook the beans until the mixture is smooth and not runny. ", "Mash the beans roughly with the back of a fork or a potato masher, then set aside.", "For the salsa, mix together the tomatoes, red onion, a squeeze of lime juice and a handful of the chopped fresh coriander.", "Just before you are ready to eat, add the remaining coriander and a squeeze of lime juice to the beans.", "Warm each tortilla through in a pan and put on a plate, spoon over some of the filling, add a spoonful of the yoghurt and a little salsa. Roll up and serve immediately."]}, {"isVegetarian": false, "title": "Fajitas with guacamole", "url": "www_bbc_co_uk_food_recipes_fajitaswithguacamole_90524", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fillet steak, cut into strips", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 ripe avocado, skinned and chopped", "1 garlic clove, crushed to a paste", "1 tbsp olive oil", "½ lime, zest and juice", "½ beef tomato, chopped", "2 tbsp chopped fresh coriander", "2 tortilla wraps", "2 tbsp Greek-style yoghurt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the steak strips with salt and freshly ground black pepper. Heat the olive oil in a pan, then fry the steak for 1-2 minutes on both sides (for medium), or until cooked to your liking. Remove from the pan and allow to rest on a warm plate. ", "For the guacamole, mash the avocado and garlic together with a fork, and then mix in the remaining guacamole ingredients.", "To serve, wrap the steak, guacamole and yoghurt up in two tortilla wrap."]}, {"isVegetarian": true, "title": "Falafel three ways", "url": "www_bbc_co_uk_food_recipes_falafel_4_ways_22209", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafel_4_ways_22209_16x9.jpg", "ingredients": ["400g tin chickpeas, drained and rinsed", "1 small onion, roughly chopped", "2 garlic cloves, roughly chopped", "½ tsp ground coriander", "½ tsp ground cumin", "½ tsp ground cinnamon", "½ tsp flaked sea salt", "3 tbsp gram flour (chickpea)", "small bunch coriander leaves and stems, roughly chopped", "1 small free-range egg", "100g/3½oz sesame seeds, for rolling", "1 tbsp olive oil", "100g/3½oz tagliatelle", "1 tbsp olive oil", "1 garlic clove, thinly sliced", "pinch dried chilli flakes", "2 handfuls baby spinach", "4 cooked falafel", "2 tbsp finely chopped fresh parsley", "½ lemon, juice only", "3 cooked falafel", "1 pitta bread, cut into thin triangles", "2 tbsp olive oil", "sea salt", "½ Little Gem lettuce, thinly sliced", "½ small red onion, thinly sliced", "squeeze lemon juice", "1 tsp plain yoghurt, ideally Greek, to serve", "1 slice sourdough", "2 cooked falafel", "1 free-range egg", "1 tsp olive oil", "large pinch paprika, to garnish"], "serves": "Serves 1", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the falafel, tip the chickpeas, onion, garlic, spices, salt, gram flour, fresh coriander and egg into a food processor and pulse until it is blended but still has some texture. Roll the mixture into 12–15 small balls and coat each in sesame seeds. Refrigerate for 30 minutes, or until ready to use. To cook the falafel, heat the oil in a frying pan until medium–hot. Fry for 10 minutes, turning regularly, until golden and cooked through. ", "For the pasta, boil the tagliatelle following the packet instructions or until al dente, then drain well. Meanwhile, heat the oil in a frying pan, add the garlic and chilli and cook, stirring, for 1 minute. Add the spinach and stir for 1 minute or until wilted. Tip in the tagliatelle and parsley and heat through for a few seconds, stirring. To serve, top with four cooked falafel and squeeze over the lemon juice. ", "For the pittas, preheat the oven to 210C/190C Fan/Gas 6. Put the pitta triangles on a baking tray, drizzle over 1 tablespoon oil and sprinkle with sea salt. Bake for 5–10 minutes, or until crisp. Mix the Little Gem and red onion and dress with the remaining oil and the lemon juice. Serve with four cooked falafel and the yoghurt. ", "For the breakfast toast, toast the sourdough and top with the broken up falafel. Fry the egg in the oil over a high heat and place on top of the toast. Sprinkle over paprika and serve."]}, {"isVegetarian": true, "title": "Falafel footballs", "url": "www_bbc_co_uk_food_recipes_falafel_footballs_41881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil for greasing ", "1 tin kidney beans (240g drained weight) ", "1 garlic clove, peeled ", "1 spring onion ", "small handful fresh coriander ", "1 tsp dried cumin ", "1 tsp plain flour"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Brush a baking tray generously with vegetable oil.  Ask a grown-up to preheat the oven at 200C/400F/Gas 6. \t\t\t               \t\t\t", "Start by placing the drained beans and the garlic clove in the plastic bag and mashing with the rolling pin then transferring into bowl. ", "Ask a grown-up to help you use the scissors to cut off the roots and the dark green top of the spring onions – this is called topping and tailing. Finely cut up the rest of the spring onion and add to the beans. Then chop up the fresh coriander finely with the scissors and add it to the bean mash. ", "Sprinkle over the dried cumin, you can add more if you really like the taste. Sprinkle over the plain flour and mix everything together well.  Now squeeze the mixture with your hands until it all starts to stick together. ", "Divide the mixture into four equal portions and shape them in your hands into four balls – squeeze them again so that they hold their shape. Put on the oiled baking sheet and dab the top with a little more oil.\t ", "Ask a grown-up to put them in the oven for 12-15 minutes. Leave to cool for about five minutes to allow them to set before eating. Serve warm or cold in pitta pockets with salad leaves."]}, {"isVegetarian": true, "title": "Falafel", "url": "www_bbc_co_uk_food_recipes_falafel_80242", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz dried chickpeas, soaked overnight", "3 large cloves garlic, finely chopped", "¼ large bunch fresh parsley, leaves only", "1 small onion, finely chopped (about twice as much as the amount of garlic)", "2 medium potatoes, boiled until tender, then peeled", "salt and freshly ground black pepper ", "¼ tsp bicarbonate of soda, dissolved in a little cold water", "dried chilli flakes, to taste", "1-2 tsp ground cumin", "sunflower oil, for frying", "3 tbsp tahini (sesame paste)", "1 tbsp water, or as needed", "1-2 lemons, juice only", "1 clove garlic, finely chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Drain, rinse and dry soaked the chickpeas. Place the chickpeas in a food processor with the garlic and the parsley and process until the mixture is roughly chopped. Add the onion and potatoes and the salt and freshly ground black pepper to taste and blend again. The mixture should retain some texture. Sprinkle the bicarbonate and water mixture over the top of the chickpea mixture and let it sit for about 30 minutes. Sprinkle the chilli flakes and cumin over the mixture and mix in lightly.", "Form the mixture into balls, place on a baking tray, cover and refrigerate for about half an hour.", "Heat enough oil to shallow fry in a deep, heavy-bottomed pan. The oil is ready when a breadcrumb dropped into it will sizzle gently. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Carefully place a few balls of falafel into the hot oil and fry for a minute or two, until the outside is brown and crisp. Cook the falafel balls in batches, removing with a slotted spoon when cooked and draining on kitchen towels.", "For the sauce, put three tablespoons of tahini into a deep dish. Add water a teaspoon at a time, until you have a mixture the consistency of thick cream (you may need a little more or a little less water). Add the juice of 1-2 lemons, to taste, and mix again. If the mixture becomes too thick, add a little water. Add the chopped garlic and mix again.", "Serve the falafels with the tahini sauce."]}, {"isVegetarian": true, "title": "Falafel burger with hummus", "url": "www_bbc_co_uk_food_recipes_falafelburgerwithhou_72037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafelburgerwithhou_72037_16x9.jpg", "ingredients": ["250g/9oz chickpeas, soaked overnight", "1 medium onion, very finely chopped", "2 cloves garlic, crushed or finely chopped", "2 tsp ground cumin", "2 tsp ground coriander seed", "6 tbsp chopped parsley", "½ tsp chilli powder", "2 rounded tbsp plain flour", "1 tsp salt", "Oil for deep fat frying", "125g/4½oz hummus", "2 tbsp extra virgin olive oil", "1-2 tbsp lemon juice", "1 tbsp tahini", "4 large rolls (or hamburger buns)", "1 fat tomato, sliced", "1 red onion sliced", "4 leaves butter lettuce", "salad or fries, or sautéed potatoes"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Drain the chickpeas thoroughly and pulse in the food processor until lightly broken up.  ", "Add the remaining ingredients and continue to pulse until you have the texture of coarse breadcrumbs.  Gently form into patties approx. 10cm/4in in diameter by 2½cm/1in. thick.", "Fry in hot oil at 180C/350F for 4-5 minutes, or until crisp or golden.", "For the hummus and tahini sauce simply whisk together all the ingredients.  If you prefer a lighter sauce add a little water until it is the preferred consistency.", "To serve, split and warm the rolls.  Place in the top of each roll a leaf of lettuce, a slice of tomato, and some red onions.  ", "Place the falafel burger on the bottom side of the roll, and some of the sauce.  ", "Either serve side by side on a plate, or built up as a burger on a plate with your choice of accompaniment.", "Cook and refrigerate or freeze any left over burgers for a quick and easy snack."]}, {"isVegetarian": true, "title": "Farmhouse vegetable soup with lentil cream", "url": "www_bbc_co_uk_food_recipes_farmhousevegetableso_88397", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "85g/3oz purple sprouting broccoli, chopped", "5 baby carrots, chopped", "1 garlic clove, chopped", "55g/2oz Puy lentils", "300ml/½ pint hot chicken or vegetable stock", "2 tbsp canned flageolet beans, rinsed and drained", "1 tomato, chopped", "2 tbsp chopped fresh parsley", "3 tbsp Puy lentils, cooked", "1 tbsp chopped fresh parsley", "2 tbsp olive oil", "½ tsp Dijon mustard", "dash white wine vinegar", "salt and freshly ground black pepper", "3 tbsp double cream, whipped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter in a small saucepan, add all the remaining soup ingredients except the tomato and parsley and simmer for ten minutes, or until the lentils are cooked.", "Stir in the tomato and parsley and pour into a bowl.", "For the lentil cream, place all of the lentil cream ingredients except the cream into a mini blender and process until smooth.", "In a bowl, fold the lentil mixture into the whipped cream. Place a dollop of lentil cream on top of the soup and serve."]}, {"isVegetarian": false, "title": "Farthing biscuits", "url": "www_bbc_co_uk_food_recipes_farthing_biscuits_61473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "225g/8oz self-raising flour", "1 tsp table salt ", "1 tsp caster sugar", "85g/3oz lightly salted butter, plus extra to serve ", "85g/3oz lard"], "serves": "Makes approx. 18 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the biscuits, preheat the oven to 180C/350F/Gas 4.", "In a bowl, mix the dry ingredients together.  Rub in butter and lard so that mixture resembles fine breadcrumbs.", "Add just enough cold water to bring the mixture together to form a stiff dough (about 5-6 tablespoons). Refrigerate for 15-20 minutes.", "On a lightly floured worksurface, roll out the dough to a thickness just less than a £1 coin.", "Using a 9cm/3½in round cutter cut out biscuits from the dough. Prick the top of the biscuits all over to decorate, leaving a plain 5mm/¼in border around the edge.", "Transfer to wire racks or baking mesh. Place the racks/mesh on baking trays and bake for 14-16 minutes, or until the biscuits are dry but not browned. Set aside to cool completely.", "Serve the biscuits with chilled butter."]}, {"isVegetarian": false, "title": "Fast lasagne with pork and spinach", "url": "www_bbc_co_uk_food_recipes_fastlasagnewithporka_83462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "450g/1lb pork sausage meat", "1 red chilli, deseeded and finely chopped", "2 fat cloves garlic, crushed", "150g/5oz button mushrooms, sliced", "1 x 200ml/7fl oz carton full-fat cr`me frâiche", "100g/4oz baby spinach, roughly chopped", "salt and freshly ground black pepper", "1 x 400g/1lb can chopped tomatoes", "2 tbsp sun-dried tomato paste", "1 tsp demerara sugar", "1 tbsp fresh thyme leaves", "6 sheets, about 75g/3oz quick-cook white lasagne or fresh lasagne", "50g/2oz strong cheddar cheese, grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the ragu and spinach sauce, heat the oil in a large non-stick frying pan, add the sausage meat and brown over a  high heat until golden, breaking up the meat with two wooden spoons.", "Add chilli, garlic and mushrooms and fry for a few minutes.  Stir in the créme frâiche and spinach. ", "Bring to the boil for a couple of minutes, season well and set aside.", "For the tomato sauce, measure all the ingredients into a jug and season well.", "Divide the ragu sauce into thirds and spoon one third into the base of an oven-proof dish.  ", "Spoon one third of the tomato sauce on top and arrange half the pasta sheets over it.  Repeat using two more layers of  ragu and tomato sauce and one of pasta. ", "Sprinkle over the grated cheese.", "Place in the oven for about 20-30 minutes or until golden brown, bubbling around the edges and the pasta is tender."]}, {"isVegetarian": true, "title": "Fast rhubarb tart with mascarpone cream", "url": "www_bbc_co_uk_food_recipes_fastrhubarbtartwithm_92278", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fastrhubarbtartwithm_92278_16x9.jpg", "ingredients": ["5-6 stalks rhubarb ", "good shake of light brown sugar", "frozen ready-rolled all-butter puff pastry, defrosted", "1 tsp butter, for greasing", "flour, for dusting", "2 large organic eggs, separated", "2 tbsp unrefined caster sugar", "250g/9oz tub mascarpone", "2-3 drops vanilla extract"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted rhubarb, preheat the oven to 200C/400F/Gas 6. Cut the rhubarb into 15cm/6in or so lengths (about the length of a wooden spoon-handle) and place in a roasting tin with half a tea-cup of water and the light brown sugar. Roast until just soft enough to take the point of a knife, about 10-15 minutes. Allow to cool, then drain, reserving the cooking juices. ", "For the tart, preheat the oven to 220C/425F/Gas 7. Unroll the puff pastry, and using a rolling pin, roll it again to make the pastry slightly thinner. Cut the pastry into three even-sized rectangles. Using a sharp knife, score a 1.5cm/½in border around each rectangle, being careful not to cut through the pastry. Place the pastry rectangles on a lightly greased  baking sheet.", "Arrange 3-4 lengths of drained rhubarb, depending on the thickness of them, into the middle of the pastry rectangles and brush some of the reserved juice from the roasted rhubarb around the edges to give the pastry a shine. Bake for 20 minutes, until golden and risen.", "Meanwhile beat the egg yolks and sugar in a bowl for a few seconds, until thoroughly mixed.  Beat in the mascarpone until you have a custard-coloured cream. Stir in a little vanilla extract; a couple of drops should be enough. With a clean whisk, beat the egg white in a clean bowl until it stands in stiff peaks, then fold into the creamed mascarpone mixture.", "Serve the mascarpone cream with the warm rhubarb tarts. Any remaining mascarpone cream can be served the following day with berries or used to top meringues served with fruit."]}, {"isVegetarian": true, "title": "Fat pancakes with fried apples", "url": "www_bbc_co_uk_food_recipes_fat_pancakes_with_dutch_05905", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fat_pancakes_with_dutch_05905_16x9.jpg", "ingredients": ["3 large eggs", "300g/10oz self-raising flour", "150g/5oz granulated sugar (caster is fine but slightly changes consistency of sponge)", "100ml/3fl oz milk", "1 tbsp sunflower oil", "50g/2oz butter", "icing sugar, to taste", "3 peeled apples, chopped ", "1 gill advocaat, or to taste (optional)", "lightly whipped double cream, to serve"], "serves": "Makes about 15 pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the eggs in a large mixing bowl, then add the flour, sugar and milk and beat until smooth. The batter should be thick enough to slowly drop off the spoon.", "Heat a little sunflower oil in a griddle or heavy bottomed large frying pan over a medium heat. Pour the batter in large spoonfuls to make each pancake leaving plenty of room for them to expand.", "The pancakes are ready to turn when bubbles rise to the surface and break, like the holes in a crumpet. Adjust the heat to keep them from browning too much. Flip the pancakes over and cook for about two minutes. If you're making a large batch, they keep warm only for about 15 minutes.", "For the Dutch fried apples, heat butter in a small saucepan over a medium heat. If your apples are very tart add a little icing sugar to the butter and cook until the sugar is melted. ", "Add the chopped apple and cook, stirring occasionally, until tender and golden brown. Pour in half the advocaat (if using) and let it bubble down and reduce to a scant coating.", "Serve the pancakes topped with the apples, icing sugar and a dollop of whipped cream. "]}, {"isVegetarian": true, "title": "Fat rascals", "url": "www_bbc_co_uk_food_recipes_fat_rascals_68150", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour ", "150g/5½oz self-raising flour", "1 tsp baking powder ", "150g/5½oz butter", "150g/5½oz mixed dried fruit", "100g/3½oz caster sugar", "1 tsp cinnamon powder", "½ tsp grated nutmeg", "1 orange, zest only ", "1 lemon, zest only", "1 free-range egg yolk", "about 50ml/2fl oz milk", "1 free-range egg, yolk only", "pinch of salt", "1 tbsp water", "flaked almonds and glacé cherries, to decorate"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas6. Grease a baking tray.", "Sieve the flours and baking powder into a large bowl and rub in the butter until the mixture resembles breadcrumbs.", "Add the mixed dried fruit, sugar, spices, orange and lemon zests.", "Lightly beat the egg yolk and add it to the mixture with enough milk to make a stiff dough (you may not need all the milk). Divide the dough into 12, shape into mounds and place onto the baking tray.", "For the glaze, mix the egg yolk, salt and water together and brush the mixture over each rascal.  Decorate with the almonds and glacé cherries and bake for 15-20 minutes or until golden brown."]}, {"isVegetarian": true, "title": "Fat chips with cheese fondue", "url": "www_bbc_co_uk_food_recipes_fatchipswithcheesefo_77711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 potato, sliced into thick chips ", "2 tbsp olive oil", "½ tsp paprika", "salt and freshly ground black pepper ", "200ml/7fl oz double cream", "250g/9oz red cheddar cheese", "1 tbsp mustard powder", "½ tsp ground cumin"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the potato chips onto a baking tray.  Drizzle with the olive oil and sprinkle with the paprika.  Season with salt and freshly ground black pepper.", "Place into the preheated oven and cook for 15 minutes. ", " For the fondue  ", "Heat the double cream in a saucepan.  Add the cheese, mustard and cumin and cook until the cheese melts.", "Serve the fondue with the fat chips."]}, {"isVegetarian": true, "title": "Fatless white sauce", "url": "www_bbc_co_uk_food_recipes_fatlesswhitesauce_70005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10fl oz/275ml milk - this can be infused but must be cold ", "¾oz/20g sauce/plain flour ", "salt and freshly milled black pepper"], "serves": "Makes 10fl oz/275ml", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["All you do to make this sauce is place the milk in a small saucepan, then simply add the sauce flour and, over a medium heat, bring everything gradually up to simmering point, whisking vigorously and continuously with a balloon whisk until the sauce has thickened to a smooth, rich creaminess. Then add seasoning and allow it to cook very gently forminutes on the lowest possible heat."]}, {"isVegetarian": false, "title": "Fat rascals", "url": "www_bbc_co_uk_food_recipes_fatrascals_93997", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fatrascals_93997_16x9.jpg", "ingredients": ["150g/5¼oz plain flour", "150g/5¼oz self-raising flour", "1 tsp baking powder", "65g/2¼oz lard, diced", "65g/2¼oz unsalted butter, diced", "90g/3¼oz caster sugar", "1 orange, zest only", "1 lemon, zest only", "1 tsp ground cinnamon", "½ tsp freshly grated nutmeg", "50g/1¾oz currants", "50g/1¾oz raisins", "50g/1¾oz sultanas", "50ml/1¾fl oz double cream", "2 free-range eggs, beaten", "50g/1¾oz glacé cherries", "50g/1¾oz blanched almonds", "100g/3½oz clotted cream", "70g/2½oz strawberry jam", "50g/1¾oz unsalted butter"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper.", "Sieve the flours into a bowl and stir in the baking powder.", "Add the diced lard and butter and rub into the flour using your fingers until the mixture resembles fine breadcrumbs.", "Add the sugar, orange zest, lemon zest, cinnamon, nutmeg and dried fruit and mix until well combined. ", "Stir in the cream and half of the beaten egg until the mixtures comes together as a dough. Cut the dough into six pieces, shape into large rounds, 2cm/1in deep and place onto the prepared baking tray.", "Brush the remaining beaten egg over the top of the 'rascals' and top with the glacé cherries and blanched almonds.", "Bake in the oven for 15-20 minutes, or until golden-brown. Remove from the oven and set aside to cool slightly.", "Serve warm with the clotted cream, jam and butter."]}, {"isVegetarian": true, "title": "Fattoush", "url": "www_bbc_co_uk_food_recipes_fattoush_86811", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fattoush_86811_16x9.jpg", "ingredients": ["100ml/3½ fl oz olive oil", "1 lemon, juice and zest ", "½ garlic clove, crushed", "2 tbsp sumac (a sour-tasting ground spice, available in Middle Eastern delicatessens)", "salt and freshly ground black pepper", "1 pitta bread, torn into small pieces", "8 plum tomatoes, seeds removed, quartered", "half cucumber, peeled, cut into 5cm/2in batons", "half green pepper, cut into strips", "8 radishes, sliced", "1 shallot, sliced", "small handful rocket leaves", "1 small Little Gem lettuce", "handful fresh mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place the olive oil, lemon juice and zest, crushed garlic and sumac into a bowl and whisk together to combine. Season, to taste, with salt and freshly ground black pepper.  (You will not need all the dressing for this recipe, so set the remainder aside in the fridge for up to a week.)", "For the salad, place the torn pitta, tomatoes, cucumber, pepper, radishes, shallot, rocket leaves, Little Gem lettuce leaves and mint leaves into a large bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, pour the dressing, to taste, over the salad and gently mix together to coat the salad evenly."]}, {"isVegetarian": true, "title": "Fattoush salad", "url": "www_bbc_co_uk_food_recipes_fattoush_salad_02182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz vegetable oil", "2 pitta breads, cut into squares", "2 large vine tomatoes, chopped into large chunks ", "½ cucumber, chopped into large chunks", "1 Little Gem lettuce, leaves separated and torn", "2 fresh mint sprigs, leaves picked and finely chopped", "large handful fresh parsley, finely chopped ", "10–12 black olives, pitted ", "½ pomegranate, seeds only", "salt and freshly ground black pepper", "1 lemon, juice only ", "2–3 tbsp extra virgin olive oil", "2 tbsp pomegranate molasses", "1 tsp sumac, plus extra to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a deep-fat fryer until it reaches about 170C, or a cube of bread browns in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the pitta bread for 2–3 minutes, or until golden-brown. Drain on kitchen paper and sprinkle with sea salt. ", "To make the dressing, whisk the ingredients together in a small jug. Season with salt and pepper. ", "To make the salad, place the tomatoes, cucumber lettuce, herbs and olives in a large bowl. Pour over the dressing and mix well.  ", "Scatter with the fried pitta, pomegranate seeds and a sprinkle of sumac before serving."]}, {"isVegetarian": true, "title": "Fairtrade banana bread", "url": "www_bbc_co_uk_food_recipes_fairtradebananabread_72082", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour ", "100g/4oz butter", "150g/5oz caster sugar ", "450g/1lb Fairtrade bananas (the softer the better), peeled and mashed ", "½ tsp salt ", "2 eggs ", "175g/6oz mixed dried fruit"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4. ", "Mix all the of the ingredients except the dried fruit together. You can do this in a food processor or by hand in a mixing bowl. ", "When the ingredients are all thoroughly combined, fold in the dried fruit.", "Spoon the batter mixture into a 1kg/2lb non-stick loaf tin, spread it out evenly and bake it for one and a half hours. ", "When the banana bread has risen, golden-brown on top and cooked through, remove it from the oven and set aside to cool on a wire rack. Slice before serving."]}, {"isVegetarian": true, "title": "Fattoush with crisp olive flatbread", "url": "www_bbc_co_uk_food_recipes_fattoush_with_crisp_53560", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fattoush_with_crisp_53560_16x9.jpg", "ingredients": ["2 small cucumbers", "450g/1lb cherry tomatoes, quartered ", "200g/7oz radishes, quartered  ", "1 small baby gem lettuce, roughly chopped ", "4 spring onions, roughly chopped", "50g/1¾oz flatleaf parsley leaves", "10g/⅓oz small mint leaves", "9 tbsp olive oil  ", "1 pitta bread ", "2 tbsp pomegranate molasses ", "1 tbsp sumac", "12 stoned green olives ", "25g/1oz finely chopped flatleaf parsley", "100ml/3½fl oz olive oil  ", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Peel, halve and remove the seeds from the cucumbers. Cut them into half-moons and place in a large bowl.", "Add the tomatoes, radishes and lettuce. Scatter over the spring onions and tear in the parsley and mint leaves.", "Heat 5 tablespoons of the olive oil in a frying pan and shallow fry the whole pitta bread until crisp and golden. Drain on kitchen paper and leave to cool.", "Break up the bread into bite-sized pieces. ", "To make the olive paste, blend the olives with the parsley, olive oil and lemon juice, then spread the paste on the bread pieces.", "Dress the salad with the pomegranate molasses, the remaining olive oil and the sumac. Mix well with your hands.", "Serve the salad with pieces of olive bread."]}, {"isVegetarian": false, "title": "Fennel and lemon risotto, Parmesan crisps and fennel fritters", "url": "www_bbc_co_uk_food_recipes_fennel_and_lemon_risotto_28159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_lemon_risotto_28159_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 garlic clove, roughly chopped", "1 tsp fennel seeds, ground", "½ tsp dried red chilli flakes", "1½ large fennel bulbs, finely chopped, fronds kept for garnish ", "140g/5oz Parmesan, finely grated ", "1 large onion, thinly sliced ", "280g/10oz arborio rice ", "250ml/9fl oz dry white wine", "700ml–1 litre/1¼–1¾ pints hot chicken stock", "1 unwaxed lemon, finely grated zest and juice ", "salt and freshly ground black pepper", "250ml/9fl oz soda water, ice cold ", "1 large free-range egg ", "good pinch cayenne pepper ", "1 tsp baking powder", "2 tbsp cornflour", "100g/3½oz plain flour", "1 litre/1¾ pints vegetable oil", "½ large fennel bulb, cut into thin wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the risotto, heat 1 tablespoon oil in a large heavy-bottomed saucepan over a medium heat.  Sauté the garlic, fennel seeds and chilli flakes for 1–2 minutes. Add the finely chopped fennel and cook for 15–20 minutes, or until softened. ", "Meanwhile, preheat the grill to medium–high. Using half the Parmesan, spread piles of cheese onto a silicon sheet and grill until melted and golden – if the cheese is spread too thinly it will burn. Remove and leave to cool before breaking into pieces. ", "Heat the remaining 1 tablespoon oil in a large frying pan over a medium heat and cook the onion until softened. Stir in the rice and cook for 1–2 minutes. Pour in the wine and let it bubble until all the liquid has gone. Add the stock, ladle by ladle, stirring and cooking each ladleful until it has been absorbed before adding any more. Continue adding the stock and cooking like this until the rice is tender but still creamy (about 25–30 minutes). ", "Stir in the remaining cooked fennel, lemon zest and juice and plenty of seasoning. Stir in remaining Parmesan, cover and remove from the heat while you make the fritters.", "To make the fritters, beat together the soda water and egg in a bowl. Place the bowl into a larger bowl full of ice (this will keep the batter as cold as possible). Slowly stir in the cayenne pepper, baking powder, cornflour and plain flour. ", "Heat the oil in a deep saucepan until it reaches 180°C, or a cube of bread browns in 20 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the fennel wedges in the batter and deep-fry for  1–2 minutes or until golden. Drain on kitchen paper.", "Garnish the risotto with the fennel fronds and Parmesan crisps and serve with the fennel fritters."]}, {"isVegetarian": false, "title": "Fennel and asparagus 'tar-tar' with a fennel cloud", "url": "www_bbc_co_uk_food_recipes_fennel_and_asparagus_27366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large fennel bulbs, juiced", "5g ascorbic acid, also known as Vitamin C powder, available from health food shops and online", "50g/1¾oz sugar", "pinch salt ", "50g/1¾oz caster sugar ", "320ml/11fl oz strained fennel juice (from above)", "18g/½oz albumin powder", "1 leaf of gelatine, soaked in cold water", "2 tsp Pernod", "5g fennel pollen, available online (optional)", "3 spears white asparagus, peeled and sliced", "3 spears green asparagus, sliced ", "little olive oil", "lemon juice, to taste", "½ fennel bulb, grated", "1 tbsp chopped fresh tarragon", "salt and freshly ground black pepper", "3 spears green asparagus, peeled", "60g/2¼oz butter", "½ lemon, juice only", "2 tbsp beef stock", "bunch of watercress"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the fennel juice, mix all of the ingredients together.", "For the fennel cloud, line a freezer-proof dish with baking paper. Dissolve the caster sugar and 100ml/3½fl oz water in a pan, take off the heat and melt the gelatine leaf into it. ", "Whisk the fennel juice and albumina by hand, then add to a mixer with a whisk attachment. Whisk in the machine on a low speed gradually getting faster. When it has nearly tripled in volume, slow the machine down and add the sugar, gelatine and water solution. Whisk on high until stiff peaks are formed when the whisk is removed.", "Pour in the Pernod, whisk through and then pour the fennel cloud into the prepared dish. Spread the cloud flat and sprinkle with the fennel pollen, if using. Put in the freezer for 6 hours, or until frozen.", "For the tar-tar, mix the chopped asparagus and season with salt and pepper. Add a little olive oil and lemon juice. Mix in the fennel, add the tarragon and set aside.", "For the green asparagus, in a hot pan, add the butter and the asparagus. Fry until the asparagus is nearly cooked and then squeeze in a little lemon juice and the beef stock. Cook for a further 2 minutes.", "Spoon the green asparagus on to one side of a serving plate and spoon the tar-tar on the other side. Spoon the cloud on top of the tar-tar and garnish with the watercress. Serve immediately."]}, {"isVegetarian": false, "title": "Fegato di Vitello (Pan-fried calf's liver)", "url": "www_bbc_co_uk_food_recipes_fegatodivitellopanfr_86521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz Puy lentils", "4 sage leaves", "1 clove garlic", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper, to taste", "4 large chard leaves, sliced 1cm/½ inch thick", "2tbsp olive oil", "1 clove garlic, chopped", "½ tsp dried chilli flakes", "4 x 1cm/½ inch thick slices calf's liver", "50g/2oz unsalted butter", "8 sage leaves", "8 slices smoked pancetta", "4 tbsp balsamic vinegar", "4 tbsp crème fraîche"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Place the lentils, sage and one garlic clove into a pan and cover with water.", "Bring to a boil, then reduce the heat and simmer for 30 minutes until the lentils are tender. Drain and return to the pan.", "Season to taste with salt and freshly ground black pepper, a squeeze of lemon juice and the olive oil. Keep warm until needed.", "For the chard, bring another pan of salted water to the boil. Add the chard and cook for 1-2 minutes until tender. Drain and set aside.", "Heat a frying pan until hot and add the olive oil, garlic and chilli and the chard. Stir-fry for one minute.", "For the liver, heat a large frying pan, add the butter, pancetta and sage and cook for two minutes until crispy.", "Add the liver and cook for a further one minute on each side. Remove from the pan and place on serving plates.", "To make the balsamic sauce, drain off any excess fat in the frying pan and return to the heat. Add the balsamic vinegar and crème fraîche and cook for one minute, whisking to combine.", "To serve, add the braised chard to the plates, then top each plate with a spoonful of lentils.", "Spoon over the balsamic sauce."]}, {"isVegetarian": true, "title": "Fennel and potato gratin", "url": "www_bbc_co_uk_food_recipes_fennel_and_potato_gratin_29963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_potato_gratin_29963_16x9.jpg", "ingredients": ["50g/1¾oz butter, plus extra for greasing ", "3 large bulbs fennel", "3 onions", "600g/1lb 6oz large potatoes, peeled", "2 garlic cloves, crushed", "50g/1¾oz parmesan cheese, grated (or vegetarian equivalent)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 (180 fan). Butter the serving dish.", "Trim the tops from the fennel and cut each bulb in half through the root, then cut each half lengthways into three wedges. Cut the onions into six wedges too in a similar way.", "Cut the potatoes into wedges the same size as the fennel wedges.", "Boil the fennel and onions in a large pan of salted water for about five minutes, then add the potatoes and boil for a further five minutes, or until the potatoes and fennel are just tender. Drain well.", "Put the 50g/1¾oz butter and the garlic in the same large pan set over a low heat until just melted. Return the potatoes and fennel to the butter, toss until coated then tip into the ovenproof dish. Sprinkle with the parmesan. Bake for 30-40 minutes, or until piping hot."]}, {"isVegetarian": true, "title": "Fennel beetroot slaw", "url": "www_bbc_co_uk_food_recipes_fennel_beetroot_slaw_05158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_beetroot_slaw_05158_16x9.jpg", "ingredients": ["2 fennel bulbs, shredded", "½ small red cabbage, shredded", "4 beetroot, peeled and shredded", "4 spring onions, chopped", "6 tbsp soured cream", "3 tbsp nigella seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all the vegetables in a bowl with the soured cream and nigella seeds. ", "Stir and serve."]}, {"isVegetarian": true, "title": "Fennel Welsh cakes with a blueberry coulis", "url": "www_bbc_co_uk_food_recipes_fennel_welsh_cakes_with_35924", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_welsh_cakes_with_35924_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting ", "285g/10oz golden caster sugar", "½ tsp baking powder ", "1 tsp fennel seeds, crushed ", "100g/3½oz unsalted butter, cubed, plus extra for greasing ", "50g/1¾oz dried blueberries, roughly chopped ", "1 medium free-range egg, lightly beaten", "2 tbsp whole milk ", "250g/9oz fresh blueberries", "1 tbsp icing sugar ", "squeeze lemon juice "], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the Welsh cakes, mix the flour, 85g/3oz of the caster sugar, the baking powder and crushed fennel seeds together in a bowl. Add the cubed butter and use your fingertips to rub it in until the mixture resembles breadcrumbs. Add the blueberries and mix to combine. ", "Make a well in the centre and add the egg. Use a table knife to mix the egg in, then add the milk and bring the dough together with your hands. ", "Dust a clean work surface with flour and roll out the dough to 1cm/½in thickness. Cut out rounds using a 4cm/1½in round cutter, then take all the scraps, bring them together and re-roll. Cut out more rounds, and keep doing this until you have used up all the dough. Put the remaining 200g of caster sugar into a bowl. ", "Lightly brush a medium non-stick pan with a little melted butter or spray with oil. Place a batch of Welsh cakes in the pan well spaced out, and cook over a low heat for 3 minutes. Turn them over and cook for another 3 minutes, then take off the heat and immediately dip each Welsh cake into the bowl of sugar. Set aside. Do the same for the remaining Welsh cakes: cook, coat in sugar and set aside. ", "To make the coulis, purée the blueberries in a food processor with the icing sugar and lemon juice until broken down.  Then push through a sieve to remove the seeds. Serve the coulis in a small bowl alongside the Welsh cakes. "]}, {"isVegetarian": true, "title": "Fennel and goats' cheese pasties", "url": "www_bbc_co_uk_food_recipes_fennelandgoatscheese_80703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp whole fennel seeds", "2g/¼oz dried yeast ", "200ml/7fl oz warm water", "3 tbsp olive oil", "225g/8oz strong bread flour ", "4 shallots, peeled and sliced lengthways", "7 tbsp olive oil", "salt and freshly ground black pepper", "1 head garlic", "4 bulbs fennel, trimmed", "120g/4oz goats' cheese", "50g/2oz ricotta", "a little water, for sealing", "1 egg, beaten, for brushing"], "serves": "Makes 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Pre-heat oven to 220C/425F/Gas 7.", "For the dough, heat a small frying pan and add the fennel seeds. Carefully heat the seeds (they may pop) until they release their aroma. Do not let them burn. Remove seeds from pan and crush in a pestle and mortar while still warm.", "Add the dried yeast to the warm water to activate.", "Add the olive oil to the flour and mix in the yeast and water mixture and the fennel seeds. Bring the ingredients together in a bowl to form a dough. On a flat surface, knead the dough for approximately two minutes, adding a little more flour to the kneading surface if the dough feels sticky and your wetting hands a little while kneading if it feels dry and unmalleable. Place dough in a bowl, cover with a damp cloth and put to one side.", "For the filling, toss the shallots in a bowl with two tablespoons of olive oil and season with salt and freshly ground black pepper. Spread out in a single layer on a baking tray. Split the head of garlic into separate cloves and toss in the same small bowl with two tablespoons of the olive oil. Season with salt and freshly ground black pepper. Place the unpeeled garlic cloves on the baking tray. Bake in the oven for about 20 minutes. The shallots should be turning brown at the edges and drying out. The garlic should be a pale golden colour.", "Cut the fennel bulbs in half, then cut away some of the heart. Slice the fennel thinly crossways. Heat the remaining 3 tablespoons of olive oil in a saucepan, add the fennel and cook over a medium heat, stirring frequently, until soft, golden and reduced in volume.", "When the garlic and shallots are cooked, remove from baking tray and allow to cool. Roughly chop the shallots. Peel the garlic and add the soft flesh from inside the cloves, along with the chopped shallots, to the fennel. When the mixture has cooled further, crumble the goats' cheese and the ricotta into the fennel mixture.", "Roll out dough thinly onto a floured work surface. Cut out four 16cm/6.5-inch rounds. Divide the fennel and cheese mixture among the four pastry rounds. Place the filling in the middle of each and fold the pastry in half, sealing the edges with a little water. ", "Place the pasties on a baking tray and place in the oven. Bake for about 20-30 minutes. If the pasties are browning too quickly, turn the heat down slightly and increase the cooking time. Towards the end of cooking, brush the surface of each pasty with the beaten egg and cook for a final five minutes. The pasties should be a lovely golden brown. Remove from the oven, allow to cool slightly, and serve."]}, {"isVegetarian": false, "title": "Fennel and herb barbecued whole fish", "url": "www_bbc_co_uk_food_recipes_fennelandherbbarbecu_67598", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelandherbbarbecu_67598_16x9.jpg", "ingredients": ["4 whole fish (such as sea bass, sea bream, trout or red mullet), approx. 350-450g/12oz-1lb each, gutted and scaled ", "1 large lemon", "1 large orange", "1 medium bulb of fennel, roughly chopped", "4 garlic cloves, peeled", "1 medium red onion, roughly chopped", "3 tbsp capers, drained", "2 large handfuls of mixed fresh herbs - parsley, dill, tarragon, basil", "extra virgin olive oil", "flaked sea salt and freshly ground black pepper", "salad and crusty bread, to serve", "You will need 12-16 lengths of string about 15cm/6in long, soaked in water for 1 hour."], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Wash the fish inside and out, then pat dry with kitchen paper.", "Finely grate half of the zest from the lemon and orange, then slice both fruit thinly. Place the grated zest in a food processor with the fennel, garlic, onion, capers, herbs, a good glug of olive oil and seasoning, and blitz until finely chopped. Pack the mixture into the fish and fold a few lemon and orange slices around it to hold the stuffing in. Tie 3-4 pieces of string around the fish to hold the orange and lemon slices in place. Cut off any excess string and sit the fish on a large plate.", "Drizzle the outside of the fish with olive oil and season with salt and pepper. It's now best left at room temperature for about 45 minutes, or in the fridge for up to 4 hours, to allow the stuffing flavours to infuse the fish. If you're short on time you can put it straight on the barbecue.", "The easiest way to cook a whole fish is to place it in single-wire fish racks with handles, making it easier to turn over during cooking. Place over medium-hot coals for 15-20 minutes, turning halfway through. ", "Serve straight away with a lovely green or tomato salad and crusty bread to mop up any fishy juices."]}, {"isVegetarian": true, "title": "Fennel and leek soup", "url": "www_bbc_co_uk_food_recipes_fennelandleeksoup_85992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ onion, finely sliced", "½ fennel bulb, trimmed and sliced", "2 baby leeks, trimmed and chopped", "1 garlic clove, finely chopped", "200ml/7fl oz hot chicken stock (vegetarians can substitute vegetable stock)", "75ml/2½fl oz double cream", "2 tbsp chopped fresh chives ", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan, add the onion, fennel and leeks and fry gently until softened slightly. Add the garlic and fry for one minute.", "Add the stock and bring to the boil. Reduce the heat and simmer for 6-8 minutes, or until the vegetables are tender. Remove from the heat and allow to cool slightly.", "Pour the soup into a blender. Add the cream, half of the chives and the lemon juice. Season, to taste, with salt and freshly ground black pepper and blend until smooth.", "To serve, pour the soup into a bowl and garnish with the remaining chives."]}, {"isVegetarian": true, "title": "Fennel and mushroom tartlets", "url": "www_bbc_co_uk_food_recipes_fennelandmushroomtar_71555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelandmushroomtar_71555_16x9.jpg", "ingredients": ["225g/8oz shortcrust pastry", "175g/6oz mushrooms, ideally mixed, such as brown caps, shiitake, oysters, trimmed where necessary", "1 red onion, cut into 8 wedges", "1 bulb fennel, cut into 1cm/0.5in slices, blanched and drained.", "6 cloves garlic, lightly crushed in their skins", "light olive oil", "100ml/3½fl oz whipping cream", "100g/4oz unsalted butter, chilled and diced", "1 tbsp lemon juice", "1 tbsp snipped fresh chives", "1 tbsp chopped parsley", "a handful of herby salad"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Grease 4 x 10 cm/4 in tartlet tins.  Roll out the pastry to about 3 mm/1/8 in thick, and use to line the prepared tartlet tins.  ", "Chill the lined tins for at least 30 minutes in the fridge.", "Preheat the oven to 180C/375F/Gas 4.", "Cover the pastry with greaseproof paper, fill with baking beans, and bake for 10-15 minutes, until cooked and light brown. Remove from oven.  Remove the paper and the beans and set aside.", "Turn the oven up to 220C/425F/Gas 7.", "Place all the vegetables and garlic on a baking sheet, drizzle with the light olive oil, and toss gently.  Season with salt and pepper and bake in a hot oven for twenty minutes, or until lightly browned.", "To make the sauce, bring the cream to the boil in a small pan.  Whisk in the butter, and add the lemon juice, herbs, and salt and pepper to taste.  ", "Take two garlic cloves from the vegetables, tease out the roast garlic from the skins, and mash it with the point of a knife.  Add this rough mash to the cream mixture.", "To serve, fill each pre-baked tartlet shell with the vegetable mixture.  ", "Heat the tarts for a minute or two in the oven, and then present on warmed plates, surrounded with a little sauce.", "Serve with herby salad."]}, {"isVegetarian": true, "title": "Fennel and orange salad", "url": "www_bbc_co_uk_food_recipes_fennelandorangesalad_82372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium fennel bulbs", "1½ oranges", "½ lemon, juice only", "extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut off the tops of the fennel bulbs and slice thinly into rings. Place into a large bowl.", "Cut away the skin and pith from one orange and slice into circles 1cm/½in thick. Add to the fennel.", "Make the salad dressing by mixing the orange juice from half the orange, the lemon juice, an equal amount of olive oil and salt and freshly ground black pepper. ", "Drizzle over the fennel and orange and serve."]}, {"isVegetarian": false, "title": "Fennel and saffron broth with pan-fried trout darnes and fennel frond tempura", "url": "www_bbc_co_uk_food_recipes_fennelandsaffronbrot_92949", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/11fl oz vegetable stock", "½ tsp saffron threads", "2 tbsp pastis", "50g/2oz butter", "2 fennel bulbs with green fronds attached, fennel chopped in 1cm/½in pieces, fronds reserved", "2 banana shallots, peeled,  finely sliced into rings", "150ml/5fl oz dry white wine", "salt and freshly ground black pepper", "3 tbsp chopped fresh chives", "vegetable oil for frying", "2 tbsp cornflour", "2 tbsp chilled sparkling water", "reserved fennel fronds from fennel bulbs (see above)", "pinch salt", "4 x 175g/6oz trout darne", "salt and freshly ground black pepper", "25g/1oz butter", "1 tbsp olive oil", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fennel and saffron broth, bring the stock, saffron and pastis to the boil.", "Meanwhile, heat half of the butter in a frying pan and fry the fennel and shallots over a low heat for 2-3 minutes, or until softened.", "Pour in the white wine, bring to the boil and continue to cook until the volume of the liquid has reduced by half.", "Add the stock mixture to the pan and bring to the boil. Reduce the heat until the mixture is simmering and simmer for 1-2  minutes. Whisk in the remaining butter and season, to taste, with salt and freshly ground black pepper. Stir in the chives and set aside.", "For the fennel frond tempura, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Whisk the cornflour and sparkling water together in a bowl to form a smooth batter. Dip the fennel fronds into the batter,  shaking off any excess, then fry in the vegetable oil for 20-30 seconds until pale golden-brown and crisp. (Do this is batches if necessary.)", "Remove from the oil with a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt.", "For the trout darnes, season the trout, to taste, with salt and freshly ground black pepper.", "Heat the butter and oil in a frying pan and fry the trout darnes for 2-3 minutes on each side, or until cooked through.", "Remove the trout darnes from the pan and set aside to rest. Squeeze over lemon juice, to taste.", "To serve, reheat the fennel and saffron broth, if necessary, and ladle into four shallow soup bowls. Top each with a trout darne and some fennel frond tempura."]}]