[{"isVegetarian": false, "title": "Tortilla de Arnold Bennett", "url": "www_bbc_co_uk_food_recipes_arnoldbennettishomel_93629", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de filete de abadejo sin teñir ahumado, con piel, pin boned", "100ml / 3½ fl oz de leche", "botón de mantequilla", "2 hojas frescas de laurel", "8-10 granos de pimienta negra", "2 cucharadas de crema", "1 limón, ralladura solamente", "55 g / 2 oz de queso parmesano, finamente rallado", "cebollín fresco pequeño, finamente picado", "sal marina y pimienta negra recién molida", "3 huevos grandes de gallinas camperas, golpeados", "perilla de mantequilla sin sal", "2 cucharadas de aceite de oliva virgen extra", "pequeño puñado de berros frescos", "1 cucharada de jugo de limón"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el filete de eglefino en un plato resistente al horno, vierta sobre la leche y agregue la mantequilla, las hojas de laurel y los granos de pimienta.", "Transfiera al horno y cocine por 10-12 minutos, luego retírelo del horno y déjelo enfriar un poco.", "Mientras tanto, mezcle la crème fraîche con la ralladura de limón, el parmesano rallado y la mayoría de las cebolletas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente la mantequilla con la mitad del aceite en una sartén grande a prueba de horno a fuego medio, y vierta los huevos, revolviendo ligeramente mientras se cocinan para aflojarlos de los lados de la sartén.", "Saque el eglefino de la piel mientras los huevos se cocinan, teniendo cuidado de eliminar los huesos restantes.", "Cuando los huevos aún estén ligeramente mocos en la parte superior pero hayan comenzado a asentarse, extiéndalos sobre la mezcla crème fraîche, luego esparza sobre el eglefino y transfiera la tortilla al horno durante 4-5 minutos o hasta que esté cocida y ligeramente levantada. Retire del horno.", "Para servir, rocíe el aceite restante sobre el berro en un tazón pequeño y agregue el jugo de limón, volteando para cubrir las hojas. Deslice la tortilla en un plato para servir, espolvoree el cebollín que queda y coloque el berro en un lado."]}, {"isVegetarian": false, "title": "Curry de carne de vaca aromático", "url": "www_bbc_co_uk_food_recipes_aromatic_beef_curry_90850", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_90850_16x9.jpg", "ingredients": ["125ml / 4fl oz ghee o aceite vegetal", "Filete de ternera a la plancha de 400 g / 14 oz, cortado en dados en trozos de 3 cm", "1 cebolla mediana, cortada en cubitos", "2 dientes de ajo, finamente picados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de cúrcuma molida", "1 cucharadita de pimienta negra molida", "1 cucharadita de chile en polvo", "½ cucharadita de jengibre molido", "3 dientes", "3 cápsulas de cardamomo (opcional)", "½ cucharadita de canela molida", "½ x 400 g / 14 oz pueden cortar tomates", "125 g / 4½ oz de yogur natural", "1 cucharada de vinagre", "sal", "azúcar pizca"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar una sartén con tapa a fuego medio y agregar el ghee o aceite. Freír la carne hasta que se dore ligeramente por todos lados, luego retire de la sartén con una cuchara ranurada, cubra y reserve.", "Agregue la cebolla y el ajo a la sartén y freír a fuego lento hasta que estén suaves. Encienda el fuego ligeramente, agregue las especias y fría por 1 minuto, deberían comenzar a oler aromáticamente, sin quemarse.", "Regrese la carne a la sartén, agregue los tomates y deje que hierva. Saque la olla del fuego y agregue el yogur y el vinagre, luego sazone al gusto con la sal y el azúcar.", "Regrese la sartén al fuego, vuelva a hervir y cocine a fuego lento, tapado, durante 1 hora y media o hasta que la carne esté tierna."]}, {"isVegetarian": false, "title": "Pollo verde tailandés aromático y curry de verduras de otoño", "url": "www_bbc_co_uk_food_recipes_aromatic_thai_green_31771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "Jengibre fresco de 2 cm / 1 onza, finamente picado", "8 muslos de pollo, sin piel, deshuesados ​​y cortados en trozos de 3cm / 1¼ en trozos", "100g / 3½oz de pasta de curry verde tailandesa", "1/2 calabaza, pelada, sin semillas y cortada en trozos de 3cm / 1¼ pulgadas", "1 camote grande, pelado y cortado en trozos de 3cm / 1¼ en", "1 berenjena pequeña, con el extremo retirado y cortado en trozos de 3cm / 1¼in", "1 calabacín cortado en trozos de 3cm / 1¼ en", "200ml / 7fl oz de leche de coco", "200ml / 7fl oz de caldo de pollo", "100ml / 3½ fl oz crema doble", "Frijoles verdes finos de 100g / 3½oz cortados en longitudes de 2cm / 1in", "400g / 14oz de arroz basmati", "Harina simple 400g / 14oz", "2 cucharaditas de sal marina", "2 cucharadas de aceite de oliva, más extra para freír", "salpicaduras de agua tibia para unir la mezcla", "2 cucharadas de cilantro fresco tostado", "4 cebollas de primavera, sin raíz y finamente cortadas"], "serves": "", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén grande y, una vez caliente, agregue el aceite y luego la cebolla, el ajo y el jengibre. Cocine por cuatro minutos, luego agregue los muslos de pollo y cocine por otros 3-4 minutos. Agregue la pasta de curry tailandés y cocine por 3-4 minutos más.", "Agregue la calabaza, el boniato, la berenjena y el calabacín. Revuelva y agregue la leche de coco y el caldo de pollo.", "Cocine por 15 minutos, luego agregue la crema y los frijoles. Cocine por otros 10 minutos.", "Mientras tanto, ponga el arroz en una olla grande y cocínelo según las instrucciones del paquete.", "Para el pan plano, coloca la harina, la sal y el aceite en un tazón grande y agrega suficiente agua para unirlos y formar una masa. Amasar hasta que quede suave y luego dividir en cuatro bolas.", "Hierva una superficie de trabajo y despliegue cada bola en un círculo grande.", "Caliente una plancha o sartén y agregue el aceite. Uno a la vez, coloque cada pan plano en la sartén y cocine en ambos lados durante unos minutos.", "Para servir, coloque el arroz en platos para servir cubiertos con el curry. Coloque el pan a un lado y adorne con cilantro fresco y cebolletas."]}, {"isVegetarian": true, "title": "Curry de frijol negro eyed aromático", "url": "www_bbc_co_uk_food_recipes_aromaticblackeyebean_73019", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromaticblackeyebean_73019_16x9.jpg", "ingredients": ["2 latas de 410g / 14oz de frijoles de ojos negros (o use 225g / 8oz de frijoles secos, remojados durante la noche y cocinados)", "1 cucharada de semillas de comino", "1 cucharada de semillas de cilantro", "1 cucharadita de semillas de hinojo", "¼ cucharadita de semillas de fenogreco", "1cm / ½en varilla de canela", "½ - 2 cucharaditas de hojuelas de chile molido", "4 cucharadas de aceite vegetal", "1 cucharadita de semillas de mostaza negra", "10 hojas de curry (frescas o secas)", "1 cebolla mediana, finamente picada", "2 dientes de ajo, aplastados", "Jengibre fresco de 5 cm / 2 pulgadas, rallado", "sal al gusto", "550ml / 1 agua picante", "2 cucharadas de hojas de cilantro", "2 cucharadas de coco fresco, rallado (opcional, pero no usar desecado)"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Escurra y enjuague los frijoles, y mezcle un poco con un tenedor.", "Coloque las semillas de comino, cilantro, hinojo y fenogreco con la rama de canela en una sartén pequeña de base pesada. Asar a fuego medio, revolviendo frecuentemente hasta que las especias cambien de color y se vuelvan aromáticas, teniendo cuidado de no quemarlas.", "Moler las especias tostadas en un polvo fino en un molinillo de café, y agregar escamas de chile molido.", "Calentar el aceite a fuego medio. Cuando esté caliente, agregue las semillas de mostaza y las hojas de curry. Retire la sartén inmediatamente del fuego, cúbrala y deje que las semillas y las hojas crepiten y exploten.", "Vuelva a poner la sartén sobre fuego, agregue la cebolla y cocínela hasta que esté dorada. Agregue el jengibre y el ajo, y cocine por otros 30 segundos.", "Agregue los frijoles, la mezcla de especias molidas, la sal y el agua y deje que hierva.", "Baja el fuego a fuego lento, tapa y cocina a fuego lento durante 20 minutos.", "Cubra con hojas de cilantro y coco fresco, si está usando, y sirva con arroz o panes planos."]}, {"isVegetarian": true, "title": "Cuscús aromático", "url": "www_bbc_co_uk_food_recipes_aromaticcouscous_86271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 calabacín, rebanado longitudinalmente", "½ pimiento rojo, cortado en tiras", "aceite de oliva, para lloviznar", "200g / 7oz de cuscús, cocido según las instrucciones del paquete", "1 naranja, jugo y ralladura", "1 limón, jugo y ralladura", "pequeñas hierbas mixtas frescas como el perejil, la menta, la albahaca y el cilantro, picadas", "2 cucharadas de aceitunas negras, piedras quitadas", "2 cucharadas de piñones", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Frote las rodajas de calabacín y pimiento rojo con aceite de oliva. Caliente una sartén a la plancha y pásele el calabacín y las piezas de pimiento durante 2-3 minutos, volteándolas con frecuencia, hasta que se suavicen y se quemen ligeramente por todas partes. Retirar del fuego y cortar en trozos pequeños.", "Coloque el cuscús en un tazón grande. Agregue el calabacín y los trozos de pimienta y todos los ingredientes restantes y mezcle bien.", "Para servir, coloque en un plato de servir."]}, {"isVegetarian": false, "title": "Salmón aromático cocinado en leche de coco", "url": "www_bbc_co_uk_food_recipes_aromaticsalmoncooked_1608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 filetes de salmón gruesos", "Jengibre de raíz de 2.5cm / 1in, pelado y cortado en rodajas pequeñas y muy finas", "2 dientes grandes de ajo, pelados y cortados en rodajas pequeñas y muy finas", "Tomates 350g / 12oz, pelados y partidos por la mitad", "1 chile rojo fresco, sin semillas y en rodajas lo más finamente posible", "1 pimiento amarillo pequeño, sin semillas y en rodajas finas", "4-6 vainas de cardamomo, más o menos trituradas", "400ml / 14fl oz de leche de coco enlatada", "sal marina", "2 limas, solo jugo", "puñado de hojas de menta fresca, picada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque los filetes de pescado en un plato a prueba de horno bastante poco profundo con una tapa, en la que encajen bastante de cerca.", "Esparce el jengibre, el ajo, el tomate, el chile y la pimienta amarilla sobre y alrededor del pescado y las vainas de cardamomo en el medio.", "Vacíe la leche de coco en un recipiente aparte, agregue una buena cantidad de sal marina y agregue gradualmente el jugo de limón. Vierta la mezcla suavemente sobre y alrededor del pescado y cubra el plato.", "Precaliente el horno a 150C / 300F / Gas 2. Coloque el plato en el estante central y cocine durante 40-50 minutos, hasta que el pescado esté ligeramente hecho. Para descubrirlo, inserte un cuchillo pequeño y filoso en el centro de uno de los filetes; si la carne es un poco más oscura, en el centro estará perfectamente cocida. Retire del horno.", "Antes de servir, esparza las hojas de menta encima."]}, {"isVegetarian": true, "title": "Un regreso al Bosque Negro", "url": "www_bbc_co_uk_food_recipes_areturntotheblackfor_67199", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g / 8 oz de chocolate negro (75 por ciento de sólidos de cacao)", "2 huevos grandes, separados", "1 jarra sin hueso cerezas morello", "2 cucharadas de aguardiente de cereza", "Crema doble 225ml / 8fl oz", "6 huevos grandes, separados", "150 g / 5 oz de azúcar en polvo", "50 g / 2 oz de cacao en polvo, tamizado", "100 g / 3½ oz de chocolate negro (75% de sólidos de cacao)", "1 cucharada de flor morello cherry jam", "un poco de cacao en polvo"], "serves": "Sirve 10-12", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Rompa el chocolate en un recipiente y agregue 2 cucharadas de agua. Coloque el recipiente sobre una cacerola con agua apenas hervida, asegurándose de que el recipiente no esté tocando el agua. Retire la sartén del fuego y espere a que se derrita el chocolate antes de batirla con una cuchara de madera hasta que quede suave.", "A continuación, batir las 2 yemas de huevo, primero por su cuenta y luego en la mezcla de chocolate caliente. Tan pronto como la mezcla se haya enfriado, bata las claras de huevo hasta la etapa de pico suave y dóblelas suavemente en la mezcla de chocolate. Cubra el recipiente con film transparente y déjelo en la nevera durante al menos una hora.", "Escurra las cerezas, deseche el almíbar, luego colóquelas en un plato poco profundo, ponga una cuchara sobre el brandy de cereza y déjelas a un lado hasta que las necesite.", "Para hacer la base: primero coloque las yemas de huevo en un bol y batalas con un batidor de mano eléctrico hasta que comiencen a espesarse. A continuación, agregue el azúcar impalpable y continúe batiendo, pero tenga cuidado de no exagerar, deténgase cuando caiga del batidor en cintas. Ahora dobla el cacao en polvo tamizado. Luego, usando un recipiente limpio y batidores, bata las claras de huevo hasta la etapa de pico suave. Luego tome 1 cucharada grande, dóblelo en la mezcla de chocolate para aflojarlo, y doble suavemente el resto de las claras de huevo.", "Ahora vierta la mezcla en la lata preparada y hornee la torta en el medio del horno durante unos 20 minutos o hasta que esté elástica en el centro. Se verá muy hinchado, pero un pequeño dedo suavemente presionado en el centro debería revelar que está cocinado. Es importante no sobrecocinarlo, de lo contrario será difícil rodar.", "Retírelo del horno y déjelo hasta que esté absolutamente frío, luego apáguelo sobre una hoja de papel resistente a la grasa, que ha sido ligeramente espolvoreada con polvo de cacao tamizado. Luego, retire con cuidado el papel de silicona.", "Escurra las cerezas nuevamente en un colador colocado sobre un recipiente para atrapar el brandy y espolvoree todo menos 1 cucharada de licor por toda la base. A continuación, retire el relleno de chocolate de la nevera y extiéndalo con cuidado sobre la superficie de la base. A continuación, batir suavemente la crema doble y extenderla sobre el relleno de chocolate, dejando un borde de 2,5 cm / 1 pulgada alrededor, luego presionar las cerezas en la crema.", "Sujete un borde del papel antigrasa debajo del pastel, levántelo y, a medida que lo levante, comenzará a aparecer. Simplemente gírelo, tirando del papel mientras rueda.", "Derretir el chocolate como antes, teniendo mucho cuidado de no sobrecalentarlo, luego verterlo sobre un plato vuelto hacia arriba de 15 cm de diámetro. Luego colóquelo en la nevera durante aproximadamente 45 minutos hasta que esté listo. El chocolate debe ser firme cuando lo toques.", "Para hacer los rizos use una cortadora de queso o un cuchillo muy afilado. Comience en un extremo y simplemente tire de la cortadora o cuchillo a lo largo de la superficie del chocolate hacia usted hasta que se formen los rizos. Colóquelos en un recipiente de plástico. Pon el contenedor en la nevera.", "Ahora puedes decorar el pastel: coloca la mermelada en una cacerola pequeña, agrega el licor reservado, cálmate suavemente y luego cepilla sobre la superficie. Coloque los rizos de chocolate por todas partes. Finalmente, aplique un poco de polvo de cacao en la superficie."]}, {"isVegetarian": false, "title": "Hotpot de vientre de cerdo aromático", "url": "www_bbc_co_uk_food_recipes_aromaticporkbellyhot_10468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1,5 kg / 3lb 5 oz de cerdo de vientre, con la corteza todavía en", "570ml / 1 litro de carne de cerdo o pollo (si está disponible, de lo contrario, agua)", "12 cebollas de primavera", "100 ml / 3½ fl oz de salsa de soja ligera", "75ml / 2½fl oz de vino de arroz chino", "25ml / 1fl oz de vinagre de vino de arroz", "2 cucharadas de azúcar demerara (o marrón claro)", "Anís de 3 estrellas", "10cm / 4in pedazo de raíz de jengibre fresco, pelado y cortado en rodajas", "una buena pizca de copos de chile seco"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cortar el vientre de cerdo en trozos rectangulares grandes (2,5x5 cm / 1x2 in), poner en una sartén grande, verter sobre suficiente agua hirviendo solo para cubrir, luego llevar de nuevo a ebullición. Cocine a fuego lento durante unos 5 minutos, rozando la espuma que sube a la superficie, luego drene a través de un colador.", "Enjuague la bandeja si es necesario, devuelva la carne de cerdo y vierta suficiente caldo hirviendo (si está disponible) o agua para cubrirla nuevamente.", "Corte 5 de las cebolletas por la mitad y agregue a la sartén con la salsa de soja, el vino de arroz, el vinagre, el azúcar, el anís estrellado, el jengibre y las hojuelas de chile. Cubra herméticamente y cocine a fuego lento muy lentamente durante aproximadamente 2 horas, volteando la carne de vez en cuando, hasta que el cerdo esté muy tierno, suave y suculento.", "Retire la carne de cerdo con una espumadera y déjela a un lado. Cuele el líquido de cocción, idealmente a través de muselina o un buen chino, en una sartén limpia. Elimina toda la grasa que puedas (pero no te preocupes por dejar un poco), luego hierve el caldo duro para reducir y concentrar los sabores. Debe ser ligeramente almibarado e intensamente aromático, pero no se reduzca demasiado, ya que la salsa de soja puede hacerlo muy salado.", "Corta finamente las cebolletas restantes en la diagonal. Regrese la carne de cerdo a la salsa y caliente.", "Sirva sobre fideos simples en un cuenco de sopa calentado, con mucha salsa servida sobre la carne, y las rodajas de cebollas repartidas por la carne."]}, {"isVegetarian": false, "title": "Espagueti de albóndigas de cerdo Arrabiata", "url": "www_bbc_co_uk_food_recipes_arrabiataporkmeatbal_90149", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 400g / 14oz latas de tomates", "3 cucharadas de aceite de oliva virgen extra", "2 dientes de ajo, finamente picados", "1 cucharadita de hojuelas de chile seco", "4 cucharadas de albahaca fresca picada", "sal y pimienta negra recién molida", "1 cucharadita de azúcar en polvo", "500 g / 1lb 2 oz de carne picada de cerdo", "Tocino rayado de 90 g / 3 oz, finamente picado", "2 cucharaditas de hojas de tomillo", "2 cucharadas de perejil de flatleaf, aproximadamente picado", "300g / 10½oz de espagueti seco"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén hasta que esté caliente, luego agregue los tomates y el aceite de oliva y cocine a fuego lento.", "Agregue el ajo, el chile y la mitad de la albahaca y cocine durante 10 minutos, hasta que se reduzca y espese. Sazonar, al gusto, con sal, pimienta negra recién molida y un poco de azúcar.", "Coloque la carne picada de cerdo, el tocino, el tomillo y el perejil en un recipiente y mezcle bien. Sazone con un poco de sal y mucha pimienta negra recién molida.", "Divida la mezcla en 16 y dé forma a cada porción en una bola pequeña, usando sus manos.", "Coloque las albóndigas en la salsa de tomate y cocine a fuego lento durante 5-8 minutos, o hasta que las albóndigas estén completamente cocidas.", "Mientras tanto, trae una olla grande de agua con sal a ebullición. Agregue los espaguetis y cocine según las instrucciones del paquete.", "Escurra los espaguetis, luego agregue la salsa de tomate y albóndiga. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar la albahaca restante.", "Para servir, coloca porciones iguales de los spaghetti y las albóndigas en los cuencos calentados."]}, {"isVegetarian": false, "title": "Arroz verde", "url": "www_bbc_co_uk_food_recipes_arroz_verde_49624", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arroz_verde_49624_16x9.jpg", "ingredients": ["1 kg / 2 lb 4 oz de huesos de pescado, como suela de limón, brill y solla", "1 cebolla, más o menos picada", "1 bulbo de hinojo, aproximadamente picado", "100g / 3½oz de apio, en rodajas", "100 g / 3½ oz de zanahoria, aproximadamente picada", "25g / 1 oz de champiñones, en rodajas", "1 ramita de tomillo fresco", "4 cucharadas de aceite de oliva", "60g / 2¼ oz de chalotes, finamente picados", "12 dientes de ajo, finamente picados", "1 litro / 1¾ pintas de caldo de pescado (ver arriba)", "100g / 3½ oz de perejil de flatillo finamente picado", "1½ cucharadita de sal", "Arroz de paella de grano corto de 400 g / 14 oz, como calasparra", "30 almejas crudas, preferentemente palourdes (vongole), restregadas", "200g / 7oz de gambas crudas, peladas", "4 dientes de ajo, aplastados", "½ cucharadita de sal de mesa fina", "1 yema de huevo de rango medio", "175ml / 6fl oz de aceite de oliva virgen extra"], "serves": "Sirve 4-5", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el caldo de pescado, ponga todos los ingredientes y 2½ litros / 4½ pintas de agua en una sartén grande y cocine a fuego lento durante 30 minutos. Colar a través de un tamiz fino o forrado de muselina. Si no lo usa de inmediato, deje enfriar, luego refrigere o congele.", "Para el arroz verde, caliente el aceite en una cacerola a prueba de fuego de 28-30 cm / 11-12 a fuego medio. Agregue las chalotas y fría por 5 minutos, o hasta que estén suaves. Agregue el ajo y fría por 40-60 segundos, luego mezcle el caldo de pescado, el perejil y la sal y deje que hierva.", "Espolvorea el arroz, revuelve una vez, luego deja hervir a fuego lento a fuego medio-alto durante 6 minutos. Coloque las almejas y las gambas encima y agite brevemente la sartén para que se hundan un poco en el arroz. Baje el fuego y cocine a fuego lento durante 12 minutos. Casi todo el líquido debe ser absorbido y el arroz debe estar lleno de agujeros pequeños. Deseche cualquier almeja que no se abra después de la cocción.", "Mientras tanto, para el alioli, mezcle el ajo y la sal para formar una pasta. Coloque un procesador de alimentos y agregue la yema. Encienda la máquina y muy lentamente gotee el aceite a través del orificio de la tapa hasta que tenga una emulsión espesa.", "Sirve el arroz verde con el alioli."]}, {"isVegetarian": false, "title": "Alcachofa a la Parisienne con salsa bordelaise", "url": "www_bbc_co_uk_food_recipes_artichoke__la_parisienne_80499", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chalotes de plátano", "50ml / 2fl oz de aceite de oliva, más extra para lloviznar", "Tomillo de 10g / ¼oz", "100 g / 3½ oz de mantequilla", "1 botella de vino tinto, preferiblemente Merlot", "500ml / 18fl oz de carne de ternera", "10 baby alcachofas", "1 limón, solo jugo", "6 rebanadas de prosciutto cotto", "2 burrata", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa, cortar finamente 6 de los chalotes. Calentar el aceite en una sartén de fondo grueso. Sudor las chalotas y la mitad del tomillo con una pizca de sal y mantequilla hasta que estén translúcidos.", "Agregue el vino y reduzca hasta obtener una consistencia de jarabe, luego agregue el caldo de ternera y la estación. Pase a través de un colador fino y reduzca a una consistencia de salsa.", "Mientras tanto, pele las hojas secas exteriores de las alcachofas y deséchelas. Corta la parte superior y pélalo en el corazón con un cuchillo pequeño. Mezcle el jugo de limón con agua fría y mantenga las alcachofas peladas en el agua para mantener su color.", "Dice el jamón y los chalotes restantes. Drene las alcachofas. Usa una mandolina para cortar las alcachofas a lo largo. Sudor el jamón y las chalotas en la mantequilla restante y agregue las alcachofas en rodajas (guarde unas rodajas para adornar).", "Cortar la burrata por la mitad y sazonar con aceite de oliva, sal y un toque de pimienta negra.", "Vierta la alcachofa cocida sobre la burrata y termine con la salsa. Vierta unas rodajas de alcachofas crudas con aceite de oliva y adorne en la parte superior."]}, {"isVegetarian": true, "title": "Alcachofa y risotto de habas", "url": "www_bbc_co_uk_food_recipes_artichoke_and_broad_bean_49121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 alcachofas púrpuras del bebé", "1 limón, cortado por la mitad, la mitad restante intacta, una mitad zested y jugo", "200ml / 7fl oz de aceite de oliva virgen extra", "25g / 1oz de mantequilla", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "3 ramitas de tomillo fresco, solo hojas", "100g / 3½ oz de arroz risotto", "200ml / 7fl oz de vino blanco", "750ml / 1¼ pintas de pollo o caldo de verduras, calentado", "Habas, pieles y membranas internas de 150 g / 5 oz.", "4 cucharadas colmadas de parmesano recién rallado (o alternativa vegetariana), más extra para servir", "2 cucharadas de cebollines frescos finamente picados", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "1 flor de cebolleta, hojas separadas, para servir (opcional)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pele los tallos de una alcachofa, luego corte el tercio superior del bulbo y deséchelo. Inmediatamente frote la alcachofa por todos lados con la mitad intacta del limón cortado para evitar que se dore. Repita el proceso con las alcachofas restantes.", "Traiga 200 ml / 7 fl oz de agua y todo el aceite de oliva a ebullición en una olla con tapa. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Cortar las alcachofas por la mitad a lo largo y agregarlas a la sartén. Cubra la olla con la tapa y cocine a fuego lento durante 10-15 minutos, o hasta que las alcachofas estén tiernas (cuando las perfora con la punta de un cuchillo no debería haber resistencia).", "Retire las alcachofas de la sartén con una espumadera y déjelas a un lado para que se enfríen un poco, luego vuelva a cortarlas a la mitad.", "Mientras tanto, caliente la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los chalotes, el ajo y el tomillo y fría por 1-2 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el arroz y mezcle bien para cubrirlo con la mantequilla. Cocine por un par de minutos, luego vierta el vino blanco y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Agregue un par de cucharadas de caldo a la sartén a la vez y devuelva la mezcla a fuego lento cada vez, revolviendo ocasionalmente, hasta que el arroz haya absorbido todo el caldo. Continúe agregando caldo y deje que el arroz lo absorba durante 5-6 minutos, luego agregue las habas y continúe agregando cucharones de caldo hasta que el arroz haya absorbido la reserva, la mezcla esté suelta y el arroz esté tierno; esto debería tomar de 12 a 15 minutos.", "Cuando el arroz esté cocido, agregue las alcachofas, el parmesano, el cebollín, la ralladura de limón y el jugo y la crema. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva el risotto con parmesano extra rallado en la parte superior, y adornado con las hojas de la flor de cebollino, si se usa."]}, {"isVegetarian": true, "title": "Alcachofa y salsa de limón", "url": "www_bbc_co_uk_food_recipes_artichoke_and_lemon_dip_66140", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g / 1 oz de queso parmesano (o un queso duro vegetariano similar), roto en trozos", "1 diente de ajo grande, aproximadamente picado", "Corazones de alcachofa a la parrilla 175 g / 6 oz, peso escurrido, más o menos picados", "1 limón pequeño en conserva, pulpa y pepitas retiradas, picadas", "pequeño puñado de hojas de perejil, más o menos picadas, más extra para decorar", "100ml / 3½fl oz de aceite de oliva virgen extra", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Ponga el parmesano y el ajo en el tazón de un procesador de alimentos y pulse hasta la consistencia de las migas de pan gruesas. Agregue las alcachofas drenadas, conserva el limón y el perejil y vuelva a hacer zumbar.", "Poco a poco agregue el aceite de oliva en una corriente constante hasta que la mezcla alcance una consistencia difuminable (es posible que no necesite todo el aceite). Sazone al gusto con jugo de limón, sal y pimienta negra recién molida. Poner en un bol y espolvorear con perejil extra."]}, {"isVegetarian": true, "title": "Alcachofa, arroz con alubias y guisantes", "url": "www_bbc_co_uk_food_recipes_artichoke_broad_bean_and_32691", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 limón, jugo solo o 1 cucharada de vinagre de vino blanco", "3 alcachofas globo", "1,2 litros / 2 pintas de caldo de verduras", "40 g / 1½ oz de mantequilla", "3 cucharadas de aceite de oliva", "1 cebolla picada", "1 diente de ajo, picado o rallado", "300 g / 10½ oz de arroz Arborio o carnaroli", "125ml / 4fl oz de vino blanco seco", "200 g / 7 oz de habas frescas, dobladas en dos si no jóvenes (600-700 g / 1 lb 5 oz-1 lb 9 oz de peso en las vainas)", "200 g / 7 oz de guisantes frescos, envasadas (aproximadamente 600 g / 1 lb 5 oz de peso en las vainas)", "½ limón pequeño sin cera, jugo y ralladura rallada solamente", "½-1 cucharadita de sal", "8 vueltas de peppermill negro", "70 g / 2½ oz de pecorino recién rallado (u otro queso duro vegetariano)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Primero prepara las alcachofas globo. Coloque el jugo de limón o el vinagre en un recipiente con agua fría. Retire el tallo de la alcachofa a menos de 1 cm / ½ pulgada de la base. Despegue las hojas exteriores hasta que llegue al centro de color pálido. Corta el cuerpo de la alcachofa por la mitad horizontalmente. Retire el estrangulador peludo con una cucharadita. Corta las hojas restantes con un cuchillo afilado. Cortar en seis cuñas y ponerlos en el agua de limón para evitar que se pongan marrones.", "Caliente el caldo en una olla.", "Derretir la mitad de la mantequilla con el aceite de oliva en una sartén ancha a fuego medio-bajo y sudar la cebolla y el ajo durante 5-10 minutos hasta que estén blandos.", "Agregue el arroz y revuelva bien para cubrir los granos. Agregue el vino blanco y revuelva hasta que haya sido absorbido por el arroz. Comience agregando el caldo de verduras a cucharadas a la vez, revolviendo hasta que se absorba, lo que tomará aproximadamente 20 minutos. El arroz debe cocinarse pero retener la mordida (es posible que no necesite todas las existencias).", "Después de aproximadamente 12 minutos, hierva una olla de agua, agregue la alcachofa y cocine durante 5-7 minutos hasta que esté tierna. Eliminar y reservar. Agregue las habas y los guisantes y hierva durante aproximadamente 3 minutos, luego escurra. Agregue todas las verduras al risotto y caliente.", "Retire del fuego y revuelva a través de la ralladura de limón, el jugo y la mantequilla restante. Sazone con sal, pimienta y la mitad del pecorino. Servir inmediatamente con el resto del pecorino."]}, {"isVegetarian": false, "title": "Corazones de alcachofa rellenos de bacalao", "url": "www_bbc_co_uk_food_recipes_artichoke_hearts_filled_77022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Bacalao a 200 g / 7oz", "1 papa grande para hornear", "2 alcachofas globo, hojas externas eliminadas", "1 cucharadita de jugo de limón", "500ml / 18fl de leche en oz", "1 diente de ajo, en rodajas finas", "1 hoja de laurel", "1 ramita de tomillo", "50ml / 2fl oz de aceite de oliva", "4 cucharadas de pan rallado fresco", "sal y pimienta negra recién molida", "1 castelfranco lechuga, hojas separadas", "½ limón, solo jugo", "3 cucharadas de aceite de oliva"], "serves": "Porciones 2", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Coloque el bacalao en un recipiente grande y cúbralo con agua fría. Dejar en remojo a temperatura ambiente durante 24 horas, cambiando el agua al menos cuatro veces.", "Precaliente el horno a 180 ° C / 200 ° Ventilador / Gas 4. Coloque la papa en una bandeja para hornear, envuelta en papel de cocina y hornee por 1¼ a 1½ horas o hasta que esté cocida. Mantenga el horno encendido. Una vez que la papa se haya enfriado, retire la carne y páselo por un ricer. Dejar de lado.", "Mientras tanto, ponga a hervir una cacerola de agua con sal y agregue las alcachofas y el jugo de limón. Cocine por 25-30 minutos, o hasta que las hojas externas se desprendan fácilmente. Dejar enfriar, cortar a la mitad y quitar algunas hojas centrales.", "Coloque el bacalao en un plato poco profundo y agregue la leche, el ajo, la hoja de laurel y el tomillo. Deje cocer durante 10 minutos, luego quite y vierta el pescado en un recipiente pequeño y reserve la leche.", "Agregue la papa, el aceite y parte de la leche reservada. Sazone con sal y pimienta y vierta la mezcla en la alcachofa. Espolvoree las migas de pan sobre la parte superior y hornee en el horno durante 10-15 minutos, o hasta que estén doradas.", "Batir el jugo de limón, el aceite y la sal y la pimienta en un tazón pequeño. Coloque las hojas en un tazón grande y vístalas con el aderezo.", "Sirva las alcachofas al horno en un plato para servir con las hojas vestidas esparcidas por el borde."]}, {"isVegetarian": false, "title": "Alcachofa con mayonesa de tocino ahumado", "url": "www_bbc_co_uk_food_recipes_artichoke_with_smoked_62303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 alcachofas globo", "2 limones, cortados a la mitad", "pizca de sal", "Harina normal de 100 g / 3½ oz", "8 lonchas de tocino rayado ahumado, toscamente picadas", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "400ml / 14fl oz de aceite de colza", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para las alcachofas, quita las duras hojas exteriores de las alcachofas y corta los tallos y la parte superior. Con un cuchillo afilado, corte cualquier parte verde y resistente, descartando todo excepto las hojas tiernas y el tallo. Frote cada alcachofa con el lado cortado de una de las mitades de limón para evitar que la carne se decolore. Dejar de lado en un recipiente con agua. Repita el proceso con las alcachofas restantes.", "Exprime el jugo de los limones en una olla grande. Agregue una pizca de sal, la harina y las alcachofas. Llene la sartén con suficiente agua fría para cubrir las alcachofas.", "Ponga a hervir el agua, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 15 minutos, o hasta que las alcachofas estén tiernas al perforarlas con un cuchillo afilado. La harina se elevará a la superficie del agua para crear una costra, esto evitará que las alcachofas se decoloren durante la cocción.", "Mientras tanto, para la mayonesa, fría el tocino en una sartén a fuego alto hasta que la grasa se derrita y la carne esté crujiente. Coloque la sartén a un lado para enfriar.", "Mezcle las yemas de huevo y la mostaza en un procesador de alimentos hasta que quede pálido y cremoso. Con el motor todavía en funcionamiento, agregue gradualmente el aceite de colza en una corriente delgada, hasta que la mezcla se espese a mayonesa (es posible que no necesite agregar todo el aceite).", "Poco a poco agregue la grasa derretida de la sartén de tocino a la mayonesa, gota a gota. Agregue el tocino frito y pulse el procesador de alimentos hasta que se haya incorporado a la mayonesa. Sazonar la mayonesa con sal y pimienta negra recién molida.", "Cuando las alcachofas se hayan cocinado, quítelas de la sartén y escurra sobre papel de cocina.", "Sirva las alcachofas con una cucharada de mayonesa."]}, {"isVegetarian": false, "title": "Alcachofa y pizza de tres quesos", "url": "www_bbc_co_uk_food_recipes_artichokeandthreeche_89363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "½ cucharadita de sal", "1 cucharadita de azúcar en polvo", "7 g de levadura seca (o 4 g de levadura fresca)", "300ml / 11fl oz de agua", "aceite, para engrasar", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "2 x 400 g / 14 onzas de latas de tomates picados", "2 cucharaditas de azúcar en polvo", "1 manojo de albahaca fresca, hojas picadas", "12 alcachofas violetas bebé, peladas, cortadas y finamente cortadas", "Mozzarella de búfalo 350g / 12oz, en rodajas gruesas", "1 pedazo de queso parmesano", "4 x 115 g / 4 oz Little Wallop, o quesos duros de cabra similares, desollados y cortados en trozos", "12 rebanadas de jamón de Parma", "1 manojo de albahaca fresca, solo hojas"], "serves": "Rinde 4", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa, coloque la harina, la sal y el azúcar en un tazón grande y revuelva para combinar.", "Desmenuce la levadura en un recipiente pequeño y agregue cuatro cucharadas de agua. Batir para combinar y reservar durante un minuto.", "Vierta la mezcla de levadura en el centro de la mezcla de harina y agregue el resto del agua. Mezcle bien para formar una masa suave.", "Incline la masa sobre una superficie de trabajo enharinada y amasar hasta que quede suave y elástica.", "Coloque la masa en un bol ligeramente engrasado, cubra con una película adhesiva y deje que se levante durante una hora.", "Retire la masa del bol y amasar durante un minuto en una superficie de trabajo enharinada, luego divídala en cuatro pedazos y ruede en círculos de 0.5cm / ¼ de grosor.", "Para el aderezo, caliente una sartén hasta que esté caliente, luego agregue el aceite, la cebolla y el ajo y fría por 3-4 minutos.", "Agregue los tomates, el azúcar y la albahaca picada y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20 minutos, hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida y dejar enfriar.", "Precaliente el horno a 220C / 425F / Gas 7. Coloque una bandeja para hornear pesada o una piedra para pizza en el horno para precalentar.", "Coloque las bases de pizza en una bandeja para hornear enharinada hacia arriba. Con una cuchara, vierte la salsa de tomate fría sobre la pizza.", "Espolvoree las alcachofas, la mozzarella, el queso parmesano, el queso de cabra y el jamón de Parma y sazone con sal y pimienta negra recién molida.", "Con cuidado, transfiera las pizzas al horno, empujando las pizzas de la bandeja enharinada sobre la piedra para pizza de la bandeja caliente. Cocine por 15 minutos o hasta que la base esté crujiente y la cobertura esté bien cocida.", "Retirar del horno y espolvorear con las hojas de albahaca. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Pasta de alcachofa", "url": "www_bbc_co_uk_food_recipes_artichokepasta_1398", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/artichokepasta_1398_16x9.jpg", "ingredients": ["Alcachofas a 110g / 4oz, marinado en aceite", "1 diente de ajo, pelado y aplastado", "1 cucharada de perejil finamente picado", "1 cucharada de tomillo finamente picado, solo hojas", "Pasta linguine 450g / 1lb, cocida", "½ limón, solo jugo", "virutas de parmesano, para servir (o queso duro vegetariano similar)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Vierta las alcachofas, con su aceite en una sartén y aplastelas con un tenedor.", "Agregue el ajo, el perejil y el tomillo y caliente por unos minutos y luego vierta sobre la pasta tibia.", "Agregue el jugo de limón y mezcle bien.", "Servir en tazones cubiertos con virutas de queso parmesano."]}, {"isVegetarian": true, "title": "Arctic roll", "url": "www_bbc_co_uk_food_recipes_arctic_roll_48010", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arctic_roll_48010_16x9.jpg", "ingredients": ["un poco de aceite de girasol, para engrasar", "500ml / 18fl oz de helado de vainilla", "200 g / 7 oz de mermelada de frambuesa", "3 huevos medianos de granja", "100 g / 3½ oz de azúcar en polvo, más extra para quitar el polvo", "100g / 3½ oz de harina de auto crianza"], "serves": "Sirve 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente su horno a 200C / 400F / Gas 6 y forre una lata de rollo suizo, 22x32cm / 8½x13in o similar, con pergamino para hornear. Aceite esto muy ligeramente con aceite de girasol.", "Pon el helado en un bol grande y bate con un rodillo o algo similar hasta que esté lo suficientemente suave como para moldearlo. Póngalo en un trozo de pergamino para hornear y forme una salchicha delgada de 25-30 cm de largo y unos 5 cm de diámetro. Envuelva en el pergamino y ponga en el congelador hasta que esté firme.", "Para hacer el rollo suizo, use un batidor eléctrico o un mezclador con un accesorio batidor para batir los huevos y el azúcar juntos durante varios minutos hasta que estén pálidos, casi dorados y casi triplicados en volumen. La mezcla debe \\\"mantener un rastro\\\" cuando se quita la batidora. Tamiza la harina sobre la mezcla de huevo y dóblala ligeramente. Dobla en una cucharada de agua tibia.", "Vierta la mezcla en la lata preparada y alisarla para que llegue a las esquinas. Hornee durante 10-12 minutos, o hasta que estén dorados y firmes al tacto.", "Corta una hoja de pergamino un poco más grande que la lata de rollo suizo y colócala sobre tu superficie de trabajo. Espolvorea el pergamino con azúcar. Incline la esponja cocida en el pergamino, base hacia arriba. Con cuidado, pele el pergamino de la base de la esponja. Deje que se enfríe completamente.", "Para ensamblar el rollo, primero recorte los dos lados largos de la esponja en líneas rectas y ordenadas. Extienda el atasco sobre la esponja, dejando un espacio de 2 cm en cada borde corto y un espacio de 4 cm en uno de los bordes largos.", "Desenvuelve el helado y colócalo longitudinalmente sobre la esponja, cerca del borde del jammy. Use el pergamino para ayudarlo a enrollar la esponja alrededor del helado. Use un cuchillo de pan para recortar cuidadosamente cada extremo del rollo. Colocar en un plato y servir de inmediato, en rodajas gruesas. Puede envolver cualquier rollo sin comer y devolverlo al congelador. Sáquelo y déjelo reposar durante unos minutos para que la esponja pueda ablandarse un poco, antes de volver a cortar."]}, {"isVegetarian": true, "title": "Ensalada de alcachofas, pimientos y habas con aderezo de limón", "url": "www_bbc_co_uk_food_recipes_artichokepepperandbr_88448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ de cebolla, muy finamente rebanada", "¼ de pimiento rojo, finamente cortado", "4 corazones de alcachofa en aceite, escurridos y cortados en cuñas", "1 cucharada de cebolletas frescas picadas", "1 cucharada de cilantro fresco picado", "50 g / 1¾oz de frijoles, pieles eliminadas", "½ limón, solo jugo", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine la cebolla, el pimiento, los corazones de alcachofas, el cebollino, el cilantro y las habas en un bol.", "En otro recipiente, mezcle el jugo de limón, el aceite de oliva, la sal y la pimienta negra recién molida. Vierta sobre la ensalada, revolviendo para cubrir todo. Servir."]}]