[{"isVegetarian": true, "title": "Griddled asparagus and goats' cheese tart", "url": "www_bbc_co_uk_food_recipes_griddledasparagusand_85686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch asparagus, trimmed", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 garlic clove, chopped", "sprig fresh rosemary", "sprig fresh thyme", "10cm x 15cm/4in x 6in rectangle ready-rolled puff pastry", "100g/3½oz goats' cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub the asparagus with olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan until hot, then griddle the asparagus with the garlic and herbs until chargrilled all over. Remove from the pan, discard the rosemary and thyme sprigs and set aside.", "Score a border 1cm/½in around the edge of the pastry and prick inside the border with a fork. ", "Place the pastry onto a baking sheet and bake in the oven for five minutes, or until the pastry is beginning to turn golden-brown and is slightly risen.", "Place the goats' cheese onto the middle of the pastry and top with the griddled asparagus.", "Transfer to the oven and bake for 12-15 minutes.", "To serve, place onto a serving plate."]}, {"isVegetarian": false, "title": "Griddled asparagus with pan-fried salmon and olive paste", "url": "www_bbc_co_uk_food_recipes_griddledasparaguswit_80985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz black olives, pitted", "1 tbsp chives", "1 tbsp fresh coriander leaves", "3 tbsp olive oil", "handful fresh basil leaves", "drizzle olive oil", "4 asparagus spears, blanched in boiling water", "salt and freshly ground black pepper", "150g/5oz salmon fillet"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the olive paste, place the olives, chives, coriander, olive oil and basil into a food processor and blend until smooth.", "Meanwhile, for the asparagus, heat the oil in an ovenproof griddle pan until smoking. Add the asparagus spears and chargrill for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper. Remove from the pan and keep warm.", "For the salmon, place the salmon fillet onto the hot griddle pan and cook for 1-2 minutes, until browned. Turn over the salmon and spread with the olive paste. Transfer the salmon to the oven and to roast for a 5-6 minutes, until the salmon is completely cooked through.", "To serve, arrange the griddled asparagus spears on a plate and top with the salmon."]}, {"isVegetarian": false, "title": "Griddled carbonara crostini", "url": "www_bbc_co_uk_food_recipes_griddledcarbonaracro_79474", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ ciabatta, sliced in half", "salt and freshly ground black pepper, to season", "100g/3½oz smoked streaky bacon, diced", "1 garlic clove, thinly sliced", "½ onion, finely chopped", "1 mushroom, chopped into slices", "100ml/3½oz double cream", "100g/3½oz Stilton cheese, crumbled ", "1 free-range egg yolk"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking.", "Drizzle the olive oil over the ciabatta and season, to taste, with salt and freshly ground black pepper.", "Place the ciabatta onto the griddle pan and cook for two minutes on each side to create grill lines.", "Heat a medium-sized frying pan and add the bacon. Cook for three minutes then drain off any fat.", "Return the bacon to the pan, add the garlic, onion and mushrooms and cook for one minute.", "Add the cream and Stilton and cook to allow the Stilton to melt into a sauce.", "Remove from the heat, stir in the egg yolk and season, to taste, with salt and freshly ground black pepper.", "To serve, place the ciabatta on a plate and pour over the thick bacon and cheese sauce."]}, {"isVegetarian": false, "title": "Griddled chicken and thyme salad with Cornish Yarg dressing", "url": "www_bbc_co_uk_food_recipes_griddledchickenandth_70430", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, cut into 6 strips and marinated with 1 clove of chopped garlic, olive oil and chopped fresh thyme", "1 egg yolk", "1 lemon, juice only", "1 anchovy", "splash of cider vinegar", "110g/4oz Cornish yarg, crumbled", "olive oil", "8 cherry tomatoes, brushed with the olive oil, thyme and garlic marinade", "mixed leaves (eg: watercress, rocket, radicchio, and pousse)", "flat-leaf parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sear the strips of chicken on a griddle pan. Then pan-fry the cherry tomatoes in the juices. In a mixing bowl place the egg, lemon juice, anchovy, yarg and vinegar. ", "Using a hand blender, slowly add enough olive oil to form a thick dressing. Pile up the leaves, lay the chicken on top, scatter the cherry tomatoes and pour on the dressing. Garnish with the parsley."]}, {"isVegetarian": false, "title": "Griddled chicken with sea-spiced aubergine", "url": "www_bbc_co_uk_food_recipes_griddledchickenwiths_87181", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium aubergines, cut lengthwise, into 1½cm/½in strips", "125ml/4½fl oz vegetable oil, plus extra for brushing", "4 spring onions, thinly sliced diagonally", "3 red chillies, seeds removed, thinly sliced", "4 tbsp Thai oyster sauce", "1 tbsp fish sauce (nam pla)", "2 tbsp coriander leaves", "2.5cm/1 inch piece root ginger, peeled, cut into fine strips ", "4 chicken breasts, skin on ", "25g/1oz deep-fried spring onions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the aubergine strips in a wok or frying pan and cover with cold water.  ", "Bring to the boil, remove from the heat, drain and allow to cool.  ", "Dry the wok or frying pan, then place over a high heat with the vegetable oil and add the cooled aubergine.  ", "Make sure the aubergine pieces are evenly seared, but avoid too much stirring as this will make it mushy.  ", "Cook for 5-6 minutes until the aubergine is well browned. Stir in three-quarters of the sliced spring onions and half of the chillies.", "Pour off most of the oil, then return to the heat and stir in the oyster sauce and fish sauce. Cook for two minutes and set aside.", "In a small bowl mix together the remaining chillies and sliced spring onions with the coriander leaves and the ginger. ", "Gently peel back the skin from the chicken breasts and spread the herb mixture evenly over the flesh.  ", "Pull the skin back over the flesh and brush with a little oil. ", "Heat a griddle or frying pan until smoking and cook the breasts, skin side down, for two minutes.  ", "Turn and sear the other side for two minutes, then remove from the pan and place on a baking sheet.  ", "Roast in the oven for 10-15 minutes, until completely cooked through, remove from the oven and allow to rest.", "Place a mound of aubergine on each plate and place a piece of chicken on top. Sprinkle with the deep-fried spring onions and serve."]}, {"isVegetarian": true, "title": "Griddled chilli goats' cheese with pineapple and coriander dressing", "url": "www_bbc_co_uk_food_recipes_griddledchilligoatsc_88033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz goats' cheese, cut into two equal discs", "olive oil", "pinch dried chilli flakes", "salt and freshly ground black pepper", "dash olive oil", "¼ baby pineapple, finely chopped", "pinch dried chilli flakes", "1 tsp balsamic vinegar", "1 tbsp chopped fresh coriander", "fresh flatleaf parsley leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the griddled goats' cheese, drizzle the goats' cheese halves with olive oil and sprinkle with chilli flakes, salt and freshly ground black pepper.", "Heat a griddle pan until hot, add the goats' cheese and griddle until the cheese is just beginning to melt, but it is still retaining its shape. Remove from the heat and keep warm.", "For the dressing, heat the olive oil in a frying pan, add the chopped pineapple and fry for 3-4 minutes. Add the chilli flakes and balsamic vinegar and fry for 1-2 minutes. Add the chopped coriander and stir well.", "To serve, place a pile of flatleaf parsley onto a serving plate. Place the griddled goats' cheese on top and pour over the dressing."]}, {"isVegetarian": true, "title": "Griddled fennel with a hot tomato and balsamic dressing", "url": "www_bbc_co_uk_food_recipes_griddledfennelwithah_89415", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bulb fennel, trimmed and cut into 1cm/½in slices", "1 tbsp olive oil", "150g/5½oz cherry tomatoes", "2 tbsp balsamic vinegar", "2 tbsp olive oil", "1 garlic clove, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Bring a pan of salted water to the boil.", "For the griddled fennel, place the fennel slices into a steamer or metal colander, suspend it over the boiling water, and cover with a lid. Steam for 6-8 minutes, or until the fennel is just tender. ", "Heat a chargrill pan over a medium heat, add the steamed fennel, and cook for 3-4 minutes on each side, or until golden-brown.", "For the hot tomato and balsamic dressing, place the tomatoes into a small, non-reactive, ovenproof frying pan over a medium heat. Add the balsamic vinegar, olive oil and garlic, and heat through until the mixture starts to sizzle. Transfer to the oven and cook for 6-8 minutes.", "To serve, place the griddled fennel onto a plate and spoon the hot tomato and balsamic dressing over the top."]}, {"isVegetarian": false, "title": "Griddled fillet of beef with blue cheese butter and sautéed mushrooms and cabbage", "url": "www_bbc_co_uk_food_recipes_griddledfilletofbeef_85373", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 100g/3½oz piece beef fillet", "1 tbsp olive oil", "salt and freshly ground black pepper", "25g/1oz blue cheese, crumbled", "1 tbsp butter, softened", "small handful fresh herbs, such as chervil, chives, parsley and sage, leaves only, finely chopped", "1 tsp Dijon mustard", "1 tsp olive oil", "knob of butter", "¼ savoy cabbage, roughly chopped", "1 Portabello mushroom, quartered"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the griddled beef, rub the beef all over with olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan until hot and cook the beef for 3-4 minutes on each side, or until cooked to your liking. Set aside and leave to rest.", "For the blue cheese butter, place all the blue cheese butter ingredients into a bowl and roughly mash with a fork until combined.", "For the sautéed mushrooms and cabbage, heat the oil and butter in a pan and gently fry the cabbage and mushroom pieces for 5-6 minutes, or until tender.", "To serve, place the cabbage and mushrooms onto a plate and top with the beef and a spoonful of the blue cheese butter. Drizzle over any meat juices from the pan."]}, {"isVegetarian": true, "title": "Griddled halloumi", "url": "www_bbc_co_uk_food_recipes_griddledhalloumi_79154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddledhalloumi_79154_16x9.jpg", "ingredients": ["1 courgette, cut into strips", "½ tsp fresh thyme leaves", "2 tbsp olive oil", "salt and freshly ground black pepper", "4 slices halloumi", "2 slices ciabatta, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the courgette, thyme leaves, olive oil and seasoning in a bowl.", "Heat a griddle pan until hot. Place the courgette mixture onto the griddle pan and cook for 1-2 minutes.", "Add the halloumi slices and continue to griddle for 3-4 minutes, or until golden brown stripes appear on the cheese surface.", "Arrange the toasted ciabatta on a plate and place the griddled halloumi and courgette on top to serve."]}, {"isVegetarian": false, "title": "Griddled lamb chop with garlic and thyme", "url": "www_bbc_co_uk_food_recipes_griddledlambchopwith_85243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 200g/7oz lamb chump chop", "2 garlic cloves, finely chopped", "3 sprigs fresh thyme, leaves only", "1 tbsp olive oil", "½ Jerusalem artichoke, peeled and cut lengthways into chips", "1 stalk purple sprouting broccoli, trimmed", "1 tbsp olive oil", "lemon wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the griddled lamb chop, place the lamb chop into a bowl with the garlic, thyme and oil and mix well. Leave to marinate for a few minutes.", "Heat a griddle pan and griddle the lamb for 4-5 minutes on each side, or until cooked to your liking. Set aside to rest for five minutes.", "For the griddled vegetables, place the artichoke chips and broccoli into a bowl with the olive oil and stir well to coat the vegetables. Place the vegetables onto the griddle pan and chargrill, turning occasionally, until cooked through.", "To serve, place the lamb chop onto a plate with the griddled vegetables and a wedge of lemon."]}, {"isVegetarian": false, "title": "Griddled lamb with beetroot and bean salad", "url": "www_bbc_co_uk_food_recipes_griddledlambwithbeet_11311", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 leg of lamb steaks", "2 lemons, halved and juiced", "100ml/3½fl oz olive oil", "3 sprigs of rosemary", "seasoning", "2-3 beetroot, cooked", "30g/1¼oz wild rocket", "400g/14oz tin of haricot beans, washed and drained", "2 oranges, segmented and juice reserved", "90ml/6tbsp virgin olive oil", "1 tsp Dijon mustard", "pinch of sugar", "1 tbsp chives,  finely chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the marinade, mix the lemon halves, lemon juice and olive oil in a bowl. Add the rosemary and season to taste. Coat the lamb steaks in the marinade and leave in the bowl for 20 to 30 minutes.", "Heat a griddle pan and cook the lamb for about 3 minutes on both sides.", "While cooking, slice the beetroot and arrange around the edge of a serving plate. Add the rocket leaves and beans and decorate with the orange segments.", "For the dressing, mix the olive oil with the remaining orange juice in a jug. Spoon in the mustard and sugar and stir well.", "Place the lamb in the centre of the plate, drizzle with the dressing and top with chives."]}, {"isVegetarian": true, "title": "Griddled mango with coconut custard", "url": "www_bbc_co_uk_food_recipes_griddledmangowithcoc_80973", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6x1cm/½in slices of mango ", "1 tbsp icing sugar", "600ml/1 pint milk", "200g/7oz creamed coconut", "3 free-range egg yolks", "2 tbsp caster sugar", "1 lime, zest only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "To prepare the mango, heat a griddle pan until smoking. Dust the mango slices with icing sugar and griddle for 2 minutes on each side.", "To make the custard, pour the milk into a saucepan and add the creamed coconut. Allow the creamed coconut to melt. Scald the liquid and leave to cool for 1 minute.", "In a large bowl, mix the yolks and sugar together. Gradually pour in the milk and coconut mixture, whisking continuously. ", "Return the mixture to the saucepan over a gentle heat. Stir continuously until the mixture is thick enough to coat the back of a wooden spoon. Remove from the heat and mix in the lime zest.", "To serve, pour the custard into a warm bowl placed on a large plate and pile the mango to one side."]}, {"isVegetarian": false, "title": "Griddled pork chop with chorizo, wild garlic, potatoes and  herb dressing", "url": "www_bbc_co_uk_food_recipes_griddledporkchopwith_86414", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz pork chops, French trimmed ", "1 tbsp olive oil", "salt and freshly ground black pepper ", "4 tbsp tomato purée", "2 tbsp soy sauce", "2 tbsp honey", "4 tbsp red wine vinegar", "1 tbsp olive oil", "200g/7oz Roosevelt potatoes, or other salad potatoes, peeled, par-boiled and sliced", "200g/7oz cooking chorizo, thickly sliced", "125g/4½oz wild garlic", "125g/4½oz piquilllo peppers, from a can or jar, finely sliced", "large pinch smoked paprika", "4 tbsp finely chopped fresh basil", "2 tbsp finely chopped fresh flatleaf parsley", "3 tbsp finely chopped fresh mint ", "1 tbsp capers, rinsed and drained, roughly chopped", "1 tsp Dijon mustard", "4 anchovy fillets, roughly chopped", "½ lemon, juice only", "½ garlic clove, finely chopped", "200ml/7fl oz extra virgin olive oil", "1 punnet basil cress, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Preheat a griddle pan until hot.", "For the pork, rub one tablespoon of the olive oil over the pork chops, then season with salt and freshly ground black pepper.", "Place the chops onto the griddle and cook for 1-2 minutes on either side, until golden-brown griddle marks appear on both sides.", "Meanwhile, place all the marinade ingredients into a bowl and whisk to combine. Spoon the marinade over the pork chops and transfer to the oven for 6-7 minutes, or until completely cooked through.", "For the potatoes, heat a frying pan until hot and add one tablespoon of oil. Add the par-boiled potatoes and fry for 2-3 minutes, then add the chorizo and cook for a further 2-3 minutes. ", "Add the paprika, piquillo peppers and wild garlic and cook for one minute.", "For the dressing, place all of the dressing ingredients, except the basil cress into a bowl and whisk well to combine.", "To serve, spoon the potatoes and chorizo onto plates and place a pork chop on top. Spoon the dressing around and garnish with a few leaves of basil cress."]}, {"isVegetarian": true, "title": "Griddled pear and tomato salad with spinach pesto", "url": "www_bbc_co_uk_food_recipes_griddledpearandtomat_79475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pear cut into quarters, cored and skin left on", "50g/1¾oz fresh flatleaf parsley, chopped", "50g/1¾oz fresh chervil, chopped", "50g/1¾oz fresh chives, chopped", "50g/1¾oz cherry tomatoes, chopped ", "100g/3½oz Stilton cheese, crumbled ", "salt and freshly ground black pepper", "55g/2oz baby spinach leaves", "3 tbsp olive oil", "1 garlic clove ", "100g/3½oz pine nuts", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Add the pear quarters and griddle on both sides for one minute to create grill lines, then remove from the heat and set aside.", "For the pesto, place the spinach, olive oil, garlic and pine nuts in a food processor and blend together. Season, to taste, with salt and freshly ground black pepper and transfer to a serving bowl.", "For the salad, place the parsley, chervil, chives and tomatoes in a large bowl. Mix well and drizzle with the spinach pesto.", "Serve in a bowl with the Stilton crumbled over and the pear quarters placed around."]}, {"isVegetarian": false, "title": "Griddled quesadillas with BBQ beans and cheese with cherry tomato and avocado salsa", "url": "www_bbc_co_uk_food_recipes_griddledquesadillasw_10975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "1 pack of 15cm/6in flour tortillas", "1 tin refried beans", "1 smoked sausage, chopped", "BBQ flavouring", "1 ripe avocado", "soured cream", "1 tbsp lemon juice", "400g/14oz grated cheese (cheddar, Monterey jack, mozzarrella)", "1 punnet cherry tomatoes", "salt and pepper", "sprigs of coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mash avocado with lemon juice, add 1 tbsp of soured cream, and season to taste.", "Heat the beans with the sausage, and add the BBQ flavouring.", "Brush two tortillas with oil, and mark crossways on a griddle pan.", "Cover one tortilla with the beans and cheese and add the avocado mixture to the other tortilla, press both together.", "Cook in preheated oven 200C/400F/Gas 6 for about 5 minutes, until the cheese melts and binds it together.", "Allow to cool slightly then cut into triangles from the centre like a pizza.", "Garnish with cherry tomatoes, dollop of soured cream and coriander sprigs.", "Serve on slates or tiles."]}, {"isVegetarian": false, "title": "Griddled pork with apple salad", "url": "www_bbc_co_uk_food_recipes_griddledporkwithappl_76790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pork chop", "½ apple, cored and chopped", "25g/1oz cheddar cheese, grated", "25g/1oz raisins", "3 tbsp fresh parsley leaves", "1 tbsp white wine vinegar", "1 tbsp olive oil", "1 tsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Griddle the pork chop in a hot griddle pan for 3-4 minutes on each side or until cooked through. Remove from the pan and leave to rest for five minutes.", "Meanwhile, mix together the apple, cheese, raisins and parsley leaves.", "Cut the pork into slices and mix with the apple and cheese mixture.", "Dress with the vinegar, olive oil and sesame seeds and serve."]}, {"isVegetarian": false, "title": "Griddled rose veal rump with roasted ceps and mixed leaf and walnut salad", "url": "www_bbc_co_uk_food_recipes_griddledrosevealrump_90892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz veal rump steaks", "3 tbsp olive oil", "1 sprig rosemary, leaves only", "salt and freshly ground black pepper", "150g/5oz fresh cep mushrooms, cleaned and thickly sliced", "3 garlic cloves, crushed to paste with a knife", "75g/3oz butter", "25g/1oz flatleaf parsley, coarsely chopped", "1 lemon, juice only", "1 head Castelfranco, leaves only, torn (use other radicchio if none is available)", "1 Batavia lettuce, leaves picked and torn (use leaves from another type of lettuce if none is available)", "1 head Treviso chicory, leaves only, torn (use other red chicory if none is available)", "1 head chicory, leaves only, torn ", "75g/3oz walnut halves, lightly crushed", "1 tbsp sherry vinegar", "3 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal, heat a griddle pan until hot. Brush the veal with half of the olive oil and press the smallest pieces of rosemary onto the surface of the veal.", "Season with salt and freshly ground black pepper and place the veal directly on the griddle pan. Griddle on both sides for 1-2 minutes each (for rare), or until cooked to your liking, then remove and place on a warm plate, covered, to rest.", "Meanwhile, heat a frying pan until hot, add the remaining olive oil and the mushrooms. Fry for 2-3 minutes until browned, then season with a little salt and freshly ground black pepper. ", "Add the crushed garlic and butter to the pan, reduce the heat and cook for one more minute. Add the chopped parsley and lemon juice and stir to combine. Taste again and adjust the seasoning as necessary.", "For the salad, mix the salad leaves together with the walnuts in a salad bowl.", "In a small bowl, whisk the sherry vinegar and olive oil together. Pour the dressing over the salad leaves and mix well. ", "To serve, slice the veal on the diagonal, and place onto four serving plates. Spoon the mushrooms over the top and serve the salad on the side."]}, {"isVegetarian": false, "title": "Griddled salmon with fennel and pine nut salad", "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithfe_91326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz thick salmon fillets, skin and pin bones removed", "1 tbsp olive oil", "salt and freshly ground black pepper", "½ unwaxed lemon, juice only", "2 bulbs fennel, outer leaves removed, cut in half, finely sliced on a mandoline (green fronds reserved)", "100g/3½oz pine nuts, lightly toasted in a dry frying pan", "8 mi-cuit tomatoes, chopped", "100g/3½oz crème fraîche", "½ unwaxed lemon, juice only, plus 1 unwaxy lemon, zest only", "1 chilli, seeds removed, finely chopped ", "3 fresh mint sprigs, leaves only, roughly chopped", "100ml/3½fl oz olive oil", "squeeze lemon juice", "4 lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat a griddle pan over a high heat. Rub the salmon fillets all over with olive oil and season on both sides with salt and freshly ground black pepper. ", "When the griddle pan is hot, add the salmon fillets and grill for 4-5 minutes, turning once, or until they have golden-brown chargrill marks on both sides and are just cooked through. ", "Transfer the salmon fillets to a warm plate. Pour over the lemon juice and set aside to rest.", "For the salad, in a large bowl, mix together the sliced fennel, fennel fronds, pine nuts and mi-cuit tomatoes until well combined. Stir in the crème fraîche, lemon juice and lemon zest and set aside.", "For the chilli and mint dressing, mix all of the chilli and mint dressing ingredients together in a bowl until well combined. ", "To serve, divide the fennel and pine nut salad equally among four serving plates. Place a piece of griddled salmon on top of each. Drizzle over the chilli and mint dressing and garnish with a lemon wedge."]}, {"isVegetarian": false, "title": "Griddled salmon", "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithgr_75890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ salmon fillet, butterflied", "1 tbsp olive oil", "2 spring onions, sliced", "50g/1 ¾oz sweetcorn kernels", "½ tomato, deseeded and chopped", "handful breadcrumbs", "100ml/3 ½oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and griddle the salmon for 1-2 minutes on each side.", "Heat the oil in a pan and gently sauté the onions, sweetcorn, tomato and breadcrumbs for 3-5 minutes. ", "Add the cream and cook down for a further 2-3 minutes. ", "Season with salt and freshly ground black pepper and serve with the griddled salmon."]}, {"isVegetarian": false, "title": "Griddled smoked salmon on radicchio", "url": "www_bbc_co_uk_food_recipes_griddledsmokedsalmon_78254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 piece smoked salmon", "2 tsp vegetable oil", "2 handfuls radicchio, shredded", "lemon wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a grill pan over a high heat.", "Brush the smoked salmon with the oil and grill for 1-2 minutes on each side, or until nicely charred.", "Serve on top of the radicchio with lemon wedges."]}, {"isVegetarian": false, "title": "Griddled salmon with green asparagus 'gazpacho' and smoked almonds", "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithgr_91844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/5oz salmon fillets, skin on", "olive oil, for brushing", "salt and freshly ground black pepper", "250g/9oz asparagus spears, woody ends trimmed", "75ml/2½fl oz extra virgin olive oil", "50ml/2fl oz sherry vinegar", "75g/2½oz good quality white bread, day old", "2 cloves garlic, peeled, chopped", "½ cucumber, peeled, seeds removed, chopped", "1 green chilli, chopped", "1 tbsp chopped fresh tarragon", "salt and freshly ground black pepper, to taste ", "125g/4½oz smoked almonds, roughly chopped, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Heat a griddle pan until smoking. Brush the salmon with the olive oil, season with salt and freshly ground black pepper and griddle for 2-3 minutes on both sides, or until golden-brown all over. Place into the oven to finish cooking for 3-4 more minutes, or until just cooked through.", "For the gazpacho, cut off the tips of the asparagus spears and blanch in a pan of boiling water for one minute, then drain and refresh in iced water. Set aside.", "Boil the asparagus stems in a pan of boiling water for 8-10 minutes, or until very soft. Allow to cool in the liquid. ", "Mix the extra virgin olive oil, sherry vinegar, bread and garlic together in a large bowl and set aside for ten minutes. ", "Transfer the bread mixture to a food processor along with the asparagus stems, cucumber, chilli and tarragon and blend until smooth. Add enough of the asparagus cooking liquid to thin out the gazpacho to your desired consistency, and blend again. Season, to taste, with salt and freshly ground black pepper.", "To serve, ladle the gazpacho into four serving bowls and gently place a salmon fillet on top of each. Scatter over the chopped smoked almonds and asparagus tips and serve."]}, {"isVegetarian": true, "title": "Griddled spiced mango with honey, lime and chilli", "url": "www_bbc_co_uk_food_recipes_griddledspicedmangow_87034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, stone removed and flesh scored", "2 tsp olive oil", "¼ tsp chilli flakes", "1 tbsp clear honey", "½ lime, juice only", "2 lime wedges, to garnish", "icing sugar, for dusting"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to the highest setting.", "Place the mango on a small non-stick baking tray.", "Drizzle the mango with the olive oil and sprinkle over the chilli flakes, honey and lime juice.", "Place the mango under the hot grill for 3-4 minutes, or until golden-brown.", "To serve, garnish with lime wedges and dust with icing sugar."]}, {"isVegetarian": false, "title": "Griddled steak and sweet potato salad with kale and orange and chilli dressing", "url": "www_bbc_co_uk_food_recipes_griddledsteakandswee_85384", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rump steak, trimmed", "1 tbsp olive oil", "salt and freshly ground black pepper ", "3 kale leaves, blanched, drained and finely chopped", "½ sweet potato, peeled and sliced into 1cm/½in rounds, blanched and drained", "1 orange, peeled and sliced", "1 tbsp olive oil", "2 tsp clear honey", "1 orange, zest and juice", "1 chilli, finely chopped", "small handful fresh parsley, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat a griddle pan until hot. Rub the steak with olive oil and season with salt and freshly ground black pepper. Cook on the griddle for 4-5 minutes on each side, or until cooked to your liking. Leave to rest.", "For the dressing, place all the dressing ingredients into a bowl, season with salt and freshly ground black pepper and mix well.", "To serve, place the kale onto a serving plate and top with the steak. Place the sweet potato and orange slices around the plate and drizzle over the dressing."]}, {"isVegetarian": false, "title": "Griddled steak with lemon and coriander-roasted potatoes", "url": "www_bbc_co_uk_food_recipes_griddledsteakwithlem_90317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz rump steak", "salt and freshly ground black pepper", "2 tbsp olive oil", "½ potato, chopped", "½ lemon, juice only", "2 tbsp chopped fresh coriander", "1 carrot, peeled and chopped", "1 tsp coriander seeds", "pinch chilli flakes", "25g/1oz butter", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the steak, rub the olive oil into the meat and season well with salt and freshly ground black pepper. Heat a chargrill pan until smoking and fry the steak for 2-4 minutes on each side (for medium rare), or until cooked to your liking. Remove from the pan and place onto a warm plate to rest.", "For the potatoes, heat the olive oil in an ovenproof pan and fry the potatoes for 3-4 minutes, or until lightly golden. Transfer to the oven to roast for 10-12 minutes, or until golden-brown and tender, then stir in the lemon juice and coriander. ", "For the carrot and coriander purée, boil the carrots with the coriander seeds in a pan until tender, then drain and pulse in a food processor along with the remaining purée ingredients until smooth. ", "To serve, spoon the purée onto a plate and top with the roasted potato. Thickly slice the steak and arrange on top."]}, {"isVegetarian": true, "title": "Griddled sweet potato with coriander and chilli butter", "url": "www_bbc_co_uk_food_recipes_griddledsweetpotatow_81323", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz unsalted butter, softened", "25g/1oz fresh coriander, finely chopped", "1 red chilli, finely chopped", "2 tbsp olive oil", "½ sweet potato, cut in½cm/¼in slices, skin left on", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the coriander and chilli butter, place the butter, coriander and chilli into a bowl, season well with salt and freshly ground black pepper and mash together with a fork to mix.", "For the sweet potato, place the sweet potato into a bowl with the oil and season well with salt and freshly ground black pepper. Toss to mix thoroughly.", "Heat a griddle pan until smoking. Add the sweet potato and chargrill for two minutes on each side, or until cooked through. ", "To serve, stack the potato slices in a pile in the centre of a warm plate and spoon over a large knob of the coriander and chilli butter."]}, {"isVegetarian": false, "title": "Griddled steak with spicy potato wedges, garlic cream cabbage and blue cheese sauce", "url": "www_bbc_co_uk_food_recipes_griddledsteakwithspi_88309", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz sirloin steak", "olive oil", "salt and freshly ground black pepper", "½ potato, cut into wedges", "pinch dried chilli flakes", "salt and freshly ground black pepper", "2 tbsp olive oil", "25g/1oz butter", "25g/1oz butter", "½ onion, finely sliced", "½ Savoy cabbage, finely sliced", "salt and freshly ground black pepper", "1 garlic clove, chopped", "75ml/2½fl oz double cream", "1 sprig fresh thyme, leaves only", "55g/2oz Stilton", "100ml/3½fl oz double cream", "freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the griddled steak, rub the steak with olive oil, salt and freshly ground black pepper and heat a griddle pan until smoking hot. Place the steak into the pan and griddle for 2-3 minutes on each side, or until cooked to your liking. Set aside to rest for five minutes and then slice.", "For the spicy potato wedges, place the potato wedges, chilli flakes, salt, freshly ground black pepper, olive oil and butter into an ovenproof pan and place over a medium heat, shaking the pan from time to time, until beginning to turn golden-brown. Place in the oven and roast for 15 minutes, or until golden-brown all over and cooked all the way through.", "For the garlic cream cabbage, melt the butter in a frying pan, add the onion and fry until softened. Add the cabbage, salt and freshly ground black pepper and fry for 2-3 minutes. Add the garlic and fry for one minute. Add the cream and thyme and simmer for 3-4 minutes.", "For the blue cheese sauce, place the Stilton, cream and freshly ground black pepper into a small saucepan and heat gently, stirring, until melted and smooth.", "To serve, pile the cabbage onto a serving plate. Place the steak slices on top and the potato wedges on the side. Pour over the blue cheese sauce."]}, {"isVegetarian": true, "title": "Griddled yellow pepper with rocket and sesame salad and skordalia", "url": "www_bbc_co_uk_food_recipes_griddledyellowpepper_89158", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 yellow pepper, de-seeded, cut into quarters", "olive oil, for drizzling", "salt and freshly ground black pepper ", "1 large handful rocket leaves", "2 tbsp olive oil", "2 tbsp sesame seeds, toasted", "squeeze lemon juice", "salt and freshly ground black pepper ", "2 slices white bread, crusts removed", "3 tbsp cold water", "1 clove garlic, chopped", "2-3 tbsp olive oil", "½ lemon, juice only", "2 tsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the griddled pepper, drizzle the pepper quarters with olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until smoking, add the peppers and griddle for 3-4 minutes, or until golden-brown and slightly charred.", "For the rocket salad, mix all of the salad ingredients together in a large bowl.", "For the skordalia, place the bread in a bowl with the water and leave to soak for a few minutes. Squeeze out the excess water, then place the softened bread into a food processor with the rest of the skordalia ingredients and blend to a smooth paste.", "To serve, spoon the skordalia onto two serving plates, top with the griddled pepper and serve the rocket salad on the sides."]}, {"isVegetarian": false, "title": "Griddled turbot on minted cauliflower couscous with walnut, passion fruit and celery salsa", "url": "www_bbc_co_uk_food_recipes_griddledturbotonmint_85162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz couscous", "160ml/5½fl oz tepid water ", "¾ tsp salt ", "225g/8oz cauliflower florets", "large handful fresh mint leaves", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "1 small red onion, thinly sliced and rinsed in cold water", "1 celery stick, chopped", "1 clementine or satsuma, juice only", "2 passion fruit, seeds and juice", "handful fresh flatleaf parsley, stalks left on, chopped", "large handful walnuts, shelled, lightly toasted, chopped", "2 tbsp extra virgin olive oil", "1 tsp soy sauce", "salt and freshly ground black pepper ", "2 handfuls watercress or wild rocket, to serve", "4 x 150g/5½oz skinless, boneless turbot fillets ", "salt and freshly ground black pepper ", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the couscous, place the couscous into a bowl with the tepid water and salt and leave it to absorb the water. ", "Bring a saucepan of lightly salted water to the boil and cook the cauliflower for 3-4 minutes, or until beginning to soften. Alternately, you can steam it. Drain the cauliflower in a colander and immediately transfer to a large bowl of iced water for 2-3 minutes.", "Drain again, then place into a food processor with the mint leaves and olive oil and pulse until the mixture has the consistency of coarse crumbs.", "Mix the cauliflower mixture into the couscous and season, to taste, with salt and freshly ground black pepper. The couscous will keep covered in the fridge for a day.", "For the salsa, place the onion and celery into a bowl with the citrus juice and the passion fruit seeds and juice and leave to one side. ", "For the griddled turbot, lightly season the fish on both sides with salt and freshly ground black pepper and drizzle with the olive oil.", "Heat a griddle pan over a high heat and cook the fish for 2-3 minutes on each side, depending on the thickness of the fillet, until cooked through. Alternatively, cook under the grill.", "Meanwhile, add the parsley and walnuts to the salsa, along with the extra virgin olive oil and soy sauce. Season, to taste, with salt and freshly ground black pepper and mix well.", "To serve, place some of the couscous into the centre of each plate and lay some of the watercress or rocket on top. Place a fillet of fish on top, along with any pan juices, and spoon over the salsa."]}, {"isVegetarian": true, "title": "Griddled mango with honey and chilli", "url": "www_bbc_co_uk_food_recipes_griddlemangowithhone_84504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, stone removed", "20ml/1½ tbsp clear honey", "¼ tsp dried chilli flakes", "15g/¼oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Cut into the mango flesh in a criss-cross fashion with a sharp knife, then push the skin inside out, to expose the maximum mango flesh.", "Drizzle with the honey and sprinkle over the chilli flakes.", "Melt the butter in an ovenproof frying pan and add the mango to the pan, flesh side down. Cook for two minutes, then turn over. Transfer to the grill and cook for a further 3-4 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Grilled and hot smoked porcini, crisp egg yolk, celeriac and fresh thyme", "url": "www_bbc_co_uk_food_recipes_grilled_and_hot_smoked_26927", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 celeriac, diced", "400-500ml/14-18fl oz full-fat milk (enough to cover the celeriac)", "salt and freshly ground black pepper", "vegetable oil, for deep fat frying", "4 free-range eggs", "110g/4oz plain flour, for dredging", "1 large free-range egg, beaten", "110g/4oz Japanese Panko breadcrumbs, for dredging", "400g/14oz cleaned and trimmed porcini mushroom (or king oyster) sliced lengthwise into 1cm/½in pieces", "dash extra virgin olive oil ", "1 garlic clove, very finely chopped", "30g/1oz oak wood chips, for smoking, soaked for an hour in a little water", "100ml/3½fl oz rapeseed oil ", "5 tbsp moscatel wine vinegar", "sea salt and pepper", "¼ bunch fresh thyme, leaves removed", "1 lemon, juice only", "½ tsp, Dijon mustard "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the diced celeriac in a medium saucepan. Pour over the milk and season with salt and pepper. Bring to the boil, then turn to a simmer and cook until very tender. Drain the celeriac from the milk, reserving the milk, and place the flesh in a blender with half of the milk. Blend to a thick purée. Set aside.", "Heat the vegetable oil in a deep-fat fryer or medium sized, tall-sided pan to 170C/340F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Prepare a bowl of ice cold water.", "Heat a small saucepan of water until boiling and then turn to a low simmer. Separate the egg yolk from the whites and then drop each yolk into the water and cook for two minutes until just set (a timer is useful for this); now quickly transfer the yolks to the cold water to cool down.", "Place the flour, beaten egg and breadcrumbs in three separate bowls ready for coating the yolks. Carefully drain the yolks and transfer to the flour bowl. Gently coat with the flour, followed by the beaten egg and then lastly the breadcrumbs. Set aside.", "Heat a griddle pan over a medium heat. Rub the porcini with the oil, season well with salt and pepper and add to the pan with the garlic. Once the porcini slices are cooked through and nicely caramelised, remove from the grill and reserve.", "To smoke the porcini, be sure to be working in a ventilated space. Place a medium pan over a high heat and add the drained smoking chips. On top of this add some scrunched up foil or metal baking rings to form a trivet and then a small colander or strainer.", "When the chips start to smoke, add the porcini to the colander and place a tight-fitting lid over the pan.", "Remove the pan from the heat and allow the porcini to smoke for 3-4 minutes, or until they catch the flavour of the smoke. Do not leave the mushrooms too long in the pan as they can turn acrid. Remove and set aside.", "Deep-fry the eggs in the hot oil until golden-brown and crisp. Carefully remove using a slotted spoon and drain on kitchen paper.", "For the thyme vinaigrette, whisk together the rapeseed oil and the vinegar in a small bowl, season well and then stir in the thyme leaves, lemon juice and Dijon mustard.", "To serve, spoon some of the warm celeriac purée onto serving plates and then top with the mushrooms and the the crisp yolk. Finally spoon over the thyme vinaigrette."]}, {"isVegetarian": true, "title": "Grilled asparagus with vegetable crumble", "url": "www_bbc_co_uk_food_recipes_grilled_asparagus_with_67972", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil ", "½ tsp smoked paprika ", "2 tsp lemon juice ", "2 free-range eggs ", "20 green asparagus spears, woody ends removed ", "90–120ml/3-4fl oz refined olive oil ", "3 tbsp olive oil ", "80g/3oz baby courgettes (about 2½), pulsed in a food processor for 30 seconds ", "80g/3oz cauliflower, pulsed in a food processor for 30 seconds ", "30g/1oz banana shallot, finely chopped", "½ red chilli, finely chopped ", "3 large pinches of smoked paprika ", "pinch of salt ", "2 tbsp lemon juice ", "10g fresh parsley, chopped ", "5g fresh chives, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the paprika dressing, mix all the ingredients together in a small bowl and set aside. ", "For the hard-boiled eggs and grilled asparagus, using a spoon, slide the eggs gently into a small pan of water. Bring to a simmer for 13 minutes, then remove the eggs and immediately run them under cold water. While still warm, peel the eggs then transfer to the fridge. Once cold, separate the whites from the yolks and coarsely grate each part (keep them separated), then set aside. ", "Lay five asparagus spears side by side and secure them together using two metal skewers (thread a skewer through each end of the asparagus, avoiding the tips, so that the spears are kept straight). Repeat with the remaining asparagus. Blanch in a large saucepan of boiling water for 3 minutes, then immediately plunge them into cold water to stop the cooking and dry well (leave them on the skewers). ", "To cook the asparagus, heat a griddle pan over a high heat. Brush the skewered spears lightly with olive oil. When the pan is hot, lay the asparagus in it, flat, and leave for 3 minutes to gain deep griddle marks. Turn over using tongs and griddle for another 3 minutes. (If necessary do the griddling in batches; simply keep the asparagus warm in an oven preheated to 80C/60C Fan/Gas ¼ while you grill the remaining asparagus.) ", "For the vegetable crumble, in a large frying pan or sauté pan over a high heat, add the olive oil and fry the courgettes, cauliflower, shallot, chilli, paprika and a pinch of salt for 30 seconds. Add 80ml/3fl oz water, the lemon juice, parsley, chives and grated egg white. Boil for 5 seconds then remove from the heat. Stir in the egg yolk and check the seasoning. ", "To serve, put a spoonful of the vegetable crumble in the centre of each plate and arrange a stack of the grilled asparagus on top. Finish with a drizzle of the paprika dressing."]}, {"isVegetarian": true, "title": "Grilled baby aubergines with Chinese salsa verde", "url": "www_bbc_co_uk_food_recipes_grilled_baby_aubergines_60044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 baby purple aubergines, sliced in half lengthways", "1 tsp Chinese five spice powder", "1 pinch sea salt flakes", "2 tbsp groundnut oil ", "2 garlic cloves, finely chopped  ", "2cm/1in piece fresh root ginger, peeled and grated ", "1 red chilli, deseeded, finely chopped", "2 spring onions, sliced lengthways and finely sliced ", "3 tbsp of groundnut oil ", "1 tbsp toasted sesame oil  ", "1 tbsp low-sodium light soy sauce ", "1 tbsp rice vinegar ", "1 tbsp mirin (sweet Japanese rice wine)", "1 bunch enoki mushrooms, washed, stalks removed and small bunches separated ", "1 small handful coriander, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the aubergines into a large bowl. Sprinkle over the Chinese five spice powder and salt and drizzle over the groundnut oil. Toss the aubergines making sure they are coated in the oil. ", "Heat a griddle pan over medium-high heat, place the aubergine halves onto the griddle making sure the grill lines run across the width of the aubergines (so you get mini grill lines running across the white part of the aubergine). Turn the heat to medium and leave them cooking without moving them for 2 minutes. Then turn them over and cook on the other side. Turn them occasionally and cook for 5-6 minutes until tender. ", "Meanwhile, for the Chinese salsa verde, put all the ingredients in a jug. Mix well to combine.", "When the aubergines are cooked, switch off the heat and take them off the grill, place on a serving plate in a circular pattern. Spoon a tablespoon of the salsa verde over each aubergine half. Decant the rest of the salsa verde into a small bowl so guests can help themselves to more. Then garnish with small bunches of enoki mushrooms placed in-between the aubergine pieces. Sprinkle over some finely chopped coriander. Serve immediately."]}, {"isVegetarian": true, "title": "Grilled aubergines with olive oil, garlic, parsley and feta cheese", "url": "www_bbc_co_uk_food_recipes_grilled_aubergines_with_73271", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_aubergines_with_73271_16x9.jpg", "ingredients": ["4 long, thin-skinned purple aubergines (alternatively use the ordinary plump, pear-shaped variety available from most supermarkets)", "1-2 garlic cloves, finely chopped", "handful parsley leaves, finely chopped", "5-6 tbsp extra virgin olive oil", "a little sea salt and black pepper ", "150g/5oz feta cheese", "lemons, for serving"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Run a small, sharp knife round the top of the aubergine, 1cm/½in or so below the stalk and only just cutting through the skin; then make four evenly spaced, similarly shallow cuts, along the length of the aubergine right down to the end. ", "Grill the aubergines for about 20 minutes, turning every 5-7 minutes or so, until evenly cooked with charred skin, and until the aubergine feels soft, but not too collapsed within. In the case of the purple aubergines, the skin will also have turned a dull brown colour. Transfer to a large, oval, white plate and allow to cool for two minutes. ", "Peel away the aubergine skin in four long, narrow sheets using a small knife. Without cutting right through the stalk end, cut the aubergines in half lengthways and gently prise apart until you have two horizontal halves remaining attached at the top end ", "Mix the garlic and parsley with the olive oil until well combined and spoon the mixture over the aubergine. Season lightly with salt (not too much - the cheese is salty anyway) and pepper, and crumble the feta cheese over the top. If liked, trickle over more olive oil to finish. ", "Serve warm, or at room temperature with lemon squeezed over."]}, {"isVegetarian": false, "title": "Grilled beef bavette with smoky salad onions", "url": "www_bbc_co_uk_food_recipes_grilled_beef_bavette_86630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz coarse sea salt ", "50g/1¾oz demerara (brown) sugar ", "1 tbsp honey ", "2 bay leaves ", "8 black peppercorns ", "4 cloves", "4 x 100g/3½oz pieces of beef bavette, onglet or thinly sliced rump", "1 litre/1¾ pint brine (see above) ", "100ml/3½fl oz extra virgin olive oil ", "2 garlic cloves, roughly chopped ", "1 small red chilli, seeds removed and finely chopped", "1 lemon, finely grated zest only ", "1 tsp thyme leaves ", "8 large salad onions or large bulbous spring onions, halved lengthways keeping the stalks intact", "olive oil, for cooking ", "sea salt and black pepper ", "1 large banana shallot or 2 medium ones, finely chopped ", "1 red chilli, seeds removed and finely chopped ", "2 garlic cloves, finely chopped", "2 tbsp finely chopped flatleaf parsley", "2 tbsp olive oil ", "½ lemon, juice only "], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the brine, put all the ingredients in a medium non-reactive saucepan with 1 litre/1¾ pint water.  Slowly bring to the boil, stirring as you go to dissolve the salt and sugar.  Remove from the heat and leave to cool. ", "Place the beef bavette in the brine and leave, covered, for 1 hour.  Drain and transfer to a clean bowl.  Add the extra virgin olive oil, garlic, chilli, lemon zest and thyme, then leave to marinate for at least 1 hour. ", "Light the barbecue so that it is ready when the steaks have finished marinating. ", "Meanwhile for the salsa, mix all the ingredients together, seasoning to taste and adding the lemon juice at the last minute. ", "Remove the beef from the marinade, season with salt and pepper and place on the grill in the direct heat zone.  Keep a close eye on the steaks - bavette cooks quickly as it is quite thin, and it shouldn’t be cooked past medium-rare otherwise it’ll be tough.  Grill for 2 minutes on each side to char, then move to the cooler edge of the barbeque to rest for a couple of minutes. ", "Toss the onions with a little olive oil, season with salt and pepper and place directly on the grill in the direct heat zone and cook for 3-4 minutes until charred and tender. ", "Thickly slice the steaks and serve with the grilled onions and salsa cruda. "]}, {"isVegetarian": false, "title": "Grilled calamari, watermelon, olives, goats’ curd and crisp vine leaves", "url": "www_bbc_co_uk_food_recipes_grilled_calamari_68427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ small watermelon, skin removed and reserved", "100ml/3½fl oz sherry vinegar", "100g/3½oz clear honey", "50g/1¾oz vine leaves in brine, dried out in a low oven", "2 tbsp extra virgin olive oil, plus extra to garnish", "500g/1lb 2oz squid, cleaned, scored and cut into bite-sized pieces, tentacles reserved", "200g/7oz green olives", "200g/7oz goats’ curd, broken into small pieces", "salt flakes and cracked black pepper", "flat leaf parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the watermelon flesh into rectangles about 15x5cm/6x2in. Store in the fridge until needed. Cut out circles from the skin using a 2-3cm cutter. ", "Place the sherry vinegar and honey in a small saucepan and heat for 2-3 minutes. Remove from the heat and add the cut skin of the watermelon. Set aside.", "Meanwhile, heat a griddle pan until hot. Drizzle the olive oil over the squid and season with salt and pepper. Grill the squid and tentacles until lightly charred and the flesh is no longer transparent.", "Arrange the watermelon, olives and goat’s curd on serving plates. Put the calamari and crisp vine leaves on top and finish with parsley leaves, a drizzle of olive oil and a final grinding of salt and pepper. Finish with the circles of melon rind."]}, {"isVegetarian": false, "title": "Grilled chicken shatkora with pickle and chapatis", "url": "www_bbc_co_uk_food_recipes_grilled_chicken_shatkora_00658", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_chicken_shatkora_00658_16x9.jpg", "ingredients": ["2 chickens, jointed into pieces", "2 tbsp vegetable oil", "5 garlic cloves, crushed", "4cm/1½in piece fresh root ginger, minced", "½ onion, finely chopped", "3 bay leaves", "3 cardamom pods, seeds only", "½ shatkora (available in Asian grocery stores), halved lengthways and thinly sliced", "1 large cinnamon stick", "¼ tsp ground turmeric", "¼ tsp chilli powder", "¼ tsp ground cumin ", "¼ tsp curry powder", "½ tsp ground turmeric", "200ml/7fl oz plain yoghurt", "1 shatkora, juice only", "shatkora wedges", "chapatis, warmed"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickle, heat the oil. Mix the garlic, ginger and onion together to form a paste. Add the paste to the pan. Add enough water to loosen a little and cook for a few minutes.  Add the bay leaves and cardamom.", "Add the shatkora to the pan. Add a cinnamon stick, then the turmeric, chilli powder, cumin and curry powder. Cook on a low heat for 15 minutes. This is an instant pickle, so won’t keep for longer than three days in the fridge.", "For the marinade, mix together the ingredients and rub the paste into the chicken, working it in thoroughly to cover all the flesh and skin. Cover and marinate in the fridge for at leat 4 hours, or overnight.", "To cook the chicken, preheat the grill to high. Grill the chicken for 10–12 minutes on each side, or until cooked through. If needed, squeeze more shatkora juice onto the chicken during cooking.", "Serve the chicken with the shatkora pickle, wedges and chapatis."]}, {"isVegetarian": false, "title": "Grilled chicken with morel sauce, Parmentier potatoes and baby vegetables", "url": "www_bbc_co_uk_food_recipes_grilled_chicken_with_34352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "2 tsp olive oil", "2 potatoes, peeled and cubed", "1 garlic clove, crushed", "½ onion, chopped", "2 sprigs rosemary, leaves picked and finely chopped", "salt and freshly ground black pepper", "½ lemon, juice only", "1 tbsp butter", "1 large shallot, finely chopped", "2 handfuls morel mushrooms, cleaned ", "generous splash Madeira", "250ml/9fl oz chicken stock (preferably white chicken stock)", "250ml/9fl oz double cream", "4 chicken breasts", "250g/9oz baby courgettes ", "250g/9oz baby leeks", "250g/9oz sugar snap peas", "50g/2oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Preheat the grill to medium-high heat.", "For the Parmentier potatoes, heat the butter and olive oil in a heavy-based frying pan. Add the cubed potato and fry until nut-brown, stirring occasionally, add the garlic, onion and rosemary to the frying potatoes, mixing well. Season with salt and freshly ground black pepper.", "Transfer the potatoes to an ovenproof dish and bake for 10 minutes or until tender. Squeeze over the lemon juice.", "For the morel sauce, heat the butter in a pan, add the shallots and a pinch of salt, and fry until the shallots are softened, but not browned.", "Tip in the mushrooms and cook for a further 3-4 minutes. Add the Madeira and stock and simmer until the volume of liquid has reduced by half.", "Pour in the double cream to just cover the mushrooms and simmer for a further five minutes.", "Season and grill the chicken breasts for about 8-10 minutes, or until golden-brown and the juices run clear.", "Bring a large pan of water to the boil with a pinch of salt and add the courgettes, the leeks and the sugar snap peas. Boil for 2-3 minutes until just tender, then drain immediately and return to the pan.", "Add the butter to the vegetables and stir until the butter is melted and the vegetables are coated. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a chicken breast on each serving plate and coat with the morel sauce. Serve the Parmentier potatoes and buttered baby vegetables alongside."]}, {"isVegetarian": false, "title": "Grilled Greek lamb neck fillet with watermelon, orange and red onion", "url": "www_bbc_co_uk_food_recipes_grilled_greek_lamb_neck_63552", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz extra virgin olive oil ", "1 tsp dried mint ", "1 tbsp Greek oregano ", "1 lemon, zest and juice only", "2 garlic cloves, crushed to a paste with a little salt", "pinch dried chilli flakes ", "2 neck of lamb fillets ", "2 tbsp honey ", "1 tbsp sweet chilli sauce ", "¼ watermelon, peeled ", "2 naval oranges, segmented", "1 red onion, finely sliced ", "½ bunch mint, leaves only", "200g/7oz soft feta ", "150g/5½oz Greek yoghurt ", "1 garlic clove, roughly chopped ", "½ bunch mint, leaves only ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, mix together the oil, herbs, lemon zest and juice, garlic and chilli flakes.  Reserve half of the marinade in a separate bowl. Rub the lamb all over with the remainder, place the lamb in a bowl in the fridge and allow to marinade for at least one hour, ideally overnight. ", "Add the honey and chilli sauce to the remaining marinade – this will become a dressing - and set aside. ", "For the feta cream, blend the feta with the yoghurt and garlic in a food processor, add the mint leaves and pulse until chopped. Season to taste with salt and pepper and set aside. ", "To complete the lamb, slice the watermelon and arrange on four plates and scatter with orange segments and red onion (squeeze any orange juice from cutting the segments into the dressing).", "Heat a griddle pan, season the lamb fillets and cook them to your liking, turning regularly (6-7 minutes for medium rare). Set aside, in a warm place, to rest. ", "Drizzle some feta cream over the watermelon, slice the lamb thinly and arrange it over the melon. Scatter with mint leaves and drizzle with the lemon-chilli dressing. "]}, {"isVegetarian": false, "title": "Grilled lamb chop with green apple harissa, green tahini and spring onion", "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chop_with_68571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp cumin seeds ", "½ tsp coriander seeds", "¼ tsp fennel seeds", "pinch of caraway seeds", "6 green bird's-eye chillies, roughly chopped", "2 garlic cloves, crushed", "100ml/3½fl oz garlic oil, or olive oil", "½ small bunch fresh coriander, roughly chopped", "100g/3½oz baby spinach, stalks removed", "2 Granny Smith apples, cored, roughly chopped", "½ tbsp honey", "salt and freshly ground black pepper", "small handful each fresh parsley, basil and rocket leaves", "½ lemon, juice only", "50g/1¾oz tahini paste", "1 garlic clove, crushed", "½ tsp salt", "½ tsp olive oil", "1 tbsp plain yoghurt", "4 lamb chops", "4 spring onions, halved lengthways", "2 tbsp olive oil", "½ lemon ", "fresh coriander leaves, to garnish"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["To make the harissa, put the cumin, coriander, fennel and caraway seeds in a heavy-based frying pan and toast over a medium–high heat until smoking and fragrant. Transfer to a spice grinder and blend to a fine powder. ", "Put the chilli and garlic in a food processor. Add the oil and blend to a purée. Add the coriander, spinach and spice mix and blend until smooth. (You might need to add a touch more oil or water to get the blender moving). Add the apples and honey and pulse until incorporated into the sauce. It should have a thick, pesto-like consistency. Season with salt and pepper and set aside. ", "To make the green tahini, blend the herbs with 50ml/2fl oz water in a food processor until smooth.", "Mix together the lemon juice, tahini and garlic in a mixing bowl or food processor, add a small amount of the herby water and whisk or blend until combined. Gradually add the remaining herby water until you have a loose paste. Season with salt, olive oil and more lemon juice, if needed. ", "To make the lamb chops, mix 50ml/2fl oz of the harissa with the yoghurt in a large bowl. Add the lamb chops and massage the meat until each chop is well coated. Cover and marinate in the fridge for 2–4 hours, but preferably overnight.", "When you are ready to cook, preheat the barbecue, ensuring that you are cooking over hot coals. Alternatively, heat a cast-iron griddle pan over a high heat until smoking hot. (Ensure you cook in a well-ventilated area.)", "Grill the lamb chops for 2–3 minutes on each side, until nicely charred around the edges and the fat is crisp and golden but the meat is still soft to the touch and pink on the inside. Season both sides with salt and pepper as you cook. ", "Meanwhile, brush the spring onions and lemon with olive oil and season with salt and pepper. Lay them on a wire rack and blacken under the grill until softened.", "To serve, spoon a dollop of green tahini on a large serving platter. Put the lamb chops on top with the spring onions on the side. Garnish with a few coriander leaves and a squeeze of the blackened lemon.  "]}, {"isVegetarian": false, "title": "Grilled lamb chops, wild garlic pesto and Jersey Royals", "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chops_wild_41287", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["120g/4oz wild garlic leaves, blanched ", "1 garlic clove, peeled and grated", "20g/¾oz pine nuts, toasted", "200ml/7fl oz olive oil  ", "½ lemon, zest only", "30g/1oz parmesan cheese, grated", "salt and pepper", "6 lamb cutlets, French trimmed ", "olive oil, to brush on the lamb ", "200g/7oz pre-cooked Jersey Royals ", "30g/1oz wild garlic leaves, washed "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the wild garlic pesto, pick and wash the wild garlic leaves and blanch the leaves in a pan of boiling water for 30 seconds. Re-fresh in a bowl of ice-cold water. Squeeze out the excess water and roughly chop. ", "Add the leaves, garlic, pine nuts, olive oil, lemon zest and grated parmesan to the food processor and blend. Season with salt and pepper. ", "For the grilled lamb chops, heat a flat griddle pan and drizzle the chops with oil. Cook for two minutes on one side and turn over and cook for another 30 seconds. Allow the chops to rest. ", "While the lamb is resting, heat a medium frying pan and fry the potatoes with butter until golden-brown. Stir through the raw garlic leaves, and a tablespoon of the pesto, or more if you prefer. ", "To serve, put the potato salad in a serving bowl and pile the lamb chops on top. Put a little extra pesto on top if liked. Any remaining pesto can be kept in the fridge to use for another recipe."]}, {"isVegetarian": false, "title": "Grilled lamb chops with chilli jam and grilled lamb belly Thai salad", "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chops_with_01274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6-8 red chillies, chopped", "2 tbsp water", "150g/5½oz caster sugar", "2 tbsp mirin", "1 lime, juice only", "1 lamb belly, trimmed of excess fat", "2 limes, juice only", "3 garlic cloves, crushed", "1 tbsp ginger, finely grated", "2 tbsp palm sugar", "4 tbsp nuoc nam (Vietnamese fish sauce)", "1 red chilli, finely chopped", "1 red chilli, sliced", "115g/4oz mizuna leaves", "1 large bunch mint, leaves picked", "½ coconut, shell removed, flesh shredded", "½ cucumber, halved lengthways, sliced thinly on the diagonal", "12 lamb chops, fully trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, heat the chopped chillies, water, sugar, mirin and lime juice in a saucepan until boiling. ", "Cook, stirring continuously, for 6-8 minutes then remove the pan from the heat and set aside to cool - the jam will thicken as it cools.", "For the salad, preheat the grill to medium high. Place the lamb belly onto a heavy grill tray and place under the grill for 7-8 minutes, turning half way through, then remove from the grill and rest for five minutes.", "Place the lime juice, garlic, ginger, palm sugar, fish sauce and the chopped red chillies into a pestle and mortar or food processor and blend until combined.", "Place the sliced chilli, mizuna, mint leaves, coconut and cucumber into a bowl and gently mix to combine.", "Slice the lamb belly into fine strips then mix into the salad. Add the dressing to the salad and mix once more.", "To cook the chops, heat a griddle pan until very hot. Brush the chops with a little oil then season with salt and freshly ground black pepper.", "Place the chops on the griddle and cook on each side for 2-3 minutes until cooked but still pink then remove and rest for two minutes on a warm plate.", "Place three lamb chops onto each serving plate, spoon the chilli jam alongside and pile the salad beside the lamb chops."]}, {"isVegetarian": false, "title": "Grilled lamb steaks with braised fennel", "url": "www_bbc_co_uk_food_recipes_grilled_lamb_steaks_with_88836", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 225g/8oz lamb leg steaks", "salt and freshly ground black pepper", "2 tbsp grapeseed oil", "2 garlic cloves, chopped", "2.5cm/1in piece fresh root ginger, peeled and grated", "1 tbsp clear honey", "6 tbsp light soy sauce", "3 tbsp olive oil", "2 tbsp olive oil", "2 fennel bulbs, trimmed and quartered", "1 tsp fennel seeds", "2 lemons, juice only", "125ml/4fl oz pastis "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To marinade the steaks, add them to a bowl with all of the marinade ingredients and season with salt and freshly ground black pepper. Put in the fridge, covered, for at least an hour, but preferably overnight.", "Preheat the oven to 200C/180C Fan/Gas 6.", "For the braised fennel, heat the oil in a sauté pan. Once hot, add the fennel and the fennel seeds. Cook on each side for 3-4 minutes or until the fennel is golden-brown. Add the pastis to the pan and reduce by half. Add the lemon juice and 125ml/4fl oz water and reduce again by a half before seasoning with salt and freshly ground black pepper. Transfer to the oven for 15-20 minutes, or until the fennel is tender.", "Meanwhile, to cook the steaks, heat a griddle pan until hot and place the steaks on the griddle. Cook for 3-4 minutes on each side, or until cooked to your liking. Remove the steaks from the pan, season with salt and freshly ground black pepper and set aside in a warm place to rest.", "To serve, put the braised fennel in the centre of the plate and top with slices of the lamb steak. Finish with the pan juices from the braised fennel."]}, {"isVegetarian": false, "title": "Grilled mackerel and mackerel tartare with shallot rings, croûtons and coriander cress", "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_and_54030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 mackerel fillets, 1 skinned, pin-boned and finely diced, 1 left whole", "1 shallot, finely diced", "1 lemon, zest and juice only", "2 tbsp finely chopped fresh chives", "2 tsp baby capers, drained, finely chopped", "50g/1¾oz crème fraîche", "100ml/3½fl oz rice wine vinegar", "20g/¾oz caster sugar", "2 banana shallots, finely sliced into rings", "3 tbsp finely chopped celery", "½ bunch radishes, preferably the French Breakfast variety", "pinch salt", "3 tbsp finely chopped celery leaves", "100ml/3½fl oz olive oil", "1 baguette, thinly sliced", "2 tbsp coriander cress, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel tartare, mix all of the mackerel tartare ingredients, apart from the whole mackerel fillet, together in a bowl until well combined. Chill in the fridge until needed.", "Preheat the grill to a medium setting. Place the whole mackerel fillet on a baking tray and grill for 2-3 minutes, or until browned on top and cooked through. Set aside.", "For the shallot rings, heat the rice wine vinegar and sugar in a non-reactive saucepan over a medium heat. When the mixture is just coming up to the boil, add the shallot rings, celery stalk, radishes and salt. Set aside to macerate for 5 minutes. Stir in the celery leaves just before serving.", "For the croûtons, heat the oil in a heavy-based frying pan over a medium heat until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) Add the baguette slices to the hot oil, in batches if necessary, and fry for 2-3 minutes on each side, or until golden-brown on both sides and crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "To serve, divide the croûtons equally among four serving plates. Top each croûton with a spoonful of the mackerel tartare. Spoon the shallot rings and macerating liquid alongside. Garnish with the coriander cress and a small piece of grilled mackerel."]}, {"isVegetarian": false, "title": "Grilled mackerel with pickled turnip, asparagus and watercress", "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_with_45828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 white turnip, thinly sliced on a mandoline", "110ml/4fl oz white wine vinegar", "1 tsp sugar", "1 tsp salt", "50g/2oz flatleaf parsley, leaves only", "50g/2oz butter", "½ onion, finely chopped", "150g/5oz watercress leaves", "250ml/9fl oz vegetable stock", "12 spears asparagus, trimmed", "3 tbsp extra virgin olive oil", "4 mackerel fillets", "2 tbsp baby watercress leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the turnip in a heatproof bowl.", "Put 110ml/4fl oz water in a pan with the white wine vinegar, sugar and salt, and heat until the salt and sugar have dissolved. ", "Pour over the turnip and set aside to pickle for two hours, then drain off the pickling liquid.", "Bring a pan of salted water to the boil, add the parsley and blanch then refresh in iced water.", "Drain, squeeze dry then roughly chop and set aside.", "Heat a frying pan until hot, add the butter and onion and cook for a few minutes until just softened.", "Add the watercress and stock and bring to the boil then add the chopped blanched parsley.", "Ladle in batches into a food processor then blend to a fine purée and pass through a fine sieve then set aside.", "Bring a pan of salted water to the boil, add the asparagus and blanch for 2-3 minutes until just tender.", "Drain and season the asparagus with a little olive oil, salt and black pepper.", "Preheat the grill to high.", "Place the mackerel onto a grill tray and season with salt and black pepper.", "Grill for two minutes on each side.", "To serve, place a spoonful of parsley purée onto the centre of each serving plate and smear across the centre of the plate. Place the mackerel on top and scatter the asparagus and turnips around the plate. Finish with a scattering of baby watercress and drizzle of oil."]}, {"isVegetarian": false, "title": "Grilled mackerel with dulse butter", "url": "www_bbc_co_uk_food_recipes_grilled_mackerel_with_49800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz dulse seaweed (available from specialist suppliers and some health-food shops)", "175g/6oz butter, softened", "½ lemon, juice only", "2 fresh mackerel, guts removed (ask your fishmonger to do this for you, or to butterfly the mackerel for you)", "1 shallot, thinly sliced", "75g/3oz broad beans (without pods, inner membranes removed)", "100g/3½oz fresh peas, half removed from their pods, half split but left in the pods", "12 asparagus spears, trimmed", "4 sprigs fresh tarragon, leaves only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Soak the dulse seaweed in cold water for about 10 seconds, then drain well and roughly chop. Blend in a food processor until finely chopped, then add the softened butter and blend until well combined. Add the lemon juice and blend once more. (You can keep any you don't use in the freezer.)", "To butterfly the mackerel, open up each mackerel belly and slide a sharp knife in under the rib cage, flicking the bones away from the flesh. Snip the bones at the head end and tail end, then lift out the whole rib cage and any bones. Open the mackerel out slightly, then spoon the butter down the centre, leaving just one large spoonful in the bowl.", "Make 2 open parcels of aluminium foil to hold the mackerel and place them onto a baking tray. Lay the butterflied mackerel inside the foil parcels and grill for 5-10 minutes, until the butter has melted and the mackerel is just cooked through.", "Meanwhile cook the vegetables. Bring 100ml/3½fl oz water to the boil in a large frying pan. Add the shallots and broad beans and simmer for 2 minutes, then add the peas and the pods and simmer for 1 minute. Add the asparagus spears and tarragon sprigs and return the water to a simmer. Add the last spoonful of dulse butter to the water and simmer the asparagus and vegetables for a further 2 minutes, or until the asparagus are tender and the butter has emulsified. Season the vegetables, to taste, with salt and freshly ground black pepper.", "Lift the mackerel out of the aluminium trays and onto the serving plates, drizzling any excess butter from the trays over the top. Spoon the vegetables alongside."]}, {"isVegetarian": false, "title": "Grilled monkfish cheeks with umeboshi and shiso dressing", "url": "www_bbc_co_uk_food_recipes_grilled_monkfish_cheeks_52393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz crushed garlic", "25g/1oz fresh root ginger, grated with juice", "50g/1¾oz umeboshi paste (made from pickled ume fruits), available from specialist Japanese suppliers", "1 lime, juice and zest only ", "200ml/7fl oz light olive oil", "10 green shiso leaves, chopped", "¼ bunch flatleaf parsley", "8 medium-sized monkfish cheeks", "4 baby gem lettuce, quartered", "1 avocado, firm but ripe, quartered", "6 asparagus spears", "sea salt", "light olive oil", "35g/1¼oz edamame beans", "12 small mint leaves "], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the dressing, mix together the garlic, ginger and umeboshi in a bowl.  Add the lime juice and zest, then whisk in the oil. Stir in the herbs and set aside.  ", "For the grilled monkfish, preheat the grill to high. ", "Place the monkfish cheeks in a shallow dish and pour over half of the dressing. Leave to marinate for 30 minutes.", "Heat a large saucepan of boiling water and blanch the asparagus for one minute, then remove and put into cold water to cool it, then drain.", "Cover the lettuce, avocado and asparagus in a little olive oil and sprinkle with salt to taste. Place the lettuce, avocado and asparagus under the grill. Remove the vegetables as they cook and are charred on each side. Reserve the grilled vegetables at room temperature.", "Grill the monkfish cheeks for 2-3 minutes on each side.  Once removed from the grill, toss the cheeks in some of the marinade.  Leave the cheeks to rest for three minutes to finish cooking.", "To serve, cut the vegetables into bite-sized pieces and toss with the edamame beans and mint leaves. Lay the vegetables on a serving platter and dress them.", "Lay the monkfish cheeks on top of the vegetables. Finish with the remaining dressing and serve."]}, {"isVegetarian": true, "title": "Grilled peach, burrata and basil salad with Dijon dressing", "url": "www_bbc_co_uk_food_recipes_grilled_peach_burrata_88873", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_peach_burrata_88873_16x9.jpg", "ingredients": ["3 tbsp extra virgin olive oil", "1 tbsp balsamic vinegar (not a syrupy one)", "1 tsp Dijon mustard", "flaked sea salt and freshly ground black pepper", "2 tsp olive oil", "4 peaches, almost ripe but not too soft, quartered and stoned", "200g/7oz ball burrata, drained and torn into chunks (or 2 x 125g/4½oz balls mozzarella)", "70g/2½oz bag rocket", "1 bunch of basil, leaves only, roughly torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, lightly whisk all the ingredients together in a small bowl. Season to taste and set aside.", "For the peaches, lightly grease a griddle pan or barbecue with the oil and then get it nice and hot. You may have to work in batches, depending on the size of your pan. Place the peach quarters, cut-side down on the griddle pan or barbecue for 1-2 minutes to give a nice chargrilled mark on them. ", "Use a metal fish slice to help lift them up so as not to leave the chargrilled marks behind. Turn them onto their other cut side for another minute (don’t cook on their skin side). The charring will add to the flavour. You can also use a frying pan to cook them, but obviously you won’t get the char-grilled lines on them. Sit the peaches cut side up on a large serving platter as you go. ", "Arrange the buratta chunks (or mozzarella) around the peaches and scatter the rocket and basil leaves over. Scatter a little salt and pepper on top. Quickly whisk up the dressing again if necessary, drizzle it over and serve."]}, {"isVegetarian": true, "title": "Grilled pineapple", "url": "www_bbc_co_uk_food_recipes_grilled_pineapple_89456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pineapple, peeled, cored and cut into 8 wedges", "1 lime, juice only", "1 tbsp maple syrup", "1 tsp ground ginger", "1 tbsp dark rum", "4 tbsp plain yoghurt or crème fraiche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a barbecue or griddle pan to a high heat.", "Place the pineapple in a large bowl. Add the lime juice, maple syrup, ginger and rum and mix well to combine.", "Cook the pineapple for 2–3 minutes on each side, or until lightly charred. ", "Serve with the yoghurt or crème fraiche."]}, {"isVegetarian": false, "title": "Grilled pork chop with crisp black pudding, cider sauce and greens", "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_18109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "4 Bramley apples, peeled and cut into chunks", "50g/1¾oz caster sugar", "200ml/7fl oz scrumpy cider", "200g/7oz black pudding", "50g/1¾oz plain flour", "2 free-range eggs, beaten", "50g/1¾oz Japanese panko breadcrumbs", "rapeseed oil, for deep frying", "1 kg/2lb 4oz bone-in pork loin, French trimmed, cut into four thick chops", "salt and pepper", "50g/1¾oz unsalted butter", "25g/1oz unsalted butter", "1 head of spring greens, sliced thickly", "salt and pepper", "250ml/9fl oz pork jus or gravy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cider sauce, heat the butter in a saucepan. Add the apples, sugar and the scrumpy cider. Bring to a simmer over a gentle heat and cook until the apples are very soft. Add a little more cider or water if the mixture becomes too dry. Stir from time to time.", "For the crisp black pudding, cut the pudding into 2½cm/1in chunks. Dust the pieces in flour, dip in the beaten egg and coat with panko breadcrumbs. Store in the fridge until ready to cook.", "For the pork chops, preheat a grill to high. Season the pork chops with salt and pepper. ", "Place the chop in an ovenproof frying pan and place under the grill. Cook on both sides for 3-4 minutes. Remove from the grill and place on the hob. Add the butter and, when melted, use it to baste the chop. Set the chops aside to rest before serving.", "For the crisp black pudding, heat a deep fat fryer to 180C/350F, or heat the rapeseed oil in a deep-sided, heavy based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the coated black pudding for 2-3 minutes, or until crisp. Remove from the fryer and drain on kitchen paper. ", "For the spring greens, in a pan heat the butter with 50ml/2fl oz water to make an emulsion. Add the greens, cover with a lid and steam for 2-3 minutes. Season with salt and pepper.", "To serve, place a pork chop on each plate with a spoonful of cider sauce, crisp black pudding and greens. Drizzle over the pork jus or gravy."]}, {"isVegetarian": false, "title": "Grilled pork chop with cauliflower cheese and cabbage", "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_58226", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz pork chops", "salt and freshly ground black pepper ", "2 tbsp olive oil", "50g/2oz unsalted butter", "200g/7oz spring cabbage, finely shredded", "1 large cauliflower, cut into florets", "50g/2oz butter, plus extra for greasing", "50g/2oz plain flour", "450ml/16fl oz milk", "2 free-range eggs, yolks only", "1 tsp English mustard", "splash Worcestershire sauce", "salt and freshly ground black pepper", "200g/7oz Lincolnshire Poacher (or strong cheddar) cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the grilled pork chops, preheat the oven to 200C/400F/Gas 6.", "Season the pork chops with salt and freshly ground black pepper then rub with a little of the olive oil.", "Heat a griddle pan until hot, add the pork chops and cook on each side until golden brown then transfer the griddle pan to the oven and cook for 5 minutes until the pork is just cooked through.", "Remove the pork from the oven and set aside to rest for 4-5 minutes.", "Meanwhile, heat a frying pan until hot, add the butter and cabbage and stir fry for 2-3 minutes until just tender. Season with salt and freshly ground black pepper and set aside until needed.", "For the cauliflower cheese, preheat oven to 200C/400F/Gas 6.", "Bring a large pan of salted water to the boil, then add the cauliflower florets and cook for two minutes.", "Drain and place the cauliflower in a buttered oven-proof dish.", "Place the butter and flour into a saucepan and heat to melt the butter.", "Cook, stirring for one to two minutes until lightly golden-brown.", "Remove the pan from the heat and gradually whisk in the milk to form a smooth sauce.", "Return the sauce to the heat and simmer for two to three minutes.", "Remove from the heat and beat in the egg yolks, mustard and Worcestershire sauce and half the cheese.", "Season with salt and pepper then pour over the cauliflower and top with the remaining cheese.", "Place the cauliflower cheese under the grill and cook until golden-brown. ", "To serve, place a spoonful of cabbage into the centre of the plate then place the pork chop on top. Spoon the cauliflower cheese alongside."]}]