[{"ingredients": ["gran puñado de menta fresca, hojas recogidas", "6 limones, jugo y ralladura de 3", "3 cucharadas de jarabe de caña de azúcar", "agua mineral con gas, para recargar"], "method": ["Coloque las hojas de menta en una toalla de té y magullado con un rodillo.", "Agregue la menta a una jarra, con el jugo de limón y la ralladura y el jarabe de caña de azúcar.", "Rellene con agua con gas. Mezcle bien el cóctel y agregue más jarabe de caña de azúcar, al gusto.", "Enfríe en la nevera."], "url": "www_bbc_co_uk_food_recipes_mint_lemonade_67943", "title": "Limonada de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mint_lemonade_67943_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Cebolla de 75 g / 2½ oz, finamente picada", "2 dientes de ajo, finamente picados", "10g de hojas de menta finamente picadas", "25 g / 1 oz de mantequilla clarificada", "100 g / 3½ oz de carne de cordero", "25g / 1oz de pan blanco fresco", "100 g / 3½ oz de avellanas peladas tostadas, más o menos picadas", "1 limón, ralladura solamente", "1 x 2.5kg / 2lb 12oz hombro de cordero, deshuesado", "6 papas, peladas y en rodajas finas", "4 cebollas, en rodajas finas", "sal y pimienta negra recién molida", "100g / 3½oz de mantequilla sin sal", "350ml / 12fl oz de caldo de pollo o cordero", "1 manojo grande de menta fresca, hojas recogidas, finamente picadas", "75ml / 2½fl oz de vinagre de malta", "25 g / 1 oz de azúcar en polvo", "250ml / 9fl oz de jugo de cordero o salsa"], "method": ["Para el hombro de cordero relleno de menta, precaliente el horno a 170C / 340F / Gas 3½.", "Calentar una sartén y agregar la mantequilla. Una vez caliente, agregue la cebolla y el ajo y cocine durante 3-4 minutos hasta que estén suaves.", "Coloque la cebolla y el ajo en un bol y deje que se enfríen, luego agregue el resto de los ingredientes, aparte del hombro de cordero, y mezcle para hacer el relleno.", "Coloque el hombro de cordero en una tabla y distribuya el relleno de menta dentro del cordero. Enrollar y atar con hilo de cocina.", "Coloque el cordero directamente en la rejilla en el horno y cocine durante una hora mientras prepara las papas.", "Para las patatas Boulangère, mezcle las papas y las cebollas en un recipiente y sazone con sal y pimienta.", "Use la mantequilla para cubrir el fondo de una lata de horno profunda. Coloque las papas y las cebollas encima y vierta sobre el caldo.", "Coloque la lata de asar en un estante bajo en el horno y coloque el cordero directamente sobre el estante inmediatamente superior, de modo que los jugos goteen sobre las papas.", "Cocine el cordero y las papas por otras dos horas.", "Para la salsa de menta, ponga la menta picada en un tazón pequeño.", "Caliente el vinagre y el azúcar en una cacerola hasta que hierva a fuego lento y vierta la mezcla en la menta. Revuelva hasta que esté bien combinado.", "Para servir, tallar el hombro de cordero y colocarlo en un plato. Sirva las papas al lado y vierta sobre la salsa de menta y el jugo de cordero o la salsa."], "url": "www_bbc_co_uk_food_recipes_mint_stuffed_lamb_33581", "title": "Paletilla de cordero rellena de menta con patatas Boulangère y salsa de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla salada, enfriada y cortada en cubos de 1cm / ½ en cubitos", "75 g / 2½ oz de manteca de cerdo, refrigerado y cortado en cubos de 1 cm / ½ in", "Harina normal de 200 g / 7 oz, tamizada, más extra para quitar el polvo", "½ cucharadita de sal", "1 cucharadita de jugo de limón", "1 huevo grande de granja, batido, para lavar huevos", "montón de menta fresca, hojas recogidas", "pizca de sal de mesa", "1 cucharada de azúcar en polvo", "50ml / 2fl oz de vinagre de vino blanco", "Filete de pierna de cordero de 100 g / 3½ oz cortado en cubos de 1.5cm / ⅝in", "1 diente de ajo, aplastado", "½ cucharadita de romero seco", "sal y pimienta negra recién molida", "½ cebolla roja grande, finamente picada", "½ papa dulce grande, picada en cubos pequeños", "1 zanahoria mediana, picada en cubos pequeños", "½ manojo de perejil fresco de flatleaf, hojas recogidas y picadas", "½ cucharadita de orégano seco", "Guisantes congelados de 50 g / 2 oz, descongelados"], "method": ["Para la pasta de hojaldre áspera, ponga la mantequilla y la manteca de cerdo en un tazón y mezcle brevemente. Coloque la harina y la sal en un tazón grande para mezclar y, con las puntas de los dedos, frote brevemente aproximadamente un cuarto de la mantequilla y la mezcla de manteca de cerdo en la harina (aún debe ver trozos de mantequilla).", "Agregue 50ml / 2¾ fl oz de agua fría y el jugo de limón y mezcle hasta que se junte para formar una masa. Aproximadamente dale forma a la masa en un rectángulo.", "En una superficie de trabajo ligeramente enharinada, extienda la masa en un rectángulo de aproximadamente el grosor de una moneda de una libra. Con un extremo corto del rectángulo hacia usted, esparza la manteca y la manteca restante sobre los dos tercios superiores de la masa. Dobla el tercio inferior sobre la mantequilla, luego dobla el tercio superior hacia abajo. Gire la masa 90 grados, luego extienda la masa en un rectángulo como antes y repita el plegado. Gire, enrolle y doble la masa otras dos veces, luego envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Para la salsa de menta, espolvorea las hojas de menta con un poco de sal y pica finamente. Transfiera a una jarra y vierta sobre 100ml / 3½fl oz de agua hirviendo. Agregue el azúcar, revuelva bien y deje enfriar. Cuando se enfríe, agregue el vinagre de vino blanco.", "Para la pasta de hojaldre basta, saque la masa refrigerada de la nevera y repita la laminación y doblado una vez más, luego vuelva a colocarla en la nevera durante otros 20 minutos.", "Para el relleno, en un tazón mediano combine el cordero, el ajo y el romero seco. Agregue la mitad de la salsa de menta y sazone con sal y pimienta. Cubra con film transparente y reserve.", "Agregue la cebolla, la batata, las zanahorias, el perejil y el orégano a un recipiente aparte. Agregue el resto de la salsa de menta, sazone con sal y pimienta y mezcle bien. Finalmente agregue los guisantes congelados y vuelva a mezclar.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee dos bandejas grandes para hornear con papel para hornear.", "Extienda la masa a aproximadamente 3 mm de grosor. Cortar 6 círculos, aproximadamente 13 cm / 5 pulgadas de diámetro con un pequeño plato o plato como una guía. Todos los recortes pueden desplegarse nuevamente para hacer más círculos.", "Ponga algunas cucharadas del relleno vegetal a un lado de cada círculo y cubra con unos trozos de cordero: necesita suficiente para llenar la masa, pero no tanto como para que la masa se abra. Dobla la masa sobre el relleno (para cubrir el relleno) y usa un poco de agua para ayudar a que los bordes de la masa se peguen. Engarce los bordes con los dedos y colóquelos en una bandeja para hornear. Repita hasta que cada bandeja para hornear tenga seis empanadas.", "Cepille cada pastosa con huevo batido y hornee durante aproximadamente 40 minutos, o hasta que estén doradas. Cuando esté cocinado, use una rebanada de pescado para levantar las empanadas en los bastidores de alambre para que se enfríen antes de servir."], "url": "www_bbc_co_uk_food_recipes_minted_lamb_pasties_54960", "title": "Pastel de cordero moteado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 6 empanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Penne 350g / 12oz, rigatoni u otra pasta con forma similar", "8-10 ramitas grandes de menta, hojas retiradas, y cortadas / rotas si son grandes", "150g / 5oz de guisantes congelados", "200g / 7oz de queso feta, desmenuzado", "Bolsa de 50g / 2oz de hojas de cohete", "1 limón, ralladura de ralladura y jugo", "sal marina escamada y pimienta negra recién molida", "aceite de oliva virgen extra", "20-30 aceitunas verdes marinadas de buena calidad, picadas"], "method": ["Cocine la pasta en agua hirviendo con 2 ramitas de menta durante el tiempo indicado en el paquete. 3 minutos antes del final del tiempo de cocción, agregue los guisantes. Una vez que la pasta y los guisantes estén cocidos, escurrirlos en un colador y agitar con agua fría hasta que se enfríen. Deseche las ramitas de menta.", "Transfiera a un tazón grande y agregue el queso feta, el cohete, la menta restante, la ralladura de limón y la mitad del jugo, sal y pimienta y un buen glug de aceite de oliva. Cortar o romper las aceitunas en una mano y un mortero y agregar a la pasta. Mezcle bien y agregue más jugo de limón, aderezo o aceite de oliva, si lo prefiere.", "Empaque en recipientes adecuados para llevar a cabo un picnic o sirva caliente como parte de un plato principal o entrante con una barbacoa."], "url": "www_bbc_co_uk_food_recipes_mintedfetarocketando_67597", "title": "Ensalada de pasta Feta, rúcula y aceituna", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mintedfetarocketando_67597_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, pelada, picada", "500ml / 18fl oz de caldo de pollo o vegetal", "85g / 3oz de guisantes congelados", "3 cucharadas de crema doble", "3 cucharadas de menta fresca picada", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado, para servir"], "method": ["Caliente el aceite en una cacerola a fuego medio y fría la cebolla durante 2-3 minutos, o hasta que se ablande. Verter en el caldo y llevar a ebullición.", "Agregue los guisantes y cocine por 2-3 minutos. Agregue la crema y dos cucharadas de menta, luego mezcle hasta que quede suave utilizando una licuadora de mano. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva la sopa en un bol, adornada con la menta picada restante y el perejil."], "url": "www_bbc_co_uk_food_recipes_mintedpeasoup_92883", "title": "Sopa de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de pan rallado", "2 cucharadas de menta fresca", "1 cucharada de perejil fresco", "2 chuletas de cordero", "100 g / 3½ oz de harina", "1 huevo de gallinas camperas, batido", "1 cucharada de aceite de oliva", "1 cucharada de perejil fresco, picado", "1 cucharada de vinagre de vino blanco", "25g / 1oz de mantequilla", "25g / 1oz de azúcar moreno", "2 chalotes pequeños, pelados"], "method": ["Para preparar las chuletas de cordero, use una licuadora para mezclar las migas de pan, la menta y el perejil hasta que estén bien combinadas. Coloque en un tazón.", "Cubra las chuletas de cordero en la harina y luego sumerja en el huevo y en las migas de pan hasta que estén bien cubiertas. Sazonar con sal y pimienta negra recién molida.", "Calentar una sartén a fuego medio. Agregue el aceite y coloque las chuletas de cordero en la sartén. Cocine por tres minutos.", "Dé vuelta las chuletas y cocine por otros tres minutos.", "Retire las chuletas y déjelas reposar por tres minutos.", "Para hacer el puré de guisantes, coloque la mitad de los guisantes, el perejil y el vinagre de vino blanco en una pequeña licuadora y mezcle hasta que quede suave.", "Doble la otra mitad de los guisantes cocidos en la mezcla de guisantes.", "Para hacer los chalotes caramelizados, en una sartén pequeña sobre un fuego caliente, agregue la mantequilla y el azúcar juntos durante un minuto.", "Agregue los chalotes y cocine hasta que estén dorados.", "Baje el fuego y cocine por otros dos minutos.", "Sirva las chuletas de cordero con los guisantes y los chalotes caramelizados a un lado."], "url": "www_bbc_co_uk_food_recipes_mintlambshallotsserv_76050", "title": "Chuletas de cordero a la menta servidas con puré de guisantes y chalotes asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de menta fresca, picada", "1 cucharadita de azúcar en polvo", "1 cucharada de agua caliente", "2 cucharadas de vinagre de vino blanco"], "method": ["Mezcle todos los ingredientes y permanezca durante 20 minutos para permitir el desarrollo del sabor a menta. La salsa de menta clásica para servir con cordero asado."], "url": "www_bbc_co_uk_food_recipes_mintsauce_1303", "title": "Salsa de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo", "1 cebolla", "1 zanahoria", "1 palo de apio", "1 hoja de laurel", "6 granos de pimienta", "30g / 1oz de mantequilla", "Harina normal de 30g / 1oz", "140ml / 5fl oz de vino blanco", "1 yema de huevo de gallinas camperas", "2-3 cucharadas de crema doble", "exprimir jugo de limón", "sal y pimienta negra recién molida", "pequeño puñado de perejil fresco, picado"], "method": ["Coloque las pechugas de pollo en una sartén con las verduras y los granos de pimienta y cúbralas con agua.", "Llevar a ebullición gradualmente y cocine a fuego lento hasta que el pollo esté cocido durante todo el proceso, aproximadamente 30 minutos.", "Retire con cuidado las pechugas de pollo del líquido de cocción y manténgalas calientes.", "Cuele el líquido de cocción en una sartén limpia, descartando las verduras cocidas. Reserve aproximadamente 450ml / 16fl oz del líquido.", "Derrita la mantequilla en una sartén por separado y agregue la harina. Cocine hasta que la mezcla forme una pasta suave que deje limpios los lados y la base de la sartén.", "Poco a poco agregue el líquido de cocción reservado a la mezcla, un cucharón a la vez, lo que permite hervir después de cada adición antes de batir bien. Revuelva hasta que la mezcla se mezcle suavemente.", "Vierta el vino blanco en la salsa y reduzca el fuego a bajo.", "En un tazón pequeño, combine la yema de huevo con la crema doble. Revuelva el huevo y la crema en la salsa.", "Agregue un chorrito de jugo de limón y sal y pimienta negra recién molida al gusto.", "Corte el pollo cocido en trozos del tamaño de un bocado y mezcle con la salsa.", "Adornar con perejil fresco picado y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_mirandaschickeninwhi_85673", "title": "Pollo en salsa de vino blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de pasta de miso blanco", "6 cucharadas de sake", "2 dientes de ajo, finamente rallados", "10g / ¼ oz de raíz de jengibre fresco, pelado y finamente rallado", "2 cucharadas de azúcar en polvo", "1 cucharada de vinagre de vino de arroz", "4 x 200g / 7oz de espesor filete de bacalao negro, piel en", "salpicar aceite vegetal", "2 limas, descuartizado", "ensalada micro, para adornar", "6 cucharadas de semillas de sésamo", "½ cucharadita de azúcar", "2 cucharadas de salsa de soja sazonada", "2 cucharadas de aderezo dashi líquido", "2 buenas salpicaduras de jugo de cítricos, como el jugo de limón yuzu", "una pizca de pimienta japonesa sansho (use pimienta blanca si no puede agarrar esto)", "600g / 1lb 5oz choi sum (también puedes usar pak choi o espinacas)"], "method": ["Mezcle todos los ingredientes del adobo y colóquelos en un recipiente no metálico.", "Para el bacalao negro, agregue el pescado al adobo, cubra con una película adhesiva y colóquelo en el refrigerador preferiblemente durante la noche o un mínimo de dos horas.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C).", "Engrase ligeramente una bandeja para hornear antiadherente. Coloque el pescado, con la piel hacia abajo, sobre la bandeja de hornear.", "Ponga más de dos cucharadas de adobo y hornee durante 10-12 minutos, dependiendo del grosor del pescado.", "Precalienta la parrilla. Retire el pescado del horno, coloque el adobo restante sobre el pescado, colóquelo debajo de la parrilla y cocínelo hasta que se dore.", "Para los verdes chinos con salsa de sésamo, caliente una sartén antiadherente pequeña y fría las semillas de sésamo hasta que estén ligeramente doradas. Poner en una mano y un mortero. Moler a casi una pasta, pero aún con un poco de textura.", "Agregue el azúcar, la salsa de soya, el dashi y el jugo de cítricos. Dale una buena rutina para incorporar todos los sabores. Agregue un par de chispas de pimienta japonesa sansho.", "Enjuague bien los verdes, recorte la base de los tallos y corte el resto en trozos del tamaño de un bocado.", "Coloque un recipiente de vapor encima de una olla con agua hirviendo. Cueza al vapor el brócoli durante 1-2 minutos o hasta que esté tierno. Transfiera a un plato de servir adecuado y cuchara sobre la salsa.", "Sirva el pescado con los verdes chinos y con rodajas de limón y ensalada de micro en el lateral."], "url": "www_bbc_co_uk_food_recipes_miso-baked_black_cod_01223", "title": "Bacalao negro al horno", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de bacalao, piel sobre", "2 limas, solo jugo", "80g / 3oz de miso blanco", "¼ pequeño perifollo de racimo, finamente picado", "½ eneldo pequeño, finamente picado", "1/2 perejil pequeño, finamente picado", "mantequilla para engrasar", "aceite de oliva, para freír", "2 daikons, cortados en una mandolina, luego cortados en círculos con un cortador de 4 cm.", "100 g / 3½ oz de azúcar en polvo", "180ml / 6fl oz de vinagre de arroz", "1 pera nashi, pelada y cortada en pedazos", "2 nabos para bebés, cortados por la mitad", "¼ de pepino, semillas eliminadas y cortadas en pedazos", "¼ racimo de rábano rosado, cortado por la mitad", "1 aguacate, pelado y cortado en pedazos", "Tofu de seda 320g / 11oz", "50ml / 2fl oz de salsa de soja", "30 g / 1 oz de azúcar en polvo", "la salchicha huérfana", "30ml / 1fl oz de vinagre de jerez", "40ml / 1½fl oz de aceite de sésamo", "120ml / 4fl oz de aceite vegetal", "1 lima, ralladura solamente", "2 cucharadas de cilantro fresco picado"], "method": ["Para el bacalao, mezcle el jugo de lima y el miso, luego frótelo en los filetes de bacalao. Mezcle las hierbas picadas en un tazón y sumerja el lado no bañado del bacalao en ellas, luego coloque en una hoja de papel engrasado con mantequilla.", "Caliente el aceite en una sartén antiadherente. Agregue los filetes de bacalao, con la base de hierba hacia abajo, y cocínelos durante 3 minutos por cada lado. Retire de la sartén y reserve. Cuando esté lo suficientemente frío para manipularlo, quítele la piel.", "Para el daikon en vinagre, mezcle el azúcar y el vinagre en 180 ml // 6 fl oz de agua. Agregue el daikon y reserve.", "Para la ensalada, caliente una olla grande de agua hirviendo y blanquee la pera, nabos, pepino y rábanos. Drene y coloque en agua helada, luego drene nuevamente.", "Mezcle todos los ingredientes en un tazón grande, junto con el aguacate.", "Para el aderezo, en una licuadora, mezcle el tofu hasta que quede suave. Agregue todos los otros ingredientes aparte del aceite vegetal, y pulse hasta que todo se una.", "Agregue el aceite vegetal un poco a la vez, mientras licua, hasta que la consistencia se asemeje a un pudin suelto.", "Para servir, vierta el aderezo sobre la ensalada y mezcle y adorne con el daikon en escabeche. Coloque un poco de papel a prueba de grasa en un plato de servir y cubra con el bacalao cocido y ralle sobre un poco de ralladura de lima fresca."], "url": "www_bbc_co_uk_food_recipes_miso-glazed_cod_with_13934", "title": "Bacalao glaseado con ensalada de aguacate y rábano, aderezo de tofu y daikon en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz 150 g / 5½ oz", "Mangetout 150g / 5½ oz", "3 cebolletas, picadas", "1 cucharada de aceite de sésamo", "1 cucharada de semillas de sésamo", "1 lima, solo jugo", "2 cucharadas de cilantro finamente picado", "1 berenjena grande, partida a la mitad a lo largo, carne marcada en un patrón entrecruzado que no perfora la piel", "2 cucharadas de miso blanco", "Jengibre fresco de raíz 5cm / 2in, pelado y finamente rallado", "1 cucharadita de miel líquida (o alternativa vegana)", "1 cucharadita de salsa de soja", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una olla grande de agua ligeramente salada y cocine los fideos de acuerdo con las instrucciones del paquete.", "Mientras tanto, coloque el mangetout en un barco a vapor o en un colador y póngalo sobre el agua hirviendo a vapor con la tapa puesta durante 2 minutos. Escurra los fideos y mezcle con el mangetout, las cebolletas, el aceite de sésamo y las semillas, 1 cucharada de jugo de lima y el cilantro. Sazonar con sal y pimienta y reservar.", "Caliente la parrilla a lo alto y forre una bandeja para hornear con papel de cocina. Coloque la berenjena en la bandeja, con el lado de la piel hacia arriba, y ase a la parrilla durante 10 minutos, o hasta que la piel se haya endurecido y la carne esté suave.", "Mientras tanto, mezcle el miso, el jengibre, la miel, la salsa de soja y 1 cucharada de jugo de lima en un tazón pequeño.", "Voltee la berenjena e introduzca la mezcla de miso en los surcos. Ase a la parrilla durante 5 minutos, con la carne hacia arriba, comprobando después de 3 minutos que el miso se asa a la par. Debe estar parcheado con marrón pero no quemado.", "Cortar la berenjena en rodajas gruesas y colocar encima de los fideos. Sirva caliente oa temperatura ambiente o divídalo entre dos loncheras."], "url": "www_bbc_co_uk_food_recipes_miso_aubergine_with_01293", "title": "Miso berenjena con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_aubergine_with_01293_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza de ajo elefante", "2 dientes de ajo elefante, rallados", "1 lima, jugo y ralladura", "1 chile verde, finamente picado", "2 cucharadas de vinagre de vino de arroz", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada", "1 cucharada de eneldo fresco picado", "1 cucharada de albahaca fresca picada", "60ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida", "600ml / 21fl oz Jersey leche entera crema", "2 hojas de laurel", "1 ramita de romero", "rociar aceite de oliva", "1 cucharadita de jugo de limón", "2 cucharadas de pasta de miso blanco", "1 cucharada de aceite de sésamo", "8 berenjenas para bebés (o 2 berenjenas grandes), partidas en dos y anotadas"], "method": ["Caliente una sartén o barbacoa a fuego alto y coloree la cabeza de ajo del elefante en todos los lados. Envuelva en papel de aluminio y colóquelo en una parte fría de la barbacoa o en un horno precalentado a 120C / 100C Fan / Gas ½.", "Para hacer la ricota, coloca la leche en una olla con las hierbas, el aceite de oliva y una pizca de sal. Llevar a ebullición, luego batir el jugo de limón. Retire del fuego y espere a que la leche se separe. Verter en un colador forrado con gasa sobre un tazón grande y dejar escurrir.", "Para hacer la berenjena mezcle la pasta de miso con el aceite de sésamo y 2 cucharadas de agua, hasta que quede suave. Cepille cada mitad de berenjena con la mezcla de miso. Cocine en la barbacoa o en una sartén caliente durante 5-10 minutos a cada lado, rociando con el miso, hasta que esté bien cocido y chamuscado.", "Para hacer el aderezo, coloque el ajo rallado, el jugo de limón y la ralladura, el chile, el vinagre y las hierbas en un almirez y mortero y sazone con sal y pimienta. Exprime el ajo de la cabeza y mezcla con el aderezo.", "Para servir, coloque la ricota en un plato con la berenjena. Rocíe con el aderezo y sirva."], "url": "www_bbc_co_uk_food_recipes_miso-grilled_aubergine_13151", "title": "Berenjena a la parrilla y ricota casera con ajo elefante y aderezo de chile verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8-12 muslos de pollo de corral, deshuesados ​​y la piel dejada en", "80g / 2¾oz pasta de miso blanco", "Jengibre de raíz 40g / 1½ oz, finamente rallado", "4 cucharadas de mirin", "6 cucharadas de vinagre de sidra", "12 chalotas pequeñas, peladas", "1 cucharada de aceite de girasol", "200ml / 7fl oz de vino blanco", "6 cucharadas de agua", "sal marina y pimienta blanca recién molida", "125g / 4½oz de nueces, rotas", "80g / 2¾oz de mantequilla sin sal", "1½ cucharada de jarabe de arce", "250g / 9 oz pequeñas uvas rojas sin semillas", "1 cucharada de estragón picado"], "method": ["Coloque el pollo en un tazón grande. Mezcle la pasta de miso, jengibre, mirin y cuatro cucharadas de vinagre y vierta la mezcla sobre el pollo. Mezcle hasta que esté bien combinado. Cubra con film transparente y déjelo en el refrigerador para marinar durante al menos tres horas. La noche a la mañana sería ideal.", "Pon los chalotes en una olla pequeña y cúbrelos con agua. Llevar a ebullición y cocinar durante cinco minutos. Colar y cortar los chalotes por la mitad a lo largo.", "Precalentar la parrilla a un ajuste alto. Coloque las piezas de pollo en una bandeja para hornear, con la cara hacia arriba, con todo el adobo y la parrilla durante 10 minutos. Tan pronto como el pollo vaya a la parrilla, caliente el aceite de girasol en una sartén lo suficientemente grande como para caber todo el pollo. Agregue los chalotes y fría a fuego medio durante cuatro minutos, o hasta que se doren. Agregue el vinagre restante, reduzca durante unos segundos y luego vierta el vino, el agua, ½ cucharadita de sal y un poco de pimienta blanca y continúe cocinando durante unos seis minutos.", "Retire el pollo de la parrilla y agréguelo a la sartén junto con los jugos de cocción. Revuelva suavemente y deje todo a fuego lento. Cubra la sartén y cocine durante 3-4 minutos, o hasta que el pollo esté recién cocido.", "Retire el pollo de la sartén y déjelo a un lado en un lugar cálido. Agregue las nueces, la mantequilla, el jarabe de arce y las uvas a la sartén y continúe cocinando, revolviendo hasta que la mantequilla se emulsione, durante 2-3 minutos.", "Sirva el pollo con la salsa con la cuchara en la parte superior y esparza sobre el estragón."], "url": "www_bbc_co_uk_food_recipes_miso_chicken_with_63991", "title": "Pollo de miso con nueces y uvas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_chicken_with_63991_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz", "50ml / 2fl oz sake", "75g / 3oz de azúcar en polvo", "Pasta blanca de miso 150g / 5oz", "4 x 125 g / 4½ oz de filetes de salmón, sin piel y sin espinas, sin pulpa marrón", "1 pepino, pelado en tiras, cortado a la mitad longitudinalmente, sin semillas y cortado en rodajas de 3 mm / 1 / 8in", "1 chile rojo grande, cortado a la mitad, sin semillas, finamente cortado", "9 trompetas negras setas, empapadas y desgarradas en tiras", "½ cucharadita de sal marina fina", "90ml / 6 cucharadas de vinagre de vino de arroz", "45g / 1¾oz de azúcar en polvo", "1½ cucharada de jengibre encurtido japonés, aproximadamente picado", "60ml / 4 cucharadas de vinagre de vino de arroz", "2½ cucharadas de azúcar en polvo", "¾ cucharada de sal fina", "Arroz de sushi 250 g / 9 oz", "semillas de sésamo blanco y negro, tostadas", "berro, como el berro o cilantro", "Pimienta japonesa de siete especias"], "method": ["Para el salmón, combine el mirin, el sake y el azúcar en una sartén pequeña. Llevar a ebullición a fuego medio, para disolver el azúcar.", "Agregue la pasta de miso y deje hervir y cocine a fuego lento durante tres minutos.", "Pase la mezcla de miso por un colador fino y déjela enfriar.", "Una vez que se haya enfriado, cubra los filetes de salmón con el adobo de miso, (reservando algunos para finalmente cubrir el salmón antes de cocinarlos), y póngalo en una bandeja para marinar durante al menos seis horas.", "Una vez que el salmón se haya marinado, precaliente el horno a su nivel más alto.", "Para cocinar el salmón, limpie cualquier adobo sobrante de los filetes de salmón y caliente una sartén hasta que esté muy caliente.", "Escuche los filetes de salmón brevemente en la sartén bien caliente, luego colóquelos en una bandeja para hornear.", "Frote el lado de la presentación superior del salmón con un poco de adobo de miso y deje secar durante al menos 10 minutos.", "Termine de cocinar el salmón en el horno, durante unos cinco minutos hasta que esté recién cocinado y aún ligeramente rosado por dentro.", "Para la ensalada de pepino, mezcle el pepino, el chile, los champiñones trompette y espolvoree con la sal.", "Permita que las verduras reposen durante 30 minutos, luego enjuague con agua fría y seque con papel de cocina.", "En una sartén pequeña, hierva el vinagre con azúcar en polvo y luego viértalo sobre la mezcla de pepino. Deje reposar por una hora, luego agregue el jengibre en escabeche.", "Drene el licor de decapado de las verduras cuando esté listo para servir.", "Para el arroz de sushi, en una sartén pequeña, ponga a hervir el vinagre de vino de arroz, el azúcar y la sal, revolviendo para disolver el azúcar y la sal. Una vez disuelto, retire la mezcla del fuego y déjela enfriar.", "Lave el arroz de sushi tres o cuatro veces con agua fría y déjelo a un lado en el colador por 30 minutos.", "Coloque el arroz en una cacerola y luego agregue 500 ml / 18 fl oz de agua. Cubra el arroz y deje hervir a fuego lento.", "Hierva el arroz de sushi durante 12-15 minutos hasta que el agua haya sido absorbida, luego retire la sartén del fuego, mantenga la tapa encendida y deje terminar la cocción, sin calentar, durante 10-15 minutos más.", "Incline el arroz en un recipiente hondo y doble en cuatro cucharadas de vinagre de sushi frío.", "Cuando el arroz esté frío, forme bolas o triángulos. Para servir, caliente el arroz de sushi en un horno de vapor o en el microondas.", "Para servir, espolvorear el filete de salmón miso con semillas de sésamo negro y blanco y colocar en platos para servir. Sirva la ensalada de pepino en escabeche junto con el arroz de sushi, espolvoreado con algunas semillas de sésamo. Adorne con hierba de berro y una pizca de siete especias de pimienta."], "url": "www_bbc_co_uk_food_recipes_miso_glazed_organic_94154", "title": "Salmón glaseado de miso con ensalada de pepino en escabeche y arroz de sushi", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150-200g / 5½-7 oz de filete de fletán, piel encerada, con espinas", "4 cucharadas de sake", "4 cucharadas de mirin", "4 cucharadas de pasta de miso blanco", "3 cucharadas de azúcar en polvo", "125ml / 4fl oz de vino de arroz Shaoxing", "125ml / 4fl oz sake", "125ml / 4fl oz mirin", "125ml / 4fl oz de salsa de soja", "3 cucharadas de azúcar en polvo", "2 cucharadas de aceite de maní o vegetal", "1 chalote, finamente picado", "4 dientes de ajo, aplastados", "Pomo de jengibre fresco de 2cm / ¾in en rodajas finas", "2 cucharaditas de sal", "750g / 1lb 10oz de verduras chinas, como el repollo negro (cavolo nero) o el bok choi", "2 cucharadas de caldo de pollo o agua", "2 cucharadas de amaranto rojo", "2 cucharadas de berro de coriandro"], "method": ["Para el mero halibut, mezcle el sake, el mirin, la pasta blanca de miso y el azúcar impalpable en un plato poco profundo. Retire un par de cucharadas de adobo y póngalo en una botella apretada para el aderezo y déjelo a un lado. Agregue el pescado al plato poco profundo, cúbralo y déjelo marinar en la nevera durante 24 horas.", "Cuando esté listo para cocinar el pescado, precaliente la parrilla a fuego alto. Limpie cualquier exceso de adobo del pescado y coloque el pescado en una bandeja para hornear.", "Ase el pescado durante tres minutos en cada lado, o hasta que esté cocido a su gusto.", "Para las verduras verdes teriyaki y el aderezo de miso, primero prepare la salsa teriyaki. Calentar una sartén hasta que esté caliente, agregar el vino de arroz, el sake, el mirin, la salsa de soja y el azúcar impalpable y llevar la mezcla a fuego lento.", "Cocine a fuego lento durante 1-2 minutos, o hasta que la mezcla se haya espesado.", "Caliente un wok grande y agregue el aceite. Una vez que el aceite esté caliente, agregue la chalota, ajo, jengibre, sal y las verduras y cocine durante 2-3 minutos. Vierta la salsa teriyaki y el caldo (o agua) y revuelva.", "Para servir, use el adobo en la botella squeezy para vestir cada uno de los cuatro platos. Coloque los greens en cada plato cubierto con el pez miso. Adorne con el amaranto rojo y el berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_miso_halibut_with_87099", "title": "Miso halibut con teriyaki vegetales verdes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg de huesos de ternera, cadáveres de pollo, huesos de cordero (por lo general, libres de los carniceros) o utilizar los huesos guardados de un asado", "salpicaduras de vinagre de sidra de manzana o jugo de limón fresco (opcional: esto puede ayudar a extraer los minerales de los huesos de la carne)", "1 puñado de cebollas, puerros, zanahorias o apio termina", "1 cucharada de pimienta negra", "2 hojas de laurel", "Fideos de alforfón 350g / 12oz", "1 cucharada de aceite de sésamo o aceite de oliva virgen extra", "4 cabezas pak choi, cortadas y en rodajas finas", "200 g / 7 oz de champiñones mixtos, en rodajas", "1 zanahoria, en juliana", "½ col roja, tallo eliminado, hojas trituradas", "Jengibre fresco de la raíz de los 5cm / 2in, pelado, rallado", "6 cebollas de primavera, cortadas, finamente cortadas en diagonal", "4 cucharadas de jugo de lima", "2 cucharadas de pasta de miso, preferiblemente sin pasteurizar", "1-2 cucharaditas de tamari o sal, al gusto", "gran puñado de cilantro fresco picado, para servir"], "method": ["Coloque todos los ingredientes para el caldo de hueso en una olla grande con tapa y cúbralo con agua fría. El nivel del agua debe cubrir los huesos en 5cm / 2in mientras aún deja espacio en la parte superior de la sartén. Cubra y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante al menos 6 horas para el pollo y 12 para la carne de vaca o cordero, quitando cualquier espuma que se eleva a la parte superior. Colar el líquido y volver a la olla, dejar de lado.", "Cocine los fideos de trigo sarraceno de acuerdo con las instrucciones del paquete, usando mucha agua. Durante el primer minuto de cocción, usa dos tenedores para remover y separar los fideos.", "Escurra los fideos cocidos y enjuague con agua fría durante 15-20 segundos para evitar que sigan cocinando. Poner a un lado para drenar, luego rociar un poco de aceite de sésamo y mezclar para evitar que los fideos se peguen entre sí.", "Divida el pak choy, los champiñones, la zanahoria y la col roja por igual entre los cuatro cuencos para servir.", "Calienta suavemente el caldo de hueso y agrega el jengibre rallado, cebollas tiernas, jugo de lima, pasta de miso y tamari.", "Vierta el caldo caliente sobre las verduras, espolvoree el cilantro en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_miso_ramen_soup_with_15548", "title": "Sopa de ramen de miso con fideos de trigo sarraceno", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miso_ramen_soup_with_15548_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de dashi en polvo", "500ml / 18fl oz de agua tibia", "2cm / 1 en jengibre fresco, pelado y en rodajas", "2 dientes de ajo, en rodajas", "pizca de copos de chile", "3 cucharadas de pasta de miso blanco", "1 cucharada de mirin", "1 cucharada de salsa de soja", "110 g / 4 oz de champiñones shiitake, en rodajas", "Maíz dulce de 110 g / 4 oz", "8 ostras, solo carne de ostra, retirada del caparazón", "Gambas crudas de 200g / 7oz, sin cabeza, peladas pero con la cola puesta", "Fideos de huevo 150 g / 5½ oz", "4 cebolletas, en rodajas", "2 limas, solo jugo", "1 filete de anguila ahumada, hecho en escamas o virutas, para servir"], "method": ["Coloque el polvo de dashi, agua, jengibre, ajo y escamas de chile en una sartén grande y coloque sobre el fuego. Batir en la pasta blanca de miso, mirin y salsa de soja. Cocine por 20-30 minutos.", "Agregue los champiñones, el maíz dulce, las ostras y las gambas y cocínelos durante 4-5 minutos.", "Cocine los fideos en una cacerola de agua hirviendo durante 2-3 minutos. Escurrir, apartar y mantener caliente.", "Justo antes de servir agregue las cebolletas y el jugo de lima a la sopa.", "Coloque los fideos cocidos en un recipiente para servir y vierta el caldo sobre la tapa. Adorne con hojuelas / virutas de anguila ahumada."], "url": "www_bbc_co_uk_food_recipes_miso_soup_with_oysters_18228", "title": "Sopa de miso con ostras, gambas y maíz dulce de bebé", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de pasta blanca de miso (disponible en los supermercados japoneses)", "3 cucharadas de azúcar", "3 cucharadas de salsa de soja oscura", "3 cucharadas de sake (disponible en los supermercados japoneses)", "3 cucharadas de mirin (vino de arroz japonés, disponible en los supermercados japoneses)", "Filetes de fletán 4 x 150g / 5oz de espesor, pieles retiradas", "110g / 4oz de langostinos crudos, cabezas y cáscaras retirados, sin nervaduras, toscamente picados", "1 cucharadita de salsa de soja oscura", "1 cucharadita muere", "¼ de cucharadita de jengibre rallado recién rallado", "2 cucharaditas de cebolla de primavera finamente picada", "12 envoltorios de wonton (disponibles en los supermercados japoneses)", "1 yema de huevo de gallinas camperas, mezclada con 1 cucharada de agua", "650ml / 1 pinta 3½fl oz de caldo de pollo caliente, preferiblemente hecho en casa", "1 cucharada de sake", "1 cucharada de salsa de soja oscura", "1 cucharadita de jengibre raíz recién rallado", "1 cucharadita de azúcar", "¼ cucharadita de sal", "6 hongos shiitake, bien lavados, sin tallos, finamente cortados", "6 cm / 2½ en pieza de puerro (solo parte blanca), en juliana", "2 cabezas pequeñas bok choi, cada una cortada en cuartos", "8 hojas verdes de shiso (disponibles en los supermercados japoneses)", "1 cucharadita de shichimi (siete especias, disponible en tiendas especializadas)"], "method": ["Para el mero halibut, mezcle la pasta de miso, el azúcar, la salsa de soja, el sake y el mirin en un tazón grande de vidrio hasta que estén bien combinados.", "Agregue los filetes de halibut y mezcle hasta que esté completamente cubierto en el adobo. Cubra el recipiente y enfríe en la nevera y marinado durante al menos cuatro horas, o preferiblemente durante la noche.", "Mientras tanto, para las albóndigas de gambas, mezcle las gambas picadas, salsa de soja, mirin y jengibre en un procesador de alimentos durante 12-15 segundos, o hasta que se combinen aproximadamente. Transfiera la mezcla a un recipiente y agregue la cebolla tierna.", "Coloque tres envoltorios de wonton en una tabla de cortar y coloque una cucharadita de la mezcla de gambas en el centro de cada uno.", "Cepille los bordes de las envolturas de wonton con un poco de la mezcla de huevo batido, luego doble cada envoltura por la mitad sobre la mezcla, para formar una forma de triángulo y selle los bordes.", "Repita el proceso con las envolturas wonton restantes y la mezcla de relleno.", "Envuelva un envoltorio de wonton lleno alrededor de su dedo para que las dos esquinas en la base del triángulo se encuentren. Presione estas dos esquinas juntas (la bola de masa debería parecerse a un tortellini).", "Repita el proceso con los wonton restantes llenos.", "Enfríe las albóndigas de gambas en la nevera hasta que las necesite.", "Cuando los filetes de halibut se hayan marinado, precaliente la parrilla a su nivel más alto.", "Retire los filetes de halibut del adobo, sacuda el exceso y luego transfiéralos a una bandeja para hornear ligeramente engrasada. Ase a la parrilla durante 5-6 minutos, volteándolo una vez durante la cocción, hasta que esté completamente cocido. (NB: El halibut se cuece cuando la carne es opaca).", "Justo antes de servir, ponga a hervir una sartén con agua con sal. Agregue las albóndigas de gambas al agua hirviendo, en tandas, y hierva por 2-3 minutos. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repita el proceso con las albóndigas restantes.", "Mientras tanto, para el caldo de shiso, lleve a fuego lento el caldo, el sake, la salsa de soja, el jengibre, el azúcar y la sal en una cacerola.", "Agregue las verduras y cocine a fuego lento durante 2-3 minutos, o hasta que estén tiernas, luego agregue las albóndigas al caldo y caliente hasta que se caliente.", "Para servir, coloque tres albóndigas de gambas en cada uno de los cuatro tazones para servir calentados. Vierta sobre el caldo y las verduras. Agregue dos hojas de shiso a cada plato, luego cubra cada porción con un filete de fletán a la parrilla. Espolvorea cada plato con una pizca de pimienta shichimi."], "url": "www_bbc_co_uk_food_recipes_misoglazedhalibutwit_92903", "title": "Fletán miso-glaseado con albóndigas de gambas en caldo de shiso", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 3fl oz sake", "75ml / 3fl oz mirin (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "Pasta de miso blanca de 225 g / 8 oz (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "Azúcar granulada 110 g / 4 oz", "4 filetes de bacalao de 200 g / 7oz", "aceite vegetal, para freír", "6 hojas exteriores de col de col rizada, finamente cortadas", "½ cucharadita de azúcar moreno", "½ cucharadita de sal marina", "¼ repollo puntiagudo, finamente cortado", "2 cucharadas de hojas de cilantro fresco picado", "½ cucharadita de azúcar", "½ cucharadita de sal marina", "1 cucharadita de granos de pimienta rosa", "2 cucharadas de mirin", "2 cucharadas de aceite de sésamo", "½ lima, solo jugo"], "method": ["Para el bacalao, coloca el sake y el mirin en una cacerola y llévalo a ebullición. Hierva por 30 segundos para quemar el alcohol, luego reduzca el fuego.", "Agregue el miso blanco y revuelva para disolverlo. Vuelva a encender el fuego y agregue el azúcar, revolviendo una vez más para disolverlo. Retirar del fuego, transferir a un tazón grande y dejar enfriar.", "Coloque los filetes de bacalao en la mezcla fría de miso, cubra y coloque en el refrigerador durante al menos 24 horas, preferiblemente 48 horas.", "Cuando esté listo para cocinar el bacalao, precaliente la parrilla a altura y el horno a 200C / 400F / Gas 6.", "Retire el bacalao de la mezcla de miso y limpie cualquier exceso, luego coloque en una bandeja para hornear. Coloque debajo de la parrilla durante 2-3 minutos hasta que estén dorados, luego retírelos y colóquelos en el horno durante diez minutos hasta que estén cocidos.", "Para la col frita, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la col savoy rallada en el aceite caliente y fría durante 30-45 segundos, o hasta que estén crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina. Espolvorea sobre el azúcar y la sal.", "Mientras tanto, para la col vestida de pimienta rosada, coloque la col picada y el cilantro en un bol.", "Coloque todos los ingredientes restantes en una mano de mortero y machaque juntos para hacer un aderezo ligero. Vierta sobre el repollo y revuelva para combinar.", "Para servir, divida la col frita por igual entre cuatro platos para servir. Cubra cada montón de col con un trozo de bacalao y coloque una pequeña pila de repollo en la parte superior de cada filete de bacalao."], "url": "www_bbc_co_uk_food_recipes_misocodwithdeepfried_86296", "title": "Bacalao miso con repollo frito y repollo a la pimienta rosa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de pasta de miso", "100ml / 3½fl oz de agua hirviendo", "½ chile rojo, en rodajas", "½ diente de ajo, en rodajas", "1 hoja de laurel", "½ cucharadita de jengibre molido", "Fideos de trigo integral de 75 g / 2½ oz", "1 pak choi, hojas separadas", "cilantro fresco, para adornar"], "method": ["Coloque la pasta de miso, el agua, el chile, el ajo, la hoja de laurel y el jengibre en una cacerola, lleve a ebullición y revuelva para combinar.", "Agregue los fideos a la sartén y cocine a fuego lento durante 2 o 3 minutos, o hasta que estén blandos.", "Agregue las hojas de pak choi a la sartén y cocine durante 1-2 minutos.", "Para servir, vierta la sopa en un recipiente para servir y decore con cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_misonoodlesoup_84732", "title": "Sopa de fideos de Miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]