[{"ingredients": ["4 x 175 g / 5 oz de filetes de salmón, piel en", "aceite de oliva, para cepillar", "sal y pimienta negra recién molida", "Lanzas de espárragos 250 g / 9 oz, extremos leñosos recortados", "75ml / 2½fl oz de aceite de oliva virgen extra", "50ml / 2fl oz de vinagre de jerez", "Pan blanco de buena calidad de 75 g / 2½ oz, día anterior", "2 dientes de ajo, pelados, picados", "½ pepino, pelado, sin semillas, picado", "1 chile verde, picado", "1 cucharada de estragón fresco picado", "sal y pimienta negra recién molida, al gusto", "125 g / 4½ oz de almendras ahumadas, picadas, para servir"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Caliente una sartén hasta que fume. Cepillar el salmón con el aceite de oliva, sazonar con sal y pimienta negra recién molida y la plancha durante 2-3 minutos en ambos lados, o hasta que se dore por todas partes. Coloque en el horno para terminar de cocinar durante 3-4 minutos más, o hasta que esté recién cocido.", "Para el gazpacho, corte las puntas de las espárragos y póngalas en una olla con agua hirviendo durante un minuto, luego escurra y revuelva en agua helada. Dejar de lado.", "Hervir los tallos de espárragos en una olla de agua hirviendo durante 8-10 minutos, o hasta que estén muy suaves. Dejar enfriar en el líquido.", "Mezcle el aceite de oliva virgen extra, el vinagre de Jerez, el pan y el ajo en un tazón grande y déjelos a un lado durante diez minutos.", "Transfiera la mezcla de pan a un procesador de alimentos junto con los tallos de espárragos, el pepino, el chile y el estragón y licúe hasta que quede suave. Agregue suficiente líquido de cocción de espárragos para diluir el gazpacho a la consistencia deseada y mezcle nuevamente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, cuele el gazpacho en cuatro tazones para servir y coloque suavemente un filete de salmón encima de cada uno. Esparce sobre las almendras ahumadas picadas y las puntas de espárragos y sirve."], "url": "www_bbc_co_uk_food_recipes_griddledsalmonwithgr_91844", "title": "Salmón cuajado con espárragos verdes 'gazpacho' y almendras ahumadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ mango, piedra removida y carne anotada", "2 cucharaditas de aceite de oliva", "¼ cucharadita de copos de chile", "1 cucharada de miel clara", "½ lima, solo jugo", "2 cuñas de lima, para adornar", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar la parrilla a la configuración más alta.", "Coloque el mango en una bandeja pequeña para hornear antiadherente.", "Rocíe el mango con el aceite de oliva y espolvoree sobre los copos de chile, la miel y el jugo de lima.", "Coloque el mango debajo de la parrilla caliente durante 3-4 minutos o hasta que se dore.", "Para servir, adornar con rodajas de limón y polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_griddledspicedmangow_87034", "title": "Mango especiado con miel, lima y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de grupa 200 g / 7 oz, recortado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "3 hojas de col rizada, escaldadas, escurridas y finamente picadas", "½ batata, pelada y cortada en rodajas en rodajas de 1cm / ½, blanqueada y escurrida", "1 naranja, pelado y rebanado", "1 cucharada de aceite de oliva", "2 cucharaditas de miel clara", "1 naranja, ralladura y jugo", "1 chile, finamente picado", "pequeño puñado de perejil fresco, picado", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, caliente una sartén hasta que esté caliente. Frote la carne con aceite de oliva y sazone con sal y pimienta negra recién molida. Cocine en la plancha durante 4-5 minutos en cada lado, o hasta que esté cocido a su gusto. Déjalo descansar.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón, sazone con sal y pimienta negra recién molida y mezcle bien.", "Para servir, coloque la col rizada en un plato de servir y cubra con el bistec. Coloque la batata y las rodajas de naranja alrededor del plato y rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_griddledsteakandswee_85384", "title": "Ensalada de bistec y batata con salsa de col rizada y salsa de naranja y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de grupa 100 g / 3½ oz", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "½ patata picada", "½ limón, solo jugo", "2 cucharadas de cilantro fresco picado", "1 zanahoria, pelada y picada", "1 cucharadita de semillas de cilantro", "pizca de copos de chile", "25g / 1oz de mantequilla", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el bistec, frote el aceite de oliva en la carne y sazone bien con sal y pimienta negra recién molida. Caliente una charola a la parrilla hasta que fume y fríe la carne durante 2-4 minutos por cada lado (por poco común) o hasta que esté cocida a su gusto. Retire de la sartén y coloque en un plato caliente para descansar.", "Para las papas, caliente el aceite de oliva en una sartén a prueba de horno y fría las papas durante 3-4 minutos, o hasta que estén ligeramente doradas. Transfiera al horno para asar durante 10-12 minutos, o hasta que estén dorados y tiernos, luego agregue el jugo de limón y el cilantro.", "Para el puré de zanahoria y cilantro, hierva las zanahorias con las semillas de cilantro en una sartén hasta que estén tiernas, luego escurra y pulse en un procesador de alimentos junto con los ingredientes restantes del puré hasta que estén suaves.", "Para servir, vierta el puré en un plato y cubra con la papa asada. Cuidadosamente corta el bistec y arregla en la parte superior."], "url": "www_bbc_co_uk_food_recipes_griddledsteakwithlem_90317", "title": "Bistec a la parrilla con limón y patatas asadas al cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal ablandada", "25g / 1oz de cilantro fresco, finamente picado", "1 chile rojo, finamente picado", "2 cucharadas de aceite de oliva", "½ batata, cortada en ½ pulgada / ¼ en rodajas, dejada la piel", "sal y pimienta negra recién molida"], "method": ["Para hacer el cilantro y la manteca de chile, coloque la mantequilla, el cilantro y el chile en un bol, sazone bien con sal y pimienta negra recién molida y aplaste con un tenedor para mezclar.", "Para la batata, coloque la batata en un recipiente con el aceite y sazone bien con sal y pimienta negra recién molida. Mezcle para mezclar completamente.", "Caliente una sartén hasta que fume. Agregue la batata y el chargrill durante dos minutos en cada lado, o hasta que estén cocidos.", "Para servir, apilar las rodajas de papa en una pila en el centro de un plato caliente y una cuchara sobre una gran perilla del cilantro y la mantequilla de chile."], "url": "www_bbc_co_uk_food_recipes_griddledsweetpotatow_81323", "title": "Boniato cuajado con cilantro y mantequilla de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 200g / 7oz", "aceite de oliva", "sal y pimienta negra recién molida", "½ patata, cortada en cuñas", "pizca de copos de chile seco", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "25g / 1oz de mantequilla", "½ cebolla, finamente rebanada", "½ repollo Savoy, finamente cortado", "sal y pimienta negra recién molida", "1 diente de ajo, picado", "75ml / 2½ fl oz crema doble", "1 ramita de tomillo fresco, solo hojas", "55g / 2oz Stilton", "100ml / 3½ fl oz crema doble", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el bistec a la parrilla, frote la carne con aceite de oliva, sal y pimienta negra recién molida y caliente una sartén hasta que se caliente. Coloque el bistec en la sartén y la plancha durante 2-3 minutos en cada lado, o hasta que esté cocido a su gusto. Reserve para descansar durante cinco minutos y luego corte.", "Para las rodajas de papa picante, coloque las rodajas de patata, hojuelas de chile, sal, pimienta negra recién molida, aceite de oliva y mantequilla en una sartén a prueba de horno y coloque a fuego medio, sacudiendo la sartén de vez en cuando, hasta que comience a dorar marrón. Coloque en el horno y tueste durante 15 minutos, o hasta que estén dorados por completo y cocinados hasta el final.", "Para la col de crema de ajo, derrita la mantequilla en una sartén, agregue la cebolla y fría hasta que se ablande. Agregue el repollo, la sal y la pimienta negra recién molida y fría por 2-3 minutos. Agregue el ajo y fría por un minuto. Agregue la crema y el tomillo y cocine a fuego lento durante 3-4 minutos.", "Para la salsa de queso azul, coloque el Stilton, la crema y la pimienta negra recién molida en una cacerola pequeña y caliente suavemente, revolviendo, hasta que se derrita y suavice.", "Para servir, amontone la col en un plato de servir. Coloque las rebanadas de carne en la parte superior y las rodajas de papa en el lateral. Vierta sobre la salsa de queso azul."], "url": "www_bbc_co_uk_food_recipes_griddledsteakwithspi_88309", "title": "Solomillo con rodajas de patata picante, col de ajo y salsa de queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pimiento amarillo, sin semillas, cortado en cuartos", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "1 gran puñado de hojas de cohetes", "2 cucharadas de aceite de oliva", "2 cucharadas de semillas de sésamo, tostadas", "exprimir jugo de limón", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco, sin costras", "3 cucharadas de agua fría", "1 diente de ajo, picado", "2-3 cucharadas de aceite de oliva", "½ limón, solo jugo", "2 cucharaditas de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Para la pimienta a la parrilla, rocíe los cuartos de pimienta con aceite de oliva y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que fume, agregue los pimientos y la plancha durante 3-4 minutos, o hasta que estén dorados y ligeramente carbonizados.", "Para la ensalada de rúcula, mezcle todos los ingredientes de la ensalada en un tazón grande.", "Para la skordalia, coloque el pan en un recipiente con el agua y déjelo en remojo durante unos minutos. Exprima el exceso de agua, luego coloque el pan ablandado en un procesador de alimentos con el resto de los ingredientes de skordalia y mezcle hasta lograr una pasta homogénea.", "Para servir, cuchara la skordalia en dos platos para servir, cubra con la pimienta a la parrilla y sirva la ensalada de rúcula a los lados."], "url": "www_bbc_co_uk_food_recipes_griddledyellowpepper_89158", "title": "Pimiento amarillo cuajado con rúcula y ensalada de sésamo y skordalia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de cuscús", "160ml / 5½fl oz de agua tibia", "¾ cucharadita de sal", "Florecillas de coliflor de 225g / 8oz", "gran puñado de hojas de menta fresca", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cebolla roja pequeña, cortada en rodajas finas y enjuagada en agua fría", "1 palito de apio, picado", "1 clementina o satsuma, solo jugo", "2 maracuyá, semillas y jugo", "puñado de perejil fresco de flatleaf, tallos a la izquierda, picados", "nueces de gran tamaño, sin cáscara, ligeramente tostadas, picadas", "2 cucharadas de aceite de oliva virgen extra", "1 cucharadita de salsa de soja", "sal y pimienta negra recién molida", "2 puñados de berro o rúcula silvestre, para servir", "4 x 150 g / 5½ oz sin piel, filetes de rodaballo sin espinas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Para el cuscús, coloca el cuscús en un recipiente con agua tibia y sal y déjalo absorber el agua.", "Ponga a hervir una cacerola de agua ligeramente salada y cocine la coliflor durante 3-4 minutos o hasta que comience a ablandarse. Alternativamente, puedes cocinarlo al vapor. Escurrir la coliflor en un colador e inmediatamente transferirla a un tazón grande de agua helada durante 2-3 minutos.", "Escurrir de nuevo, luego coloque en un procesador de alimentos con las hojas de menta y aceite de oliva y pulse hasta que la mezcla tenga la consistencia de migas gruesas.", "Mezcle la mezcla de coliflor en el cuscús y sazone al gusto con sal y pimienta negra recién molida. El cuscús se mantendrá cubierto en la nevera por un día.", "Para la salsa, coloque la cebolla y el apio en un tazón con el jugo de cítricos y las semillas de fruta de la pasión y el jugo, y déjelos a un lado.", "Para el rodaballo a la plancha, sazonar ligeramente los pescados en ambos lados con sal y pimienta negra recién molida y rociar con el aceite de oliva.", "Caliente una sartén a fuego alto y cocine el pescado durante 2-3 minutos en cada lado, dependiendo del grosor del filete, hasta que esté bien cocido. Alternativamente, cocine debajo de la parrilla.", "Mientras tanto, agrega el perejil y las nueces a la salsa, junto con el aceite de oliva virgen extra y la salsa de soja. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar bien.", "Para servir, coloque algo del cuscús en el centro de cada plato y coloque algunos de los berros o cohetes en la parte superior. Coloque un filete de pescado encima, junto con cualquier zumo de sartén, y póngalo sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_griddledturbotonmint_85162", "title": "Rodaballo en rodajas sobre cuscús de coliflor con nueces, maracuyá y salsa de apio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ mango, piedra eliminada", "20 ml / 1½ cucharada de miel clara", "¼ cucharadita de hojuelas de chile seco", "15 g / ¼ onza de mantequilla"], "method": ["Precalentar la parrilla a su configuración más alta.", "Corte la carne del mango de forma cruzada con un cuchillo afilado, luego empuje la piel hacia dentro para exponer la carne máxima de mango.", "Rocíe con la miel y espolvoree los copos de chile.", "Derrita la mantequilla en una sartén a prueba de horno y agregue el mango a la sartén con la carne hacia abajo. Cocine por dos minutos, luego voltee. Transfiera a la parrilla y cocine por 3-4 minutos o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_griddlemangowithhone_84504", "title": "Mango cuajado con miel y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 apio nabo, cortado en cubitos", "Leche entera de 400-500ml / 14-18fl oz (suficiente para cubrir el apionabo)", "sal y pimienta negra recién molida", "aceite vegetal, para freír en grasa", "4 huevos de gallinas camperas", "Harina normal de 110 g / 4oz, para dragado", "1 huevo grande de gallinas camperas, golpeado", "Pan rallado Panko japonés de 110g / 4oz, para dragado", "400g / 14oz de champiñón porcini limpiado y recortado (o king osys) cortado a lo largo en pedazos de 1cm / ½ en trozos", "dash aceite de oliva virgen extra", "1 diente de ajo, muy finamente picado", "30 g / 1 oz de virutas de madera de roble, para fumar, empapado durante una hora en un poco de agua", "100ml / 3½fl oz de aceite de colza", "5 cucharadas de moscatel de vinagre de vino", "sal marina y pimienta", "¼ manojo de tomillo fresco, hojas retiradas", "1 limón, solo jugo", "½ cucharadita de mostaza Dijon"], "method": ["Coloque el apio en una olla mediana. Verter sobre la leche y sazonar con sal y pimienta. Llevar a ebullición, luego cocine a fuego lento y cocine hasta que estén tiernos. Escurra el apionabo de la leche, reserve la leche y coloque la carne en una licuadora con la mitad de la leche. Mezcle hasta obtener un puré espeso. Dejar de lado.", "Caliente el aceite vegetal en una freidora de grasa o en una bandeja mediana de lados altos a 170 ° C / 340 ° F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Prepare un recipiente con agua helada.", "Caliente una olla pequeña de agua hasta que hierva y luego cocine a fuego lento. Separe la yema de huevo de las claras y luego vierta cada yema en el agua y cocine durante dos minutos hasta que se haya establecido (un temporizador es útil para esto); Ahora transfiera rápidamente las yemas al agua fría para que se enfríe.", "Coloque la harina, el huevo batido y las migas de pan en tres cuencos separados, listos para cubrir las yemas. Escurra las yemas con cuidado y transfiéralas al recipiente para harina. Cubra suavemente con la harina, seguido por el huevo batido y, finalmente, el pan rallado. Dejar de lado.", "Caliente una sartén a fuego medio. Frote el porcini con el aceite, sazone bien con sal y pimienta y agregue a la sartén con el ajo. Una vez que las rebanadas de porcini estén cocidas y bien caramelizadas, retírelas de la parrilla y reserve.", "Para fumar el porcini, asegúrese de trabajar en un espacio ventilado. Coloque una sartén mediana a fuego alto y agregue las pastillas para fumar drenados. Encima de esto, agregue una lámina arrugada o anillos de metal para hornear para formar un trébedes y luego un pequeño colador o colador.", "Cuando las papas comiencen a humear, agregue los porcini al colador y coloque una tapa ajustada sobre la sartén.", "Retire la sartén del fuego y deje que los porcini fumen durante 3-4 minutos, o hasta que capten el sabor del humo. No deje los champiñones demasiado tiempo en la sartén, ya que pueden volverse acre. Eliminar y reservar.", "Freír los huevos en el aceite caliente hasta que estén dorados y crujientes. Retire con cuidado con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la vinagreta de tomillo, mezcle el aceite de colza y el vinagre en un tazón pequeño, sazone bien y luego agregue las hojas de tomillo, el jugo de limón y la mostaza de Dijon.", "Para servir, espolvorea un poco del puré de apio apionabo tibio sobre los platos para servir y luego completa con los champiñones y la yema crujiente. Finalmente cuchara sobre la vinagreta de tomillo."], "url": "www_bbc_co_uk_food_recipes_grilled_and_hot_smoked_26927", "title": "Porcini ahumado a la parrilla y caliente, yema de huevo crujiente, apio nabo y tomillo fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "½ cucharadita de pimentón ahumado", "2 cucharaditas de jugo de limón", "2 huevos de gallinas camperas", "20 lanzas de espárragos verdes, con extremos leñosos eliminados", "90-120ml / 3-4fl oz de aceite de oliva refinado", "3 cucharadas de aceite de oliva", "Calabacines para bebés de 80g / 3oz (aproximadamente 2½), pulsados ​​en un procesador de alimentos por 30 segundos", "Coliflor de 80 g / 3 oz, pulsada en un procesador de alimentos durante 30 segundos", "30g / 1 oz de chalote de plátano, finamente picado", "½ chile rojo, finamente picado", "3 pizcas grandes de pimentón ahumado", "pizca de sal", "2 cucharadas de jugo de limón", "10g de perejil fresco, picado", "5 g de cebollín fresco, picado"], "method": ["Para el aderezo de pimentón, mezcle todos los ingredientes en un tazón pequeño y déjelos a un lado.", "Para los huevos duros y espárragos a la parrilla, con una cuchara, deslice los huevos suavemente en una olla pequeña de agua. Llevar a fuego lento durante 13 minutos, luego retire los huevos y colóquelos inmediatamente bajo agua fría. Mientras aún esté tibio, pele los huevos y transfiéralos a la nevera. Una vez frío, separa los blancos de las yemas y ralla toscamente cada parte (mantenlos separados), luego aparta.", "Coloque cinco lanzas de espárragos uno al lado del otro y asegúrelos con dos brochetas de metal (pase un pincho por cada extremo del espárrago, evite las puntas, de modo que las lanzas se mantengan rectas). Repita con los espárragos restantes. Blanquee en una olla grande de agua hirviendo durante 3 minutos, luego inmediatamente sumérjalos en agua fría para detener la cocción y séquelos bien (déjelos en los pinchos).", "Para cocinar los espárragos, caliente una sartén a fuego alto. Cepille ligeramente las lanzas ensartadas con aceite de oliva. Cuando la sartén esté caliente, coloque los espárragos en su lugar, planos, y déjela durante 3 minutos para obtener marcas profundas en la plancha. Voltee con las tenacillas y la plancha por otros 3 minutos. (Si es necesario, haga la grilla en lotes, simplemente mantenga los espárragos calientes en un horno precalentado a 80C / 60C Fan / Gas ¼ mientras cocina los espárragos restantes).", "Para el crumble de verduras, en una sartén grande o saltear a fuego alto, agregue el aceite de oliva y freír los calabacines, coliflor, chalota, chile, pimentón y una pizca de sal durante 30 segundos. Agregue 80ml / 3fl oz de agua, el jugo de limón, el perejil, el cebollín y la clara de huevo rallada. Hervir durante 5 segundos y luego eliminar del fuego. Agregue la yema de huevo y revise el condimento.", "Para servir, ponga una cucharada de la migaja de verduras en el centro de cada plato y coloque una pila de espárragos a la parrilla encima. Termine con un poco de aderezo de pimentón."], "url": "www_bbc_co_uk_food_recipes_grilled_asparagus_with_67972", "title": "Espárragos a la plancha con vegetales crumble", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 berenjenas berenjenas, cortadas por la mitad a lo largo", "1 cucharadita de polvo chino de cinco especias", "1 pizca de escamas de sal marina", "2 cucharadas de aceite de cacahuete", "2 dientes de ajo, finamente picados", "Jengibre fresco de la raíz de los 2cm / 1in, pelado y rallado", "1 chile rojo, sin semillas, finamente picado", "2 cebollas de primavera, cortadas longitudinalmente y en rodajas finas", "3 cucharadas de aceite de cacahuete", "1 cucharada de aceite de sésamo tostado", "1 cucharada de salsa de soja ligera baja en sodio", "1 cucharada de vinagre de arroz", "1 cucharada de mirin (dulce vino de arroz japonés)", "1 manojo de hongos enoki, lavados, sin tallos y pequeños racimos separados", "1 cilantro pequeño y puñado, finamente picado"], "method": ["Coloque las berenjenas en un tazón grande. Espolvorea sobre el polvo chino de cinco especias y sal y rocía sobre el aceite de cacahuete. Mezcle las berenjenas y asegúrese de que estén cubiertas con aceite.", "Caliente una sartén a fuego medio-alto, coloque las mitades de berenjena sobre la plancha asegurándose de que las líneas de la parrilla atraviesen el ancho de las berenjenas (para que pueda obtener líneas de mini parrilla a través de la parte blanca de la berenjena). Ajuste la temperatura a medio y déjelos cocinar sin moverlos durante 2 minutos. Luego voltéalos y cocínelos del otro lado. Gírelos de vez en cuando y cocine por 5-6 minutos hasta que estén tiernos.", "Mientras tanto, para la salsa verde china, coloca todos los ingredientes en una jarra. Mezcle bien para combinar.", "Cuando las berenjenas estén cocidas, apague el fuego y sáquelas de la parrilla, colóquelas en un plato para servir siguiendo un patrón circular. Ponga una cucharada de salsa verde sobre cada mitad de berenjena. Decanta el resto de la salsa verde en un tazón pequeño para que los invitados puedan ayudarse a sí mismos. Luego adornar con pequeños racimos de hongos enoki colocados entre las piezas de berenjena. Espolvorea sobre un cilantro finamente picado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilled_baby_aubergines_60044", "title": "Berenjenas asadas a la parrilla con salsa china verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 berenjenas púrpuras largas y de piel fina (alternativamente, use la variedad ordinaria regordeta y en forma de pera disponible en la mayoría de los supermercados)", "1-2 dientes de ajo, finamente picados", "puñado de hojas de perejil, finamente picado", "5-6 cucharadas de aceite de oliva virgen extra", "un poco de sal marina y pimienta negra", "150 g / 5oz de queso feta", "limones, para servir"], "method": ["Precalentar la parrilla a alto.", "Pase un cuchillo pequeño y afilado alrededor de la berenjena, a 1 cm / ½ pulgada o más por debajo del tallo y solo corte la piel; luego haga cuatro cortes igualmente espaciados de manera uniforme a lo largo de la berenjena hasta el final.", "Ase las berenjenas durante unos 20 minutos, volteándolas cada 5-7 minutos más o menos, hasta que estén cocidas uniformemente con la piel carbonizada, y hasta que la berenjena se sienta suave, pero no se haya colapsado. En el caso de las berenjenas moradas, la piel también se habrá tornado de un color marrón apagado. Transfiera a un plato grande, ovalado, blanco y permita que se enfríe durante dos minutos.", "Pele la piel de berenjena en cuatro hojas largas y estrechas con un cuchillo pequeño. Sin cortar directamente a través del extremo del tallo, corte las berenjenas por la mitad a lo largo y separe suavemente hasta que quede dos mitades horizontales adheridas en el extremo superior", "Mezcle el ajo y el perejil con el aceite de oliva hasta que estén bien combinados y ponga la mezcla sobre la berenjena. Sazonar ligeramente con sal (no mucho - el queso es salado de todos modos) y pimienta, y desmenuzar el queso feta en la parte superior. Si le gusta, gotee más aceite de oliva para terminar.", "Sirva caliente o a temperatura ambiente con limón exprimido."], "url": "www_bbc_co_uk_food_recipes_grilled_aubergines_with_73271", "title": "Berenjenas a la parrilla con aceite de oliva, ajo, perejil y queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_aubergines_with_73271_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de sal marina gruesa", "50g / 1¾oz demerara (marrón) azúcar", "1 cucharada de miel", "2 hojas de laurel", "8 granos de pimienta negra", "4 dientes", "4 piezas de 100 g / 3½ oz de bavette de res, onglet o rabadilla finamente cortada", "1 litro / 1¾ pinta de salmuera (ver arriba)", "100ml / 3½fl oz de aceite de oliva virgen extra", "2 dientes de ajo, picados", "1 chile rojo pequeño, sin semillas y finamente picado", "1 limón, ralladura finamente rallada solamente", "1 cucharadita de hojas de tomillo", "8 cebollas grandes para ensaladas o grandes cebollas con bulbo, cortadas a la mitad manteniendo los tallos intactos", "aceite de oliva, para cocinar", "sal marina y pimienta negra", "1 chalote grande de plátano o 2 medianos, finamente picados", "1 chile rojo, sin semillas y finamente picado", "2 dientes de ajo, finamente picados", "2 cucharadas de perejil de flatillo finamente picado", "2 cucharadas de aceite de oliva", "½ limón, solo jugo"], "method": ["Para la salmuera, ponga todos los ingredientes en una olla mediana no reactiva con 1 litro / 1¾ de agua. Lentamente llevar a ebullición, revolviendo a medida que avanza para disolver la sal y el azúcar. Retirar del fuego y dejar enfriar.", "Coloque la bavette de carne en la salmuera y déjela tapada durante 1 hora. Escurrir y transferir a un tazón limpio. Agregue el aceite de oliva virgen extra, el ajo, el chile, la ralladura de limón y el tomillo, luego déjelo marinar durante al menos 1 hora.", "Encienda la barbacoa para que esté lista cuando los filetes hayan terminado de marinarse.", "Mientras tanto, para la salsa, mezcle todos los ingredientes, sazone al gusto y agregue el jugo de limón en el último minuto.", "Retire la carne del adobo, sazone con sal y pimienta y colóquelo en la parrilla en la zona de calor directo. Vigile de cerca los bistecs: bavette cocina rápidamente ya que es bastante fina, y no debe cocinarse más allá de lo normal, de lo contrario será difícil. Ase a la parrilla durante 2 minutos en cada lado para hacer char, luego muévase al borde más frío de la barbacoa para descansar por un par de minutos.", "Mezcle las cebollas con un poco de aceite de oliva, sazone con sal y pimienta y colóquelas directamente en la parrilla en la zona de calentamiento directo y cocine durante 3-4 minutos hasta que queden carbonizadas y tiernas.", "Rebana los filetes y sirve con las cebollas asadas y salsa cruda."], "url": "www_bbc_co_uk_food_recipes_grilled_beef_bavette_86630", "title": "Bavette de ternera a la parrilla con ensalada de cebolla ahumada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ sandía pequeña, sin piel y reservada", "100ml / 3½fl oz de vinagre de jerez", "100 g / 3½ oz de miel clara", "50g / 1¾oz de vid deja en salmuera, se seca en un horno bajo", "2 cucharadas de aceite de oliva virgen extra, más extra para decorar", "Calamares de 500 g / 1 libra y 2 onzas, limpiados, rayados y cortados en pedazos del tamaño de un bocado, tentáculos reservados", "200g / 7oz de aceitunas verdes", "200 g / 7 oz de queso de cabra, roto en trozos pequeños", "escamas de sal y pimienta negra agrietada", "perejil de hoja plana, para adornar"], "method": ["Cortar la carne de sandía en rectángulos de aproximadamente 15x5 cm / 6x2 pulgadas. Guárdelo en la nevera hasta que lo necesite. Recortar círculos de la piel con un cortador de 2-3 cm.", "Coloque el vinagre de jerez y la miel en una olla pequeña y caliéntelo durante 2-3 minutos. Retire del fuego y agregue la piel cortada de la sandía. Dejar de lado.", "Mientras tanto, caliente una sartén hasta que esté caliente. Rocíe el aceite de oliva sobre el calamar y sazone con sal y pimienta. Ase el calamar y los tentáculos hasta que estén ligeramente carbonizados y la carne ya no sea transparente.", "Arregle la sandía, las aceitunas y la cuajada de cabra en platos para servir. Ponga los calamares y las crujientes hojas de vid encima y termine con hojas de perejil, un chorrito de aceite de oliva y un último rechinar de sal y pimienta. Termina con los círculos de corteza de melón."], "url": "www_bbc_co_uk_food_recipes_grilled_calamari_68427", "title": "Calamares a la plancha, sandía, aceitunas, cuajada de cabra y hojas de vid crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 gallinas, unidas en pedazos", "2 cucharadas de aceite vegetal", "5 dientes de ajo, aplastados", "4 cm / 1½ en pieza de jengibre fresco y picado", "½ cebolla, finamente picada", "3 hojas de laurel", "3 vainas de cardamomo, solo semillas", "½ shatkora (disponible en tiendas de comestibles asiáticas), reducido a la mitad longitudinalmente y en rodajas finas", "1 canela grande", "¼ cucharadita de cúrcuma molida", "¼ cucharadita de chile en polvo", "¼ cucharadita de comino molido", "¼ cucharadita de curry en polvo", "½ cucharadita de cúrcuma molida", "200 ml / 7 fl oz oz yogur", "1 hexágono, solo jugo", "Shekkora Vedgas", "chapatis, calentados"], "method": ["Para el pepinillo, caliente el aceite. Mezcle el ajo, el jengibre y la cebolla para formar una pasta. Agregue la pasta a la sartén. Agregue suficiente agua para aflojar un poco y cocine por unos minutos. Agregue las hojas de laurel y el cardamomo.", "Agregue el shatkora a la sartén. Agregue una ramita de canela, luego la cúrcuma, el chile en polvo, el comino y el polvo de curry. Cocine a fuego lento durante 15 minutos. Este es un pepinillo instantáneo, por lo que no se mantendrá durante más de tres días en la nevera.", "Para el adobo, mezcle los ingredientes y frote la pasta en el pollo, trabajando a fondo para cubrir toda la carne y la piel. Cubra y deje marinar en el refrigerador por 4 horas, o durante la noche.", "Para cocinar el pollo, precaliente la parrilla a fuego alto. Ase el pollo durante 10-12 minutos en cada lado, o hasta que esté cocido. Si es necesario, exprime más jugo de shatkora en el pollo durante la cocción.", "Sirva el pollo con pepinillo shatkora, cuñas y chapatis."], "url": "www_bbc_co_uk_food_recipes_grilled_chicken_shatkora_00658", "title": "Shatkora de pollo a la parrilla con encurtido y chapatis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_chicken_shatkora_00658_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "2 cucharaditas de aceite de oliva", "2 papas, peladas y en cubos", "1 diente de ajo, aplastado", "½ cebolla, picada", "2 ramitas de romero, hojas recogidas y finamente picadas", "sal y pimienta negra recién molida", "½ limón, solo jugo", "1 cucharada de mantequilla", "1 chalote grande, finamente picado", "2 puñados de hongos morel, limpios", "generoso splash Madeira", "250ml / 9fl oz de caldo de pollo (preferiblemente caldo de pollo blanco)", "Crema doble 250ml / 9fl oz", "4 pechugas de pollo", "Calabacines para bebés de 250 g / 9 oz", "Puerros de bebé 250 g / 9 oz", "250g / 9 oz azucaradas arvejas", "50g / 2oz de mantequilla"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Precaliente la parrilla a fuego medio-alto.", "Para las papas Parmentier, caliente la mantequilla y el aceite de oliva en una sartén de base pesada. Agregue las papas en cubos y fríalos hasta que estén doradas, revolviendo ocasionalmente, agregue el ajo, la cebolla y el romero a las papas fritas, mezcle bien. Sazonar con sal y pimienta negra recién molida.", "Transfiera las papas a un plato resistente al horno y hornee durante 10 minutos o hasta que estén tiernas. Exprime el jugo de limón.", "Para la salsa morel, caliente la mantequilla en una sartén, agregue los chalotes y una pizca de sal, y freír hasta que los chalotes se ablanden, pero no se doren.", "Incline los champiñones y cocine por 3-4 minutos más. Agregue el Madeira y caliéntelo y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Vierta la crema doble para cubrir los champiñones y cocine a fuego lento durante cinco minutos más.", "Sazone y ase a la parrilla las pechugas de pollo durante aproximadamente 8-10 minutos, o hasta que estén doradas y los jugos salgan limpios.", "Haga hervir una olla grande de agua con una pizca de sal y agregue los calabacines, los puerros y los guisantes dulces. Hierva por 2-3 minutos hasta que esté tierna, luego drene inmediatamente y vuelva a la sartén.", "Agregue la mantequilla a las verduras y revuelva hasta que la mantequilla se derrita y las verduras estén cubiertas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una pechuga de pollo en cada plato y cubra con la salsa morel. Sirva las papas Parmentier y verduras de bebé untadas con mantequilla."], "url": "www_bbc_co_uk_food_recipes_grilled_chicken_with_34352", "title": "Pollo a la parrilla con salsa de morel, papas Parmentier y verduras para bebés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de oliva virgen extra", "1 cucharadita de menta seca", "1 cucharada de orégano griego", "1 limón, cáscara y jugo solamente", "2 dientes de ajo, triturados hasta formar una pasta con un poco de sal", "pizca de copos de chile seco", "2 filetes de cuello de cordero", "2 cucharadas de miel", "1 cucharada de salsa de chile dulce", "¼ de sandía, pelada", "2 naranjas navel, segmentadas", "1 cebolla roja, finamente rebanada", "½ manojo de menta, solo hojas", "200g / 7oz de feta suave", "150 g / 5½ oz de yogur griego", "1 diente de ajo, aproximadamente picado", "½ manojo de menta, solo hojas", "sal y pimienta"], "method": ["Para el cordero, mezcle el aceite, las hierbas, la ralladura de limón y el jugo, el ajo y los copos de chile. Reserve la mitad del adobo en un recipiente aparte. Frote el cordero con el resto, coloque el cordero en un tazón en el refrigerador y deje marinar durante al menos una hora, idealmente durante la noche.", "Agregue la salsa de miel y chile al adobo restante - esto se convertirá en un aderezo - y reserve.", "Para la crema de feta, mezcle el queso feta con el yogur y el ajo en un procesador de alimentos, agregue las hojas de menta y el pulso hasta que se corte. Sazone al gusto con sal y pimienta y reserve.", "Para completar el cordero, corte la sandía y organícela en cuatro platos y espolvoréelos con segmentos de naranja y cebolla roja (exprima cualquier jugo de naranja para cortar los segmentos en el aderezo).", "Caliente una sartén a la plancha, sazone los filetes de cordero y cocínelos a su gusto, volteándolos regularmente (6-7 minutos para el medio raro). Poner a un lado, en un lugar cálido, para descansar.", "Rocíe un poco de crema de queso feta sobre la sandía, corte el cordero finamente y colóquelo sobre el melón. Esparcir con hojas de menta y rociar con el aderezo de limón y chili."], "url": "www_bbc_co_uk_food_recipes_grilled_greek_lamb_neck_63552", "title": "Filete de cordero griego a la parrilla con cebolla de sandía, naranja y rojo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas de comino", "½ cucharadita de semillas de cilantro", "¼ cucharadita de semillas de hinojo", "pizca de semillas de alcaravea", "6 chiles verdes de ojo de pájaro, toscamente picados", "2 dientes de ajo, aplastados", "100ml / 3½ fl oz aceite de ajo o aceite de oliva", "½ cilantro fresco de pequeño racimo, toscamente picado", "Espinaca baby 100g / 3½oz, sin tallos", "2 manzanas Granny Smith, sin corazón, más o menos picadas", "½ cucharada de miel", "sal y pimienta negra recién molida", "pequeño puñado de hojas frescas de perejil, albahaca y rúcula", "½ limón, solo jugo", "50g / 1¾oz pasta de tahini", "1 diente de ajo, aplastado", "½ cucharadita de sal", "½ cucharadita de aceite de oliva", "1 cucharada de yogur natural", "4 chuletas de cordero", "4 cebolletas, cortadas a la mitad", "2 cucharadas de aceite de oliva", "½ limón", "hojas frescas de cilantro, para adornar"], "method": ["Para hacer la harissa, coloque el comino, el cilantro, el hinojo y las semillas de alcaravea en una sartén de base pesada y tueste a fuego medio-alto hasta que esté humeante y fragante. Transfiera a un molinillo de especias y mezcle hasta obtener un polvo fino.", "Pon el chile y el ajo en un procesador de alimentos. Agregue el aceite y mezcle hasta obtener un puré. Agregue el cilantro, las espinacas y la mezcla de especias y mezcle hasta que quede suave. (Es posible que necesite agregar un toque más de aceite o agua para mover la licuadora). Agregue las manzanas y la miel y el pulso hasta incorporarlas a la salsa. Debe tener una consistencia espesa, similar al pesto. Sazonar con sal y pimienta y reservar.", "Para hacer el tahini verde, mezcle las hierbas con 50 ml / 2 fl oz de agua en un procesador de alimentos hasta que quede suave.", "Mezcle el jugo de limón, el tahini y el ajo en un recipiente para mezclar o en un procesador de alimentos, agregue una pequeña cantidad del agua Herby y bata o mezcle hasta que se combinen. Poco a poco agregue el agua herby restante hasta que tenga una pasta suelta. Sazone con sal, aceite de oliva y más jugo de limón, si es necesario.", "Para hacer las chuletas de cordero, mezcle 50 ml / 2 fl oz del harissa con el yogur en un tazón grande. Agregue las chuletas de cordero y masajee la carne hasta que cada trozo esté bien cubierto. Cubra y marinado en la nevera durante 2-4 horas, pero preferiblemente durante la noche.", "Cuando esté listo para cocinar, precaliente la barbacoa, asegurándose de cocinar sobre brasas. Alternativamente, caliente una sartén de plancha de hierro fundido a fuego alto hasta que esté caliente. (Asegúrese de cocinar en un área bien ventilada).", "Ase las chuletas de cordero durante 2-3 minutos en cada lado, hasta que estén bien carbonizadas alrededor de los bordes y la grasa esté crujiente y dorada, pero la carne todavía es suave al tacto y rosada por dentro. Sazone ambos lados con sal y pimienta a medida que cocina.", "Mientras tanto, cepille las cebolletas y el limón con aceite de oliva y sazone con sal y pimienta. Colóquelos en una rejilla y ennegrezca debajo de la parrilla hasta que se ablanden.", "Para servir, coloca una cucharada de tahini verde en un plato grande para servir. Coloque las chuletas de cordero encima con las cebolletas al costado. Adorne con unas pocas hojas de cilantro y un chorrito del limón ennegrecido."], "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chop_with_68571", "title": "Chuleta de cordero a la parrilla con manzana verde harissa, tahini verde y cebolla de primavera", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["120g / 4oz de hojas de ajo silvestre blanqueadas", "1 diente de ajo, pelado y rallado", "20 g / ¾oz de piñones, tostados", "200ml / 7fl oz de aceite de oliva", "½ limón, solo ralladura", "30 g / 1 oz de queso parmesano, rallado", "sal y pimienta", "6 chuletas de cordero, francés recortado", "aceite de oliva, para cepillar el cordero", "Reales Jersey precocidos de 200 g / 7oz", "30 g / 1 oz de hojas de ajos silvestres, lavadas"], "method": ["Para el pesto de ajo silvestre, recoger y lavar las hojas de ajo silvestre y blanquear las hojas en una olla de agua hirviendo durante 30 segundos. Vuelva a refrescar en un tazón de agua helada. Exprima el exceso de agua y corte aproximadamente.", "Agregue las hojas, el ajo, los piñones, el aceite de oliva, la ralladura de limón y el parmesano rallado al procesador de alimentos y mezcle. Condimentar con sal y pimienta.", "Para las chuletas de cordero a la parrilla, caliente una sartén plana y rocíe las chuletas con aceite. Cocine por dos minutos en un lado y voltee y cocine por otros 30 segundos. Permita que las chuletas descansen.", "Mientras el cordero descansa, caliente una sartén mediana y fríe las papas con mantequilla hasta que estén doradas. Revuelva a través de las hojas de ajo crudo, y una cucharada de pesto, o más si lo prefiere.", "Para servir, ponga la ensalada de papa en un tazón para servir y apile las chuletas de cordero en la parte superior. Pon un poco de pesto extra en la parte superior si te gusta. Cualquier pesto restante se puede guardar en el refrigerador para usarlo en otra receta."], "url": "www_bbc_co_uk_food_recipes_grilled_lamb_chops_wild_41287", "title": "Chuletas de cordero a la parrilla, pesto de ajo silvestre y Jersey Royals", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]