[{"ingredients": ["8 claras de huevo de rango medio", "pizca de sal", "400 g / 14 oz de azúcar en polvo", "2 cucharaditas de vinagre de vino blanco", "4 cucharaditas de harina de maíz", "Crema doble de 900 ml / 1½ pinta", "2 cucharadas colmadas de azúcar glas", "10-15 frutas de la pasión maduras, partidas a la mitad y semillas recogidas", "4 limones sin cera, cáscara y jugo solamente", "200 g / 7 oz de azúcar en polvo", "100 g / 3½ oz de mantequilla sin sal, en cubos", "3 huevos medianos de gallinas camperas, más 1 yema de huevo mediana de gallinas camperas", "1 limón, ralladura solamente", "licor de limoncello, para servir (opcional)"], "method": ["Precalentar el horno a 150C / 140C Fan / Gas 2.", "Dibuje un círculo de 20cm / 8in en tres pedazos de pergamino para hornear y ponga cada pieza en una bandeja para hornear por separado.", "En un tazón muy limpio bata las claras de huevo con una pizca de sal con una batidora de mano a velocidad media hasta que se formen picos suaves cuando se quita la batidora. Aumente la velocidad a medio-alto y agregue el azúcar una cucharada a la vez. Cuando se haya incorporado todo el azúcar, continúe batiendo por un minuto más. Agregue el vinagre y la harina de maíz y luego bata a alta velocidad hasta que el merengue esté brillante y mantenga los picos rígidos cuando se quite el batidor (esto tomará alrededor de 5 minutos).", "Divida la mezcla en partes iguales entre los círculos en las tres bandejas para hornear. Uno de los discos se usará para superar el nivel, por lo que debería verse especialmente bien.", "Hornee hasta que los merengues tengan una costra crujiente y se sientan secos al tacto, alrededor de 1-1¼ hora (el interior seguirá siendo similar a un malvavisco).", "Apague el horno y deje que los merengues se enfríen en el horno, dejando la puerta del horno ligeramente abierta. Deje que los merengues se enfríen muy lentamente en el horno.", "Para el relleno, azote la crema y el azúcar glas hasta que se formen picos suaves cuando se quite la batidora. Revuelve suavemente la carne de maracuyá.", "Para la cuajada de limón, ponga la ralladura de limón, el jugo de limón, el azúcar y la mantequilla en un tazón resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del recipiente. Revuelva la mezcla de vez en cuando hasta que la mantequilla se derrita. Retire el tazón del fuego.", "En otro recipiente, bata ligeramente los huevos y la yema de huevo. Agite suavemente en la mezcla de limón, luego mezcle hasta que todos los ingredientes estén bien combinados.", "Coloque el tazón sobre el agua hirviendo. Caliente la crema de limón durante 10-13 minutos, revolviendo de vez en cuando, hasta que la mezcla esté cremosa y lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Retire la cuajada de limón del fuego y déjela enfriar, revolviendo ocasionalmente. Se espesará a medida que se enfríe.", "Para ensamblar, cubra un disco de merengue con un tercio de la crema de fruta de la pasión y una llovizna de la cuajada de limón. Repita con los otros dos discos de merengue para hacer una pila de tres niveles. Decora la parte superior con más cuajada de limón y la ralladura de limón rallado. Servir con una inyección de limoncello, si se usa."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_and_passion_24599", "title": "Cuajada de limón y maracuyá pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 pavlova grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 claras de huevo de gallinas camperas", "280 g / 10 oz de azúcar en polvo", "50 g / 1¾ oz de nueces de pistacho peladas, finamente picadas", "azúcar en polvo, para quitar el polvo", "100 g / 3½ oz de mantequilla, ablandada", "225 g / 8 oz de azúcar en polvo", "5 yemas de huevo de gallinas camperas", "3 limones grandes, jugo y ralladura finamente rallada", "300 ml / 10 fl oz crema doble, ligeramente batida"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Cubra una lata de rollo suizo de 23x33cm / 9x13in con papel para hornear antiadherente engrasado.", "Batir las claras de huevo en un tazón grande limpio con una batidora eléctrica a velocidad máxima hasta que estén muy rígidas. Poco a poco agregue el azúcar, una cucharadita a la vez, y aún a alta velocidad, batiendo bien entre cada adición. Batir hasta que esté muy, muy tieso y brillante y se haya agregado todo el azúcar.", "Extienda la mezcla de merengue en la lata preparada, espolvoree con las nueces picadas. Hornee durante unos 8 minutos hasta que estén dorados. Baje el horno a 160C / 140C Fan / Gas 3 y hornee durante 15 minutos más hasta que esté firme al tacto. Retire y voltee boca abajo en un trozo de papel de hornear antiadherente. Con cuidado, pele el papel de la base del merengue y déjelo enfriar durante aproximadamente 10 minutos.", "Para hacer la cuajada de limón, ponga la mantequilla en un recipiente resistente al calor, agregue el azúcar y bata con la mano hasta que se combinen. Agregue las yemas de huevo. Agregue la ralladura de limón y el jugo y bata hasta que quede suave. Siente el recipiente sobre una fuente de agua hirviendo a fuego lento y bata hasta que la mezcla se espese. Esto llevará entre 8 y 10 minutos. Tenga cuidado de que el agua no hierva, ya que esto cuajará la cuajada.", "Reserve 100 g / 3½ oz (aproximadamente 6 cucharadas soperas) de la cuajada de limón y reserve. Vierta la crema de limón restante en un recipiente esterilizado. Sellar y etiquetarlo. Se mantendrá en la nevera durante 2 semanas.", "Para llenar el rollo, mezcle la crema de limón reservada con la crema batida, girando para dar un efecto marmoleado. Extiende sobre el merengue refrigerado. Marque ligeramente el merengue a lo largo de un lado largo, ligeramente desde el borde. Use esto para ayudarlo a doblar y comenzar a rodar la base. Enrolle bien el merengue, usando el papel para ayudarlo. Siéntate en un plato con la unión debajo.", "Para servir, espolvorear con azúcar glas y decorar con pollitos de Pascua."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_and_pistachio_20948", "title": "Rollo de merengue de pistacho y pistacho de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_and_pistachio_20948_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["90g / 3¼ oz de mascarpone", "1 cucharada de azúcar glas, al gusto", "6 cucharadas de cuajada de limón", "30g / 1oz de almendras copos tostadas", "4 panqueques, para servir"], "method": ["Bate el azúcar glas en el mascarpone poco a poco hasta que esté suave y lo suficientemente dulce como para satisfacer tus gustos.", "Extiende la cuajada de limón sobre los panqueques. Cubra con una cucharada de mascarpone y las almendras en copos."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_mascarpone_04597", "title": "Panqueques de cuajada de limón, mascarpone y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_mascarpone_04597_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 claras de huevo de gallinas camperas", "400 g / 7 oz azucarero blanco", "4 limones, ralladura y jugo", "110g / 4oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas, golpeados", "Crema doble 500ml / 18floz", "50g / 1¾oz physalis (uchuva)", "2 maracuyá, solo semillas", "50 g / 1¾oz de cerezas", "50g / 1¾oz de grosella roja"], "method": ["Para el merengue, precaliente el horno a 150C / 300F / Gas1.", "Batir las claras de huevo en un bol hasta que se formen picos suaves cuando se quita el batidor.", "Poco a poco agregue el azúcar y continúe batiendo hasta que los picos suaves se formen de nuevo. Coloque la cuchara en una manga pastelera equipada con una pequeña boquilla simple.", "Para hacer una plantilla, dibuje cuatro círculos de 20 cm / 8 pulgadas de diámetro en un pergamino para hornear y colóquelos en una bandeja para hornear.", "Comenzando en el centro de cada círculo, coloca el merengue en espiral para llenar el círculo, manteniendo la altura del merengue lo más baja posible.", "Cocine en el horno por 20 minutos.", "Apaga el horno pero deja los merengues allí durante al menos dos horas. Cuando esté crujiente, retíralo del horno y déjalo enfriar.", "Para la cuajada de limón, coloque la ralladura de limón, el jugo, la mantequilla y el azúcar en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. (No permita que el recipiente toque el agua).", "Batir de vez en cuando hasta que el azúcar esté completamente disuelto, luego batir en los huevos y batir hasta que espese y se cueza a través.", "Retirar del fuego y dejar enfriar por completo.", "Batir la crema doble en un tazón grande hasta que se formen picos suaves cuando se quite la batidora, luego doblar la cuajada de limón y mezclar suavemente.", "Coloque una manga en una manga pastelera y corte el extremo, dando un ancho de aproximadamente 1.5 cm / ½ pulg.", "Para armar la torta, coloque un disco de merengue en un plato de servir.", "Pase la crema de cuajada de limón en espiral sobre el merengue para cubrirla por completo.", "Coloque otro disco de merengue en la parte superior y repita con la crema.", "Repita con el merengue y la crema restantes, terminando con merengue en la parte superior.", "Decora con la fruta y sirve en trozos."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_meringue_cake_09194", "title": "Pastel de merengue de cuajada de limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 4oz de mantequilla ligeramente salada", "Azúcar en polvo de 110 g / 4 oz", "2 limones, ralladura y jugo", "2 huevos de gallinas camperas, a temperatura ambiente, batidos", "mantequilla sin sal, para engrasar", "4 huevos de gallinas camperas, tres huevos enteros más una yema de huevo", "160g / 5¾oz de azúcar en polvo, más extra para enrollar", "160g / 5¾oz de harina de auto crianza, tamizada"], "method": ["Para la cuajada de limón, ponga la mantequilla, el azúcar, la ralladura de limón y el jugo en un recipiente colocado sobre una olla de agua hirviendo (asegúrese de que el recipiente no toque el agua). Revuelva ocasionalmente hasta que el azúcar se disuelva.", "Cuando el azúcar esté disuelto, agregue los huevos batidos y continúe calentando, revolviendo ocasionalmente, hasta que la mezcla se espese. Transfiera a un recipiente para enfriar.", "Para la esponja, precaliente el horno a 200C / 400F / Gas 6. Engrase y forre una bandeja para hornear de 26x40cm / 10½x16 pulgadas con papel para hornear.", "Coloque un recipiente grande a prueba de calor sobre una fuente de agua hirviendo. Agregue los huevos y el azúcar al tazón y bata hasta que estén tibios (no sobrecaliente la mezcla). Retire el recipiente y bata hasta que la mezcla esté muy espesa y deje rastros cuando se retire el batidor. Doble la harina tamizada con una cuchara de metal.", "Extienda la mezcla en la bandeja de horneado preparada y colóquela en el estante del medio en el horno. Hornee durante 8-10 minutos, o hasta que esté firme al tacto.", "Coloque un pedazo grande de papel a prueba de grasa o una toalla de té en la superficie de trabajo y espolvoree con azúcar. Incline la torta sobre el papel / la toalla de té desempolvados y retire cuidadosamente el pergamino para hornear.", "Extiende la cuajada de limón aún caliente sobre la esponja.", "Coloque el pastel con uno de los extremos cortos más cercanos a usted. Haga un corte en el ancho de la esponja de aproximadamente 1 cm / ½ pulgada adentro y alrededor de tres cuartas partes del camino a través de la profundidad de la esponja (esto lo ayudará a enrollar la esponja). Aprieta bien la esponja comenzando por el borde más cercano y usando la toalla de papel / té para ayudarte. Dejar de lado para enfriar.", "Antes de servir, recorte los extremos del rollo para crear un acabado limpio y espolvoree con un poco de azúcar extra, si lo desea."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_swiss_roll_49855", "title": "Lemon Curd Swiss roll", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 rollo suizo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "225 g / 8oz de mantequilla sin sal, derretida", "Harina de levante 225g / 8oz", "Vodka 100 ml / 3½ fl oz", "2 limones, jugo y ralladura solamente", "250 g / 9 oz de azúcar en polvo", "Frambuesas congeladas de 300g / 10½oz", "75 g / 2½ oz de azúcar en polvo", "1 vaina de vainilla, solo semillas", "4 limones, jugo y ralladura", "225g / 8oz de mantequilla sin sal", "Azúcar en polvo 350g / 12oz", "4 huevos de gallinas camperas", "600 ml / 20 fl oz de leche", "Crema doble 600ml / 20fl oz", "1 vaina de vainilla, cortada por la mitad a lo largo", "150 g / 5½ oz de azúcar", "100 g / 3½ oz de harina de maíz", "3 huevos de gallinas camperas", "3 yemas de huevo de gallinas camperas", "50 g / 1¾oz de mantequilla sin sal, en cubos", "400ml / 14fl oz de crema doble, batida", "4 cucharadas de nueces de pistacho desalmajadas y sin cáscara"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4 y forre una lata de pastel de 15x20 cm / 6x8 con papel de hornear. Alternativamente, use 2 latas de pastel redondas de 2 x 20 cm / 8 pulgadas (la forma de la lata no importa ya que la torta se romperá por la bagatela).", "Para la esponja, en un tazón grande bata los huevos y el azúcar en alto con un batidor eléctrico durante 3 minutos, o hasta que estén espesos, cremosos y al menos duplicados de tamaño. Vierta la mantequilla derretida en un flujo constante, mezcla todo el tiempo. Doble suavemente la harina en la mezcla.", "Vierta la mezcla en la lata preparada y hornee durante 20-25 minutos. Retire del horno y deje enfriar un poco en la lata antes de transferirlo a una rejilla para que se enfríe completamente.", "Para el jarabe de limón, en una olla, combine todos los ingredientes con 100 ml / 3½ fl oz de agua y deje que hierva. Una vez almibarado, retírelo del fuego y déjelo a un lado para que se enfríe.", "Para la compota, combine todos los ingredientes con 150ml / ¼ de agua en una olla. Hervir a fuego lento durante unos 10 minutos. Retirar del fuego y reservar para enfriar.", "Para la cuajada de limón, en una cacerola lleve suavemente el jugo de limón, la ralladura, la mantequilla y la mitad del azúcar a fuego lento. En un tazón, combine el azúcar restante con los huevos y bata ligeramente. Vierta lentamente la mezcla de jugo sobre los huevos, batiendo constantemente. Vierta nuevamente en la sartén y coloque a fuego lento. Revuelva constantemente durante aproximadamente 5 minutos hasta que espese. Pase a través de un colador y manténgalo refrigerado hasta que lo necesite.", "Para la crema pastelera, caliente suavemente la leche, la crema y la vainilla en una cacerola hasta que hierva. Retire del fuego. Combina el azúcar y la harina de maíz en un tazón y bate gradualmente los huevos y las yemas.", "Vierta la mezcla de leche tibia sobre los huevos, poco a poco, batiendo constantemente. Regrese a la sartén y revuelva constantemente a fuego lento hasta que espese. Pase a través de un colador y retire la vaina de vainilla. Cubra la superficie con papel de hornear para evitar que la piel se forme mientras la natilla se enfría.", "Para armar la bagatela, comience por capas de piezas de la esponja en el fondo de un plato de servir o vasos individuales. Vierta sobre el jarabe y déjelo en remojo unos 5 minutos más o menos.", "Agregue una capa de la compota de frambuesa y luego la cuajada de limón. Coloque la crema en la parte superior. Termine con la crema batida y espolvoree sobre los pistachos triturados. Refrigere hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_lemon_curd_trifle_04769", "title": "Bicarbonato de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo de oro", "3 huevos grandes de gallinas camperas (orgánicas si es posible)", "Harina simple de 50g / 2oz o harina de espelta blanca", "125g / 4½ oz de almendras molidas", "2 limones (jugo de 1 y ralladura finamente rallada de 2)", "1 limón, solo jugo", "5-6 cucharadas de azúcar glas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase la base y los lados de una lata de torta redonda de 20-22 cm / 8-8½ pulgadas y forre la parte inferior con pergamino para hornear.", "En un tazón, mezcle la mantequilla y el azúcar hasta que estén suaves y esponjosos con un batidor eléctrico o con una cuchara de madera. Lentamente golpee los huevos, uno a la vez. Cuando los huevos estén completamente incorporados, dobla la harina, luego las almendras y la ralladura de limón.", "Raspe la mezcla en la lata y golpee los lados para liberar cualquier burbuja de aire. Hornee por 35-40 minutos, o hasta que la esponja esté ligeramente dorada, saliendo de los lados de la lata y una brocheta insertada en el centro del pastel salga limpia.", "Mientras el pastel esté todavía caliente y quieto en la lata, apuñalo con un palillo o con alguna de esas armas en todo el pastel, haciendo 15 o más agujeros. Rocíe el jugo de limón en los agujeros y en todo el pastel, luego déjelo en la lata para que se enfríe.", "Cuando esté listo para servir el pastel, haga la guinda. Para hacer la guinda, mezcle el jugo de limón, poco a poco, en el azúcar glas para hacer una pasta suave. Retire la torta de la lata y alise la formación de hielo en la parte superior, luego sirva."], "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_cake_66665", "title": "Tarta de limón y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_66665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de mantequilla, ablandada, más extra para engrasar", "Azúcar en polvo 350g / 12oz", "4 limones, solo ralladura, más jugo de 2 limones", "3 piezas grandes de cáscara de limón confitada, finamente picada", "6 huevos de gallinas camperas", "3 cucharaditas de polvo de hornear", "300g / 10½ oz de harina de auto crianza", "50g / 2 oz de harina de maíz", "60 g / 2¼ oz de mantequilla", "225 g / 8 oz de azúcar en polvo", "3 limones, jugo y ralladura", "2 huevos de gallinas camperas", "300 ml / 12 fl oz crema doble", "200g / 7oz de azúcar glas, tamizado, más extra para espolvorear"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee tres latas de emparedado de 20 cm / 8 in.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Agregue la ralladura de limón y el jugo y la cáscara confitada.", "Lentamente golpee los huevos, uno a la vez, hasta que la mezcla esté bien combinada.", "Tamice el polvo de hornear, levante la harina y la harina de maíz en un bol y dóblelos en la mezcla de la torta.", "Divida la masa de la torta entre las latas de sándwich y hornee por 25-30 minutos o hasta que se levante y se dore. Retire del horno y deje enfriar por 10 minutos. Pase un cuchillo de hoja redonda alrededor del borde interior de las latas para aflojar los pasteles. Retire los pasteles de las latas y déjelos a un lado para que se enfríen completamente en una rejilla.", "Mientras los pasteles se cocinan, prepare la cuajada de limón. Caliente la mantequilla, el azúcar y el jugo de limón y la ralladura en un recipiente colocado sobre una fuente de agua hirviendo, revolviendo ocasionalmente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. (No permita que la base del recipiente toque la superficie del agua). Retire del fuego.", "Mientras tanto, bate los huevos en un recipiente aparte. Bata lentamente la mezcla derretida de mantequilla en los huevos batidos hasta que estén bien combinados.", "Coloque el recipiente sobre la fuente de agua hirviendo a fuego lento y cocine, batiendo constantemente, durante 2-3 minutos o hasta que la mezcla se espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Tamiza la cuajada de limón en un tazón limpio, luego cúbrela con una película adhesiva y déjala enfriar.", "Para el relleno, batir la crema y el azúcar glas juntos en un bol hasta que se formen picos suaves cuando se quite el batidor.", "Coloque uno de los pasteles en un plato de servir y unte con la cuajada de limón. Extiende un poco de crema batida y sándwich con otro pastel. Repite el proceso con el resto de cuajada de limón, crema batida y capas de pasteles. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_cake_with_90476", "title": "Tarta de limón con crema de limón y crema doble", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_with_90476_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Extensión para hornear de 225 g / 8 oz, directamente del refrigerador, o mantequilla a temperatura ambiente, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "Harina de auto aumento 275g / 10oz", "Polvo de hornear 2 cucharaditas de nivel", "4 huevos de gallinas camperas", "4 cucharadas de leche", "2 limones, solo cáscara", "1 cucharada colmada de verbena de limón muy finamente picada (opcional)", "175g / 6oz de azúcar granulada", "2 limones, solo jugo"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase la lata con un molde para hornear y forre la base con papel de hornear.", "Mida todos los ingredientes en un tazón grande y bata durante 2 minutos, o hasta que estén bien mezclados. Convierta la mezcla en la lata preparada y nivele la parte superior.", "Hornee durante 35-40 minutos hasta que la torta se haya encogido un poco desde los lados de la lata y salte hacia atrás cuando se toca ligeramente con la yema del dedo en el centro del pastel.", "Mientras tanto, haz el glaseado. Mezcle el azúcar granulada con el jugo de limón y revuelva hasta obtener una consistencia líquida.", "Deje que la torta se enfríe durante 5 minutos en la lata, luego retírela, con el papel de revestimiento todavía pegado, y colóquela en una rejilla colocada sobre una bandeja.", "Cepille el glaseado sobre la superficie de la torta caliente y déjelo reposar. Retire el papel de revestimiento y corte en rodajas para servir."], "url": "www_bbc_co_uk_food_recipes_lemon_drizzle_traybake_01890", "title": "Bandeja de llovizna de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_traybake_01890_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pollo entero (1.5-1.8kg / 3lb 5oz-4lb)", "1 cucharadita de sal", "1 cucharadita de pimienta negra", "½ cucharadita de romero fresco finamente picado", "½ cucharadita de cebollines frescos finamente picados", "1 cucharadita de pimentón dulce ahumado", "1 limón, ralladura y jugo", "2 cucharadas de aceite de oliva"], "method": ["Para espolvorear el pollo, gírelo hacia abajo con las piernas hacia usted. Con unas tijeras de cocina o tijeras para aves de corral muy resistentes, corte un lado de la nariz y la columna del párroco. Voltee el pollo y corte a lo largo del otro lado de la columna vertebral, de regreso a la nariz del párroco. Retire esta pieza y deséchela. Voltee el pollo con la pechuga hacia arriba nuevamente y presione firmemente sobre el esternón para aplanarlo.", "Mezcle la sal, los granos de pimienta, las hierbas, el pimentón y la ralladura de limón en un tazón pequeño y mezcle con el aceite. Frote esta mezcla por todo el pollo.", "Coloque el pollo en un recipiente o una bolsa de plástico y vierta sobre el jugo de limón. Coloque en el refrigerador para marinar durante la noche o durante al menos 1 hora.", "Retire el pollo de la nevera 1 hora antes de que esté listo para cocinarlo.", "Coloque el pollo en el horno caliente y reduzca la temperatura a 200 ° C / Ventilador 180 ° C / Gas 6. Asar durante 35-40 minutos hasta que esté cocido y los jugos salgan limpios. Alternativamente, cocine el pollo en una barbacoa, volteándolo regularmente hasta que esté bien cocido.", "Para cocinar en el horno, precaliente el horno a su configuración más alta y coloque el pollo en una bandeja grande para asar."], "url": "www_bbc_co_uk_food_recipes_lemon_herb_and_paprika_35932", "title": "Pollo salpicado de limón, hierba y paprika", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 400 g / 14 oz pueden garbanzos, drenados", "1 diente de ajo, aplastado", "5 cucharadas de aceite de oliva virgen extra", "2 limones, cáscara y jugo solamente", "3 cucharadas de yogur griego", "un buen comino molido", "mucha pimienta negra molida y sal"], "method": ["Coloque todos los ingredientes en un procesador de alimentos con dos cucharadas de agua caliente y mezcle hasta que quede suave.", "Sazonar, probar y servir frío."], "url": "www_bbc_co_uk_food_recipes_lemon_hummus_83864", "title": "Hummus de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8 como parte de un plato para compartir", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_hummus_83864_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca fuerte de 250g / 9oz, tamizada", "Harina normal de 250 g / 9 oz, tamizada", "125ml / 4fl oz de agua tibia", "125m / 4fl oz de leche caliente", "1 x 7 g / ¼ onza de levadura seca de acción rápida", "2 cucharadita de sal marina fina", "50 g / 2 oz de azúcar en polvo", "1 limón, ralladura solamente", "1 huevo de gallinas camperas, golpeado", "50 g / 2 oz de mantequilla, cortada en cubos", "aceite vegetal, para engrasar", "50g / 2oz de azúcar glas, cernida", "½ limón, solo jugo"], "method": ["Coloque las harinas, el agua, la leche, la levadura, la sal, el azúcar y la ralladura de limón en un tazón grande y mezcle con un tenedor hasta que se combinen. Agregue el huevo batido y la mantequilla y continúe mezclando hasta que la mezcla se una como una masa pegajosa.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante cinco minutos, o hasta que la masa esté suave y elástica.", "Engrase ligeramente un recipiente con un poco de aceite vegetal.", "Coloque la masa en el recipiente y gírela hasta cubrirla con aceite. Cubra el recipiente con film transparente y déjelo a un lado en un lugar cálido durante una hora, o hasta que la masa se haya duplicado.", "Engrase ligeramente dos bandejas para hornear.", "Devuelve la masa a su tamaño original y colócala en una superficie de trabajo ligeramente enharinada. Divida la masa en ocho porciones, métalas en rondas y colóquelas en las bandejas para hornear. Asegúrese de que los rollos estén bien espaciados. Cubra con un paño de cocina y reserve para probar durante 30 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Hornee los bollos en el horno durante 20-25 minutos o hasta que estén bien dorados. Retire los bollos del horno y déjelos a un lado para que se enfríen en una rejilla de alambre.", "Mientras tanto, para la formación de hielo, mezcle el azúcar glas y el jugo de limón en un tazón hasta que quede suave.", "Una vez que los panecillos se hayan enfriado por completo, extienda el glaseado sobre ellos y déjelos a un lado hasta que la formación de hielo se haya endurecido."], "url": "www_bbc_co_uk_food_recipes_lemon_iced_buns_24468", "title": "Bollos congelados de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 8 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón no encerado", "200g / 7oz de azúcar granulada", "100 g / 3½ oz de azúcar en polvo", "175g / 6oz de mantequilla suavizada", "175g / 6oz de azúcar en polvo", "Harina de levante 225g / 8oz", "50 g / 1¾oz de almendras molidas", "4 huevos grandes de gallinas camperas", "1 limón grande sin cera, ralladura fina solamente"], "method": ["Para la cáscara confitada, corte el limón en 8 cuñas, luego corte la carne, dejando un espesor de 5 mm de cáscara y médula. Corta cada cuña en 4 tiras.", "Vierta 300ml / 10fl de agua en una olla pequeña, agregue el azúcar granulada y caliente, revolviendo hasta que el azúcar se haya disuelto. Agregue la ralladura de limón y cocine a fuego lento sin tapar durante 30-45 minutos, hasta que la cáscara de limón esté suave y translúcida.", "Escurrir en un tamiz de alambre y dejar enfriar. Extiende la cáscara en una bandeja para hornear forrada con pergamino y espolvorea con azúcar en polvo. Coloque en el horno en el ajuste más bajo (aproximadamente 110C / 90C Fan / Gas ¼) durante 1 hora hasta que se seque.", "Para la torta, precaliente el horno a 180 ° C / 160 ° C. Ventilador / Gas 4. Engrase una lata de torta redonda de 18 cm / 7 pulgadas de profundidad y forre la base y los costados con papel de hornear.", "Coloque la mantequilla, el azúcar, la harina, las almendras molidas, los huevos y la ralladura de limón en un tazón grande. Usando una batidora eléctrica, bata durante 1 minuto para mezclar bien. Convierta en la lata preparada y nivele la superficie.", "Hornea por 35 minutos. Decora con 3 trozos de cáscara confitada y hornea durante 20-25 minutos más, hasta que un pincho insertado en el centro salga limpio. Deja en la lata durante 15 minutos para que se enfríe antes de pasar a una rejilla para que se enfríe por completo."], "url": "www_bbc_co_uk_food_recipes_lemon_madeira_cake_with_15109", "title": "Tarta de limón de Madeira con cáscara confitada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 x pastel de 18cm / 7in", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_madeira_cake_with_15109_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de extensión para hornear", "150g / 5½ oz de harina de auto crianza", "150 g / 5½ oz de azúcar en polvo", "3 cucharadas de leche entera", "2 huevos de gallinas camperas", "1 limón sin cebar, ralladura fina solamente", "7 g de fresas liofilizadas (disponibles en grandes supermercados), para decorar", "cuajada de limón", "2 claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para muffins de 12 orificios con estuches.", "Coloque los ingredientes de la esponja en un bol y bata con un batidor de mano eléctrico hasta que estén suaves y esponjosos. Cuchara la mezcla de manera uniforme entre los casos. Hornea durante 18-20 minutos o hasta que estén doradas, alisadas y elásticas al tacto. Dejar de lado para enfriar por completo.", "Corta un círculo profundo en el centro de cada pastel (aproximadamente el ancho de una moneda de £ 2) y saca una esponja de tamaño de nuez para dejar un agujero. Ponga 1 cucharadita de cuajada de limón en cada hoyo, asegurándose de que la cuajada esté nivelada con la parte superior.", "Para hacer el merengue, bata las claras de huevo en un tazón grande con un batidor de mano eléctrico hasta que esté tieso. Poco a poco agregue el azúcar a medida que continúa batiendo a toda velocidad, hasta que tenga una mezcla brillante tieso. Extienda o pipe en la parte superior de cada cupcake y siéntese en sus latas.", "Use un soplete de chef para dorar los merengues o deslice la bandeja debajo de la parrilla. Mire con cuidado y quítelo cuando esté dorado.", "Espolvoree con las fresas liofilizadas."], "url": "www_bbc_co_uk_food_recipes_lemon_meringue_cupcakes_41613", "title": "Cupcake de merengue de limon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 magdalenas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_cupcakes_41613_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 300 ml / ½ pinta", "1 limón, ralladura y jugo", "1 tarro de limón de buena calidad", "Merengues de 50g / 1¾oz, rotos en trozos gruesos", "2 cucharadas de bálsamo de limón fresco picado", "3 maracuyá, mitades, pulpa y semillas recogidas", "ramitas de bálsamo de limón, para adornar"], "method": ["Alinee una lata de pan de 450 g / 1 lb con film transparente, solapando los lados. Batir la crema ligeramente hasta que el batidor deje un rastro, agregar la ralladura de limón y el jugo y la mitad del tarro de cuajada de limón, luego doblar en el merengue y el bálsamo de limón picado.", "Coloque la mezcla en la lata del pan, cúbrala con film transparente y congélela durante al menos seis horas.", "Si el helado se ha congelado durante la noche o más, retírelo del congelador durante 10 a 15 minutos antes de colocarlo en un plato. Levante el helado del molde de pan, inviértalo en un tablero y retire la película adhesiva. Sumerja un cuchillo filoso en agua hirviendo y corte el helado en rebanadas gruesas.", "Mezcle la otra mitad de la cuajada de limón con la pulpa y las semillas de la fruta de la pasión. Coloque una rebanada de helado en un plato y cubra con una cucharada de salsa de maracuyá. Decorar con ramitas de Melisa."], "url": "www_bbc_co_uk_food_recipes_lemon_meringue_ice_cream_57978", "title": "Helado de merengue de limón con bálsamo de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_ice_cream_57978_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "pizca de sal", "125g / 4½oz de mantequilla, cortada en cubos", "1 cucharada de azúcar en polvo", "2 yemas de huevo grandes de gallinas camperas", "3 cucharadas de agua fría", "80g / 2¾oz de harina de maíz", "Azúcar en polvo 325g / 11½oz", "150ml / ¼ de litro de jugo de limón", "1 limón sin cebar, ralladura fina solamente", "80 g / 2¾oz de mantequilla sin sal, cortada en cubos", "4 yemas de huevo grandes de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "3 claras de huevo grandes de gallinas camperas"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para hacer la masa, tamiza la harina y la sal en un tazón. Frote la mantequilla con la punta de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue el azúcar.", "Agregue las yemas de huevo y luego el agua fría, poco a poco, usando un cuchillo de mesa para unir la masa. Si la mezcla está demasiado seca para mantenerla unida, agregue un poco más de agua. No trabajes demasiado la masa ni la pongas demasiado pegajosa o se volverá dura. Forme un disco, cubra con una película adhesiva y colóquelo en la nevera durante al menos 10 minutos.", "Desenvuelva la masa y extiéndala en una superficie ligeramente enharinada en un círculo grande de aproximadamente 3 mm de grosor.", "Transfiera la masa en el rodillo a una lata agria de fondo suelto de 23 cm / 9 pulgadas, presionándola en todas las esquinas y dejando que el exceso de bollos cuelgue sobre el borde. Enfriar en la nevera durante 10 minutos.", "Coloque la lata tarta forrada en una bandeja para hornear. Alinee la caja de pastelería con papel de horno y granos de cerámica para hornear o frijoles secos. Hornea por 15-20 minutos. Retire los frijoles y el papel y hornee por otros 5-8 minutos, hasta que estén dorados. Deja enfriar. Corta el exceso de masa con un cuchillo afilado.", "Para hacer el relleno, combine la harina de maíz y el azúcar en una cacerola, luego agregue el jugo de limón y 300ml / 10½ fl oz de agua hasta que quede suave. Llevar a ebullición, revolviendo con frecuencia, hasta que la mezcla se espese. Reduzca el fuego, cocine a fuego lento durante 1-2 minutos, luego retírelo del fuego e inmediatamente agregue las yemas de huevo. Deja enfriar un poco.", "Agregue la ralladura de limón y la mantequilla y mezcle hasta que se combinen. Viértalo en la caja de repostería y déjelo enfriar por completo. La mezcla debe ser lisa, espesa y fraguada.", "Para hacer el merengue, ponga el azúcar y 75ml / 2½fl de agua en una olla y déjelo hervir suavemente, revolviendo hasta que el azúcar se disuelva. Cocine hasta que el jarabe de azúcar alcance 120C en un termómetro.", "Mientras tanto, ponga las claras de huevo en un mezclador independiente con un batidor de globo. Cuando el jarabe llegue a 110 ° C, comience a batir hasta que se formen picos rígidos cuando se retire la batidora. Una vez que el jarabe alcanza los 120 ° C, mientras la batidora está batiendo, vierta sobre las claras de huevo. Tenga cuidado de no verterlo sobre el accesorio de mezcla, ya que podría salpicarlo hacia usted. Batir hasta que el merengue esté frío; debe ser brillante y rígido.", "Retire la tarta enfriada de la lata. Vierta el merengue sobre la parte superior, asegurándose de que no haya espacios y extiéndalo para que toque la masa (esto evitará que se deslice). Usa la cuchara para hacer que gire suavemente o para crear picos en todas partes.", "Usando un soplete, caramelice suavemente el merengue. Alternativamente, puede hacer esto debajo de una parrilla precalentada por unos segundos. Servir."], "url": "www_bbc_co_uk_food_recipes_lemon_meringue_pie_01804", "title": "Pastel de merengue de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_pie_01804_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, huevos y yemas separados", "150 g / 5½ oz de azúcar en polvo", "3 limones, cáscara y jugo solamente", "300ml / 10½ fl oz crema doble", "15 g de gelatina, empapada en agua", "100 g / 3½ oz de azúcar en polvo", "50 g / 1¾oz de mantequilla sin sal", "30 fresas frescas, tallos eliminados", "400ml / 14fl oz Rioja", "200 g / 7 oz de azúcar en polvo", "2 limones, corte de ralladura en tiras finas"], "method": ["Para la mousse de limón, mezcle las yemas de huevo, el azúcar, la ralladura y el jugo de los limones hasta que dupliquen su volumen.", "En un tazón limpio, bate la crema hasta que se formen picos suaves cuando se quite el batidor, luego agrega la gelatina. Dobla la crema en la mezcla de yema de huevo.", "Batir las claras de huevo en un recipiente limpio por separado hasta que se formen picos suaves, y luego doblarlos en la mezcla de yema de huevo.", "Decantar en pequeños vasos o platos y colocarlos en la nevera.", "Para las fresas tostadas, coloque una sartén al fuego y agregue el azúcar y la mantequilla. Una vez derretido, agregue las fresas y agregue el azúcar y la mantequilla. Ponga a un lado hasta que esté listo para servir.", "Para la Rioja y el jarabe de limón, coloque la Rioja en una cacerola mediana y cocine hasta que se reduzca a la mitad del volumen. Agregue el azúcar y la mayoría de la ralladura de limón y cocine por otros 10 minutos.", "Para servir coloque la mousse en el plato con las fresas al lado y vierta sobre el jarabe. Cubra la mousse con la ralladura de limón reservada."], "url": "www_bbc_co_uk_food_recipes_lemon_mousse_with_25853", "title": "Mousse de limón con fresas tostadas, Rioja y jarabe de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas (si lo desea, puede usar claras de huevo de un cartón)", "375 g / 13 oz de azúcar en polvo", "2½ cucharadita de harina de maíz", "2 limones no encerados", "300ml / 10½ fl oz crema doble", "325g / 11½ oz de cuajada de limón", "50 g / 1¾oz de almendras en copos, tostadas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "Batir las claras de huevo con una batidora eléctrica hasta que se formen picos satinados, luego batir en el azúcar una cucharada a la vez hasta que el merengue esté tieso y brillante.", "Espolvorea la harina de maíz sobre el merengue, luego ralla la ralladura (un microplane fino es mejor para esto) de 1 limón y agrega 2 cucharaditas de jugo de limón.", "Doble suavemente hasta que todo esté bien mezclado. Montón en la bandeja de horno forrada en un círculo gordo de aproximadamente 23 cm de diámetro, alisando los lados y la parte superior con un cuchillo o una espátula. Coloque en el horno, luego reduzca inmediatamente la temperatura a 150 ° C / 130 ° Ventilador / Gas 2 y cocine durante 1 hora.", "Retírelo del horno y déjelo enfriar, pero no lo deje frío en ningún lugar ya que esto lo hará romperse demasiado rápido. Si cree que su cocina está demasiado fría, deje la pavlova dentro del horno con la puerta completamente abierta. Cuando esté listo para comer, coloque la pavlova sobre un plato o placa grande con la parte inferior hacia arriba, hago esto antes de sentarme a la comida en cuestión y dejarla reposar hasta el momento del pudín. Esto es así que el vientre de malvavisco tierno del pavé se funde con el suave relleno.", "Batir la crema hasta que esté gruesa y aireada, pero aún con una suave voluptuosidad, y dejarla de lado por un momento.", "Ponga la cuajada de limón en un bol y bátalo con una cuchara de madera o una espátula para aflojarlo un poco. Pruebe la cuajada de limón (si se compró en la tienda) y agregue un poco de ralladura de limón y un chorrito de jugo si es demasiado dulce.", "Con una mano liviana, un corazón alegre y una espátula, extiende la cuajada de limón encima de la base de merengue. Ahora cubra con la crema batida, picarla como si fuera un relleno de merengue. Espolvorea con la ralladura del limón restante - puedes rallar esto fino o grueso como desees - seguido de almendras en copos, y sirve triunfante."], "url": "www_bbc_co_uk_food_recipes_lemon_pavlova_50340", "title": "Lemon Pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_pavlova_50340_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Esencia de vainilla de 2 ml", "Esencia de limón 2ml", "2 ml de vinagre de Champagne o vinagre de vino blanco", "2 cucharaditas de agua caliente", "4 claras de huevo de gallinas camperas", "Azúcar 80 g / 3 oz", "1 cucharada de harina de maíz", "2 yemas de huevo de gallinas camperas", "160g / 5¾oz de azúcar", "100ml / 3½fl oz de jugo de limón", "2 cucharaditas de jugo de lima", "60 g / 2¼ oz de mantequilla", "1 limón, solo corteza, en juliana", "1 lima, solo corteza, en juliana", "100g / 3½ oz de azúcar", "crema batida"], "method": ["Precalentar el horno para 135C / 115C Fan / Gas 1. Cubra una bandeja grande para hornear con papel de hornear.", "Disuelva la esencia de vainilla, la esencia de limón y el vinagre en el agua caliente.", "Usando una batidora eléctrica, bata las claras de huevo hasta que queden tieso en un recipiente muy limpio. Agregue el azúcar y la harina de maíz y continúe batiendo durante 2 minutos, luego agregue la mezcla de agua y bata hasta que se formen picos fuertes.", "Usando una cuchara de cocina muy grande, haga 12 quenelles grandes de la mezcla de merengue y colóquelas en la bandeja revestida. Cocine el merengue durante 1 hora, luego apague el horno y deje el merengue en el horno durante la noche.", "Mientras tanto, para la cuajada de limón. Batir las yemas y el azúcar hasta que quede suave y pálido. Agregue el limón y el jugo de lima. Coloque la mezcla a través de un colador en un recipiente resistente al calor. Agrega la mantequilla. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento y cocine la cuajada hasta que quede suave y espesa.", "Para la cáscara confitada. Ponga a hervir una olla pequeña de agua, agregue las cáscaras y cocínelas durante 20 segundos. Colar y hervir nuevamente en agua dulce. Para el tercer hervor, agregue el azúcar a 100 ml / 3½ fl oz de agua y caliente suavemente hasta que se disuelva. Devuelve la corteza a la sartén. Una vez que el líquido se redujo a un jarabe, eliminar del fuego. Retire con cuidado la corteza (el azúcar hirviendo se calienta mucho) y déjela enfriar.", "Mezcle la cuajada con la crema batida. Cubra los pavlovas con la mezcla de crema batida y un poco de cáscara confitada. Sirve 3 mini pavlovas por persona."], "url": "www_bbc_co_uk_food_recipes_lemon_pavlova_89056", "title": "Lemon Pavlova", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 425 ml / ¾ de pinta", "125g / 4½ oz de azúcar", "2 limones, solo jugo", "95g / 3¼ oz de mantequilla", "60g / 2¼ oz de azúcar", "2 huevos de gallinas camperas", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "pizca de sal", "50 g / 1¾oz de almendras tostadas picadas", "½ cucharada de semillas de hinojo", "azúcar en polvo, para quitar el polvo"], "method": ["Para el posset, llevar la crema y el azúcar a ebullición en una sartén. Reduzca el fuego a fuego lento y cocine durante 1-2 minutos. Agregue el jugo de limón y mezcle bien. Pase a través de un colador fino y déjelo enfriar durante cinco minutos.", "Elimine las burbujas de aire de la superficie y vierta en seis vasos para servir. Transfiera al refrigerador por al menos dos horas, o hasta que esté listo.", "Para biscotti, precaliente el horno a 170 ° C / 325 ° F / Gas 3 y alinee una bandeja para hornear con papel para hornear.", "Tamizar la harina y el polvo de hornear juntos. En otro recipiente, bata la mantequilla y el azúcar hasta que estén suaves y cremosos. Agregue los huevos uno a la vez con una cucharada de harina cada vez (para evitar que la mezcla se parta). Tamice la mezcla de harina restante y mezcle para combinar. Doble las almendras tostadas y las semillas de hinojo.", "Polvore ligeramente una superficie de trabajo con harina y dé forma a la masa en dos formas de salchicha. Coloque en la bandeja de horno preparada y aplanar ligeramente la masa.", "Hornee en el horno durante 20-25 minutos, o hasta que estén pálidas doradas. Retire del horno y deje enfriar durante 10 minutos.", "Después de 10 minutos, corte el pan en rebanadas gruesas de 2 cm / ¼ y coloque los panecillos en una rejilla que se ajuste al horno. Coloque la parrilla en el horno durante cinco minutos o hasta que las galletas se sequen.", "Retire del horno e inmediatamente espolvoree con azúcar glas. Deje que se enfríe completamente antes de servir con el posset de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_fennel_86459", "title": "Posset de limón con biscotti de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_posset_with_fennel_86459_16x9.jpg", "isVegetarian": true, "recommendations": 0}]