[{"ingredients": ["50 ml / 2 fl oz de agua", "225 g / 8 oz azucarero blanco", "4 claras de huevo de gallinas camperas", "75g / 3oz de avellanas, finamente picadas", "1 esponja de chocolate pequeña hecha confeccionada", "500ml / 1lb 2oz de helado de vainilla", "Helado de caramelo de 500ml / 1lb 2oz", "Crema doble 500ml / 18fl oz", "175g / 6oz demerara azúcar", "175g / 6oz de mantequilla", "1 cucharada de jarabe de oro", "1 cucharada de melaza negra"], "method": ["Para Alaska horneada, coloque el agua y el azúcar en una sartén y llévelo a ebullición. Limpie la superficie y limpie los lados de la sartén con un cepillo de pastelería mojado para eliminar los cristales de azúcar, luego aumente el fuego para que el jarabe hierva rápidamente.", "Inserta un termómetro de azúcar. Cuando la mezcla de azúcar alcanza 110 ° C / 225 ° F bata las claras de huevo con un mezclador eléctrico hasta que se formen picos rígidos.", "Cuando la mezcla de azúcar alcance 121ºC / 250º F retírelo del fuego. Habrá formado un jarabe.", "Coloque la batidora eléctrica en la posición más baja y luego vierta el jarabe de azúcar en las claras de huevo en una corriente fina y constante, y siga batiendo hasta que se incorpore todo el jarabe.", "Continúe batiendo a baja velocidad hasta que la mezcla esté casi fría, esto puede demorar hasta 15 minutos.", "Doble las avellanas en la mezcla de clara de huevo y luego póngalo en una bolsa con una boquilla simple.", "Coloque la esponja de chocolate en un plato para servir y cubra con cucharadas de helado de vainilla y toffee.", "Pase el merengue por el helado, cubriéndolo por completo de arriba a abajo. Esmalte el merengue con un mini soplete o hornee brevemente en un horno muy caliente.", "Para la salsa toffee, vierta la crema en una sartén y caliente suavemente. Agregue el azúcar y la mantequilla y bata hasta que se derrita. Agregue el jarabe y la melaza.", "Para servir, corte las rodajas de Alaska al horno y colóquelas en platos para servir. Rocíe la salsa sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_meringuetoffeebakeda_86358", "title": "Merienda de merengue al horno Alaska con salsa de caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pomelo pequeño", "2 limones", "1 dulce o naranja de Sevilla", "1.75 litros / 3 pintas de agua", "1,4 kg / 3 lb 1 oz de azúcar granulada", "75 ml / 5 cucharadas de whisky, ron o brandy"], "method": ["Juice la fruta y vierta el jugo en una sartén grande con tapa con una capacidad de 6-8 litros / 10-14 pintas. Agrega el agua", "Raspe las membranas internas y las pepitas de la fruta con un cuchillo pequeño y afilado. Coloque las membranas en un procesador de alimentos o mini-picadora y pique finamente. Coloque las membranas picadas y cualquier pepita en una bolsa de muselina o en una pieza de muselina atada con una cuerda. Agregar a la sartén.", "Triture la cáscara a su espesor preferido y agréguela a la sartén. Reserve para permitir que la piel penetre durante unas horas o, si es posible, durante la noche.", "Haga hervir la olla con tapa, reduzca el fuego y cocine a fuego lento durante dos horas. La cáscara debe ser muy tierna.", "Mientras tanto, precaliente el horno a 140C / 275F / Gas 1. Vierta el azúcar en una fuente para hornear y caliente en el horno durante unos minutos.", "Retire la bolsa de muselina de la sartén y exprima el líquido de la bolsa en un recipiente. Pase a través de un tamiz y agregue a la sartén.", "Pese los contenidos de la sartén - no debe ser más de 1.4kg / 3lb 1oz. Si tiene más que esto, devuelva el contenido a la sartén y cocine a fuego lento para reducir el líquido hasta que se logre el peso correcto.", "Agregue el azúcar caliente a la sartén y revuelva hasta que se disuelva. Poco a poco llevar la sartén a hervir. Después de siete minutos, pruebe el punto de ajuste sacando una cucharada grande de la mermelada. Deje que la mezcla se enfríe un poco, luego vuelva a verterla lentamente en la sartén. Si está en el punto de ajuste, las gotas se ejecutarán juntas para formar un copo colgante (esto se conoce como prueba de escamas). Puede llevar hasta 30 minutos alcanzar el punto de ajuste, por lo tanto, siga probando.", "Deje que la mermelada se enfríe durante 5-10 minutos (se debe formar una capa en la superficie). Elimine cualquier residuo de la superficie y agregue el licor de su elección a la sartén. Revuelva suavemente la mermelada para distribuir uniformemente la cáscara y el alcohol.", "Vierta la mermelada en frascos esterilizados y selle. Deje las jarras en posición vertical y sin perturbar para establecer."], "url": "www_bbc_co_uk_food_recipes_merry_marmalade_90280", "title": "Feliz mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace aprox. 2.25kg / 5lb", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite en aerosol bajo en calorías", "1 cebolla, finamente rebanada", "2 dientes de ajo, aplastados", "1 pimiento amarillo, sin semillas y cortado en trozos de 3cm / 1in", "½ cucharadita de chile en polvo", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "400 g de frijoles mezclados con estaño, escurridos y enjuagados", "125g / 4½oz de arroz integral de grano largo, para servir", "100g / 3½oz de yogur griego sin grasa, para servir", "1 lima, cortada en cuñas, para servir", "sal y pimienta negra recién molida", "1 tomate, toscamente picado", "4 cucharadas de cilantro fresco tostado", "2 cebollas de primavera, en rodajas finas"], "method": ["Rocíe una sartén grande con aceite y coloque a fuego medio. Agregue la cebolla y el ajo y cocine suavemente durante tres minutos, revolviendo regularmente. Agregue la pimienta y cocine por dos minutos.", "Agregue las especias y cocine por unos segundos, luego agregue los tomates, puré de tomate y frijoles mezclados. Vierta más de 300ml / 10fl oz de agua fría y cocine a fuego lento. Sazonar con un poco de sal y mucha pimienta negra molida y cocinar durante 30 minutos, revolviendo ocasionalmente hasta que espese.", "Mientras tanto, llena a medias una cacerola mediana con agua y llévala a ebullición. Agregue el arroz y vuelva a hervir. Cocine por 25 minutos, o hasta que estén tiernos, revolviendo ocasionalmente.", "Para hacer la salsa, mezcle el tomate, el cilantro y las cebolletas en un bol.", "Escurra el arroz y divídalo entre dos platos. Vierta los frijoles y esparza la salsa. Sirva con el yogur y las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_mexican_bean_stew_75910", "title": "Guiso de frijoles mexicanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexican_bean_stew_75910_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "1 cebolleta, finamente cortada", "½ diente de ajo, en rodajas finas", "1 cucharadita de semillas de comino", "pizca de copos de chile seco", "400 g de frijoles negros de hojalata, escurridos y enjuagados", "200 ml / 7 fl oz existencias de oz (hecho de ½ cubo de existencias o ½ cucharadita de polvo de caldo)", "140g / 5oz de arroz integral", "pequeño puñado de cilantro fresco, finamente picado", "1 lima", "½ pimiento rojo, en rodajas finas", "2 tomates pequeños, cortados en cubitos", "198g de maíz dulce de hojalata, escurrido y enjuagado", "½ aguacate, picado, opcional", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue la cebolla tierna, el ajo y las especias y cocine durante 1-2 minutos, hasta que estén fragantes. Agregue los frijoles y el caldo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento con la tapa cerrada durante 25 minutos, revolviendo ocasionalmente.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete. Agregue el cilantro y el jugo de la mitad de la lima y la temporada.", "Coloque el arroz en el fondo de un tazón y cubra con los frijoles negros, el pimiento rojo, los tomates, el maíz dulce y el aguacate, si los está usando. Sirva con una rodaja de lima en un lado."], "url": "www_bbc_co_uk_food_recipes_mexican_black_bean_96128", "title": "Cuenco de Buda de frijol negro mexicano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vinagre de jerez 110ml / 4fl oz", "Ciruelas pasas 150 g / 5½ oz", "110ml / 4fl oz de jerez", "Pan rallado de 30 g / 1¼ oz panko", "1 manojo de perejil fresco de flatleaf", "1 cucharada de ralladura de limón rallado", "sal al gusto", "1 diente de ajo, aplastado", "3 cucharadas de aceite de colza", "1 cebolla, más o menos picada", "2 zanahorias, aproximadamente picadas", "2 palitos de apio, más o menos picados", "1 puerro, más o menos picado", "4 dientes de ajo", "1 cucharada de tomillo fresco picado", "375ml / 13fl oz de vino blanco", "50 ml / 2 fl oz en Madeira", "2 litros / 3½ pintas de caldo de pollo", "3 vainas de cardamomo", "Anís de 2 estrellas", "½ naranja, solo ralladura", "2 manzanas, sin corazón y mezcladas a un puré", "500ml / 18fl oz de jugo de tomate", "700g / 1lb 9oz hombro de cerdo", "Vientre de cerdo 300g / 11oz", "2 chiles verdes, finamente picados", "1 manojo de cilantro picado", "2 chalotes de plátano, finamente picados", "vinagre de malta, al gusto", "sal y pimienta negra recién molida", "2-3 huevos de gallinas camperas, solo blancos, ligeramente golpeados", "Pan rallado panko de 110 g / 4 oz", "2-3 cucharadas de aceite de oliva", "2-3 cucharadas de mostaza inglesa", "¼ de cabeza de coliflor, rallado", "1 cucharada de semillas de sésamo, tostadas", "sal al gusto", "Coliflor de 1/2 cabeza, cortada en florecillas", "Leche 250ml / 9fl oz", "sal al gusto", "150ml / 5fl oz de crema doble", "1 cucharadita de jugo de limón", "2-3 cucharadas de berros de bebé o hierbas, como el perejil o el cilantro", "cortezas de cerdo"], "method": ["Para las ciruelas pasas, caliente el vinagre en 300 ml / 11 fl oz de agua y luego vierta sobre las ciruelas pasas con el jerez. Déjalo en remojo durante la noche.", "Para la persilla, mezcle las migas de pan y el perejil hasta obtener una textura fina, agregue el ajo triturado, la ralladura de limón y la sal y mezcle bien.", "Para el cerdo estofado, precaliente el horno a 140C / 275F / Gas 1.", "Calienta el aceite en una sartén grande de base pesada. Agregue las cebollas, las zanahorias, el apio, los puerros, el ajo y el tomillo y cocine, revolviendo ocasionalmente, hasta que estén caramelizados por todos lados.", "Agregue el vino blanco y Madeira a la sartén y raspe las brochetas cocidas del fondo de la sartén con una cuchara de madera. Cocine a fuego lento hasta que se reduzca en volumen a la mitad.", "Agregue el caldo, el cardamomo, el anís estrellado, la ralladura de naranja, el puré de manzana y el jugo de tomate.", "Llevar a ebullición, agregar el hombro de cerdo y el vientre, volver a hervir y luego tapar y colocar en el horno durante 3-4 horas.", "Cuando esté tierno y cocido, retírelo del horno y déjelo enfriar un poco.", "Mientras la carne esté aún caliente, quítela del licor de cocción y tire de la carne en pequeños hilos usando sus manos o dos tenedores.", "Ponga esta carne tirada en un bol con algo de la grasa del licor de cocción. El licor de cocina se puede reservar: prepare una salsa hirviendo a fuego lento algo del licor para reducirlo en volumen a la consistencia de la salsa, listo para servir.", "Para el cerdo prensado, condimente el cerdo desmenuzado con los chiles picados, cilantro, chalotes, vinagre de malta, sal y pimienta negra recién molida. Pruebe y ajuste el aderezo si es necesario.", "Extienda dos capas grandes de película adhesiva sobre una superficie de trabajo limpia. Coloque la carne cocida y condimentada en una línea, aproximadamente 5 cm / 2 pulgadas de profundidad, 4 cm / 1 pulgadas de alto y 15 cm de largo, dejando un espacio en cada extremo.", "Envuelva la carne en la película adherida, luego enrolle la película adhesiva en forma de salchicha apretada y ate cada extremo de forma segura.", "Pinchar todo con un cuchillo puntiagudo. Refrigere hasta que esté listo.", "Precalentar el horno a 180C / 350F / Gas 4.", "Corte el rollo de película adhesiva fría en formas cilíndricas anchas de 5 cm / 2 pulgadas.", "Retire la película adhesiva y cepille la carne con huevo batido alrededor de los lados redondeados del rollo, pero no los extremos planos, luego enrolle panqueques panko, manteniendo los extremos planos libres de migas.", "Calentar una sartén hasta que esté medianamente caliente, agregar un poco de aceite de oliva y colorear el lado moteado de pan de cerdo hasta que se dore por todas partes.", "Coloque en el horno y caliente a través.", "Retire del horno y extienda una fina capa de mostaza sobre la superficie plana superior y espolvoree generosamente con la persillade preparada, luego vuelva al horno por otros cinco minutos.", "Para el cuscús de coliflor, mezcle todo junto y agregue sal al gusto.", "Para la crema de coliflor, caliente la coliflor, la leche y la sal en una cacerola hasta que hierva a fuego lento y cocine durante 12 a 15 minutos.", "Cuando esté cocido y suavizado, retire la coliflor de la leche, pero reserve la leche.", "Puré la coliflor con algo del licor de cocina y crema extra doble si lo desea.", "Pruebe y ajuste el condimento; jugo de limón se puede agregar aquí si es necesario.", "Para servir, caliente el puré de coliflor hasta que esté caliente y extiéndalo por la base de los platos para servir, luego espolvoree el cuscús de coliflor sobre el puré.", "Siente la carne de cerdo en el centro del plato en la parte superior de la coliflor. Coloque tres mitades de ciruela en cada plato alrededor del cerdo.", "Adorne con hierbas de bebé, raspaduras de cerdo y cerdo y vierta un poco de salsa por el exterior."], "url": "www_bbc_co_uk_food_recipes_mexican_crisp_pressed_10726", "title": "Cerdo prensado crujiente mexicano con ciruelas pasas, vinagre de jerez y crema de coliflor", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas grandes, picadas", "500 g / 1 libra de carne picada 2 oz", "1 chile rojo suave, sin semillas y finamente picado", "1 pimiento rojo, sin semillas y cortado en cubitos", "2 dientes de ajo, aplastados", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "2 cucharadas de puré de tomate", "1-2 cucharadas de chutney de mango", "2 x 400 g de tomates picados", "1 cilantro fresco de racimo pequeño, picado", "sal y pimienta negra recién molida", "3 envolturas de tortilla grandes", "250 g / 9 oz de grasa total mascarpone", "Mozzarella 100 g / 3½ oz, rallado", "100g / 3½oz de queso cheddar"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Vierta el aceite en una sartén grande a prueba de horno a fuego medio, agregue las cebollas y fría por 3 minutos. Suba el fuego, agregue la carne picada y fría hasta que se dore, partiendo la carne con una cuchara de madera y revolviendo ocasionalmente.", "Agregue el chile, el pimiento rojo, el ajo y las especias y fría por 5 minutos, o hasta que toda la humedad se haya evaporado y la mezcla esté bastante seca. Agregue el puré de tomate, chutney de mango, tomates enlatados y sal y pimienta negra. Cubra con una tapa, deje hervir y transfiera al horno a fuego lento durante una hora.", "Retire del horno y mezcle la mitad del cilantro. Aumente la temperatura del horno a 200C / 180C Fan / Gas 6.", "Extienda un tercio de la mezcla de carne picada cocida sobre el fondo del plato resistente al horno y coloque una tortilla en la parte superior. Extienda un tercio del mascarpone (vea la punta) sobre la tortilla y espolvoree con un tercio de cada uno de los quesos mozzarella y Cheddar. Repite dos veces más para tener 3 capas.", "Hornee en el horno durante unos 25 minutos hasta que estén dorados y burbujeantes. Reserve por 5 minutos antes de servir y adorne con el cilantro restante."], "url": "www_bbc_co_uk_food_recipes_mexican_tortilla_bake_28158", "title": "Tortilla mexicana horneada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexican_tortilla_bake_28158_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de filete de cordero, en rodajas", "½ pimienta romero, en rodajas", "1 diente de ajo, en rodajas", "1 cucharadita de hojuelas de chile", "1 cucharadita de cilantro molido", "100ml / 3½fl oz de caldo de verduras", "1 cucharadita de salsa Tabasco", "2 cucharadas de mantequilla", "3 cucharadas de azúcar moreno", "1 paquete de puerros pequeños", "1 cucharada de vinagre de vino tinto", "25 g / 1 oz de chocolate negro, rallado", "3 cucharadas de yogur griego"], "method": ["Para el cordero con especias, dore las rodajas de cordero en una sartén caliente hasta que estén ligeramente doradas por ambos lados. Agregue la pimienta y el ajo y cocine por 3-4 minutos.", "Agregue los copos de chile y el cilantro molido y revuelva. Vierta el caldo de verduras y cocine a fuego lento durante 10 minutos.", "Para los puerros agridulces, derrita la mantequilla y el azúcar moreno en una sartén hasta que se forme un caramelo.", "Agregue los puerros tiernos y cocínelos durante 3-4 minutos, o hasta que estén suaves. Agregue el vinagre de vino tinto y cocine por un minuto más.", "Para servir, coloque el cordero en un plato caliente y sirva los puerros en el lado. Cubra con el chocolate rallado y el yogur griego."], "url": "www_bbc_co_uk_food_recipes_mexicanchillilambwit_76865", "title": "Chili de cordero mexicano con puerros agridulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de eglefino 700g / 1½lb", "¼ cucharadita de pimienta negra", "½ cucharadita de semillas de comino", "½ cucharadita de semillas de cilantro", "½ cucharadita de orégano seco", "½ cucharadita de cúrcuma", "½ cucharadita de pimentón", "¼ cucharadita de pimienta de cayena", "3 dientes de ajo picados", "1 naranja de Sevilla, solo jugo y 1 lima", "o", "1 lima, solo jugo y ½ pomelo", "o", "1 lima, solo jugo y 1 naranja Sevillana", "½ cucharadita de sal", "Tomates maduros de 450 g / 1 lb, sin semillas y finamente cortados en cubitos", "½ cebolla roja, finamente picada", "1 diente de ajo, muy finamente picado", "2 chillis verdes, sin semillas y finamente picados", "½ naranja de Sevilla, solo jugo o ½ pomelo", "1 cucharadita de azúcar", "4 cucharadas de cilantro fresco picado", "sal", "pimienta negra recién molida", "tortillas de harina blandas", "Crema agria de 150 ml / ¼ de pinta (opcional)", "rodajas de limón"], "method": ["Divida el eglefino en cuatro porciones.", "Para hacer el adobo, seca los granos de pimienta, el comino y las semillas de cilantro a fuego moderado hasta que oscurezcan un poco y emitan un aroma.", "Incline en un recipiente y deje enfriar un poco. Muela con el orégano, la cúrcuma, el pimentón y la pimienta.", "En un mortero, machaque el ajo hasta obtener una pasta con sal, y gradualmente trabaje en las especias y los jugos cítricos.", "Ponga esta mezcla sobre el eglefino y luego voltee el resto en el mortero.", "Deje marinar durante al menos una hora y hasta cuatro horas.", "Para hacer la salsa, mezcle todos los ingredientes, luego pruebe y ajuste los condimentos. Enfriar en la nevera hasta que sea necesario.", "Precalentar una parrilla o barbacoa.", "Envuelva las tortillas en papel de aluminio y caliente en el horno o en el borde de la barbacoa.", "Ase el pescado, volteándolo cuidadosamente una vez, hasta que esté completamente cocido. Puede poner cada pieza de pescado en una tortilla caliente, cubrir con una buena cucharada de salsa y una cucharada de crema agria y luego repartirla a sus invitados. Alternativamente (y sus amigos o familiares pueden preferir el enfoque de bricolaje) pásenos los trozos de pescado, tortillas, salsa, crema y lima para que todos puedan armar su propia tortilla de pescado de Yucatán."], "url": "www_bbc_co_uk_food_recipes_mexicanfishtortillas_73223", "title": "Tortillas mexicanas de pescado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pizca de semillas de comino", "pizca de chile seco", "1 cucharada de aceite de oliva", "½ lata de tomates cherry", "200 g / 7oz de frijoles mezclados", "¼ de chile picado", "azúcar pizca", "exprimir jugo de limón", "salpicaduras de agua", "Yogur de estilo griego", "puñado de cilantro", "½ aguacate, en rodajas"], "method": ["En una maja y mortero, muela las especias.", "Caliente el aceite en una sartén y cocine las especias durante 1-2 minutos.", "Agregue los tomates, frijoles, chile, azúcar, jugo de limón y un chorrito de agua y cocine a fuego lento durante 5-8 minutos.", "Vierta en un tazón y cubra con yogurt, cilantro y aguacate."], "url": "www_bbc_co_uk_food_recipes_mexicansoup_75676", "title": "Sopa mexicana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 aguacates maduros pequeños, pelados, sin piedras", "1 diente de ajo, pelado y finamente picado", "½ cebolla pequeña, pelada y finamente picada", "1 chile rojo pequeño, sin semillas, finamente picado", "1 lima, solo jugo", "sal y pimienta negra recién molida", "2 tomates medianos maduros, picados", "½ cebolla, pelada y finamente picada", "pequeño cilantro fresco puñado, picado", "2 cucharadas de aceite vegetal (o 40 g / 1½ oz de manteca de cerdo)", "1 cebolla pequeña, pelada y finamente picada", "Filete de rape 350g / 12oz, picado", "1 diente de ajo, pelado y finamente picado", "½ chile rojo o verde, sin semillas, finamente picado", "dash salsa Worcestershire", "dash salsa Tabasco", "pizca de cayena", "pequeño cilantro fresco puñado, picado", "2 tortillas de harina blandas ya hechas, calentadas brevemente en una sartén seca y caliente", "1 lechuga Little Gem, finamente rebanada", "100 g / 3½ oz de arroz, cocido de acuerdo con las instrucciones del paquete y escurrido", "Queso cheddar de 75 g / 2½ oz, rallado", "100ml / 3½ fl oz crema agria"], "method": ["Para el guacamole, coloque los aguacates en un bol con el ajo, la cebolla y el chile y mezcle aproximadamente con un tenedor.", "Agregue el jugo de lima y sazone al gusto con sal y pimienta negra recién molida. Dejar de lado.", "Para la salsa de tomate, mezcle los tomates, la cebolla y el cilantro en un tazón. Dejar de lado.", "Para el relleno de carne, caliente el aceite o la manteca en una sartén y fría la cebolla durante 1-2 minutos hasta que se ablanden pero no se doren.", "Agregue los trozos de carne a la sartén con el ajo y el chile y saltee durante un minuto.", "Agregue una pizca de pimienta de Cayena y un chorrito de salsa Worcestershire y salsa de Tabasco y cocine por otro minuto, o hasta que esté cocido a su gusto, luego retírelo del fuego.", "Para armar el burrito, coloque las tortillas calentadas en los platos para servir y divida el bistec entre ellas. Cubra con salsa y lechuga y doble para envolver el relleno.", "Sirva el burrito con arroz, queso rallado, crema agria y una cucharada de guacamole."], "url": "www_bbc_co_uk_food_recipes_mexicansteakburrito_86980", "title": "Burrito mexicano de carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexicansteakburrito_86980_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz de tequila", "3 limas, solo jugo", "1 chile rojo, picado", "1 botella de x 330ml / 12fl oz cerveza mexicana", "1 diente de ajo, picado", "8 patas de pollo", "harina, condimentada con sal y pimienta negra recién molida", "aceite vegetal, para freír", "2 aguacates maduros, picados", "2 tomates de ciruela, pelados, sin semillas, picados", "1 guindilla de ojo de pájaro, sin semillas, picada", "1 cucharada de tallos de cilantro fresco picado", "½ cucharadita de chile en polvo", "1 lima, solo jugo", "1 cebolla roja, finamente picada", "1 chile rojo, finamente picado", "2 limas, solo jugo", "2 tomates, picados"], "method": ["Para el pollo; mezcle el tequila, la lima, el chile, la cerveza y el ajo en un tazón grande.", "Anota las patas de pollo con un cuchillo afilado y colócalas en el adobo. Mezcle bien para cubrir el pollo en el adobo, luego transfiera a la nevera para marinar durante dos horas.", "Calentar el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Retire el pollo del adobo y seque.", "Seca las patas de pollo con la harina sazonada, luego colócalas cuidadosamente en el aceite caliente y fríelas durante 15 minutos, o hasta que estén doradas y completamente cocidas.", "Retire con cuidado las patas de pollo del aceite con una espumadera y escurra sobre papel de cocina.", "Para el guacamole, coloque todos los ingredientes de guacamole en un tazón limpio y mezcle bien.", "Para el pico de gallo, coloque todos los ingredientes de pico de gallo en un tazón limpio y mezcle bien.", "Para servir, coloque las patas de pollo en un tazón grande con los tazones de fuente de guacamole y pico de gallo al costado."], "url": "www_bbc_co_uk_food_recipes_mexicanstylefriedchi_85656", "title": "Pollo frito al estilo mexicano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "1 cucharadita de polvo de hornear", "1 huevo de gallinas camperas", "150ml / 5fl oz de leche entera", "sal y pimienta negra recién molida", "1 maíz dulce en la mazorca, solo granos", "1 cucharada de aceite vegetal", "3 tomates, piel y semillas retiradas, picadas", "6 ramitas de cilantro, solo hojas, picadas", "1 chile verde, muy finamente picado", "azúcar pizca", "¼ cebolla roja pequeña, finamente picada", "1 lima, solo jugo", "Una pizca de sal marina", "pimienta negra recién molida", "1 cucharada de vinagre de vino blanco", "4 huevos de gallinas camperas"], "method": ["Para los panqueques de maíz dulce, tamice la harina y el polvo de hornear en un tazón para mezclar, luego mezcle el huevo y la mitad de la leche para formar una masa espesa con una consistencia ligeramente más espesa que la crema doble. Agregue más leche según sea necesario para aflojar la mezcla. Sazone al gusto con sal y pimienta negra recién molida, luego agregue el maíz dulce.", "Caliente el aceite en una sartén a fuego medio a alto. Pon la mitad de la mezcla en la sartén y freír durante 1-2 minutos en cada lado, o hasta que la tortita se dore por ambos lados. Coloque la tortita a un lado en un plato caliente y cubra ligeramente con papel de aluminio. Repita con la masa restante.", "Para la salsa de tomate y chile, mezcla los tomates, el cilantro, el chile, la cebolla finamente picada, el jugo de lima y la sal hasta que estén bien combinados. Sazone al gusto con pimienta negra recién molida.", "Para los huevos escalfados, hierva una olla de agua, mezcle el vinagre y baje el fuego para que el agua hierva a fuego lento. Agregue los huevos y cocine durante 3-4 minutos, o hasta que estén cocidos a su gusto, luego retírelos del molde con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque uno de los panqueques de maíz dulce en cada plato, coloque dos de los huevos escalfados en la parte superior y termine con una cucharada de salsa de chile picante."], "url": "www_bbc_co_uk_food_recipes_mexicansweetcornpanc_89498", "title": "Panqueques de maíz dulce mexicano, huevos escalfados y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexicansweetcornpanc_89498_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Solomillo de 500 g / 1 libra 2 oz, cortado en tiras contra el grano", "100 g / 3½ oz de semillas de comino", "100g / 3½ oz de semillas de cilantro", "50g / 1¾oz de azúcar moreno", "pizca de pimienta Sichuan", "pizca de sal", "pizca de polvo de vinagre de sushi (disponible en los supermercados asiáticos o en línea)", "1 chile seco", "30 g / 1 oz de salsa de soja ligera", "Salsa de ostras 30g / 1oz", "Vinagre de vino de arroz 20g / ¾oz", "1 diente de ajo, finamente picado", "Pieza de tamaño pequeño, jengibre fresco, pelado y finamente picado", "1 cucharada de semillas de sésamo", "10g / ⅓oz de aceite de sésamo", "2 pimientos rojos grandes, en rodajas finas", "50ml / 2fl oz de aceite de colza ahumado", "25 g / 1 oz de azúcar en polvo", "30 g / 1 oz de salsa de soja ligera", "20 g / oz de salsa de soja oscura", "100ml / 3½fl oz de vinagre de vino de arroz", "150ml / 5fl oz de aceite de chile de maní", "50g / 1¾oz de chalotes crujientes y secos, toscamente picados", "Frijoles negros fermentados de 25 g / 1 oz, enjuagados y toscamente picados", "100g / 31/2oz doubanjiang chiles fermentados", "300ml / 10fl oz de aceite de chile", "½ oz de pimienta de Sichuan, molido", "Crema agria de 200ml / 7fl oz", "2 cucharadas de aceite de colza ahumado", "150g / 5½oz de fideos de arroz con grasa seca", "1 cucharada de algas marinas secas molidas", "4 tortillas de harina", "2 cebollas de primavera, cortadas en ángulo", "1 cucharada de semillas de sésamo"], "method": ["Para hacer el bistec, tueste las semillas de comino y cilantro en una sartén seca hasta que estén doradas y fragantes. Coloque en una licuadora de especias con el azúcar, pimienta de Sichuan, sal, polvo de vinagre de sushi y todo el chile seco y muela en un polvo fino. Frote la carne con la mayor parte de la mezcla de especias, reservando un poco para más tarde.", "Dora la carne en una sartén caliente o wok hasta que esté chamuscada y caramelizada pero aún rosa por dentro (ten cuidado de no quemar el azúcar).", "Mezcle los ingredientes restantes de la carne, agregue el aceite de sésamo al final y agítelos para hacer un aderezo. Incline el aderezo para desglasar el wok. Retire del fuego muy rápidamente. Reserve y mantenga caliente hasta que esté listo para servir.", "Para hacer los chiles en vinagre de soja, coloque los pimientos y el aceite en una sartén caliente o wok y caramelice hasta que los bordes estén carbonizados. Agregue el azúcar y cocine por unos minutos más. Agregue la mitad de la soja y la mitad del vinagre, mezcle, retire del fuego y luego agregue el resto de los ingredientes. Dejar de lado hasta que se enfríe a temperatura ambiente.", "Para hacer la salsa de chile, mezcle todos los ingredientes y reserve.", "Para hacer los fideos, precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír a fuego lento los fideos durante unos segundos hasta que estén hinchados y crujientes. Escurra sobre papel de cocina, sazone con las algas molida y reserve. Poner en un tazón pequeño hasta que esté listo para servir.", "Coloque la crema agria en un tazón pequeño, vierta el aceite alrededor de los bordes. Espolvorea un toque del condimento de especias restante en la parte superior. Ponga a un lado hasta que esté listo para servir", "Caliente las tortillas con cuidado en una sartén seca. Ponga una tortilla en un plato y cúbrala con la carne, los pimientos encurtidos, la salsa de chile y la salsa de crema agria. Espolvorear con las semillas de sésamo y cebollas de primavera en rodajas. Sirva con los fideos crujientes en un lado."], "url": "www_bbc_co_uk_food_recipes_mexinese_fajitas_68356", "title": "Envolturas de carne con especias chinas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas, cortadas longitudinalmente", "2 cucharadas de aceite de oliva", "1 cucharada de piñones", "1 diente de ajo, finamente cortado en cubitos", "1 cucharada de perejil de flatillo finamente picado", "2 cucharadas de pan tostado panko japonés tostado", "1 cucharada de pasas doradas", "200g / 7oz de queso feta, desmenuzado", "1 cucharadita de hojas de menta entera, para adornar", "400 g / 14 oz de judías verdes", "400g / 14oz de judías amarillas", "400g / 14oz de judías verdes", "3 huevos de gallinas camperas", "3 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "1 cucharadita de chile rojo, en rodajas", "1 cucharada de vinagre de vino tinto", "1 cucharadita de mostaza Dijon", "1 limón, ralladura solamente", "1 cucharada de hojas de menta rotas", "1 cucharada de hojas de perejil rotas", "4 cebolletas, picadas", "250 g / 9 oz de garbanzos secos, empapados durante la noche", "2 cucharadas de aceite de oliva", "pizca de chile", "pizca de comino", "1 tsc zumaque", "18 tomates cherry maduros, cortados por la mitad", "2 cebollas de primavera, en rodajas", "1 manojo de perejil, finamente picado", "1 manojo de menta, finamente picado", "1 limón, solo jugo", "Harina de pan fuerte 250 g / 9 oz", "½ cucharadita de sal", "150ml / 5fl oz de agua tibia", "5 g de levadura instantánea", "1 cucharadita de aceite de oliva", "200g / 7oz de yogur de espesor"], "method": ["Para la berenjena y el queso feta, precalentar el horno a 200C / 400F / Gas 6.", "Rocíe el aceite sobre la berenjena y caliente una sartén. Coloque las berenjenas en la bandeja de la parrilla y cocine cada lado durante dos minutos, luego transfiera al horno por cuatro minutos.", "Calienta una sartén seca y seca los piñones.", "Caliente una sartén limpia, agregue el aceite de oliva y fría el ajo, el perejil y las migas de pan. Agregue los piñones y las pasas doradas y cocine por otros dos minutos.", "Vierta la mezcla de migas de pan sobre las berenjenas y cubra con el queso feta desmenuzado y las hojas de menta.", "Para la ensalada de tres frijoles con huevo pasado por agua. Agregue las judías verdes a una olla con agua hirviendo. Un minuto después, agregue los frijoles amarillos y amarillos. Hervir hasta que esté cocido a su gusto, luego escurrirlos y refrescarlos en agua fría, luego escurrir nuevamente y reservar.", "En otra sartén con agua hirviendo, cocine los huevos durante cinco minutos para que estén cocidos. Deje que se enfríe lo suficiente para manipular, luego pélelas y déjelo a un lado.", "Calentar una sartén pequeña y agregar una cucharada de aceite de oliva. Una vez caliente, agregue el ajo y el chile y cocine por un minuto.", "Coloque los frijoles en un tazón de vidrio grande y termine con el resto del aceite de oliva y el vinagre, la mostaza y la ralladura de limón.", "Agregue las hierbas y las cebolletas. Sirva con los huevos pasados ​​por agua a la mitad en la parte superior.", "Para la ensalada de garbanzos, escurra los garbanzos remojados. En una fuente de agua limpia, hiérvalos por 10-15 minutos o hasta que estén cocidos. Escurrir bien.", "Caliente el aceite en una sartén y fríe con cuidado el chile, el comino y el zumaque. Agregue las especias y cocine hasta que estén aromáticas, luego agregue los garbanzos.", "Freír durante unos minutos, luego combinar con los otros ingredientes picados y el jugo de limón.", "Para el pan plano, coloque la harina y la sal en un mezclador independiente con un accesorio de gancho de masa y disuelva la levadura en un poco de agua.", "Agregue el aceite a la harina, junto con la sal y la levadura y mezcle con el gancho para masa, amasándolo durante cinco minutos. Incline la masa en un recipiente, cúbrala sin apretar y déjela probar hasta que duplique su tamaño (aproximadamente 30-60 minutos).", "Para cocinar el pan plano, caliente una sartén de hierro fundido. Divida la masa en bolas y extiéndala alrededor del grosor de una moneda de una libra. Póngalos en la sartén caliente en lotes y cocine por un par de minutos en cada lado, o hasta que toda la masa cruda se haya cocinado y el pan haya burbujeado y esté crujiente y coloreado.", "Para servir, coloca el mezze en tazones separados o en un plato grande y sírvelo con el pan plano y el yogur espeso."], "url": "www_bbc_co_uk_food_recipes_mezze_platter_with_12562", "title": "Plato Mezze con pan plano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 papas", "1 cucharada de aceite", "30g / 1oz de mantequilla", "6 cucharadas de leche", "queso rallado", "sal y pimienta negra recién molida", "tomates cherry", "cebollino", "Pasas", "rábanos", "Cebollas de primavera"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Lave las papas y séquelas. Pinche las pieles con un tenedor y coloque las papas en una bandeja para hornear. Cepíllalos con aceite.", "Hornee las papas hasta que estén suaves. Las papas medianas toman alrededor de una hora.", "Lo suficientemente frío para manejar? Luego corte las partes superiores y saque con cuidado los centros de patatas suaves. Puedes tirar las tapas (o comértelas).", "Mash los centros blandos con la mantequilla, leche y queso. Agregue una pizca de sal y pimienta, luego coloque la mezcla de nuevo en las chaquetas de papa.", "Espolvoree con queso y cocine las papas debajo de la parrilla por unos minutos hasta que estén doradas.", "Haga una nariz y bigotes con medio tomate cherry en su lugar con un palito de cóctel y cebollino escondido detrás.", "Termine de decorar con ojos de pasas, orejas de rábano y colas de cebolla de primavera."], "url": "www_bbc_co_uk_food_recipes_miceinjackets_74797", "title": "Ratones en chaquetas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miceinjackets_74797_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de pasta de curry roja tailandesa preparada", "9 muslos de pollo", "1 cucharada de polvo de curry suave", "Leche de coco 400ml / 14fl oz", "400ml / 14fl oz de caldo de pollo", "2 cucharadas de azúcar de palma (o azúcar moreno claro)", "1 cucharada de salsa de pescado", "300g / 10½oz de fideos de huevo frescos", "3 cucharadas de aceite de cacahuete", "splash salsa de soja oscura", "2 cebolletas, cortadas, en rodajas finas", "1 cebolla roja, finamente picada", "50g / 2oz de cilantro fresco picado", "2 limas, cortadas en rodajas, para servir"], "method": ["Caliente la pasta de curry en una cacerola grande a fuego medio. Agregue los muslos de pollo y cocínelos durante 3-4 minutos por todos lados, o hasta que estén cubiertos con la pasta de curry y dorados por todos lados.", "Agregue el curry en polvo, la leche de coco y el caldo de pollo a la sartén y lleve la mezcla a ebullición. Agregue el azúcar de palma y la salsa de pescado, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 20 minutos, o hasta que los muslos de pollo estén cocidos. (El pollo se cuece si los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho y no queda rastro de restos rosados).", "Hervir 200 g / 7 oz de los fideos en una olla grande de agua hirviendo durante no más de 1 minuto. Escurrir bien y dejar reposar.", "Caliente el aceite de cacahuete en un wok a fuego alto. Agregue los fideos restantes y fría por unos segundos, hasta que estén crujientes.", "Divida los fideos blanqueados entre 3 o 4 tazones para servir y salpique un poco de salsa de soja sobre cada uno. Vierta sobre el pollo y la salsa, luego espolvoree las cebolletas, la cebolla roja y el cilantro en la parte superior.", "Rompe los fideos fritos en trozos pequeños y espolvoréalos sobre cada plato de khao soi. Servir con rodajas de lima a lo largo."], "url": "www_bbc_co_uk_food_recipes_mickeys_khao_soi_noodles_24933", "title": "Fideos Khao soi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mickeys_khao_soi_noodles_24933_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla mediana", "1 diente de ajo", "100 g / 3½ oz de champiñones (opcional)", "1 x 400 g / 14 oz pueden cortar tomates", "1 x 400 g / 14 oz pueden frijoles rojos", "200 g / 7 oz de carne picada", "1 cubo de caldo de carne", "1 cucharadita de chile en polvo O ¾ cucharadita de cucharada de hojuelas de chile", "pimienta negra (opcional)", "1 taza de grano largo o arroz basmati (alrededor de 250-300 g / 9-10½ oz)"], "method": ["Pele y pique finamente la cebolla y el ajo (presione o pique el ajo lo más pequeño que pueda).", "Limpie los champiñones, si usa, con papel de cocina para eliminar la suciedad y cortar finamente.", "Abra las latas de tomates y frijoles. Escurra los frijoles a través de un colador y enjuague con agua fría.", "Coloque la carne picada en un tazón grande y agregue la cebolla y el ajo. Mezcle con un tenedor hasta que la carne esté completamente rota.", "Cubra con una tapa para microondas o una película adhesiva, dejando un área pequeña para permitir que escape el vapor.", "Cocine en el microondas a máxima potencia durante cinco minutos. Retire del microondas. Retire la película adhesiva y revuelva bien con el tenedor, rompiendo cualquier grupo de carne.", "Agregue los champiñones, el cubo desmenuzado, las hojuelas de chile o el polvo, los tomates y los frijoles a la carne y mezcle bien.", "Agregue una pequeña cantidad de agua a la lata de tomate vacía, agítela y agregue al recipiente. Sazonar con pimienta negra al gusto, si se usa.", "Vuelva a cubrir de la misma manera y cocine a máxima potencia durante cinco minutos. Retire el recipiente y revuelva bien.", "Vuelva a tapar, vuelva al microondas y cocine a máxima potencia durante 10 minutos. Retire a la mitad y revuelva bien. Deje reposar mientras cocina el arroz.", "Para cocinar el arroz, hierva el hervidor. Agregue el arroz al tamiz. Haga correr agua fría a través del arroz hasta que el agua salga clara y drene. Vierta el arroz en el otro recipiente grande apto para microondas. Llene la misma taza con agua hirviendo dos veces y vierta sobre el arroz. Revuelva una vez y colóquelo en el microondas.", "Microondas a plena potencia durante 10 minutos.", "Retire el arroz y revuelva. Regrésalo al microondas a máxima potencia por otro minuto.", "Retire el arroz y deje reposar durante 1-2 minutos y luego pruebe para comprobar que esté cocido. Si necesita cocinar un poco más agregue una pequeña cantidad de agua y cocine por otros dos minutos."], "url": "www_bbc_co_uk_food_recipes_microwave_chilli_con_83522", "title": "Microondas de chile con carne con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 camotes medianos, pelados y muy finamente cortados", "½ puerro grande, cortado en rodajas finas", "100 g / 3½oz de judías verdes congeladas", "100g / 3½oz de guisantes congelados", "4 x 75g / 2½oz de filetes de abadejo congelado, pelados y deshuesados", "1 cucharada de cebollines finamente picados", "4 cucharaditas de aceite de oliva", "½ limón, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Coloque 4 hojas cuadradas grandes de papel antigrasa sobre una superficie de trabajo. Divida la batata entre las 4 hojas, amontonándolas en el centro del papel. Divida los puerros, frijoles y guisantes congelados entre las hojas y luego cubra cada uno con un trozo de colín congelado. Sazone bien el pescado con sal y pimienta. Esparce las cebolletas sobre la parte superior y rocía con aceite de colza.", "Selle el pescado en un paquete doblando el papel por la mitad en un triángulo, luego ribetee los bordes, doblando el borde sobre sí mismo para que selle todo el camino, ¡así se verá un poco como un pastel de Cornualles!", "Coloque 2 parcelas en un plato apto para microondas. Cocine en el microondas en un entorno alto durante 10 minutos hasta que el pescado esté cocido y las parcelas se hayan expandido. Déjalos reposar durante 2 minutos antes de abrirlos.", "Para verificar que el pescado esté cocido, abra una de las parcelas y vea si el pescado está blanco y caliente al tacto. De lo contrario, vuelva a sellar y vuelva al microondas por otros 5 minutos y vuelva a verificar.", "Coloque cada paquete en un plato y ábralo en la mesa, agregando un chorrito de jugo de limón sobre el pescado justo antes de servirlo."], "url": "www_bbc_co_uk_food_recipes_microwave_fish_parcels_46241", "title": "Parcelas de pescado para microondas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 papa mediana para hornear (aproximadamente 180 g / 6 oz)", "½ parecía", "pimienta negra (opcional)", "15g / ½oz de queso cheddar bajo en grasa", "15 g / ½ oz de tocino o jamón cocido", "1 manzana comiendo", "1 x 80 g / 2¾oz de atún (en agua de manantial)", "½ x 198 g / 7 oz puede maíz dulce", "1 cucharada de mayonesa reducida en grasa", "pimienta negra (opcional)", "50g / 1¾oz de guisantes congelados", "1 x 80 g / 2¾oz puede salmón sin piel y sin espinas", "1 cucharada de crema de ensalada", "5 setas de botón", "pimienta negra (opcional)", "140g / 5oz de queso crema bajo en grasa (1 mini tina)", "1 cucharadita de puré de tomate", "1 cucharadita de jugo de limón"], "method": ["Lavar la papa y pinchar con un cuchillo afilado varias veces en todos los lados.", "Seque bien la papa con papel de cocina y colóquela en un plato apto para microondas.", "Coloque en el microondas y cocine a máxima potencia durante cuatro minutos.", "Retire la placa con guantes del horno y voltee la patata. Seca la papa y el plato y vuelve a poner en el microondas.", "Caliente a potencia máxima durante otros cuatro minutos.", "Retire la placa y deje la papa en reposo por un minuto, ya que continuará cocinando. Verifique que la papa esté suave empujando un cuchillo afilado en el centro. Vuelve al microondas por otros 30 segundos si todavía está duro en cualquier parte.", "Para el puerro, manzana, queso y tocino, lave y corte el puerro. Coloque en un tazón pequeño y muela un poco de pimienta negra, si la está usando. Cubra el recipiente con una película adhesiva, dejando un área pequeña abierta, y cocínelo al microondas a plena potencia durante dos minutos. Rallar el queso, picar el tocino y rallar la manzana en los puerros.", "Corta la papa por la mitad, saca el mullido medio y agrégale al queso y las verduras. Mezcle bien y vuelva a colocar en las \"chaquetas\". Coloque las \"chaquetas\" llenas en un plato apto para microondas y caliente durante un minuto, o hasta que el queso se haya derretido.", "Para el atún y el maíz dulce, abra las latas de atún y maíz dulce y escurra, luego hágalo en el bol con la mayonesa y mezcle con pimienta negra, si lo está usando.", "Divida la chaqueta de papa por la mitad, aplaste aproximadamente el medio con un tenedor, y cuchara sobre la cobertura.", "Para el salmón y los guisantes, coloque los guisantes en un recipiente para mezclar y vierta sobre el agua hirviendo de la tetera. Deja durante cinco minutos, luego escurre y devuelve los guisantes al tazón.", "Abra la lata y drene el salmón, luego agregue a los guisantes en el tazón.", "Mida en la crema de ensalada y mezcle bien.", "Divida la chaqueta de papa por la mitad, aplaste aproximadamente el medio con un tenedor, y cuchara sobre la cobertura.", "Para el relleno de champiñones y tomates, limpie los champiñones con un trozo de papel de cocina húmedo. Rebane y coloque en un recipiente apto para microondas y muela un poco de pimienta negra, si lo usa. Microondas a máxima potencia durante un minuto, revuelva y luego caliente durante un minuto más.", "Deje que se enfríe, luego mezcle los otros ingredientes.", "Divida la chaqueta de papa por la mitad, aplaste aproximadamente el medio con un tenedor, y cuchara sobre la cobertura."], "url": "www_bbc_co_uk_food_recipes_microwave_jacket_34010", "title": "Papas para microondas con varias capas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mantequilla 110g / 4oz, ablandada, más extra para engrasar", "Harina de auto crianza 110g / 4oz", "Azúcar en polvo de 110 g / 4 oz", "2 huevos de gallinas camperas, ligeramente golpeados", "1 limón, ralladura solamente", "100g / 3½oz de azúcar glasé", "½ limón, solo jugo"], "method": ["Engrase un recipiente apto para microondas con 20x14cm / 8x5½ pulgadas (con una pequeña tarrina de helado).", "Coloque la mantequilla, la harina y el azúcar en un tazón. Con las puntas de los dedos, frote la mantequilla en los ingredientes secos hasta que la mezcla se asemeje a pan rallado grueso.", "Agregue los huevos y la ralladura de limón y bata con un tenedor hasta que tenga una mezcla suave.", "Vierta la mezcla de la torta en el recipiente engrasado y cubra con una película adhesiva.", "Coloque en el microondas y cocine a la máxima potencia durante cuatro minutos o hasta que estén cocidos. Puede probar esto tirando de la película adhesiva y perforando la torta con un pincho y quitándola. Si la brocheta se retira, entonces la torta está lista. Coloque la torta a un lado para que se enfríe, idealmente en una rejilla de alambre.", "Para el glaseado de limón, ponga el azúcar glas y el jugo de limón en un tazón. Mezcle bien hasta que quede suave. La formación de hielo debe ser lo suficientemente delgada como para salir lentamente de la parte posterior de una cuchara. Si su limón no es muy jugoso, es posible que necesite agregar un poco de agua para obtener la consistencia adecuada.", "Para servir, coloque la torta enfriada en un plato con el lado más limpio hacia arriba. Rocíe el glaseado de limón con una cuchara. El pastel se come mejor el mismo día de su fabricación."], "url": "www_bbc_co_uk_food_recipes_microwave_lemon_drizzle_76127", "title": "Torta de llovizna con limón y microondas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]