[{"isVegetarian": false, "title": "Raised game pie with apple chutney", "url": "www_bbc_co_uk_food_recipes_game_raised_pie_with_87444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz mixed, boned, diced game meat, such as rabbit, pheasant, partridge", "300g/10½oz pork belly, minced ", "150g/5½oz dried apricots", "75g/2½oz hazelnuts, roughly chopped", "75g/2½oz unsalted pistachios", "½ tsp ground nutmeg", "2 bunches fresh sage, leaves picked", "2 leaves gelatine", "200ml/7fl oz hot chicken stock", "salt and freshly ground black pepper", "340g/12oz plain flour, plus extra for dusting ", "75g/2½oz strong white bread flour", "55g/2oz cold unsalted butter, cut into roughly 1cm/½in dice", "½ tsp salt", "75g/2½oz lard, plus extra for greasing", "1 egg yolk, beaten, to glaze", "150g/5½oz soft light brown sugar", "50g/1¾oz sultanas", "50g/1¾oz currants", "125ml/4fl oz malt vinegar", "2 eating apples, cored, roughly chopped", "3 tomatoes, roughly chopped", "1 shallot, finely chopped"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a 25cm/10in spring-form pie tin, about 8cm/3in deep, with lard. ", "For the filling, in a large bowl, mix together the game meat, minced pork belly, dried apricots, hazelnuts and pistachios. Season with salt, freshly ground black pepper and the nutmeg and mix again.", "For the hot water crust pastry, mix together the flours in a bowl, then rub in the butter lightly using your fingertips. Heat 200ml/7fl oz water, the salt and lard in a saucepan until just boiling. Pour the liquid on to the flour and mix well using a spoon. As soon as it is cool enough to handle, tip it on to a lightly floured surface and knead until you have a smooth dough.", "Cut off two-thirds of the pastry and roll it out on the floured surface using a rolling pin, then use it to line the prepared tin, leaving any excess hanging over the edge. Make sure there are no cracks in the pastry. Roll out the remaining pastry and set side.", "Spoon a quarter of the filling into the pastry case, then lay a line of fresh sage leaves on top. Repeat three times, until all the filling is used up. Press down to level the surface.", "Brush the pastry edge with beaten egg yolk, then place the reserved pastry on top. Crimp the edges to seal them, and trim off the excess pastry. Brush the top with more egg yolk and make a hole in the centre of the lid for steam to escape and for the gelatine mix to be poured in.", "Place the tin on a baking tray and bake the pie for 30 minutes. Turn the oven down to 160C/140C Fan/Gas 3 and bake for a further 1¾ hours. Transfer the pie to a wire rack and leave to cool for 10 minutes.", "Soak the gelatine in a shallow bowl of cold water for 5 minutes. Squeeze out the excess water and whisk the gelatine into the hot stock in a jug. Carefully pour the stock into the hole in the pie lid, filling any spaces. (This must be done when the pie is hot, if done when cold the jelly will sit on the top and not soak in.) Leave to set overnight before serving.", "For the chutney, heat a large frying pan until hot. Add the sugar, sultanas and currants and heat until the sugar just melting. Add the vinegar and cook until it has dissolved and is starting to caramelise. Stir in the apples, tomatoes and shallot and cook for 10 minutes, or until the apples are tender and the mixture has thickened. Remove from the heat and transfer to a sterilised jar. ", "To serve, cut the pork pie into thin slices and place it on a serving plate. Spoon the chutney alongside."]}, {"isVegetarian": false, "title": "Game sausage roll with wild mushrooms and pickled walnuts", "url": "www_bbc_co_uk_food_recipes_game_sausage_roll_with_85483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz minced pork belly", "300g/10½oz minced mixed game (such as venison, pheasant and mallard)", "2 free-range eggs, plus 1 free-range egg yolk, beaten, for egg wash", "small handful fresh thyme leaves", "50g/1¾oz cooked chestnuts, finely chopped ", "pinch allspice ", "1 x 500g/1lb 2oz packet puff pastry", "plain flour, for dusting", "salt and freshly ground black pepper", "1 tbsp butter", "100g/3½oz wild mushrooms ", "50ml/2fl oz double cream", "1 tsp Dijon mustard ", "2 pickled walnuts, drained, chopped ", "2 dandelion leaves "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the game sausage roll, preheat the oven to 180C/160C Fan/Gas 4.", "In a large bowl, mix together the minced pork and minced game. Mix in the eggs, thyme, chestnuts and allspice until well combined, then season, to taste, with salt and freshly ground black pepper. Set aside. ", "Roll out the puff pastry onto a lightly floured work surface to a rectangle measuring approximately 30x20cm/12x8in.", "Shape the mince mixture into a sausage about the same length as the longest edge of the rectangle. Place it on top of the pastry, then roll the pastry around the filling mixture, pressing the ends to seal and crimping with a fork.", "Brush the top of the sausage roll all over with the beaten egg yolk, then bake in the oven for 15-20 minutes, or until the pastry has risen and is golden-brown.", "For the garnish, heat the butter in a large frying pan over a medium heat. Add the mushrooms and fry for 4-5 minutes, or until all of the water has been released from the mushrooms and has evaporated.", "Add the double cream and bring the mixture to the boil. ", "Transfer the pan contents to a food processor and blend to a coarse purée. Add the mustard and pulse to combine. ", "To serve, slice the sausage roll into thick slices and divide the slices equally between 2 plates. Spoon the mushroom garnish alongside. Garnish the sausage roll with a few pieces of pickled walnut and a dandelion leaf."]}, {"isVegetarian": false, "title": "Game pie", "url": "www_bbc_co_uk_food_recipes_gamepie_8555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gamepie_8555_16x9.jpg", "ingredients": ["675g/1½lb mixed game meat such as pheasant, partridge, hare and rabbit, boned", "225g/8oz venison steak cut into 2.5cm/1in cubes", "2 tbsp sunflower oil", "2 red onions, peeled and sliced", "120g/4oz smoked streaky bacon, derinded and chopped", "120g/4oz chestnut mushrooms, cleaned and sliced", "1 clove garlic, peeled and crushed", "30g/1oz plain flour", "1 bay leaf", "1 orange, zest and juice", "1 tbsp redcurrant jelly", "300ml/½ pint chicken stock", "300ml/½ pint red wine", "340g/12oz puff pastry", "Salt and pepper", "beaten egg, for glazing"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat a tablespoon of the oil and brown the game and venison in batches until well browned. Keep on one side.", "Heat the rest of the oil and cook the onions for five minutes until starting to soften. Add the garlic, bacon and mushrooms and cook for another 2-3 minutes.", "Stir in the flour and cook for two minutes. Season well and stir in the bay leaf, orange zest and juice, redcurrant jelly, stock and wine. ", "Bring to the boil, add the meat and simmer gently for 40-50 minutes until the meat is tender. Cool.", "Heat the oven to 200C/400F/Gas 6.", "Put the meat mixture in a pie dish. Roll out the pastry to make a lid and attach to the dish. Decorate with the pastry trimmings and cut a steam hole in the centre. Glaze with beaten egg.", "Bake for 20 minutes and then reduce the heat to 180C/350F/Gas 4 for 30 minutes until the pastry is golden and risen and the filling is piping hot."]}, {"isVegetarian": true, "title": "Game chips", "url": "www_bbc_co_uk_food_recipes_gamechips_79105", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep-frying", "4 Shetland black potatoes, thinly sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a heavy bottomed saucepan, a third full of vegetable oil, until a breadcrumb sizzles in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.)", "Add the potato slices and cook for 1-2 minutes, until golden. Remove and drain on kitchen towels.", "Serve in a large bowl."]}, {"isVegetarian": false, "title": "Game cooked in an Indian wok (Kadhai ka shikar)", "url": "www_bbc_co_uk_food_recipes_gamecookedinanindian_92519", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 dried red chilli", "1 tsp coriander seeds", "1 tsp fennel seeds", "½ tsp cumin seeds", "¼ tsp black peppercorns", "1cm/½in cinnamon stick", "¼ tsp carom seeds or ajwain seeds", "4 tbsp vegetable or corn oil", "¼ tsp fenugreek seeds", "2 dried red chillies, each broken into 2-3 pieces", "½ tsp black onion seeds", "700g/1lb 9oz pumpkin flesh, peeled, cut into 1cm/½in cubes", "1½ tsp salt", "1 tsp red chilli powder", "½ tsp ground turmeric", "3-5 tbsp sugar", "2 tsp dried mango powder (amchoor), available from Indian supermarkets (or mango pickle from a jar)", "3 tbsp vegetable or corn oil", "¼ tsp cloves", "3 green cardamom pods, lightly crushed", "1 fresh bay leaf or cinnamon leaf", "2 medium onions, peeled, 1½ onions finely chopped, remaining ½ onion cut into 1cm/½in slices ", "2 garlic cloves, peeled, finely chopped", "2.5cm/1in piece fresh root ginger, peeled, chopped", "1 green chilli, chopped", "½ tsp red chilli powder", "½ tsp ground coriander", "½ tsp ground cumin", "3 tomatoes, 2 blended to a purée, 1 seeds removed, cut into 1cm/½in slices ", "6 grouse breasts, bones removed, cut into 1cm/½in strips ", "1 tsp salt", "½ tsp sugar", "1 tbsp chopped fresh coriander leaves", "1 lime, juice only", "few sprigs micro salad leaves or mixed salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice mixture, heat a frying pan over a medium heat. When the pan is hot, add the spice mixture ingredients and dry fry for 1-2 minutes, or until the spices are fragrant.", "Remove from the pan and transfer to a mortar and pestle. Grind the mixture to a coarse powder, then set aside.", "For the pumpkin pickle, heat the oil in a frying pan over a high heat. Add the fenugreek seeds and dried red chillies and cook until they pop. (CAUTION: Keep the pan well away from your eyes and face.)", "Add the pumpkin cubes and stir-fry for 3-4 minutes, or until softened and golden-brown. ", "Add the onion seeds, salt, chilli powder and turmeric, then reduce the heat, cover the pan with a lid and cook gently until the pumpkin has started to break down, about 8-10 minutes. ", "When the pumpkin has broken down, stir in the sugar until the mixture is glossy. Sprinkle over the dried mango powder or mango pickle and stir until well combined.", "Meanwhile, for the grouse, heat the oil in a flat-bottomed Indian wok or a large frying pan over a high heat. When the oil is hot, add the cloves, cardamom pods and bay leaf and fry for 1-2 minutes, or until they sizzle. ", "Add the 1½ finely chopped onions and stir-fry for 3-4 minutes, or until golden-brown. ", "Add the garlic, ginger and green chilli and stir-fry for a further 1-2 minutes, or until softened. ", "Stir in the chilli powder, ground coriander and ground cumin and cook for a further minute, until the spices are fragrant. ", "Add the puréed tomatoes, stir well, then bring the mixture to a simmer. Continue to simmer the mixture until the volume of sauce has reduced by half and the sauce has thickened, about 4-5 minutes. ", "When the tomato sauce has reduced, push it to one side of the wok or pan and add the slices of grouse. Stir-fry for 1-2 minutes, or until browned on all sides.  ", "Reduce the heat to medium and add the onion slices. Stir in the spice mixture, salt and sugar until all of the tomato, grouse and onion mixture is well combined, then continue to cook for 1-2 minutes, or until the onions have softened.", "Stir in the tomato slices until well combined. ", "Sprinkle over the fresh coriander leaves, then squeeze over the lime juice and remove the pan from the heat. ", "To serve, spoon the wok-cooked grouse onto each of four serving plates. Spoon the pumpkin pickle alongside each serving. Garnish each plate with a few sprigs of micro salad leaves."]}, {"isVegetarian": false, "title": "Game pie", "url": "www_bbc_co_uk_food_recipes_gamepie_93146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz plain flour", "2 tsp baking powder", "60g/2½oz unsalted butter, plus extra for greasing the pie tin", "60g/2½oz lard", "1 free-range egg yolk", "½ tsp salt", "120ml/4½fl oz water", "4 tbsp vegetable oil", "1.5kg/3lb 5oz mixed game meat (venison, pheasant, rabbit, squirrell), chopped", "500g/17½oz venison steak, chopped", "125g/4½oz streaky bacon, cut into lardons", "2 large onions, sliced", "1 stick celery, sliced", "250g/9oz chestnut mushrooms", "50g/2oz plain flour", "2 bay leaves", "2 tbsp redcurrant jelly", "500ml/17½fl oz beef stock", "500ml/17½fl oz red wine", "2 tsp chopped fresh thyme", "sea salt flakes and freshly ground black pepper", "1 packet ready-rolled puff pastry", "1 free-range egg, beaten"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the shortcrust pastry base, mix the flour, baking powder and salt together in a food processor. Add the butter and the egg yolk and pulse until the mixture resembles breadcrumbs. Gradually, with the motor running, add the water until the mixture comes together to form a dough (you may not need all of the water).  ", "Roll the pastry dough into a ball and wrap in cling film. Chill in the fridge for one hour. ", "Meanwhile, for the pie filling, heat the vegetable oil in a large pan and brown the game and venison meat in small batches (be careful not to crowd the pan). Transfer the meat to a dish and set aside, repeating the process as necessary. ", "In the same pan used to cook the meat, add the bacon and the onions. Cook for 3-4 minutes, or until the onions are translucent. Add the celery and the mushrooms and cook for a further 3-4 minutes, or until tender.", "Stir in the flour and cook for 1-2 minutes, mixing well to prevent any lumps from forming. Add the bay leaves, redcurrant jelly, stock, red wine and thyme. Season well with salt and freshly ground black pepper. ", "Bring the mixture to a simmer and cook, uncovered, for two hours, or until the meat is tender. Set aside to cool. ", "Meanwhile, preheat the oven to 180C/360F/Gas 4. Grease a 20cm/8in deep pie tin with unsalted butter.", "Roll out the shortcrust pastry so that it is big enough to line the tin. Using a rolling pin, lift the pastry and place over the pie tin. Press the pastry down on the base and around the sides to line. ", "Line the pastry with baking parchment, then fill with baking beans. Bake in the oven for 20 minutes, or until the pastry is golden around the edges. Remove from the oven and set aside to cool. Remove the beans and discard the baking parchment.", "Fill the pastry case with the cooled cooked game meat mixture. ", "For the pastry lid, roll out the sheet of puff pastry until it is large enough to fit over the pie dish. Paint around the edge of the pastry case with some of the beaten egg and place the sheet of puff pastry on top. ", "Crimp the pastry around the edges and trim off any excess. Prick the pastry several times with a fork to create holes for steam to escape. Decorate the top with the excess pieces of pastry (you can cut out leaves or other shapes). ", "Brush the pastry lid all over with the remaining beaten egg, then bake the pie in the oven for 30 minutes, or until the pastry is golden-brown and risen. ", "Set aside the pie to cool completely, then serve in thick slices, preferably with pickles."]}, {"isVegetarian": false, "title": "Game terrine", "url": "www_bbc_co_uk_food_recipes_gameterrine_14230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gameterrine_14230_16x9.jpg", "ingredients": ["selection of lean game meat, about 1kg/2¼lb in all, which could include:", "breasts of pheasant (hung about 5 days)", "breasts of pigeon", "breasts of duck or other wild fowl", "saddle and hindquarters of 1 rabbit, boned", "saddle and hindquarters of hare, boned", "lean strips of venison (from the leg or fillet)", "oil or fat, for frying ", "500g/1lb2oz sausage meat", "livers from all the game,  finely chopped", "2 handfuls fresh white breadcrumbs", "1 egg", "3 tbsp parsley,  finely chopped ", "few sprigs of thyme, leaves removed and chopped", "5-6 juniper berries, crushed in pestle and mortar", "2 cloves garlic,  finely chopped ", "splash of brandy", "splash of red wine", "salt and pepper", "300g/10½oz streaky bacon, flattened with the back of a knife"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["In a large mixing bowl combine the sausage meat and the chopped livers from the game.", "Next add the breadcrumbs, egg, parsley, thyme, juniper berries and garlic. Then the wine and brandy, season with the salt and pepper and mix everything together thoroughly, preferably with your hands.", "Cut the game meat into roughly same-size strips, about 2 fingers thick.", "In a heavy-based frying pan heat the fat or oil and fry the game pieces for 2 minutes until nicely browned.", "Line a loaf tin or ceramic terrine dish with the stretched rashers of streaky bacon. Add a layer of forcemeat followed by a layer of game meat, then a layer of forcemeat followed by another layer of game meat. (If you like, you can put the same kind of meat in each layer, ie a layer of rabbit, a layer of pigeon and then a layer of pheasant). However many layers you make (I usually go for three) be sure to finish with a layer of the forcemeat. ", "Fold the exposed strips of bacon over the top of the terrine and cover well with kitchen foil. If your terrine dish has a lid on it so much the better. ", "Place the terrine dish in a roasting tin half-filled with hot water. Cook in the oven at 160C/325F/Gas 3 for approximately 1½-2 hours. Test with a skewer to see if it is cooked, if the skewer does not come out of the terrine piping hot then it is not ready.", "For the best possible texture and easy slicing, your terrine should be pressed as it cools. Find a piece of wood or plastic that fits snugly inside the terrine dish and weigh it down with a brick or two. (Another similar size dish or loaf tin with a brick inside often does the trick, but wrap it in cling film if you're using a tin.) Leave the terrine until completely cold for several hours or overnight. ", "To serve the terrine, slice it thickly with a very sharp knife, put on a plate with a small salad of lightly dressed green leaves and a blob of good fruit chutney. Serve with hot toast."]}, {"isVegetarian": false, "title": "Gammon and chips with pineapple and greens", "url": "www_bbc_co_uk_food_recipes_gammon_and_chips_with_12644", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gammon_and_chips_with_12644_16x9.jpg", "ingredients": ["400g/14oz floury potatoes", "1 tsp olive oil, plus spray oil for frying", "salt and freshly ground black pepper", "2 slices fresh pineapple", "250g/9oz lean gammon steak, fat trimmed", "150g/5½oz Brussels sprouts, trimmed and quartered"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Scrub the potatoes well, then half-peel them, leaving some of the nutritious skin on for extra flavour. Cut into fairly thin chips – about 1cm thick – which will crisp more easily. Put into a saucepan and cover with cold water. Cover the pan, bring the water to the boil over a high heat and cook the potatoes for 3 minutes. Drain and allow to steam dry for 2-3 minutes.", "Put the olive oil into a baking tray and heat in the oven for a minute. Add the drained, dried chips to the hot oil, giving the tray a gentle shake to separate the chips. They should be in a single layer. Season with a little salt and black pepper, then bake for 30-40 minutes, turning the chips halfway through cooking to move the outer chips to the middle and vice versa so they all crisp evenly.", "Meanwhile, spray a frying pan lightly with spray oil. Heat the pan over a medium-high heat and, when hot, add the pineapple rings. Fry for 2 minutes per side, turning regularly, until the slices are golden-brown and caramelised. Set aside.", "Reduce the heat to medium, spray the gammon steak lightly with spray oil and fry in the same pan for 4-5 minutes, turning regularly, until the steak is nicely browned and cooked through. Set aside.", "Return the pan to the heat and add the Brussels sprouts. Stir-fry the sprouts for 3 minutes, adding a splash of water if necessary, until they are bright green but still retain a bit of bite. ", "Serve the gammon steaks with the pineapple on top, with the stir-fried sprouts and chips alongside."]}, {"isVegetarian": false, "title": "Gammon and pancetta fidget pie", "url": "www_bbc_co_uk_food_recipes_gammon_and_pancetta_76452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting ", "250g/9oz unsalted butter, chopped", "2 free-range egg yolks", "5 tbsp iced water", "1 free-range egg, beaten with a little milk", "3 Maris Piper potatoes, peeled and cut into 1cm/½in slices", "1 onion, finely sliced", "150g/5½oz pancetta ", "300g/10½oz gammon", "4 sage leaves, finely sliced", "oil, to taste", "2 bramley apples, peeled cored and cut into 1 cm slices", "freshly ground black pepper", "1 tbsp muscovado sugar", "250ml/9fl oz cider", "1 tbsp cornflour ", "250ml/9fl oz double cream"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "For the pastry, place all the ingredients – except the iced water - into a food processor. Pulse until you have mixture which resembles breadcrumbs. Add the water and pulse to combine. Wrap the dough in clingfilm and place in the fridge to chill until needed. ", "For the filling, blanch the potato slices in boiling salted water for a few minutes. ", "Meanwhile, gently fry the onion until soft and translucent. Then add the pancetta and fry until crisp.", "In a clean pan, fry the gammon and sage for 1-2 minutes. Remove from the pan and leave to until the gammon is cool enough to handle, then roughly chop or tear it into small pieces.", "In a shallow ovenproof dish, drizzle a little oil, add a layer of potatoes and top with some gammon. Next add a layer of the onion and pancetta mix and a layer of apples to the dish.  Now add a layer of fried onion and another layer of gammon. Finally, add another layer of the onion and pancetta mix.  Season with freshly ground black pepper and add a sprinkle of sugar. ", "Mix the cider, cornflour and double cream together. Season to taste with salt and freshly ground black pepper, then pour over the layers of filling.", "Take chilled pastry from the fridge and, on a lightly floured work surface, roll out pastry to the thickness of a pound coin. Place the pastry on top of the filling in the ovenproof dish, crimp the edges and make a hole in the centre, so that moisture can escape. ", "Brush the pastry with the beaten egg and bake for an hour, or until the pastry is crisp and a rich golden-brown."]}, {"isVegetarian": false, "title": "Gammon and pease pudding", "url": "www_bbc_co_uk_food_recipes_gammon_and_pease_pudding_56485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz dried yellow split peas", "50g/2oz butter", "1 onion, roughly chopped", "½ tsp dried thyme", "1 bay leaf", "1 tsp sea salt flakes", "½ tsp finely grated nutmeg", "1 free-range egg, beaten", "freshly ground black pepper", "1kg/2¼lb smoked or unsmoked gammon joint, tied", "1 medium onion, peeled", "4 cloves", "1 large carrot, roughly chopped", "2 celery sticks, roughly chopped", "2 bay leaves", "10 black peppercorns", "25g/1oz butter", "25g/1oz plain flour", "300ml/10fl oz ham stock (from cooking the gammon)", "1 tsp English mustard", "1 tsp wholegrain mustard", "5 tbsp single cream"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Rinse the peas in a sieve under cold running water and drain. Put the peas in a bowl and cover with hot water. Leave to stand for 20 minutes. ", "Heat 25g/1oz of the butter in a heavy-based frying pan and cook the onion, thyme and bay leaf very gently for 15 minutes, or until softened and only just beginning to colour. Stir regularly. ", "Drain the peas and add to the pan. Pour over 1 litre/1¾ pints water and bring to the boil. Reduce the heat slightly and simmer for 30-40 minutes, or until the peas soften and start falling apart. The liquid should be well reduced by this time.", "Meanwhile, put the gammon in a large lidded saucepan and cover with cold water. Bring to the boil then discard the water (be careful as it will create a lot of steam). Cut the onion in half and stud each piece with cloves. ", "Take the peas off the heat, remove the bay leaf and blend with a hand blender until a thick purée. Beat in the remaining butter nutmeg and the egg.  Season with salt and freshly ground black pepper. ", "Spoon the pea mixture into the centre of a piece of muslin. Tie the ends tightly with kitchen string just above the peas, allowing a little room for expansion.", "Tuck the pease pudding and onion into the pan beside the gammon. Add the carrot, celery, bay leaves and peppercorns. Fill the pan with enough cold water to cover the gammon and return to the hob. Bring to a simmer, cover loosely with a lid and cook for 1-1¼ hours.  ", "Remove the gammon and place on a board. Cover with foil and a couple of tea towels. Leave to stand for 10 minutes before carving. Ladle 300ml/10fl oz of the gammon stock into a heatproof jug. ", "For the mustard sauce, melt the butter in a heavy-based saucepan over a medium heat. Stir in the flour and cook for a few seconds before slowly adding the reserved stock, stirring well between each addition. Bring the sauce to a simmer, stir in the mustard and then the cream. Season, to taste, with salt and freshly ground black pepper.", "Carve the gammon into thick slices. Unwrap the pease pudding and transfer to a warmed serving bowl. Serve a spoonful of pease pudding with a slice of gammon and drizzle over the sauce. "]}, {"isVegetarian": false, "title": "Gammon, pea and orange salad", "url": "www_bbc_co_uk_food_recipes_gammonpeaandorangesa_87781", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz gammon steak", "¼ onion, sliced", "150g/5oz fresh peas", "1 orange, segmented", "2 tbsp chopped fresh mint", "1 tbsp oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gammon into a saucepan. Cover with water and bring to the boil. Reduce the heat and simmer for ten minutes, or until the gammon is completely cooked through.", "In a bowl, mix together the onion, peas, orange segments, mint and oil.", "Place the salad on a serving plate. Cut the gammon into strips and scatter over the salad."]}, {"isVegetarian": false, "title": "Game terrine", "url": "www_bbc_co_uk_food_recipes_game_terrine_50385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12-16 slices streaky bacon", "1kg/2lb 4oz game meat (such as breast of pheasant, pigeon, duck or lean venison), diced", "500g/1lb 2oz sausage meat", "200g/7oz chicken livers, finely chopped", "2 handfuls white breadcrumbs", "1 free-range egg, beaten", "3 tbsp chopped fresh parsley", "few sprigs fresh thyme, leaves picked", "2 garlic cloves, chopped", "splash brandy", "splash red wine", "2 head baby gem lettuce, leaves separated", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "few slices of toasted bead of your choice"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the game terrine, preheat the oven to 180C/350F/Gas 4.", "Line a terrine mould with cling film or aluminium foil and then lay the slices of bacon in the mould with the bacon overlapping. Keep some bacon aside for covering the top of the terrine.", "Put all the other terrine ingredients in a bowl and mix to combine.", "Fill the terrine mould with the game filling and place the remaining bacon over the top. ", "Place the terrine in a deep baking tray and pour in boiling water until it reaches two-thirds of the way up the sides of the mould. This bain marie method of cooking allows the heat of the oven to cook the terrine very gently. Bake for 1-1¼ hours.", "For the salad put the lettuce in a bowl. Mix the oil, vinegar and mustard in a small bowl to make a dressing.", "To serve, turn the terrine out and cut some slices. Just before serving pour the dressing over the salad and mix. Serve a slice of terrine on a plate with the salad and toast."]}, {"isVegetarian": false, "title": "Gammon with spiced rhubarb chutney", "url": "www_bbc_co_uk_food_recipes_gammon_with_spiced_71179", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz rhubarb", "200g/7oz soft brown sugar", "3 onions, finely chopped", "3 garlic cloves, chopped", "100g/3½oz tomatoes, chopped", "1 tbsp fresh thyme leaves", "200ml/7fl oz red wine vinegar", "1 lemon, zest and juice", "1 tsp ground ginger", "½ tsp ground cinnamon", "1 clove", "2 gammon steaks", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rhubarb, sugar and a splash of water in a pan and cook on a medium heat until the rhubarb is soft. Add the onions, garlic, tomatoes, thyme, vinegar, lemon juice and zest and the spices. Bring slowly to the boil, stirring occasionally, then simmer for about two hours, stirring frequently, until the chutney is thick.", "Cut through the fat on the gammon steaks in several places with a pair of scissors. Place the olive oil in a pan on a medium heat and when the oil is hot, fry the gammon steaks for 3-4 minutes on each side.", "Place the gammon and some of the chutney onto plates and serve with cooked green cabbage."]}, {"isVegetarian": false, "title": "Gammon with treacle bacon crust", "url": "www_bbc_co_uk_food_recipes_gammon_with_treacle_81407", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gammon_with_treacle_81407_16x9.jpg", "ingredients": ["3 tbsp treacle", "3 tbsp maple syrup", "9 rashers smoked streaky bacon", "1kg/2lb 4oz gammon joint", "750ml/1½fl oz apple juice", "1 onion, whole, peeled", "3 cloves", "2 whole star anise", "2 bay leaves", "6 peppercorns", "½ large pumpkin", "salt and freshly ground black pepper", "4 tbsp olive oil", "50g/2oz butter"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, mix together the treacle and maple syrup. Add the bacon and leave to marinade for at least four hours.", "To a large pot, add the apple juice, onion studded with the cloves, the bay, star anise and peppercorns. Finally place the gammon joint in the liquid and simmer with a lid on for 1 hour and 30 minutes.", "Meanwhile cut the pumpkin half in half again. ", "Place the pumpkin on an oven dish, skin-side down, and trickle olive oil over. Season with salt and freshly ground black pepper, add a knob of butter in each pumpkin slice and bake in the oven for 45 minutes. When cooked set aside under foil to keep warm.", "When the gammon has cooked, remove from the liquid, place on a baking tray, and then layer the treacle bacon over the top.", "Bake for a further 15 minutes, or until the bacon is crisp.", "Carve the gammon and serve with scoops of soft pumpkin flesh."]}, {"isVegetarian": true, "title": "Garam masala", "url": "www_bbc_co_uk_food_recipes_garammasala_90213", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garammasala_90213_16x9.jpg", "ingredients": ["1 tbsp cardamom seeds (if you can't buy the seeds then buy cardamom pods and shell them yourself)", "1 tsp black peppercorns", "1 tsp black cumin seeds (you can use regular cumin seeds if black aren't available)", "1 tsp whole cloves", "1/3 of a whole nutmeg (you can break a whole nutmeg by placing it on a cloth and bashing it with a meat mallet or rolling pin)", "a medium stick of cinnamon, about 5-8cm/2-3 inches, broken up into 3-4 pieces"], "serves": "Makes about 3 tablespoons", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients in a clean coffee grinder or other spice grinder and grind as finely as possible.", "Store in a tightly lidded jar, away from heat and sunlight and use as needed."]}, {"isVegetarian": true, "title": "Spicy rice", "url": "www_bbc_co_uk_food_recipes_garammasalarice_88053", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8oz/225g basmati rice", "3 tbsp vegetable oil", "1 onion, finely chopped", "2 cloves", "3 cardamom pods", "1 cinnamon stick", "½ tsp cumin seeds", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice thoroughly under cold running water and set aside.", "Heat the oil in a large pan and fry the onions until golden-brown. Remove and set aside.", "While the pan is still hot, add all the spices and cook for 1-2 minutes.", "Add the rinsed rice to the pan, along with the salt and 550ml/1 pint of water. Cover and bring to the boil. Add half of the cooked onions and simmer on a low heat for a further 10-15 minutes until the rice is tender.", "Serve hot and garnished with the remaining onions."]}, {"isVegetarian": true, "title": "Garden beetroot and Roscoff onion tart", "url": "www_bbc_co_uk_food_recipes_garden_beetroot_and_95410", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz ready-rolled puff pastry, chilled then rolled to 3mm thick ", "300g/10½oz (about 6 small) Golden or Chioggia beetroot, scrubbed clean", "pinch sea salt", "2 pinches black pepper", "20g/¾oz unsalted butter, warm", "10g unsalted butter ", "200g/7oz Rose de Roscoff onion (about 1), sliced ", "pinch sea salt ", "pinch black pepper ", "2 tsp Jerez vinegar (or sherry vinegar)", "1 egg yolk, beaten with 2 tsp water for an egg wash ", "pinch black pepper ", "1 tsp orange and thyme dried powder (optional), to make your own dry orange zest and thyme in an oven at 100C/80C Fan/Gas ¼ for 1 hour, then blitz to a powder", "4 tsp Jerez vinegar, boiled for 30 seconds ", "40ml/1½fl oz good-quality olive oil ", "pinch sea salt ", "pinch black pepper ", "150g/5½oz mixed salad leaves ", "60g/2¼oz cottage cheese "], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry base, line a baking sheet with greaseproof paper. Cut the pastry into two 13cm/5in discs using a chef's ring or a small plate and place on the lined baking sheet. Transfer to the fridge, or ideally the freezer, for at least 1 hour, to prevent the pastry being sticky.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To prepare the beetroot, cut the root off each one. Using a mandolin set to a thickness of 1mm, slice into thin discs and transfer to a bowl. Season with salt and pepper. Stir in the warm butter to ensure each slice of beetroot is evenly coated.", "To cook the beetroot, place a 9cm/3½in metal ring in a 12cm/4½in blini pan. Layer the seasoned beetroot discs inside the ring in a rosace pattern 3 layers deep. The metal ring will facilitate the building of the beetroot and keep it upright and in a perfect circle. Repeat this with the other blini pan and metal ring. Cut a circle of baking paper to the same size as the blini pan.", "Lift the metal ring off the beetroot and lay the baking paper on top of the beetroot rosace, then press the ring back over the rosace. (By placing the ring over the paper you will trap the steam trying to escape, which will keep the beetroot beautifully moist.) Cook the beetroot rosaces on a medium heat for 2 minutes, until the sides start to bubble. Some juices from the beetroot will boil in the pan – this is important as it speeds up the cooking of the beetroot in the oven and gives a nice light caramelisation to the beetroot.", "Transfer the beetroot to the oven for 10–12 minutes. Remove from the oven, leave to rest and cool completely. Lift off the rings and greaseproof paper from the cooled beetroot rosaces and turn them out on to a small plate (the coloured side, with its golden rosace pattern will be facing upwards). Set aside. ", "For the onion jam, in a saucepan over a medium heat, melt the butter and add the onion, salt and pepper. Cook for 35–40 minutes, covered with a lid, until softened but not caramelised. Stir every 5 minutes to prevent the onions from burning. Deglaze the pan with the vinegar, scraping any browned bits from the bottom with a wooden spoon, and boil for 20 seconds. Taste and adjust the seasoning if necessary. Leave to cool completely. ", "To build and cook the beetroot tarts, divide the onion jam equally between the two pastry discs and with the back of a spoon spread the onions to a thin layer leaving a gap of 1cm/½in around the edge. Lightly brush the pastry edges with a thin coating of egg wash and sprinkle them with the black pepper and powdered orange and thyme, if using. Using a palette knife, lift each golden rosace into the centre of each pastry base. Place a piece of baking parchment over each of the tarts and place a cooling rack on top of them. Transfer to the oven for 20 minutes, or until the sides of the pastry are golden-brown. The parchment paper and cooling rack on the tarts help keep the moisture in the beetroot; it will also ensure the pastry rises evenly and the beetroot slices do not curl whilst cooking. ", "To make the Jerez vinaigrette, mix all the ingredients together in a small bowl. Taste and adjust the seasoning if necessary. ", "To serve, dress the leaves with half the vinaigrette and arrange on each plate. Scatter the cottage cheese over the salad. Brush the remaining vinaigrette over the beetroot tarts to give flavour and a beautiful glaze and serve immediately. "]}, {"isVegetarian": false, "title": "Garlic-crumbed chicken", "url": "www_bbc_co_uk_food_recipes_garlic-crumbed_chicken_92638", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic-crumbed_chicken_92638_16x9.jpg", "ingredients": ["2 chicken breasts, skin removed", "20g/¾oz parsley, finely chopped", "150g/5½oz taleggio cheese, cut into strips", "75g/2½z butter", "2 garlic cloves, finely chopped", "3 rashers smoked streaky bacon, finely chopped", "two handfuls breadcrumbs", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Score the chicken breasts four times, diagonally across the top to within 2cm/¾in of the bottom.", "Finely chop the parsley and cut the taleggio into strips.", "Roll the taleggio in the parsley and then stuff the cheese into the scored gaps in the chicken breasts.", "Melt the butter in a frying pan. Add the chopped garlic and bacon to the pan and cook for three minutes.", "Add the breadcrumbs to the pan and cook for a further three minutes.", "Pour the olive oil over the chicken and season with salt and freshly ground black pepper.", "Scatter the breadcrumb mix over the chicken breasts, patting them down lightly.", "Bake in the oven for 30 minutes."]}, {"isVegetarian": false, "title": "Garlic and chilli king crab with steamed rice", "url": "www_bbc_co_uk_food_recipes_garlic_and_chilli_king_04319", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red chillies, finely sliced", "4 garlic cloves, finely sliced", "75g/2½oz caster sugar", "75ml/2½fl oz rice wine vinegar", "350g/12oz basmati rice", "2 tsp sea salt", "1 tbsp vegetable oil", "5cm/2in piece fresh ginger, finely shredded", "3 garlic cloves, chopped", "2 red bird’s-eye chillies, finely chopped", "125ml/4½fl oz tomato sauce", "75ml/2½fl oz garlic and chilli sauce (from above)", "75ml/2½fl oz hoisin sauce", "3 tbsp fish sauce", "1 tbsp caster sugar", "500g/1lb 2oz cooked crab claws, lightly crushed", "2 banana leaves, each cut in half and softened over a naked flame", "2 tbsp fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the garlic and chilli sauce, place all the ingredients in a small saucepan with two tablespoons water. Bring to the boil, then reduce the heat and simmer for a few minutes until the sugar is dissolved. Set aside to cool.", "For the steamed rice, add 500ml/18fl oz water to a pan then add the rice and salt. Cook on a low heat until all the water has disappeared. Place a lid on top and set aside for 20 minutes.", "For the chilli crab, heat a wok until hot and add the vegetable oil, ginger, garlic and chillies and stir fry for two minutes.", "Meanwhile, whisk the tomato sauce, garlic and chilli sauce, hoisin sauce and fish sauce together in a bowl. Add the sugar and 75ml/2½fl oz water and mix to combine. Add to the wok and bring to the boil.", "Add the crab then reduce the heat and simmer for 3-4 minutes until the sauce has thickened slightly and the crab is heated through.", "To serve, place a softened banana leaf on each serving plate and spoon on the crab and the rice next to it. Garnish with chopped coriander."]}, {"isVegetarian": false, "title": "Garlic and chilli prawns", "url": "www_bbc_co_uk_food_recipes_garlic_and_chilli_prawns_85728", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz whole king prawns (around 24 medium)", "150ml/5fl oz olive oil", "4 garlic cloves, very finely chopped", "3 tbsp very finely chopped parsley leaves ", "generous pinch dried red chilli flakes", "sea salt", "lemon wedges", "bread (optional)"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the prawns, leaving the tip of the tail and the head intact.", "Pour the olive oil into a large frying pan and set over a medium heat. Add the garlic, parsley, chilli flakes and a large pinch of sea salt and cook for a couple of minutes, stirring constantly, until the garlic starts to soften but isn’t taking much colour on.", "Turn up the heat and add the prawns, frying briskly on each side until they are pink and cooked through. This will take up to 3 minutes.  ", "Carefully remove the prawns from the frying pan with a slotted spoon. Serve immediately with some of the flavoured cooking oil drizzled over, with lemon wedges and perhaps some bread for dipping."]}, {"isVegetarian": false, "title": "Garlic and lemon thyme chicken with a purple sprouting broccoli, mushroom and red onion salad", "url": "www_bbc_co_uk_food_recipes_garlic_and_lemon_thyme_36885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole medium chicken, jointed into 8 pieces", "8 tbsp olive oil", "8 sprigs lemon thyme ", "4 garlic cloves, finely sliced", "500g/1lb 2oz purple sprouting broccoli, trimmed", "2 tbsp olive oil", "200g/7oz brown cup mushrooms, sliced", "1 red onion, sliced", "150g/5½oz black Spanish olives", "1 tbsp sherry vinegar", "1 tbsp red wine vinegar", "2 tbsp extra virgin olive oil", "2 balls burrata cheese, torn into pieces"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the chicken pieces, oil, lemon thyme and garlic in a large freezer bag and seal. Leave to marinade in the fridge for at least an hour and ideally overnight.", "Preheat the oven to 200C/180C Fan/Gas 6. Pour the chicken and its marinade onto a baking tray and cook for 15-20 minutes, or until cooked through.", "For the salad, heat a large saucepan of salted water and blanch the broccoli for 2 minutes, remove and drain.", "Heat a large griddle pan and drizzle the broccoli with the oil. Place on the griddle pan and cook for 2-3 minutes until charred.", "Combine the mushrooms, onion, olives and cooked broccoli in a large bowl. In a small bowl or jug whisk the two vinegars and extra virgin olive oil together to make a dressing.", "To serve, pour the dressing over the salad and toss. Place on a serving plate and top with the burrata. Serve the chicken alongside."]}, {"isVegetarian": false, "title": "Garlic and Parmesan mash", "url": "www_bbc_co_uk_food_recipes_garlic_and_parmesan_mash_80742", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_and_parmesan_mash_80742_16x9.jpg", "ingredients": ["2kg/4lb 8oz potatoes, such as Maris Piper, peeled and cut into large equal-sized chunks", "8 fat garlic cloves, bruised and slightly splintered with the flat side of a wide-bladed knife, then slipped out of their skins", "2 tsp sea salt flakes, plus extra to taste", "75g/2½oz unsalted butter, softened", "50g/1¾oz Parmesan, finely grated", "50g/1¾oz dried breadcrumbs or panko ", "50g/1¾oz unsalted butter, in blobs or teaspoons", "35g/1¼oz Parmesan, finely grated"], "serves": "Serves 6–8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the prepared potatoes and garlic into a very large pan, cover with cold water, add the salt, cover with a lid and bring to the boil over a high heat, then turn down and cook partially covered – just a crack – until very tender.", "Put a colander over a large bowl or another pan and drain the potatoes, letting the starchy water collect underneath. Do not throw this away: it is precious liquid (see recipe tip). ", "Add the butter to the hot, emptied-out potato pan, and let it start melting, then tip in the drained potatoes and garlic. Dip a measuring cup into the cooking liquid, add about 125ml/4fl oz and mash using your chosen method (see recipe tip). You may want to add more of the cooking liquid. I never add less than 250ml/9fl oz, as I like this to be as smooth and creamy as possible, though I’m aware many people prefer a more solid mash. Stir the Parmesan in by hand and check for seasoning before transferring to a warm bowl. ", "If you are making this in advance, butter a small roasting tin or ovenproof dish, measuring approx. 30x25cm/12x10in, and fill with the mashed potatoes, smoothing down the top. Leave to cool, cover and place in the fridge for up to 3 days. ", "On reheating, remove from the fridge and allow to come to room temperature, which will take an hour or two, depending on the weather.", " Preheat the oven to 200C/180C Fan/Gas 6 and make a crumbly topping by rubbing the breadcrumbs together with the butter and Parmesan, then dot and sprinkle on top. Cook for about 30 minutes, or until piping hot all the way through. Loosely cover the dish with foil if the topping is getting too brown at any stage."]}, {"isVegetarian": false, "title": "Garlic-butter chicken with asparagus, peas, broad beans and dauphinoise potatoes", "url": "www_bbc_co_uk_food_recipes_garlic_butter_chicken_37133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole bulb garlic", "1 tbsp olive oil", "1 whole chicken", "600ml/20fl oz double cream", "salt and freshly ground black pepper", "400ml/14fl oz chicken gravy, to serve", "1.2kg/2lb 12oz King Edward potatoes, thinly sliced", "25g/1oz butter", "300ml/10fl oz double cream ", "300ml/10fl oz full-fat milk ", "1 bunch asparagus, trimmed into 3 lengths", "200g/7oz fresh peas, podded", "500g/1lb 2oz fresh broad beans, podded", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 garlic clove, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Put the garlic on a piece of kitchen foil and drizzle with the oil. Seal the foil into a parcel and roast for 30-40 minutes.", "Meanwhile, put the chicken in a deep roasting tin and season with salt and pepper. Roast for 40-60 minutes. ", "While the chicken roasts, put the cream in a food processor with a whisk/paddle attachment and blend until it turns to butter, leaving the whey at the bottom. Spoon the solid part into a bowl, add a teaspoon of salt and mix. Squeeze the garlic cloves into the cream and mix again.", "Smear the chicken with the garlicky cream and return it to the oven for 30-40 minutes, depending on the size of the bird. Check it is cooked through using a meat thermometer, or check that the juices run clear when the deepest part of the meat is pierced with a skewer.", "Meanwhile, for the dauphinoise potatoes, preheat an oven to 170C/150C Fan/Gas 3½. Wash the potatoes in cold water to remove any excess starch. Drain well and pat dry.", "Grease an ovenproof dish with 1 teaspoon of the butter and layer the potatoes in the dish, overlapping a little, until it is just full. Season with salt and pepper between each layer.", "Put the cream and milk in a bowl, season with salt and pepper and whisk to combine. Pour this over the potatoes. Dot with the remaining butter, then cover tightly with kitchen foil and bake for 1 hour. Remove the foil and bake a further 30 minutes, or until golden-brown and tender.", "Meanwhile, blanch the asparagus, peas and broad beans in a large saucepan of lightly salted boiling water. Drain and plunge into iced water to keep the colour. Melt the butter in a medium pan. Add the shallot and garlic and fry for 1-2 minutes. Add the blanched vegetables and cook for 2-3 minutes.", "To serve, carve the roast chicken and place on a serving plate. Heat the gravy until hot through. Scoop a spoonful of the potatoes on to each plate, add the asparagus, peas and broad beans, and serve with the chicken and gravy."]}, {"isVegetarian": false, "title": "Garlic mushrooms and cured ham on toasted brioche", "url": "www_bbc_co_uk_food_recipes_garlic_mushrooms_and_09096", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_mushrooms_and_09096_16x9.jpg", "ingredients": ["1 tbsp oil", "6 slices dry-cured ham, cut in half", "50g/1¾oz butter", "6 thick slices brioche", "4 fat garlic cloves, crushed", "250g/9oz chestnut mushrooms, sliced", "100g/ 3½oz shiitake mushrooms, halved if large", "75g/2¾oz oyster mushrooms, halved if large", "150g/5½oz enoki mushrooms ", "2 tbsp full-fat crème fraîche", "chopped fresh parsley, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Add the oil to a large, heavy-based frying pan and fry the ham over a high heat for 1-2 minutes until crisp. You may need to do this in two batches to avoid overcrowding the pan. Remove and set aside.", "Turn the heat down to medium and melt about a third of the butter in the pan. Fry the brioche slices until golden-brown on each side, you may have to do this in batches. Remove and set aside. ", "Melt another third of the butter in the pan, add the garlic, chestnut and shiitake mushrooms and fry over a high heat for 2–3 minutes. Lower the heat, cover with a lid and cook for a further 2 minutes. Remove the lid and fry over a high heat until tender and golden-brown, tossing until dry and any liquid has evaporated. ", "Add the remaining butter, along with the oyster and enoki mushrooms, and fry for 1–2 minutes until golden-brown. Season well with salt and pepper. Stir in the crème fraîche.", "Place a slice of toasted brioche on each plate, spoon over some of the garlic mushrooms, followed by a slice of fried ham and a sprinkling of chopped parsley. Serve immediately."]}, {"isVegetarian": true, "title": "Garlic mushroom frittata", "url": "www_bbc_co_uk_food_recipes_garlic_mushroom_frittata_50129", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_mushroom_frittata_50129_16x9.jpg", "ingredients": ["low-calorie cooking spray", "250g/9oz chestnut mushrooms, sliced", "1 small garlic clove, crushed", "1 tbsp thinly sliced fresh chives", "4 large free-range eggs, beaten", "freshly ground black pepper", "1 Little Gem lettuce, leaves separated", "100g/3½oz cherry tomatoes, halved", "1/3 cucumber, cut into chunks"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a small, flame-proof frying pan with oil and place over a high heat. (The base of the pan shouldn’t be wider than about 18cm/7in.) Stir-fry the mushrooms in three batches for 2-3 minutes, or until softened and lightly browned. Tip the cooked mushrooms into a sieve over a bowl to catch any juices – you don’t want the mushrooms to become soggy.", "Return all the mushrooms to the pan and stir in the garlic and chives, and a pinch of ground black pepper. Cook for a further minute, then reduce the heat to low. ", "Preheat the grill to its hottest setting. Pour the eggs over the mushrooms. Cook for five minutes, or until almost set.", "Place the pan under the grill for 3-4 minutes, or until set.", "Combine the salad ingredients in a bowl.", "Remove from the grill and loosen the sides of the frittata with a round-bladed knife.Turn out onto a board and cut into wedges. Serve hot or cold with the salad."]}]