[{"isVegetarian": false, "title": "Bridie pies", "url": "www_bbc_co_uk_food_recipes_piesbridie_84423", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil, plus extra for greasing", "1 onion, finely chopped", "3 sprigs fresh thyme, leaves only, finely chopped", "350g/12oz lean beef mince ", "1 tsp mustard powder ", "80ml/3fl oz beef stock", "salt and freshly ground black pepper", "500g/1lb 2oz ready-made puff pastry ", "2 free-range eggs, beaten"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/445F/Gas 8.", "Heat a frying pan until hot and add the olive oil, onion and thyme and fry, for 2-3 minutes, until the onions are golden and softened.", "Place the beef mince into a bowl with the mustard powder and beef stock. Add the fried onion mixture and season well with salt and freshly ground black pepper. Mix well to combine.", "Roll out the puff pastry on a clean, floured surface to 5mm/¼in thick and cut out four 15cm/6in diameter circles.", "Place a spoonful of the mince mixture into the centre of each pastry circle. Brush the outer edge of each pastry circle with the beaten eggs. Fold over the pastry in half, to create a pasty shape and crimp the edges together well to seal.", "Brush the pastry with the beaten eggs and season with salt and freshly ground black pepper.", "Place onto a lightly greased baking tray and place into the oven to bake for 15 minutes.", "Reduce the heat of the oven to 180C/385F/Gas 4 and cook for 45 minutes, or until golden brown and completely cooked through.", "These pies can be served hot, warm or cold."]}, {"isVegetarian": false, "title": "Pigeon Wellington with glazed shallots", "url": "www_bbc_co_uk_food_recipes_pigeon_wellington_with_25328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 squab pigeon", "1 tbsp olive oil", "225g/8oz ready-made puff pastry", "1 free-range egg, beaten for egg wash", "1 tbsp olive oil", "1 carrot, chopped", "1 small onion, chopped", "few parsley stalks", "200ml/7fl oz chicken stock", "200ml/7fl oz port", "200ml/7fl oz red wine", "50g/1¾oz sausage meat", "1 tsp oregano", "1 tsp tarragon", "1 tsp picked thyme leaves", "10 pistachios, shelled and chopped", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "100g/3½oz shallots, peeled", "chicken stock, to cover", "few sprigs thyme", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Remove the breasts, legs, wings and giblets from the pigeon. Remove the meat from the legs and thighs and chop along with the giblets to use for the stuffing.", "For the sauce, heat the olive oil in a large pan. Add the pigeon bones along with the carrot, onion and parsley stalks. When brown, add the stock, port and red wine. Bring back to the boil and then reduce to a simmer. Continue to cook until the liquid has reduced to a sticky sauce.", "In frying pan, heat a little olive oil and sear the pigeon breasts, skin-side down, until the skin is golden-brown. Remove from the heat and set aside.", "Next make the stuffing, mix the sausage meat with the herbs, pistachios, pigeon leg and thigh meat and giblets.  Season to taste with salt and freshly ground black pepper. Sandwich the stuffing between the seared pigeon breasts. Set aside.", "Meanwhile for the glazed shallots, melt the butter in a small ovenproof frying pan. Add the shallots and fry until they begin to caramelise. Cover with chicken stock, add the thyme sprigs and season with salt and pepper. Cover with a circle of greaseproof paper and cook in the oven for 30 minutes, or until tender.", "Roll out the pastry to the thickness of a pound coin and large enough to wrap the pigeon - you might not need it all. Wrap the squab parcel in the pastry and seal the edges. Place on a baking tray and brush with egg wash. Transfer to the oven for 30 minutes, or until the pastry is golden-brown.", "When the shallots are cooked, remove them from the cooking liquid and set aside. Add the reduced sauce to the shallot pan and heat again to reduce. Return the cooked shallots to the pan and heat through.", "When cooked remove the squab parcel from the oven and set aside to rest for a few minutes.", "Serve the Wellington in slices with the glazed shallots."]}, {"isVegetarian": false, "title": "Pigeons baked in a salt pastry crust with cabbage and mushroom fricassée", "url": "www_bbc_co_uk_food_recipes_pigeonsbakedinasaltp_93491", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 squab pigeons, cleaned, with livers", "40g/1½oz clarified butter, plus extra to serve", "1kg/2lb 3oz strong white flour, plus extra for dusting", "600g/1lb 5oz fine table salt", "9 free-range egg whites", "300ml/10½fl oz water", "8 cloves", "2 free-range egg yolks", "1 tbsp milk", "pinch caster sugar", "1 handful rock salt", "20g/1oz unsalted butter", "4 shallots, finely chopped", "100g/3½ button mushrooms, finely sliced", "1 tbsp olive oil", "reserved pigeon squab necks and wings (see above)", "4 tbsp dry Madeira wine", "100ml/3½fl oz brown chicken stock", "salt and freshly ground black pepper", "2 pointed cabbages, quartered", "30g/1½oz unsalted butter", "½ banana shallot or ¼ onion, peeled, chopped", "1 garlic clove, peeled, puréed", "400g/14oz mixed wild mushrooms (pied de mouton, girolle, chanterelle and trompette de la mort)", "100ml/3½fl oz dry white wine", "10g/½oz fresh flat-leaf parsley leaves, roughly chopped", "15ml/1fl oz lemon juice", "4 pinches sea salt", "4 pinches freshly ground black pepper", "Special equipment: kitchen string, electric mixer with a dough hook"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the squab pigeons, singe off any remaining feathers or stubble by turning the pigeons over an open flame (use long heatproof tongs to do this). Chop off the neck bones and wings (trimming as close to the breast as possible) and reserve for making the sauce. Remove the wishbones to make carving easier.", "Heat the clarified butter in a pan and sear the pigeons for 2-3 minutes on all sides, or until golden-brown all over. Set aside. You do not need to season the birds at this stage as the salt crust pastry will season the meat as it cooks.", "For the salt pastry crust, combine the flour, salt, egg whites and water in an electric mixer fitted with a dough hook. Mix on a slow speed for 1-2 minutes, then scrape down the sides with a spatula. Turn the mixer back on and mix for 5-7 more minutes, or until the dough starts to come away from the sides of the bowl. ", "Knead lightly with your hands, then divide the dough into four equal pieces and wrap separately in cling film. Chill in the fridge for 20 minutes.  ", "After 20 minutes, remove the dough from the fridge. On a floured work surface, roll each piece of dough to a thickness of 5mm and a diameter of about 28cm/11in. Using a small knife, cut out a circle from each piece of dough measuring 23cm/9in in diameter and set aside.", "Gather all of the pastry trimmings and roll out to a sheet of 5mm thickness. Cut out eight pigeon wing-shaped pieces and set aside on parchment paper. ", "Roll up the pastry trimmings and divide into 4 equal pieces. Mould each piece into a round squab 'head', pinching one end to form a 'beak'. Press 2 cloves into each 'head' for eyes, then set aside on parchment paper.", "Place a pigeon, breast-side down, into the middle of each circle of pastry and bring the edges up to wrap up the pigeon completely. Pinch the edges together to seal, making sure there are no gaps. ", "In a small bowl, beat together the egg yolks, milk and caster sugar for the eggwash. Brush the pastry 'wings' with some of the eggwash and attach 2 onto the sides of each wrapped pigeon. Brush the base of the pastry 'heads' and press firmly onto the wrapped pigeon. ", "Brush the completed pigeons all over with the remaining eggwash, except for the bases. Sprinkle rock salt over the breast, place the pigeons on a baking tray lined with foil and chill in the fridge until ready to bake. ", "For the sauce, melt the butter in a pan until foaming and gently fry the shallots for 2-3 minutes, or until softened but not coloured. Add the mushrooms during the last minute of cooking.", "Meanwhile, heat the olive oil in a separate pan and sear the reserved pigeon necks and wings for 3-4 minutes, until golden-brown all over. Add the Madeira to the pan, scraping up any browned bits from the bottom of the pan to deglaze, then add the contents of the pan to the shallots and mushrooms and the brown chicken stock, bring to the boil and simmer for 10 minutes ", "Strain through a fine conical sieve, pressing down with a ladle to extract as much flavour as possible. Season, to taste, with salt and freshly ground black pepper. Reheat the sauce to order and serve in a gravy boat just before serving.", "Preheat the oven to 220C/425F/Gas 7.", "Bake the pigeons in the oven for 20-22 minutes (for medium; cook for 18 minutes for medium rare or 12 minutes for rare). Remove from the oven and set aside to rest for 5 minutes. The salt crust pastry is not just for visual effect, but also greatly enhances the taste and texture; the juices and flavour are sealed in and the slow build-up of heat keeps the flesh moist and tender.", "For the garnish, bring a pan of water to the boil and place a steamer insert over the top. Add the cabbage to the steamer and steam for 2-3 minutes, or until just tender. Cut the cabbage into strips and place into a small serving bowl. ", "Heat the butter in a pan over a medium heat until foaming, then fry the shallots and garlic for 30 seconds. Increase the heat to high, then add the pied de mouton and cook for one minute. Add the white wine and cook for one minute, then add the girolles and cook for a further minute. Add the trompettes de la mort and herbs and stir well, then squeeze in the lemon juice and season, to taste, with salt and freshly ground black pepper. Spoon into a small serving bowl.", "Present the baked pigeons, brushed with melted butter, on a large serving board with the bowls of cabbage and mushrooms on either side. To serve, first remove the pastry 'head', then slice open the salt crust to reveal the pigeon. Place a long fork inside the pigeon and lift it out onto the carving board, leaving behind the crust. Cut off the trussing string and serve the pigeon on a plate, allowing guests to help themselves to the sauce, cabbage and mushroom fricassee accompaniments."]}, {"isVegetarian": false, "title": "Pigs in blankets", "url": "www_bbc_co_uk_food_recipes_pigs_in_blankets_63316", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pigs_in_blankets_63316_16x9.jpg", "ingredients": ["8 thin slices streaky bacon", "16 chipolata sausages", "cocktail sticks, to secure the bacon"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the bacon on a chopping board, then using the side of the knife, stretch and flatten the bacon until about half as long again.", "Cut each strip of bacon in half across, then wrap each piece around a chipolata, securing with cocktail sticks.", "Place in a roasting tray and roast for 15 minutes until golden-brown and cooked through."]}, {"isVegetarian": true, "title": "Pilaf with ginger, chilli and peas", "url": "www_bbc_co_uk_food_recipes_pilafwithgingerchill_89131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "1 red chilli, finely chopped", "¼ tsp ground turmeric", "salt and freshly ground black pepper ", "300g/10½oz basmati rice", "600ml/1 pint vegetable stock", "85g/3oz fresh peas, out of their pods", "25g/1oz butter", "25g/1oz fresh root ginger"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil in a frying pan, add the onion and chilli and fry for 1-2 minutes, or until softened. Add the ground turmeric, salt and freshly ground black pepper and fry for another minute. ", "Spoon the onions and chilli mixture into a deep ovenproof dish, add the rice, pour over the stock and stir well. Cover with aluminium foil and place into the oven to bake for ten minutes, or until all the water has been absorbed into the rice and the rice is tender. ", "Blanch the peas in a pan of boiling salted water for 2-3 minutes, then drain and add to the rice along with the butter. Stir until the butter is melted and the mixture is well combined.", "Grate the root ginger into a clean tea towel and then squeeze the ginger juice into the rice. Discard the ginger flesh. Stir well. ", "To serve, spoon the pilaf onto a serving plate."]}, {"isVegetarian": false, "title": "Pig's head and offal ravioli with smoked aubergine purée and peperonata", "url": "www_bbc_co_uk_food_recipes_pigs_head_and_offal_23668", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["generous pinch salt ", "2 tbsp black peppercorns, crushed", "250ml/8¼fl oz white wine vinegar", "2 cinnamon sticks", "1 pig’s head (available from good butchers), hairs scorched off using a chefs’ blow torch", "1 ox-tongue (available from good butchers)", "2 bay leaves", "4 cinnamon sticks", "4 star anise", "generous pinch salt", "1-2 tbsp black peppercorns, crushed", "150g/5¼oz caster sugar", "250ml/8¼fl oz white wine vinegar", "400g/14¼oz plain flour", "½ tsp salt", "4 free-range eggs, beaten", "1-2 tbsp olive oil", "1 small red onion, peeled, finely diced", "small handful parsley or basil, shredded", "1 free-range egg, beaten, for egg wash", "1 onion, peeled, sliced", "1 red pepper, de-seeded, sliced", "1 yellow pepper, de-seeded, sliced", "2 garlic cloves, peeled, crushed", "6 aubergines", "1 tbsp olive oil", "½ tsp cumin seeds", "½ tsp dried thyme leaves", "6 ripe tomatoes, diced", "1 sweet potato, peeled, diced", "1 small cauliflower, cut into small florets", "½ green cabbage, shredded", "1 tbsp finely chopped fresh basil", "6 tbsp olive oil", "2 tbsp white wine vinegar", "1- 2 tsp Dijon mustard", "1 garlic clove, peeled and crushed", "salt and freshly ground black pepper", "2 cooked pig’s ears (from the head, see above), finely shredded", "plain flour, for dusting", "salt and freshly ground black pepper", "vegetable oil, for deep-frying"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the brine, place the salt, pepper, white wine vinegar and cinnamon sticks into a large pan of cold water (use a pan that's deep enough to cover the pig's head). ", "For the pig’s head and offal, add the pig’s head to the brine and set aside for two hours to soak.", "Remove the pig’s head from the brine and transfer to a fresh pan of boiling water. Add the ox tongue, bay leaves, cinnamon sticks, star anise, salt, peppercorns, sugar and white wine vinegar and return to the boil. Reduce the heat until the mixture is simmering and simmer for six hours, or until the meat from the head just begins to fall from the bone.", "Remove the pig’s head and ox tongue from the pan and set aside to cool. When the ox tongue is cool enough to handle, peel the skin from it and set aside to cool fully. Once cool, finely shred the ox tongue. ", "Once the pig’s head has cooled, pick all the meat from it, discarding the fat. ", "Remove the pig’s ears and finely slice the meat. Set aside to use as a garnish. ", "For the ravioli, tip the flour onto a clean surface (or into a large bowl) and add the salt. Beat together the eggs and oil.", "Make a well in the centre of the flour and add the beaten egg and oil mixture in a thin stream, mixing more of the flour into the wet ingredients as you add them until the mixture comes together as a dough. (You may not need to add all of the eggs and olive oil mixture.)", "Knead the pasta dough for 10 minutes, or until smooth and elastic.  Wrap in cling film and chill in the fridge for at least 30 minutes.", "Turn out the chilled pasta dough onto a lightly floured work surface. Flour the rollers on your pasta machine. ", "Roll the pasta out using the pasta machine. Start by setting the machine to its widest setting (usually the lowest number) and pass the pasta through the rollers, each time adjusting the machine to its next-widest setting, until it has reached the required thickness. ", "For the ravioli filling, mix the shredded ox tongue with the meat from the pig’s head (except the ears). Mix in the chopped parsley (or basil) and onion until well combined, then season, to taste, with salt and freshly ground black pepper.", "Cut 10cm/4in rounds from the rolled pasta dough using a pastry cutter. Place a spoonful of the filling mixture into the centre of half of the pasta rounds. Brush the edges with egg wash, then place one of the empty pasta rounds on top, pressing the edges together to seal thoroughly and pushing out any air bubbles.. ", "Repeat the process with the remaining ravioli and the remaining filling mixture. Sprinkle the ravioli with flour and separate the layers of ravioli using baking parchment to prevent them from sticking, then chill in the fridge until needed.", "For the peperonata, heat two tablespoons of the olive oil in a pan over a medium heat. Add the onion, red and yellow peppers and garlic, then season, to taste, with salt and freshly ground black pepper and cook for 18-20 minutes, or until softened. Keep warm.", "For the aubergine purée, using tongs, hold each aubergines directly over a gas burner, turning until the skin has blistered and the aubergine is soft to the touch. (Alternatively, place the aubergines under a hot grill, turning them occasionally.) Set aside to cool slightly, then peel off the skin. Roughly chop the flesh. Repeat the process with the remaining aubergines.", "Heat one tablespoon of the olive oil in a pan over a medium heat. Add the cumin seeds and thyme and fry for one minute, or until fragrant. ", "Add the chopped tomatoes and continue to cook for a further 6-8 minutes. ", "Stir in the chopped aubergine pulp. Season, to taste, with salt and freshly ground black pepper and continue to cook for a further 5-6 minutes. ", "Transfer the mixture to a food processor and blend until smooth.  Return the blended mixture to the pan for a further few minutes and cook over a medium heat until it has dried out. Set aside and keep warm.", "For the vegetables à la Grècque, boil the sweet potato in a pan of salted water for 6-8 minutes, or until tender. Remove from the pan using a slotted spoon and transfer to a bowl. ", "Add the cauliflower florets to the pan and cook for 6-8 minutes until tender. Remove from the pan using a slotted spoon and add to the bowl.", "Add the shredded cabbage to the pan and blanch for 2-3 minutes, then drain well. Add the cabbage to the bowl containing the sweet potato and cauliflower. Set aside and keep warm.", "Heat a deep-fat fryer to 180C. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Sprinkle some flour onto a plate. Dredge the pig’s ear slices in the flour, shaking off any excess. Deep-fry the coated pig’s ears in the hot oil for 2-3 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper. Set aside and keep warm.", "Just before serving, bring a pan of salted water to the boil and cook the ravioli for 3-4 minutes, or until al dente.", "For the vinaigrette, whisk all of the vinaigrette ingredients together until well combined. Spoon three-quarters of the vinaigrette into the bowl containing the vegetables à la Grècque, add the basil and mix until the vegetables are coated in the vinaigrette. ", "To serve, spoon some of the aubergine purée into the centre of each of six serving plates and drag the spoon to create a swirl. Place a large spoonful of the peperonata into the centre of each plate. Arrange the ravioli on top. Spoon the vegetables à la Grècque alongside, then drizzle the ravioli with the remaining vinaigrette. Garnish with some of the deep-fried pig’s ears."]}, {"isVegetarian": true, "title": "Pilau rice", "url": "www_bbc_co_uk_food_recipes_pilau_rice_81725", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pilau_rice_81725_16x9.jpg", "ingredients": ["½ tsp coriander seeds", "6 cardamom pods", "1 tsp cumin seeds", "8 cloves", "1 cinnamon stick", "2 bay leaves", "75g/2½oz butter", "1 small onion, finely chopped", "1 garlic clove, finely chopped", "½ tsp ground turmeric", "½ tsp black mustard seeds", "300g/10½oz basmati rice, rinsed and drained", "500ml/18fl oz chicken or vegetable stock, fresh or made from 1 stock cube", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a pestle and mortar, pound the coriander seeds into a coarse powder. Add the cardamom pods and grind until the husks split and the seeds are lightly crushed. Add the cumin, cloves, cinnamon and bay and pound very lightly for a few seconds, to mix.", "Melt half the butter in a sauté pan or wide-based saucepan over a medium heat. Fry the onion and garlic for 5 minutes, or until softened, stirring regularly. Sprinkle in the turmeric and mustard seeds, plus all the ingredients from the pestle and mortar. Fry gently for 2 minutes, stirring.", "Mix in the rice to coat it in the buttery spices. Add the stock and a good pinch of black pepper. Add a pinch of salt if needed (stock from a cube will already contain salt). Stir well and bring to the boil. Give a final stir then cover the pan with a tight-fitting lid. Reduce the heat to its lowest setting and cook for 15 minutes.", "When the rice is cooked, cut the rest of the butter into small pieces. Remove the pan lid and dot the butter over the hot rice. Leave to melt for a few seconds, then quickly fluff up the rice using a fork, taking care not to break up the grains.", "Replace the lid and leave to stand for 5 minutes before serving. (Warn your guests not to eat the cardamom, cinnamon or any whole cloves.)"]}, {"isVegetarian": true, "title": "Pimms lollies", "url": "www_bbc_co_uk_food_recipes_pimms_lollies_94967", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pimms_lollies_94967_16x9.jpg", "ingredients": ["300ml/½ pint Pimms, or similar 'fruit cup'", "850ml/1½ pints lemonade", "handful fresh strawberries, hulled, halved", "few sprigs fresh mint, leaves only", "1 orange, zest only"], "serves": "Makes 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the Pimms and lemonade together in a large jug.", "Place a couple of strawberry halves, a few mint leaves and a little orange zest into each lolly mould. ", "Pour the Pimm mixture into each ice lolly mould until three-quarters full. Insert the lolly stick and lid and freeze for 2-3 hours, or until frozen solid.", "Alternatively, you can use large shot glasses as moulds: place the strawberry, mint and orange zest into the glass and fill with the Pimms mixture. Freeze for one hour, or until the lollies are partially frozen, then insert the lolly sticks and continue to freeze until completely frozen.", "To remove the lollies, dip the moulds briefly in hot water and carefully remove the lollies."]}, {"isVegetarian": true, "title": "Pimm’s", "url": "www_bbc_co_uk_food_recipes_pimms_84859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/26fl oz lemonade", "250ml/9fl oz Pimm’s", "1 cucumber, roughly chopped", "200g/7oz strawberries, hulled and halved ", "handful borage leaves and flowers", "handful mint leaves", "handful lemon balm", "1 lemon, sliced", "1 orange, sliced", "ice "], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place all the ingredients, except the ice, in a large bowl and mix. Allow to stand for 1 hour before serving.", "Pour into serving glasses, topped with ice, for a delicious summer drink."]}, {"isVegetarian": true, "title": "Pina colada", "url": "www_bbc_co_uk_food_recipes_pinacolada_86525", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35ml/1¼fl oz gold rum ", "1 tbsp coconut-flavoured rum", "50ml/2fl oz coconut cream ", "50ml/2fl oz pineapple juice ", "3-4 pineapple chunks", "2 pineapple leaves ", "1 maraschino cherry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the two rums, the coconut cream, pineapple juice and chunks of pineapple into a blender and blend until smooth.", "To serve, pour into a cocktail glass and garnish with pineapple leaves and a maraschino cherry."]}, {"isVegetarian": false, "title": "Pineapple rice", "url": "www_bbc_co_uk_food_recipes_pineapple_rice_29541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["long grain rice measured to the 400ml/14fl oz level in a measuring jug and cooked according to packet instructions", "2 tbsp groundnut or peanut oil", "225g/8oz minced pork", "2 tbsp light soy sauce", "salt and freshly ground black pepper ", "2 tbsp finely chopped fresh ginger ", "3 tbsp finely chopped spring onions", "1 tbsp sesame oil", "1 small pineapple (approximately 225g/8oz), peeled, cored and chopped into 1cm/½in pieces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Allow the cooked rice to cool thoroughly by spreading it out on a baking sheet. The rice must be cold before you use it in this recipe. ", "Heat a wok over high heat until it is hot. Add the oil, and when it is very hot and slightly smoking, add the pork and stir fry for two minutes. Add the soy sauce, salt, pepper, ginger and spring onions and continue to stir-fry for two minutes. ", "Add the rice, mix well and stir fry the mixture for another five minutes until the rice is heated through and well mixed. ", "Stir in the sesame oil, add the pineapple pieces and stir fry until the pineapple is heated through, but not cooked. Serve at once."]}, {"isVegetarian": false, "title": "Pineapple, prawn and scallop curry", "url": "www_bbc_co_uk_food_recipes_pinapple_prawn_and_02199", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp cumin seeds, lightly toasted", "2 tsp coriander seeds, lightly toasted", "1 lemongrass stalk, hard outer leaves removed, chopped", "1 tbsp chopped galangal", "1 lime (preferably kaffir), grated zest and juice only", "1 tbsp finely chopped garlic ", "1 large shallot, chopped", "3 tbsp chopped coriander root (alternatively use coriander stems)", "1 tbsp chopped fresh turmeric", "1 tsp ground turmeric", "1 tbsp chopped fresh ginger", "4 red Thai or bird’s-eye chillies", "2 tsp kaapi (dried shrimp paste)", "1 tbsp medium curry powder", "2 tbsp vegetable oil", "2 tbsp groundnut or vegetable oil", "3 tbsp Laotian curry paste (from above)", "300g/10oz raw prawns, peeled, cleaned and deveined", "200g/7oz scallops, coral removed", "2 tbsp fish sauce", "1 tbsp sugar", "4 kaffir lime leaves", "500ml/18fl oz coconut milk", "1 small pineapple, peeled and diced", "4 spring onions, cut into 2.5cm/1in pieces", "handful of holy basil or ordinary basil leaves, plus extra to garnish", "250g/9oz cherry tomatoes, halved", "1 cucumber, sliced", "1 bunch spring onions, finely sliced", "1 red chilli, sliced into long strips", "1 iceberg lettuce, sliced", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Laotian curry paste, blend or pound all the ingredients together with a small quantity of water to make a smooth paste. It can be kept, tightly covered, in the fridge for 3-4 days or frozen in ice cube trays. ", "For the pineapple, prawn and scallop curry, heat the oil in a wok and gently fry the curry paste for a minute until fragrant. Add the prawns and scallops. Cook for 2-3 minutes, then add the fish sauce, sugar and kaffir lime leaves. Stir for a minute. Use a slotted spoon to remove the seafood from the wok and keep warm.", "Add the coconut milk to the wok and bring to the boil, then simmer for 2-3 minutes. Add the pineapple and simmer for five minutes. Return the seafood to the wok and add the spring onions and basil leaves. Cook, stirring, for a couple of minutes, then transfer to serving bowls. ", "For the salad, place all the ingredients in a large bowl and gently toss.", "To serve, garnish each bowl of curry with a sprig of basil and serve with the salad."]}, {"isVegetarian": true, "title": "Pineapple tarte tatin with rum syrup", "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_54400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz demerara sugar", "8 slices tinned pineapple, reserve the tinned syrup", "320g/11½oz ready rolled puff pastry", "1 free-range egg, beaten", "4 tbsp maple syrup", "4 tsp coconut rum", "4 tsp freshly squeezed lime juice", "vanilla ice cream", "1 lime, zest only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line 4 crumpet rings (8cm/3¼in in diameter) with greaseproof paper. ", "Heat a pan, melt the sugar in the pan then remove from the heat", "Meanwhile put the lined tins in the oven for 5 minutes. Then remove from the oven and pour in the hot caramel. Place 2 pineapple slices on top of the caramel in each ring. ", "Cut 4 circles from the puff pastry big enough to cover the ring. Cover the pineapple slices with the pastry, pushing the pastry right to the bottom of the pineapple, touching the caramel sauce.", "Place the 4 rings on a baking tray lined with greaseproof paper. Brush the tops of the pastry with some beaten egg.", "Place them in the oven and cook for 20 minutes until the pastry is golden-brown.", "Meanwhile, for the syrup, in a small bowl, mix together the maple syrup, rum, lime juice, and 4 tablespoons of the reserved pineapple syrup.", "Tip the tart upside down and remove the greaseproof paper. Place on a plate and serve with a scoop of vanilla ice cream over the top drizzle with some of the syrup. Garnish with lime zest and serve."]}, {"isVegetarian": true, "title": "Pineapple tarte tatin with spiced ice cream, dried pineapple and a hot caramel sauce", "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_68881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["568ml/1 pint carton double cream", "1 vanilla pod, split lengthways", "2 cinnamon sticks", "2 cloves", "6 medium free-range egg yolks", "150g/5½oz caster sugar", "1 baby pineapple, peeled and sliced 3mm thick", "250g/9oz plain flour", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice-cold water", "110g/4oz caster sugar", "20g/¾oz butter", "2 rings pineapple", "110g/4oz caster sugar", "75ml/2½fl oz double cream", "2 tbsp rum", "2 sprigs fresh mint, plus extra for garnish"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the spiced ice cream, place the cream, vanilla pod and seeds, cinnamon sticks and cloves into a large saucepan and heat until it starts to simmer gently.", "In the meantime, place the egg yolks and sugar in a large bowl and whisk until the mixture thickens and turns pale.", "Gradually add the cream mixture to the bowl, continually whisking and, once you have added all the liquid, pour it back into the pan. Cook until it thickens, then remove the vanilla pod, cinnamon sticks and cloves. Place in an ice cream machine and churn according to manufacturer’s instructions for 40-50 minutes, or until thick. Place the ice cream in the freezer.", "For the dried pineapple, heat the oven to 180C/350F/Gas 4. Place the pineapple slices onto a baking tray and place in the oven.", "Bake for 20 minutes and then turn off the heat. Leave in the oven for 1-1½ hours, turning once.", "Remove the pineapple from the oven and place onto a cooling rack to firm up.", "For the puff pastry, place the flour in a mound on a clean work surface and make a well in the centre.", "Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly.", "Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes. ", "Flour a clean work surface and roll out the pastry into a 40x20cm/16x8in rectangle.", "Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn. ", "Roll the block of pastry into a 40x20cm/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes.", "Give the chilled pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap the pastry in cling film and refrigerate for at least 30 minutes before using. ", "For the pineapple tarte tatin, preheat the oven to 200C/400F/Gas 6.", "Divide the sugar evenly between two small ovenproof blini pans over a low heat. Cook without stirring, until the sugar has melted and caramelised in both pans, turning golden-brown.", "Remove from the heat and place half of the butter into each pan. Stir gently to combine.", "Place a pineapple ring into the caramel in each pan.", "Place the rolled out pastry onto a clean, floured surface and cut out two circles slightly larger than the circumference of the blini pans.", "Cover each pan with a pastry round, pushing the edge down around the pineapple ring. Transfer the oven and bake for 10-12 minutes, until the pastry is golden brown and cooked through. Remove and allow to cool slightly.", "For the hot caramel sauce, place the sugar into a saucepan and heat gently without stirring until it has melted and turned a golden caramel colour.", "Remove from the heat and place the base of the pan into cold water to prevent the sugar cooking further.", "Add the double cream, rum and mint and stir to combine.", "To serve, place a slice of each tart on a serving plate and top with a scoop of ice cream. Put a piece of dried pineapple on top of the ice cream and drizzle over the caramel. Garnish with mint."]}, {"isVegetarian": true, "title": "Pineapple upside-down cake", "url": "www_bbc_co_uk_food_recipes_pineapple_upside-down_22072", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe pineapple, peeled using a sharp knife, eyes and core removed, flesh cut into 1.5cm/½in rings", "200g/7oz caster sugar", "1 vanilla pod, split lengthways, seeds scraped out with a knife and reserved for the cake (see below)", "1 cinnamon stick", "2 star anise", "2 bay leaves", "150g/5½oz butter, softened, plus extra for greasing", "150g/5½oz soft dark brown sugar", "100g/3½oz pitted dates, chopped  ", "3 tsp cracked black peppercorns", "50ml/2fl oz dark rum (optional)", "200g/7oz butter, plus extra for greasing", "200g/7oz soft brown sugar", "100g/3½oz self-raising flour, sifted", "2 tsp baking powder  ", "4 free-range eggs, beaten", "reserved vanilla seeds (from the sugar syrup)", "50ml/2fl oz dark rum (optional) ", "75g/2½oz butter", "100g/3½oz soft brown sugar", "30ml/1fl oz dark rum", "2 x 160ml/5½fl oz cans coconut cream, chilled in the fridge overnight", "2 tbsp caster sugar", "1 lime, finely grated zest only, to serve"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Lightly grease a 24cm/9½in square cake tin with butter. Line the base and sides with baking parchment.", "For the pineapple sugar syrup, use two cookie cutters to make the outside edges and inside edges of each pineapple ring a uniform shape, alternatively trim them using a sharp knife. You need 4-5 pineapple rings. ", "Pour 500ml/18fl oz water into a large saucepan and add the caster sugar, vanilla pods, cinnamon stick, star anise and bay leaves. Bring to the boil, then add the pineapple rings and reduce the heat until the mixture is just simmering. Continue to simmer for 15-20 minutes, or until the pineapple is tender. Set the pan aside until the contents have completely cooled. ", "For the topping, put the butter and dark brown sugar in a large bowl. Using an electric whisk, beat them until fluffy, then stir in the dates, black peppercorns and the rum (if using).", "Drain the cooled pineapple rings and arrange them into the bottom of the cake tin. Spread the topping mixture over the pineapple rings in an even layer.", "For the cake, preheat the oven to 180C/350F/Gas 4.", "In a clean mixing bowl, beat together the butter and sugar until fluffy using an electric whisk. Add the flour, baking powder, eggs, vanilla seeds and the rum, if using, then whisk again until just combined. ", "Spoon the cake mixture into the cake tin and smooth the top using a palette knife. Bake for 45 minutes, or until a skewer inserted into the centre of the cake comes out clean. Remove from the oven and set aside to cool for 10-15 minutes.", "When cooled, turn the pineapple upside-down cake out onto a serving plate and remove the baking parchment.", "For the toffee sauce, melt all of the toffee sauce ingredients together in a small saucepan over a low heat. Increase the heat until the mixture is boiling, then remove the pan from the heat.", "For the coconut cream, in a mixing bowl, whisk together the chilled coconut cream and the caster sugar until soft peaks form when the whisk is removed. ", "To serve, slice the pineapple upside-down cake. Place each slice onto a serving plate, then drizzle over a little toffee sauce. Place a dollop of coconut cream alongside (if using), then sprinkle over a little lime zest."]}, {"isVegetarian": false, "title": "Pineapple tarte tatin with coconut and caramel sauce", "url": "www_bbc_co_uk_food_recipes_pineapple_tarte_tatin_71656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "275g/9¾ oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice-cold water", "115g/4oz caster sugar", "2 rings pineapple", "100g/3½oz butter", "100g/3½oz soft brown sugar", "100g/3½oz golden syrup", "½ lemon, juice only", "150ml/5fl oz double cream", "2 tbsp coconut liqueur", "flaked coconut", "vanilla ice cream", "2 sprigs fresh mint, leaves removed"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour in a mound on a clean work surface and make a well in the centre.", "Add 250g/9oz butter and the salt to the well and work together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually work in the water and it is all incorporated. Don’t overwork the dough – you should have a marbled effect with the butter. Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes. ", "Flour a clean work surface and roll out the pastry into a 40x20cm/16x8in rectangle. Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn. Roll the pastry into a 40x20cm/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes.", "Give the pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap it in cling film and refrigerate for at least 30 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 6. Divide the caster sugar evenly between two small ovenproof blini pans. Cook over a low heat without stirring, until the sugar has melted and caramelised in both pans, turning golden-brown (CAUTION: boiling sugar is extremely hot. Handle very carefully). Remove from the heat and put half the remaining butter in each pan. Stir gently. Place a pineapple ring into the caramel in each pan.", "Put the rolled out pastry on a clean, floured surface and cut out two circles slightly larger than the circumference of the blini pans. Cover each pan with a pastry round, pushing the edges down around the pineapple ring. Bake for 10-12 minutes, or until the pastry is golden brown and cooked through. Remove and leave to cool slightly.", "Meanwhile for the sauce, in a small saucepan heat the butter, brown sugar and golden syrup until combined and the sugar is dissolved. Bring to a gentle simmer, then remove from the heat and add lemon juice to taste. Stir in the cream and coconut liquor. ", "Toast the flaked cocount in a dry pan for 1-2 minutes, taking care to ensure it does not burn. ", "To serve, place a slice of each tart on a plate and top with a scoop of ice cream. Drizzle over the sauce and garnish with mint leaves and toasted coconut."]}, {"isVegetarian": true, "title": "Pineapple upside-down cake", "url": "www_bbc_co_uk_food_recipes_pineapple_upside-down_82924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz agave nectar (light and mild), plus 4 tbsp for the base and to drizzle ", "1 x 425g tin pineapple slices in fruit juice, drained and patted dry with kitchen roll ", "8 frozen cherries, defrosted and stones removed", "300g/10½oz self-raising flour", "¼ tsp fine table salt", "300g/10½oz unsalted butter, melted and cooled", "5 large free-range eggs, lightly beaten", "500ml/18fl oz full-fat milk", "60g/2¼oz maple syrup", "1 tsp vanilla extract", "1 vanilla pod, seeds only", "6 medium free-range egg yolks", "15g/½oz cornflour"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, preheat the oven to 170C/150C Fan/Gas 3. Grease a deep 30x20cm/12x8in baking tin and line the base and sides with baking parchment. Set aside. ", "Spread 2 tablespoons of the agave nectar over the base of the tin using the back of the spoon. Arrange the pineapple rings in the tin. Fill the rings of the pineapple with the cherries. ", "Sift the flour and salt into a bowl. Make a well in the middle and add the melted butter, agave nectar and lightly beaten eggs. Fold the mixture together gently.", "Carefully pour the cake mixture over the prepared pineapples and cherries, easing with the back of the spoon and being careful not to dislodge the arranged fruit. Smooth the top and bake for 35-40 minutes, or until a wooden skewer inserted into the cake comes out clean.", "Allow the tin to cool on a wire rack for 5 minutes, then gently turn out of the tin onto the rack to cool completely. Carefully peel the parchment paper off and drizzle with the remaining agave nectar. ", "For the maple syrup custard sauce, put the milk, maple syrup, vanilla extract and vanilla seeds in a medium saucepan and bring to almost boiling point.", "Beat the egg yolks and cornflour in a bowl until smooth. Temper the egg yolks gently by adding a ladle of the milk mixture at a time to raise the temperature of the eggs.", "Pour the remaining milk over the eggs, then pour the mixture back into the pan and return to a medium heat, stirring constantly until it thickens and covers the back of the spoon. Remove from the heat and transfer to a jug, cover with cling film to prevent the skin from forming.", "Serve slices of the cake with the custard poured over."]}, {"isVegetarian": true, "title": "Pineapple with star anise", "url": "www_bbc_co_uk_food_recipes_pineapple_with_star_29786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large pineapple, peeled and cut into thick slices", "200g/7oz demerara sugar", "50g/1¾oz butter", "few star anise, broken up", "1 lemongrass, roughly chopped", "1 piece pared lime zest", "100ml/3½fl oz rum", "crème fraîche, ice cream or coconut-flavoured dairy-free ice cream "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Spread the demerara sugar over a plate and dip the pineapple in it, coating both sides. Melt the butter in a large heavy frying pan over a medium heat. When the butter is foaming, add the pineapple, star anise, lemongrass and lime zest and cook until browned on both sides – you want the sugar to melt onto the pineapple and turn a dark brown/almost black colour.", "Heat the rum in a ladle, carefully set alight, and pour over the pineapple. Wait for the rum to burn off – keep on the heat until the contents of the pan look syrupy. Serve the pineapple with the syrupy juices poured over, with crème fraîche, ice cream or coconut-flavoured dairy-free ice cream on the side."]}, {"isVegetarian": false, "title": "Pine nut, Stilton and herb-crusted beef with warm cabbage and tomato salad", "url": "www_bbc_co_uk_food_recipes_pinenutstiltonandher_85372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp pine nuts", "1 tbsp butter", "25g/1oz Stilton", "small chunk bread", "small handful fresh herbs, such as chervil, chives, parsley and sage, leaves only", "1 x 100g/3½oz piece beef fillet", "salt and freshly ground black pepper ", "1 tbsp olive oil", "1 tbsp butter ", "¼ savoy cabbage, finely chopped", "2 tsp wholegrain mustard", "2 ripe tomatoes, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the beef, place the pine nuts, butter, Stilton, bread and herbs into a blender and pulse to combine.", "Season the beef fillet all over with salt and freshly ground black pepper. Press the crust onto the beef to coat it.", "Heat the olive oil in an ovenproof frying pan over a medium-high heat and fry the beef crust-side up for 2-3 minutes.", "Transfer to the oven to finish cooking for 5-6 minutes, or until the crust is golden-brown and the beef is cooked to your liking. Leave to rest for five minutes.", "For the warm cabbage and tomato salad, heat the butter in a frying pan and gently cook the cabbage until tender. Add the mustard and tomatoes, stir well to combine and warm through. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the cabbage salad onto a plate and top with the beef."]}, {"isVegetarian": true, "title": "Pine nut-crusted paneer with spinach salad and honey and red pepper dressing", "url": "www_bbc_co_uk_food_recipes_pinenutcrustedpaneer_84699", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "50g/1¾oz plain flour", "1 free-range egg, beaten", "75g/3oz pine nuts, finely chopped", "125g/4½oz paneer, sliced", "2 tbsp olive oil", "½ red pepper, finely chopped", "3 garlic cloves, finely chopped", "½ orange, juice only", "2 tsp honey", "salt and freshly ground black pepper", "150g/5½oz fresh spinach", "½ lemon, juice only", "3 tbsp olive oil", "2 tsp white wine vinegar", "1 orange, segmented", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the paneer, half fill a deep, heavy based saucepan or deep fat fryer with the vegetable oil and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the plain flour, beaten egg and finely chopped pine nuts into three separate bowls. First roll the paneer in the plain flour, then in the egg and finally in the pine nuts. ", "Carefully place the paneer into the hot oil and cook until golden-brown, then carefully remove with a slotted spoon and drain on kitchen paper.", "For the dressing, heat the oil in a saucepan over a medium heat, then add the red pepper and garlic to the pan and cook for three minutes. Remove from the heat and add the orange juice and honey and season to taste with salt and freshly ground black pepper. ", "Transfer the dressing to a mini-blender and blend until smooth, then pour into a small dipping bowl to serve.", "For the spinach salad, combine all of the ingredients in a mixing bowl.", "To serve, place the salad onto a large plate with the paneer on top and the small dipping bowl of sauce alongside."]}, {"isVegetarian": false, "title": "Ham and eggs with roasted pepper sauce", "url": "www_bbc_co_uk_food_recipes_piperadewitheggs_90495", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piperadewitheggs_90495_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1 onion, finely sliced", "2 garlic cloves, finely chopped", "2 green peppers, finely sliced", "110g/4oz roasted peppers, from a jar, thinly sliced (optional)", "2 tomatoes, roughly chopped", "4 free-range eggs, beaten", "4 slices ham, bacon or prosciutto", "2 slices crusty bread, toasted", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until smoking, then add the olive oil followed by the onions, garlic and green peppers. Cook for 1-2 minutes, or until the onions are beginning to soften. ", "Stir in the roasted peppers (if using) and tomatoes, and cook for 1-2 minutes, then season with salt and pepper. ", "Pour in the eggs and cook for 2-3 minutes, stirring to scramble the eggs, until the eggs are just set. ", "In a clean frying pan, fry the ham for one minute on both sides, or until golden-brown all over.", "Serve the eggs on top of crusty bread, topped with the fried ham."]}, {"isVegetarian": true, "title": "Pink meringues with raspberry cream", "url": "www_bbc_co_uk_food_recipes_pink_meringues_with_56085", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range egg whites", "1 pinches salt", "300g/10½oz caster sugar", "½ tsp vanilla extract", "pink food colouring", "75g/2½oz fresh or frozen raspberries ", "2 tbsp icing sugar", "1 squeeze lemon juice", "400ml/14fl oz stiffly whipped cream"], "serves": "Makes 4 large pairs or 8 smaller pairs", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 140C/280F/Gas 1. Line two baking trays with parchment paper.", "Put the egg whites into a large spotlessly clean bowl with a pinch of salt. Whisk until soft peaks form when the whisk is removed. Gradually add the caster sugar, one tablespoon at a time, whisking between each addition, until it has all been added and the meringue is satiny and forms stiff peaks when the whisk is lifted from the mixture.", "Fold in the vanilla extract with a large metal spoon. Using a piping bag fitted with a 1½cm/¾in nozzle or a spoon, pipe or scoop the mixture into individual meringues about 7cm/2¾in wide onto the prepared baking trays.", "For the ripple colour effect, dip a wooden or metal skewer into the food colouring and swirl it through each meringue.", "Bake in the oven for 30 minutes. Test one by lifting and gently pressing on the base of a meringue – it should be crisp but give way with a bit of pressure – they will crisp more when cooling. Turn off the oven, and leave to cool in the oven with the oven door slightly ajar for best results. If possible, let them cool completely in the oven.", "When ready to serve, make the raspberry cream. Put the raspberries or blueberries and sugar in a food processor and blend until smooth. Push the mixture through a sieve into a bowl to remove the pips. Fold as much purée as you wish through the whipped cream, leaving it rippled if you like.", "Dollop a generous tablespoon of the cream on one half of the meringue and sandwich together with another meringue. Serve any remaining purée on the side."]}, {"isVegetarian": false, "title": "Piri-piri chicken", "url": "www_bbc_co_uk_food_recipes_piri-piri_chicken_98511", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piri-piri_chicken_98511_16x9.jpg", "ingredients": ["1 onion, roughly chopped", "4 garlic cloves, chopped", "2 unwaxed lemons, juice and zest only", "generous dash Worcestershire sauce", "4 mild red chillies, seeds removed and chopped", "2 red birds’-eye chillies, seeds removed and chopped", "2 tbsp white wine vinegar", "1 tsp smoked paprika", "1 tsp dried oregano", "1 tsp soft light brown sugar", "1 tsp salt (optional)", "small bunch of parsley", "1 chicken, spatchcocked"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put all the ingredients, except the chicken, in a food processor and pulse until you have a smooth marinade. ", "Put the chicken in a shallow dish and pour over the marinade. Massage the marinade into the chicken as much as you can, then cover and leave to marinade in the fridge for at least 3 hours or preferably overnight.", "When you are ready to cook the chicken, either prepare a barbecue or preheat your oven to 200C/180C Fan/Gas 6.", "To barbecue, put the spatchcocked chicken on the grill and cook for around 5 minutes on each side over the direct heat, then move to the side a little to finish off – it will probably take another 20 minutes of regular turning. Spray regularly with water (or beer) if it is browning too quickly. Alternatively, roast in the oven for 30–35 minutes, or until the juices run clear."]}, {"isVegetarian": false, "title": "Piri-piri chicken", "url": "www_bbc_co_uk_food_recipes_piripirichicken_72310", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piripirichicken_72310_16x9.jpg", "ingredients": ["1 whole chicken (about 1kg/2lb 3oz), spatchcocked ", "salt and freshly ground black pepper", "6-12 fresh red chillies, depending on how hot you want it", "1 tbsp garlic, blanched and chopped", "1 tsp salt flakes", "½ tsp oregano", "½ tbsp paprika", "100ml/3½fl oz olive oil ", "50ml/1¾fl oz red wine vinegar", "chips", "salad"], "serves": "2-4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the piri-piri sauce, preheat the oven to 180C/350F/Gas 4. Place the chillies on a roasting tray and roast them for 10 minutes. ", "Cool and roughly chop the chillies. Place the chillies, garlic, salt, oregano, paprika, olive oil and vinegar in a saucepan, and simmer for 2-3 minutes. ", "Allow the mixture to cool, then blend it to a purée in a jug blender or food processor. Store in a lidded container at room temperature; it will keep for about a month. Shake before using. ", "Place the spatchcocked chicken in a sealable plastic bag. Add half the piri-piri sauce, spreading it evenly over the chicken. Seal and marinate in the refrigerator for at least one hour. ", "Preheat the oven to 200C/390F/Gas 6, and preheat a large griddle pan on the hob. Alternatively, light your barbecue.  ", "Season the marinated chicken, and cook it on the griddle pan for 2-3 minutes on each side, until golden brown. ", "Transfer the griddled chicken to a roasting tray and roast in the oven for 30 minutes, until cooked through. Alternatively, place the chicken on a medium heat barbecue, covered, for 10-15 minutes on both sides or until cooked through, basting regularly with the remaining piri-piri sauce.", "Serve with chips and salad."]}, {"isVegetarian": false, "title": "Piri-piri prawns and harissa couscous", "url": "www_bbc_co_uk_food_recipes_piripiriprawnsandhar_86697", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piripiriprawnsandhar_86697_16x9.jpg", "ingredients": ["2 red chillies, seeds removed, roughly chopped", "1 dried chilli, roughly chopped", "½ lemon, juice only", "3 garlic cloves, peeled ", "1 tbsp sweet smoked paprika", "4 tbsp olive oil", "1 tbsp red wine vinegar", "1 tsp sea salt", "½ tsp freshly ground black pepper", "12 very large prawns, shells removed but tails left on, cleaned", "200g/7oz wholegrain couscous", "400ml/14fl oz boiling water", "1 tsp harissa", "1 tbsp pomegranate molasses", "1 tsp baharat spice mix (available from Middle Eastern stores and some supermarkets)", "½ lemon, juice only", "1 red onion, finely sliced", "1 pomegranate, fleshy seeds only", "1 small bunch coriander, roughly chopped", "1 lemon, quartered, to serve"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the piri-piri prawns, place all the ingredients except the prawns into a food processor and blend until smooth.", "Place the prawns on a plate and rub over the piri-piri sauce, reserving a little to garnish. Leave to marinate in the fridge for an hour.", "Heat a griddle pan until hot and cook the prawns for 4-5 minutes on each side, depending on their size, until the prawns have turned pink and are cooked through.", "For the couscous, place the couscous into a bowl, pour over the boiling water and stir with a fork to combine. Add the harissa, pomegranate molasses, baharat and lemon juice and stir once more. Cover with cling film and set aside for 3-4 minutes, until all the liquid has been absorbed into the couscous.", "Remove the cling film and fluff up with a fork. Add the red onion, fleshy pomegranate seeds and coriander and mix well.", "To serve, place three prawns onto each plate with a pile of couscous. Drizzle over the reserved piri-piri sauce and a squeeze of lemon."]}, {"isVegetarian": true, "title": "Pisco sour", "url": "www_bbc_co_uk_food_recipes_piscosour_85134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/1¾fl oz pisco (grape brandy)", "50ml/1¾fl oz lime juice", "25ml/1fl oz sugar syrup", "1 dash bitters", "½ free-range egg white", "1 cherry, stem attached", "1 lemon slice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients except the cherry and lemon slice into a cocktail shaker and shake.", "Strain into a rocks glass and garnish with a fresh cherry on the stem and a lemon slice."]}, {"isVegetarian": false, "title": "Pisellini al prosciutto (spring peas with ham)", "url": "www_bbc_co_uk_food_recipes_pisellinialprosciutt_10820", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz spring peas (petit pois)", "1½oz of butter or oil", "½ medium onion, chopped", "200g/7oz of prosciutto ham or pancetta, diced small", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan and add the chopped onion and prosciutto or pancetta.", "sauté for a few minutes until the onion turns golden and the ham is brown but not crisp.", "Add the peas, still frozen, and a little water. Stir.", "Cover and simmer gently until the peas are tender, about 15 minutes. Season to taste and serve."]}, {"isVegetarian": false, "title": "Pissaladière tart with anchovy tapenade and roasted cannon of lamb with rosemary and garlic", "url": "www_bbc_co_uk_food_recipes_pissaladire_tart_with_56780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-rolled puff pastry", "25g/1oz unsalted butter", "1 onion, thinly sliced", "6 salted anchovy fillets, bones removed, halved and washed", "150g/5½oz pitted black olives", "6 tbsp olive oil", "1 lemon, juice only", "2 tbsp olive oil", "50g/1¾oz unsalted butter", "1 cannon of lamb, trimmed", "1 large sprig fresh rosemary", "2 garlic cloves, peeled and smashed", "150ml/5fl oz port", "300ml/10fl oz beef stock", "2 tbsp olive oil", "100g/3½oz black olives, chopped", "1 tomato, chopped", "2 tbsp fresh parsley, chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the pissaladière tart, cut out two 10cm/4in circles from the puff pastry and place on a baking tray. Dot the circles with the tip of a sharp knife. ", "Heat the butter in a frying pan and fry the onions for 10 minutes until crisp.", "Put 6 of the anchovy halves and black olives in a small food processor and blend until smooth. Gradually add the olive oil and lemon juice then season with salt and pepper. Spread the paste over the pastry and top with the fried onions. Lay the remaining anchovies in a criss-cross pattern over the top of each tart. Bake for 15–20 minutes, or until the pastry is crisp and golden-brown. Keep warm until ready to serve.", "For the lamb, reduce the oven temperature to 180C/160C Fan/Gas 4. ", "Heat an ovenproof frying pan and add the oil and butter. Once hot, add the lamb, rosemary and garlic. Fry until the lamb is coloured on all sides. Transfer to the oven for 6–8 minutes or until cooked to your liking, then remove from the oven and set aside to rest. Keep the pan to make the port reduction.", "For the port reduction, heat the pan used for the lamb and add the port. Cook until the volume of liquid is reduced by half. Add the stock and reduce again by half. Finish with the olive oil, olives, chopped tomatoes and parsley. Season with salt and pepper.", "To serve, carve the lamb into slices. Place a tart on each serving plate and top with the sliced lamb and port reduction."]}, {"isVegetarian": false, "title": "Pissaladière with olives and anchovies", "url": "www_bbc_co_uk_food_recipes_pissaladire_with_olives_81173", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "1 tsp salt", "5g instant yeast", "1 tbsp honey", "50ml/2fl oz olive oil", "125ml/4fl oz warm water", "2 tbsp olive oil", "knob of butter", "1.25kg/2 lb 12 oz onions, thinly sliced", "few thyme leaves (optional)", "2 100g/4oz jars anchovies", "1 small jar black pitted olives, drained "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, put the flour in a bowl and stir in the salt. Add the yeast. Mix the honey with the oil and water, then pour this over the flour. ", "Mix until you have a sticky dough, then turn out the dough and knead until soft and passes the windowpane test (stretch a small piece out until you can see through it – gluten is developed enough if it allows you do this). Return to the bowl and cover with a damp tea towel. Leave to double in size – at least an hour.", "Meanwhile make the topping. Heat the olive oil and butter in a very large frying pan. When the butter has melted and is foaming, add the onions and thyme leaves (if using). Season with salt. Stir carefully until they reduce in volume – there will seem almost too much for the pan to start with, but they will collapse quite quickly. Continue to cook on a low to medium heat for at least 45 minutes to an hour, stirring regularly. The onions will lightly caramelise on the base – scrape this up regularly when you stir. ", "Eventually you will have very soft, almost puréed, golden brown onions. You can instead cover the pan and let the onions sweat for a similar amount of time – they will collapse in a similar way but be lighter in colour.", "Preheat the oven to 230C/210C Fan/Gas 8.", "Knock the dough back and shape to fill a large baking tray – around 40x20cm/16x8in. Spread the onions over the dough, leaving a narrow border, then add the anchovies in a lattice pattern – or more free-form if you prefer (I often do a small amount without as there’s always someone who doesn’t like anchovies!). Add the olives at intervals. Drizzle with a little more olive oil, if you like. Bake in the preheated oven for around 20-25 minutes, or until the dough is cooked through.", "Cool, cut into slices and serve."]}, {"isVegetarian": true, "title": "Reduced-sugar carrot cake", "url": "www_bbc_co_uk_food_recipes_sugar-free_carrot_cake_71797", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_carrot_cake_71797_16x9.jpg", "ingredients": ["200ml/7fl oz vegetable oil", "3 free-range eggs", "175ml/6fl oz agave syrup (also known as agave nectar)", "400g/14oz carrots, peeled and grated", "275g/9¾oz self-raising flour", "2 tsp baking powder", "1 tsp ground cinnamon", "1 tsp mixed spice", "150g/5½oz sultanas", "150g/5½oz walnuts pieces", "1 orange, finely grated zest only", "400g/14oz full-fat cream cheese", "50g/1¾oz unsalted butter, softened", "50ml/2fl oz maple syrup", "25g/1oz walnut pieces, chopped", "ground cinnamon, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Oil and line 2 x 20cm/8in sandwich tins.", "Pour the oil into a large mixing bowl with the eggs and agave syrup and beat together. Add the carrots and mix together. ", "In a separate bowl, sieve the flour, baking powder, cinnamon and mixed spice together. Add the sultanas, walnuts and orange zest and stir to coat in the flour.  ", "Tip the flour mixture into the carrot mixture and stir together gently, until well combined. Divide the mixture between the tins and bake for 40 minutes. Cover with aluminium foil after 20-30 minutes to prevent the tops from burning. ", "Leave to cool in the tins for 5 minutes, then transfer to a wire rack and leave to cool completely. ", "For the frosting, place the cream cheese in a piece of clean muslin or thin cleaning cloth (such as a J Cloth) and squeeze out any liquid.  (This removes the moisture from the cheese so that the frosting isn’t too wet). Place the cream cheese in a bowl and beat until smooth. Add the butter and maple syrup and beat together. Refrigerate until needed. ", "Sandwich the sponges together with half of the frosting. Spread a very thin layer of frosting over the top of the cake and spoon the remaining frosting into a piping bag fitted with a 1cm/½in plain nozzle. Sprinkle the chopped walnuts over the top of the frosting. ", "Pipe small kisses of frosting around the edge of the cake and dust with cinnamon."]}, {"isVegetarian": false, "title": "Suffolk pork chops with cider and caramelised apples", "url": "www_bbc_co_uk_food_recipes_suffolkporkchopswith_91979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz pork chops ", "4 tsp sea salt flakes", "2 tbsp olive oil", "2 onions, peeled, finely chopped", "150g/5oz smoked bacon, chopped", "1 bouquet garni (celery, parsley, bay leaves and thyme)", "300g/10½oz button mushrooms", "300g/10½oz shallots, peeled, cooked for ten minutes, then drained and refreshed in cold water", "4 Cox's apples, peeled, cores removed, quartered", "4 tbsp muscovado sugar", "500ml/17½fl oz Suffolk cider", "4 tsp Suffolk mustard", "400ml/14fl oz double cream", "cooked carrots, to serve", "mashed potatoes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the fat sides of the pork chops in the salt flakes.", "Heat a griddle pan until smoking. Sear the fat side of the pork chops in the pan for 1-2 minutes, using tongs to keep the pork chops upright in the pan. When the fat is golden-brown and crisp, lay the pork chops down flat and fry for 3-4 minutes on both sides, or until the pork chop has deep griddle marks all over. Set aside.", "Meanwhile, heat the olive oil in a large frying pan and fry the onion and bacon together for 4-5 minutes, or until the onion is starting to colour. Add the bouquet garni, button mushrooms and shallots to the pan and cook over a medium-low heat for 3-4 minutes. ", "Pour the cider into the pan and deglaze by scraping up any browned bits from the bottom of the pan with a wooden spoon, then bring to the boil. Add the pork chops and cook for 10-15 minutes, or until the pork is cooked through (the juices should run clear when the pork is pierced at the thickest part).", "Meanwhile, dust the apple pieces with the muscovado sugar. Place the griddle pan used to cook the pork back over the heat, then add the apples and cook for 8-10 minutes, or until the apples are golden-brown and caramelised.", "Remove the pork chops from the pan and set aside to rest. Return the pan to the heat and bring to a rapid boil, then stir in the mustard and cream and cook for 4-5 minutes, or until the liquid has reduced to a sauce consistency.", "To serve, spoon the caramelised apples onto serving plates and arrange a pork chop next to the apples, with the cooked carrots and mashed potatoes alongside. Spoon over the sauce and serve."]}, {"isVegetarian": true, "title": "Sugar-free chocolate brownies", "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_90899", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_chocolate_90899_16x9.jpg", "ingredients": ["oil, for greasing", "200g/7oz self-raising flour", "50g/1¾oz cocoa powder, sifted", "1 tsp bicarbonate of soda", "100g/3½oz butter, cubed", "100ml/3½fl oz semi-skimmed milk", "3 large free-range eggs, beaten", "250g/9oz sweet potato, finely grated", "1 large very ripe banana (approximately125g/4½oz peeled weight), mashed with a fork"], "serves": "Makes 16 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease and line the base and sides of a 23cm/9in loose-based square cake tin with baking parchment. ", "Mix the flour, cocoa and bicarbonate of soda in a large bowl. Make a well in the centre.", "Put the butter in a medium saucepan and melt over a low heat, stirring regularly. Take the pan off the heat and stir the milk into the melted butter. Add the eggs, sweet potato and banana, stirring vigorously. ", "Pour slowly into the flour mixture, stirring constantly with a wooden spoon to form a thick batter. Pour into the prepared tin. ", "Bake in the centre of the oven for 30-35 minutes, or until the cake is risen and just firm to the touch. ", "Serve warm or leave to cool in the tin before cutting into squares. "]}, {"isVegetarian": true, "title": "Sugar-free chocolate and hazelnut spread", "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_and_54033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz whole blanched hazelnuts", "10g unsweetened 100% pure cacao (from a block)"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the hazelnuts in a food processor – a small one is best for this job – and blitz with the metal blade for 8-10 minutes, or until the nuts first turn to a powder and then a glossy paste. Stop the machine and push the nuts down every 3-4 minutes until the correct consistency is reached. The hazelnut paste should look like a runny peanut butter.", "Scrape the hazelnut paste into a small saucepan. Finely grate the cacao from the block onto a board. It’s easier to grate and then weigh the cacao rather than cut it off the block at the beginning.", "Tip the grated cacao into the pan with the nut paste and warm through very gently for just a few seconds, stirring constantly until the cacao melts. Transfer to a small bowl and serve. ", "Put the spread in a lidded jar or container. The spread will keep in the fridge, covered, for three days."]}, {"isVegetarian": false, "title": "Sugar plum fairy cakes", "url": "www_bbc_co_uk_food_recipes_sugar_plum_fairy_cakes_92523", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz caster sugar", "2 large free-range eggs", "20g/½oz unsalted butter", "60g/2¼oz self-raising flour", "1 tsp mixed spice", "3 plums, halved, pitted and chopped", "orange liqueur, such as Grand Marnier", "150g/5½oz plain chocolate ", "1 large free-range egg white", "60g/2¼oz caster sugar", "80g/2¾oz slightly salted butter, softened", "1 tsp orange liqueur, such as Grand Marnier", "½ tsp orange extract ", "edible gold glitter"], "serves": "Makes 12 fairy cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the génoise fairy cakes, line a mini-muffin tray with 12 fairy cake cases and preheat the oven to 170C/150C(fan)/Gas 5.", "Warm the bowl of a free-standing mixer by pouring in some boiling water and drying it with a tea towel.", "Place the sugar and eggs in the warmed bowl and whisk at full speed for several minutes, or until the mixture is pale and doubled in volume. ", "While the mixture is whisking, melt the butter in a small saucepan.  Sift the flour and mixed spice into a bowl.", "Carefully add the melted butter around the edge of the mixture while still whisking.", "Remove the bowl from the mixer and place on a tea towel, then sift and gently fold in the flour and mixed spice in two batches. ", "Transfer the mixture to a piping bag and carefully pipe into the cake cases.   Bake for 10-12 minutes, or until golden-brown and springy to the touch.", "Remove the cakes from the tins and cool on a wire rack. Peel the paper cases off the cakes when cooled. ", "For the plums, marinade the chopped plums in the orange liqueur in a small bowl. Set aside.", "For the edible fairy cake cases, melt the chocolate in a heatproof bowl placed over a pan of simmering water. Set 12 more fairy cake cases in the mini-muffin tins.", "Once melted, paint the chocolate inside the fairy cake cases and press the cooled genoise fairy cakes into each one, so the chocolate lines and coats the side of the cakes. Leave to set completely, then remove from the tins and remove the papers from the chocolate-lined cakes.", "For the French meringue buttercream, combine the egg white and sugar in a medium-sized heatproof bowl set over a pan of barely simmering water. ", "Beat continuously with an electric hand-held whisk until the mixture is thick and glossy and all the sugar has dissolved. ", "Remove from the heat and continue to whisk until the mixture has cooled and is thick enough to hold its shape. ", "Beat the butter to a soft consistency and start adding small lumps of it to the meringue, a little at a time, whisking well after each addition. ", "Beat in the orange liqueur, orange extract and zest. Transfer the meringue buttercream to a piping bag fitted with a round nozzle and pipe it onto the cupcakes. ", "Drain the plums of their liqueur and carefully top each fairy cake with a plum piece and a sprinkling of edible gold glitter."]}, {"isVegetarian": true, "title": "Sultana scones with strawberry jam and clotted cream", "url": "www_bbc_co_uk_food_recipes_sultana_scones_with_98294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz jam sugar", "500g/1lb 2oz strawberries, hulled and cut in half only if large", "½ lemon, juice only", "450g/1lb strong white flour, plus extra for dusting", "5 tsp baking powder", "pinch salt", "75g/3oz unsalted butter, plus extra for greasing", "75g/3oz caster sugar", "150g/5oz sultanas", "2 free-range eggs, lightly beaten, plus 2 eggs for glazing", "250ml/9fl oz milk", "400g/14oz clotted cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, heat the sugar, strawberries and lemon juice in a large saucepan over a medium heat until the sugar has melted.", "Bring the mixture to the boil and cook for 3-4 minutes (or up to 10 minutes if you prefer a thicker style jam).  Check the temperature with a sugar thermometer; it should reach 105C/220F.", "Leave the jam to cool slightly and skim off any froth with a clean spoon. Spoon the jam into sterile jam jars, seal and label.", "For the scones, preheat the oven to 220C/450F/Gas 7. Grease a large baking tray.", "Sift the flour, baking powder and salt together in a bowl, then rub in the butter until the mixture resembles breadcrumbs. ", "Stir in the sugar, sultanas and eggs. ", "Stir in the milk with a wooden spoon, a little at a time, to form a smooth dough.", "Roll the dough out onto a lightly floured work surface to a thickness of 2cm/¾in. ", "Dip a 5cm/2in pastry cutter into a little flour and cut out the scones (be careful not to twist the cutter as it will cause the scones to rise unevenly).", "Beat the two remaining eggs in a bowl and carefully brush the tops of the scones, taking care not to let any run over the edge.", "Place the scones onto the baking tray and bake in the oven for 10-12 minutes, or until golden-brown. ", "Remove the scones from the oven and allow to cool slightly. Serve the  warm scones with the strawberry jam and clotted cream."]}, {"isVegetarian": true, "title": "Sultana scones with black pepper and strawberry jam and clotted cream", "url": "www_bbc_co_uk_food_recipes_sultanasconeswithbla_86378", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour", "1 tsp baking powder, plus extra for dusting", "pinch salt", "25g/1oz caster sugar", "50g/2oz unsalted butter, softened, plus extra for dusting", "100g/3½oz sultanas", "150ml/¼ pint milk", "1 free-range egg, beaten, for brushing, or 25g/1oz plain flour, for dusting ", "400g/14oz clotted cream", "550g/1lb 4oz jam sugar", "1 lemon, zest and juice only", "3 tbsp water", "1 kg/2lb 2oz fresh strawberries, hulled and cut in half (if large)", "1 tbsp freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the scones, sift together the flour, baking powder and salt into a bowl.", "Stir in the sugar, then add the butter and, with clean hands, rub quickly into the flour, creating a fine breadcrumb consistency. Add the sultanas.", "Add the milk, a little at a time, working with your hands to create a smooth dough. Leave to rest for 10-15 minutes before rolling.", "Roll out the dough on a lightly floured work surface until 2cm/1in thick.", "Using a 5cm/2in pastry cutter, cut the dough, using one sharp tap and not twisting the dough as you cut (twisting the scone mix will result in the scone rising unevenly).", "Once cut, the scones can be either brushed with the beaten egg for a shiny glaze, or dusted with the flour for a matt finish once cooked.", "Place the scones onto a greased baking tray and bake in the oven for 10-12 minutes, until risen and golden brown.", "Allow to cool slightly, and serve while still warm with jam and cream.", "For the jam, place the sugar, lemon zest and juice and water into a large pan over a low heat and heat until the sugar has dissolved.", "Add the strawberries and black pepper and stir gently.", "Bring the pan to the boil and cook for 3-4 minutes, or up to ten minutes if you prefer a thicker jam. Check the temperature with a sugar thermometer - it should reach 105C/220F.", "Leave to cool slightly, skimming off any froth with a clean spoon to stop the jam from going cloudy.", "Spoon the jam into sterile jam jars, seal and label with the date."]}, {"isVegetarian": true, "title": "Sultana scones", "url": "www_bbc_co_uk_food_recipes_sultanascones_1286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self raising flour", "pinch of salt", "55g/2oz butter ", "25g/1oz sultanas", "25g/1oz caster sugar", "150ml/5fl oz milk"], "serves": "Makes 8-12 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 220C/425F/Gas 7. Lightly grease a baking sheet.", "Mix together the flour and salt and rub in the butter. ", "Stir in the sultanas, sugar and then the milk to get a soft dough.", "Turn on to a floured work surface and knead very lightly. Pat out to a round 2cm/¾in thick. Use a 5cm/2in cutter to stamp out rounds and place on a baking sheet. Lightly knead together the rest of the dough and stamp out more scones to use it all up.", "Brush the tops of the scones with a little milk. Bake for 12-15 minutes until well risen and golden. ", "Cool on a wire rack and serve with butter and good jam and maybe some clotted cream."]}, {"isVegetarian": false, "title": "Sultan's delight with creamed aubergine", "url": "www_bbc_co_uk_food_recipes_sultansdelightwithcr_81428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "3 tbsp olive oil", "1.8kg/4lb lamb shoulder or leg, trimmed, cut into 2.5cm/1in cubes", "1 onion", "5 cloves garlic, crushed", "2 tbsp tomato paste", "½ tsp dried thyme", "1 tsp dried oregano", "¼ tsp cloves", "½ tsp allspice", "1 tsp ground cumin ", "285ml/10fl oz lamb stock", "salt and freshly ground black pepper", "flatleaf parsley, to garnish", "4 large aubergines", "250ml/9fl oz milk", "2 tbsp double cream", "55g/2oz butter", "1 tbsp plain flour", "110g/4oz Kasseri cheese (cheddar will do), grated", "1 tsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lamb, heat the butter and oil in a heavy pan and brown the lamb for about 5 minutes, stirring frequently. ", "Add the onion and garlic and sweat for a couple of minutes. Add the tomato paste, thyme, oregano, cloves, allspice, cumin, stock and salt and freshly ground black pepper. Bring to the boil and simmer with the lid off for about an hour until the stew is thick and the meat tender.", "For the aubergine, bake the aubergines in the oven for about 40 minutes or until blistered and softened. Leave to cool slightly.", "Peel the aubergines, and set the pulp to one side. ", "In a saucepan warm the milk and cream. In another pan melt the butter, then work in the flour. Slowly add the warm milk and cream to the butter and flour and stir to make a thick white sauce. ", "Add the aubergine purée, the cheese, chilli flakes, salt and freshly ground black pepper. Cook for about 5 minutes. ", "Put a mound of aubergine purée in the middle of the plate and surround with the lamb. Garnish with parsley."]}, {"isVegetarian": false, "title": "Sumac lamb chops with crushed caramelised onion potatoes", "url": "www_bbc_co_uk_food_recipes_sumac_lamb_chops_with_87399", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sumac_lamb_chops_with_87399_16x9.jpg", "ingredients": ["1kg/2lb 4oz potatoes, cut into 2cm/1in cubes", "4 tbsp olive oil", "2 large onions, thinly sliced (approx. 400g/14oz)", "¼ tsp fine salt", "1 tsp light brown sugar", "8 large lamb chops", "5 tbsp olive oil", "1 tsp salt", "2–3 tbsp sumac"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in lightly salted water for 1–2 minutes, or until tender. Drain and set aside.", "For the lamb chops, bash the meat with a mallet or rolling pin to thin it out. Put the chops on a plate, drizzle with the oil and season well with salt.", "Fry the chops over a high heat for 3 minutes on each side. Place them on a baking tray and sprinkle both sides with the sumac. Cover with kitchen foil and keep them warm.", "To make the potatoes, wipe any burnt bits from the pan, then add the oil and place over a medium heat. Add the onions, salt and sugar and cook for 15 minutes, or until golden, caramelised and soft. ", "Crush the potatoes lightly using the back of a fork and add to the onions. Mix through, then cook for 10–15 minutes, or until the edges are just crisp. Serve with the chops."]}, {"isVegetarian": false, "title": "Sumiko’s miso soup", "url": "www_bbc_co_uk_food_recipes_sumikos_miso_soup_47124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7-10 sheets dried sea kelp (called konbu, available from Japanese supermarkets) ", "8g dried bonito flakes (called katsuobushi, available from Japanese supermarkets)", "handful fresh spinach leaves ", "200g/7oz aburaage (thinly sliced deep-fried tofu, available from Japanese supermarkets), shredded into 1cm/½in lengths", "1½ tbsp white miso paste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dashi, put the konbu in a deep-sided saucepan and cover with 500ml/18fl oz water. Set aside to soak for 30 minutes. ", "Once soaked, heat the pan contents until just boiling, removing the konbu with a slotted spoon just before the water starts to boil. ", "Add the bonito flakes to the water and boil for 1 minute, then remove the pan from the heat and allow the stock to cool for 4-5 minutes. Strain the dashi through a fine sieve into a clean saucepan and reserve. Keep warm.", "For the miso soup, cook the spinach in a pan of boiling water until wilted, then remove from the water using a slotted spoon and set aside in a bowl to cool. Once the spinach is cool enough to handle, squeeze out any excess moisture from the leaves using your hands. Set aside.", "Add the aburaage to the spinach water and boil for 1-2 minutes to remove any grease. Drain well.", "Push the miso paste through a fine sieve into the dashi and heat until dissolved. Add the drained tofu and spinach and warm through. Serve immediately in bowls."]}, {"isVegetarian": true, "title": "Summer berry and heather honey meringue roulade", "url": "www_bbc_co_uk_food_recipes_summer_berry_and_heather_67533", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_and_heather_67533_16x9.jpg", "ingredients": ["5 free-range egg whites", "275g/9¾oz caster sugar, plus extra for dusting", "50g/1¾oz flaked almonds", "600ml/20fl oz double cream", "100g/3½oz raspberries", "2 tbsp heather honey", "50g/1¾oz strawberries, cut in half", "50g/1¾oz blackberries", "50g/1¾oz raspberries", "1 tbsp heather honey", "sprigs of heather, to decorate (optional)", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "In a large bowl, whisk the egg whites using an electric hand whisk until stiff peaks form when the whisk is removed. Gradually add the sugar, a spoonful at a time. Whisk until very stiff and glossy and all the sugar has been added.", "Spoon the mixture into the prepared tin and smooth the surface. Sprinkle with almonds. Place the tin in the preheated oven and bake for eight minutes, or until golden-brown. Lower the temperature to 160C/325F/Gas 3 and bake for a further 15 minutes, or until crisp.", "Remove from the oven and turn out, almond-side down, onto a sheet of non-stick baking paper dusted with caster sugar. Remove the baking parchment from the base of the cooked meringue and allow to cool.", "For the filling, put the cream and raspberries in a bowl and lightly whip. Spread evenly over the meringue and spoon over the heather honey and most of the blackberries and strawberries. Starting at the long end, roll up the meringue using the paper to help you.", "Decorate the top of the roulade with the reserved berries, heather honey, sprigs of heather (if using) and a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Summer berry shortbread cake", "url": "www_bbc_co_uk_food_recipes_summer_berry_shortbread_93106", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_shortbread_93106_16x9.jpg", "ingredients": ["175g/6oz plain flour, plus extra for dusting", "100g/3½oz unsalted butter, chilled, cut into pieces, plus extra for greasing", "¼ tsp fine sea salt", "40g/1½oz desiccated coconut", "2 tbsp golden caster sugar", "1 free-range egg yolk (reserve the white for the cake)", "½ tsp vanilla extract", "50g/1¾oz raspberries", "50g/1¾oz jam sugar", "175g/6oz unsalted butter ", "150g/5½oz plain yoghurt", "3 free-range eggs", "150g/5½oz plain flour ", "¼ tsp fine sea salt", "2 tsp baking powder", "175g/6oz golden caster sugar", "100g/3½oz desiccated coconut ", "75g/2½oz raspberries ", "75g/2½oz blueberries", "100g/3½oz flaked almonds"], "serves": "Makes 12–15", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 6. Lightly butter and line a 23cm/9in square cake tin with baking paper. ", "For the biscuit base, put the flour, butter and salt in a food processor and pulse to a fine crumb. Add the coconut and sugar and pulse again. Beat the egg yolk with the vanilla and 1–2 tablespoons cold water and add to the food processor with the motor running, to make a soft dough. Press into the prepared tin and flatten using the back of a spoon, pushing the mixture evenly into all the corners. Prick the base using a fork, then cover and chill in the fridge for 10 minutes. ", "Meanwhile, for the jam, put the raspberries and sugar in a saucepan and heat until the sugar has dissolved. Bring to the boil for 5 minutes, or until it reaches the setting point.", "Bake the biscuit base for 15 minutes, or until pale golden-brown. Leave to cool for 2 minutes, then spread with the jam. ", "For the cake, melt the butter in a heavy-bottomed saucepan. Remove from the heat and use a fork to beat in the yoghurt, then the eggs and reserved egg white. ", "Sift the flour, salt and baking powder into a large bowl and stir in the sugar and coconut.", "Pour the wet cake ingredients into the dry ingredients and mix well. Pour over the jammy base, level the top with the back of a spoon and scatter with the berries and flaked almonds. Bake for 40–45 minutes, or until a skewer inserted into the centre comes out clean. Leave to cool in the tin, then turn out and cut into bars."]}, {"isVegetarian": true, "title": "Summer fruit smoothie", "url": "www_bbc_co_uk_food_recipes_summer_fruit_smoothie_22742", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_fruit_smoothie_22742_16x9.jpg", "ingredients": ["225g/8oz fresh blackberries", "225g/8oz fresh raspberries", "225g/8oz fresh blueberries", "1 just-ripe medium banana, broken into pieces", "150ml/¼ pint natural plain yoghurt", "150ml/¼ pint milk", "1 tbsp icing sugar (optional)"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Measure all the ingredients into a food processor and whiz until smooth. Alternatively use a hand-held blender.", "Pour into a tall cool glass and enjoy."]}, {"isVegetarian": false, "title": "Summer berry trifle", "url": "www_bbc_co_uk_food_recipes_summer_berry_trifle_59969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz custard powder", "60g/2¼oz sugar", "2.4 litres/3 pints 4fl oz milk", "5 x 135g/4¾ oz packets strawberry jelly ", "850g/1lb 14oz ready-made jam-filled Swiss roll", "1.5kg/3lb 5oz strawberries, hulled and halved ", "50g/1¾ oz flaked almonds", "1.5 litres/2 pints 14fl oz double cream"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the custard powder and the sugar into a large bowl and add a little of the milk, stir until you have a smooth paste.", "Heat the remaining milk in a large saucepan until it nearly reaches boiling point and pour in the custard powder mixture.", "Stir continuously on a low heat until the custard thickens then set aside to cool.", "To make the jelly, follow the packet instructions, but do not place it into the fridge to set. ", "Cut the Swiss rolls into equal slices and arrange them over the bases of two large deep baking trays. ", "Scatter the strawberries on top of the sponge. Pour the prepared jelly over the fruit. Cover the trays with cling film and leave to set in the fridge for about an hour and a half.", "When the custard has cooled, gently pour on top of the set jelly. ", "Cover with cling film and return the trays to the fridge for a further 30 minutes, or until the custard is lightly set. ", "For the topping, lightly toast the almonds in a dry frying pan over a low heat for 2-3 minutes, or until golden-brown, keeping the almonds moving around the pan frequently to prevent them from burning. Set aside to cool. ", "Whip the cream until it forms soft peaks. Spoon the whipped cream over the custard. Scatter the almonds on top, cover and return to the fridge until ready to serve. "]}, {"isVegetarian": true, "title": "Summer fruit soup with coconut cream and crumble topping", "url": "www_bbc_co_uk_food_recipes_summer_fruit_soup_with_97459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6¼oz unsalted butter", "175g/6¼oz caster sugar", "175g/6¼oz plain flour", "pinch ground cinnamon", "200g/7¼oz icing sugar", "50ml/1¾fl oz brandy  ", "300ml/10½fl oz red wine", "400g/14¼ oz strawberries", "500ml/17½fl oz double cream", "100g/3½oz icing sugar, sifted", "200ml/7¼fl oz coconut milk", "100g/4oz blackberries", "150g/5¼oz raspberries", "150g/5¼oz blueberries", "6 sprigs redcurrants", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper or baking parchment.", "For the crumble topping, rub the butter, sugar and flour together in a bowl until the mixture resembles fine breadcrumbs.", "Sprinkle the mixture onto the lined baking tray, then bake in the oven for 12-15 minutes, or until crisp and golden-brown. Remove from the oven and set aside to cool.", "For the sauce, heat the sugar, brandy and wine in a pan until the sugar has dissolved and the mixture resembles syrup. Set aside to cool. ", "Blend the strawberries to a purée in a food processor. Strain the blended strawberries through a sieve, then fold the strained purée into the syrup until combined. ", "For the coconut cream, whisk the double cream and icing sugar in a large bowl until slightly thickened. ", "Add the coconut milk and continue to whisk until soft peaks form when the whisk is removed. Whisk in additional icing sugar, to taste, to sweeten the mixture.", "To serve, arrange a mixture of the blackberries, raspberries and blueberries into the centre of each of six serving dishes. Spoon the sauce on top, followed by the coconut cream. Sprinkle over the cinnamon crumble. Garnish with the redcurrant sprigs and dust with icing sugar."]}, {"isVegetarian": false, "title": "Summer party gâteau", "url": "www_bbc_co_uk_food_recipes_summer_party_gateau_61495", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_party_gateau_61495_16x9.jpg", "ingredients": ["8 eggs ", "250g/9oz caster sugar", "250g/9oz self-raising flour", "100g/3½oz butter, melted and cooled, plus extra for greasing", "900ml/1½ pints double cream", "400g/14oz raspberries", "300g/10½oz blueberries", "300g/10½oz blackberries", "icing sugar, for dusting"], "serves": "Serves 16", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["This recipe is best started the day before you want to serve it. You will need two 23cm/9in round cake tins with 5cm/2in sides. Preheat the oven to 180C/160C Fan/Gas 4, then grease the tins with butter and line the bases with baking paper.", "To make the sponges, put four of the eggs and half the caster sugar in a bowl and, using an electric hand whisk or food mixer, whisk until thick, pale and fluffy. When you lift the whisk, the batter dropping from it should leave a trail in the mixture below.", "Sift half the flour into the mixture, and gently fold in to combine. Drizzle half the cooled melted butter around the outside of the mixture and carefully fold in before pouring into one of the prepared cake tins.", "To make the second sponge, simply repeat steps two and three, and pour into the second tin.", "Bake both sponges at the same time in the oven for about 30 minutes, or until pale golden-brown, firm in the middle and shrinking away from the sides of the tin. If not baking on the same shelf, you may need to swap the tins around halfway through to ensure you get an even bake.", "Remove from the oven and, after 10 minutes, release from the tins and set aside to cool completely on a wire rack. Remove the lining paper and, using a bread knife, slice each sponge in half horizontally to give four layers in total.", "Whip the cream in a bowl until it forms firm peaks. Reserve 4 tablespoons for decorating the top of the cake, and then divide the remaining whipped cream into three. Divide a mixture of the three different berries into three piles, reserving a handful of each for the top of the cake.", "Place one layer of sponge on a large plate, then spread with a third of the whipped cream, scatter over a third of the mixed berries, making sure they come around the edge of the cream, so they can be seen. Add another layer of sponge on top and repeat until you have three layers, topped with a final layer of sponge.", "To decorate the top, spread the reserved cream in a small circle in the centre of the sponge and arrange the remaining berries on top. Cover carefully with cling film and put in the fridge to settle – for a few hours, but overnight if possible. When you are ready to serve, dust the gâteau with icing sugar and cut into slices."]}, {"isVegetarian": false, "title": "Summer pudding loaf", "url": "www_bbc_co_uk_food_recipes_summer_pudding_loaf_92270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_pudding_loaf_92270_16x9.jpg", "ingredients": ["1kg/2lb 4oz mixed summer berries: blueberries, raspberries, blackberries, redcurrants, blackcurrants", "250g/9oz caster sugar", "1 large unsliced white loaf or thick-sliced white bread (preferably slightly stale)"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Line one 450g/1lb loaf tin with a double layer of cling film.", "Prepare the fruit by removing any leaves and stalks. Place the blueberries, redcurrants and blackcurrants in a pan with the sugar and a couple of tablespoons of water and bring to the boil. Cook for 2-3 minutes, or until the berries have just softened and burst (don't overcook). You don’t need to cook the raspberries or blackberries so just add them to the pan at the end.", "Using a sharp knife, cut the crusts off all sides of the loaf, then cut the loaf into medium-thick slices along the length of the bread, so that you have long slices rather than square slices. ", "Place one slice of bread in the base of the tin, trimming to fit. Place a slice of bread either side of the inside of the tin and cut slices to fit both ends of the tin.", "Spoon a little juice from the cooked berries in the base to make sure that all the bread is well soaked in juice. Add the fruit gradually, making sure the bread soaks up all the juices and becomes red. When the tin is full of fruit, top with bread another slice of bread to seal it.  Spoon over a couple of tablespoonfuls of juice from the berries that are left in the pan. You should have about half the amount of fruit leftover, which is lovely to serve alongside each slice. ", "Cover the top with cling film and place the pudding in the fridge overnight. Place a weight, such as a can of baked beans, on top of the pudding to press the mixture down, this will ensure that the mixture soaks into the bread and the pudding is firm enough to cut.", "To turn out, peel back the cling film, then turn the pudding upside-down onto a plate and remove the cling film. Cut into slices and serve with the remaining berries and juice."]}, {"isVegetarian": true, "title": "Summer pudding with clotted cream", "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_89427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz fresh raspberries", "350g/12oz blackberries", "1 tbsp finely shredded basil", "vegetable oil, for greasing", "6 thin slices white bread", "4 tbsp clotted cream", "100g/3½oz caster sugar, for decoration"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Set aside 100g/3½oz each of raspberries and blackberries for decoration. Mix together the remaining berries. Bruise 200g/7oz of the remaining berries with a fork and stir through the basil. Set aside. ", "Crush the remaining berries and pass through a fine sieve. Reserve the juice and discard the pulp.", "Grease 2 dariole moulds with a little oil and line with cling film (leave enough overhang to cover the top later). ", "Remove the crusts from the bread and discard. Cut out 2 circles to fit the bottom of the moulds and 2 circles to fit the top of the moulds. Cut the rest into rectangles to line the sides of the moulds.", "Dip the small circles of bread in the reserved juice and push into the bottom of the moulds, dip the rectangles into the juice and press firmly around the edges, taking care not to leave any gaps.", "Half fill the moulds with the crushed berries, add a tablespoon of cream and top with any remaining berries. Dip the larger circle in the juice and place on top. Cover in cling film and press down firmly. Chill until ready to serve.", "To make a caramel, heat the sugar in a large non-stick pan until golden-brown. Use a spoon to quickly drizzle the caramel over a knife-sharpening steel (CAUTION: sugar gets very hot). Pull the strands of caramel together to make a sugar ball. Repeat to make a second sugar ball.", "Turn out the summer puddings from the moulds, remove the cling film and put onto plates. Spoon over any remaining juice, decorate with the reserved berries and serve with a spoonful of clotted cream and a sugar ball."]}, {"isVegetarian": true, "title": "Summer pudding with berries and white chocolate cream", "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_98588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb raspberries", "350g/12oz mixed berries ", "150g/5½oz caster sugar", "small sherry glass of framboise (raspberry liqueur)", "knob of butter", "8-10 slices  white chocolate and raspberry bread, crusts removed (or other sweet bread)", "100g/3½oz white chocolate ", "250ml/9fl oz double cream, lightly whipped", "250g/9oz mascarpone ", "1 dessertspoon icing sugar, plus extra to decorate"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the fruit, sugar and liqueur in a saucepan and gently cook for 5-8 minutes, or until the liquid has reduced a little. Remove from the heat.  ", "Lightly butter a 1 litre/1¾ pint  pudding basin.", "Line the bowl carefully with most of the bread using small pieces to cover any holes in the side or bottom, then pour in nearly all of fruit (leave a little cupful aside for garnish). Cover with a lid of bread and then use a dish or lid to press down firmly (you could use two dishes to get some weight). Set aside in the fridge overnight.", "Melt the white chocolate gently in a bain marie or a bowl suspended over a pan of gently simmering water (do not let the bottom of the bowl touch the water). Allow to cool slightly and then stir in the cream. Add the mascarpone and mix in the icing sugar. ", "Turn the pudding onto a dish, drizzle with the leftover fruit and serve with the white chocolate cream."]}, {"isVegetarian": false, "title": "Summer salad canapés with Asian-style dressing", "url": "www_bbc_co_uk_food_recipes_summer_salad_with_72489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 baby courgette, trimmed, julienned", "2 carrots, peeled, julienned", "3 celery stalks, trimmed, julienned", "1 red pepper, deseeded, julienned", "1 yellow pepper, deseeded, julienned", "½ beetroot (preferably Chioggia), peeled, julienned", "2 baby cucumbers, trimmed, julienned", "1 baby sweetcorn, julienned", "2 spring onions, trimmed, thinly sliced", "few sprigs fresh coriander, finely chopped", "salt and freshly ground black pepper", "1 garlic clove, crushed", "1 red chilli, deseeded, finely chopped", "1 tbsp Thai fish sauce", "1 tbsp rice wine vinegar", "1 tsp demerara sugar", "2 tbsp freshly squeezed lime juice", "1 tbsp extra virgin olive oil", "500ml/18fl oz vegetable oil", "2-3 large courgettes, trimmed, thinly sliced using a mandoline", "1-2 tbsp demerara sugar", "1 small onion, thinly sliced using a mandoline"], "serves": "Makes 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the salad, mix together all the vegetables and herbs in a bowl and season with salt and pepper. ", "For the dressing, whisk together all the ingredients with 1 tablespoon water until the sugar dissolves.", "Drizzle the dressing over the salad and toss to coat the vegetables.", "Heat the oil in a heavy-based, deep-sided saucepan to 135C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) ", "Sprinkle the courgette slices with demerara sugar and fry, in batches if necessary, for 1-2 minutes, or until golden-brown on each side. Transfer to kitchen paper to drain.", "Carefully lower the onion slices into the hot oil and fry for 1 minute, or until crisp and golden-brown. Transfer to kitchen paper to drain. Sprinkle with salt.", "To serve, top each slice of fried courgette with a teaspoonful of the dressed salad, then top the salad with a pinch of the fried onion slices."]}]