[{"isVegetarian": false, "title": "Braised steak with gravy", "url": "www_bbc_co_uk_food_recipes_braised_steak_with_gravy_24508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_steak_with_gravy_24508_16x9.jpg", "ingredients": ["4 braising steaks (about 200g/7oz each)", "3 tbsp sunflower oil", "1 medium onion, halved and cut into 12 wedges", "1 garlic clove, crushed", "500ml/18fl oz beef stock made with 1 beef stock cube, or 500ml/18fl oz fresh beef stock", "1 tbsp tomato purée", "1 tbsp chopped fresh thyme, or ½ tsp dried thyme", "1 bay leaf", "1 tsp cornflour", "½ tsp English mustard powder", "salt and freshly ground black pepper", "Homemade chips, (see recipe in link)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. ", "Trim off any hard fat from the beef and season on both sides with salt and lots of freshly ground black pepper. ", "Heat a tablespoon of the oil in a large non-stick frying pan.", "Fry the steaks, two at a time, over a medium-high heat for a couple of minutes on each side, or until nicely browned, then transfer to a large flameproof casserole dish. Add a little more oil to the pan if necessary.", "Return the pan to the hob and reduce the heat. Add the remaining oil and gently fry the onion for five minutes, or until softened and lightly browned, stirring regularly. ", "Stir in the garlic, cook for one more minute, then transfer the onion and garlic to the casserole dish. ", "Pour over the stock and add the tomato purée, thyme and bay leaf. ", "Bring to the boil, then cover the casserole and transfer carefully to the oven. Cook for 1¼-1½ hours, or until the beef is very tender.", "Mix the cornflour and mustard powder in a small bowl and stir in a tablespoon of cold water until smooth. Remove the lid from the casserole dish and stir in the cornflour mixture. Season to taste with salt and freshly ground black pepper.", "Place the casserole over a medium-high heat and simmer for 2-3 minutes, or until the gravy reduces and becomes thickened and glossy, stirring regularly. ", "Transfer the steaks to four warmed plates and spoon over the gravy. Serve with chips."]}, {"isVegetarian": false, "title": "Braised sweetcorn and wood pigeon", "url": "www_bbc_co_uk_food_recipes_braised_sweetcorn_and_80968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 sweetcorn cobs, husks removed", "4 wood pigeon crowns", "salt and pepper", "2 tbsp vegetable oil", "20 baby onions, peeled", "1 carrot, cut into strips", "2 rashers smoked streaky bacon, chopped", "300ml/10fl oz sweetcorn stock (from above)", "100g/3½oz cooked sweetcorn kernels (from the sweetcorn stock)", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweetcorn stock, preheat the oven to 200C/400F/Gas 6.", "Place the sweetcorn on a baking tray and cook in the oven for 20 minutes. Set aside to cool.", "When the sweetcorn is cooled, stand the cobs upright on a chopping board, and cut down as close as possible to the core to remove the kernels. Set aside the kernels and cut the cores of the sweetcorn in half and place them in a large saucepan. Cover them with the water and bring to the boil. Simmer for 20 minutes, then strain into a jug and set aside, reserving both the stock and the kernels.", "For the braised sweetcorn and wood pigeon, reduce the oven temperature to 160C/320F/Gas 3.", "Season the wood pigeon with salt and pepper and heat a large frying pan.", "When the pan is hot, add one tablespoon of the oil and place the pigeons into the hot pan. Cooked until coloured all over, and then place them in the oven for 10-12 minutes. The pigeons are done when the thickest part of the thigh is pierced with a skewer and the juices run clear. ", "When cooked, place the pigeon crowns on a plate, cover and set aside to rest for 10-12 minutes.", "Bring a saucepan of water to the boil and blanch the onions and carrots for 2-3 minutes. Drain and refresh in ice-cold water. Remove the onions and carrots and place on a plate lined with kitchen roll.", "Heat a large frying pan and add the remaining tablespoon of oil. Once hot, add the bacon and cook until crisp and golden-brown. Add the onions and cook for a further two minutes.", "Cover the bacon and onions with the sweetcorn stock and bring to the boil. Add the sweetcorn kernels and carrots and simmer for five minutes.", "Add the butter, season with salt and pepper and set aside in a warm place while you remove the pigeon meat from the carcass.", "To serve, pour the sweetcorn and bacon soup into a large serving bowl and arrange the pigeon meat on top."]}, {"isVegetarian": false, "title": "Braised turbot in beer with bacon, shallots and peas", "url": "www_bbc_co_uk_food_recipes_braised_turbot_in_beer_52606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 rashers streaky smoked bacon ", "1 tbsp light rapeseed oil", "100g/3½oz unsalted butter", "20 small shallots, peeled and left whole", "12 garlic cloves, peeled and left whole", "1 sprig rosemary", "100ml/3½fl oz red wine vinegar", "750ml/26fl oz beer", "500ml/18fl oz fish stock", "1 x 1.5kg/3lb 5oz turbot, fins trimmed, split down the centre and cut into steaks with the bone in", "200g/7oz peas fresh or frozen", "3 tbsp chopped fresh flatleaf parsley, plus extra for garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the grill and cook the bacon until crisp. Set aside to cool and then chop into small pieces. ", "To make the braising liquid, heat a large pan and add the oil and 75g/2½oz of the butter. ", "When the oil is hot, add the shallots and the garlic. Cook for four minutes and then add the rosemary and cook for a further two minutes so the garlic and shallots begin to colour. ", "Add the vinegar and cook until reduced in volume to almost nothing. ", "Add the beer and reduce in volume again to half the amount.", "Add the fish stock and bring to the boil. Skim off any impurities that rise to the top and simmer for five minutes. ", "To cook the fish, place the portions into the beer liquor and cover with foil, with the foil touching the surface of the liquid. Cook on a low heat for 12 minutes. Remove the foil and carefully turn the fish and add the peas and parsley. Cook for one minute and remove from the heat. ", "Warm a large serving platter, then carefully remove the fish from the beer and place it onto the platter.", "Heat the braising liquor and whisk in the remaining 25g/1oz butter. Season to taste with salt and pepper.", "To serve, spoon some of the liquor over the fish and sprinkle over the crisp bacon and a little more parsley."]}, {"isVegetarian": true, "title": "Braised bean curd with garlic and pepper", "url": "www_bbc_co_uk_food_recipes_braisedbeancurdwithg_8815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cloves garlic, crushed", "2 tsp coriander root, chopped", "2 tsp light soy sauce", "1 tsp sugar", "4 tbsp groundnut oil", "1 tsp sesame oil", "1 packet firm tofu (bean curd), cut in half horizontally, then each piece cut into 8 triangles (16 triangles in total)", "6 tbsp groundnut oil", "150ml/5fl oz vegetable stock", "2 tbsp light soy sauce", "1 tbsp tomato purée", "1 tbsp rice or white wine vinegar", "1 heaped tsp arrowroot", "1 tsp coarsely ground black pepper", "2 tsp sesame oil", "For garnish:", "½ cucumber, halved and sliced thinly", "4 spring onions, shredded"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the marinade, grind all the ingredients together in a pestle and mortar to form a paste. ", "Place the beancurd triangles in a flat dish and cover with the marinade. Leave for at least 30 minutes (or overnight). ", "Heat the oil and fry the marinated beancurd until golden brown on both sides. Remove from the pan and drain on kitchen paper. ", "Tip out any excess oil remaining in the pan, then place the vegetable stock, soy sauce, tomato purée and vinegar into the pan together with the arrowroot which should be made into a paste with a little water. Bring to the boil, stirring to thicken, and return the beancurd to the pan to heat through. ", "Remove the pan from the heat and stir in the black pepper and sesame oil.", "Tranfer to a serving dish and garnish with cucumber and spring onions."]}, {"isVegetarian": false, "title": "Braised beef short ribs with salsify and bashed neeps", "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_85339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz beef short ribs, cut through the bone to 10cm/4in lengths ", "salt and freshly ground black pepper", "2 tbsp flour", "2 onions, peeled, roughly chopped", "2 celery sticks, roughly chopped", "1 carrot, peeled, roughly chopped", "1 tsp tomato purée ", "330ml/11½fl oz Innis and Gunn beer, or similar bottle ale or beer", "2 litres/3½ pints beef stock", "1 bay leaf", "few sprigs fresh thyme", "3 garlic cloves, peeled, roughly chopped", "5 black peppercorns", "6-8 salsify sticks, peeled, cut at an angle into 2.5cm/1in pieces", "salt and freshly ground black pepper ", "25g/1oz butter", "1 tbsp chopped fresh parsley", "400g/14oz turnips or swede, peeled, cut into chunks", "50g/2oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, preheat the oven to 220C/430F/Gas 7.", "Season the beef ribs with salt and freshly ground black pepper and dust with half of the flour. Place them in a roasting tray with the onion, celery and carrot and roast in the oven for 30-40 minutes, turning every so often, until nicely browned.", "When cooked, transfer the vegetables and ribs to a heavy-bottomed saucepan, leaving the fat and juices behind, and set aside.", "Put the roasting tray with the fat and juices over a low heat.  Add the remaining flour and the tomato purée and cook for one minute, stirring. Gradually add the beer and beef stock, stirring well to avoid lumps forming. Bring to the boil.", "Pour the beer gravy into the pan with the ribs and vegetables and place over a medium heat. Add the bay leaf, thyme, garlic and peppercorns. Season with salt and freshly ground black pepper and cover.  Bring to the boil, then lower the heat and simmer gently for 1½-2 hours, or until the meat is tender: it should be almost falling off the bone without being too soft.", "Remove the ribs and vegetables with a slotted spoon, discarding the vegetables. Continue simmering the sauce until it reduces and thickens to a rich gravy-like consistency. You can add a little cornflour mixed in water if it's not thick enough.", "For the salsify, place the salsify in a saucepan with salted water and bring to the boil. Lower the heat and simmer for 6-8 minutes, until tender.", "Drain and toss in the butter and parsley and season with salt and freshly ground black pepper to taste.", "For the bashed neeps, place the turnips or swede into a saucepan of water and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until tender.", "Drain and return to the pan. Add the butter. Mash the turnips to a purée with a potato masher then season with salt and freshly ground black pepper.", "To serve, reheat the ribs in the sauce. Serve with a spoonful of bashed neeps, the salsify and a generous spoonful of sauce."]}, {"isVegetarian": false, "title": "Braised beef", "url": "www_bbc_co_uk_food_recipes_braisedbeef_10377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1¾ lb beef topside or round shoulder", "20ml/¾fl oz oil", "100g/3½oz mirepoix - see below", "60g/2oz bacon trimmings, blanched", "1 garlic clove, with skin on", "200g/7oz fresh tomatoes, cut in quarters ", "salt,  pepper", "500ml/17fl oz  red wine", "500ml/17fl oz brown stock", "a little cornflour", "carrots, baby leek, pearl onions ", "mange tout, blanched", "button mushrooms", "1 carrot", "fresh thyme", "fresh rosemary", "1 small onion", "1 stick celery", "1 tbsp tomato purée"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the meat with salt and pepper.", "Brown the meat in oil. Remove the meat from the pan.", "Add the mirepoix ingredients to the pan along with the bacon, garlic, tomatoes and purée to the pan. Cook till softened.", "Add the brown stock to the pan and stir. Reduce the liquid until it is a syrupy consistence.", "Return the meat to the pan. Deglaze the meat with the wine or marinade.", "Cover the pan and braise the meat until tender 180C/350F/Gas 4 for approximately 1½hrs turning occasionally. ", "Remove the meat from the pan. Reduce the sauce and if necessary bind with cornstarch. ", "Strain the sauce and skim the fat. Season to taste adding a little more of the brown stock.", "Place the meat on a serving dish. Pour a small quantity of sauce over the carved meat before serving.", "Garnish with the blanched carrots, baby leek, pearl onions, mange tout, button mushrooms fried in a little butter with the remaining bacon."]}, {"isVegetarian": false, "title": "Braised beef short ribs with horseradish mash", "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_93391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2kg/4lb 4oz short beef ribs", "2 carrots, peeled, cut into pieces", "1 large onion, peeled, thickly sliced", "5 garlic cloves, peeled", "2-3 sprigs fresh thyme", "400g/14oz canned chopped tomatoes", "350ml/12fl oz red wine", "200ml/7fl oz beef stock", "salt and freshly ground black pepper", "2kg/4lb 4oz potatoes, peeled, cut into large pieces", "110g/4oz butter", "200ml/7fl oz milk", "2-4 tsp creamed horseradish ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, preheat the oven to 170C/325F/Gas 3.", "Heat the oil in a large roasting tray over a medium to high heat. Add the beef ribs and fry, turning regularly, until browned on all sides.", "Add the carrots, onion and garlic and stir until coated in the oil and pan juices.", "Add the thyme sprigs, then pour in the chopped tomatoes, red wine and beef stock and mix well to combine. Bring the mixture to the boil, then transfer to the oven and cook, uncovered, for 2-2½ hours, or until the sauce has thickened and the meat is falling from the bones. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the horseradish mash, boil the potatoes in a pan of salted water for 15-18 minutes, or until tender. Drain well then return to the pan.", "Return the pan to the heat for a few seconds to drive off any excess moisture, then remove from the heat. Mash the potatoes until smooth using a potato masher or ricer, then beat in the butter and milk, using a wooden spoon. ", "Stir in the creamed horseradish until well combined, then season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the beef ribs equally among four serving plates. Spoon over the cooked vegetables and sauce. Place a dollop of mash alongside each serving."]}, {"isVegetarian": false, "title": "Braised belly of pork", "url": "www_bbc_co_uk_food_recipes_braisedbellyofpork_11369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange,  peel only", "10 juniper berries ", "1 star anise ", "10g/½oz peppercorns ", "5cm/2½in piece ginger, peel only", "1 x 1kg/2¼lb  piece of belly pork ", "1 onion, cut in half, each half studded with 3 cloves", "6 shallots, peeled", "4 carrots, cut in half lengthways", "8 garlic cloves, peeled", "2 large leeks, cut into 5cm/2in pieces", "1 tsp chicken bouillon", "1litre/1¾pt chicken stock", "1 bouquet garni (parsley stalks, thyme, bay leaf and celery bound with leek)", "3litres/5¼pt water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the orange peel, juniper berries, star anise, peppercorns and ginger peel in a piece of muslin cloth and secure with string.", "Place the muslin parcel and the remaining ingredients into a saucepan of water and bring to the boil, then reduce the heat until the mixture is simmering and cook for 2-3 hours. Remove from the heat and set aside to cool.", "Once cool,  remove the belly of pork from its cooking liquid and place onto a chopping board.", "Remove the excess fat and cut into slices. ", "Strain the remaining mixture through a sieve, reserving the liquid and vegetables. ", "Cut the vegetables into smaller pieces and place back into the strained liquid along with the sliced belly of pork.  ", "Serve with crushed new potatoes."]}, {"isVegetarian": true, "title": "Braised cabbage with Shetland black potatoes", "url": "www_bbc_co_uk_food_recipes_braisedcabbagewithsh_79107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2 Shetland potatoes, chopped into 1cm cubes", "200g/7oz savoy cabbage, shredded", "3 sprigs fresh thyme", "handful fresh coriander", "1 lemon, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Add the potato and cook for six minutes, until golden and soft.", "Add the savoy cabbage and thyme sprigs and sauté for a further four minutes.", "Add the coriander and lemon juice and stir in gently.", "To serve, place in a large bowl."]}, {"isVegetarian": false, "title": "Braised chicken wings and seared scallops with hazelnuts", "url": "www_bbc_co_uk_food_recipes_braisedchickenwingsa_93748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken wings, tips removed", "salt and freshly ground black pepper", "50g/2oz butter", "1 small onion, peeled, finely diced", "1 medium carrot, peeled, cut into small dice", "1 celery stick, cut into small dice", "110ml/4fl oz white wine", "500ml/18fl oz chicken stock", "1 tsp fresh thyme leaves", "50g/2oz hazelnuts, toasted, finely chopped", "2 tsp olive oil", "8 medium scallops", "1 lemon, juice only", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the braised chicken wings, season the chicken wings, to taste, with salt and freshly ground black pepper.", "Heat the butter in a frying pan until foaming and fry the chicken wings, skin-side down, for 2-3 minutes, or until golden-brown. Remove from the pan and set aside.", "Add the onion, carrot and celery to the pan and fry for 2-3 minutes, or until softened. ", "Pour in the white wine, bring the mixture to the boil and cook until the volume of the liquid has reduced by half. ", "Return the chicken wings to the pan, pour over the chicken stock and bring to the boil. Reduce the heat and simmer for 30-40 minutes. Remove the pan from the heat and set aside to cool.", "Once cooled, remove the chicken wings from the pan, remove the wing bones and chill the meat in the fridge.", "For the scallops, heat the olive oil in a frying pan and fry the scallops for 1 minute, then carefully turn the scallops over and fry for 30 seconds. Remove the scallops from the pan and season to taste, with lemon juice and salt. ", "Add the chicken wings to the pan and fry for 2-3 minutes or until the skin is crisp.", "To serve, reheat the vegetables and stock and add the thyme and hazelnuts.", "Place 2 chicken wings and 2 scallops into each of 4 serving bowls and spoon of the stock and vegetables."]}, {"isVegetarian": true, "title": "Braised chestnuts in red wine gravy", "url": "www_bbc_co_uk_food_recipes_braisedchestnutsinre_8862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["For approximately 1 pint of gravy:", "170g/6oz dried chestnuts, soaked in cold water overnight ", "85g/3oz carrots, cut in half ", "85g/3oz celery, cut in half ", "85g/3oz leeks, cut in half ", "1 small onion, peeled and  cut in half ", "1 tsp crushed garlic ", "2 bay leaves", "2 cloves", "1 tsp juniper berries", "1 tsp black peppercorns", "sprig fresh thyme", "sprig fresh parsley", "2 tbsp butter or sunflower oil ", "570ml/1 pint water ", "570ml/1 pint red wine ", "2 tsp yeast extract ", "2 tbsp cornflour ", "1 tbsp tomato pureé"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Drain and rinse chestnuts, remove loose skins and discard any chestnuts with suspicious-looking holes. ", "Place chestnuts, carrot, celery, leek, onion, garlic, loose spices and butter/oil in a 1.5 litre/3 pint capacity saucepan. Fry together until the mixture starts to brown. Add water and wine, bring to the boil and simmer with lid on for 90 minutes. The chestnuts should be tender but not fall apart. ", "Strain stock into a clean pan, pick out chestnuts from vegetables and save as a garnish. Discard remaining vegetable mixture. ", "Mix yeast extract, cornflour, and tomato pureé to a paste with 4 tbsp cold water and stir into the hot chestnut stock. Bring to the boil stirring frequently, simmer for 5 minutes until thickened.", "Serve with a nut roast."]}, {"isVegetarian": false, "title": "Braised lemon and honey chicken with feta salad", "url": "www_bbc_co_uk_food_recipes_braisedchickenwithle_83777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1.6 kg/3lb 8oz chicken, cut into 8 pieces", "1 red onion, sliced", "12 garlic cloves, peeled but left whole", "1 lemon, cut into chunks", "175ml/6fl oz chicken stock", "125g/4½ oz honey", "small handful fresh oregano leaves", "400g/14oz tin chickpeas, rinsed and drained", "150g/5oz feta cheese, crumbled", "small handful fresh flatleaf parsley", "2 Lebanese cucumbers, chopped", "1 green pepper, core and seeds removed, chopped", "50g/2oz black olives, pitted and halved ", "3 tbsp olive oil", "1 tbsp lemon juice", "sea salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat a large frying pan over high heat, add the oil and chicken and cook for five minutes until golden.  ", "Remove and set aside.", "Reduce the heat to medium-high, add the onion and cook for one minute.", "Add the garlic and cook for one minute.", "Return the chicken to the pan with the lemon, chicken stock and honey, reduce the heat, cover the pan and simmer for 20 minutes or until the chicken is cooked through.", "Lift out the chicken and put on a baking tray.", "Increase the heat under the sauce, and simmer, uncovered for another 15 minutes to thicken.", "Place the chicken under a hot grill for five minutes until crisp.  ", "Arrange the chicken on a platter, drizzle with the sauce and sprinkle with oregano.", "For the salad, gently mix together the chickpeas, feta, parsley, cucumber, green pepper and olives in a large bowl. ", "Whisk the olive oil and lemon juice and season with salt and pepper.", "Toss the dressing with the salad. ", "Serve."]}, {"isVegetarian": false, "title": "Braised lamb shanks with pearl barley and root vegetables", "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_88343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "4 lamb shanks, trimmed of any excess fat", "2 tbsp pearl barley", "300ml/10fl oz lamb stock (or water)", "1 fresh thyme sprig", "½ tsp dried thyme", "1 sprig fresh parsley", "1 tsp salt", "150g/6oz carrots, roughly chopped", "1 large leek, cut into eight equal pieces", "4 small potatoes, peeled, quartered", "2 small onions, quartered", "salt and freshly ground black pepper ", "4 heaped tbsp flatleaf parsley leaves, blanched and refreshed in cold water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.  ", "Heat the oil in a large frying pan over high heat. Add the lamb shanks and fry, turning occasionally, until golden-brown on all sides.", "Transfer the lamb shanks to a large flameproof casserole or ovenproof pan with a lid, and add the barley, stock or water, herbs, and salt. Cover tightly with foil and then with the lid, and cook in the oven for 1½ hours.", "Remove the casserole from the oven, add the vegetables and a little more water if needed. Season, to taste, with salt and freshly ground black pepper, then re-cover the casserole, and return it to the oven for another hour.", "Remove the casserole from the oven and check that the lamb is moist and almost falling off the bone. If you think that it's not quite ready, return it to the oven for another 15 minutes and check again.", "Transfer the lamb shanks from the cooking pot to a warmed serving platter and cover with kitchen foil while you finish the braised vegetables.", "Place the casserole over a medium heat and bring the liquid to the boil. Reduce the heat and simmer. Add more water if required to provide a nice gravy.", "Add the blanched parsley leaves and season, to taste, with salt and freshly ground black pepper.", "To serve, ladle the braised vegetables onto warmed plates and place a shank on top of each portion."]}, {"isVegetarian": false, "title": "Braised lamb shanks with flageolet beans", "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_91429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks", "salt and freshly ground black pepper", "1 tbsp olive oil", "350ml/12fl oz red wine", "1 onion, cut into quarters", "1 head garlic, cut in half horizontally", "2 sprigs fresh rosemary", "5 anchovy fillets", "1 litre/1¾ pints hot beef stock", "50g/2oz butter", "75g/3oz butter", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp chopped fresh rosemary", "4 tomatoes, skins and seeds removed, chopped", "400g/14oz canned flageolet beans, drained and rinsed", "3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb shanks, preheat the oven to 150C/300F/Gas 2.", "Season the lamb shanks with salt and freshly ground black pepper.", "Heat the oil in a large casserole over a medium heat. When the oil is hot, add the lamb shanks and fry on all sides until browned all over.", "Add the red wine and bring to a simmer. Continue to simmer until the volume of liquid has reduced by a third.", "Add the onion, garlic, rosemary and anchovy fillets and stir well to combine.", "Add enough of the hot beef stock to just cover the lamb (the bones should be protruding from the surface of the liquid). Return the mixture to a gentle simmer.", "Transfer the casserole to the oven and cook, uncovered, for three hours, turning the lamb shanks occasionally (about once every 45 minutes).", "Meanwhile, for the flageolet beans, heat half of the butter in a frying pan over a medium heat. When the butter is foaming, add the onion, garlic and rosemary and fry for 2-3 minutes, or until just softened.", "Add the tomatoes and cook for a further 2-3 minutes, or until they have broken down slightly. ", "Add the drained flageolet beans and stir until heated through. Season, to taste, with salt and freshly ground black pepper.  ", "Add the remaining butter and stir until the butter has melted. Add the parsley and stir well to combine.", "When the lamb shanks are cooked through, remove them from the cooking liquid and set aside on a warm plate.", "Return the casserole to the hob and bring the cooking liquid to the boil. Boil for 4-5 minutes, or until it has reduced slightly.", "Strain the reduced cooking liquid through a fine sieve into a clean saucepan, then season, to taste, with salt and freshly ground black pepper. Add the butter and whisk until it has melted and the sauce is glossy.", "To serve, divide the flageolet beans equally among four serving plates. Place one lamb shank on top of each. Drizzle the reduced sauce over and around the lamb shanks."]}, {"isVegetarian": false, "title": "Braised lemongrass-skewered plaice with creamy tomato and tarragon sauce and spinach", "url": "www_bbc_co_uk_food_recipes_braisedlemongrassske_89243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 plaice fillets", "salt and freshly ground black pepper", "2 lemongrass stems", "2 shallots, chopped", "2 garlic cloves, lightly crushed", "2 tomatoes", "50g/2oz butter", "110ml/4fl oz white wine", "175ml/6fl oz fish stock", "110ml/4fl oz double cream, lightly whipped", "2 sprigs fresh tarragon, leaves only, roughly chopped", "300g/10oz baby spinach"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Season the plaice with salt and freshly ground black pepper, then roll up like cigars. Cut one of the lemongrass stalks lengthways into four to create skewers and push a skewer through each plaice roll to secure.", "Butter a small ovenproof dish and add the shallots and garlic.", "Blanch the tomatoes for one minute in boiling water, then remove the skins and cut into quarters. Reserve the skins.", "De-seed the tomatoes and place the seeds and skin into the buttered dish with the shallots and garlic.", "Cut the tomato quarters into very small cubes and set aside.", "Heat a frying pan until hot and add half the butter and all the plaice rolls. Cook for one minute on each side, until just golden-brown. Place the plaice rolls into the dish and pour over the white wine and fish stock.", "Cover the dish with kitchen foil and place into the oven to cook for 7-10 minutes, until the fish is just cooked through.", "Remove from the oven and remove the plaice from the dish and set aside in a warm place.", "Pour the cooking liquid from the dish through a sieve into a clean frying pan. Simmer until reduced in volume by half.", "Add the reserved tomato pieces, the whipped cream, tarragon and the remaining stalk of lemongrass and warm through. Season with salt and freshly ground black pepper.", "Heat a separate frying pan until hot. Add the remaining butter and all of the spinach and cook until the spinach has just wilted down.", "To serve, place a spoonful of spinach into the centre of each of two plates. Top each with two rolls of plaice and spoon over the sauce."]}, {"isVegetarian": true, "title": "Braised lentils", "url": "www_bbc_co_uk_food_recipes_braisedlentils_89207", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "100g/3½oz brown lentils, rinsed", "1 bay leaf", "1 onion, chopped", "1 fresh red chilli, chopped", "400g/14oz tinned plum tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pot of salted water to the boil and add one tablespoon of the olive oil. Add the lentils and bay leaf and cook for 15 minutes, or until the lentils are tender. Drain well and set aside. ", "Heat the remaining oil in a frying pan and fry the onion for 5-6 minutes, or until the onion is soft and golden. Stir in the chopped chilli and cook for a further 1-2 minutes, then add the drained lentils and the tinned tomatoes with all of their juice. Season with salt and freshly ground black pepper, then lower the heat and allow to simmer gently for ten minutes.", "Spoon into serving bowls and serve immediately."]}, {"isVegetarian": false, "title": "Basic braised mince", "url": "www_bbc_co_uk_food_recipes_braisedmince_91963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedmince_91963_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "3 onions, chopped", "6 garlic cloves, chopped", "1 tsp chopped fresh thyme", "1 tsp chopped fresh rosemary", "1 kg/2¼lb beef mince ", "400g tin chopped tomatoes", "1 tbsp Worcestershire sauce", "3 beef stock cubes"], "serves": "Makes 2 x 1kg/2lb 4oz batches of mince", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the vegetable oil in a large pan over a high heat. Add the onions, garlic and herbs and fry for 3-4 minutes, or until softened and golden-brown. Turn off the heat and set the pan aside.", "Heat half a tablespoon of the remaining oil in a separate pan over a medium heat. Add a third of the beef mince and fry for 4-5 minutes, or until browned.", "Transfer the browned mince to the pan containing the onions, garlic and herbs. Repeat the process twice more with the remaining oil and the remaining batches of mince. (Overloading the pan will not speed things up because the pan will lose heat, so take your time.)", "Return the pan containing the cooked mince and vegetables to a medium heat. Add the tinned tomatoes and Worcestershire sauce and stir the mixture well to combine. Bring the mixture to a simmer.", "Meanwhile, crumble the stock cubes into a large heatproof jug and add 1 litre/1¾ pints of boiling water. Stir until the stock cubes have dissolved. Add the stock to the beef and bring to a simmer. Simmer for 1 hour, uncovered, or until the volume of liquid has reduced slightly and the sauce has thickened.", "The braised mince can be eaten straightaway, served with rice or spaghetti. See the tips sections for other ways to use the mince. "]}, {"isVegetarian": false, "title": "Braised pork cheeks with ginger carrots and Jersey Royal potatoes", "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_91132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 pork cheeks, trimmed of all fat and sinew", "salt and freshly ground black pepper ", "2 tbsp olive oil", "1 onion, chopped", "1 carrot, chopped", "50g/2oz ginger, chopped", "1 sprig fresh thyme", "2g coriander seeds, lightly crushed", "250ml/9fl oz ginger beer", "1 litre/1 pint 15¼fl oz chicken stock", "500g/1lb 2oz baby carrots, leaf bases left on", "1 tsp ground ginger", "1 tbsp honey ", "25g/1oz butter", "300g/11oz Jersey Royal potatoes, scrubbed", "25g/1oz butter"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork cheeks, season the pork cheeks with salt and freshly ground black pepper, to taste.", "Heat a deep frying pan until hot, add half of the oil and the cheeks and fry on both sides until golden-brown. Remove the cheeks from the pan and set aside.", "Add the other tablespoon of oil to the pan, then add the onion, carrot, ginger, thyme and coriander seeds and cook over a medium heat until golden-brown.", "Pour in the ginger beer and cook until the liquid has reduced to a syrupy glaze; then lay the cheeks on top of the vegetables.", "Pour over the chicken stock to cover, bring to the boil, then reduce the heat and simmer for one hour until the cheeks are tender. Remove the cheeks from the pan and set aside.", "Pass the braising liquid through a sieve into a clean pan and return to the heat. Simmer until thickened, then add the cheeks and mix to cover the cheeks in the glaze.", "For the ginger carrots, bring a pan of salted water to the boil, add the carrots and cook for two minutes, or until just tender. Drain and set aside.", "Heat a frying pan until hot, add the ground ginger and honey and bring to the boil.", "Whisk in the butter, add the cooked carrots and fry for one minute, or until golden-brown.", "Bring a pan of salted water to the boil, add the Jersey Royals and cook for 4-7 minutes, or until tender. Drain the potatoes, return to the pan and add the butter. Stir to coat.", "To serve, share the glazed cheeks among four plates, place the carrots alongside and pour any remaining sauce around the pork. Place the Jersey Royals on the side."]}, {"isVegetarian": false, "title": "Braised pork cheeks with polenta and squid", "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_93223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 pork cheeks, fat and sinew removed", "2 tbsp olive oil", "50ml/2fl oz red wine vinegar", "1 onion, peeled, chopped", "2 carrots, peeled, chopped", "150ml/5fl oz white wine", "1 tsp ground ginger", "1 tsp ground coriander", "1 tsp ground cinnamon", "1 tsp mixed spice", "2 star anise", "2 tomatoes, chopped", "1 garlic clove, peeled", "1 sprig fresh thyme", "1 bay leaf", "2 tbsp honey", "1 tbsp soy sauce", "1 litre/1¾pt chicken stock", "500ml/17½fl oz milk", "500ml/17½fl oz chicken stock", "175g/6oz quick-cook polenta", "25g/1oz grated parmesan", "25g/1oz unsalted butter", "salt and freshly ground black pepper", "25g/1oz butter", "200g/7oz curly kale", "1 tbsp olive oil", "1 medium squid, cleaned, scored, cut into triangles", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the pork cheeks, to taste, with salt and freshly ground black pepper.", "Heat one tablespoon of the olive oil in a non-reactive frying pan over a medium heat, and fry the pork cheeks for 4-5 minutes, or until browned on all sides. Remove the pork from the pan and set aside.", "Carefully drain the fat from the pan add the vinegar, scraping up any browned bits with a wooden spoon to deglaze. Remove from the heat.", "Heat the remaining olive oil in a frying pan and fry the onions and carrots for 2-3 minutes, or until softened.", "Add the white wine and spices and continue to cook until the volume of the mixture has reduced by half. ", "Place the pork cheeks and pan juices into the pan and add the remaining pork cheek ingredients. Bring the mixture to the boil, then transfer to the oven to cook for 1½-2 hours, or until the pork cheeks are tender.", "Remove the pork cheeks from the pan and set aside, then strain the cooking mixture through a sieve. Reserve the liquid and discard the vegetables.", "Cook the pork cheeks and reserved cooking liquid in a saucepan for 4-5 minutes, or until the liquid has reduced slightly and the pork cheeks are sticky and glazed.", "Meanwhile, for the polenta, heat the milk and stock in a saucepan and bring to the boil. Slowly whisk in the polenta and simmer for 4-5 minutes.", "Stir in the parmesan and butter and season, to taste, with salt and freshly ground black pepper.", "To serve, heat the butter in a frying pan and fry the kale for 4-5 minutes, or until wilted and tender. Heat the olive oil in a frying pan and fry the squid for 1-2 minutes, or until just cooked. Season, to taste, with lemon juice and salt and freshly ground black pepper. ", "Spoon some polenta onto each of 4 serving plates, top with the pork cheeks and squid and spoon the kale alongside."]}, {"isVegetarian": true, "title": "Braised red cabbage", "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_2528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium red cabbage, quartered, cored and sliced", "2 red onions, peeled and sliced", "80g/3oz dried cranberries", "2 Bramley apples, peeled, cored and grated", "1 tsp ground cinnamon", "25g/1oz demerara sugar", "3 tbsp red wine vinegar", "Salt and pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/3325F/Gas 3.", "Mix the cabbage with the rest of the ingredients and put in an ovenproof dish.", "Season well and cover with foil. ", "Bake in the oven for 60-90 minutes until the cabbage is tender and juicy. Mix the ingredients together 2-3 times during cooking.", "Allow to cool and store in the fridge. Reheat when needed."]}, {"isVegetarian": false, "title": "Braised red cabbage with apples and sherry vinegar", "url": "www_bbc_co_uk_food_recipes_braisedredcabbagewit_87606", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedredcabbagewit_87606_16x9.jpg", "ingredients": ["50g/2oz butter", "1 medium onion, finely sliced", "2 dessert apples, peeled, cored and sliced", "1kg/2¼lb red cabbage, finely sliced", "100g/4oz sultanas or raisins", "200ml/7fl oz sherry vinegar", "salt and freshly ground pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a stainless steel or flameproof casserole over a medium heat (an aluminium pan will not work for this).", "Fry the onion in the butter for three minutes, then add the apple and cabbage.", "Cook for five minutes or so, until softened, then add the sultanas and the sherry vinegar.", "Place a lid on the pan and cook for one hour, until all the vegetables are just tender. ", "Season to taste with salt and freshly ground black pepper and replace the lid. Continue to cook until the cabbage is tender and all the liquid has evaporated. This dish will keep for several days, covered, in the fridge. Simply heat it up again when ready to serve."]}, {"isVegetarian": false, "title": "Braised red cabbage", "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_81485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30ml/1oz olive oil", "2 garlic cloves, sliced", "1 banana shallot, sliced", "50g/1¾oz streaky smoked bacon, chopped", "¼ red cabbage, shredded", "30ml/1fl oz red wine", "1 tbsp red wine vinegar", "1 tbsp brown sugar", "100ml/3½fl oz hot vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the garlic and shallot and fry for 2-3 minutes to soften.", "Add the streaky bacon and fry for 3-4 minutes, until golden.", "Add the red cabbage and continue to cook for five minutes.", "Add the red wine, vinegar and sugar. Bring to the boil, reduce the heat and simmer for 4-5 minutes, until the liquid volume is reduced by three quarters.", "Add the stock and simmer for another five minutes, until the cabbage is cooked through. ", "Season, to taste, with salt and freshly ground black pepper and pour into a large warm bowl to serve."]}, {"isVegetarian": true, "title": "Braised rice with mushrooms", "url": "www_bbc_co_uk_food_recipes_braisedricewithmushr_77787", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz rice", "½ pint/290ml chicken or vegetable stock", "75g/2½ oz mushrooms, sliced", "75g/2½ oz Romero pepper, sliced", "handful fresh mixed herbs, chopped", "30g/1¼oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Bring the rice and chicken stock to the boil in a large ovenproof pan. Place in the oven for ten minutes.", "Add in the mushrooms and peppers.  Cover with a lid and return to the oven for three minutes.", "Remove the rice from the oven and stir in the herbs and butter."]}, {"isVegetarian": false, "title": "Braised salmon with mustard and Gruyère herb crust, sautéed spinach and roasted vine tomatoes", "url": "www_bbc_co_uk_food_recipes_braisedsalmonwithmus_83759", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crumbed in a food processor", "25g/1oz Gruyère cheese, grated", "15g/½oz cheddar cheese, grated", "4 sprigs thyme, leaves picked", "4 tbsp curly parsley, roughly chopped", "50g/2oz butter, softened", "4 x 150g/5¼oz salmon fillets", "50ml/2fl oz fish stock", "50ml/2fl oz white wine", "50g/2oz Dijon mustard", "150g/6oz vine tomatoes", "2 tbsp balsamic vinegar", "1 tbsp olive oil", "25g/1oz butter", "4 handfuls spinach leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crust, put all the crust ingredients in a food processor and blend until smooth.", "Spread the mixture out on a lined baking tray and chill until set.", "For the salmon, preheat the oven to 200C/400F/Gas 6 and pour the fish stock and wine into an oven-proof dish. ", "Place the salmon fillets into the dish and season with salt and pepper.", "Brush with the mustard.", "Cut the crust into rectangles to cover the salmon place and on top.", "Cook in the oven for ten minutes, or until cooked through.", "Take the salmon out of the oven and leave to rest.", "Place the tomatoes on a baking tray, pour over vinegar and oil, season and roast alongside the in the oven for eight minutes.", "Heat a frying pan until hot then add the butter. When foaming, add the spinach and sauté for two minutes until wilted.", "To serve, place the spinach in the centre of the plate, place the salmon on top and the roasted tomatoes on the side."]}, {"isVegetarian": false, "title": "Braised Savoy cabbage with bacon", "url": "www_bbc_co_uk_food_recipes_braisedsavoycabbagew_68087", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedsavoycabbagew_68087_16x9.jpg", "ingredients": ["1 Savoy cabbage, cored and shredded", "110g/4oz smoked streaky bacon, derinded and chopped", "55g/2oz butter", "85ml/3fl oz dry white wine", "2 tbsp fresh chopped parsley", "2 tsp fennel seeds", "2 tbsp crème fraîche", "salt and freshly ground pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large pan. Add the bacon and cook for 3-4 minutes.", "Add the cabbage and mix all together. Add the wine and season well. Cover and cook gently for 10 minutes until the cabbage is tender.", "Stir in the fennel seeds, parsley and crème fraîche and serve."]}]