[{"isVegetarian": true, "title": "Orange and cardamom rye bread knots", "url": "www_bbc_co_uk_food_recipes_orange_and_cardamom_rye_19326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp black treacle", "30g/1oz dark muscovado sugar ", "150g/5½oz strong white bread flour, plus extra for dusting", "150g/5½oz dark rye flour (or wholemeal dark rye flour)", "25 cardamom pods, seeds removed, pods discarded", "1 tsp fast-action yeast ", "1 tsp flaked sea salt  ", "1 tbsp olive oil, plus extra for greasing", "2 oranges, zest and juice only ", "100g/3½oz rye flour", "200g/7oz strong white bread flour", "1 tsp fast-action yeast", "1 tsp flaked sea salt  ", "1 tbsp white caster sugar", "1 tbsp olive oil", "1 orange, juice only", "1 tbsp dark muscovado sugar", "slightly salted butter "], "serves": "Makes 12 bread rolls", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dark cardamom rye dough, add the black treacle and muscovado sugar to 200ml/7fl oz warm water and stir well.", "Put the flours in a large mixing bowl, add the cardamom and the yeast to one side of the bowl and the salt to the other. Use one hand to mix and the other to pour in three-quarters of the sweetened water. Add the olive oil and bring the dough together using your hands. Depending on the dough’s consistency, you may need to add the rest of the water – ideally the dough should be quite wet and sticky.", "Lightly oil a work surface and turn out the dough. Knead for about 5-8 minutes, or until the dough is smooth and elastic. Shape the dough into a ball and place in a large bowl. Cover with cling film and set aside to prove for an hour, or until doubled in size.", "For the orange rye dough, put the orange juice and zest into a measuring jug. Top up with water to make 200ml/7fl oz and stir to combine.", "Put the rye and white flour in a large mixing bowl. Add the yeast to one side of the bowl and the salt to the other. Gradually pour about three-quarters of the orange juice mixture into the bowl, using your free hand to mix in the liquid. Add the olive oil and caster sugar. ", "Gradually bring the mixture together to form a fairly sticky dough, adding the remaining orange juice, if required.  (You might find you don’t need all the fluids but you can adjust the quantity according to how the dough feels.)", "Lightly oil a work surface and turn out the dough. Knead for around 5-8 minutes, or until the dough is smooth and elastic. ", "Shape into a ball and place back in the mixing bowl. Cover with cling film and set aside to prove for an hour, or until the dough has doubled in size.", "Once both doughs have proved, knock them back and then roughly shape them into rectangles. ", "On a lightly oiled work surface, use a rolling pin to roll out each piece of dough into a rectangle approximately 30x20cm/12x8in. Try to make both rectangles of dough the same size.", "Cut each rectangle in half to create two rectangles 30x10cm/12x4in. Layer them up on top of each other, starting with the orange layer, then cardamom layer and brushing each layer with a little with water to help them stick. Repeat until all the dough is used.", "Pull the corners out so the dough is in a neat rectangle shape. Using sharp knife, slice the dough lengthways into 12 equally-sized strands about 2cm/¾in.", "Roll each strand into a sausage about 20cm/8in long and then tie each strand into a knot shape and place on lightly floured baking parchment.", "Gently cover the rolls with lightly oiled cling film and allow to prove for at least an hour.", "Preheat the oven to 220C/425F/Gas 7.", "Five minutes before the end of proving, pop two baking trays into the oven.", "For the glaze, place the orange juice and the dark muscovado sugar in a small pan and heat gently until the sugar is dissolved. Simmer until a syrup forms. Set aside.", "Once proved, remove the hot trays from the oven and slide the rolls onto them using the baking parchment. Put the baking trays in the oven as soon as possible. Bake for 10 minutes.", "After 10 minutes, turn the oven down to 180C/350F/Gas 4 and bake for another 5-10 minutes. Check the rolls are ready by tapping their bottoms and listening. If it sounds hollow the rolls are ready. Transfer onto wire racks and brush with the glaze while still warm. ", "When cool, serve the rolls with a slathering of slightly salted butter."]}, {"isVegetarian": true, "title": "Orange and lemon curd pots", "url": "www_bbc_co_uk_food_recipes_orange_and_lemon_curd_82994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz freshly-squeezed orange juice", "1 lemon, zest and juice only", "60g/2¼oz unsalted butter, softened, plus extra for greasing", "90g/3¼oz caster sugar", "4 large free-range eggs, separated", "70g/2½oz self-raising flour, sifted", "½ tsp baking powder", "160ml/5½oz full-fat milk", "150ml/5fl oz double cream", "25ml/1fl oz orange-flavoured liqueur (such as Cointreau)", "candied orange peel, to decorate", "few sprigs fresh mint, to decorate"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and grease six individual pudding moulds.", "In a pan, bring the orange and lemon juices to the boil. Cook until the volume of liquid has reduced by half. Set aside to cool.", "In a bowl, beat the butter, sugar and lemon zest until pale and creamy. Mix in the egg yolks, one at a time. In a separate bowl, mix the sifted flour and baking powder together, then add to the butter mixture.", "Slowly add the reduced orange and lemon juices and milk to the mixture stirring gently to combine.", "In a large bowl, whisk the egg whites until soft peaks form when the whisk is removed.", "Beat one-third of the egg whites into the cake batter, then carefully fold in the remainder using a large metal spoon.", "Stand the moulds in a roasting tin and pour in the cake batter. Pour boiling water into the base of the tin. Bake for 20 minutes, or until the puddings are golden-brown and firm to the touch. If the tops are browning too quickly cover with aluminium foil.", "Meanwhile, whip the cream until soft peaks form when the whisk is removed and fold in the orange liqueur. ", "Decorate puddings with the candied orange peel and fresh mint, and serve with the cream."]}, {"isVegetarian": true, "title": "Orange and rapeseed oil cake with cream cheese frosting", "url": "www_bbc_co_uk_food_recipes_orange_and_rapeseed_oil_70459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "5 large oranges", "100ml/3½fl oz rapeseed oil", "4 free-range eggs", "450g/1lb caster sugar", "125g/4½oz self-raising flour", "125g/4½oz ground almonds", "2 tsp baking powder", "150g/5oz cream cheese", "150g/5oz crème fraîche", "25g/1oz icing sugar", "25g/1oz walnut halves, chopped", "1 tbsp basil cress (optional)"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Lightly grease a 23cm/9in springform cake tin with butter.", "Zest three of the oranges into a large mixing bowl and set aside.", "Remove the pith from the three zested oranges and discard. Roughly chop the orange flesh, removing any seeds as you go, and place it into the bowl of a food processor. Blend well, adding the rapeseed oil as you blend until the mixture is smooth and well combined. Set aside.", "Add the eggs and 250g/9oz of the caster sugar to the bowl containing the orange zest. Using an electric whisk, whisk the mixture until it is pale, thick and creamy, and leaves a trail when the whisk is lifted from the mixture. ", "Stir together the flour, ground almonds and baking powder in a separate bowl. ", "Carefully fold half of the puréed orange mixture into the egg mixture. ", "Fold in all of the flour, then fold in the remaining puréed orange mixture.", "Pour the cake mixture straight into the prepared cake tin and bake in the oven for 1 hour, or until golden-brown and risen. Check the cake is cooked by inserting a clean skewer or knife into the centre – if it comes out clean, then the cake is ready; if not, cook it for a further 5 minutes and check once more.", "While the cake cooks, prepare the frosting. Whisk the cream cheese, crème fraîche and icing sugar together in a bowl until smooth and thick, then chill in the fridge, covered, until needed.", "Peel the remaining 2 oranges with a vegetable peeler, then julienne the zest very finely.", "Pour 150ml/5fl oz of cold water into a saucepan and stir in 150g/5oz of the remaining caster sugar. Add the julienned orange peel, then bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 8-10 minutes to make a light syrup.", "Strain the julienned orange zest through a sieve suspended over a large bowl (the orange-scented sugar syrup can be chilled and used in an orange drizzle cake recipe or another recipe).", "Sprinkle the remaining caster sugar onto a plate and dredge the julienned orange zest in it until coated.", "Remove the cake from the oven and set aside to cool slightly in the tin, then turn it out set aside to cool completely on a wire rack.", "When the cake has cooled, spread the cream cheese frosting over the top and decorate with the chopped walnut pieces, candied orange zest and basil cress, if using."]}, {"isVegetarian": true, "title": "Orange and praline croquembouche with cardamom caramel", "url": "www_bbc_co_uk_food_recipes_orange_and_praline_54461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz flaked almonds", "500g/1lb 2oz white fondant icing", "320ml/11fl oz liquid glucose", "40g/1½oz unsalted butter, cut into cubes", "300ml/10fl oz water", "240ml/8½fl oz full-fat milk", "225g/8oz unsalted butter, cut into pieces", "4 tbsp sweetened condensed milk", "1 tsp salt", "330g/11½oz plain flour, sifted", "8 free-range eggs", "1 free-range egg yolk", "2 tbsp water", "1 vanilla pod, seeds only", "900ml/1 pint 12fl oz full-fat milk", "225g/8oz sugar", "12 free-range eggs, yolks only ", "60g/2¼oz cornflour", "115g/4oz blanched almonds", "115g/4oz hazelnuts", "225g/8oz granulated sugar", "4 tbsp water", "500g/1lb 2oz granulated sugar", "1 tsp cardamom seeds  ", "125ml/4fl oz water", "orange and white sugar crystals"], "serves": "Serves 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the nougatine base, line a baking tray with a silicone mat. Lightly grease a 25cm/10in flan tin.", "Sprinkle the flaked almonds onto a baking tray and bake in the oven for 7-8 minutes. ", "Heat the fondant icing and glucose in a large saucepan over a medium heat and boil for 10-15 minutes, or until a pale caramel colour. Stir in the toasted almonds and butter and pour onto the lined baking tray. Place another silicone mat on top, then roll out the nougatine to a thickness of 5mm/¼in then remove the top mat and carefully lift the nougatine into the greased flan tin, pressing it into the sides. Trim off the excess with scissors then set aside to cool. ", "For the choux buns, increase the oven to 200C/400F/Gas 6. Grease several large baking trays. ", "Put the water, milk, butter, condensed milk and salt into a large saucepan and bring to a rolling boil. Tip in the flour and beat with a wooden spoon until smooth.", "Continue cooking, stirring constantly over a moderate heat for about 3-4 minutes or until there is a thin film of dried dough on the sides and bottom of the pan.", "Transfer the dough to the bowl of a food mixer and beat with the paddle attachment on a medium speed until steam is no longer rising from the bowl. Reduce the speed to low and beat in the eggs, one at a time; continue beating until the dough is smooth and glossy. ", "Spoon the dough into a large piping bag fitted with a plain nozzle and pipe 5cm/2in balls onto the baking trays, leaving room for them to spread a little as they cook. ", "Make the egg wash by beating the egg yolk with the water. Brush the balls with the egg wash and bake in the oven for 10 minutes, then reduce the oven to 180C/350F/Gas 4 and bake for 15 minutes more or until the buns are well risen and golden-brown. Remove from the oven and set aside to cool.", "To make the pastry cream, place the vanilla seeds and milk in a large saucepan, bring to the boil then remove the pan from the heat.", "Place the sugar and egg yolks in the bowl of a mixer fitted with a whisk attachment and whisk on a high speed for about three minutes, or until a thick ribbon drips off the whisk, then reduce the speed to medium and beat in the cornflour. ", "Whisk in the hot milk, then pour the mixture back into the saucepan and heat gently until boiling, stirring all the time, then let it bubble for one minute or until thickened and pour into a clean bowl. Cover the surface with cling film to prevent a skin forming and set the bowl aside to cool.", "For the praline paste, toast the almonds and hazelnuts in a dry pan over a gentle heat for about 10 minutes, taking care not to burn them, then place the toasted nuts on a baking tray lined with a sheet of lightly greased greaseproof paper. ", "Heat the water and sugar in a saucepan over a high heat, swirling from time to time, until the mixture is a pale caramel colour. Pour the caramel over the nuts and set aside to cool completely.", "Break the praline into pieces and blend to a paste in a food processor. Mix the praline paste into the pastry cream and spoon into a piping bag fitted with a small nozzle. Cut a small hole in the bottom of each choux bun and pipe in a little of the praline mixture.", "To construct the croquembouche, remove the hardened nougatine from the tin and turn upside down to form the base for the croquembouche.", "Make the caramel by dissolving the sugar in a pan with the cardamom and water and heating to a pale caramel. Dip the filled choux buns into the caramel and stack the choux buns on the nougatine base in a pyramid shape.", "If the caramel becomes too stiff to work, return it to the heat until it loosens. Dip some of the buns in the sugar crystals to decorate as you go.", "For the spun sugar decoration, cut the ends off the bottom of a wire whisk with pliers to make a brush.", "Return the remaining caramel to the heat then dip the brush in the caramel and shake vigorously back and forth over a silicone mat. The caramel will fall in thin strands and set. Gather the strands up and arrange on top of the croquembouche."]}, {"isVegetarian": true, "title": "Orange blossom and rosemary polenta cake with thyme and orange syrup", "url": "www_bbc_co_uk_food_recipes_orange_blossom_and_63730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_blossom_and_63730_16x9.jpg", "ingredients": ["180ml/6fl oz mild olive oil", "220g/8oz caster sugar ", "300g/10½oz ground almonds", "3 large free-range eggs, lightly beaten", "4 mandarins, finely grated zest only", "3 tsp finely chopped fresh rosemary leaves", "3 tsp orange blossom water ", "150g/5½oz polenta", "1 tsp baking powder ", "4 mandarins, juice only", "4 tbsp orange blossom honey", "5 sprigs lemon thyme", "50g/1¾oz icing sugar, sifted", "7–8 tbsp pistachio or walnut oil", "chopped pistachios, for decoration"], "serves": "Serves 6–8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 20cm/8in round, loose-bottomed cake tin.", "To make the cake, whisk the oil and sugar together with a handheld electric whisk for a few minutes, until well combined. Add a little of the ground almonds and mix well, then add an egg and mix again. Repeat, adding a little more of the ground almonds, mixing, then an egg and mixing again, until all the ingredients are used up. Mix in the mandarin zest, rosemary and orange blossom water. ", "In a separate bowl, mix together the polenta and baking powder, add them to the wet ingredients and fold through. Spoon the batter into the prepared tin, spread to the edges and level off the top. Bake for 30 minutes, then reduce the heat to 160C/140C Fan/Gas 3 and bake for 25–30 minutes. The cake will be a deep golden-brown and a skewer inserted into the middle should come out clean. ", "Meanwhile, to make the syrup, put the mandarin juice, honey and thyme sprigs in a small saucepan. Warm through gently, but do not let it boil. Remove from the heat and allow to cool, leaving the thyme to infuse.", "Poke holes all over the cake with a skewer, then leave to cool in the tin for 5 minutes. While the syrup is still warm, remove the thyme, then drizzle the syrup over the cake. Leave it to cool in the tin for a further 30 minutes, then transfer to a wire rack to cool completely.", "To decorate, whisk together the icing sugar and pistachio oil until you reach a drizzling consistency. Drizzle over the cooled cake and sprinkle with the chopped pistachios. "]}, {"isVegetarian": true, "title": "Orange butterfly cakes", "url": "www_bbc_co_uk_food_recipes_orange_butterfly_cakes_82059", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_butterfly_cakes_82059_16x9.jpg", "ingredients": ["100g/3½oz baking spread ", "100g/3½oz caster sugar", "2 large free-range eggs", "100g/3½oz self-raising flour", "1 level tsp baking powder", "1 orange, grated zest only", "3 tbsp orange curd", "50g/1¾oz soft butter", "100g/3½oz sifted icing sugar", "icing sugar, to dust"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 (160C fan).", "Put all the cake ingredients into a large bowl and beat well for 2-3 minutes, or until the mixture is well-blended and smooth. Fill each paper case with about 35g/1¼oz of mixture.", "Bake in the preheated oven for about 15-20 minutes, or until the cakes are well risen and golden-brown. Lift the paper cases out of the bun tin and cool the cakes on a wire rack.", "When cool, cut a disc from the top of each cake leaving a little gap around the edge and cut this slice in half. Spoon half a teaspoonful of orange curd in each. ", "To make the icing, beat the butter and icing sugar together until well blended. Pipe or spoon a swirl of buttercream on top of the orange curd and place the half slices of cake on top to resemble butterfly wings. Dust the cakes with icing sugar to finish."]}, {"isVegetarian": true, "title": "Orange cake", "url": "www_bbc_co_uk_food_recipes_orange_cake_57974", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_cake_57974_16x9.jpg", "ingredients": ["2 oranges, diced (including skins), pips removed", "115g/4oz margarine, plus extra for greasing", "115g/4oz sugar", "2 medium free-range eggs, beaten", "3 tsp baking powder", "175g/6oz semolina"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a deep 20cm/8in tin with margarine.", "Purée the diced oranges in a food processor, and set aside.", "Cream the margarine and sugar in a bowl until light and fluffy. Mix in the eggs and then add the baking powder and semolina. Stir to combine, then fold the orange pulp through the mixture.", "Pour the mixture into the prepared tin, and put into the oven. After the first 10 minutes, turn the oven temperature down to 170C/325F/Gas 3 and bake for a further 40 minutes, or until the cake is golden-brown on top and a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven, and allow to cool in the tin. Once cool, run a knife around the edge of the tin to release the cake, and then turn out. To serve, cut the cake into 12 slices."]}, {"isVegetarian": true, "title": "Orange cake with a caramel and orange sauce", "url": "www_bbc_co_uk_food_recipes_orange_cake_with_a_18847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oranges", "225g/8oz caster sugar", "6 free-range eggs", "250g/9oz ground almonds", "50g/1¾oz unsalted butter", "1 orange, zest and juice", "2 oranges, juice only", "1 orange, segmented", "3 tbsp caster sugar", "2 tbsp orange liqueur", "2 tbsp brandy", "ice cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the orange cake, simmer the two whole oranges in a saucepan of simmering water for 45-60 minutes, or until very soft. Remove the pan from the heat and leave the oranges to cool in the water.", "Preheat the oven to 180C/350F/Gas 4. Grease a 23cm/9in loose-based, springform cake tin.", "Drain the oranges and roughly chop, discarding the pips. ", "In a food processor, blend 450g/1lb of chopped orange to a purée. Add the sugar, eggs and ground almonds and blend until smooth.", "Spoon the mixture into the cake tin.", "Bake in the oven for 25 minutes, then cover loosely with aluminium foil and bake for a further 25-35 minutes, or until cooked through (a skewer inserted in the middle should come out clean). Remove from the oven and set aside to cool.", "For the caramel and orange sauce, heat a frying pan until hot, add the butter, orange zest and juice and the caster sugar. Add the orange liqueur and brandy and flambé by slowly tilting the pan towards the flame, or lighting with a match. Let the flames flare up then die down. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.) ", "Cook for a few minutes until just thickened and bubbling, then add in the segments and remove the pan from the heat.", "To serve, slice a piece of cake and place on a plate and pour the sauce over the cake and around the plate. Serve immediately with a scoop of ice cream."]}, {"isVegetarian": true, "title": "Orange caramel custard", "url": "www_bbc_co_uk_food_recipes_orange_caramel_custard_43115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_caramel_custard_43115_16x9.jpg", "ingredients": ["4 large oranges, zest only", "75g/2½oz caster sugar", "500ml/17fl oz full-fat milk ", "120g/4oz granulated sugar", "3 free-range eggs", "4 free-range egg yolks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the zest and caster sugar to a fine powder in a food processor. ", "Put the orange zest and caster sugar mixture into a saucepan, add the milk and warm together, occasionally stirring, until just below simmering point. Switch off the heat, cover with a lid and leave to infuse for at least one hour. ", "Put the granulated sugar into a heavy-based saucepan and add 3-4 tablespoons of cold water. Bring to a simmer and cook slowly until the sugar has turned to a richly coloured caramel. ", "Pour the caramel into the base of the four dariole moulds and set aside to cool.", "Preheat the oven to 150C/300F/Gas 2.", "Put the eggs and yolks into a roomy bowl, beat together lightly and then strain over the orange-infused milk. Gently beat the mixture together until well combined. Remove any froth from the surface with a spoon and strain the mixture to make it smooth.", "Ladle the mixture into the caramel-lined moulds and fill to the brim. Place them into a deep roasting tin and fill with hot (not boiling) water, so that it rises up the outside of the molds by about three-quarters of the way up. Carefully place the tin into the oven and loosely lay a sheet of tin foil flat over the surface of the moulds, but don't secure it down. Bake in the oven until the custards are just set (about 40 minutes) - lightly press a finger on the surface, or give them a little shake; they should gently wobble. ", "Remove from the oven, take out from the roasting tin and leave to cool. Cover each mould with a small sheet of clingfilm and chill in the fridge for at least two hours. ", "To unmould, run a small knife around the edge of the custard and upend onto individual, shallow dishes. "]}, {"isVegetarian": true, "title": "Orange, cardamom, and date m’hanncha (snake pastry)", "url": "www_bbc_co_uk_food_recipes_orange_cardamom_and_date_40276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb 8oz flour", "630ml/22 fl oz tepid water", "2 tsp salt", "120ml/4fl oz olive oil", "375g/13oz butter", "375g/13oz icing sugar", "3 free-range eggs", "375g/13oz finely ground almonds", "3 cardamom pods, crushed", "2 unwaxed oranges, zest and 30ml/2 tbsp juice", "50g/1¾oz dates, stones removed, chopped", "50g/1¾oz flaked almonds", "icing sugar, for dusting", "flaked almonds, to taste", "5-6 pistachios, crushed"], "serves": "", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the filo pastry, sift the flour and salt together. Add the water and oil and mix until a sticky dough forms. Knead for approximately 10 minutes, or until smooth and less sticky.", "Place in bowl, cover with cling film and set aside to rest for an hour.", "When the pastry is rested, cut it into 10 equal portions.", "Generously flour a large work surface, start to roll out one portion of pastry using a rolling pin. Once you’ve got it relatively thin, you can use a 2cm/1in diameter dowel or rod instead (this will make it easier to achieve the thinnest pastry). Roll the pastry out as thinly as possible then stretch it even thinner by running your hands under it and very gently tugging on the dough. Repeat for all the remaining pieces, keeping the filo covered with damp cloth while you work.", "For the filling, cream the butter and icing sugar together. Mix in the eggs in one at a time, making sure they are combined before adding the next. Add the ground almonds and mix well.", "In a small pan, heat the cardamom pods and orange juice to infuse. Simmer for a few minutes, then allow to cool.", "When cool, remove the cardamom pods and add the juice to the butter and egg mixture along with the three-quarters of the orange zest, the dates and flaked almonds. Mix well. ", "Preheat the oven to 180C/350F/Gas 4.", "Put the filo sheets on a long table (about 2m/6ft long) side by side with the edges slightly overlapping each other to form a very long rectangle approximately 2m/6ft long. ", "Spoon the filling in a straight line near the edge of a long side of the pastry. Then, just like a Swiss roll, begin to roll up the pastry until you have a very long, thin roll of pastry. Wrap up into a swirl, to resemble a coiled snake. ", "Place on the baking tray and bake in the oven for 40-45 minutes, or until the pastry is golden-brown and crisp. ", "To serve, dust with icing sugar and scatter with flaked almonds. Finish with the reserved orange zest and some crushed pistachios."]}, {"isVegetarian": false, "title": "Orange cheesecake with honey and pistachios", "url": "www_bbc_co_uk_food_recipes_orange_cheesecake_with_15249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90g/3¼oz butter, softened, plus extra for greasing", "325g/11½oz digestive biscuits", "3 oranges", "250g/9oz caster sugar", "350g/12oz cream cheese, softened", "350g/12oz curd cheese, softened", "150ml/5fl oz soured cream", "4 free-range eggs", "120g/4½oz runny honey", "30g/1oz shelled pistachios"], "serves": "Serves 8–10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Very lightly grease the base and sides of a 23cm/9in springform cake tin approximately 5cm/2in deep. Stand the tin on a baking sheet. ", "Melt the butter in a small saucepan and allow to cool.", "Preheat the oven to 190C/170C Fan/Gas 5.", "Crush the biscuits to fine crumbs in a food processor, or place in a strong plastic bag and bash with a rolling pin. ", "In a bowl, mix the crushed biscuits with the melted butter until fully combined. Tip the mixture into the prepared tin and spread it out to form an even layer, pressing it firmly and uniformly with flattened knuckles.", "Bake for 12 minutes, or until the base has firmed up like a pastry layer. Set aside on the baking sheet to cool. ", "Lower the oven temperature to 160C/140C Fan/Gas 3.", "Using a swivel peeler, finely pare the zest of one orange in strips, then cut these into long, thin julienne.", "In a small saucepan, dissolve 75g/2½oz of sugar in 100ml/3½fl oz of water over a medium heat, then bring to the boil.", "Add the julienned orange zest, reduce the heat to a simmer and poach the zest in the syrup for 10 minutes. Remove from the heat and set aside to cool completely. One cooled, drain the julienned zest and discard the syrup.", "Rub the skins of the remaining oranges against the finest grating surface of a box grater to produce a wet zest purée.  Scrape into a small bowl and set aside.", "Juice all the oranges, then strain the juice through a fine chinois or sieve.", "Put the cream cheese, curd cheese, soured cream and remaining sugar in a large bowl and mix until smooth. ", "In another bowl, whisk the eggs until light and foamy, then strain through a fine chinois or sieve into the cream cheese mixture. Mix well with a wooden spoon, then add the orange juice and zest purée and mix to combine.", "Spoon the mixture over the cooled biscuit base and bake for 1½ hours. Turn off the oven and leave the cheesecake inside for a further hour, with the door very slightly open. Remove the cheesecake from the oven and leave to cool completely. Once cooled, refrigerate for at least 2–3 hours before serving, ", "When you’re ready to serve, run a knife around the inside of the tin and gently release the sides of the tin. Carefully transfer the cheesecake to a serving plate.", "Using a palette knife, spread the honey over the cheesecake. Sprinkle a little of the candied orange zest julienne on top and scatter over the pistachios.", "Use a very sharp knife dipped in hot water to cut the cheesecake into slices, returning the knife to the hot water in between slices. "]}, {"isVegetarian": true, "title": "Orange lavender shortbread biscuits", "url": "www_bbc_co_uk_food_recipes_orange_lavender_20492", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz butter, softened", "80g/3oz golden caster sugar ", "20g/1oz lavender sugar, plus extra for sprinkling ", "110g/3½oz ground almonds", "200g/7oz plain flour ", "½ orange, zest only, finely grated"], "serves": "Makes 18 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven at 160C/325/Gas 3.", "Cream the butter and sugars together in a bowl with a handheld electric mixer until light and fluffy and pale. ", "Stir the ground almonds, flour and orange zest into the mixture. Stir until thoroughly mixed. If the room is warm and the mix feels too soft, wrap in cling film and set aside to rest in the fridge for 10 minutes.", "Divide the mixture into eighteen equal pieces and roll each into a ball.  On a floured surface, flatten each ball to a circle 1cm/½in thick with a fork or with a cookie stamp.", "Place them on a non-stick baking sheet at least 2.5cm/1in apart.", "Bake for 20-25 minutes, until the biscuits are barely coloured. ", "Remove from the oven and leave to cool for 10 minutes before transferring to a wire rack to cool completely.", "When cool, sprinkle the biscuits with the additional lavender sugar before putting them onto a serving plate. "]}, {"isVegetarian": false, "title": "Orange panna cotta with mint roasted rhubarb", "url": "www_bbc_co_uk_food_recipes_orange_panna_cotta_with_25558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 blood oranges, juice and rind reserved", "75g/2½oz caster sugar", "150ml/5fl oz double cream", "1 vanilla pod, split lengthways", "2 gelatine leaves, soaked in water for a few minutes until soft", "300ml/10fl oz buttermilk", "300g/10oz rhubarb, cut in 2cm/¾in pieces", "1 tbsp caster sugar", "orange juice, reserved from above", "2 large sprigs fresh mint, leaves picked and torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the panna cotta, preheat the oven to 140C/275F/Gas 1.", "Place the orange rind on a baking tray and bake in the oven for 20 minutes, or until completely dry.", "In a small pan, heat the dried rind with the sugar, cream and vanilla. Simmer until the sugar has dissolved. Remove the orange rind and vanilla.", "Squeeze the excess water from the softened gelatine leaves, then add to the cream mixture and continue to simmer until dissolved. Remove from the heat and stir in the buttermilk.", "Place four dariole moulds or ramekins on a baking tray and pour in the panna cotta mixture. Chill in the fridge for 1-2 hours, or until set.", "For the mint roasted rhubarb, preheat the oven to 200C/400F/Gas 6.", "Place the rhubarb in a roasting tin, sprinkle over the sugar, then drizzle over the orange juice and mint. Roast the rhubarb in the oven for 8-12 minutes, or until just tender.", "To serve, remove the panna cotta from the fridge. To remove the panna cotta from the moulds, briefly dip the base of each mould into a bowl of boiled water. Gently slide a knife around the edge of each panna cotta and turn out into the centre of a serving plate. Place the roasted rhubarb on the side and drizzle over any juice left in the roasting tin."]}, {"isVegetarian": true, "title": "Orange purée", "url": "www_bbc_co_uk_food_recipes_orange_pure_21320", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz orange zest", "50ml/2fl oz freshly squeezed orange juice", "150ml/5fl oz extra virgin olive oil", "20g/¾oz caster sugar", "pinch salt", "pinch cayenne pepper"], "serves": "Makes 300g/10½oz", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Bring a saucepan of water and the orange zest to the boil over a high heat. Reduce the heat until the water is simmering, then simmer for 15 minutes. Drain the zest, replace the water and repeat three more times (this will remove the bitter taste from the orange zest).", "Drain the orange zest and transfer to a food processor. Blend the zest, orange juice and half of the oil to a smooth purée. Continue to add the oil, pulsing after each addition, until the purée reaches the consistency you desire.", "Season, to taste, with sugar, salt and pepper, then cover and chill in the fridge until needed."]}, {"isVegetarian": true, "title": "Orange rice cake", "url": "www_bbc_co_uk_food_recipes_orange_rice_cake_29449", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_rice_cake_29449_16x9.jpg", "ingredients": ["1.7 litre/3 pints milk", "1 vanilla pod", "½ lemon, zest only, in large pieces", "200g/7oz sugar", "300g/10½oz arborio rice", "5 large free-range eggs, separated", "50ml/2fl oz orange liqueur", "40g/1½oz raisins", "1 orange, zest only, grated, plus extra for serving"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a 24cm/10in loose-bottomed cake tin with greaseproof paper.", "Place the milk, vanilla pod, lemon zest and sugar in a large saucepan and bring to the boil. Add the rice and simmer on a medium to low heat for about 20–25 minutes, until the rice is al dente and has absorbed the milk but still has a creamy consistency. Remove from the heat and allow to cool. Remove vanilla pod and lemon zest.", "In a bowl, whisk the egg yolks and liqueur until creamy. In another bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Add the egg yolk mixture to the cooled rice, then fold in the stiffened egg whites, followed by the raisins and orange zest. Pour in the prepared tin and bake in the oven for one hour. Serve warm or cold, sprinkled with a little extra orange zest to finish."]}, {"isVegetarian": true, "title": "Orange savarin with cinnamon cream", "url": "www_bbc_co_uk_food_recipes_orange_savarin_with_16473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "1 x 7g sachet fast-action yeast", "250ml/9fl oz full-fat milk, gently warmed to room temperature", "4 large free-range eggs", "40g/1½oz caster sugar", "1 large orange, zest only ", "1 tbsp vanilla extract", " ½ tsp table salt", "150g/5½oz unsalted butter, melted, plus extra for greasing", "vegetable oil, for greasing", "6 tbsp freshly squeezed orange juice ", "4 tbsp of orange liqueur, such as Grand Marnier", "150g/5½oz caster sugar", "300ml/10½fl oz double cream", "½ tsp ground cinnamon ", "50g/1¾oz caster sugar", "2 large oranges (optional)", "25g/1oz unsalted shelled pistachios, chopped "], "serves": "Makes 1 large cake", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Grease a 25cm/10in savarin tin with butter and dust with flour.", "For the dough, sift the flour into a large mixing bowl, add the yeast and mix. Pour in the milk and roughly mix using a wooden spoon.", "In a separate bowl, beat the eggs and sugar until pale and fluffy. Then stir in the orange zest, vanilla extract, salt and melted butter. Mix until well combined then pour it into the flour mixture. Whisk until the batter reaches a smooth pouring consistency. Cover and leave to rise for 15-20 minutes. ", "When the batter has proved, use a wooden spoon to knock it back and remove the air. Pour the batter into the prepared tin. Oil one side of a large piece of cling film and cover the tin oily-side down. Set aside in a warm room for about 1½ hours until the dough almost reaches the top of the tin.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the cling film and bake the savarin for about 40 minutes. Allow to cool for a few minutes then turn out into a shallow baking tray. ", "For the syrup, heat the orange juice, liqueur, 250ml/9fl oz water and the sugar in a pan. Simmer for five minutes, or until the sugar is dissolved. Slowly pour the syrup over the savarin, allowing it be absorbed as you pour. Place the savarin on a serving plate.", "For the filling, whip the cream with sugar and cinnamon until peaks form when the whisk is removed. Transfer to a piping bag with a star nozzle attached and pipe the cream in the middle of the savarin until it reaches the top of the cake. ", "To decorate, slice the oranges very thinly and place them on the top of the cake (if using). Sprinkle the pistachios over and serve."]}, {"isVegetarian": false, "title": "Orange, rosemary and almond biscotti with a zabaglione dip", "url": "www_bbc_co_uk_food_recipes_orange_rosemary_and_56653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["160g/5½oz blanched almonds", "4 large unwaxed oranges ", "420g/15oz caster sugar ", "350g/12oz plain flour, plus extra for dusting ", "3 tsp baking powder", "3 large free-range eggs", "4 sprigs rosemary, leaves picked and finely chopped", "100g/3½oz dried cranberries", "3 large free-range egg yolks", "35g/1¼oz caster sugar", "pinch ground cinnamon", "2 tbsp Marsala wine ", "2 tbsp orange-flavoured liqueur such as Cointreau", "50ml/2fl oz whipping cream "], "serves": "Makes 32 biscotti", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the biscotti, preheat the oven to 180C/160C Fan/Gas 4. Tip the almonds onto a baking tray and roast them for a few minutes until fragrant. ", "Using a vegetable peeler, peel off 1cm/½in wide strips of zest from the oranges. Cut the strips into 5mm/¼in pieces. Place in a pan of water and bring to boil for a couple of minutes. Drain and repeat this blanching process 3 times.", "Fill a pan with 150ml/5fl oz water and 300g/10½oz caster sugar and boil the strips of peel until soft. Drain the peel, reserving the liquid.", "Put the orange-flavoured sugary water into a large pan and boil rapidly until caramelised. Carefully pour the mixture onto a non-stick baking tray and cool as quickly as possible, then transfer to the fridge. Once chilled, remove from the baking tray and break it into a blender. Blend until it becomes like fine sugar. Measure out 200g/7oz of this sugar and blend with 100g/3½oz of the flour.", "In a large bowl, mix together the sugar/flour mixture, the remaining 250g/9oz of flour, baking powder and the reamining caster sugar. Add the eggs, rosemary, blanched almonds, dried cranberries and orange peel. Use your hands to mix into a fairly solid dough - some extra flour may be required.", "Split the dough into 2 pieces. Use your hands to roll each piece to a sausage shape about 5cm/2in thick. Place each piece of dough on a lined baking tray and use the palm of your hand to flatten them slightly. Bake for 30 minutes. Remove from the oven, and allow to cool for a few minutes. ", "Turn down the oven to 160C/140C Fan/Gas 3. Chop the biscotti on the diagonal into slices about 1cm/½in thick. Separate the slices, place on lined baking trays and bake for another 20 minutes. Transfer to a wire rack to cool.", "While the biscotti are in the oven for the second time, prepare the zabaglione dip. Beat the egg yolks, sugar and cinnamon in a heatproof mixing bowl. ", "Once the mixture is pale, place the bowl on top of a pan of simmering water. Add the Marsala wine and liqueur and whisk for about 5 minutes until smooth and creamy. Whip the cream to soft peaks in a separate bowl then fold into the egg mixture.", "Serve the biscotti with the zabaglione dip alongside. "]}, {"isVegetarian": false, "title": "Orange and fennel salad", "url": "www_bbc_co_uk_food_recipes_orangeandfennelsalad_67842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 oranges, peeled, all zest and pith removed", "8 black olives, sliced", "1 large fennel bulb, finely sliced (reserve the feathery fronds)", "8 anchovy fillets", "4 tbsp extra virgin olive oil", "2 tsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Take an orange in the palm of your hand and with a small, very sharp knife cut out the segments from between the membranes, discarding the pips and any pith still attached. Repeat with the remaining oranges.", "Place the orange segments and sliced olives in a bowl, then add the fennel and anchovies. Season with salt and pepper. Mix in the olive oil and vinegar, leave to marinate for 1 or 2 minutes and then serve. Decorate with the green feathery leaves from the fennel."]}, {"isVegetarian": true, "title": "Orange, white chocolate and cardamom langues de chat", "url": "www_bbc_co_uk_food_recipes_orange_white_chocolate_24330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz unsalted butter, softened", "125g/4½oz icing sugar, portioned into 100g/3½ oz and 25g/1oz parts, both sieved", "25g/1oz ground almonds", "3 free-range eggs, whites only", "165g/5¾oz plain flour, sifted", "1 to 2 oranges (depending on size), zest only", "1 tsp orange extract", "200g/7oz white chocolate, finely chopped", "1 tsp cardamom pods, seeds only, ground"], "serves": "Makes 30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/350F/Gas 4.", "Beat the butter until very, very soft (preferably using an electric stand mixer) and there are no lumps, then beat in 100g/3½oz icing sugar for a minute.", "Sift the ground almonds and remaining icing sugar together over the mixture and stir in. ", "Continue mixing, adding the egg whites one at a time.", "Then mix in the flour.", "Add the orange zest and orange extract.", "Leave the mixture to rest for 20 minutes.", "Meanwhile, mark out 7cm/2¾in lines, set at least 3cm/1¼in apart, on baking parchment, to guide where to pipe the biscuits. Flip the paper over and pipe on the unmarked side (the lines will show through).", "Fill a piping bag fitted with 1cm/½in plain nozzle with the biscuit mixture and pipe out. Smooth the tips down at the end of the line with a finger wetted in water. ", "Bake for 8-9 minutes until the pale biscuits are just colouring and the centre is just golden-brown, with the edges slightly darker. This may take up to 10-12 minutes. ", "Remove the biscuits from the oven and leave on the tray for 1-2 minutes. Using a palette knife transfer the biscuits to a wire rack to cool. Alternatively you can leave the biscuits to dry out and cool on the tray if slightly underdone.", "To decorate, combine the chopped chocolate and ground cardamom seeds. ", "Melt two-thirds of the chopped white chocolate very gently in a heat-proof bowl set on top of a pan of simmering water. Heat the chocolate to no more than 45C/113F (use a thermometer to measure this), remove from the heat and then add the remaining white chocolate, stirring continually until the temperature drops to 32C/90F.  Transfer to narrow or steep sided small bowl.", "Half dip each biscuit in the chocolate and then lay flat on baking parchment to dry."]}, {"isVegetarian": true, "title": "Orange and almond cake", "url": "www_bbc_co_uk_food_recipes_orangeandalmondcake_72383", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large oranges", "200g/7¼oz caster sugar", "200g/7¼oz ground almonds", "½ tsp baking powder", "6 whole eggs", "½ lemon, juice only", "crème fraîche, to taste", "1 small punnet of raspberries"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the whole oranges in a pan and cover with cold water. Bring to the boil, turn down the heat and simmer for up to two hours. Check the water to ensure they don't boil dry. After two hours, remove from the heat and leave to cool.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the oranges from the water. Cut in half and remove the pips.", "Place them in a food processor, skin and all, with all of the remaining ingredients and blend until mixed.", "Put the mixture into a greased and lined cake tin (20cm/8in) and bake for 45 minutes.", "Let the cake cool before serving with a dollop of crème fraîche and a scattering of raspberries."]}, {"isVegetarian": true, "title": "Orange and prune crêpe soufflé", "url": "www_bbc_co_uk_food_recipes_orangeandprunecrepes_78108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "2 free-range eggs", "enough milk to bind", "butter, to grease pan", "3 free-range egg yolks", "2 tbsp caster sugar", "50g prunes, chopped", "1 orange, pith removed, chopped", "4 free-range egg whites"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the crepes, whisk together the flour and eggs, adding enough milk to make a batter the consistency of double cream.", "Heat a crepe pan and melt a small knob of butter.", "Ladle enough crepe mixture into the pan to thinly and evenly coat the pan and cook for one to two minutes per side.", "Remove the crepe and place onto a sheet of kitchen towel. Repeat with the remaining batter.", "For the filling, beat the egg yolks with the sugar and fold in the prunes and oranges.", "In a clean bowl, whisk the egg whites until stiff. Fold this into the yolk mixture.", "Line the crepes up on a baking tray and equally divide the filling mixture onto one half of each crepe. Fold each empty side over to create half-moon shapes.", "Place in the oven for eight to ten minutes, or until puffed up.", "Transfer to plates and serve warm."]}, {"isVegetarian": true, "title": "Orange and raspberry Victoria sponge", "url": "www_bbc_co_uk_food_recipes_orangeandraspberryvi_93622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, plus extra for greasing", "225g/8oz golden caster sugar", "4 free-range eggs, beaten", "225g/8oz self-raising flour, sifted", "1 large orange, zest only", "300g/9oz fresh raspberries", "2 tbsp fresh orange juice", "1 heaped tbsp golden caster sugar", "250g/9oz butter, softened", "250g/9oz icing sugar, seived", "½ orange, juice only", "1 large orange, zest only, plus a little zest to decorate"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cake, grease and line two 20cm/8in sandwich tins with baking parchment, and dust with flour.", "In a food mixer, cream together the butter and sugar until pale and fluffy.", "Gradually beat in the eggs, then add the flour and orange zest and mix until well combined.", "Divide the mixture evenly between the two cake tins, then bake in the oven for 25-30 minutes, or until golden-brown and slightly springy to the touch. Remove from the oven and set aside to cool slightly in the tins before turning out onto a wire rack to cool completely.", "Meanwhile, for the jam, place the raspberries, orange juice and golden caster sugar into a small saucepan over a low heat. Cook for 15-20 minutes, or until the raspberries begin to break down. Remove the pan from the heat and set aside to cool completely.  ", "For the icing, beat the butter, icing sugar, orange juice and zest in a bowl until smooth.", "To serve, place one sponge on a serving plate or cake stand, and spread half of the icing on top. Spoon over the jam, top with the second sponge and finish with the remaining buttercream. Decorate with a little more orange zest if desired."]}, {"isVegetarian": true, "title": "Orange and watercress salad", "url": "www_bbc_co_uk_food_recipes_orangeandwatercresss_13958", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 oranges", "a good bunch watercress", "2 tbsp olive oil", "pinch sugar", "salt", "freshly ground pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Finely grate the zest of two of the oranges, avoiding any pith, then peel them with a sharp knife, removing all the pith.", "Run a sharp blade either side of the thin membranes, releasing whole segments one at a time. Let them drop into a bowl along with any juice that drips while you are performing this operation.", "Make a dressing by mixing the olive oil with 1 tbsp saved juice, the finely grated zest, a pinch of sugar and a little salt and pepper.", "Toss the leaves with this dressing just before serving and scatter the segments of orange among the leaves."]}, {"isVegetarian": true, "title": "Orange and almond cake", "url": "www_bbc_co_uk_food_recipes_orangecake_83870", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orangecake_83870_16x9.jpg", "ingredients": ["2 large oranges", "1 tsp butter", "1 tsp plain flour", "6 free-range eggs", "250g/9oz ground almonds", "250g/9oz caster sugar", "1 tbsp baking powder"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the oranges thoroughly. Bring them to the boil in a large saucepan of water and gently cook for two hours.", "Preheat the oven to 175C/325F/Gas 3 and butter and flour a 23cm/9in cake tin.", "Leave the oranges to cool, before slicing in quarters and removing the pips.", "Pulp the oranges in a food processor.", "Beat the eggs and gradually stir in all the remaining ingredients, including the orange pulp. Pour into the cake tin and cook for about an hour, until the cake is golden in colour and has risen. ", "Transfer to a wire cooling rack, keeping the cake in the tin. When the cake has cooled, carefully remove from the tin and serve cut into slices."]}, {"isVegetarian": true, "title": "Orange cream-filled choux buns with chocolate sauce and caramelised oranges", "url": "www_bbc_co_uk_food_recipes_orangecreamfilledcho_86214", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 vanilla pod, halved, seeds scraped out", "300ml/11fl oz whole milk", "2 free-range egg yolks", "75g/3oz caster sugar", "20g/¾oz cornflour", "300ml/11fl oz double cream", "2 oranges, zest only", "3 tbsp orange liqueur", "250ml/9fl oz cold water", "110g/4oz cold butter, diced", "1 tsp caster sugar", "150g/5oz plain flour", "4 free-range eggs", "50g/2oz caster sugar", "50ml/2fl oz water", "175g/6oz dark chocolate, roughly chopped", "3 oranges, peeled and segmented", "6 tbsp caster sugar"], "serves": "6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the orange cream, first make a custard. Place the vanilla seeds and pod into a pan. Add the milk and bring to the boil.", "Place the egg yolks, sugar and cornflour into a bowl and mix together. ", "Once the milk is boiling, pour onto the egg mixture and mix well. Return the mixture to the pan and bring back to the boil, stirring all the time.", "Once the mixture has boiled, take the pan off the heat, remove the vanilla pod and leave the custard to cool.", "Meanwhile, place the double cream into a bowl with the orange zest and liqueur. Whip until soft peaks form then fold this into the cooled custard. Spoon into a piping bag fitted with a medium-sized nozzle.", "For the choux pastry, preheat the oven to 220C/430F/Gas 7.", "Place the water, butter and sugar into a pan and bring to the boil. Boil for one minute.", "Remove from the heat and add the flour in one go. Beat the mixture thoroughly until it's smooth and comes away cleanly from the sides of the pan.", "Return to the heat for a minute or two and cook through.", "Remove from the heat and allow to cool slightly. Add the eggs, one at a time, beating well between each addition. Spoon the mixture into a piping bag fitted with a large, plain nozzle.", "Pipe six large rounds onto a greased baking tray and push any bumps down with a wet fingertip.", "Place in the oven, along with a cup of water placed on the bottom shelf (this helps create steam).", "Cook for five minutes then open the oven door and allow the steam to escape. Remove the cup of water.", "Cook the choux buns for a further 20 minutes until crisp and golden.", "Remove the buns from the oven and, using the tip of a sharp knife,  pierce a hole in the bottom of each bun. Place on their sides and return to the oven for a further five minutes to allow the buns to become dry and crisp. Remove from the oven and cool on a wire rack.", "For the chocolate sauce, place the sugar and water into a pan and bring to the boil. Simmer for 1-2 minutes until the sugar has dissolved completely, then add the chocolate and stir well until smooth. Remove from the heat.", "For the caramelised oranges, place the orange segments onto a serving plate and dust with the sugar. Use a mini-blowtorch to heat the oranges until the sugar has caramelised (alternatively place under a hot grill).", "To serve, pipe the orange cream into the choux buns, through the hole in the bottom of each bun. Place alongside the caramelised oranges. Pour the chocolate sauce over the choux buns and serve immediately."]}]