[{"ingredients": ["125g / 4½ oz de harina natural, más extra para espolvorear", "125g / 4½oz de harina blanca fuerte", "½ cucharadita de sal", "225 g / 8oz de mantequilla salada, refrigerada", "50g / 1¾oz de queso parmesano, rallado", "50g / 1¾oz de albahaca", "1 diente de ajo, aplastado", "50g / 1¾oz de piñones", "1 cucharadita de azúcar en polvo", "1 cucharadita de sal", "50g / 1¾oz de queso parmesano, rallado", "2 cucharadas de aceite de oliva, más extra para el gusto", "150g / 5½oz de tomates secados al sol en aceite", "2 cucharadas de pasta de tomate secada al sol", "½ cucharadita de pasta de chipotle", "½ cucharadita de pasta de anchoa", "25g / 1oz de queso parmesano, rallado", "50g / 1¾oz de queso parmesano, rallado"], "method": ["Para la masa, poner las harinas y la sal en un tazón. Haga un pozo en el medio y vierta en 150 ml / 5 fl oz de agua. Revuelva para combinar, luego amase durante un minuto. Envuelva la película adhesiva y refrigere durante 30 minutos.", "Corta la mantequilla por la mitad horizontalmente. Coloque una pieza entre dos hojas de papel de hornear y extiéndalo de modo que tenga 14 cm de ancho y 13 cm de profundidad. Regrese a la nevera mientras saca los pasteles.", "Coloque la masa sobre una superficie de trabajo ligeramente enharinada y ruede en un rectángulo de aproximadamente 15x45cm / 6x18 pulgadas. Con un borde corto cerca de usted, coloque un trozo de mantequilla en el tercio inferior de la masa y dóblelo, luego coloque el segundo encima de la sección doblada y coloque la pieza superior de masa para cubrir la mantequilla. Pellizca los bordes para sellar la mantequilla en la masa. Gírelo para que un borde corto esté más cerca de usted y despliegue un rectángulo de 15x40cm / 6x16 pulgadas. Doble en tres (como una carta), envuélvalos en una película adhesiva y refrigere durante 30 minutos.", "En una superficie de trabajo ligeramente enharinada, coloque la masa con el borde corto más cercano a usted. Estire hacia afuera hasta 15x40cm / 6x16 pulgadas y luego doble el tercio inferior hacia arriba y el tercio superior hacia abajo. Dale a la masa un cuarto de vuelta y desplázate y dobla como antes. Envuelva la película adhesiva y refrigere durante 30 minutos.", "Con un borde corto hacia ti, desplázate y dobla como antes. Gire la pastelería 90 grados y desplácela como antes. Cubra la masa con el queso parmesano rallado antes de doblar. Envuelva la película adhesiva y refrigere durante 30 minutos. Repita la laminación y doblar una vez más, pero sin el parmesano.", "Para el pesto, coloque todos los ingredientes en un procesador de alimentos y procese hasta que quede suave, raspando los lados a intervalos y agregando más aceite de oliva si es necesario. Transfiera a un tazón y cubra.", "Para los tomates secados al sol, coloque todos los ingredientes en un tazón y mezcle con una batidora hasta que quede bastante suave y sin grumos grandes.", "Para finalizar, extienda la masa en un rectángulo hasta que tenga el grosor de una moneda de £ 1 (el rectángulo debe medir aproximadamente 35x25 cm / 14x10 pulgadas). Recorte en un rectángulo ordenado y coloque un extremo corto más cercano a usted. Extienda pesto sobre la mitad superior del rectángulo, dejando un borde de 1 cm / ½ pulgada alrededor del borde y una franja vertical hacia abajo en el centro. Espolvorear con el queso parmesano y extender la mezcla de tomate secada al sol en la mitad inferior de la masa, dejando de nuevo un borde de 1 cm / ½ pulgada y una franja intermedia despejada.", "Pase un dedo mojado a lo largo de los bordes y las líneas centrales para ayudar a que la masa se pegue. Doble cada borde largo hacia el centro y presione hacia abajo la unión para evitar que se abra de golpe al cocinar. Ahora debería tener un rectángulo largo y delgado.", "Mojar a lo largo de la unión y doblar por la mitad para juntar los bordes cortos. Presione hacia abajo para ayudar a sellar la unión húmeda. A continuación, junte los dos bordes largos, humedeciendo la línea de plegado como antes. Ahora debe pesto en los dos bucles exteriores y tomate en los dos interiores. Corta en rebanadas de 1cm / ½ en gruesas y colócalas en bandejas de hornear engrasadas, dándoles suficiente espacio para expandirse mientras hornean. Enfríe por 20 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee durante 15-20 minutos o hasta que la masa esté crujiente y dorada. Si los centros están crudos, délos vuelta cuidadosamente y hornee por otros 2-3 minutos. Deje enfriar en la bandeja."], "url": "www_bbc_co_uk_food_recipes_pesto_and_sun-dried_13834", "title": "Pesto y palmisteras secadas al sol", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 16 palmisteras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pesto_and_sun-dried_13834_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 pechugas de pollo cocidas, despellejadas, deshuesadas, cortadas a la mitad horizontalmente y cortadas en tiras finas", "2 aguacates maduros grandes, pelados y en rodajas", "½ limón, solo jugo", "½ pepino", "18 tomates baby ciruela, cortados a la mitad longitudinalmente", "4 cucharadas de pesto fresco de albahaca verde", "6 cucharadas de mayonesa light", "½ limón, solo jugo", "sal y pimienta negra recién molida", "25 g / 1 oz de piñones, tostados", "ensalada micro", "hojas de albahaca"], "method": ["Para hacer el aderezo, ponga el pesto, la mayonesa y el jugo de limón en un tazón grande, sazone con sal y pimienta y mezcle para combinar. Agregue el pollo y revuelva de nuevo. Si es posible, déjelo marinar durante varias horas o toda la noche.", "Coloque las rodajas de aguacate en un recipiente aparte, vierta sobre el jugo de limón y mezcle para que el aguacate esté completamente cubierto.", "Corte el pepino por la mitad a lo largo, use una cucharilla para quitar y deseche las semillas y luego pele con un pelador de patatas. Cortar en rebanadas en forma de media luna y organizar estos en capas con las rodajas de aguacate, mitades de tomate y pollo al pesto. Condimentar con sal y pimienta. (Si se arma antes, no agregue sal hasta justo antes de servir).", "Esparce sobre los piñones tostados, la ensalada micro y las hojas de albahaca para terminar."], "url": "www_bbc_co_uk_food_recipes_pesto_lemon_chicken_88391", "title": "Pesto pollo al limón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pesto_lemon_chicken_88391_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "Sal de mesa 10g / ⅓oz", "25 g / 1 oz de azúcar en polvo", "10g / ⅓oz de levadura de acción rápida", "30g / 1oz de mantequilla sin sal", "2 huevos grandes de gallinas camperas, golpeados", "50ml / 2fl oz de leche semidesnatada", "aceite de oliva, para engrasar", "1 cebolla roja, en rodajas", "1 pimiento rojo, cortado en tiras", "Squ calabaza de calabaza mediana, cortada en tiras de aproximadamente 5 cm / 2 pulgadas de largo y 5 mm de ancho", "aceite de oliva, para lloviznar", "100g / 3½oz de feta", "50g / 1¾oz de nueces sin cáscara, rotas en trozos pequeños", "50g / 1¾oz de piñones", "50g / 1¾oz de parmesano (o un queso duro vegetariano similar)", "150ml / 5½fl oz de aceite de oliva", "2 dientes de ajo, pelados", "albahaca grande", "1 huevo grande de gallinas camperas", "10g / ⅓oz piñones", "sal marina copos, al gusto", "pimienta negra rajada, al gusto"], "method": ["Para hacer la masa, coloca la harina de pan en un tazón grande. Agregue la sal, el azúcar, la levadura, la mantequilla, los huevos batidos, la leche y aproximadamente 25 ml / 1 fl oz de agua tibia. Mezcle hasta que esté combinado. Agregue hasta 100 ml / 3½ fl oz de agua tibia, mezclando entre adiciones hasta que tenga una masa suave.", "Enharinar ligeramente una superficie de trabajo y amasar la masa durante aproximadamente 10 minutos, o hasta que esté suave y elástica.", "Engrase ligeramente un tazón grande y agregue la masa. Cubra con película adhesiva y déjela a un lado para comprobar durante aproximadamente una hora.", "Para el llenado, precaliente el horno a 170 C / 325 F / Gas 3.", "Coloque la cebolla, el pimiento y la calabaza en bandejas de horneado separadas, rocíe con aceite de oliva y tueste en el horno durante aproximadamente 15 minutos o hasta que estén tiernos.", "Mientras tanto, haz el pesto. Caliente una sartén pequeña y seca a fuego lento. Agregue los piñones y las tostadas hasta que estén ligeramente dorados. Agregue los piñones y todos los ingredientes pesto restantes a un procesador de alimentos y mezcle hasta que quede suave.", "Para terminar el pan, retire la masa probada amasando durante 20 segundos, luego córtela en dos. Envuelva la mitad en película adhesiva engrasada y déjela a un lado.", "En una superficie de trabajo ligeramente enharinada, enrolle la mitad restante de la masa en un círculo con un diámetro de aproximadamente 30 cm. Deje que la masa descanse durante unos cinco minutos; se encogerá hacia atrás. Estirar de nuevo a un diámetro de aproximadamente 32 cm / 13 in y colocar en una bandeja de horno grande.", "Extienda tres cucharadas de pesto sobre la masa y apile las verduras tostadas, el queso feta y las nueces por encima en capas, haciendo que las capas sean un poco más profundas en el centro. Esto formará la base del pan.", "Estirar la masa restante como en el paso 8. Esto hará que la capa superior.", "Cepille los bordes de la base con un poco de agua y levante cuidadosamente la capa superior sobre la base.", "Utilice un cuchillo afilado para recortar la masa en un círculo ordenado (aproximadamente 30 cm / 12 pulgadas de diámetro). Coloque un recipiente pequeño sobre el relleno. Con un cuchillo afilado, corte la masa en 16 tiras de igual tamaño que irradian del recipiente. Con cuidado, gire cada tira dos veces y corte los extremos en puntos. Presione el extremo de cada tira en la bandeja para hornear para evitar que se deshagan mientras prueban. Reserve para probar durante aproximadamente 30 minutos.", "Precalentar el horno a 190C / 375F / Gas 5.", "Para el aderezo, cepille la parte superior de la masa con el huevo batido y espolvoree los piñones, sal y pimienta en el centro. Hornee durante 20-25 minutos, o hasta que estén doradas. Revise después de 15 minutos y cubra los giros con papel de aluminio si se doran demasiado rápido. Dejar que se enfríe antes de servir."], "url": "www_bbc_co_uk_food_recipes_pesto_pinwheel_94572", "title": "Molinillo de pesto", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Papas de 450g / 1lb (Désirée o King Edward)", "50g / 2oz de mantequilla", "1x120g de salsa fresca de pesto", "sal y pimienta negra recién molida"], "method": ["Use un pelador de patatas para cortar las pieles lo más finamente posible y luego corte las papas en trozos de tamaño uniforme, no demasiado pequeños. Si son grandes, córtelos y si son pequeños, divídalos a la mitad.", "Coloque los trozos de papa en una cacerola grande, luego vierta agua hirviendo sobre ellos, agregue 1 cucharada de sal, ponga una tapa y cocine a fuego lento hasta que estén completamente tiernos, deben tomar aproximadamente 25 minutos. La forma de saber si están listos es atravesándolos con un pincho en la parte más gruesa; la papa no debería ser dura en el centro. Y debe tener cuidado aquí, porque si son un poco infrautilizados se acumulan grumos.", "Cuando las papas estén cocidas, escúrralos. Cúbralos con un trapo de té limpio para absorber parte del vapor durante unos 5 minutos, luego agregue el pesto y un aderezo de sal y pimienta. Con un batidor de mano eléctrico, comience a batir a baja velocidad para romper las papas, luego aumente la velocidad a velocidad y agréguelas hasta obtener un puré suave.", "Ahora regrese la cacerola a fuego lento y use una cuchara de madera para dar vuelta las papas hasta que se calienten (aproximadamente 1 minuto), y ahora están listas para servir."], "url": "www_bbc_co_uk_food_recipes_pestomash_67178", "title": "Masa de pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pestomash_67178_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina", "1 huevo de gallinas camperas", "1 cucharadita de aceite de oliva", "puñado de albahaca fresca", "1 cucharadita de piñones", "1 diente de ajo, aplastado", "100ml / 3½fl oz de aceite de oliva", "50 g / 1 oz queso feta, desmenuzado, para servir", "1 cucharada de piñones, para servir"], "method": ["Para la pasta, mezcle la harina, el huevo y el aceite en un procesador de alimentos para hacer una masa firme.", "Despliegue en una máquina de pasta, reduciendo gradualmente el espesor del rodillo hasta que alcance el ajuste más delgado.", "Luego pase el accesorio de espagueti para hacer un puñado de espagueti fresco.", "Cueza en una cacerola llena de agua hirviendo con sal durante dos minutos o hasta que estén tiernas.", "Para hacer el pesto, usando un pequeño procesador de alimentos, mezcle la albahaca, los piñones, el ajo y el aceite de oliva.", "Revuelva a través de la pasta cocida y sirva con el queso feta y los piñones desmenuzados."], "url": "www_bbc_co_uk_food_recipes_pestopastawithfetaan_75698", "title": "Pasta al pesto con queso feta y piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 puñados grandes de hojas frescas de albahaca", "25 g / 1 oz de piñones", "3 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "25 g / 1 oz de queso parmesano, rallado", "½ filete de lubina, piel anotada", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 tomate de vid, semillas eliminadas, picadas", "1 diente de ajo, finamente picado", "½ limón, solo jugo", "150g / 5½oz de tagliatelle fresco cocido, mantenido caliente", "puñado floretes de brócoli, blanqueados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la salsa de pesto, coloque todos los ingredientes de pesto en el tazón de un pequeño procesador de alimentos y pulse hasta que quede suave.", "Para la lubina asada, caliente una sartén a prueba de horno hasta que esté caliente y lubrique el pescado. Dobla el bajo en ambos lados, luego transfiéralo al horno para asar durante 4-5 minutos, o hasta que esté bien cocido.", "Para la salsa vierge, coloque todos los ingredientes en una sartén y caliéntelos suavemente durante 4-5 minutos.", "Para servir, revuelva el pesto a través de los tallarines cocidos y colóquelo en un plato para servir. Coloque el filete de bacalao asado en la parte superior y coloque los floretes de brócoli alrededor del lado. Rocíe sobre la salsa vierge."], "url": "www_bbc_co_uk_food_recipes_pestopastawithroaste_88655", "title": "Pasta al pesto con lubina asada y salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fresas de 400g / 14oz, idealmente fresas Albion, descascadas y reducidas a la mitad", "300g / 10½ oz de mermelada de azúcar", "1 limón, solo jugo", "1 rosa perfumada de grado alimentario, separada en pétalos", "2 cucharaditas de agua de rosas", "mantequilla del botón (opcional)"], "method": ["Pon a punto las fresas en una sartén grande y cocínalo a fuego medio durante unos 20 minutos.", "Agregue el azúcar y el jugo de limón y mantenga la sartén a fuego medio para disolver el azúcar. No hierva hasta que el azúcar se haya disuelto.", "Ponga la mezcla a hervir (la mezcla debe burbujear vigorosamente de manera que si sube a la parte superior de la sartén no se puede remover), revolviendo ocasionalmente para evitar que se queme en el fondo de la sartén. Cocine por unos 20 minutos.", "Agregue los pétalos de rosa y agua de rosas y cocine por otros dos minutos.", "Quítese el fuego, use una cuchara para eliminar cualquier espuma que llegue a la parte superior, y agregue un pomo de mantequilla si le gusta. Revuelva suavemente para eliminar las burbujas. Deje reposar la mezcla durante un par de minutos y luego vierta en recipientes esterilizados."], "url": "www_bbc_co_uk_food_recipes_petalberry_jam_79158", "title": "Reloj Petalberry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 2 jarras de 250 ml / 9 fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/petalberry_jam_79158_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas de tocino, finamente picadas", "1 diente de ajo", "½ cebolla, finamente picada", "100 ml / 4 fl oz crema doble", "110g / 3½oz de guisantes congelados", "1 pequeña joya de lechuga, hojas separadas", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco picado", "3 rebanadas de tocino, cocidas hasta que estén doradas"], "method": ["Freír el tocino picado en una sartén grande y profunda hasta que empiece a dorarse. Agregue el ajo y la cebolla y cocine suavemente durante dos minutos, luego agregue la crema y los guisantes y deje que hierva.", "Agregue la lechuga y deje hervir durante un minuto, condimentar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta en un recipiente, espolvoree con el perejil y cubra con las rebanadas de tocino cocidas."], "url": "www_bbc_co_uk_food_recipes_petitpoisalafrancais_84115", "title": "Guisante en el francés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 claras de huevo grandes", "Azúcar en polvo blanca 4oz / 110g", "2x250 g de crema de castañas de Ardèche (puré de castañas endulzado), refrigerado", "9oz / 250g de mascarpone", "7fl oz / 200ml 8 por ciento de crema de queso", "1 cucharada de azúcar impalpable redondeada", "1 cucharadita de extracto de vainilla", "un poco de azúcar glas"], "method": ["Precaliente el horno a 150C / 300F / Gas 2.", "Para hacer los merengues, coloque las claras de huevo en un tazón grande y, usando un batidor de mano eléctrico a baja velocidad, comience a batir. Continúe durante aproximadamente 2 minutos, hasta que los blancos estén espumosos, luego cambie la velocidad a medio y continúe batiendo por 1 minuto más. Ahora cambie la velocidad a alta y continúe batiendo hasta que las claras de huevo alcancen la etapa de pico rígido. A continuación, bata el azúcar a velocidad rápida, poco a poco (aproximadamente una cucharada de postres), hasta que tenga una mezcla tersa y brillante.", "Ahora todo lo que debes hacer es colocar cucharadas de cucharadas soperas de la mezcla sobre la bandeja para hornear preparada, espaciando de manera uniforme. Luego, usando la parte posterior de la cuchara o una pequeña espátula, ahueque los centros. No se preocupe si no tienen la misma forma: al azar y rocoso es cómo los describiría. A continuación, colóquelos en el estante central del horno, reduzca inmediatamente el calor a la marca de gas 1, 2750F (1400C) y déjelos durante 30 minutos. (Para obtener información importante sobre cómo cocinar en la marca de gas 1, haga clic aquí). Después de eso, apague el horno y deje que los merengues se sequen al calor del horno hasta que esté completamente frío (generalmente alrededor de 4 horas) o toda la noche. Los merengues se almacenarán bien en una caja de estaño o polietileno, e incluso se congelarán extremadamente bien.", "Para ensamblar los Monts Blancs, vierta cantidades iguales de la créme de marrons en cada merengue, mezcle los ingredientes de cobertura juntos y coloque las cantidades iguales en la parte superior del puré de castañas. Una ligera capa de azúcar glas es buena para una imagen de montaña coronada de nieve."], "url": "www_bbc_co_uk_food_recipes_petitsmontsblancs_68027", "title": "Pequeñas montañas blancas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 coronas de faisán, limpiadas y lavadas", "500ml / 18fl oz de caldo de pollo", "1 apio", "1 parecía", "1 cebolla", "2 dientes de ajo, dejados enteros", "Cebada perlada de 400 g / 14 oz", "500ml / 18fl oz de caldo de pollo", "2 ramitas de tomillo fresco", "5 g de levadura fresca mezclada con 2 cucharadas de agua", "2 cucharadas de vinagreta de limón", "2 cucharadas de aceite de oliva", "2 chalotes, cortados en cubitos", "1 cucharadita de comino", "1 cucharadita de semillas de comino", "100 g / 3½ oz de lardo, finamente cortado en cubitos", "8 fechas frescas", "8 zanahorias baby purple, lavadas, sin capucha y reservadas", "8 zanahorias naranjas bebé, lavadas, tapas removidas y reservadas", "8 zanahorias amarillas para bebés, lavadas, sin la parte superior y reservadas", "100g / 3½oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "8 piezas de champiñones de melena de león", "sal y pimienta negra recién molida", "1 cucharada de cebollino picado", "100ml / 3½fl oz de aceite de oliva"], "method": ["Para el faisán, ponga a hervir el caldo en una sartén grande, agregue las coronas y cocine por 20 minutos. Para probar que la carne esté cocida, perfore con un pincho y verifique que los jugos estén limpios.", "Para la cebada perlada, ata el apio, el puerro, la cebolla y el ajo en una tela de queso. Poner en una sartén con la cebada perlada, caldo de pollo, tomillo y levadura. Cocine a fuego lento durante unos 45 minutos, hasta que la cebada esté suave pero conserve su forma. Retire la gasa y drene la cebada. Sazonar con sal y vinagreta de limón.", "Para las fechas condimentadas, en una sartén, cocine la chalota en el aceite sin colorear. Agregue las semillas de comino y alcaravea. Freír las especias suavemente con la chalota hasta que estén suaves, dejar enfriar y luego mezclar en el lardo.", "Retire la piel y las piedras de las fechas, manteniendo las fechas completas. Rellena cada fecha con la mezcla de lardo y arrástrala a su forma original. Justo antes de servir, recaliente las fechas en un horno caliente.", "Cocine las zanahorias en agua hirviendo con sal hasta que estén al dente. Calienta la mantequilla en una sartén limpia hasta que esté espumante. Agregue las zanahorias y el abrigo en la mantequilla, retire del fuego.", "Freír las piezas de champiñones en aceite de oliva hasta que estén crujientes. Condimentar con sal y pimienta.", "Para el aceite de cebollino, caliente el aceite a 80 ° C y agregue las cebolletas. Infundir durante unos minutos, dejar enfriar y luego mezclar en un procesador de alimentos hasta que quede suave. Pase la mezcla a través de un colador fino.", "Justo antes de servir, caliente un poco de aceite en una sartén hasta que esté caliente y cocine las coronas cocidas para que crujen la piel. Talla el pecho de la corona.", "Para servir, cuchara la cebada perlada en dos platos y cubra con los pechos de faisán. Adorne con las fechas, zanahorias, champiñones y aceite de cebollino."], "url": "www_bbc_co_uk_food_recipes_pheasant_breast_with_48020", "title": "Pechuga de faisán con cebada perlada, zanahorias glaseadas y dátiles especiados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1kg / 2lb 4oz faisán de gallina", "sal y pimienta negra recién molida", "1 ramita de romero", "Tocino rebanado 100 g / 3½ oz", "3 cucharadas de aceite de oliva", "75ml / 2½fl oz de vino Marsala seco", "100 g / 3½ oz de castañas frescas", "1 cabeza trevisse tardivo achicoria roja, hojas separadas", "½ cabeza de castelfranco achicoria, hojas separadas", "½ cucharadita de vinagre balsámico", "1 manojo de hojas de diente de león", "1 cucharadita de menta picada", "½ granada, solo semillas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sazonar el interior del faisán con sal y pimienta y rellenarlo con romero. Envuelva la panceta sobre el faisán y asegúrela con la cuerda del cocinero.", "En una sartén resistente al horno, de base pesada, caliente una cucharada de aceite de oliva y cocine el faisán por todos lados para sellar y colorear un marrón dorado claro. Agregue el Marsala a la sartén y colóquelo en el horno durante 25-30 minutos, dependiendo del tamaño del faisán. Retirar del horno y dejar enfriar.", "Anotar las castañas en su lado plano y hervir en agua durante 10-15 minutos. Retire de la sartén y deje enfriar.", "Lave bien las hojas de la ensalada y séquelas. Mezcle las hojas de ensalada con dos cucharadas de aceite de oliva y el vinagre balsámico. Sazone con sal y pimienta, luego mezcle el diente de león, la menta y la granada.", "Quita la panceta del ave y corta en tiras pequeñas.", "Talla el faisán para que tengas una buena mezcla de carne de pechuga y pierna.", "Cortar las castañas por la mitad y sacar el interior con una cucharadita.", "Para servir, ponga un montón de faisán en cada plato y vierta un poco del jugo de la sartén en la que se cocinó el faisán. Agregue una cucharada de castañas, algunas piezas de panceta y sirva con la ensalada."], "url": "www_bbc_co_uk_food_recipes_pheasant_salad_with_16420", "title": "Ensalada de faisán con castañas frescas, granada, diente de león y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bulbo de ajo, dejado entero", "Crema doble 500ml / 17fl oz", "½ manojo de cebollín fresco, picado", "4 pechos de faisán, sin piel", "120g / 4½oz de harina natural, condimentada con sal y pimienta negra recién molida", "200g / 7oz de pan de masa fermentada seca", "2 huevos de gallinas camperas", "aceite vegetal, para freír poco", "30g / 1¼oz de aderezo francés listo para usar", "30g / 1¼ oz de miel clara", "30ml / 1¼fl oz de vinagre balsámico blanco", "500ml / 17fl oz de aceite vegetal", "1 cucharadita de chalote en cubos", "½ diente de ajo, en rodajas", "1 cucharadita de hojas de perejil fresco picado", "1 cucharadita de cebolletas frescas picadas", "1 cucharadita de hojas de albahaca fresca picada", "1 cucharadita de hojas de tomillo fresco picado", "Habas de 500g / 1lb 2oz, doblemente envasadas", "200 g / 7 oz de guisantes frescos, las vainas retiradas", "2 cucharadas de aceite de colza", "100g / 3½ oz de cobnuts frescos, tostados", "1 cucharadita de sal", "15g / ½ oz de ajos rojos picados", "½ cabeza de lechuga frisee (o lechuga amarga similar con bordes con volados), solo hojas externas", "15 g / ½ oz de hojas de lechuga de cordero", "pellizque las hojas de estragón"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Envuelva el bulbo de ajo en papel de aluminio y colóquelo en una bandeja para hornear. Hornee durante 40-45 minutos, o hasta que los dientes estén suaves y el ajo se pueda exprimir. Poner a un lado hasta que el ajo esté lo suficientemente frío como para manejarlo. Corta la parte superior del ajo, luego exprime todo el ajo en un tazón. Picar si es necesario, o machacar con un tenedor hasta que quede suave.", "Vierta la crema doble en el tazón de un mezclador de alimentos independiente y revuelva durante 3-5 minutos con el accesorio batidor, o hasta que los trozos de mantequilla hayan subido a la superficie de la crema y la mezcla restante sea líquida. Forre un tamiz fino con tela de muselina y colóquelo sobre un tazón grande. Cuele la crema agitada a través del colador, envolviendo la muselina alrededor de los grumos de mantequilla y exprimiendo la mayor cantidad de líquido posible. Deseche el líquido filtrado.", "Mezcle la mantequilla con el ajo molido hasta que esté bien combinado. Sazone con una pizca de sal generosa, luego agregue las cebolletas hasta que estén bien combinadas.", "Con un cuchillo afilado, corte un bolsillo ancho y profundo en la parte más gruesa de cada pechuga de faisán, justo debajo del filete interno, sin romper el otro lado del pecho del faisán. Llene cada bolsillo con la mantequilla de ajo y enfríe en la nevera durante 30 minutos.", "Aumente la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Espolvoree la harina en un plato y el pan rallado en un plato aparte. Batir los huevos en un tazón. Espolvorea cada pechuga de faisán en la harina, luego sumérgela en el huevo batido y luego enróllala hasta que esté completamente cubierta. Regrese a la nevera para enfriar por otros 10 minutos.", "Calentar el aceite en una sartén a fuego medio a alto hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Fríe el faisán Kievs, en tandas si es necesario, durante 1-2 minutos en cada lado, o hasta que estén doradas por todas partes. Transfiera al horno y cocine por otros 6-8 minutos, o hasta que el faisán se haya cocinado por completo.", "Para el aderezo, mezcle todos los ingredientes en un procesador de alimentos hasta que esté suave y bien combinado. Dejar de lado.", "Para la ensalada, ponga a hervir una cacerola grande de agua con sal y blanquee las habas y los guisantes por 1-2 minutos, o hasta que estén tiernos. Luego refresca en agua helada. Escurrir bien.", "Mezcle los frijoles con los ingredientes restantes de la ensalada en un tazón grande. Rocíe con el aderezo y mezcle de nuevo.", "Para servir, coloque un faisán Kiev en el centro de cada plato y apile la ensalada al costado."], "url": "www_bbc_co_uk_food_recipes_pheasant_kiev_with_a_34098", "title": "Faisán Kiev con habas, guisantes, estragón y ensalada de nueces", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de pechuga de faisán", "Harina normal de 75 g / 2½ oz", "3 huevos de gallinas camperas, ligeramente golpeados", "125g / 4½oz de pan rallado fresco", "2 cucharadas de aceite de colza", "75g / 2½oz de mantequilla sin sal", "aceite vegetal, para freír", "2 patatas grandes harinosas, peladas y cortadas en trozos de 1cm / ½ in de espesor", "4 huevos de faisán o pato", "8 filetes de anchoa", "1 cucharadita de alcaparras", "sal marina y pimienta negra recién molida"], "method": ["Coloque cada pechuga de faisán entre dos hojas de película adhesiva y, con un mazo de carne o un rodillo, aplánelos a aproximadamente 1 cm / ½ de espesor. Deseche la película adhesiva.", "Incline la harina, los huevos batidos y las migas de pan en platos separados poco profundos. Dragar los pechugas de faisán en harina, luego huevo y finalmente las migas de pan, revolviéndolos para cubrirlos completamente.", "Caliente una sartén antiadherente a fuego medio. Agregue un poco de aceite y mantequilla y fríe los pechugas de faisán en cada lado hasta que estén dorados y recién cocidos (puede necesitar hacer esto en tandas).", "Mientras tanto, llene una freidora con aceite vegetal y caliente a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue las virutas a la freidora y cocine durante 6-8 minutos, o hasta que estén doradas. Transfiera al papel de cocina para drenar. Sazone con sal, al gusto y mantenga caliente hasta que esté listo para servir.", "En una sartén separada, caliente un poco de aceite y mantequilla y fríe los huevos hasta que estén cocidos a su gusto. Sazone los huevos con sal y pimienta.", "Para servir, coloque los pechugas de faisán en los platos para servir y cubra cada uno con un huevo frito. Coloque las anchoas y las alcaparras encima del huevo y sirva las papas al lado."], "url": "www_bbc_co_uk_food_recipes_pheasant_fried_egg_and_65194", "title": "Faisán, huevo frito y patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 faisán listo para asar (aproximadamente 1 kg / 2 lb 4 oz)", "1 ramita de romero", "4 rebanadas de tocino", "1 pequeño apio nabo, pelado y cortado en cubos de 1cm / ½ en", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de vino Marsala seco", "300 ml / 10 fl oz de leche", "Crema doble 50ml / 2fl oz", "1 diente de ajo, en rodajas", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Rellene el faisán con el romero y sazone con sal y pimienta (por dentro y por fuera). Envuelve las rebanadas de panceta sobre el faisán para proteger los senos y ata el cordón alrededor del ave para que la panceta esté segura y no se caiga. Dejar de lado.", "Cocine el apionabo en una olla con agua hirviendo durante aproximadamente 10 minutos, o hasta que un cuchillo pase por las piezas con facilidad. Escurrir y poner a un lado.", "Calentar una sartén resistente al horno de base pesada, agregar el aceite y dorar el faisán para darle un color dorado claro por todas partes. Retire el faisán de la sartén y deseche la grasa. Agregue Marsala y hierva durante 1 minuto para reducir el volumen de líquido. Agregue el apio nabo cocido, la leche, la crema y el ajo y deje que hierva. Retire del fuego.", "Regrese el faisán a la sartén y cubra con papel de hornear. Asar durante 12-15 minutos, o hasta que los jugos salgan limpios cuando el muslo del faisán se pinche con un pincho. Retire el papel de hornear y vuelva a colocar la sartén en el horno para que se cocine durante 5 minutos más para que los jugos se puedan reducir y el faisán pueda obtener un poco más de color.", "Transfiera el faisán a una tabla de cortar y déjelo reposar durante 10 minutos (mantenga caliente el apio nabo). Retire la cuerda y, con un cuchillo afilado, corte a lo largo del esternón para quitarse los senos. Entonces corta las piernas.", "Divida los senos y las piernas entre dos platos calentados y ponga una cuchara sobre el apionabo y los cremosos jugos de cocina. Sirva con algunos verdes de primavera al vapor simples arrojados con un buen aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pheasant_simmered_in_48387", "title": "Faisán hervido a fuego lento en leche, crema y apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechos de faisán (pechos de gallina joven si es posible ya que no serán tan duros)", "4 lonchas grandes, tocino ligeramente ahumado", "500ml / 17fl oz de sidra seca", "5 chalotes", "botón de mantequilla", "1 cucharadita de azúcar en polvo", "Harina normal de 30g / 1oz", "100ml / 7tbsp de crema de grasa completa"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Unte con mantequilla los pechugas de faisán y luego envuelva el tocino. Coloque en un plato resistente al horno (para que no se aprieten demasiado) y luego póngalo en el horno por 25 minutos.", "Después de 25 minutos, reduzca la temperatura del horno a 170 C / 325 F / Gas 3, vierta 250 ml / 8 onzas líquidas de la sidra sobre las pechugas de faisán, cúbralo con una tapa o papel de aluminio y vuelva al horno por otros 60 minutos.", "Hacia el final del tiempo de cocción de los faisanes, vierta la sidra restante en una cacerola y cocine hasta que el volumen de líquido se haya reducido a la mitad.", "Cortar finamente las chalotas y cocinar muy lentamente en un poco de mantequilla hasta que estén suaves. Luego agregue el azúcar impalpable y continúe cocinando hasta que esté ligeramente caramelizado. Retire del fuego hasta que esté listo para terminar la salsa.", "Verifique los senos de faisán durante el tiempo de cocción para asegurarse de que no se sequen y agregue más sidra si es necesario.", "Para terminar la salsa, agregue la harina a las chalotas, coloque la sartén nuevamente a fuego lento y mezcle. Es posible que necesite agregar un poco más de mantequilla en esta etapa si los chalotes están muy secos, pero no deberían estarlo. Ahora agregue la reducción de sidra y la crème fraîche y cocine a fuego lento hasta que la salsa comience a espesarse.", "Una vez listo para servir, corte cada seno en aproximadamente cinco rebanadas y colóquelo en el plato con la forma de todo el seno. Vierta la salsa sobre la carne y sirva."], "url": "www_bbc_co_uk_food_recipes_pheasantbreastsbrais_1003", "title": "Pechos de faisán estofados en sidra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pheasantbreastsbrais_1003_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cubo de caldo de pollo", "15 g / ½ oz secos de setas mezcladas", "2 cucharadas de aceite de girasol", "100 g / 3½ oz de hongos silvestres frescos mezclados, como rebozuelos, frotados o cepillados, y en rodajas si son grandes (o champiñones portabellini en rodajas de 150 g / 5½ oz)", "6 lonchas de tocino rayado ahumado sin corteza, cortadas en rodajas de 1.5cm / ¾in", "1 cebolla, finamente picada", "6 pechugas de faisán sin piel, cada una cortada en 6 piezas", "2 dientes de ajo, aplastados", "100ml / 3½fl oz de puerto leonado o rubí", "3 cucharadas de harina común", "2 cucharadas colmadas de hojas de perejil fresco finamente picado", "1 kg / 2 libras 4 oz patatas harinas, preferiblemente Maris Piper o King Edwards", "50g / 1¾oz de mantequilla, en cubos", "4 cucharadas de leche", "sal y pimienta para probar", "2 cucharadas de aceite de trufa"], "method": ["Vierta 300 ml / 10 fl oz de agua recién hervida en una jarra y mezcle la mitad de un cubo de acción hasta que se disuelva. Agregue los hongos secos y mezcle bien. Déjalo en remojo durante 30 minutos.", "Para hacer el puré, pele las papas y córtelas en trozos de aproximadamente 4 cm / 1½ pulgadas. Ponga una olla grande antiadherente y cubra con agua fría. Llevar a ebullición, luego reducir el fuego ligeramente y hervir a fuego lento durante 15-18 minutos, o hasta que esté muy tierno.", "Escurrir las papas en un colador y luego volver a la cacerola y puré con la mantequilla, la leche y mucha sal y pimienta hasta que quede suave. Vuelva a colocar la cocina a fuego muy lento hasta que el relleno del faisán esté listo, revolviendo ocasionalmente.", "Incline los champiñones remojados y su caldo en un colador sobre un recipiente para drenar y reservar el líquido. Transfiera los champiñones a una tabla de cortar y corte muy bruscamente. Echa un vistazo al licor y si es muy arenoso, pasa a través de muselina o un colador fino y en un recipiente limpio.", "Caliente una cucharada de aceite en una sartén antiadherente grande o saltee la sartén y fría los champiñones frescos y remojados a fuego medio durante dos minutos, revolviendo ocasionalmente. Incline sobre un plato y regrese la sartén al fuego.", "Agregue una cucharada más de aceite a la sartén y fría el tocino y la cebolla durante 2-3 minutos o hasta que empiecen a dorarse, revolviendo regularmente. Sazone bien el faisán con sal y pimienta y agregue a la sartén con la cebolla y el tocino. Freír durante dos minutos, volteando el faisán en la sartén de vez en cuando hasta que esté ligeramente dorado.", "Trabajando rápidamente, agregue el ajo y el puerto a la olla y permita que el líquido burbujee furiosamente durante unos segundos. Espolvorea la harina y revuelve a través del faisán y las verduras hasta que esté ligeramente cubierta.", "Poco a poco agregue el hongo reservado y el líquido de caldo de pollo, raspando el fondo de la sartén para levantar el sedimento y los jugos pegajosos. Agregue los champiñones a la sartén y agregue el perejil. Deje que se cocine a fuego lento y cocine durante cinco minutos, o hasta que el faisán esté recién cocido y la salsa se haya espesado, revolviendo regularmente. Retire del fuego.", "Precalentar la parrilla a su temperatura más alta. Hervir un hervidor de agua y llenar a la mitad un plato refractario de 1.6 litros / 3 libras 8 oz. El agua caliente calentará el plato. Deje actuar durante dos minutos y luego cuidadosamente incline el agua hacia el fregadero. Coloque la mezcla de faisán en el plato.", "Con una cuchara, coloca el puré de patatas sobre el faisán, girando por los lados antes de dirigirte al centro. Coloque el pastel en una bandeja para hornear y ase a la parrilla durante 6-8 minutos, o hasta que la papa esté ligeramente dorada. Rocíe el pastel con el aceite de trufa, si se usa, y sirva."], "url": "www_bbc_co_uk_food_recipes_pheasant_wild_mushroom_82171", "title": "Faisán, setas silvestres y tocino 'pastel'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55ml / 2fl oz de aceite de oliva", "Alas de pollo 1kg / 2lb", "2 chalotes, pelados y finamente cortados", "2 hojas de laurel", "75ml / 2½fl oz Madeira", "75ml / 2½fl oz de vino blanco", "1,5 litros / 2 pintas de caldo de pollo", "1 coliflor, rota en florecillas", "55 g / 2 oz de mantequilla", "2 chalotes, pelados y finamente cortados", "4 cucharadas de crema doble", "1 bulbo de ajo, cortado por la mitad", "aceite de oliva, para lloviznar", "4 pechos de faisán", "ramitas de tomillo fresco"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para hacer la salsa, caliente el aceite en una olla grande. Agregue las alitas de pollo y cocine a fuego alto hasta que se coloreen por completo.", "Vierta el exceso de aceite y agregue los chalotes y las hojas de laurel y cocine durante dos minutos.", "Agregue el vino blanco y Madeira, deje hervir y luego reduzca el fuego y cocine a fuego lento hasta que el líquido se reduzca a la mitad.", "Agregue el caldo y vuelva a cocinar a fuego lento durante 1 hora, rozando regularmente cualquier residuo de la superficie.", "Colar la salsa en una sartén limpia, volver al fuego, llevar a ebullición y desnatar nuevamente.", "Para hacer el puré de coliflor, cortar los floretes de coliflor en trozos pequeños.", "Derrita un poco de mantequilla en una sartén grande a fuego medio. Agregue los chalotes y la coliflor y el sudor hasta que estén suaves pero no coloreados.", "Transfiera la mezcla a un procesador de alimentos. Mezcle la mezcla mientras agrega la crema lentamente, hasta que se forme un puré suave.", "Coloque el puré en una olla pequeña y manténgalo caliente.", "Mientras tanto, coloque las mitades del bulbo de ajo con el lado del corte hacia abajo en una sartén antiadherente para horno. Rocíe un poco de aceite de oliva y coloque a fuego medio hasta que el ajo comience a colorear.", "Transfiera a un horno caliente y tueste por 8-10 minutos.", "Mientras tanto, calienta una sartén a prueba de horno. Agregue las pechugas de faisán, con la carne hacia abajo y cocine por un minuto, o doradas. Voltee las pechugas del faisán y transfiéralas al horno y tueste durante 5-6 minutos, o hasta que estén cocidas. Retire el faisán del horno y déjelo reposar durante 3-4 minutos.", "Para servir, cortar cada pechuga de faisán y colocar en cuatro platos individuales. Adorne con las ramitas de tomillo y sirva con la salsa, el puré de coliflor y el ajo asado."], "url": "www_bbc_co_uk_food_recipes_pheasantbreastwithca_79505", "title": "Pechuga de faisán con puré de coliflor y ajo asado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "2 cucharadas de aceite vegetal", "4 pechos de faisán", "1 cebolla roja, pelada y rebanada", "1 diente de ajo, pelado y aplastado", "Tocino rayado ahumado 125g / 4oz, deshilachado y picado", "1-2 cucharadas de harina común", "150ml / 5fl oz de sidra seca", "450 mls / 15fl oz de caldo de pollo", "1 cucharada de vinagre de sidra", "1 ramita de tomillo", "1 hoja de laurel", "500 g de patatas harinas, peladas y en cubos", "2 manzanas Bramley, peladas, sin corazón y picadas", "500g de apio nabo, pelado y cubos", "1 cucharada de perejil fresco picado", "2 cucharadas de crema agria", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla y el aceite en una cacerola grande y dore los pechugas del faisán. Poner en un plato.", "Agregue la cebolla, el ajo y el tocino y cocínelos durante 3-4 minutos hasta que la cebolla comience a ablandarse.", "Agregue la harina y cocine por un minuto. Agregue la sidra, el caldo, el vinagre, el tomillo y la hoja de laurel. Sazonar bien Llevar a ebullición y reemplazar las piezas de faisán. Baje el fuego para que el líquido burbujee suavemente y cubra. Cocine por 20-30 minutos hasta que el faisán esté cocido y la salsa espesada. No cocine demasiado o la carne se secará.", "Mientras tanto, ponga a hervir un sartén grande de agua con sal y agregue los cubos de patata, manzana y apio nabo. Hierva hasta que estén tiernos, escurra, agregue el perejil y la crema agria y un poco de pimienta negra molida. Mash hasta que quede suave. Sirva con la cazuela de faisán y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_pheasantcasserolewit_2261", "title": "Cazuela de faisán con apio nabo y puré de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 faisán entero, senos y patas retirados, canal cortada y reservada", "10g / ½ oz de sal marina preferiblemente flor de sal, más extra para condimentar", "½ cucharada de pimienta negra, aplastada", "½ diente de ajo, finamente cortado", "½ hoja de laurel fresca, rasgada", "2 ramitas de tomillo fresco, solo hojas", "1 baya de enebro, aplastada", "600g / 1lb 5oz de grasa de pato, más 1 cucharada", "pimienta negra recién molida", "150 g / 5 oz de cebolla, picada en piezas de 2 cm / 1 in", "1 ramita de tomillo fresco, solo hojas", "2 hojas frescas de salvia", "1 hoja de laurel fresca", "2 bayas de enebro, picadas", "120 g / 4 oz de champiñones planos, en rodajas", "100 g / 3½ oz de castañas cocidas, desmenuzadas", "30 g / 1½ oz de arándanos secos", "30 g / 1½ pz de arándanos secos", "sal marina y pimienta negra recién molida", "50-75ml / 1¾fl oz-2½fl oz de agua", "800 g / 1 libra de 12 oz de hojaldre con mantequilla listo para usar", "aceite vegetal, para engrasar", "2 huevos de gallinas camperas, golpeados", "40 g / 1½ oz de grasa de pato", "cadáver de faisán (ver arriba)", "4 bayas de enebro, aplastadas", "Cebolla blanca 110g / 4oz, en rodajas", "60g / 2oz de apio, en rodajas", "Seta plana de 80 g / 3 oz, en rodajas", "200 ml / 7 fl oz de vino de Madeira", "200ml / 7fl oz de puerto de rubí", "400ml / 14fl oz de agua", "sal y pimienta negra recién molida", "2 g / ¼ oz de arrurruz, mezclado con un poco de agua fría", "3 cucharadas de ciruelas pasas, sin piedras, en rodajas finas", "3 cucharadas de pasas doradas", "3 cucharadas de nueces, finamente picadas"], "method": ["Para los pithiviers, coloque las piernas, con la piel hacia abajo, en un tazón grande. Espolvorear sobre la sal del mar, granos de pimienta negra triturados, ajo en rodajas, hojas de tomillo, laurel y bayas de enebro trituradas. Mezcle ligeramente, cubra el recipiente y deje marinar en la nevera durante 6 horas. Este es un curado liviano para sazonar y sazonar ligeramente.", "Después de 6 horas, enjuague el adobo de la carne de la pierna y seque con una toalla de cocina limpia.", "Coloque 600 g / 1lb 5oz de grasa de pato en una olla pequeña y caliéntelo a 80-90C / 174-194F (controle la temperatura con un termómetro para alimentos) a fuego lento. Agregue las patas de faisán y vuelva a la misma temperatura. Cocine con cuidado durante 1 hora y 30 minutos, verificando a menudo para asegurarse de que la temperatura no supere los 90 ° C (194 ° F) (la grasa se mantendrá justo por debajo del punto de ebullición). Esta cocción suave romperá lentamente el colágeno firme dentro del tejido del músculo, cambiando la textura de la carne para que se derrita. Cuando las piernas estén cocidas, déjelas a un lado y deje que se enfríen en la grasa.", "Sazone las pechugas de faisán con un poco de sal marina y pimienta negra recién molida.", "Calentar una sartén hasta que esté a fuego medio, agregar la cucharada de grasa de pato y freír los pechugas de faisán, con la carne hacia abajo, durante 3-4 minutos, hasta que estén dorados. Voltea los senos, aumenta el fuego y freír durante 4-6 minutos más, o hasta que la piel esté dorada y crujiente, y los senos sean medio raros. Retire del fuego y deje los pechos a un lado para descansar durante unos minutos antes de cortar finamente en cubos pequeños. 6. Regrese la sartén que se usa para cocinar los pechugas de faisán al fuego, agregue las cebollas y fría por aproximadamente un minuto, luego agregue el tomillo, la salvia, la hoja de laurel y las bayas de enebro y cocínelas durante 3-4 minutos, o hasta que las cebollas son suaves y dorados claros.", "Aumente el fuego a alto, luego agregue los champiñones y fríalos por 2-3 minutos, o hasta que estén dorados y cualquier exceso de humedad en la sartén se haya evaporado.", "Agregue las castañas cocidas desmenuzadas y mezcle bien. Transfiera la mezcla a un tazón grande y mezcle los arándanos y arándanos secos. Sazonar, al gusto, con sal marina y pimienta negra recién molida y mezclar los pechugas de faisán picado.", "Esmalte de la sartén con el agua y mezcle con la mezcla de faisán.", "Retire la pierna de pato confitada enfriada de la grasa de pato y colóquela en una sartén caliente y seca. Encienda el fuego y cocine por 3-4 minutos en todos los lados, o hasta que estén dorados y crujientes por todos lados. Retire de la sartén y deje enfriar un poco antes de retirar la carne del hueso. Pica la carne de la pierna, revuelve en la mezcla de faisán de los senos. Cubra el tazón con película adhesiva y enfríe en el refrigerador hasta que lo necesite.", "Mientras tanto, despliegue la masa de hojaldre hasta que tenga un grosor de 2 mm. Recorta ocho discos de 10cm / 4in y ocho discos de 14cm / 5½in y colócalos en bandejas forradas con papel pergamino. Enfríe los pasteles en la nevera durante aproximadamente cinco minutos.", "Engrase un recipiente pequeño o una taza que no tenga más de 8 cm de diámetro y empaquete aproximadamente 60 g / 2½ oz del relleno en la base, presionando firmemente.", "Voltea el relleno del tazón o taza en el centro del disco de pastelería más pequeño. Cepille los bordes del disco de pastelería con un poco del huevo batido, luego cubra el disco de pastelería más grande sobre el relleno. Presione alrededor del relleno con los dedos para sellar, asegurándose de que no haya bolsas de aire. Repite el proceso con la masa restante y el relleno, colocando cada pithivier terminado en una bandeja forrada con papel pergamino. Enfriar en la nevera durante 10-15 minutos.", "Retire los pithiviers de la nevera y recorte cualquier exceso de hojaldre con un cortador de pasteles de 10 cm / 4 in. Cepille los pithiviers con el huevo batido restante, luego marque la parte superior con la parte posterior de un cuchillo, creando patrones de media luna a través de la masa. Enfríe en el refrigerador hasta que esté listo para cocinar.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque una bandeja para hornear en el horno para calentar.", "Para la salsa, toma el cadáver de faisán reservado y corta en trozos de 3 cm / 1¼ en pedazos.", "Caliente una sartén grande hasta que esté caliente, agregue la grasa de pato, la carcasa del faisán y las bayas de enebro y fríe durante 4-5 minutos, o hasta que la carcasa esté dorada por todas partes. Transfiere las piezas a un recipiente.", "Regrese la sartén al fuego y fría la cebolla y el apio durante 3-4 minutos o hasta que estén doradas. Agregue los champiñones y cocine durante 1-2 minutos, luego devuelva las piezas de la carcasa a la sartén.", "Verter en el Madeira, llevar a ebullición, agregar el puerto y reducir el volumen a la mitad.", "Agregue el agua fría a la sartén y deje que hierva, luego reduzca el fuego y cocine a fuego lento durante 20 minutos.El agua fría atrapará las impurezas y las forzará a salir a la superficie a medida que hierva. Sazonar, al gusto, con sal y pimienta negra recién molida. 20 minutos es suficiente para extraer todos los sabores del cadáver, más allá de esto, y comenzará a cocer y probarse.", "Pasar la mezcla a través de un tamiz fino en una sartén limpia, presionando bien para extraer tanta salsa como sea posible. Lleva la salsa tamizada a fuego lento, luego agrega el arrurruz diluido a la sartén y revuelve. Cocine durante 1-2 minutos, hasta que la salsa se espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Deslice los pithiviers en la bandeja para hornear caliente y hornee durante 15-20 minutos, hasta que la masa esté dorada y crujiente.", "Para la guarnición, caliente una sartén a fuego medio y fría ligeramente las ciruelas pasas, las pasas y las nueces durante 2-3 minutos, agite la sartén con frecuencia para evitar que se queme, hasta que se caliente.", "Para servir, coloque un pithivier en el centro de cada plato de servir. Usando una pequeña cucharilla, haga un pequeño agujero en el centro del pithivier. Cuchara parte de la salsa en el agujero de cada pithivier, y alrededor del plato. Esparce las ciruelas calientes, las pasas doradas y las nueces alrededor."], "url": "www_bbc_co_uk_food_recipes_pheasantpithiviers_93490", "title": "Pithiviers del faisán", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["rociar aceite de oliva", "2 pechugas de faisán de 125 g / 4½ oz (o pechugas de gallina de Guinea, pato, perdiz, paloma del mismo peso)", "sal y pimienta negra recién molida", "2 cucharadas de jalea de grosella", "puñado de perejil fresco de flatleaf o cilantro, finamente picado", "20 g / ¾oz de porcini seco (ceps) o setas mezcladas secas, empapadas durante 30 minutos en agua tibia", "100 g / 3½ oz de champiñones frescos (use hongos silvestres como los mízcalos, Pied de Mouton y Girolles, o tapas marrones menos costosas, ostras, shiitake, botón o una mezcla de los anteriores)", "2 cucharadas de aceite de oliva", "1 cebolla roja pequeña, finamente picada", "2 dientes de ajo, finamente picados", "sal y pimienta negra recién molida", "3 panini listos para hornear, baguettes, ciabatta o 1 focaccia grande (aproximadamente 18cm / 7in x 30cm / 12in o 30cm / 12in diámetro redondo, cortado en el medio)", "Perejil fresco, picado", "arándanos o grosellas rojas, para adornar (opcional)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén a prueba de horno hasta que esté muy caliente. Frote un poco de aceite de oliva en los pechos de faisán (u otro pájaro elegido) y sazone con sal y pimienta negra recién molida.", "Coloque los senos en la bandeja de la plancha, en ángulo con respecto a las crestas, y cocine durante un minuto en cada lado. Transfiera al horno y tueste durante seis minutos (tres minutos si usa aves pequeñas como la perdiz), o hasta que esté cocido a su gusto. Retirar y dejar reposar durante cinco minutos.", "Coloque la gelatina de grosella en una olla pequeña y caliente suavemente hasta que se derrita. Cepille sobre el faisán u otro pájaro y espolvoree sobre el perejil picado o el cilantro. Deje que se enfríe completamente.", "Mientras tanto, escurra los hongos secos empapados y exprima cualquier exceso de humedad (guarde el líquido y úselo en esta receta para agregar sabor a las salsas). Enjuague los champiñones remojados en agua fresca, vuelva a vaciar y seque con toallas de papel, luego pique finamente.", "Limpie los hongos frescos y pique finamente.", "Caliente el aceite de oliva en una sartén con tapa y antiadherente a fuego lento. Agregue la cebolla roja y el ajo y una pizca de sal. Cubra con una tapa y cocine suavemente por 15 minutos.", "Agregue las setas secas y frescas a la sartén y cocínelas tapadas por otros diez minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. Si hay demasiado líquido en la bandeja, quite la tapa y hierva hasta que todo el líquido se haya evaporado. Retirar del fuego y dejar enfriar.", "Si usa panini o baguettes, corte la diagonal; para ciabatta o focaccia, divida horizontalmente y use un cortador de pasteles de 5 cm / 2 pulgadas para cortar rondas de pan para las bases de canapés.", "Tueste el pan en una sartén muy caliente. Alternativamente, coloque debajo de la parrilla hasta que estén tostados en ambos lados. Deja enfriar.", "Para servir, corte los senos muy finos en la diagonal. Extienda un poco de compota de champiñones en las rebanadas de pan tostado y coloque 2-3 rebanadas de carne de pechuga en la parte superior. Adorne con hierbas frescas picadas, arándanos o grosellas rojas, como prefiera."], "url": "www_bbc_co_uk_food_recipes_pheasantsupremewithw_92589", "title": "Supémas de faisán con compota de champiñones silvestres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pheasantsupremewithw_92589_16x9.jpg", "isVegetarian": false, "recommendations": 0}]