[{"ingredients": ["2 limas, solo jugo", "2 dientes de ajo, aplastados", "4 cucharadas de aceite de oliva", "1 cucharadita colmada de orégano seco", "1 cucharadita de hojuelas de chile", "1 cucharadita de azúcar moreno", "4 muslos de pollo deshuesados, sin piel", "sal marina escamada y pimienta negra recién molida", "2 chipotles en adobo, finamente picados", "2 cucharadas de crema agria", "2 cucharadas de mayonesa", "1 lima, solo jugo", "2 tomates grandes maduros, sin semillas y finamente picados", "½ cebolla, finamente picada", "puñado de cilantro fresco, toscamente picado", "1 chile verde serrano o jalapeño, finamente picado", "1 lima, solo jugo", "1 chile verde jalapeño o serrano, sin semillas y finamente picado", "½ cebolla pequeña, finamente picada", "1 gran aguacate maduro, piedra y piel eliminados", "1 lima, solo jugo", "pequeño puñado de cilantro fresco, toscamente picado", "150g / 5½oz de arroz blanco de grano largo", "4 tortillas de harina grandes", "4 cucharadas de mozzarella recién rallada", "4 cucharadas de crema agria", "½ lechuga Little Gem, rallada"], "method": ["Para hacer el pollo, mezcle el jugo de lima, el ajo, el aceite, el orégano, el chile, el azúcar y la sal y la pimienta en un tazón grande. Agregue el pollo, cubra y coloque en el refrigerador durante al menos 2 horas.", "Mientras tanto, para hacer la crema de chipotle, mezcle los chipotles en adobo, la crema agria y la mayonesa con un chorrito de jugo de limón y una pizca de sal y reserve.", "Para hacer el pico de gallo, mezcle todos los ingredientes junto con ½ cucharadita de sal en un recipiente y reserve.", "Para hacer el guacamole, machaque el chile en un mortero y mortero con la cebolla y ¼ de cucharadita de sal, en una pasta grumosa. Agregue el aguacate y divida la carne aproximadamente con un tenedor. El resultado debe ser abultado, no suave. Agregue el jugo de lima, al gusto, y el cilantro picado.", "Coloque una sartén a fuego alto y cocine los muslos de pollo, sin el adobo, hasta que estén dorados y sellados. Agregue el adobo a la sartén, cubra con una tapa y cocine durante 10-15 minutos, o hasta que el pollo esté cocido a medida que los jugos salgan limpios. Corta el pollo en tiras.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Divida las tortillas entre cuatro platos y cubra con arroz, pollo, salsas, mozzarella y lechuga. Dobla la parte inferior de cada tortilla, luego pliega los lados y rueda para contener el relleno. Cortar a la mitad para servir."], "url": "www_bbc_co_uk_food_recipes_chicken_burritos_with_11821", "title": "Chicken burritos with pico de gallo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_burritos_with_11821_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "8 muslos de pollo deshuesados ​​y sin piel", "30g / 1oz de mantequilla sin sal", "2 puerros, cortados finamente en rondas", "Harina normal de 30g / 1oz", "175ml / 6fl oz de vino blanco seco", "500ml / 18fl oz de caldo de pollo fresco", "250ml / 9fl oz de suero de leche", "1 manojo de ajo silvestre, (alrededor de 10 hojas)", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "Harina simple de 420g / 15oz, más extra para quitar el polvo", "250 g / 9 oz de mantequilla sin sal helada, cortada en cubos", "60 g / 2¼ oz de queso parmesano, rallado", "1 cucharadita de sal", "1 cucharadita de pimienta de cayena", "1-2 cucharaditas de agua helada", "1 huevo de gallinas camperas, golpeado"], "method": ["Para el relleno, caliente el aceite a fuego alto en una sartén con tapa. Freír los muslos de pollo durante 5-10 minutos, hasta que estén dorados por ambos lados. Es posible que deba hacer esto en dos lotes. Retire de la sartén y reserve.", "Baje el fuego a bajo y agregue la mantequilla a la sartén junto con los puerros y fríe con cuidado durante 10 minutos, tapado, hasta que se suavice pero no se dore. Agregue la harina y cocine por un par de minutos. Agregue el vino blanco y deje burbujear por un minuto, revolviendo, luego agregue el caldo de pollo. Agregue el pollo de nuevo en la sartén, cubra y cocine a fuego lento durante unos 20 minutos. Agregue el suero de leche y continúe cocinando por otros 20 minutos, hasta que la carne esté muy tierna y la salsa esté bien espesa.", "Mientras tanto, ponga el ajo silvestre en un procesador de alimentos y mezcle hasta obtener un puré fino.", "Retire el relleno del pastel del fuego, revuelva a través del puré de ajo silvestre, y sazone bien con nuez moscada, sal y pimienta. Transfiera el relleno a un recipiente y deje que se enfríe por completo. Refrigere durante al menos una hora, pero es preferible pasar la noche.", "Para la masa, agregue la harina, la mantequilla, el queso parmesano, la cayena y la sal a un procesador de alimentos y rápidamente el pulso a una consistencia de migas de pan. Agregue una cucharadita de agua fría a la vez hasta que la masa se una. Tenga cuidado de no mojar demasiado la pasta o será dura. Inclina sobre una superficie enharinada y junta suavemente en una bola. Corta un tercio de la masa para el pastel. Envuelva ambas piezas en una película adhesiva y colóquelas en la nevera durante al menos 30 minutos.", "Para ensamblar el pastel, espolvoree ligeramente la superficie de trabajo con harina y luego despliegue la porción más grande de la masa hasta que tenga el grosor de una moneda de una libra. Polvore el rodillo con harina y cubra cuidadosamente la masa sobre él. Transfiera la masa del pin a un plato para pastel de 23cm / 9in. Cuidadosamente alinee la base de su plato, presionando hacia abajo en las esquinas. Deje los bordes sin recortar en esta etapa.", "Llene el plato de pastel cubierto con el relleno frío y cepille los bordes de la masa con el huevo batido. Estirar la porción más pequeña de la masa para hacer la parte superior. Use el rodillo como antes para transferir la masa a la parte superior del pastel. Con un cuchillo afilado, recorte el exceso de masa para hacer un borde limpio. Puede empujar hacia abajo los bordes con un tenedor para sellarlos o arruguérselos. Empuje la masa hacia abajo hacia el exterior del plato con un dedo. Pellizque la masa alrededor de ese dedo con el dedo y el pulgar de la otra mano para crear una vieira. Repita todo a lo largo del borde.", "Estirar cualquier exceso de masa y usando un cortador de su elección, (Fui por corazones), haga una decoración para la tapa del pastel. Cepille con el huevo batido y vuelva a la nevera durante 30 minutos.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Esmalte la parte superior del pastel una vez más, luego hornear durante 35-40 minutos, o hasta que la masa esté dorada y cocida todo el camino. Delicioso servido con puré de mantequilla y verduras de primavera."], "url": "www_bbc_co_uk_food_recipes_chicken_buttermilk_and_11923", "title": "Pollo, suero de mantequilla y pastel de ajo silvestre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "400-500g / 14oz-1lb 2 oz de muslos de pollo, piel y hueso", "1 cebolla, cortada en cubitos", "1 zanahoria, finamente picada", "2 dientes de ajo, en rodajas", "400g de tomates de hojalata", "250ml / 9fl oz de caldo de pollo", "1 cucharadita de hierbas mezcladas secas", "Papas de 600 g / 1 lb 5 oz, cortadas en trozos del tamaño de un bocado", "sal y pimienta"], "method": ["Caliente una cacerola grande a fuego medio. Agregue el aceite y, una vez caliente, agregue los muslos de pollo, con la piel hacia abajo. Dorar el pollo en cada lado durante 3-4 minutos, o hasta que esté dorado por todas partes. Retire los muslos de la sartén y colóquelos a un lado.", "Agregue la cebolla y la zanahoria con una pizca de sal a la cacerola y revuelva sobre el fuego. Freír durante 6-7 minutos, o hasta que las cebollas estén suaves y translúcidas. Agregue el ajo y continúe cocinando por dos minutos más.", "Agregue el pollo dorado a la sartén junto con los jugos de la carne. Vierta sobre los tomates, el caldo y las hierbas mixtas y mezcle bien para asegurarse de que todo esté distribuido uniformemente. Sazone con un poco de sal y pimienta, cubra con una tapa y cocine a fuego lento durante 20 minutos, o hasta que el pollo esté bien cocido y la salsa espesada ligeramente.", "Mientras tanto hierva las papas en una olla de agua hirviendo durante 10-12 minutos, o hasta que estén tiernas y cocidas. Escurrir y servir junto con el pollo cocido."], "url": "www_bbc_co_uk_food_recipes_chicken_cacciatore_with_54620", "title": "Pollo mediterráneo con patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cacciatore_with_54620_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pollo (alternativamente use muslos o baquetas)", "15g / ½ oz de harina natural", "2 cucharadas de aceite de oliva", "70g / 2½oz de panceta, cortada en cubitos", "1 cebolla, finamente picada", "1 zanahoria, finamente picada", "1 apio, finamente picado", "2 dientes de ajo, finamente picados", "2 ramitas de romero fresco", "200g / 7oz de setas silvestres mezcladas, en rodajas", "200ml / 7fl oz de vino tinto, preferiblemente chianti", "2 cucharadas de puré de tomate", "400-500ml / 16-18fl oz de caldo de pollo fresco", "2 chiles secos", "1 cucharada de alcaparras para bebés", "100g / 3½oz de aceitunas negras, picadas", "sal y pimienta negra recién molida", "puñado de perejil fresco de hoja plana, picado, para servir", "4 cucharadas de aceite de oliva", "2 dientes de ajo, aplastados", "1 ramita fresca de romero", "1 limón sin cebar, ralladura fina solamente", "2 x 400 g de mantequilla, cannellini o alubias, escurridos y enjuagados", "aceite de oliva extra virgen, para lloviznar", "300g / 10½oz de judías verdes", "30g / 1oz de mantequilla", "1 diente de ajo, en rodajas finas", "pizca de copos de chile"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Sazonar el pollo con sal, pimienta y polvo con harina. Caliente el aceite de oliva en una cazuela a prueba de horno a fuego medio y coloree el pollo por todos lados. Transfiera a un plato y reserve.", "Agregue la panceta, la cebolla, la zanahoria, el apio, el ajo y el romero en la sartén y fría con cuidado, permitiendo que las verduras se ablanden en la grasa liberada de la panceta. Agregue los champiñones y fríalos por 5 minutos, o hasta que estén dorados y suaves.", "Vierta el vino y cocine a fuego lento hasta que se haya reducido en dos tercios. Agregue el puré de tomate y el caldo, luego devuelva el pollo a la sartén junto con los chiles secos, las alcaparras y las aceitunas. Sazonar y llevar a ebullición. Cubra con una tapa y hornee durante 45-50 minutos, o hasta que el pollo esté bien cocido. Retire la tapa durante los últimos 10 minutos si el líquido es demasiado descarado.", "Mientras tanto, para hacer el puré de frijoles blancos, caliente el aceite de oliva en una cacerola a fuego lento. Agregue el ajo, el romero y la ralladura de limón y cocine por 2-3 minutos. Retire el romero y colóquelo a un lado. Agregue los frijoles a la sartén y caliente, revolviendo y aplastando con una cuchara ancha y plana para que se conviertan en un puré lleno de baches. Sazonar, decorar con el romero guardado y rociar con aceite de oliva virgen extra.", "Para hacer las judías verdes, ponga a hervir una cacerola grande de agua con sal y blanquee los frijoles por 3 minutos. Escurrir y secar Derrita la mantequilla en una sartén a fuego lento y agregue el ajo. Incline los frijoles y mezcle con sal y una pizca de hojuelas de chile.", "Sirva el pollo en su salsa, esparcido con perejil, junto con el puré de frijoles y las judías verdes de ajo."], "url": "www_bbc_co_uk_food_recipes_chicken_cacciatori_with_31318", "title": "Cacciatore de pollo con puré de judías blancas y judías verdes de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cacciatori_with_31318_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan de pan de espelta, cortado en croûtons finos", "2 cucharadas de aceite de oliva", "2 ramitas de romero, hojas recogidas y picadas", "125 g / 4½ oz de mantequilla", "150g / 5½ oz de azúcar moreno", "dos pizcas de pimienta de cayena", "Pacanas 300 g / 10½ oz", "50g / 1¾oz de clara de huevo, batida hasta espumosa", "1 pollo entero", "1 zanahoria, cortada en trozos", "1 apio, cortado en trozos", "1 cebolla, pelada y cortada en trozos", "1 ramita de tomillo", "1 ramita de romero", "2 dientes de ajo, pelados y aplastados", "1 lechuga Cos, más o menos picada", "1 lechuga Little Gem, más o menos picada", "1 bulbo de ajo, corte superior", "1 ramita de romero", "1 cucharada de aceite de oliva", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "2 cucharaditas de vinagre de vino blanco", "300ml / 10 fl oz aceite de colza", "sal y pimienta negra recién molida", "2 cucharadas de suero de leche", "2 cucharadas de crema", "2 cucharadas de miel", "50ml / 2fl oz de aceite de colza", "10 g de semillas de sésamo negro", "10 g de semillas de hinojo", "10g semillas de girasol", "10g de guisantes wasabi", "20g / ¾oz de cereal de arroz inflado", "10g de pistachos sin cáscara", "50g / 1¾oz de azúcar", "100g / 3½oz de uvas rojas sin semillas", "100g / 3½oz de uvas verdes sin semillas"], "method": ["Para los croûtons de romero, precalentar el horno a su configuración más baja.", "Coloque el pan rebanado en una bandeja para hornear y rocíe sobre el aceite y espolvoree sobre el romero. Coloque en el horno durante 1-3 horas, o hasta que estén doradas y crujientes.", "Para las pacanas picantes, precalentar el horno a 160C / 325F / Gas 3", "En una sartén grande para horno, derrita la mantequilla con el azúcar para hacer un caramelo. Agregue la pimienta de cayena y doble las nueces. Doble suavemente las claras de huevo batidas hasta cubrir todas las nueces.", "Transfiera la sartén al horno y cocínela durante 25 minutos, revolviendo dos o tres veces, o hasta que las nueces estén crujientes.", "Para la ensalada César de pollo, en una sartén grande agregue el pollo, la zanahoria, el apio, la cebolla, el tomillo, el romero, el ajo y suficiente agua para cubrir el pollo. Haga hervir a fuego lento en la placa y cocine a fuego medio durante 50 minutos a una hora.", "Deja enfriar en el líquido. Una vez que esté lo suficientemente frío como para manipularlo, rasgue la carne del cadáver y déjela a un lado.", "Para hacer que el aderezo precaliente el horno a 200C / 400F / Gas 6. Coloque todo el bulbo de ajo en papel de aluminio con una ramita de romero y cubra. Coloque en el horno por 15-20 minutos.", "Coloque las yemas de huevo, la mostaza y el vinagre de vino blanco en un procesador de alimentos y mezcle. Poco a poco agregue el aceite de colza hasta que tenga una mayonesa suave y luego sazone con sal y pimienta.", "Para las uvas crujientes, triture las semillas, los guisantes wasabi, los cereales de arroz inflado y los pistachos. Ponga el azúcar en una sartén caliente y cuando se disuelva, agregue las uvas frescas y la mezcla de semillas. Revuelva rápidamente para cubrir las uvas y déjelas a un lado.", "Para terminar el aderezo, en un bol añadir el suero de leche, la crema fresca, la miel y la pulpa de ajo cocida. Agregue un poco de aceite y agregue la mayonesa.", "Para servir, en un tazón de vidrio grande agregue la lechuga Cos y gema bebé, pacanas picantes, uvas crujientes, croûtons, pollo y mezclar.", "Vierta sobre el aderezo y revuelva para cubrir."], "url": "www_bbc_co_uk_food_recipes_chicken_caesar_salad_61098", "title": "Ensalada César de pollo con uvas crujientes, pacanas picantes y crutones de romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de polvo de cinco especias", "250g / 9oz de grano largo marrón o blanco o arroz basmati o quinoa", "125g / 4½oz anacardos", "1 cucharada de aceite de girasol", "2 pechugas de pollo grandes, deshuesadas y sin huesos (aproximadamente 225 g / 8 oz cada una), cortadas en trozos del tamaño de un bocado", "sal marina escamada y pimienta negra recién molida", "2-3 pimientos, colores mezclados, cortados en tiras", "1 manojo de cebollas de primavera, cortado y cortado en piezas de 3cm / 1¼in", "2-3 chiles rojos, sin grano (si se prefiere por menos calor) y cortados en tiras largas", "3cm / 1¼ en pieza de jengibre fresco de raíz, pelado y cortado en fósforos finos", "2 dientes de ajo, finamente picados", "1 cucharada de harina de maíz", "100 ml / 3½ fl oz de caldo de pollo", "3 cucharadas de salsa hoisin (alternativamente, use salsa de soja)", "grandes hojas de albahaca puñado"], "method": ["Primero cocine el arroz. Coloque las cinco especias en el fondo de una sartén mediana a fuego lento. Cocine durante aproximadamente 3-4 minutos, o hasta que empiece a oler los aromas, luego agregue el arroz o la quinoa junto con un poco de sal y cocínelo de acuerdo con las instrucciones del paquete.", "Mientras tanto, ponga las nueces de anacardo en un wok grande (sin aceite) a fuego medio y tueste durante aproximadamente 3-4 minutos, agitándolas de vez en cuando hasta que se doren por todas partes. Luego inclínelos en un plato y déjelos a un lado.", "Caliente el aceite en el wok con el calor elevado. Sazone las piezas de pollo con sal y pimienta y saltee durante unos 4-5 minutos, revolviendo ocasionalmente, hasta que estén doradas. Agregue los pimientos, las cebollas tiernas, los chiles y el jengibre, y cocine por 2-3 minutos manteniendo la sartén en movimiento para que nada arda. Añadir el ajo y cocinar por otro minuto.", "Coloque la harina de maíz en un tazón pequeño con dos cucharaditas de agua fría y mezcle hasta obtener una pasta homogénea. Agregue al sofrito junto con la salsa stock y hoisin y deje que la salsa burbujee durante 1-2 minutos, o hasta que se espese un poco. Mezcle los anacardos tostados en la sartén y verifique que el pollo esté bien cocido. Retire del fuego.", "El arroz o la quinoa ya deben estar cocidos y drenar, sazonar al gusto con sal y pimienta y luego volver a la sartén para mantener el calor si es necesario.", "Coloque el arroz o la quinoa en cada plato para servir. Con una cuchara, saltee los salteados entre ellos y raspe las hojas de albahaca para esparcirlas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_cashew_nut_and_78081", "title": "Pollo, anacardo y salteado de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cashew_nut_and_78081_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas fritas de 350g / 12oz, como King Edwards o Maris Piper", "Harina de 250g / 9oz de aumento automático, más extra para enrollar", "1 cucharadita de sal marina fina", "100g / 3½oz de mantequilla fría, cortada en cubos", "125ml / 4fl oz de leche entera, más extra para cepillar", "8 muslos de pollo deshuesados ​​y sin piel", "sal marina escamada y pimienta negra recién molida", "3 cucharadas de aceite de girasol", "4 lonchas de tocino ahumado sin corteza y cortadas en tiras de 2cm / ¾oz de ancho", "2 cebollas medianas, a la mitad y en rodajas", "2 palitos de apio, en rodajas finas", "150g / 5½ oz de champiñones pequeños, secados y partidos a la mitad o descuartizados si son grandes", "400 g / 14 oz pueden cortar tomates", "600ml / 20fl oz de caldo de pollo, hecho con 1 cubo de caldo", "1 hoja de laurel", "2 cucharaditas de tomillo seco", "Zanahorias medianas de 375g / 13oz, peladas y cortadas en rodajas de 1.5cm", "2 puerros delgados, cortados y cortados en rodajas de 2cm / ¾in", "1 cucharada de harina de maíz", "2 cucharadas de agua fría", "sal marina copos", "pimienta negra recién molida"], "method": ["Para preparar el puré para la cobertura del zapatero, pele las papas y córtelas en trozos de 2 cm. Poner en una olla mediana y cubrir con agua fría. Llevar a ebullición y cocine a fuego lento durante 15 minutos, o hasta que las papas estén muy tiernas.", "Escurrir en un colador y machacar con un machacador de papas o poner a través de un ricer de patata hasta que quede suave. Deja enfriar por 10-15 minutos. Necesitará 250 g / 9 onzas de puré de papas para la cobertura del zapatero. Cualquier puré restante se puede reservar para otra receta.", "Para la cazuela de pollo, recorte los muslos de pollo de los trozos de grasa y córtelos en cuatro pedazos. Sazonar bien con sal y pimienta. Caliente el aceite en una sartén antiadherente grande a fuego medio. Freír el pollo, en dos tandas, hasta que esté ligeramente dorado. Transfiera a una gran cazuela a prueba de llamas. Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el tocino, la cebolla y el apio en la misma sartén que usó para dorar el pollo y fríalos durante 4-5 minutos a fuego medio-alto hasta que estén ligeramente dorados, revolviendo con frecuencia. Agregue los champiñones y cocine por un minuto más, revolviendo.", "Incline las verduras en la cazuela con las piezas de pollo. Agregue los tomates, el caldo, la hoja de laurel, el tomillo y las zanahorias. Deje que hierva a fuego lento sobre la placa, cúbralo con una tapa y cocínelo en el horno durante 30 minutos.", "Mientras el pollo se está cocinando, termine de hacer el zapatero como relleno. Ponga la harina y la sal en un tazón grande y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado grueso. Agregue 250 g / 9 oz de puré de papas y frote con la mantequilla y la harina.", "Agregue la leche y mezcle para formar una masa suave y suave. Convierta la masa en una superficie bien enharinada y enrolle en una salchicha gruesa, de unos 24 cm de largo. Cortar en 12 rondas, cada una alrededor de 2 cm / ¾ de espesor.", "Saque el pollo del horno y sazone al gusto con sal y pimienta. No podrá sazonarlo nuevamente una vez que se haya agregado el relleno. Mezcle la harina de maíz y el agua y mezcle en la cazuela. Agregue los puerros y revuelva bien.", "Cubra la mezcla de pollo con las albóndigas de patata, superponiéndolas ligeramente, por lo que casi cubren el relleno. Cepille con un poco de mezcla extra para esmaltar. Sazonar con un poco de pimienta negra molida y un poco de sal marina. Vuelva al horno sin tapa por otros 30 minutos, o hasta que la cubierta del zapatero esté bien subida, esponjosa y dorada."], "url": "www_bbc_co_uk_food_recipes_chicken_casserole_with_67654", "title": "Cazuela de pollo con zapatero de patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_casserole_with_67654_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de sal", "2 hojas de laurel", "2 dientes de ajo", "2 ramitas de romero", "2 ramitas de tomillo", "1 cucharadita de pimienta negra entera", "1 pollo entero", "1 cebolla, más o menos picada", "2 palitos de apio, más o menos picados", "1 zanahoria, más o menos picada", "4 dientes de ajo, aplastados", "2 ramitas de tomillo", "500g / 1lb 2oz de patatas Maris Piper", "125ml / 4fl oz de crema doble", "125g / 4½oz de mantequilla sin sal", "300ml / 10fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo oscuro", "½ manojo de estragón fresco", "200g / 7oz de setas frescas de morera", "4 tomates, pelados, sin semillas, finamente picados", "2 cucharadas de cebollines frescos finamente picados"], "method": ["Para la salmuera, ponga todos los ingredientes en una olla grande con 1 litro / 1¾ de agua y llévela a ebullición. Una vez hervida y la sal se ha disuelto, retírela del fuego y déjela enfriar.", "Para el pollo, coloque el pollo en un recipiente grande y vierta sobre la salmuera. Cubra y deje en el refrigerador durante al menos ocho horas.", "Precaliente el horno a 220C / 425F / Gas 7. Coloque los vegetales picados, el ajo y el tomillo en una bandeja honda para hornear y coloque el pollo encima.", "Asar en el horno durante 40-50 minutos, dependiendo del tamaño del pollo: perforar el pollo en la parte más gruesa con un pincho; cuando los jugos corren claros, la carne se cocina.", "Para el puré de papa, cocine las papas en una sartén de agua hirviendo con sal durante 12-15 minutos o hasta que estén tiernas. Desagüe.", "Presione la papa a través de un ricer de papa en una cacerola. Regrese al fuego, luego agregue la mantequilla y la crema y bata hasta obtener un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el chasseur de pollo, coloque el vino blanco en una olla grande y cocine hasta que el volumen de líquido se haya reducido a la mitad. Agregue el caldo de pollo y el estragón y reduzca a la mitad nuevamente.", "Agregue las colmenillas y cocine por dos minutos y luego, justo antes de servir, agregue el tomate cortado en cubitos y el cebollín fresco.", "Para servir, corte el pollo en pedazos y colóquelo en un plato para servir. Coloque el puré al lado del pollo y vierta la salsa sobre el pollo y haga puré."], "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_11639", "title": "Cazador de pollo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "sal marina y pimienta negra recién molida", "Muslos de pollo de 7,5 kg / 9 lb y 13 onzas, sin piel y sin hueso, cortados en trozos de 3 cm", "150ml / 5fl oz de aceite de girasol", "875g / 1lb 15oz champiñones", "5 cebollas en rodajas", "2,8 litros / 5 pintas de caldo de pollo", "150ml / 5fl oz de puré de tomate", "25g / 1oz de estragón fresco, medio dejado como ramitas, medio finamente picado", "Tomates picados 5 x 400g / 14oz", "pequeño racimo de perejil rizado, finamente picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la harina en un recipiente y sazone con sal y pimienta recién molida. Dragar el pollo en la harina, sacudiendo cualquier exceso.", "Caliente una sartén grande y profunda y agregue el aceite. Freír las piezas de pollo con la piel hacia abajo durante 1-2 minutos hasta que se doren, dar la vuelta y dorar por el otro lado. Retire el pollo de las cazuelas y déjelo a un lado.", "Agregue un poco más de aceite si las sartenes están secas, luego agregue las setas y fría por 2-3 minutos. Agregue la cebolla y cocine por otros cinco minutos.", "Vuelva a colocar el pollo en los moldes y agregue el caldo, el puré de tomate, las ramitas de estragón entero y los tomates. Llevar a ebullición y transferir el pollo a platos a prueba de horno. Cubra con papel de aluminio y colóquelo en el horno por 45 minutos o hasta que el pollo esté bien cocido.", "Ajuste el condimento si es necesario, luego agregue el perejil y el estragón picado."], "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_60410", "title": "Chasseur de pollo para una multitud", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 lb 5 oz pollo, cortado en ocho piezas", "sal y pimienta negra recién molida", "1 cucharada de harina normal", "2 cucharadas de aceite de oliva", "110g / 4oz de mantequilla", "Tocino rayado ahumado de 110 g / 4 oz, cortado en trozos de 1cm / ½ en trozos", "125g / 4½ oz chalotes, en rodajas gruesas", "150g / 5½oz de setas de castaña", "2 cucharadas de puré de tomate", "175ml / 6fl oz de vino blanco", "400ml / 14fl oz de caldo de pollo", "1 estragón pequeño", "3 tomates", "2 cucharadas de perejil de flatillo finamente picado", "sal marina", "pimienta blanca recién molida", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "125 g / 4½ oz de mantequilla", "125ml / 4fl oz de crema doble", "pimienta blanca recién molida"], "method": ["Para el pollo, condimente el pollo con sal y pimienta negra y luego mezcle la harina para cubrir solo.", "Caliente una sartén grande hasta que esté caliente, agregue el aceite, un poco de mantequilla y la mitad del pollo y fríe la piel hacia abajo durante 3-4 minutos hasta que estén doradas.", "Gire y fría en el otro lado durante otros 1-2 minutos, luego retírelo de la sartén. Repita con otro botón de mantequilla y el resto del pollo.", "Agregue otro pomo de mantequilla y el tocino y fría hasta que estén dorados, luego agregue los chalotes, los champiñones y el puré de tomate y fría por otros minutos.", "Agregue el vino y cocine a fuego lento, raspando suavemente los trozos cocidos en el fondo de la sartén.", "Agregue el caldo y luego devuelva el pollo a la sartén con la mitad del estragón y déjelo hervir.", "Reduzca el fuego a fuego lento, cubra y cocine durante 30-40 minutos hasta que el pollo esté tierno y el líquido ligeramente reducido.", "Mientras el pollo cocina, pela y siembra los tomates. Pon a hervir una olla de agua, saca el tallo del tomate y haz una cruz en el fondo.", "Coloque los tomates en el agua y cocine a fuego lento durante 10-15 segundos hasta que la piel comience a desprenderse.", "Levante directamente en un recipiente con agua helada y despegue la piel.", "Cortar los tomates en cuartos y quitar las semillas y luego cortar en dados pequeños. Corta aproximadamente el estragón restante.", "Agregue los tomates, el perejil y el estragón, luego verifique el condimento.", "Para el puré coloque las papas en una sartén con agua con sal y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 12-15 minutos hasta que las papas estén tiernas.", "Drene y regrese a la sartén, luego coloque sobre el fuego durante un minuto para eliminar el exceso de humedad.", "Pasa a través de un ricer de patata a la sartén (o machaca con un tenedor) y luego agrega la mantequilla y la crema, batiendo para formar un puré suave.", "Sazonar con sal y pimienta blanca.", "Sirva dos trozos de pollo por persona con la salsa y una cucharada de puré."], "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_12065", "title": "Chasseur de pollo con puré de crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_chasseur_with_12065_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 lb 5 oz pollo, cortado en 8 piezas", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "110g / 4oz de mantequilla", "Pancetta de 110 g / 4 oz, rebanada en tocino", "1 zanahoria, en cubitos", "150g / 5oz champiñones", "Chalotes de 250 g / 9 oz, cortados en rodajas gruesas", "2 dientes de ajo, finamente picados", "175ml / 6fl oz de vino blanco", "275ml / 10fl oz de caldo de pollo", "2 cucharadas de puré de tomate", "2 cucharadas de estragón fresco, finamente picado", "2 tomates, desollados, sin semillas y picados", "4 cucharadas de perejil de flatillo, finamente picado", "1kg / 2lb 2oz de patatas harinas, peladas y cortadas en trozos", "110g / 4oz de mantequilla", "110ml / 4fl oz de leche entera", "sal y pimienta negra recién molida"], "method": ["Para el pollo, condimente el pollo con sal y pimienta negra. Caliente una sartén grande o saltee la sartén hasta que esté caliente. Agregue el aceite y la mitad de la mantequilla. Freír el pollo con la piel hacia abajo durante 1-2 minutos o hasta que se dore.", "Gire y fría en el otro lado durante otros 1-2 minutos, luego retírelo de la sartén.", "Agregue la mantequilla restante, la panceta, zanahoria, champiñones, chalotes y ajo, y freír hasta que estén doradas.", "Agregue el vino y cocine a fuego lento, revolviendo para desglasar la sartén.", "Vuelva a poner el pollo en la sartén con el puré de tomate y el estragón y deje que hierva.", "Reduzca el fuego a fuego lento y cocine durante 30-40 minutos hasta que el pollo esté tierno y el líquido ligeramente reducido en volumen.", "Agregue los tomates, el perejil y la sartén al gusto con sal y pimienta.", "Cocine a fuego lento por otros dos minutos.", "Para el puré, coloque las papas en una sartén con agua fría y salada y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y regrese a la sartén, luego coloque a fuego lento durante un minuto para secar ligeramente las papas.", "Mash a fondo, luego agregue la mantequilla y la leche y bata para formar un puré suave.", "Sazone al gusto con sal y pimienta negra.", "Sirva a cada persona dos trozos de pollo con la salsa y una cucharada de puré."], "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_30427", "title": "Chasseur de pollo con puré de patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 libras 5 oz de pollo entero, unidas en ocho piezas", "sal y pimienta negra recién molida", "Harina normal de 50g / 2oz", "2 cucharadas de aceite de oliva", "110g / 4oz de mantequilla", "150 g / 5½ oz champiñones, deja todo", "100 g / 3½ oz de champiñones castaños, reducidos a la mitad", "Chalotes de 150 g / 5½ oz, pelados y dejados enteros", "40 g / 1½ oz de azúcar en polvo", "175ml / 6fl oz de vino blanco", "500ml / 18fl oz de caldo de pollo", "3 cucharadas de puré de tomate", "½ manojo de estragón fresco, medio dejado como ramitas y medio picado fino", "2 tomates de ciruela, pelados, sin semillas, finamente picados", "aceite vegetal, para freír", "4 papas grandes, peladas y cortadas en papas flacas", "sal y pimienta negra recién molida"], "method": ["Para el chasseur de pollo, sazone las piezas de pollo con sal y pimienta negra recién molida. Dragar con la harina para cubrir.", "Caliente una sartén grande a fuego medio y agregue el aceite y un tercio de la mantequilla. Cuando la mantequilla esté espumosa, agregue los trozos de pollo y frítelos con la piel hacia abajo durante 1-2 minutos hasta que queden dorados. Voltee el pollo y fríalo por otros 1-2 minutos.", "Mientras tanto, caliente una sartén por separado a fuego medio y agregue otro tercio de la mantequilla. Cuando la mantequilla esté espumosa, agregue los champiñones y fría, revolviendo ocasionalmente, hasta que se doren por todas partes. Reserve unos pocos champiñones para una guarnición y transfiera el resto de los champiñones al sartén de pollo.", "En la sartén que se usa para freír los champiñones, agregue el tercio restante de la mantequilla, las chalotas y el azúcar impalpable y fría durante 2-3 minutos, o hasta que los chalotes estén dorados y caramelizados.", "Agregue el vino y hierva, raspando la base de la sartén con una cuchara de madera para desalojar cualquier trozo marrón.", "Reserve unos chalotes para la guarnición y vierta la mezcla de chalotes y vino restante sobre el pollo. Agregue el caldo, el puré de tomate y las ramitas de estragón entero. Llevar a ebullición y luego reducir el fuego a fuego lento. Cocine durante 45-60 minutos, o hasta que el pollo esté completamente cocido y la salsa se haya reducido ligeramente.", "Agregue los tomates y el estragón picado y sazone al gusto con sal y pimienta negra recién molida. Cocine a fuego lento por otros dos minutos.", "Para las papas fritas, vierta el aceite en una cacerola grande, profunda y pesada y caliente hasta que un cubo de pan chisporrotee y se ponga dorado cuando se lo deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En lotes, baje cuidadosamente las papas en aceite caliente y fría durante 3-4 minutos, o hasta que estén crujientes y doradas. Retire del aceite caliente con una espumadera y déjelo a un lado para escurrir sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra recién molida. Repita el proceso con las papas restantes.", "Para servir, coloque dos pedazos de pollo en cada plato, rocíe la salsa y adorne con los champiñones y los chalotes reservados. Sirve las papas fritas al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_chasseur_with_32863", "title": "Chasseur de pollo con papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, cortadas en tiras de igual tamaño", "½ limón, solo jugo", "chile en polvo, al gusto", "sal", "aceite vegetal, para freír", "50g / 1¾oz de harina blanca lisa", "Harina blanca lisa 280g / 10oz", "pellizcar bicarbonato de soda", "10fl oz / ½ pinta de cerveza, refrigerada", "200 ml / 7 fl oz de agua con gas, refrigerado", "1 clara de huevo"], "method": ["Coloque el pollo en un bol y agregue el jugo de limón, el chile en polvo y una pizca de sal. Mezcle, cubra con una película adhesiva y transfiéralo a la nevera para marinar durante 20 minutos.", "Precaliente una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Para la mezcla de cerveza, mezcle la harina, el bicarbonato de soda y una pizca de sal en un tazón. Agregue la cerveza fría y suficiente agua con gas para hacer una mezcla suave (es posible que no necesite toda el agua). Deje reposar por 10 minutos.", "Batir la clara de huevo en un bol de vidrio limpio y seco, hasta que se formen picos suaves cuando se quite la batidora. Doble suavemente la clara de huevo en la masa.", "Para el pollo, ponga la harina en un plato. Mezcle el pollo en la harina hasta que esté cubierto, sacuda el exceso y sumerja en la mezcla.", "Freír el pollo a fuego lento durante 6-8 minutos, o hasta que esté crujiente, dorado y cocido sin ningún signo de color rosa en los jugos cuando se corta la tira más gruesa a la mitad. Retire con una espumadera y escurra sobre papel de cocina. Sazonar con sal y servir."], "url": "www_bbc_co_uk_food_recipes_chicken_chilli_beer_83289", "title": "Tiras de pasta de cerveza de pollo y chili", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina, condimentada con sal y pimienta negra recién molida", "4 pechugas de pollo sin hueso (pero no sin piel, idealmente)", "3 cucharadas de aceite de oliva ligero", "25g / 1oz de mantequilla", "1 cebolla grande, en rodajas", "1 zanahoria grande, en rodajas", "2 tallos de apio, cortados y rebanados", "½ cucharadita de tomillo fresco finamente picado", "175ml / 6fl oz de caldo de pollo o vegetal", "175ml / 6fl oz de sidra seca", "1 manzana grande o 2 manzanas Blenheim o Cox más pequeñas, peladas, en rodajas", "sal y pimienta negra recién molida"], "method": ["Seque las pechugas de pollo con papel de cocina, luego sumerja la harina y sacuda el exceso.", "Caliente una sartén o cacerola grande y profunda con tapa por un par de minutos a fuego moderadamente alto. Agregue una cucharada de aceite y, cuando esté caliente, agregue la mitad de la mantequilla.", "Coloque las pechugas de pollo en la sartén, con la piel hacia abajo y fríe durante 2-3 minutos, o hasta que la piel esté dorada. Voltee los senos, baje la temperatura y fría el otro lado durante 1-2 minutos. Retire las pechugas de pollo a un plato, deseche la grasa en la sartén y límpiela.", "Regrese la sartén a fuego moderado y agregue el aceite y la mantequilla restante. Agregue la cebolla, la zanahoria y el apio, revuelva bien, cubra la sartén y cocine por cinco minutos, o hasta que los vegetales comiencen a ablandarse.", "Agregue el tomillo y cualquier harina sobrante. Agregue el caldo de pollo y la sidra, lleve a ebullición y agregue las manzanas en rodajas. Baja el fuego y devuelve los trozos de pollo a la sartén, colocando sobre ellos las verduras y la manzana. Vuelva a colocar la tapa y cocine a fuego lento durante unos 35-40 minutos, volteando las pechugas de pollo a la mitad. Agregue un poco más de sidra o caldo de pollo si es necesario. Controle el condimento, agregue sal o pimienta extra al gusto."], "url": "www_bbc_co_uk_food_recipes_chicken_cider_and_apple_38859", "title": "Cazuela de pollo, sidra y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cider_and_apple_38859_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pollo", "1 cucharada de aceite de oliva", "300ml / 10fl oz de grasa de pato", "½ bulbo de hinojo", "3 alcachofas globo, cortadas y chokes eliminados", "2 bulbos de ajo", "1 limón, ralladura solamente", "2 cucharaditas de tomillo picado", "1 albahaca pequeña, toscamente picada", "1 estragón pequeño, hojas recogidas", "12 rebanadas de jamón de Parma", "sal y pimienta negra recién molida", "hojas de ensalada, para servir"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Coloque las patas de pollo en una lata grande para asar, rocíe con aceite y sazone con sal y pimienta. Asar durante 35-40 minutos, hasta que estén cocidos. Dejar de lado para enfriar.", "Mientras tanto, caliente la grasa de pato en una cacerola grande a 70 ° C y confite las alcachofas, el hinojo y los bulbos de ajo durante 2 horas, hasta que estén suaves.", "Deseche la piel de pollo, retire la carne de los huesos y colóquela en un recipiente. Picar el hinojo confitado muy finamente y agregar al pollo con la ralladura de limón, el tomillo, la albahaca y el estragón. Exprime el ajo de sus pieles en el recipiente, sazona con sal y pimienta y mezcla bien.", "Cubra un molde de terrina grande con película adhesiva y coloque las rebanadas de jamón de Parma a lo ancho del molde para que cada rodaja cuelgue sobre los bordes.", "Coloque la mitad de la mezcla de pollo en el molde. Cortar las alcachofas y presionarlas en una capa limpia sobre el pollo. Cubra con el resto del pollo, doble sobre el jamón de Parma y la película adhesiva. Presione con un peso tal como latas de tomates y déjelo reposar en la nevera durante la noche.", "Cuando esté listo para servir, colóquelo en un tablero y retire la película adhesiva. Use un cuchillo afilado para cortar las rebanadas y servir con algunas hojas de ensalada en el lado."], "url": "www_bbc_co_uk_food_recipes_chicken_confit_fennel_81334", "title": "Pollo, confit de hinojo y alcachofa, limón y terrina de estragón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas y sin piel", "60g / 2¼oz de queso emmental", "4 rebanadas finas de jamón ahumado (aproximadamente 130 g / 4½ oz)", "8 cucharaditas de salsa de arándanos", "Harina normal de 25g / 1oz", "2 huevos medianos de granja", "Pan rallado dorado de 200g / 7oz", "5 cucharadas de aceite de girasol", "sal marina escamada y pimienta negra recién molida"], "method": ["Pon las pechugas de pollo en una tabla. Con un cuchillo afilado, retire el mini filete y reserve a un lado. Cuidadosamente corte horizontalmente a través de cada seno desde el lado más recto casi hasta el otro lado y ábrase como un libro. Cortar el queso en cuatro rectángulos, cada uno alrededor de 1.5 cm / ½ pulgada de ancho y aproximadamente la mitad del tamaño de una caja de cerillas pequeña.", "Tome uno de los pechos abiertos y su mini filete y colóquelo entre dos hojas de película adhesiva. Aplane los dos aplastando con un rodillo hasta aproximadamente 5 mm de espesor por todos lados. Retire la capa superior de la película adhesiva y cubra el filete aplanado con una loncha de jamón. Coloque un trozo de Emmental en el medio de la rebanada de jamón y cubra con dos cucharaditas de salsa de arándano.", "Use el mini filete de pollo aplastado para cubrir los rellenos y luego envuelva cuidadosamente la pechuga de pollo, colocando el extremo puntiagudo de la pechuga de pollo sobre el queso para asegurarse de que esté perfectamente pegado en el interior y, utilizando la capa inferior de la película adhesiva, enrolle. la pechuga hacia arriba firmemente asegurando que la película adherida permanezca en el exterior del pollo para crear un paquete.", "Repite el mismo método con las tres pechugas de pollo restantes y ponlas a un lado.", "Espolvoree la harina en un plato grande y sazone con un par de pellizcos de sal y mucha pimienta negra recién molida. Batir los huevos juntos en un tazón poco profundo. Dispersar 50g / 1¾oz de las migas de pan en un plato grande.", "Polvo una de las pechugas de pollo rellenas a fondo en la harina sazonada y acaricie ligeramente para eliminar cualquier exceso. Enrolla el pollo enharinado en el huevo y dale un ligero batido.", "Coloque el pollo en el plato con las migas de pan y gírelo un par de veces, presionando con las migas de pan hasta que esté bien cubierto. Vuelva a sumergir en el huevo y luego cubra las migas de pan una vez más. Esto asegurará que tu corteza esté realmente crujiente. Coloque el pollo en una bandeja para hornear y déjelo reposar.", "Harina, huevo y cubrir las pechugas de pollo restantes exactamente de la misma manera. Necesitará agregar 50 g / 1¾oz de la miga de pan al plato para cada pecho, tirando las migas restantes del lote anterior, ya que serán muy pegajosas. (Las pechugas de pollo ahora se pueden tapar y meter en la nevera hasta que esté listo para cocinarlas).", "Precaliente el horno a 220C / 425F / Gas 7. Caliente el aceite de girasol en una sartén antiadherente grande. Freír las pechugas de pollo a fuego medio durante 1-2 minutos en los cuatro lados, o hasta que estén doradas.", "Transfiera el pollo a una bandeja para hornear y termine de cocinarlo en el horno por 25 minutos, o hasta que el pollo esté caliente y bien cocido - no debe quedar nada de color rosado. Sirva inmediatamente para que el queso rezume cuando se corta."], "url": "www_bbc_co_uk_food_recipes_chicken_cordon_bleu_31848", "title": "Pollo Cordon Bleu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin piel sin hueso", "175 g / 6 oz emmental, cortado en 8 trozos", "4 rebanadas de jamón grueso de buena calidad", "sal y pimienta negra recién molida", "Harina simple de 75g / 2¾oz", "3 huevos de gallinas camperas, ligeramente golpeados", "Pan rallado panko japonés 150g / 5oz", "150g / 5oz de mantequilla", "300g / 10½oz de judías verdes, recortadas", "Almendras en copos de 25g / 1oz"], "method": ["Corte las pechugas de pollo por la mitad horizontalmente casi hasta el final, luego abra cada una en forma de corazón.", "Coloque una hoja grande de película adhesiva sobre una superficie de trabajo, coloque una pechuga de pollo pegada a la mariposa encima, luego cubra con una segunda hoja de película adhesiva. Suavemente aplaste la pechuga de pollo con un mazo de carne o rodillo hasta un grosor de 1 cm / ½ pulgada. Deseche la película adhesiva.", "Repita el proceso con las pechugas de pollo restantes.", "Coloque 2 pedazos de emmental en un lado de cada pechuga de pollo aplastada. Doble una loncha de jamón y colóquela encima del queso. Doble la otra mitad del pollo sobre el relleno y presione ligeramente hacia abajo. Repita el proceso con las pechugas de pollo restantes.", "Espolvoree la harina en un plato y sazone con sal y pimienta negra recién molida. Batir los huevos en un tazón. Espolvoree las migas de pan en un plato aparte.", "Seca cada pechuga de pollo llena primero en la harina, luego sumérgela en el huevo batido, luego arrástrala en el pan rallado para cubrir.", "Caliente 125g / 4½ oz de la mantequilla en una sartén grande a fuego medio. Cuando la mantequilla esté espumosa, agregue las pechugas de pollo (en tandas si es necesario) y fría por 4-5 minutos en un lado, o hasta que las migas estén doradas. Voltee las pechugas de pollo y fríe por 4-5 minutos más, rociando el pollo con la mantequilla en la sartén a intervalos. Trate de mantener el calor lo suficientemente bajo como para evitar quemar las migas de pan o la mantequilla, pero lo suficientemente alto como para cocinar el pollo por completo, hasta que no quede rastro de color rosa.", "Cuando las pechugas de pollo estén bien cocidas, el revestimiento es dorado y el relleno de queso se ha derretido, retire las pechugas de pollo de la sartén y déjelo a un lado en un plato caliente.", "Ponga a hervir una sartén con agua con sal, agregue los frijoles y cocínelos durante 3-4 minutos o hasta que estén tiernos. Escurrir bien.", "Regrese la sartén al fuego, agregue la mantequilla restante, luego fría las almendras en copos durante unos segundos hasta que estén tostadas. Regrese los frijoles a la sartén, mezcle bien, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Sirva el cordón de pollo bleu en platos para servir con una cucharada de frijoles al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_cordon_bleu_44159", "title": "Pollo Cordon Bleu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla", "Harina normal de 200g / 7oz", "500ml / 18fl de leche en oz", "sal y pimienta negra recién molida", "75g / 3oz de pan rallado fresco", "Pollo cocido 150g / 5oz, picado", "1 manojo pequeño de estragón fresco, hojas recogidas y picadas", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado japonés panko de 75g / 3oz", "50 g / 1¾oz de almendras molidas", "aceite de colza, para freír", "1 gran racimo de berros, para adornar", "3 yemas de huevo de gallinas camperas", "1-2 cucharaditas de mostaza inglesa", "100ml / 3½fl oz de aceite de colza", "1 cucharada de vinagre de vino blanco", "75g / 3oz de pimientos del piquillo, picados", "1 cucharada de perejil flatleaf, más o menos picado", "sal y pimienta negra recién molida"], "method": ["Para las croquetas, derrita la mantequilla en una cacerola grande, luego bata la harina y cocine por 2-3 minutos. Agregue la leche gradualmente hasta que tenga una salsa muy espesa. Condimentar con sal y pimienta.", "Agregue las migas de pan frescas, el pollo y el estragón, luego coloque en el refrigerador para enfriar durante 3-4 horas.", "Forme la mezcla enfriada en cilindros de 7cm / 2¾. Coloque la harina, los huevos batidos y las migas de pan en tres cuencos separados. Agregue las almendras molidas a las migas de Panko y mezcle bien. Cubra cada cilindro con la harina, luego huevo y termine con una capa de pan rallado.", "Agregue el aceite en una freidora y precaliéntelo a 170 ° C / 338 ° F. (Precaución: no deje el aceite caliente desatendido).", "Freír las croquetas en lotes hasta que estén doradas. Retire y escurra sobre papel de cocina.", "Para la mayonesa, bata las yemas de huevo con la mostaza en un tazón y luego agrega gradualmente el aceite, batiendo continuamente. Revuelva a través del vinagre, los pimientos del piquillo y el perejil, luego sazone con sal y pimienta.", "Para servir, ponga las croquetas en una tabla con el berro al costado y un tazón de mayonesa con pimienta para mojar."], "url": "www_bbc_co_uk_food_recipes_chicken_croquetas_with_26131", "title": "Chicken croquetas with piquillo pepper mayo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "8 muslos de pollo, piel, hueso", "2 cebollas grandes, finamente cortadas", "5 dientes de ajo picados", "Jengibre de raíz de 5 cm / 2 en pieza, picado", "1 pimiento rojo grande, picado", "2 cucharadas de puré de tomate", "3 cucharadas de pasta de curry suave", "1 cucharada de sal masala", "1 cucharada de hojas secas de fenogreco", "1 cucharada de cilantro molido", "¼ raíz de cúrcuma, finamente rallada", "1 chile rojo fresco, finamente cortado", "½ manojo de cilantro fresco", "1 cucharada de aceite vegetal", "½ cucharadita de semillas de comino", "3 vainas de cardamomo", "1 palitos de canela", "½ cucharadita de pimienta negra molida", "1 hoja de laurel", "500g / 1lb 2oz de arroz basmati, enjuagado y escurrido", "1 cucharadita de sal", "50 g / 1¾oz de mantequilla sin sal"], "method": ["Para los muslos de pollo, ponga una sartén grande a fuego alto y agregue dos cucharadas de aceite. Una vez caliente, agregue los muslos de pollo con la piel hacia abajo y cocine durante 3-4 minutos, o hasta que estén dorados en cada lado. Pon el pollo en un plato y ponlo a un lado.", "Caliente una sartén grande y agregue el resto del aceite. Una vez caliente, agregue las cebollas, el ajo, el jengibre y el pimiento rojo. Cocine hasta que esté suave, luego retírelo del fuego y déjelo enfriar. Incline la mezcla en una licuadora o procesador de alimentos y mezcle hasta que quede suave.", "Agregue el puré a la sartén y cocine a fuego lento durante 5-10 minutos.", "Agregue el puré de tomate, la pasta de curry, el garam masala, las hojas de fenogreco, el cilantro molido y la cúrcuma fresca y cocine por otros cinco minutos.", "Coloque los muslos de pollo en la salsa y cocine a fuego lento durante 20 minutos.", "Para el arroz pilaf, caliente una olla grande y agregue el aceite. Una vez caliente, agregue el comino, el cardamomo, la canela, el pimiento negro y la hoja de laurel. Una vez que comiencen a reventar, agregue el arroz y continúe revolviendo hasta que el arroz esté ligeramente tostado.", "Agregue 650 ml / 1¼ de agua y la sal y deje que hierva. Coloque una tapa en la parte superior y baje el fuego. Deje que hierva durante 20-30 minutos.", "Justo antes de servir mezcle la mantequilla con un tenedor.", "Para servir, coloque el arroz en el plato y el curry a un lado. Adorne con el chile y el cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_45089", "title": "Pollo al curry con jengibre y pimiento rojo servido con arroz pilaf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 tallos regordetas de limoncillo", "50 g / 2 oz de jengibre fresco", "2 chiles rojos calientes", "2 dientes de ajo", "un racimo de cilantro", "2 limas", "2 cucharadas de aceite de cacahuete", "Tomates 200g / 7oz", "2 cucharadas de salsa de pescado (nam pla)", "2 cucharadas de salsa de soja oscura", "8 muslos de pollo", "400 ml / 14 oz puede leche de coco", "8 albaricoques, cortados a la mitad"], "method": ["Pele y deseche las hojas exteriores de la hierba de limón; a veces pueden ser duras. Corta las hojas interiores en trozos pequeños y colócalas en el procesador de alimentos. Pele el jengibre, luego corte en pedazos finos y agregue al lemongrass. Picar los chiles, descartar los tallos y agregar al jengibre con el ajo pelado. Cortar aproximadamente los tallos y la mitad de las hojas del cilantro para agregar al procesador de alimentos, reservando el resto para más adelante.", "Rallar la ralladura de lima en el procesador de alimentos, reservando las limas para más adelante, luego encienda la máquina y deje que corte todo hasta obtener una pasta gruesa. Agregue un poco de aceite de maní y raspe los lados con una espátula si se pega. Agregue la salsa de pescado, la salsa de soja y los tomates y procese durante unos segundos más.", "Caliente una cucharada adicional de aceite de cacahuete en una sartén honda a fuego moderado a alto y úsela para dorar las piezas de pollo y gírelas para que se coloreen bien por ambos lados. Levante los pedazos de pollo y vierta cualquier cosa más que una cucharada de aceite y jugos. Agregue la pasta de especias y déjela asar a fuego moderado durante dos minutos hasta que esté fragante, revuelva casi constantemente y luego devuelva el pollo a la sartén. Vierta sobre la leche de coco, revuelva, cubra y deje hervir a fuego lento durante 15-20 minutos. Mientras tanto, reduzca a la mitad y apedree los albaricoques y déjelos a un lado.", "Pon a prueba el cocido del pollo asegurándote de que esté bien cocido, luego agrega los albaricoques. Deje hervir a fuego lento durante unos minutos, luego agregue el jugo de las limas y las hojas de cilantro reservadas."], "url": "www_bbc_co_uk_food_recipes_chicken_curry_with_59058", "title": "Pollo de chile de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_curry_with_59058_16x9.jpg", "isVegetarian": false, "recommendations": 0}]