[{"ingredients": ["150ml / 5fl oz blanco miso", "150 g / 5 oz de azúcar en polvo", "aceite vegetal, para freír", "2 berenjenas, cortadas en cubos de 1-2 cm / ½ pulgadas", "2 cucharadas de cilantro fresco tostado", "50g / 2oz de mantequilla", "Filete de halibut 500g / 1lb 2 oz, huesos de piel y alfiler eliminados, carne cortada en 8 piezas", "100g / 3½oz de frijoles edamame", "1 cucharada de semillas de sésamo blanco", "1 cucharada de semillas de sésamo negro", "2 cucharadas de micro-berros, idealmente una mezcla de amaranto rojo y hojas de hinojo de bronce"], "method": ["Disuelva el miso y el azúcar en 50 ml / 2 fl oz de agua en una cacerola, luego lleve la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que se espese y se oscurezca en color. Decantar la mezcla en un recipiente hermético, como una botella squeezy equipada con una tapa pequeña de la boquilla (se puede mantener así en la nevera durante 1 semana).", "Caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Fríe la berenjena picada en dados, en lotes si es necesario, durante 2 a 3 minutos, o hasta que estén doradas y crujientes. Retirar del aceite con una cuchara ranurada, luego dejar de lado para escurrir sobre papel de cocina. Espolvorea sobre el cilantro picado y mezcla. Repita el proceso con la berenjena restante.", "Caliente la mantequilla en una sartén grande a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue las piezas de halibut (en lotes si es necesario) y fría en cada lado durante 2-3 minutos, o hasta que estén doradas y recién cocidas. Agregue los frijoles edamame y continúe freír hasta que estén calientes.", "Mezcle las semillas de sésamo juntas.", "Para servir, coloque las berenjenas fritas sobre los platos de servir, espárzalos sobre los frijoles edamame y espolvoree las semillas de sésamo encima. Termine con 2 piezas de pescado y una llovizna de salsa de miso, luego adorne con el berro mezclado."], "url": "www_bbc_co_uk_food_recipes_deep-fried_aubergine_80854", "title": "Berenjena frita con fletán y miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "10 chalotes, pelados y dejados enteros", "3 hojas de laurel", "350g / ¾lb de tocino curado en seco con lardons", "puñado de ramitas de tomillo fresco, en la rama, lavado, atado juntos con cuerdas", "5 dientes de ajo, pelados, picados", "750ml / 1¼ pintas de vino tinto", "Filete de 2,5 kg / 5½ lbs o bistec estofado, cortado en cubos de 4 cm / 1½ in", "sal y pimienta negra recién molida", "1 litro / 1¾ pintas de caldo de carne", "2 x 415 g / 14½ oz de consomé de ternera", "1 kg / 1¾ lb de papas harinas, como King Edward o Maris Piper, peladas y cortadas en cuartos", "40 g / 1½ oz de mantequilla", "150ml / 5fl de leche en oz", "1 x 350 g / 12½ oz cabeza verdes de primavera, solo hojas", "pizca de nuez moscada recién rallada", "4 cebollas de primavera, cortadas, en rodajas", "30g / 1 oz de perejil picado fresco de hoja plana"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Caliente el aceite en una bandeja grande para asar a fuego medio. Agregue los chalotes, las hojas de laurel, los lardons de tocino, el tomillo y el ajo, y freír suavemente durante 10-15 minutos, o hasta que los chalotes se hayan suavizado y sean translúcidos y los tocino estén comenzando a dorarse y pegarse al fondo de la sartén.", "Agregue el vino y raspe el sedimento del fondo de la bandeja de tostado con una cuchara de madera. Deje que el vino hierva a fuego lento y continúe cocinando a fuego lento durante 8-10 minutos, o hasta que el volumen del líquido se haya reducido.", "Sazone la carne en cubos, al gusto, con sal y pimienta negra recién molida.", "Coloque la carne sazonada encima de las chalotas, los lardones y la mezcla de vino sin mezclarlo. Vierta sobre el caldo y consomé para que la carne esté bien cubierta.", "Llevar la mezcla a fuego lento, luego cubrir la bandeja con papel de aluminio y transferir al horno. Cocine por 2½-3½ horas. Pruebe la ternura de la carne después de 1 hora y media apretando una pieza entre el pulgar y el índice. Si da, retire la cubierta de aluminio y continúe cocinando el daube de carne, sin tapar, durante el tiempo restante de cocción, hasta que la salsa se espese y la carne esté tierna.", "Mientras tanto, treinta minutos antes de servir, ponga las papas a hervir en una sartén con agua con sal. Cubra y cocine a fuego lento durante 15-20 minutos, o hasta que estén tiernos, luego drene bien.", "Regrese las papas cocidas a la sartén, agregue la mantequilla y la leche y vuelva a poner la sartén al fuego. Mash hasta que quede suave, luego temporada, a gusto, con sal, pimienta negra recién molida y nuez moscada.", "Pon a hervir otra olla de agua, luego agrega las hojas verdes de primavera y una pizca de sal. Hierva durante 4-5 minutos, revolviendo ocasionalmente, o hasta que estén tiernos, luego escurra bien.", "Cuando la carne esté muy tierna y la salsa se haya espesado, retire el daube de carne del horno y déjelo reposar durante 10 minutos.", "Justo antes de servir, mezcle las verduras cocidas de primavera y las cebolletas picadas en el puré de patatas y revuelva hasta que estén bien combinados.", "Para servir, vierta un poco del puré de colcannon en el centro de cada uno de los cuatro platos para servir. Cuchara sobre el daube de ternera, en su salsa. Adornar con el perejil picado."], "url": "www_bbc_co_uk_food_recipes_daubeofbeefwithgreen_92028", "title": "Daube de ternera con verduras y puré de colcannon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ron oscuro de 150ml / 5fl oz", "1 vaina de vainilla, partida por la mitad y las semillas raspadas", "250g / 9oz de fechas picadas", "125g / 4½oz de mantequilla, ablandada, más extra para engrasar", "125g / 4½oz de azúcar morena oscura", "3 huevos de gallinas camperas", "150 g / 5½ oz harina natural, más extra para quitar el polvo", "2 cucharaditas de bicarbonato de soda", "2 plátanos, pelados y en rodajas finas", "azúcar demerara, para quitar el polvo", "175g / 6oz demerara azúcar", "1 cucharada de jarabe de oro", "1 cucharada de melaza negra", "170 g / 5¾oz de mantequilla", "Crema doble 500ml / 18fl oz", "pizca de sal"], "method": ["En una sartén ponga el ron, 250 ml / 9 fl oz de agua y las semillas de vainilla a ebullición. Coloque las fechas en un recipiente, vierta el líquido sobre las fechas y déjelo en remojo durante una hora.", "Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Engrasa y enharina 6-8 moldes individuales o moldes para pan (dependiendo de la cantidad de personas que sirves).", "Bata la mantequilla y el azúcar moreno oscuro con un batidor eléctrico en un tazón. Agregue los huevos uno a la vez, golpeando entre cada adición. Tamizar la harina y el bicarbonato de soda. Mezcle y luego doble la mezcla de ron y dátil.", "Coloque la mezcla en los moldes para pasteles preparados y hornee en el horno durante 12-15 minutos, o hasta que esté firme al tacto. Una vez cocinado, retíralo del horno y colócalo en una rejilla para que se enfríe.", "Para la salsa de caramelo, coloque el azúcar, el jarabe, la melaza y la mantequilla en una sartén y deje que hierva. Baje el fuego y cocine, sin remover, hasta que todos los cristales de azúcar se hayan disuelto y tenga un caramelo de color marrón oscuro. Mientras tanto, caliente suavemente la crema en una olla. Retire el caramelo del fuego y añada con cuidado un tercio de la crema. Una vez que el burbujeo haya disminuido, mezcle con la crema restante. Agregue una pizca de sal y páselo por un colador fino. Dejar de lado hasta que sea necesario.", "Airee las rodajas de plátano en círculos sobre los budines cocidos. Polvo con azúcar demerara y caramelizar con un soplete de cocina (alternativamente coloque los postres debajo de una parrilla muy caliente). Deje a un lado durante unos minutos para que el azúcar se enfríe y fragüe, luego sirva con la salsa de caramelo."], "url": "www_bbc_co_uk_food_recipes_date_and_toffee_pudding_38967", "title": "Budín de dátiles y toffees con plátanos caramelizados y la mejor salsa de caramelo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["16 alitas de pollo grandes, carnosas y de corral", "aceite de oliva o girasol, para freír", "4 dientes de ajo", "sal marina", "4 cucharadas de aceite de oliva virgen extra", "1 cucharadita de chiles secos triturados", "1 tsp sweet paprika (pimentón)", "3 cucharaditas de vinagre de jerez", "6 cucharadas de aceite de oliva", "Chalotes de 200 g / 7 oz, finamente picados", "8 dientes de ajo, en rodajas finas", "Guisantes con cáscara 900g / 2lb, frescos o congelados", "200ml / 7fl oz de caldo de pollo, preferiblemente hecho en casa", "150g / 5oz de jamón Serrano en rodajas finas, finamente triturado", "sal marina y pimienta negra recién molida", "4 huevos de gallinas camperas"], "method": ["Corta los extremos puntiagudos de cada ala de pollo y deséchala. Seque bien las alas en papel de cocina.", "Caliente el aceite para freír a 180 ° C / 350 ° F (use un termómetro para cocinar) o use una freidora. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír un cuarto de las alitas de pollo durante 6-7 minutos, hasta que estén cocidas, crujientes y doradas.", "Mientras tanto, para el aderezo, coloque los dientes de ajo en una tabla, rocíe con un poco de sal y triture en una pasta suave con el lado plano de un cuchillo grande.", "Ponga el aceite de oliva virgen extra y el ajo triturado en una sartén pequeña a fuego medio-bajo. Tan pronto como el ajo comience a chisporrotear, agregue los chiles secos triturados y cocine muy suavemente durante dos minutos, hasta que el ajo esté ligeramente dorado.", "Agregue el pimentón dulce y el vinagre de jerez y retírelo del fuego.", "Tan pronto como el primer lote de alitas de pollo esté cocido, retírelo del aceite con una cuchara con ranura y escurre brevemente sobre papel de cocina. Inclínalas en un tazón para servir y rocía con algunos de los aderezos calientes de ajo y chile.", "Revuelva para cubrir el pollo con el aderezo y luego espolvoree con un poco de sal marina.", "Repita con las alas restantes freír en lotes.", "Para los guisantes, caliente el aceite de oliva en una sartén mediana con tapa. Agregue los chalotes y el ajo, cubra y cocine suavemente durante cinco minutos hasta que estén blandos, pero no dorados.", "Agregue los guisantes y el caldo de pollo, cubra parcialmente y cocine a fuego lento durante cinco minutos hasta que los guisantes estén tiernos y el líquido se haya reducido para dejarlos apenas húmedos.", "Agregue el jamón serrano y sazone al gusto con sal y pimienta.", "Rompa los huevos, bien separados, encima de los guisantes, sazone ligeramente con sal y pimienta negra recién molida y cubra la olla con una tapa bien ajustada.", "Deje que se cocine suavemente durante cinco minutos, o hasta que los huevos se ajusten a su gusto.", "Para servir, amontone las alitas de pollo calientes junto con los guisantes y los huevos."], "url": "www_bbc_co_uk_food_recipes_deep-fried_chicken_wings_91652", "title": "Alas de pollo fritas al ajillo con guisantes estofados y jamón serrano con huevos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep-fried_chicken_wings_91652_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "100 g / 3½ oz de harina de maíz", "pizca de sal", "150ml / 5½fl oz de agua con gas", "8 flores de calabacín", "125g / 4½oz de cebolla blanca picada", "35 g / 1 ozzo gramo", "1 cucharadita de semillas de cilantro, tostadas y molidas", "½ chile verde, sin semillas, finamente picado", "pizca de sal", "pellizcar ají rojo en polvo", "pizca de cúrcuma", "Maíz dulce de 150g / 5½ oz, blanqueado, a la parrilla y sin granos", "½ cebolla roja, finamente picada", "1 chile verde, finamente picado", "1 lima, solo jugo", "2 cucharadas de hojas de menta fresca picadas", "2 cucharadas de hojas frescas de cilantro picado", "sal y pimienta negra recién molida"], "method": ["Para las flores de calabacín fritas, caliente el aceite vegetal en una freidora, o llene una sartén grande, profunda, de base pesada, dos tercios llena de aceite vegetal. Caliente el aceite a 190 ° C / 375 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Mezcle la harina de maíz y la sal en un tazón. Agregue suficiente agua con gas para formar una masa suave (es posible que no necesite toda el agua).", "Sumerja las flores de calabacín en la masa y colóquelas en la freidora, teniendo cuidado de no saturar la freidora (es posible que deba hacerlo por lotes). Freír por dos minutos. Una vez cocido, retire cuidadosamente del aceite con una espumadera y escurra sobre un plato forrado con papel de cocina. Condimentar con sal y pimienta.", "Para la cebolla bhaji, mezcle las cebollas, la harina de gramo, las semillas de cilantro molidas y el chile verde junto con suficiente agua para unirlo a una mezcla espesa de rebozado. Agregue la sal, el chile en polvo y la cúrcuma y mezcle bien.", "Con cuidado, vierta un poco de la mezcla de bhaji en el aceite caliente o en la freidora para comprobar si está lo suficientemente caliente.", "Cuando esté listo, coloque cantidades de la mezcla en el aceite. Freír hasta que estén doradas.", "Retirar del aceite y escurrir sobre papel de cocina.", "Para la salsa de maíz dulce, coloque todos los ingredientes de la salsa en un tazón grande y mezcle para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque las flores de calabacín fritas y los bhajis de cebolla en un plato con la salsa de maíz dulce al lado."], "url": "www_bbc_co_uk_food_recipes_deep-fried_courgette_78312", "title": "Flores de calabacín fritas y bhaji de cebolla con salsa de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cangrejos cocidos, carne blanca y marrón extraída y mantenida separada, caparazones reservados, garras dejadas enteras", "200g / 7 oz de gambas crudas, cabezas y cáscaras retiradas y reservadas, sin decantación, carne finamente picada", "Anís de 2 estrellas", "600 ml / 1 pinta de caldo de pollo", "150ml / 5fl oz de aguardiente", "aceite de girasol, para freír", "2cm / ¾ en jengibre fresco de raíz, pelado y finamente picado", "1 diente de ajo, finamente picado", "2 cucharadas de salsa de soja", "1 cucharada de aceite de sésamo", "1 cucharada de jerez seco", "Harina normal de 75 g / 2½ oz", "2 huevos de gallinas camperas, golpeados", "Panco de 75 g / 2½ onzas o pan rallado fresco", "Perro de 30g / 1oz", "24 envolturas de wonton", "sal y pimienta negra recién molida", "2 cucharadas de cilantro fresco finamente picado, para servir"], "method": ["Coloque las cáscaras de cangrejo, cabezas de gambas y cáscaras, anís estrellado, caldo de pollo y brandy en una olla grande y cocínelas durante 40-50 minutos. Cuele, reserve el líquido y reserve.", "Llene una freidora o una cacerola grande, profunda y de fondo grueso, dos tercios llena con el aceite. Caliente a 180 ° C (un cubo de pan debe dorarse en 1 minuto cuando lo deje caer) PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Agriete las pinzas de cangrejo para exponer la mayor parte de la carne y quitar la cáscara. Mezcle las gambas finamente picadas, el jengibre, el ajo, la salsa de soja, el aceite de sésamo y el jerez para formar una pasta, o mezcle en un procesador de alimentos. Cubra la carne de garra de cangrejo en la pasta.", "Ponga la harina, los huevos y el pan rallado en tazones separados. Cubra las garras de cangrejo en la harina, luego con los huevos y luego las migas de pan.", "Fríe las pinzas por 2-4 minutos o hasta que estén cocidas. Ponlos en un plato forrado con papel de cocina para drenar.", "Mezcle 150g / 5½oz de carne de cangrejo marrón y la pasta nduja juntas. Coloque una cucharadita de la mezcla en el centro de un envoltorio wonton y humedezca los bordes. Coloque otro envoltorio wonton en la parte superior y presione hacia abajo para sellar. Use un cortador de pasteles para cortar un círculo perfecto. Repita con el resto de las envolturas para hacer 12 ravioles.", "Cocine los raviolis en una olla grande de agua hirviendo con sal durante 1-2 minutos o hasta que salgan a la superficie. Mientras tanto, calienta suavemente el caldo de cangrejo reservado.", "Para servir, coloque la carne de cangrejo blanca en el fondo de un recipiente para servir, agregue tres raviolis, vierta sobre el caldo y cubra con una uña. Adorne con el cilantro."], "url": "www_bbc_co_uk_food_recipes_deep-fried_crab_claw_01294", "title": "Garras de cangrejo fritas con ravioles de cangrejo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 caparazón de cangrejo", "100ml / 3½fl oz de aceite vegetal", "2 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "escogido carne de cangrejo marrón de 1 cangrejo", "200g / 7oz eligieron la carne de cangrejo blanca", "3 cucharadas de cebolla picada", "3 cucharadas de mooli picado", "1 cucharada de cilantro fresco picado", "Apretón de jugo de limón, salsa de soja y salsa de ostra, al gusto", "12 hojas de pasta filo", "aceite vegetal, para freír en grasa", "50g / 1¾oz de azúcar", "50ml / 2fl oz de vinagre de vino blanco", "Anís de 5 estrellas", "3 vainas de cardamomo", "1 ramita de canela", "1 chile rojo", "200 g / 7 oz espinaca bebé", "1 cucharada de aceite de sésamo", "2 cucharaditas de semillas de sésamo", "2 mangos, en cubos (o 350g / 12oz de mango preparado)"], "method": ["Para la mayonesa de cangrejo, ponga la cáscara de cangrejo y el aceite vegetal en una sartén y caliente para calentar. Retire del fuego y reserve para infundir el aceite con el sabor a cangrejo.", "Cuele el aceite con sabor a cangrejo en una jarra.", "Coloque las yemas de huevo en un bol y bata.", "Poco a poco mezcle el aceite drenado, agregando poco a poco.", "Agregue la mostaza Dijon, agregue la carne de cangrejo marrón y combine. Dejar de lado.", "Para los rollitos de primavera, mezcle todos los ingredientes en un tazón, excepto la masa y el aceite, y añada el jugo de limón, la salsa de soja y la salsa de ostras.", "Coloque una hoja de hojaldre sobre una superficie de trabajo limpia, distribuya una docena de la mezcla en una línea a lo largo de un extremo de la masa. Gire suavemente metiendo los bordes. Repita con los pasteles restantes.", "Precaliente el aceite en una freidora a 180C / 350F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír a fuego lento cada rollo de primavera durante unos minutos hasta que quede crujiente y dorado. Retire con cuidado con una cuchara ranurada y transfiera a un plato forrado con papel de cocina.", "Para la ensalada de mango fresco con especias, en una sartén caliente 250 ml / 9 fl oz de agua, el azúcar y el vinagre. Agregue el anís estrellado, el cardamomo, la ramita de canela y el chile. Llevar a ebullición y reservar para enfriar.", "Agite suavemente las hojas de espinaca del bebé en el aceite de sésamo en un tazón y espolvoree sobre las semillas de sésamo.", "Para servir, ponga algunas de las hojas en cada plato, cubra los cubos de mango en el aderezo y rocíelo encima de las hojas. Coloque los rollitos de primavera en la parte superior con una cucharada generosa de la mayonesa."], "url": "www_bbc_co_uk_food_recipes_deep-fried_crab_spring_20161", "title": "Rollitos de primavera de cangrejo fritos con ensalada de mango fresca y especiada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz tipo '00' harina de pasta", "5 huevos de gallinas camperas", "4 cucharadas de azúcar en polvo", "1 limón, ralladura finamente rallada solamente", "1 naranja, ralladura fina solamente", "2 cucharadas de vodka o whisky", "pizca de sal", "aceite de oliva o manteca de cerdo, para freír", "250 g / 9 oz de miel que moquea", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de agua", "1 mandarina, pelar solo, en juliana", "cáscara de cítricos confitada, para servir (opcional)"], "method": ["Para las donas, ponga la harina en un tazón grande y haga un pozo en el centro. Agregue los ingredientes restantes de la rosquilla, excepto la grasa, al pozo. Revuelva los ingredientes gradualmente con una cuchara de madera o con las manos, hasta que la mezcla se mezcle como una masa blanda. Cubra el recipiente con una toalla de té limpia y déjelo reposar en una habitación fresca durante 2-3 horas.", "Una vez que la masa ha descansado, rasgue pequeños trozos y gírelos en forma de salchichas del mismo tamaño de aproximadamente 1 cm / ½ pulgadas de grosor. Corte cada salchicha en pequeños gránulos de aproximadamente 1 cm / ½ de largo.", "Caliente el aceite o la manteca de cerdo en una cacerola profunda de base pesada a fuego medio, hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje los gránulos de masa en la grasa caliente, en tandas si es necesario. Freír por 2-3 minutos, o hasta que estén crujientes y doradas. Retire de la grasa con una cuchara ranurada y déjela a un lado para drenar el papel de cocina. Repita el proceso con los gránulos de masa restantes. Coloque todos los struffoli a un lado para enfriar.", "Mientras tanto, para la salsa, caliente los ingredientes de la salsa en una cacerola a fuego lento, revolviendo bien hasta que el azúcar se haya derretido. Llevar la mezcla a fuego lento y cocinar a fuego lento durante 3-4 minutos, o hasta que la salsa tenga la consistencia de jarabe. Dejar de lado para enfriar.", "Para servir, amontone el struffoli en un plato de servir y rocíe sobre la salsa. Decore con cáscara de cítricos confitada, si lo desea."], "url": "www_bbc_co_uk_food_recipes_deep-fried_doughnuts_39832", "title": "Donuts fritos (struffoli)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de vinagre de vino tinto", "1 hoja de laurel", "½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "Azúcar moreno suave ligero 75g / 3oz", "1,6 kg / 3 lbs 8 oz de tomates picados en lata", "1 cucharadita de sal marina en copos", "1 cucharada de mostaza inglesa en polvo", "1 diente de ajo, aplastado", "splash salsa Tabasco", "2 cucharadas de puré de tomate", "1-2 cucharadas de harina de maíz", "aceite vegetal, para freír", "15 g / ½ oz de levadura fresca", "azúcar pizca", "300ml / 10fl oz de cerveza", "1 cucharadita de vinagre de sidra", "Harina normal de 200g / 7oz", "pizca de sal", "Filete de bacalao de 200g / 7oz, pelado, cortado en pedazos", "Eglefino ahumado de 200g / 7oz, desollado, cortado en pedazos", "Gambas tigre 200g / 7oz, colas y sin cáscara", "1 lechuga butterhead, hojas retiradas", "1 cabeza de hinojo, en lonchas finas en una mandolina", "5 rábanos, en rodajas", "2-3 cucharadas de aceite de oliva virgen extra", "1 limón, solo jugo"], "method": ["Para el ketchup de tomate, caliente el vinagre, la bahía, las especias y el azúcar en una sartén de base pesada hasta que hierva a fuego lento.", "Agregue los ingredientes restantes, lleve a ebullición y revuelva para evitar que la mezcla se pegue al lateral de la sartén.", "Reduzca la temperatura a fuego lento y cocine por otros 30 minutos, revolviendo ocasionalmente.", "Mezcle la mezcla en una licuadora hasta que quede suave, luego empuje el ketchup a través de un colador.", "Para las picaduras de pescado, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Calor a 180C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, mezcle la levadura y el azúcar en un tazón. Vierta la cerveza y el vinagre y mezcle la harina y la sal. Deja fermentar. Está listo para usar cuando la mezcla comienza a burbujear.", "Sumerja el pescado en la mezcla y fríe hasta que esté dorado y cocido (3-4 minutos). Retire con una espumadera y escurra sobre papel de cocina.", "Para la ensalada, mezcle todos los ingredientes.", "Ponga las picaduras de pescado en una canasta llena de papel resistente a las grasas y sirva con el ketchup y la ensalada."], "url": "www_bbc_co_uk_food_recipes_deep-fried_fish_bites_30521", "title": "Bocados de pescado fritos con ketchup casero y ensalada de hinojo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de vino blanco", "5 huevos de gallinas camperas", "sal y pimienta negra recién molida", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "aceite vegetal, para freír", "2 huevos de gallinas camperas, solo yemas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10 fl oz aceite de colza", "1 cucharadita de jugo de limón", "1 trufa inglesa, finamente rallada", "sal marina, al gusto", "75g / 3oz de mantequilla", "4 rebanadas de brioche, 12.5cm / 5in largo, 5cm / 2in ancho y 5mm / ¼in grueso", "200 g / 7oz de setas silvestres mezcladas, limpiadas", "1½ cucharadas de cebollines finamente picados", "1 pequeños brotes de guisantes", "4 cucharadas de pollo demi-glace, calentado (200 ml / 7floz de caldo de pollo a fuego lento hasta reducirlo a 4 cucharadas)"], "method": ["Para el huevo frito, ponga a hervir una olla grande de agua, agregue el vinagre y una pizca de sal. Hierva cuatro de los huevos durante 5 minutos y medio. Retire los huevos de la cacerola con una espumadera y déjelos enfriar en un recipiente con agua helada.", "Batir el huevo restante en un bol con una pizca de sal y pimienta negra recién molida.", "Pelar los huevos duros. Prepare un plato de harina poco profundo y un plato aparte de pan rallado. Dragar los huevos duros en la harina, sumergir en el huevo batido y rodar en las migas de pan. Poner a un lado en una bandeja en la nevera hasta que sea necesario.", "Mientras tanto, para la mayonesa de trufa, coloque las yemas de huevo, el vinagre de vino blanco y la mostaza en un procesador de alimentos y mezcle hasta que quede pálido y cremoso.", "Con el motor en marcha, vierta el aceite, en un flujo lento y constante, hasta que la mayonesa esté espesa (es posible que no necesite todo el aceite). Mezcle el jugo de limón y la trufa. Guarde en el refrigerador hasta que lo necesite.", "Para las setas silvestres, caliente una sartén grande a fuego medio, agregue la mitad de la mantequilla y fría los croûtons de brioche hasta dorarlos por cada lado.", "Escurrir sobre papel de cocina y luego sellar cuidadosamente un pequeño orificio con un cortador redondo de 2,5 cm en un extremo del croûton.", "Coloque en los platos de servir.", "Regrese la sartén al fuego, agregue la mantequilla restante y los champiñones y fría a fuego fuerte durante 2-3 minutos, o hasta que estén tiernos.", "Sazone con sal y pimienta negra recién molida, luego agregue las cebolletas.", "Para cocinar los huevos, caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, vierta el aceite en una sartén profunda de base pesada a una profundidad de 2 cm / ¾ pulgada y lleve la misma temperatura a la placa de cocción, verificando con un termómetro de azúcar. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los huevos hasta que estén dorados por todos lados. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal.", "Para servir, coloque con cuidado cada huevo en el orificio de cada croûton brioche y tome una rodaja de la parte superior para mostrar la yema.", "Coloque los champiñones en el otro extremo del croûton, luego coloque una pequeña mayonesa de trufa directamente en el medio delante del croûton.", "Disperse algunos brotes de guisantes y luego termine con una llovizna del pollo demi-glace alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_deep-fried_goosnargh_87087", "title": "Huevo Goosnargh frito con hongos silvestres, brioche tostado y mayonesa de trufa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 250 g / 9 oz bloques halloumi, cortados en rebanadas de 1 cm / ½ in", "200ml / 7fl oz de suero de leche", "harina común, para quitar el polvo", "aceite vegetal, para freír", "sal y pimienta negra recién molida", "Harina normal 225g / 8oz", "1 huevo de corral, separado", "Lager-cold de 300ml / 10½fl oz", "2 papas para hornear grandes, ralladas", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "50g / 1¾oz de alcaparras", "50g / 1¾oz de pepinillos", "1 cucharada de eneldo fresco picado", "1 limón, jugo y ralladura", "200ml / 7fl oz de mayonesa", "cuñas de limón, para servir"], "method": ["Marinar el halloumi en el suero de leche durante al menos 20 minutos.", "Para hacer la mezcla, tamiza la harina en un tazón grande y agrega la yema de huevo. Batir en la cerveza poco a poco y agregar 125 ml / 4½ onzas de agua helada hasta que estén bien combinados.", "Batir la clara de huevo hasta que se formen picos rígidos en un recipiente aparte. Dobla las claras de huevo en la masa y enfríelas en la nevera hasta que sea necesario.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C / 350 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Agite cualquier exceso de suero de leche del halloumi, luego sumérjalo en la harina y cubra con la mezcla. Freír el halloumi 5 minutos o hasta que esté crujiente y dorado. Retirar con una cuchara ranurada y escurrir sobre una bandeja para hornear forrada con papel de cocina. Sazone al gusto con sal y pimienta negra recién molida.", "Para los röstis, hierva las papas durante 7-8 minutos, luego escurra. Una vez que estén lo suficientemente fríos como para manipularlos, pélelos y ralladlos en trozos gruesos y sazone con sal y pimienta negra recién molida.", "Forme formas planas y redondeadas de la mezcla de patata y deje enfriar en la nevera durante 20 minutos.", "Caliente el aceite en una sartén y fría el rostis a fuego medio durante 4-5 minutos por cada lado, o hasta que esté crujiente y dorado. Escurrir sobre papel de cocina.", "Para la salsa tártara, mezcle las alcaparras, los pepinillos, el eneldo y el limón en un bol, agregue la mayonesa y mezcle hasta que estén bien combinados.", "Sirva el halloumi en la parte superior de un rosti con una cucharada de salsa tártara y una rodaja de limón en el costado."], "url": "www_bbc_co_uk_food_recipes_deep-fried_halloumi_with_42154", "title": "Halloumi frito con patatas röstis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de helado de vainilla", "Galletas de nuez de jengibre 150 g / 5½ oz", "75g / 2½oz de coco desecado", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de crema de coco", "aceite vegetal, para freír", "150 g / 5½ oz pasas", "Ron oscuro de 150ml / 5fl oz", "1 cucharadita de canela molida", "1 lima, ralladura solamente", "200g / 7oz de azúcar granulada", "100ml / 3½ fl oz crema doble", "pizca de sal"], "method": ["Coloque una bandeja pequeña para hornear en el congelador durante al menos 20 minutos, hasta que esté muy fría. Retire del congelador. Use una bola de helado para hacer bolas de helado, cada una del mismo tamaño que una pelota de golf. Coloque en la bandeja de hornear y congele durante al menos una hora, preferiblemente más tiempo.", "En un procesador de alimentos, mezcle los bizcochos con la textura de migajas de pan fino y luego mezcle con el coco desecado. Mezcle los huevos con la crema de coco.", "Retire el helado del congelador. Sumerja cada bola en la mezcla de galletas y coco, dándole palmaditas en el helado. Luego sumerja cada bola en la mezcla de crema de huevo y coco, luego cubra nuevamente la mezcla de galletas y coco. Repita este paso nuevamente para asegurarse de obtener una corteza gruesa sin riesgo de fugas. Regrese al congelador de nuevo, esta vez durante varias horas o preferiblemente durante la noche.", "Mientras tanto, para la salsa, ponga las pasas y el ron en una cacerola con la canela. Llevar a ebullición, luego retirar inmediatamente del fuego y agregar la ralladura de limón. Deje que se infunda mientras hace el caramelo.", "Ponga el azúcar en una olla mediana con 100 ml / 3½ fl oz de agua. Revuelva hasta que el azúcar se vea como arena muy húmeda. Establecer a fuego medio y dejar hasta que el azúcar comience a disolverse. No revuelva, pero agite la sartén con cuidado cada cierto tiempo si parece que se está cocinando de manera irregular. Cuando se haya vuelto de un color ámbar, retírelo del fuego y vierta la crema; chisporroteará y burbujeará, así que tenga cuidado. Si el caramelo se asoma, ponga a fuego lento y revuelva hasta que se haya disuelto nuevamente en una salsa. Agregue el ron infundido y las pasas. Pruebe, sazone con sal y agregue más ron si es necesario.", "Cuando esté listo para freír el helado, caliente el aceite en una freidora a 190 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Retire las bolas de helado del congelador en el último minuto, y cuidadosamente baje las bolas en el aceite y cocine por alrededor de 15 segundos, hasta un rico color dorado. Escurrir sobre la toalla de cocina y servir inmediatamente con el ron y la salsa de pasas."], "url": "www_bbc_co_uk_food_recipes_deep-fried_ice_cream_29049", "title": "Helado frito con salsa de ron y pasas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pinta de aceite vegetal, para freír", "Harina normal de 200g / 7oz", "1 cucharadita de sal", "1 cucharadita de azúcar", "7g bolsita instantánea de levadura", "Vodka de 50ml / 2fl oz", "200ml / 7fl oz de agua tónica", "5 cucharadas de mayonesa", "25 ml / 1 fl oz de salsa de chile dulce", "2 cucharaditas Yuzuji", "150g / 5½oz de mejillones cocidos y sin cáscara", "150 g / 5½ oz de langostinos cocidos y sin cáscara", "2 cebollas de primavera, en rodajas", "1 chile rojo, en rodajas", "1 cucharada de cilantro fresco picado"], "method": ["Caliente el aceite en una olla grande hasta que alcance los 170 ° C / 330 ° F en un termómetro para cocinar. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle la harina, la sal, el azúcar, la levadura, el vodka y el agua tónica para hacer una mezcla. Deja probarlo durante 10 minutos.", "Para hacer la inmersión, en un recipiente aparte, mezcle la mayonesa, la salsa de chile y el jugo de yuzu.", "Cubra los mejillones y langostinos en la mezcla. Freír en tandas hasta que estén crujientes y doradas. Eliminar con una cuchara ranurada. Escurrir sobre papel de cocina.", "Espolvoree las cebolletas, el chile y el cilantro sobre el marisco machacado y sirva con la salsa."], "url": "www_bbc_co_uk_food_recipes_deep-fried_mussels_and_66637", "title": "Langostinos y mejillones fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de vino blanco", "5 huevos de gallinas camperas", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "aceite vegetal, para freír", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "300g / 10½oz de setas silvestres mezcladas, rotas en pedazos si son grandes", "2 cucharadas de eneldo, finamente picado", "trufa negra fresca, afeitada al gusto", "½ pan brioche, cortado en rodajas gruesas", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10fl oz de aceite vegetal", "4 cucharadas de eneldo fresco, finamente picado", "trufa negra fresca, al gusto", "sal y pimienta negra recién molida"], "method": ["Para el brioche tostado, ponga a hervir una cacerola grande de agua, agregue el vinagre y una pizca de sal. Hervir 4 de los huevos durante 5 minutos. Retire los huevos de la cacerola con una espumadera y déjelos enfriar en un recipiente con agua helada.", "Rompe el huevo restante en un tazón. Batir con una pizca de sal y pimienta.", "Pelar los huevos duros. Prepare un plato de harina poco profundo y un plato aparte de pan rallado. Dragar los huevos duros en la harina, sumergir en el huevo batido y rodar en las migas de pan. Poner a un lado en una bandeja en la nevera hasta que sea necesario.", "Caliente el aceite en una freidora a 180 ° C. Alternativamente, vierta el aceite en una sartén profunda de base pesada a una profundidad de 2 cm / pulgada y caliente hasta que la miga de pan se ponga marrón cuando la introduzca. (Precaución: El aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Fríe los huevos hasta que estén dorados. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal.", "Caliente una sartén, agregue la mantequilla y el aceite de oliva. Agregue la chalota y fría a fuego lento durante 3 minutos, hasta que se ablande. Agregue el ajo y los champiñones y cocine hasta que los champiñones hayan liberado su líquido y estén tiernos. Termine con el eneldo y la trufa negra y sazone con sal y pimienta.", "Para la mayonesa, ponga las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos y mezcle hasta que quede pálido y cremoso.", "Con el motor en funcionamiento, vierta una corriente constante de aceite hasta que la mayonesa esté espesa (es posible que no necesite todo el aceite). Justo antes de servir, agregue el eneldo y la trufa y mezcle.", "Cuando esté listo para servir, caliente una sartén limpia y coloque el brioche en la sartén caliente. Tueste cada lado hasta que se dore.", "Para servir, haga un agujero en las rebanadas de brioche y coloque los huevos en los agujeros. Viste el plato con champiñones, mayonesa y virutas de trufa fresca."], "url": "www_bbc_co_uk_food_recipes_deep-fried_soft_boiled_73060", "title": "Huevo frito hervido con brioche tostado, champiñones y mayonesa de eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de vino blanco", "5 huevos de gallinas camperas", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "aceite vegetal, para freír", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "300g / 10½oz de setas silvestres mezcladas, rotas en pedazos si son grandes", "½ pan brioche, cortado en rodajas gruesas", "2 yemas de huevo", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10fl oz de aceite vegetal", "4 cucharadas de perejil fresco picado", "2 cucharadas de estragón fresco picado", "sal y pimienta negra recién molida"], "method": ["Para el huevo frito, ponga a hervir una olla grande de agua, agregue el vinagre y una pizca de sal. Hervir 4 de los huevos durante 5 minutos. Retire los huevos de la cacerola con una espumadera y déjelos enfriar en un recipiente con agua helada.", "Rompe el huevo restante en un tazón. Batir con una pizca de sal y pimienta.", "Pelar los huevos duros. Prepare un plato de harina poco profundo y un plato aparte de pan rallado. Dragar los huevos duros en la harina, sumergir en el huevo batido y rodar en las migas de pan. Poner a un lado en una bandeja en la nevera hasta que sea necesario.", "Caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, vierta el aceite en una sartén profunda de base pesada a una profundidad de 2 cm / pulgada y lleve a la misma temperatura en la placa. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los huevos hasta que estén dorados. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal.", "Caliente una sartén, agregue la mantequilla y el aceite de oliva. Agregue la chalota y fría a fuego lento durante 3 minutos, hasta que se ablande. Agregue el ajo y los champiñones y cocine hasta que los champiñones hayan liberado su líquido y estén tiernos. Condimentar con sal y pimienta.", "Caliente una sartén limpia. Coloque el brioche en la sartén caliente y tueste cada lado hasta que se dore.", "Para la mayonesa, ponga las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos y mezcle hasta que quede pálido y cremoso.", "Con el motor en funcionamiento, vierta una corriente constante de aceite hasta que la mayonesa esté espesa (es posible que no necesite todo el aceite). Justo antes de servir agregue las hierbas y mezcle.", "Para servir, haga un agujero en las rebanadas de brioche y coloque los huevos en los agujeros. Viste el plato con champiñones y mayonesa."], "url": "www_bbc_co_uk_food_recipes_deep-fried_soft-boiled_22870", "title": "Huevo pasado por agua frito con champiñones, brioche tostado y mayonesa de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de vinagre de vino blanco", "6 huevos de gallinas camperas", "25g / 1oz de mantequilla", "Hojas de espinaca baby 400g / 14oz, lavadas y escurridas", "generosa crema doble splash", "Harina normal de 100 g / 3½ oz", "Pan rallado de 100 g / 3½ oz panko", "50g / 1¾oz de queso cheddar o parmesano rallado", "aceite de girasol, para freír", "sal y pimienta negra recién molida", "4 lonchas de tocino rayado ahumado, a la parrilla hasta que estén crujientes y rotas", "1 cucharadita de aceite de trufa"], "method": ["Ponga a hervir un recipiente grande y poco profundo de agua y agregue el vinagre. Agriete cuatro huevos en tazas individuales. Mezcle el agua hirviendo para crear un \"remolino\". Vierta los huevos uno por uno. Deje que el agua vuelva a hervir y cocine los huevos durante 2½ minutos. Retire los huevos del agua con una cuchara ranurada y sumérjalos en un recipiente con agua helada. Dejar enfriar hasta que se requiera.", "En una sartén grande o wok, derrita la mantequilla y agregue la espinaca. Cocine a fuego alto durante 2 minutos, o hasta que se marchite. Agregue la crema, reduzca el fuego y luego sazone con sal y pimienta.", "Pon la harina en un tazón pequeño. Batir los dos huevos restantes en un segundo tazón. Mezcle las migas de pan y el queso en un tercer tazón. Retire con cuidado cada huevo escalfado del agua helada y séquelo con papel de cocina.", "Cuidadosamente cubra cada huevo en la harina, luego el huevo y luego el queso y la mezcla de migas de pan. Coloque en una bandeja para hornear y cubra con una película adhesiva. Ponlo en la nevera por 10 minutos.", "Mientras tanto, caliente el aceite en una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír los huevos durante 2-3 minutos, o hasta que estén dorados y crujientes. Escurrir sobre papel de cocina.", "Mientras tanto, recalentar la espinaca y dividir entre cuatro cuencos calentados. Cubra con los huevos y decore con tocino crujiente y unas gotas de aceite de trufa."], "url": "www_bbc_co_uk_food_recipes_deep_fried_poached_eggs_31935", "title": "Huevos escalfados fritos con espinacas a la crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de arroz pegajoso", "200g / 7oz de chiles secos calientes", "1 lubina de alrededor de 500-600g / 1lb 2oz-1lb 5oz, eviscerada y escamada, pero las aletas y la cola quedan en", "3 cucharadas de salsa de soja ligera", "pizca de azúcar blanco", "aceite vegetal, para freír", "2 palitos de limoncillo, en rodajas finas", "4-5 chalotes rojos tailandeses, en rodajas finas (disponible en línea)", "2 cebollas de primavera, en rodajas finas", "pequeño puñado de cilantro de diente de sierra (a veces llamado perejil tailandés), en rodajas finas (disponible en línea)", "3-4 hojas de lima Kaffir frescas o congeladas, cortadas en tiras muy finas", "pequeño puñado de hojas de menta fresca", "pequeñas hojas de cilantro fresco", "2-3 chiles secos, fritos brevemente en un poco de aceite hasta que estén rojos y crujientes", "5 cucharadas de jugo de lima", "1½ cucharadita de azúcar en polvo", "4 cucharadas de salsa de pescado", "1 mandarina, solo jugo", "1 cucharada de chile tostado en polvo (ver arriba)"], "method": ["Para el polvo de arroz tostado, tueste el arroz en una sartén a fuego lento hasta que se dore. Deje enfriar, luego muele hasta obtener un polvo grueso en un mortero o un molinillo de especias.", "Para el chile en polvo asado, seque lentamente los chiles secos calientes en un wok o fríalos a fuego medio bajo hasta que estén rojos oscuros y un poco negros en algunos lugares, esto demorará entre 10 y 15 minutos. Luego triturar en un polvo grueso en un mortero o un molinillo de especias.", "Precaliente una freidora o una sartén de fondo grueso con fondo grueso a 180 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida).", "Puntuación de la lubina con 3-4 cortes en ángulo en cada lado. Luego enróllalo en salsa de soja y azúcar. Coloque el pescado en la canasta de freír para que se curve ligeramente (esto es solo para la presentación) y luego fríalo por unos 8-10 minutos, hasta que la piel esté crujiente y la carne tenga un color dorado intenso.", "Mientras el pescado se está friendo, coloque todos los ingredientes de la ensalada, excepto los chiles fritos, en un tazón.", "Ahora prepara el aderezo, mezcla el jugo de lima y el azúcar hasta que el azúcar se disuelva. Agregue la salsa de pescado, el jugo de mandarina, 3 cucharadas de agua y el chile tostado en polvo. Pruebe y ajuste: debe ser caliente, ácido y ligeramente salado. Dejar de lado.", "Una vez que el pescado esté cocido, retírelo con cuidado de la freidora y déjelo escurrir y dejar enfriar un poco en papel de cocina por un minuto.", "Coloque el pescado en un plato grande y vierta dressing del aderezo sobre él, agregue el resto del aderezo a la ensalada y sirva la ensalada sobre la parte superior del pescado crujiente. Adorne con el polvo de arroz tostado y los chiles secos."], "url": "www_bbc_co_uk_food_recipes_deep_fried_sea_bass_with_54134", "title": "Lubina frita con ensalada estilo Issan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de levadura fresca", "¼ cucharadita de azúcar en polvo", "¼ cucharadita de sal", "200ml / 7fl oz de cerveza belga", "1 cucharadita de vinagre balsámico blanco", "4 cucharadas de cilantro picado", "1 lima, solo jugo", "Harina normal de 200g / 7oz", "8 cangrejos de caparazón blando", "sal", "6 dientes de ajo, cortados por la mitad", "250ml / 9fl oz de vino blanco", "2 yemas de huevo de gallinas camperas", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "sal al gusto", "125ml / 4fl oz de aceite de oliva virgen extra", "½ cucharadita de azafrán, remojado en 25ml / 1fl oz de agua caliente", "1 limón, solo jugo", "2 manojos de berro", "½ manojo de menta", "2 puñados de brotes de guisantes", "1 cucharada de aceite vegetal", "2 chiles rojos, finamente picados", "2 chiles verdes, finamente picados"], "method": ["Para hacer la masa para el cangrejo, coloque la levadura, el azúcar, la sal, la cerveza, el vinagre balsámico blanco, el cilantro y el jugo de lima en un tazón grande y bata hasta que quede suave.", "Agregue la harina y bata hasta que la mezcla esté bien combinada. Deja reposar por una hora.", "Precaliente una freidora de grasa a 190 ° C / 370 ° F, o hasta que un cubo de pan chisporrotea y se ponga dorado cuando se deja caer en el aceite. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los cangrejos en la mezcla y colóquelos en la freidora durante 3-4 minutos, volteándolos dos o tres veces, hasta que estén dorados y crujientes.", "Retire con cuidado los cangrejos del aceite caliente con una cuchara ranurada, coloque en un plato forrado con papel de cocina y sazone con sal.", "Para el alioli, coloca el ajo y el vino blanco en una sartén y cocina por unos minutos, luego escurre.", "Coloque las yemas de huevo en un procesador de alimentos pequeño, agregue el vinagre, la mostaza de Dijon y la sal. Licúe hasta que quede suave, luego con el motor en marcha, agregue gradualmente el aceite hasta que la mezcla se parezca a la mayonesa. Agregue el azafrán y el ajo y mezcle para combinar. Agregue jugo de limón al gusto.", "Para la ensalada de berros, coloque los brotes de berro, menta y guisantes en un recipiente. Calentar un wok pequeño y agregar el aceite. Una vez caliente, agregue los chiles y cocine por un par de minutos.", "Para servir, coloque el cangrejo frito en un tablero y coloque las hojas al lado. Cubra el cangrejo con los chiles fritos y coloque el alioli en un recipiente."], "url": "www_bbc_co_uk_food_recipes_deep_fried_soft-shell_80642", "title": "Cangrejo de caparazón blando frito con alioli y ensalada de berros", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz hombro de cerdo deshuesado", "4 harinosos baps, para servir", "1 cebolla grande, finamente picada", "8 dientes de ajo, toscamente picados", "1½ cucharadita de Tabasco", "½ cucharadita de semillas de cilantro", "2 cucharadas de mostaza inglesa en polvo", "2 cucharaditas de pimentón", "6 cucharadas de ketchup de tomate", "1 cucharada de salsa Worcestershire", "2 cucharadas de melaza", "75g / 2¾oz de azúcar moreno oscuro", "sal marina", "3 patatas dulces, cortadas en finas virutas", "1 cucharada de aceite vegetal", "2 cucharaditas de condimento Cajun", "algunas ramitas de tomillo fresco", "3 cucharadas de suero de leche", "3 cucharadas de mayonesa", "1 cucharada de vinagre de sidra de manzana", "1 diente de ajo, finamente picado", "3 zanahorias, ralladas", "½ cabeza de repollo blanco, finamente rallado", "½ cabeza de col roja, finamente triturada", "6 cebollas de primavera, en rodajas finas", "sal y pimienta negra recién molida"], "method": ["Para hacer el adobo, coloque todos los ingredientes en una licuadora y mezcle hasta que tenga una mezcla suave.", "Coloque el cerdo en una cacerola grande, vierta sobre el adobo y revuelva la carne hasta que esté cubierto. Cubre y adobe en la nevera durante 2 horas, o durante la noche si tienes tiempo.", "Coloque la sartén a fuego alto, agregue el agua suficiente para cubrir la carne (necesitará aproximadamente 1 litro / 1¾ pintas) y deje que hierva. Reduzca el fuego a fuego lento, cubra con una tapa y cocine por 1½ horas, o hasta que la carne se separe fácilmente con un tenedor. Tendrás que girar el cerdo durante el tiempo de cocción.", "Mientras tanto, precalentar el horno a 210C / 190C Ventilador / Gas 6. Ponga la batata en una lata grande para asar, rocíe sobre el aceite y espolvoree el condimento Cajun y el tomillo. Asar durante 35-40 minutos, volteando hasta la mitad, hasta que esté ligeramente carbonizado en los bordes.", "Cuando el cerdo esté cocido, quítelo de la salsa con un tenedor de trinchar. Triture la carne, luego transfiérala a un plato, cúbrala con papel de cocina y déjela a un lado. Regrese el adobo al fuego y traiga un fuego lento a fuego lento. Cocine sin tapa hasta que esté reducido y espeso.", "Para la ensalada de col, ponga el suero de leche, la mayonesa, el vinagre y el ajo en un tazón grande. Agregue las zanahorias, las coles y las cebolletas y revuelva hasta que estén cubiertas. Condimentar con sal y pimienta.", "Tueste los panecillos, coloque la carne de cerdo y vierta sobre la salsa de adobo. Sirva con batatas fritas y ensalada de col."], "url": "www_bbc_co_uk_food_recipes_deep_south_pulled_pork_60591", "title": "Deep South sacó platos de cerdo con batatas fritas y ensalada de col", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep_south_pulled_pork_60591_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tubos de calamar de 400g / 14oz", "harina blanca llana para cubrir", "sal y pimienta para probar", "aceite para freír", "4 cucharadas de mayonesa", "½ limón, jugo", "3 ramitas de eneldo, picadas"], "method": ["Para los calamares, abre los tubos de calamar y corta en tiras de 2cm / ¾ pulgadas.", "Cubra con harina y sazone.", "Coloque en la nevera durante 2 horas. Al hacer esto, encontrarás que la harina se derretirá en el calamar creando una forma de auto-rebozado. Cuando esté frito estará deliciosamente crujiente. No es un método tradicional, sino una excelente alternativa.", "Freír en aceite caliente hasta que estén doradas, escurrir sobre la toalla de cocina y servir con mayonesa de limón.", "Para la mayonesa de limón, mezcle todos los ingredientes y sirva con los calamares."], "url": "www_bbc_co_uk_food_recipes_deepfriedcalamariwit_13050", "title": "Calamares fritos con mayonesa de limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]