[{"isVegetarian": false, "title": "Solomillo a la parrilla con salsa de chimichurri", "url": "www_bbc_co_uk_food_recipes_barbecuedsirloinwith_91627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedsirloinwith_91627_16x9.jpg", "ingredients": ["2-3 chiles rojos largos, sin semillas, finamente picados", "10-12 dientes de ajo, pelados, finamente picados", "2 manojos grandes de perejil de hojas rizadas finamente picadas, solo hojas", "4 cucharaditas de orégano seco", "2 cucharaditas de copos de sal marina", "5 cucharadas de vinagre de vino tinto", "4-5 cucharadas de aceite de oliva virgen extra", "5 cucharadas de agua fría", "1 x 2 kg / 4½ lb de solomillo de buey deshuesado bien cocido, no enrollado (peso después de hueso extraído)", "pimienta negra recién molida"], "serves": "Sirve 8-10", "time": {"preparation": "durante la noche", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Para la salsa de chimichurri, coloque los chiles picados y el ajo en un tazón.", "Agregue los ingredientes restantes de salsa chimichurri y revuelva bien hasta que se combinen. Cubra el recipiente con una lámina de película adhesiva, luego deje la mezcla a un lado durante 4-6 horas para permitir que los sabores se infundan, o preferiblemente durante la noche.", "Una hora y media antes de servir la comida, encienda la barbacoa al aire libre y deje los carbones para calentar durante una hora.", "Cuando los carbones estén al rojo vivo y las llamas se hayan apagado, suspenda una rejilla de cocina a 25 cm por encima de las brasas.", "Sazone el solomillo de ternera con sal y pimienta negra recién molida, luego coloque el solomillo de ternera sazonado, con la cara con grasa hacia abajo, sobre la rejilla para cocinar. (NB: lo ideal es que, durante la cocción, la barbacoa se cubra con una tapa y las rejillas de ventilación se abran).", "Corte el lado graso del solomillo durante 4-6 minutos o hasta que se dore, luego voltee la carne y continúe cocinando durante 20-25 minutos.", "Voltee nuevamente el filete de solomillo y continúe cocinando por otros 20 minutos (por el medio), o hasta que el solomillo esté asado a su gusto.", "Cuando el solomillo de ternera esté cocido a su gusto, retírelo de la barbacoa y póngalo a un lado para que descanse durante diez minutos, antes de cortarlo en rodajas gruesas.", "Para servir, coloque 2-3 rebanadas del solomillo de ternera a la parrilla en los platos y sirva sobre la salsa de chimichurri."]}, {"isVegetarian": false, "title": "Chuletas de ternera a la barbacoa con hierbas frescas y salmoriglio", "url": "www_bbc_co_uk_food_recipes_barbecuedvealchopswi_91628", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedvealchopswi_91628_16x9.jpg", "ingredients": ["4 x 200 g / 7oz de chuletas de lomo de ternera rosadas gruesas", "4 cucharadas de aceite de oliva virgen extra", "2 cucharadas de semillas de hinojo", "gran grupo de salvia fresca, aproximadamente desgarrado", "6-8 ramitas de tomillo fresco, rotas en longitudes más pequeñas", "4 ramitas grandes de romero fresco, rotas en longitudes más pequeñas", "2 bulbos de ajo, cortados por la mitad horizontalmente, luego rotos en trozos más pequeños", "2 limones no encerados, cáscara pelada de la fruta en tiras largas", "pimienta negra recién molida", "copos de sal marina", "gran puñado de hojas de mejorana fresca finamente picado", "5 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo, más rodajas de limón, para servir", "½ cucharadita de copos de sal marina"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Frote las chuletas de ternera con el aceite de oliva. Colóquelos en un plato grande y poco profundo, luego espolvoree sobre las semillas de hinojo.", "Espolvoree las hojas de salvia, ramitas de tomillo, ramitas de romero, ajo y tiras de cáscara de limón sobre las chuletas de ternera. Sazonar, al gusto, con pimienta negra recién molida.", "Cubra el plato con film transparente y deje enfriar en el refrigerador durante 4-6 horas, volteando las chuletas de ternera después de tres horas.", "Treinta minutos antes de comenzar a cocinar, encienda la barbacoa al aire libre.", "Cuando los carbones estén al rojo vivo y las llamas se hayan apagado, sazone las chuletas de ternera marinada con sal, luego colóquelas en un estante colocado sobre las brasas. Espolvorea sobre las hierbas usadas en el adobo, lo que les permite fumar y quemar donde caigan.", "Cocine las chuletas de ternera durante 5-6 minutos en cada lado, o hasta que estén carbonizadas por ambos lados, pero tiernas, rosadas y jugosas por dentro (corte una de las chuletas de ternera para verificar).", "Cuando las chuletas de ternera estén cocidas a su gusto, retírela de los carbones y déjela reposar durante 4-5 minutos.", "Mientras tanto, para el salmoriglio, en un tazón, mezcle la mejorana picada, el aceite de oliva, el jugo de limón y los copos de sal marina hasta que estén bien combinados. Revuelva bien y deje de lado durante 8-10 minutos para permitir que los sabores se infundan.", "Para servir, coloca una chuleta de ternera en el centro de cada una de las cuatro placas para servir. Cuchara sobre la salsa salmoriglio."]}, {"isVegetarian": false, "title": "Barbacoa al horno frijoles en bruschetta con tocino", "url": "www_bbc_co_uk_food_recipes_barbequebakedbeanson_84001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Frijoles horneados de 200g / 7oz", "1 diente de ajo, aplastado", "1 cucharada de azúcar morena suave", "pizca de copos de chile seco", "1 cucharada de salsa de soja", "4 rebanadas gruesas de ciabatta", "Queso cheddar de 110 g / 4 oz, cortado en cuatro rebanadas", "55 g / 2 oz de tocino rayado, cortado en tiras y frito hasta que quede crujiente"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para los frijoles, cocine suavemente todos los ingredientes de frijoles en una cacerola pequeña a fuego medio durante diez minutos, revolviendo ocasionalmente.", "Mientras tanto, para la bruschetta, caliente una sartén hasta que fume. Agregue las rebanadas de ciabatta y pan tostado por dos minutos en cada lado.", "Retire la chapata de la plancha y coloque una rebanada de queso en cada pieza. Coloque en una bandeja para hornear y coloque en el horno para hornear durante cinco minutos, o hasta que el queso se haya derretido.", "Para servir, retire cuidadosamente la chapata del horno y colóquela en los platos. Vierta sobre los frijoles y decore con los pedazos de tocino."]}, {"isVegetarian": false, "title": "Carne de cerdo a la barbacoa", "url": "www_bbc_co_uk_food_recipes_barbeque_belly_pork_40196", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbeque_belly_pork_40196_16x9.jpg", "ingredients": ["1.5kg / 3lb5oz vientre de cerdo", "3 cucharadas de sal marina", "Anís de 2 estrellas, molido", "1 naranja grande, solo ralladura", "2 hojas frescas de laurel", "8 dientes de ajo", "1 cucharada de granos de pimienta de Sichuan", "½ cucharadita de polvo chino de cinco especias", "200ml / 7fl oz de aceite de oliva", "2 cucharadas de aceite de sésamo"], "serves": "Sirve 4-6", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Asegúrate de que tú o tu carnicero marquen bien la piel de cerdo (usando un cuchillo de cocina pequeño o afilado o un cuchillo limpio para bricolaje): buenos puntajes finos hacen que crepiten mejor. Mezcle la sal, el anís estrellado molido y la ralladura de naranja juntos y frote bien en la piel, asegurándose de que la sal entre en todos los cortes de la corteza de cerdo.", "Con una mini-licuadora o mortero, agregue las hojas de laurel, el ajo, los granos de pimienta de Szechuan, cinco especias y mezcle hasta obtener una pasta, luego agregue lentamente el aceite de oliva mientras lo mezcla.", "Deje que el cerdo se seque durante la noche en la nevera; no cubras como quieras que se seque.", "Caliente una barbacoa o una plancha y corte la carne de cerdo en rodajas finas. Coloque las rebanadas de cerdo en la plancha o parrilla caliente y cepille con el adobo. Cocine cada lado por unos minutos, o hasta que esté cocido y la piel esté crujiente."]}, {"isVegetarian": false, "title": "Solomillo de cerdo con patatas molidas y salsa de mostaza", "url": "www_bbc_co_uk_food_recipes_barbequedporkwithcru_90713", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Lomo de cerdo 85g / 3oz", "2 ramitas de romero fresco", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "8 patatas Anya, partidas a la mitad", "15g / ½ oz de mantequilla", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida", "100ml / 3½ fl oz crema doble", "1 cucharadita de mostaza Dijon", "1 cucharada de jugo de limón"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cerdo, haga dos incisiones en el filete con la punta de un cuchillo afilado y introduzca las ramitas de romero en los agujeros. Sazonar bien con sal y pimienta negra recién molida.", "Calentar el aceite de oliva en una sartén a prueba de horno y dorar la carne por 2-3 minutos, o hasta que se dore. Agregue la mantequilla a la sartén, luego transfiera al horno para asar durante 10-12 minutos, o hasta que la carne de cerdo esté cocida. (Los jugos correrán claros cuando la carne de cerdo se perfora en la parte más gruesa con un pincho.) Retire de la sartén y deje reposar sobre un plato caliente.", "Para las papas, cocine las papas en una sartén de agua hirviendo durante 7-8 minutos, o hasta que estén tiernas, luego escurra y triture ligeramente, agregando la mantequilla y el cebollín. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa, coloque la crema en una olla pequeña y cocine a fuego lento durante 4-5 minutos, o hasta que se reduzca en aproximadamente un tercio en volumen, luego mezcle la mostaza y el jugo de limón.", "Para servir, cuchara las papas trituradas en un plato de servir. Corta con fuerza la carne de cerdo y coloca encima de las papas, luego coloca la salsa alrededor de los bordes del plato."]}, {"isVegetarian": true, "title": "Parfait Barmbrack con ciruelas de whisky", "url": "www_bbc_co_uk_food_recipes_barmbrack_parfait_with_87190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g / 13oz de fruta seca mixta", "250ml / 9fl oz de té frío", "50ml / 2fl oz de whisky irlandés", "botón de mantequilla, para engrasar", "Harina normal 225g / 8oz", "2 cucharaditas de polvo de hornear", "125g / 4½oz de azúcar moreno claro", "½ cucharadita de especias mixtas", "1 huevo grande de gallinas camperas", "2 cucharadas de azúcar en polvo de oro", "3 yemas de huevo medianas de campo abierto", "2 cucharadas de leche entera", "275ml / 9½fl oz de crema doble", "¼ vaina de vainilla, división y semillas retiradas", "85g / 3oz de chocolate blanco, roto en pedazos", "2 cucharadas de whisky irlandés o licor de crema irlandés", "1 naranja grande, ralladura fina y jugo", "175g / 6oz de azúcar en polvo", "115g / 4oz de ciruelas picadas", "4-6 cucharadas de whisky irlandés"], "serves": "6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el Barmbrack, ponga la fruta seca en un tazón y vierta sobre el té frío y el whisky. Cúbralo y déjelo en remojo durante la noche.", "Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Unte con mantequilla y alinee una lata de hogaza de 900 g / 2lb.", "Coloque la harina, el polvo de hornear, el azúcar y la mezcla de especias en un tazón. Haz un pozo en el medio y rompe el huevo. Mezcle bien con una cuchara de madera. Agregue un poco de líquido de la mezcla de frutas y revuelva. Continúe agregando líquido y revolviendo hasta que tenga una masa húmeda; es posible que no necesite todo el líquido. Escurrir la fruta seca y mezclarla en la masa hasta que esté bien combinada.", "Coloque la masa en la lata de pan preparada y nivele la parte superior. Hornee en el estante del medio del horno durante 1 hora, o hasta que el pincho insertado salga limpio. Deje que se enfríe un poco en la lata, luego colóquelo en una rejilla para que se enfríe por completo.", "Para el parfait, precaliente el horno a 200C / 180C Fan / Gas 6. Corte las costras del bambrack, luego desmenuce 175g / 6oz del barmbrack en una lata para asar. Espolvorea más de 1 cucharada de azúcar. Hornee durante 10 minutos, o hasta que estén crujientes, luego déjelo enfriar.", "Batir las yemas de huevo con la cucharada restante de azúcar.", "Ponga la leche, 85ml / 3 fl oz crema y la pieza de vaina de vainilla en una olla de fondo grueso y llevar a ebullición. Retire del fuego y vierta sobre la mezcla de yema, batiendo todo el tiempo. Regrese la sartén al fuego y cocine suavemente hasta que la natilla cubra la parte posterior de la cuchara, revolviendo.", "Cuele la crema en un recipiente a través de un colador fino. Deja enfriar.", "Derrita el chocolate en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua. Doble el chocolate derretido y las migajas en la crema pastelera, cubra y deje enfriar por 30 minutos.", "Batir la crema restante hasta que se formen picos suaves. Doble la crema y el whisky en la mezcla de natillas. Vierta en seis vasos transparentes de plástico, cúbralos y congélelos por 2-3 horas, o durante la noche si tiene tiempo.", "Para las ciruelas pasas, ponga a hervir 200 ml / 7 fl oz de agua en una olla mediana. Agregue la ralladura de naranja y el jugo y el azúcar y vuelva a hervir. Agregue las ciruelas, cubra y cocine a fuego lento durante 20 minutos, o hasta que se ablanden. Revuelva en el whisky. Dejar de lado para enfriar.", "Para servir, espolvoree la mezcla de ciruela en la parte superior de cada taza y ralle un poco de ralladura de naranja en la parte superior."]}, {"isVegetarian": true, "title": "Salsa Bearnaise", "url": "www_bbc_co_uk_food_recipes_barnaise_sauce_89217", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnaise_sauce_89217_16x9.jpg", "ingredients": ["300 g / 10½ onzas de mantequilla", "4 cucharadas de vinagre de vino blanco", "4 chalotes, picados", "3 cucharadas de estragón fresco picado, más 2 cucharadas de hojas enteras de estragón", "sal y pimienta negra recién molida", "4 yemas de huevo de gallinas camperas", "1 cucharadita de jugo de limón"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Aclare la mantequilla fundiéndola en una cacerola pequeña de base pesada a fuego lento. Cuando la mantequilla esté espumante, retire la sartén del fuego y déjela reposar durante unos minutos para que los sólidos blancos se hundan en el fondo de la sartén. Tamiza la mantequilla con un colador fino y descarta los sólidos.", "Vierta el vinagre en una olla no reactiva. Agregue los chalotes, el estragón picado y la sal, al gusto. Calentar suavemente a fuego medio hasta que el volumen del líquido se haya reducido en más de la mitad. Cuele y reserve hasta que se haya enfriado por completo.", "Batir ligeramente las yemas de huevo con una cucharadita de agua. Revuelva la mezcla de yema de huevo en el vinagre frío, luego agregue el jugo de limón.", "Vierta la mezcla en un recipiente suspendido sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Batir constantemente hasta que la salsa se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara y haya aumentado de volumen.", "Retire el recipiente del fuego y vierta lentamente la mantequilla clarificada en un flujo constante, batiendo continuamente, hasta que la mezcla esté espesa y suave. Dobla las hojas de estragón y condimenta, al gusto, con sal y pimienta negra recién molida."]}, {"isVegetarian": false, "title": "Barnsley chuletas con salsa Cumberland", "url": "www_bbc_co_uk_food_recipes_barnsley_chops_with_60141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnsley_chops_with_60141_16x9.jpg", "ingredients": ["2 cucharadas de tomillo fresco picado", "1 cucharada de romero fresco picado", "4 cucharadas de menta fresca picada", "1 cucharadita de sal marina", "pimienta negra recién molida", "4 x 375 g / 13oz de Barnsley chuletas", "2 cucharadas de aceite de girasol", "1 naranja, ralladura cortada en cerillas, en jugo", "1 pieza de tallo de jengibre, escurrida y cortada en tiras muy finas", "50ml / 2fl oz de puerto de rubí", "150g / 5fl oz de grosella roja", "½ limón, solo jugo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las chuletas, mezcle todas las hierbas con la sal y un montón de pimienta negra recién molida en un tazón. Coloque un cuarto de la mezcla de hierbas en un plato y frote en ambos lados de una de las chuletas. Repita con el resto de la mezcla de hierbas y las tres chuletas restantes hasta que todas estén cubiertas con las hierbas.", "Para la salsa Cumberland, ponga la ralladura de naranja en una olla pequeña, cubra con 250 ml / 10 fl oz de agua fría y deje hervir durante 8-10 minutos, luego escurra en un colador y déjelo a un lado.", "Traiga a fuego lento el jugo de naranja, el puerto, la mermelada de grosella y el jugo de limón en una olla pequeña. Cocine durante 8-10 minutos a fuego lento, o hasta que la jalea se disuelva.", "Agregue las tiras de naranja y jengibre y continúe hirviendo a fuego lento durante otros 2-3 minutos hasta que la salsa tenga un color ligeramente más oscuro y almibarado. Retire del fuego y deje reposar a temperatura ambiente. La salsa continuará espesándose a medida que se enfría. Sirve caliente o frío. (Si la salsa se espesa demasiado, agregue un poco de agua y vuelva a calentar suavemente antes de servir).", "Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite en una sartén grande de base pesada y fría las chuletas a fuego alto durante tres minutos por cada lado hasta que se doren pero no se cuezan bien.", "Coloque las chuletas sobre la grasa y cocine por 2-3 minutos más hasta que la grasa se dore y se rinda un poco. Transfiera las chuletas a una bandeja para hornear y cocine en el centro del horno por otros seis minutos por media y de 8 a 10 minutos por bien hecho. Retire del horno y deje reposar durante cinco minutos antes de servir.", "Coloque las chuletas en los platos calientes y espolvoree un poco de la salsa cálida de Cumberland. Adorne con hierbas frescas."]}, {"isVegetarian": true, "title": "Salsa de tomate básica", "url": "www_bbc_co_uk_food_recipes_basic_tomato_sauce_66556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de aceite de oliva virgen extra", "4 dientes de ajo, pelados, más o menos picados", "2 x 400g / 14oz latas de tomates picados", "gran puñado de albahaca fresca", "sal y pimienta negra recién molida", "200g / 7oz de pluma fresca"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa de tomate básica, caliente el aceite en una sartén a fuego medio, agregue el ajo y fría por 1-2 minutos, o hasta que se ablande.", "Agregue los tomates enlatados y la albahaca y deje que hierva, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 12-15 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Retire dos tercios de la salsa de tomate de la sartén y déjela a un lado para usarla en otra receta (puede congelarse durante hasta seis semanas).", "Cocine la pasta en una sartén con agua salada y hirviendo hasta que esté al dente, luego escurra bien y revuelva en la salsa. Calentar durante un minuto más y luego servir."]}, {"isVegetarian": true, "title": "Tortellini básico con ricotta y piñones", "url": "www_bbc_co_uk_food_recipes_basic_tortellini_with_38575", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basic_tortellini_with_38575_16x9.jpg", "ingredients": ["200g / 7oz '00' harina de pasta, más extra para quitar el polvo", "2 huevos de gallinas camperas, ligeramente golpeados", "12 hojas grandes de albahaca fresca, más 18-20 hojas pequeñas de albahaca, más extra para servir", "225 g / 8 oz de ricotta de leche de búfala (o ricotta de leche de vaca)", "60g / 2¼ oz de piñones tostados, para servir", "parmesano rallado (o un queso duro vegetariano similar), para servir", "50g / 1¾oz de hojas frescas de albahaca picadas", "10g / ¼ oz de piñones tostados", "25 g / 1 oz de queso parmesano, rallado", "1 diente de ajo, aplastado", "25ml / 1fl oz de aceite de oliva virgen extra", "50ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Rinde 20", "time": {"preparation": "1-2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mezcle la harina y los huevos en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado. Voltea la mezcla en una superficie de trabajo ligeramente enharinada y aplasta las migas en una bola de masa. Amasar la masa durante 4-5 minutos o hasta que quede suave y elástica. Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Para el pesto, moler la albahaca, los piñones, el parmesano y el ajo hasta obtener una pasta áspera en un almirez y mortero. Poco a poco vierta ambos aceites, revolviendo cuando los agregue. Sazonar, al gusto, con sal y pimienta negra recién molida. Apartar, cubrir, hasta que sea necesario.", "Para preparar la pasta, espolvoree los rodillos de una máquina de pasta con harina. Corte la pasta enfriada en tres pedazos y aplánelos a un grosor de aproximadamente 1 cm / ½ pulg.", "Coloque la máquina de pasta en su posición más amplia y pase una pieza de masa por la máquina, girando el mango con una mano y recogiendo la masa enrollada a medida que pasa por la máquina con la otra.", "Cambie la configuración de la máquina de pasta al siguiente ajuste más grueso, espolvoree los rodillos con un poco de harina, luego vuelva a alimentar la misma hoja de pasta a través de la máquina, como antes. Repita este proceso tres o cuatro veces más, enharinando la máquina y cambiando la configuración cada vez, hasta que llegue a la configuración penúltima. A medida que la hoja de pasta se hace más larga, córtela a la mitad para que el proceso de laminación sea más manejable.", "Repita el proceso de laminación con las dos piezas de masa restantes. Una vez que se ha extendido toda la masa, debe tener seis hojas largas de pasta.", "Para hacer los tortellini, coloque una hoja larga de la pasta sobre la superficie de trabajo con el lado más largo hacia usted. Coloque dos hojas grandes de albahaca en la mitad inferior de la pasta, luego doble la mitad superior sobre las hojas de albahaca. Establezca la máquina de pasta en su mejor configuración y vuelva a pasar la hoja por la máquina. Repite el proceso con las hojas restantes de pasta y las hojas grandes de albahaca.", "Corte las hojas de pasta en discos de 9 cm / 4 pulgadas con un cortador de galletas. Coloque una hoja pequeña de albahaca en el centro de cada una, y cubra con una cucharadita de ricotta.", "Uno por uno, cepille los bordes de cada disco de pasta con un poco de agua. Junta los bordes de cada disco para formar una forma semicircular, presionando los bordes junto con los dedos para sellar. Acerque los extremos puntiagudos de los tortellini entre sí alrededor de la yema del dedo para formar un anillo, luego presione las esquinas con la otra mano.", "Repita el proceso con los discos de pasta restantes, albahaca y ricotta; deberías terminar con 20 tortellini.", "Llevar a ebullición una sartén grande de agua salada. Con cuidado, baje los tortellini en agua hirviendo, en tandas, y cocine durante 3-4 minutos, o hasta que floten en la superficie del agua. Retire de la sartén con una espumadera y déjelo a un lado en un recipiente, manteniéndolo tibio. Cocine el tortellini restante.", "Agregue el pesto a los tortellini y mezcle suavemente hasta que esté cubierto. Espolvorea sobre los piñones.", "Para servir, coloca los tortellini y el pesto en platos para servir. Espolvoree un parmesano rallado sobre cada una y adorne con unas hojas pequeñas de albahaca."]}, {"isVegetarian": false, "title": "Cómo hacer caldo de carne", "url": "www_bbc_co_uk_food_recipes_basicbeefstock_90181", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbeefstock_90181_16x9.jpg", "ingredients": ["2-2.5kg / 4lb 6oz-5lb 8oz de huesos de ternera (costilla, huesos de médula de la pierna - puedes comprarlos de tu carnicero)", "3 cebollas, sin pelar", "1 ajo entero", "gran bouquet garni de perejil, salvia y tomillo", "2 puerros, cortados por la mitad", "2 zanahorias, cortadas por la mitad", "1 tallo de apio, incluidas las hojas, aproximadamente picadas", "2 tomates grandes, más o menos picados", "1 cucharadita de sal marina", "1 cucharada de granos de pimienta"], "serves": "Hace 2,5 litros / 4 pintas 8 fl oz", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 400F / Gas 6. Si su carnicero aún no lo ha hecho, corte los huesos en pedazos manejables con una cuchilla. Coloque los huesos en una lata grande para asar.", "Corta las cebollas por la mitad y agrégalas a la bandeja con los huesos. Corta el ajo por la mitad en el medio y agrégalo a la sartén. Vierta media pulgada de agua en la lata y tueste los huesos y las verduras en el horno durante 40-45 minutos, llenando el agua ocasionalmente, si es necesario.", "Mientras tanto, coloque una olla grande en el aro de cocina más grande. Llene con 4-5 litros / 7-9 litros de agua fría (aproximadamente dos tercios llenos) y lleve el agua hasta el punto de cocción lenta.", "Cuando el agua esté hirviendo a fuego lento y los huesos estén tostados, retire los huesos, las cebollas y el ajo del horno y agréguelos al agua, raspando los trozos dorados de la lata.", "Agregue el bouquet garni, puerros, zanahorias, apio, tomates, sal y pimienta en grano.", "Cocine a fuego lento el caldo, tapado, durante 4-6 horas, o incluso más si tiene tiempo, llenando con agua si es necesario. Seis horas le darán un buen stock fuerte para trabajar.", "Al final del tiempo de cocción, cuele la reserva de todos los ingredientes sólidos y deséchelos.", "Para reducir el caldo, vuelva a verter el caldo de líquido en la olla y suba el fuego a medio. Cocine hasta que el líquido se reduzca a la mitad, lo que tomará aproximadamente una hora, quizás más. Cuanto más se reduzca el stock, más fuerte y más intenso será. El stock se puede utilizar tal cual, o se puede reducir aún más o congelar para usar en el futuro."]}, {"isVegetarian": false, "title": "Glaseado básico de crema de mantequilla", "url": "www_bbc_co_uk_food_recipes_basicbuttericing_73263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbuttericing_73263_16x9.jpg", "ingredients": ["140g / 5oz de mantequilla, suavizada", "280g / 10oz de azúcar glasé", "1-2 cucharadas de leche", "algunas gotas colorante de alimentos"], "serves": "Hace suficiente hielo para 1 tarta mediana o 12 tortas de hadas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Batir la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave.", "Agregue el azúcar glas restante y una cucharada de leche y bata la mezcla hasta que quede cremosa y suave. Batir la leche, si es necesario, para aflojar la mezcla.", "Agregue el colorante de alimentos hasta que esté bien combinado."]}, {"isVegetarian": true, "title": "Mousse de chocolate de Raymond Blanc", "url": "www_bbc_co_uk_food_recipes_basicchocolatemousse_93648", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicchocolatemousse_93648_16x9.jpg", "ingredients": ["170g / 6oz de chocolate negro de buena calidad, mínimo de 60 por ciento de sólidos de cacao, toscamente picado (sin lácteos, si es necesario)", "7 claras de huevo de gallinas camperas (use clara de huevo pasteurizada en una caja de cartón si le preocupa el huevo crudo)", "¼ cucharadita de jugo de limón", "40 g / 1½ oz de azúcar en polvo"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Derrita el chocolate en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua).", "Batir las claras de huevo y el jugo de limón en un tazón grande y limpio hasta que formen picos suaves. El jugo de limón estabilizará las claras de huevo, las hará más fáciles de usar y ayudará a evitar el batido excesivo.", "Agregue el azúcar y continúe batiendo hasta que se formen picos firmes cuando se quite la batidora. No bata más allá de este escenario: las claras de huevo comenzarán a colapsar y se separarán en espuma seca y líquido goteando, y perderás todo el aire que hayas absorbido.", "Cuando el chocolate se haya derretido, retire el recipiente del fuego. Batir un tercio de las claras de huevo en el chocolate caliente rápida y vigorosamente, hasta que estén gruesas y bien combinadas: si agrega las claras de huevo demasiado lentamente, su temperatura fría puede hacer que el chocolate caliente se adhiera, se solidifique y produzca una mousse grumosa.", "Doble las claras de huevo restantes en la mezcla de chocolate, con una espátula, hasta que toda la clara de huevo se haya incorporado por completo en el chocolate. No mezcle en exceso en esta etapa ya que eliminará las burbujas de aire y la espuma será densa.", "Coloque la mezcla de mousse en cuatro vasos de Martini. Enfríe en la nevera durante 2-3 horas, o hasta que esté listo.", "Alternativamente, use la mousse para hacer una sopa de chocolate caliente. Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Divida la mousse entre cuatro tazones pequeños o recipientes para budín a prueba de horno. Coloque los tazones de pudin en el horno y hornee las mousses de chocolate durante 3-5 minutos, o hasta que se infle un poco y se caliente."]}, {"isVegetarian": true, "title": "Cómo cocinar el arroz chino pegajoso", "url": "www_bbc_co_uk_food_recipes_basicglutinousrice_89293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g / 11oz de arroz glutinoso lavado", "500ml / 18fl oz de agua"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén, agregue el arroz y el agua, cubra y cocine a fuego alto durante 15 minutos.", "Baje el fuego a fuego lento y cocine a fuego lento el arroz por 3-4 minutos más, asegurándose de que toda el agua haya sido absorbida y el arroz esté tierno.", "Quite el fuego y, con una espátula, esponje los granos de arroz. Servir."]}, {"isVegetarian": true, "title": "Muesli básico", "url": "www_bbc_co_uk_food_recipes_basicmuesli_67724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Avena de avena jumbo 200g / 7oz", "25g / 1oz de copos de salvado o germen de trigo", "75 g / 3 oz de copos de cebada o centeno (opcional, siempre puedes agregar más avena)", "Avellanas 50g / 2oz, ligeramente trituradas", "50g / 2oz de almendras en copos", "50g / 2oz sultanas", "50g / 2oz de albaricoques secos y listos para comer, toscamente picados", "50g / 2oz de higos secos, listos para comer, toscamente picados"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Coloque la avena, el salvado en copos o el germen de trigo, las hojuelas de cebada o de centeno, las avellanas y las almendras en una bandeja para hornear grande y tueste en el horno durante 10 minutos, sacudariendo y volteando la bandeja hasta la mitad. Saque la bandeja del horno y déjela enfriar: esto solo tomará unos 10 minutos.", "Mezcle los ingredientes tostados con las sultaninas, los albaricoques y los higos. Estas frutas son solo sugerencias: puedes usar lo que prefieras, por ejemplo, manzana seca, mango, papaya, dátiles o cerezas.", "Puede comer este muesli enseguida con leche o yogur, o puede guardarlo en un recipiente hermético."]}, {"isVegetarian": true, "title": "Arroz básico de jazmín", "url": "www_bbc_co_uk_food_recipes_basicjasminerice_89261", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g / 12oz de arroz jazmín, enjuagado hasta que el agua salga clara", "600ml / 1 pinta de agua hirviendo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el arroz en una cacerola de base pesada y agregue el agua hirviendo. Llevar a ebullición y luego cubrir con una tapa ajustada y reducir a fuego lento. Cocine a fuego lento durante 15-20 minutos, o hasta que toda el agua haya sido absorbida y el arroz esté tierno.", "Descubre la sartén y retírala del fuego. Pelusa los granos de arroz con un tenedor y servir inmediatamente."]}, {"isVegetarian": true, "title": "Panqueques básicos con azúcar y limón", "url": "www_bbc_co_uk_food_recipes_basicpancakeswithsuga_66226", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicpancakeswithsuga_66226_16x9.jpg", "ingredients": ["Harina normal 110 g / 4 oz, tamizada", "pizca de sal", "2 huevos", "200ml / 7fl oz de leche mezclada con 75ml / 3fl oz de agua", "50g / 2oz de mantequilla", "azúcar glas", "jugo de limon", "Rodajas de limón"], "serves": "Hace 12-14 panqueques pequeños", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Tamiza la harina y la sal en un tazón grande para mezclar con un colador en alto por encima del tazón para que la harina se ventile. Ahora haga un pozo en el centro de la harina y rompa los huevos en ella. Luego comience a batir los huevos (cualquier tipo de batidor o incluso un tenedor), incorporando cualquier trozo de harina del borde del tazón mientras lo hace.", "A continuación, agregue gradualmente pequeñas cantidades de la mezcla de leche y agua, aún batiendo (no se preocupe por los grumos, ya que eventualmente desaparecerán al batir). Cuando se haya agregado todo el líquido, use una espátula de goma para raspar cualquier trozo esquivo de harina de alrededor del borde hacia el centro, luego bata una vez más hasta que la masa esté suave, con la consistencia de crema fina. Ahora derrita los 50g / 2oz de mantequilla en una sartén. Coloque 2 cucharadas de la mezcla en la masa y empújela, luego vierta el resto en un recipiente y úsela para lubricar la sartén, utilizando un trozo de papel de cocina para untarlo antes de hacer cada panqueque.", "Ahora ponga la sartén bien caliente, baje la temperatura a medio y, para empezar, haga un panqueque de prueba para ver si está usando la cantidad correcta de la mezcla. Encuentro 2 cucharadas es más adecuado para una sartén de 18 cm / 7 pulgadas. También es útil si vierte la masa en un cucharón para que se pueda verter en la sartén caliente de una sola vez. Tan pronto como la masa golpee la bandeja caliente, voltéela de lado a lado para obtener la base uniformemente cubierta con la mezcla. Solo debería tomarse medio minuto para cocinar; puede levantar el borde con una espátula para ver si está teñida de oro como debería ser. Dale la vuelta al panqueque con una rebanada de pan o una espátula - el otro lado solo necesitará unos segundos - y luego simplemente deslízalo hacia afuera de la sartén en un plato.", "Apila los panqueques a medida que los haces entre las hojas de papel a prueba de grasa en un plato colocado sobre agua hirviendo, para mantenerlos calientes mientras haces el resto.", "Para servir, espolvoree cada panqueque con jugo de limón recién exprimido y azúcar impalpable, dóblelo por la mitad, luego por la mitad otra vez para formar triángulos, o simplemente enrollelos. Servir espolvoreado con un poco más de azúcar y jugo de limón y secciones extra de limón."]}, {"isVegetarian": true, "title": "Salsa básica de tomate y albahaca para pasta", "url": "www_bbc_co_uk_food_recipes_basictomatoandbasils_67840", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basictomatoandbasils_67840_16x9.jpg", "ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cebolla grande, picada", "2 dientes de ajo, aplastados", "3 latas de tomates de 400 g de tomates picados", "¼ - ½ cucharadita de copos de chile seco", "2 cucharaditas de vinagre balsámico", "2 cucharaditas de azúcar", "1 gran puñado de hojas de albahaca, desgarradas en trozos pequeños", "Sal y pimienta negra recién molida", "Parmesano rallado, para servir (opcional)"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una cacerola y cocine suavemente la cebolla y el ajo hasta que se ablanden. Agregue los tomates, los copos de chile, el vinagre balsámico y el azúcar. Deje que hierva a fuego lento y cocine lentamente durante 45 minutos-1 hora. Agregue la albahaca y sazone con sal y pimienta. Esto puede dejarse grueso o mezclarse en un procesador de alimentos para obtener una salsa suave.", "Servir una cucharada de pasta cocida con abundante queso parmesano."]}, {"isVegetarian": true, "title": "Salsa de tomate básica", "url": "www_bbc_co_uk_food_recipes_basictomatosauce_92186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Tomates maduros de 1 kg / 2¼ lb, tallos cortados, corte transversal en la parte inferior de cada uno con un cuchillo afilado", "100-150ml / 3½-5fl oz de aceite de oliva", "4 chalotes grandes, pelados, finamente picados", "ramita de tomillo fresco, solo hojas", "4 dientes de ajo, aplastados hasta formar una pasta con el filo de un cuchillo"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Poner a hervir una olla de agua. Baje los tomates en agua hirviendo y hiérvalos durante diez segundos, luego retírelos de la sartén con una espumadera e inmediatamente sumérjalos en un recipiente con agua helada.", "Cuando los tomates se hayan enfriado, pele y deseche las pieles. Pique los tomates y deseche las semillas. (Alternativamente, congele las semillas y úselas en caldos y salsas). Continúe cortando la pulpa del tomate.", "Caliente la mitad del aceite de oliva en una cacerola a fuego medio. Agregue los chalotes, las hojas de tomillo y el ajo y fría por 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el aceite de oliva restante y la pulpa de tomate picada, luego revuelva bien para combinar.", "Corte un disco de papel a prueba de grasa de 1 cm / ½ en un tamaño inferior al diámetro de su cacerola. Cubra la superficie de la salsa de tomate con el disco de papel resistente a las grasas (esto evitará que la salsa se seque, ya que se reduce y se cocina). Reduzca el fuego a su nivel más bajo y cocine suavemente durante al menos una hora, o hasta que la salsa se espese.", "Cuando la mezcla se haya cocinado y espesado, déjelo enfriar un poco. (NB: la salsa se puede dividir en porciones y congelar hasta que se necesite)."]}, {"isVegetarian": true, "title": "Rollos blancos básicos", "url": "www_bbc_co_uk_food_recipes_basicwhiterolls_89612", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicwhiterolls_89612_16x9.jpg", "ingredients": ["500g / 1lb 2oz de harina de pan orgánica blanca sin blanquear, más extra para espolvorear", "1 cucharadita de sal", "2 cucharaditas de levadura seca", "30 g / 1 oz de mantequilla o manteca de cerdo, ablandada", "75ml / 2½ fl oz de leche, calentada", "225ml / 8fl oz de agua tibia", "aceite, para engrasar", "harina de arroz, para quitar el polvo", "mantequilla, para servir"], "serves": "Rinde 8", "time": {"preparation": "más de 2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Con los dedos, mezcle la harina blanca, la sal y la levadura seca en un tazón.", "Frote la manteca o manteca blanda en la mezcla de harina hasta que la mezcla se asemeje a pan rallado.", "Mezcle la leche tibia con el agua.", "Agregue la mezcla de leche a la mezcla de harina y mezcle con las manos hasta que la masa esté bien combinada. Junta la masa en una bola.", "Con las manos enharinadas, amase la masa sobre una superficie de trabajo enharinada limpia durante 20-25 minutos, o hasta que la masa sea elástica y suave. Si es necesario, agregue un poco más de agua tibia para aflojar la masa.", "Regrese la masa al tazón y cúbrala con una toalla de té húmeda limpia o una película adhesiva. Deje de lado durante 1-1½ horas en un lugar cálido hasta que la masa se haya duplicado.", "Cuando la masa se haya levantado, devuélvala a una superficie de trabajo enharinada y retírela.", "Separe la mezcla en ocho partes y enrolle cada una en una bola. Aplane cada una ligeramente con la palma de su mano y transfiera los rollos a una bandeja para hornear, colocándolos juntos. Cubra la bandeja con película adhesiva y déjela a un lado durante otra hora, o hasta que los rollos hayan duplicado su tamaño nuevamente.", "Mientras tanto, precalentar el horno a 220C / 425F / Gas 7.", "Cuando los panecillos se hayan expandido, espolvoréelos con la harina de arroz y transfiéralos al horno. Hornee durante 8-10 minutos, o hasta que estén dorados y cocidos.", "Para servir, separe los panecillos y sirva caliente con mantequilla."]}]