[{"isVegetarian": false, "title": "Anatra con melagrana (pato con granada) y escarola salteada", "url": "www_bbc_co_uk_food_recipes_anatraconmelagranadu_84995", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 pechos de pato sin piel", "sal y pimienta negra recién molida", "harina común, para quitar el polvo", "40 g / 1½ oz de mantequilla", "4 cucharadas de aceite de oliva", "4 granadas", "1 escarola, limpiada y deja separada", "5 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar la pechuga de pato con sal y pimienta negra recién molida y polvo con harina, sacudiendo cualquier exceso.", "Caliente la mantequilla y el aceite de oliva en una sartén grande a prueba de horno hasta que la mantequilla comience a formar espuma. Agregue el pato y fría por dos minutos en cada lado, luego transfiéralo al horno para asar durante 5-6 minutos, o hasta que esté recién cocinado. El pato debe ser raro, pero cocina según tus preferencias.", "Mientras tanto, frote dos de las granadas enteras con firmeza sobre una superficie de trabajo con la palma de su mano, luego córtelas a la mitad y exprima el jugo, como lo haría con un limón, en todo el pato cocido.", "Abre las granadas restantes y quita las semillas. Espolvorea las semillas de granada sobre el pato.", "Coloque el pato en un plato y rocíe con los jugos y las semillas de la sartén. Deje que el pato descanse durante 2-3 minutos y luego corte la diagonal.", "Para la escarola, blanquee las hojas de la escarola durante un par de minutos en agua hirviendo con sal. Escurrir y apartar.", "Caliente el aceite de oliva en una sartén, agregue el ajo y fría por un minuto, o hasta que esté suave, luego agregue la escarola y saltee suavemente por 1-2 minutos. Reduzca el fuego, cubra con una tapa y cocine por 5-6 minutos, o hasta que la escarola esté tierna.", "Para servir, coloque la escarola en el plato al lado del pato y espolvoree los jugos restantes."]}, {"isVegetarian": false, "title": "Chuletas de cerdo con puré de apio nabo y salsa de manzana y cerveza inglesa", "url": "www_bbc_co_uk_food_recipes_amershamporkchopswit_80661", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amershamporkchopswit_80661_16x9.jpg", "ingredients": ["1 gran apio nabo", "150 g / 5 oz de mantequilla, más extra para la salsa", "sal y pimienta negra recién molida", "1 cebolla grande", "2 cucharadas de aceite de oliva virgen extra", "3 manzanas de Cox, peladas", "425 ml / ¾ lit London Pride ale (o similar)", "4 chuletas de cerdo", "2 cucharaditas de aceite vegetal", "½ cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "Hojas de cohete de 250 g / 9 oz"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Pele el apionabo, corte en trozos de 2.5cm / 1 pulgada y colóquelos en una fuente de agua fría. Coloque en la placa, deje hervir y cocine a fuego lento hasta que estén tiernos, aproximadamente 20 minutos. Mash el apio nabo con 100 g / 3½ oz de la mantequilla y sazone con sal y pimienta negra recién molida. Mantener cubierto y cálido.", "Mientras tanto, pele, corte a la mitad y corte finamente la cebolla longitudinalmente en semicírculos. Caliente el aceite de oliva en una sartén de fondo grueso y cocine las cebollas a fuego medio hasta que estén suaves y ligeramente coloreadas.", "Corta las manzanas en cuartos y corta los núcleos, luego córtelos nuevamente en octavos.", "Retire las cebollas de la sartén, agregue la mantequilla restante de 50 g / 1½ oz y coloque las manzanas. Cocine a fuego medio. Cuando estén dorados, dales la vuelta para que estén bellamente coloreados en ambos lados.", "Regrese las cebollas a la sartén con las manzanas, suba el fuego y agregue la cerveza a la sartén. Ajuste el condimento y continúe cocinando hasta que las manzanas comiencen a descomponerse un poco y el líquido se haya reducido al menos a la mitad y se haya espesado un poco.", "Con un cuchillo afilado, puntúa la piel de las chuletas y condúcelas. Esto ayudará a que la tajada quede crujiente cuando esté cocida.", "Caliente una sartén hasta que esté caliente. Frote las chuletas de cerdo con un poco de aceite vegetal (esto ayudará a evitar que se pegue) y coloque las chuletas en la plancha caliente. Cocine, volteando según sea necesario, hasta que la carne esté cocida (el tiempo de cocción dependerá del grosor de las chuletas; se cocinará cuando los jugos salgan claros cuando se perfore con un cuchillo afilado cerca del hueso).", "Para la ensalada, prepare la vinagreta. Coloque la mostaza, el vinagre y el aceite de oliva en un bol y bata. Sazone al gusto.", "Cuando las chuletas estén cocidas, retírela de la plancha y colóquela tapada en un plato en un lugar cálido durante cinco minutos. Mientras tanto, agregue un poco de mantequilla en la salsa para espesar un poco.", "Para servir, divida la mezcla entre cuatro platos, coloque un chuleta en cada masa de puré y vierta la salsa de mostaza y cerveza sobre ella. Vista el cohete con la vinagreta y sirva a un lado."]}, {"isVegetarian": false, "title": "Una auténtica salsa boloñesa", "url": "www_bbc_co_uk_food_recipes_anauthenticragubolog_66229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450 g / 1 libra de carne picada magra", "450 g / 1 lb de carne de cerdo picada", "6 cucharadas de aceite de oliva virgen extra", "1x225g / 8oz tina de hígado de pollo", "2 cebollas medianas, finamente picadas", "4 dientes de ajo gordos, picados", "2 paquetes de 70 g (o 140 g / 5 oz) de panceta o tocino rayado, finamente picado", "2 x 400 g / 14 oz latas de tomates picados italianos", "2 x 200 g / 7 oz tubos doble concentrado puré de tomate", "1 x 37.5 cl medio botella de vino tinto (o 400 ml / 14 fl oz)", "2 paquetes de 15 g o 30 g / 1 oz de albahaca fresca", "½ nuez moscada entera, rallada", "sal y pimienta negra recién molida"], "serves": "Rinde 8 porciones de 225 g / 8oz", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Primero tome una sartén grande, la más grande que tenga, caliente 3 cucharadas de aceite y fría la cebolla y el ajo a fuego medio durante unos 10 minutos, moviéndolo de vez en cuando.", "Mientras la cebolla se suaviza, picar la panceta: la mejor manera de hacerlo después de abrir el paquete es enrollar el contenido en forma de salchicha, luego, con un cuchillo afilado, cortarlo longitudinalmente en cuatro y luego cortar lo más fino posible . Después de 10 minutos, agregue esto a la sartén para unir las cebollas y el ajo y continúe cocinando todos durante otros 5 minutos.", "Ahora transfiere esta mezcla a la cazuela. Agregue otra cucharada de aceite a la sartén, suba el fuego a su punto más alto, luego agregue la carne picada y dore, rompiéndola y moviéndola en la sartén. Cuando la carne esté dorada, introdúcela en la cazuela. Calentar otra cucharada de aceite y hacer exactamente lo mismo con la carne de cerdo picada. Mientras el puerco se dora, corte los hígados de pollo, enjuáguelos con agua corriente fría, séquelos bien con papel de cocina y córtelos en trozos pequeños. Cuando el cerdo esté dorado, transfiéralo a la cazuela, luego caliente la cucharada restante de aceite y dore los trozos de hígado de pollo. Agregue estos a la cazuela.", "Ahora que terminaste con la sartén, deshazte de eso y coloca la cazuela sobre el fuego directo, revuelve todo bien, luego agrega el contenido de latas de tomate, puré de tomate, vino tinto y un buen condimento de sal, pimienta y nuez moscada.", "Permita que esto llegue al punto de hervor. Luego quita las hojas de la mitad de la albahaca, córtalas muy finamente y agrégalas a la olla. Tan pronto como todo hierva a fuego lento, coloque la cazuela en el estante central del horno y déjela cocinar lentamente, sin tapa, durante 4 horas. Es una buena idea echar un vistazo después de 3 horas para asegurarse de que todo esté bien, pero lo que debe terminar es una salsa espesa y concentrada con solo un rastro de líquido, luego retírela del horno, pruebe a revisa el condimento, quita las hojas de la albahaca restante, córtalas en trozos pequeños y revuélvelas.", "Luego, cuando la salsa esté completamente fría, divídala, utilizando balanzas, cuchareando 225 g / 8 oz en bolsas de polietileno congelador. Sellarlos dejando un poco de aire en la parte superior para dejar espacio para la expansión. Cada paquete de 225 g / 8 oz, completamente descongelado y recalentado, proporcionará suficiente ragú para pasta de 225 g / 8 oz, que servirá a 2 personas."]}, {"isVegetarian": false, "title": "Descenso de Anchoïade", "url": "www_bbc_co_uk_food_recipes_anchoiadedip_81089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filetes de anchoas de 60 g / 2½ oz, picados", "4 dientes de ajo, toscamente picados", "2 chalotes, toscamente picados", "1 cucharada de vinagre de vino tinto", "puñado de perejil, finamente picado", "150ml / 5fl oz de aceite de oliva virgen extra", "pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la anchoa, coloque todos los ingredientes, excepto el aceite de oliva y la pimienta negra en un procesador, y enciéndalos. Vierta el aceite en la licuadora en un flujo constante, hasta que se forme una salsa espesa.", "Verter en una sartén y calentar. Sazonar con pimienta negra recién molida y servir inmediatamente."]}, {"isVegetarian": false, "title": "Anchoïade con crudites", "url": "www_bbc_co_uk_food_recipes_anchoiadewithcrudite_83883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml / 2fl oz de aceite de oliva virgen extra", "4 dientes de ajo, toscamente picados", "2 chalotes, toscamente picados", "110ml / 4fl oz de vino blanco", "Filetes de anchoa blancos de 60 g / 2½ oz, picados", "1 yema de huevo de gallinas camperas", "Crema doble 110ml / 4fl oz", "pimienta negra recién molida", "selección de verduras crudas lavadas: apio, zanahorias, pepinos, rábanos, tiras de hinojo, tiras de pimientos, tomates cherry en barritas, etc."], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén hasta que esté caliente, luego agregue el aceite de oliva, el ajo y los chalotes. Cocine por 1-2 minutos, para ablandar pero no dorar.", "Agregue las anchoas y el vino y cocine durante 1-2 minutos más, hasta que el vino se reduzca a la mitad y las anchoas comiencen a descomponerse.", "Transfiera la mezcla de anchoa a un procesador de alimentos, agregue la yema de huevo y la crema y mezcle hasta obtener una pasta.", "Sazonar con pimienta negra (las anchoas deben hacer que el plato esté lo suficientemente salado) y verter en un tazón para servir.", "Servir inmediatamente con una selección de vegetales crudos lavados para mojar."]}, {"isVegetarian": false, "title": "Buñuelos de camarón y cebolla de primavera andaluces", "url": "www_bbc_co_uk_food_recipes_andalucian_shrimp_and_67313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 dientes de ajo sin pelar", "½ cucharadita de sal", "1 yema de huevo de gallinas camperas", "175ml / 6fl oz de aceite de oliva virgen extra", "Harina normal 175g / 6oz", "½ cucharadita de polvo de hornear", "1 cucharada de vino blanco seco", "175g / 6oz de gambas crudas, cortadas en trozos pequeños", "2 cebollas de primavera, en rodajas finas", "1 cucharada de perejil de flatleaf fresco picado", "aceite de oliva, para freír"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el alioli, coloque los dientes de ajo en una tabla de cortar y aplastelos debajo de la cuchilla o un cuchillo grande.", "Retire las pieles de papel, espolvoree el ajo con la sal y trabaje en una pasta suave utilizando la cuchilla.", "Raspe la pasta de ajo en un recipiente y agregue la yema de huevo.", "Batir juntos, luego batir muy gradualmente en el aceite de oliva para hacer una mezcla espesa de mayonesa.", "Para los buñuelos, tamice la harina, el polvo de hornear y una pizca de sal en un tazón. Haga un pozo en el centro y agregue 300 ml / 10 fl oz de agua y el vino.", "Poco a poco mezcle los ingredientes secos en el líquido para hacer una mezcla, luego mezcle hasta que tenga una crema espesa. Doble las gambas, las cebolletas y el perejil.", "Vierta ½ cm / ¼ pulgada de aceite de oliva en una sartén grande y colóquelo a fuego alto. Déjelo hasta que esté caliente pero no humeando, o hasta que una gota de la mezcla chisporrotee inmediatamente. (PRECAUCIÓN: el aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Con cuidado, vierta cucharadas grandes de la mezcla en la sartén y extienda cada una un poco con la parte posterior de la cuchara para que desarrollen unos bordes delgados y crujientes mientras cocinan. No se sienta tentado a saturar la sartén, solo cocine de 2 a 3 a la vez.", "Cocine, volteando los buñuelos de vez en cuando, durante aproximadamente dos minutos o hasta que se hinche y dorado por ambos lados.", "Retire con una espumadera y escurra sobre una bandeja llena de papel de cocina. Come de inmediato mientras aún estén calientes y crujientes."]}, {"isVegetarian": false, "title": "Cerdo andaluz con albaricoques, ciruelas pasas y hierbas, enrollado en pimentón", "url": "www_bbc_co_uk_food_recipes_andalucianporkwithap_72080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 filete de cerdo mediano a grande", "50 g / 1¾oz de ciruelas pasas, picadas", "50 g / 1¾oz de albaricoques secos suaves, picados", "10g / ½ oz de perejil picado", "2 cucharadas de pimentón", "1 cucharadita de orégano seco", "1 cucharadita de tomillo seco", "1 diente de ajo, aplastado", "1 cucharada de sal gruesa", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 limón, cortado en cuñas, para servir"], "serves": "Porciones 2", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Corta la carne de cerdo con un cuchillo afilado y abre el filete a lo largo, teniendo cuidado de no cortar todo el filete.", "En un tazón, mezcle las ciruelas pasas, los albaricoques y el perejil e inserte a lo largo del filete. Sazonar bien", "Enrolle el filete y asegúrelo con una cuerda.", "Mezcle el pimentón, las hierbas restantes, el ajo, la sal y el aceite para hacer una pasta espesa. Extienda sobre la superficie de la carne y déjela en la nevera, idealmente durante la noche.", "Precalentar el horno a 200C / 400C / Gas 6. Sazonar la carne y dorar por todos lados en una sartén pesada. Coloque en el horno por quince minutos.", "Descanse la carne antes de servir con rodajas de limón."]}, {"isVegetarian": false, "title": "feijoada", "url": "www_bbc_co_uk_food_recipes_andre_and_andersons_49427", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/andre_and_andersons_49427_16x9.jpg", "ingredients": ["1kg / 2lb 4oz de frijoles negros secos", "4 cucharadas de aceite de oliva", "500 g / 1 lb 2 oz costillas de cerdo ahumado en seco, con guarnición de grasa, cortado en costillas individuales", "1kg / 2lb 4oz costillas de cerdo sin ahumar, con guarnición de grasa, cortadas en costillas individuales", "1 cebolla grande, más o menos picada", "1 cabeza de ajo, clavo de olor finamente picado", "Tocino ahumado de 500 g / 1 lb 2 oz cortado en trozos medianos", "Vientre de cerdo de 500 g / 1 lb 2 oz, cortado en trozos de tamaño mediano", "200g / 7oz de salchicha de cerdo ahumada, cortada en trozos de tamaño mediano", "sal y pimienta negra recién molida", "2 cucharadas de hojuelas de chile seco (opcional)"], "serves": "Sirve 6-8", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Remoje los frijoles negros en 2 litros / 3½ litros de agua fría durante la noche.", "Cuando los frijoles se hayan empapado, caliente la mitad del aceite en una sartén con tapa (lo suficientemente grande como para que quepan todas las costillas a la vez) a fuego medio.", "Sazone las costillas de cerdo ahumado y no ahumado con sal y pimienta negra recién molida. Freír las costillas durante 4-5 minutos en cada lado, o hasta que se doren por ambos lados.", "Agregue la cebolla y el ajo y continúe freír durante 2-3 minutos más, revolviendo bien, hasta que se ablanden.", "Agregue 250ml / 9fl de onza de agua y hágalo hervir a fuego lento, luego cubra la sartén con la tapa y cocine por 18-20 minutos, llenando la sartén con agua si es necesario si el líquido se evapora demasiado rápido. Transfiera el contenido de la bandeja a una cazuela grande y déjelo a un lado.", "Limpie la sartén con papel de cocina, luego caliente el aceite restante a fuego medio. Freír el tocino, la panceta y la salchicha, en tandas, hasta que se doren por todas partes (no sobrecargue la sartén). Transfiera la carne dorada a la cazuela.", "Agregue los frijoles negros empapados y el líquido de remojo a la cazuela y mezcle bien. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento, medio cubierto, durante aproximadamente 2 horas y media, llenando la cazuela con agua cada cierto tiempo para evitar que se seque. La feijoada está lista cuando las costillas están tiernas y la carne casi se cae del hueso.", "Justo antes de servir, sazone la feijoada con sal y pimienta negra recién molida, si es necesario, y con copos de helado, si lo desea."]}, {"isVegetarian": true, "title": "Una manera extraordinaria con la lechuga", "url": "www_bbc_co_uk_food_recipes_anextraordinarywaywi_92374", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 rebanada grande de mantequilla", "1 manojo de cebollas de primavera, cortado en longitudes de 2.5cm / 1in", "1 puñado de habas, fuera de sus vainas", "3 cabezas de lechuga Baby Gem, cortadas y cortadas por la mitad", "caldo de verduras, suficiente para cubrir casi la lechuga", "1-2 puñados de guisantes frescos, fuera de sus vainas", "algunas ramitas de menta fresca, solo hojas"], "serves": "Sirve 2-3", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar la mantequilla en una sartén grande y poco profunda hasta que la mantequilla esté espumosa, luego agregar las cebolletas y cocinar por unos minutos.", "Mientras tanto, cocine las habas en una olla de agua hirviendo durante 2 o 3 minutos, o hasta que estén lo suficientemente tiernas como para desprender las pieles, si así lo desea.", "Coloque las lechugas Baby Gem cortadas a la mitad hacia abajo en la parte superior de las cebolletas y agregue el caldo de verduras a la lechuga, suficiente para cubrir casi. Esparce sobre las habas escurridas (prefiero las mías desolladas; son un poco más brillantes y suaves de esa manera, pero la piel también está bien). Agregue los guisantes, sazone ligeramente con sal y pimienta negra recién molida y cocine a fuego lento durante unos minutos.", "Termine con algunas hojas de menta y sirva una vez que las verduras estén tiernas. Este plato es adorable por sí mismo, pero es igualmente delicioso emparejado con jamón inglés pasado de moda."]}, {"isVegetarian": false, "title": "Patatas crujientes de anchoa y salvia", "url": "www_bbc_co_uk_food_recipes_anchovy_and_sage_crisps_70251", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40 hojas grandes de salvia, todas de tamaño similar", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz de harina natural", "75g / 2½oz de pan rallado blanco muy fino o polenta", "10 filetes de anchoa, escurridos", "aceite vegetal, para freír"], "serves": "Rinde 20", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Limpie las hojas de salvia y séquelas con papel de cocina absorbente.", "Tome tres platos hondos o platos poco profundos y vierta el huevo batido en uno, la harina en otro y el pan rallado o la polenta en el tercero.", "Coloque 20 hojas sabias planas y coloque la mitad de una anchoa en el centro de cada una. Coloque las 20 hojas de salvia restantes sobre las anchoas y presione hacia abajo para emparedarlas.", "Cubra individualmente cada sándwich de salvia y anchoa con la harina, luego sumerja el huevo batido y finalmente cubra con el pan rallado o la polenta.", "Calentar el aceite en una sartén grande. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cocine las patatas fritas sabias por lotes hasta que estén doradas y crujientes. Drene en la cocina absorbente.", "Sirve mientras aún está caliente."]}, {"isVegetarian": true, "title": "Pastel de ángel con cuajada de limón", "url": "www_bbc_co_uk_food_recipes_angel_food_cake_with_04002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angel_food_cake_with_04002_16x9.jpg", "ingredients": ["125g / 4½oz de harina natural", "300 g / 10½ oz de azúcar en polvo", "10 claras de huevo grandes de gallinas camperas", "2 limones grandes, ralladura rallada solamente", "1 cucharada de jugo de limón", "1 cucharadita de crema de tártaro", "½ cucharadita de sal", "10 yemas de huevo grandes de gallinas camperas", "400 g / 14 oz de azúcar en polvo", "4 limones grandes, solo jugo (aproximadamente 200 ml / 7 fl oz)", "2 limones grandes, ralladura rallada solamente", "175g / 6oz de mantequilla sin sal, en cubos", "2 fruta de la pasión", "300 ml / 10 fl oz crema batida", "½ cucharadita de extracto de vainilla"], "serves": "Sirve de 12 a 15, y hace dos tarros de 350g / 12oz de cuajada de limón", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador 160 ° C) y coloque un estante en el tercio inferior del horno. Tamice la harina y 100 g / 3½ oz del azúcar impalpable en un tazón y déjelo a un lado.", "Batir las claras de huevo en un tazón grande con un batidor de mano eléctrico o una batidora a alta velocidad durante un minuto hasta que estén espumosas. Agregue la ralladura de limón, el jugo de limón, la crema de tártaro y la sal y continúe batiendo durante 2-3 minutos, o hasta que se formen picos suaves cuando se quita la batidora del bol. Aumente la velocidad y agregue los 200 g / 7 oz restantes de azúcar en polvo, una cucharada a la vez para formar picos firmes, pero no rígidos.", "Espolvorea más de un tercio de la mezcla de harina y dobla suavemente para combinar. Repita con los dos tercios restantes de la mezcla de harina doblando suavemente para mantener la mayor cantidad posible de aire en la mezcla.", "Transfiera la mezcla a un molde para pastel de ángel de 25cm / 10in. Pase suavemente un cuchillo por el centro de la masa para eliminar cualquier bolsa de aire. Cocine durante 45-50 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Retire del horno e inmediatamente revuelva sobre las patas de enfriamiento de la lata, o coloque sobre el cuello de una botella de vino. Deje que se enfríe durante al menos una hora.", "Pase un cuchillo por los bordes interno y externo de la torta para sacarla de la sartén. Invierta en un plato. Use con cuidado una espátula para separar la torta de la base de la sartén. Dejar enfriar sobre una rejilla.", "Para la cuajada de limón, mezcle las yemas de huevo, el azúcar, el jugo de limón y la ralladura de limón en una sartén grande. Cocine a fuego lento, revolviendo con una cuchara de madera, asegurándose de remover los lados y la base de la sartén. Cocine durante 5-7 minutos, o hasta que la mezcla cubra la parte posterior de una cuchara. Retire del fuego y agregue la mantequilla. Pasar a través de un tamiz en una jarra grande. Llene dos jarras de vidrio de 350g / 12oz con la cuajada de limón y selle con tapas. Cubra la cuajada restante con film transparente y deje enfriar.", "Para el relleno, bata la crema y el extracto de vainilla en un bol hasta que se formen picos suaves cuando se quite el batidor. Con una cuchara, cubra el pastel de ángel y, con un cuchillo de colores, cubra la parte superior y los lados del pastel, alisándolo sobre la marcha.", "Corta la fruta de la pasión por la mitad y saca las semillas. Mezcle la fruta de la pasión en la cuajada de limón reservada y fría y rocíe sobre la torta de ángel antes de servir. Es posible que desee utilizar solo una de las jarras de crema de limón para servir con la torta y guardar la otra para comer por separado."]}, {"isVegetarian": false, "title": "Pollo en salsa de vino blanco", "url": "www_bbc_co_uk_food_recipes_angelaschickeninwhit_85878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angelaschickeninwhit_85878_16x9.jpg", "ingredients": ["4 pechugas de pollo sin piel", "1 cebolla, más o menos picada", "1 zanahoria, más o menos picada", "1 apio en barra, aproximadamente picado", "1 hoja de laurel", "6 granos de pimienta negra", "30g / 1oz de mantequilla", "Harina de 30g / 1oz", "150ml / ¼ de pinta de vino blanco", "1 yema de huevo de gallinas camperas", "2-3 cucharadas de crema doble", "sal y pimienta negra recién molida", "exprimir jugo de limón", "2 cucharadas de perejil fresco picado", "puré de papa, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las pechugas de pollo en una sartén grande. Agregue las verduras, la hoja de laurel y los granos de pimienta y cubra con agua.", "Coloque la sartén a fuego lento y deje que hierva lentamente, luego cocine a fuego lento durante 30 minutos o hasta que el pollo esté completamente cocido.", "Retire el pollo con una cuchara ranurada, colóquelo en un plato y manténgalo caliente.", "Cuele el líquido de cocción en un bol, reservando 450 ml / ¾ de pinta.", "Derrita la mantequilla en una sartén limpia a fuego medio. Agregue la harina y revuelva bien para hacer un roux. Agregue lentamente el caldo de pollo reservado al roux, revolviendo constantemente, para hacer una salsa espesa.", "Agregue el vino blanco y deje que hierva.", "Coloque la yema de huevo y la crema en un tazón limpio y mezcle ligeramente. Poco a poco agregue la mezcla de huevo a la salsa, revolviendo bien.", "Agregue las pechugas de pollo a la salsa. Retirar del fuego, sazonar, al gusto, con sal y pimienta negra recién molida y agregar un chorrito de jugo de limón.", "Para servir, espolvoree el puré de patatas en los platos para servir, cubra con una pechuga de pollo, vierta un poco de salsa y adorne con perejil picado."]}, {"isVegetarian": false, "title": "Paletilla de cordero cocida a fuego lento con la tentación de Jansson y cimas de brotes salteados", "url": "www_bbc_co_uk_food_recipes_anchovy_and_rosemary_77076", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 hombro de cordero", "6 filetes de anchoa", "2 ramitas de romero, rotas en trozos pequeños", "1 cabeza de ajo, pelada y picada", "400 ml / 14fl oz de salsa, para servir", "1kg / 2lb 4oz de papas, cortadas en cerillas", "Anchoas suecas 150g / 5½oz picadas", "1 cebolla, en rodajas", "Crema doble 500ml / 18fl oz", "75g / 2½oz de mantequilla sin sal", "50g / 1¾oz de pan blanco fresco", "sal y pimienta negra recién molida", "2 puñados brotan hojas o brotes de bebé, quebrados en hojas", "75g / 2½oz de mantequilla sin sal"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el cordero, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Pierce el cordero por todas partes con un cuchillo afilado y rellena las anchoas, el ajo y el romero en los agujeros. Coloque en una bandeja grande para asar y cocine por 3-4 horas.", "Para hacer la tentación de Jansson, encienda el horno a 200C / 180C Fan / Gas 6. Extienda un tercio de las papas en una fuente para hornear a prueba de horno y cubra con la mitad de las anchoas y la mitad de la cebolla, repita nuevamente y termine con una capa de papas Sazone con sal y pimienta, salpique la mantequilla sobre la superficie y vierta la crema. Espolvorear con las migas de pan y hornear durante 1 hora y media, hasta que estén doradas y cocidas.", "Para hacer las copas de brotes, caliente la mantequilla en una sartén grande y saltee los brotes a fuego alto hasta que estén cocidos.", "Para servir, corte el cordero y sirva en platos junto con la tentación de Jansson y los brotes. Rocíe con salsa."]}, {"isVegetarian": false, "title": "Cerdo de jengibre asado lento de Angela", "url": "www_bbc_co_uk_food_recipes_angelasslowroastedgi_71381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 hombro de cerdo que pesa aproximadamente 4kg / 8lb 2oz piel anotada", "4 dientes de ajo, pelados y toscamente picados", "Jengibre fresco de la raíz de 4cm / 1½inch, pelado y bruscamente cortado", "3 cucharadas de aceite de oliva", "4 cucharadas de vinagre de vino blanco"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas mark 7.", "Coloque el cerdo con la piel hacia arriba sobre una rejilla sobre una lata de asar. Coloque el ajo y el jengibre en una maja y mortero o procesador de alimentos y machaque o procese hasta que obtenga una pasta áspera y luego mezcle el aceite y el vinagre. Frote la pasta en toda la piel del cerdo. Coloque en el horno precalentado y cocine por 30 minutos.", "Retire la carne de cerdo del horno, reduzca la temperatura a 150 ° C / 300 ° F / Gas 2. Voltee la carne de cerdo con el lado de la piel hacia abajo en la parrilla y vuelva al horno y cocínela durante 4-5 horas.", "Saque del horno y enciéndalo hasta alcanzar el nivel más alto 220C / 425F / Gas 7. Coloque la carne de puerco en el lado crepitante de la parrilla y tueste en el horno caliente durante los últimos 20 minutos para que el crujiente se cocine. Deje reposar de 10 a 15 minutos antes de tallar.", "Para servir, corte el crujiente con un cuchillo afilado y divídalo en pedazos, luego esculpe la carne. Debería ser muy tierno y suculento."]}, {"isVegetarian": false, "title": "Glögg de Annika (vino caliente de Annika)", "url": "www_bbc_co_uk_food_recipes_annikas_glgg_annikas_32356", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/annikas_glgg_annikas_32356_16x9.jpg", "ingredients": ["1 botella de vino tinto (la calidad no importa)", "1-2 palitos de canela", "5g de raíz seca de jengibre", "5 g de cáscara de naranja seca de Sevilla (u otra naranja si no puedes llegar a Sevilla)", "7 vainas de cardamomo verde", "15-16 dientes enteros", "Azúcar 80 g / 3 oz", "almendras fileteadas", "Pasas", "salpicaduras de vodka, aquavit, ron o coñac (opcional)"], "serves": "Hace 1 botella", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Vierta el vino en una sartén, agregue el resto de los ingredientes y caliente a alrededor de 80 ° C / 176 ° F, revolviendo para disolver el azúcar.", "Retirar del fuego y dejar en infusión durante al menos una hora.", "Cuela la mezcla y devuelve el vino caliente a la botella: utiliza un embudo para hacerte la vida más fácil. El vino se puede guardar por alrededor de una semana.", "Para servir, vierta el vino en una cacerola y caliéntelo.", "Coloque unas almendras y pasas en copos en el fondo de las tazas para servir, y vierta el glögg sobre la mezcla.", "Si desea darle una patada a su glögg, agregue un toque de vodka, aquavit, ron o coñac justo después de haber recalentado el vino."]}, {"isVegetarian": false, "title": "Anolini en brodo (pasta rellena de carne en caldo de pollo)", "url": "www_bbc_co_uk_food_recipes_anolini_in_brodo_meat_26930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucharadas de aceite de oliva", "Solomillo de buey de 500 g / 1 lb 2 oz", "Filete de grupa de ternera de 200g / 7oz", "1 cebolla, más o menos picada", "2 zanahorias, aproximadamente picadas", "2 palitos de apio, más o menos picados", "2 cucharadas de puré de tomate", "2 hojas de laurel", "300ml / 10fl oz de vino tinto", "500ml / 18fl oz de caldo de pollo", "100g / 3¾oz de migajas de pan blanco fresco", "250 g / 9 oz de queso parmesano, finamente rallado", "1 x 1.5-2kg / 3lb 5oz-4lb 8oz de pollo entero, preferiblemente orgánico", "500 g / 1 libra 2 oz espinilla de carne", "1 zanahoria, más o menos picada", "1 cebolla, más o menos picada", "1 barra de apio, más o menos picada", "1 diente de ajo, picado", "Harina 400g / 14oz '00', más extra para quitar el polvo", "4 huevos de gallinas camperas, golpeados", "pizca de sal"], "serves": "Sirve 6-8", "time": {"preparation": "1-2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para el anolini, caliente el aceite en una cazuela con tapa grande. Agregue el solomillo de ternera y la ternera y selle todo. Retire de la sartén y descanse en un plato.", "Cocine la cebolla, las zanahorias y el apio en la cazuela durante 5-8 minutos. Agregue el puré de tomate y cocine durante 1-2 minutos.", "Vuelve a colocar la carne en la sartén. Agregue la hoja de laurel y el vino y cocine hasta que se reduzca a la mitad. Agregue el caldo, ponga la tapa y cocínelo durante 3-4 horas.", "Retire la carne cocida y tritúrela. Retire las verduras y aplastelas en un bol con un poco de licor de cocina. Sazone al gusto. Mezcle la carne, las migas de pan y casi todo el queso parmesano, manteniendo algunos para servir. Agregue más migas de pan si las necesita para hacer una mezcla firme.", "Para el caldo, coloca el pollo, la espinilla, la zanahoria, la cebolla, el apio y el ajo en una olla grande y agrega suficiente agua para cubrir. Llevar a ebullición, cubrir con una tapa y cocine a fuego lento durante 2 horas. Cuele el licor, manteniendo el caldo y descartando las verduras. Reserve el pollo y la carne para otra comida o su segundo plato.", "Para hacer la pasta, en un procesador de alimentos, mezcle la harina, los huevos y la sal. Si la mezcla está demasiado seca, agregue un poco de agua. Espolvorea una superficie de trabajo con un poco de harina y amasa la mezcla hasta que forme una masa. Envuelva con film transparente y descanse en la nevera durante 30 minutos.", "Espolvoree la pasta con un poco de harina, luego extiéndala con una máquina de pasta hasta que tenga aproximadamente 2 mm de grosor (alrededor de la configuración número cinco en la máquina de pasta). Alternativamente, despliegue la masa con un rodillo.", "Coloque una hoja de pasta en una superficie de trabajo enharinada y coloque una cucharadita de la mezcla de carne a lo largo de la pasta dejando un espacio de 2 cm en cada pila. Coloque otra hoja de pasta encima, saque el aire y corte en paquetes. Cocine la pasta en una olla grande de agua hirviendo con sal durante 1-2 minutos.", "Para servir, recaliente el caldo de pollo. Divida las parcelas entre los tazones de servir, haga un cucharón sobre el caldo y espolvoree sobre el parmesano restante."]}, {"isVegetarian": true, "title": "Galletas fáciles", "url": "www_bbc_co_uk_food_recipes_anytimecookies_92185", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anytimecookies_92185_16x9.jpg", "ingredients": ["250g / 9oz de mantequilla sin sal ablandada", "Azúcar granulada de oro 150g / 5oz", "2-3 gotas de extracto de vainilla", "1 huevo de gallinas camperas, golpeado", "Harina normal de 220g / ½lb", "1 cucharadita de polvo de hornear", "pizca de sal", "1-2 puñados de chips de chocolate (opcional)", "1-2 puñados de frutos secos (como maní, nueces de macadamia o nueces de Brasil) (opcional)", "1-2 puñados de jengibre cristalizado"], "serves": "Hace 30", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["En un tazón grande, bata la mantequilla y el azúcar hasta que estén pálidos, esponjosos y bien combinados.", "Batir el extracto de vainilla y el huevo batido, poco a poco, hasta que estén bien combinados.", "Tamice la harina, el polvo de hornear y la sal en el tazón y mezcle bien hasta que quede suave y combinado.", "Coloque una hoja grande de película adhesiva (aproximadamente 30 cm / 12 pulgadas cuadradas) sobre una superficie de trabajo y vierta la masa de galletas en el centro de la misma.", "Coloque el borde más alejado de la película adherida sobre la masa para galletas y hacia usted, luego use el lado de una espátula para presionar la masa contra la longitud de la película adhesiva. Envuelva la película adhesiva alrededor de la masa para formar una forma de salchicha de 7-8 cm / 3-4 pulgadas de ancho. Gire los extremos para asegurarlos y enfríelos en la nevera durante una hora, o hasta que estén firmes. (NB: en esta etapa, la masa para galletas se puede congelar hasta que se necesite).", "Precalentar el horno a 200C / 180 Fan / Gas 6.", "Cuando la masa de las galletas esté firme, corte 1cm / ½ en rodajas y colóquelas en una bandeja para hornear con espacio suficiente alrededor de cada una para permitir que la mezcla se extienda.", "Las galletas se pueden cocinar tal como están. Alternativamente, espolvorea sobre los ingredientes que prefieras, como las chispas de chocolate, las nueces o el jengibre cristalizado antes de cocinarlos.", "Transfiera las galletas al horno y hornee durante 8-10 minutos, o hasta que los bordes estén dorados claros.", "Coloque las cookies a un lado por 1-2 minutos, luego transfiéralas a una rejilla para que se enfríen."]}, {"isVegetarian": true, "title": "Pasado aperitivo", "url": "www_bbc_co_uk_food_recipes_aperitivodipassata_70570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 m / 10 fl oz de salsa de paso", "2 limas", "¼ nuez moscada, rallado", "3 pizcas de azúcar", "1 pizca de sal", "1 pizca de chile en polvo"], "serves": "4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la passata, el jugo de lima, la nuez moscada, la sal y el chile en polvo en un tazón grande y mezcle bien.", "Coloca en la nevera.", "Toma un vaso frío y humedece un poco el borde. Sumérgete en el azúcar.", "Vierta la mezcla en el vaso y decore con una rodaja de limón. Servir frío."]}, {"isVegetarian": false, "title": "El puchero \\\"principal\\\" de Antony", "url": "www_bbc_co_uk_food_recipes_antonysmainstaymince_73336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Tocino rayado de 225 g / 8oz, cortado en cubitos", "175-200ml / 6-7fl oz buen aceite de oliva", "2 cebollas, finamente cortadas en cubitos", "2 palitos de apio, pelados y finamente cortados en cubitos", "2 zanahorias, peladas y finamente cortadas", "5 dientes de ajo, pelados y triturados con un poco de sal", "2 cucharaditas de hojas frescas de tomillo", "2 hojas de laurel", "2 cucharaditas de orégano seco", "2 x 400 g / 14 onzas de latas de tomates picados", "2 cucharadas de puré de tomate", "1 cucharada de esencia de anchoa", "2 cucharadas de salsa Worcestershire", "1,8 kg / 4 lb de carne picada", "Hígados de pollo frescos de 250 g / 9 oz, finamente picados", "2 botellas de vino tinto seco", "1,7 litros / 3 pintas de caldo de pollo, res o cordero", "sal y pimienta negra recién molida"], "serves": "Hace 2kg", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["En una cacerola grande de base pesada, fría el tocino en dos cucharadas de aceite de oliva. Cuando el tocino esté crujiente y haya liberado algunas grasas naturales, agregue las cebollas, el apio, las zanahorias, el ajo, el tomillo, las hojas de laurel y el orégano y cocine a fuego medio hasta que las verduras se ablanden y tome un poco de color. Agregue los tomates en lata, puré de tomate, esencia de anchoa y salsa Worcestershire. Revuelve para combinar.", "Mientras tanto, en una sartén grande, caliente un poco de aceite de oliva y fría la carne en pequeños lotes hasta que se dore. Mientras la carne se está friendo, rompa los grumos con la parte posterior de una cuchara de madera. Retire la carne cocida de la sartén y repita, usando más aceite cada vez que sea necesario, hasta que toda la carne esté agotada. Después de cada lote, agregue la carne a la mezcla de salsa.", "En la misma sartén, fríe los hígados de pollo hasta que estén dorados y crujientes (en un poco más de aceite de oliva) y agrega los hígados a la carne. Desglasar la sartén con un poco de vino tinto, raspando los trozos crujientes del fondo, luego verter este vino, el vino restante y el caldo en la olla de carne.", "Llevar a ebullición, reducir el fuego y hervir a fuego lento, revolviendo de vez en cuando, durante aproximadamente dos horas. Sazone al gusto. Si el líquido se reduce demasiado, rellénelo con agua. Cuando la carne esté tierna, déjela enfriar y luego refrigérela. Cuando esté frío, levante la grasa solidificada y deséchela. Congele la mezcla en pequeños lotes y úsela para tomates rellenos, boloñesa, canelones, pastel de pasto, moussaka o lasaña."]}, {"isVegetarian": true, "title": "Crumble de manzana y mora", "url": "www_bbc_co_uk_food_recipes_apple_and_blackberry_33697", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_blackberry_33697_16x9.jpg", "ingredients": ["500g / 1lb 2oz de manzanas para cocinar, peladas, sin corazón y en rodajas", "25g / 1oz de mantequilla", "75 g / 2½ oz de azúcar en polvo", "250 g / 9 oz zarzamoras", "100g / 3½oz de harina integral simple", "75g / 2½oz avena avena", "2 cucharaditas de Shony (algas en polvo)", "100g / 3½oz de azúcar morena oscura", "75g / 2½oz de mantequilla sin sal, refrigerada, cortada en aproximadamente 1cm / ½ en cubos", "25 g / 1 oz de semillas de girasol", "15 g / ½ oz de semillas de calabaza"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, ponga las manzanas, la mantequilla y el azúcar en una sartén. Cocine a fuego medio durante unos 10 minutos, revolviendo de vez en cuando, hasta que el azúcar se haya disuelto y la fruta apenas comience a colapsar. Pruebe y agregue más azúcar si es necesario. Agregue las moras y transfiera la mezcla a un plato de horno y reserve.", "Para hacer la cobertura de crumble, combine la harina, la avena, las algas en polvo y el azúcar en un tazón. Agregue la mantequilla y frote ligeramente con la punta de los dedos hasta que la mezcla se parezca a las migas de pan gruesas.", "Usando un mortero o un pequeño procesador de alimentos, triture las semillas para que se descompongan un poco. No los reduzcas a un polvo fino. Revuelva las semillas trituradas en la mezcla de crumble.", "Vierta la mezcla de crumble sobre el relleno. Hornee durante 35-40 minutos o hasta que estén dorados y burbujeantes. Deje reposar durante aproximadamente 10 minutos antes de servir."]}]