[{"ingredients": ["Filete de bacalao de 650 g / 1 lb 7 oz, pelado y deshuesado", "150ml / 5fl oz crema batida", "½ limón, solo ralladura", "1 huevo de gallinas camperas, golpeado", "Harina normal de 80g / 2¾oz, más extra para quitar el polvo", "¾ cucharadita de sal", "12 vueltas de peppermill negro", "pequeño eneldo picado, picado", "1 cucharada de alcaparras picadas", "40 g / 1½ oz de mantequilla", "1 yema de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "¼ cucharadita de sal", "150ml / 5fl oz de aceite de oliva", "120ml / 4fl oz mayonesa (ver arriba)", "2 cucharadas de alcaparras finamente picadas", "2 cucharadas de pepinillo encurtido finamente picado", "1 cebolla pequeña, finamente rallada", "exprimir jugo de limón", "2 cucharaditas de mostaza Dijon", "¼ cucharadita de curry en polvo", "cebollino pequeño, picado", "3-4 ramitas de estragón fresco, picado", "3 cucharadas de crema batida, ligeramente batida"], "method": ["Combine el pescado con la crema, la ralladura de limón, el huevo, la harina, la sal y la pimienta en un procesador de alimentos y pulse hasta que se combinen. Transfiera a un tazón y mezcle el eneldo picado y las alcaparras. La mezcla será un poco pegajosa.", "Con las manos ligeramente enharinadas, divídalas en 8 a 12 porciones, dependiendo del tamaño que desee para el frikadeller, y forme empanadas planas.", "Caliente la mantequilla hasta que haga espuma y fríe las hamburguesas durante 4-5 minutos por cada lado hasta que estén doradas. Mantener caliente", "Para la mayonesa, ponga el huevo, el vinagre y la sal en una licuadora o procesador de alimentos. Encienda la máquina y muy lentamente gotee el aceite a través del orificio de la tapa hasta que tenga una emulsión espesa. Para hacer la mayonesa a mano, asegúrese de que todos los ingredientes estén a temperatura ambiente. Pon el huevo, el vinagre y la sal en un tazón. Batir ligeramente las yemas para romperlas y, con un batidor de varillas, batir el aceite en unas gotas a la vez hasta que esté todo incorporado. Una vez que haya agregado el mismo volumen de aceite que la mezcla original de huevo y vinagre, puede agregar el aceite un poco más rápido.", "Mezcle todos los ingredientes para la remoulade, doblando la crema batida al final. Sirve junto al frikadeller."], "url": "www_bbc_co_uk_food_recipes_danish_fish_frikadeller_98237", "title": "Pasteles de pescado danés ('frikadeller') con remoulade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/danish_fish_frikadeller_98237_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla sin sal", "500g / 1lb 2oz de harina blanca fuerte", "7g de sal", "80g / 3oz de azúcar en polvo (tanto dulce como salado)", "10g de levadura de acción rápida", "1 huevo de gallinas camperas, ligeramente batido", "260ml / 9fl oz de leche entera", "aceite de oliva", "1 cebolla blanca picada", "Setas de 200g / 7oz, picadas", "sal y pimienta negra recién molida", "Emmental de 300 g / 10 oz, cortado en rodajas finas, más 100 g / 3½ oz emmental rallado", "1 huevo de gallinas camperas, batido, para lavar huevos", "3 huevos grandes de gallinas camperas, solo yemas", "50g / 1¾oz de azúcar en polvo de oro", "1 cucharada de cacao en polvo", "1 cucharada de harina normal", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "½ cucharada de calvados", "50 g / 1% C2% BEoz% 20dark% 20chocolate% 20 (80 %% 20cocoa),% 20broken% 20into% 20pieces", "½ cucharadita de extracto de vainilla", "6-7 manzanas de postre de tamaño mediano, peladas, sin núcleo y picadas", "30 g / 1 oz de azúcar en polvo", "2 huevos de gallinas camperas, golpeados"], "method": ["Extienda la mantequilla entre dos pedazos de papel antigrasa en un rectángulo de aproximadamente 15x30 cm / 6x12 in y 8 mm (un tercio de pulgada) de grosor. Coloque en el refrigerador por dos horas.", "Mientras tanto, para hacer la masa de hojaldre, coloque la harina, la sal, el azúcar y la levadura en un tazón grande para mezclar (asegurándose de que la levadura no entre en contacto directo con la sal). Mezcle el huevo y la mayor parte de la leche hasta que tenga una masa suave. Agregue un poco más de leche si todavía hay copos secos en el recipiente.", "Incline la masa sobre una superficie ligeramente enharinada y amasar bien durante 10 minutos, o hasta que se pueda estirar con las manos. (Será un poco más firme que la masa de pan.) Envuelva la masa en film transparente y deje enfriar en la nevera durante al menos un par de horas.", "Una vez frío, enrolle la masa sobre una superficie de trabajo enharinada y gírela en un rectángulo de 50x20cm / 20x8 pulgadas. Coloque la mantequilla enfriada sobre dos tercios de la masa. Trae la sección sin mantequilla en el centro, luego dobla sobre la parte superior cubierta. Ahora tiene tres capas de masa y dos capas de mantequilla. Pellizca los bordes ligeramente para sellar la mantequilla. Regrese la masa al refrigerador para enfriar por 30 minutos.", "Una vez frío, dale a la masa un cuarto de vuelta y coloca la masa en un rectángulo largo nuevamente y repite el proceso de doblado. Refrigere por 30 minutos nuevamente. Repita este proceso dos veces más y luego envuelva la masa en film transparente y déjelo reposar durante la noche.", "Para rellenar emmental, champiñones y pastel de cebolla, en una sartén caliente, agregar un poco de aceite de oliva y freír las cebollas durante un par de minutos. Agregue los champiñones y freír suavemente durante cinco minutos, o hasta que estén suaves.", "Retirar del fuego y sazonar con sal y pimienta y dejar enfriar por completo.", "Alinee una bandeja para hornear con un pergamino para hornear. Tome la masa fría de la nevera. Corta la masa por la mitad y en una superficie ligeramente enharinada, enrolla una pieza en un rectángulo de aproximadamente 25x35 cm / 10x14 pulgadas y un poco menos de un centímetro de grosor.", "Con el lado largo de la masa enfrente de usted, extienda la mitad del champiñón fresco y la mezcla de cebolla sobre la masa y cubra con las finas rebanadas de queso.", "Ahora vas a rodar la masa hacia ti en un apretado rollo suizo. Así que toma las dos esquinas más alejadas y arrástralas al borde. Tire de la masa suavemente hacia arriba cada vez que la enrolle para mantener apretada la masa.", "Una vez que tienes un largo rollo suizo frente a ti. Gire suavemente hacia adelante y hacia atrás para sellar los bordes.", "Repita con la segunda pieza de masa y el resto del relleno.", "Corte cada rollo en 10 rebanadas para crear 10 pasteles individuales y coloque en una o dos bandejas para hornear alineadas con papel para hornear.", "Cubra los pasteles en la bandeja de hornear en film transparente, o coloque la bandeja en una bolsa de plástico grande, y deje que se levante durante una hora.", "Precaliente un horno sin ventilador a 180C / 350F / Gas 4", "Descubre los pasteles, cepíllalos con huevo y ralla un poco de emmental rallado encima de cada uno.", "Hornee los pasteles en el horno precalentado sin ventilador durante unos 20 minutos o hasta que estén dorados.", "Deje que los pasteles se enfríen un poco en una rejilla de alambre y luego cómalos calientes.", "Para los pasteles dulces, primero prepare la crema pastelera de chocolate. Batir los huevos y el azúcar juntos en un tazón, luego agregar el cacao y la harina, y batir bien.", "En una cacerola de base pesada, caliente la leche, la crema y los calvados hasta que hierva a fuego lento, luego vierta lentamente la mezcla en los huevos, batiendo mientras vierte. Regrese la mezcla a la sartén y caliente suavemente, revolviendo constantemente, hasta que se espese y llegue a ebullición. Retire del fuego y agregue el chocolate roto y la vainilla. Permita que el chocolate se derrita y mezcle, luego deje enfriar cubierto con un disco de papel para hornear para detener la formación de la piel.", "Para hacer el puré de manzana, caliente las manzanas con un chorro de agua y el azúcar impalpable durante 10 minutos, o hasta que las manzanas se suavicen y se descompongan para obtener un puré. (Si es necesario, mezcle la mezcla de manzana en un procesador de alimentos durante un minuto en un puré suave, luego páselo por un colador).", "Coloque el puré de manzana en un recipiente y deje que se enfríe por completo.", "Tome la masa fría y extiéndala sobre una superficie ligeramente enharinada hasta poco más de un centímetro de grosor y córtela en cuadrados de 12cm / 4½ pulgadas. Deberías obtener 8-12 cuadrados del mismo tamaño.", "Ponga una cucharada de crème patissière en el centro de cada uno de los cuadrados de pastelería y una cucharada de puré de manzana al lado. Doble la masa en triángulos, y presione los bordes juntos para sellar.", "Coloque las pastas bien separadas en una o dos bandejas para hornear forradas con pergamino para hornear. Cúbralo con film transparente o colóquelo en una bolsa de plástico grande y déjelo reposar durante 1 a 2 horas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Perfore la parte superior de los triángulos con un cuchillo afilado para dejar salir el vapor y cepille los triángulos con un lavado de huevos.", "Hornee en una bandeja forrada de 15 a 20 minutos o hasta que estén doradas. Enfriarlos en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_danish_pastry_with_sweet_71015", "title": "Pastelería danesa con rellenos dulces o salados", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Rinde 20 pasteles salados o 12 dulces", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla de coco (esto no es lo mismo que el aceite)", "50g / 1¾oz de azúcar morena suave", "1½ cucharadita de espresso instantáneo", "1½ cucharada de cacao en polvo", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070 %% 20cocoa% 20solids),% 20finely% 20chopped", "Harina normal 225g / 8oz", "1½ cucharadita de bicarbonato de soda", "½ cucharadita de sal marina fina", "1½ cucharadita de polvo instantáneo de espresso", "75 g / 2½ oz de cacao en polvo", "300g / 10½oz de azúcar morena oscura", "375ml / 13fl oz de agua caliente, de una caldera recientemente hervida", "90ml / 3fl oz (o 75g / 2½ oz si se pesa cuando es sólido) aceite de coco", "1½ cucharadita de vinagre de sidra o vinagre de vino blanco", "1 cucharada de pétalos de rosa comestibles, para decorar", "1 cucharada de pistachos picados, para decorar"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4 y meter en una bandeja para hornear al mismo tiempo.", "Para la guinda, ponga todos los ingredientes de glaseado excepto el chocolate picado en una cacerola de base pesada y agregue 4 cucharadas de agua fría. Llevar a ebullición, asegurándose de que todo está disuelto. Luego apague el fuego pero deje la sartén sobre la cocina. Agregue rápidamente el chocolate finamente picado y agite la sartén para que quede todo bajo el agua, por así decirlo. Déjalo por un momento, luego revuelve hasta obtener una capa de glaseado oscuro y déjalo enfriar. Encuentro que esto toma exactamente la cantidad de tiempo que toma la torta para hacer, cocinar y enfriar. Pero revuelva la formación de hielo con una espátula de vez en cuando.", "Alinee la parte inferior de la lata de la torta Springform (necesitará una buena, a prueba de fugas, ya que esta es una mezcla muy húmeda) con pergamino para hornear.", "Coloque la harina, el bicarbonato de soda, la sal, el espresso instantáneo y el cacao en polvo en un tazón y tenedor para mezclar.", "Mezcle el azúcar, el agua, el aceite de coco y el vinagre hasta que el aceite de coco se haya derretido y mezcle con los ingredientes secos. Verter en la lata preparada y hornear durante 35 minutos. Aunque verifique en la marca de los 30 minutos para ver si ya está hecho. Cuando esté listo, la torta estará saliendo de los bordes de la lata y un probador de torta saldrá limpio, aparte de algunas migas. Esta es una torta de chocolate y no quieres exagerar.", "Una vez que la torta esté cocida, transfiera la lata a una rejilla y deje que la torta se enfríe en la lata. Una vez que esté completamente frío, quítelo de la lata.", "Dirígete a tu formación de hielo y revuélvelo con una espátula para verificar que tenga la consistencia adecuada. Tiene que ser lo suficientemente líquida para cubrir el pastel, pero lo suficientemente gruesa como para permanecer (sobre todo) en la parte superior. Así que vierta sobre la torta, y use una espátula para facilitar la formación de hielo en los bordes, si es necesario. Si deseas decorar, ahora es el momento de hacerlo. En cuyo caso, rocía alegremente con pétalos de rosa y pistachos picados o cualquier otra cosa que tu corazón desee; de lo contrario, déjalo brillar oscuramente y, de hecho, suntuosamente. Deje reposar durante 30 minutos para que se forme la formación de hielo antes de rebanar el pastel."], "url": "www_bbc_co_uk_food_recipes_dark_and_sumptuous_53597", "title": "Oscuro y suntuoso pastel de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dark_and_sumptuous_53597_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids),% 20chopped", "200ml / 7fl oz crema batida", "1 cucharada de mascarpone", "3 cucharadas de puré de castañas", "1 cucharadita de extracto de café (o 1 cucharadita de café instantáneo disuelto en 1 cucharada de agua caliente)", "cacao en polvo y azúcar glas o chocolate rallado, para servir"], "method": ["Coloque el chocolate en un recipiente resistente al calor suspendido sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Derretir el chocolate lentamente, revolviendo de vez en cuando.", "Cubra una bandeja con una hoja de papel para hornear y ponga el chocolate en círculos de 18 x 8 cm / 3 pulgadas de diámetro. (Si es necesario, puede ordenar los círculos con un cortador de pasteles redondo cuando el chocolate esté casi listo). Coloque en un lugar fresco para colocarlo por completo.", "Batir la crema y el mascarpone hasta que estén firmes, luego mezclar el puré de castañas y el extracto de café.", "Prepare cada milhojas espolvoreando un poco de crema de castaña en un disco de chocolate y colocando un segundo disco en la parte superior. Agregue otra gota de crema de castaña y finalmente un tercer disco. Repita con los círculos de chocolate restantes para hacer seis millefeuilles.", "Mantenga refrigerado hasta que esté listo para servir, luego espolvoree con cacao en polvo y azúcar glas, o chocolate rallado."], "url": "www_bbc_co_uk_food_recipes_dark_chocolate_coffee_81992", "title": "Millefeuilles de chocolate amargo, café y castaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 plátanos muy maduros, pelados, cortados en trozos", "¼ cucharadita de esencia de vainilla", "3-4 cucharadas de azúcar, miel o edulcorante, al gusto", "Suero de leche 150ml / 5fl oz o yogur griego de 150g / 5½oz", "200g / 7oz% 20dark% 20chocolate% 20 (% mínimo 2060 %% 20cocoa% 20solids)", "100 g / 3½ oz de mantequilla", "35 g / 1¼ oz de almendras molidas", "2 huevos grandes de gallinas camperas, separados", "35g / 1¼ oz de harina de maíz", "85g / 3oz de azúcar en polvo", "Harina normal 175g / 6oz", "125g / 4½ oz de harina de maíz", "1 cucharadita de polvo de hornear", "250ml / 9fl oz de agua con gas", "4 cucharaditas de aceite de sésamo", "4 plátanos, cortados en trozos", "aceite vegetal, para freír", "250 g / 9 oz de azúcar en polvo", "3 cucharadas de semillas de sésamo", "agua con hielo", "175g / 6oz de chocolate puro, roto en pedazos", "50 g / 1 oz de azúcar en polvo"], "method": ["Para el helado, distribuya los trozos de plátano en una bandeja y congélelos hasta que se congelen completamente (aproximadamente una hora).", "Coloque los trozos de plátano congelados en un procesador de alimentos. Agregue la vainilla, el azúcar (o la miel / edulcorante) y la mitad del suero (o yogur). Encienda el procesador y mezcle por unos momentos. Luego, mientras el procesador aún está en funcionamiento, vierta el suero de leche restante en un chorro delgado y constante (si está usando yogur, simplemente apúntelo todo y mezcle).", "Mezcle hasta que la mezcla esté suave y cremosa. Reserve en el congelador y saque un poco antes de que esté listo para servir.", "Para los fondants de chocolate negro, rallar finamente 40 g / 1½ oz del chocolate y dejar de lado.", "Derrita la mitad de la mantequilla y cepille abundantemente todo el interior de ocho moldes. Polvo bien con el chocolate rallado, sacudiendo cualquier exceso. Poner a un lado en una bandeja para hornear.", "Derrita el chocolate restante (incluido cualquier exceso agitado) y la mantequilla en un tazón pequeño resistente al calor sobre una fuente de agua apenas hervida (no permita que el recipiente toque el agua), o derrítelo en un recipiente apto para microondas en el microondas lleno poder durante 2-3 minutos, revolviendo una vez. No se sobrecaliente o el chocolate se 'agarrará' o se volverá sólido. Raspe esta mezcla en un tazón más grande, luego bata las almendras molidas, las yemas de huevo y la harina de maíz.", "Batir las claras de huevo en un recipiente aparte hasta que formen picos rígidos pero no secos. Poco a poco vencer el azúcar impalpable. Un batidor eléctrico de mano es lo mejor para esto.", "Dobla la mezcla de clara de huevo en la mezcla de chocolate derretido.", "Vierta la mezcla combinada en los moldes. Suavice la parte superior de los fondants y enfríe en el refrigerador mientras calienta el horno a 180C / 350F / Gas 4.", "Hornee los fondants en el horno durante 6-8 minutos, o hasta que se levanten y fijen.", "Para los buñuelos de plátano y el helado, tamice la harina, la harina de maíz y el polvo de hornear en un bol y luego agregue el agua y el aceite de sésamo.", "Agregue los plátanos y mezcle suavemente hasta que estén cubiertos.", "Llene una olla ancha hasta la mitad con aceite vegetal y caliente hasta que caliente, o alternativamente caliente una freidora a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje los plátanos maltratados en el aceite y fríalos hasta que estén dorados, luego escurra sobre toallas de papel.", "Para hacer el caramelo, coloque el azúcar en una sartén y caliente hasta que todo el azúcar se haya derretido. Aumente el fuego y continúe cocinando sin revolver, hasta que el jarabe se vuelva un color caramelo claro. Agregue las semillas de sésamo y revuelva bien.", "Retire del fuego y añada cuidadosamente un buñuelo de plátano por vez al caramelo caliente (PRECAUCIÓN: el caramelo estará muy caliente). Dale la vuelta al buñuelo con un tenedor para cubrirlo por completo con caramelo, luego quítalo de inmediato y sumérgete en un recipiente con agua helada. Retire y drene en una rejilla de alambre mientras cocina los buñuelos restantes.", "Para la salsa de chocolate caliente, derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua).", "Caliente el azúcar en una sartén con 100 ml / 3½ onzas de agua, revolviendo hasta que el azúcar se disuelva. Llevar a ebullición.", "Mezcle el jarabe de azúcar en el chocolate derretido hasta que quede suave y brillante.", "Para servir, coloque los fondant de chocolate en los platos junto con los buñuelos de plátano. Agregue una bola de helado y vierta la salsa de chocolate sobre ella."], "url": "www_bbc_co_uk_food_recipes_dark_chocolate_fondant_07896", "title": "Fondant de chocolate negro con salsa de chocolate caliente, buñuelos de plátano y helado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350 g / 12 oz% 20plain% 20chocolate% 20 (% mínimo 2055%% 20cocoa% 20solids)", "250 g / 9 oz de mantequilla sin sal, más extra para engrasar", "3 huevos grandes de gallinas camperas", "250 g / 9 oz de azúcar morena oscura", "Harina común 110g / 4oz", "1 cucharadita de polvo de hornear", "150g / 5½oz de cerezas frescas, cortadas a la mitad, sin piedras", "150 g / 5½ oz de chocolate blanco, más o menos picados", "1-2 cucharadas de cacao en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 170C / 150C Ventilador / Gas 3. Engrase una lata de hornear de 30x23cm / 12x9in con mantequilla y luego forre la base y los costados con papel de hornear.", "Caliente el chocolate y la mantequilla en una cacerola a fuego lento hasta que se derrita y se combine bien, revolviendo ocasionalmente. Retirar del fuego y reservar para enfriar un poco (al menos 5 minutos).", "Mientras tanto, bata los huevos con el azúcar en un tazón grande hasta que estén espesos, pálidos y cremosos.", "Batir la mezcla de chocolate enfriada en la mezcla de huevo, luego doble suavemente la harina, el polvo de hornear y la mitad de las cerezas hasta que se combinen.", "Con una cuchara, coloque la mezcla de brownie en la lata preparada, luego espolvoree sobre el chocolate blanco y las cerezas restantes.", "Hornee los brownies en el horno durante 25-30 minutos, o hasta que la superficie se agriete y una brocheta insertada en el centro de los brownies salga con solo una pequeña mezcla pegada a ella. Retire del horno y deje a un lado para enfriar completamente en la lata, en una rejilla de alambre.", "Para servir, espolvoree los brownies con cacao en polvo, luego córtelos en cuadrados y retírelos de la lata."], "url": "www_bbc_co_uk_food_recipes_dark_and_white_chocolate_89301", "title": "Brownies cereza chocolate oscuros y blancos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 brownies", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dark_and_white_chocolate_89301_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750 ml / 1¼ de leche de pinta", "40 g / 1½ oz de cacao en polvo", "5 yemas de huevo de gallinas camperas", "Azúcar 80 g / 3 oz", "1 cucharadita de extracto de vainilla", "200 g / 7 oz de chocolate negro, picado"], "method": ["Tome 50ml / 2fl oz de la leche medida y combine con el cacao en polvo para formar una pasta delgada. Caliente la leche restante hasta el punto de ebullición, luego retírela del fuego y deje que se enfríe un poco.", "En un tazón grande a prueba de calor, bata las yemas de huevo con el azúcar hasta que estén muy pálidas y gruesas (esto se hace mejor con un batidor eléctrico).", "En una corriente delgada, agregue la leche caliente a la mezcla de huevo, batiendo continuamente, hasta que esté completamente combinada. Agregue la pasta de cacao y devuelva la mezcla a la cacerola.", "A fuego medio, revolviendo constantemente, cocine la crema muy suavemente durante al menos cinco minutos. Esto es importante para cocinar el cacao en polvo. Continúe cocinando la crema pastelera muy suavemente hasta que espese y cubra la parte posterior de una cuchara (si dibuja una línea a través de la crema en la parte posterior de la cuchara con el dedo, se mantendrá despejado).", "Retire del fuego y vierta la mezcla en un tazón grande. Agregue el extracto de vainilla y el chocolate picado hasta que se derrita.", "Permita que la mezcla se enfríe, luego refrigere, cubra, durante al menos ocho horas, preferiblemente durante la noche.", "Batir en una máquina para hacer helados de acuerdo con las instrucciones del fabricante. Alternativamente, vierta la mezcla en una caja de plástico grande. Cubra y congele por una hora. Retire del congelador y bata con una batidora eléctrica portátil o una batidora hasta que los cristales de hielo se rompan. Repita tres veces más y luego congele hasta que esté firme."], "url": "www_bbc_co_uk_food_recipes_dark_chocolate_gelato_74292", "title": "Gelato de chocolate negro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5% C2% BDoz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids", "150 g / 5½ oz de almendras molidas", "Polenta de 100 g / 3½ oz", "1 cucharadita de polvo de hornear sin gluten", "225 g / 8 oz de azúcar en polvo", "225g / 8oz de mantequilla, ablandada, más extra para engrasar", "3 huevos grandes de gallinas camperas", "1 cucharadita de extracto de vainilla", "crema fresca, para servir", "100 g / 3½ oz de mantequilla", "150g / 5½oz de azúcar morena oscura", "3 cucharadas de jarabe de oro", "150ml / 5fl oz de crema doble", "1 cucharadita de extracto de vainilla", "generosa pizca de sal marina"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase un molde de resorte redondo de 20 cm / 8 pulg y forre la base con papel de hornear.", "Derrita el chocolate en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. Dejar enfriar un poco.", "Mezcle las almendras, la polenta y el polvo de hornear en un tazón pequeño.", "Batir el azúcar y la mantequilla en un tazón grande hasta que la mezcla esté clara y pálida. Agregue los huevos, uno a la vez, latiendo bien después de cada adición. Doble a través del chocolate derretido hasta que esté completamente incorporado. Incline el tazón de ingredientes secos en la mezcla de chocolate y dóblelos con una espátula, hasta que se combinen. Agregue el extracto de vainilla y doble.", "Vierta la mezcla en el molde preparado y hornee en el estante del medio del horno durante 40 minutos o hasta que salga limpio un pincho. Retire de la lata y deje enfriar un poco sobre una rejilla de alambre.", "Para la salsa, coloca la mantequilla, el azúcar y el jarabe en una olla. Llevar a ebullición suave, luego cocine hasta que el azúcar se haya disuelto. Agregue la crema, la vainilla y la sal, luego mezcle. Deje que hierva a fuego lento, cocine durante 3 minutos o hasta que esté pegajoso y espeso.", "Cortar la torta caliente en rodajas y servir con un poco de crema fresca y una llovizna de salsa."], "url": "www_bbc_co_uk_food_recipes_dark_chocolate_polenta_00242", "title": "Pastel de polenta de chocolate negro con salsa de caramelo salado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de azúcar en polvo", "50g / 2oz de avellanas picadas", "200 g / 7 oz de chocolate negro de buena calidad, con un mínimo de 70% de sólidos de cacao, aproximadamente picados", "125ml / 4½fl oz de agua tibia", "4 yemas de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "Crema doble de 200 ml / 7 fl oz", "3 hojas de gelatina, empapadas en agua fría para suavizar, luego exprimidas", "200g / 7oz de chocolate blanco, toscamente picado", "4 yemas de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "2 hojas de gelatina, empapadas en agua fría para ablandar, luego estrujadas", "Crema doble de 200 ml / 7 fl oz", "Fresas de 450 g / 1 lb, cascos eliminados, cortados por la mitad", "30g / 1¼ oz de tallo de jengibre (de un tarro), aproximadamente picado", "2 cucharadas de azúcar glas", "25g / 1oz de mantequilla"], "method": ["Para el praliné, forrar una bandeja para hornear con papel antigrasa. Calentar una sartén a fuego alto hasta que esté caliente. Agregue el azúcar y cocine hasta que el azúcar se haya derretido por completo y esté pegajoso y dorado.", "Agregue las avellanas picadas y revuelva hasta que estén cubiertas con la mezcla de azúcar, luego vierta la mezcla en la bandeja de horno preparada. Dejar de lado hasta que la mezcla se haya endurecido.", "Cuando la mezcla de praliné se haya endurecido, cúbrala con una lámina de película adhesiva y divídala en pedazos pequeños con un martillo de caramelo o un rodillo. Dejar de lado.", "Para la mousse de chocolate negro, hierva a fuego lento una olla de agua. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue el chocolate negro y el agua tibia al recipiente y revuelva hasta que quede suave y brillante y completamente derretido. Retirar del fuego y reservar para enfriar un poco.", "Suspenda un recipiente separado y limpio sobre la fuente de agua hirviendo a fuego lento, agregue las yemas de huevo y el azúcar y bata continuamente durante 3-4 minutos, o hasta que la mezcla esté pálida y espesa. Retirar del fuego y reservar para enfriar un poco.", "Coloque la mitad de la crema y la gelatina ablandada en una sartén por separado y caliente suavemente a fuego medio, revolviendo hasta que la gelatina se haya disuelto.", "Agregue la mezcla de crema al chocolate derretido y mezcle hasta que esté bien combinado.", "Agregue la yema de huevo y la mezcla de azúcar y bata de nuevo hasta que estén bien combinados.", "En un recipiente aparte, bate la crema restante hasta que se formen picos suaves cuando se quite el batidor. Dobla la crema batida en la mezcla de chocolate.", "Alinee una lata de pan de 1 kg / 2 lb con film transparente. Con cuidado, vierta la mezcla de chocolate negro en la lata de pan y golpee suavemente los lados para eliminar las burbujas de aire. Enfríe la nevera durante al menos 30 minutos, o hasta que se haya establecido.", "Para la mousse de chocolate blanco, suspenda un recipiente limpio y resistente al calor sobre la fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Agregue el chocolate blanco al tazón y revuelva hasta que quede suave y brillante y completamente derretido. Retirar del fuego y reservar para enfriar un poco.", "Suspenda un recipiente separado y limpio sobre la fuente de agua hirviendo a fuego lento, agregue las yemas de huevo y el azúcar y bata continuamente durante 3-4 minutos, o hasta que la mezcla esté pálida y espesa. Retirar del fuego y reservar para enfriar un poco.", "Coloque la mitad de la crema y la gelatina ablandada en una sartén y caliente suavemente a fuego medio, revolviendo hasta que la gelatina se haya disuelto.", "Agregue la mezcla de crema al chocolate derretido y mezcle hasta que esté bien combinado.", "Agregue la yema de huevo y la mezcla de azúcar y bata de nuevo hasta que estén bien combinados.", "En un recipiente aparte, bate la crema restante hasta que se formen picos suaves cuando se quite el batidor. Dobla la crema batida en la mezcla de chocolate.", "Cuando la mousse de chocolate negro se haya puesto, vierte cuidadosamente la mezcla de chocolate blanco en la lata de pan, encima de la mousse de chocolate negro, luego toca suavemente los lados para eliminar las burbujas de aire. Enfríe la nevera durante al menos dos horas, o hasta que esté completamente preparada.", "Para la compota de fresa y jengibre, mezcle 250 g / 9 oz de las fresas, todo el jengibre y el azúcar glas en un procesador de alimentos para un puré.", "Pase la mezcla a través de un tamiz fino, recogiendo el líquido tamizado en un recipiente. Reserve el liquido", "Calentar la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue las fresas restantes y fría por 1-2 minutos, o hasta que se ablanden.", "Para servir, espolvorea un poco de compota de fresa y jengibre en el centro de cada uno de los ocho platos para servir. Corte la terrina de chocolate blanco y negro en ocho rebanadas con un cuchillo caliente. Coloque una rebanada en el centro de cada plato. Adorne cada plato con algunas de las mitades de fresa restantes. Espolvorea sobre las piezas de praliné."], "url": "www_bbc_co_uk_food_recipes_darkandwhitechocolat_90938", "title": "Terrina de chocolate blanco y negro con compota y praliné de fresa y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "250 g / 9 oz de azúcar en polvo", "1½ cucharadita de polvo de hornear", "3 huevos medianos de granja, ligeramente golpeados", "250 g / 9 oz de cerezas negras secas, picadas", "Avellanas enteras 125g / 4½oz, conchas eliminadas (peso sin cáscara)", "1 limón, ralladura solamente"], "method": ["Para biscotti, precaliente el horno a 150C / 300F / Gas 2. Cubra una bandeja para hornear con papel antigrasa.", "Mezcle la harina, el azúcar y el polvo de hornear en un recipiente hasta que estén bien combinados.", "Batir en la mitad de los huevos batidos hasta que estén bien combinados. Poco a poco agregue el huevo batido restante, poco a poco, asegurándose de que todo el huevo se haya incorporado por completo a la mezcla antes de agregar más, hasta que la mezcla se una como masa. (Nota: es posible que no necesite usar todo el huevo).", "Agregue las cerezas, las avellanas y la ralladura de limón y mezcle bien.", "Divida la masa en seis porciones iguales. Enrolle cada porción en una forma de salchicha de aproximadamente 3 cm / 1¼ pulgada de diámetro, con sus manos. Suavemente aplana cada porción de masa con la palma de tu mano.", "Coloque cada 'salchicha' de masa en la bandeja de horneado preparada, dejando un espacio de 6 cm / 2½ pulgadas entre cada porción de masa para permitir la expansión. Hornee en el horno por 15-20 minutos, hasta que estén pálidas doradas.", "Retire las 'salchichas' del horno y déjelas a un lado durante 10 minutos para que se enfríen y se vuelvan firmes.", "Con un cuchillo de sierra, corte rebanadas gruesas de 5cm / 2in de las \"salchichas\" de la masa en la diagonal. Coloque las rebanadas en la bandeja de horno forrada y vuelva a colocarlas en el horno durante 6-8 minutos más.", "Voltee la galleta y continúe horneando durante 6-8 minutos, o hasta que estén crujientes y doradas. Dejar de lado para enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_darkcherryandhazelnu_92470", "title": "Biscotti de cereza oscura y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/darkcherryandhazelnu_92470_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "600g / 1lb de chocolate negro de 5 oz, más o menos picados", "600ml / 1 pinta 1½ fl oz doble crema", "8 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "75ml / 3½fl oz de agua fría", "125g / 4½ oz galletas de tocador o dedos de esponja", "200ml / 7fl oz de café frío", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl de leche en oz", "25g / 1oz de granos de café tostados", "6 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "40-50 granos de café recubiertos de chocolate"], "method": ["Para la terrina, engrase ligeramente una lata de pan de 1.5 kg / 3 libras y 4 onzas con un poco de aceite y cubra con película adhesiva, presionando en las esquinas.", "Coloque el chocolate en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento para que se derrita (asegúrese de que el fondo del recipiente no toque el agua). Una vez derretido, retire el tazón de la sartén y mezcle la mitad de la crema doble. Dejar de lado.", "Coloque un recipiente limpio y resistente al calor sobre una fuente de agua hirviendo (nuevamente asegurándose de que el fondo del recipiente no toque el agua), agregue las yemas de huevo y el azúcar y bata durante 3-4 minutos, o hasta que la mezcla esté pálida y espesa .", "Batir el huevo y la mezcla de azúcar en el chocolate hasta que estén bien combinados, luego batir con el agua fría.", "Batir la crema doble restante en un bol hasta que se formen picos suaves cuando se quite el batidor. Doble suavemente la crema batida en la mezcla de chocolate hasta que se combinen.", "Sumerja los panecillos boudoir o los dedos de esponja en un tazón de café frío, luego coloque los bizcochos empapados verticalmente a lo largo de los lados de la lata de pan preparado. Asegúrese de que no haya espacios entre cada galleta.", "Coloque la mezcla de chocolate en el centro, luego golpee ligeramente la lata sobre la superficie de trabajo para igualar la mezcla, asegurándose de que la mezcla llegue a las esquinas. Cubra con film transparente y deje enfriar en la nevera durante al menos dos horas, o hasta que se endurezca.", "Para la crema de café anglaise, coloque la crema doble, la leche y los granos de café tostados en una sartén y cocine a fuego lento.", "Batir las yemas de huevo y el azúcar en un tazón, luego verter lentamente en la mezcla de crema caliente, batiendo continuamente hasta que esté bien combinado. Vierta la mezcla de nuevo en una sartén limpia y cocine a fuego lento durante 4-5 minutos, o hasta que la mezcla cubra la parte posterior de una cuchara de madera.", "Pasar la mezcla a través de un tamiz fino en un recipiente y dejar enfriar un poco antes de enfriar en la nevera durante al menos 30 minutos.", "Para servir, retire la terrina del refrigerador 30 minutos antes de servir para que se ablande levemente. Salga de la lata en un plato y retire la película adhesiva. Con un cuchillo caliente, corte la parte gruesa de la terrina y coloque una rebanada en cada plato. Coloque la crema de leche inglesa fría alrededor del plato y decore el plato con unos cuantos granos de café recubiertos de chocolate."], "url": "www_bbc_co_uk_food_recipes_darkchocolateandcoff_91608", "title": "Chocolate negro y terrina de café con crema de café inglés", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4-5 capas de pasta filo", "2 mitades de pera", "55 g / 2 oz de chocolate negro", "2 huevos, solo yemas", "Crema doble 55ml / 2fl oz", "30 g / 1 oz de azúcar en polvo"], "method": ["Coloque la masa de filo sobre una superficie húmeda y corte en un cuadrado. Engrase un molde dariole con mantequilla y coloque la masa dentro para que caiga sobre los lados. Coloque en un horno caliente 200C / 400F / Gas 6 por unos minutos.", "Derretir el chocolate sobre un baño maría (agua hirviendo a fuego lento en una sartén, con el tazón de chocolate sobre la parte superior).", "En otro recipiente, bata la mezcla de huevo junto con la crema doble. Agregue el chocolate y mezcle", "Corta las peras en trozos pequeños y colócalos en el molde. Vierta la mezcla en el molde y sirva."], "url": "www_bbc_co_uk_food_recipes_darkchocolateandpear_14573", "title": "Copas de chocolate filo y masa de filo de pera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1 por persona", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "harina, para quitar el polvo", "375g / 13oz de pasteles dulces listos para usar", "400 g / 14 oz de chocolate negro, 85% de sólidos de cacao, aproximadamente picados", "Crema doble 250ml / 9fl oz", "2 yemas de huevo de gallinas camperas, batidas", "450g / 1lb de azúcar granulada", "1 limón, solo jugo", "550ml / 19½ fl oz de agua", "75g / 3oz de harina de maíz", "1 cucharadita de crema de tártaro", "3 cucharadas de agua de rosas", "3 cucharadas de azúcar glas, más extra para quitar el polvo", "110g / 4 oz de chocolate negro, 85 por ciento de sólidos de cacao, fundido", "helado de vainilla"], "method": ["Engrase una lata agria de fondo suelto de 20cm / 8in.", "Sobre una superficie de trabajo ligeramente enharinada, extienda la masa dulce a un tamaño lo suficientemente grande como para cubrir la lata de tarta con un poco de todo alrededor.", "Alinee la lata de tarta con la masa, presionando la masa en los bordes. Corte el exceso de masa con un cuchillo afilado y cúbralo con una película adhesiva. Coloque en la nevera para enfriar durante 30 minutos.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Retire la caja de tarta de la nevera y destape. Alinee la masa con papel de hornear y luego rellene con alubias (o arroz crudo).", "Transfiera al horno para hornear a ciegas durante 10-15 minutos, luego retire el papel a prueba de grasa y hornee los frijoles (o arroz) y vuelva al horno para hornear por otros 3-5 minutos, hasta que esté cocido y dorado. Retire del horno y reserve.", "Reduzca la temperatura del horno a 170C / 345F / Gas 3.", "Mientras tanto, coloque el chocolate en un recipiente resistente al calor y colóquelo sobre una fuente de agua a fuego lento (no permita que el agua toque la base del recipiente). Deja calentar hasta que se derrita, luego retira el recipiente del fuego.", "Agregue la crema y las yemas de huevo y mezcle en el chocolate hasta que se combinen.", "Con cuidado, vierta la mezcla de chocolate en la caja de pastelería precocida, suavizando la mezcla para llenar la caja hasta los bordes.", "Coloque la tarta de chocolate en el horno para hornear durante 15 minutos, o hasta que el relleno de chocolate esté listo. Retire del horno y deje enfriar a temperatura ambiente antes de servir.", "Para deleite de los turcos, cubra una bandeja para hornear de 23 cm / 9 pulg. De profundidad con un pergamino para hornear.", "Coloque 350ml / 12½fl oz del agua, la harina de maíz y la crema de tártaro en una sartén por separado y mezcle bien. Coloque a fuego medio y cocine hasta que la mezcla se espese.", "Mientras tanto, coloque el azúcar y los 200ml / 7fl oz restantes de agua y el jugo de limón en una sartén y coloque a fuego medio. Llevar a ebullición y calentar a 116C / 240F (necesitará un termómetro de azúcar).", "Cuando la mezcla de azúcar y agua haya alcanzado los 116 ° C / 240 ° F, agregue la mezcla de harina de maíz y mezcle vigorosamente. Regrese al fuego y cocine a fuego lento durante 20-30 minutos, hasta que espese y se dore.", "Retire del fuego, agregue el agua de rosas y mezcle bien.", "Vierta la mezcla de delicias turcas en la bandeja forrada de pergamino y alise los bordes. Deje que se enfríe, luego transfiera a la nevera para enfriar durante 1-2 horas, o hasta que esté completamente fraguado.", "Cuando esté lista la delicia turca, espolvoree un trozo de pergamino para hornear con azúcar glas y luego coloque la delicia turca sobre el papel. Corta el deleite turco en cuadrados.", "Espolvoree un tercio de los cuadrados con azúcar glas y déjelos a un lado.", "Sumerja los cuadrados restantes de delicias turcas en el chocolate derretido y colóquelos en un plato. Coloque en la nevera para enfriar y para que se fije la cobertura de chocolate.", "Para servir, coloque una porción de la tarta de chocolate en el centro de cada plato. Coloque dos piezas de delicia turca recubierta de chocolate y una pieza de delicia turca sencilla junto a ella. Sirva con una cucharada de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_darkchocolatetartwit_89320", "title": "Tarta de chocolate negro con delicias turcas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225ml / 8 fl oz de leche", "6 cucharadas de licor de avellana", "55g / 2oz de fechas picadas", "500g / 1lb 2 oz de harina de auto crianza", "30 g / 1 oz de levadura en polvo", "85g / 3 oz de azúcar", "85 g / 3 oz de mantequilla, en cubos", "2 huevos de gallinas camperas", "55g / 2oz de nueces picadas"], "method": ["Retire todas las parrillas del horno, excepto la rejilla central, y precaliéntelas a 200C / 400F / Gas 6. Engrase y caliente una bandeja para hornear.", "Verter la leche y el licor de avellana en una sartén, agregar las fechas y calentar suavemente. Retire del fuego colocado para enfriar e infundir. Drene las fechas, reservando el licor de leche y avellanas.", "Tamiza la harina y el polvo de hornear en un tazón grande y agrega el azúcar y la mantequilla. Frote juntos hasta que la mezcla se asemeje a pan rallado grueso.", "En un recipiente aparte, bata los huevos con la leche enfriada de avellanas.", "Haga un pozo en medio de la mezcla de mantequilla y harina y agregue lentamente la mezcla de huevo, reservando dos cucharadas de líquido para glasear los bollos.", "Agregue las fechas drenantes y las nueces a la mezcla y combine para hacer una masa.", "Suavemente trabaje la masa hasta que quede suave, pero no trabaje demasiado.", "Extienda la masa sobre una superficie enharinada hasta un grosor de 4 cm / 1½ pulgada, córtela en forma de bollo con un cortador redondo y colóquela en la bandeja para hornear preparada.", "Cepille el huevo y la leche reservados sobre la parte superior de los bollos, hornee durante 15 minutos o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_date_and_walnut_scones_11690", "title": "Fecha y bollos de nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 4 oz de patatas para hornear, peladas y colocadas en un recipiente con agua fría para evitar que se doren (use papas harinas como Russet, King Edward, Maris Piper o Desiree)", "3-4 dientes de ajo", "Crema doble de 500 ml / 17½ fl oz (puede necesitar un poco más)", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Cortar las papas en rodajas finas, de aproximadamente 3 mm / ⅛ de espesor. Coloque las rebanadas en un tazón mientras las corta.", "Recorte las puntas de los dientes de ajo, pero no se pele. Ralla los dientes en un rallador. La carne pasará a través de los agujeros finos y las pieles se quedarán atrás. Raspe la carne de ajo rallado en el tazón con las papas.", "Sazonar las papas, al gusto, con sal y pimienta negra recién molida.", "Vierta la crema sobre las papas y revuelva bien.", "Coloque las rodajas de papa en el plato gratinado. Deben llegar justo debajo de la parte superior del plato. Presione la patata hacia abajo con el dorso de una cuchara o sus manos para que forme una capa sólida. La crema debe quedar justo debajo de la capa superior de la patata (si es necesario, agregue más crema doble).", "Coloque las papas en el horno y hornee por 1-1 hora y media, o hasta que las papas estén completamente tiernas. (Si la crema parece que se está partiendo, el horno está demasiado caliente, por lo tanto, apágalo un poco).", "Sirva el dauphinoise como acompañamiento para carne asada o aves de corral."], "url": "www_bbc_co_uk_food_recipes_dauphinoisepotatoes_90205", "title": "Papas Dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dauphinoisepotatoes_90205_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["16 fechas medjool grandes, apedreado y reducido a la mitad", "Margarina de soja 40g / 1½ oz", "6 hojas de pasta filo vegana, cortadas a la mitad a la mitad", "aceite de girasol, para freír", "1 cucharada de agua de rosas", "40 g / 1½ oz de azúcar en polvo", "6 cucharadas de agua", "70 g / 2½ oz de almendras molidas", "30 g / 1 oz de semillas de granada fresca", "50 g / 1¾oz de pistachos sin cáscara, picados", "50g / 1¾oz de semillas de granada fresca"], "method": ["Coloque las fechas a la mitad entre dos hojas de papel resistente a la grasa. Usando un rodillo, ruede firmemente para aplanar en un rectángulo de aproximadamente 13cm x 25cm / 5in x 10in. Coloque la hoja con fecha envuelta en grasa en una bandeja para hornear y deje que se coloque en la nevera durante 30-40 minutos.", "Mientras tanto, haz el frangipane. Mezcle el agua de rosas, el azúcar y el agua en una olla pequeña y caliente suavemente hasta que el azúcar se haya disuelto. Agregue las almendras molidas y bata para hacer una pasta suave y espesa.", "Pon la margarina de soja en una olla pequeña y calienta suavemente para que se derrita. Luego vierta en un recipiente y deje de lado hasta que sea necesario.", "Para ensamblar, saque la hoja de la fecha de la nevera y colóquela sobre una superficie plana. Despegue la capa superior de papel resistente a las grasas, recorte los bordes para hacerlos aseados y corte la hoja de datos en tres piezas rectangulares, cada una de aproximadamente 12 cm x 8 cm / 4½ pulgadas x 3¼ pulgadas. Divida el frangipane entre las piezas de la fecha, extendiéndolo por la mitad en medio de cada una y dejando un pequeño espacio en cada extremo. Espolvoree sobre las semillas de granada y enrolle cada pieza en forma de salchicha larga. Con un cuchillo afilado, corte los extremos y corte cada rollo en cuatro pedazos.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Tome un pedazo de pasta de filo y cepille los bordes con la margarina derretida. Enrolle una pieza de la fecha en la masa, retorciendo cada extremo como un dulce envuelto para sellar. Recorte los extremos con un cuchillo afilado. Repita con las piezas restantes de repostería y fecha, luego transfiera a la nevera por 15 minutos.", "Mientras tanto, esparza los pistachos picados sobre una bandeja para hornear antiadherente y tueste en el horno durante 6-8 minutos, o hasta que estén ligeramente tostados. Retire del horno y reserve para la guarnición.", "Para terminar las parcelas de fecha, caliente el aceite de girasol en una sartén honda a 180 ° C / 350 ° F. (PRECAUCIÓN: No deje el aceite caliente sin supervisión). Coloque una porción de hojaldre en el aceite; si chisporrotea y sube a la cima, el aceite está lo suficientemente caliente. Freír las parcelas de fecha en lotes durante unos cuatro minutos, o hasta que estén doradas, luego escurrir sobre papel de cocina. Sirva adornado con semillas de granada y pistachos tostados."], "url": "www_bbc_co_uk_food_recipes_date_parcels_stuffed_58807", "title": "Fecha paquetes rellenos de frangipane y granada", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/date_parcels_stuffed_58807_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz fresas, cascadas", "1kg / 2lb 4 oz de mermelada de azúcar", "½ cucharadita de jugo de limón", "25g / 1oz de mantequilla", "150ml / 5½fl oz de champán", "400g / 14oz de harina blanca fuerte, más extra para espolvorear", "3 cucharaditas de polvo de hornear", "75g / 2½ oz de azúcar", "75 g / 2½ oz de mantequilla", "2 huevos de gallinas camperas, golpeados", "Leche 250ml / 9fl oz", "1 huevo de gallinas camperas, batido para lavar huevos", "crema coagulada, para servir"], "method": ["Para preparar la compota de fresa, coloque las fresas, el azúcar y el jugo de limón en una fuente grande y mezcle suavemente.", "A fuego lento, caliente la mezcla. Una vez que el azúcar se ha disuelto, aumente el fuego y hierva rápidamente durante cinco minutos. Retire la sartén del fuego y agregue la mantequilla.", "Deje que se enfríe durante 15 minutos, luego agregue el champán. Vierta en frascos esterilizados.", "Para hacer los bollos, precaliente el horno a 220C / 425F / Gas 7 y forre una bandeja para hornear con papel para hornear.", "Coloque la harina, el polvo de hornear y el azúcar en un tazón. Agregue la mantequilla y frote con los dedos hasta que la mezcla se asemeje a pan rallado.", "Agregue los huevos y mezcle. Agregue gradualmente la leche uniendo todo para formar una masa suave. Es posible que no necesite toda la leche.", "Espolvoree un generoso puñado de harina sobre una superficie de trabajo. Incline la masa sobre ella y espolvoree más harina encima. Use sus manos para doblar la masa por la mitad, y luego gire 90 grados y repita. Haga esto unas pocas veces hasta que se forme una masa homogénea. Si la masa se vuelve pegajosa, usa harina adicional para cubrir tus manos pero trata de no sobrecargar la masa.", "Espolvoree un poco más de harina sobre la superficie de trabajo. Estirar la masa a 1,5 cm / ½ pulgada de espesor y en un rectángulo de aproximadamente 22x25 cm / 9x10 pulgadas. Recorta los bordes para limpiar el rectángulo.", "Haga rodar una ventana acoplable sobre la superficie o pinche con un tenedor. Marca la masa para marcar rectángulos del tamaño de un dedo (dos líneas verticalmente y ocho horizontalmente para formar 24 dedos de scone).", "Cepille la parte superior con un lavado de huevo y hornee por 15-17 minutos, o hasta que se levante y dore. Retire del horno y corte las líneas marcadas para hacer los dedos. Deja enfriar.", "Sirva los dedos del bollo con la compota de fresa y la crema coagulada."], "url": "www_bbc_co_uk_food_recipes_deconstructed_cream_tea_18986", "title": "Té crema deconstruido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 24 dedos de scone", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deconstructed_cream_tea_18986_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 limones no encerados, cortados en rodajas de 5 mm / ¼ de pulgada", "60g / 2¼oz de sal de mar en copos", "200ml / 7fl oz de aceite de colza", "175ml / 6fl oz de aceite de oliva", "1 cucharada de pimentón dulce", "½ cucharadita de copos de chile", "1 cucharadita de semillas de comino, tostadas y molidas", "50ml / 2fl oz de aceite de oliva", "1 cebolla grande, picada", "50 g / 1¾oz de pistachos, toscamente picados", "50g / 1¾oz de piñones, aproximadamente picados", "4 dientes de ajo, picados", "500 g / 1 libra de carne picada 2 oz", "250 g / 9 oz de carne de cordero", "1 cucharadita de pimentón dulce", "1 cucharadita de semillas de comino, tostadas y molidas", "1 cucharadita de cúrcuma molida", "1 cucharada de pasta de limón curada (ver arriba)", "sal y pimienta negra recién molida", "Aceitunas Kalamata 250 g / 9 oz, picadas", "1 ramita de tomillo fresco, solo hojas", "1 cucharadita de salsa de soja", "1 cucharada de aceite de colza", "1 manojo de berros, tallos gruesos eliminados", "1 manojo de albahaca", "1½ cucharadas de piñones, tostados", "½ cucharadita de miel líquida", "25 g / 1 oz de queso parmesano, finamente rallado", "1-2 dientes de ajo, picados (al gusto)", "2 cucharadas de jugo de limón", "50ml / 2 fl oz de aceite de oliva", "50ml / 2 fl oz de aceite de colza", "sal al gusto", "200g / 7oz de yogur griego", "5 cucharadas de tahini", "apretón de jugo de limón", "Harissa", "8 panes pitta"], "method": ["Para la pasta de limón, esterilice un recipiente hermético de 2 litros / 3½ pinta y coloque una capa de las rodajas de limón en el recipiente, luego espolvoree con un poco de sal. Repita este proceso hasta que todos los limones y sal se hayan agotado. Cubra con los aceites y selle el contenedor. Estos pueden usarse después de tres días y mantenerse hasta por una semana.", "Para hacer la pasta, cuela los limones del aceite y reserva el aceite. Pon los limones en un procesador de alimentos y agrega las especias. Mezcle, agregue suficiente aceite a medida que avanza para hacer una pasta.", "Para el kebab, coloca una sartén grande y poco profunda a fuego medio. Agregue el aceite y la cebolla y sude por 5 minutos. Agregue los pistachos y los piñones y saltee durante otros 5 minutos. Agregue el ajo y saltee por 3 minutos.", "Agregue ambos tipos de carne picada, en tandas, dividiendo cada lote con una cuchara de madera y permitiendo que se cocine durante 3-4 minutos antes de agregar el siguiente lote. Aumente el fuego a alto y cocine, revolviendo, durante 10-15 minutos. Agregue las especias y la pasta de limón y sazone con sal y pimienta. Reduzca el fuego a medio y cocine por 5 minutos.", "Para tapenade, ponga todos los ingredientes excepto el aceite en una licuadora y licúe. Poco a poco agregue el aceite hasta que tenga la consistencia adecuada.", "Para el pesto, ponga todos los ingredientes en una licuadora y mezcle hasta que estén combinados.", "Para el tahigurt, mezcle todos los ingredientes en un tazón. Divida entre cuatro placas.", "Vierta la carne sobre el tahigurt. Cucha sobre las coberturas y servir con theharissa y pittas."], "url": "www_bbc_co_uk_food_recipes_deconstructed_kebab_99889", "title": "Kebab deconstruido", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4oz de harina natural, más extra para enrollar", "125g / 4oz de harina integral", "150g / 5oz de mantequilla", "1 huevo de gallinas camperas, golpeado", "Papas harinas de 850 g / 1 libra y 14 onzas, como Maris Piper o King Edward, peladas y cortadas en cuartos", "25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "3 cebollas, cortadas a la mitad y en rodajas", "2 dientes de ajo, aplastados", "100g / 3½oz de hojas de espinaca baby", "175g / 6oz de queso cheddar maduro, rallado grueso", "2 cucharadas de hojas de perejil fresco picado", "Crema doble 250ml / 9fl oz", "pizca de nuez moscada recién rallada", "sal marina escamada y pimienta negra recién molida"], "method": ["Ponga la harina y la mantequilla en un procesador de alimentos y mezcle hasta que la mezcla se asemeje a migas de pan finas. Agregue el huevo y el pulso hasta que la mezcla se una como masa. Junta la masa y aplástala en una ronda.", "Coloca la masa en el centro de una lata para pasteles con forma de resorte de 20 cm / 8 pulg. Y con cuidado deslízala sobre la base y hacia los lados de la lata.", "Cocine las papas en agua hirviendo durante 15 minutos, o hasta que estén tiernas. Escurrir en un colador, volcar en la cacerola y cortar en pedazos de 3cm / 1¼ con un cuchillo de hoja redonda.", "Derretir la mantequilla y el aceite en una sartén y freír las cebollas suavemente durante 15 minutos, o hasta que estén suaves y doradas. Agregue el ajo y cocine por dos minutos más, revolviendo regularmente.", "Precalentar el horno a 200C / 180C (ventilador) / Gas 6.", "Agregue las cebollas y el ajo a las papas y espolvoree con 100 g / 3½ oz del queso y el perejil. Agregue las hojas de espinaca y sazone con nuez moscada, sal y pimienta negra recién molida. Mezcle todos los ingredientes hasta que estén bien combinados.", "Vierta la mezcla de relleno en la caja de pastelería. Vierta sobre la crema y permita que rocíe entre las capas. Espolvoree el queso restante en la parte superior. Coloque la lata en una bandeja para hornear y hornéela en el horno durante 40-45 minutos, o hasta que la masa esté crujiente y dorada.", "Deje que la tarta se enfríe en la lata durante 10 minutos. Retire la tarta de la lata y colóquela en un plato para servir. Cortar en cuñas gruesas con un cuchillo afilado."], "url": "www_bbc_co_uk_food_recipes_deep-filled_homity_pie_48616", "title": "Pastel de homosexualidad lleno de relleno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/deep-filled_homity_pie_48616_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "1 cucharadita de azúcar en polvo", "125g / 4½oz de mantequilla fría, cortada en cubos", "1 huevo de gallinas camperas, golpeado", "50g / 1¾oz de harina de maíz", "350ml / 12fl oz de agua fría", "200 g / 7 oz de azúcar en polvo", "4 limones, ralladura y jugo", "1 huevo de gallinas camperas más 3 yemas de huevo de gallinas camperas", "3 huevos blancos de gallinas camperas", "175g / 6oz de azúcar en polvo", "½ cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata de flauta acanalada de 20cm / 8in.", "Para hacer la masa, coloque la harina, el azúcar y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a finas migas de pan. Con el motor en marcha, agregue gradualmente el huevo batido y mezcle hasta que la mezcla forme una bola. No mezcle demasiado o la masa será dura.", "Incline sobre una tabla enharinada, amasar brevemente, luego extender hasta un grosor de 5 mm / ¼ pulgada, volteando la masa y enharinando la superficie con regularidad. Úselo a una línea la lata de flan preparada. Recorte los bordes con cuidado, pinche la base ligeramente con un tenedor y enfríe la masa durante 30 minutos.", "Mientras la masa está en reposo, haga el relleno. Ponga la harina de maíz en un tazón pequeño y mezcle con suficiente agua fría para hacer una pasta fina y déjela a un lado. Vierta el agua restante en una cacerola grande y agregue el azúcar, la ralladura de limón y el jugo. (Debe tener alrededor de 225 ml / 8 fl oz zumo de limón). Calentar suavemente hasta que el azúcar se disuelva y llevar a ebullición. Reduzca el fuego levemente y agregue rápidamente la mezcla de harina de maíz; la salsa debe espesarse inmediatamente.", "Cocine a fuego lento durante tres minutos, revolviendo hasta que espese y brillante. Retirar del fuego y enfriar durante cinco minutos. Batir las yemas de huevo con el huevo entero hasta que quede suave, luego batir vigorosamente en la salsa. Dejar enfriar por 25 minutos.", "Coloque la caja de repostería en una bandeja de horno resistente, forrada con papel de hornear arrugado y rellene con alubias para hornear. Hornee a ciegas por 15 minutos, luego saque cuidadosamente del horno y retire el papel y los frijoles. Vuelva al horno durante 3-4 minutos más hasta que la superficie de la masa esté seca. Retire del horno y reduzca la temperatura a 150 ° C / 300 ° F / Gas 2.", "Para el relleno de merengue, bata las claras de huevo en un tazón grande hasta que estén firmes y luego bata gradualmente la mitad del azúcar. Agregue el extracto de vainilla y mezcle con el azúcar restante.", "Revuelva el relleno de limón enfriado y vierta en la caja de pastelería. Cubra muy suavemente con grandes cucharadas de crema de merengue, empezando por los lados y luego en el medio, y suavemente gire la parte superior. Hornee durante 25 minutos o hasta que el merengue esté listo y ligeramente dorado. Deje que se enfríe antes de quitarlo de la lata."], "url": "www_bbc_co_uk_food_recipes_deep-filled_lemon_50034", "title": "Pastel de merengue de limón relleno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]