[{"isVegetarian": false, "title": "Crisp parma ham, rocket and croûton salad with gorgonzola dressing", "url": "www_bbc_co_uk_food_recipes_crispyparmahamrocket_86216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices parma ham", "olive oil", "2 slices white bread, crusts removed, cubed", "salt and freshly ground black pepper", "50g/2oz gorgonzola", "3 tbsp olive oil", "½ lemon, juice only", "freshly ground black pepper", "2 handfuls rocket, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the parma ham slices into a hot frying pan and fry for 1-2 minutes until crisp. Remove from the pan and set aside. Add a splash of olive oil to the pan, add the cubed bread, season with salt and freshly ground black pepper and fry for three minutes, or until crisp and golden.", "For the dressing, place the gorgonzola, oil, lemon juice and a good grinding of black pepper into a food processor and blend until smooth.", "To serve, pile the rocket on a serving plate, top with the croutons and parma ham slices and pour over the dressing."]}, {"isVegetarian": true, "title": "Crisp noodles with soy sauce and chilli", "url": "www_bbc_co_uk_food_recipes_crispynoodleswithsoy_84535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz thin rice noodles", "300ml/10½fl oz vegetable oil", "½ red chilli, seeds removed and roughly chopped", "1 garlic clove, roughly chopped", "5 tbsp chopped fresh coriander", "2 tbsp chopped cashew nuts", "2 tbsp sesame oil", "½ red chilli, seeds removed and finely chopped", "2 tsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the noodles, heat the oil in a deep, heavy-bottomed saucepan until a breadcrumb sizzles and turns golden brown in it. (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Lower the noodles into the hot oil and deep-fry until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper.", "For the pesto, place all of the pesto ingredients into a food processor and blend until smooth.", "To serve, place the crisp noodles into a bowl, add the chilli and soy sauce and mix well. Add a spoonful of pesto and serve."]}, {"isVegetarian": false, "title": "Crispy parmesan chicken with soft basil tomatoes", "url": "www_bbc_co_uk_food_recipes_crispyparmesanchicke_78047", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispyparmesanchicke_78047_16x9.jpg", "ingredients": ["4 chicken breasts, skinless", "salt and pepper", "flour, for dusting ", "75g/3oz fresh white breadcrumbs ", "50g/2oz finely grated Parmesan cheese", "2 free-range eggs, beaten", "olive oil, for cooking ", "large knob of butter", "6 tomatoes, halved", "1-2 cloves of garlic, thinly sliced ", "coarse sea salt", "handful of fresh basil leaves", "4 wedges of lemon"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken breasts between cling film sheets and lightly bat, until about half to one centimetre/quarter to half an inch thick.  Season with salt and freshly ground black pepper. Dust in flour to coat thoroughly, tapping away any excess.", "Mix together the breadcrumbs and parmesan.", "Dip the flattened chicken breasts (escalopes) in the beaten egg, followed by the Parmesan breadcrumbs.", "Heat some olive oil with the butter in a large frying pan.  Once sizzling, add the crumbed escalopes and cook for three to four minutes on each side until crispy and golden.", "For the soft basil tomatoes, preheat the grill and put the tomato halves on a baking tray, topping each with a slice of garlic.  Season with a good twist of fresh black pepper and a sprinkling of sea salt. ", "Drizzle with olive oil and grill until just overdone, their softness providing the escalopes with a sauce to dip into.", "Tear the basil leaves and scatter them over the tomatoes with a drizzle of olive oil.", "Serve the escalopes on a warm plate with the soft basil tomatoes and a wedge of lemon."]}, {"isVegetarian": false, "title": "Crispy pork salad", "url": "www_bbc_co_uk_food_recipes_crispyporksalad_80912", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "70g/3oz pork mince", "1 tsp ground cumin", "½ tsp chilli flakes", "2 limes, juice only", "pinch sea salt", "2 tbsp chopped coriander", "handful each of basil, coriander, parsley and dill", "oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork, heat the oil in a pan until very hot and add the pork with the spices and lime juice and fry for 8 minutes until golden and crispy.", "Stir through the coriander and take off the heat.", "For the salad, mix together the herbs and drizzle with oil.", "To serve, place the salad on a plate and sprinkle over the pork."]}, {"isVegetarian": false, "title": "Crispy root vegetable skewers", "url": "www_bbc_co_uk_food_recipes_crispyrootvegetables_10294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large parsnips", "2 sweet potatoes", "1 large celeriac", "1 large potato", "vegetable oil for frying", "salt to season"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the vegetables and discard the skins.", "Using the peeler, peel the vegetables lengthways to make wafer thin vegetable chips.", "Peel the parsnips until you reach the tough inner core. ", "preheat vegetable oil to 175C/325F.", "Thread each of the separate flavours onto the wooden skewers to cover the top 10cm/4in.", "Deep fry each flavour in batches until crisp and golden.", "Drain onto absorbent paper and sprinkle with salt."]}, {"isVegetarian": true, "title": "Crispy potato skins", "url": "www_bbc_co_uk_food_recipes_crispypotatoskins_72318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispypotatoskins_72318_16x9.jpg", "ingredients": ["6 unpeeled potatoes, each about 100g/3½oz", "3 tbsp olive oil", "1 tbsp finely chopped fresh rosemary", "salt ", "freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/392F/Gas 6.  Prick each potato all over and rub with a little of the oil.  Place them directly on the oven shelf and bake for 40-45 minutes until they feel slightly soft when squeezed, then leave to cool.", "Cut each potato in half lengthways and then into quarters.  Scoop out the flesh, retaining for another use such as mash, and leaving a layer of potato at least 5mm/½in thick on the skin.  ", "Brush all over with the remaining oil and arrange in a single layer, skin-side down, on a wire rack set on a roasting tin.", "Season generously and sprinkle over the rosemary.  ", "Bake for 30 minutes, turning half way through, until crisp and golden brown.  Serve hot."]}, {"isVegetarian": false, "title": "Crispy bacon pancakes with honey", "url": "www_bbc_co_uk_food_recipes_crispysmokedbaconpan_83970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "140g/5oz self-raising flour", "50ml/2fl oz milk", "butter, to grease", "2 slices bacon, fried, grilled or baked until crisp.", "1 tbsp honey, to serve"], "serves": "Serves 1-2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Whisk the eggs, flour and milk in a bowl until a smooth and thick batter is formed.", "Grease a hot frying pan with the butter and add two portions of batter to the pan to create thick pancakes. When the surface appears to bubble, turn the pancakes over and cook the otherside for a further minute, or until golden.", "Serve on a warm plate with the crispy bacon alongside and drizzle with honey."]}, {"isVegetarian": false, "title": "Crispy squid with garlic mayonnaise", "url": "www_bbc_co_uk_food_recipes_crispysquidwithgarli_86853", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp cornflour", "2 tbsp semolina or polenta", "1 tsp smoked paprika", "200g/7oz squid (tubes and tentacles) when defrosted, cut into rings", "vegetable oil, for deep-frying", "½ garlic clove, crushed with salt, to taste", "4 tbsp mayonnaise"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the crispy squid, mix the cornflour, semolina or polenta and paprika in a bowl.", "Dip the squid rings and tentacles into the mixture, a few at a time, to coat completely.", "Heat the oil into a deep, heavy-based saucepan until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) When the oil is hot enough, fry the squid in batches for 1-2 minutes, flipping them once, until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "Meanwhile, for the garlic mayonnaise, stir the crushed garlic into the mayonnaise.", "To serve, place the crispy squid onto a serving plate with the mayonnaise in a small bowl alongside."]}, {"isVegetarian": false, "title": "Crisp sweet and sour pork with yam chips", "url": "www_bbc_co_uk_food_recipes_crispysweetandsourpo_84632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "100g/3½oz plain flour", "salt and freshly ground black pepper", "75ml/2½fl oz sparkling mineral water", "100g/3½oz pork fillet, cut into strips", "1 tbsp clear honey", "1 ½ tbsp tomato ketchup", "½ lemon, juice only", "1 tomato, chopped", "½ mango, chopped", "2 tbsp coriander, chopped", "vegetable oil for deep frying", "½ yam, peeled", "salt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half fill a heavy-bottomed saucepan of sunflower oil and heat until a breadcrumb sizzles and turns golden when added (CAUTION: Hot oil can be dangerous. Do not leave unattended). ", "For the sweet and sour pork, place the flour, salt and freshly ground black pepper into a large bowl and gradually add the sparkling water while whisking.  Whisk the ingredients until the mixture is the consistency of single cream.", "Dip the pork strips in the batter and gently shake off the excess mixture.", "Add the pork strips in batches of two or three to the hot vegetable oil. Cook for three minutes or until golden-brown and cooked through. Remove the strips from the oil with a slotted spoon and drain on kitchen paper.", "Heat a separate saucepan and add the honey, ketchup, lemon juice, tomato and mango and cook for two minutes while stirring, until combined and warmed through. Pour the mixture over the pork and stir in the chopped coriander.", "For the yam chips, reheat the saucepan filled with sunflower oil until a breadcrumb sizzles and turns golden when added (CAUTION: Hot oil can ve dangerous. Do not leave unattended). 7. Slice the yam into thin strips using a mandolin. Rinse the strips under cold water and pat dry with kitchen paper. ", "Add the strips to the hot oil and cook for five minutes or until golden-brown and cooked through. Remove the strips from the oil with a slotted spoon and drain on kitchen paper. Season with salt, to taste.", "To serve, place the pork onto a clean plate and arrange the yam chips alongside."]}, {"isVegetarian": false, "title": "Crispy Thai turkey salad", "url": "www_bbc_co_uk_food_recipes_crispythaiturkeysala_78585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chilli, de-seeded and finely chopped", "½ leek, finely chopped", "3 garlic cloves, chopped", "1 bunch coriander root, chopped", "zest of 1 lime", "1 tsp cumin", "1 tsp fish sauce (nam pla)", "200g/7oz turkey mince", "2 tbsp oil", "1 tbsp curry paste (see above)", "salt and freshly ground black pepper", "½ mango, sliced", "½ red chilli, de-seeded and sliced", "1 garlic clove, sliced", "1 baby gem lettuce, broken up", "handful fresh coriander", "handful fresh basil", "handful fresh mint", "juice of 1 lime", "1 tsp sugar", "1 tsp soy sauce", "2 tsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry paste, use a mini food processor to blend together all of the paste ingredients.", "For the turkey, heat the oil in a wok over a high heat and then add the turkey mince, cooking for about 5 minutes, until golden and becoming crisp.", "Add one tablespoon of the curry paste and season to taste with salt and freshly ground black pepper. Stir well to coat and heat through. Set aside.", "For the salad, mix together the ingredients in a bowl and divide between two plates.", "For the dressing, mix together all of the ingredients.", "Toss the dressing with the crispy turkey and serve on the salad."]}, {"isVegetarian": true, "title": "Crisp tofu with chilli, garlic, spinach and soy mushrooms", "url": "www_bbc_co_uk_food_recipes_crispytofuwithchilli_84493", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz vegetable oil, for deep frying", "100g/3½oz tofu, cut into cubes", "50g/1¾oz plain flour", "½ tsp cayenne pepper", "½ tsp turmeric", "½ tsp ground coriander", "½ tsp ground ginger", "½ tsp curry powder", "1 tbsp vegetable oil", "2 garlic cloves, chopped", "½ mango, sliced", "2 red bird's eye chillies, sliced", "3 mushrooms, sliced", "2 tsp soy sauce", "½ lime, juiced", "½ tbsp sesame oil", "100g/3½ oz baby spinach"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the crisp tofu, heat the vegetable oil in deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it. (CAUTION: Hot oil is very dangerous. Do not leave unattended).", "Place the flour and spices into a bowl season with salt and freshly ground black pepper and mix well. ", "Place the tofu into the spice mix and coat the tofu cubes.", "Carefully lower the tofu into the hot oil and deep-fry until crisp and golden. Remove with a slotted spoon and drain on kitchen paper.", "For the mushrooms, heat the oil in a frying pan over a medium heat. Add the garlic, mango, half of the chilli and the sliced mushrooms. Mix well and cook for one minute. ", "Add the soy sauce, lime juice and sesame oil and cook for another minute. Add the spinach, stir well and season with salt and black pepper.", "To serve, place the mushroom mixture onto a serving plate and top with the tofu. Garnish with the sliced chilli."]}, {"isVegetarian": true, "title": "Crispy tomato and mozzarella cakes", "url": "www_bbc_co_uk_food_recipes_crispytomatoandmozza_85087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "450g/1lb Arborio rice, rinsed and drained", "splash white wine", "850ml/1½ pints vegetable stock, warm ", "100g/3½oz sun-dried tomatoes, chopped", "2 tbsp double cream", "salt and freshly ground black pepper", "vegetable oil, for deep-frying ", "150g/5½oz mozzarella, cut into cubes", "plain flour, for dredging", "1 free-range egg, beaten", "150g/5oz fresh breadcrumbs", "rocket leaves, drizzled with olive oil, to serve"], "serves": "Makes 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Melt the butter in a large, heavy-bottomed pan. Add the rice and cook on a low heat for a couple of minutes. When the rice starts to become translucent around the edges, add the wine and cook for one minute.", "Add a ladleful of warm stock (it must be warm to enable the rice to cook properly) and stir well. When the stock has been absorbed by the rice, add another ladleful of stock and stir again until absorbed. Continue adding stock in this way until all the stock has been added and/or the rice is tender.", "Add the sun-dried tomatoes and the cream and stir. Season, to taste, with salt and freshly ground black pepper, then remove from the heat and allow the risotto to go cold.", "Heat the vegetable oil in a deep heavy-bottomed saucepan until a breadcrumb sizzles and turns brown in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Divide the cold risotto into six and roll into balls. The rice should be quite sticky. Make a hole in the centre of each ball with your finger and press some of the mozzarella into it. Reform the rice ball to cover over the cheese, then flatten slightly into a patty shape.", "Dredge the patties in the flour, then dip into the beaten egg, then finally into the breadcrumbs. Repeat the dipping into the egg and the breadcrumbs to ensure the rice patties are thoroughly coated.", "Carefully place the patties into the hot oil and deep fry for 4-5 minutes or until crisp and golden. Remove with a slotted spoon and drain on kitchen paper.", "To serve, place a tomato and mozzarella cake into the centre of six plates with a small handful of rocket leaves drizzled with olive oil placed alongside."]}, {"isVegetarian": true, "title": "Crisp tortillas with cinnamon sugar", "url": "www_bbc_co_uk_food_recipes_crispytortillaswithc_84254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz vegetable oil for deep frying", "1 tsp cinnamon", "2 tsp caster sugar", "2 ready-made flour tortillas, cut into 1cm/½in strips", "1 tbsp Greek yoghurt, to serve (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it (CAUTION: Hot oil is very dangerous. Do not leave unattended).", "Mix the cinnamon and sugar together in a bowl.", "Carefully lower the tortilla ribbons into the hot oil and deep-fry until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper. Sprinkle with the cinnamon sugar while still hot.", "Serve piled up in a bowl with a spoon of yoghurt on top"]}, {"isVegetarian": true, "title": "Crème brûlée with sugared almonds and a rhubarb purée", "url": "www_bbc_co_uk_food_recipes_crme_brle_with_sugared_29116", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 large free-range eggs", "115g/4oz caster sugar", "2 vanilla pods, seeds only", "250ml/9fl oz whole milk", "750ml/25fl oz double cream", "55g/2oz demerara sugar", "1 egg white ", "550g/1lb 4oz whole almonds ", "200g/7oz caster sugar ", "¼ tsp sea salt ", "300g/10½oz rhubarb, cut in 2cm/¾in pieces", "1 tbsp caster sugar", "2 blood oranges, juice only"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Using an egg cutter, cut the top off the large eggs and pour out the contents. Dry the egg shells out.", "Put the egg yolks in a bowl, add the caster sugar and vanilla seeds. Whisk together until pale, fluffy and well combined.", "In a small pan, bring the milk and cream to a gentle boil. Gradually pour over the egg mixture. ", "Pour the mix back in the pan and cook until it has thickened, and coats the back of a spoon. Leave aside to cool.", "Carefully ladle the mixture into the dried egg shells. Just before serving sprinkle the demerara sugar on top and carmelise it using a chef's blowtorch. ", "For the almonds, preheat the oven to 130C/110C Fan/Gas 1 and line a baking tray.", "Lightly beat the egg white with 1 tablespoon water. Add the almonds and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on the tray.", "Cook for 1 hour in the oven, stirring occasionally, until golden-brown. Leave to cool. ", "Increase the oven temperature to 200C/180C Fan/Gas 6.", "Put the rhubarb in a roasting tin. Sprinkle over the sugar, then drizzle over the juice. Roast the rhubarb in the oven for 8-12 minutes, or until just tender. Leave to cool. Place in a blender and blend until smooth.", "Serve the crème brûlée egg on a serving plate alongside the rhubarb purée and sugared almonds."]}, {"isVegetarian": false, "title": "Crispy tuna fingers with tomato, courgette and olive compôte", "url": "www_bbc_co_uk_food_recipes_crispytunafingerswit_65893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8oz tuna steak", "2 eggs", "100ml/3½fl oz milk", "225g/8oz flour", "110g/4oz breadcrumbs", "1 lime, grated zest only", "1 tsp dried oregano", "pinch of salt", "4 tbsp vegetable oil", "4 tomatoes, roughly chopped ", "225g/8oz courgettes, diced", "75ml/3fl oz olive oil", "1 small red onion, roughly chopped", "1 clove garlic, chopped", "30g/1oz mixed pitted olives, roughly chopped", "1 anchovy fillet, chopped", "½ tbsp white wine vinegar", "bunch of basil", "1 lime, juice only", "salt and pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan and add the onion and garlic and cook until soft.", "Turn up the heat and add the courgettes and cook for a further 2 minutes.", "Reduce the heat and add the tomatoes, olives, anchovy, vinegar, whole basil leaves, lime juice and seasoning. ", "Stir all the ingredients and reduce the heat to the lowest possible and leave to cook while preparing the fish fingers, stirring occasionally.", "In a bowl crack the eggs and whisk in the milk. ", "In another bowl mix the breadcrumbs, lime zest and oregano. ", "In another bowl place the flour.", "Cut the tuna steaks into fingers", "Coat each piece of fish in the flour, then dip into the egg mixture and finally in the breadcrumbs.", "In a large frying pan heat the vegetable oil over a moderate heat and place the coated fish fingers in the oil. ", "Cook until golden brown on both sides and drain.", "Serve with a large spoonful of compôte and the fish fingers arranged to one side."]}, {"isVegetarian": true, "title": "Crème caramel with biscotti", "url": "www_bbc_co_uk_food_recipes_crme_caramel_with_67126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz caster sugar", "425ml/15fl oz double cream", "1 vanilla pod, split in half lengthways", "4 medium free-range eggs", "250g/9oz plain flour", "250g/9oz caster sugar", "1½ tsp baking powder", "3 medium free-range eggs, lightly beaten", "150g/5½oz dried apricots, chopped", "50g/1¾oz raisins, chopped", "125g/4½oz shelled pistachios ", "50g/1¾oz shelled hazelnuts", "1 lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "For the crème caramels, put 175g/6oz sugar and 3 tablespoons water in a pan and bring to the boil. Cook for 4-5 minutes, or until the sugar is dissolved and turns a caramel colour. (CAUTION: boiling sugar is very hot.) Carefully pour a little of the caramel into the bottom of 4 large ramekins or cups, carefully swirling the caramel up the sides. Set aside to cool and harden.", "Put the cream and vanilla pod in the pan that the caramel was made in and bring to a simmer.", "Place the eggs and remaining 50g/1¾oz sugar in a bowl and whisk together until smooth, then pour the hot cream over, whisking all the time. Pass through a sieve and pour into the caramel-lined ramekins.", "Place the ramekins in a deep roasting tin and pour enough hot water into the roasting tin to come two-thirds of the way up the sides of the ramekins. Bake for 15-20 minutes, or until just set but still have a bit of wobble (the exact time will depend on the size of the ramekins). Remove from the roasting tin and allow to cool completely before placing in the fridge to chill for 1-2 hours.", "For the biscotti, preheat the oven to 180C/160C Fan/Gas 4 and line a baking tray with baking parchment.", "In a large bowl, mix the flour, sugar and baking powder. Add half the beaten eggs and mix well, then add half of what's left and mix again. Stir in the remaining eggs a little at a time until the dough takes shape but isn't too wet (you may not need all the eggs.) Work in the fruit, nuts and lemon zest until well combined.", "Divide the dough equally into six pieces. Wet your hands and roll each piece into a sausage shape about 5cm/2in wide and place well apart on the baking tray. ", "Lightly flatten the 'sausages' and bake for about 20 minutes, or until golden-brown. Remove from the oven and leave to cool and harden for 10 minutes.", "Using a serrated knife, cut the 'sausages' on an angle into very thin slices and lay them cut-side down on the baking tray. (You may need another baking tray, or to do the next step in batches.)", "Return the biscuits to the oven and bake for 8 minutes, then turn the slices over and cook for a further 8-10 minutes, or until they are a pale golden colour. Remove from the oven and cool on wire racks. When completely cold, the biscotti can be stored in airtight jars for a week.", "To serve, turn the crème caramels out onto serving plates and place the biscotti alongside."]}, {"isVegetarian": true, "title": "Croissants", "url": "www_bbc_co_uk_food_recipes_croissants_91574", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["625g/1lb 5oz strong white flour, plus extra for rolling out", "12g/½oz salt", "75g/3oz sugar", "20g/¾oz dried yeast", "500g/1lb 2oz butter, chilled", "8 sticks chocolate (optional)", "1 free-range egg, beaten"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Place the flour, salt, sugar and yeast in a large mixing bowl. Using a wooden spoon, slowly mix in a little water until the mixture forms into a pliable dough. ", "Place the dough on a floured surface and knead until it feels elastic. ", "Return the dough to the bowl, cover and chill in the refrigerator for an hour. ", "Return the chilled dough to your floured work surface and roll it into a rectangle, around 60x30cm/24x12in. ", "Roll out the chilled butter into a rectangle about 1cm/½in thick, around 20x30cm/8x12in. ", "Place the butter rectangle in the centre of the dough rectangle, so it covers the middle third of the dough.", "Fold each side of the dough over the butter, so there is one layer of dough on the bottom, a layer of butter, then two layers of dough.", "Wrap the dough in cling film and chill in the fridge for another hour. ", "Lightly flour the worktop and roll out the dough to a rectangle, around 60x30cm/24x12in. Repeat the folding process, folding the long sides into the middle, then return the dough to the fridge for a further hour. ", "Repeat this process of folding and chilling two more times, then wrap the dough in cling film and set it aside to rest overnight. ", "Using a rolling pin, roll out the rested dough to 3mm/1/8in thick. ", "Either use a croissant cutter to cut triangles or cut the rolled out dough into squares, each 20cm/8in square. ", "Cut each square diagonally, making two triangles. ", "Place the dough triangles on a lightly floured surface with the right angle away from you. ", "Roll the croissant towards the right angle point and curl the dough roll around into a traditional crescent shape. If using chocolate, add the chocolate across the widest part of the triangle, before rolling it up.", "Place the shaped croissants on baking trays lined with baking parchment and leave to rise for 1½ hrs. ", "Preheat the oven to 200C/425F/Gas 6. ", "Lightly egg-wash the croissants and bake for 10-15 minutes until golden brown."]}, {"isVegetarian": false, "title": "Crab rarebit with fries and a Little Gem salad", "url": "www_bbc_co_uk_food_recipes_cromercrabrarebitwit_87267", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 small whole crabs, cooked", "35g/13oz Montgomery cheddar cheese, grated", "3 tbsp milk", "25g/1oz breadcrumbs", "25g/1oz flour", "dash of Worcestershire sauce", "1 free-range egg", "1 free-range egg yolk", "½ tsp English mustard powder", "25g/1oz butter, melted", "salt and freshly ground black pepper", "vegetable oil, for deep frying", "2 large chipping potatoes, peeled and cut into fries", "2 Little Gem lettuces, leaves only", "2 tbsp extra virgin olive oil", "½ lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Open the crabs, remove all the white and brown meat and place in a bowl. Feel for any small pieces of broken shell and remove from the meat. Wash the main shells of the crabs thoroughly and pat dry using kitchen paper.", "Use a fork to gently mash together the brown and white crabmeat. Season with salt and pepper and spoon the crabmeat back into the clean shells.", "To make the rarebit sauce, place the cheese and milk into a small saucepan and heat, stirring occasionally to prevent it catching, until the cheese is melted. Add the breadcrumbs and flour and cook for 2-3 minutes, stirring all the time to prevent any lumps forming.", "Remove from the heat and allow to cool. Add the Worcestershire sauce, whole egg, egg yolk and the mustard powder. Mix thoroughly and season, to taste, with salt and pepper. Set aside while you make the fries.", "Preheat the deep-fat fryer to 180C. (CAUTION: hot fat can be dangerous. Do not leave unattended.)", "Drop the fries into the hot fat and cook for 3 minutes, or until golden-brown and crisp. Drain on kitchen roll and season with salt.", "For the crab rarebit, preheat the grill to high.", "Place the filled crab shells on a baking tray. Spoon the rarebit sauce over the top of the crabmeat. Drizzle a little melted butter over the top and place under the hot grill for a few minutes until the rarebit is bubbling and golden-brown.", "When ready to serve, dress the Little Gem leaves with the olive oil and lemon juice.", "Serve the crab rarebit in the shells with the salad and fries alongside."]}, {"isVegetarian": false, "title": "Croque monsieur kites", "url": "www_bbc_co_uk_food_recipes_croque_monsieur_kites_99020", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/croque_monsieur_kites_99020_16x9.jpg", "ingredients": ["olive oil, for greasing ", "500g/1lb 2oz strong white flour, plus extra for dusting ", "10g/¼ oz fast-action yeast ", "10g/¼oz salt ", "80g/2¾oz caster sugar", "2 medium free-range eggs", "125ml/4½oz full-fat milk, heated until tepid", "250g/9oz unsalted butter, chilled", "25g/1oz unsalted butter", "2 tbsp plain flour", "250ml/9fl oz full-fat milk ", "1 tbsp wholegrain mustard", "salt and freshly ground black pepper", "½ tbsp olive oil", "25g/1oz unsalted butter", "200g/7oz mixed mushrooms, thinly sliced ", "200g/7oz pancetta, 12 rashers left whole, the rest sliced into small pieces", "2 sprigs fresh thyme, leaves picked", "1 tsp finely chopped garlic", "1 tsp porcini powder (you can make your own by pulsing dried porcini mushrooms in a food processor)", "150g/5½oz gruyère, grated", "75g/2½oz emmental, grated ", "1 medium free-range egg, beaten with 2 tsp milk"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, set up a freestanding mixer with a dough hook attachment and grease a large bowl with a little olive oil.", "Add the flour, then put the yeast to one side of the bowl and the salt and sugar on the opposite side. ", "In a jug, mix the eggs, milk and 4 tablespoons water. Pour into the flour mixture and mix on a low speed for 2 minutes (you may need to push the dough down the hook occasionally). Increase the speed to medium and mix for a further 6 minutes.", "Lightly flour a work surface and tip out the dough. Shape the dough into a smooth ball. Transfer to the oiled bowl and cover either with a clean tea towel or oiled cling film. Leave to prove for an hour or until doubled in size. ", "Meanwhile, flatten the butter into a rectangle about 1cm/½in thick. Place between 2 pieces of baking paper and store in the fridge until needed. ", "Flour the work surface again, then tip out the risen dough. Flatten it and roll it out to a rectangle about 40x15cm/16x6in and about 1cm/½in thick. Arrange the dough with one of the short edges nearest to you. Lay the butter in the middle of the dough, fold the dough over the butter in the middle so the dough overlaps slightly. Pinch all the edges to seal the butter in pastry. Place in a plastic food bag and chill in the freezer for 10 minutes.", "Place the chilled dough on a lightly floured work surface with one of the short edges nearest you.  Roll out the dough into a 40x15cm/16x6in rectangle and fold into three layers (like a letter). Place in a plastic bag in the freezer for 10 minutes. Repeat the rolling and folding as before, then return to the freezer for another 10 minutes. Repeat the rolling and folding one final time, then chill the dough for 30 minutes in a plastic bag in the fridge.", "Meanwhile, for the béchamel sauce, in a heavy-bottomed saucepan, melt the butter over medium heat. Add the flour and stir constantly for about 3 minutes, until completely smooth. Pour in the milk in a thin, steady stream, whisking all the time, and cook the sauce for about 5–10 minutes, or until smooth and thickened. Remove from the heat and stir in the mustard, taste and season with salt and pepper.", "Add a third of the grated cheeses (from the savoury filling ingredients) and mix until the cheese has melted and the sauce smooth. Cover the surface of the sauce with cling film to prevent a skin forming and set aside to cool.", "For the filling, heat the olive oil and butter in a saucepan over a medium heat. Once hot, add the mushrooms, sliced pancetta and thyme and fry for about 3-5 minutes. Add the garlic and porcini powder and fry for another 3 minutes. Season with salt and pepper then leave to cool.", "Preheat the oven to 220C/200C Fan/Gas 7.", "To assemble, roll out the dough until 5mm/¼in thick and place on a large baking tray. Chill in the fridge for 15 minutes to allow the dough to rest and firm up. Re-roll if necessary until the dough is 30x40cm/12x16in. Using a sharp knife cut into twelve 10cm/4in squares.  ", "Leaving a 1cm/½in border, cut a 4cm/1½in square from the middle of each square – cutting right through two opposite corners of the inner square, but leaving the other two corners just connected either side of the corner points. Brush the inside square with a little egg wash. Fold the border strip corner to corner, pulling one over the other and pressing onto opposite corner of the inner square, then repeat with the other side (watch Paul Hollywood making them toward the end of the technique video below – it’s easy when you’ve seen it done). Brush the whole pastry with egg wash.", "In the middle of each pastry place a few spoonfuls of the mushroom pancetta filling. Lay a rasher of pancetta across each one, crinkled up, then cover with 1-2 teaspoons béchamel sauce. Sprinkle with the remaining gruyère and emmental, then season with black pepper.", "Bake for 20–25 minutes, or until the pancetta is cooked and the pastry crisp and golden-brown. Cool a little on wire racks, the pastries can be eaten warm or cold."]}, {"isVegetarian": false, "title": "Dolcelatte croque monsieur", "url": "www_bbc_co_uk_food_recipes_croquemonsieur_86892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices ciabatta, crusts removed", "25g/1oz butter, softened", "2 slices prosciutto", "5 fresh basil leaves", "85g/3oz Dolcelatte, crumbled", "1 Little Gem lettuce, chopped", "dash olive oil", "dash balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the ciabatta bread slices on a flat surface, spread one side with butter and turn over, butter-side down. ", "Top with prosciutto, basil and Dolcelatte, then place the other slice of bread on top, butter-side up. ", "Heat a non-stick frying pan, add the sandwich and pan fry for three minutes on each side. Transfer to a plate and cut into triangles.", "For the salad, mix the Little Gem lettuce, olive oil and balsamic vinegar in a small bowl.", "To serve, pile the Little Gem lettuce mixture onto a serving plate, top with the croque monsieur and serve immediately."]}, {"isVegetarian": false, "title": "Croque monsieur", "url": "www_bbc_co_uk_food_recipes_croquemonsieur_90049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/croquemonsieur_90049_16x9.jpg", "ingredients": ["4 slices wholemeal bread", "2 tsp Dijon mustard", "80g/3oz grated Gruyère cheese", "2 slices ham", "30g/1½oz unsalted butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Spread half a teaspoon of mustard over each slice of bread. Top two of the slices with half of the grated cheese followed by a slice of ham each, then finish with the remaining cheese on top. Sandwich together with the other two slices of bread. ", "Heat the butter in a large frying pan until foaming, then add the sandwiches and fry for 1-2 minutes on each side, or until golden-brown. ", "Transfer the sandwiches to a baking tray and place into the oven for 4-5 minutes, or until the cheese has melted. ", "Place the sandwiches on a serving plate, slice each sandwich in half and serve immediately."]}, {"isVegetarian": true, "title": "Crostini with pepper and dolcelatte", "url": "www_bbc_co_uk_food_recipes_crostiniwithpepperan_84561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices ciabatta, cut on a diagonal", "1 tbsp olive oil", "3 roasted red peppers from a jar, drained", "55g/2oz dolcelatte cheese, sliced ", "1 sprig fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the ciabatta with olive oil and toast on both sides in a hot griddle pan.", "Remove the ciabatta. Add the peppers to the griddle pan and chargrill for 1-2 minutes on each side.", "Transfer the toasted bread to a baking sheet. Top with the griddled peppers and the dolcelatte. Transfer to the oven and bake for five minutes, or until the cheese has melted.", "To serve, place on a plate and garnish with parsley sprig."]}, {"isVegetarian": true, "title": "Croustade with caramelised oranges", "url": "www_bbc_co_uk_food_recipes_croustadewithcaramel_85495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "1 vanilla pod, split", "2 oranges, peeled and segmented", "2 free-range egg whites, lightly whisked", "55g/2oz butter, melted", "3-4 sheets ready-made filo pastry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the sugar in a small ovenproof frying pan until melted. Add the vanilla pod and cook until the sugar is a deep caramel colour. Add the orange segments and stir to coat. Remove the vanilla pod (it can be used again in another dish).", "Place the egg whites and melted butter into a bowl and mix well. Brush this mixture over each sheet of pastry. Scrunch up the pastry sheets and place on top of the caramelised orange mixture.", "Transfer to the oven and bake for 5-6 minutes, or until the pastry is crisp and golden-brown.", "To serve, place the croustade into a serving dish."]}, {"isVegetarian": true, "title": "Crown layered pavlova", "url": "www_bbc_co_uk_food_recipes_crown_layered_pavlova_80809", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crown_layered_pavlova_80809_16x9.jpg", "ingredients": ["6 free-range egg whites", "pinch salt", "350g/12oz caster sugar ", "2 tsp cornflour", "1 tsp white wine vinegar", "600ml/20fl oz double cream, whipped until soft peaks form when the whisk is removed", "250g/9oz strawberries, hulled", "250g/9oz blueberries ", "crystallised flowers, to decorate (see Top recipe tip below)", "icing sugar, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Draw two 20cm/8in circles and a 15cm/6in circle on greaseproof paper and place onto three separate baking trays.", "Whisk the egg whites and salt in a large clean dry bowl until they form soft peaks when the whisk is removed. Slowly whisk in the sugar and continue to whisk until the egg whites are stiff and glossy. Whisk in the cornflour and vinegar.", "Spoon one-third of the mixture onto one of the 20cm/8in circles. Spoon another third onto the other 20cm/8in circle.", "Spoon half of the remaining mixture onto the 15cm/6in circle.  Pipe the remaining meringue around the edge of the 15cm/6in circle in a crown shape.", "Reduce the oven to 140C/275F/Gas 1 and bake the meringues for 1-1¼ hours, or until the meringue is crisp outside, but feels soft yet set inside. (If you notice that the different meringues are not cooking evenly, swap the shelves.) Switch off the oven and leave the meringue to cool down in the oven.  ", "To assemble the pavlova, carefully peel the greaseproof paper off the bottom of the meringues. Place a 20cm/8in meringue onto a large, flat serving plate. Spread one-third of the double cream onto the meringue and top with some of the strawberries and blueberries. Top with the other 20cm/8in meringue. Spread another third of the cream onto the meringue and top with more strawberries and blueberries. Top with the 15cm/6in meringue and fill with the remaining cream, strawberries and blueberries. Decorate with the crystallised flowers and dust with icing sugar."]}, {"isVegetarian": false, "title": "Crêpes with clementines and brandy butter", "url": "www_bbc_co_uk_food_recipes_crpes_with_clementines_74432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["280g/10oz brandy butter", "25g/1oz caster sugar, plus extra for serving", "2 oranges, zest and juice only", "2 tbsp of brandy, plus extra for serving", "2 clementines, peeled and segmented", "12 readymade crêpes or thin pancakes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large sauté pan, combine 85g/3oz of the brandy butter with the sugar, juice, zest, brandy and clementines. Gently heat for a few minutes to thicken the liquid.", "Remove the fruit and set them aside for serving. Add the pancakes one by one, folding each into quarters as you go. When the pancakes are warm transfer to a serving dish.", "Melt the remaining brandy butter in the pan. Whisk it into the sauce then pour over the pancakes.", "To serve, sprinkle the pancakes with a little more sugar, add the clementines and douse in more brandy. For a finishing touch, set fire to it just before serving."]}]