[{"ingredients": ["1 cucharada de aceite de oliva extra virgen", "2 pechugas de pollo pequeñas, deshuesadas y sin piel (cada una de aproximadamente 150 g / 5½ oz), en rodajas", "1 cebolla, finamente rebanada", "1 pimiento amarillo, sin semillas, cortado en pedazos de 4cm / 1½ pulgadas", "1 calabacín, cortado, reducido a la mitad longitudinalmente y cortado en rebanadas de 1cm / ½", "100g / 3½oz de cocción de chorizo, en rodajas", "100 ml / 3½ fl oz de vino tinto", "400g de tomates cortados en lata", "400 g de judías de hojalata, escurridas y enjuagadas", "1 cucharada de puré de tomate", "1 cucharadita de orégano seco", "½ cucharadita de hojuelas de chile seco", "1 cubo de caldo de pollo", "160g / 5¾oz de arroz de grano largo", "175 g / 6 oz de judías verdes, recortadas (opcional)", "perejil de flatleaf fresco picado, para adornar", "sal marina y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande y antiadherente o en una sartén. Agregue el pollo y sazone con la pimienta. Freír durante 2 minutos, revolviendo regularmente.", "Transfiera el pollo a un plato con una cuchara o espátula ranurada y agregue la cebolla, el pimiento, el calabacín y el chorizo ​​a la sartén. Freír a fuego medio-alto durante 3 minutos, revolviendo regularmente.", "Agregue el vino, los tomates, las habas de mantequilla, el puré de tomate, el orégano, los copos de chile y el cubo de caldo de pollo a la sartén. Vuelva a llenar la lata de tomate con agua fría, vierta en la mezcla de tomate y revuelva. Sazonar con un poco de sal y pimienta.", "Llevar la salsa a ebullición, devolver el pollo a la sartén y hervir a fuego lento durante 8-10 minutos, o hasta que el pollo esté tierno y cocido y la salsa se haya espesado.", "Mientras tanto, medio llenar una olla grande con agua y llevar a ebullición. Agregue el arroz y cocine a fuego lento durante 10-12 minutos, o hasta que esté cocido.", "Coloque las judías verdes, si las usa, en una olla pequeña de agua hirviendo y cocínelas durante 5-6 minutos o hasta que estén tiernas. Escurra los frijoles y el arroz y reserve.", "Adorne con el perejil y sirva inmediatamente con las judías verdes y el arroz al lado."], "url": "www_bbc_co_uk_food_recipes_easy_spanish_chicken_09987", "title": "Pollo español fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spanish_chicken_09987_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 dientes de ajo grasos, finamente picados", "2 bolsas de 260 g de espinacas baby", "1 litro / 1¾ pintas de caldo de verduras calientes", "4 huevos medianos de granja", "Crema doble de 300 ml / ½ pinta", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite a fuego medio en una olla grande de base pesada. Agregue el ajo y fría por 1 minuto. Agregue la espinaca, unos puñados a la vez, revuelva y cocine durante 2 minutos. Verter en el caldo, llevar a ebullición y cocinar a fuego lento durante 10 minutos.", "Mientras tanto, medio llenar una olla mediana con agua y llevar a ebullición. Rompe los huevos en cuatro tazones pequeños. Baje el fuego para que el agua burbujee muy suavemente. Lentamente agregue los huevos al agua de dos en dos y cocine durante 3 minutos, o hasta que se ponga el blanco, pero la yema permanece líquida.", "Retire la sopa del fuego y blitz con una batidora hasta que quede suave. Regrese al fuego y agregue la crema. Caliente y sazone al gusto con sal y pimienta.", "Divida la sopa entre cuatro tazones para servir y cubra cada uno con un huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_easy_spinach_soup_with_a_85543", "title": "Sopa de espinacas y huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spinach_soup_with_a_85543_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de azúcar demerara, para recubrir los moldes", "200g / 7oz fechas picadas", "½ cucharadita de extracto de vainilla", "50g / 2oz de mantequilla, ablandada, más extra para engrasar los moldes", "175g / 6oz de azúcar moreno oscuro", "1½ cucharadita de jarabe de oro", "1½ cucharadita de melaza negra", "Harina de auto crianza de 200g / 7oz", "2 huevos de gallinas camperas", "1½ cucharadita de bicarbonato de soda", "Crema doble 500ml / 18fl oz", "175g / 6oz demerara azúcar", "175g / 6oz de mantequilla", "1 cucharada de jarabe de oro", "1 cucharada de melaza negra", "helado de vainilla"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Unte con mantequilla ocho cuencos pequeños de budín (moldes de dariole) y espolvoree azúcar demerara en el interior, cubriendo uniformemente. Sacuda el exceso de azúcar de los moldes y colóquelos en una bandeja para hornear.", "Coloque las fechas con 250ml / 9fl de agua en una olla y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos. Retire la sartén del fuego.", "Revuelva el extracto de vainilla en la mezcla de la fecha.", "Mezcle con una batidora hasta que la mezcla de la fecha sea espesa y espesa.", "En un tazón grande, bata la mantequilla y el azúcar mascabado juntos hasta que quede suave.", "Agregue el jarabe y la melaza, luego la harina, mezcle bien.", "Rompe los huevos de a uno por vez en el tazón, revolviendo bien después de cada uno.", "Agregue el bicarbonato de soda a la mezcla de dátiles, luego vierta en la mezcla de harina y bata bien para mezclar.", "Vierta la mezcla en los cuencos de pudín preparados, llenándolos dos tercios llenos.", "Coloque los postres en el horno inmediatamente y hornee por 20 minutos hasta que estén bien levantados y elásticos al tacto.", "Para la salsa, caliente suavemente la crema en una cacerola. Agregue el azúcar y la mantequilla y bata hasta que se derrita. Agregue el jarabe y la melaza.", "Para servir, coloca el pudin en un plato, coloca la salsa sobre la parte superior y alrededor, luego termina con una cucharada de helado."], "url": "www_bbc_co_uk_food_recipes_easy_sticky_toffee_46584", "title": "Fácil pudding de caramelo toffee con salsa de caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_sticky_toffee_46584_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "2 cebollas de primavera, cortadas en longitudes de 4 cm", "1 diente de ajo, aplastado", "1 cm de pieza de jengibre fresco, pelado y rallado", "½ zanahoria, pelada y cortada en cerillas", "½ pimiento rojo, cortado en fósforos gruesos", "50g de maíz dulce, reducido a la mitad", "½ calabacín, cortado en fósforos gruesos", "75 g de arvejas de azúcar o tirabuzón, recortado", "1 cucharada de salsa hoisin", "1 cucharada de salsa de soja baja en sal"], "method": ["Caliente un wok a fuego alto y agregue el aceite. Agregue las cebollas tiernas, el ajo, el jengibre y saltee por un minuto. Agregue las zanahorias, el pimiento rojo y el maíz dulce y saltee durante 2 minutos.", "Agregue el calabacín y los guisantes o mangetout y saltee por 3 minutos más.", "Agregue la salsa de soja y hoisin con una cucharada de agua y cocine a fuego alto durante otros 2 minutos o hasta que todas las verduras estén cocidas pero no demasiado suaves. Sirve con fideos o arroz."], "url": "www_bbc_co_uk_food_recipes_easy_veggie_stir-fry_03446", "title": "Easy veggie stir-fry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de harina blanca fuerte, más extra para dar forma y quitar el polvo", "1 cucharadita de levadura de acción rápida", "1 cucharadita de sal fina", "300ml / 10fl oz de agua tibia", "aceite, para amasar"], "method": ["Coloque la harina, la levadura y la sal en un recipiente, vierta el agua tibia y mezcle todo en una masa viscosa y peluda.", "Raspe la masa de sus manos, cubra el tazón con un paño y déjela durante 10 minutos.", "Engrase ligeramente un área de 30cm / 12in de la superficie de trabajo y sus manos. Incline el recipiente y deje que la masa salga a la superficie engrasada sin demasiados tirones y bromas (un raspador puede ayudar). Engrase ligeramente el interior del tazón también, para evitar que se pegue más tarde. Tome el borde de la masa más alejado de usted con una mano y con un mínimo de tracción, simplemente dóblela para encontrar el borde más cercano a usted. Presione el talón de la otra mano hacia abajo y dentro de la masa, estirándola lejos de usted por 5-10 cm / 2-4 in.", "Dale a la masa un cuarto de vuelta en el sentido de las agujas del reloj y repite la acción de \"doblar hacia ti, luego empuja y estira suavemente lejos de ti\". Haga esta acción de giro, plegado y empuje, no más de 8-10 veces, luego devuelva la masa al tazón. No desea aplanar o rasgar la masa, o manejarla bruscamente: toda la acción debe ser bastante suave y medida. No se sienta tentado a agregar más harina, incluso si la masa parece húmeda; eso es exactamente como debería ser. Repita esta luz amasando dos veces a intervalos de 10 minutos, y finalmente devuelva la masa al bol y déjela para probar durante 45 minutos.", "Limpie la superficie de trabajo, espolvoréelo con harina y luego déle una palmadita en forma de óvalo. Enróllalo bien, dale a cada extremo un pellizco para mantenerlo limpio luego coloca la masa con la punta hacia abajo sobre una bandeja enharinada, cúbrela con un paño y déjala hasta que la masa haya aumentado en tamaño a la mitad, unos 45 minutos.", "Mientras tanto, precaliente el horno a 220C / 425F / Gas 7 (ventilador 200C).", "Harina la parte superior de la masa, cortar una barra en el medio y hornear durante 35-40 minutos."], "url": "www_bbc_co_uk_food_recipes_easy_white_bread_37005", "title": "Pan blanco sencillo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_white_bread_37005_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hígados de pollo de 450 g / 1 lb, recortados", "200g / 7oz de mantequilla, derretida", "Crema doble 50ml / 2fl oz", "1 cucharada de Armagnac o brandy", "sal marina gruesa y pimienta negra recién molida", "puñado de arándanos secos", "8 hojas frescas de laurel", "tostada caliente", "chutney picante"], "method": ["Caliente una sartén de base pesada a fuego medio. Vierta un poco de la mantequilla derretida en la sartén caliente, agregue la mitad de los hígados de pollo y cocine durante tres minutos. Los hígados se deben cocinar por fuera y rosa por el medio. Transfiéralos a un plato y repite con el resto de los hígados.", "Transfiera los hígados de pollo a un procesador de alimentos y mezcle por un minuto más o menos hasta que quede suave. Luego vierta la mantequilla derretida restante y la crema doble y mezcle una vez más. Sazonar con sal y pimienta negra recién molida y luego incorporar el Armagnac.", "Transfiera el paté a ocho moldes pequeños, cubra con film transparente y enfríelo.", "Cuando esté listo para servir, destape los patés y decore con arándanos secos y hojas frescas de laurel para darles una sensación festiva. Sirva con tostadas calientes y chutney picante."], "url": "www_bbc_co_uk_food_recipes_easychickenliverpate_87604", "title": "Paté de hígado de pollo fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easychickenliverpate_87604_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla", "Pasta de tomate 30 g / 1 oz", "1 diente de ajo, aplastado", "½ cucharadita de tomillo, picado", "½ cucharadita de Romero, picado", "Condimento", "tostadas o baguette caliente para servir"], "method": ["Batir la mantequilla con una cuchara de madera hasta que esté suave, y luego agregar los ingredientes restantes y batir hasta que quede suave.", "Alternativamente, agregue todos los ingredientes a un procesador de alimentos y mezcle hasta que quede suave.", "Raspe sobre la película adhesiva o papel de aluminio y ruede para reformar. Refrigere hasta que esté listo para su uso.", "Sirva en la tostada o baguette caliente."], "url": "www_bbc_co_uk_food_recipes_easygarlicbread_72032", "title": "Pan de ajo fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace alrededor de 250 g", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla para engrasar", "50g / 2oz de mantequilla", "Hojas de espinaca bebé 225g / 8oz", "4 cucharadas de tocino, finamente picado", "8 huevos", "4 cucharadas de crema doble", "4 cucharadas de parmesano rallado y gruyere", "4 cucharadas de pan rallado", "hojas de tomillo para adornar"], "method": ["Engrase moldes o tazas de café con mantequilla y colóquelos en la bandeja para hornear.", "Cocine la espinaca en mantequilla, hasta que esté suave, sazone y divida entre los moldes.", "Fría los pedazos de tocino hasta que estén crujientes y divídalos entre los moldes. A continuación, coloque dos huevos en cada molde, cubra con una cucharada de crema, queso parmesano y pan rallado y hornee por 12-15 minutos hasta que estén dorados.", "Adorne con hojas de tomillo y sirva con tostadas en el costado."], "url": "www_bbc_co_uk_food_recipes_easyeggsbenedict_71983", "title": "Huevos cocidos al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 500ml / 18fl oz", "500 ml / 18 fl oz oz yogur", "Mermelada de frambuesa de alta calidad de 450 g / 16 onzas o conservas", "conos, para servir"], "method": ["Mezcle todos los ingredientes anteriores y transfiéralos a un recipiente para congelar.", "Congelar durante aproximadamente cuatro horas o toda la noche. Retire del congelador una hora antes de servir."], "url": "www_bbc_co_uk_food_recipes_easyjamicecream_74647", "title": "Helado de mermelada fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1 tina", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla sin sal", "150g / 5oz de azúcar morena suave", "150g / 5oz pasas de Corinto", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada recién molida", "1 naranja, jugo y ralladura finamente rallada", "Cáscara de cítricos mixta de 50g / 2oz", "Margarina 25-50g / 1-2oz, para engrasar", "1 bloque de hojaldre hecho a mano", "harina, para quitar el polvo", "2-3 cucharadas de leche, para glasear", "azúcar en polvo, para quitar el polvo", "azúcar en polvo, para quitar el polvo"], "method": ["Para el relleno, derrita la mantequilla a fuego lento en una olla pequeña. Una vez derretido, retirar del fuego y agregar todos los ingredientes de relleno restantes hasta que estén bien combinados. Dejar de lado para enfriar.", "Precaliente el horno a 220C / 425F / Gas 7. Engrase una bandeja para hornear con la margarina.", "Para la masa, extienda la masa en una superficie de trabajo ligeramente enharinada hasta un grosor de aproximadamente 3 mm / ⅛ pulg. Con un cortador de 6cm / 2½ pulgadas, corte la masa en rondas.", "Coloque una cucharadita del relleno en el medio de cada ronda, luego cepille los bordes de la mitad de la masa con leche. Traiga la otra mitad de la masa y selle. Traiga las esquinas de la masa hacia arriba en el centro y pellizque para sellar.", "Voltee el paquete de pastelería sellado, de modo que la costura quede debajo, luego extiéndalo suavemente hasta que tenga aproximadamente ½ cm de grosor. Suavemente palmee nuevamente en forma redonda y colóquelo en la bandeja engrasada para hornear.", "Barra cada pastel tres veces con la punta de un cuchillo afilado. Cepille los pasteles con leche y espolvoree con azúcar en polvo.", "Hornee durante 15 minutos, o hasta que la masa esté dorada e hinchada. Transfiera los pasteles a una rejilla de alambre para enfriar.", "Espolvorea los pasteles eccles con azúcar glas antes de servir."], "url": "www_bbc_co_uk_food_recipes_eccles_cakes_72475", "title": "pasteles Eccles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eccles_cakes_72475_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "½ cucharadita de sal", "200g / 7oz de mantequilla fría, en cubos", "½ limón, solo jugo", "115g / 4oz pasas de Corinto", "3 cucharadas de jerez Pedro Ximénez", "botón de mantequilla sin sal", "55g / 2oz de azúcar mascabado ligero", "30g / 1oz de cáscara picada mixta", "½ cucharadita de canela molida", "¼ cucharadita de nuez moscada recién rallada", "¼ cucharadita de jengibre molido", "1 limón, ralladura solamente", "1 cucharadita de jugo de limón", "1 huevo blanco de corral", "un poco de azúcar en polvo"], "method": ["Para la masa, tamice la harina y la sal en un tazón grande y agregue la mantequilla. Mezcle la mantequilla con una cuchara grande de metal para cubrirla de harina. Tenga cuidado de mantener la mantequilla en trozos.", "Mezcle 180-200ml / 6-7fl oz de agua fría y jugo de limón en una jarra y vierta gradualmente en la mezcla de harina y mantequilla.", "Con un cuchillo de punta redonda, corte el contenido del tazón varias veces, girando el tazón continuamente mientras corta la mantequilla en la harina, o hasta que la masa se una. La masa estará muy húmeda en este punto.", "Incline la masa sobre una superficie de trabajo bien enharinada y rápidamente forme un rectángulo de aproximadamente 30x20cm / 12x8 pulgadas.", "Con la masa verticalmente en el tablero frente a usted, doble el tercio inferior de la masa en el tercio central, luego el tercio superior hacia abajo en los otros tercios. Gire la pastelería un cuarto de vuelta y repita el plegado.", "Envuelva la película adhesiva y déjela enfriar en la nevera durante 10 minutos.", "Saca la masa de la nevera y, con un rodillo, rueda hacia el rectángulo estrecho original y repite el plegado, el giro y el resto como antes. Haz esto tres veces en total. No se preocupe si la mantequilla exuda a través de la masa al principio, solo mantenga la tabla y el rodillo bien enharinados.", "Para el relleno, remoje las grosellas en el jerez en un tazón.", "Derrita la mantequilla en una cacerola y mezcle todos los otros ingredientes de relleno, incluidas las grosellas y el jerez. Deja enfriar.", "Para ensamblar, precaliente el horno a 220C / 425F / Gas 7.", "Ruede la masa al grosor de 3 mm. Recortar 6 x 12.5cm / 4¾en rondas. Cubra las rondas con film transparente y deje enfriar en la nevera durante 10 minutos.", "Coloque una buena cucharadita de relleno en el centro de cada ronda de repostería. Tire de la masa alrededor del relleno y apriete para sellar. Recorte cualquier exceso de pastelería. Voltee las bolas y colóquelas en una bandeja para hornear. Aplanar ligeramente con un rodillo hasta que la fruta comience a mostrarse a través de la masa.", "Para ensamblar, en un bol, bata ligeramente la clara de huevo con un tenedor, hasta que quede espumosa. Cepille las partes superiores de los pasteles con esto y espolvoree con azúcar. Con un cuchillo afilado, haga tres pequeños cortes paralelos en la parte superior.", "Hornee durante 20 minutos, o hasta que la masa esté ligeramente dorada e hinchada."], "url": "www_bbc_co_uk_food_recipes_eccles_cakes_75687", "title": "pasteles Eccles", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eccles_cakes_75687_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de colza", "5 cebolletas, en rodajas finas", "1 pimiento rojo, semillas eliminadas y en rodajas finas", "2 dientes de ajo, finamente picados", "1 cabeza de brócoli, cortado en pequeños floretes", "300g / 10½oz de arroz basmati recién hecho, enfriado", "175g / 6oz de guisantes congelados", "3 huevos, ligeramente batidos", "1 cucharada de salsa de soja", "2 cucharaditas de semillas de sésamo tostadas", "sal marina y pimienta negra recién molida"], "method": ["Caliente un wok hasta que esté caliente, luego agregue el aceite. Cuando esté caliente, agregue las cebolletas y el pimiento rojo y saltee durante 1-2 minutos, o hasta que se ablanden. Agregue el ajo y agregue el brócoli con 4 cucharadas de agua, luego hierva y cocine a fuego lento durante 2 minutos, o hasta que el brócoli esté tierno y el agua casi se haya evaporado.", "Agregue el arroz y saltee durante 2-3 minutos, o hasta que esté bien caliente. Agregue los guisantes y cocine por 1 minuto.", "Batir los huevos y la salsa de soja con un tenedor. Agregue la mezcla de huevo al arroz y sofría por 2-3 minutos, o hasta que los huevos se acaban de preparar. Agregue las semillas de sésamo, sazone con sal y pimienta y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_egg-fried_rice_85655", "title": "Arroz con huevo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg-fried_rice_85655_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "8-10 lonchas de tocino rayado ahumado", "9 huevos de gallinas camperas", "4 cucharadas de leche entera", "sal y pimienta negra recién molida", "300g / 10½ oz de harina natural, más extra para espolvorear", "buena pizca de sal marina", "175g / 6oz de mantequilla fría, cortada en cubitos", "1 huevo de gallinas camperas"], "method": ["Para hacer el relleno, caliente el aceite en una sartén antiadherente grande.", "Corta las lonjas de tocino por la mitad y freír a fuego medio durante 4-5 minutos hasta que la grasa esté dorada y crujiente, volteándolas una vez.", "Retire el tocino del fuego y déjelo enfriar. Coloque una bandeja de horno resistente en el horno y precaliente a 190C / 375F / Gas 5.", "Para la masa, pulse la harina, la sal y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a finas migas de pan.", "Batir el huevo con una cucharada de agua fría y verter sobre la mezcla de harina y mantequilla con el motor en marcha. Continúa mezclando hasta que la masa comience a formar una bola.", "Convierte la masa en una tabla ligeramente enharinada, amasa rápidamente y corta por la mitad.", "Estire la mitad hasta que tenga aproximadamente 0.5 cm / ¼ de grosor y forre un plato de pastel engrasado de 23 cm / 9 pulg., Dejando cualquier exceso de hojaldre colgando del borde.", "Esparce el tocino sin apretar sobre la caja de pastelería. Divida suavemente seis de los huevos en la caja de repostería, espaciando de manera uniforme entre las lonjas de tocino.", "Batir los huevos restantes con la leche y mucha sal y pimienta.", "Lentamente vierta los huevos batidos en la caja de repostería, deteniéndose de vez en cuando para permitir que el huevo batido encuentre su camino entre los huevos enteros y el tocino. Deje 2-3 cucharadas de la mezcla en el recipiente para acristalar la parte superior del pastel.", "Extienda el resto de la masa para hacer una tapa para el pastel. Cepille el borde de la caja de repostería con huevo batido y leche y levante suavemente la tapa de la repostería sobre el relleno.", "Presione los bordes firmemente para sellar, luego recorte. Use un tenedor para sellar firmemente el borde en todo el pastel y luego cepille la parte superior con el huevo batido restante para glasear.", "Hornee la tarta en la bandeja de hornear precalentada durante 45-55 minutos hasta que estén doradas y cocidas.", "Realice una prueba perforando el centro con un cuchillo afilado; el relleno debe estar listo. Si todavía está moqueando, vuelva a poner el pastel en el horno por unos minutos. Dejar reposar durante al menos 15 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_egg_and_bacon_pie_09677", "title": "Pastel de huevo y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_and_bacon_pie_09677_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "2 huevos de gallinas camperas, golpeados", "3 cebollas de primavera, cortadas en ángulo", "¼ de pimiento verde, sin semillas y en rodajas finas", "¼ de pimiento rojo, sin semillas y en rodajas finas", "¼ pimiento amarillo, sin semillas y en rodajas finas", "¼ de pimiento naranja, sin semillas y en rodajas finas", "½ zanahoria, pelada y triturada", "2-6 judías verdes finas, desmenuzadas", "8-10 setas, más o menos picadas", "2 cucharadas de guisantes congelados, descongelados", "500g / 1lb 2oz de arroz frío y cocido", "2 cucharadas de salsa de soja ligera o tamari, al gusto", "sal y pimienta negra recién molida"], "method": ["Calienta el aceite hasta el punto de ahumado en un wok grande. Agregue los huevos y agite con un cucharón o cuchara, separándolos mientras cocinan.", "Agregue las cebolletas y los pimientos y saltee por 1 minuto. Agregue las verduras restantes, sazone con sal y pimienta, y saltee por unos minutos hasta que se ablanden, pero todavía tenga un bocado.", "Agregue el arroz y saltee por unos minutos hasta que el arroz esté bien caliente. Sazonar con salsa de soya y servir."], "url": "www_bbc_co_uk_food_recipes_egg_and_vegetable_fried_44022", "title": "Huevo y arroz frito de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 manojo de espárragos jóvenes, alrededor de 10 lanzas, recortado", "5 lonchas de tocino seco ahumado curado en seco", "1 cucharadita de aceite de oliva", "1 cebolla mediana, finamente rebanada", "25g / 1 oz de harina de maíz", "300 ml / ½ litro de leche semidesnatada", "3 huevos de gallinas camperas, golpeados", "25 g / 1 oz de queso cheddar extra maduro, finamente rallado", "sal marina copos", "pimienta negra recién molida", "1 cucharada de aceite de girasol, más extra para engrasar la lata", "4 hojas de pasta filo, cada una de 32 x 38 cm / 13 x 15 pulgadas"], "method": ["Cortar los espárragos en longitudes de aproximadamente 5 cm / 2 pulgadas. Llene la mitad de una sartén grande antiadherente con agua y deje que hierva. Agregue los espárragos, vuelva a hervir y cocine por un minuto hasta que estén tiernos. Drene y enjuague con agua corriente hasta que se enfríe, luego seque.", "Recorte la grasa del tocino y corte en tiras de 1cm / ½. Regrese la sartén a fuego lento, agregue el aceite y fríe con cuidado la cebolla y el tocino hasta que estén ligeramente dorados, revolviendo regularmente.", "Agregue la cebolla y el tocino al tazón con los espárragos, mezcle ligeramente y deje enfriar.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque una bandeja para hornear en el horno para calentar.", "Engrase ligeramente una lata acanalada de flants sueltos de 20 cm / 8 pulgadas de unos 3.5 cm / 1½ pulgadas de profundidad. Vierta el resto del aceite en un tazón pequeño.", "Coloque una hoja de pasta filo en el molde de flan, presionando firmemente contra la base y los lados. Con la punta de un pincel de pastelería, cepille la masa con un poco de aceite y luego cubra con una segunda hoja para pasteles en ángulo recto con la primera. Cepille con más aceite y cubra con una tercera hoja en el mismo ángulo que la primera. Cepíllese con el aceite y cubra con una cuarta hoja, corriendo en la misma dirección que la segunda. Ruede y arrugue la masa sobre el borde de la lata, levantándola ligeramente por encima y cepille ligeramente con el aceite restante. Coloque la lata en la bandeja de horno.", "Ponga la harina de maíz en una olla antiadherente y agregue 50ml / 2fl oz de la leche para hacer una pasta delgada. Vierta más de 200 ml / 7 fl oz de la leche y mezcle bien. Traiga a fuego lento, revolviendo constantemente.", "Cocine por un minuto a fuego medio, revolviendo, hasta que la salsa esté espesa y suave.", "Sazonar, luego retirar del fuego y agregar el resto de la leche para enfriar y aflojar la salsa.", "Agregue los huevos batidos hasta que estén bien combinados.", "Esparce la mitad de la mezcla de espárragos, tocino y cebolla sobre la base de la caja de repostería y vierte la salsa blanca suavemente encima. Esparce la mezcla restante de espárragos y tocino encima y presiona ligeramente, luego espolvorea uniformemente con el queso.", "Hornee en la bandeja de horno precalentada en el centro del horno durante 25-30 minutos o hasta que la masa esté ligeramente dorada y crujiente y el relleno esté puesto.", "Saque el flan del horno y déjelo enfriar en la lata durante 10 minutos antes de quitarlo. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_egg_bacon_and_asparagus_32159", "title": "Huevo, tocino y flan de espárragos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_bacon_and_asparagus_32159_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["165g / 5¾oz de harina natural, más extra para quitar el polvo", "25 g / 1 oz de almendras molidas", "120 g / 4¼ oz de mantequilla sin sal refrigerada, en cubos", "Azúcar en polvo de 55 g / 2 oz", "1 huevo de gallinas camperas", "700ml / 1¼ pinta de leche entera", "7 yemas de huevo de gallinas camperas", "90g / 3¼ oz de azúcar en polvo", "nuez moscada recién molida"], "method": ["Para hacer la masa, mezcle la harina y las almendras molidas en un tazón grande, luego agregue la mantequilla y frote con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar.", "Rompa el huevo y mézclelo en la mezcla con los dedos, juntándolo para formar una masa suave.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y déle forma de bola. Aplane con sus dedos un disco y envuélvalo en una película adhesiva. Dejar enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Estirar la masa dulce en una superficie de trabajo ligeramente enharinada.", "Con un cortador acanalado de 11 cm / 4½ pulgadas, corte doce discos y alinee los moldes de la bandeja para muffins con el círculo de repostería. La masa debe superponerse a la parte superior de los moldes unos pocos milímetros, de forma que pueda doblar los bordes si lo desea.", "Para el relleno de natillas, caliente la leche en una cacerola y bata las yemas de huevo y el azúcar en un tazón aparte hasta que estén pálidas y cremosas.", "Vierta la leche en la mezcla de yema de huevo y revuelva bien, creando pequeñas burbujas.", "Transfiera la mezcla de natillas a una jarra de colada con un labio, luego llene cada una de las cajas de tartas.", "Espolvoree una pequeña pizca de nuez moscada molida en el centro de cada tarta.", "Hornee las tartas en el horno durante aproximadamente 25 minutos; es posible que deba bajar la temperatura a 180 ° C / 350 ° F / Gas 4 durante los últimos 10 minutos. Está buscando una cúpula muy pequeña en la crema, lo que indica que está cocida. Si la crema domestica demasiado, esto indica que ha cocinado demasiado la crema pastelera, habrá hervido y se hundirá nuevamente dejando un gran chapuzón. Si esto sucede, puede ayudar a rescatarlo retirando las tartas del horno inmediatamente y colocando la lata en agua fría sobre una superficie fría.", "Enfriar en la lata durante 30 minutos y luego retirar cuidadosamente de los moldes. La base de las tartas debe estar perfectamente cocida, sin haber cocinado excesivamente el relleno de crema."], "url": "www_bbc_co_uk_food_recipes_egg_custard_tarts_15352", "title": "Tartas de crema de huevo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12 tartas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_custard_tarts_15352_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de arroz basmati o 75g / 2½oz de arroz basmati cocido", "1 cucharadita de aceite de colza", "2 cebollas de primavera, picadas", "25g / 1oz de pimiento rojo, aproximadamente picado", "100g / 3½oz de gambas peladas cocidas", "Guisantes de 25 g / 1 oz (frescos o congelados)", "1 cucharadita de salsa de soja", "1 huevo mediano de granja, golpeado", "cilantro fresco picado (opcional)"], "method": ["Cocine el arroz de acuerdo con las instrucciones del paquete. Desagüe.", "Caliente el aceite en una cacerola pequeña a fuego medio. Agregue las cebolletas y el pimiento rojo y cocine por 1 minuto. Agregue el arroz cocido, las gambas, los guisantes y la salsa de soja y cocínelos durante 3-4 minutos, revolviendo constantemente. Agregue el huevo batido y cocine por 30 segundos. Dispersar sobre el cilantro, si se usa, y servir."], "url": "www_bbc_co_uk_food_recipes_egg_fried_rice_09743", "title": "Arroz frito con huevo ligero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_fried_rice_09743_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de granos de pimienta de Sichuan", "1 estrella de anís", "500g / 1lb 2 oz vientre de cerdo, piel anotada", "1 cucharadita de polvo chino de cinco especias", "2 dientes de ajo, finamente rallados", "pedazo de pulgar de jengibre fresco, pelado y finamente rallado", "4 cucharadas de salsa hoisin", "1 cucharada de aceite de sésamo", "2 cucharadas de salsa de soja (opcional)", "1 cucharadita de azúcar de palma rallada o azúcar en polvo", "½ cucharadita de sal", "100g / 3½oz de carne de cerdo cocida de cinco especias, cortada en cubos de 1cm / ½ en pulgadas (ver arriba)", "120g / 4oz de arroz", "2 huevos grandes de gallinas camperas", "1 cucharadita de aceite de sésamo", "sal marina copos, al gusto", "300g / 10½oz de arroz cocido refrigerado", "aceite de maní, para freír", "60 g / 2¼ oz de camarones secos pequeños, empapados en agua tibia", "1 diente de ajo, finamente cortado", "¾ cucharadita de granos de pimienta de Sichuan", "1 cucharadita de polvo chino de cinco especias", "60g / 2¼oz de gambas peladas pequeñas cocidas, si usa descongelación congelada y drene bien", "3 cebollas de primavera, cortadas en ángulo (incluidas las partes verdes)", "pimienta blanca recién molida", "salsa de soja, para el acabado"], "method": ["Para el cerdo de vientre de cinco especias, triture los granos de pimienta y el anís estrellado en un almirez y un mortero o un molinillo de especias, y luego colóquelos en una bolsa de plástico grande para alimentos. Necesita algo que sea lo suficientemente grande como para sostener el cerdo y tiene una parte superior que puede sellar, como una bolsa de plástico con cierre hermético y sellado.", "Agregue los ingredientes restantes, incluido el cerdo, a la bolsa, luego masajee la mezcla en la carne a través de la bolsa. Selle la parte superior de la bolsa y deje que la carne de cerdo marinar durante 24 horas o más en la nevera. Cuanto más tiempo se marina la carne, más sabor habrá.", "Cuando esté listo para cocinar la carne de cerdo, precaliente el horno a 160 ° C / 325 ° F / Gas 3. Coloque la carne de cerdo en una lata para asar, que debe quedar bien ajustada, con la marinada y tueste la carne de cerdo durante 1½ a 1 hora o hasta que esté tierna. y crujiente.", "Dice 100 g / 3½ oz de la carne de cerdo cocida en 1 cm / ½ en cubos y colóquela a un lado. Cualquier carne de cerdo restante de cinco especias se puede comer en su propio ocio.", "Para el arroz frito con huevo, cocine el arroz de acuerdo con las instrucciones del paquete y déjelo enfriar.", "Batir los huevos con aceite de sésamo y una buena pizca de sal. Caliente una sartén antiadherente o un wok con un chorrito de aceite de cacahuete. Cuando el aceite esté bastante caliente, vierta la mezcla de huevo. No revuelva y deje que el huevo se cocine suavemente por un minuto, o hasta que la parte inferior comience a fraguar. Luego, usando una espátula de goma, empuje suavemente un lado de la mezcla de huevo en el centro del wok e incline el wok para permitir que el huevo líquido inmóvil fluya por debajo y cocine.", "Deslice la tortilla cocida en un plato y enrolle en forma de cigarro. Córtelo en rodajas de 1 cm / ½, luego cúbralo con papel de aluminio y déjelo a un lado para mantenerlo caliente mientras prepara el arroz.", "Calienta dos cucharadas de aceite de cacahuete en la sartén. Escurrir los camarones secos y agregarlos a la sartén con la panceta picada y el ajo, luego calentar durante unos 45 segundos.", "Moler los granos de pimienta de Sichuan en un almirez y mortero y agregarlos a la sartén junto con el polvo chino de cinco especias. Agregue el arroz y saltee durante 4-5 minutos, revolviendo todo junto para mezclar todos los sabores.", "Agregue las gambas peladas y las cebolletas. Compruebe el condimento, agregue un poco de pimienta blanca recién molida y salsa de soja, al gusto. Con cuidado, doblar las tiras de tortilla y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_egg_fried_rice_with_86215", "title": "Arroz con huevo frito y panceta de cerdo con cinco especias", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 huevos medianos de corral (preferiblemente orgánicos y tan frescos como sea posible), separados", "150 g / 5½ oz de azúcar en polvo de oro", "500ml / 18fl oz de leche entera", "400 ml / 14 fl oz crema doble", "350ml / 12fl oz de ron, bourbon o una mezcla de los dos, dependiendo de su preferencia", "nuez moscada recién rallada, al gusto"], "method": ["Batir las yemas de huevo en un bol con 100 g / 3½ oz del azúcar impalpable hasta que la mezcla tenga un color amarillo pálido y espeso (esto se logra mejor con un mezclador portátil de mano).", "Agregue la leche, la crema doble y el ron y / o bourbon. También puede agregar un poco de nuez moscada rallada, si le gusta su nog de esta manera.", "Vierta la mezcla en dos botellas de 750ml / 1½ pinta con tapones y guárdelas en el refrigerador hasta por dos semanas. (El alcohol evitará cualquier deterioro de los huevos o la crema).", "Coloque las claras de huevo en una caja y congele hasta que esté listo para servir el huevo.", "Cuando esté listo para servir, descongele las claras de huevo en un recipiente limpio de metal o vidrio. Usando una batidora eléctrica de mano, bata las claras de huevo hasta que estén espumosas y opacas. Agregue los 50 g restantes de azúcar y bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor.", "Vierta el huevo de las botellas en un tazón grande y doblar las claras de huevo hasta que estén bien combinados. Ponga el hojaldre en vasos de vidrio y sirva con un poco de nuez moscada recién rallada sobre la parte superior de cada vaso."], "url": "www_bbc_co_uk_food_recipes_egg_nog_64580", "title": "Ponche de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_nog_64580_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "8 rebanadas finas de tocino", "50g / 1¾oz de mantequilla", "2 rebanadas de pan blanco, cortado en cubitos", "120g / 4¼oz trompeta de la muerte", "2 cucharadas de perejil de flatleaf, hojas recogidas", "4 cucharadas de aceite de oliva", "1 chalote grande, finamente picado", "3 dientes de ajo", "1 ramita de tomillo", "1 hoja de laurel", "1 cucharadita de puré de tomate", "1kg / 2lb 4oz de tomates maduros en vides, desollados, sin semillas, toscamente picados", "1 cucharadita de mostaza", "1 cucharadita de vinagre", "115g / 4oz de mantequilla", "500g / 1lb 2oz champiñones planos, pelados", "2 ramitas de tomillo", "2 dientes de ajo", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida"], "method": ["Caliente un baño de agua a 62C / 144F. Coloque los huevos enteros en el baño de agua y cocínelos durante 1 hora y 15 minutos. Si no usa un baño de agua, simplemente poche los huevos como de costumbre.", "Pele los huevos y deslícelos con cuidado en un recipiente con agua tibia. Los huevos deben mantenerse juntos y ser gelatinosos. (Si no se usa inmediatamente, retire el huevo de su caparazón del baño de agua y colóquelo cuidadosamente en un recipiente con agua helada. Una vez que se haya enfriado, relájese en el refrigerador hasta que esté listo para usar. Vuelva a calentarlo en el baño de agua durante 5-8 minutos .)", "Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Coloque el tocino entre dos bandejas de horneado pesadas y hornee durante aproximadamente 12 minutos o hasta que estén crujientes. Mantenga caliente hasta que esté listo para servir.", "Calentar una sartén hasta que esté caliente, agregar la mitad de la mantequilla y calentar hasta que se forme espuma. Agregue el pan cortado en cubitos y cocine hasta que se dore por todas partes, luego incline sobre papel de cocina y deje enfriar.", "Agregue la mantequilla restante a la sartén con la trompette de mort y cocine hasta que esté tierna, unos dos minutos. Escurrir sobre papel de cocina.", "Para la fondue de tomate, caliente una sartén grande hasta que esté caliente, agregue 3 cucharadas de aceite de oliva, chalote, ajo, tomillo y hojas de laurel y cocine suavemente hasta que todo se haya suavizado. Agregue el puré de tomate y cocine por 2-3 minutos.", "Reserve un tercio de los tomates picados. Agregue los tomates restantes a la sartén y cocine durante 6-7 minutos hasta que los tomates se hayan descompuesto y estén casi secos.", "Coloque la mezcla en un procesador de alimentos y mezcle hasta obtener un puré fino. Cuele la mezcla a través de un colador en una sartén limpia y agregue los tomates reservados.", "Batir la mostaza, el vinagre y el aceite de oliva restante, luego mezclar en los tomates, a gusto.", "Para el hongo velouté, caliente una sartén hasta que esté caliente, agregue la mantequilla y caliente hasta que forme espuma.", "Agregue los champiñones, el tomillo y el ajo y cocine hasta que estén dorados. Agregue la crema y cocine hasta que se reduzca y espese.", "Coloque en un procesador de alimentos, mezcle hasta que esté suave y luego cuele a través de un tamiz en una sartén limpia. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada de fondue de tomate en un lado de un plato de sopa, y una cucharada de veloute de champiñones en el otro lado. Apila la trompette de mort en el centro y esparce crotones y perejil alrededor del plato. Coloque el huevo encima de la trompette de mort y termine con un par de trozos de tocino crujiente."], "url": "www_bbc_co_uk_food_recipes_egg_tomato_fried_bread_45770", "title": "Tocino, huevo, tomate, pan frito y velouté de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]