[{"isVegetarian": true, "title": "Piccalilli with curry spices", "url": "www_bbc_co_uk_food_recipes_piccalilli_7718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb small pickling onions, peeled", "450g/1lb cauliflower florets", "450g/1lb runner beans, trimmed and finely sliced", "450g/1lb cucumber, seeded and cut into 1cm/½in dice", "450g/1lb pumpkin, peeled, seeded and cut into 1cm/½in dice", "450g/1lb courgette or marrow, cut into 1cm/½in dice", "450g/1lb salt", "30g/1oz mustard", "30g/1oz ground ginger", "30g/1oz curry powder - mild or hot according to taste", "15g/½oz ground turmeric", "30g/1oz black peppercorns", "1l/1¾pt malt vinegar", "30g/1oz cornflour"], "serves": "6-8 jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the vegetables into a large bowl and mix together with the salt. Cover and leave overnight.", "Drain and rinse the vegetables under running cold water. Dry.", "Put ¾ of the vinegar in a large preserving pan and add the spices and vegetables. Bring to the boil and simmer until just tender.", "Mix the cornflour with the rest of the vinegar and add to the pan. Mix together and simmer for 5 minutes.", "Turn into hot sterilised jars, seal and cool.", "Store for three months in a cool, dark cupboard before eating."]}, {"isVegetarian": true, "title": "Pici cacio e pepe", "url": "www_bbc_co_uk_food_recipes_pici_cacio_e_pepe_16342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz white bread flour ", "1 tbsp olive oil ", "pinch fine salt ", "325g/11½oz butter\u2028", "4 tbsp freshly ground black pepper ", "200g/7oz Parmesan (or other vegetarian hard cheese), finely grated\u2028", "1 tsp lemon juice ", "½ pink grapefruit, segmented, each segment halved", "3 handfuls lamb’s lettuce", "splash red wine vinegar", "splash olive oil", "4 tsp salted ricotta cheese, coarsley grated", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta dough, add the flour to a mixing bowl and make a well in the middle. Mix the olive oil, salt and 185ml/6fl oz cold water together and pour into the middle of the flour.  Start incorporating the flour into the liquid until a dough starts to form. Turn the dough out onto a clean surface and knead until smooth. Shape the dough into a rectangle, wrap in cling film and leave to rest somewhere cool for at least 30 minutes. ", "To make the pici, cut the dough into 15g/½oz strips (weigh one to check and use as a guide) and keep covered with a damp tea towel. ", "On a clean, dry work surface start rolling each strip outwards, with both palms of your hands, applying pressure evenly and pushing out, until you have a noodle the same thickness as a biro. Repeat until all the dough is used up. ", "To make the pici cacio e pepe, bring a large saucepan of heavily salted water to the boil. Cook the pici for 5–6 minutes. ", "Meanwhile, place a saucepan over a medium heat.  Add the butter, black pepper and a splash of pici cooking water. Turn down to a low heat and cook until emulsified. ", "When the pasta is cooked, use tongs to transfer it from the water to the emulsifed butter, reserving the pasta water. ", "Add the Parmesan and, without stirring, leave to sit and melt from the residual heat of the pan (this prevents it from becoming chewy little cheesy balls). ", "Put the grapefruit, lamb’s lettuce, red wine vinegar and olive oil in a mixing bowl and toss together. Season with a pinch of salt. Distribute evenly between four plates and sprinkle the salted ricotta on top.", "Once the Parmesan has melted into the pici, stir the sauce and pasta together to incorporate. Season with salt if needed and serve immediately alongside the pink grapefruit, and ricotta salad. "]}, {"isVegetarian": false, "title": "Pici verde with roast tomatoes and paprika meatballs", "url": "www_bbc_co_uk_food_recipes_pici_verde_with_roast_30260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz spinach, washed well ", "300–350g/10½–12oz Italian '00' flour (strong white flour)", "1 tbsp olive oil, plus extra", "1 onion, finely chopped", "2 garlic cloves, finely chopped ", "300g/10½oz minced beef", "300g/10½oz minced pork", "100g/3½oz soft white breadcrumbs", "50ml/2fl oz soured cream or crème fraîche", "2 tsp sweet smoked paprika", "1 tsp hot smoked paprika (or to taste)", "1 tsp dried oregano", "2 tbsp finely chopped parsley", "1 free-range egg ", "salt and freshly ground black pepper", "400g/14oz cherry tomatoes, halved", "salt, to taste", "sprig thyme, leaves only", "2 garlic cloves, finely sliced", "2-3 tbsp olive oil", "fresh basil leaves", "grated parmesan"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta, shake off any excess water from the spinach and put into a food processor with 300g/10½oz of the flour. Blend together until the spinach has completely broken down and formed a dough. You may need to push everything down the sides once or twice. Check the dough – if it is very sticky (this will depend on how wet your spinach is), add more flour. The best texture is soft and very slightly tacky.", "Roll out the pasta. Do this by pulling off small balls (around the size of a large marble). Start off by rolling between your hands then laying out on a work surface and rolling lightly with both hands, moving from the centre outwards. If it is very sticky, dust your hands with a little flour, but try not to use too much as it makes the pasta much harder to roll – it will slide away from you. ", "The pasta can be cooked right away, in a large pan of boiling, salted water, or it can be dried out. If you are cooking from fresh, it will take five minutes; if it is dry, it will take 8-10 minutes.", "For the meatballs, heat the olive oil in a frying pan and add the onion. Cook on a medium to low heat until very soft and translucent, then add the garlic and continue to cook for another minute or two. Remove from the heat and cool.", "Put the beef and pork in a large bowl with the breadcrumbs, soured cream (or crème fraîche), two types of paprika, herbs and egg. Add the onion and garlic and season very generously. Mix thoroughly. ", "Take a small amount of the mixture and fry it. When it is cooked, taste for seasoning and adjust accordingly – meatball mixture often needs more salt than you think. Form the mixture into 20 balls. ", "To cook, either preheat the oven to 200C/180C Fan/Gas 6 and bake for 18-20 minutes, turning them over halfway through, until well browned and piping hot in the centre. Or heat some oil in a large frying pan and cook them in two batches, turning regularly.", "For the roast tomatoes, lay the tomatoes in a roasting tin or ceramic ovenproof dish, cut-side up. Sprinkle with salt, thyme leaves, garlic and the olive oil, then roast for around 10 minutes, or until well softened and very slightly browned round the edges. ", "Serve the meatballs and tomatoes with all the pan juices over the pasta, garnished with plenty of basil and grated parmesan."]}, {"isVegetarian": true, "title": "Pici", "url": "www_bbc_co_uk_food_recipes_piciallebriciole_82363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour, plus extra for dusting", "pinch of salt", "1 large free-range egg", "125ml/4½floz water", "6 tbsp extra virgin olive oil, plus extra to drizzle", "2 large cloves garlic, finely chopped ", "200g/7oz stale, dried white breadcrumbs", "1 tsp salt, plus extra to taste ", "pinch freshly ground black pepper", "1 bunch flatleaf parsley, trimmed and coarsely chopped ", "100g/3½oz grated parmesan (or a vegetarian alternative), plus extra to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the fresh pici. Mix the flour and salt in a large bowl, then pour onto a pastry board or other work surface. Make a well with your fingers in the centre. Crack the egg into this well. Gradually mix the flour and egg, adding water a little at a time until the dough is firm but flexible. You may not need to use all of the water.", "Knead the dough until well blended and it springs back to the touch. ", "Lightly dust a rolling pin with flour, and roll out the dough until it is about ½-1cm/¼-½in thick. Leave for 20 minutes to rest. ", "Cut the dough into 1cm/½in wide strips with a sharp knife. Hand-roll the strips into thick, spaghetti-like strands. These should be about 3mm/eighth inch wide.", "To cook the pici, bring a large saucepan of salted water to the boil. Add the pici and cook for about 10-12 minutes. The exact cooking time will depend on the width of the strands.", "Meanwhile, make the sauce. Heat the olive oil in a large saucepan. Add the garlic and allow it to flavour the oil. Add the breadcrumbs and the salt and freshly ground black pepper. Sauté for 2-5 minutes, stirring frequently, until the breadcrumbs are golden brown", "Drain the pici and add to the breadcrumb mixture. Add the parsley and parmesan and toss to mix.", "Divide the mixture between individual pasta bowls. If you like, add extra grated parmesan or olive oil to serve."]}, {"isVegetarian": true, "title": "Pickled eggs", "url": "www_bbc_co_uk_food_recipes_pickled_eggs_79282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs", "350ml/12fl oz cider vinegar", "1 tbsp salt", "1 tbsp sugar", "1 tsp chilli flakes or a few dried chillies (optional)"], "serves": "Makes 6 pickled eggs", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["First sterilise a jar large enough to hold all six eggs. Either run it through the hottest setting in your dishwasher, or wash in plenty of hot, soapy water, rinse thoroughly, then put in a low oven to dry out completely.", "Bring a saucepan of water to the boil, then gently lower in the eggs. Boil for 7 minutes exactly, then remove from the heat, strain, and run under cold water to stop them cooking. When they are cool enough to handle, peel carefully.", "Put the cider vinegar in a saucepan with 150ml/5fl oz water, salt and sugar. Slowly bring to the boil, stirring to dissolve the sugar, then simmer for 5 minutes. If using the chilli, add this at the last minute.", "Pack the eggs into the jar, then pour over the vinegar mixture. Seal and leave to cool completely. Leave for at least 2 weeks before eating, preferably a month, then store in the fridge once opened."]}, {"isVegetarian": false, "title": "Pickled mackerel with warm potato and radish salad", "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_47640", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large pinches coriander seeds", "120ml/4fl oz white balsamic vinegar", "120ml/4fl oz white wine vinegar", "4 tbsp light soft brown sugar", "4 whole mackerel (about 250g/9oz each), filleted and lightly scored", "1 tbsp sea salt flakes, plus extra for seasoning", "1 small red onion, thinly sliced", "2 fresh coriander sprigs, plus 2 tbsp chopped fresh coriander leaves", "1 garlic clove", "300g/10½oz small new potatoes, such as Charlotte or Pink Fir Apple, scrubbed", "1 tbsp natural Greek-style yoghurt", "1 lime, finely grated zest and juice ", "8 large radishes, thinly sliced", "1 spring onion, thinly sliced diagonally", "freshly ground black pepper", "2 tbsp Dijon mustard", "2 tbsp white balsamic vinegar", "4 tbsp olive oil or sunflower oil", "4 tbsp extra virgin olive oil or sunflower oil", "2 egg yolks", "1 tbsp French mustard", "few drops of lemon juice", "150ml/5fl oz sunflower oil or grapeseed oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the salad, heat a frying pan over a medium heat. Add the coriander seeds and toast for 1 minute, shaking them occasionally, until aromatic. Tip them on to a plate and lightly crush using a knife blade. ", "Pour both vinegars into a small saucepan, add the sugar and cook over a medium heat for 2-3 minutes, or until the sugar is dissolved, stirring occasionally. Remove from the heat and stir in the coriander seeds, then leave until cold.", "Put the mackerel fillets in a shallow, non-metallic dish, skin-side-down, and sprinkle with the salt. Pour over the vinegar mixture and top with three-quarters of the red onion. Cover with cling film and marinate in the refrigerator for 6 hours, or until pickled, turning the fish over halfway through.", "Just before the mackerel is ready, fill a saucepan one-third full with water, place a steamer on top and bring to a simmer. Put the remaining red onion, the coriander sprigs and garlic in the water. Put the potatoes in the steamer, cover and cook for 12-18 minutes, or until just tender. Turn the heat off and steam them in the residual heat for a further 5 minutes, then leave to cool.", "For the French dressing, whisk the Dijon mustard, vinegar and 2 tablespoons of water together in a small bowl. Whisk in both olive oils until thick and glossy. Season with salt and pepper.", "For the mayonnaise, beat the egg yolks and French mustard together in a large bowl. Add a few drops of lemon juice and season with salt and pepper. Drizzle in the oil a little at a time, whisking continuously with a hand-held electric whisk, until thickened.", "Whisk together 3 tablespoons of the French dressing, 2 tablespoons of the mayonnaise and the yoghurt in a bowl. Stir in the lime zest and juice and season with salt and pepper. ", "Cut the potatoes into 5mm/¼in slices and put them in a large salad bowl. Add the radishes and chopped coriander leaves, then drizzle with the dressing and toss gently. Scatter over the spring onion. Lift the mackerel out of the pickling liquor and put it on serving plates. Scatter over some pickled red onion and serve with the potato salad."]}, {"isVegetarian": false, "title": "Pickled mackerel with tomatoes and sourdough", "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_50047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 fillets line-caught mackerel, bone in", "25g/1oz sea salt, plus extra for sprinkling", "200ml/7fl oz rice wine vinegar", "300ml/10fl oz extra virgin rapeseed oil, plus extra for drizzling", "50g/1¾oz chardonnay vinegar", "1 loaf sourdough", "16 cherry tomatoes, on the vine", "100g/3½oz salted butter", "2 thyme sprigs", "4 mixed heritage tomatoes, cut into wedges", "wild samphire, preferably English, tips only, to serve", "1 yellow chicory, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly salt the flesh side of the mackerel fillets and leave to marinade for about 2 hours before using. ", "Put the mackerel fillets into a shallow tray, skin-side down. Pour over the rice vinegar until it’s about halfway up the mackerel. Allow to sit for 2 minutes then carefully remove the membrane around the skin. Place the fillets back into the vinegar, flesh side down for another 1–2 minutes. Remove from the vinegar and carefully cut out the bones.", "Mix together 200ml/7fl oil with the chardonnay vinegar in a small jar. Put the mackerel on a serving plate and drizzle with the rapeseed and vinegar dressing.", "Preheat oven to 150C/170C Fan/Gas 2.", "Put the sourdough slices onto baking sheets, drizzle with some oil and sprinkle with a little sea salt. Bake for 3–4 minutes until golden brown. Set aside.", "Blanch the cherry tomatoes in boiling water for 10 seconds and carefully remove the skins.", "Place half the tomatoes in a saucepan with the butter, thyme and some of the vines and warm very gently for a couple of minutes. ", "Place the other half of the tomatoes into a bowl and dress with the rapeseed dressing. Refrigerate any remaining dressing to use on other dishes.", "Blow torch the tomato wedges until caramelised and sprinkle with with sea salt.", "Place the mackerel between 4 plates, arrange the tomatoes around the fish and finish with the samphire, chicory and crispy sourdough."]}, {"isVegetarian": true, "title": "Pickled mushrooms", "url": "www_bbc_co_uk_food_recipes_pickled_mushrooms_45080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints white wine vinegar", "1 tsp salt", "1 tsp sugar", "2 garlic cloves", "olive oil", "½ tsp black peppercorns", "1 bay leaf", "1 kg/2lb 4oz wild mushrooms, cleaned and roughly chopped"], "serves": "Makes 1 x 1litre/1¾ pints jar", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place all of the ingredients except the mushrooms into a saucepan and add 500ml/18fl oz water. ", "Bring to the boil and add the mushrooms. Cook for 12-15 minutes, or until cooked through.", "Remove the mushrooms from the pan with a slotted spoon and set aside to dry on a clean tea towel for 3-4 hours, or until completely dry.", "Pour some olive oil into a 1 litre/1¾ pints sterilised jar, add the mushrooms, then cover with more olive oil. Stir together gently until all of the mushrooms are coated in the olive oil. Cover tightly with a sterilised lid.", "The mushrooms will keep for two months unopened. Use within 3-4 days once opened. "]}, {"isVegetarian": true, "title": "Pickled courgette and blue cheese salad", "url": "www_bbc_co_uk_food_recipes_pickledcourgetteandb_81263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp olive oil", "1 tsp white wine vinegar", "½ courgette, cut into thin strips with a vegetable peeler", "½ red onion, finely sliced", "salt and freshly ground black pepper", "1 tsp finely chopped fresh flatleaf parsley", "25g/1oz blue cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive oil and white wine vinegar into a large bowl and whisk together.", "Add the courgette ribbons and red onion. Toss to coat in the dressing and season, to taste, with salt and freshly ground black pepper.", "To serve, place the salad in the centre of a plate and sprinkle over the parsley and blue cheese."]}, {"isVegetarian": true, "title": "Pickled cucumber", "url": "www_bbc_co_uk_food_recipes_pickledcucumber_11033", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pickledcucumber_11033_16x9.jpg", "ingredients": ["1 whole cucumber, peeled", "1 tsp salt", "60ml/2fl oz white vinegar ", "50g/2oz sugar ", "7.5cm/3in fresh root ginger", "4 stem ginger in sugar syrup"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Use a fork to run through the surface of the cucumber, vertically downwards, to obtain a fluted pattern when sliced.", "Cut cucumber into thin slices and put into a large bowl, sprinkle with salt and mix well. Leave the cucumber for 10 minutes to absorb the salt then rinse with cold water. Drain off excess liquid in a colander. Return cucumber to the large bowl.", "Grate the fresh root ginger. Cut the stem ginger into thin slices.", "Combine sugar, vinegar and the two types of ginger together. Add to cucumber slices and mix well. ", "Decant into a plastic container. Refrigerate overnight or for a few hours before serving. "]}, {"isVegetarian": false, "title": "Pickled French beans with mackerel, bacon and Taleggio jacket potato", "url": "www_bbc_co_uk_food_recipes_pickledfrenchbeanswi_85427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "5 shallots, finely sliced ", "2 sprigs fresh thyme, leaves only", "1 bay leaf ", "2 garlic cloves, peeled and crushed", "2.5cm/1in piece ginger, peeled, finely chopped ", "2 tsp pink peppercorns, crushed", "450ml/16fl oz white wine vinegar", "500g/1lb 2oz French beans, tops trimmed", "75g/3oz sugar", "4 baking potatoes", "8 rashers smoked streaky bacon, cut into strips or lardons", "4 small smoked mackerel fillets, skinned, boned and broken up into flakes", "4 tbsp crème fraîche", "salt and freshly ground black pepper ", "300g Taleggio cheese, cut into four equal slices"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the beans, place a heavy-bottomed saucepan onto a medium heat and add the olive oil, shallots, thyme leaves, bay leaf, garlic, ginger and peppercorns. Gently fry for 2-3 minutes, until the shallots are soft but not coloured.", "Add the vinegar to the pan and swirl to combine. Remove from the heat and allow to cool.", "Meanwhile, bring a pan of lightly salted water to the boil and blanch the beans for two minutes. Drain and refresh the beans in cold water.", "Place the beans into a large bowl and sprinkle with the sugar, tossing gently to coat. Pour the cooled vinegar mixture over the beans and set aside.", "For the jacket potatoes, preheat the oven to 200C/400F/Gas 6.", "Pierce the baking potatoes several times all over with a sharp knife, then place into the oven to bake for one hour, or until crisp on the outside, but tender when pierced with a knife. Remove from the oven and allow to cool slightly.", "Preheat the grill to its highest setting.", "Meanwhile, heat a frying pan until hot. Add the bacon strips and fry, stirring occasionally for 3-4 minutes until golden and crisp. Remove the bacon from the fat with a slotted spoon and set aside to drain on kitchen paper.", "When the potatoes are cool, place them onto a board and slice the tops off. Using a spoon, scoop out all of the potato flesh from the skins and place the flesh into a clean bowl.", "Mash the potato flesh until smooth, then add the cooked bacon, flaked mackerel and crème fraîche. Season, to taste, with salt and freshly ground black pepper.", "Carefully spoon the potato mixture back into the potato skins and place onto a baking sheet. Top each potato with a piece of Taleggio and place under the grill to cook until the cheese is golden and bubbling.", "To serve, place the jacket potatoes onto four plates and place a spoonful of the pickled beans alongside."]}, {"isVegetarian": true, "title": "Pickled tomatoes", "url": "www_bbc_co_uk_food_recipes_pickled_tomatoes_56805", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz malt vinegar", "250ml/9fl oz red wine vinegar", "5 tbsp golden caster sugar", "3 tbsp sea salt", "20 assorted cherry or small tomatoes", "4 garlic cloves", "2 large sprigs rosemary", "1 bay leaf", "1 tbsp coriander seeds", "1 tbsp black peppercorns"], "serves": "Makes 1 litre/1¾ pint", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickling liquid, in a pan bring all of the pickling liquid ingredients to the boil and leave to simmer on a low heat.", "Sterilise both a 1 litre/1¾ pint pickling jar with a screw top lid and the lid in a large pot of boiling water that boils for at least 10 minutes. (Or use several smaller jars with lids.) Lift the jars out of their water bath with a pair of jar tongs. Empty the water. ", "Alternatively they can be sterilised in a dishwasher. ", "For the pickle, quickly fill the jars with the tomatoes, herbs and spices.", "Using a jug or a funnel pour the hot pickling liquid into the jar, pour it all the way to the top and seal, ensuring as little air as possible remains in the jar.", "The pickle will keep for up to a year. ", "Keep refrigerated once opened and finish within two weeks."]}, {"isVegetarian": false, "title": "Pickled scotch eggs", "url": "www_bbc_co_uk_food_recipes_pickled_scotch_eggs_68143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 pickled eggs", "2 tbsp celery salt", "60g/2oz plain flour, seasoned with salt and pepper", "600g/1lb 5oz Cumberland sausages, sausagemeat removed from the skins", "100g/3½oz Japanese panko breadcrumbs", "1 x 30g packet cheese and onion crisps, crushed", "2 free-range eggs, beaten", "vegetable oil, for deep-frying"], "serves": "Makes 6 scotch eggs", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take a pickled egg and roll it in celery salt, then seasoned flour. ", "Divide the sausagemeat into six portions. Roll each portion into a patty big enough to wrap around an egg. Wrap the sausagemeat around the eggs and roll into a ball shape. ", "Mix the breadcrumbs with the crisps. Dust the sausage-coated egg in flour, dip in beaten egg and then roll in the breadcrumb mixture. ", "Heat the oil in a deep-fat fryer or a deep-sided, heavy-bottomed pan to 160C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Fry the eggs for about 8-10 minutes until golden-brown. Alternatively, shallow fry, turning occasionally, until cooked through. "]}, {"isVegetarian": true, "title": "Pickled onions", "url": "www_bbc_co_uk_food_recipes_pickledonions_7719", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb small pickling onions or shallots, peeled", "30g/1oz salt", "1 tsp dried chilli flakes", "1l/1¾pt malt vinegar", "180g/6oz granulated sugar"], "serves": "Makes 1 large jar", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the onions in a large bowl with the salt and mix together. Cover and leave overnight.", "Rinse well in cold water and allow to dry as much as possible.", "Pack the onions into sterilised jars.", "Put the vinegar, chilli flakes and sugar into a pan and slowly bring to the boil to dissolve the sugar.", "Pour the vinegar over the onions and seal the jars.", "Store in a cool, dark cupboard for two weeks before eating."]}, {"isVegetarian": true, "title": "Pickled pears", "url": "www_bbc_co_uk_food_recipes_pickledpears_93088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints white wine vinegar", "0.5 litres/17½fl oz water", "500g/1lb 2oz caster sugar", "3 star anise ", "1 large cinnamon stick, broken into three pieces", "1 tbsp allspice berries", "1 lemon, zest peeled off in large strips using a potato peeler", "½ tsp cloves", "2 tsp juniper berries", "20 Conference pears, peeled, stalks intact", "2 sprigs fresh rosemary"], "serves": "Makes 2 x 1.5 litre jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the water, vinegar, sugar, star anise, cinnamon sticks, allspice berries, lemon zest, cloves and juniper berries to the boil in a large, lidded, non-reactive pan. ", "Add the pears, then cover the pan with a lid and reduce the heat until the mixture is gently simmering. Simmer for 10-15 minutes, or until the pears are tender. Remove the pears from the poaching liquid using a slotted spoon and set aside.", "Return the poaching liquid to the boil and boil for 4-5 minutes, or until the volume of liquid has reduced and thickened.", "Divide the poached pears between two 1.5 litre/2 pints 13fl oz sterilised airtight jars. Pour half of the reduced cooking liquid into each jar, making sure the spices are evenly distributed between each jar. Add one sprig of rosemary to each jar. Seal the jars tightly. The pickled pears can be stored for up two months, but can be eaten after one week. Once opened, store in the fridge and eat within two weeks."]}, {"isVegetarian": false, "title": "Pickled salmon with greens", "url": "www_bbc_co_uk_food_recipes_pickledsalmonwithgre_91478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz white wine vinegar", "75g/2¾oz caster sugar (optional)", "3 garlic cloves, finely sliced", "2 tsp ground coriander", "2 tsp ground cumin", "1 tsp ground turmeric", "12 whole white peppercorns", "1 bay leaf", "2 red onions, very finely sliced", "6 x 100g/3½oz salmon fillets, skin removed", "1 courgette, cut into batons", "100g/3½oz fresh broad beans, out of their pods ", "100g/3½oz fresh butter beans, out of their pods", "100g/3½oz cherry tomatoes, halved", "small handful mustard cress, to serve"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the white wine vinegar, sugar, garlic, spices, peppercorns, bay leaf and onion to the boil in a large non-reactive pan. Reduce the heat to a simmer and simmer the mixture for 4-5 minutes. ", "Remove the pan from the heat, then add the salmon fillets and courgette batons and stir to coat them in the marinade mixture. Set aside until completely cooled. Cover the pan and chill in the fridge for 1½-2 hours.", "When the pickled salmon has chilled and marinated, mix together the broad beans, butter beans and cherry tomato halves in a bowl. Pour over a little of the chilled marinade liquid, to taste, and stir well to combine. ", "To serve, divide the dressed beans and tomato mixture equally among six serving plates. Place one pickled salmon fillet on top of each. Spoon over some of the marinated onion, garlic and courgette pieces. Drizzle some of the remaining marinade liquid around the edge of each plate. Sprinkle over the mustard cress."]}, {"isVegetarian": true, "title": "Pickled shallots", "url": "www_bbc_co_uk_food_recipes_pickledshallots_13699", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz rock salt", "2 litre/3½ pint water", "1.35kg/3lb shallots, peeled and trimmed", "2 litre /3½ pint white wine vinegar", "1 tbsp each allspice berries, juniper berries, black peppercorns and mustard seeds", "2 bay leaves", "170g/6oz light muscovado sugar", "large sterilised jars with screw top lids - prepare jars by washing in hot soapy water and leaving to dry and warm in a cool oven - 130C/250F/Gas ½ for 10-15 minutes."], "serves": "Makes 2x450g/1 lb jars", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the salt and water into a large saucepan, dissolve over a low heat and then leave the brine to cool.", "Put the prepared shallots into the brine, weight down with a plate and leave in a cool place for 24 hours.", "The next day put the vinegar and all the spices and sugar into a saucepan, bring to the boil and leave to infuse and cool.", "Drain the shallots and carefully pack into the jars. Pour over the infused vinegar and the spices. Cover the jars with a screw top lid and leave in a cool dark place for 3-4 weeks before eating."]}, {"isVegetarian": true, "title": "Picnic basket pie", "url": "www_bbc_co_uk_food_recipes_picnic_basket_pie_50454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz plain flour", "300g/10½oz unsalted butter, at room temperature but not soft", "salt", "½ tsp baking powder", "50ml/2fl oz milk, to brush", "1 free-range egg, beaten, to glaze", "2 tbsp sunflower oil", "2 medium red onions, chopped", "2 garlic cloves, in whole cloves, skin on, lightly crushed under fork", "3 Romano red peppers, chopped", "1 large courgette, chopped", "1 aubergine, chopped into 1cm/½in cubes", "salt and freshly ground black pepper", "100g/3½oz couscous", "90g/3¼oz sun-dried tomato paste", "250g/9oz halloumi", "100g/3½oz mozzarella, grated", "small bunch fresh oregano", "small bunch fresh basil", "100g/3½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, rub the butter into the flour using your hands until it resembles fine breadcrumbs. Add 150ml/5fl oz water and bring the mixture together to form a dough (be careful not to overwork it).  Wrap the dough in cling film and leave to rest in the fridge while you prepare the filling.", "For the roasted vegetables, lightly oil a roasting tray with sunflower oil, and arrange the onions, garlic, peppers, courgette and aubergine on the tray. Toss to coat the vegetables in oil.", "Roast for 30-40 minutes, or until the vegetables are tender. Season with salt and freshly ground black pepper. Set aside to cool.", "For the filling, put the couscous in a bowl and add enough boiling water to just cover it. Cover the bowl and let it stand for 5-10 minutes. ", "When the water has been absorbed, use a hand-held blender to blend half of the couscous with the sun-dried tomato paste. Combine with the unblended couscous. Season with salt and pepper and set aside in the fridge.", "Slice the halloumi, pat dry with kitchen paper and dry-fry until brown spots appear.  Flip it over and fry the other side in the same way. Leave to cool. ", "To make the pastry basket, divide the pastry dough into four portions: 350g/12oz for the case, 300g/10½oz for the lattice 'basket', 150g/5½oz for the lattice lid, and 100g/3½oz for the handle and other extras.", "Roll out the pastry dough for the lattice to about 3mm thick, keeping the pastry cold (return it to the fridge for five minutes to chill if required).", "Cut five strips 2cm/1in wide. The strips need to be long enough to go down one side of the tin, across the width of the base and up other side of tin, leaving a slight overhang each side.  The strips will be about 25-30cm/10-12in long (depending on the size of the tin). ", "Lay the strips inside the tin - spacing the strips evenly along the length of the tin.", "Cut four strips also 2cm/1in wide and the same length as the tin (two strips for each long side of the tin). Place one strip flush with the tin's base and the other about two-thirds of the way up.  Weave the strips in an out of the vertical strips to make a lattice.  Where the strips overlap, brush with a little water or milk and press into place.", "Freeze the tin with the lattice inside.", "Meanwhile, roll out the pastry for the case into a rectangle big enough to line the base and sides of the tin. Transfer the pastry rolled pastry to the fridge to rest.", "Make a rectangular lattice for the hamper lid, cutting long strips of pastry, and interweaving them (it's best to do this on a baking tray lined with greaseproof paper). Leave small gaps between rows so there are holes in the lid where any steam can escape during cooking.  Rest the pastry in the fridge.", "Make a basket handle and two buckles out of the remaining pastry (you can mould the handle over a piece of scrunched up tin foil).  Transfer to the fridge to rest.", "Brush the inside of the frozen lattice with milk and line it with the rolled pastry case, pressing lightly to stick the case to the lattice. Rest it in the fridge for 15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the garlic cloves from the cooled roasted vegetables and discard.", "To fill the pie, lay half of the couscous on the bottom (this will soak up any liquid) and pack it firmly by pressing it down. Layer the vegetables, halloumi and grated mozzarella on top. Sprinkle over the oregano and basil. Top with the remaining couscous, again pressing down.  Make sure all layers are tightly packed.", "Brush the edges of the pastry with milk, then slide the lattice lid into place from the greaseproof paper.  Press the edges to seal. Brush the top of the pie with beaten egg.", "Bake for 50 minutes.", "Bake the pastry buckles, hinges and handles separately for 10-15 minutes towards the end of the pie's cooking time.", "Remove the pie from the tin and brush the sides with beaten egg. Return it to the oven and bake for another three minutes. Remove from the oven and leave to cool.", "For the caramel, melt the sugar in a pan with a couple of tablespoons of water. Do not stir. Let it reach a light golden-brown colour.  ", "Dip the handle ends and buckles into the caramel and stick them to the pie (caution: melted sugar is very hot. Take care not to burn yourself). Hold in place while the caramel sets."]}, {"isVegetarian": false, "title": "Picnic loaf", "url": "www_bbc_co_uk_food_recipes_picnic_loaf_86630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large round loaf of bread (rustic cob)", "2 tbsp olive oil", "2 handful salad leaves", "4 slices mature cheddar ", "4 slices salami", "4 slices ham", "small handful fresh basil, shredded", "400g/14oz cherry tomatoes, quartered"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Slice the loaf into three horizontal slices of the same width.", "Put the top slice to one side. Brush the other two pieces of bread with a little of the oil.", "Top each slice of oiled bread with a handful of salad leaves, the cheddar, salami and ham. Sprinkle over the basil and tomatoes and season with freshly ground black pepper.", "Put the loaf back together by placing the two covered slices of bread on top of each other. Put the top piece back on like a lid. Wrap the loaf tightly in cling film. ", "Put the loaf in the fridge, top with a large dinner plate and place a couple of tins on top to weigh it down. Chill for 1-2 hours.", "To serve, cut the loaf into wedges."]}, {"isVegetarian": true, "title": "Picnic parkin", "url": "www_bbc_co_uk_food_recipes_picnic_parkin_46362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 dessertspoons vegetable oil, plus some for greasing", "50g/2oz plain flour ", "1 tsp baking powder ", "1 tbsp dark soft brown sugar ", "½ tsp ground ginger ", "40g/1½oz rolled oats ", "4 dessertspoons milk ", "5 dessertspoons golden syrup"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Brush some oil inside a 500g loaf tin and place it onto a baking tray. Preheat the oven to 180C/350F/Gas 4. ", "Place the flour into a clean bowl with the baking powder, sugar and ginger. ", "Put the oats and milk together in another bowl and set aside for 5-10 minutes so the oats soak up the milk and soften.  ", "Stir the oil and golden syrup into the oats and milk. If you measure the oil first, the golden syrup will slide off the spoon more easily.", "Stir the flour mixture into the oaty milk mixture until all the ingredients are well mixed. ", "Pour the mixture into the greased loaf tin. Place the tin on a baking tray and bake for 25-30 minutes. Leave to cool and serve it in slices with a glass of milk."]}, {"isVegetarian": true, "title": "Picnic pasta salad", "url": "www_bbc_co_uk_food_recipes_picnic_pasta_salad_47257", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picnic_pasta_salad_47257_16x9.jpg", "ingredients": ["300g/10½oz pasta shapes such as penne or macaroni", "250g/9oz cherry tomatoes, halved", "sea salt", "100g/3½oz black olives, stoned, halved ", "200g/7oz feta cheese, crumbled", "225g/7oz baby spinach", "3 tbsp lemon-infused olive oil", "2 tbsp pine nuts, toasted", "large handful torn basil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in a large pan of salted boiling water until al dente. Drain the pasta, rinse in cold water and tip into a large bowl.", "Add the halved tomatoes to the pasta and sprinkle with sea salt. Add the olives, feta and spinach and drizzle with the lemon olive oil.  Add the pine nuts and basil and toss gently before serving."]}, {"isVegetarian": true, "title": "Picnic crudite loaf", "url": "www_bbc_co_uk_food_recipes_picniccruditeloaf_91686", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/picniccruditeloaf_91686_16x9.jpg", "ingredients": ["1 stale crusty white farmhouse loaf", "2 large free-range egg yolks", "1 heaped tsp Dijon mustard", "¼ tsp caster sugar", "1½ tbsp white wine vinegar or lemon juice", "200ml/7fl oz sunflower oil", "salt and freshly ground black pepper", "4 free-range eggs, hard-boiled ", "assorted vegetables (such as radishes, baby carrots, cherry tomatoes, celery sticks and ", "cucumber), washed, trimmed and cut into batons"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Slice off the top of the loaf and set aside. Place the loaf upright onto a work surface and make deep incisions in the crumb, leaving a 2.5cm/1in border of bread around the edges. Hollow out the loaf using your hands (the crumb can be used in another recipe).", "For the mayonnaise, blend the egg yolks, mustard, sugar and white wine vinegar or lemon juice in a food processor until smooth. Gradually add the sunflower oil in a thin stream, whisking continuously until the mixture is smooth and well combined and has thickened. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the mayonnaise into a small sterilised jam jar and fasten tightly. Place the jar inside the hollowed-out loaf of bread. Add the hard-boiled eggs and vegetable batons. Wrap pinches of salt and freshly ground black pepper in individual sachets of aluminium foil and add them to the hollowed-out loaf. Cover the loaf with the reserved top slice of bread, or 'lid'. Wrap in aluminium foil or secure with string and carry with you on your picnic."]}, {"isVegetarian": false, "title": "Picnic of piccalilli, ham, anchovy dip and pork pies", "url": "www_bbc_co_uk_food_recipes_picnicofpiccalilliha_86566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz table salt", "2 litres/3½ pints water", "300g/11oz cauliflower florets", "225g/8oz baby onions, peeled", "225g/8oz cucumber, seeds removed, cut into large chunks", "2 tsp capers, rinsed and drained", "60g/2½oz butter", "4 tbsp flour", "200ml/7fl oz malt vinegar", "200ml/7fl oz white wine vinegar", "50g/2oz caster sugar", "2 tsp ground turmeric", "1¼ tsp mustard powder", "freshly ground black pepper", "1kg/2.2lb raw gammon", "1 onion, cut into quarters", "4 cloves", "2 bay leaves", "2 sprigs fresh thyme", "2 sprigs fresh flatleaf parsley", "4 canned anchovies, drained", "1 lemon, zest only", "1 garlic clove, peeled", "4 tbsp double cream", "75ml/3fl oz extra virgin olive oil", "salt and freshly ground black pepper ", "250g/8¾oz mature cheddar", "4 ready-made pork pies", "1 cauliflower, cut into florets", "1 bunch baby carrots, washed and trimmed", "200g/7oz ripe cherry tomatoes"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the piccalilli, dissolve the salt in the water in a large bowl. Add the cauliflower and onions and stir well to mix, ensuring they are completely submerged in the water. Cover and place into the fridge for 24 hours.", "When you're ready to cook the piccalilli, remove the bowl from the fridge and drain the salted water off. Rinse the vegetables well.", "Place the cauliflower, onions, cucumber and capers into a pan and cover with fresh water. Bring to the boil, then reduce the heat and simmer for ten minutes. Drain once more and set the vegetables aside.", "Meanwhile, heat a pan and cook the butter and flour for 2-3 minutes, stirring frequently.", "Slowly add the two vinegars, stirring constantly, and cook gently for 2-3 minutes, or until just thickened. Add the sugar, turmeric and mustard powder and season with freshly ground black pepper.", "Pour the mustard mixture over the vegetables and stir to combine, making sure all the vegetables are covered in the sauce.", "Pour into sterilised jars and seal. Leave in the fridge for at least five days before eating so that the vegetables can absorb all the flavours. The pickle can be kept in the fridge for up to two weeks.", "For the ham, place the gammon into a large lidded pan and cover with cold water. Stud the onion with the cloves and add to the water with the bay leaves, thyme and parsley. Bring the water to a rapid boil, then turn down the heat, cover the pan and simmer gently for two hours.", "When the ham is cooked, take the pan off the heat and leave the ham to cool in the cooking liquid. When cold, remove from the cooking liquid, trim off any excess fat and slice.", "For the anchovy dip, place the anchovies, lemon zest, garlic and cream into a blender and blend until smooth. Gradually add the olive oil until the sauce is thickened and emulsified. Season, to taste, with salt and freshly ground black pepper.", "Serve the piccalilli with the sliced ham, cheddar cheese and pork pie, the raw vegetables and the anchovy dip."]}, {"isVegetarian": false, "title": "Pie-shaped hidden design cake", "url": "www_bbc_co_uk_food_recipes_pie-shaped_hidden_design_24020", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz salted butter, softened", "175g/6oz unsalted butter, softened", "350g/12oz caster sugar", "6 free-range eggs, lightly beaten", "350g/12oz self-raising flour, sifted", "2 unwaxed lemons, zest only ", "2 tsp baking powder   ", "175g/6oz salted butter, softened", "175g/6oz caster sugar", "3 medium free-range eggs, lightly beaten", "175g/6oz self-raising flour", "½ tsp baking powder", "food colouring in egg yellow, pink/flesh and black ", "125g/4½oz unsalted butter, softened ", "125g/4½oz salted butter, softened ", "350g/12oz icing sugar", "1 lemon, zest and juice", "few drops black food colouring", "1 x 500g pack ready-to-roll fondant icing", "150g/5oz icing sugar", "few drops blue food colouring", "1 or 2 packs modelling paste, cream coloured", "1 x 250g pack sugarpaste, cream coloured", "coloured sugarpaste, black and yellow "], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon sponge cakes, preheat the oven to 180C/350F/Gas 4. Grease and line the bases of four 23cm/9in cake tins. In a large bowl, beat the butters with the sugar until pale and fluffy. Gradually add the eggs, beating well after each addition. Mix in a little flour and the lemon zest. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix between the four tins and gently smooth the surface. Bake for 20–25 minutes, or until a skewer comes out clean, then set aside to cool on wire racks.", "For the small, coloured sponges, grease three mini cake tins (8cm/3in round tins are ideal). In a large bowl, beat the butter with the sugar. Gradually add the eggs, beating well after each addition and then mix in a little flour. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix into three bowls and add the black food colouring to one, the yellow to another and the pink/flesh colour to the third. Pour the mixes into the prepared tins and bake for 15–20 minutes, or until a skewer comes out clean. Cool in the tins on a wire rack. ", "For the buttercream, beat the butter until soft, then add the icing sugar in batches until it is completely incorporated. Mix in the lemon zest and juice. Transfer one tablespoon of buttercream to a separate bowl and mix in the black food colouring a few drops at a time until the buttercream has turned an even black colour. ", "When the small coloured sponges are completely cool, take the yellow sponge and cut it into an open beak shape that is approximately 5cm/2in long. Use the pink cake to make a nose shape that can sit inside the open ‘beak’.", "To assemble the cake, sandwich three lemon sponge cakes together with butter cream. To create a cavity for the ‘beak’ and ‘nose’ to sit in, mark the centre of the cake and cut out a tapered cylinder shape. Insert the pink ‘nose’ and the yellow ‘beak’ (use a small amount of buttercream to fix in place and fill any gaps). ", "Spread buttercream over the top of the cake and add the final layer of cake. To form the cavity for the blackbird’s head, mark the centre of the cake and draw a 10cm circle round it. Scrape out a dome that is deep enough to reach the next layer of cake (so the blackbird’s head will sit immediately on top of the beak). Cut out the same sized dome from the black cake and insert into the dome-shaped cavity.", "To decorate, cut the edge of the bottom cake layer away slightly to create a ‘pie dish’ effect. Cut and shape the top of the cake so it that it resembles a pie top (it doesn't need to be perfect at this stage as it will be covered in fondant icing later).  Cover the entire cake with a layer of buttercream.", "To ice the cake, first roll out the white fondant into a strip large enough to wrap around the side of the cake and form the pie dish base. Trim to fit and apply in one strip. Secure the ends by brushing them with water so they’ll stick together. Mix the icing sugar with water to make a paste and add drops of blue food colouring until the icing is a deep-blue colour.  Pipe clusters of three dots all around the pie dish to create a blue and white ceramic effect. ", "Roll out the cream coloured fondant icing large enough to make a ‘pastry top’. Take one of the cake tins used for the lemon sponge and use it as guide to cut out a circle in the cream fondant icing. Apply to top of cake and crimp the edge so it resembles a pastry top. Cut a cross in the top of the pie and roll back the corners", "For the decorations, use the black and yellow coloured fondant to make a few small blackbird heads and sit them inside the cross of the ‘pastry top’. "]}, {"isVegetarian": false, "title": "Piedmontese peppers", "url": "www_bbc_co_uk_food_recipes_piedmontese_peppers_40938", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piedmontese_peppers_40938_16x9.jpg", "ingredients": ["8-12 ripe plum tomatoes", "4 red peppers, stalks left on (for decoration), cut lengthways in half, seeds removed", "4 garlic cloves, sliced", "5-6 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "8 large canned anchovies, cut in half lengthways", "small handful fresh basil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Pour boiling water over the plum tomatoes, leave for 10 seconds, carefully remove from the water and refresh in a bowl of cold water. Peel off the tomato skins. ", "Place the halved peppers into an ovenproof dish (preferably one that will be nice enough to present later), cut-side up.", "Place the garlic inside the peppers and then fit the tomatoes inside too, pushing them gently into the space. Add a small pinch of salt and a grinding of freshly ground black pepper. Spoon over the olive oil and then place into the oven. Bake for about 45 minutes to one hour, turning the heat down a little if you notice any excessive scorching of the peppers. ", "Once they are nicely softened and have slightly collapsed, remove the peppers from the oven. Criss-cross each pepper half with an anchovy, baste with the oily juices and allow to cool to room temperature. ", "Top with basil leaves and serve."]}]