[{"ingredients": ["200 g / 7 oz de azúcar en polvo", "35 g / 1¼ oz de miel, preferiblemente Solihull Heather", "Glucosa líquida 70 g / 2½ oz (disponible en la sección de horneado de algunos supermercados)", "2 cucharadas de agua", "10 g / ½ oz de bicarbonato de soda", "pimienta negra recién molida", "150 g / 5¼ oz de azúcar en polvo", "150ml / 5¼fl oz de vino tinto dulce Banyuls", "50 ml / 2 fl oz de agua", "Anís de 3 estrellas", "6-7 fresas por persona, cortadas a la mitad si son grandes", "70 g / 2½ oz de azúcar en polvo", "2 cucharadas de agua", "9 huevos de gallinas camperas", "85 g / 3 oz azúcar, más extra para rociar", "Crema doble 500ml / 18fl oz", "2 vainas de vainilla, divididas", "1 manojo pequeño de estragón fresco, frito en aceite vegetal hasta que esté crujiente (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje el aceite caliente desatendido)."], "method": ["Para el panal, coloque el azúcar, la miel, la glucosa y el agua en una sartén y hiérvalos hasta que el líquido alcance los 150 ° C / 300 ° F en un termómetro de azúcar. (Esta cantidad se duplicará en volumen, así que asegúrese de tener una sartén suficientemente grande). Agregue el bicarbonato de soda y bata rápidamente para combinar. La mezcla se levantará en la sartén cuando se agregue el bicarbonato de soda, así que ten cuidado. Inmediatamente vierta la mezcla en una bandeja antiadherente. Agregue varias moliendas de pimienta negra recién molida y déjelas enfriar, sin tapar. Romper en fragmentos.", "Para las fresas marinadas, coloca el azúcar, el vino tinto, el agua y el anís estrellado en una olla mediana y calienta a fuego lento hasta que el líquido se haya reducido a la mitad. Verter el líquido reducido sobre las fresas en un recipiente pequeño y dejar en infusión durante 30 minutos.", "Para el caramelo, hierva el azúcar y el agua juntos en una sartén poco profunda hasta que se dore. Cepille el costado de la sartén con agua cada 40 segundos. Vierta sobre una bandeja para hornear antiadherente engrasada y deje enfriar. Cuando el caramelo se haya fragmentado, hiérvese en fragmentos.", "Para la crema inglesa quemada, quite la parte superior de los huevos con un removedor especial de huevos (disponible en tiendas especializadas de utensilios de cocina) y vierta el contenido a través de un separador de huevos (disponible en tiendas especializadas de utensilios de cocina). Aparte las claras de huevo para otra receta (como el merengue, se mantendrán cubiertas en la nevera durante dos días) y coloque las yemas de huevo en un tazón. Retire la membrana y limpie y seque las cáscaras de huevo.", "Agregue el azúcar al tazón con las yemas de huevo y mezcle hasta que esté pálido y esponjoso. Vierta la crema en una sartén pequeña, agregue las semillas de vainilla y coloque sobre un fuego suave para infundir la crema con la vainilla. Cuando la crema esté justo por debajo del punto de ebullición, retírela del fuego, deseche las vainas de vainilla y vierta la crema caliente sobre las yemas de huevo y el azúcar y bata hasta que se combinen. Vierta la mezcla de crema en una sartén limpia, regrese a un fuego suave y revuelva hasta que la mezcla comience a espesar lo suficiente como para cubrir el revés de una cuchara de madera. Dejar de lado y dejar enfriar un poco.", "Con cuidado, vierta la mezcla de crema en las cáscaras de huevo limpias y déjelas a un lado en una caja de huevos vacía para mantenerlas niveladas.", "Para servir, espolvorea un poco de azúcar sobre la crema en cada huevo y carameliza con un soplete. Sirva el huevo en una pequeña huevera en un plato pequeño. Sirva con las fresas infundidas y adorne con el panal de pimienta negra, el caramelo y las hojas de estragón fritas."], "url": "www_bbc_co_uk_food_recipes_marinatedstrawberrie_88476", "title": "Fresas con estragón y pimienta de panal negro con crema quemada sorpresa en inglés", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de almendras blanqueadas", "125g / 4½oz de avellanas blanqueadas", "300 g / 10½ oz de azúcar en polvo", "25g / 1 oz de harina de maíz", "6 claras de huevo grandes de gallinas camperas (reserva las yemas)", "270ml / 9½ fl oz crema doble", "360 g / 12% C2% BDoz% 20plain% 20chocolate,% 2046 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "300 g / 10½ oz de azúcar en polvo", "100 g / 3½ oz de almendras blanqueadas", "225 g / 8 oz de azúcar en polvo", "pizca de crema de tártaro", "8 yemas de huevo de gallinas camperas", "350g / 12oz de mantequilla sin sal, ligeramente ablandada, cortada en trozos", "150g / 5½oz de almendras en copos", "50 g / 1¾oz de avellanas, picadas", "50 g / 1¾oz de pistachos, slivered"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Poner en línea dos latas de 30x20 cm / 12x8 in Swiss Roll con papel para hornear.", "Para el dacquoise, incline las almendras y avellanas en el tazón de procesador de alimentos y pulse hasta que esté finamente molido. Extienda las nueces molidas en una capa en una bandeja para hornear y tueste durante 10 minutos, revolviendo cada 3 minutos hasta que estén doradas. Transfiera a un tazón grande y deje enfriar. Cuando esté frío, agregue 100 g / 3½ oz del azúcar impalpable y la harina de maíz. Reduzca la temperatura del horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Vierta las claras de huevo en el cuenco de un mezclador eléctrico independiente equipado con un accesorio batidor y bata a velocidad media durante unos 2 minutos, hasta que las claras de huevo estén opacas y espumosas. Aumente la velocidad y agregue el 200g / 7oz de azúcar en polvo restante, una cucharada a la vez, para hacer un merengue tieso y brillante. Doble suavemente la mezcla de nueces tostadas a través del merengue.", "Divida el merengue por igual entre las latas de rollos suizos y extiéndalo uniformemente con una espátula. Hornee durante 45-60 minutos, hasta que estén dorados claros y firmes al tacto. Apague el horno y abra la puerta del horno para que quede entreabierta, luego deje el dacquoise dentro hasta que esté completamente frío.", "Retire del horno e invierta cuidadosamente en una hoja de pergamino para hornear. Retire con cuidado el pergamino para hornear de la parte inferior de los merengues.", "Para la ganache de chocolate, vierta la crema en una sartén y caliente hasta que hierva a fuego lento. Pon el chocolate en un tazón resistente al calor y vierte sobre la crema. Revuelva hasta que el chocolate se derrita y la mezcla esté suave. Dejar enfriar y luego enfriar el ganache hasta que se espese lo suficiente como para extender y cañer.", "Para el praliné, forre una bandeja para hornear con papel de hornear antiadherente. Combine el azúcar impalpable y 100 ml / 3½ fl oz de agua en una sartén a fuego medio, revolviendo hasta que el azúcar se disuelva. Aumente el fuego y hierva, sin remover, hasta que el caramelo se ponga dorado o alcance los 170 ° C en un termómetro de azúcar (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado. Use una sartén profunda para evitar burbujear). Mientras tanto, tuesta las almendras en una sartén seca hasta que estén doradas. Retire el jarabe de azúcar del fuego y agregue las almendras, revuelva bien y voltee en la bandeja preparada. Deja enfriar. Divida el bombón en pedazos y mezcle hasta obtener un polvo fino en un procesador de alimentos.", "Para la crema de mantequilla, vierta 5 cucharadas de agua en una sartén de base pesada con el azúcar y la crema de tártaro. Llevar a ebullición y hervir rápidamente hasta que llegue a 115C en un termómetro de azúcar (etapa de bola blanda). Vierta las yemas en el tazón de un mezclador eléctrico equipado con el accesorio batidor. Con la batidora funcionando a velocidad media, vierta gradualmente el jarabe de azúcar, teniendo cuidado de no echar el jarabe en los batidores. Continúe batiendo durante 5-10 minutos hasta que la mezcla esté espesa y completamente fría. Poco a poco agregue la mantequilla poco a poco, batiendo continuamente. Incorpore el polvo de praliné y deje enfriar hasta que lo necesite.", "Para ensamblar, tueste las almendras y las avellanas en una sartén seca hasta que estén doradas. Con un cuchillo muy afilado, corte las hojas dacquoise por la mitad, de modo que tenga cuatro hojas, cada una de las cuales mide 30x10cm / 12x4in. Coloque una hoja de merengue en un plato de servir y unte con un cuarto de crema de mantequilla. Cubra con una segunda hoja de merengue y unte con un tercio de la ganache. Cubra con una tercera hoja de merengue y unte con otra cuarta parte de la crema de mantequilla. Cubra con la hoja final de merengue.", "Extienda la crema de mantequilla restante sobre la parte superior y los lados y presione las almendras copos tostadas en los lados del pastel. Coloque el ganache restante en una manga pastelera equipada con una boquilla pequeña (no 33). Pase la ganache de chocolate por el borde superior de la torta y en cinco líneas diagonales, en la parte superior de la torta. Llene los huecos entre las líneas diagonales con alternancia de avellanas y pistachos."], "url": "www_bbc_co_uk_food_recipes_marjolaine_71611", "title": "mejorana", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marjolaine_71611_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 butternut, pelado y en rodajas", "2 patatas dulces grandes, peladas y en rodajas", "¼ de calabaza kabocha, pelada y en cubos", "2 calabacines verdes, en cubos", "2 calabacines amarillos, en cubos", "1 berenjena grande, en cubos", "4 limones, solo jugo", "50ml / 2fl oz de vinagre balsámico", "1 cucharadita de polvo de jengibre", "2 cucharadas de salsa de soja oscura", "aceite de oliva", "50 g / 2 oz de jengibre fresco, picado", "sal y pimienta negra recién molida"], "method": ["Mezcle todos los ingredientes del adobo en un tazón grande.", "Pele el butternut y las batatas, luego corte en trozos no mayores de ½-¾cm / ¼-½ pulgada de grosor.", "Dice las verduras restantes al mismo tamaño.", "Sumerja todas las verduras en el adobo durante 2 horas.", "Saque las verduras del adobo y elimine el exceso de líquido.", "Coloque la sartén de la plancha o la sartén sobre la placa y rocíe con un poco de aceite de oliva, asegúrese de que la sartén esté caliente.", "Coloque las verduras en la sartén y ase a la parrilla durante 2-3 minutos."], "url": "www_bbc_co_uk_food_recipes_marinatedvegetables_10899", "title": "Vegetales marinados", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de masa de pasta líquida precocida", "250g / 9oz de mantequilla sin sal", "250 g / 9 oz de azúcar en polvo", "4 huevos de gallinas camperas", "Almendras molidas 250 g / 9 oz", "1 jarra de mermelada", "150g / 5½ oz de almendras en copos", "250g / 9oz de crema cuajada o crème fraîche, para servir"], "method": ["Precaliente el horno a 160C / 140C Fan / Gas 3 y forre una lata tarta de 20cm / 8in con la masa.", "Haga una pasta de almendras batiendo la mantequilla y el azúcar en un tazón grande. Agregue los huevos uno por uno, batiendo bien entre cada adición. Mezcle las almendras molidas, luego coloque en la nevera para enfriar durante 10 minutos.", "Extienda una cantidad muy generosa de la mermelada en la base de la tarta. Cubra con la pasta de almendras y esparza sobre las almendras copos. Hornee por 40-50 minutos, hasta que la masa esté crujiente y el relleno dorado y levantado.", "Sirva la tarta en rebanadas con crema cuajada o crema fresca."], "url": "www_bbc_co_uk_food_recipes_marmalade_and_almond_20972", "title": "Mermelada y tarta de almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo", "3 cucharadas de mermelada fina", "2 huevos de gallinas camperas", "150 g / 5½ oz de sémola", "75g / 2½ oz de almendras molidas", "½ cucharadita de polvo de hornear", "2 naranjas, ralladura finamente rallada solamente", "50ml / 2fl oz de jugo de naranja", "25g / 1oz de mantequilla sin sal, ablandada", "175g / 6oz de queso crema", "100g / 3½oz de azúcar glasé"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pastel con forma de resorte de 20 cm / 8 pulg. Y forre la base con papel para hornear.", "Bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir la mermelada y luego batir en los huevos, uno a la vez.", "En un recipiente aparte, combine a fondo la sémola, las almendras y el polvo de hornear. Agregue a la mezcla, junto con la ralladura de naranja, y dóblela. Finalmente, mezcle el jugo de naranja para crear una mezcla con una consistencia suave.", "Vierta la mezcla en la lata de torta preparada y alise la parte superior con el dorso de una cuchara.", "Hornee por 35 minutos o hasta que el pastel esté dorado. Dejar enfriar en la lata durante cinco minutos, luego retirar y transferir a una rejilla para que se enfríe por completo.", "Para hacer el glaseado, bata la mantequilla y el queso crema juntos. Tamiza el azúcar glas y bate hasta que quede suave. Use una espátula para extender el glaseado en la parte superior de la torta. Enfriar antes de servir, por lo que la formación de hielo se establece."], "url": "www_bbc_co_uk_food_recipes_marmalade_and_almond_75536", "title": "Torta de mermelada y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marmalade_and_almond_75536_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2.5kg / 5lb 8 oz gammon", "1 limón, reducido a la mitad", "1 naranja, reducido a la mitad", "1 manzana, partida por la mitad", "1 ramita de canela", "1 cebolla, partida por la mitad", "2 chiles secos", "Anís de 5 estrellas", "375g / 13oz de mermelada", "200g / 7 oz de miel", "2 cucharaditas colmadas de mostaza inglesa", "1 cucharadita de clavo de olor", "1kg / 2lb 4oz nuevas patatas", "50g / 1¾oz de mantequilla", "Leche 400ml / 14fl oz", "1 cebolla, cortada a la mitad, cada mitad tachonada con 2 dientes y 1 hoja de laurel", "50g / 1¾oz de mantequilla", "Harina normal de 25g / 1oz", "Crema doble 50ml / 2fl oz", "exprimir jugo de limón", "perejil de flatleaf fresco de manojo pequeño, finamente picado", "sal marina y pimienta negra recién molida"], "method": ["Coloque el gammon en una cacerola con tapa grande, de base pesada con limón, naranja, manzana, canela, cebolla, chiles y 2 de anís estrellado. Vierta suficiente agua para cubrir el gammon.", "Cubra la olla con la tapa, colóquela sobre el fuego, hierva el agua, luego baje la temperatura hasta hervir a fuego lento. Cocine a fuego lento durante 2 horas o hasta que la carne esté tierna, luego déjela reposar para que se enfríe en el líquido de cocción.", "Precalentar el horno a 230C / 210C Fan / Gas 7.", "En una sartén pequeña, caliente la mermelada, la miel, la mostaza, el anís de 3 estrellas restante y los clavos en una sartén pequeña hasta que las conservas se hayan derretido, luego revuelva y reserve.", "Levante el jamón enfriado del líquido de cocción y transfiéralo a una lata para asar. Talla la capa de grasa en la parte superior del jamón en un patrón entrecruzado, luego extiende el glaseado de mermelada sobre la parte superior. Vuelva al horno por otros 20 minutos, rociándolo con el esmalte cada 5-8 minutos, hasta que la superficie del gammon se dore y empiece a ennegrecerse en el borde.", "Mientras tanto, hierva las papas en una cacerola de agua con sal durante 10-15 minutos, o hasta que estén tiernas, luego drene y vuelva a la sartén. Agregue la mantequilla para cubrir, luego condimente, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para la salsa de perejil, vierta la leche en una cacerola y agregue las mitades de cebolla con tachuelas de clavo. Caliente hasta que hierva a fuego lento, luego apague el fuego y déjelo en infusión durante unos minutos.", "En una olla aparte, caliente la mantequilla hasta que se derrita, luego bata la harina hasta que esté bien combinada y cocínela durante 30 segundos. Agregue la leche infundida un poco a la vez, espere hasta que la salsa se espese antes de agregar cada nuevo lote de leche; debe terminar con una salsa suave y la consistencia de crema doble. Agregue la crema doble y luego cocine durante 1-2 minutos más. Sazone con jugo de limón, a gusto, sal y pimienta negra recién molida, luego retire la sartén del fuego y agregue el perejil picado.", "Para servir, apile las papas con mantequilla en un plato de servir y coloque el jamón en la parte superior. Vierta la salsa de perejil en una jarra para servir al lado. Tallar en la mesa."], "url": "www_bbc_co_uk_food_recipes_marmalade_and_mustard_13434", "title": "Mermelada de mermelada y mostaza con salsa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "100g / 3½ oz de harina de auto aumento", "50 g / 1¾ oz mantequilla, ablandada", "50 g / 1¾ oz de azúcar en polvo", "½ cucharadita de especias mixtas", "1 cucharada de mermelada", "1 cucharada de jugo de naranja", "2 cucharadas de pasas", "1-2 cucharadas de leche", "1 cucharada de azúcar demerara"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de pan.", "Ponga la harina y la mantequilla en un tazón y frote hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar impalpable y la mezcla de especias.", "Mezcle la mermelada, el jugo de naranja, las pasas y una cucharada de leche juntos en un recipiente aparte.", "Revuelva la mezcla de mermelada en la mezcla de harina, luego espolvoree la lata de pan. Espolvorea sobre el azúcar demerara.", "Hornee por 30-35 minutos, o hasta que se levante y dorado, y un probador de pastel insertado en el centro salga limpio."], "url": "www_bbc_co_uk_food_recipes_marmalade_cake_63038", "title": "Pastel de mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de yogur griego al estilo de la grasa", "50ml / 2fl oz de aceite vegetal", "1 limón, ralladura solamente", "1 naranja, solo ralladura", "3 huevos de gallinas camperas", "125g / 4½ azúcar en polvo", "Harina normal de 200g / 7oz", "2 cucharaditas de polvo de hornear", "75g / 3oz de mermelada", "1 cucharada de jugo de naranja", "Yogur de estilo griego"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de hogaza de 450 g / 1 lb.", "En un tazón grande, bata el yogur, el aceite vegetal, la ralladura de limón y naranja y los huevos hasta que estén suaves y esponjosos. Tamiza todos los ingredientes secos y mezcla hasta que se combinen.", "Vierta la mezcla en la lata de pan y hornee por unos 45 minutos. (Pruebe el pastel insertando un pincho en el centro. Si el pincho sale limpio, el pastel está hecho).", "Retirar del horno y dejar enfriar un poco en la lata.", "Mientras tanto, para el glaseado, caliente la mermelada y el jugo de naranja hasta que la mermelada se derrita. Vierta el glaseado sobre el pastel y déjelo enfriar por completo.", "Retire la torta de la lata y sirva con montones de yogur al estilo griego."], "url": "www_bbc_co_uk_food_recipes_marmalade_yoghurt_cake_97760", "title": "Torta de yogur mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta de pan de 450 g / 1lb", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marmalade_yoghurt_cake_97760_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de salmón de 100 g / 3½ oz, sin piel", "1 cucharadita de mermelada de naranja", "dash aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de semillas de sésamo, tostadas en una sartén caliente", "85g / 3oz de papas nuevas, cocinadas, mantenidas calientes", "3 cucharadas de yogur al estilo griego", "1 cucharadita de salsa de soja", "pequeño puñado de eneldo fresco, picado", "sal y pimienta negra recién molida", "½ chile rojo, finamente picado", "2 cucharaditas de jengibre fresco de raíz, rallado", "3 cucharadas de aceite de oliva", "½ naranja, solo jugo", "2 cucharaditas de aceite de sésamo", "1 cucharada de salsa de soja", "1 cucharada de semillas de sésamo, tostadas en una sartén caliente"], "method": ["Para el salmón asado, coloque el filete de salmón en una sartén caliente y dórelo por todos lados hasta que se dore por fuera pero aún rosado en el medio.", "Cepille el salmón con mermelada y aceite de oliva, luego enrolle las semillas de sésamo tostadas para cubrir bien. Deje que se enfríe y luego, con un cuchillo muy afilado, corte el salmón ligeramente.", "Para las papas nuevas trituradas, coloque las papas cocidas en un bol, agregue el resto de los ingredientes triturados de patatas nuevas y triture aproximadamente con la parte posterior de un tenedor.", "Para el aderezo, coloque los ingredientes del aderezo en un tazón pequeño y bata para combinar.", "Para servir, coloque las papas nuevas trituradas en un plato de servir. Coloque las rodajas de salmón al lado y rocíe con el aderezo."], "url": "www_bbc_co_uk_food_recipes_marmaladeandsesamero_88300", "title": "Marmalade y salmón asado de sésamo con patatas nuevas trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "5 cucharadas de mermelada", "Panettone prefabricado de 325 g / 11½ oz, en rodajas finas", "4 huevos grandes de gallinas camperas", "500ml / 18fl oz de leche entera", "2-3 gotas de extracto de vainilla", "crema doble, para servir"], "method": ["Precalienta el horno a 180 ° C / 355 ° F / Gas 5. Ligeramente un plato hondo para horno.", "Derretir la mermelada en una olla pequeña a fuego lento. Coloque la mitad de las rebanadas de panettone en una sola capa en el plato con mantequilla, luego cuchara más de la mitad de la mermelada.", "Batir los huevos junto con la leche y el extracto de vainilla. Vierta la mitad de la mezcla de huevo y leche sobre el pan dulce, luego cubra las rebanadas restantes de pan dulce, el resto de la mermelada y el resto de la mezcla de huevo y leche.", "Hornee el pudín en el horno durante 35-40 minutos, o hasta que esté hinchado y dorado. Agítelo suavemente, se tambaleará pero no mostrará indicios de flan sin cocer.", "Sirva caliente con una llovizna de crema doble."], "url": "www_bbc_co_uk_food_recipes_marmaladepanettonepu_89197", "title": "Pudín de mermelada panettone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de buena mermelada (preferiblemente mermelada de naranja de Sevilla)", "1 cucharada de jengibre, finamente picado", "3 dientes de ajo finamente picados", "2 cucharaditas de mostaza Dijon", "½ cucharadita de sal marina", "pimienta negra recién molida", "50ml / 1¾fl oz de jugo de naranja", "1 cucharada de aceite de oliva", "8 pedazos de pollo, piernas o muslos", "4 cebolletas, finamente picadas", "ensalada o puré de patatas, para servir."], "method": ["Caliente el horno a 180C / 350F / Gas 4.", "En un tazón, combine la mermelada, el jengibre, el ajo, la mostaza, la sal, la pimienta, el jugo de naranja y el aceite de oliva y mezcle bien.", "Agregue el pollo y el abrigo bien.", "Cubra una lata de horno con papel de cocina e incline el pollo y su adobo en la lata.", "Cubra la parte superior con papel de aluminio y hornee durante 30 minutos.", "Retire la lámina superior, vierta la mezcla de mermelada en el fondo de la sartén sobre el pollo y hornee sin tapar durante 15-20 minutos hasta que el pollo esté dorado (tenga cuidado con la quema).", "Agregue las cebolletas cerca del final de la cocción para calentar, sazonar bien, contrastar con la dulzura del jugo de naranja y servir con ensalada o puré."], "url": "www_bbc_co_uk_food_recipes_marmaladechicken_71450", "title": "Pollo mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla ablandada, más extra para engrasar", "Azúcar en polvo de 55 g / 2 oz", "1 huevo de gallinas camperas", "Harina de 55g / 2oz", "1 cucharada de leche", "2 cucharadas de mermelada de naranja", "3 cucharadas de mermelada de naranja", "exprimir jugo de naranja fresco", "2 yemas de huevo de gallinas camperas", "2 cucharadas de harina de maíz", "30 g / 1 oz de azúcar en polvo", "4 vainas de cardamomo, semillas trituradas", "300 ml / ½ litro de leche"], "method": ["Para los budines de esponja, coloque la mantequilla y el azúcar ablandados en un procesador de alimentos y mezcle hasta que quede suave y liviano.", "Agregue el huevo, la harina y la leche y mezcle de nuevo a una masa suave.", "Engrase dos moldes y agregue una cucharada de mermelada en el fondo de cada uno. Divida la pasta de esponja entre los dos moldes asegurándose de que el fondo de la mermelada esté completamente cubierto. Deje unos centímetros de espacio en la parte superior para que las esponjas se levanten. Cubra con una película adhesiva y cocínelo en el microondas en su configuración más alta durante 4-5 minutos. Retire la película adhesiva, afloje los bordes de la esponja con un cuchillo, y coloque las esponjas en dos platos para servir.", "Para el jarabe de naranja, coloque la mermelada y el jugo de naranja en una sartén pequeña a fuego lento y cálida.", "Para la crema inglesa, coloque las yemas de huevo, la harina de maíz, el azúcar y el cardamomo en una olla pequeña y revuelva hasta que se combinen. Coloque a fuego lento y gradualmente agregue la leche, revolviendo constantemente, hasta que espese.", "Para servir, vierta el jarabe de naranja sobre cada esponja y sirva el cardamomo crema inglesa en una jarra al lado."], "url": "www_bbc_co_uk_food_recipes_marmaladespongepuddi_88298", "title": "Mermelada de esponja mermelada con crema de cardamomo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["la cabeza y los huesos del bonito (ver más abajo), o puedes usar merluza o cabeza de bacalao y huesos (puedes conseguirlos del pescadero)", "2 cucharadas de aceite de oliva", "1 puerro, más o menos picado", "1 zanahoria, más o menos picada", "1 diente de ajo, muy finamente picado", "1 cebolla, más o menos picada", "1 hoja de laurel", "1 cucharada de aceite de oliva", "2 dientes de ajo, aplastados", "1 cebolla, muy finamente picada", "1 pimiento rojo italiano grande (alrededor de 200 g / 7 oz) muy finamente picado", "200g / 7oz padron pepper, muy finamente picado", "1 chile rojo, finamente picado y sin semillas", "5-6 tomates de ciruela maduros, rallados, para hacer una salsa", "2 pimientos choriceros secos, remojados en agua. Marque los pimientos y raspe la pasta desde el interior con una cuchara, dejando la piel (si no puede obtener los pimientos, puede comprar la pasta)", "200ml / 7fl oz de Txakoli (un vino vasco) u otro vino blanco seco y ligeramente espumoso", "1kg / 2lb 4oz de papas, peladas, cortadas en trozos del mismo tamaño que los pescados", "1 hoja de laurel", "75ml / 2½fl oz de aceite de oliva virgen extra", "2kg / 4lb 8oz bonito (si no puede agarrar uno, use 1kg / 2lb 4oz de atún fresco) cortado en trozos grandes", "manojo de perejil, más o menos picado", "150ml / 5fl oz de aceite de oliva virgen extra", "50ml / 2fl oz de vinagre Moscatel", "1 chalote, muy finamente picado", "pequeño grupo de cebolletas, finamente picado", "3 pimientos del piquillo vasco dulce (de un tarro), cortados en tiras", "2 cabezas de Little Gem, solo hojas", "sal y pimienta negra recién molida"], "method": ["Para el stock de peces, limpie las agallas de los peces, asegúrese de que no haya sangre en absoluto. Caliente el aceite de oliva en una sartén grande. Cocine con cuidado las verduras, agregue la cabeza y los huesos del pescado, 3 litros / 5¼ litros de agua y una hoja de laurel. Caliente el caldo para que esté humeante, pero no hierva, durante 20 minutos. Pasar a través de un tamiz y reservar.", "Para el marmitako, en una olla grande calentar el aceite de oliva. Freír la cebolla y el ajo con cuidado. Cuando esté medio suavizado, agregue el pimiento rojo y cocine durante 2 minutos, luego agregue la pimienta de padrón. Cuando todo esté suave agregue la salsa de chile y tomate.", "Cocina la acidez y el agua del tomate para que quede como una pasta. Agregue la pasta de choriceros y el vino. Cocine el alcohol por unos segundos y luego agregue los trozos de papa y sazone con sal y pimienta. Vierta 200ml / 7fl oz de caldo de pescado y agregue una hoja de laurel. La papa debe demorar unos 20 minutos en cocinarse.", "Mientras tanto, en una sartén por separado, caliente hasta que esté muy caliente, agregue 75 ml / 2½ fl oz de aceite de oliva y rellene rápidamente el bonito (o atún) para que se caramelice por fuera pero manténgalo crudo en el medio.", "Una vez que las papas estén cocidas, agregue el pescado al estofado, mezcle suavemente y retire la sartén del fuego. Coloque la tapa y déjela reposar durante 10 minutos. Después de diez minutos, agítelo suavemente. Mezcle el perejil picado en el guiso, rocíe con aceite de oliva y sirva.", "Para la ensalada de gema para bebé, en un tazón pequeño, mezcle el aceite de oliva y el vinagre hasta que se emulsionen, agregue la chalota y el cebollín y sazone. Agregue los pimientos del piquillo y mezcle suavemente para que no se rompan.", "Para servir, coloque unas hojas en un plato y rocíe con el aderezo. Coloque algunas hojas más en la parte superior y rocíe de nuevo, y así sucesivamente, para que las hojas permanezcan crujientes. Condimentar con sal y pimienta.", "Sirva el marmitako en tazones con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_marmitako_46210", "title": "Marmitako (guiso de pescado vasco)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "24 hojas de salvia fresca, dependiendo del tamaño", "ramitas de flatleaf perejil (opcional)", "2 zanahorias grandes (alrededor de 400 g / 14 oz de peso total)", "1 pastinaca grande (alrededor de 255 g / 9 oz)", "½ gran apio nabo (alrededor de 500 g / 1 lb 2 oz)", "50g / 1¾oz de mantequilla", "¼ de nuez moscada entera, recién rallada", "sal marina escamada y pimienta negra recién molida", "50g / 1¾oz de mantequilla, cortada en cubos", "2 cebollas grandes, cortadas a la mitad y finamente cortadas", "1 cucharada de aceite de girasol", "8 chuletas de cordero", "4 riñones de cordero", "1 cucharada de harina normal", "150ml / 5fl oz de vino Marsala (o Madeira o medio jerez)", "sal marina escamada y pimienta negra recién molida", "judías verdes recién cocinadas, para servir"], "method": ["Para hacer la guarnición, vierta el aceite en una sartén pequeña y colóquelo a fuego medio durante un par de minutos. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido). Baje las hojas de salvia suavemente dentro del aceite con una cuchara o tenaza ranurada, teniendo cuidado de evitar salpicaduras o salpicaduras de aceite.", "Freír las hojas de salvia durante 20-30 segundos, o hasta que se vean translúcidas, pero no comiencen a dorarse. Levante rápidamente el aceite con una cuchara ranurada o pinzas y escurra sobre papel de cocina; dejar de lado. Crujirán aún más a medida que se enfríen.", "Para las tres puré de raíz, pele todas las verduras y córtelas en trozos de 2.5 cm. Coloque las verduras en una olla grande y cúbralas con agua fría. Llevar a ebullición a fuego alto.", "Reduzca la temperatura ligeramente y cocine a fuego lento las verduras durante 25-30 minutos, o hasta que estén tiernas.", "Escurra las verduras en un colador y luego regrese a la cacerola y mezcle con la mantequilla, la nuez moscada rallada y mucha sal y pimienta al gusto. Para obtener un puré extra suave, mezcle con una batidora hasta que quede suave y aterciopelado.", "Para el cordero, derretir 25 g / 1 oz de la mantequilla en una sartén antiadherente grande y resistente y freír las cebollas a fuego lento durante 10 minutos, revolviendo ocasionalmente. Aumente el fuego y cocine por 3-4 minutos más, revolviendo constantemente hasta que se doren. Incline las cebollas en un plato y colóquelas a un lado.", "Regrese la sartén al fuego y agregue el aceite de girasol. Sazonar las chuletas de cordero muy bien con sal y pimienta y freír a fuego medio-alto durante 2 ½-3 minutos en cada lado.", "Mientras el cordero se cocina, prepare los riñones. Primero dales un buen enjuague en un colador y luego voltéalos sobre un tablero y córtalo por la mitad por la mitad para obtener dos piezas iguales en forma de riñón. Con unas tijeras de cocina afiladas, corte con cuidado el núcleo central blanco.", "Ponga la harina común en un recipiente, agregue un par de buenas pizcas de sal y algunos giros de pimienta negra molida. Mezcle los riñones en la harina sazonada hasta que estén ligeramente recubiertos. Sacuda cualquier exceso de harina antes de freír.", "Coloque las chuletas de cordero en su lado grueso y déjelas hervir por otros 2-3 minutos, o hasta que estén doradas. Agregue los riñones a la sartén con el cordero. Cocine los riñones por un lado durante tres minutos.", "Transfiera el cordero a un plato caliente y déjelo reposar. Gire los riñones y cocine durante otros tres minutos en el otro lado, o hasta que estén ligeramente dorados y cocidos. Si tiene dudas, voltee y cocine por un minuto extra en cada lado. Pon los riñones en el plato con el cordero. Escurra el exceso de grasa de la sartén y vuelva a colocarla sobre el fuego.", "Regrese las cebollas fritas a la sartén y cocine por 1-2 minutos, o hasta que estén calientes, revolviendo con una cuchara de madera. Agregue el Marsala y luego revuelva rápidamente los restantes cubos de mantequilla. La salsa se espesará al revolver.", "Acomode las chuletas de cordero y los riñones en cuatro platos calentados y una cuchara sobre las cebollas de Marsala. Espolvorear con las hojas de salvia fritas y decorar con ramitas de perejil de flatleaf si lo desea. Sirve con tres puré de raíz y judías verdes recién cocinadas."], "url": "www_bbc_co_uk_food_recipes_marsala_lamb_chops_with_43717", "title": "Chuletas de cordero Marsala con cebolla asada y riñones fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["240g / 8oz de mantequilla", "150 g / 5 oz de chocolate negro (uno picante funciona bien)", "60g / 2oz de cacao", "Harina normal 150g / 5oz", "500 g / 1 lb 2 oz de azúcar en polvo", "5 huevos, golpeados", "Marshmallows 150g / 5oz, picados"], "method": ["Caliente el horno a 190 ° C / 375 ° F / Gas 5. Cubra una lata cuadrada de 30 cm / 12 pulgadas con pergamino para hornear.", "Derretir la mantequilla y el chocolate juntos muy suavemente.", "Mezcle el cacao con la harina y el azúcar y, sin el calor, mezcle esta mezcla con la mantequilla y el chocolate. Mezcle los huevos y dóblelos en los malvaviscos.", "Convierte la mezcla de brownie en la lata y hornea en el horno hasta que la superficie se haya endurecido, pero aún se siente squidgy debajo. Esto llevará unos 20 minutos. Deje enfriar y cortar."], "url": "www_bbc_co_uk_food_recipes_marshmallowbrownies_8128", "title": "Marshmallow brownies", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marshmallowbrownies_8128_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 bolsitas de 7 g de gelatina en polvo", "450 g / 1lb de azúcar en polvo", "2 cucharaditas de extracto de vainilla (o 1 cucharadita de extracto de almendra)", "1 cucharada de aceite de girasol", "50g / 2oz de azúcar glas, más extra para el dragado", "50g / 2oz de harina de maíz, más extra para dragado", "pistachos finamente picados, pétalos de flores cristalizados, o azúcar de color caster para cubrir (opcional)"], "method": ["Coloque la gelatina y 100 ml / 3½ fl oz de agua fría en un recipiente. Dejar de lado por 10 minutos, o hasta que se suavice.", "Mientras tanto, vierta el azúcar y 175 ml / 6 fl oz de agua fría en una olla de base pesada y deje hervir a fuego medio a alto, revolviendo continuamente, hasta que el azúcar se disuelva.", "Reduzca el fuego a bajo y cocine a fuego lento la mezcla suavemente durante 15-20 minutos, hasta que un termómetro de azúcar sumergido en la mezcla indique 113C / 235F. (NB: A esta temperatura, el jarabe de azúcar habrá alcanzado la etapa de bola blanda). PRECAUCIÓN: esta mezcla es extremadamente caliente y puede ser peligrosa. No dejes desatendido", "Tan pronto como el jarabe de azúcar alcance la temperatura correcta, coloque la gelatina ablandada y el agua en la taza de un mezclador de alimentos y mezcle en su configuración más baja. Poco a poco vierta el jarabe de azúcar en un flujo lento y constante, evite verter el jarabe de azúcar en los batidores, ya que puede salpicar. Batir continuamente hasta que todo el jarabe se haya incorporado por completo en la mezcla.", "Agregue el extracto de vainilla, luego aumente la velocidad de mezclado y mezcle durante 18-20 minutos, o hasta que la mezcla se espese, se enfríe y comience a fraguar.", "Mientras tanto, engrase una lata cuadrada de 20cm / 8pulg con una porción del aceite de girasol. Alinee el pergamino para hornear y engrase el papel con el aceite restante. Mezcle el azúcar glas y la harina de maíz y el polvo de la lata con un poco de la mezcla para cubrir uniformemente la base y los lados. Reserve el resto de la mezcla de azúcar glas y harina de maíz para más tarde.", "Vierta la mezcla de malvaviscos en la lata preparada y alise la superficie con un espátula o espátula que haya sido sumergida en agua hirviendo. Espolvorea la parte superior de los malvaviscos con un poco más de la mezcla de azúcar glasé y harina de maíz, luego cubre la lata con película adhesiva y déjala en un lugar fresco y seco durante 1-2 horas o toda la noche para prepararla. (NB: No enfríe en la nevera).", "Una vez que la mezcla de malvaviscos se haya solidificado, coloque la losa de malvavisco sobre una superficie de trabajo limpia, espolvoreada con el resto del azúcar glasé y la mezcla de harina de maíz. Despegue el papel pergamino y corte el malvavisco en 36 cubos. Separe los malvaviscos en la mezcla de azúcar glas y harina de maíz para cubrirlos, o cubra uno o más lados con nueces picadas, pétalos de flores o azúcar de colores para decorar. Almacene en un recipiente hermético en un lugar fresco y seco por hasta tres semanas."], "url": "www_bbc_co_uk_food_recipes_marshmallows_93239", "title": "Malvaviscos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "36 malvaviscos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ cucharadita de cúrcuma molida", "1 cucharadita de cilantro molido", "1 cucharadita de semillas de mostaza amarilla", "3 dientes de ajo, toscamente picados", "½-1 Scotch bonnet chilli, semillas removidas", "1 cucharadita de copos de sal marina", "12 piezas de pollo (una mezcla de muslos y baquetas)", "sal y pimienta negra recién molida", "4 cucharadas de aceite de girasol o maní", "2 cebollas, más o menos picadas", "500 g / 1 libra de calabaza de 2 onzas, pelada, sin semillas, cortada en cubos de 5 cm / 2 in", "2 berenjenas, cortadas en cubos de 4cm / 1½ pulgadas", "2-3 papas cerosas grandes, peladas y cortadas en pedazos de 4cm / 1½ pulgadas", "1 x 400 ml / 14fl oz puede leche de coco", "300 ml / ½ pinta de caldo de pollo", "1 cucharada de pasta de tamarindo", "3 pequeñas hojas de laurel", "1 mango maduro grande, pelado, sin núcleo, cortado en trozos de 5cm / 2in", "1 papaya madura grande, pelada, sin semillas, rebanada", "½ lima, solo jugo", "1½ cucharada de ron (opcional)", "330g / ¾lb de arroz, cocinado según las instrucciones del paquete, para servir"], "method": ["Para la mezcla de especias, muela los ingredientes de la mezcla de especias hasta obtener una pasta usando un mortero y una mano de mortero. Dejar de lado.", "Para el pollo al curry de coco, sazone las piezas de pollo, al gusto, con sal y pimienta negra recién molida.", "Caliente dos cucharadas de aceite en una cacerola grande de base pesada o en una cacerola de lados profundos a fuego medio. Agregue las piezas de pollo sazonadas y fría por 3-4 minutos, volteándolas regularmente o hasta que se doren por todos lados. Retirar de la sartén y reservar (mantener caliente).", "Caliente las dos cucharadas restantes de aceite en la misma sartén, luego agregue las cebollas, la calabaza, las berenjenas y las papas, en lotes si es necesario, y fríe durante 4-5 minutos, revolviendo regularmente, o hasta que estén suaves y doradas.", "Agregue la mezcla de especias a la sartén y mezcle bien para cubrir las verduras. Continúe cocinando la mezcla durante 3-4 minutos, revolviendo bien, o hasta que las especias sean fragantes.", "Regrese las piezas de pollo doradas a la sartén y agregue la leche de coco, el caldo de pollo, la pasta de tamarindo y las hojas de laurel. Revuelva bien y ponga la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra la olla con una tapa y continúe cocinando a fuego lento durante 35-40 minutos, o hasta que los trozos de pollo estén tiernos y la salsa se haya espesado.", "Agregue el mango, la papaya, el jugo de lima y el ron (si está usando), mezcle bien la mezcla, cubra y continúe cocinando a fuego lento durante 4-5 minutos, o hasta que la fruta se haya calentado.", "Para servir, divida el arroz por igual entre seis platos para servir. Cuchara sobre el pollo al curry de coco."], "url": "www_bbc_co_uk_food_recipes_martiniquecoconutchi_91706", "title": "Curry de pollo de coco de Martinica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 zanahoria pequeña, pelada, cortada en cubitos", "1 cebolla pequeña, picada", "2 tomates maduros, picados", "1 chile rojo, sin grano y finamente picado", "1-2 pequeños puñados de cilantro fresco finamente picado", "1 diente de ajo, finamente picado", "¼ cucharadita de cúrcuma molida", "¼ cucharadita de comino molido", "2-4 cucharadas de aceite de colza", "1 cucharada de vinagre de vino blanco", "azúcar pizca", "1 cucharada de ketchup de tomate", "pizca de sal", "exprimir jugo de limón", "1 cebolla de primavera, cortada, en rodajas finas, para adornar"], "method": ["Coloque la zanahoria y la cebolla en un bol y pique en trozos pequeños con una batidora de mano.", "En un recipiente aparte, mezcle los tomates y el chile hasta lograr un puré suave.", "Combine las dos mezclas, luego mezcle los ingredientes restantes y agregue sal si es necesario. Quieres la consistencia de la salsa.", "Sazone la salsa con jugo de limón y decore con cebolleta."], "url": "www_bbc_co_uk_food_recipes_maru_dip_46650", "title": "Salsa especiada de Maru", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema batida de 500ml / 18fl oz", "1 vaina de vainilla, dividida longitudinalmente, semillas raspadas", "6 yemas de huevo", "1 cucharadita de esencia de vainilla de buena calidad", "50 g / 1 oz de azúcar en polvo", "Licor de frutas marula 50ml / 2fl oz (busque Amarula)", "Licor de café de 25ml / 1fl oz, como Tia Maria", "extracto de café, al gusto", "6 cucharaditas de azúcar en polvo"], "method": ["Coloque la crema y la vaina de vainilla en una cacerola de acero inoxidable o esmaltada y cocine a fuego lento, revolviendo ocasionalmente para evitar que se queme.", "Coloque las yemas de huevo, la esencia de vainilla y el azúcar en un tazón grande. Con un batidor de mano, batir durante 4-5 minutos hasta que quede espeso, pálido y se deje una cinta cuando la mezcla se arrastre sobre sí misma. Retire la vaina de vainilla y mezcle lentamente lotes pequeños de la crema caliente en las yemas.", "Agregue el licor de frutas marula, el licor de café y el extracto de café.", "Precalentar el horno a 170C / 150C Fan / Gas 3.", "Cuela la crema aromatizada y luego divídelo por igual entre 6 moldes. Coloque los moldes en una lata para asar profunda y agregue suficiente agua hervida para alcanzar la mitad de los lados de los moldes.", "Hornee durante 45 minutos, o hasta que se endurezca, pero con un leve bamboleo. Enfríe bien y enfríe en el refrigerador, luego limpie cuidadosamente alrededor de los bordes.", "Para la corteza de azúcar, precaliente la parrilla a su configuración más alta. Espolvoree una cucharadita de azúcar sobre cada crème brûlée y póngalos debajo de la parrilla hasta que el azúcar se derrita y caramelice. Alternativamente, use un soplete de chef para caramelizar el azúcar. Sirva una vez que el caramelo se haya endurecido."], "url": "www_bbc_co_uk_food_recipes_marula_fruit_liqueur_and_29614", "title": "Licor de fruta Marula y crema de café brûlées", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal, ablandada", "75g / 2¾oz de azúcar en polvo, más extra para quitar el polvo", "1 huevo de corral, separado", "1 limón pequeño sin cera, ralladura fina solamente", "Harina normal de 200g / 7oz, más extra para quitar el polvo", "50g / 1¾oz pasas de Corinto", "1-2 cucharadas de leche"], "method": ["Precalentar el horno 200C / 180C Ventilador / Gas 6. Línea tres bandejas para hornear con papel de hornear.", "Pon la mantequilla y el azúcar en un bol y bate hasta que estén bien combinados y esponjosos. Agregue la yema de huevo y la ralladura de limón. Tamizar la harina y mezclar bien. Agregue las grosellas y leche suficiente para hacer una masa bastante suave.", "Amasar la masa en una superficie de trabajo enharinada y, utilizando un rodillo, extender la masa hasta 5 mm / ¼ de grosor. Con un cortador acanalado de 6 cm / 2½ pulgadas, corte 24 rondas. Transfiera a las bandejas para hornear con una espátula y hornee durante 8 minutos.", "Batir ligeramente la clara de huevo con un tenedor.", "Retire las galletas del horno y cepille las partes superiores con la clara de huevo batida. Espolvorea sobre el azúcar impalpable y vuelve al horno durante 5 minutos, o hasta que esté pálido dorado y cocido. Deje que se enfríe en las bandejas durante unos minutos, luego levante cuidadosamente sobre una rejilla para que se enfríe por completo."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_easter_46791", "title": "Galletas de Pascua de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 x 6 cm / 2½ en galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_easter_46791_16x9.jpg", "isVegetarian": true, "recommendations": 0}]