[{"isVegetarian": true, "title": "Apple frangipane tart", "url": "www_bbc_co_uk_food_recipes_apple_frangipane_tart_14091", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_frangipane_tart_14091_16x9.jpg", "ingredients": ["175g/6oz digestive biscuits", "75g/3oz butter", "200g/7oz Bramley apples", "75g/3oz butter, softened", "75g/3oz caster sugar", "2 free-range eggs, beaten", "75g/3oz ground almonds", "1 tsp almond extract", "50g/1¾oz flaked almonds"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Put the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.", "Cream together the butter and sugar until light and fluffy. (You can do this in a food processor if you have one. Process for 2-3 minutes.)  Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.", "Peel the apples, and cut thin slices of apple. (Do this at the last minute to prevent the apple going brown.) Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.", "Bake for 20-25 minutes until golden-brown and set.", "Remove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. (An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.) Transfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream."]}, {"isVegetarian": true, "title": "Apple, hazelnut and Calvados upside-down cake", "url": "www_bbc_co_uk_food_recipes_apple_hazelnut_and_37011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sultanas ", "50g/1¾oz chopped dried apple ", "90ml/6 tbsp Calvados", "100g/3½oz blanched hazelnuts ", "175g/6oz self-raising flour", "175g/6oz margarine", "175g/6oz muscavado sugar", "3 medium free-range eggs ", "½ tbsp vanilla bean paste (or 1 tsp vanilla extract)", "1 tsp baking powder", "1 tsp cinnamon", "100g/3½oz caster sugar", "30g/1oz unsalted butter", "5 Granny Smith apples, peeled, cored and sliced into 1cm/½in wedges", "100g/3½oz blanched hazelnuts ", "200g/7oz caster sugar"], "serves": "Makes 12 slices", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the sultanas and dried apples with five tablespoons of Calvados and leave to soak overnight. ", "For the cake, pre-heat the oven to 180C/350F/Gas 4 and grease a 23cm/9in springform tin. Toast the nuts in a hot dry pan until they are golden brown. Transfer to a food processor, pulse until chopped and set aside.", "For the fruit topping, melt the sugar in heavy-based saucepan to form a golden caramel. Remove from the heat and add the butter, stirring gently until incorporated into the caramel (take care not to splash yourself as caramel is very hot). Place the pre-prepared tin on a baking sheet and pour in the caramel. Carefully arrange the apple slices on top until the base of the tin is completely covered.", "For the cake, beat together the flour, margarine, sugar, eggs, vanilla, baking powder and cinnamon until combined and airy. Fold in the chopped hazelnuts and soaked fruit before pouring onto the apples and gently smoothing the surface.", "Bake in the oven for 40-50 minutes or until light golden-brown and springy to the touch. Set aside to cool in the tin.", "For the praline, fill a large bowl with cold water. In a heavy-based pan melt the sugar to a golden-brown caramel, swirling the pan occasionally so it doesn’t burn and using a damp pastry brush to brush down any sugar crystals from around the edge of the pan. Remove from the heat and dunk the base of the pan in the cold water to stop the caramel cooking.", "Place a heavy chopping board on the edge of the work surface and spread newspaper on the floor beneath. Spear half the hazelnuts onto cocktail sticks. Carefully dip each nut in the caramel before securing the free end of the cocktail stick under the chopping board, so the nut overhangs the work surface allowing a spike of caramel to form and harden (the paper will catch any drips).  ", "Gently reheat the remaining caramel until it becomes runny again.  Add the remaining hazelnuts, swirl to coat, and pour onto a lined baking sheet. Set aside in a cool dry place.  When completely set, blend in a food processor to make a praline.", "When the cake is cool, prick with a cocktail stick and spoon over the Calvados. Leave in the tin for 5-10 minutes to allow the Calvados to infuse the cake.  ", "Run a sharp knife around the edge of the cake and place a serving plate over the top. Quickly flip the cake cover, remove the tin and rearrange any apples that may have come away.", "To serve, sprinkle with praline and decorate with the spiky hazelnuts."]}, {"isVegetarian": true, "title": "Apple noodle tart with toasted almonds and ginger crème fraîche", "url": "www_bbc_co_uk_food_recipes_apple_noodle_tart_with_75363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz ground almonds", "¼ tsp salt", "¼ tsp bicarbonate of soda", "¾ tbsp maple syrup", "15g/½oz butter, softened", "1 free-range egg", "2 eating apples, peeled", "1 tsp vanilla extract", "35g/1¼oz raisins", "1 tsp ground cinnamon", "2 tsp maple syrup", "10g/½oz cold butter, diced", "50g/1¾oz almond flakes", "400g/14oz full-fat crème fraîche", "2cm/5in piece fresh root ginger, peeled and finely grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the almond shortcrust pastry, preheat the oven to 170C/150C Fan/Gas 3½.", "In a large bowl, mix together all of the pastry ingredients until they come together as a soft dough. Wrap in cling film and chill in the fridge for at least 30 minutes. ", "For the filling, using a spiraliser set to the julienne setting, cut the apples into long spirals that resemble noodles (alternatively coarsely grate the apples). Place them in a bowl. Sprinkle over the vanilla extract, raisins, cinnamon, maple syrup and butter and mix to combine.", "Roll the chilled dough out onto a piece of baking parchment lightly dusted with flour to form a rectangle about 3-4mm thick. Transfer the paper and rolled pastry to a baking tray.", "Pile the apple ‘noodles’ onto one side of the pastry rectangle. Fold the other half ot the pastry over the top, using the baking paper to help you. Press down gently at the edges to seal.", "Bake the apple noodle tart in the oven on the middle shelf for 12-15 minutes, then remove the tart from the oven and sprinkle over the almonds. Return to the oven for 4-5 minutes, or until the pastry is crisp and golden-brown and the filling has softened. Remove from the oven and set aside to cool for 10-15 minutes.", "Meanwhile, for the ginger crème fraîche, mix the crème fraîche and ginger together in a bowl until well combined.", "To serve, slice the apple noodle tart into wedges and top each with a dollop of the ginger crème fraîche."]}, {"isVegetarian": true, "title": "Apple pie with custard", "url": "www_bbc_co_uk_food_recipes_apple_pie_with_custard_29696", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "125g/4½oz unsalted butter, chilled, cut into cubes", "1 orange, zest only", "75g/2½oz caster sugar", "pinch salt", "2 free-range egg yolks", "1kg/2lb 4oz Cox apples, peeled, cored and cut into large chunks", "250g/9oz Bramley apples, peeled, cored and cut into large chunks", "250g/9oz Royal Gala apples, peeled, cored and cut into large chunks", "200g/7oz caster sugar", "1 tbsp cornflour", "2 tsp vanilla extract", "1 tsp ground cinnamon", "250ml/9fl oz whole milk", "250ml/9fl oz double cream", "1 vanilla pod, split lengthways and seeds scraped out", "2 free-range egg yolks", "50g/1¾oz caster sugar"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, combine the flour, butter, orange zest, sugar and salt in a food processor and pulse until the mixture resembles breadcrumbs. Add the egg yolks and pulse until the mixture comes together to form a rough dough. Turn out onto a floured work surface and gently knead until smooth. Shape the pastry into a disc, wrap in cling film and refrigerate while you make the filling.", "For the filling, put the apples and sugar in a saucepan and heat gently for five minutes, or until the apples start to break down slightly. Stir in the cornflour, vanilla and cinnamon and cook for a further two minutes. Set aside to cool completely.", "Preheat the oven to 200C/400F/Gas 6. ", "On a floured work surface, divide the pastry into thirds. Roll out two-thirds of the pastry to the thickness of a pound coin and use it to line a 23cm/9in pie tin. Cover with greaseproof paper, fill with baking beans and bake for 15 minutes (this is called blind baking). Remove the baking beans and paper and bake for a further 10 minutes, or until the pastry is crisp and just starting to colour.", "Roll out the remaning pastry to the thickness of a pound coin, in a rough circle. Spoon the filling into the baked pastry base, then cover with the remaining pastry. Bake for 20-25 minutes, or until the pastry is golden-brown and crisp.", "Meanwhile, make the custard. In a pan over a medium heat, add the milk, cream and vanilla pod and seeds. Bring to a simmer then remove from the heat. ", "Whisk the egg yolks and sugar together in a bowl. Strain the hot milk mixture through a sieve and slowly pour it over the yolk mix, whisking all the time. Return the mixture to a clean pan and cook gently for five minutes until thickened, stirring constantly. Serve immediately, poured over a slice of the warm apple pie. "]}, {"isVegetarian": true, "title": "Apple, plum and cinnamon country pie", "url": "www_bbc_co_uk_food_recipes_apple_plum_and_cinnamon_59262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["675g/1½lbs plain flour, plus extra for dusting", "pinch salt", "175g/6oz vegetable shortening, such as Trex, cut into cubes", "225g/8oz lightly salted butter, cut into cubes", "1 free-range egg, separated ", "6 Bramley cooking apples, peeled, cored and roughly chopped", "3 sweet eating apples (such as Golden Delicious), peeled, cored and roughly chopped", "1 lemon, juice only", "6 red plums, stones removed and quartered", "2 tbsp cornflour", "175g/6oz sugar", "115g/4oz soft brown sugar", "1 tsp ground allspice", "1 tsp ground cinnamon", "generous pinch freshly grated nutmeg", "1-2 tbsp milk", "30g/1oz sugar"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, sift the flour and salt into the bowl of a food processor. Add the shortening and butter and process until the mixture resembles fine breadcrumbs.", "Add the egg yolk and pulse, the mixture should come together to form a dough. If your mixture is too dry add a little water and pulse again.", "Tip the pastry out onto a lightly floured work surface and briefly knead. Bring the pastry together in a ball, place in a plastic bag and refrigerate for 20-30 minutes.", "Meanwhile prepare the filling, place the apples in a saucepan and add the lemon juice to prevent them browning. Add the plums.", "Mix the cornflour with the sugars, allspice, cinnamon and grated nutmeg. Place in the pan with the fruit and toss to coat the fruit in the dry mix.", "Place over a medium heat and cook until the sugars melt to form a caramel. Bring to a gentle simmer for two minutes then set aside to cool.", "Preheat the oven to 180C/350F/Gas 4.", "Lightly flour a work surface and rolling pin. Remove the pastry from the fridge and set aside one-third for the pie lid.  Roll out the remaining pastry until it is big enough to generously fit the pie dish (approximately 40cm/16in). Use the rolling pin to help you lift the pastry into the pie dish and gently press it into the sides, leaving any excess pastry overhanging the sides. Return to the fridge to chill for a few minutes.", "When chilled, remove the pastry case from the fridge and place on a baking tray. Line with baking parchment and fill with baking beans and then bake for approximately 10 minutes, or until the pastry is just beginning to colour and dry out. Remove the baking parchment and baking beans.", "Lightly whisk the egg white and brush over the pastry to glaze. Return the pastry to the oven and cook for a further five minutes, or until the pastry is a pale golden-brown and dried out.", "Roll out the remaining pastry for the pastry lid, using a plate to cut a circle that is roughly the correct size. Use any excess pastry to form a 1x26cm/½x10½in strip and shapes to decorate the pie.", "Trim the excess pastry from the edge of the pie dish - leaving about 1cm/½in of the pie dish rim showing.", "Using a slotted spoon, place the cooled fruit into the pastry case, discarding any excess liquid.", "Place the thin strip of pastry on top of the exposed rim of the pie dish. Brush with a little water, then place the pie lid on top and trim to shape.", "Crimp the edges to seal and place the decorative shapes on top. Cut a small hole in the middle to let any steam escape while cooking.", "Glaze with milk and sprinkle with sugar. Bake for 40-45 minutes, or until the pastry is golden-brown and crisp."]}, {"isVegetarian": true, "title": "Apple rings with ginger, lemon and black pepper tahini spread", "url": "www_bbc_co_uk_food_recipes_apple_rings_with_ginger_57928", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_rings_with_ginger_57928_16x9.jpg", "ingredients": ["5 tbsp tahini", "2 tsp finely grated ginger", "2 tsp honey", "½ tsp freshly ground black pepper", "pinch salt", "2 apples, peeled, cored, sliced into rounds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all of the ingredients except the apple slices together in a small bowl until well combined.", "Spread the mixture over the apple slices and serve."]}, {"isVegetarian": true, "title": "Apple, rocket and feta buckwheat galettes", "url": "www_bbc_co_uk_food_recipes_apple_rocket_and_feta_26780", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_rocket_and_feta_26780_16x9.jpg", "ingredients": ["100g/3½oz buckwheat flour", "1 free-range egg", "50g/2oz butter, melted ", "1 tbsp ghee", "dash olive oil", "salt and freshly ground black pepper", "2 tbsp butter", "2 large red onions, thinly sliced", "2 green apples, peeled, cored, chopped into 3cm/1¼in chunks", "pinch sea salt flakes", "freshly ground black pepper, to taste", "squeeze lemon juice", "70g bag rocket, washed and dried", "200g/7oz feta"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 5. Line a baking tray with baking parchment.", "Sift the flour into a mixing bowl and season with salt and pepper. Crack in the egg. Gradually add 300ml/10½fl oz water in a thin stream, beating continuously until the mixture forms a thick, smooth batter. Set aside for 1 hour to rest.", "Meanwhile, for the filling, heat the butter in a frying pan over a medium heat. Add the onions and fry for 4-5 minutes, or until softened but not coloured.  ", "Add the apples and continue to cook, stirring regularly, for 10-15 minutes, or until the apples have softened and started to brown. Season with salt, pepper and lemon juice. Set aside (keep warm).", "When the batter has rested, stir in the melted butter until well combined.", "Heat the ghee and a dash of olive oil in a ceramic or heavy-based frying pan over a medium-high heat. When the fat is smoking, add a tablespoonful of batter to the pan and swirl until the batter covers the base of the pan.", "Fry the galette for 2-3 minutes, or until golden-brown on its underside and easy to loosen from the bottom of the pan. Flip over and fry for a minute on the other side, or until cooked through. Remove from the pan and keep warm in the oven. Repeat the process with the remaining batter.", "Put a handful of rocket leaves in the centre of each galette. Divide the apple mixture equally among the galettes. Crumble over the feta. ", "Fold the edges of each galette over to create a square shape. Transfer them to the prepared baking tray and bake in the oven for 6-7 minutes, or until crisp. Serve with a simple green salad dressed with olive oil and a touch of apple cider vinegar."]}, {"isVegetarian": true, "title": "Apple strudel", "url": "www_bbc_co_uk_food_recipes_apple_strudel_03967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp raisins", "1 large orange, juice and zest", "800g/1lb 12oz cooking apples, peeled, cored, cut into small chunks", "50g/2oz unsalted butter", "100ml/3½fl oz water", "100g/3½oz caster sugar", "1 tsp ground cinnamon", "large handful of fresh breadcrumbs", "50g/2oz unsalted butter, melted", "4 sheets filo pastry", "icing sugar, for dusting", "double cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, soak the raisins in the orange juice and zest.", "Cook the apples in a pan with the butter, water and sugar for 8–10 minutes, or until the apples have softened slightly, but still retain their shape. ", "Remove the pan from the heat, add the cinnamon, raisins and juice and the breadcrumbs and stir to combine (the breadcrumbs will bind everything together). Set aside to cool.", "Preheat the oven to 180C/350F/Gas 4. ", "For the pastry, brush the baking tray with a little of the melted butter, spread out one sheet of filo on the baking tray, and brush with some more of the butter. Repeat the process with all four sheets, placing them on top of each other, brushing with melted butter each time.", "Spoon the apple mixture along the middle of the pastry and roll up, longest side first, into a parcel, seam-side down. (If you like, you can scrunch up some extra filo pastry to make a decoration for the top.)", "Brush all over with the remaining butter and bake in the oven for 15–20 minutes, or until the top is crisp and golden-brown. (Check the strudel after 10 minutes; if it is browning too quickly, reduce the heat a little. )", "Dust with icing sugar and serve with double cream. "]}, {"isVegetarian": true, "title": "Apple strudel", "url": "www_bbc_co_uk_food_recipes_apple_strudel_24124", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_strudel_24124_16x9.jpg", "ingredients": ["750g/1lb 10oz Bramley apples, peeled, cored, quartered and sliced", "1½ tsp ground cinnamon", "½ unwaxed lemon, zest only", "2 tsp lemon juice", "100g/3½oz golden caster sugar", "75g/2½oz raisins", "95g/3½oz butter", "40g/1½oz white breadcrumbs", "6 large sheets filo pastry", "1 tbsp icing sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line a baking tray with baking parchment.", "Mix the apples with the cinnamon, lemon zest and juice, sugar and raisins. In a small frying pan, melt 20g/¾oz butter and fry the breadcrumbs until golden-brown, then add to the apple mixture.", "Melt the remaining butter in a pan. On a clean, dry tea-towel lay a sheet of the filo and brush with some of the melted butter. Lay another sheet on top and repeat until you have used all of the filo. ", "Pile the filling along the length of the pastry along one side about 2-3cm/1in from the edge and using the tea-towel to help you, roll the pastry up to enclose the filling. Tuck the ends in and roll seam-side down onto the lined baking sheet. Brush with the remaining melted butter. ", "Bake for 40-45 minutes, until golden-brown.  Leave to cool to room temperature and dust with icing sugar. Slice and serve with cream, ice cream or custard."]}, {"isVegetarian": true, "title": "Apple, sultana and cinnamon swirls", "url": "www_bbc_co_uk_food_recipes_apple_sultana_and_48182", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_sultana_and_48182_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "10g/¼oz fine sea salt", "50g/1¾oz caster sugar", "9g/⅓oz fast-action yeast ", "1 large free-range egg, plus 1 large egg yolk, lightly beaten", "150ml/5fl oz full-fat milk, heated to 43C", "1 tsp light olive oil or vegetable oil, for greasing", "250g/9oz unsalted butter, chilled ", "110g/4oz unsalted butter, softened ", "160g/5¾oz caster sugar", "4 tsp ground cinnamon ", "250g/9oz peeled, cored and chopped Bramley apples (about 2 apples)", "50g/1¾oz sultanas ", "1 small unwaxed orange, zest and juice ", "½ unwaxed lemon, zest only", "1 tsp vanilla extract ", "50g/1¾oz apricot conserve", "2 tsp lemon juice", "1 free-range egg, beaten with 2 tbsp full-fat milk", "150g/5½oz icing sugar, sifted", "2 tbsp boiling water", "½ tsp vanilla extract"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry dough, put the flour, salt and sugar on one side of a large mixing bowl and the yeast on the opposite side. Add the eggs, warm milk and 50ml/1¾fl oz water and mix for one minute using a fork until combined. Add a little more water if needed to form a soft dough.", "Dust a work surface with flour and turn out the dough. Dust with a little flour and knead for 5 minutes, then shape into a ball.", "Lightly oil a mixing bowl and a large piece of cling film. Put the dough in the bowl and cover with the cling film. Set aside in a warm place to prove for an hour, or until almost doubled in size. ", "For the filling, beat the butter and 110g/4oz of the sugar in a mixing bowl. Stir in the cinnamon and set aside. ", "Put the apples in a saucepan and add the remaining sugar. Cook over a medium heat for about 10 minutes, stirring regularly, until the apples begin to break down. Add the sultanas, orange juice, orange zest, and lemon zest. Heat gently for 5 minutes then set aside to cool. When cold, stir in the vanilla extract. ", "For the glaze, combine the apricot conserve and lemon juice with 2 tablespoons water in a heavy-based saucepan. Slowly bring to the boil, (don’t stir it too much or bubbles will form and the glaze will appear cloudy), transfer the glaze to a heatproof bowl and place over a pan of gently simmering water until the glaze is runny. Pass through a sieve then return to the pan and set aside. ", "To finish the pastry, roll out the dough on a lightly floured work surface until 1cm/½in thick. ", "Beat the chilled butter using a rolling pin, until it is flattened into a rectangle roughly half the size of the dough rectangle. Arrange the dough with a short edge nearest you and put the butter in the middle. Fold the top and bottom of the pastry over the butter and press down the edges to ensure the butter is sealed within the pastry. Using a rolling pin, tap the dough from the middle upwards and from the middle downwards. This ensures that the butter is evenly distributed.", "Roll out the pastry to a large rectangle approximately 1cm/½in thick. Turn dough so you have a long edge nearest you, then fold the right third into the middle and cover with the left third. Chill in the fridge for 30 minutes. Do this turning, folding and chilling two more times.", "Preheat the oven to 200C/180C Fan/Gas 6. Line two large baking trays with non-stick baking paper. ", "To assemble the pastries, roll the pastry out into a rectangle about 36x30cm/10x8in and 1cm/½in thick. Spread with the cinnamon and butter mixture leaving about 2cm/¾in of dough free from the mixture on the side nearest to you. Roll up the dough towards you. Brush the last bit of dough with a little egg wash to help it stick. ", "Cut away the scruffy ends then slice the roll into 12 even pieces with a sharp knife. Place the pastries on the prepared trays, allowing plenty of room around each one. Lightly flour your hands and flatten each slice slightly, making a small indent in the middle. Spoon 1 teaspoon of the apple mixture into the centre of each pastry. Cover with a clean tea towel or plastic bag and set aside in a warm place for 10 minutes. ", "Brush with egg wash and then bake for 15–20 minutes, or until crisp and golden-brown.", "Place the cooked pastries on cooling racks and brush them with apricot glaze while they are still hot. Leave to cool completely.", "Meanwhile, mix all the icing ingredients together until smooth. Transfer to a paper piping bag and pipe lines across the pastry to finish. "]}, {"isVegetarian": true, "title": "Apple tart with mulberry and blackberry ice cream", "url": "www_bbc_co_uk_food_recipes_apple_tart_with_mulberry_25791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz mixed mulberries and blackberries", "95g/3oz sugar", "150ml/5fl oz cream", "150ml/5fl oz milk", "½ vanilla pod, cut in half lengthways and seeds scraped out", "3 free-range egg yolks", "3 Bramley apples, peeled, cored and roughly chopped", "450g/1lb ready-made puff pastry", "1 free-range egg yolk, beaten", "2 Pink Lady apples, peeled, cored and thinly sliced", "75g/2½oz butter, melted", "4 tbsp caster sugar"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the mulberry and blackberry ice cream, add the mulberries, blackberries, 15g/½oz of the sugar and a tablespoon of cold water to a pan and heat for five minutes, or until the berries have softened. Set aside to cool.", "Pour the cream and milk into a heatproof bowl. Add the vanilla seeds and stir well. Place the bowl over a pan of gently simmering water (do not allow the base of the bowl to touch the water). Heat the mixture gently but do not boil.", "In a separate bowl, beat the egg yolks and 80g/2¾oz of the sugar until fluffy. Add the warm cream and milk mixture and stir well. Return the custard mixture to the bowl used to heat the cream and continue to cook gently over the simmering water. Stir regularly, until the mixture is thick enough to coat the back of a spoon.", "Drain the berries through a sieve set over a bowl and reserve the liquid. Place the sieve over another bowl and push the berries through the sieve to form a purée, add a little of the reserved liquid if the purée is very thick. ", "Set aside a little of the purée and vanilla custard for decoration.", "Stir the remaining purée into the custard. Transfer to an ice cream maker and churn according to manufacturer’s instructions.", "For the apple tart, preheat the oven to 200C/400F/Gas 6.", "Place the roughly chopped apples and two tablespoons of water in a pan and cover with a lid. Place over a medium heat and bring to a simmer. Cook for 3-4 minutes, or until the apples are soft.", "Whisk the apples to a smooth purée, then set aside to cool.", "On a lightly floured work surface, roll out the pastry to a circle about 30cm/12in in diameter. Lightly score an inner circle 1cm/½in inside the edge of the pastry.", "Brush the top of the pastry with beaten egg. Wait one minute, then brush the pastry again with more egg.", "When the apple purée is cold, spread it over the inner circle of pastry. Layer the thin slices of apple over the apple purée. Brush the apple slices with melted butter and sprinkle over the caster sugar.", "Bake for 25-30 minutes, or until the pastry is golden-brown and the apples are caramelised.", "To serve, cut the tart into slices and place in the centre of serving plates with a ball of ice cream alongside. "]}, {"isVegetarian": true, "title": "Apple tart with spiced caramel sauce", "url": "www_bbc_co_uk_food_recipes_apple_tart_with_spiced_69773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb all-butter puff pastry ", "1 free-range egg yolk, beaten", "300g/10½oz marzipan ", "4 dessert apples, peeled, cored and finely sliced", "50g/1¾oz butter", "4 tbsp clear honey", "vanilla ice cream, to serve", "150g/5½oz caster sugar", "2 star anise", "½ tsp cloves", "¼ tsp freshly grated nutmeg", "½ tsp juniper berries", "175ml/6fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/425F/Gas 7.", "On a lightly floured work surface, roll out the puff pastry to 3-4mm/⅛in thick. Cut out four 12cm/4½in circles using a pastry cutter and transfer to a baking tray.", "Score a circle in the centre of the pastry with a knife (leaving a 1cm/½in border) then brush with egg wash.", "Roll the marzipan out to 5mm/¼in thick and cut into four 11cm/4¼in circles and place in the centre of the pastry. Carefully place the apples in an overlapping ring over the marzipan to cover it all.", "Place the butter and honey in a small saucepan and bring to a simmer, stirring to combine. Brush most of it over the top of the apples.", "Place in the oven and bake for 15-18 minutes, or until the pastry is risen and golden-brown.", "Brush with any remaining melted butter and honey to glaze.", "For the spiced caramel sauce, place the sugar and spices in a frying pan and cook until the sugar is melted and golden-brown. Whisk in the double cream and bring to a simmer.", "Cook for 3-5 minutes, or until just thickened, then pass through a fine sieve into a clean pan.", "To serve, place the tarts in the centre of serving plates and spoon the sauce around the edge. Finish with a spoonful of ice cream on top."]}, {"isVegetarian": true, "title": "Apple, walnut and raisin chaussons with Cheshire cheese", "url": "www_bbc_co_uk_food_recipes_apple_walnut_and_raisin_79143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour ", "2 tsp fast action yeast ", "80g/3oz caster sugar ", "125ml/4fl oz full-fat milk ", "2 medium free-range eggs ", "2 tsp fine sea salt ", "250g/9oz unsalted butter, chilled ", "3 tart eating apples (such as Granny Smith), cored and peeled", "1 lemon, zest only", "2 tsp mixed spice", "20g/¾oz unsalted butter", "50g/1¾oz raisins", "35g/1¼oz walnuts, coarsely chopped ", "4 tbsp caster sugar", "100g/3½oz Cheshire cheese, grated ", "freshly ground pepper", "1 large free-range egg, beaten, for glazing"], "serves": "Makes 12 pastries", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, warm the milk and 90ml/3fl oz water in a small saucepan until lukewarm. ", "Place all the other ingredients, except the butter, in the bowl of a freestanding mixer with a dough hook attachment, making sure the yeast doesn’t touch the salt. Add three-quarters of the milk and water mixture. ", "Start the mixer on a low speed until all the ingredients are incorporated. Add a bit more liquid if the dough seems too dry; you want a slightly sticky dough. Increase the speed and mix for seven minutes. ", "Spread the dough out onto a baking tray lined with baking parchment. Cover with cling film and place in freezer to cool. ", "Using a rolling pin, flatten the butter out between two pieces of baking parchment into a rectangle 33x19cm/13x7½in and place in the freezer. ", "After 15 minutes remove the dough from the freezer and roll it out to a rectangle 50x20cm/19½x8in. With a short edge towards you, place the flattened butter on the lower two-thirds of the dough. ", "Fold the top third of dough over the butter and then fold the bottom third upwards so all the butter is encased. Press the edges firmly together. ", "Turn the block of dough 90 degrees and roll out to 50x20cm/19½x8in. Fold the top third down and the bottom third up and place back in freezer for 15 minutes. ", "Repeat the rolling and folding twice more, placing the dough in the freezer for 15 minutes in between. Store covered in the fridge until ready to use.", "Meanwhile, for the filling, chop the apple into 5mm chunks and place in a large heatproof bowl. Add the lemon zest, mixed spice, butter, raisins, walnuts and sugar. ", "Cover with cling film and place in a microwave on the highest setting for six minutes (you could also do this in a saucepan, cooking until the apples are softened). Stir to combine, then spread the filling out on a plate to cool completely.", "Cut the pastry into two equal pieces and roll out one half on a well-floured work surface to a thickness of 4mm. ", "Using a 11cm/4½in round cutter, cut out six circles. Place a tablespoon of the apple filling in the centre of each circle and sprinkle a little Cheshire cheese on top. Season with pepper.", "Brush a little beaten egg around the edge of each circle of pastry. Fold in half to enclose the filling and press to seal. ", "Place each pastry on a baking tray lined with non-stick baking paper. Repeat the rolling, cutting and filling process with the second batch of dough to make 12 chaussons. Cover the chaussons with cling film and allow to prove at room temperature for 40 minutes. ", "Preheat the oven to 200C/400F/Gas 6. (Do not use a fan-assisted oven.)", "Make three cuts in the top of each chausson to allow steam to escape and brush with beaten egg. Bake for 20 minutes, or until well risen and golden-brown. ", "Remove from the oven and allow to cool slightly before transferring to a cooling rack."]}, {"isVegetarian": true, "title": "Apple and blueberry cobbler", "url": "www_bbc_co_uk_food_recipes_appleandblueberrycob_12556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz Bramley apples ", "250g/9oz blueberries", "200g/7oz unsalted butter", "200g/7oz caster sugar", "200g/7oz ground almonds", "3 eggs", "55g/2oz almonds, sliced finely"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel, core and cut the apples into chunks. Cook in a pan on a medium heat with 1 tbsp of water and sugar to taste, until collapsed.", "Cream the butter and sugar with a beater until light and fluffy. ", "Add the ground almonds, then add the eggs one at a time (waiting until each egg has been incorporated).", "Fill a ceramic baking dish half way up with cooked apple, scatter the blueberries over the top, then spoon the almond cream on top of the fruit (it will spread out during the cooking).", "Sprinkle the sliced almonds over the almond cream then bake at 180C/350F/Gas 4 for approximately 40 minutes.", "Serve with a giant scoop of vanilla ice cream and dust with icing sugar."]}, {"isVegetarian": true, "title": "Apple and blueberry pie", "url": "www_bbc_co_uk_food_recipes_appleandblueberrypie_85998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb ready-made shortcrust pastry", "100g/3½oz caster sugar, plus extra for sprinkling", "½ lemon, zest and juice ", "550g/1lb 3½oz Bramley apples ", "25g/1oz butter, plus extra for greasing the moulds", "½ tsp ground cinnamon (optional)", "150g/5¼oz blueberries", "1 medium free-range egg, lightly beaten", "clotted cream, to serve"], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Butter 6 x 7.5cm/3in dariole moulds (or a 22cm/9in ovenproof dish if you want to make one large pie).", "Roll out two-thirds of the pastry on a floured work surface using a rolling pin. With a pastry cutter the size of the dariole moulds, cut out six discs large enough to line the dariole moulds; line the bottom and sides of the buttered moulds with the pastry discs (or if making one pie, cut out a large circle of pastry to line the buttered dish). Transfer to the fridge to chill.", "Place the sugar, lemon juice and lemon zest into a bowl.", "Peel, quarter and core the apples, then slice them thickly into the bowl with the lemon and sugar. Mix together.", "Heat a pan over a medium heat. Add the apple mixture, the butter and the cinnamon (if using) and stew for 3-4 minutes. Add the blueberries and cook for a few more minutes, before removing from the heat to cool. ", "Preheat the oven to 200C/400F/Gas 6. ", "Fill the pastry-lined dariole moulds or pie dish with the cooled apple and blueberry mixture.", "Roll out the remaining pastry on a floured work surface and cut out discs a little bigger than the dariole moulds or pie dish. Place the pastry on top of the the dariole moulds or pie dish and seal the edges well. Make a small hole in the top to allow the steam to escape.  ", "Make decorations (such as leaves) by cutting out any pastry trimmings with a sharp knife and stick them on with a little water. Brush the pastry lids with a little lightly beaten egg then dredge with caster sugar.", "Bake for 15 minutes, until the fruit is tender and the top is golden-brown.  Serve hot with clotted cream"]}, {"isVegetarian": true, "title": "Apple and carrot sesame crumble", "url": "www_bbc_co_uk_food_recipes_appleandcarrotsesame_85051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "2 apples, peeled, cored and thinly sliced", "1 carrot, peeled and grated", "50g/1½oz brown sugar", "50ml/2fl oz white wine", "100g/3½oz plain flour", "100g/3½oz unsalted butter, cut into cubes, plus extra for greasing", "100g/3½oz brown sugar", "2 tsp ground cinnamon", "2 tbsp sesame seeds ", "100g/3½oz Greek yoghurt, to serve", "mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the filling, melt the butter in a frying pan and cook the apple and carrot until soft.", "Add the brown sugar and cook until caramelised. ", "Add the white wine and simmer until the mixture is thickened. ", "Lightly grease a small ovenproof dish and pour the mixture into the dish.", "For the topping, place the flour and butter into a large bowl and rub together until the mixture resembles breadcrumbs. Add the brown sugar, cinnamon and sesame seeds and mix well. ", "Sprinkle the crumble topping over the filling and bake in the oven for 12-14 minutes, until golden-brown.", "To serve, spoon over the yoghurt and garnish with mint."]}, {"isVegetarian": true, "title": "Apple and Cheshire cheese bake", "url": "www_bbc_co_uk_food_recipes_appleandcheshirechee_84731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 apple", "30g/1oz butter", "1 tbsp brown sugar", "2 free-range egg whites, whisked until stiff", "50g/1¾oz Cheshire cheese, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Slice the top off the apple, chop the flesh from this part and place it into a bowl, discarding the rest of the top part. Then cut out as much flesh as possible from the main part of the apple, leaving the outer shell intact. Discard the core, chop up the flesh and add this to the bowl.", "Melt half of the butter in a small ovenproof frying pan, place the apple flesh into the pan and cook gently for 4-5 minutes, or until softened to a purée. ", "Transfer the apple purée to a bowl and leave to cool for five minutes.", "Melt the remaining butter in the pan. Place the apple shell into the pan, sprinkle brown sugar over it and transfer to the oven to bake for 5-6 minutes, until beginning to soften and turn golden-brown.", "Meanwhile, place the whisked egg whites into the bowl with the apple purée and fold together, then fold in the Cheshire cheese. ", "Remove the apple from the oven, spoon the purée mixture inside it and return to the oven for 5-6 minutes, or until puffed up and golden-brown. ", "To serve, transfer the baked apple to a serving plate."]}, {"isVegetarian": false, "title": "Apple and filo tart with scallops and bacon salad", "url": "www_bbc_co_uk_food_recipes_appleandfilotartwith_92952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Bramley apple, peeled, core removed, diced", "2 tsp water", "1 tsp fresh thyme leaves", "15g/½oz butter", "salt and freshly ground black pepper", "8 sheets filo pastry, cut into 8 x 17cm/6½in circles", "50g/2oz butter, melted", "12 large hand-dived scallops, cleaned, roes removed", "1 tsp olive oil ", "8 thick slices smoked streaky bacon, boiled for 1 minute, cut into small pieces", "2 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "75g/3oz watercress, leaves only", "40g/1½oz baby spinach leaves", "40g/1½oz baby beet leaves", "20g/¾oz red amaranth leaves", "20g/¾oz baby coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the apple and filo tart, place the apples, water and thyme leaves into a lidded saucepan, cover the pan with the lid and heat over a medium heat for 3-4 minutes, or until the apples have broken down into a purée. Stir in the butter and season, to taste, with salt and freshly ground black pepper.", "Place four of the filo pastry circles onto a baking tray. Brush each circle with some melted butter and place another filo pastry circle on top.", "Brush the uppermost with a little more butter and spoon the apple purée on top, ensuring all of the pastry is covered.", "Transfer to the oven and cook for 5-6 minutes, or until crisp and golden-brown.", "Meanwhile, brush the scallops with the olive oil and season, to taste, with salt.", "Heat a frying pan until hot. Add the scallops and fry on each side, for 45 seconds on each side, or until golden-brown on each side and cooked through. (NB: Do not move the scallops during cooking.) Remove the scallops from the pan and set aside to rest.", "For the bacon salad, heat a frying pan over a high heat until hot, add the bacon pieces and fry for 2-3 minutes, or until golden-brown and crisp.", "Whisk the mustard, vinegar and olive oil together in a bowl and season, to taste with a little salt and black pepper.", "Mix the salad leaves and fried bacon together in a bowl, then drizzle over the salad dressing and mix together until well combined.", "To serve, place an apple and filo tart onto each of four serving plates. Place three scallops onto each tart and top with a handful of bacon salad."]}, {"isVegetarian": true, "title": "Apple and prune crumble with brandy cream", "url": "www_bbc_co_uk_food_recipes_appleandprunecrumble_84550", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "15g/½oz brown sugar", "½ tsp cinnamon", "6-8 finely chopped prunes", "½ Bramley apple, peeled, cored and chopped into cubes", "2 tbsp butter", "2 tbsp brown sugar", "4 tbsp plain flour", "1 tbsp pistachio nuts, shells removed", "5 tbsp double cream, whipped", "2 tbsp brandy"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Melt the butter in a saucepan over a medium heat. Add the brown sugar and cook until melted and combined.", "Add the cinnamon, prunes and apples and cook until the apples become very soft.", "Transfer the fruit mixture to a shallow ovenproof dish.", "For the crumble, place all of the crumble ingredients together into a food processor and blend until combined. Sprinkle the crumble mixture on top of the fruit and transfer to the oven to bake for 10-15 minutes, or until the crumble topping is crisp and golden-brown. ", "For the brandy cream, add the brandy to the whipped cream in a bowl and fold together.", "Serve the crumble in the cooking dish with the brandy cream in a serving bowl alongside."]}, {"isVegetarian": true, "title": "Apple and passion fruit tartlets", "url": "www_bbc_co_uk_food_recipes_appleandpassionfruit_89981", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appleandpassionfruit_89981_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4½fl oz ice cold water", "3 free-range egg yolks", "120g/5oz caster sugar", "20g/¾oz plain flour", "250ml/9fl oz milk", "½ vanilla pod, split lengthways", "1 tbsp icing sugar", "3 medium Cox apples, peeled and thinly sliced", "3 passion fruit, pulp and seeds scraped out, to serve"], "serves": "Makes 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound onto a clean work surface and make a deep well in the centre using your fingers.", "Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand and working that in until the mixture is loosely but well combined and still with lumps of butter visible.", "Gradually add the iced water and mix until fully incorporated in the mixture. (You may not need all of the water. Take care not to overwork the mixture.)  ", "Roll the dough into a ball, wrap it in cling film and chill it for 20 minutes.  ", "When the dough has chilled, roll it out onto a lightly floured work surface into a 40cm x 20cm/16in x 8in rectangle. Fold the rectangle into three and give it a quarter turn. ", "Repeat the process, giving the folded pastry another quarter turn. ", "Wrap the pastry in cling film and chill for a further 30 minutes.", "When the dough has chilled, roll it out, as before, onto a lightly floured work surface into a 40cm x 20cm/16in x 8in rectangle. Fold the rectangle into three and give it a quarter turn. ", "Repeat the process, as before, giving the folded pastry another quarter turn (making a total of four turns).  ", "Wrap the pastry in cling film and refrigerate for at least 30 minutes.  ", "For the crème pâtissière, in a bowl, whisk the egg yolks and 20g/¾oz of the caster sugar together to a ribbon consistency. You may want to use an electric whisk to do this. ", "Gradually whisk in the flour until smooth and well combined.", "In a saucepan, bring the milk, 40g/1½oz of the sugar and the vanilla pod to the boil. As soon as the mixture starts to boil, gradually pour the hot milk mixture onto the egg yolk mixture, stirring continuously. ", "Return the mixture to the pan and bring to the boil again, whisking continuously. Simmer for 1-2 minutes, then remove from the heat and transfer the mixture to a bowl.", "Dust the crème pâtissière with a layer of icing sugar to prevent a skin from forming as it cools. (Once cool, the mixture can be kept in the fridge for up to three days. Remove the vanilla pod before using.)", "Preheat the oven to 180C/350F/Gas 4. ", "Roll the rough puff pastry out onto a lightly floured surface to a 2mm/eighth of an inch thickness. Cut out six discs using a 12cm/5in pastry cutter. ", "Line a baking sheet with baking parchment  and brush with a little cold water. Transfer each of the pastry discs onto it using a palette knife. Chill the pastry in the fridge for 20 minutes. Prick the pastry discs several times with a fork. ", "Spread equal amounts of the crème pâtissière mixture evenly onto each of the pastry discs, leaving a narrow margin free at the edge of each pastry disc.", "Arrange the apple slices in a fan on top of the crème pâtissière mixture, starting in the centre of each disc and working outwards to the edges.", "Transfer the tartlets to the oven and bake for 15-18 minutes, or until the pastry has risen and is pale golden-brown. Sprinkle generously with the remaining 60g/2½oz of caster sugar, then return to the oven and cook for a further 4-5 minutes, or until the sugar has caramelised. ", "Remove the tartlets from the oven and immediately transfer them to a wire rack, using a palette knife. Set aside to cool.", "To serve, place one of the cooled tartlets onto each of six serving plates and spoon over equal quantities of the passion fruit pulp."]}, {"isVegetarian": true, "title": "Apple and mincemeat tart with crushed walnuts and mint cream", "url": "www_bbc_co_uk_food_recipes_appleandmincemeattar_84971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 7½cm/3in square ready-made puff pastry", "150g/5½oz mincemeat ", "1 cooking apple (such as Bramley apple), cored, peeled and sliced", "2 tbsp soft brown sugar", "1 tbsp milk", "1 tbsp chopped fresh mint ", "2 tbsp icing sugar", "100ml/3½fl oz double cream, whipped to soft peaks", "1 tbsp crushed walnuts", "3 tbsp clear honey", "icing sugar, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Mark 6.", "For the tart, lay the pastry on a baking sheet and spread the mincemeat onto the pastry, leaving a 1cm/½in border. Place the apples and sugar on top of the mincemeat.", "Brush the pastry edges with milk and bake for eight minutes, or until golden-brown.", "To make the mint cream, stir together the mint and sugar with the whipped cream in a small bowl.", "Sprinkle the tart with walnuts, drizzle with honey and dust with icing sugar. Serve the tart warm."]}, {"isVegetarian": true, "title": "Apple and sultana puff pastry diamond with clotted cream", "url": "www_bbc_co_uk_food_recipes_appleandsultanapuffp_71448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 Bramley apples - peeled, cored and diced", "1 vanilla pod - split lengthways and seeds scraped out", "50g/1¾oz butter", "pinch of cinnamon", "pinch of sugar", "100g/3½oz sultanas", "splash of water", "200g/7¼oz puff pastry", "egg wash", "pinch of sugar", "clotted cream, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the compote, put the apples, vanilla, butter, cinnamon, sugar and water in pan and cook, stirring often, until ingredients turn into a purée. ", "Then mix in the sultanas and set aside.", "For the diamond, roll out the puff pastry and cut two 10cm/4in wide diamonds.  ", "Cut around the edges of the diamonds and fold the corners back on each other.   ", "Brush with egg wash, sprinkle with sugar and bake at 180C/350F/Gas 4 until golden brown. Leave to cool.", "Slice the diamonds in half, spoon the purée over the bottom, add the pastry lids and serve with clotted cream."]}, {"isVegetarian": true, "title": "Apple and raisin chutney", "url": "www_bbc_co_uk_food_recipes_appleandraisinchutne_1475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kg/4lb apples, peeled, cored and chopped", "4 medium onions, peeled and finely chopped", "2 cloves garlic, peeled and crushed", "1 lemon, juice only", "1 tbsp mustard seeds", "900ml/1½ pint vinegar (cider or malt)", "450g/1lb raisins", "1 tbsp ground ginger", "2 tsp salt", "900g/2lb soft brown sugar"], "serves": "Makes 2 - 3 pints", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the apples, onions, garlic, lemon juice, mustard seed and 590ml/1 pint of vinegar to the boil.", "Simmer for 1 hour.", "Add the raisins, ginger, salt, sugar and the rest of the vinegar.", "Simmer until thick.", "Pour into clean, hot jam jars and cover as usual. Store for 6-8 weeks to allow the flavours to develop."]}, {"isVegetarian": true, "title": "Apple and thyme crumble with thyme custard", "url": "www_bbc_co_uk_food_recipes_appleandthymecrumble_86496", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter, plus extra for greasing", "1.5kg/3lb 4oz Bramley apples, peeled, cored and cut into chunks", "4 tbsp caster sugar", "6 sprigs fresh lemon thyme, leaves only", "150g/6oz butter", "300g/12oz plain flour", "150g/6oz caster sugar", "200ml/7fl oz milk", "200ml/7fl oz double cream", "4 sprigs fresh thyme, leaves only", "6 free-range egg yolks", "75g/3oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the crumble filling, heat the butter in a saucepan, add the apples, sugar and lemon thyme and cook over a medium heat, stirring from time to time, for 5-8 minutes, or until tender. Grease an ovenproof dish and pour the mixture into the dish.", "For the crumble topping, rub the butter and flour together in a large bowl until the mixture resembles breadcrumbs. Add the sugar and mix well, then spoon the crumble topping over the apple mixture.", "Transfer to the oven and bake for 15-20 minutes, or until golden and bubbling.", "Meanwhile, for the custard, place the milk, cream and thyme into a saucepan and bring to a simmer. Simmer very gently for five minutes to infuse the flavour of the thyme.", "Place the egg yolks and sugar into a bowl and whisk together. Pour the warm milk onto the egg mixture and stir well, then return the mixture to the pan and cook gently until just thickened.", "To serve, place a spoonful of crumble onto each of six plates and pour over the thyme custard."]}, {"isVegetarian": false, "title": "Apple, bacon and black pudding salad with gribiche dressing", "url": "www_bbc_co_uk_food_recipes_applebaconandblackpu_70513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 apple, de-cored and cut into rounds ", "8 rashers of streaky bacon", "handful mixed leaves", "8 slices black pudding", "4 quails' eggs", "2 tsp of capers", "2 tsp of gherkins, finely chopped", "2 tsp of balsamic vinegar", "1 tbsp olive oil", "2 tsp of red onion, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pan-fry the apple, black pudding and bacon rashers.", "Then place the apple on a plate and layer it using leaves, black pudding, bacon and then more black pudding. ", "Finally fry the quails' eggs and place on top of the layered salad.", "To make the dressing mix the capers, gherkins, balsamic vinegar, olive oil and red onion and drizzle over the apple, bacon and black pudding salad."]}]