[{"isVegetarian": false, "title": "Moroccan-spiced lamb steak with couscous 'cake' and pomegranate", "url": "www_bbc_co_uk_food_recipes_moroccanspicedlambst_92430", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "¼ tsp ground cinnamon", "¼ tsp black peppercorns", "100g/3½oz lamb leg steak", "2 tbsp olive oil", "3 tbsp honey", "½ pomegranate, seeds only", "1 tbsp butter", "85g/3oz couscous, cooked according to packet instructions", "1 tbsp chopped fresh basil leaves", "1 tbsp chopped fresh mint leaves", "1 tbsp chopped fresh flatleaf parsley leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, grind the coriander seeds, cumin seeds, cinnamon and black peppercorns in a mortar with a pestle. Rub the spice mixture over both sides of the lamb.", "Heat a griddle pan until hot and drizzle the olive oil over the lamb. Cook the lamb for 4-5 minutes on both sides (for medium), or until golden-brown and cooked to your liking. Remove from the pan to rest on a warm plate. ", "Return the pan used to cook the lamb over a low heat and and stir in the honey and pomegranate seeds, scraping up any browned bits from the bottom of the pan with a wooden spoon. Cook until the honey begins to bubble, then remove from the heat.", "For the couscous 'cake', melt the butter in a small frying pan until foaming. Mix the cooked couscous with the basil, mint and flatleaf parsley. Pack the mixture into the pan and fry over a low heat for 5-7 minutes on each side (turn the 'cake' over carefully), or until golden-brown and crisp.", "To serve, turn the couscous 'cake' out onto a plate. Thickly slice the lamb and arrange over the couscous. Drizzle the pomegranate and honey sauce around the edges of the plate."]}, {"isVegetarian": false, "title": "Moroccan-style chicken casserole", "url": "www_bbc_co_uk_food_recipes_moroccanstylechicken_92582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanstylechicken_92582_16x9.jpg", "ingredients": ["2-3 large, juicy garlic cloves, peeled, roughly chopped", "pinch sea salt flakes ", "2-3 good pinches smoked paprika ", "2-3 good pinches ground turmeric", "1 tsp cumin seeds", "glug olive or groundnut oil ", "6 large chicken thighs, bone in and skin on", "good glug fruity olive oil", "2 onions, peeled, roughly chopped", "1 lemon, cut in half, thinly sliced", "pinch saffron strands", "handful green olives, pits removed", "small handful fresh coriander, roughly chopped"], "serves": "Serves 2-3", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the spice paste, crush the garlic cloves and sea salt with a pestle in a mortar. Add the smoked paprika, turmeric and cumin seeds and grind to a paste. Add just enough olive or groundnut oil to make the paste runny enough to pour, but thick enough to coat the chicken. ", "For the casserole, place the chicken thighs into a bowl, pour the spice paste over them and toss well to coat all of the meat. Cover with cling film and leave to marinate in the fridge for as long as time allows, overnight if possible.", "Heat the olive oil in a large shallow pan, then cook the onions until softened. Add the chicken thighs and cook until coloured lightly on both sides. Add the lemon slices and pour in enough water to come halfway up the chicken pieces. Stir in the saffron, then season well, cover with a lid and simmer for about 25 minutes, until the chicken is cooked through and tender. Add the olives and fresh coriander and serve."]}, {"isVegetarian": false, "title": "Moroccan lamb tagine with polenta chips", "url": "www_bbc_co_uk_food_recipes_morrocanlambtaginewi_70560", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb shoulder lamb", "600ml/1 pint chicken stock", "2 tbsp olive oil", "1 large onion, roughly chopped", "4 garlic cloves, chopped", "1 tbsp ground cumin", "1 tbsp ground coriander", "1 tbsp hot paprika", "1 x 400g/14oz can chopped tomatoes", "1 cinnamon stick, broken in half", "175g/6oz dried apricots", "½ tsp ground black pepper", "3 large pieces orange peel", "2 oranges, segmented", "1 red onion, finely chopped", "1 red chilli, finely chopped", "handful fresh coriander leaves", "1 tbsp fresh mint leaves, shredded", "55g/2oz pine nuts, lightly toasted, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Remove excess fat from the surface of the lamb and cut into 5cm/2 inch chunks.  ", "Heat a large non-stick frying pan or wok until hot. ", "Add half of the lamb chunks and sear on all sides, until brown all over. When nicely browned, remove the lamb and add approximately 100ml/3½fl oz chicken stock. ", "Stir to remove any sediment from the bottom of the pan. Pour out and reserve. ", "Repeat this process for the remaining meat.", "Return the pan to the heat and add the olive oil. When hot add the onion and fry gently for approximately ten minutes, or until golden. ", "Add the garlic and fry for a further two minutes. Add the ground spices to the pan and fry for a further minute. ", "Add the reserved meat and the remaining tagine ingredients, including the stock. Bring to the boil, cover and simmer very gently for approximately two hours or until the meat is meltingly tender.", "Combine all the relish ingredients in a bowl. Sprinkle the pine nuts over the tagine and serve with the relish."]}, {"isVegetarian": false, "title": "Morroccan sea bass with herby tabbouleh", "url": "www_bbc_co_uk_food_recipes_morroccan_sea_bass_with_68529", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole small sea bass, gutted ", "4 tbsp harissa paste", "1 lemon, zest and juice only", "2 garlic cloves, sliced", "1 tsp ground cumin", "pinch ground cinnamon", "pinch grated fresh nutmeg", "2 tbsp olive oil, plus extra for greasing", "½ bunch flatleaf parsley", "4 plum tomatoes, cut into 1cm/½in slices", "140g/5oz bulgur wheat", "500ml/18fl oz chicken stock, warmed", "1 red onion, finely chopped", "½ bunch flatleaf parsley, roughly chopped", "½ bunch mint, roughly chopped", "½ bunch coriander, roughly chopped", "100g/3½oz dried apricots, diced", "1 pomegranate, seeds removed", "100g/3½oz sultanas, left whole", "100g/3½oz pistachio nuts, chopped", "1 lemon, juice only", "4 tbsp extra virgin olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "Trim the sea bass by removing the fins with scissors and scoring the flesh in a crisscross pattern. ", "To make the paste for the sea bass, put all of the ingredients, except the parsley and tomatoes, in a bowl and mix. Rub the paste all over the fish and stuff the cavity of the fish with the parsley.", "Take 2 large pieces of aluminium foil big enough to wrap each fish with room to spare. Put an equally-sized piece of greaseproof paper on top of each piece of foil, then lightly grease the paper with oil. Divide the tomatoes between the greaseproof paper and put the fish on top. Wrap the greaseproof paper and aluminium foil around the fish like a Cornish pasty, using the foil to seal it. Bake in the oven for 20-25 minutes until cooked through. ", "To make the tabbouleh, put the bulgur wheat in a saucepan and cover with the chicken stock. Simmer for 15-20 minutes, or until cooked. Drain and leave to cool.", "Put the cooled bulgur and the remaining tabbouleh ingredients in a large bowl and mix thoroughly.", "Put the tabblouah on a large serving plate, top with the sea bass and serve. "]}, {"isVegetarian": false, "title": "Mortadella mousse", "url": "www_bbc_co_uk_food_recipes_mortadella_mousse_62112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 slices mortadella", "50ml/2fl oz crème fraîche", "100ml/3½fl oz double cream", "75g/2½oz Parmesan, finely grated", "pinch freshly grated nutmeg", "salt and freshly ground black pepper", "2 tbsp pistachios, lightly crushed", "thin rounds bread", "little butter, for spreading (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the mortadella in a food processor and blend until it is finely chopped. Add the crème fraîche and half the cream and continue to blend. ", "Add the Parmesan and blend again. Gradually add the remaining cream, blending all the time, until you have a smooth paste. Season with the nutmeg and black pepper to taste – you may not want to add salt.", "Scrape the mixture into a bowl and smooth it over. Sprinkle on the pistachios. ", "Toast the bread, then butter it if you like. Serve the pâté on the toast."]}, {"isVegetarian": false, "title": "Moroccan spiced kebabs with charred tomatoes", "url": "www_bbc_co_uk_food_recipes_moroccanspicedkebabs_88042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ground cumin", "1 tsp ground coriander", "1 tsp ground ginger", "100g/3½oz rump steak, cut into cubes", "salt and freshly ground black pepper", "drizzle olive oil", "150g/5½oz fresh cherry tomatoes", "1 tbsp caster sugar", "2 tbsp balsamic vinegar", "lime wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the kebabs, mix the spices together with salt and freshly ground black pepper and then stir the beef cubes in the spice mix. Thread onto  metal skewers, drizzle with oil and then griddle in a hot griddle pan for 2-3 minutes, or until charred on all sides and cooked to your liking.", "For the charred tomatoes, stir the tomatoes a hot ovenproof frying pan, add the sugar and toss for two minutes. Place the tomatoes into the preheated oven and cook for 5-6 minutes. Add balsamic vinegar to the pan and stir to coat.", "To serve, pile the tomatoes onto a serving plate and place the kebabs on top. Garnish with lime wedges."]}, {"isVegetarian": false, "title": "Easy spaghetti and meatballs", "url": "www_bbc_co_uk_food_recipes_mos_magic_meatballs_53940", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mos_magic_meatballs_53940_16x9.jpg", "ingredients": ["4 cream crackers", "500g/1lb 2oz lean beef mince    ", "1 tsp dried mixed herbs", "1 free-range egg", "1 tbsp olive oil", "1 tbsp olive oil", "2 onions, finely chopped", "1 small carrot, grated", "1 garlic clove, crushed", "1 x 400g tin chopped tomatoes", "2 tbsp tomato purée", "500g/1lb 2oz spaghetti, cooked according to packet instructions", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the cream crackers in a plastic bag. Wrap the bag in a tea towel and bash with a rolling pin until crushed.", "Put the mince in a large bowl, add the mixed herbs and crushed cream crackers. Tap the egg gently on the side of the bowl and crack the egg into the bowl. Mix the mince mixture together with your hands, wet hands are best for this job. Really get squished in so all the ingredients are mixed together. ", "To shape the meatballs take a spoonful of the mince mixture and place in the palm of your hands. Cup your other hand over the mince and roll to make perfectly round meatballs. Make 16 meatballs, put the meatballs on a large plate and chill in the fridge for 20 minutes.  ", "Wash your hands before the next step, it is very important to always wash your hands after handling raw meat and fish.", "To make the tomato sauce, heat a large pan and add the oil. Add the onion, carrots and garlic and fry for 6 minutes, or until soft but not browned. Add the tinned tomatoes and tomato purée. Season with salt and pepper and allow to simmer for 15 minutes on a low heat.", "Heat a tablespoon of oil in another shallow pan, add the meatballs and cook over a medium heat for a few minutes until browned on the outside. To keep your meatballs round when frying, hold the handle of the pan and shake the pan in a round action so that the meatballs never have a chance to settle and flatten and remain round. ", "When the meatballs are evenly browned and cooked through, add them to the tomato sauce and simmer for a further 5 minutes. Serve the meatball sauce with spaghetti."]}, {"isVegetarian": true, "title": "Mo-tea-to", "url": "www_bbc_co_uk_food_recipes_moteato_91483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp caster sugar", "1 tbsp freshly squeezed lime juice", "8 fresh mint leaves, plus 1 extra sprig, to garnish", "scoop crushed ice", "50ml/2fl oz gin", "75ml/2¾fl oz chilled strong green tea"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar and lime juice into a highball glass and stir until dissolved. ", "Wipe the mint leaves around the rim of the glass, then tear them in two and drop them into the glass.  ", "Crush the mint leaves lightly with the back of a teaspoon.", "Fill the glass with crushed ice.", "Add the gin and chilled green tea and stir well.  ", "To serve, garnish the glass with a sprig of mint."]}, {"isVegetarian": false, "title": "Moules marinière with garlic and parsley breadcrumbs and French fries", "url": "www_bbc_co_uk_food_recipes_moules_marinire_with_11252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for deep frying", "2kg/4lb 8oz fresh live mussels ", "2 tbsp olive oil", "4 shallots, finely chopped ", "6 thyme sprigs, leaves picked", "4 garlic cloves, finely chopped ", "250ml/9floz white wine", "250ml/9floz double cream", "50g/2oz butter", "12 tbsp fresh breadcrumbs", "6 tbsp flat leaf parsley, half finely chopped, half chopped", "4 large chipping potatoes, peeled and cut into fine julienne"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep fat fryer to 190C/375F.", "Rinse the mussels thoroughly under plenty of running water and pull off the beards, throwing away any broken ones and any which don't close tightly when you tap them. ", "Heat a large sauté pan or saucepan until medium hot, add the oil, shallots and thyme and cook for 4-5 minutes, or until softened.", "Add half the garlic, the mussels and the wine and bring to a boil.", "Cover with a lid and let the mussels steam; they are cooked when the shells have opened. ", "Add the double cream to the pan and cook for 1-2 minutes to thicken slightly.", "Meanwhile, heat a frying pan until hot, add the butter and heat until just foaming.", "Add the breadcrumbs and cook until golden brown, stirring constantly to cook evenly.", "Add the remaining garlic and cook through for one minute then add half the chopped parsley and stir through.", "Carefully drop the potato julienne into the fryer in batches and fry for 3-4 minutes, or until golden-brown and crisp. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Remove with a slotted spoon and drain onto kitchen paper then season with sea salt and a little freshly ground black pepper.", "To serve, pile the mussels into a large shallow bowl, spooning the juices over the top.", "Sprinkle the breadcrumbs over the top and serve the fries alongside."]}, {"isVegetarian": false, "title": "Moules marinière with lemongrass and chilli", "url": "www_bbc_co_uk_food_recipes_moules_marinire_with_96585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["135g/4¾oz butter", "1 onion, finely chopped", "300g/10½oz risotto rice", "900ml/1½ pints vegetable stock", "1½ limes, finely grated zest of 1½ limes, fruit of ¾ of a lime peeled, cut into segments, chopped", "90g/3¼oz parmesan cheese, grated", "sea salt and freshly ground black pepper", "2kg/4lb 8oz fresh mussels", "1 tbsp olive oil", "30g/1oz butter", "30g/1oz ginger, peeled and thinly sliced", "1 red chilli, seeds removed, cut into thin slices", "2 lemongrass stalks, halved and bruised", "4 tbsp coconut milk", "4 tbsp whipped cream", "1 handful fresh coriander, leaves only, chopped", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lime risotto, heat 80g/2¾oz of the butter in a medium frying pan over a low hear. Add the onion and cook gently for 3-4 minutes, stirring occasionally, until lightly golden-brown. Add the rice and turn the heat down to very low. Mix with a wooden spoon until the rice is well coated with the butter and onion.", "Add the stock, little by little, stirring continuously until the liquid is absorbed, then adding more stock. Carry on adding stock, stirring and then continue to add more stock until the rice has a lovely, creamy texture. Make sure the risotto does not stick to the bottom of the pan.", "At the last minute, stir in the chopped lime segments, the lime zest, parmesan and the rest of the butter. If the risotto is too thick, add a few more spoonfuls of stock to loosen it up, then season with salt and pepper. Serve immediately.  ", "For the moules mariniers with lemongrass and chilli, remove and discard the beards from the mussels and wash them in a bowl under cold running water, scrubbing to remove all traces of grit. Discard any that float, any that are broken or any open ones that don’t close when tapped.", "Heat the oil and butter in a large saucepan over a low heat. When the butter begins to foam, add the ginger, chilli and lemongrass and cook for two minutes. Add the mussels and coconut milk and cover with a lid. Cook for four minutes or until the mussels open. Discard any that remain closed. ", "Remove from the heat and add the whipped cream and coriander and season with salt and pepper.", "Serve immediately, in a large bowl placed in the middle of the table for everyone to share with the lime risotto alongside."]}, {"isVegetarian": false, "title": "Moules marinière", "url": "www_bbc_co_uk_food_recipes_moulesmarinere_86817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "1 tbsp olive oil", "½ onion, finely diced", "1 garlic clove, crushed", "¼ red pepper, diced", "¼ tsp chilli flakes", "1 tomato, diced", "½ courgette, diced", "2 tbsp white wine", "8 mussels in shells, beards removed (discard any mussels that don't close tightly when tapped on the work surface)", "1 sprig of chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a pan.", "Sweat the onion until soft but not coloured. Add the garlic and cook for one minute.", "Add the red pepper, chilli, tomato, courgette and wine and simmer until the wine has reduced to one tablespoon.", "Add the mussels, cover the pan and simmer for five minutes or until the shells have opened. Discard any mussels that don't open during cooking.", "Serve in a bowl and garnish with a sprig of chervil."]}, {"isVegetarian": false, "title": "Mussels marinière, two ways", "url": "www_bbc_co_uk_food_recipes_moulesmarinieretwowa_88616", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, finely chopped", "2 garlic cloves, crushed", "100ml/3½fl oz white wine", "300g/10½oz mussels, cleaned, beards removed", "1 large pinch saffron", "3 tbsp chopped fresh parsley", "100ml/3½fl oz double cream", "crusty white bread", "1 lemon, cut into wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a pan and gently fry the onion and garlic for 2-3 minutes. Add the white wine and bring to a simmer. Add the mussels, cover with a tightly fitting lid and steam for 5-7 minutes, or until the mussels have opened up. Discard any mussels that have not opened. Add the saffron and parsley and mix well. Remove half of the mussels and juices to a serving bowl, and into the remaining half stir the cream, heating through until steaming.", "Serve both bowls of mussels with crusty bread on the side and wedges of lemon."]}, {"isVegetarian": false, "title": "Moules marinière with cream, garlic and parsley", "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithc_71787", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moulesmarinierewithc_71787_16x9.jpg", "ingredients": ["1.75kg/4lb mussels", "1 garlic clove, finely chopped", "2 shallots, finely chopped", "15g/½oz butter", "a bouquet garni of parsley, thyme and bay leaves", "100ml/3½fl oz dry white wine or cider", "120ml/4fl oz double cream", "handful of parsley leaves, coarsley chopped", "crusty bread, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the mussels under plenty of cold, running water. Discard any open ones that won't close when lightly squeezed.", "Pull out the tough, fibrous beards protruding from between the tightly closed shells and then knock off any barnacles with a large knife. Give the mussels another quick rinse to remove any little pieces of shell.", "Soften the garlic and shallots in the butter with the bouquet garni, in a large pan big enough to take all the mussels - it should only be half full.", "Add the mussels and wine or cider, turn up the heat, then cover and steam them open in their own juices for 3-4 minutes. Give the pan a good shake every now and then.", "Remove the bouquet garni, add the cream and chopped parsley and remove from the heat.", "Spoon into four large warmed bowls and serve with lots of crusty bread."]}, {"isVegetarian": false, "title": "Moules marinière with crusty bread", "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithc_85254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz fresh live mussels ", "2 tbsp olive oil", "1 onion, finely chopped ", "2 garlic cloves, chopped ", "150ml/5¼fl oz white wine", "2 sprigs thyme", "150ml/5¼fl oz double cream", "small bunch flatleaf parsley, chopped ", "crusty bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by thoroughly scrubbing them under plenty of running water, pulling away the 'beards', the seaweed-like stringy threads. Discard any broken mussels along with the 'beards', and any mussels that don't close tightly when you tap them. ", "Heat the olive oil in a heavy pan with a tight-fitting lid. Add the onions and garlic and cook over a medium heat until softened, but not coloured.", "Add the wine and turn up to a high heat. As the wine starts to boil, add the cleaned mussels and thyme to the pan. Turn the heat down to low. ", "Put the lid on the pan and allow the mussels to steam. Cook for about 4-5 minutes, lifting the lid from time to time to check - you will know they are cooked when the shells have opened. Discard any mussels that remain closed.", "Add the double cream and cook for a further minute.", "Scatter with the chopped parsley and serve straightaway with crusty bread."]}, {"isVegetarian": false, "title": "Moules marinière with dinner rolls", "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithd_83482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz strong white flour", "1 tsp salt ", "7g/1/4oz sachet fast-action dried yeast ", "350ml/12fl oz lukewarm water", "sunflower oil, for greasing", "2kg/4.4lb fresh mussels in their shells, beards removed", "2 medium onions, chopped", "2 garlic cloves, crushed", "small handful fresh parsley stalks", "2 sprigs fresh thyme", "salt and freshly ground black pepper", "300ml/½ pint dry white wine", "3 tbsp chopped fresh parsley", "4 tbsp single cream (optional)", "25g/1oz butter, softened", "1 heaped tsp flour"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bread rolls, preheat the oven to 190C/375F/Gas Mark 5.", "Place the flour into a large bowl, then stir in the salt and yeast.", "Make a well in the middle of the mixture and pour in enough water to make a soft, quite sticky, dough.", "Knead the dough on a lightly floured surface until smooth and elastic. Shape the dough into a round and place in a large, lightly oiled bowl. Cover with oiled cling film and leave to rise in a warm place for 1-1½ hours, or until it doubles in size.", "Lightly oil two or three baking trays.  Divide the dough into 18 pieces.  Shape into rounds by folding the sides to the middles to form round balls. Arrange onto the trays, leaving room between each ball for expansion (they should double in size).", "Cover loosely with oiled cling film and leave to rise in a warm place for 20 minutes, or until doubled in size.", "Place into the oven to bake for 20 minutes, or until golden and cooked through.", "Remove from the oven and leave to cool on a wire rack. Serve with the moules mariniere.", "For the moules mariniere, clean the mussels by scrubbing them well under a running tap, removing any beards (wispy bits), barnacles and grit. Tap any mussels that are slightly open; if they fail to close discard them together with any mussels with cracked shells.  Rinse again under running water before cooking.", "Heat a pan, large enough to hold the mussels. Add the onion, garlic, parsley stalks, thyme, wine and a little salt and freshly ground black pepper. Bring to the boil, cover tightly with a lid and reduce the heat to simmer for 10 minutes, until the onion is tender.", "Remove the lid, bring back to the boil and add the mussels. Replace lid and cook over a high heat for about 4-5 minutes, shaking the pan from time to time, until all the mussels have opened. Discard any that have not opened.", "Remove the mussels from the pan with a slotted spoon and place into a heated wide bowl or tureen. Cover with the pan lid and keep warm. ", "Remove the thyme and parsley stalks from the sauce.", "For the beurre manié, mash the butter and flour together, in a clean bowl.", "Bring the mussel liquid to the boil and whisk in the butter and flour mixture over a high heat until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper.", "Add most of the parsley and a little creamif using. Pour the sauce over the mussels and scatter over the remaining parsley.  ", "Serve at once and remember to have extra bowls to collect the discarded shells."]}, {"isVegetarian": false, "title": "Moussaka", "url": "www_bbc_co_uk_food_recipes_moussaka_01004", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_01004_16x9.jpg", "ingredients": ["2 aubergines, cut into 1cm/½in slices", "1 tbsp fine sea salt", "750g/1lb 10½oz lamb mince", "1 onion, finely chopped", "2 garlic cloves, crushed", "1 tsp dried oregano", "1½ tsp dried mint", "2 bay leaves", "1 cinnamon stick", "1 tbsp plain flour", "½ tsp flaked sea salt, plus extra for seasoning", "200ml/7fl oz red wine", "1 x 400g/14oz can chopped tomatoes", "2 tbsp tomato purée", "7 tbsp olive oil", "500g/1lb 2oz Maris Piper potatoes, peeled, sliced into 1cm/½in slices", "sea salt and freshly ground black pepper", "50g/2oz butter", "50g/2oz plain flour", "400ml/14fl oz milk", "1 tsp finely grated nutmeg", "25g/1oz finely grated parmesan", "1 free-range egg, beaten"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the aubergine pieces in a colander and sprinkle with salt. Set aside for 10 minutes.", "Put the lamb, onions, garlic, oregano, mint, bay leaves and cinnamon in a large heavy-based frying pan and cook over a medium heat for 10 minutes, stirring with a wooden spoon to break up the meat. ", "Stir in the flour, salt and plenty of freshly ground black pepper. Add the wine, tomatoes, tomato purée and bring to a simmer. Cook for 30 minutes, stirring occasionally until the lamb is tender and the sauce has thickened. Season with salt and freshly ground black pepper to taste. Set aside.", "Rinse the aubergine pieces under cold running water and pat dry in a clean tea towel. Heat three tablespoons of the oil in a heavy-based frying pan and fry the aubergines for 2-3 minutes on each side, adding more oil when necessary. Remove from the pan and set aside to drain on kitchen paper.", "Cook the potatoes in boiling water for five mintues, then drain in a colander under running water until cold. ", "Preheat the oven to 180C/160C (fan)/Gas 4. ", "For the white sauce, melt the butter in a large saucepan and stir in the flour. Cook for a few seconds, then gradually stir in the milk. Add half the parmesan and the grated nutmeg. Simmer the sauce gently for 4-5 minutes, stirring regularly. Season to taste with salt and freshly ground black pepper. ", "Remove the saucepan from the heat and quickly stir in the beaten egg. Cover the surface of the sauce with clingfilm to prevent a skin forming.", "Spoon one third of the meat sauce into a large, shallow ovenproof dish. Cover with a layer of potatoes and a layer of aubergines. Repeat the layers twice more, finishing with the aubergines. Pour over the white sauce, making sure it covers in a thick, even layer.  Sprinkle with the remaining parmesan. Bake in the oven for 45 minutes, or until deep golden-brown and bubbling."]}, {"isVegetarian": false, "title": "Moussaka", "url": "www_bbc_co_uk_food_recipes_moussaka_6812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_6812_16x9.jpg", "ingredients": ["75ml/6fl oz olive oil", "1 large onion, finely chopped", "675g/1½lb lamb mince", "3 cloves garlic, chopped", "1.25ml/¼tsp cinnamon", "1.25ml/¼tsp allspice", "2 x 400g/14oz tin of chopped tomatoes", "1 tbsp fresh oregano, chopped", "2 bay leaves", "1 tsp fresh, soft thyme leaves", "175ml/6fl oz white wine", "4 medium aubergines, cut into 1cm/½in slices", "Salt and freshly ground black pepper", "Plain flour, for dusting", "85g/3oz unsalted butter", "85g/3oz plain flour", "900ml/1½pt milk", "85g/3oz parmesan, grated", "115g/4oz gruyère, grated", "2 free-range egg yolks", "1 free-range egg"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat 2 tbsp olive oil in a large casserole dish. Add the onion and cook gently for 10 minutes or until the onion is soft, but not coloured. Brown half the lamb in a frying pan and add to the onion. Add the garlic and break up the meat with a wooden fork until it has a loose texture. Brown the remaining lamb.", "Stir the cinnamon, allspice, chopped tomatoes, oregano, bay leaves and thyme into the casserole. Add the rest of the browned lamb and de-glaze the pan with white wine. Pour straight into the casserole dish, reduce the heat and simmer for approximately 1 hour.", "Place the aubergines in a colander, sprinkle with salt and leave for 30 minutes. This draws out any bitter juices.", "Meanwhile make the béchamel sauce. Melt the butter in a non-stick pan and stir in the flour. Take off the heat and gradually stir in the milk. Return the pan to the heat and stir continuously until the sauce thickens. Simmer over a gentle heat for 5-8 minutes. Remove from the heat, stir in 55g/2oz of the parmesan and 55g/2oz of the gruyère cheese and season with salt and pepper.", "Rinse the aubergines and pat dry. Dust the aubergines with flour and fry in batches in the remaining olive oil until golden on both sides, about 8 - 10 minutes. Drain on kitchen paper. Set aside until ready to construct the moussaka.", "The white sauce should now have cooled enough to whisk in the egg and egg yolks.", "Cover the base of an ovenproof dish (30 x 20cm/12 x 8in) with a third of the mince then cover with half the aubergine slices. Repeat the layers, ending in the last of the mince, then pour over the cheese sauce. Sprinkle over the remaining parmesan and gruyère. Bake in a preheated oven at 180C/350F/Gas4 for 50-60 minutes, until bubbling and golden. Allow the moussaka to settle for 5 minutes before cutting into squares and serving.", "Serve the moussaka with a chunky tomato, cucumber, parsley and mint salad and crusty bread."]}, {"isVegetarian": false, "title": "Moussaka", "url": "www_bbc_co_uk_food_recipes_moussaka_70308", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_70308_16x9.jpg", "ingredients": ["150-175ml/5-6fl oz olive oil", "1 large onion, finely chopped", "3 garlic cloves, crushed", "900g/2lb lamb mince", "50ml/2 fl oz white wine (a generous splash)", "1 x 400g tin chopped tomatoes", "1 x 5cm/2in piece cinnamon stick", "handful fresh oregano leaves, preferably wild Greek oregano, chopped", "3 large aubergines", "salt and freshly ground black pepper", "75g/3oz butter", "75g/3oz plain flour", "600ml/1 pint milk", "50g/2oz parmesan cheese, finely grated", "2 medium free-range eggs, beaten"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven at 200C/400F/Gas 6.", "For the lamb sauce, heat two teaspoons of the oil in a pan. Add the onions and garlic and fry until just beginning to brown. Add the minced lamb and fry over a high heat for 3-4 minutes. Add the wine, tomatoes, cinnamon and oregano and simmer gently for 30-40 minutes while you make everything else. ", "Slice the stalks off the aubergines and cut them lengthways into 5mm/¼in slices. Heat a frying pan until it is jumping hot, add one tablespoon of the oil and a layer of aubergine slices and fry quickly until tender and lightly coloured on each side. Lift out with tongs (every kitchen should have some!), layer over the base of a 2.5-2.75 litre/4 ½-5 pint shallow ovenproof dish and season lightly with a little salt and pepper. Repeat with the rest of oil and aubergines and seasoning each layer as you go. ", "For the topping, melt the butter in a non-stick pan, add the flour and cook over a medium heat for one minute to cook out the flour. Gradually beat in the milk, bring to the boil, stirring, and leave to simmer very gently for 10 minutes, giving it a stir every now and then. Stir in the cheese and some salt and pepper to taste. Cool slightly and then beat in the eggs. ", "Remove the cinnamon stick from the lamb sauce, season to taste with some salt and pepper and spoon it over the top of the aubergines. Pour over the topping and bake for 25-30 minutes until the top is golden-brown and bubbling."]}, {"isVegetarian": false, "title": "Quick moussaka", "url": "www_bbc_co_uk_food_recipes_moussaka_71985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 aubergines ", "olive oil", "1 onion, chopped", "2 cloves of garlic, crushed", "450g/1 lb minced lamb", "3 plum tomatoes, diced", "pinch of cinnamon powder", "pinch of cumin powder", "1 glass of red wine ", "150ml/5fl oz chicken stock", "200ml/7fl oz white sauce", "2 eggs", "pinch of nutmeg", "100g/4oz grated cheese (half mozzarella, half Cheddar)", "2 tbsp fresh mint, chopped", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas5. ", "Slice the aubergines then fry them on both sides in a large pan with a little olive oil. Drain on kitchen paper. To save on washing up, use the same pan with a little more olive oil and fry off the onions and garlic. ", "After five minutes turn the heat up and add the lamb to brown it, then add the tomatoes. Add a good pinch of cumin and cinnamon with the wine and sauté together to break up the tomatoes. Add the chopped mint and the stock in stages.", "In an ovenproof dish, layer the aubergines and lamb mince in a few layers, finishing with a layer of aubergines.", "Combine the white sauce with the eggs, nutmeg and seasoning. Spoon over the top of the mince and then scatter with the grated cheese. ", "Bake in the oven 20-25minutes to colour the cheese and cook through.", "Serve."]}, {"isVegetarian": false, "title": "Moussaka with griddled courgettes", "url": "www_bbc_co_uk_food_recipes_moussaka_with_griddled_06891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp olive oil", "4 aubergines, sliced", "1 large onion, chopped", "2 garlic cloves, crushed", "600g/1lb 5oz lamb mince", "1 x 400g tin chopped tomatoes", "1 tsp ground cumin", "1 tsp ground cinnamon", "1 tsp fresh oregano", "150ml/5fl oz red wine", "2 tbsp chopped fresh mint ", "120ml/4fl oz lamb stock", "25g/1oz unsalted butter", "25g/1oz plain flour", "200ml/7fl oz milk, heated to near-boiling", "2 free-range eggs, beaten", "pinch freshly grated nutmeg", "75g/2½oz cheddar, grated", "75g/2½oz mozzarella, grated", "salt and freshly ground black pepper ", "4 small courgettes, cut into ribbons using a peeler", "4 tbsp olive oil", "1 lemon, juice only", "2 tbsp fresh mint"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "Heat a frying pan over a medium heat. When hot, add 4 tablespoons olive oil and the aubergines. Fry for 2-3 minutes, then set aside on a plate lined with kitchen paper.", "In a separate pan, heat the remaining oil. Once hot, add the onion and garlic and fry for a further 2-3 minutes, or until the onions have softened. Add the lamb mince and cook for 4-5 minutes, until browned. Add the tomatoes, cumin, cinnamon, oregano and red wine. Cook for 2-3 minutes, breaking up the tomatoes with a wooden spoon as they cook. Add the mint and stock. Bring to the boil, then reduce the heat and simmer for 15 minutes. Season, to taste, with salt and freshly ground black pepper.", "Layer the meat sauce and aubergine in a large baking dish like you would if you were making lasagne.", "Place the butter in a pan over a medium heat. When melted, add the flour and cook, stirring well, for a minute. Add the hot milk and cook, stirring constantly, for 2-3 minutes, until the mixture has thickened. Stir in the eggs and nutmeg, season with salt and freshly ground black pepper. Add half of the grated cheddar and mozzarella and continue to cook, stirring, until combined and smooth.", "Spoon the cheese sauce over the top of the lamb and aubergine, then sprinkle with the remaining cheddar and mozzarella.", "Bake for 20-25 minutes, until the cheese topping is golden-brown and bubbling.", "For the courgettes, heat a griddle pan. Toss the strips of courgette in oil to coat and cook for 1-2 minutes or until charred. Place in a bowl and mix with the lemon juice and fresh mint.", "Serve the moussaka in slices with the courgettes alongside."]}, {"isVegetarian": false, "title": "Mozzarella-stuffed chicken with roasted tomatoes, aubergines and basil pesto", "url": "www_bbc_co_uk_food_recipes_mozzarella-stuffed_90052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 vine tomatoes, cut in half", "2 tbsp olive oil", "Salt and freshly ground black pepper", "4 sprigs fresh thyme", "4 skinless chicken breasts, wing bone attached", "110g/4oz mozzarella, preferably buffalo, cut into 8 thick slices", "75g/3oz plain flour", "2 free-range eggs, beaten", "75g/3oz Japanese panko breadcrumbs (available from Japanese grocers), or dried breadcrumbs", "Vegetable oil, for deep frying", "2 aubergines, halved lengthways, cut into large pieces", "3 sprigs fresh rosemary, leaves only", "2 tbsp olive oil", "Salt and freshly ground black pepper", "60g/2½ oz fresh basil leaves", "50g/2oz pine nuts, toasted", "50g/2oz parmesan, freshly grated", "2 garlic cloves", "125-175ml/4½ -5fl oz extra virgin olive oil, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted tomatoes, preheat the oven to 150C/300F/Gas 1.", "Place the tomatoes, cut-sides facing upwards, onto a roasting tray. Drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper. Scatter over the thyme sprigs.", "Roast the tomatoes in the oven for two hours, or until slightly dried out. Remove from the oven and set aside to cool.", "For the mozzarella-stuffed chicken, increase the oven temperature to 200C/400F/Gas 6. Heat the oil in a deep fat fryer to 190C. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Cut a deep slit in the side of each chicken breast, then ease the knife around to the edges of the breast to create a ‘pocket’ in the centre.", "Season the mozzarella slices, to taste, with salt and freshly ground black pepper. Insert two mozzarella slices into the pocket in each chicken breast.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto another plate.", "Dredge each stuffed chicken breast first in the flour, then dip them in the egg, then roll them in the breadcrumbs until completely coated.", "Carefully lower the coated chicken breasts into the hot oil and fry for 2-3 minutes, or until golden-brown. Remove from the pan using a slotted spoon and transfer to a roasting tray. Bake in the oven for 15-20 minutes, or until the chicken is cooked through.", "For the aubergine, mix together the aubergine pieces, rosemary leaves and olive oil until the oil coats the aubergines. Season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan until hot, then cook the aubergine pieces for 30-45 seconds on each side, turning regularly, until charred griddle marks appear on the aubergine pieces and they are cooked through.", "For the pesto, blend the basil, pine nuts, parmesan and garlic in a food processor to a textured purée. (Alternatively, crush the pesto in a pestle and mortar)", "Add olive oil to loosen the mixture and blend again until well combined.", "To serve, place one mozzarella-stuffed chicken breast into the centre of each of four serving plates. Pile the aubergines and roasted tomatoes alongside. Drizzle over the pesto."]}, {"isVegetarian": false, "title": "Mozzarella chicken with butter bean mash", "url": "www_bbc_co_uk_food_recipes_mozzarella_chicken_with_82882", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mozzarella_chicken_with_82882_16x9.jpg", "ingredients": ["4 chicken breasts, boned and skinned", "calorie controlled cooking oil spray", "1 medium onion, thinly sliced", "2 garlic cloves, crushed", "400g tin chopped tomatoes", "3 tbsp tomato purée", "1½ tsp dried oregano", "85g/3oz pitted green or black olives", "2 x 125g packs reduced fat mozzarella, sliced and drained on kitchen paper", "calorie controlled cooking oil spray", "1 medium onion, finely chopped", "1 garlic clove, crushed", "2 x 400g tin butter beans, drained", "good squeeze lemon juice", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken breasts with salt and pepper. Spray a large, deep non-stick flameproof frying pan or sauté pan with oil and place over a high heat. Cook the chicken on each side for 3 minutes or until lightly browned. Transfer to a plate.", "Reduce the heat to low, spray a little more cooking oil into the pan and cook the onion for 4-5 minutes, stirring until softened and lightly browned. Add the garlic and cook for a few seconds. ", "Pour in the tomatoes. Stir in the tomato purée, oregano, olives and 300ml/10fl oz cold water. Bring to the boil and cook for 5 minutes, stirring regularly. Reduce the heat to a gentle simmer and add the chicken. Cook for 10 minutes, stirring occasionally, until the chicken is tender and cooked through. Season to taste.", "Preheat the grill to its hottest setting. Top the chicken and sauce with the sliced mozzarella. Sprinkle with ground black pepper. Place under the hot grill and cook for 2-3 minutes or until the cheese melts. ", "For the butter bean mash, spray a small non-stick saucepan with cooking oil and place over a medium heat. Add the onion and cook for 3 minutes. Add the garlic and cook for 1 further minute. ", "Put the beans in a food processor with 100ml/3½fl oz water, a good pinch of salt and pepper. Add the cooked onion and garlic and blend to a thick purée. Spoon back in to the saucepan and heat, stirring constantly until hot. Add a good squeeze of lemon and season to taste. ", "Divide the butterbean mash between 4 plates and add the chicken and sauce. Serve with freshly cooked vegetables or salad."]}, {"isVegetarian": false, "title": "Mozzarella stuffed chicken meatballs with roasted tomato sauce", "url": "www_bbc_co_uk_food_recipes_mozzarella_stuffed_57353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "1 large onion, finely chopped", "2 garlic cloves, finely chopped", "1 tsp dried oregano", "100ml/3½fl oz red or white wine", "1 x 400g tin tomatoes", "pinch of sugar (optional)", "2 tbsp balsamic vinegar", "500g/1lb 2oz fresh plum tomatoes, halved", "salt and freshly ground black pepper", "750g/1lb 10oz chicken mince, made up of half breast meat and half thigh meat", "olive oil, for frying", "1 small onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp dried oregano", "50g/1¾oz breadcrumbs", "1 free-range egg, beaten", "50ml/2fl oz double cream", "30g/1oz Parmesan, finely grated", "generous grating of nutmeg", "20 mini mozzarella balls, plus extra for topping ", "16 basil leaves", "200g/7oz pappardelle", "75g/2¾oz Parmesan, grated", "few basil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put 2 tablespoons of the olive oil in a large saucepan and add the onion. Gently fry until very soft and translucent, then add the garlic and oregano. Cook for a further minute, and then pour in the wine. Allow to bubble up for a minute or two, then turn down the heat and add the tinned tomatoes. Season with salt and pepper. Leave to simmer, covered, for as long as you can, but at least 1 hour, checking regularly and adding a splash of water if it appears to be getting dry. After the first 20 minutes, check the tomatoes for sweetness and add a pinch of sugar if you think they need it.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Meanwhile, put the remaining olive oil and the balsamic vinegar into a roasting tin and season with salt and pepper. Mix, then coat the fresh tomatoes in the olive oil mixture. Roast for about 30 minutes or until soft. ", "Put the roasted tomatoes in a sieve and press the flesh through into the tomato saucepan, extract every bit of lovely flavour from these beauties. Keep the oven on to cook the meatballs. ", "To make the meatballs, put the chicken mince in a large bowl and season with salt and pepper. Heat the olive oil in a small frying pan and add the onion. Fry gently until very soft and translucent. Add the garlic and cook for a further minute. Allow to cool a little then add to the chicken.", "Add the oregano, breadcrumbs, egg, cream, Parmesan and nutmeg to the chicken. Mix very thoroughly. Divide the mixture into 20 balls.", "Thoroughly drain the mozzarella balls. Flatten each meatball. Wrap each ball of mozzarella in a basil leaf and put in the middle of the meatball. Wrap the meat around the mozzarella and basil until it is completely enclosed. Shape gently into a sphere.", "Heat a little olive oil in a large frying pan and fry the meatballs on each side until well browned. ", "Transfer the meatballs to an ovenproof dish and pour over the tomato sauce – they will not be completely covered. Slice the remaining mozzarella and arrange over the sauce, then grate over some more Parmesan. Bake in the preheated oven for around 20-25 minutes until piping hot.", "While the meatballs are baking, cook the pasta according to the packet instructions. Serve together, with more Parmesan grated over if you like. A few perky basil leaves on top look good too. "]}, {"isVegetarian": true, "title": "Mozzarella and Mediterranean vegetable salad", "url": "www_bbc_co_uk_food_recipes_mozzarellaandmediter_84429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ aubergine, cut into slices lengthways", "½ romero pepper, cut into slices lengthways", "100g/3½oz mini mozzarella balls", "small handful fresh basil leaves, chopped", "small handful fresh parsley leaves, chopped", "1 tbsp olive oil", "½ lemon, juice only", "balsamic vinegar, for drizzling (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat one tablespoon of the olive oill in a frying pan over a medium heat and fry the aubergine and pepper slices until soft and golden.  Allow to cool slightly.", "Place the mozzarella and herbs together into a bowl and mix together.  Add the vegetables.", "For the dressing, place the olive oil and lemon juice into a bowl and whisk together. ", "To serve, transfer the salad mixture into a serving bowl and pour over the dressing. Drizzle with balsamic vinegar if desired."]}, {"isVegetarian": false, "title": "Mozzarella beef fillet with sautéed potato, onion rings, roasted tomatoes and mushroom sauce", "url": "www_bbc_co_uk_food_recipes_mozzarellacrustbeeff_80165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz breadcrumbs", "1 tbsp chopped mixed fresh herbs (parsley, chervil, chives)", "75g/2¼oz mozzarella ", "150g/5½oz beef fillet", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil ", "25g/1oz butter", "1 sprig fresh rosemary", "2 garlic cloves, crushed", "100g/3½oz pink fir apple potatoes, halved and blanched for five minutes in boiling water ", "500ml/18fl oz vegetable oil", "100g/3½oz self-raising flour", "1 tsp baking powder", "1 free-range egg", "50ml/2fl oz spring water", "½ onion, thickly sliced and separated into rings", "pinch salt", "100g/3½oz vine cherry tomatoes", "1 tbsp olive oil", "25g/1oz butter", "1 tbsp olive oil", "½ garlic clove, chopped", "½ onion, finely chopped", "50g/1¾oz chanterelle mushrooms", "1 tsp grain mustard", "100ml/3½fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the beef, place the breadcrumbs and the herbs into a bowl and mix together. ", "Add the mozzarella to coat with the herbs and breadcrumbs and set aside.", "Heat an ovenproof griddle pan until smoking. Rub the beef with the olive oil and season with salt and freshly ground black pepper. Place the beef onto the griddle and cook for two minutes on each side, to brown the meat.", "Place the mozzarella with herby breadcrumbs onto the beef. Transfer to the oven to roast for five minutes, or until the beef is cooked to your taste, then rest on a warm plate for one minute.", "To make the sautéed potato, heat the oil and butter in a frying pan. Add the rosemary and garlic and fry for one minute.", "Add the potatoes and fry over a medium heat, turning the potatoes regularly, until golden.", "To make the onion rings, heat the oil in a deep, heavy bottomed saucepan until a breadcrumb sizzles in it the oil. (CAUTION: hot oil can be dangerous - do not leave unattended!)", "Place the flour, baking powder, egg and spring water into a large bowl and whisk together to make a batter.", "Dip the onion rings in the batter and then carefully place into the hot oil and deep-fry for 2-3 minutes, until cooked and golden. Carefully remove with a slotted spoon and drain on kitchen towels and sprinkle with salt.", "To make the roasted tomato, place the tomatoes on a small baking sheet, drizzle with oil and season, to taste, with salt and freshly ground black pepper. Place into the oven and roast for ten minutes until cooked and soft.", "To make the mushroom sauce, heat the butter and oil in a medium frying pan over a medium heat. Add the garlic and onion and fry for 4-5 minutes, until softened.", "Add the mushrooms and mustard and fry for two minutes.", "Add the cream, bring to the boil, reduce the heat and simmer for five minutes, until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the cheese covered beef in the centre of a warm plate and serve the sautéed potatoes, onion rings and roasted tomatoes in piles beside. Pour over the mushroom sauce."]}, {"isVegetarian": true, "title": "Mozzarella, aubergine, mushroom and roasted pepper roll", "url": "www_bbc_co_uk_food_recipes_mozzarella_aubergine_83704", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large mushroom or 4 button mushrooms, thinly sliced", "½ aubergine, thinly sliced", "½ tsp olive oil", "1 wholemeal roll, sliced in half", "50g/1¾oz roasted red pepper from a jar (not in oil), drained, sliced", "30g/1oz mozzarella, sliced", "1 thin slice red onion", "pinch dried oregano", "handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sliced mushrooms and aubergines in a microwave safe bowl. Drizzle over the olive oil and season with salt and freshly ground black pepper. Cover with cling film and microwave on high for 2 minutes, until the mushrooms and aubergines have steamed and are tender.", "Let them cool slightly, then pile onto the sliced roll. Top with the roasted pepper, mozzarella and red onion. Season with a pinch of dried oregano and pile on the rocket. "]}, {"isVegetarian": false, "title": "Mouthwatering chicken", "url": "www_bbc_co_uk_food_recipes_mouthwatering_chicken_34426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½cm/1in piece fresh root ginger, peeled and grated ", "2 tbsp mirin ", "½ tsp ground Sichuan pepper ", "¼ tsp ground sea salt ", "½ tsp crushed dried chilli flakes ", "400g/14oz free-range chicken thighs or drumsticks", "110g/4oz spring onions, two finely sliced and the remainder sliced into 2½cm/1in pieces", "2 tbsp vegetable oil ", "½ tsp ground Sichuan pepper", "½ tsp crushed dried chilli flakes ", "1 tbsp light soy sauce ", "1 tbsp rice vinegar ", "1 tbsp toasted sesame oil", "2 tbsp flavourless oil, such as vegetable oil", "1 banana shallot, sliced", "1 garlic clove, sliced", "25g/1oz dried baby shrimp ", "1 head Gai Lan (Chinese broccoli), cut into florets", "2 tbsp light soy sauce", "2 tbsp black rice vinegar", "2 tbsp toasted sesame oil", "400g/14oz brown rice", "50g/1¾oz sesame seeds, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the grated ginger, mirin, ground Sichuan pepper, ground sea salt and crushed dried chillies together. Rub the mixture all over the chicken.", "Put the 2½cm/1in pieces of spring onion in a shallow heatproof dish. Lay the chicken thighs (or drumsticks) on top. ", "Fill a wok or a large pan with 1 litre/1¾ pints water and place a stainless steel steamer rack over the top. Bring the water to a simmer.", "Place the heatproof dish with the chicken on top of the rack, cover the pan with a lid and steam over a medium heat for 25 minutes, or until the chicken is cooked through. (The chicken is cooked when the juices run clear when the thickest part of the flesh is pierced.) Reserve the cooking juices from the dish.", "Take the chicken off the heat and carefully shred the chicken off the bone using a knife and fork (the chicken will be very hot). Slice and shred the skin into bite-sized pieces. Place on a serving plate. ", "Meanwhile, place the brown rice in a colander and wash until the water runs clear. Place the rice in a pan and add 500ml/18fl oz water. Place over a high heat and bring to the boil, then turn the heat down to low and cover with lid. Cook for 15-20 minutes, or until the rice has absorbed all the water. Turn off the heat and fluff the rice with a fork. Keep in the warm pan until ready to serve. ", "For the dressing, heat a small wok or pan and add the vegetable oil. In a small heatproof bowl, add the ground Sichuan pepper and chilli flakes. Pour the hot oil over the spices, sizzling them, and then add the soy sauce, rice vinegar and toasted sesame oil. Stir in four tablespoons of the reserved cooking juices. Spoon this sauce over the chicken.", "For the stir-fried broccoli, heat a wok, once hot, add the oil. Add the shallot, garlic and shrimp and cook for 1-2 minutes. Add the broccoli and cook for a further 2-3 minutes. Add the remaining ingredients and cook for a further 1-2 minutes.\r\n", "To serve, scatter the finely sliced spring onions over the chicken. Serve the rice in four bowls and garnish them with some toasted sesame seeds. Put the remaining reserved cooking juices from the chicken in a small bowl, serve them on the side, to use to moisten and flavour rice.  Serve the broccoli alongside the chicken."]}, {"isVegetarian": true, "title": "Mozzarella in carrozza", "url": "www_bbc_co_uk_food_recipes_mozzarellaencarozza_89236", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices white bread", "8 large fresh basil leaves", "1 x 150g/5oz mozzarella ball, cut into four thick round slices", "2 spring onions, finely sliced", "2 tbsp flour, seasoned with salt and freshly ground black pepper", "2 free-range eggs, beaten with a splash of milk and seasoned with salt and freshly ground black pepper", "2 tbsp olive oil, for frying", "sea salt flakes", "tomato chutney"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Use a 10cm/4in pastry cutter to cut circles from the bread slices. ", "Place a basil leaf onto each of four of the bread circles.", "Place a slice of mozzarella onto each basil leaf, then top with another basil leaf.", "Sprinkle some of the spring onions on top and season well with salt and freshly ground black pepper.", "Top each with one of the four remaining bread circles and press the edges of the bread together to seal the sandwich.", "Dredge the sandwiches in the seasoned flour to coat lightly, then dip them into the beaten egg mixture to completely coat. ", "Heat the olive oil in a large non-stick frying pan over a medium heat.", "Fry the sandwiches for 3-4 minutes each side, or until crisp and golden-brown all over.", "To serve, place two sandwiches onto each of four plates, sprinkle with sea salt flakes and serve with a dollop of tomato chutney."]}, {"isVegetarian": true, "title": "Mozzarella in carrozza", "url": "www_bbc_co_uk_food_recipes_mozzarellaincarrozza_87988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices crusty white bread", "100g/3½oz buffalo mozzarella, sliced", "½ beef tomato, sliced", "1 free-range egg, beaten", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a slice of bread on a plate and top with the sliced mozzarella and sliced tomato. Place the other slice of bread on top to make a sandwich. ", "Beat the egg in a bowl with a little salt and freshly ground black pepper. Dip the sandwich into the beaten egg. ", "Heat the olive oil in a pan, add the sandwich and fry for 2-3 minutes on each side, or until golden-brown. Remove from the heat, cut in half and serve on a plate."]}, {"isVegetarian": false, "title": "Mozzarella skewers with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_mozzarellaskewerswit_85482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz buffalo mozzarella, torn into large pieces, about 50g/2oz each", "plain flour, seasoned with salt and freshly ground pepper", "2 free-range eggs, beaten", "fresh breadcrumbs, for rolling", "200ml/7fl oz vegetable oil, for frying", "200g/7oz cherry tomatoes, halved", "10 canned anchovies, rinsed and drained, finely chopped", "salt and freshly ground black pepper", "100ml/3½fl oz olive oil", "½ lemon, juice only", "1 tbsp fresh thyme leaves", "1 garlic clove, crushed", "1 tbsp pine nuts ", "2 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Thread two pieces of mozzarella onto each of four wooden skewers, that have been soaked in water for ten minutes, or until all the mozzarella has been used up.", "Dredge each mozzarella skewer in the seasoned flour, then dip into the beaten egg to coat.", "Dip and roll the mozzarella in the breadcrumbs to completely coat the cheese. ", "Heat the oil in a deep frying pan until it's almost smoking hot. Add the skewers and fry, turning regularly, until they are crisp and golden-brown all over.", "Carefully remove from the oil with a slotted spoon and drain on kitchen paper.", "For the tomato and anchovy sauce, place the tomatoes, cut-side up, into a shallow ovenproof dish.", "Place the anchovies on top of the tomatoes and season with salt and freshly ground pepper.", "Drizzle over the olive oil, then place into the oven to roast for 20 minutes, or until softened. ", "Once the tomatoes are cooked, add the lemon juice, thyme, garlic, pine nuts and red wine vinegar and mix gently with a spoon. ", "To serve, place a spoonful of the tomato and anchovy sauce onto each plate and serve with a mozzarella skewer on top."]}, {"isVegetarian": true, "title": "'Mr Carrot' on creamed carrot", "url": "www_bbc_co_uk_food_recipes_mrcarrotoncreamedcar_88122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 carrots, chopped", "25g/1oz butter", "150ml/¼ pint double cream", "2 tbsp white wine", "Salt and freshly ground black pepper", "For 'Mr Carrot'", "1 carrot, trimmed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the creamed carrots, place the chopped carrots into a pan of boiling salted water and boil for six minutes or until softened and then drain.", "Melt the butter in a frying pan, add the cooked carrots and stir in the melted butter. Add the cream and wine and simmer for five minutes. Season well with salt and freshly ground black pepper and spoon onto a serving plate.", "For 'Mr Carrot', place a carrot into pan of boiling salted water and boil for five minutes or until tender and drain.", "To serve, place 'Mr Carrot' standing up vertically in the creamed carrots."]}, {"isVegetarian": true, "title": "Muhammara (red pepper dip)", "url": "www_bbc_co_uk_food_recipes_muhammara_red_pepper_dip_65246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 roasted red peppers (jarred is fine)", "75g/2½oz walnuts ", "75g/2½oz white breadcrumbs ", "1 tbsp tahini", "1 tbsp pomegranate molasses", "4 tbsp extra virgin olive oil", "fresh mint leaves, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the red peppers in a food-processor until smooth and put in a large bowl.", "Blend most of the walnuts until you have fine crumbs and add to the pepper purée. Mix in the breadcrumbs and season well. ", "Stir in the tahini and pomegranate molasses and loosen with olive oil and a splash of water, if necessary.", "Arrange in a serving dish and garnish with fresh mint and the remaining walnuts"]}, {"isVegetarian": true, "title": "Mujaddarah", "url": "www_bbc_co_uk_food_recipes_mujaddarah_80248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz white basmati rice", "175g/6oz small brown lentils", "75g/3oz butter", "1 tsp ground cinnamon", "1 tsp ground allspice", "salt, to taste ", "1 tsp freshly ground black pepper", "300ml/10½ fl oz sunflower oil", "4 large onions, halved and sliced into very thin rounds", "large handful chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice very well in several changes of cold water, until the water runs clear. Place in a saucepan, then cover with warm water. Add salt, to taste, and bring to the boil and simmer for 10-12 minutes.", "Put the lentils into a separate saucepan and cover generously with water. Bring to the boil, reduce heat to a gentle simmer and cook for about 10 minutes or until the lentils are still a bit hard. Drain immediately and set aside.", "While the lentils are cooking, make the caramelised onions. Heat the oil in a large frying pan.   Depending on the size of your frying pan, you may need to cook them in two batches. When the oil is hot, add enough sliced onion to make a single layer, and cook over a medium heat, stirring occasionally. Towards the end of the cooking, when onions are beginning to brown, stir constantly to stop them from burning. The cooking time will be about 30 minutes. When nicely browned, remove onions with a slotted spoon, and then fry the rest of the onions.", "Melt butter in a saucepan and add the spices. Stir in the drained lentils and rice and a third of the fried onions. Gently toss them all together. Pour enough water into the saucepan to cover the rice and lentils by about 0.5cm/¼inch and season to taste with salt and freshly ground black pepper. Cover the top with some damp baking parchment cut to the shape of the pan or some foil so it touches the surface. ", "Put a lid on the pan and bring to the boil over a high heat. After five minutes turn down the heat to low, then cook for a further five minutes. All the water should now have been absorbed and the rice grains will be standing on end. Serve covered with the remaining fried onions and sprinkled with the chopped coriander."]}, {"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_mulled_cider_54895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml fresh apple juice", "1 heaped tbsp muscovado sugar", "half an orange studded with 3-4 cloves", "1 cinnamon stick", "500ml cider ", "50ml orange liqueur", "1 lemon and ginger herbal tea bag"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the apple juice and sugar into a pan and stir.  Warm together until the sugar is dissolved. Add the cinnamon stick and the half orange studded with cloves. Add the cider and orange liqueur and warm gently", "Put in the lemon and ginger teabag and leave to infuse for 2 minutes and then remove. Warm, do not boil, for 10 min so that all flavours infuse. Serve warm. If pre-preparing, remove spices and fruit and keep warm. "]}, {"isVegetarian": true, "title": "Mulled wine baked fruit", "url": "www_bbc_co_uk_food_recipes_mulled_fruit_salad_08855", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_fruit_salad_08855_16x9.jpg", "ingredients": ["3 apples, peeled, cored and cut into eighths", "3 pears, peeled, cored and quartered", "5cm/2in orange peel, studded with 3 cloves", "1 cinnamon stick", "½ vanilla pod, split lengthways", "1 tbsp sweetener, or 3 tbsp sugar", "375ml/13fl oz (½  bottle) red wine, such as Rioja", "250g/9oz frozen black cherries", "50g/1¾oz raisins", "low-fat crème fraîche, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Put everything into a shallow, ovenproof dish and bake for 45 minutes, stirring 2 or 3 times. The wine will slowly poach the fruit, leaving it intact and gloriously purple. Allow to cool slightly before serving with a dollop of low-fat crème fraîche, if using. "]}, {"isVegetarian": true, "title": "Mulled wine-spiced roll with brandy icing", "url": "www_bbc_co_uk_food_recipes_mulled_wine-spiced_roll_67007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cinnamon stick, crushed", "½ tsp whole cloves ", "½ tsp ground ginger ", "¼ tsp ground nutmeg", "20g/¾oz dried fast-action yeast", "625g/1lb 7oz strong white bread flour, plus extra for dusting", "75g/2¾oz caster sugar", "pinch sea salt", "500g/1lb 2oz chilled butter, sliced into 1cm/½in-thick rectangles, plus extra for greasing ", "2 free-range egg yolks, lightly beaten", "300g/10½oz full-fat cream cheese", "1 vanilla pod, seeds only", "1 tsp mulled spice mixture (see above)", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz brandy"], "serves": "Makes 9", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the spice mixture, grind the ingredients to a fine powder in a pestle and mortar or spice grinder. Set aside.", "For the roll, put the yeast and a little water in a small saucepan and warm gently. Place the flour, sugar, salt and yeast mixture into a free-standing food mixer fitted with a dough hook. Set the motor running at a slow speed, then gradually pour in 450ml/¾ pint of cold water until the mixture comes together as an elastic dough and starts sticking to the edges of the mixing bowl (You may not need to use all of the water.).", "Cover the bowl with a clean tea towel and set aside in a warm room for about 20 minutes, or until the dough has doubled in size. ", "When the dough has risen, turn it out onto a lightly floured work surface and knock it back. Roll the dough out to a rectangle measuring 60cmx30cm/24inx12in. ", "Lay the slices of chilled butter in two lines down one side of the dough rectangle. Fold the other half of the dough over the buttered half, pressing  down gently at the edges to seal. Bash the filled dough with a rolling pin, then roll out again into another rectangle measurung 60cmx30cm/24inx12in. ", "Fold each of the short edges of the dough rectangle into the centre so that they meet in the middle, then fold the rectangle again like a book. Repeat the bashing, rolling and folding process twice more, then wrap the dough in cling film and chill in the fridge for one hour.", "Roll the chilled dough out into a rectangle measuring 30cmx45cm/12inx18in and approximately 1cm/½in thick. Set aside. ", "For the filling, mix all the ingredients together in a bowl until well combined.", "Spread filling evenly over the dough, then roll up the dough tightly, starting at the longest side closest to you. Cut the roll into 9 slices, each 5cm/2in thick. ", "Grease a 23cm/9in circular springform cake tin with butter. Place one of the roll slices in the centre, standing upright, then arrange the remaining 8 slices around it. Make sure they are not too tightly packed. Set aside to prove again for 35-40 minutes, or until doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "When the rolls have proved, brush them all over with the beaten egg. Bake in the oven for 40-45 minutes, or until the rolls are golden-brown and have expanded and joined together. Remove from the oven and set aside to cool on a wire rack. Separate once cool enough to handle.", "Meanwhile for the icing, mix together the icing sugar, maple syrup and brandy in a bowl until smooth.", "To serve, arrange the rolls onto a serving platter. Drizzle the brandy icing over the mulled wine-spiced rolls in a criss-cross pattern."]}, {"isVegetarian": true, "title": "Mulled wine", "url": "www_bbc_co_uk_food_recipes_mulled_wine_46955", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg", "ingredients": ["1 large orange", "3 lemons", "12 cloves", "2 satsumas or clementines", "2 x 750ml bottles red wine", "2 cinnamon sticks", "150g/5½oz caster sugar (optional)", "brandy, to taste (optional)"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully peel the zest very thinly from the orange and lemons using a vegetable peeler. Squeeze out the juice and reserve. ", "Stick the cloves into the satsumas. ", "Pour the wine, 1.2 litres/2 pints of cold water, and the citrus peel and juices into a large, heavy-based saucepan. Add the clove-studded satsumas and cinnamon sticks. Bring the mixture just to the boil, then reduce the heat until the mixture is simmering, cover the pan with the lid, and continue to simmer for about 1 hour. Stir in the sugar gradually during cooking, until the mulled wine is sweetened to your liking (you may not need all of the sugar). ", "Strain the mulled wine and serve hot in cups."]}, {"isVegetarian": true, "title": "Mulled wine trifle", "url": "www_bbc_co_uk_food_recipes_mulled_wine_trifle_96060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz butter, at room temperature", "175g/6oz caster sugar", "3 free-range eggs", "250g/9oz self-raising flour ", "2-3 tbsp milk", "2 lime zest, only", "2 pinches finely ground nutmeg", "240ml/8¾fl oz red wine", "2 x 5cm/2in cinnamon", "thumb-nail sized piece ginger, bashed ", "8 green cardamom pod, bashed ", "1 clove", "2 tbsp caster sugar", "1 orange, juice and zest", "1 packet strawberry jelly", "2 x 400g/14oz tins fruit cocktail in light syrup, drained", "250ml/9fl oz whipping cream", "25g/1oz flaked almonds, toasted", "small handful glacé cherries", "3 large free-range eggs, yolks only", "50g/1¾oz caster sugar", "50g/1¾oz cornflour", "1 tsp vanilla extract", "600ml/1 pint whole milk", "300ml/10½fl oz single cream"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, preheat the oven to 180C/350F/Gas 4. ", "Grease a 18cm/7in cake tin and line the base with baking parchment.", "Cream the butter and sugar together in a bowl.", "Beat in the eggs, one at a time, beating all the time and adding a tablespoon of the flour with the last egg to prevent splitting.", "Sift the flour and gently fold it in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the zest and nutmeg.", "Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown.", "Remove the cake from the oven and set aside to cool. It is best to let the cake go stale for a day or two so that it soaks up more jelly.", "For the mulled jelly, place the red wine with the spices, sugar, orange zest and orange juice into a saucepan over a high heat.", "Bring to the boil and then reduce the heat to simmer for ten minutes.", "Strain and discard the spices; then measure the liquid. Top up with boiling water to the amount of liquid need for the instructions on the packet of strawberry jelly.", "Make the jelly as directed on the packet and set aside.", "To assemble, cut the cake into cubes and put in a large trifle bowl. Scatter over half of the fruit cocktail and pour half of the jelly on top of the sponge. Place in the fridge to set.", "Once set, pour on the rest of the jelly and the rest of the fruit and return to the fridge to set again.", "For the custard, put the egg yolks, caster sugar, cornflour and vanilla extract into a large bowl and whisk until blended. ", "Heat the milk and cream together in a pan until hot, but not boiling. ", "Gradually whisk this into the egg yolk mixture a little at a time, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat and cover with cling film in contact with the surface to prevent a skin forming while it cools.", "Pour over the cooled custard, cover and leave until completely cold before transferring to the fridge to chill and set.", "To finally assemble, beat the whipping cream in a bowl until a ribbon of cream falls from the whisk when the whisk is removed.", "Gently spread the cream over the surface of the set custard and scatter with the almonds and top with glacé cherries. "]}, {"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_mulledcider_8851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3½pts/2L dry cider or fresh apple juice", "2 apples studded with cloves", "4-6 cinnamon sticks", "5-6 allspice berries", "zest of 1 orange", "dark rum (optional)", "slices of apple for garnish"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all ingredients in a large saucepan and simmer gently for 30 minutes - do not boil. ", "Transfer to a heatproof bowl and ladle into glass mugs. Garnish with apple slices to serve."]}, {"isVegetarian": true, "title": "Mulled wine", "url": "www_bbc_co_uk_food_recipes_mulledwine_8156", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_8156_16x9.jpg", "ingredients": ["1 bottle red wine", "60g/2oz demerara sugar", "1 cinnamon stick", "grated nutmeg", "1 orange, halved", "1 dried bay leaf", "60ml/2fl oz sloe or damson gin (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the wine in a saucepan with the orange, sugar, bayleaf and the spices.", "Heat gently until the sugar has dissolved. Taste to see if you want the wine sweeter, and add more sugar to taste.", "Off the heat, stir in the sloe or damson gin if you are using it.", "Strain into heatproof glasses and serve at once."]}, {"isVegetarian": true, "title": "Spiced mulled wine", "url": "www_bbc_co_uk_food_recipes_mulledwine_84959", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_84959_16x9.jpg", "ingredients": ["½ bottle red wine", "1 cinnamon stick", "2 star anise", "2 cloves", "1 orange, sliced", "1 lemon, sliced", "50g/1¾oz brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a saucepan and simmer gently for 6-8 minutes, without boiling. Alternatively, place the ingredients in your slow cooker and cook on low until warm (1-2 hours, depending on your slow cooker). ", "To serve, pour the mulled wine into heatproof glasses."]}, {"isVegetarian": true, "title": "Mulled wine fruit compôte", "url": "www_bbc_co_uk_food_recipes_mulledwinefruitcompo_84808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bottle red wine", "1 orange, juice and zest", "250g/9oz mixed dried fruit", "100g/3½oz caster sugar", "1 tsp mixed spice", "1 tsp cornflour", "25ml/1fl oz water", "100g/3½oz caster sugar", "150g/5½oz roasted chestnuts", "½ lemon, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the compote, place the wine, orange juice and zest, dried fruit, sugar and spice into a pan and cook for six minutes. ", "Place the cornflour and the water into a separate bowl and mix the ingredients until the mixture is smooth.", "Add the cornflour mixture to the compote and stir until the texture of the sauce has thickened.", "For the caramelised chestnuts, heat the sugar in a frying pan over a gentle heat, until the sugar has melted to create a smooth caramel. Add the chestnuts to the caramel and mix well to coat them.  Then pour in the lemon juice and mix well.  Then pour the mixture onto a greased non-stick baking sheet.", "To serve,  place the compote into a clean bowl.  Sprinkle some of the chestnuts on top of the compote."]}, {"isVegetarian": false, "title": "Mulled wine trifle", "url": "www_bbc_co_uk_food_recipes_mulledwinetrifle_93108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwinetrifle_93108_16x9.jpg", "ingredients": ["1 orange, peel only, white pith removed", "1 lemon, peel only, white pith removed", "1 tbsp grated ginger", "1 cinnamon stick", "2 cloves", "100ml/3½fl oz vanilla vodka", "6 cardamom pods", "200ml/7fl oz port", "750ml/1pint 7fl oz red wine", "150g/5¼oz sugar", "25g/1 oz sheet gelatine, softened in cold water, drained", "12 tbsp frozen summer fruits, defrosted", "400g/14 oz fresh custard", "550ml/1 pint double cream, whipped until soft peaks form when the whisk is removed", "1 tsp vanilla extract", "handful flaked almonds, toasted, to decorate"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the orange and lemon zest, ginger, cinnamon stick, cloves, vanilla vodka, cardamom pods, port, red wine and sugar over a low heat until hot, but not boiling. Strain the mixture through a sieve onto the softened gelatine in a large bowl and stir well. ", "Spoon the soft fruit into a large glass serving bowl and pour enough of the jelly mixture to fill it a third of the way up. Chill in the fridge overnight, or until they have completely set.", "Mix half of the whipped cream with the custard and vanilla in a bowl until well combined and spoon this mixture onto the set jelly.", "To serve, spoon the remaining whipped cream onto the trifle and scatter over the flaked almonds."]}, {"isVegetarian": true, "title": "Mulligatawny soup", "url": "www_bbc_co_uk_food_recipes_mulligatawny_soup_68949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulligatawny_soup_68949_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp sunflower oil", "1 large onion, finely chopped", "2 garlic cloves, chopped", "2 medium carrots, cut into 1.5cm/ ⅝in cubes", "2 celery sticks, thinly sliced", "1 medium sweet potato, peeled, cut into 1.5cm/⅝in cubes", "1 eating apple, peeled, quartered, cut into 1.5cm/⅝in cubes ", "1 tbsp medium curry powder", "1 vegetable or chicken stock cube (low-salt is best)", "1litre/1¾ pints boiling water", "1 tbsp tomato purée", "1 tbsp mango chutney", "100g/3½oz  basmati rice", "100g/3½oz natural yoghurt or soured cream, to serve", "fresh coriander or flat-leaf parsley, to garnish (optional)", "salt and freshly ground black pepper"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the oil in a large saucepan and stir in the onion, garlic, carrots, celery and sweet potato. Cook over a medium heat for 10 minutes, stirring regularly until the vegetables are beginning to soften and brown lightly. Stir in the apple pieces and sprinkle over the curry powder. Cook for a further 2 minutes more, stirring as it cooks. ", "Crumble the stock cube into a measuring jug, and pour over the boiling water. Mix to combine. Pour into the pan, and stir in the tomato purée and mango chutney. Bring to the boil, then reduce the heat slightly and leave to simmer for 30 minutes, stirring occasionally . Cook until the vegetables are tender. ", "While the soup is simmering, half-fill a medium pan with water and bring to the boil. Add the rice and return to the boil. Cook for 10 minutes, or until the rice is tender. Drain the rice in a sieve and rinse under running water until cold. ", "When the soup is ready, cool the soup for a few minutes and blend with a stick blender or in a food processor until smooth before stirring in the cooled rice. If you want a more rustic texture to the soup, do not blend. ", "Add enough water to give a good consistency, (about 150-200ml/5½-7fl oz). Heat the soup for 3–4 minutes until piping hot and check the seasoning, add salt and freshly ground black pepper to taste.", "Ladle the soup into deep bowls and top each with a spoonful of natural yoghurt or soured cream. Garnish with sprigs of coriander or flat-leaf parsley if you like."]}, {"isVegetarian": false, "title": "Pepper and pineapple soup", "url": "www_bbc_co_uk_food_recipes_mulligatawnysoup_83986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "½ red pepper, chopped", "1 tbsp curry powder", "1 tsp turmeric", "1 chicken stock cube (vegetarians may substitute with a vegetable stock cube.)", "400ml/14fl oz water", "handful pineapple, chopped", "75ml/3fl oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and add the onion and pepper. Fry gently over a medium heat for three minutes, to soften.", "Add the curry powder and turmeric and cook for a further minute.", "Crumble in the stock cube and add the water and the pineapple. Bring to the boil and then reduce the heat and simmer gently for ten minutes.", "Add the double cream and simmer for 2-3 minutes to thicken the soup .", "Pour the soup into a serving bowl and serve immediately."]}, {"isVegetarian": true, "title": "Multi-seed savoury crackers", "url": "www_bbc_co_uk_food_recipes_multi-seed_savoury_03806", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seed_savoury_03806_16x9.jpg", "ingredients": ["230g/8oz wholemeal flour", "115g/4oz semolina", "¾ tsp fine salt (smoked or fleur de sel Guérande if available)", "55g/2oz sesame seeds", "55g/2oz flax seed", "55g/2oz pumpkin seeds – roughly ground", "1 tbsp runny honey", "3½ tbsp vegetable oil, plus extra for greasing", "ground seeds or spices of your choice (optional)"], "serves": "Makes 48", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix the wholemeal flour, semolina and salt together with the sesame, flax and ground pumpkin seeds. ", "In separate bowl, whisk 210ml/7¼fl oz water with the honey and oil.  Stir in to the dry ingredients and mix to a medium-firm dough. ", "Knead the dough for five minutes. Return to the bowl, cover and set aside for 20 minutes.", "Preheat oven to 180C/375F/Gas 4.  Line 2-3 baking trays with non-stick parchment.", "Oil the work surface and roll the dough out to a thickness of 3mm. ", "Using a ruler and a sharp knife or pizza cutter, cut the dough into rectangles or diamonds, of approximately 5x15cm/2x6in.  Place on to the prepared trays close together, but not touching. ", "Spray the crackers with water. At this point you can add a topping if you wish (more ground seeds or spices). You can reknead any left-over scraps, but they will not be as successful as first kneading. Alternatively, put the scraps on a tray and bake them for snacking. ", "Bake the crackers for 15-18 minutes. Turn the oven off, open the door for 30 seconds and close again. Leave the trays in the residual heat of the oven for 10-15 minutes for extra crispness.  Transfer to a wire rack to cool.  "]}, {"isVegetarian": true, "title": "Multi-seeded wheat-free bread", "url": "www_bbc_co_uk_food_recipes_multi-seeded_wheat-free_24145", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seeded_wheat-free_24145_16x9.jpg", "ingredients": ["450g/1lb wheat-free flour (a blend of potato flour, rice flour, tapioca flour and xanthan gum) ", "1 tsp salt", "2 tbsp caster sugar", "2 tsp fast-action yeast ", "310ml/10fl oz full-fat milk", "1 tsp cider vinegar", "6 tbsp vegetable oil, plus extra for greasing", "2 free-range eggs, plus 1 free-range egg beaten for egg wash", "4 tbsp mixed seeds, such as pumpkin, sesame and sunflower seeds, plus extra for finishing"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Grease and line a 900g/2lb loaf tin.", "Place the flour into a free-standing food mixer fixed with the balloon whisk attachment. ", "Add the salt, sugar and yeast in three separate piles.", "Mix together the milk, vinegar, oil, and two eggs in a jug.  ", "Pour the liquid into the mixing bowl and add the seeds.", "Switch on the mixer and whisk the ingredients for about 3-4 minutes.", "Put the batter into the prepared tin, cover with oiled cling film and leave to prove for about one hour, or until doubled in size.", "Preheat the oven to 180C/350F/Gas 4. Bake for about 35-45 minutes. Cover with foil after ten minutes.", "About ten minutes before the end of the cooking time, brush the loaf with egg wash (beaten egg) and sprinkle over the seeds.", "Remove from the oven, leave to cool on a wire rack."]}, {"isVegetarian": false, "title": "Mum’s everyday fish pie with cheese mash", "url": "www_bbc_co_uk_food_recipes_mums_everyday_fish_pie_43141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mums_everyday_fish_pie_43141_16x9.jpg", "ingredients": ["400ml/14fl oz whole milk", "1 small onion, thickly sliced", "2 bay leaves", "500g/1lb 2oz thick white fish fillets, preferably cod, haddock or pollock, skinned", "40g/1½oz butter", "40g/1½oz plain flour", "150g/5½oz frozen peas", "200g/7oz large raw prawns, peeled", "sea salt and freshly ground black pepper", "800g/1lb 12oz medium potatoes, peeled and cut into quarters", "40g/1½oz butter, cubed", "3 tbsp milk", "100g/3½oz mature Cheddar cheese, grated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the filling, pour the milk into a large lidded pan and add the sliced onion and bay leaves. Season with salt and black pepper.", "Place the fish fillets in the pan and bring to a very gentle simmer, cover and cook for two minutes. ", "Remove the pan from the heat and leave to stand and infuse for 20 minutes. Drain the fish through a colander into a bowl, then pour the milk into a jug.", "Meanwhile, make the mash for the topping. Half fill a large saucepan with cold water. Add the potatoes and bring to the boil. Reduce the heat and simmer for 15 minutes or until the potatoes are soft.", "Drain the potatoes and return them to the pan. Mash with the butter, milk and three-quarters of the grated cheese. Season to taste with salt and black pepper. ", "Preheat the oven to 200C/400F/Gas 6. ", "To finish the filling, melt the butter in a medium saucepan and stir in the flour. Cook for a few seconds, then gradually add the infused milk, stirring constantly, and simmer over a medium heat for 3–4 minutes until the sauce is smooth and thick. Stir in the peas and season with salt and black pepper.", "Spread one third of the sauce into the base of a 1.5 litre/2¾ pint ovenproof dish. Scatter half the fish fillets over the sauce, breaking them into chunky pieces as you go and discarding the onion and bay leaves. ", "Arrange half the prawns on top of the fish and pour over another third of the sauce. Repeat this with the remaining fish and prawns and finish with the final third of sauce on top.", "Spoon the mash over the fish mixture, spreading to the edges with a palette knife. Fork the surface and sprinkle over the remaining cheese. Place the dish on a baking tray and bake in the centre of the oven for about 25 minutes or until the top is golden-brown and the filling is bubbling."]}, {"isVegetarian": false, "title": "Murg adraki", "url": "www_bbc_co_uk_food_recipes_murg_adraki_57546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½ tbsp rapeseed oil", "1 tsp cumin seeds", "2 tsp sesame seeds", "200g/7oz ginger, thinly sliced", "1 green chilli, slit open", "salt, to taste", "1 tsp red chilli powder", "100g/3½oz palm sugar ", "100g/3½oz tamarind paste", "pinch asafoetida", "1 dried red chilli", "½ tsp mustard seeds", "5-6 curry leaves", "4 chicken breasts, skin on", "300g/10½oz chicken breast, minced", "1 spring onion, chopped", "2 tbsp ginger, finely chopped", "pinch garam masala", "salt, to taste", "1 litre/1¾ pints chicken stock", "vegetable oil, for frying", "2 tbsp rapeseed oil", "1 tsp cumin seeds", "50g/1¾oz ginger, finely chopped", "1 green chilli, slit open", "2 medium onions, finely chopped", "1 tsp red chilli powder", "2 tsp ground coriander", "1 tsp ground turmeric ", "2 medium tomatoes, chopped", "fresh ginger , julienned and crisp-fried", "Celery cress ", "Red shisho cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat two tablespoons of the oil in a frying pan, fry the cumin seeds for 1-2 minutes then add the sesame seeds, ginger and green chilli and season with a little salt.  ", "Stir for 2-3 minutes and then cover the mixture with a circle of greaseproof paper and let it cook slowly for 40-45 minutes until the ginger is almost cooked. ", "Let the mixture cool then transfer to a food processor and blend to a fine paste with the tamarind paste and palm sugar.   ", "Heat the remaining oil in a separate pan, add the asafoetida, red chilli and mustard seeds. As the mustard seeds pop, add the curry leaves, stir for 30 seconds then pour into the ginger chutney mixture and mix well. Set aside.", "Meanwhile, prepare the chicken. Place each breast of chicken on a large piece of foil and flatten them with a meat mallet.", "Mix the minced chicken breast with the spring onion, ginger, garam masala and a little salt and divide into four portions.   ", "Place one portion of mince on flattened chicken breast and roll into a roulade with the foil. Tighten the ends of foil by twisting each end.  ", "Bring the chicken stock to a simmer in a saucepan and poach the roulades for 25-30 minutes or until the chicken is completely cooked through. Remove the roulades from the stock and let cool.", "Heat a little oil in a frying pan. Remove the foil from the chicken roulades and sear them on all sides until lightly coloured and crisp.  ", "While the chicken is poaching, make the sauce. Heat the oil in a pan, gently fry the cumin seeds and ginger then add the green chilli and chopped onions.    ", "Fry until the onions are caramelised to a golden-brown then add the chilli powder, coriander and turmeric. Cook for 2-3 minutes then season with salt and add the chopped tomatoes.   ", "When the tomatoes have softened, place the mixture in a food processor and blend to a fine paste, moistened with a little stock if necessary. Set the sauce aside and keep warm. ", "To serve, cut each chicken roulade into three equal pieces.  Spoon the sauce and chutney on the plate and place three pieces of roulade on top of the sauce. Garnish with the fried ginger and cress leaves."]}, {"isVegetarian": true, "title": "Muscovado and hazelnut tart with yoghurt sorbet", "url": "www_bbc_co_uk_food_recipes_muscovadoandhazelnut_86417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz caster sugar", "120ml/4fl oz boiling water ", "500ml/18fl oz good-quality plain yoghurt", "½ lemon, juice only, strained", "150g/5½oz dark muscovado sugar, plus 1 tbsp for sprinkling", "120g/4½oz plain flour, sifted", "50g/2oz salted butter, softened", "100g/4oz hazelnuts, shells removed, toasted ", "1 large free-range egg ", "½ tsp baking powder", "150g/5½oz soured cream", "1 tbsp hazelnuts, shells removed, toasted, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the yoghurt sorbet, place the sugar and boiling water into a small pan and bring back to the boil, stirring to dissolve the sugar. Once dissolved, boil for a few seconds, then remove from the heat and leave to cool. ", "When the sugar syrup is cold, pour it into a bowl with the yoghurt and lemon juice. Taste and add a little more lemon juice if necessary. Churn in an ice cream machine according to the manufacturer's instructions for about 15 minutes, or until softly set, then transfer to a container and freeze. ", "Preheat the oven to 200C/400F/Gas 6. ", "For the tart, place the sugar (except the one tablespoon for sprinkling), flour, butter and nuts into a food processor and pulse until the mixture resembles coarse breadcrumbs. Remove half the mixture from the food processor and spread it over the bottom of a 20cm/8in round non-stick tin that is 5cm/2in deep (not loose-bottomed). Pat the mixture down gently with the back of a spoon as you would for a cheesecake base, without pressing too firmly. ", "Tip the other half of the mixture into a bowl. Crack in the egg, add the baking powder and soured cream and beat to make a smooth batter. Pour this mixture over the crumb base. Sprinkle over the reserved tablespoon of muscovado sugar. Transfer to the oven and bake for about 25 minutes, or until just firm. To check if it's done, insert a skewer into the centre - it should come out clean. Allow the tart to reach room temperature before serving.", "To serve, cut the tart into wedges and sprinkle over the chopped hazelnuts. Serve with a scoop of the yoghurt sorbet."]}]