[{"isVegetarian": true, "title": "Boiled fruit cake", "url": "www_bbc_co_uk_food_recipes_boiled_fruit_cake_18540", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb mixed fruit, raisins, sultanas, chopped nuts and walnuts", "350g/12oz sugar", "350g/12oz margarine", "1 tsp bicarbonate of soda", "250ml/9fl oz cold water", "250ml/9fl oz brandy", "240g/8½oz plain flour", "240g/8½oz self-raising flour", "4 free-range eggs, beaten", "2 tsp baking powder", "1 tsp mixed spice", "1 x 200g/7oz  tub glacé cherries, chopped"], "serves": "Makes 3 loaves", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 3. Grease and line three loaf tins.", "Place the mixed fruit and nuts, sugar, margarine, bicarbonate of soda, water and brandy in a large pan and bring to a boil.  Take the pan off the heat and allow to cool.", "When the mixture has cooled, add the remaining ingredients and mix well. Pour into the loaf tins and bake for two hours or until a skewer inserted in the middle comes out clean."]}, {"isVegetarian": false, "title": "Boiled and baked ham", "url": "www_bbc_co_uk_food_recipes_boiledandbakedham_71057", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/boiledandbakedham_71057_16x9.jpg", "ingredients": ["5½ -7¼kg/12-16lb ham with the bone in", "2 onions, quartered", "few cloves", "few black peppercorns", "1 bay leaf", "4 tbsp English mustard", "75g/2½oz demerara sugar, depending on size of ham", "300ml/½pint chicken stock (to make a gravy)"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Place the soaked ham in a large pan, with the onions, cloves, peppercorns and bay leaf. ", "Cover with water, bring to the boil and skim away any impurities. Leave the ham to simmer, allowing 20 minutes per 450g(1lb).", "Pre-heat the oven to 190C/375F/Gas 5. ", "Once cooked, remove the ham from the pan and stand for 10-15 minutes before peeling away the skin. ", "The fat can be left as it is or scored, creating a diamond pattern. Brush the ham with mustard and sprinkle well with the demerara sugar. ", "Bake the ham for 30-40 minutes taking care to baste the ham with juices and the caramelised sugar. Once golden, remove from the oven and rest for 15-30 minutes before carving, or leave until cold. ", "To make gravy, pour the chicken stock into the roasting pan to lift any residue in the pan and simmer until reduced by one-third to one-half and strain."]}, {"isVegetarian": true, "title": "Boiled lemon and artichoke salad", "url": "www_bbc_co_uk_food_recipes_boiledlemonandartich_84656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 thick-skinned lemons, preferably unwaxed", "1 tsp sea salt", "4 globe artichokes", "75g/3oz blanched almonds, split into halves", "2 tbsp finely chopped fresh thyme", "2 tbsp honey", "1 lemon, juice only", "4 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Place the whole lemons into a small saucepan, cover with water, add the salt and bring to the boil. Cover with a smaller saucepan lid turned upside down, or a heatproof saucer to keep the lemons below the surface of the water.  You may have to weigh the lid or saucer down, as the lemons will float to the surface.", "Boil the lemons for 30 minutes, or until the lemons are soft and the skin can be pierced easily with a fork, then drain and set aside to cool.", "Cook the artichokes in a separate pan of salted boiling water for 20 minutes, or until soft at the centre, then drain and set aside to cool.", "Peel away the tough outer leaves of the artichokes and cut across the top to remove the upper, inedible section of the leaves and reveal the heart. Trim the stalks if they are stringy, and remove the choke (the furry yellow matter in the centre of the artichoke) if there is one. Cut the artichokes into quarters, then place in a bowl and season with salt and freshly ground black pepper.", "Cut the boiled lemons in half, then scoop out and discard the soft inner pulp and other stringy pith. Tear the skins of each half into 2-3 pieces and add to the artichokes.", "Heat a small frying pan over a medium heat. Add the almonds and toast them, tossing over occasionally, to brown all over. ", "Add the toasted almonds and thyme leaves to the artichoke and lemon mixture.", "Mix the honey with the lemon juice in a clean bowl and add the olive oil. Season, to taste, with salt and freshly ground black pepper, then pour the dressing over the artichokes and lemons. Mix together well and serve."]}, {"isVegetarian": false, "title": "Bolognese ragù with pappardelle", "url": "www_bbc_co_uk_food_recipes_bolognaise_ragu_with_66037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognaise_ragu_with_66037_16x9.jpg", "ingredients": ["2 tbsp olive oil ", "2 onions, finely chopped", "1 large carrot, finely chopped", "2 sticks celery, finely chopped", "500g/1lb 2oz lean minced pork", "500g/1lb 2oz minced beef ", "3 garlic cloves, crushed ", "3 tbsp sun-dried tomato paste ", "150ml/5fl oz white wine ", "500g/1lb 2oz passata ", "400g tin chopped tomatoes ", "200ml/7fl oz beef stock ", "3 bay leaves ", "2 tbsp chopped thyme leaves ", "4 tbsp double cream ", "salt and freshly ground black pepper", "450g/1lb pappardelle pasta, to serve", "Parmesan, to serve ", "basil leaves, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Heat the oil in a deep, lidded ovenproof casserole. Add the onion, carrot and celery and fry over a high heat for 5–6 minutes, or until starting to soften. Add the pork and beef mince and fry until browned and any excess liquid has evaporated. Add the garlic and fry for 30 seconds. ", "Add the tomato paste and stir. Add the passata, tomatoes, stock, herbs and wine. Season with salt and pepper and bring to the boil, cover and bake for about an hour.", "Stir in the cream, and return to the oven, with the lid off, for another hour, until tender and reduced. ", "Bring a pot of salted water to the boil, add the pasta and cook according to packet instructions. Drain and check the seasoning.  ", "Divide the pasta between plates, top with the sauce, grate over some Parmesan, garnish with basil leaves and serve."]}, {"isVegetarian": true, "title": "Boiled duck egg and soldiers", "url": "www_bbc_co_uk_food_recipes_boiledduckeggandsold_88787", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range duck eggs", "3 slices white bread, toasted", "butter, to serve"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully place the duck eggs into a pan of boiling water and cook for 6-7 minutes. Remove from the pan and place in an egg cup.", "Butter the toast and cut into soldiers to serve with the eggs."]}, {"isVegetarian": false, "title": "Bolognese sausage ragù with tagliatelle", "url": "www_bbc_co_uk_food_recipes_bolognese_sausage_rag_01151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognese_sausage_rag_01151_16x9.jpg", "ingredients": ["400g/14oz 00 pasta flour", "4 free-range eggs, lightly beaten", "2 tsp salt", "400g/14oz good quality coarse pork sausage meat", "1 tbsp olive oil", "1 small onion, finely chopped", "2 sticks celery, chopped", "¾ tsp fennel seeds, roughly ground in a pestle and mortar", "1 sprig of fresh rosemary, leaves finely chopped", "¼ tsp chilli flakes", "1 large garlic clove, grated", "150ml/5fl oz dry white wine", "150ml/5fl oz double cream", "150ml/5fl oz chicken stock", "50g/1¾oz Parmesan cheese, freshly grated", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta, in a food processor, combine the flour, eggs and salt, then tip onto a work surface and bring together in a ball of dough, cover in cling film and rest for 20-30 minutes.   ", "Ideally with a pasta machine or a rolling pin, roll out the pasta into a couple of thin sheets (about 2mm thick). Run through a pasta machine to make tagliatelle, or using a knife or pizza cutter, cut into 5mm wide ribbons. Separate the strands and leave to dry on the back of a chair or spread out on a tray. ", "Break up the sausage meat into a large lidded pan with a little olive oil, depending on how fatty the sausage meat is, as it may render quite a bit of fat.  Cook on a medium heat for around 10 minutes stirring from time to time. Add the onion, celery, fennel seeds, rosemary, chilli and garlic then cook for a further 15 minutes.  Pour in the wine and cook until reduced in volume by half, then add the cream and chicken stock. Season with salt and pepper then put a lid on the pan and simmer gently for half an hour.", "When ready to serve, cook the tagliatelle in plenty of salted water for about 4 minutes until al dente, drain and add to the ragù pan and mix in. Serve in warmed bowls with freshly grated Parmesan."]}, {"isVegetarian": false, "title": "Boiled collar of bacon with vegetables and dumplings", "url": "www_bbc_co_uk_food_recipes_boiledcollarofbaconw_90922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.4kg/3lb 1oz collar of bacon, skin on, soaked in cold water overnight in the fridge or in a cool place", "1 fresh bay leaf", "10 black peppercorns", "2 cloves", "1 stick cinnamon", "1 large onion, peeled", "600ml/1 pint 2fl oz good cider", "25g/1oz unsalted butter", "4 large garlic cloves, peeled", "8 small shallots, peeled but with root end intact", "10 white peppercorns", "4 medium carrots, sliced on the diagonal to 5mm/¼in thick", "3 sticks celery, sliced on the diagonal to 5mm/¼in thick", "90g/3½oz self-raising flour", "pinch salt", "1 tsp English mustard powder ", "45g/1½oz shredded suet", "1 tbsp chopped fresh parsley", "freshly ground black pepper, to taste", "English mustard, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To boil the bacon, remove the bacon joint from the soaking water and put it into a large, deep, lidded saucepan. Add the rest of the ingredients for boiling the bacon.", "Pour in enough cold water to cover the joint by 2.5cm/1in. Cover with a lid, place over a high heat and bring to the boil. Reduce the heat to a simmer and cook, covered, for one hour. ", "Test to see if the meat is tender by piercing it with a blunt table knife. If's difficult to insert the blade, then continue cooking for another 20 minutes and test again. When the meat is tender, remove the pan from the heat and set aside.", "To stew the bacon, preheat the oven to 190C/375F/Gas 5. Place a large lidded ovenproof casserole on the stove and heat until hot. Add the butter, then add the garlic, shallots and peppercorns and fry for one minute.", "Add the carrots and celery and fry gently for about five minutes until lightly coloured. Remove the bacon collar from the liquid the meat was boiled in. ", "Cut and lift off the bacon skin with a sharp knife - it should come off in a single piece. Put the skinned bacon joint on top of the vegetables in the casserole. Add enough of the poaching liquid to cover the vegetables by 2.5cm/1in (you may need to top up with water if there is not enough).", "Cover with the lid and place in the oven for 15 minutes.", "Meanwhile, for the dumplings, sieve the flour, salt and mustard powder into a bowl. Stir in the suet, chopped parsley and freshly ground black pepper, to taste.", "Add enough cold water to make a stiff dough that doesn't cling to the sides of the bowl. Using your hands, divide the mixture into large walnut-sized pieces and roll into neat balls in the palms of your hand.", "Add the rolled dumplings to the casserole, around the joint, and place the casserole back into the oven to cook for a further 25-30 minutes. When done the dumplings should be cooked through, puffed and light. The meat will be tender and unctuous, the vegetables will have collapsed a little and the cooking liquid will have thickened. ", "To serve, carefully lift the meat from the casserole onto a board and cut into generous slices. Divide the vegetables equally among four plates, top with slices of the meat, surround with a few dumplings and spoon over the thickened juices. Serve with English mustard."]}, {"isVegetarian": false, "title": "Bologna sum up salad", "url": "www_bbc_co_uk_food_recipes_bologna_sum_up_salad_16484", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz mix of bitter leaves, such as at least three of these: cime de rape, puntarelle, radicchio, chicory and curly endive ", "100g/3½oz rocket ", "6 ripe figs, quartered or 2 ripe white peaches, stone removed and sliced", "10 slices prosciutto, torn into pieces", "50g/1¾oz Parmesan shavings", "90g/3¼oz gorgonzola  ", "500g/1lb 2oz flavourful ripe tomatoes, core removed, cut into wedges ", "1 tbsp capers, drained", "40g/1½oz toasted pine nuts", "handful basil leaves", "60ml/2fl oz olive oil", "30ml/1fl oz sweet, aged balsamic vinegar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the leaves and rocket in a large serving bowl. Top with chunks of fig or white peach, torn pieces of ham, shavings of Parmesan, chunks of gorgonzola and tomato wedges. ", "Sprinkle on the capers, basil leaves and pine nuts. Drizzle with olive oil and balsamic vinegar before tossing well and serving."]}, {"isVegetarian": false, "title": "Bolognese ragù with tagliatelle", "url": "www_bbc_co_uk_food_recipes_bologneseraguwithtag_93392", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz pancetta, chopped", "1kg/2lb 2oz beef mince", "3 tbsp olive oil", "25g/1oz butter", "1 onion, roughly chopped", "2 carrots, peeled, finely chopped", "2 celery sticks, finely chopped", "150ml/5fl oz milk", "4 tbsp tomato purée", "175ml/6fl oz red wine", "750ml/1pint 7fl oz beef stock", "salt and freshly ground black pepper", "500g/1lb 2oz tagliatelle, cooked according to packet instructions, drained", "150g/5oz parmesan, freshly grated"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large non-reactive casserole pan until hot, add the pancetta and fry for 3-4 minutes, or until the pancetta softens and the fat starts to melt. Add the mince in small batches and fry over a high heat until browned. Remove each batch of mince from the pan with a slotted spoon, set aside and keep warm while you fry the remaining batches.", "Add the olive oil and butter to the pan in which you cooked the beef, then add the onion and fry gently for 1-2 minutes, or until softened. Add the carrots and celery to the pan and cook for another minute. ", "Stir in the browned mince, then add the milk and bring to the boil.  Reduce the heat and simmer for 5 minutes. ", "Stir in the tomato purée and cook for a further minute. Add the red wine and simmer until the volume of the liquid has reduced by one quarter. ", "Add the beef stock and return the ragu to the boil. Season, to taste, with salt and freshly ground black pepper. Reduce the heat and simmer for 1½-2 hours, or until the ragù has thickened and the mince is tender. ", "Mix the tagliatelle with a little of the ragù.", "To serve, pile the tagliatelle onto each of four plates then top each serving with another generous spoonful of ragù. Sprinkle with some freshly grated parmesan."]}, {"isVegetarian": false, "title": "Bolognese with tagliatelle", "url": "www_bbc_co_uk_food_recipes_bolognese_with_21188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz 00 flour", "3-4 medium free-range eggs (preferably with bright yellow yolks)", "250g/9oz fine semolina flour", "4 tbsp olive oil", "150g/5½oz pancetta, diced", "225g/8oz beef mince", "225g/8oz pork mince", "2 x 400g tins chopped tomatoes", "4 garlic cloves, chopped", "2 tbsp fresh basil, torn (optional)", "sea salt and freshly ground black pepper", "100g/3½oz Parmesan cheese, grated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour and eggs into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough in a bowl, cover with cling film and place in the fridge to rest for 30 minutes.", "Cut the pasta dough in half and pass it through a pasta machine at its widest setting. Repeat this process, decreasing the roller setting down grade by grade with each pass until the dough is thin enough to pass through your tagliatelle cutter. Add your cutter to the pasta machine and pass the pasta through the machine to make your shape. Dust the pasta with a little semolina. ", "Repeat the process with the remaining dough, then place the shapes onto a plate and use immediately or refrigerate overnight.", "For the bolognese, heat a large frying pan and add the oil. Once hot, add the pancetta and cook until golden-brown and crisp. Add the two types of mince and cook until brown all over, this will take 6-8 minutes.", "Add the tinned tomatoes and garlic and cook for 25-40 minutes, or until you have a thick reduced sauce. Season with salt and pepper and stir in the basil. Keep warm until ready to serve.", "For the pasta, cook the pasta in a large pan of salted boiling water until al dente (about 3-4 minutes). Drain, reserving a little pasta water, and add the bolognese. Mix together with a little pasta water.", "To serve, place some of the pasta and bolognese in serving bowls. Garnish with freshly grated Parmesan cheese."]}, {"isVegetarian": false, "title": "Bolognaise sauce", "url": "www_bbc_co_uk_food_recipes_bolognesesauce_1306", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognesesauce_1306_16x9.jpg", "ingredients": ["225g/8oz minced beef", "2 tbsp olive oil", "1 onion, peeled and finely chopped", "1 carrot, peeled and finely diced", "1 green pepper, seeded and finely diced", "1 clove garlic, peeled and crushed", "125g/4oz smoked bacon lardons", "1 tbsp mixed dried herbs", "400g/14oz tinned tomatoes", "150ml/5fl oz red wine", "salt and pepper"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a non-stick frying pan and add half the mince. Cook over a high heat to colour the meat, breaking up any lumps with the back of a fork. Repeat with the rest of the mince and drain off any fat.", "Heat the oil in another large pan and cook the onion, carrot and green pepper until they start to soften.", "Stir in the garlic, bacon lardons and the herbs and cook for 2 minutes. ", "Stir in the tomatoes and the wine and season well.", "Add the mince and simmer gently for 40-50 minutes until thick. Use to make lasagne or serve with pasta."]}, {"isVegetarian": false, "title": "Bolognese with parmesan crisps", "url": "www_bbc_co_uk_food_recipes_bolognesewithparmesa_89968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb lamb shoulder, bone removed, cut into cubes", "2 tbsp vegetable oil", "1 onion, finely chopped", "1 red pepper, finely chopped", "1 green pepper, finely chopped", "2 garlic cloves, finely chopped", "1 tsp fresh thyme leaves", "1 tsp chopped fresh parsley leaves", "1 tsp dried oregano", "150g/5oz button mushrooms, sliced", "200g/7oz tomato purée", "2 bay leaves", "100ml/3½fl oz rich red wine", "400g/14oz can chopped tomatoes", "salt and freshly ground black pepper", "250g/9oz ready-rolled puff pastry", "1 free-range egg, beaten", "225g/8oz parmesan, finely grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan over a medium heat, then add the lamb and fry, stirring occasionally, until golden-brown all over. Remove from the pan and set aside.", "Add the onion, red and green peppers, garlic, herbs and mushrooms to the same pan and fry until the vegetables are softened and starting to colour.", "Add the tomato purée and bay leaves and cook for 7-8 minutes.", "Add the wine and canned tomatoes and bring to the boil.", "Return the lamb to the pan, then reduce the heat and simmer for 40 minutes to one hour, until the lamb is tender.", "Season, to taste, with salt and freshly ground black pepper.", "Divide the Bolognese mixture among six individual pie dishes or ramekins.", "Cut out six circles of pastry to cover the top of each pie, then place on top of each pie."]}, {"isVegetarian": true, "title": "Bombay potato", "url": "www_bbc_co_uk_food_recipes_bombaypotato_76547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "1 tsp mustard seeds", "½ tsp ground cumin", "1 tsp turmeric", "1 tsp ground coriander", "1 tsp garam masala", "1 tsp chili powder", "5cm/2in piece fresh ginger, grated", "1kg/2lb 3oz potatoes, peeled, and cut into smallish cubes", "350ml/12fl oz vegetable stock", "4 tomatoes, roughly chopped", "1 bunch coriander, roughly chopped"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until hot and add the oil.", "Add all the spices and the ginger and stir-fry for one minute until fragrant. ", "Add the potatoes and stir to coat in the spices. ", "Add the stock and bring to a gentle simmer. Simmer for 10-15 minutes until the potatoes are tender.", "Stir in the tomatoes and coriander.", "Season with salt and freshly ground black pepper and serve."]}, {"isVegetarian": true, "title": "Bombay potato cakes with coriander and mint", "url": "www_bbc_co_uk_food_recipes_bombaypotatocakeswit_92717", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz vegetable oil", "450g/1lb raw potatoes, peeled, cut into cubes", "1 tbsp coriander seeds, toasted in a dry frying pan, crushed to a powder", "1 tbsp cumin seeds, toasted in a dry frying pan, crushed to a powder", "1 tbsp garam masala", "1 tsp ground ginger", "2 garlic cloves, peeled, crushed to a paste with the edge of a knife", "3 red chillies, finely chopped ", "salt and freshly ground black pepper", "200g/7oz boiled potatoes, mashed until smooth", "100g/3½oz plain flour", "small bunch fresh coriander", "small bunch fresh mint leaves", "1 tsp sea salt", "75ml/2¾fl oz white wine vinegar", "200ml/7fl oz plain yoghurt"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "For the potato cakes, heat half of the oil in a casserole in the oven. When the oil is smoking, add the raw potato cubes and turn them until coated in the oil on all sides. ", "Stir in the spices, garlic and chilli to coat the potatoes, then season, to taste, with salt and freshly ground black pepper.", "Roast the potatoes in the oven for 20-25 minutes, or until crisp and golden-brown but tender inside. Remove the potatoes from the casserole using a slotted spoon and set aside on kitchen paper to drain and cool slightly, then mix into the mashed potatoes. ", "Shape the mashed potato mixture into twenty to twenty-four 5cm/2in patties, using your hands.", "Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Roll each patty in the seasoned flour.", "Heat the remaining oil in a frying pan over a medium heat. Add the patties, in batches, and fry in the oil for 2-3 minutes on each side, or until crisp and golden-brown on both sides and heated through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining patties.", "Meanwhile, for the sauce, blend the herbs, salt and vinegar in a food processor until well combined. Stir in the yoghurt.", "To serve, divide the Bombay potato cakes equally among six to eight serving plates. Place dipping bowls of the sauce alongside each."]}, {"isVegetarian": true, "title": "Bombay-style potatoes with lemon and yoghurt", "url": "www_bbc_co_uk_food_recipes_bombaystylepotatoesw_85694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ coriander seeds", "¼ tsp medium curry powder", "¼ tsp ground turmeric", "1 garlic clove, chopped", "1 large potato, peeled and cut into cubes", "1 tbsp tomato purée", "½ lemon, cut into wedges", "2 tomatoes, chopped", "handful fresh coriander, chopped", "1 tbsp Greek-style yoghurt", "olive oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a medium saucepan, add the spices and garlic and fry for 1-2 minutes to release the flavour of the spices.", "Add the potato pieces, cover with a lid and cook for five minutes, stirring occasionally.", "Add the tomato purée, lemon wedges and tomatoes and cook for ten minutes, or until the potatoes are tender. Add the coriander and stir well.", "To serve, place the potatoes into a serving bowl and top with a dollop of Greek-style yoghurt and a drizzle of olive oil."]}, {"isVegetarian": true, "title": "Bombay potatoes", "url": "www_bbc_co_uk_food_recipes_bombaypotatoes_1406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bombaypotatoes_1406_16x9.jpg", "ingredients": ["4 tbsp oil", "¼ tsp mustard seeds", "2 pinches of chilli powder", "¼ tsp turmeric powder", "350g/12oz potatoes, boiled and quartered", "salt to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan on a medium heat setting. ", "To check that the oil is hot enough, sprinkle in a few mustard seeds, if they pop the oil is ready. Then add the remainder of the mustard seeds. ", "Add the chilli and turmeric powders to the sizzling seeds, and salt to taste. ", "Fry this pungent mixture of oil and spices for 1 minute then add the potatoes. Fry for about 4 minutes until the potatoes are smothered in seeds and appear to have crispy edges. They will look quite yellow in colour. Cover the pan and on a low heat, cook the potatoes for a further 5 minutes. ", "Serve immediately."]}, {"isVegetarian": false, "title": "Bone marrow with sirloin steak, bordelaise sauce and sautéed sprouts with chestnuts", "url": "www_bbc_co_uk_food_recipes_bone_marrow_with_sirloin_04518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp olive oil", "4 shallots, halved and skin left on", "5 x 2.5cm/1in cut bone marrow, cleaned", "4 sirloin steaks", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "2 sprigs thyme, leaves picked", "1 bay leaf", "5 black peppercorns", "200ml/7fl oz red wine", "300ml/10fl oz veal or beef stock, warmed", "pinch sugar", "50g/1¾oz unsalted butter", "250g/9oz Brussels sprouts, thinly sliced", "70g/2½oz cooked chestnuts, chopped", "2 tbsp chopped fresh flat-leaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Heat 4 tablespoons of oil in a frying pan, add the shallots and fry until golden. Transfer to a roasting tray  and roast for 15-20 minutes.", "Add the bone marrow to the roasting tray and return to the oven for 6 minutes, or until the marrow is just cooked, loose but not completely melted. Leave to rest in a warm place. ", "Heat the remaining oil in the frying pan. Add the steaks and cook each side for 2-3 minutes, depending on the thickness of the steak and how you like it cooked. Leave to rest.", "For the bordelaise sauce, melt the butter in a saucepan over a medium heat. Add the shallot and cook for 2-3 minutes. Add the thyme, bay leaf and peppercorns and cook for 3 minutes.", "Add the wine and cook until the volume of liquid has reduced by half. Pour in the stock and reduce by half again. Season with a little sugar, to taste. Add the bone marrow from one of the roasted pieces, whisk and set aside. Keep warm. ", "For the saute sprouts, heat a sauté pan. Add the sprouts and cook for 1-2 minutes. Add the chestnuts and parsley and cook for a further 2 minutes.", "Serve the steak with the roasted shallots and bone marrow and the sprouts, with the sauce poured over. "]}, {"isVegetarian": false, "title": "Boneless chicken curry with rice", "url": "www_bbc_co_uk_food_recipes_boneless_chicken_curry_62956", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp vegetable oil", "3 onions, finely chopped ", "1 garlic clove, thinly sliced", "5cm/2in fresh root ginger, thinly sliced", "1 tomato, roughly chopped ", "1½ tsp dried red chilli flakes", "1½ tsp ground turmeric", "1½ tsp garam masala", "1½ tsp ground ginger", "1½ tsp garlic powder", "1½ tsp ground cumin", "1½ tsp ground coriander", "1½ tsp dried methi leaves ", "4 chicken breasts (about 125g/4oz each), cut into small cubes ", "2 green chillies ", "1 tbsp chopped fresh coriander", "salt and freshly ground black pepper", "400g/14oz long-grain rice, rinsed and soaked for 20 minutes", "1 tbsp butter", "300g/10½oz plain yoghurt ", "1 tsp cumin seeds", "½ cucumber, peeled and grated "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a little oil in a heavy-bottomed saucepan over a medium heat and fry the onions until brown. Add more oil if needed, then add the garlic, ginger and tomato and stir. Add the spices and season with salt before adding a splash of water. Cover with a lid and cook for 20 minutes.  ", "Take the pan off the heat and whisk with a hand blender to make a smooth paste. ", "Stir in the chicken. Pierce the chillies and add these, too. If the sauce needs loosening, add a little more water. Return to the heat and cook for 15–20 minutes. ", "Meanwhile, bring a large saucepan of water to the boil. Drain the rice, add to the pan and cook for 5 minutes. Drain off any water and return the rice to the heat. Add the butter, cover with a lid and steam the rice on a low heat for 5 minutes. ", "Meanwhile, to make the raita, whisk the yoghurt with a fork to make a smooth paste. Dry-fry the cumin seeds over a low heat until toasted and fragrant.  Add to the yoghurt with the cucumber and season to taste. ", "Garnish the chicken curry with coriander before serving with the rice and raita. "]}, {"isVegetarian": true, "title": "Bonfire toffee", "url": "www_bbc_co_uk_food_recipes_bonfire_toffee_21396", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bonfire_toffee_21396_16x9.jpg", "ingredients": ["75g/3oz golden syrup", "75g/3oz black treacle", "150g/6oz light soft brown sugar", "75g/3oz butter", "¼ tsp cream of tartar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 15 x 20cm/6 x 8in baking tray with non-stick baking parchment.", "Measure all the ingredients into a deep, heavy-based saucepan. Place over a medium heat and stir occasionally until the butter is melted and the sugar has dissolved.", "When the mixture is smooth and well-combined, increase the heat and bring the mixture to a fast boil.  When the mixture reaches 140C/285F, pour carefully into the lined tray. ", "If you want even pieces, wait until the toffee is cool enough to handle, but elastic enough so that a finger pressed in the top leaves a slight indent (about 15-20 minutes depending on the room temperature). Partially cut the toffee into even pieces with an oiled knife. When it has cooled completely, break along these lines. Alternatively let the toffee cool completely, then break into shards with a toffee hammer or rolling pin.", "Store in an airtight container, with individual layers of toffee separated by baking parchment. If left exposed to humidity, the toffee will soften and stick together."]}, {"isVegetarian": true, "title": "Bonfire night brioche", "url": "www_bbc_co_uk_food_recipes_bonfire_night_brioche_07518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90ml/6 tbsp full-fat milk", "7g sachet fast action yeast ", "4 free-range eggs", "3 tbsp golden caster sugar, plus extra for dusting", "2 tsp vanilla paste", "400g/14oz strong white bread flour, plus extra for dusting", "10g/¼oz salt", "½ tsp ground nutmeg", "2 tbsp ground cinnamon", "150g/5½oz butter, softened, plus extra for greasing", "1 free-range egg, yolk only", "2 tbsp milk, to glaze", "200g/7oz caster sugar", "75ml/2½fl oz double cream", "1 tsp vanilla paste", "pinch cream of tartar", "50g/1¾oz salted butter", "75ml/2½fl oz full-fat milk", "30g/1oz unsalted butter", "2 tsp vanilla paste", "225g/8oz caster sugar", "pinch salt", "125g/4½oz unsalted butter, softened", "125g/4½oz full fat cream cheese", "275g/9¾oz icing sugar"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the brioche, heat the milk to 37C/99F, pour it into a measuring jug and add the sachet of yeast. Cover with cling film and set aside for 10 minutes. ", "Beat the eggs and add the sugar and vanilla paste. Sieve the flour into a large bowl and add the salt and nutmeg. Make a well in the flour and pour in the milk mixture. Use your hands to bring the dough together - it will be very sticky and wet. Attach a dough hook to a freestanding mixer, add the dough and begin to knead. ", "In a separate bowl beat the cinnamon into the butter until combined, then add to the dough mix as it is being kneaded. When all the butter has been incorporated into the dough, flour the work surface and knead the dough by hand until it is smooth, soft and elastic. Transfer to an oiled bowl, cover with cling film and refrigerate overnight.", "For the butterscotch, put a pan over a medium heat. Add the sugar, cream, vanilla, cream of tartar and 75ml/2½fl oz water. Stir and cook the butterscotch until it reaches 114C (use a sugar thermometer for this), add the butter and keep checking the temperature. When the syrup reaches 143C pour it into the prepared tin and set aside to cool and harden.", "For the fudge, grease and line a second small tin. In a pan set over a medium heat combine the milk, butter, vanilla, sugar and salt. Stir until the sugar dissolves. Cover with a tightly fitting lid and cook for a further two minutes. Remove the lid and continue to cook at a rolling boil for 10 minutes until it reaches 114C (use a sugar thermometer), then transfer the pan to a bowl filled with cold water. Leave the pan in a cool place until it is lukewarm (or 43C) - do not stir. When the fudge has cooled, use a wooden spoon to beat it until it is thick, smooth and creamy. Pour into the prepared tin and set aside in a cool place to harden.", "For the cream cheese frosting, whisk the butter and cream cheese until smooth and light. Stir in the icing sugar until incorporated, then briefly whisk again until light and smooth (take care not to over whisk the frosting as it will become runny). Set aside until ready to serve.", "Preheat the oven to 200C/400F/Gas 6 and grease and line a small square baking tin. When the butterscotch and fudge have hardened break them into small pieces.", "Remove the dough from the fridge, knead the fudge and butterscotch pieces into the dough, and divide into 12 equally-sized balls.", "Grease a 30cm/12in high-sided round baking tin with butter and dust with sugar. Place the dough balls in neatly and set aside for two hours to rise. When the brioche has risen, mix together the egg yolk and milk and brush over the loaf gently with a pastry brush.", "Put the brioche in the preheated oven for five minutes, then reduce the temperature to 180C/350F/Gas 4 and bake for a further 25 minutes, or until it is golden-brown and sounds hollow when tapped underneath. Transfer to a cooling rack.", "When the loaf is cool, remove from the tin and spread the cream cheese icing on the top of each bun. Allow the icing to set a little before serving."]}, {"isVegetarian": false, "title": "Christmas cake wreath", "url": "www_bbc_co_uk_food_recipes_boozy_christmas_cake_80904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz chopped dried apricots", "175g/6oz sultanas", "150g/5½oz raisins", "100g/3½oz glacé cherries, washed, dried and halved", "75g/3oz stem ginger, chopped ", "125ml/4fl oz single malt whisky, plus extra for feeding", "1 orange, zest and juice", "175g/6oz soft dark brown sugar", "175g/6oz butter, softened, plus extra for greasing", "3 free-range eggs", "175g/6oz plain flour", "1 tsp ground mixed spice", "1 tsp ground ginger", "200g/7oz icing sugar", "1 free-range egg white", "1 tbsp glycerine", "150g/5½oz mixed whole glacé fruit, such as dates, cherries and oranges, halved or sliced, to decorate"], "serves": "Makes 1 x 20cm/8in Christmas cake", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, place the apricots, sultanas, raisins, cherries and stem ginger into a bowl and pour over 100ml/3½fl oz of the whisky. Stir in the orange zest and juice to combine, then cover and set aside overnight until the fruit has absorbed all of the liquid.", "When the fruit has soaked, preheat the oven to 140C/120C Fan/Gas 1. Grease the inside of a 20cm/8in non-stick savarin cake tin with butter. Fold a large sheet of baking paper into a strip that is 3 layers thick and big enough to wrap around the outside of the tin making a high 'collar' (this will help the cake bake evenly and prevent it over-browning as it bakes). Secure the collar with string.", "Beat the sugar and butter in a free-standing food mixer or large bowl for at least 3-4 minutes, or until it has turned a light caramel colour and is fluffy. Crack in the eggs one at a time, beating well after each addition. ", "Fold in the flour, mixed spice, ground ginger and the soaked fruit until completely combined. Spoon the cake mixture into the prepared tin and smooth the top using a palette knife. ", "Bake the cake for 1½ hours, or until a skewer inserted into the centre comes out clean (if it does not, cook the cake for a further 10 minutes and check once more). ", "Remove the cake from the oven and drizzle with the remaining whisky. Set aside to cool in the tin for 15 minutes, then turn out onto a wire rack (see tip about feeding the cake).", "For the icing, in a free-standing food mixer, whisk together the icing sugar, egg white and glycerine until thick enough to hold its shape – this will take 3-4 minutes. ", "When the cake is cold, dollop the icing on top and spread all over the cake using a palette knife. Decorate with the glacé fruit."]}, {"isVegetarian": false, "title": "Boozy Trinity cream with langues de chat biscuits", "url": "www_bbc_co_uk_food_recipes_boozy_trinity_cream_with_54240", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["soft butter, for greasing", "500ml/18fl oz double cream", "150g/5½oz white chocolate, broken into squares", "6 large free-range egg yolks", "150ml/5fl oz Irish cream liqueur", "75g/2½oz caster sugar", "150g/5½oz caster sugar", "oil, for greasing", "100g/3½oz softened butter", "100g/3½oz icing sugar", "½ tsp vanilla extract", "½ tsp ground cinnamon ", "½ orange, grated zest", "2 large free-range egg whites", "120g/5oz plain flour"], "serves": "Serves 6 (makes 36 biscuits)", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Butter the inside of a two-litre pudding basin. ", "Put the cream and chocolate in a medium non-stick saucepan and heat very gently, stirring regularly until the chocolate melts. Remove from the heat. ", "Place the egg yolks, Irish cream liqueur and sugar in a large bowl and whisk until pale. ", "Slowly pour the warm cream and chocolate mixture onto the eggs, stirring vigorously until thoroughly combined. Carefully pour the mixture into the buttered pudding dish and place in a large roasting tin.", "Boil a kettle of water and carefully pour the just-boiled water into the roasting tin so it rises roughly 3cm/1¼in up the side of the dish. Take care that you don’t drip any water on the cream mixture.", "Open the oven door, and using an oven-cloth to hold as the tin will be hot, place the pudding in the centre of the oven. Bake for 40-45 minutes. The custard is ready when it is almost set. If you move the dish, you should see the custard wobble like a jelly with a slight ripple under the surface. It will continue to firm up as it cools.", "Take the roasting tin out of the oven, lift the pudding dish carefully from the water and set aside to cool for about an hour. Cover with cling film and chill in the fridge overnight.", "Up to five hours before serving, make the caramel. Put the sugar and four tablespoons of cold water into a small saucepan and place over a medium heat for about a minute, stirring with a wooden spoon until the sugar dissolves.", "Increase the heat a little and cook the sugar, without stirring,  for 5-7 minutes, or until it turns golden-brown – the same colour as maple syrup.  Uncover the custard and have close to hand ready for the caramel topping.", "As soon as the caramel is ready, remove the pan from the heat. Do not touch or taste the caramel as it will be extremely hot. The caramel will continue to cook once it has been removed from the heat, so don’t allow it to become any darker before you take it off.", "Brush a large metal serving spoon with oil and slowly pour the caramel over the spoon onto the cooled custard, ensuring it is covered as evenly as possible. Don’t pour into one area only or the hot caramel will begin to melt the cream. Tilt the dish to help it run to the edges if necessary. Leave to cool for 15 minutes before serving or keep covered in the fridge. (The caramel will begin to soften after a couple of hours.)", "For the langues de chat biscuits, pre-heat the oven to 200C/400F/Gas 6 and line two baking trays with parchment paper.", "Using an electric whisk, cream the butter and icing sugar together until light and fluffy. Beat in the vanilla extract, cinnamon and orange zest. Whisk in the egg whites one at a time and then fold in the flour.", "Using a piping bag fitted with a plain 1cm/½in nozzle, pipe 6cm/2½in strips of the mixture onto the lined baking trays.", "Bake for 6-8 minutes until the edges are slightly golden-brown. Leave to cool on the tray. ", "Serve the caramel-topped Trinity cream with the langue de chat biscuits alongside."]}, {"isVegetarian": true, "title": "Boreks", "url": "www_bbc_co_uk_food_recipes_boreks_75041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz feta, crumbled", "freshly ground black pepper", "1 heaped tsp raisins or sultanas", "20g/¾oz fresh flatleaf parsley, leaves only, chopped", "plain flour, for dusting", "4 sheets filo pastry", "50g/2oz butter, melted ", "mixed salad, to serve (optional)"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, season the feta, to taste, with the black pepper. Stir in the raisins or sultanas and the parsley. Set aside.", "Lightly dust a work surface with flour. Lay out one sheet of filo pastry and brush with a little melted butter. Fold the pastry sheet in half lengthways. ", "Place two or three heaped teaspoons of the filling mixture in the bottom left-hand corner of the pastry rectangle. Fold the filled corner of the pastry up towards the top of the rectangle to form a triangle, brushing the folded pastry with melted butter as you go.", "Fold the top left-hand corner of the pastry across and over, to wrap the triangular parcel with more of the pastry. Keep folding the pastry parcel over itself, brushing with melted butter each time, until the parcel resembles a samosa. ", "Repeat the process with the remaining three sheets of filo and the remaining filling mixture.", "Place all four boreks onto a baking tray, with the last flap of pastry at the bottom. Bake in the oven for 18-20 minutes, or until the pastry is crisp and golden-brown. Serve with a mixed salad."]}, {"isVegetarian": false, "title": "Borscht", "url": "www_bbc_co_uk_food_recipes_borscht_18028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "15g/½oz butter", "1 large carrot, diced", "1 celery stick, diced", "1 onion, finely chopped", "3 medium sized beetroots (around 450g/1lb unpeeled weight), peeled and diced", "1 large waxy potato, diced", "2 garlic cloves, finely chopped", "1½ litres/2½ pints good quality beef stock", "½ purple cabbage, finely shredded", "2 tomatoes, skinned, cored and chopped", "salt and freshly ground black pepper", "sour cream ", "1 tbsp finely chopped dill"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil and butter in a large, heavy-bottomed saucepan. Once melted add the carrot, celery and onion and cook gently for a few minutes. Add the beetroot, potato and garlic. Fry for a couple of minutes, until well coated and combined. ", "Add the stock and season with salt and black pepper. Bring to just below the boil and then simmer for 15 minutes.", "Add the cabbage and tomatoes. Cover and leave to simmer for a further 20 minutes. ", "Serve the soup with dollops of sour cream and a sprinkling of dill."]}, {"isVegetarian": true, "title": "Borlotti and rosemary ragù with leeks and garlic crumbs", "url": "www_bbc_co_uk_food_recipes_borlotti_and_rosemary_16332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "500g/1lb 2oz leeks, trimmed, washed and sliced ", "salt and freshly ground black pepper ", "2 x 400g/14oz tins borlotti beans, drained and rinsed ", "2 sprigs rosemary ", "500ml/18fl oz vegetable or chicken stock (made from a cube) ", "200g/7oz sliced bread (stale bread is fine), crust removed ", "40g/1½oz butter ", "2 garlic cloves, finely chopped "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan or frying pan over a medium heat. Add the oil, leeks and a pinch of salt. Gently fry the leeks for 5-8 minutes, or until soft and translucent.", "Add the borlotti beans, rosemary sprigs and stock to the pan and stir to mix.  Cover with a lid, bring to a simmer and cook over a medium-low heat for 20 minutes, or until the ragù is thickened a little and the borlotti beans softened.", "Meanwhile, tear the bread into small pieces. Heat a large frying pan over a medium heat, add a knob of butter and, once melted, gently fry the bread in batches until golden-brown and crisp. Remove from the pan and set aside. Add the first batch back to the pan with a little more butter and the garlic. Fry for a minute, or until the garlic is just cooked and breadcrumbs are all coated. Season with salt and pepper to taste. Remove the crumbs with a slotted spoon and mix with the remaining breadcrumbs and a pinch of salt. ", "Taste the borlotti bean ragù and season with salt and pepper to taste. Remove the rosemary sprigs and serve the borlotti beans with the garlic crumbs sprinkled on top."]}]