[{"isVegetarian": false, "title": "Venetian seafood risotto", "url": "www_bbc_co_uk_food_recipes_venetian_seafood_risotto_78329", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice of nutmeg", "pinch coriander seeds", "4 cloves ", "1cm/½in cinnamon stick", "pinch ground ginger", "1 green cardamom pod, seeds only", "⅛ tsp turmeric", "⅛ tsp chilli powder", "1 onion, chopped", "1 fennel bulb, sliced", "100g/3½oz celery, sliced", "100g/3½oz carrots, sliced", "25g/1oz button mushrooms, washed and sliced", "thyme sprig", "1kg/2lb 4oz flatfish bones (such as brill, sole, plaice) or fillets", "2 tbsp olive oil", "1 small garlic clove", "250g/9oz prawn heads and shells", "1 tbsp tomato purée", "½ tsp salt", "4 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, grated", "350g/12oz carnaroli rice", "¼ tsp Byzantine spice mix ", "125ml/4fl oz dry white wine", "1½ litre/2½ pints fish stock, hot", "8 mussels, scrubbed and debearded", "150ml/5fl oz prawn stock", "2 red mullet fillets, cut diagonally into strips", "1 squid, body cut into rings, plus tentacles", "100g/3½oz small shrimps", "knob of butter", "100g/3½oz white crab meat", "small handful chopped flatleaf parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the spice mix, grind all of the ingredients using a pestle and mortar or an electric grinder. Store in an airtight tin or box.", "For the fish stock, put all the ingredients except the fish bones into a large pan, add 2¼ litres/3¾ pints water and bring to the boil. Turn down the heat and simmer gently for 20 minutes. Add the fish bones (or fish fillet) and bring back up to a simmer, skimming off any scum as it rises to the surface. Simmer for a further 20 minutes. Strain through a sieve into a clean pan and simmer a little longer, if necessary, until reduced to about 1¼ litres/2 pints. Keep warm. ", "For the prawn stock, heat the olive oil in a large pan over a medium heat. Add the garlic and the prawn heads and shells. Stir-fry for a couple of minutes before adding the tomato purée, salt and 300ml/10fl oz water. Cook for 10 minutes, then pass through a sieve, pushing down on the shells to extract as much of the prawn flavour as you can. Discard the shells, set the stock aside and keep warm.", "For the risotto, heat 3 tablespoons of the olive oil in a large frying pan over a medium heat. Fry the shallots and garlic gently until softened. Add the rice and fry it in the oil for 2 minutes, then add the Byzantine spice mix and stir it through the rice.", "Add the white wine, bring to a simmer and allow to evaporate, then add a ladle of the hot fish stock.", "When this has been absorbed, add the next ladle, and continue to do so, stirring after each addition, until you have only a couple of ladlefuls left, this should take about 16-18 minutes. Add the mussels and prawn stock.", "Heat the remaining tablespoon of olive oil in a frying pan until simmering and fry the red mullet strips, squid rings and tentacles and shrimps briskly for 2–3 minutes.", "Season with salt and pepper. Stir the seafood into the risotto with the remaining fish stock and cook for 1-2 minutes, or until absorbed. ", "Stir in the butter, crab meat and parsley, and serve immediately."]}, {"isVegetarian": false, "title": "Venison burger with celeriac remoulade and chips", "url": "www_bbc_co_uk_food_recipes_venison_burger_with_91544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range eggs,  yolks only", "2 tsp good-quality Dijon mustard", "1 tsp English wholegrain mustard", "3-4 tsp white wine vinegar, or to taste", "150ml/5fl oz sunflower oil", "50ml/2fl oz good-quality extra virgin olive oil", "pinch salt", "1 small celeriac", "1 bunch fresh dill, chopped", "4 large floury potatoes (preferably Maris Piper), cut into fries", "sunflower oil, for deep frying", "salt, to taste", "500g/17oz venison mince (preferably sirloin mince from fallow deer)", "salt and freshly ground black pepper", "1-2 tbsp olive oil", "1 red onion, finely sliced into rings", "3 gherkins, drained, sliced", "4 soft white bread rolls, cut in half horizontally", "tomato ketchup"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the celeriac remoulade, place the egg yolks, mustards and vinegar into the bowl of a food processor and blend until well combined.", "With the motor still running, gradually add the sunflower oil in a thin stream, until the mixture thickens and becomes smooth and glossy. (If the mayonnaise starts to thicken too quickly, loosen it with the tiniest drop of warm water, then continue.)", "Add the olive oil in the same way, until the mixture is creamy in texture. Taste and add a drop or two more vinegar, if necessary. Season to taste with salt.", "Peel the celeriac, then slice to a 1mm thickness using a mandolin or very sharp knife. Pile the celeriac slices on top of each other, then cut the slices into thin strips using a sharp knife. Work as quickly as possible to prevent the celeriac from discolouring. Alternatively, grate the celeriac.", "Mix the celeriac with the dill in a large mixing bowl, then add enough mayonnaise to bind it together. Set aside for 30 minutes.", "Meanwhile, for the chips, rinse the potato fries under cold water, then drain well and pat dry using kitchen paper. Dry as thoroughly as possible.", "Heat the oil in a deep-fat fryer to 140C/285F. Alternatively, heat the oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "When the oil is hot, add the chips (in batches if necessary) and fry for three minutes. Remove from the pan using a slotted spoon and set aside to drain in a colander lined with kitchen paper.", "Increase the heat to 180C/350F, then return the chips to the hot oil and fry for five minutes, or until lightly golden-brown. Remove from the oil again and drain in the colander (lined with fresh pieces of kitchen paper). Season with salt and keep warm.", "For the venison burger, season the venison mince with salt and freshly ground black pepper. Shape the seasoned mince into four thick burgers. Rub each burger all over with a little olive oil.", "Heat a griddle pan over a medium to high heat. When the pan is smoking, add the burgers and cook for 3-4 minutes on each side (for medium), or until brown griddle marks have appeared on the outside of the burgers and the burgers are cooked to your liking.", "To serve, place each burger into a bread roll and top with red onion, gherkins and a dollop of ketchup, if desired. Place the burgers onto four plates. Serve the chips and celeriac remoulade alongside."]}, {"isVegetarian": false, "title": "Venison carpaccio", "url": "www_bbc_co_uk_food_recipes_venison_carpaccio_03868", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 500g/1lb 2oz venison loin, trimmed", "vegetable oil for deep frying, plus 5 tbsp extra", "2 garlic cloves, crushed ", "8 sprigs fresh thyme", "4–6 juniper berries, crushed ", "4–6 black peppercorns, crushed", "small bunch baby beetroots, stalks trimmed", "small bunch candy beetroot, stalks trimmed", "1 tbsp sherry vinegar", "1 tbsp red wine vinegar", "½ tsp caster sugar", "½ celeriac, cut into small cubes ", "100ml/3½fl oz milk ", "100ml/3½fl oz double cream", "1 tbsp white wine vinegar", "½ tsp Dijon mustard", "300g/10½oz cherries, pitted and stalk removed", "200g/7oz kale", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the venison in a large bowl and coat with 2 tablespoons oil, garlic, half the thyme, the juniper berries and peppercorns. Cover and refrigerate overnight. ", "When ready to cook, remove from the marinade and season with salt and pepper. ", "Sear in a very hot pan for 1 minute on each side, or until coloured all over. Remove from the pan, wrap in cling film and allow to rest in the fridge until ready to eat.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Line a deep ovenproof dish with kitchen foil and place the beetroots inside. Bring the sides of the foil up around the beetroots, leaving a small gap. Pour the sherry vinegar and red wine vinegar into the foil, add ½ teaspoon salt, the sugar and remaining thyme, then seal the foil.", "Pour 100–200ml/3½–7fl oz water around the foil into the tray (depending on saucepan size) and roast for 30–40 minutes, or until soft. Remove from the oven and allow to cool in the juices. Peel and roughly chop. ", "Place the celeriac in a saucepan with the milk and cream over a medium heat. Cook until soft, season with salt and pepper and blend using a hand blender. Set aside.", "Meanwhile, in a bowl, mix the remaining 3 tablespoons oil with the white wine vinegar, mustard and a pinch of salt and pepper. Stir in the cherries.", "Preheat a deep-fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Deep-fry the kale in batches for 1 minute. Remove and drain on kitchen paper. Set aside.", "Slice the venison into thin pieces and divide equally between four plates. Garnish with the beetroot, cherries, a few drops of celeriac purée and the kale."]}, {"isVegetarian": false, "title": "Venison casserole with braised red cabbage and butternut squash", "url": "www_bbc_co_uk_food_recipes_venison_casserole_with_25450", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying ", "1kg/2lb 4oz venison shoulder and neck fillet, trimmed and cubed", "salt and pepper", "knob of butter", "10 shallots, peeled", "4 rashers smoked bacon, diced", "6 small carrots, with green tips attached", "2 garlic cloves", "350ml/12fl oz red wine", "150ml/5fl oz red port", "1litre/1¾ pint beef stock", "1 star anise", "1 cinnamon stick", "3 tbsp redcurrant jelly", "50g/1¾oz butter", "1 butternut squash, peeled and roughly chopped", "100ml/3½fl oz double cream", "sea salt and black pepper", "300ml/10fl oz crème de cassis", "500ml/18fl oz red wine", "1 strip orange zest", "sprig thyme", "olive oil, for frying", "1 red cabbage, finely sliced", "100ml/3½fl oz red wine vinegar", "5 red onions, finely sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Heat the olive oil in a large frying pan. Season the venison with salt and freshly ground black pepper, then add to the hot pan. Fry the meat in batches until browned all over, then set aside.", "Add a little olive oil and a generous knob of butter to a large, lidded casserole. Fry the shallots over a medium heat until they start to colour. Add the bacon, carrots and garlic and continue to cook for a few minutes. Add the browned venison to the casserole dish.", "Pour in the red wine and port, bring to the boil and then simmer until the liquid has reduced by half. Add the stock, star anise, cinnamon and redcurrant jelly, and season to taste with salt and freshly ground black pepper. Place the lid on the casserole dish and transfer to the oven and cook for 1½-2 hours, or until the meat is tender.", "For the butternut squash mash, add the butter to a large pan. Gently fry the squash without colouring for 15-20 minutes, or until soft. Add the cream and season to taste with sea salt and freshly ground black pepper. ", "Use a hand blender to blend the butternut squash until smooth. Pass the mash through a sieve and set aside in a warm place until ready to serve.", "For the red cabbage, place the crème de cassis, red wine, orange zest and thyme in a pan. Bring to a simmer and cook until the liquid has reduced in volume by three-quarters. ", "In a separate pan over a high heat, add a little olive oil and fry the cabbage for two minutes. Season to taste with salt and freshly ground black pepper. Add the vinegar and transfer to a clean pan. Add a little more oil to the pan the cabbage was fried in and gently fry the onions for 10 minutes. ", "Add the onions to the cabbage and pour over the reduced cassis mixture . Mix well, cover with foil and cook in the oven with the venison for an hour.", "When the casserole is cooked, carefully remove all the venison pieces into a clean pan then use a sieve to strain the cooking liquid onto the meat. Place on over a high heat and bring to a rolling boil. Cook until the liquid has reduced in volume by half. ", "Serve the casserole with the butternut squash mash and red cabbage alongside."]}, {"isVegetarian": false, "title": "Venison, chicken liver and Armagnac terrine", "url": "www_bbc_co_uk_food_recipes_venison_chicken_liver_34637", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_chicken_liver_34637_16x9.jpg", "ingredients": ["350g/12oz venison fillet, cut into 2cm/¾in-wide strips", "350g/12oz chicken livers", "2 tbsp rapeseed oil", "25g/1oz unsalted butter", "2 tbsp Armagnac", "550g/1lb 4oz dry cured smoked streaky bacon", "300g/10½oz skinless boneless chicken breasts, roughly chopped", "200ml/7fl oz double cream", "50g/1¾oz toasted chopped hazelnuts ", "50g/1¾oz dried cranberries", "2 tbsp chopped tarragon leaves", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Season the venison and chicken livers with salt and freshly ground black pepper.", "Heat the oil in a large frying pan over a medium heat. Add the venison strips, in batches, and cook for 30 seconds, stirring regularly, until browned on all sides. Remove from the pan and set aside on a plate. Repeat the process with the remaining venison strips.", "Add the butter to the pan and seal the chicken livers in the same way, until browned on the outside and just pink in the middle. Standing well back and protecting your forearms, pour the Armagnac over the chicken livers and set it alight with a match. Allow the flames to flare up and die down, then set the chicken livers aside in the pan to cool.", "Meanwhile, line the base and sides of a 1kg/2lb 4oz loaf tin with the bacon rashers, overlapping the edges and leaving a 5cm/2in overhang around the rim. ", "Preheat the oven to 180C/160C Fan/Gas 4.", "Blend the chicken breast pieces to a fine purée in a food processor. Pour in the double cream and blend again until well combined. Season with plenty of salt and freshly ground black pepper, then transfer to a bowl and fold in the hazelnuts and cranberries.", "Scoop one-third of the chicken mixture into the prepared loaf tin, smoothing it into an even layer using a palette knife. Top with the venison strips. Spread over half of the remaining chicken mixture in an even layer, then sprinkle over the tarragon leaves, flambéed chicken livers and the pan juices. Top with the remaining chicken mixture, then fold the overhanging bacon over the top of the terrine to completely cover. ", "Brush a piece of aluminium foil with oil and cover the tin with it, sealing tightly around the edges. Place the loaf tin in a deep-sided roasting tray. Pour in enough boiling water to reach halfway up the sides of the loaf tin, then carefully transfer the roasting tray to the oven and cook for 1¼–1½ hours, or until the terrine is cooked through. (To check that the terrine is cooked through, insert a skewer into the centre, then carefully touch it. If the skewer feels piping hot, the terrine is cooked through. If not, return it to the oven and cook for a further 10 minutes, then check again.)", "Remove the terrine from the oven and set aside to cool completely in the bain-marie. Remove from the bain-marie and chill in the fridge for at least an hour, or until needed. ", "To serve, remove the aluminium foil, then turn out the terrine onto a serving plate. Cut into thick slices and serve with gherkins, pickles and crusty bread or toast."]}, {"isVegetarian": false, "title": "Venison chop with juniper sauce and spring greens", "url": "www_bbc_co_uk_food_recipes_venison_chop_with_81103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 T-bone chops of venison (preferably fallow deer), plus a few extra bones and offcuts of deer meat for stock (available, in season, from good-quality butchers)", "2 tsp sea salt flakes, plus extra to season", "2 tbsp olive oil", "freshly ground black pepper", "1 banana shallot, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "½ tsp caster sugar", "200ml/7fl oz white Burgundy, or other dry white wine", "8 juniper berries, lightly crushed", "4 tbsp white wine vinegar", "1 tsp fresh thyme leaves", "40g/1½oz butter", "25g/1oz plain flour", "300ml/10½fl oz venison stock (see above)", "100ml/3½fl oz double cream", "sea salt flakes and freshly ground black pepper", "4 large handfuls spring greens", "handful chopped fresh chervil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the venison stock, place the deer bones and offcuts of deer meat into a large pan (the T-bone steaks will be used later). Add enough cold water to completely cover the pan contents, then add two teaspoons of salt and bring the water to the boil. ", "Reduce the heat until the mixture is simmering and continue to simmer for 1 hour 30 minutes, skimming the froth from the surface of the water at regular intervals. (NB: You will only need 300ml/10½fl oz of stock for this recipe; any excess can be frozen for future use for up to four months.)", "For the juniper sauce, place the shallot, garlic, sugar, white wine, juniper berries, white wine vinegar and thyme into a saucepan and bring the mixture to the boil. ", "Reduce the heat until the mixture is simmering and continue to simmer for 3-4 minutes, or until the volume of liquid left in the pan has reduced to approximately two tablespoons.", "Meanwhile, melt the butter in a separate saucepan over a medium heat. When the butter has melted, add the flour and whisk for 30 seconds until the mixture is well combined as a smooth roux sauce.", "With the pan of roux sauce still over the heat, strain the wine reduction through a fine sieve into the pan containing the roux sauce. Pick the juniper berries from the ingredients left in the sieve and add them to the sauce. Keep whisking regularly.", "Slowly add the hot venison stock, one ladleful at a time, to the roux sauce mixture, whisking each ladleful until fully incorporated into the roux sauce before adding the next ladleful. Once all of the stock has been added to the roux sauce, continue to cook the sauce gently for 10 minutes, or until it has thickened enough to coat the back of a spoon.", "Pour in the cream and increase the temperature until the sauce is just simmering (do not allow it to boil), then remove the pan from the heat and season to taste with salt and freshly ground black pepper. Reheat when needed.", "For the venison, preheat the grill to its highest setting. Heat an ovenproof griddle pan over a medium-to-high heat.", "Rub the venison chops all over with the olive oil, then season to taste with salt and freshly ground black pepper. When the griddle pan is hot, add the venison chops and sear on both sides for 1-2 minutes, or until browned all over. ", "Transfer the pan to the grill and continue to cook the venison chops for 4-5 minutes (for medium-rare), or until cooked to your liking.", "Just before serving, heat a frying pan over a medium heat, add the spring greens and a tablespoon or two of boiling water, then season, to taste, with salt and freshly ground black pepper. Continue to cook for 1-2 minutes, or until the spring greens are just wilted.", "To serve, place one venison chop onto each of four serving plates. Spoon over the juniper sauce. Spoon the wilted spring greens alongside. Sprinkle over the chervil."]}, {"isVegetarian": false, "title": "Venison cobbler", "url": "www_bbc_co_uk_food_recipes_venison_cobbler_98688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower oil", "2 large onions, sliced", "2 celery sticks, trimmed and sliced", "1 medium carrot, peeled and cut into rough 15mm/⅝in  cubes", "2 tbsp plain flour", "1 tsp English mustard powder", "500ml/18fl oz real ale or stout", "1kg/2lb 4oz venison (ideally shoulder or leg), cut into 3cm/1in chunks", "2 heaped tbsp redcurrant jelly", "1 tbsp fresh thyme leaves, roughly chopped", "2 bay leaves", "1–2 tbsp fresh lemon juice", "flaked sea salt and freshly ground black pepper", "500g/1lb 2oz self-raising flour, plus extra for dusting", "½ tsp fine sea salt", "100g/3½oz cold butter, cut into cubes", "300ml/10½oz whole milk, plus extra for glazing", "beaten egg, to glaze (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Heat the oil in a medium, flameproof casserole dish (or a large heavy-based saucepan) and fry the onions, celery and carrot gently for 10 minutes, or until the onion is softened and lightly coloured, stirring occasionally. ", "Add the flour and mustard and cook for a few seconds before slowly stirring in the ale and 250ml/9fl oz of water. Add the venison, redcurrant jelly, thyme leaves and bay leaves and stir. Season with a little salt and lots of coarsely ground black pepper. Bring to a gentle simmer, stirring occasionally, then cover with a lid. ", "Carefully transfer the dish to the oven and cook for 1¾–2 hours, or until the venison is very tender and the sauce is thick.", "Season to taste with salt and pepper, adding a little lemon juice to lift the richness. (At this point you can cool the venison mixture and leave it in the fridge to finish off later, or the next day if you like.) When you’re ready to cook your cobbler, spoon the venison mixture into an ovenproof pie dish.", "For the cobbler topping, preheat the oven to 200C/400F/Gas 6. ", "Put the flour and salt in a large bowl and rub in the butter with your fingertips until the mixture resembles breadcrumbs. Add the milk, stirring constantly, until the mixture comes together and forms a soft, spongy dough.", "Turn the dough out onto a floured work surface and roll out until it is about 2cm/¾in thick. Cut out 6cm/2½in rounds with a pastry cutter, kneading and re-rolling any leftover dough as necessary. ", "Place the ‘cobbles’ over the surface of the pie so they nearly cover the filling and brush them with milk or beaten egg. ", "Bake for 30 minutes, or until the topping is golden-brown and the filling is hot."]}, {"isVegetarian": false, "title": "Venison, coconut-curried pumpkin and mustard cabbage", "url": "www_bbc_co_uk_food_recipes_venison_coconut-curried_11281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5½oz venison loin or leg steaks", "¼ small Savoy cabbage (250g/9oz) core removed and thinly shredded", "1 tbsp English mustard", "3 tbsp cider vinegar or other white vinegar", "1 tsp caster sugar", "1 tsp salt", "500g/1lb 2oz pumpkin, peeled, seeds removed and cut into chunks", "½ tsp cumin seeds", "20 curry leaves", "3 tsp sesame oil", "1 tbsp sunflower oil", "1 red onion, halved and thinly sliced", "2 star anise", "2 garlic cloves, thinly sliced", "5cm/½in piece root ginger, peeled and cut into matchsticks    ", "1 red chilli, finely chopped", "2 tsp fish sauce", "5cm/½in piece lemongrass outer layers discarded, insides thinly sliced", "4 kaffir lime leaves", "300ml/10fl oz coconut milk", "salt and freshly ground black pepper"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Sit the venison on a plate, cover with cling film and allow to come to room temperature. ", "Put the shredded cabbage in a bowl. Mix the mustard, vinegar, sugar and half a teaspoon of the salt together, pour over the cabbage and stir to coat. Cover and set aside. ", "Put the pumpkin in a roasting dish and add the cumin seeds and curry leaves. Drizzle over one teaspoon of the sesame oil and season with the remaining salt. Toss together and bake for 10 minutes. ", "Meanwhile, place a medium saucepan over a medium heat. Add the sunflower oil, onion and star anise and cook until the onion begins to caramelise, stirring often. Add the garlic, ginger and chilli and cook for another 2 minutes, stirring. Add the fish sauce and cook for 30 seconds, then add the lemongrass, lime leaves and coconut milk and bring to the boil. Cook over a medium heat for 4 minutes. ", "Remove the pumpkin from the oven and pour the curry sauce over it. Return to the oven and continue cooking until the pumpkin is cooked and beginning to colour. Turn the oven off and keep the pumpkin warm in the oven. ", "Meanwhile, to cook the venison, place a heavy-based saucepan over a medium–high heat and wait until it gives off a blue haze. Brush the steaks with the remaining sesame oil and lightly season with salt and pepper on both sides. Place the steaks in the pan and cook for 3 minutes. Turn over and cook to your liking. (If you like it medium–rare, they’ll need just another 2 minutes.) Remove the steaks and rest them on a warm plate, covered with foil, for 5–8 minutes. ", "To serve, spoon the pumpkin onto four warmed plates and lay the cabbage across it. Slice the venison into 1cm/ ½in slices and lay on top, then spoon over the sauce. "]}, {"isVegetarian": false, "title": "Venison cooked in a spiced salt crust with caramelised chicory", "url": "www_bbc_co_uk_food_recipes_venison_cooked_in_a_29725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "200g/7oz trimmings from venison loin (below)", "2 carrots, chopped", "1 onion, chopped", "2 garlic cloves, chopped", "2 sprigs fresh thyme", "2 juniper berries", "1 tsp black peppercorns", "350ml/12fl oz red wine", "100ml/3½fl oz port", "1litre/1¾ pint beef stock", "10g/⅓oz ground black pepper", "10g/⅓oz ground star anise", "10g/⅓oz ground cinnamon", "10g/⅓oz ground juniper berries ", "250g/9oz rock salt", "1 free-range egg white", "200g/7oz plain flour", "oil, for frying", "400g/14oz venison loin", "25g/1oz butter", "2 heads red chicory, cut in quarters lengthways", "15g/½oz sugar", "1 orange, juice only", "½ lemon, juice only", "150ml/5fl oz chicken stock", "few mint leaves, sliced into very thin strips"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the venison sauce, heat a little olive oil in a large saucepan and fry the venison trimmings until brown all over. Add the carrots and onion and fry gently for two minutes, or until the onions are soft and translucent. Add the garlic, thyme, juniper berries, black pepper, red wine and port. Simmer for five minutes then add the beef stock. ", "Simmer for 45 minutes. Pass through a sieve into a clean saucepan and simmer again until the volume of liquid has reduced to a rich sauce.", "For the venison in a spiced salt crust, preheat the oven to 225C/425F/Gas mark 7.", "To make the salt crust, combine all the spices in a large bowl. Put a few pinches of the spices to one side. Add the salt, egg white and 100ml/3½fl oz water to the bowl. Slowly add the flour and knead until you have a smooth dough. Cover with cling film and set aside to rest for an hour. ", "In a very hot pan, heat a little oil and brown the venison loin for a minute. Remove the venison and sprinkle it with the reserved spices. ", "On a lightly floured work surface, roll out the salt crust dough to a rectangle 1cm/½in thick. Place the venison in the middle of the dough ready to encase it. Trim off any excess where the corners will overlap to form a rough cross shape. Fold the ends over the venison, then wrap the long edges over so the meat is completely enclosed. Turn it over to hide the seams and make a small hole in the top. Bake for 12–14 minutes.", "To check the venison is cooked, insert a metal skewer into the hole and leave for 10 seconds. Place the skewer on the back of your hand, if the meat is cooked it should feel warm. Remove from the oven and set aside to rest for 12 minutes. ", "For the caramelised chicory, melt the butter in a frying pan. Add the chicory and season to taste with salt and pepper. Sprinkle over the sugar and cook for two minutes. Pour in the orange and lemon juices and the chicken stock. Simmer for five minutes before finishing with chopped mint.", "To serve, place the chicory on serving plates. Crack open the salt crust, wipe the venison with kitchen paper and carve. Place a few slices next to the chicory and spoon over the sauce. "]}, {"isVegetarian": false, "title": "Venison cottage pie", "url": "www_bbc_co_uk_food_recipes_venison_cottage_pie_69051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp oil, for frying", "6 rashers smoked streaky bacon, chopped", "1 large onion, finely chopped", "1 large carrot, finely chopped", "2 sprigs rosemary, leaves picked and chopped", "600g/1lb 5oz venison mince", "1 heaped tbsp plain flour", "300ml/10fl oz red wine", "500ml/18fl oz beef or game stock", "salt and freshly ground black pepper", "1kg/2lb 4oz potatoes, chopped into 2cm/¾in cubes ", "knob of butter", "splash milk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large deep, lidded casserole or a heavy-based saucepan set over a high heat. Add the bacon and fry until crisp. Remove and set aside.  ", "Add the onion, carrot and rosemary and fry for a few minutes until softened. Add the mince and stir until golden-brown, breaking it up while stirring.  ", "Sprinkle in the flour and cook for a minute, stirring. Gradually add the wine, and, stirring all the time, boil for a few minutes until the volume of liquid has reduced by half. Add the stock and the cooked bacon, bring to the boil and season with salt and pepper, stirring for 5 minutes. Cover and simmer for about 40 minutes or until tender.  ", "Preheat the oven 200C/180C Fan/Gas 6.  ", "Spoon the mince into a 3 litre/5 pint ovenproof dish. Set aside to cool.", "To make the topping, bring a large saucepan of salted water to the boil. Boil the potatoes until tender. Drain and return to the pan. Add the butter and milk. Season with salt and pepper and mash until smooth. ", "Spoon the mash on top of the cold mince, level the top and mark with a fork. Bake for 45 minutes or until golden-brown and bubbling."]}, {"isVegetarian": false, "title": "Venison curry", "url": "www_bbc_co_uk_food_recipes_venison_curry_28033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz wild venison, diced", "25g/1oz ginger-garlic paste, from a jar", "4 tbsp vegetable oil", "200g/1lb 5oz tomatoes, roughly chopped", "300g/10½oz onions, roughly chopped", "2 tbsp Kashmiri chilli powder ", "2 tbsp ground coriander ", "2 tbsp ground turmeric ", "2 tbsp juniper seeds, crushed ", "2 tsp garam masala ", "2 green chillies, finely chopped (optional)", "1 tbsp chopped fresh coriander leaves", "2 tbsp Greek-style yoghurt", "100g/3½oz Greek-style yoghurt", "150ml/5fl oz milk", "2 tsp salt", "500g/1lb 2oz plain four", "1 tsp baking powder", "3 tbsp extra virign rapeseed oil, plus extra for kneading", "500g/1lb 2oz cooked white basmati rice, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, heavy-bottomed saucepan over a medium heat. Add the onions and fry until they are a light golden brown. Add the venison and cook for 5 minutes until the juices come out of the meat. ", "Add the ginger-garlic paste and cook for 4–5 minutes. Add the spices and chilli and cook for a couple more minutes. Add the tomatoes, reduce the heat to a simmer, cover with a lid or parchment paper and cook for 1–1½ hours until the meat is soft and tender. You may need to top up with a splash of water from time to time if it becomes too dry.  ", "Meanwhile, to make the naan breads, place all the ingredients in a large bowl, mix well and leave to rest for at least an hour. ", "Turn the dough out onto a floured surface and knead into a soft dough. Divide into 8 and shape into 8 naan breads. ", "Heat a frying pan over a medium head and cook the naan breads in the dry pan, in batches, for 3–4 minutes on each side. ", "Take the curry off the heat and stir in the yoghurt.  Sprinkle with the coriander and serve with the rice and naan breads. "]}, {"isVegetarian": false, "title": "Venison salad with fig purée and wild mushrooms", "url": "www_bbc_co_uk_food_recipes_venison_salad_with_fig_16503", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz groundnut oil", "70ml/2½fl oz white wine vinegar ", "pinch ground white pepper", "pinch salt ", "1 garlic clove, lightly crushed ", "1 sprig fresh thyme ", "300g/10½oz ripe black or green figs, whole", "20g/¾oz butter", "pinch Chinese five-spice", "30ml/1fl oz port", "4 venison fillets or 240g/9oz venison saddle", "1 tbsp vegetable oil", "60g/2¼oz unsalted butter ", "1 shallot, finely chopped ", "125g/4½oz mixed wild mushrooms", "80ml/2½fl oz chicken stock", "1 tbsp chopped fresh parsley", "pinch Chinese five-spice", "60g/2½oz mixed salad leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the vinaigrette, mix together all the ingredients.", "For the fig purée, cut the figs in half and remove the pulp, with no white flesh.", "Heat the butter in a pan until foaming. Add the five-spice and cook for 2 minutes and then add the flesh of the figs. Add the port and cook for 10-15 minutes.  ", "In a blender, blend until smooth, then pass through a sieve. Finish with a little more butter and season with salt and pepper. Set aside and keep warm.  ", "Season the venison with salt and pepper. Heat a thick bottomed pan with a little oil and 25g/1oz butter. When the butter is foaming, add the venison and cook slowly, colouring all around. Cook for approximately 10 minutes, remove from the pan and leave to rest for 15 minutes before serving. ", "For the ragoût, using the pan that you cooked the meat in, add a knob of butter and the shallots cooking gently for about 1 minute before adding the mushrooms.  Add the chicken stock and cook for 2 minutes. Whisk in the remaining 25g/1oz of butter. Add some vinaigrette to taste and finish with salt, pepper, chopped parsley and a pinch of five spice.", "To serve, slice the venison. Put a little fig purée on each plate, put the mushrooms in the middle of the plate and meat on top. Dress the salad leaves lightly in the vinaigrette and scatter them over and around. Pour over a little ragoût and serve ."]}, {"isVegetarian": false, "title": "Venison on sourdough", "url": "www_bbc_co_uk_food_recipes_venison_on_sourdough_10137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz venison striploin, from roe or fallow deer", "4 sprigs fresh thyme, chopped", "1 tsp salt", "2 tbsp sunflower oil", "¼ cucumber, peeled and sliced thinly", "½ tsp salt", "50ml/2fl oz white wine vinegar ", "pinch caster sugar", "vegetable oil, for deep frying", "1 red onion, sliced", "50g/1¾ oz rice flour", "½ tsp salt", "2 slices sourdough bread, griddled and toasted", "1 tsp Dijon mustard", "175g/6oz crème fraîche", "½ tsp toasted fennel seeds", "1 lemon, zest only", "50g/1¾ oz capers", "2 tbsp chopped dill", "1 tsp freshly grated horseradish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the venison, place the chopped thyme and salt on a chopped board and mix. Roll the venison loin in the mix, coating all round. Season with pepper.", "Heat a medium frying pan and add the oil. When the oil is hot, sear the venison all over and cook for 8-10 minutes, turning while cooking.", "Put the cucumber slices in a sieve and add salt. Leave for a few minutes and then squeeze out excess water, mix with the vinegar and sugar and drain again. Set aside until needed.", "For the crispy onions, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat to 180C. (To check the oil is at the right temperature, drop a cube of bread into the hot oil. It should become golden-brown in 1 minute.) (CAUTION: Hot oil can be dangerous. Don't leave unattended.)", "Mix the salt and flour on a plate. Dredge the onion slices in flour and deep-fry for 2 minutes. Remove and place on a plate with kitchen roll and season with salt.", "To serve,place the sourdough on a serving plate and spread with the mustard. Slice the venison and place on top. Quenelle the crème fraîche on the side, pile cucumbers next to the venison and finish with crispy onions and fennel seeds. Finish the dish with the lemon zest, capers, dill and horseradish."]}, {"isVegetarian": false, "title": "Venison scotch eggs and apple purée", "url": "www_bbc_co_uk_food_recipes_venison_scotch_eggs_and_88459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sugar", "15g/½oz lemon juice", "4 Bramley apples, peeled, sliced and cored", "150g/5½oz onion, finely chopped ", "butter, for frying", "350g/12oz coarse venison mince", "150g/5½oz pork belly, coarsely minced  ", "1½ tsp chopped thyme  ", "1 garlic clove, grated ", "½ tsp ground mace", "¼ ground juniper ", "½ tsp table salt, plus extra to serve ", "½ tsp coarsely ground black pepper", "6 quails’ eggs, soft boiled, shells removed", "5 free-range eggs, beaten", "100g/3½oz plain flour", "200g/7oz panko breadcrumbs", "vegetable oil, for deep frying"], "serves": "Makes 6 Scotch eggs", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple sauce, in a saucepan, bring 300ml/10½fl oz water, the sugar and lemon juice to the boil. Add the sliced apple and cook until soft. ", "Blend to a purée using a hand-held blender, then pass through a sieve and leave at room temperature.", "For the scotch eggs, gently fry the onions in a little butter until soft but not coloured. Set aside to cool.", "In a bowl combine the venison mince, pork belly mince, thyme, cooled onions, garlic, mace, juniper, salt and pepper. Divide the mixture into 85g/3oz balls. Press your thumb into the middle of each ball to make a hole.  Push a quails’ eggs into each hole, then push the mince over the top to encase the quails' egg. Place on a baking tray and transfer to the fridge to chill.", "Preheat a deep-fat fryer to 180C/350F and preheat the oven to 180C/350F/Gas 4 (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Put the beaten eggs, flour and breadcrumbs in separate bowls.  Roll the Scotch eggs into the flour, patting off any excess.  Coat the scotch egg fully in beaten egg, letting any excess drip off.  Finally roll the Scotch eggs in breadcrumbs until fully covered.", "Gently place the scotch eggs into the basket of the deep-fat fryer and lower into the fat. Cook until golden-brown (approximately five minutes). Carefully remove with a slotted spoon and transfer to a plate lined with kitchen roll.", "Transfer to the oven for three minutes to ensure the meat is cooked and the egg is warm and still beautifully runny.  Remove from the oven sprinkle with a little salt and serve with the apple sauce.   "]}, {"isVegetarian": false, "title": "Venison shank casserole with pears and parsnips", "url": "www_bbc_co_uk_food_recipes_venison_shank_casserole_18971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 venison shanks, from the front legs ", "350ml12fl oz red wine", "150ml/5fl oz port ", "1 sprig thyme", "2 cloves garlic, crushed", "1 bay leaf", "4 peppercorns", "4 juniper berries", "2 tbsp vegetable oil", "4 rashers smoked bacon, chopped", "1 onion, chopped", "2 carrots, peeled and chopped", "1 stick celery, chopped", "2 litres/3½ pints chicken or beef stock", "200g/7oz cooked chestnuts", "½ onion squash, seeds removed and cut into 2.5cm/1in moons, skin on", "6 beetroot, preferably Cheltenham Greentop variety, washed and cut in half lengthways", "sea salt ", "2 sprigs thyme", "2 garlic cloves", "6 tbsp vinaigrette", "3 ripe pears, preferably Williams variety", "freshly ground black pepper", "150g/5½oz butter", "150ml/5fl oz chicken stock", "3 parsnips, peeled and halved"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the casserole, place the venison into a bowl with the red wine, port, thyme, garlic, bay leaf, peppercorns and juniper berries, stir well then leave to marinate in the fridge overnight.", "Preheat the oven to 140C/275F/Gas 1.Remove the venison from the bowl, reserving the marinade, and dry with kitchen paper.", "Heat a heavy-based ovenproof casserole pan until hot, add the oil then the venison and brown the meat on all sides over a high heat. Remove the meat from the pan and set aside.", "Add the bacon and vegetables to the pan, along with a pinch of salt, and cook until the vegetables are lightly browned. ", "Add the reserved marinade, cook until it has reduced by two-thirds then place the venison back in the pan, add the stock and bring to a simmer.", "Cut a piece of greaseproof paper to the same size as the top of the pan and place on top of the casserole.", "Place the pan in the oven and cook for 2-3 hours until the meat is tender. Allow the casserole to cool, then remove the venison shanks and set them aside.", "Sieve the cooking juices then return them to the pan and reduce by at least a half or until the sauce is rich and dark. Set the pan aside until ready to finish.", "For the roasted vegetables, turn the oven up to 170C/325F/Gas 3.", "Wrap the squash and beetroot in a foil parcel with the salt, thyme, garlic and vinaigrette and a couple of tablespoons of water. Place on a baking tray in the oven and bake for 30-40 minutes until tender. ", "Meanwhile, cut the pears in half, remove the cores and season with salt and freshly ground black pepper. ", "In a large pan, warm half the butter and then add the pears cut side down. Allow the butter to get very hot and turn a light brown colour, then turn the heat down and cook gently for 8-10 minutes until the pears are tender.", "Add the chicken stock, let it bubble then remove the pears from the pan and set aside in a warm place.", "Blanch the parsnips in boiling water then transfer them to the same pan you used to cook the pears and add the remaining butter. Cook gently until the parsnips are tender and golden-brown.", "To finish the casserole, return the venison shanks to the pan, add the chestnuts and gently warm through.", "Serve the casserole on warmed plates with the squash, beetroot, pears and parsnips alongside."]}, {"isVegetarian": false, "title": "Venison steaks with red cabbage and potato pancakes", "url": "www_bbc_co_uk_food_recipes_venison_steaks_with_red_18489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red cabbage, shredded", "150g/5½oz demerara sugar", "40g/1½oz sea salt flakes ", "20 juniper berries, crushed", "50g/1¾oz butter", "250g/9oz cold, dry mashed potato", "75g/2½oz plain white flour", "1 tsp baking powder", "125ml/4fl oz milk", "2 free-range eggs", "3 tbsp rapeseed oil", "200ml/7fl oz red wine", "100ml/3½fl oz red wine vinegar", "100g/3½fl oz redcurrant jelly", "4 cloves", "500ml/1lb 2oz beef stock", "50g/1¾oz butter", "4 tbsp rapeseed oil", "4 venison T-bone steaks (about 250g/9oz each) ", "salt, to taste", "½ lemon, juice only", "150g/5½oz crème fraîche, to serve", "1 tsp crushed Sichuan peppercorns", "1 lime, juice only, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Thirty minutes before you plan to cook, mix the red cabbage, demerara sugar, sea salt flakes and juniper berries together in a non-metallic bowl and leave for the cabbage to soften.", "Meanwhile, make the potato pancakes, preheat the oven to 160C/325F/Gas 3 and then turn it off. Mix the mashed potato, flour and baking powder together in a bowl. In a separate bowl, whisk together the milk and eggs, then stir the liquid ingredients into the potato mixture to form a batter. ", "Heat the rapeseed oil in a large non-stick frying pan over a medium heat. Drop spoonful of the batter into the pan and fry for 2-3 minutes on each side until golden-brown. Transfer them to the turned off oven to keep hot. You should get 12-16 pancakes from the batter.", "To make the clove sauce, bring the red wine, red wine vinegar, redcurrant jelly and cloves to the boil in a saucepan over a high heat, stirring to dissolve the jelly. Continue boiling until the volume of liquid reduces to a glaze. Add the beef stock, return to the boil and reduce again by half to make a sauce. Pass the sauce through a fine sieve into a bowl to remove the cloves, then set aside and keep warm.", "For the red cabbage, rinse the cabbage thoroughly under cold running water. Melt the butter in a pan over a medium heat, then add the cabbage to warm through. Do not overcook – the cabbage should still have some crunch. Keep warm until ready to serve.", "For the venison steaks, melt the butter with the rapeseed oil in a large frying pan set over a high heat until the butter just starts to turn a hazelnut-brown colour. Season the steaks with a pinch of salt, add them to the pan and fry for 3-4 minutes on each side, or until they are a lovely dark colour. Squeeze in the lemon juice and baste the venison with the pan juices (do not overcook them, as venison has a very low fat content and can become dry). Remove the steaks from the pan and leave them to rest, covered with foil, for 10 minutes.", "While the steaks are resting, mix together the crème fraîche, Szechuan pepper and lime juice.", "To serve, put a couple of pancakes on each plate, add some red cabbage and a venison steak, and then pour over the clove sauce. Serve with the spiced crème fraîche on the side. "]}, {"isVegetarian": false, "title": "Venison, swede and blackberries", "url": "www_bbc_co_uk_food_recipes_venison_swede_and_74619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small swede, cut into 1cm/½in cubes", "150g/5½oz unsalted butter", "200g/7oz venison loin ", "1 bunch thyme, leaves picked", "1 bunch purple sprouting broccoli ", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 banana shallots, finely chopped", "200ml/7fl oz port", "500ml/18fl oz chicken stock", "250g/9oz blackberries"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the swede in a saucepan and just cover with water. Add 100g/3½oz of the butter and season with salt and pepper. Boil until the swede is tender or until the water has evaporated. Drain, if necessary, and crush with a fork.", "Season the venison with salt and pepper. Heat a frying pan and add the remaining butter. Add the venison and thyme. Fry for 3–4 minutes or until the meat is cooked to your liking. Leave to rest for 10 minutes.", "Meanwhile, make the sauce. Heat the oil in a frying pan and add the shallots. Fry gently until soft then add the port and cook until the volume of liquid is reduced by half. Add the stock and reduce again until you have a sauce consistency. Add the blackberries and cook for 1–2 minutes. ", "Bring a pot of salted water to the boil and blanch the broccoli for 2 minutes, then drain. Drain on kitchen paper. Heat a frying pan and char the broccoli.", "To serve, slice the venison. Divide the swede between serving plates, add the broccoli, top with venison and finish with the sauce.  "]}, {"isVegetarian": false, "title": "Venison tartare, hazelnut mayonnaise and apple", "url": "www_bbc_co_uk_food_recipes_venison_tartare_hazelnut_86777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 egg yolk", "1 tsp Dijon mustard", "1 tsp sherry vinegar", "100ml/3½fl oz vegetable oil", "50ml/2fl oz hazelnut oil", "1 lemon, halved", "400g/14oz roe deer fillet", "ice cubes, to keep the tartare cool as you prepare it ", "2 tbsp finely chopped apple ", "2 tbsp finely chopped carrot ", "2 tbsp finely chopped celeriac ", "2 tbsp finely chopped chives ", "2 tbsp roughly chopped hazelnuts ", "1 tsp finely chopped shallots", "1 tsp sherry vinegar  ", "4 quails’ eggs", "sea salt and freshly cracked black pepper", "gluten-free sourdough croûtons"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the mayonnaise, put the egg yolk, mustard and vinegar in a bowl. Whisk until emulsified. Place the bowl on a kitchen cloth (to stop it from moving around) and slowly whisk in the vegetable and hazelnut oil. Season with freshly squeezed lemon juice, to taste, then cover and store in the fridge until needed.", "For the venison tartare, use a sharp knife to remove any sinew from the fillet, then cut the meat into a very fine dice. Put the meat in a medium bowl and place in a large bowl or roasting tray filled with ice. Season the meat well with salt and pepper before mixing in the apple, carrot, celeriac, chives and hazelnuts. ", "Add a tablespoon of the mayonnaise. Stir in the vinegar and mix until combined, adding more mayonnaise if needed. I like to mould the tartare in a lightly greased metal ring from a stylish presentation, but it can be just spooned into the centre of serving plates.", "Serve the tartare with a quail’s egg yolk on top of each portion and a little extra cracked pepper. Garnish with the croûtons."]}, {"isVegetarian": false, "title": "Venison tartare with celeriac remoulade, chestnuts and juniper toast", "url": "www_bbc_co_uk_food_recipes_venison_tartare_with_19212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sourdough bread, thinly sliced", "drizzle olive oil", "5 dried juniper berries, crushed", "1 garlic clove", "40ml/1½fl oz white wine vinegar", "15 drops Tabasco", "20g/¾oz Dijon mustard", "40g/1½oz tomato ketchup", "3 silver anchovy fillets (boquerones)", "1 dried juniper berry", "1 small celeriac", "3-4 tbsp salt", "100ml/3½fl oz crème fraîche", "1 tsp wholegrain mustard", "400g/14oz venison loin, fat trimmed, finely diced", "1 large shallot, diced", "½ bunch fresh flatleaf parsley, leaves chopped", "50g/2oz cornichons, drained, diced", "salt and freshly ground black pepper", "4 quail egg yolks (reserve half of each shell to serve)", "2 large fresh chestnuts, cooked, peeled and sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the toast, preheat the grill to a medium setting.", "Grill the sourdough slices for 1-2 minutes. Turn over and drizzle with olive oil. Sprinkle over the crushed juniper berries. Toast for 2 minutes or until golden-brown. Keep warm.", "For the dressing, blend all of the dressing ingredients to a smooth purée in a food processor. Set aside until needed.", "For the remoulade, peel the celeriac and cut the flesh into thin strips, sprinkling the strips with salt as you go to prevent it from discolouring and to absorb any moisture. Set aside for 3 minutes.", "Wash the julienned celeriac under a cold running tap, then drain. Transfer to a large mixing bowl. Stir in the mustard and crème fraîche until well combined. Chill in the fridge until needed.", "For the venison tartare, in a bowl, mix together the diced venison, shallot, parsley and cornichons. Pour over the dressing and mix until well combined, Season, to taste, with salt and freshly ground black pepper, then mix again.", "To serve, place one ring mould onto each of 4 serving plates. Divide the venison tartare equally among the ring moulds, pressing the meat down into the sides of the mould. Twist a helping of the celeriac remoulade around a fork and place it alongside the venison. Add a slice or two of toast and top each venison tartare with a half eggshell containing a quail egg yolk. Finally, garnish each plate with the chestnut slices."]}, {"isVegetarian": false, "title": "Venison Wellington with caramelised onions and port jus", "url": "www_bbc_co_uk_food_recipes_venison_wellington_with_90748", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_wellington_with_90748_16x9.jpg", "ingredients": ["1 tbsp olive oil", "750g/1lb 10oz venison fillet, from the thickest end, trimmed", "2 onions, thinly sliced", "1 tbsp light muscovado sugar", "1 tbsp balsamic vinegar", "1 tbsp finely chopped fresh thyme leaves", "plain flour, for dusting", "375g/13oz ready-rolled puff pastry", "1 tsp Dijon mustard", "1 free-range egg, beaten", "salt and freshly ground black pepper", "1 tbsp plain flour", "300ml/½ pint hot beef stock", "100ml/3½fl oz port or red wine", "1 heaped tsp redcurrant or other fruit jelly"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the oil in a large frying pan over a high heat. Season the venison with salt and pepper and fry for about 20 seconds on each side, or until sealed and golden-brown but not cooked. Remove and set aside to cool.", "Reduce the heat to low, add the onions to the pan and fry for few minutes. Cover with a lid and cook for 15–20 minutes, or until soft and golden. ", "Remove the lid and fry for a minute to drive off any liquid. Remove half the onions with a slotted spoon and set aside (this will be used for the gravy later). Add the sugar, vinegar and thyme to the onions and cook for 5 minutes, or until sticky. Leave to cool completely.", "Roll the pastry out on a lightly floured work surface until it is very thin – about 25x35cm/10x14in. Trim the edges to neaten. Brush the surface of the pastry with the mustard, sit the browned fillet in the centre and spoon over the sticky balsamic onions. ", "Fold up the ends and bring over the sides, trim any excess if there are double layers of pastry, and brush with beaten egg. Use the pastry trimmings to cut out three leaves and arrange in the centre of the Wellington, then glaze them with egg. Chill in the fridge for 1 hour, along with any remaining beaten egg.", "Preheat the oven to 220C/200C Fan/Gas 7. You will need a large baking tray lined with non-stick baking paper preheated in the oven so that it is piping hot.", "Brush the Wellington with the remaining beaten egg. Sit it on the hot baking tray and roast for 20–25 minutes, or until golden-brown. Leave to rest for 5–10 minutes before carving.", "Meanwhile, to make the sauce, fry the reserved cooked onion in a saucepan over a high heat for 1 minute. Sprinkle in the flour, and stir. Add the hot stock, fruit jelly and port. Bring to the boil, stirring, and cook for 5 minutes, or until reduced and thickened. ", "Strain the sauce through a sieve, return it to the pan, season with salt and pepper, and cook for a few more minutes, until it has a coating consistency. Add more salt and pepper if necessary.", "Carve the venison into very thick slices and serve with the port sauce."]}, {"isVegetarian": false, "title": "Venison with kale, red cabbge purée, celeriac, baby beetroots, potato galette and blackberry sauce", "url": "www_bbc_co_uk_food_recipes_venison_with_kale_red_24792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz butter", "600g/1lb 5oz red cabbage leaves, finely sliced", "280ml/10fl oz red wine", "50g/1¾oz soft brown sugar", "2 star anise", "½ cinnamon stick", "5 tbsp redcurrant jelly", "2 tbsp red wine vinegar", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 x 200g/7oz venison fillet, fully trimmed ", "sea salt and freshly ground black pepper", "50g/1¾oz butter", "1 shallots, thinly sliced", "1 garlic clove", "5 sprigs fresh thyme, leaves picked", "2 juniper berries, crushed", "½ fresh bay leaf", "1 tbsp sugar", "100ml/3½fl oz ruby port", "150ml/5fl oz chicken stock, preferably homemade", "150g/5½oz fresh blackberries ", "2 tbsp olive oil", "50g/1¾oz butter", "1 large celeriac, peeled and diced", "1 bunch baby beetroots, cooked, peeled and cut it in half", "75g/2½oz butter", "2 large potatoes, cut into spirals on a spiralizer", "50g/1¾oz unsalted butter", "1 head kale, leaves removed and roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the red cabbage purée, heat a large saucepan, add the butter and red cabbage and fry for 1-2 minutes, or until just softened. ", "Add the red wine and bring to the boil. Reduce the heat until the mixture is simmering and cook until the volume of liquid has reduced by half. Add the remaining ingredients and bring to a simmer. Cover and continue to cook for 40-45 minutes, stirring occasionally, until tender.", "Remove the lid and cook for a further 5-8 minutes over a high heat, or until the liquid has evaporated and the red cabbage is slightly sticky and glossy. Season, to taste, with salt and freshly ground black pepper.", "Allow to cool slightly then transfer to a blender and blend until smooth.", "For the venison, preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a small ovenproof frying pan. Season the venison with sea salt and freshly ground black pepper and add to the pan. Fry quickly on all sides until lightly browned. Transfer to the oven to roast for 6-8 minutes, or until cooked to your liking. Set aside to rest before serving.", "To make the sauce, heat a saucepan and add the butter. Once hot, add the shallots, garlic and thyme leaves and fry for 1-2 minutes, or until softened.", "Add the rest of the ingredients, apart from the blackberries, and cook for 5-8 minutes, until reduced in volume. Just before serving pass through a sieve and add the liquid back to the pan and add a knob of butter and the blackberries.", "For the celeriac and baby beetroots, preheat two small frying pans. Once hot, add the oil and butter. Add the celeriac to one pan and the baby beetroots to the other and cook both for 6-8 minutes.", "For the potato galette, heat a small frying pan and add the butter, once melted place the spiralized potato in the frying pan. Cook on both sides for 3-4 minutes, until crisp and golden-brown.", "To cook the kale, heat the butter in a frying pan then add the kale and two tablespoons of water and cook until the kale is wilted down.", "To serve, place the red cabbage purée on the plates with the potato galette. Put a spoonful of the kale on top. Once the venison has rested cut it into pieces and put on the plates. ", "Place the celeriac and beetroots around the plates and spoon the blackberry sauce over the top."]}, {"isVegetarian": false, "title": "Venison with potato and parsnip gratin", "url": "www_bbc_co_uk_food_recipes_venison_with_potato_and_06201", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz unsalted butter, softened", "3 parsnips, peeled and thinly sliced", "3 potatoes, peeled and thinly sliced", "1 onion, sliced", "3 garlic cloves, sliced", "300g/10½oz gruyère, grated", "300g/10½oz strong cheddar, grated", "200g/7oz Stilton, crumbled", "3 fresh thyme sprigs, leaves removed", "1 litre/1¾ pints double cream ", "pinch grated fresh nutmeg", "pinch salt", "pinch white pepper ", "100ml/3½fl oz olive oil", "1 fresh oregano sprig, leaves removed ", "1 tbsp garlic purée", "800g/1lb 12oz venison rump ", "150ml/¼ pint red wine", "150g/5½oz unsalted butter, diced", "salt and freshly ground black pepper"], "serves": "Serves 6–8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C/Gas 6. Grease a deep baking dish with the butter. ", "Alternately layer the parsnips, potatoes, onion and garlic in the dish, sprinkling between each layer with a mixture of all three cheeses and a few thyme leaves. Continue to layer until all of the ingredients have been used up, reserving a few thyme leaves and some cheese. ", "Place the cream in a saucepan with the reserved thyme leaves, nutmeg, salt and white pepper and heat for a few minutes, until warm. Pour the cream into the baking dish, making sure the cream has properly soaked through all the layers. ", "Scatter the reserved cheese over the top, cover with kitchen foil and bake for 1½ hours, or until the vegetables are tender. Remove the foil and crisp the top for a further 20 minutes. Leave to stand for 30 minutes before serving. Keep the oven on.", "For the venison, blitz the oil, oregano and garlic purée in a small food processor. Season with salt and pepper. Rub the paste all over the venison rump.", "Place a frying pan over a high heat, add the rump and seal on all sides. Place the rump in a roasting tin and cook in the oven for 8–10 minutes. Leave to rest for a further 10 minutes before carving. ", "Transfer the juices from the roasting tin to a saucepan and place over a medium heat. Add the red wine and simmer until reduced by half. Whisk in the butter until you have a thick consistency. Season with salt and pepper.", "Cut the venison into slices and place on warmed plates with the gratin on the side. Spoon the sauce over the venison and serve immediately. "]}, {"isVegetarian": false, "title": "Venison with mole and cheese quesadillas", "url": "www_bbc_co_uk_food_recipes_venison_with_mole_and_40040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sweet potatoes, cleaned", "2 x 180g/6oz venison loins, trimmed ", "3 tbsp olive oil", "4 sprigs of thyme", "50g/1¾oz butter", "50ml/2fl oz pomegranate molasses", "2 ancho chilles, cleaned", "2 pasilla chilles, cleaned", "3 guajillo chilles, cleaned", "½ cinnamon stick", "1 star anise", "1 tsp cumin seeds", "50g/1¾oz peanuts", "50g/1¾oz almonds", "50g/1¾oz sesame seeds", "3 tbsp olive oil ", "1 onion, cut into chunks", "2 garlic cloves, crushed", "1 red chilli, chopped", "2 tomatoes, chopped", "little chicken stock", "50g/1¾oz dark chocolate, minimum 70% cocoa solids, chopped", "salt and pepper", "2 large tortillas ", "50g/1¾oz curd cheese", "50g/1¾oz corn relish ", "100g/3½oz smoked cheese, grated"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Bake the sweet potatoes until just cooked but firm. Peel and cut into thick rounds, then set aside. ", "Meanwhile, for the mole, place a dry frying pan over a high heat. Add the ancho, pasilla and guajillo chillies and toast for 1-2 minutes, until puffed up, taking care not to burn them. Fill a bowl with hot water, then drop in the chillies and leave to soak for 20-30 minutes before deseeding and chopping them.", "Return the dry frying pan to a high heat and toast the cinnamon, star anise, cumin seeds, peanuts, almonds and sesame seeds until aromatic. Grind in a pestle and mortar. ", "Heat the olive oil in a saucepan over a high heat. Add the onion, garlic, red chilli and tomatoes and cook until slightly charred. Add the hydrated chillies and cook for a few minutes. Tip the sauce into a blender and, when almost smooth, add the spice and nut mixture and a little chicken stock. Transfer to a saucepan, bring to the boil, then simmer for 2 minutes - you may need to loosen the sauce with some extra stock. ", "Meanwhile, heat an ovenproof frying pan over a high heat. Rub the venison all over with the olive oil and season well with salt and pepper. Put in the pan, add the thyme and roast in the oven for 6-8 minutes.", "Put the sweet potato slices on a baking tray, add the butter and pomegranate molasses, and roast for 5 minutes. ", "For the quesadillas, heat a large frying pan over a medium heat. Spread the tortillas with the curd cheese and then the corn relish. Top with the smoked cheese and then the second tortilla. Place in the pan and put a weight on top. Cook for 1 minute, until it smells toasty, then flip over and cook the other side while it’s weighted down. Remove from the pan and cut into eighths.", "Stir the chocolate into the mole. Carve the venison. Put sweet potato slices on the plates, top with the venison and serve with the mole and quesadillas"]}, {"isVegetarian": false, "title": "Venison with red cabbage slaw", "url": "www_bbc_co_uk_food_recipes_venison_with_red_cabbage_54866", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_with_red_cabbage_54866_16x9.jpg", "ingredients": ["150g/5½oz red cabbage, shredded", "1 eating apple, peeled, cored and finely diced", "½ small red onion, finely chopped", "25g/1oz raisins, soaked in hot water for 10 minutes", "½ tsp capers, drained and rinsed", "1½ tbsp olive oil, plus extra for frying", "½ tbsp red wine vinegar", "2 x 150g/5½oz venison loins or steaks", "knob of unsalted butter", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "In a large bowl, mix together the cabbage, apples, onion, raisins and capers.", "Mix the oil and vinegar in a clean bowl to make a vinaigrette. Add to the slaw, reserving a little vinaigrette for serving. Season the slaw with salt and pepper, cover and leave to marinate for at least 10 minutes.", "Meanwhile, season the venison with salt. Heat a dash of oil and the butter in a large frying pan until foaming. Cook the venison until brown on all sides. Transfer it to the oven for 4 minutes, then leave it to rest.", "To serve, mix the parsley into the slaw. Slice the venison. Spoon the slaw onto two plates and top with slices of venison. Finish with the remaining vinaigrette."]}, {"isVegetarian": false, "title": "Venison with winter vegetables, crispy seaweed and parsley", "url": "www_bbc_co_uk_food_recipes_venison_with_winter_10477", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, for frying", "300g/10½oz smoked pancetta, cut into cubes", "12 baby onions", "3 salsify, peeled and cut into cubes", "325ml/11fl oz port", "500ml/18fl oz red wine", "1 tbsp caster sugar", "1 tbsp redcurrant jelly", "8 venison loin cutlets", "knob of butter", "1 tbsp green peppercorns", "1 nori sheet", "½ bunch flatleaf parsley, finely chopped, to garnish", "2 tbsp parsley oil, to garnish ", "1 medium cooked beetroot, peeled and thinly sliced, to garnish", "1 raw candied beetroot, peeled and thinly sliced, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a little olive oil in a large saucepan and gently fry the pancetta until golden. Add the onions, salsify, port and red wine. Bring to the boil then add the sugar, redcurrant jelly and a pinch of salt. Cover and simmer over a low heat for 15–20 minutes, or until the vegetables are tender.", "Meanwhile, preheat the oven to 180C/160C Fan/Gas 4. ", "Heat a little oil in an ovenproof frying pan. Fry the venison for 3 minutes on each side. Add the butter to the pan and, when melted, glaze the venison. Add the peppercorns and transfer to the oven for 3 minutes, or until cooked to your liking, then set aside to rest. ", "Dip the nori in water, drain and dry. Heat a deep fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended) and then deep fry until crisp. Season with salt and pepper.", "To serve, arrange the port and wine glazed vegetables on serving plates. Slice the venison cutlets and arrange on top of the vegetables. Garnish with crispy seaweed, chopped parsley, parsley oil, cooked beetroot, candied beetroot and buttered peppercorns. "]}, {"isVegetarian": false, "title": "Venison alla Milanese with roasted butternut squash and herb pesto", "url": "www_bbc_co_uk_food_recipes_venisonallamilanesew_89977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp fresh white breadcrumbs", "2 tbsp chopped fresh parsley", "1 tbsp chopped fresh thyme leaves", "pinch chilli flakes", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp butter", "85g/3oz venison, flattened out with a meat mallet or rolling pin", "1 free-range egg, beaten", "½ butternut squash, peeled and chopped", "3 tbsp olive oil", "salt and freshly ground black pepper", "4 tbsp olive oil", "2 tbsp chopped fresh parsley", "2 tbsp chopped fresh basil ", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the venison alla Milanese, place the breadcrumbs, herbs, chilli flakes and salt and freshly ground black pepper into a food processor and pulse until just combined. ", "Heat the olive oil and butter in a frying pan. Dip the venison into the beaten egg, then coat in the breadcrumb mixture and fry for 3-4 minutes on each side, or until golden-brown and cooked through.  ", "For the roasted squash, blanch the squash in a pan of boiling salted water for 4-5 minutes, then drain. Transfer to a roasting tin, drizzle over the olive oil and season well with salt and freshly ground black pepper. Place into the oven to roast for 10-12 minutes, or until golden and tender.", "For the herb pesto, place all of the pesto ingredients into a food processor and blend until smooth.", "To serve, place the venison on a serving plate and spoon the roasted squash alongside. Drizzle the herb pesto around the edges of the plate to garnish."]}, {"isVegetarian": false, "title": "Venison and glazed onion pies with balsamic gravy", "url": "www_bbc_co_uk_food_recipes_venisonandglazedonio_85858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz flour, plus extra for dusting", "100g/3½oz butter", "2 free-range eggs, plus one extra, beaten, for brushing", "2 tbsp water", "1 tbsp olive oil", "½ red onion, chopped", "1 garlic clove, chopped", "200g/7oz venison fillet, cut into bite-sized pieces", "6 tbsp red wine", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper ", "1 tbsp dark chocolate, grated", "sprigs fresh rosemary, to garnish"], "serves": "Makes 2 small pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour, butter, two of the eggs and the water into a food processor and pulse until the mixture comes together to form a dough.", "On a lightly floured surface, roll out the dough to 0.5cm/¼in thick and cut out two circles to fit over a small ovenproof dish.", "Place the discs onto a non-stick baking sheet and brush with beaten egg. Transfer to the oven and bake for 8-10 minutes, or until lightly golden-brown.", "For the filling, heat the oil in a frying pan and gently fry the onion until softened but not coloured. Add the garlic and cook for one minute.", "Add the venison and cook, stirring frequently, until browned all over.", "Add the wine and vinegar and simmer until reduced by half. Season with salt and freshly ground black pepper, add the chocolate and stir until melted.", "Divide the filling between two small ovenproof dishes and top each one with a pastry disc.", "Transfer to the oven and bake for ten minutes, or until the pastry is crisp and golden-brown and the filling is cooked through.", "To serve, place the pies onto plates and garnish with a sprig of rosemary."]}, {"isVegetarian": false, "title": "Venison casserole", "url": "www_bbc_co_uk_food_recipes_venisoncasserole_83746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venisoncasserole_83746_16x9.jpg", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "2 onions, diced", "4 garlic cloves, crushed", "4 rashers smoked bacon, chopped", "500g/1Ib 2oz chestnut mushrooms, halved", "2.5kg/5½lb haunch or shoulder of venison, diced", "½ bottle red wine", "400ml/14fl oz water", "2 beef stock cubes, crumbled", "3 tbsp redcurrant jelly", "salt and freshly ground black pepper, to taste", "50g/2oz cornflour", "punnet redcurrants, to decorate", "6 sprigs rosemary or thyme, to decorate", "new potatoes ", "wilted spinach"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "On the hob, heat the olive oil and butter in a large lidded casserole dish. Add the onions and cook until softened, but not browned. ", "Add the garlic, bacon and mushrooms and cook for a further minute. ", "In a frying pan, brown the venison a handful at a time and add to the casserole. When all the meat is browned, add the red wine, water, stock cubes, redcurrant jelly and salt and pepper.", "Bring to the boil and stir well. Put the lid on the casserole and place in the middle of the oven - cook for 90 minutes.", "Remove from the oven. Make a paste with the cornflour and two tablespoons of water. Add as much of the paste to the casserole as is needed to thicken the sauce - add a little at a time if you are not sure how much you will need.", "Transfer the casserole to the hob, and, on a low heat, cook until the gravy has thickened - this will take about five minutes.", "Serve with new potatoes and wilted spinach. Decorate each plate with a sprig of rosemary or thyme and a bunch of fresh redcurrants."]}, {"isVegetarian": false, "title": "Venison chilli", "url": "www_bbc_co_uk_food_recipes_venisonchilli_86999", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "450g/1lb venison shoulder, trimmed and cut into large pieces", "1 onion, finely chopped", "1 red pepper, chopped", "1 green pepper, chopped", "1 stick celery, chopped", "8-10 red chillies, chopped", "250g/8½oz mushrooms, sliced", "1 garlic clove, crushed", "1 tbsp tomato purée", "pinch ground cumin", "pinch ground paprika", "150ml/5fl oz game or beef stock", "125ml/4½fl oz red wine", "400g/14oz canned chopped tomatoes", "salt and freshly ground black pepper", "50g/1¾oz dark chocolate, grated", "plain rice, cooked according to packet instructions", "4 soft flour tortillas"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a non-stick frying pan until hot and add the venison. Fry the meat for a few minutes on each side, until golden-brown all over. Remove the venison from the pan and set aside to keep warm.", "In the same frying pan, add the onions, red and green peppers, celery, red chillies, mushrooms and garlic and fry until the vegetables are soft but not coloured.", "Add the tomato purée to the pan, then turn down the heat and gently fry for a further ten minutes. ", "Add the spices, stock, red wine and canned chopped tomatoes to the pan and bring to the boil. ", "Return the venison to the pan and add the grated chocolate. Reduce the heat to very low and simmer for one hour, or until the venison is tender.", "To serve, place the venison chilli onto plates. Spoon some plain rice alongside and serve with the soft flour tortillas."]}, {"isVegetarian": false, "title": "Venison kebabs", "url": "www_bbc_co_uk_food_recipes_venisonkebabs_79138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 venison sausages, skin removed", "6 prunes", "3 wooden skewers ", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Start by rolling the venison meat into nine small balls. ", "Take a skewer and alternately place a venison ball then a prune; each skewer should have three venison balls and two prunes.", "Heat a frying pan add the oil and gently brown the kebabs.", "Place into the preheated oven for six minutes and serve."]}, {"isVegetarian": false, "title": "Venison meatballs", "url": "www_bbc_co_uk_food_recipes_venisonmeatballs_89798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "125ml/4fl oz milk", "450g/1lb minced venison steak", "200g/7oz breadcrumbs", "75g/3oz parmesan, grated ", "1 garlic clove, finely chopped", "1 tbsp vegetable oil", "1 tbsp vegetable oil", "1 onion, finely chopped", "1 carrot, finely chopped", "1 stick celery, finely chopped", "4 garlic cloves, finely chopped", "150g/5oz tomato purée", "450ml/¾ pint red wine", "450ml/¾ pint chicken stock", "2 sprigs fresh rosemary", "spaghetti, cooked according to packet instructions", "parmesan, freshly grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, beat the eggs and milk together in a bowl. Add the minced venison, breadcrumbs, parmesan and garlic and mix well.", "Mould the meatball mixture into balls, each the size of a golf ball.", "Place the meatballs onto a plate or tray and chill in the fridge for 20 minutes.", "Heat the oil in a frying pan over a medium heat.", "Remove the meatballs from the fridge and place into a hot frying pan. Fry for 8-10 minutes, or until golden-brown all over.", "For the ragu, heat the oil in a separate frying pan. Fry the onion, carrot, celery and garlic for 5-6 minutes, or until softened. ", "Add the tomato purée and cook for a further 7-8 minutes, until the sauce is thick and deep red in colour.", "Add the wine, chicken stock and rosemary and bring to boil. Reduce the heat and simmer for 45 minutes to an hour. ", "Add the meatballs to the sauce and simmer for 5-6 minutes, until the meatballs are completely cooked through.", "To serve, place a generous portion of cooked spaghetti into each serving bowl. Spoon over equal amounts of the meatballs and sauce, and finish with grated parmesan."]}, {"isVegetarian": false, "title": "Venison with blueberries", "url": "www_bbc_co_uk_food_recipes_venisonwithblueberri_86030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz blueberries", "3 tbsp white wine or sherry", "pinch sugar", "½ tbsp balsamic vinegar", "2 tbsp orange juice", "salt and freshly ground black pepper", "1 tsp butter", "knob butter ", "1 tsp olive oil", "2 venison steaks"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, set aside 4-6 blueberries for garnish and place the remaining blueberries in a small heavy-based pan with the wine or sherry and sugar. ", "Simmer over a low heat for about ten minutes, until the blueberries reach a mushy consistency. Add the vinegar, orange juice and salt and freshly ground black pepper to taste. Stir in the butter and keep the sauce warm.", "While the sauce is simmering, prepare the venison. In a frying pan, melt the butter and oil over a medium heat and add the venison to the pan. Fry the venison for 3-5 minutes on each side, until cooked to your liking. Leave the venison to rest in a warm place for at least five minutes before serving.", "Place the venison steaks on two plates, spoon over the sauce and garnish with the remaining blueberries. Serve straightaway."]}, {"isVegetarian": true, "title": "Versatile vegetable stew", "url": "www_bbc_co_uk_food_recipes_versatile_vegetable_stew_50136", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/versatile_vegetable_stew_50136_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely diced", "2 leeks, split lengthways up to the root several times, washed under running cold water then sliced thickly", "2 carrots, cut into 1cm/½in dice", "2 garlic cloves, finely diced", "1 tsp sweet smoked paprika", "½ tsp dried thyme", "2 potatoes, peeled, cut into 1cm/½in dice", "600ml/21fl oz vegetable stock", "½ head cauliflower, cut into small florets", "200g/7oz fine green beans, cut into 2cm/¾in pieces", "1 x 400g/14oz tin baked beans", "2 tbsp roughly chopped flatleaf parsley", "crusty bread, to serve", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan or saucepan until medium hot, add the olive oil, onion and leeks and cook gently for 5 minutes until just softened.", "Add the carrots, garlic, paprika and thyme and stir to combine. Cook for 5 minutes.", "Add the potatoes and vegetable stock and bring to the boil. Turn the heat down and simmer for 5 minutes until the potatoes are just softening then add the cauliflower and simmer for another 5 minutes.", "By now, all the vegetables should be nearly cooked. Add the green beans and baked beans and cook for 3 minutes then stir in the chopped parsley and season well with salt and pepper.", "Serve with plenty of crusty bread."]}, {"isVegetarian": true, "title": "Very summery summer pudding", "url": "www_bbc_co_uk_food_recipes_very_summery_summer_11544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strawberries, hulled and quartered", "500g/1lb 2oz raspberries", "175g/6oz caster sugar", "250ml/9fl oz Pimm’s", "1 large white sandwich loaf, crusts removed and cut into 16 slices then halved diagonally", "1 tbsp finely chopped fresh mint", "250g/9oz strawberries, hulled and halved", "75g/2½oz redcurrant jelly ", "200ml/7fl oz clotted cream ", "200g/7oz strawberries", "mint sprigs, to garnish (optional)"], "serves": "Serves 8–10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the berries, sugar and Pimm’s in a medium saucepan and bring to a gentle simmer, stirring occasionally until the sugar dissolves. Cook for 2 minutes, then remove the pan from the heat and set aside to cool. Strain the berries over a large bowl, reserve the syrup and set the berries aside.", "Brush one side of each bread piece with the syrup. Position 24 of the bread slices, syrup-side down, around the base and sides of the pudding basin, overlapping as you go. Set aside the remaining 8 slices of bread. ", "Stir the mint through the reserved berry mixture and spoon into the basin. Arrange the reserved bread slices on top and cover with cling film. Place a small plate on top of the pudding, weigh down with tins or other weights, and refrigerate overnight.", "Place the remaining syrup, strawberries and redcurrant jelly in a small saucepan. Bring to the boil and simmer, uncovered, for 5 minutes, or until the syrup has thickened slightly. Allow to cool and refrigerate until needed.", "Turn the pudding on to a serving plate and brush with the syrup. ", "To serve, cut the pudding into thick wedges and serve with the remaining syrup, the clotted cream, extra fresh berries and a sprig of mint, if using.  "]}, {"isVegetarian": false, "title": "Vermicelli-wrapped prawns with lemon basil mayonnaise", "url": "www_bbc_co_uk_food_recipes_vermicelli-wrapped_87793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/4oz vermicelli pasta", "2 tbsp olive oil", "12 raw tiger prawns, shelled", "1 large bunch basil, leaves only", "salt and freshly ground black pepper", "1 lemon, zest and juice", "2 handfuls fresh basil leaves", "2 free-range egg yolks", "1 tsp white wine vinegar", "1 tsp Dijon mustard", "200ml/7floz rapeseed or light olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, preheat a deep-fat fryer to 180C/350F.", "Cook the vermicelli in boiling water for 2-3 minutes, or until just softened. Drain and refresh in iced water, then drain once more. Pat dry with kitchen paper and mix with a little of the olive oil.", "Wrap each prawn in a basil leaf, then wrap with 4-5 vermicelli strands.", "Carefully lower the prawns into the deep-fat fryer and cook for 2-3 minutes, or until the prawn is cooked through and the pasta is crisp and golden-brown. Repeat with the remaining prawns.", "Remove the prawns from the deep-fat fryer, set aside to drain on kitchen paper and season with a little salt and freshly ground black pepper.", "For the lemon basil mayonnaise, blend the lemon zest, basil leaves, egg yolks, vinegar and mustard in a food processor until smooth. While the motor is still running, slowly add the oil until the mixture has emulsified and all of the oil has been added.  Season with the lemon juice, salt and freshly ground black pepper.", "To serve, spoon the mayonnaise into the centre of the serving plates. Place three prawns onto each plate, then scatter over the remaining basil leaves and drizzle with olive oil."]}, {"isVegetarian": false, "title": "Venison with juniper berries, sour cherry sauce and pumpkin mash", "url": "www_bbc_co_uk_food_recipes_venisonwithjuniperbe_84738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 x 150g/5oz venison medallions, cut from the loin", "200ml/7fl oz red wine", "4-6 sprigs fresh thyme", "4-6 sprigs fresh rosemary", "1 garlic clove, peeled and crushed", "1 small shallot, finely chopped", "1 small carrot, finely chopped", "1 celery stalk, finely chopped", "8 white peppercorns", "10 juniper berries, crushed", "2 tbsp grapeseed oil", "salt and freshly ground black pepper", "20g/¾oz butter", "300g/10½oz fresh or frozen cherries, stones removed ", "2 tsp redcurrant jelly ", "½ tsp chopped fresh thyme", "110ml/4fl oz good chicken stock ", "600g/1lb 5oz King Edward potatoes (or similar floury potatoes), peeled and chopped ", "600g/1lb 5oz butternut squash, peeled and chopped", "5 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the venison, place all of the venison ingredients, except the grapeseed oil and the salt and freshly ground black pepper, into a large bowl, mix well, and place into the fridge to marinate overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the venison from the marinade, and pat dry with kitchen paper. Reserve the marinade.", "Lightly brush the venison with one tablespoon of the grapeseed oil, and season with salt and freshly ground black pepper.", "Heat an ovenproof frying pan until hot, then add the remaining tablespoon of grapeseed oil and the venison. Cook for 1-2 minutes on each side, then transfer into the oven to roast for 10-12 minutes for rare, or longer if you like it medium to well done. Remove the venison when cooked to your liking and leave to rest in a warm place.", "For the sauce, return the pan that the venison was cooked in to the heat and add the butter. Strain out the vegetables from the marinade, reserving the liquid, and add to the pan to fry for 4-5 minutes.", "Add the cherries, redcurrant jelly, thyme, the stock and half of the marinade liquid. Bring to the boil and cook to reduce the liquid by half, then pass through a fine sieve into a bowl. Remove the cherries from the sieve and return them to the strained liquid.", "For the mash, place the potato and pumpkin into a large saucepan over a high heat and cover with water. Bring to the boil, add a pinch of salt, then reduce the heat and simmer for 15 minutes, or until the vegetables are tender.", "Drain the potatoes and butternut squash, then return to the pan on the heat for one minute, to drive off the extra moisture.", "Add the olive oil and mash the potato and butternut squash until smooth. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the mashed potato and butternut squash into the centre of each of six plates. Slice each venison medallion into three pieces and place three slices on top of each pile of mash, then spoon the sour cherry sauce over."]}, {"isVegetarian": false, "title": "Venison pie with red onion marmalade", "url": "www_bbc_co_uk_food_recipes_venisonpiewithredoni_89186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour", "1 tsp salt", "200g/7oz lard", "225ml/8fl oz milk", "225ml/8fl oz water", "dash olive oil", "2 banana shallots, finely sliced", "1 garlic clove, finely chopped", "450g/1lb minced venison", "2 free-range eggs, beaten", "1 tsp ground juniper berries", "½ tsp ground cloves", "1 tbsp thyme leaves", "1 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper ", "450g/1lb venison steak, thinly sliced", "12g leaf gelatine", "500ml/18fl oz chicken stock", "1 bay leaf", "10 peppercorns", "50g/2oz butter", "500g/1lb 2oz red onion, finely sliced", "1 garlic clove, roughly chopped", "50g/2oz caster sugar", "1 tsp thyme leaves, picked", "150ml/5fl oz red wine", "75ml/3fl oz good red wine vinegar"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the flour and salt into a bowl and make a well in the centre.", "Place the lard into a pan, along with the milk and water and bring to the boil.", "Pour the lard and water into the flour. Stir with a wooden spoon until thickened and all the flour is incorporated. ", "Knead the pastry on a floured work surface until smooth and elastic. Shape the pastry into a ball, wrap in cling film and place in the fridge, while you prepare the pie.", "For the pie, preheat the oven to 170C/340F/Gas 3.", "Heat a frying pan until hot, add the olive oil, shallots and garlic and fry for 2-3 minutes until softened and just turning golden-brown. Remove from the heat and cool.", "Place the minced venison, half of the egg, the ground juniper berries, ground cloves, thyme and parsley into a bowl and mix thoroughly, using your hands.", "Add the cooled shallots, season with salt and freshly ground black pepper and mix once more. Set aside.", "Remove the pastry from the fridge, roll it out with a rolling pin and press two-thirds of it into a game pie dish, reserving the remainder for the lid.", "Place a quarter of the mince mixture into the base of the lined dish, smoothing to the edges. Place one-third of the sliced venison on top and season with salt and freshly ground black pepper. Repeat with the remaining mince and steak, layering up to finish with a layer of mince.", "Place the remaining pastry on top and use your fingers and thumb to crimp the edges. Brush with beaten egg, reserving some of the egg, and make a hole in the centre of the pie with a sharp knife.", "Place in the oven to bake for 1½ hours. Remove and cool for 30 minutes.", "Increase the oven temperature to 190C/380F/Gas 5. Carefully remove the pie from the mould and place the pie onto a baking tray. Brush again with beaten egg, covering all sides. Return the pie to the oven for a further 20 minutes. Remove and cool.", "For the jelly, soak the gelatine leaf in a bowl of cold water until softened. Place the chicken stock, bay leaf and peppercorns into a saucepan and bring to a simmer.", "Add the gelatine leaf and simmer a little more until the gelatine has dissolved. Strain into a jug and then pour into the pie through the hole on the top, slowly, allowing the liquid to seep into the pie all the way through.", "Place in the fridge for at least one hour to cool completely. ", "For the red onion marmalade, heat a frying pan until hot, add the butter, chopped red onion and garlic and fry for 3-4 minutes, until just soft.", "Add the sugar and thyme, and cook slowly over a low heat for 20 minutes, or until soft and caramelised. Turn the heat up and add the red wine and red wine vinegar. Bring to a simmer and cook for a further 10-15 minutes until the liquid has evaporated. Season with salt and freshly ground black pepper. Leave to cool.", "To serve, slice the pie and serve it with the onion marmalade."]}, {"isVegetarian": false, "title": "Chicken breast with glazed carrots", "url": "www_bbc_co_uk_food_recipes_vichyglazedcarrotswi_83903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/1¾fl oz olive oil", "50g/2oz butter", "salt and freshly ground black pepper", "4 chicken breasts with skin", "500ml/17½fl oz mineral water ", "25g/1oz sugar", "1 tsp salt", "500g/1lb 2oz baby carrots ", "50g/2oz butter", "25g/1oz flatleaf parsley, chopped", "25g/1oz chopped chervil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Heat a frying pan until hot and add the olive oil and butter.", "Season the chicken and place in the pan skin side down.", "Fry for three minutes until golden then turn over and place in the oven.", "Roast for eight minutes until tender then remove and rest for five minutes.", "In a saucepan put the water, sugar, salt and butter then the carrots, bring to the boil and turn down to a  simmer.", "The carrots should have only a small amount of liquid left.  Remove the lid and allow to reduce until it's the consistency of a thick syrup on a high heat, then add the chopped herbs and serve with the chicken."]}, {"isVegetarian": true, "title": "Vichyssoise soup", "url": "www_bbc_co_uk_food_recipes_vichysoissesoup_83872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "1 onion, chopped", "300g/10½oz leek, finely sliced", "splash white wine", "110g/4oz potatoes, peeled and sliced", "290ml/10fl oz/½pint vegetable stock", "salt and freshly ground black pepper", "290ml/10fl oz/½pint milk", "2 tbsp cream", "handful snipped chives", "small handful chopped parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a medium saucepan. Add the onion and leek and cook until softened - about 10-15 minutes on a low heat. ", "Add a splash of white wine, the potatoes, stock and seasoning and simmer until the potatoes are tender.", "Liquidise using a hand-held blender, or transfer to a liquidiser. Pass through a sieve before adding the milk and cream.", "Chill in the fridge until ready to serve.", "Sprinkle with chives and parsley just before serving."]}, {"isVegetarian": true, "title": "Victoria sandwich shortbread", "url": "www_bbc_co_uk_food_recipes_victoria_sandwich_11498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["420g/15oz butter, softened", "160g/5¾oz  caster sugar, plus extra for sprinkling", "2 tsp vanilla extract", "420g/15oz plain flour, plus extra for dusting", "210g/7½oz  cornflour or rice flour", "230g/8¼oz unsalted butter, softened", "4 tbsp milk", "2 tsp vanilla extract", "450g/1lb icing sugar", "1kg/2lb 4oz small strawberries, hulled", "850g/1lb 14oz jam or preserving sugar", "1 lemon, juice only", "30 strawberries, hulled, thinly sliced"], "serves": "Makes 24 shortbread", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/160C Fan/Gas 3. Grease two baking trays and line with parchment.  ", "Cream the butter and sugar together in a bowl until pale and fluffy. Stir in the vanilla extract. ", "Sift and fold the flour and cornflour gradually until it binds together. Gently knead until just smooth (be careful not to over-work it). Wrap in cling film and place in the fridge for 30 minutes.", "Flour a work surface and roll out the dough to 5mm/¼in thick. Use a large cookie cutter to cut into 48 circles. Transfer to the prepared baking trays and bake for 15–20 minutes, or until pale golden-brown. ", "Sprinkle with the remaining caster sugar and leave to cool for 10 minutes. Carefully transfer to a wire rack.", "For the buttercream, put the butter, half the milk and all the vanilla extract in a large mixing bowl. Beat until smooth using an electric mixer. Sift over the icing sugar and, with the mixer on a low speed, continue mixing until smooth. Add a little more milk if required.", "For the jam, set aside a small handful of strawberries and mash the rest to a rough pulp. Pour the pulp into a wide, heavy-bottomed pan. Add the jam sugar and lemon juice and bring to the boil. Add the remaining strawberries and boil for about 5 minutes, see the tip section for how to check if the jam has set. Remove from the heat and skim off the pink scum. Leave to cool. ", "Put a layer of cream, then a layer of jam onto a shortbread and use another round to make a ‘sandwich’.  Fan the sliced strawberries on top. Repeat the process with the remaining shortbread, buttercream, jam and strawberries to make 24 sandwiches. "]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_36175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, softened", "225g/8oz caster sugar", "4 free-range eggs", "225g/8oz self-raising flour", "2 tbsp lemon juice", "1 punnet blackberries", "1 tbsp caster sugar", "1 tbsp blackberry liqueur, such as crème de mure (optional)", "250ml/9fl oz double or whipping cream", "2 tbsp icing sugar", "½ tsp ground cardamom", "¼ tsp ground allspice", "¼ tsp ground cinnamon", "¼ tsp ground mace"], "serves": "Makes 10-12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Butter and line 2 x 20cm/8in sandwich tins. Using a hand-held electric whisk or a stand mixer, cream the butter and sugar together until very light and fluffy – it should be almost mousse-like. This should take a good 5 minutes. ", "Add the eggs, one at a time, with a tablespoon of the flour, mixing lightly between each addition, then add the remaining flour. Add as much lemon juice as necessary to give a dropping consistency, then divide the mixture between the two tins. ", "Bake in the oven for between 20–25 minutes, or until the sponge has shrunk away from the sides slightly, is springy to touch and a very light golden-brown. Leave to cool in the tins for at least 10 minutes, then turn out onto a cooling rack.", "For the filling, put the blackberries in a bowl and sprinkle over the caster sugar and blackberry liqueur, if using. Leave to marinate for a short while – they will give out some juices.", "For the spiced cream, whip the cream in a bowl, then fold in the icing sugar and spices – the cream needs to be just beyond the soft peak stage. ", "To assemble, pile the spiced cream onto one of the sponges. Top with the blackberries and pour over any juices. Place the remaining sponge on top. Dust with icing sugar or caster sugar and serve."]}, {"isVegetarian": true, "title": "Victoria sponge cake with strawberry compôte, fresh cream and caramel dipped strawberries", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_cake_11622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz butter, at room temperature, plus extra for greasing", "250g/9oz caster sugar", "pinch salt", "5 free-range eggs", "250g/9oz self-raising flour, plus extra for dusting", "500g/1lb 2oz strawberries, hulled and cut in half if large", "500g/1lb 2oz jam sugar", "½ lemon, juice only", "100g/3½oz sugar", "150g/5½oz strawberries, stems left on ", "400ml/14fl oz double cream, whipped", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Victoria sponge, preheat the oven to 190C/375F/Gas 5. Lightly grease and flour two 20cm/8in loose-bottomed sponge tins, at least 4cm/1½in deep, and line the bases with baking parchment.", "Beat together the butter, sugar and a pinch of salt until pale and well creamed. Gently whisk the eggs in a small bowl and then add them, a little at a time, to the creamed butter mixture. Fold in the flour and divide the mixture between the two lined tins.", "Bake for 25-30 minutes or until well-risen and golden-brown on top. Remove from the oven and turn the cakes out onto a wire cooling rack. Peel off the baking parchment and leave to cool completely.", "For the strawberry compôte, tip the strawberries, sugar and lemon juice into a large pan and stir over a moderate heat for 2-3 minutes, or until the sugar has dissolved. Turn up the heat and boil for five minutes – this is an “instant jam” so you don’t have to check for setting point. Remove from the heat, pour into a tray and set aside to cool.", "For the caramel dipped strawberries, heat the sugar in a small pan over a moderate heat until it starts to turn a pale caramel colour. Remove from the heat and, holding the stems, carefully dip the strawberries into the caramel. (CAUTION: sugar gets very hot. Take care not to burn yourself.) Set aside on a non-stick mat or greaseproof paper to cool.", "To serve, put the whipped cream in a piping bag. Place one of the sponges on a plate or cake stand and spread with the jam and pipe the cream on top of the strawberry jam. Place the second sponge on top and dust with icing sugar. Finish by arranging the caramel-dipped strawberries on top of the cake."]}, {"isVegetarian": true, "title": "Victoria sponge with mixed berries", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_with_18011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz butter, plus extra for greasing", "350g/12oz caster sugar", "4 large free-range eggs", "½ tsp vanilla bean paste", "200g/7oz self-raising flour, plus extra for dusting", "375g/13oz ripe strawberries, hulled and cut into quarters", "300g/10½oz fresh raspberries", "300g/10½oz fresh blackberries", "150g/5½oz fresh redcurrants, stems removed", "500ml/18fl oz double cream, very lightly whipped", "1-2 tsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease 2 x 20cm/8in springform cake tins with butter and dust with flour.", "In a bowl, beat the butter and 200g/7oz of the sugar together using an electric whisk until pale and fluffy. ", "Beat in the eggs one at a time, making sure each is fully incorporated into the mixture before adding the next. Add a little flour to the mixture if it starts to curdle.", "Beat in the vanilla bean paste, then fold in the flour until just combined. ", "Divide the mixture equally between the prepared cake tins and smooth the tops.", "Bake the cakes in the oven for 20-25 minutes, or until golden-brown and risen. A skewer inserted into the centre of the cakes should come out clean; if it doesn’t, return them to the oven for a further 5 minutes and check again. ", "Turn the cakes out onto a tea towel-lined wire rack and set aside to cool.", "Meanwhile, dissolve the remaining 150g/5½oz caster sugar in 150ml/5fl oz water in a saucepan. Bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 5 minutes, or until it resembles a light syrup. ", "Mix the berries and redcurrants together in a bowl, then stir all but a handful into the syrup, until they have softened but not broken down and the mixture resembles a compôte. Remove from the heat and set aside to cool.", "When the cake and compote have both cooled, place one cake on a serving plate. Spread compôte over it, followed by the whipped cream, then spoon a little more compôte on top.", "Gently set the second cake on top of the filling and dust the surface with icing sugar. Garnish the cake with the remaining berries. Serve immediately."]}, {"isVegetarian": false, "title": "Victoria's crown", "url": "www_bbc_co_uk_food_recipes_victorias_crown_99544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs, separated", "300g/10½oz golden caster sugar ", "3 tsp vanilla paste", "270g/9¾oz plain flour", "50g/1¾oz icing sugar", "400g/14oz rhubarb, trimmed and roughly chopped", "4 pieces stem ginger in syrup, finely chopped", "120g/4¼oz caster sugar", "5 sheets leaf gelatine", "400g/14oz rhubarb, trimmed and roughly chopped", "250g/9oz caster sugar", "270ml/9½fl oz full-fat milk", "5 tsp vanilla paste", "800ml/1⅓ pint double cream", "10 large egg yolks", "15 sheets gelatine", "reserved juice from roasted rhubarb", "red food colouring", "1 bag of ice", "110g/4oz fresh ginger, thinly sliced", "160g/5¾oz golden granulated sugar", "4-5 lemon verbena leaves ", "5 sheets gelatine", "50g/1¾oz caster sugar ", "50g/1¾oz fondant icing sugar ", "edible gold spray", "edible silver balls", "2 large clear edible diamonds, 2cm/¾in diameter (optional)", "24 clear edible diamonds, 1cm/½in diameter (optional)"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": [" Line 4 large baking trays and a 23cm/9in springform cake tin with baking parchment. On one tray draw a 15cm/6in circle and 2 matching semicircles, 1 with a cross attached to the top. Draw 4 matching quarter circles. On 2 baking trays draw 35-40 9cm/3½in long lines spaced well apart. Finally draw a 23cm/9in circle on the remaining tray.", "For the savoiardi, beat the egg whites until stiff peaks form when the whisk is removed. Gradually add 200g/7oz caster sugar, beating all the time. Beat for a couple of minutes until thick and well combined.", "In a separate bowl, beat the egg yolks with the remaining caster sugar and the vanilla paste until pale and doubled in volume. Carefully fold the yolk mixture into the egg whites. Sift in the flour and carefully fold in.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Spoon the mixture into a large piping bag fitted with a 12mm/½in plain nozzle. Start piping the shapes onto the templates. For the 23cm/9in circle pipe a spiral starting from the outside into the middle so it is entirely covered in batter (this will make the base).  Pipe the outline of the other shapes and then pipe out at least 35 fingers making some of them a bit thinner than most. ", "Dust all the fingers and shapes with icing sugar and bake for approximately 20 minutes. Once cooked, carefully remove from the trays and set aside to cool on wire racks. ", "For the compôte, mix the rhubarb, stem ginger and caster sugar together on a baking tray. ", "For the bavarois cream, put the rhubarb on a baking tray and cover it with 150g/5½oz caster sugar. Roast both the trays of rhubarb for 15 minutes.", "Put the milk, vanilla paste, the remaining 100g/3½oz caster sugar and half the cream in a large saucepan and bring to a simmer. Meanwhile, put the egg yolks in a mixing bowl and beat until doubled in volume and pale. Soak the gelatine in a dish of water.", "Pour half the hot milk mixture onto the egg yolks, whisking all the time. Return all the mixture back to the pan and gently heat until thick enough to coat the back of a wooden spoon.", "Squeeze out any excess water from the gelatine, then add it to the custard and mix thoroughly until dissolved.", "Transfer the roasted rhubarb for the bavarois to a blender and pulse until smooth. Put the purée in a sieve and push through into the custard. Stir well and add a few drops of red food dye so it becomes a pale pink colour.", "Whip the remaining 400ml/14fl oz double cream until soft peaks form when the whisk is removed. Gently stir into the custard. Put the ice in a large bowl of cold water. Put the saucepan in the iced water to reduce the temperature as quickly as possible. Once cold, put in the fridge until almost set.", "For the compôte, soak the gelatine in cold water. Put the roasted rhubarb in a saucepan and gently warm through. Squeeze any excess water from the gelatine then add it to the pan. Stir until the gelatine is dissolved then set aside to cool.", "To assemble the russe, line the collar of a 23cm/9in springform tin with baking parchment. Place the large circle of savoiardi on a serving plate and put the collar on top. Trim one end of the savoiardi fingers so they are all the same length.", "Make a syrup by gently warming the caster sugar in 50ml/2fl oz water. Keep heating until the sugar is dissolved.", "Dip each side of the savoiardi fingers in the syrup. Place the fingers cut-end down around the edge of the springform tin. They should be tightly packed so they remain upright without support.  Pour half of the compôte into the bottom of the tin and put it in the fridge until set (alternatively freeze it for 30 minutes to speed up the process).", "To assemble the crown that sits on top of the finished russe. Mix up the fondant icing sugar with a dribble of water to make a thick paste. Use this paste to 'glue' together the remaining savoiardi. First stick the quarter-circles together back to back, then stick the two semi-circles together in the same way (with the cross at the top). Allow to set. ", "When set, use the circle as the base of the crown and balance the semi-circle across the top with the two quarter-circles propping it up up – trim the tops and bottoms of the semi circles and quarter circles if need be. Use the icing to ‘glue’ the pieces into place and allow to set. Cover the paste with cling film. ", "When set, spray the crown with edible gold spray. Pipe a thin line of fondant along the seams the semi-circles and quarter-circles and top with silver balls.", "When the bavarois cream is almost set, pour half of it on top of the compôte (in the ring savoiardi fingers) and put in the fridge or freezer until fully set.", "For the ginger jelly, place the ginger in a pan with 400ml/14fl oz water and the sugar. Boil for approximately 5 minutes, then remove from the heat and add the lemon verbena. Set aside to cool slightly.", "Soak the gelatine in a bowl of cold water for about 5 minutes. Pass the ginger syrup through a fine sieve. Squeeze any excess moisture from the gelatine then add to the ginger syrup. Chill until needed.", "Once the layer of custard is set, put the remaining compôte on top and chill again until set. ", "When the compôte is set,  put two-thirds of the remaining bavarois cream on top and chill to set.", "Take the reserved bavarois cream and add a small amount of red food dye. Put it in a piping bag fitted with a small star nozzle and pipe a pattern on top of the custard. Chill to set.", "When the ginger jelly is semi set, pour it on top of the layer of set custard. Gently smooth the surface.", "To decorate the crown, stick the 2 large 'diamonds' on the centre of each side of the cross using the royal icing to glue them in place. Then use small diamonds to further decorate. Put the russe on a serving plate and remove the springform collar. Place the crown on top. ", "Put the remaining bavarois cream in a piping bag fitted with star nozzle and pipe stars around the base of the savoiardi fingers."]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoriasandwich_89617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz unsalted butter, plus extra for greasing", "250g/9oz golden caster sugar", "4 free-range eggs", "1 tsp vanilla extract", "250g/9oz self-raising flour ", "250g/9oz icing sugar", "125g/4oz unsalted butter, softened", "2 tsp hot water", "1 tsp ground cinnamon", "250g/9oz good raspberry jam", "icing sugar, for dusting"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "For the cake, grease two 23cm/9in spring-form cake tins and line with baking parchment.", "Whisk the butter and the sugar in a bowl, using an electric whisk, until light and creamy for about five minutes(the mixture should be almost white in colour).", "Add the eggs, one at a time, beating constantly until completely combined before adding the next egg. If the mixture starts to curdle you can rescue it by sprinkling in a tablespoon or so of the flour.", "Add the vanilla extract and fold in the flour.", "Divide the mixture between the two cake tins and place into the oven to bake for 25-30 minutes, or until completely cooked through. Test the cake is cooked by inserting a metal skewer into the centre of the cake. If it comes out clean the cake is cooked.", "Remove from the oven and leave to cool for five minutes, then remove the cakes from the tins and leave to cool on a wire rack.", "Meanwhile, for the butter cream, place the icing sugar, softened butter and hot water into a clean bowl. Mix well until completely combined and creamy. ", "Add the cinnamon and mix well.", "To serve, trim the top off one of the cakes to make a level surface.", "Spread the raspberry jam over the top of the levelled cake surface, then cover the jam with a layer of the butter cream.", "Sandwich the second cake on the top and press down lightly.", "Dust the top of the cake with icing sugar and serve in generous slices."]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoriasponge_13555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriasponge_13555_16x9.jpg", "ingredients": ["225g/8oz butter or margarine, softened at room temperature", "225g/8oz caster sugar", "4 medium free-range eggs", "2 tsp vanilla extract", "225g/8oz self raising flour", "milk, to loosen", "200ml/7fl oz double cream", "250g/9oz mixed berries", "icing sugar, for dusting"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Grease and line 2 x 18cm/7in cake tins with baking paper. ", "Cream the butter and the sugar together in a bowl until pale and fluffy. ", "Beat in the eggs, a little at a time, and stir in the vanilla extract. ", "Fold in the flour using a large metal spoon, adding a little extra milk if necessary, to create a batter with a soft dropping consistency.", "Divide the mixture between the cake tins and gently spread out with a spatula. ", "Bake for 20-25 minutes, or until golden-brown on top and a skewer inserted into the middle comes out clean.", "Remove from the oven and set aside for 5 minutes, then remove from the tin and peel off the paper. Place onto a wire rack.", "Whip the cream with a whisk or electric handheld mixer until it forms soft peaks when the whisk is removed. ", "Sandwich the cakes together the whipped cream and berries. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Victoria sponge with fresh cream and jam", "url": "www_bbc_co_uk_food_recipes_victoriaspongewithfr_89029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["220g/8oz caster sugar", "220g/8oz butter, plus extra for greasing", "4 free-range eggs, beaten", "220g/8oz self-raising flour", "1 tsp vanilla extract", "4 tbsp strawberry or raspberry jam", "600ml/1 pint 2fl oz double cream, whipped", "icing sugar, to dust"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Grease and line two 23cm/9in cake tins. ", "Beat the sugar and butter together in a bowl until pale and creamy, then gradually add the eggs, alternating with a tablespoon of flour. Gently fold in the rest of the flour and vanilla extract, then divide equally between the two cake tins.", "Bake in the oven for 25-30 minutes, or until cooked through and lightly golden. Remove from the oven and turn out onto a wire rack to cool.", "When cool, spread one cake with jam and whipped double cream, then place the other cake on top. Dust with icing sugar and serve in slices."]}, {"isVegetarian": true, "title": "Victoria sponge with strawberry jam", "url": "www_bbc_co_uk_food_recipes_victoriaspongewithst_90309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriaspongewithst_90309_16x9.jpg", "ingredients": ["knob of butter, melted", "225g/8oz butter, softened", "225g/8oz caster sugar", "4 large free-range eggs", "225g/8oz self-raising flour, sifted (you may need a bit extra)", "6 tbsp good-quality strawberry jam", "300ml/10½ fl oz double cream, lightly whipped", "icing sugar, for dusting"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Gently heat the knob of butter in a pan and brush two 6in-7in/15cm-17.5cm cake tins with the melted butter. Line the bottom of the two cake tins with a circle of greaseproof paper.", "In a large bowl, cream together the butter and sugar until pale and creamy, using an electric whisk or a wooden spoon. Beat well to get lots of air into the mixture (this should take a couple of minutes).", "Beat in the eggs one at a time. Add a tablespoon of flour if the mixture curdles.", "Fold in the flour using a large metal spoon. Be careful not to over-mix it.", "Pour the mixture equally between the two cake tins and level off the top with a spatula. Make a slight dip in the centre with the tip of the spatula if you don't want them to be pointed in the middle.", "Place in the oven and bake for about 20 minutes, or until the cakes spring back when pressed gently with a finger and are pale golden in colour.", "Remove from the oven and take them out of the tins after about 5-10 minutes. Place them on a wire rack to cool completely (for about half an hour).", "Spread the sponge with the jam and the whipped cream, then carefully sandwich together.", "Dust with icing sugar and serve."]}, {"isVegetarian": false, "title": "Viennese gulasch", "url": "www_bbc_co_uk_food_recipes_viennese_gulasch_96419", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_gulasch_96419_16x9.jpg", "ingredients": ["100g/3½oz lard", "1.25kg/2lb 12oz onions, sliced", "2 garlic cloves, grated or finely chopped", "1 tbsp tomato purée", "2 tbsp sweet paprika", "1½ tbsp hot paprika, to taste", "½ tsp caraway seeds, crushed in a pestle and mortar", "1 tsp brown sugar", "1½ tsp salt", "12 turns of the black pepper mill", "2 tsp cider vinegar", "1.5kg/3lb 5oz shin of beef, cut into 3cm/1in pieces", "1 tbsp chopped flat leaf parsley"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the lard in a large pot and fry the onions until they are deep golden brown. Add the garlic, cook for a minute, then add the tomato purée, paprikas, crushed caraway seeds, sugar, salt, pepper and vinegar and cover with 1 litre/1¾ pints of water. ", "Bring to a boil, then add the beef. Turn down to a gentle simmer and cook for 2½  hours. Check the pan fairly frequently and stir, adding more water to cover the meat if necessary. Check the meat for tenderness, if not tender add a little more water and cook for a little longer. Remove the meat when done and, if needed, continue to cook the liquid to thicken the sauce.", "Serve sprinkled with a little chopped parsley with new potatoes, spatzle or dark rye bread."]}, {"isVegetarian": true, "title": "Viennese whirl biscuits", "url": "www_bbc_co_uk_food_recipes_viennese_whirls_78348", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_whirls_78348_16x9.jpg", "ingredients": ["250g/9oz very soft butter", "50g/2oz icing sugar, plus extra to decorate", "250g/9oz plain flour", "50g/2oz cornflour", "½ tsp pure vanilla extract", "100g/3½oz soft butter", "200g/7oz icing sugar, plus ½ tsp for dusting", "½ tsp pure vanilla extract", "75g/3oz seedless raspberry jam"], "serves": "Makes 32-36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C (fan)/Gas 5. Line a baking sheet with greaseproof paper.", "Put the butter, icing sugar, plain flour, cornflour and vanilla extract in a food processor and blend until smooth. You may need to scrape the mixture down a couple of times with a rubber spatula.  ", "Spoon the dough into a piping bag fitted with a large star nozzle. Pipe 16-18 x 6cm/2½in rosettes of the dough, spacing well apart. ", "Bake in the centre of the oven for 13-15 minutes or until pale golden-brown and firm. Cool on the baking tray for five minutes then transfer to a cooling rack. Repeat with the remaining dough to make 32-36 biscuits.", "For the filling, put the butter in a bowl and sift the icing sugar on top. Add the vanilla extract and beat with a wooden spoon or an electric whisk until very light and smooth. Spoon into a clean piping bag fitted with a large star nozzle. Put the jam in a bowl and stir until smooth. ", "Spoon a little jam onto the flat side of 16 of the biscuits and place jam-side up on the cooling rack. Pipe the buttercream icing onto the remaining biscuits and sandwich with the jam. Put on a serving plate and dust with sifted icing sugar. Serve."]}]