[{"isVegetarian": false, "title": "Fillet of mackerel with warm pak choi, beans and chilli jam", "url": "www_bbc_co_uk_food_recipes_fillet_of_mackerel_with_51845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel fillets, pin-bones removed", "2 pak choi, cut in half", "200g/7oz French beans, topped and tailed and cut into thirds", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 lime leaves", "2 lemongrass stalks, tough outer leaves removed, finely chopped", "25g/1oz root ginger, roughly chopped", "2 garlic cloves, peeled", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce", "40ml/3 tbsp sesame oil", "50ml/2 fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest", "150g/5½oz caster sugar", "110g/3¾oz crème fraîche", "4 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mackerel on a baking sheet and use a chef's blowtorch to quickly cook the mackerel (alternatively cook them under a very hot grill for a few minutes).", "Bring a large saucepan of water to the boil, then add the pak choi and string beans to blanch for 30 seconds. Drain, then transfer into very cold water to stop the cooking. Drain again and pat dry.", "Heat a large griddle pan and drizzle a little oil over the pak choi.  Cook on the hot griddle for a couple of minutes on each side until lightly charred. Remove the pak choi and keep warm. Drizzle a little oil over the string beans and griddle them for a few minutes until lightly charred.", "For the chilli jam, put all the chilli jam ingredients, except the sugar and crème fraîche, in a food processor and blend to a smooth purée.", "Heat the sugar in a heavy-based saucepan over a low to medium heat until it melts and forms a golden-brown caramel. Do not stir and keep an eye on it so that it doesn’t burn.", "Once the sugar has caramelised, carefully pour in the puréed chilli jam mixture and stir well (the mixture will bubble up a lot, so take care). Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool slightly.", "To serve, place a fillet of mackerel on one side of the plate and serve the pak choi and beans on the side. Drizzle the chilli jam over the fish and garnish with the coriander cress and a spoon of crème fraîche."]}, {"isVegetarian": false, "title": "Fillet of sea bass with ragoût of spring onion and sauce vierge", "url": "www_bbc_co_uk_food_recipes_fillet_of_sea_bass_with_81407", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/13oz potatoes", "1 small bulb fennel", "200g/7oz pancetta, cut into thin strips about 0.5cm/¼in thickness, then julienned", "salt and freshly ground black pepper", "4 x 150g/5oz sea bass fillets, pin boned", "dash olive oil, for frying", "1 bunch spring onions, peeled, finely sliced", "4 tbsp extra virgin olive oil", "1 shallot, chopped", "1 medium tomato, seeds removed, diced", "½ lime, juice only", "1 tbsp balsamic vinegar", "1 handful fresh flatleaf parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, preheat the oven to 180C/350F/Gas 4.", "Cook the potatoes and fennel bulb in a pan of boiling, salted water for 15 minutes, or until cooked but still firm.", "Strain, peel and cut the potatoes and fennel into thick slices.  Set aside.", "Blanch the pancetta in a pan of boiling water, then drain and refresh in cold water. Drain once more then place on kitchen paper to dry.", "Season the sea bass with salt and freshly ground black pepper. Heat a dash of olive oil in a frying pan until hot and cook the fish skin-side down for four minutes, or until the skin starts to be crisp. Turn the fish over and place onto an oven tray skin-side up, then place in the oven for a further six minutes.", "Meanwhile, add the potatoes, fennel and pancetta to the same pan you used to cook the fish and fry for a couple of minutes, or until the potatoes are slightly golden-brown.", "Add the spring onions and fry for a further two minutes - be careful not to break the potatoes. ", "For sauce vierge, briefly warm the olive oil in a small saucepan over a low heat for about 30 seconds.  Add the shallot and fry for two minutes. Remove from the heat, add the tomato, lime and balsamic vinegar and stir.  ", "At the last minute add the chopped flatleaf parsley and salt and freshly ground black pepper, to taste.  ", "To serve, spoon the ragoût onto the plate, top with the fish then drizzle the sauce vierge over."]}, {"isVegetarian": false, "title": "Fillet of sea trout with baby leeks, broad beans and asparagus", "url": "www_bbc_co_uk_food_recipes_fillet_of_sea_trout_with_74118", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "40g/1½oz shallots, finely chopped", "20g/¾oz mushrooms, finely chopped", "10g celery, finely chopped", "10g celeriac, peeled and finely chopped", "½ bottle champagne", "200ml/7fl oz chicken stock ", "200ml/7fl oz cream", "1 sprig parsley", "1 sprig thyme", "salt and pepper", "1 lemon, juice only", "½ small cauliflower", "250ml/9fl oz milk", "75g/2½oz butter", "75ml/2½fl oz cream", "4 x 150g/5½oz sea trout fillets, pin-boned", "1 tbsp olive oil", "20g/¾oz butter, plus extra for frying", "60ml/2¼fl oz vegetable stock", "12 asparagus spears, peeled and cut into three pieces on an angle", "12 baby leeks, cut into 5cm/2in lengths", "50g/1¾oz butter", "8 grelot onions or spring onions", "2 tsp sugar", "salt and freshly ground black pepper", "40g/1½oz broad beans, blanched and shelled", "1 tbsp finely chopped chives", "1 tbsp finely chopped chervil ", "salt and freshly ground black pepper ", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, fry the vegetables gently in a little of the butter until soft but not coloured.", "Add the champagne, and heat until reduced in volume to a syrup. Then add the chicken stock and cook until reduced to half the volume.", "Add the cream and herbs, bring to the boil and simmer for 5-10 minutes.", "Pass through a fine sieve and season with salt and pepper and finish with lemon juice.", "To make the cauliflower purée, cut the cauliflower florets into thin slices, place in a pan with the milk and 250ml/9fl oz water. Bring to the boil, and simmer until the cauliflower is tender.  Drain and place in a blender with a couple of tablespoons of the cooking liquid, the butter and cream, and blend to a purée. Season with salt and pass through a sieve. Keep warm.", "For the trout, cut the fish into squares and season with the salts.", "Heat the olive oil and a little butter in a frying pan and cook the fish skin-side down until golden-brown and just under-cooked. Add 20g/¾oz butter and half of the vegetable stock. Braise the fish in the stock until cooked through.", "For the broadbeans, leeks and asparagus, cook the leeks and asparagus in the remaining 30ml/1fl oz of vegetable stock with the butter, onions, sugar, salt and pepper until almost cooked. Add the broad beans and cook in the glaze for a few minutes more.", "To serve, spoon the cauliflower purée onto the centre of the plates. Dress the trout on top. Place the vegetables on top. Mix the sauce with a hand blender to aerate it and spoon the resulting foam over the fish. Garnish with the fresh herbs and season to taste with salt, pepper and lemon juice."]}, {"isVegetarian": false, "title": "Fillet of sole Saint-Germain with sauce remoulade", "url": "www_bbc_co_uk_food_recipes_fillet_of_sole_98546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 250g/9oz lemon sole fillets, skin removed", "400g/14oz new potatoes, scrubbed", "200g/7oz flour, seasoned with salt", "200ml/7fl oz clarified butter", "200g/7oz panko breadcrumbs", "110g/4oz butter, diced", "2 tsp finely chopped flat leaf parsley", "2 lemons, cut into wedges, to garnish", "2 free-range eggs, yolks only", "pinch salt", "20mls/1fl oz white wine vinegar", "2 tsp English mustard powder", "100g/3½oz sunflower oil", "100g/3½oz onion, finely chopped, ", "100g/3½oz cornichons or gherkins, finely chopped", "30g/1oz  anchovy, finely chopped", "2 tsp parsley, finely chopped", "10g/½oz  chives, finely chopped", "30g/1oz fine capers, finely chopped", "pinch cayenne pepper", "salt and freshly ground white pepper", "2 lemons, juice only", "110g/4oz capers, finely chopped", "150g/5oz gherkins, finely chopped", "½ shallot, finely chopped", "1 small bunch fresh dill, finely chopped", "2 tbsp fresh flat leaf parsley, finely chopped", "½ lemon, juice only", "1 bag fresh salad leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish, preheat the grill to high and lightly oil a baking tray.", "Place a pan of water on the hob and add the new potatoes, bring to the boil and cook for 10-12 minutes until soft.", "Place the fish down and score the back of the fish gently where the skin was, this will help stop it curling up as it cooks.", "Place the seasoned flour and clarified butter on separate plates. Now lay the fish in the seasoned flour, shake off any excess and then dip in the clarified butter. Ensure both sides of the fillet are coated. Now dredge the fish through the breadcrumbs.", "Place the fish on the prepared baking tray, sprinkle with a little more clarified butter and put under the grill to cook. It will not take long, maybe five minutes at the most.", "Drain the potatoes and toss through the diced butter, salt and pepper and chopped parsley.", "For the sauce base, place the egg yolks in a large bowl, add a pinch of salt and the vinegar and whisk with the mustard until light in colour, fluffy and thickened a little.", "Slowly drizzle in the sunflower oil very steadily, whisking all the time. When all mixed, check the seasoning and divide between two bowls.", "For the remoulade sauce, add the remoulade ingredients to one of the bowls of egg and oil mixture, mix well and season to taste with salt and freshly ground black pepper.", "For the tartare sauce, add the tartare ingredients to the other bowl, mix well, and season to taste with salt and freshly ground black pepper.", "To serve, lay your fish on serving plates with a spoonful of the new potatoes and a lemon wedge. Add the sauces on the side. Great served with a simple green salad. "]}, {"isVegetarian": false, "title": "Fillet steak with a spiced herb butter and fondant potatoes", "url": "www_bbc_co_uk_food_recipes_fillet_steak_with_a_94163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter, softened", "1 small shallot, finely chopped", "1 garlic clove, finely chopped", "2 tsp capers, finely chopped", "2 tsp finely chopped gherkins", "1 tsp finely chopped anchovies ", "1 tsp finely chopped chives", "1 tsp finely chopped chervil", "1 tsp finely chopped tarragon", "1 tsp finely chopped flatleaf parsley", "1 tsp thyme leaves", "1 bay leaf", "2 tsp curry powder", "4 medium Maris Piper potatoes, peeled", "50g/1¾oz unsalted butter", "300ml/10fl oz fresh chicken stock", "150g/5½oz baby carrots", "50g/1¾oz caster sugar", "50ml/1¾fl oz chicken stock", "75g/2½oz unsalted butter", "150g/5½oz sugar snap peas", "2 tbsp olive oil", "4 x 140g-175g/5-6oz fillet steaks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spiced herb butter, place all the ingredients in a large food processor and blend until smooth. Lay a piece of aluminium foil on the work surface and lay the blended butter in a line along the foil. Roll the butter in the foil into a cylinder, tighten at both ends and place in the fridge to set.", "For the fondant potatoes, trim both ends of the potatoes and use a peeler to shape them into a barrel shape. Heat a large frying pan and add the butter. Once melted, add the potatoes and fry until golden-brown.", "Add the chicken stock and cook for 20-30 minutes until soft, but not falling apart - they need to hold together.", "To make the glazed vegetables, place the carrots, sugar, chicken stock and butter in a saucepan over a medium heat and cook for 10 minutes. Remove from the heat and set aside.", "Meanwhile, place a small saucepan on the heat and add water. Once boiling, add the sugar snaps. Cook for 4-5 minutes, drain and refresh in cold water before setting aside.", "For the steak, place a large frying pan over a high heat. Once hot, add the oil and then cook the steak for two minutes on each side, or until cooked to your liking. Place a slice of the spiced herb butter on top of the steaks and place under the grill for 1-2 minutes, or until the butter has melted.", "To serve, place a frying pan over a medium heat and add a little of the carrot cooking liquor. Add the carrots and sugar snap peas and cook for a couple of minutes, or until hot.", "Place the vegetables at one side of each plate and a fondant potato at the opposite side. Place the steak in the middle and serve immediately."]}, {"isVegetarian": false, "title": "Fillet of turbot with smoky celeriac purée, buttered cabbage and hazelnut pesto", "url": "www_bbc_co_uk_food_recipes_fillet_of_turbot_with_33580", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550ml/1 pint full-fat milk", "250g/9oz celeriac, peeled, grated", "4g/⅛oz salt", "1 bay leaf", "8g/¼oz agar agar", "20g/¾oz peeled hazelnuts", "20g/¾oz parmesan, grated", "40ml/1½fl oz hazelnut oil", "10ml/½floz grapeseed oil", "1g salt", "freshly ground white pepper", "1 medium celeriac, cut into eight pieces", "8 drops black truffle oil", "1 tbsp grapeseed oil", "1 medium savoy cabbage, shredded", "75g/3oz butter", "250ml/9fl oz chicken stock", "8 x 110g/4oz turbot fillets", "4 tbsp grapeseed oil"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the grated celeriac into a saucepan with the milk, salt and bay leaf and bring to the boil. Turn down the heat and simmer for 30 minutes, stirring regularly.  Pass the mixture through a colander, discard the celeriac and then pass the milk through a fine sieve into a clean saucepan.  Transfer the infused milk into a shallow dish.  ", "Place the dish on a wire rack. Set the rack over oak wood chips in a home smoker or kettle barbecue, cover tightly with a lid and set over a medium heat for five minutes.", "Remove the milk from the smoker and measure 500ml/17fl oz of liquid. Transfer the milk to a medium-sized saucepan. Add the agar agar, bring to the boil, whisking continuously, for two minutes. Pour the contents of the pan into a shallow dish and set aside to cool and set. ", "Once cooled and fully set, transfer the mixture into a food processor and blend until a smooth purée.  Season, to taste, with salt, transfer the mixture to a bowl and cover with clingfilm. Chill in the fridge until required.", "Preheat the oven to 150C/300F/Gas 2.", "For the hazelnut and parmesan pesto, place the hazelnuts on a roasting tray and roast in an oven for 10 minutes.  ", "Remove from the oven, transfer to a stainless steel bowl and crush to a fine crumb with a rolling pin.  Add the parmesan, the oils, salt and freshly ground white pepper. Stir until well combined and set aside.", "For the baked celeriac, peel the edges to neaten the pieces of celeriac and place into a bowl.  Mix the two oils and add to the bowl of celeriac. Stir until all the celeriac pieces are evenly coated and add a generous pinch of salt and freshly ground white pepper.", "Place a large sheet of aluminium foil onto a work surface and cover with another equally sized piece.  Place the celeriac into the centre of the foil. Fold one end over to the other and fold over the meeting ends to seal.  Fold over the side edges to create a sealed pouch.  ", "Transfer the pouch onto a baking tray and bake in for 40 minutes. Remove from the oven, open the pouch and check that the celeriac is tender by inserting a skewer or toothpick. ", "Place a large heavy based saucepan over a medium heat for one minute.  Add the butter, allow it to melt and then add the cabbage and a pinch of salt.  Cook for 3-4 minutes, stirring frequently, until the cabbage softens.  ", "Add 100ml/3½fl oz chicken stock, cover and cook for a further 3-4 minutes, or until the cabbage is just tender.  Set aside at room temperature.", "Place two large heavy-based frying pans over a high heat for one minute.  Add two tablespoons of grapeseed oil to each. Season the skin-side of the turbot with salt and fry the fish for 1-2 minutes until golden-brown.  ", "Add half the butter to each pan, turn the fish over, add 75ml/3fl oz of chicken stock to each pan and transfer to the oven. Cook for three minutes alongside the celeriac.  ", "Remove the fish from the oven, coat each portion with a spoonful of pesto and set aside to rest for five minutes.  ", "Heat through the celeriac milk purée and the cabbage.  ", "Lay out eight large pre-heated plates. Place a generous spoon of purée at the top of each plate and drag the spoon through it to smear the purée around half of the plate.  ", "Unwrap the baked celeriac and transfer a piece to each plate. ", "Place a flat bed of cabbage in the centre of the plate, sit a piece of turbot on top and spoon some of the buttery juices around the fish."]}, {"isVegetarian": false, "title": "Fillet steaks stuffed with goats cheese", "url": "www_bbc_co_uk_food_recipes_fillet_steaks_stuffed_22262", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fillet_steaks_stuffed_22262_16x9.jpg", "ingredients": ["12 shallots, peeled, roots trimmed", "60g/2¼oz butter", "1 tbsp caster sugar", "75ml/2 ½fl oz red wine", "50ml/2fl oz port", "50ml/2fl oz crème de cassis", "250ml beef stock", "1 bay leaf", "½ tsp dried thyme", "½ lemon, zest only", "4 thick fillet steaks (ask your butcher for steaks cut from the centre of the fillet)", "150g/5½oz soft goats’ cheese", "1 tsp finely chopped rosemary", "1 lemon, zest only ", "1 garlic clove, crushed", "4 streaky bacon rashers, rind removed", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the candied shallots, bring a pan of water to the boil. Simmer the shallots in the water for 5 minutes, then drain. Heat the butter in a frying pan, add the shallots and cook over a medium low heat until lightly browned. Add the sugar, heat gently and stir until the sugar starts to caramelise. ", "Mix the wine, port, cassis and stock in a jug. Add about a quarter of this to the pan of shallots, bring to the boil, then add the bay leaf, thyme and lemon zest. Keep adding the remaining liquid gradually, reducing each time, until the shallots are just covered with a lovely sticky glaze, then set aside until needed.", "For the steaks, take the steaks out of the fridge an hour or so before cooking so that they are at room temperature.", "Crumble the cheese into a bowl, then add the rosemary, lemon zest and garlic.", "Using a sharp knife, cut a pocket horizontally in each steak, taking care not to cut all the way through the steak. Place one-quarter of the cheese stuffing into each pocket. Close the flap, and wrap a rasher of bacon around each steak, helping to seal the pocket. Secure with a cocktail stick.", "Rub olive oil over the steaks, then sprinkle with salt and pepper to season.", "Heat frying pan until hot and fry the steaks for 3-4 minutes on each side (for medium) or until cooked to your liking. For a 2.5cm/1in thick steak, 2-3 minutes per side will give you a rare steak, 3-4 minutes per side will give you a medium-rare steak; and 4-5 minutes per side will give you a medium to well-done steak.", "Allow the steaks to rest for 5 minutes. Meanwhile, gently reheat the shallots. Serve the steaks with the candied shallots."]}, {"isVegetarian": false, "title": "Filleto à la pizzaiola", "url": "www_bbc_co_uk_food_recipes_filletoalapizzaiola_72229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14¼oz fillet steak, cut into 6 medallions", "600g/1lb 5oz Italian tinned chopped tomato", "2 cloves garlic, finely chopped", "90ml/3¼fl oz olive oil", "1 mozzarella ball, drained and finely sliced", "pinch of dry oregano", "6 slices of ciabatta bread, toasted", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a hot griddle pan, sear the steak on both sides (approximately two minutes per side for medium rare).", "In a separate frying pan (30cm/12in diameter) fry the garlic in the olive oil until golden.  Add in the tomatoes, season with salt, pepper and oregano.", "Add the cooked steak to the sauce and continue to cook for approximately three minutes until some of the water from the tomatoes has evaporated.  ", "On the same griddle pan that you cooked the steak on, grill the ciabatta.", "Place three slices of ciabatta in a triangle on a plate.  Then place three medallions in the middle.  ", "Cover with a few slices of the mozzarella and then pour on some of the pizza sauce.  Serve immediately."]}, {"isVegetarian": false, "title": "Fillet of beef en croute with creamed spinach", "url": "www_bbc_co_uk_food_recipes_filletofbeefencroute_67684", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 beef fillet (about 360g/13oz)", "1 egg white", "1 tbsp English mustard", "2 eggs", "290ml/½pt milk", "2 tbsp flour, sieved", "handful chopped woodland herbs (such as chervil, tarragon, chives)]", "salt and pepper", "1 piece puff pastry", "1 egg (for egg wash)", "2 handfuls spinach", "8 tbsp double cream", "nutmeg"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the eggs and milk together for the pancakes. Slowly whisk in some sieved flour until you have a batter consistency.  ", "Just before you make the pancakes, add the chopped herbs and some seasoning to the butter. Make three pancakes and fry. Allow to cool.", "Seal the beef fillet in a hot pan with a little oil. Allow to cool then brush with a mix of the raw egg white and English mustard.", "Wrap the beef in the herb pancakes (one layer thick all round).", "Roll out a piece of puff pastry big enough to generously wrap the beef. Brush with the egg wash and seal the pastry around the beef.", "Brush the top with egg wash before baking.", "Bake on silicon paper for about 12 minutes at 180C/350F/Gas 4 and allow to rest for 5 minutes.", "Blanch the spinach in hot water and refresh in cold water. Reduce the double cream over a low heat and add the spinach.", "When the mixture is thick and rich, remove from the heat and allow to rest.", "Slice the beef and top with the spinach. Serve."]}, {"isVegetarian": false, "title": "Grilled mackerel with soy lime dressing", "url": "www_bbc_co_uk_food_recipes_filletofmackerelwith_93673", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletofmackerelwith_93673_16x9.jpg", "ingredients": ["250ml/9fl oz cider vinegar, or white wine vinegar", "250ml/9fl oz water", "5-6 pieces coriander stalks, washed", "40g/1½oz caster sugar", "35g/1¼oz red onion, finely sliced", "½ tsp whole pink peppercorns", "3-4 lemon slices", "2 whole mackerel, filleted, pin bones removed", "1 tbsp oil", "1 tbsp soy sauce", "1 tbsp water", "1 lime, juice only", "1 tsp fresh root ginger, peeled, finely diced", "½ tsp dark muscovado sugar", "1 tsp fennel seeds, soaked in water for 2 hours, drained and toasted in a dry pan", "1 fennel bulb, finely sliced on a mandoline, slices soaked in ice-cold water for 20 minutes, drained", "1 tbsp olive oil", "½ lime, juice only", "1 bunch rocket leaves", "2 pinches sea salt ", "1 pinch cayenne pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, heat the cider vinegar, water, coriander stalks, caster sugar, red onion, peppercorns and lemon slices in a medium saucepan over a medium heat. Heat the mixture until just warm (about 60C), then remove from the heat. Transfer the contents of the pan to a flat, shallow container and set aside to cool.", "When the mixture has cooled, place the mackerel fillets into the container, flesh-side down. Set aside to marinate for 20 minutes.", "For the soy and lime dressing, combine all the dressing ingredients in a small pan and gently heat through until the sugar has dissolved. Set to one side.", "Preheat the grill to its highest setting.", "When the mackerel fillets have marinated, remove them from the marinade and pat dry with kitchen paper. Make several diagonal scores in the skin, going across the length of each fillet to stop them from curling up during cooking.", "Brush a baking tray all over with oil. Arrange the mackerel fillets onto the greased tray, skin-sides facing upwards. Place under the grill and cook for 4-5 minutes, or until the skin is crisp and the flesh is cooked through.", "For the salad, combined. all the salad ingredients in a large bowl. ", "To serve, divide the fennel salad equally among four serving plates. Place a grilled mackerel fillet on top of each portion. Spoon the salad dressing around the edge of the plate. Scatter over the remaining toasted fennel seeds."]}, {"isVegetarian": false, "title": "Fillet of lamb marinated in shallots and honey, roasted pink and served on branches of rosemary", "url": "www_bbc_co_uk_food_recipes_filletoflambmarinate_92826", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/fl oz light olive oil", "handful fresh rosemary leaves, finely chopped", "2 tbsp orange blossom honey", "2 shallots, very finely chopped", "110g/4½oz lamb loin or fillet", "10 long, sturdy rosemary stems, stripped of two-thirds of the leaves leaving a spray of leaves at the tip", "sea salt and freshly ground black pepper"], "serves": "Makes 10", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the rosemary oil marinade, gently heat the olive oil in a pan over a low heat until warm then add the rosemary leaves, honey and shallots. Remove from the heat and set aside to infuse until cool. ", "When the oil is completely cool, strain through a sieve and pour it over the lamb. Cover and place in the fridge to marinate for 24 hours.", "Pre-heat the oven to 180C/355F/Gas 4.", "Remove the lamb from the marinade and season, to taste, with sea salt. Heat a pan over a high heat and sear the lamb for 2-3 minutes, turning occasionally, until brown on all sides. Transfer to a baking tray and roast in the oven for 5-7 minutes, or until the lamb is cooked but still pink in the middle. ", "Remove from the oven and set aside to rest for 10 minutes.", "To serve, carve the lamb into 10 slices and thread each slice onto a rosemary 'skewer'. Season, to taste, with freshly ground black pepper."]}, {"isVegetarian": false, "title": "Fillet of pork with honey and sesame seeds, carrot and ginger sauce", "url": "www_bbc_co_uk_food_recipes_filletofporkwithhone_88831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275ml/10fl oz freshly squeezed carrot juice", "1 large piece fresh ginger, peeled, finely chopped, squeezed in a clean tea towel to collect the juice", "110g/4oz salted butter", "salt and freshly ground black pepper", "4 King Edward or other floury potatoes, peeled, cut into cubes", "2 tbsp olive oil", "1 sprig fresh rosemary", "1 sprig fresh thyme", "12 garlic cloves, skin on", "2 x 375g/13oz pork fillets, trimmed", "25g/1fl oz rapeseed oil", "2 tbsp clear honey", "4 tbsp sesame seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to gas 200C/400F/Gas 6.", "Place the carrot juice and ginger juice into a pan over a medium heat and bring to the boil. Cook to reduce to about 150ml/5fl oz of liquid, then slowly whisk in 30g/1oz of the butter. Season, to taste, with salt and freshly ground black pepper and set aside.", "Heat a frying pan and add 50g/2oz of the butter and the olive oil. Add the potatoes and fry over a high heat until starting to become golden-brown.", "Add the herbs and garlic and continue to fry until the potatoes are cooked through.", "Heat a clean frying pan until hot, add the rapeseed oil and remaining 30g/1oz butter. Once the butter is foaming, add the pork fillets and fry, turning occasionally, until golden-brown on each side. Season, to taste, with salt and freshly ground black pepper.", "Remove from the pan and place onto a plate. Drizzle with the honey and coat well with the sesame seeds. ", "Transfer the honey and sesame-coated pork fillets to a trivet in a roasting tray and place into the oven to cook for 10-12 minutes, or until completely cooked through. Remove from the oven and leave to rest in a warm place for five minutes.", "To serve, carve the pork into thick diagonal slices. Spoon the potatoes into the centre of each plate. Top with the pork and spoon over the carrot and ginger sauce."]}, {"isVegetarian": false, "title": "Fillet of salmon with a horseradish sauce", "url": "www_bbc_co_uk_food_recipes_filletofsalmonwithah_72028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/fl oz double cream", "1 tsp Dijon mustard", "1 tsp English mustard ", "1 tsp creamed horseradish", "1-2 tsp lemon juice", "salt", "1 tbsp snipped fresh chives", "750g/1lb 10 oz skinless salmon fillet", "salt", "freshly ground black pepper", "plain white flour, for dredging", "1 tbsp vegetable oil", "1 bsp butter", "butered, cooked vegetables, such as spinach, to serve (optional)", "2 tbsp creamed horseradish", "1 egg yolk ", "100g/4oz coarse breadcrumbs", "1 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "First make the chive cream sauce. Boil the cream in a saucepan for two minutes or until it has thickened slightly. ", "Remove from the heat and whisk in the mustards, horseradish and lemon juice and taste for seasoning, adding a little more salt or lemon juice as necessary. Keep the sauce warm but do not let it boil again or the flavours of the mustard and horseradish will be spoilt. ", "To prepare the salmon, check that it has been properly trimmed and is boneless. If there are any bones remaining, remove with a pair of tweezers. Cut the salmon into four equal portions. Season each piece with salt and pepper and then dredge lightly with flour.", "For the horseradish crust, mix together the horseradish and egg yolk. Dip the topside of each piece of salmon into the horseradish/egg-yolk mixture, making sure that each fillet is generously coated.  ", "Mix together the breadcrumbs and parsley and then dip each piece of fish into the breadcrumbs. Shape the crust by pressing this mixture onto the fillets gently but firmly, with your hands.", "To cook the salmon, heat the oil in a heavy based frying pan until very hot. Add the fillets, crust side down, with the butter and cook for three minutes or until the breadcrumbs are beginning to crisp up nicely. Turn the fillets over and finish off the cooking in the oven for five minutes.", "To serve, add the chives, to the sauce. Place each fillet on a warm plate, laying it on a bed of buttered, cooked vegetables if you wish (spinach is a great choice) and surround with a little of the sauce."]}, {"isVegetarian": false, "title": "Fillet of sea bass with sweet and sour tomatoes and balsamic vinegar", "url": "www_bbc_co_uk_food_recipes_filletofseabasswiths_79881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "handful vine cherry tomatoes", "2 tbsp sugar", "170g/6oz sea bass fillet", "sea salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp butter", "25g/1oz rocket", "3 tbsp balsamic vinegar", "25g/1oz rocket", "olive oil", "small bunch of fresh chives, finely chopped, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tomatoes, heat the oil over a low heat in an ovenproof frying pan. Add the tomatoes and the sugar and place into the oven for 10-12 minutes. Remove from the oven and set aside.", "Meanwhile, for the sea bass, season the fillet with salt and freshly ground black pepper, and score the skin-side with a knife. ", "Heat the oil and the butter in a large frying pan over a medium heat. Add the sea bass fillet, skin-side down and cook for two minutes.", "Turn the fillet over and cook for a further 30 seconds, or until cooked through, then remove from the pan and set aside in a warm place.", "Tear the rocket leaves and add to the same pan with the balsamic vinegar. Cook for five minutes to reduce the balsamic vinegar to a thick sauce.", "For the salad, place the rocket in a bowl and drizzle with olive oil.", "To serve, place the rocket salad onto a large plate and top with the sea bass. Drizzle the sea bass with the balsamic and rocket pan juices and sprinkle with chives. Place the roasted tomatoes around the plate."]}, {"isVegetarian": false, "title": "Fillet of salmon with fennel and potato mash and red wine vinaigrette", "url": "www_bbc_co_uk_food_recipes_filletofsalmonwithfe_85070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp fennel seeds, crushed", "2 tbsp chopped fennel leaves, from the top of the fennel bulbs", "4 x 175g/6oz salmon fillets", "1-2 tbsp light olive oil", "salt and freshly ground black pepper ", "150ml/5fl oz red wine", "4 shallots, peeled and finely chopped", "125g/4½oz unsalted butter", "1 tbsp sugar", "salt", "400g/14oz floury potato (such as King Edwards), peeled, chopped", "60g/2½oz unsalted butter", "750g/1lb10oz fennel bulb, trimmed and roughly chopped", "2 tsp fennel seeds, crushed", "400ml/14fl oz single cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "For the salmon, mix together the fennel seeds and chopped fennel leaves in a bowl. ", "Brush each salmon fillet with a little oil, and season well with salt and freshly ground black pepper.", "Rub a good coating of the fennel mixture onto the salmon fillets, pressing gently but firmly onto each fillet to ensure the coating sticks.", "Place the salmon fillets, coated-side down, onto a lightly oiled baking tray. Place under the grill and cook for 3-4 minutes, depending on the thickness of the fish fillet. Carefully turn the fillets over and grill the coated side of the salmon (the coating will brown and crisp up slightly). Grill for a further 3-4 minutes, or until completely cooked through.", "For the vinaigrette, place the red wine and shallots into a small pan over a medium heat and bring to the boil. Lower the heat slightly and simmer until the wine has reduced by half.", "Turn the heat down low and whisk in the butter, a little bit at a time. Do not allow this sauce to come to the boil again.", "Season, to taste, with the sugar and salt, and keep in a warm place until ready to serve.", "For the fennel mash, place the potatoes into a saucepan over a high heat, cover with water and bring to the boil. Reduce the heat and simmer, until cooked, then drain and return to the pan. Mash the potatoes until smooth, then set aside.", "Heat a large pan until hot, then add the butter, fennel and fennel seeds and fry gently for about 10-15 minutes, over a low heat, with the lid on, until all the fennel pieces are soft.", "Add the cream, increase the heat and bring to the boil. Reduce the heat to a simmer for 4-5 minutes, until the cream has thickened slightly and the fennel is completely cooked.", "Transfer the fennel mixture to a food processor and blend to a smooth purée then pour into the pan of mashed potatoes. Stir well and season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the mashed potatoes into the centre of each plate. Top each with a salmon fillet and spoon the vinaigrette around."]}, {"isVegetarian": false, "title": "Fillet of venison and wild mushroom sauce", "url": "www_bbc_co_uk_food_recipes_filletofvenisonandwi_89763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletofvenisonandwi_89763_16x9.jpg", "ingredients": ["500g/1lb 2oz venison fillet, trimmed and cut into 2.5cm/1in thick medallions", "5 tbsp extra virgin olive oil", "1 tbsp balsamic vinegar", "1 carrot, finely chopped", "1 onion, finely chopped", "salt and freshly ground black pepper", "100g/3½oz unsalted butter", "2 small onions, very finely sliced", "40g/1½oz dried morels, soaked in warm water for 2 hours, drained (reserve the water)", "150g/5oz fresh porcini mushrooms, thickly sliced", "2 tbsp balsamic vinegar (aged for 10-15 years)", "4 tbsp dry sherry", "6 tbsp double cream", "salt and freshly ground black pepper", "1 summer truffle, optional"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the venison, the day before cooking, place the venison in a dish and cover with three tablespoons of the olive oil, and all of the balsamic vinegar, carrot and onion. Season well with salt and freshly ground black pepper and place into the fridge to marinate overnight.", "For the sauce, heat a non-reactive frying pan until hot. Add the butter and onions and fry the onion for 2-3 minutes, until softened.", "Add the morels and cook for 10 minutes.", "Add the porcini and fry for a further 3-5 minutes.", "Add the balsamic vinegar, sherry and cream and simmer for 10 minutes. Season, to taste, with salt and freshly ground black pepper. (The sauce may become quite thick, so add a little of the morel soaking water to the pan.) ", "To cook the venison, remove the venison from the marinade, pat dry with kitchen paper, then season well with salt and freshly ground black pepper.", "Heat a separate frying pan until hot. Add the remaining two tablespoons of olive oil and the venison steaks. Fry the venison on each side for 3-4 minutes, until golden-brown on the outside, but still pink on the inside, or until cooked to your liking.", "To serve, spoon the mushroom sauce onto warmed plates, then top with the venison steaks. Shave a little summer truffle over the top, if using."]}, {"isVegetarian": false, "title": "Sea bass with quinoa and herb salad, coriander mayonnaise and crispy onions", "url": "www_bbc_co_uk_food_recipes_fillets_of_seabass_with_42234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch baby turnips", "1 bunch baby carrots", "50ml/1¾fl oz olive oil", "1 red onion, cut into petals", "400g/7oz quinoa ", "2 tbsp caster sugar", "150ml/5¼fl oz rice wine vinegar", "75g/2½oz sultanas", "¼ bunch basil", "¼ bunch coriander", "¼ bunch mint", "1 lemon, juice only ", "3 bunches coriander, leaves picked", "200g/7oz ice cubes", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz vegetable oil", "1 tbsp yuzu juice", "2 free-range eggs, beaten", "3 onions, sliced into rings", "60g/4oz plain flour", "60g/4oz gram flour ", "1 tsp ground coriander", "4 tbsp chopped fresh coriander", "2 tbsp cumin seeds, toasted", "3 tbsp vegetable oil, plus extra if required", "2 sea bass fillets, skin removed", "50g/2oz unsalted butter", "2 tbsp coriander cress", "2 tbsp basil cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place a medium saucepan of boiling water on the hob and blanch the baby turnips and carrots. Drain and set aside.", "Place a medium frying pan on the heat and add the oil, once hot add the onion petals. Cook for a couple of minutes until the onion colours, remove from the pan and set the onions aside and keep the pan for the fish.", "Cook the quinoa in water or soak according to the packet instructions and place in a large glass bowl.", "Place the sugar and vinegar in a medium saucepan and heat until the sugar has dissolved. Add the sultanas and onion and warm through until the sultanas have swollen and the onion has wilted. Place the sultanas and onion in the quinoa salad and add the herbs. Season with salt and pepper and the lemon juice.", "For the coriander mayonnaise, blend the coriander with 2½ litres/4½ pints water in a blender or a food processor.", "Line a colander with a triple-layer of muslin cloth. Place the ice into a large bowl in which the colander will fit. ", "In a large heavy-based pan, heat the coriander water, whisking continuously. When the temperature reaches 80C/176F the chlorophyll will separate from the water. ", "Drain the coriander water through the muslin-lined colander, then set the colander into the bowl of ice to chill. Leave until a thick coriander purée is left in the muslin. Scrape this off and reserve for the mayonnaise.", "To make the mayonnaise, place the egg yolks, white wine vinegar and mustard into a food processor and blend until pale and creamy. ", "With the motor running, pour in the oil, in a very thin steady stream, until the mayonnaise thickens. ", "Add the yuzu juice and coriander purée to the mayonnaise and mix, set aside.", "For the crispy onion rings, heat a deep fat fryer to TEMPERATURE? (CAUTION: Hot oil is dangerous. Do not leave unattended.)", "Combine the onion rings with the beaten egg in a large bowl and mix well.", "Add the flours, ground coriander, fresh coriander and cumin seeds and stir well to combine.", "When the oil is hot add a large spoonful of the onion rings and fry for 30-45 seconds, until golden-brown.", "Using a slotted spoon, turn over and fry for a further 30 seconds, until crisp and golden-brown all over. Remove with a slotted spoon and set aside to drain on kitchen paper. Season with salt.", "Repeat with the remaining onion rings, replenishing the oil in the fryer if it runs low and allowing it to heat up again after a new addition.", "Heat a medium frying pan and add the butter. Season the sea bass fillets with salt and freshly ground black pepper.", "Fry the sea bass fillets and cook for a couple of minutes on each side.", "To serve, place a pool of the coriander mayonnaise on the plate and place the quinoa salad on top. Put the sea bass fillets on top and then some crispy onion rings. Garnish with coriander and basil cress."]}, {"isVegetarian": false, "title": "Fillets of cod with a smoky garlic and parsley butter with diced carrot, leeks and potatoes", "url": "www_bbc_co_uk_food_recipes_filletsofcodwithasmo_74450", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz unsalted butter", "50g/2oz smoked salmon trimmings ", "3 garlic cloves, crushed", "1 small bunch of fresh parsley", "3 tbsp of lemon juice", "salt and freshly ground black pepper", "140g/5oz carrots, diced", "140g/5oz leeks, washed and trimmed and diced", "140g/5oz potatoes, peeled and diced", "4 portions of thick, boneless, skinless cod fillets, weighing about 200g/8oz each   ", "salt and freshly ground black pepper                                                                   ", "100g/4oz plain white flour, for dredging", "2 tbsp of vegetable oil", "knob of butter"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the parsley butter, melt the butter in a small saucepan, with the smoked salmon trimmings and the crushed garlic.", "Heat gently for about ten minutes or until the butter has clarified. Strain the butter through a sieve and return to the pan. ", "Allow the butter to rest off the heat for about 30 minutes, to let the flavours infuse.", "Meanwhile, pick the parsley leaves off their stalks and blanch them in boiling water for one minute. ", "Refresh under very cold water, drain, pat dry with kitchen paper and chop roughly. Set aside.", "Strain the clarified butter through a fine sieve and add the lemon juice and the salt and pepper.", "Blanch or steam the vegetables until they are tender, then refresh them under cold water and reserve.", "To cook the cod fillets, season them with some salt and pepper and dredge them in flour. In a large frying pan, heat the vegetable oil until almost smoking, then add the knob of butter and the cod fillets. Cook the fillets over a medium heat for about four minutes on each side. Be careful not to treat them roughly or they may break up.", "To serve, warm the vegetables and parsley leaves in the clarified butter. Divide this mixture between warm plates and add a cod fillet to each serving."]}, {"isVegetarian": false, "title": "Sole wrapped in prosciutto with bay leaf sauce (Sogliola al prosciutto crudo in salsa d'alloro)", "url": "www_bbc_co_uk_food_recipes_filletsofsolewrapped_90825", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz capers, drained", "¼ garlic clove, finely chopped", "1 tbsp extra-virgin olive oil", "8 slices prosciutto", "8 fillets lemon sole, weighting about 100g/3¾oz each (or 4 fillets of sole, weighing about 200g/7oz each, cut in half lengthways)", "8 small sprigs fresh parsley", "salt and freshly ground black pepper", "8 fresh chives", "4 tbsp extra-virgin olive oil", "6 fresh bay leaves, finely chopped", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 handful fresh parsley, finely chopped", "200ml/7fl oz white wine", "½ tsp cornflour", "500g/1lb 2oz baby potatoes, boiled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the paste, place the capers, garlic and olive oil in a mortar and grind with a pestle to make a paste.", "For the sole, line up the slices of prosciutto on a clean work surface, well spaced apart.", "Place one sole fillet on each slice of prosciutto, brush the fish with a light layer of the caper paste, then top with a sprig of parsley. Season with salt and freshly ground black pepper, to taste.", "Carefully roll up each fillet in the prosciutto slice and tie to fasten using a chive.", "Line a baking tray or an ovenproof dish with greaseproof paper and place the wrapped and rolled fish fillets on the dish. Bake in the oven for approximately 10-15 minutes, or until the fish is just cooked.", "For the sauce, heat the olive oil in a small frying pan and add the bay leaves, shallot, garlic and parsley. Fry on a medium heat for about seven minutes, or until the shallot has softened.", "In a small bowl, whisk together the wine and cornflour. Add the cornflour mixture to the pan. Stir well and season to taste with salt and freshly ground black pepper. Cook for a further five minutes, or until the sauce has thickened.", "Remove the sole fillets from the oven and transfer them to a large serving dish, or onto four individual plates, and pour over the sauce before serving. Serve with the boiled baby potatoes."]}, {"isVegetarian": false, "title": "Fillet steak, pickled walnuts and horseradish", "url": "www_bbc_co_uk_food_recipes_filletsteakpickledwa_86083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["good-sized stick fresh horseradish, about 1.5cm/½in wide x 5cm/2in long (longer if you like it hot) ", "2-3 tsp caster sugar", "2 tbsp white wine vinegar", "200ml/7fl oz double cream", "4 fillet steaks, each 250g/9oz, trimmed of any sinew ", "salt and freshly ground black pepper", "4 tbsp groundnut oil", "80ml/2½fl oz Madeira", "225ml/8fl oz good-quality beef stock", "9-12 pickled walnuts, plus 1 tbsp of the pickling liquid", "50g/2oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the horseradish cream, peel the horseradish swiftly and then grate finely. Grate quickly as the horseradish will make your eyes water. The heat of fresh horseradish is vital for this dish. Stir the sugar into the vinegar to dissolve, then pour in the horseradish. Let this sit for half an hour or so. Very lightly whip the cream; then stir into the horseradish. Cover well - then dry your eyes. (The sauce can be made a few hours ahead and chilled, but not too far ahead or the flavour will fade dramatically.) ", "Season the steaks liberally and evenly with sea salt and freshly ground pepper. Warm a heavy-bottomed frying pan; then add the oil. Heat until gently smoking, then carefully sit the steaks in the pan and do not touch at all. Let the meat cook gently until the edges turn a good rich, dark brown, moving the pan if the steaks are cooking unevenly. After 7-8 minutes, turn the steaks onto the other side and you should reveal a splendid crust. Continue to cook for a few minutes further, then remove the steaks to warm plates and set aside. ", "Stir the Madeira into the pan and boil until only a teaspoonful remains. Add the stock and the spoonful of pickling liquid, then simmer gently until slightly thickened. Add the butter all at once and stir until thoroughly combined. Return to the boil; then pour the sauce through a fine sieve into a small pan and keep warm. ", "To serve, slice the pickled walnuts in half and heap over the steaks. Pour the sauce over and add a dollop of horseradish cream alongside."]}, {"isVegetarian": false, "title": "Fillet steak with a blue cheese crust served with crushed Anya potatoes", "url": "www_bbc_co_uk_food_recipes_filletsteakwithablue_84475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½ oz Anya potatoes", "2 tsp butter", "1 tbsp chopped parsley", "1 slice of bread, crust removed", "30g/1oz blue cheese", "4 sage leaves", "100g/3 ½oz fillet steak", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp olive oil", "2 tsp butter", "1 garlic clove, chopped", "2 tbsp red wine", "55g/2oz wild mushrooms", "3-5 baby carrots, tops trimmed", "1 tbsp chopped parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Bring a saucepan of salted water up to the boil.  Add the potatoes and boil until tender. ", "Drain the potatoes and place into a bowl. Add the butter and mash together.  Stir through the parsley.  Keep warm. ", "Place the bread, blue cheese and sage leaves into a food processor and blend together. Press  the cheese mixture onto one side of the steak.  Season with salt and freshly ground black pepper.", "Heat the olive oil in an ovenproof frying pan over a high heat and fry the steak, crust side up, until brown on the bottom.  Transfer into the oven to finish cooking for four minutes.", "Heat the oil and butter in a frying pan. Add the garlic and cook for one minute.", "Add the red wine and cook to reduce the wine by half. Add the mushrooms and simmer for two minutes. Add the baby carrots and simmer for a further three minutes. Stir through the chopped parsley.", "To serve, place the mash into the centre of a serving plate, place the steak on top and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Fillet steak sandwich with caramelised red onions and homemade stout mustard", "url": "www_bbc_co_uk_food_recipes_filletsteaksandwichw_85715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz white mustard seeds", "50g/2oz black mustard seeds", "75g/3oz soft light brown sugar", "2 tsp ground allspice", "pinch ground cinnamon", "1 tsp coarse salt", "1 tsp black peppercorns", "1 tsp paprika", "½ tsp turmeric", "125ml/4fl oz red wine vinegar", "3 tbsp stout", "25g/1oz butter", "2 large red onions, sliced", "1 sprig fresh thyme", "15g/½oz butter", "2 tbsp olive oil, plus extra for dressing", "4 x 200g/7oz fillet steaks", "salt and freshly ground black pepper ", "2 ciabatta loaves", "2 heads Little Gem lettuce, leaves separated", "½ lemon, juice only", "2 large beef tomatoes, thickly sliced"], "serves": "4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place all of the dry ingredients into a food processor and blend until the seeds are roughly crushed. With the motor still running, gradually add the vinegar and blend until well mixed.", "Add the stout and blend briefly.", "Transfer the mustard to a bowl and leave to stand for one hour to thicken, then transfer to sterilised dry jars.", "Cover the surface of each with a disc of waxed paper, waxed side down, and leave until cold. Top the cold jars with airtight lids, label and store in a cool dark place. The mustard should keep for 3-6 months.", "Preheat the oven to 200C/400F/Gas 6.", "For the onions, heat a separate pan until hot and add the butter and oil, then add the onions and thyme. Reduce the heat and cook slowly for 12-15 minutes, until caramelised.", "Meanwhile, for the sandwich, heat an ovenproof frying pan until hot and add half the butter and oil.", "Season the steaks with freshly ground black pepper. Add to the hot pan and cook for 2-4 minutes on one side. Turn the steak over and transfer to the oven for 3-4 minutes, or until cooked to your liking.", "Remove the steaks from the pan, season with salt and set aside to rest for a few minutes. Reduce the oven temperature to 180C/355F/Gas 4.", "Place the ciabatta into the oven for five minutes, just to warm through.", "Dress the Little Gem leaves with a squeeze of lemon and a little olive oil.", "To serve, cut the ciabatta loaf in half then split it lengthwise and place onto a board.", "Cut the fillet steak on an angle into 1cm/½in thick slices.", "Spread the mustard onto the bottom of the bread, and top with the dressed lettuce."]}, {"isVegetarian": false, "title": "Fillet steak with Chateaubriand sauce and straw fries", "url": "www_bbc_co_uk_food_recipes_filletsteakwithchate_90362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz fillet steaks, pounded out thinly with a meat mallet or rolling pin", "salt and freshly ground black pepper ", "50g/2oz butter", "2 tbsp olive oil", "vegetable oil, for deep-frying", "3 large baking potatoes, peeled and cut into matchsticks", "75g/3oz butter", "2 shallots, sliced", "150g/5oz button mushrooms, sliced", "1 garlic clove, chopped", "150ml/5fl oz white wine", "300ml/10fl oz reduced chicken stock", "small bunch fresh tarragon, leaves picked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the steak, season the steaks well with salt and freshly ground black pepper. ", "Heat a frying pan until smoking, add the butter and olive oil and fry the steaks on both sides for 2-3 minutes (for medium), or until cooked to your liking.", "Heat the vegetable oil a deep-based pan to 190C/375F, checking with a food thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the matchstick potatoes and fry for 3-4 minutes, or until golden-brown and cooked through. Remove with a slotted spoon and drain on kitchen paper, then season, to taste, with salt and freshly ground black pepper.", "For the sauce, heat a clean frying pan until smoking, add 25g/1oz of the butter and fry the shallots for 2-3 minutes, or until golden-brown. Add the mushrooms and garlic and cook for one minute, then pour in the wine and simmer for 2-3 minutes. ", "Add the chicken stock and simmer for 10-12 minutes, or until the liquid has reduced by half. Whisk in the remaining butter until the sauce is smooth and creamy. Stir in the tarragon leaves and season, to taste, with salt and freshly ground black pepper. ", "To serve, pile the fries onto serving plates, place the steak alongside and spoon over the sauce."]}, {"isVegetarian": false, "title": "Fillet steak with crunchy chips and béarnaise sauce", "url": "www_bbc_co_uk_food_recipes_filletsteakwithcrunc_91268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp white wine vinegar", "1 bay leaf", "1 small shallot, finely chopped", "1 sprig fresh tarragon", "1 sprig fresh parsley", "2 free-range egg yolks", "salt and freshly ground black pepper", "100g/3½oz cold butter, cut into cubes", "1 tsp chopped fresh tarragon", "1 tsp chopped fresh parsley", "4 x 150g/5¼oz fillet steaks", "4 tsp vegetable oil", "salt and freshly ground black pepper", "vegetable oil, for frying", "4 large Maris Piper potatoes, peeled and cut into large chips, parboiled in vegetable stock (or add 1 vegetable stock cube to the boiling water)", "4 handfuls mixed salad leaves, to serve"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the béarnaise sauce, bring the white wine vinegar, bay leaf, shallot, tarragon and parsley to the boil in a heavy-based non-reactive pan. Season, to taste, with salt and freshly ground black pepper. Continue to simmer until the volume of liquid has reduced by two thirds (there should only be one tablespoon of liquid remaining in the pan). Strain the remaining liquid immediately into a cold bowl. ", "In a heatproof bowl, mix together the egg yolks with a pinch of salt until well combined. Add one teaspoon of the reduced liquid and one cube of butter. ", "Suspend the heatproof bowl over a pan of simmering water (do not allow the base of the bowl to touch the surface of the water). Whisk the butter and reduced liquid into the egg yolk and salt mixture, whisking continuously, until well combined. Add the remaining cubes of butter, one at a time, whisking until each one has been incorporated into the mixture before adding the next.", "When all of the butter has been incorporated into the mixture and the sauce is smooth, stir in the tarragon and parsley and season again, to taste. Set aside.", "For the steak and chips, preheat the oven to 220C/425F/Gas 7. Brush each fillet steak all over with a little oil, then season, to taste, with salt and freshly ground black pepper. ", "Heat a frying pan over a medium heat until hot. Add the fillet steaks and fry for 1-2 minutes on each side. ", "Transfer the steaks to a baking tray and roast in the oven for a further 5-6 minutes (for medium rare) or longer for medium to well done. Remove from the oven and set aside to rest for 8-10 minutes.", "Meanwhile, heat the oil in a deep fat fryer to 180C. lternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the dried parboiled potato chips into the hot oil and fry for 6-8 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.   ", "To serve, place one fillet steak onto each of four serving plates. Arrange some of the chips in a stack alongside. Drizzle the béarnaise sauce over the steak. Serve the salad leaves alongside."]}, {"isVegetarian": false, "title": "Fillet steak with morel mushroom and wine sauce", "url": "www_bbc_co_uk_food_recipes_filletsteakwithmorel_89193", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filletsteakwithmorel_89193_16x9.jpg", "ingredients": ["2 x 225g/8oz beef fillet steaks", "salt and freshly ground black pepper", "3 tbsp olive oil ", "115g/4oz morel mushrooms, cleaned", "2 shallots, peeled and finely chopped", "1 clove garlic, finely chopped", "200ml/7fl oz red wine", "2 tsp finely chopped fresh thyme leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the beef fillets with salt and freshly ground black pepper and brush with two tablespoons of the oil.  Heat a frying pan until smoking and add the steaks, frying for 3-4 minutes on both sides (for rare), or until cooked to your liking. Transfer to warm serving plates to rest.  ", "Reduce the heat, add the remaining oil to the pan and fry the shallots and the garlic for 2-3 minutes, or until they begin to soften. Stir in the morels and fry for 1-2 minutes, then season with salt and freshly ground black pepper.", "Pour in the wine and stir in the chopped thyme leaves, then leave to simmer for 5-6 minutes, or until the liquid has thickened.", "Pour the mushroom and red wine sauce over the steaks and serve."]}]