[{"isVegetarian": false, "title": "Whisky-cured salmon with pickled beetroot, cucumber, shallots and cucumber ketchup", "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_58695", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "1 vanilla pod, seeds scraped out", "2 tbsp whisky", "1 x 500g/1lb 2oz side of salmon, skin on, pin bones removed", "½ bunch baby heritage beetroots, cleaned, small stalk left on", "200ml/7fl oz white wine vinegar", "75g/2½oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "2 banana shallots, thinly sliced", "½ cucumber, thinly sliced", "2cm/1in piece root ginger, peeled and sliced", "100ml/3½fl oz white wine vinegar", "2 tsp caster sugar", "2 cucumbers, roughly chopped", "1 tsp xantham gum", "2 tbsp mustard cress", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the whisky cured salmon, put the sugar, salt, vanilla seeds and whisky in a large bowl and mix together. Sprinkle some of the mixture on the bottom of a non-reactive baking tray and lay the salmon on top, skin-side down.", "Cover the salmon with the rest of the curing mixture and cover with cling film. Place in the fridge for 4-6 hours, or overnight.", "For the pickled beetroot, cucumber and shallots, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave until cool enough to handle. Peel carefully and cut in half.", "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots, cucumber, beetroot and ginger in a bowl and pour over the hot vinegar mixture. Mix together to coat then set aside to pickle for at least an hour, but preferably 24 hours.", "For the cucumber ketchup, place the vinegar and sugar in a saucepan and heat until the sugar has dissolved. Remove from the heat and allow to cool slightly before pouring it into a large food processor with the cucumber. Blend until smooth. With the processor still running, add the xantham gum until well-combined and thickened. Season with salt and set aside.", "To serve, slice the salmon into thin strips. Spread the cucumber ketchup on a serving plate and add the salmon. Garnish with the pickled vegetables and cresses."]}, {"isVegetarian": false, "title": "Whisky-cured salmon with cucumber ketchup and chargrilled cucumber", "url": "www_bbc_co_uk_food_recipes_whisky-cured_salmon_with_72948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "1 vanilla pod, seeds scraped out", "2 tbsp whisky", "1 x 500g/1lb 2oz side of salmon, skin on, pin bones removed", "100g/3½oz tapioca pearls", "200ml/7fl oz vegetable stock", "2 tsp beetroot juice", "vegetable oil, for deep-frying", "salt", "100ml/3½fl oz white wine vinegar", "2 tsp caster sugar", "2 cucumbers, roughly chopped", "1 tsp xantham gum", "1 cucumber, peeled, with the ends and round edges trimmed off", "rapeseed oil, for drizzling", "large handful watercress or 2 tbsp watercress sprouts"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the whisky-cured salmon, place the sugar, salt, vanilla seeds and whisky in a large bowl and mix together. Sprinkle some of the mixture on the bottom of a non-reactive baking tray and lay the salmon on top, skin-side down.", "Cover the rest of the salmon with the curing mixture and cover with cling film. Place in the fridge for 4-6 hours, or overnight.", "For the tapioca crisps, place the tapioca in a saucepan with the stock and cook, stirring constantly. Add the beetroot juice and stir. Tip out onto a lined baking tray. Allow to dry for 2-3 hours.", "Heat a deep-fat fryer (or large heavy-based saucepan half filled with oil) to 190C/380F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Break off bits of the dried tapioca and place in the fryer with for a second, then lift out with a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt.", "For the cucumber ketchup, place the vinegar and sugar into a medium saucepan and heat until the sugar has dissolved. Remove from the heat and allow to cool slightly before pouring it into a large food processor with the cucumber. Blend until smooth.", "With the processor still running, add the xantham gum until well-combined and thickened. Season with salt and set aside.", "For the chargrilled cucumber, heat a large griddle pan until hot. Drizzle the cucumber with the rapeseed oil and cook until evenly charred on each side. Remove from the heat and cut into four pieces.", "To serve, slice the salmon into thin slices on an angle and place a few slices in the centre of each of four plates. Spoon a little of the cucumber ketchup alongside, with a piece of chargrilled cucumber. Scatter over a few watercress leaves and tapioca crisps and serve."]}, {"isVegetarian": false, "title": "Whisky and orange mustard rib of beef with potato and turnip dauphinoise", "url": "www_bbc_co_uk_food_recipes_whisky_and_orange_31001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz cider vinegar", "5 tbsp caster sugar", "60g/2¼oz yellow mustard seeds", "25g/1oz brown mustard seeds", "2 tbsp English mustard powder", "50ml/1¾fl oz single malt whisky", "50ml/1¾fl oz orange juice", "2 tsp honey", "50g/1¾oz butter, plus extra for greasing", "1 garlic clove, cut in half", "500g/1lb 2oz King Edward potatoes, peeled and thinly sliced", "500g/1lb 2oz turnips, peeled and thinly sliced", "salt and freshly ground black pepper", "300ml/10fl oz double cream ", "300ml/10fl oz whole milk ", "pinch freshly grated nutmeg", "4kg/8lb 8oz 3-bone forerib of 28-day aged beef", "200ml/7fl oz white wine", "300ml/10fl oz beef stock"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mustard, place the vinegar and sugar in a saucepan and bring to a simmer. Add the mustard seeds and powder and stir well.", "Simmer over a high heat for three minutes until the volume of the liquid has reduced by half and the seeds slightly softened.", "Pour into a food blender and blend to a purée – it takes a few of minutes for the seeds to break down and the mustard to become creamy.", "Add the whisky, orange juice and honey, then blend once more. Season with a little salt and freshly ground black pepper and set aside.", "For dauphinoise, preheat the oven to 170C/325F/Gas 3.", "Butter an ovenproof dish with a little of the butter then rub the garlic clove around the dish.", "Toss the potatoes and turnips together in a bowl, season with salt and freshly ground black pepper. Tip into the ovenproof dish, pressing the slices down to form an even layer.", "Place the cream and milk in a bowl and whisk to combine. Season with salt, black pepper and nutmeg and pour the cream and milk over the potatoes and turnips.", "Dot with the remaining butter and then cover tightly with aluminium foil. Place in the oven and cook for an hour until the vegetables are just tender. After an hour, remove from the oven and set aside.", "For the beef, increase the oven temperature to 200C/400F/Gas 6. Spread some of the mustard all over the beef (any remaining mustard can be kept in a container in the fridge for a few weeks).", "Heat a large frying pan until very hot. Add a little oil to the pan and fry the beef on all sides until nicely browned. Transfer to a roasting dish and place in the oven for 1 hour 30 minutes.", "Remove from the oven, cover with foil and rest for 15-30 minutes.", "For the dauphinoise, remove the foil and return to the oven for a further 30 minutes until golden-brown on top.", "For the beef, place the beef on a board ready to carve and then return the roasting pan to the heat. Make a gravy by heating the meat juices over a medium heat until bubbling, then add the wine and cook until the liquid has reduced by half. Add the beef stock and cook until reduced by half again, then season to taste.", "To serve, carve the beef and serve with a spoonful of dauphinoise and dollop of mustard. Drizzle over the gravy to finish."]}, {"isVegetarian": false, "title": "Whisky and chilli tiger prawns", "url": "www_bbc_co_uk_food_recipes_whisky_and_chilli_tiger_72921", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_and_chilli_tiger_72921_16x9.jpg", "ingredients": ["2 limes, 1 juice and zest, 1 juice only", "90ml/3½fl oz whisky ", "180g/6½oz soft light brown sugar ", "20 raw tiger prawns, peeled, deveined", "1 red chilli, seeds removed, finely chopped ", "1 tbsp vegetable oil "], "serves": "Serves 4 as a starter or 2 as a main course", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat the lime juice, whisky and sugar in a saucepan over a medium heat, stirring gently, until the sugar has dissolved. Once the sugar has all dissolved, stop stirring, turn up the heat and boil for 5–7 minutes, or until the mixture becomes syrupy and thickens. To tell if it is ready, dip a wooden spoon in the mixture and tap off the excess – some glaze should still stick to the spoon, but it will not be as thick as honey. (Sometimes the whisky catches alight and you will see a blue-orange flame coming from the pan. Just take it off the heat and the whisky will burn itself out. )", "Stir in the finely grated lime zest, then remove the pan from the heat and set aside. ", "Put the prawns in a shallow ovenproof dish and sprinkle over the chilli. Brush the prawns with the oil and then with the glaze. Bake in the oven for 10–15 minutes, or until the prawns turn opaque. Remove from the oven and brush with more glaze, reserving any extra glaze for dipping, and set aside to cool slightly before serving."]}, {"isVegetarian": false, "title": "Whisky-cured salmon with beetroot and blinis", "url": "www_bbc_co_uk_food_recipes_whisky_cured_salmon_with_14937", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_cured_salmon_with_14937_16x9.jpg", "ingredients": ["1 side of salmon ", "150g/5½oz sea salt", "150g/5½oz caster sugar", "100ml/3½fl oz whisky", "200g/7oz plain flour", "7g sachet instant yeast", "250ml/9fl oz milk", "1 tsp salt", "1 tsp sugar", "2 free-range egg whites", "50g/1¾oz butter", "200g/7oz redcurrant jelly", "3 cloves", "50ml/2fl oz whisky", "100ml/3½fl oz red wine vinegar", "50g/1¾oz Dijon mustard", "10 beetroots, cooked and cut into cubes", "250g/9oz crème fraîche", "mustard cress or micro herbs, to garnish"], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Lay long strips of cling film over a work surface. Lay the salmon on top and cover with the sea salt, sugar and whisky. Wrap the fish tightly in cling film and place in the fridge for 12 hours.", "Wash the salmon to remove the salt rub, then slice it thinly.", "To make the blinis, whisk together the flour, yeast, milk, salt and sugar. Set aside in a warm place to prove for an hour. ", "For the beetroot, heat the redcurrant jelly, cloves, whisky and vinegar in a saucepan. Simmer until the volume of liquid has reduced by half. Strain through a sieve.", "Whisk in the mustard, then stir through the beetroot. Set aside until ready to serve.", "For the blinis, whisk the egg whites in a separate bowl until stiff peaks form when the whisk is removed. When the batter has proved fold in the egg whites.", "To cook the blinis, melt the butter in a large frying pan. Add a tablespoon of batter to the pan per blini and cook until golden-brown on the underside. Flip over and cook the other side. Remove the blini and place onto kitchen paper. Repeat until you have used all the batter. Keep the blinis warm until ready to serve.", "To serve, place slices of salmon onto serving plates, with a few blinis, a spoonful of beetroot and a quenelle of crème fraîche. Garnish with mustard cress or micro herbs."]}, {"isVegetarian": true, "title": "Whisky shortbread ding dangs", "url": "www_bbc_co_uk_food_recipes_whisky_shortbread_ding_77063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whisky_shortbread_ding_77063_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "100g/3½oz caster sugar", "185g/6½oz plain flour", "½ tsp table salt", "85g/3oz fine semolina ", "50ml/2fl oz malt whisky", "40g/1½oz instant porridge oats, blitzed in a food processor ", "rice flour, for dusting ", "6 tbsp warm water", "2½ tbsp meringue powder ", "½ tsp cream of tartar", "500g/1lb 2oz icing sugar", "green gel food colouring ", "red gel food colouring"], "serves": "Makes 12 large biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the shortbread, put the butter and sugar in a mixing bowl and cream together until soft and fluffy. Add the flour, salt, semolina, oats and whisky. Mix to a dough and chill in the fridge for 15 minutes. ", "Dust a work surface with rice flour and roll the dough out to 4mm thickness. Using a biscuit cutter or a template cut into 12-15 large biscuits (the exact number will vary depending on the shape). Chill in the fridge for 15 minutes. ", "Preheat the oven to 170C/150C Fan/Gas 3½. ", "Place biscuits on lined baking trays or mesh baking sheets and bake for 15 minutes, do not allow to 'brown'. Leave to cool on wire racks.", "For the royal icing, put the water and meringue powder in the bowl of a food mixer, and mix for a minute. Add the cream of tartar and mix for 45 seconds. Slowly add the icing sugar and beat for 10 minutes on a slow speed (you may find it beneficial to drape a damp towel over the bowl when adding the icing sugar as it gets everywhere!). ", "Put a quarter of the icing into a small bowl and add the green gel food colour. In a separate bowl colour another quarter of the icing red. This leaves you with half the icing still white. Put the green and red icing into separate piping bags fitted with fine plain nozzles. Put a third of the white icing into a piping bag fitted with a plain nozzle.", "Pipe a circle of white icing on the surface of each biscuit quite close to the edge and leave to set. Using a teaspoon, fill the circle with the remaining white icing (if the white icing is a bit too thick to spread on the biscuits, add a drop of water, but be careful not to make it too runny). Before the white icing sets, pipe thin alternating lines of red and green icing across. Using a cocktail stick, drag the icing in the opposite direction to the red and green lines to create a feather effect. Leave to set. ", "If you want the biscuits to hang on a Christmas tree, use a cocktail stick to pierce a hole near the top and push some thread or fine ribbon through."]}, {"isVegetarian": false, "title": "Whisky mustard crusted pork chop with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_whiskymustardcrusted_93746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/3fl oz whisky", "25g/1oz honey", "1 lemon, juice only", "75g/3oz yellow mustard seeds", "25g/1oz brown mustard seeds", "50ml/2fl oz water", "4 x pork loin chops, French trimmed, fat removed", "75g/3oz dried breadcrumbs", "1 tbsp olive oil", "25g/1oz butter", "50g/2oz butter", "3 tbsp olive oil", "4 small potatoes, peeled, cut into thick slices", "1 garlic clove, peeled, finely sliced", "2 fresh sprigs rosemary, leaves only", "salt and freshly ground black pepper", "400g/14oz  baby spinach leaves", "2-3 tbsp water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the whisky, honey, lemon juice and water into a saucepan and heat until the honey dissolves.", "Stir in the mustard seeds and cook for 1-2 minutes, or until most of the liquid has been absorbed.", "Blend the mixture in a food processor until creamy (this will take a few minutes).", "Sprinkle the breadcrumbs onto a plate.", "Brush the pork chop on one side with the mustard mixture and dredge in the breadcrumbs. Spoon the remaining mustard into a small bowl and set aside.", "Heat the olive oil and butter in an ovenproof frying pan until hot. Fry the pork chops for 2-3 minutes on each side, or until golden-brown on each side. ", "Transfer to the oven for 6-8 minutes, or until the pork is cooked through. Remove from the oven and set aside to rest.", "For the sautéed potatoes, heat the olive oil and half of the butter in a frying pan until hot.  Fry the potatoes for 4-5 minutes, or until golden-brown and tender. Add the garlic and rosemary and season, to taste, with salt and freshly ground black pepper.", "Heat the remaining butter in a frying pan, add the spinach and water and cook for 2-3 minutes, or until the spinach has wilted.", "To serve, spoon some potatoes onto each of 4 serving plates, top with a pork chop and spoon some spinach alongside.  Serve with the remaining mustard."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_white_bread_38648", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp caster sugar", "425ml/15fl oz warm water", "2½ tsp dried yeast, or 20g/¾oz fresh yeast", "750g/1lb 9oz strong bread flour, plus extra for dusting", "2 tsp salt", "40g/1½oz butter, or 4 tbsp olive oil", "vegetable oil, for greasing", "1 free-range egg, beaten", "poppy or sesame seeds, for the top of the loaf (optional)"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["In a measuring jug, mix the sugar with 150ml/5fl oz of the warm water and yeast and let stand in a warm place for five minutes, or until frothy. If using fast-acting yeast, there is no need to let the mixture stand.", "Sift the flour and salt into a large bowl. Rub in the butter and make a well in the centre. (If using olive oil instead of butter, pour the olive oil into the remaining water.) Pour in the yeast mixture and most of the remaining water (and the olive oil, if using). Mix to a loose dough, adding the remaining water if needed, plus extra if necessary.", "Knead for about ten minutes or until the dough is smooth and springy to the touch. (If kneading in an electric food mixer with a dough hook, five minutes is usually long enough.) Put the dough in a large oiled bowl. Cover the top tightly with cling film and place somewhere warm to rise until doubled in size. This may take up to two or even three hours.", "Preheat the oven to 220C/425F/Gas 7.", "When the dough has more than doubled in size, knock back and knead again for 2–3 minutes. Leave to relax for ten minutes before you begin to shape the bread.", "Shape the bread into loaves or rolls, transfer to a baking tray and cover with a clean tea towel. Allow to rise again in a warm place for 20–30 minutes, or until the shaped dough has again doubled in size. When fully risen, it should leave a dent when you gently press the dough with your finger.", "Gently (as the bread is full of air at this point and therefore very fragile) brush with egg wash and sprinkle with poppy or sesame seeds (if using), or dust lightly with flour for a rustic-looking loaf.", "Bake in the oven for 10–15 minutes for rolls, or 30–45 minutes for a loaf, depending on its size. Turn the heat down to 200C/400F/Gas 6 after 15 minutes for the remaining cooking time. When cooked, the bread should sound hollow when tapped on the base. Transfer to a wire rack to cool."]}, {"isVegetarian": false, "title": "White cabbage escabeche with free-range quail and chanterelles", "url": "www_bbc_co_uk_food_recipes_white_cabbage_escabeche_33284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 large white cabbage leaves", "4 carrots, peeled and thinly sliced", "4 shallots, broken into ‘petals’", "100ml/3½fl oz white wine vinegar", "100ml/3½fl oz olive oil", "3 garlic cloves", "2 tbsp sugar", "1 tbsp coriander seeds", "100g/3½oz unsalted butter", "50ml/2fl oz vegetable oil", "4 large free-range quail", "sea salt ", "20 Scottish chanterelles", "freshly ground black pepper", "carrot tops, to garnish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and add the cabbage leaves, carrots and shallots. Bring the water back to the boil and cook for two minutes then drain and quickly refresh the vegetables in a large bowl of iced water. Drain again, pat the vegetables dry then place them in a heatproof dish.", "Place the vinegar, oil, garlic, sugar and coriander seeds into a small saucepan, bring to a boil then pour over the vegetables and leave to cool. ", "Preheat the oven to 180C/350F/Gas 4. Heat the butter and oil in a large frying pan. Season the quails with the salt and seal them in the frying pan until browned all over, basting with the butter as they brown. Transfer the quail to a roasting tin and roast in the oven for two minutes. Fry the chanterelles in the frying pan for one minute then season with salt and freshly ground black pepper.", "To serve, place the quail on a plate with the chanterelles. Arrange the vegetables around the quail and drizzle over a little of the escabeche sauce. Garnish with the carrot tops."]}, {"isVegetarian": true, "title": "White chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_22234", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_22234_16x9.jpg", "ingredients": ["200g/7oz cooking white chocolate, roughly chopped", "300g/10½oz full-fat cream cheese, at room temperature, liquid drained", "300ml/10fl oz double cream ", "1 tsp lemon juice", "1 tsp vanilla extract ", "175g/6oz gingernut biscuits ", "50g/1¾oz unsalted butter, softened "], "serves": "Makes 8 slices", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["To make the filling, gently melt the white chocolate in a heatproof bowl sat over a saucepan filled with 4cm/2in just boiled water on a low heat. Make sure the base of the bowl doesn’t touch the water. Once there are only a few small lumps of unmelted chocolate left, give it another stir then remove the bowl and sit it somewhere for about 10 minutes, until the chocolate remains liquid but is cooled to room temperature. ", "To make the base, break the biscuits into a food processor and blend until you have almost all crumbs. Add the butter and process again until the mixture starts to clump and cleave to the blade. If doing this by hand, put the biscuits into a bag, crush to crumbs, then melt the butter and stir into the biscuit crumbs until well mixed.", "Press the biscuit mixture into the cake tin, letting some come a little way up the sides. The back of a spoon is the easiest tool for the job here. Stash the tin in the fridge while you get on with the cheesecake filling. ", "Beat the cream cheese with a wooden spoon in a large bowl, until it is soft. Gently fold in the slightly cooled, melted white chocolate. ", "Softly whip the cream so it is thickened but the peaks don’t hold their shape, then fold it into the white chocolate mixture in two batches. Add the lemon juice and vanilla extract and fold these in, then pour and scrape the pale, almost-moussy mixture into the biscuit-lined tin. Smooth the top, cover the tin with cling film and refrigerate overnight before serving. ", "When ready to serve, remove from the fridge for 10 minutes before unclipping from the tin and cutting it into slices. "]}, {"isVegetarian": true, "title": "White chocolate and raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_48500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_and_48500_16x9.jpg", "ingredients": ["150g/5½oz digestive biscuits", "75g/2¾oz butter, plus extra for greasing", "250g/9oz mascarpone cheese", "300ml/10fl oz double cream", "1 tsp vanilla extract", "200g/7oz white chocolate, broken into chunks", "400g/14oz fresh raspberries"], "serves": "Serves 6–8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Grease the base of a 20cm/8in springform cake tin with butter, then line with a circle of baking parchment.", "To make the cheesecake base, put the biscuits in a plastic bag and crush with a rolling pin until it resembles fine crumbs but still has texture. Melt the butter in a small saucepan over a low heat. Add the biscuits and stir. Spoon into the base of the tin and press using the back of a spoon until level, then cover and chill in the refrigerator.", "To make the filling, put the mascarpone and double cream into a bowl and whisk with an electric hand whisk until it is smooth and has very soft peaks. Stir in the vanilla.", "Put the chocolate into a small heatproof bowl, and place on top of a pan of simmering water. Stir until melted but not hot. Set aside for 5–10 minutes, until cool but still liquid. Pour into the mascarpone and stir, but be careful not to over mix.", "To make the coulis, put half the raspberries in a small blender. Blitz until runny, then pour through a sieve into a bowl to remove the seeds.  ", "Spoon half of the white chocolate mixture over the base. Use the handle of a teaspoon to make a few narrow holes in the mixture right down to the base. Pour or pipe the coulis into the holes, reserve some for decorating. Spoon the remaining white chocolate mixture on top, then smooth and level it. Cover with cling film and chill for at least 6 hours, or overnight.", "Run a palette knife around the edges of the tin. Remove the sides and base and sit on a plate. It may be easier to serve on the base or carefully run a knife under the biscuit base to release. Arrange the remaining raspberries on top of the cheesecake and drizzle over the remaining coulis. "]}, {"isVegetarian": true, "title": "White chocolate and raspberry bread", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_89452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz strong white flour, plus extra for dusting", "250g/9oz sourdough starter", "7g salt", "100-130ml/3½-4fl oz tepid water", "olive oil, for kneading", "150g/5½oz white chocolate chips", "100g/3½oz fresh raspberries (not frozen)", "fine semolina flour, for dusting"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, starter and salt in a large mixing bowl. Add the water and mix with your hands until you have a soft dough. ", "Coat a chopping board with olive oil, then tip the dough onto it and knead the dough for 5-10 minutes, or until the dough forms a soft, smooth skin. ", "Tip the dough into a lightly oiled bowl and cover with a clean tea towel. Leave to rise in a warm place (22-24C/71-51F) for five hours, or until at least doubled in size.", "Once risen, knead the dough until it is smooth, knocking the air out. Add the white chocolate chips and raspberries and continue to knead until the chocolate and raspberries are well mixed into the dough.", "Roll into an elongated shape to fit into a long proving basket.", "Flour the proving basket and place the dough into the basket. Leave to rise for 5-9 hours.", "Preheat the oven to 220C/425F/Gas 7.", "Liberally sprinkle semolina on to the exposed dough in the proving basket; this will give it grip on the baking tray and stop it from spreading. ", "Place a baking tray over the proving basket, then quickly flip it over, removing the basket and leaving the loaf shape on the baking tray. ", "Bake for 20 minutes, then reduce the oven temperature to 190C/375F/Gas 5 and bake for another 20-25 minutes.  If the bread looks like it is colouring very quickly reduce the heat earlier and cover with foil."]}, {"isVegetarian": false, "title": "White chocolate and whisky bread and butter pudding with honeycomb foam and whisky ice cream", "url": "www_bbc_co_uk_food_recipes_white_chocolate_and_94872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz double cream", "100ml/3½fl oz full fat milk", "1 vanilla pod, split in half lengthways and seeds scraped out", "6 free-range egg yolks", "100g/3½oz caster sugar", "100ml/3½fl oz whisky", "3 large all-butter croissants, thickly sliced", "25g/1oz sultanas", "40g/1½oz butter, softened", "500ml/18fl oz double cream", "500ml/18fl oz milk", "300g/10½oz white chocolate, roughly chopped", "3 free-range eggs", "6 free-range egg yolks", "200g/7oz caster sugar", "75ml/3floz whisky", "2 tbsp icing sugar, to dust", "400ml/14fl oz milk", "75g/2½oz honeycomb toffee (cinder toffee)", "1 tsp lecithin powder"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the ice cream, put the cream and milk in a saucepan with the vanilla pod (reserve the seeds for the pudding) and bring to a simmer.", "Whisk the egg yolks and sugar together in a bowl. ", "Add the whisky to the hot cream and bring to a simmer then pour it over the eggs and whisk to combine. Return the mixture to the pan and heat until thick enough to coat the back of a spoon.", "Strain and reserve the vanilla pod for making the pudding. Pour into an ice cream maker and churn following the manufacturer’s instructions. Freeze until needed.", "For the pudding, preheat the oven to 180C/350F/Gas 4.", "Lay the croissants in an ovenproof dish with the sultanas layered in between, then dot with the softened butter.", "Place the cream, milk and reserved vanilla pod and seeds in a saucepan. Bring to the boil, add the chocolate and whisk until melted.", "Place the eggs, egg yolks and sugar in a bowl and whisk to combine. Pour the hot chocolate custard through a sieve over the eggs and whisk to combine. Add the whisky and mix. Ladle it through a fine sieve over the croissants and set aside for 15-20 minutes to soak.", "Cover with aluminium foil and place in the oven for 25-30 minutes, or until golden-brown and the custard is just set.", "Remove from the oven and dust with icing sugar. Use a blowtorch or place under the grill to caramelise.", "For the foam, place the milk, honeycomb and lecithin into a small saucepan and bring to the boil, then froth with a stick blender until foaming.", "To serve, place a slice of the pudding in the centre of the serving plates with some of the sauce from the dish, top with a scoop of ice cream and a spoonful of foam."]}, {"isVegetarian": true, "title": "White chocolate, bourbon and raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_bourbon_02403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for greasing", "25cm/10in sponge cake disc (cut from a large ready-made sponge flan case)", "300g/11oz white chocolate, roughly chopped", "350ml/12fl oz double cream", "750g/1lb 10oz full-fat soft cream cheese", "1½ tsp vanilla extract", "2 lemons, zest and juice", "50ml/2fl oz bourbon, plus extra for sprinkling", "3 free-range eggs, separated", "200g/7oz caster sugar", "4 tbsp cornflour", "250g/7oz raspberries", "250g/9oz raspberries ", "2 tbsp icing sugar"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Lightly grease a 25cm/10in spring-form cake tin. ", "Place 200g/7oz of the white chocolate and the double cream into a bowl suspended over a pan of simmering water (do not let the bottom of the bowl touch the water) and heat until just melted.", "Place the sponge disc in the base of the tin. Sprinkle with a little bourbon, if you like. ", "Place the cream cheese into another bowl and add the vanilla extract. Then beat together with the lemon zest and juice, bourbon and egg yolks. ", "Stir in the sugar, corn flour and white chocolate cream and mix until thoroughly combined.", "Carefully fold in the raspberries and the remaining chopped white chocolate.", "Whisk the egg whites until stiff peaks form when the whisk is removed. Fold the whisked egg whites into the cream cheese mixture with a large metal spoon, making sure they are fully incorporated, then pour the mixture over the sponge base in the cake tin. ", "Set the cheesecake on a large sheet of foil and wrap the foil up around the base of the tin to seal the bottom.", "Pour 2-3mm of warm water into a roasting tray, and sit the cake tin in the tray. (This will help create steam during cooking.) Bake for one hour until the top is golden-brown but the middle of the cake still has a slight wobble. ", "Remove from the oven and leave to cool and set completely before removing from the tin. ", "For the raspberry sauce, place the raspberries, icing sugar and 50ml/2fl oz water into a blender and purée until smooth.  ", "Strain the sauce through a fine sieve pushing it through with a spatula or spoon.", "Slice the cheesecake and serve with a drizzle of raspberry sauce."]}, {"isVegetarian": false, "title": "White chocolate, hazelnut and raspberry layered genoise mousse cake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_hazelnut_53975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sheets leaf gelatine", "400g/14oz good quality white chocolate, cut into small pieces ", "568ml/1 pint double cream", "3 free-range eggs whites", "125g/4½oz plain flour", "35g/1¼oz skinned hazelnuts ", "4 free-range eggs", "1 free-range egg yolk", "185g/6½oz caster sugar", "60g/2¼oz butter, melted", "300g/10½oz chopped hazelnuts", "150g/5½oz caster sugar", "200ml/7fl oz hazelnut liqueur", "500g/1lb 2oz raspberries "], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the mousse, place the gelatine in a small bowl of cold water and set aside to soften. Place the chocolate in a glass bowl and melt in the microwave for about two minutes, stirring from time to time until the chocolate is thoroughly melted and smooth. Set aside to cool. ", "Gently heat 100ml/3½fl oz of the cream in a small saucepan on the hob. Remove the pan from the hob, squeeze the water from the gelatine, then stir it into the cream until completely dissolved. Set aside in the fridge to cool. ", "Whisk the egg whites until stiff peaks form when the whisk is removed.", "Whisk the remaining cream until stiff peaks form when the whisk is removed. Fold in the melted chocolate with a metal spoon. Add the gelatine and cream mixture and mix until well combined. Gently fold in the egg whites then cover the bowl with clingfilm and chill in the fridge for 1-2 hours.", "For the sponge cake, preheat the oven to 180C/350F/Gas 4. Grease two 15cm/6in cake tins and line the bases and sides with greaseproof paper, making sure the paper extends above the top of the tins.", " Place the flour and hazelnuts in a food processor and pulse until very finely ground.", "Place the eggs, egg yolk and sugar in a bowl set over a pan of barely simmering water, making sure the bottom of the bowl does not touch the water. Whisk the eggs and sugar over the heat for about five minutes or until the mixture is light, fluffy and warm.", "Remove the bowl from the heat and whisk with an electric whisk for about five minutes or until the mixture has tripled in volume and has the consistency of softly whipped cream. ", "Sift one-third of the flour and hazelnut mixture over the whipped eggs and gently fold in using a large rubber spatula. Fold in half of the remaining flour mixture, then the rest.  (Do not over mix the batter.) ", "Mix a cupful of the batter into the melted butter with a small spatula.  When completely combined, fold the butter mixture into the batter with a spatula.  Divide the batter between the prepared cake tins, smoothing the top level. (The batter should not reach more than half the depth of the tins.)", "Bake the cakes in the oven for 20-25 minutes or until the mixture shrinks slightly from the edges of the pan and the top springs back when lightly pressed. Cool on a wire rack, removing the cake tins and greaseproof paper as soon as they are cool enough to handle. ", "To make the praline, place the chopped hazelnuts and sugar in a small saucepan. Heat gently until the sugar has dissolved and turned a pale caramel colour. Pour the mixture onto the prepared baking tray and set aside to cool. When the caramel has set, break into pieces by smashing it with a rolling pin then place the pieces in a food processor and pulse until you have a coarse powder.", "To assemble the cake, cut each sponge in half horizontally with a serrated knife.  Position one cut sponge onto a cake stand, brush with hazelnut liqueur and pipe or spread the mousse on top. Repeat these layers with the remaining sponges, then coat the whole cake with the remaining mousse, using a palette knife. Arrange the raspberries on top of the cake then gently press the powdered praline onto the sides, using greaseproof paper to make a smooth finish. Brush any excess praline away from the cake stand with a pastry brush. "]}, {"isVegetarian": true, "title": "White chocolate bread and butter pudding with whisky ice cream", "url": "www_bbc_co_uk_food_recipes_white_chocolate_bread_66263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz brown wholemeal breadcrumbs ", "300ml/10fl oz double cream ", "300ml/10fl oz single cream ", "125g/4½oz icing sugar ", "2 free-range eggs, separated", "1 tablespoon whisky, (optional) ", "350ml/12fl oz milk", "350ml/12fl oz double cream", "1 vanilla pod, split ", "2 free-range eggs", "4 free-range egg yolks", "150g/5½oz caster sugar", "150g/5½oz white chocolate, roughly chopped", "8-10 slices white bread, cut into quarters", "110g/3¾oz butter, softened, plus extra for greasing", "4 tbsp whisky", "2 tbsp icing sugar, to dust", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150m/5fl ozl double cream", "1 vanilla pod, seeds removed"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, preheat the oven to 200C/180C Fan/Gas 4.", "Spread the breadcrumbs out on a baking tray and toast in the oven for a couple of minutes until crisp and slightly browned.", "Meanwhile, beat the two creams with the sugar. Mix together the egg yolks and whisky, if using, and add to the cream mixture, beating it in well. When the breadcrumbs are cool, fold them gently into the cream mixture, making sure they are evenly distributed.", "Lastly, whip the egg whites until stiff and fold into the mixture. Transfer to a sealable container, place in the freezer and store until needed. (There is no need to stir this ice cream while it freezes.)", "For the bread and butter pudding, preheat the oven to 130C/110C Fan/Gas 2.", "Put the milk, cream and vanilla pod in a saucepan and bring slowly to the boil.", "Place the eggs, egg yolks and sugar into a bowl and whisk to combine.", "When the cream mixture has come to the boil, remove from the heat and remove the vanilla pod. Whisk the egg mixture into the cream mixture. Add the white chocolate and whisk until melted and smooth.", "Grease an ovenproof dish and butter the bread. Place the bread into the dish, overlapping the slices. Drizzle the whisky over the bread. Pour over the custard mixture.", "Bake for 20-25 minutes, or until golden-brown and just set. Remove from the oven and dust with icing sugar. Place under a preheated grill or use a mini-blowtorch to caramelise the top.", "For the crème Anglaise, place the egg yolks and sugar in a bowl and whisk until well blended. Combine the milk, cream and vanilla pod in a saucepan and bring to the boil. Immediately reduce the heat and simmer for one minute", "Pour the milk onto the egg mixture and whisk in. Return the mixture to the saucepan and heat slowly, until the custard has thickened enough to coat the back of the spoon. Remove and discard the vanilla pod.", "Cut the pudding into squares and remove from the dish, dust with icing sugar and use a blow torch to colour the top. Serve with the brown bread ice cream and crème Anglaise."]}, {"isVegetarian": true, "title": "White chocolate wedding cake", "url": "www_bbc_co_uk_food_recipes_white_chocolate_wedding_01746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_chocolate_wedding_01746_16x9.jpg", "ingredients": ["600g/1lb 5oz unsalted butter, plus extra for greasing", "600g/1lb 5oz caster sugar", "12 free-range eggs", "450g/1lb self-raising flour", "150g/5½oz cocoa powder", "150g/5½oz dark chocolate, melted", "300g/10½oz unsalted butter, softened at room temperature", "1 tsp vanilla extract", "750g/1lb 10oz icing sugar", "150g/5½oz white chocolate, melted", "300g/10½oz unsalted butter, softened at room temperature ", "1 tsp vanilla extract", "750g/1lb 10oz icing sugar", "150g/5½oz dark chocolate, melted", "400ml/13fl oz double cream", "400g/14oz white chocolate", "fresh flowers, to decorate"], "serves": "Serves 60", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease and line the 23cm/9in cake tin and 15cm/6in cake tin.", "Cream the butter and sugar together in a bowl until light and fluffy, then beat in the eggs, one at a time, until well combined.", "Fold in the flour and cocoa powder, then stir in the melted chocolate until well combined.", "Divide the mixture among the prepared cake tins. ", "Bake the 23cm/9in cake for 1 hour-1 hour 15minutes and the 15cm/6in cake for 45 minutes or until the cakes are golden-brown and a skewer inserted into the centre of the cakes comes out clean.", "Remove the cakes from the oven and set aside to cool, then carefully remove them from the tins and allow to cool completely. ", "Meanwhile for the white chocolate buttercream, cream the butter, vanilla and icing sugar together in a bowl until light and fluffy. Stir in the melted chocolate.", "For the dark chocolate buttercream, repeat the method for the white chocolate buttercream.", "For the ganache, heat the double cream in a saucepan until just boiling, then remove from the heat. Pour the cream over the chopped chocolate and stir until the chocolate has melted and the mixture is smooth. Set aside to cool slightly, or until the mixture has thickened.", "Carefully cut each cake in half horizontally and fill with the dark chocolate buttercream. Spread a teaspoon of buttercream onto each cake board and place the cakes onto them.", "Spread the white chocolate buttercream over the top and sides of each cake until covered. Chill in the fridge for 30 minutes, or until the icing has set. ", "Spread the ganache over each cake with a palette knife, trying to make it as smooth as possible.  Chill in the fridge for 30 minutes, or until the icing has set. ", "To stack the cakes, hold a dowelling rod at the side of the 23cm/9in cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. Place the pillars on top of the largest cake, positioning each one over a dowelling rod, then top with the 15cm/6in cake. Decorate with fresh flowers."]}, {"isVegetarian": false, "title": "White crab spaghetti", "url": "www_bbc_co_uk_food_recipes_white_crab_spaghetti_65861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100m/3½fl oz olive oil ", "2 sprigs fresh rosemary ", "2 garlic cloves, peeled and left whole ", "400g/14oz dried spaghetti", "½ fennel bulb, very finely sliced ", "4 spears asparagus, finely sliced using a vegetable peeler ", "1 shallot, finely chopped", "1 garlic clove, crushed  ", "1 chilli, finely chopped", "50ml/2fl oz dry white wine", "200g/7oz fresh white crab meat ", "1 lemon, zest and juice only", "handful fresh parsley, roughly chopped ", "50ml/2fl oz olive oil", "salt and freshly ground black pepper", "1 tbsp fresh chervil leaves, to serve ", "1 tbsp fresh tarragon leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the oil in a sauté pan and add the rosemary and garlic and cook for 1-2 minutes.", "Cook the spaghetti according to the packet instructions, with a little of the infused oil added to the water. Drain well and set aside. ", "Take the rosemary and garlic out of the oil and drop in the fennel and asparagus to cook for 1 minute. Remove the fennel and garlic and set aside.", "Heat the rest of the infused oil in a large frying pan. Add the shallot and cook over a medium heat until soft. Add the garlic, chilli and a splash of the wine to the pan and stir to combine. Add the crab, cooked fennel and asparagus and cooked spaghetti to the pan and bring to the boil. Season to taste and add a splash more wine if needed. Add the lemon zest and parsley and mix well. Remove the pan from the heat.", "To serve, add the spaghetti to a bowl and season with the lemon juice and remaining herbs."]}, {"isVegetarian": false, "title": "White currant and whisky semifreddo", "url": "www_bbc_co_uk_food_recipes_white_currant_and_whisky_86804", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz whisky", "75g/2¾oz white currants", "40g/1½oz sugar", "½ lemon, zest only", "½ tsp grated root ginger", "4 free-range eggs, yolks only", "60g/2¼oz caster sugar", "250ml/9fl oz double cream", "75g/2¾oz white currants"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Line six 125ml/4fl oz pudding moulds with clingfilm. To make the whisky cordial, place the whisky, white currants, sugar, lemon zest and ginger in a saucepan and heat gently. Do not allow the mixture to boil. Strain and push the pulp through a fine sieve to extract the juice then set aside to cool.", "For the semifreddo, place the egg yolks and sugar in a bowl set over a pan of barely simmering water and whisk until the mixture is pale and thick. Remove the pan from the heat and continue to whisk until the mixture is cool.", "Mix 125ml/4fl oz of the whisky cordial into the semifreddo mixture a tablespoon at a time. Whisk the cream until it forms thick ribbons then fold it into the semifreddo. Pour the mixture into the lined moulds and freeze overnight.", "For the garnish, prick the whitecurrants with a pin and place in a bowl with the remaining whisky cordial. Place in the fridge to macerate overnight.", "To serve, turn the semifreddos onto plates and scatter with the macerated white currants."]}, {"isVegetarian": false, "title": "White fish and bacon parcels", "url": "www_bbc_co_uk_food_recipes_white_fish_and_bacon_30891", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/white_fish_and_bacon_30891_16x9.jpg", "ingredients": ["1 small bunch flatleaf parsley, roughly chopped", "3-4 sun-dried tomatoes, to taste", "15g/½oz black or green pitted olives, roughly chopped", "1 tbsp capers, roughly chopped", "1-2 anchovies (optional)", "4 tbsp extra virgin olive oil", "freshly ground black pepper", "500g/1lb 2oz frozen white fish (cod, pollock and monkfish work best), defrosted", "200g/7oz unsmoked bacon medallions", "1 tbsp rapeseed oil", "steamed broccoli"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "For the tapenade, mash the parsley, sun-dried tomatoes, olives, capers and anchovies in a bowl until just broken up. Add the olive oil and continue mashing until it becomes a thick, spreadable paste. Season with pepper then set aside while you prepare the fish.", "Cut the fish into thick fingers about 2cm/¾in wide and 8cm/3in long if possible. Cut the bacon medallions in half lengthways then, using the back of the knife, flatten the bacon out lengthways, stretching it as you go. This will make it thin and long enough to wrap around the fish.", "If you have made the tapenade, brush the fish with the tapenade all over, then wrap with the bacon. If not using the tapenade, simply wrap a strip of bacon around the fish to cover as much of the middle as possible", "Put the fish, join side down on an oven tray and bake for 10-15 minutes until the bacon is crispy and the fish has cooked through. Serve with the steamed broccoli."]}, {"isVegetarian": false, "title": "White fish poached in oil", "url": "www_bbc_co_uk_food_recipes_white_fish_poached_in_77936", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz watercress", "150ml/5fl oz rapeseed oil ", "sea salt", "4 x 110g/4oz turbot fillets", "300ml/10½fl oz rapeseed oil", "300ml/10½fl oz sunflower oil", "20ml/¾fl oz rapeseed oil", "40g/1½oz shallot, finely chopped", "50ml/2fl oz cider", "15g/½oz dried whitebait", "¼ garlic clove, chopped", "250ml/9fl oz double cream ", "4 stalks purple sprouting broccoli", "4 stalks kale", "vegetable oil, for deep frying"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the watercress oil, bring a large pan of water to the boil. Add the watercress for 15 seconds. Drain and refresh immediately in cold water.", "Put the watercress into a muslin cloth and squeeze out as much water as possible.", "Place in a blender with the rapeseed oil and a pinch of salt . Blend for five minutes, or until the colour of the oil changes to dark green.", "Put a sieve lined with muslin over a bowl. Add the oil and leave to stand for an hour, or overnight.", "For the fish, put the rapeseed oil in a pan and heat to 50C/120F.", "Poach the fish for 8-10 minutes then remove and place on a wire rack to drain.", "Leave the fish in a warm place for 5-10 minutes and finish by charring the skin with a chef’s blowtorch. ", "For the cider sauce, heat the oil in a saucepan and gently fry the shallot without browning it. ", "Add half the cider, the whitebait and garlic and heat until the volume of liquid has reduced by half.", "Add the double cream and bring to a simmer for five minutes.", "Let the sauce cool slightly then pulse in a blender and pass the sauce through a fine sieve.", "For the greens, steam the purple sprouting broccoli in a steamer for 4-5 minutes until tender.", "Trim the kale into large pieces.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 160C/320F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Do not leave unattended)", "Add the kale to the fryer and fry until crisp (make sure you cover the fryer with lid when cooking the kale as it may spit).", "Drain the kale on a tray lined with kitchen paper and season with sea salt.", "Put the kale crisps in an oven set to the lowest possible temperature to keep warm until ready to serve.", "Just before serving, add the remaining cider to the sauce and season, to taste, with salt.", "Ladle the sauce into the middle of serving bowls. Drizzle with watercress oil. Place the fish in the centre. Finish with the purple sprouting broccoli and kale crisps."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_whitebread_1291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz fresh yeast or 2.5ml/½tbsp dried yeast ", "300ml/½ pint lukewarm milk", "450g/1lb strong white flour", "1 tsp salt", "25g/1oz butter"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the yeast with a little of the milk to get a creamy liquid.", "Put the flour and the salt in a bowl and rub in the butter.", "Stir in the yeast liquid and the rest of the milk to get a soft dough. ", "Turn on to a lightly floured work surface and knead until the dough is smooth and elastic, about 10-15 minutes. Put in a clean bowl and cover with clingfilm. Stand in a warm place for 1 hour to rise.", "Heat the oven to 220C/425F/Gas 7. Lightly oil a 1kg/2¼lb bread tin.", "Turn the dough on to the work surface again and knead for 5-10 minutes. Shape the dough into a loaf shape to fit the tin and place in the tin. Cover with a clean tea towel and allow to rise back up again, about 15 minutes.", "Bake in the oven until golden and risen, about 30-40 minutes. The base of the loaf should sound hollow when you tap it. Turn on to a wire rack to cool."]}, {"isVegetarian": false, "title": "White radish salad (Sangchae)", "url": "www_bbc_co_uk_food_recipes_white_radish_salad_90778", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz mouli (also known as white radish or daikon)", "¼ white onion", "flaked sea salt ", "1 tsp anchovy sauce", "½ tsp sesame oil", "½ tsp apple vinegar", "¼ tsp fermented shrimps", "1 tsp sugar", "1½ heaped tsp gochugaru (Korean red chilli powder) ", "2 spring onions", "½ tsp black sesame seeds (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Thinly slice the mouli into julienne strips, thinly slice the onion and place both in a bowl. Sprinkle with sea salt and leave for ten minutes. ", "Add the anchovy sauce, sesame oil, apple vinegar, fermented shrimps, sugar and chilli powder to a small bowl. Add the mixture to the mouli and onion and mix thoroughly so that it is all coated.  ", "Chop the spring onions in half and then each half into quarters lengthways. Add to the mouli, sprinkle the sesame seeds over (if using) and serve."]}, {"isVegetarian": true, "title": "White bread plait", "url": "www_bbc_co_uk_food_recipes_whitebreadplait_90314", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitebreadplait_90314_16x9.jpg", "ingredients": ["675g/1½lb strong white flour, plus extra for flouring", "1½ tsp salt", "1½ tsp sugar", "3 tsp easy-blend yeast", "1½ tbsp virgin olive oil, plus extra for oiling", "450ml/1 pint warm water", "1 free-range egg, beaten", "poppy seeds, for sprinkling"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["In a large bowl, stir together the flour and salt. Sprinkle over the sugar and the easy-blend yeast.", "Add the olive oil to the water. Make a well in the centre of the flour and pour in most of the water and olive oil mixture. Retain a bit of the liquid; you may need to add more later to get the right consistency.", "Stir with a wooden spoon and bring together to form a soft dough.", "Turn the dough out onto a lightly floured surface and knead for ten minutes until smooth and elastic.", "Place the dough into a large, lightly oiled bowl. Cover and leave in a warm place for approximately one hour to rise, until doubled in size.", "When the dough has risen, place it on a clean work surface and, with floured hands, knead it again to 'knock it back'. Knead for about five minutes until smooth and elastic.", "Divide the dough into three equal pieces and roll to form three even 'sausage' shapes.", "Plait the three dough 'sausages' together to form a large loaf and place onto a lightly floured baking tray.", "Preheat the oven to 220C/400F/Gas 7.", "Cover the loaf and return to a warm place until it has risen to about one-and-a-half times its size. This will take between ten and 30 minutes.", "Glaze the loaf with the beaten egg and sprinkle the poppy seeds on top.", "Bake the loaf in the oven for 10-15 minutes.", "Reduce the heat to 190C/375F/Gas 5 and bake for a further 30 minutes.", "The loaf is cooked when it is risen and golden and sounds hollow when tapped underneath."]}, {"isVegetarian": true, "title": "White bread", "url": "www_bbc_co_uk_food_recipes_whitebread_66040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour", "15g/½oz salt", "55ml/2fl oz olive oil", "20g/¾oz fresh yeast", "275ml/9fl oz water"], "serves": "Makes 1x1kg/2¼lb loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the ingredients in a large bowl taking care not to put yeast on the top of the salt.", "Knead well with your hands and knuckles until the dough is elastic, smooth and shiny. Cover with a piece of cling film and leave to rise for 1 hour.", "Line a baking tin with baking parchment and mould the dough into a sausage and place in the tin.", "Preheat your oven to 220C/450F/Gas 6, then leave the dough to rise for a further 30 minutes to 1 hour. Place the tin in the oven for 35 minutes. Remove from the tin, tap the bottom with your knuckles - if it sounds hollow, it's ready. Cool on a wire rack."]}, {"isVegetarian": true, "title": "White chocolate brownies (blondies)", "url": "www_bbc_co_uk_food_recipes_whitechocolatebrowni_91667", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitechocolatebrowni_91667_16x9.jpg", "ingredients": ["225g/8oz caster sugar", "4 free-range eggs", "225g/8oz butter, melted, plus extra for greasing", "150g/5½oz plain flour, sifted", "225g/8oz white chocolate, chopped", "100g/3½oz macadamia nuts, chopped", "75g/2¾oz butter", "175g/6oz icing sugar", "1 vanilla pod, split, seeds scraped out with a knife (the pod can be reserved for another recipe)", "125g/4½oz crunchy peanut butter", "50-75ml/2-4fl oz milk (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in square cake tin with butter. ", "For the brownies, in a bowl, beat together the sugar and eggs until pale and fluffy. Beat in the melted butter a little at a time, making sure each addition of butter is fully incorporated before adding the next.", "Add the flour and carefully fold it into the mixture using a metal spoon.", "Add the chopped white chocolate and macadamia nuts and carefully fold them into the mixture. ", "Spoon the brownie batter into the prepared cake tin and shake gently until level. Transfer the tin to the oven and bake for 30-35 minutes, or until a skewer inserted into the centre of the brownies comes out clean. Set aside to cool.", "Meanwhile, for the frosting, in a mixing bowl, whisk together the butter, icing sugar and vanilla seeds using an electric whisk until smooth and well combined. ", "Add the peanut butter and whisk until the mixture is smooth and well combined. (Add a little milk, if using, to loosen the mixture, as necessary).", "Once the white chocolate brownies have cooled, spread over the peanut butter frosting in an even layer. Cut the brownies into squares, carefully remove them from the tin and serve on a large serving plate."]}, {"isVegetarian": true, "title": "White chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_whitechocolatecheese_12412", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitechocolatecheese_12412_16x9.jpg", "ingredients": ["450g/1lb soft cream cheese", "4 large free-range eggs", "1 vanilla pod, seeds scraped out", "225g/8oz good quality white chocolate", "225g/8oz crème fraîche", "butter, for greasing", "55g/2oz biscuit crumbs, to dust over the buttered tin (use any type you love - chocolate digestives are good)"], "serves": "Makes 1 x 25cm/10in cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Beat the cream cheese in a bowl until soft, then add the eggs one by one, along with the seeds scraped from the vanilla pod.", "Melt the white chocolate in a bowl set over a pan of gently simmering water, then fold in the crème fraîche until smooth.", "Fold the chocolate mixture into the cream cheese mixture.", "Grease a 25cm/10in cake tin and sprinkle the base with the biscuit crumbs to cover. Pour the chocolate and cream cheese mixture into the tin and bang down on a firm surface to remove any air bubbles.", "Bake in a low oven, 150C/300F/Gas 2, for 45 minutes-1 hour, or until the centre is just firm.", "Allow to rest for several hours to firm up, before turning out and serving."]}, {"isVegetarian": true, "title": "White chocolate chilli brownies", "url": "www_bbc_co_uk_food_recipes_whitechocolatechilli_72899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter", "300g/10½oz quality white chocolate, chopped", "3 medium eggs", "150g/5oz caster sugar", "½ tsp pure vanilla extract", "200g/7oz plain flour, sifted", "pinch of salt", "icing sugar for serving", "1 large fresh red chilli, de-seeded", "1 large fresh green chilli, de-seeded", "100g/3½oz caster sugar", "150ml/5fl oz water"], "serves": "Makes 25 small or 12 medium", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/355F/Gas 4. ", "Lightly butter a 20cm x 30cm/8in x 12in straight-sided baking tin and line the base with greaseproof paper. ", "Finely slice the chillies on the diagonal. ", "Combine the sugar, water and chillies and bring to the boil, stirring. Simmer for five minutes. ", "In a heatproof bowl set over a pot of barely simmering water, melt the butter with 150g/5oz of the white chocolate, whisking well until smooth. Remove from the heat and allow to cool slightly. ", "In a separate bowl, beat the eggs, sugar and vanilla together until pale. Beat in the melted white chocolate mixture. ", "Fold in the sifted flour and salt, then the remaining chopped white chocolate. Drain the chillies and add most of them to the batter. ", "Pour into the baking pan, strew the remaining chillies on top, and bake for 25 minutes or until the top is firm and lightly golden. Remove and cool in the pan. ", "Cut into small or large squares, dust with icing sugar and serve."]}, {"isVegetarian": false, "title": "White chocolate panna cotta with roasted figs", "url": "www_bbc_co_uk_food_recipes_whitechocolatepannac_91281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 figs, tops scored with a cross using a sharp knife", "4 tbsp clear honey", "500ml/18fl oz double cream", "150ml/5½fl oz milk", "100g/3½oz white chocolate, broken into pieces", "25g/1oz sugar ", "4 gelatine leaves, soaked for 5-10 minutes in warm water, squeezed dry"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the roasted figs, place the figs onto a baking tray and drizzle over the honey. Roast in the oven for 6-8 minutes, or until the figs have softened and the honey has caramelised. Set aside.", "Meanwhile, for the panna cotta, heat the cream and milk in a pan over a medium heat until the mixture is almost simmering. ", "Reduce the heat to low and stir in the white chocolate and sugar until the ingredients have melted and the mixture is well combined. ", "Remove the pan from the heat and add the soaked gelatine leaves. Stir until the gelatine leaves have melted then set the mixture aside until it has completely cooled. ", "Pour the panna cotta mixture into ramekins, then chill in the fridge for five hours, or until set firm.", "To serve, dip the ramekin bases and sides in warm water to loosen the panna cotta from the moulds. Turn out one panna cotta into the centre of each of four serving plates. Place one roasted fig alongside."]}, {"isVegetarian": true, "title": "White gazpacho soup", "url": "www_bbc_co_uk_food_recipes_whitegazpachosoup_88994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz whole blanched almonds", "500ml/18fl oz iced water", "80g/3oz white bread, cubed, crusts removed", "2 garlic cloves, roughly chopped ", "50ml/2fl oz olive oil", "50ml/2fl oz sherry vinegar", "salt and freshly ground black pepper", "150g/5oz golden raisins"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the almonds into a food processor and blend until ground as fine as possible.", "Add 50ml/2fl oz of the water and blend to a paste.", "Add the bread and garlic and blend again.", "With the blender motor running, gradually add the remaining the water.", "With the motor still running, gradually add the olive oil.", "Add the sherry vinegar and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the soup among four bowls and sprinkle a few raisins over each."]}, {"isVegetarian": true, "title": "White sauce", "url": "www_bbc_co_uk_food_recipes_whitesauce_1298", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitesauce_1298_16x9.jpg", "ingredients": ["25g/1oz butter", "25g/1oz plain flour", "600ml/1 pint milk", "salt and white pepper"], "serves": "Makes 1 pint", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan. ", "Stir in the flour and cook for 1-2 minutes.", "Take the pan off the heat and gradually stir in the milk to get a smooth sauce. Return to the heat and, stirring all the time, bring to the boil. ", "Simmer gently for 8-10 minutes and season with salt and white pepper."]}, {"isVegetarian": false, "title": "Whiting burger in cider rolls with tartare sauce and gherkin salad", "url": "www_bbc_co_uk_food_recipes_whiting_burger_in_cider_95401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz tin peaches or pears, juice reserved", "160ml/5fl oz reserved peach or pear juice", "280g/10oz strong white flour", "15g/½oz fresh yeast", "100g/3½oz strong white flour", "200g/7oz granary bread flour", "60g/2¼oz starter dough (from above)", "150ml/5½oz cider", "15g/½oz fresh yeast", "15g/½oz unsalted butter", "10g/¼oz fine salt", "olive oil for cooking ", "6 banana shallots, roughly chopped", "8 garlic cloves, finely chopped", "3 medium hot red chillies, finely chopped", "1.5kg/3lb 5oz whiting fillet, skin removed and chopped", "5 tbsp chopped flat leaf parsley", "3 free-range eggs, lightly beaten", "250g/9oz fresh white breadcrumbs", "sea salt (preferably Cornish) and freshly ground black pepper", "2 large free-range egg yolks ", "1 tsp white wine vinegar", "½ tsp English mustard powder", "1 tsp salt ", "1 lemon, juice only", "275ml/10floz rapeseed oil ", "2 tbsp chopped capers", "4 gherkins, chopped", "1 tbsp flat leaf parsley", "3 gherkins, finely sliced", "1 cucumber, chopped", "2 shallots, finely sliced", "rapeseed oil, for drizzling"], "serves": "Makes 10 burgers", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the starter dough, drain the tin of peaches/pears, reserving the juice. Place the fruit into a mixing bowl with 160ml/5fl oz of the reserved juice. Cover and leave to ferment at room temperature for two days.", "Transfer the fruit and juice to a blender and blend to a fine purée. Strain the purée through a sieve into a jug.", "Place the flour, yeast and fermented juice into a free-standing electric mixer fitted with a dough hook and mix on high speed until a smooth dough has formed.", "For the cider rolls, place all the ingredients, except the salt, into an electric mixer fitted with a dough hook and mix on a high speed for six minutes. Add the salt and mix on for another two minutes. Transfer the dough to a floured bowl, cover with a damp cloth and leave in a warm place to rise for 30 minutes.", "On a floured surface, knock back the risen dough then shape into ten rolls. Place the rolls onto a baking tray, cover with a damp cloth and leave to prove in a warm place until doubled in size, about 40 minutes. ", "Preheat the oven to 220C/450F/Gas 7.", "Sprinkle the surface of the rolls with flour, then bake for 15-20 minutes or until golden brown and the bread sounds hollow when tapped on the underside. ", "Transfer to a wire rack and leave to cool before serving. ", "For the burger, heat a frying pan over a medium heat and add a drizzle of olive oil. Gently fry the shallots, garlic and chilies for two minutes, then remove to a plate and allow to cool. ", "Working in two batches, blend the whiting in a food processor for one minute, then transfer to a large bowl. ", "Add the shallot and chilli mixture, the parsley, eggs, breadcrumbs and some salt and pepper. Mix well, using your hands, until evenly mixed and well combined. (Fry a little piece of the mixture to taste for seasoning, adding salt and pepper as necessary.) ", "Divide the mixture into 100g/3½oz balls and mould them into patties. Place onto a plate, cover and refrigerate for 20 minutes or until ready to cook.", "To cook the burgers, heat your oven to 200C/400F/Gas 6. ", "Heat a frying pan over a medium heat and add a good drizzle of olive oil. When hot, add the patties and fry for two minutes on each side. Transfer them to a baking tray and place in the oven for three minutes to finish cooking.", "For the tartare sauce, place the egg yolks, vinegar, mustard, salt and lemon juice into a food processor.", "Blend to combine, then with the motor still running, gradually add the rapeseed oil a little at a time.", "Continue until all the oil has been added and the tartare sauce has thickened.", "Spoon into a bowl, add the remaining ingredients and mix well.", "Season with black pepper and a little more salt if necessary.", "For the gherkin salad, mix the ingredients together then season with salt and freshly ground black pepper.", "Split each roll in half. Drizzle the bottom halves with a little olive oil, then add some gherkin salad. Top with a whiting burger, then spoon on some tartare sauce."]}, {"isVegetarian": false, "title": "White Irish stew", "url": "www_bbc_co_uk_food_recipes_whiteirishstew_80062", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 big knobs butter", "glug olive oil", "4 medium onions, cut into various sizes", "3 cloves garlic, crushed", "6 large potatoes, cut into various sizes ", "8 lamb chops, excess fat trimmed off and reserved - thick neck chops will be best (go to a butcher if you can)", "salt and freshly ground black pepper", "565ml/1 pint good-quality lamb stock", "chopped parsley, optional"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt butter with the oil in a large heavy-bottomed pan with a tight-fitting lid.", "Add the onions and garlic and sweat them gently, slowly teasing the flavours out -  15 minutes or so over a low heat should do it.", "Add the potatoes and stir well to cover in the creamy juices from the onions and garlic.", "Add lots of freshly ground black pepper and three pinches of salt (two pinches if you've got big hands!).", "Leave the potatoes and onions in the pan for a further 15 minutes over a very low heat, taking care not to let them burn - if they begin to stick add a little bit of stock.", "Meanwhile, heat a frying pan over a low heat and add the excess trimmed fat from the lamb to the pan. Let the fat render down and add salt and freshly ground black pepper.", "Remove and solid fatty bits that remain and add the chops to the pan and brown on both sides.", "Once browned, remove the chops and add them to the potatoes.", "Add some of the stock to the frying pan and stir well to get all the browned bits off the bottom of the pan. Add this to the chops and potatoes.", "Add the remaining stock to just below the level of your ingredients. Put the lid on the pan and cook over a low heat for one and a half hours.", "If you like, add some parsley 10 minutes before the stew is ready.", "Remove the stew from the heat and leave to rest for about 10 minutes before serving, then taste and adjust seasoning as necessary."]}, {"isVegetarian": true, "title": "White peach mojito", "url": "www_bbc_co_uk_food_recipes_whitepeachmojito_91695", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 fresh mint leaves, plus 1 sprig mint, to garnish", "25ml/1fl oz fresh white peach purée", "20ml/¾fl oz fresh lime juice", "1 tsp sugar syrup", "35ml/1¼fl oz dark rum", "2 tsp peach liqueur", "dash ginger ale", "1 slice white peach, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mint leaves, peach purée, lime juice, sugar syrup, rum and peach liqueur into a sling glass. Stir with a long-handled spoon.", "Three-quarters fill the glass with crushed ice, then top up with ginger ale. ", "To serve, hook the slice of white peach and the mint sprig over the side of the glass."]}, {"isVegetarian": true, "title": "White onion risotto with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_whiteonionrisottowit_86925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sea salt", "6 large tomatoes, cut in half", "2 tbsp vegetable oil", "2 onions, sliced", "450g/1lb Arborio or similar risotto rice", "1 tbsp fresh thyme leaves", "splash white wine", "650ml/1 pint 3½fl oz hot vegetable stock", "75ml/3fl oz double cream", "400g/14oz baby spinach", "salt and freshly ground black pepper", "parmesan shavings, to serve (vegetarians can substitute similar vegetarian hard cheese)", "2 tbsp vegetable oil", "12 slices vegetarian black pudding"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 140C/285F/Gas 1.", "For the roasted tomatoes, cover a baking tray with sea salt. ", "Place the tomatoes, cut-side up, onto the tray of salt and place into the oven for three hours, or until the tomatoes are completely dried out.", "For the risotto, heat the oil in a deep frying pan and add the onions. Fry the onions until softened but not browned.", "Add the rice, thyme and wine and stir well. When the wine has been absorbed by the rice, add a ladleful of stock and stir constantly until almost all the stock has been absorbed.", "Add another ladleful of stock and repeat the process of stirring and adding stock until the rice is completely cooked through, but still with a bit of 'bite'.", "Add the cream and the spinach and stir well, seasoning, to taste, with salt and freshly ground black pepper.", "For the black pudding, heat the oil in a clean frying pan over a medium heat. Add the black pudding and fry, turning once, until crisp on both sides and completely cooked through.", "To serve, place a generous portion of the risotto into each bowl. Top each bowl of risotto with two roasted tomato halves and three slices of black pudding and garnish with fresh parmesan shavings."]}, {"isVegetarian": false, "title": "Cod with lemon and capers", "url": "www_bbc_co_uk_food_recipes_whiting_with_lemon_and_31206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whiting_with_lemon_and_31206_16x9.jpg", "ingredients": ["1 medium potato, such as maris piper, peeled, thinly sliced into rounds", "75ml/3fl oz clarified butter", "1 tbsp icing sugar", "700g/1½ lbs cod, or white fish, cut into 8 pieces", "salt and freshly ground black pepper ", "3 tbsp olive oil", "1 shallot, finely diced", "150g/5oz unsalted butter", "1 lemon, segmented ", "1 tbsp capers", "1 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.", "Dip the potato slices in the clarified butter and lay onto the lined baking tray. Sift the icing sugar over the top and cover with another piece of greaseproof paper. Place a heavy baking tray on top and bake in the oven for 10-12 minutes, or until cooked through.", "Brush the cod pieces with oil and season with salt and freshly ground black pepper.", "Heat two tablespoons of oil in a large frying pan and fry the cod pieces for one minute on each side, or until cooked through. Remove from the pan and set aside.", "Add the remaining oil to the pan and fry the shallots for 2-3 minutes, or until softened. Add the butter and cook for 3-4 minutes, or until a pale nut-brown colour.", "Add the lemon segments, capers and parsley and remove the pan from the heat.", "To serve, divide the fish among four serving plates, spoon over the sauce and top with the potatoes."]}, {"isVegetarian": false, "title": "Whole baked fish with mushroom and feta stuffed peppers", "url": "www_bbc_co_uk_food_recipes_whole_baked_fish_with_44740", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp sunflower oil", "175g/6oz mushrooms, cleaned and roughly chopped", "20g/½oz blanched hazelnuts, roughly chopped", "4 sun-dried tomatoes in oil, drained well, roughly chopped", "1 garlic clove, finely chopped", "50g/1¾oz dried white breadcrumbs", "½ small bunch parsley, finely chopped", "1 tsp dried chilli flakes", "100g/3½oz feta, crumbled", "2 small red or yellow peppers, cut in half from top to bottom, seeds and stalk removed", "salt and freshly ground black pepper", "1 red onion, thinly sliced", "200g/7oz mushrooms", "175g/6oz new potatoes, unpeeled, cut into 1cm/½in slices", "6 sun-dried tomatoes in oil, drained well", "2 garlic cloves, crushed", "15g/½oz pine nuts", "2 tbsp olive oil", "1 whole fish, gutted and scaled", "1 lemon, halved ", "handful flatleaf parsley, roughly chopped, to serve", "handful fresh basil, roughly shredded, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a roasting tin with kitchen foil.", "Heat the oil in a large frying pan and stir-fry the mushrooms over a high heat for 4 minutes. Add the hazelnuts and cook for another 5 minutes until lightly toasted. Season and remove from the heat.", "Stir in the tomatoes, garlic, breadcrumbs, parsley and chilli flakes until thoroughly combined. Gently fold in the feta.", "Place the peppers, cut side up, in the tin and fill each half with the mushroom and feta stuffing. Cover the surface of the stuffing with a small piece of kitchen foil to prevent burning.", "Bake for 35 minutes, or until the peppers are tender, removing the foil for the last 10 minutes of the cooking time.", "Meanwhile line a large baking tray with baking paper.", "In a large glass bowl, mix together the onion, mushrooms, potatoes, tomatoes, garlic, nuts and oil.", "Spread half of the vegetables onto the tray. Place the fish on top and use the remaining vegetables to stuff the fish cavity and tip over the top. Add the lemon halves and bake for 20–25 minutes or until the fish is cooked through.", "Serve the whole fish on a large serving platter with the stuffed peppers around the fish. Sprinkle with fresh herbs and a squeeze of the roasted lemon."]}, {"isVegetarian": false, "title": "Whole baked fish with potatoes, lemon and sundried tomatoes", "url": "www_bbc_co_uk_food_recipes_whole_baked_fish_with_46332", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_baked_fish_with_46332_16x9.jpg", "ingredients": ["750g/1lb 10oz new potatoes", "1 small unwaxed lemon, sliced", "1 tbsp black onion seeds", "1 x 280g jar sundried tomatoes in oil", "¼ tsp caster sugar", "2  whole fish (about 400g/14oz) such as sea bass, sea trout or Dover sole, cleaned", "small bunch fresh parsley", "small bunch lemon thyme", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Boil the potatoes for 10 minutes in a large pan of water until just tender. Drain, and allow to cool slightly, then slice them lengthways into about 5mm/¼in thick slices.", "Put the potatoes in a large baking dish or roasting tin lined with baking paper and mix with the lemon slices and onion seeds. Remove the sundried tomatoes from their oil, reserving the oil and roughly chop the tomatoes. Mix into the potatoes along with 3 tablespoons of the reserved oil. Season with salt, pepper and the sugar and mix well.", "Season the fish inside and out and place the herbs into the belly cavities, dividing between the fish. Place the fish on top of the potatoes and drizzle over the remaining reserved sundried tomato oil.", "Bake for 25-30 minutes or until the fish is just cooked through and the potatoes are crisping up. Remove from the oven and serve."]}, {"isVegetarian": false, "title": "Whole baked plaice, cider onions, tarragon and anchovy butter", "url": "www_bbc_co_uk_food_recipes_whole_baked_plaice_cider_78626", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "2 white onions, finely sliced", "2 bay leaves", "200ml/7fl oz cider ", "1 plaice (at least 1kg/2lb 4oz), gutted", "salt and pepper", "200g/7oz unsalted butter, softened", "2 shallots, finely chopped", "4 salted anchovy fillets, chopped", "1 bunch tarragon, leaves picked and chopped, few leaves reserved for garnish", "salt and pepper ", "1 lemon, cut into wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a roasting tin add the oil, onions, bay leaves and cider. Place in the oven for 15-20 minutes. ", "Meanwhile make the tarragon and anchovy butter. Place the butter, shallots, salted anchovies and chopped tarragon into a bowl and mix well. Season with salt and pepper and chill until you are ready to cook the fish.", "Season the plaice all over and remove the onions from the oven. Place the fish on top of the onions and then return to the oven and cook for 15 minutes. To check the plaice is cooked, make an incision into the thickest part of the fish and see if the flesh is pulling away from the bone.  ", "Place knobs of the flavoured butter across the fish and then pop the whole lot back into the oven for two minutes.  ", "Serve it in the tray so that you can help yourselves. Serve simply with some of the cider onions, a wedge of lemon and the reserved tarragon leaves. "]}, {"isVegetarian": false, "title": "Whole baked sea bream with a spinach, new potato and parsley salad", "url": "www_bbc_co_uk_food_recipes_whole_baked_sea_bream_41151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole sea bream, gutted and cleaned", "2 garlic cloves, peeled and roughly chopped", "1 red chilli, finely sliced", "1 small onion or leek, thickly sliced", "2 tbsp chopped flatleaf parsley", "1 lemon, sliced", "1 tbsp chopped thyme leaves", "100ml/3½fl oz white wine ", "50ml/2fl oz olive oil", "200g/7oz new potatoes", "50g/1¾oz baby spinach", "2 tbsp flatleaf parsley, roughly chopped", "salt and black pepper", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the baked sea bream, stuff the cavity of the fish with the garlic, red chilli, onion (or leek), parsley and half of the sliced lemon. Put the fish on a baking tray and place the remaining lemon slices and thyme leaves on top. Pour over the white wine, drizzle with olive oil and cover with aluminium foil.", "Bake for 10-15 minutes (depending on the size of the fish), or until the fish is cooked through.", "For the spinach, new potato and parsley salad, heat a pan of boiling water and cook the potatoes for 10-15 minutes. Drain and place into a large serving bowl.", "Add the baby spinach and parsley. Stir and season to taste with salt and pepper.", "In a small bowl, add the olive oil, white wine vinegar and Dijon mustard and whisk to combine. Pour the dressing over the salad just before serving.", "To serve, place the whole sea bream on a serving dish and serve the salad alongside."]}, {"isVegetarian": false, "title": "Whole baked plaice with thyme, cavolo nero, celeriac, walnuts and apple", "url": "www_bbc_co_uk_food_recipes_whole_baked_plaice_with_83393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp butter", "1.5kg/3lb 5oz –2kg/4lb 8oz whole plaice ", "large bunch fresh thyme ", "2 tbsp capers ", "300g/10½oz celeriac , halved, peeled and sliced", "1 garlic clove, crushed", "2 red apples, such as Braeburn or gala, halved, core removed and sliced", "2 tbsp cider vinegar ", "2 tbsp walnuts, plus extra for sprinkling ", "300g/10½oz cavolo nero, leaves torn in half ", "2 tbsp walnut oil ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a large baking tray with  kitchen foil with a sheet of baking paper on top. ", "Rub a tablespoon of the butter over the plaice and season with salt. Lay two thirds of the thyme on the prepared baking tray and place the fish on top. Scatter over the rest of the thyme and the capers. Cover with another sheet of baking paper, folding the edges of the kitchen foil base to seal the parcel. Bake in the oven for 25 minutes. ", "Meanwhile, heat the remaining butter in a large frying pan and fry the celeriac with the garlic and some salt and pepper over a low–medium heat for 5 minutes. Add the apples to the pan and turn the heat up so that the apples and celeriac start to brown. Add the cider vinegar and walnuts and turn the heat down to low. Add the cavolo nero and cook for 5 minutes or until tender. Season with salt and pepper. ", "To serve, transfer the celeriac, apple and cavolo nero to a serving dish and scatter over a few extra walnuts and a drizzle of walnut oil. ", "Allow the plaice to rest in its parcel for 10 minutes before serving. Place the fish on a large platter in its parcel and take to the table for the grand reveal. "]}, {"isVegetarian": false, "title": "Steamed sea bass with a rice noodle salad", "url": "www_bbc_co_uk_food_recipes_whole_baked_seabass_with_36512", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_baked_seabass_with_36512_16x9.jpg", "ingredients": ["4 bok choi, cut into halves", "2 sea bass fillets, skin on", "2cm/1in knob fresh root ginger, thinly sliced", "2 sticks lemongrass, bruised and chopped in half", "2 tbsp sesame oil", "2 tbsp soy sauce", "250g/9oz rice noodles", "4 spring onions, trimmed and thinly sliced", "2 garlic cloves, roughly chopped", "5cm/2in piece fresh root ginger, roughly chopped", "1 long red chilli, roughly chopped", "3 tbsp palm sugar (or substitute soft brown sugar)", "3 tbsp roughly chopped fresh mint", "3 tbsp roughly chopped fresh coriander", "2 tbsp rice wine vinegar", "2 tbsp lime juice", "1 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, heat a pan of water and place a steamer on top. Take a piece of foil. Scrunch up the edges to make a circle with a wall round the edge. Make it the right size to fit into the steamer.", "Put a few leaves of bok choi onto the foil and place the fillets on top. Add more bok choi, ginger and lemongrass and pour over the sesame oil and soy sauce. Sit the foil in the steamer, put the lid on and steam for about four minutes until the fish is cooked (depending on the size of the fillets).", "For the rice noodle salad, place the rice noodles in a large bowl, cover with boiling water and leave for two minutes. Alternatively cook the noodles according to the packet instructions.", "Drain and place back in the bowl along with the spring onions.", "To make a dressing, place the garlic, ginger, chilli, palm sugar, mint, coriander in a pestle and mortar and pound to a paste. Add the vinegar, lime juice and oil and pound some more.", "Just before serving dress the noodle salad and mix.", "To serve, place some of  the noodles on each serving plate. Lift the fillets from the steamer and place them on top of the noodles. Pour the sauce from the foil into the pestle and mortar and mix it, then pour some over the fish."]}, {"isVegetarian": true, "title": "Whole eggs in coconut masala (egg molee)", "url": "www_bbc_co_uk_food_recipes_whole_eggs_in_coconut_23624", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_eggs_in_coconut_23624_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "6 free-range eggs, hard-boiled, peeled and left whole", "1 tsp ground turmeric", "1 tsp Kashmiri chilli powder", "400ml/14fl oz coconut milk", "2 medium red onions, very thinly sliced", "4cm/1½in fresh root ginger, finely shredded", "3 fresh green chillies, thinly sliced, with seeds", "½ tsp salt", "1 tsp sugar", "handful of coriander leaves, chopped", "½ tsp garam masala", "boiled basmati rice "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based saucepan or karahi over a medium heat, add the whole eggs and fry for 1–2 minutes, or until lightly coloured, then add the turmeric and chilli powder and cook for another 30 seconds. Stir in the coconut milk and bring to a simmer.", "Add the onions, ginger, chillies and salt, and simmer for five minutes, or until the coconut milk has reduced in volume by half and the onions are just softened, adding a splash of water if it becomes too thick. Stir in the sugar and coriander and sprinkle with garam masala. Halve the eggs, and serve with rice."]}, {"isVegetarian": false, "title": "Whole fish cooked in a banana leaf with mango chutney", "url": "www_bbc_co_uk_food_recipes_whole_fish_cooked_in_a_01738", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_fish_cooked_in_a_01738_16x9.jpg", "ingredients": ["2 whole fresh fish (preferably sea bass or rainbow trout) weighing approximately 300g/10½oz each, gutted ", "1 spring onion, thinly sliced", "large handful coriander stalks", "2 x banana leaves or 2 large sheets of foil", "fine sea salt, to season ", "3 garlic cloves, left whole", "½ red onion, chopped", "large handful coriander leaves, finely chopped", "6 small green mangoes (or 2 large mangoes), peeled and thinly sliced", "1 lemon, zest only", "1 tbsp mustard seed oil", "½ cucumber, finely chopped", "pinch of sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["The fish can be cooked on the barbecue or in the oven. If cooking in the oven, preheat the oven to its highest temperature.", "Stuff the fish with the onion and coriander stalks and season with sea salt. Wrap each fish in a banana leaf (or foil). Put on a tray and cook in the oven or on the barbecue for 12 minutes.", "Meanwhile, for the chutney burn the garlic cloves in their skins on an open flame to chargrill them. When cool enough to handle, remove the garlic from their skins and finely chop. ", "Mix the onion, garlic, coriander, mango, lemon zest and mustard seed oil. Add the cucumber, crush it and mix to combine it into the chutney. Season with salt. ", "Serve the fish in the banana leaf with the chutney on the side. "]}, {"isVegetarian": true, "title": "Whole lemon cake with lemon cheesecake icing", "url": "www_bbc_co_uk_food_recipes_whole_lemon_cake_with_40866", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_lemon_cake_with_40866_16x9.jpg", "ingredients": ["1 thin-skinned lemon", "50g/1¾oz caster sugar ", "2 small or 1 large thin-skinned lemons", "275g/9¾oz softened butter", "275g/9¾oz caster sugar", "275g/9¾oz self-raising flour", "2 level tsp baking powder", "4 free-range eggs", "50g/1¾oz soft butter", "175g/6oz icing sugar", "250g/9oz full-fat Italian mascarpone", "175g/7oz fondant icing sugar "], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the decoration, using a zester, peel long strips of lemon rind. If you haven’t got a zester, thinly peel the lemon, then cut into fine strips. Set aside the remaining lemon.", "Place the peel in a saucepan, cover with boiling water and half the caster sugar and boil for one minute. Drain and pat dry, then put onto non-stick parchment paper. Scatter over the remaining sugar and toss to coat the lemon peel. Arrange on the non-stick baking parchment and leave in a warm place to dry out for as long as possible or overnight, until crisp. If you are in a hurry, dry out in a low oven 110C/225F/Gas ¼ for 30 minutes. ", "Cut the zested lemon in half and squeeze the juice. Set it aside to make the icing.", "For the cake, place the two whole (or one large) lemons in a small saucepan, cover with water, bring to the boil and simmer for 20 minutes, or until very soft and tender. Drain, cut the lemons in half and remove any pips.", "Preheat the oven to 180C/350F/Gas 4 (160C fan).", "Place the lemons, including the skin, in a food processor and process until smoothish, but still with some chunky bits. Put the mixture in a small bowl.", "Add all the remaining cake ingredients into the food processor and blend until smooth. Lift out the blade and stir in just over half of the lemon pulp. Set the rest aside.", "Divide the mixture evenly between the two tins and bake for 30 minutes, or until golden-brown and just shrinking from the edge of the tins. ", "Leave to cool for five minutes, then turn the cakes out, peel off the baking parchment and leave to finish cooling on a wire rack. ", "For the lemon filling, blend the butter and icing sugar in a food processor until smooth and creamy. Add the mascarpone, blend again and then add the lemon pulp and blend until just mixed.", "Cut both cakes in half so that you have four layers. Spread the lemon cream evenly between the layers, stacking them on top of each other.", "Mix the fondant icing sugar with 1-2 tbsp lemon juice (from the lemon used to make the candied zest decoration) to make a thick pouring consistency. Pour the icing over the top of the cake allowing it to drizzle down. Sprinkle the candied lemon rind on top. "]}, {"isVegetarian": false, "title": "Whole mackerel with butternut squash and a fennel and chicory salad", "url": "www_bbc_co_uk_food_recipes_whole_mackerel_with_76893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel, butterflied and bones removed, left whole", "4 tbsp rapeseed oil", "2 tbsp olive oil", "1 garlic clove, chopped", "1 shallot, chopped", "1 butternut squash, peeled and cut into small cubes", "2 star anise", "250ml/9fl oz chicken stock", "2 tbsp sesame seeds", "2 tbsp chopped fresh parsley", "2 heads fennel, shaved on a mandoline and placed in iced water", "1 head Little Gem lettuce, leaves separated", "1 head chicory, leaves separated", "2 egg yolks ", "1 tbsp Dijon mustard ", "1 lemon, juice only ", "200ml/7fl oz olive oil", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and heat a griddle pan.", "Brush the mackerel with oil and season with salt and pepper. Place on the hot griddle and cook briefly on both sides. Finish them in the oven for 2-3 minutes.", "For the butternut squash, heat a large frying pan and add the oil. Once hot, add the garlic and shallot and cook for 2-3 minutes. Add the squash and star anise and cook for a further minute. Pour in the chicken stock and season with salt and pepper. Cook for 4-5 minutes or until the squash is tender. ", "For the salad, drain the fennel and add to a large bowl with the Little Gem and chicory.", "For the dressing, blend the egg yolks, mustard and lemon juice in a food processor. With the motor running, gradually add the oil until the dressing emulsifies. Season with salt and pepper, to taste.", "Pour the dressing over the salad leaves and mix to combine.", "To serve, add the sesame seeds and fresh parsley to the squash and place on serving plates topped with the mackerel. Serve the salad on the side."]}, {"isVegetarian": false, "title": "Whole roast duck with braised lettuce and potato pancakes", "url": "www_bbc_co_uk_food_recipes_whole_roast_duck_with_56138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole English free range duck, trimmed, wings removed", "salt", "1 tsp Sichuan peppercorns, ground", "300ml/10fl oz chicken or duck stock (preferably made with the giblets)", "6 sprigs thyme, leaves picked", "100g/3½ oz butter", "1 lemon, peel only", "4 Little Gem lettuces, cut in half lengthways and washed", "150g/5½oz clear honey", "75g/2½oz soy sauce", "250g/9oz cold baked potato, flesh only, mashed", "75g/2½ oz plain flour", "1 tsp baking powder", "2 free-range eggs", "125ml/4fl oz milk", "salt and pepper to taste", "oil, for cooking"], "serves": "Serves 2 generously", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Using a small sharp knife, pierce the skin of the duck all over, but be careful not to tear holes in the skin. Season the duck with salt and the ground Sichuan pepper and place on a wire rack sat in a roasting tin. Roast in the oven for 25 minutes.", "Pour any excess fat into a jug. Reduce the oven temperature to 120C/250F/Gas ½. When at 120C/250F/Gas ½, return the duck to the oven and cook for a further 1¼ hours - basting with the reserved fat every 20 minutes. ", "While the duck is roasting, bring the duck or chicken stock up to the boil with the thyme, butter and peeled rind from one lemon. Place the lettuce into the stock and cover with a lid or tin foil. Turn the heat down and braise on the hob for 8-10 minutes, or until the lettuce starts to wilt. Remove from the heat and keep warm until ready to serve.", "Remove ninety percent of the duck fat from the roasting tin and pour the honey over the duck. Turn the oven up to 180C/350F/Gas 4 and put the duck back into the oven for a further 15-20 minutes, basting every five minutes and making sure the honey doesn’t burn. On the final baste, drizzle the soy sauce over the duck. When cooked, remove the duck from the oven and set aside to rest.", "While the duck is resting make the potato pancakes. Mix the cold mash, flour and baking powder together. In a separate bowl or jug, whisk the eggs and milk together. Pour into the mash and flour mixture and gently stir to make a batter (don't worry about a few lumps). Season with salt and pepper to taste. Fry spoonfuls of the batter mix in a non-stick frying pan with a little oil until golden-brown on each side. Remove from the heat and keep warm.", "Carve the duck and serve with the braised lettuce and the potato pancakes. Spoon a little of the cooking liquor from the lettuce over the top and tuck in."]}, {"isVegetarian": false, "title": "Whole roast John Dory with mussels and langoustine", "url": "www_bbc_co_uk_food_recipes_whole_roast_john_dory_54432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil for drizzling", "50g/1¾oz butter", "1 lemon, zest only", "2-3 fat garlic cloves, thinly sliced", "1 large John Dory (around 1kg/2lb 4oz,) cleaned and gutted", "3-4 bay leaves", "100ml/3½fl oz white wine or vermouth", "300g/10½oz mussels, cleaned, de-bearded", "8 langoustine, raw shell-on", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Line a large roasting tin with foil, leaving plenty of overlap so you can create a tent around the fish and shellfish. Drizzle the foil with olive oil and add a few small knobs of butter and scatter with half of the lemon zest and garlic. Season the fish inside and out. Place a small amount of the remaining lemon zest, garlic and a bay leaf inside the fish. Place the fish on top of the seasoned foil, cover with the remaining lemon zest, garlic and bay leaves and pour over the white wine or vermouth, then drizzle with a little more olive oil.", "Bring the foil together over the fish and fold over the edges to seal and make an airtight tent. Bake in the oven for 20 minutes. ", "Discard any open mussels that do not close when given a sharp tap. Remove the fish from the oven, open the foil and add the mussels and langoustine. Dot with more butter, then reseal the foil and return to the oven for 5-10 minutes, until the fish is cooked through and the mussels have opened. Discard any mussels that haven’t opened. Serve with the buttery juices spooned over."]}, {"isVegetarian": true, "title": "Whole roasted celeriac with hazelnuts, sourdough croutons and greens", "url": "www_bbc_co_uk_food_recipes_whole_roasted_celeriac_99598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 celeriac, scrubbed", "2 tbsp unsalted butter", "½ tbsp salt", "2 juniper berries ", "250ml/9fl oz white wine vinegar", "250g/9oz sugar ", "2 pink or yellow beetroots, peeled and thinly sliced ", "4 slices sourdough bread, cut into cubes", "4 tbsp butter ", "½ tbsp sherry vinegar or white wine vinegar ", "salt and freshly ground black pepper", "1 bunch pea shoots", "1 bunch celery leaves ", "250g/9oz hazelnuts, peeled and toasted"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Rub the celeriac with the unsalted butter and half a tablespoon of salt and wrap in aluminium foil. Roast in the oven for 45 minutes, or until cooked all the way through. ", "Meanwhile, crush the juniper berries with a mortal or the back of a knife. Put in a saucepan with the white wine vinegar, sugar and a teaspoon of salt and bring to a boil. Whisk until the sugar has dissolved. Add 500ml/18fl oz cold water.", "Put the beetroots in the pickling liquid and set aside for 30 minutes.", "To make the croutons, melt 2 tablespoons of butter in a frying pan over a medium heat. ", "Fry the cubes of bread for 5–10 minutes, or until golden brown and crispy. Remove with a slotted spoon and drain on kitchen paper. Season with salt and pepper. ", "In the same pan, make the brown butter sauce. Add the remaining 2 tablespoons of butter and cook until golden brown. Add the sherry vinegar and season with salt and pepper. ", "Mix together the pickled beetroot slices, peashoots and celery leaves. Dress with a little of the pickling liquid. ", "To serve, cut the celeriac into quarters. Dive between four plates and top with the croutons, hazelnuts, salad and a drizzle brown butter sauce."]}, {"isVegetarian": false, "title": "Roast Dover sole with oysters and greens", "url": "www_bbc_co_uk_food_recipes_whole_roasted_dover_sole_08981", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz plain flour", "1 Dover sole, filleted ", "75g/2½oz unsalted butter", "50g/1¾oz salted butter", "1 lemon, juice only", "1 cucumber, peeled and chopped", "2 tbsp chopped fresh dill", "salt and freshly ground black pepper", "7 oysters, shucked and cleaned (ask your fishmonger to do this for you)", "squeeze of lemon juice ", "300ml/10fl oz vegetable or rapeseed oil, plus an extra drizzle", "50g/1¾oz plain flour", "1 free-range egg, beaten", "50g/1¾oz panko breadcrumbs", "½ head broccoli, broken into florets", "100g/3½oz French beans", "1 large handful baby spinach", "50g/1¾oz unsalted butter", "squeeze of lemon juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "To make the sole, season the flour and dust the sole until completely covered. ", "Melt the unsalted butter in a large ovenproof frying pan over a medium heat. Put the sole fillets in the pan, dark side up, and cook gently for 5 minutes. Transfer to the grill and cook for 3–4 minutes, or until cooked though.", "Meanwhile, olace a clean frying pan over a medium heat. Melt the salted butter and cook until nutty brown. Turn off the heat and add the lemon juice (stand back a little as it will splutter). Stir in the cucumber and dill and set aside.", "To make the oysters, preheat the oil in a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Blend three oysters with a squeeze of lemon and a drizzle of oil to make the mayonnaise. Season. ", "Put the flour, egg and breadcrumbs in separate bowls. Dip the oysters first in the flour, then the egg, then the breadcrumbs. Shake off any excess and carefully lower them into the fryer. Deep-fry until golden brown. remove with a slotted spoon and drain on kitchen paper.", "To make the greens, blanch the broccoli and french beans in a saucepan of boiling water for 3 minutes. Sauté the spinach in the butter, then add the beans and broccoli. Season with salt and pepper and a squeeze of lemon juice. ", "To serve, transfer the sole fillets to a serving plate. Add the greens and pour over the cucumber and dill butter. Serve with the deep-fried oysters and the oyster mayonnaise."]}]