[{"ingredients": ["40 g / 1½ oz de mantequilla", "65g / 2¼ oz de mantequilla de maní suave", "45g / 1% C2% BEoz% 20buena calidad% 20dark% 20chocolate,% 20minimum% 2065 %% 20cocoa% 20solids", "100 g / 3½ oz de azúcar en polvo", "2 huevos medianos de granja", "35g / 1¼ oz de harina común", "4 plátanos, pelados, picados y congelados", "100g / 3½ oz de crema", "75g / 2¾oz de cacahuetes tostados, picados"], "method": ["Precalentar el horno a 180 ° C / 160 ° Fan / Gas Mark 4.", "Derrita la mantequilla, la mantequilla de maní y el chocolate en una cacerola mediana. Retire del fuego y mezcle el azúcar, los huevos y la harina.", "Transfiera la mezcla a un recipiente y deje enfriar. Coloque en la nevera para descansar durante 10 minutos.", "Mientras tanto, alinee los anillos de plata de la línea 4 (7 cm / 2¾ pulgadas de diámetro y 5 cm / 2 pulgadas de profundidad) con papel de hornear y colóquelos en una bandeja para hornear forrada.", "Vierta la mezcla de fondant en una manga pastelera grande y vierta la mezcla en los anillos (alternativamente, instálela). Hornea por 8-10 minutos.", "Mientras tanto, para el helado, coloque los plátanos en una licuadora y blitz hasta que estén suaves. Agregue la crème fraîche y mezcle hasta que quede suave.", "Con cuidado, transfiera los fondants a las placas de servir con una espátula, luego retire los anillos y el papel. Sirva con una buena cucharada de helado al lado y esparza sobre los cacahuetes tostados."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_fondants_62758", "title": "Fondant de mantequilla de maní con helado de plátano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "120 g / 4 oz de azúcar morena suave", "50g / 1¾oz de mantequilla de maní crujiente", "175g / 6oz de mantequilla, ablandada", "1 cucharadita de extracto de vainilla", "2 huevos grandes de gallinas camperas", "Harina normal de 200g / 7oz", "1 cucharadita de bicarbonato de soda", "250 g / 9 oz de avena", "150g / 5½oz de azúcar glas", "250g / 8oz de mantequilla de maní crujiente", "100 g / 3½ oz de mantequilla, ablandada"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 4 y alinee dos bandejas grandes para hornear con papel de hornear.", "Con un batidor eléctrico, bata los azúcares, la mantequilla de maní, la mantequilla y el extracto de vainilla hasta que estén pálidos y suaves. Agregue los huevos, uno por uno, mezclando bien después de cada adición para que la mezcla no cuaje.", "Batir la harina y el bicarbonato de soda, luego con una espátula o cuchara de madera, doblar la avena hasta que se combinen.", "Coloque 40 cucharadas colmadas de la mezcla en las bandejas y hornee durante 15 minutos o hasta que estén doradas. Deje que se enfríe ligeramente en las bandejas antes de transferirlas a una rejilla para que se enfríen por completo.", "Tamiza el azúcar glas en un tazón grande y bate la mantequilla de maní y la mantequilla. Agregue una cucharada colmada del relleno a la parte inferior plana de 20 de las galletas y sándwich junto con las galletas restantes."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_sandwich_13619", "title": "Galletas de sándwich de mantequilla de maní", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de mantequilla", "200g / 7oz% 20dark% 20chocolate% 20 (at% 20least% 2060 %% 20cocoa% 20solids)% 20or% 20milk% 20chocolate% 20 (o% 20a% 20mixture% 20of% 20both)", "Galletas digestivas 250 g / 9 oz", "200 g / 7 oz de azúcar morena clara", "300 g / 10½ oz de mantequilla de maní crujiente", "1 cucharadita de extracto de vainilla"], "method": ["Alinee una lata cuadrada de 20 cm / 8 pulgadas con papel pergamino para hornear, dejando algo de papel sobrante colgando sobre los bordes (esto hace que sea más fácil levantarlo una vez que lo haya colocado).", "Derrita la mantequilla en una sartén grande a fuego lento.", "Coloca el chocolate en cuadrados y colócalo en un tazón pequeño. Derrita en el microondas en ráfagas de 30 segundos, revolviendo bien entre cada adición o sitúe el recipiente sobre una sartén sobre el agua hirviendo a fuego lento. Asegúrate de que el fondo de la sartén no toque el agua o que el chocolate se \"agarre\" y se ponga realmente granuloso y rígido.", "Blitz las galletas digestivas y el azúcar moreno en una licuadora o procesador de alimentos para dar migajas finas. Inclínalas en la mantequilla derretida. Agregue la mantequilla de maní y el extracto de vainilla y mezcle para que todo esté bien combinado.", "Incline la mezcla en la lata forrada y presione con fuerza hacia abajo con la parte posterior de la cuchara. Tiene que ser realmente compacto y apretado. Luego vierta sobre el chocolate derretido, inclinando la lata hacia adelante y hacia atrás un poco para que todo quede uniformemente cubierto. Pop en el congelador durante 30 minutos para reafirmar (o la nevera durante una hora).", "Una vez que el chocolate esté listo, retíralo del congelador (o refrigerador). Sácalo de la lata con la ayuda del pergamino para hornear. Retire el papel y luego use un cuchillo afilado para dividirlo en 16 cuadrados y servir."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_squares_17553", "title": "Cuadrados de la mantequilla de cacahuete", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peanut_butter_squares_17553_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 2oz de cacahuetes tostados en seco", "50g / 2oz de pan rallado seco", "4 pechugas de pollo deshuesadas y sin piel, cortadas en tiras", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, ligeramente golpeados", "1 lima, descuartizado", "aceite vegetal, para freír", "1 cucharada de aceite vegetal", "1 chalote, finamente picado", "1 chile rojo, finamente picado", "2 dientes de ajo, picados", "Jengibre fresco de raíz de 5cm / 2in en pieza, aproximadamente picado", "75ml / 3fl oz de leche de coco", "1 lima, solo jugo", "1 cucharada de salsa de soja", "150g / 5oz de cacahuetes tostados y salados", "2 pequeñas lechugas gemelas, hojas separadas", "1 cebolla roja pequeña, finamente rebanada", "Rábanos de 110g / 4oz, finamente rebanados", "3 cucharadas de hojas de menta fresca en rodajas finas,", "1 lima, solo jugo", "2 cucharadas de aceite vegetal"], "method": ["Mezcle los cacahuetes y las migas de pan en un procesador de alimentos con un polvo fino, espolvoree sobre un plato. Espolvorea la harina en un plato aparte.", "Separe las tiras de pollo en la harina, luego sumerja en el huevo y revuelva en las migas de maní.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 190 ° C / 375 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Freír las tiras de pollo durante 3-4 minutos hasta que estén doradas. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Mientras tanto, para la salsa satay, caliente el aceite en una sartén, agregue la chalota, el chile, el ajo y el jengibre y fría por 2-3 minutos, o hasta que se suavice un poco.", "Vierta la leche de coco, el jugo de lima y la salsa de soja y cocine a fuego lento.", "Agregue los cacahuetes, luego mezcle la mezcla en un procesador de alimentos con una salsa gruesa. Agregue más salsa de soja y jugo de lima al gusto.", "Para la ensalada, mezcle las hojas, la cebolla roja, los rábanos y la menta juntas en un tazón hasta que estén bien combinadas.", "Batir el jugo de lima y el aceite vegetal en un tazón y mezclar con la ensalada hasta que estén bien combinados.", "Para servir, coloque un poco de ensalada en el plato, con las tiras de pollo al lado. Coloque la salsa satay en un tazón pequeño y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_peanut_chicken_with_54593", "title": "Pollo de maní con salsa de satay y ensalada de gema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "2 cucharadas de azúcar glas", "2 cucharadas de cacao en polvo", "140g / 5oz de mantequilla sin sal, cortada en cubos", "2 yemas de huevo de rango medio", "1 cucharadita de jugo de limón", "400 ml / 14 fl oz crema doble", "400g / 14oz% 20dark% 20chocolate% 20 (mínimo% 2053 %% 20cocoa% 20solids),% 20chopped", "60 g / 2¼ oz de mantequilla", "65g / 2½oz de azúcar moreno", "50g / 1¾oz de mantequilla", "2 cucharadas de jarabe de oro", "Crema doble 85ml / 3fl oz", "Cacahuetes salados tostados de 200g / 7oz, cortados en trozos pequeños", "Cacahuetes tostados 130g / 4½oz", "1½ cucharadas de aceite de maní", "1 cucharada de miel", "½ cucharadita de canela en polvo", "200ml / 7fl oz crema batida", "1½ cucharada de azúcar glas", "2 cucharadas de harina de maíz", "2½ cucharadas de mantequilla de maní suave", "50 g / 1% C2% BEoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "3 cucharadas de mantequilla de maní", "6 cucharadas de maltodextrina de tapioca", "cacao en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la masa de chocolate en pasta cocida, tamice la harina, el azúcar glas y el cacao en polvo en un tazón. Frote la mantequilla con las puntas de los dedos y luego agregue las yemas de huevo, el jugo de limón y 2 cucharadas de agua fría. Junta la masa con las manos (si la masa está demasiado seca agrega un poco más de agua). Envuelva la masa en una película adhesiva y enfríe durante 5 minutos en el congelador, o 15 minutos en la nevera.", "Sobre una superficie de trabajo ligeramente enharinada, extienda la masa hasta el grosor de una moneda de 1 euro y úsela para revestir una lata de flan con base suelta de 23 cm / 9 pulgadas, o una lata grande de tarta rectangular. Pinchar la base, alinear con el pergamino para hornear y llenar con alubias para hornear.", "Coloque la lata en una bandeja para hornear y hornee durante 25 minutos. Retire el papel de hornear y los frijoles y hornee por otros 10 minutos. Dejar de lado para enfriar.", "Para el ganache de chocolate, llevar la crema a ebullición en una cacerola. Pon el chocolate en un tazón resistente al calor. Retire la crema del fuego y vierta sobre el chocolate. Revuelva hasta que el chocolate se derrita e incorpore en la crema. Agregue la mantequilla y revuelva para combinar. Reserve un molde de ganache para hacer las trufas y colóquelo en la nevera. Divida el resto entre 2 recipientes y manténgalos a temperatura ambiente.", "Para el caramelo salado, caliente el azúcar, la mantequilla y el jarabe dorado en una sartén hasta que el azúcar se disuelva. Agregue la crema y cocine a fuego lento. Transfiera a un recipiente y deje enfriar por completo. Una vez que esté frío, agregue los cacahuetes, vierta en la caja de repostería fría y enfríe en la nevera hasta que los prepare.", "Para la mantequilla de maní con canela, coloque los cacahuetes en un procesador de alimentos y pulse hasta que los cacahuetes se junten en una bola. Agregue el aceite, la miel y la canela y procese hasta obtener una pasta homogénea.", "Para la mousse de mantequilla de maní de chocolate, batir la crema con el azúcar impalpable y la harina de maíz hasta que se formen picos suaves cuando se quite la batidora. Dobla en 1 tazón de la ganache reservada y 2½ cucharadas de la mantequilla de maní de canela. Extienda la mousse sobre la tarta helada cuando se haya puesto el caramelo.", "Para la decoración de chocolate, derrita el chocolate en ráfagas cortas hasta que alcance los 32 ° C en un termómetro de cocina. Con una cuchara, coloque una manga pastelera desechable y forre una bandeja para hornear con papel para hornear antiadherente. Recorta una pequeña esquina de la manga pastelera y coloca formas decorativas en el papel. Apartar para enfriar y establecer.", "Para el polvo de maní, si está usando, agregue la mantequilla de maní y la maltodextrina de tapioca a un procesador de alimentos y pulse hasta que se combinen. Forma la cazuela de ganache refrigerado en 3 bolas y cúbrelas con el polvo de maní para hacer trufas.", "Para ensamblar la tarta, cuando la capa de mousse esté lista, extiende una capa de ganache sobre la parte superior. Regrese la tarta a la nevera hasta que se establezca el ganache.", "Retire la tarta de la lata y el polvo de la parte superior con cacao en polvo. Decora con trufas y formas de chocolate."], "url": "www_bbc_co_uk_food_recipes_peanut_salted_caramel_64385", "title": "Cacahuete salado con caramelo y tarta de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 tarta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas de crema de 200g / 7oz, aplastadas", "150 g / 5½ oz de mantequilla sin sal, derretida", "600g / 1lb 5oz de queso crema con toda su grasa", "150 g / 5½ oz de azúcar en polvo", "6 huevos de gallinas camperas", "salpicadura de extracto de vainilla", "150g / 5½ oz de mantequilla de maní crujiente", "150 g / 5½ oz de mermelada de fresa preparada"], "method": ["Para la base, mezcle las galletas trituradas y la mantequilla derretida en un recipiente hasta que estén bien combinadas. Presione la mezcla en el fondo de una lata de torta de forma de resorte de 23cm / 9in para formar una capa uniforme. Enfriar en la nevera durante 20 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Mientras tanto, para el relleno, mezcle el queso crema, el azúcar, los huevos y el extracto de vainilla en un procesador de alimentos hasta que quede suave.", "Vierta la mezcla de cobertura en un tazón y vierta la mantequilla de maní.", "Cuando la base se haya enfriado, extienda la mermelada de fresa sobre ella en una capa uniforme, dejando un espacio libre de 2,5 cm en los bordes. Cuchara sobre la mezcla de cobertura y extender uniformemente con una espátula.", "Hornee la tarta de queso en el horno durante 50 minutos a una hora, o hasta que la tarta de queso salte hacia atrás cuando se presione ligeramente en el centro con un dedo y una brocheta insertada en el centro de la tarta de queso salga limpia.", "Cuando la tarta de queso se haya cocinado, apague el horno y deje la torta de queso en el horno para que se enfríe (esto evitará que se agriete)."], "url": "www_bbc_co_uk_food_recipes_peanutbutterandjelly_92479", "title": "Mantequilla de maní y pastel de gelatina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 perdices, cortadas por la mitad a lo largo", "1 cucharadita de sal", "2 cucharadas de vinagre de malta", "2 cucharadas de jengibre y pasta de ajo (mezclando 1 cm / ½ en trocitos de jengibre y 1 diente de ajo con 1 cucharadita de agua)", "1 cucharadita de semillas de comino", "200ml / 7fl oz de yogur griego", "2 cucharaditas de mango seco en polvo", "3 cucharadas de cacahuetes sin sal tostados, aplastados", "2 chiles verdes calientes frescos, finamente picados", "1 cucharada de aceite vegetal", "2 cucharadas de tallos de cilantro, finamente picados", "½ limón, solo jugo", "4 pinchos de madera, empapados en agua tibia", "150g / 5oz de quinua", "3 cucharadas de aceite vegetal o de maíz", "1 chile rojo seco, partido en 3 piezas", "1 cucharadita de semillas de mostaza", "20 hojas frescas de curry", "1 cebolla grande, finamente picada", "1 chile verde, finamente picado", "Jengibre fresco de la raíz de la pieza de 1cm / ½-inch, finamente tajado", "2 tomates, picado grueso", "1½ cucharadita de sal", "1 cucharadita de chile rojo en polvo", "½ cucharadita de azúcar", "1 cucharada de cilantro fresco o albahaca, finamente picado", "½ limón, solo jugo"], "method": ["Para la perdiz, precaliente el horno a 200C / 290F / Gas 6 y precaliente la parrilla a alto.", "Coloque la perdiz en un plato no reactivo. Mezcle la sal, el vinagre de malta, el jengibre y la pasta de ajo en un tazón pequeño.", "Con una cuchara, pegue la pasta sobre la perdiz y déjela marinar durante unos minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue las semillas de comino y fría hasta que estén fragantes.", "Incline las semillas de comino en un almirez y mortero y aplastelas ligeramente, luego colóquelas en un tazón con el yogur, el mango seco, los cacahuetes tostados triturados, los chiles verdes picados y el aceite y agítelos.", "Agregue los tallos de cilantro y el jugo de limón, luego distribuya esta mezcla sobre la perdiz. Si tiene tiempo, puede dejar la perdiz para marinar durante al menos 30 minutos.", "Ensarte la perdiz en los pinchos de madera empapados, colóquela en una bandeja de asar y transfiérala al horno para cocinar durante 8-10 minutos. Retire y coloque debajo de la parrilla para cocinar por otros tres minutos, o hasta que esté cocido a su gusto. Retire la carne de los pinchos y deje en un lugar cálido para descansar.", "Para la quinua, remoje la quinua en agua fría durante 15 minutos, luego drene y enjuague.", "Coloque la quinua en una cacerola con 300 ml / 10 fl oz de agua con sal, deje que hierva, luego reduzca el fuego y cocine a fuego lento durante unos 15 minutos, o hasta que los granos estén cocidos, pero aún retenga algo - la quinoa desarrolla un anillo blanco alrededor del circunferencia de cada grano cuando está casi listo. Drene cualquier exceso de agua.", "Caliente el aceite en una sartén de base pesada y agregue el chile rojo y las semillas de mostaza. (PRECAUCIÓN: mantenga la sartén bien lejos de los ojos y la cara ya que las semillas de mostaza pueden explotar). Deje que las semillas crepiten y chisporroteen durante unos 30 segundos, luego agregue las hojas de curry.", "Cuando las hojas de curry estén crujientes, agregue la cebolla y cocínelas durante 3-4 minutos, hasta que comiencen a dorarse. Agregue el chile verde y el jengibre y revuelva por un minuto.", "Agregue el tomate, la sal y el chile en polvo y cocine a fuego medio durante 3-4 minutos, hasta que la mayor parte de la humedad del tomate se haya evaporado.", "Agregue la quinua cocida en la sartén y mezcle durante 1-2 minutos, hasta que se caliente. Agregue el azúcar, el cilantro o la albahaca y el jugo de limón y revuelva para combinar.", "Para servir, coloque la quinua en el centro de cada una de las cuatro placas para servir. Cubra cada porción de quinua con dos mitades de perdiz."], "url": "www_bbc_co_uk_food_recipes_peanutanddriedmangoc_90062", "title": "Maní y perdiz seca en costra de mango con hoja de curry y quinoa de tomate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cacahuetes salados asados ​​250g / 9oz", "Crema doble de 300 ml / 11 fl oz, batida hasta que se forman picos suaves cuando se quita la batidora", "300g / 11oz de queso crema con alto contenido de grasa", "250 g / 9 oz de crema fresca", "6 cucharadas de azúcar glas", "50 g / 2 oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "175 g / 6 oz de chocolate negro, cortado en trozos pequeños", "50g / 2oz de mantequilla", "50 g / 2 oz de azúcar en polvo", "4-6 plátanos bebé, pelados y cortados por la mitad a lo largo", "40g / 1½ oz de panal recubierto de chocolate, cortado en rodajas, para servir"], "method": ["Para la tarta de queso, mezcle los cacahuetes en un procesador de alimentos con una pasta mantecosa.", "En un tazón, bata la crema doble, el queso crema y la crème fraîche juntos hasta que estén suaves y bien combinados.", "Dobla en dos tercios de los cacahuetes molidos y mezcla hasta que estén bien combinados.", "Agregue el azúcar glas una cucharada a la vez, al gusto.", "Coloque un anillo de 7,5 cm / 3 pulgadas de chefs (de al menos 5 cm de altura) en cada plato de servir. Con cuidado, divida la mezcla de la torta de queso por igual entre los anillos de los cocineros, tocando la mezcla después de agregar cada cucharada para eliminar las bolsas de aire.", "Para la salsa de maní de chocolate, caliente el azúcar, el agua y el chocolate negro en una sartén a fuego lento hasta que el chocolate se haya derretido. Una vez que el chocolate se haya derretido, bata la mezcla hasta obtener una salsa suave.", "Agregue los cacahuetes molidos restantes y revuelva hasta que estén bien combinados.", "Para las bananas, caliente una sartén por separado hasta que fume, agregue la mantequilla y el azúcar y caliente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto.", "Agregue los plátanos y fría por 2-3 minutos en cada lado, o hasta que estén dorados por ambos lados.", "Para servir, usando un soplete, calienta el anillo de cada cocinero para aflojarlo, luego quita el anillo de los chefs de cada tarta de queso. Ponga un poco de salsa de maní de chocolate y una cucharada de plátanos salteados al lado de cada pastel de queso. Adorne cada tarta de queso con las rebanadas de panal recubierto de chocolate."], "url": "www_bbc_co_uk_food_recipes_peanutbuttercheeseca_90361", "title": "Tarta de queso de mantequilla de maní con salsa de cacahuete y plátanos salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de mantequilla", "500g / 1lb 2oz de azúcar moreno oscuro", "120ml / 4fl de leche en oz", "250g / 9oz de mantequilla de maní crujiente", "1 vaina de vainilla, solo semillas", "300g / 10½oz de azúcar glas"], "method": ["Derrita la mantequilla en una cacerola a fuego medio.", "Agregue el azúcar morena y la leche, y deje hervir durante 2 a 3 minutos, sin remover.", "Retire del fuego y agregue la mantequilla de maní y las semillas de vainilla.", "Coloque el azúcar glas en un tazón grande y vierta la mantequilla caliente y la mezcla de azúcar encima. Con una cuchara de madera, bata la mezcla hasta que quede suave.", "Viértalo en una bandeja para hornear cuadrada de 20 cm / 8 pulgadas y déjelo a un lado para que se enfríe un poco, luego colóquelo en el refrigerador para enfriarlo por completo.", "Cortar el dulce de azúcar en cuadrados con un cuchillo afilado, salir de la lata y almacenar en un recipiente hermético."], "url": "www_bbc_co_uk_food_recipes_peanutbutterfudge_93630", "title": "Dulce de mantequilla de maní", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 36-42 piezas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peanutbutterfudge_93630_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de maní, sin cáscara", "½ pechuga de pollo, sin piel, cortada en tiras", "3 cucharadas de harina común", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de aceite vegetal", "2 pak choi, dividido por la mitad a lo largo", "2 cucharadas de aceite de sésamo", "½ cucharadita de sal", "½ chile rojo, picado", "2 cucharadas de salsa de soja", "½ lima, solo jugo", "2 limas, solo jugo", "2 cucharadas de azúcar moreno", "2 cucharadas de salsa de soja", "½ chile rojo, picado", "2 cucharadas de cilantro fresco picado"], "method": ["Para el pollo de maní, coloque los cacahuetes en un procesador de alimentos y pulse las migas. Incline sobre un plato grande.", "Polvo de pollo en la harina, luego sumergir en el huevo batido y, finalmente, rodar las migas de maní. Calentar el aceite en una sartén y freír los goujons, en tandas, durante 2-3 minutos en ambos lados, o hasta que estén dorados, crujientes y cocidos.", "Para el pak choi, mezcle todos los ingredientes de pak choi en un tazón. Caliente una cacerola hasta que esté humeando, luego incline la mezcla de pak choi y cocine por 4-5 minutos, volteándola de vez en cuando, o hasta que el pak choi esté marchito y tierno.", "Para el aderezo, combine todos los ingredientes del aderezo en un tazón y mezcle bien.", "Sirva el pak choi junto con el pollo de maní, con el aderezo cucharada alrededor de los bordes del plato."], "url": "www_bbc_co_uk_food_recipes_peanutchickengoujons_90349", "title": "Goujons de pollo de maní con chile pak choi y aderezo de lima y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina normal", "pizca de chile en polvo", "Filete hoki 300 g / 10½ oz, sazonado con sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "85g / 3oz de cacahuetes tostados secos, aplastados", "dash aceite de oliva", "1 lima, solo jugo", "1 limón, solo jugo", "1 cucharada de salsa de soja", "1 cucharada de aceite de sésamo", "50ml / 2fl oz de aceite vegetal", "1 cucharada de perejil fresco picado", "2 cebollas de primavera, picadas", "1 chile rojo, finamente picado"], "method": ["Para el hoki, mezcle la harina normal y el chile en polvo en un bol y enrolle el hoki en la mezcla. Sumerja el hoki recubierto en el huevo batido y luego en los cacahuetes triturados.", "Calentar el aceite de oliva en una sartén antiadherente, agregar el hoki recubierto y freír durante dos minutos en cada lado, o hasta que esté bien cocido.", "Para la vinagreta, mezcle todos los ingredientes en un tazón pequeño.", "Para servir, coloque el hoki en un plato para servir y sirva con la vinagreta en un lado."], "url": "www_bbc_co_uk_food_recipes_peanutcrustedhokiwit_87089", "title": "Hoki con costra de maní con chile y vinagreta de cebolla de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de papas nuevas, cortadas a la mitad", "100g / 3½oz de guisantes frescos", "Nueces de 55 g / 2 oz", "55g / 2oz de queso de cabra", "2 cucharadas de yogur al estilo griego", "1 cucharada de perejil de flatleaf fresco picado", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una sartén de agua con sal, agregue las papas y hierva durante 8-10 minutos, o hasta que estén tiernas.", "Agregue los guisantes frescos a la sartén durante los últimos tres minutos del tiempo de cocción y escurra.", "En un tazón, mezcle las papas y los guisantes con las nueces y desmigaje en el queso de cabra.", "En otro tazón pequeño, mezcle el yogur griego con las hierbas, sazone con sal y pimienta negra recién molida y rocíe sobre la ensalada.", "Servir."], "url": "www_bbc_co_uk_food_recipes_peapotatoandwalnutgo_87037", "title": "Ensalada de queso de guisantes, patatas, nueces y cabras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de guisantes descongelados o frescos", "puñado de hojas de albahaca", "1 cucharadita de comino molido", "50ml / 1¾fl oz de yogur natural", "sal y pimienta negra recién molida"], "method": ["Coloque todos los ingredientes en una licuadora y puré.", "Justo antes de servir, coloca el puré en una cacerola y caliéntalo. Sazonar con sal y pimienta negra recién molida y colocar en el centro del plato."], "url": "www_bbc_co_uk_food_recipes_peapuree_81037", "title": "Comprado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de masa dulce con brisa", "125g / 4½oz de mantequilla sin sal", "125 g / 4½ oz de azúcar en polvo", "150 g / 5½ oz de almendras molidas", "50g / 1¾oz de harina natural", "3 huevos de gallinas camperas, golpeados", "1 cucharadita de extracto de vainilla", "75g / 2½oz de almendras en copos", "3 cucharadas de mermelada de albaricoque", "2 x 410g / 14½oz en latas de pera en jugo de fruta, escurrido", "crema batida, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y úsela para revestir una lata acanalada de 27cm / 10¾. Cubra la caja de pastelería con papel de hornear o papel de aluminio y llénela con alubias de cerámica para hornear (alternativamente, use arroz o lentejas sin cocer). Hornee la persiana por 15 minutos, luego quite el pergamino y los frijoles para hornear y devuelva la masa al horno durante otros ocho minutos, o hasta que la masa se vea seca y ligeramente coloreada. Dejar de lado para enfriar.", "Reduzca la temperatura del horno a 180C / 350F / Gas 4.", "Para hacer el relleno, bata la mantequilla y el azúcar hasta que estén suaves y esponjosos. Agregue las almendras molidas, la harina y los huevos. Mezcle para combinar a fondo. Agregue el extracto de vainilla y una cucharada de almendras copos.", "Extienda la mermelada de albaricoque en la base de la caja de repostería enfriada. Extienda la mezcla de frangipane sobre la mermelada de albaricoque. Use una cuchilla para palés para alisar el relleno. Coloque las peras en el relleno y presione suavemente hacia abajo. Dispersa sobre las almendras copos restantes.", "Hornee por 25-30 minutos o hasta que el relleno esté dorado.", "Dejar enfriar en la lata antes de servir. Sirve con crema batida."], "url": "www_bbc_co_uk_food_recipes_pear_and_apricot_52820", "title": "Tarta de frangipane de pera y albaricoque", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pear_and_apricot_52820_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 peras de conferencia grandes", "1 cucharada de azúcar impalpable de oro, más extra para espolvorear", "1 cucharadita de jengibre molido"], "method": ["Precalentar el horno a 110C / 225F / Gas ¼. Línea dos bandejas para hornear con pergamino para hornear.", "Corta las peras muy finas en rondas usando una mandolina o un cuchillo muy filoso.", "Coloque las peras en una sola capa en el pergamino para hornear. No importa si tiene que apretar las rondas para colocarlas todas sobre el papel, ya que se encogen a medida que se secan.", "Mezcle el azúcar y el jengibre, luego espolvoree abundantemente sobre cada pieza. Hornee en el horno durante tres horas, volteando a la mitad.", "Retire las patatas fritas del horno y deje que se enfríen.", "Recoge el polvo de azúcar restante de la bandeja de hornear y agrega un poco de azúcar extra para satisfacer. Agite el azúcar gingery sobre las patatas fritas."], "url": "www_bbc_co_uk_food_recipes_pear_and_ginger_coins_61585", "title": "Monedas de pera y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pear_and_ginger_coins_61585_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de avellanas", "50g / 1¾oz de harina natural", "100 g / 3½ oz de mantequilla", "6 huevos grandes de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "3 peras grandes, peladas, sin corazón y en rodajas", "100 g / 3½ oz de azúcar en polvo", "1 limón, solo jugo", "1 cucharada de aguardiente de fruta de oro de eau de vie", "450 g / 1 libra de ricotta", "100g / 3½oz de azúcar glasé", "Crema doble de 200 ml / 7 fl oz", "200 g / 7 oz de azúcar en polvo", "200g / 7oz de avellanas", "150ml / 5fl oz de crema doble", "25g / 1oz de mantequilla", "100 g / 3½ oz de chocolate negro, roto en pedazos", "sal", "1 cucharada de licor de avellana u otro licor como ron o aguardiente de agua (opcional)"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5 y alinee dos moldes para bocaditos de 22cm / 8½ pulgadas con papel de hornear.", "Pulse las avellanas en un procesador de alimentos hasta que tengan la textura de las almendras molidas. Incline en un tazón pequeño, agregue la harina y mezcle bien.", "Mientras tanto, derrita la mantequilla en un microondas o en una cacerola pequeña a fuego medio.", "Batir los huevos y el azúcar juntos en un tazón grande durante varios minutos usando un batidor eléctrico hasta que el volumen se haya triplicado y esté muy pálido y parecido a un mousse. Agregue la harina, avellanas molidas y la mantequilla derretida, teniendo cuidado de no mezclar demasiado. Divida uniformemente entre las dos latas y hornee durante 20-30 minutos, o hasta que estén ligeramente coloreados y elásticos para tocar. Dé vuelta a una rejilla de enfriamiento y despegue el papel de hornear.", "Para hacer el relleno, coloque las peras en una cacerola con el azúcar y el limón. Calienta suavemente hasta que el azúcar se haya disuelto, luego sube la temperatura y cocina a fuego lento durante 2-3 minutos, o hasta que las peras estén suaves pero conserven su forma. Agregue el aguardiente y cuele el almíbar en un recipiente resistente al calor. Aparte las peras para que se enfríen y reserve el jarabe.", "Batir la ricota y el azúcar glas hasta que quede suave. Agregue la crema doble y continúe batiendo hasta que la mezcla esté firme. Agregue una cucharada de jarabe de pera. Con una cuchara, vierte un cuarto de la mezcla de crema en un recipiente aparte y refrigera para más adelante. Revuelva las peras enfriadas en la crema restante.", "Para ensamblar, cepille una torta generosamente con jarabe de pera, apile el relleno en la parte superior de la manera más uniforme posible y coloque la otra torta en la parte superior. Ordene los lados, asegurándose de que los pasteles y el relleno estén derechos y parejos. Cepille la parte superior con más jarabe, envuelva sin apretar en una película adhesiva y congele durante 2 horas (consulte la sugerencia).", "Para preparar el relleno de bombones, si está usando, alinee una bandeja para hornear y un plato pequeño resistente al calor con papel resistente a la grasa. Ponga el azúcar en una cacerola y colóquelo a fuego medio-alto, girando cada cierto tiempo. Cuando se haya disuelto y tenga un color marrón dorado claro, agregue las avellanas. Retire algunas de las avellanas individualmente y colóquelas en la bandeja revestida para que se enfríen. Vierta la mezcla restante en el plato pequeño y reserve. Cuando sea difícil, divida el bloque y mezcle en una migaja en un procesador de alimentos.", "Para decorar, alise una capa fina del relleno refrigerado reservado sobre los lados y la parte superior, luego espolvoree sobre la praliné de avellana molido y las avellanas enteras recubiertas. Refrigere hasta que esté listo para comer.", "Para hacer la salsa de chocolate, si está usando, ponga la crema, la mantequilla y el chocolate en una cacerola pequeña con una pizca de sal. Derrita suavemente, luego batir hasta que quede suave. Agregue el licor, si se usa, y sirva inmediatamente con la torta o recalente suavemente antes de servir."], "url": "www_bbc_co_uk_food_recipes_pear_and_hazelnut_cake_88493", "title": "Pastel de peras y avellanas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 torta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 75g / 3oz", "75g / 3oz de mantequilla", "½ cucharadita de canela molida", "Azúcar demerara 75 g / 3 oz", "6 peras maduras, peladas, sin núcleo, cortadas en cubitos", "110ml / 4fl oz perry (sidra de pera)", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl de leche en oz", "2 palitos de canela", "6 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "500g / 1lb 2oz de helado de vainilla, para servir"], "method": ["Para el crumble de pera y perry, precaliente el horno a 190 ° C / 375 ° F / Gas 5.", "Coloque la harina y 50 g / 2 oz de la mantequilla en un recipiente y frote con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue la canela molida y el azúcar.", "Incline la mezcla en una bandeja para hornear y hornéela en el horno durante 10-12 minutos, o hasta que esté tostada y dorada.", "Mientras tanto, caliente la mantequilla restante en una sartén tapada hasta hacer espuma, luego agregue las peras. Freír durante 1-2 minutos, luego agregar la sidra perry y llevar la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra y cocine por 3-4 minutos, o hasta que las peras estén blandas.", "Coloque la mezcla de peras en un plato resistente al horno y espolvoree sobre la cobertura de crumble. Hornee en el horno durante 3-4 minutos.", "Mientras tanto, para la crema de canela, caliente la crema, la leche y los palitos de canela en una cacerola hasta que hierva, luego reduzca el fuego y cocine a fuego lento durante 5-6 minutos.", "Batir las yemas de huevo y el azúcar juntos en un tazón, luego agregar gradualmente la mezcla de crema caliente, batiendo continuamente. Regrese la mezcla de crema a la cacerola y cocine a fuego lento durante 3-4 minutos, revolviendo constantemente, hasta que la mezcla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. Deseche los palitos de canela.", "Sirva el crumble de pera en tazones con una cucharada de crema de canela y una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_pear_and_perry_crumble_33238", "title": "Crujiente de pera y perry con flan de canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frambuesas 300g / 10½ oz", "125g / 4½ oz de mermelada de azúcar", "pequeño apretón de jugo de limón", "120 g / 4oz de mantequilla sin sal", "Azúcar glas de 70g / 2½oz", "25 g / 1 oz de almendras molidas", "pizca de sal de mesa", "1 huevo grande de gallinas camperas", "½ cucharadita de pasta de vainilla", "Harina normal 220g / 8oz", "1 pera de conferencia firme, pelada", "50 g / 1 oz de azúcar en polvo", "½ limón, solo jugo", "Anís de 4 estrellas", "150g / 5½oz de mantequilla sin sal, suavizada", "145g / 5oz de azúcar en polvo de oro", "2 huevos grandes de gallinas camperas, más 1 yema", "2 cucharadas de Calvados (al gusto)", "pizca de sal marina fina", "¼ cucharadita de esencia de almendra", "150 g / 5½ oz de almendras molidas", "Harina blanca normal de 30g / 1oz"], "method": ["Para el atasco, coloque un plato pequeño en el congelador. Coloque alrededor de 250 g / 9 oz de frambuesas (reserva 13 para la decoración) en una sartén profunda y machaque con un tenedor. Agregue el azúcar mermelada y un chorrito de jugo de limón. Calienta suavemente hasta que el azúcar se disuelva.", "Llevar a ebullición y luego hervir durante unos 5 minutos, o hasta que una gota del jugo de mermelada colocado en la placa fría se vuelva pegajosa. Una vez listo, coloque la olla en un baño de agua fría y déjela enfriar.", "Para la masa, bata la mantequilla con una cuchara de madera en un tazón grande. Tamice el azúcar glas, agregue las almendras molidas y la sal y mezcle. Batir el huevo y la pasta de vainilla, seguido de la harina normal. Una vez combinado con la masa, aplástalo en un disco, envuélvelo en una película adhesiva y colócalo en la nevera para que se enfríe.", "Para la pera escalfada, agregue la pera a una cacerola pequeña con suficiente agua para cubrirla. Agregue el azúcar impalpable, el jugo de limón y el anís estrellado. Llevar a ebullición y cocine a fuego lento durante 5-10 minutos. Una vez que esté tierno, retírelo del agua y séquelo con papel de cocina, reservando el agua.", "Llevar el líquido de caza furtiva reservado a ebullición y luego cocine a fuego lento durante aproximadamente 30 minutos para reducirlo a un jarabe pegajoso.", "Saque la masa de la nevera y ruede hasta aproximadamente el grosor de una moneda de 1 euro. Use la masa para forrar una lata de tarta de 23cm / 9in. Pincha la base con un tenedor, luego extiende una capa de mermelada en el fondo y déjala enfriar en la nevera.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el frangipane, ponga la mantequilla y el azúcar en un tazón grande y mezcle con una licuadora de mano.", "Batir los huevos con Calvados, la sal y la esencia de almendras. Agregue un poco de la mezcla de huevo a la mantequilla y el azúcar y bata hasta que se combinen. Continúa agregando poco a poco y bate hasta que quede suave. Dobla las almendras molidas y la harina.", "Cuidadosamente cucharee la masa de frangipane encima del atasco y luego alise la superficie con un cuchillo limpio.", "Cuarto y núcleo la pera. Corta cada cuarto en 3 rodajas iguales. Coloque las rebanadas en la parte superior de la tarta en forma de flor, dejando un espacio entre cada rebanada. Coloque una frambuesa entre cada rebanada de pera y una en el medio.", "Hornee durante 45 minutos o hasta que estén cocidos. Es posible que deba tapar la tarta con papel de aluminio durante los últimos 15 minutos para evitar que se dore demasiado.", "Retire del horno, cepille el jarabe de pera reducido escalfado sobre la parte superior y reservar. Después de unos minutos, deslícese sobre una rejilla para enfriar. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_pear_and_raspberry_15343", "title": "Tarta de frangipane de pera y frambuesa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace tarta de 1 x 23 cm / 9 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "½ cucharadita de sal", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "125ml / 4fl oz de agua helada", "4 peras, peladas, sin núcleo, cortadas a la mitad", "Azúcar en polvo de 110 g / 4 oz", "2 vainas de vainilla, partidas y semillas retiradas", "110g / 4oz de mantequilla", "150ml / 5fl oz de crema doble", "2 ramitas de romero", "500ml / 18fl oz de helado de vainilla"], "method": ["Para la pasta de hojaldre áspera, coloque la harina y la sal en un tazón grande. Agregue la mantequilla y use sus manos para frotar la mantequilla en la harina.", "Cuando la mezcla de harina y mantequilla se asemeje a pan rallado, agregue el agua fría. Mézclalo con un cuchillo de punta redonda para mantener la mezcla fresca. Cuando la mezcla se una para formar una masa, colóquela en una superficie de trabajo enharinada limpia y amasar brevemente hasta que quede suave.", "Forme la masa en un bloque rectangular (esto facilitará el despliegue más adelante), envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enrolle la masa sobre una superficie de trabajo enharinada limpia en un rectángulo de aproximadamente 40x20cm / 16x8 pulgadas.", "Tome uno de los bordes cortos de la masa y doble un tercio de la masa en el centro, luego doble el otro tercio sobre eso. Gire la pastelería 90 grados y repita la laminación y el plegado.", "Envuelva la masa en una película adhesiva, refrigere por 20 minutos, luego repita los pasos 4 y 5.", "Envuelva el bloque de repostería en una película adhesiva y refrigere durante 30 minutos antes de usar.", "Para la tatin de pera, precalentar el horno a 200C / 400F / Gas 6.", "Coloque las peras, 25 g / 1 oz del azúcar y las semillas de vainilla en una olla. Llena la sartén con suficiente agua para cubrir las peras. Calienta suavemente las peras hasta que la mezcla esté hirviendo a fuego lento. Cocine por 15 minutos, o hasta que las peras estén tiernas. Escurra las peras y séquelas.", "Caliente el azúcar restante en una sartén a prueba de horno de 24 cm / 9½ pulgadas a fuego lento hasta que se haya caramelizado. Agregue la mantequilla, la crema y el romero a la sartén y caliente suavemente hasta que la mezcla forme un caramelo suave.", "Extraiga con mucho cuidado los resortes de romero (estos pueden usarse como guarnición si lo desea). Coloque las peras en el caramelo, con el lado cortado hacia arriba.", "Pase el pastel frío sobre una superficie de trabajo enharinada a un grosor de 5 mm / ¼. Corta la masa en un círculo ligeramente más grande que la sartén.", "Coloque el círculo de repostería sobre las peras. Meta los bordes de la masa dentro de la sartén para rodear las peras.", "Transfiéralo al horno y hornea por 20-25 minutos, o hasta que la masa se levante, dorada y cocida. Una vez cocido, retire la tatin de pera del horno y déjela enfriar durante 5-10 minutos.", "Afloje los bordes del tatin y coloque un plato grande o tablero en la parte superior de la sartén. Con mucho cuidado, pero rápidamente, voltéelo, usando una toalla de té doblada para ayudarlo a sostenerlo, y permita que la tarta tatin caiga suavemente sobre el plato de servir.", "Para servir, corte el tatin en trozos y colóquelo en platos para servir. Cubra con una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_pear_and_rosemary_tatin_79310", "title": "Tarta tatin de pera y romero con helado de vainilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "500g / 1lb 2oz manzanas Bramley, peladas, sin corazón y picadas", "Peras de 500 g / 1 libra y 2 onzas, peladas, sin corazón y picadas", "100g / 3½ oz de azúcar (o al gusto)", "150 g / 5½z de moras congeladas", "250g / 9oz de mantequilla sin sal", "500g / 1lb 2 oz de harina común", "125g / 4½oz de azúcar moreno claro y suave", "125 g / 4½ oz de azúcar en polvo", "Avellanas tostadas 125g / 4½oz, desolladas, picadas", "1 naranja, solo ralladura", "500ml / 18fl de leche en oz", "Crema doble 500ml / 18fl oz", "7 yemas de huevo de gallinas camperas", "30 g / 1 oz de azúcar en polvo", "2 cucharadas de jarabe de avellana"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la fruta, caliente la mantequilla en una bandeja grande para asar, agregue las manzanas y las peras picadas. Espolvorea sobre el azúcar y revuelve bien. Cocine por 10 minutos, o hasta que la fruta comience a ablandarse y luego ajústela a un lado.", "Haga la cobertura frotando la mantequilla, la harina y el azúcar con los dedos hasta que tenga una textura como pan rallado muy grande. Agregue las avellanas picadas.", "Para terminar la fruta, mezcle las moras con la mezcla de manzana y pera y luego colóquela en un plato para servir. Cubra con la mezcla de crumble. Hornee por 15-20 minutos, o hasta que el crumble esté dorado.", "Para el helado, caliente la leche y la crema juntas en una olla grande hasta que estén calientes, pero no hirviendo. Batir las yemas de huevo y el azúcar en un bol. Vierta la mezcla de leche caliente y crema sobre los huevos gradualmente, batiendo todo el tiempo.", "Vierta todo en una olla limpia a fuego lento y revuelva constantemente hasta que la mezcla cubra la parte posterior de una cuchara.", "Retirar del fuego y dejar enfriar.", "Agregue el jarabe de avellana y luego agregue la mezcla a una máquina de helados. Revuelva según las instrucciones del fabricante hasta que se congele.", "Sirva el crumble de manzana, pera y mora con una bola de helado de avellana."], "url": "www_bbc_co_uk_food_recipes_pear_apple_and_11326", "title": "Crumble de peras, manzanas y moras con helado de avellanas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]