[{"isVegetarian": false, "title": "How to make trifle", "url": "www_bbc_co_uk_food_recipes_how_to_make_trifle_89033", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trifle_89033_16x9.jpg", "ingredients": ["500g/1lb 2oz frozen summer fruit (raspberries, blackberries, strawberries, blackcurrants and redcurrants work well)", "50g/2oz caster sugar, or more to taste", "2 tbsp blackcurrant or raspberry liqueur (cassis or Chambord)", "500ml/18fl oz cloudy apple juice", "5 sheets leaf gelatine ", "250g/9oz madiera cake", "250g/9oz mascarpone", "500ml/18floz ready-made vanilla custard", "300ml/½ pint whipping cream ", "handful toasted almonds or hazelnuts, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the fruit into a saucepan, add the sugar, then cook gently until the sugar has dissolved and the liquid is slightly syrupy. Remove half of the berries and juice to a bowl, stir in a tablespoon of cassis, then set aside to cool. ", "Add the apple juice to the fruit in the pan, and bring to a simmer. Taste the fruit, and add a little more sugar if necessary. Remove from the heat, and add the remaining cassis. ", "Soak the gelatine leaves in a bowl of cold water for five minutes, until soft and floppy. Lift the gelatin from the water and squeeze out the excess liquid.", "Add the gelatine to the fruit in the pan and stir until it has completely dissolved. Remove from the heat, and transfer the jelly mix to a bowl. Allow to cool, then chill in the fridge until the mix has set to a softly wobbling jelly.", "Cut the madeira cake into 1cm/½in slices. Give the fruity jelly a stir - it should be softly set. Layer the cake, jelly, fruit and juice in the bottom of a trifle dish (roughly 20cm/8in diameter).", "For the custard layer, put the mascarpone into a large bowl then add the custard. Whisk together until creamy and smooth. Spoon the custard over the fruit and sponge. ", "Whip the cream until soft peaks form when you remove the whisk from the mixture. ", "Spoon the cream over the top of the trifle, starting from the outside and working in. This will avoid the cream sinking into the custard.  ", "Chill the trifle for an hour before serving. ", "Finish with a scattering of toasted almonds."]}, {"isVegetarian": false, "title": "How to make Thai green curry paste", "url": "www_bbc_co_uk_food_recipes_how_to_make_thai_green_67270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_thai_green_67270_16x9.jpg", "ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "1 shallot, finely chopped ", "4 green bird’s-eye chillies, chopped", "4 garlic cloves, crushed", "thumb-sized piece fresh root ginger, grated", "1 lemongrass stalk, finely chopped", "pinch salt", "small bunch fresh coriander, stalks and leaves", "2 dried kaffir lime leaves", "1 tbsp fish sauce ", "pinch ground white pepper"], "serves": "Makes enough for one curry, serving four people", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly toast the coriander and cumin seeds in a dry frying pan, until fragrant. ", "Place the seeds into a pestle and mortar, and add the shallot, chillies, garlic, ginger, lemongrass and salt. Pound to a paste with the pestle. Alternatively, you can use a food processor to do this. ", "Cut the coriander stalks into chunks, and set aside the leaves to add to the finished curry. Add the coriander stalks and crumble the dried kaffir lime leaves to the mix, and continue to grind until fairly smooth. ", "Add the fish sauce and a pinch of white pepper. The curry paste is now ready to use. If not using immediately, the paste can be stored in a jar topped with a little oil and will keep in the fridge for a couple of weeks."]}, {"isVegetarian": false, "title": "Bake-in-a-bag fish", "url": "www_bbc_co_uk_food_recipes_how_to_make_trout_en_49680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trout_en_49680_16x9.jpg", "ingredients": ["2 tbsp olive oil", "¼  fennel bulb, finely sliced ", "½ onion, finely sliced", "salt and freshly ground black pepper", "1 medium tomato, sliced", "2 fish fillets, about 175g/6oz each, such as cod, sea bass or trout", "olive oil, drizzle ", "squeeze lemon juice", "1 tbsp chopped dill (optional)", "1 tsp capers (optional)", "2-3 tbsp white wine (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Cut out two squares baking paper about 40cm/16in square, and two squares of tin foil the same size. Lay a square of baking paper on top of each piece of foil.", "Heat the oil in a frying pan and fry the fennel and onion with some salt and pepper for 2-3 minutes, until softened. Divide the fennel and onions between the two squares of baking paper, and layer on the sliced tomatoes then put a fish fillet on top of each heap. Drizzle over some olive oil, a squeeze of lemon juice, and season with salt and freshly ground black pepper. Sprinkle over the chopped dill and a few capers, if using.", "Fold the foil and paper over the fish and double-fold each edge to make a sealed parcel, leaving a gap at the top to pour in a few tablespoons of white wine (if using). Pour in the wine, then fully seal the parcel, but not be too tight, as it needs to expand in the oven as it cooks.", "Place the parcels on a baking tray and bake for 12-14 minutes, or until the fish is just opaque and cooked through. Serve the parcels on each plate so they can be opened at the table."]}, {"isVegetarian": true, "title": "Spicy Mexican eggs (huevos rancheros)", "url": "www_bbc_co_uk_food_recipes_huevosrancherosranch_84543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/huevosrancherosranch_84543_16x9.jpg", "ingredients": ["3 kale leaves, finely chopped", "1 onion, finely chopped", "1 green pepper, finely chopped", "1 red pepper, finely chopped", "1 small bird's eye chilli, finely chopped", "1 courgette, finely chopped", "1 garlic clove, finely chopped", "150ml/5fl oz tomato passata", "1 tbsp olive oil", "knob of butter", "8 free-range eggs", "salt and freshly ground black pepper", "handful fresh coriander leaves", "2 soft flour or corn tortillas, warmed in the oven", "hot chilli sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salsa, put the kale, onion, peppers, chilli, courgette, garlic and passata into a bowl. Season with salt and pepper and mix well.", "Heat the oil in a medium lidded frying pan over a medium heat and add a quarter of the salsa. Stir to warm through, then make a hole in the middle of the salsa. Place the butter in the clear area in the middle of the pan, then break 2 eggs into this space.", "Put the lid on the pan and cook for 3-4 minutes. The dish is ready when the eggs are cooked into the salsa and the whites are firm. Slide the eggs and salsa onto a large plate and keep warm as you repeat this process three more times.", "To serve, sprinkle each dish with coriander leaves and serve the warm tortillas and chilli sauce alongside."]}, {"isVegetarian": true, "title": "Hugh's wastenot soup", "url": "www_bbc_co_uk_food_recipes_hughs_wastenot_soup_75817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 bendy carrots, peeled, if you like", "1 onion, peeled", "1-2 small potatoes, peeled ", "1-2 squishy tomatoes", "a little oil or butter, for frying", "water or stock made from a cube", "1 bag salad (tired), washed if necessary", "salt and pepper", "curry powder, to taste (optional)", "leftover hummus, to taste (optional)", "3-4 slices slightly stale bread", "oil, for shallow frying"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roughly chop the carrot, onion and potato. Cut the tomatoes in half and rub the cut-side on a coarse cheese grater to get the pulp, and leave the skin behind.", "Heat a little oil or butter in a medium saucepan over a medium heat. Fry gently until the onion and carrot start to soften (about 5 minutes). Add the tomatoes and then the potato pieces.", "Just cover with plain water or stock. Bring to a simmer and keep simmering until the potatoes are tender (about 10 minutes).", "Next, add the bag of salad and cook for another 2-3 minutes, until wilted. Season with a bit of salt and pepper. Add a good pinch of curry powder if you like.", "Blend the soup, either in the saucepan using a stick blender, or transfer to a blender. Blend until fairly smooth (some texture is fine) - then return to the pan.", "Stir the hummus (if using) gently into the soup. Taste and add more salt and pepper if required. ", "To serve, fry the bread lightly and serve with the soup. Enjoy!"]}, {"isVegetarian": true, "title": "Hummus", "url": "www_bbc_co_uk_food_recipes_hummus_80249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 410g/14oz tin chickpeas, rinsed and drained", "4 tbsp water or vegetable stock", "2 large cloves garlic", "3 tbsp tahini (sesame paste)", "3 tbsp lemon juice", "salt, to taste", "1 tbsp olive oil", "chopped fresh parsley", "olive oil", "pine nuts, fried ", "paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat chickpeas and four tablespoons of water or vegetable stock in a saucepan. ", "When warmed through, place the chickpeas and two tablespoons of the stock or water in a food processor. Blend until roughly combined. Add the garlic, tahini and lemon juice and a couple of large pinches of salt and blend again. ", "Add the olive oil and blend again until hummus is the desired texture. ", "Serve on a flat dish topped with a drizzle of olive oil, some parsley, fried pine nuts and a sprinkling of paprika."]}, {"isVegetarian": true, "title": "Hummus chickpea burgers", "url": "www_bbc_co_uk_food_recipes_hummus_chickpea_burgers_94137", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hummus_chickpea_burgers_94137_16x9.jpg", "ingredients": ["3-4 tbsp sunflower oil", "1 onion, roughly chopped", "2 garlic cloves, thinly sliced", "1 tsp ground cumin", "1 tsp ground coriander", "400g tin chickpeas, drained and rinsed", "100g/3½oz hummus", "50g/2oz plain flour", "½ tsp salt", "freshly ground black pepper", "50g/2oz pine nuts or cashews", "8 pitta breads, warmed", "mixed green salad", "8 tbsp plain yoghurt (optional)", "8 tsp chilli sauce"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 1 tablespoon of the oil in a non-stick frying pan over a medium heat. Add the onion and garlic and fry gently for 4-5 minutes, or until softened, stirring regularly. Stir in the cumin and coriander and fry for 1-2 minutes, or until fragrant. Remove from the heat and set aside to cool for 5 minutes. ", "Place in a food processor, add half of the chickpeas and all of the hummus and flour. Season with salt and pepper. Blend to a rough paste. ", "Add the remaining chickpeas and the pine nuts. Pulse for a few seconds until the chickpeas and pine nuts have broken down but retain some texture. Season to taste.", "Divide the chickpea mixture into 8 portions. Roll each  into a ball, flatten between your palms into a burger shape approximately 1.5cm/½in thick. ", "Heat the remaining oil in a large, non-stick frying pan. Add the burgers in batches and fry for 3-4 minutes on each side, or until golden-brown and crisp on both sides and heated through. ", "Serve the burgers in pitta breads stuffed with salad leaves, with a dollop of yoghurt and chilli sauce alongside."]}, {"isVegetarian": false, "title": "Hungarian pork stew", "url": "www_bbc_co_uk_food_recipes_hungarian_pork_stew_63624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz lard", "1 large onion, thinly sliced", "2–3 tbsp paprika", "1.8kg/4lb pork steak, diced", "1 tsp tomato purée", "1 green pepper, thinly sliced", "3 medium tomatoes, sliced", "salt and freshly ground black pepper", "1 tbsp cornflour"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the lard in a lidded frying pan, add the onion and fry for five minutes, or until softened. Remove the pan from the heat and stir in the paprika, adding more or less to taste. Add the pork and a splash of water. Simmer over a low heat for about 5 minutes. ", "Add enough boiled water to cover the meat, bring back to the boil and add the tomato purée, green pepper and tomatoes. Season with salt and freshly ground black pepper. Cover with a lid and simmer for 1 hour or until the pork is tender. ", "To thicken the sauce, mix the cornflour and two tablespoons of cold water to form a paste, then stir into the stew. Bring to the boil again to thicken. Check the seasoning, and season with salt and freshly ground black pepper to taste.", "Serve the stew with creamy mashed potato, or macaroni. The dish also goes well with finely sliced cucumber which can be lightly pickled with a splash of white wine vinegar and a sprinkling of caster sugar. "]}, {"isVegetarian": true, "title": "Hyderabadi biryani of vegetables in a pumpkin shell", "url": "www_bbc_co_uk_food_recipes_hyderabadi_biryani_of_73883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz basmati rice", "3 green cardamoms", "2 bay leaves", "4 cloves", "2 blade mace", "1 tbsp cumin", "3 tbsp salt", "1 tbsp chilli flakes", "100g/3½oz tamarind purée", "½ tsp salt", "1 large pumpkin, top removed, seeds and flesh scraped out", "2 medium onions, sliced and deep fried until golden-brown", "2 tbsp ginger and garlic paste", "1 tbsp red chilli powder", "1 tsp turmeric", "1 tsp garam masala", "1/8 nutmeg grated", "6 green chillies, slit lengthways", "½ bunch fresh coriander, chopped", "1 lemon, juice only", "2 tbsp vegetable oil", "150ml/5fl oz natural yoghurt", "75ml/2½fl oz single cream", "1 tsp salt", "1 tsp sugar", "½ turnip, cut into 1cm/½in cubes ", "1 carrot, cut into 1cm/½in cubes ", "½ swede, cut into 1cm/½in cubes ", "¼ celeriac, cut into 1cm/½in cubes ", "½ sweet potato with orange flesh, cut into 1cm/½in cubes ", "2 Jerusalem artichokes, cut into 1cm/½in cubes ", "10 fine beans, chopped", "200g/7oz Portabello mushrooms, cut into 1cm/½in cubes  ", "½g saffron", "50ml/2fl oz warm milk", "50g/1¾oz ghee", "2 tbsp rosewater or kewra water (screw pine essence)", "1 small bunch mint, chopped", "a little dough made from flour and water, optional, to seal the pumpkin lid", "50g/1¾oz raisins, for garnish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Wash the rice and soak in cold water for 20 minutes.", "For the pumpkin, mix the tamarind, chilli and salt and smear it on the inside of the hollowed out pumpkin. Bake it in the oven (without the pumpkin lid) for 30-50 minutes. When cooked, remove from the oven and set aside.", "Mix all the ingredients for the marinade. ", "For the vegetables, place all the vegetables in a heavy-based casserole and add the marinade. Set aside for 15 minutes. ", "For the rice, boil 3 litres/5¼ pints of water and add the whole spices and salt. ", "When the water is boiling, add the strained soaked rice and boil for about 6-8 minutes until two-thirds cooked then drain using a colander.", "Meanwhile bring the vegetables to a simmer over a low heat.", "Preheat the oven to 200C/400F/Gas 6.", "To finish, soak the saffron in the warm milk for 3-5 minutes then mix in the ghee and rosewater (or kewra water) and set aside.", "Fill the bottom of the pumpkin with layers of the vegetables and rice, sprinkling some chopped mint and the soaked saffron mix over the rice as you go. ", "Put on the pumpkin lid. You may wish to seal the lid using some dough to create a pressure cooking effect.", "Bake in the oven for 20-25 minutes.", "To serve, take the lid off the pumpkin and garnish the rice with raisins."]}, {"isVegetarian": false, "title": "Iberico pork pluma with spring onion and black pepper miso", "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_with_01362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz freshly ground black peppercorns ", "400g/14oz spring onions, finely chopped", "60g/2¼oz garlic, finely chopped", "250g/9oz white miso paste", "large pinch sea salt ", "50ml/2fl oz soy sauce", "5 tbsp rice vinegar ", "5 tbsp vegetable oil", "20g/¾oz carrot, cut into fine julienne strips", "20g/¾oz cucumber, cut into fine julienne strips", "20g/¾oz daikon, cut into fine julienne strips", "20g/¾oz leek, white part only, cut into fine julienne strips", "10g shiso leaves (available online), cut into fine julienne strips", "3 tbsp freshly squeezed lemon juice", "pinch sea salt", "2 pork pluma (each weighing approximately175-225g/6-8oz), trimmed", "100g/3½oz unsalted butter", "50ml/2fl oz vegetable oil", "5 tbsp rice vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the miso, put all of the ingredients in a blender and blend until smooth. This will make more miso than required, but it will keep in the fridge for weeks and can be rubbed on almost any meat", "For the salad, mix all of the ingredients together, put in a colander and wash under running water for about 10 minutes. Drain well.", "For the salad dressing, mix the lemon juice and salt together. ", "To cook the pork pluma, heat a non-stick frying pan to medium heat and add the butter and oil.", "Rub the pork heavily with the miso rub and place in the pan. Cook for about 2-3 minutes on each side or until cooked through. Remove from the pan and leave to rest for 1 minute. ", "Remove the pan from the heat and de-glaze it with the rice vinegar. Add a tablespoon of the fresh miso to mix through to make a sauce.", "Lightly dress the salad just before serving. ", "Slice the pork and place on a serving plate with a spoon of sauce and the salad on top. "]}, {"isVegetarian": true, "title": "‘I can’t believe you made that’ cake", "url": "www_bbc_co_uk_food_recipes_i_cant_believe_you_made_90494", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/i_cant_believe_you_made_90494_16x9.jpg", "ingredients": ["vegetable oil or oil spray ", "200g/7oz butter, softened ", "200g/7oz caster sugar", "4 free-range eggs ", "140g/5oz plain flour", "60g/2½oz cocoa powder ", "pinch salt ", "2 tsp baking powder ", "400g/14oz plain, milk, or white chocolate cigarillos (about 75–80 in total) ", "250g/9oz butter, softened ", "500g/1lb 2oz icing sugar ", "100g/3½oz good dark chocolate (at least 70 per cent cocoa solids), melted and slightly cooled ", "fresh flowers, for a Christening cake ", "strawberries or raspberries, for the girls ", "figs, quartered, for the boys "], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180/C/350F/Gas 4 and line a 20cm/8in round deep cake tin with baking paper and brush or spray with oil. ", "Cream together the butter and sugar in a large bowl until they begin to go pale. Add half of the eggs and half of the flour and mix well. Add the rest of the eggs, flour, cocoa powder, salt and baking powder and beat for a minute or two until the mixture is uniform. Dollop into the prepared tin and bake in the oven for about 30–40 minutes, or until a skewer inserted in the middle comes out clean. Leave to cool in the tin. ", "Meanwhile, make the buttercream: put the butter and icing sugar in a bowl and whisk together until the mixture goes fluffy. Add the cooled, melted chocolate and whisk for a further two minutes. ", "Once the cake is completely cool, remove it from the tin. Carefully cut the top flat with a large serrated knife. (Eat this bit as a chef’s perk!) ", "Turn the cake upside down on a 20cm/8in cake board so that the bottom now becomes a nice flat top. Split the cake horizontally and sandwich the top and bottom together with a 1cm/½in layer of buttercream. ", "Spread half of the remaining buttercream all over the top and sides of the cake, making it as smooth as possible. Put it in the fridge to set before doing another layer - this makes it much easier to get neat squared-off edges. ", "Gently push the cigarillos vertically onto the sides of the cake, positioning them as straight as possible and making sure they touch the bottom. ", "The next step is up to you - I can’t tell you the wide-eyed looks you’ll get when you walk into a room holding this finished cake.  Serve with a self-satisfied grin. "]}, {"isVegetarian": false, "title": "Iberian pork jowl with squid salad", "url": "www_bbc_co_uk_food_recipes_iberian_pork_jowl_with_92104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Iberian pork jowl, thinly sliced", "6 anchovies", "1 tbsp olive oil ", "10g flatleaf parsley leaves, finely chopped", "100g/3½oz croûtons", "4 black or red tomatoes, cut into thin wedges", "3 spring onions, chopped", "½ shallot, peeled and thinly sliced", "2 medium squid, cleaned, cut and scored ", "100g/3½oz sweet chorizo, cut into cubes", "6 tbsp olive oil, preferably Spanish", "2 tbsp Moscatel or white wine vinegar", "salt and freshly ground black pepper", "½ bunch chervil, finely chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the Iberian pork jowl, place the slices on four plates and cover with the anchovies. Drizzle with the olive oil and scatter over the parsley and croûtons. Set aside. ", "For the squid salad, place the tomato, spring onion and shallot in a bowl. Cook the squid in a frying pan for 60–90 seconds on each side over a medium heat. Season with salt and pepper, cut the squid into 2cm/¾in thick rings and set aside. Add the chorizo to the pan with 1 tablespoon of the olive oil and sweat for 30–40 seconds. ", "Add the squid and chorizo to the bowl of tomato salad. Mix together the remaining oil and the vinegar in a small bowl and season with salt and pepper. Pour the oil dressing over the salad, stir and then divide the salad between the four pork jowl plates. Garnish with the chervil and serve immediately. "]}, {"isVegetarian": false, "title": "Iberico pork pluma, herb vinaigrette and piquillo pepper purée", "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_herb_48331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/2¾oz sea salt", "40g/1½oz caster sugar", "sprig thyme", "4 x 200g/7oz Iberico pluma", "2 tbsp olive oil", "½ bunch parsley, finely chopped", "¼ bunch oregano, finely chopped", "1 garlic clove, crushed", "1 green chilli, seeds removed and finely chopped", "¼ tsp cumin seeds, crushed", "¼ tsp sweet paprika ", "½ shallot, finely chopped", "50ml/2fl oz red wine vinegar", "100ml/3½fl oz extra virgin olive oil", "salt and freshly ground black pepper", "1 shallot, thinly sliced", "1 garlic clove, thinly sliced", "olive oil", "150g/5½oz piquillo peppers", "25ml/1fl oz sherry vinegar", "50ml/2fl oz chicken stock", "50g/1¾oz cooked chickpeas", "¼ tsp cumin seeds, crushed", "¼ tsp sweet paprika", "1 tsp salt", "vegetable oil, for deep-frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the brine, put 1 litre/1¾ pint water and all the ingredients in a saucepan and heat until the salt and sugar dissolve. Leave to cool then place the pork in the brine, cover and leave in the fridge for 2 and a half hours. Remove from the brine, rinse well in fresh cold water and pat dry.", "To make the herb vinaigrette, mix all the ingredients in a bowl and season with salt and pepper.", "To make the pepper purée, gently cook the shallots and garlic in olive oil for 5 minutes. Add the peppers followed by the vinegar and chicken stock. Cook for 5 minutes then blitz in a blender. Season to taste with salt and pepper.", "For the chickpeas, heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Deep-fry the chickpeas for 2 minutes. Mix the spices and salt together, drain the chickpeas and season with the spiced salt.", "Lightly oil the pork on both sides and place on a hot griddle. Cook for 2 minutes then flip over and cook for a further 2-3 minutes. ", "To serve, slice the pork and place on a large plate, spoon the vinaigrette over the top then add a spoon of purée to the side. To finish, scatter the chickpeas over the pork."]}, {"isVegetarian": false, "title": "Ice box cake", "url": "www_bbc_co_uk_food_recipes_ice_box_cake_59770", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, softened", "250g/9oz granulated sugar", "4 free-range eggs", "5 tbsp strong cold espresso coffee", "4 tbsp chicory and coffee essence, such as Camp", "650g/1lb 7oz plain flour", "50g/1¾oz cocoa powder", "2 tsp bicarbonate of soda", "1 tsp salt", "1 litre/1¾ pint double cream", "1 tbsp chicory and coffee essence, such as Camp", "125ml/3½fl oz stem ginger syrup", "42 coffee biscuits ", "3 balls stem ginger, thinly sliced"], "serves": "Serves 10-14", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the ice box coffee biscuits, place the butter and sugar into a bowl and beat until light and fluffy, then add the eggs and beat well.", "Add the cold coffee and coffee essence and mix well. Fold in the flour, cocoa, bicarbonate of soda and salt and bring together to form a firm dough.", "Press into a 2cm/¾in thick block, then wrap in cling film and place in the fridge for one hour to rest.", "Preheat the oven to 180C/350F/Gas 4.", "Roll the dough out to 5mm/¼in thick, then stamp out into discs using a 7cm/2¾in diameter plain biscuit cutter.", "Place onto a baking tray and bake for 8-10 minutes, or until just risen and firm to touch.", "For the cake, whisk the double cream with the coffee essence in a bowl until it just holds soft peaks when the whisk is removed from the bowl, then fold in the stem ginger syrup and coffee essence.", "Take a large plate or cake stand and place a little cream on the base, then place a 25cm/9in round cake board on top.", "Dollop two spoonfuls of cream in the middle and spread out to within 2cm/¾in of the edge, then place one biscuit in the centre and six around it in a circle. Spread a layer of cream over the top, making sure the biscuits are still visible at the side.", "Repeat the process layering up the biscuits like bricks, until you have used up all the cream and all the biscuits, finishing with a layer of cream.", "Place in the fridge overnight but preferably for 24 hours so that the biscuits soften.", "Decorate the top of the cake with the slices of stem ginger. Serve cut into slices straight from the fridge."]}, {"isVegetarian": true, "title": "Iced berries with limoncello white chocolate sauce", "url": "www_bbc_co_uk_food_recipes_iced_berries_with_63709", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_berries_with_63709_16x9.jpg", "ingredients": ["250ml/9fl oz double cream", "4 tbsp limoncello liqueur", "200g/7oz white chocolate, finely chopped", "500g/1lb 2oz frozen mixed berries (unthawed)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the double cream and two tablespoons of the limoncello in a milk pan, and heat it until just about to come to the boil, but not actually boiling.", "Take the pan off the heat and add the white chocolate, then swirl the pan about so that it is all submerged.", "Take the berries out of the freezer and arrange them in a single layer in a dish or plate that has a small lip (so that the sauce doesn’t drip off later). Sprinkle with the remaining two tablespoons of limoncello and leave for five minutes, during which time you can swirl your white chocolate pan about every now and again to help the chocolate melt into the lemony cream.", "Using a rubber spatula, gently stir the chocolate-cream mixture, still off the heat, until it’s smooth, then pour it over the berries and serve immediately."]}, {"isVegetarian": true, "title": "Sour cherry and almond iced buns", "url": "www_bbc_co_uk_food_recipes_iced_buns_15490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white bread flour ", "2 tsp salt ", "40g/1½oz caster sugar ", "2 x 7g sachets fast-action yeast", "40g/1½oz unsalted butter, softened ", "150ml/5fl oz full-fat milk ", "2 tsp ground green cardamom ", "2 tsp ground nutmeg ", "250ml/9fl oz full-fat milk ", "40g/1½oz caster sugar ", "2 medium free-range egg yolks", "20g/¾oz cornflour ", "¼ tsp fine sea salt ", "1 tsp almond extract", "50ml/2fl oz whipping cream", "300g/10½oz sour cherries (drained weight)", "300g/10½oz jam sugar", "1 tbsp lemon juice", "cherry essence flavouring", "Morello cherry essence flavouring", "1 pasteurized egg white", "1 tbsp lemon juice", "250g/9oz icing sugar, sifted", "400ml/14fl oz double cream ", "4 tbsp icing sugar, sifted", "50g/1¾oz slivered almonds, toasted ", "green cardamom powder, for dusting ", "icing sugar, for dusting"], "serves": "Makes 16 iced buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, put the flour into the bowl of a freestanding mixer fitted with a dough hook. Add the salt and sugar to one side of the bowl and the yeast to the other.  Add the butter, milk and 150ml/5fl oz water. Mix until a dough forms then knead in the mixer for 5 minutes. Cover the bowl with cling film and leave to prove in a warm place for 1 hour, or until doubled in size. ", "Once the dough has proved, divide it into 2 equal parts. Flatten each piece of dough out and add the cardamom to one and the nutmeg to the other. Knead to distribute the spices and knock out the air. ", "Divide each piece of dough into 8 equal parts. Roll the cardamom dough into balls and the nutmeg dough into fingers. Place on baking trays, cover and leave to prove for 30 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 5. Bake the bread for 10 minutes.   ", "For the almond custard, warm the milk and sugar in a saucepan. In a bowl, whisk together the egg yolks and cornflour.  Slowly add the hot milk to the egg mixture stirring all the time. Return to the pan and heat, stirring all the time, until thickened. Remove from the heat and add the salt and almond extract. Cover the surface with cling film and leave to cool completely. ", "Whip the cream until soft peaks form, then fold into the cooled custard.   ", "For the sour cherry jam, drain the cherries and blend them to a paste in a blender. Transfer to a saucepan and add the sugar and lemon juice. Boil the mixture until it reaches 105C on a sugar thermometer.  Remove from the heat and stir in the cherry flavourings. Pass through a sieve and leave to cool completely. When cool transfer to a piping bag fitted with a small plain nozzle.", "For the royal icing, beat the egg white and lemon juice using a wooden spoon until frothy, then add 3 tbsp icing sugar and beat again. Keep beating and adding a few tablespoons of icing sugar until all the icing sugar is incorporated and you have a smooth paste (if the icing is too thick add a little water to slacken). Transfer to a piping bag fitted with a plain nozzle.", "For the Chantilly cream, add the cream and icing sugar to a large bowl. Whip until soft peaks form when the whisk is removed. Transfer to a piping bag fitted with a large star nozzle and leave in the fridge. ", "To assemble the cardamom and almond buns, cut the buns in half horizontally and fill them with the almond custard. Pipe icing on top of the bun, top with toasted almonds, a sprinkling of cardamom powder and a dusting of icing sugar. ", "To assemble the nutmeg and sour cherry fingers, make a deep slit lengthways in the top of the bread fingers. Pipe icing on both sides of the slits and leave to set.", "Pipe some cherry jam in the bottom of the slit. Pipe the cream neatly on top and pipe two stripes of cherry jam at either side of the cream. "]}, {"isVegetarian": true, "title": "Iced fingers", "url": "www_bbc_co_uk_food_recipes_iced_fingers_34133", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_fingers_34133_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "50g/1¾oz caster sugar", "40g/1½oz unsalted butter, softened", "2 free-range eggs", "2 x 7g/¼oz sachets instant yeast", "2 tsp salt", "150ml/5fl oz warm milk", "140ml/4½fl oz water", "200g/7oz icing sugar", "5 tsp cold water", "200ml/7fl oz whipping cream ", "100g/4oz strawberry jam", "icing sugar, for dusting"], "serves": "Makes 12 buns", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the dough, place all the ingredients into a large bowl, holding back a quarter of the water. Stir the mixture with your hands, then slowly add the remaining water to form a dough and knead in the bowl for four minutes.", "Turn the dough onto a lightly floured surface and knead well for 10 minutes or until the dough is smooth and elastic. Return the dough to the bowl, cover with a damp tea towel and leave to rise in a warm place for one hour.", "Divide the dough into 12 pieces, each about 70g/2½oz, then roll into balls and shape into fingers about 13cm/5in long.", "Place the dough fingers onto a greased baking tray, leaving space for them to double in size, then set aside in a warm place for 40 minutes. They should just touch each other when they’ve risen. Bake in the oven for 10 minutes then set them aside to cool.", "For the icing, sift the icing sugar in a wide bowl and gradually stir in the cold water to form a thick paste. ", "Dip the top of the cooled fingers into the icing, smoothing it with your finger, then leave to set on a wire rack.", "Lightly whip the cream and spoon it into a piping bag fitted with a small nozzle. Spoon the strawberry jam into another piping bag.", "Sliced the iced fingers horizontally, leaving one long edge intact. Pipe in a generous line of whipped cream into the middle of each finger, then a thinner line of jam. Dust the iced fingers with icing sugar and serve. "]}, {"isVegetarian": true, "title": "Iced peppermint and chocolate parfait", "url": "www_bbc_co_uk_food_recipes_iced_peppermint_and_37509", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz milk", "200ml/7fl oz double cream", "1 vanilla pod, split and seeded", "5 free-range eggs, yolks only", "50g/1¾oz caster sugar", "1 large bunch peppermint, leaves picked", "3-4 drops peppermint essence", "3 free-range eggs, whites only", "150g/5½oz caster sugar", "450ml/16fl oz double cream", "115g/4oz dark chocolate, roughly grated", "75g/2¾oz caster sugar", "50g/1¾oz chopped hazelnuts", "115g/4oz dark chocolate, 70% cocoa solids", "2 tbsp demerara sugar", "3-4 drops peppermint essence"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the crème anglaise, place the milk, cream, vanilla pod and seeds into a saucepan and bring to the boil.", "Place the egg yolks and caster sugar into a bowl then pour over the hot milk mixture and whisk to combine.", "Pour the mixture back into the saucepan, bring to a simmer and cook until just thickened, stirring all the time. Remove the pan from the heat and divide the mixture - ¼ into one bowl for the hazelnut custard, and ¾ into another for the peppermint parfait.  ", "Blanch the peppermint leaves in boiling water for 30 seconds then drain and refresh in iced water. ", "Pour the ¾ of the crème anglaise into a food processor with the peppermint leaves and peppermint essence and blend to a very fine, pale green purée. Strain through a fine sieve into a clean bowl and allow to cool.", "For the parfait, grease a loaf tin with a little vegetable oil then line with two layers of cling film.", "In a clean mixing bowl, whisk the egg whites until they form soft peaks. Fold in the sugar to make a raw meringue mixture then whisk it into the mint-flavoured crème anglaise.", "Place the cream into a clean bowl and whip until it forms soft peaks. Fold the cream into the mint mixture then fold in the grated chocolate very carefully. Pour the mixture into the lined loaf tin and place in the freezer for at least four hours until firm.", "For the hazelnut custard, line a baking tray with greaseproof paper. Heat a frying pan over a high heat until hot. Add the sugar and cook until the sugar has completely melted and is sticky and golden-brown.", "Add the chopped hazelnuts and stir until they are coated in the sugar mixture, then pour the mixture onto the prepared baking tray. Set aside until the mixture has hardened.", "When the praline mixture has hardened, cover with a sheet of cling film and break into small pieces using a toffee hammer or rolling pin then place into a food processor and blend to a fine powder. Stir into the reserved ¼ of the crème anglaise.", "For the chocolate mint shards, melt the chocolate in a bowl over a pan of simmering water. Stir in the demerara sugar and peppermint essence then spoon onto baking tray lined with silicone or baking parchment and leave to set. When set, break the chocolate into large shards.", "To serve, cut the parfait into thick slices and place onto plates. Spoon a little hazelnut custard around then finish with a shard of mint chocolate. "]}, {"isVegetarian": true, "title": "Iced biscuits", "url": "www_bbc_co_uk_food_recipes_icedbiscuits_3054", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedbiscuits_3054_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened at room temperature", "100g/3½oz caster sugar", "1 medium free-range egg, lightly beaten", "275g/10oz plain flour", "1 tsp vanilla extract", "400g/14oz icing sugar", "3-4 tbsp water", "2-3 drops food colourings"], "serves": "Makes 24 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until combined.", "Beat in the egg and vanilla extract, a little at a time, until well combined.", "Stir in the flour until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using biscuit cutters, cut biscuits out of the dough and carefully place onto the baking tray.", "Bake for 8-10 minutes, or until pale golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring.", "Carefully spread the icing onto the biscuits using a knife and set aside until the icing hardens."]}, {"isVegetarian": true, "title": "Iced Christmas muffins", "url": "www_bbc_co_uk_food_recipes_icedchristmasmuffins_87589", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour ", "100g/3½oz wholemeal flour ", "2 tsp golden caster sugar", "1 tsp baking powder ", "1 lemon, zest only", "pinch ground cinnamon", "pinch ground cloves", "pinch ground star anise", "pinch ground nutmeg", "25g/1oz golden sultanas ", "25g/1oz glace cherries ", "125ml/4fl oz milk ", "1 free-range egg, beaten", "100ml/3½fl oz natural yoghurt ", "3 tbsp clear honey ", "75g/2½oz butter ", "300g/10½oz icing sugar ", "25ml/1fl oz lemon juice ", "25ml/1fl oz water", "decorative silver sugar balls, to decorate"], "serves": "Makes 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the self-raising flour, wholemeal flour, sugar and baking powder into a bowl.", "Add the lemon zest, cinnamon, cloves, star anise and nutmeg and mix well. ", "Add the sultanas and cherries and mix again.", "Place the milk, egg and yoghurt into a clean bowl and mix well.", "Place the honey and butter into pan over a medium heat and cook until the butter has melted. Stir gently to combine.", "Add the honey and butter mixture to the yoghurt and egg mixture and mix well.", "Add to the dry ingredients and fold together until just combined.", "Spoon the mixture into muffin cases and transfer to the oven to bake for 20-25 minutes, until risen and golden. Remove from the oven and leave to cool on a wire rack.", "For the icing, place the icing sugar, lemon juice and water into a bowl and mix well, until smooth.", "To serve, spread the icing on top of the muffins once they have cooled and decorate with silver sugar balls."]}, {"isVegetarian": true, "title": "Iced coffee and honeycomb parfait with vanilla custard and chocolate-coated coffee beans", "url": "www_bbc_co_uk_food_recipes_icedcoffeeparfaitwit_88170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "400g/14oz caster sugar", "110ml/4fl oz clear honey", "2 tbsp liquid glucose (available from the baking section of most supermarkets)", "110ml/4fl oz water", "1½ tsp bicarbonate of soda", "3 free-range eggs, separated", "110ml/4fl oz cold espresso coffee", "150g/5oz caster sugar", "450ml/16fl oz double cream", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150ml/5fl oz double cream", "1 vanilla pod, split", "75g/3oz plain chocolate, chopped", "25g/1oz roasted espresso coffee beans"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the honeycomb, line a baking tray with greaseproof paper and grease with vegetable oil. ", "Place the sugar, honey, liquid glucose and water into a saucepan and bring to a boil. ", "Continue to cook until the temperature reaches 160C/320F on a sugar thermometer, taking care as sugar at this temperature can be very dangerous.", "Remove from the heat and quickly beat in the bicarbonate of soda with a wooden spoon, stirring constantly.", "Pour the mixture onto the lined baking tray. Set aside until hard and then break into pieces using your hands.", "For the parfait, place the egg yolks, coffee and half of the sugar into a small frying pan and whisk to combine. ", "Place over a low heat and cook gently, stirring occasionally, for about ten minutes, or until the mixture thickens.", "Remove from the heat and pour through a metal sieve into a mixing bowl. Whisk until the mixture cools and is light and fluffy. Set aside.", "In a clean mixing bowl, whisk the egg whites to form soft peaks when the whisk is removed from the bowl. Fold in the remaining sugar to make a raw meringue mixture.", "Whisk the meringue mixture into the set-aside coffee mixture.", "Place the cream into a separate bowl. Whip the cream until soft peaks form when the whisk is removed from the bowl. Fold the cream into the coffee mixture.", "Line a rectangular loaf tin with cling film. Pour half of the parfait mixture into the tin.", "Place pieces of the honeycomb on top of the parfait to cover. Pour the remainder of the parfait over the honeycomb.", "Tap to settle and cover with cling film. Place in the freezer for two hours until frozen just solid.", "For the custard, place the egg yolks and sugar in a bowl and whisk until well blended.", "Place the milk and cream into a saucepan.", "Using a sharp knife, scrape out the seeds of the vanilla pod and add to the milk mixture. Bring to the boil.", "Pour the hot milk and cream onto the eggs, whisking all the time. Pour the mixture back into the saucepan and heat gently, stirring occasionally, until the mixture thickens. Keep warm.", "For the chocolate-coated coffee beans, line a tray with greaseproof paper. Place the chocolate into a bowl and place over a pan of boiling water until melted.", "Add the coffee beans to the chocolate and stir to coat. Pour into the lined tray and allow to cool. Break into pieces when cool.", "To serve, remove the parfait from the freezer 20 minutes before serving. Cut 2cm/¾ slices of the parfait and place onto the centre of each serving plate. Spoon the custard around the edge and scatter over the chocolate coated coffee beans."]}, {"isVegetarian": true, "title": "Iced lemon curd layer cake", "url": "www_bbc_co_uk_food_recipes_icedlemoncurdlayerca_67258", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedlemoncurdlayerca_67258_16x9.jpg", "ingredients": ["1 lemon, zest only, grated", "1 tbsp lemon juice ", "175g/6oz self-raising flour, sifted ", "1 level tsp baking powder ", "175g/6oz butter, at room temperature ", "175g/6oz caster sugar ", "3 eggs ", "1 large juicy lemon, grated zest and juice only ", "75g/3oz  caster sugar ", "2 eggs ", "50g/2oz  unsalted butter ", "1 large lemon, zest only ", "50g/2oz sifted icing sugar ", "2-3 tsp lemon juice"], "serves": "12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Measure all the cake ingredients into a mixing bowl and beat - ideally with an electric hand whisk - until you have a smooth, creamy consistency. Then divide the mixture evenly  between the two tins and bake them on the centre shelf of the oven for about 35 minutes or until the centres feel springy when lightly touched with a little finger.", "While the cakes are cooking, make the lemon curd, place the sugar and grated lemon zest in a bowl, whisk the lemon juice together with the eggs, then pour this over the  sugar. Then add the butter cut into little pieces, and place the bowl over a pan of barely simmering water. Stir frequently till thickened - about 20 minutes. You don't have to stay  with it - just come back from time to time to give it a stir.", "When the cakes are cooked, remove them from the oven and after about 30 seconds turn them out on to a wire rack. When they are absolutely cold - and not before - carefully cut each one horizontally into two using a sharp serrated knife. Now spread the curd thickly to  sandwich the sponges together.", "For the icing, begin by removing the zest from the lemon - it's best to use a zester to get long, curly strips. Then sift the icing sugar into a bowl and gradually stir in the lemon juice until you have a soft, runny consistency. ", "Allow the icing to stand for 5 minutes before spreading it on top of the cake with a knife, almost to the edges, and don't worry if it runs a little down the sides of the cake. Then scatter the lemon zest over the top and leave it for half an hour for the icing to firm up before serving."]}, {"isVegetarian": false, "title": "Icelandic breaded lamb chops with spiced red cabbage", "url": "www_bbc_co_uk_food_recipes_icelandic_breaded_lamb_29809", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icelandic_breaded_lamb_29809_16x9.jpg", "ingredients": ["60g/2¼oz butter", "1 large onion, thinly sliced", "1 red cabbage (around 750g–1kg/1lb 10oz–2lb 4oz), thinly shredded", "1 large Bramley apple, peeled, cored and chopped", "50ml/2fl oz red wine vinegar", "60g/2¼oz blueberries", "2 tbsp dark brown sugar", "4 tbsp bramble jelly or jam (or redcurrant jelly)", "3 cloves", "5cm/2in length cinnamon stick", "freshly ground black pepper", "1½ tsp salt ", "16 small best-end lamb chops", "100g/3½oz plain flour", "2 free-range eggs, beaten", "100g/3½oz fresh white breadcrumbs", "60g/2¼oz butter, for frying", "2 tbsp vegetable or rapeseed oil ", "salt and pepper", "new potatoes, boiled ", "knob of butter", "1 tsp freshly chopped parsley"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the red cabbage, melt the butter in a large saucepan and gently fry the onion until soft. Add the red cabbage and cook for 2 minutes. Add the apple, vinegar, blueberries, brown sugar, bramble jelly, cloves, cinnamon stick and 125ml/4fl oz water. Season with 20 turns of a black pepper mill and the salt. Cover with a tight-fitting lid and cook for 45 minutes, then check the liquid, if drying out add a splash more water; if there is a lot of liquid in the pan, remove the lid so any excess evaporates. Cook for another 15 minutes. ", "For the lamb, season the chops with salt and pepper. Put the flour, beaten eggs and breadcrumbs in separate shallow bowls. Toss the chops in the flour, then dip in the beaten egg and coat with the breadcrumbs. ", "Heat the butter and oil in a large frying pan. Once hot, fry the chops until golden-brown all over and cooked through (about 7–8 minutes on each side). ", "To serve, remove the cinnamon stick and cloves from the cabbage. Serve the cabbage and chops with boiled new potatoes rolled in melted butter and sprinkled with chopped parsley. "]}, {"isVegetarian": true, "title": "Îles flottantes", "url": "www_bbc_co_uk_food_recipes_iles_flottantes_64016", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iles_flottantes_64016_16x9.jpg", "ingredients": ["500ml/17fl oz milk", "vanilla seeds from one vanilla pod", "4 free-range egg yolks, plus 1 whole free-range egg", "100g/3½oz caster sugar", "100g/3½oz caster sugar", "4 free-range egg whites", "500ml/17fl oz milk", "100g/3½oz caster sugar"], "serves": "Serves 3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the custard, warm the milk and vanilla seeds in a saucepan over a medium heat. Bring the mixture to a gentle simmer and simmer for 3 minutes.", "Meanwhile, in a large bowl, whisk together the egg yolks, whole egg and the sugar until pale and well combined. ", "Pour the warm milk over the egg mixture a little at a time, whisking continuously. ", "Return the custard mixture to the saucepan and cook over a medium heat, stirring continuously with a wooden spoon, for 5-10 minutes, or until the mixture thickens enough to coat the back of a spoon. Set aside to cool, then chill in the fridge.", "Meanwhile, for the meringues, sprinkle the caster sugar onto a high-sided baking tray. Cook the sugar in the oven for 4 minutes.", "In a large mixing bowl, whisk the egg whites using an electric whisk As you whisk them, gradually pour in the slightly warmed sugar, little by little, until it has all been incorporated into the mixture and stiff peaks form when the whisk is removed.", "Bring the milk to a very gentle simmer in a saucepan.", "Run a serving spoon under the tap, then take 3 oval-shaped scoops of the meringue mixture and gently lower them into the warm milk. Poach for 3-4 minutes on each side, or until cooked through. Remove from the milk using a slotted spoon and set aside to drain on kitchen paper.", "For the caramel, melt the sugar in 50ml/2fl oz water in a saucepan over a medium heat. Stir with a wooden spoon until the sugar dissolves in the water and the mixture turns copper in colour. Remove from the heat.", "To serve, ladle the chilled custard into bowls. Float one meringue 'island' on top of each portion of custard. Drizzle a trickle of caramel over each to finish."]}, {"isVegetarian": true, "title": "Iles flottantes 'façon Maman Blanc'", "url": "www_bbc_co_uk_food_recipes_ilesflottantefaconma_93228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites ", "squeeze lemon juice", "120g/4¼oz caster sugar", "1 litre/1¾fl oz pints full-fat milk, preferably organic", "2 tsp vanilla bean paste", "10 free-range egg yolks", "80g/3oz caster sugar", "ice cubes", "50ml/2fl oz water", "100g/3½oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the meringues, whisk the egg whites and lemon juice in a clean bowl until soft peaks form when the whisk is removed.", "Add the sugar a third at a time, whisking after each addition, until stiff peaks form when the whisk is removed. ", "Bring the milk and the vanilla bean paste to the boil in a large, shallow, lidded pan. Reduce the heat until the mixture is just simmering.", "Dip 2 tablespoons in hot water, then make 8 quenelles of the meringue mixture, using the spoons to shape the meringue. Carefully lower each quenelle of meringue into the simmering milk. Cover the pan with the lid and poach for 7-10 minutes, carefully turning the meringues over halfway through cooking.", "Remove the poached meringues from the pan using a slotted spoon and set aside to drain on a small tray until needed. Reserve the poaching milk and keep hot.", "For the vanilla cream, lightly whisk the egg yolks and caster sugar together in a mixing bowl, until smooth.", "Gradually add the hot milk to the egg yolks, whisking continuously, then return the custard mixture to the pan and heat over a medium heat, stirring continuously with a wooden spoon, until the custard is thick enough to coat the back of the spoon. ", "Pour the custard immediately into a large serving bowl and suspend it over a bowl of ice cubes or chilled water. Stir occasionally until the custard cools.", "When the custard has cooled, transfer to a serving bowl. Float the poached meringues on top of the cooled custard, then chill in the fridge for up to 24 hours.", "For the caramel, pour the water into a straight-sided pan, then add the sugar and cook over medium heat, until the sugar has dissolved. Once no sugar crystals remain, boil the mixture until caramelised to a dark golden-brown.", "Carefully dip the base of the pan into a bowl or sink full of cold water to prevent the caramel from cooking any further.", "Pour the caramel over the floating meringues and serve immediately."]}]