[{"ingredients": ["2 cucharaditas de levadura fresca o 7g / ¼ oz de levadura seca", "200ml / 7fl oz de agua tibia", "Harina de pan blanco fuerte de 250g / 9oz", "2 cucharadas de levadura fresca o 1 cucharada seca", "300ml / 10fl oz de agua tibia", "1 kg / 2¼ lb de harina blanca fuerte, más extra para quitar el polvo", "2 cucharaditas de sal"], "method": ["Para hacer el primer plato, mezcle la levadura y el agua en un tazón. Agregue la harina de 250 g / 9 oz y revuelva hasta que se forme una pasta espesa. Cubra con un paño de cocina y déjelo toda la noche a temperatura ambiente.", "Para hacer la masa, mezcle la levadura con 2 cucharadas de agua tibia.", "Vierta la 1 kg / 2¼ lb de harina en un montículo en una superficie plana, luego mezcle la sal.", "Haz un pozo en el centro del montículo. Vierta la mezcla de levadura y el iniciador en el pozo. Poco a poco agregue el agua restante y lentamente combine en una masa con sus manos.", "Amasar la masa durante aproximadamente 10 minutos, agregando más harina o agua si es necesario, hasta que esté suave pero firme y elástica. La masa está lista cuando vuelve a su forma original cuando la empujas con el dedo.", "Divida la masa en dos y déle forma a cada mitad en un pan redondo. Coloque en una bandeja para hornear, corte una cruz en la parte superior de cada barra y espolvoree ligeramente con harina. Deje que se levante en un lugar cálido durante aproximadamente 1 ½ horas hasta que tenga el doble de tamaño.", "Precalentar el horno a 200C / 400F / Gas 6.", "Hornee los panes en el horno durante una hora o hasta que los panes suenen huecos al golpearlos debajo."], "url": "www_bbc_co_uk_food_recipes_panetoscana_82391", "title": "Pan toscano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 1 pan grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "7g de sal", "50 g / 2 oz de azúcar en polvo", "2 bolsitas de 7 g de levadura instantánea", "140ml / 5fl oz de leche caliente", "5 huevos de gallinas camperas, a temperatura ambiente, más extra para lavar huevos", "250 g / 9 oz de mantequilla sin sal, ablandada, más extra para engrasar", "120 g / 4½oz de cerezas secas", "120 g / 4½ oz de pasas secas", "120 g / 4½ oz de pasas de Corinto", "100g / 3½oz de almendras blanqueadas enteras"], "method": ["Coloque la harina, la sal, el azúcar, la levadura, la leche y los huevos en el cuenco de un mezclador independiente equipado con un gancho de masa.", "Mezcle lentamente durante dos minutos, luego aumente la velocidad a medio y mezcle por otros 6-8 minutos hasta que tenga una masa suave.", "Agregue la mantequilla ablandada y mezcle por otros 5-8 minutos. Recuerde raspar periódicamente el recipiente para asegurarse de que la masa se mezcle bien. Será muy suave", "Agregue la fruta seca y nueces. Mezcle hasta que todo esté incorporado.", "Incline la masa en un recipiente, cubra con film transparente y relájese toda la noche hasta que la masa se haya endurecido lo suficiente como para que pueda darle forma.", "Prepare una lata de panettone de 18cm / 7in cepillando el interior generosamente con mantequilla derretida.", "Retire la masa de panettone de la nevera.", "Derriba la masa, forma una bola y colócala en la lata.", "Deje que se pruebe a temperatura ambiente durante 2-3 horas más, hasta que la masa empiece a dominar sobre la parte superior de la lata.", "Precalentar el horno a 180C / 350F / Gas 4.", "Cepille la parte superior del panettone con un lavado de huevos y hornee por unos 25 minutos. Reduzca la temperatura a 150 ° C / 300 ° F / Gas 2 y hornee por otros 35 minutos o hasta que la brocheta salga limpia. Verifique el panettone periódicamente en el caso de los puntos calientes del horno. Tenga en cuenta que el azúcar y la mantequilla en la masa pueden dorarse demasiado antes de que esté completamente horneada.", "Retire el panettone de la lata de inmediato y deje enfriar."], "url": "www_bbc_co_uk_food_recipes_panettone_16322", "title": "Panettone", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panettone_16322_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Tocino ahumado de 200 g / 7 oz, sin grasa, picado", "½ papa para hornear, pelada y rallada", "1 cucharada de aceite de oliva", "1 huevo de gallinas camperas", "rociando pimienta negra recién molida"], "method": ["Para el tocino y la papa rösti, caliente el aceite en una sartén a fuego medio y fría las piezas de tocino durante 5-6 minutos, o hasta que estén crujientes y doradas.", "Coloque la papa rallada en una toalla de té limpia y junte los bordes de las toallas de té para formar un paquete. Exprime la papa rallada en el paño de cocina hasta que se haya extraído la mayor cantidad de humedad posible.", "Agregue la papa rallada a la sartén con el tocino y mezcle bien para combinar.", "Presione la mezcla de papa en la sartén con una espátula o rebanada de pescado. Freír a fuego medio durante 5-6 minutos en cada lado, hasta que estén dorados y crujientes en ambos lados.", "Para el huevo frito, caliente el aceite en una sartén a fuego alto, agregue el huevo y fría hasta que se haya puesto. Espolvorea la pimienta negra recién molida sobre el huevo."], "url": "www_bbc_co_uk_food_recipes_panfriedbaconandpota_89412", "title": "Tocino frito y rosti de patata con huevo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Panettone 250 g / 9 oz, cortado en rebanadas de 1 cm / ½ in", "200g / 7oz de mantequilla sin sal", "300ml / 10fl oz compota de zarzamora", "4 huevos de gallinas camperas", "2 yemas de huevo", "400ml / 14fl oz de leche entera", "400ml / 14fl oz crema", "120 g / 4 oz de azúcar en polvo", "azúcar en polvo, para quitar el polvo", "250ml / 9fl oz pouring cream (opcional)"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Liberalmente extendió el pan dulce de rebanada con la mantequilla y luego con la compota de mora.", "Coloque la pannetone en una bandeja para hornear de 20x30 cm / 8x12 in o en un plato resistente al horno en cualquier orden que lo haga feliz: en un patrón simétrico o descuidado, ¡es totalmente suya!", "Batir los huevos enteros, las yemas de huevo, la leche, la crema y el azúcar impalpable en un tazón grande.", "Vierta un poco de la mezcla de huevo sobre las rebanadas de Pannetone y deje reposar durante cinco minutos. Repite el proceso un par de veces más, hasta que toda la mezcla se haya agotado.", "Hornee durante 25-30 minutos, o hasta que estén dorados en la parte superior, pero todavía un poco tambaleantes.", "Sirve el budín en tazones para servir, espolvoreado con azúcar glas y con un poco de crema, si te gusta."], "url": "www_bbc_co_uk_food_recipes_panettone_bread_and_46908", "title": "Pan de Panettone y Pudín de Mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechuga de pollo 150 g / 5½ oz", "25g / 1oz Stilton", "2 rebanadas de tocino ahumado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1/2 calabaza, pelada, sin semillas, picada, hervida hasta que esté suave y escurrida", "50g / 1¾oz Stilton", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, haga una incisión en la pechuga de pollo a lo largo para crear un bolsillo.", "Coloque el Stilton en el bolsillo y luego envuelva el pecho con las lonchas de tocino.", "Frote la pechuga envuelta en tocino con el aceite de oliva y sazone ambos lados con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno a fuego alto. Agregue el pollo envuelto en tocino y revuelva la sartén por un minuto en cada lado hasta que se dore.", "Transfiera al horno y tueste por 12-15 minutos, o hasta que el pollo esté completamente cocido.", "Para hacer el puré, machaque la calabaza cocida usando un triturador de papas o un ricer.", "Agregue la crema y Stilton, mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca el puré de calabaza en el medio de un plato grande calentado y coloca el pollo encima."], "url": "www_bbc_co_uk_food_recipes_panfriedbaconwrapped_81281", "title": "Pechuga de pollo envuelta en tocino y frita con puré de calabazas butternut cursi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1x110g / 4oz filete de salmón fino, piel en", "1 cucharada de vinagre balsámico", "2 cucharaditas de miel clara", "2 cucharaditas de semillas de sésamo", "1 papa pequeña, pelada y cortada en cubitos", "25g / 1oz de mantequilla", "2 cucharadas de crema doble", "2 cucharadas de queso cheddar rallado", "35g / 1¼ oz de cohete, picado"], "method": ["Para el salmón, caliente el aceite en una sartén a fuego alto. Cuando esté caliente agregue el salmón y la sartén por 1-2 minutos por cada lado.", "Mantener el salmón en la sartén, escurrir el aceite de la sartén y agregar el vinagre balsámico y cocinar por dos minutos.", "Finalmente agregue la miel y las semillas de sésamo. Retire el salmón de la sartén. Para hacer una salsa, agregue una cucharada de agua caliente a la sartén y revuelva bien para eliminar los pedazos pegajosos del fondo de la sartén.", "Para el puré, ponga a hervir una olla de agua con sal. Hervir las papas durante diez minutos.", "Escurra las papas y colóquelas en un tazón con la mantequilla, la crema, el queso y el cohete y aplastelos juntos.", "Para servir, coloca el puré en un plato para servir con el salmón encima. Rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedbalsamicandh_84491", "title": "Salmón balsámico y miel glaseado a la sartén con queso y puré de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de lubina 2x200g / 7oz", "1½ cucharadas de aceite vegetal", "½ cucharada de aceite de oliva", "2 pimientos rojos, muy pulcramente y en rodajas finas", "2 pimientos amarillos, muy bien cortados y en rodajas finas", "2 dientes de ajo, finamente picados", "5cm / 2 en trozo de jengibre, rebanado y cortado en fina juliana", "1,2 litros / 2 pintas de caldo de pollo liviano, caliente", "1 naranja, ralladura y jugo", "1 lima, ralladura y jugo", "1 limón, ralladura y jugo", "1 cucharada de azúcar en polvo", "2 chiles rojos, cortados en ángulo para formar anillos largos y sin semillas", "2 chiles verdes, cortados en ángulo para formar anillos largos y quitar las semillas", "2 cucharadas de cilantro fresco finamente picado", "1 cucharada de aceite vegetal", "un gran puñado de espinacas baby, blanqueadas en agua hirviendo durante 1-2 minutos (esto es para que los peces se sienten en el centro del plato)"], "method": ["Marque los filetes de lubina en el lado de la piel para evitar que el pescado se encrespe cuando se frie.", "En una sartén, caliente la aceituna y ½ cucharada de aceite vegetal y coloque el pescado con la piel hacia abajo en el aceite caliente y deje que se fríe durante un par de minutos", "Mientras tanto, caliente el resto del aceite vegetal de 1 cucharada en un wok caliente y agregue los pimientos y los chiles y saltee por un minuto o dos.", "Compruebe el pescado y si la piel es crujiente, voltee el pescado y cocine el otro lado durante unos minutos.", "A los pimientos y los chiles ahora agregue el ajo y el jengibre y revuelva.", "Agregue el caldo de pollo, el jugo de los cítricos y deje que burbujee.", "Agregue el azúcar y los zumos de cítricos.", "Finalmente agregue el cilantro fresco y está listo para servir.", "Para servir, coloque la espinaca escaldada en el centro del plato de servir y coloque el pescado encima, con la piel hacia arriba. Coloque los pimientos y el caldo sobre los pescados hasta que el caldo esté al nivel del pescado y coman inmediatamente. Adorne el pescado con un poco de ralladura de cítricos, opcional."], "url": "www_bbc_co_uk_food_recipes_panfriedbasswithathr_67270", "title": "Lubina frita con tres salteados de pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "1 cebolla grande, cortada a la mitad y en rodajas finas", "una pizca de azúcar", "1½ cucharadita de vinagre balsámico", "6 lonchas de tocino rayado curado en seco y cortado en láminas finas, sin corteza", "275-350 g / 10-12 oz de hígado de ternera, muy delgado en rodajas", "Harina sazonada de 15 g / ½ oz para quitar el polvo", "1 cucharada de aceite de girasol", "sal", "pimienta negra recién molida", "Grano de 225 g / 8 oz, pelado y cortado en trozos", "Zanahorias 225 g / 8 oz, peladas y cortadas en trozos", "Papas 225g / 8oz, peladas y cortadas en trozos", "Mantequilla de 25g / ¾oz", "puñado de cohetes", "sal", "pimienta negra recién molida"], "method": ["Precalentar la parrilla a alto. Derretir la mantequilla en una sartén grande y freír las cebollas y el azúcar a fuego medio, revolviendo con frecuencia, durante 7-8 minutos hasta que esté bien dorado.", "Sazone con sal y pimienta, agregue el vinagre balsámico y déjelo burbujear durante unos segundos. Mantener caliente", "Ase el tocino hasta que comience a crujir en los bordes. Mantener caliente", "Sazonar el hígado en ambos lados con sal y pimienta y luego cubrir ligeramente con la harina sazonada. Pat del exceso.", "Calentar otra sartén grande a fuego alto. Agregue el aceite y luego las rodajas de hígado y cocínelas a fuego alto durante 30 segundos por cada lado, con el objetivo de que el hígado se dore bien por fuera, pero aún rosado y jugoso por dentro.", "Para hacer el puré de verduras y cohetes, cocine el colinabo, las zanahorias y las papas en agua hirviendo con sal durante 20 minutos, hasta que estén tiernos. Luego drene, coloque en una licuadora con la mantequilla y blitz en un puré suave.", "Finalmente, devuelva el puré a la sartén y déjelo calentar suavemente hasta que la mezcla se haya secado. Agregue el cohete, sal y pimienta y sirva con el hígado frito, el tocino y las cebollas balsámicas caramelizadas."], "url": "www_bbc_co_uk_food_recipes_panfriedcalfsliverwi_71185", "title": "Hígado de ternera frita con tocino seco curado y cebollas balsámicas caramelizadas, servido con puré de verdura y rúcula", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "Hígado de ternera de 250g / 9oz, cortado en rodajas finas y cortado por la mitad a lo largo", "4 cucharadas de puerto o Madeira", "2 cucharaditas de vinagre de vino tinto", "100 ml / 3½ fl oz de carne fresca de res o caldo de pollo (puedes comprar esta ya hecha en una bañera)", "250 g / 9 oz de pasta fresca, o 200 g / 7 oz seca, cinta", "½ cucharada de salvia fresca picada o un buen pellizco de salvia seca", "1 tsbp crème fraïche (opcional)", "sal marina", "pimienta negra recién molida"], "method": ["Caliente una sartén grande de agua ligeramente salada hasta que hierva para la pasta", "Mientras tanto, caliente la mitad de la mantequilla con el aceite en una sartén hasta que ya no haga espuma ni se sienta caliente. Agregue el hígado y fría por 1-2 minutos por cada lado hasta que esté dorado y firme cuando lo presione con la parte trasera de un tenedor. Sazonar en la sartén, luego retirar a un plato caliente y mantener caliente.", "Agregue el puerto o Madeira a la sartén, deje hervir y deje que burbujee hasta que se reduzca a la mitad. Agregue el vinagre y cocine por unos segundos. Verter en el caldo y llevar a ebullición, revolviendo. Continúe hirviendo hasta que se reduzca a la mitad.", "Mientras tanto, agregue la pasta a la cacerola de agua hirviendo y cocine por 2-3 minutos para la pasta fresca, o según las instrucciones del paquete para la pasta seca, hasta que esté tierna. Escurra, y luego mezcle con la mantequilla restante y la salvia fresca o seca.", "Sazonar bien la pasta y dividir entre dos platos calentados. Coloque el hígado sobre la parte superior (es posible que desee cortar esto en piezas atractivas). Bate la crème fraïche en la salsa en la sartén, si se usa, revisa el condimento y aplica una cuchara sobre el hígado.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_panfriedcalvesliverw_71474", "title": "Hígado de ternera frito con oporto y salvia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla", "2 rebanadas de hígado de ternera (1cm / ½ pulgada de espesor)", "110ml / 4fl oz de vino tinto", "250ml / 4fl oz de caldo de carne", "6 rebanadas de tocino rayado curado en seco, cortado en lonchas", "1 caballo nero cabbage, sliced", "1 limón, solo jugo", "50g / 2oz de crema fresca"], "method": ["Caliente una sartén hasta que esté caliente y agregue 25 g / 1 oz de mantequilla.", "Sazone el hígado con sal y pimienta negra recién molida y agregue a la sartén. Freír en cada lado durante 2-3 minutos, hasta que se cocinen a su gusto. Retire de la sartén y reserve.", "Agregue el vino tinto a la sartén y deje que hierva, raspando para liberar los pegajosos jugos de cocina caramelizados de la base de la sartén.", "Reduzca el líquido a la mitad, luego agregue el caldo de carne y hierva por otros 5-6 minutos.", "Agregue 25 g / 1 oz de mantequilla y agregue. Retire del fuego.", "Caliente una sartén de lados profundos hasta que esté caliente, luego agregue la mantequilla restante de 25 g / 1 oz y las piezas de tocino. Freír hasta que estén crujientes y luego agregar el cavelo nero y sofreír durante 3-4 minutos, hasta que se marchiten.", "Agregue el jugo de limón y sazone bien con sal y pimienta negra recién molida.", "Para servir, coloque el repollo en el centro de dos platos. Cubra cada uno con el hígado y una cucharada de crème fraîche. Cuchara sobre la salsa de vino tinto."], "url": "www_bbc_co_uk_food_recipes_panfriedcalvesliverw_85716", "title": "Ternera a la plancha hígado con tocino, limón y cavolo nero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 etiqueta de pollo Anglaise, sin patas", "1 bulbo de ajo", "1 puñado de tomillo fresco", "sal y pimienta negra recién molida", "2 litros / 3pt 10 fl oz de caldo de pollo", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla ligeramente salada", "Arroz risotto 250 g / 9 oz", "300 g / 11 oz de alcachofas de Jerusalén, en rodajas finas", "50g / 2oz de mantequilla", "Crema doble 50ml / 2fl oz", "4 cucharadas de queso parmesano, recién rallado", "1 puñado de cebollín fresco, finamente picado", "200 g / 7 oz zanahorias bebé", "Nabos para bebés de 200 g / 7 oz", "1 puñado de romero fresco", "3 dientes de ajo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "2 cucharadas de miel clara", "2 cucharadas de vinagre de jerez", "1 pequeños brotes de guisantes"], "method": ["Método para pollo, coloque el bulbo de ajo y varias ramitas de tomillo en la cavidad del pollo.", "Sazone el pollo con sal y pimienta negra y colóquelo en una olla grande con tapa. Agregue el caldo de pollo a la sartén y cubra la sartén con una tapa.", "Llevar la mezcla a ebullición, luego reducir el fuego y escalfar suavemente el pollo durante 25 minutos.", "Retire la sartén del fuego y deje que el pollo se enfríe en el caldo. Luego retire el pollo de la sartén y seque con papel de cocina. Reserve el caldo de pollo para más tarde.", "Retire la pechuga del pollo y sazone con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva y coloque la pechuga de pollo en la sartén, con la piel hacia abajo.", "Freír el pecho hasta que la piel se dore y luego darle la vuelta al otro lado. Agregue la mantequilla y fría hasta que el pollo esté completamente cocido.", "Para el risotto, coloque 500 ml / 18 fl oz del caldo de pollo en el que se introdujo el pollo, en una olla limpia y deje que hierva.", "Agregue el risotto de arroz a la sartén y deje que la mezcla hierva a fuego lento durante 4-5 minutos, hasta que el arroz esté ligeramente tierno. Escurra el exceso de caldo del arroz y deje que el arroz se enfríe en la cacerola.", "Coloque las alcachofas y la mitad de la mantequilla en una olla limpia y caliente a baja temperatura hasta que las alcachofas se ablanden.", "Agregue la crema y 175ml / 6fl oz del caldo de pollo escalfado y lleve a ebullición.", "Vierta el caldo y las alcachofas en el recipiente de un procesador de alimentos y mezcle la mezcla hasta que se forme un puré.", "Vuelva a colocar la cacerola de arroz sobre el fuego y gradualmente agregue un cucharón a la vez del resto del caldo de pollo escalfado a la sartén (deje que el arroz absorba el caldo antes de agregar cada cucharón de caldo). Continúe agregando el caldo al arroz hasta que el arroz esté tierno.", "Agregue una cucharada grande del puré de alcachofa, la mantequilla restante y el queso parmesano a la cacerola y revuelva hasta que los ingredientes se hayan combinado.", "Agregue las cebolletas al risotto y mezcle bien.", "Para las verduras asadas, coloque las zanahorias, los nabos, el romero y dos de los dientes de ajo en una cacerola limpia y llene la cacerola con agua hasta que los vegetales estén cubiertos. Sazonar las verduras con sal y pimienta negra recién molida y llevar la sartén a ebullición. Drene el exceso de agua de las verduras.", "Caliente una sartén limpia hasta que esté humeante y luego agregue el aceite de oliva, un poco más de romero y otro diente de ajo.", "Agregue la miel a la sartén y glasear con el vinagre de jerez. Mezcle bien los ingredientes.", "Para servir, espolvorea un poco del risotto en el lado de un plato limpio y coloca el pollo encima. Coloque las verduras en el otro lado del plato y coloque los brotes de arvejas en la parte superior. Rocíe el aceite de oliva sobre la parte superior del plato."], "url": "www_bbc_co_uk_food_recipes_panfriedchickenbreas_84846", "title": "Pechuga de pollo frita con risotto de alcachofa de Jerusalén y verduras asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo orgánicas sin hueso, con piel", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "6 cebollas bebé, peladas y partidas por la mitad", "½ cucharadita de azúcar en polvo", "6 papas nuevas, cortadas a la mitad longitudinalmente", "1 manojo de cebollín fresco, finamente picado", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "Champiñones de mouton de 200g / 7oz (u otras setas), limpios y recortados", "sal y pimienta negra recién molida", "4 chalotes, finamente picados", "200 ml / 7 fl oz crema individual", "12 hojas de ajo silvestre, finamente picadas"], "method": ["Precalentar el horno a 160 ° C / 320 ° F / Gas 3.", "Para el pollo, sazone las dos pechugas de pollo con sal y pimienta negra recién molida, luego coloque, con la piel hacia abajo, en una sartén caliente a prueba de horno a fuego medio. Cocine hasta que la piel esté dorada, luego agregue cebollas tiernas y azúcar a la sartén.", "Voltee las pechugas de pollo y transfiéralas al horno para cocinar por otros 7-8 minutos, o hasta que el pollo esté completamente cocido. Retire del horno y deje reposar durante cinco minutos.", "Para las papas, coloque las papas en una olla con agua, agregue sal y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante diez minutos, o hasta que estén tiernos, luego drene el líquido.", "Agregue las cebolletas y sazone, al gusto, con sal y pimienta negra recién molida y déjelas reposar.", "Para los champiñones, caliente una sartén antiadherente hasta que esté caliente y agregue la mantequilla a la sartén. Cuando la mantequilla esté espumosa, agregue los champiñones, sazone con sal y pimienta negra recién molida y déjela freír durante 1-2 minutos.", "Agregue los chalotes picados y cocine por otros dos minutos.", "Reduzca el fuego y agregue la crema individual. Caliéntelo suavemente para llevarlo a ebullición y, una vez que hierva, reduzca el fuego y agregue las hojas silvestres de ajo. Revuelva bien y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la mezcla de champiñones en dos tazones para servir y coloque las pechugas de pollo encima. Coloque las cebollas bebé alrededor del plato y sirva las papas nuevas en el lado."], "url": "www_bbc_co_uk_food_recipes_panfriedchickenbreas_86038", "title": "Pechuga de pollo frita, ajo silvestre y setas con patatas hervidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas. aceite de oliva virgen extra, más extra para lloviznar", "4 pechugas de pollo deshuesadas y sin piel, de aproximadamente 150 g / 5½ oz cada una", "2 chalotes, picados", "4 dientes de ajo, picados", "1 chile rojo fresco grande, sin semillas y picado", "1 bombilla pequeña de hinojo, en rodajas finas", "400 g / 14 oz pueden flageolet frijoles, enjuagados y drenados", "1 limón, jugo y ralladura solamente", "3 cucharadas de hierbas frescas mezcladas picadas, p. perejil, menta o albahaca", "8 finas rebanadas de panceta", "sal marina y pimienta negra recién molida", "Ensalada de hojas verdes", "pan crujiente"], "method": ["Caliente una sartén antiadherente grande de base pesada hasta que sienta que sube la temperatura.", "Agregue aproximadamente una cucharada de aceite, luego agregue las pechugas de pollo y fríelas por unos cinco minutos por cada lado hasta que queden firmes al presionarlas con la parte trasera de un tenedor.", "Sazonar bien y reservar en la sartén. Se mantendrán calientes sin calentamiento adicional.", "Caliente la cucharada restante de aceite en una sartén por separado, agregue los chalotes, el ajo, el chile y el hinojo y saltee durante unos cinco minutos hasta que se ablanden.", "Agregue los frijoles y el aderezo al gusto, y luego caliente hasta que esté caliente.", "Agregue la ralladura de limón y el jugo y las hierbas frescas.", "Mientras tanto, caliente la parrilla hasta que esté caliente y ase la panceta hasta que esté crujiente.", "Retire la panceta de la parrilla y escurra sobre papel de cocina.", "Divida la mezcla de frijoles y de hinojo entre cuatro platos para servir calentados.", "Cortar las pechugas de pollo en medallones y organizar en la parte superior, luego agregue dos rebanadas de panceta a cada plato, que puede desmenuzar o dejar todo.", "Rocíe sobre cualquier zumo de pan de pollo con un poco de aceite extra.", "Sirva caliente con el pan crujiente y la ensalada de hojas verdes."], "url": "www_bbc_co_uk_food_recipes_panfriedchickenwithc_73603", "title": "Pollo frito con frijoles, hinojo y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ filete de pechuga de pollo, cortado en tiras", "50ml / 2fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "55g / 2oz de queso Dolcelatte", "15g / ½ oz de mantequilla", "2 cucharadas de perejil fresco picado", "1 patata Desirée, pelada y picada", "55g / 2oz guisantes", "2 cucharadas de aceite de oliva", "6 hojas de menta fresca picadas", "sal y pimienta negra recién molida"], "method": ["Para el pollo, caliente el aceite de oliva en una sartén y fría las tiras de pollo durante 3-5 minutos, o hasta que estén doradas y recién cocidas.", "Agregue el vino a la sartén para desglasar, reduzca el fuego a fuego lento y cocine durante 2-3 minutos más, o hasta que el líquido se haya reducido a la mitad en volumen.", "Para la salsa, agregue la crema y el queso a la sartén con el pollo y deje hervir a fuego lento, revolviendo hasta que el queso se haya derretido. Finalmente, agregue la mantequilla y el perejil.", "Para el puré de guisantes y patatas, cocine la papa en una cacerola con agua hirviendo durante 7-9 minutos, o hasta que esté tierna, agregando los guisantes durante los últimos 2-3 minutos del tiempo de cocción. Escurra y coloque los guisantes y la papa en un procesador de alimentos con aceite de oliva y menta. Mezclar hasta obtener un puré suave, luego sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca el puré de guisantes y patatas en un plato para servir y coloca las tiras de pollo en la parte superior. Rocíe la salsa de crema alrededor de los bordes del plato."], "url": "www_bbc_co_uk_food_recipes_panfriedchickenwithd_90707", "title": "Pollo frito con salsa de crema Dolcelatte y puré de guisantes y puré de patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de bacalao 4x200g / 7oz", "cebollino picado", "500 g / 1lb2oz de guisantes congelados", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida", "Chalotes de 250 g / 9 oz en rodajas", "Stock de 290 ml / ½ pinta de pescado", "Recortes de tocino ahumado 200 g / 7 oz", "50ml / 1½ fl oz crema", "250ml / 8 fl oz de leche", "70g / 3oz de mantequilla", "1 hoja de laurel", "1 ramita grande de tomillo", "12 chalotes pelados", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida", "vinagre de jerez"], "method": ["Para hacer el puré de guisantes: cocine los guisantes en agua hirviendo con sal hasta que estén suaves. Retire del agua con una araña o una cuchara holey y revuelva en agua helada. Una vez que esté frío, retírelo del agua y deje que los guisantes drene un poco.", "Coloque 400 g / 14 oz de los guisantes en un procesador de alimentos y mezcle con un puré. Pasar el puré por un colador para quitar las cáscaras externas y colocar el puré en una sartén.", "Caliente y mezcle la mantequilla y sazone con sal y pimienta. En el último minuto agregue los guisantes restantes y estará listo para servir.", "Para hacer el chalote y el tocino velouté: Coloque los restos de tocino y la leche juntos en una cacerola y lleve a ebullición.", "Por separado, suda las chalotas con mantequilla y una pizca de sal, no colorear. Agregue el tomillo y la hoja de laurel y continúe sudando por otros 2 minutos.", "Agregue el caldo de pescado, la crema y la leche infundida con los aderezos de tocino. Llevar a ebullición y cocinar lentamente durante 20 minutos.", "Retire los restos de tocino, el tomillo y la hoja de laurel y vierta el líquido y los chalotes en la licuadora y mezcle hasta que quede muy suave, luego pase a través de un chino.", "Sazone con sal y pimienta, agregue un poco de mantequilla y use una batidora de mano para crear un efecto cappuccino y sirva.", "Para hacer los chalotes asados: asegúrese de que estén pelados hasta un tamaño parejo y que no corte la raíz. Colóquelos en una cacerola y cúbralos con agua, agregue una pizca de sal para hacerlos girar y deje que hiervan.", "Cocine durante aproximadamente 5 minutos, luego pase las chalotas del líquido de cocción y revuelva bajo el chorro de agua fría.", "Agregue la mantequilla a una sartén, caliente lentamente y agregue las chalotas, sazone con sal y pimienta y coloree lentamente las chalotas.", "Coloque en un horno precalentado a 180 ° C / 350 ° F / Gas 4 durante 5 minutos, luego gírelos y continúe cocinando hasta que estén dorados y suaves.", "Desglasar la sartén con un chorro de vinagre y escurrir en un colador para eliminar el exceso de grasa. Reserve para uso posterior.", "Para hacer el bacalao frito: sazone con sal y pimienta en ambos lados. Usando una sartén antiadherente, caliente con un poco de aceite de oliva y coloque el bacalao en el aceite caliente, con la piel hacia arriba.", "Coloque en un horno precalentado a 200C / 400F / Gas 6 por 2 minutos y luego dé la vuelta y continúe cocinando por otros 3 a 4 minutos, teniendo cuidado de no cocinar en exceso.", "Retire del horno y exprima el jugo de limón sobre el pescado. En el medio de cada plato, coloque una cucharada de puré de guisantes y vista tres chalotes alrededor. Usando una rebanada de pescado coloque el bacalao encima del puré de guisantes y luego caliente y espuma la salsa con una batidora y espolvoree alrededor del pescado."], "url": "www_bbc_co_uk_food_recipes_panfriedcodonabedofp_13152", "title": "Bacalao frito en una cama de puré de guisantes con tocino ahumado y salsa de crema de chalota", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 x 150 g / 5½ oz de filete de bacalao, la piel dejada en", "sal y pimienta negra recién molida", "1 tomate en rodajas", "100g / 3½ oz de queso cheddar maduro, rallado", "75ml / 2½fl oz de vino blanco", "2 lonchas de tocino rayado ahumado, fritas hasta que estén crujientes, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el bacalao frito, caliente el aceite de oliva en una sartén para horno. Sazonar el bacalao con sal y pimienta negra recién molida y freír, con la piel hacia abajo, durante 2-3 minutos, o hasta que la piel esté crujiente.", "Voltee el bacalao, luego transfiera la sartén al horno y tueste durante cinco minutos, o hasta que esté cocido.", "Para el gratinado de tomate y queso, extienda las rodajas de tomate sobre la base de un plato pequeño a prueba de horno.", "Coloque el queso y el vino en una olla pequeña y caliente suavemente, revolviendo con frecuencia, hasta que se derrita y se combine bien. Vierta la mezcla de queso sobre los tomates.", "Transfiera el gratinado al horno y hornee por 8-10 minutos o hasta que se dore.", "Para servir, coloque el gratinado en un plato de servir y cubra con el bacalao y el tocino."], "url": "www_bbc_co_uk_food_recipes_panfriedcodwithtomat_86167", "title": "Bacalao frito con gratén de tomate y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 langostas de Cornualles vivas, cada 500g / 1lb 2oz", "aceite de oliva, para freír las verduras", "12 zanahorias bebé", "12 bombillas de hinojo bebé", "12 puerros tiernos", "12 puntas de espárragos", "4 hojas pequeñas de col de primavera", "50g / 2oz de habas sin cáscara", "50g / 2oz de guisantes sin cáscara", "estragón picado", "recogido estragón, perifollo y cebollín, para adornar", "500ml / 17fl oz de aceite de oliva virgen extra", "50ml / 2fl oz de coñac", "100 g / 3½ oz de zanahorias, finamente picadas", "100 g / 3½ oz de cebolla, finamente picada", "100g / 3½ oz de hinojo, finamente picado", "½ diente de ajo, picado", "algunos granos de pimienta blanca enteros", "algunas semillas de cilantro, aplastadas", "algunas semillas de comino, aplastadas", "unas pocas vainas de cardamomo, aplastadas", "pellizcar hilos de azafrán", "1 estrella de anís, aplastado", "1 hoja de laurel", "5 ramitas de tomillo", "30g / 1oz de puré de tomate", "250 g / 9 oz de tomates frescos, picados", "sal y pimienta negra recién molida", "100g / 3½oz de mantequilla sin sal", "un poco de jugo de limón"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mata a las langostas colocándolas primero en el congelador durante media hora, luego perfora cada una entre los ojos con un cuchillo afilado. Quita las garras y separa la cola del cuerpo y la sección de la cabeza.", "Coloque las colas en agua hirviendo y cocine durante 30 segundos solamente, luego colóquelas en agua helada. Haga que el agua vuelva a hervir y agregue las pinzas de la langosta. Cuando hierva de nuevo, cocine por tres minutos. Coloque en el agua helada.", "Retire la carne de las colas de langosta en una sola pieza. Rompe las garras para quitar la carne, manteniéndola lo más completa posible. Coloque la carne de langosta en una bandeja para un uso posterior.", "Luego haga la sopa usando los cuerpos de la langosta. Vierta 400ml / 14fl oz del aceite de oliva en una bandeja de asar y coloque en el horno para calentar, luego agregue las canales de langosta. Asar durante 30 minutos (no dejes que las conchas se quemen). Retirar del horno y desglasar con el Cognac en la placa.", "Mientras tanto, sudar las zanahorias, las cebollas, el hinojo y el ajo en el aceite de oliva restante en una cacerola durante 10 minutos sin colorear. Agregue las especias y las hierbas y sude por otros cinco minutos. A continuación, agregue el puré de tomate, los tomates frescos y 200 ml / 7 fl oz de agua, y cocine durante 10 minutos.", "Agregue las carcasas de langosta asada y los jugos de la bandeja, incluyendo todo el aceite. Vierta suficiente agua casi para cubrir los restos de la langosta y deje hervir. Cocine a fuego lento durante 20 minutos.", "Vierta en un colador colocado en un recipiente y deje escurrir bien, luego pase el líquido resultante a través de un colador fino. Pruebe y ajuste el condimento. Vierta 200ml / 7fl oz de la sopa en una olla con la mantequilla y déjela a un lado, lista para recalentar.", "Cocine las zanahorias, el hinojo, los puerros y las puntas de los espárragos en agua hirviendo con sal o en un vaporizador; drenar y refrescar Pele las habas para quitar las pieles duras. Dejar de lado.", "Caliente un poco de aceite de oliva en dos sartenes antiadherentes (una para las colas de langosta y la otra para la carne de garra). Con cuidado agregue la langosta, luego colóquela en el horno para calentar durante dos minutos. Voltee la carne de langosta, agregue un poco de estragón picado y caliente por otros dos minutos.", "Mientras tanto, caliente la sopa de langosta. Recalentar las verduras en un vaporizador.", "Rebane cada cola de la langosta en seis pedazos y coloque alrededor de cuencos o platos tibios. Coloque la carne de la garra en el medio y esparza las verduras alrededor.", "Esponja la sopa usando una batidora y sazone con sal y pimienta negra recién molida y una gota de jugo de limón. Cuchara alrededor del plato. Rocíe un poco del aceite de cocina de las langostas y espolvoree sobre las hierbas para adornar."], "url": "www_bbc_co_uk_food_recipes_panfriedcornishlobst_81702", "title": "Langosta de Cornualles fritos con verduras y hierbas de verano joven en una sopa de azafrán", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tomates de ciruela en rodajas", "1 cucharada de curry en polvo", "1 cucharada de harina normal", "2 cucharadas de aceite de oliva", "200ml / 7fl oz de yogur al estilo griego", "4 cucharadas de menta fresca picada", "2 cucharadas de cilantro fresco picado"], "method": ["Para los tomates, coloque los tomates cortados en rodajas en un tazón y espolvoree sobre el polvo de curry y la harina.", "Calentar el aceite en una sartén a fuego medio y freír los tomates hasta que estén ligeramente dorados en ambos lados. Retire los tomates de la sartén y escurra sobre papel de cocina mientras prepara la raita.", "Para la raita, mezcle el yogur con las hierbas picadas en un tazón pequeño.", "Para servir, coloque los tomates en un plato con el tazón de raita al lado."], "url": "www_bbc_co_uk_food_recipes_panfriedcurriedtomat_87208", "title": "Tomates al curry fritos con menta raita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 porciones de filete de bacalao grueso", "aceite de oliva", "sal y pimienta negra recién molida", "8 rebanadas de panceta a la parrilla, crujiente", "200 g / 7 oz de coliflor y puré de patatas", "4 tiras delgadas de batata, fritas", "15g / ½ oz de mantequilla", "50g / 2oz de panceta, cortada en cubitos", "1 cebolla pequeña, finamente picada", "2 dientes de ajo, aplastados", "2 cucharadas de crema de rábano picante", "pizca de vino blanco", "Crema doble 150ml / 6fl oz", "350g / 12oz de guisantes congelados", "pizca de azúcar en polvo", "50ml / 2fl oz de caldo de pollo reducido", "sal y pimienta negra recién molida"], "method": ["Para hacer la salsa, primero saltee la panceta en dados hasta que quede crujiente, luego agregue la cebolla y el ajo y ablande sin dejar que se coloreen.", "Agregue el rábano picante y el vino y cocine a fuego lento, luego agregue el caldo reducido y la crema.", "Agregue los guisantes y el azúcar. Revuelva y sazone.", "Cocine a fuego lento durante unos minutos.", "Cepille los filetes de bacalao con aceite de oliva, sazone y fríe hasta que se doren, luego termine en el horno para cocinar.", "Coloque la coliflor y el puré de papa en el centro del plato y cubra con bacalao, panceta y patatas dulces. Vierta la salsa para servir."], "url": "www_bbc_co_uk_food_recipes_panfriedcodwithpeasa_73309", "title": "Bacalao frito con guisantes y panceta y patatas dulces", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas grandes, piel perforada varias veces con un pincho, cortada por la mitad a lo largo", "4 pechos de pato, piel sobre", "3-4 cucharadas de astillas de madera, para fumar las berenjenas", "75g / 3oz de mantequilla", "½ limón, solo jugo", "sal y pimienta negra recién molida", "500g / 1lb 2oz hojas de espinaca bebé", "2-3 cucharadas de agua"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque las mitades de berenjena en una lata de asar. Asar en el horno durante 30-45 minutos, o hasta que estén tiernos, luego dejar de lado.", "Calentar una sartén a fuego medio hasta que esté caliente. Agregue las pechugas de pato, con la piel hacia abajo, y freír durante 6-8 minutos hasta que la piel esté crujiente y la mayoría de la grasa se haya derretido (se haya procesado).", "Voltee las pechugas de pato y continúe freír en el otro lado durante 2-3 minutos, o hasta que estén cocidas a su gusto. Retire de la sartén y déjela a un lado en un plato caliente para descansar.", "Cubra un wok con tapa con una doble capa de papel de aluminio. Espolvoree las astillas de madera en el fondo del wok, luego cubra el wok con una tapa y caliente a fuego lento, hasta que las astillas de madera comiencen a humear. (PRECAUCIÓN: fumar alimentos genera una gran cantidad de humo. Cocine en un lugar bien ventilado y abra las ventanas. Abra el wok al aire libre).", "Agregue las mitades de berenjena al wok, luego vuelva a colocar rápidamente la tapa y fume durante 3-4 minutos.", "Retire las mitades de berenjena ahumada del wok al aire libre.", "Transfiera las berenjenas ahumadas a un procesador de alimentos, luego agregue 50 g / 2 oz de la mantequilla y todo el jugo de limón y mezcle hasta obtener un puré. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente la mantequilla restante en una sartén separada a fuego medio. Cuando la mantequilla esté espumosa, agregue las hojas de espinaca y fría por 1-2 minutos, revolviendo regularmente.", "Agregue el agua y continúe cocinando por 1-2 minutos, o hasta que la espinaca se haya marchitado.", "Para servir, esculpe los pechugas de pato en rodajas finas. Coloque una pechuga de pato en rodajas en cada uno de los cuatro platos de servir. Cuchara un poco del puré de berenjena ahumada y las espinacas salteadas al lado."], "url": "www_bbc_co_uk_food_recipes_panfriedduckbreastwi_92114", "title": "Pechuga de pato frita con puré de berenjena ahumada y espinacas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]