[{"ingredients": ["225 g / 8 oz de azúcar en polvo", "150ml / 5fl oz de leche entera", "300 ml / 10 fl oz doble crema", "½-1 cucharada de puntas de lavanda secas (al gusto)", "4 huevos de gallinas camperas, ligeramente golpeados", "175g / 6oz de mantequilla sin sal, ablandada, más extra para engrasar", "100g / 3½oz de azúcar glasé", "½-1 cucharada de puntas de lavanda secas (al gusto)", "100 g / 3½ oz de harina de maíz", "Harina normal de 200g / 7oz", "2 cucharadas de azúcar en polvo (opcional)"], "method": ["Coloque seis moldes (7.5 cm / 3 pulgadas de ancho y 4 cm / 1½ pulgadas de profundidad) en una bandeja de tostado profunda. Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Ponga 150 g / 5½ oz de azúcar en polvo en una olla limpia de base pesada y caliente a fuego alto sin remover hasta que el azúcar se derrita y se forme un caramelo dorado. Si necesita mover la mezcla para evitar que se queme, agite la sartén de vez en cuando en lugar de remover. (Precaución: el azúcar derretido está muy caliente. Tenga cuidado al cocinar con él).", "Retire la sartén del fuego y agregue cuidadosamente dos cucharadas de agua recién hervida al caramelo; escupirá y salpicarán un poco, por lo tanto, mantenga la cara a una distancia segura de la sartén. Agite la sartén hasta que el azúcar y el agua se hayan combinado para formar un caramelo más rápido, luego vierta un poco en el fondo de cada molde, inclínelos hacia un lado y hacia otro hasta que el caramelo haya cubierto uniformemente la base y los lados. Dejar de lado.", "Caliente la leche, la crema y la lavanda en una cacerola aparte a fuego lento hasta que hierva a fuego lento.", "Mientras tanto, bata los huevos y el resto de 75g / 2¾oz de azúcar en un bol hasta que estén pálidos y esponjosos.", "Vierta la mezcla de leche caliente sobre la mezcla de huevo, batiendo continuamente hasta que quede suave. Cuele la mezcla en una jarra a través de un tamiz fino, luego vierta la mezcla colada en los moldes.", "Agregue suficiente agua hirviendo a la bandeja de asar para llegar a dos tercios de los lados de los moldes. Con cuidado, transfiera la bandeja de tostado al horno y hornee los caramelos de crema durante 40-45 minutos, o hasta que estén listos. Retire del horno y deje a un lado en la bandeja de asar hasta que se enfríe a temperatura ambiente.", "Cuando los moldes estén lo suficientemente fríos como para manipularlos, retírelos de la bandeja de asar y enfríelos en la nevera durante al menos una hora.", "Para las galletas de mantequilla, aumente la temperatura del horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase una lata de hornear de 30x20 cm / 12x8 pulgadas con mantequilla.", "Batir la mantequilla y el azúcar glas en un bol hasta que estén suaves y esponjosos, con un batidor eléctrico. Doble la lavanda, harina de maíz y harina hasta que la mezcla se una como una masa firme.", "Presione la masa en la lata de hornear preparada con la punta de los dedos para formar una capa uniforme de masa de aproximadamente 1 cm / ½ pulgada de espesor. Pinche la masa con un tenedor y espolvoree con azúcar en polvo, si lo usa.", "Hornee los bizcochos en el horno durante 12-15 minutos, o hasta que estén pálidos dorados y cocidos. Dejar de lado para enfriar en la lata por un tiempo, luego romper en pedazos.", "Para servir, quite los caramelos de crema de los moldes pasando un cuchillo por el interior de cada uno, luego presione suavemente el cuchillo hacia un lado de los caramelos de crema e invierta los moldes en platos para servir vueltos hacia arriba. Sirva con trozos de shortbread al lado."], "url": "www_bbc_co_uk_food_recipes_lavender_crme_caramel_96589", "title": "Caramelo de crema de lavanda con shortbread de lavanda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavender_crme_caramel_96589_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar en polvo de lavanda 125g / 4½ oz, más extra para rociar (ver la punta de la receta superior a continuación)", "225 g / 8oz de mantequilla sin sal, ablandada", "300g / 10½ oz de harina natural, más extra para espolvorear", "50g / 1¾oz de arroz molido"], "method": ["Alinee dos bandejas grandes para hornear con papel de hornear.", "Tamiza el azúcar en un tazón y reserva la lavanda (esto evita que las semillas de lavanda se rompan al untar la mantequilla y el azúcar). Agregue la mantequilla y unte el azúcar y la mantequilla.", "Tamizar la harina y el arroz molido en la mezcla, agregar las semillas de lavanda reservadas y mezclar con una cuchara de madera hasta que la mezcla se asemeje a pan rallado.", "Con las manos enharinadas, trabaje la mezcla para formar una pasta suave.", "Incline sobre una superficie de trabajo ligeramente enharinada y amase suavemente hasta que la masa esté suave. Enfríe la masa en la nevera durante 15 minutos.", "Haga rodar la masa hasta un grosor de 5 mm / ¼ pulgadas y corte los bizcochos con un cortador en forma de corazón. Coloque los corazones en las bandejas para hornear y espolvoree con un poco de azúcar extra de lavanda.", "Dejar enfriar durante 30 minutos más en la nevera.", "Mientras tanto, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Hornee por 15-20 minutos, o hasta que estén pálidas doradas. Coloque con cuidado los bizcochos en una rejilla para enfriar, espolvoree con azúcar extra de lavanda y deje enfriar por completo."], "url": "www_bbc_co_uk_food_recipes_lavender_shortbread_43952", "title": "Corazones de lavanda shortbread", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavender_shortbread_43952_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "600ml / 1pint 1fl oz de leche entera descremada", "2 cucharaditas de flores de lavanda, desmenuzadas", "600 ml / 1 pizca de crema doble a 1 fl oz", "250 g / 9 oz de chocolate blanco, más o menos picados", "175 g / 6 oz de chocolate negro (al menos un 70% de sólidos de cacao)", "110g / 4oz de mantequilla ablandada", "40 g / 1½ oz de almendras molidas", "2 huevos grandes de gallinas camperas, separados", "40 g / 1½ oz de harina de maíz", "90 g / 3½ oz de azúcar en polvo", "4 trufas de chocolate negro de buena calidad", "cacao en polvo, para quitar el polvo"], "method": ["Para el helado, coloque las yemas de huevo y el azúcar en un tazón y mezcle hasta que estén combinados.", "Coloque la leche y la lavanda en una sartén y deje que hierva.", "Vierta la leche hirviendo en las yemas de huevo y mezcle bien, vuelva a verter en la sartén y vuelva al fuego.", "Agregue la crema y continúe cocinando hasta que la mezcla se espese, pero no deje hervir.", "Coloque el chocolate blanco en un tazón resistente al calor grande. Vierta tres cuartas partes de la mezcla de crema de lavanda a través de un colador sobre el chocolate blanco y revuelva bien. Deje que la mezcla se enfríe, luego coloque en una máquina de helados para batir al helado.", "Coloque el cuarto restante de la natilla en un recipiente limpio y transfiera a la nevera para enfriar.", "Para el fondant, precaliente el horno a 180C / 355F / Gas 4.", "Ralla 40g / 1½ oz del chocolate negro en un tazón y déjalo a un lado.", "Derretir la mitad de la mantequilla y cepillar liberalmente alrededor de los cuatro moldes. Espolvoree bien los moldes con el chocolate rallado, sacuda el exceso, colóquelos en una bandeja para hornear y déjelos a un lado.", "Coloque el chocolate restante, incluido cualquier exceso agitado, y la mantequilla restante en un recipiente resistente al calor y coloque sobre una fuente de agua apenas a fuego lento para que se derrita.", "Agregue las almendras molidas, las yemas de huevo y la harina de maíz al chocolate derretido y mezcle bien.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Poco a poco agregue el azúcar en polvo, batiendo constantemente.", "Doble suavemente la mezcla de clara de huevo en la mezcla de chocolate derretida, teniendo cuidado de retener el volumen en los blancos.", "Con una cuchara, coloque la mitad de la mezcla de chocolate y huevo en la base de cada ramekin preparado. Coloque una trufa de chocolate en la parte superior, luego llene cada molde con la mezcla restante.", "Alise las partes superiores de los fondants con una espátula, luego transfiéralos al horno para hornear durante 10-15 minutos, hasta que se levanten (la superficie debe temblar levemente), luego retírelos del horno y sirva inmediatamente.", "Para servir, cuela la mezcla de natilla reservada y fría y coloca una cucharada en el centro de cada una de las cuatro placas. Apague los fondants de chocolate y colóquelos en el centro de la salsa. Espolvorea la parte superior del fondant con el cacao en polvo y coloca una cucharada de helado de lavanda al lado."], "url": "www_bbc_co_uk_food_recipes_lavenderandwhitechoc_85602", "title": "Helado de chocolate blanco y lavanda con crema de lavanda y fondant de chocolate caliente", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3-4 tallos frescos de lavanda sin pulverizar, solo flores", "2 claras de huevo grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "1-2 gotas de colorante rojo para alimentos, mezclado con 1-2 gotas de colorante azul para alimentos (opcional)", "150ml / 5fl oz de crema doble", "½ cucharada de azúcar glas"], "method": ["Precaliente el horno a 130C / 250F / Gas ½. Alinee una bandeja grande para hornear con papel de hornear.", "Moler las flores de lavanda en un mortero y una maja durante 1-2 minutos, o hasta que estén fragantes.", "En un tazón grande, bata las claras de huevo con un batidor eléctrico hasta que se formen picos rígidos cuando se quite el batidor.", "Poco a poco mezcle el azúcar en polvo, una cucharada a la vez, hasta que todo el azúcar en polvo se haya incorporado a la mezcla y la mezcla esté espesa y brillante.", "Espolvoree una cucharada de flores de lavanda molida sobre la mezcla de clara de huevo y bata hasta que se combinen.", "Sumerja una barra de cóctel en la mezcla de colorante de alimentos y sacuda una gota de colorante en la mezcla de clara de huevo. Batir bien, agregando más colorante de alimentos hasta que las claras de huevo tengan un color uniforme malva pálido. (Nota: es posible que no necesite toda la coloración de los alimentos).", "Coloque la mezcla de merengue en una bolsa de plástico con una boquilla grande y lisa. Pipe 32 pequeños remolinos de la mezcla de merengue en la bandeja de horno preparada.", "Transfiera los merengues al horno e inmediatamente reduzca la temperatura a 100C / 225F / Gas ¼. Hornee los merengues durante dos horas o hasta que estén crujientes, pero no coloreados. Apague el horno y deje los merengues dentro hasta que el horno esté frío. Cuando los merengues se hayan enfriado, guárdelos en una lata hermética hasta que los necesite.", "No más de 30 minutos antes de servir, vierta la crema en un tazón y tamice el azúcar glasé. Batir con un batidor eléctrico hasta que se formen picos suaves cuando se quite el batidor.", "Coloque una cucharadita de la mezcla de crema en la base de uno de los merengues de lavanda, luego coloque la crema entre un segundo merengue. Coloque en un plato grande. Repita el proceso con los merengues restantes, luego sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lavendercreammeringu_91783", "title": "Merengues de crema de lavanda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavendercreammeringu_91783_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 filetes de lomo sin hueso de cordero", "2 dientes de ajo", "2 latas de 75 g / 3oz de filetes de anchoa en aceite de oliva", "manojo de lavanda, recién elegido", "sal y pimienta negra recién molida", "2 cucharaditas de miel de lavanda (u otra miel líquida si no está disponible)", "50ml / 2fl oz / 3½ tbsp miel de lavanda (u otra miel líquida si no está disponible)", "50ml / 2fl oz / 3½ cucharadas de aceite de oliva", "450g / 1lb de papas nuevas, lavadas, pieles dejadas, cortadas en rodajas gruesas", "453g / 1lb pastinacas, lavadas, pieles dejadas, cortadas en rodajas gruesas", "453 g / 1 libra de zanahorias, lavadas, pieles dejadas, cortadas en rodajas gruesas", "225g / 8oz de cebolla roja, descuartizado", "225g / 8 oz de hinojo, en rodajas gruesas", "1 limón, cortado por la mitad", "2 ramitas de romero", "3 cucharadas de aceite de oliva", "75ml / 3fl oz de miel clara", "10 cucharadas de menta fresca, finamente picada", "pizca de sal", "azúcar pizca", "90ml / 3¼fl oz de vinagre de malta"], "method": ["Precalentar el horno a 200C / 400F / Gas 5.", "Para el cordero, use un cuchillo afilado para hacer aproximadamente 20 incisiones pequeñas, aproximadamente 2 cm (1 in) de profundidad, en cada lomo de cordero.", "Pelar los dientes de ajo y cortar en tiras finas. Inserte un trozo de ajo, medio filete de anchoa y una ramita de lavanda en cada incisión hasta que estén todos llenos.", "Coloque el cordero en una bandeja de asar, sazone con sal y pimienta negra recién molida y rocíe con la miel de lavanda. Asar en el horno durante 20-30 minutos, o hasta que se cocinen a su gusto, rociando con los jugos cada pocos minutos para mantener la carne húmeda y evitar que la miel se queme. Retire para el horno y deje reposar durante diez minutos antes de servir.", "Para el glaseado de miel de lavanda, caliente la miel en una sartén pequeña. Agregue el aceite de oliva y bata para combinar.", "Para las verduras asadas, coloque todas las verduras en una bandeja de horno con las mitades de limón y rocíe con aceite de oliva y miel. Agregue las ramitas de romero fresco y sazone bien.", "Coloque en el horno y cocine durante unos 20-40 minutos, o hasta que las verduras estén cocidas. Revuelva bien para cubrir el glaseado de miel.", "Para la salsa de menta, mezcle todos los ingredientes.", "Para servir, corte el cordero en diagonal y sirva en platos calientes con una cucharada de verduras asadas, un chorrito de glaseado de miel y una cucharada de salsa de menta."], "url": "www_bbc_co_uk_food_recipes_lavendergarlicandhon_81883", "title": "Lavanda, ajo y miel asado de lomo de cordero con salsa de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de laverbread", "4 cucharadas de avena", "2 cucharaditas de aceite de oliva", "8 lonchas finas de tocino rayado"], "method": ["En un tazón pequeño, mezcle el laverbread y la avena. Divide la mezcla en 8 pedacitos y enrolla en bolitas. Aplaste las bolas en pequeñas hamburguesas, de aproximadamente 4 cm / 1½ de diámetro.", "Caliente el aceite de oliva en una sartén grande a fuego medio. Freír el tocino hasta que esté crujiente y la grasa se haya secado. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Agregue las tortas a la sartén y fría en cada lado durante 2-3 minutos, o hasta que estén doradas.", "Sirva los pasteles de laverbread con el tocino crujiente encima."], "url": "www_bbc_co_uk_food_recipes_laverbread_cakes_82849", "title": "Pasteles de Laverbread", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas para ensaladas, finamente rebanadas", "1 diente de ajo, finamente picado", "½ chile rojo, finamente picado", "1 colinabo, pelado y cortado en cubitos", "1 cucharada de salsa de soja", "1 cucharada de aceite de sésamo", "1 cucharadita de jengibre, finamente picado", "200ml / 7fl oz de caldo de pollo, calentado (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "1 cucharada de cilantro fresco picado"], "method": ["Calentar el aceite en una olla pequeña. Freír las cebollas de ensalada con el ajo y el chile hasta que estén suaves.", "Agregue el colinabo en cubos y cocine hasta que esté suave.", "Agregue la soja, el aceite de sésamo, el jengibre y el caldo de pollo y sazone con sal y pimienta negra recién molida, al gusto. Cocine a fuego lento durante ocho minutos.", "Para servir, remueva el cilantro picado y sirva en un recipiente tibio."], "url": "www_bbc_co_uk_food_recipes_laxa_82664", "title": "Sopa de colinabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 cebollas medianas, picadas", "Setas de botón de 200g / 7oz, frotadas y rebanadas", "4 cucharadas de harina normal", "1 cucharadita de sal marina en copos", "2 cucharaditas de hierbas secas mezcladas", "Filete de cocción bien veteado 750g / 1lb 10oz, como el mandril y la cuchilla", "1 hoja de laurel", "440ml / 15½fl oz de grasa", "300ml / 10fl oz de caldo de res, hecho con 1 cubo de caldo", "2 cucharadas de puré de tomate", "2 cucharaditas de azúcar en polvo", "pimienta negra recién molida", "Harina de auto aumento 325g / 11½ oz", "150g / 5½oz de sebo triturado", "25g / 1oz de manojo de perejil fresco, tallos resistentes eliminados y hojas finamente picadas", "1 cucharadita de sal marina fina", "botón de mantequilla, para engrasar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para hacer el relleno, caliente el aceite en una cazuela grande a prueba de llamas. Freír las cebollas y los champiñones a fuego medio durante unos cinco minutos, o hasta que estén ligeramente dorados, revolviendo regularmente.", "Ponga la harina, la sal y las hierbas secas en un tazón grande. Sazonar con mucha pimienta negra recién molida y mezclar bien. Recorte la carne de cualquier grasa dura y tendones. Cortar la carne en cubos de aproximadamente 2.5cm / 1in. Mezcle la carne en la harina hasta que se cubra uniformemente por todos lados. Incline la carne y toda la harina en la sartén con las cebollas y los champiñones. Freír por 3-5 minutos.", "Agregue la hoja de laurel, la cerveza negra, el caldo, el puré de tomate y el azúcar. Remover bien y llevar a ebullición. Cubra con una tapa y transfiéralo cuidadosamente al horno. Cocine por 2 ¼ horas, o hasta que la carne esté muy tierna, revolviendo a la mitad del tiempo de cocción. Si la carne sigue siendo un poco dura, vuelva al horno y cocine por más tiempo.", "Tome cinco cucharadas (alrededor de 450 ml / 16 fl oz) de la salsa y déjelas a un lado en una cacerola pequeña para usarlas luego. (Cuando se haya enfriado, colóquelo en la nevera hasta que lo necesite). Vuelva a poner la olla en la cocina y cocine a fuego lento durante 2-3 minutos o hasta que la salsa se espese lo suficiente para que no se salga del plato cuando se corta el pudín, pero no demasiado. o el pudín tendrá un sabor seco.", "Retirar del fuego, verter en un tazón grande, desechar la hoja de laurel y dejar enfriar por completo.", "Para hacer la masa de sémola, ponga la harina en un tazón grande y mezcle el sebo, el perejil y la sal. Agregue suficiente agua para hacer una masa suave y esponjosa; probablemente necesite alrededor de 250 ml / 9 fl oz. Dale la vuelta a una superficie enharinada y junta la masa para formar una bola. Amasar ligeramente y luego usar escamas para dividir la masa en cuatro porciones de aproximadamente 100 g / 3½ oz, 150 g / 5½ oz, 200 g / 7 oz y 275 g / 9 oz.", "Unte con mantequilla un recipiente de pudín de 1.5 litros / 2½ pinta y forre la base con un pequeño disco de pergamino para hornear, esto hará que el pudín sea más fácil de quitar una vez cocinado. Estire la porción más pequeña de la masa en un disco de aproximadamente 1.5 cm / ½ pulgadas de grosor. Coloque en la base del lavabo con leche. Cubra con una capa de la mezcla de carne y champiñones. Enrolle la porción de 150 g / 5½ oz en un disco lo suficientemente grande como para cubrir la carne y presione suavemente en la parte superior, asegurándose de que llegue a los lados. Repita el mismo proceso con la masa restante y el relleno hasta que el recipiente esté cubierto con cuatro discos de masa y tres capas de carne, terminando con la capa final de masa, recortada cuidadosamente para que quepa si es necesario.", "Cubra el plato con un círculo grande de pergamino para hornear, con un pliegue en el medio para permitir la expansión. Cubra el pergamino con un círculo de papel de aluminio, de nuevo con un pliegue. Ate ambos firmemente en su lugar con una cuerda. Crea un asa de transporte atando el exceso de cuerda en la parte superior del lavabo; esto te ayudará a levantar el pudín una vez que esté cocido.", "Colóquelo en un platillo revuelto o en un pequeño salvamanteles en una cacerola grande y profunda y agregue suficiente agua recién hervida para llegar hasta la mitad de los lados del lavabo. (Alternativamente, cocine en una olla de cocción grande). Cubra la olla con una tapa ajustada y colóquela a fuego medio. Deje que hierva a fuego lento durante dos horas, agregando más agua cuando sea necesario.", "Cuando termine el pudín, apague el fuego y levante con cuidado el recipiente del agua. De pie por cinco minutos. Caliente la salsa reservada hasta que burbujee, revuelva constantemente y agregue un poco de agua extra si es necesario.", "Corta la cuerda y quita la lámina y el papel del lavabo. Afloja los lados del budín hasta el fondo con un cuchillo de punta roma y, sosteniéndolo con una tela de horno, inviértelo en un plato hondo. Despegue el disco de revestimiento. Vierta un poco de la salsa en la parte superior y luego sirva en porciones generosas con más salsa caliente."], "url": "www_bbc_co_uk_food_recipes_layered_beef_and_36022", "title": "Pudín en capas de sebo de ternera y champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 suelas enteras de limón, fileteadas, sin piel", "275ml / 9¾fl oz de crema doble", "1 coliflor, cortada por la mitad, una mitad dejada intacta, una mitad separada en pequeños floretes", "1 huevo duro de corral, pelado", "1 cucharada de cebollines frescos finamente picados", "1 cucharada de vinagre balsámico blanco", "3 cucharadas de aceite de oliva virgen extra", "8 langostinos cocidos", "sal y pimienta negra recién molida", "frondas de hinojo, para adornar (opcional)"], "method": ["Mezcle cuatro de los pedazos de lenguado de limón y todos los restos de un procesador de alimentos con 75ml / 2¾fl oz de la crema, hasta que la mezcla se reduzca a una pasta fina. Sazonar con sal y pimienta negra recién molida y pulsar una vez más hasta que quede suave, luego transferir la mezcla a una manga pastelera.", "Coloque 4 piezas de la planta del limón en hojas separadas de papel de aluminio y sazone con sal y pimienta negra recién molida.", "Pase una capa de la mezcla de pescado y crema por cada pieza de suela de limón. Cubra cada uno con otra pieza de limón y cubra con otra capa de la mezcla de pescado y crema. Termine cada uno con un tercer pedazo de suela de limón. Deberías terminar con cuatro montones de peces, cada uno con 3 rectángulos de suela de limón y 2 capas de relleno.", "Envuelva cada suela de limón en su hoja de papel de aluminio, luego enfríe en el refrigerador hasta que esté listo para cocinar.", "Mientras tanto, agregue la mitad de las flores de coliflor a una cacerola y vierta sobre la crema restante. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que las flores de coliflor estén tiernas.", "Transfiera la coliflor y la crema a un procesador de alimentos limpio y mezcle hasta obtener un puré fino. Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar de lado hasta que sea necesario.", "Poner a hervir una olla de agua con sal y cocinar los floretes de coliflor restantes durante 2-3 minutos, o hasta que estén tiernos. Escurrir bien.", "Rallar finamente la coliflor cruda restante en un bol, luego rallar sobre el huevo hervido y agregar el cebollino hasta que estén bien combinados.", "En un recipiente aparte, mezcle el vinagre balsámico blanco y el aceite de oliva juntos hasta que estén bien combinados. Dejar de lado.", "Suspenda un vapor sobre una olla de agua hirviendo a fuego lento. Agregue las únicas parcelas a la canasta humeante, tape y deje hervir durante 6-8 minutos, o hasta que estén recién cocidas. Retire del vaporizador y, cuando esté lo suficientemente frío como para manipularlo, desenvuelva y deseche cuidadosamente la lámina,", "Justo antes de servir, coloque dos tercios del aderezo sobre la ensalada de coliflor y huevo y mezcle para cubrir. Sazonar con sal y pimienta negra recién molida.", "Mezcle el aderezo restante con las florecillas de coliflor drenadas y las cigalas cocidas y revuelva suavemente para cubrir.", "Para servir, rocíe una línea de la coliflor y el puré de crema en el centro de cada plato. Coloque una pila de suela de limón en la parte superior de cada línea, en el centro. Coloque una porción de la coliflor y la mezcla de huevo en un lado, y la coliflor y la langostinos en el otro lado. Adorne con hojas de hinojo, si lo desea."], "url": "www_bbc_co_uk_food_recipes_layered_sole_with_06011", "title": "Suela acodada con langostinos y coliflor", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de harina normal", "1 huevo de gallinas camperas", "pizca de sal", "3-4 cucharadas de leche", "1 cucharada de aceite vegetal", "150ml / ¼ de vino tinto", "1 salchicha"], "method": ["Para el panqueque, mezcle la harina, el huevo, la sal y la leche en un bol para formar una mezcla suave.", "Caliente el aceite en una sartén poco profunda, luego limpie el exceso de aceite con papel de cocina.", "Vierta la cuchara en la masa y gírela para cubrir la base de la sartén.", "Freír hasta que la parte inferior del panqueque esté dorada, luego dar la vuelta y cocinar el otro lado hasta que se dore.", "Para el relleno, coloque el vino tinto en una olla pequeña y hierva para reducir el volumen del líquido a la mitad.", "Agregue la salchicha y suficiente agua para cubrir. Cocine a fuego lento durante 8-10 minutos, o hasta que la salchicha esté cocida.", "Para servir, coloca el panqueque en un plato. Coloque la mezcla de salchichas en el centro y doblar la tortita."], "url": "www_bbc_co_uk_food_recipes_layeredpancakesausag_85467", "title": "Guiso de salchichas de panqueque en capas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾ oz de azúcar en polvo", "50 g / 1¾ oz de mantequilla, cortada en cubos", "Leche 150ml / ¼ pt", "1 bolsita de 7 g de levadura seca de acción rápida", "375g / 13oz de harina blanca fuerte, más extra para espolvorear", "½ cucharadita de sal marina fina", "1 cucharadita de canela molida", "1 limón, ralladura finamente rallada", "1 huevo grande, golpeado", "125 g / 5oz de pasas o 100 g / 4 oz de pasas y 25 g / 1 oz de grosella", "aceite de girasol, para engrasar", "mantequilla y jarabe o miel, para servir"], "method": ["Pon el azúcar, la mantequilla y la leche en una olla pequeña y calienta muy suavemente durante unos segundos hasta que esté tibia. Tenga cuidado de que la leche no se caliente demasiado o que la levadura no funcione.", "Vierta la mezcla de leche en un recipiente resistente al calor y agregue la levadura. Deje actuar durante 10 minutos o hasta que se forme una espuma ligera en la superficie.", "Mezcle la harina, la sal, la canela y la ralladura de limón en un tazón grande y haga un pozo en el centro.", "Bata el huevo en la mezcla de leche tibia, luego vierta todo sobre la harina. Revuelva con una cuchara de madera hasta que la mezcla forme una bola.", "Dé vuelta la mezcla a una superficie muy ligeramente enharinada y amase durante 5 minutos para hacer una masa suave y flexible.", "Amasar la fruta en la masa durante un par de minutos hasta que esté distribuida uniformemente.", "Coloque la masa en un recipiente ligeramente engrasado y cúbrala con film transparente aceitado. Deje que se levante en un lugar cálido durante 1 hora y media, o hasta que se haya duplicado en tamaño y sea esponjoso al tacto.", "Regrese la masa a la superficie de trabajo y retírela con los nudillos. Amasar ligeramente, luego divida la masa en 8 porciones. Haz rodar cada una de estas en forma de bola, luego tira de la masa por los lados y métela por debajo del moño para darle una forma ordenada.", "Coloque los bollos en una bandeja grande para hornear forrada con pergamino para hornear y aplánelos ligeramente. Si su bandeja no es lo suficientemente grande como para tomar todos los panecillos a la vez, hornearlos en un par de lotes.", "Cubra con film transparente y deje probar durante otros 45 minutos.", "Precalienta el horno a 190 ° C / 375 F / Gas 5. Quita la película adhesiva y hornea los panecillos en el centro del horno durante unos 20 minutos hasta que estén dorados.", "Sirva caliente el día en que están hechos, muy bien esparcidos con mantequilla y rociados con jarabe o miel."], "url": "www_bbc_co_uk_food_recipes_lazybones_buns_47431", "title": "Bollos Lazybones (bulbos de Luilac)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz hecha", "jugo de limón splash", "1-2 dientes de ajo, aplastados", "100g / 3½oz de almendras en copos, tostadas", "Bolso de 120 gr. De mezcla de rúcula, espinacas y berros", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 granadas, solo semillas"], "method": ["Pon el queso Feta en un plato poco profundo, exprime el jugo de limón y espolvorea sobre el ajo. Deje marinar mientras prepara el resto de la ensalada.", "Tueste las almendras en una parrilla mediana hasta que estén ligeramente doradas, luego déjelas enfriar. Corta la granada por la mitad y saca las semillas en un recipiente golpeando la piel con una cuchara.", "Mezcle el cohete, las espinacas y el berro en una ensaladera grande con aceite de oliva, sal y pimienta recién molida. Desmenuce el feta marinado y esparza las semillas de granada y las almendras tostadas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_leafysaladwithfetaan_83561", "title": "Ensalada de hojas con queso feta y granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leafysaladwithfetaan_83561_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 4oz de fideos de huevo listos para llevar", "250 g / 10½oz de carne de cerdo magra, cortada en cubos", "1 cucharada de aceite de oliva", "1 cebolla roja, pelada y rebanada", "½ pimiento verde, núcleo y semillas eliminadas, en rodajas", "2 dientes de ajo, pelados y triturados", "½ mango, pelado, removido y picado", "1 cucharadita de jengibre recién rallado", "exprimir jugo de lima", "salpicar agua", "1 cucharadita de salsa de soja", "1 cubo de caldo de verduras", "1 cucharadita de aceite de sésamo", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta.", "Cocine los fideos de huevo de acuerdo con las instrucciones del paquete y drene.", "Coloque las piezas de cerdo en una bandeja para hornear y colóquelas debajo de una parrilla calentada. Ase a la parrilla durante unos 10 minutos, volteándolos de vez en cuando para dorar por todas partes, hasta que estén cocidos.", "Calentar el aceite de oliva en un wok a fuego alto. Agregue la cebolla y saltee por unos minutos para ablandar.", "Agregue el pimiento verde, el ajo, el mango y el jengibre al wok y saltee por unos minutos.", "Agregue el jugo de lima, salpicaduras de agua y salsa de soja. Revuelva bien y desmorone en el cubo común. 7. Agregue el aceite de sésamo y la sal y pimienta negra recién molida y continúe calentando durante unos minutos.", "Agregue los fideos cocidos a la sartén y cocínelos durante 1-2 minutos, o hasta que estén bien calientes.", "Agregue las piezas cocidas de cerdo a la sartén, revuelva de nuevo, luego transfiera los fideos a un tazón grande y sírvalos calientes."], "url": "www_bbc_co_uk_food_recipes_leanporkstirfry_83698", "title": "Magro de cerdo magra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz tipo '00' harina, más extra para espolvorear", "Harina de sémola 100 g / 3½ oz", "½ cucharadita de sal", "1½ cucharadita de azúcar en polvo", "7 g de levadura de acción rápida", "325ml / 11fl oz de agua tibia", "1 cucharada de aceite vegetal", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "1 cucharada de mezcla de especias baharat molidas", "500g / 1lb 2oz de carne de cordero", "75g / 2½oz sultanas", "300ml / 10½fl oz de caldo de pollo", "250 ml / 9 fl oz oz yogur", "2 chiles verdes, finamente picados", "sal y pimienta negra recién molida", "4 ramitas de menta fresca, solo hojas", "16 ramitas de cilantro, solo hojas"], "method": ["Para la masa, el día antes de que quiera comer los panes planos, mezcle las harinas, la sal y el azúcar en un tazón grande.", "En una jarra, mezcle la levadura en una pasta con un poco de agua, luego agregue el agua restante hasta que la levadura se haya disuelto por completo.", "Haga un pozo en el centro de la mezcla de harina y vierta el agua con levadura, gradualmente agregue más y más de la harina a la mezcla húmeda, hasta que toda la harina se haya incorporado y la mezcla se haya unido como una masa blanda.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amasar bien hasta que quede suave y elástica.", "Divida la masa en cuatro pedazos de igual tamaño y enrolle cada uno en una bola. Coloque las bolas de masa en una bandeja para hornear ligeramente engrasada, cúbralas con una lámina suelta de película adhesiva o una toalla de té limpia, y déjelas en la nevera durante 24 horas.", "Cuando la masa ha demostrado (duplicado en tamaño), haga la cobertura.", "Para el relleno, caliente el aceite en una sartén a fuego medio. Agregue la chalota, el ajo y las especias y fría por 1-2 minutos, o hasta que estén blandos.", "Agregue el cordero picado y aumentar el fuego a alta. Freír durante 4-5 minutos, rompiendo la carne picada con una cuchara y revolviendo con frecuencia, hasta que se dore por todas partes.", "Agregue las pasas sultanas y el caldo de pollo a la sartén y lleve la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 18-20 minutos, o hasta que el cordero esté tierno y el líquido se haya evaporado casi por completo. Sazone al gusto, con sal y pimienta negra recién molida, luego retire la sartén del fuego y déjela enfriar por completo.", "Precalentar el horno a su configuración más alta. Coloque una bandeja para hornear pesada o piedra para pizza en el horno y deje que se caliente.", "Haga rodar cada pieza de masa sobre una superficie de trabajo ligeramente enharinada en un óvalo de aproximadamente 20x15 cm / 8x6 pulgadas y alrededor de 0.5 cm / ¼ pulgadas de espesor.", "Extienda la mezcla de cordero en las bases de la masa, luego cubra con las cucharadas del yogur. Espolvorear sobre los chiles picados y sazonar, al gusto, con sal y pimienta negra recién molida.", "Transfiera los panes planos, en lotes si es necesario, a la bandeja para hornear o a la piedra para pizza y cocine durante 5-10 minutos, o hasta que las bases estén doradas y crujientes. Retire del sobre y espolvoree sobre las hierbas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lebanese-spiced_lamb_56436", "title": "Pan plano de cordero con especias libanesas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese-spiced_lamb_56436_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla", "500 g / 1 lb 2 oz puerros, en rodajas y lavado", "3 ramitas de tomillo fresco, hojas recogidas", "150ml / 5fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "Pan brioche de 75 g / 2¾oz, cortado en cubos de 1cm / ½ en", "50g / 1¾oz Gruyère, finamente rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Calienta 50 g / 1¾ oz de la mantequilla en una sartén y freír los puerros y el tomillo durante 2-3 minutos, o hasta que estén blandos.", "Agregue el vino y cocine hasta que el volumen del líquido se haya reducido en dos tercios. Agregue la crema y reduzca nuevamente a la mitad. Sazonar con sal y pimienta y verter en un plato refractario.", "Calentar una sartén por separado hasta que esté caliente. Agregue la mantequilla restante y el brioche. Cocine hasta que se dore por todos lados. Sazonar con sal y pimienta y esparcir sobre la parte superior de los puerros.", "Espolvoree el queso en la parte superior del plato y cocine en el horno durante 20-30 minutos, o hasta que estén dorados y burbujeantes."], "url": "www_bbc_co_uk_food_recipes_leek_and_brioche_bake_21766", "title": "Puerro y brioche hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos", "500 g / 1 libra de puerros de 2 oz, lavados", "5 cucharadas de aceite de oliva", "Setas de 250 g / 9 onzas (como tapa cerrada blanca), limpias y en rodajas", "sal y pimienta", "1 diente de ajo, finamente picado", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza", "1 baguette pequeño (etiquetado 'bastón' en las tiendas), cortado en rodajas"], "method": ["Coloque los huevos en una olla con agua hirviendo. Hervir durante ocho minutos exactamente, luego drenar y enfriar con agua corriente fría. Pele los huevos y déjelos a un lado.", "Corta las copas de los puerros y luego corta dos tercios del camino hacia abajo. Deseche cualquiera de las hojas exteriores gruesas de los dos tercios superiores, corte por la mitad longitudinalmente y horizontalmente y separe los tallos verdes internos en tiras.", "Cortar la parte inferior blanca del puerro en rondas. Cocine al vapor las tiras redondas blancas y verdes en un recipiente de vapor colocado sobre agua hirviendo con sal durante cuatro minutos, o hasta que estén tiernas.", "Ejecuta los puerros bajo agua fría para enfriar. Extráigalos si están completamente acuosos.", "Mientras tanto, caliente una sartén pequeña y agregue una cucharada de aceite. Una vez caliente, agregue los champiñones rebanados a la sartén con una pizca de sal. Cocine a fuego medio durante 4-5 minutos, o hasta que estén tiernos y ligeramente dorados. Agregue el ajo y fría por otro minuto.", "Batir el aceite de oliva restante junto con el vinagre y la mostaza en un tazón pequeño para hacer un aderezo. Pruebe y sazone según sea necesario. Corta los huevos pelados en trozos. Coloque los puerros refrigerados en un recipiente y cúbralos con los huevos. Condimentar con sal y pimienta", "Viste el huevo y el puerro con el aderezo. Pruebe y ajuste el condimento si es necesario. Sirve con los champiñones y la baguette."], "url": "www_bbc_co_uk_food_recipes_leek_and_egg_salad_14872", "title": "Ensalada de puerros y huevos, champiñones y pan crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "125 g / 4½ oz de mantequilla", "1 huevo de gallinas camperas", "1 cucharada de agua", "1 cucharada de aceite de oliva", "2 puerros, en rodajas finas", "2 palitos de apio, en rodajas finas", "4 huevos de gallinas camperas", "Crema doble 450ml / 16fl oz", "150g / 5½oz de queso Stilton, rallado grueso", "2 cucharadas de perejil picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180 Fan / Gas 6.", "Para hacer la masa, mida la harina y la mantequilla en un procesador de alimentos y mezcle hasta que la mezcla se asemeje a pan rallado. Agregue el huevo y el agua y vuelva a mezclar hasta que forme una bola suave. Ruede sobre una superficie de trabajo ligeramente enharinada y use la masa para forrar una lata profunda de quiche de 28cm / 11 pulgadas. Forme un pequeño labio alrededor de la parte superior y pinche la base con un tenedor. Coloque en la nevera por 15 minutos.", "Línea con papel de hornear y hornear frijoles y hornear durante 15 minutos. Retire los frijoles y el papel y vuelva al horno durante otros 5-10 minutos, o hasta que esté recién cocido y dorado. Reduzca la temperatura del horno a 180 ° C / 160 Ventilador / Gas 4.", "Para hacer el relleno, caliente el aceite en una sartén de base ancha, agregue los puerros y el apio y fría a fuego alto durante unos minutos.", "Baje el fuego, cubra y cocine a fuego lento durante unos 25 minutos, o hasta que las verduras estén completamente tiernas. Retire la tapa, aumente el fuego y fría por un minuto para cocinar el exceso de agua.", "Batir los huevos y la crema juntos en una jarra y sazonar con sal y pimienta.", "Coloque los puerros y el apio en la caja de los pasteles, espolvoréese con queso y perejil y sazone con sal y pimienta. Vierta sobre la crema.", "Hornea durante aproximadamente 35-40 minutos, o hasta que estén doradas y simplemente en la parte superior. Deje reposar de 5 a 10 minutos antes de apagarlo."], "url": "www_bbc_co_uk_food_recipes_leek_and_stilton_quiche_08524", "title": "Queso de puerro y stilton", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_and_stilton_quiche_08524_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 zanahoria, rallada", "1 cebolla rallada", "2 palitos de apio, rallados", "2 dientes de ajo, picados", "sal y pimienta", "tallos de un pequeño manojo de perejil", "aceite de oliva", "1 cebolla, finamente picada", "200g / 7oz de papas harinosas, peladas y picadas en cubos", "Apionabo 350g / 12oz, pelado y picado", "1 ramita de tomillo, solo hojas", "4 puerros, en rodajas finas", "sal marina y pimienta negra recién molida", "1 cebollín pequeño, finamente picado"], "method": ["Para hacer el caldo, coloca la zanahoria rallada, la cebolla, el apio y el ajo en un tazón grande y resistente al calor. Agregue una pizca de sal y pimienta y vierta más de 1 litro / 1¾ pintas de agua hirviendo. Déjalo reposar durante 10-15 minutos mientras preparas la sopa.", "Caliente una cacerola grande o una cacerola a fuego medio a fuego medio. Agregue una pizca de aceite y, una vez caliente, agregue la cebolla, las papas, el apio nabo y las hojas de tomillo. Cocine a fuego medio durante 10 minutos, o hasta que las verduras se hayan suavizado.", "Cuele el caldo a través de un colador en la sartén del apionabo. Cocine a fuego lento durante 10-15 minutos hasta que el apionabo esté casi blanda.", "Agregue los puerros, cubra la sartén y cocine por otros 5-7 minutos, o hasta que los puerros estén marchitos y tiernos, pero aún de color verde brillante.", "Retirar del fuego y mezclar en lotes hasta que esté realmente suave. (Mezcle por un minuto o más para obtener una textura realmente aterciopelada). La sopa puede almacenarse en el refrigerador o congelarse en esta etapa.", "Transfiera la sopa mezclada a una sartén limpia. Vuelva a calentar la sopa si es necesario, pruebe y sazone con sal y pimienta al gusto. Para servir, espárzalos en tazones y adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_leek_soup_66968", "title": "Sopa de puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_soup_66968_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 puerro, finamente cortado", "1 diente de ajo, finamente picado", "100ml / 3½fl oz de vino blanco", "150ml / ¼ pinta de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "75ml / 2½ fl oz crema doble", "1 cucharada de alcaparras, enjuagadas y escurridas", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas, para adornar"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio, agregar el puerro y saltear hasta que se ablande. Agregue el ajo y fría por un minuto.", "Agregue el vino blanco, suba el fuego y cocine a fuego lento durante 2-3 minutos.", "Agregue el caldo, la crema doble y las alcaparras y cocine a fuego lento durante 3-4 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en un recipiente para servir y adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_leekandcapersoup_85786", "title": "Sopa de puerros y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite vegetal, más extra para engrasar", "285g / 10¼ oz de harina común, más extra para espolvorear", "pizca de sal", "½ cucharadita de pimentón ahumado caliente", "1 huevo mediano de gallinas camperas", "100 g / 3½ oz de mantequilla", "Papas de 450g / 1lb, peladas y cortadas en cubitos", "aceite de oliva para freír", "1 cebolla mediana, finamente picada", "3 puerros, lavados y finamente picados", "¾ cucharadita de cúrcuma molida", "1 chile grande, finamente picado", "1 cucharadita de harissa", "50 g / 1¾oz pistachos enteros", "75ml / 5 cucharadas de azotes o crema doble", "100 g / 3½ oz de Gruyère, rallado", "50g / 1¾oz de pan rallado (aproximadamente dos rebanadas de pan)", "1½ cucharadita de sal marina", "pimienta negra recién molida", "1 cucharadita de pimentón ahumado caliente", "1 cucharada de semillas de nigella (disponible en grandes supermercados)", "gran cilantro fresco puñado", "75ml / 2½fl oz de aceite de oliva", "100g / 3½oz de tomates cherry en la vid", "gran cohete fresco", "1 cabeza de radicchio, recortada"], "method": ["Para la masa de filo, engrasar ligeramente un tazón grande. Tamiza la harina, el pimentón y la sal en un recipiente limpio y haz un pozo en el centro. Agregue el huevo y el aceite y revuelva gradualmente en 150 ml / 5 fl oz de agua, o lo suficiente como para hacer una masa suave.", "Enharinar ligeramente la superficie de trabajo, extender la masa y amasar durante 15 minutos (esta masa se amasa mejor tirando de ella hacia arriba y arrojándola hacia abajo; no la deje en contacto con el mostrador durante demasiado tiempo o se pegará) ) La masa está lista cuando pierde su pegajosidad y es lo suficientemente elástica como para estirarse aproximadamente 50 cm. Coloque la masa en el recipiente engrasado, cúbralo con una película adhesiva y déjelo reposar durante una hora.", "Para el relleno de puerros y papas, cocine las papas en cubos al vapor durante aproximadamente cinco minutos, o hasta que estén cocidas, pero aún mantengan su forma. Retirar del fuego y reservar para enfriar.", "En una sartén, cocine la cebolla y el puerro en un poco de aceite de oliva hasta que estén blandos y las cebollas estén translúcidas. Agregue la cúrcuma, el chile, la harissa, las papas, los pistachos y la crema a la sartén. Retire del fuego, agregue el queso y las migas de pan, y sazone al gusto con sal y pimienta negra recién molida.", "Precaliente el horno a 200C / 400F / Gas 6, forre una bandeja para hornear con papel pergamino y cubra la superficie de trabajo con un mantel generosamente espolvoreado con harina.", "Derrita la mantequilla y use un rodillo para extender la masa a un grosor de 1cm / ½ pulgada. Estire la masa con la mano teniendo cuidado de no romperla, tire de la masa con cuidado pasando las manos por debajo de la masa desde el centro hacia afuera. La masa terminada debe ser muy delgada, lo suficientemente transparente como para leer y al menos 50 cm de ancho.", "Recorte los bordes de la masa con unas tijeras para hacer un rectángulo ordenado y luego esparza la masa libremente con la mantequilla derretida de un pincel de pastelería.", "Coloque el relleno enfriado en uno de los extremos estrechos de la masa y, utilizando el mantel para ayudar, enrolle suavemente el strudel. Dobla los bordes de la pastelería debajo del strudel y colócalos en la bandeja para hornear forrada. Curve en forma de herradura si es demasiado grande para la bandeja.", "Espolvoree con mantequilla derretida y esparza sobre el pimentón y las semillas de nigella. Hornee en el estante superior del horno durante 30-40 minutos o hasta que estén doradas.", "Para servir, mezcle el cilantro con 50 ml de aceite de oliva calentado en un procesador de alimentos. Transfiera el strudel a un plato de servir. Coloque los tomates cherry en una bandeja para hornear y cepille con aceite. Use un soplete para carbonizar la piel del tomate y luego coloque alrededor del strudel con el cohete, la achicoria y la mezcla de aceite de cilantro."], "url": "www_bbc_co_uk_food_recipes_leek_and_potato_strudel_70345", "title": "Strudel de puerros y patatas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]