[{"ingredients": ["4 pechugas de pollo, desolladas, deshuesadas y en cubos", "2.5cm / 1 en pieza de jengibre fresco de raíz, finamente picado", "2 dientes de ajo, finamente picados", "1 cucharadita de chile en polvo", "sal marina y pimienta negra recién molida", "2 cucharadas de cilantro fresco picado, más extra para decorar", "1 lima, solo jugo", "2 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "1 chile rojo, sin semillas y finamente picado", "1 cucharadita de cúrcuma molida", "Crema doble de 200 ml / 7 fl oz", "½ limón", "arroz basmati, cocinado según las instrucciones del paquete", "pan naan"], "method": ["Coloque las pechugas de pollo en un tazón grande y mezcle con el jengibre, el ajo, el chile, la sal, la pimienta, el cilantro, el jugo de lima y 1 cucharada de aceite. Dejar de lado por lo menos 5 minutos para permitir que los sabores se desarrollen.", "Caliente una sartén de fondo plano y, cuando esté caliente, agregue el pollo. Cocine por 8-10 minutos hasta que el pollo esté dorado por todos lados.", "Mientras tanto, caliente el aceite restante en una sartén grande y cocine la cebolla y el chile rojo durante 5-6 minutos hasta que estén dorados. Agregue la cúrcuma y cocine por 1 minuto. Agregue la crema y cocine suavemente por un par de minutos.", "Agregue el pollo a la salsa cremosa y cocine a fuego lento durante 5 minutos, o hasta que el pollo esté bien cocido. Verifique el condimento y agregue el jugo de limón al gusto.", "Adorne con cilantro fresco y sirva inmediatamente con arroz o pan naan."], "url": "www_bbc_co_uk_food_recipes_chickentikkamasala_73305", "title": "James's chicken tikka masala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickentikkamasala_73305_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin hueso y sin piel", "1 litro / 2 pintas de caldo de pollo", "2 hojas frescas de laurel", "2 hojas frescas de salvia", "1 diente de ajo, pelado", "Atún estañado 125g / 4½oz en aceite, escurrido", "2 yemas de huevo de gallinas camperas", "½ limón, solo jugo", "3 anchoas en conserva, escurridas", "2 cucharadas de alcaparras", "250ml / 9fl oz de aceite de oliva, más extra para lloviznar", "110g / 4oz de hojas de cohete, para servir"], "method": ["Para el pollo, coloque las pechugas de pollo, caldo de pollo, hojas de laurel, salvia y ajo en una sartén, lo suficientemente profundo como para que el pollo se sumerge por completo en el caldo.", "Coloque la sartén a fuego medio y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el pollo esté cocido. Retírelo del fuego y déjelo a un lado para que se enfríe por completo, luego retire el pollo del líquido de cocción y deje enfriar en el refrigerador hasta que lo necesite. (Reserve el líquido de cocción y enfríelo en la nevera, cubierto.)", "Para la salsa tonnato, coloque el atún, las yemas de huevo, el jugo de limón, las anchoas y la mitad de las alcaparras en un procesador de alimentos y mezcle hasta obtener un puré. Con el motor en marcha, agregue gradualmente el aceite de oliva hasta que la mezcla alcance la consistencia de la mayonesa espesa. Agregue suficiente del líquido refrigerado reservado usado para cocinar el pollo a la mezcla hasta que cubra holgadamente la parte posterior de una cuchara.", "Para servir, cortar las pechugas de pollo y dividir equitativamente entre cuatro platos de servir. Vierta la salsa tonnato sobre la parte superior y espárzalos sobre las alcaparras restantes. Viste las hojas del cohete con un chorrito de aceite de oliva y acompáñalo al lado."], "url": "www_bbc_co_uk_food_recipes_chickentonnatoandroc_92210", "title": "Ensalada de pollo tonnato y rúcula", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para freír y cepillar", "1 cebolla roja, en rodajas", "1 diente de ajo, aplastado", "1 guindilla roja, finamente picada", "2 pechugas de pollo cocidas, en rodajas finas", "3 tomates, picados", "200g / 7oz de alubias en conserva, enjuagadas y escurridas", "1 cucharada de cilantro fresco picado", "8 crujientes discos de tortilla", "200 g / 7 oz de Asiago o queso cheddar, rallado", "1 aguacate, pelado y picado", "4 cucharadas de crema agria", "rodajas de limón"], "method": ["Calentar el aceite en una sartén y freír la cebolla, el ajo y el chile hasta que se ablanden.", "Agregue el pollo, los tomates y las alubias y caliente bien. Revuelva en el cilantro.", "Coloque cuatro de los discos de tortilla en una bandeja para hornear cepillado con aceite. Cubra cada disco con un poco de la mezcla de pollo, luego espolvoree sobre el queso.", "Cubra con otra tortilla, seguido de la mezcla restante de pollo y queso.", "Precaliente la parrilla a temperatura media o precaliente el horno a 200C / 400F / Gas 6.", "Transfiera la bandeja para hornear al horno o parrilla y cocine durante unos cinco minutos, o hasta que las tortillas estén crujientes y el queso se haya derretido, teniendo cuidado de no quemar las tortillas.", "Para servir, coloque una pila de tortilla en cada uno de los cuatro platos y decore con aguacate picado, una cucharada de crema agria y algunas rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_chickentostadas_87570", "title": "Chicken tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz de hojaldre", "1 huevo de gallinas camperas, ligeramente golpeado", "harina común", "1 cebolla picada", "2 dientes de ajo picados", "30g / 1oz de mantequilla", "Papas nuevas de 300g / 10oz, peladas y cortadas aproximadamente en trozos de 1.5cm / ½ en gruesos", "1 naranja, solo ralladura", "150ml / 5fl oz de vino blanco seco", "2½ cucharadas de harina común", "300ml / 10¾fl oz de caldo de pollo", "sal y pimienta negra recién molida", "Pollo deshuesado 700 g / 1 lb 9 oz, cortado en trozos de 3-4 cm / 1½ pulgadas", "150ml / 5fl oz de crema doble", "Espárragos de 300 g / 10 oz, recortados y cortados en longitudes de 4 cm / 1½ pulgadas"], "method": ["Para el relleno, freír la cebolla y el ajo suavemente en la mantequilla hasta que estén tiernos, sin dorar.", "Agregue las papas, la ralladura de naranja y el vino blanco, y hierva hasta que el vino haya desaparecido prácticamente.", "Espolvorea sobre la harina y revuelve por unos segundos, por lo que se distribuye uniformemente.", "Poco a poco revuelva en el caldo, para hacer la salsa.", "Condimentar con sal y pimienta.", "Revuelva en el pollo.", "Cubra y deje hervir a fuego lento durante 10 minutos más o menos.", "Revuelva de vez en cuando, luego destape durante otros cinco minutos, hasta que la salsa se espese.", "Agregue la crema y cocine por unos últimos tres minutos.", "Mientras tanto, cocine los espárragos ligeramente en agua con sal, hasta que estén tiernos, pero no flojos.", "Desagüe.", "Revuelva los espárragos con el pollo y las papas.", "Prueba y ajusta el sazón.", "Con una cuchara, vierta todo en un molde para pastel de 1 - 1.5 litros / 1¾ - 2½ pinta y déjelo enfriar.", "Precalentar el horno a 200C / 425F / Gas 7.", "Ruede la masa sobre una tabla enharinada.", "Corta un par de tiras largas, de aproximadamente 1 cm / ½ pulgadas de ancho.", "Cepille el borde del plato de tarta con el huevo batido.", "Coloque las tiras en los bordes, curvéelas para que se ajusten y corte, de modo que se extiendan por todos lados, pero no se superpongan.", "Cepíllese con huevo lavado, luego coloque la masa restante sobre la parte superior.", "Recorte el exceso y presione la masa hacia abajo alrededor del borde para sellar.", "Usa los adornos para hacer hojas decorativas, o flores o lo que sea que te apetezca, y luego pégalos en su lugar con el huevo batido.", "Haga un agujero en el centro para que el vapor pueda escapar", "Enfríe el pastel en la nevera durante 30 minutos, luego cepille con huevo batido y colóquelo en el horno.", "Después de 10 a 15 minutos, cuando el pastel esté dorado, reduzca el calor a 190 ° C / 375 ° F / Gas 5 y continúe cocinando por otros 20-25 minutos.", "Servir caliente."], "url": "www_bbc_co_uk_food_recipes_chickenwithasparagus_74779", "title": "Pollo con espárragos y pastel de patata nuevo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tallos de limoncillo, magullados", "2.5cm / 1 en pieza de jengibre fresco, pelado, cortado en tiras", "2 dientes de ajo, en rodajas", "4 pechugas de pollo de 175g / 6oz, sin piel", "sal y pimienta negra recién molida", "100 ml / 3½ fl oz de agua", "100g / 3½ oz de azúcar", "Mitades de nuez 150g / 5oz", "500ml / 1 pinta 2fl oz de caldo de pollo", "2 cabezas pak choi, cortado por la mitad", "1 cabeza de brócoli, cortado en pequeños floretes", "1 cucharada de mantequilla", "100 ml / 3½ fl oz de salsa de soja ligera", "1 cucharada de semillas de sésamo"], "method": ["Coloque la hierba de limón, el jengibre y el ajo en la base de un barco de vapor grande.", "Sazonar las pechugas de pollo con sal y pimienta negra recién molida y colocar encima de los condimentos.", "Coloque la tapa sobre el vaporizador y colóquelo sobre una olla grande de agua hirviendo suavemente durante unos 25 minutos, hasta que el pollo esté completamente cocido. Reserve para descansar en un lugar cálido.", "Para las nueces, coloque el agua y el azúcar en un wok y deje que hierva. Cocine por 5-6 minutos, o hasta que espese a un jarabe, luego agregue las nueces. Revuelva bien durante 30 segundos, luego drene el líquido y coloque las nueces a un lado.", "Para las verduras, coloque el caldo en una sartén y llévelo a ebullición. Agregue el pak choi y el brócoli y cocine durante 1-2 minutos. Drene las verduras y sumérjalas en agua helada para detener el proceso de cocción.", "En una sartén por separado, derrita la mantequilla. Agregue el pak choi y el brócoli y fría por un minuto, luego agregue la salsa de soja y las semillas de sésamo.", "Para servir, cortar las pechugas de pollo. Coloque una cucharada de pak choi y brócoli en cada plato y coloque una pechuga de pollo en rodajas encima. Espolvorear con nueces caramelizadas y servir."], "url": "www_bbc_co_uk_food_recipes_chickenwithcaramelis_87588", "title": "Pollo con nueces caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, pelada y cortada en cubitos", "½ pechuga de pollo, cortada en cubos del tamaño de un bocado", "55g / 2oz de chorizo, en rodajas", "1 cucharadita de pimentón", "Crema doble 50ml / 2fl oz", "200g / 8oz de arroz recién hecho", "Guisantes 100g / 4oz cocidos", "1 cucharada de aceite vegetal"], "method": ["Caliente el horno a 220C / 425F / Gas 7.", "Calentar el aceite de oliva en una sartén antiadherente y saltear la cebolla durante unos minutos, para suavizar.", "Agregue las piezas de pollo y fría hasta que estén doradas. Agregue el chorizo ​​y el pimentón y caliente por unos minutos. Vierta la crema doble y revuelva.", "Transfiera al horno y cocine durante 10-12 minutos, hasta que el pollo esté bien cocido.", "Mientras tanto, mezcle el arroz cocido, los guisantes cocidos y el aceite vegetal en un bol.", "Para servir, espolvoree el arroz cocido en un plato y sirva el plato de pollo y chorizo ​​al costado."], "url": "www_bbc_co_uk_food_recipes_chickenwithchorizo_82606", "title": "Pollo con chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva virgen extra", "4 palitos de apio, finamente picados", "2 zanahorias, finamente picadas", "1 cebolla mediana, finamente picada", "2 dientes de ajo, aplastados", "1 ramita de romero", "4 hojas de laurel", "sal y pimienta negra recién molida", "1 limón, ralladura solamente", "harina, para recubrimiento", "sal y pimienta negra recién molida", "8 piezas de pollo", "aceite de oliva, para freír", "100ml / 3½fl oz de vino blanco", "2 limones, solo jugo", "4 palitos de canela", "200ml / 7fl oz de caldo de pollo", "1 yema de huevo de gallinas camperas"], "method": ["Caliente el aceite de oliva en una olla y fríe con cuidado el apio, la zanahoria, la cebolla, el ajo, el romero y las hojas de laurel hasta que estén dorados, aproximadamente 15 minutos.", "Retire la ramita de romero y las hojas de laurel y sazone con sal y pimienta negra recién molida. Agregue la ralladura de limón rallado. Establecer a un lado.", "Mientras tanto, para el pollo, mezcle la harina con la sal y la pimienta negra recién molida y cubra las piezas de pollo en esta mezcla.", "Calentar el aceite de oliva en una sartén y freír el pollo hasta que esté dorado. Agregue el vino y cocine durante cinco minutos.", "Agregue la reducción de pollo y vino al sofrito, luego agregue la mitad del jugo de limón y la canela. Revuelva bien.", "Agregue el caldo y cocine a fuego lento durante aproximadamente 45 minutos, o hasta que la salsa se haya reducido y el pollo esté completamente cocido. Mantenga la sartén tapada durante los primeros 30 minutos de cocción.", "Retire los palitos de canela, luego mezcle la yema de huevo con el jugo de limón restante. Rápidamente, pero cuidadosamente mezcle esta mezcla en la salsa hasta que se mezcle. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenwithcinnamona_82392", "title": "Pollo con canela y limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin piel (sin hueso del ala)", "4 cucharaditas de crema", "Crema de 190ml / ¼ pinta", "190ml / ¼ pinta de caldo de pollo fuerte", "Chalotes de 9oz / 250g, descuartizados y luego fritos en un poco de mantequilla", "2 puerros picados, lavados y luego fritos en un poco de mantequilla", "sal y pimienta", "1 paquete de hojaldre listo para usar (prelaminado si es posible)"], "method": ["Calienta un grifo de carbón engrasado o calienta un poco de aceite en una sartén. Selle el pollo en ambos lados.", "Caliente la crema, la crema fresca y el caldo juntos.", "Cortar el pollo en trozos del tamaño de un tenedor y colocarlo en la salsa picante. Después de 5 minutos, agregue los chalotes y los puerros y caliente por otros 5 minutos. Temporada.", "Mientras tanto, haga de 4 a 6 círculos pequeños usando la masa de hojaldre enrollada previamente. Coloque en una bandeja para hornear y hornee hasta que se levante.", "Sirva el pollo y los puerros con un círculo de masa en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickenwithleeks_11267", "title": "Pollo con puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz piñones", "½ pechuga de pollo", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "½ puerro, solo parte blanca, finamente rebanada", "25g / 1oz de mantequilla", "150ml / 5fl oz de crema doble", "1 cucharada de estragón fresco picado", "sal y pimienta negra recién molida"], "method": ["Para el pollo, coloque los piñones en un procesador de alimentos y mezcle con un polvo. Presione el polvo en un lado de la pechuga de pollo.", "Caliente la mantequilla y el aceite de oliva a fuego medio, y fría el pollo recubierto durante 4-5 minutos por cada lado, o hasta que esté cocido y dorado. (El pollo se cuece cuando los jugos se vuelven transparentes cuando se perfora en la parte más gruesa con un pincho).", "Para los puerros, coloque los puerros y la mantequilla en una cacerola junto con tres cucharadas de agua hirviendo, y cubra con la tapa. Cocine a fuego medio durante dos minutos o hasta que se ablanden.", "Retire la tapa y caliéntela durante 2-3 minutos más hasta que el líquido se espese.", "Agregue la crema y cocine a fuego lento durante 3 a 4 minutos, luego agregue el estragón y condimente.", "Para servir, cuchara los puerros cremosos en un plato y coloque el pollo encima de ellos."], "url": "www_bbc_co_uk_food_recipes_chickenwithpinenutcr_89343", "title": "Pollo con costra de piñones y puerros con nata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "1 pequeño puñado de champiñones", "2 cucharadas de aceite de oliva", "5 cucharadas de vino marsala", "3 cucharadas de crema doble", "sal y pimienta negra recién molida, al gusto", "arroz, cocinado"], "method": ["Aplane la pechuga de pollo con un rodillo o mazo de carne entre dos hojas de película adhesiva. Coloque el pollo y los champiñones en el aceite caliente y cocínelos durante tres minutos por cada lado.", "Agregue el vino de Marsala y deje que se caliente. A medida que las llamas de la salsa, retire el pollo de la sartén y apague la llama.", "Agregue la crema y sal y pimienta al gusto.", "Sirve con arroz."], "url": "www_bbc_co_uk_food_recipes_chickenwithmarsalacr_73330", "title": "Pollo con crema de marsala y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cadáver de pollo asado, carne retirada, o pierna de pollo despojada y huesos de muslo (ver a continuación)", "1 cebolla, pelada, cortada en cuartos", "1 zanahoria, pelada, cortada por la mitad", "1 tallo de apio, recortado", "1 puerro, recortado", "2 dientes de ajo, pelados", "2 hojas frescas de laurel", "pequeños racimos de tallos de perejil", "1 litro / 1¾ pintas de agua fría", "2 cucharadas de aceite de oliva", "1 cebolla roja, pelada, más o menos picada", "1 cucharadita de semillas de comino", "3 dientes de ajo, pelados, en rodajas", "1 chile rojo, en rodajas", "1 zanahoria grande, fregada, cortada por la mitad, cada mitad cortada en 1 cm / ½ en medias lunas", "½ cucharadita de pimentón ahumado", "250g / 9 oz de tomates maduros, preferiblemente en la vid, picados", "1 pimiento rojo, cortado por la mitad, sin semillas, picado", "1 lata de botella de x 330ml / 11½fl oz", "400g / 14oz de arroz de grano largo", "Guisantes 200 g / 7 oz", "600g / 1lb 5oz de pechuga de pollo cocida y carne de pierna o muslo, triturada, o 1 carcasa de pollo, cocida, carne desmenuzada, carcasa reservada (ver arriba)", "40 g / 1½ oz de hojas de cilantro fresco picado, más extra para servir", "1½-2 limas, más 1 limón extra, cortado en trozos, para servir"], "method": ["Para el caldo, usando sus manos, rompa la carcasa de pollo pelada en dos o tres pedazos y coloque en una olla lo suficientemente grande como para sostenerlos. (Alternativamente, coloque los huesos de pollo en la sartén).", "Agregue los ingredientes en existencia restantes, vierta sobre el agua, luego lleve la mezcla a ebullición.", "Cuando el líquido esté hirviendo, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento, tapado, durante 40-45 minutos.", "Cuele el caldo a través de un tamiz fino y reserve el líquido. (Se deben obtener aproximadamente 800 ml / 1 pinta 8 lfl oz de caldo. Si no, agregue agua hirviendo al caldo para compensar la diferencia).", "Mientras tanto, para el pollo con arroz, caliente el aceite en una sartén por separado a fuego alto. Agregue la cebolla y las semillas de comino y fría, revolviendo bien, durante 1-2 minutos, o hasta que las cebollas se hayan suavizado y el comino esté fragante.", "Agregue el ajo, el chile, la zanahoria y el pimentón ahumado, revuelva bien y continúe freír durante 2-3 minutos, o hasta que las zanahorias se hayan ablandado.", "Agregue los tomates picados y la pimienta, luego cocine hasta que la mezcla esté hirviendo a fuego lento. Cubra la olla con una tapa y cocine durante 8-10 minutos, o hasta que la salsa se espese.", "Agregue la cerveza dorada, revuelva bien, luego lleve la mezcla a ebullición.", "Agregue el caldo de pollo y vuelva a hervir la mezcla, luego agregue el arroz.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cubra la sartén y cocine a fuego lento durante 25-30 minutos.", "Baje la temperatura a su nivel más bajo y continúe cocinando a fuego lento durante otros 8-10 minutos, o hasta que el arroz haya absorbido toda el agua y esté tierna.", "Retire el arroz del fuego, luego mezcle los guisantes, el pollo desmenuzado, el cilantro picado y el jugo de 1½ limas (o al gusto) hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el arroz con pollo por igual entre cuatro platos para servir. Espolvorea sobre el cilantro restante. Adorne cada plato con una rodaja de lima."], "url": "www_bbc_co_uk_food_recipes_chickenwithricearroz_92264", "title": "Pollo con arroz (arroz con pollo)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenwithricearroz_92264_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cabezas de ajo, separadas en clavos, sin pelar", "1 manojo de romero", "2 naranjas de sangre, cortadas en cuñas", "1 pollo grande, alrededor de 2.5kg / 5½lb", "100 g / 3½ oz de mantequilla francesa de buena calidad, en rodajas", "½ botella de Cava", "½ botella de Cava", "1 botella de vino blanco seco (al gusto)", "mantequilla perilla", "pequeño puñado de estragón fresco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Esparce los dientes de ajo (todavía en su piel) en una lata para asar. Dispersa la mitad del romero y la mitad de la naranja de sangre en la parte superior.", "Inserta el resto de naranja y romero en la cavidad del pollo y desliza suavemente las rebanadas de mantequilla debajo de la piel, teniendo cuidado de no perforarlo.", "Coloque el pollo con la pechuga hacia arriba sobre el ajo en la lata de asar.", "Vierta más de media botella de Cava y cubra con papel de aluminio.", "Transfiera al horno y tueste durante 1½ horas.", "Después de 1 hora y media de cocción, retire con cuidado la lámina y, utilizando pinzas, coloque el pollo al revés y hilvane con los jugos carnosos de la lata.", "Cocine el pollo durante 20 minutos más para dorar la parte inferior, antes de volver a colocar la gallina en su posición original.", "Hilvanar el pollo de nuevo. Encienda el horno a 180 ° C / 350 ° F / Gas 4 y cocine hasta que el pollo esté dorado por completo: sabrá cuando el pollo esté cocido ya que los jugos se mantendrán limpios cuando el pollo esté perforado con un pincho.", "Cuando el pollo esté cocido, retire el pollo de la lata y déjelo reposar en un lugar cálido.", "Para la salsa, quite las cáscaras de ajo, romero y naranjas de sangre con una cuchara ranurada y deséchela. Si queda algún diente de ajo suave en la cáscara, deslice con cuidado el suave diente de ajo fuera de la cáscara y dentro de una fuente limpia. Vierta los jugos de cocción en la sartén junto con todos los suaves dientes de ajo.", "Agregue media botella de Cava a la sartén. Cocine a fuego lento a fuego medio. Cuando el volumen comience a disminuir, agregue vino blanco al gusto (hasta una botella, aunque es posible que desee beber un vaso o dos de la botella) y espolvoree el estragón. Deje que la salsa hierva a fuego lento hasta que se reduzca a la mitad. Justo antes de servir, bata un poco de mantequilla.", "Mientras tanto, esculpe el pollo en porciones generosas.", "Sirve el pollo con la salsa."], "url": "www_bbc_co_uk_food_recipes_chickenwithroastedga_86095", "title": "Pollo con ajo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pollo deshuesadas y sin piel de 450 g / 1 lb, cortadas en cubos de 2,5 cm / 1 in", "1½ cucharada de aceite de maní (maní)", "3 cucharadas de salsa de soja ligera", "1 cucharada de vino de arroz Shaoxing o jerez seco", "sal", "pimienta negra recién molida", "2 cucharadas de harina de maíz", "3 cucharadas de pasta de sésamo o mantequilla de maní lisa", "1 cucharada de salsa de chile en grano (disponible en tiendas de comestibles asiáticas)", "1 cucharada de ajo picado grueso", "2 cucharaditas de aceite de chile", "2 cucharadas de vinagre de sidra o vinagre de arroz blanco chino", "2 cucharadas de salsa de soja ligera", "sal", "pimienta recién molida", "2 cucharaditas de azúcar", "2 cucharadas de agua caliente", "50g / 2oz de cebollas en rodajas finas", "100g / 4oz de pepinos en rodajas finas"], "method": ["En un tazón mediano, combine los ingredientes del marinado, revolviendo para combinar. Agregue el pollo, mezcle bien y deje que se macere, cubierto, durante al menos 20 minutos a temperatura ambiente. Escurrir, descartando el adobo.", "Para la salsa, coloque todos los ingredientes de la salsa en una licuadora o procesador de alimentos y procese hasta que quede suave.", "Caliente un wok a fuego alto hasta que esté muy caliente, luego agregue el aceite de maní. Cuando el aceite esté muy caliente y ligeramente humeante, agregue las piezas de pollo y saltee durante otros cinco minutos hasta que el pollo esté dorado.", "Baje la temperatura a bajo, agregue la salsa y continúe revolviendo por otros cinco minutos.", "Gire a un plato caliente, adorne con la cebolla y el pepino y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_chickenwithsataysauc_70986", "title": "Pollo con salsa de satay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenwithsataysauc_70986_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo de 225 g / 8oz, piel en", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "200ml / 7fl oz de caldo de pollo", "85g / 3oz de mantequilla", "200g / 7oz de hongos silvestres surtidos", "75ml / 2½fl oz de vino blanco", "Crema doble de 200ml / 7ml", "puñado de hojas grandes de espinaca (no espinacas baby)", "1 cucharada de estragón fresco picado", "200g / 7oz de arroz basmati, cocido según las instrucciones del paquete", "75g / 2½oz de almendras en copos, tostadas", "75 g / 2½ oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar el pollo con sal y pimienta negra recién molida, luego cocinar con la piel hacia abajo en una sartén caliente durante 4-5 minutos, hasta que la piel esté crujiente y dorada.", "Dé la vuelta al pecho para cocinar durante un minuto, luego transfiéralo a un plato hondo para horno, con la piel hacia arriba.", "Agregue suficiente caldo de pollo para llegar un tercio del camino hasta el pollo. Coloque en el horno y cocine durante 20-25 minutos, o hasta que el pollo esté completamente cocido.", "Mientras tanto, derrita la mantequilla en una sartén. Cuando la mantequilla esté espumosa, agregue los champiñones y fría por 3-4 minutos, hasta que estén dorados.", "Agregue el vino blanco y hierva durante 2-3 minutos para reducir el líquido casi por completo.", "Agregue la crema, la espinaca y el estragón y hierva para reducir el líquido en un tercio.", "Para el arroz, coloque el arroz cocido en un bol, agregue las nueces y la mantequilla y mezcle bien.", "Para servir, espolvorea una porción de la mezcla de arroz en un plato. Coloque una pechuga de pollo al lado y una cuchara sobre la salsa de crema."], "url": "www_bbc_co_uk_food_recipes_chickenwithwildmushr_84542", "title": "Pollo con setas y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechuga de pollo", "1 cucharada de miel líquida", "aceite vegetal", "sal y pimienta negra", "75 ml / 2½ fl oz de vino blanco medio seco", "150ml / 5fl oz de caldo de pollo", "2 ramitas de estragón", "150ml / 5fl oz de crema doble", "2 cucharadas de estragón picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una lata para asar, dore las pechugas de pollo con un poco de aceite. Sazonar ambos lados, poner la piel hacia arriba y verter sobre la miel.", "Asar hasta que esté cocido, unos 20 minutos. Retire el pollo de la sartén y manténgalo caliente mientras prepara la salsa.", "Elimine el exceso de grasa, agregue el vino y hágalo hervir, raspando para asegurarse de incluir cualquiera de los jugos del pollo. Reduzca hasta que se quede con un par de cucharadas de líquido rico en sabores.", "Agregue el caldo y las ramitas de estragón, lleve a ebullición y reduzca en un tercio.", "Agregue la crema, hierva y deje que se reduzca un poco antes de quitar la ramita de estragón y agregar la hierba fresca picada.", "Ajustar el aderezo y servir cucharadas sobre el pollo."], "url": "www_bbc_co_uk_food_recipes_chickenwithtarragonc_67702", "title": "Pollo con salsa de crema de estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hojas de espinaca 500g / 1lb 2oz, lavadas", "4 cucharadas de aceite vegetal", "3 vainas de cardamomo", "2 hojas de laurel", "Palo de canela de 5cm / 2in", "3-4 chiles verdes, pinchados con un cuchillo", "1 cebolla grande, picada", "2cm / ¾ en pieza de jengibre, pelado y picado", "1 cabeza de ajo, pelada, clavo de olor entero", "3 tomates grandes, cortados en cuartos", "800 g / 1 libra de trozos de pollo de 12 onzas, sin piel", "2 cucharaditas de cilantro molido", "1½ cucharadita de sal masala", "sal y pimienta negra recién molida", "4 cucharadas de yogurt natural, revuelto", "arroz basmati, cocinado según las instrucciones del paquete, para servir"], "method": ["En un procesador de alimentos, mezcle la espinaca con un puré con una o dos cucharadas de agua para aflojar la mezcla. Dejar de lado.", "Caliente el aceite vegetal en una sartén a fuego medio. Agregue las vainas de cardamomo, las hojas de laurel y la canela y fría por 20-30 segundos.", "Agregue los chiles verdes y la cebolla y continúe freír durante 4-5 minutos, o hasta que estén caramelizados.", "Mientras tanto, mezcle el jengibre, el ajo y los tomates hasta lograr una pasta homogénea en el procesador de alimentos.", "Cuando las cebollas se hayan caramelizado, agregue la pasta, los trozos de pollo y las especias restantes a la sartén y revuelva bien para que se combinen. Sazone, a gusto, con sal y cocine a fuego lento durante 12-15 minutos, revolviendo regularmente.", "Agregue el yogur, revuelva bien y continúe cocinando a fuego lento la mezcla hasta que la salsa se haya espesado y casi se haya secado.", "Agregue el puré de espinacas y continúe cocinando a fuego lento durante 10-12 minutos, o hasta que el pollo se haya cocinado. Sazonar, al gusto, con sal y pimienta negra recién molida, luego servir con arroz."], "url": "www_bbc_co_uk_food_recipes_chickenwithspinach_90047", "title": "Pollo con espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenwithspinach_90047_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 lonchas de tocino rayado ahumado", "1 pechuga de pollo, cortada en 4 tiras", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "½ pimiento rojo, picado", "2 cucharaditas de vinagre de vino tinto", "2 cucharaditas de azúcar en polvo", "1 cucharada de ketchup de tomate", "dash salsa Tabasco", "pequeño puñado de albahaca fresca y menta, picada"], "method": ["Para el pollo, envuelva con fuerza una loncha de tocino alrededor de cada tira de pollo. Calentar el aceite en una sartén y freír las tiras de pollo envueltas durante 3-4 minutos en cada lado, o hasta que estén doradas y completamente cocidas.", "Para la salsa picante, caliente el aceite en una cacerola pequeña a fuego medio y fría los pimientos durante 2-3 minutos. Agregue el vinagre, el azúcar, el ketchup y la salsa Tabasco y cocine a fuego lento durante 6-8 minutos. Agregue las hierbas.", "Para servir, coloque las tiras de pollo envueltas en tocino en un plato de servir con la salsa picante en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_chickenwrappedinbaco_85206", "title": "Pollo envuelto en tocino con salsa picante de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "sal y pimienta negra recién molida", "50 g / 1¾oz de mozzarella, rebanadas gruesas", "1 rebanada de jamón de Parma", "1 cucharada de tomillo fresco, picado", "1 cucharada de aceite de oliva", "1 diente de ajo", "2 cucharadas de aceite de oliva", "1 tomate, picado", "½ puerro, picado", "1 limón, solo corteza", "pizca de copos de chile", "1 cucharada de salvia fresca", "4 cucharadas de vino tinto", "4 papas nuevas, cortadas en tiras", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la pechuga de pollo rellena, corte la pechuga de pollo a la mitad (pero no a la derecha) y pliéguela hacia afuera; esto se llama pegar mantequilla a la pechuga de pollo.", "Cortar la mozzarella y colocar sobre el pollo plano, tres rebanadas deberían ser suficientes.", "Dobla la pechuga de pollo y envuelve el jamón de Parma alrededor.", "En una sartén de tamaño mediano, caliente el aceite, dore la pechuga de pollo hasta que se dore.", "Agregue el ajo y colóquelo en el horno precalentado durante 8-10 minutos.", "Para hacer la salsa de puerro y tomate, agregue todos los ingredientes en una cacerola de tamaño mediano y cocine por tres minutos.", "Sirve con el pollo.", "Para hacer las papas a la plancha, mezcle las papas en rodajas en aceite de oliva, con sal y pimienta negra recién molida.", "Coloque en una sartén caliente y cocine por 4-5 minutos volteándolo ocasionalmente.", "Sirve con la salsa de pollo y tomate."], "url": "www_bbc_co_uk_food_recipes_chickenwrappedinparm_76108", "title": "Pollo envuelto en jamón de parma relleno de mozzarella, papas a la parrilla con puerros y salsa de vino de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de calabaza, cortada en cubos", "2 cucharadas de aceite vegetal", "1 cebolla, en rodajas", "2 dientes de ajo, en rodajas", "2 puerros, cortados en pedazos grandes", "salpicar vino blanco", "sal y pimienta negra recién molida", "200g / 7oz de crema fresca", "100ml / 3½ fl oz crema doble", "1 x 400 g / 14 oz pueden garbanzos, drenados", "1 cucharada de estragón fresco picado", "500g / 1lb 2oz de papas, cortadas en trozos pequeños", "100g / 3½ oz de harina de auto crianza", "50 g / 1¾oz de mantequilla sin sal", "sal y pimienta recién molida"], "method": ["Para la cazuela de garbanzo, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque la calabaza en una bandeja de horno y rocíelo con una cucharada de aceite vegetal.", "Tueste la calabaza por 8-10 minutos o hasta que esté tierna.", "Mientras tanto, caliente el resto del aceite vegetal en una sartén y fríe la cebolla y el ajo durante 3-4 minutos, o hasta que se ablanden. Agregue los puerros y cocine por 3-4 minutos más.", "Agregue la calabaza cocida y el vino cocido y cocine por otros 5-6 minutos. Sazonar con sal y pimienta negra recién molida.", "Agregue la crème fraîche, la crema doble, los garbanzos y el estragón. Vierta la mezcla en una cazuela.", "Aumente la temperatura del horno a 200C / 400F / gas 6.", "Mientras tanto, para el aderezo de bollo, hiérvalas en una sartén con agua salada hirviendo durante 10-12 minutos, o hasta que estén tiernas. Desagüe.", "Incline las papas cocidas en un tazón y aplaste. Agregue la harina y la mantequilla hasta que la mezcla se una como masa.", "Ruede la masa sobre una superficie enharinada a un espesor de 2.5 cm / 1 pulgada. Con un cortador de pasteles de 10 cm / 4 in, corte los círculos de la masa y colóquelos en la parte superior de la cazuela.", "Hornee en el horno durante 10-12 minutos o hasta que estén dorados en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickpea_and_butternut_61022", "title": "Cazuela de garbanzo y calabaza con cobertura de bollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_and_butternut_61022_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechuga de pollo de 500 g / 1 lb, cortada en piezas de 2.5 cm / 1 in", "1 pimiento rojo, sin semillas y cortado en trozos", "pequeñas cebolletas de primavera", "6 hongos shiitake, tallo eliminado y reducido a la mitad", "pequeñas cebolletas de primavera", "3 cucharadas de mirin", "3 cucharadas de salsa de soja japonesa", "3 cucharadas de sake (vino de arroz)", "1 cucharadita de azúcar"], "method": ["Pase las piezas de pollo por los pinchos de bambú previamente remojados, intercalando cada trozo de pollo con cebolleta, pimiento y champiñones.", "Mezcle el mirin, la soja, el vino de arroz y el azúcar y revuelva hasta que el azúcar se disuelva.", "Caliente una sartén de plancha y cepille el pollo con el glaseado. Planche cada 30 segundos o más, cepillando la parte superior cada vez hasta que el pollo esté cocido y la carne bruñeda al glaseado de caoba."], "url": "www_bbc_co_uk_food_recipes_chickenyakitori_11599", "title": "Chikaki Yakitori", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenyakitori_11599_16x9.jpg", "isVegetarian": false, "recommendations": 0}]