[{"isVegetarian": false, "title": "Salchicha de carne de sapo en el agujero con salsa de cebolla", "url": "www_bbc_co_uk_food_recipes_beefsausagetoadinthe_86522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 225g / 8oz", "8 huevos de gallinas camperas", "570ml / 1 litro de leche", "1 cucharada de aceite de oliva", "6 salchichas de carne", "75 g / 3 oz de goteo de carne", "2 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "2 cebollas en rodajas", "1 cucharada de gránulos de salsa instantánea", "1 cucharada de extracto de levadura", "400ml / 14fl oz de caldo de verduras", "sal y pimienta negra recién molida"], "serves": "Sirve 4-6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el sapo en el hoyo, coloca la harina común en un bol y haz un pozo en el centro. Agregue los huevos y la leche para hacer una mezcla suave. Coloque en la nevera durante la noche.", "Al día siguiente, cuando esté listo para cocinar el sapo en el hoyo, precaliente el horno a 220C / 425F / Gas 7.", "Caliente el aceite de oliva en una sartén, agregue las salchichas y cocine, volteándolas frecuentemente, hasta que se doren por todos lados.", "Coloque la carne goteando en una lata para asar y colóquela en el horno. Retire la mezcla del refrigerador y bata ligeramente hasta que quede suave y combinada, puede haberse separado ligeramente durante la noche. Agregue las hojas de tomillo y sazone con sal y pimienta negra recién molida.", "Retire la lata de asar del horno, agregue las salchichas y vierta sobre la mezcla. Transfiera al horno y hornee durante 35-40 minutos, luego abra la puerta del horno para eliminar el vapor. Baje la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y cocine por otros 10 minutos, hasta que se dore. Retire del horno y deje reposar durante unos minutos.", "Para la salsa, caliente la mayor parte de la mantequilla en una sartén, agregue las cebollas y cocine durante diez minutos o hasta que estén suaves.", "Agregue los gránulos de salsa y el extracto de levadura y revuelva para combinar. Agregue el caldo de verduras y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos hasta que espese. Sazone con sal y pimienta negra recién molida y agregue el resto de la mantequilla.", "Para servir, coloque porciones del sapo en el orificio en platos para servir y vierta sobre la salsa."]}, {"isVegetarian": false, "title": "Rodajas de ternera cocidas con jerez oloroso", "url": "www_bbc_co_uk_food_recipes_beefslicescookedwith_92904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg / 2lb 2oz de papas, como King Edward o Maris Piper, peladas, cortadas en trozos de igual tamaño", "2 dientes de ajo, pelados", "2 hojas de laurel", "sal y pimienta negra recién molida", "75-110ml / 3-4fl oz de aceite de oliva virgen extra", "4 x 200g / 7oz rodajas filete de filete, cortado en tiras de 1cm / ½in de ancho", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "1 diente de ajo, pelado, finamente cortado en cubitos", "1 ramita fresca de romero", "1 x 225 g / 8 oz de pimientos del piquillo, escurridos, en rodajas", "6 cucharadas de jerez seco oloroso", "4 ramitas de perejil fresco de flatleaf, solo hojas, picadas", "4 ramitas de menta fresca, picadas", "2 cabezas de lechuga crujiente, como la lechuga romana, hojas separadas, en rodajas", "25g / 1oz de almendras tostadas en copos", "1 pizca de pimentón ahumado en caliente"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el puré de aceite de oliva, coloque las papas en una olla grande y cubra con agua fría. Agregue una pizca de sal, el ajo, las hojas de laurel y dos cucharadas de aceite de oliva, luego ponga el agua a hervir. Reduzca el fuego hasta que el líquido esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 10-15 minutos, o hasta que las papas estén tiernas. Escurrir bien.", "Regrese las papas drenados a la sartén, luego coloque la sartén sobre el calor residual durante unos segundos para eliminar el exceso de humedad.", "Aplaste las papas hasta que estén suaves usando un triturador de patatas o ricer. Agregue el aceite de oliva hasta que esté bien combinado, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para la carne de res, sazone las tiras de carne, al gusto, con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén antiadherente o en un sartén a fuego alto hasta que esté casi a punto de ahumar. Agregue el ajo, las tiras de carne y el romero y saltee durante 1-2 minutos, o hasta que la carne se dore.", "Agregue las rodajas de pimiento del piquillo y continúe salteando por un minuto más, luego vierta el jerez y hierva por 2-3 minutos, o hasta que la mayoría del líquido se haya evaporado.", "Retire la sartén o el wok del fuego, luego agregue el perejil picado y las hojas de menta.", "Para servir, divida las hojas de lechuga cortadas en partes iguales entre cuatro platos para servir. Cuchara sobre la carne, las verduras y los jugos de cocina. Rocíe un poco más de aceite de oliva virgen extra y espolvoree sobre las almendras copos y el pimentón ahumado. Ponga la mezcla de aceite de oliva al lado."]}, {"isVegetarian": false, "title": "Filete de ternera con verduras a la plancha y pesto de chile", "url": "www_bbc_co_uk_food_recipes_beefsteakwithgriddle_71404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 boniato, pelado y cortado en dados de 2.5 cm / 1 pulgada", "1 calabacín, pelado y cortado en dados de 2.5 cm / 1 pulgada", "1 chalote de plátano, pelado y cortado en cubitos", "1 chile rojo, sin semilla y cortado en cubitos", "4 cucharadas de aceite de oliva", "algunas ramitas de romero", "algunas ramitas de tomillo", "2 dientes de ajo, pelados", "2 cucharadas de aceite de oliva", "2 filetes de carne", "sal", "pimienta negra recién molida", "1 chile rojo, sin semilla y cortado en cubitos", "1 guindilla, sin grano y picada", "4 cucharadas de aceite de oliva", "pequeñas hojas de albahaca fresca"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer los vegetales, coloca la papa, el calabacín, la chalota y el chile en un tazón grande y cúbrelo con el aceite de oliva.", "Agregue el romero, las ramitas de tomillo y el ajo y mezcle.", "Caliente una sartén a prueba de horno a fuego alto y cocine a la parrilla las verduras durante 4-5 minutos.", "Transfiera la sartén al horno y tueste durante 8-10 minutos o hasta que las verduras estén blandas.", "Mientras tanto, condimente generosamente los bistecs con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente.", "Freír los bistecs con la guindilla durante 2-3 minutos a cada lado, o de acuerdo con el gusto personal.", "Para hacer el pesto de chile, coloque el chile, el aceite de oliva y las hojas de albahaca en un mini procesador de alimentos y blitz hasta que quede suave.", "Sirva el bistec junto a los vegetales y rocíe con el pesto de chile."]}, {"isVegetarian": false, "title": "Estofado de ternera con albóndigas", "url": "www_bbc_co_uk_food_recipes_beefstewwithdumpling_87333", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstewwithdumpling_87333_16x9.jpg", "ingredients": ["2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "Filete de ternera a la plancha de 750 g / 1 lb 10 oz, cortado en trozos del tamaño de un bocado", "2 cucharadas de harina normal", "2 dientes de ajo, aplastados", "175g / 6oz cebollas bebé, peladas", "150g / 5oz de apio, cortado en trozos grandes", "150 g / 5 oz de zanahorias, cortadas en trozos grandes", "2 puerros, más o menos picados", "200 g / 7 oz de colinabo, cortado en trozos grandes", "150ml / 5fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "2 hojas frescas de laurel", "3 cucharadas de hojas frescas de tomillo", "3 cucharadas de perejil de flatleaf fresco picado", "Salsa Worcestershire, al gusto", "1 cucharada de vinagre balsámico, o al gusto", "sal y pimienta negra recién molida", "125g / 4½ oz de harina natural, más extra para espolvorear", "1 cucharadita de polvo de hornear", "pizca de sal", "60 g / 2½ oz de sebo", "agua, para hacer una masa", "puré de patatas", "1 cucharada de perejil de flatillo picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el estofado de ternera, caliente el aceite y la mantequilla en una cazuela para horno y fría la carne hasta que se dore por todos lados.", "Espolvorea sobre la harina y cocina durante 2-3 minutos más.", "Agregue el ajo y todas las verduras y fría por 1-2 minutos.", "Agregue el vino, el caldo y las hierbas, luego agregue la salsa Worcestershire y el vinagre balsámico, al gusto. Sazonar con sal y pimienta negra recién molida.", "Cubra con una tapa, transfiera al horno y cocine durante aproximadamente dos horas, o hasta que la carne esté tierna.", "Para las albóndigas, tamice la harina, el polvo de hornear y la sal en un tazón.", "Agregue el sebo y suficiente agua para formar una masa espesa.", "Con las manos enharinadas, enrolle cucharadas de la masa en bolitas.", "Después de dos horas, retire la tapa del estofado y coloque las bolas encima del estofado. Cubra, vuelva al horno y cocine por otros 20 minutos, o hasta que las albóndigas se hayan hinchado y estén tiernas. (Si prefiere sus albóndigas con una tapa dorada, deje la tapa cuando regrese al horno).", "Para servir, coloque una cucharada de puré de patatas en cada uno de los cuatro platos y cubra con el guiso y las albóndigas. Espolvorear con perejil picado."]}, {"isVegetarian": false, "title": "Estofado de ternera con patatas Lyonnaise", "url": "www_bbc_co_uk_food_recipes_beefstewwithlyonnais_85110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla, finamente rebanada", "1 diente de ajo, picado", "Filete de res 100g / 3½oz, cortado en cubos de 2.5cm / 1in", "sal y pimienta negra recién molida", "1 cucharada de ketchup de tomate", "100 ml / 3½ fl oz de vino tinto", "75g / 2¾oz de frijoles borlotti en conserva, escurridos", "1 zanahoria, pelada y picada", "75g / 2¾oz de patatas ratte (u otras patatas pequeñas y cerosas), peladas y en rodajas", "1 cucharada de pan rallado fresco, para servir", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "100 g / 3½ oz de patatas ratte (u otras patatas pequeñas y cerosas), blanqueadas y en rodajas", "1 diente de ajo, en rodajas", "½ cebolla, finamente rebanada", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el estofado de ternera, derrita la mantequilla con el aceite en una sartén a fuego lento y fría la cebolla y el ajo hasta que estén suaves.", "Agregue las piezas de carne y cocine, revolviendo con frecuencia, hasta que se doren por todos lados. Sazonar con sal y pimienta negra recién molida.", "Agregue el ketchup y el vino y mezcle bien.", "Agregue los frijoles, la zanahoria y las patatas y cocine a fuego lento durante 10-12 minutos.", "Para las papas Lyonnaise, derrita la mantequilla con el aceite en una sartén a fuego medio y fría las papas durante 8-10 minutos, hasta que estén doradas.", "Agregue el ajo y la cebolla, sazone con sal y pimienta negra recién molida y cocine suavemente hasta que se ablanden.", "Para servir, coloca el guiso en un bol y espolvorea sobre las migas de pan. Coloque las papas al lado y espolvoree sobre el perejil."]}, {"isVegetarian": false, "title": "Estofado de ternera con albóndigas", "url": "www_bbc_co_uk_food_recipes_beefstewwithdumpling_89212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55 g / 2 oz de sebo fresco, finamente picado, o 85 g / 3 oz de sebo triturado", "Harina normal de 175g / 6oz, más extra para espolvorear", "1 cucharadita de sal", "½ cucharadita de polvo de hornear", "1 cucharadita de salsa de rábano picante (opcional)", "1 puñado de perejil fresco, picado (opcional)", "dash leche o agua", "Pechuga de carne 2kg / 4½lb", "3 cebollas, rebanadas gruesas", "3 zanahorias, en rodajas gruesas", "1 apio, cortado en pedazos de 2cm / 1in", "Papas de 350g / 12oz cortadas en trozos", "1 hoja de laurel", "6 ramitas de perejil fresco", "agua o caldo de carne, para cubrir la carne"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para las albóndigas, mezcle el sebo, la harina, la sal y el polvo de hornear juntos en un tazón y agregue el rábano picante y el perejil, si los está usando. Poco a poco agregue leche o agua a la mezcla, mezcle bien para formar una masa suave. Con las manos enharinadas, enrolle pequeños trozos de la masa en bolas del tamaño de bolas de masa. Dejar de lado.", "Para el estofado, coloque la pechuga de res en una olla grande y esparza alrededor de las cebollas, las zanahorias, el apio, las papas, la hoja de laurel y el perejil. Agregue suficiente agua o caldo de res para cubrir, luego lleve a ebullición.", "Cubra con una tapa, reduzca el fuego a su nivel más bajo y cocine a fuego lento durante al menos 1-2 horas, o hasta que la carne esté tierna. Agregue las albóndigas al guiso 20 minutos antes de que el estofado termine de cocinarse. Cubra con una tapa y no levante de nuevo hasta el final del tiempo de cocción, o hasta que las albóndigas estén cocidas.", "Para servir, coloca el estofado y las albóndigas en tazones."]}, {"isVegetarian": false, "title": "Ternera salteada", "url": "www_bbc_co_uk_food_recipes_beefstirfry_75730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite vegetal", "½ cebolla roja", "1 tomate, cortado en cuñas", "½ tallo de brócoli, en rodajas", "1 diente de ajo", "½ cucharadita de cúrcuma molida", "½ cucharadita de jengibre fresco, rallado", "150 g / 5½ oz de carne de vacuno, en rodajas", "2 cucharadas de salsa de soja"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el salteado, caliente el aceite vegetal en un wok caliente. Agregue la cebolla roja y cocine por un minuto.", "Agregue el tomate, el brócoli, el ajo y las especias cocine por un minuto más.", "Agregue la carne de res y la salsa de soja y cocine por un minuto más.", "Servir inmediatamente."]}, {"isVegetarian": false, "title": "Caldo de carne", "url": "www_bbc_co_uk_food_recipes_beefstock_1295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2¼lb huesos de ternera", "2 zanahorias, peladas y picadas", "2 cebollas, peladas y cortadas en cuartos", "2 palitos de apio, más o menos picados", "1 cucharada de aceite vegetal", "8 granos de pimienta", "2 hojas de laurel secas", "3-4 tallos de perejil fresco", "1 ramita de tomillo fresco"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Coloque los huesos en una lata para asar y hornee hasta que estén dorados.", "Coloque la zanahoria, la cebolla y el apio en otra lata de tueste y vierta el aceite. Hornea hasta que se dore bien.", "Coloque los vegetales y los huesos en una sartén grande y agregue los granos de pimienta, las hojas de laurel, el perejil y el tomillo. Cubrir con agua", "Llevar a ebullición y quitar toda la espuma que se haya formado. Cubra y cocine a fuego lento muy suavemente durante 3-4 horas. De vez en cuando, elimina cualquier escoria que se forme. Colar en un tazón grande y dejar enfriar. Relajarse durante la noche. Elimine cualquier grasa que se haya formado en la superficie.", "Use dentro de 3 días o congele. Para congelar, reduzca el caldo a la mitad hirviéndola vigorosamente y enfríe. Verter en bandejas de cubitos de hielo y congelar. Cuando esté congelado, coloque los cubos en una bolsa, etiquételos, y cuando quiera usar uno, simplemente coloque una jarra y agregue agua hirviendo para disolver el cubo."]}, {"isVegetarian": false, "title": "Stroganoff de carne con papas", "url": "www_bbc_co_uk_food_recipes_beefstroganoffwithma_71568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstroganoffwithma_71568_16x9.jpg", "ingredients": ["Filete de res 675 g / 1 ½ libra, preferiblemente cortado desde la cola", "65g / 2½oz de mantequilla sin sal", "1½ cucharada de pimentón (húngaro caliente, si te gusta un poco de calor sutil)", "1 cebolla grande, muy finamente cortada", "Setas botón de 350 g / 12 oz, en rodajas finas", "3 cucharadas de aceite de girasol", "300ml / 10fl oz de crema agria", "2 cucharaditas de jugo de limón", "pequeño puñado de hojas de perejil, finamente picado", "sal", "pimienta negra recién molida", "450g / 1lb de papas harinas, como Maris Piper, peladas", "aceite de girasol, para freír"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cortar el bistec en rodajas de 1 cm / 0,5 in de espesor, luego cortar cada rebanada a través del grano en tiras de 1 cm / 0.5 in de ancho.", "Para las papas Matchstick, corte las papas a mano en palos cortos de 3 mm / 0.2 pulgadas de espesor o use una mandolina. Dejar de lado en un tazón de agua fría.", "Caliente el aceite de girasol para freír, ya sea en una sartén grande o en una freidora, a 190 ° C / 375 ° F.", "Mientras tanto, derrita la mantequilla en una sartén grande, agregue el pimentón y la cebolla y cocine lentamente hasta que la cebolla esté suave y dulce, pero no dorada.", "Agregue los champiñones y freír suavemente durante tres minutos. Transfiera la mezcla a un plato y manténgalo caliente.", "Escurra las papas del fósforo y séquelas completamente con una toalla de té limpia o con una espátula para ensaladas.", "Vierte las papas en el aceite caliente y freír durante tres minutos, hasta que estén crujientes y doradas. Escurra brevemente sobre papel de cocina y manténgalo caliente en un horno bajo.", "Usando la misma olla en la que cocinó la mezcla de cebolla, caliente una cucharada y media de aceite de girasol hasta que esté muy caliente.", "Agregue la mitad del filete y fríe rápidamente, sazonándolo y girándolo mientras lo hace, por poco más de un minuto. Transfiera a un plato y repita con el resto del aceite y el bistec.", "Regrese la mezcla de cebolla a la sartén y vierta la crema agria. Llevar a ebullición y cocinar a fuego lento durante un minuto más o menos, hasta que espese.", "Regrese el bistec a la sartén y caliente muy suavemente durante un minuto; la carne no debe cocinarse más.", "Agregue el jugo de limón y el perejil y sirva con las papas."]}, {"isVegetarian": false, "title": "Stroganoff de ternera con patatas salteadas", "url": "www_bbc_co_uk_food_recipes_beefstroganoffwithsa_89439", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstroganoffwithsa_89439_16x9.jpg", "ingredients": ["75g / 3oz de mantequilla", "1 cebolla, finamente rebanada", "150 g / 5 oz de champiñones blancos, en rodajas finas", "2 cucharadas de puré de tomate", "1½ cucharadita de mostaza Dijon", "½ cucharadita de pimentón picante ahumado", "110ml / 4fl oz de caldo de carne", "Filete de carne de vacuno de 500 g / 1 lb 2 oz, cortado en tiras", "sal y pimienta negra recién molida", "150ml / 5fl oz de aguardiente", "200ml / 7fl oz de crema agria", "2 cucharadas de perejil de flatleaf", "3 cucharadas de aceite de oliva", "3 patatas grandes, peladas y en cubos", "½ cebolla, finamente picada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una sartén hasta que esté caliente, luego agregue la mitad de la mantequilla. Cuando haga espuma, agregue la cebolla y fría por 2-3 minutos, o hasta que se suavice.", "Agregue los champiñones y cocine durante 1-2 minutos.", "Agregue el puré de tomate, la mostaza y el pimentón y cocine por un minuto más.", "Agregue el caldo de carne y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 3-4 minutos.", "Sazonar la carne con sal y pimienta negra recién molida.", "Caliente una sartén por separado y agregue la mantequilla restante. Cuando haga espuma, agregue la carne y fría por 2-3 minutos en ambos lados, hasta que se dore por todas partes.", "Agregue el brandy y permita que flamee cuidadosamente en la sartén. (PRECAUCIÓN: asegúrese de que no haya materiales inflamables por encima de la sartén cuando llamea).", "Agregue la crema agria a la mezcla de cebolla y champiñones y mezcle bien.", "Cuando las llamas hayan remitido, agregue la carne a la crema agria y la mezcla de champiñones y cocine por un minuto. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el perejil.", "Para las papas salteadas, caliente el aceite en una sartén hasta que esté caliente, luego agregue las papas y cocínelas por 2-3 minutos por cada lado, o hasta que estén tiernas y doradas por todas partes. Sazonar bien con sal y pimienta negra recién molida y agregar las cebollas. Revuelva suavemente para combinar.", "Para servir, coloque dos cucharadas de las papas salteadas en cada plato y una cucharada de carne a la parrilla a la par."]}, {"isVegetarian": false, "title": "Pudines de sebo de res con queso de coliflor y riñones cocidos en jerez", "url": "www_bbc_co_uk_food_recipes_beefsuetpuddingswith_92133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "Tocino rayado de 50 g / 2 oz, finamente picado", "2 cucharadas de harina normal", "sal y pimienta negra recién molida", "1kg / 2lb 4oz estofado de carne o espinilla, cortado, cortado en cubos de 1cm / ½ en", "2 cebollas, peladas, finamente picadas", "300ml / 11fl oz de vino tinto", "500ml / 18fl oz buenas existencias de carne", "1 bouquet garni (2 ramitas de tomillo, 1 ramita pequeña de perejil y 2 hojas de laurel atadas con una cuerda de cocina)", "2 cucharaditas de salsa Worcestershire", "2 cucharaditas de brandy", "mantequilla, para engrasar", "Harina de crianza de 375 g / 13 oz, más extra para quitar el polvo", "200 g / 7 oz de sebo de carne", "1 cucharadita de tomillo seco", "pizca de salvia seca", "1 cucharadita de sal marina", "110-150ml / 4-5fl oz de agua fría", "1 yema de huevo de gallinas camperas, más 1 huevo batido para lavar huevos", "2 patatas grandes, sin pelar", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "½ cebolla mediana, pelada, picada finamente", "1 tallo de apio, cortado, finamente picado", "1 zanahoria, pelada, finamente picada", "2 dientes de ajo, aplastados", "2 cucharaditas de hojas frescas de tomillo", "8 riñones de corderos, membranas externas eliminadas, cortadas por la mitad", "4 cucharadas de jerez seco", "2 cucharadas de crema", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatleaf fresco picado", "Coliflor de 1 cabeza, núcleo removido, roto en florecillas", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "150g / 5oz de queso Lincolnshire Poacher, rallado", "500 g / 1 libra de guisantes congelados 2 oz", "1 cucharadita de orégano seco", "botón de mantequilla"], "serves": "8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne, caliente el aceite en una sartén de base pesada a fuego medio. Agregue el tocino y fría por 6-8 minutos, o hasta que esté crujiente y dorado.", "Espolvoree la harina en un plato y sazone con sal y pimienta negra recién molida. Dragar los cubos de carne en la harina sazonada hasta que estén cubiertos.", "Agregue los cubos de carne recubiertos a la sartén con el tocino y fríe durante 4-5 minutos, volteándolos regularmente, hasta que se doren.", "Agregue las cebollas y continúe freír durante 3-4 minutos, o hasta que estén blandas pero no coloreadas.", "Agregue el vino, el caldo, el bouquet garni, la salsa Worcestershire y el brandy y revuelva para combinar. Cubra la olla con una tapa y deje que la mezcla hierva a fuego lento. Continúe cocinando a fuego lento hasta que la carne esté tierna y se deshaga (aproximadamente dos horas si usa bistec estofado, o tres horas si usa espinilla).", "Cuando la carne esté tierna, aumenta el fuego y lleva el líquido de cocción a ebullición. Continúe cocinando durante 25-30 minutos o hasta que el volumen de líquido se haya reducido a la mitad. Retirar del fuego y reservar para enfriar.", "Mientras tanto, para los postres de sebo, engrase ocho cuencos con leche con mantequilla.", "En un tazón, mezcle la harina, el sebo, el tomillo, la salvia y la sal hasta que estén bien combinados.", "Poco a poco agregue suficiente agua hasta que la mezcla se una como una masa firme (es posible que no necesite usar toda el agua).", "Agregue la yema de huevo y amasarla en la masa hasta que esté bien combinada. Cubra el recipiente y enfríe la masa en la nevera durante al menos 30 minutos.", "Cuando la masa se haya enfriado, pellizque ocho porciones iguales de la masa.", "Enrolla la primera porción de masa en una bola y pellizca alrededor de una cuarta parte. Haga rodar la bola más grande de masa sobre una superficie de trabajo ligeramente enharinada en un círculo grande y delgado (coloque la parte más pequeña a un lado).", "Línea uno de los cuencos de budín preparados con el disco de pasta de sebo.", "Llene el recipiente del pudín con un poco de la salsa de carne de res y de vino tinto hasta que esté lleno en tres cuartas partes.", "Extienda la porción más pequeña de la pasta de sebo en una superficie de trabajo ligeramente enharinada hasta que sea apenas más grande que la parte superior del recipiente de budín.", "Cepille el borde del cuenco flan con leche con un poco del huevo batido. Cubra el recipiente con leche con esta \\\"tapa\\\" de pastelería, presionando los bordes de la masa para sellarla. Recorta cualquier exceso.", "Cepille la tapa del pastel con un poco más de huevo batido.", "Repite el proceso con el resto de la pasta de sebo y la mezcla de relleno hasta que hayas preparado ocho budines individuales y se haya agotado toda la carne (reserva cualquier salsa de vino tinto sobrante).", "Envuelva cada cuenco de budín con fuerza en dos hojas de papel de aluminio.", "Prepare un vaporizador lo suficientemente grande como para contener todos los recipientes de budín (alternativamente, cocine los budines por tandas). Cueza al vapor los budines durante 25-30 minutos o hasta que estén cocidos.", "Mientras tanto, para las papas parmentier, hierva las papas, enteras y en sus pieles, en una sartén grande con agua con sal durante 18-20 minutos, o hasta que estén tiernas. Escurrir bien y reservar para enfriar. Una vez que esté frío, quite las cáscaras y corte las papas en cubos de 1cm / ½. Dejar de lado para enfriar, luego enfriar en la nevera.", "Calentar la mantequilla en una sartén a fuego medio. Agregue las papas fritas en dados y fría por 3-4 minutos, o hasta que estén doradas por todos lados. Sáquelo del fuego y apártelo.", "Mientras tanto, para los riñones, caliente una cucharada de aceite en una sartén a fuego medio. Agregue la cebolla, el apio y la zanahoria y fría por 4-5 minutos, o hasta que se ablanden.", "Agregue el ajo y el tomillo y fría por otros 1-2 minutos.", "En una sartén separada, caliente la cucharada restante de aceite de oliva a fuego medio. Agregue los riñones y cocine por 5-6 minutos, o hasta que se dore.", "Agregue los riñones dorados a la sartén con las verduras que contiene.", "Agregue el jerez a la sartén en la que se cocinaron los riñones y cocine a fuego lento, raspando los trozos dorados del fondo de la sartén con una cuchara de madera para desglasar. Agregue los jugos de jerez y sartén a las verduras y los riñones y revuelva bien para combinar. Continúe cocinando durante 1-2 minutos más.", "Agregue la crème fraîche y caliente. Sazonar, al gusto, con sal y pimienta negra recién molida. Revuelva en el perejil. Mantener caliente", "Para el queso de coliflor, hierva las flores de coliflor en una sartén durante 4-5 minutos, o hasta que estén tiernas. Escurra bien y seque con papel de cocina.", "Transfiera las flores de coliflor a un procesador de alimentos. Agregue la crema y mezcle hasta obtener un puré. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Regrese la mezcla a una sartén limpia y caliente a fuego lento. Agregue el queso hasta que se derrita.", "Para los guisantes, hierva los guisantes en una olla con agua hirviendo hasta que estén tiernos. Escurrir bien y devolver los guisantes a la sartén. Agregue el orégano y la mantequilla. Sazonar, al gusto, con sal y pimienta negra recién molida. Aplastar ligeramente con un triturador de papas. Apartar y mantener caliente.", "Justo antes de servir, caliente la salsa de vino tinto restante en una sartén hasta que se caliente.", "Cuele la salsa a través de un colador fino. Agregue un poco de mantequilla al líquido filtrado y revuelva hasta que se derrita.", "Para servir, desenvuelva un pudín de sebo de ternera y gírelo fuera de su molde y en un plato de servir. Cucharee algunos de los riñones al costado. Presione una porción de los guisantes triturados en un anillo de chefs y quite el anillo. Con una cuchara, mezcle el puré de coliflor y las papas parmentier. Rocíe la salsa de vino tinto."]}, {"isVegetarian": false, "title": "Carne de res 'cortada'", "url": "www_bbc_co_uk_food_recipes_beeftagliata_87876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 ml / 11 fl oz salsa de soja", "1 chile rojo, más o menos picado", "3 dientes de ajo, toscamente picados", "110ml / 4fl oz de aceite de girasol", "Filete de res 1,35 kg / 3lb, recortado", "1 manojo de cilantro", "6 cucharadas de salsa de soja", "1 cucharada de raíz de jengibre, finamente picada", "1 chile rojo, finamente picado", "2 dientes de ajo, finamente picados", "½ limón, solo jugo", "1 cucharada de salsa de pescado tailandesa", "1 cucharada de azúcar moreno claro", "4 cucharadas de hojas de cilantro, picadas", "4 puñados grandes de hojas mixtas de invierno picante (como cohetes, mostaza Golden Streaks, mostaza Purple Osaka, Treviso, achicoria o Variegata del Castelfranco), refrescados en agua fría y secos"], "serves": "Sirve 8", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Para la carne, coloque la salsa de soja, el chile, el ajo y el aceite en una licuadora o procesador de alimentos y mezcle hasta que quede suave.", "Coloque la carne en un recipiente no reactivo y vierta el adobo sobre la carne. Cubra con una película adhesiva y deje la carne de res marinada durante varias horas o durante la noche en la nevera. Convierta la carne en el adobo de vez en cuando. Cuando esté listo para cocinar, retire la carne de la nevera y llévela a temperatura ambiente.", "Precalentar el horno a 220C / 430F / Gas 7.", "Caliente una sartén grande a prueba de horno hasta que esté caliente, levante con cuidado la carne del marinado (descartando la marinada), coloque la carne en la sartén y frótela en cada lado hasta que se dore. Coloque en el horno y tueste durante 20-25 minutos.", "Retire la carne del horno y deje que se enfríe en la sartén.", "Para la ensalada, coloque la salsa de soja, el jengibre, el chile, el ajo, el jugo de limón, la salsa de pescado y el azúcar en un tazón y bata para combinar.", "Para servir, acomode las hojas en un plato. Cortar finamente el filete de carne y colocarlo sobre las hojas de la ensalada. Rocíe con el aderezo y sirva."]}, {"isVegetarian": false, "title": "Tagliata de ternera con jerseys calientes triturados", "url": "www_bbc_co_uk_food_recipes_beeftagliatawithcras_83002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 reyes pequeños de Jersey u otras papas nuevas, restregadas", "aceite de oliva, para lloviznar", "1 cucharadita de semillas de comino", "1 cucharada de ramitas de tomillo", "sal y pimienta negra recién molida", "2 ramas de tomates pequeños en la vid", "½ cucharadita de sal marina", "½ cucharadita de pimienta negra agrietada", "1 cucharadita de agujas de romero picadas", "2 filetes de costilla 200 g / 7oz, aproximadamente 2 cm de grosor", "aceite de oliva, para cepillar", "Hojas de cohete de 100g / 3½oz", "1 cucharada de aceite de oliva", "1 limón, descuartizado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Cocine las papas en agua hirviendo con sal durante 15 minutos o hasta que estén tiernas, luego escurra.", "Coloca en una bandeja para hornear y aplasta cada patata con un triturador de papas. Rocíe con aceite de oliva, esparza con semillas de alcaravea, tomillo, sal y pimienta negra recién molida y hornee en el horno junto con los tomates durante 30 minutos o hasta que estén muy crujientes y dorados, quitando los tomates cuando estén suaves.", "Para los filetes, mezcle la sal marina, la pimienta y el romero en un plato. Cepille los filetes con aceite de oliva y presione en el condimento en ambos lados.", "En una sartén, dore los filetes en un lado hasta que estén dorados, luego gírelos una vez y cocínelos brevemente para obtener un resultado medio raro. Reservar para descansar", "Para servir, arroja el cohete con el aceite de oliva. Cortar el bistec en los dedos, acomodarlo en un plato grande, esparcir los tomates asados ​​y los cuartos de limón, y servir con las patatas y el cohete."]}, {"isVegetarian": false, "title": "Buey Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_2063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefwellington_2063_16x9.jpg", "ingredients": ["1 pedazo de filete de res - aproximadamente 1.35kg / 3lb", "un poco de aceite de oliva", "15 g / ½ oz de mantequilla sin sal", "sal y pimienta", "175g / 6oz de paté de hígado de pollo", "4 compras compró panqueques", "1 huevo pequeño de granja, golpeado", "55g / 2oz de mantequilla sin sal", "Chalotes de 150g / 5oz, pelados y finamente cortados en cubitos", "250 g / 9 oz de champiñones planos negros, picados", "3 cucharadas de crema doble", "sal y pimienta", "1 paquete comprado en la tienda, listo laminados (todos mantequilla) hojaldre"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite y la mantequilla en una sartén antiadherente, cuando caliente agregue la carne sazonada y el sello en los lados. Retire de la sartén y deje enfriar por completo.", "Para hacer el relleno duxelle, en la misma sartén agregue la mantequilla y cuando", "caliente y espumoso, agregue los chalotes y cocine hasta que estén suaves y dorados. Agregue los champiñones y cocine hasta que todo el líquido se evapore.", "Agregue la crema, sal y pimienta. Continúe calentando suavemente hasta que se reduzca a un puré espeso. Dejar de lado para enfriar por completo.", "precaliente el horno a 230C / 450F / Gas8.", "Ruede la masa para que se ajuste a la carne y coloque dos de los panqueques en la parte superior, ligeramente superpuestos. Extienda una tira de paté de hígado de pollo en el centro de los panqueques, del mismo ancho que el filete de res.", "Haz un corte alrededor de ¾ del camino a través de la carne en el centro del filete de res y llénalo con la mezcla de duxelle enfriada. Coloque la carne en los panqueques y cubra con los dos panqueques restantes. Corta el medio de los extremos de la masa. Dobla la parte principal de la carne y luego dobla los extremos con cuidado.", "Cepille los bordes con un poco de agua. Coloque el lado de la costura hacia abajo en una bandeja grande para hornear. Decore la parte superior con masa adicional si lo desea y luego cepille todo con el huevo batido.", "Colóquelo en el horno por 10 minutos, luego reduzca el calor a 190C / 375F / Gas 5 y continúe cocinando por otros 20 minutos, hasta que la masa esté dorada.", "Retire del horno a una tabla de cortar y deje reposar durante 5 minutos antes de tallar en rodajas gruesas."]}, {"isVegetarian": false, "title": "Taquitos de carne", "url": "www_bbc_co_uk_food_recipes_beeftaquitos_83669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla grande, finamente rebanada", "2 dientes de ajo, pelados y finamente picados", "Filete de solomillo de 500 g / 1 lb 2 oz, cortado en cubos de 1 cm / ½ en", "1 cucharadita de orégano seco", "1 cucharadita de comino molido", "1 cucharadita de azúcar en polvo", "3 cucharadas de puré de tomate", "sal y pimienta negra recién molida", "100ml / 3½fl oz de caldo de carne", "2 cucharadas de cilantro fresco picado", "8 tortillas de harina listas para usar", "250g / 9fl oz de crema agria", "1 cucharadita de pimienta de cayena", "2 cucharadas de agua tibia", "3 cucharadas de cebolletas frescas picadas", "hojas de ensalada de su elección", "exprimir jugo de limón"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para los taquitos, caliente el aceite de oliva en una cacerola grande a fuego medio. Agregue la cebolla y el ajo y fría hasta que se ablanden.", "Agregue el bistec y fría por dos minutos, hasta que la carne comience a dorarse.", "Agregue el puré de orégano, comino, azúcar y tomate. Sazonar con sal y pimienta negra recién molida, mezclar bien y dejar cocinar un minuto más.", "Agregue el caldo de carne, lleve a ebullición y reduzca el fuego a fuego lento por otros 5-6 minutos, hasta que la salsa se espese y la carne esté bien cocida.", "Agregue el cilantro y agregue.", "Llene el centro de cada tortilla de harina con la mezcla de carne y enrolle cada una como un cigarro grande. Coloque dos en cada uno de los cuatro platos.", "Para el aderezo, coloque la crema agria, la pimienta de cayena, el agua tibia y el cebollín en un tazón y mezcle bien.", "Para servir, rocíe el aderezo sobre los taquitos y sirva con una ensalada de jugo de limón de su elección."]}, {"isVegetarian": false, "title": "Buey Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_74657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg / 2lb 4 oz filete de res cortado en medio, cortado", "¼ racimo de tomillo, finamente picado", "sal marina y pimienta negra recién molida", "55 g / 2 oz de mantequilla", "1 diente de ajo, finamente picado", "Setas de campo plano de 500 g / 1 lb 2 oz, finamente picadas", "unas gotas de aceite de trufa", "1 cucharada de perejil finamente picado", "Mostaza inglesa, al gusto", "Hojaldre en bloque de 500 g / 1 lb 2 oz", "1 huevo, ligeramente batido, para sellar la masa", "mantequilla derretida, para glasear"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sazone la carne con el tomillo, la sal marina y la pimienta y descanse durante 30 minutos.", "Calentar una sartén y dorar cada lado de la carne hasta que se dore.", "Dejar enfriar a temperatura ambiente.", "Para los Duxelles, sude la mantequilla, el ajo y los champiñones en una sartén a fuego lento hasta que toda la humedad se evapore.", "Agregue el aceite de trufa y el perejil, y sazone al gusto.", "Retirar del fuego y dejar enfriar a temperatura ambiente.", "Unta la carne con una capa uniforme de mostaza inglesa.", "Espolvoree ligeramente una hoja de papel para hornear con harina.", "Ruede la masa para que quede un poco más ancha que la carne de res, y la carne puede enrollarse completamente en masa.", "Coloque la masa para que la mitad más larga quede hacia usted.", "Extiende la mezcla de Duxelle en forma pareja sobre la mitad de la masa más cercana a ti.", "Coloque la carne encima de la mezcla de champiñones.", "Enrolla la carne en la masa, dejando una ligera superposición de 3 cm / 1 ¼ pulgadas. Cepille esto con huevo batido y sello.", "Recorte los extremos de la masa para que queden al ras con la carne.", "Corta una hoja de papel para hornear del tamaño de la carne Wellington.", "Coloque la carne Wellington en el papel, cepille ligeramente la parte superior con la mantequilla derretida y refrigere durante 30 minutos.", "Coloque la carne Wellington en el horno y cocine por 25 minutos o hasta que tenga un color dorado oscuro.", "Sirva con espinacas al vapor o vegetales asados ​​de su elección."]}, {"isVegetarian": false, "title": "Buey Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_87631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2lb filete de carne de vacuno de 2 oz, recortado", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "1 cucharada de hojas frescas de tomillo", "Paté de pato grueso 350g / 12oz", "2 cucharadas de mostaza inglesa", "250 g / 9 oz de hojaldre confeccionado", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de mantequilla"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Sazone la carne con la sal y la pimienta negra recién molida y espolvoree con el tomillo.", "Caliente una sartén grande hasta que esté muy caliente, luego rocíe con el aceite. Agregue la carne y cocine brevemente, volteándola de vez en cuando, hasta que se dore por todos lados.", "Retire la carne y déjela enfriar.", "Extiende la mostaza por toda la carne, luego extiende el paté de manera uniforme sobre un lado de la carne.", "Haga rodar la masa de hojaldre a las dimensiones que rodearán la carne de vaca para encerrarla por completo.", "Coloque la carne en la parte superior de la masa y enrolle para formar un paquete. Cepille los bordes con huevo batido y presione hacia abajo para sellar.", "Corte cualquier exceso de hojaldre superpuesto y cepille la carne Wellington con huevo batido. Transfiera a la nevera para enfriar por 30 minutos.", "Precaliente el horno a 200C / 400F / Gas 6. Coloque una bandeja para hornear en el horno para precalentar.", "Coloque la carne de res Wellington en una hoja de pergamino untado con mantequilla, luego transfiera a la bandeja de hornear caliente (para que la carne Wellington se cocine de manera uniforme).", "Transfiera al horno para hornear durante 30 minutos, hasta que la masa esté dorada y la carne esté cocida a su gusto. (Un termómetro de carne es una buena guía en este caso).", "Retire del horno y deje reposar durante cinco minutos, luego sirva en rodajas con las verduras elegidas."]}, {"isVegetarian": false, "title": "Carne de res Wellington con brócoli y jus púrpura", "url": "www_bbc_co_uk_food_recipes_beefwellingtonwithne_84172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 250g / 9oz", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4½floz de agua helada", "2 yemas de huevo de gallinas camperas, batidas, para lavar huevos", "2 huevos de gallinas camperas", "4 cucharadas de harina normal", "100ml / 3½ fl oz de leche", "botón de mantequilla", "25g / 1oz de mantequilla", "4 hongos Portobello, finamente picados", "250 g / 9 oz de hojas grandes de espinaca, blanqueadas", "Filete de carne de vacuno de 500 g / 1 lb 2 oz, sección media", "pimienta negra recién molida", "Pâté de hígado de pollo de 200 g / 7 oz", "Brócoli brotación brote 400g / 14oz", "2 cucharadas de aceite de oliva", "500ml / 18fl oz de caldo de carne", "150ml / 5fl oz de vino tinto"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro.", "Coloque la mantequilla y la sal en el pocillo y trabaje con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano.", "Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, agregue gradualmente el agua helada y mezcle hasta que esté todo incorporado, pero no trabaje demasiado la masa; debe tener un efecto marmoleado con la mantequilla sin mezclarla adecuadamente. .", "Enrolle la mezcla en una bola, envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enharine la superficie de trabajo y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas.", "Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba y sobre eso. Dale un cuarto de vuelta.", "Enrolle el bloque de masa en un rectángulo de 40x20 cm / 16x8 pulgadas como antes y vuelva a doblarlo en tres. Estos son los primeros dos turnos. Envuelva el bloque en una película adhesiva y refrigere durante 30 minutos.", "Dale a la masa helada otras dos vueltas, rodando y doblando como antes. Esto hace un total de cuatro giros. Envuelva la masa en una película adhesiva y refrigere durante al menos 30 minutos antes de usarla.", "Para los panqueques, coloque los huevos y la harina en un tazón y mezcle.", "Poco a poco agregue la leche, batiendo constantemente, para crear una mezcla suave que cubrirá la parte posterior de una cuchara.", "Calentar una sartén a fuego alto y agregar la mantequilla. Cuando la mantequilla esté espumosa, agregue un cucharón de la masa de panqueque y agite la sartén para cubrir uniformemente la base. Freír durante 1-2 minutos, o hasta que la parte inferior esté dorada. Con cuidado voltee el panqueque y cocine por un minuto más, o hasta que el panqueque esté completamente dorado y dorado. Deslice el panqueque en un plato forrado con papel resistente a la grasa, luego cúbralo con otra capa de papel. Repita con la masa de panqueques restante para hacer otro panqueque.", "Para la Duxelle, caliente la mantequilla en la sartén hasta que haga espuma, luego agregue los champiñones y fría por 3-4 minutos, o hasta que los champiñones estén dorados. Sazonar bien con sal y pimienta negra recién molida, luego reservar para enfriar.", "Para la carne Wellington, precaliente el horno a 200C / 400F / Gas 6.", "Sazone el filete de ternera con pimienta negra y luego colóquelo en una sartén a fuego alto. Gire el filete para asegurar una cocción pareja. Retire cuando esté dorado en cada lado y deje reposar en un lugar cálido.", "Estirar la masa de hojaldre hasta 5 mm / ¼ de grosor. Toma dos panqueques y colócalos en el centro de la masa y cúbrelos con una capa de paté de hígado de pollo, luego una capa de champiñones cocidos y luego una capa de espinaca encima.", "Batir el huevo batido y la yema de huevo juntos en un bol, luego pasar el huevo sobre el área despejada de los panqueques y la masa y doblar la masa para envolver la carne. Presione los extremos abiertos juntos para sellar la cubierta de repostería y hacer que se ajuste bien a la carne. Recorte cualquier exceso de pastelería.", "Coloque la carne de res Wellington con la costura hacia abajo en una bandeja para hornear forrada con papel de hornear y cepille con el huevo batido. Coloque en la nevera para enfriar durante 30 minutos.", "Retire de la nevera y cepille con huevo una vez más.", "Coloque en el horno y hornee durante 25 minutos (si no le gusta su carne de cocción rara durante 30-35 minutos para el medio), o hasta que la masa esté dorada, luego retírela y déjela reposar en un plato para servir durante 15 minutos. .", "Para el brócoli y el jus de brotación púrpura, coloque una olla grande de agua hirviendo sobre la placa. Una vez que hierva, coloque el brócoli en la sartén y cocine durante 3-4 minutos.", "Escurra el brócoli y caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el brócoli y cocine por 2-3 minutos.", "Coloque el caldo en una sartén y hierva para reducir el volumen a la mitad. Agregue el vino tinto y reduzca nuevamente a la mitad del volumen.", "Para servir, corte el Wellington en porciones y colóquelo en un plato con el brócoli y el jus."]}, {"isVegetarian": false, "title": "Carne de res con cebolla y pimiento verde", "url": "www_bbc_co_uk_food_recipes_beefwithonionandgree_70528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Carne asada o cordero asado a 340 g / 12 oz, cocido y sin hueso", "¼ cucharadita de pimienta negra recién molida", "¼ - ½ cucharadita de chile en polvo", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "¼ cucharadita de cúrcuma molida", "1 cucharadita de vinagre de vino tinto", "sal", "3 cucharadas de aceite vegetal", "½ cucharadita de semillas de comino", "½ cucharadita de semillas de mostaza negra o amarilla", "10 semillas de fenogreco (opcional)", "115 g / 4¼ oz de pimiento verde, sin semillas y cortado, longitudinalmente, en astillas de 3 mm", "Cebollas de 140g / 5oz peladas y cortadas en finas medias medias", "1 cucharadita de salsa Worcestershire"], "serves": "Sirve 3-4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cortar la carne cocida en rodajas de 5 mm. Apila unas rodajas juntas a la vez y corta en astillas de 5 mm. Esto no tiene que hacerse de manera uniforme.", "Combine la pimienta negra, el chile en polvo, el comino molido, el cilantro molido, la cúrcuma, el vinagre, ½ cucharadita de sal y 2 tb de agua en una taza pequeña. Mezcle y reserve.", "Pon el aceite en una sartén grande a fuego medio-alto.", "Cuando esté caliente, ponga las semillas de comino, mostaza y alholva.", "Tan pronto como las semillas de mostaza comiencen a reventar, pon el pimiento verde y la cebolla. Revuelva y fríe hasta que la cebolla se haya dorado un poco y la masa de verduras se haya reducido.", "Espolvoree aproximadamente 1/8 de cucharadita de sal por encima y revuelva.", "Agregue la carne y la mezcla de especias de la taza. Revuelva rápidamente con el mismo fuego medio-alto durante aproximadamente un minuto hasta que la carne se haya calentado completamente.", "Agregue la salsa Worcestershire y revuelva para mezclar."]}, {"isVegetarian": false, "title": "Carne de res con corteza de anacardo y salsa de champiñones silvestres", "url": "www_bbc_co_uk_food_recipes_beefwithcashewcrusta_85588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "Filete de res de 200 g / 7 oz", "sal y pimienta negra recién molida", "1 cucharada de mostaza integral", "50g / 2oz de pan rallado", "50g / 2oz anacardos, aproximadamente aplastados", "2 cucharadas de perejil fresco picado", "50g / 2oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 cm / ½ en pieza de jengibre fresco, finamente picado", "1 diente de ajo, finamente picado", "100 g / 3½ oz de champiñones silvestres", "dash salsa de soja", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de res con la corteza de anacardo, frote la carne con aceite de oliva y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno hasta que esté caliente y fría la carne durante 2 minutos por cada lado. Extiende la mostaza sobre la parte superior de la carne.", "Coloque las migas de pan, los anacardos y el perejil en un bol y mezcle bien. Presione esta mezcla sobre la carne cubierta de mostaza, luego transfiera al horno y hornee durante cinco minutos, o hasta que la masa esté dorada y la carne esté cocida a su gusto.", "Para la salsa de champiñones silvestres, caliente la mantequilla y el aceite en una sartén y fríe con cuidado la cebolla, el jengibre y el ajo hasta que estén suaves pero no coloreados.", "Agregue los champiñones silvestres y la salsa de soja y cocínelos hasta que los hongos se hayan ablandado. Agregue la crema, condimente, al gusto, con sal y pimienta negra recién molida y mezcle bien.", "Para servir, coloque la carne en un plato y rocíe sobre la salsa."]}]