[{"ingredients": ["1 cucharadita de especias en vinagre", "½ cucharadita de semillas de cilantro", "½ cucharadita de granos de pimienta", "250ml / 9fl oz de vinagre de arroz", "2 cucharaditas de azúcar", "2 palitos de apio, en rodajas finas", "1 langosta cocida, cáscara eliminada, cortada en trozos", "1 ramita de estragón pequeño, finamente picado", "3 cucharadas de mayonesa", "jugo de limón, al gusto", "sal y pimienta para probar", "2 rollos de brioche", "mantequilla, al gusto", "hojas de apio, para adornar (opcional)"], "method": ["Coloque las especias en vinagre, semillas de cilantro y granos de pimienta en una bolsa de muselina.", "En una sartén, caliente el vinagre, el azúcar y la bolsa de especias. Agregue el apio, cocine a fuego lento y retire del fuego. Deje que el apio se enfríe.", "Mezcle la langosta, el estragón, la mayonesa y el jugo de limón en un tazón. Retire el apio de los ingredientes decapantes y agréguelo al recipiente. Mezcle bien y agregue sal y pimienta al gusto.", "Extienda la mantequilla en los lados externos de los panecillos y tueste un poco con el soplete.", "Dividir los rollos por el centro y llenar con la mayonesa de langosta. Vístase con unas hojas de apio y sirva."], "url": "www_bbc_co_uk_food_recipes_lobster_rolls_14094", "title": "Rollos de langosta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 2 rollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5 oz de carne de cangrejo blanca fresca", "75 g / 3oz de carne de langosta cocida", "75g / 3oz de puré de papa cocido", "1 chile rojo, finamente cortado en cubos", "1cm / ½ en jengibre fresco, finamente rallado", "1 lima, jugo y ralladura solamente", "1 cilantro de racimo pequeño, finamente picado", "sal y pimienta negra recién molida", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, ligeramente golpeados", "Pan rallado panko de 50g / 2oz", "2 chiles rojos, finamente cortados en cubitos", "75g / 3oz de azúcar en polvo", "75ml / 3fl oz de vinagre de vino de arroz", "1 mango, pelado y finamente cortado en cubitos", "½ vaina de vainilla, dividida y sin semillas", "1 lima, solo jugo", "sal y pimienta negra recién molida", "75g / 3oz de mantequilla", "4 grandes pinzas de langosta cocidas", "1 pequeña lechuga rizada puñado", "1 pequeño puñado de lechuga", "1 pequeño puñado de berros hojas", "2 cucharadas de berro de coriandro", "aceite de oliva, para aderezar"], "method": ["Para las tortas de cangrejo y langosta, caliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque el cangrejo, la langosta, la papa, el chile, el jengibre, el jugo de limón y la ralladura en un bol y mezcle bien.", "Agregue el cilantro y sazone con sal y pimienta negra.", "Usando dos cucharas pequeñas, forme las quenelles de la mezcla, luego cubra cuidadosamente cada quenelle en la harina, luego el huevo batido y luego cubra en las migas de pan.", "Colóquelo suavemente en la freidora y fríalos hasta que estén dorados y calientes - aproximadamente dos minutos. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa de chile dulce, coloque los chiles, el azúcar, el vinagre y 25 ml / 1 fl oz de agua en una olla y llevar a ebullición.", "Reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que espese.", "Coloque en una licuadora de alimentos y mezcle con un puré, luego pase a través de un colador fino y deje enfriar.", "Para la ensalada, coloque la mitad del mango, las semillas de vainilla y el jugo de lima en un procesador de alimentos pequeño y mezcle con un puré, y luego pase a través de un colador fino en un recipiente.", "Verifique el condimento, agregue más lima, sal y pimienta negra, si es necesario.", "Caliente una sartén hasta que esté medianamente caliente, agregue la mantequilla y el calor hasta que se derrita, luego agregue la langosta y caliente, volteando hasta la mitad. Retire del fuego.", "Mezcle el resto del mango con todas las hojas en un tazón, aderezando con un poco de aceite de oliva, sal y pimienta negra.", "Para servir, coloque una cucharada de aderezo de mango en cada uno de los cuatro platos, luego rápidamente se extendió a través del plato.", "Cubra con un poco de ensalada y una pinza de langosta.", "Coloque unos pasteles de cangrejo y langosta alrededor del plato y luego termine con varias gotas de salsa de chile dulce."], "url": "www_bbc_co_uk_food_recipes_lobster_salad_with_thai_64088", "title": "Ensalada de langosta con cangrejo tailandés y tartas de langosta y salsa de chile dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 chiles rojos largos, sin semillas, finamente picados", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "2cm / ¾ en pieza galangal, picado (alternativamente, use raíz de jengibre)", "1 tallo de limoncillo, finamente picado", "2 cucharadas de raíces de cilantro", "2 hojas de lima kaffir", "¼ cucharadita de pasta de camarón", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "½ cucharadita de pimentón", "200ml / 7fl oz de leche de coco", "1 cucharada de salsa de pescado", "1 cucharada de pasta de tamarindo", "1 lima, solo jugo", "1 cucharadita de azúcar de palma", "2 langostas cocidas, sin carne", "2 cucharadas de berro de coriandro", "2 cucharadas de mantequilla sin sal", "2 dientes", "1 palito de canela, partido en dos", "250g / 9oz de arroz basmati"], "method": ["Para la pasta, coloque todos los ingredientes en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para el curry tailandés de langosta, caliente un wok, luego agregue la pasta y cocine por 2-3 minutos.", "Agregue las hojas de lima, pasta de camarones, comino, cilantro y pimentón. Cocine por un minuto.", "Agregue la leche de coco, la salsa de pescado, el tamarindo, el jugo de lima y el azúcar de palma.", "Mientras tanto, retire la carne de la langosta y pique la carne, dejando la pinza intacta.", "Agregue la langosta al wok y cocine hasta que la langosta esté caliente. Reduzca el fuego y deje que el curry hierva a fuego lento hasta que esté listo para servir.", "Mientras tanto, para la mantequilla de arroz basmati, caliente una olla mediana y agregue una cucharada de mantequilla.", "Una vez que la mantequilla se haya derretido, agregue los dientes de ajo y la canela y cocine por un minuto. Agregue el arroz y suficiente agua para cubrir.", "Cubra con una tapa y baje la temperatura a la configuración más baja y cocine durante 20 minutos. Apague el fuego y deje la tapa encendida hasta que esté listo para servir.", "Justo antes de servir, revuelva la mantequilla restante a través del arroz.", "Para servir, sirva el arroz en un tazón junto con el curry de langosta, cubierto con berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_lobster_thai_curry_with_47060", "title": "Curry tailandés de langosta con mantequilla de arroz basmati y berro de coriandro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5kg / 3lb 5 oz de langosta entera cocida, cortada a la mitad, sin carne, con cáscaras limpiadas y reservadas", "50g / 1¾oz de mantequilla", "2 chalotes, finamente picados", "125ml / 4fl oz de vino blanco", "500ml / 18fl oz de caldo de pescado", "Crema doble 250ml / 9fl oz", "1 cucharadita de mostaza Dijon", "100g / 3½oz de champiñones, limpios", "2 cucharadas de perejil de flatleaf tostado", "exprimir jugo de limón", "Parmesano rallado 25g / 1oz", "2 yemas de huevo de gallinas camperas", "25g / 1oz de pan rallado fresco", "4 papas King Edward, peladas y cortadas en cerillas", "aceite vegetal, para freír", "sal marina y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta. Coloque las cáscaras de langosta en una bandeja grande para hornear y déjelas a un lado.", "Caliente la mitad de la mantequilla en una sartén a fuego medio hasta que forme espuma. Freír los chalotes durante 3-4 minutos, hasta que estén blandos.", "Vierte el vino y lleva la mezcla a ebullición. Cocine a fuego lento hasta que el volumen de líquido se haya reducido a la mitad, luego agregue el caldo y continúe cocinando a fuego lento hasta que se reduzca ligeramente. Agregue la crema doble y la mostaza y cocine a fuego lento de nuevo durante 3-4 minutos, hasta que espese un poco.", "Mientras tanto, caliente la mantequilla restante en una sartén separada a fuego medio. Agregue los champiñones y fríalos durante 2-3 minutos, hasta que se suavicen. Transfiera a un recipiente y sazone bien con sal y pimienta.", "Cuando la salsa se haya reducido, agregue los champiñones y la carne de langosta y revuelva. Agregue el perejil, el jugo de limón y la mitad del parmesano y sazone de nuevo.", "Agregue las yemas de huevo y continúe cocinando la mezcla a fuego lento durante 1-2 minutos, hasta que espese.", "Divida la carne y la salsa de la langosta entre las cáscaras de la langosta, luego espolvoree sobre el pan rallado y el queso parmesano restante.", "Mientras tanto, caliente el aceite vegetal en una freidora a 190C. Alternativamente, caliente el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido).", "Con cuidado, baje las papas desmenuzadas en el aceite caliente y fría por 4-6 minutos, o hasta que estén tiernas y doradas. Retire y escurra sobre papel de cocina.", "Mientras tanto, ase a la parrilla el termidor de la langosta por 3-4 minutos, o hasta que el relleno esté crujiente y dorado.", "Sirva las mitades de la langosta en platos con una pila de papas fritas al lado."], "url": "www_bbc_co_uk_food_recipes_lobster_thermidor_16349", "title": "Langosta Thermidor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas cocidas", "75g / 3oz de mantequilla", "1 cebolla, más o menos picada", "1 zanahoria, más o menos picada", "4 ramitas de tomillo fresco", "1 cucharada de puré de tomate", "75ml / 3fl oz de vino blanco", "500ml / 18fl oz de caldo de pescado", "sal y pimienta negra recién molida", "400g / 14oz de espagueti", "6 cucharadas de aceite de oliva", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "4 tomates, pelados, sin semillas, cortados en cubitos", "sal y pimienta negra recién molida", "3 cucharadas de albahaca fresca picada, más hojas pequeñas para decorar"], "method": ["Para la sopa, corte las langostas cocidas a la mitad y retire la carne. Pica la carne de langosta, excepto la carne de la garra, en pedazos de 2cm / R en pedazos. Reserve la carne de garra y las cáscaras de langosta, y mantenga todo en la nevera hasta que lo necesite.", "Caliente la mitad de la mantequilla en una sartén hasta que haga espuma, agregue la cebolla, la zanahoria y el tomillo y cocine por 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Agregue las cáscaras de langosta reservadas y el puré de tomate y cocine por un minuto más, revolviendo bien.", "Agregue el vino blanco y cocine hasta que se reduzca en volumen a la mitad.", "Agregue el caldo de pescado, lleve la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10 minutos, hasta que el líquido se haya reducido y espesado un poco.", "Quite el fuego y deje que se enfríe un poco, luego mezcle en tandas en un procesador de alimentos para hacer un puré.", "Cuele la sopa de puré a través de un colador en una olla limpia y mezcle con la mantequilla restante.", "Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para los espaguetis, ponga a hervir un sartén grande de agua con sal, agregue los espaguetis y cocine de acuerdo con las instrucciones del paquete.", "Escurra los espaguetis, reservando un poco del agua de cocción y reserva.", "Mientras tanto, caliente el aceite de oliva en una sartén y agregue los chalotes y el ajo y cocine durante dos minutos.", "Agregue la carne de langosta picada y el tomate picado y caliente.", "Sazone con sal y pimienta negra recién molida y luego agregue la albahaca, los espaguetis, el agua de cocción reservada y un par de cucharones de sopa. Mezcle. (Guarde la sopa de langosta restante para usar en otros platos).", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y la carne de garra de langosta reservada y cocine durante 1-2 minutos en cada lado.", "Para servir, amontone los espaguetis en tazones para servir y cubra con una sola pinza de langosta cada una y algunas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_lobster_tomato_and_basil_97507", "title": "Espagueti de langosta, tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de mantequilla suave", "2 cucharadas de aceite de colza", "50g / 2oz de jamón de Parma, finamente picado", "100g / 3½ oz champiñones, finamente picados", "3 dientes de ajo, finamente picados", "Chalotes de 100 g / 3½ oz, finamente picados", "100g / 3½ oz de hinojo, finamente picado", "1 cucharada de perejil fresco finamente picado", "1 cucharada de estragón fresco picado", "1 cucharada de mostaza Pommery", "1 cucharada de pan rallado seco", "1 coral de langosta cocido", "2 cucharadas de almendras molidas", "2 langostas cocidas enteras", "50g / 2oz de mantequilla", "200 g / 7 oz de samphire"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la mantequilla en un procesador de alimentos y mezcle hasta que quede esponjoso y blanco.", "Caliente una sartén grande y agregue el aceite. Una vez caliente agregue el jamón de Parma, champiñones, ajo, chalotes, hinojo y hierbas y cocine durante 2-3 minutos. Dejar enfriar.", "Agregue la mezcla enfriada a la mantequilla mezclada junto con la mostaza, el pan rallado, el coral cocido de langosta y las almendras molidas. Mezcle bien y enrolle la película adhesiva en forma de tronco y colóquela en el refrigerador.", "Escalde la langosta en agua con sal por 1½ minutos, luego córtela por la mitad.", "Retire la carne de las garras, los nudillos y las colas, reservando las conchas del cuerpo con tacto. Coloque la carne de nuevo en la media concha y en una bandeja de horno.", "Desenvuelve la mantequilla de hierbas y corta en ocho rondas. Coloque dos rebanadas de mantequilla en cada mitad de la langosta. Hornee las langostas en el horno durante 4-5 minutos, hasta que estén calientes y burbujeantes.", "Mientras tanto, para el hinojo, caliente una sartén mediana y agregue la mantequilla. Una vez derretido agregue el hinojo y cocine por un par de minutos."], "url": "www_bbc_co_uk_food_recipes_lobster_with_escargot_84055", "title": "Langosta con mantequilla de escarola", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de sal marina", "1 ramita de tomillo", "6 granos de pimienta blanca", "1 hoja de laurel", "1 limón", "4 langostas vivas de 450 g / 1lb", "50g / 1¾oz de mantequilla", "450g / 1lb de papas nuevas", "sal y pimienta negra recién molida", "1 cucharadita de mostaza inglesa", "2 cucharadas de vinagre de vino blanco", "4 cucharadas de aceite de oliva", "4 cucharadas de aceite vegetal", "4 pequeñas gemas de lechuga, lavadas y partidas por la mitad", "1 gran manojo de berros, lavado", "225g / 8oz de mantequilla", "1 chalote, finamente picado", "4 dientes de ajo, aplastados", "12 buccinos cocidos, cortados en dados pequeños", "6 cucharadas de perejil picado"], "method": ["Ponga las langostas en el congelador durante dos horas para ponerlo en un estado tórpido. Pon a hervir una olla grande de agua. Agregue la sal, el tomillo, los granos de pimienta blanca y la hoja de laurel. Cortar el limón por la mitad, exprimir el jugo en la sartén y luego agregar las mitades de limón.", "Empuje la punta de un cuchillo grande, afilado, pesado o pincho en las langostas en el punto donde una cruz se forma en la concha en su parte posterior, luego baje al agua hirviendo y vuelva a hervir. Hervir durante cinco minutos, luego retire la sartén del fuego. Deja las langostas en el agua durante otros cinco minutos, luego retíralas de la sartén y ponlas a un lado para que se enfríen.", "Cocine suavemente las papas en agua hirviendo durante 10-15 minutos hasta que estén tiernas. Escurrir y sazonar con sal y pimienta.", "Cortar las langostas por la mitad a lo largo. Saque la carne de la cola, corte por la mitad a lo largo otra vez y quite el tracto intestinal. Quítese las garras, quitando la carne, dejando la carcasa entera y limpia.", "En una sartén, derretir la mantequilla y calentar suavemente a través de la carne de langosta.", "Para la mantequilla de ajo, derrita la mantequilla en una sartén a fuego lento. Suavemente fría la chalota y el ajo sin dorarlos, luego agregue la carne de whelk. Cuando se haya calentado, agregue el perejil.", "Para terminar la ensalada, mezcle la mostaza y el vinagre en un bol, mezcle los aceites y sazone.", "Viste la mitad de las pequeñas gemas en el tazón de servir. Triture las lechugas restantes, mezcle con el berro y agregue al recipiente para servir (no lo vista hasta que lo sirva).", "Cuando esté listo para servir, ponga la carne de las garras en el espacio para la cabeza de las conchas y la de la cola en las conchas.", "Pon las langostas en platos. Coloque las papas en el medio de los platos, vierta la mantequilla de ajo sobre las langostas y sirva con la ensalada."], "url": "www_bbc_co_uk_food_recipes_lobster_with_garlic_36735", "title": "Langosta con mantequilla de ajo, patatas nuevas y ensalada de berros", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas de 225 g / 8 oz", "2 cucharaditas de aceite de sésamo", "2cm / 1 en jengibre fresco de raíz, pelado y finamente picado", "8 cebolletas, cortadas y picadas", "4 pak choi, hojas separadas", "4 cucharadas de salsa de soja", "pizca de pimienta blanca", "pizca de azúcar en polvo", "4 cucharadas de vinagre de arroz o vino de arroz", "100 ml / 3½ fl oz de caldo de pollo"], "method": ["Congele las langostas por 2 horas antes de cocinar. Trabajando rápidamente, tome la primera langosta, corte la cabeza con un cuchillo afilado, luego corte inmediatamente la cola por el centro. Retire la carne del caparazón. Repita con la segunda langosta. Corta cada una en 6-8 piezas. Reserve y limpie el caparazón para servir.", "Caliente un wok o saltee la sartén a fuego alto. Agregue la mitad del aceite de sésamo. Una vez caliente, freír la langosta durante 1 minuto, luego transferirla a un plato caliente.", "Agregue el resto del aceite de sésamo a la sartén. Freír el jengibre, la mitad de las cebolletas y el pak choi hasta que se suavicen. Regrese la langosta a la sartén y agregue los ingredientes restantes. Cubra con una tapa y cocine a fuego lento durante 1 minuto.", "Llena las conchas con la carne. Divida entre los platos y decore con las cebolletas reservadas."], "url": "www_bbc_co_uk_food_recipes_lobster_with_ginger_and_31721", "title": "Langosta con jengibre y cebolletas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 500 g / 1 libra de langosta de 2 oz", "150ml / 5fl oz de vino blanco, más un toque", "300ml / 11fl oz de caldo de pescado", "50g / 2oz de mantequilla", "85g / 3oz de carne de vieira", "1 huevo blanco de corral", "Crema doble 80ml / 3fl oz", "100 g / 3½ oz de carne de langosta cocida, cortada en cubitos", "picar hierbas frescas picadas", "1 paquete de envolturas de wonton", "2 yemas de huevo de gallinas camperas", "botón de mantequilla", "250g / 9oz de orach silvestre (puedes usar espinacas)", "Crema doble 110ml / 4fl oz", "puñado de mar purslane"], "method": ["Cocine la langosta en una olla grande de agua hirviendo durante 3-4 minutos, luego retire la langosta de la olla.", "Retire las garras y regréselas al agua hirviendo por un minuto extra.", "Caliente una sartén a prueba de horno, agregue la langosta, las pinzas de langosta y el vino blanco, cubra con un círculo de papel resistente a las grasas y cocine por 1-2 minutos. Gire la langosta y las pinzas de langosta, luego cocine durante 1-2 minutos más.", "Retire la langosta de la sartén y corte la cola en pedazos, con la cáscara todavía encendida. Rompe las garras y los nudillos y quita la carne. Picar la carne de langosta y dejar de lado.", "Cortar la cabeza y las conchas de garra reservadas y volver a la sartén con el vino blanco. Agregue el caldo de pescado, cubra con una tapa y cocine a fuego lento durante 5-10 minutos.", "Cuele el caldo a través de un colador, presionando las cáscaras con un cucharón para exprimir todos los jugos. Regrese el caldo al fuego y cocine a fuego lento.", "Continúe cocinando hasta que el volumen del caldo se haya reducido en tres cuartas partes. Agregue la mantequilla, un poco de vino y sazónese, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para los tortellini de langosta, mezcle la carne de vieira con una buena pizca de sal en una licuadora o procesador de alimentos hasta que quede suave; luego agregue la clara de huevo y mezcle hasta que quede suave. Gradualmente mezcle la crema.", "Agregue la carne y las hierbas de la langosta y deje enfriar en la nevera durante 15 minutos.", "Para hacer los tortellini, coloque una envoltura wonton sobre una tabla de cortar y coloque una cucharadita de la mezcla de langosta en el centro. Cepille los bordes con el huevo batido y doble para formar un triángulo.", "Recorte un semicírculo con un cortador redondo de 10 cm / 4 in. Envuelva los bordes del semicírculo alrededor de su dedo índice y únalos con un poco más de huevo batido.", "Repita con la mezcla restante y envoltorios de wonton.", "Para servir, caliente tres cuartas partes de la salsa de langosta hasta que hierva y cocine los tortellini durante 3-4 minutos, o hasta que estén tiernos. Retire con una espumadera y déjela a un lado, luego agregue los trozos de cola de langosta reservados a la salsa y caliente.", "Mientras tanto, caliente la mantequilla en una sartén y fría el orach (o espinaca) por 1-2 minutos, o hasta que se marchite. Retire el orach de la sartén y déjelo a un lado. Agregue la crema a la sartén y continúe cocinando hasta que se reduzca ligeramente. Picar el orach, remover en la crema y sazonar, al gusto, con sal y pimienta negra recién molida.", "Mezcle la salsa de langosta restante con una batidora de mano para crear una espuma.", "Coloque la cola de la langosta en platos para servir y coloque un poco de orach al lado. Coloque los tortellini en una cuchara pequeña al lado del orach, rocíe sobre la salsa y la espuma y espolvoree sobre la verdola marina."], "url": "www_bbc_co_uk_food_recipes_lobster_with_lobster_74162", "title": "Langosta con tortellini de langosta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta linguini seca 400g / 14oz", "3 cucharadas de aceite de oliva", "1 cebolla roja, pelada y finamente picada", "1 x 415 g / 14½ oz de langosta", "1 cucharada de brandy o Pernod", "2 tomates maduros, sin semillas y finamente picados", "100ml / 3½ fl oz crema doble", "sal marina y pimienta negra recién molida", "2 dientes de ajo picados", "1 chile rojo largo, sin semillas y finamente picado", "2 x 170 g / 6 oz pueden carne de cangrejo blanco, drenado y en copos", "2 cucharadas de perejil de flatillo picado"], "method": ["Cocine la pasta en agua hirviendo con sal según las instrucciones del paquete, o hasta que esté cocida (al dente).", "Mientras la pasta se cocina, caliente una cucharada de aceite de oliva en una cacerola.", "Agregue la cebolla y cocine durante unos cinco minutos, hasta que se suavice, pero no se dore.", "Vierta la sopa y brandy o Pernod y deje que hierva. Reduzca el fuego a fuego lento durante 5-6 minutos, o hasta que el líquido se haya reducido en un tercio.", "Agregue los tomates, la crema y sazone con sal y pimienta. Cocine por 3-4 minutos, hasta que los tomates se hayan suavizado.", "Mientras tanto, caliente las dos cucharadas restantes de aceite de oliva en una sartén. Agregue el ajo y el chile y fría por 1-2 minutos, hasta que se ablanden.", "Agregue la carne de cangrejo y mezcle en la sartén hasta que se caliente. Sazonar con sal y pimienta negra recién molida y agregar el perejil.", "Escurrir la pasta y agregar a la salsa de langosta.", "Para servir, divida la pasta y la salsa entre cuatro platos o cuencos y esparza la mezcla de cangrejo picante sobre la parte superior de cada uno."], "url": "www_bbc_co_uk_food_recipes_lobsterandcrablingui_83673", "title": "Linguine de langosta y cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas cocidas 750g / 1½lb", "16 langostinos, cocidos y pelados", "150ml / 10fl oz de caldo de pescado", "Crema doble 110ml / 4fl oz", "90ml / 3½ fl oz de champán", "40g/1½oz avruga caviar", "50g / 2oz de mantequilla", "Setas de trompeta negras de 110 g / 4 oz, limpiadas y rotas en tiras", "sal y pimienta negra recién molida", "Espinaca de la hoja del bebé 200g / 7oz", "4 cucharadas de pan rallado japonés (disponible en comestibles asiáticos)", "Queso Gruyère 20 g / 1 oz, rallado", "aceite vegetal, para freír", "2 papas para hornear grandes, peladas y cortadas en tiras de ½ cm", "sal y pimienta negra recién molida", "200g / 7oz de judías verdes, recortadas", "75g / 3oz de mantequilla"], "method": ["Precalentar la parrilla a alto.", "Para la langosta, corte la langosta por la mitad y retire la carne de las garras y la cola. Dejar de lado con los langostinos. Quite cualquier materia de la cabeza y deséchela, reservando las conchas.", "Coloque el caldo de pescado en una sartén y lleve a ebullición. Cocine durante 10-15 minutos, o hasta que el líquido se reduzca a la mitad, luego agregue la crema y hierva a fuego lento por otros 10-15 minutos, o hasta que se reduzca nuevamente a la mitad.", "Agregue el champán y cocine por 2-3 minutos, revuelva bien, luego mezcle el caviar, la langosta y la langostinos para calentar.", "Mientras tanto, derrita la mitad de la mantequilla en una sartén y agrega los champiñones. Freír por 2-3 minutos, o hasta que se ablanden. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente la mantequilla restante en una sartén limpia, luego agregue las espinacas y cocine durante 1-2 minutos, o hasta que se marchiten.", "Ponga un poco de espinaca en el fondo de cada caparazón de langosta, seguido de los champiñones, terminando con la langosta y la mezcla de langostinos. Espolvorea sobre las migas de pan y ralla Gruyère. Coloque en una bandeja para asar fijada debajo de la parrilla y cocine por 2-3 minutos, o hasta que la cobertura esté dorada y burbujeante.", "Para las verduras, caliente una freidora a 190 ° C / 375 ° F. Alternativamente, llene a medias un sartén de espesor grueso con el aceite vegetal y caliente hasta que un cubo de pan caiga en chispas y se vuelva dorado en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír las tiras de patata en el aceite durante 4-5 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina, luego sazone con sal.", "Ponga a hervir una cacerola de agua con sal, agregue los frijoles y cocine por 3-4 minutos o hasta que estén tiernos. Escurrir, volver a la sartén y mezclar con la mantequilla y sazonar con sal y pimienta negra recién molida.", "Para servir, coloque las mitades de la langosta en dos platos para servir, y coloque las papas fritas y las judías verdes al lado."], "url": "www_bbc_co_uk_food_recipes_lobsterandlangoustin_90597", "title": "Langosta y langostinos con salsa de champán, papas fritas finas y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 dientes de ajo picados", "1 chile verde, picado", "200g / 7oz de tomates baby plum, cortados a la mitad", "1 cucharada de perejil de flatleaf fresco picado", "100ml / 3½fl oz de vino blanco", "1 cola de langosta cocida, picada", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "Linguine 250g / 9oz, cocinado según las instrucciones del paquete y escurrido", "cuñas de lima, para adornar"], "method": ["Calentar el aceite de oliva en una sartén grande, agregar el ajo y el chile y freír a fuego lento durante 1-2 minutos.", "Agregue los tomates, el perejil y el vino y cocine a fuego lento durante 3-4 minutos. Agregue la langosta y cocine por dos minutos. Agregue el cebollín y sazone bien con sal y pimienta negra recién molida.", "Agregue el linguini cocido a la sartén y revuelva para cubrir.", "Para servir, coloque el linguini en dos platos y decore con gajos de lima."], "url": "www_bbc_co_uk_food_recipes_lobsterchilliandtoma_85708", "title": "Linguine de langosta, chile y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1kg / 2lb 2 oz de langosta autóctona (azul de Dorset si es posible), cocida, sin carne extraída y partida en trozos", "2 yemas de huevo grandes de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza en polvo", "1 cucharadita de sal", "275ml / 10fl oz de aceite de colza", "pimienta negra recién molida, al gusto", "2 cucharadas de ketchup de tomate", "1 cucharadita de salsa Worcestershire", "1 cucharada de aguardiente", "¼ cucharadita de pimienta de cayena", "½ limón, solo jugo", "1 pimiento rojo, finamente cortado en cubitos", "1 pimiento amarillo, finamente cortado en cubitos", "2 cucharadas de cebollines, toscamente picados", "1 encurtido de eneldo, finamente cortado en cubitos", "1 berro de mostaza y cilantro", "2 rollos de brioche grandes"], "method": ["Para la mayonesa, coloque las yemas de huevo, el vinagre, la mostaza y la sal en un procesador de alimentos.", "Mezcle para combinar, luego, con el motor todavía en funcionamiento, agregue gradualmente el aceite de colza. Continúe hasta que se haya agregado todo el aceite y la mayonesa se haya espesado.", "Sazonar con pimienta negra y un poco más de sal si es necesario, al gusto.", "Para el aderezo, coloque la mayonesa y todos los demás ingredientes en un tazón y mezcle para combinar.", "Agregue la langosta y revuelva suavemente.", "Para servir, divide los panecillos por la mitad y coloca la ensalada de langosta en su interior. Cubra con berros de mostaza y sirva."], "url": "www_bbc_co_uk_food_recipes_lobsterrollwiththous_86520", "title": "Rollo de langosta con aderezo Thousand Island", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1x750g / 1½lb de langosta, cocida", "20g / ¾oz de parmesano fresco, rallado", "25g / 1oz de mantequilla", "1 chalote, finamente picado", "275ml / 10fl oz de caldo de pescado", "55ml / 2fl oz de vino blanco", "Crema doble 110ml / 4fl oz", "½ cucharadita de mostaza inglesa", "2 cucharadas de perejil picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "2 patatas grandes harinosas, cortadas en chips largos de 1.5cm / ½ in", "aceite vegetal, para freír"], "method": ["Precalentar la parrilla a fuego medio.", "Corta la langosta por la mitad y quita la carne de las garras, la cola y la cabeza. Dejar de lado. Picar la carne en trozos y colocar de nuevo en la cáscara.", "Para hacer la salsa, coloca la mantequilla en una sartén a fuego medio. Agregue los chalotes y cocine hasta que estén blandos. Vierta el caldo, el vino y la crema doble y deje que hierva. Reducir a la mitad, revolviendo ocasionalmente. Agregue la mostaza, las hierbas, el jugo de limón y sazone al gusto.", "Vierta la salsa sobre la carne de langosta. Espolvorear con queso parmesano. Grill durante 3-4 minutos hasta que estén doradas.", "Para hacer las virutas, caliente el aceite vegetal en una freidora a 140 ° C (PRECAUCIÓN: El aceite caliente es muy peligroso. No lo deje desatendido). Con cuidado, coloque las papas fritas y cocine durante 5-6 minutos o hasta que estén tiernas, sin color. Eliminar con una cuchara ranurada de metal. Encienda el fuego a 190C. Coloque las virutas de nuevo en el aceite caliente y fría por 3-4 minutos o hasta que estén doradas y cocidas. Retire con una cuchara ranurada de metal y escurra sobre papel de cocina. Sazone al gusto y sirva junto a la langosta."], "url": "www_bbc_co_uk_food_recipes_lobsterthermidor_73972", "title": "Langosta Thermidor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lobsterthermidor_73972_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chalotes de 25 g / 1 oz, en rodajas", "2 dientes de ajo, pelados", "200g / 7oz de mantequilla sin sal", "5 ramitas de tomillo", "1 hoja de laurel", "50ml / 2fl oz de aguardiente de sidra de Somerset, u otro aguardiente de sidra similar", "500ml / 17fl oz de caldo de pollo", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "4 pechugas de pollo de corral, cada una de 200 g / 7 oz", "sal y pimienta negra recién molida", "12 puntas de espárragos", "Habas descascadas de 100g / 3½oz", "mantequilla sin sal", "200g / 7oz de setas silvestres mezcladas", "200g / 7oz de hojas de espinaca baby"], "method": ["Primero prepara la salsa. Sudor los chalotes y el ajo en 25 g / 1 oz de la mantequilla, sin colorear. Agregue el tomillo, la hoja de laurel y el sudor por otros 2 minutos, luego agregue el brandy y reduzca hasta que el líquido casi haya desaparecido.", "Agregue el caldo de pollo y cocine para reducir a la mitad, luego agregue la crema. Agregue la mantequilla restante. Sazonar con sal y pimienta negra recién molida y dejar de lado.", "Para el pollo, sazone las pechugas de pollo con sal y pimienta negra recién molida, luego envuélvalas individualmente en una película adhesiva para ayudar a conservar su forma.", "Caliente una cacerola con agua hasta que hierva y cocine las pechugas de pollo durante 12-15 minutos o hasta que estén cocidas. Retire y deje reposar por 10 minutos.", "Cocine los espárragos y las habas por separado en agua hirviendo con sal hasta que estén tiernos; drenar y refrescar en agua helada. Cortar todas las puntas de espárragos a la misma longitud y pelar las habas para eliminar sus pieles duras.", "Desenvuelve las pechugas de pollo. Caliente un poco de mantequilla en una sartén, agregue el pollo y coloree lentamente la piel hasta que esté dorada y crujiente.", "Mientras tanto, freír los champiñones en un poco de mantequilla con sal y pimienta negra recién molida. Agregue los champiñones a la salsa junto con los espárragos y las habas y recaliéntelos. Freír rápidamente la espinaca con un poco de mantequilla, sal y pimienta negra recién molida, luego escurrir sobre una bandeja forrada con papel de cocina.", "Para servir, cortar cada pechuga de pollo en cinco rondas y colocar alrededor de los platos calientes. Coloque la espinaca en el medio. Agregue tres puntas de espárragos a cada plato, luego espolvoree los champiñones y las habas con un poco de salsa."], "url": "www_bbc_co_uk_food_recipes_localarkchickenbreas_81704", "title": "Pechuga de pollo con espárragos, habas, champiñones y una salsa de brandy de sidra Somerset", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "600ml / 20fl oz / 1 litro de leche, calentada", "Queso Cheddar o Cheshire 110 g / 4 oz, rallado", "1 cucharadita de mostaza", "pizca de cayena", "sal", "1 langosta cocida grande"], "method": ["Derrita la mantequilla en una cacerola a fuego lento. Agregue la harina y revuelva hasta que la mezcla forme una pasta suave que deje limpios los lados de la sartén. Cocine por dos o tres minutos hasta que la mantequilla y la harina hagan una bola harinosa.", "Retire del fuego y gradualmente agregue la leche, revolviendo constantemente para evitar grumos.", "Llevar a ebullición, aún revolviendo, y cocine a fuego lento durante unos cinco minutos, revolviendo de vez en cuando.", "Cuando esté suave y cremoso, agregue el queso rallado poco a poco hasta que se derrita. Si la salsa es demasiado espesa, agregue un poco de leche extra.", "Precalentar la parrilla a caliente.", "Agregue la mostaza, la pimienta de cayena y la sal a la salsa de queso.", "Corta la langosta horizontalmente por el medio. Coloque en una bandeja para hornear y generosamente vierta la salsa de queso sobre ambas mitades.", "Cocine la langosta debajo de la parrilla hasta que el queso esté dorado y burbujeante."], "url": "www_bbc_co_uk_food_recipes_lobsterwithcheesesau_83810", "title": "Langosta con salsa de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "4 manzanas bramley, peladas y cortadas en trozos", "50 g / 1 oz de azúcar en polvo", "200ml / 7fl oz de sidra scrumpy", "100 g / 3½ oz de azúcar en polvo", "Mitades de nuez 100g / 3½ oz", "aceite de colza, para freír poco", "200 g / 7 oz de morcilla", "50g / 1¾oz de harina natural", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz de panko breadcrumbs", "aceite de colza, para freír", "1 kg / 2lb 4 oz de lomo de cerdo con hueso, francés cortado, cortado en cuatro chuletas gruesas", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "1 repollo hispi, en rodajas gruesas", "sal y pimienta negra recién molida"], "method": ["Para la salsa scrumpy de manzana, caliente la mantequilla en una cacerola. Agregue las manzanas, el azúcar y la sidra de scrumpy. Haga hervir a fuego lento y cocine hasta que las manzanas estén muy suaves. Agregue un poco más de sidra o agua si la mezcla se vuelve demasiado seca. Revuelva de vez en cuando.", "Luego haz las nueces confitadas. Haga un jarabe calentando el azúcar con 100ml / 3½fl oz de agua hasta que el azúcar se disuelva. Llevar a ebullición y agregar las mitades de nuez. Retirar del fuego y reservar para enfriar.", "Para la morcilla crujiente, corte el pudín en trozos de 2½cm / 1in. Espolvorea las piezas en harina, sumérgelas en el huevo batido y cúbrelas con pan rallado panko. Guárdelo en el refrigerador hasta que esté listo para cocinar.", "Para el cerdo, sazone las chuletas de cerdo con sal y pimienta. Caliente una sartén antiadherente seca a fuego medio hasta que esté caliente. Coloque las chuletas en la sartén para reducir la grasa (esto debe hacerse con cuidado para que la grasa se vuelva marrón y crujiente). Voltee y cocine de la misma manera que antes. Cuando el cerdo esté cocido (aproximadamente 10 minutos), retírelo de la sartén y déjelo a un lado para que descanse en un lugar tibio hasta que esté listo para servir.", "Para las nueces confitadas, escurra las nueces y deseche el jarabe.", "En una sartén honda o sartén, caliente el aceite de colza hasta que esté caliente. Poco a poco freír las nueces hasta que estén crujientes (aproximadamente 30 segundos), luego escurrir sobre papel de cocina. Repita el proceso con la morcilla. Poner a un lado para drenar en papel de cocina.", "Para el repollo, caliente la mantequilla con 50 ml / 2 fl oz de agua para hacer una emulsión. Agregue el repollo, cubra con una tapa y deje hervir durante 2-3 minutos. Condimentar con sal y pimienta.", "Para servir, coloque una chuleta de cerdo en cada plato con una cucharada de salsa de manzana, nueces confitadas, morcilla y repollo hispi. Rocíe los jugos de cocina de la sartén con las chuletas de cerdo cocidas."], "url": "www_bbc_co_uk_food_recipes_loin_of_pork_with_00990", "title": "Lomo de cerdo con salsa scrumpy, nueces confitadas y repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_pork_with_00990_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lomo de venado, tendón y piel eliminados", "2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "Jus de venison 500ml / 18fl oz", "1 pan de brioche, en rodajas", "1 cucharada de aceite de avellana", "1 chalote, finamente picado", "pequeño puñado de champiñones", "2 ramitas de estragón fresco", "2 ramitas de saúco, bayas retiradas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén de base pesada a fuego alto y agregue el aceite de oliva y la mantequilla. Agregue la carne de venado a la sartén y fría, volteándola regularmente, hasta que se dore por todas partes.", "Coloque la carne en un salvamanteles en una lata de asar y tueste en el horno durante unos cinco minutos. Retire del horno y reserve en un lugar cálido para descansar.", "Mientras tanto, caliente otra sartén a fuego medio, agregue el aceite de avellana seguido de la chalota finamente picada y fría hasta que la chalota esté blanda pero no coloreada.", "Aumente el fuego (agregue un chorrito de aceite de avellana si es necesario) y cuando la sartén esté caliente, agregue los níscalos y el estragón y fría por 1-2 minutos. Retire la sartén del fuego, sazone con sal y pimienta negra recién molida.", "Mientras tanto, vuelva a calentar el jus de venado hasta que esté caliente, revise el condimento y agregue las bayas de saúco. Tueste las rebanadas de brioche.", "Coloque una rebanada de brioche tostado en cada plato, talle el venado y póngalo en el brioche. Cuchara sobre el jus y luego generosamente dispersa sobre los níscalos."], "url": "www_bbc_co_uk_food_recipes_loin_of_roe_deer_on_08600", "title": "Lomo de corzo en brioche con rebozuelos y jus de saúco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 2 oz lomo de venado, grasa recortada", "1 cucharada de aceite de oliva", "1 cucharadita de tomillo seco", "Panceta de 250 g / 9 oz, en rodajas finas", "1 cucharada de aceite vegetal", "2 cucharadas de ginebra endrinas", "200ml / 7fl oz de carne de vacuno reducida", "6 bayas de enebro, aplastadas", "Moras 200g / 7oz", "botón de mantequilla", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corte la carne de venado de cualquier grasa o tendón restante y límpiela con papel de cocina o un trapo de té limpio. Frote con el aceite de oliva, sazone con sal y pimienta negra recién molida y frote con el tomillo seco. Dejar de lado.", "Coloque las rebanadas de panceta sobre un trozo de película adhesiva para hacer una hoja larga de panceta. Coloque el lomo en un extremo de la hoja de panceta y enrolle para envolver el lomo. Retire la película adhesiva.", "Caliente el aceite vegetal en una sartén a prueba de horno. Dobla el lomo por todos lados hasta que la panceta se ponga dorada.", "Coloque la sartén en el horno durante 6-8 minutos, o hasta que la carne de venado esté cocida, pero aún rosa por dentro (o cocine por más tiempo si prefiere que su carne no tenga color rosado). Retire la carne de la sartén y reserve.", "Vierta la ginebra endrina en la sartén utilizada para la carne de venado y cocine hasta que se haya absorbido la mayor parte del líquido. Agregue el caldo de carne y las bayas de enebro y cocine a fuego lento durante unos 5 minutos hasta que el volumen de caldo se haya reducido ligeramente.", "Cuele la salsa y regrésela a la sartén, luego agregue las moras. Cocine durante aproximadamente 4 minutos o hasta que las moras se ablanden, luego tritúrelas ligeramente.", "Agregue la mantequilla a la salsa y sazone con sal y pimienta negra recién molida.", "Corta el lomo en rodajas gruesas, descartando los bits inicial y final.", "Sirva aproximadamente 3 rebanadas por persona con el endrino y el glaseado de mora."], "url": "www_bbc_co_uk_food_recipes_loin_of_venison_in_a_52978", "title": "Lomo de venado en un endrino y glaseado de mora", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_venison_in_a_52978_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lomo de cerdo orgánico 180g / 6oz, cortado", "1 limón, ralladura solamente", "1 pequeño racimo de tomillo fresco, solo hojas, picado", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "3 alcachofas pequeñas violetas, descuartizadas", "3 pequeños calabacines", "1 diente de ajo, finamente picado", "1 cangrejo de canastilla (puede sustituir el berro normal)"], "method": ["Corta el lomo de cerdo en cuatro pedazos de igual tamaño. Coloque las piezas entre dos pedazos de película adhesiva y golpee con un mazo de carne o un rodillo hasta que estén muy finos.", "Coloque las piezas de cerdo aplastadas en un plato y espolvoree con la mitad de la ralladura de limón y la mitad del tomillo picado. Sazonar bien con sal y pimienta negra recién molida.", "Calentar dos cucharadas de aceite de oliva en una sartén a fuego lento. Agregue los cuartos de alcachofa y fría, volteando ocasionalmente.", "Picar los calabacines del mismo tamaño que las piezas de alcachofa y agregar a la sartén cuando las alcachofas apenas comienzan a dorarse y dorarse.", "Agregue el ajo y la ralladura de limón restante, las hojas de tomillo y un chorrito de agua. Revuelva suavemente y agregue una cucharada más de aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida. Retire del fuego y reserve en un lugar cálido.", "Mientras tanto, caliente una sartén hasta que fume. Agregue las piezas aplastadas de lomo de cerdo (puede que tenga que hacer esto en lotes). Cocine durante 1-2 minutos por cada lado, o hasta que se formen marcas doradas a ambos lados y la carne de cerdo esté bien cocida.", "Para servir, coloque un pedazo de lomo de cerdo en un plato de servir y coloque algunas alcachofas y calabacines en la parte superior. Coloque otra pieza de cerdo en la parte superior, luego agregue otra capa de verduras. Repita esta estratificación hasta que todas las piezas de cerdo estén agotadas. Corta unos micro berros alrededor del plato y termina con un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_loinofporkwithbraise_89306", "title": "Lomo de cerdo con alcachofas y calabacines estofados con tomillo y ralladura de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]