[{"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, triturado hasta formar una pasta en un mortero", "1 tomate de vid, semillas retiradas y picadas", "2 cucharadas de vinagre de vino blanco", "1 cucharadita de azúcar en polvo", "100g / 3½oz de tallarines secos, cocidos de acuerdo con las instrucciones del paquete, escurridos", "2 cucharadas de cebolletas frescas picadas, para adornar"], "method": ["Caliente el aceite de oliva en una sartén y fría la cebolla y el ajo por 2-3 minutos o hasta que se ablanden. Agregue el tomate picado, el vinagre y el azúcar y cocine por 3-4 minutos o hasta que el azúcar se haya disuelto.", "Usando una batidora, procesa la salsa hasta que quede suave, luego agrega los tallarines cocidos y caliéntalos.", "Transfiera la pasta a un plato de servir y adorne con las cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_tomatotagliatelle_90689", "title": "Fideos de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cm / 2 en pieza galangal o jengibre, pelado, más o menos picado", "2 dientes de ajo, pelados", "1 tallo de limoncillo, magullado", "racimo pequeño de cilantro fresco, hojas picadas, raíces reservadas", "1-2 chalotes, pelados, descuartizados", "1 guindilla verde mediana, sin semillas, más o menos picadas", "3 hojas de lima Kaffir frescas o 6 secas", "2 limas, solo cáscara", "1 cucharada de aceite de oliva", "1 litro / 1¾ de pinta de agua hirviendo", "1 cubo de caldo de pollo o verdura", "Leche de coco 400ml / 14fl oz", "3 cucharadas de salsa de pescado", "8 langostinos tigre o rey, sin cáscara, sin espinas", "puñado de hongos enoki", "Hagámoslo nosotros mismos", "4 hongos shiitake picados", "puñado de guisantes de azúcar", "Fideos soba 100g / 3½ oz", "1-2 limas, solo jugo, más más para servir", "sal y pimienta negra recién molida", "pequeñas hojas de albahaca tailandesa", "pequeño puñado de shiso berro", "1 chile verde, en rodajas"], "method": ["Para la pasta, mezcle los ingredientes de la pasta en un procesador de alimentos hasta que quede suave.", "Para la sopa, caliente el aceite de oliva en una olla grande y fría la pasta a fuego medio durante 2-3 minutos.", "Agregue la leche de coco y la salsa de pescado.", "Vierta el agua hirviendo y revuelva en el cubo de caldo.", "Agregue las gambas y deje que se cocinen en el caldo durante 3-4 minutos o hasta que las gambas se hayan vuelto rosadas y opacas.", "Agregue los champiñones y los chícharos con azúcar, y continúe cocinando durante 2-3 minutos más.", "Cocine los fideos soba en una olla grande de agua hirviendo siguiendo las instrucciones del paquete, luego escurra.", "Para servir, agregue el jugo de lima a la sopa y condimente, al gusto, con sal y pimienta negra recién molida.", "Divida los fideos escurridos entre cuatro tazones y cocine sobre la sopa. Adorne con hojas de albahaca tailandesas, shiso berros, hojas de cilantro y rodajas de chile.", "Exprima un poco más de jugo de lima al gusto."], "url": "www_bbc_co_uk_food_recipes_tomkhasoup_93592", "title": "Tom ha su", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["9 piezas de pollo de su elección (como muslos, baquetas o pechuga en el hueso)", "500ml / 18fl oz de suero de leche", "Harina normal de 100 g / 3½ oz", "50g / 1¾oz de harina de maíz", "2 cucharaditas de orégano seco molido", "2 cucharaditas de chile en polvo", "2 cucharaditas de salvia seca molida", "2 cucharaditas de albahaca seca", "2 cucharaditas de mejorana seca", "2 cucharaditas de pimienta blanca molida", "4 cucharadas de sal de mesa", "2 cucharadas de pimentón dulce", "2 cucharadas de pimentón ahumado", "2 cucharaditas de sal de cebolla", "2 cucharaditas de ajo en polvo", "aceite, para freír poco", "ensalada de col, para servir"], "method": ["Coloque las piezas de pollo en un recipiente, cubra con el suero de leche y refrigere durante 12 horas.", "Precalentar el horno a 180C / 375F / Gas 4.", "Mezcle las harinas con las especias secas y las hierbas en un plato grande. Retire el pollo del suero de leche y sacuda la mayor cantidad de suero de leche posible. Enrolle las piezas de pollo en la mezcla seca hasta que estén cubiertas.", "Caliente una sartén grande a fuego medio-bajo y agregue un glug de aceite. Freír 2-3 piezas de pollo a la vez (no amontonar la sartén) hasta que estén doradas por completo y cocidas. Cuando esté cocido, escurra el pollo sobre papel de cocina y luego transfiéralo a una lata para asar.", "Coloque las piezas de pollo en el horno hasta que el revestimiento esté crujiente en lugar de crujiente (hasta 15 minutos).", "Servir en una canasta con ensalada de col."], "url": "www_bbc_co_uk_food_recipes_toms_fried_chicken_in_a_83178", "title": "El pollo frito de Tom en una canasta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_fried_chicken_in_a_83178_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Rasguños de cerdo 100g / 3½ oz", "Pan de masa fermentada de 100g / 3½oz, roto en trozos y horneado hasta que quede crujiente", "100 g / 3½ oz de pistachos sin cáscara, aproximadamente picados", "50 g / 1¾oz de arándanos secos, toscamente picados", "2 cucharadas de hojas frescas de tomillo", "1 naranja, solo ralladura", "800 g / 1 libra de carne de salchicha de 12 onzas", "Cebolla de 400g / 14oz, finamente picada y frita hasta que se translúzca, se enfríe", "100 g / 3½ oz de castañas cocidas y peladas, finamente picadas", "160g / 5½oz de pan rallado fresco", "1 manojo de salvia fresca, picada", "2 cucharaditas de sal", "3 cucharaditas de pimienta negra agrietada", "100g / 3½oz de arándanos secos", "1 cucharada de bayas de enebro, aplastadas", "Tocino rayado ahumado de 20 lonchas (aproximadamente 250-300g / 9-10½oz)", "2-2.2kg / 4lb 8oz-5lb pechuga de pavo sin piel y sin piel", "140g / 5oz de salsa marrón", "salsa de pan, para servir"], "method": ["Para la cobertura de crumble, aplastar los rasguños de cerdo y las piezas de masa fermentada en un tazón. Agregue los pistachos, los arándanos y el tomillo. Mezcle con sus manos y déjelo a un lado en un recipiente tapado.", "Para el relleno, mezcle todos los ingredientes aparte del tocino. Mezcle para combinar.", "Recorte cualquier trozo de grasa o membrana del pavo. Con un cuchillo afilado, abre la pechuga de pavo como si estuvieras marcándola. Coloque el pavo entre dos hojas de película adhesiva y aplánelo un poco con un rodillo.", "Corta dos pedazos grandes de papel de aluminio y coloca la pechuga de pavo encima. Condimentar con sal y pimienta. Extienda una masa generosa de la mezcla de relleno en una capa de 5 mm / ¼ en la pechuga de pavo y luego utilice la lámina para ayudar a enrollarlo como un rollo suizo. Coloque completamente el pavo en las dos capas de papel de aluminio y asegúrelo con hilo de cocina a intervalos regulares a lo largo del rollo. Coloque en el refrigerador hasta que lo necesite.", "Precalentar el horno a 120C / 250F / Gas ½.", "Agregue 400ml / 14fl oz de agua hirviendo a una lata para asar profunda. Coloque una rejilla en la lata y coloque la pechuga de pavo enrollada encima. Cubra la lata de asar con papel de aluminio.", "Asar en el horno durante 1½-2 horas, luego verifique la temperatura central con un termómetro para carne. Está buscando una temperatura de 70C / 160F. Si no está listo, vuelva a colocarlo en el horno y continúe cocinando hasta que alcance los 70 ° C / 160 ° F. Una vez cocido, retire del horno, cubra con papel de aluminio y déjelo reposar durante 40 minutos. Cuando esté lo suficientemente frío como para manipularlo, retire la cuerda y el papel de aluminio.", "Para el relleno, precaliente el horno a 170 ° C / 325 ° F / Gas 3 y forre un molde de terrina o un tazón a prueba de llama con el tocino rayado, dejando algo de exceso colgando sobre los lados. Empaque el molde con la mezcla de relleno restante y envuelva el tocino sobre la parte superior.", "Hornee en el horno durante 45 minutos, o hasta que el medio haya alcanzado los 70 ° C / 160 ° F en un termómetro de carne. Cuando esté cocido, retírelo del horno y déjelo reposar durante 20 minutos.", "Después de 20 minutos, saque el relleno y seque. Caliente la parrilla a fuego vivo, luego ase a la parrilla el relleno hasta que el tocino esté crujiente.", "Cuando descansa, retire el pavo de la lata de tueste y cepille una capa gruesa de salsa marrón sobre la parte superior. Cubra con la mezcla de crumble de Navidad, cubra con un poco de ralladura de naranja y sirva enseguida con el relleno."], "url": "www_bbc_co_uk_food_recipes_toms_turkey_roll_with_44115", "title": "Rollo de pavo con relleno de crumble de Navidad y relleno de salvia y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_turkey_roll_with_44115_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 2 pintas de caldo de pollo", "300ml / 11fl oz de agua", "6 palitos de limoncillo, ligeramente triturados", "4 raíces de cilantro frescas, aplastadas", "110g / 4oz de galanga fresca, pelada y en rodajas (disponible en los supermercados asiáticos)", "8 tomates, cortados en cuartos, sin semillas", "6 hojas de lima kaffir", "1-2 limas, solo jugo", "75ml / 3fl oz de agua de tamarindo (el tamarindo está disponible en los supermercados asiáticos. Remoje el tamarindo en agua caliente y empuje la pulpa a través de un colador para hacer agua de tamarindo).", "3 chiles rojos, en rodajas finas", "75ml / 3fl oz de salsa de pescado (nam pla), o al gusto", "Azúcar de palma 75 g / 3 oz (disponible en los supermercados asiáticos), use azúcar moreno si no está disponible", "12 gambas de tigre crudas, sin cáscara, evisceradas y partidas a la mitad", "2 pechugas de pollo sin piel sin hueso, cortadas en trozos", "1 manojo pequeño de cilantro fresco, hojas", "1 manojo pequeño de albahaca tailandesa fresca, hojas (disponible en los supermercados asiáticos)", "rodajas de limón"], "method": ["Coloque el caldo y el agua en una sartén grande a fuego alto y deje que hierva.", "Agregue el limoncillo, raíces de cilantro, galanga, tomates, hojas de lima, jugo de lima, agua de tamarindo y chiles rojos. Vuelva a hervir, luego reduzca el fuego y cocine a fuego lento durante 15-20 minutos.", "Pruebe el caldo y agregue la mayor cantidad de salsa de pescado y azúcar de palma, según sea necesario, para mantener el sabor salado, ácido y dulce, y luego retírelo del fuego.", "Transfiera 220ml / 8fl oz del caldo en una sartén por separado a fuego alto y lleve a ebullición. Agregue el pollo y cocínelo durante 1-2 minutos, luego agregue las gambas y cocínelas durante 1-2 minutos o hasta que estén completamente cocidas.", "Para servir, vierta la sopa en dos cuencos y rellene con el caldo caliente. Adorne con albahaca tailandesa, cilantro y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_tomyumsoup_85069", "title": "Tom ñam sopa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomyumsoup_85069_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1½ pintas de agua o caldo de pollo liviano", "6 pequeños palitos de limoncillo", "12 hojas de lima, rasgadas por la mitad (opcional)", "1 guindilla roja larga, en rodajas", "20 g / 1 oz de raíz fresca de jengibre, en rodajas finas", "2 cucharadas de salsa de pescado", "20g / 1oz de azúcar de palma o demerara ligera", "Se quitaron pescados blancos de 200g / 7oz, como el bacalao, la piel y el hueso", "6 vieiras regordetas", "50mls / 1¾fl oz de aceite vegetal", "puñado de hojas de cilantro recogidas", "puñado de hojas de albahaca", "2 limas, cortadas a la mitad"], "method": ["Vierta el agua o el caldo en una sartén y agregue la hierba de limón, las hojas de lima rotas, el chile, el jengibre, la salsa de pescado y el azúcar.", "Llevar a ebullición, luego reducir el fuego a muy bajo y dejar en infusión durante 10 minutos.", "Cortar el pescado blanco en cubos cuadrados de 1 cm y colocar en el caldo.", "Caliente rápidamente una plancha o sartén y frote las vieiras con un poco de aceite.", "Con cuidado, coloque las vieiras en la sartén y no toque durante tres minutos, hasta que pueda ver las vieiras coloreadas alrededor de los bordes.", "Déles la vuelta y cocínelos por otros tres minutos.", "Distribuye el cilantro y la albahaca entre seis tazones pequeños. Exprime un poco de jugo de lima en la parte superior y vierte la sopa.", "Coloque una vieira en cada plato y adornar con un palo de limoncillo."], "url": "www_bbc_co_uk_food_recipes_tomyumsoupwithlimean_74618", "title": "Sopa de Tom yum con lima y pescado blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de ketchup de tomate (puedes obtener ketchup japonés, pero cualquier marca lo hará)", "75ml / 2½fl oz de sake", "2 cucharadas de salsa Worcestershire (el japonés está disponible si puedes conseguirlo)", "2 cucharadas de salsa de soja oscura", "1 diente de ajo, finamente rallado", "1 cucharadita de jengibre fresco de raíz finamente rallado", "1 cucharadita de mostaza japonesa o Dijon (la mostaza japonesa sabe a mezcla de Dijon y mostaza inglesa)", "2 cucharaditas de mirin (o más al gusto)", "1 cucharada de azúcar", "4 cucharadas de harina normal", "2 huevos de gallinas camperas, golpeados", "Pan rallado pancho japonés de 75 g / 2½ oz", "pizca de sal y pimienta", "4 filetes gruesos de lomo de cerdo", "aceite vegetal o de maní, para freír", "½ repollo chino, rallado", "cebollas de primavera, finamente cortadas"], "method": ["Para la salsa, mezcle todos los ingredientes en una cacerola pequeña. Deje que hierva a fuego lento y cocine durante cinco minutos, o hasta que el ajo y el jengibre estén suaves. Desea que la salsa alcance una buena consistencia de vertido.", "Cuele la salsa a través de un colador fino en un tazón pequeño. Se servirá a temperatura ambiente (así que no lo coloque en la nevera). Establecer a un lado hasta que esté listo para usar", "Para el cerdo, coloque la harina, el huevo batido y las migas de pan en tres platos individuales. Sazonar bien la harina con sal y pimienta.", "Cubra cada bistec sumergiendo primero en la harina, luego el huevo y finalmente el pan rallado. Vuelva a sumergir cada bistec en el huevo y en las migas de pan nuevamente, esto crea un recubrimiento extra crujiente.", "Calentar una sartén antiadherente y verter el aceite para freír.", "Fríe las chuletas a fuego medio hasta que se doren por ambos lados y cocínelas por completo. Tenga cuidado al girar las chuletas para evitar salpicar la grasa caliente.", "Sirva la carne de cerdo con la salsa tonkatsu y cruda la col china finamente triturada y las cebolletas en rodajas."], "url": "www_bbc_co_uk_food_recipes_tonkatsu_pork_20288", "title": "Tonkatsu Po rk", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tonkatsu_pork_20288_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2g de copos de bonito", "75ml / 2½fl oz de sake", "7g de sal marina", "500ml / 18fl oz de salsa de soja", "½ bulbo de ajo, pelado y toscamente picado", "20g / ¾oz de raíz de jengibre fresco, pelado y toscamente picado", "⅓ chile rojo, más o menos picado", "2 racimos de cebollas de primavera, toscamente picadas", "6 huevos de gallinas camperas", "1 racimo (aproximadamente 300 g / 10½ oz) de jengibre fresco de raíz, pelado y toscamente picado", "1 bulbo de ajo, pelado y toscamente picado", "1 manojo de cebollas de primavera, más o menos picadas", "1 cebolla grande, más o menos picada", "1 pollo pequeño entero de corral", "20 g / ¾ oz konbu", "20g / ¾oz de copos de bonito", "75g / 2½oz de sal marina", "4 cucharadas de sake", "1 cucharada de mirin", "2 cucharadas de vinagre de arroz", "1 cucharada de salsa de soja", "500g / 1lb 2oz de fideos frescos de ramen", "1 calamar entero, solo cuerpo, preparado y limpiado", "12 gambas enteras, peladas, colas dejadas, conchas reservadas, butterflied", "aceite vegetal, para freír", "12 almejas, limpiadas", "1 cebolleta, en rodajas", "10 g / ⅓oz de semillas de sésamo", "sal y pimienta"], "method": ["Para la base de la soja y los huevos sazonados, en una olla grande, ponga a hervir 1 litro / 1¾ pintas de agua. Agregue los copos de bonito y cocine por 10 minutos. Retire los copos de bonito con un colador.", "Agregue el resto de los ingredientes, excepto los huevos, al caldo de bonito. Llevar a ebullición y dejar a un lado para enfriar.", "Hervir los huevos en una olla con agua hirviendo durante 6 minutos y 20 segundos. Cuando esté cocido, coloque los huevos en agua fría hasta que estén lo suficientemente fríos para manipularlos. Retire las cáscaras y agregue los huevos al caldo para marinar durante la noche.", "Para el caldo de pollo, ponga todas las verduras en una olla grande con el pollo y 4 litros / 7 litros de agua. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 2 horas. Durante la cocción se eliminan las impurezas y grasas que suben a la superficie, reservando la grasa para la guarnición. Esto debería producir un caldo de pollo claro.", "Para la base de sal, lleve 300 ml / 10 fl oz de agua y el konbu a ebullición y cocine a fuego lento durante 10 minutos. Retire el konbu y deseche. Agregue los copos de bonito y cocine a fuego lento durante 10 minutos, luego retire los copos con un colador y deséchelos. Agregue los ingredientes restantes. Cuando la sal del mar se haya disuelto, apague el fuego y deje enfriar. (Harás más base de sal de la que necesitas).", "Para la guarnición, condimente el calamar y las gambas con sal y pimienta. Calentar un poco de aceite vegetal en una sartén y cocinar el calamar durante 1-2 minutos.", "Cueza al vapor las gambas en un vaporizador de bambú durante 4 minutos.", "Caliente dos litros de caldo de pollo en una cacerola. Una vez que hierva, agregue las almejas y las cáscaras de la gamba. Deseche cualquier almeja que no se abra. Después de 2-3 minutos cuele el material a través de un tamiz áspero. Retenga las almejas y deseche las conchas de gambas.", "Use un tamiz fino forrado con muselina para filtrar el caldo en una olla limpia. Vuelve a hervir.", "Haga hervir una olla grande de agua y cocine los fideos frescos durante 34 segundos y escurra.", "Para servir, ponga una cucharada de la base de sal en cada tazón. Agregue 350ml / 12fl oz del caldo de pollo a cada tazón. Agregue los fideos cocidos, el calamar, las gambas, las almejas, un huevo sazonado, reducido a la mitad y algunas rodajas de cebolleta. Rocíe con un poco de grasa de pollo y termine con una pizca de semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_tonkotsu_seafood_ramen_87628", "title": "Ramen de mariscos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 papas King Edward grandes, peladas y cortadas en trozos", "sal y pimienta negra recién molida", "150ml / 5fl oz de crema doble", "2½ cucharadas de mantequilla sin sal", "2 x 180 g / 6½ oz de solomillo Torbay (también conocido como suela de bruja), pelado", "sal y pimienta negra recién molida", "2½ cucharadas de mantequilla sin sal", "150g / 5oz de champiñones", "2 puñados de hojas grandes de espinaca", "75g / 3oz de mantequilla", "2 chalotes, en rodajas finas", "4 granos de pimienta negra, ligeramente triturados", "1 cucharadita de polvo chino de cinco especias", "1 cucharada de vinagre de Jerez", "150m / 5fl oz de vino tinto", "225ml / 8fl oz de caldo de pescado", "½ hoja de laurel", "1 ramita de tomillo fresco", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para la papa con crema, coloque las papas en una cacerola y cúbralas con agua. Agregue una pizca de sal, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante 10-12 minutos hasta que estén tiernos.", "Drene y regrese a la sartén. Coloque la sartén sobre el fuego para eliminar el exceso de humedad.", "Pase las papas a través de un ricer de patata hasta que quede suave (o use un triturador de patatas, aunque no obtendrá un resultado tan suave) y devuelva el puré a la sartén.", "Agregue la crema y la mantequilla y bata bien. Sazonar, al gusto, con sal y pimienta negra recién molida y reservar, manteniendo el puré caliente.", "Para el pescado y la espinaca, sazone los lenguados con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue la mitad de la mantequilla y los filetes de lenguado. Freír durante dos minutos, luego girar el pescado y agregar los champiñones y la mantequilla restante a la sartén. Cocine por otros 2-3 minutos, o hasta que los champiñones estén dorados.", "Retire los filetes de la sartén y seque brevemente sobre un paño de cocina. Deja los champiñones a un lado.", "Mientras tanto, caliente una sartén por separado hasta que esté caliente, agregue la mantequilla restante y las espinacas y cocínelas hasta que se marchiten. Deje de lado, manteniéndolo caliente.", "Para la salsa, caliente una sartén hasta que esté caliente, agregue un tercio de la mantequilla y todos los chalotes. Cocine durante 1-2 minutos o hasta que los chalotes se ablanden, pero no se doren.", "Agregue los granos de pimienta y el polvo chino de cinco especias a los chalotes y cocine por un minuto más.", "Agregue el vinagre de jerez y revuelva hasta que se haya absorbido en las chalotas. Agregue el vino tinto, el caldo de pescado, la hoja de laurel y el tomillo, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que la mezcla haya reducido su volumen en dos tercios.", "Cuele la salsa a través de un colador fino en una olla limpia y mezcle con la mantequilla restante y el jugo de limón. Sazonar con sal y pimienta negra recién molida, al gusto.", "Para servir, espolvorea la crema de papa en el centro de cada uno de los platos y apila la espinaca al lado. Coloque los filetes de pescado encima, esparza sobre los champiñones y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_torbaysolespicedredw_90444", "title": "Suela de Torbay, salsa de vino tinto especiado, champiñones y crema de patata", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Alas de pollo 1.5kg / 3lb 5oz", "1,5 kg / 3 lb 5 oz de huesos de cerdo (los huesos de las costillas son buenos para esto)", "10g pieza seca kombu", "2 rebanadas gruesas de raíz fresca de jengibre", "250ml / 9fl oz de sake", "1 cebolla mediana, cortada a la mitad", "30 g / 1 z zettai f (bonificación)", "6 hongos shiitake secos"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque las alitas de pollo y los huesos de cerdo en una lata para asar y en el horno precalentado.", "Asar durante 30-40 minutos, volteándolos hasta la mitad hasta que estén dorados. Alternativamente, puedes freír los huesos hasta que se doren si no tienes un horno.", "Cuando esté cocido, cuele las alas y los huesos en un colador o un colador grande y luego vierta un hervidor de agua hirviendo sobre ellos para eliminar el exceso de grasa.", "Mientras el pollo está en el horno, enjuague el kombu seco con agua corriente fría. Remoje el kombu en una olla grande por 30 minutos en 2.5 litros / 4½ pintas de agua fría. El kombu triplicará su tamaño.", "Retire el kombu del agua y corte en tres tiras largas. Regrese a la olla y tráigalo a fuego lento. Retire del fuego y deseche el kombu: no hierva el kombu en el agua durante un tiempo prolongado o el dashi se volverá amargo.", "Agregue las alas y los huesos tostados y enjuagados junto con todos los ingredientes restantes al agua kombu. Llevar a ebullición, reducir el fuego, poner una tapa y cocine a fuego lento durante dos horas. No deje hervir el caldo ya que se volverá turbio.", "Después de dos horas, cuele el material cuidadosamente a través de una muselina limpia o una tela de jay. Dejar escurrir suavemente durante 10 minutos, enfriar y refrigerar hasta que se requiera."], "url": "www_bbc_co_uk_food_recipes_toridashi_pork_and_55893", "title": "Toridashi (carne de cerdo y pollo)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 2,5 litros / 4½ pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo sin piel de corral", "Fideos de arroz 70 g / 2½ oz", "3 dientes de ajo, aplastados", "1 cilantro pequeño pequeño puñado, desgarrado en trozos pequeños", "2 cucharadas de mantequilla de maní", "3 cucharadas de salsa de soja ligera", "2 cucharadas de miel clara", "1 cucharadita de aceite de chile", "1 cucharada de vinagre balsámico", "1 pepino, pelado y cortado en tiras finas"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque el pollo debajo de la parrilla y cocine el pollo durante 7-8 minutos por cada lado, volteándolo una vez, hasta que esté dorado y completamente cocido. Retirar de la parrilla una vez cocida y dejar enfriar un poco.", "Coloque los fideos en un tazón grande a prueba de calor y vierta agua hirviendo para cubrir. Dejar cocer durante cinco minutos, luego escurrir y dejar enfriar.", "Coloque la pechuga de pollo caliente sobre una superficie plana y resistente, golpee con un rodillo y luego triture en pedazos.", "Coloque el ajo, cilantro, mantequilla de maní, salsa de soja, miel, aceite de chile y vinagre en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloque los fideos en el plato, cubra con las tiras de pepino seguido de la pechuga de pollo rallada. Rocíe ligeramente con la salsa de maní."], "url": "www_bbc_co_uk_food_recipes_tornsataychicken_80142", "title": "Pollo satay rallado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de almendras blanqueadas", "200g / 7oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar granulada", "100 g / 3½ oz de cacao en polvo sin endulzar de mejor calidad", "1 huevo grande de gallinas camperas, preferiblemente orgánico", "la yema de 1 huevo orgánico grande de gallinas camperas", "100 g / 3½ oz galletas digestivas", "3 cucharadas de licor con sabor a naranja", "flores confitadas o almendras azucaradas o crema batida, para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Extiende las almendras en una bandeja para hornear y hornea por 7-10 minutos, o hasta que se doren. Triturarlos groseramente en un procesador de alimentos, teniendo cuidado de parar cuando se parecen a los granos de arroz.", "Crema la mantequilla y el azúcar en un tazón hasta que esté suave y esponjoso.", "Tamizar el cacao y agregarlo a la mantequilla y el azúcar. Batir difícil de incorporar.", "Batir ligeramente todo el huevo y la yema de huevo y luego agregar los huevos a la mezcla. Revuelva bien hasta que todo esté bien mezclado.", "Triture los bizcochos con un rodillo, agregue a la mezcla junto con las almendras molidas y el licor con sabor a naranja. Mezcle bien.", "Cubra una lata de pan de 20x10 cm / 8 in x 4 con película adhesiva y aplaste la mezcla presionándola todo el tiempo para eliminar cualquier burbuja de aire y, cuando esté todo adentro, golpee con fuerza la lata sobre la superficie de trabajo. Cubra con película adhesiva y enfríe durante al menos cuatro horas.", "Consigue un plato ovalado, voltea la lata boca abajo sobre ella y quita la película adhesiva.", "Decore con flores confitadas o almendras azucaradas o crema batida antes de servir."], "url": "www_bbc_co_uk_food_recipes_torrone_molle_soft_62924", "title": "Turrón de chocolate suave (turrón suave)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torrone_molle_soft_62924_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de mantequilla, en cubos, más extra para engrasar", "Miel 250 g / 9 oz, más 1-2 cucharadas de glaseado", "100g / 3½oz de azúcar moreno claro", "3 huevos grandes de gallinas camperas", "300g / 10½oz Tipo 00 de harina", "2 cucharaditas de polvo de hornear", "1 cucharadita de semillas de hinojo", "6 cucharadas de castañas cocidas picadas (recién tostadas, en lata o al vacío)", "4 cucharadas de piñones", "1 cucharadita de sal marina escamosa", "crema espesa, para servir (opcional)"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Enmanteque y forme una lata de torta con forma de resorte de 20 cm / 8 pulgadas o 23 cm / 9 pulgadas.", "Ponga la mantequilla en cubos en una sartén con la miel y el azúcar y derrita lentamente, revolviendo ocasionalmente. Una vez disuelto, hierva la mezcla y hierva a fuego lento durante un minuto, bajando la temperatura según sea necesario para asegurarse de que la sartén no hierva. Dejar enfriar por 20 minutos.", "Batir los huevos juntos en una jarra, luego mezclarlos en la mezcla de miel fría. Tamiza la harina y el polvo de hornear en un tazón grande y haz un pozo en el centro.", "Vierta la mezcla de miel en la harina y mezcle, incorporando gradualmente la harina. Tan pronto como esté bien combinado, agregue las semillas de hinojo y cuatro cucharadas de castañas picadas.", "Vierta la masa de la torta en la lata preparada. Combine las castañas restantes con los piñones y la sal marina escamosa en un tazón pequeño y espárzalos sobre la parte superior de la torta.", "Hornee durante 45-60 minutos, o hasta que la torta se haya levantado y un pincho insertado en el centro salga limpio.", "Deje que la torta se enfríe en la lata durante cinco minutos, luego apáguela sobre una rejilla de alambre.", "Caliente dos cucharadas de miel en una sartén pequeña hasta que se escurra, luego cepíllela generosamente sobre la parte superior del pastel. Puede servir la torta caliente con crema como postre, o dejar que se enfríe completamente, envolver en papel de aluminio y guardar en una lata hermética, donde debe conservarse durante cuatro días."], "url": "www_bbc_co_uk_food_recipes_torta_di_serretto_00934", "title": "Pastel de miel y castañas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_di_serretto_00934_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "150g / 5½oz de azúcar glas", "175g / 6oz de mantequilla, enfriada y cortada en cubos", "1 limón sin cebar, ralladura fina solamente", "2 huevos de gallinas camperas, golpeados", "sal", "1 litro / 1¾ pinta de leche entera", "1 vaina de vainilla, dividida longitudinalmente", "2 palitos de canela", "1 limón sin cebar, ralladura fina solamente", "6 yemas de huevo de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "100 g / 3½ oz de harina de maíz", "clara de huevo, para cepillar", "azúcar glas, para servir"], "method": ["Para hacer la masa, con la mano o usando un mezclador de pie, mezcle la harina y el azúcar glas con una pizca de sal, luego frote la mantequilla. Agregue la ralladura de limón y luego mezcle los huevos hasta que tenga una masa homogénea; es posible que no los necesite todos. Forma en dos bolas, una ligeramente más grande que la otra, y envuélvela en una película adhesiva. Enfriar durante al menos una hora, preferiblemente durante la noche.", "Mientras tanto, para hacer el relleno, ponga la leche en una cacerola y agregue la vaina de vainilla, los palitos de canela y la ralladura de limón. Llevar a ebullición y dejar en infusión hasta que la leche se haya enfriado a temperatura ambiente.", "Batir las yemas de huevo y el azúcar impalpable en un tazón resistente al calor hasta que aumente en volumen y en forma de mousse. Tamizar en la harina de maíz y batir hasta que estén bien combinados.", "Vuelva a calentar la leche y cuele en una jarra, luego enjuague la olla. Verter la leche desde una altura en un flujo constante sobre la mezcla de huevo y azúcar, batiendo constantemente. Vierta la mezcla en la cacerola.", "Revuelva constantemente a fuego medio durante 5 minutos, o hasta que la crema se espese. Transfiera a una jarra o tazón y cubra con una película adhesiva tocando la crema pastelera para evitar que se forme una piel. Enfríe hasta que esté listo para hornear la tarta.", "Precalentar el horno a 180 C / Fan 160C / Gas 4.", "Extienda la pieza más grande de hojaldre y úsela para revestir una tarta de pastel de 23 cm / 9 pulgadas o de tarta poco profunda, preferiblemente una de fondo suelto. Recortar. Pierce con un tenedor y enfríe en la nevera durante media hora.", "Extiende la crema sobre la base de la tarta. Estirar la masa restante y utilizarla para cubrir la tarta. Humedezca los bordes con agua y ribetee juntos.", "Cepille la tarta con clara de huevo. Hornea por 40 minutos. Dejar enfriar antes de enfriar. Servir espolvoreado con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_torta_menjar_blanc_99276", "title": "Torta comida blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_menjar_blanc_99276_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "pizca de sal", "100 g / 3½ oz de mantequilla, refrigerada, cortada en pequeños trozos", "50 g / 1 oz de azúcar en polvo", "2 yemas de huevo de gallinas camperas", "Nueces 230g / 8oz, más extra para decorar", "200 g / 7 oz de azúcar en polvo", "3 huevos de gallinas camperas", "50g / 1¾oz de mantequilla, derretida", "65 g / 2¼ oz de galletas amaretti, más o menos trituradas", "75 g / 2½ oz de chocolate negro, rallado", "1 cucharada de harina normal", "1 cucharada de café instantáneo en polvo, disuelto en un poco de agua caliente", "Licor de almendra 50ml / 2fl oz", "azúcar glas, para decorar", "mascarpone, para servir"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6 y aplique mantequilla a una lata de tarta afilada, aflautada, de 23 cm / 9 pulg. De profundidad.", "Para hacer la masa, ponga la harina y la sal en un tazón y frote la mantequilla con la punta de los dedos hasta que la mezcla se parezca a las migas de pan gruesas. Agregue el azúcar y mezcle las yemas de huevo. Junta la masa sin amasar y envuélvela en una película adhesiva. Ponlo en la nevera por 30 minutos.", "Extienda la masa sobre una superficie ligeramente enharinada y úsela para revestir la tarta de tarta preparada. Cubra los pasteles con papel resistente a la grasa y llene con alubias para hornear. Hornee a ciegas durante 10-12 minutos. Retire los frijoles para hornear y el papel resistente a las grasas y vuelva al horno durante 5-6 minutos, o hasta que estén ligeramente dorados. Deja enfriar.", "Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para hacer el relleno, mezcle las nueces con 100 g / 3½ oz de azúcar en un procesador de alimentos hasta que esté finamente molido.", "Batir los huevos con el azúcar restante. Con cuidado mezcle la mantequilla derretida, la mezcla de nuez molida, galletas de amaretti, chocolate, harina, café y licor de almendras. Mezclar bien.", "Coloque el relleno en el estuche de tarta. Decora con nueces enteras y hornea en el medio del horno durante 25 minutos.", "Sirva caliente con una pizca de azúcar glas y una pequeña bola de mascarpone."], "url": "www_bbc_co_uk_food_recipes_torta_nera_chocolate_02131", "title": "Torta nera (chocolate walnut tart)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_nera_chocolate_02131_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,4 kg / 3 lb de manzanas para cocinar, peladas, sin corazón y cortadas en rodajas", "100g / 3½oz de azúcar morena suave", "3 huevos", "200 g / 7 oz de azúcar en polvo", "200g / 7oz de mantequilla, suavizada", "200 g / 7 oz de almendras molidas", "almendras en rodajas para la decoración"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Coloque las manzanas y el azúcar moreno en una sartén grande y cocine a fuego lento hasta que estén suaves.", "En un tazón grande, bata los huevos con el azúcar impalpable y luego mezcle la mantequilla y las almendras molidas para crear una pasta suave.", "Divida las manzanas cocidas entre seis moldes y extienda la mezcla de almendras encima.", "Espolvoree unas almendras en rodajas encima de cada una y cocine por unos 50 minutos hasta que estén doradas.", "Servir caliente con crema o helado."], "url": "www_bbc_co_uk_food_recipes_tortadimeleemandorle_71747", "title": "Pastel de manzana y almendras (mini manzana y pastel de almendras)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, para engrasar", "2 cucharadas de harina natural, para quitar el polvo", "5 huevos de gallinas camperas, más 1 huevo de gallinas camperas, golpeado, para cepillar", "200g / 7oz de espinaca", "Hojas de diente de león 110g / 4oz o cohete", "2 cucharadas de aceite de oliva extra virgen", "1 cebolla, finamente picada", "500g / 1lb 2oz de queso ricotta", "50g / 2oz de queso parmesano, o queso duro vegetariano similar, rallado", "Queso provolone de 110 g / 4 oz, o alternativa vegetariana similar, cortado en cubos pequeños", "sal y pimienta negra recién molida", "500 g / 1 libra de hojaldre listo para el uso de 2 oz", "300 g / 10½oz de habas frescas o congeladas (peso sin cáscara)", "5 palitos de apio pequeños, finamente cortados en cerillas de 3cm / 1 de largo", "gran puñado de cohetes", "12 hojas de menta, aproximadamente desgarradas", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "1 limón pequeño, solo jugo", "Queso de oveja 110 g / 4 oz, o alternativa vegetariana similar, afeitado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase un plato redondo y hondo de 28cm / 11 pulgadas con mantequilla y luego espolvoréelo con harina.", "Para la torta, coloque cinco de los huevos en una olla con agua hirviendo y deje hervir durante diez minutos. Escurra y coloque los huevos en agua fría y déjelos enfriar. Una vez que esté frío, quita las conchas y corta los huevos por la mitad a lo largo.", "Lave las hojas de espinaca y diente de león y agite para eliminar el exceso de agua.", "Caliente una sartén grande con tapa hasta que esté caliente, luego agregue las hojas de espinaca y diente de león y cubra. Cocine por 4-5 minutos, hasta que esté cocido al vapor y marchitado. Escurra la mezcla de espinaca y diente de león y, una vez que esté lo suficientemente fría como para manejarla, exprima el exceso de líquido. Corta aproximadamente la mezcla de espinaca y diente de león y colócala en un bol.", "Calentar una sartén a fuego medio y agregar el aceite de oliva y la cebolla. Freír la cebolla suavemente durante unos minutos hasta que se ablande, luego reservar y dejar enfriar.", "Agregue la cebolla cocida a la espinaca y al diente de león y mezcle bien.", "Agregue la ricotta y el parmesano y mezcle bien.", "Agregue la provolone, condimentar, sazonar, con sal y pimienta negra recién molida y mezclar bien.", "Extienda aproximadamente la mitad de la masa de hojaldre a 0.5cm / ¼ de grosor y úsela para revestir el plato para pastel preparado.", "Llene la caja de tarta con la mitad de la mezcla de espinacas y queso.", "Agregue las mitades de huevo hervido, las yemas hacia abajo, espaciadas uniformemente, luego cubra con la mezcla de espinacas restante.", "Cepille el borde de la masa con un poco de huevo batido.", "Estire la masa de hojaldre restante con el mismo grosor que la primera y colóquela sobre el relleno de la torta, presionando bien los bordes. Corte cualquier exceso de hojaldre y ribete los bordes con los dedos, para que el pastel quede bien sellado.", "Haga una pequeña incisión con la forma de una cruz en el centro de la cubierta de pastelería para permitir que salga el vapor durante la cocción.", "Cepille la parte superior de la masa con huevo batido, luego transfiera al horno para hornear durante 35-40 minutos, o hasta que se levante y dorado por todas partes. Retirar del horno y dejar enfriar.", "Para la ensalada, hierva las habas durante un minuto, luego drene y revuelva en agua fría.", "En un tazón limpio grande, coloque el apio, el cohete y la menta. Agregue las habas frías y mezcle bien.", "Coloque el aceite de oliva y el jugo de limón en un bol pequeño y limpio y bata hasta que comience a espesarse. Vierta el aderezo sobre la ensalada y mezcle bien.", "Para servir, coloque una rodaja de la torta en cada plato y coloque un poco de ensalada al lado. Rocíe todo con un poco de aceite de oliva virgen extra y cubra con virutas de queso de oveja."], "url": "www_bbc_co_uk_food_recipes_tortapasquale_88435", "title": "Pastel de pascua", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortapasquale_88435_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de aceite de oliva", "13 dientes de ajo picados", "pizca de copos de chile seco", "1 litro / 1¾ pinta de tomate pasado", "2 cucharadita de sal marina fina", "70 g / 2½ oz de frutas de mostaza, jarabe reservado (disponible en línea y en algunas tiendas de delicatessen italianas)", "1 calabaza grande, preferiblemente barra de hierro, cortada en cuñas de 3 cm / 1¼ pulgadas", "aceite de oliva", "3 chalotes, finamente picados", "1 chile rojo pequeño, finamente picado", "2 dientes de ajo, finamente picados", "250 g / 9 oz cavolo nero, lavado y toscamente picado", "2 limones no encerados, ralladura fina solamente", "120 g / 4¼oz de parmesano o queso grana padano, en rodajas finas", "30 hojas grandes de salvia", "12 galletas amaretti"], "method": ["Para la salsa de tomate, caliente una olla grande y agregue el aceite. Una vez caliente, agregue el ajo y fría hasta que se dore. A continuación, agregue el frío, passata de tomate y sal marina. Cocine suavemente durante 4-5 horas.", "Para el puré de mostaza, coloque los frutos de mostaza y 30 g / 1 oz del jarabe reservado en una licuadora y mezcle hasta que quede suave.", "Para la calabaza, precalentar el horno 160C / 140C Fan / Gas 3.", "Frote las rodajas de calabaza con 4 cucharadas de aceite de oliva, sazone con sal marina y coloque en una bandeja para hornear antiadherente. Cocine por aproximadamente 20 minutos. Pruebe con un cuchillo pequeño en el extremo más grueso de la calabaza para sentir que está cocido. No debería haber resistencia de la calabaza. Deje que se enfríe y luego retire suavemente la piel, que puede desecharse.", "Caliente una sartén grande con tapa y agregue un poco de aceite de oliva. Una vez caliente, agregue los chalotes, el chile y el ajo y cocine hasta que estén blandos, luego agregue el cavolo nero. Agregue 4 cucharadas de agua a la sartén, una buena pizca de sal marina y cubra. Cocine a fuego medio, revolviendo regularmente, durante aproximadamente 20-25 minutos o hasta que el cavolo nero esté completamente suave a la picadura. Escurra el exceso de agua y déjelo en la sartén, cubierto.", "Vuelva a calentar la calabaza en el horno hasta que esté caliente. Retire y extienda una fina capa de frutas de mostaza en la parte superior de las rodajas de calabaza seguido de la ralladura de limón y el queso parmesano en rodajas para cubrir toda la superficie. Vuelva a colocar en el horno para ablandar y derretir ligeramente el queso.", "Calentar una olla pequeña y agregar suficiente aceite para cubrir la base de la sartén. Una vez caliente, agregue las hojas de salvia y cocine hasta que estén crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Vuelva a calentar el cavolo nero y la salsa de tomate. Coloque el cavolo nero en los platos primero y luego aplique salsa de tomate sobre y alrededor. Coloque la calabaza en la parte superior. Triture dos galletas amaretti sobre la calabaza y termine con las hojas de salvia fritas."], "url": "www_bbc_co_uk_food_recipes_tortelliless_di_zucca_63852", "title": "Tortelli de calabaza (menos)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina 400g / 14oz '00', más extra para quitar el polvo", "3 huevos medianos de granja", "sémola, para quitar el polvo (opcional)", "200 g / 7 oz de espinacas, cocinadas en agua con sal y picadas", "200g / 7oz de ricotta", "30g / 1oz de queso parmesano rallado", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "pequeño puñado de piñones", "puñado de hojas de salvia", "50g / 2oz de mantequilla", "parmesano, rallado o en virutas"], "method": ["Para la pasta, vierta la harina en un montículo sobre una superficie plana y haga un pozo en el centro. Agriete los huevos en el pozo y gradualmente mezcle con un cuchillo sin filo o con sus manos. Cuando la masa se haya convertido en una pasta espesa, utiliza tus manos para incorporar más harina.", "Puedes tamizar la harina restante y usar la harina tamizada mientras amasas la masa para evitar que se pegue a la superficie y a tus manos, pero ten cuidado de no secar demasiado la masa. Amasar hasta que esté bien mezclado y la masa sea suave y flexible. No te preocupes si no has agotado toda la harina.", "Deje reposar la pasta durante aproximadamente 20 minutos con un recipiente invertido sobre ella o déjela tapada con una película adhesiva. Puedes tamizar cualquier resto de harina y guardar esta harina para extender la pasta.", "Mientras tanto, para el relleno, en un tazón limpio, mezcle bien la espinaca, la ricota, el parmesano y la nuez moscada, y sazone con sal y pimienta negra recién molida.", "Divida la pasta fresca en cuatro y guarde tres porciones debajo de un bol mientras rueda y rellene un cuarto. Esto evita que la pasta se seque. Estire la pasta en una tira larga y ancha de aproximadamente 1 mm de espesor, ya sea a mano o con una máquina. Cuando pueda ver su mano a través de él, estará listo para el relleno. Corta la tira por la mitad.", "Coloque cucharaditas del relleno en una línea en el centro de una de las tiras a unos 5 cm de separación. Coloque la otra tira directamente en la parte superior. Presione el aire alrededor del relleno empujando hacia abajo la pasta alrededor de ellos sellándolos. Ahora tome una copa de vino pequeña o un cortador redondo que mida unos 7 cm / 3 pulgadas y corte círculos de pasta alrededor de cada montículo de relleno.", "Pueden cocinarse de inmediato o almacenarse en sémola fina durante hasta dos horas. También puede congelarlos en esta etapa y luego cocinarlos congelados cuando esté listo.", "Para cocinar, ponga a hervir un sartén grande de agua con sal y baje suavemente en los tortellini. Cocine por unos cuatro minutos o hasta que la pasta esté suave pero no floja.", "Mientras la pasta se cocina, prepare la salsa. Precalentar la parrilla a caliente.", "Tueste los piñones debajo de la parrilla o en una sartén seca. Se doblan rápidamente, así que no los quites de la vista.", "Coloque los piñones, las hojas de salvia y la mantequilla en una sartén y derrita la mantequilla teniendo cuidado de no quemarla. Agregue una cucharada de agua de pasta y revuelva para emulsionar la salsa. Retire del fuego.", "Cuando la pasta esté lista, escurra y mezcle con la salsa en la sartén. Servir inmediatamente espolvoreado con parmesano."], "url": "www_bbc_co_uk_food_recipes_tortelliniwithspinac_82375", "title": "Tortellini con espinacas y ricotta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortelliniwithspinac_82375_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20 g / ¾oz de ceps secos", "6 cucharadas de aceite de oliva", "Setas de botón de 200 g / 7 oz, finamente rebanadas", "200g / 7oz de queso ricotta, desmenuzado", "100g / 4oz groseramente rallado Fontina", "50 g / 2 oz de queso Pecorino finamente rallado", "3 huevos, ligeramente batidos", "sal", "pimienta negra recién molida", "Tortiglioni seco 375g / 13oz"], "method": ["Remoje los ceps en agua tibia durante 20 minutos. Drene, reteniendo el agua tibia remojada. Exprime los ceps secos y píncalos finamente.", "Caliente el aceite y fríe los champiñones con cuidado. Agregue los ceps con 2-3 cucharadas de agua de remojo y cocínelos durante aproximadamente 5 minutos. Retire del fuego y mezcle suavemente los quesos ricotta, Fontina y Pecorino, y los huevos batidos. (Los huevos no deben cocinarse para que permanezcan líquidos en esta etapa). Pruebe y agregue sal si es necesario y pimienta.", "Mientras tanto, cocine la pasta durante 6-7 minutos o hasta que esté al dente, y escurra. Regrese la pasta a la fuente vacía y mezcle bien con la salsa, de modo que el huevo empiece a espesarse con el calor de la pasta."], "url": "www_bbc_co_uk_food_recipes_tortiglioniwithmushr_70040", "title": "Tortiglioni con champiñones y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]