[{"isVegetarian": false, "title": "Chinese duck noodle soup and wontons", "url": "www_bbc_co_uk_food_recipes_chinese_duck_noodle_soup_76266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz duck bones and trimmings, chopped", "1 carrot, chopped", "1 stalk celery, chopped", "1 onion, chopped", "1 leek, chopped", "2 star anise ", "1 tbsp black peppercorns", "600ml/21fl oz chicken stock", "2 x duck crowns (or 4 duck breasts)", "2 tsp Chinese five-spice", "2 duck legs, bones removed", "4 spring onions, white parts chopped, green parts reserved for garnish", "2 tsp dark soy sauce", "2 tsp sesame oil", "20 round dim sum (gyoza) wrappers", "1 piece root ginger, unpeeled, sliced", "2 red chillies", "6 coriander roots", "4 whole spring onions", "3 tbsp fish sauce", "4 star anise", "300g/10oz fresh egg noodles", "small handful coriander leaves", "2 red chillis, seeds removed, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make a duck stock, heat a large casserole or heavy-based saucepan and add the duck bones and any duck trimmings. Brown them and render out any fat and juices. ", "Add the vegetables to the pan with the star anise and black peppercorns. Pour in the chicken stock and cover with 600ml/21fl oz water. Bring to the boil and cook for about 30 minutes.", "Meanwhile, remove the duck breasts from the crowns and score them. Season with Chinese five-spice and set aside in the fridge until ready to cook.", "Preheat the oven to 200C/400F/Gas 6", "For the dumplings. chop the duck leg meat and place in a bowl. Mix with the chopped spring onion whites, soy sauce and sesame oil. Take the wrappers and moisten with a little cold water, place a small teaspoon of the mixture into the centre of each wrapper and fold together to form a dumpling. Make 20 dumplings.", "Place the duck breasts into a cold, ovenproof frying pan and gradually heat until the fat begins to render. Turn over and cook in the oven for six minutes. Remove after this time and allow to rest while you finish the soup.", "To finish the stock, put the root ginger, chilli, coriander root, whole spring onions and remaining four star anise in a clean pan. Strain the stock and pass through a fine sieve, then add it into the pan. Flavour with the fish sauce. Bring to a simmer and skim off any excess fat that rises to the surface. Add the dumplings and cook for 2-3 minutes. Pass the stock through a sieve again and reserve for serving.", "Cook the egg noodles according to packet instructions.", "To serve, arrange some egg noodles in each serving bowl along with five dumplings and a sliced duck breast. Pour over about a quarter of the stock, garnish with the greens from the spring onions, coriander leaves and sliced chilli."]}, {"isVegetarian": false, "title": "Chinese plum chicken", "url": "www_bbc_co_uk_food_recipes_chinese_plum_chicken_26015", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chinese_plum_chicken_26015_16x9.jpg", "ingredients": ["1 tbsp olive oil", "2 onions, thinly sliced ", "3 garlic cloves, finely chopped", "10 plums, quartered and stoned ", "4cm/1½in fresh ginger, peeled and finely chopped", "8 chicken thighs, boneless, skin removed", "2 tbsp soy sauce", "large pinch caster sugar", "150g/5½oz white long grain rice", "1 large head broccoli, cut into florets", "handful coriander leaves, roughly chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.  ", "Heat the oil in a casserole dish over a medium heat. Add the onions and garlic and cook until softened, stirring occasionally. ", "Stir in the plums, ginger, chicken, soy sauce, sugar and 100ml/3½fl oz water. Cover with a lid and bring to the boil.", "Transfer the dish to the oven and bake for 30–40 minutes, or until the chicken is cooked through and the plums have collapsed into a sauce.  Taste and season with more soy sauce if necessary.", "Meanwhile, cook the rice to packet instructions. Leave with the lid on until ready to serve. ", "Meanwhile, place the broccoli in a metal colander over a pan of simmering water. Cover with a lid and steam until just tender. Alternatively, cook using a steamer.", "Serve the rice with the plum chicken and broccoli. Scatter over the coriander."]}, {"isVegetarian": false, "title": "Chinese beef with cashews and soy chilli dressing", "url": "www_bbc_co_uk_food_recipes_chinesebeefwithcashe_89448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz sirloin steak", "freshly ground black pepper", "1 tbsp soy sauce", "1 tbsp honey", "1 red chilli, finely sliced", "½ lime, juice only", "100g/3½oz rice noodles, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the olive oil into the steak and season with the freshly ground black pepper. ", "Heat a frying pan over a high heat. Add the steak and fry for 3-4 minutes on each side, or until cooked to your liking. Remove and set aside in a warm place to rest.", "Add the soy sauce, honey, chilli and lime to the pan the steak was cooked in and mix thoroughly. Cook over a medium heat for 2-3 minutes until the sauce has reduced to a sticky glaze. ", "To serve, cut the steak in half. Place the cooked rice noodles onto a serving plate, arrange the slices of steak on top, and pour the juices from the pan all over."]}, {"isVegetarian": false, "title": "Chinese-style spare ribs with stir-fried cabbage", "url": "www_bbc_co_uk_food_recipes_chinesespareribswith_88340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large spare ribs, cut into individual ribs", "2 tbsp Shaoxing rice wine", "1 tbsp light soy sauce", "1 tbsp sesame oil", "1 tbsp cornflour", "vegetable oil, for deep frying", "3 tbsp Shaoxing rice wine", "3 tbsp plum sauce", "2 tbsp hoi sin sauce", "3 tbsp honey", "2 tbsp light soy sauce", "75ml/3fl oz cider vinegar", "150ml/5fl oz chicken stock", "1 tbsp Chinese five-spice powder", "2 garlic cloves, crushed", "5cm/2in fresh root ginger, grated", "1 tbsp vegetable oil", "2 garlic cloves, finely sliced", "5cm/2in piece fresh root ginger, finely chopped", "1 long red chilli, finely sliced", "½ Chinese cabbage, finely shredded", "2 tbsp light soy sauce"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the ribs, place all of the ribs ingredients into a bowl and stir to combine. Cover the bowl with cling film and place into the fridge to marinate for four hours.", "Heat a deep fat fryer to 190C, or place the oil in a deep heavy-based pan so that it half-fills the pan. Heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Remove the ribs from the fridge and drain off any excess marinade. Carefully place into the hot oil in batches of 2-3 ribs at a time and cook until nicely browned. Remove the ribs with a slotted spoon and drain on to kitchen paper.", "For the sauce, place all of the sauce ingredients into a large shallow pan with a lid and stir to combine. Place the pan over a medium heat and bring to a gentle simmer.", "Add the fried ribs and bring the sauce back to a simmer. Cover and cook for 40-50 minutes until the ribs are tender, turning the ribs several times during the cooking time. Remove the lid for the last five minutes of cooking.", "For the cabbage, heat a frying pan until hot, then add the oil, garlic, ginger and chilli and stir-fry for 30 seconds.", "Add the cabbage and stir-fry for a further 2-3 minutes, or until the cabbage is just wilted.", "Add the soy sauce and stir to combine.", "To serve, spoon a little cabbage onto each plate. Place two ribs onto each plate and serve with extra sauce in a serving jug alongside."]}, {"isVegetarian": false, "title": "Chinese stir-fried rice", "url": "www_bbc_co_uk_food_recipes_chinesestirfriedrice_68033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1oz/25g Chinese dried shrimps ", "¼oz/5g Chinese dried mushrooms ", "1½ tbsp groundnut or other flavourless oil ", "1 small onion, peeled and finely chopped ", "4 rashers streaky bacon, chopped into ¼ inch/5mm pieces ", "2oz/50g peas, fresh if possible, defrosted if frozen ", "2 large eggs, lightly beaten ", "2 spring onions, split lengthways and finely chopped ", "1 tablespoon Japanese soy sauce ", "white basmati rice measured up to 8fl oz/225ml level in a measuring jug ", "1½ tsp teaspoons groundnut or other flavourless oil ", "1 small onion, peeled and finely chopped ", "1 rounded tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Begin by making the rice: Warm the lidded frying pan over a medium heat, then add the oil and the onions and let them cook for 3-4 minutes, until lightly tinged brown. Next stir in the rice - there's no need to wash it - and turn the grains over in the pan so they become lightly coated and glistening with oil. Then add 16fl oz/450ml of boiling water and the salt, stir once only, then cover with the lid. Turn the heat to its very lowest setting and let the rice cook gently for exactly 15 minutes. Don't remove the lid and don't stir the rice during cooking, because this is what will break the grains and release their starch, which makes the rice sticky.", "After 15 minutes, tilt the pan to check that no liquid is left; if there is, pop it back on the heat for another minute. When there is no water left in the pan, take the pan off the heat, remove the lid and cover with a clean tea cloth for 5-10 minutes then allow to cool completely before using.", "Put the shrimps and mushrooms in a small bowl, pour over 16fl oz/450ml of boiling water and leave them to soak for 30 minutes. Then squeeze the liquid from them, discard the mushroom stalks and slice them finely. Then heat half the oil in a wok or pan and, when it's really hot, quickly fry the onions and bacon for 3 minutes, moving them around in the pan until the bacon is crispy. Then add the shrimps, peas and mushrooms and stir-fry these for about 1 minute. Now add the remaining oil to the pan and, when it's smoking hot, add the rice and stir-fry, this time for about 30 seconds. Now spread the ingredients out in the pan and pour in the beaten eggs. It won't look very good now, but keep on stir-frying, turning the mixture over, and the eggs will soon cook into little shreds that mingle with the other ingredients. Finally, add the spring onions and soy sauce, give it one more good stir and serve."]}, {"isVegetarian": true, "title": "Chinese-style banana fritters", "url": "www_bbc_co_uk_food_recipes_chinesestylebananfri_85342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "125g/4½oz cornflour", "1 tsp baking powder", "250ml/9fl oz sparkling water", "1 tsp sesame oil", "4 bananas, peeled, cut into chunks", "vegetable oil, for deep-frying", "250g/9oz caster sugar ", "4 tbsp water", "3 tbsp sesame seeds ", "vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, sift the flour, cornflour and baking powder together into a bowl, then stir in the water and sesame oil until a smooth batter is formed.", "Add the banana pieces and gently mix until completely coated in batter. ", "Half-fill a deep, heavy-bottomed saucepan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the bananas into the oil and deep-fry until golden brown. Carefully remove with a slotted spoon and drain onto paper towels.", "For the caramel, place the sugar, water and sesame seeds into a saucepan over a low heat and cook until all of the sugar has melted. Increase the heat to bring to the boil and continue cooking, without stirring, until the mixture becomes a light caramel colour.", "Remove the caramel from the heat and, one at a time, dip the banana fritters into the hot caramel. Turn each fritter over with a fork to coat all over, then remove immediately and plunge into a bowl of iced water. Remove the fritter from the water and leave to drain on a wire rack while you dip the remaining fritters.", "To serve, place the fritters onto plates and place a scoop of vanilla ice cream alongside."]}, {"isVegetarian": false, "title": "Chinese-style crispy pork with onion", "url": "www_bbc_co_uk_food_recipes_chinesestylecrispypo_76405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil for deep frying", "50g/1¾oz plain flour", "50g/1¾oz cornflour", "½ tsp paprika", "½ tsp cumin", "½ tsp chilli powder", "½ pork fillet, cut into strips", "½ onion, cut into rings", "50g/1¾fl oz milk"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil ready for deep frying.  (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) ", "Mix together the flours and the spices and coat the pork. ", "Soak the onion in the milk then toss through the flour mix. ", "Deep fry both the pork and the onion rings for 2-3 minutes or until crisp and golden. Serve."]}, {"isVegetarian": false, "title": "Chinese-style pork patties with chilli dip", "url": "www_bbc_co_uk_food_recipes_chinesestyleporkpatt_84653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 boneless, skinless chicken breast, roughly chopped", "2 limes, juice only", "1 tsp Chinese five-spice powder", "1 tbsp light soy sauce", "400g/14oz pork mince", "1 green chilli, finely chopped", "4 tbsp roughly chopped fresh coriander leaves", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "2 long red chillies, finely chopped", "100g/3½oz caster sugar", "50ml/2fl oz water", "50ml/2fl oz white wine vinegar", "1 lime, juice only", "3 tbsp sesame oil ", "1 tsp light soy sauce", "4 spring onions, cut into fine strips", "½ cucumber, cut into fine strips", "2 tbsp fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/385F/Gas 5.", "Place the chicken, lime juice, five-spice powder and soy sauce into a food processor and pulse until just combined.", "Add the pork mince, green chilli and fresh coriander and pulse again to combine well as a rough paste. Season with salt and freshly ground black pepper.", "Form the mince mixture into golf ball-sized balls and flatten slightly into patties.", "Heat an ovenproof frying pan until hot and add the vegetable oil and mince patties and fry for 1-2 minutes on each side, or until golden-brown, then transfer to the oven to cook for 4-5 minutes, or until completely cooked through.", "For the dip, place the chillies, sugar, water and vinegar into a saucepan over a medium heat and bring to the boil. Cook for 4-5 minutes, until just beginning to thicken, then remove from the heat and allow to cool slightly.", "Meanwhile, for the salad, whisk the lime juice, sesame oil and soy sauce together in a bowl. Add the spring onions, cucumber and coriander leaves and mix together to coat well.", "To serve, place the salad mixture onto a plate, top with a pile of the pork patties and drizzle with a little of the chilli dip. Place the remaining dip into a small bowl and serve alongside."]}, {"isVegetarian": true, "title": "Chipotle chilli and smoked cheddar bagels", "url": "www_bbc_co_uk_food_recipes_chipotle_chilli_and_75319", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz strong white bread flour", "10g/¼oz fast-action yeast", "1½ tbsp caster sugar", "1 tsp cayenne pepper", "½ tbsp dried oregano", "310ml/10fl oz warm water", "3 tsp salt", "2 tsp vegetable oil", "60g/2¼oz smoked cheddar, finely grated ", "2-4 chipotle chillies, chopped", "1 free-range egg, lightly beaten, for glazing", "smoked paprika and extra oregano, to sprinkle on top", "1½ tbsp light brown sugar for poaching water"], "serves": "Makes 12 bagels", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4, lightly oil a large bowl and grease two large baking sheets.", "In a large clean bowl, mix the flour, yeast, caster sugar, cayenne pepper and dried oregano together. In a separate bowl, mix the warm water, salt and oil, then slowly combine with the dry ingredients.", "On a floured surface, knead the dough until smooth and elastic. Transfer to the oiled bowl, cover with a damp cloth and leave for 10 minutes. Briefly knead the dough again for a minute, cover again and leave to prove for a further 10 minutes. ", "Add the cheese and chillies to the dough and knead until evenly distributed. Cover and set aside to prove for 30 minutes.", "Divide the dough into 12 equal pieces and roll each piece into a neat ball. Cover with a damp tea towel and set aside to prove for 20 minutes.", "Shape the dough balls into rings by inserting a wooden spoon into the centre and using your fingers to gently stretch the dough.", "To prepare the poaching water, fill two large pans with water, add the brown sugar and bring to the boil. Poach the bagels two or three at a time for 30 seconds on each side. Lift them out with a slotted spoon, shake off any excess water and lay them on the prepared baking trays. ", "Brush lightly with egg, sprinkle over the oregano and smoked paprika then transfer to the oven for 20-25 minutes until golden-brown."]}, {"isVegetarian": false, "title": "Chinese-style stir-fried beef with spring onions and green peppers", "url": "www_bbc_co_uk_food_recipes_chinesestylestirfrie_87959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "125g/4½oz beef steak, finely sliced", "1 tsp Chinese five-spice powder ", "salt and freshly ground black pepper", "½ green pepper, finely sliced", "2 spring onions, finely sliced", "5cm/2in piece fresh ginger, finely sliced ", "3 tbsp soy sauce", "2 tsp sesame oil", "splash boiling water", "1 tbsp sesame seeds, toasted", "small handful fresh coriander, chopped", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a wok until very hot. Season the sliced beef with the Chinese five-spice powder, salt and freshly ground black pepper. Add the beef to the hot wok and fry over a very high heat for 30 seconds. ", "Add the sliced pepper, spring onions and ginger and fry for 1-2 minutes. Add the soy sauce and sesame oil and stir to coat. Add a splash of boiling water, stir well and spoon into a serving bowl.", "To serve, garnish with toasted sesame seeds, coriander and chopped chives."]}, {"isVegetarian": false, "title": "Chive bread with salmon", "url": "www_bbc_co_uk_food_recipes_chivebreadwithsalmon_73332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz fresh chives", "4 thin, square slices dark rye or pumpernickel bread", "50g/2oz light cream cheese", "200g/7oz smoked or cured salmon, finely sliced", "50g/2oz salmon roe", "1 lemon, quartered"], "serves": "Makes 16 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["With a pair of scissors, very finely snip the chives, and arrange on a flat plate. ", "Spread the bread with the cream cheese right to the edges. ", "Lay the bread cheese-side down on the chives, pressing lightly, until each slice is completely covered with a fine layer of chives, from edge to edge.", "Cut each slice into four squares. Trim the salmon and fold on top of each bread. ", "Top with a little salmon roe and a few snipped chives and serve with the lemon wedges."]}, {"isVegetarian": true, "title": "Chocolate, almond praline and saffron opera cake", "url": "www_bbc_co_uk_food_recipes_chocolate_almond_praline_58078", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7 free-range eggs, whites only (yolks reserved for buttercream)", "50g/1¾oz caster sugar", "260g/9½oz ground almonds", "260g/9½oz icing sugar", "7 free-range eggs", "85g/3oz plain flour", "55g/2oz unsalted butter, melted and cooled, plus extra for greasing", "1-2 tsp vanilla extract", "700g/1lb 9oz caster sugar", "200g/7oz flaked almonds, toasted", "8 free-range egg yolks (partly from above) ", "300g/10½oz butter, at room temperature", "230ml/8fl oz double cream", "pinch saffron threads", "140g/5oz dark chocolate (minimum 70% cocoa solids), broken into small pieces ", "140g/5oz milk chocolate, broken into small pieces ", "1 tbsp soft butter", "150g/5½oz caster sugar", "1 tsp coffee essence", "3-4 tbsp amaretto liqueur", "pinch saffron threads", "50g/1¾oz dark chocolate", "300g/10½oz white chocolate", "pinch saffron threads", "240ml/8½fl oz cream", "225g/8oz dark chocolate, finely chopped ", "1 tbsp liquid glucose (or butter) "], "serves": "Makes 1 large cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease and line 3 x 23x31cm/9x12.5in Swiss roll tins.", "For the sponge cake, whisk the egg whites until soft peaks form when the whisk is removed. Add the caster sugar and whisk to stiff peaks. Set aside.", "In a separate bowl, beat the almonds, icing sugar and eggs until doubled in volume. Fold in the flour, then stir in the melted butter and vanilla extract. ", "Fold in the stiff egg whites until incorporated and then quickly divide the batter equally between the prepared tins (approximately 275g/9¾oz per tin).", "Bake in the preheated oven for five minutes, or until springy to the touch and lightly golden-brown. ", "When the cake is cooked set it aside to cool.", "For the praline buttercream, make a caramel. Melt 400g/14oz of the caster sugar in a heavy-based pan until it is a deep golden-brown (CAUTION: do not leave unattended). Add the flaked almonds then spread in a thin layer on a silicon mat.  Set aside to cool. When the praline is cold and hard, break it into chunks and place in a food processor. Blend the praline to a powder.", "Add the remaining caster sugar and 80ml/2½fl oz of water to a pan and slowly heat to 113C/235F (use a sugar thermometer for this).", "Meanwhile, whisk the egg yolks in a freestanding mixer until light and fluffy. ", "When the sugar syrup reaches 113C/235F add it to the egg yolks in a large bowl in a slow stream, whisking all the time. Keep whisking until the mixture has cooled.", "Beat the butter until soft then gradually add it to the yolk mixture. Stir in the crushed praline and set aside. ", "For the ganache, warm the cream over a low heat, then add the saffron and set aside to infuse for a few minutes. ", "Heat the cream to boiling point, then remove it from the heat and add the chocolate. Set aside for five minutes to let the chocolate melt. ", "Stir the cream to incorporate the melted chocolate. Mix in the soft butter and set aside to cool.", "Meanwhile, for the syrup, gently heat 150ml/5½fl oz of water and the sugar in a pan to make a syrup. When all the sugar has dissolved bring the syrup to a boil for a few minutes. Remove from the heat and add the coffee essence, amaretto and saffron. Set aside.", "For the decoration, melt the dark chocolate and pour into a piping bag fitted with a plain nozzle. Pipe an 'O' for opera onto a rectangular piece of acetate/greaseproof paper (approximately 7x5cm/2¾x2in) and place it in the freezer to set.", "Meanwhile, melt half of the white chocolate in a heatproof bowl set over a pan of simmering water. When the chocolate reaches 45C/113F add the saffron. Add 50g/1¾oz of the remaining white chocolate and allow it to melt before stirring to combine. ", "When the dark chocolate ‘O’ is set hard, quickly smooth the melted white chocolate over the top and return to the freezer to set.", "When the white chocolate is almost set, peel away the acetate/greaseproof paper and place the chocolate rectangle onto a chopping board (you'll see the dark 'O' against the white chocolate background). Tidy the edges using a sharp knife, if necessary, then return to the freezer to set completely. ", "To construct the cake, place one of the cakes on a serving plate. Drizzle over a third of the syrup, spread over half the buttercream and top with half the ganache. Place another layer of cake on top and repeat the process, using the same amount of syrup, half the remaining buttercream and all the ganache. Place the final layer of cake on top and drizzle with the remaining syrup. Cover the top with a thin, smooth layer of buttercream (a crumb coat) then place the whole cake in the freezer to set the buttercream (so it doesn’t melt when you add the dark chocolate glaze). ", "For the dark chocolate glaze, heat the cream until scalding. Pour the cream over the chocolate and leave to sit for a minute. Gently stir until the chocolate is completely melted and smooth, then add the liquid glucose.", "For the chocolate decoration, melt the remaining white chocolate and pour into a piping bag with a small plain nozzle attached. ", "When the buttercream is chilled, pour a smooth layer of the dark chocolate glaze on top of the cake, taking care not to let it run down the edges. Place the chocolate decoration in the middle and pipe the melted white chocolate into shapes to decorate. "]}, {"isVegetarian": false, "title": "Chipotle miso chicken", "url": "www_bbc_co_uk_food_recipes_chipotle_miso_chicken_36830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.8kg/4lb chicken", "50g/1¾oz long-grain rice ", "150g/5½oz white miso paste", "150g/5½oz chipotle in adobo sauce", "125ml/4fl oz soured cream", "1 romaine lettuce, leaves separated", "1 radicchio, leaves separated", "1 tbsp sesame seeds", "1 green chilli, thinly sliced", "3 stalks fresh mint", "5 stalks fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1. Open up the chicken cavity, pull the legs apart as much as possible to enable the heat to cook the bird evenly, put it in a roasting tin and season with salt. Roast the chicken for 3 hours, basting the skin with the juices halfway through. Using a meat thermometer, check that the internal temperature reaches 75C. To further check that the chicken is cooked through, make sure the juices run clear with no trace of pink when the thickest part of the leg, between the drumstick and the thigh, is pierced with a skewer. ", "Preheat the grill or barbecue to very hot. ", "Toast the rice in a dry, medium-hot pan until coloured. Tip into a food processor and blend to a coarse powder. Tip into a bowl and set aside. ", "Blend the miso and chipotle in a food processor until smooth.", "Joint the chicken into six or eight pieces. Grill the pieces under the grill or on the hot barbecue for 5–6 minutes to colour the skin.", "Stir a dash of water into the soured cream.", "To serve, lay the salad leaves on a serving platter and put the chicken on top. Season well with salt and pepper. Cover the chicken with the miso-chipotle paste, drizzle over the soured cream, sprinkle over the sesame seeds, chilli, rice powder and herb stalks and serve."]}, {"isVegetarian": true, "title": "Chocolate almond Caprese cake", "url": "www_bbc_co_uk_food_recipes_chocolate_almond_caprese_27893", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_almond_caprese_27893_16x9.jpg", "ingredients": ["200g/7oz dark chocolate, minimum 70% cocoa solids, cut into pieces", "200g/7oz unsalted butter, softened, cut into small pieces", "200g/7oz golden caster sugar", "5 free-range eggs, ‎separated", "200g/7oz ground almonds "], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160 Fan/Gas 4. Grease a 23cm/9in loose-bottomed round cake tin and line with greaseproof paper.", "Melt the chocolate in a small heatproof bowl set over a saucepan of gently simmering water, making sure the bowl doesn’t touch the water. ", "Put the butter and sugar in a large mixing bowl and beat until light and creamy. Whisk in the egg yolks. Mix in the almonds, then lightly fold in the melted chocolate. ", "Using an electric hand whisk, beat the egg whites in a large, clean glass bowl until stiff peaks form. Fold into the almond mixture. Spoon into the prepared tin and level out the top. ", "Bake for 30–40 minutes, or until a skewer inserted into the centre of the cake comes out clean. Leave to cool slightly in the tin, then transfer to a cooling rack."]}, {"isVegetarian": true, "title": "Chocolate amaretto mousse cake", "url": "www_bbc_co_uk_food_recipes_chocolate_amaretto_21084", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "55g/2oz caster sugar", "115g/4oz unsalted butter, diced", "8 free-range eggs", "250g/9oz caster sugar", "4 tbsp warm water", "250g/9oz plain flour, sifted", "115g/4oz ground almonds", "4 free-range eggs, separated, plus 2 free-range egg yolks", "85g/3oz caster sugar ", "280g/10oz good quality plain chocolate, melted", "300ml/½ pint double cream, whisked until stiff peaks form when the whisk is removed", "300ml/½ pint double cream", "almond liqueur", "225g/8oz hard amaretti biscuits, crumbled", "crystallised violets"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease and flour three 23cm/9in cake tins. ", "For the shortbread base, sift the flour into a bowl, add the sugar and rub in the butter. Press the mixture into the base of one of the cake tins and bake in the oven for 25-30 minutes or until golden-brown.", "For the sponge, increase the oven to 190C/375F/Gas 5. Whisk together the eggs and sugar until pale and fluffy then add the warm water. Mix together the flour and ground almonds in a separate bowl then fold into the egg mixture, one third at a time, with a large metal spoon.  ", "Divide the mixture between the two remaining cake tins and bake for 12-15 minutes or until golden-brown but still slightly springy in the middle. Turn the cakes onto a wire rack to cool.", "For the mousse, whisk the six egg yolks with the caster sugar until pale and fluffy. (Reserve one tablespoon of the caster sugar.)", "Whisk the four egg whites in a clean bowl then fold in the remaining caster sugar.", "Fold the melted chocolate into the egg yolk mixture, then fold in the cream, and finally the egg whites. Place the mixture in the fridge to chill.", "Whisk the cream in a bowl until stiff peaks form when the whisk is removed. Add almond liqueur, to taste.", "To assemble the cake, remove the shortbread base from the tin and place on a serving plate. Cut the sponge cakes in half horizontally and sprinkle them with a little almond liqueur. Pipe or spread a little of the mousse onto the shortbread, add a layer of sponge, spread over some mousse and scatter over a quarter of the crushed amaretti biscuits. Repeat these layers of sponge, mousse and amaretti then decorate the cake with swirls of the whipped cream. Top each swirl with a crystallised violet."]}, {"isVegetarian": true, "title": "Chocolate and stout cake", "url": "www_bbc_co_uk_food_recipes_chocolate_and_ale_cake_09939", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_ale_cake_09939_16x9.jpg", "ingredients": ["150ml/5fl oz stout", "75g/2½oz good-quality dark chocolate (minimum 70% cocoa solids), broken into pieces ", "100g/3½oz unsalted butter, softened, plus extra for greasing", "275g/10oz soft light-brown sugar", "2 free-range eggs, lightly beaten", "175g/6oz self-raising flour ", "100g/3½oz milk chocolate, broken into pieces", "50g/2oz unsalted butter", "2 tbsp stout", "100g/3½oz icing sugar", "50g/2oz chopped roasted hazelnuts, to decorate"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in cake tin with butter.", "For the cake, bring a little water to the boil in a pan. Reduce the heat until the water is simmering, then suspend a heatproof bowl over the water, making sure that the bottom of the bowl does not touch the water.", "Add the stout and dark chocolate pieces to the heatproof bowl and heat gently until melted. Once melted, remove the bowl from the heat and set aside to cool. ", "In a separate bowl, beat together the butter and sugar until light, fluffy and well combined, using either a food processor or electric whisk. ", "Add the eggs one at a time, beating well between each addition.  ", "Pour in the cooled chocolate-and-stout mixture and beat until well combined. Fold in the flour. ", "Spoon the cake mixture into the prepared tin and bake in the middle of the oven for 30-35 minutes, or until a skewer inserted into the centre of the cake comes out clean. ", "Remove the cake from the oven and set aside to cool in the tin for a few minutes, then remove from the tin and set aside to cool completely on a wire rack.", "Meanwhile, for the icing, repeat the process of bringing a little water to the boil in a pan. Reduce the heat until the water is simmering, then suspend a heatproof bowl over the water, making sure that the bottom of the bowl does not touch the water.", "Add the chocolate, butter and stout to the bowl, stirring until just melted. Remove the bowl from the heat and set the mixture aside to cool slightly. ", "When the melted chocolate mixture has cooled, transfer it to a food processor, add the icing sugar and pulse until smooth and well combined. (Alternatively, whisk in the icing sugar using a hand-held electric mixer.) ", "When the cake has completely cooled, spread the icing evenly over the top and sides, then sprinkle over the chopped hazelnuts. When the icing has dried, serve."]}, {"isVegetarian": true, "title": "Chocolate chip fluffy pancakes", "url": "www_bbc_co_uk_food_recipes_chocchippuffypancake_65968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocchippuffypancake_65968_16x9.jpg", "ingredients": ["2 free-range eggs", "5 tbsp milk", "150g/5oz self-raising flour", "2 tbsp caster sugar", "pinch of salt", "75g/3oz dark chocolate chips", "sunflower oil, for frying", "butterscotch ice cream, to serve", "maple syrup or clear honey, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk together the eggs and milk. ", "Place the plain flour, caster sugar and a pinch of salt in large bowl, then make a well in the centre, pour in the liquid and beat with a hand whisk until smooth. ", "Stir in the chocolate chips, then cook spoonfuls of the mixture in a non-stick pan, using just a tiny splash of sunflower oil, for 1-2 minutes on each side until puffed and golden. ", "Stack and serve with a scoop of butterscotch ice cream and a drizzle of maple syrup."]}, {"isVegetarian": true, "title": "Chocolate and ale cake with muscovado malt cream", "url": "www_bbc_co_uk_food_recipes_chocolate_and_ale_cake_72348", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz dark ale, plus 4 tbsp for the icing", "50g/1¾oz cocoa powder", "110g/4oz butter, softened", "275g/9¾oz soft dark brown sugar", "2 large free-range eggs", "175g/6oz plain flour", "¼ tsp baking powder", "1 tsp bicarbonate of soda", "220g/8oz good-quality dark chocolate (minimum 70% cocoa solids) ", "220g/8oz icing sugar", "100g/3½oz soft butter", "250ml/9fl oz double cream", "50g/1¾oz muscovado sugar", "50g/1¾oz malt extract", "pinch salt"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chocolate and ale cake, grease and flour a 25cm/10in loaf tin. Preheat the oven to 180C/350F/Gas 4.", "Slowly mix the dark ale into the cocoa powder to form a paste. ", "In a separate bowl, beat the butter and soft dark brown sugar together until smooth and creamy, then add the eggs one at a time beating between each addition. ", "Stir in the cocoa and ale mixture. Sift in the flour, baking powder and bicarbonate of soda in batches, stirring between each addition.", "Pour the cake batter into the prepared tin and bake for 30-35 minutes, or until springy to the touch. Cool on a wire rack.", "Melt the chocolate in a heatproof bowl suspended over a pan of simmering water. ", "Beat the icing sugar and butter together to form a soft paste. Add four tablespoons of dark ale and then fold in the melted chocolate.", "For the muscovado and malt cream, whip all the ingredients together in a large bowl until thick and smooth.", "When the cake has cooled completely, cut it into slices. ", "Serve with the beer and chocolate icing spread over the cake and a dollop of muscovado and malt cream on the side."]}, {"isVegetarian": true, "title": "Chocolate and blackberry mousse cake with vanilla ice cream and blackberry sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_and_blackberry_33426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 medium free-range egg yolks", "120g/4¼oz caster sugar", "250ml/9fl oz full-fat milk", "250ml/9fl oz double cream", "1 vanilla pod, split lengthways, seeds scraped out", "150g/5½oz fresh blackberries", "300g/10½oz dark chocolate, in pieces", "150g/5½oz unsalted butter", "6 medium free-range eggs, separated", "50g/1¾oz caster sugar", "50g/1¾oz unsalted butter", "125g/4½oz blackberries"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the vanilla ice cream, whisk the egg yolks with 60g/2¼oz caster sugar in a large bowl until thick and creamy.", "Place the remaining caster sugar, milk, cream and vanilla seeds and pods in a pan and bring to the boil. Pour the hot milk into the whisked yolks and stir well.", "Return the mixture to the pan and cook over a very low heat, stirring constantly with a spatula, until the mixture is thick enough to coat the back of a spoon.", "Cool the vanilla mixture, then refrigerate for at least one hour. Strain the mixture into an ice cream maker and churn until frozen, following the manufacturer's instructions. ", "For the chocolate and blackberry mousse cake, preheat the oven to 180C/350F/Gas 4. Grease a 24cm/9½in springform cake tin and line it with greaseproof paper. Scatter the blackberries evenly over the base of the prepared cake tin.", "Place the chocolate and butter into a heatproof bowl set over a pan of simmering water (make sure the bowl doesn't touch the water) and allow the chocolate to melt, stirring occasionally. Remove from the heat and set aside to cool slightly.", "Place the egg yolks in a large mixing bowl with two tablespoons of the sugar and whisk lightly to combine.", "Place the egg whites in a separate bowl and whisk until soft peaks form when the whisk is removed from the bowl. Gradually add the remaining sugar to the egg whites, whisking continuously, until firm peaks are formed when the whisk is removed.", "Pour the melted chocolate into the bowl with the egg yolks and stir to combine. Fold one-third of the stiff egg whites into the egg yolk and chocolate mixture until combined, and then gently fold in the remaining egg whites.", "Pour the mixture into the cake tin and gently smooth over the top. Bake in the oven for 20-25 minutes, or until the cake is golden-brown and springy to the touch. The cake is done when a skewer inserted into the middle comes out clean.", "Remove the cake from the oven and leave to cool on a wire rack.", "To serve, melt the butter in pan and add the blackberries. Cook for 1-2 minutes. Place slices of the cake on serving plates along with a scoop of ice cream and a spoonful of the cooked blackberries."]}, {"isVegetarian": true, "title": "Chocolate and caramel spiced nut bark", "url": "www_bbc_co_uk_food_recipes_chocolate_and_caramel_63575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dark chocolate, minimum 70% cocoa solids, broken into pieces", "1 tsp ground cardamom", "1 tsp ground cinnamon", "50g/1¾oz cashew nuts, thinly sliced lengthways ", "55g/2oz almonds, thinly sliced lengthways", "50g/1¾oz light brown muscovado sugar", "10g salted butter", "75ml/2½fl oz double cream"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease and line a baking sheet with baking paper. ", "Put half the chocolate, cardamom and cinnamon in heatproof bowl. Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl. Stir occasionally until the chocolate has melted. ", "Pour the melted chocolate on to the prepared baking sheet and spread into a thin, even layer. Chill in the fridge for 15 minutes, or until set. ", "Meanwhile, make the caramel by gently melting together the sugar and butter in a saucepan over a low heat. Stir in the cream and cook for 2 minutes.", "Remove the chocolate layer from the fridge, spread the caramel sauce on top and return to the fridge for 15 minutes, or until set. ", "Put the remaining chocolate, cardamom and cinnamon in heatproof bowl. Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl. Stir occasionally until the chocolate has melted. ", "Remove the chocolate-caramel from the fridge, spread with the remaining melted chocolate and sprinkle over the cashews and almonds. Chill in the fridge until set.", "Once fully set, break the bark into pieces and place in see-through bags tied with ribbon."]}, {"isVegetarian": true, "title": "Chocolate and cardamom mousse cake with homemade honeycomb", "url": "www_bbc_co_uk_food_recipes_chocolate_and_cardamom_49894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz unsalted butter, plus extra for greasing ", "75g/3oz caster sugar", "2 free-range eggs", "½ tsp vanilla extract", "60g/2½oz plain flour, sieved ", "2 tbsp cocoa powder", "2 tsp whisky (preferably single malt)", "salt", "2 tbsp golden syrup", "100g/3½oz caster sugar", "½ tsp ground cardamom (about 12 cardamom pods, seeds finely ground)", "1½ tsp bicarbonate of soda", "250g/9oz dark chocolate, 70% cocoa solids), finely chopped", "430ml/¾ pint double cream, whipped to soft peaks", "1 tbsp whisky (preferably single malt)", "1 tsp ground cardamom (about 50–60 cardamom pods, seeds finely ground)", "50g/2oz caster sugar", "edible gold dust, to decorate"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge base, preheat the oven to 180C/350F/Gas 4. Grease a loose-bottomed 20cm/8in round cake tin with butter. ", "In a small pan, melt the rest of the butter over a gentle heat and set aside.", "Place the sugar in a metal bowl and sit it over a pan of simmering water, checking that the base of the bowl is not touching the water. Break the eggs into the bowl, and with an electric hand mixer beat the mixture over the simmering water for 1-3 minutes, until it becomes pale and frothy. Remove the metal bowl from the heat and continue to beat the mixture for a further two minutes while it cools.", "Gently stir in the vanilla extract and a pinch of salt. With a metal spoon, carefully fold in the sifted flour and cocoa powder. Slowly trickle in the melted butter and continue to combine gently.", "Pour the mixture into the greased tin and bake for 10–12 minutes, or until the centre is firm to the touch. Remove from the oven and cool a little in the tin. Drizzle the whisky over the sponge and set aside to cool completely in the tin.", "To make the honeycomb, line a 20cm/8in square cake tin with baking parchment. In a large heavy-based saucepan, heat the golden syrup and sugar together and bring to the boil, then simmer on a low heat for 5–10 minutes. The mixture will bubble and darken to a golden caramel, but be careful not to let it get too dark or the flavour will be bitter. ", "Stir in the cardamom and remove the pan from heat. Immediately – but carefully – add the bicarbonate of soda and mix it in; the mixture will instantly foam up significantly, which is why a large pan is needed to prepare the syrup. Pour immediately into the lined cake tin. Leave to set for at least an hour, then peel off the paper and break the honeycomb into bite-sized chunks. The honeycomb will stay crisp in a dry, airtight container for a day or two, but will gradually soften over time.", "To make the chocolate torte, put the chopped chocolate into a large heatproof bowl and set aside. ", "Pour 200ml/7fl oz water into a pan, add the ground cardamom and sugar, and bring to the boil, stirring. When just boiling remove from the heat and cool for 30 seconds. Pour through a very fine strainer over the chocolate, stirring continuously to form a smooth glossy mixture. Discard the contents of the strainer. Stir in the whisky.", "Fold the lightly whipped cream into the chocolate mixture; the mix will start to stiffen. Spoon the mixture over the cold sponge right to the edges of the cake tin, and level with a palette knife. The sponge will have shrunk away from the sides of the tin, so the torte will completely encase the sponge. Cover with cling film and chill in the fridge for a few hours, or overnight if possible.", "To serve, uncover the tin and push out the torte by loosening the base and moving onto a plate. Decorate with honeycomb. Cut into slices (for a smooth, professional finish, use a knife dipped in boiling water). Decorate each slice with more pieces of honeycomb, top with edible gold dust and serve with more double cream, if you like."]}, {"isVegetarian": true, "title": "Chocolate and cherry loaf", "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_39721", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_cherry_39721_16x9.jpg", "ingredients": ["500g/1lb 2oz strong plain flour, plus extra for dusting", "2 tsp salt", "30ml/1fl oz olive oil", "10g fast-action yeast", "390g/13¼fl oz jar black cherries, drained", "100ml/3½fl oz plain chocolate chips ", "100ml/3½fl oz white chocolate chips"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour into a large bowl and add the salt and olive oil to one side, and the yeast to the other. Slowly add 320ml/11fl oz water and mix by hand until the dough is pliable. ", "Tip the dough out onto a lightly floured work surface and knead for 4–7 minutes. Add the cherries to the dough, (you may need to add a little more flour if the mix becomes too sloppy), then add the chocolate chips. Mix well, adding a little flour if the dough becomes too soft. ", "Put the dough back in the bowl, cover with a clean tea towel and leave to prove until doubled in size (about 1–1½ hours).", "On a lightly floured work surface, divide the dough in half and shape each half into a long sausage-shaped strand. Lay one strand across the other to make a cross. Grab both ends of the bottom strand and pull the top end towards you, looping it under the nearer end. Lift the nearer end up and over the other strand. Repeat the looping and crossing, always working from the far strands, until the dough is all plaited. Push any loose ends under the loaf.", "Dust a baking tray with flour. Place the loaf on the baking tray. Dust with flour, place in a large plastic bag and leave to prove for an hour. ", "Preheat the oven to 220C/200C(fan)/425F/Gas 7. ", "Bake the bread for 20 minutes, then reduce the oven temperature to 200C/180C(fan)/400F/Gas 6 and bake for a further 20-25 minutes. Transfer to a wire rack to cool.", "Once cooled, slice and serve with a cup of tea or coffee. "]}, {"isVegetarian": true, "title": "Chocolate and cherry buns", "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_50877", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_cherry_50877_16x9.jpg", "ingredients": ["250ml/9fl oz milk", "75g/2½oz butter, plus extra for greasing", "500g/1lb 2oz strong white bread flour", "1 tsp mixed spice (optional)", "7g instant yeast", "75g/2½oz soft light brown sugar", "pinch salt", "1 free-range egg", "dash oil, for greasing your hands and the work surface", "100g/3½oz butter, softened", "50ml/2fl oz maple syrup", "25g/1oz dark soft brown sugar", "1 tsp ground cinnamon", "1 tsp ground mixed spice", "pinch salt", "100g/3½oz glacé cherries, halved", "100g/3½oz chocolate chips", "1 free-range egg", "2 tbsp demerara sugar", "200g/7oz icing sugar", "1-2 tbsp just-boiled water "], "serves": "Makes 10–12 buns", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Line a 26–28cm/10½–11 in round deep cake tin or a deep roasting tin with baking parchment and butter generously.", "Put the milk in a saucepan and bring to just below boiling point. Remove from the heat and add the butter. Leave to stand until the butter has melted and it has cooled to blood temperature.", "Put the flour and mixed spice (if using) in a large bowl with the yeast, sugar and a pinch of salt. Make a well in the middle. ", "Beat the egg into the milk and butter mixture. Add this to the flour and stir until well combined – you will find that you have a very soft, sticky dough.", "Lightly oil your hands and the work surface, then turn out the dough. Knead until no longer sticky and you have a smooth, elastic dough. Return the dough to the bowl and cover with a damp tea towel. Leave to prove until it has doubled in size – this will take around an hour and a half.", "For the filling, beat the butter with the maple syrup, sugar, spices and a pinch of salt until you have a creamy, toffee-coloured butter.", "Turn the dough out and roll or pat out into a rectangle of around 30x23cm/12x9in. Spread the butter mixture over the dough, then sprinkle with the chocolate chips and cherries. Roll up fairly tightly, then cut into 10–12 pieces. ", "Arrange the rounds, cut-sides down, in the deep cake tin. Brush with egg, then leave for another 30 minutes. Preheat the oven to 180C/160C Fan/Gas 4. Brush again, then sprinkle with the sugar. Bake in the oven for 20–25 minutes, or until a rich golden-brown and well risen. ", "For an optional glaze, gradually add hot water to the icing sugar to make a glaze which is thin enough to pour, but won’t run off too much. Leave the buns to cool in the tin, then drizzle over the glaze if using. Leave to set."]}, {"isVegetarian": true, "title": "Chocolate and cherry slice", "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_97312", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz dark chocolate", "225g/8oz unsalted butter", "3 free-range eggs", "225g/8oz light brown sugar", "75g/2½oz self-raising flour, sifted ", "1 tsp baking powder ", "175g/6oz shelled and skinned chopped walnuts", "pinch salt", "about 100g/3½oz glacé cherries, chopped", "200g/7oz milk chocolate, chopped", "clotted cream", "raspberries ", "few sprigs fresh mint", "icing sugar"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5 and grease and line a 20cm/8in square baking tin with baking parchment.", "Melt the dark chocolate and butter together in a heatproof bowl set over a pan of simmering water (don't let the bottom of the bowl touch the water). Remove from the heat and set aside to cool slightly. ", "In a mixing bowl, whisk the eggs until light, then beat in the sugar until fluffy. ", "In a separate bowl, mix the flour, baking powder and walnuts.", "Stir the melted chocolate mixture into the eggs with a pinch of salt. Stir in the flour mixture, milk chocolate and cherries. ", "Pour into the prepared tin and bake in the oven for 40 minutes. ", "Remove from the oven and leave to cool in the tin. ", "Cut into squares and serve with clotted cream, raspberries, fresh mint leaves and a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Chocolate and chestnut Christmas log", "url": "www_bbc_co_uk_food_recipes_chocolate_and_chestnut_69367", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_chestnut_69367_16x9.jpg", "ingredients": ["225g/8oz plain chocolate, roughly chopped", "1 tsp strong instant coffee powder", "5 free-range eggs, separated", "140g/5oz caster sugar", "icing sugar, for dusting", "holly leaves and berries, to decorate (optional)", "150ml/5fl oz double cream", "3 tbsp sweetened chestnut purée"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take a 33x23cm Swiss roll tin or baking tray and cut a double layer of non-stick baking parchment slightly bigger than the tin. Lay the parchment in the tin. Don’t worry if the edges stick up untidily round the sides. ", "Preheat oven to 200C/400F/Gas 6.", "Put the chocolate and coffee into a heavy-based saucepan with 85ml/3fl oz water and put over a low heat to melt the chocolate. ", "Beat the egg yolks and the caster sugar until pale and mousse-like. Add the melted chocolate. ", "Whisk the egg whites until stiff but not dry. With a large metal spoon, stir a small amount thoroughly into the chocolate mixture to loosen it. Fold the remaining whites in gently. Spread the mixture evenly in the lined roasting tin. ", "Bake in the preheated oven for about 12 minutes, or until the top is slightly browned and firm to touch. ", "Slide the cake parchment out of the roasting pan onto a wire rack. Leave to cool completely (do not cover). ", "To make the filling, whip the cream in a bowl, then mix in the sweetened chestnut purée. ", "When the sponge base is cooled all the way through (check underneath) you are ready to assemble the roulade. Put greaseproof paper on a work surface. Turn out the roulade onto the paper. Carefully remove the paper used to line the tin. Spread the filling evenly across the surface of the cake.", "Using the paper under the cake to help, roll it up firmly from one of the narrow ends. Rest the cake on its seam. Wrap tightly with the greaseproof paper and refrigerate for at least 30 minutes and up to overnight. (It doesn't matter if the cake breaks apart when rolling - a little sifted icing sugar will do wonders for its appearance.)", "Serve dusted with icing sugar and garnish with holly leaves and berries. "]}]