[{"isVegetarian": false, "title": "Beef and horseradish sausage rolls", "url": "www_bbc_co_uk_food_recipes_beef_and_horseradish_44048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_horseradish_44048_16x9.jpg", "ingredients": ["2 tbsp olive oil ", "1 garlic clove, crushed ", "½ tsp salt ", "300g/10½oz chestnut mushrooms, thinly sliced", "3 tbsp horseradish purée", "800g/1lb 12oz beef sausages, skins removed ", "500g/1lb 2oz ready-made puff pastry", "1 free-range egg, beaten ", "little plain flour, for dusting"], "serves": "Makes 24–30 sausage rolls", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan over a medium heat. Add the garlic, salt and mushrooms and cook until all the moisture from the mushrooms has evaporated. Transfer to a bowl and leave to cool completely. ", "Stir the horseradish purée into the mushrooms. Add the beef sausage meat and mix until well combined using your hands. ", "Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.", "Lightly dust a work surface with flour. Roll out the pastry to 25x35cm/10x14in, then cut it into three equal rectangles lengthways. Roll out each rectangle a little more, to create more width. ", "Divide the beef mixture into three equal parts. Spread one part down one side of a pastry rectangle in a long, thin sausage shape. Brush the long edge with a little beaten egg and roll the pastry up over the sausage meat to seal. Repeat with the remaining sausage meat and pastry.", "Cut each long piece into eight to ten sausage rolls and place on the prepared baking tray.  Brush each pastry with a little more beaten egg, then bake for 15–20 minutes. ", "Leave to cool for 10 minutes before eating as they will be very hot."]}, {"isVegetarian": false, "title": "Beef and mushroom stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_99051", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_mushroom_99051_16x9.jpg", "ingredients": ["150g/5½oz brown basmati rice", "1 tbsp light olive oil", "4 shallots, finely chopped", "1 tsp sweet smoked paprika", "1 red pepper, seeds removed, roughly chopped", "200g/7oz chestnut mushrooms, thinly sliced", "2 garlic cloves, finely chopped", "1 tbsp cider vinegar", "1 level tbsp wholegrain mustard", "150ml/5fl oz beef stock", "200g/7oz lean sirloin steak, visible fat removed, thinly sliced ", "100ml/3½fl oz fat-free plain fromage frais", "2 level tbsp roughly chopped gherkins", "2 tbsp finely snipped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice according to the packet instructions and keep warm.", "Meanwhile, heat the oil in a wide frying pan and fry the shallots for 5 minutes, or until softened.", "Add the paprika, pepper, mushrooms and garlic and fry for 6–8 minutes, or until softened. ", "Add the vinegar and mustard and bring to the boil. Cook until the liquid has almost evaporated. Pour over the stock and cook for 3–4 minutes, or until slightly thickened.", "Add the steak and cook over a high heat for 2–3 minutes, or until sealed and cooked to your liking.", "Turn the heat down to low and stir in the fromage frais, gherkins and half the chives. Season. ", "Serve the stroganoff with the rice, garnished with the remaining chives."]}, {"isVegetarian": false, "title": "Beef, kidney and mushroom pie with a homemade puff pastry lid", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_pie_15924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/1lb 4oz plain flour, plus extra for dusting ", "¾ tsp salt", "550g/1lb 4oz unsalted butter, soft enough to be pliable", "2 tbsp rapeseed oil", "500g/1lb 2oz beef stewing steak, cut into 5cm/2in cubes", "200g/7oz kidneys, chopped", "1 onion, chopped", "90g/3¼oz button mushrooms", "90g/3¼oz chestnut mushrooms, roughly chopped", "8 small round shallots, left whole", "2 carrots, cut into 3 pieces", "4 sprigs thyme, leaves picked", "2 bay leaves", "2 tbsp tomato purée", "200ml/7fl oz dark ale", "400ml/14fl oz beef stock, hot", "1 free-range egg, beaten", "2kg/4lb 8oz potatoes, larger potatoes cut into quarters", "150g/5½oz butter", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "200g/7oz peas, fresh or frozen"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, put the flour and salt in a large mixing bowl. Add 200ml/7fl oz water. Mix to combine and then tip out onto a floured work surface. Briefly knead to form a rough, but evenly combined, dough.  Put the pastry in the fridge to rest for 1-2 hours.", "Meanwhile, make the pie filling. Heat a lidded casserole or a large ovenproof pan over a high heat and add the oil. Once hot, fry the steak for 3-4 minutes, or until golden-brown on all sides (you may need to do this in batches). Add the kidneys and cook for 2 minutes. Transfer the meat to a warm plate and set aside. ", "Add the onion, mushrooms, whole shallots and carrots to the empty casserole and fry for 2-3 minutes, or until just softened. Add the thyme, bay leaves and tomato purée and stir well to combine.", "Add the ale and stir well, scraping any sediment up from the bottom of the casserole using a wooden spoon. Return the meat to the casserole, add the hot stock, stir well and bring the mixture to the boil. Turn down the heat, place a lid on the casserole and cook for 1½ hours, or until the beef is tender and the gravy has thickened. Once cooked, remove the pie filling from the dish and set aside to cool.", "Remove the puff pastry from the fridge and place on a lightly floured work surface. Roll the pastry out into a rectangle approximately 50x30cm/20x12in. Slice the butter and lay this over two-thirds of the dough. Fold the unbuttered dough third over the buttered one, then flip that over the remaining buttered third so that the butter is wrapped inside the dough. Take a rolling pin and lightly roll the upper surface of the dough to press out any air bubbles. Seal the edges with a sharp whack of the rolling pin.", "Turn the pastry by 90 degrees (a quarter turn) and fold the bottom third of the pastry up, then the top third down. Roll the pastry out towards the folded edges until it measures roughly 60x25cm/23x10in, then fold the pastry in by thirds again. Give the pastry a further two turns. Wrap the pastry in cling film and transfer to the fridge to chill for 30 minutes.", "To cook the pie, preheat the oven to 220C/200C Fan/Gas 7.", "Put the beef and gravy mixture in a 23cm/9in diameter round ovenproof dish. Roll out the pastry to 1cm/⅓in thickness and cut the pastry into a circle slightly bigger than the pie dish. Brush a little water around the rim of the pie dish, then place the pastry over the filling and press the edges to seal the pastry to the dish. Brush the pie with a little beaten egg, put the pie in the oven and cook for 20-30 minutes, or until the pastry is pale golden-brown and has risen. ", "Meanwhile, for the mashed potatoes boil the potatoes in salted water for 15 minutes, or until tender. Drain and put the potatoes back in the saucepan over the heat to remove excess moisture. Mash the potatoes. Heat the butter and cream in a saucepan until the butter is melted. Add to the mash and beat well until soft and creamy. Season with salt and pepper. ", "Boil the peas for 2-3 minutes and then drain.", "To serve, put a spoonful of the pie on each plate with the mash and peas alongside."]}, {"isVegetarian": false, "title": "Beef and mushroom pie", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_pie_97395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz beef stewing steak", "salt and pepper", "2 tbsp vegetable oil", "1 tbsp cornflour", "1 onions, chopped", "2 carrots, chopped", "2 sprigs thyme, leaves picked", "160g/5¾oz whole button mushrooms", "1 beef stock cube, dissolved in 400ml/14fl oz water", "1 free-range egg yolk, beaten", "100g/3½oz puff pastry, rolled to 5mm thick"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the beef with salt and black pepper.", "Heat an ovenproof casserole until hot. Add the vegetable oil and beef in batches and fry until browned. Return all the beef to the pan.", "Add the cornflour and stir to coat the beef, then add the onions, carrots, thyme and mushrooms. Gently fry for 2-3 minutes.", "Add the stock and bring to a simmer. Cover with a lid and simmer for 2-3 hours, or until the beef is very tender.", "Season, to taste, with salt and black pepper, remove from the heat and set aside to cool.", "Preheat the oven to 180C/350F/Gas 4.", "Spoon the cooled meat mixture into a large pie dish.", "Brush the edge of the dish with the beaten egg and then lay the pastry over the top of the filling and dish.", "Crimp the edge to seal, then brush the pastry with more beaten egg and cut two slits in the top of the pie to let the steam escape.", "Place on a baking tray in the oven for 25-35 minutes, or until the filling is hot and the pastry crisp and golden-brown."]}, {"isVegetarian": false, "title": "Beef and mustard pie", "url": "www_bbc_co_uk_food_recipes_beef_and_mustard_pie_58002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_mustard_pie_58002_16x9.jpg", "ingredients": ["1kg/2lb 4oz beef skirt, cut into large chunks", "2 tbsp plain flour ", "salt and freshly ground black pepper", "2 tbsp rapeseed oil ", "200ml/7fl oz red wine", "400ml/14fl oz beef stock", "1 onion, finely sliced", "2 large carrots, cut into 2.5cm/1in pieces", "3 sprigs thyme\t", "2 tbsp wholegrain mustard\t\t", "2 free-range egg yolks, beaten", "400g/14oz all-butter puff pastry, rolled to 5mm/¼in thick", "300g/10½oz fine green beans", "25g/1oz butter", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Toss the beef and flour together in a bowl with some salt and black pepper.", "Heat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.", "Fry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.", "Return the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.", "Cover with a lid and place in the oven for two hours.", "Remove from the oven, check the seasoning and set aside to cool. Remove the thyme.", "When the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6. ", "Transfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.", "Trim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.", "For the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.", "Drain and toss with the butter, then season with black pepper. ", "To serve, place a large spoonful of pie onto each plate with some green beans alongside."]}, {"isVegetarian": false, "title": "Beef and onion pie", "url": "www_bbc_co_uk_food_recipes_beef_and_onion_pie_88258", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz stewing beef, diced", "3 tbsp plain flour ", "salt and freshly ground black pepper", "4 tbsp olive oil", "150g/5oz whole baby onions, peeled", "1 onion, sliced", "3 garlic cloves, roughly chopped", "150ml/5½fl oz beer", "300ml/11fl oz beef stock", "500g/1lb 2oz self-raising flour", "250g/9oz beef suet ", "325ml/12fl oz water", "pinch salt", "50g/2oz butter", "1 hispi cabbage, core removed, shredded", "3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, preheat the oven to 150C/300F/Gas3.", "Mix the beef, flour and seasoning together in a bowl.", "Heat some of the olive oil in a large flameproof casserole until hot. Shake the excess flour from the beef and fry, in batches, for 4-5 minutes, or until browned all over. Remove the beef and set aside.", "Add the remaining olive oil and onions to the pan and fry for 3-5 minutes, or until softened and just coloured.", "Return the beef to the casserole and add the garlic and beer. Continue to cook until the volume of the liquid has reduced by half then add the beef stock and bring to a simmer. Cover with a lid and cook in the oven for 2 hours. ", "Season, to taste, with salt and freshly ground black pepper. Set aside to cool completely.", "For the suet pastry, mix the self-raising flour, suet, water and salt in a bowl to form a soft dough (do not overwork the pastry).", "Roll out three-quarters of the pastry to a 1cm/½in thickness and use it to line a 1.2 litre/2 pint pudding basin. Fill with the cold cooked beef filling and moisten the pastry around the rim of the basin with water.", "Roll the remaining dough to a 1cm/½in thickness and place over the top of the basin. Pinch the edges firmly together and trim off any excess.", "Cover with a double layer of greaseproof paper and a single sheet of aluminium foil. Tie around the top edge with string.", "Steam the pudding for 1½ hours in a steamer, or on an upturned plate in a covered saucepan half-filled with water.", "For the cabbage, heat a frying pan until hot, add the butter, cabbage and 3 tbsp water and cook for 4-5 minutes, stirring occasionally, until just tender. Stir in the parsley, salt and freshly ground black pepper.", "Serve the pudding in slices with the cabbage alongside."]}, {"isVegetarian": false, "title": "Beef and oyster pie", "url": "www_bbc_co_uk_food_recipes_beef_and_oyster_pie_65230", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb stewing beef, trimmed, cut into rough 3cm/1¼in cubes", "2-3 tbsp sunflower oil", "3 long shallots, quartered", "2 garlic cloves, finely chopped", "125g/4½oz smoked, rindless, streaky bacon rashers, cut into 1cm/½in strips", "1 tbsp roughly chopped thyme leaves", "2 bay leaves", "330ml/11fl oz stout", "400ml/14fl oz beef stock (made with one stock cube)", "flaked sea salt and freshly ground black pepper", "2 tbsp cornflour, blended with 2 tbsp water to make a smooth paste", "8 oysters, freshly shucked", "400g/14oz plain flour, plus extra for rolling", "¼ tsp salt", "250g/9oz butter, frozen for at least 2 hours", "1 free-range egg, beaten, to glaze"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry. ", "In the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.", "Preheat the oven to 180C/350F/Gas 4. ", "Pour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced. ", "Skim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.", "Increase the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.", "Roll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg. ", "Roll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling."]}, {"isVegetarian": false, "title": "Beef and pea pilaf", "url": "www_bbc_co_uk_food_recipes_beef_and_pea_pilaf_11183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 onion, chopped ", "3 garlic cloves, chopped ", "½ tbsp cumin seeds ", "1 red chilli, seeds removed, finely chopped", "250g/9oz beef mince ", "25g/1oz butter ", "200g/7oz white rice ", "1 litre/1¾ pint chicken or beef stock, made from a cube ", "300g/10½oz frozen peas", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan with a lid over a medium heat. Add the olive oil and, once hot, fry the onion with a pinch of salt for 5-6 minutes or until cooked through and lightly golden-brown. Add the garlic, cumin seeds and chilli and continue to cook for two minutes, or until aromatic.", "Add the beef mince to the pan and cook for 4-5 minutes, or until all the meat is brown rather than raw.", "Add the butter and, once melted, stir in the rice, mixing over the heat for two minutes so that the rice begins to absorb the melted butter and any juices in the pan. Pour in enough of the stock to cover the rice by 1cm/½in. Stir once, cover with a tight fitting lid, reduce the heat to medium-low and leave for five minutes. ", "After five minutes remove the lid, add the peas and stir through.  Poke some holes into the rice to allow any steam to escape and continue to cook with the lid off until all the liquid is absorbed and the rice is cooked through.", "Serve warm, dividing up the crisp rice at the bottom of the pan."]}, {"isVegetarian": false, "title": "Beef, black-eyed bean and plantain hotpot", "url": "www_bbc_co_uk_food_recipes_beef_black-eyed-bean_and_85011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz dried black-eyed beans", "900g/2lb sirloin steak, cut into 1cm/½ in cubes", "225ml/8fl oz vegetable oil", "100ml/3½fl oz red palm oil or vegetable oil", "1 large white onion, chopped", "4 garlic cloves, finely chopped", "4cm/2in piece ginger, grated", "1 tsp dried chilli flakes", "2 x 400g tins chopped tomatoes", "2 tbsp tomato purée", "2 beef stock cubes", "2 sprigs fresh thyme", "1 Scotch bonnet chilli, chopped", "3 ripe plantain, peeled and sliced", "salt and freshly ground black pepper"], "serves": "Serves 6–8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Cook the dried beans in a large pan of boiling water for about 20 minutes until softened. Drain and set aside.", "Heat 2 tablespoons of the vegetable oil in a large casserole pan and brown the beef on all sides over a medium heat. Remove and set aside.", "Heat the red palm oil in the same pan and fry the onions for 2-3 minutes, until slightly softened. Add in the garlic, ginger and dried chilli flakes and stir. Add the tinned tomatoes, tomato purée, stock cubes, thyme and Scotch bonnet chillies and season with salt and pepper. Cook the tomatoes for 10 minutes before adding in the beef and beans and cooking on low for 45–60 minutes, stirring occasionally.", "While the stew cooks, heat the remaining vegetable oil in a deep frying pan and shallow fry the plantain slices in batches for 2–3 on each side until golden-brown. Transfer to a plate lined with kitchen paper to drain. Top the stew with the plantains before serving. "]}, {"isVegetarian": false, "title": "Beef BBQ ribs", "url": "www_bbc_co_uk_food_recipes_beef_bbq_ribs_24916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp sea salt", "1 tbsp garlic powder", "1 tbsp celery salt", "1 tbsp cracked black pepper", "1 tbsp ground ginger", "1 tbsp crushed coriander seeds", "2 tsp chilli powder", "1 tbsp dried herbes de provence", "1 tbsp smoked paprika", "1 x 3.5kg/7lb 10oz short rib of beef on the bone", "200g/7oz dates, roughly chopped", "250g/9oz drained pickled onions, roughly chopped", "570ml/1 pint stout", "3 tbsp English mustard", "2 tbsp Worcestershire sauce", "300ml/½ pint apple juice", "3 tbsp clear honey", "3 tbsp black treacle", "3 tbsp golden syrup", "1 tbsp Tabasco", "1 tbsp tomato purée", "3 tbsp soft dark brown sugar"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the dry cured ribs, stir together all of the dry ingredients and rub them all into the rib of beef. Place the beef into a large plastic container and cover with any remaining cure mix. Put the lid on and place into a fridge overnight or for 24 hours.", "For the barbecue glaze, place the chopped dates and pickled onions into a bowl. Bring the stout up to the boil in a saucepan and pour it onto the dates and onions. Cover with cling film and leave to cool at room temperature.", "In a separate large bowl, whisk together the remaining BBQ glaze ingredients. ", "When the date and onion mixture has cooked and the dates have softened, blend the mixture until smooth and pour it into the rest of the BBQ glaze ingredients.", "Preheat the oven to 130C/275F/Gas 1.", "When the ribs have cured, wash the cure mixture off the short ribs and place them into a large casserole pan with a lid. Pour over the glaze and put a lid on. ", "Place into the preheated oven and cook very slowly for 5-6 hours, or until the beef is very tender. Make sure the glaze doesn’t evaporate - if it is reducing down too much, add some water.", "When the beef is cooked, remove the pan from the oven and leave to cool at room temperature. When cool, place in the fridge to chill overnight. When cold the fat will have set on the top and can easily be removed.", "When ready to reheat, place the whole pan, with the lid on, onto a barbecue on a low heat. Let the ribs warm through for about 2-3 hours.", "When warm, remove the lid and slowly reduce the glaze with the beef still in the pan, basting the ribs every 10 minutes. When the glaze is reduced and coats the beef, remove the ribs from the pan and serve."]}, {"isVegetarian": false, "title": "Beef and pepper kebabs", "url": "www_bbc_co_uk_food_recipes_beef_and_pepper_kebabs_82385", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_pepper_kebabs_82385_16x9.jpg", "ingredients": ["400g/14oz steak, rump or topside", "1 red pepper, cored and deseeded", "1 green pepper, cored and deseeded", "1 tsp crushed coriander seeds", "3 tbsp vegetable oil", "15g/½oz chopped fresh coriander", "1 red chilli, deseeded and chopped", "1 garlic clove, crushed", "2 tbsp lime juice", "4 chapatis", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soak 8 wooden skewers in warm water.", "Cut the beef and peppers into 2.5cm/1in cubes. ", "Mix together the coriander seeds, 2 tablespoons of oil and half the chopped coriander in a bowl and season to taste. Add the beef and peppers and toss to coat. Cover and refrigerate for up to 1 hour.", "Mix together the remaining coriander and oil with the chilli, garlic and lime juice to make a dressing, season to taste and set aside.", "Preheat the grill to a hot setting. Thread the beef and peppers on to the skewers. Place the beef skewers on a foil lined tray and grill for 15 minutes, turning often and basting with the juices. Warm the chapatis under the grill.", "Put two skewers on each chapati, drizzle over the coriander dressing and serve."]}, {"isVegetarian": false, "title": "Beef bourguignon with mashed potatoes", "url": "www_bbc_co_uk_food_recipes_beef_bourguignon_with_89401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "salt and freshly ground black pepper", "1 kg/2lb 4oz blade of beef, cut into large cubes", "2 tbsp olive oil", "150g/5oz pancetta, cut into small chunks", "2 shallots, finely chopped", "1 garlic clove, crushed", "50ml/2fl oz brandy", "500ml/18fl oz Burgundy, or other red wine", "250ml/9fl oz beef stock", "1 bouquet garni made up of 2 bay leaves, 2 sprigs thyme, 2 sprigs flat-leaf parsley", "25g/1oz butter", "150g/5oz peeled baby shallots (or frozen button onions)", "200g/7oz chestnut mushrooms", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "110g/4oz butter", "110ml/4fl oz full-fat milk", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz small pearl onions, peeled (or frozen button onions)", "100g/3½oz pancetta, cut into lardons ", "150g/5oz button mushrooms, stalks removed left whole", "½ bunch flat-leaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef bourguignon, sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Dredge the beef in the seasoned flour and set aside.", "Heat one tablespoon of the oil in a large, lidded frying pan and fry the pancetta for 1-2 minutes, or until golden-brown. Add the beef and fry for a further 4-5 minutes, or until browned on each side. Add the shallots and garlic and fry for 4-5 minutes, or until just softened.", "Add the brandy and slowly tilt the pan towards the gas flame, or light it with a match. Let the flames flare up then die down. (Caution: keep your face and hair away from the flames. Do not leave unattended.) ", "Add the red wine and beef stock and bring to a simmer. Add the bouquet garni, then cover and cook on a low heat for two hours, or until the beef is tender and the sauce has thickened.", "Heat the butter and remaining oil in a frying pan and fry the baby onions for 4-5, or until just golden-brown.", "Add the browned onions and the chestnut mushrooms to the beef mixture and cook for a further 20 minutes. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the mash, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.", "Mash the potatoes well, then add the butter and milk and beat with a wooden spoon until smooth. Season, to taste, with salt and freshly ground black pepper.", "For the garnish, heat the olive oil and butter in a small frying pan. Add the onions and fry until brown. Add the pancetta and fry until browned and crisp. Then add the mushrooms and continue frying until the mushrooms are softened and golden-brown. Finish with the chopped parsley and set aside until ready to serve.", "To serve, divide the mash equally among the serving plates and spoon the beef bourguignon alongside, with the garnish on top."]}, {"isVegetarian": false, "title": "Beef carpaccio with fried capers and mustard mayo", "url": "www_bbc_co_uk_food_recipes_beef_carpaccio_with_18464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g-400g/12-14oz bavette or skirt steak", "1 tbsp groundnut or sunflower oil", "1 tbsp capers, drained ", "50g/2oz pine nuts, toasted ", "1 tbsp English mustard ", "3 tbsp mayonnaise ", "1 tbsp extra virgin olive oil, plus extra for drizzling ", "2 tbsp lemon juice ", "2 tbsp finely chopped fresh flatleaf parsley ", "a few shavings Parmesan (use a vegetable peeler to make these) ", "sea salt and freshly ground black pepper "], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Season both sides of the steak thoroughly with salt and pepper.  Heat a greased heavy-based frying pan until hot.  Put the steak in the pan (it should sizzle immediately) and cook for about 3-5 minutes on each side for rare-medium. Transfer to a chopping board and leave to rest. Once cooled, refrigerate for 1 hour.", "Heat a tablespoon of oil in a frying pan over a medium heat and fry the capers for a few minutes until crisp and puffed up. Remove to a bowl lined with kitchen paper. ", "Whisk together the mustard, mayonnaise and olive oil until you have a loose sauce.  Remove the steak from the fridge and finely slice it into slivers, cutting against the grain.  ", "Arrange on a large plate or serving platter. Drizzle with the mustard mayo and lemon juice, and scatter over the parsley, Parmesan shards and capers.  Drizzle with olive oil and finish with the pine nuts and salt and pepper. "]}, {"isVegetarian": false, "title": "Beef cheek and butternut broth in sourdough", "url": "www_bbc_co_uk_food_recipes_beef_cheek_and_butternut_59977", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_cheek_and_butternut_59977_16x9.jpg", "ingredients": ["2 litres/4¼ pints boiling water", "50g/1¾oz dried porcini mushrooms", "4 tbsp olive oil", "800g/1lb 12oz beef cheek", "1 large onion, roughly chopped", "1 butternut squash, peeled, de-seeded, cut into 5cm/2in chunks", "250g/9oz orzo pasta", "1 large round sourdough loaf (the largest you can find)", "3 tbsp chopped fresh parsley leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the boiling water into a large bowl and add the porcini mushrooms. Set aside to infuse for 20 minutes.", "Meanwhile, heat the oil in a frying pan over a medium heat. Brown the beef cheek on all sides for 3-4 minutes, then transfer to a large lidded casserole.", "Add the onions to the frying pan and fry for 4-5 minutes, or until softened and just golden-brown. Transfer to the casserole. Repeat the process with the butternut squash.", "Pour the porcini liquid and the mushrooms into the casserole and bring to the boil. Reduce the heat until the mixture is simmering. Half-cover the casserole with the lid, then simmer gently for 3 hours, stirring occasionally and topping up with boiling water if the volume of liquid reduces significantly.", "After 3 hours, tip the orzo into the casserole and continue to cook for a further 10 minutes, or until tender.", "Meanwhile, slice the top off the sourdough loaf and hollow out the inside.", "Ladle the broth into the empty sourdough loaf, sprinkling over the chopped parsley to garnish."]}, {"isVegetarian": false, "title": "Beef burgers with beetroot and carrot slaw", "url": "www_bbc_co_uk_food_recipes_beef_burger_with_98749", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_burger_with_98749_16x9.jpg", "ingredients": ["500g/1lb 2oz lean beef mince", "50g/1¾oz fresh white breadcrumbs", "2 tsp Dijon mustard", "1 tbsp sun-dried tomato paste", "1 small onion, finely chopped", "1 tbsp chopped fresh marjoram", "3 tbsp chopped flatleaf parsley", "1 free-range egg yolk", "2 tbsp oil", "salt and freshly ground black pepper", "4 tbsp full-fat mayonnaise", "½ lemon, juice only", "dash sugar", "1 tbsp hot horseradish sauce", "1 large carrot, peeled and coarsely grated", "150g/5½oz raw beetroot, peeled and grated", "2 sticks celery, very finely chopped", "2 spring onions, chopped", "3 tbsp chopped flatleaf parsley", "2 tsp Dijon mustard", "salt and freshly ground black pepper", "6 burger or brioche buns, cut in half", "2 large beefsteak tomatoes, thickly sliced", "1 Little Gem, leaves separated", "6 large gherkins, thinly sliced"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the burgers, measure all the ingredients except the oil into a large bowl, season with salt and pepper and mix with your hands to combine. Shape into six fairly flat burgers.  Place in the fridge until needed.", "To make the slaw, measure out the mayonnaise, mustard, a squeeze of lemon juice, sugar and horseradish into a salad bowl, season with salt and pepper and stir to combine. Add the carrot, beetroot, celery, spring onion and parsley and stir until coated in the sauce.", "Heat the oil in a large frying pan until piping hot. Fry the burgers for 3–5 minutes on each side, or until browned and just cooked through.", "Griddle the flat side of the buns on the griddle pan until toasted, top with a burger, a slice of tomato, lettuce, gherkins and any sauces or chutney of your choice. Serve the slaw on the side."]}, {"isVegetarian": false, "title": "How to make chilli con carne", "url": "www_bbc_co_uk_food_recipes_beef_chilli_con_carne_92275", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_con_carne_92275_16x9.jpg", "ingredients": ["1 large red onion, finely chopped", "2 tbsp olive oil", "1 carrot, quartered lengthways and chopped", "2 garlic cloves, crushed", "1 tsp chilli powder", "¾ tsp smoked sweet paprika", "½ tsp dried oregano", "500g/1lb 2oz best-quality beef mince", "2 tbsp tomato purée", "1 x 400g/14oz tin kidney beans, drained and rinsed", "1 red or green pepper, seeds removed and roughly chopped", "1 x 400g/14oz tin best-quality chopped tomatoes", "500-750ml/18-22fl oz beef stock", "sea salt and black pepper", "2 squares 70% dark chocolate, grated", "small bunch coriander, chopped", "cooked rice", "fresh coriander, roughly chopped", "soured cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large casserole or heavy-based pan over a medium heat. Add a glug of oil and once hot add the onion. Cook for a minute and add the carrots. Cook for 5-7 minutes, or until the onions are softened and translucent. Add the garlic and cook for a further 2-3 minutes.", "Add the spices and the oregano and cook for two minutes, or until aromatic. Add the beef, breaking it up as it fries into small pieces. Cook for 3-4 minutes, or until brown all over and broken down into small pieces. Stir in the tomato purée and cook for two minutes.", "Stir in the kidney beans and chopped pepper, stirring over the heat for 3-4 minutes to soften the pepper a little, then add the tomatoes and enough beef stock to slightly more than cover the meat. Stir everything round, scraping the bottom of the pan with a wooden spoon to unstick any bits from the bottom, and season with salt and pepper.", "Bring to a rapid simmer, reduce the heat to a gentle simmer and cook for 1½-2 hours, or until thickened and rich. If at any point the liquid level looks low then add a little hot water or any remaining stock.", "Before serving, add the grated squares of chocolate and stir through the hot chilli con carne to melt. Taste and season with salt and pepper as necessary.", "Serve with rice and garnish the chilli with coriander and soured cream."]}, {"isVegetarian": false, "title": "Beef bourguignon", "url": "www_bbc_co_uk_food_recipes_beef_bourguignon_09721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "salt and freshly ground black pepper", "1 kg/2lb 4oz blade of beef, cut into large cubes", "2 tbsp olive oil", "150g/5½oz pancetta, cut into small chunks", "2 shallots, finely chopped", "1 garlic clove, crushed", "50ml/2fl oz brandy", "500ml/18fl oz Burgundy red wine, or other red wine", "250ml/9fl oz beef stock", "1 bouquet garni made up of 2 bay leaves, 2 sprigs thyme, 2 sprigs flatleaf parsley", "25g/1oz butter", "150g/5½oz peeled baby shallots (or frozen button onions)", "200g/7oz chestnut mushrooms", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "110g/4oz butter", "110ml/4fl oz full-fat milk", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz small pearl onions, peeled (or frozen button onions)", "100g/3½oz pancetta, cut into lardons", "150g/5½oz button mushrooms, stalks removed left whole", "½ bunch flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the beef bourguignon, sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Dredge the beef in the seasoned flour and set aside.", "Heat one tablespoon of the oil in a large, lidded frying pan and fry the pancetta for 1-2 minutes, or until golden-brown. Add the beef and fry for a further 4-5 minutes, or until browned on each side. Add the shallots and garlic and fry for 4-5 minutes, or until just softened.", "Add the brandy and slowly tilt the pan towards the gas flame, or light it with a match. Let the flames flare up and then die down. (Caution: keep your face and hair away from the flames. Do not leave unattended.)", "Add the red wine and beef stock and bring to a simmer. Add the bouquet garni, then cover and cook on a low heat for two hours, or until the beef is tender and the sauce has thickened.", "Heat the butter and remaining oil in a frying pan and fry the baby shallots or onions for 4-5 minutes, or until just golden-brown.", "Add the browned onions and the chestnut mushrooms to the beef mixture and cook for a further 20 minutes. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the mash, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.", "Mash the potatoes well, then add the butter and milk and beat with a wooden spoon until smooth. Season, to taste, with salt and freshly ground black pepper.", "For the garnish, heat the olive oil and butter in a small frying pan. Add the onions and fry until brown. Add the pancetta and fry until browned and crisp. Tip in the mushrooms and continue frying until the mushrooms are softened and golden-brown. Finish with the chopped parsley and set aside until ready to serve.", "To serve, divide the mash equally among the serving plates and spoon the beef bourguignon alongside, with the garnish on top."]}, {"isVegetarian": false, "title": "Beef chilli flash-fry with yoghurt rice", "url": "www_bbc_co_uk_food_recipes_beef_chilli_flash_fry_04956", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_flash_fry_04956_16x9.jpg", "ingredients": ["1½ tsp ground coriander                 ", "1½ tsp ground cumin                     ", "¼ tsp groud turmeric", "½ tsp lime juice", "200g-250g/7-9oz fillet steak, finely sliced into 0.25cm strips", "3 tbsp sunflower or rapeseed oil", "15-20g/½oz-¾oz fresh root ginger, grated        ", "15-20g/½oz-¾oz garlic, finely chopped  ", "1 onion, finely sliced             ", "½ green pepper, stalk and seeds removed, finely sliced", "½ red pepper, stalk and seeds removed, finely sliced", "3-4 spring onions, trimmed, finely sliced", "55g/2oz plum tomatoes, seeds removed, flesh sliced into thin strips    ", "1-2 green chillies, stalk removed, sliced", "1 tsp chilli powder, or to taste", "salt, to taste ", "2 tbsp chopped fresh coriander", "2-3 tbsp sunflower oil ", "1 level tsp mustard seeds", "½ tsp cumin seeds", "15-20 fresh curry leaves, shredded", "large pinch asafoetida (hing)", "2 green chillies, stalks removed, finely chopped    ", "1 tsp finely chopped fresh root ginger ", "1 small tomato, skin and seeds removed, diced", "½ tsp lime juice", "500g/1lb 2oz low-fat Greek-style yoghurt ", "1 tsp chopped fresh coriander leaves", "400g-500g/14oz-1lb 2oz basmati rice, cooked according to packet instructions with 1 tsp of salt, cooled to room temperature", "2 tsp salt, or to taste"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the beef chilli flash-fry, in a bowl, mix together all of the ground spices until well combined. Stir in the lime juice to form a smooth paste. Add the beef and mix until completely covered in the marinade. Cover the bowl with cling film and chill the beef in the fridge for at least an hour.", "For the yoghurt rice, heat the oil in a lidded wok over a high heat. When the oil is smoking, add the mustard seeds, then immediately cover the wok with the lid and reduce the heat slightly. (Caution: the mustard seeds will pop and can jump out of the pan - keep at a safe distance.) ", "Once the mustard seeds have popped, remove the lid, add the cumin seeds and curry leaves, and stir-fry for a few seconds, until the cumin seeds darken. Add the asafoetida, chillies and ginger, then stir-fry for a further 1-2 minutes. Add the tomatoes and lime juice and stir-fry for a further 2-3 minutes, or until the tomatoes start to break down. ", "Remove the wok from the heat, allow the pan contents to cool slightly, then stir in the yoghurt, coriander and cooked rice. Season, to taste, with salt. Set aside.", "For the beef chilli flash-fry, when the beef has marinated, heat half of the oil in a wok over a high heat. When the oil is smoking, add the marinated beef pieces. Stir-fry lightly for 3-4 minutes, until evenly browned (do not agitate the wok too much). Remove the beef pieces from the wok and set aside on a plate.", "Return the wok to the heat and add the remaining oil. Add the ginger and garlic and stir-fry for 1-2 minutes. Add the onions and continue to stir-fry until just softened.", "Add the peppers, spring onions, plum tomatoes and chillies to the wok and sprinkle over the chilli powder. Continue to stir-fry until the vegetables have softened and are starting to colour. Drizzle in the juices from the reserved beef. Season, to taste, with salt.", "When almost all of the beef juices have evaporated from the wok, return the reserved beef to the wok and toss for one minute to reheat. Remove the wok from the heat and stir through the fresh coriander.", "To serve, divide the yoghurt rice equally among serving plates and spoon over the chilli beef flash-fry. "]}, {"isVegetarian": false, "title": "Beef chilli with bitter chocolate", "url": "www_bbc_co_uk_food_recipes_beef_chilli_with_bitter_27455", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_with_bitter_27455_16x9.jpg", "ingredients": ["4 tbsp vegetable oil", "500g/1lb 2oz good-quality beef steak, finely diced", "500g/1lb 2oz good-quality beef mince", "1 white onion, peeled, finely chopped", "1 red onion, peeled, finely chopped", "2 sticks celery, trimmed, chopped", "1 dried chipotle chilli", "1 tbsp dried chilli flakes", "½ tbsp chilli powder", "2 tsp dried oregano", "3 tbsp light brown sugar", "2 x 400g/14oz cans chopped tomatoes", "500ml/17fl oz beef stock", "1 x 400g/14oz can kidney beans, drained and rinsed", "1 x 400g/14oz can black-eyed beans, drained and rinsed", "sea salt flakes and freshly ground black pepper", "75g/3oz plain chocolate, minimum 70% cocoa solids, roughly chopped", "bunch fresh coriander", "steamed rice", "8 tbsp soured cream", "4 spring onions, trimmed, finely sliced"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil over a medium to high heat in a large, heavy-based pan with a tight fitting lid.", "Fry the diced beef steak in batches until browned all over, setting each batch aside on a plate using a slotted spoon.", "Add another tablespoon of oil to the pan and add the beef mince, frying until browned all over. Remove the mince from the pan using a slotted spoon and set aside with the beef steak.", "Add the remaining tablespoon of oil to the pan and fry the white onion, red onion and celery for 3-4 minutes, or until the onions have softened but not browned.", "Stir in the chipotle chilli, chilli flakes, chilli powder and oregano until well combined. Cook for a further two minutes.", "Return the diced and minced beef to the pan, then stir in the sugar, chopped tomatoes, beef stock, kidney beans and black-eyed peas. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Cover and continue to simmer over a low heat for 2-3 hours. (Alternatively, preheat the oven to 140C/280F/Gas 1 to cook in an ovenproof dish for the same amount of time.)", "Just before serving, season the chilli with crushed sea salt flakes and freshly ground pepper. Stir in the chocolate until melted, then stir in the chopped coriander.", "Serve the chilli with a bowl of steamed rice and top each serving with a dollop of soured cream. Garnish with the sliced spring onions."]}, {"isVegetarian": false, "title": "Beef cobbler with cheddar and rosemary scones", "url": "www_bbc_co_uk_food_recipes_beef_cobbler_with_79871", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_cobbler_with_79871_16x9.jpg", "ingredients": ["90ml/3fl oz vegetable oil", "3 tbsp plain flour ", "salt and freshly ground black pepper", "900g/2lb chuck steak or stewing steak, cut into cubes", "2 onions, sliced", "2 carrots, cut into chunks", "2 sticks celery, cut into 2cm/1in pieces", "1 leek, washed and cut into thick rings", "1 tbsp tomato purée", "600ml/1 pint red wine", "600ml/1 pint beef stock", "1 bay leaf", "80g/3oz self-raising flour", "100g/3½oz wholemeal self-raising flour", "65g/2¼oz malted flour", "pinch salt", "1 tbsp finely chopped fresh rosemary", "150g/5½oz cheddar cheese, grated", "175ml/6fl oz full fat milk", "1 free-range egg, beaten", "extra flour for dusting", "parsley, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the stew, preheat the oven to 180C/350F/Gas 4. ", "Season the flour with salt and pepper. Toss the steak in the four so each piece is coated.", "Heat half the oil in a casserole dish and fry the meat in batches until browned all over. Remove from the pan and set to one side.", "Heat the remaining oil in the same pan and fry the onion, carrots, celery and leek until just coloured. Stir in the tomato purée and cook for another two minutes.", "Pour the wine into the pan and heat through. Using a wooden spoon, scrape any charred meat and vegetables from the bottom of the pan. Add the stock, bay leaf and return the beef to the pan.", "Cover with a lid and cook in the oven for 1½ hours in the preheated oven (alternatively cook on the hob over a very low heat for 1½ hours).", "Meanwhile, make the cobbler topping. Mix the flours in a bowl. Add the salt, chopped rosemary and 100g/3½oz of the cheese.  Slowly add the milk and bring the mixture together. You may not need all of the milk. Try not to overwork the mixture by mixing it too much as this will toughen the end result.", "Tip the mixture onto a floured surface and bring together to form a soft dough.  Form the dough into a rough circle keeping it quite thick, about 2.5cm/1in. Cut out eight scone-sized circles. Brush the tops of the scones with beaten egg and sprinkle over the remaining cheese.", "Remove the stew from the oven and place the scones on top of the stew.  Increase the oven temperature to 220C/425F/Gas 7. Return the stew to the oven and bake, uncovered, for 20-25 minutes until the scones are golden-brown. Serve with a sprinkle of chopped parsley. "]}, {"isVegetarian": false, "title": "Beef consommé with tortellini", "url": "www_bbc_co_uk_food_recipes_beef_consomm_with_29917", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz lean beef mince", "2 carrots, chopped", "1 leek, trimmed, roughly chopped", "1 sprig fresh thyme, leaves only", "2 free-range egg whites", "2 litres/3½ pints fresh beef stock", "250g/9oz type ‘00’ pasta flour, plus extra for dusting", "4 free-range egg yolks ", "1 whole free-range egg mixed with 2 tsp cold water, plus 1 free-range egg beaten ", "50g/1¾oz ready-made coarse farmhouse pâté", "1 carrot, peeled but left whole", "1 courgette"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the consommé, mix the beef mince, carrots, leek and thyme in a large saucepan.", "Whisk the egg whites in a small, clean bowl until foamy, then add them to the saucepan and mix in well. Stir in a little of the stock until well combined, then add the remaining stock and stir again.", "Heat the pan until the mixture is simmering gently, then continue to simmer for about 1½ hours, without stirring. During this time, the egg whites will rise to the surface of the consommé and take any impurities with it. ", "Strain the pan contents through a fine sieve lined with a muslin cloth and collect the strained liquid in a clean saucepan (the strained meat and vegetables are not used in this recipe but can be used in another recipe such as a pie or stew). Keep the strained consommé warm.", "Meanwhile, for the tortellini, in a large bowl, mix together the flour, egg yolks, and whole egg mixed with water. Rub the dry ingredients into the wet ingredients until the mixture resembles breadcrumbs, then bring the mixture together to form a dough. Alternatively, use a food processor to blend the ingredients together.", "Turn out the tortellini dough onto a lightly floured work surface and knead lightly for 2-3 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for 20 minutes. Cut the chilled pasta dough into quarters. Roll out one quarter of the dough onto a lightly floured work surface until very thin. This can be done using a rolling pin or a pasta machine. If using a pasta machine, dust the rollers and set them to their widest setting, then pass the pasta dough through the machine, collecting the rolled pasta at the other end. Keep rolling the pasta sheet through the machine, reducing the rollers to their next-widest setting each time, until the pasta has been rolled through the rollers set to their narrowest setting.", "Roll out another quarter of the pasta dough in the same way.", "Lay one pasta sheet onto a lightly floured work surface. Spoon teaspoonfuls of the pâté at 5cm/2in intervals down one half of the pasta sheet, then spoon another row of pâté portions down the other half to create 2 rows. ", "Brush the exposed parts of the pasta sheet with the beaten egg, then carefully place the second pasta sheet on top and press down around the pâté filling to seal, pushing out any air bubbles as you go. ", "Using a cookie cutter, cut discs from the pasta so that the tortellini filling is in the centre of each circle with a 0.5cm/¼in border around it. ", "Carefully fold the filled pasta discs in half, then twist each end and bring the points over the filling until they meet, so that the filled pasta forms a ring shape. ", "Repeat the whole process until all of the pâté has been used up and all of the pasta shapes have been turned into tortellini. The remaining unrolled pasta can be frozen for use in another recipe (see tip).  ", "Ball the carrot and the courgette using a melon baller, parisienne scoop or similar (alternatively, dice the carrot and courgette). ", "Bring a saucepan of water to a simmer and lower the tortellini and carrot and courgette balls into the water. Simmer for 1-2 minutes, then remove from the pan using a slotted spoon and divide equally among serving bowls. Ladle the consommé into the bowls and serve immediately."]}, {"isVegetarian": false, "title": "Beef curry Marie Kiteria", "url": "www_bbc_co_uk_food_recipes_beef_curry_marie_kiteria_74737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12–15 fresh or dried curry leaves", "500g/1lb 2oz onions, roughly chopped", "2 tbsp rapeseed oil ", "200g/7oz thick natural yoghurt ", "3 tbsp tomato purée ", "2 x 5cm/2in fresh root ginger, peeled and finely chopped                                                       ", "4–6 garlic cloves, finely chopped", "1 heaped tsp ground cumin ", "2 heaped tsp ground coriander ", "1 heaped tbsp chilli powder ", "1 tsp ground turmeric ", "500g/1lb 2oz beef rump steak, cut into 2.5cm/1in cubes, rinsed", "4–5 butternut berries or pitted plums", "400ml/16fl oz tin coconut milk ", "1 tsp garam masala (optional)", "2–3 green finger chillies, split into four lengthways,      ", "salt and freshly ground black pepper", "1 tsp rapeseed oil or ghee        ", "3cm/1in cinnamon stick                             ", "2–3 cardamom pods, lightly crushed                                            ", "2–3 cloves                                                        ", "1 tsp cumin seeds", "1 small onion, thinly sliced", "500g/1lb 2oz basmati or long-grain rice", "1 litre/1¾ pints boiling water"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["If using dried curry leaves, soak them in a little water for a few minutes, then drain. ", "Put the onions and oil in a food processor and blend to a fine, smooth paste. Tip the mixture into a large bowl and mix in the yoghurt, tomato purée, ginger, garlic, curry leaves and ground spices. ", "Transfer the mixture to a large saucepan and mix in the beef and butternut berries. Cover with a lid and simmer over medium heat for about an hour, or until the oil has separated and the beef is cooked. Stir often to prevent it from sticking to the bottom of the pan and season with salt if needed. ", "Meanwhile, make the pilau. Preheat your oven to 190C/170C Fan/Gas 5. Heat the oil or ghee in a 25cm/10in casserole dish. Add the spices and fry for 1–2 minutes, or until coloured. Add the onion and sauté for 1–2 minutes, or until pale. Add the rice and sauté for 2–3 minutes, stirring often so that all the grains are evenly coated.", "Pour over the boiling water, season with salt and stir well, cleaning the sides of any loose grains. Bring to the boil, then reduce the heat to a gentle simmer and cover with a lid. Cook for 10 minutes, gently stirring every minute or so and clearing the sides of rice before covering the pan again. Add a little more water if needed. ", "Bake the rice for 15–20 minutes. Stir the rice with a roasting fork, loosening all the grains.", "To finish the curry, stir the garam masala, if using, into the coconut milk, then add to the curry. Drop in the chillies and simmer for a few minutes more. Season to taste.", "Serve the curry with the pilau. "]}, {"isVegetarian": false, "title": "Beef empanadas", "url": "www_bbc_co_uk_food_recipes_beef_empanadas_19631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "2 tsp baking powder", "1 tsp salt", "60g/2¼oz butter", "60g/2¼oz lard or vegetable shortening ", "75-100ml/2½-3½fl oz chilled water", "2 tbsp olive oil", "½ beef stock cube, crumbled", "400g/14oz fillet or sirloin steak, finely chopped", "1 onion, finely chopped", "1 small green pepper, finely chopped", "3 garlic cloves, crushed", "3 tbsp red wine    ", "½ tsp ground cumin", "½ tsp paprika", "½ tsp chilli powder", "12 pimento-stuffed green olives, sliced ", "1 tsp salt    ", "½ tsp ground black pepper", "1 beaten free-range egg, for brushing pastry"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pastry, combine the flour, baking powder and salt in a mixing bowl.", "Cut the lard and butter into 1cm/½in cubes, add to the flour, and rub the fat into the flour until it resembles fine breadcrumbs. Add just enough cold water to form a soft dough. Wrap in cling film and set aside in the fridge to rest for an hour.", "For the empanada filling, heat one tablespoon of oil in a large frying pan, sprinkle the stock cube into the hot oil and fry for 30 seconds, stirring continuously. Add the steak and fry for about two minutes until brown. Set the meat and the juices to one side.", "Heat the remaining tablespoon of olive oil, add the onion and green pepper and fry until soft, about three minutes. Add the garlic and fry for a further minute. Add the wine, cumin, paprika, chilli powder, olives and the salt and freshly ground black pepper. Fry for a further minute, stirring continuously. Return the meat and juices to the pan and stir well. Set aside to go cold.", "To fill the empanadas, take the pastry out of the fridge, and on a well-floured surface, roll out a thin sheet. Using a saucer as a template, cut out discs of pastry. ", "Place a tablespoon of the filling on one half of the pastry circle. Brush the edge with egg, fold over and crimp the edges together.", "Brush with egg and place on a greased baking sheet. Bake for 20 minutes, or until golden-brown.", "Serve either hot or cold as a snack or starter."]}, {"isVegetarian": false, "title": "Beef empanadas and Mexican-style corn", "url": "www_bbc_co_uk_food_recipes_beef_empanadas_and_94573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 300–400g/10½oz–14oz beef cheek ", "4 tbsp olive oil", "1 onion, roughly chopped", "1 carrot, roughly chopped", "1 stick celery, roughly chopped", "1 bay leaf", "200ml/7fl oz red wine", "400ml/14fl oz beef stock", "350g/12oz plain flour", "1 tsp baking powder", "175g/6oz salted butter, chilled", "4 tbsp olive oil", "½ onion, roughly chopped", "1 garlic clove, finely chopped", "1 dried red chilli, finely chopped", "1 tsp smoked paprika", "1 tsp cumin seeds", "1 tbsp tomato purée", "1 tbsp capers, drained", "2 free-range eggs, beaten", "4 heads sweetcorn, husk and silk removed", "2 tbsp mayonnaise ", "1 tsp ground chipotle pepper", "150g/5½oz cotija or feta cheese, crumbled", "½ garlic clove, crushed", "1 lime, juice only", "2 spring onions, chopped", "30g/1oz sliced jalapeños, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/180C Fan/Gas 3.", "To braise the beef cheek, heat the oil in an oven-proof dish, add the beef cheek and sear on all sides to seal. Remove from the pan and set aside", "Add the vegetables and the bay leaf and cook for 3–4 minutes until  soft. Place the beef cheek back in the dish, add the wine and cook until the liquid has reduced in volume by half. Add the stock, season with salt and pepper and place in the oven for 2–3 hours or until the meat falls off the cheek  easily.", "For the empanadas, blitz the flour, baking powder and butter in a food processor, adding a little water to bind. Wrap the dough in cling film and rest in the fridge for 1 hour. ", "Heat the oil in a pan over a medium heat and gently fry the onion, garlic, spices and tomato purée. Stir in the cooked beef cheek and capers. If the mixture is too dry, add some cooking jus to loosen. Cook until hot through.", "To assemble the empanadas, remove the pastry from the fridge, and roll out to the thickness of a pound coin (3mm). Cut  circles from the pastry, using a 10cm/in saucer or pastry cutter. Line a baking tray with baking paper. ", "Put 2 heaped teaspoons filling on one half of each pastry circle. Wet the edges of the pastry with a little water, fold the non-filled half of each pastry over the filled half, and crimp the edges or use a fork to seal. Brush with the egg, place on the baking tray and bake for 25 minutes. ", "Meanwhile, heat a large griddle pan over a high heat and grill the sweetcorn, turning occasionally, until all sides are chargrilled and browned. ", "Cut the kernels from the cob by holding the corn on its base and running a sharp knife down from top to bottom. Mix the kernels with the mayonnaise, chipotle, cotija, garlic, lime juice, spring onions and jalapeños. Serve with the empanadas."]}, {"isVegetarian": false, "title": "Beef fillet medallions with mushroom brandy cream", "url": "www_bbc_co_uk_food_recipes_beef_fillet_medallions_90079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "3 shallots, finely chopped", "5 tbsp brandy ", "2 garlic cloves, finely chopped", "180g/6oz mixed chestnut and wild mushrooms, sliced", "500ml/18fl oz beef stock", "3 sprigs thyme, leaves only", "splash double cream", "600g/1lb 5 oz beef fillet, cut into medallions", "salt and freshly ground black pepper", "400g/14oz potatoes, peeled and roughly chopped", "150ml/5fl oz milk", "2 spring onions, sliced", "30g/1oz butter", "300g/10½oz green beans", "2 shallot, finely sliced", "dash olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef and sauce, heat a little vegetable oil in a pan and add the shallots and garlic. Cook until lightly coloured. ", "Add the mushrooms and fry until cooked through.", "Add the brandy and cook until the volume of liquid has reduced by half.", "Add the stock and the thyme and, again, cook until the volume of liquid has reduced by half.", "Add the cream and cook until the mixture has reduced to a sauce consistency.", "Meanwhile, for the champ, place the potatoes in a pan of water and bring to the boil. Cook for 15-20 minutes, or until tender. ", "For the beef and sauce, put a large frying pan on a medium heat.  Season the beef medallions, to taste, with salt and pepper. Rub with oil and fry on each side for at least two minutes, depending on how well done you enjoy your fillet. Keep warm until ready to serve.", "For the champ, when the potatoes are cooked, drain well and mash until smooth.", "Put the milk and spring onion into a small pan and bring to the boil. Simmer until the onions are cooked, then pass the mixture through a fine sieve. Stir the milk into the mashed potatoes and keep warm until ready to serve.", "For the fricassée, bring a pan of water to the boil, add the green beans and simmer for four minutes. Prepare a bowl of ice cold water.", "Remove the beans from the heat, drain and briefly place into the cold water. Drain again.", "In a pan, lightly fry the shallot in a little oil and add the green beans. Season to taste with salt and freshly ground black pepper.", "Serve the beef with the sauce, bean fricassee and champ."]}]