[{"ingredients": ["100g / 3½oz de mantequilla en lata, enjuagada y escurrida", "1 cucharada de mostaza integral", "3 cucharadas de aceite de oliva", "1 cucharadita de jugo de limón", "sal marina y pimienta negra recién molida", "2 rebanadas de pan francés", "1 diente de ajo, pelado y reducido a la mitad"], "method": ["Coloque las habas de mantequilla, la mostaza, el aceite de oliva y el limón en un procesador de alimentos y mezcle hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén hasta que fume y coloque el pan sobre ella. Planche durante dos minutos en cada lado, luego retire y frote con el lado cortado del ajo.", "Para servir, coloque las tostadas en un plato y cubra con el paté de frijoles."], "url": "www_bbc_co_uk_food_recipes_mustardandbeanpatewi_84047", "title": "Paté de mostaza y mantequilla con tostadas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "1 pechuga de pollo, aplastada", "25g / 1oz de mantequilla", "50ml / 1¾ fl oz de vino blanco", "3 cucharadas de mostaza integral", "100ml / 3½ fl oz crema doble", "Frijoles enlatados 150 g / 5¼ oz, enjuagados y escurridos", "¼ de cebolla roja picada", "3 cucharadas de cilantro fresco, picado", "3 cucharadas de albahaca picada", "3 cucharadas de perejil picado", "½ limón, solo corteza", "4 cucharadas de aceite de oliva"], "method": ["Para el pollo, caliente una charola con un poco de aceite y cocine el pollo en ambos lados durante seis minutos o hasta que esté cocido.", "En una olla aparte, derrita la mantequilla. Agregue el vino y el calor para reducir a la mitad. Mezcle la crema y la mostaza y reduzca para hacer una salsa espesa.", "Para hacer la ensalada de frijoles, mezcle los frijoles, la cebolla roja, el cilantro, la albahaca, el perejil y la corteza de limón en un tazón. Finalmente agregue el aceite de oliva y mezcle.", "Para servir coloque el pollo en una cama de ensalada y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_mustardchickenwithbe_77834", "title": "Pollo mostaza con ensalada de frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de pan rallado fresco", "1 cucharada de cebolletas frescas picadas", "1 cucharada de perejil fresco y picado", "15 g / ½ onza de mantequilla, derretida", "sal y pimienta negra recién molida", "1 cucharadita de mostaza Dijon", "125 g / 4½ oz de filete de salmón", "dash aceite de oliva", "dash aceite de oliva", "¼ de cebolla, en rodajas", "75g / 2½ oz pueden tomates cherry", "50g / 1¾oz de guisantes congelados, blanqueados", "½ aguacate, pelado y picado", "3 cucharadas de crema doble", "25g / 1oz de mantequilla", "puñado de hojas de albahaca fresca, picada", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "method": ["Para el salmón, coloque el pan rallado, las hierbas, la mantequilla, la sal y la pimienta negra recién molida en un bol y mezcle bien.", "Extiende la mostaza de Dijon por todo el salmón y luego coloca el salmón en la mezcla de pan rallado y presiona hacia abajo.", "Calentar el aceite en una sartén pequeña. Agregue el salmón y cocine por tres minutos en cada lado, o hasta que esté dorado y completamente cocido.", "Para la mezcla de verduras, caliente el aceite en una cacerola y agregue las cebollas. Cocine suavemente hasta que las cebollas se hayan suavizado.", "Agregue los tomates y cocine por dos minutos.", "Agregue los guisantes, el aguacate y la crema y caliente durante un minuto.", "Para la mantequilla de albahaca, derrita la mantequilla en una olla pequeña. A continuación, agregue la albahaca y el jugo de limón y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque la mezcla de verduras en un plato limpio. Coloque el salmón encima y vierta la mantequilla de albahaca sobre el salmón."], "url": "www_bbc_co_uk_food_recipes_mustardcrustedsalmon_84598", "title": "Salmón con corteza de mostaza con un popurrí de verduras y mantequilla de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de pollo", "1 cucharada de mostaza de grano", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 chile rojo, picado", "2 cucharadas de eneldo fresco picado", "55 g / 2 oz de frijoles cocidos en conserva", "¼ de plátano, pelado, picado"], "method": ["Remoje un pincho de madera en agua fría durante diez minutos.", "Para el pollo, pase la carne por el pincho y cúbrala con la mostaza. Caliente una charola a la parrilla hasta que fume y cocine el pollo durante 3-4 minutos en ambos lados, o hasta que esté dorado y cocido.", "Para la ensalada, mezcle todos los ingredientes de la ensalada en un recipiente colocado en un plato. Sirve con el pollo encima."], "url": "www_bbc_co_uk_food_recipes_mustardgrilledchicke_90128", "title": "Filete de pollo a la mostaza a la parrilla con chile y ensalada de judías negras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 115g / 4oz", "pizca de sal", "2 huevos medianos de granja, golpeados", "300 ml / ½ litro de leche", "1 cucharada de mostaza Dijon", "rociar aceite de oliva", "1 salchicha Cumberland", "2 cucharadas de aceite vegetal"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la harina y la sal en un tazón grande y haga un pozo en el medio.", "En un recipiente aparte, bata los huevos con la leche y la mostaza. Poco a poco vierta la mezcla en el pozo en el medio de la harina y bata hasta que tenga una masa espesa. Reserve y deje reposar durante unos minutos mientras cocina la salchicha.", "Caliente un chorrito de aceite de oliva en una sartén, agregue la salchicha y fría hasta que se dore por todos lados.", "Vierta el aceite vegetal en un pequeño plato gratinado o pastel y coloque en el horno hasta que esté muy caliente. Coloque la salchicha en el aceite caliente y vierta sobre la mezcla. Vuelva a colocar en el horno y cocine durante 15 minutos, o hasta que esté hinchado y dorado. Sirve inmediatamente en el plato gratinado."], "url": "www_bbc_co_uk_food_recipes_mustardtoadinthehole_87360", "title": "Sapo de mostaza en el agujero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["harina común, para quitar el polvo", "4 huevos de gallinas camperas, golpeados", "Pan rallado panko japonés de 150g / 5oz, aplastado", "12 chuletas de cordero, ribeteadas en francés (pídale a su carnicero que haga esto por usted, y conserve las guarniciones de cordero)", "aceite vegetal, para freír", "botón de mantequilla sin sal", "exprimir jugo de limón", "copos de sal marina, al gusto", "2 cebollas en rodajas", "1 col puntiaguda (como repollo hispi), raíz eliminada, hojas en rodajas finas", "Crema doble de 600 ml / 20 fl oz", "600 g / 1 libra de papas harinas de 5 oz, como Maris Piper, peladas, cortadas en rodajas de 2 mm de grosor con mandolina", "600 g / 1 libra nabos grandes de 5 oz, cortados en rebanadas de 2 mm de espesor con una mandolina", "3 dientes de ajo, rallados", "1 huevo de pato, duro y rallado", "1 cucharada de mostaza Dijon", "1 cucharada de vinagre de vino tinto", "½ cucharadita de sal", "1 cucharadita de azúcar", "1 cucharadita de mostaza inglesa en polvo", "¼ cucharadita de pimentón ahumado", "100ml / 3½fl oz de aceite de oliva", "2 cucharadas de cornichons picados", "2 cucharadas de finas alcaparras", "1 cucharada de perejil de flatleaf fresco picado", "sal y pimienta blanca recién molida"], "method": ["Para el cordero, espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvorear las migas de pan panko en un plato separado.", "Espolvoree cada carne de cordero picada primero en la harina, luego sumérjala en el huevo, luego gírela en el pan rallado hasta que esté completamente cubierta. Apartar, cubrir, hasta que sea necesario.", "Para el gratinado de papas y nabos, llevar la crema a ebullición en una cacerola y sazonar, a gusto con sal y pimienta blanca recién molida. Retire la sartén del fuego y reserve.", "Coloque capas alternas de las rodajas de patata y rodajas de nabo en un plato grande a prueba de horno, salpicando cada capa con un poco del ajo rallado. Asegúrate de superponer un poco las rodajas de papa y nabo en cada capa.", "Vierta sobre la crema caliente, luego transfiera el plato al horno y cocínelo durante 18-20 minutos.", "Retire el plato del horno y presione las capas de patata y nabo con una rebanada de pescado. Regrese el plato al horno y continúe cocinando por otros 10 minutos.", "Repite este proceso hasta que los vegetales estén tiernos, la crema espesada y la parte superior dorada. Retire el plato del horno y déjelo a un lado para que se enfríe un poco.", "Mientras tanto, para la salsa gribiche, mezcle en un bol el huevo de pato rallado, la mostaza de Dijon, el vinagre de vino tinto, la sal, el azúcar, la mostaza en polvo inglesa y el pimentón ahumado hasta que estén bien combinados.", "Poco a poco agregue el aceite de oliva en una corriente fina, removiéndolo en la mezcla hasta que la mezcla se emulsione hasta formar una pasta. Agregue los cornichons, las alcaparras y el perejil y sazone, al gusto, con sal y pimienta. Dejar de lado.", "Para cocinar las chuletas, caliente el aceite vegetal en una sartén grande y antiadherente a fuego medio. Agregue las chuletas de cordero empanadas, en lotes si es necesario, y fría poco durante 2-3 minutos en cada lado, o hasta que estén doradas en ambos lados. A la mitad de la cocción, agregue un poco de mantequilla y un chorrito de jugo de limón en la sartén e hilvane las chuletas con la mezcla.", "Cuando las chuletas de cordero estén cocidas a su gusto, retírelas de la sartén y déjelas a un lado para drenarlas en una placa de horno forrada con papel de cocina. Espolvorear con escamas de sal marina y mantener caliente en un horno a su configuración más baja.", "Cortar los recortes de cordero en trozos pequeños, luego calentar una cacerola con tapa a fuego medio, agregar los recortes de cordero picados y freír hasta que la grasa se haya derretido y los recortes de cordero estén crujientes y dorados.", "Agregue la cebolla y una pizca de sal, luego cubra la olla con la tapa y fría durante 3-4 minutos, o hasta que las cebollas se hayan ablandado.", "Agregue el repollo en rodajas, cubra nuevamente con la tapa y cocine por 3-4 minutos, o hasta que el repollo esté marchito y tierno.", "Para servir, coloque dos chuletas de cordero empanizadas en cada plato con algo de repollo. Cuchara sobre un poco de salsa gribiche. Sirva la papa y el gratinado de nabo al costado."], "url": "www_bbc_co_uk_food_recipes_mutton_chops_with_potato_75289", "title": "Chuletas de cordero con patatas gratinadas y nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mutton_chops_with_potato_75289_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 riñones de cordero, grasa en", "1kg / 2lb 4oz pierna deshuesada de cordero, cortada en piezas de 2.5cm / 1in", "2 cucharadas de harina", "2 cebollas grandes, cortadas en rodajas gruesas", "2 hojas de laurel", "2 cucharaditas de salsa Worcestershire", "600ml / 20fl oz de caldo de carne fresca", "Patatas de 900g / 2lb, peladas y cortadas en rodajas de 5 mm / ¼ in de espesor", "sal marina y pimienta negra recién molida", "100 g / 3½ oz de mantequilla", "Zanahorias de herencia de 300 g / 10½ oz, limpiadas y recortadas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Recorte la grasa de los riñones y coloque la grasa en una cazuela grande a prueba de horno y cocine a fuego medio hasta que la grasa comience a derretirse y se dore.", "Espolvoree todo el cordero con la harina. Agregue la mitad del cordero y los riñones a la cacerola y cocine hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue la carne restante y cocine hasta que se dore por todas partes, luego agregue la mitad de las cebollas y las hojas de laurel. Cubra con el cordero reservado y luego las cebollas restantes.", "Agregue la salsa y el caldo Worcestershire y cocine a fuego lento.", "Coloque las rodajas de papa en la parte superior en un patrón superpuesto.", "Sazone las papas con sal y pimienta y agregue algunos puntos de mantequilla en la parte superior. Cubra con una tapa hermética y cocine durante dos horas en el horno precalentado. Cuando esté cocido, puede cepillar las papas con un poco más de mantequilla, luego colóquelas debajo de la parrilla para que queden crujientes si lo desea. Alternativamente, aumente la temperatura del horno durante los últimos 30 minutos en el horno y retire la tapa.", "Cuando el caldo esté cocido, ponga a hervir una sartén de agua con sal. Agregue las zanahorias y cocine a fuego lento hasta que estén tiernas, de 3 a 5 minutos. Escurra y mezcle con la mantequilla restante, sal y pimienta negra.", "Sirva un montón de caldo en cada plato con algunas zanahorias al lado."], "url": "www_bbc_co_uk_food_recipes_mutton_hotpot_with_72316", "title": "Estofado de cordero con zanahorias de herencia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de girasol", "4 cebollas grandes, peladas y en rodajas", "10 vainas de cardamomo", "1 cucharada de semillas de comino", "2 cucharaditas de semillas de mostaza", "¼ de canela", "6 dientes de ajo, pelados y en rodajas", "2 chiles rojos largos, en rodajas", "1 cucharada de cilantro molido", "2 cucharaditas de cúrcuma molida", "500 g / 1 lb 2 oz de hojas de espinaca (preferiblemente no de espinaca), se quitan los tallos, se lavan y se escurren", "Pierna de cordero deshuesada de 900 g / 2l, cortada en trozos de 4 cm / 1½ pulgadas (es posible que deba comenzar con una pieza de cordero de 1,7 kg en el hueso).", "1 cucharadita de sal marina en copos, más extra para el gusto", "1 hoja de laurel", "2 cucharadas de puré de tomate", "pimienta negra recién molida"], "method": ["Caliente tres cucharadas de aceite de girasol en una sartén grande de base pesada y cocine las cebollas suavemente durante 20 minutos o hasta que estén suaves y doradas.", "Mientras tanto, coloque las cápsulas de cardamomo en un almirez y mortero y golpee suavemente para dividir las vainas. Incline sobre un tablero y abra cada vaina, raspando las semillas nuevamente dentro del mortero. Agregue el comino, las semillas de mostaza y la ramita de canela y muela en un polvo fino y seco.", "Retire la mitad de las cebollas y transfiéralas a un plato. Regrese la sartén al fuego y agregue los chiles y el ajo, y cocínelos durante tres minutos. Agregue las especias molidas, el cilantro molido y la cúrcuma y fría, revolviendo constantemente, durante dos minutos.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Agregue 300 g / 10z de espinaca a la sartén y cocine por 2-3 minutos. Retire del fuego, pinte en un recipiente resistente al calor y déjelo enfriar.", "Regrese la sartén al fuego y agregue una cucharada de aceite. Sazone el cordero con sal y pimienta negra recién molida. Freír el cordero a fuego medio-alto en 2-3 tandas hasta dorarlo bien por todos lados, agregando un poco más de aceite si es necesario. Tan pronto como un lote se dore, transfiéralo a una cazuela mediana a prueba de llamas mientras el resto se fríe.", "Transfiera las cebollas y las espinacas con especias a un procesador de alimentos y mezcle con una pasta verde espesa. Mezcle en la cazuela con el cordero y agregue la hoja de laurel, puré de tomate y 800 ml / 1⅓ pintas de agua fría. Sazonar con una cucharadita de copos de sal marina, mezclar bien y llevar a fuego lento.", "Retirar del fuego y cubrir la superficie del curry con un pedazo de pergamino arrugado. Coloque una tapa en la parte superior de la cazuela y cocine en el horno durante 2 ½-3 horas o hasta que el cordero esté muy tierno y la salsa espesa.", "Agregue las cebollas reservadas y las espinacas restantes. Cubra con la tapa y vuelva al horno por otros 15-20 minutos o hasta que las cebollas estén calientes y la espinaca se haya marchitado. Sirva con arroz o pan naan tibio."], "url": "www_bbc_co_uk_food_recipes_mutton_saag_25343", "title": "Sag de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mutton_saag_25343_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz cañón de cordero (del mejor extremo del cuello), cortado en pedazos de 2cm / 1in", "1 cucharada de jengibre picante picado", "1 cucharada de ajo picado y picado", "½ cucharadita de cúrcuma molida", "2 cucharaditas de cilantro molido", "1 cucharadita de comino molido", "1 cucharadita de chile rojo en polvo", "½ cucharadita de sal masala", "1 cucharada de jugo de limón", "110-150ml / 4-5fl oz de aceite vegetal", "1 chile verde grande, finamente picado", "1 cucharadita de jengibre raíz, pelado, finamente picado", "2 dientes de ajo, pelados, muy finamente picados", "1 cucharada de cilantro fresco picado", "2 huevos de gallinas camperas", "pizca de sal", "3-4 cucharadas de harina natural", "1 cebolla roja, pelada, finamente cortada", "1 mango verde pequeño, pelado, finamente cortado en juliana", "1 chile verde, finamente picado", "1-2 tomates de ciruela, sin semillas, finamente en juliana", "½ pepino, cortado en 5cm / 2in de largo, sin semillas, en juliana", "10-15 hojas de menta fresca, finamente trituradas", "puñado de cilantro fresco picado", "½ cucharadita de sal", "1 lima, solo jugo", "1 cucharadita de vinagre de sidra"], "method": ["Para los kebabs, remoje varios pinchos pequeños de madera en agua fría durante 10 minutos.", "Para el adobo, mezcle todos los ingredientes del adobo en un tazón hasta que estén bien combinados. Déjelo a un lado durante 2-3 horas, a temperatura ambiente, luego transfiéralo a la nevera durante 5-6 horas.", "Para los kebabs, caliente 2 cucharadas de aceite en una cazuela hasta que fume. Agregue el cordero marinado a la sartén, en tandas si es necesario, y fría durante 4-5 minutos, o hasta que se dore por todas partes.", "Una vez que toda la carne esté dorada, retire la sartén del fuego y agregue el frío, el jengibre, el ajo y el cilantro. Dejar enfriar un poco.", "Llene una sartén con aceite vegetal suficiente para alcanzar 1,5 cm / ¾ pulgada por el costado de la sartén y caliente hasta que esté caliente.", "Mientras tanto, bata los huevos en un bol con una pizca de sal. Espolvorea la harina en un plato. Ensarte las piezas de cordero en pequeños pinchos de madera y drague la harina, luego sumerja en el huevo batido hasta que el cordero esté bien cubierto en el huevo.", "Con cuidado, baje los kebabs en el aceite y fríalos por 2-3 minutos por cada lado, o hasta que estén dorados y cocidos. Retire los pinchos de la sartén y déjelos a un lado para escurrirlos sobre papel de cocina.", "Para el cachumber, mezcle todos los ingredientes de la cachumber en un tazón hasta que estén bien combinados.", "Para servir, apile los kebabs de cordero en un plato de servir y sirva la cachumber al costado."], "url": "www_bbc_co_uk_food_recipes_muttoncannonniseekbo_93662", "title": "Cañón de cordero ni buscar boti (kebabs de cordero)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas, finamente cortadas", "sal y pimienta negra recién molida", "3 cucharadas de menta fresca finamente picada", "Tocino rayado de 300 g / 11 oz", "750g / 1lb 11oz pierna de cordero, en rodajas finas", "1 cucharada de aceite de oliva", "1 cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "2 cm / ¾ en pieza de jengibre fresco, rallado", "1 cucharadita de semillas de mostaza", "Remolacha lista para cocinar 300 g / 11 oz, picada", "50 g / 2 oz de azúcar en polvo", "75ml / 3fl oz de vinagre de jerez", "1 baguette, en rodajas gruesas"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Calentar una sartén hasta que esté caliente, luego agregar el aceite de oliva y la cebolla. Freír las cebollas durante 3-4 minutos, hasta que comiencen a suavizarse, luego sazonar bien con sal y pimienta negra recién molida y agregar la menta. Revuelva bien, luego retírelo del fuego y déjelo a un lado para que se enfríe.", "Use el tocino para revestir la base y los lados de un recipiente de pudín de 1 litro / 2 pinta, dejando algunas rodajas de tocino colgando sobre la parte superior del recipiente.", "Coloque un poco de la carne de cordero en rodajas en el fondo del tazón forrado de tocino, luego sazone con sal y pimienta negra recién molida.", "Cubra la capa de carne de cordero con algunas de las cebollas, luego repita con capas alternativas de carne de cordero y cebollas, hasta que el recipiente esté lleno tres cuartos.", "Doble el tocino sobrante sobre el relleno para cubrir y presione firmemente hacia abajo.", "Cubra la parte superior con papel de aluminio y coloque el recipiente en un recipiente para horno hondo tres cuartos lleno de agua caliente (esto es un baño maría).", "Transfiera al horno para hornear durante dos horas, luego retírelo y déjelo enfriar durante 15-20 minutos.", "Coloque un par de latas de tomates o frijoles (o cualquier otro objeto razonablemente pesado) encima de la lámina sobre la terrina y colóquela en el refrigerador hasta que esté fría.", "Mientras tanto, para el chutney de remolacha, caliente una sartén hasta que esté caliente, luego agregue el aceite de oliva, la cebolla roja, el ajo y el jengibre. Freír por 2-3 minutos, hasta que se ablanden.", "Agregue las semillas de mostaza y cocine hasta que revienten.", "Agregue la remolacha, el azúcar y el vinagre y cocine por 4-5 minutos, o hasta que la salsa picante se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida y dejar enfriar.", "Para servir, saca la terrina de la cuenca. Cortar cuñas de terrina y colocar en los platos con una cucharada de chutney y un pedazo de pan crujiente al lado."], "url": "www_bbc_co_uk_food_recipes_muttononionandmintte_85922", "title": "Terrina de cordero, cebolla y menta con chutney de remolacha y pan crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, ablandada, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "4 huevos medianos de granja", "3 limones, solo cáscara", "Harina de levante 225g / 8oz", "2 limones, solo jugo", "75 g / 2½ oz de azúcar en polvo", "2 limones, jugo y ralladura", "100 g / 3½ oz de azúcar en polvo", "50g / 1¾oz de mantequilla", "2 huevos de gallinas camperas", "½ cucharada de harina de maíz", "125g / 4½oz de mantequilla sin sal", "250 g / 9 oz de azúcar glas, cernida", "2 cucharaditas de extracto de limón siciliano", "Marshmallows blancos 300g / 10½oz", "colorante de comida de marfil", "550g / 1lb 4oz de azúcar glas, tamizado", "grasa vegetal (como Trex), para engrasar", "harina de maíz, para quitar el polvo", "spray de brillo perlado", "una cinta de oro y alfileres para asegurarlo en su lugar", "polvo de brillo de oro", "espíritu rejuvenecedor (utilizado con el polvo de brillo para crear pintura comestible)", "una joya decorativa", "Pasta de flor de azúcar 1 kg / 2lb 4 oz", "grasa vegetal (como Trex)", "Colorante de comida de gel rosa"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Alinee y engrase una lata de torta con forma de resorte de 20 cm / 8 pulg.", "Crema la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir los huevos uno por uno y luego agregar la ralladura de limón. Mezcle la harina y vierta la mezcla en la lata preparada. Alise la superficie y hornee por una hora, o hasta que una brocheta insertada en el centro salga limpia.", "Para la llovizna de limón, agregue el jugo de limón y el azúcar a una cacerola y caliente. Deje que se enfríe, luego cepille sobre la superficie de la torta cocida mientras todavía esté caliente. Dejar de lado para enfriar por completo.", "Para la cuajada de limón, mezcle todos los ingredientes en una cacerola. Calienta suavemente, revolviendo de vez en cuando, hasta que se espese. Dejar de lado para enfriar por completo.", "Para la crema de mantequilla de limón, bata la mantequilla hasta que esté suave y esponjosa. Agregue el azúcar glas lentamente hasta que esté completamente combinado, pálido y esponjoso. Agregue el extracto de limón.", "Cortar el pastel por la mitad horizontalmente y llenar con crema de mantequilla y cuajada de limón. Ponlo en una tarta de pastel. Con una cuchara, coloca la crema de mantequilla restante sobre la torta y alísala para cubrir completamente la torta con una \"capa de migajas\" lisa. No es necesario que se vea bien en esta etapa, pero es importante que la parte superior y los bordes sean rectos y lisos (para que los grumos no se vean cuando el pastel esté cubierto con glaseado de fondant).", "Para el fondant de malvavisco, agregue los malvaviscos, una cucharada de agua y un poco de colorante para alimentos en un recipiente apto para microondas.", "Calentar en ráfagas cortas en un microondas a fuego medio, revolviendo bien cada vez, hasta que los malvaviscos se derritan. Agregue el azúcar glas y mezcle hasta que se forme una pasta áspera. No se preocupe si todavía quedan grumos de azúcar glas en esta etapa.", "Engrase sus manos y una superficie de trabajo con grasa vegetal. Incline la pasta de malvavisco y amasar hasta que la pasta esté suave. Déle forma de círculo áspero en una película adhesiva y déjelo a un lado.", "Espolvoree una superficie de trabajo limpia y un rodillo con harina de maíz y extienda el fondant de malvavisco hasta que sea lo suficientemente grande como para cubrir el pastel con un poco de exceso.", "Levante el fondant de malvavisco en el pastel y alise la parte superior con un suavizador de glaseado de fondant si tiene uno o sus manos. Alise cuidadosamente los lados, asegurándose de expulsar las burbujas de aire sobre la marcha. Si tiene pequeños pliegues frótelos con un poco de harina de maíz. Recorte cualquier exceso de hielo de la parte inferior.", "Si usa las decoraciones, rocíe la torta con un spray de brillo perlado y cubra el borde inferior con cinta y asegúrelo en su lugar. Mezcle 2 cucharadas de polvo de lustre con suficiente alcohol rejuvenecedor para hacer una pintura. Con cuidado cepille un gran círculo de oro sobre la torta y déjelo a un lado para que se seque. Reserve cualquier pintura sobrante.", "Para hacer las flores de azúcar, amase la pasta en una superficie de trabajo engrasada con grasa vegetal hasta que esté flexible. Agregue unas gotas del colorante y amasar hasta que la pasta esté coloreada uniformemente.", "Recorte las formas de pétalos y use una herramienta de formación de hielo para baller (o un mango redondo para cuchillo) para diluir los bordes. Junta los pétalos para hacer flores y pellizca la parte inferior para que permanezcan juntas. Pintar los bordes de los pétalos con pintura dorada. Recorte cualquier exceso del \"tallo\" y coloque las flores encima del pastel."], "url": "www_bbc_co_uk_food_recipes_my_big_fat_british_69650", "title": "Mi gran pastel de bodas británico gordo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace pastel de 1 x 20 cm / 8 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x pasteles de pan Madeira confeccionados", "150ml / 5fl oz de amaretto (o cualquier licor fuerte), más extra para flamear", "800 g / 1 libra de fresas de 12 onzas, mondadas, cortadas por la mitad a lo largo", "Galletas amaretti 250 g / 9 oz, desmenuzadas", "algunas gotas de extracto de vainilla", "100g / 3½oz de azúcar glasé", "Crema doble de 900ml / 1½ pintas", "200g / 7oz de chocolate blanco rallado"], "method": ["Coloque el plato pequeño en una bandeja grande para que sea fácil de llevar. Corte una de las tartas Madeira en rodajas de 0.5 cm / ¼ y use algunas de las piezas para revestir el fondo del plato. (Asegúrate de que estén bien y apretados y en una sola capa, así que empuja hacia abajo cualquier parte que esté demasiado alta).", "Cepille la esponja con algo del amaretto. A continuación, tome unas pocas mitades de fresas que son aproximadamente del mismo tamaño y colóquelas apuntando hacia arriba en el borde exterior de la torta para que los bordes cortados estén presionando contra el vidrio. Repita todo el recorrido alrededor del plato.", "Espolvoree galletas amaretti desmenuzadas encima de la esponja hasta un tercio de las fresas.", "Coloque la vainilla, el azúcar glas y la crema en un tazón y bata hasta que estén gruesas y bien combinadas.", "Extienda un tercio de la crema encima de las fresas y desmenuce los bizcochos, y aliméntelo con una cuchara.", "Una vez que la mezcla de crema esté nivelada en el bol, limpie el borde con una toalla de cocina. Espolvorea con chocolate blanco.", "Repita el proceso de estratificación hasta que el recipiente esté lleno, terminando con una capa de fresas. Enfríe en la nevera hasta que esté listo para comer.", "Poco antes de servir, puedes flamear la parte superior de la bagatela. Para hacer esto, coloca un amaretto en un cucharón de acero inoxidable. Calentar a fuego lento. Encienda suavemente la mezcla y viértala sobre la bagatela. (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos)."], "url": "www_bbc_co_uk_food_recipes_my_big_fat_tipsy_trifle_16006", "title": "Mi gran bagatela borracho", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2oz de mantequilla, cortada en trozos pequeños", "60 g / 2 oz de manteca de cerdo, cortada en trozos pequeños", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "pizca de sal", "25g / 1oz de mantequilla", "3 cebollas, aproximadamente en rodajas", "sal y pimienta blanca recién molida", "250 g / 9 oz de queso Lancashire, rallado grueso", "leche, para sellado y acristalamiento"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4 y coloca una bandeja para hornear en el horno para que se caliente.", "Para la masa, coloque la mantequilla y la manteca de cerdo en un tazón grande con la harina y la sal. Frote suavemente la grasa en la harina usando las puntas de los dedos hasta que la textura se asemeje a pan rallado muy grueso. Alternativamente, use un procesador de alimentos para unir la grasa y la harina.", "Agregue 2-3 cucharadas de agua helada para unir la mezcla. Amasar ligeramente la masa hasta que esté bien amalgamada, espolvorear con harina y colocar en una bolsa de plástico sellable. Enfriar en la nevera durante 30 minutos antes de usar. Si tiene prisa, puede usar la masa inmediatamente.", "Para el relleno, caliente la mantequilla en una cacerola y fría las cebollas durante 10 minutos, sin colorear. Agregue 150 ml / 5 fl oz de agua, sal y pimienta negra recién molida y cocine hasta que casi todo el líquido se haya evaporado. Retire las cebollas, extiéndalas en un plato y déjelas a un lado para que se enfríen.", "Extienda dos tercios de la masa hasta que tenga unos 0.5cm / ¼ de grosor y forre una lata de tarta engrasada de 20cm / 8in engrasado, dejando cualquier exceso de hojaldre sobresaliendo por el borde.", "Ahora extienda la masa restante a un grosor similar que también será generosamente lo suficientemente ancho como para usar como tapa para el pastel. Cubra la base del pastel con la mitad de las cebollas y luego cubra con la mitad del queso rallado.", "Repita el proceso de estratificación en el paso 6 hasta que toda la mezcla se agote.", "Estirar los pasteles restantes para hacer una tapa para el pastel. Cepille los bordes de la caja de repostería con leche para sellar la tapa de la pastelería sobre ella, mientras también presiona los bordes juntos ligeramente antes de recortar cualquier voladizo sobrante. Cepille la superficie del pastel con leche. Haga tres pequeñas incisiones en el centro del pastel con la punta de un cuchillo afilado y, si lo desea, decore aún más para crear un efecto de celosía.", "Coloque el pastel en el horno y hornee durante 40-50 minutos, o hasta que se dore. Retirar del horno y dejar reposar durante unos 20-30 minutos antes de desmoldear y cortar en cuñas generosas.", "Sirva el pastel tibio o a temperatura ambiente (no caliente)."], "url": "www_bbc_co_uk_food_recipes_my_mothers_cheese_and_42949", "title": "Pastel de queso y cebolla de mi madre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/my_mothers_cheese_and_42949_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Castañas 500g / 1lb2oz", "1 apio entero, lavado y picado", "1 cebolla pequeña, finamente picada", "25g / 1oz de mantequilla", "12 ciruelas pasas, empedradas", "1 cucharada de perejil picado", "1 huevo, golpeado", "sal y pimienta negra", "el hígado de pavo, cortado y lavado finamente picado", "50g / 2oz de pan rallado fresco"], "method": ["Haga pequeñas hendiduras en las castañas y escalfarlas o asarlas para facilitar el pelado. Cocine a fuego lento las castañas en agua sin sal hasta que estén completamente tiernas (15-20 minutos).", "Escúrralos y déjelos enfriar, luego colóquelos en una palangana y ábralos aproximadamente con un tenedor; los quiere desmenuzar en vez de doblar.", "Sudor la cebolla y el apio en la mantequilla a fuego medio durante unos minutos hasta que se ablanden, luego agregue las ciruelas pasas, las castañas y el perejil. Sazone con sal y pimienta, mezcle bien y cocine por unos minutos más. Retire la sartén del fuego.", "Cuando la mezcla se haya enfriado un poco, mezcle el pan rallado, el hígado y el huevo hasta que todos los ingredientes estén bien combinados. Apila la mezcla en un plato resistente al horno de tamaño adecuado. Hornee durante 30-35 minutos en un horno bastante caliente (es decir, con el pavo a 180 ° C / 350 ° F / Gas 4) hasta que esté dorado y crujiente en la parte superior.", "Sirva rebanadas del relleno con el pavo."], "url": "www_bbc_co_uk_food_recipes_myfavouritestuffing_13964", "title": "Mi relleno favorito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/myfavouritestuffing_13964_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla fría, cortada en cubitos", "Harina normal 225g / 8oz", "50 g / 2 oz de almendras molidas", "50g / 2oz de azúcar en polvo de oro", "1 naranja, solo ralladura", "pizca de sal", "1 yema de huevo", "1-2 cucharaditas de agua fría", "Carne picada de buena calidad 280g / 10oz", "1 huevo, golpeado", "azúcar glas para espolvorear"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote la mantequilla en la harina y agregue las almendras, el azúcar impalpable, la cáscara de naranja y la sal hasta que la mezcla esté un poco desmenuzada.", "Combine la mezcla con la yema de huevo y 1-2 cucharaditas de agua hasta que forme masa blanda, luego póngalo en una bolsa de plástico y deje enfriar durante 20 - 30 minutos.", "Extienda la masa a un espesor de 2-3 mm (0,1 pulgadas) y corte alrededor de 18 rondas que miden 7,5 cm (3 pulgadas) con un cortador de pasteles.", "Coloque en latas de empanada ligeramente engrasadas y cuchara la carne picada uniformemente en los pasteles.", "Vuelve a enrollar la masa sobrante y corta tapas redondas, estrellas u otras formas festivas para que quepan en la parte superior de la carne picada.", "Cepille ligeramente las pastas con el huevo batido y hornee en el horno de 12 a 15 minutos hasta que estén doradas.", "Retire del horno y déjelo unos minutos antes de sacarlo de latas y enfriarlo en una rejilla de alambre.", "Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_mymincepies_71055", "title": "Pasteles de carne picada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Cumple 18 años", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mymincepies_71055_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite vegetal", "7 granos de pimienta negra, dejados enteros", "3 vainas de cardamomo negro, dejadas en su totalidad", "5 vainas de cardamomo verde, dejadas en su totalidad", "4 clavos, izquierda entera", "1 ramita de canela", "1 pieza de maza", "1 cebolla, finamente picada", "750g / 1½lb de cordero o cordero, cortado en pedazos", "6 dientes de ajo, pelados, dejados enteros", "2cm / ¾ en pieza de jengibre, pelado y cortado por la mitad", "2 cucharaditas de cilantro molido", "2 cucharaditas de comino molido", "½ cucharadita de chile rojo en polvo", "2 cucharaditas de semillas de hinojo molido", "1½ cucharadita de sal masala", "sal al gusto", "2 tomates, mezclados a una pulpa en un procesador de alimentos", "3 cucharadas de yogurt natural, revuelto", "puñado de cilantro fresco picado, hojas y tallos"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue los granos de pimienta negra, las vainas de cardamomo negro y verde, el clavo de olor, la canela y la macis y fría por 1-2 minutos, o hasta que las especias estén chisporroteando y fragantes.", "Agregue la cebolla picada y fría por 8-10 minutos, revolviendo regularmente, hasta que se dore.", "Agregue las piezas de cordero y fría por 3-4 minutos, revolviendo continuamente, hasta que estén doradas por todas partes.", "Mientras tanto, en un procesador de alimentos, mezcle los dientes de ajo y el jengibre con una cucharada de agua hasta obtener una pasta fina.", "Agregue el ajo y la pasta de jengibre a la mezcla de cordero, revuelva bien para combinar, luego reduzca el fuego y continúe cocinando durante 3-4 minutos, revolviendo regularmente.", "Agregue el cilantro en polvo, comino, chile en polvo, semillas de hinojo, garam masala, sal, pulpa de tomate y yogur, cubra la olla con una tapa, luego reduzca el fuego a fuego lento y cocine a fuego lento durante 10-12 minutos, o hasta la salsa se ha secado casi por completo.", "Agregue 2-3 cucharadas de agua hirviendo a la salsa, mezcle bien y cocine a fuego lento durante 7-8 minutos más, revolviendo continuamente y agregando salpicaduras de agua según sea necesario, hasta que el volumen del líquido se haya reducido y la salsa se haya espesado.", "Agregue suficiente agua hirviendo para cubrir casi el cordero, ponga la mezcla a ebullición, luego reduzca el fuego a fuego lento y cocine a fuego lento de 8 a 10 minutos, o hasta que el cordero esté cocido.", "Agregue el cilantro picado justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_myroganjosh_90030", "title": "Rogan Josh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/myroganjosh_90030_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "2 cucharaditas de azúcar", "½ cucharadita de sal", "½ cucharadita de polvo de hornear", "110-130 ml / 3½-4½ fl oz de leche", "2 cucharadas de aceite vegetal, más extra para engrasar", "semillas de nigella, semillas de amapola o semillas de sésamo, o ajo picado y cilantro fresco", "1 cucharada de mantequilla, derretida, para servir"], "method": ["Para la masa, tamice la harina, el azúcar, la sal y el polvo de hornear en un tazón. En otro recipiente, mezcle la leche y el aceite.", "Haga un pozo en el centro de la mezcla de harina y vierta la mezcla líquida. Lentamente mezcle la masa trabajando desde el centro e incorporando la harina de los bordes del \"pozo\", para hacer una masa suave y suave. Amasar bien durante 8-10 minutos, agregando un poco de harina si la masa es demasiado pegajosa.", "Coloque la masa en un bol engrasado, cubra con una toalla de té húmeda y deje en un lugar cálido durante 10-15 minutos. Forme la masa en cinco bolas.", "Precaliente la parrilla a mediano y coloque una bandeja para hornear pesada en el estante superior de la parrilla para calentar.", "Ruede las bolas de masa bastante delgadas, idealmente en forma de lágrima, pero realmente esto es solo estético. Espolvorea sobre el relleno elegido y presiona en la superficie de la masa. Coloque los naans en la bandeja para hornear caliente y ase a la parrilla por solo 1-2 minutos, o hasta que estén ligeramente dorados. Cepille con mantequilla y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_naan_86626", "title": "Pan naan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/naan_86626_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de levadura activa seca", "1 cucharadita de azúcar", "Harina normal de 200g / 7oz", "pellizcar semillas de cebolla negra (semillas de nigella)", "¼ cucharadita de sal", "½ cucharadita de polvo de hornear", "1 cucharada de aceite vegetal", "2 cucharadas de yogur natural", "2 cucharadas de leche"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "En un tazón pequeño, mezcle la levadura con una cucharada de agua tibia. Agregue el azúcar y déjelo en un lugar tibio durante cinco minutos hasta que la levadura esté cubierta de espuma.", "Mientras tanto, mezcle la harina, las semillas de cebolla, la sal y el polvo de hornear. Agregue el aceite, el yogur y la leche, luego agregue la mezcla de levadura activada.", "Para amasar la masa, aprieta la mano en un puño, humedece tus nudillos con un poco de agua, luego presiónalos repetidamente en la masa. Continúe presionando y amasando hasta que tenga una masa blanda y flexible. Debería llevar unos diez minutos.", "Coloque la masa en un recipiente para mezclar, cúbrala con una película adhesiva y déjela en un lugar cálido para que se levante durante 10 a 15 minutos.", "Divida la masa en cuatro bolas y colóquela sobre una superficie o tabla enharinada. Ruede cada uno en una forma oval larga de aproximadamente 0.5cm / ¼ de grosor. No los despliegue demasiado delgados o se convertirán en patatas fritas.", "Colóquelos en una bandeja para hornear engrasada y colóquelos en el centro del horno durante 10-15 minutos. Están listos cuando se han inflado un poco. Deben ser suaves y desmenuzables, no masticables. Sirva fresco del horno."], "url": "www_bbc_co_uk_food_recipes_naanbreads_77147", "title": "Panes Naan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 aguacates muy maduros, piel y piedras eliminadas", "1 lima grande, solo jugo", "1 chile, sin semillas, finamente picado", "½ diente de ajo, pelado, rallado", "pizca de comino molido (opcional)", "1 tomate grande maduro, sin semillas, picado", "2 cebollas de primavera, cortadas, finamente cortadas", "sal y pimienta negra recién molida", "3-4 tomates, sin semillas, finamente picados", "1 chile rojo, sin semillas, finamente picado", "dash Tabasco, al gusto", "1 diente de ajo, pelado", "1 lima grande, solo jugo", "½ cucharada de aceite de oliva virgen extra", "2 bolsas de 200 g / 7 oz bolsas de tortillas simples", "200g / 7oz jar jalapeño chiles, escurridos, en rodajas", "Queso cheddar maduro 200 g / 7 oz, rallado", "1 x 150ml / 5¼fl oz de crema agria de marihuana", "pequeño puñado de hojas de cilantro fresco picado"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Para el guacamole, machaque todos los ingredientes del guacamole juntos en un tazón con un tenedor, hasta que estén bien combinados.", "Cubra el recipiente con film transparente y enfríe en la nevera hasta que lo necesite (o durante al menos 20 minutos).", "Mientras tanto, para la salsa, mezcle todos los ingredientes de la salsa hasta que estén bien combinados. Dejar de lado por 10 minutos.", "Espolvoree las tortillas en un plato grande a prueba de horno. Dispersar sobre los chiles jalapeños en rodajas y el queso rallado. Transfiera al horno y cocine hasta que el queso se haya derretido, aproximadamente 4-5 minutos.", "Para servir, coloca cucharadas de guacamole, salsa y crema agria encima de los nachos. Espolvorea sobre las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_nachos_92445", "title": "Nachos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nachos_92445_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Lentejas amarillas 250 g / 9 oz", "2 cucharadas de aceite vegetal", "4 cebollas picadas", "1 chile rojo, finamente picado (se eliminan las semillas si se prefiere)", "4 dientes de ajo, aplastados", "½ cucharadita de cúrcuma molida", "½ cucharadita de chile en polvo", "1 cucharadita de comino molido", "3 pequeños chiles rojos secos", "2 papas harinosas, peladas y cortadas en dados de 5 mm", "2 tomates, toscamente picados", "5 cucharadas de aceite vegetal", "2 dientes de ajo, aplastados", "½ cebolla, finamente rebanada", "1 chile rojo, en rodajas finas", "1 cucharadita de cinco especias hindú (ponche pooran)", "gran puñado de hojas frescas de cilantro"], "method": ["Para el dal, remoje las lentejas (idealmente durante la noche) o durante un mínimo de 4 horas.", "Caliente el aceite vegetal en una sartén grande. Agregue las cebollas, el chile y el ajo y cocine hasta que se ablanden.", "Agregue las especias molidas, los chiles secos y un poco de agua para aflojar y remover.", "Agregue las papas y las lentejas y suficiente agua para cubrir casi. Cocine a fuego lento durante 10-12 minutos. Agregue los tomates y cocine a fuego lento durante 10-15 minutos, hasta que se hayan ablandado pero no se hayan disuelto.", "Mientras tanto, para el relleno freír el ajo, la cebolla y el chile en el aceite hasta que estén caramelizados y crujientes. Agrega las cinco especias y, una vez que escuches las especias, quita el fuego.", "Para servir, saque el dal y adornelo con el relleno crujiente. Espolvorea con el cilantro."], "url": "www_bbc_co_uk_food_recipes_nadiyas_dhal_45569", "title": "Dal de Nadia", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nadiyas_dhal_45569_16x9.jpg", "isVegetarian": true, "recommendations": 0}]