[{"ingredients": ["3 huevos de gallinas camperas, solo para blancos", "150 g / 5½ oz de azúcar en polvo de oro", "Crema doble 150ml / ¼pt", "150 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids)", "crema doble, batida, utilizada para emparedar merengues juntos"], "method": ["Precaliente el horno a 140 ° C / 275 ° F / Gas 1 y alinee dos bandejas planas para hornear con papel para hornear.", "Separe los huevos en un recipiente grande y limpio, preferiblemente de metal o vidrio. Agriete suavemente la cáscara contra el costado de un tazón pequeño. Lentamente jale la carcasa lo más limpiamente posible a lo largo de la grieta, inclinando la yema en la mitad del caparazón. Deje que el blanco se escurra en un recipiente debajo. Deja caer la yema en otro tazón pequeño. Separe el siguiente huevo sobre un tercer tazón, de esa manera si accidentalmente rompe la yema, no contaminará los blancos limpios. (Puede usar las yemas para otra receta, como flan o helado).", "Con un batidor de mano eléctrico, batir los blancos hasta que se formen picos rígidos cuando se quite el batidor, pero la mezcla no debe verse demasiado seca.", "Agregue una cucharada de azúcar a las claras de huevo, y continúe batiendo hasta que la mezcla vuelva a los picos rígidos. Agregue el azúcar una cucharada a la vez hasta que se haya usado todo, y el merengue es grueso y brillante.", "Usando dos cucharadas soperas, coloca 16 merengues con forma de pelota de rugby en el papel de hornear, dejando suficiente espacio entre ellos.", "Hornee durante una hora hasta que los merengues estén pálidos, dorados, crujientes y aléjalos fácilmente del papel de hornear. Abra ligeramente la puerta del horno y deje que los merengues se enfríen en el horno.", "Mientras tanto, haz el relleno de chocolate (ganache). Use un cuchillo grande y afilado para cortar el chocolate en trozos pequeños.", "Vierta la crema en una cacerola pequeña, luego llévela justo por debajo de la ebullición. Saque la sartén del fuego, agregue el chocolate picado, agite la sartén para ayudar a combinar el chocolate y revuelva hasta que quede suave. Incline el ganache fuera de la sartén y déjelo enfriar, se espesará a medida que se enfríe.", "Cuando el ganache se haya enfriado, extiéndelo sobre el lado plano de la mitad de los merengues, luego empareda los merengues. Para que estos sean un poco más lujosos, látigo un poco de crema doble, luego cuchara sobre la ganache antes de emparedar los merengues juntos."], "url": "www_bbc_co_uk_food_recipes_how_to_make_meringues_70958", "title": "Cómo hacer merengues", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8 merengues intercalados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_meringues_70958_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "350-400ml / 12-14fl oz de leche, o ½ leche ½ agua para un panqueque más liviano", "2 huevos grandes, ligeramente batidos", "1 cucharada de aceite vegetal", "pizca de sal", "aceite vegetal, para freír"], "method": ["Ponga la harina en un tazón grande, haga un pozo en el centro y vierta la leche y los huevos. Dale a la mezcla líquida un batidor rápido antes de incorporar la harina. Continúa batiendo hasta que tengas una masa suave.", "Ahora agregue 1 cucharada de aceite vegetal y bata bien.", "Tome una bandeja para crepes o una sartén grande, sumerja un poco de papel en el aceite y limpie cuidadosamente el interior de la sartén. Caliente la sartén a fuego medio durante un minuto.", "Añadir justo debajo de un cucharón de masa a la sartén e inmediatamente comenzar a girar alrededor de la sartén para obtener una buena capa uniforme.", "Cocine el panqueque por aproximadamente 30-40 segundos. Use una espátula para levantar la tortita con cuidado para mirar la parte inferior y verifique que esté dorada antes de dar la vuelta. Cocine el otro lado durante aproximadamente 30-40 segundos y transfiéralo a un plato para servir."], "url": "www_bbc_co_uk_food_recipes_how_to_make_pancakes_02824", "title": "Cómo hacer panqueques", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pancakes_02824_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cebolla mediana, finamente picada", "1 papa grande (aproximadamente 250 g / 9 oz), cortada en cubos pequeños", "300 g / 10½oz de petits congelados pois o guisantes de jardín", "400ml / 14fl oz de caldo de pollo, o caldo de vegetales si lo prefiere", "200 ml / 7 fl oz de leche semidesnatada o entera", "100g / 3½oz de jamón corte grueso", "pequeñas hojas de menta fresca puñado, opcional", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una cacerola grande a fuego medio o bajo, luego agregue la cebolla y la papa, sazone con sal y pimienta, luego revuelva para cubrir las verduras en el aceite.", "Tome un trozo de papel para hornear lo suficientemente grande como para cubrir la parte superior de la sartén, aplástelo y luego despliéguelo. Coloque el papel sobre la superficie de las verduras, sellándolas hasta los bordes de la bandeja (esto ayuda a cocinar las verduras más rápidamente). Coloque una tapa en la sartén, cocine a fuego lento durante 8-10 minutos, hasta que las papas estén tiernas y las cebollas estén suaves y translúcidas.", "Retire el papel. Agregue los guisantes y el caldo a la sartén, luego lleve a ebullición. Cocine por un par de minutos, o hasta que todos los guisantes hayan flotado hacia la parte superior y estén tiernos y brillantes.", "Saca la sartén del fuego. Usando una batidora, procesa los guisantes hasta que estén suaves. Agregue la leche (o, si lo prefiere, use más caldo, agua o crema). Rasgue en la mayor parte del jamón. Traiga la sopa a fuego lento, luego sazone al gusto con sal y pimienta, recordando que el jamón es bastante salado.", "Para servir, ponga la sopa en cuencos y luego espolvoree con el resto del jamón y algunas hojas de menta rotas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_pea_and_ham_17426", "title": "Cómo hacer sopa de guisantes y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pea_and_ham_17426_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de piñones", "125 g / 4½ oz de queso parmesano (o un queso duro vegetariano similar), cortado en pequeños trozos", "1 manojo grande de albahaca fresca", "1 diente de ajo, aplastado con el lado plano de un cuchillo", "200ml / 7fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "exprimir jugo de limón"], "method": ["Calentar una sartén seca a fuego medio. Agregue los piñones y támelos por unos minutos hasta que estén dorados y fragantes.", "Coloque los trozos de parmesano en un procesador de alimentos y agregue las hojas de albahaca, ajo, piñones tostados y aceite de oliva. Sazone al gusto con sal y pimienta negra recién molida.", "Mezcle durante unos segundos hasta que comience a juntarse y sea suave.", "Pruebe el pesto para condimentar y agregue un chorrito de jugo de limón si lo desea.", "Si no lo usa de inmediato, puede almacenar el pesto en un frasco y lo mantendrá durante una semana en el refrigerador. O puede ponerlo en bandejas de cubitos de hielo y congelarlo."], "url": "www_bbc_co_uk_food_recipes_how_to_make_pesto_18843", "title": "Cómo hacer pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pesto_18843_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de harina blanca fuerte", "100 g / 3½ oz de sémola, más extra para quitar el polvo", "2 cucharaditas de sal", "15 g / ½ oz de levadura fresca o 1½ cucharadita de levadura seca", "275ml / 9½fl oz de agua", "50ml / 2fl oz de aceite de oliva, más extra para engrasar", "2 cucharadas de salsa de tomate", "ingredientes de pizza de tu elección"], "method": ["En un tazón grande, mezcle la harina, la sémola y la sal. Agregue la levadura seca (o desmigaje en la levadura fresca, lo que esté usando). Haga un pozo en el centro de la mezcla de harina. Vierta la mayor parte del agua en el pozo junto con el aceite de oliva y junte la masa con las manos o con una cuchara de madera. A medida que se incorpora la harina, la masa comenzará a tomar forma. Agregue el agua restante si la masa se siente apretada o dura.", "Voltee la masa sobre una superficie limpia y amasar durante 10 minutos o hasta que la masa esté suave y elástica. Corta un trozo pequeño de la masa y estira la parte lo más finamente que puedas. Si puede ver la sombra de sus dedos a través de la masa, la luz debe brillar a través de la masa como un cristal de ventana, sin que la masa se rompa, está lista para probar.", "Amasar la pieza cortada de nuevo en la masa y formar la masa en una bola uniforme. Coloque en un tazón engrasado, cubra con una toalla de té húmeda y deje que se demuestre en un lugar cálido durante aproximadamente 1-1½ horas, o hasta que se haya duplicado (la temperatura de su cocina puede afectar el tiempo de esta).", "Cuando la masa se haya levantado, sáquela del bol y elimine el aire. Divida la masa en dos porciones iguales, y dé forma a cada porción en una bola. Cubra la masa con un paño húmedo y deje que se pruebe nuevamente durante aproximadamente 15 minutos.", "Coloque una piedra para pizza o una bandeja para hornear boca arriba en el horno y precaliente a su configuración más alta.", "Polvo la superficie de trabajo generosamente con sémola. Estire una pieza de la masa para formar un círculo que se ajuste a la piedra para pizza o a la bandeja para hornear.", "Transfiera la base de la pizza a una tabla de cortar de plástico (u otra bandeja para hornear volteada hacia arriba) espolvoreada con sémola. La bandeja se usará para deslizar la base de la pizza directamente sobre la piedra para pizza.", "Cubra la superficie con la mitad de la salsa de tomate y coberturas de su elección.", "Cuando esté listo para hornear, deslice la pizza directamente sobre la piedra de la pizza y cocine durante 8-10 minutos, o hasta que la base esté dorada y los ingredientes salgan burbujeantes. Repita con la masa restante, salsa de tomate y coberturas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_pizza_50967", "title": "Cómo hacer pizza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 2 pizzas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pizza_50967_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina natural, más extra para extender", "½ cucharadita de sal fina", "250g / 9oz de mantequilla sin sal, fría pero no dura como la piedra (o puede usar media manteca, media manteca de cerdo)", "150 ml / ¼ pinta de agua helada"], "method": ["Tamiza la harina y la sal en un tazón grande para mezclar, luego pon el tazón en el refrigerador por unos minutos para que se enfríe. (Mantener fría la harina y el recipiente le ayudará a obtener un mejor resultado más adelante y a crear buenas capas de masa).", "Mientras tanto, corta la mantequilla en cubos pequeños.", "Con un cuchillo de hoja redonda, revuelva la mantequilla en el recipiente hasta que cada pieza esté bien cubierta con harina.", "Vierta en el agua, luego, trabajando rápidamente, use el cuchillo para unir todo en una masa áspera.", "Reúna la masa en el recipiente con una mano, luego gírela a la superficie de trabajo. Aplastar la masa en una salchicha plana y gruesa, sin amasar. Envuelva con film transparente y luego enfríe la masa en la nevera durante 15 minutos.", "Enharinar ligeramente la superficie de trabajo y la masa. Estire la masa en una dirección hasta que tenga alrededor de 1 cm de grosor y tres veces más que anchura, o aproximadamente 45x15 cm / 18x6 pulgadas. Enderezar los lados con las manos una y otra vez, y tratar de mantener los bordes superior e inferior lo más cuadrados posible.", "Dobla el tercio inferior de la masa hacia arriba, luego el tercio superior hacia abajo, para hacer un bloque de aproximadamente 15x15 cm / 6x6 pulgadas. No importa si la masa no es exactamente del tamaño correcto, lo importante es que las esquinas sean agradables y cuadradas.", "Gire la masa de modo que su borde abierto quede hacia la derecha, como un libro. Presione los bordes de la masa junto con el rodillo.", "Estirar y doblar la masa nuevamente, repitiendo esto cuatro veces para hacer una masa suave, con vetas mantecosas aquí y allá. Si la masa se siente grasosa en algún punto, o comienza a brotar cuando se enrolla, cúrela y déjela enfriar durante 10 minutos antes de continuar.", "Enfríe el pastel terminado durante una hora, o idealmente durante la noche, antes de usarlo.", "Cuando use la masa pastelera, extiéndala alrededor del grosor de una moneda de £ 1 y cocínela a 200C / 400F / Gas 6 durante aproximadamente 30 minutos."], "url": "www_bbc_co_uk_food_recipes_how_to_make_puff_pastry_65905", "title": "Cómo hacer hojaldre", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 500 g / 1lb de hojaldre", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_puff_pastry_65905_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10-15 limones no encerados", "250g / 9oz de sal marina escamosa (dependiendo del tamaño de los limones)", "2 palitos de canela (opcional)", "2 chiles rojos secos (opcional)", "4 hojas de laurel (opcional)"], "method": ["Para limpiar los frascos, precaliente el horno a 140C / 275F / Gas 1. Lave bien los frascos con agua tibia y jabón y luego enjuague bien con agua corriente. Deje los frascos y tapas para secar, al revés, en el horno. (O puede limpiar los frascos poniéndolos a través del ciclo caliente del lavavajillas).", "Para los limones preservados, restriegue los limones, luego corte cada limón por la mitad a lo largo. Corte de nuevo longitudinalmente, para dividir cada mitad de limón en tres rebanadas largas y delgadas.", "Apriete bien los limones en los frascos esterilizados, empacando la sal a su alrededor generosamente a medida que construye las capas. Pase las hierbas y las especias, si las usa, alrededor de los limones.", "Presione bien los limones y termine con una capa final de sal. Para la decoración, puede agregar granos de pimienta y una hoja de laurel, aunque esto no afectará el sabor.", "Deje el recipiente en un lugar fresco y oscuro durante al menos tres meses antes de usarlo. Gira los frascos todos los días Siempre debe haber una capa de sal en el fondo del frasco, así que agregue sal extra si es necesario. Los limones maduros son de color marrón amarillento.", "Una vez abierto, manténgalo en el refrigerador y vuelva a taparlo con jugo de limón o una capa de aceite de oliva después de cada uso. Cuando los uses, la única parte del limón que necesitas es la corteza: raspa la médula y la pulpa y corta la cáscara finamente. Pruebe un poco revuelto en puré de papa, o en arroz, servido con pescado."], "url": "www_bbc_co_uk_food_recipes_how_to_make_preserved_01545", "title": "Cómo hacer limones en conserva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace tarros de 2x500ml / 18fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_preserved_01545_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de papas nuevas, como Charlotte", "1-2 cucharadas de colza o aceite de oliva", "sal y pimienta negra recién molida", "8 muslos de pollo deshuesados ​​y sin piel (aproximadamente 500 g / 1 lb 2 oz)", "1 cucharadita de pimentón ahumado", "pellizcar la canela molida (opcional)", "puñado de ramitas de tomillo fresco o 1 cucharadita de tomillo seco", "Salchicha de chorizo ​​seca de pieza de 115g / 4oz", "4 tomates maduros (o alrededor de 150 g de tomates cherry)", "2 dientes de ajo", "puñado de perejil plano"], "method": ["Precalentar el horno a 220 ° C / 425 ° F / Gas 7. Reducir a la mitad o un cuarto las papas, dependiendo de su tamaño (para producir trozos de tamaño uniforme). Coloque en una lata de asar antiadherente grande. Mezcle con dos cucharadas de aceite y sazone al gusto con sal y pimienta, luego ponga en el horno por 15 minutos.", "Corte los muslos de pollo por la mitad, agregue el pimentón ahumado y la canela, si los usa. Disperse con la mitad de las hojas de tomillo, sazone con sal y pimienta, remueva y reserve.", "Haga un corte en la piel del chorizo ​​y luego quite la piel de papel. Corta la salchicha en trozos o rondas.", "Cuando las papas se hayan asado durante 15 minutos, revuélvalas y luego coloque el pollo y los tomates en la sartén. Esparce el chorizo, el ajo y las hojas de tomillo restantes, luego condimenta con sal y pimienta.", "Rocíe el resto del aceite por completo, y vuelva al horno para asar durante 20 minutos más, revolviendo hasta la mitad, hasta que el pollo esté cocido y las papas y los tomates estén dorados y crujientes en los bordes.", "Esparza el plato con un puñado de perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_how_to_make_roast_71135", "title": "Cómo hacer pollo al chorizo ​​asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_roast_71135_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco sin blanquear, más extra para enharinar", "300g / 10½oz de masa fermentada", "250ml / 9fl oz de agua", "10g / ¼ oz de azúcar moreno", "10 g / ¼ oz de sal", "aceite sin sabor, para engrasar"], "method": ["Mezcle la harina, el entrante de masa fermentada y el agua en un tazón. Agregue el azúcar y la sal. Encienda la superficie de la cocina y amasar durante 10 minutos o hasta lograr el \"efecto de ventana\" (donde la masa se puede estirar hasta que quede tan fina que se vuelva transparente).", "Coloque la masa en un bol ligeramente engrasado, cubra con una toalla de té húmeda y deje que se compruebe durante 2½-3 horas. No notarás un aumento de la masa tan grande como lo harías con un pan normal levantado y te tomará mucho más tiempo.", "Pon la masa sobre la superficie limpia de la cocina y tira hacia atrás. Porción de la masa en dos y la forma en dos panes en forma de bola. Harina generosamente, y coloque cada lado de la hogaza de pan hacia arriba en un tazón, forrado con una tela couche o un paño de cocina enharinado - sin el paño, su pan se pegará en el tazón y no podrá apagarlo. Deja probar durante otras 2½ horas.", "Precalentar el horno a 230 ° C / 450 ° F / Gas 8. Ponga unos cubos de hielo o agua fría en una lata para hornear y colóquelo en el fondo del horno para crear vapor. Coloque los panes en una bandeja para hornear o en una piedra caliente para hornear. Con un cuchillo fino y afilado, puntúe dos o tres veces en la parte superior del pan y colóquelo en el horno. Hornee durante 35-40 minutos o hasta que se forme una buena corteza y los panes suenen huecos al golpearlos en la base."], "url": "www_bbc_co_uk_food_recipes_how_to_make_sourdough_08213", "title": "Cómo hacer pan de masa fermentada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_sourdough_08213_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "1 chalote, finamente picado", "4 chiles verdes de ojo de pájaro picados", "4 dientes de ajo, aplastados", "pulgar de jengibre fresco de la raíz del tamaño del pulgar, rallado", "1 tallo de limoncillo, finamente picado", "pizca de sal", "pequeño racimo de cilantro fresco, tallos y hojas", "2 hojas secas de lima kaffir", "1 cucharada de salsa de pescado", "pizca de pimienta blanca molida", "1 cucharada de aceite vegetal", "1 berenjena, cortada en trozos de 2cm / 1in", "1 x 400 ml puede leche de coco", "2 cucharadas de pasta de curry verde tailandés (hecho arriba)", "100g / 3½oz de judías verdes finas", "100ml / 3½fl oz de caldo de pollo o vegetal", "1 cucharada de azúcar de palma o azúcar impalpable", "1-2 cucharaditas de salsa de pescado tailandesa", "500g / 1lb 2oz de langostinos crudos pelados", "1 hoja de lima kaffir seca", "1 lima, ralladura y jugo", "pequeño racimo de cilantro fresco, picado", "arroz jazmín al vapor, para servir"], "method": ["Para la pasta de curry, tuesta ligeramente el cilantro y las semillas de comino en una sartén seca, hasta que esté fragante.", "Coloque las semillas en un almirez y mortero, y agregue la chalota, los chiles, el ajo, el jengibre, el limoncillo y la sal. Libra a una pasta con la mano del mortero. Alternativamente, puede usar un procesador de alimentos para hacer esto.", "Corta los tallos de cilantro en trozos y deja las hojas para más tarde. Agregue los tallos de cilantro y desmenuce las hojas secas de lima kaffir a la mezcla, y continúe moliendo hasta que quede bastante suave.", "Agregue la salsa de pescado y una pizca de pimienta blanca, para sazonar. La pasta de curry ahora está lista para usar. Si no se usa inmediatamente, la pasta se puede guardar en un frasco con un poco de aceite y se mantendrá en el refrigerador durante un par de semanas.", "Para el curry, caliente el aceite vegetal en un wok o una sartén grande a fuego medio. Agregue las berenjenas picadas y freír durante 4-5 minutos, hasta que se dore por todos lados y comience a ablandarse. Cocine por otros 10 minutos hasta que las berenjenas estén doradas y suaves.", "Agregue la grasa sólida de la parte superior de la lata de leche de coco y luego agregue la pasta de curry verde tailandés y fría durante 2-3 minutos hasta que la pasta se haya cocinado un poco y sea fragante.", "Agregue la leche de coco restante, lleve a ebullición, luego baje el fuego a fuego lento. Agregue las judías verdes y continúe cocinando por 2-3 minutos, revolviendo ocasionalmente.", "Deje que la leche de coco se reduzca y espese un poco antes de agregar el caldo de pollo.", "Agregue el azúcar y la salsa de pescado al curry.", "Agregue las gambas crudas y cocine por 3-5 minutos hasta que se pongan rosadas y estén bien cocidas.", "Desmenuce en la hoja de lima kaffir triturado, jugo de limón fresco y ralladura, y cilantro picado.", "Sirva con arroz jazmín al vapor y espolvoree sobre las hojas de cilantro reservadas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_thai_green_83259", "title": "Cómo hacer curry verde tailandés con gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_thai_green_83259_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de fruta de verano congelada (frambuesas, moras, fresas, grosellas negras y grosellas rojas funcionan bien)", "Azúcar en polvo de 50 g / 2 oz, o más al gusto", "2 cucharadas de licor de grosella negra o frambuesa (cassis o Chambord)", "500ml / 18fl oz de jugo de manzana nublado", "5 hojas de gelatina de hoja", "Pastel de maderas 250 g / 9 oz", "250g / 9oz de mascarpone", "Crema de vainilla lista para usar 500ml / 18floz", "Crema batida de 300 ml / ½ pinta", "puñado de almendras tostadas o avellanas, para servir"], "method": ["Ponga la fruta en una cacerola, agregue el azúcar, luego cocine suavemente hasta que el azúcar se haya disuelto y el líquido esté ligeramente almibarado. Retire la mitad de las bayas y el jugo en un tazón, agregue una cucharada de cassis y deje a un lado para que se enfríe.", "Agregue el jugo de manzana a la fruta en la sartén y cocine a fuego lento. Pruebe la fruta y agregue un poco más de azúcar si es necesario. Retire del fuego y agregue el cassis restante.", "Remoje las hojas de gelatina en un recipiente de agua fría durante cinco minutos, hasta que estén suaves y flojas. Levante la gelatina del agua y exprima el exceso de líquido.", "Agregue la gelatina a la fruta en la sartén y revuelva hasta que se haya disuelto por completo. Retire del fuego y transfiera la mezcla de gelatina a un recipiente. Deje que se enfríe, luego enfríe en el refrigerador hasta que la mezcla se haya convertido en una gelatina que se tambalea suavemente.", "Corta el pastel de Madeira en rebanadas de 1 cm / ½. Revuelva la gelatina con sabor a fruta: se debe poner suavemente. Coloque la torta, la mermelada, la fruta y el jugo en el fondo de un plato pequeño (aproximadamente 20 cm de diámetro).", "Para la capa de natillas, coloque el mascarpone en un tazón grande y luego agregue la crema pastelera. Batir hasta que quede cremoso y suave. Coloque la crema sobre la fruta y la esponja.", "Batir la crema hasta que se formen picos suaves cuando retire el batidor de la mezcla.", "Cucharee la crema en la parte superior de la bagatela, comenzando desde el exterior y trabajando. Esto evitará que la crema se hunda en la crema pastelera.", "Enfriar la bagatela durante una hora antes de servir.", "Termine con una dispersión de almendras tostadas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_trifle_89033", "title": "Cómo hacer nada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trifle_89033_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "1 chalote, finamente picado", "4 chiles verdes de ojo de pájaro picados", "4 dientes de ajo, aplastados", "pulgar de jengibre fresco de la raíz del tamaño del pulgar, rallado", "1 tallo de limoncillo, finamente picado", "pizca de sal", "pequeño racimo de cilantro fresco, tallos y hojas", "2 hojas secas de lima kaffir", "1 cucharada de salsa de pescado", "pizca de pimienta blanca molida"], "method": ["Tueste ligeramente el cilantro y las semillas de comino en una sartén seca, hasta que estén fragantes.", "Coloque las semillas en un almirez y mortero, y agregue la chalota, los chiles, el ajo, el jengibre, el limoncillo y la sal. Libra a una pasta con la mano del mortero. Alternativamente, puede usar un procesador de alimentos para hacer esto.", "Corta los tallos de cilantro en trozos, y separa las hojas para agregarlas al curry terminado. Agregue los tallos de cilantro y desmenuce las hojas secas de lima kaffir a la mezcla, y continúe moliendo hasta que quede bastante suave.", "Agregue la salsa de pescado y una pizca de pimienta blanca. La pasta de curry ahora está lista para usar. Si no se usa inmediatamente, la pasta se puede guardar en un frasco con un poco de aceite y se mantendrá en el refrigerador durante un par de semanas."], "url": "www_bbc_co_uk_food_recipes_how_to_make_thai_green_67270", "title": "Cómo hacer pasta de curry verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace suficiente para un curry, sirviendo a cuatro personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_thai_green_67270_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "¼ de bulbo de hinojo, en rodajas finas", "½ cebolla, finamente rebanada", "sal y pimienta negra recién molida", "1 tomate mediano, en rodajas", "2 filetes de pescado, aproximadamente 175 g / 6 oz cada uno, como bacalao, lubina o trucha", "aceite de oliva, llovizna", "exprimir jugo de limón", "1 cucharada de eneldo picado (opcional)", "1 cucharadita de alcaparras (opcional)", "2-3 cucharadas de vino blanco (opcional)"], "method": ["Precalentar el horno a 200C / 180C Ventilador / Gas 6. Cortar dos cuadrados de papel para hornear de aproximadamente 40cm / 16 pulgadas cuadradas y dos cuadrados de papel de aluminio del mismo tamaño. Coloque un cuadrado de papel para hornear encima de cada trozo de papel de aluminio.", "Calentar el aceite en una sartén y freír el hinojo y la cebolla con un poco de sal y pimienta durante 2-3 minutos, hasta que se ablanden. Divida el hinojo y las cebollas entre los dos cuadrados de papel para hornear, y cubra los tomates en rodajas, luego coloque un filete de pescado en la parte superior de cada montón. Rocíe un poco de aceite de oliva, un chorrito de jugo de limón y sazone con sal y pimienta negra recién molida. Espolvorea sobre el eneldo picado y algunas alcaparras, si se usa.", "Doble la lámina y el papel sobre el pescado y pliegue doblemente cada borde para hacer un paquete sellado, dejando un espacio en la parte superior para verter unas cucharadas de vino blanco (si se usa). Vierta el vino, luego selle completamente el paquete, pero no demasiado apretado, ya que necesita expandirse en el horno mientras se cocina.", "Coloque las parcelas en una bandeja para hornear y hornee por 12-14 minutos, o hasta que el pescado esté completamente opaco y cocido. Sirva los paquetes en cada plato para que puedan abrirse en la mesa."], "url": "www_bbc_co_uk_food_recipes_how_to_make_trout_en_49680", "title": "Pescado horneado en una bolsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_trout_en_49680_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 hojas de col rizada, finamente picadas", "1 cebolla, finamente picada", "1 pimiento verde, finamente picado", "1 pimiento rojo, finamente picado", "1 chili de ojo de pájaro pequeño, finamente picado", "1 calabacín, finamente picado", "1 diente de ajo, finamente picado", "150ml / 5fl oz de puré de tomate", "1 cucharada de aceite de oliva", "botón de mantequilla", "8 huevos de gallinas camperas", "sal y pimienta negra recién molida", "puñado de hojas frescas de cilantro", "2 tortillas de maíz o harina blandas, calentadas en el horno", "salsa de chile picante"], "method": ["Para hacer la salsa, coloque la col rizada, la cebolla, los pimientos, el chile, el calabacín, el ajo y la passata en un tazón. Sazonar con sal y pimienta y mezclar bien.", "Caliente el aceite en una sartén mediana con tapa a fuego medio y agregue un cuarto de la salsa. Revuelva para calentar, luego haga un hoyo en el medio de la salsa. Coloque la mantequilla en el área despejada en el medio de la sartén, luego rompa 2 huevos en este espacio.", "Coloque la tapa en la sartén y cocine durante 3-4 minutos. El plato está listo cuando los huevos se cocinan en la salsa y los blancos son firmes. Deslice los huevos y la salsa en un plato grande y manténgalos calientes mientras repite este proceso tres veces más.", "Para servir, espolvoree cada plato con hojas de cilantro y sirva las tortillas calientes y la salsa de chile al lado."], "url": "www_bbc_co_uk_food_recipes_huevosrancherosranch_84543", "title": "Spicy Mexican eggs (huevos rancheros)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/huevosrancherosranch_84543_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-2 zanahorias bendy, peladas, si quieres", "1 cebolla, pelada", "1-2 papas pequeñas, peladas", "1-2 tomates blandos", "un poco de aceite o mantequilla, para freír", "agua o caldo hecho de un cubo", "1 bolsa de ensalada (cansada), lavada si es necesario", "sal y pimienta", "polvo de curry, al gusto (opcional)", "hummus sobrante, a gusto (opcional)", "3-4 rebanadas de pan ligeramente rancio", "aceite, para freír poco"], "method": ["Corta bastante la zanahoria, la cebolla y la papa. Cortar los tomates por la mitad y frotar el lado cortado en un rallador de queso grueso para obtener la pulpa, y dejar la piel atrás.", "Caliente un poco de aceite o mantequilla en una cacerola mediana a fuego medio. Freír suavemente hasta que la cebolla y la zanahoria comiencen a ablandarse (aproximadamente 5 minutos). Agregue los tomates y luego las piezas de patata.", "Solo cubra con agua corriente o caldo. Deje que hierva a fuego lento y siga hirviendo a fuego lento hasta que las papas estén tiernas (aproximadamente 10 minutos).", "A continuación, agregue la bolsa de ensalada y cocine por otros 2-3 minutos, hasta que se marchite. Sazonar con un poco de sal y pimienta. Agregue una buena pizca de curry en polvo si lo desea.", "Mezcle la sopa, ya sea en la cacerola con una batidora o transfiérala a una licuadora. Licúe hasta que quede bastante suave (algo de textura está bien) - luego regrese a la sartén.", "Revuelva el hummus (si lo usa) suavemente en la sopa. Pruebe y agregue más sal y pimienta si es necesario.", "Para servir, freír el pan ligeramente y servir con la sopa. ¡Disfrutar!"], "url": "www_bbc_co_uk_food_recipes_hughs_wastenot_soup_75817", "title": "La sopa de wastenot de Hugh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 410 g / 14 oz de garbanzos de lata, enjuagados y escurridos", "4 cucharadas de agua o de caldo de verduras", "2 dientes grandes de ajo", "3 cucharadas de tahini (pasta de sésamo)", "3 cucharadas de jugo de limón", "sal al gusto", "1 cucharada de aceite de oliva", "perejil fresco picado", "aceite de oliva", "piñones, fritos", "pimenton"], "method": ["Caliente los garbanzos y las cuatro cucharadas de agua o caldo de verduras en una cacerola.", "Cuando se haya calentado, coloque los garbanzos y dos cucharadas de caldo o agua en un procesador de alimentos. Mezcle hasta que se combine aproximadamente. Agregue el ajo, el tahini y el jugo de limón y un par de grandes pellizcos de sal y mezcle de nuevo.", "Agregue el aceite de oliva y mezcle nuevamente hasta que el hummus tenga la textura deseada.", "Servir en un plato plano cubierto con un chorrito de aceite de oliva, un poco de perejil, piñones fritos y una pizca de pimentón dulce."], "url": "www_bbc_co_uk_food_recipes_hummus_80249", "title": "hummus", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3-4 cucharadas de aceite de girasol", "1 cebolla, más o menos picada", "2 dientes de ajo, en rodajas finas", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "400 g de garbanzos de lata, escurridos y enjuagados", "Hummus de 100g / 3½ oz", "Harina normal de 50g / 2oz", "½ cucharadita de sal", "pimienta negra recién molida", "50 g / 2 oz de piñones o anacardos", "8 panes pitta, calentados", "Ensalada verde mixta", "8 cucharadas de yogurt natural (opcional)", "8 cucharaditas de salsa de chile"], "method": ["Caliente 1 cucharada de aceite en una sartén antiadherente a fuego medio. Agregue la cebolla y el ajo y fríe suavemente durante 4-5 minutos, o hasta que estén blandos, revolviendo regularmente. Agregue el comino y el cilantro y fría por 1-2 minutos, o hasta que esté fragante. Retirar del fuego y reservar para enfriar durante 5 minutos.", "Coloque en un procesador de alimentos, agregue la mitad de los garbanzos y todo el hummus y la harina. Condimentar con sal y pimienta. Mezcle hasta obtener una pasta áspera.", "Agregue los garbanzos restantes y los piñones. Pulse durante unos segundos hasta que los garbanzos y los piñones se hayan descompuesto pero conserven cierta textura. Sazone al gusto.", "Divida la mezcla de garbanzos en 8 porciones. Haz rodar cada una en una bola, aplasta entre tus palmas en forma de hamburguesa de aproximadamente 1.5cm / ½ pulgada de grosor.", "Caliente el aceite restante en una sartén grande y antiadherente. Agregue las hamburguesas en lotes y fría por 3-4 minutos en cada lado, o hasta que estén doradas y crujientes en ambos lados y caliente.", "Sirva las hamburguesas en panes pitta rellenos con hojas de ensalada, con una cucharada de yogurt y salsa de chile al lado."], "url": "www_bbc_co_uk_food_recipes_hummus_chickpea_burgers_94137", "title": "Hamburguesas de garbanzos Hummus", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hummus_chickpea_burgers_94137_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Tocino de 40 g / 1½ oz", "1 cebolla grande, finamente rebanada", "2-3 cucharadas de pimentón", "Filete de cerdo de 1,8 kg / 4 lb, cortado en cubitos", "1 cucharadita de puré de tomate", "1 pimiento verde, en rodajas finas", "3 tomates medianos, en rodajas", "sal y pimienta negra recién molida", "1 cucharada de harina de maíz"], "method": ["Caliente la manteca en una sartén con tapa, agregue la cebolla y fría por cinco minutos, o hasta que se ablande. Retire la sartén del fuego y agregue el pimentón, agregando más o menos al gusto. Agregue el cerdo y un chorrito de agua. Cocine a fuego lento durante unos 5 minutos.", "Agregue suficiente agua hervida para cubrir la carne, vuelva a hervir y agregue el puré de tomate, el pimiento verde y los tomates. Sazonar con sal y pimienta negra recién molida. Cubra con una tapa y cocine a fuego lento durante 1 hora o hasta que el cerdo esté tierno.", "Para espesar la salsa, mezcle la harina de maíz y dos cucharadas de agua fría para formar una pasta, luego mezcle en el guiso. Llevar a ebullición de nuevo para espesar. Compruebe el condimento y sazone con sal y pimienta negra recién molida al gusto.", "Sirva el guiso con puré de papa cremosa o macarrones. El plato también va bien con pepino finamente cortado en rodajas que puede ser ligeramente encurtido con un chorrito de vinagre de vino blanco y una pizca de azúcar en polvo."], "url": "www_bbc_co_uk_food_recipes_hungarian_pork_stew_63624", "title": "Guiso de cerdo húngaro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de arroz basmati", "3 cardamomos verdes", "2 hojas de laurel", "4 dientes", "Maza de 2 cuchillas", "1 cucharada de comino", "3 cucharadas de sal", "1 cucharada de hojuelas de chile", "100g / 3½oz de puré de tamarindo", "½ cucharadita de sal", "1 calabaza grande, removida, semillas y carne raspadas", "2 cebollas medianas, cortadas en rodajas y fritas hasta que estén doradas", "2 cucharadas de jengibre y pasta de ajo", "1 cucharada de chile rojo en polvo", "1 cucharadita de cúrcuma", "1 cucharadita de sal masala", "1/8 nuez moscada rallada", "6 chiles verdes, hendidura longitudinal", "½ manojo de cilantro fresco, picado", "1 limón, solo jugo", "2 cucharadas de aceite vegetal", "150ml / 5fl oz de yogurt natural", "75ml / 2½fl oz de crema individual", "1 cucharadita de sal", "1 cucharadita de azúcar", "½ nabo, cortado en cubos de 1cm / ½ en", "1 zanahoria, cortada en cubos de 1cm / ½ en cubitos", "½ nabo, cortado en cubos de 1cm / ½ en", "¼ de apio nabo, cortado en cubos de 1cm / ½ en", "½ batata con carne de naranja, cortada en cubos de 1cm / ½ en cubitos", "2 alcachofas de Jerusalén, cortadas en cubos de 1cm / ½ en cubitos", "10 judías finas, picadas", "Setas Portabello de 200g / 7oz, cortadas en cubos de 1cm / ½ en", "½ g de azafrán", "50ml / 2fl oz de leche caliente", "50g / 1¾oz ghee", "2 cucharadas de agua de rosas o kewra (esencia de pino de tornillo)", "1 menta pequeña, picada", "un poco de masa hecha de harina y agua, opcional, para sellar la tapa de calabaza", "50 g / 1¾oz de pasas, para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Lave el arroz y remoje en agua fría durante 20 minutos.", "Para la calabaza, mezcle el tamarindo, el chile y la sal y frótelo en el interior de la calabaza ahuecada. Hornee en el horno (sin la tapa de calabaza) durante 30-50 minutos. Cuando esté cocinado, retírelo del horno y déjelo a un lado.", "Mezcle todos los ingredientes para el adobo.", "Para las verduras, coloque todas las verduras en una cazuela de base pesada y agregue el adobo. Dejar de lado por 15 minutos.", "Para el arroz, hierva 3 litros / 5¼ litros de agua y agregue las especias enteras y la sal.", "Cuando el agua esté hirviendo, agregue el arroz remojado y hervir durante unos 6-8 minutos hasta que dos tercios estén cocidos y luego escurra con un colador.", "Mientras tanto, traiga las verduras a fuego lento a fuego lento.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para finalizar, remoje el azafrán en la leche tibia durante 3-5 minutos y luego mezcle el ghee y el agua de rosas (o agua de kewra) y reserve.", "Llene la parte inferior de la calabaza con capas de verduras y arroz, espolvoree un poco de menta picada y la mezcla de azafrán empapada sobre el arroz sobre la marcha.", "Ponte la tapa de calabaza. Es posible que desee sellar la tapa con un poco de masa para crear un efecto de cocción a presión.", "Hornee en el horno durante 20-25 minutos.", "Para servir, quite la tapa de la calabaza y adorne el arroz con pasas."], "url": "www_bbc_co_uk_food_recipes_hyderabadi_biryani_of_73883", "title": "Hyderabadi biryani de verduras en un caparazón de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de granos de pimienta recién molida", "Cebolletas de primavera de 400 g / 14 oz, finamente picadas", "60 g / 2¼ oz de ajo, finamente picado", "Pasta de miso blanca 250 g / 9 oz", "gran pizca de sal marina", "50ml / 2fl oz de salsa de soja", "5 cucharadas de vinagre de arroz", "5 cucharadas de aceite vegetal", "20g / ¾oz de zanahoria cortada en finas tiras de juliana", "20g / ¾oz de pepino, cortado en finas tiras de juliana", "20g / ¾oz daikon, cortado en finas tiras de juliana", "20 g / ¾oz de puerro, solo parte blanca, cortado en finas tiras de juliana", "10 g de hojas de shiso (disponibles en línea), cortadas en finas tiras de juliana", "3 cucharadas de jugo de limón recién exprimido", "Una pizca de sal marina", "2 plumas de cerdo (cada una pesa aproximadamente175-225g / 6-8oz), recortadas", "100g / 3½oz de mantequilla sin sal", "50ml / 2fl oz de aceite vegetal", "5 cucharadas de vinagre de arroz"], "method": ["Para hacer el miso, ponga todos los ingredientes en una licuadora y mezcle hasta que quede suave. Esto hará más miso de lo requerido, pero se mantendrá en la nevera durante semanas y se puede frotar en casi cualquier carne.", "Para la ensalada, mezcle todos los ingredientes, colóquelos en un colador y lávelos con agua corriente durante aproximadamente 10 minutos. Escurrir bien.", "Para el aderezo de ensalada, mezcle el jugo de limón y la sal.", "Para cocinar la pluma de cerdo, caliente una sartén antiadherente a fuego medio y agregue la mantequilla y el aceite.", "Frote el cerdo con fuerza con el frotamiento de miso y colóquelo en la sartén. Cocine durante unos 2-3 minutos por cada lado o hasta que estén cocidos. Retirar de la sartén y dejar reposar durante 1 minuto.", "Retire la sartén del fuego y elimine el glaseado con el vinagre de arroz. Agregue una cucharada de miso fresco para mezclar y preparar una salsa.", "Vierta ligeramente la ensalada justo antes de servir.", "Cortar el cerdo y colocar en un plato con una cucharada de salsa y la ensalada encima."], "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_with_01362", "title": "Pluma de cerdo ibérico con cebolleta y pimienta negra miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]