[{"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite", "160 g / 5¾oz de cebollas en rodajas", "Setas medianas de 550 g / 1 libra y 4 onzas, en rodajas", "½ cucharadita de puré de ajo", "1 cucharadita de pimentón molido", "un buen polvo de chile pizca", "50ml / 2fl oz de vino blanco", "30g / 1oz de puré de tomate", "1 cucharadita de gránulos de caldo de verduras, disueltos en 100 ml / 3½ fl oz de agua", "100 ml / 3½ fl oz crema", "½ cucharadita de perejil picado", "arroz hervido, para servir"], "method": ["Derretir la mantequilla y el aceite en una sartén grande. Agregue las cebollas, champiñones, puré de ajo, especias y vino y cocine durante 10 minutos.", "Agregue el puré de tomate, caldo y crema. Llevar a ebullición y luego reducir el fuego a fuego lento. Agrega el perejil", "Si la salsa es demasiado fina, cocine a fuego lento el stroganoff hasta que el volumen de líquido se haya reducido a la consistencia deseada.", "Sirve con arroz hervido."], "url": "www_bbc_co_uk_food_recipes_mushroom_stroganoff_80260", "title": "Mushroom stroganoff", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_stroganoff_80260_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, aplastados", "Setas de 500 g / 1 libra y 2 onzas (como una taza blanca cerrada), limpiadas y en rodajas", "½ cucharadita de mostaza inglesa", "1 cucharadita de pimentón", "250ml / 9fl oz de caldo de verduras, hecho de cubo común", "200g / 7oz de arroz", "200ml / 7fl oz de crema agria", "1 limón, cortado en seis cuñas", "sal y pimienta negra"], "method": ["Caliente una sartén o una sartén ancha a fuego medio y agregue el aceite. Una vez caliente, agregue la cebolla junto con una pizca de sal y cocine la cebolla suavemente durante 5-7 minutos o hasta que esté suave.", "Agregue el ajo a la sartén y continúe cocinando durante 2 minutos, luego agregue los champiñones rebanados. Continúe cocinando suavemente durante 5-6 minutos, o hasta que los champiñones estén tiernos y dorados.", "Agregue la mostaza y el pimentón y mezcle bien para que todo esté cubierto. Agregue el caldo, revolviendo mientras lo vierte. Cocine a fuego lento durante 5 minutos mientras cocina el arroz.", "Cocine el arroz de acuerdo con las instrucciones del paquete en una olla aparte hasta que esté tierno.", "Una vez que el arroz esté cocido, retire los champiñones del fuego, agregue la crema agria junto con el jugo de dos rodajas de limón y mezcle todo. Pruebe y agregue sal y pimienta según sea necesario. Sirva el stroganoff con el arroz y las rodajas restantes de limón en el lateral."], "url": "www_bbc_co_uk_food_recipes_mushroom_stroganoff_with_83256", "title": "Mushroom stroganoff", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_stroganoff_with_83256_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de champiñones castaños, reducido a la mitad", "1 cebolla, finamente picada", "2 dientes de ajo, aplastados", "1 limón sin cebar, ralladura fina solamente", "Mezcla de 150 g / 5½ oz de arroz basmati marrón y arroz salvaje, enjuagado", "375ml / 13fl oz de caldo de verduras calientes", "1 granada, solo semillas", "5 cebolletas, finamente picadas", "100g / 3½oz de berros, más o menos picados", "2 cucharadas de aceite de oliva virgen extra", "15g / ½ oz de cilantro fresco, aproximadamente picado", "2 cucharadas de jugo de limón", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque los champiñones, la cebolla, el ajo, la ralladura de limón, el arroz y el caldo de verduras en una cazuela o en una lata pequeña y profunda para asar. Cubra bien con papel de cocina o una tapa y cocine durante 1 hora.", "Mientras tanto, para preparar el aderezo de limón y cilantro, mezcle todos los ingredientes en un tazón pequeño. Dejar de lado.", "Mezcle el aderezo, la mitad de las semillas de granada, la mitad de las cebolletas y el berro en el arroz. Pruebe y ajuste el aderezo, si es necesario. Adorne con las semillas de granada y las cebolletas restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mushroom_wild_rice_salad_47495", "title": "Ensalada de setas de arroz salvaje con granada y cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_wild_rice_salad_47495_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80ml / 3fl oz de aceite de oliva", "2 cebollas grandes, finamente cortadas", "6 hongos de campo grandes, pelados y cortados", "sal y pimienta recién molida", "30g / 1oz de mantequilla", "2 dientes de ajo, picados", "100ml / 3½fl oz de aceite de oliva", "Queso cheddar maduro o gruyere de 225 g / 8 oz, rallado", "1 cucharadita de mostaza integral", "1 diente de ajo, aplastado", "1 huevo de gallinas camperas, golpeado"], "method": ["Precaliente el horno a 180 ° C / 355 ° F / Gas 4 y precaliente la parrilla a su nivel más alto.", "Para las cebollas caramelizadas, caliente el aceite en una sartén a fuego muy lento. Agregue las cebollas y fría con cuidado durante 45 minutos, revolviendo regularmente, hasta que las cebollas estén caramelizadas, doradas y dulces.", "Mientras tanto, para los champiñones, coloque los champiñones en un molde para hornear y sazone con sal y pimienta negra recién molida. Espolvoree con la mantequilla y el ajo, luego vierta sobre el aceite de oliva. Transfiera al horno para hornear durante 10-12 minutos, hasta que se suavice un poco.", "Para la rarebit, coloque el queso, la mostaza, el ajo y el huevo en un tazón y mezcle bien.", "Retire los champiñones del horno. Cuchara sobre las cebollas caramelizadas y parte de la mezcla de raras, presionando esta cobertura en cada hongo.", "Transfiera los champiñones a la parrilla caliente y cocine hasta que el queso burbujee, se derrita y se ponga dorado.", "Para servir, coloque un hongo grande recubierto de queso en cada una de las seis placas."], "url": "www_bbc_co_uk_food_recipes_mushroomandcaramelis_84445", "title": "Seta y cebolla caramelizada rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "2 dientes de ajo picados", "200 g / 7 oz de champiñones, en rodajas", "200g / 7oz de couscous cocido", "1 limón, solo jugo", "50ml / 2fl oz de aceite de oliva, más extra para engrasar", "1 cucharadita de perejil fresco picado", "1 cucharadita de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Para los champiñones, derrita la mantequilla con el aceite en una sartén y cocine el ajo y los champiñones a fuego medio hasta que estén suaves.", "Para el cuscús, coloque el cuscús cocido en un tazón junto con el jugo de limón, aceite de oliva y hierbas y mezcle bien.", "Agregue los champiñones a la mezcla de cuscús y sazone al gusto con sal y pimienta negra recién molida.", "Engrase ligeramente un tazón pequeño y empaquete la mezcla de cuscús en el tazón.", "Para servir, gira el tazón de cuscús en un plato."], "url": "www_bbc_co_uk_food_recipes_mushroomandherbcousc_84770", "title": "Ensalada de cuscús con hongos y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina natural 170g / 6oz", "100 g / 3½ oz de mantequilla", "1 huevo de gallinas camperas", "2 cucharadas de agua helada", "pizca de sal", "1 cucharada de aceite de oliva", "½ cebolla, en rodajas", "1 diente de ajo, picado", "85 g / 3 oz de champiñones mixtos, en rodajas", "Camembert 100g / 3½ oz, picado", "1 cucharada de hojas frescas de tomillo", "3 cucharadas de crema doble"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agriete el huevo y agregue el agua y la sal y mezcle de nuevo hasta que la mezcla se una como masa.", "Dale la vuelta a una superficie enharinada y despliega al grosor de una moneda de una libra. Cubra una pequeña tarta de tarta con la masa y recorte el exceso. Refrigere por cinco minutos.", "Alinee la tarta con un pergamino para hornear y llénela con alubias para hornear. Transfiere al horno y hornea por diez minutos. Retire los granos para hornear y el pergamino.", "Para el relleno, caliente el aceite de oliva en una sartén, agregue la cebolla y fríela suavemente durante 3-4 minutos.", "Agregue el ajo y los champiñones y cocine por 3-4 minutos.", "Coloque la mezcla de champiñones en la caja de pastelería. Cubra con el Camembert, el tomillo y la crema.", "Transfiera al horno y hornee durante 10-12 minutos, o hasta que la masa esté dorada y el queso empiece a derretirse.", "Para servir, retire de la tarta de estaño y coloque en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_mushroomandmeltingch_86268", "title": "Seta y tarta de queso derretido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla, más extra para engrasar", "175g / 6oz de queso parmesano, o queso vegetariano similar, finamente rallado, más extra para quitar el polvo", "Aceite para freír", "pequeña perilla de mantequilla", "Botón de 175g / 6oz y / o champiñones de campo, picados", "2 cebollas rojas, finamente picadas", "Crema doble 225ml / 7½ fl oz", "3 huevos de gallinas camperas, golpeados", "100g / 3½oz de guisantes congelados", "2 cucharadas de aceite de oliva", "4 cebollas, finamente picadas", "75ml / 3fl oz de vinagre", "1 diente de ajo, aplastado", "1 cucharada de pasta de chile, de un frasco", "75g / 3oz de azúcar moreno", "sal y pimienta negra recién molida", "hojas de ensalada mixta", "vinagreta de mostaza"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase una lata de torta en forma de resorte de 20cm / 8oz con mantequilla y polvo con un poco de queso parmesano.", "Calentar el aceite y la mantequilla en una sartén y freír los champiñones y las cebollas rojas durante 3-4 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Retire del fuego y deje enfriar, luego transfiera la mitad de la mezcla de champiñones a un procesador de alimentos y mezcle hasta lograr una pasta homogénea.", "Transfiera la pasta de champiñones a un tazón grande. Agregue la mezcla de hongos restante, sin mezclar, la crema, los huevos y los guisantes y mezcle bien.", "Agregue la mitad del parmesano y revuelva para combinar.", "Coloque la mezcla en la lata preparada y espolvoree con el queso parmesano restante. Transfiera al horno para hornear por 40-50 minutos, o hasta que esté listo.", "Retire del horno y deje enfriar, luego suelte los lados de la lata y colóquelos en un plato para servir.", "Mientras tanto, para el chutney, caliente el aceite de oliva en una sartén. Agregue las cebollas y fría hasta que estén suaves.", "Agregue el vinagre, el ajo, la pasta de ají y el azúcar, revuelva bien y cocine a fuego lento durante 45 minutos, revolviendo ocasionalmente, para evitar que se queme.", "Para servir, coloque generosas rebanadas de torte en los platos con una cucharada de chutney al lado. Adorne con un puñado de hojas de ensalada rociadas con vinagreta de mostaza."], "url": "www_bbc_co_uk_food_recipes_mushroomandparmesant_85571", "title": "Pastel de champiñones y parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "1 cucharada de crema doble", "1 cucharada de cilantro fresco picado", "sal y pimienta negra recién molida", "1 cucharadita de aceite vegetal", "1 diente de ajo, triturado hasta formar una pasta", "Jengibre fresco de 5 cm / 2 pulgadas, rallado", "pizca de cayena", "1 cucharadita de pimentón", "1 cucharadita de comino molido", "pizca de sal", "175ml / 6fl oz de yogurt natural", "1 lima, solo jugo", "1 cucharada de aceite vegetal", "300g / 10½ hongos", "2 chiles rojos picados", "2 dientes de ajo, aplastados", "2.5cm / 1 en jengibre fresco, rallado y exprimido a través de la muselina, solo jugo", "pizca de cúrcuma molida", "1 cucharadita de sal masala", "1 cucharada de aceite vegetal", "½ cebolla, en rodajas", "Arroz basmati 250 g / 9 oz, lavado y empapado durante 30 minutos, luego escurrido", "2 hojas de laurel", "400ml / 14fl oz de caldo de verduras", "1 cucharada de agua de rosas", "1 limón, solo jugo", "1 cucharada de menta fresca picada"], "method": ["Para las tortillas, mezcle los huevos, la crema y el cilantro en un tazón y sazone bien con sal y pimienta negra recién molida.", "Calentar un poco del aceite en una sartén pequeña a fuego medio. Agregue un cuarto de la mezcla de tortilla y freír suavemente, hasta que comience a fraguar. Doble la tortilla y cocine hasta que quede solo, luego transfiera a un plato. Mantener caliente", "Repite el proceso para hacer otras tres tortillas. Dejar de lado.", "Para los champiñones marinados, mezcle todos los ingredientes de champiñones marinados, excepto los champiñones y el aceite vegetal, en un bol. Deja la mezcla de adobo a un lado.", "Calentar el aceite en una sartén y freír los champiñones durante 2-3 minutos, hasta que estén dorados.", "Agregue los champiñones cocidos al adobo y déjelos a un lado.", "Para la pasta de chile, coloque todos los ingredientes de la pasta de chile en un procesador de alimentos y mezcle hasta obtener una pasta áspera.", "Para el biryani, caliente el aceite en una sartén aparte. Agregue la cebolla y fría hasta que se ablande.", "Agregue la pasta de chile y cocine durante cinco minutos.", "Agregue el arroz y las hojas de laurel y fría por 3-4 minutos.", "Agregue suficiente caldo para cubrir y cocine a fuego lento durante 15-20 minutos, o hasta que todo el líquido haya sido absorbido y el arroz esté cocido.", "Extienda el arroz cocido en una bandeja limpia para enfriar, rocíe con agua de rosas y jugo de limón y espolvoree con la menta picada.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Engrase cuatro anillos de chefs de 10cm / 4in y colóquelos en una bandeja para hornear. Empaque una capa de la mezcla de arroz en cada anillo, luego cubra con una capa de champiñones marinados. Repita estas capas hasta que cada anillo esté lleno, asegurándose de que la capa superior sea de arroz.", "Cubra cada anillo con papel de aluminio y hornee en el horno durante 30 minutos.", "Para servir, coloca una tortilla en la parte superior de cada pila biryani."], "url": "www_bbc_co_uk_food_recipes_mushroombiryani_90436", "title": "Mushroom biryani con topping de tortilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural o harina de alforfón", "1 huevo de gallinas camperas", "150ml / 5fl de leche en oz", "aceite de oliva, para freír", "1 cucharada de aceite de oliva", "1 cebolla pequeña, picada", "puñado de setas, en rodajas", "2 puñados de espinaca baby", "2 cucharadas de crème fraîche (opcional)", "algunas ramitas de perejil fresco o cebollín, picado (opcional)", "hojas de ensalada, para servir", "sal y pimienta negra recién molida"], "method": ["Para los panqueques, tamice la harina con una pizca de sal en un recipiente para mezclar, luego agregue el huevo y mezcle bien. Agregue la leche y 150 ml / 5 fl oz de agua, luego bata bien hasta que esté suave y bien combinado. Reserve mientras hace el relleno.", "Para el relleno, caliente el aceite en una sartén y fría la cebolla hasta que se ablande, luego agregue los champiñones para que se cocinen. Sazonar bien con sal y pimienta, agregar la espinaca baby y cocinar durante 2 minutos hasta que se marchite, revolviendo con frecuencia. Deje de lado mientras cocina los panqueques.", "Para cocinar los panqueques, calentar un poco de aceite de oliva en una sartén grande, verter un cucharón de masa y girar hasta que apenas cubra la base de la sartén. Freír durante aproximadamente un minuto hasta que la parte inferior esté lista y empiece a dorarse. Dar la vuelta con una espátula y cocinar el otro lado.", "Mientras el panqueque todavía está en la sartén, extienda la mitad de la crema fresca sobre un lado (si está usando), esparza más de la mitad de la mezcla de champiñones y espinacas, y espolvoree con perejil y cebollín (si se usa). Doble los lados del panqueque sobre el relleno y levántelo en un plato para servir.", "Repita con la masa restante y el relleno para hacer otro panqueque (si tiene restos de rebozado, fríe otro panqueque para el postre). Sirve con hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_mushroomandspinachcr_87049", "title": "Crepes de setas y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroomandspinachcr_87049_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de champiñones mixtos", "1 cucharada de aceite de oliva", "1 diente de ajo picado", "25g / 1oz de mantequilla", "Crema doble 75ml", "100ml / 2½fl oz de caldo de verduras", "pizca de nuez moscada"], "method": ["En una sartén, caliente la mantequilla y el aceite juntos. Cocine los champiñones y el ajo por tres minutos.", "Agregue el caldo y cocine por cinco minutos.", "Termine agregando la crema y la nuez moscada y la temporada.", "Use la licuadora de mano hasta que esté espumosa.", "Sirve en una taza de cappuccino."], "url": "www_bbc_co_uk_food_recipes_mushroomcappuccino_79137", "title": "Capuchino de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "1 cucharada de aceite de oliva", "½ cebolla, pelada, rebanada", "1 diente de ajo, pelado, en rodajas", "3 setas de campo, en rodajas", "100ml / 3½fl oz de vino blanco", "75ml / 2½ fl oz crema doble", "sal y pimienta negra recién molida", "2 cucharadas de cebollines picados", "1 puñado de hojas de espinaca", "2 hojas frescas de lasaña, cocinadas de acuerdo con las instrucciones del paquete", "55g / 2oz de queso cheddar"], "method": ["Caliente la mantequilla con el aceite en una sartén a fuego medio. Freír la cebolla y el ajo durante 3-4 minutos, o hasta que se ablanden, revolviendo ocasionalmente.", "Agregue los champiñones rebanados a la sartén y cocínelos durante 2-3 minutos.", "Agregue el vino a la sartén y lleve a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento hasta que cocine a fuego alto hasta que el volumen del líquido se haya reducido a la mitad.", "Revuelva la crema en la sartén y sazone con sal y pimienta negra recién molida, al gusto. Regrese la mezcla a fuego lento.", "Revuelva las cebolletas y las hojas de espinaca en la mezcla hasta que se hayan calentado y marchitado.", "Para servir, coloque una hoja de lasaña cocida en un plato y espolvoree la mezcla de champiñones encima. Coloque la hoja restante encima de los champiñones y espolvoree sobre el queso. Coloque la lasaña debajo de una parrilla caliente hasta que el queso burbujee y se dore. (Alternativamente, use un soplete de cocina para derretir el queso)."], "url": "www_bbc_co_uk_food_recipes_mushroomcheeseandspi_92423", "title": "Champiñones, queso y espinacas abren lasaña con salsa de crema de vino blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 hongos grandes de St Georges (que pesan aproximadamente 150 g / 5 oz) Si no están disponibles, use hongos Portobello.", "20 hojas de menta fresca, muy finamente cortadas", "1 cucharadita de aceite de trufa", "1 cucharada de mostaza integral", "1 cucharadita de azúcar", "75ml / 2½fl oz de vinagre de vino blanco", "150ml / 5fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida, al gusto", "½ limón, solo jugo", "1 diente de ajo, finamente picado", "4 cucharadas de crema fresca", "pecorino, afeitado o rallado", "sal y pimienta negra recién molida"], "method": ["Retire los tallos de los champiñones y deseche. Coloque las tapas de champiñón en el congelador durante 10-15 minutos (esto hará que sea más fácil cortar en rodajas finas).", "Una vez que los champiñones estén fríos, córtelos muy finos (una mandolina es ideal para esto, pero un cuchillo afilado y una mano firme lo harán) y coloque las rebanadas en los platos.", "Espolvorea con la menta.", "Para el aderezo, coloque todos los ingredientes del aderezo en un procesador de alimentos y mezcle para combinar.", "Para servir, rocíe las rodajas de champiñones con el aderezo, luego agregue una cucharada de crème fraîche a cada plato.", "Espolvorear con queso de oveja recién rallado o raspado y sazonar bien con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_mushroomcarpaccio_88686", "title": "Carpaccio de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "3 hongos portobello, tallos eliminados", "Filete de lomo 150 g / 5½ oz, reducido a la mitad longitudinalmente", "sal y pimienta negra recién molida", "85g / 3oz queso Stinking Bishop, en rodajas", "1 cucharada de aceite de oliva", "1 pimiento rojo, picado", "1 diente de ajo, picado", "50ml / 2fl oz de agua hirviendo", "50ml / 2fl oz de vino blanco", "2 cucharadas de azúcar moreno", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la pila de champiñones, queso y carne, rocíe un poco de aceite de oliva sobre los hongos Portobello. Calentar una sartén a fuego medio y freír los champiñones durante 4-5 minutos por cada lado, hasta que se ablanden. Retirar de la sartén y reservar para mantener caliente.", "Agregue un poco más de aceite a la sartén y caliente hasta que esté muy caliente. Sazonar el bistec a ambos lados con sal y pimienta negra recién molida y freír durante 1-2 minutos en cada lado, o hasta que esté cocido a su gusto.", "Coloque una seta de Portobello en una bandeja para hornear y cubra con una de las piezas de carne y la mitad del queso. Coloque otro hongo de Portobello encima del queso, seguido por el otro trozo de carne, el resto del queso y finalmente el tercer hongo. Asegure con un pincho de madera y coloque en el horno durante 6-8 minutos, o hasta que el queso se derrita.", "Para el aderezo, caliente el aceite de oliva en una sartén pequeña a fuego medio y fría el pimiento rojo durante 3-4 minutos. Agregue el ajo y cocine por un minuto más. Agregue el agua, el vino y el azúcar, sazone con sal y pimienta negra recién molida y cocine a fuego lento durante 3-4 minutos. Agregue el perejil, luego mezcle la mezcla con una batidora de mano hasta que esté casi suave.", "Para servir, coloque la pila de champiñones en un plato de servir y vierta sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_mushroomcheeseandste_85185", "title": "Pila de champiñones, queso y carne con aderezo de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "2 cebollas rojas, peladas, cortadas a la mitad y en rodajas", "200 g / 7¼ de setas silvestres, en rodajas", "sal marina y pimienta negra recién molida", "mantequilla salada (para mantequilla de pan)", "6 finas rebanadas de pan blanco de un día con costras dejadas en", "275g / 10oz gruyère, rallado", "3 huevos", "300ml / 10½ fl oz de leche", "Crema de 300 g / 10½ oz", "50 g / 1¾oz de queso parmesano, rallado", "rúcula y ensalada de pimiento rojo asado"], "method": ["Caliente el horno a 180C / 350F / Gas 4.", "Pon dos cucharadas de aceite de cacahuete en una sartén precalentada. Agregue las cebollas y freír suavemente hasta que estén doradas. Ahora agrega los champiñones. Saltee durante unos minutos hasta que estén suaves y ligeramente coloreados. Sazonar y retirar del fuego.", "Unte con mantequilla las rebanadas de pan y corte cada una en dos triángulos. Cubra la base de un plato engrasado para horno con la mitad del pan.", "Esparce más de la mitad de la mezcla de cebolla y champiñones, seguido de la mitad del gruyère rallado. Repita con el pan restante, cebolla, champiñones y gruyère.", "Batir los huevos, la leche, la crème fraîche, el parmesano y un poco de aderezo en un tazón grande y verter sobre la parte superior.", "Coloque el plato gratinado dentro de un plato para asar con agua tibia para que se levante dos tercios de los lados (un baño maría) y hornee durante 35 minutos hasta que estén hinchados y dorados.", "Sirva inmediatamente mientras el queso y la crema están fundidos y pegajosos."], "url": "www_bbc_co_uk_food_recipes_mushroomgratin_72372", "title": "Gratén de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ puerro, finamente picado", "pizca de copos de chile", "75 g / 3 oz de champiñones mixtos, por ejemplo, ostra, shiitake y enoki, más o menos picados", "Arroz risotto 200 g / 7 oz (por ejemplo carnaroli o arborio)", "1 x 125 ml / 4½ fl oz vaso de vino blanco", "150ml / ¼ pinta de caldo de verduras calientes", "75g / 3oz de espinaca, aproximadamente picada", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "cebollín fresco, para adornar"], "method": ["Caliente el aceite de oliva en una olla grande con tapa, agregue las hojuelas de puerros y de chile y fría hasta que se ablanden. Agregue los champiñones y fría por 2-3 minutos. Agregue el arroz y cocine, revolviendo con frecuencia, durante 1-2 minutos, o hasta que el arroz se vuelva translúcido.", "Agregue el vino, suba el fuego y hierva durante 1-2 minutos. Agregue el caldo de un cucharón a la vez y revuelva continuamente hasta que todo el caldo haya sido absorbido y el arroz esté cocido.", "Agregue la espinaca y la mantequilla, retire del fuego, tape y deje a un lado durante unos minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el risotto en tazones para servir y decore con las cebolletas."], "url": "www_bbc_co_uk_food_recipes_mushroomleekandspina_85579", "title": "Risotto de setas, puerros y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "100 g / 1¾oz de champiñones mixtos", "2 huevos, golpeados", "sal y pimienta negra recién molida", "3 cucharadas de mantequilla", "100 g / 1¾ enoki hongos"], "method": ["En una sartén pequeña antiadherente, derrita la mantequilla y agregue los champiñones. Cocine por tres minutos hasta que esté suave.", "Agregue el huevo y sazone. Cocine a fuego lento durante 4-5 minutos hasta que el huevo esté cocido.", "Dale la vuelta a un plato boca abajo.", "Para hacer el relleno, derrita la mantequilla en una sartén pequeña, agregue los champiñones y cocínelos durante cuatro minutos hasta que estén suaves y dorados.", "Sirva encima de la tortilla."], "url": "www_bbc_co_uk_food_recipes_mushroomomelette_79134", "title": "Tortilla de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "Harina 110g / 4oz", "300ml / 10½ fl oz de leche", "1 cucharada de aceite de girasol (para la mezcla de panqueques)", "aceite extra de girasol (para cocinar)", "aceite de oliva", "½ cebolla, finamente rebanada", "Tocino ahumado de 60 g / 2 oz, finamente picado", "ramita de tomillo fresco", "Setas de campo a 200 g / 7 oz, a la mitad y en rodajas", "200g / 7oz Stilton", "25 g / 1oz de mantequilla sin sal", "2 yemas de huevo de gallinas camperas", "sal y pimienta negra recién molida", "2 cucharadas de crema doble"], "method": ["Para los panqueques, coloque el huevo, la yema de huevo y la harina en un bol y mezcle para formar una pasta.", "Poco a poco mezcle la leche y la cucharada de aceite de girasol para formar una mezcla suave.", "Calienta una sartén antiadherente. Agregue una pequeña cantidad de aceite de girasol, rómpalo para cubrir la base de la sartén y saque el exceso.", "Vierta un poco de la mezcla de panqueques en el centro de la sartén e incline la sartén con un movimiento circular para cubrir ligeramente la base. Cocine el panqueque hasta que se solidifique, y cambie a un color dorado claro. Dale la vuelta al panqueque con una espátula y cocina el otro lado por otro minuto o hasta que esté dorado.", "Incline sobre un plato y cúbralo con una toalla de té húmeda para evitar que el panqueque se seque mientras cocina el resto de los panqueques.", "Para el llenado de champiñones, precaliente la parrilla a su nivel más alto.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite de oliva, la cebolla, el tocino y el tomillo y fría por 3-4 minutos.", "Agregue los champiñones y cocine durante 1-2 minutos más.", "Para el glaseado de queso azul, coloque todos los ingredientes en un procesador de alimentos y mezcle para formar una pasta suave.", "Para finalizar, coloque un panqueque sobre una superficie limpia y plana. Coloque la mezcla de champiñones en el centro y cubra con una cucharada de crema. Enrolla el panqueque, como un cigarro, luego colócalo en un plato para servir y repite con el segundo panqueque.", "Vierta el glaseado Stilton sobre los panqueques y póngalo debajo de la parrilla caliente hasta que el glaseado de queso azul se derrita y se dore.", "Sirve en el plato en la mesa."], "url": "www_bbc_co_uk_food_recipes_mushroompancakemamon_83638", "title": "Mushroom pancake mamon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina 250g / 9oz '00', más extra para quitar el polvo", "3 yemas de huevo de gallinas camperas, ligeramente batidas", "¼ cucharadita de sal", "1 cucharada de aceite de oliva", "1 cucharada de agua", "1 cucharada de aceite de oliva", "100 g / 3½ oz de champiñones castaños, limpios y finamente picados", "1 cebolla, pelada, finamente picada", "1 diente de ajo, pelado, finamente picado", "1 cucharadita de hojas frescas de tomillo", "100 g / 3½ oz de pechuga de pollo deshuesada y sin piel, picada", "1 huevo de gallinas camperas", "30ml / 1½ fl oz crema doble", "pizca de nuez moscada rallada", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cebolla, pelada, finamente picada", "2 chalotas", "1 diente de ajo, finamente picado", "125ml / 4½fl oz de vino blanco", "150ml / 5fl oz de crema doble", "1 cucharadita de hojas de estragón fresco picado", "1 cucharada de mantequilla", "Espinacas", "pizca de nuez moscada rallada"], "method": ["Para la masa de pasta, incline la harina y la sal en un tazón grande y haga un pozo en el medio. Agregue un poco de las yemas de huevo batidas, todo el aceite de oliva y el agua y mezcle lentamente los ingredientes, agregando más huevo batido según sea necesario para hacer una masa suave (es posible que no necesite todo el huevo).", "Forme la masa en forma de bola y vuélvala a una superficie de trabajo enharinada. Amasar la masa durante 10-15 minutos o hasta que quede suave y elástica. Forma una bola, cúbrela con una película adhesiva y déjala descansar en la nevera durante una hora.", "Para el relleno, caliente el aceite de oliva en una sartén y fría la cebolla y el ajo a fuego medio-bajo durante 8-10 minutos, o hasta que estén suaves y dorados. Agregue los champiñones y el tomillo y fríalos por otros 2-3 minutos, o hasta que los champiñones estén tiernos. Transfiera la mezcla a un recipiente y déjela a un lado hasta que la necesite.", "Coloque tres cuartas partes de la carne de pechuga de pollo picada en un procesador de alimentos junto con el huevo y la crema y mezcle hasta que quede suave para hacer una mousse. Agregue la mousse de pollo al tazón con los champiñones y el resto del pollo picado y mezcle bien para combinar. Dejar de lado.", "Retire la masa de pasta del refrigerador y divídala en cuatro pedazos iguales. Cubra las otras tres piezas con una toalla de té limpia y húmeda y quite el cuarto trozo de harina.", "Harina la máquina de pasta. Comenzando por la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes, hasta que la masa alcance el grosor deseado (aproximadamente 1-2 mm de grosor). Repita con la masa restante hasta que tenga cuatro hojas de pasta delgada.", "Coloque una hoja de pasta en una superficie de trabajo enharinada y coloque cucharadas del relleno en la parte superior, asegurándose de que haya al menos una pulgada de espacio entre cada cucharada. Coloque una segunda hoja de pasta en la parte superior y selle los bordes, asegurándose de que no haya burbujas de aire atrapadas entre las capas. Recorta los raviolis individuales con una rueda de pasta. Coloque en una bandeja enharinada, cubra y refrigere hasta que esté listo para cocinar. Repita con las hojas restantes de pasta y el relleno hasta que todo se haya agotado.", "Para la salsa, calentar el aceite de oliva en una sartén y freír la cebolla durante 10-15 minutos, o hasta que esté suave y dorado. Sazone con sal y pimienta negra recién molida, agregue los chalotes picados, el ajo y el vino y cocine durante 3-4 minutos, o hasta que se haya evaporado algo del alcohol. Agregue la crema y agregue el estragón, luego retírelo del fuego.", "Para la espinaca, derrita la mantequilla en una sartén hasta que haga espuma, luego agregue las espinacas y fría por 1-2 minutos, o hasta que se marchiten. Sazonar con sal y una pizca de nuez moscada.", "Para cocinar la pasta, ponga una bandeja grande con agua salada justo debajo del hervor y cocine suavemente los raviolis, en tandas, durante 4-5 minutos con la tapa de la sartén, hasta que la pasta esté al dente. Desagüe.", "Para servir, espolvorea la espinaca en recipientes para servir y coloca los raviolis en la parte superior. Cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_mushroomravioliwitha_92175", "title": "Raviolis de champiñones con salsa de crema de vino blanco, espinacas y estragón", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de mantequilla, más una perilla extra", "3 chalotes, picados", "1 diente de ajo, picado", "Arroz Arborio 350g / 12oz", "175ml / 6fl oz de vino blanco", "600ml / 1 pinta 1½fl oz de caldo de verduras calientes", "150g / 5oz de champiñones, picados", "30 g / 1 oz de parmesano recién rallado, o un queso duro vegetariano similar", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una sartén a fuego medio. Agregue los chalotes y el ajo y fría hasta que estén suaves pero no coloreados.", "Agregue el arroz, mezcle bien y cocine durante 1-2 minutos, o hasta que el arroz esté ligeramente translúcido.", "Agregue el vino blanco y revuelva bien hasta que el vino se absorba casi por completo.", "Agregue un cucharón de caldo y permita que el arroz absorba este líquido, revolviendo constantemente. Agregue más cucharadas de caldo, revolviendo y permitiendo que el arroz absorba casi todo el caldo antes de agregar cada cucharón.", "Una vez que se haya agregado y absorbido todo el caldo, agregue los champiñones y mezcle bien.", "Una vez que el arroz esté cocido, pero ligeramente al dente, agregue un poco de mantequilla y el parmesano y revuelva bien.", "Sazonar, al gusto, con sal y pimienta negra recién molida, luego espolvorear en platos calientes y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mushroomrisotto_85882", "title": "Risotto clásico de hongos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de hongos silvestres mezclados (por ejemplo, boletus, chanterelles, erizo, blewits de madera)", "1 litro / 35¼fl oz de agua", "2 limones grandes, solo jugo", "sal (preferiblemente sal marina)", "6 cucharadas de aceite de oliva virgen extra", "2 dientes de ajo, finamente picados", "puñado de perejil flatleaf, finamente picado", "10 aceitunas negras o verdes grandes, en rodajas", "cuñas de limón, para servir"], "method": ["Limpie los champiñones con un paño o un cepillo (no los lave o el sabor desaparece).", "Corta bastante los hongos grandes y deja los más pequeños intactos.", "Coloque el agua, el jugo de limón y un poco de sal en una cacerola.", "Llevar a ebullición y agregar los champiñones.", "Cocine a fuego lento durante aproximadamente cuatro minutos.", "Mientras tanto, en un tazón, combine el aceite de oliva, el ajo, el perejil y las aceitunas.", "Escurrir los champiñones y agregar inmediatamente al adobo de aceite de oliva.", "Mezcle bien, verifique el condimento y deje enfriar.", "Sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_mushroomsalad_73189", "title": "Ensalada de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]