[{"isVegetarian": true, "title": "Chickpea, spinach and onion fattoush", "url": "www_bbc_co_uk_food_recipes_chickpeaspinachandon_89256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, finely chopped", "1 clove garlic, finely chopped", "½ beef tomato, de-seeded and finely chopped", "3 mini white pitta breads, torn into small pieces", "2 tbsp canned cooked chickpeas, rinsed and drained", "55g/2oz spinach leaves", "2 tbsp olive oil", "1 tbsp balsamic vinegar, plus extra to serve", "6 fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all of the ingredients in a bowl and mix thoroughly to combine. Serve on a plate with an extra drizzle of balsamic vinegar."]}, {"isVegetarian": true, "title": "Chickpea stew with tomatoes and green chilli", "url": "www_bbc_co_uk_food_recipes_chickpeastewwithtoma_73070", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpeastewwithtoma_73070_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 red onion, finely sliced", "3 garlic cloves, finely sliced", "2 teaspoons freshly grated ginger", "1 or 2 green chillies, to taste, seeded and finely chopped", "1 tsp sea salt", "2 X 400g/14oz tins of chickpeas, drained", "80ml/2¾fl oz water", "1 tsp cumin", "1 tsp turmeric, optional", "freshly ground black pepper", "500g/17½oz cherry tomatoes", "100g/3½oz baby English spinach leaves", "plain yoghurt", "pitta bread", "olive oil", "salt and freshly ground black pepper", "paprika"], "serves": "Serves 4 (or 8 as a side dish)", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large deep frying pan over a medium to high heat.", "Add the oil, onion, garlic, ginger, chillies and salt and cook for five minutes (or until the onions are soft) being careful to stir regularly.", "Add the chickpeas, 80ml/2¾fl oz water, cumin, turmeric and pepper and cook for five minutes or until the water evaporates.", "Add the tomatoes and cook for another two minutes to soften.", "Remove from the heat and check for seasoning.", "Stir through the spinach and top with yoghurt.", "To make the pitta crisps, break up pieces of pitta bread and drizzle with olive oil, salt, pepper and paprika.", "Bake in a moderate oven for 10-12 minutes or until crisp.", "Serve with the stew on a warmed plate."]}, {"isVegetarian": false, "title": "Chicory gratin", "url": "www_bbc_co_uk_food_recipes_chicory_gratin_84963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicory_gratin_84963_16x9.jpg", "ingredients": ["4 heads yellow chicory", "1 tbsp lemon juice", "1 tbsp sugar", "2 large pinches sea salt", "6 white peppercorns", "10g unsalted butter", "2 small Swiss chard stalks with leaves, stalks chopped into 1cm pieces; leaves roughly chopped", "35g/1¼oz unsalted butter", "35g/1¼oz plain flour", "450ml/16fl oz whole milk", "100g/3½oz Comté cheese, finely grated", "1 tbsp Dijon mustard", "pinch sea salt", "pinch freshly ground white pepper", "4 slices cooked ham", "50g/1¾oz Comté cheese, finely grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicory, put it in a medium saucepan and add the lemon juice, sugar, salt, peppercorns and enough water to barely cover. Place on a medium heat and cover with a circle of baking paper and a lid smaller than the diameter of the pan (this is to keep the chicory submerged). Bring to the boil, then simmer for 45–60 minutes. It is important to cook the chicory slowly to remove most of its bitterness. ", "Lift the chicory onto a wire rack to drain and cool. Once cool, gently press out any extra moisture with a tea towel.", "Preheat the oven to 190C/170C Fan/Gas 5.", "For the chard, put the butter and 100ml/3½fl oz water in a saucepan on a high heat. Cook the stalks for 20 minutes, adding more water if necessary. Once tender, lift them out and cook the leaves for 3 minutes in the same water. Strain, mix the stalks and leaves and arrange in a small gratin dish.", "Meanwhile, make the cheese sauce. In a small saucepan on a medium heat, melt the butter. Add the flour, whisk until smooth and cook to a nutty blonde colour. Take the pan off the heat, whisk in the milk and return to the heat. Cook for at least 4 minutes, stirring constantly with the whisk until the sauce thickens. ", "Add the cheese and mustard and cook for 3 minutes, stirring, until the cheese has fully melted. Remove from the heat, taste and season if required.", "To assemble the gratin, fold the ham slices in half and arrange one chicory head on each slice. Pack tightly in the gratin dish on top of the chard. Spoon over the cheese sauce and sprinkle with the remaining cheese. Bake in the top of the oven for 25 minutes until golden-brown."]}, {"isVegetarian": false, "title": "Chicory and rocket salad", "url": "www_bbc_co_uk_food_recipes_chicoryandrocketsala_84212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp Dijon mustard", "½ tsp white wine vinegar", "1 tsp caster sugar", "1 tsp chopped fresh parsley", "100ml/3½fl oz olive oil", "100g/3½oz walnuts, toasted and chopped", "75g/2¾oz rocket leaves", "75g/2 ¾oz chicory leaves", "1 tsp sesame seeds", "75g/2¾oz bacon, fried until crisp"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl whisk together the mustard, vinegar, sugar and parsley. Gradually add the olive oil, whisking all the time, until an emulsion is formed.", "Add the chopped walnuts to the bowl and mix together. Season, to taste with salt and freshly ground black pepper.", "To serve, place the rocket and chicory onto a plate, sprinkle with sesame seeds and spoon over some of the dressing, then place the crispy bacon on top."]}, {"isVegetarian": false, "title": "Chiffon pie", "url": "www_bbc_co_uk_food_recipes_chiffon_pie_63461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/10oz plain flour", "pinch salt", "100g/3½oz butter, plus extra for greasing", "2 medium free-range eggs, lightly beaten", "100g/3½oz icing sugar", "650g/1lb 7oz blueberries, reserving 30 blueberries for decoration", "130ml/4fl oz apple juice", "150g/6oz caster sugar", "1½ tsp vanilla extract", "1 tsp ground cinnamon ", "1 x 8g sachet pectin", "2½ tbsp cornflour", "650g/1lb 7oz raspberries, reserving 20 raspberries for decoration", "150g/6oz caster sugar ", "1 lemon, juice only", "1½ sachets powdered gelatine, soaked in 5 tbsp cold water", "100ml/3½fl oz double cream, whipped to soft peaks ", "850ml/1½ pints of double cream, very cold - straight from the fridge", "80g/3¼oz icing sugar", "2 tsp vanilla extract", "150g/6oz raspberries", "50g/2oz caster sugar", "1 tbsp cornflour", "150g/6oz blueberries", "50g/2oz caster sugar", "1 tbsp cornflour"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, sift the flour and salt into a mixing bowl. Rub the butter into the flour until the mixture resembles breadcrumbs. Add the lightly beaten eggs a little at a time, mixing until the dough just comes together (you may not need all the eggs).  Knead lightly until it forms a smooth ball, then wrap in cling film and place in fridge for 45 minutes.", "Pre-heat oven to 180C/350F/Gas 4. Lightly grease a 29cm/11½in pie tin.", "For the blueberry jam, place the blueberries, apple juice, sugar, vanilla and cinnamon into a saucepan and bring to the boil. Reduce the heat and simmer for four minutes.  Stir in the pectin and cornflour. Cook for one minute then remove from the heat and allow to cool slightly. ", "On a lightly floured surface roll out the pastry to a thickness of 0.5cm/¼in. Roll the pastry up over the rolling pin and transfer it to the greased tin. Gently push the pastry into the tin.", "Place a square of baking parchment into the pastry shell, fill with baking beans and bake ‘blind’ for 15 minutes. Remove the paper and the baking beans and return the pastry case to the oven for 10-12 minutes until light golden-brown.  Place the tin onto a cooling rack and set aside to cool completely.  ", "For the raspberry chiffon filling, place the raspberries, sugar and lemon juice in a small pan and bring to the boil for 3-4 minutes. Strain the raspberries through a sieve into a bowl, pressing the fruit through the sieve with the back of a wooden spoon. ", "Remove the gelatine from the soaking water, squeeze and whisk into the raspberry mixture. Allow to cool slightly, then whisk in the whipped cream. Pour the chiffon filling into a large tray to cool. Check every 15-20 minutes until it is semi-set – this should take about an hour.", "Spread the blueberry jam evenly across the base of the cold pastry case. Place in the fridge to set.", "For the chantilly cream, chill a glass mixing bowl for 10-15 minutes in the fridge (both the cream and bowl should be very cold). Using a handheld electric mixer, whip the cold cream until soft peaks form when the whisk is removed. Sift in the icing sugar, add the vanilla and beat to combine. Do not overbeat as chantilly cream should be quite soft.  Transfer the cream to a piping bag fitted with a large star nozzle and refridgerate.  ", "When raspberry chiffon filling has thickened but is still pourable, pour it into the pastry case and smooth the top with a palette knife. Place the pie in fridge for 20-30 minutes or until the chiffon has fully set.", "For the raspberry coulis, place the raspberries, sugar and 100ml/3½fl oz water into a small saucepan and gently bring to the boil. Simmer for four minutes, then press the fruit through a fine sieve into a mixing bowl. Return the fruit purée to the saucepan and stir in the cornflour. Bring the mixture to a simmer, stirring constantly, until thickened. Set aside to cool. Repeat the process for the blueberry coulis.", "When the chiffon filling has set, pipe rosettes of chantilly cream on top, creating concentric circles, starting from the outside edge and working inwards. ", "Transfer the raspberry coulis to a piping bag fitted with a small plain nozzle, and pipe a swirl of coulis onto half the rosettes. Repeat the process with the blueberry coulis on the remaining rosettes.", "Place a blueberry or raspberry onto each rosette with the matching coulis.  Chill until ready to serve."]}, {"isVegetarian": false, "title": "Childhood ice cream mousse cakes", "url": "www_bbc_co_uk_food_recipes_childhood_ice_cream_94439", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/childhood_ice_cream_94439_16x9.jpg", "ingredients": ["155g/5½oz self-raising flour", "170g/5¾oz caster sugar", "14g/½oz cocoa powder", "1 tsp baking powder", "170g/5¾oz baking margarine, plus extra for greasing ", "3 large free-range eggs", "1½ tbsp semi-skimmed milk ", "233g/8¼oz white chocolate, grated or chopped into very small pieces ", "180g/6¼oz whipping cream (at room temperature, but not warm as it won't whip)", "180g/6¼oz double cream (at room temperature, but not warm as it won't whip)", "60g/2¼oz pasteurized egg whites (1½ large free-range egg whites)", "¾ tsp American peppermint extract ", "green food colour gel", "unsalted butter, for greasing", "200g/7oz caster sugar", "5 tbsp golden syrup ", "2 tsp bicarbonate of soda", "large bunch fresh mint, leaves picked ", "gold lustre dust (optional)"], "serves": "Makes 12 individual cakes", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["First prepare the moulds for the mousses. Cut a strip of acetate long enough to just cover the inside circumference of a 7cm/2¾in food ring. Using the inside of the food ring as a guide, stick the acetate together in a loop and secure with masking tape. ", "Create twelve loops and place them on a tray lined with baking paper (the tray needs to fit in your fridge or freezer). These will form the moulds for the mousse cakes.", "Preheat the oven to 200C/180C Fan/Gas 6. Grease and line a 33x22cm/13x8½in Swiss roll tin with baking parchment.", "For the sponge, sieve the flour, sugar, cocoa powder and baking powder into a large bowl. Add the margarine and eggs and mix on high speed for 10 seconds using an electric mixer. Scrape down the sides of the bowl using a spatula and add the milk. Mix on high again for 20 seconds, or until fully combined.", "Pour the mixture into the lined Swiss roll tin and smooth the surface. Bake for 15–20 minutes on the middle shelf, until the middle of the sponge springs back when lightly pressed.", "Tip out the sponge onto a cooling rack and peel the greaseproof paper off. Set aside to cool.", "When the sponge is cool. Cut out twelve circles of sponge using a 7cm/2¾in food ring as a guide. Press each circle neat-side down into the acetate guides and press to ensure the surface is flat and level. Plug any small gaps with offcuts of sponge, if necessary.", "For the mousse, put the chocolate in a large heatproof bowl over a saucepan half filled with gently simmering water (do not allow the water to touch the bowl). Stir with a spatula until almost melted, then remove from the heat and allow to melt completely. Set aside to cool (the chocolate should be as cool as it can be without setting).", "Add the whipping cream, double cream, egg whites and peppermint extract to a large bowl. Whisk using an electric mixer until soft peaks form when the whisk is removed. Add a drop of food colouring to make the cream pale green. Whisk to combine, add a little extra colouring if required.  ", "When the chocolate has cooled as much as possible, but is still liquid, add a spoonful of the cream and quickly fold in to prevent lumps forming. Working quickly, gently fold the chocolate mixture into the cream until fully combined. Gently pour the mixture into a large disposable piping bag with a large hole cut at the tip. Pipe the mint mousse into the moulds to a depth of 3cm/1¼in. Gently shake to level the top, if necessary. Chill in the fridge until the mousse is set (about 2 hours in the fridge or 30 minutes in a freezer). ", "For the honeycomb, grease and line a 20cm/8in square loose-bottomed tin with non-stick baking paper.", "Add the caster sugar and golden syrup (use a tablespoon that has been sitting in boiling water to easily allow the syrup to slide off) to a deep saucepan over a medium heat (it’s important the saucepan is deep because the honeycomb will bubble up). Heat until the sugar is melted and the mixture has turned an amber caramel colour. Remove from the heat and quickly add the bicarbonate of soda. Beat vigorously until the bicarbonate of soda has dissolved and bubbles have started appearing. Pour the mixture into the prepared tin and leave to cool for at least 30 minutes.", "Once cool, peel away the baking paper and cut half of the honeycomb into triangular shards. Pulse the other half in a food processor to a rough crumb.  ", "To assemble, remove the acetate collars carefully. If the mousse is sticking to the collar, return to the fridge or freezer and try again in 10 minutes. Neaten the edges by smoothing with a small offset palette knife if required. ", "Cover the top of each mousse with a layer of crushed honeycomb and finish with a shard of honeycomb. Place a mint leaf on top and brush with gold lustre dust, if using."]}, {"isVegetarian": true, "title": "Chilled fresh fruit salad", "url": "www_bbc_co_uk_food_recipes_chilled_fresh_fruit_03931", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe cantaloupe melon", "2 ripe mangoes", "1 orange\t", "1 ripe papaya", "4 passion fruit", "225g/8oz raspberries", "chilled crème fraîche, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Using a sharp knife, cut the melon in half, scoop out the seeds and discard. Cut each half into four. Remove the rind by slipping the knife between the melon flesh and rind, then cut the melon into bite-sized pieces", "Peel the mango using a sharp knife or peeler.  Slice the mango cheeks off either side of the large central flat stone, then cut the mango into cubes. Cut off the mango around the stone too. ", "Using a serrated knife, cut off the top and bottom of the orange, then cut away all the peel and pith. Cut between the orange segments to remove each piece. ", "Peel the papaya with a knife or potato peeler and then cut the fruit in half. Scoop out and discard the seeds and cut the fruit into pieces. ", "Cut the passion fruit in half and scoop out the seeds.", "Put all the prepared fruit, except the raspberries, in a bowl, cover with cling film and put in the fridge, mixing from time to time. ", "Just before serving, add the fresh raspberries. Serve with chilled crème fraîche if liked."]}, {"isVegetarian": true, "title": "Chilled roast tomato soup with pesto", "url": "www_bbc_co_uk_food_recipes_chilledroasttomatoso_8879", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2½lb ripe plum tomatoes or other well flavoured toms, washed and halved", "3 tbsp olive oil", "three whole garlic cloves, unpeeled", "salt and freshly ground black pepper", "2 tsp light brown sugar", "150ml/5fl oz light chicken or vegetable stock, or water (optional)", "a generous fist full of basil leaves", "1 garlic clove", "1 tbsp of pine nuts", "2 tbsp of olive oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the tomatoes cut side up in a baking tray, add the whole garlic cloves. Season well with salt and pepper, sprinkle with the sugar and drizzle over the olive oil. Roast in a moderate oven (180C/375F/Gas 4) for about 45 minutes, until the tomatoes are lightly browned and beginning to ooze juice. Remove the tray from the oven and leave to cool for a few moments.", "Pick out the roasted garlic cloves and squeeze the soft flesh out of the browned papery husks onto a saucer. Place a sieve over a bowl and rub the tomatoes through it  to extract the juice and flesh. Rub the roasted garlic pulp through the sieve as well, along with any oily juices from the pan.", "Tomatoes vary in juiciness and flavour, so taste the mixture and adjust the seasonings. Thinning with a little stock, or even water, may help to get the flavour and consistency you want. Remember that the flavours will be muted somewhat when the soup is chilled.", "Place the bowl in the fridge and chill for at least four hours (or accelerate the chilling process by placing the bowl in a larger bowl of ice and water and stirring occasionally).", "Pound together, or chop together with a large knife, the basil, garlic and pine nuts, until you have a fine grained pulp. Stir into the olive oil. This pesto is meant to be quite runny. Leaving to stand for an hour or two will mellow the harsh edge of the raw garlic.", "Serve the soup by ladling into chilled bowls and drizzling a generous tablespoon of the pesto over each bowl."]}, {"isVegetarian": false, "title": "Chilled lobster consommé", "url": "www_bbc_co_uk_food_recipes_chilled_lobster_consomm_00047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lobster tail shells ", "dash olive oil", "50ml/2fl oz brandy", "2 carrots, finely sliced", "½ bulb fennel, finely chopped", "2 garlic cloves, chopped", "2 star anise", "1 tsp coriander seeds ", "2 shallots, finely sliced", "1 tbsp tomato purée", "1.5 litre/2½ pints chicken stock", "3 plum tomatoes", "6 free-range egg whites", "½ carrot", "½ shallot", "sprig tarragon", "cooked tails and claws lobster meat from 4 lobsters", "1 bottle lemon oil", "100g/3½ oz shelled broad beans, blanched and shelled again", "1 bunch baby carrots, blanched and cut into 1cm/½in batons", "tarragon leaves, to taste", "1 bunch baby leeks, blanched and cut into batons", "100g/3½oz samphire, blanched"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the consommé, fry the lobster shells in olive oil for five minutes, deglaze the pan with a small splash of the brandy and drain the shells in a colander.  ", "In a separate pan, fry the carrots, fennel, garlic, star anise, coriander seeds and shallots in a dash of olive oil for five minutes.  ", "Add the tomato purée and cook for three minutes.  Add the shells, chicken stock, brandy and tomatoes.  Bring to a simmer and cook for 40 minutes. ", "Remove from the heat, cool slightly and strain through a muslin cloth into a clean bowl. Leave to cool completely.", "To clarify the consommé, mix all the ingredients for the clarification in a blender and whisk it into the chilled lobster stock.  ", "Place onto the heat and bring to a simmer.  ", "Once a crust forms on the top, make a small hole with a ladle and simmer for 20 minutes.", "Remove from the heat and carefully strain through double muslin, taste and season if necessary.  Leave to chill in the fridge until ready to use.", "Cut the cooked lobster tails into segments and place in a chilled bowl.  Carefully arrange the garnish ingredients on top and then pour the chilled consommé over.  Finish with a drizzle of lemon oil."]}, {"isVegetarian": false, "title": "Chilled pea and mint soup", "url": "www_bbc_co_uk_food_recipes_chilledpeaandmintsou_72223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "6 large spring onions, washed and sliced", "2 cloves garlic, peeled and chopped", "1 rasher streaky bacon, chopped", "500ml/18fl oz vegetable stock", "675g/1lb 8oz shelled fresh or frozen peas", "1 round lettuce, washed and chopped", "Large handful of freshly chopped mint", "Salt", "Freshly ground white pepper", "4 tbsp lightly thickened double cream", "Fresh mint sprigs"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the oil in a large pan.  Add the spring onions, garlic, and bacon and gently cook for 5-7 minutes or until the spring onions are soft but not brown.", "Pour in the stock and bring to the boil.  Add the peas, bring back to the boil and reduce to simmering point.  Stir in the ", "lettuce and mint.  Continue to cook for 2-3 minutes or until the peas are tender.", "Blend the soup mixture in a liquidiser or hand blender until smooth.  Season to taste.  If using a liquidiser do not overfill your container and cool the soup mixture slightly before blending.  Pour into a large bowl and allow to cool.  Cover and chill for four hours or overnight.", "To serve, spoon the soup into chilled soup bowls.  Spoon a tablespoon of the cream into the soup and top with a sprig of mint before serving."]}, {"isVegetarian": true, "title": "Chilled soup of carrots, pink grapefruit, green olives and hazelnuts", "url": "www_bbc_co_uk_food_recipes_chilledsoupofcarrots_91727", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz carrots, peeled", "50g/2oz butter", "1 garlic clove, peeled, crushed", "750ml/1 pint 7fl oz water", "1 sprig fresh thyme", "1 sprig fresh rosemary", "salt and freshly ground black pepper", "150ml/5fl oz milk", "2 pink grapefruit, peeled and segmented, segments halved ", "1 handful green Gordal olives, stones removed, halved", "1 handful hazelnuts, crushed and toasted", "1 punnet fresh micro coriander cress", "4 tbsp hazelnut oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Slice the carrots as thinly as possible, using a mandoline.", "Heat a large pan until hot, then add the butter, sliced carrots and garlic and gently cook over a medium heat for 2-3 minutes.", "Add the water, thyme and rosemary and season with salt and freshly ground black pepper. Bring to a simmer, then cover with a lid and cook for 5-6 minutes, or until the carrots are tender.", "Remove the pan from the heat and stir in the milk. Allow to cool slightly, then transfer the mixture to a blender and blend until smooth. Place into the fridge to chill for at least 30 minutes.", "To serve, divide the soup among four serving bowls. Arrange the grapefruit segments, olives, nuts and coriander cress on top of the soup, then drizzle over the hazelnut oil."]}, {"isVegetarian": true, "title": "Chilled tomato bisque", "url": "www_bbc_co_uk_food_recipes_chilledtomatobisque_70019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white country bread, crusts removed and broken into large crumbs", "2 tsp sherry vinegar", "½ garlic clove, peeled and finely chopped", "1 tsp caster sugar", "½ red chili, seeded and finely diced", "30ml/1fl oz extra virgin olive oil", "225g/8oz plum tomatoes, peeled and seeded", "2 tsp tomato ketchup", "200ml/7fl oz tomato juice", "2 spring onions, finely sliced", "½ red pepper, roasted or grilled, peeled, seeded and diced", "¼ large cucumber, peeled, seeded and roughly diced", "2 tsp pesto", "salt and freshly ground black pepper", "frozen olive oil cubes (place olive oil in ice cube moulds and freeze)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bread in a food processor or blender.  With the machine running add the vinegar, garlic, sugar and chili, and blend until smooth. ", "Add the extra virgin olive oil until the bread will absorb no more then, a little at a time, add the tomatoes, tomato ketchup, tomato juice, spring onions, red pepper, cucumber and pesto.  Continue to blend to form a smooth emulsion. Season to taste with salt and black pepper.", "Serve with frozen olive oil cubes"]}, {"isVegetarian": true, "title": "Sweet potato vichyssoise", "url": "www_bbc_co_uk_food_recipes_chilledvichyssoise_86139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "100g/3½oz sweet potato, chopped", "1 leek, finely sliced", "200ml/7fl oz hot chicken stock (vegetarians can substitute vegetable stock)", "6 tbsp double cream", "salt and freshly ground black pepper ", "small handful fresh chives, chopped, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a saucepan and gently fry the onion until softened but not coloured.", "Add the garlic, sweet potato and leek and sauté for 3-4 minutes, until slightly softened.", "Add the stock and bring the boil. Reduce the heat, add the double cream and simmer for 2-3 minutes, or until the soup thickens slightly. Season, to taste, with salt and freshly ground black pepper.", "Remove from the heat and allow to cool completely. Place into the fridge to chill.", "To serve, pour the soup into bowls and garnish with the chives."]}, {"isVegetarian": false, "title": "Chilli-glazed sticky ribs", "url": "www_bbc_co_uk_food_recipes_chilli-glazed_sticky_71707", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli-glazed_sticky_71707_16x9.jpg", "ingredients": ["2 racks pork spare ribs", "1 tsp black peppercorns", "3 bay leaves", "small bunch flatleaf parsley", "1 onion, roughly chopped", "1 carrot, cut into chunks", "4 large baking potatoes", "1 tbsp olive oil", "1 tsp sea salt flakes", "250ml/9fl oz soured cream", "4 tbsp finely chopped curly parsley", "175g/6oz tomato ketchup", "150g/5oz chipotle chilli ketchup", "100ml/3½fl oz dark soy sauce", "175g/6oz dark muscovado sugar", "4 tbsp teriyaki sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, place the ribs in a large saucepan with the peppercorns, bay leaves, parsley, onion and carrot. Cover with water, bring to the boil, then reduce to a simmer and cook for 1½ hours.", "Meanwhile, preheat the oven to 200C/400F/Gas 6.", "For the baked potato, pierce the potato a couple of times with a fork, then rub with the olive oil and salt. ", "Bake on the top shelf of the oven for one hour, or until cooked through.", "For the sauce, put all of the ingredients into a saucepan and bring to a simmer.", "Remove the ribs from the water, dip them into the sauce and place onto a roasting tray.", "Bake in the oven for 20-30 minutes, basting with more of the sauce after 10 minutes.", "To serve, pile the ribs onto a serving plate. Split the potatoes in half and top with a dollop of soured cream and a little chopped parsley."]}, {"isVegetarian": false, "title": "Chilli-spiced salmon", "url": "www_bbc_co_uk_food_recipes_chilli-spiced_salmon_66094", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli-spiced_salmon_66094_16x9.jpg", "ingredients": ["6 garlic cloves", "large bunch fresh coriander", "1 tbsp sweet paprika", "1 tsp smoked paprika", "1 tbsp ground cumin", "1 tbsp ground coriander", "large pinch saffron strands", "5cm/2in piece ginger", "1 red chilli, trimmed, seeds removed", "2 tbsp white balsamic vinegar (or ordinary balsamic vinegar)", "1 lemon, juice only", "3 tbsp good-quality olive oil", "salt, to taste", "cayenne pepper, to taste (optional)", "4 x 150g/5oz salmon fillets", "1 tsp olive oil", "1 white onion, sliced into thin wedges", "2 red peppers, stalk removed, de-seeded, flesh cut into strips", "100ml/3½fl oz white wine", "200g/7oz cherry tomatoes, halved ", "2 tbsp fresh basil leaves, finely chopped ", "1 tsp grated lemon zest", "dash vegetable oil, for greasing", "½ lemon, cut into 4 thin slices", "cooked couscous, to serve", "black olives, sliced, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the chermoula paste, blend all of the paste ingredients, except the salt and cayenne pepper, in a food processor until smooth and well combined. Season, to taste, with salt and cayenne pepper, if using. ", "Spread the chermoula paste liberally all over the salmon fillets. Cover and set aside to marinate for as long as possible, and up to an hour if time allows. ", "Heat the oil in a large, non-stick frying pan over a medium heat. Add the onion and red peppers and fry for 3-4 minutes, or until they start to soften but are still intact.", "Add the wine and bring the mixture to the boil, then reduce the heat until the wine is simmering. Simmer for 2-3 minutes, or until most of the wine has evaporated.", "Add the tomatoes, reduce the heat slightly, and cook for 4-5 minutes, or until they start to break down. Stir in the basil and lemon zest.", "Cut four large pieces of baking parchment or aluminium foil – each needs to be large enough to wrap a fish fillet. Brush or spray each piece of parchment or foil with a little vegetable oil, then place one chermoula-coated salmon fillet into the centre of each.", "Place a slice of lemon on top of each fish fillet. Spoon one-quarter of the red pepper and tomato mixture alongside each piece of fish.", "Neatly wrap the fish parcels by bringing the opposite edges of the parchment or foil together and folding to seal on all sides. ", "Place the fish parcels on a baking tray and bake in the oven for 12-15 minutes, or until the salmon is cooked through. (To check the fish is cooked through, remove one parcel from the oven and open slightly - the salmon is cooked through when it flakes easily with a fork. Caution: Steam will escape from the parcel as you open it.)", "To serve, place the unopened parcels onto serving plates. Allow each person to open their own parcel. Serve with a large bowl of steamed couscous and a few black olives. "]}, {"isVegetarian": false, "title": "Chilli", "url": "www_bbc_co_uk_food_recipes_chilli_78774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1kg/2lb 2oz beef mince", "2 onions, finely diced", "2 cloves garlic, finely diced", "1 stick celery, finely diced", "2 chillies, finely diced", "1 bay leaf", "1 tbsp ground cumin", "1 tbsp ground coriander", "1 tbsp dried oregano", "1 tbsp paprika", "2 tsp cayenne", "1 tsp ground cinnamon", "1 tsp ground black pepper", "1 tbsp tomato purée", "400g/14oz tinned tomatoes", "250ml/9fl oz beef stock", "25g/1oz dark chocolate, finely chopped", "400g/14oz tinned red kidney beans, rinsed and drained", "small bunch coriander leaves, roughly chopped", "basmati rice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large pan until hot then add the olive oil and beef mince. Fry until browned, then remove from the pan and set aside. ", "Add the onions, garlic, celery and chillies and sweat for 5-6 minutes until golden.", "Add all the spices and fry for one minute.", "Return the beef to the pan and stir to combine.", "Add the tomato purée, tinned tomatoes and stock and bring to the boil.", "Reduce the heat and simmer for 1-1½ hours until very tender.", "Add the chocolate and kidney beans and simmer for a further five minutes until hot through.", "Check the seasoning before adding the coriander leaves and serving."]}, {"isVegetarian": false, "title": "Chilli and coriander fish parcel", "url": "www_bbc_co_uk_food_recipes_chilli_and_coriander_21270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_coriander_21270_16x9.jpg", "ingredients": ["125g/4½oz cod, coley or haddock fillet", "2 tsp lemon juice", "1 tbsp fresh coriander leaves", "1 garlic clove, roughly chopped", "1 green chilli, deseeded and chopped", "¼ tsp sugar", "2 tsp natural yoghurt", "80g/3oz mangetout, steamed, to serve"], "serves": "Serves 1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Place the fish in a non-metallic dish and sprinkle with the lemon juice. Cover and leave in the fridge to marinate for 15-20 minutes.", "Put the coriander, garlic and chilli in a food processor or blender and process until the mixture forms a paste. Add the sugar and yoghurt and briefly process to blend.", "Lay the fish on a sheet of foil. Coat the fish on both sides with the paste. Gather up the foil loosely and turn over at the top to seal. Return to the fridge for at least 1 hour.", "Place the parcel on a baking tray and bake for about 15 minutes, or until the fish is just cooked. Serve with the mangetout."]}, {"isVegetarian": false, "title": "Chilli and lemongrass glazed tuna steak with asparagus salad", "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_66169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "60ml/2fl oz rice wine vinegar", "2 lemongrass sticks, bruised", "1 red chilli, finely sliced", "2 tbsp finely sliced mint ", "2 tbsp finely sliced coriander", "400g/14oz block fresh tuna", "8 asparagus spears, trimmed ", "½ bunch baby breakfast radishes, leaves removed and reserved", "1 bunch baby turnips", "½ bunch fresh watercress", "2 tbsp fresh mint leaves, left whole", "2 tbsp fresh coriander, left whole", "2 tbsp baby coriander cress, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tuna steak, heat a griddle pan until hot.", "Heat a frying pan and add the sugar, vinegar and 60ml/2fl oz of water. Once the sugar has dissolved, add the lemongrass, chilli, mint and coriander.", "Cook for a couple of minutes until sticky and then roll the tuna in the glaze.", "Place the tuna onto a griddle pan and cook until bar marks appear and turn the tuna around until you have marks all around the tuna. Make sure it is pink in the middle.", "Once removed from the pan, brush the remaining glaze over the tuna. Allow to rest for a few minutes while you make the salad.", "For the asparagus salad, heat a saucepan of boiling water and blanch the asparagus, radishes and turnips. Drain.", "Place the vegetables in iced water to refresh.", "Place the watercress, mint and coriander leaves in a large bowl. Add the blanched vegetables, along with the radish leaves and mix it all together.", "To serve, cut the tuna into bite-size pieces and serve with the salad alongside. Garnish with baby coriander cress. Drizzle over any glaze that's left in the pan after cooking the tuna."]}, {"isVegetarian": true, "title": "Chilli and garlic-spiced kale crisps", "url": "www_bbc_co_uk_food_recipes_chilli_and_garlic_spiced_00826", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_garlic_spiced_00826_16x9.jpg", "ingredients": ["½ tsp dried chilli flakes", "1 tsp garlic granules", "¼ tsp sea salt", "250g/9oz curly kale, leaves picked from stems, washed and dried", "1 tbsp light olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½ and line two large baking trays with baking paper.", "Mix together the chilli, garlic granules and sea salt.", "Put the kale in a large bowl and massage the oil into the leaves. Toss with the seasoning. ", "Spread the leaves out in a single layer on two large baking trays. Bake for 20 minutes, turning the trays halfway through cooking.", "Lift the leaves from the baking paper using a spatula. Return the trays to the oven, turn off the heat and leave for 12–15 minutes, or until crisp."]}, {"isVegetarian": false, "title": "Chilli and lemongrass chicken", "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_73685", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_lemongrass_73685_16x9.jpg", "ingredients": ["2 lemongrass stalks, finely chopped ", "1 red chilli, deseeded and finely chopped ", "2 garlic cloves, peeled and finely chopped ", "1 tbsp Thai fish sauce ", "350g/12oz chicken thigh meat, cut into bite-sized chunks ", "1 tbsp sunflower oil ", "100ml/3½fl oz chicken stock ", "1 tbsp caster sugar ", "½ small head of broccoli, cut into small florets", "small handful fresh mint, basil and coriander leaves, to garnish (optional)", "steamed rice, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, combine the lemongrass, chilli, garlic and fish sauce. Place the chicken meat into another bowl and add half the lemongrass mix, reserving the rest. Cover and place in the fridge to marinate for at least 20 minutes.", "Heat the oil in a wok or a large non-stick frying pan over a high heat. Add the reserved lemongrass mixture and stir-fry for about one minute until fragrant. Then add the marinated chicken and stir-fry for 4-5 minutes, or until the chicken pieces have a nice colour on all sides. Add the broccoli and stir-fry for another minute.", "Pour the chicken stock into the pan and stir in the sugar. Simmer for a few minutes, or until the stock has reduced and you are left with a thick sauce. Serve with steamed rice and garnish with the herbs."]}, {"isVegetarian": false, "title": "Chilli and lemongrass pork with fried rice", "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_80877", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemongrass stalks, finely chopped", "1 red chilli, seeds removed and finely chopped", "2 garlic cloves, finely chopped", "1 tbsp Thai fish sauce ", "350g/12oz pork, cut into bite-sized chunks", "1 tbsp sunflower oil", "1 tbsp curry powder", "100ml/3½fl oz chicken stock", "1 tbsp caster sugar", "1 tbsp sunflower oil", "2 garlic cloves, finely grated", "1 red chilli, seeds removed and finely chopped", "2½cm/1in fresh root ginger, peeled and finely grated", "bunch of spring onions, thinly sliced", "2 tsp sesame oil", "2 tbsp soy sauce", "150g/5½oz frozen peas", "300g/10½oz cooked basmati rice", "2 large free-range eggs, beaten", "small handful of mint, basil and coriander leaves, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the lemongrass, chilli, garlic and fish sauce in a bowl and mix. ", "Put the pork in another bowl, add half the lemongrass mix and reserve the rest. Cover and place in the fridge to marinate for at least 20 minutes.", "Heat the oil in a wok or a large frying pan over a high heat. Add the reserved lemongrass mixture and curry powder and stir-fry for about 1 minute until fragrant.", "Add the marinated pork and stir-fry for 4–5 minutes until the pieces have a nice colour on all sides. Pour in the chicken stock and stir in the sugar. Simmer for a few minutes until the stock has reduced and you are left with a thick sauce.", "For the rice, heat the oil in a large frying pan and add the garlic, chilli and ginger. Add the spring onions, and stir through the sesame oil and soy sauce. Add the peas and mix through. Add the rice to the pan and mix with the vegetables.", "Make a well in the centre and pour in the egg. Allow to set briefly, then working quickly stir the egg and incorporate the rice form the sides until everything is combined. Cook for 2 minutes.", "Serve the pork with the rice and fresh herbs"]}, {"isVegetarian": false, "title": "Chilli beef", "url": "www_bbc_co_uk_food_recipes_chilli_beef_46473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz vegetable oil, for deep-frying", "2 free-range eggs, beaten", "5 tbsp cornflour", "1 tsp sea salt", "400g/14oz fillet steak, sliced into thin strips", "2 carrots, sliced into thin strips", "2 spring onions, finely sliced", "2.5cm/1in piece ginger, peeled, cut into matchsticks", "2 garlic cloves, sliced", "½ tsp chilli flakes", "4 tbsp caster sugar", "50ml/2fl oz rice vinegar", "50ml/2fl oz light soy sauce", "boiled rice", "chilli, sliced", "lime wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, pour the vegetable oil into a deep fat fryer or medium saucepan and heat until it reaches 180C/350F, or when a small cube of bread dropped in turns golden in 30 seconds. (NB: Hot oil can be dangerous. Do not leave unattended.)", "Whisk the eggs, cornflour and salt in a bowl to a thick batter.  ", "Coat the steak strips in the batter, shaking off any excess, and fry for two minutes in the oil, or until just crisp and turning golden-brown. Remove with a slotted spoon and set aside on kitchen paper. Coat the carrot strips in the batter, shaking off any excess, and fry for two minutes in the oil, or until just crisp and turning golden-brown. Remove with a slotted spoon and set aside on kitchen paper.", "Heat a wok with one tablespoon of the deep-frying oil. Add the spring onions, ginger, garlic and chilli and stir-fry for one minute.", "Add the sugar, vinegar and soy sauce, deep-fried beef and carrots and stir until well combined. Remove the pan from the heat.", "Serve the chilli beef with boiled rice, chilli slices and lime wedges. "]}, {"isVegetarian": false, "title": "Chilli beef cornbread pies", "url": "www_bbc_co_uk_food_recipes_chilli_beef_cornbread_76029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_cornbread_76029_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "500g/1lb 2oz shin of beef, trimmed and cut into 1cm/½in cubes", "1 large onion, chopped", "2 garlic cloves, crushed", "1 red chilli, finely chopped", "1 tsp dried oregano", "½ tsp cocoa powder", "1 tbsp tomato purée", "1 x 400g/14oz tin chopped tomatoes", "200ml/7fl oz rich beef stock", "salt and black pepper", "1 x 400g/14oz tin kidney beans, drained and rinsed", "3 large roasted red peppers from a jar, deseeded and roughly chopped ", "125g/4½oz plain flour", "125g/4½oz cornmeal", "½ tsp salt", "115g/4oz unsalted butter, melted and slightly cooled", "2 free-range eggs, beaten", "250ml/8fl oz buttermilk", "1 green chilli, deseeded and very finely chopped", "½ tsp baking powder", "120g/4¼oz strong Cheddar cheese, grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the filling (which you can do ahead of time), first heat your oven to 170C/325F/Gas 3.", "Heat a tablespoon of oil in a flameproof casserole over a high heat. Add half the beef and brown it well. ", "Remove and set aside in a dish. Add the remaining meat, and a little more oil if necessary, brown it and set aside with the rest of the beef.", "Reduce the heat to medium-low and add a little more oil to the pan. Add the onion and garlic and cook for 5–8 minutes, until softened.", "Add the chilli, oregano, cocoa powder and tomato purée to the onions and stir in. Return the meat to the pan, along with any juices that have seeped from it, and cook for a few minutes. Season with salt and pepper.", "Add the tomatoes and beef stock, bring to a simmer, then cover and cook in the oven for an hour. Add the kidney beans and peppers and return to the oven for a further hour or until the meat is tender.\t", "Check the seasoning (if it’s not hot enough for you, you can spice it up with a little chilli powder) then spoon the mixture into 4–6 deep, individual pie dishes, leaving about 2cm/¾in below the rim.", "Turn the oven up to 180C/350F/Gas 4.", "To make the cornbread batter, mix the flour, cornmeal and salt in a large bowl. In a jug, combine the melted butter, eggs, buttermilk, green chilli and baking powder. Add to the dry ingredients and mix just until combined - don’t overmix.", "Top the chilli beef with the cornbread batter, then sprinkle cheese over each dish. Bake for about 30 minutes, until golden-brown. If you like, you can finish the pies under the grill for a few minutes to get a really nice golden-brown top. Serve immediately."]}, {"isVegetarian": false, "title": "Chilli beef rendang", "url": "www_bbc_co_uk_food_recipes_chilli_beef_rendang_47873", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_rendang_47873_16x9.jpg", "ingredients": ["2 large banana shallots, roughly chopped", "5cm/2in piece fresh root ginger, peeled, roughly chopped", "2 lemongrass stalks, tough outer leaves discarded, core roughly chopped", "3 lime leaves, roughly chopped", "6 garlic cloves, peeled, roughly chopped", "4 long red chillies, roughly chopped", "1kg/2lb 4oz stewing beef, cut into cubes", "1-2 small dried chillies, to taste", "1 tbsp rapeseed oil", "5 cardamom pods, lightly crushed", "3 star anise", "2 cinnamon sticks", "1 tbsp ground cumin", "1 tbsp ground coriander", "1 x 400ml tin coconut milk", "200ml/7fl oz beef stock", "1 tbsp fish sauce", "1 tbsp palm sugar", "2 tbsp tamarind paste", "2 limes, juice only", "salt and freshly ground black pepper", "boiled jasmine rice, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the shallots, ginger, lemongrass, lime leaves, garlic, red chillies and 5 tablespoons water to a paste in a food processor. Scoop the mixture out into a large bowl and add the beef, mixing well until the meat is coated in the paste. Cover and set aside to marinate for at least 2 hours, and preferably overnight in the fridge.", "Put the dried chillies into a bowl and cover with boiling water from the kettle. Set aside for 30 minutes to soften.", "Heat the oil in a casserole over a medium heat. Add the cardamom, star anise, cinnamon, ground cumin and ground coriander and stir the spices into the oil until fragrant.", "Add the marinated beef and stir well to coat it in the spices. ", "Add all of the remaining ingredients except the lime juice (and the rice) and bring the mixture to the boil. Reduce the heat until the mixture is simmering.", "Drain the dried chillies, reserving the soaking water, and chop them finely. Add the chillies and 50ml/2fl oz of the soaking water to the casserole and stir well. Cover with a lid and simmer for 2 hours, or until the beef is tender.", "Remove the lid and stir the curry, then simmer for a further 15-20 minutes, or until the sauce has thickened. Stir in the lime juice and season, to taste, with salt and freshly ground black pepper.", "Serve the beef rendang with jasmine rice."]}, {"isVegetarian": false, "title": "Chilli beef salad with coriander", "url": "www_bbc_co_uk_food_recipes_chilli_beef_salad_with_26728", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_salad_with_26728_16x9.jpg", "ingredients": ["400g/14oz beef rump steaks", "4 wholewheat tortillas, cut into 8 wedges", "75g/2¾oz baby spinach leaves, washed", "salt and freshly ground black pepper", "15g/½ oz fresh coriander leaves", "2 tbsp lime juice", "1 tbsp sunflower oil", "1 garlic clove, crushed", "1 red chilli, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a hot setting. ", "Season the beef with salt and freshly ground black pepper. Heat a large frying pan and sear the beef over high heat until it is cooked but still pink. This will take about 2 minutes each side, depending on thickness. Set aside at room temperature.", "Grill the tortillas for about 5 minutes, or until they are crispy. Set aside to cool.", "Meanwhile, make the dressing by combining all the ingredients in a small bowl.", "Thinly slice the beef and arrange it on the spinach leaves. Spoon over the dressing and serve with the warm tortilla wedges."]}, {"isVegetarian": false, "title": "Chilli beef with egg-fried rice", "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_90112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for deep-frying", "1 tbsp Sichuan peppercorns, crushed to a fine powder", "2 limes, zest only", "1 orange, zest only", "3 heaped tbsp rice flour, potato flour or cornflour", "400g/14oz beef fillet, cut into thin strips", "2 tbsp vegetable oil", "150g/5½oz caster sugar", "150ml/5fl oz Shaoxing rice wine", "25ml/1fl oz rice wine vinegar", "1½ red chillies, finely chopped", "2 tsp chilli flakes", "10cm/4in piece fresh root ginger, peeled and finely chopped", "2 lemongrass stems, outer leaves discarded, finely chopped", "4 lime leaves, crushed", "2 large eggs, lightly beaten", "2 tsp sesame oil", "2 tbsp groundnut oil", "200g/7oz basmati rice, freshly cooked according to packet instructions and cooled", "4 spring onions, thinly sliced", "4 tbsp soy sauce", "3 tbsp finely chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep-fat fryer to 190C or heat the sunflower oil for deep-frying in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leaves unattended.)", "Put the Sichuan pepper in large bowl, add the lime and orange zests and the rice flour, then toss well. ", "Coat the beef strips with the vegetable oil, then with the peppercorn mix.", "Deep-fry the beef in batches, for 2 minutes per batch, then drain on to kitchen paper.", "For the sauce, heat a frying pan or wok until hot. Add the sugar, rice wine and vinegar and bring to the boil. Add the chillies, chilli flakes, ginger, lemongrass and lime leaves, then cook for 5-8 minutes, or until thickened, sticky and glossy.", "Add the cooked beef to the sauce, remove from the heat and toss well so it is coated in sauce. ", "For the egg-fried rice, mix the eggs and sesame oil together in a bowl using a fork. Heat the groundnut oil in a wok until hot, then add the rice and stir-fry for 2-3 minutes, or until hot through. Add the eggs and stir-fry for 2-3 minutes more, or until set and the mixture is dry.", "Season with salt and pepper and stir-fry for 2 minutes more, then stir in the spring onions, soy sauce and coriander. Serve the rice in bowls with strips of beef on top."]}, {"isVegetarian": false, "title": "Chilli beef with jacket potatoes", "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_jacket_37003", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_with_jacket_37003_16x9.jpg", "ingredients": ["3 baking potatoes, washed and dried", "4 tsp rapeseed oil", "1½ tsp ground cumin", "1½ tsp ground coriander", "½ tsp ground cinnamon", "1½ tsp mild chilli powder", "300g/10½oz sirloin or rump steak, fat removed, cut into 1cm/½in-thick strips", "1 red onion, thinly sliced", "1 red pepper, seeds removed, thinly sliced", "2 garlic cloves, finely chopped", "½–1 red chilli, seeds removed, sliced ", "400g tin chopped tomatoes", "1 tbsp roughly chopped coriander leaves", "sea salt and freshly ground black pepper", "100g/3½oz sour cream", "45g/1½oz mature Cheddar. grated ", "30g/1oz jalapenos, sliced "], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Rub the potatoes with 2 teaspoons oil and season with salt and pepper. Prick them all over with a fork. Bake for 45–60 minutes, or until crisp on the outside and fluffy inside.", "Meanwhile, mix the spices together in a medium bowl. Remove 2 teaspoons of the spice mix and set aside. Add the steak to the bowl and toss to coat.", "Heat a large frying pan until very hot. Add the remaining oil and the beef and fry for 30–40 seconds on each side, until browned and just cooked, then tip onto a plate and set aside.", "Add the onion and pepper to the pan, cover with a lid and gently fry for 2–3 minutes, until just softened. Add the garlic, chilli and reserved spice mix and fry for another 2 minutes, then add the tomatoes. Bring to the boil, then reduce the heat to a simmer, cover and cook for 4–5 minutes, until tender and the sauce is slightly reduced. Add the beef and any juices and cook for another minute, until cooked and hot through. Season with salt and pepper then stir in the coriander.", "When the potatoes are tender, cut them in half lengthways and divide between the serving plates. Spoon the chilli beef over the top, then finish with a dollop of sour cream, some grated cheese and a few jalapeno slices."]}, {"isVegetarian": true, "title": "Chilli cheese toast", "url": "www_bbc_co_uk_food_recipes_chilli_cheese_toast_71091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz salted butter", "50g/2oz plain flour", "about 250ml/9fl oz beer or milk", "100g/4oz mature Cheddar, grated", "100g/4oz Caerphilly or other mature cheese, grated", "25g/1oz Shropshire blue or other blue cheese, crumbled, or more to taste", "3 free-range egg yolks", "pinch salt", "2–3 mild fresh green chillies, seeds removed, finely chopped ", "1 garlic clove, finely crushed (optional)", "1 tsp crushed black peppercorns", "1 heaped tbsp chopped fresh coriander", "2–3 tbsp English mustard", "6–8 thick slices bread", "chutney, to serve"], "serves": "Makes enough topping for 6–8 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan on a medium heat and mix in the flour with a wooden spatula, stirring continuously. Cook for two minutes, stirring all the while, to make a roux. Remove from the heat. Gradually whisk in the beer or milk, and stir briskly for a few seconds until there are no unmixed bits of roux about, and return to a medium heat. Cook, stirring often, until the sauce starts to thicken, then simmer gently for 3–4 minutes. ", "Remove the pan from the heat. Add the cheeses, egg yolks, salt, chopped chilli, garlic, pepper and chopped coriander, return to a low heat and cook gently until all the cheese has melted and the mixture starts to bubble at the edges – it will be very thick at this stage which is correct. Taste and adjust the seasoning if needed. ", "Heat the grill to maximum. Toast the bread, either under the grill on both sides or in a toaster. Dollop the rarebit mixture generously over the toast, place under the grill until bubbling and golden-brown in places. Serve hot with chutney."]}, {"isVegetarian": false, "title": "Chilli beef with sticky rice omelette", "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_sticky_49937", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_with_sticky_49937_16x9.jpg", "ingredients": ["oil, for deep frying", "400g/14oz beef fillet, cut into thin strips", "2 tbsp vegetable oil", "1 tbsp Sichuan peppercorns", "2 limes, zest only", "1 orange, zest only", "3 heaped tbsp rice or potato flour or cornflour", "150g/5½oz caster sugar", "150ml/5fl oz Shaoxing rice wine", "25ml/1fl oz rice wine vinegar", "1½ red chillies, finely chopped", "2 tsp chilli flakes", "10cm/4in piece fresh root ginger, finely chopped", "2 lemongrass stems, outer leaves removed, then finely chopped", "4 lime leaves, finely chopped", "1 tbsp vegetable oil", "4 free-range eggs", "2 tbsp soy sauce", "400g/14oz cooked cold sticky rice"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the chilli beef, heat a deep fat fryer to 190C/375F or heat the oil for deep-frying in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Toss the beef strips with the two tablespoons of vegetable oil.", "In a pestle and mortar, crush the Sichuan peppercorns to a fine powder. Place them in large bowl with the lime and orange zest and rice flour then toss well to combine. Add the beef and toss to coat each piece thoroughly.", "Drop the beef into the deep-fat fryer a few batches at a time, and cook for two minutes. Drain onto kitchen paper.", "For the sauce, heat a frying pan or wok until hot, add the sugar, rice wine and rice wine vinegar and bring to the boil.", "Add the chillies, chilli flakes, ginger, lemongrass and lime leaves then cook for 5-8 minutes until thickened, sticky and glossy looking.", "Add the cooked beef to the sauce, remove from the heat and toss well so that all the beef is coated in sticky chilli sauce.", "For the sticky rice omelette, heat a wok until hot, add the oil and swirl to coat it before very carefully wiping the wok out with kitchen towel, removing any excess oil.", "Whisk the eggs together, add the soy sauce, then pour into the hot wok, lifting the wok up and rolling the egg around the sides of it so you have one very large omelette. ", "Add the cooked rice to the centre of the omelette then carefully peel the omelette away from the sides of the wok to cover the egg.", "When the rice is hot through and the omelette set, roll out onto a board and cut into four pieces.", "To serve, pile the beef onto plates and the rice omelette in separate bowls."]}, {"isVegetarian": false, "title": "Chilli chicken", "url": "www_bbc_co_uk_food_recipes_chilli_chicken_55870", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_chicken_55870_16x9.jpg", "ingredients": ["4 tbsp vegetable oil", "8–10 whole bird’s-eye chillies", "2 tbsp finely grated fresh root ginger", "2 garlic cloves, finely chopped ", "2 onions, finely chopped ", "8 chicken thighs, boneless and skin removed, cut into chunks", "2–3 tbsp dark soy sauce ", "2–3 tbsp white vinegar", "pinch salt ", "1 spring onion, finely sliced, to garnish", "freshly steamed rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan or wok over a medium heat. Add the chillies, cover and cook for 3–4 minutes, or until blackened. Stir in the ginger, garlic and onions and cook uncovered for 10 minutes, or until softened, being careful not to burn the garlic.", "Add the chicken and cook for 8–10 minutes, or until just cooked through. Stir in the soy sauce, vinegar and a pinch of salt, if needed, and simmer for 1 minute.", "Place the chicken on a serving platter, sprinkle over the spring onions and serve alongside freshly-steamed rice. "]}, {"isVegetarian": true, "title": "Chilli chocolate truffles (Trufas de chocolate y chile pasilla)", "url": "www_bbc_co_uk_food_recipes_chilli_chocolate_53849", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_chocolate_53849_16x9.jpg", "ingredients": ["1 large pasilla chilli or 4 tsp ground pasilla", "200ml/7fl oz double cream", "pinch salt", "1 tsp cayenne pepper (optional)", "200g/7oz dark chocolate (70% cocoa solids), finely chopped", "6 tbsp cocoa powder", "120g/4¼oz plain flour", "1½ tbsp caster sugar", "1 tsp baking powder", "pinch salt", "1 free-range egg", "100ml/3½fl oz ice-cold water or milk (water yields a crisper batter coating)", "1 litre/1¾ pints corn oil, for deep frying", "whipped or clotted cream", "250g/9oz small strawberries or raspberries"], "serves": "Makes 15-18", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the truffles, if using a whole chilli, toast in a dry pan over a medium heat then blend into a powder in a spice grinder. (Skip this step if using ground pasilla)", "Heat the cream, ground pasilla, salt and cayenne, if using, in a saucepan over a medium heat. When the cream is hot but not boiling, remove from the heat and stir in the chocolate until melted. Set aside to cool and place in the fridge until firm enough to shape into balls.", "Line a baking tray with baking paper and place the cocoa powder into a small bowl. Using two teaspoons, shape the chocolate into 15–18 small ovals. Drop into the cocoa then, using your hands, work quickly to roll into balls, dusting with cocoa as you go. Place onto the baking paper and freeze for at least 3 hours, preferably overnight (see tip if only making the truffles). Once frozen, they can be kept for a week or two. Store them layered with baking parchment in a plastic box with a lid. ", "To make the batter, sift the flour, sugar, baking powder and salt into a bowl. Make a well in the centre and add the egg. Whisk the egg, gradually drawing in the flour from the sides to make a paste. Add the water or milk a little at a time until you have a smooth, thick batter. ", "Heat the oil to 175C in a large saucepan (CAUTION: hot oil can be dangerous. Do not leave unattended). In batches, shake the excess cocoa off the truffles then dip them into the batter and carefully lower them into the hot oil for a couple of minutes until golden-brown. Set each batch aside on kitchen paper to drain. Trim any ragged edges with scissors and dust with cocoa powder. ", "Serve immediately with whipped or clotted cream and fresh, red berries."]}, {"isVegetarian": false, "title": "Chilli con carne", "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_08985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil", "500g/1lb 2oz good-quality beef mince ", "2 onions, diced  ", "2 garlic cloves, crushed ", "2 carrots, diced  ", "2 celery stalks, diced ", "2 red peppers, diced ", "1 heaped tsp chilli powder  ", "1 heaped tsp ground cumin  ", "1 heaped tsp ground cinnamon  ", "salt and freshly ground black pepper", "1 x 400g/14oz can red kidney beans, drained ", "2 x 400g/14oz cans chopped tomatoes", "soured cream", "chopped fresh coriander leaves", "lime wedges", "nachos"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a large frying pan over a medium heat. Add the mince and fry until golden-brown all over.  ", "Meanwhile, heat the remaining oil in a saucepan over a medium to high heat. Add the onions, garlic, carrots, celery and peppers and fry until softened. ", "Add the chilli powder, cumin and cinnamon and season, to taste, with salt and freshly ground black pepper. Fry for a further 4-5 minutes, stirring well.", "Remove the mince from the pan using a slotted spoon and add to the vegetable mixture.", "Add the drained kidney beans and the chopped tinned tomatoes and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then half-cover the pan with a lid and simmer for about an hour, stirring every now and again to stop it from catching on the bottom of the pan.", "To serve, ladle the chilli into four serving bowls. Drizzle over the soured cream. Sprinkle with the chopped coriander. Garnish with the lime wedges and serve with nachos alongside."]}, {"isVegetarian": false, "title": "Lighter chilli con carne with cauliflower 'rice'", "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_with_35538", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_con_carne_with_35538_16x9.jpg", "ingredients": ["150g/5½oz cauliflower", "1 tsp olive oil", "salt and freshly ground black pepper", "1 tsp rapeseed oil", "½ medium onion (60g/2¼oz peeled weight), finely chopped", "1 garlic clove, crushed", "75g/2½oz 5% fat beef mince", "200g/7oz tinned chopped tomatoes", "1 level tbsp tomato purée", "pinch chilli powder ", "25g/1oz drained and rinsed tinned red kidney beans"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the ‘rice’, put the cauliflower in a food processor and pulse for 30 seconds, or until it has the texture of rice. Stir in the olive oil and season. Spread the 'rice' onto a baking tray and bake for 15 minutes.  ", "Meanwhile, to make the chilli con carne, heat the rapeseed oil in small saucepan over a medium heat. Add the onion and cook for 3 minutes. Stir in the garlic and mince and cook for 4 minutes. Mix in the tomatoes, tomato purée and chilli powder. Season and simmer for 15 minutes. Add the kidney beans and cook for 2 minutes more. ", "Serve the chilli with the cauliflower 'rice'."]}, {"isVegetarian": false, "title": "Chilli con carne", "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_with_75631", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_con_carne_with_75631_16x9.jpg", "ingredients": ["1 tbsp olive oil ", "1 onion, diced ", "2 garlic cloves, chopped ", "250g/9oz beef mince ", "½ -1 tsp chilli flakes, to taste ", "400g tin chopped tomatoes", "500ml/18fl oz stock, made from a stock cube (ideally beef, but chicken is fine) ", "½ tsp dried mixed herbs ", "2 x 400g tins red kidney beans, drained and rinsed", "200g/7oz long grain rice ", "200g/7oz natural yoghurt", "salt and pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a medium heat. Add the olive oil and, once hot, fry the onion with a pinch of salt for 5 minutes, or until soft and translucent. Once soft, add the garlic and cook for 2 minutes.", "Add the mince, along with a good pinch of salt and pepper. Mix well and cook for 5-6 minutes, or until there are no raw bits of meat. Add the chilli flakes, tomatoes, stock and dried mixed herbs. Stir to mix well and bring to a simmer.", "Pour in the drained kidney beans and simmer gently for 30 minutes, or until the chilli con carne is thickened and rich. Taste and adjust the seasoning as necessary.", "Meanwhile, cook the rice according to the packet instructions.", "Serve the chilli con carne on top of the rice with a spoonful or two of yoghurt on top of each portion. Eat while hot."]}, {"isVegetarian": false, "title": "Chilli hoisin pork and vegetable stir-fry", "url": "www_bbc_co_uk_food_recipes_chilli_hoisin_pork_and_69239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz pork belly", "1 star anise", "1 cinnamon stick", "2 bay leaves", "1 tbsp fennel seeds", "2 cloves", "500ml–1litre/18fl oz–1¾ pints boiling water", "2 tbsp vegetable oil", "80g/3oz French dwarf beans, trimmed", "2 garlic cloves, thinly chopped", "½ spring onion, roughly chopped", "½ onion, finely sliced", "50g/1¾oz sweet red peppers, thinly sliced", "50g/1¾oz Chinese leaf, thinly sliced", "½ tbsp light soy sauce", "1 tsp sesame oil", "½ tsp sugar", "1 tsp corn flour", "1 tsp chilli oil", "1 tbsp hoisin sauce", "½ tbsp light soy sauce", "1 tbsp Shaoxing rice wine", "½ tsp dark soy sauce", "100ml/3½fl oz fresh chicken stock"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the pork belly, put the meat into a saucepan with the other ingredients and simmer on a low-medium heat for 45 minutes. Drain through a sieve and allow to cool. Cover with cling film and place in the fridge overnight or for at least 1 hour.", "Blanch the beans in boiling water for 2 minutes. Refresh in cold water and set aside. ", "Slice the pork into 2–3mm thick slices and place in a small mixing bowl. Add the marinade ingredients and massage into the pork using your hands.", "To make the stir-fry sauce, mix the ingredients together in a ramekin or small bowl. ", "Heat the oil in a wok placed over a high heat. When the oil is smoking add the marinated pork and sear well on both sides for 1 minute. Remove the pork and set aside.", "Add the garlic, spring onion and onions to the hot wok and stir-fry for 30 seconds or until the onions are lightly browned. Add the red peppers, Chinese leaf and beans at 30 second intervals.", "Return the pork to the wok with the stir-fry sauce and boil for 30–60 seconds stirring well. Tip onto a large plate and serve. "]}, {"isVegetarian": false, "title": "Sticky chilli chicken wings with Thai pickled watermelon salad", "url": "www_bbc_co_uk_food_recipes_chilli_fish_caramel_85265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint buttermilk", "100g/3½oz  salt", "1kg/2lb 4oz chicken wings, jointed ", "125g/4½oz rice flour", "125g/4½oz potato flour", "125g/4½oz plain flour", "1 tsp freshly ground black pepper", "vegetable oil, for deep-frying", "1 tbsp fish sauce\t\t\t\t", "1 red bird's-eye chilli, finely chopped\t\t", "75g/2½oz palm sugar\t\t\t\t", "2 tbsp tamarind paste \t\t\t", "600g/1lb 5oz watermelon, cut into 1cm/½in cubes", "1 tbsp palm sugar", "2 tbsp fish sauce", "1 lime, juice only", "½ garlic clove, crushed", "½ Thai red chilli", "handful fresh coriander leaves", "handful fresh mint leaves", "handful roasted peanuts", "1 tsp finely chopped fresh coriander leaves", "½ tsp finely chopped fresh Thai basil leaves", "1 tsp finely chopped fresh mint leaves", "1 tsp crispy garlic", "1 tsp crispy shallots", "1 tsp pickled red chillies", "1 free-range egg, fried"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken wings, in a large bowl, whisk together the buttermilk and all but 1 tsp of the salt. Add the chicken and stir well. Cover and marinate in the fridge for 24 hours. ", "For the salad, put the watermelon in a large bowl, cover and chill in the fridge for 3 hours.", "Meanwhile, gently simmer all the sticky chilli sauce ingredients with 1 tablespoon water in a saucepan over a low heat for 2 minutes. Set aside to cool.", "For the salad dressing, put the palm sugar, fish sauce, lime juice, garlic and Thai red chilli together in a food processor and blend until smooth. Mix with the cold watermelon in a very cold bowl, then fold in the herbs and peanuts.", "Mix together the flours, black pepper and the remaining salt in a large bowl. Thoroughly coat the chicken in the seasoned flour ready for frying. ", "Heat the deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the wings in batches for 7 minutes.until cooked through, golden brown and crispy. Drain on kitchen paper and set aside to cool slightly. Coat the wings in the sticky chilli sauce.", "Mix together all the garnish ingredients. Pile the chicken wings into a serving bowl, sit the fried egg on top, and serve with the salad, garnished with the herb and spice mixture. "]}, {"isVegetarian": true, "title": "Chilli, lime and raspberry macaroons", "url": "www_bbc_co_uk_food_recipes_chilli_lime_and_92370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz ground almonds", "75g/2¾oz icing sugar", "25g/1oz free-range egg white", "green food colouring, preferably powdered", "75g/2¾oz ground almonds", "75g/2¾oz icing sugar", "25g/1oz free-range egg white", "½ very mild fresh chilli, such as anaheim or poblano", "50g/1¾oz sugar", "1 tsp red liquid food colouring", "60g/2¼oz free-range egg whites", "150g/5½oz caster sugar", "75g/2¾oz water", "350g/12oz white chocolate", "40g/1½oz double cream", "100g/3½oz lime juice (approximately five limes)", "50g/1¾oz butter", "300g/10½oz fresh raspberries", "50g/1¾oz sugar", "squeeze lemon juice", "2 x 8g sachets pectin"], "serves": "Makes 12", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the macaroons, set up two mixing bowls, each with measured ground almonds, icing sugar and egg whites. Add the green food colouring to one bowl. Set aside.", "For the Italian meringue, whisk the 60g/2¼oz egg whites in a bowl until soft peaks form when the whisk is removed from the bowl. Heat the sugar and 75g/2¾oz water in a small pan up to 118C/245F. Slowly whisk the hot syrup into the whisked egg whites.", "Divide the Italian meringue between the two mixing bowls set up for the macaroons, and fold in.", "Spoon the green macaroon mixture into a piping bag with a small plain nozzle. Spoon the white macaron mixture into a separate piping bag also with a small plain nozzle (the white macaroons will be coloured red after resting).", "Line two baking trays with baking parchment, one for each colour. Pipe the green macarons on one tray in 2cm/¾in rounds onto the parchment. Repeat with the white macarons on the other tray. Set both trays aside to rest for at least 30 minutes before baking. ", "Meanwhile, for the red macarons, chop the red chilli, add it to the sugar and red food colouring. Sprinkle the chilli mixture onto the white macarons before baking.  ", "Preheat the oven to 180C/350F/Gas 4. ", "Bake the rested macarons for 12 minutes, opening the oven door twice during the process: once after three minutes, and again after eight minutes.", "Remove from the oven, remove from the baking parchment, and transfer to the fridge to cool. ", "For the lime ganache, gently melt the chocolate and cream together in a bowl set on top of a pan of simmering water. Add the lime juice gradually to the mixture. Then gradually add the butter and incorporate fully. Remove from the heat, cover and chill in the fridge. ", "For the raspberry coulis, push the raspberries through a sieve and collect the juice in a small pan. Add the sugar and lemon juice and bring the mixture up to the boil. Once boiling, add the pectin and whisk for 2-3 minutes. Remove from the heat, and leave to cool. ", "Transfer the ganache to a piping bag, and assemble the macaroons: green macaroons on the bottom, piped ganache in the middle, topped with raspberry ‘coulis’ sandwiched with the red macaron. "]}, {"isVegetarian": false, "title": "Chilli lobster spaghetti", "url": "www_bbc_co_uk_food_recipes_chilli_lobster_spaghetti_50196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "50g/2oz butter", "2 garlic clove, finely chopped", "2 shallots, finely chopped", "2 lemongrass stalks, finely chopped", "2 green chillies, finely chopped", "4 kaffir lime leaves, finely shredded", "200ml/7fl oz white wine", "400ml/14fl oz double cream", "2 x 750g/1lb 10oz cooked lobster, shelled and cut into chunks", "2 limes, juice only", "3 tbsp chopped fresh coriander", "300g/10oz spaghetti"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until hot. Add the olive oil and butter and then stir in the garlic, shallots, lemongrass, chillies and shredded lime leaves. Fry for 1-2 minutes.", "Pour in the white wine and cook until the volume of liquid has reduced by half.", "Add the cream and bring to a simmer. Cook until just thickened and then add the lobster. Squeeze in the lime juice and season to taste with salt and freshly ground black pepper. Finally, stir in the coriander.", "Meanwhile, cook the spaghetti according to packet instructions and then drain. Mix the spaghetti with the lobster sauce until well combined.", "To serve, pile the spaghetti onto plates and finish with another squeeze of lime juice."]}, {"isVegetarian": false, "title": "Chilli pork with pineapple rice", "url": "www_bbc_co_uk_food_recipes_chilli_pork_with_82478", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_pork_with_82478_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "2 tbsp lime juice", "2 garlic cloves, crushed", "1 red chilli, deseeded and finely chopped", "300g/10½oz pork fillet, cubed", "200g/7oz Thai fragrant rice", "6 spring onions, thinly sliced", "200g/7oz pineapple, peeled and diced", "½ red onion, cut into wedges", "1 lime, cut into wedges", "ready-made sweet chilli sauce, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Soak 8 wooden skewers in warm water. ", "Mix together the oil, lime juice, garlic, chilli with a pinch of salt and pepper in a bowl, add the pork and stir to coat. Cover and refrigerate for at least 1 hour.", "Meanwhile, cook the rice in lightly salted boiling water for 12-15 minutes, until soft. Drain and stir through the spring onions and pineapple.", "Preheat the grill to a hot setting. ", "Thread the pork on to the skewers, alternating it with onion and lime wedges, and cook under the grill for about 10 minutes, turning frequently and basting with the remaining marinade, until the pork is cooked through.", "Place the skewers and rice on a plate with the sweet chilli sauce and serve."]}, {"isVegetarian": false, "title": "Chilli salad bowls", "url": "www_bbc_co_uk_food_recipes_chilli_salad_bowls_22404", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_salad_bowls_22404_16x9.jpg", "ingredients": ["300g/10½oz lean beef mince (less than 10% fat)", "1 small onion, finely chopped", "2 garlic cloves, peeled and crushed", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp hot chilli powder", "2 tbsp tomato purée", "½ tsp caster sugar", "300ml/½ pint beef stock, made with 1 beef stock cube", "4 large flour tortillas", "1 tsp sunflower oil", "1 romaine lettuce or 3 baby gem lettuces, leaves thickly shredded", "3 ripe vine tomatoes, sliced", "15cm/6in piece cucumber, sliced", "4 spring onions, trimmed and sliced", "½ lime, juice only", "40g/1½oz mature cheddar", "4 tbsp half-fat crème fraîche", "4 tbsp fresh tomato salsa sauce", "flaked sea salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the minced beef, onion and garlic in a medium non-stick saucepan and cook over a high heat for five minutes, stirring with two wooden spoons to break up any clumps of meat. Stir in the cumin, coriander and chilli and cook for two minutes more, stirring constantly. Add the tomato purée, sugar and beef stock and bring to a simmer. Cover the pan and leave to simmer gently over a low heat for 30 minutes. Remove the lid and stir the chilli mixture occasionally.", "While the beef is cooking, prepare the tortilla bowls. Preheat the oven to 180C/350F/Gas 4. Take a sheet of foil about 1 metre/40in long and scrunch it up into a ball about 10cm/4in in diameter. Place it in the centre of a large baking sheet.", "Take a tortilla and brush the centre on one side with a little of the oil – this will help prevent it sticking to the foil. Drape the tortilla over the ball of foil, oil-side down, pinching and loosely pleating it to create a bowl shape. Bake for five minutes until the bowl shape is set and the tortilla is lightly crisped.", "Take the tortilla out of the oven and carefully remove it from the foil – it should be just cool enough to handle. Place the tortilla on an upturned tumbler and press to create a flat base on which to turn the tortilla once cold. The tortilla should still be warm enough to mould to the shape of the glass. Leave to cool while you make the next bowl in the same way. Put each upturned tortilla on a plate as soon as it is ready.", "Remove the lid from the pan of beef and turn the heat up high. Cook for a further 4–5 minutes, stirring constantly, until most of the liquid has evaporated and the beef is looking fairly dry. Take the pan off the heat.", "Toss the lettuce with the tomatoes, cucumber, spring onions and lime juice. Divide the salad between the tortilla bowls and season with black pepper, then top with the hot mince. Coarsely grate some cheddar over each serving and add some crème fraîche and salsa. Tuck in while the beef is warm."]}, {"isVegetarian": true, "title": "Chilli sauce", "url": "www_bbc_co_uk_food_recipes_chilli_sauce_09570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 1½oz ripe vine tomatoes", "½ onion, skin on", "2 garlic cloves, unpeeled", "4 pasilla chillies, seeds and stalks removed", "8 guajillo chillies, seeds and stalks removed", "150ml/5fl oz cola", "1 tbsp sunflower oil", "½ tsp dried oregano", "handful coriander stalks, finely chopped", "freshly ground black pepper", "¼ tsp ground cloves", "1 tsp cumin seeds, toasted and ground in a pestle and mortar", "salt, to taste", "1 orange, juice only", "1 tsp cider vinegar", "¼ tsp cocoa powder"], "serves": "Makes 2 bottles", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Skin the tomatoes by making a criss-cross on the bottom of each one and then plunging them into a pan of boiling water for a couple of minutes. Remove with a slotted spoon and transfer to refresh in a bowl of ice cold water. Once cool, carefully remove the skin.", "Scoop out the seeds of the tomatoes over a sieve to collect the juices, and tear the flesh into small pieces. Set aside in a bowl.", "In a very hot pan, place the onion, cut side down with the unpeeled garlic cloves and cook until charred. Turn onto the other side for a few minutes, and then remove and peel both the garlic and the onion, then chop finely. Set aside the garlic and onion separately.", "Dry fry the chilies in a hot pan for about 4-5 minutes, turning frequently so that they don’t burn – they should lighten in colour when they are done. ", "Add the chillies to a bowl with the cola and a splash of water and leave to plump for about 15 minutes.", "In a saucepan, gently fry the chopped onion in the sunflower oil with the oregano, coriander stalks, black pepper and a splash of water until the onions are soft, but not coloured. ", "Add the garlic, tomatoes and their juice, cloves and ground cumin and simmer gently for about 10 minutes.  Season with salt.", "Add the orange juice, the vinegar and the rehydrated chilies to the pan and, using a stick-blender, blend until smooth.", "Pass through a sieve into a clean saucepan and bring to the boil. Cook gently for about 30 minutes, then add the cocoa powder and cook for a further 10-15 minutes, or until the mixture is the consistency of a pouring sauce.  ", "Add more cola, orange juice, seasoning and spices to taste if necessary.", "Pour into sterilised bottles and seal."]}, {"isVegetarian": false, "title": "Chilli tomato pizza and lobster calzone", "url": "www_bbc_co_uk_food_recipes_chilli_tomato_pizza_and_84481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb12oz Italian ‘00’ white flour", "200g/7oz semolina flour, plus extra for dusting ", "1 tsp salt", "1 tbsp caster sugar", "14g/½oz dried yeast ", "2 x 400g/14oz tins San Marzano tomatoes", "2 large balls mozzarella, roughly torn", "50g/1¾oz pecorino cheese, finely grated", "3 tbsp vegetable oil", "1 large handful basil leaves", "2 chillies, finely sliced", "1 small cooked lobster, meat removed and cut into chunks", "1 tbsp mango chilli sauce", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the pizza dough, place the flours, salt, sugar and yeast into a large bowl and stir.", "Make a well in the centre of the flour and gradually pour in 650ml/22fl oz water, gradually mixing in the flour to form a soft dough.", "Tip out and knead the dough on a work surface until smooth and elastic.", "Divide into four and roll into balls, then place in a tray, cover and leave to rise for 24 hours.", "When you’re ready to cook the pizzas, preheat the oven to 240C/475F/Gas 9 (or as high as it will go).", "Place a heavy baking tray or pizza stone in the oven to heat.", "Roll out the dough pieces until about 5mm thick then place onto an upturned, floured tray.", "Place the tinned tomatoes into a food processor and blend to a purée.", "Spoon the tomato purée thinly over two of the pizzas, just to the edges.", "Scatter over half the mozzarella and pecorino. Scatter over the chilli, then drizzle over half the peanut oil.", "Finish with a few basil leaves and season with salt and black pepper.", "Transfer to the oven, pushing the pizza onto the heated pizza tray or stone and cook for 5-8 minutes, or until cooked through and bubbling.", "For the calzone, cover half of each of the other two pizza bases with the tomato sauce, then top with the pieces of lobster and the rest of the mozzarella and pecorino. Drizzle over the mango chilli sauce and the rest of the peanut oil along with a scattering of basil and season with salt and black pepper.", "Fold the other half of the pizza over the top then crimp the edges and place on the heated pizza stone or tray.", "Cook for 5-10 minutes until golden-brown and crisp. Serve immediately."]}, {"isVegetarian": true, "title": "Chilli and basil pasta with chargrilled fennel", "url": "www_bbc_co_uk_food_recipes_chilliandbasilpastaw_85478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz fresh spaghetti", "1 fennel bulb, sliced into 1¼cm/½in slices", "2 tbsp olive oil", "salt and freshly ground black pepper", "½ onion, finely chopped", "1 garlic clove, crushed", "½ tsp harissa", "6 tbsp red wine", "handful basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the spaghetti according to packet instructions. Drain and keep warm.", "Drizzle the fennel with one tablespoon of the olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan and fry the fennel for 4-6 minutes, or until softened.", "Heat the remaining one tablespoon of oil in a separate pan and fry the onion until soft but not coloured. Add the garlic and cook for one minute.", "Add the harissa and red wine and cook over a medium heat, until reduced to three tablespoons of liquid.", "Stir the cooked spaghetti through the sauce and add the basil leaves.", "Serve the spaghetti placed on a bed of the griddled fennel."]}, {"isVegetarian": true, "title": "Chilli and chocolate fudge pudding", "url": "www_bbc_co_uk_food_recipes_chilliandchocolatefu_89932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb dark chocolate, minimum 70 per cent cocoa solids", "200g/7oz unsalted butter, plus extra for greasing", "10 free-range eggs", "3 tbsp soured cream", "300g/10½oz caster sugar", "1 vanilla pod, split, seeds scraped out", "200g/7oz plain flour", "1 tsp ground cinnamon", "½ tsp baking powder", "2 red chillies, seeds removed, finely chopped", "250ml/9fl oz whipping cream", "60g/2oz unsalted butter", "100g/3½oz cocoa powder", "100g/3½oz caster sugar", "100g/3½oz soft dark brown sugar", "½ tsp ground cinnamon", "100g/3½oz strawberries", "whipped cream"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 3.", "Melt the chocolate and butter together in a heatproof bowl placed over a pan of barely simmering water - make sure that the water does not touch the base of the bowl.", "Place a separate heatproof bowl over a second pan of barely simmering water - make sure the water does not touch the base of the bowl. Add the eggs, sugar, soured cream and vanilla seeds to the bowl and whisk constantly for 5-6 minutes, until the mixture is fluffy and has doubled in volume.", "Add the melted chocolate and butter mixture to the soured cream mixture and stir to combine.", "Sift the flour, cinnamon and baking powder together into a separate bowl, then fold the mixture into the melted chocolate mixture.", "Add the chopped chillies and stir gently.", "Line a large ovenproof dish or deep baking tray with greased kitchen foil and pour the mixture into the dish.", "Bake in the oven for 50-60 minutes, or until cooked through.", "For the sauce, place the cream, butter, cocoa powder, caster sugar, brown sugar and cinnamon into a pan over a low heat and stir for 4-5 minutes, until the ingredients are melted and combined as thick sauce.", "To serve, cut out slices of the fudge pudding and place onto plates. Drizzle with the sauce and serve with strawberries and whipped cream."]}, {"isVegetarian": false, "title": "Chilli and black pepper chicken with polenta fritters and griddled squash", "url": "www_bbc_co_uk_food_recipes_chilliandblackpepper_82106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fresh breadcrumbs", "2 tsp salt", "2 tsp dried chilli flakes", "1 chicken breast, flattened out with a meat malletand cut into 2 equal  pieces", "1 tbsp plain flour", "1 free-range egg, beaten", "1 tbsp butter, melted", "250g/9oz instant polenta", "300ml/½pint boiling water, with a pinch of salt added", "1 tbsp butter", "1 tbsp olive oil, plus extra for greasing", "½ butternut squash, par-boiled for 5 minutes and drained, cut into pieces", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli and black pepper chicken, mix the breadcrumbs, salt and chilli flakes in a bowl. ", "Dip the chicken in plain flour, shake off excess, then dip in beaten egg, then dip in breadcrumb mix. Bash gently with a knife to make the breadcrumbs stick. ", "Heat the butter in a frying pan and then fry the chicken for five minutes on each side or until golden brown and cooked through. Keep warm.", "To make the polenta fritters, put the polenta into a pan with the boiling salted water, and cook, stirring frequently, over a low heat until all the water has been absorbed.", "Oil a baking tray and pour the polenta into the tray. Refrigerate until set.", "Use a 6cm circular cutter to cut two circles out of the polenta. Heat the butter in a frying pan and fry for two minutes on each side.", "To make the griddled butternut squash, brush the pieces with olive oil and season well with salt and freshly ground black pepper. Heat a griddle pan until smoking hot and cook for 3 minutes on each side, until tender.", "To serve, place the polenta fritters on a large plate, put the chicken on top and serve with the griddled butternut squash on the side."]}, {"isVegetarian": false, "title": "Chilli and coriander stir-fried prawns", "url": "www_bbc_co_uk_food_recipes_chilliandcorianderst_87970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "10 cooked king prawns", "1 Scotch Bonnet chilli, finely chopped", "small bunch asparagus, blanched", "small handful fresh coriander, chopped", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a wok, add the prawns and chilli and fry for one minute. ", "Add the blanched asparagus to the wok and stir fry for 1-2 minutes. Add the coriander and lime juice and season well with salt and freshly ground black pepper. Serve immediately"]}, {"isVegetarian": false, "title": "Chilli and garlic prawns with a herb salad", "url": "www_bbc_co_uk_food_recipes_chilliandgarlicprawn_91276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large prawns, head and tail left on, body peeled, de-veined", "4 tbsp ready-made chilli and garlic sauce", "150ml/5fl oz olive oil", "2cm/1in fresh root ginger, peeled and finely chopped", "3 garlic cloves, peeled and crushed", "90ml/3fl oz olive oil", "2 tbsp balsamic vinegar", "1 tsp caster sugar", "2 bunches mixed herbs (such as chervil, parsley, dill, mint, tarragon and basil)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the prawns, coat the raw prawns with the chilli and garlic sauce in a shallow non-reactive dish. Cover and leave to marinate for up to an hour. ", "Heat the olive oil in a griddle pan until smoking. Add the prawns and cook until well coloured (about three minutes each side).", "Set the prawns aside in a warm place while you make the salad and dressing. ", "For the herb salad, combine the ginger and garlic with the olive oil in a pan and gently heat. Once warmed through, remove from the heat and leave to infuse.", "Mix the balsamic vinegar, infused olive oil and the caster sugar in a small bowl to make a smooth emulsion.", "Lightly toss all the herbs together in a separate bowl. Add the dressing, a little at a time, until the herbs are coated.", "To serve, arrange a little of the salad on each of four plates and serve with the prawns straightaway."]}, {"isVegetarian": true, "title": "Chilli apple jelly", "url": "www_bbc_co_uk_food_recipes_chilliapplejelly_7293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4½lb bramley apples", "cold water to cover", "approximately 1.5kg/3lb preserving sugar", "10-15g/2-3 tsp chilli flakes"], "serves": "1.5l/3 pints", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Roughly cut up the apples then place into a preserving pan, pips, core and all. Add enough cold water to cover. Bring to the boil, reduce the heat and allow to simmer for 30-40 minutes, or until the fruit is pulpy.", "Pour the fruit and liquid into a sterlised jelly bag and allow to drain through into a large container until it stops dripping, about 3-4 hours.", "Measure the juice and allow 450g/1lb preserving sugar and 5g/1 tsp of chilli flakes for every 500ml/17fl oz of juice. Place the juice, sugar and chilli flakes in a clean pan. Bring to the boil, stirring until the sugar has dissolved. Reduce the heat and carefully skim off any scum from the surface. Return to the boil and boil vigorously for 15-20 minutes or until setting point is reached, skimming regularly. Using a sugar thermometer, the setting point will be reached at 105C/220F.", "Remove the pan from the heat and leave to settle for a few minutes. Skim the surface once again. Pour the liquid jelly through a wide mouthed funnel into jars that have been sterilized (put in oven at 90C/200F/Gas¼). Seal each jar with a lid. This jelly will keep for 2 years, unopened."]}, {"isVegetarian": false, "title": "Chilli baked beans with crispy bacon", "url": "www_bbc_co_uk_food_recipes_chillibakedbeanswith_84608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, chopped", "½ red chilli, deseeded and finley chopped", "2 tbsp tomato ketchup", "400g/14oz can cannellini beans, drained and rinsed", "1 slice ciabatta, drizzled with olive oil", "4 slices streaky bacon"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small saucepan.  Add the onion, garlic and chilli and cook for 2-3 minutes or until the onions have softened. Add the ketchup and beans and cook for a further five minutes.", "Heat a griddle pan until hot.  Add the ciabatta and bacon and frym,turning once, until the bread is griddled on both sides and the bacon is crisp. Drain the bacon on kitchen paper.", "To serve, place the griddled ciabatta onto a clean plate, place the beans on top and sprinkle the bacon on top."]}, {"isVegetarian": false, "title": "Chilli and lemon roasted salmon with roasted plum tomatoes and chilli and fennel salad", "url": "www_bbc_co_uk_food_recipes_chilliandlemonroaste_83847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 plum tomatoes", "1½ tbsp extra virgin olive oil", "salt and freshly ground black pepper", "3 sprigs fresh thyme, picked and chopped", "4 x 175g/6oz salmon fillets, skin on", "salt and freshly ground black pepper", "1 lemon, juice only", "½ tsp chilli flakes", "1 tbsp olive oil", "2 heads fennel, thinly sliced", "400g/14oz can of flageolet beans, drained and rinsed", "1 red onion, thinly sliced", "2 red chillies, thinly sliced", "small handful fresh flatleaf parsley", "2 tbsp lemon juice", "salt and freshly ground black pepper", "2 tbsp soy sauce", "1½ tbsp extra virgin olive oil", "1 tbsp truffle oil", "2 tbsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4. ", "Line a baking tray with baking parchment.", "Cut the tomatoes in half lengthways and place onto the lined tray, cut-side up.", "Drizzle with olive oil, season lightly with salt and freshly ground black pepper. Sprinkle with the thyme leaves and place into the oven to roast for about 1½ hours, until they colour and shrink a little (if after an hour the tomatoes start to colour too much, cover them with foil).", "Increase the oven temperature to 200C/400F/Gas 6.", "Season the salmon fillets with salt and freshly ground black pepper, the chilli flakes and lemon juice.", "Place an ovenproof frying pan onto a high heat and add the olive oil. When very hot, place the salmon into the pan, skin-side down, and fry for 2-3 minutes, until the skin is crisp and browned.", "Turn the salmon over and transfer to the oven to bake for 5-8 minutes, or until the salmon is completely cooked through.", "To make the salad, place the fennel in iced water to crisp up.", "Mix the beans with the sliced onion, chilli, parsley leaves and lemon juice and season lightly with salt and freshly ground black pepper.", "For the dressing, mix together the soy sauce, olive oil, truffle oil and lemon juice in a large bowl.", "Drain the fennel and add to the dressing. Mix well and season, to taste, with salt and freshly ground black pepper.", "Divide the bean salad between four plates and sit the tomato halves on top. Place the salmon on top of the tomatoes and place a spoonful of fennel salad on top."]}]