[{"isVegetarian": false, "title": "Cheddar and bacon frittata", "url": "www_bbc_co_uk_food_recipes_cheddar_and_bacon_31049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddar_and_bacon_31049_16x9.jpg", "ingredients": ["700g/1lb 9oz large salad potatoes, peeled and halved", "175g/6oz smoked bacon, roughly chopped", "1 tbsp olive oil", "1 garlic clove", "½ red pepper, thinly sliced", "6 large free-range eggs", "25g flatleaf parsley, roughly chopped", "30g/1oz cheddar, grated", "salt and freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Parboil the potatoes in lightly salted water for 6–10 minutes, until almost cooked but still firm. Cut them into slices. Preheat your grill to medium–high. ", "Using a large ovenproof non-stick frying pan, fry the bacon in its own fat, stirring, for 4–5 minutes, or until cooked. Transfer to a plate and set aside. ", "Heat the oil in the same pan. Add the garlic and peppers and fry for 4–5 minutes, or until just cooked. ", "Add the potatoes to the pan, stir gently, then fry for 2–3 minutes, until lightly browned. Return the bacon to the pan and stir gently again. ", "Crack the eggs into a jug and lightly beat using a fork. Stir in the parsley and season well. Pour over the potato-and-bacon mixture, then sprinkle the cheese on top. Cook for 5 minutes.", "Transfer to the grill and cook for 5 minutes, or until cooked through. Serve in slices, with salad if you like. "]}, {"isVegetarian": false, "title": "Cheddar, smoked bacon and courgette quiche", "url": "www_bbc_co_uk_food_recipes_cheddar_smoked_bacon_and_56861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "150g/5½oz cold butter, cubed, plus extra for greasing", "pinch salt", "1 free-range egg", "6 slices dry-cured smoked streaky bacon", "5 free-range egg yolks", "300ml/10fl oz double cream", "150g/5½oz mature cheddar, finely grated", "1 small courgette, trimmed, finely diced", "4 sprigs fresh thyme, leaves only", "1 tsp wholegrain mustard", "1 tsp red wine vinegar", "3 tsp rapeseed oil", "small bag green salad leaves", "1 head Little Gem lettuce, leaves washed and separated"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, in a large bowl, rub together the flour and butter with your fingertips until the mixture resembles breadcrumbs. Season with a pinch of salt.", "Add the beaten egg and bring the mixture together into a ball, then knead very lightly on a lightly floured work surface. ", "Wrap in greaseproof paper and cling film, then chill in the fridge for 10-15 minutes to firm up.", "Meanwhile, for the filling, preheat the oven to 180C/160C Fan/Gas 4. Grease 6 small, loose-bottomed tart tins, each with a diameter of 9cm/3½in diameter and a height of 4cm/1½in. ", "Roll the pastry out onto a lightly floured surface to a thickness of 3mm. Cut 6 discs, each slightly larger in diameter than the tart cases, from the pastry (you will need to re-roll the pastry off-cuts for the last two discs). ", "Line each tin with a pastry disc, pressing gently into the base and sides, then trim the sides so that the pastry cases are flush to the edge of the tins.", "Dry fry the bacon in a frying pan over a medium heat for 3-4 minutes, or until golden-brown and just crisp. Drain on kitchen paper, then roughly chop and set aside.", "Whisk together the eggs and cream in a jug, then season, to taste, with salt and freshly ground black pepper.", "Sprinkle half the cheese equally among the tart cases, followed by half of the chopped bacon. ", "Divide all of the diced courgette among the pastry cases, then cover with the remaining cheese and bacon. Garnish with the thyme leaves. ", "Pour the egg and cream mixture into the tart cases, then bake in the oven for 15-20 minutes, or until the filling has just set and is golden-brown on top. Remove from the oven and set aside to cool slightly before serving.", "Meanwhile, for the salad, shake the mustard, vinegar and rapeseed oil in a small jar until well combined. ", "Fill a resealable plastic bag with the salad leaves, add the dressing and shake the bag to coat the leaves in the dressing. Alternatively, pour the dressing over the salad leaves in a bowl and mix well. ", "Serve the quiches warm with the salad alongside."]}, {"isVegetarian": false, "title": "French toast with ham and cheddar", "url": "www_bbc_co_uk_food_recipes_cheddarandhameggybre_72058", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddarandhameggybre_72058_16x9.jpg", "ingredients": ["2 eggs", "115ml/4¼fl oz milk", "sea salt", "freshly ground black pepper", "2 slices white bread (3cm/1.25in thick)", "1 tsp Dijon mustard", "2 slices ham, trimmed to fit bread", "2 slices cheddar ", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4.", "Place eggs, milk, salt and pepper into a large bowl. Whisk to combine.", "With a sharp, thin-bladed knife, carefully slit open one side of each slice of bread to form a pocket. Ensure that you leave 1cm/0.5in around the edges.", "Spread the mustard on one side of the pocket and place a slice of ham and cheese inside.", "Put the pockets into a shallow dish. Pour over the egg mixture and leave for five minutes, turning once.", "Heat a non-stick frying pan over a medium-high heat, add half of the olive oil and swirl to coat the base of the pan.", "Put the bread pocket into the pan and cook on one side for about two minutes until golden brown. Turn and cook for another minute.", "Remove from the pan and place on a baking tray. Put in the oven and cook for ten minutes, or until the filling has melted."]}, {"isVegetarian": true, "title": "Cheddar cheese soufflé", "url": "www_bbc_co_uk_food_recipes_cheddarcheesesouffle_88285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/½oz butter ", "15g/½oz plain flour", "½ tsp Dijon mustard", "pinch cayenne pepper", "150ml/5½fl oz milk", "1 tbsp double cream", "55g/2oz cheddar cheese, grated", "salt and freshly ground black pepper", "2 free-range eggs, separated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 225C/425F/Gas 7 and place a baking sheet into the oven to heat up.", "Melt the butter in a small saucepan. Brush two ramekins with a little of the melted butter and place in the fridge.", "Add the plain flour to the pan with the remaining melted butter and stir until combined. Add the Dijon mustard and cayenne pepper and stir.", "Gradually add the milk and cream and cook over a low heat, stirring continuously, until the mixture is thick and smooth. Allow to boil for two minutes, or until the mixture starts to leave the edges of the pan.", "Remove from the heat and stir in the cheese, salt and freshly ground black pepper and egg yolks. Leave to cool slightly.", "Place the egg whites into a large bowl and whisk until stiff peaks form when the whisk is removed. Fold the whisked egg whites into the cheese mixture and spoon into the prepared ramekins.", "Place the ramekins onto the hot baking sheet in the oven and bake for 8-10 minutes, or until well-risen and golden-brown on top. Serve immediately."]}, {"isVegetarian": false, "title": "Cheddar fondue with bratwurst sausages", "url": "www_bbc_co_uk_food_recipes_cheddarfonduewithbra_70705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 Bratwurst or Lincolnshire sausages", "bread for dunking", "200g/7¼oz cheddar cheese, grated", "½ litre double cream ", "80ml/2¾fl oz Grappa", "30g/1¾oz chopped fresh parsley", "1 clove garlic"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the sausages until brown and leave to rest", "Then place the cream in a pan and leave to simmer. Next add the garlic, cheese, Grappa and parsley. ", "Season to taste and serve in a fondue pot. ", "Dunk the sausages and bread in the cheese."]}, {"isVegetarian": false, "title": "Cheddar sausage and roasted onion", "url": "www_bbc_co_uk_food_recipes_cheddarsausageandroa_86802", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large white onion, cut in half through the centre, with the root and stem at either end", "2 tbsp olive oil", "1 sausage", "30g/1oz cheddar, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Score the cut surface of the onion multiple times with a sharp knife and drizzle with one tablespoon of the olive oil.", "Lay the onion halves cut-side-down in a small, ovenproof, non-stick frying pan and fry for four minutes, or until golden brown.", "Turn the onion halves up the other way in the pan and transfer to the oven to roast for 8-10 minutes or until soft in the centre.", "With the remaining one tablespoon olive oil, fry the sausage for 2-3 minutes until golden-brown on all sides.", "Remove the sausage from the pan and slice in half lengthways. ", "Fill the centre of the sausage with the cheddar slices and place in the oven alongside the onion. Bake for six minutes or until the sausage is cooked through. Place on a serving plate and serve hot."]}, {"isVegetarian": false, "title": "Cheese and chorizo rolls", "url": "www_bbc_co_uk_food_recipes_cheese_and_chorizo_rolls_96145", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_chorizo_rolls_96145_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "7g instant yeast", "1 tsp salt", "1 tsp sugar or honey", "2 tbsp olive oil", "300ml/10fl oz tepid water", "50g/1¾oz chorizo, finely chopped", "100g/3½oz hard cheese (such as cheddar or gouda), grated", "2 tbsp finely snipped chives (or finely chopped thyme, oregano, parsley)", "1 free-range egg, beaten, for glazing "], "serves": "Makes 8–10", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, yeast, salt and sugar (or honey) in a bowl and drizzle in the olive oil, then the water, mixing together until it comes together as a dough. Add the chorizo, 50g/1¾oz of the cheese and the chives (or other herbs).", "Knead in the bowl for a minute until the additions have worked in a little, then knead on a floured surface until the dough is smooth. Return to the bowl, cover with a damp cloth or cling film and leave to rest somewhere warm for 1½ –2 hours, until doubled in size.", "Preheat your oven to its highest setting. Knock back the risen dough and divide into 8–10 even pieces. Knead and shape into balls, then place in a 28cm/11in diameter cake tin or a small roasting tin, which has been lined with greaseproof paper. Cover with a damp towel again and leave to rise for another 20–30 minutes, or until risen and squashing together.", "Brush lightly with the egg glaze (you need a very light touch if the bread dough is at all puffy and springy), then sprinkle over the remaining 50g/1¾oz cheese. Bake in the oven for 20–25 minutes, or until cooked through and a golden-brown colour. They should feel slightly hollow. Serve warm from the oven or cold."]}, {"isVegetarian": true, "title": "Cheddar scones with balsamic onions", "url": "www_bbc_co_uk_food_recipes_cheddarsconeswithbal_78409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz self-raising flour", "100g/3½ butter", "1 free-range egg", "milk to bind", "100g/3½oz cheddar, grated ", "1 large handful fresh basil", "1 tbsp olive oil", "1 red onion, thinly sliced", "2 tbsp brown sugar", "3 tbsp balsamic vinegar"], "serves": "Makes 7", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the scones, mix together the flour, butter, egg and just enough milk to bind in a food processor to form a smooth, firm dough.", "Roll out some scone dough onto a flat surface. Mix in the cheese (reserving a little for later) and basil and roll out the dough to 2½cm/1in thickness.", "Using a medium-sized chefs' ring or cutter, cut out rounds and place onto a baking sheet. Brush with milk and top with the reserved cheese.", "Place into the preheated oven for 15 minutes, or until risen and golden.", "Meanwhile, for the onions, heat the oil in a saucepan, add the onions and fry them until soft.", "Add the sugar and let the onions caramelise for 2-3 minutes.", "Add the balsamic vinegar and reduce till thick and syrupy.", "Serve the warm scones with balsamic onions."]}, {"isVegetarian": true, "title": "Cheese and chutney strata", "url": "www_bbc_co_uk_food_recipes_cheese_and_chutney_77502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "20g/¾oz baby spinach leaves", "1 garlic clove, chopped", "300g/10½oz chutney", "1 day-old French-style baguette, cut into 1cm/½ in rounds", "4 free-range eggs", "450ml/16fl oz full-fat milk", "150g/5½oz strong cheddar cheese, grated", "350g/12oz soft goats’ cheese, torn into pieces", "2 sprigs rosemary ", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Heat a frying pan and add the oil. Tip in the spinach and garlic and cook until wilted. Season with salt and pepper. ", "Lay the spinach in an ovenrpoof serving dish. Spread the chutney over one side of the cut baguette and place on top of the spinach.", "Whisk the eggs with the milk in a bowl. Stir in the cheddar, and season with salt and pepper. Pour this mixture over the spinach and bread and leave to sit for 10 minutes.", "Dot the goats’ cheese and the rosemary sprigs over the top and bake in the oven for 30 minutes, or until the cheese has melted. Serve straight away."]}, {"isVegetarian": false, "title": "Cheese and ham waffles with hollandaise sauce and poached eggs", "url": "www_bbc_co_uk_food_recipes_cheese_and_ham_waffles_28778", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range egg yolks", "150g/5½oz cold butter, cut into cubes", "½ lemon, juice only", "2 tbsp chopped chives", "sea salt", "250g/9oz plain flour", "1 tsp baking powder", "1 tsp salt", "1 tbsp caster sugar", "3 free-range eggs", "425ml/15fl oz whole milk", "115g/4oz unsalted butter", "6 slices ham, shredded ", "100g/3½oz Cheddar, grated ", "4 fresh large free-range eggs", "1 tsp white wine vinegar", "sea salt", "75g/2½oz unsalted butter", "4 handfuls fresh spinach"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a waffle maker to the medium setting.", "To make the hollandaise, place a large heatproof bowl over a pan of gently simmering water. Add the yolks to the bowl, whisk and slowly add the cubed butter, bit by bit. Whisk continuously until the sauce is combined and has thickened. Add the lemon juice, chives and a pinch of sea salt and stir through. Turn off the heat, but keep the bowl over the pan to keep warm.", "To make the waffles, melt the butter in a small pan and add to a large bowl. Add the remaining ingredients and whisk together.", "Pour the mixture into the waffle maker and cook for 6–8 minutes. If the waffle machine makes less than four at a time, repeat with the remaining batter and keep the cooked waffles warm in an oven set at a low temperature. ", "To make the poached eggs, bring a saucepan of water to the boil. Add the salt and vinegar and stir to dissolve the salt. Crack an egg into a cup and slowly lower the edge of the cup into the pot and drop in the egg. Cook the egg at a very gentle simmer for 3–4 minutes for the yolk to still be runny.", "Remove the egg with a slotted spoon and place on a plate lined with kitchen paper. Repeat with the remaining eggs. Just before serving, reheat the eggs in warm water for 1 minute, if necessary.", "To make the spinach, heat the butter in a saucepan, add the spinach and cook until wilted.", "To serve, place a waffle on each plate with some wilted spinach on top. Top each with a poached egg and pour over the hollandaise sauce. "]}, {"isVegetarian": false, "title": "Cheese and potato nests", "url": "www_bbc_co_uk_food_recipes_cheese_and_potato_nests_20525", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_potato_nests_20525_16x9.jpg", "ingredients": ["1 tbsp soft butter", "500g/1lb 2oz waxy potatoes, e.g. Maris Peer or Charlotte", "1 onion, finely chopped ", "1 garlic clove, finely chopped ", "1 bay leaf", "200g/7oz lardons or cubes of smoked bacon ", "100ml/3½fl oz dry white wine", "250g/9oz Reblochon cheese, cubed"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and brush a six-hole muffin tin with the soft butter. ", "Peel the potatoes and use the julienne blade on a mandoline to make thin matchsticks (or slice by hand).", "Put the onion, garlic, bay leaf and lardons into a large non-stick frying pan and cook until the lardons are golden-brown. Add the wine and reduce until only a couple of tablespoons of liquid remain. Remove the bay leaf.", "Stir in the potato matchsticks and take off the heat, then stir in the Reblochon cubes.", "Divide the potato mix between the six holes in the muffin tin and bake for 15–20 minutes or until golden-brown and bubbling. Serve hot."]}, {"isVegetarian": true, "title": "Cheese and herb muffin in a mug", "url": "www_bbc_co_uk_food_recipes_cheese_and_herb_muffin_43619", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_herb_muffin_43619_16x9.jpg", "ingredients": ["100g/3½oz parmesan cheese (or vegetarian alternative), grated", "10g fresh basil (about a handful) or 1 tbsp dried basil ", "10g fresh chives (about a handful) or 1 tbsp dried chives", "½ tsp thyme leaves", "250g/9oz self-raising flour", "1 tsp bicarbonate of soda", "85ml/3fl oz sunflower oil", "2 free-range eggs", "100ml/3½fl oz semi-skimmed milk", "100ml/3½fl oz low-fat natural yoghurt"], "serves": "Makes 6 mug muffins – each muffin serves 2 people", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wash and finely chop the herbs using a sharp knife or scissors.", "Mix together the flour and bicarbonate of soda in a mixing bowl and add the parmesan and chopped herbs.", "Measure the oil into the measuring jug.", "Beat the eggs separately in a bowl then add to the oil.", "Add the milk and yoghurt to the oil and egg mixture.", "Pour the wet ingredients into the dry ingredients and stir until combined.", "Spoon the mixture into the six mugs, filling each one a third full.", "Place three mugs in the microwave and cook for four minutes on full power, or until raised and firm to touch. You may need to adjust the timings slightly depending on the size and design of mug.", "Repeat with the remaining mixture to make your second batch of muffins in a mug.", "These muffins are delicious served warm, spooned out of the mug, or use a knife to score around the edge of the mug and tip the warm muffin out onto a cooling rack."]}, {"isVegetarian": true, "title": "Cheese and tomato chutney turnovers", "url": "www_bbc_co_uk_food_recipes_cheese_and_tomato_07140", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_tomato_07140_16x9.jpg", "ingredients": ["375g/13oz self-raising flour, plus extra for rolling", "½ tsp fine sea salt", "75g/2½oz cold butter, cut into cubes", "225ml/8fl oz whole milk", "180g/6oz Somerset brie ", "8-9 tbsp fresh tomato chutney ", "300ml/10fl oz sunflower oil, for frying"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, put the flour and salt into a large mixing bowl and rub in the butter with your fingertips until the mixture resembles coarse breadcrumbs. Slowly add the milk, stirring constantly until the mixture comes together and forms a soft, spongy dough. Knead lightly and form into a ball.", "Roll out half the dough on a lightly floured surface until it’s roughly 3mm thick. Take a saucer, or an upturned bowl, about 14cm/5½in in diameter and cut around it to make three circles of dough. You can re-knead and roll the dough if necessary. Repeat with the remaining dough.", "Remove and discard the rind from the cheese. Cut the cheese into roughly 1cm/½in chunks. Spoon a heaped tablespoon of the chutney into the middle of each round of pastry spreading it out but leaving a 1cm/½in border all around the edge. ", "Place a sixth of the cheese on one side of each circle. Brush the edges of the dough with a little water. Fold over to encase the filling, pushing out any air, and press the edges together. Press the tines of a fork around the edge of the pastry, pressing firmly through both layers, to ensure the pie is sealed.", "Pour the oil into a large non-stick frying pan – it should be around 1cm/½in deep. Place over a medium heat and leave for a couple of minutes, or until the oil is hot enough to brown a cube of white bread in 15 seconds. It needs to be around 150C/300F if you test the temperature with a cooking thermometer. Do not allow the oil to overheat and do not leave the oil unattended. (Use a deep fat fryer if you prefer.)", "Using a heatproof spatula, put two of the turnovers into the hot oil and cook for around two minutes on each side, or until lightly browned and slightly puffed up. The cheese inside will be lovely and melted when the turnovers are cut open. If the oil is too hot, the pastry will brown too much before the filling is ready. Remove the turnovers and drain on a plate lined kitchen paper. Cover with foil and keep warm while you cook the rest. ", "The turnovers can also be reheated in a hot oven for about 10 minutes if you don’t need to serve all of them at the same time."]}, {"isVegetarian": true, "title": "Cheese and tomato melts", "url": "www_bbc_co_uk_food_recipes_cheese_and_tomato_melts_99595", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz plain flour ", "large pinch of mild paprika ", "20g/1oz butter, softened ", "1 spring onion ", "20g/1oz cheddar, grated ", "2-3 tbsp tomato juice"], "serves": "Makes 6-8 melts", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven at 200C/400F/Gas 6. Line a baking tray with some baking paper.", "Place the flour into the mixing bowl and add the paprika and butter. Rub the butter into the flour. ", "Cut the spring onion up into small pieces with the scissors (ask a grown-up to help you) - take off the roots and the dark green leaves first; this is called topping and tailing. Start by cutting it into chunks, then add to the bowl and chop more in the bowl. ", "Add the grated cheese and stir the mixture together with a fork. Add two tablespoons of tomato juice and mix well with a spoon. If the dough isn’t sticking together then add a little more tomato juice until the mixture becomes a smooth dough. ", "Roll the dough out on a floured surface to a thickness of about 1cm/½in . Then cut circles with a 5cm/2in round biscuit cutter. Place the biscuits onto the lined baking tray.", "Ask a grown-up to put the cheese and tomato melts into the oven for 10-15 minutes or until firm. Leave to cool before eating.  Serve them with apple slices."]}, {"isVegetarian": false, "title": "Cheese and vegetable pasties", "url": "www_bbc_co_uk_food_recipes_cheese_and_vegetable_14635", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180g/6¼oz ready-to-roll puff pastry", "plain flour, for dusting", "4 spinach leaves, chopped", "30g/1¼oz grated cheddar, plus extra for the topping", "pinch ground nutmeg", "2 rounded tsp ready-made ratatouille (or similar ready-made tomato-and-vegetable sauce)"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Line a baking tray with baking parchment.", "Roll out the puff pastry onto a lightly dusted work surface. Cut four circles from the pastry using a cookie cutter. Prick each pastry circle several times using a fork.", "In a bowl, mix together the chopped spinach, cheddar, nutmeg and ready-made ratatouille until well combined.", "Place two of the pastry circles onto the lined baking tray. Spoon half of the filling mixture into the centre of both pastry circles. ", "Dab a little water around the edge of both pastry circles using a pastry brush. Place one of the remaining pastry circles over each, pressing down at the edges to seal. ", "Sprinkle each pasty with a little water, then top with a little more grated cheddar.", "Bake the pasties in the oven for 12-15 minutes, or until the pastry has risen and is golden-brown. Set aside to cool slightly before eating with a tomato salad."]}, {"isVegetarian": true, "title": "Cheese, chive and mustard scones", "url": "www_bbc_co_uk_food_recipes_cheese_chive_and_mustard_48610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["510g/1lb 2oz plain flour, plus extra for flouring", "generous pinch salt", "2¼ tsp baking powder", "1 tsp English mustard powder", "65g/2½oz unsalted butter, plus extra for serving", "380g/13oz strong cheddar", "4½ tbsp fresh snipped chives", "300ml/10fl oz milk ", "1 free-range egg, beaten with a little milk for glazing", "4 russet apples, to serve"], "serves": "Makes 18 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Lightly flour a baking tray.", "Sift the flour, salt, baking powder and mustard into a bowl. ", "Rub in the butter until the mixture resembles fine breadcrumbs. (You can do this quickly in a food processor.)", "Grate half of the cheese very finely, and roughly chop the other half. Stir into the flour mixture with the chopped chives. ", "Gradually add milk to make a soft but not sticky dough (you may not need all the milk). ", "Turn the dough onto a floured surface and knead lightly, then roll the dough out into a thickness of just less than 2.5cm/1in. Use a 6cm/2½in cutter to cut the scones, re-rolling the off-cuts as necessary.  Handle the dough as little as possible to keep it light.", "Put the scones onto the floured baking tray, allowing at least 2.5cm/1in between them and glaze with the egg and milk mixture. ", "Bake for 10 minutes or until risen and golden brown.", "To serve, finely slice the russet apples and fan half a dozen slices on the plate with the cheese scone and a small pat of butter."]}, {"isVegetarian": true, "title": "Cheese nuggets with grape chutney and pecan salad", "url": "www_bbc_co_uk_food_recipes_cheese_nuggets_with_15188", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_nuggets_with_15188_16x9.jpg", "ingredients": ["100g/3½oz light muscovado sugar", "1 onion, finely chopped", "100g/3½oz sultanas", "150ml/5¼fl oz sherry vinegar", "2 tomatoes, roughly chopped", "300g/10½oz red seedless grapes, halved", "sea salt and freshly ground black pepper", "1 free-range egg yolk", "1 tsp English mustard", "2 tsp runny honey", "2 tbsp cider vinegar", "150ml/5¼fl oz vegetable oil", "1 banana shallot, finely chopped", "1 garlic clove, finely chopped", "2 tbsp finely chopped fresh flatleaf parsley leaves", "1 tbsp finely chopped fresh mint leaves", "1 tbsp finely chopped fresh basil leaves", "1 tbsp finely chopped fresh thyme leaves", "salt and freshly ground black pepper", "100g/3½oz caster sugar", "100g/3½oz pecan nut halves", "2 heads Little Gem lettuce, washed, leaves separated", "vegetable oil, for deep frying", "vegetable oil, for deep frying (see above)", "125g/4½oz plain flour", "4 free-range eggs, lightly beaten", "150g/5¼oz fresh breadcrumbs", "400g/14oz assorted cheese, cut into 3cm/1in chunks"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chutney, heat the muscovado sugar in a large frying pan over a low to medium heat, without stirring, until it melts and forms a golden-brown caramel ,swirl the pan to move the sugar instead of stirring it (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.).", "Add the onion and sultanas to the caramel, then pour in the sherry vinegar and stir with a wooden spoon.", "Add the tomatoes and grapes and cook for 12–15 minutes, or until the grapes are tender and the mixture has thickened. Season, to taste, with salt and freshly ground black pepper.", "Transfer the chutney to a sterilised, airtight jar and set aside. (The longer you leave the chutney, the more the flavours will develop.)", "Meanwhile, for the house dressing, whisk together the egg yolk, mustard, honey and cider vinegar in a bowl until well combined. Gradually add the vegetable oil in a thin stream, whisking continuously, until the mixture thickens to a creamy mayonnaise.", "Stir in the shallot, garlic and herbs, then season, to taste, with salt and freshly ground black pepper. Set aside.", "For the pecan salad, line a plate with greaseproof paper.", "Pour 100ml/3½fl oz of water into a saucepan and add the sugar. Bring the mixture to the boil, then reduce the temperature until the mixture is simmering and simmer for 4-5 minutes, or until the sugar has dissolved and the mixture has thickened to a syrup. (Caution: Hot syrup can be dangerous. Do not leave unattended.)", "Add the pecans to the syrup and continue to cook for 2-3 minutes, then spoon the pecans and syrup onto the lined plate and set aside to cool and harden.  ", "Heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a heavy-based saucepan over a high heat until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the sugared pecans into the hot oil, in batches, and cook for 1-2 minutes, or until golden-brown. Remove from the oil using a slotted spoon and set aside to drain and cool on kitchen paper.", "When the pecan nuts have cooled, place the lettuce leaves into a large bowl, drizzle over two tablespoons of the house dressing, then sprinkle over the pecans. Toss the leaves to coat them in the dressing. Set aside.", "For the cheese nuggets, sprinkle the flour on a plate and the breadcrumbs on another plate. Dust each piece of cheese first in the flour, then dip it into the beaten egg, then roll in the breadcrumbs until completely coated.", "Using the same oil as before, carefully lower the coated cheese pieces into the hot oil in batches. Fry for 30–60 seconds, or until the breadcrumbs are golden-brown and the cheese has melted. Remove each batch from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm while you cook the remaining batches.", "To serve,  place the cheese nuggets onto a large serving plate with a bowl of the chutney alongside. Serve with the salad."]}, {"isVegetarian": true, "title": "Cheese, pistachio and prune cake", "url": "www_bbc_co_uk_food_recipes_cheese_pistachio_and_85849", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_pistachio_and_85849_16x9.jpg", "ingredients": ["250g/9oz plain flour", "1 tbsp baking powder", "150g/5½oz soft goat’s cheese, cut into small pieces", "80g/2¾oz pistachios, roughly chopped", "100g/3½oz prunes, roughly chopped", "4 free-range eggs", "150ml/5fl oz olive oil", "100ml/3½fl oz milk", "50g/1¾oz plain yoghurt ", "1 tsp salt ", "pinch freshly-ground black pepper"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a loaf tin measuring 22x11cm/8½x4¼in across the top and 6cm/2½in deep with baking paper. ", "In a bowl, mix together the flour, baking powder, goat’s cheese, pistachios and prunes. ", "In a separate bowl, whisk the eggs until fluffy and pale in colour. Then gradually whisk in the oil, milk and yoghurt. Season with the salt and freshly-ground black pepper.", "Fold the flour mixture into the whisked eggs. Try not to overbeat as this will make the end result tough (it’s better to undermix). ", "Pour the batter into the prepared tin. ", "Bake for 30-40 minutes or until a metal skewer inserted in the centre of the cake comes out clean. ", "Leave to cool in the tin."]}, {"isVegetarian": true, "title": "Cheese, potato and onion pie", "url": "www_bbc_co_uk_food_recipes_cheese_potato_and_onion_96190", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_potato_and_onion_96190_16x9.jpg", "ingredients": ["200g/7oz plain flour", "75g/2½oz cold unsalted butter, cut into roughly 1cm/½in dice", "75g/2½oz white vegetable fat, cut into small pieces", "25g/1oz parmesan (or vegetarian alternative), finely grated", "25g/1oz mature cheddar, finely grated", "1 free-range egg, beaten, to finish", "1kg/2lb 4oz Desiree potatoes, peeled and cut into large chunks", "1 onion, finely diced ", "375g/13oz mature cheddar, grated ", "50ml/2fl oz milk", "2 tbsp chopped chives", "salt and white pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, put the flour into a bowl. Add the butter and vegetable fat and rub them in lightly with your fingertips until the mixture looks like coarse breadcrumbs (this dough is richer and stickier than a standard pastry). Alternatively, rub in the fat using a food processor or a mixer, and then transfer to a bowl. ", "Add the cheeses to the flour and fat and mix well. Now, using a table knife, work in just enough cold water to bring the pastry together into a dough. You’ll probably need 2-3 tablespoon. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and place in the fridge to chill while you make the filling.\t", "Preheat the oven to 200C/400F/Gas 6 and have ready a metal baking dish, about 24x20cm/10x8in big and 5cm/2in deep.", "For the filling, place the potatoes in a saucepan, cover with water, add a little salt and bring to the boil. Reduce to a simmer and cook until the potatoes are tender enough to mash, about 12-15 minutes. ", "Drain the potatoes well and put them through a ricer into a large bowl (this will give you smooth, lump-free mash but you can use a standard potato masher if you prefer). Add the onion, cheese, some salt and a good pinch of white pepper. Beat with a wooden spoon so the cheese is well incorporated. Add the milk and chives and give the mix a good stir.", "Put the mash into the tin and use the back of a spoon spread it out until smooth and even.", "On a lightly floured surface, roll out the pastry so it will just fit on top of the mash. It should be 8-10mm/1/3in thick. Place it on top of the mash, trim the edges neatly and mark the pastry into six portions by scoring it with a knife.", "Brush the pastry with the beaten egg and bake for 20-25 minutes, or until golden-brown. Let the pie stand for 15 minutes before cutting and serving."]}, {"isVegetarian": true, "title": "Cheese straws", "url": "www_bbc_co_uk_food_recipes_cheese_straws_40324", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_straws_40324_16x9.jpg", "ingredients": ["300g/10½ oz all-butter puff pastry", "4 egg yolks, beaten with a splash of water", "150g/5½ oz cheddar, grated", "paprika, for sprinkling"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line two baking sheets with baking parchment or greaseproof paper.", "Roll out the pastry to a 30cm/12in square. ", "Using a pastry brush, brush the egg mixture all over the pastry. Sprinkle over the cheese and press down lightly. Cover with cling film and chill the dough in the fridge for 15 minutes.", "Sprinkle the cheese with paprika, cut in half, then cut each half into 1cm/½in strips.", "Twist each strip into a cheese straw shape and place onto the lined baking sheet.", "Bake for 15 minutes, or until golden-brown and crisp."]}, {"isVegetarian": true, "title": "Cheese scone", "url": "www_bbc_co_uk_food_recipes_cheese_scone_62849", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_scone_62849_16x9.jpg", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "4 tsp baking powder", "85g/3oz cold butter, cubed", "350ml/12fl oz milk, plus extra for glazing", "250g/9oz assorted cheeses, crumbled into small pieces, plus extra grated cheese to sprinkle on top"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour and baking powder into a large mixing bowl.", "Rub the butter into the flour using your fingertips, until the mixture resembles coarse, fresh breadcrumbs.", "Pour in the milk and mix with a wooden spoon to create a soft dough.", "Add the crumbled cheese and ensure it is evenly distributed by gently kneading the dough with your hands.", "Shape the dough into a rough round and place on a baking tray dusted with flour.", "Press down on the top of the ball to flatten it slightly, then brush it with a little milk to glaze.", "Grate some extra cheese over the top, then score a deep cross into the dough with a sharp knife to allow it to break into individual pieces when cooked.", "Bake in the preheated oven for around 30 minutes, or until the cheese topping looks golden-brown and crisp.", "Serve warm with your favourite chutney or pickle."]}, {"isVegetarian": true, "title": "Cheese straws", "url": "www_bbc_co_uk_food_recipes_cheese_straws_79467", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_straws_79467_16x9.jpg", "ingredients": ["375g/13oz plain flour", "pinch salt", "225g/8oz butter, diced", "150g/5½oz mature cheddar cheese", "50g/1¾oz freshly grated parmesan cheese (or a similar vegetarian hard cheese)", "pinch English mustard powder", "small pinch cayenne pepper", "2 free-range eggs, yolks only"], "serves": "Makes approximately 36 cheese straws", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and a pinch of salt into a bowl. Using your fingertips, rub in the butter until all the lumps are gone and the texture is like fine breadcrumbs. Stir in the cheese, mustard powder, cayenne, and egg yolks. Add 4-5 tablespoons of cold water and mix to a firm dough. Wrap in cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 190C/375F/Gas 5. Line a baking sheet with baking parchment. Roll out the dough to a square, roughly the thickness of a £2 coin. Cut the square in half, then cut each half into 1cm/½in strips. Transfer carefully onto the lined baking sheet and bake for 10-15 minutes, until crisp, then leave to cool on the tray."]}, {"isVegetarian": false, "title": "Cheese and chorizo twists", "url": "www_bbc_co_uk_food_recipes_cheese_twists_30316", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_twists_30316_16x9.jpg", "ingredients": ["375g/13oz ready-rolled puff pastry", "100g/3½oz manchego, grated", "12 chorizo slices", "1 tsp dried red chilli flakes", "1 free-range egg, lightly beaten"], "serves": "Makes 15 twists", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Unroll the pastry onto a baking tray with the longest edge of the pastry facing you.", "Scatter the manchego over the right-hand half of the pastry. Top the cheese with 10–12 slices of chorizo and sprinkle with chilli flakes. Fold over the remaining pastry and flatten with your hands. ", "Turn the pastry 45 degrees so it sits in the middle of the baking paper.  Lightly roll with a rolling pin to seal.", "Cut the pastry into 1cm/½in pieces and twist 4–5 times. Brush the twists with the beaten egg and bake in the oven for 15–20 minutes, or until risen and golden. ", "Remove from the oven and set aside to cool on a wire rack. "]}, {"isVegetarian": true, "title": "Cheese and asparagus soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandasparagusso_86251", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/2½fl oz double cream", "3 asparagus spears, finely chopped", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper ", "100g/3½oz Double Gloucester cheese, grated", "3 free-range eggs, separated", "butter, for greasing", "flour, for dusting"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the double cream into a small saucepan and bring to the boil. Add the asparagus spears and chives, season with salt and freshly ground black pepper and cook for 1-2 minutes. Add the grated cheese and stir until melted. Remove from the heat and leave to cool slightly.", "Add two of the egg yolks to the mixture and beat well (the third egg yolk can be used in another dish).", "Place the egg whites into a large, clean bowl and whisk until stiff peaks form when the whisk is removed. Gently fold the egg whites into the cheese mixture.", "Grease a small ovenproof pan with butter, dust with plain flour and shake out the excess. Spoon the soufflé mixture into the pan, then transfer to the oven and bake for 6-8 minutes, or until risen and golden-brown.", "Serve immediately in the pan or turned out onto a plate."]}, {"isVegetarian": true, "title": "Cheese and broccoli soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandbroccolisou_87165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ head broccoli, cut into florets, blanched", "3 free-range eggs, separated", "2 tbsp cheddar, grated, plus extra for sprinkling ", "salt and freshly ground black pepper ", "softened butter, for greasing", "flour, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and place a baking tray inside to heat.", "Place the broccoli into a small blender and blend until finely chopped. Add the egg yolks and blend until combined. Pour into a bowl. ", "In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed, then carefully fold the egg whites into the blended broccoli. ", "Fold in the cheese and season well with salt and freshly ground black pepper. ", "Butter two ramekins and dust with flour. Spoon the soufflé mixture into the ramekins. Sprinkle with a little extra grated cheese. ", "Place the ramekins onto the heated baking tray and place in the oven for eight minutes, or until risen and golden. ", "Serve straight away, in the ramekins."]}, {"isVegetarian": false, "title": "Cheese and cherry tomato muffins", "url": "www_bbc_co_uk_food_recipes_cheeseandcherrytomat_84142", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandcherrytomat_84142_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "100g/3½oz courgette, grated", "salt and freshly ground black pepper", "100g/3½oz mature cheddar, grated", "175ml/6fl oz milk", "1 free-range egg", "55ml/2fl oz olive oil", "10 cherry tomatoes", "crisp grilled bacon", "scrambled egg"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "In a mixing bowl, combine the flour, courgette, salt, freshly ground black pepper and cheddar and mix well.", "In a separate bowl, mix together the milk, egg and olive oil. Add this mixture to the dry ingredients and mix well.", "Grease ten muffin moulds and half-fill each with the mix.", "Prick each cherry tomato - this stops them popping when they cook - and press one tomato into the top of each spoonful of mix. ", "Spoon the remaining mixture over each muffin to conceal the tomato. Cook for about 20 minutes until golden brown."]}, {"isVegetarian": true, "title": "Cheese and chive soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandchivesouffl_84979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint double cream", "100g/3½oz cheddar cheese, grated", "2 free-range eggs, separated", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper", "butter, for greasing"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and place a baking sheet into the oven.", "Pour the cream into a small saucepan over a low heat. Stir in the cheese and egg yolks and whisk together until slightly thickened. Remove from the heat and leave to cool for five minutes.", "In a separate, clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Fold the egg whites into the cream mixture. Stir in the chives and season well with salt and freshly ground black pepper.", "Grease two small ramekins and pour in the soufflé mixture until the ramekins are three-quarters full.", "Place the ramekins onto the preheated baking tray, transfer to the oven and bake for 8-10 minutes, or until well risen and golden-brown on top. Serve immediately in the ramekins."]}, {"isVegetarian": false, "title": "Cheese and ham croque monsieur", "url": "www_bbc_co_uk_food_recipes_cheeseandhamcroquemo_88066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white crusty bread", "100g/3½oz Brie, sliced", "2 slices ham", "2 free-range eggs, beaten", "1 tbsp olive oil", "15g/½oz butter", "oakleaf and lamb's lettuce leaves", "drizzle olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Take one slice of bread, lay the slices of Brie on top and then cover with the ham. Place the second slice of bread on top, then dip the sandwich into the beaten egg, coating well. ", "Heat the oil and butter in a frying pan and fry the sandwich until golden-brown on both sides. ", "To serve, cut in half and arrange on a serving plate. Garnish with lettuce leaves and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Cheese and lentil pancake", "url": "www_bbc_co_uk_food_recipes_cheeseandlentilcanne_85050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1½oz plain flour", "2 free-range eggs ", "50ml/2fl oz whole milk", "1 tbsp olive oil", "50g/1½oz cooked lentils", "50g/1½oz cheddar cheese, grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancake, place the flour, eggs and milk into a bowl and mix well to make a smooth batter.", "Heat the oil in a frying pan and pour in the batter, swirling the pan to coat the base. Fry the pancake for two minutes.", "Place the lentils and cheese onto the middle of the pancake and fold in half to enclose the mixture. Fry for a further 2-3 minutes.", "For the herb oil, place the oil and parsley into a bowl, mix well and season with salt and freshly ground black pepper.", "To serve, place the pancake onto a plate and drizzle over the herb oil."]}, {"isVegetarian": false, "title": "Cheese and herb-crusted chicken breast with warm chickpeas and chorizo", "url": "www_bbc_co_uk_food_recipes_cheeseandherbcrusted_92403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 chicken breast, skin removed", "salt and freshly ground black pepper", "1 fresh rosemary sprig", "2 garlic cloves, peeled, left whole, slightly crushed with the side of a knife", "2 tbsp garlic-and-herb cream cheese", "100g/3½oz chorizo, sliced", "½ onion, peeled, finely sliced", "2 garlic cloves, peeled, finely chopped", "1 sprig fresh rosemary", "85g/3oz canned chickpeas, drained and rinsed", "salt and freshly ground black pepper", "2 tbsp balsamic vinegar", "4 tbsp extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in an ovenproof frying pan and brown the chicken breast for 2-3 minutes on each side. Add the rosemary and garlic to the frying pan. ", "Transfer the pan to the oven and cook the chicken for 10-12 minutes.", "Spread the garlic-and-herb cream cheese over the top of the chicken. Keep warm.", "Meanwhile, for the chickpeas and chorizo, roast the chorizo in the oven in a roasting tray for 3-4 minutes, or until crisp. Season, to taste, with salt and freshly ground black pepper. ", "Stir the onion, garlic, rosemary and chickpeas into the chorizo and roast for a further 5-7 minutes. Stir in the balsamic vinegar and extra virgin olive oil.", "To serve, spoon the chickpeas and chorizo onto a plate. Cut the chicken breast into three pieces and place on top."]}, {"isVegetarian": true, "title": "Cheese and onion pasties", "url": "www_bbc_co_uk_food_recipes_cheeseandonionpastie_13551", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb shortcrust pastry", "450g/1lb onions, peeled and sliced", "450g/1lb mature cheddar, grated", "2 tbsp vegetable oil", "salt and pepper", "beaten egg for glazing"], "serves": "Makes 6 pasties", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Roll out the pastry and cut out circles 20cm/8in in diameter. ", "Heat the oil and cook the onions in it until starting to soften. ", "Take off the heat and cool. Stir in the grated cheese and season well. ", "Divide the mixture between the 6 circles and crimp the edges together. Brush with a little of the beaten egg. ", "Put on a baking sheet and bake in the oven for 20-30 minutes until the pastry is golden. Serve hot or cold."]}, {"isVegetarian": true, "title": "Cheese and onion pie", "url": "www_bbc_co_uk_food_recipes_cheeseandonionpie_89625", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandonionpie_89625_16x9.jpg", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "2 tsp baking powder", "½ tsp salt ", "120g/4½oz unsalted butter, plus extra for greasing", "1 free-range egg yolk", "50g/2oz parmesan cheese (or a similar vegetarian hard cheese), grated", "120ml/4fl oz water", "1 free-range egg, beaten, for glazing", "1 medium potato, peeled and cut into cubes", "2 onions, finely sliced", "1 tbsp plain flour", "50ml/2oz whole milk", "50ml/2oz double cream", "150g/5½oz mature cheddar cheese, grated", "½ tsp English mustard", "½ tsp cayenne pepper", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. Add the grated parmesan and stir until well combined.", "Gradually add the water, a tablespoon at a time, mixing continuously until the mixture just comes together as a dough. (You may not need to use all of the water.) Roll the dough into a ball, then wrap it in cling film and chill in the fridge for an hour. ", "Meanwhile, for the filling, bring a saucepan of salted water to the boil. Add the potato pieces to the pan and cook for 10-15 minutes, or until tender, then drain well and set aside. ", "Bring a separate large saucepan of water to the boil, add the sliced onions and cook for 2-3 minutes, or until softened. Drain well and return the cooked onions to the saucepan.", "Sprinkle the onions with the flour and stir well to coat. Add the milk and cream and heat the mixture over a medium heat for 3-4 minutes, stirring continuously, until the liquid is smooth and has thickened slightly. Add the cooked potato pieces, grated cheese, mustard and cayenne pepper and stir well. Season to taste with salt and freshly ground black pepper, stir well, then set the filling mixture aside.", "Preheat the oven to 180C/350F/Gas 4. Grease a deep 20cm/8in pie tin with butter. Add a small amount of flour, turn the tin to coat the base and sides of the tin, then shake out any excess. ", "When the pastry has chilled, roll out two thirds of it onto a clean, floured work surface, until it is almost twice as wide as the diameter of the pie tin. Using the rolling pin, lift the pastry and lay it over the pie tin to line the base and sides. Gently press the pastry into the corners of the tin, trimming off any excess, then prick the base of the pastry case several times with a fork. ", "Cover the pastry with a sheet of greaseproof paper and fill it with rice or dried beans. Bake in the oven for 10-15 minutes, or until the pastry is pale golden-brown. Remove from the oven, discard the beans and greaseproof paper and set the pastry aside to cool. When cool, pour the pie filling into the pastry case.", "Roll the remaining one third of the pastry out onto a clean, floured work surface until it is slightly larger than the diameter of the pie tin. Brush the rim of the cooked pastry case with some of the beaten egg and place the pastry lid on top of the pie. Trim off any excess pastry. Seal the pastry lid to the pastry case by crimping the edges of the pastry lid with a fork.", "With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry lid with the remaining beaten egg, then transfer to the oven and bake for 25-30 mins, or until golden-brown."]}, {"isVegetarian": true, "title": "Cheese and potato pasty", "url": "www_bbc_co_uk_food_recipes_cheeseandpotatopasty_84404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "100g/3½oz butter", "1 free-range egg", "salt and freshly ground black pepper", "80g/3oz walnuts, crushed finely", "milk, to bind (if necessary)", "400g/14oz new potatoes, cut into cubes and boiled until tender", "400g/14oz smoked cheese, cut into cubes", "handful baby spinach", "2 red onions, cut into wedges, roasted for 30 minutes", "salt and freshly ground black pepper", "1 free-range egg, beaten, for egg wash", "1 tbsp olive oil", "1 onion, sliced", "1 garlic clove, finely sliced", "1 chilli, finely chopped ", "thumb-sized piece fresh ginger, sliced into matchsticks", "450g/1lb carrots, grated", "splash green ginger wine", "150g/5oz demerara sugar", "150ml/5fl oz white wine vinegar", "1 tsp ground cloves", "1 tsp ground cinnamon"], "serves": "1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry place the plain flour, butter, egg, seasoning and walnuts into a food processor and pulse until combined into a dough. Add a splash or two of milk if necessary to bring the dough together. Remove and roll the dough into a ball, then cover with cling film and place into the fridge to chill for two hours.", "Remove the dough from the fridge and cling film. Roll out on a clean floured surface to 2cm/1in thickness and cut out a round using a 15cm/6in plate as a guide.", "For the filling, place the new potatoes, cheese, spinach and red onions into a bowl. Season with salt and freshly ground black pepper and mix well. ", "Now place the potato mixture onto one half of the pastry. Fold over the other half to cover, crimp the edges to seal and brush with the egg wash. Place onto a baking sheet and place into the oven to bake for 20 minutes, or until crisp and golden.", "For the chutney, heat the oil in a frying pan over a medium heat. Add the onion, garlic, chilli and ginger and fry until soft. ", "Add the carrot and cook for ten minutes.", "Add the ginger wine and boil to reduce, until nearly all of the liquid has evaporated.", "Add the sugar, vinegar, cloves and cinnamon and simmer for 15-25 minutes, or until the liquid has reduced and the mixture is thickened.", "To serve, place the pasty on a plate with the chutney spooned alongside."]}, {"isVegetarian": false, "title": "Cheese and potato cakes with crisp parma ham, poached egg and tomato salsa", "url": "www_bbc_co_uk_food_recipes_cheeseandpotatocakes_85966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-made mashed potato", "100g/3½oz gruyère cheese, grated ", "50g/2oz self-raising flour", "1 free-range egg", "salt and freshly ground black pepper ", "1 tbsp olive oil", "25g/1oz butter", "1 beef tomato, seeds removed, chopped", "1 lime, juice and zest", "1 tbsp olive oil", "2 tbsp chopped fresh coriander", "salt and freshly ground black pepper", "3 slices parma ham, fried until crisp", "1 free-range egg, poached"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato cakes, place the mashed potato into a bowl with the cheese, flour and egg and mix well. Season with salt and freshly ground black pepper, then shape the mixture into three patties.", "Heat the oil and butter in a frying pan and fry the potato cakes for 3-4 minutes on each side, or until golden-brown.", "For the tomato salsa, place all of the salsa ingredients into a bowl and stir to combine.", "To serve, place the potato cakes onto a serving plate with the crisp parma ham and poached egg on top and the salsa spooned around the plate."]}, {"isVegetarian": true, "title": "Spinach mash", "url": "www_bbc_co_uk_food_recipes_cheeseandspinachmash_90409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 handfuls fresh spinach", "2 garlic cloves, chopped", "200g/7oz ready-made mashed potato"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and add the spinach and garlic. Cook for 2-3 minutes, or until the spinach has wilted. ", "Stir in the cooked mashed potato and cook for a further 3-4 minutes, or until warmed through. Serve."]}, {"isVegetarian": true, "title": "Cheese and spinach soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandspinachsouf_78027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "25g/1oz plain flour", "150ml/5fl oz milk", "100g/1¾oz Edam, grated", "100g/3½oz spinach ", "3 free-range egg yolks", "3 free-range egg whites"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a saucepan over a medium heat. Stir in the flour and cook for 30 seconds. Remove from the heat and gradually whisk in the milk.", "Bring to the boil and stir in the spinach and most of the cheese.", "Allow to cool slightly. Beat in the egg yolks and season well.", "In a large bowl whisk the egg whites to medium peak.", "Mix two large spoonfuls of egg to the milk mixture to slacken. Fold in the remaining egg whites and sprinkle with the Edam.", "Transfer to an oven-proof frying pan. Place in the oven and cook for 10 minutes.", "Serve the soufflé in the frying pan."]}, {"isVegetarian": true, "title": "Cheese and tarragon soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandtarragonsou_89196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["melted butter, for greasing", "4 tbsp finely grated parmesan cheese", "300ml/10fl oz milk", "1 bay leaf", "50g/2 oz butter", "50g/2 oz plain flour", "5 free-range eggs, separated", "1 tsp Dijon mustard", "2 tbsp chopped fresh tarragon leaves ", "100g/3½oz Gruyère cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6. ", "Brush the inside of a large soufflé dish with the melted butter and dust with the grated parmesan, shaking out any excess cheese.", "Bring the milk to the boil in a saucepan with the bay leaf, then remove from the heat and set aside.   ", "Melt the butter in a heavy-based saucepan and stir in the flour. Cook for 2-3 minutes, until the mixture turns a deep ivory colour and thickens. Pour in the warm milk, stirring or whisking until you have a smooth sauce that is free of lumps. Simmer gently, stirring from time to time, for about ten minutes.", "Remove the sauce from the heat and remove the bay leaf. Whisk in the egg yolks, one at a time, and stir in the mustard and tarragon leaves. Season with salt and freshly ground black pepper. Gently stir in the Gruyère, until melted and well combined.", "Beat the egg whites until soft peaks form when the whisk is removed from the bowl. Gently fold the egg whites into the cheese sauce with a large metal spoon, until just combined.", "Gently spoon the mixture into the buttered soufflé dish and bake in the oven for 25-30 minutes, until the soufflé has risen and is golden-brown on top.   ", "Remove from the oven and serve immediately."]}, {"isVegetarian": false, "title": "Cheese soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandtomatosouff_75726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp melted butter", "¼ red onion, chopped", "1 tbsp fresh chives, chopped", "1 tbsp fresh parsley, chopped", "3 tbsp butter", "1 tsp cornflour", "2tbsp plain flour", "100ml/3 ½oz milk", "35g/1¼oz Stilton cheese", "3 free-range egg yolks", "3 free-range egg whites"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven 200C/400F/Gas 6.", "For the soufflé mixture, place the melted butter in a pan with the red onion and cook for two minutes.", "Remove from the heat and add the chopped herbs and allow to cool for three minutes.", "For the white sauce, melt the butter and add the cornflour, plain flour, milk, cheese, salt and pepper and the egg yolks.", "Take off the heat and allow to cool for two minutes.", "For the egg whites, whisk the egg whites in a large bowl until they form stiff peaks.", "Fold the white sauce into the egg whites and add the onion mixture. Do not over mix.", "Grease two ramekin dishes and spoon the mixture into these.", "Place on a tray in the pre-heated oven for eight minutes.", "Serve the soufflés in the dishes straight away."]}, {"isVegetarian": true, "title": "Cheese, apple and sage tarts", "url": "www_bbc_co_uk_food_recipes_cheeseappleandsageta_85559", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour, plus extra for dusting", "100g/3½oz unsalted butter", "1 free-range egg", "2 tbsp water ", "1 tbsp olive oil", "½ onion, finely sliced", "1 tsp brown sugar", "50g/1½oz cheddar, grated ", "1 apple, cored and sliced", "4 fresh sage leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg and pulse again to combine. Add enough water to make the mixture come together into a dough.", "Turn the dough out onto a floured surface and lightly knead. Roll the dough out to ½cm/¼in thick and cut out two 18cm/7in circles.", "For the filling, heat the oil in a pan and gently fry the onion with the sugar until softened and slightly caramelised.", "Sprinkle the onion mixture over the tart bases, along with the grated cheese and the apple slices. Top with the sage leaves.", "Place the tarts onto a baking sheet and bake in the oven for ten minutes, or until golden-brown.", "To serve, place the warm tarts onto plates."]}, {"isVegetarian": true, "title": "Cheese, aubergine and olive enchiladas", "url": "www_bbc_co_uk_food_recipes_cheeseaubergineandol_85280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, peeled, chopped", "4 baby aubergines, finely chopped", "100g/3½oz tinned kidney beans, drained", "150g/5½oz tinned cherry tomatoes", "75g/2½oz kalamata olives, pitted, chopped", "1 flour tortilla, warmed", "50g/1¾oz cheddar cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the onion and aubergine and gently fry for two minutes. Add the kidney beans, tomatoes and olives and cook for three minutes.", "Lay a tortilla wrap out flat, fill with the kidney bean mix and roll up. Sprinkle with grated cheese and use a mini-blowtorch to \"grill\" the cheese until it has melted. (Alternatively, place the wrapped tortilla on a baking tray and place under a perheated grill, until the cheese has melted. Serve."]}, {"isVegetarian": true, "title": "Cheese baked with thyme", "url": "www_bbc_co_uk_food_recipes_cheesebakedwiththyme_79269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cheese in a box (such as Pont l'Évêque)", "1 tbsp fresh thyme leaves", "½ tbsp olive oil", "salt and freshly ground black pepper", "½ red romero pepper, seeds removed and chopped", "rustic white bread, broken up, to serve"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the cheese in a box on a baking sheet and sprinkle with the thyme leaves.", "Drizzle with olive oil and sprinkle with salt and freshly ground black pepper.", "Place in the oven and bake for 10-12 minutes, or until just beginning to melt.", "Remove from the oven and serve on a plate with the chopped pepper pieces and rustic bread pieces beside."]}, {"isVegetarian": false, "title": "Cheese-breaded turkey escalope with fried potatoes and sweet pepper sauce", "url": "www_bbc_co_uk_food_recipes_cheesebreadedturkeye_89182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crusts removed", "1 small handful fresh basil leaves", "55g/2oz mature cheddar, grated", "salt and freshly ground black pepper", "1 turkey escalope", "2 tbsp plain flour", "1 free-range egg, beaten", "1 tbsp olive oil", "25g/1oz butter", "25g/1oz butter", "1 tbsp olive oil", "150g/5½oz new potatoes, cooked, sliced", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 red pepper, finely chopped", "1 clove garlic, chopped", "1 tbsp honey", "25g/1oz butter", "splash water", "1 tbsp chopped fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the breaded turkey, place the bread, basil, cheddar, salt and freshly ground black pepper into a mini food processor and blend to fine breadcrumbs.", "Dredge the turkey escalope in the plain flour and shake off the excess, then dip into the beaten egg and finally into the breadcrumb mix. Pat gently to secure the breadcrumbs to the escalope, then shake off any excess. ", "Heat the olive oil and butter in a frying pan, add the turkey escalope and fry for 3-4 minutes on both sides, or until golden-brown all over and cooked through.", "For the fried new potatoes, melt the butter and oil in a frying pan, add the potatoes and season with salt and freshly ground black pepper. Fry for 2-3 minutes on both sides, or until golden-brown on all sides.", "For the sweet pepper sauce, heat the olive oil in a saucepan, add the pepper and garlic and lightly fry for 3-4 minutes, or until the pepper has softened. Stir in the honey, butter and a splash of water, then transfer to a mini food processor and blend until smooth.", "To serve, pile the fried new potatoes onto a serving plate, top with the breaded turkey escalope and drizzle around the sweet pepper sauce. Garnish with chopped fresh parsley and serve."]}, {"isVegetarian": false, "title": "Cheeseburger and fries", "url": "www_bbc_co_uk_food_recipes_cheeseburger_and_fries_06202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz beef steak mince", "2 tbsp vegetable oil", "25g/1oz beer mustard", "100g/3½oz mayonnaise", "8 gherkins, sliced", "4 beef tomatoes, sliced", "½ round lettuce, leaves separated", "1 red onion, sliced", "200g/7oz Monterey Jack cheese, grated or in slices", "4 brioche rolls", "500g/1lb 2oz chipping potatoes", "vegetable oil, for deep-fat frying", "1 vanilla pod, seeds removed", "500ml/18fl oz full-fat milk", "200g/7oz vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheeseburger, put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into four burger-shaped patties. Wrap the patties in cling film and place in the fridge for an hour.", "Heat a large frying pan and add the oil. Once hot, add the burgers and cook each side for 2-3 minutes. When cooked, set aside to rest.", "In a small bowl, mix the mustard with the mayonnaise.", "For the fries, preheat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the chips for 3-4 minutes, then drain on kitchen paper and season with salt.", "For the vanilla milkshake, place all the ingredients in a blender and blend until smooth. ", "Just before serving, pour the milkshake into glasses.", "To assemble the burger, place each patty in a brioche roll topped with the gherkins, sliced tomato, lettuce, a few onion slices, cheese and beer mustard mayonnaise.", "Place the burgers on serving plates and secure with a wooden skewer. Place the fries alongside and serve with the milkshakes. "]}, {"isVegetarian": true, "title": "Cheesecake with salted caramel popcorn, blackberry curd and gingernut crumble", "url": "www_bbc_co_uk_food_recipes_cheesecake_with_salted_18348", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz mascarpone cheese", "125ml/4fl oz double cream", "125ml/4fl oz plain yoghurt", "1 lemon, zest and juice ", "100g/3½oz blackberries", "1 large free-range egg", "1 lemon, zest and juice ", "1 tbsp caster sugar", "50g/1¾oz butter", "35g unsalted butter", "1 tbsp soft brown sugar", "35g/1¼oz plain flour", "½ tsp baking powder", "1 tsp ground ginger", "¾ tbsp golden syrup", "1 ball stem ginger in syrup, finely chopped", "50g/1¾oz caster sugar", "10g/1/3oz unsalted butter", "½ tsp sea salt", "½ tsp vanilla extract", "knob of butter", "drop rapeseed oil", "1 tbsp popcorn kernels"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the cheesecake, whisk together the mascarpone, cream, yoghurt, half of the lemon juice and all the zest. Spread into a dish and place in the fridge.", "Meanwhile, to make the blackberry curd, mash the blackberries in a bowl with a fork, and push through a sieve into a large saucepan. Add the egg, lemon zest, juice, sugar and butter. Place the pan over a medium heat. Stir until thick and then remove from the heat. Transfer to a clean bowl and place in the fridge.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with greaseproof paper.", "To make the ginger nut crumble, cream together the butter and sugar in a large bowl. Add the remaining ingredients and mix well. Place 12 heaped teaspoons of the mixture on the lined baking tray, allowing room for them to spread. Bake for 10 minutes and then leave to cool. Break into crumbs in a bowl.", "To make the salted caramel, place the sugar and 100ml/3½fl oz water in a saucepan placed over a high heat. Bring up to a temperature of 185C without stirring. (You can do this by eye – when the caramel has reached a lovely golden-brown colour, it is ready.)  Remove from the heat and carefully add the butter, salt and vanilla extract (the hot sugar will spatter and could burn you). Keep stirring until the caramel stops bubbling and spitting.", "To make the popcorn, heat the knob of butter and drop of oil in a large pan over a medium heat, add the popcorn kernels, cover with a lid and leave to pop. When the popcorn has finished popping; stir in the salted caramel.", "Layer the cheesecake mix in serving glasses with the blackberry curd on top. Decorate with the crumbled ginger nut and popcorn and serve."]}, {"isVegetarian": true, "title": "Cheesecake brownies", "url": "www_bbc_co_uk_food_recipes_cheesecake_brownies_01372", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesecake_brownies_01372_16x9.jpg", "ingredients": ["225g/8oz dark chocolate (minimum 70% cocoa solids)", "150g/5½oz unsalted butter", "3 free-range eggs", "225g/8oz caster sugar", "100ml/3½fl oz strong espresso", "100g/3½oz plain flour", "150g/5½oz full fat cream cheese", "50g/1¾oz caster sugar", "1 free-range egg", "½ orange, zest only"], "serves": "Makes 16 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease and line a 8in/20cm square cake tin.", "For the brownies, melt the chocolate and butter in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.) Remove the bowl from the pan and set aside to cool slightly.", "Whisk the eggs, caster sugar and coffee in a bowl until well combined. Sift in the flour and chocolate mixture and mix until well combined.", "For the cheesecake, beat the cream cheese, caster sugar, egg and orange zest until smooth.", "Spoon the brownie mixture into the cake tin then spoon the cheesecake mixture on top and use a knife to cut lines into the mixture to create a marble effect.", "Bake in the oven for 25-30 minutes, or until just set. Remove the tin from the oven, set aside to cool completely, then cut into squares"]}, {"isVegetarian": false, "title": "Cheese-crusted razor clams with garlic, chilli and lemon thyme", "url": "www_bbc_co_uk_food_recipes_cheesecrustedrazorcl_87656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz butter ", "1 tbsp fresh lemon thyme leaves", "2 leeks, finely chopped, trimmings reserved", "2 fennel bulbs, finely chopped, trimmings reserved", "1 red chilli, finely chopped", "3 garlic cloves, lightly crushed", "300ml/10½fl oz white wine", "1kg/2lb 2oz fresh razor clams, washed and drained", "110g/4oz fresh sourdough breadcrumbs", "20g/¾oz Pecorino cheese", "lime wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat a heavy-based frying pan until hot. Add 75g/2½oz of the butter, the lemon thyme, leeks, fennel, chilli and garlic and fry over a low heat until the vegetables are softened, but not browned.", "Heat a deep-sided frying pan with a lid and add the remaining 75g/2½oz of butter and the leek and fennel trimmings and fry for 2-3 minutes.", "Add the white wine, bring to the boil and cook to reduce by half the original volume.", "Add the razor clams. Cover with the lid and cook for 4-5 minutes, or until the clams are open and just cooked (discard any clams that haven't opened). Pour the contents of the pan into a sieve over a heatproof bowl. Reserve the cooked razor clams and discard the remaining sieve contents.", "Add 200ml/7fl oz of the cooking juices to the softened fennel, leek and chilli mixture and boil to reduce the liquid by half.", "Meanwhile remove the clam flesh from the shells. Slice the clam meat on an angle into 1cm/½in pieces, then add to the pan of reduced vegetable mixture.", "Wash the razor clam shells and place onto a baking sheet, then spoon the clam and vegetable mixture into the shells.", "Place the sourdough breadcrumbs and Pecorino into a food processor and blend to combine.", "Sprinkle the breadcrumb and cheese mixture over the filled shells then place under the grill and cook until the topping is golden-brown.", "Serve on plates with wedges of lime."]}, {"isVegetarian": true, "title": "Cheese, fennel and herb soup", "url": "www_bbc_co_uk_food_recipes_cheesefennelandherbs_85354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "½ onion, chopped", "½ potato, peeled, cut into 1cm/½in cubes", "1 bulb fennel, finely sliced", "150ml/¼ pint hot chicken stock (vegetarians can substitute vegetable stock)", "small handful fresh parsley, chopped", "1 free-range egg yolk", "4 tbsp double cream", "55g/2oz Lancashire cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a saucepan and gently fry the onion until softened but not coloured.", "Add the potato, fennel and chicken stock and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until the potato and fennel are tender. Remove from the heat and allow to cool slightly.", "Pour the soup into a blender along with the parsley, egg yolk, cream and cheese and blend until smooth. If necessary, return the soup to the saucepan and gently warm through.", "To serve, pour the soup into bowls."]}, {"isVegetarian": true, "title": "Cheese galette with balsamic gravy", "url": "www_bbc_co_uk_food_recipes_cheesegallettewithba_78830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz plain flour ", "2 tsp baking powder", "2 tbsp olive oil", "½ pint full-fat milk ", "150g/5½oz blue cheese", "2 tbsp white wine", "100ml/3½fl oz red wine", "55ml/2fl oz balsamic vinegar"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Place the flour, baking powder and oil into a food processor and blend together. ", "Add the milk and blend to form a smooth dough.", "Using a rolling pin on a floured surface, roll the pastry out to 2.5cm/1in thickness. Using a plate as a guide, cut out a 20cm/8in circle and place onto a non-stick baking sheet. Reserve some of the dough for later.", "Using the excess dough, roll eight small balls and place evenly around the outside of the dough circle to decorate.", "Crumble the blue cheese into the circle and drizzle with the white wine.", "Place into the preheated oven for 15 minutes, or until golden and cooked through. Remove from the oven and place on a large warm plate.", "Meanwhile, for the balsamic sauce, place the red wine and balsamic vinegar in a saucepan over a medium heat. Bring to the boil then simmer until the sauce becomes thick and glossy.", "To serve, pour the balsamic sauce around the cheese galette."]}, {"isVegetarian": true, "title": "Cheese fondue with tomato dippers", "url": "www_bbc_co_uk_food_recipes_cheesefonduewithtoma_80850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, thinly sliced", "100g/3½oz blue cheese", "100ml/3½fl oz white wine", "100ml/3½fl oz double cream", "1 tsp Dijon mustard", "1 tsp fresh thyme leaves", "12 cherry tomatoes", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the garlic, blue cheese, white wine and double cream into a pan over a medium heat. Heat for four minutes, until the cheese has melted, then add the Dijon mustard and thyme.", "Heat a griddle pan until smoking.", "For the tomato dippers, thread four cherry tomatoes onto a skewer and brush with olive oil. Repeat with two more skewers and then place onto the griddle pan to chargrill for two minutes on each side.", "To serve, place the cheese fondue in a bowl with the tomato dippers on the side."]}, {"isVegetarian": false, "title": "Cheese-glazed beef fillet Provençal", "url": "www_bbc_co_uk_food_recipes_cheeseglazedbeeffill_79565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 100g/3½oz beef fillet ", "2 tbsp olive oil", "1 garlic clove ", "sprig fresh thyme", "2 bay leaves ", "3 sprigs fresh chevril ", "2 sprigs fresh flatleaf parsley", "salt and freshly ground black pepper ", "2 Portobello mushrooms", "pinch ground cumin", "salt and cracked white pepper ", "1 tbsp olive oil ", "160g/5½oz baby spinach leaves", "3 tbsp vegetable stock", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 fresh plum tomatoes, de-seeded and finely chopped", "1 garlic clove, finely chopped", "100g/3½oz gruyere cheese, grated"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Roll up the beef fillets to form two cylinder shapes, then wrap them tightly in cling film to hold the shape. Place in the fridge for 1-2 hours.", "Remove the beef from the fridge and take off the cling film, taking care to keep the beef in a cylinder.", "Heat an ovenproof frying pan and add two tablespoons of the olive oil and add the garlic and herbs.", "Season the beef with salt and freshly ground black pepper, then place in the hot pan of garlic and herbs and sear on the top and bottom, until coloured.", "Transfer the pan to the oven and cook for 6-8 minutes, or until cooked to your liking. Remove from the oven and leave to rest, retaining the pan juices for later.", "Meanwhile, for the mushrooms, peel the Portobello mushrooms and place them in a small roasting tin. Season with the cumin, salt and cracked white pepper, then place in the oven to cook for ten minutes. ", "Meanwhile, for the spinach, heat another frying pan and add one tablespoon of olive oil, the spinach and the vegetable stock, and cook until the spinach has just wilted. Season with salt and freshly ground black pepper.", "For the tomatoes, heat a frying pan with the remaining one tablespoon of olive oil. Add the plum tomatoes and garlic and cook for 1-2 minutes. Season with salt and freshly ground black pepper.", "Preheat the grill to high.", "To serve, place one mushroom on each of two plates, topped with beef fillet, spinach, tomato and finishing with the gruyere.  Place under the grill for 30 seconds until the cheese is just melted. Drizzle the juices from the steak pan around."]}]