[{"isVegetarian": false, "title": "Baked Spanish risotto", "url": "www_bbc_co_uk_food_recipes_bakedspanishrisotto_70241", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedspanishrisotto_70241_16x9.jpg", "ingredients": ["250g/9oz cherry tomatoes", "1 red onion, finely chopped", "2 garlic cloves, finely chopped", "2 tbsp olive oil", "300g/10oz risotto rice", "4 chicken thigh fillets, halved", "200g/7oz chorizo, thickly sliced", "2 tsp chopped fresh rosemary", "1 litre/1¾ pints hot chicken stock", "pinch of saffron strands", "8 large, raw prawns", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Place the cherry tomatoes in a roasting tin and sprinkle over the red onion, garlic and olive oil. Roast for 20 minutes until the tomatoes are softened.", "Stir in the rice, chicken, chorizo, rosemary, chicken stock, saffron and some salt and pepper, mixing  well together. Return to the oven for 20 minutes.", "Stir in the prawns and return to the oven for a further 10 minutes until the rice is tender and the  chicken is cooked through."]}, {"isVegetarian": false, "title": "Baked pork spare rib chops with pears, potatoes, onions and Roquefort butter", "url": "www_bbc_co_uk_food_recipes_bakedspareribchopswi_89921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter, at room temperature ", "50g/2oz Roquefort cheese, crumbled ", "500g/1lb 2oz waxy potatoes, cut into 2mm thick slices ", "8 sprigs fresh thyme ", "6 tbsp olive oil ", "salt and freshly ground black pepper", "2 red onions, peeled, cut into 8 wedges each ", "6 small Conference pears, halved and cored ", "4 x 225g/8oz spare rib chops ", "50g/2oz soft dark brown sugar ", "110g/4oz watercress, picked ", "110g/4oz chicory, leaves separated ", "110g/4oz walnuts out of their shells, toasted ", "1½ tbsp red wine vinegar ", "½ tsp crème de cassis (optional)", "2 tbsp olive oil ", "6 tbsp walnut oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Roquefort butter, place the butter and Roquefort into a bowl and mash together with a wooden spoon. Chill in the freezer for ten minutes, then spoon onto a sheet of clingfilm and roll up into a sausage shape, twisting up the ends to seal. Place into the fridge to chill for one hour, or until firm. ", "Preheat the oven to 200C/390F/Gas 6.", "For the pork spare rib chops, place the potato slices into a roasting tin with the thyme and drizzle over half the olive oil. Season well with salt and freshly ground black pepper. Toss well to coat, then place the onions, pears (cut-side down) and pork chops on top. ", "Drizzle over the remaining oil, season again with salt and freshly ground black pepper, then toss lightly to coat in the oil.", "Place into the oven to cook for 15 minutes, or until the pork is lightly golden. Reduce the oven heat to 190C/375F/Gas 5, then remove the tin from the oven.", "Turn the chops over and turn over the pears so that they are cut-side up. Sprinkle the pears with the brown sugar, then return the tin to the oven. Roast for another 30-40 minutes, or until the pork is golden-brown and cooked through, the pears caramelised and the potatoes tender.", "For the salad, place the watercress, chicory and walnuts into a bowl. In a smaller bowl, whisk together the vinegar, cassis and oils, then season with salt and freshly ground black pepper. Drizzle the dressing over the salad, then toss well to coat. ", "To serve, spoon the pork chops, potatoes and pears onto four plates and place the salad alongside. Slice a knob of Roquefort butter and place over the top of the pork to melt."]}, {"isVegetarian": true, "title": "Baked stuffed aubergine with walnut and Roquefort", "url": "www_bbc_co_uk_food_recipes_bakedstuffedaubergin_71986", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedstuffedaubergin_71986_16x9.jpg", "ingredients": ["4 large aubergines", "2 garlic cloves, chopped ", "1 small white onion, diced", "6 tomatoes, diced", "1 small sprig of fresh rosemary", "1 small sprig of fresh thyme", "virgin olive oil", "salt and freshly ground black pepper", "60g/2½oz walnuts", "50g/2oz toasted fresh breadcrumbs", "200g/8oz vegetarian Roquefort cheese", "4 tbsp olive oil", "1 medium onion, very finely sliced", "1 garlic clove, coarsely chopped ", "1 x 400g tin good-quality tomatoes", "10 small fresh basil leaves, shredded", "fresh chopped oregano"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/440F/Gas 6.", "Cut the aubergines in half, leaving the tops on and score the surface of the flesh with a knife.", "Place on a baking tray cut-side up, drizzle with olive oil and season with salt and pepper. Bake for about 30 minutes or until soft.", "While the aubergines are cooking, gently fry the onions and garlic in oil for a few minutes. Add the tomatoes and herbs and cook to soften", "Remove the flesh from the roasted aubergines, reserving the skins to be stuffed later. Chop the aubergine flesh into small cubes.", "Add the aubergine flesh and the lightly chopped walnuts to the tomato mixture and season generously with salt and pepper. Place the mixture in the aubergine skins (if making in advance, you can refrigerate the aubergines at this stage).", " Crumble over the cheese and top with breadcrumbs. Return to the oven or place under a hot grill until the cheese is melted, the breadcrumbs crisp and the flesh warmed through.", "For the tomato sauce, heat the oil in a pan and fry the onion for five minutes. Add the garlic and fry for a further minute. Add the tomatoes and bring to the boil, add the chopped oregano reduce the heat and simmer for 30-40 minutes. Halfway through, add the shredded basil leaves.", "When it has finished cooking, add salt to taste, and blend to a smooth purée using a hand-held blender or food processor. The sauce keeps for a few days in the fridge, but is best if eaten when freshly made.", "Serve the hot aubergines with the hot tomato sauce on the side."]}, {"isVegetarian": true, "title": "Baked Vacherin Mont d'Or cheese with garlic bruschetta", "url": "www_bbc_co_uk_food_recipes_bakedvacherinmontdor_87921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz Vacherin Mont d'Or (in a wooden box)", "4 garlic cloves, sliced", "1 sprig fresh rosemary, cut into short lengths", "1 tbsp olive oil", "salt and freshly ground black pepper", "6 slices baguette", "2 tbsp olive oil", "2 garlic cloves, peeled and halved"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the baked Vacherin Mont d'Or, remove the lid from the cheese box. Make several slits in the top of the cheese with a sharp knife and place the garlic slices and rosemary sprigs into the slits.", "Drizzle with olive oil and season with a little salt and freshly ground black pepper.", "Place on a baking sheet and place in the oven for 8-10 minutes, until melted.", "For the garlic bruschetta, drizzle the slices of baguette with olive oil and rub with garlic.", "Heat a griddle pan and griddle the bread for two minutes on each side, or until charred. Remove from the heat and cut into fingers.", "To serve, place the cheese box onto a serving plate and dip the garlic bruschetta fingers into the molten cheese."]}, {"isVegetarian": true, "title": "Baked tomato and cheese soufflé with courgette and herb salad", "url": "www_bbc_co_uk_food_recipes_bakedtomatoandcheese_86037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 beef tomato, top sliced off and seeds scooped out", "1 free-range egg white", "½ free-range egg yolk", "30g/1oz Edam cheese, grated", "salt and freshly ground black pepper", "¼ courgette, grated", "handful fresh flatleaf parsley", "handful fresh basil", "handful fresh chives", "2 tsp olive oil", "1 tsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflé, preheat the oven to 200C/400F/Gas 6.", "Place the tomato on a non-stick baking tray.", "Whisk the egg white until stiff peaks form where the whisk is removed.", "Mix the egg yolk with the cheese and season to taste with salt and freshly ground black pepper.", "Gently fold the egg white into the cheese mixture and spoon into the tomato cavity.", "Bake in the oven for six minutes, or until risen and set.", "For the salad, place the courgette and herbs in a bowl.", "Mix together the oil and vinegar and stir through the salad.", "Serve the souffléd tomato immediately on a plate beside the salad."]}, {"isVegetarian": false, "title": "Bake-in-the-bag monkfish with preserved lemon couscous", "url": "www_bbc_co_uk_food_recipes_bakeinthebagmonkfish_86603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz couscous", "2 tsp ground cumin", "1 tsp cumin seeds", "6 spring onions, thinly sliced", "2 preserved lemons, washed, sliced, inner pulp removed, skinroughly chopped", "2 tsp chopped fresh coriander", "18 cherry tomatoes, quartered", "1.2kg/2lb 9oz monkfish fillet", "6 tbsp extra virgin olive oil", "1 tsp saffron threads", "2 small fennel bulbs, cut in half, core removed, sliced into 5mm slices", "salt and freshly ground black pepper ", "1 cucumber, peeled, seeded and sliced", "15 radishes, sliced thinly", "200g/7oz Greek yoghurt", "1 lemon, juice only", "½ tsp sumac (available from some supermarkets and Middle Eastern shops)", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the monkfish parcels, mix all the monkfish parcel ingredients, except the monkfish, olive oil, saffron and fennel, into a bowl.", "Place the monkfish fillet onto a chopping board and cut into 1cm/½in thick, angled slices (the idea is to have around 2-3 nice monk medallions per serving.", "Place a small pan with 180ml/6fl oz water onto the stove to boil. Once boiling, add the saffron and immediately remove from the heat.", "Cut out six large sheets of kitchen foil and lay them out onto a flat work surface. Fold each sheet in half to create a crease, then open out again.", "Pour two tablespoons of the olive oil into the couscous mixture and stir well so that all the grains are well coated in oil.", "Add the saffron water and stir again to combine.", "Spread a little of the olive oil into the centre of the front half of each of the open foil sheets. Divide the fennel equally among the six sheets, arranging onto the oil.", "Divide the couscous mixture outequally, placing on top of each of the piles of fennel.", "Top each portion of couscous mixture with 2-3 slices of monkfish. ", "Drizzle equal amounts of the rest of the extra virgin over each portion of monkfish and season each with salt and freshly ground black pepper.", "Bring the top edge of foil of each parcel over the monkfish and couscous pile to meet the bottom edge. Seal the edge by folding it over tightly three times and secure by pressing down firmly with your fingers. Turn each parcel 180 degrees and do the same to the opposite open side.", "Each parcel should be well-sealed on three sides, with just the top open. Carefully place each parcel at a 45 degree angle, so as not to disturb the arrangements inside.", "Carefully add three tablespoons of water into each bag, then seal the top edge of each parcel by the same folding process as before.", "Place the parcels onto two baking trays and transfer to the oven to bake for 15-20 minutes. If the parcels are in the oven at different heights, swap over the shelves halfway through.", "The parcels should have puffed up like pillows. Take the parcels out of the oven and place straight onto warmed plates.", "For the salad, combine all the salad ingredients together in a large clean bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, present the parcels on their plates and cut them open at the table. Serve the salad in its bowl and allow people to help themselves."]}, {"isVegetarian": true, "title": "Homemade Bakewell tart", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_58187", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_58187_16x9.jpg", "ingredients": ["200g/7oz plain flour", "100g/3½oz unsalted butter, cut into cubes", "pinch salt ", "2 tsp caster sugar", "3–4 tbsp cold water", "250g/9oz raspberries", "200g/7oz jam sugar with added pectin", "½ lemon, juice only", "4 free-range eggs, plus 2 yolks", "115g/4oz caster sugar", "150g/5½oz butter, melted and cooled", "150g/5½oz ground almonds", "1 tsp almond extract", "3 tbsp flaked almonds ", "icing sugar, for dusting"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. To make the pastry, sift the flour and salt into a bowl. Rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Stir in the sugar. ", "Add the cold water, a little at a time and, using a table knife, start bringing the pastry together. If the mixture is too dry to hold together, add just enough extra cold water to bring it together. Do not overwork or make the pastry too sticky or it will become tough. Shape into a disc, cover with cling film and chill in the fridge for at least 10 minutes.", "To make the raspberry jam, place the raspberries in a saucepan and heat gently until they start to soften. Add the sugar and lemon juice and heat gently, stirring, until the sugar has dissolved. Bring to the boil and cook for 8–10 minutes, stirring occasionally. Remove from the heat and allow to cool slightly.", "While still hot, carefully strain the jam through a sieve into a large bowl.Place the bowl on top of a bowl of iced water, stirring occasionally, until completely cooled. ", "Unwrap the pastry and roll out on a lightly floured work surface to a large circle about 3mm thick. Transfer the pastry on the rolling pin to a 23cm/9in loose-bottomed tart tin, pressing it into the corners and allowing excess pastry to hang over the edge. Chill in the fridge for 10 minutes. ", "Place the lined tart tin on a baking sheet. Prick the base with a fork several times, then line the pastry case with baking paper and ceramic baking beans or dried beans. Bake for 20 minutes. Remove the beans and paper and continue to bake the case for a further 5–8 minutes, until pale golden in colour. Leave to cool. Trim off the excess pastry with a sharp knife. Reduce the oven temperature to 180C/160C fan/Gas 4.", "To make the frangipane, beat the eggs, yolks and sugar together, then mix in the melted butter, ground almonds and almond extract. ", "Spread 8 tablespoons of the raspberry jam on the base of the pastry case, top with the frangipane to create an even layer that covers the jam. ", "Bake for 35 minutes, or until the filling is golden-brown and a skewer inserted in the centre comes out clean. Leave to cool. ", "Put the flaked almonds on a baking tray in a single layer and bake for 2–3 minutes, or until golden and aromatic. Tip them out onto kitchen paper to leave to cool. Garnish the tart with a light dusting of icing sugar and the toasted flaked almonds."]}, {"isVegetarian": true, "title": "Mary's easy Bakewell tart", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_90600", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_90600_16x9.jpg", "ingredients": ["175g/6oz plain flour ", "75g/2½oz chilled butter", "2-3 tbsp cold water", "1 tbsp raspberry jam ", "125g/4½oz butter ", "125g/4½oz caster sugar ", "125g/4½oz ground almonds", "1 free-range egg, beaten ", "½ tsp almond extract", "50g/1¾oz flaked almonds", "80g/2¾oz icing sugar", "2½ tsp cold water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough. ", "Roll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6 (180C fan).", "Line the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.  ", "For the filing, spread the base of the flan generously with raspberry jam. ", "Melt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.", "Bake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.", "Meanwhile, sift the icing sugar into a bowl. Stir in cold water and transfer to a piping bag. ", "Once you have removed the tart from the oven, pipe the icing over the top, giving an informal zig zag effect."]}, {"isVegetarian": true, "title": "Christmas Bakewell tart with cranberry frangipane", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_with_20773", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_with_20773_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "big pinch salt", "150g/5½oz cold butter, cubed", "100g/3½oz butter", "100g/3½oz caster sugar", "100g/3½oz ground almonds", "25g/1oz plain flour", "2 free-range eggs, beaten", "6 tbsp cranberry compôte (or good-quality cranberry sauce without vinegar) ", "40g/1½oz flaked almonds", "80g/3oz icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "For the pastry, mix together the flour and salt in a bowl. Rub in the butter until the mixture resembles fine breadcrumbs. Add 1–2 tablespoons cold water, or just enough to bring the pastry together into a soft, malleable dough. Wrap in cling film and refrigerate for 30 minutes.", "Roll out the dough on a lightly floured surface until large enough to line a 23cm/9in tart tin. It should be a few millimetres thick. Carefully transfer the dough into the tin and press, using a spare piece of dough, into every corner of the tin. Do not trim. Line the pastry with baking paper, then fill it with baking beans (or uncooked rice). Bake for 12 minutes. Remove the beans and paper and bake for a further 5 minutes.", "Meanwhile, for the frangipane filling, gently melt the butter and sugar together in a saucepan. Beat in the ground almonds, flour and eggs.", "Spread the pastry case with the cranberry compôte. Top with the frangipane mixture. Sprinkle over the flaked almonds. Bake for 25–35 minutes, or until golden-brown. Set aside to cool for at least 10 minutes. ", "For the icing, mix the icing sugar with enough lukewarm water to create a paste thick enough to coat the back of a spoon. Drizzle the icing over the tart and serve."]}, {"isVegetarian": true, "title": "Bakewell traybake", "url": "www_bbc_co_uk_food_recipes_bakewell_tarts_64777", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tarts_64777_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "125g/4oz cold unsalted butter, cut into cubes", "30g/1oz sugar", "2 free-range eggs", "2 tbsp milk (optional) ", "225g/8oz unsalted butter, softened", "225g/8oz caster sugar", "225g/8oz ground almonds", "3 free-range eggs ", "1 lemon, finely grated zest only ", "50g/2oz plain flour", "1 jar raspberry jam", "flaked almonds, for sprinkling"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the flour, butter and sugar into a food processor and pulse until the mixture resembles breadcrumbs. Add one of the eggs and pulse until the mixture comes together to form a rough dough. If the dough is too dry, add a bit of milk. Shape the dough into a ball and wrap in cling film. Chill in the fridge for 20 minutes. ", "Unwrap the dough and discard the cling film. Turn the dough out onto a floured work surface and roll out until large enough to line a 30x20cm/12x8in cake tin. Line the tin with the pastry, then place into the fridge to chill for a further 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6.", "Line the chilled tart case with a sheet of greaseproof paper and fill with baking beans. Bake for 15-20 minutes, or until the pastry is lightly golden-brown. ", "Remove the paper and beans and brush the pastry all over with the remaining beaten egg. Return the pastry to the oven for a further five minutes, until golden-brown. Remove the pastry from the oven and turn the oven temperature down to 180C/365F/Gas 4.", "For the filling, beat the butter and sugar together in a bowl until pale and fluffy. ", "Mix in the ground almonds, then crack in the eggs one at a time, beating well between each addition until smooth and creamy. Fold in the lemon zest and the flour.", "Spread some of the raspberry jam generously across the base of the pastry, leaving a 2.5cm/1in gap around the edge.", "Spread the filling mixture over the jam and sprinkle over the flaked almonds.", "Bake the tart for 20 minutes, or until the filling is set and golden-brown. Allow to cool in the tin before serving. ", "To serve, cut the tart into 5cm/2in squares. "]}, {"isVegetarian": true, "title": "Rustic Bakewell tart", "url": "www_bbc_co_uk_food_recipes_bakewellinabag_92015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["130g/4¾oz ground almonds", "100g/3½oz butter, softened", "100g/3½oz caster sugar, plus extra for dusting", "1 free-range egg, beaten, plus 1 free-range egg yolk", "few drops vanilla extract", "500g/1lb 2oz ready-made shortcrust pastry (use all butter if possible)", "plain flour, for dusting", "5 tbsp raspberry jam", "2 tbsp milk", "1-2 tbsp flaked or whole almonds"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a mixing bowl, blend together the ground almonds, butter and sugar using a wooden spoon.", "Add the whole beaten egg (but not the additional yolk) and the vanilla extract and beat until well combined. Cover and chill in the fridge for 2-3 minutes, or until the mixture has firmed up.", "Roll out the pastry onto a lightly floured work surface until it forms a square approximately 30cm/12in in diameter.", "Lightly dust a shallow, lipped roasting tray with flour. Gently gather the pastry up so that it is rolled loosely around your rolling pin, then lay it over the prepared roasting tray so that the edges of the pastry fall over the lipped edge with the middle of the pastry inside the tray.", "Spoon the jam into the centre of the pastry and spread it in an even layer over the pastry using the back of a spoon (leave 5cm/2in free at the edges of the pastry). ", "Spoon the chilled almond mixture on top of the jam and spread out in an even layer. ", "Draw the corners and edges of the pastry up and fold them over to form a rough pastry case around the filling mixture (the filling will still be visible in the middle).", "Mix together the remaining egg yolk and the milk, then brush the pastry lightly all over with the mixture. Sprinkle the tart filling with the caster sugar and flaked or whole almonds.", "Transfer the Bakewell tart, in the roasting tray, to the oven and bake for 25-30 minutes, or until the tart filling is firm and pale golden-brown and the pastry is crisp and golden-brown. ", "When the Bakewell tart is cooked, reduce the oven temperature to 160C/310F/Gas 3 and continue to cook the Bakewell tart for a further 10 minutes.", "Remove the tart from the oven and set aside to cool slightly before serving."]}, {"isVegetarian": true, "title": "Easy Bakewell tart", "url": "www_bbc_co_uk_food_recipes_bakewelltart_87541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "125g/4½oz unsalted butter", "30g/1oz sugar", "1 free-range egg, plus 1 extra, beaten, to glaze ", "2 tbsp milk, to bind (if needed) ", "225g/8oz butter, softened", "225g/8oz sugar", "225g/8oz ground almonds", "3 free-range eggs ", "1 lemon, finely grated zest only ", "50g/2oz plain flour", "jar cherry jam", "flaked almonds, for sprinkling"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, butter, sugar and egg into a food processor and pulse to combine. If necessary, add a little milk to help bring the mixture together.", "Turn the dough out onto a floured work surface and roll out until large enough to line a 26cm/10in tart tin. Carefully lift into the tin, then place into the fridge to chill for an hour.", "Preheat the oven to 200C/400F/Gas 6.", "Fill the tart case with a sheet of greaseproof paper weighed down with baking beans or rice. Bake the tart case blind in the oven for 15-20 minutes.", "Remove the paper and beans and brush the pastry all over with beaten egg. Return to the oven for a further five minutes, until golden-brown. Remove from the oven and turn the oven temperature down to 180C/350F/Gas 4.", "For the filling, beat the butter and sugar together in a bowl until pale and fluffy.  ", "Mix in the ground almonds, then crack in the eggs one at a time, beating well between each addition - don't worry if the mixture begins to split, just add a little of the flour.", "Fold in the lemon zest and the flour. ", "Spread some of the jam generously across the base of the pastry, leaving a 2.5cm/1in gap around the edge.", "Spread the filling mixture over the jam and sprinkle over the flaked almonds.", "Transfer to the oven and bake for 20 minutes, or until set and golden-brown. Allow to cool in the tin before serving in slices."]}, {"isVegetarian": true, "title": "Bakewell tart", "url": "www_bbc_co_uk_food_recipes_bakewelltart_89618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewelltart_89618_16x9.jpg", "ingredients": ["280g/10oz plain flour, plus extra for dusting", "1 small free-range egg, beaten", "1 free-range egg yolk", "165g/5¾oz unsalted butter", "65g/2½oz caster sugar", "pinch salt", "30g/1oz ground almonds", "300g/10½oz ground almonds", "130g/4¾oz caster sugar", "6 free-range eggs, beaten", "splash almond essence", "3 tbsp raspberry jam", "25g/1oz flaked almonds"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, place the flour, salt, sugar, butter and almonds into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the eggs and egg yolk one at a time and pulse until a smooth dough is formed.", "Wrap the dough in cling film and chill in the fridge for half an hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Grease and flour a 23cm/9in loose-bottomed tart tin.", "Unwrap the chilled pastry and roll out onto a cold, floured work surface. (NB: this is a very 'short' pastry and at first will be difficult to handle).", "Line the tart tin with the pastry and trim off any excess. Prick the base with a fork, then cover the pastry lightly with some baking parchment. Cover the parchment with baking beans or uncooked rice and place into the oven to bake blind for 15 minutes.", "Remove from the oven and remove the baking beans or rice and the baking parchment and set aside to cool. If the pastry base is still a little raw, return to the oven for a minute or two to dry out.", "Reduce the oven temperature to 165C/145C Fan/Gas 2.", "Meanwhile, for the filling, place the ground almonds and caster sugar into a bowl and mix well.", "Add the beaten eggs and almond essence and mix well.", "When the pastry has cooled spread a generous layer of raspberry jam onto the pastry base.", "Pour the filling mixture over the raspberry jam to fill the pastry case.", "Top with flaked almonds, then bake in the oven for 25-30 minutes, or until the filling is baked through and golden-brown all over.  ", "Remove from the oven and allow to cool. Serve warm or cold."]}, {"isVegetarian": true, "title": "Baklava", "url": "www_bbc_co_uk_food_recipes_baklava_80243", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baklava_80243_16x9.jpg", "ingredients": ["18 sheets ready-made filo pastry (unwrap and keep under a damp tea-towel until you are ready to use)", "150g/5oz unsalted butter, plus extra for greasing", "200g/7oz mixed pistachios and walnuts, roughly chopped", "2 tbsp granulated sugar", "1 tsp ground cardamom", "300g/10½fl oz granulated sugar", "250ml/9fl oz water", "1 tbsp lemon juice", "1 tbsp orange blossom water"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease a 17cm x 28cm (11in x 7in) baking tray with butter.", "Melt the remaining butter in a saucepan over low heat or in a microwave. ", "Lay 10 sheets of filo pastry, one at a time, into the tray, brushing each sheet with butter before adding the next. ", "In a clean bowl, mix together the nuts, sugar and cardamom and spread the mixture over the pastry in the tray. ", "Layer up the remaining sheets on top of the nut mixture, brushing each sheet with butter, as before. ", "Using a sharp knife, cut a criss-cross pattern into the top layers of the pastry. ", "Place baklava in the preheated oven for approximately 20 minutes, then decrease the oven temperature to 150C/300F/Gas 2 and cook for an additional half hour to 40 minutes, or until the pastry is slightly puffed and golden on top. Do not allow the top to burn. Remove and allow to cool slightly.", "For the syrup, heat the sugar, water, lemon juice and orange blossom water in a small, heavy-bottomed saucepan and cook over a medium heat until the sugar has melted and a syrup is formed. (This will take about 20 minutes or so.)", "Pour the syrup into the slits in the baklava and leave to cool. Cut into small diamond-shaped pieces and serve."]}, {"isVegetarian": true, "title": "Baklava bites", "url": "www_bbc_co_uk_food_recipes_baklava_bites_92701", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baklava_bites_92701_16x9.jpg", "ingredients": ["140g/5oz pistachio kernels", "20g/¾oz caster sugar", "½ tsp ground cinnamon", "4 sheets readymade filo pastry ", "cornflour, for dusting ", "75g/2½oz unsalted butter, melted", "120g/4oz clear honey  ", "25g/1oz caster sugar", "½ lime, zest only", "1 cinnamon stick", "2 limes, zest removed in long, thin strips using a canelle knife ", "50g/1¾oz pistachio kernels, halved"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, put the pistachios, sugar and cinnamon in a food processor and pulse until finely chopped (don’t to over chop as it will turn into a paste). Set the mixture aside in a bowl.", "Preheat the oven to 220C/200C Fan/Gas 7. ", "For the pastry, lightly dust a work surface with cornflour and cut the sheets of filo into 24 x 5cm/2in squares. ", "Take one square, dust off any excess cornflour and brush with melted butter. Set another square on top at a 45 degree angle and apply more butter. Transfer to a 24-hole mini muffin tin, gently pressing the pastry into a hole. Repeat to fill all the holes.", "Fill each pastry case with the filling, but don’t compress the mixture as this will prevent the syrup being absorbed properly later. Bake for about 14 minutes, or until the pastry is crisp and golden-brown. ", "Meanwhile, make the syrup. Add the honey, sugar, lime zest, cinnamon and 55ml/2fl oz water to a small saucepan set over a medium heat. Bring to the boil then simmer until the syrup is thick enough to coat the back of a spoon (about 15 minutes). Remove from the heat and carefully strain the syrup (boiling sugar is very hot, so take care not to burn yourself) and immediately pour it over the hot baklava bites as they come out of the oven.", "For the decoration, place strips of lime zest and a pistachio on each baklava bite. Serve warm or cold."]}, {"isVegetarian": false, "title": "Balsamic and honey-glazed steak with spinach, spicy potatoes and rosemary oil", "url": "www_bbc_co_uk_food_recipes_balsamicandhoneyglaz_84282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rump steak", "1 tbsp olive oil", "3 tbsp balsamic vinegar", "3 tbsp clear honey", "1 potato, peeled, cut into 1cm/½in slices, blanched", "1 tbsp olive oil", "2 tbsp olive oil", "1 sprig fresh rosemary ", "25g/1oz unsalted butter", "1 tbsp olive oil", "55g/2oz spinach ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub the steak with the oil and season with salt and freshly ground black pepper on both sides. ", "Heat a frying pan until smoking. Add the beef  and fry for two minutes on each side.", "Add the balsamic vinegar and reduce by half.", "Add the honey and cook for a further minute. Remove the beef rest for 2-3 minutes and then slice.", "For the potatoes, heat the olive oil in an ovenproof frying pan. Add the potato slices and fry for two minutes on each side, until crisp and golden. Season with salt and freshly ground black pepper and transfer to the oven to roast for five minutes.", "For the rosemary oil, gently heat the olive oil and rosemary in a frying pan for 1-2 minutes, then remove from the heat and leave to infuse for five minutes.", "For the spinach, melt the butter with the olive oil in a large pan, then add the spinach. Cook until the spinach has wilted down, then season, to taste, with salt and freshly ground black pepper. Squeeze out the excess moisture and place onto a plate.", "Serve the sliced beef with the spinach and drizzle the pan juices over the top. Arrange the potatoes alongside and spoon over some of the rosemary oil."]}, {"isVegetarian": true, "title": "Balinese Rice Pudding", "url": "www_bbc_co_uk_food_recipes_balinesericepudding_93363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz black glutinous rice (available from some Asian grocers), washed", "170g/6oz palm sugar, grated", "2 pandan leaves, shredded, or 2 drops pandan or vanilla essence (available from some Asian grocers)", "450ml/15¾fl oz coconut milk", "pinch of salt", "fresh coconut, to garnish"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the glutinous rice in water overnight.", "Drain the rice, and place in a saucepan with 1.5 litres/2 pints 12¾oz of water. Heat the mixture until boiling and continue to cook for 20-25 minutes, or until the rice is tender.", "Stir the sugar and one of the pandan leaves into the rice and continue to cook for another 5-7 minutes. Set aside to cool.", "Meanwhile, heat the coconut milk, the remaining pandan leaf and the salt in a saucepan until the mixture thickens.", "To serve, remove the pandan leaves from the rice and the coconut milk. Spoon the cooked black rice into each of 6 serving bowls. Pour over the coconut milk and garnish with the fresh coconut."]}, {"isVegetarian": false, "title": "Balsamic glazed lamb with marinated courgette ribbons", "url": "www_bbc_co_uk_food_recipes_balsamicglazedlambwi_90382", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb leg steak", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp balsamic vinegar", "1 courgette, sliced into ribbons with a potato peeler", "2 tbsp white wine vinegar", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp chopped fresh mint", "1 tbsp chopped fresh dill", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, brush the meat with the oil and season well with salt and freshly ground black pepper. Heat an ovenproof griddle pan until smoking, then chargrill the lamb for 3-4 minutes, or until golden-brown. Turn the lamb over, add the balsamic vinegar and cook for 3-4 minutes, or until the vinegar has reduced to a sticky consistency and the lamb is cooked to your liking.", "For the courgette, place all of the courgette ingredients in a bowl and toss well to coat. Allow to marinate for ten minutes. ", "To serve, arrange the courgette ribbons on a serving plate. Slice the lamb and place on top of the courgette."]}, {"isVegetarian": false, "title": "Balsamic-glazed sesame salmon with spicy cherry tomatoes and spinach", "url": "www_bbc_co_uk_food_recipes_balsamicglazedsesame_83963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/balsamicglazedsesame_83963_16x9.jpg", "ingredients": ["175g/6oz salmon fillet", "sea salt and freshly ground black pepper", "1 tsp olive oil", "1 tbsp balsamic vinegar", "1 tsp honey", "1-2 sesame seeds", "1 tbsp olive oil", "large handful of spinach", "½ 400g/14oz can cherry tomatoes", "½ tsp dried chilli flakes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Season the salmon fillet with sea salt and freshly ground black pepper. Heat the oil in an frying pan add the salmon skin-side down and cook for 2minutes, then turn and cook for a further minute. Pour over the vinegar and continue to cook for 2 more minutes.", "Transfer the salmon to a grill pan lined with foil, skin side-down. Drizzle over the honey and sprinkle with the sesame seeds, then place under the grill and cook for 3-4 minutes, or until cooked through.", "Meanwhile, for the tomatoes, heat the oil in a large frying pan. Add the spinach and gently fry for two minutes. Add the tomatoes, chilli flakes and extra oil and allow to simmer and reduce for 2-3 minutes, until thickened. To serve, place the spinach onto a warm plate and top with the salmon. Pour over the pan juices."]}, {"isVegetarian": false, "title": "Balsamic, maple and molasses-dipped roast lamb", "url": "www_bbc_co_uk_food_recipes_balsamicmapleandmola_86191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["splash olive oil ", "1 red onion, chopped ", "3 garlic cloves, crushed", "½ (75cl) bottle red wine ", "100ml/3½fl oz balsamic vinegar ", "1 tbsp butter ", "3 tbsp honey ", "1 tbsp molasses ", "3 tbsp maple syrup ", "small handful rosemary, chopped ", "small handful thyme, chopped ", "3 garlic cloves, crushed", "sea salt and freshly ground black pepper ", "splash olive oil ", "1 x 2kg/4lb 6oz leg of lamb ", "1-2 sprigs rosemary (optional)", "1-2 sprigs thyme (optional)", "sea salt and freshly ground black pepper ", "splash olive oil ", "½ onion, finely chopped ", "all the lamb marinade and pan juices ", "½ (75cl) bottle red wine ", "lamb stock, if needed ", "knob butter (if necessary)", "1 tsp flour (if necessary)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the liquid marinade, heat the olive oil in a large saucepan over a low heat. Add the red onion and garlic and cook until softened.", "Add the remaining liquid marinade ingredients and simmer until the mixture takes on a slightly syrupy consistency. Leave to one side. ", "For the dry marinade, crush the rosemary, thyme and garlic in a pestle and mortar, along with sea salt and freshly ground black pepper. Add a splash of olive oil.", "Run the lamb under cold water and pat dry with kitchen paper. Place the lamb on a baking tray.", "Using a sharp knife, make incisions in the lamb, deep enough to pierce the fat, but without cutting through the flesh. ", "Push pinches of the dry marinade down into the incisions in the lamb, reserving a small amount. You can use the handle of a teaspoon to push the marinade into the lamb, or alternatively use your fingers. ", "Pour over the liquid marinade, taking care to cover all the lamb. Sprinkle over the remaining dry marinade. Cover the lamb with cling film and set aside. ", "If you like, you can drop in a sprig or two of rosemary or thyme to the marinade surrounding the lamb. Leave the lamb overnight (or about two hours if you don't have time).", "When you are ready to cook the lamb, preheat the oven to 220C/400F/Gas 7. Spoon the marinade surrounding the lamb out of the tray and into a bowl. Sprinkle the lamb with more sea salt and freshly ground black pepper to taste.", "Place the lamb in the preheated oven and roast for 20 minutes.", "After 20 minutes, reduce the temperature to 180C/350F/Gas 4. At 30-40 minute intervals, remove the tray from the oven and baste the lamb with the marinade liquid in the tray and any reserved liquid from the bowl.", "After two hours coking time, remove the lamb from the oven and let it rest in a warm place for at least ten minutes before carving.", "For the gravy, heat the olive oil in a pan and add the onion. Cook until the onion is softened, but not coloured. Add what is left from the lamb marinade in the bowl, any juices that have collected in the tray and the wine. If you feel there is not enough liquid, add some lamb stock.", "Boil the gravy vigorously for a few minutes and then turn down and simmer until you are ready to serve - the liquid should reduce and thicken. If the gravy appears too thin, make a paste in a small bowl by mixing together a small amount of butter and flour with your fingers. Whisk the paste into the simmering gravy to thicken the gravy.", "Serve the lamb in slices with the gravy poured over."]}, {"isVegetarian": false, "title": "Baltic crab salad", "url": "www_bbc_co_uk_food_recipes_balticcrabsalad_88827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "125ml/4½oz extra virgin olive oil", "1 lemon, juice only", "75g/3oz fresh brown crabmeat", "400g/14oz fresh white crabmeat ", "1 tbsp finely chopped fresh chervil", "1 tbsp finely chopped fresh dill", "1 dill cucumber, finely chopped", "1 tsp baby capers, rinsed and drained ", "2 tbsp celery, finely sliced", "200g/7oz cooked crayfish tails, peeled ", "4 fresh chervil sprigs", "2 duck eggs, soft boiled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, crack the egg into a bowl and whisk until light and foamy. Gradually add the olive oil, whisking constantly (the dressing should have a creamy frothy consistency). Season, to taste, with salt and freshly ground black pepper, then add the lemon juice.", "Place the brown crabmeat into a sieve and push through any liquid into the dressing. Stir well to combine.", "For the salad, place the white crabmeat into a clean bowl. Add the chervil, dill, dill cucumber, capers and celery and mix gently.", "Spoon in a little of the dressing, just enough to coat, and stir carefully to combine.", "Place a chefs' ring into the middle of each of four plates. Spoon equal quantities of the crabmeat mixture into the ring and gently press down. Continue to fill each ring by about two thirds.", "Arrange a layer of crayfish tails on top of each ring of crabmeat, then spoon over a little more dressing.", "Garnish each layer of crayfish tails with a chervil sprig, then lift away each chefs' ring.", "To serve, cut the duck eggs in half and place a half alongside each stack. Spoon the remaining dressing around and over the top of the stacks."]}, {"isVegetarian": false, "title": "Balsamic tomato chicken with roast potatoes", "url": "www_bbc_co_uk_food_recipes_balsamictomatochicke_87753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5oz baby new potatoes, boiled until tender, drained", "½ skinless chicken breast", "115g/4oz cherry tomatoes", "dash dark soy sauce ", "splash balsamic vinegar", "1 garlic clove, lightly crushed", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. ", "Place half of the olive oil into a small roasting tin and place into the oven for five minutes to heat.", "Place the boiled new potatoes into the roasting tin with the heated oil. Season, to taste, with salt and freshly ground black pepper and return to the oven to roast for 10-15 minutes, until golden brown.", "Meanwhile, heat a heavy-based ovenproof frying pan. Add the remaining olive oil to the pan, then add the chicken breast. Season, to taste, with salt and freshly ground black pepper, and cook for 1-2 minutes on each side, until light golden-brown all over.", "Add the cherry tomatoes and drizzle over the soy sauce and balsamic vinegar. ", "Add the garlic clove and transfer to the oven to roast for 10-15 minutes, or until the chicken is completely cooked through and the cherry tomatoes are beginning to burst.", "To serve, place the balsamic tomato chicken onto a warmed plate with the roast potatoes alongside."]}, {"isVegetarian": false, "title": "Banana and blueberry ice cream", "url": "www_bbc_co_uk_food_recipes_banana_and_blueberry_ice_01903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, juice only", "125g/4½oz mascarpone, at room temperature", "6 tbsp icing sugar", "12 blueberries, plus extra to serve", "1 ripe banana, mashed", "wafer biscuits, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix together the lemon juice and mascarpone until well combined. ", "Stir in the icing sugar, then the blueberries and mashed banana.", "Transfer the ice cream mixture to a freezeable, lidded container. Freeze for at least two hours, or until solid.", "To serve, scoop the ice cream into bowls and sprinkle with blueberries. Serve with a wafer biscuit."]}, {"isVegetarian": true, "title": "Banana and chocolate chip loaf", "url": "www_bbc_co_uk_food_recipes_banana_and_chocolate_74784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_and_chocolate_74784_16x9.jpg", "ingredients": ["1 ripe banana (peeled weight 100g/4oz) ", "1 tbsp milk", "50g/2oz soft butter or baking spread", "75g/3oz plain flour", "75g/3oz caster sugar", "½ tsp bicarbonate of soda", "½ tsp baking powder", "1 free-range egg", "50g/2oz dark chocolate chips", "50g/2oz dark chocolate"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 160C/325F/Gas 3.  Grease and line a 450g/1lb loaf tin with non-stick baking parchment.", "Use a fork to mash the peeled banana in a mixing bowl.  Add the remaining cake ingredients (except the chocolate chips) and beat with an electric hand whisk until combined and smooth.", "Stir in the chocolate chips and spoon the mixture into the prepared loaf tin.  Level the top.", "Bake for 40-45 minutes or until well risen, shrinking away from the sides of the tin and golden-brown.", "Set aside to cool for 10 minutes, then remove from the tin and leave to cool on a wire rack. ", "For the decoration, break the chocolate into small pieces and add to a heatproof bowl.", "Melt the chocolate in the bowl over a pan of simmering water (ensuring that the bowl does not touch the water). Stir regularly, until almost completely melted, then remove from the heat. The heat of the bowl will melt any remaining lumps. ", "Spoon the melted chocolate into a piping bag and pipe zig-zags across the top of the loaf.  Set aside for the chocolate to set.  Slice and serve."]}, {"isVegetarian": false, "title": "Banana and chocolate parachute parcels", "url": "www_bbc_co_uk_food_recipes_banana_and_chocolate_84652", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ small ripe banana, peeled, mashed until smooth", "1 tsp chocolate drops", "2 sheets filo pastry", "3-4 tsp vegetable oil"], "serves": "Makes 2 parcels", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, mix together the mashed banana and chocolate drops. Set aside.", "Lay one square of filo pastry onto a work surface and fold it in half to make a rectangle. Cut away the folded edge using scissors or a sharp knife to create two rectangles. ", "Fold each rectangle in half again to make two squares. Cut off the folded edges to create four squares.", "Repeat the process with the remaining sheet of filo pastry to create eight filo squares.", "Grease two of the holes in a muffin tray with vegetable oil using a pastry brush. Push one pastry square into the bottom of each hole, allowing the corners to point upwards. Brush the pastry squares with a little more oil. ", "Repeat the process with the remaining pastry squares, making sure the corners point up in different places for each layer. There is no need to grease the top layer of pastry. ", "Divide the chocolate and banana mixture equally between the two filo-lined muffin holes. ", "Gently twist the corners of each pastry parcel together to seal. Bake in the oven for 12-15 minutes, or until the pastry is crisp and golden-brown."]}]