[{"ingredients": ["2 caballas frescas", "1 limón, cáscara y jugo solamente", "aceite de oliva", "600g / 1lb 5oz nuevas patatas", "1 cucharadita de mostaza integral", "1 cucharada de vinagre de vino blanco", "1 gran bulbo de hinojo, finamente cortado", "1 cebolla roja, finamente rebanada", "pequeño racimo de perejil flatleaf, más o menos picado", "sal y pimienta negra recién molida"], "method": ["Precalentar una parrilla a fuego medio-alto.", "Filete la caballa y quite todas las costillas. Puede pedirle a su pescadero que haga esto por usted.", "Sazonar bien la caballa, exprimir unas gotas de jugo de limón y una pizca de ralladura sobre cada filete, y rociar con aceite de oliva.", "Coloque debajo de la parrilla, con la piel hacia arriba, durante cinco minutos. Después de cinco minutos, dele la vuelta para dorar la carne que ya estará casi cocinada y solo necesitará uno o dos minutos. Reservar para descansar", "Para hacer la ensalada, hierva las papas hasta que estén firmes pero cocidas, y córtelas a la mitad. Póngalos en un tazón para mezclar con un chorrito de aceite de oliva, el resto del jugo de limón y la ralladura, y la mostaza y el vinagre.", "Mezcle bien, luego agregue la cebolla finamente rebanada y el hinojo. Agregue una buena cantidad de perejil y sazone bien.", "Divida la ensalada entre cuatro platos para formar un montículo. Coloque los filetes de caballa encima y vierta los jugos del pescado y el fondo de la ensaladera."], "url": "www_bbc_co_uk_food_recipes_grilledmackerelwithp_73663", "title": "Caballa a la plancha con mostaza de patata y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 hongos Portobello", "100g / 3½oz de queso de cabra suave", "1 ramita de tomillo, solo hojas", "2 cucharaditas de miel", "pimienta negra recién molida", "½ diente de ajo, finamente cortado", "Mitades de nuez 30g / 1oz", "4 remolachas cocidas pequeñas, picadas", "¼ de cebolla, finamente picada", "puñado de perejil fresco, picado", "2 cucharaditas de vinagre balsámico", "2 cucharadas de aceite de oliva", "Mitades de nuez 30g / 1oz, picadas"], "method": ["Precalentar la parrilla a mediano.", "Para los champiñones a la parrilla, caliente el aceite de oliva en una sartén a prueba de horno y fría los champiñones en ambos lados durante 2-3 minutos.", "Divida el queso de cabra por igual entre los champiñones y espolvoree sobre el tomillo, la miel, la pimienta negra, el ajo y las nueces. Coloque debajo de la parrilla y cocine por 2-3 minutos, o hasta que el queso se derrita y burbujee.", "Para la salsa de remolacha y nuez, coloque todos los ingredientes de la salsa en un tazón grande y mezcle bien.", "Para servir, coloque los champiñones a la parrilla en platos para servir con una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_grilledmushroomswith_85581", "title": "Champiñones a la parrilla con queso de cabra y salsa de remolacha y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledmushroomswith_85581_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pera roja, sin corazón y cortada en 3 rebanadas gruesas", "Halloumi 150 g / 5½ oz, cortado en 3 rodajas gruesas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "½ limón, solo jugo", "100 g / 3½ oz de hojas de espinaca", "1 cucharada de cebolla roja, finamente picada", "sal y pimienta negra recién molida"], "method": ["Caliente una sartén hasta que fume. Agregue las rodajas de pera y el chargrill durante un minuto en cada lado, luego retírelos y déjelos a un lado.", "Frote el halloumi con un poco de aceite de oliva, luego sazone ambos lados con sal y pimienta negra recién molida. Coloque el halloumi en la sartén de la plancha caliente y déjelo reposar de 1 a 2 minutos por cada lado, hasta que se formen líneas doradas de la parrilla en el queso, luego retírelas y déjelas a un lado.", "En un tazón grande, coloque la espinaca y la cebolla. Agregue el aceite restante y el jugo de limón y mezcle para cubrir, luego sazone con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada en el medio de un plato grande y sirva la pera en las rodajas de halloumi en tres montones."], "url": "www_bbc_co_uk_food_recipes_grilledpearandspinac_83606", "title": "Ensalada de espinacas y peras a la plancha con halloumi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 peras cómicas", "150g / 5½oz de berro", "110g / 4oz stilton", "Mitades de nuez 30g / 1oz", "½ baguette", "15g / ½oz de perejil picado", "½ limón, solo jugo", "1½ cucharada de aceite de nuez", "1½ cucharadas de aceite de oliva", "½ cucharadita de mostaza", "1 cucharada de vinagre de vino blanco", "una pizca de azúcar", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 190 ° C / 375 ° F / Gas 5.", "Primero caliente una sartén antiadherente hasta que esté muy caliente. Corta la pera por la mitad y quita el núcleo. Cepille la carne de pera con jugo de limón. Cuando la sartén esté caliente, coloque la pera en la sartén de la plancha y cocínela durante 2-3 minutos. Da la vuelta y cocina el otro lado. Cuando la pera esté cocida y bien marcada, sáquela de la sartén.", "Corta el pan en tiras largas y colócalo en la bandeja del horno. Rocíe con un poco de aceite de oliva, sazone con sal. Hornee durante 5 minutos hasta que estén crujientes y secos, pero no demasiado marrones.", "Coloque el berro en el plato de servir y salpique las peras alrededor. Rompa el queso en pedazos y colóquelo en la parte superior. Espolvorea sobre las nueces y el perejil.", "Mezcle todo el aderezo en un tazón y sazone. Agregue las tiras de pan a la ensalada. Rocíe sobre el aderezo y sirva."], "url": "www_bbc_co_uk_food_recipes_grilledpearwatercres_14534", "title": "Ensalada de pera, berros y nueces a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vinagre de vino blanco 150ml / 5fl oz", "90ml / 3½fl oz mirin (disponible en los supermercados asiáticos)", "50 g / 2 oz de azúcar en polvo", "pizca de sal", "12 chalotes tailandeses, en rodajas finas (disponibles en los supermercados asiáticos)", "75g / 3oz de frijoles edamame, blanqueados (disponibles en los supermercados asiáticos)", "6 cucharadas de hojas de cilantro fresco picado", "3 cucharadas de hojas de menta fresca picada", "2 chiles verdes, finamente rebanados", "2 x 500g / 1lb 2oz poussin", "1 cucharada de jengibre fresco rallado", "2 dientes de ajo picados", "1 cucharada de chalote finamente picado", "1 cebolla de primavera, más o menos picada", "2 cucharadas de vino de ciruela (disponible en los supermercados asiáticos)", "Salsa de barbacoa yaki niku de 110 ml / 4 fl oz (disponible en los supermercados asiáticos)", "2 cucharaditas de salsa teriyaki (disponible en los supermercados asiáticos)", "½ cucharadita de ao nori (disponible en los supermercados asiáticos)", "25ml / 1fl oz de aceite de oliva", "75g / 3oz mugi miso (disponible en los supermercados asiáticos)", "4 ume shu ciruelas, del vino de ciruela (disponible en los supermercados asiáticos)"], "method": ["Para la ensalada de pepinillos, coloque el vinagre, el mirin y el azúcar en una sartén a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos, o hasta que el azúcar se disuelva.", "Agregue los chalotes tailandeses y retire del fuego. Dejar encurtir durante dos horas a temperatura ambiente.", "Escurra las chalotas del líquido, reservando la solución de salmuera para el aderezo.", "Coloque los chalotes tailandeses en vinagre, los frijoles edamame, el cilantro, la menta y el chile en rodajas en un tazón limpio. Agregue dos cucharadas de la solución de pepinillo y mezcle bien.", "Para el poussin, usando tijeras de carne o un cuchillo afilado y pesado, corte cada poussin en cuatro pedazos y colóquelos en un tazón grande.", "Coloque todos los ingredientes poussin restantes, excepto las ciruelas, en un procesador de alimentos y mezcle hasta obtener una pasta homogénea.", "Corta bastante las ciruelas y agrega a la pasta de adobo.", "Vierta el adobo sobre el pollo y coloque en la nevera para marinar durante una hora.", "Retire los poussins del refrigerador y caliente la parrilla a su nivel más alto.", "Caliente una sartén grande hasta que esté caliente, luego agregue las piezas de poussin, con la piel hacia abajo, y cocine durante 3-4 minutos. Voltee las piezas de poussin y cocine por otros 3-4 minutos.", "Transfiera las piezas de poussin a una bandeja de parrilla forrada con papel de aluminio y hilvane con cualquier adobo restante.", "Coloque debajo de la parrilla y cocine durante 12-15 minutos, rociando 2 o 3 veces con el adobo durante la cocción, hasta que estén cocidos y caramelizados. Pruebe la carne perforando con un pincho en la parte más gruesa del muslo. Si los jugos salen limpios, el poussin está cocido. Deje reposar en un lugar cálido durante 4-5 minutos.", "Para servir, coloca el poussin en un plato de servir grande. Vierta la ensalada en escabeche sobre el poussin y sirva."], "url": "www_bbc_co_uk_food_recipes_grilledpoussinmarina_88732", "title": "Poussin marinado a la parrilla con ensalada de encurtido", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos, sin grano si quieres menos calor, más o menos picados", "2-3 dientes de ajo grandes y jugosos, toscamente picados", "jengibre fresco de raíz, pelado y cortado en aproximadamente 8 piezas en forma de moneda", "espolvoreado de granos de pimienta negros enteros", "bien agitar cada una de las semillas de comino y semillas de cilantro", "buena aspersión de cúrcuma molida", "puñado de cilantro fresco", "puñado de menta fresca", "sobre de crema de coco, o medio bloque de crema de coco, rallado", "par de puñados de langostinos pelados crudos", "un puñado de menta fresca y cilantro, picados (reservar algunas hojas de menta para decorar)", "1 lima, ralladura solamente", "buena leche o dos yogur natural"], "method": ["Para hacer la pasta de especias, coloca los chiles, el ajo, el jengibre, la pimienta en grano, el comino y las semillas de cilantro y la cúrcuma en un procesador de alimentos y licúa hasta que estén bien picados. Agregue el cilantro fresco y la menta junto con el coco batido y mezcle nuevamente para formar una pasta suave que aún tenga un poco de textura.", "La pasta será bastante espesa en este punto, así que agregue suficiente agua para que cubra las gambas. Mezcle la pasta de especias y las gambas en un bol. Puede dejar macerar durante la noche, cubierto con película adhesiva en la nevera, si lo desea.", "Caliente una sartén hasta que esté muy caliente. Mientras tanto, haciendo el aderezo. Agregue la menta y el cilantro a un tazón con la ralladura de lima (alternativamente, podría intentar usar la ralladura de un limón para la nota de cítricos), luego revuelva a través del yogur.", "Coloque las gambas en la bandeja de la plancha caliente y cocine durante 2-3 minutos en cada lado, hasta que estén opacas y de color rosado.", "Sirva estos inmediatamente con el aderezo y las hojas de menta reservadas. Esta pasta de especias es muy versátil y puede usarse con pollo o pescado."], "url": "www_bbc_co_uk_food_recipes_grilledprawnswithyog_92524", "title": "Gambas a la plancha con yogur y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de papaya cruda finamente picada", "1 cucharada de ajo finamente picado", "1 cucharadita de chile verde finamente picado", "1 cucharadita de semillas de hinojo molido", "1 cucharadita de pimienta negra recién molida", "1 cucharadita de pimentón dulce", "3 cucharadas de aceite vegetal", "100 ml / 3½ fl oz de crema individual", "Crema doble 55ml / 2fl oz", "2 cucharadas de harina de gramo (también llamada harina de garbanzo, disponible en algunos supermercados y tiendas de comestibles asiáticas)", "2 cucharadas de pastis", "½ nuez moscada rallada", "pizca de sal", "2 x 8 huesos de corderos, el exceso de grasa eliminado", "50g / 2oz de mantequilla, derretida", "200 g / 7 oz de hojas de menta fresca", "2 cucharadas de cebolla roja finamente picada", "2 cucharadas de jugo de limón", "1 chile verde, sin semillas, picadas", "½ cucharadita de sal", "½ cucharada de aceite vegetal", "4 cucharadas de yogur al estilo griego", "2 mangos verdes, finamente rebanados", "pequeño cilantro fresco", "puñado de berros", "Jengibre de raíz de 2.5cm / 1in, rallado", "1 cucharadita de semillas de comino tostadas, aplastadas", "1 cucharada de jugo de lima", "1 cucharada de aceite de oliva", "½ cucharadita de azúcar"], "method": ["Para el cordero, coloque todos los ingredientes del cordero a excepción del cordero y la mantequilla en un bol y mezcle bien. Frote el adobo sobre el cordero para cubrirlo todo, luego colóquelo en un plato grande y déjelo marinar por dos horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Sacuda el adobo excedente del cordero y colóquelo en una lata para asar. Transfiera al horno y cocine por diez minutos, luego hilvane con el adobo restante. Vuelve al horno por otros cinco minutos o hasta que el cordero esté cocido a tu gusto. Rocíe la mantequilla derretida y reserve en un lugar cálido.", "Para la chutney a la menta, ponga a hervir una olla pequeña de agua. Agregue las hojas de menta y vuelva a hervir.", "Escurra las hojas de menta y colóquelas en un recipiente lleno de agua helada para refrescarlas, luego drene nuevamente.", "Coloque las hojas de menta en un procesador de alimentos con los ingredientes restantes de chutney de menta y mezcle hasta que quede suave.", "Para la ensalada de mango, coloque todos los ingredientes de la ensalada de mango en un tazón y revuelva.", "Para servir, esculpe el cordero en porciones y colóquelo en platos para servir con una cucharada de ensalada de mango y una cucharada de chutney de menta."], "url": "www_bbc_co_uk_food_recipes_grilledrackoflambwit_86209", "title": "Estante de cordero a la parrilla con ensalada de mango y chutney de menta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de perejil de flatleaf, hojas recogidas", "2 chalotes, en rodajas finas", "Aceitunas negras de 25g / 1oz", "25g / 1oz de pimientos del piquillo, pelados y cortados en tiras", "10g / ½ oz de alcaparras finas", "1 limón, cortado en segmentos", "20g / ¾oz de pasta orzo, cocida en azafrán, enfriado", "50ml / 2fl oz de aceite extra virgen", "sal y pimienta negra recién molida", "8 filetes de salmonete, escamados y deshuesados", "1 cucharada de aceite de oliva extra virgen", "200 g / 7 oz de calamar bebé, limpiado", "3 dientes de ajo, pelados, rebanados y blanqueados", "1 cucharada de aceite de oliva extra virgen", "175ml / 6fl oz de vino de Banyuls de 3 años, reducido a 1 cucharada"], "method": ["Precalienta la parrilla.", "Mezcle el perejil, chalotes, aceitunas, pimientos, alcaparras y limón en un tazón. Combínalo con el orzo.", "Rocíe un poco de aceite de oliva y sazone con sal y pimienta negra al gusto. Mezcle bien.", "Coloque los filetes de salmonete rojo en una bandeja para hornear cepillado con un poco de aceite de oliva.", "Cepille la parte superior del filete con un poco más de aceite y sazone con sal y pimienta.", "Coloque debajo de la parrilla y cocine de uno a dos minutos.", "Caliente una sartén con un poco de aceite de oliva hasta que fume. Rápidamente dore el calamar y las rodajas de ajo.", "Sazonar con sal y pimienta negra y retirar del fuego y colocar sobre papel de cocina para escurrir.", "Agregue el calamar a la ensalada de perejil y divídalo entre los cuatro platos.", "Coloque dos filetes en cada plato descansando sobre la ensalada de perejil.", "Vierta un poco de aceite virgen extra alrededor del plato y finalmente una llovizna de vino reducido. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_grilledredmulletwith_83924", "title": "Salmonete a la plancha con calamar, perejil y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / 1oz de mantequilla sin sal", "2 cebollas rojas pequeñas, en rodajas", "2 lonchas de tocino, cortadas en rodajas finas", "aceite de oliva", "4 x 170 g / 6 oz de filetes de salmón", "sal y pimienta negra recién molida", "1 col de col rizada pequeña, sin núcleo y desmenuzado", "2 cucharadas de mostaza granulada", "½ limón, solo jugo", "1 cucharadita de perejil picado", "1 cucharada de vinagre de vino blanco"], "method": ["Calentar la mantequilla en una sartén grande, agregar la cebolla y freír suavemente durante cinco minutos.", "Cepille cada lado del salmón con aceite de oliva. Caliente una sartén antiadherente, cuando caliente agregue el salmón y deje que se selle en la sartén. Dar la vuelta a la mitad de la cocción.", "Agregue el repollo rallado al tocino y las cebollas y revuelva. Cubra con una tapa ajustada y continúe cocinando durante 10 minutos, revolviendo ocasionalmente. Esto asegurará que la col absorberá la mantequilla y retendrá la humedad.", "Combine todos los ingredientes del aderezo en un frasco con una tapa ajustada y agite para combinarlo completamente. (También puedes hacer esto en un recipiente con un tenedor).", "Al final de la cocción, sazone, luego sirva en un tazón grande colocando el salmón encima. Coloque el aderezo en el borde."], "url": "www_bbc_co_uk_food_recipes_grilledsalmonbraised_14513", "title": "Salmón a la parrilla, repollo estofado con tocino y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsalmonbraised_14513_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón muy fresco de 900 g / 2lb", "1 cucharada de pimienta negra agrietada", "sal", "2 cucharadas de aceite de oliva light", "1 pimiento amarillo", "½ cucharada de aceite vegetal", "8-12 patatas nuevas cocidas", "2 tomates de ciruela", "175 g / 6 oz de judías verdes cocidas", "20 aceitunas", "sal y pimienta", "2 cucharadas de aceite de oliva virgen", "2 cucharadas de perejil picado", "perejil de hoja plana, para adornar", "½ cucharadita de sal", "1 ½ cucharada de mostaza Dijon", "4 cucharaditas de jugo de limón", "1 diente de ajo, aplastado", "5 gotas de salsa Tabasco", "4 filetes de anchoa", "110ml4 fl oz aceite de oliva ligero", "1 huevo, solo yema"], "method": ["Deseche la piel del salmón y córtelo en 4 filetes iguales. Espolvoree cada filete con sal y pimienta negra, presionando firmemente en los filetes con la mano. Recubra ligeramente en aceite y refrigere hasta que esté listo para cocinar.", "Frote la pimienta amarilla con un poco de aceite vegetal y ase a la parrilla o tápela hasta que la piel esté bien cubierta de ampollas. Deje que se enfríe, y luego quite la cáscara chamuscada, quite las semillas, corte en 8 pedazos y coloque en un tazón. Corta los tomates en 6 porciones cada uno y corta las patatas nuevas si parecen muy grandes.", "Combine todas las verduras, sazone ligeramente con sal y pimienta, mezcle con el aceite de oliva y el perejil. Deje que alcance la temperatura ambiente.", "Para hacer el aderezo, combine todos los ingredientes del aderezo en una licuadora y pulse hasta que quede suave y emulsionado.", "Para cocinar el salmón, caliente una sartén grande para parrilla (preferiblemente de hierro fundido) a fuego alto hasta que casi fume. Agregue el salmón y espere de 1 a 3 minutos por cada lado.", "Para servir, divida las verduras entre las placas y coloque un filete de salmón en el centro de cada una. Rodear con una generosa llovizna del aderezo y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_grilledsalmonnicoise_67919", "title": "Salmón a la plancha Niçoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsalmonnicoise_67919_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "Filete de salmón 100 g / 3½ oz, piel en", "sal y pimienta negra recién molida", "30g / 1oz de mantequilla", "100 g / 3½ oz de guisantes frescos o congelados", "1 cucharada de vinagre de vino blanco", "salpicar el aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 limón, cortado en cuñas, para adornar"], "method": ["Calentar el aceite de oliva en una sartén. Sazone el salmón con sal y pimienta negra y agregue a la sartén caliente, con la piel hacia abajo. Cocine por 2-3 minutos en un lado, antes de dar vuelta y freír durante 1-2 minutos en el otro lado.", "Para hacer los guisantes blandos, derrita la mantequilla en una cacerola. Agregue los guisantes, el vinagre y un chorro de agua caliente y cocine por 3-4 minutos, o hasta que los guisantes estén suaves.", "Agregue el aceite de oliva virgen extra y la sal y pimienta negra recién molida al gusto y mastique aproximadamente.", "Para servir, coloque los guisantes blandos en un plato y cubra con el salmón, con la piel hacia arriba. Adorne con rodajas de limón y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledsalmonwithmus_84945", "title": "Salmón a la plancha con guisantes blandos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 sardinas, limpiadas y evisceradas", "sal y pimienta negra recién molida", "Patatas Royal Jersey de 200 g / 8 oz, fregadas y sancochadas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "100ml / 3½fl oz de aceite de oliva virgen extra", "1 limón, solo jugo", "2 tomates, pieles y semillas retiradas, finamente picadas", "1 chalote, finamente picado", "1 diente de ajo pequeño, finamente picado", "2 cucharadas de estragón fresco picado", "2 cucharadas de albahaca fresca picada", "2 cucharadas de eneldo fresco más o menos picado", "sal y pimienta negra recién molida", "110g / 4oz de hojas de ensalada mixtas", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre balsámico"], "method": ["Precalentar la parrilla a alto.", "Para las sardinas, retire la cabeza de las sardinas, luego corte a lo largo del vientre desde el extremo de la cabeza hasta la cola y ábrase con la carne hacia abajo. Presione hacia abajo a lo largo del cuerpo con la palma de su mano, luego voltee el pescado y levante los huesos. Haga una hendidura al lado de las branquias y meta la cola en la hendidura, formando un círculo.", "Coloque las sardinas en una bandeja de parrilla y sazone con sal y pimienta negra recién molida. Coloque debajo de la parrilla durante 3-4 minutos, o hasta que esté completamente cocida.", "Mientras tanto, para los Jersey Royals fritos, caliente una sartén hasta que esté caliente y agregue las papas y el aceite de oliva. Freír durante 3-4 minutos hasta que estén dorados y crujientes, luego sazone con sal y pimienta negra recién molida.", "Para la salsa vierge, coloque el aceite de oliva virgen extra en una sartén y mezcle con el zumo de limón. Agregue los tomates, la chalota y el ajo y coloque sobre el fuego para que se caliente. Retire del fuego, agregue las hierbas y sazone con sal y pimienta negra recién molida.", "Para la ensalada, coloque las hojas de ensalada en un tazón, rocíe sobre el vinagre balsámico y el aceite de oliva y revuelva.", "Para servir, divida las papas fritas entre cuatro platos y cubra cada una con tres sardinas a la parrilla. Cuchara sobre la vierge salsa caliente y coloque las hojas de ensalada vestida al lado."], "url": "www_bbc_co_uk_food_recipes_grilledsardineswiths_86471", "title": "Sardinas asadas con salsa Vierge, Jersey Royals fritos y ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 vieiras, limpiadas, conchas retenidas", "pimienta de cayena, para rociar", "1 cucharada de polenta", "3 rodajas de lima", "1 cucharada de menta fresca picada", "splash salsa Tabasco", "exprimir la lima, para servir"], "method": ["Precalentar la parrilla a la configuración más alta.", "Coloque las vieiras en sus conchas. Espolvoree las vieiras con la pimienta de cayena y la polenta y coloque una rodaja de lima encima de cada una.", "Coloque las vieiras debajo de la parrilla durante 3-4 minutos, hasta que estén bien cocidas.", "Espolvorear con la salsa de menta y tabasco, al gusto. Rocíe con un chorrito de lima y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledscallops_79884", "title": "Vieiras a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20 vieiras frescas, limpias, corales removidos", "20 g / 1 oz de trufa negra fresca, limpia, rebanada en 20 rebanadas delgadas, más extra, finamente picada", "1 cucharada de aceite", "250g / 9oz de mantequilla", "Hojas de ensalada verde mixta de 400 g / 14 oz, lavadas", "1 cucharada de aceite de oliva", "1 cucharadita de vinagre balsámico", "sal y pimienta negra recién molida", "1 cucharadita de vinagre de jerez", "Nota: Esta receta originalmente usa medidas australianas. Las medidas equivalentes son lo más precisas posible."], "method": ["Haga una hendidura en el costado de cada vieira e inserte una rebanada de trufa.", "Calentar el aceite en una sartén a fuego alto, agregar las vieiras y freír durante 1-2 minutos en un lado, o hasta que estén doradas", "Caliente la mantequilla en una sartén por separado a fuego lento hasta que se dore. Colar por un colador fino.", "Agregue el vinagre de Jerez y un poco de trufa finamente picada a la mantequilla marrón tamizada y mezcle bien con un batidor.", "Mientras tanto, coloca las hojas de ensalada en un tazón. Agregue el aceite de oliva y el vinagre balsámico. Revuelva bien y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida las hojas de ensalada entre cuatro platos para servir. Coloque las vieiras alrededor de la ensalada en cada plato y espolvoree un poco de mantequilla marrón."], "url": "www_bbc_co_uk_food_recipes_grilledscallopswithf_10372", "title": "Vieiras a la plancha con vinagreta de mantequilla marrón de trufa negra fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "1 pimiento rojo, picado", "100ml / 3½fl oz de vino blanco", "½ cucharadita de sal marina", "2 langostinos, conchas eliminadas, desvenaduradas", "1 cucharada de semillas de sésamo", "1 cucharada de aceite de oliva"], "method": ["Para el aderezo de pimiento rojo y ajo, caliente el aceite en una sartén sobre un medio y fría la cebolla y el ajo durante 4-5 minutos, hasta que estén suaves pero no coloreados.", "Agregue el pimiento rojo y revuelva bien, luego vierta el vino y agregue la sal. Hierva durante 5-7 minutos, hasta que el aderezo comience a reducirse y el pimiento rojo esté tierno.", "Para las gambas, enrolle las gambas en las semillas de sésamo para cubrir completamente.", "Calentar una sartén y rociar con el aceite. Agregue las gambas y cocine durante dos minutos en cada lado, hasta que estén completamente cocidas.", "Para servir, espolvoree el aderezo de pimiento rojo y ajo en un plato y coloque los camarones de sésamo en la parte superior."], "url": "www_bbc_co_uk_food_recipes_grilledsesameprawnsw_88888", "title": "Gambas a la parrilla de sésamo con pimiento rojo y aderezo de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 dientes de ajo", "aceite de oliva", "2 ramitas de tomillo fresco, solo hojas", "75g / 2½oz de mantequilla, suavizada", "sal y pimienta negra recién molida", "2 lonchas de panceta, picadas", "1 cucharada de aceite de oliva", "Filete de solomillo de 200g / 7oz", "15g / ½ oz de mantequilla", "1 diente de ajo, finamente picado", "gran puñado de col rizada fresca, picada", "sal y pimienta negra recién molida", "dash aceite de oliva", "4 tomates cherry, cortados por la mitad", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la mantequilla de ajo, coloque el ajo, aceite de oliva, tomillo, sal y pimienta negra recién molida en un pequeño cuadrado de papel de aluminio y doblar para hacer un paquete. Coloque en el horno y tueste durante 15 minutos, o hasta que el ajo esté suave.", "Exprime la carne de ajo de las pieles en un tazón con las hojas de tomillo, la mantequilla ablandada, la sal y la pimienta negra recién molida y mezcla hasta que estén bien combinados.", "Freír la panceta en una sartén hasta que esté crujiente, luego agregar a la mantequilla y mezclar bien. Forme la mezcla de mantequilla en un tronco grueso y envuélvala en papel para hornear y péguela. Coloque en el congelador por diez minutos o hasta que esté firme. Una vez que esté firme, corte en rodajas gruesas.", "Para el solomillo, frote el solomillo con el aceite de oliva y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que fume, agregue el bistec y fría por 3-4 minutos en cada lado (por raro), o hasta que esté cocido a su gusto. Retire el bistec de la sartén y déjelo reposar durante cinco minutos en un plato caliente.", "Para la col rizada, derrita la mantequilla en una cacerola, agregue el ajo y fría por un minuto, luego agregue la col rizada y fría por 2-3 minutos, o hasta que se marchite. Sazonar con sal y pimienta negra recién molida.", "Para la guarnición, caliente una pizca de aceite de oliva en una sartén, sazone las mitades de tomate con sal y pimienta negra recién molida y luego fría por 2-3 minutos, o hasta que se ablanden.", "Para servir, amontone la col rizada en un plato para servir y cubra con el bistec. Coloque una rebanada de mantequilla de ajo encima del bistec y coloque los tomates cherry en un lado del plato."], "url": "www_bbc_co_uk_food_recipes_grilledsirloinwithro_89046", "title": "Solomillo a la parrilla con ajo asado, panceta, mantequilla de tomillo y col rizada de ajo dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pargo rojo, fileteado, la piel de un filete anotó varias veces con un cuchillo filoso (el segundo filete se puede usar en otra receta)", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cebolletas frescas enteras, para servir", "1 puñado de fideos de huevo, cocidos según las instrucciones del paquete, escurridos", "1 cucharada de aceite de sésamo", "1 cucharada de salsa de soja", "2 cucharadas de aceite de oliva", "½ pimiento rojo", "2 dientes de ajo, pelados, picados", "1 cucharada de aceite de oliva extra virgen", "1 cucharada de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pargo a la parrilla, sazone la carne, al gusto, con sal y pimienta recién molida. Caliente el aceite en una sartén a fuego alto. Cuando el aceite esté humeando, cocine el pescado con la piel hacia abajo, durante 2-3 minutos. Voltee el pescado, apague el fuego y deje que el pescado termine de cocinarse en el calor residual de la sartén.", "Para la torta de fideos crujiente, mezcle los fideos con el aceite de sésamo y la salsa de soja en un tazón. Transfiera los fideos a una sartén pequeña y presione hacia abajo con la parte posterior de una cuchara de madera en una \"torta\". Freír durante 8-10 minutos, volviendo el pastel a la mitad de la cocción.", "Para los pimientos asados ​​y el ajo, rocíe el aceite de oliva sobre la mitad de la pimienta y esparza sobre el ajo picado. Asar la pimienta en el horno precalentado durante 8-10 minutos.", "Retire la pimienta del horno, pique en trozos y mezcle con el aceite de oliva virgen extra y el vinagre balsámico.", "Para servir, coloque la torta de fideos en un plato y cubra con la pimienta y luego el pescado. Adorne con las cebolletas enteras."], "url": "www_bbc_co_uk_food_recipes_grilledsnapperwithcr_92401", "title": "Pargo a la plancha con pastel de fideos crujiente con pimientos asados ​​y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 gran diente de ajo", "pequeñas hojas de tomillo fresco", "2 cucharadas de aceite de oliva", "450 g / 1 libra limpian cuerpos y tentáculos de calamar", "2 limas, solo jugo", "2 cucharadas de aceite de oliva", "2 ramitas de tomillo, solo hojas", "sal marina, al gusto"], "method": ["Para el calamar, pele el ajo y colóquelo en un mortero. Aplaste una pasta, agregue el tomillo y aplaste nuevamente. Agregue el aceite de oliva y mezcle.", "Enjuague bien el calamar y sacúdalo. Corta cada cuerpo de calamar por un lado para que se abra completamente. Utilice un cuchillo pequeño y muy afilado para marcar la carne en un lado en un patrón entrecruzado, teniendo cuidado de no cortar todo el camino.", "Coloque los cuerpos de calamar y los tentáculos en un bol. Agregue la mezcla de ajo, tomillo y aceite de oliva, mezcle bien y deje reposar para marinar durante al menos media hora.", "Para el aderezo, coloque el jugo de lima, el aceite de oliva y las hojas de tomillo en un recipiente limpio con tapa de rosca. Enrosque la tapa con fuerza y ​​agite vigorosamente el frasco para mezclar el aderezo.", "Caliente una sartén a fuego alto hasta que fume. Agregue el calamar y la plancha durante 30 segundos en ambos lados (los cuerpos del calamar probablemente se curven durante la cocción) o hasta que estén recién cocidos y ligeramente carbonizados en algunos lugares. Tenga cuidado de no cocinar demasiado el calamar.", "Para servir, divida el calamar entre dos platos para servir, vierta sobre el aderezo y sazone al gusto con copos de sal marina. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_grilledsquidwithlime_88966", "title": "Calamar a la plancha con lima y tomillo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de sésamo", "1 cucharada de miel", "1 cucharada de salsa de soja", "Carne de muslo de pollo 100 g / 3½ oz, anotada con un cuchillo afilado", "1 cucharada de aceite de oliva", "1 diente de ajo, en rodajas finas", "¼ de puerro, cortado en tiras largas y delgadas", "¼ de pimiento rojo, cortado en tiras largas y delgadas"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el pollo, mezcle el aceite de sésamo, la miel y la salsa de soja en un tazón grande. Cubra el pollo en el adobo y déjelo por 5 minutos.", "Calentar una sartén hasta que esté caliente. Retire el pollo del adobo, reserve la mezcla de adobo. Freír el pollo durante 2-3 minutos en cada lado. Transfiera el pollo al horno y tueste durante 5 minutos, o hasta que esté cocido.", "Para hacer el sofrito, caliente el aceite en una sartén pequeña. Agregue el ajo, los puerros y la pimienta y cocine hasta que estén blandos. Vierta la mezcla de adobo y deje hervir a fuego lento, continúe cocinando hasta que la mezcla esté espesa.", "Con una cuchara, coloca las verduras salteadas en el centro de un plato, coloca el pollo encima y sírvelo."], "url": "www_bbc_co_uk_food_recipes_grilledteriakichicke_80048", "title": "Pollo Teriyaki con puerro y pimienta salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledteriakichicke_80048_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ limón, solo ralladura", "1 filete de trucha, sin piel", "½ cucharadita de semillas de comino", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "3 cebolletas, cortadas y cortadas a la mitad longitudinalmente", "½ tomate", "2 cucharadas de salsa de soja", "½ limón, cáscara y jugo solamente", "150g / 5½oz de cuscús", "300ml / 10fl oz de caldo de verduras", "2 cucharadas de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de menta fresca picada", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas", "1 cucharada de eneldo fresco picado", "½ tomate, picado"], "method": ["Para la trucha, frote la ralladura de limón en la carne de la trucha. Coloque las semillas de comino, la sal y la pimienta negra recién molida en un almirez y mortero y muela hasta que estén bien combinados. Reserve media cucharadita de vinagreta y espolvoree el resto sobre el pescado.", "Caliente el aceite de oliva en una sartén a la plancha y agregue la mitad de la trucha, la cebolleta y el tomate. Planche la trucha durante 2-3 minutos en ambos lados, o hasta que esté dorada y cocida.", "Para la vinagreta, coloque la salsa de soja, la ralladura de limón y el jugo y la mezcla de comino reservada en un tazón pequeño y mezcle bien.", "Para el cuscús, vierta el caldo sobre el cuscús en un recipiente y déjelo en remojo durante 5-7 minutos, o hasta que se haya absorbido todo el líquido. Vierte los granos con un tenedor y agrega el resto de los ingredientes del cuscús.", "Para servir, espolvorear el cuscús en un plato para servir y colocar la trucha en la parte superior. Coloque las cebollas de primavera a la parrilla y el tomate a la mitad hacia un lado, rocíe sobre la vinagreta y sirva."], "url": "www_bbc_co_uk_food_recipes_grilledspicedtroutwi_90403", "title": "Trucha asada a la parrilla con vinagreta de soja y cuscús con hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]