[{"isVegetarian": false, "title": "John Dory alla carlina", "url": "www_bbc_co_uk_food_recipes_john_dory_alla_carlina_43959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, chopped", "1 bulb fennel, sliced", "100g/3½oz celery, sliced", "100g/3½oz carrots, sliced", "25g/1oz button mushrooms, washed and sliced", "1 sprig thyme", "2¼ litres/4 pints water", "1kg/2lb 4oz flatfish bones (such as brill, sole, plaice) or fillet (ask your fishmonger for bones)", "6 tbsp olive oil", "4 garlic cloves, finely chopped", "1kg/2lb 4oz well-flavoured tomatoes, peeled or 2 x 400g tins chopped tomatoes", "salt and freshly ground black pepper", "4 John Dory fillets ", "50g/1¾oz plain flour", "2 tbsp olive oil, plus extra to serve", "1 lemon, halved", "1 tsp Worcestershire sauce", "2 small gherkins, finely chopped", "2 tbsp capers, 1 tbsp finely chopped and 1 tbsp whole", "2 tomatoes, peeled, de-seeded and finely chopped", "3 tbsp tomato sauce (see above)", "250ml/9fl oz fish stock (see above)", "small handful flatleaf parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stock, put all the ingredients except the fish bones into a large pan, bring to the boil, then turn down the heat and simmer gently for 20 minutes. ", "Add the fish bones (or fish fillet) and bring back up to a simmer, skimming off any scum as it rises to the surface. Simmer for a further 20 minutes. Strain through a sieve into a clean pan and simmer a little longer, if necessary, until reduced to about 1.2 litres/2 pints. If not using immediately, cool and refrigerate or freeze for later use.", "For the tomato sauce, heat the olive oil and garlic in a saucepan. As soon as the garlic starts to sizzle, add the tomatoes and simmer for 15-20 minutes, breaking them up as they cook. Cook until the sauce has reduced and thickened, then season with salt and pepper. The sauce is ready to use. If not using immediately, leave to cool, then refrigerate for up to a week or freeze for later use.", "Season the John Dory fillets with some salt and pepper and lightly dust with flour. Heat the olive oil in a frying pan, add the fillets skin-side down and fry for 2-3 minutes until lightly browned. Season with a squeeze of lemon juice, turn the fish over and cook for a further minute. Remove from the pan and keep warm.", "Add the Worcestershire sauce, gherkins, whole and chopped capers, tomatoes, tomato sauce and fish stock to the pan, bring to the boil then reduce a little to create the sauce. Add the fish carefully back to the pan for a minute to warm through in the sauce.", "Serve immediately, drizzled with a little more olive oil and sprinkled with fresh parsley."]}, {"isVegetarian": true, "title": "Jerusalem artichoke soup with crisp leeks and rocket pesto", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_88168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, finely chopped", "1 garlic clove, finely chopped", "200g/7oz Jerusalem artichokes, peeled and chopped", "1 sprig fresh thyme, chopped", "75ml/2½fl oz white wine", "300ml/½ pint vegetable stock", "salt and freshly ground black pepper ", "2 tbsp Greek yoghurt", "150ml/5½fl oz vegetable oil, for shallow frying", "¼ leek, finely sliced into matchsticks", "salt ", "4 tbsp olive oil", "½ lemon, juice only", "small handful fresh rocket leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the oil and butter in a saucepan and gently soften the onion and garlic for 4-5 minutes. Add the artichokes and thyme and continue to cook for 3-4 minutes. Add the white wine and reduce for 2-3 minutes. Then add the stock and bring up to the boil. Reduce the heat and simmer until the artichoke is tender, about five minutes. Season with salt and freshly ground black pepper, and finally stir in the yoghurt.", "For the crisp leeks, heat the oil in a pan until a small cube of bread turns golden-brown in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) When the oil is hot, carefully lower the leek into the hot oil, using a slotted spoon, and fry for about 30 seconds or until starting to turn golden-brown. Remove with the slotted spoon and drain on kitchen paper. Sprinkle with salt to taste.", "For the rocket pesto, place the olive oil, lemon juice and rocket into a bowl. Using a hand-held blender, blend until smooth. Season with salt and freshly ground black pepper.", "To serve, pour the soup into a serving bowl, arrange the leeks on top and drizzle the pesto on top in a circle."]}, {"isVegetarian": false, "title": "John Dory, mousseron mushrooms, broad beans and wild strawberries", "url": "www_bbc_co_uk_food_recipes_john_dory_mousseron_78446", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 punnets wild strawberries ", "1-2 tbsp olive oil ", "1 puntarella (Italian chicory), finely chopped ", "salt and pepper ", "1.5kg/3lb 5oz small broad beans, podded ", "knob of butter, for frying", "drizzle olive oil, for frying ", "1 shallot, finely chopped ", "300g/10½oz mousseron mushrooms, cleaned ", "salt and pepper ", "4 John Dory fillets (about 200g/7oz each) ", "1 egg yolk, beaten ", "200g/7oz dried white breadcrumbs", "knob of butter, for frying", "drizzle olive oil, for frying", "1 sprig thyme ", "1 garlic clove, squashed and left whole", "salt and pepper ", "Lemon balm cress, lambs lettuce cress, bergamot cress, apple blossom cress, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, reserve around 12 of the most beautiful strawberries and mash the others with a little olive oil. Add the chopped puntarella and mix.", "For the vegetables, blanch the beans in a small saucepan of boiling water for 2 minutes and then drain. When cool enough to handle, pop the beans out of their leathery skins by squeezing gently. Discard the skins.", "For the fish, brush the skinless side of each fillet with beaten egg. Cover the same side with breadcrumbs. ", "Heat some oil and butter in a large frying pan with the garlic and thyme (you may need to use two pans). Fry the fish with the breaded side down. Cook for 6 minutes over a low heat. Season the fish with salt and pepper. ", "Meanwhile, heat some butter and oil in a large saucepan. Gently fry the shallots for 2 minutes then add the mousseron mushrooms and broad beans. Cook for 4 minutes over a medium heat. Season with salt and pepper. ", "To serve, divide the vegetables between serving plates, gently lay the fish on top, and add the dressing to the side. Garnish with the reserved strawberries and the cresses."]}, {"isVegetarian": false, "title": "John Dory with asaparagus, chilli and orange salad", "url": "www_bbc_co_uk_food_recipes_john_dory_with_52995", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red onions, thinly sliced using a mandoline", "16 asparagus spears, woody parts removed, thinly sliced using a mandoline", "4 red chillies, halved, seeds removed, thinly sliced ", "1 orange", "4 x John Dory, about 500g/1lb 2oz each, gutted, filleted and skinned", "sea salt and freshly ground black pepper", "4 tbsp verjuice (available online)", "4 tbsp olive oil ", "1 tbsp Dijon mustard ", "1 tbsp honey ", "2 tbsp chopped coriander leaves", "2 tbsp chopped mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Put the red onion, asparagus and chillies in a large bowl. Finely grate the zest of the orange and add to the salad. Cut away the peel and pith (white part) from the orange and cut out the segments from between the membranes; add to the salad and toss to combine. ", "Season the fish all over with salt and pepper, then lay on the grill tray. Place under the grill for 3 minutes, then turn the fillets over and cook the other side for 3 minutes. ", "Meanwhile, for the dressing, whisk the ingredients together in a bowl and season with salt and pepper. Just before serving add half of the dressing to the asparagus salad and toss lightly. Taste and add more seasoning if required. ", "To serve, divide most of the salad between warmed plates. Place a grilled fish fillet on top, arrange the remaining salad on the fish and drizzle over the reserved dressing. Serve immediately. "]}, {"isVegetarian": false, "title": "John Dory with courgette shoestring fries", "url": "www_bbc_co_uk_food_recipes_john_dory_with_courgette_44843", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint vegetable oil, for deep-frying", "6 large courgettes", "500ml/18fl oz cold milk", "500g/1lb 2oz plain flour, seasoned with salt and pepper", "large pinch of fine salt", "extra virgin olive oil, for frying", "4 x John Dory fillets", "1 garlic clove, thinly sliced", "1 large handful of mixed herbs (mint, dill, basil and sage), finely chopped", "50ml/2fl oz fish stock", "70ml/2½fl oz lemon juice", "70ml/2½fl oz orange juice", "1 small handful of pink and green peppercorns", "1 small orange, cut into slices (optional)", "flaky sea salt and ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the zucchini shoestring fries, add the oil to a deep-fat fryer and heat to 190C (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Meanwhile, slice the courgettes lengthways using a mandoline to create 4mm thick strips.", "Carefully dredge the courgette strings in the milk and shake around in the seasoned flour to lightly coat. ", "Lower the cougette fries into the deep-fat fryer and cook for 3 minutes or until light golden-brown. Remove using a slotted spoon and leave to drain on kitchen paper. Sprinkle with fine salt and keep warm until ready to serve.", "Meanwhile for the John Dory, drizzle a generous glug of olive oil into a large shallow pan with a lid. Carefully add the John Dory fillets skin-side down with the garlic and a pinch of salt and pepper. Scatter the chopped herbs over the fish and place the pan over a medium heat. When the pan starts to sizzle, add the stock, lemon juice and orange juice and cover with a lid. After no more than 4 minutes, remove the fillets and place on warm plates.", "Turn the heat up to high, add the peppercorns and boil the juices until the volume of liquid starts to reduce (about 2 minutes). Take off the heat and pour the reduced juices onto the John Dory fillets. Garnish each fillet with a slice of orange, if using, and serve with the courgette fries alongside.", "To serve, put the John Dory onto a serving plate and the fries on the side."]}, {"isVegetarian": false, "title": "John Dory with orange, fennel and caper salad", "url": "www_bbc_co_uk_food_recipes_johndorywithorangefe_92735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz new potatoes, cut into 2.5cm/1in slices, parboiled", "2 tbsp olive oil", "200g/7oz flour", "salt and freshly ground black pepper", "4 fillets John Dory", "50g/1¾oz butter", "½ lemon, juice only", "2 fennel bulbs, thinly sliced, (set aside in a bowl of ice cold water)", "2 oranges, peeled, segmented, juice reserved", "2 tsp baby capers, drained", "1 bunch chopped fresh dill", "3 tbsp olive oil", "1 tbsp white wine vinegar", "8 salted anchovies, cut in half lengthways", "4 tsp caper berries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the parboiled potatoes into a bowl with the olive oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined.", "Heat a griddle pan over a medium heat until hot. Add the potatoes in batches and cook for four minutes on each side or until tender and golden-brown on both sides. Remove from the pan and keep warm. Repeat the process with the remaining batches of potatoes.", "Sprinkle the flour onto a plate. Season with salt and freshly ground black pepper. Dust the John Dory in the seasoned flour.", "Heat half the butter in a frying pan over a medium heat until foaming and fry the John Dory for three minutes on each side or until the fish is just cooked through (do this in batches if necessary). Add the remaining butter and the lemon juice to the pan and cook for another minute, basting the fish with the lemon and butter mixture.", "For the fennel and caper salad, drain the fennel thoroughly and place into a large bowl with the orange segments. Add the capers and one-third of the dill. Stir until well combined.", "To make the dressing, place the reserved juice from the oranges into a small bowl and add the oil, white wine vinegar and the remaining dill. Whisk until well combined. Drizzle the dressing over the fennel and orange salad and mix well.", "To serve, place one John Dory fillet onto each of four serving plates. Spoon the potatoes and orange and fennel salad alongside and garnish with the anchovy fillets and caper berries."]}, {"isVegetarian": true, "title": "Jollof rice with fried plantains", "url": "www_bbc_co_uk_food_recipes_jollof_rice_with_fried_79619", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jollof_rice_with_fried_79619_16x9.jpg", "ingredients": ["1 tbsp olive or vegetable oil", "2 large onions, sliced", "2 x 400g/14oz cans plum tomatoes", "1 red pepper, diced", "4 tbsp tomato purée", "¼ tsp cayenne pepper or chilli powder", "1 tsp curry powder", "1 bay leaf", "sprig fresh thyme", "1 stock cube", "225g/8oz long-grain or basmati rice", "salt and freshly ground black pepper", "2 plantains, cut into slices and deep fried", "green leaf salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice, heat the oil in a large pan and cook the onions over a gentle heat until translucent. ", "Stir in the canned tomatoes, red pepper and tomato purée, then season with salt, freshly ground black pepper and the cayenne or chilli. Add the curry powder, bay leaf and thyme, then pour in 550ml/19fl oz of water and crumble in the stock cube.", "Cover and bring to the boil, then reduce the heat and simmer for 20–30 minutes.", "Rinse the rice well to remove excess starch, then add it to the tomato mixture. ", "Bring to the boil, then reduce the heat to low. Cover and simmer for 25–30 minutes, or until the rice is cooked.", "Season to taste with salt and freshly ground black pepper and serve the joffol with fried plantains and a crisp green salad."]}, {"isVegetarian": false, "title": "Chicken fricassée", "url": "www_bbc_co_uk_food_recipes_julies_cchicken_fricase_68855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4 oz butter", "10 onions, chopped", "2.25kg/5lb closed cup mushrooms, sliced", "200g/7oz flour ", "2.8 litres/5 pints milk ", "2.8 litres/5 pints chicken stock ", "sea salt and freshly ground black pepper", "2.7kg/6lb chicken  - cut into 2.5cm/1in cubes", "10 tbsp chopped fresh parsley, plus extra to garnish"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt 100g/4oz of the butter in a very large frying pan and fry the pieces of chicken until golden-brown. Remove the chicken with a slotted spoon and transfer to a large plate. You will need to do this in batches. ", "In the same pan, melt 200g/8oz of butter and fry the onion gently until soft but not browned. Add half the mushrooms to the pan, fry for 2-3 minutes until just cooked, and then drain off the excess fat and set aside. Repeat with another 200g/8oz of butter and the remaining mushrooms.", "Melt the remaining butter in a large saucepan. Stir in the flour and cook for one minute, stirring constantly. Remove from the heat and gradually stir in the milk and the stock. Return to the heat and bring to the boil, stirring continuously.", "Season the sauce with salt and pepper and stir in the chicken pieces, parsley, mushrooms and onions. Cook for 3-4 minutes then remove from the heat. ", "Sprinkle with a little fresh parsley and serve with new potatoes and vegetables of your choice "]}, {"isVegetarian": true, "title": "Jumble biscuits", "url": "www_bbc_co_uk_food_recipes_jumble_biscuits_20028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumble_biscuits_20028_16x9.jpg", "ingredients": ["1 tsp caraway seeds ", "375g/13oz plain flour, plus extra for dusting ", "½ tsp ground aniseed ", "½ tsp ground mace ", "60g/2¼oz unsalted butter, cubed ", "150g/5½oz caster sugar ", "1 large or 2 small unwaxed lemons, finely grated zest only ", "3 free-range eggs, lightly beaten ", "1 free-range egg, lightly beaten ", "caster sugar, for sprinkling "], "serves": "Makes 8 large biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Line two large baking trays with baking parchment. ", "Place the caraway seeds in a spice grinder or a pestle and mortar and grind to a powder. Sieve the caraway, flour, aniseed and mace together into a bowl. ", "Rub the butter into the flour until it resembles fine breadcrumbs, then stir in the sugar and lemon zest. Add the eggs and bring the mixture together to form a soft dough. ", "Divide the dough into four balls weighing 65g/2½ and four balls weighing 85g/3oz (you might have a little leftover). Place the dough balls on one of the prepared trays, cover with cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Knead the four smaller pieces of dough on a lightly floured surface and roll using your fingertips into a 30cm/12in rope. Knot into double knots and place on one of the lined trays. ", "Shape the remaining four larger pieces of dough into long ropes and cut away a quarter of each rope. Lay out (as pictured) into Celtic knots, using the reserved dough to make the rings that sit on top. Place them directly onto the other lined tray. (The double knots will take an extra 5–10 minutes longer to bake, so don’t mix shapes on the baking trays.) ", "Brush with beaten egg and sprinkle with caster sugar. Bake the Celtic knots for 15–20 minutes, until golden-brown and the double knots for 20–25 minutes. Remove from the oven and leave to cool on a wire rack."]}, {"isVegetarian": true, "title": "Jumbo couscous salad", "url": "www_bbc_co_uk_food_recipes_jumbo_couscous_salad_23940", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_couscous_salad_23940_16x9.jpg", "ingredients": ["300ml/10fl oz vegetable stock", "2 tsp olive oil", "100g/3½oz giant couscous", "200g/7oz broccoli", "100g/3½oz peas", "100g/3½oz broad beans, podded", "100g/3½oz salad leaves", "4 spring onions, halved length ways", "2–4 tbsp mint (or any soft herbs, such as tarragon)", "100ml/3½fl oz plain yoghurt", "pinch saffron", "½ tsp runny honey", "pinch caster sugar", "1 tbsp mint (or any soft herbs, such as tarragon)", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue or grill to it's highest setting.", "Pour the vegetable stock into a saucepan and bring to the boil.", "Heat 1 teaspoon oil in a frying pan over a medium heat and toast the couscous for a couple of minutes. Tip into a large bowl and add the hot vegetable stock. Cover with cling film and allow to stand for 5–10 minutes.", "Bring a large saucepan of salted water to the boil and blanch the broccoli, peas and broad beans for a couple of minutes and refresh in ice-cold water. ", "Remove the broccoli from the water, drain and toss in a bowl with the spring onions and 1 teaspoon oil. Place onto the barbeque or under the grill and char on all sides. Remove from the grill and set aside until ready to serve.", "To make the dressing, place all the ingredients in a medium glass bowl and mix well. ", "Scatter the leaves onto a serving platter and dress with the couscous, broccoli, peas, broad beans, spring onions and herbs. Top with the dressing and serve."]}, {"isVegetarian": false, "title": "Jumbo prawns with tomatoes and garlic", "url": "www_bbc_co_uk_food_recipes_jumbo_prawns_with_15297", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_prawns_with_15297_16x9.jpg", "ingredients": ["1 tbsp mild olive oil", "2 garlic cloves, very thinly sliced", "1 long red chilli, deseeded and finely chopped (or use ½ tsp dried chilli flakes)", "150g/5½oz cherry tomatoes, halved", "½ lemon, juice only", "250g/9oz jumbo king prawns, cooked, peeled and deveined", "3 heaped tbsp roughly chopped flat leaf parsley", "ground black pepper", "160g/6oz green beans, steamed, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan over a low heat. Add the garlic and chilli and cook very gently for five minutes or until the garlic is very soft but not coloured, stirring occasionally.", "Add the tomatoes and lemon juice and cook for two minutes or until beginning to soften. Stir in the prawns and cook for 2-3 minutes, stirring, until the tomatoes are well softened and the prawns are hot through.", "Remove the pan from the heat, stir in the parsley, season with lots of pepper and serve with the beans."]}, {"isVegetarian": false, "title": "Jumbo cheese and ham straws", "url": "www_bbc_co_uk_food_recipes_jumbocheesestraws_90633", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbocheesestraws_90633_16x9.jpg", "ingredients": ["375g/13oz ready-rolled puff pastry", "3 slices Parma ham, cut into strips", "100g/3½oz gorgonzola, crumbled", "1 tbsp celery seeds", "1 free-range egg, beaten"], "serves": "18", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "On a lightly floured work surface, roll out the puff pastry to a thin sheet. ", "Lay the strips of Parma ham onto one half of the pastry, then sprinkle over the gorgonzola. ", "Fold the pastry over the ham and gorgonzola, then roll out again to a thin sheet.", "Trim the edges of the filled pastry, brush all over with the beaten egg and sprinkle over the celery seeds. ", "Cut the filled pastry into 1cm/½in strips. ", "Twist the strips and transfer each to a baking tray. Press the ends of the pastry twists down to secure them to the tray and prevent them from unravelling. ", "Bake in the oven for 20-25 minutes, or until golden-brown. Set aside to cool slightly, then serve."]}, {"isVegetarian": false, "title": "Jump in the pan chicken", "url": "www_bbc_co_uk_food_recipes_jumpinthepanchicken_66045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3x140g/5oz chicken breasts, skinless", "2 tbsp plain flour", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "1 tbsp butter", "1 garlic clove, crushed", "4 bay leaves", "125ml/4fl oz dry white wine", "2 tbsp capers, well-rinsed", "1 tbsp lemon juice", "2 tbsp flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a frying pan on the heat and add the oil and butter.", "Place the chicken breasts between two sheets of cling film and bash flat.", "Season the flour with the sea salt and black pepper.", "Tear the chicken into pieces, then toss in the seasoned flour. Fry the chicken until cooked through. Remove from the heat.", "Add the garlic, bay leaves, capers and seasoning to the frying pan. Add the wine and return to the heat.", "Add the lemon juice and parsley leaves.", "Plate up the chicken, drizzle over the sauce and serve with rocket leaves and bread."]}, {"isVegetarian": false, "title": "Jungle chicken curry with rice", "url": "www_bbc_co_uk_food_recipes_jungle_chicken_curry_49545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jungle_chicken_curry_49545_16x9.jpg", "ingredients": ["5 kaffir lime leaves (frozen, fresh or dried)", "½ chicken stock cube, dissolved in 300ml/10½fl oz just-boiled water ", "275g/9¾oz long-grain or basmati rice", "2 tbsp sunflower oil", "2 chicken breasts, boned, skinned, cut into small pieces", "1 large red pepper, cored, deseeded and cut into 2cm/¾in chunks", "200g/7oz fine green beans, trimmed, halved lengthways", "200g/7oz baby sweetcorn, trimmed, halved diagonally", "2 tbsp Thai red curry paste", "1 tbsp Thai fish sauce (nam pla)", "2 tsp cornflour", "50g/1¾oz fresh spinach leaves", "large handful fresh basil leaves (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Stir the lime leaves in to the stock and set aside to infuse. ", "Meanwhile, half-fill a large saucepan with water and bring to the boil. Add the rice, stir well and return to the boil, then cook according to the packet instructions. ", "Heat the oil in a large non-stick frying pan or wok over a high heat. Add the chicken, red pepper, green beans and baby sweetcorn and stir-fry for 2-3 minutes. ", "Add the curry paste and cook for a further 1-2 minutes. ", "Add the stock, lime leaves and fish sauce, bring the mixture to the boil. Reduce the heat and simmer for 2-3 minutes, or until the vegetables are just tender. ", "In a small bowl, whisk the cornflour with 1 tbsp cold water to form a smooth paste. Whisk into the curry and continue to simmer for 4-5 minutes, or until the curry sauce has thickened slightly. ", "Stir in the spinach and continue to simmer until just wilted. Stir in the basil leaves just before serving. Discard the lime leaves.", "To serve, drain the rice and spoon it onto serving plates. Top each portion with a ladleful of the curry."]}, {"isVegetarian": false, "title": "Jungle curry of guinea fowl with coconut and lime rice", "url": "www_bbc_co_uk_food_recipes_jungle_curry_of_guinea_73580", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz shrimp paste", "6 Thai shallots", "3 garlic cloves", "4 small yellow or green chillies, cut in half, seeds removed", "6 long red chillies, seeds removed", "50g/1¾oz galangal, peeled", "40g/1½oz palm sugar", "20g/¾oz fresh turmeric", "2 tsp fine salt", "30g/1oz dried shrimps, soaked for 30 minutes then drained", "2 tbsp vegetable oil", "12 green cardamom pods", "1 guinea fowl, divided into eight joints, skin slashed with a knife", "5 stems of krachai, shredded (a milder version of galangal and ginger, from the same family)", "3 lime leaves, spines removed, shredded", "50ml/2fl oz fish sauce", "100ml/3½fl oz Shaoxing rice wine", "500ml/18fl oz chicken stock", "caster sugar, to taste", "200g/7oz long grain rice", "50g/1¾oz thick coconut milk (chill the can of coconut milk in the refrigerator for 30 minutes, spoon the thick coconut milk from the top of the can)", "1 tsp salt", "pinch caster sugar", "6 lime leaves, torn", "4 snake beans, cut into 1cm/½in  pieces", "1 bamboo shoot, shredded", "2 lime leaves, shredded", "1 red chilli, sliced and seeds removed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the curry paste, wrap the shrimp paste in a foil parcel and toast in a dry hot frying pan or directly on a gas burner until fragrant.", "In a large pestle and mortar, crush together the Thai shallots, garlic cloves, yellow or green chillies, red chillies, galangal, palm sugar, turmeric, salt and rehydrated dried shrimps.", "For the curry, in a large wok, heat the vegetable oil until hot. Add the curry paste and green cardamons and cook to a dry paste. Add the guinea fowl joints and fry for a few minutes. Add the krachai, the lime leaves, fish sauce, Shaoxing wine and chicken stock. Cook until the guinea fowl is cooked through. This will take around 30 minutes.  Taste and add caster sugar to taste.", "Meanwhile, cook the rice. Wash the rice three times and leave to sit for 10 minutes. Place all the ingredients for the rice into a pot and cover with water. Place a lid on, bring to the boil and cook for four minutes and turn off and allow to stand covered for 12 minutes, or until cooked to your liking.", "Garnish the finished dish with snake beans, bamboo shoots, lime leaves and sliced red chilli."]}, {"isVegetarian": false, "title": "Kadaifi-wrapped king prawns with pine nut tarator", "url": "www_bbc_co_uk_food_recipes_kadaifiwrappedkingpr_90790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crusts removed", "200g/7oz pine nuts", "2 small garlic cloves, finely chopped", "½ small bunch parsley, finely chopped ", "1 lemon, juice only", "5 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "12 king prawns, shells and heads removed, de-veined", "2 tbsp lemon juice", "1 garlic clove, finely chopped", "½ tsp ground coriander", "½ tbsp Tabasco", "200g/7oz ready-made kadaifi pastry (also spelled 'kataifi'; available at some continental delicatessens and online specialists)", "24 fresh basil leaves", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the tarator, place the bread into a bowl, add enough cold water to cover the bread, then squeeze out the excess water. ", "Blend the soaked bread, pine nuts, garlic, parsley and lemon juice in a food processor until smooth and well combined. ", "Gradually add the olive oil and blend to a purée. Season, to taste, with salt and freshly ground black pepper and chill in the fridge until needed.", "For the prawns, in a bowl, mix together the prawns, lemon juice, chopped garlic, coriander and Tabasco until well combined. Chill in the fridge for two hours to marinate.", "Heat a deep fat fryer to 170C/325F/Gas 3, or until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Cut the kadaifi pastry into 12 equal pieces about 10cm/4in. Place a piece of kadaifi pastry onto a clean work surface. (Keep the remaining pastry pieces covered to prevent them drying out.) Place two basil leaves on top of the pastry. ", "Place a king prawn at one end of the pastry, then roll the pastry around the prawn until the prawn is covered in pastry. ", "Repeat the process with the remaining prawns.", "Carefully lower the wrapped prawns into the hot oil in batches. Fry for 3-4 minutes, or until the pastry is crisp and golden-brown. Remove the wrapped prawns from the oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. ", "To serve, divide the tarator among four serving plates and arrange three prawns on top of each serving."]}, {"isVegetarian": true, "title": "Kaiserschmarrn with strawberry sauce", "url": "www_bbc_co_uk_food_recipes_kaiserschmarrn_with_86930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["950g/2lb 2oz strawberries, hulled and quartered", "175g/6oz caster sugar", "175ml/6fl oz orange juice", "1 star anise, lightly toasted", "1 tbsp Grand Marnier or other orange liqueur", "50g/2oz butter, softened to butter the pans", "175g/6oz caster sugar, plus 40g/1½oz for dusting the pans", "4 free-range egg yolks, at room temperature", "115g/4oz fromage blanc", "175g/6oz crème fraîche", "75ml/5 tbsp dark rum", "75g/3oz plain flour", "60g/2¼oz golden raisins, soaked in 4 tbsp white wine", "8 free-range eggs, whites only", "½ tsp cream of tartar", "60g/2¼oz icing sugar, for dusting "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For strawberry sauce, set aside 350g/12oz of the strawberries and 60g/2¼oz of the sugar.", "In a heavy saucepan, combine the remaining strawberries, 125ml/4fl oz water, 115g/4oz of the sugar, the orange juice, star anise and Grand Marnier.  ", "Bring to a boil over medium heat, stirring occasionally to prevent scorching.  Reduce the heat and simmer for 10 minutes.", "Remove the strawberries from the heat and cover with cling film. Set aside to infuse for 10 minutes.", "Remove the star anise and pour the strawberry mixture into a blender, and blend to a fine purée.", "Strain the sauce through a fine sieve and reserve in a pan ready to use, or refrigerate if not using right away.", "Preheat the oven to 210C/425F/Gas 7.", "For the kaiserschmarrn, generously butter two ovenproof dishes 22cm/8½ in diameter.  Dust each pan with sugar and tap out any excess.", "In a medium bowl with a hand mixer, beat the egg yolks with 25g/1oz of the caster sugar until mixture is light and lemony yellow.  ", "Beat in the fromage blanc and mix until well combined.  ", "Beat in the crème fraîche and rum, then beat in the flour. Stir through the raisins.", "In another bowl and using an electric whisk or stand mixer, whisk the egg whites on medium-low speed until they foam, then add the cream of tartar.  ", "Turn the speed up to medium and continue to beat while slowly pouring in the remaining 150g/5½oz sugar. Whisk until stiff peaks form when the whisk is removed.", "Whisk half the egg whites into the crème fraiche mixture, then gently fold in the remaining egg whites.  ", "Divide the mixture equally between the two sugared pans.", "Bake the kaiserschmarrn in the middle of the oven for 15 minutes. Turn the pans if browning unevenly and bake for another 5-8 minutes, until puffed and brown.  The center should be set and slightly firm.", "Meanwhile, in a large saucepan, bring the strawberry sauce to a boil over high heat.  Add the reserved 60g/2¼oz sugar and stir until the sugar has dissolved.  Cook the sauce over a high heat for a minute.  ", "Add the reserved 350g/12oz cut strawberries, and stir through the sauce to coat. To serve, divide the strawberry sauce among four serving plates.", "Using a serving spoon divide each one into two portions and spoon on top of the strawberry sauce. Dust with icing sugar and serve immediately."]}, {"isVegetarian": false, "title": "Kale and kohlrabi kimchi with pulled pork", "url": "www_bbc_co_uk_food_recipes_kale_and_kohlrabi_kimchi_63904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz kale", "1 tsp salt", "½ lemon, juice only", "1 tbsp honey", "2-3cm/1in piece fresh root ginger, finely chopped", "2 tbsp sesame seeds", "extra virgin olive oil (optional)", "4 tbsp rice flour (alternatively use spelt or plain flour)", "8 garlic cloves, chopped", "1 onion, roughly chopped", "50ml/2fl oz fish sauce", "4 tbsp Korean chilli powder, or 2 tbsp cayenne pepper", "1 small kohlrabi (about 250g/9oz), peeled and cut into 5mm/¼in matchsticks", "1 carrot, cut into matchsticks", "1 leek, thinly sliced", "raw kale with sesame seeds and honey (from above)", "sesame seeds (optional)", "500g/1lb 2oz leftover pulled pork or shredded belly pork ", "1 loaf sourdough bread, cut into thick slices", "1 whole bulb of garlic, cut in half", "2 tbsp sea salt"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the raw kale with sesame seeds and honey, pull the kale leaves off the thick stalks. Finely chop the stalks and roughly chop the leaves, then wash both. Drain well,", "Place the kale in a bowl with the salt, lemon juice and honey. Massage the dressing into the leaves for 2-3 minutes, bruising them so they soak up the juices. Leave for 30 minutes, then pour off the excess liquid. Add the ginger and sesame seeds, mix and dress with extra virgin olive oil, if using. ", "For the kale and kohlrabi kimchi, bring 400ml/14fl oz water to a gentle simmer and add the rice flour. Keep stirring for a few minutes until it thickens and starts to bubble. Simmer for another 1-2 minutes until it becomes an opaque porridge. ", "Using a hand-held blender or a food processor, blend the garlic, onion and fish sauce to a purée. Transfer to a bowl, add the flour mixture and chilli powder. Mix well, then add the kohlrabi, carrot and leek and finally the raw kale. Mix well.", "Put into a sterilised non-metallic tub, press down to pack it in and cover with a lid. Eat it fresh with sesame seeds sprinkled on top, or leave it in a cool room for 2-3 days. After two days, check if you can see any tiny bubbles; they will prove it is fermenting. If not, leave it out of the fridge a little longer, until the fermentation process starts.", "Keep the kimchi in a sealed container in the fridge and eat within three weeks. The raw kale is best eaten immediately.", "To serve, heat a griddle pan. Slightly oil and rub the garlic and salt into the bread and cook for 1-2 minutes on each side.", "Shred leftover pork and reheat it in a frying pan until hot right through. Serve on the bread with a spoonful of kimchi on top."]}, {"isVegetarian": true, "title": "Kale and quinoa sauté with orange tahini dressing", "url": "www_bbc_co_uk_food_recipes_kale_and_quinoa_saut_64469", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_and_quinoa_saut_64469_16x9.jpg", "ingredients": ["350g/12oz quinoa", "1 tbsp extra virgin olive oil", "2 tsp coconut oil", "600g/1lb 5½oz kale, tough stalks discarded, leaves shredded, washed", "1 fat garlic clove, finely chopped", "1 large handful chopped fresh coriander or flatleaf parsley, to garnish", "1 unwaxed orange, zest only, finely sliced", "2½ tbsp tahini", "2 tbsp extra virgin olive oil", "1 garlic clove", "6 tbsp warm (boiled) water", "4 tbsp orange juice", "freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the quinoa in a bowl and cover with approximately 700ml/1¼ pints cold water. Set aside to soak overnight (or for at least 8 hours).", "Drain the quinoa and transfer to a very large saucepan. Cover with 350ml/12fl oz water and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until the quinoa is tender. ", "Drain the quinoa and put in a large mixing bowl. Drizzle over the olive oil and season with sea salt. ", "Meanwhile, for the dressing, whisk together all of the dressing ingredients until smooth, creamy and well combined, adding a splash of warm water to loosen the mixture if necessary. Season with pepper. Set aside.", "Heat the coconut oil in a frying pan over a medium heat until melted. Add the kale and stir-fry for 1-2 minutes, adding  the garlic after 1 minute. Continue to fry until the kale is just tender, then tip it into the quinoa and stir to combine.", "To serve, divide the kale and quinoa sauté equally among 4 plates, garnish with the orange zest. Drizzle over the tahini dressing and scatter over the herbs. "]}, {"isVegetarian": true, "title": "Kale, lemon, honey and sesame seed salad", "url": "www_bbc_co_uk_food_recipes_kale_lemon_honey_and_69996", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_lemon_honey_and_69996_16x9.jpg", "ingredients": ["400g/14oz kale", "1 tsp salt", "½ lemon, juice only", "1 tbsp honey", "2-3cm/1in piece fresh root ginger, finely chopped", "2 tbsp sesame seeds", "extra virgin olive oil (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pull the kale leaves off the thick stalks. Finely chop the stalks and roughly chop the leaves, then wash both. Drain well.", "Place the kale in a bowl with the salt, lemon juice and honey. Massage the dressing into the leaves for 2-3 minutes, bruising them so they soak up the juices. Leave for 30 minutes, then pour off the excess liquid. Add the ginger and sesame seeds, mix and dress with extra virgin olive oil, if using. "]}, {"isVegetarian": true, "title": "Kale, pea and ricotta fritters", "url": "www_bbc_co_uk_food_recipes_kale_pea_and_ricotta_41792", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_pea_and_ricotta_41792_16x9.jpg", "ingredients": ["120g/4¼oz frozen peas, thawed and crushed", "150g/5½oz kale leaves, finely shredded", "240g/8½oz fresh ricotta", "3 free-range eggs", "50g/1¾oz chia seeds", "1 tbsp lemon zest (approx. 1 lemon)", "2 tbsp chopped fresh mint", "2 tbsp extra virgin olive oil", "sea salt and black pepper", "1 small bunch watercress", "4 lemon wedges"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put all the ingredients, except the oil, in a bowl and mix. Season with salt and pepper and set aside for 20 minutes.", "To cook the fritters, heat a little oil in a large frying pan over a medium heat. Take about 2 tablespoons of the mixture and shape into a patty, flatten slightly. Cook in batches for 2–3 minutes on each side until golden brown, adding more oil if necessary.", "Divide the fritters between serving plates. Serve with watercress and lemon wedges."]}, {"isVegetarian": false, "title": "Kale with sweet-and-sour pork belly and quince pureé", "url": "www_bbc_co_uk_food_recipes_kale_with_sweet_and_sour_21709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2½oz acacia or Manuka honey", "50g/1¾oz tomato ketchup", "2 tbsp light soy sauce", "4 tsp rice wine vinegar", "10g root ginger, peeled and finely chopped", "½ red chilli, deseeded and finely chopped", "¼ shallot, finely chopped", "75g/2½oz quince (about ¼ large quince), peeled and cut into 2cm/¾in wedges", "500g/1lb 2oz pork belly, all bones removed, skin removed or scored", "20g/¾oz butter", "pinch sea salt", "280g/9¾oz Westland Winter or Red Curled kale leaves", "8 Nero di Toscana kale leaves", "150g/5½oz quince purée ", "1 tbsp sesame seeds, lightly toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½.", "For the pork belly, in a medium lidded casserole, mix all the ingredients except the pork. Add the belly and baste with the sauce. Bake for 3 hours, basting with the sauce every 20 minutes. When cooked, the pork will be firm but offer a little resistance when a knife is inserted. Lift the pork out of the casserole and set aside to rest, loosely covered with foil.", "Strain the cooking juices into a saucepan over a high heat and bring to the boil. Reduce the volume of liquid by half so it thickly coats the back of a spoon. Remove from the heat and reserve.", "For the kale, in a large lidded saucepan, mix together 100ml/3½fl oz water, the butter and salt and bring to the boil. Add both varieties of kale and cook, covered with a lid, for 3–4 minutes, until barely cooked but still retaining a bit of bite and their wonderful colour. Drain well.", "To serve, spread a spoonful of the quince purée in the centre of each plate. Add the kale, then slice the pork belly and divide between the plates. Finish with a little more purée and scatter over the sesame seeds."]}, {"isVegetarian": true, "title": "Karara aloo chaat (crisp potato salad)", "url": "www_bbc_co_uk_food_recipes_karara_aloo_chaat_crisp_45821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz yoghurt", "50ml/2fl oz single cream", "50ml/2fl oz sugar syrup", "siphon with two charges ", "vegetable oil, for shallow and deep frying", "500g/1lb 2oz King Edward potatoes, peeled and cut into large cubes", "100g/3½oz purple or Peruvian potatoes, thinly sliced using a mandoline", "sea salt", "100g/3½oz granulated sugar", "2 tbsp mango powder", "1 tsp mild Kashmiri chili powder or sweet paprika", "1 tbsp black salt (kala namak)", "1 tsp toasted cumin powder (seeds toasted and ground to powder)", "1 tsp ground ginger ", "1 tsp powdered fennel seeds ", "salt, to taste", "½ pomegranate, seeds only", "1 tbsp coriander leaves, chopped", "1 tbsp mint leaves, chopped", "baby watercress", "chaat masala and red chilli powder, mixed together in a shaker to sprinkle "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the yoghurt foam, mix the yoghurt, cream and sugar syrup together. Put the mixture into a siphon bottle, making sure the bottle is at least half full, and charge with two nitro cartridges. Keep the bottle chilled for two hours before using.", "For the Karara aloo chaat, in a frying pan heat a little vegetable oil and fry the King Edward potatoes in medium hot oil until almost cooked. Remove them from the pan and put them on a tray lined with kitchen paper. Place another layer of kitchen paper on top and press them flat.   ", "Fry them again to make them light brown in color and crisp.  Remove and drain on a tray lined with kitchen paper.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Deep fry the Peruvian potato slices to make crisps.  Sprinkle with sea salt and set aside until needed.", "For the spicy chutney, mix 100ml/3½fl oz of water with the sugar in a small pan and bring to the boil. Add the rest of the ingredients and simmer for 4-5 minutes, or until you have a fairly thick chutney. Add water to thin down, if required.", "To serve, toss the fried hot potatoes with the pomegranate seeds, coriander and 2-3 tablespoons of chutney. Place on a plate in 3-4 small clusters. Pipe the yoghurt foam in between and garnish with purple potato crisps, mint and watercress.  Sprinkle with chaat masala and red chilli powder."]}, {"isVegetarian": false, "title": "Kashmiri biryani", "url": "www_bbc_co_uk_food_recipes_kashmiri_biryani_14589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kashmiri_biryani_14589_16x9.jpg", "ingredients": ["2 tbsp ginger and garlic paste ", "430ml/15fl oz plain yoghurt", "½ tsp ground turmeric", "1 tbsp red chilli powder", "¼ nutmeg, grated", "1 tsp caster sugar", "1½ tsp salt", "1 lemon, juice only", "1kg/2lb 4oz mutton from leg or shoulder, bone removed, cut into 2.5cm/1in cubes", "500g/1lb 2oz basmati rice", "½ lime, juice only", "¼ tbsp salt", "150g/5½oz ghee, melted, or vegetable oil", "40g/1½oz raisins", "60g/2¼oz walnut halves", "4 green cardamom pods", "5cm/2in piece of cinnamon stick", "3 bay leaves", "1 tsp cumin seeds", "2 black cardamom pods (optional)", "2 tsp ground coriander", "1 tsp garam masala ", "½ tsp saffron strands, soaked in 120ml/4fl oz warm milk or water", "few drops rosewater or kewra water", "30g/1oz dried figs and apricots", "30g/1oz dried cranberries", "20g/¾oz fresh mint leaves"], "serves": "Serves 6–8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the marinade ingredients together in a large bowl, add the meat and stir to coat. Cover and put in the fridge to marinate for 30 minutes, or if possible overnight.", "Meanwhile, wash the rice in a couple of changes of water, then soak it for 20 minutes. Bring 2.5 litres/4½ pints of water to the boil in a large saucepan. Add the rice, lime juice and salt and boil for 6 minutes, until the rice is two-thirds cooked. Drain the rice and spread it out on a tray to cool.", "Heat two-thirds of the ghee or vegetable oil in a wide, heavy-based casserole dish. Add the raisins and fry for 30 seconds, or until they puff up, then remove them and drain on kitchen paper. Add the walnuts and fry for 30 seconds, then remove them and drain on kitchen paper.", "Add the cardamom pods, cinnamon and bay to the casserole and fry for 30–60 seconds. Add the cumin and black cardamom pods. Add the meat with its marinade and cook for 10–12 minutes over a high heat, stirring occasionally. Add the coriander, garam masala and 250ml/9fl oz of water and cook, covered, over a medium heat for 1 hour, or until the meat is tender and some sauce still remains in the pan. Add a little more water, if needed.", "To assemble, spread an even layer of the rice over the cooked meat and sauce, sprinkle the saffron milk, rose water, fried raisins and walnuts, cranberries and mint over the rice and the remaining ghee.", "Cover with a tightly fitting lid and cook over a medium–low heat for 10–15 minutes, until the dish is hot through. Set aside for another 5 minutes, then open the pot and serve."]}, {"isVegetarian": true, "title": "Katy's carrot and squash cookies", "url": "www_bbc_co_uk_food_recipes_katys_carrot_and_squash_66459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz butter, at room temperature", "70g/2¾oz plain flour, plus extra for dusting", "1 tsp golden caster sugar (optional)", "20g/¾oz grated carrot", "50g/2oz butternut squash pieces, roasted ", "3 small sprigs fresh rosemary"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, mix together the butter, flour and sugar, if using. Rub the  mixture with your fingertips until it resembles breadcrumbs.", "Stir in the grated carrot and roasted butternut squash using a fork. ", "Bring the mixture together as a dough using your hands, then turn out the dough onto a lightly floured work surface.", "Divide the dough into six equally sized pieces. Roll each piece into a sausage shape and place it onto a baking tray.", "Flatten the lengths of cookie dough into carrot shapes about 0.5cm/¼in thick, using your hands.", "Tear individual mini-sprigs off the rosemary sprigs and insert one into the top of each cookie to resemble the carrot tops.", "Bake the cookies in the oven for 15-20 minutes, or until crisp and golden-brown. Remove from the baking tray and set aside to cool on a wire rack."]}]