[{"ingredients": ["2 cucharadas de aceite de oliva", "½ zanahoria, finamente picada", "½ cebolla pequeña, finamente picada", "½ bulbo de hinojo, finamente picado", "2½ dientes de ajo, finamente picados", "½ cucharadita de hojuelas de chile rojo seco", "1 cucharadita de semillas de hinojo", "20g / ¾oz de hongos porcini secos, empapados en agua tibia durante diez minutos", "1 x 400 g / 14 oz pueden cortar tomates", "2 litros / 3 pintas de pescado de 10 fl oz", "Papas Roosevelt de 200 g / 7oz u otras papas pequeñas, peladas y cortadas en piezas de 1.5cm / ¾in", "pellizcar el azafrán", "sal y pimienta negra recién molida", "Almejas de 250 g / 9 oz, limpiadas (descarte las que no se cierran al tocarlas)", "2 filetes de salmonete", "Filete de rape a 200 g / 7 oz, sin membrana, cortado en trozos", "110ml / 4fl oz de vino blanco", "250 g / 9 oz de cola de langosta cocida y carne de garra (opcional)", "2 cucharadas de perejil de flatillo finamente picado"], "method": ["Caliente una sartén de lados profundos hasta que esté caliente y agregue una cucharada de aceite de oliva. Agregue la zanahoria, la cebolla, el hinojo, dos de los dientes de ajo picados, las hojuelas de chile y las semillas de hinojo y freír suavemente durante 2-3 minutos.", "Escurra los champiñones y exprima cualquier exceso de líquido, luego corte aproximadamente. El líquido de remojo se puede usar en otro plato.", "Agregue los porcini picados a la sartén junto con los tomates y cocine a fuego medio bajo durante 20 minutos, o hasta que los tomates se hayan descompuesto y los vegetales se ablanden.", "Agregue el caldo de pescado y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 20 minutos.", "Mientras tanto, coloque las papas en una olla con agua hirviendo junto con el azafrán y cocine durante 5-8 minutos, o hasta que estén tiernas. Escurrir y apartar.", "Retire el caldo de pescado del fuego, luego use una batidora o vierta en una licuadora y mezcle hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén poco profunda hasta que esté caliente, luego agregue la cucharada restante de aceite de oliva. Agregue las almejas, el salmonete, el rape y el vino blanco, cúbralos con una tapa y cocínelos durante 1-2 minutos, agitando la sartén de vez en cuando.", "Retire la tapa y deseche las almejas que no se hayan abierto.", "Agregue el caldo de pescado y las papas de azafrán y deje que hierva. Reduzca el fuego y cocine a fuego lento durante unos minutos, luego agregue la langosta cocida, si se usa, y continúe cocinando a fuego lento hasta que se caliente.", "En un tazón, mezcle el perejil picado con el resto del ajo picado. Espolvoree la mezcla sobre la parte superior del guiso y sirva."], "url": "www_bbc_co_uk_food_recipes_italianfishstew_87579", "title": "Guiso de pescado italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas diagonales ciabatta o baguette", "2 cucharadas de aceite de oliva", "1 diente de ajo", "1 cucharada de aceite de oliva", "1 cucharadita de hojuelas de chile seco", "¼ de cebolla picada", "1 diente de ajo, finamente picado", "100 g / 3½ oz de espinaca", "55 g / 2 oz de frijoles de una lata, enjuagados y escurridos", "1 cucharadita de perejil picado, para adornar, opcional", "sal y pimienta negra recién molida"], "method": ["Frote el pan con el aceite de oliva y sazone con sal y pimienta. Calentar una sartén hasta que se fume y rehogar el pan durante 1 minuto por cada lado hasta que quede crujiente y dorado. Frote el diente de ajo en ambos lados de cada rebanada de pan ciabatta tostado y déjelo a un lado en un lugar cálido.", "Para los granos picantes y las espinacas, caliente el aceite en una sartén a fuego alto. Agregue las hojuelas de chile, la cebolla y el ajo y fría hasta que se ablanden.", "Agregue las espinacas y los frijoles y cocine hasta que la espinaca se haya marchitado y los frijoles estén calientes. Escurra el exceso de humedad y sazone con sal y pimienta.", "Ponga la tostada en un plato, espolvoree los frijoles y la mezcla de espinacas, espolvoree sobre el perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_italianbeanandspinac_84283", "title": "Frijoles picantes en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italianbeanandspinac_84283_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cucharada de orégano", "1 cucharada de tomillo", "1 diente de ajo, aplastado", "1 cucharada de vinagre de miel", "1 cucharada de jugo de limón", "1 cucharada de puré de tomate", "2 filetes de cordero, aproximadamente 225 g / 8 oz cada uno", "2 tomates, en rodajas", "8 rebanadas de tomates secados al sol", "55 g / 2 oz de queso mozzarella, en rodajas", "1 cucharada de harina de maíz", "300ml / 10fl oz de caldo de verduras"], "method": ["Mezcle los ingredientes del adobo en un tazón, agregue el cordero, cubra y deje durante 2 horas o durante la noche en la nevera.", "Para cocinar, coloque cada filete en un cuadrado grande de papel de cocina. Cubra el filete con una capa de tomates (ambos tipos) siga esto con una capa de mozzarella y luego una segunda capa en la parte superior y vierta sobre el adobo.", "Envuelva el cordero en papel de aluminio para crear un paquete sellado, colóquelo en una bandeja para hornear y cocine a 200C / 400F / Gas 6 por 1 hora. Permita descansar en la lámina durante 10 minutos antes de cortar.", "Para la salsa: escurra los jugos de cocción en una sartén, agregue el caldo y reduzca a aproximadamente un tercio. Espesar a la preferencia con la harina de maíz. Servir."], "url": "www_bbc_co_uk_food_recipes_italianlamb_4498", "title": "Cordero italiano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva virgen extra", "3 cucharadas de agua", "500 g / 1 lb 2 oz de carne picada muy magra", "2 dientes de ajo, muy finamente picados", "puñado de perejil fresco de flatleaf, muy finamente picado", "sal", "pimienta negra recién molida", "400g / 14 oz de tagliolini frescos o secos (o tagliatelle), cocidos", "20 tomates cherry, sin semillas y en rodajas", "puñado de perejil flatleaf"], "method": ["Para hacer las albóndigas, mezcle la carne de res, el ajo, el perejil, el aceite de oliva restante y un poco de sal y pimienta. Es mucho más fácil hacer esto con tus manos. Cuando todos los ingredientes estén bien combinados, déle forma a aproximadamente 40 bolitas pequeñas.", "Para cocer al vapor, llene la olla con agua hasta la mitad y colóquela en la olla para que hierva.", "Cubra con un plato aproximadamente del mismo tamaño que la sartén, o un poco más grande, y ponga la mitad del aceite de oliva y el agua en el plato.", "Cuando el agua empiece a hervir, baje el fuego a medio, de modo que el agua hierva a fuego lento.", "Coloque las albóndigas en el plato en la parte superior de la sartén y cúbralas con un plato hacia arriba, o idealmente, un recipiente de vidrio para que pueda ver a través de él.", "Déjalo actuar durante 30 minutos, volteando las albóndigas a la mitad.", "Cuando las albóndigas estén cocidas, sáquelas del plato y vierta el licor de cocción en una sartén.", "Agregue la pasta cocida, los tomates cherry y el perejil de hojaldre y mezcle hasta que estén combinados.", "Sirve con las albóndigas al vapor."], "url": "www_bbc_co_uk_food_recipes_italianmeatballswith_70815", "title": "Albóndigas italianas con tagliolini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 berenjena, aproximadamente 350-400 g / 12-14 oz", "3 tomates maduros, picados", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "1 cucharada de hojas de albahaca fresca rasgada", "2 cucharaditas de pasta de tomate secada al sol", "6 filetes de anchoa, escurridos", "1 cucharada de alcaparras pequeñas, escurridas", "Mozzarella 150g / 5oz, escurrida", "1½ cucharadas de pan rallado fresco", "2 cucharaditas de parmesano (Parmigiano Reggiano), recién rallado", "2 cucharadas de aceite de oliva", "8 hojas de albahaca, ligeramente aceitadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4. Antes que nada, limpie la berenjena y recorte el extremo del tallo, luego use el cuchillo más afilado que tenga para cortarlo longitudinalmente en 8 rebanadas delgadas de aproximadamente 5 mm de grosor. Cuando llegue a los lados con bulbo, estas rebanadas deben cortarse en trozos pequeños y mantenerse a un lado para el relleno.", "Ahora coloque las rodajas de berenjena en hileras en la bandeja para hornear, luego cepille cada rebanada ligeramente con aceite de oliva y sazone con sal y pimienta. Póngalos en el horno en un estante alto y déjelos cocinar previamente durante 15 minutos, momento en el cual se habrán ablandado lo suficiente como para que pueda enrollarlos fácilmente.", "A continuación, vierta agua hirviendo en los tomates y después de 1 minuto de drenaje y deslice las pieles. Luego corte cada tomate por la mitad y, sosteniéndolos con la palma de su mano, apriételos suavemente hasta que salgan las semillas. ¡Es mejor hacerlo en un plato o en un tazón! Ahora usando un cuchillo afilado, corta los tomates en aproximadamente 5 mm / ¼ en dados.", "Ahora caliente 1 cucharada de aceite en una sartén grande y fría y fríe la cebolla, la berenjena picada y el ajo molido durante unos 5 minutos. A continuación, agregue los tomates picados, las hojas de albahaca rotas y la pasta de tomate y continúe cocinando durante aproximadamente otros 5 minutos. Dale a todo un buen condimento y agrega las anchoas picadas y las alcaparras. A continuación, retire la sartén del fuego y deje que la mezcla se enfríe un poco.", "Ahora corta la mozzarella en dados muy pequeños. Tan pronto como las berenjenas estén lo suficientemente frías para manipularlas, espolvorea cada una con mozzarella picada, colocándola a lo largo del centro de cada rebanada. Además de eso, ponga una cantidad igual de ingredientes de relleno, dejando un borde alrededor para permitir la expansión. Enrolle las rebanadas y colóquelas en la fuente para hornear, asegurándose de que los extremos superpuestos estén metidos debajo.", "Finalmente cepille cada una con aceite, combine las migajas de pan fresco y el parmesano rallado, espolvoree la mezcla sobre ellas, haga estallar una hoja de albahaca en la parte superior, luego cocine en el horno a la misma temperatura durante aproximadamente 20 minutos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_italianstuffedauberg_67092", "title": "Berenjenas rellenas italianas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ de cebolla, finamente picada", "1 diente de ajo, finamente picado", "250 g / 9 oz de carne picada", "sal y pimienta negra recién molida", "1 cucharadita de Romero fresco picado", "1 cucharada de aceite de oliva", "dash aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, picado", "85 g / 3 oz de champiñones castaños, en rodajas", "100 ml / 3½ fl oz de vino tinto", "1 cucharada de puré de tomate", "100ml / 3½fl oz de caldo de carne caliente", "sal y pimienta negra recién molida", "1 papa pequeña, pelada y picada, luego hervida hasta que esté tierna y escurrida", "30g / 1oz de mantequilla", "50g / 2oz de queso Port Salut, picado", "salpicar leche", "sal y pimienta negra recién molida"], "method": ["Para las albóndigas, coloque la cebolla, el ajo, la carne picada, los condimentos y el romero picado en un tazón grande y mezcle bien. Usando sus manos, dé forma a la mezcla en bolas del tamaño de una pelota de golf.", "Calentar el aceite de oliva en una sartén y freír las albóndigas durante 6-8 minutos, revolviendo con frecuencia, o hasta que estén doradas por todos lados.", "Para la salsa, agregue un poco más de aceite a la sartén con las albóndigas y saltee la cebolla durante 3-4 minutos. Agregue el ajo y cocine por un minuto. Agregue los champiñones y saltee durante 2-3 minutos.", "Agregue el vino tinto, suba el fuego y cocine a fuego lento durante 1-2 minutos. Agregue el puré de tomate y el caldo de carne y cocine a fuego lento durante 8-10 minutos, o hasta que la salsa se espese y las albóndigas estén completamente cocidas.", "Para el puré, coloque las papas cocidas en un tazón grande. Agregue la mantequilla, el queso, la leche, el aderezo y el puré junto con un triturador de papas hasta que quede suave.", "Para servir, coloque el puré en un plato de servir y póngalo sobre las albóndigas y la salsa."], "url": "www_bbc_co_uk_food_recipes_italianstylemeatball_86240", "title": "Albóndigas de estilo italiano con puré de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 patata para hornear, pelada, en cubitos", "3 dientes de ajo, ligeramente aplastados", "2 ramitas de romero fresco", "2 salchichas de cerdo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva virgen extra", "1 puñado de hojas frescas de albahaca", "1 cucharada de semillas de sésamo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la papa, el ajo, el romero y las salchichas en una lata para asar y rocíe sobre el aceite. Revuelva hasta que esté bien combinado y cubierto en el aceite, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Transfiera al horno y tueste durante 12-15 minutos, hasta que las salchichas estén cocidas y las papas estén tiernas y doradas. Gire la mezcla a la mitad del tiempo de cocción para asegurar un dorado uniforme.", "Mientras tanto, para el pesto, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que se forme una pasta homogénea.", "Para servir, coloque las salchichas y la papa sobre un plato para servir y rocíe el pesto alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_italianroastedsausag_92710", "title": "Salchichas asadas a la italiana y patatas con pesto de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ botella de whisky en miniatura", "100 ml / 3½ oz de crema doble, batida", "100g / 3½ oz de mascarpone", "50 g / 1½ oz de chocolate negro, derretido", "½ botella de whisky en miniatura", "100 ml / 3½ oz de crema doble, batida", "100g / 3½ oz de mascarpone", "100 g / 3½ oz de galletas amaretti trituradas", "1 cucharada de cacao en polvo, para quitar el polvo", "7 galletas amaretti enteras, para adornar"], "method": ["Para la crema de chocolate, coloque todos los ingredientes en un tazón y mezcle bien.", "Para la crema de amaretti, coloque todos los ingredientes en otro recipiente y mezcle bien.", "Pon la mitad de la crema de amaretti en un vaso alto y coloca la mitad de la crema de chocolate encima. Repite las capas con la crema restante.", "Para servir, espolvoree polvo de cacao y cubra con las galletas amaretti."], "url": "www_bbc_co_uk_food_recipes_italianstyletrifle_84802", "title": "Bagatela de estilo italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla", "1 diente de ajo, aplastado", "50ml / 2fl oz de vino blanco", "½ x 400 g / 14 oz pueden ciruelas, picadas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ papa para hornear, picada", "1 salchicha vegetariana, cortada a la mitad a lo largo", "1 ramita de perifollo fresco, para adornar"], "method": ["Para la salsa de tomate, caliente el aceite en una cacerola y fríe con cuidado la cebolla y el ajo hasta que la cebolla esté translúcida, alrededor de 4-5 minutos.", "Agregue el vino blanco y cocine a fuego lento durante aproximadamente un minuto, hasta que se reduzca ligeramente. Agregue los tomates y cocine a fuego lento durante otros cinco minutos. Sazonar, al gusto, con sal y pimienta negra recién molida y retirar del fuego. Procese hasta que quede suave con una batidora de mano.", "Para la papa y la salchicha, caliente el aceite en una sartén separada y fríe los cubos de papa y las mitades de salchicha hasta que estén coloreados y cocidos, aproximadamente 7-8 minutos.", "Para servir, amontone las papas y las salchichas en un plato para servir y vierta sobre la salsa de tomate. Adorne con perifollo."], "url": "www_bbc_co_uk_food_recipes_italianstyleveggiesa_88419", "title": "Estofado de verduras al estilo italiano, patata y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60ml / 2fl oz de aceite de oliva virgen extra", "1 cucharada de ajo picado", "puñado de hojas de albahaca (preferiblemente italiano), picado", "sal marina y pimienta blanca molida, al gusto", "1 kg / 2¼lb de calabacines verdes, cortados longitudinalmente en cuartos y luego en 1cm / ½ en rodajas", "750ml / 1¼ pinta de caldo de pollo", "60ml / 2fl oz de crema individual", "puñado de perejil, picado", "50g / 2oz de parmesano recién rallado, más extra para servir", "pan crujiente", "ensalada verde", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén de base pesada a fuego medio.", "Cocine el ajo, la albahaca, la sal y el calabacín lentamente durante 10 minutos o hasta que los calabacines estén ligeramente dorados y suavizados.", "Agregue pimienta blanca, al gusto, luego vierta en el caldo y cocine a fuego lento durante 8 minutos, sin tapar. Retire del fuego.", "Coloque tres cuartas partes de la mezcla de sopa en un procesador de alimentos y mezcle hasta que quede suave.", "Regrese la mezcla a la sartén y agregue la crema, el perejil y el parmesano.", "Para servir, poner la sopa en un cuenco y sazonar, al gusto, con sal y pimienta negra recién molida. Espolvorea más parmesano, al gusto. Sirva con pan crujiente y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_italianstylezucchini_9833", "title": "Sopa de calabacín y parmesano de estilo italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italianstylezucchini_9833_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla sin sal ablandada", "200g / 7oz de azúcar glas, tamizado", "100g / 3½oz de huevos batidos de granja", "Harina simple 420 g / 15 oz, tamizada", "85g / 3 oz de cacao en polvo, tamizado", "pizca de sal", "125g / 4½oz de mantequilla sin sal, ablandada", "125 g / 4½ oz de azúcar en polvo", "125g / 4½oz de huevos batidos de granja", "125g / 4½ oz de almendras molidas", "Harina normal de 25g / 1oz, tamizada", "Naranja Sevilla de 115g / 4oz", "¼ de limón sin cera", "Azúcar de mermelada de 200g / 7oz", "10g / ⅓oz de azúcar morena", "200 g / 7 oz de azúcar en polvo", "¼ de limón sin cera, solo pelado de cáscara", "semillas de ½ vaina de vainilla", "Licor con sabor a naranja 200ml / 7fl oz", "75ml / 2½ fl oz de leche", "Crema batida de 75ml / 2½fl", "30 g / 1oz de yemas de huevo batidas de corral", "15 g / ½ oz de azúcar en polvo", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (66 %% 20coca% 20solids),% 20finely% 20chopped", "15g / ½ oz de gelatina de hoja", "300 g / 10½ oz de azúcar en polvo", "100 g / 3½ oz de cacao en polvo, tamizado", "175ml / 6fl oz crema batida", "cáscara de naranja seca", "decoración de chocolate", "hoja de oro"], "method": ["Para hacer el chocolate pâte sucrée, bata la mantequilla en un tazón para mezclar hasta que esté suave y lisa. Agregue el azúcar glas y bata hasta que quede suave. Incorpore gradualmente los huevos y mezcle hasta que esté completamente emulsionado. Mezcle la harina, el cacao en polvo y la sal hasta que quede suave. Voltee la masa sobre una superficie de trabajo, móntela en un bloque y envuélvala en una película adhesiva. Deje reposar en la nevera durante 2-3 horas.", "Mientras tanto, para hacer la crema de almendras, bata la mantequilla y el azúcar en un tazón para mezclar hasta que quede suave. Poco a poco golpear los huevos hasta que se combinen. Dobla las almendras molidas y la harina y mezcla hasta que quede suave.", "Para hacer la mermelada de naranja, use un pelador para quitar la cáscara de naranja en tiras largas, luego péselo en rodajas finas y colóquelo en una bolsa de muselina. Sello. Picar las naranjas y el limón, poner en una olla con los azúcares, la bolsa de muselina y 250 ml / 9 fl oz de agua. Cocine a fuego lento, sin tapa, durante 2 horas, o hasta que la fruta esté tierna.", "Retire la bolsa de muselina y déjela a un lado para drenar. Alinee un colador con capas de muselina y colóquelo sobre un recipiente. Cuele el contenido de la sartén a través de la muselina y déjela escurrir durante 30 minutos. Exprime el líquido restante girando el paño. Deseche la pulpa.", "Regrese el líquido filtrado y la cáscara de la bolsa de muselina a una cacerola limpia, lleve a ebullición y hierva hasta que alcance 104 ° C, revolviendo continuamente. Para probar que la mermelada se está preparando, ponga una pequeña cantidad en un plato frío y déjelo enfriar. Si se establece, retire la sartén del fuego y vierta la mermelada en un recipiente esterilizado. Dejar enfriar, luego sellar.", "Para hacer el jarabe de naranja, ponga el azúcar, la cáscara de limón y la vainilla en una olla con 225 ml / 8 fl oz de agua y deje que hierva. Cocine por 2-3 minutos. Retirar del fuego y dejar enfriar. Una vez que esté frío, agrega el licor.", "Para hacer la mousse de chocolate, ponga la leche y 75ml / 2½ fl oz de crema batida en una olla y llévela a ebullición. Mientras tanto, mezcle las yemas de huevo y el azúcar en un tazón grande durante 2-3 minutos o hasta que esté claro y pálido. Vierta la mitad de la leche hervida y la crema en la mezcla de huevo y mezcle bien. Vierta esto en la sartén, mezcle y cocine a fuego lento, revolviendo continuamente, hasta que esté lo suficientemente grueso como para cubrir la parte posterior de una cuchara.", "Pon el chocolate picado en un tazón grande. Retire la mezcla de huevo y crema del fuego y páselo por un colador fino sobre el chocolate. Usa una espátula para mezclar hasta que el chocolate se haya derretido completamente y la mezcla se haya emulsionado. Dejar enfriar.", "Batir los 200ml / 7fl oz restantes de la crema batida en un tazón grande hasta que se formen picos suaves. Con cuidado, dobla la crema batida en la mezcla de chocolate y úsala de inmediato.", "Para hacer el glaseado de chocolate, remoje la gelatina en un recipiente con agua helada durante unos minutos, hasta que esté suave. Aprieta para eliminar el exceso de agua. Ponga el azúcar en una cacerola con 225 ml / 8 fl oz de agua, lleve a ebullición y cocine a fuego lento durante 2-3 minutos. Agregue el cacao en polvo y la crema. Vuelva a hervir y cocine a fuego lento durante 4-5 minutos. Retire la sartén del fuego, agregue la gelatina empapada y revuelva hasta que se disuelva. Colar y dejar enfriar.", "Para ensamblar, llena las latas de pastel con la mousse de chocolate. Aplane las partes superiores con una cuchilla de paletas pequeña y escalonada, cúbralas y colóquelas en el congelador para dejarlas durante al menos 2 horas.", "Estirar los pasteles a 3 mm de grosor y alinear las cajas de tartaletas. Cubra y descanse en la nevera durante 1 hora.", "Precaliente el horno a 200C / 180C Ventilador / Gas 6. Retire las tartas del refrigerador y vierta 10g / ⅓oz de mermelada en la base de cada una. Coloca un bulbo de crema de almendras en la parte superior, cúbrelo y déjalo reposar en la nevera durante 30 minutos.", "Hornee las tartas durante 15 minutos. Deje que se enfríe, luego quítelos de sus estuches. Si es necesario, nivele las partes superiores con un cuchillo de sierra.", "Saque las mousses de los moldes para pastel y colóquelas en una rejilla de cristal. Esmalte con glaçage y coloque uno encima de cada tartaleta. Para servir, decorar con cáscara de naranja seca, un palo de chocolate y pan de oro."], "url": "www_bbc_co_uk_food_recipes_jaffa_cake_tarts_49771", "title": "Tartas de pastel de Jaffa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar moreno (disponible en tiendas asiáticas y algunos supermercados), picados o machacados en trozos pequeños", "Mitades de nuez 50g / 2oz, conchas eliminadas"], "method": ["Coloque el azúcar moreno en una olla pequeña y caliente suavemente, revolviendo con frecuencia, hasta que se derrita y suavice.", "Agregue las mitades de nuez y revuelva para cubrir.", "Extienda las mitades de nuez en una hoja de papel para hornear o en un plato engrasado, trabajando rápidamente antes de que el azúcar moreno comience a endurecerse; si lo hace, vuelva a calentar durante unos segundos hasta que se derrita nuevamente. Deje que se enfríe por completo, luego se rompe en pedazos.", "Cuando esté frío, guárdelo en un recipiente hermético hasta que lo necesite. Sirve como aperitivo o espolvoreado sobre postres y yogures."], "url": "www_bbc_co_uk_food_recipes_jaggerycaramelisedwa_86678", "title": "Nueces caramelizadas de Jaggery", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3-5", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de puré de tomate", "7 anchoas, escurridas", "5 cucharadas de aceite de oliva", "8 rebanadas de chile jalapeño (de un tarro), o al gusto", "1 diente de ajo, aproximadamente picado"], "method": ["Mezcle todos los ingredientes y 2-3 cucharadas de agua fría en un procesador de alimentos hasta que quede suave.", "Transfiera a un frasco estéril y hermético. Esta salsa de tomate se mantendrá en la nevera por hasta 2 semanas."], "url": "www_bbc_co_uk_food_recipes_jalapeo_and_anchovy_55819", "title": "Jalapeño y ketchup de anchoas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1 jarra", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jalapeo_and_anchovy_55819_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "50 g / 2 oz de azúcar en polvo", "40 g / 1½ oz de mantequilla sin sal", "2 huevos de gallinas camperas", "2 bolsitas de 7 g de levadura instantánea", "10 g / ¼ oz de sal", "150ml / 5fl oz de leche caliente", "130 ml / 4½ fl oz de agua", "2 x frascos de mermelada de fresa"], "method": ["Para la masa, coloque todos los ingredientes en un tazón grande conteniendo un cuarto del agua.", "Revuelva con sus manos hasta que se forme una masa.", "Poco a poco agregue el agua restante y amasar la masa en el recipiente durante cuatro minutos. (Alternativamente, podría mezclar con un mezclador de pie equipado con un gancho de masa).", "Incline la masa sobre una superficie ligeramente enharinada y amasar bien durante 10 minutos, hasta que la masa esté suave y elástica.", "Coloque la masa en un recipiente limpio, cúbralo con una toalla húmeda y déjelo reposar durante una hora.", "Incline la masa sobre una superficie muy ligeramente enharinada y golpéela amasando varias veces.", "Divida la masa en 10 porciones iguales y dé forma a cada porción en una bola.", "Coloque todas las bolas en una bandeja de horno enharinada y deje que se levante durante una hora.", "Precaliente una freidora de grasa profunda, llena de aceite de girasol, a 180 ° C / 350 ° F.", "Baje cada rosquilla en la freidora, cocinando cada lado durante unos cinco minutos o hasta que estén doradas. Retire las rosquillas del aceite con una cuchara ranurada e inmediatamente ruede con azúcar impalpable para que la grasa caliente haga que el azúcar se adhiera a los lados.", "Dejar de lado y dejar enfriar.", "Cuando esté completamente frío, use un cuchillo pequeño y afilado para hacer un corte en el costado de la rosquilla, llegando al centro.", "Ponga un poco de mermelada de fresa suave o tamizada en una manga pastelera o una jeringa.", "Pipe, o jeringa, la mermelada generosamente adentro."], "url": "www_bbc_co_uk_food_recipes_jam_doughnuts_90953", "title": "Donuts Jam", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_doughnuts_90953_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.375 / 3lb 3 oz de harina de auto crianza", "200 g / 7 oz de azúcar en polvo", "550g / 1lb 4oz de leche desmenuzada", "aproximadamente 700ml / 1¼ de pinta de agua", "375 g / 13 oz de mermelada de fresa", "50ml / 2fl oz de leche entera"], "method": ["Precalentar el horno a 200C / 400F / Gas mark 6.", "Coloque la harina, el azúcar y el sebo en un recipiente y mezcle bien.", "Haga un pozo en el centro de la mezcla y agregue gradualmente suficiente agua para hacer una masa suave. Amasar ligeramente hasta que quede suave y dividir en cinco porciones de igual peso.", "Convierta cada porción de masa en una superficie enharinada y extiéndala a un rectángulo de aproximadamente 1 cm / ½ pulgadas de espesor. Extienda alrededor de un quinto del atasco en la masa dejando un borde de 1 cm / ½ pulgada.", "Enrolle desde el lado largo en un molinete, selle los extremos con un poco de agua y colóquelos en una bandeja para hornear engrasada con el sello hacia abajo. Cepille con un poco de leche.", "Repita con la masa y el atasco restantes, usando otra bandeja de horno engrasada si es necesario. Hornee en el horno durante 35-40 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_jam_roly-poly_96342", "title": "Jam roly-poly", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla ablandada, para engrasar", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "100g / 3½oz de sebo triturado", "1 cucharada de azúcar en polvo", "buena pizca de sal", "150ml / 5fl oz de leche semidesnatada o agua", "6-7 cucharadas de frambuesa o mermelada de fresa"], "method": ["Precalienta el horno a 200C / 400F / Gas 6. Manteca una hoja grande de papel a prueba de grasa y déjala a un lado.", "Mezcle la harina, el sebo, el azúcar y la sal en un tazón grande hasta que estén bien combinados. Mezcle lentamente la leche o el agua para formar una masa suave y esponjosa.", "Incline la masa sobre una superficie enharinada y amasar durante unos minutos. Ruede la masa a un rectángulo de 22cm x 32cm / 8½in x 13in.", "Extienda el atasco en la masa, dejando un borde de 1.5cm / ½ pulgada. Suavemente enrolle la masa desde el extremo corto y transfiérala al papel antigrasa, con la costura hacia abajo. Envuelva el roly poly en el papel resistente a la grasa, haciendo un pliegue largo en el pergamino para permitir que el pudín se expanda a medida que se cocina. Gira los extremos del pergamino como si fuera una galleta de Navidad y átala con un hilo de cocina para sellar el pudin que hay dentro.", "Repita el proceso con un trozo grande de papel de aluminio.", "Coloque el budín en una rejilla para asar en una lata de asar. Vierta agua hirviendo en la lata de asar hasta que esté medio llena.", "Hornee en el horno durante 30-35 minutos.", "Retire el pudín del horno, desenvuelva la lámina de aluminio, luego recorte la cuerda y desenvuelva el papel.", "El budín debe estar bien levantado y ligeramente dorado en algunos lugares. No se preocupe si la mermelada se ha abierto un poco en el exterior del pudín; sabrá aún más delicioso.", "Poner en un tablero o plato de servir y cortar en rodajas gruesas. Sirve con muchos flan o crema caliente."], "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_36901", "title": "Jam roly-poly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_roly_poly_36901_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½ oz de harina de auto crianza, tamizada", "Sebo vegetal 75 g / 3 oz", "100ml / 3½fl oz de agua fría", "pizca de sal", "5 cucharadas de mermelada de ciruela (o frambuesa, damson)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle la harina tamizada, el sebo y la sal en un tazón grande. Agregue suficiente agua para hacer una masa suave, pero no pegajosa.", "Amasar ligeramente en una tabla ligeramente enharinada durante unos minutos antes de extenderla a un grosor de 1 cm / ½ pulgada y una forma cuadrada de 20 cm / 8 pulg.", "Extiende una capa gruesa de mermelada sobre un lado de la masa, dejando 1 cm / ½ en el borde, que humedecer con un poco de agua.", "Enrolle sin apretar, pellizcando los extremos a medida que avanza para evitar que se salga el atasco. Coloque el rollo en un trozo grande de mantequilla untada con pergamino de silicona, con el borde sellado hacia abajo.", "Unir los extremos del papel y hacer una unión plisada a lo largo de la parte superior para permitir que el pudín se expanda, luego gire los extremos como un envoltorio dulce.", "Pon el pudín en una lata de pan grande o en una lata de brownie. Llene una lata de asar con agua hirviendo y colóquela en la base del horno. Luego coloque su roly poly en la rejilla superior durante 35-40 minutos.", "Sirva una rebanada gruesa, con flan casero."], "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_48764", "title": "Jam roly poly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_roly_poly_48764_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mermelada de fresa o frambuesa", "350g / 12oz de mantequilla, ablandada, más extra para engrasar", "100g / 3½ oz de jarabe dorado", "125 g / 4½ oz de azúcar en polvo", "6 huevos de gallinas camperas, ligeramente golpeados", "Harina de auto aumento 350g / 12oz", "85g / 3oz de mermelada de fresa o frambuesa"], "method": ["Mantega generosamente el interior de dos cuencos de pudín de 1,2 litros / 2 pinta.", "Coloque la mermelada en la base del recipiente para budines y reserve.", "Batir la mantequilla, el sirope dorado y el azúcar juntos en una batidora hasta que estén suaves y esponjosos.", "Batir en la mitad de los huevos seguido de la mitad de la harina y cuando esté bien combinado, agregue los huevos y la harina restantes. La mezcla debe tener una consistencia decreciente. Agregue un chorrito de leche si la mezcla es demasiado espesa.", "Con una cuchara, vierta la mezcla en los recipientes de budín, llenándolos solo tres cuartos, luego alise la superficie con el dorso de una cuchara.", "Cubra sin apretar con película adhesiva, dejando espacio para que la película se hinche a medida que se eleva la mezcla, y cocine en el microondas durante cinco minutos. El pudín se hace cuando una brocheta insertada en el centro del pudín sale limpia.", "Deje reposar durante cinco minutos y luego pase un cuchillo sin filo alrededor del borde del pudin para aflojar los lados, invierta cuidadosamente en un plato hondo y retire el lavabo.", "Para servir, vierta la mermelada extra sobre el pudin, córtela en rodajas generosas y sirva con flan."], "url": "www_bbc_co_uk_food_recipes_jam_sponge_pudding_30794", "title": "Pudín de esponja mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mostaza inglesa", "1 cucharada de vinagre de vino tinto", "2 limas, cáscara y jugo", "3 cucharadas de azúcar moreno", "2 - 3 chiles Habanero (bonete escocés), sin semillas", "5 dientes de ajo, pelados", "5 cebollas de primavera", "algunas ramitas de tomillo fresco", "1 cucharada de condimento tirón", "100ml / 3½fl oz de stock", "½ cucharadita de sal marina", "1 pollo grande (alrededor de 1,8 kg / 4 lb), espolvoreado", "aceite de maní, para frotar"], "method": ["Para el adobo, coloque todos los ingredientes en un procesador de alimentos y blitz juntos hasta que quede suave. Cubra el pollo, cúbralo y déjelo marinar en el refrigerador durante al menos dos horas, preferiblemente durante la noche.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Limpie el exceso de adobo y frote con aceite. Planche o asa el pollo con la pechuga hacia abajo, hasta que la piel comience a chamuscarse y se ponga dorada. Tenga mucho cuidado de no dejar que arda, ya que será muy fácil.", "Coloque el pollo en una bandeja para hornear y tápelo durante 35 minutos, en el horno o hasta que los jugos salgan limpios cuando la parte más gruesa de la pierna, entre el muslo y el muslo, esté perforada con un pincho y el pollo esté cocido.", "Retire del horno y deje reposar por 10 minutos, luego talle el pollo en 10 pedazos."], "url": "www_bbc_co_uk_food_recipes_jamaican_jerk_chicken_06470", "title": "pollo jamaiquino", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamaican_jerk_chicken_06470_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fresas de 350g / 12oz, sin cáscara y en cuartos", "150 g / 5½ oz de azúcar en polvo", "½ limón, ralladura y jugo", "275g / 9¾oz de harina de levante, más extra para quitar el polvo", "40 g / 1½ oz de azúcar en polvo", "110 g / 4oz de sebo triturado", "1 limón, ralladura solamente", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "1 vaina de vainilla, semillas retiradas"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Para el atasco, caliente una sartén pequeña hasta que esté caliente, luego agregue las fresas y cocine por un minuto. Agregue el azúcar y la ralladura de limón y el jugo y cocínelos durante 3-4 minutos, hasta que el azúcar se haya disuelto y la mezcla se haya espesado un poco.", "Transfiera la mitad de la mezcla a una licuadora, mezcle hasta obtener un puré, luego vuelva a ponerlo en la sartén con las fresas cocidas restantes, mezcle bien y cocine por otros 3-5 minutos, hasta que espese. Retirar del fuego y dejar enfriar.", "Para el roly poly, ponga la ralladura de harina, azúcar, sebo y limón en un tazón y mezcle bien. Haga un pozo en el centro, luego gradualmente mezcle suficiente agua para hacer una masa suave. Amasar ligeramente hasta que quede suave.", "Dé vuelta a una superficie enharinada y extiéndala a un rectángulo de aproximadamente 1 cm / ½ pulgada de grosor. Extienda el atasco en la masa dejando un borde de 2,5 cm / 1 pulg. Enrolle desde el lado largo hacia un molinete. Coloque el roly-poly en una lata de pan y cubra con papel de cocina, sellando herméticamente.", "Coloque una placa boca abajo en la base de una cacerola grande, coloque la lata de pan en la parte superior y llene la bandeja con dos tercios de agua (no permita que el agua llegue a la parte superior de la lata). Llevar a ebullición. Cubra, reduzca el fuego y cocine a fuego lento durante una hora. Retire el pudín de la lata y colóquelo en una bandeja para hornear. Hornea de 15 a 30 minutos o hasta que se dore.", "Para la crema pastelera, ponga las yemas de huevo y el azúcar en un tazón y mezcle hasta que estén bien mezclados. Coloque la leche, la crema y la vaina de vainilla en una cacerola y llévela a ebullición. Inmediatamente reduzca el fuego y cocine a fuego lento por un minuto. Vierta la leche en la mezcla de huevo y mezcle. Vuelva la mezcla a la cacerola y caliente lentamente, hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara. Retire y deseche la vaina de vainilla. Sirve el roly poly con la crema pastelera."], "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_with_80748", "title": "Jam roly poly con flan apropiado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]