[{"ingredients": ["25 g / 1 oz de jengibre fresco, pelado", "2 tallos de limoncillo", "2 chiles rojos", "3 chalotes, picados", "1 diente de ajo", "1 cucharadita de polvo de cúrcuma", "pizca de sal", "2-3 cucharadas de aceite vegetal", "400ml / 14fl oz puede leche de coco", "250ml / 9fl oz de caldo de verduras", "aceite vegetal, para freír, más 1 cucharada para freír", "Tofu fresco de 150 g / 5 oz, cortado a cuadrados de 2,5 cm / 1 pulgada, secado sobre papel de cocina", "20 hongos ostra, en rodajas finas", "8 guisantes de azúcar o tirabuzón, escaldado, cortado por la mitad", "Fideos de udon listos para usar de 400g / 14oz, cocidos de acuerdo con las instrucciones del paquete", "hojas frescas de cilantro", "rodajas de limón", "cacahuetes molidos"], "method": ["Para la pasta de especias, coloque todos los ingredientes de la pasta de especias, excepto el aceite vegetal, en un procesador de alimentos y mezcle con una pulpa.", "Con el motor todavía en funcionamiento, agregue gradualmente el aceite y continúe mezclando hasta obtener una pasta suelta (es posible que no necesite usar todo el aceite).", "Para la salsa, coloque una sartén a fuego medio. Agregue la pasta de especias y freír suavemente durante 2-3 minutos.", "Agregue la leche de coco y el caldo de verduras y deje que hierva. Reduzca el fuego y cocine a fuego lento durante otros cinco minutos.", "Para los fideos, llene a medias una sartén profunda de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue los cubos de tofu y fría durante 2-3 minutos, hasta que estén crujientes y dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Caliente la restante cucharada de aceite en una sartén limpia a fuego medio. Agregue los hongos ostra y fríalos por tres minutos, o hasta que estén blandos.", "Agregue los champiñones a la salsa.", "Agregue los guisantes de azúcar (o salsa de sarna), fideos fritos de tofu y udon a la salsa y revuelva bien para combinar.", "Para servir, cuchara al curry en tazones de servir y decorar cada uno con hojas de cilantro fresco, rodajas de limón y cacahuetes triturados, al gusto."], "url": "www_bbc_co_uk_food_recipes_malaysianspicednoodl_88721", "title": "Fideos con sabor a Malasia y tofu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malaysianspicednoodl_88721_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, más extra para engrasar", "450 g / 1 libra de pan de Malta, en rodajas finas", "2-3 cucharadas de mermelada cortada", "50g / 1¾oz sultanas", "325ml / 11fl oz de leche entera", "100ml / 3½ fl oz crema doble", "2 huevos grandes de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "2 cucharaditas de canela molida", "1 cucharada de azúcar demerara", "200 ml / 7 fl oz crema fresca", "1 naranja, solo ralladura"], "method": ["Unte con mantequilla las rebanadas de pan de malta y unte con mermelada. Cortar en triángulos.", "Engrase un plato a prueba de horno de 1,2 litros / 2 pinta con mantequilla. Coloque una capa de pan de malta en el fondo del plato.", "Espolvorea sobre algunas de las sultanas. Continúa repitiendo las capas de pan de malta y sultanas hasta que se hayan agotado.", "En una sartén, caliente suavemente la leche y la crema. Retire del fuego justo antes de que comience a hervir.", "Batir los huevos en un bol con el azúcar impalpable y la canela. Poco a poco agregue la leche tibia y la crema y continúe batiendo hasta que se incorpore toda la leche.", "Vierta la crema sobre el pan de malta y espolvoree el azúcar demerara sobre la parte superior. Deje reposar el budín durante 30 minutos antes de hornear: esto permite que el pan absorba la leche.", "Precalentar el horno a 180C / 350F / Gas 4.", "Hornee durante 30-40 minutos, o hasta que la crema se haya endurecido y el pudín esté dorado.", "Deje que el budín se enfríe un poco.", "Mezcle la crème fraîche con la ralladura de la naranja y sírvala con el pudín."], "url": "www_bbc_co_uk_food_recipes_malt_loaf_and_marmalade_19346", "title": "Pan de Malta y pudín de pan y mantequilla de mermelada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de azúcar moreno", "3 cucharadas de extracto de malta", "2 cucharadas de melaza negra", "25g / 1oz de mantequilla, más extra para engrasar", "350g / 12oz de harina de pan blanco fuerte, más extra para enharinar", "100g / 3½oz de harina integral fuerte", "pizca de sal", "14g / ½ oz de levadura de acción rápida", "225 g / 8oz sultanas", "250ml / 9fl oz de agua tibia", "1 cucharada de miel caliente, para glasear"], "method": ["Coloque el azúcar, el extracto de malta, la melaza y la mantequilla en una sartén y caliente suavemente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Deja enfriar.", "Mezcle las harinas, la sal, la levadura y las pasas en un tazón.", "Vierta la mezcla de jarabe de malta enfriada y el agua tibia. Mezcle bien; la mezcla será suave y pegajosa.", "Convierta la mezcla en una superficie enharinada y amase suavemente durante unos minutos para unir la mezcla.", "Engrase dos moldes para pan de 450 g / 1 lb y divida la mezcla entre ellos. Suavice la mezcla con la parte posterior de una cuchara para que la parte superior quede lisa y nivelada. Cubra cada lata con una bolsa de plástico para que quede suelta y no toque la parte superior de la lata. Deja durante un par de horas, o hasta que la masa haya subido a la parte superior de las latas.", "Precaliente el horno a 190C / 375F / Gas 5. Retire las bolsas de plástico y hornee por 30-40 minutos. Si la parte superior del pan comienza a dorarse demasiado rápido, cubra con una hoja de papel de aluminio y continúe horneando.", "Retire del horno y cepille la parte superior con miel tibia para glasear. Dejar enfriar sobre una rejilla.", "Rebana y come con mantequilla."], "url": "www_bbc_co_uk_food_recipes_malt_loaf_95881", "title": "Pan de Malta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 2 panes de 450 g / 1 libra", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malt_loaf_95881_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 kg / 2 lb 2 oz manzanas de cocina, peladas, sin núcleo, en rodajas", "Azúcar granulada 50g / 2oz", "2 limones, solo cáscara", "110g / 4oz de mantequilla", "50g / 2 oz de harina de maíz", "825 ml / 1 pinta 10 fl oz de leche", "Azúcar granulada 50g / 2oz", "2 huevos de gallinas camperas, golpeados", "Azúcar demerara 50 g / 2 oz", "½ cucharadita de canela molida"], "method": ["Para las manzanas, caliente una sartén grande hasta que esté medio caliente, agregue la mantequilla y las manzanas y cocine durante 6-7 minutos, o hasta que las manzanas se hayan suavizado.", "Agregue el azúcar y la ralladura de limón, revuelva bien y cocine por 2-3 minutos más. Transfiera las manzanas a un plato resistente al horno.", "Precalentar la parrilla a mediano.", "Para el relleno, caliente una cacerola hasta que esté a fuego medio, agregue la mitad de la mantequilla y cocine hasta que forme espuma. Agregue la harina de maíz y cocine durante 1-2 minutos, o hasta que espese y suavice.", "Poco a poco agregue la leche a la sartén, batiendo continuamente, hasta que se incorpore toda la leche y la mezcla esté suave y cremosa. Cocine por otros 2-3 minutos o hasta que espese.", "Retire la sartén del fuego y mezcle con el azúcar granulada y los huevos batidos hasta que estén bien combinados. Vierta la mezcla sobre las manzanas en el plato refractario.", "Mezcle el azúcar demerara y la canela molida en un tazón, luego espolvoree sobre la parte superior del plato y salpique con la mantequilla restante. Grill durante 5-6 minutos, o hasta que estén doradas y burbujeantes.", "Con una cuchara, coloca el pudín en tazones para servir poco profundos y sírvelo mientras está caliente."], "url": "www_bbc_co_uk_food_recipes_malvernpudding_92252", "title": "Pudín de Malvern", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cebollas pequeñas, finamente picadas", "20g / ¾oz de jengibre fresco rallado", "12 hojas de curry", "3 cucharadas de coco fresco rallado", "5 cucharadas de semillas de cilantro", "2 cucharadas de semillas de comino", "1 cucharadita de pimienta negra", "8 cucharadas de pulpa de tamarindo", "1litre / 1¾ pintas de caldo de verduras", "1 cucharada de sal masala", "1 cucharada de chile en polvo", "1 cucharada de curry en polvo", "3 fechas, picadas", "200ml / 7fl oz de leche de coco", "75g / 2¾oz de mantequilla sin sal", "600g / 1lb 5 oz de langostinos tigre, cabezas y cáscara eliminado, colas y limpiadas", "Harina normal de 200g / 7oz", "½ cucharadita de sal", "2 cucharadas de ghee derretido", "2 cucharadas de berro de amaranto rojo (disponible en línea), opcional", "2 cucharadas de berro de coriandro"], "method": ["Primero haz la pasta de especias. Pon los ingredientes y un poco de agua en una licuadora. Mezcle, agregando más agua si es necesario, hasta que se forme una pasta homogénea.", "Para el caldo de tamarindo, coloque todos los ingredientes en una sartén grande y cocine a fuego lento durante 20-30 minutos. Remoje las piezas de tamarindo.", "Caliente un wok y agregue la pasta de especias. Una vez caliente, agregue 200 ml / 7 fl oz de tamarindo, las fechas y la leche de coco y cocine durante 4-6 minutos.", "Calentar la mantequilla en una sartén y cocinar las gambas en cada lado durante 1-2 minutos. Revuelva las gambas cocidas en la salsa de curry y cocine durante 1-2 minutos más.", "Para el pan plano, coloca la harina en un recipiente mediano, agrega la sal y revuelve. Agregue suficiente agua hasta que la mezcla de harina se convierta en una masa. Amase hasta que quede suave y divídalo en 4 pedazos.", "Estire cada pieza en un círculo y colóquela en una sartén caliente de a una por vez. Voltee el pan una vez que hayan aparecido las marcas carbonizadas y cepille con el ghee derretido.", "Coloque el curry en un recipiente para servir poco profundo y adorne con el amaranto rojo y el berro de cilantro. Coloque el pan en un recipiente aparte y sirva."], "url": "www_bbc_co_uk_food_recipes_maldivian_prawn_curry_80612", "title": "Curry de gambas maldivas con panes planos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 alcachofas de mimos", "2 limones no encerados", "4 dientes de ajo, toscamente picados", "150g / 5½ oz chalotes, más o menos picados", "8 filetes de anchoa", "250ml / 9fl oz de vino blanco", "sal marina y pimienta negra recién molida", "10g / ¼ oz de azúcar", "Hojas de menta 5g / ⅛oz", "20g / ¾oz de pan rallado", "25 g / 1 oz de queso parmesano (o un queso duro vegetariano similar), rallado", "1,5 litros / 2 1/2 pinta de caldo de verduras, refrigerado", "2 aguacates grandes, pelados, removidos y picados", "2 chiles rojos, finamente picados", "4 cucharadas de aceite de oliva virgen extra", "1 cucharada de berro de apio", "Virutas de parmesano 8g / ⅓oz"], "method": ["Retire las hojas resistentes de cada alcachofa y corte los tallos. Bote las primeras hojas porque son demasiado amargas. Reserve el resto de las hojas exteriores duras, el tallo y la parte central si la alcachofa (el estrangulador) para el caldo. Separe las hojas tiernas del resto y frote las hojas tiernas de cada alcachofa con un limón cortado para que no se decoloren, luego coloque en un recipiente con agua para después (se comerán crudas).", "Suavemente fríe el ajo y los chalotes en un poco de aceite de oliva hasta que estén dorados. Agregue las anchoas, el vino blanco y las hojas de alcachofa y el tallo reservados. Cocine hasta que el vino se haya evaporado por completo.", "Agregue una pizca generosa de sal marina y pimienta negra recién molida, luego agregue el azúcar, la menta, el pan rallado, 5 g / ¼ oz del parmesano rallado y el caldo de verduras. Cocine a fuego lento durante aproximadamente 30 minutos. Dejar de lado para enfriar.", "Mientras tanto, mezcle el aguacate con el chile picado, un poco de jugo de limón y la ralladura de limón. Sazone al gusto con sal y pimienta negra recién molida.", "Picar la alcachofa cruda en una juliana extremadamente fina. Agregue un poco de jugo de limón y sal. Mezcle con el aguacate y reserve.", "Haga un aderezo pasando el licor de cocina de alcachofa a través de un colador fino. Mezcle con el aceite de oliva y un chorrito de jugo de limón.", "Para servir, espolvorea la mezcla de aguacate y alcachofa en un anillo de metal para cocineros de 10cm / 4in que se encuentra en el medio de cada plato para servir. Presiona suavemente para compactar.", "Con una espátula, alise la parte superior y luego retire con cuidado el anillo de metal.", "Arregle el berro de apio con virutas de parmesano. Rocíe el aderezo alrededor del plato y termine con el parmesano rallado restante."], "url": "www_bbc_co_uk_food_recipes_mammole_artichoke_salad_32574", "title": "Ensalada de alcachofa y mamola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla", "Harina normal de 275g / 9¾oz", "500ml / 18fl de leche en oz", "75g / 2¾oz de pan de migas frescas", "150g / 5½oz de queso manchego, en cubos", "1 manojo pequeño de perejil fresco, picado", "2 huevos de gallinas camperas, golpeados", "Pan rallado pancho japonés de 100 g / 3½ oz", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "Pimientos padron 200g / 7oz", "sal marina gruesa", "100g / 3½oz de jamón ibérico o jamón pata negra, para servir"], "method": ["Derrita la mantequilla en una cacerola grande, bata en 200 g / 7 oz de la harina y cocine durante 2-3 minutos. Batir la leche lentamente hasta que tenga una salsa muy espesa. Condimentar con sal y pimienta.", "Agregue las migas de pan, el queso y el perejil. Ponlo en la nevera para enfriar durante 3-4 horas. Forme la mezcla enfriada en cilindros de 7cm / 2¾.", "Precaliente una freidora a 170 ° C o llene la mitad de una sartén grande y pesada con aceite y calor hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (Precaución: El aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Ponga la harina restante, los huevos y las migas de Panko en tres cuencos separados. Cubra cada croquet en la harina, luego huevo y termine con una capa de pan rallado.", "Freír las croquetas en lotes hasta que estén doradas. Retire y escurra sobre papel de cocina.", "Para los pimientos padron, caliente una sartén hasta que esté caliente y agregue el aceite de oliva. Agregue los pimientos y fría, moviéndolos continuamente durante aproximadamente 3-4 minutos, o hasta que la piel tenga ampollas. Espolvorea sobre la sal marina y revuelve.", "Divida las croquetas, pimientos padrón y jamón entre cuatro platos y sirva."], "url": "www_bbc_co_uk_food_recipes_manchego_croquetas_with_60611", "title": "Croquetas manchegas con pimientos padrón y jamón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de polenta de cocción rápida", "150ml / ¼ pinta de caldo de verduras calientes", "Queso Manchego 75g / 3oz, rallado", "25g / 1oz de mantequilla", "3 hojas de salvia fresca picadas", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "3 hojas frescas de salvia"], "method": ["Para la polenta sabia y manchega, coloque la polenta en una olla con el caldo. Llevar a ebullición y cocine a fuego lento durante 1-2 minutos.", "Agregue el manchego rallado, la mantequilla y la salvia. Sazone con sal y pimienta negra recién molida y agregue un poco de agua si la mezcla es demasiado espesa.", "Para la mantequilla de salvia marrón-marrón, caliente la mantequilla en una cacerola pequeña hasta que tome un color marrón rojizo, teniendo cuidado de no quemarla. Agregue las hojas de salvia y cocine durante 3-4 minutos.", "Para servir, vierta la polenta en un recipiente y vierta sobre las hojas de salvia y la mantequilla marrón."], "url": "www_bbc_co_uk_food_recipes_manchegoandsagepolen_85209", "title": "Polenta sabia y manchega", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "18 cucharadas de coco desecado", "1,5kg / 3lb 5oz pasta de copos de brisa lista para usar", "harina común, para quitar el polvo", "600g / 1lb 5 oz de mermelada de frambuesa", "Frambuesas frescas de 900g / 2lb", "1.7 litros / 3 pintas de leche entera", "1½ cucharadita de esencia de vainilla", "15 yemas de huevo de gallinas camperas", "375 g / 13 oz de azúcar en polvo", "4 cucharadas de harina de maíz", "90g / 3¼ oz de azúcar glas, para quitar el polvo", "1.2 litros / 2 pintas de crema doble"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase tres tartaletas de 25cm / 10in con mantequilla.", "Caliente una sartén mediana y agregue la mitad del coco desecado y las tostadas en una sartén seca hasta que estén doradas.", "Estire la masa de pasta en una superficie de trabajo ligeramente enharinada a un grosor de 5 mm / ¼. Alinee las latas de tartas preparadas con la masa. Pinche la masa varias veces con un tenedor, luego enfríe en la nevera durante 30 minutos.", "Cuando las cajas de repostería hayan descansado, coloque una hoja de papel antigrasa en cada una y rellene a la mitad con alubias para hornear. Transfiera las cajas de repostería al horno y hornee durante 15 minutos.", "Retire el papel resistente a la grasa y los frijoles para hornear, y devuelva las cajas de repostería al horno por otros 4-5 minutos o hasta que estén pálidas doradas.", "Extiende la mermelada de frambuesa en las bases de la repostería en una capa uniforme. Espolvoree sobre el coco desecado no tostado y la mitad de las frambuesas frescas. Establecer las bases de pastelería a un lado.", "Ponga a hervir la esencia de leche y vainilla en una sartén grande, luego reduzca el fuego a fuego lento y cocine a fuego lento durante 1-2 minutos.", "En un tazón, batir las yemas de huevo y el azúcar hasta que estén bien combinados.", "Vierta la leche caliente y la vainilla sobre la mezcla de huevo y azúcar, batiendo continuamente, hasta que la mezcla esté suave y bien combinada.", "Regrese la mezcla a la sartén a fuego medio. Agregue la harina de maíz, una cucharada a la vez, hasta que estén bien combinados. Revuelva continuamente hasta que la mezcla sea lo suficientemente espesa como para cubrir la parte posterior de la cuchara.", "Transfiera la mezcla de natillas a un tazón limpio y espolvoree con el azúcar glasé (esto evita que se forme una capa en la superficie de la crema pastelera). Dejar reposar para enfriar, luego enfriar en la nevera durante 30 minutos.", "Batir la crema doble en picos suaves y mezclar en la mezcla de crema fría hasta que esté bien combinada.", "Coloque la mezcla de natillas y crema en la caja de repostería en una capa uniforme. Espolvorea sobre las frambuesas frescas restantes.", "Espolvoree con el coco desecado tostado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_manchester_tart_97027", "title": "Tarta de Manchester", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 48", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta 2fl oz leche entera", "1 limón, ralladura solamente", "50g / 2oz de mantequilla", "50 g / 2 oz de azúcar", "100g / 3½oz de pan rallado blanco", "6 yemas de huevo de granja, batidas", "4 claras de huevo de gallinas camperas", "225g / 8oz de azúcar", "mermelada de frambuesa, al gusto"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Coloque la leche y la ralladura de limón en una sartén a fuego medio. Llevar a ebullición, luego retirar del fuego y dejar enfriar durante diez minutos.", "Agregue la mantequilla y el azúcar a la leche infundida con limón, luego vuelva al fuego y cocine a fuego lento durante 3-4 minutos.", "Agregue las migas de pan y mezcle bien. Luego agregue las yemas de huevo.", "Coloque seis pequeños platos soufflé o moldes en una bandeja de horno profunda.", "Vierta cantidades iguales de la mezcla en cada molde. Vierta agua en la bandeja para que el agua llegue hasta la mitad de los lados de los moldes (esto es un baño maría).", "Cuidadosamente coloque en el horno y hornee durante 30 minutos, o hasta que los postres estén listos. Retire y deje que se enfríe un poco.", "Aumente la temperatura del horno a 240C / 445F / Gas 8.", "Mientras tanto, mezcle las claras de huevo y el azúcar hasta que se formen picos suaves cuando se quite el batidor.", "Ponga una cucharada de una buena porción de mermelada de frambuesa en el medio de cada uno de los postres, luego cubra con la mezcla de clara de huevo.", "Regrese los postres al horno en el baño maría y hornee durante 8-10 minutos, o hasta que el merengue esté listo.", "Retirar del horno y servir los budines en sus moldes."], "url": "www_bbc_co_uk_food_recipes_manchesterpudding_89966", "title": "Pudín de Manchester", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "500g / 1lb 2oz de pasta brisa lista para usar", "harina común, para quitar el polvo", "200 g / 7 oz de mermelada de frambuesa", "3 cucharadas de coco desecado, más 3 cucharadas de coco desecado, tostado en una sartén seca hasta que estén doradas, para servir", "Frambuesas frescas de 300g / 11oz", "500ml / 17fl oz de leche entera", "1 vaina de vainilla, partida, semillas raspadas con un cuchillo", "5 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "4 cornflour colmado de cucharadita", "2 cucharadas de azúcar glas, para quitar el polvo", "Crema doble de 400 ml / 14floz, batida hasta que se formen picos suaves cuando se quita la batidora"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata de tarta de 24cm / 10in con mantequilla.", "Extienda la masa de pasta brisa en una superficie de trabajo ligeramente enharinada a un grosor de 0.5cm / ¼ de pulgada. Alinee la lata tarta preparada con la masa. Pinche la masa varias veces con un tenedor, luego enfríe en la nevera durante 30 minutos.", "Cuando la caja de repostería se haya detenido, coloque una hoja de papel para hornear en ella y medio relleno con alubias para hornear. Transfiera la caja de pastelería al horno y hornee por 15 minutos o hasta que se dore.", "Retire el pergamino para hornear y los frijoles para hornear y devuelva la caja de repostería al horno por otros 4-5 minutos, o hasta que se dore.", "Extienda la mermelada de frambuesa en la base de la repostería en una capa uniforme. Espolvorea sobre las tres cucharadas de coco desecado sin tostar y la mitad de las frambuesas frescas. Establecer la base de pastelería a un lado.", "Traiga la leche, la vaina de vainilla y las semillas de vainilla a ebullición en una sartén, luego reduzca el fuego a fuego lento y cocine a fuego lento durante 1-2 minutos. Retire la vaina de vainilla (se puede limpiar a fondo y reutilizar en otra receta).", "En un tazón, batir las yemas de huevo y el azúcar hasta que estén bien combinados.", "Vierta la mezcla de leche caliente y vainilla sobre la mezcla de huevo y azúcar, batiendo continuamente, hasta que la mezcla esté suave y bien combinada.", "Regrese la mezcla a la sartén a fuego medio. Agregue la harina de maíz, una cucharada a la vez, hasta que esté bien combinada, luego caliente, revolviendo continuamente hasta que la mezcla esté lo suficientemente espesa como para cubrir la parte posterior de la cuchara.", "Transfiera la mezcla de natillas a un tazón limpio y espolvoree con el azúcar glasé (esto evita que se forme una capa en la superficie de la crema pastelera). Dejar reposar para enfriar, luego enfriar en la nevera durante 30 minutos.", "Batir la crema doble batida en la mezcla de crema fría hasta que esté bien combinada.", "Coloque la mezcla de natillas y crema en la caja de repostería en una capa uniforme. Espolvorea sobre las frambuesas frescas restantes.", "Para servir, espolvorea sobre las tres cucharadas de coco desecado tostado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_manchestertart_91315", "title": "Tarta de Manchester", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 tarta de 24 cm / 10 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "10 g / ¼ oz de sal", "25 g / 1 oz de azúcar en polvo", "10 g / ¼ oz de levadura instantánea", "20ml / 4 cucharaditas de aceite de oliva, más extra para amasar", "360 ml / 12 fl oz de agua tibia", "6 cucharadas de semillas de sésamo", "4 cucharadas de tomillo seco", "2 cucharadas de mejorana seca", "un poco de aceite de oliva"], "method": ["Mezcle la harina, la sal, el azúcar y la levadura. Agregue el aceite de oliva y 270 ml / 9½ fl oz del agua. Usando tus dedos, mezcla los ingredientes. Poco a poco agregue el agua restante hasta que toda la harina se haya desprendido de los lados del recipiente y tenga una masa blanda (es posible que no necesite toda el agua, la masa debe ser suave y no pegajosa).", "Vierta un poco de aceite en la parte superior de su trabajo. Coloque la masa en la parte superior y amase durante 5-10 minutos. La masa estará mojada al principio pero formará una masa suave una vez amasada.", "Una vez que se logra una masa suave, colóquela en un recipiente limpio y engrasado, cubra y deje doblar.", "Línea tres bandejas para hornear con papel pergamino.", "Incline la masa sobre una superficie de trabajo engrasada. Tira la masa hacia atrás plegándola sobre sí misma, repitiendo esto hasta que todo el aire se desprenda y la masa quede lisa. Divide la masa en tres y rueda en círculos grandes.", "Coloque sobre las bandejas forradas y cubra cada bandeja con una bolsa de transporte. Déjalo reposar por 20 minutos.", "Mezcle los ingredientes de cobertura con un poco de aceite de oliva hasta que tenga una pasta espesa. Precalentar el horno a 230C / 450F / Gas 8.", "Justo antes de hornear, cepille la superficie de los panes con aceite de oliva. Extienda la cobertura sobre cada uno de los panes y hornee durante aproximadamente 15 minutos.", "Retire del horno y transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_maneesh_55703", "title": "Maneesh", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 3 maneesh grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maneesh_55703_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 langostinos tigre recién cocidos", "40 mangetout, blanqueado y enfriado", "40 pinchos largos", "6 cucharadas, mayonesa de buena calidad", "1 lima, solo jugo", "2 cebollas tiernas, muy finamente picadas", "1 cuadrado de oasis empapado en agua"], "method": ["Tome una tout de la cría y ponga el pincho por un extremo, luego tome un pincho de gambas a lo largo al lado de la tirada de sarna, termine ensartando el otro extremo del mangetout. Deberías terminar con forma de media luna, con el mangetout en el exterior y la gamba en el interior. Repita este proceso hasta que se completen los cuarenta. Mantenga refrigerado hasta que esté listo para servirlos.", "Coloque la mayonesa en un tazón pequeño y mezcle la lima y las cebolletas.", "Para servir, coloca el oasis en un jarrón que es profundo, pero no demasiado ancho. Arregle los pinchos en el oasis para que se vean como flores. Sirva la mayonesa de lima en un recipiente bonito al costado."], "url": "www_bbc_co_uk_food_recipes_mangetoutandprawnske_68102", "title": "Pinchos de Mangetout y gambas con mayonesa de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de semillas de cilantro", "15g / ½ oz de semillas de comino", "5 g de pimienta negra", "2-3 vainas de cardamomo verde", "1cm / ½ en rama de canela", "3-4 chiles rojos secos, semillas retiradas", "20g / ¾oz de ajo (alrededor de 3-4 dientes de ajo), picado", "5 g de hojas de curry", "75g / 2¾oz de cebolla (alrededor de 1 cebolla pequeña) picada", "100ml / 3½ fl oz de leche de coco", "Harina blanca 250 g / 9 oz", "sal al gusto", "5 g de hojas de curry, picadas", "2 cucharaditas de semillas de hinojo trituradas", "50g / 1¾oz de mantequilla clarificada (ghee)", "50ml / 2fl oz de aceite vegetal", "2 cucharaditas de semillas de mostaza", "10 g de hojas de curry", "150 g / 5½ oz cebolla (alrededor de 1 cebolla grande), en rodajas", "½ cucharada de chile en polvo (opcional)", "Muslo de pollo de 600 g / 1 lb 5 oz, cortado en cubos de 5 cm / 2 in", "Coco deshidratado 250g / 9oz", "1 limón, solo jugo", "sal", "4 cucharadas de berros de mostaza"], "method": ["Para la pasta de especias, tueste las especias en una sartén lentamente a fuego lento hasta que estén fragantes. A continuación, muela en un molinillo de especias, agregue las especias molidas a una licuadora y mezcle hasta obtener una pasta fina con ajo, hojas de curry, cebollas y leche de coco.", "Para el pan plano, coloca la harina, la sal, las hojas de curry y las semillas de hinojo en un tazón. Mézclalos suavemente hasta que estén combinados. Agregue agua en tandas hasta que tenga una masa firme (use la menor cantidad de agua posible). Enrolla la masa en 8 bolitas, cúbrela y déjala reposar durante 30 minutos.", "Para el curry, caliente el aceite vegetal en una sartén grande. Agregue las semillas de mostaza, las hojas de curry y las cebollas. Suavemente fríe las cebollas hasta que estén transparentes, luego agrega el chile rojo en polvo seguido de la pasta de especias. Cocine por 15 minutos a fuego lento. Agregue el pollo y cocine por 10 minutos. Agregue el coco desecado. Sazonar con sal y jugo de limón.", "Cuando esté listo para cocinar el pan plano, espolvoree una superficie de trabajo con harina y saque las bolas de masa lo más finamente posible con un rodillo. Freír en una sartén grande durante unos minutos en cada lado hasta que estén cocidos. Cuando esté cocido, cepille ambos lados con mantequilla clarificada.", "Sirva el pollo al curry con hinojo y panes planos de curry. Adorne con berro de mostaza y sirva."], "url": "www_bbc_co_uk_food_recipes_mangalorean_chicken_14017", "title": "Mangalorean sukka de pollo y pan de hoja de curry", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de fideos de arroz delgados", "Mangetout 100 g / 3½ oz, cortado en tiras finas", "½ chile rojo, sin semillas, finamente picado", "2 limas, solo jugo", "2 cucharaditas de aceite de sésamo", "2 cucharaditas de salsa de soja", "1 cucharadita de azúcar en polvo", "2 cucharaditas de vinagre balsámico", "¼ de mango, pelado y picado", "1 cucharadita de aceite de oliva"], "method": ["Cocine los fideos de arroz de acuerdo con las instrucciones del paquete y drene.", "Agregue las tiras de mangetout y chili a los fideos.", "Mezcle el zumo de lima, el aceite de sésamo, la salsa de soja, el azúcar impalpable y el vinagre balsámico, mezcle los fideos y mezcle el mango.", "Para servir, amontonar en un plato y rociar con el aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_mangetoutchilliandri_86025", "title": "Ensalada de fideos Mangetout, chili y arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla roja, pelada y cortada en anillos", "pedazo de chile rojo, picado", "rociar aceite de oliva", "1 lima, solo jugo", "Mangetout de 110 g / 4 oz, muy finamente triturado", "1 cucharadita de mostaza integral", "salpicaduras de vino tinto", "4-6 cucharadas de aceite de oliva", "pizca de copos de chile", "2-3 cucharadas de vinagre balsámico"], "method": ["Para hacer la ensalada, coloque los aros de cebolla y el chile en un tazón grande.", "Rocíe el aceite de oliva y agregue el jugo de limón y mangetout. Mezcle.", "Para hacer el aderezo, mezcle la mostaza, el vino, el aceite de oliva, los copos de chile y el vinagre balsámico en una jarra o tazón hasta que se combinen.", "Transfiera la ensalada a un plato o tazón. Rocíe el aderezo para servir."], "url": "www_bbc_co_uk_food_recipes_mangetoutsaladwithmu_76066", "title": "Ensalada Mangetout con aderezo de mostaza", "time": {"preparation": "", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "½ vaina de vainilla, partido, semillas raspadas", "1 cucharada de aceite vegetal", "½ coco", "2 cucharaditas de licor de coco", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "1 mango, pelado, finamente picado"], "method": ["Para el merengue, precaliente el horno a 200C / 400F / Gas 6.", "Batir las claras de huevo en un bol hasta que se formen picos suaves cuando se quite el batidor. Agregue 100 g / 3½ oz de azúcar en polvo, poco a poco, hasta que estén bien combinados.", "Continúe batiendo hasta que las claras de huevo estén rígidas y brillantes.", "Caliente la leche, la crema y las semillas de vainilla en una olla con tapa hasta que hierva a fuego lento.", "Ligeramente aceite 2 cucharadas con el aceite vegetal y úsalas para formar quenelles de la mezcla de merengue. Cuidadosamente colóquelos en la leche hirviendo a fuego lento.", "Cubra con una tapa y cocine por 4-5 minutos, o hasta que esté recién cocido.", "Retire los merengues de la mezcla de leche con una cuchara ranurada y déjelos a un lado en papel de cocina.", "Caliente el resto de los 100 g / 3½ oz de azúcar en una sartén hasta que el azúcar se vuelva dorado pálido.", "Coloque la base de la sartén en una sartén más grande de agua fría para detener la cocción del caramelo, luego déjela reposar para que se enfríe un poco.", "Usando un pelador de patatas, pele las virutas de la pulpa de coco y colóquelas en una bandeja para hornear. Tostarlos en el horno durante 3-4 minutos, o hasta que estén pálidos dorados.", "Para la crema pastelera, cuele la mezcla de leche utilizada para cocinar los merengues en una olla limpia, vuelva al fuego y agregue el licor de coco.", "Batir las yemas de huevo y el azúcar en un recipiente hasta que estén bien combinados. Batir la mezcla de leche hasta que esté bien combinada.", "Regrese la mezcla a la cacerola, agregue el mango picado y cocine a fuego lento, revolviendo continuamente, hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara.", "Para servir, espolvorea la crema de mango en tazones para servir y coloca el merengue en la parte superior. Esparce sobre el coco tostado. Use el reverso de una cuchara para tirar de la mezcla de caramelo y rocíe sobre la parte superior del merengue."], "url": "www_bbc_co_uk_food_recipes_mango_and_coconut_iles_39437", "title": "Mango y coco flotantes iles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 hojas de gelatina de hoja", "1 mango maduro grande (aproximadamente 450 g / 1 lb)", "1 lima, ralladura fina solamente", "150ml / 5fl oz de crema doble"], "method": ["Llene la mitad de un tazón con agua fría y agregue las hojas de gelatina de a una por vez. Déjalo en remojo durante 5 minutos.", "Corta el mango por la mitad a cada lado de la gran piedra plana. Usando una cuchara grande, saque la carne y colóquela en un procesador de alimentos. Agregue la ralladura de lima y mezcle hasta que esté lo más suave posible. Esto puede tomar un par de minutos.", "Ponga 5 cucharadas de agua en una olla pequeña y caliente muy suavemente hasta que esté tibio. Levante las hojas de gelatina del agua fría con los dedos y colóquelas cuidadosamente en agua tibia, revuelva vigorosamente con una cuchara de madera durante unos segundos hasta que la gelatina se disuelva. Retire del fuego.", "Batir la crema con un batidor eléctrico en un tazón grande hasta que quede en picos bastante rígidos.", "Con el motor funcionando en el procesador de alimentos, vierta la solución de gelatina lentamente en el puré de mango y pulse hasta que esté completamente combinada.", "Ponga 6 cucharadas de puré de mango en un tazón pequeño. Agregue el puré restante a la crema batida y mezcle ligeramente hasta que esté suave.", "Pon la mitad de la crema de mango en cuatro vasos de vidrio y coloca la mitad del puré de mango encima. Coloque el resto de la crema de mango encima y luego termine con el puré restante. Cubra los platos con film transparente y deje enfriar durante al menos 3 horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_mango_and_lime_mousse_97668", "title": "Mousse de lima y mango sin azúcar", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mango_and_lime_mousse_97668_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "125g / 4oz de azúcar en polvo", "125g / 4oz de azúcar glas, tamizado", "1 x 425 g / 15 oz de mango en rodajas, escurrido (jugo descartado)", "1 lima, ralladura fina solamente", "2 maracuyá, pulpa sacada"], "method": ["Precalentar el horno a 110C / 225F / Gas ¼. Cubra una bandeja para hornear con papel resistente a la grasa.", "Batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor. Agregue lentamente el azúcar impalpable, batiendo bien después de cada adición, hasta que la mezcla esté suave y brillante.", "Cuidadosamente dobla un tercio del azúcar glas y luego repite con los dos tercios restantes.", "Coloque la mezcla de merengue en una manga pastelera y vierta 18 pequeñas porciones de merengue en la bandeja de horno revestida. Haga un pequeño hueco en la parte superior de cada merengue con la parte posterior de una cucharadita (para que se llene el relleno), luego cocine en el horno durante 1½ -1¾ horas, o hasta que esté cocido.", "Mientras tanto, para el relleno, mezcle las rebanadas de mango y la ralladura de lima con un puré en un procesador de alimentos. Agregue la pulpa de una de las frutas de la pasión.", "Para servir, vierta un poco de puré de mango y maracuyá en el hueco de cada merengue y rocíe sobre la pulpa de maracuyá restante."], "url": "www_bbc_co_uk_food_recipes_mango_and_passion_fruit_29092", "title": "Merengues de mango y fruta de la pasión", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Cumple 18 años", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["240 g / 8½ oz de azúcar en polvo", "20g / ¾oz de glucosa líquida", "4 claras de huevo de rango medio", "4 huevos medianos de granja, separados", "Azúcar en polvo de 120 g / 4 oz, más extra para quitar el polvo", "pizca de sal de mesa", "Harina normal de 120g / 4oz", "100 g / 3½ oz de azúcar en polvo", "mantequilla sin sal, para engrasar", "4 yemas de huevo de rango medio", "125 g / 4½ oz de azúcar en polvo", "125g / 4½oz de harina común, tamizada", "30g / 1oz de mantequilla, derretida", "2 cucharadas de leche", "Frambuesas de 400g / 14oz, mezcladas a un puré y tamizadas (se requiere un puré de 200 ml / 7 fl oz)", "½ lima, solo jugo", "3 yemas de huevo grandes de gallinas camperas", "20 g / oz de azúcar en polvo", "3 hojas de gelatina de hoja, empapada en agua fría durante 10 minutos", "Crema doble de 200 ml / 7 fl oz", "2 cucharadas de leche", "200ml / 7fl oz de pulpa de mango tamizada", "½ lima, solo jugo", "3 yemas de huevo de gallinas camperas", "20 g / oz de azúcar en polvo", "3 hojas de gelatina de hoja, empapada en agua fría durante 10 minutos", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl oz puré de mango", "3 hojas de gelatina, empapadas en agua fría durante 10 minutos", "1 mango, pelado, sin hueso y carne cortada en rodajas largas", "1 frambuesa pequeña", "hoja de oro comestible (opcional)"], "method": ["Para el merengue italiano, ponga 55ml / 2fl de agua en una sartén con el azúcar y la glucosa. Caliéntelo suavemente a 110 ° C (verifique con un termómetro de azúcar) y luego vigílelo de cerca y retírelo del fuego tan pronto como alcance los 120 ° C.", "Mientras tanto, batir las claras de huevo a picos suaves en una batidora independiente. Tan pronto como el azúcar llegue a 120 ° C, añádalo lentamente a las claras de huevo en una corriente constante y fina con el motor funcionando todo el tiempo. Deje que se mezcle durante 15 minutos o hasta que el recipiente esté frío. Dejar de lado.", "Para los dedos de la esponja, precaliente el horno a 190C / 170C Ventilador / Gas 5. Engrase ligeramente 3 bandejas para hornear y alinee con papel para hornear.", "Batir las yemas de huevo con la mitad del azúcar hasta que estén pálidas y lo suficientemente gruesas como para dejar rastros en la superficie de la mezcla cuando se quite la batidora (la etapa de la cinta).", "En un recipiente aparte, bata las claras de huevo con el azúcar restante y la sal hasta que se formen picos suaves cuando se quite el batidor. Doble las claras de huevo en la mezcla de yema de huevo con una cuchara de metal. Dobla la harina. Transfiera la mezcla a una manga pastelera unida con una boquilla grande y lisa.", "Pipe en líneas de 11cm / 4in espaciadas a 2.5cm / 1in. Haga un jarabe calentando el azúcar con 100ml / 3½fl oz de agua. Espolvorea el almíbar sobre los dedos de la esponja y hornea por 10 minutos. Dejar enfriar sobre una rejilla.", "Para la esponja génoise, precaliente el horno a 200C / 180C Fan / Gas 6. Engrase y forme una lata de rollo suizo.", "Batir las yemas de huevo y el azúcar hasta que estén pálidas y lo suficientemente espesas como para dejar rastros en la superficie de la mezcla cuando se quite el batidor (la etapa de cinta). Doble suavemente la harina tamizada y la mantequilla derretida.", "Vierta la mezcla en la lata preparada y hornee durante 10 minutos, o hasta que estén dorados y elásticos para tocar. Déjelo a un lado para que se enfríe un poco, luego retírelo de la lata y déjelo enfriar completamente en una rejilla. Recorta 2 círculos de pastel de 18cm / 7in.", "Para el bavarois de frambuesa, caliente la leche, el puré de frambuesa y el jugo de lima en una sartén grande.", "Con una batidora eléctrica, bata las yemas de huevo y el azúcar hasta que estén pálidas y dupliquen su volumen. Cuando la mezcla de frambuesas hierva, agréguela lentamente a la mezcla de huevos en un vapor firme y constante, batiendo todo el tiempo. Regrese la mezcla a la sartén y caliéntela suavemente durante unos minutos hasta que esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara (no la deje hervir ya que podría romperse).", "Exprima cualquier exceso de líquido de la gelatina y revuelva en la mezcla de frambuesa hasta que se disuelva. Deja enfriar.", "Batir la crema hasta que quede lo suficientemente espeso como para dejar rastros en la superficie cuando se quite la batidora (la etapa de la cinta). Agregue 120 g / 4 oz del merengue italiano enfriado y mezcle con una espátula de silicona. Agregue la mezcla de frambuesa y deje enfriar hasta que esté lista para usar.", "Alinee una lata de pastel de 20 cm / 8 in con film transparente, asegurándose de que haya suficiente saliente a los lados. Coloque uno de los discos de esponja génoise en el fondo de la lata (el disco de la torta debe ser más pequeño que la base para permitir que los dedos de la esponja se sienten cómodamente dentro).", "Recorta uno de los extremos de los dedos de la esponja para que todos tengan la misma longitud y se asienten perfectamente en la lata. Coloque los dedos de la esponja alrededor del lado de la lata con una ligera superposición para asegurarse de que no haya espacios (para evitar que se filtre el relleno). Vierta el bavarois de frambuesa, alise la superficie y transfiéralo a la nevera para prepararlo (haga esto en el congelador si le falta tiempo).", "Para el mango bavarois, caliente la leche, la pulpa de mango y el jugo de lima en una sartén grande.", "Con una batidora eléctrica, bata las yemas de huevo y el azúcar hasta que estén pálidas y dupliquen su volumen. Cuando la mezcla de mango hierva, agréguela lentamente a la mezcla de huevo en un vapor firme y constante, batiendo todo el tiempo. Regrese la mezcla a la sartén y caliéntela suavemente durante unos minutos hasta que esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara (no la deje hervir ya que podría romperse).", "Exprima cualquier exceso de líquido de la gelatina y revuelva en la mezcla de mango hasta que se disuelva. Deja enfriar.", "Batir la crema hasta que quede lo suficientemente espeso como para dejar rastros en la superficie cuando se quite la batidora (la etapa de la cinta). Agregue 120 g / 4 oz del merengue italiano enfriado y mezcle con una espátula de silicona. Agregue la mezcla de mango y deje enfriar hasta que esté listo para usar.", "Cuando el bavarois de frambuesa esté listo, agrega el segundo disco de esponja génoise y cúbrelo con el bavarois de mango. Alise la superficie y enfríe hasta que se endurezca.", "Para la gelatina de mango, caliente el puré de mango hasta que alcance el punto de ebullición. Retirar del fuego y enfriar durante 5 minutos.", "Exprima cualquier exceso de líquido de la gelatina y revuelva en el mango hasta que se disuelva.", "Cuando el mango bavarois esté listo, vierta la gelatina de mango en la parte superior y deje enfriar hasta que se asiente.", "Cuando la gelatina esté colocada, retire con cuidado la charlotte russe de la lata y colóquela en un plato para servir.", "Coloque cualquier merengue restante en una manga pastelera equipada con una boquilla de estrella grande. Coloca las rosetas del merengue en el borde de la gelatina y cubre cada una con una frambuesa. Coloque las rebanadas de mango sobre la gelatina, comenzando en el centro y abanicándose hacia afuera como los radios de una rueda de bicicleta. Coloque las frambuesas restantes alrededor de la parte inferior de la hoja y cubra con una hoja de oro, si las usa."], "url": "www_bbc_co_uk_food_recipes_mango_and_raspberry_80510", "title": "Mango y frambuesa charlotte russe", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]