[{"ingredients": ["1 cola de rape, lomos retirados", "1 cucharada de aceite de oliva", "pellizcar el azafrán", "1 cucharadita de pimentón", "200g / 7oz de chorizo, cortado en cubos de 1cm / ½ en", "1 x 400 g / 14 oz de garbanzos de lata, escurridos", "1 cucharada de vinagre balsámico añejo", "100g / 3½oz de aceitunas verdes, apedreado, reducido a la mitad", "4 tomates de ciruela madurados en la vid, sin semillas y finamente picados", "1 cebolla roja pequeña, pelada y finamente picada", "150g / 5½ oz de camarones frescos pelados", "1 limón, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de cebollín fresco, finamente picado", "1 lechuga frisée, hojas centrales retiradas"], "method": ["Coloque el rape en un recipiente y agregue el aceite de oliva, el azafrán y el pimentón. Mézclalos, cúbrelos con una película adhesiva y colócalos en la nevera durante dos horas, pero ya no más, ya que la acidez comenzará a cocinar el pescado.", "Caliente una sartén grande y agregue el chorizo. Una vez que el aceite ha sido liberado y ha comenzado a crujir, vierta un poco de aceite de la sartén en un recipiente y déjelo a un lado. Agregue los garbanzos a la sartén y cocine durante 4-5 minutos más.", "Retire del fuego, agregue las aceitunas balsámicas y verdes, y reserve.", "Coloque los tomates, la cebolla roja y los camarones en un tazón y mezcle.", "Agregue el jugo de limón al aceite de chorizo, sazone con sal y pimienta, y reserve.", "Caliente una sartén grande, agregue el rape y selle todo, luego cocine durante 5-8 minutos (dependiendo del tamaño del lomo). Retire del fuego y reserve para descansar durante cinco minutos.", "Para servir, agregue un par de cucharadas de aderezo de chorizo ​​y cebollín a la ensalada de gambas y salpique alrededor de los platos. Ponga una cucharada de ensalada de chorizo ​​y garbanzo en una línea en el centro de los platos. Cortar el rape en un ángulo y colocar encima de los garbanzos. Cubra con un poco de lechuga frisée y rocíe más aderezo en la parte superior."], "url": "www_bbc_co_uk_food_recipes_monkfish_chorizo_and_98370", "title": "Ensalada de rape, chorizo ​​y garbanzo con aderezo balsámico, tomate y limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de cuscús", "2g de sal", "50ml / 2fl oz de aceite de oliva", "exprimir jugo de limón", "10g de avellanas tostadas picadas", "10g de pistachos tostados picados", "10g de perejil picado", "10g cebollines picados", "100ml / 3½fl oz de aceite de oliva", "4 filetes de rape de x 120g / 4oz", "sal", "½ limón, solo jugo", "2 chorizos pequeños sin cocinar, cortados a la mitad longitudinalmente", "50g / 1¾oz aster de mar", "50g / 1¾oz de hinojo de mar", "50g / 1¾oz de verdolaga", "50ml / 2fl oz de aceite de oliva", "10g de perejil picado", "10g cebollines picados", "10 aceitunas verdes, piedras removidas, más o menos picadas", "½ limón, solo jugo"], "method": ["Para el cuscús israelí, coloca el cuscús en una sartén con sal, aceite de oliva y 100 ml de agua. Llevar a ebullición y luego retirar del fuego, cubrir con una película adhesiva y dejar que hierva durante 10 minutos.", "Una vez que el cuscús esté cocido, agregue algunas gotas de jugo de limón, nueces y hierbas picadas y revuelva. Cubre nuevamente con una película adhesiva y mantén el calor.", "Para el rape y el chorizo, calienta dos sartenes antiadherentes con un poco de aceite. Sazonar el rape con un poco de sal, luego coloque en la sartén caliente con la piel hacia abajo y cocine por 2-3 minutos, o hasta que se dore. Voltee, agregue el jugo de limón y déjelo en la sartén por un minuto para que descanse.", "Al mismo tiempo, cocine los chorizos en la otra sartén, colocándolos con el lado cortado hacia abajo, sin ningún condimento.", "Para las verduras de mar, ponga a hervir una olla pequeña de agua sin sal. Agregue los vegetales marinos y cocine por 30 segundos, luego retírelos y drene.", "Para la salsa de aceite de oliva, en una sartén pequeña calentar suavemente el aceite de oliva, el perejil, el cebollín, las aceitunas verdes y el jugo de limón. Esto llevará unos dos minutos.", "Para servir, ponga 3-4 cucharadas de cuscús en cada tazón para servir, coloque el rape en la parte superior y luego coloque un trozo de chorizo ​​encima. Arregle las verduras marinas alrededor y sobre los peces. Vierta 2-3 cucharadas de salsa de aceite de oliva sobre el pescado y sirva."], "url": "www_bbc_co_uk_food_recipes_monkfish_israeli_55616", "title": "Rape, cuscús israelí, verduras de mar y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de rape de x 200g / 7oz, de una cola de 1.5-2kg", "Sal gruesa del mar 110g / 4oz", "110 g / 4 oz de curry en polvo ennegrecido (disponible en proveedores especializados)", "6 tallos de brócoli brotación púrpura", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "1 cucharada de aceite de oliva", "2 chalotes, en rodajas finas", "1 diente de ajo, en rodajas", "2 ramitas de tomillo", "2 ramas de mejorana", "2 hojas de laurel", "2 cucharaditas de semillas de comino", "6 albaricoques secos", "6 cucharadas de pasas doradas", "1 verter el jefe de la tienda", "110g / 4oz de trigo agrietado", "Stock de pollo blanco 325ml / 12floz, caliente", "1 cucharada de hojas de menta, trituradas", "1 cucharada de hojas de cilantro, ralladas", "½ chile rojo, finamente picado", "aceite de oliva, para freír", "1 chalote, finamente cortado", "1 bulbo de hinojo, finamente cortado", "1 cucharadita de curry en polvo", "1 verter el jefe de la tienda", "pellizcar el azafrán", "2 cucharaditas de pasta de tomate", "Stock de mejillón 500ml / 18floz o stock de pescado", "Crema doble 250ml / 9floz", "250ml / 9floz de yogur griego", "1 limón, solo jugo", "16 mejillones frescos grandes", "cilantro picado, para adornar"], "method": ["Para los peces, cubra el rape con sal marina gruesa durante cuatro minutos, luego lávelos con agua fría, envuélvalos en un paño limpio o en un paño de cocina, colóquelos en el refrigerador y déjelos secar (normalmente durante 4-6 horas). )", "Una vez que el pescado esté seco, cúbralo con el curry ennegrecido hasta que ya no pueda ver el color natural del pescado. Dejar de lado hasta que esté listo para cocinar.", "Para el trigo partido, caliente una sartén hasta que esté medio caliente, agregue la mitad del aceite de oliva, los chalotes, el ajo, el tomillo, la mejorana, el laurel y el comino hasta que estén blandos.", "Agregue los albaricoques y las pasas y cocine durante dos minutos.", "Agregue la cocina ras el hanout por dos minutos. Agregue el trigo agrietado y suba el fuego hasta que el trigo se ponga ligeramente dorado.", "Agregue el caldo de pollo caliente, revuelva bien y luego retírelo del fuego. Cúbralo con una tapa o película adhesiva y déjelo reposar en un lugar cálido durante 20 minutos.", "Rompe con un tenedor y luego vuelve a colocar sobre el calor para calentar con un poco más de aceite de oliva.", "Agregue la menta, el cilantro y el chile y revise el condimento.", "Para los mejillones, caliente una sartén hasta que esté medio caliente, agregue el aceite de oliva, los chalotes, el hinojo y el curry en polvo. Cocine hasta que las verduras estén blandas, agregue el ras el hanout, el azafrán y la pasta de tomate y cocine por dos minutos más.", "Agregue el caldo, reservando algunas cucharadas para cocinar los mejillones más tarde, y cocine hasta que se reduzca en volumen a la mitad.", "Agregue la crema y hierva durante 3-4 minutos.", "Agregue el yogur griego y ponga a hervir. Agregue el jugo de limón y sazone al gusto con sal y pimienta negra recién molida. Pase a través de un tamiz y luego reserve.", "Para cocinar los mejillones, caliente el caldo reservado en una olla con tapa hasta que hierva a fuego lento. Deseche cualquier mejillón que esté rajado, o cualquier otro abierto que no se cierre cuando se le da un golpecito fuerte.", "Agregue los mejillones y coloque la tapa en la sartén. Deje que hierva hasta que los mejillones se hayan abierto. Deseche cualquier que no se abra después de cocer al vapor.", "Retire los mejillones de sus caparazones y agregue a la salsa. Termina con el cilantro picado.", "Para el brócoli, ponga a hervir una sartén con agua con sal, agregue el brócoli y hiérvala por 2-3 minutos hasta que esté tierna.", "Escurrir y sazonar con un poco de sal y pimienta negra.", "Para cocinar el rape, precaliente el horno a 200C / 400F / Gas 6. Caliente el aceite vegetal en una sartén y agregue el rape y fría por un minuto en cada lado. Luego colóquelo en el horno por cuatro minutos. Retire del horno y deje reposar durante cuatro minutos antes de servir.", "Para servir, espolvorea el trigo agrietado en el centro de los tazones para servir.", "Tallar el rape en dos pedazos de igual tamaño y sentarse encima del trigo agrietado", "Con una cuchara, coloca la salsa alrededor del borde del pescado y luego termina con el brócoli."], "url": "www_bbc_co_uk_food_recipes_monkfish_tail_with_39134", "title": "Rape de rape con especias ennegrecidas, brócoli con brotes morados y mejillones ligeramente especiados", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3-4 vainas de cardamomo", "1 flor de macis", "30g / 1oz anacardos", "30 g / 1 oz de almendras molidas", "Jengibre de raíz de 5cm / 2in", "3-4 dientes de ajo", "150 g / 5 oz de yogur de estilo griego", "150ml / 5fl oz de crema doble", "1 cucharadita de jugo de lima", "1 cucharadita de sal", "2 cucharadas de aceite vegetal", "Rape de 300g / 11oz, cortado y cortado en pedazos de 2.5cm / 1in", "2 dientes de ajo, finamente picados", "Jengibre de raíz de 5cm / 2in, pelado y más o menos picado", "1 chile verde, finamente picado", "1 cebolla roja, finamente picada", "3 tomates, toscamente picados", "Crema doble de 200 ml / 7 fl oz", "Harina normal de 300g / 11oz", "150ml / 5fl oz de agua"], "method": ["Para el rape, rompa las vainas de cardamomo y la flor de macis. Colóquelos en una sartén de base pesada y fría a fuego lento durante 2-3 minutos.", "Coloque el cardamomo, la maza y los ingredientes restantes, excepto el rape, en un procesador de alimentos y mezcle hasta que quede suave.", "Coloque el rape en un tazón y vierta sobre el adobo. Cubra con film transparente y enfríe en el refrigerador durante 6-8 horas o durante la noche.", "Para el roti, coloque la harina en un recipiente y agregue gradualmente el agua, batiendo bien para formar una masa firme. Incline la masa sobre una superficie de trabajo enharinada y amase durante un par de minutos hasta que quede suave. Cubra la masa con film transparente y reserve para descansar durante dos horas.", "Quite las piezas de masa del tamaño de una nuez y extiéndalas delgadas hasta un diámetro de 12.5 cm.", "Caliente una sartén hasta que esté muy caliente y fría la masa durante 1-2 minutos en cada lado (o hasta que aparezcan burbujas en la superficie).", "Retire el roti de la sartén con un par de tenazas y sujételo cuidadosamente sobre una llama de gas hasta que se infle. Repita con la masa restante.", "Para la salsa, caliente el wok hasta que esté caliente, agregue el aceite, el ajo, el jengibre y el chile y fríalos por 1-2 minutos hasta que estén recién coloreados.", "Agregue la cebolla y cocínela durante 2-3 minutos. Agregue los tomates y cocínelos durante 4-5 minutos hasta que se ablanden. Agregue la crema y vuelva a hervir a fuego lento.", "Caliente una sartén hasta que esté muy caliente, agregue el rape y la plancha en cada lado durante un minuto hasta que esté recién cocido. A continuación, agregue el rape a la salsa y sazone, al gusto, con sal y pimienta negra recién molida. Finalmente, agregue el cilantro.", "Coloque el roti en el plato y luego espolvoree el rape y la salsa."], "url": "www_bbc_co_uk_food_recipes_monkfish_tika_masala_19350", "title": "Rape tikka masala con roti", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700ml / 1¼ pintas de caldo de pescado o agua salada", "12 grandes gambas crudas, cabezas y caparazones eliminados pero reservados, colas en", "3 cucharadas de vinagre de vino tinto", "1 cucharada de azúcar en polvo", "2 cucharadas de aceite de oliva", "30g / 1oz de mantequilla", "5 dientes de ajo, picados", "½ cebolla, más o menos picada", "1 apio en barra, aproximadamente picado", "1 pimiento verde, sin semillas y tostado", "100 ml / 3½ fl oz de vino blanco seco", "1 cucharadita de sal", "10 vueltas de peppermill negro", "½-1 cucharadita de hojuelas de chile rojo seco", "400g de tomates cortados en lata", "20 mejillones, fregados y rellenos", "250g / 9oz de rape, cortado en pedazos de 4cm / 1½in", "1 cucharadita de orégano seco", "6 rebanadas de pan de masa fermentada", "1 diente de ajo, pelado y cortado por la mitad", "aceite de oliva", "pequeño puñado de perejil, toscamente picado"], "method": ["Deje que el caldo hierva a fuego lento, agregue las cabezas de gambas y las cáscaras y cocine a fuego lento durante 20 minutos. Cuele el caldo en un recipiente limpio y déjelo a un lado.", "Ponga a hervir el vinagre y el azúcar en una olla pequeña y cocine a fuego lento hasta que se reduzca a la mitad. Dejar de lado.", "Caliente el aceite y la mantequilla en una olla grande con tapa. Agregue el ajo, la cebolla, el apio y el pimiento verde y cocínelos durante 6-8 minutos o hasta que estén suaves. Agregue vino blanco, sal, pimienta, hojuelas de chile, tomates, caldo de pescado y reducción de vinagre. Cocine a fuego lento durante 30 minutos, agregando el orégano durante los últimos 5 minutos.", "Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos. Agregue las gambas, el bacalao y los mejillones, cubra la olla con una tapa y cocine durante 5 minutos.", "Mientras tanto, tuesta la masa madre en ambos lados y chamusque cuidadosamente sobre una llama de gas. Frote la tostada con el lado cortado del ajo y rocíe con aceite de oliva.", "Antes de servir, deseche los mejillones que permanecen cerrados. Coloque una rebanada de pan tostado en cada tazón, cocine en un poco de estofado y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_monkfish_mussel_and_90131", "title": "Estofado de rape, mejillones y gambas con masa madre (cioppino)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/monkfish_mussel_and_90131_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de curry en polvo", "½ cucharadita de sal", "Cola de rape de 600g / 1lb 5oz, limpiada y cortada en 4 piezas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "50g / 2oz de mantequilla sin sal", "½ limón, solo jugo", "40g / 1½ oz chalotes, picados", "1 hoja de laurel", "1 ramita de tomillo fresco", "1 ramita de estragón fresco", "½ cucharadita de hilos de azafrán", "200ml / 7fl oz de vino blanco", "Mejillones de 1.5kg / 3lb 6oz, barbas quitadas", "Crema doble 110ml / 4fl oz", "200ml / 7fl oz de caldo de pescado caliente", "1 cucharadita de mostaza integral", "2 cucharadas de estragón fresco picado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "En un tazón, mezcle el polvo de curry y la sal hasta que estén bien combinados. Se dragan las piezas de rape en el polvo y se sazonan con pimienta negra recién molida.", "Caliente el aceite en una sartén a prueba de horno a fuego medio, agregue las piezas de rape y fría durante 3-4 minutos por cada lado, o hasta que estén doradas por ambos lados.", "Agregue la mitad de la mantequilla a la sartén, luego transfiera al horno y cocine durante 4-5 minutos más, o hasta que el rape esté bien cocido. Retire del horno y exprima el jugo de limón.", "Caliente la mantequilla restante en una sartén grande a fuego medio hasta que haga espuma. Agregue los chalotes y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue la hoja de laurel, tomillo, estragón y hebras de azafrán y mezcle bien.", "Agregue el vino blanco, revuelva bien y ponga la mezcla a ebullición. Reduzca el fuego a fuego lento y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema y el caldo de pescado y lleve la mezcla a ebullición.", "Agregue los mejillones, cubra la olla con una tapa y cocine durante 4-5 minutos, sacudiendo la olla de vez en cuando, hasta que los mejillones se hayan abierto. Deseche cualquier mejillón que permanezca cerrado.", "Retire los mejillones de la sartén con una espumadera y déjelos a un lado. Continúe cocinando a fuego lento el licor de cocción hasta que se haya espesado ligeramente.", "Agregue la mostaza y el estragón picado y revuelva hasta que esté bien combinado. Sazonar, al gusto, con sal y pimienta negra recién molida y continuar cocinando a fuego lento durante otros 1-2 minutos.", "Para servir, corte cada una de las piezas de rape en dos medallones. Coloque dos de los medallones de rape en el centro de cada uno de los cuatro cuencos de servir. Retire la mitad de los mejillones de sus caparazones y divídalos entre los tazones. Divida los mejillones restantes entre los cuencos. Cuchara sobre el estragón y la salsa de mostaza y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_monkfishandmusselswi_90143", "title": "Rape y mejillones con salsa de estragón y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "6 chalotes (preferiblemente tailandeses) pelados, finamente cortados", "3 dientes de ajo, pelados, triturados hasta formar una pasta con un poco de sal", "40g / 1½ oz de jengibre, pelado, finamente rallado", "4 tallos de limoncillo, solo partes tiernas, finamente picados", "6 hojas de lima, trituradas", "2-3 chiles verdes, sin semillas y finamente picados, al gusto", "Leche de coco 600ml / 1pt", "4 cucharadas de cilantro fresco picado", "Colas de rape de 600 g / 1 libra y 5 onzas, cortadas en trozos grandes", "Castañas de agua en conserva 200g / 7oz, escurridas", "2 cucharadas de salsa de pescado tailandesa", "1 lima, solo jugo", "4 cucharadas de hojas de albahaca tailandesas (disponibles en supermercados asiáticos), rotas, para servir", "250g / 9oz de arroz jazmín tailandés", "500ml / 17½fl oz de agua", "1 tallo de limoncillo, magullado"], "method": ["Para el curry de rape, caliente el aceite en un wok grande hasta que esté humeando y saltee los chalotes, el ajo, el jengibre, el limoncillo, las hojas de lima y los chiles verdes durante 2 o 3 minutos. Agregue la leche de coco y continúe cocinando por 3-4 minutos, o hasta que el volumen del líquido se haya reducido levemente.", "Agregue el cilantro, el rape y las castañas de agua y continúe cocinando por 3-4 minutos, o hasta que el pescado esté bien cocido. Agregue la salsa de pescado y el jugo de lima.", "Mientras tanto, para el arroz jazmín tailandés, coloque el arroz y el tallo de la hierba de limón en una cacerola, cubra con el agua y cocine a fuego lento durante 12-15 minutos, o hasta que el arroz haya absorbido toda el agua y esté tierna. Retire la sartén del fuego y déjela a un lado durante 5 minutos.", "Para servir, espolvorea un poco del arroz jazmín tailandés en cada uno de los 4 platos para servir. Ponga un poco de curry de rape encima y espolvoree sobre las hojas de albahaca tailandesa."], "url": "www_bbc_co_uk_food_recipes_monkfishcurrywithlem_93325", "title": "Curry de rape con limoncillo y hoja de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, más o menos picada", "1 diente de ajo, finamente picado", "Puerros de bebé 100g / 3½oz, en rodajas", "85g / 3oz de papas nuevas, picadas", "200ml / 7fl oz de caldo de pescado", "½ limón, solo ralladura", "6 tomates cherry maduros, cortados a la mitad", "Cola de rape 125 g / 4½ oz, deshuesada, cortada y picada en piezas del tamaño de un bocado", "2 cucharadas de perejil fresco picado"], "method": ["Caliente el aceite en una sartén y fría la cebolla y el ajo por 2-3 minutos.", "Agregue los puerros y las papas y continúe cocinando por 3-4 minutos más.", "Vierta el caldo y cocine a fuego lento. Cocine a fuego lento durante unos ocho minutos, o hasta que las papas estén firmes pero casi cocidas.", "Agregue la ralladura de limón, los tomates cherry y los trozos de pescado y cocínelos durante 3-4 minutos, o hasta que el pescado y las papas estén cocidos.", "Agregue el perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_monkfishleekandtomat_88557", "title": "Rape, puerro y guiso de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 2 oz de rape (cortado en 4 piezas)", "4 dientes de ajo, aplastados", "2 chiles, cortados en 12 piezas", "4 ramitas de tomillo fresco de limón", "20g / ¾oz de jengibre rallado", "1 tallo de limoncillo, cortado en 4 piezas", "12 cucharadas de leche de coco", "1 lima, descuartizado", "sal al gusto"], "method": ["Precalentar una barbacoa hasta que los carbones estén al rojo vivo. (Alternativamente, cocine en un horno precalentado a 180C / 350F / Gas 4).", "Dobla un pedazo grande de papel de aluminio por la mitad. Coloque una pieza más pequeña de papel de hornear en la parte superior de la lámina. Coloque un trozo de rape en el papel con un diente de ajo, tres rebanadas de chile, una ramita de tomillo limón, una cuarta parte del jengibre rallado, un trozo de hierba de limón, tres cucharadas de leche de coco y una pizca de sal. Repite esto por cada pieza de pescado.", "Selle los paquetes en una forma pastosa, asegurándose de que los bordes estén sellados para que los jugos no puedan escapar durante la cocción. Coloque en la barbacoa (o en el horno) durante 20 minutos.", "Retire de la barbacoa y deje reposar durante cinco minutos. Para servir, coloque cada paquete de aluminio en un plato. Abra la lámina y sazone con un chorrito de jugo de lima."], "url": "www_bbc_co_uk_food_recipes_monkfishtailbakedina_86538", "title": "Rape de rape al horno en un paquete de papel con chile, leche de coco, ajo y jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de yogur griego", "50ml / 2fl oz de ketchup de tomate", "1 cucharadita de cúrcuma", "1 lima, solo jugo", "4 x 50 g / 1½ oz trozos de rape", "50g / 1½ oz de frijoles amarillos, recortados, blanqueados", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los kebabs, coloque todos los ingredientes en un tazón, mezcle bien y deje que el rape se mate durante 3-5 minutos.", "Calentar una sartén a prueba de horno hasta que se fume y cocer los trozos de rape durante 2-3 minutos por cada lado. Transfiera la sartén al horno y tueste el rape durante 3-5 minutos, o hasta que esté completamente cocido.", "Para la ensalada, coloque los frijoles y el aceite en un bol, mezcle bien y sazone con sal y pimienta negra recién molida.", "Para servir, coloque los frijoles en un plato con las piezas de rape en la parte superior."], "url": "www_bbc_co_uk_food_recipes_monkfishtikkakebabsw_84773", "title": "Pinchos de rape tikka con ensalada de frijoles amarillos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Colas de rape 400g / 14oz, recortadas", "200 g / 7 oz de harina, aderezada con sal marina, sal de apio, pimienta blanca y pimentón", "150 g / 5¼ oz de mantequilla", "1 limón, solo jugo", "300g / 10½oz de patatas nuevas, cocidas hasta que estén tiernas, escurridas", "125g / 4½oz de tomates cherry", "sal y pimienta negra recién molida", "1 x 200 g / 7 oz puede corazones de alcachofa, reducido a la mitad", "1 limón, solo jugo", "2 cucharadas de perejil fresco picado"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Cortar el rape en trozos y luego dragar en la harina sazonada.", "Derrita la mantequilla en una sartén grande a prueba de horno y, cuando haga espuma, agregue el pescado. Freír por un par de minutos en cada lado, hasta que se dore.", "Exprime el jugo de limón sobre el pescado y mueve el pescado a un lado de la sartén.", "Agregue las papas a la sartén y cocínelas durante dos minutos.", "Agregue los tomates cherry y cocine por otros dos minutos.", "Finalmente agregue los corazones de alcachofa a la sartén y sazone, al gusto, con sal y pimienta negra recién molida.", "Distribuya las papas y los pescados uniformemente en la sartén, luego transfiéralos al horno y cocínelos durante 3-4 minutos, o hasta que el rape esté bien cocido.", "Para servir, coloque el pescado y las papas en un plato caliente. Exprime el limón restante y decora con perejil fresco."], "url": "www_bbc_co_uk_food_recipes_monkfishwithartichok_84139", "title": "Rape con corazones de alcachofa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jengibre fresco de la raíz de los 2cm / 1in, pelado, rallado", "50ml / 2fl oz de aceite de oliva", "1 zanahoria, pelada, finamente picada", "1 tallo de apio, finamente cortado en cubitos", "1 puerro, cortado, finamente cortado en cubitos", "1 diente de ajo, pelado, finamente picado", "1 cucharadita de pasta de curry suave", "200g / 7¼oz de lentejas Puy, cocinadas según las instrucciones del paquete", "300ml / 10½fl oz de caldo de pollo", "3 tomates, pelados, sin semillas, cortados en cubitos", "2 cucharadas de cilantro fresco picado", "2 cucharadas de crema", "200g / 7¼ oz de rape, cortado, en rodajas finas", "sal y pimienta negra recién molida", "1 limón, solo jugo", "1 cucharada de cilantro fresco picado, para servir"], "method": ["Para las lentejas al curry, coloque el jengibre rallado en una toalla limpia o un trozo de muselina, sobre un tazón pequeño, y gire la tela para extraer el jugo. Dejar de lado.", "Calentar el aceite de oliva en una sartén y freír la zanahoria, el apio y el puerro durante 4-5 minutos, o hasta que se ablanden.", "Agregue el ajo y cocine por un minuto más. Agregue la pasta de curry, el jugo de jengibre reservado, las lentejas y el caldo de pollo. Llevar la mezcla a ebullición, reducir el fuego y agregar los tomates, el cilantro y la crema fresca.", "Para el rape, sazonar las rodajas de rape, al gusto, con sal y pimienta negra recién molida y verter sobre el jugo de limón.", "Con cuidado mezcle las rodajas de rape en las lentejas al curry y caliente suavemente durante 2 o 3 minutos, o hasta que el pescado esté bien cocido.", "Para servir, espolvorea el rape y las lentejas al curry en cada uno de los 4 tazones para servir. Espolvorea sobre el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_monkfishwithcurriedl_93869", "title": "Rape con lentejas al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 bolas de mozzarella de búfalo, finamente cortadas", "4 tomates grandes Oxheart, en rodajas finas", "4 ramitas de albahaca fresca, solo hojas, para servir", "pimienta negra recién molida", "60g / 2½oz de hojas de albahaca fresca", "50g / 2oz de piñones, tostados", "Parmesano 50 g / 2 oz, rallado", "2 dientes de ajo, pelados", "125-175ml / 4½-5fl oz de aceite de oliva virgen extra", "Filete de rape de 700g / 1lb 9oz, cortado y cortado en trozos pequeños", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Para la ensalada, coloque las rodajas de mozzarella y tomate en cuatro platos para servir, alternando las rodajas de mozzarella y tomate en un círculo alrededor de los bordes. Coloque en el horno para calentar durante cinco minutos.", "Para el pesto, coloque la albahaca, los piñones, el parmesano y el ajo en un procesador de alimentos y mezcle hasta obtener un puré fino. Agregue 125ml / 4½fl oz del aceite de oliva y mezcle nuevamente hasta que esté bien combinado. Si el pesto es demasiado grueso, agregue el aceite de oliva restante para diluirlo. (Puede que no necesite todo el aceite de oliva). Deje de lado.", "Para el rape, caliente el aceite de oliva en una sartén y fría el pescado por todos lados durante 4-5 minutos, o hasta que esté dorado y cocido. Retire la sartén del fuego y deje que el pescado descanse durante unos minutos.", "Rocíe 3-4 cucharadas de pesto sobre el pescado y mezcle bien para cubrir.", "Para servir, retire con cuidado los platos de mozzarella y tomate del horno con guantes para hornear. Coloque el rape en el centro de los platos y luego vierta el pesto restante sobre la mozzarella y el tomate. Adorne con unas hojas de albahaca fresca y sazone con un poco de pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_monkfishwithpestoand_91583", "title": "Rape con pesto y ensalada de mozzarella y tomate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pepino pequeño", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "1 cucharadita de pimienta negra recién molida", "125ml / 4fl oz de caldo de pescado o vino blanco", "1 cucharada de crema", "1 cucharada de mostaza integral", "50g / 2oz de mantequilla sin sal", "1 cucharadita de jugo de limón", "4 x 200g / 7oz de colas de rape", "25ml / 1fl oz de aceite de oliva", "botón de mantequilla", "1 cucharada de jugo de limón"], "method": ["Para el pepino, pele y corte finamente el pepino y colóquelo en un colador.", "Mézclalo con la sal y presiona durante una hora. Coloque un plato pequeño o una tapa sobre el pepino y coloque una jarra o lata pesada sobre eso y coloque el colador sobre un recipiente para drenar.", "Después de una media hora más o menos, exprime todo el líquido posible del pepino y colócalo en un bol.", "En otro recipiente, mezcle el azúcar, el vinagre y la pimienta negra. Mezcle las rodajas de pepino en la mezcla de vinagre, cubriendo bien.", "Para la salsa, caliente el caldo, la crème fraîche y la mostaza juntas y bata la mantequilla pieza por pieza. Finalmente agregue el jugo de limón.", "Para el rape, rocíe los filetes de rape con aceite de oliva. Caliente una sartén hasta que esté caliente, luego agregue los filetes.", "Agregue un pomo de mantequilla y continúe freír hasta que el pescado esté cocido.", "Exprima el jugo de limón sobre el pescado cocinado.", "Coloque el pescado en platos calientes junto con el pepino y la salsa."], "url": "www_bbc_co_uk_food_recipes_monkfishwithmustarda_83980", "title": "Rape con salsa de mostaza y pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 alcachofas romanas (globo grande)", "95ml / 3½fl oz de aceite de oliva", "1 diente de ajo, picado", "3 cucharaditas de perejil fresco de hojaldre", "125ml / 4½fl oz de vino blanco", "2 filetes de rape de x 175g / 6oz, cortados", "Patatas Charlotte de 300g / 11oz, hervidas hasta que estén tiernas, escurridas, en rodajas", "1 cucharada de alcaparras pequeñas, escurridas y enjuagadas", "Rebanadas de prosciutto 90g / 3½oz", "½ limón, solo jugo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Recorte las hojas exteriores de las alcachofas, córtelas, luego saque el \"estrangulador\" peludo con una cucharadita.", "Con un pelador de patatas, despegue el vástago hasta que el centro sensible quede expuesto.", "Coloque las alcachofas peladas, cabezas hacia abajo, en una sartén. Agregue 75ml / 2¾fl oz del aceite de oliva, la mitad del ajo picado, una cucharadita de perejil picado y todo el vino blanco. Cubra la sartén con una tapa.", "Caliente la mezcla a fuego medio, luego cocine las alcachofas durante 20-25 minutos, o hasta que un cuchillo filoso pueda insertarse fácilmente en sus centros.", "Cuando las alcachofas estén cocidas, retírelas de la sartén con una espumadera y déjelas enfriar. Cuando se hayan enfriado por completo, córtelos longitudinalmente en rodajas finas.", "Mientras tanto, caliente una cucharadita del aceite restante en una sartén grande, resistente y de horno a fuego medio a alto. Cuando el aceite esté caliente, agregue los filetes de rape y cocínelos durante 2-3 minutos en cada lado, o hasta que estén crujientes y de color marrón dorado pálido en ambos lados. Retire de la sartén y reserve.", "Agregue las papas en rodajas cocidas a la sartén en la que se cocinó el rape. Fría en un lado durante 1-2 minutos a fuego medio, luego voltee.", "Regrese los filetes de rape a la sartén y colóquelos encima de las papas rebanadas. Agregue las alcachofas rebanadas y cocidas, las alcaparras, el resto del perejil picado y el ajo picado, colocándolos dentro y alrededor de los filetes de rape, encima de las papas. Cubra los ingredientes con las rodajas de jamón.", "Transfiera la sartén al horno y tueste durante 6-10 minutos, o hasta que las rodajas de jamón estén crujientes y los filetes de rape estén bien cocidos (los filetes de rape se cocinan cuando la carne esté opaca).", "Retire la sartén del horno y exprima el jugo de limón en la sartén y rocíe sobre los restantes 15 ml / ½ fl oz de aceite de oliva.", "Para servir, divida las papas en rodajas y las alcachofas por igual entre dos platos para servir. Coloque un filete de rape encima de cada porción. Cubra con las rebanadas de prosciutto crujientes."], "url": "www_bbc_co_uk_food_recipes_monkfishwithprosciut_91428", "title": "Rape con prosciutto, alcachofas, alcaparras, perejil y patatas Charlotte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 dientes de ajo, ligeramente triturados", "1 rebanada de pan, en cubos", "1 patata, cortada en cubos", "1 cola de rape, hueso y membrana eliminados", "100 ml / 3½ fl oz de vino tinto", "50ml / 2fl oz de caldo de verduras calientes", "1 cucharada de azúcar", "sal y pimienta negra recién molida", "puñado de perejil recién hecho", "puñado de menta fresca", "puñado de albahaca fresca", "2-3 cucharadas de aceite de oliva", "2 cucharaditas de mostaza Dijon", "½ limón, solo jugo", "50 g / 2 oz de Camembert, picado, para servir"], "method": ["Para las patatas salteadas y el rape, caliente el aceite de oliva en una sartén, agregue el ajo, el pan y la papa y saltee durante 4-5 minutos, hasta que estén suaves y ligeramente dorados.", "Agregue el rape y fríalos, volteándolos a menudo, hasta que estén dorados por todos lados y cocinados.", "Para la salsa de vino tinto, coloque el vino tinto en una olla pequeña y hierva hasta que se reduzca a la mitad.", "Agregue el caldo de verduras y el azúcar y hierva por cinco minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa verde, coloque las hierbas, el aceite de oliva, la mostaza y el jugo de limón en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para servir, coloque las papas y el rape salteados en un plato, rocíe sobre la salsa de vino tinto y salsa verde y cubra con cubos de Camembert."], "url": "www_bbc_co_uk_food_recipes_monkfishwithsauteedp_85692", "title": "Rape con papas salteadas, salsa de vino tinto y salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de rape, recortado", "3 rebanadas de jamón", "pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cucharadas de aceite de oliva", "3 cebollas de primavera, picadas", "1 diente de ajo, aplastado", "140g / 5oz de tomates cherry, cortados a la mitad", "3 hojas de albahaca fresca, picadas", "200g / 7oz de espinaca", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Envuelva el rape en el prosciutto y sazone con pimienta negra recién molida.", "Calentar el aceite en una sartén a prueba de horno y freír el rape durante 2-3 minutos, hasta que esté dorado por ambos lados.", "Transfiera al horno por ocho minutos o hasta que esté completamente cocido. Retire del horno y deje reposar durante cinco minutos.", "Para la salsa, caliente el aceite en una sartén de fondo grueso y fría la cebolla y el ajo durante un minuto. Agregue los tomates y las hojas de albahaca a la sartén y mezcle bien.", "Para la espinaca, caliente el aceite en una sartén por separado y agregue la espinaca durante dos minutos, revolviendo hasta que se marchite.", "Para servir, coloque el rape en un plato y colóquelo junto a la espinaca. Cubra con la salsa de tomate."], "url": "www_bbc_co_uk_food_recipes_monkfishwrappedinpar_84151", "title": "Rape envuelto en jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5¼fl oz de claras de huevo de gallinas camperas (aproximadamente 5 claras de huevo)", "300 g / 11 oz de azúcar en polvo", "2 cucharadas de harina de maíz", "1 cucharadita de vinagre de vino blanco", "aceite vegetal, para freír", "100 g / 3½ oz de azúcar en polvo", "100 ml / 3½ fl oz de agua", "110 g / 4oz de nueces sin sal mezcladas", "copos de sal marina", "110g / 4 oz de chocolate negro", "500g / 1lb 2oz de puré de castañas endulzado", "1 vaina de vainilla, solo semillas", "175g / 6oz de azúcar en polvo", "300g / 11oz mascarpone", "Crema doble 250ml / 9fl oz", "8-12 marrons glacés (castañas confitadas), desmenuzado", "150 g / 5¼ oz de azúcar en polvo", "1 cucharada de agua"], "method": ["Para el merengue, precaliente el horno a 140C / 275F / Gas 1. Cubra una bandeja de hornear con papel resistente a la grasa.", "Batir las claras de huevo en un tazón limpio hasta que se formen picos suaves cuando se quita el batidor.", "Agregue el azúcar, una cucharada a la vez, hasta que se haya agregado todo el azúcar y se formen picos duros cuando se quite la batidora.", "Agregue la harina de maíz y el vinagre.", "Coloque la mezcla de merengue en la bandeja para hornear en un círculo grande.", "Cueza al horno en el horno por 10 minutos, luego apague el horno y déjelo en el horno por 2-3 horas, o preferiblemente durante la noche, hasta que estén crujientes, pero sin color.", "Retire el merengue del horno y déjelo a un lado para que se enfríe por completo, luego colóquelo en un plato para servir.", "Mientras tanto, para las nueces caramelizadas, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente el azúcar y el agua en una olla aparte hasta que el azúcar se haya disuelto.", "Agregue las nueces y lleve la mezcla a ebullición. Continúe cocinando hasta que la temperatura del jarabe de azúcar alcance los 110 ° C / 225 ° F (use un termómetro de azúcar para verificar esto).", "Retire las nueces del jarabe con una cuchara ranurada y con cuidado bájelas en la freidora. (PRECAUCIÓN: Las nueces están cubiertas de un líquido que puede escupir al contacto con el aceite. Manténgase alejado y mantenga la cara y el cabello alejados de la freidora.) Freír durante 1-2 minutos, o hasta que estén dorados, luego remueva del aceite con una espumadera y déjelo a un lado para escurrir sobre papel de cocina. Espolvorear con escamas de sal marina.", "Para el relleno, derrita el chocolate en un recipiente colocado sobre una olla de agua hirviendo. (No permita que la base del recipiente toque el agua).", "Alise el chocolate derretido sobre el merengue refrescado.", "Batir el puré de castañas endulzado, semillas de vainilla, azúcar en polvo y mascarpone en un bol hasta que se combinen.", "Batir la crema en un recipiente aparte hasta que se formen picos suaves cuando se quite la batidora. Doble la crema doble en la mezcla de castañas.", "Vierta la mezcla de castañas en el merengue y esparza los glacé castaños y las nueces caramelizadas encima.", "Para el caramelo, caliente una sartén hasta que esté caliente, agregue el azúcar y agua y cocine durante 4-5 minutos, o hasta que la mezcla se convierta en un caramelo pálido. (No revuelva la mezcla)", "Rocíe el caramelo sobre la parte superior para servir."], "url": "www_bbc_co_uk_food_recipes_mont_blanc_28435", "title": "Mont Blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 claras de huevo", "200 g / 7 oz de azúcar en polvo de oro", "25 g / 1 oz de cacao en polvo", "1 cucharadita de vinagre de vino blanco", "35g / 1¼ oz de chocolate negro, rallado (opcional)", "400 g / 14 oz de crema batida", "30g / 1oz de azúcar glasé", "3-4 marron glace, desmenuzado (opcional)", "Puré de castañas edulcorado 250 g / 9 oz", "50g / 1¾oz de chocolate negro, rallado o en copos (opcional)"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y corte un rollo de papel para hornear de 20cm / 8in y colóquelo en una bandeja para hornear.", "Batir las claras de huevo en una batidora de pie o con un batidor eléctrico de mano, hasta obtener picos suaves. Poco a poco bata el azúcar, una cucharada a la vez, hasta que el merengue esté tieso y brillante. Tamizar sobre el cacao y dóblelo suavemente hasta que esté combinado. Doble el vinagre y el chocolate, si está usando.", "Apila la mezcla en el centro del papel de hornear, colocando el merengue en el medio, en un pequeño pico.", "Coloque en el horno e inmediatamente baje a 170C / 150C Fan / Gas 3½. Hornee por 1 hora 15 minutos - 1 hora 30 minutos o hasta que los lados estén crujientes pero con algo de elasticidad. Apague el horno y deje que el merengue se enfríe por completo.", "Mientras tanto, haz el relleno. Batir la crema hasta que esté bastante tieso, luego incorporar el azúcar glas y el extracto de vainilla. Si usa el maron glace, coloque dos cucharadas grandes de la crema en un tazón pequeño para después y desmenuce los marones en el tazón grande de crema. Coloque la mezcla de nata y maron alrededor del pico de merengue.", "Para decorar, coloque el puré de castañas en una manga pastelera con una boquilla de 2 mm y pase el puré por toda la crema, en bucles o líneas rectas. Espolvorea el chocolate rallado sobre la castaña, si se usa. Coloque la crema reservada en el medio del pudín y constrúyala en un pico, por lo que Mont Blanc parece cubierto de nieve."], "url": "www_bbc_co_uk_food_recipes_mont_blanc_chocolate_and_19432", "title": "Merengue de chocolate y castaña 'Mont Blanc'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz puré de castañas endulzado con estaño", "Gelatina de hoja de 7 g, empapada en agua fría durante cinco minutos", "Ron oscuro de 30ml / 1fl oz", "300 ml / 10 fl oz doble crema", "6 huevos de gallinas camperas, 4 enteros, 2 yemas solamente", "220 g / 8 oz de azúcar en polvo", "Harina normal de 50g / 2oz", "500ml / 18fl de leche en oz", "Gelatina de hoja de 7 g, empapada en agua fría durante cinco minutos", "250g / 9oz de mantequilla sin sal, ablandada, cortada en trozos pequeños", "1 cucharadita de café espresso", "Licor de café 30ml / 1fl oz", "240 g / 8½ oz de claras de huevo de campo (aproximadamente 8 claras de huevo)", "½ cucharadita de crema de tártaro", "40 g / 1½ oz de azúcar en polvo", "170gr / 6 oz de almendras molidas", "170g / 6oz de azúcar glas", "20g / ¾oz de harina natural, tamizada", "Avellanas de 40 g / 1½ oz, finamente picadas", "2 huevos de gallinas camperas, solo blancos", "pizca de crema de tártaro", "120g / 4½oz de azúcar moreno claro", "Avellanas 50 g / 2 oz, finamente picadas", "½ cucharadita de harina de maíz", "30 g / 1 oz de azúcar en polvo", "5 g de gelatina de hoja, empapada en agua fría durante cinco minutos", "Extensión de la castaña 120g / 4½oz", "250 g / 9 oz de chocolate negro, picado", "hojas de transferencia de chocolate (opcional)", "Avellanas de 75 g / 2½ oz", "75g / 2½oz de almendras", "125 g / 4½ oz de azúcar en polvo", "200g / 7oz% 20dark% 20chocolate% 20bittersweet% 20 (alrededor de% 2070 %% 20cocoa% 20solids),% 20chopped", "100ml / 3½ fl oz de leche", "2 huevos de gallinas camperas, solo yemas", "20 g / oz de azúcar en polvo", "360ml / 12fl oz crema batida", "Licor de avellana 30ml / 1fl oz"], "method": ["Para la mousse de castañas, caliente el puré de castañas y cuatro cucharadas de agua en una sartén y cocine a fuego lento. Escurra las hojas de gelatina y exprima el exceso de agua, luego mezcle con la mezcla de castañas hasta que se disuelva.", "Retire del fuego y cuele la mezcla de castañas a través de un colador en un recipiente. Deje que se enfríe a temperatura ambiente y mezcle el ron oscuro.", "En un recipiente aparte, bate la crema hasta que forme picos suaves cuando se quite la batidora. Doble la crema batida en la mezcla de castañas. Cubra y coloque en la nevera para establecer durante al menos dos horas.", "Para la muselina del café, coloque los huevos, las yemas de huevo y 70 g / 2½ oz del azúcar en un tazón y bata hasta que estén pálidos y esponjosos. (La mezcla debe dejar un rastro de cinta cuando se quite el batidor.) Tamice la harina y mezcle bien.", "Coloque la leche y el azúcar restante en una olla grande y deje que hierva. Vierta lentamente un tercio de la leche caliente sobre la mezcla de huevo, batiendo todo el tiempo. Luego agrega el resto de la leche. Vierta la mezcla en la sartén y cocine a fuego lento revolviendo continuamente. Cocine a fuego lento durante dos minutos o hasta que espese.", "Retire la sartén del fuego y cuele la crema a través de un colador fino en un recipiente limpio. Agregue la gelatina ablandada y bata en un tercio de la mantequilla. Deje que se enfríe, revolviendo ocasionalmente para detener la formación de la piel. Batir la mantequilla restante con una batidora de mano a baja velocidad durante unos tres minutos hasta que esté pálida y esponjosa. Aumente la velocidad de mezclado a medio y agregue la crema enfriada un poco a la vez. Batir durante cinco minutos hasta que quede ligero y cremoso. Mezcle el café en polvo con una cucharadita de agua para hacer una pasta. Revuelva la pasta de café y el licor de café en la mezcla de natillas. Dejar de lado, cubierto, en la nevera.", "Precaliente el horno a 150C / 300F / Gas 2.", "Para las capas de merengue, trace cuatro círculos alrededor del anillo de pastel en un pergamino para hornear con un lápiz.", "Batir las claras de huevo con la crema de tártaro hasta que se formen picos suaves cuando se quite el batidor. A continuación, bata lentamente el azúcar impalpable y bate hasta que se formen picos rígidos cuando se quite el batidor.", "Mezcle las almendras con el azúcar glas en un procesador de alimentos por un minuto. Dobla la mezcla de almendra molida y la harina en las claras de huevo batidas con una cuchara de metal hasta que se incorporen.", "Transfiera el merengue a una manga pastelera, equipada con una boquilla simple de 1 cm / ½ pulgada. Pipe en espiral en los círculos de pergamino de cocción comenzando desde el centro y la tubería hacia el exterior. Espolvorear con avellanas picadas y hornear durante una hora hasta que estén secos y crujientes. Retire del horno y reserve.", "Reduzca el horno a 120C / 250F / Gas ½. Alinee una bandeja para hornear con un pergamino para hornear.", "Para el azúcar moreno y el merengue de avellana, bata las claras de huevo con la crema de tártaro hasta que se formen picos suaves cuando se quite la batidora. Agregue el azúcar gradualmente, batiendo bien entre las adiciones. Batir durante otros tres minutos hasta que se formen picos rígidos cuando se quite el batidor. Dobla las tres cuartas partes de las avellanas picadas y la harina de maíz. Transfiera el merengue a una manga pastelera equipada con una boquilla simple. Pipe el merengue en pequeñas rondas y espolvorear las partes superiores con las avellanas restantes. Hornee durante 25 minutos hasta que estén crujientes. Dejar de lado para enfriar.", "Mientras tanto, para el glaseado de castañas, caliente el azúcar con 50 ml / 2 fl oz de agua a fuego medio, revolviendo constantemente, hasta que se disuelva. Luego llevar a ebullición. Retirar del fuego y agregar la gelatina drenada y ablandada. Agregue el puré de castañas hasta que estén bien combinados, luego cuele a través de un colador fino. Dejar de lado para enfriar.", "Para las decoraciones de chocolate, derrita tres cuartas partes del chocolate en un recipiente colocado sobre una fuente de agua hirviendo. Derrita el chocolate a 45C / 113F (use un termómetro para medir esto). Retire el recipiente del fuego y agregue el chocolate restante en pequeñas cantidades, revolviendo a medida que se enfría y se espesa. Cuando la temperatura del chocolate alcance los 31 ° C / 88 ° F, con una espátula, extiéndala sobre una lámina de acetato o una lámina de transferencia de chocolate hasta un espesor de 50 piezas. Dejar de lado para enfriar.", "Después de unos minutos, cuando el chocolate comience a fraguarse, anota triángulos en el chocolate de al menos 15 cm de largo. Dejar enfriar completamente y reafirmar. Encienda el horno a 200C / 400F / Gas 6. Cubra una bandeja para hornear con un pergamino antiadherente.", "Para el praliné, tueste las avellanas y las almendras en una bandeja para hornear antiadherente durante 8-10 minutos hasta que estén doradas. En una sartén, caliente el azúcar a fuego medio hasta que se derrita y se convierta en caramelo de color ámbar, unos 15 minutos.", "Agregue las nueces tostadas, luego vierta la mezcla en la bandeja de horno forrada y deje enfriar. Cuando esté completamente frío, divida el praliné y mezcle en un procesador de alimentos con un crumble fino. Dejar de lado.", "Para la mousse de chocolate, coloque el chocolate picado en un tazón grande. En una sartén pequeña, lentamente lleve la leche a ebullición. Mientras tanto, batir las yemas de huevo y el azúcar juntos a mano hasta que la mezcla esté pálida y esponjosa. Vierta la mitad de la leche hervida en la mezcla de huevo revolviendo todo el tiempo, luego vuelva a verter en la sartén con la leche restante, aún revolviendo continuamente. Cocine a fuego lento, revolviendo constantemente, hasta que la mezcla se haya espesado.", "Retire del fuego y cuele a través de un colador fino sobre el chocolate picado. Dejar de lado para enfriar.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora y luego doblarla cuidadosamente en la crema de chocolate. Agregue el licor de avellana.", "Para ensamblar el dacquoise, coloque el molde de anillo en la placa de presentación, para usar como guía. Coloque un círculo de merengue en el anillo de la torta y cúbralo con una capa de 2cm / in de mousse de chocolate. Reserva cualquier mousse sobrante para aplicar parches cuando se quite el anillo. Coloque una segunda capa de merengue en la parte superior y enfríe en la nevera durante 20 minutos. Retire del refrigerador y extienda sobre una capa de 2 cm / 1 in de crema de muselina de café sobre el merengue a una profundidad similar, cubra con una tercera capa de merengue y vuelva a enfriar durante 20 minutos. Retire de la nevera y extienda sobre una capa de 2cm / 1in de mousse de castaña. Cubra con la capa final de merengue, pero invierta para que la superficie sea plana. Reserva cualquier mousse sobrante para suavizar cualquier imperfección cuando se quite el anillo.", "Si el glaseado de castaño se ha endurecido, caliente suavemente en una olla hasta obtener una consistencia de vertido. Coloque el glaseado de castaña sobre la tapa para cubrirlo y luego enfríelo en la nevera hasta justo antes de servirlo. Para liberar el molde de anillo, ejecute un soplete encendido alrededor de la parte exterior del molde. Suavemente retire el molde del anillo, aplique un parche en los agujeros y vuelva a enfriar. Decora con triángulos de chocolate alrededor de los lados, azúcar moreno y merengues de avellana amontonados en el centro y rizos de chocolate y praliné alrededor de los bordes."], "url": "www_bbc_co_uk_food_recipes_monte_bianco_chestnut_09364", "title": "Monte Bianco: castaño, chocolate y café dacquoise", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]