[{"ingredients": ["75g / 3oz de mantequilla, más extra para engrasar", "1 cebolla grande, más o menos picada", "Harina normal de 50g / 2oz", "570ml / 1 litro de leche", "sal y pimienta negra recién molida", "2 cucharadas de jugo de limón", "Abadejos frescos de 350 g / 12 oz, cortados en piezas de 1 cm / ½ pulgadas", "Abadejo sin teñir ahumado 350g / 12oz, cortado en pedazos de 1cm / ½ en pedazos", "4 huevos duros de campo abierto, toscamente picados", "Patatas de 900g / 2lb, peladas y cortadas en piezas de tamaño uniforme", "aproximadamente 8 cucharadas de leche caliente", "aproximadamente 50 g / 2 oz de mantequilla"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase un plato poco profundo de 2.5 litros / 4½ con mantequilla.", "Derrita la mantequilla en una sartén a fuego alto y fría la cebolla durante unos minutos. Baje el fuego, cubra y deje ablandar durante 15 minutos.", "Retire la tapa y aumente el calor para eliminar la humedad. Espolvoree la harina y luego agregue la leche gradualmente, revuelva bien y permita que la salsa se espese hasta que se haya agregado toda la leche.", "Sazone con sal y pimienta negra recién molida, agregue el jugo de limón y el pescado crudo y cocine durante unos minutos, revolviendo continuamente hasta que el pescado recién se haya cocinado. Agregue el abadejo ahumado. Vierta la mezcla en el plato con mantequilla y deje enfriar. Cubra con los huevos duros.", "Para el aderezo, hervir las papas en una sartén con agua con sal hasta que estén tiernas. Escurra, vuelva a verter las papas en la sartén, agregue leche y mantequilla y aplaste hasta que queden grumos. Usa un ricer para obtener un puré suave. Agregue sal y pimienta negra recién molida al gusto.", "Extiende el puré sobre la salsa y pesca en el plato y anota con un tenedor.", "Hornee en el horno precalentado durante aproximadamente 30 minutos o hasta que la papa esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_fish_pie_79943", "title": "Pastel de pescado de Mary Berry", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["375g / 13oz de mantequilla sin sal", "300g / 10½oz de azúcar moreno oscuro", "150g / 5½oz de jarabe dorado", "Harina normal de 900g / 2lb", "1 cucharada de bicarbonato de soda", "2 cucharadas de jengibre molido", "3 claras de huevo de gallinas camperas", "675g / 1½lb de azúcar glas, tamizado", "3 cucharaditas de jugo de limón", "15 dulces hervidos amarillos o anaranjados", "Tabla de tarta cuadrada de 1 x 30 cm / 12 in", "Botones de chocolate con leche gigante de 200g / 7oz", "2 velas con luz de noche", "6 palitos de cóctel"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 (ventilador 180C).", "Derrita la mantequilla, el azúcar y el jarabe juntos en una sartén grande. Tamiza la harina, el bicarbonato de soda y el jengibre molido en un bol grande y haz un pozo en el centro. Vierta la mezcla de mantequilla derretida, revuélvala y, cuando esté lo suficientemente fría como para manejarla, amasarla hasta formar una masa dura.", "Divida la mezcla en cinco pedazos del mismo tamaño, corte una de estas piezas a la mitad (para que tenga seis piezas en total). Ruede cada pieza en una hoja de papel resistente a la grasa a ¾cm / ⅓ de grueso. Usando las plantillas, corte las secciones para el techo, los lados, el frente y la parte posterior de la casa. Deslice en tres bandejas para hornear forradas con pergamino para hornear.", "Usando la plantilla como guía, una regla y el borde de una taza, corte las ventanas arqueadas en el frente y los lados de la casa. Con un cortador de estrella, corta una estrella en la parte delantera y trasera de la casa. Con un cuchillo, corte la puerta en la parte delantera y trasera de la casa y coloque las puertas por separado en las bandejas de hornear.", "Vuelva a enrollar los adornos y use para cortar las piezas de la chimenea, tres árboles de Navidad y tres triángulos para usar como soportes para ayudar a los árboles a pararse. Hornee el pan de jengibre durante 7-8 minutos.", "Mientras tanto, coloque los caramelos hervidos en una mano de almirez y mortero y aplaste con una textura de arena áspera.", "Retire el pan de jengibre del horno. Recorta las ventanas si la mezcla se ha extendido y espolvorea los dulces triturados en las ventanas. Regrese al horno y continúe cocinando por 3-4 minutos, o hasta que los dulces se derritan y el pan de jengibre esté firme. Retire del horno y deje enfriar por unos minutos, luego recorte alrededor de las plantillas nuevamente para dar bordes limpios y afilados. Deje que se enfríe completamente.", "Para la formación de hielo, bata las claras de huevo en un tazón grande hasta que estén espumosas. Con una cuchara de madera o una batidora eléctrica de mano a baja velocidad, agregue el azúcar glas una cucharada a la vez. Agregue el jugo de limón y bata la guinda hasta que esté muy tieso y blanco y se levante en picos. Cubra la superficie con un paño húmedo si no lo usa de inmediato.", "Ponga un poco del glaseado en una manga pastelera equipada con una boquilla mediana. Cubre manchas de hielo en la parte posterior de cada botón y palito de chocolate, superponiéndose a las dos secciones del techo, para crear un efecto de mosaico. Transfiera un poco de hielo a otra manga para tuberías equipada con una pequeña boquilla lisa y marcos para tubos alrededor de las ventanas, puertas y estrellas para decorar. Ponga seis cucharadas de glaseado sobre el tarta y, usando una espátula, extienda el glaseado para cubrir el tablero con un efecto de nieve y cree una base para pegar la casa.", "Pase un poco de hielo a lo largo de los bordes de la pared y únase a la casa en la tarta helada. Deje que la formación de hielo se seque y se endurezca durante un mínimo de cuatro horas, pero preferiblemente durante la noche.", "Una vez seco, coloque dos luces nocturnas dentro de la casa antes de colocar el techo.", "Corta los extremos puntiagudos de los palitos de cóctel en trozos de 1cm / ½ en pedazos (debes tener 12 piezas puntiagudas pequeñas). Empuje el extremo romo de los trozos de cóctel en los bordes inclinados de la parte delantera y trasera de la casa, dejando los extremos puntiagudos sobresaliendo para actuar como soportes de clavija para unir el techo. (Recuerde quitar los palos de cóctel afilados de su casa de pan de jengibre antes de comerlo, para evitar el riesgo de asfixia.) Pase el glaseado entre los palitos de cóctel y fije los dos paneles del techo a la casa. Pipe la formación de hielo alrededor de la base y los bordes de la chimenea y colóquelo en el techo.", "Para decorar, canalice la formación de hielo a lo largo del ápice y los bordes del techo para que parezca nieve y carámbanos. Pegue la puerta de entrada en su lugar con glaseado. Corte la puerta trasera en tres pedazos para usar como accesorios para mantener los árboles en posición vertical. Decora los árboles de Navidad con hielo entonado y fíjalos en la tarta con ingredientes para glaseado y pan de jengibre. Espolvorea el techo con azúcar glas y enciende las luces de la noche usando una vela más liviana a través de la puerta trasera abierta. No deje las velas encendidas sin supervisión, y es mejor no quemar las velas dentro de la casa por más de 15 minutos o pueden chamuscar el interior del techo y comenzar a derretir los botones de chocolate."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_gingerbread_91126", "title": "Casa de jengibre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 1 casa de jengibre", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_gingerbread_91126_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "75g / 2¾oz de azúcar en polvo", "2 cucharaditas de polvo de especias mezcladas", "1 cucharadita de canela molida", "1 limón, ralladura finamente rallada solamente", "10 g / ¼ oz de sal", "10g / ¼ oz de levadura seca de acción rápida", "40 g / 1½ oz de mantequilla", "300 ml / 10 fl oz de leche", "1 huevo de gallinas camperas, golpeado", "200g / 7oz sultanas", "50 g / 1¾oz de cáscara mixta finamente picada", "aceite, para engrasar", "Harina simple de 75g / 2¾oz", "2 cucharadas de jarabe de oro, para acristalamiento"], "method": ["Ponga la harina, el azúcar, las especias y la ralladura de limón en un tazón grande y mezcle. Luego agregue la sal y la levadura, colocándolos en lados opuestos del recipiente.", "Derrita la mantequilla en una sartén y caliente la leche en una sartén por separado. Agregue la mantequilla y la mitad de la leche tibia a los ingredientes secos. Agregue el huevo y use sus manos para unir la mezcla, incorporando la harina de los bordes del tazón sobre la marcha. Poco a poco agregue la leche restante, para formar una masa blanda y flexible (es posible que no necesite toda la leche).", "Incline la masa sobre una superficie de trabajo ligeramente enharinada. Amase a mano incorporando las pasas y la cáscara mixta en la masa. Amase ligeramente durante 10 minutos hasta que quede sedoso y elástico y forme una bola suave. El amasado también se puede hacer en un mezclador de alimentos con un gancho de masa.", "Engrase un recipiente y coloque la masa en un recipiente, cúbrala con una película adhesiva y déjela reposar en un lugar cálido durante aproximadamente 1 ½ horas o hasta que duplique su tamaño.", "Convierta la masa en una superficie enharinada y divídala en 12 bolas. Línea 1-2 bandejas para hornear con papel y coloque las bolas en la bandeja, colocándolas bastante juntas y aplanándolas ligeramente.", "Deslice cada bandeja de horno en una bolsa grande de polietileno limpio, asegurándose de que la bolsa no toque los bollos. Deja durante 40-60 minutos hasta que los bollos se hayan duplicado en tamaño.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para el relleno, agregue la harina a un recipiente con 100 ml / 3½ fl oz de agua. Mezcle para hacer una pasta y una cuchara en la bolsa de hielo.", "Cuando los panecillos se hayan levantado, retire las bolsas de polietileno y coloque una cruz en cada panecillo. Hornee por 15-20 minutos hasta que estén pálidas doradas, girando las bandejas de horneado hasta la mitad si es necesario.", "Derrita el almíbar dorado en una sartén y, mientras los panecillos aún estén calientes, cepille los panecillos con un poco de jarabe para dar un buen brillo, antes de dejarlos enfriar sobre una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_hot_cross_65003", "title": "Bollos cruzados calientes de Mary Berry", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_hot_cross_65003_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x paquete de 135 g de jalea de naranja", "150ml / 5fl oz de agua hirviendo", "1 naranja pequeña, ralladura fina solamente", "mantequilla sin sal, para engrasar", "1 huevo grande de gallinas camperas", "25 g / 1 oz de azúcar en polvo", "Harina de auto crianza 25 g / 1 oz, tamizada", "180 g / 6% C2% BCoz% 20plain% 20chocolate% 20 (aproximadamente% 2036%% 20cocoa% 20solids)% 20"], "method": ["Para la gelatina, rompe la gelatina en pedazos y colócala en un tazón pequeño. Vierta sobre el agua hirviendo y revuelva hasta que la jalea se disuelva por completo. Agregue la ralladura de naranja, luego vierta en una bandeja poco profunda de 30x20 cm / 12x8 pulgadas. Enfríe en la nevera durante 1 hora o hasta que esté listo.", "Mientras tanto, precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4 y engrase una lata de 12 hoyos con mantequilla.", "Para la esponja, mezcle el huevo y el azúcar juntos durante 4-5 minutos hasta que estén pálidos y esponjosos, luego doble suavemente la harina. Llene cada pocillo en el molde de tres cuartos (aproximadamente una cucharada de postre por hoyo) y alise las partes superiores. Hornee por 7-9 minutos, o hasta que esté bien levantado, y la parte superior de las esponjas vuelva hacia atrás cuando se presione ligeramente. Deje que se enfríe en la bandeja por unos minutos y luego termine de enfriar en una rejilla de alambre.", "Para ensamblar, parta el chocolate en trozos y luego derrita en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. Retire el recipiente del fuego y déjelo enfriar y espese un poco.", "Convierta la gelatina en una hoja de papel para hornear antiadherente. Corta 12 discos de la jalea de naranja con un cortador redondo de 5 cm / 2 pulgadas. Siente un disco de gelatina encima de cada esponja.", "Vierta el chocolate derretido sobre los discos de gelatina. Con las puntas de los dientes de un tenedor o un pincho, presione ligeramente para crear un patrón entrecruzado en la parte superior del chocolate, luego deje que se fije por completo. Es posible que necesite recalentar el chocolate un poco si comienza a establecerse antes de que haya terminado todas las tortas de Jaffa."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_jaffa_cakes_58695", "title": "Pasteles de jaffa de Mary Berry", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_jaffa_cakes_58695_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "900 g / 2lb de carne picada", "2 cebollas, más o menos picadas", "4 palitos de apio, cortados en cubitos (opcional)", "2 dientes de ajo, aplastados", "2 cucharadas de harina normal", "150ml / ¼ de pinta de carne de vacuno", "1 cucharada de jalea de grosella (opcional) o 1 cucharadita de azúcar", "3 cucharadas de puré de tomate", "1 cucharada de tomillo picado", "2 x 400 g / 14 oz pueden tomates picados", "50g / 2oz de mantequilla", "Harina normal de 50g / 2oz", "750ml / 1¼ pintas de leche caliente", "2 cucharaditas de mostaza Dijon", "50 g / 2 oz de queso parmesano, rallado", "sal y pimienta", "10-12 hojas de lasaña", "Queso cheddar maduro de 75g / 3oz, rallado"], "method": ["Precalentar el horno a160C / 325F / Gas 3.", "Para los ragu, caliente una sartén grande hasta que esté caliente y agregue el aceite. Cocine la carne picada hasta que se dore por todas partes. Retire del fuego y transfiera a un plato. Agregue la cebolla, el apio (si está usando) y el ajo en la sartén y cocínelos hasta que se ablanden. Regrese la carne a la sartén y agregue la harina. Añadir el caldo y hervirlo. Agregue la jalea de grosella (o azúcar), puré de tomate y tomillo, luego revuelva bien.", "Agregue los tomates enlatados. Vuelva a hervir, tape y cocine a fuego lento en el horno durante 1 hora y media o hasta que la carne esté tierna.", "Para la salsa blanca, derrita la mantequilla en una cacerola. Agregue la harina y cocine sobre el fuego durante un minuto. Poco a poco bata la leche caliente, batiendo hasta que espese. Agregue la mostaza de Dijon y el queso parmesano y sazone bien con sal y pimienta.", "Para la lasaña, ponga un tercio de la salsa de carne en la base de un plato refractario de 2,3 litros / 4 pinta para horno. Coloque un tercio de la salsa blanca en la parte superior. Coloque una capa de hojas de lasaña en la parte superior. Temporada. Coloque la mitad de la salsa de carne restante en la parte superior y luego la mitad de la salsa blanca. Coloque otra capa de hojas de lasaña encima, luego la salsa de carne restante y la salsa blanca restante. Espolvorea sobre el queso cheddar.", "Déjelo durante seis horas antes de cocinar para que la pasta comience a ablandarse.", "Precaliente la temperatura del horno a 200C / 400F / Gas 6.", "Cocine en el medio del horno durante aproximadamente 45 minutos, o hasta que estén dorados en la parte superior, burbujeando alrededor de los bordes y la pasta esté suave."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_lasagne_al_16923", "title": "Lasaña al horno de Mary Berry", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_lasagne_al_16923_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla derretida, para engrasar", "2 limones, jugo y ralladura", "2 yemas de huevo de gallinas camperas, más 4 claras de huevo de gallinas camperas", "6 cucharadas de azúcar en polvo, más extra para los moldes", "3 cucharadas redondas de harina de maíz", "1 cucharada de harina integral", "90ml / 3¼fl oz de crema doble", "110ml / 4fl oz de leche entera", "azúcar glas, para quitar el polvo (opcional)"], "method": ["Cepille el interior de cuatro moldes con mantequilla. Agregue una pequeña cantidad de azúcar a cada uno y gírelos para cubrir los lados y el fondo, sacudiendo cualquier exceso. Dejar de lado para enfriar en la nevera.", "Usa un rallador fino para rallar los limones: ralla la piel exterior amarilla, pero ten cuidado de no rallar la médula blanca que está debajo (la médula hará que los soufflés sean amargos). Corta los limones por la mitad y exprime el jugo. Agregue la ralladura al jugo y colóquelo a un lado.", "Separe los huevos - parta cada huevo por la mitad e incline el contenido entre las dos cáscaras, permitiendo que los blancos se deslicen dentro del recipiente debajo mientras las yemas permanecen en las cáscaras.", "Coloque cuatro claras de huevo en un tazón grande y dos de las yemas en un tazón pequeño separado (las yemas de los huevos sobrantes se pueden guardar para huevos revueltos o natillas). Agregue 6 cucharadas de azúcar al tazón pequeño con las yemas de huevo.", "Precaliente el horno a 180 ° C (160 ° C asistido por ventilador) / 350F / Gas 4. Coloque la bandeja de horno en el centro del horno.", "Coloque la crema, la harina y la harina de maíz en un tazón mediano y mezcle hasta obtener una pasta homogénea.", "Caliente la leche en una cacerola grande a fuego medio hasta que hierva. Retire del fuego.", "Mezcle la leche caliente en la crema, harina y harina de maíz con la batidora - agregue un poco para comenzar y mezcle bien hasta que la mezcla esté suave como la crema realmente espesa. Presione cualquier bulto hacia un lado para separarlos. Luego agrega el resto de la leche.", "Vierta la mezcla en la olla y colóquela sobre un fuego suave. Batir vigorosamente con un batidor de mano hasta que se espese. Es importante seguir batiendo todo el tiempo para que la mezcla no se pegue.", "Cuando sienta que se está espesando, retire la sartén del fuego y mezcle con el zumo de limón y la ralladura un poco a la vez. El calor de la sartén continuará cocinando la mezcla.", "Use una cuchara de madera para batir las yemas de huevo y el azúcar impalpable en el tazón pequeño. Batirlos en una pasta espesa.", "Agregue esta pasta a la mezcla en la cacerola y mezcle bien hasta que quede suave. Vuelva a poner la cacerola en la placa para espesar nuevamente. Batir hasta que comience a burbujear y luego tomar si está fuera del fuego - la mezcla debe parecerse a la crema pastelera. Póngalo a un lado para que se enfríe antes de agregar las claras de huevo.", "Batir las claras de huevo en un tazón grande con un batidor manual o batidora eléctrica. Antes de comenzar, asegúrese de que el recipiente y la batidora estén completamente limpios y sin grasa, y asegúrese de que no haya yemas con las claras de huevo o de que no giren a todo volumen. Batir hasta que comiencen a formarse suaves picos: las claras de huevo deben verse como nubes.", "Cuando la mezcla en la olla se haya enfriado, puede agregar las claras de huevo. Verifique la temperatura de la mezcla antes de agregar las claras de huevo; debería ser la temperatura del cuerpo o más fresca. Agregue una cucharada grande de claras de huevo y bata bien con la batidora para que la mezcla esté menos tieso. Ahora usa una cuchara grande de metal o una espátula para doblar muy suavemente las claras de huevo restantes. Usa la cuchara para dar la vuelta al exterior y cortar por el medio; el objetivo es doblar las burbujas de aire lentamente, sin romperlas. Continúe hasta que sea una mezcla de color amarillo pálido sin rayas de clara de huevo.", "Llene los moldes hasta el borde con la mezcla y nivele con una espátula o espátula. Pase una uña del pulgar por el borde interior de los moldes (esto ayuda a que los suflés se levanten uniformemente sin engancharse en los lados).", "Coloque los moldes en la bandeja para hornear en el medio del horno durante aproximadamente 14 minutos hasta que se levanten y se pongan dorados. No abra el horno durante la cocción. Mida y mire los soufflés con cuidado, sáquelos tan pronto como se hayan levantado y empiecen a dorarse. Si usa moldes más pequeños, necesitará reducir el tiempo de cocción en unos minutos (5 o 6 soufflés más pequeños necesitarán aproximadamente 10 minutos).", "Polvo con azúcar glas y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_lovely_lemon_73914", "title": "Cómo hacer un soufflé", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_lovely_lemon_73914_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5 oz mezcla de pasas y uvas pasas", "75g / 3oz de azúcar en polvo", "1 limón o naranja, ralladura finamente rallada", "½ cucharadita de especias mixtas", "8 rebanadas finas de pan blanco, sin costras", "100 g / 4 oz de mantequilla, derretida", "2 huevos de gallinas camperas", "Crema doble de 300 ml / ½ pinta", "150ml / ¼ litro de leche", "2 cucharadas de azúcar demerara"], "method": ["Necesitará un plato a prueba de horno de aproximadamente 2½-3 pinta / 1.4-1.7 litros de volumen (18 x 23 x 5 cm / 7 x 9 x 2 in).", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y use un poco de mantequilla derretida para engrasar el plato.", "Combine la fruta seca, el azúcar, la ralladura de limón y la especia en un bol y mezcle bien.", "Corta cada rebanada de pan en tres tiras. Tome porciones suficientes para cubrir la base del plato y sumerja un lado de cada uno en mantequilla derretida. Colóquelos en el plato, con la mantequilla hacia abajo. Espolvoree con la mitad de la mezcla de fruta seca. Repita la estratificación, colocando las tiras de pan con la mantequilla hacia arriba. Coloque la tercera y última capa de tiras de pan en la parte superior, con la mantequilla hacia arriba.", "Para la crema pastelera, bata los huevos, la crema y la leche en un bol y vierta sobre el pudin. Espolvorea con azúcar demerara y luego deja reposar durante aproximadamente una hora si el tiempo lo permite.", "Hornee durante unos 30-40 minutos, o hasta que la parte superior esté dorada y crujiente y el pudín ligeramente hinchado. ¡Sirve caliente, o hay algunos que insisten en que está delicioso!"], "url": "www_bbc_co_uk_food_recipes_mary_berrys_mothers_97161", "title": "Pudín de pan y mantequilla de la madre de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_mothers_97161_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo, más un poco más para quitar el polvo del pastel terminado", "Harina de levante 225g / 8oz", "2 cucharaditas de polvo de hornear", "250 g / 8 oz de pasta para untar, margarina o mantequilla suave a temperatura ambiente, más un poco más para engrasar las latas", "mermelada de fresa o frambuesa de buena calidad", "crema doble batida (opcional)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee 2 latas de sandwich de 20 x 20 cm. Use un trozo de papel para hornear para frotar un poco de pasta para hornear o unte mantequilla alrededor de las latas hasta que los lados y la base estén ligeramente recubiertos y luego forre la parte inferior de las latas con un círculo de papel para hornear.", "Rompa los huevos en un tazón grande para mezclar, luego agregue el azúcar, la harina, el polvo de hornear y la pasta para untar. Mezcle todo junto hasta que esté bien combinado con un mezclador de mano eléctrico (también puede usar una cuchara de madera), pero tenga cuidado de no mezclar en exceso. Coloque un paño húmedo debajo de su tazón cuando mezcle para evitar que se mueva. La mezcla terminada debe caerse de una cuchara fácilmente.", "Divida la mezcla de manera uniforme entre las latas: no es necesario que sea exacta, pero puede pesar las latas llenas si desea verificarlas. Use una espátula para eliminar toda la mezcla del bol y suavemente alise la superficie de los pasteles.", "Coloque las latas en el estante del medio del horno y hornee durante 25 minutos. Verifique los pasteles después de 20 minutos.", "Los pasteles están hechos cuando son dorados y salen del borde de las latas. Presiónalas suavemente para comprobar: deben ser elásticas al tacto. Sácalos del horno y déjalos enfriar en latas por cinco minutos. Luego, coloque una paleta o un cuchillo de mantequilla alrededor del borde interior de la lata y con cuidado pase las tortas a una rejilla para enfriar.", "Para sacar los pasteles de las latas sin dejar una marca de rejilla en la parte superior, coloque la toalla de té limpia sobre la lata, coloque la mano sobre la toalla de cocina y coloque la lata boca abajo. La torta debe salir en su mano y la toalla de té, luego puede pasarla de su mano a la rejilla. Dejar de lado para enfriar por completo.", "Para armar la torta, coloque una torta boca abajo en un plato y extiéndala con abundante mermelada. Si lo desea, puede extenderse sobre la crema batida también. Cubra con la segunda torta, con la parte superior hacia arriba. Espolvorea sobre el azúcar en polvo."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_perfect_34317", "title": "El sándwich de Victoria perfecto de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_perfect_34317_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de azúcar mascabado ligero", "175g / 6oz de mantequilla, ablandada, más extra para engrasar", "Harina de 175g / 6oz de auto crianza", "3 huevos grandes de gallinas camperas", "50 g / 1¾oz de almendras molidas", "3 cucharadas de leche", "100 g / 3½ oz de sultanas", "100g / 3½oz de cerezas heladas, descuartizado", "Albaricoques secos 100 g / 3½ oz, cortados en trozos pequeños", "2 cucharaditas de polvo de especias mezcladas", "Mazapán de oro de 450 g / 1lb", "3 cucharadas de mermelada de albaricoque", "1 huevo de gallinas camperas, golpeado"], "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Engrase una lata redonda de 20 cm / 8 pulg., Profunda, de fondo suelto con mantequilla y forre la base con papel de hornear.", "Coloque los ingredientes de la torta en un tazón grande y bata hasta que estén bien incorporados. Vierta la mitad de la mezcla en la lata preparada y nivele la superficie.", "Enrolle un tercio del mazapán al mismo tamaño que la base de la lata y colóquelo sobre la mezcla de la torta.", "Vierta la mezcla de pastel restante sobre el mazapán y nivele la superficie. Hornee de 1 a 2 horas o hasta que estén doradas en la parte superior y firmes en el medio. Si el pastel comienza a dorarse pero no se cocina, cúbralo con papel de aluminio. Deja enfriar la tarta durante 10 minutos antes de sacarla de la lata.", "Caliente la mermelada de albaricoque en una sartén, luego cepille la parte superior de la torta fría con un poco de mermelada tibia. Estirar la mitad del mazapán restante para que se ajuste a la parte superior del pastel. Coloque el mazapán en el pastel y use el pulgar para engarzar los bordes.", "Haga 11 bolas del mazapán restante y colóquelas alrededor del borde de la torta, fijándolas en el mazapán con un poco de huevo batido.", "Cepille el mazapán con el huevo y esmalte bajo una parrilla caliente durante aproximadamente 5 minutos (girando la torta para asegurar un dorado uniforme). Puede hacer esto usando un soplete de cocina si lo prefiere."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_simnel_cake_49483", "title": "Pastel de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 4oz de cerezas rojas o glacé naturales", "225g / 8oz de mantequilla suavizada", "225g / 8oz de azúcar mascabado ligero", "4 huevos grandes de gallinas camperas", "Harina de levante 225g / 8oz", "225 g / 8oz sultanas", "100 g / 4 oz de grosellas", "50g / 2oz de cáscara confitada picada", "2 limones, solo cáscara", "2 niveles de cucharadita de especias mixtas", "Mazapán de oro de 450 g / 1lb", "2 cucharadas de mermelada de albaricoque", "1 huevo grande de gallinas camperas, batido, para esmaltar", "1 huevo blanco de corral", "prímulas orgánicas (o alternativamente otras flores de primavera comestibles)", "puñado de azúcar en polvo"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Engrase una lata de pastel redonda de 20 cm / 8 pulgadas de profundidad y luego forre la base y los costados con papel de hornear.", "Cortar las cerezas en cuartos, poner en un colador y enjuagar con agua corriente. Escurra bien y luego séquese bien en papel de cocina.", "Batir la mantequilla y el azúcar juntos en un tazón grande hasta que estén suaves y cremosos. Batir los huevos, uno a la vez, para evitar que se cuajen. Tamice la harina y mezcle un poco a la vez. Mezcle bien la fruta, la cáscara, la ralladura y la mezcla de especias en la mezcla. Coloque la mitad de la mezcla en la lata preparada y nivele la superficie.", "Tome un tercio del mazapán y extiéndalo en un círculo del tamaño de la lata y luego coloque el círculo sobre la mezcla de la torta. Vierta la mezcla restante de la torta en la parte superior y nivele la superficie.", "Hornee en el horno precalentado durante aproximadamente 2½ horas hasta que esté bien levantado, uniformemente dorado y firme al tacto. Cubra con papel de aluminio después de una hora si la parte superior se está dorando demasiado rápido. Dejar enfriar en la lata durante 10 minutos y luego salir, desprender el pergamino y terminar de enfriar en una rejilla de alambre.", "Cuando el pastel esté frío, caliente la mermelada de albaricoque en una cacerola pequeña. Cepille la parte superior del pastel con un poco de mermelada y extienda la mitad del mazapán restante para que se ajuste a la parte superior del pastel. Presione firmemente en la parte superior y engarce los bordes para decorar. Marque un patrón entrecruzado en el mazapán con un cuchillo afilado. Forme el mazapán restante en 11 bolas.", "Cepille el mazapán con huevo batido y coloque las bolas de mazapán en el borde del pastel. Cepille las copas de las bolas con huevo batido, también, y luego coloque la torta debajo de una parrilla caliente para que el mazapán se dore.", "Para cristalizar las prímulas, bata la clara de huevo en un bol hasta que quede espumosa. Corta los tallos largos de las prímulas, luego, con un pincel, pinta cuidadosamente los pétalos de cada prímula con una clara de huevo espumosa, luego gira la flor y pinta la parte inferior de los pétalos y el tallo pequeño.", "Cubra las flores en azúcar impalpable hasta que toda la clara de huevo esté uniformemente cubierta, y deje secar completamente. Puede simplemente acostarlos cuidadosamente en un pergamino antiadherente, o, para ayudar a mantener la forma de las flores, puede estirar papel antiadherente sobre una caja de plástico o tazón, asegurándolo con una cuerda o una banda de goma, y ​​luego perforar varios agujeros en el papel con un pincho. Coloque los tallos de las flores cristalizadas a través de los agujeros, permitiendo que el papel sostenga y soporte las flores en una posición más natural a medida que se secan y se endurecen. Tendrá que hacer las flores cristalizadas al menos con un día de anticipación.", "Decora el pastel colocando las prímulas cristalizadas en la parte superior y atando una cinta alrededor del centro."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_simnel_cake_84841", "title": "Pastel de Mary Berry", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo, más extra para quitar el polvo", "100g / 3½ oz de harina de auto crianza", "Mermelada de fresa 175g / 6oz o conservar", "20 ratafía biscuits", "1 x 800 g / 1 lb 12 oz de peras de estaño en jugo natural", "250ml / 9fl oz de jerez medio seco", "3 huevos grandes de gallinas camperas, solo yemas", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de harina de maíz", "1 cucharadita de extracto de vainilla", "600 ml / 1 pinta de leche entera", "300ml / 10½ fl oz de crema individual", "250ml / 9fl oz de crema batida", "Almendras en copos de 25 g / 1oz, tostadas", "10 cerezas"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Engrase y forre una lata de rollo suizo de 33x23 cm / 13x9 in con papel para hornear.", "Para el rollo suizo, bata los huevos y el azúcar juntos en un tazón grande hasta que la mezcla sea liviana y espumosa y el batidor deje un rastro cuando se levante. Tamiza la harina en la mezcla y dóblala con cuidado. Gira la mezcla en la lata preparada y agita suavemente para que la mezcla encuentre su propio nivel, asegurándose de que se haya extendido uniformemente a las esquinas.", "Hornee durante 10-12 minutos, o hasta que la esponja se dore y comience a encogerse desde los bordes de la lata. Mientras se cocina la torta, coloque un trozo de pergamino para hornear un poco más grande que el tamaño de la lata en la superficie de trabajo y espolvoréelo con azúcar en polvo.", "Voltea la torta en el pergamino azucarado y quita el papel. Recorte los bordes de la esponja con un cuchillo afilado para obtener bordes limpios y rectos. Haga una marca de puntuación en uno de los lados largos, a unos 2 cm del borde, teniendo cuidado de no cortar.", "Dejar enfriar un poco, luego extender con mermelada. Enrolle la torta firmemente desde el extremo marcado.", "Cortar el rollo suizo en 14 rebanadas. Coloque con cuidado ocho de las rebanadas, muy juntas, alrededor de los lados de un recipiente de vidrio recto de 20 cm / 8 pulg., Con los lados cortados hacia afuera.", "Para el relleno, coloque las seis rebanadas restantes en la base del plato. Desmenuce los bizcochos de ratafia en la parte superior.", "Combine 150 ml / 5 fl oz del jugo de pera drenado de la lata con el jerez y espolvorear sobre la esponja y galletas desmenuzadas. Nivela la superficie presionando hacia abajo con una cuchara y déjala remojar mientras preparas la crema pastelera.", "Para la crema pastelera, ponga las yemas de huevo, el azúcar impalpable, la harina de maíz y el extracto de vainilla en un tazón grande y mezcle hasta que se mezcle. Caliente la leche y la crema juntas en una sartén hasta que estén calientes, pero no hirviendo. Poco a poco mezcle esto en la mezcla de yema de huevo poco a poco, luego regrese la mezcla a la sartén. Revuelva a fuego alto hasta que la mezcla hierva y la crema se espese. Quite el calor y cubra con una película adhesiva en contacto con la superficie para evitar que se forme la piel.", "Escurrir las peras y cortar cada mitad en tres a lo largo y disponer sobre las esponjas. Vierta sobre la crema pastelera, cubra y deje hasta que esté completamente frío antes de transferir a la nevera para enfriar y preparar.", "Batir la crema batida en un bol hasta que una cinta de crema caiga del batidor cuando se quite el batidor. Dejando a un lado tres cucharadas de decoración final, extender suavemente la crema sobre la superficie de la crema y esparcir con las almendras. Batir la crema restante hasta que se formen picos suaves cuando se quita la batidora y la cuchara 10 gotas de crema alrededor de la bagatela, una para cada porción. Decorar con 10 cerezas y enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_tipsy_trifle_21330", "title": "Bagatela de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_tipsy_trifle_21330_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "130 g / 4½ oz de mantequilla, más extra para engrasar", "Jarabe de oro de 400g / 14oz", "Pan rallado blanco fresco fino de 150g / 5½oz", "2 limones, ralladura y jugo", "1 huevo de gallinas camperas, batido, para usar como huevo lavado"], "method": ["Primero prepare la masa de masa corta: mida la harina en un tazón grande y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas (como alternativa, esto se puede hacer en un procesador de alimentos). Agregue aproximadamente tres cucharadas de agua fría y mezcle con una masa firme, envuélvala en una película adhesiva y déjela enfriar en la nevera durante unos 20 minutos.", "Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja de horno pesada en el horno para calentar. Engrase una lata de flan sin fondo de 18 cm / 7 pulgada de fondo suelto con mantequilla.", "Retire alrededor de 150 g / 5½ oz de hojaldre de la bola principal y déjelo a un lado para la parte superior de la celosía.", "Extienda el resto de la masa fina sobre una superficie de trabajo ligeramente enharinada y forre la lata de flan preparada con la masa.", "Pincha la base con un tenedor, para evitar que la base se levante durante la cocción.", "Coloque la masa reservada para la parte superior de la celosía sobre la película adhesiva y extiéndala finamente. El huevo lava la masa y déjelo a un lado para que se enfríe en la nevera (la película adhesiva hace que sea más fácil moverse). No corte en tiras en esta etapa. No laves las tiras una vez que están en la tarta, ya que gotearán en la mezcla de melaza.", "Para hacer el relleno, caliente el jarabe suavemente en una sartén grande, pero no hierva.", "Una vez derretido, agregue el pan rallado, el jugo de limón y la ralladura al almíbar. (Puede agregar menos limón si prefiere menos sabor cítrico.) Si la mezcla se ve líquida, agregue algunas migas de pan más.", "Vierta la mezcla de jarabe en la lata forrada y nivele la superficie.", "Retire la masa reservada de la nevera y córtela en tiras largas, de 1 cm / ½ pulgadas de ancho. Asegúrese de que todos sean más largos que los bordes de la lata de tarta.", "Huevo lavar el borde de la masa en la lata, y comenzar a hacer el patrón de celosía colocación por encima de la mezcla, deje las tiras colgando sobre el borde de la lata.", "Una vez que el enrejado esté en su lugar, use el borde de estaño para cortar las tiras presionando hacia abajo con las manos, creando un acabado limpio.", "Hornee en la bandeja para hornear precalentada en el horno caliente durante aproximadamente 10 minutos hasta que la pasta comience a colorear, y luego reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4. Si en esta etapa el enrejado parece estar poniéndose demasiado oscuro marrón, cubra la tarta con papel de aluminio.", "Hornee durante otros 25-30 minutos hasta que la masa esté dorada y el juego de llenado.", "Retire la tarta del horno y déjela reposar en la lata. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_mary_berrys_treacle_tart_28524", "title": "Tarta de melaza de Mary Berry con tapa de celosía tejida", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_treacle_tart_28524_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina de maíz", "1 x 500 g / 17 oz de yogur de estilo griego", "2 huevos", "1 cucharadita de mostaza Dijon", "75 g / 3 oz de queso parmesano fresco (u otro queso duro), rallado", "limón, para hacer jugos (opcional)"], "method": ["Mida la harina de maíz en un tazón.", "Mezcle en un poco de yogur, agregue los huevos y bata con un batidor de mano hasta que quede suave.", "Mezcle el yogurt restante y la mostaza.", "Si se usa con un moussaka (u otro plato horneado al horno), la salsa de yogur ahora está lista para ser untada sobre las berenjenas, espolvoreada con queso y cocinada en un horno precalentado durante aproximadamente 45 minutos. Esto espesará el yogur y la salsa de queso.", "Para una salsa caliente (para pescado), mezcle cuatro cucharadas de yogur con una cucharada de harina de maíz y la mostaza hasta que quede suave.", "Mezcle en el yogur restante.", "Llevar a ebullición y revolver constantemente, hasta que espese y suavice.", "Mientras revuelve, agregue el queso, dos yemas de huevo (no los blancos) y sazone con sal y pimienta.", "En este punto, se puede agregar un chorrito de jugo de limón si lo desea.", "Sazone con sal y pimienta y vierta directamente sobre el pescado ya cocido."], "url": "www_bbc_co_uk_food_recipes_maryberryscheatschee_73830", "title": "Salsa de queso trampa de Mary Berry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 255g / 9oz", "pizca de sal", "140g / 5oz de margarina dura o mantequilla", "6 cucharaditas de agua fría", "3 manzanas Bramley grandes para cocinar, picadas, guisadas y enfriadas", "azúcar al gusto", "azúcar en polvo, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina y la sal en un tazón.", "Frote la margarina o la mantequilla hasta que la mezcla se asemeje a migas de pan finas.", "Agregue el agua fría a la mezcla de harina. Con un cuchillo, mezcle el agua en la harina, con la mano para reafirmar la mezcla. La masa debe ser de un color uniforme y una consistencia adecuada para rodar.", "Divida la masa en dos mitades. Tome la mitad y extiéndalo para que quede lo suficientemente grande como para cubrir un esmalte de 20 cm / 8 pulgadas o una placa de aluminio. Recorte los bordes con un cuchillo utilizando el borde de la placa como su guía.", "Cubra la masa con las manzanas cocidas y espolvoree con azúcar al gusto.", "Estirar la otra mitad de la masa. Humedezca el borde de la capa inferior de masa y coloque la segunda pieza en la parte superior.", "Presione hacia abajo en los bordes de la pastelería, asegurándose de que estén sellados correctamente. Corte cualquier exceso de hojaldre con un cuchillo en un movimiento descendente, utilizando nuevamente la placa como su guía.", "Flute los bordes con una acción de pellizco con los dedos y el pulgar.", "Pincha ligeramente la superficie de la masa antes de colocar el pastel en el horno. Cocine por 20-30 minutos.", "Cuando el pastel esté cocido, se moverá ligeramente sobre la placa cuando se agite suavemente.", "Deslice sobre un plato de servir, espolvoree con azúcar en polvo y sirva."], "url": "www_bbc_co_uk_food_recipes_maryhenrysproperappl_67463", "title": "Pastel de manzana adecuado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maryhenrysproperappl_67463_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pollo listo para el horno de 1,7 kg / 3 lb 11oz, unido en 8 piezas", "250ml / 9fl oz de suero de leche", "1 cucharada de salsa Worcestershire", "Harina normal de 200g / 7oz", "2 cucharaditas de sal marina en copos", "1 cucharada de pimentón", "½ cucharadita de pimienta de cayena, o al gusto", "1 cucharadita de pimienta negra recién molida, o al gusto", "1 cucharadita de tomillo seco", "1 cucharadita de orégano seco", "500ml / 18fl oz de aceite de girasol o maní, para freír", "50g / 1¾oz de mantequilla", "aceite de girasol, para engrasar", "Harina normal 150g / 5½ oz", "3 cucharadas de harina de maíz", "1½ cucharadita de polvo de hornear", "1 cucharada de lanzador dorado o azúcar blanco granulado", "1 huevo grande de gallinas camperas", "225 ml / 8 fl oz de leche semidesnatada", "jarabe de arce, para servir", "mantequilla, para servir (opcional)"], "method": ["Para el pollo frito, ponga el pollo en un tazón o plato poco profundo y vierta sobre el suero de leche y la salsa Worcestershire. Mezcle el pollo en la mezcla de suero de leche, cúbralo con film transparente y déjelo marinar en el refrigerador durante al menos 2 horas y hasta 4 horas antes de cocinarlo.", "Cuando esté listo para cocinar, coloque la harina común en un plato grande y poco profundo. Agregue la sal, el pimentón, la pimienta de cayena, la pimienta negra, el tomillo y el orégano. Mezcle bien todos los ingredientes secos. Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Vierta el aceite en una sartén grande o una sartén honda y ponga a fuego medio alto. Coloque un termómetro en el aceite y caliente a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, caliente el aceite en una freidora.", "Tome cada uno un trozo de pollo con pinzas y agite ligeramente para eliminar el exceso de suero de leche. Ponlo en la harina. Dé vuelta hasta que esté bien cubierto, luego retírelo con pinzas y colóquelo en un plato. Repita con el resto del pollo. Cuando el aceite haya alcanzado la temperatura adecuada, baje cuidadosamente las piezas de pollo en el aceite. Cocine en lotes de 3 o 4 piezas a la vez, cocine por 2-3 minutos en cada lado, o hasta que estén doradas y crujientes. Permitir que el aceite vuelva a la temperatura correcta entre lotes ayudará a garantizar que el pollo esté liviano y crujiente.", "Saque el pollo cocido de la sartén con pinzas limpias (no las pinzas que se han usado para el pollo crudo). Coloque una bandeja para hornear forrada con papel de cocina para ayudar a absorber el exceso de aceite. Saque cualquier trozo de pasta del aceite con una cuchara ranurada.", "Transfiera el pollo frito a un estante y coloque una bandeja para hornear. Hornee en el horno por 15 minutos o hasta que esté cocido.", "Para los waffles, ponga la mantequilla en una olla pequeña y derrita a fuego lento. Precaliente una máquina de hacer gofres en su segundo ajuste más alto, engrasando con un poco de aceite de acuerdo con las instrucciones del fabricante.", "Mezcle la harina, la harina de maíz, el polvo de hornear, el azúcar y una buena pizca de sal fina en un bol y haga un pozo en el centro. Batir el huevo con la leche y la mantequilla derretida en una jarra con un batidor de metal hasta que quede suave. Poco a poco mezcle la leche y la mezcla de huevo en la harina hasta que se combinen. Viértalo en la jarra y déjelo reposar durante 10 minutos.", "Vierta la cantidad suficiente de la mezcla en la máquina de hacer gofres para llenar cada plato y alisar rápidamente la superficie con un cuchillo palatte o una espátula. Cierre la tapa y cocine los gofres durante 4-5 minutos, o hasta que estén bien crujientes, crujientes y dorados. Levante con cuidado de la máquina de hacer gofres con pinzas y manténgase caliente mientras los waffles restantes están cocidos.", "Una vez cocinado, escurra bien el pollo en un rollo de cocina más y sirva caliente con los gofres, el jarabe de arce y un pomo de mantequilla, si lo desea."], "url": "www_bbc_co_uk_food_recipes_maryland_fried_chicken_30424", "title": "Pollo frito de Maryland con waffles y jarabe de arce", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de pan rallado fresco", "1 cucharadita de hojuelas de chile", "sal y pimienta negra recién molida", "4 pechugas de pollo, piel dejada en", "2 huevos de gallinas camperas, golpeados", "Aceite para freír", "30g / 1oz de mantequilla", "Harina normal 300g / 10½ oz", "Polenta de 300 g / 10½ oz", "200g / 7oz de azúcar glasé", "1 cucharada sopera de polvo de hornear", "1 huevo de gallinas camperas, golpeado", "Leche 250ml / 9fl oz", "200g / 7oz de mantequilla, derretida", "aceite vegetal, para freír", "Harina normal 175g / 6oz", "1 cucharada de azúcar", "aproximadamente 100 ml / 3½ fl oz de agua helada (suficiente para hacer una masa)", "3 plátanos, cortados en trozos gruesos"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo de Maryland, combine las migas de pan y las hojuelas de chile en un bol y sazone bien con sal y pimienta negra recién molida.", "Sazonar el pollo y sumergir en el huevo batido, luego la mezcla de pan rallado, para cubrir todo.", "Calentar el aceite en una sartén y freír el pollo durante unos 12 minutos a fuego medio, volteándolo con frecuencia, hasta que esté crujiente y dorado.", "Coloque las pechugas de pollo con mantequilla, colóquelas en una bandeja para hornear y transfiéralas al horno. Hornee durante diez minutos o hasta que el pollo esté completamente cocido.", "Para el pan de maíz, coloque la harina, la polenta, el azúcar y el polvo de hornear en un bol y mezcle bien. Coloque un plato hondo y resistente al horno en el horno.", "Haga un pozo en el centro de la mezcla seca y agregue el huevo batido y la leche. Mezcle bien, luego agregue la mantequilla derretida.", "Vierta la mezcla en el plato caliente a prueba de horno, transfiéralo al horno y hornee por 15 minutos o hasta que se dore.", "Para los buñuelos de plátano, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina y el azúcar en un tazón y agregue suficiente agua para hacer una mezcla suave. Sumerja los pedazos de plátano en la mezcla para cubrir.", "Con cuidado, coloque los plátanos en el aceite caliente y fríelos durante 4-5 minutos, o hasta que estén crujientes y dorados.", "Para servir, coloque el pollo de Maryland, los pan de maíz y los buñuelos de plátano en un plato grande."], "url": "www_bbc_co_uk_food_recipes_marylandchickenwithb_86621", "title": "Pollo de Maryland con buñuelos de banana y pan de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Frambuesas 200 g / 7 oz", "250g / 9oz de mermelada de azúcar", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "150 g / 5½ oz de mantequilla, refrigerada", "25g / 1oz de azúcar glas", "1 huevo grande de gallinas camperas, golpeado", "150 g / 5½ onzas de mantequilla, suavizadas", "150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de almendras molidas", "1 huevo grande de gallinas camperas, golpeado", "1 cucharadita de extracto de almendra", "300g / 10½oz de azúcar glas", "1 cucharadita de extracto de almendra", "gel colorante para alimentos de color rosa"], "method": ["Para el atasco, coloca las frambuesas en una cacerola pequeña y profunda y tritúralas con un triturador. Agregue el azúcar y deje hervir a fuego lento hasta que el azúcar se derrita. Aumente el fuego y hierva por 4 minutos. Retirar del fuego y verter cuidadosamente en un recipiente poco profundo. Dejar enfriar y establecer.", "Para la masa, mida la harina en un tazón y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue el azúcar glas. Agregue el huevo y 2 cucharadas de agua fría, mezclándolas para formar una masa suave.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada al grosor de una moneda de una libra. Cubra una lata acanalada flauta de 23cm / 9in y transfiera a la nevera para enfriar durante 30 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Alinee la caja de repostería con papel para hornear antiadherente y rellene con alubias para hornear o arroz sin cocer. Hornee a ciegas durante 15 minutos, luego quite los frijoles y el papel y cocine por otros 5 minutos para secar la base. Reserve para enfriar un poco antes de agregar el relleno.", "Para el relleno, extienda la base de la caja de pastelería con 4 cucharadas de mermelada de frambuesa.", "Bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Agregue las almendras molidas, el huevo y el extracto de almendras y mezcle. Coloca la mezcla en la caja de pastelería y alisa la superficie con una espátula.", "Reduzca la temperatura del horno a 180C / 160C Fan / Gas 4 y hornee durante 25-35 minutos, hasta que se dore y una broche insertada en el centro salga limpia. Retire del horno y deje enfriar completamente en la lata.", "Para la formación de hielo, tamice el azúcar glas en un tazón. Agregue el extracto de almendras y aproximadamente 3 cucharadas de agua fría para obtener un glaseado suave y bastante espeso. Coloque 3 cucharadas de glaseado en un recipiente aparte y agregue un poco de gel colorante para alimentos de color rosa para hacer un glaseado color frambuesa. Con una cuchara, coloque el glaseado rosa en una pequeña bolsa con una pequeña boquilla.", "Cuando la tarta se haya enfriado por completo, coloca la capa de glaseado blanca encima y extiéndela para formar una superficie lisa. Pase las líneas paralelas de glaseado rosa sobre el glaseado blanco, luego arrastre un palillo de cóctel por las líneas (en un ángulo de 90 grados con respecto a las líneas) para crear un efecto de pluma. Deje que se fije, luego sirva en rebanadas."], "url": "www_bbc_co_uk_food_recipes_marys_bakewell_tart_12584", "title": "Tarta de Bakewell de Mary", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_bakewell_tart_12584_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos grandes de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "100 g / 3½ oz de harina de auto crianza, tamizada", "50 g / 1¾oz de cacao en polvo, tamizado", "2 x 390g jarras de cerezas negras en kirsch (500g / 1lb 2oz de peso escurrido)", "2 cucharadas colmadas de harina de maíz", "Crema doble de 750ml / 1⅓ pinta, batida", "150g / 5½ oz de chocolate blanco", "250 g / 9 oz% 20plain% 20chocolate% 20 (aproximadamente% 2046%% 20cocoa% 20solids)", "24 cerezas frescas con tallos"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase ligeramente dos moldes para pasteles de 23 cm / 9 pulgadas y forre la base con papel para horno antiadherente engrasado.", "Rompa los huevos en un tazón para mezclar, agregue el azúcar y bata hasta que la mezcla esté pálida y lo suficientemente espesa como para dejar un rastro cuando se levante el batidor del tazón. Doble con cuidado la harina tamizada y el polvo de cacao. Convierta la mezcla en latas preparadas.", "Hornee por 25-30 minutos, hasta que las esponjas estén bien levantadas y comenzando a encogerse lejos de los lados de la lata. Dé vuelta a una rejilla para enfriar y despegar el pergamino.", "Para el relleno, escurra los frascos de cerezas, reservando el jugo. Picar las cerezas aproximadamente en cuartos. Mida la harina de maíz en una cacerola pequeña, haga una pasta con una pequeña cantidad del jugo reservado, luego agregue el jugo restante. Colocar a fuego medio y llevar lentamente a ebullición, revolviendo hasta que espese, luego cocine a fuego lento durante 2 minutos. Retire del fuego, agregue las cerezas y deje enfriar. Refrigere hasta bastante firme.", "Para la decoración, derrita el chocolate blanco y simple en 2 cuencos separados sobre 2 bandejas de agua hirviendo a fuego lento. Sumerja 12 de las cerezas frescas en el chocolate puro y déjelas en una hoja de papel para hornear antiadherente. Sumerja las 12 cerezas frescas restantes en el chocolate blanco y déjelo reposar. Vierta el chocolate derretido restante en 2 bolsas desechables separadas.", "Dibuja un rectángulo de tamaño de tarjeta de crédito en un pedazo de papel y colócalo verticalmente. Dibuja un árbol dentro del rectángulo para usar como plantilla. Coloque una hoja de papel pergamino antiadherente sobre la plantilla. Recorte la punta de la bolsa de tubo de chocolate liso (comience con una punta muy pequeña). Tubo 12 (más algunas piezas de repuesto en caso de que se rompan) formas de árbol de chocolate en el pergamino antiadherente. Deje endurecer y establecer.", "Cuando el chocolate en las cerezas se haya puesto, corte el extremo de la manga pastelera de chocolate blanco y pinte finas líneas de chocolate blanco sobre las cerezas bañadas en chocolate. Tuberías delgadas líneas de chocolate sobre las cerezas sumergidas de chocolate blanco. Deja para establecer.", "Batir la crema a los picos suaves. Divida la crema por la mitad, dejando a un lado una mitad para los lados y la parte superior de la torta.", "Corta cada esponja en 2 capas con un cuchillo largo y afilado. Divida la mezcla de cerezas en tres partes. Extienda un tercio de la mezcla de cerezas sobre la esponja en rodajas. Divida una mitad de la crema en tres partes y extienda un tercio sobre la mezcla de cerezas. Cubra con otra capa de esponja y continúe hasta que tenga tres capas de cerezas y crema. Cubra con la capa final de esponja.", "Extiende la mitad de la crema batida reservada alrededor de los lados del pastel y cúbrelo con los árboles de chocolate. Con la crema reservada restante, coloca rosetones de crema alrededor del borde superior del pastel y decora con las cerezas bañadas en chocolate."], "url": "www_bbc_co_uk_food_recipes_marys_black_forest_gteau_47151", "title": "Gteau de Mary's Black Forest", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 torta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_black_forest_gteau_47151_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de cerezas heladas", "Harina de levante 225g / 8oz", "175g / 6oz de mantequilla ablandada, más extra para engrasar", "175g / 6oz de azúcar en polvo", "1 limón, ralladura finamente rallada solamente", "50 g / 1¾oz de almendras molidas", "3 huevos grandes de gallinas camperas", "175g / 6oz de azúcar glas", "1 limón, solo jugo", "Almendras en copos de 15g / ½oz, tostadas", "5 cerezas heladas, descuartizadas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un molde de estaño o savarin de 23 cm / 9 in con mantequilla.", "Corta las cerezas en cuartos. Reserve a un lado cinco de las cerezas descuartizadas para la decoración posterior. Coloque el resto de las cerezas en cuartos en un tamiz y enjuague con agua corriente. Escurra bien, luego séquelo bien sobre papel de cocina y agregue dos cucharadas de harina.", "Mida todos los ingredientes restantes en un tazón grande y bata bien durante dos minutos para mezclar bien. Doble ligeramente las cerezas. Convierta en la lata preparada.", "Hornee en el horno precalentado durante 35-40 minutos hasta que esté bien levantado, dorado y una broche insertada en el centro salga limpia. Deje enfriar en la lata durante 10 minutos, luego déjela enfriar en una rejilla.", "Para la guinda, mezcle el azúcar glas junto con el jugo de limón en una pasta espesa. Rocíe la torta fría con el dorso de una cuchara, espolvoree sobre las almendras tostadas y las cerezas reservadas."], "url": "www_bbc_co_uk_food_recipes_marys_cherry_cake_17869", "title": "Pastel de cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_cherry_cake_17869_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 3¾oz de mantequilla, en cubos", "Harina normal 130g / 4¾oz, tamizada", "4 huevos grandes de gallinas camperas, ligeramente golpeados", "600ml / 20fl oz de leche entera", "6 yemas de huevo de gallinas camperas", "75g / 2¾oz de azúcar en polvo", "50g / 1¾oz de harina de maíz", "½ cucharadita de canela molida", "¼ cucharadita de nuez moscada molida", "150ml / 5fl oz de crema doble", "100g / 3% C2% BDoz% 20milk% 20chocolate,% 2046 %% 20minimo% 20cocoa% 20solids", "100ml / 3½ fl oz crema doble", "100g / 3½oz de chocolate blanco, derretido", "200 g / 7 oz de azúcar en polvo", "pasta roja para colorear alimentos", "12 avellanas blanqueadas"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque tres bandejas para hornear con papel para hornear.", "Pon la mantequilla en una cacerola pesada con 250ml / 9 fl oz de agua y calienta a fuego medio hasta que la mantequilla se derrita. Llevar a ebullición teniendo cuidado de no quemar la mantequilla.", "Retire del fuego y agregue la harina. Revuelva vigorosamente con una cuchara de madera hasta que la mezcla forme una bola suave. Cocine a fuego lento durante 3-5 minutos, revolviendo constantemente para secar el choux. Dejar enfriar un poco.", "Incline en el recipiente de un mezclador de alimentos con un accesorio batidor o use un batidor de mano eléctrico. Poco a poco agregue los huevos, batiendo bien entre cada adición, para formar una pasta lisa y brillante. Coloque la mezcla en una bolsa de plástico con una boquilla simple de 1½ cm / ¾in.", "Pipe doce pequeños montículos en cada bandeja de hornear preparada (dando un total de 36 montículos). Sumerja su dedo en agua y suavemente alise la parte superior de cada montículo. Hornea por 10 minutos.", "Reduzca la temperatura del horno a 190 ° C / 170 ° Ventilador / Gas 5. Cocine los choux por otros 10 minutos hasta que estén dorados.", "Perfore cada panecillo con un pincho para permitir que escape el vapor. Regrese al horno por 5 minutos para que se seque. Dejar enfriar sobre una rejilla.", "Para la crème pâtissière, vierta la leche en una sartén de base pesada y llévela a ebullición. Retire del fuego y deje enfriar durante 30 segundos.", "Mientras tanto, en un tazón mediano, mezcle las yemas de huevo y el azúcar impalpable hasta que estén pálidas, luego mezcle la harina de maíz, la canela y la nuez moscada. Vierta la leche sobre la mezcla de huevo, batiendo continuamente, luego vuelva a verter en la sartén.", "Llevar a ebullición, batiendo continuamente a fuego medio y cocinar por un minuto. Retire del fuego y vierta la crema pastelera en un recipiente. Cubra la superficie con film transparente para evitar que se forme una capa y deje que se enfríe.", "Para la ganache de chocolate, rompe el chocolate en pedazos y colócalo en un tazón resistente al calor. Vierta la crema en una sartén y caliente hasta que hierva a fuego lento. Retirar del fuego y verter sobre el chocolate. Revuelva hasta que la mezcla esté suave. Deje enfriar hasta que espese lo suficiente para rociar.", "Para los copos de nieve de chocolate, vierta el chocolate en una pequeña bolsa con una boquilla para escribir. Pipe 12 formas de copo de nieve en el pergamino de la hornada y déjelo para fijar.", "Para ensamblar, batir la crema doble en picos suaves y doblar en la crème pâtissière. Coloque la cuchara en una manga pastelera con una boquilla larga y delgada o una jeringa de mermelada. Llene los bollos choux con la crème pâtissière.", "Para el caramelo, hierva el azúcar impalpable y 5 cucharadas de agua juntas en una sartén hasta que se torne dorado o llegue a 170 ° C en un termómetro de azúcar (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente.) Con mucho cuidado, use una sartén profunda para evitar burbujear). Retire del fuego y sumerja la sartén en un fregadero de agua fría y deje que el caramelo se espese un poco.", "En una rejilla de refrigeración grande o en una superficie de trabajo, organice un círculo de catorce bollos de choux para que todos se toquen y coloque diez bollos de choux dentro del círculo, de modo que tenga dos círculos de bollos de choux. Con cuidado, sumerja un lado de cada bollo choux individualmente en el caramelo y pegue al bollo al lado. Continúa hasta que los dos círculos se unan.", "Sumerja la base de los restantes doce choux bollos en caramelo y péguelos encima de los círculos.", "Cubra una bandeja para hornear con papel de silicona. Regrese el caramelo al fuego y cocine a fuego lento, agregue una pequeña cantidad de pasta roja para colorear alimentos. Agregue las avellanas, revuelva bien y levante cada avellana y colóquela en la hoja preparada. Deja enfriar.", "Finalmente, rocíe la corona con un cuarto del ganache de chocolate. Transfiera a un plato de servir y decore con los copos de nieve de chocolate y las avellanas caramelizadas."], "url": "www_bbc_co_uk_food_recipes_marys_christmas_choux_11022", "title": "Guirnalda choux de Navidad de Mary", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_christmas_choux_11022_16x9.jpg", "isVegetarian": true, "recommendations": 0}]