[{"ingredients": ["1 cucharada de aceite de oliva", "3 lonjas de tocino, finamente picadas", "2 cebollas, peladas y picadas", "1 diente de ajo, picado", "2 cucharadas de harina normal", "1 lata de almejas en agua", "3 patatas grandes, picadas en cubos", "2 cucharadas de hojas de apio, picadas", "sal y pimienta negra recién molida", "1 hoja de laurel", "1 cucharada de mantequilla"], "method": ["Calentar el aceite de oliva en una sartén, agregar el tocino y freír durante 3-4 minutos, o hasta que estén crujientes. Retire de la sartén y reserve. Agregue las cebollas picadas y el ajo a la sartén y fría con cuidado durante 3-4 minutos, o hasta que estén suaves pero no coloreados.", "Regrese el tocino a la sartén, mezcle la harina lentamente y mezcle hasta que quede suave para formar un roux.", "Escurra las almejas, reservando el líquido. Coloque el líquido en una taza medidora y agregue suficiente agua para llevar la medida hasta 480 ml / 17 fl oz. Poco a poco agregue el líquido a la sartén con el tocino, revolviendo hasta que se espese.", "Agregue las papas, las hojas de apio picadas, sal y pimienta negra recién molida y laurel, deje hervir y cocine a fuego lento hasta que las papas estén tiernas. Si la sopa de pescado es demasiado espesa, adelgace con un poco de leche.", "Agregue las almejas y la mantequilla y el calor, revolviendo continuamente, durante 2-3 minutos, pero no permita que la mezcla hierva. Vierta en un tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_newenglandclamchowde_89058", "title": "Sopa de almejas de nueva Inglaterra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "200g / 7oz de patatas nuevas cocidas, descuartizadas", "100 g / 3½ oz de judías verdes, recortadas", "Aceitunas negras de 75 g / 2¾ oz, pozos eliminados, picados", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite y la mantequilla en una sartén y freír los cuartos de patata hasta que se doren.", "Agregue las judías verdes a la sartén y cocínelas durante 4-5 minutos, hasta que los frijoles estén tiernos.", "Agregue las aceitunas y la sal y pimienta negra recién molida. Sirve como guarnición."], "url": "www_bbc_co_uk_food_recipes_newpotatoeswithbeans_88617", "title": "Patatas nuevas con frijoles y aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Perilla de mantequilla", "1 cebolla, pelada, finamente picada", "2 palitos de apio, finamente picados", "2 hojas de laurel", "2 ramitas de tomillo fresco", "1kg / 2¼lbs almejas", "1 oreja de maíz dulce, granos cortados y reservados", "500ml / 17fl oz de caldo de pollo", "Papas rojas de 300 g / 10½ onzas, cortadas en trozos", "100 ml / 3½ fl oz de crema individual", "Puñado de perejil fresco, picado", "Sal y pimienta negra recién molida", "1 rebanada de pan de espelta", "1 limón, ralladura solamente", "1 cucharada de aceite de oliva", "2 ramitas de tomillo fresco", "Sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "4 rebanadas de tocino"], "method": ["Para la sopa, caliente el aceite y la mantequilla en una olla grande y fríe con cuidado la cebolla y el apio durante 6-8 minutos, o hasta que estén blandos. Agregue las hojas de laurel y el tomillo a la sartén.", "Mientras tanto, traiga 570 ml / 1 pinta de agua a fuego lento en otra olla grande. Agregue las almejas a la sartén, cubra con la tapa, ponga el fuego a fuego medio y deje hervir durante 2-3 minutos, o hasta que todas las conchas estén abiertas.", "Escurre las almejas, reservando el licor. Deseche cualquier almeja que no se haya abierto, luego retire la carne de almeja de las conchas y déjela a un lado.", "Agregue los granos de maíz dulce, licor de almejas y caldo de pollo a las cebollas, y cocine por 10-12 minutos, o hasta que el maíz esté suave.", "Agregue las papas y cocine por otros 8-10 minutos, o hasta que estén suaves, pero sin deshacerte.", "Agregue las almejas, la crema y el perejil, y cocine por 4-5 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para las migas de pan, pase el pan por las migas de pan en un procesador de alimentos (o desgarre aproximadamente con las manos). Calentar el aceite en una sartén a fuego medio-alto, y freír las migas de pan con la ralladura de limón y el tomillo durante 2-3 minutos, o hasta que estén doradas y crujientes. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la sopa en 4 tazones y espolvoree sobre las migas de tomillo. Caliente el aceite restante en una sartén y fríe las rebanadas de panceta durante 2-3 minutos por cada lado, o hasta que estén doradas y crujientes, y sirva encima de la sopa si lo desea."], "url": "www_bbc_co_uk_food_recipes_newenglandstyleclamc_93670", "title": "Sopa de almejas al estilo de Nueva Inglaterra con migas de pan de tomillo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas", "4 huevos de gallinas camperas, pasados ​​por agua y refrescados en agua fría", "Pan rallado panko japonés 200 g / 7¼ oz", "2 cucharadas de perejil fresco picado", "2 cucharadas de perifollo fresco picado", "2 cucharadas de estragón fresco picado", "aceite vegetal, para freír", "1kg / 2lb 3¼ oz de espárragos lanzas", "agua con hielo", "1 cucharada de jugo de limón fresco", "2 yemas de huevo de gallinas camperas", "750g / 1lb 10½ oz de mantequilla clarificada, derretida", "agua, según sea necesario"], "method": ["Para los huevos fritos, espolvoree la harina en un plato, bata los dos huevos crudos en un bol y espolvorea el pan rallado japonés, el perejil, el perifollo y el estragón (mezclados) en otro plato. Uno a la vez, drague los huevos pasados ​​por agua primero en la harina, luego sumérjalos en los huevos batidos y luego enróllalos en la mezcla de hierbas y pan rallado hasta que estén completamente cubiertos.", "Coloque cada huevo recubierto en una hoja de papel resistente a la grasa y deje enfriar en la nevera durante al menos una hora.", "Mientras tanto, para los espárragos, cocine los espárragos en agua hirviendo con sal durante 2-3 minutos. Escurrir bien y refrescar en agua helada.", "Para la salsa holandesa, hierva un poco de agua en una sartén y luego reduzca el fuego hasta que hierva a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue el jugo de limón y las yemas de huevo y bata continuamente durante 4-5 minutos, o hasta que la mezcla esté pálida y haya duplicado su volumen.", "Retire la mezcla de huevo y limón del fuego. Poco a poco agregue la mantequilla clarificada en una corriente delgada, batiendo continuamente, hasta que toda la mantequilla clarificada se incorpore a la mezcla.", "Agregue dos cucharadas de agua a la salsa holandesa si es necesario, para aflojar. Mantenga caliente hasta que esté listo para usar.", "Caliente el aceite en una freidora a 190C / 375F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje los huevos refrigerados y recubiertos en aceite caliente y fríalos durante 3-4 minutos, o hasta que estén crujientes y dorados. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, divida las lanzas de espárragos por igual entre cuatro platos para servir. Coloque un huevo crujiente encima de cada porción de espárragos. Rocíe la salsa holandesa alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_newseasonenglishaspa_91397", "title": "Espárragos ingleses con un huevo blando en crujientes migas de pan, holandesa y finas hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz o 4 x 150g / 5½oz de lomo de cordero deshuesado, cortado en grasa y piel plateada", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva ligero", "6 cucharadas de pan rallado fresco", "1 cucharadita de tomillo toscamente picado", "1 cucharada de perejil picado", "1 cucharada de mostaza Dijon fuerte y suave", "1 cucharada de mostaza Dijon integral", "300ml / 10fl oz buen caldo de cordero marrón, hecho de huesos y adornos", "pizca de hojas de tomillo", "1 cucharadita de perejil picado", "1 cucharadita de mostaza Dijon integral", "15g / ½ oz de mantequilla", "700g / 1lb 9oz de patatas nuevas, peladas", "85g / 3oz de mantequilla", "4 cebollas de primavera (llamadas cebolletas en Irlanda), finamente picadas", "pizca de sal", "aceite de oliva", "vegetales de temporada, blanqueados, como nuevas zanahorias, lechuga, habas y champiñones girolle", "sal y pimienta negra recién molida", "ramitas de perejil fresco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar el cordero con sal y pimienta negra recién molida. En una sartén pesada, caliente 3 cucharadas de aceite de oliva hasta que esté casi humeante. Agregue el cordero y cocine a fuego alto hasta que se dore por todas partes. Esto debería tomar alrededor de 5 minutos; el lomo de cordero todavía debería ser raro por dentro. Coloque sobre una rejilla y déjela enfriar a temperatura ambiente.", "Vierta el pan rallado en una bandeja para hornear y rocíe con el aceite de oliva restante. Mezcle suavemente con sus dedos. Poner en el horno y tostar las migas hasta que estén ligeramente doradas, revolviendo dos o tres veces. Cuando esté dorado, deje que se enfríe, luego agregue las hierbas.", "Para la salsa, reduzca el caldo de cordero hasta que tenga una consistencia de salsa ligera. Retirar del fuego y agregar las hierbas, la mostaza y la mantequilla. Verifica el condimento.", "Para preparar las patatas trituradas de cebollín, cocine las papas nuevas en agua hirviendo con sal hasta que estén tiernas, luego escurra. Derrita la mantequilla en una cacerola a fuego moderado, agregue las cebolletas y un poco de sal y cocine suavemente durante un minuto. Agregue las papas y triture suavemente con un tenedor. Mantener caliente", "Mientras las papas se cocinan, termine el cordero. Mezcle las dos mostazas juntas y cepille sobre la parte superior de cada lomo. Sumerja la parte del lomo recubierta de mostaza en las migas de pan y presione suavemente las migas sobre la mostaza. Establecer los lomos en una bandeja para hornear, con la miga hacia arriba.", "Coloque en la parte superior del horno y tueste durante 4-5 minutos por poco común, u 8 minutos por medio bien hecho. Retire del horno y deje reposar.", "Calentar un poco de aceite en una sartén y saltear las zanahorias blanqueadas, la lechuga y las habas con los girolles durante unos minutos. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, espolvorea las guarniciones de vegetales y algunas de las papas trituradas en las placas calentadas. Cortar el cordero, permitiendo tres rebanadas gruesas para cada persona, y colocar sobre las papas. Vierta la salsa y adorne con perejil fresco."], "url": "www_bbc_co_uk_food_recipes_newseasonlambwithahe_81981", "title": "Nueva temporada de cordero con una corteza de hierbas y mostaza y cebolleta aplastada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "2 pechugas de pollo grandes, deshuesadas y sin piel (aproximadamente 225 g / 8 oz cada una), picadas en un procesador de alimentos", "sal marina escamada y pimienta negra recién molida", "2 cucharadas de salsa de pescado", "1 lima, solo jugo", "1 cucharadita de echador, azúcar marrón claro granulado o suave", "3 cebolletas, finamente picadas", "¼ de pepino, finamente cortado en cubitos", "1-2 chiles rojos, finamente cortados, las semillas se quitan por menos calor si se prefiere", "1cm / ½ en pieza de jengibre fresco, pelado y finamente picado", "½ racimo de cilantro, hojas y tallos picados (aproximadamente 2 cucharadas)", "½ manojo de menta, solo hojas, rasgado", "1 puñado de cacahuetes salados (pero no tostados) (aproximadamente 50 g / 1¾ oz)", "12 hojas de lechuga iceberg crujientes y grandes (en forma de taza son las mejores)"], "method": ["Rocíe el aceite en una sartén grande a fuego alto. Agregue el pollo picado con sal y pimienta y cocine durante 4-5 minutos, revolviendo regularmente y separándolo mientras lo hace, hasta que cambie de rosa a blanco. Corte una pieza abierta para verificar que esté cocida y luego incline el pollo en un colador colocado sobre un recipiente. Deje que se enfríe durante cinco minutos (para que las hierbas no se marchiten) y, a la vez, permita que el exceso de líquido se drene, si es necesario.", "Vierta la salsa de pescado y el jugo de lima en un tazón grande y agregue el azúcar hasta que se disuelva. Agregue las cebollas de primavera, el pepino, el chile rojo, el jengibre, el cilantro, excepto un puñado de hojas de menta y los cacahuetes, y mezcle bien. Incline el pollo y tírelo. Pruébelo y verifique si necesita un poco más de lo que necesita para obtenerlo a su gusto.", "Coloque tres hojas de lechuga en cada una de las cuatro placas para servir y coloque un par de cucharadas de la mezcla en cada una. Esparce las hojas de menta restantes para adornar y servir. La mejor manera de comer estos es simplemente tomar una taza con las manos y morder."], "url": "www_bbc_co_uk_food_recipes_nice_and_spicy_thai_90314", "title": "Ensalada de pollo picada tailandesa agradable y picante (Larb Gai)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nice_and_spicy_thai_90314_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pepino, pelado, toscamente picado", "1 pimiento amarillo grande, sin semilla, más o menos picado", "1 pimiento rojo grande, sin semilla, más o menos picado", "6 tomates maduros, toscamente picados", "2 chalotes de plátano, toscamente picados", "3 dientes de ajo, toscamente picados", "100g / 3½oz de pan blanco rancio, empapado en un poco de agua fría", "3 cucharadas de aceite de oliva", "2 cucharadas de vinagre de jerez"], "method": ["Mezcle la mayoría de los pepinos, pimientos, tomates y chalotes en un puré en un procesador de alimentos, reservando un par de trozos de cada vegetal para la guarnición.", "Agregue el ajo, el pan remojado, el aceite de oliva y el vinagre de jerez al procesador de alimentos y vuelva a mezclar hasta que quede suave, o hasta obtener una consistencia más texturizada si lo desea.", "Transfiera la sopa a una jarra, cúbrala con film transparente y déjela enfriar durante al menos 20 minutos o hasta que esté fría.", "Corta las verduras reservadas en cubos pequeños. Cuando esté listo para servir, vierta el gazpacho en tazones y adorne con las verduras."], "url": "www_bbc_co_uk_food_recipes_nigel_slaters_gazpacho_92126", "title": "Gazpacho de Nigel Slater", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigel_slaters_gazpacho_92126_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 chuletas de cordero, que pesan aproximadamente 500 g / 1 lb 2 oz en total", "3 cucharadas de aceite de oliva", "1 zanahoria grande, más o menos picada", "1 tallo de apio, cortado, toscamente picado", "1 cebolla grande, más o menos picada", "2 cucharadas de harina normal", "1 litro / 1¾ pintas de caldo de carne", "8 ramitas de tomillo fresco", "1 hoja de laurel", "100 g / 3½ oz de mantequilla, derretida", "2 patatas grandes harinosas, como Maris Piper, cortadas en discos de 1cm / ½ pulgada de espesor", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a un ventilador 170C / 150C / Gas 3.", "Sazone las chuletas de cordero con abundante sal y pimienta negra recién molida. Calentar el aceite en una sartén a fuego medio, luego freír las chuletas de cordero durante 2-3 minutos en cada lado, o hasta que se dore por todas partes. Transfiera las chuletas de cordero a una cazuela mediana.", "Freír la zanahoria, el apio y la cebolla en la misma sartén durante 4-5 minutos, o hasta que estén coloreados y suavizados.", "Revuelva la harina en las verduras y continúe freír durante 2-3 minutos, o hasta que la harina se convierta en un color de galleta.", "Vierta el caldo de carne y mezcle bien hasta que el líquido se haya espesado y no haya grumos visibles de harina.", "Transfiera las verduras y el caldo espesado a la cazuela. Agregue 7 ramitas de tomillo y la hoja de laurel, luego lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Derrita la mantequilla en una cacerola pequeña a fuego medio.", "Coloque las rodajas de patata encima del caldero, superponiendo ligeramente los bordes. Cepille las rodajas de patata con la mantequilla derretida. Espolvoree la parte superior con unas hojas de tomillo de la ramita restante de tomillo.", "Hornee el caldo en el horno durante 1-1½ horas o hasta que el relleno de papa quede crujiente y dorado y las verduras estén blandas."], "url": "www_bbc_co_uk_food_recipes_nigel_slaters_lancashire_48954", "title": "El caldo de Lancashire de Nigel Slater", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigel_slaters_lancashire_48954_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina integral 225g / 8oz", "Harina normal 225g / 8oz", "½ cucharadita de sal marina", "1 cucharadita de azúcar en polvo", "1 cucharadita de bicarbonato de soda", "350ml / 12fl oz de suero de leche"], "method": ["Precaliente el horno a 220C / 425F / Gas 8. Coloque una fuente grande y su tapa en el horno.", "En un tazón grande, mezcle las harinas, sal marina, azúcar y bicarbonato de soda junto con los dedos. Vierta el suero de leche, juntando la mezcla como una masa suave. Trabajando rápidamente (el bicarbonato de soda comenzará a funcionar inmediatamente), dé forma a la masa en un pan redondo y poco profundo de unos 4 cm / 1½ pulgadas de grosor.", "Retire la cazuela caliente del horno, espolvoree el interior ligeramente con harina y luego baje la masa. Cubra con la tapa y vuelva al horno.", "El pan debe estar listo después de 25 minutos. Retire del horno y deje en su lugar durante 5 minutos antes de apagar y dejar enfriar un poco antes de comer. (El pan de soda se come mejor tibio)."], "url": "www_bbc_co_uk_food_recipes_nigels_lazy_loaf_71344", "title": "Pan perezoso de Nigel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 pan de tamaño mediano", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigels_lazy_loaf_71344_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas", "2 zanahorias", "2 cucharadas de aceite de oliva, más extra para lloviznar", "3-4 tomates maduros", "1 hoja de laurel", "unos pocos puñados grandes de frijoles cannellini precocinados", "caldo de verduras", "unas rodajas de cáscara de naranja", "1 corteza de parmesano, o alternativa vegetariana, opcional", "sal y pimienta negra recién molida", "1 puñado de tallos de acelga (y hojas si es joven)", "perejil fresco, picado", "Palo francés, para servir"], "method": ["Corta bastante las cebollas y las zanahorias. Caliente un poco de aceite de oliva en una sartén grande a fuego lento y agregue las cebollas y las zanahorias. Picar los tomates y agregarlos a la sartén con una hoja de laurel. Agregue los frijoles cannellini, seguido del caldo de verduras, suficiente para cubrir. Me gusta agregar un par de trozos de cáscara de naranja en esta etapa, seguido de la cáscara de parmesano.", "Sazone generosamente con sal y pimienta negra recién molida y deje que la sopa burbujee. Picar los tallos de acelga y agregar al líquido. (Puede usar cualquier otra verdura que desee). Agregue abundante perejil picado y luego agregue las hojas de acelga. Servir con un palo francés tostado o chapata y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_nigelsadaptablebeans_92230", "title": "Sopa de frijoles adaptable", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigelsadaptablebeans_92230_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 tallos de limoncillo, hojas externas más duras descartadas", "6 chiles verdes medianamente picantes, sin semillas y picados", "3 dientes de ajo, pelados y triturados", "5cm / 2in pieza de galangal o jengibre, pelado y picado", "2 chalotes, pelados y finamente picados", "4 cucharadas de cilantro fresco picado", "1 cucharadita de comino molido", "1 cucharadita de ralladura de lima picado", "1 cucharada de nam pla (salsa de pescado tailandés)", "½ cucharadita de pimienta negra molida", "750g / 1lb 10oz de pechugas o muslos de pollo de corral, huesos extraídos", "3 cucharadas de aceite de cacahuete", "200g / 7oz de setas de castaña, descuartizado", "Leche de coco de la lata 400ml / 14fl oz", "400ml / 14 fl oz de caldo de pollo hecho en casa o listo", "8 hojas de lima", "1 cucharada de nam pla (salsa de pescado tailandés)", "1 cucharada de granos de pimienta verde embotellados, escurridos", "hojas de un gran manojo (aproximadamente 20 g / 0.7 oz) de albahaca, rallado", "15 cd / ½ oz de cilantro fresco (hojas y tallos,) toscamente picados"], "method": ["Para la pasta de curry, corta la hierba de limón finamente. Póngalo en un procesador de alimentos con todos los ingredientes restantes de la pasta de curry y muévalo hasta obtener una pasta espesa, empujando la mezcla hacia abajo de vez en cuando con una espátula. Transfiera a un plato de vidrio o porcelana, cubra bien (de lo contrario manchará todo en el refrigerador) y refrigere.", "Para el curry, corte el pollo en tiras gruesas con los dedos.", "Caliente el aceite en una cacerola y, cuando esté caliente y chisporroteando, agregue las tiras de pollo y deje que se coloreen ligeramente por todos lados. Tendrá que hacer esto en lotes para evitar llenar la sartén.", "Retire las piezas de pollo cocidas de la cazuela con una cuchara ranurada. Agregue los champiñones en cuartos a la cazuela y fría hasta que estén dorados, agregando más aceite si es necesario.", "Vierta la leche de coco y el caldo, luego agregue las hojas de lima, cuatro cucharadas colmadas de la pasta de curry, la salsa de pescado, los granos de pimienta y la mitad de las hierbas picadas. Llevar a ebullición, luego baje la temperatura y cocine a fuego lento durante 10 minutos, revolviendo de vez en cuando.", "Regrese el pollo a la cazuela con una cucharada adicional de la pasta y cocine a fuego lento de cinco a seis minutos, o hasta que el pollo esté bien cocido. Agregue la última de las hierbas y sirva."], "url": "www_bbc_co_uk_food_recipes_nigelslatersthaigree_80244", "title": "Curry verde tailandés de Nigel Slater", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigelslatersthaigree_80244_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 450g / 1lb", "50g / 1¾oz de azúcar glas", "1 cucharadita de agua de rosas", "pellizque los filamentos de azafrán, empapados en 100ml / 3½fl oz de leche tibia durante 15 minutos", "pocos pistachos picados y hojas de plata comestibles (opcional)"], "method": ["Batir la crema en un bol hasta que comiencen a formarse suaves picos; es importante no batirla demasiado.", "Tamice el azúcar glas, luego agregue el agua de rosas y la leche y cordones de azafrán ahora frescos. Batir durante un minuto hasta que quede suave y aparezcan algunas burbujas en la superficie. Vierta suavemente en tazones pequeños o vasos y deje enfriar durante la noche.", "Decora con rodajas de pistachos y hojas de plata si quieres. Servir."], "url": "www_bbc_co_uk_food_recipes_nimish_76724", "title": "Nimish", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jengibre de raíz de 4 cm / 1½ en pieza, pelado y picado", "2 chiles verdes frescos, toscamente picados", "600g / 1lb 6oz de guisantes congelados", "3 cucharadas de aceite de colza, más extra para engrasar", "1 cucharadita de semillas de mostaza", "1¼ cucharadita de canela molida", "1¼ cucharadita de sal masala", "½ cucharadita de cúrcuma molida", "1 cucharadita de sal", "½ cucharadita de chile en polvo", "300g / 10½ oz de harina natural, más extra para espolvorear", "½ cucharadita de sal", "2 cucharadas de aceite de colza, más extra para engrasar", "175ml / 6fl oz de agua caliente"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase ligeramente una bandeja para hornear con un poco de aceite.", "Para el relleno, mezcle el jengibre y los chiles verdes en una pasta en un procesador de alimentos, luego retírelos del procesador de alimentos y déjelos a un lado.", "Mezcle los guisantes en el procesador de alimentos (no hay necesidad de lavar el recipiente). Eliminar y reservar.", "Caliente el aceite en una sartén tapada a fuego medio. Agregue las semillas de mostaza y fría, cubiertas con la tapa, hasta que empiecen a reventar. Tenga cuidado de mantener sus ojos y cara lejos de la sartén.", "Agregue la pasta de jengibre y chili y saltee durante 1-2 minutos. Agregue el puré de guisantes y continúe freír, revolviendo bien, durante 4-5 minutos más.", "Agregue la canela, el garam masala, la cúrcuma, la sal y el chile en polvo y fría por otros 2-3 minutos, o hasta que haya poca o nada de humedad en la sartén, pero los guisantes siguen siendo de color verde brillante. Transfiera el contenido de la sartén a un recipiente y reserve.", "Para la masa, coloque la harina en un tazón y haga un pozo en el centro. Agregue la sal y el aceite al pozo, luego frote la mezcla con las puntas de los dedos hasta que se asemeje a migas de pan finas.", "Vierta 120ml / 4fl oz del agua y mezcle la mezcla hasta que quede como una masa. Poco a poco agregue el agua restante, amasándola en la masa hasta que se sienta firme y flexible. Haga rodar la masa en forma de bola, luego frote sus manos con una cucharadita de aceite y déle palmaditas a la masa para cubrirla con el aceite, esto lo mantendrá húmedo.", "Pellizque pedazos de masa del tamaño de un albaricoque y enrolle cada pieza en un círculo de 10 cm en una superficie de trabajo ligeramente enharinada.", "Coloque 1 cucharadita llena de la mezcla de relleno en el medio de cada círculo de repostería y coloque los bordes de la masa con fuerza alrededor de los guisantes. Selle en la parte superior al pellizcar los bordes y recortar cualquier exceso de masa. Enrolle cada paquete en una bola y colóquelo en la bandeja de horno preparada.", "Gire suavemente las bolas de kachori en el horno para cubrirlas con aceite. Hornee durante 20-30 minutos, o hasta que la masa esté dorada."], "url": "www_bbc_co_uk_food_recipes_nita_and_meeras_pea_78947", "title": "Pai Kachori", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 10-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nita_and_meeras_pea_78947_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, separados", "100 g / 3½ oz de azúcar en polvo", "Crema doble de 300 ml / ½ pinta", "1 cucharadita de extracto de vainilla", "Jengibre de tallo de 100 g / 3½ oz, picado, más 4 cucharadas de jarabe del tarro", "2-3 cucharadas de esencia de café", "2 cucharadas de aguardiente", "Puré de frambuesa tamizado 150ml / 5fl oz (también puede usar fresa)", "100 g / 3½ oz de pasas empapadas en 4 cucharadas de ron durante 2 horas"], "method": ["Batir las claras de huevo en un tazón grande hasta que se formen picos rígidos cuando se quite el batidor.", "Bata lentamente el azúcar impalpable, luego continúa batiendo hasta que las claras de huevo estén firmes y brillantes.", "Batir la crema en un recipiente aparte hasta que se formen picos suaves cuando se quite la batidora.", "Dobla la crema, las yemas de huevo y el saborizante que elijas (ver la lista de ingredientes) en la mezcla de merengue hasta que estén bien combinados.", "Vierta en un recipiente de plástico y congele durante al menos dos horas."], "url": "www_bbc_co_uk_food_recipes_no-churn_ice_cream_72012", "title": "Helado sin mantequera", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/no-churn_ice_cream_72012_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1 huevo de gallinas camperas", "150 g / 5½ oz de ricotta", "25 g / 1 oz de puerro, finamente cortado", "1 tocino grande cocinado en lonchas, picado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase seis orificios de una bandeja para muffins con aceite vegetal.", "Batir el huevo y la ricota juntos en un bol hasta que quede suave. Agregue el puerro y el tocino.", "Divida la mezcla entre los agujeros del panecillo y hornee en el horno durante 30 minutos o hasta que esté recién cocido."], "url": "www_bbc_co_uk_food_recipes_no_pastry_pie_88935", "title": "Sin pastel salado de repostería", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de margarina sin lácteos", "75g / 2½oz de azúcar mascabado pálido, o al gusto", "4 cucharadas de aguardiente, o al gusto"], "method": ["Batir la margarina con el azúcar hasta que esté suave y esponjosa.", "Agregue el brandy al gusto."], "url": "www_bbc_co_uk_food_recipes_nobutterbrandybutter_77294", "title": "Mantequilla de brandy sin mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para un pudin", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pequeño racimo de tomates en la vid", "azúcar glas, al polvo", "30g / 1oz de mantequilla", "1 suela de filete", "½ guindilla, semillas retiradas y picadas", "1 cucharadita de alcaparras", "1 cucharada de perejil picado, menta y eneldo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los tomates en una bandeja para hornear, espolvoree con azúcar glas y coloque en el horno para asar durante diez minutos, hasta que comiencen a colapsar.", "Para la suela, caliente la mantequilla en una sartén a fuego alto. Cuando haga espuma, agregue el pescado y fríalos hasta que estén cocidos, aproximadamente 2-3 minutos de cada lado. Levante el pescado y manténgalo caliente.", "Agregue los chiles, las alcaparras y las hierbas a la sartén y caliente.", "Para servir, coloque el pescado en un plato para servir y rocíe las hierbas sobre el pescado y sirva con los tomates tostados."], "url": "www_bbc_co_uk_food_recipes_noisettesofsolewithc_84482", "title": "Filete de lenguado con alcaparras, chiles, hierbas y tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "6 floretes de brócoli de tallo largo", "4 cebolletas, picadas", "½ mango, pelado y rebanado", "Fideos de huevo de 110 g / 4 oz, cocinados según las instrucciones del paquete", "¼ de chile con bonete escocés, finamente picado", "2 cucharadas de hierbas frescas picadas", "1 cucharada de aceite de oliva"], "method": ["Caliente dos cucharadas de aceite de oliva en una sartén antiadherente grande. Agregue los brotes de brócoli y saltee durante 3-4 minutos, para suavizar.", "Agregue las cebolletas y saltee durante 1-2 minutos más.", "Agregue las rodajas de mango y luego agregue los fideos cocidos.", "Agregue la guindilla y continúe revolviendo por 3-4 minutos más.", "Finalmente agregue las hierbas con una cucharada de aceite de oliva. Caliente por otro minuto y transfiéralo a un plato para servir."], "url": "www_bbc_co_uk_food_recipes_noodleandbroccolisti_79028", "title": "Fideos y brócoli salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de caldo de pollo o vegetal", "½ un chiles con bonete escocés", "25 ml / 1 onza de vino blanco", "2 brotes de bambú, en rodajas finas", "2 cebollas de primavera, en rodajas finas", "3 cucharadas de salsa de soja", "2 cucharadas de miel", "Fideos de arroz 100 g / 3½ oz, cocidos", "1 lima, solo jugo"], "method": ["Coloque el caldo de pollo o vegetales en una sartén con el chile, el vino, los brotes de bambú, las cebollas tiernas, la salsa de soja y la miel y cocine a fuego lento durante cinco minutos.", "Agregue los fideos y termine con un chorrito de jugo de lima y sirva."], "url": "www_bbc_co_uk_food_recipes_noodlebroth_77706", "title": "Caldo de fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de pollo caliente o caldo de verduras", "1 pomo pequeño de jengibre, cortado en juliana", "1 cucharada de cebolla tierna, rallada", "1 cucharada de aceite de sésamo", "1 cucharada de salsa de soja", "50g / 1¾oz de tofu firme, en cubos", "50g / 1¾oz de fideos de arroz", "1 cucharada de cilantro picado"], "method": ["Llevar el caldo a fuego lento en una olla pequeña.", "Agregue el jengibre, la cebolla tierna, el aceite de sésamo y la salsa de soja y revuelva.", "Agregue el tofu y los fideos y la mitad del cilantro. Retire del fuego.", "Deje que pasen cinco minutos para cocinar.", "Para servir, vierta en un recipiente y espolvoree con el cilantro restante."], "url": "www_bbc_co_uk_food_recipes_noodlebroth_80052", "title": "Caldo de fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]